{
  "doi": "10.1145/3290605.3300752",
  "title": "I'm a Giant: Walking in Large Virtual Environments at High Speed Gains",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Advances in tracking technology and wireless headsets enable walking as a means of locomotion in Virtual Reality. When exploring virtual environments larger than room-scale, it is often desirable to increase users' perceived walking speed, for which we investigate three methods. (1) Ground-Level Scaling increases users' avatar size, allowing them to walk farther. (2) Eye-Level Scaling enables users to walk through a World in Miniature, while maintaining a street-level view. (3) Seven-League Boots amplifies users' movements along their walking path. We conduct a study comparing these methods and find that users feel most embodied using Ground-Level Scaling and consequently increase their stride length. Using Seven-League Boots, unlike the other two methods, diminishes positional accuracy at high gains, and users modify their walking behavior to compensate for the lack of control. We conclude with a discussion on each technique's strength and weaknesses and the types of situation they might be appropriate for.",
  "tags": [
    "locomotion",
    "translationalgain",
    "body scale",
    "world in miniuature",
    "walking speed",
    "seven-league boots",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Parastoo Abtahi",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-99659201541/rel-imgonly/another_try.png",
      "acmid": "99659201541",
      "orcid": "missing"
    },
    {
      "name": "Mar Gonzalez-Franco",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81501685129",
      "orcid": "0000-0001-6165-4495"
    },
    {
      "name": "Eyal Ofek",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100064088/rel-imgonly/fn5a3383_small.jpg",
      "acmid": "81100064088",
      "orcid": "0000-0003-4750-1569"
    },
    {
      "name": "Anthony Steed",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100501447",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Felipe Bacimn. 2009. Wayfinding Techniques for Multiscale Virtual Environments. Master's thesis. Pontifical Catholic University of Rio Grande do Sul.",
      "doi": ""
    },
    {
      "text": "Stacy A Balk, Anne Bertola, and Vaughan W Inman. 2013. Simulator Sickness Questionnaire: Twenty Years Later. In 7th International Driving Symposium on Human Factors in Driver Assessment, Training, and Vehicle Design. 257--263.",
      "doi": ""
    },
    {
      "text": "Ryan Bane and Tobias Hollerer. 2004. Interactive Tools for Virtual X-Ray Vision in Mobile Augmented Reality. In Proceedings of the 3rd IEEE/ACM International Symposium on Mixed and Augmented Reality (ISMAR '04). IEEE Computer Society, Washington, DC, USA, 231--239.  ",
      "doi": "10.1109/ISMAR.2004.36"
    },
    {
      "text": "Christopher C Berger, Mar Gonzalez-Franco, Eyal Ofek, and Ken Hinckley. 2018. The uncanny valley of haptics. Science Robotics 3, 17 (April 2018).",
      "doi": ""
    },
    {
      "text": "Benjamin Bolte, Frank Steinicke, and Gerd Bruder. 2011. The jumper metaphor: an effective navigation technique for immersive display setups. In Proceedings of Virtual Reality International Conference. 1--7.",
      "doi": ""
    },
    {
      "text": "Adrian W. Bowman and Adelchi Azzalini. 2010. R Package 'sm': Nonparametric Smoothing Methods (Version 2.2--4). http://www.stats.gla.ac.uk/~adrian/sm/.",
      "doi": ""
    },
    {
      "text": "Evren Bozgeyikli, Andrew Raij, Srinivas Katkoori, and Rajiv Dubey. 2016. Point & Teleport Locomotion Technique for Virtual Reality. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, New York, NY, USA, 205--216.  ",
      "doi": "10.1145/2967934.2968105"
    },
    {
      "text": "Rudolph P. Darken, William R. Cockayne, and David Carmein. 1997. The Omni-directional Treadmill: A Locomotion Device for Virtual Worlds. In Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology (UIST '97). ACM, New York, NY, USA, 213--221.  ",
      "doi": "10.1145/263407.263550"
    },
    {
      "text": "Osvaldo Gervasi, Antonio Riganelli, Leonardo Pacifici, and Antonio Lagana. 2004. VMSLab-G: a virtual laboratory prototype for molecular science on the Grid. Future Generation Computer Systems 20, 5 (2004), 717--726.  ",
      "doi": "10.1016/j.future.2003.11.015"
    },
    {
      "text": "Mar Gonzalez-Franco and Jaron Lanier. 2017. Model of Illusions and Virtual Reality.",
      "doi": ""
    },
    {
      "text": "Mar Gonzalez-Franco and Tabitha C. Peck. 2018. Avatar Embodiment. Towards a Standardized Questionnaire. Frontiers in Robotics and AI 5 (June 2018), 74.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASATLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139--183.",
      "doi": ""
    },
    {
      "text": "Victoria Interrante, Lee Anderson, Brian Ries, Eleanor O'Rourke, and Leanne Gray. 2007. Experimental Investigations into the Feasibility of Using Augmented Walking to Facilitate the Intuitive Exploration of Large Scale Immersive Virtual Environments. In Proceedings of the 4th Symposium on Applied Perception in Graphics and Visualization (APGV '07). ACM, New York, NY, USA, 144--144.  ",
      "doi": "10.1145/1272582.1272621"
    },
    {
      "text": "Victoria Interrante, Brian Ries, and Lee Anderson. 2007. Seven League Boots: A New Metaphor for Augmented Locomotion through Moderately Large Scale Immersive Virtual Environments. In 2007 IEEE Symposium on 3D User Interfaces(3DUI).",
      "doi": ""
    },
    {
      "text": "Jason Jerald, Paul Mlyniec, Arun Yoganandan, Amir Rubin, Dan Paullus, and Simon Solotko. 2013. MakeVR: A 3D world-building interface. In 2013 IEEE Symposium on 3D User Interfaces (3DUI). 197-- 198.",
      "doi": ""
    },
    {
      "text": "Ian T Jolliffe. 1986. Principal Component Analysis and Factor Analysis. In Principal component analysis. Springer, 115--128.",
      "doi": ""
    },
    {
      "text": "Robert S. Kennedy, Norman E. Lane, Kevin S. Berbaum, and Michael G Lilienthal. 1993. Simulator Sickness Questionnaire: An Enhanced Method for Quantifying Simulator Sickness. The International Journal of Aviation Psychology 3, 3 (1993), 203--220.",
      "doi": "10.1207/s15327108ijap0303_3"
    },
    {
      "text": "Regis Kopper, Tao Ni, Doug A. Bowman, and Marcio Pinho. 2006. Design and Evaluation of Navigation Techniques for Multiscale Virtual Environments. In Proceedings of the IEEE Conference on Virtual Reality (VR '06). IEEE Computer Society, Washington, DC, USA, 175--182.  ",
      "doi": "10.1109/VR.2006.47"
    },
    {
      "text": "Andrey Krekhov, Sebastian Cmentowski, Katharina Emmerich, Maic Masuch, and Jens Krüger. 2018. GulliVR: A Walking-Oriented Technique for Navigation in Virtual Reality Games Based on Virtual Body Resizing. In Proceedings of the 2018 Annual Symposium on ComputerHuman Interaction in Play (CHI PLAY '18). ACM, New York, NY, USA, 243--256. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk Abtahi et al.  ",
      "doi": "10.1145/3242671.3242704"
    },
    {
      "text": "Eike Langbehn, Gerd Bruder, and Frank Steinicke. 2016. Scale matters! Analysis of dominant scale estimation in the presence of conflicting cues in multi-scale collaborative virtual environments. In 3D User Interfaces (3DUI), 2016 IEEE Symposium on. IEEE, 211--220.",
      "doi": ""
    },
    {
      "text": "Joseph J. LaViola, Jr., Daniel Acevedo Feliz, Daniel F. Keefe, and Robert C. Zeleznik. 2001. Hands-free Multi-scale Navigation in Virtual Environments. In Proceedings of the 2001 Symposium on Interactive 3D Graphics (I3D '01). ACM, New York, NY, USA, 9--15.  ",
      "doi": "10.1145/364338.364339"
    },
    {
      "text": "Niels Christian Nilsson. 2015. Walking Without Moving: An exploration of factors influencing the perceived naturalness of Walking-in-Place techniques for locomotion in virtual environments. Ph.D. Dissertation. Aalborg Universitetsforlag.",
      "doi": ""
    },
    {
      "text": "Niels Christian Nilsson, Stefania Serafin, and Rolf Nordahl. 2016. Walking in Place Through Virtual Worlds. In Human-Computer Interaction. Interaction Platforms and Techniques, Masaaki Kurosu (Ed.). SpringerVerlag Berlin, Heidelberg, 37--48.  ",
      "doi": "10.1007/978-3-319-39516-6_4"
    },
    {
      "text": "Nintendo. 2018. Nintendo Labo. https://labo.nintendo.com/.",
      "doi": ""
    },
    {
      "text": "Randy Pausch, Tommy Burnette, Dan Brockway, and Michael E. Weiblen. 1995. Navigation and Locomotion in Virtual Worlds via Flight into Hand-held Miniatures. In Proceedings of the 22nd Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '95). ACM, New York, NY, USA, 399--400.  ",
      "doi": "10.1145/218380.218495"
    },
    {
      "text": "Sharif Razzaque, Zachariah Kohn, and Mary C Whitton. 2001. Redirected walking. In Proceedings of EUROGRAPHICS, Vol. 9. 105--106.",
      "doi": ""
    },
    {
      "text": "Frank Steinicke, Grad Bruder, Joson Jerald, Harald Frenz, and Markus Lappe. 2010. Estimation of Detection Thresholds for Redirected Walking Techniques. IEEE Transactions on Visualization and Computer Graphics 16, 1 (January 2010), 17--27.  ",
      "doi": "10.1109/TVCG.2009.62"
    },
    {
      "text": "Frank Steinicke, Gerd Bruder, Jason Jerald, Harald Frenz, and Markus Lappe. 2010. Estimation of Detection Thresholds for Redirected Walking Techniques. IEEE Transactions on Visualization and Computer Graphics 16, 1 (January 2010), 17--27.  ",
      "doi": "10.1109/TVCG.2009.62"
    },
    {
      "text": "Richard Stoakley, Matthew J. Conway, and Randy Pausch. 1995. Virtual Reality on a WIM: Interactive Worlds in Miniature. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 265--272.  ",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Qi Sun, Li-Yi Wei, and Arie Kaufman. 2016. Mapping Virtual and Physical Reality. ACM Trans. Graph. 35, 4, Article 64 (July 2016), 12 pages.  ",
      "doi": "10.1145/2897824.2925883"
    },
    {
      "text": "TPCAST. 2018. TPCAST Wireless Adapter. https://www.tpcastvr.com/product-vive.",
      "doi": ""
    },
    {
      "text": "Vive. 2018. HTC Vive. https://www.vive.com/us/.",
      "doi": ""
    },
    {
      "text": "Zachary Wartell, William Ribarsky, and Larry Hodges. 1999. Thirdperson navigation of whole-planet terrain in a head-tracked stereoscopic environment. In Proceedings IEEE Virtual Reality. 141--148. ",
      "doi": "10.5555/554230.835729"
    },
    {
      "text": "Betsy Williams, Gayathri Narasimham, Tim P. McNamara, Thomas H. Carr, John J. Rieser, and Bobby Bodenheimer. 2006. Updating Orientation in Large Virtual Environments Using Scaled Translational Gain. In Proceedings of the 3rd Symposium on Applied Perception in Graphics and Visualization (APGV '06). ACM, New York, NY, USA, 21--28.  ",
      "doi": "10.1145/1140491.1140495"
    },
    {
      "text": "Graham Wilson, Mark McGill, Matthew Jamieson, Julie R. Williamson, and Stephen A. Brewster. 2018. Object Manipulation in Virtual Reality Under Increasing Levels of Translational Gain. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 99, 13 pages.  ",
      "doi": "10.1145/3173574.3173673"
    },
    {
      "text": "Xiaolong (Luke) Zhang. 2009. Multiscale traveling: crossing the boundary between space and scale. Virtual Reality 13, 2 (25 March 2009), 101. ",
      "doi": "10.5555/1554521.1554524"
    }
  ]
}