{
  "doi": "10.1145/3290605.3300621",
  "title": "Crowdworker Economics in the Gig Economy",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2019,
  "badges": [],
  "abstract": "The nature of work is changing. As labor increasingly trends to casual work in the emerging gig economy, understanding the broader economic context is crucial to effective engagement with a contingent workforce. Crowdsourcing represents an early manifestation of this fluid, laisser-faire, on-demand workforce. This work analyzes the results of four large-scale surveys of US-based Amazon Mechanical Turk workers recorded over a six-year period, providing comparable measures to national statistics. Our results show that despite unemployment far higher than national levels, crowdworkers are seeing positive shifts in employment status and household income. Our most recent surveys indicate a trend away from full-time-equivalent crowdwork, coupled with a reduction in estimated poverty levels to below national figures. These trends are indicative of an increasingly flexible workforce, able to maximize their opportunities in a rapidly changing national labor market, which may have material impacts on existing models of crowdworker behavior.",
  "authors": [
    {
      "name": "Jason T. Jacques",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658722807",
      "orcid": "missing"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    }
  ],
  "references": [
    {
      "text": "Antonio Aloisi. 2015. Commoditized Workers: Case Study Research on Labor Law Issues Arising from a Set of on-Demand/Gig Economy Platforms. Comparative Labor Law & Policy Journal 37 (2015), 653--690. https://heinonline.org/HOL/P?h=hein.journals/cllpj37&i=689",
      "doi": ""
    },
    {
      "text": "Amazon. 2012. Amazon Mechanical Turk - Participation Agreement. https://www.mturk.com/mturk/conditionsofuse.",
      "doi": ""
    },
    {
      "text": "Wiji Arulampalam and Mark B. Stewart. 1995. The Determinants of Individual Unemployment Durations in an Era of High Unemployment. The Economic Journal 105, 429 (1995), 321--332.",
      "doi": ""
    },
    {
      "text": "Benjamin B. Bederson and Alexander J. Quinn. 2011. Web Workers Unite! Addressing Challenges of Online Laborers. In Extended Abstracts of the 29th ACM Conference on Human Factors in Computing Systems (CHI EA '11). ACM, 97--106.  ",
      "doi": "10.1145/1979742.1979606"
    },
    {
      "text": "Janine Berg, Marianne Furrer, Ellie Harmon, Uma Rani, and M. Six Silberman. 2018. Digital Labour Platforms and the Future of Work: Towards Decent Work in the Online World. Report. International Labour Organization, Switzerland.",
      "doi": ""
    },
    {
      "text": "Michael S. Bernstein, Joel Brandt, Robert C. Miller, and David R. Karger. 2011. Crowds in Two Seconds: Enabling Realtime Crowd-Powered Interfaces. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, 33--42.  ",
      "doi": "10.1145/2047196.2047201"
    },
    {
      "text": "Michael S. Bernstein, Greg Little, Robert C. Miller, Björn Hartmann, Mark S. Ackerman, David R. Karger, David Crowell, and Katrina Panovich. 2010. Soylent: A Word Processor with a Crowd Inside. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Dana Chandler and Adam Kapelner. 2013. Breaking Monotony with Meaning: Motivation in Crowdsourcing Markets. Journal of Economic Behavior & Organization 90 (June 2013), 123--133.",
      "doi": ""
    },
    {
      "text": "David L. Chen and William B. Dolan. 2011. Building a Persistent Workforce on Mechanical Turk for Multilingual Data Collection. In Proceedings of the 3rd Human Computation Workshop (HCOMP 2011). http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.636.4434",
      "doi": ""
    },
    {
      "text": "Valerio De Stefano. 2016. The Rise of the 'Just-in-Time Workforce': On-Demand Work, Crowd Work and Labour Protection in the 'GigEconomy'. 37, 3 (2016). https://cllpj.law.illinois.edu/archive/vol_37/ download?id=651",
      "doi": ""
    },
    {
      "text": "Djellel Difallah, Elena Filatova, and Panos Ipeirotis. 2018. Demographics and Dynamics of Mechanical Turk Workers. In Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining (WSDM '18). ACM, New York, NY, USA, 135--143.  ",
      "doi": "10.1145/3159652.3159661"
    },
    {
      "text": "Megan Dunn. 2018. Who Chooses Part-Time Work and Why? : Monthly Labor Review: U.S. Bureau of Labor Statistics. https://www.bls.gov/opub/mlr/2018/article/who-chooses-parttime-work-and-why.htm#BLS_table.",
      "doi": ""
    },
    {
      "text": "Alek Felstiner. 2011. Working the Crowd: Employment and Labor Law in the Crowdsourcing Industry. Berkeley Journal of Employment and Labor Law 32, 1 (Aug. 2011), 143--204. http://ssrn.com/abstract=",
      "doi": ""
    },
    {
      "text": "Kayla Fontenot, Jessica Semega, and Melissa Kollar. 2018. Income and Poverty in the United States: 2017. U.S. Census Bureau Current Population Reports (2018). https://www.census.gov/content/dam/Census/ library/publications/2018/demo/p60--263.pdf",
      "doi": ""
    },
    {
      "text": "Gerald Friedman. 2014. Workers without Employers: Shadow Corporations and the Rise of the Gig Economy. Review of Keynesian Economics 2, 2 (April 2014), 171--188.",
      "doi": ""
    },
    {
      "text": "Kotaro Hara, Abigail Adams, Kristy Milland, Saiph Savage, Chris Callison-Burch, and Jeffrey P. Bigham. 2018. A Data-Driven Analysis of Workers' Earnings on Amazon Mechanical Turk. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 449:1--449:14.  ",
      "doi": "10.1145/3173574.3174023"
    },
    {
      "text": "Von Hippel, Paul T, David J. Hunter, and McKalie Drown. 2017. Better Estimates from Binned Income Data: Interpolated CDFs and MeanMatching. Sociological Science 4 (Nov. 2017), 641--655.",
      "doi": ""
    },
    {
      "text": "Charles Hokayem and Misty L. Heggeness. 2014. Living in Near Poverty in the United States: 1966--2012. (May 2014). https://www. census.gov/library/publications/2014/demo/p60--248.html",
      "doi": ""
    },
    {
      "text": "John Joseph Horton and Lydia B. Chilton. 2010. The Labor Economics of Paid Crowdsourcing. In Proceedings of the 11th ACM Conference on Electronic Commerce (EC '10). ACM, 209--218.  ",
      "doi": "10.1145/1807342.1807376"
    },
    {
      "text": "Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing User Studies with Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2008). ACM, 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Kristine M. Kuhn. 2016. The Rise of the \"Gig Economy\" and Implications for Understanding Work and Workers. Industrial and Organizational Psychology 9, 1 (March 2016), 157--162.",
      "doi": ""
    },
    {
      "text": "David Martin, Benjamin V. Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a Turker. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 224--235.  ",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2011. Conducting Behavioral Research on Amazon's Mechanical Turk. Behavior Research Methods 44, 1 (June 2011), 1--23.",
      "doi": ""
    },
    {
      "text": "Office of the Legislative Counsel. 2010. Compilation of Patient Protection and Affordable Care Act. https://housedocs.house.gov/ energycommerce/ppacacon.pdf",
      "doi": ""
    },
    {
      "text": "R. E. Robertson, B. S. Fallavollita, L. L. Siegel, J. Peterson, and J. Campbell. 2006. Employment Arrangements: Improved Outreach Could Help Ensure Proper Worker Classification. Washington, DC: US Government Accountability Office (Aug. 2006). https://www.gao.gov/products/ GAO-06--656",
      "doi": ""
    },
    {
      "text": "Joel Ross, Lilly Irani, M. Six Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who Are the Crowdworkers?: Shifting Demographics in Mechanical Turk. In Extended Abstracts of the 28th ACM Conference on Human Factors in Computing Systems (CHI EA '10). ACM, 2863--2872.  ",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "Niloufar Salehi, Lilly C. Irani, Michael S. Bernstein, Ali Alkhatib, Eva Ogbe, Kristy Milland, and Clickhappier. 2015. We Are Dynamo: Overcoming Stalling and Friction in Collective Action for Crowd Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1621--1630.  ",
      "doi": "10.1145/2702123.2702508"
    },
    {
      "text": "Elka Torpey and Andrew Hogan. 2016. Working in a Gig Economy : Career Outlook: U.S. Bureau of Labor Statistics. https://www.bls.gov/careeroutlook/2016/article/what-is-the-gigeconomy.htm.",
      "doi": ""
    },
    {
      "text": "UNESCO. 1997. International Standard Classification of Education. http://unesdoc.unesco.org/images/0011/001113/111387eo.pdf",
      "doi": ""
    },
    {
      "text": "U.S. Bureau of Labor Statistics. 2009. How the Government Measures Unemployment. http://www.bls.gov/cps/cps_htgm.htm.",
      "doi": ""
    },
    {
      "text": "U.S. Bureau of Labor Statistics. 2018. A-10. Unemployment Rates by Age, Sex, and Marital Status, Seasonally Adjusted. https://www.bls.gov/web/empsit/cpseea10.htm.",
      "doi": ""
    },
    {
      "text": "U.S. Bureau of Labor Statistics. 2019. Table A-8. Employed Persons by Class of Worker and Part-Time Status. https://www.bls.gov/webapps/legacy/cpsatab8.htm.",
      "doi": ""
    },
    {
      "text": "US Census Bureau. 2014. Gap Between Higher- and LowerWealth Households Widens. https://www.census.gov/newsroom/pressreleases/2014/cb14--156.html.",
      "doi": ""
    },
    {
      "text": "US Census Bureau. 2018. Historical Households Tables (Table HH-4). https://www.census.gov/data/tables/timeseries/demo/families/households.html.",
      "doi": ""
    },
    {
      "text": "US Census Bureau. 2018. Historical Poverty Tables: People and Families - 1959 to 2017. https://www.census.gov/data/tables/timeseries/demo/income-poverty/historical-poverty-people.html.",
      "doi": ""
    },
    {
      "text": "US Census Bureau. 2018. Household Income: HINC-06. https://www.census.gov/data/tables/time-series/demo/incomepoverty/cps-hinc/hinc-06.html.",
      "doi": ""
    },
    {
      "text": "US Government. 2007. Fair Minimum Wage Act of 2007. https: //www.congress.gov/bill/110th-congress/house-bill/2206",
      "doi": ""
    },
    {
      "text": "Juliet Webster. 2016. Microworkers of the Gig Economy: Separate and Precarious. New Labor Forum 25, 3 (Sept. 2016), 56--64.",
      "doi": ""
    },
    {
      "text": "Christopher T. Whelan. 1992. The Role of Income, Life-Style Deprivation and Financial Strain in Mediating the Impact of Unemployment on Psychological Distress: Evidence from the Republic of Ireland. Journal of Occupational and Organizational Psychology 65, 4 (Dec. 1992), 331--344.",
      "doi": ""
    }
  ]
}