{
  "doi": "10.1145/3290605.3300564",
  "title": "Temporal Rhythms and Patterns of Electronic Documentation in Time-Critical Medical Work",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "We examine nursing documentation on a newly implemented electronic flowsheet in medical resuscitations to identify the temporal patterns of documentation and how the recorded information supported time-critical teamwork. To determine when the information was documented, we compared timestamps from 58 flowsheet logs to those of verbal communications derived from video review. We also drew on observations of 95 resuscitations to understand the behaviors of nurse documenters. We found that only 8% of the verbal reports were documented in near real-time (one minute within the verbal report), while 42% of reports were not documented in the electronic flowsheet. In addition, 38% were documented early (before the verbal report) and 12% were documented with a delay, ranging from one to 58 minutes after the report. Our study showed that the electronic flowsheet design posed many challenges for real-time documentation, leading to paper-based workarounds and the use of free-text fields on the flowsheet to visualize and keep track of time, and to communicate temporal information to the team. These findings suggest that documenters shape the temporal rhythms of not only their own work but also the rhythms of the electronic record and medical process. We discuss the implications of these rhythms for EHR redesign to support real-time documentation in high-risk, safety-critical settings.",
  "tags": [
    "temporality",
    "nursing documentation",
    "information behavior",
    "emergency medicine",
    "electronic health records"
  ],
  "authors": [
    {
      "name": "Swathi Jagannath",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557725756",
      "orcid": "missing"
    },
    {
      "name": "Aleksandra Sarcevic",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/do/10.1145/contrib-81100413266/rel-imgonly/profile.jpg",
      "acmid": "81100413266",
      "orcid": "missing"
    },
    {
      "name": "Victoria Young",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366789",
      "orcid": "missing"
    },
    {
      "name": "Sage Myers",
      "institution": "The Children's Hospital of Philadelphia, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365739",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Joan S. Ash, Marc Berg, and Enrico Coiera. 2004. Some unintended consequences of information technology in health care: the nature of patient care information system-related errors. Journal of the American Medical Informatics Association 11, 2 (Mar. 2004), 104--112.",
      "doi": ""
    },
    {
      "text": "Jakob E. Bardram. 2000. Temporal coordination--on time and coordination of collaborative activities at a surgical department. Computer Supported Cooperative Work 9, 2 (May 2000), 157--187.  ",
      "doi": "10.1023/A%3A1008748724225"
    },
    {
      "text": "Jakob E. Bardram, Thomas R. Hansen, and Mads Soegaard. 2006. AwareMedia: a shared interactive display supporting social, temporal, and spatial awareness in surgery. In Proceedings of the 2006 20th anniversary Conference on Computer Supported Cooperative Work (CSCW '06), ACM, New York, NY, USA, 109--118.  ",
      "doi": "10.1145/1180875.1180892"
    },
    {
      "text": "Marc Berg. 1999. Accumulating and coordinating: occasions for information technologies in medical work. Computer Supported Cooperative Work 8, 4 (Dec. 1999), 373--401.  ",
      "doi": "10.1023/A%3A1008757115404"
    },
    {
      "text": "Marc Berg. 2001. Implementing information systems in health care organizations: myths and challenges. International Journal of Medical Informatics 64, 2--3 (Dec. 2001), 143--156.",
      "doi": ""
    },
    {
      "text": "Pam Bilyeu and Lynn Eastes. 2013. Use of the electronic medical record for trauma resuscitations: how does this impact documentation completeness?. Journal of Trauma Nursing 20, 3 (Jul. 2013), 166--168.",
      "doi": ""
    },
    {
      "text": "Vincent Blijleven, Kitty Koelemeijer, Marijntje Wetzels, and Monique Jaspers. 2017. Workarounds emerging from electronic health record system usage: Consequences for patient safety, effectiveness of care, and efficiency of care. JMIR Human Factors 4, 4 (Oct. 2017).",
      "doi": ""
    },
    {
      "text": "Claus Bossen. 2011. Accounting and co-constructing: the development of a standard for electronic health records. Computer Supported Cooperative Work 20, 6 (Dec. 2011), 473.  ",
      "doi": "10.1007/s10606-011-9141-3"
    },
    {
      "text": "Claus Bossen and Lotte G. Jensen. 2014. How physicians 'achieve overview': a case-based study in a hospital ward. In Proceedings of the 17th ACM conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), ACM, New York, NY, USA, 257--268.  ",
      "doi": "10.1145/2531602.2531620"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Carla Coffey, Lee Ann Wurster, Jonathan Groner, Jeffrey Hoffman, Valerie Hendren, Kathy Nuss, Kathy Haley, Julie Gerberick, Beth Malehorn, and Julia Covert. 2015. A comparison of paper documentation to electronic documentation for trauma resuscitations at a level I pediatric trauma center. Journal of Emergency Nursing 41, 1 (Jan. 2015), 52--56.",
      "doi": ""
    },
    {
      "text": "Yunan Chen. 2010. Documenting transitional information in EMR. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), ACM, New York, NY, USA, 1787--1796.  ",
      "doi": "10.1145/1753326.1753594"
    },
    {
      "text": "Cecile D'huyvetter, Ann M. Lang, Dawn M. Heimer, and Thomas H. Cogbill. 2014. Efficiencies gained by using electronic medical record and reports in trauma documentation. Journal of Trauma Nursing 21, 2 (Mar. 2014), 68--71.",
      "doi": ""
    },
    {
      "text": "Lynn E. Eastes, Janie Johnson, and Maureen Harrahill. 2010. Using the electronic medical record for trauma resuscitations: Is it possible?. Journal of Emergency Nursing 36, 4 (Jul. 2010), 381--384.",
      "doi": ""
    },
    {
      "text": "Samer Faraj and Yan Xiao. 2006. Coordination in fast-response organizations. Management Science 52, 8 (Aug. 2006), 1155--1169.  ",
      "doi": "10.1287/mnsc.1060.0526"
    },
    {
      "text": "Geraldine Fitzpatrick and Gunnar Ellingsen. 2013. A review of 25 years of CSCW research in healthcare: contributions, challenges and future agendas. Computer Supported Cooperative Work 22, 4--6 (Aug. 2013), 609--665.  ",
      "doi": "10.1007/s10606-012-9168-0"
    },
    {
      "text": "Swathi Jagannath, Aleksandra Sarcevic, Nina Multak, and Sage Myers. 2018. Understanding paper-based documentation practices in medical resuscitations to inform the design of electronic documentation tools. Pediatric Emergency Care. Advance online publication.",
      "doi": ""
    },
    {
      "text": "Yu T. Kenneth and Robert A. Green. 2009. Critical aspects of emergency department documentation and communication. Emergency Medicine Clinics 27, 4 (Nov. 2009), 641--654.",
      "doi": ""
    },
    {
      "text": "Diana S. Kusunoki and Aleksandra Sarcevic. 2015. Designing for temporal awareness: The role of temporality in time-critical medical teamwork. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '15), ACM, New York, NY, USA, 1465--1476.  ",
      "doi": "10.1145/2675133.2675279"
    },
    {
      "text": "Tanja Manser. 2009. Teamwork and patient safety in dynamic domains of healthcare: a review of the literature. Acta Anaesthesiologica Scandinavica 53, 2 (Feb. 2009), 143--151.",
      "doi": ""
    },
    {
      "text": "Michael McGonigal. 2010. Trauma flow sheets vs the electronic medical record. The Trauma Professional's Blog. http://regionstraumapro.com/post/370717358. {Published 2010. Accessed August 21, 2018}.",
      "doi": ""
    },
    {
      "text": "Laura E. McLean, Sean Elwell, and Andrew DePiero. 2015. Assessment of the electronic medical record in documenting trauma resuscitations in the pediatric ED. The American Journal of Emergency Medicine 33, 4 (Apr. 2015), 589--590.",
      "doi": ""
    },
    {
      "text": "Sun Young Park and Yunan Chen. 2012. Adaptation as design: learning from an EMR deployment study. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), ACM, New York, NY, USA, 2097--2106.  ",
      "doi": "10.1145/2207676.2208361"
    },
    {
      "text": "Sun Young Park, Katie Pine, and Yunan Chen. 2013. Local-universality: designing EMR to support localized informal documentation practices. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13), ACM, New York, NY, USA, 55--66.  ",
      "doi": "10.1145/2441776.2441786"
    },
    {
      "text": "Sun Young Park, So Young Lee, and Yunan Chen. 2012. The effects of EMR deployment on doctors' work practices: A qualitative study in the emergency department of a teaching hospital. International Journal of Medical Informatics 81, 3 (Mar. 2012), 204--217.",
      "doi": ""
    },
    {
      "text": "Kathleen H. Pine and Melissa Mazmanian. 2014. Institutional logics of the EMR and the problem of 'perfect' but inaccurate accounts. In Proceedings of the 17th ACM conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), ACM, New York, NY, USA, 283--294.  ",
      "doi": "10.1145/2531602.2531652"
    },
    {
      "text": "Madhu C. Reddy and Paul Dourish. 2002. A finger on the pulse: temporal rhythms and information seeking in medical work. In Proceedings of the 2002 ACM conference on Computer supported Cooperative Work (CSCW '02), ACM, New York, NY, USA, 344--353.  ",
      "doi": "10.1145/587078.587126"
    },
    {
      "text": "Madhu C. Reddy, Paul Dourish, and Wanda Pratt. 2001. Coordinating heterogeneous work: information and representation in medical care. In ECSCW 2001, Springer, Dordrecht, 239--258. ",
      "doi": "10.5555/1241867.1241880"
    },
    {
      "text": "Madhu C. Reddy, Paul Dourish, and Wanda Pratt. 2006. Temporality in medical work: Time also matters. Computer Supported Cooperative Work 15, 1 (Feb. 2006), 29--53.  ",
      "doi": "10.1007/s10606-005-9010-z"
    },
    {
      "text": "Aleksandra Sarcevic. 2010. Who's scribing?: Documenting patient encounter during trauma resuscitation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), ACM, New York, NY, USA, 1899--1908.  ",
      "doi": "10.1145/1753326.1753611"
    },
    {
      "text": "Aleksandra Sarcevic and Nicole Ferraro. 2017. On the use of electronic documentation systems in fast-paced, time-critical medical settings. Interacting with Computers 29, 2 (Mar. 2017), 203--219.",
      "doi": ""
    },
    {
      "text": "Lee Ann Wurster, Jonathan I. Groner, and Jeffrey Hoffman. 2012. Electronic documentation of trauma resuscitations at a level 1 pediatric trauma center. Journal of Trauma Nursing 19, 2 (Apr. 2012), 76--79.",
      "doi": ""
    },
    {
      "text": "Eviatar Zerubavel. 1979. Patterns of Time in Hospital Life. A Sociological Perspective. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Xiaomu Zhou, Mark S. Ackerman, and Kai Zheng. 2009. I just don't know why it's gone: Maintaining informal information use in inpatient care. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), ACM, New York, NY, USA, 2061--2070.  ",
      "doi": "10.1145/1518701.1519014"
    },
    {
      "text": "Xiaomu Zhou, Mark S. Ackerman, and Kai Zheng. 2011. CPOE workarounds, boundary objects, and assemblages. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), ACM, New York, NY, USA, 3353--3362.  ",
      "doi": "10.1145/1978942.1979439"
    }
  ]
}