{
  "doi": "10.1145/3290605.3300720",
  "title": "Do We Care About Diversity in Human Computer Interaction: A Comprehensive Content Analysis on Diversity Dimensions in Research",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2019,
  "badges": [],
  "abstract": "In Human-Computer Interaction (HCI) research, awareness for the relevance of diversity of users is increasing. In this work, we analyze whether the articulated need for more diversity-sensitive research led indeed to a higher consideration of diversity in HCI research. Based on a comprehensive collection of diversity dimensions, we present results of a quantitative content analysis of articles accepted in the Proceedings of the Conference on Human Factors in Computing Systems 2006, 2011, and 2016. Results demonstrate how many and how intensively diversity dimensions were considered, and moreover highlight those dimensions that have so far received less attention. Uncovering continuous and discontinuous trends across time and differences between subfields of research, we identify research gaps and aim at contributing to a comprehensive understanding of diversity supporting diversity-sensitive research in HCI.",
  "authors": [
    {
      "name": "Julia Himmelsbach",
      "institution": "AIT Austrian Institute of Technology GmbH, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658638590",
      "orcid": "missing"
    },
    {
      "name": "Stephanie Schwarz",
      "institution": "AIT Austrian Institute of Technology GmbH, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658769362",
      "orcid": "missing"
    },
    {
      "name": "Cornelia Gerdenitsch",
      "institution": "AIT Austrian Institute of Technology GmbH, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498658397",
      "orcid": "missing"
    },
    {
      "name": "Beatrix Wais-Zechmann",
      "institution": "AIT Austrian Institute of Technology GmbH, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659279279",
      "orcid": "missing"
    },
    {
      "name": "Jan Bobeth",
      "institution": "AIT Austrian Institute of Technology GmbH, Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503680903",
      "orcid": "missing"
    },
    {
      "name": "Manfred Tscheligi",
      "institution": "University of Salzburg & AIT Austrian Institute of Technology GmbH, Salzburg & Vienna, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548016789",
      "orcid": "0000-0001-6056-7285"
    }
  ],
  "references": [
    {
      "text": "ACM Digital Library. 2018. Conferences. CHI Conference on Human Factors in Computing Systems. https://dl.acm.org/event.cfm?id=RE151",
      "doi": ""
    },
    {
      "text": "Nancy Adler and Judith Stewart. 2007. The MacArthur Scale of Subjective Social Status Summary.",
      "doi": ""
    },
    {
      "text": "Margaret L Andersen. 2001. Restructuring for Whom? Race, Class, Gender, and the Ideology of Invisibility. Sociological Forum, Vol. 16, 2 (2001), 181--201.",
      "doi": ""
    },
    {
      "text": "Jeffrey J. Arnett. 2008. The Neglected 95%: Why American Psychology Needs to Become Less American. American Psychologist, Vol. 63, 7 (2008), 602--614.",
      "doi": ""
    },
    {
      "text": "Association for Computing Machinery. 2007. The ACM Computing Classification System (1998). https://www.acm.org/publications/computing-classification-system/1998/ccs98",
      "doi": ""
    },
    {
      "text": "Liam Bannon. 2011. Reimagining HCI: toward a more human-centered perspective. interactions, Vol. 18, 4 (2011), 50.  ",
      "doi": "10.1145/1978822.1978833"
    },
    {
      "text": "Benny Barak. 2009. Age identity: A cross-cultural global approach. International Journal of Behavioral Development, Vol. 33, 1 (2009), 2--11.",
      "doi": ""
    },
    {
      "text": "Louise Barkhuus and Jennifer A Rode. 2007. From Mice to Men -- 24 years of Evaluation in CHI. In Extended Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1--16.  ",
      "doi": "10.1145/1240624.2180963"
    },
    {
      "text": "John Barnshaw. 2008. Race. In Encyclopedia of Race, Ethnicity, and Society, Richard T Schaefer (Ed.). SAGE Publications, Thousand Oaks, 1091--1093.",
      "doi": ""
    },
    {
      "text": "Frederik Barth. 1969. Ethnic Groups and Boundaries. The Social Organization of Culture Difference. Little, Brown and Company, Boston.",
      "doi": ""
    },
    {
      "text": "Joyce M Bell and Douglas Hartmann. 2007. Diversity in everyday discourse: Consequences of “happy talk”. American Sociological Review, Vol. 72, 1997 (2007), 895--914.",
      "doi": ""
    },
    {
      "text": "Mette Louise Berg and Nando Sigona. 2013. Ethnography, diversity and urban space. Identities, Vol. 20, 4 (2013), 347--360.",
      "doi": ""
    },
    {
      "text": "Paolo Boccagni. 2015. The Difference Diversity Makes: A Principle, a Lens, an Empirical Attribute for Majority--Minority Relations. Governing through Diversity (2015), 21--38.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 2006. When second wave HCI meets third wave challenges. In Proceedings of the 4th Nordic conference on Human-computer interaction changing roles - NordiCHI '06. ACM Press, New York, New York, USA, 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Meg A. Bond and Tean L. Pyle. 1998. Diversity Dilemmas at Work. Journal of Management Inquiry, Vol. 7, 3 (1998), 252--269.",
      "doi": ""
    },
    {
      "text": "Juanita Brown and David Isaacs. 2006. The World Café : Shaping Our Futures Through Conversations That Matter. Berrett-Koehler Publishers Inc, San Francisco.",
      "doi": ""
    },
    {
      "text": "Duncan P. Brumby, Dario D. Salvucci, and Andrew Howes. 2009. Focus on driving: How Cognitive Constraints Shape the Adaptation of Strategy when Dialing while Driving. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press, New York, New York, USA, 1629.  ",
      "doi": "10.1145/1518701.1518950"
    },
    {
      "text": "Kelly Caine. 2016. Local Standards for Sample Size at CHI. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 981--992.  ",
      "doi": "10.1145/2858036.2858498"
    },
    {
      "text": "Xiang Cao, Abigail Sellen, A.J. Bernheim Brush, David Kirk, Darren Edge, and Xianghua Ding. 2010. Understanding family communication across time zones. In Proceedings of the 2010 ACM conference on Computer supported cooperative work - CSCW '10. ACM Press, New York, New York, USA, 155.  ",
      "doi": "10.1145/1718918.1718947"
    },
    {
      "text": "Jessie Chin, Wai-Tat Fu, and Thomas Kannampallil. 2009. Adaptive information search: Age-Dependent Interactions between Cognitive Profiles and Strategies. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press, New York, New York, USA, 1683.  ",
      "doi": "10.1145/1518701.1518961"
    },
    {
      "text": "Hae Yeon Choo and Myra Marx Ferree. 2010. Practicing Intersectionality in Sociological Research: A Critical Analysis of Inclusions, Interactions, and Institutions in the Study of Inequalities. Sociological Theory, Vol. 28, 2 (2010), 129--149.",
      "doi": ""
    },
    {
      "text": "Derrick L. Cogburn. 2003. HCI in the so-called developing world: what's in it for everyone. Interactions, Vol. 10, 2 (2003), 80--87.  ",
      "doi": "10.1145/637848.637866"
    },
    {
      "text": "Elizabeth R Cole. 2009. Intersectionality and research in psychology. American Psychologist, Vol. 64, 3 (2009), 170--180.",
      "doi": ""
    },
    {
      "text": "Ann Colley and Chris Comber. 2003. Age and gender differences in computer use and attitudes among secondary school students: What has changed? Educational Research, Vol. 45, 2 (2003), 155--165.",
      "doi": ""
    },
    {
      "text": "Patricia Hill Collins. {n. d.}. Toward a new vision: Race, class, and gender as categories of analysis and connection. In Women's Voices, Feminist Visions. Classic and Contemporary Readings,, Susan M Shaw and Janet Lee (Eds.). McGraw-Hill, Boston, 72--79.",
      "doi": ""
    },
    {
      "text": "Sabrina L. Connell, Alexis R. Lauricella, and Ellen Wartella. 2015. Parental co-use of media technology with their young children in the USA. Journal of Children and Media, Vol. 9, 1 (2015), 5--21.",
      "doi": ""
    },
    {
      "text": "Sara J Czaja, Neil Charness, Arthur D Fisk, Christopher Hertzog, Sankaran N Nair, Wendy A Rogers, and Joseph Sharit. 2006. Factors predicting the use of technology: Findings from the center for research and education on aging and technology enhancement (CREATE). Psychology and Aging, Vol. 21, 2 (2006), 333--352.",
      "doi": "10.1037/0882-"
    },
    {
      "text": "Pamela E Davis-Kean. 2005. The Influence of Parent Education and Family Income on Child Achievement: The Indirect Role of Parental Expectations and the Home Environment. Journal of Family Psychology, Vol. 19, 2 (2005), 294--304.",
      "doi": ""
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The Ins and Outs of HCI for Development. ACM Press, 2220--2232.  ",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Francine M. Deutsch. 2007. Undoing gender. Gender and Society, Vol. 21, 1 (2007), 106--127.",
      "doi": ""
    },
    {
      "text": "Jonathan Donner. 2008. Research approaches to mobile use in the developing world: A review of the literature. Information Society, Vol. 24, 3 (2008), 140--159.  ",
      "doi": "10.1080/01972240802019970"
    },
    {
      "text": "Susan M. Dray, David a. Siegel, and Paula Kotzé. 2003. Indra's net HCI in the developing World. Interactions (2003), 28--37.  ",
      "doi": "10.1145/637848.637860"
    },
    {
      "text": "Lauren B. Edelman, Sally Riggs Fuller, and Iona Mara-Drita. 2001. Diversity Rhetoric and the Managerialization of Law. Amer. J. Sociology, Vol. 106, 6 (2001), 1589--1641.",
      "doi": ""
    },
    {
      "text": "Robin J Ely. 1995. The Power in Demography: Women's Social Constructions of Gender Identity at Work. Academy of Management Journal, Vol. 38, 3 (1995), 589--634.",
      "doi": ""
    },
    {
      "text": "Sheena Erete, Aarti Israni, and Tawanna Dillahunt. 2018. An intersectional approach to designing in the margins. Interactions, Vol. 25, 3 (apr 2018), 66--69.  ",
      "doi": "10.1145/3194349"
    },
    {
      "text": "Eurostat. {n. d.}. Internet use by individuals. https://ec.europa.eu/eurostat/tgm/table.do?tab=table&init=1&language=en&pcode=tin00028&plugin=1",
      "doi": ""
    },
    {
      "text": "Thomas Faist. 2009. Diversity - A new mode of incorporation? Ethnic and Racial Studies, Vol. 32, 1 (2009), 171--190.",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 1978. The Will to Knowledge: The History of Sexuality. An Introduction. Pantheon Books, New York, New York, USA.",
      "doi": ""
    },
    {
      "text": "L Gardenswartz and A Rowe. 2003. Diverse Teams at Work: Capitalizing on the Power of Diversity. Society for Human Resource Management, Alexandria, Va.",
      "doi": ""
    },
    {
      "text": "David Gefen and Detmar W Straub. 1997. Gender Differences in the Perception and Use of E-Mail: An Extension to the Technology Acceptance Model. MIS Quarterly, Vol. 21, 4 (1997), 389.  ",
      "doi": "10.2307/249720"
    },
    {
      "text": "Google Scholar Metrics. 2018. Top publications: Human Computer Interaction. https://scholar.google.es/citations?view_op=top_venues&hl=en&vq=eng_humancomputerinteraction",
      "doi": ""
    },
    {
      "text": "Oliver L Haimson, Anne E Bowser, Edward F Melcer, and Elizabeth F Churchill. 2015. Online Inspiration and Exploration for Identity Reinvention. In CHI '15 - Proceedings of the ACM Conference on Human Factors in Computing Systems, Vol. 1. 3809--3818.  ",
      "doi": "10.1145/2702123.2702270"
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2016. Digital Footprints and Changing Networks During Online Identity Transitions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 2895--2907.  ",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Stuart Hall. 1999. Cultural Identity and Diaspora. In Diaspora and Visual Culture. Representing Africans and Jews, Nicholas Mirzoeff (Ed.). Routledge, London, 222--237.",
      "doi": ""
    },
    {
      "text": "Ange-Marie Hancock. 2007. When Multiplication Doesn't Equal Quick Addition: Examining Intersectionality as a Research Paradigm. Perspectives on Politics, Vol. 5, 01 (mar 2007), 63--79.",
      "doi": ""
    },
    {
      "text": "David Hankerson, Andrea R. Marshall, Jennifer Booker, Houda El Mimouni, Imani Walker, and Jennifer A. Rode. 2016. Does Technology Have Race?. In CHI EA '16 Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. San Jose, California, USA, 473--486.  ",
      "doi": "10.1145/2851581.2892578"
    },
    {
      "text": "Donna Haraway. 1988. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. Feminist Studies, Vol. 14, 3 (1988), 575--599.",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI. Alt. Chi. Session at the SIGCHI łdots January (2007), 1--18.",
      "doi": ""
    },
    {
      "text": "Joseph Henrich, Steven J. Heine, and Ara Norenzayan. 2010a. Most people are not WEIRD. Nature, Vol. 466, 7302 (jul 2010), 29--29.",
      "doi": ""
    },
    {
      "text": "Joseph Henrich, Steven J Heine, and Ara Norenzayan. 2010b. The weirdest people in the world? Behavioral and Brain Sciences, Vol. 33, 2--3 (2010), 61--83.",
      "doi": ""
    },
    {
      "text": "Cedric Herring and Loren Henderson. 2012. From Affirmative Action to Diversity: Toward a Critical Diversity Perspective. Critical Sociology, Vol. 38, 5 (2012), 629--643.",
      "doi": ""
    },
    {
      "text": "Bernie Hogan, Joshua R. Melville, Gregory Lee Phillips II, Patrick Janulis, Noshir Contractor, Brian S. Mustanski, and Michelle Birkett. 2016. Evaluating the Paper-to-Screen Translation of Participant-Aided Sociograms with High-Risk Participants. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 5360--5371.  ",
      "doi": "10.1145/2858036.2858368"
    },
    {
      "text": "Nancy R Hooyman and H Asuman Kiyak. 2008. Social Gerontology: A Multidisciplinary Perspective. Pearson/Allyn & Bacon, Boston.",
      "doi": ""
    },
    {
      "text": "Linda A. Jackson, Yong Zhao, Anthony Kolenic, Hiram E. Fitzgerald, Rena Harold, and Alexander Von Eye. 2008. Race, Gender, and Information Technology Use: The New Digital Divide. CyberPsychology & Behavior, Vol. 11, 4 (2008), 437--442.",
      "doi": ""
    },
    {
      "text": "Stefan Johansson, Jan Gulliksen, and Ann Lantz. 2015. User Participation When Users Have Mental and Cognitive Disabilities. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers &#38; Accessibility (ASSETS '15). ACM, New York, NY, USA, 69--76.  ",
      "doi": "10.1145/2700648.2809849"
    },
    {
      "text": "Isaac L. Johnson, Subhasree Sengupta, Johannes Schö ning, and Brent Hecht. 2016. The Geography and Importance of Localness in Geotagged Social Media. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 515--526.  ",
      "doi": "10.1145/2858036.2858122"
    },
    {
      "text": "Heli Koski and Tobias Kretschmer. 2007. Catching up? Differences in 2G mobile diffusion in industrialized and developing countries ., Vol. 66 (2007), 7.",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Eunice Sari, William Thies, Indrani Medhi-Thies, William D. Tucker, Elba Valderrama Bahamondez, Susan Wyche, Susan Dray, Andy Dearden, Nicola Dell, Melissa Densmore, Rebecca E. Grinter, Zhengjie Liu, Mario A. Moreno Rocha, and Anicia Peters. 2016. Development Consortium: HCI Across Borders. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16. ACM Press, New York, New York, USA, 3620--3627.  ",
      "doi": "10.1145/2851581.2856507"
    },
    {
      "text": "Kari Kuutti. 2001. Hunting for the lost user : From sources of errors to active actors -- and beyond. In Paper presented at Cultural Usability Seminar, Media Lab, University of Art and Design. Media Lab, University of Art and Design Helsinki.",
      "doi": ""
    },
    {
      "text": "Nai Li and Gill Kirkup. 2007. Gender and cultural differences in Internet use: A study of China and the UK. Computers & Education, Vol. 48, 2 (2007), 301--317.",
      "doi": ""
    },
    {
      "text": "Yang Li and James A. Landay. 2008. Activity-based prototyping of ubicomp applications for long-lived, everyday human activities. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08. ACM Press, New York, New York, USA, 1303.  ",
      "doi": "10.1145/1357054.1357259"
    },
    {
      "text": "Marilyn Loden and Judy B Rosener. 1991. Workforce America! Managing Employee Diversity As a Vital Resource. Business One Irwin, Homewood.",
      "doi": ""
    },
    {
      "text": "Niklas Luhmann. 1995. Social Systems. Stanford University Press, Stanford, California, USA.",
      "doi": ""
    },
    {
      "text": "Helma Lutz and Norbert Wennig. 2001. Differenzen ü ber Differenz -- Einfü hrung in die Debatten. In Unterschiedlich verschieden : Differenz in der Erziehungswissenschaft, Helma Lutz and Norbert Wennig (Eds.). Leske",
      "doi": ""
    },
    {
      "text": "Budrich, Opladen, 11--24.",
      "doi": ""
    },
    {
      "text": "Mary Madden and Lee Rainie. 2003. America's Online Pursuits. http://www.pewinternet.org/2003/12/22/americas-online-pursuits/ internal-pdf://0.0.0.70/americas-online-pursuits.html",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Kerwell Liao, Anna Turner, Marianne Berkovich, Robert Reeder, and Sunny Consolvo. 2016. \"She'll just grab any device that's closer\": A Study of Everyday Device & Account Sharing in Households. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 5921--5932.  ",
      "doi": "10.1145/2858036.2858051"
    },
    {
      "text": "Leslie Mccall. 2005. The Complexity of Intersectionality. Signs: Journal of Women in Culture and Society, Vol. 30, 3 (2005), 1771--1800.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as experience. MIT Press, Cambridge, Mass. http://portal.acm.org/citation.cfm?doid=1015530.1015549 ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Tracy L Mitzner, Julie B Boron, Cara Bailey Fausset, Anne E Adams, Neil Charness, Sara J Czaja, Katinka Dijkstra, Arthur D Fisk, Wendy A Rogers, and Joseph Sharit. 2010. Older adults talk technology: Technology usage and attitudes. Computers in Human Behavior, Vol. 26, 6 (2010), 1710--1721.  ",
      "doi": "10.1016/j.chb.2010.06.020"
    },
    {
      "text": "M G Morris, V Venkatesh, and P L Ackerman. 2005. Gender and Age Differences in Employee Decisions About New Technology: An Extension to the Theory of Planned Behavior. IEEE Transactions on Engineering Management, Vol. 52, 1 (2005), 69--84.",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. \"With most of it being pictures now, I rarely use it\": Understanding Twitter's Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16. ACM Press, New York, New York, USA, 5506--5516.  ",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Pew Research Center. {n. d.}. Demographics of Mobile Device Ownership and Adoption in the United States. http://www.pewinternet.org/fact-sheet/mobile/",
      "doi": ""
    },
    {
      "text": "Jean S Phinney. 1992. The Multigroup Ethnic Identity Measure: A New Scale for Use with Diverse Groups. Journal of Adolescent Research, Vol. 7, 2 (apr 1992), 156--176.",
      "doi": ""
    },
    {
      "text": "Ann Phoenix. 2006. Interrogating intersectionality: Productive ways of theorising multiple positioning. Kvinder, Køn & Forskning 2--3 (jun 2006), 21--30.",
      "doi": ""
    },
    {
      "text": "James W Potter and Deborah Levine-Donnerstein. 1999. Rethinking validity and reliability in content analysis. Journal of Applied Communication Research, Vol. 37, 3 (1999), 258--284.",
      "doi": ""
    },
    {
      "text": "Pushkala Prasad, Judith K Pringle, and Alison M Konrad. 2006. Examining the contours of workplace diversity: concepts, contexts and challenges. In Handbook of Workplace Diversity,, Pushkala Prasad, J Pringle, and A Konrad (Eds.). SAGE Publications Ltd, London, 1--22.",
      "doi": ""
    },
    {
      "text": "Laura Ramos, Elise van den Hoven, and Laurie Miller. 2016. Designing for the Other 'Hereafter'. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 721--732.  ",
      "doi": "10.1145/2858036.2858162"
    },
    {
      "text": "Katharina Reinecke and Krzysztof Z Gajos. 2014. Quantifying visual preferences around the world. ACM Press, 11--20.  ",
      "doi": "10.1145/2556288.2557052"
    },
    {
      "text": "Julie Rico and Stephen Brewster. 2009. Gestures all around us: user differences in social acceptability perceptions of gesture based interfaces. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI '09. ACM Press, New York, New York, USA, 1.  ",
      "doi": "10.1145/1613858.1613936"
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, New York, New York, USA, 5412--5427.  ",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Robert M. Sellers, Mia A Smith, J. Nicole Shelton, Stephanie AJ Rowley, and Tabbye M Chavous. 1998. Multidimensional Model of Racial Identity: A Reconceptualization of African American Racial Identity. Personality and Social Psychology Review, Vol. 2, 1 (feb 1998), 18--39.",
      "doi": ""
    },
    {
      "text": "Lei Shi, Idan Zelzer, Catherine Feng, and Shiri Azenkot. 2016. Tickers and Talker: An Accessible Labeling Toolkit for 3D Printed Models. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 4896--4907.  ",
      "doi": "10.1145/2858036.2858507"
    },
    {
      "text": "Kiley Sobel. 2017. Equity & Inclusivity at IDC. Idc (2017), 761--767.  ",
      "doi": "10.1145/3078072.3081313"
    },
    {
      "text": "Gayatri Chakravorty Spivak. 1985. The Rani of Sirmur: An Essay in Reading the Archives. History and Theory, Vol. 24, 3 (1985), 247--272.",
      "doi": ""
    },
    {
      "text": "Mark Staton, Neeru Paharia, and Christopher Oveis. 2012. Emotional marketing: How pride and compassion impact preferences for underdog and top dog brands. Advances in Consumer Research, Vol. 40, December 2009 (2012), 1045--1046.",
      "doi": ""
    },
    {
      "text": "Detmar Straub, Mark Keil, and Walter Brenner. 1997. Testing the technology acceptance model across cultures: A three country study. Information & Management, Vol. 33, 1 (1997), 1--11.  ",
      "doi": "10.1016/S0378-7206%2897%2900026-8"
    },
    {
      "text": "Angelika Strohmayer, Rosanna Bellini, Janis Meissner, Samantha Mitchell Finnigan, Ebtisam Alabdulqader, Austin Toombs, and Madeline Balaam. 2018. #CHIversity. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (2018), 1--10.",
      "doi": "10.1145/3170427.3188396"
    },
    {
      "text": "Christian Sturm, Alice Oh, Sebastian Linxen, Jose Abdelnour Nocera, Susan Dray, and Katharina Reinecke. 2015. How WEIRD is HCI?: Extending HCI Principles to other Countries and Cultures. Extended Abstracts of the ACM CHI'15 Conference on Human Factors in Computing Systems, Vol. 2 (2015), 2425--2428.  ",
      "doi": "10.1145/2702613.2702656"
    },
    {
      "text": "Huatong Sun and William F Hart-davidson. 2014. Binding the Material and the Discursive with a Relational Approach of Affordances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Toronto, Ontario, Canada, 3533--3542.  ",
      "doi": "10.1145/2556288.2557185"
    },
    {
      "text": "Moin Syed. 2010. Disciplinarity and methodology in intersectionality theory and research. American Psychologist, Vol. 65, 1 (2010), 61--62.",
      "doi": ""
    },
    {
      "text": "Leila Takayama, Wendy Ju, and Clifford Nass. 2008. Beyond dirty, dangerous and dull: What Everyday People Think Robots Should Do. In Proceedings of the 3rd international conference on Human robot interaction - HRI '08. ACM Press, New York, New York, USA, 25.  ",
      "doi": "10.1145/1349822.1349827"
    },
    {
      "text": "Serigne Mansour Tall. 2004. Senegalese 'emigrés : New information & communication technologies. Review of African Political Economy, Vol. 31, 99 (2004), 31--48.",
      "doi": ""
    },
    {
      "text": "R Roosevelt Thomas. 1996. Redefining diversity. American Management Association, New York.",
      "doi": ""
    },
    {
      "text": "Kenneth Turner and Marilyn McGee-Lennon. 2013. Advances in telecare over the past 10 years. Smart Homecare Technology and TeleHealth, Vol. 1 (nov 2013), 21.",
      "doi": ""
    },
    {
      "text": "Jutta Ü beracker and Austrian Society for Diversity (ASD). 2010. Diversity Management (DM) im Ü berblick. Technical Report. Cited. www.societyfordiversity.at",
      "doi": ""
    },
    {
      "text": "Anne R. van Ewijk. 2011. Diversity and diversity policy: Diving into fundamental differences. Journal of Organizational Change Management, Vol. 24, 5 (2011), 680--694.",
      "doi": ""
    },
    {
      "text": "Steven Vertovec. 2012. “Diversity” and the Social Imaginary. European Journal of Sociology, Vol. 53, 03 (dec 2012), 287--312.",
      "doi": ""
    },
    {
      "text": "Max Weber. 1978. Economy and society. University of California Press, Berkeley, Los Angeles, London.",
      "doi": ""
    },
    {
      "text": "Gabriele Winker and Nina Degele. 2011. Intersectionality as multi-level analysis: Dealing with social inequality. European Journal of Women's Studies, Vol. 18, 1 (feb 2011), 51--66.",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, Geraldine Fitzpatrick, and Michael Muller. 2018. Intersectionality as a Lens to Promote Equity and Inclusivity within SIGCHI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, p. panel08. ACM, (2018), 1--6.  ",
      "doi": "10.1145/3170427.3186324"
    },
    {
      "text": "Paweł Wo'z niak, Kristina Knaving, Staffan Bjö rk, and Morten Fjeld. 2015. RUFUS: Remote Supporter Feedback for Long-Distance Runners. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI '15. ACM Press, New York, New York, USA, 115--124.  ",
      "doi": "10.1145/2785830.2785893"
    },
    {
      "text": "Sarita Yardi and Amy Bruckman. 2012. Income, race, and class: exploring socioeconomic differences in family technology use. ACM Press, 3041.  ",
      "doi": "10.1145/2207676.2208716"
    },
    {
      "text": "Patrizia Zanoni and Marta Calas. 2014. Diversity and Organizations. Organization, Vol. Special Vi (2014), 1--8.",
      "doi": ""
    },
    {
      "text": "Patrizia Zanoni and Maddy Janssens. 2004. Deconstructing Difference: The Rhetoric of Human Resource Managers' Diversity Discourses. Organization Studies, Vol. 25, 1 (2004), 55--74.",
      "doi": ""
    },
    {
      "text": "Patrizia Zanoni, Maddy Janssens, Yvonne Benschop, and Stella Nkomo. 2010. Unpacking Diversity, Grasping Inequality: Rethinking Difference Through Critical Perspectives. Organization, Vol. 17, 1 (jan 2010), 9--29.",
      "doi": ""
    }
  ]
}