{
  "doi": "10.1145/3290605.3300846",
  "title": "Vistribute: Distributing Interactive Visualizations in Dynamic Multi-Device Setups",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "We present Vistribute, a framework for the automatic distribution of visualizations and UI components across multiple heterogeneous devices. Our framework consists of three parts: (i) a design space considering properties and relationships of interactive visualizations, devices, and user preferences in multi-display environments; (ii) specific heuristics incorporating these dimensions for guiding the distribution for a given interface and device ensemble; and (iii) a web-based implementation instantiating these heuristics to automatically generate a distribution as well as providing interaction mechanisms for user-defined adaptations. In contrast to existing UI distribution systems, we are able to infer all required information by analyzing the visualizations and devices without relying on additional input provided by users or programmers. In a qualitative study, we let experts create their own distributions and rate both other manual distributions and our automatic ones. We found that all distributions provided comparable quality, hence validating our framework.",
  "tags": [
    "multi-display environments",
    "information visualization",
    "cross-device interaction",
    "cross-device visualization",
    "distributed user interfaces"
  ],
  "authors": [
    {
      "name": "Tom Horak",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/do/10.1145/contrib-99658655442/rel-imgonly/tom_horak-square.jpg",
      "acmid": "99658655442",
      "orcid": "missing"
    },
    {
      "name": "Andreas Mathisen",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659290322",
      "orcid": "missing"
    },
    {
      "name": "Clemens N. Klokmose",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "Technische Universität Dresden, Dresden, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    },
    {
      "name": "Niklas Elmqvist",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81100015408/rel-imgonly/niklas_elmqvist_-_2019.jpg",
      "acmid": "81100015408",
      "orcid": "0000-0001-5805-5301"
    }
  ],
  "references": [
    {
      "text": "Robert Amar, James Eagan, and John Stasko. 2005. Low-level Components of Analytic Activity in Information Visualization. In Proceedings of the IEEE Symposium on Information Visualization. IEEE, Piscataway, NJ, USA, 111--117.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Christopher Andrews, Alex Endert, and Chris North. 2010. Space to think: large high-resolution displays for sensemaking. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 55--64.  ",
      "doi": "10.1145/1753326.1753336"
    },
    {
      "text": "Christopher Andrews, Alex Endert, Beth Yost, and Chris North. 2011. Information visualization on large, high-resolution displays: Issues, challenges, and opportunities. Information Visualization 10, 4 (Aug. 2011), 341--355.  ",
      "doi": "10.1177/1473871611415997"
    },
    {
      "text": "Daniel Archambault, Helen Purchase, and Bruno Pinaud. 2011. Animation, Small Multiples, and the Effect of Mental Map Preservation in Dynamic Graphs. IEEE Transactions on Visualization and Computer Graphics 17, 4 (April 2011), 539--552.  ",
      "doi": "10.1109/TVCG.2010.78"
    },
    {
      "text": "Sriram Karthik Badam and Niklas Elmqvist. 2014. PolyChrome: A Cross-Device Framework for Collaborative Web Visualization. In Proceedings of the ACM Conference on Interactive Tabletops and Surfaces. ACM, New York, NY, USA, 109--118.  ",
      "doi": "10.1145/2669485.2669518"
    },
    {
      "text": "Sriram Karthik Badam, Eli Fisher, and Niklas Elmqvist. 2015. Munin: A Peer-to-Peer Middleware for Ubiquitous Analytics and Visualization Spaces. IEEE Transactions on Visualization and Computer Graphics 21, 2 (Feb. 2015), 215--228.",
      "doi": "10.1109/TVCG.2014.2337337"
    },
    {
      "text": "Sriram Karthik Badam, Andreas Mathisen, Roman Rädle, Clemens N. Klokmose, and Niklas Elmqvist. 2019. Vistrates: A Component Model for Ubiquitous Analytics. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 586--596.",
      "doi": "10.1109/TVCG.2018.2865144"
    },
    {
      "text": "Till Ballendat, Nicolai Marquardt, and Saul Greenberg. 2010. Proxemic interaction: designing for a proximity and orientation-aware environment. In Proceedings of the ACM Conference on Interactive Tabletops and Surfaces. ACM, New York, NY, USA, 121--130.  ",
      "doi": "10.1145/1936652.1936676"
    },
    {
      "text": "Patrick Baudisch and Christian Holz. 2010. My new PC is a mobile phone. ACM XRDS 16, 4 (June 2010), 36--41.  ",
      "doi": "10.1145/1764848.1764857"
    },
    {
      "text": "Patrick Baudisch, Desney S. Tan, Maxime Collomb, Daniel C. Robbins, Ken Hinckley, Maneesh Agrawala, Shengdong Zhao, and Gonzalo Ramos. 2006. Phosphor: explaining transitions in the user interface using afterglow effects. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 169--178.  ",
      "doi": "10.1145/1166253.1166280"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: DataDriven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301--2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Lauren Bradel, Alex Endert, Kristen Koch, Christopher Andrews, and Chris North. 2013. Large high resolution displays for co-located collaborative sensemaking: Display usage and territoriality. International Journal of Human-Computer Studies 71, 11 (Nov. 2013), 1078--1088.  ",
      "doi": "10.1016/j.ijhcs.2013.07.004"
    },
    {
      "text": "Matthew Brehmer and Tamara Munzner. 2013. A Multi-Level Typology of Abstract Visualization Tasks. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec. 2013), 2376--2385.  ",
      "doi": "10.1109/TVCG.2013.124"
    },
    {
      "text": "Olivier Chapuis, Anastasia Bezerianos, and Stelios Frantzeskakis. 2014. Smarties: an input system for wall display development. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2763--2772.  ",
      "doi": "10.1145/2556288.2556956"
    },
    {
      "text": "Haeyong Chung, Chris North, Sarang Joshi, and Jian Chen. 2015. Four considerations for supporting visual analysis in display ecologies. In Proceedings of the IEEE Conference on Visual Analytics Science and Technology. IEEE, Piscataway, NJ, USA, 33--40.",
      "doi": ""
    },
    {
      "text": "Haeyong Chung, Chris North, Jessica Zeitz Self, Sharon Lynn Chu, and Francis K. H. Quek. 2014. VisPorter: facilitating information sharing for collaborative sensemaking on multiple displays. Personal and Ubiquitous Computing 18, 5 (June 2014), 1169--1186.  ",
      "doi": "10.1007/s00779-013-0727-2"
    },
    {
      "text": "Matt Conlen and Jeffrey Heer. 2018. Idyll: A Markup Language for Authoring and Publishing Interactive Articles on the Web. In Proceedings CHI 2019, May 4--9, 2019, Glasgow, Scotland UK T. Horak et al. of the ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 977--989.  ",
      "doi": "10.1145/3242587.3242600"
    },
    {
      "text": "David Dearman and Jeffery S. Pierce. 2008. It's on My Other Computer!: Computing with Multiple Devices. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 767--776.  ",
      "doi": "10.1145/1357054.1357177"
    },
    {
      "text": "Niklas Elmqvist and Pourang Irani. 2013. Ubiquitous Analytics: Interacting with Big Data Anywhere, Anytime. IEEE Computer 46, 4 (April 2013), 86--89.  ",
      "doi": "10.1109/MC.2013.147"
    },
    {
      "text": "M. R. Garey and D. S. Johnson. 1981. Approximation Algorithms for Bin Packing Problems: A Survey. In Analysis and Design of Algorithms in Combinatorial Optimization. Springer Vienna, Vienna, 147--172.",
      "doi": ""
    },
    {
      "text": "Michael Gleicher. 2018. Considerations for Visualizing Comparison. IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan. 2018), 413--423.",
      "doi": ""
    },
    {
      "text": "Michael Gleicher, Danielle Albers, Rick Walker, Ilir Jusufi, Charles D. Hansen, and Jonathan C. Roberts. 2011. Visual comparison for information visualization. Information Visualization 10, 4 (Sept. 2011), 289--309.  ",
      "doi": "10.1177/1473871611416549"
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: enabling and understanding cross-device interaction. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2773--2782.  ",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Jeffrey Heer and Maneesh Agrawala. 2006. Multi-Scale Banking to 45 Degrees. IEEE Transactions on Visualization and Computer Graphics 12, 5 (Sept. 2006), 701--708.  ",
      "doi": "10.1109/TVCG.2006.163"
    },
    {
      "text": "Jeffrey Heer and George Robertson. 2007. Animated Transitions in Statistical Data Graphics. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov. 2007), 1240--1247.  ",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "Tom Horak, Sriram Karthik Badam, Niklas Elmqvist, and Raimund Dachselt. 2018. When David Meets Goliath: Combining Smartwatches with a Large Vertical Display for Visual Data Exploration. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 19:1--19:13.  ",
      "doi": "10.1145/3173574.3173593"
    },
    {
      "text": "Steven Houben and Nicolai Marquardt. 2015. WATCHCONNECT: A Toolkit for Prototyping Smartwatch-Centric Cross-Device Applications. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1247--1256.  ",
      "doi": "10.1145/2702123.2702215"
    },
    {
      "text": "Maria Husmann, Alfonso Murolo, Nicolas Kick, Linda Di Geronimo, and Moira C. Norrie. 2018. Supporting out of office software development using personal devices. In Proceedings of the ACM Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, New York, NY, USA, 27:1--27:11.  ",
      "doi": "10.1145/3229434.3229454"
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2013. Interactive Visualizations on Large and Small Displays: The Interrelation of Display Size, Information Space, and Scale. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec. 2013), 2336--2345.  ",
      "doi": "10.1109/TVCG.2013.170"
    },
    {
      "text": "Waqas Javed and Niklas Elmqvist. 2012. Exploring the Design Space of Composite Visualization. In Proceedings of the IEEE Pacific Symposium on Visualization. IEEE, Piscataway, NJ, USA, 1--8.  ",
      "doi": "10.1109/PacificVis.2012.6183556"
    },
    {
      "text": "Haojian Jin, Christian Holz, and Kasper Hornbæk. 2015. Tracko: Adhoc Mobile 3D Tracking Using Bluetooth Low Energy and Inaudible Signals for Cross-Device Interaction. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 147--156.  ",
      "doi": "10.1145/2807442.2807475"
    },
    {
      "text": "Ulrike Kister, Konstantin Klamka, Christian Tominski, and Raimund Dachselt. 2017. GraSp: Combining Spatially-aware Mobile Devices and a Display Wall for Graph Visualization and Interaction. Computer Graphics Forum 36, 3 (June 2017), 503--514.  ",
      "doi": "10.1111/cgf.13206"
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. Webstrates: Shareable Dynamic Media. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 280--290.  ",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "Ricardo Langner, Tom Horak, and Raimund Dachselt. 2018. VisTiles: Coordinating and Combining Co-located Mobile Devices for Visual Data Exploration. IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan. 2018), 626--636.",
      "doi": ""
    },
    {
      "text": "Ricardo Langner, Ulrike Kister, and Raimund Dachselt. 2019. Multiple Coordinated Views at Large Displays for Multiple Users: Empirical Findings on User Behavior, Movements, and Distances. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 608--618.",
      "doi": "10.1109/TVCG.2018.2865235"
    },
    {
      "text": "Ricardo Langner, Ulrich von Zadow, Tom Horak, Annett Mitschick, and Raimund Dachselt. 2016. Content Sharing Between Spatially-Aware Mobile Phones and Large Vertical Displays Supporting Collaborative Work. In Collaboration Meets Interactive Spaces. Springer International Publishing, Cham, 75--96.",
      "doi": ""
    },
    {
      "text": "David Ledo, Saul Greenberg, Nicolai Marquardt, and Sebastian Boring. 2015. Proxemic-Aware Controls: Designing Remote Controls for Ubiquitous Computing Ecologies. In Proceedings of the ACM Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, New York, NY, USA, 187--198.  ",
      "doi": "10.1145/2785830.2785871"
    },
    {
      "text": "Bongshin Lee, Petra Isenberg, Nathalie Henry Riche, and Sheelagh Carpendale. 2012. Beyond Mouse and Keyboard: Expanding Design Considerations for Information Visualization Interactions. IEEE Transactions on Visualization and Computer Graphics 18, 12 (Dec. 2012), 2689--2698.  ",
      "doi": "10.1109/TVCG.2012.204"
    },
    {
      "text": "Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, Eric Lecolinet, and Wendy E. Mackay. 2014. Effects of display size and navigation type on a classification task. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 4147--4156.  ",
      "doi": "10.1145/2556288.2557020"
    },
    {
      "text": "Nicolai Marquardt and Saul Greenberg. 2012. Informing the Design of Proxemic Interactions. IEEE Pervasive Computing 11, 2 (Feb. 2012), 14--23.  ",
      "doi": "10.1109/MPRV.2012.15"
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Crossdevice interaction via micro-mobility and f-formations. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 13--22.  ",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Will McGrath, Brian Bowman, David McCallum, Juan David HincapiéRamos, Niklas Elmqvist, and Pourang Irani. 2012. Branch-exploremerge: Facilitating Real-time Revision Control in Collaborative Visual Exploration. In Proceedings of the ACM Conference on Interactive Tabletops and Surfaces. ACM, New York, NY, USA, 235--244.  ",
      "doi": "10.1145/2396636.2396673"
    },
    {
      "text": "Dominik Moritz, Chenglong Wang, Greg L. Nelson, Halden Lin, Adam M. Smith, Bill Howe, and Jeffrey Heer. 2019. Formalizing Visualization Design Knowledge as Constraints: Actionable and Extensible Models in Draco. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 438--448.",
      "doi": "10.1109/TVCG.2018.2865240"
    },
    {
      "text": "Michael Nebeling. 2017. XDBrowser 2.0: Semi-Automatic Generation of Cross-Device Interfaces. In Proceedings of the ACM Conference on Vistribute CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Human Factors in Computing Systems. ACM, New York, NY, USA, 4574-- 4584.  ",
      "doi": "10.1145/3025453.3025547"
    },
    {
      "text": "Michael Nebeling and Anind K. Dey. 2016. XDBrowser: User-Defined Cross-Device Web Page Designs. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 5494--5505.  ",
      "doi": "10.1145/2858036.2858048"
    },
    {
      "text": "Seonwook Park, Antti Oulasvirta, Otmar Hilliges, Christoph Gebhardt, Roman Rädle, Anna Maria Feit, Hana Vrzakova, Niraj Ramesh Dayama, Hui-Shyong Yeo, Clemens N. Klokmose, and Aaron Quigley. 2018. AdaM: Adapting Multi-User Interfaces for Collaborative Environments in Real-Time. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 184:1--184:14.  ",
      "doi": "10.1145/3173574.3173758"
    },
    {
      "text": "Thomas Plank, Hans-Christian Jetter, Roman Rädle, Clemens N. Klokmose, Thomas Luger, and Harald Reiterer. 2017. Is Two Enough?! Studying Benefits, Barriers, and Biases of Multi-Tablet Use for Collaborative Visualization. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 4548--4560.  ",
      "doi": "10.1145/3025453.3025537"
    },
    {
      "text": "Zening Qu and Jessica Hullman. 2018. Keeping Multiple Views Consistent: Constraints, Validations, and Exceptions in Visualization Authoring. IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan. 2018), 468--477.",
      "doi": ""
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Jonathan Fischer, Inti Gabriel, Clemens N. Klokmose, Harald Reiterer, and Christian Holz. 2018. PolarTrack: Optical Outside-In Device Tracking that Exploits Display Polarization. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 497:1--497:9.  ",
      "doi": "10.1145/3173574.3174071"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the ACM Conference on Interactive Tabletops and Surfaces. ACM, New York, NY, USA, 45--54.  ",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Roman Rädle, Midas Nouwens, Kristian Antonsen, James R. Eagan, and Clemens N. Klokmose. 2017. Codestrates: Literate Computing with Webstrates. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 715--725.  ",
      "doi": "10.1145/3126594.3126642"
    },
    {
      "text": "Jonathan C. Roberts. 2007. State of the Art: Coordinated & Multiple Views in Exploratory Visualization. In Proccedings of the IEEE Conference on Coordinated and Multiple Views in Exploratory Visualization. IEEE, Piscataway, NJ, USA, 61--71.  ",
      "doi": "10.1109/CMV.2007.20"
    },
    {
      "text": "Jonathan C. Roberts, Panagiotis D. Ritsos, Sriram Karthik Badam, Dominique Brodbeck, Jessie Kennedy, and Niklas Elmqvist. 2014. Visualization beyond the Desktop-the Next Big Thing. IEEE Computer Graphics and Applications 34, 6 (Nov. 2014), 26--34.",
      "doi": ""
    },
    {
      "text": "Stephanie Santosa and Daniel Wigdor. 2013. A field study of multidevice workflows in distributed workspaces. In Proceedings of the ACM Conference on Pervasive and Ubiquitous Computing. ACM, New York, NY, USA, 63--72.  ",
      "doi": "10.1145/2493432.2493476"
    },
    {
      "text": "Alper Sarikaya, Michael Correll, Lyn Bartram, Melanie Tory, and Danyel Fisher. 2019. What Do We Talk About When We Talk About Dashboards? IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 682--692.",
      "doi": "10.1109/TVCG.2018.2864903"
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 341--350.  ",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Arvind Satyanarayan, Kanit Wongsuphasawat, and Jeffrey Heer. 2014. Declarative interaction design for data visualization. In Proceedings of the ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 669--678.  ",
      "doi": "10.1145/2642918.2647360"
    },
    {
      "text": "Mario Schreiner, Roman Rädle, Hans-Christian Jetter, and Harald Reiterer. 2015. Connichiwa: A Framework for Cross-Device Web Applications. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, New York, NY, USA, 2163--2168.  ",
      "doi": "10.1145/2702613.2732909"
    },
    {
      "text": "Shaishav Siddhpuria, Sylvain Malacria, Mathieu Nancel, and Edward Lank. 2018. Pointing at a Distance with Everyday Smart Devices. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 173:1--173:11.  ",
      "doi": "10.1145/3173574.3173747"
    },
    {
      "text": "Martin Spindler, Christian Tominski, Heidrun Schumann, and Raimund Dachselt. 2010. Tangible views for information visualization. In Proceedings of the ACM Conference on Interactive Tabletops and Surfaces. ACM, New York, NY, USA, 157--166.  ",
      "doi": "10.1145/1936652.1936684"
    },
    {
      "text": "Ulrich von Zadow, Wolfgang Büschel, Ricardo Langner, and Raimund Dachselt. 2014. SleeD: Using a Sleeve Display to Interact with Touchsensitive Display Walls. In Proceedings of the ACM Conference on Interactive Tabletops and Surfaces. ACM, New York, NY, USA, 129--138.  ",
      "doi": "10.1145/2669485.2669507"
    },
    {
      "text": "Pawel Wozniak, Lars Lischke, Benjamin Schmidt, Shengdong Zhao, and Morten Fjeld. 2014. Thaddeus: a dual device interaction space for exploring information visualisation. In Proceedings of the ACM Nordic Conference on Human-Computer Interaction. ACM, New York, NY, USA, 41--50.  ",
      "doi": "10.1145/2639189.2639237"
    },
    {
      "text": "Jishuo Yang and Daniel Wigdor. 2014. Panelrama: enabling easy specification of cross-device web applications. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2783--2792.  ",
      "doi": "10.1145/2556288.2557199"
    },
    {
      "text": "Ji Soo Yi, Youn ah Kang, and John Stasko. 2007. Toward a Deeper Understanding of the Role of Interaction in Information Visualization. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov. 2007), 1224--1231.  ",
      "doi": "10.1109/TVCG.2007.70515"
    }
  ]
}