{
  "doi": "10.1145/3290605.3300429",
  "title": "Understanding Perceptions of Problematic Facebook Use: When People Experience Negative Life Impact and a Lack of Control",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "While many people use social network sites to connect with friends and family, some feel that their use is problematic, seriously affecting their sleep, work, or life. Pairing a survey of 20,000 Facebook users measuring perceptions of problematic use with behavioral and demographic data, we examined Facebook activities associated with problematic use as well as the kinds of people most likely to experience it. People who feel their use is problematic are more likely to be younger, male, and going through a major life event such as a breakup. They spend more time on the platform, particularly at night, and spend proportionally more time looking at profiles and less time browsing their News Feeds. They also message their friends more frequently. While they are more likely to respond to notifications, they are also more likely to deactivate their accounts, perhaps in an effort to better manage their time. Further, they are more likely to have seen content about social media or phone addiction. Notably, people reporting problematic use rate the site as more valuable to them, highlighting the complex relationship between technology use and well-being. A better understanding of problematic Facebook use can inform the design of context-appropriate and supportive tools to help people become more in control.",
  "authors": [
    {
      "name": "Justin Cheng",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553324256",
      "orcid": "missing"
    },
    {
      "name": "Moira Burke",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100241308",
      "orcid": "missing"
    },
    {
      "name": "Elena Goetz Davis",
      "institution": "Facebook, Menlo Park, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366729",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cecilie Schou Andreassen, Ståle Pallesen, and Mark D Grifths. 2017. The relationship between addictive use of social media, narcissism, and self-esteem: Findings from a large national survey. Addictive Behaviors (2017).",
      "doi": ""
    },
    {
      "text": "Cecilie Schou Andreassen, Torbjørn Torsheim, Geir Scott Brunborg, and Ståle Pallesen. 2012. Development of a Facebook addiction scale. Psychological Reports (2012).",
      "doi": ""
    },
    {
      "text": "Apple. 2018. iOS 12 introduces new features to reduce interruptions and manage Screen Time. https://nr.apple.com/dE4W3o6n3T.",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association. 2013. Diagnostic and Statistical Manual of Mental Disorders (DSM-5®).",
      "doi": ""
    },
    {
      "text": "Fanni Bányai, Ágnes Zsila, Orsolya Király, Aniko Maraz, Zsuzsanna Elekes, Mark D Grifths, Cecilie Schou Andreassen, and Zsolt Demetrovics. 2017. Problematic social media use: Results from a large-scale nationally representative adolescent sample. PLoS One (2017).",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer, Phil Adams, Vera D Khovanskaya, Tony C Liao, Madeline E Smith, Victoria Schwanda Sosik, and Kaiton Williams. 2013. Limiting, leaving, and (re) lapsing: an exploration of facebook non-use practices and experiences. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Katherine Bessiere, Sara Kiesler, Robert Kraut, and Bonka S Boneva. 2008. Efects of Internet use and social resources on changes in depression. Information, Community & Society (2008).",
      "doi": ""
    },
    {
      "text": "Joël Billieux, Adriano Schimmenti, Yasser Khazaal, Pierre Maurage, and Alexandre Heeren. 2015. Are we overpathologizing everyday life? A tenable blueprint for behavioral addiction research. Journal of Behavioral Addictions (2015).",
      "doi": ""
    },
    {
      "text": "Roberta Biolcati, Giacomo Mancini, Virginia Pupi, and Valeria Mugheddu. 2018. Facebook Addiction: Onset Predictors. Journal of Clinical Medicine (2018).",
      "doi": ""
    },
    {
      "text": "Agata Blachnio and Aneta Przepiorka. 2018. Be Aware! If You Start Using Facebook Problematically You Will Feel Lonely: Phubbing, Loneliness, Self-esteem, and Facebook Intrusion. A Cross-Sectional Study. Social Science Computer Review (2018).",
      "doi": ""
    },
    {
      "text": "Agata Blachnio, Aneta Przepiorka, and Igor Pantic. 2016. Association between Facebook addiction, self-esteem and life satisfaction: A crosssectional study. Computers in Human Behavior (2016).  ",
      "doi": "10.1016/j.chb.2015.10.026"
    },
    {
      "text": "danah boyd. 2010. Risk reduction strategies on Facebook.",
      "doi": ""
    },
    {
      "text": "Nicola Luigi Bragazzi and Giovanni Del Puente. 2014. A proposal for including nomophobia in the new DSM-V. Psychology Research and Behavior Management (2014).",
      "doi": ""
    },
    {
      "text": "Julia Brailovskaia, Tobias Teismann, and Jürgen Margraf. 2018. Physical activity mediates the association between daily stress and Facebook Addiction Disorder (FAD)A longitudinal approach among German students. Computers in Human Behavior (2018).",
      "doi": ""
    },
    {
      "text": "Sarah L Buglass, Jens F Binder, Lucy R Betts, and Jean DM Underwood. 2017. Motivators of online vulnerability: The impact of social network site use and FOMO. Computers in Human Behavior (2017).  ",
      "doi": "10.1016/j.chb.2016.09.055"
    },
    {
      "text": "Moira Burke and Robert E Kraut. 2014. Growing closer on facebook: changes in tie strength through social network site use. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2556288.2557094"
    },
    {
      "text": "Moira Burke and Robert E Kraut. 2016. The relationship between Facebook use and well-being depends on communication type and tie strength. Journal of Computer-Mediated Communication (2016).  ",
      "doi": "10.1111/jcc4.12162"
    },
    {
      "text": "Emre Çam and Onur Isbulan. 2012. A New Addiction for Teacher Candidates: Social Networks. Turkish Online Journal of Educational Technology (2012).",
      "doi": ""
    },
    {
      "text": "Scott E Caplan. 2003. Preference for online social interaction: A theory of problematic Internet use and psychosocial well-being. Communication Research (2003).",
      "doi": ""
    },
    {
      "text": "Scott E Caplan. 2005. A social skill account of problematic Internet use. Journal of Communication (2005).",
      "doi": ""
    },
    {
      "text": "Hilarie Cash, Cosette D Rae, Ann H Steel, and Alexander Winkler. 2012. Internet addiction: A brief summary of research and practice. Current Psychiatry Reviews (2012).",
      "doi": ""
    },
    {
      "text": "Kaustav Chakraborty, Debashis Basu, KG Kumar, et al. 2010. Internet addiction: consensus, controversies, and the way ahead. East Asian Archives of Psychiatry (2010).",
      "doi": ""
    },
    {
      "text": "Hui-Tzu Grace Chou and Nicholas Edge. 2012. 'They are happier and having better lives than I am?: the impact of using Facebook on perceptions of others' lives. Cyberpsychology, Behavior, and Social Networking (2012).",
      "doi": ""
    },
    {
      "text": "Alexander Coppock, Emily Ekins, David Kirby, et al. 2018. The Longlasting Efects of Newspaper Op-Eds on Public Opinion. Quarterly Journal of Political Science (2018).",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Edward Cutrell, and Eric Horvitz. 2000. Instant messaging and interruption: Infuence of task type on performance. In Proceedings of the Australian Computer-Human Interaction Conference.",
      "doi": ""
    },
    {
      "text": "Rozane De Cock, Jolien Vangeel, Annabelle Klein, Pascal Minotte, Omar Rosas, and Gert-Jan Meerkerk. 2014. Compulsive use of social networking sites in Belgium: Prevalence, profle, and the role of attitude toward work and school. Cyberpsychology, Behavior, and Social Networking (2014).",
      "doi": ""
    },
    {
      "text": "Fenne Große Deters and Matthias R Mehl. 2013. Does posting Facebook status updates increase or decrease loneliness? An online social networking experiment. Social Psychological and Personality Science (2013).",
      "doi": ""
    },
    {
      "text": "Morton Deutsch and Harold B Gerard. 1955. A study of normative and informational social infuences upon individual judgment. Journal of Abnormal and Social Psychology (1955).",
      "doi": ""
    },
    {
      "text": "Áine Dunne, Margaret-Anne Lawlor, and Jennifer Rowley. 2010. Young people's use of online social networking sites a uses and gratifcations perspective. Journal of Research in Interactive Marketing (2010).",
      "doi": ""
    },
    {
      "text": "Tony Durkee, Michael Kaess, Vladimir Carli, Peter Parzer, Camilla Wasserman, Birgitta Floderus, Alan Apter, Judit Balazs, Shira Barzilay, Julio Bobes, et al. 2012. Prevalence of pathological internet use among adolescents in Europe: demographic and social factors. Addiction (2012).",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison, Charles Steinfeld, and Clif Lampe. 2007. The benefts of Facebook friends?: Social capital and college students' use of online social network sites. Journal of Computer-Mediated Communication (2007).",
      "doi": ""
    },
    {
      "text": "Rachel A Elphinston and Patricia Noller. 2011. Time to face it! Facebook intrusion and the implications for romantic jealousy and relationship satisfaction. Cyberpsychology, Behavior, and Social Networking (2011).",
      "doi": ""
    },
    {
      "text": "Tania Fernández-Villa, Antonio J Molina, Miguel García-Martín, Javier Llorca, Miguel Delgado-Rodríguez, and Vicente Martín. 2015. Validation and psychometric analysis of the Internet Addiction Test in Spanish among college students. BMC Public Health (2015).",
      "doi": ""
    },
    {
      "text": "Sarah Katherine Foregger. 2008. Uses and gratifcations of Facebook.com.",
      "doi": ""
    },
    {
      "text": "Homero Gil de Zúñiga, Nakwon Jung, and Sebastián Valenzuela. 2012. Social media use for news and individuals' social capital, civic engagement and political participation. Journal of Computer-Mediated Communication (2012).  ",
      "doi": "10.1111/j.1083-6101.2012.01574.x"
    },
    {
      "text": "Eric Gilbert and Karrie Karahalios. 2009. Predicting tie strength with social media. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/1518701.1518736"
    },
    {
      "text": "Amy L Gonzales and Jefrey T Hancock. 2011. Mirror, mirror on my Facebook wall: Efects of exposure to Facebook on self-esteem. Cyberpsychology, Behavior, and Social Networking (2011).",
      "doi": ""
    },
    {
      "text": "Google. 2018. Digital Wellbeing. https://wellbeing.google/.",
      "doi": ""
    },
    {
      "text": "David Greenfeld. 2011. The addictive properties of internet usage. Internet addiction: A handbook and guide to evaluation and treatment (2011).",
      "doi": ""
    },
    {
      "text": "Mark Grifths. 2005. A 'components' model of addiction within a biopsychosocial framework. Journal of Substance Use (2005).",
      "doi": ""
    },
    {
      "text": "Mark D Grifths. 2012. Facebook addiction: concerns, criticism, and recommendationsÐa response to Andreassen and colleagues. Psychological Reports (2012).",
      "doi": ""
    },
    {
      "text": "Keith Hampton, Lauren Sessions Goulet, Lee Rainie, and Kristen Purcell. 2011. Social networking sites and our lives. Pew Internet & American Life Project (2011).",
      "doi": ""
    },
    {
      "text": "Lisa Harris and Alan Rae. 2009. Social networks: the future of marketing for small business. Journal of Business Strategy (2009).",
      "doi": ""
    },
    {
      "text": "Qinghua He, Ofr Turel, and Antoine Bechara. 2017. Brain anatomy alterations associated with Social Networking Site (SNS) addiction. Scientifc Reports (2017).",
      "doi": ""
    },
    {
      "text": "Thomas H Holmes and Richard H Rahe. 1967. The social readjustment rating scale. Journal of Psychosomatic Research (1967).",
      "doi": ""
    },
    {
      "text": "Fu-Yuan Hong, Der-Hsiang Huang, Hung-Yu Lin, and Su-Lin Chiu. 2014. Analysis of the psychological traits, Facebook usage, and Facebook addiction model of Taiwanese university students. Telematics and Informatics (2014).",
      "doi": ""
    },
    {
      "text": "Yifeng Hu, Jacqueline Fowler Wood, Vivian Smith, and Nalova Westbrook. 2004. Friendships through IM: Examining the relationship between instant messaging and intimacy. Journal of Computer-Mediated Communication (2004).",
      "doi": ""
    },
    {
      "text": "Stefano M Iacus, Gary King, and Giuseppe Porro. 2012. Causal inference without balance checking: Coarsened exact matching. Political Analysis (2012).",
      "doi": ""
    },
    {
      "text": "Alexander H Jordan, Benoît Monin, Carol S Dweck, Benjamin J Lovett, Oliver P John, and James J Gross. 2011. Misery has more company than people think: Underestimating the prevalence of others' negative emotions. Personality and Social Psychology Bulletin (2011).",
      "doi": ""
    },
    {
      "text": "Yaniv Kanat-Maymon, Lian Almog, Rinat Cohen, and Yair AmichaiHamburger. 2018. Contingent self-worth and Facebook addiction. Computers in Human Behavior (2018).",
      "doi": ""
    },
    {
      "text": "Daniel Kardefelt-Winther, Alexandre Heeren, Adriano Schimmenti, Antonius van Rooij, Pierre Maurage, Michelle Carras, Johan Edman, Alexander Blaszczynski, Yasser Khazaal, and Joël Billieux. 2017. How can we conceptualize behavioural addiction without pathologizing common behaviours? Addiction (2017).",
      "doi": ""
    },
    {
      "text": "Kyunghee Kim, Eunjung Ryu, Mi-Young Chon, Eun-Ja Yeun, So-Young Choi, Jeong-Seok Seo, and Bum-Woo Nam. 2006. Internet addiction in Korean adolescents and its relation to depression and suicidal ideation: a questionnaire survey. International Journal of Nursing Studies (2006).",
      "doi": ""
    },
    {
      "text": "Paul A Kirschner and Aryn C Karpinski. 2010. Facebook® and academic performance. Computers in Human Behavior (2010).  ",
      "doi": "10.1016/j.chb.2010.03.024"
    },
    {
      "text": "Chih-Hung Ko, Ju-Yu Yen, Cheng-Chung Chen, Sue-Huei Chen, and Cheng-Fang Yen. 2005. Gender diferences and related factors affecting online gaming addiction among Taiwanese adolescents. The Journal of Nervous and Mental Disease (2005).",
      "doi": ""
    },
    {
      "text": "Chih-Hung Ko, Ju-Yu Yen, Sue-Huei Chen, Ming-Jen Yang, HuangChi Lin, and Cheng-Fang Yen. 2009. Proposed diagnostic criteria and the screening and diagnosing tool of Internet addiction in college students. Comprehensive Psychiatry (2009).",
      "doi": ""
    },
    {
      "text": "Mustafa Koc and Seval Gulyagci. 2013. Facebook addiction among Turkish college students: The role of psychological health, demographic, and usage characteristics. Cyberpsychology, Behavior, and Social Networking (2013).",
      "doi": ""
    },
    {
      "text": "Silvia Kratzer and Ulrich Hegerl. 2008. Is 'Internet Addiction' a disorder of its own a study on subjects with excessive internet use. Psychiatrische Praxis (2008).",
      "doi": ""
    },
    {
      "text": "Kostadin Kushlev, Jason Proulx, and Elizabeth W Dunn. 2016. Silence your phones: Smartphone notifcations increase inattention and hyperactivity symptoms. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2858036.2858359"
    },
    {
      "text": "Daria Kuss and Mark Grifths. 2014. Internet Addiction in Psychotherapy.",
      "doi": ""
    },
    {
      "text": "Daria J Kuss and Mark D Grifths. 2011. Online social networking and addiction - a review of the psychological literature. International Journal of Environmental Research and Public Health (2011).",
      "doi": ""
    },
    {
      "text": "Daria J Kuss and Mark D Grifths. 2017. Social networking sites and addiction: Ten lessons learned. International Journal of Environmental Research and Public Health (2017).",
      "doi": ""
    },
    {
      "text": "Simone Lanette, Phoebe K Chua, Gillian Hayes, and Melissa Mazmanian. 2018. How Much is' Too Much': The Role of a Smartphone Addiction Narrative in Individuals' Experience of Use. Proceedings of the ACM Conference on Computer Supported Cooperative Work and Social Computing (2018).  ",
      "doi": "10.1145/3274370"
    },
    {
      "text": "Jong-Eun Roselyn Lee, David Clark Moore, Eun-A Park, and Sung Gwan Park. 2012. Who wants to be 'friend-rich' Social compensatory friending on Facebook and the moderating role of public self-consciousness. Computers in Human Behavior (2012).  ",
      "doi": "10.1016/j.chb.2012.01.006"
    },
    {
      "text": "Zach WY Lee, Christy MK Cheung, and Dimple R Thadani. 2012. An investigation into the problematic use of Facebook. In Proceedings of the Hawaii International Conference on System Sciences.  ",
      "doi": "10.1109/HICSS.2012.106"
    },
    {
      "text": "Maxwell McCombs. 2002. The agenda-setting role of the mass media in the shaping of public opinion. In Mass Media Economics 2002 Conference, London School of Economics.",
      "doi": ""
    },
    {
      "text": "Soraya Mehdizadeh. 2010. Self-presentation 2.0: Narcissism and self-esteem on Facebook. Cyberpsychology, Behavior, and Social Networking (2010).",
      "doi": ""
    },
    {
      "text": "Megan A Moreno, Lauren A Jelenchick, Katie G Egan, Elizabeth Cox, Henry Young, Kerry E Gannon, and Tara Becker. 2011. Feeling bad on Facebook: Depression disclosures by college students on a social networking site. Depression and Anxiety (2011).",
      "doi": ""
    },
    {
      "text": "Jonathan A Obar, Paul Zube, and Cliford Lampe. 2012. Advocacy 2.0: An analysis of how advocacy groups in the United States perceive and use social media as tools for facilitating civic engagement and collective action. Journal of Information Policy (2012).",
      "doi": ""
    },
    {
      "text": "Ursula Oberst, Elisa Wegmann, Benjamin Stodt, Matthias Brand, and Andrés Chamarro. 2017. Negative consequences from heavy social networking in adolescents: The mediating role of fear of missing out. Journal of Adolescence (2017).",
      "doi": ""
    },
    {
      "text": "Brid O'Conaill and David Frohlich. 1995. Timespace in the workplace: Dealing with interruptions. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems: Companion.  ",
      "doi": "10.1145/223355.223665"
    },
    {
      "text": "World Health Organization. 2018. International Classifcation of Diseases (ICD-11). https://icd.who.int/browse11/l-m/en.",
      "doi": ""
    },
    {
      "text": "Wei Peng, Junghyun Kim, and Robert LaRose. 2010. Social networking: Addictive, compulsive, problematic, or just another media habit? In A networked self.",
      "doi": ""
    },
    {
      "text": "KU Petersen, N Weymann, Y Schelb, R Thiel, and R Thomasius. 2009. Pathological Internet use epidemiology, diagnostics, co-occurring disorders and treatment.",
      "doi": ""
    },
    {
      "text": "Ronald Pies. 2009. Should DSM-V designate 'Internet addiction' a mental disorder? Psychiatry (2009).",
      "doi": ""
    },
    {
      "text": "Philip M Podsakof, Scott B MacKenzie, and Nathan P Podsakof. 2012. Sources of method bias in social science research and recommendations on how to control it. Annual Review of Psychology (2012).",
      "doi": ""
    },
    {
      "text": "Andrew K Przybylski, Kou Murayama, Cody R DeHaan, and Valerie Gladwell. 2013. Motivational, emotional, and behavioral correlates of fear of missing out. Computers in Human Behavior (2013).",
      "doi": ""
    },
    {
      "text": "Andrew K Przybylski and Netta Weinstein. 2017. A large-scale test of the goldilocks hypothesis: quantifying the relations between digitalscreen use and the mental well-being of adolescents. Psychological Science (2017).",
      "doi": ""
    },
    {
      "text": "Ameet Ranadive and David Ginsberg. 2018. New Tools to Manage Your Time on Facebook and Instagram. https://newsroom.fb.com/ news/2018/08/manage-your-time/.",
      "doi": ""
    },
    {
      "text": "James Roberts, Luc Yaya, and Chris Manolis. 2014. The invisible addiction: Cell-phone activities and addiction among male and female college students. Journal of Behavioral Addictions (2014).",
      "doi": ""
    },
    {
      "text": "Hans-Jürgen Rumpf, Ad A Vermulst, Anja Bischof, Nadin Kastirke, Diana Gürtler, Gallus Bischof, Gert-Jan Meerkerk, Ulrich John, and Christian Meyer. 2014. Occurence of internet addiction in a general population sample: a latent class analysis. European Addiction Research (2014).",
      "doi": ""
    },
    {
      "text": "Tracii Ryan, Andrea Chester, John Reece, and Sophia Xenos. 2014. The uses and abuses of Facebook: A review of Facebook addiction. Journal of Behavioral Addictions (2014).",
      "doi": ""
    },
    {
      "text": "Tracii Ryan and Sophia Xenos. 2011. Who uses Facebook? An investigation into the relationship between the Big Five, shyness, narcissism, loneliness, and Facebook usage. Computers in Human Behavior (2011).  ",
      "doi": ""
    },
    {
      "text": "Ashley M Shaw, Kiara R Timpano, Tanya B Tran, and Jutta Joormann. 2015. Correlates of Facebook usage patterns: The relationship between passive Facebook use, social anxiety symptoms, and brooding. Computers in Human Behavior (2015).  ",
      "doi": "10.1016/j.chb.2015.02.003"
    },
    {
      "text": "We Are Social. 2018. Global Digital Report 2018. https://digitalreport. wearesocial.com/.",
      "doi": ""
    },
    {
      "text": "Cheri Speier, Iris Vessey, and Joseph S Valacich. 2003. The efects of interruptions, task complexity, and information presentation on computer-supported decision-making performance. Decision Sciences (2003).",
      "doi": ""
    },
    {
      "text": "Laurence Steinberg. 2008. A social neuroscience perspective on adolescent risk-taking. Developmental Review (2008).",
      "doi": ""
    },
    {
      "text": "Laurence Steinberg and Kathryn C Monahan. 2007. Age diferences in resistance to peer infuence. Developmental Psychology (2007).",
      "doi": ""
    },
    {
      "text": "Jih-Hsin Tang, Ming-Chun Chen, Cheng-Ying Yang, Tsai-Yuan Chung, and Yao-An Lee. 2016. Personality traits, interpersonal relationships, online social support, and Facebook addiction. Telematics and Informatics (2016).  ",
      "doi": "10.1016/j.tele.2015.06.003"
    },
    {
      "text": "Ran Tao, Xiuqin Huang, Jinan Wang, Huimin Zhang, Ying Zhang, and Mengchen Li. 2010. Proposed diagnostic criteria for internet addiction. Addiction (2010).",
      "doi": ""
    },
    {
      "text": "Eveline Teppers, Koen Luyckx, Theo A Klimstra, and Luc Goossens. 2014. Loneliness and Facebook motives in adolescence: A longitudinal inquiry into directionality of efect. Journal of Adolescence (2014).",
      "doi": ""
    },
    {
      "text": "Jean M Twenge, Gabrielle N Martin, and W Keith Campbell. 2018. Decreases in psychological well-being among American adolescents after 2012 and links to screen time during the rise of smartphone technology. Emotion (2018).",
      "doi": ""
    },
    {
      "text": "Recep Uysal, Seydi Ahmet Satici, and Ahmet Akin. 2013. Mediating efect of Facebook® addiction on the relationship between subjective vitality and subjective happiness. Psychological Reports (2013).",
      "doi": ""
    },
    {
      "text": "Patti M Valkenburg and Jochen Peter. 2007. Online communication and adolescent well-being: Testing the stimulation versus the displacement hypothesis. Journal of Computer-Mediated Communication (2007).",
      "doi": ""
    },
    {
      "text": "Patti M Valkenburg and Jochen Peter. 2009. The efects of instant messaging on the quality of adolescents' existing friendships: A longitudinal study. Journal of Communication (2009).",
      "doi": ""
    },
    {
      "text": "Regina JJM Van den Eijnden, Gert-Jan Meerkerk, Ad A Vermulst, Renske Spijkerman, and Rutger CME Engels. 2008. Online communication, compulsive Internet use, and psychosocial well-being among adolescents: a longitudinal study. Developmental Psychology (2008).",
      "doi": ""
    },
    {
      "text": "Philippe Verduyn, David Seungjae Lee, Jiyoung Park, Holly Shablack, Ariana Orvell, Joseph Bayer, Oscar Ybarra, John Jonides, and Ethan Kross. 2015. Passive Facebook usage undermines afective well-being: Experimental and longitudinal evidence. Journal of Experimental Psychology: General (2015).",
      "doi": ""
    },
    {
      "text": "Erin A Vogel, Jason P Rose, Bradley M Okdie, Katheryn Eckles, and Brittany Franz. 2015. Who compares and despairs? The efect of social comparison orientation on social media use and its outcomes. Personality and Individual Diferences (2015).",
      "doi": ""
    },
    {
      "text": "Aviv Weinstein and Michel Lejoyeux. 2010. Internet addiction or excessive internet use. American Journal of Drug and Alcohol Abuse (2010).",
      "doi": ""
    },
    {
      "text": "Barry Wellman and Scot Wortley. 1990. Diferent strokes from different folks: Community ties and social support. Amer. J. Sociology (1990).",
      "doi": ""
    },
    {
      "text": "Cheng-Fang Yen, Chih-Hung Ko, Ju-Yu Yen, Yu-Ping Chang, and Chung-Ping Cheng. 2009. Multi-dimensional discriminative factors for Internet addiction among adolescents regarding gender and age. Psychiatry and Clinical Neurosciences (2009).",
      "doi": ""
    },
    {
      "text": "Kimberly S Young. 1996. Psychology of computer use: XL. Addictive use of the Internet: a case that breaks the stereotype. Psychological Reports (1996).",
      "doi": ""
    },
    {
      "text": "Kimberly S Young. 1998. Internet addiction: The emergence of a new clinical disorder. Cyberpsychology & Behavior (1998).",
      "doi": ""
    },
    {
      "text": "Kimberly S Young and Cristiano Nabuco De Abreu. 2010. Internet Addiction: A Handbook and Guide to Evaluation and Treatment.",
      "doi": ""
    }
  ]
}