{
  "doi": "10.1145/3290605.3300353",
  "title": "Evaluating the Impact of Pseudo-Colour and Coordinate System on the Detection of Medication-induced ECG Changes",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "The electrocardiogram (ECG), a graphical representation of the heart's electrical activity, is used for detecting cardiac pathologies. Certain medications can produce a complication known as 'long QT syndrome', shown on the ECG as an increased gap between two parts of the waveform. Self-monitoring for this could be lifesaving, as the syndrome can result in sudden death, but detecting it on the ECG is difficult. Here we evaluate whether using pseudo-colour to highlight wave length and changing the coordinate system can support lay people in identifying increases in the QT interval. The results show that introducing colour significantly improves accuracy, and that whilst it is easier to detect a difference without colour with Cartesian coordinates, the greatest accuracy is achieved when Polar coordinates are combined with colour. The results show that applying simple visualisation techniques has the potential to improve ECG interpretation accuracy, and support people in monitoring their own ECG.",
  "tags": [
    "drug-induced lqts",
    "ecg",
    "visual perception",
    "visualisation"
  ],
  "authors": [
    {
      "name": "Alaa Alahmadi",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659169091",
      "orcid": "missing"
    },
    {
      "name": "Alan Davies",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659053353",
      "orcid": "missing"
    },
    {
      "name": "Jennifer Royle",
      "institution": "CRUK Manchester Institute & The Christie NHS Foundation, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365961",
      "orcid": "missing"
    },
    {
      "name": "Markel Vigo",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81329492781",
      "orcid": "missing"
    },
    {
      "name": "Caroline Jay",
      "institution": "University of Manchester, Manchester, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100091861",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Muhammad Adnan, Mike Just, and Lynne Baillie. 2016. Investigating time series visualisations to improve the user experience. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5444--5455.  ",
      "doi": "10.1145/2858036.2858300"
    },
    {
      "text": "Alaa Alahmadi, Alan Davies, Markel Vigo, and Caroline Jay. 2018. Can lay people identify a drug-induced QT-interval prolongation? A psychophysical and eye-tracking experiment examining the ability of non-experts to interpret an ECG. Journal of the American Medical Informatics Association (2018).",
      "doi": ""
    },
    {
      "text": "Mark E Anderson, Sana M Al-Khatib, Dan M Roden, Robert M Califf, Duke Clinical Research Institute, et al. 2002. Cardiac repolarization: current knowledge, critical gaps, and new approaches to drug development and patient management. American heart journal 144, 5 (2002), 769--781.",
      "doi": ""
    },
    {
      "text": "Ashish Atreja, Emamuzo Otobo, Karthik Ramireddy, and Allyssa Deorocki. 2018. Remote patient monitoring in IBD: current state and future directions. Current gastroenterology reports 20, 2 (2018), 6.",
      "doi": ""
    },
    {
      "text": "Arlie R Barnes, Harold EB Pardee, Paul D White, Frank N Wilson, Charles C Wolferth, et al. 1938. Standardization of precordial leads: supplementary report. American Heart Journal 15, 2 (1938), 235--239.",
      "doi": ""
    },
    {
      "text": "Markus Bindemann. 2010. Scene and screen center bias early eye movements in scene viewing. Vision research 50, 23 (2010), 2577--2587.",
      "doi": ""
    },
    {
      "text": "Raymond R Bond, Dewar D Finlay, Chris D Nugent, George Moore, and Daniel Guldenring. 2013. Methods for presenting and visualising electrocardiographic data: from temporal signals to spatial imaging. Journal of electrocardiology 46, 3 (2013), 182--196.",
      "doi": ""
    },
    {
      "text": "Joanna M Brell. 2010. Prolonged QTc interval in cancer therapeutic drug development: defining arrhythmic risk in malignancy. Progress in cardiovascular diseases 53, 2 (2010), 164--172.",
      "doi": ""
    },
    {
      "text": "A John Camm, Marek Malik, and Yee Guan Yap. 2008. Acquired long QT syndrome. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Huihua Kenny Chiang, Chao-Wei Chu, Gau-Yang Chen, and ChengDeng Kuo. 2001. A new 3-D display method for 12-lead ECG. IEEE transactions on biomedical engineering 48, 10 (2001), 1195--1202.",
      "doi": ""
    },
    {
      "text": "Ehud Chorin, Ofer Havakuk, Arnon Adler, Arie Steinvil, Uri Rozovski, Christian van der Werf, Pieter G Postema, Guy Topaz, Arthur AM Wilde, Sami Viskin, et al. 2015. Diagnostic value of T-wave morphology changes during 'QT stretching' in patients with long QT syndrome. Heart Rhythm 12, 11 (2015), 2263--2271.",
      "doi": ""
    },
    {
      "text": "Nicolas Debue and Cécile Van De Leemput. 2014. What does germane load mean? An empirical contribution to the cognitive load theory. Frontiers in psychology 5 (2014), 1099.",
      "doi": ""
    },
    {
      "text": "Andrew T Duchowski. 2007. Eye tracking methodology. Theory and practice 328 (2007). ",
      "doi": "10.5555/1215838"
    },
    {
      "text": "NA Mark Estes III. 2013. Computerized interpretation of ECGs: supplement not a substitute.",
      "doi": ""
    },
    {
      "text": "Food, HHS Drug Administration, et al. 2005. International Conference on Harmonisation; guidance on E14 Clinical Evaluation of QT/QTc Interval Prolongation and Proarrhythmic Potential for NonAntiarrhythmic Drugs; availability. Notice. Federal register 70, 202 (2005), 61134.",
      "doi": ""
    },
    {
      "text": "Ernest Frank. 1956. An accurate, clinically practical system for spatial vectorcardiography. circulation 13, 5 (1956), 737--749.",
      "doi": ""
    },
    {
      "text": "Pieter G Postema and Arthur AM Wilde. 2014. The measurement of the QT interval. Current cardiology reviews 10, 3 (2014), 287--294.",
      "doi": ""
    },
    {
      "text": "Anubhav Garg and Michael H Lehmann. 2013. Prolonged QT interval diagnosis suppression by a widely used computerized ECG analysis system. Circulation: Arrhythmia and Electrophysiology 6, 1 (2013), 76--83.",
      "doi": ""
    },
    {
      "text": "Ary L Goldberger, Luis AN Amaral, Leon Glass, Jeffrey M Hausdorff, Plamen Ch Ivanov, Roger G Mark, Joseph E Mietus, George B Moody, Chung-Kang Peng, and H Eugene Stanley. 2000. PhysioBank, PhysioToolkit, and PhysioNet: components of a new research resource for complex physiologic signals. Circulation 101, 23 (2000), e215--e220.",
      "doi": ""
    },
    {
      "text": "Ilan Goldenberg and Arthur J Moss. 2008. Long QT syndrome. Journal of the American College of Cardiology 51, 24 (2008), 2291--2300.",
      "doi": ""
    },
    {
      "text": "ILAN Goldenberg, Arthur J Moss, and Wojciech Zareba. 2006. QT interval: how to measure it and what is \"normal\". Journal of cardiovascular electrophysiology 17, 3 (2006), 333--336.",
      "doi": ""
    },
    {
      "text": "Carl Gutwin, Andy Cockburn, and Ashley Coveney. 2017. Peripheral Popout: The Influence of Visual Angle and Stimulus Intensity on Popout Effects. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 208--219.  ",
      "doi": "10.1145/3025453.3025984"
    },
    {
      "text": "Christopher G Healey. 1996. Choosing effective colours for data visualization. In Visualization'96. Proceedings. IEEE, 263--270. ",
      "doi": "10.5555/244979.245597"
    },
    {
      "text": "Christopher G Healey, Kellogg S Booth, and James T Enns. 1995. Visualizing real-time multivariate data using preattentive processing. ACM Transactions on Modeling and Computer Simulation (TOMACS) 5, 3 (1995), 190--221.  ",
      "doi": "10.1145/217853.217855"
    },
    {
      "text": "Christopher G Healey, Kellogg S Booth, and James T Enns. 1996. Highspeed visual estimation using preattentive processing. ACM Transactions on Computer-Human Interaction (TOCHI) 3, 2 (1996), 107--135.  ",
      "doi": "10.1145/230562.230563"
    },
    {
      "text": "PD Higham and RW Campbell. 1994. QT dispersion. British heart journal 71, 6 (1994), 508.",
      "doi": ""
    },
    {
      "text": "Katerina Hnatkova, Peter Smetana, Ondrej Toman, Georg Schmidt, and Marek Malik. 2016. Sex and race differences in QRS duration. Ep Europace 18, 12 (2016), 1842--1849.",
      "doi": ""
    },
    {
      "text": "Patrick Hoffman, Georges Grinstein, Kenneth Marx, Ivo Grosse, and Eugene Stanley. 1997. DNA visual and analytic data mining. In Visualization'97., Proceedings. IEEE, 437--441. ",
      "doi": "10.5555/266989.267116"
    },
    {
      "text": "Kenneth Holmqvist, Marcus Nyström, Richard Andersson, Richard Dewhurst, Halszka Jarodzka, and Joost Van de Weijer. 2011. Eye tracking: A comprehensive guide to methods and measures. OUP Oxford.",
      "doi": ""
    },
    {
      "text": "Richard H Hongo and Nora Goldschlager. 2006. Status of computerized electrocardiography. Cardiology clinics 24, 3 (2006), 491--504.",
      "doi": ""
    },
    {
      "text": "Ross Ihaka and Robert Gentleman. 1996. R: a language for data analysis and graphics. Journal of computational and graphical statistics 5, 3 (1996), 299--314.",
      "doi": ""
    },
    {
      "text": "Lars Johannesen, Jose Vicente, JW Mason, Carlos Sanabria, Kristin Waite-Labott, Mira Hong, Ping Guo, John Lin, Jens Stampe Sørensen, Loriano Galeotti, et al. 2014. Differentiating drug-induced multichannel block on the electrocardiogram: randomized study of dofetilide, quinidine, ranolazine, and verapamil. Clinical Pharmacology & Therapeutics 96, 5 (2014), 549--558.",
      "doi": ""
    },
    {
      "text": "Jonathan N Johnson and Michael J Ackerman. 2009. QTc: how long is too long? British journal of sports medicine 43, 9 (2009), 657--662.",
      "doi": ""
    },
    {
      "text": "Ijaz A Khan. 2002. Clinical and therapeutic aspects of congenital and acquired long QT syndrome. The American journal of medicine 112, 1 (2002), 58--66.",
      "doi": ""
    },
    {
      "text": "Paulus Kirchhof, Michael R Franz, Abdennasser Bardai, and Arthur M Wilde. 2009. Giant T--U Waves Precede Torsades de Pointes in Long QT Syndrome: A Systematic Electrocardiographic Analysis in Patients With Acquired and Congenital QT Prolongation. Journal of the American College of Cardiology 54, 2 (2009), 143--149.",
      "doi": ""
    },
    {
      "text": "Paul Kligfield, Fabio Badilini, Isabelle Denjoy, Saeed Babaeizadeh, Elaine Clark, Johan De Bie, Brian Devine, Fabrice Extramiana, Gianluca Generali, Richard Gregg, et al. 2018. Comparison of automated interval measurements by widely used algorithms in digital electrocardiographs. American heart journal 200 (2018), 1--10.",
      "doi": ""
    },
    {
      "text": "Jan A Kors and Gerard van Herpen. 2008. Mirror image electrocardiograms and additional electrocardiographic leads: new wine in old wineskins? Journal of electrocardiology 41, 3 (2008), 245--250.",
      "doi": ""
    },
    {
      "text": "Teri M Kozik and Shu-Fen Wung. 2012. Acquired long QT syndrome: frequency, onset, and risk factors in intensive care patients. Critical care nurse 32, 5 (2012), 32--41.",
      "doi": ""
    },
    {
      "text": "Gaëlle Leroux, Jeanne Spiess, Laure Zago, Sandrine Rossi, Amélie Lubin, Marie-Renée Turbelin, Bernard Mazoyer, Nathalie TzourioMazoyer, Olivier Houdé, and Marc Joliot. 2009. Adult brains don't fully overcome biases that lead to incorrect performance during cognitive development: an fMRI study in young adults completing a Piaget-like task. Developmental Science 12, 2 (2009), 326--338.",
      "doi": ""
    },
    {
      "text": "Lynn S Liben. 1991. Adults' performance on horizontality tasks: Conflicting frames of reference. Developmental Psychology 27, 2 (1991), 285.",
      "doi": ""
    },
    {
      "text": "Emanuela T Locati. 2017. New directions for ambulatory monitoring following 2017 HRS-ISHNE expert consensus. Journal of electrocardiology 50, 6 (2017), 828--832.",
      "doi": ""
    },
    {
      "text": "Robert L Lux, Creig R Smith, Roland F Wyatt, and JA Abildskov. 1978. Limited lead selection for estimation of body surface potential maps in electrocardiography. IEEE Transactions on Biomedical Engineering 3 (1978), 270--276.",
      "doi": ""
    },
    {
      "text": "PW Macfarlane, SC McLaughlin, B Devine, and TF Yang. 1994. Effects of age, sex, and race on ECG interval measurements. Journal of Electrocardiology 27 (1994), 14--19.",
      "doi": ""
    },
    {
      "text": "John E Madias. 2004. The 13th multiuse ECG lead: Shouldn't we use it more often, and on the same hard copy or computer screen, as the other 12 leads? Journal of electrocardiology 37, 4 (2004), 285--287.",
      "doi": ""
    },
    {
      "text": "Misha D Miller, J Porter Co-burn, and Michael J Ackerman. 2001. Diagnostic accuracy of screening electrocardiograms in long QT syndrome I. Pediatrics 108, 1 (2001), 8--12.",
      "doi": ""
    },
    {
      "text": "J Morganroth. 2001. Focus on issues in measuring and interpreting changes in the QTc interval duration. European Heart Journal Supplements 3, suppl_K (2001), K105--K111.",
      "doi": ""
    },
    {
      "text": "Arthur J Moss, Peter J Schwartz, Richard S Crampton, Dan Tzivoni, Emanuela H Locati, Jean MacCluer, W Jackson Hall, Lowell Weitkamp, G Michael Vincent, and A Garson Jr. 1991. The long QT syndrome. Prospective longitudinal study of 328 families. circulation 84, 3 (1991), 1136--1144.",
      "doi": ""
    },
    {
      "text": "Stefan P Nelwan, Jan A Kors, Simon H Meij, Jan H van Bemmel, and Maarten L Simoons. 2004. Reconstruction of the 12-lead electrocardiogram from reduced lead sets. Journal of electrocardiology 37, 1 (2004), 11--18.",
      "doi": ""
    },
    {
      "text": "Magnus O Nimmermark, John J Wang, Charles Maynard, Mauricio Cohen, Ian Gilcrist, John Heitner, Michael Hudson, Sebastian Palmeri, Galen S Wagner, and Olle Pahlm. 2011. The impact of numeric and graphic displays of ST-segment deviation levels on cardiologists' decisions of reperfusion therapy for patients with acute coronary occlusion. Journal of electrocardiology 44, 5 (2011), 502--508.",
      "doi": ""
    },
    {
      "text": "Hans-Christoph Nothdurft. 1993. The role of features in preattentive vision: Comparison of orientation, motion and color cues. Vision research 33, 14 (1993), 1937--1958.",
      "doi": ""
    },
    {
      "text": "Alex Page, Mehmet K Aktas, Tolga Soyata, Wojciech Zareba, and JeanPhilippe Couderc. 2016. \"QT clock\" to improve detection of QT prolongation in long QT syndrome patients. Heart Rhythm 13, 1 (2016), 190--198.",
      "doi": ""
    },
    {
      "text": "Alex Page, Tolga Soyata, Jean-Philippe Couderc, and Mehmet Aktas. 2015. An open source ECG clock generator for visualization of longterm cardiac monitoring data. IEEE Access 3 (2015), 2704--2714.",
      "doi": ""
    },
    {
      "text": "Konstantinos Papadopoulos and Eleni Koustriava. 2011. Piaget's waterlevel task: The impact of vision on performance. Research in developmental disabilities 32, 6 (2011), 2889--2893.",
      "doi": ""
    },
    {
      "text": "Ronald M Pickett, Georges Grinstein, Haim Levkowitz, and Stuart Smith. 1995. Harnessing preattentive perceptual processes in visualization. In Perceptual issues in visualization. Springer, 33--45.",
      "doi": ""
    },
    {
      "text": "Philip J Podrid. 2017. Ambulatory ECG monitoring. UpToDate, Waltham, MA. Accessed 6 (2017), 05--18.",
      "doi": ""
    },
    {
      "text": "Dallas Price. 2010. How to read an electrocardiogram (ECG). Part 1: Basic principles of the ECG. The normal ECG. South Sudan Medical Journal 3, 2 (2010), 26--31.",
      "doi": ""
    },
    {
      "text": "Pentti M Rautaharju. 2007. The birth of computerized electrocardiography: Hubert V. Pipberger (1920--1993). Cardiology journal 14, 4 (2007), 420--421.",
      "doi": ""
    },
    {
      "text": "Pentti M Rautaharju, Borys Surawicz, and Leonard S Gettes. 2009. AHA/ACCF/HRS recommendations for the standardization and interpretation of the electrocardiogram: part IV: the ST segment, T and U waves, and the QT interval a scientific statement from the American Heart Association Electrocardiography and Arrhythmias Committee, Council on Clinical Cardiology; the American College of Cardiology Foundation; and the Heart Rhythm Society Endorsed by the International Society for Computerized Electrocardiology. Journal of the American College of Cardiology 53, 11 (2009), 982--991.",
      "doi": ""
    },
    {
      "text": "Edwin P Rock, John Finkle, Howard J Fingert, Brian P Booth, Christine E Garnett, Stephen Grant, Robert L Justice, Richard J Kovacs, Peter R Kowey, Ignacio Rodriguez, et al. 2009. Assessing proarrhythmic potential of drugs when optimal studies are infeasible. American heart journal 157, 5 (2009), 827--836.",
      "doi": ""
    },
    {
      "text": "Dan M Roden and Prakash C Viswanathan. 2005. Genetics of acquired long QT syndrome. The Journal of clinical investigation 115, 8 (2005), 2025--2032.",
      "doi": ""
    },
    {
      "text": "Takafumi Saito, Hiroko Nakamura Miyamura, Mitsuyoshi Yamamoto, Hiroki Saito, Yuka Hoshiya, and Takumi Kaseda. 2005. Two-tone pseudo coloring: Compact visualization for one-dimensional data. (2005).",
      "doi": ""
    },
    {
      "text": "Leo Schamroth, Colin Schamroth, and Leo Schamroth. 1966. An introduction to electrocardiography. (1966).",
      "doi": ""
    },
    {
      "text": "Jürg Schläpfer and Hein J Wellens. 2017. Computer-interpreted electrocardiograms: benefits and limitations. Journal of the American College of Cardiology 70, 9 (2017), 1183--1192.",
      "doi": ""
    },
    {
      "text": "Maully Shah and Christopher Carter. 2008. Long QT syndrome: A therapeutic challenge. Annals of pediatric cardiology 1, 1 (2008), 18.",
      "doi": ""
    },
    {
      "text": "Rashmi R Shah. 2002. The significance of QT interval in drug development. British journal of clinical pharmacology 54, 2 (2002), 188--202.",
      "doi": ""
    },
    {
      "text": "Luke Solomons, Adrian Treloar, and Ryan Noronha. 2008. Competence of psychiatric clinicians in interpreting electrocardiograms and QT intervals: can they do this? Does it matter? Psychiatric Bulletin 32, 8 (2008), 291--294.",
      "doi": ""
    },
    {
      "text": "Stanley Smith Stevens. 2017. Psychophysics: Introduction to its perceptual, neural and social prospects. Routledge.",
      "doi": ""
    },
    {
      "text": "Bruno Taccardi. 1963. Distribution of heart potentials on the thoracic surface of normal human subjects. Circulation Research 12, 4 (1963), 341--352.",
      "doi": ""
    },
    {
      "text": "Soheila Talebi, Azhir Alaleh, Zuber Sam, Soman Sandeep, Ferdinand Visco, Holly Totouom-Tangho, Hossein Kalantari, and Getaw Worku Hassen. 2015. Underestimated and unreported prolonged QTc by automated ECG analysis in patients on methadone: can we rely on computer reading? Acta cardiologica 70, 2 (2015), 211--216.",
      "doi": ""
    },
    {
      "text": "Benoît Tyl, Sara Azzam, Nathalie Blanco, and William Wheeler. 2011. Improvement and limitation of the reliability of automated QT measurement by recent algorithms. Journal of electrocardiology 44, 3 (2011), 320--325.",
      "doi": ""
    },
    {
      "text": "Jose Vicente, Lars Johannesen, Jay W Mason, William J Crumb, Esther Pueyo, Norman Stockbridge, and David G Strauss. 2015. Comprehensive T wave morphology assessment in a randomized clinical study of dofetilide, quinidine, ranolazine, and verapamil. Journal of the American Heart Association 4, 4 (2015), e001615.",
      "doi": ""
    },
    {
      "text": "Sami Viskin, Uri Rosovski, Andrew J Sands, Edmond Chen, Peter M Kistler, Jonathan M Kalman, Laura Rodriguez Chavez, Pedro Iturralde Torres, Osmar A Centurión, Akira Fujiki, et al. 2005. Inaccurate electrocardiographic interpretation of long QT: the majority of physicians cannot recognize a long QT when they see one. Heart Rhythm 2, 6 (2005), 569--574.",
      "doi": ""
    },
    {
      "text": "Colin Ware. 1988. Color sequences for univariate maps: Theory, experiments and principles. IEEE Computer Graphics and Applications 8, 5 (1988), 41--49.  ",
      "doi": "10.1109/38.7760"
    },
    {
      "text": "Colin Ware. 2012. Information visualization: perception for design. Elsevier. ",
      "doi": "10.5555/2285540"
    },
    {
      "text": "Eric Welch and S Kobourov. 2017. Measuring symmetry in drawings of graphs. In Computer Graphics Forum, Vol. 36. Wiley Online Library, 341--351.  ",
      "doi": "10.1111/cgf.13192"
    },
    {
      "text": "Michele Andrisin Wittig and Mary J Allen. 1984. Measurement of adult performance on Piaget's water horizontality task. Intelligence 8, 4 (1984), 305--313.",
      "doi": ""
    },
    {
      "text": "Ke Xu, Shunan Guo, Nan Cao, David Gotz, Aiwen Xu, Huamin Qu, Zhenjie Yao, and Yixin Chen. 2018. ECGLens: Interactive Visual Exploration of Large Scale ECG Data for Arrhythmia Detection. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 663.  ",
      "doi": "10.1145/3173574.3174237"
    },
    {
      "text": "Yee Guan Yap and A John Camm. 2003. Drug induced QT prolongation and torsades de pointes. Heart 89, 11 (2003), 1363--1372.",
      "doi": ""
    }
  ]
}