{
  "doi": "10.1145/3290605.3300450",
  "title": "ElasticVR: Providing Multilevel Continuously-Changing Resistive Force and Instant Impact Using Elasticity for VR",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2019,
  "badges": [],
  "abstract": "Resistive force (e.g., due to object elasticity) and impact (e.g., due to recoil) are common effects in our daily life. However, resistive force continuously changes due to users' movements while impact instantly occurs when an event triggers it. These feedback are still not realistically provided by current VR haptic methods. In this paper, a wearable device, ElasticVR, which consists of an elastic band, servo motors and mechanical brakes, is proposed to provide the continuously-changing resistive force and instantly-occurring impact upon the user's hand to enhance VR realism. By changing two physical properties, length and extension distance, of the elastic band, ElasticVR provides multilevel resistive force with no delay and impact with little delay, respectively, for realistic and versatile VR applications. A force perception study was performed to observe users' force distinguishability of the resistive force and impact, and the prototype was built based on its results. A VR experience study further proves that the resistive force and impact from ElasticVR both outperform those from current approaches in realism. Applications using ElasticVR are also demonstrated.",
  "authors": [
    {
      "name": "Hsin-Ruey Tsai",
      "institution": "National Taiwan University & University of Tokyo, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-99658729330/rel-imgonly/new.png",
      "acmid": "99658729330",
      "orcid": "0000-0003-4764-0139"
    },
    {
      "name": "Jun Rekimoto",
      "institution": "University of Tokyo, Tokyo, Japan",
      "img": "/do/10.1145/contrib-81100008564/rel-imgonly/p2.png",
      "acmid": "81100008564",
      "orcid": "0000-0002-3629-2514"
    },
    {
      "name": "Bing-Yu Chen",
      "institution": "National Taiwan University, Taipei, Taiwan Roc",
      "img": "/do/10.1145/contrib-81100108039/rel-imgonly/rchen.jpg",
      "acmid": "81100108039",
      "orcid": "0000-0003-0169-7682"
    }
  ],
  "references": [
    {
      "text": "Merwan Achibet, Adrien Girard, Anthony Talvas, Maud Marchal, and Anatole Lécuyer. 2015. Elastic-Arm: Human-scale passive haptic feedback for augmenting interaction and perception in virtual environments. In Virtual Reality (VR), 2015 IEEE. IEEE, 63--68.",
      "doi": ""
    },
    {
      "text": "Merwan Achibet, Benoît Le Gouis, Maud Marchal, Pierre-Alexandre Leziart, Ferran Argelaguet, Adrien Girard, Anatole Lécuyer, and Hiroyuki Kajimoto. 2017. FlexiFingers: multi-finger interaction in VR combining passive haptics and pseudo-haptics. In 3D User Interfaces (3DUI), 2017 IEEE Symposium on. IEEE, 103--106.",
      "doi": ""
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. Normaltouch and texturetouch: High-fidelity 3d haptic shape rendering on handheld virtual reality controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 717--728.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Chia-Yu Chen, Yen-Yu Chen, Yi-Ju Chung, and Neng-Hao Yu. 2016. Motion guidance sleeve: Guiding the forearm rotation through external artificial muscles. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3272--3276.  ",
      "doi": "10.1145/2858036.2858275"
    },
    {
      "text": "Inrak Choi, Heather Culbertson, Mark R Miller, Alex Olwal, and Sean Follmer. 2017. Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 119--130.  ",
      "doi": "10.1145/3126594.3126599"
    },
    {
      "text": "Inrak Choi, Elliot W Hawkes, David L Christensen, Christopher J Ploch, and Sean Follmer. 2016. Wolverine: A wearable haptic interface for grasping in virtual reality. In Intelligent Robots and Systems (IROS), 2016 IEEE/RSJ International Conference on. IEEE, 986--993.",
      "doi": "10.1109/IROS.2016.7759169"
    },
    {
      "text": "Inrak Choi, Eyal Ofek, Hrvoje Benko, Mike Sinclair, and Christian Holz. 2018. CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 654.  ",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "Jun Gong, Da-Yuan Huang, Teddy Seyed, Te Lin, Tao Hou, Xin Liu, Molin Yang, Boyu Yang, Yuhan Zhang, and Xing-Dong Yang. 2018. Jetto: Using Lateral Force Feedback for Smartwatch Interactions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 426.  ",
      "doi": "10.1145/3173574.3174000"
    },
    {
      "text": "Xiaochi Gu, Yifei Zhang, Weize Sun, Yuanzhe Bian, Dao Zhou, and Per Ola Kristensson. 2016. Dexmo: An inexpensive and lightweight mechanical exoskeleton for motion capture and force feedback in VR. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1991--1995.  ",
      "doi": "10.1145/2858036.2858487"
    },
    {
      "text": "Aakar Gupta, Antony Albert Raj Irudayaraj, and Ravin Balakrishnan. 2017. HapticClench: Investigating Squeeze Sensations using Memory Alloys. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 109--117.  ",
      "doi": "10.1145/3126594.3126598"
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor's Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 525.  ",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "Seungzoo Jeong, Naoki Hashimoto, and Sato Makoto. 2004. A novel interaction system with force feedback between real-and virtual human: an entertainment system: virtual catch ball. In Proceedings of the CHI 2019, May 4--9, 2019, Glasgow, Scotland UK B. Trovato et al. 2004 ACM SIGCHI International Conference on Advances in computer entertainment technology. ACM, 61--66.  ",
      "doi": "10.1145/1067343.1067350"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating physical impact by combining tactile stimulation with electrical muscle stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 11--19.  ",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1471--1482.  ",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Jun Murayama, Laroussi Bougrila, YanLin Luo, Katsuhito Akahane, Shoichi Hasegawa, Béat Hirsbrunner, and Makoto Sato. 2004. SPIDAR G&G: a two-handed haptic interface for bimanual VR interaction. In Proceedings of EuroHaptics, Vol. 2004. 138--146.",
      "doi": ""
    },
    {
      "text": "Kazuki Nagai, Soma Tanoue, Katsuhito Akahane, and Makoto Sato. 2015. Wearable 6-DoF wrist haptic device SPIDAR-W. In SIGGRAPH Asia 2015 Haptic Media And Contents Design. ACM, 19.  ",
      "doi": "10.1145/2818384.2818403"
    },
    {
      "text": "Alvaro G Perez, Daniel Lobo, Francesco Chinello, Gabriel Cirio, Monica Malvezzi, José San Martín, Domenico Prattichizzo, and Miguel A Otaduy. 2015. Soft finger tactile rendering for wearable haptics. In World Haptics Conference (WHC), 2015 IEEE. IEEE, 327--332.",
      "doi": ""
    },
    {
      "text": "Henning Pohl, Peter Brandes, Hung Ngo Quang, and Michael Rohs. 2017. Squeezeback: Pneumatic Compression for Notifications. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5318--5330.  ",
      "doi": "10.1145/3025453.3025526"
    },
    {
      "text": "Domenico Prattichizzo, Francesco Chinello, Claudio Pacchierotti, and Monica Malvezzi. 2013. Towards wearability in fingertip haptics: a 3-dof wearable device for cutaneous force feedback. IEEE Transactions on Haptics 6, 4 (2013), 506--516.  ",
      "doi": "10.1109/TOH.2013.53"
    },
    {
      "text": "Samuel B Schorr and Allison M Okamura. 2017. Fingertip Tactile Devices for Virtual Object Manipulation and Exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3115--3119.  ",
      "doi": "10.1145/3025453.3025744"
    },
    {
      "text": "Evan Strasnick, Christian Holz, Eyal Ofek, Mike Sinclair, and Hrvoje Benko. 2018. Haptic Links: Bimanual Haptics for Virtual Reality Using Variable Stiffness Actuation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 644.  ",
      "doi": "10.1145/3173574.3174218"
    },
    {
      "text": "Hsin-Ruey Tsai and Jun Rekimoto. 2018. ElasticVR: Providing Multilevel Active and Passive Force Feedback in Virtual Reality Using Elasticity. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, D300.  ",
      "doi": "10.1145/3170427.3186540"
    },
    {
      "text": "Dzmitry Tsetserukou, Katsunari Sato, and Susumu Tachi. 2010. ExoInterfaces: novel exosceleton haptic interfaces for virtual reality, augmented sport and rehabilitation. In Proceedings of the 1st Augmented Human International Conference. ACM, 1.  ",
      "doi": "10.1145/1785455.1785456"
    },
    {
      "text": "Andre Zenner and Antonio Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (2017), 1285--1294.  ",
      "doi": "10.1109/TVCG.2017.2656978"
    }
  ]
}