{
  "doi": "10.1145/3290605.3300459",
  "title": "\"I feel it is my responsibility to stream\": Streaming and Engaging with Intangible Cultural Heritage through Livestreaming",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Globalization has led to the destruction of many cultural practices, expressions, and knowledge found within local communities. These practices, defined by UNESCO as Intangible Cultural Heritage (ICH), have been identified, promoted, and safeguarded by nations, academia, organizations and local communities to varying degrees. Despite such efforts, many practices are still in danger of being lost or forgotten forever. With the increased popularity of livestreaming in China, some streamers have begun to use livestreaming to showcase and promote ICH activities. To better understand the practices, opportunities, and challenges inherent in sharing and safeguarding ICH through livestreaming, we interviewed 10 streamers and 8 viewers from China. Through our qualitative investigation, we found that ICH streamers had altruistic motivations and engaged with viewers using multiple modalities beyond livestreams. We also found that livestreaming encouraged real-time interaction and sociality, while non-live curated videos attracted attention from a broader audience and assisted in the archiving of knowledge.",
  "authors": [
    {
      "name": "Zhicong Lu",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-99659162049/rel-imgonly/photo.jpg",
      "acmid": "99659162049",
      "orcid": "0000-0002-7761-6351"
    },
    {
      "name": "Michelle Annett",
      "institution": "MishMashMakers, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81435602390/rel-imgonly/750syv7b.png",
      "acmid": "81435602390",
      "orcid": "0000-0001-9421-1199"
    },
    {
      "name": "Mingming Fan",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81482645714/rel-imgonly/official-photo-rit-mingming-fan.jpg",
      "acmid": "81482645714",
      "orcid": "0000-0002-0356-4712"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    }
  ],
  "references": [
    {
      "text": "Syed Mustafa Ali. 2016. A Brief Introduction to Decolonial Computing. XRDS 22, 4 (jun 2016), 16--21.  ",
      "doi": "10.1145/2930886"
    },
    {
      "text": "Marilena Alivizatou-Barakou, Alexandros Kitsikidis, Filareti Tsalakanidou, Kosmas Dimitropoulos, Chantas Giannis, Spiros Nikolopoulos, Samer Al Kork, Bruce Denby, Lise Buchman, Martine Adda-Decker, Claire Pillot-Loiseau, Joëlle Tillmane, S Dupont, Benjamin Picart, Francesca Pozzi, Michela Ott, Yilmaz Erdal, Vasileios Charisis, Stelios Hadjidimitriou, Leontios Hadjileontiadis, Marius Cotescu, Christina Volioti, Athanasios Manitsaris, Sotiris Manitsaris, and Nikos Grammalidis. 2017. Intangible Cultural Heritage and New Technologies: Challenges and Opportunities for Cultural Preservation and Development. In Mixed Reality and Gamification for Cultural Heritage, Marinos Ioannides, Nadia Magnenat-Thalmann, and George Papagiannakis (Eds.). Springer International Publishing, Cham, 129--158.",
      "doi": ""
    },
    {
      "text": "Mafkereseb Kassahun Bekele, Roberto Pierdicca, Emanuele Frontoni, Eva Savina Malinverni, and James Gain. 2018. A Survey of Augmented, Virtual, and Mixed Reality for Cultural Heritage. J. Comput. Cult. Herit. 11, 2 (mar 2018), 7:1--7:36.  ",
      "doi": "10.1145/3145534"
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1998. Contextual Design: Defining Customer-Centred Systems. Morgan Kaufmann Publishers Inc. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Jie Cai, Donghee Yvette Wohn, Ankit Mittal, and Dhanush Sureshbabu. 2018. Utilitarian and Hedonic Motivations for Live Streaming Shopping. In Proceedings of the 2018 ACM International Conference on Interactive Experiences for TV and Online Video (TVX '18). ACM, New York, NY, USA, 81--88.  ",
      "doi": "10.1145/3210825.3210837"
    },
    {
      "text": "Jennie Carroll. 2004. Completing design in use: closing the appropriation cycle. In ECIS 2014 Proceedings. 44.",
      "doi": ""
    },
    {
      "text": "Jung-a Chang. 2016. From \"folk culture\" to \"great cultural heritage of China\": the aporia of the quest for the essence of Chinese culture. In Intangible Cultural Heritage in Contemporary China, Khun Eng Kuah and Zhaohui Liu (Eds.). Routledge, 124--148.",
      "doi": ""
    },
    {
      "text": "Yi-Hsing Chang, Yu-Kai Lin, Rong-Jyue Fang, and You-Te Lu. 2017. A Situated Cultural Festival Learning System Based on Motion Sensing. Eurasia Journal of Mathematics, Science & Technology Education 13, 3 (2017), 571--588.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 1998. Basics of qualitative research: Techniques and procedures for developing grounded theory. Thousand Oaks, CA, US: Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Elizabeth Crooke. 2007. Museums and Community. In A Companion to Museum Studies. Wiley-Blackwell, Chapter 11, 170--185.",
      "doi": ""
    },
    {
      "text": "K Dimitropoulos, S Manitsaris, F Tsalakanidou, S Nikolopoulos, B Denby, S A Kork, L Crevier-Buchman, C Pillot-Loiseau, M AddaDecker, S Dupont, J Tilmanne, M Ott, M Alivizatou, E Yilmaz, L Hadjileontiadis, V Charisis, O Deroo, A Manitsaris, I Kompatsiaris, and N Grammalidis. 2014. Capturing the intangible an introduction to the i-Treasures project. In 2014 International Conference on Computer Vision Theory and Applications (VISAPP), Vol. 2. 773--781.",
      "doi": ""
    },
    {
      "text": "Audubon Dougherty. 2011. Live-streaming mobile video : production as civic engagement. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM Press, New York, New York, USA, 425.  ",
      "doi": "10.1145/2037373.2037437"
    },
    {
      "text": "Danilo Giglitto. 2017. Community Empowerment Through the Management of Intangible Cultural Heritage in the Isle of Jura, Scotland. Imperial Journal of Interdisciplinary Research 3, 5 (2017), 567--578. https://ssrn.com/abstract=3000953",
      "doi": ""
    },
    {
      "text": "Danilo Giglitto. 2017. Using wikis for intangible cultural heritage in Scotland: suitability and empowerment. Ph.D. Dissertation. University of Aberdeen.",
      "doi": ""
    },
    {
      "text": "Danilo Giglitto, Shaimaa Lazem, and Anne Preston. 2018. In the Eye of the Student: An Intangible Cultural Heritage Experience, with a Human-Computer Interaction Twist. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 290:1--290:12.  ",
      "doi": "10.1145/3173574.3173864"
    },
    {
      "text": "A Grammatikopoulou, S Laraba, O Sahbenderoglu, K Dimitropoulos, S Douka, and N Grammalidis. 2018. An adaptive framework for the creation of exergames for intangible cultural heritage (ICH) education. Journal of Computers in Education (2018), 1--34.",
      "doi": ""
    },
    {
      "text": "Valdimar Tr Hafstein. 2008. Intangible heritage as a list: from masterpieces to representation. In Intangible heritage, Laurajane Smith and Natsuko Akagawa (Eds.). Routledge, 107--125.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson and John C. Tang. 2017. What Makes Live Events Engaging on Facebook Live, Periscope, and Snapchat. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM Press, New York, New York, USA, 48--60.  ",
      "doi": "10.1145/3025453.3025642"
    },
    {
      "text": "William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on twitch: fostering participatory communities of play within live mixed media. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM Press, New York, New York, USA, 1315--1324.  ",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "Chih-Hong Huang and Yi-Ting Huang. 2013. An Annales Schoolbased Serious Game Creation Framework for Taiwanese Indigenous Cultural Heritage. J. Comput. Cult. Herit. 6, 2 (may 2013), 9:1--9:31.  ",
      "doi": "10.1145/2460376.2460380"
    },
    {
      "text": "Alexandros Kitsikidis, Kosmas Dimitropoulos, Deniz Ugurca, Can Bayçay, Erdal Yilmaz, Filareti Tsalakanidou, Stella Douka, and Nikos Grammalidis. 2015. A game-like application for dance learning using a natural human computer interface. In International Conference on Universal Access in Human-Computer Interaction. Springer, 472--482.",
      "doi": ""
    },
    {
      "text": "Khun Eng Kuah and Zhaohui Liu. 2016. Intangible cultural heritage in contemporary China and Hong Kong: an introductory overview. In Intangible Cultural Heritage in Contemporary China. Routledge, 13--22.",
      "doi": ""
    },
    {
      "text": "K Russell Lamotte. 2002. United Nations Educational, Scientific and Cultural Organization (UNESCO): Universal Declaration on Cultural Diversity. International Legal Materials 41, 1 (2002), 57--62.",
      "doi": ""
    },
    {
      "text": "Jinglan Lin and Zhicong Lu. 2017. The Rise and Proliferation of LiveStreaming in China: Insights and Lessons. In International Conference on Human-Computer Interaction. Springer, 632--637.",
      "doi": ""
    },
    {
      "text": "William S Logan. 2007. Closing Pandora's box: human rights conundrums in cultural heritage protection. In Cultural heritage and human rights. Springer, 33--52.",
      "doi": ""
    },
    {
      "text": "Danielle Lottridge, Frank Bentley, Matt Wheeler, Jason Lee, Janet Cheung, Katherine Ong, and Cristy Rowley. 2017. Third-wave livestreaming: teens' long form selfie. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 20.  ",
      "doi": "10.1145/3098279.3098540"
    },
    {
      "text": "Zhicong Lu, Seongkook Heo, and Daniel Wigdor. 2018. StreamWiki: Enabling Viewers of Knowledge Sharing Live Streams to Collaboratively Generate Archival Documentation for Effective In-Stream and Post-Hoc Learning. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), Article 112.  ",
      "doi": "10.1145/3274381"
    },
    {
      "text": "Zhicong Lu, Haijun Xia, Seongkook Heo, and Daniel Wigdor. 2018. You Watch, You Give, and You Engage: A Study of Live Streaming Practices in China. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Paper 466, 13 pages.  ",
      "doi": "10.1145/3173574.3174040"
    },
    {
      "text": "Michela Mortara, Chiara Eva Catalano, Francesco Bellotti, Giusy Fiucci, Minica Houry-Panchetti, and Panagiotis Petridis. 2014. Learning cultural heritage by serious games. Journal of Cultural Heritage 15, 3 (2014), 318--325.",
      "doi": ""
    },
    {
      "text": "Carol Moser, Paul Resnick, and Sarita Schoenebeck. 2017. Community Commerce: Facilitating Trust in Mom-to-Mom Sale Groups on Facebook. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4344--4357.  ",
      "doi": "10.1145/3025453.3025550"
    },
    {
      "text": "China Economic Net. 2017. ???????????????? ??????????\" {Intangible Cultural Heritage Livestreams Started on Momo Platform. Livestreaming has Taken on ?cultural responsiblity\"}. http://www.ce.cn/culture/gd/201708/30/t20170830_ 25505969.shtml",
      "doi": ""
    },
    {
      "text": "William Nitzky. 2013. Community Empowerment at the Periphery? Participatory Approaches to Heritage Protection in Guizhou, China. In Cultural Heritage Politics in China, Tami Blumenfield and Helaine Silverman (Eds.). Springer New York, New York, NY, 205--232.",
      "doi": ""
    },
    {
      "text": "Guangming Online. 2017. ???????????? {ICH and livestreaming Seminar}. http://topics.gmw.cn/node_113857.htm",
      "doi": ""
    },
    {
      "text": "Johan Oomen and Lora Aroyo. 2011. Crowdsourcing in the Cultural Heritage Domain: Opportunities and Challenges. In Proceedings of the 5th International Conference on Communities and Technologies (C&T '11). ACM, New York, NY, USA, 138--149.  ",
      "doi": "10.1145/2103354.2103373"
    },
    {
      "text": "Michela Ott, Francesca Maria Dagnino, Francesca Pozzi, and Mauro Tavella. 2014. Widening Access to Intangible Cultural Heritage: towards the Development of an Innovative Platform. In Universal Access in Human-Computer Interaction. Universal Access to Information and Knowledge, Constantine Stephanidis and Margherita Antona (Eds.). Springer International Publishing, Cham, 705--713.",
      "doi": ""
    },
    {
      "text": "Soon Cheol Park. 2014. ICHPEDIA, a case study in community engagement in the safeguarding of ICH online. International Journal of Intangible Heritage 9 (2014), 69--82.",
      "doi": ""
    },
    {
      "text": "Anthony J Pellicone and June Ahn. 2017. The Game of Performing Play: Understanding Streaming As Cultural Production. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, 4863--4874.  ",
      "doi": "10.1145/3025453.3025854"
    },
    {
      "text": "Beryl Plimmer, Liang He, Tariq Zaman, Kasun Karunanayaka, Alvin W Yeo, Garen Jengan, Rachel Blagojevic, and Ellen Yi-Luen Do. 2015. New Interaction Tools for Preserving an Old Language. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3493--3502.  ",
      "doi": "10.1145/2702123.2702339"
    },
    {
      "text": "Iain J M Robertson. 2016. Heritage from below. Routledge.",
      "doi": ""
    },
    {
      "text": "Mark Roskill. 1977. The aesthetic concept of craftsmanship. The British Journal of Aesthetics 17, 2 (1977), 138--148.",
      "doi": ""
    },
    {
      "text": "W. Scott Sanders, Gopi Chand Nutakki, and Olfa Nasraoui. 2016. Testing the Application of Warranting Theory to Online Third Party Marketplaces: The Effects of Information Uniqueness and Product Type. In Proceedings of the 7th 2016 International Conference on Social Media & Society (SMSociety '16). ACM, New York, NY, USA, 16:1--16:7.  ",
      "doi": "10.1145/2930971.2930988"
    },
    {
      "text": "Richard Sennett. 2008. The craftsman. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Mary Stevens, Andrew Flinn, and Elizabeth Shepherd. 2010. New frameworks for community engagement in the archive sector: from handing over to handing on. International Journal of Heritage Studies 16, 1--2 (2010), 59--76.",
      "doi": ""
    },
    {
      "text": "Elizabeth Tait, Marsaili MacLeod, David Beel, Claire Wallace, Chris Mellish, and Stuart Taylor. 2013. Linking to the past: an analysis of community digital heritage initiatives. Aslib Proceedings 65, 6 (2013), 564--580.",
      "doi": ""
    },
    {
      "text": "John Tang, Gina Venolia, Kori Inkpen, Charles Parker, Robert Gruen, and Alicia Pelton. 2017. Crowdcasting: Remotely Participating in Live Events Through Multiple Live Streams. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 98 (Dec. 2017), 18 pages.  ",
      "doi": "10.1145/3134733"
    },
    {
      "text": "John C. Tang, Gina Venolia, and Kori M. Inkpen. 2016. Meerkat and Periscope. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM Press, New York, New York, USA, 4770--4780.  ",
      "doi": "10.1145/2858036.2858374"
    },
    {
      "text": "Yvain Tisserand, Nadia Magnenat-Thalmann, Luis Unzueta, Maria T Linaza, Amin Ahmadi, Noel E O'Connor, Nikolaos Zioulis, Dimitrios Zarpalas, and Petros Daras. 2017. Preservation and gamification of traditional sports. In Mixed Reality and Gamification for Cultural Heritage. Springer, 421--446.",
      "doi": ""
    },
    {
      "text": "UNESCO. 2003. Text of the Convention for the Safeguarding of the Intangible Cultural Heritage - intangible heritage - Culture Sector UNESCO. https://ich.unesco.org/en/convention",
      "doi": ""
    },
    {
      "text": "UNESCO. 2018. Browse the Lists of Intangible Cultural Heritage and the Register of good safeguarding practices - intangible heritage Culture Sector - UNESCO. https://ich.unesco.org/en/lists",
      "doi": ""
    },
    {
      "text": "UNESCO. 2018. China - intangible heritage - Culture Sector - UNESCO. https://ich.unesco.org/en/state/china-CN?info= elements-on-the-lists",
      "doi": ""
    },
    {
      "text": "Joseph B Walther. 1996. Computer-mediated communication: Impersonal, interpersonal, and hyperpersonal interaction. Communication research 23, 1 (1996), 3--43.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2018. Chinese city tier system. https://en.wikipedia.org/ wiki/Chinese_city_tier_system",
      "doi": ""
    },
    {
      "text": "Kuo-Shu Yang and David Y F Ho. 1988. The role of yuan in Chinese social life: A conceptual and empirical analysis. Asian contributions to psychology (1988), 263 -- 281.",
      "doi": ""
    }
  ]
}