{
  "doi": "10.1145/3290605.3300444",
  "title": "Underneath the Skin: An Analysis of YouTube Videos to Understand Insertable Device Interaction",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "During the last decade, people have started to experiment with insertable technology like RFID or NFC chips and use them for e.g. identification. However, little is known about how people in fact interact with and adapt insertables. We conducted a video analysis of 122 YouTube videos to gain insight into the interaction with the insertables. Second, we implemented an online survey to complement our data from the video analysis. Our findings show that there are many opportunities for interaction with insertables both for task-oriented and creative purposes. However, there are also multiple challenges and obstacles as well as side effects and health concerns. Our findings conclude that the current infrastructure is not ready to support the use of insertables yet, and we discuss implications of this.",
  "tags": [
    "survey",
    "youtube",
    "hobbyist",
    "nfc",
    "in the body",
    "rfid",
    "insertables",
    "interaction"
  ],
  "authors": [
    {
      "name": "Aida Komkaite",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366553",
      "orcid": "missing"
    },
    {
      "name": "Liga Lavrinovica",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366151",
      "orcid": "missing"
    },
    {
      "name": "Maria Vraka",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365618",
      "orcid": "missing"
    },
    {
      "name": "Mikael B. Skov",
      "institution": "Aalborg University, Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723616",
      "orcid": "0000-0003-4488-5683"
    }
  ],
  "references": [
    {
      "text": "Anthony, L., Kim, Y. and Findlater, L. (2013). Analyzing user-generated youtube videos to understand touchscreen use by people with motor impairments. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1223--1232.  ",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "Bhunia, S. and Young, D. J. (2012). Introduction to special issue on implantable electronics. ACM Journal on Emerging Technologies in Computing Systems (JETC), 8(2), 7.  ",
      "doi": "10.1145/2180878.2180879"
    },
    {
      "text": "Blythe, M. and Cairns, P. (2009). Critical methods and user generated content: the iPhone on YouTube. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1467--1476.  ",
      "doi": "10.1145/1518701.1518923"
    },
    {
      "text": "Camara, C., Peris-Lopez, P. and Tapiador, J. E. (2015). Security and privacy issues in implantable medical devices: A comprehensive survey. Journal of biomedical informatics, 55, 272--289.  ",
      "doi": "10.1016/j.jbi.2015.04.007"
    },
    {
      "text": "Colquitt, J.L., Mendes, D., Clegg, A.J., Harris, P., Cooper, Picot, J. and Bryant, J. (2014). Implantable cardioverter defibrillators for the treatment of arrhythmias and cardiac resynchronisation therapy for the treatment of heart failure: systematic review and economic evaluation. Health Technology Assessment, 18(56), August, 1--560.",
      "doi": ""
    },
    {
      "text": "Denning, T., Borning, A., Friedman, B., Gill, B. T., Kohno, T., and Maisel, W. H. (2010). Patients, pacemakers, and implantable defibrillators: Human values and security for wireless implantable medical devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 917--926.  ",
      "doi": "10.1145/1753326.1753462"
    },
    {
      "text": "Doede, B. (2009). Transhumanism, technology, and the future: posthumanity emerging or sub-humanity descending? Appraisal, 7(3).",
      "doi": ""
    },
    {
      "text": "Foster, K. R. and Jaeger, J. (2007). RFID Inside. IEEE Spectrum, 44(3), March, 24--29.  ",
      "doi": "10.1109/MSPEC.2007.323430"
    },
    {
      "text": "Graafstra, A. (2007). \"Hands On,\" IEEE Spectrum, 44(3), March, 18--23.  ",
      "doi": "10.1109/MSPEC.2007.323420"
    },
    {
      "text": "Graafstra, A., Michael, K., and Michael, M. G. (2010). Social-technical issues facing the humancentric RFID implantee sub-culture through the eyes of Amal Graafstra. Technology and Society (ISTAS), 2010 IEEE International Symposium on, 498--516.",
      "doi": ""
    },
    {
      "text": "Halperin, D., Heydt-Benjamin, T. S., Fu, K., Kohno T. and Maisel, W. H. (2008). Security and Privacy for Implantable Medical Devices. IEEE Pervasive Computing, 7(1), 30--39.  ",
      "doi": "10.1109/MPRV.2008.16"
    },
    {
      "text": "Harley, D. and Fitzpatrick, G. (2009). Creating a conversational context through video blogging: A case study of Geriatric1927. Computers in Human Behavior, 25(3), 679--689.  ",
      "doi": "10.1016/j.chb.2008.08.011"
    },
    {
      "text": "Heffernan, K. J., Vetere F. and Chang, S. (2015). Insertables: I've got it under my skin. In Magazine Interactions, 23(1), 52--56.  ",
      "doi": "10.1145/2843588"
    },
    {
      "text": "Heffernan, K. J., Vetere, F. and Chang, S. (2016) You Put What, Where?: Hobbyist Use of Insertable Devices. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1798--1809.  ",
      "doi": "10.1145/2858036.2858392"
    },
    {
      "text": "Heffernan, K. J., Vetere, F. and Chang, S. (2017). Towards insertables: Devices inside the human body. First Monday, 22(3), 6 March.",
      "doi": ""
    },
    {
      "text": "Homewood, S. and Heyer,C. (2017). Turned On / Turned Off: Speculating on the Microchip-based Contraceptive Implant. Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 339--343.  ",
      "doi": "10.1145/3064663.3064726"
    },
    {
      "text": "Hsieh, H. F., and Shannon, S. E. (2005). Three approaches to qualitative content analysis. Qualitative health research, 15(9), 1277--1288.",
      "doi": ""
    },
    {
      "text": "Jewitt, C. (2012) An Introduction to Using Video for Research. NCRM Working Paper. NCRM. (Unpublished).",
      "doi": ""
    },
    {
      "text": "Kramer, D. B., Kesselheim A. S., Brock D. W. and Maisel W. H. (2010). Ethical and legal views of physicians regarding deactivation of cardiac implantable electrical devices: A quantitative assessment. Heart Rhythm, 7(11), 1537--1542.",
      "doi": ""
    },
    {
      "text": "Larsson, B., Elmqvist, H., Rydén, L. and Schüller, H. (2003). Lessons From the First Patient with an Implanted Pacemaker. Pacing and Clinical Electrophysiology, 26, 114--124.",
      "doi": ""
    },
    {
      "text": "Lee, R. and Mittal, S. (2017). Utility and limitations of long-term monitoring of atrial fibrillation using an implantable loop recorder. Heart Rhythm, 15(2), 287 - 295.",
      "doi": ""
    },
    {
      "text": "Lux, B. Bailey, P. and Reyes, C. (2017). Lead User Discovery through Netnography: Transhumanist Subcultures of Grinders and Biohackers. Engineering and Technology Management Student Projects. 1181. Retrieved from: https://pdxscholar.library.pdx.edu/etm_studentprojects/1181 Accessed 15 May 2018.",
      "doi": ""
    },
    {
      "text": "Masters, A. and Michael, K. (2007). Lend me your arms: The use and implications of humancentric RFID. Electronic Commerce Research and Applications, 6(1), 29--39.  ",
      "doi": "10.1016/j.elerap.2006.04.008"
    },
    {
      "text": "Michael, K. (2016) RFID/NFC Implants for Bitcoin Transactions. IEEE Consumer Electronics Magazine, 5(3), 103--106.",
      "doi": ""
    },
    {
      "text": "More, M. (1990). Transhumanism: Towards a futurist philosophy. Retrieved from: https://www.scribd.com/doc/257580713/Transhumanism-Toward-a-Futurist-Philosophy. Accessed on 25 of March 2018",
      "doi": ""
    },
    {
      "text": "Murata, K., Adams, A. A., Fukuta, Y., Orito, Y., Arias-Oliva, M. and Pelegrin-Borondo, J. (2017). From a science fiction to reality: cyborg ethics in Japan. ACM SIGCAS Computers and Society. 47(3), September, 72--85.  ",
      "doi": "10.1145/3144592.3144600"
    },
    {
      "text": "Murthy, D. (2008). Digital ethnography: An examination of the use of new technologies for social research. Sociology, 42(5), 837--855.",
      "doi": ""
    },
    {
      "text": "Paay, J., Kjeldskov, J., and Skov, M. B. (2015). Connecting in the Kitchen: An Empirical Study of Physical Interactions while Cooking Together at Home. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, 276--287.  ",
      "doi": "10.1145/2675133.2675194"
    },
    {
      "text": "Parthiban, N., Esterman, A., Mahajan,R., Twomey, D. J., Pathak, R. K., Lau, D. H., Roberts-Thomson, K. C., Young, G. D., Sanders, P. and Ganesan, A N. (2015). Remote Monitoring of Implantable Cardioverter-Defibrillators: A Systematic Review and Meta-Analysis of Clinical Outcomes. Journal of the American College of Cardiology. 65(24), 2591--2600.",
      "doi": ""
    },
    {
      "text": "Pelegrín-Borondo, J., Reinares-Lara E. and Olarte-Pascual C. (2017). Assessing the acceptance of technological implants (the cyborg): Evidences and challenges. Computers in Human Behavior, 70, 104--112.  ",
      "doi": "10.1016/j.chb.2016.12.063"
    },
    {
      "text": "Perakslis, C., Michael, K., Michael M. G. and Gable R., (2014) Perceived barriers for implanting microchips in humans: A transnational study. 2014 IEEE Conference on Norbert Wiener in the 21st Century (21CW), Boston, MA, 1--8.",
      "doi": ""
    },
    {
      "text": "Rotter, P. (2008). A Framework for Assessing RFID System Security and Privacy Risks. IEEE Pervasive Computing, 7(2), April, 70--77.  ",
      "doi": "10.1109/MPRV.2008.22"
    },
    {
      "text": "Sametinger, J., Rozenblit, J., Lysecky, R. and Ott, P. (2015). Security challenges for medical devices. Communications of the ACM, 58(4), 74--82.  ",
      "doi": "10.1145/2667218"
    },
    {
      "text": "Seo, W. and Jung, H. (2017). Exploring the Community of Blind or Visually Impaired People on YouTube. Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, 371--372.  ",
      "doi": "10.1145/3132525.3134801"
    },
    {
      "text": "Skov, M. B., Johansen, P. G., Skov, C. S. and Lauberg, A. (2015) No News is Good News: Remote Monitoring of Implantable Cardioverter-Defibrillator Patients. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 827--836.  ",
      "doi": "10.1145/2702123.2702192"
    },
    {
      "text": "Varis, P. (2016). Digital ethnography. The Routledge handbook of language and digital communication, 55--68.",
      "doi": ""
    },
    {
      "text": "Vega, K. and Fuks, H. (2016) Beauty Technology: Designing Seamless Interfaces for Wearable Computing. Springer International Publishing. ",
      "doi": "10.5555/2967137"
    },
    {
      "text": "VivoKey. Retrieved from: http://vivokey.com/learn-more.html Accessed on 30 May 2018.",
      "doi": ""
    },
    {
      "text": "Weber, I., Garimella, V. R. K. and Borra, E. (2013, May). Inferring audience partisanship for youtube videos. Proceedings of the 22nd International Conference on World Wide Web, 43--44.  ",
      "doi": "10.1145/2487788.2487803"
    },
    {
      "text": "Whited, A., Sears, S.F., Cahill J. and Chelu, M.G. (2015.) Psychological Consultation for Patients with Implantable Cardioverter Defibrillator: Confounding Challenges of Cardiac Disease, Technology, and the Patient Experience. Alvarenga M., Byrne D. (eds) Handbook of Psychocardiology. Springer, Singapore.",
      "doi": ""
    },
    {
      "text": "Who We Are. Retrieved from: https://wiki.biohack.me/ Accessed on 15 May 2018.",
      "doi": ""
    },
    {
      "text": "Wong, M. F. (2017). Factors associated with anxiety and depression among patients with implantable cardioverter defibrillator. JCN Clinical Nursing, 26(9--10), 1328--1337.",
      "doi": ""
    },
    {
      "text": "Wu, E. B. (2007) The ethics of implantable devices. Journal of Medical Ethics, 33, 532--533.",
      "doi": ""
    }
  ]
}