{
  "doi": "10.1145/3290605.3300404",
  "title": "GymSoles: Improving Squats and Dead-Lifts by Visualizing the User's Center of Pressure",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "The correct execution of exercises, such as squats and dead-lifts, is essential to prevent various bodily injuries. Existing solutions either rely on expensive motion tracking or multiple Inertial Measurement Units (IMU) systems require an extensive set-up and individual calibration. This paper introduces a proof of concept, GymSoles, an insole prototype that provides feedback on the Centre of Pressure (CoP) at the feet to assist users with maintaining the correct body posture, while performing squats and dead-lifts. GymSoles was evaluated with 13 users in three conditions: 1) no feedback, 2) vibrotactile feedback, and 3) visual feedback. It has shown that solely providing feedback on the current CoP, results in a significantly improved body posture.",
  "authors": [
    {
      "name": "Don Samitha Elvitigala",
      "institution": "The University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-99659118088/rel-imgonly/1004585_677003825650293_574565969_n.jpg",
      "acmid": "99659118088",
      "orcid": "missing"
    },
    {
      "name": "Denys J.C. Matthies",
      "institution": "The University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81548327356/rel-imgonly/citations.jpg",
      "acmid": "81548327356",
      "orcid": "missing"
    },
    {
      "name": "Löic David",
      "institution": "The University of Auckland, Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366322",
      "orcid": "missing"
    },
    {
      "name": "Chamod Weerasinghe",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659310114",
      "orcid": "missing"
    },
    {
      "name": "Suranga Nanayakkara",
      "institution": "The University of Auckland, Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81416609140/rel-imgonly/_mg_5811-uoa.jpg",
      "acmid": "81416609140",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Paraschiv-Ionescu A, Mellone S, Colpo M, Bourke A, Ihlen EAF, Moufawad el Achkar C, Chiari L, Becker C, and Aminian K. 2016. Patterns of Human Activity Behavior: From Data to Information and Clinical Knowledge. In UbiComp '16 Adjunct. ACM, New York, NY, USA, 841--845.  ",
      "doi": "10.1145/2968219.2968283"
    },
    {
      "text": "Kieran Alger. 2018. Nike+ Run Club: How to use Nike's app to become a better runner. Retrieved August 28, 2018 from https://www.wareable. com/running/nike-plus-run-club-guide-how-to-use-running-430.",
      "doi": ""
    },
    {
      "text": "Swamy Ananthanarayan, Miranda Sheh, Alice Chien, Halley Profita, and Katie Siek. 2013. Pt Viz: Towards a Wearable Device for Visualizing Knee Rehabilitation Exercises. In CHI '13. ACM, New York, NY, USA, 1247--1250.  ",
      "doi": "10.1145/2470654.2466161"
    },
    {
      "text": "OptiTrack Applications. 2018. Retrieved August 28, 2018 from https: //www.vicon.com/.",
      "doi": ""
    },
    {
      "text": "Johannes C Ayena, Martin JD Otis, Bob-AJ Menelas, et al. 2015. An efficient home-based risk of falling assessment test based on smartphone and instrumented insole. In Medical Measurements and Applications (MeMeA), 2015 IEEE International Symposium on. IEEE, 416--421.",
      "doi": ""
    },
    {
      "text": "Richard Baker. 2006. Gait analysis methods in rehabilitation. Journal of neuroengineering and rehabilitation 3, 1 (2006), 4.",
      "doi": ""
    },
    {
      "text": "Stacy J Morris Bamberg, Ari Y Benbasat, Donna Moxley Scarborough, David E Krebs, and Joseph A Paradiso. 2008. Gait analysis using a shoeintegrated wireless sensor system. IEEE transactions on information technology in biomedicine 12, 4 (2008), 413--423.  ",
      "doi": "10.1109/TITB.2007.899493"
    },
    {
      "text": "Biomechanics and Force Plate. 2018. Retrieved August 28, 2018 from https://www.kistler.com/en/applications/sensor-technology/ biomechanics-and-force-plate/.",
      "doi": ""
    },
    {
      "text": "Biomechanics and Sports. 2018. Retrieved August 28, 2018 from https://www.vicon.com/motion-capture/biomechanics-and-spor.",
      "doi": ""
    },
    {
      "text": "Anargyros Chatzitofis, Dimitris Zarpalas, and Petros Daras. 2018. A computerized system for real-time exercise performance monitoring and e-coaching using motion capture data. In Precision Medicine Powered by pHealth and Connected Health. Springer, 243--247.",
      "doi": ""
    },
    {
      "text": "Rosie Chee. 2018. Retrieved August 28, 2018 from https://www. bodybuilding.com/content/essential-8-exercises-to-get-ripped.html.",
      "doi": ""
    },
    {
      "text": "Ross A Clark, Adam L Bryant, Yonghao Pua, Paul McCrory, Kim Bennell, and Michael Hunt. 2010. Validity and reliability of the Nintendo Wii Balance Board for assessment of standing balance. Gait & posture 31, 3 (2010), 307--310.",
      "doi": ""
    },
    {
      "text": "Caleb Conner and Gene Michael Poor. 2016. Correcting exercise form using body tracking. In CHI '16 Extended Abstracts. ACM, 3028--3034.  ",
      "doi": "10.1145/2851581.2892519"
    },
    {
      "text": "Glen Cooper, Ian Sheret, Louise McMillian, Konstantinos Siliverdis, Ning Sha, Diana Hodgins, Laurence Kenney, and David Howard. 2009. Inertial sensor-based knee flexion/extension angle estimation. Journal of biomechanics 42, 16 (2009), 2678--2685.",
      "doi": ""
    },
    {
      "text": "GTX Corp. 2015. Retrieved August 28, 2018 from http://gtxcorp.com.",
      "doi": ""
    },
    {
      "text": "Gouwanda D and SMNA Senanayake. 2008. Emerging trends of bodymounted sensors in sports and human gait analysis. In International Conference on Biomedical Engineering. Springer, 715--718.",
      "doi": ""
    },
    {
      "text": "Digitsole. 2017. Retrieved August 28, 2018 from https://www.digitsole. com.",
      "doi": ""
    },
    {
      "text": "Ye Ding, Ignacio Galiana, Christopher Siviy, Fausto A Panizzolo, and Conor J Walsh. 2016. IMU-based iterative control for hip extension assistance with a soft exosuit.. In ICRA. 3501--3508.",
      "doi": ""
    },
    {
      "text": "Hawkin Dyanmics. Retrieved August 28, 2018 from https://www. hawkindynamics.com/.",
      "doi": ""
    },
    {
      "text": "Hennig EM, Cavanagh PR, Albert HT, and Macmillan NH. 1982. A piezoelectric method of measuring the vertical contact stress beneath the human foot. Journal of biomedical engineering 4, 3 (1982), 213--222.",
      "doi": ""
    },
    {
      "text": "Bjoern M Eskofier, Sunghoon Ivan Lee, Manuela Baron, André Simon, Christine F Martindale, Heiko Gaßner, and Jochen Klucken. 2017. An overview of smart shoes in the internet of health things: gait and mobility assessment in health promotion and disease monitoring. Applied Sciences 7, 10 (2017), 986.",
      "doi": ""
    },
    {
      "text": "Evalu. 2018. Retrieved August 28, 2018 from https://www.evalu.com.",
      "doi": ""
    },
    {
      "text": "Coach's Eyes. Retrieved August 28, 2018 from https://www.coachseye. com/. GymSoles: Improving Squats and Dead-Lifts... CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk",
      "doi": ""
    },
    {
      "text": "Corinna Feeken, Merlin Wasmann, Wilko Heuten, Dag Ennenga, Heiko Müller, and Susanne Boll. 2016. ClimbingAssist: Direct Vibro-tactile Feedback on Climbing Technique. In UbiComp '16. ACM, New York, NY, USA, 57--60.  ",
      "doi": "10.1145/2968219.2971417"
    },
    {
      "text": "Feetme. 2017. Retrieved August 28, 2018 from http://www.feetme.fr/ en/index.php#products.",
      "doi": ""
    },
    {
      "text": "Daniel Tik-Pui Fong and Yue-Yan Chan. 2010. The Use of Wearable Inertial Motion Sensors in Human Lower Limb Biomechanics Studies: A Systematic Review. Sensors 10, 12 (2010), 11556--11565.",
      "doi": ""
    },
    {
      "text": "A Guide for Coaches Looking to Invest in Force Plates. 2017. Retrieved August 28, 2018 from https://simplifaster.com/articles/force-plate/.",
      "doi": ""
    },
    {
      "text": "Glassman G. 2010. The crossfit training guide. Retrieved September 17, 2018 from http://library.crossfit.com/free/pdf/CFJ/Seminars/ TrainingGuide/012013-SDy.pdf.",
      "doi": ""
    },
    {
      "text": "Asimenia Gioftsidou, Paraskevi Malliou, G Pafis, Anastasia Beneka, George Godolias, and Constantinos N Maganaris. 2006. The effects of soccer training and timing of balance training on balance ability. European journal of applied physiology 96, 6 (2006), 659--664.",
      "doi": ""
    },
    {
      "text": "Iván González, Jesús Fontecha, Ramón Hervás, and José Bravo. 2015. An ambulatory system for gait monitoring based on wireless sensorized insoles. Sensors 15, 7 (2015), 16589--16613.",
      "doi": ""
    },
    {
      "text": "Marian Haescher, John Trimpop, Denys JC Matthies, Gerald Bieber, Bodo Urban, and Thomas Kirste. 2015. aHead: considering the head position in a multi-sensory setup of wearables to recognize everyday activities with intelligent sensor fusions. In International Conference on Human-Computer Interaction. Springer, 741--752.",
      "doi": ""
    },
    {
      "text": "Mahmoud Hassan, Florian Daiber, Frederik Wiehr, Felix Kosmalla, and Antonio Krüger. 2017. Footstriker: An EMS-based foot strike assistant for running. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 1 (2017), 2.  ",
      "doi": "10.1145/3053332"
    },
    {
      "text": "Mary Josephine Hessert, Mitul Vyas, Jason Leach, Kun Hu, Lewis A Lipsitz, and Vera Novak. 2005. Foot pressure distribution during walking in young and old adults. BMC geriatrics 5, 1 (2005), 8.",
      "doi": ""
    },
    {
      "text": "Aminian K, and Paraschiv-Ionescu A Mariani B, Hoskovec C, Büla C, Penders J, Tacconi C, and Marcellini F. 2011. Foot worn inertial sensors for gait assessment and rehabilitation based on motorized shoes. In Engineering in Medicine and Biology Society, EMBC, 2011 Annual International Conference of the IEEE. IEEE, 5820--5823.",
      "doi": ""
    },
    {
      "text": "Oberlander K. 2015. Inertial Measurement Unit (IMU) Technology. Inverse Kinematics: Joint Considerations and the Maths for Deriving Anatomical Angles (2015).",
      "doi": ""
    },
    {
      "text": "Eleftherios Kellis. 2001. Plantar pressure distribution during barefoot standing, walking and landing in preschool boys. Gait & posture 14, 2 (2001), 92--97.",
      "doi": ""
    },
    {
      "text": "David A Krause, Michael S Boyd, Allison N Hager, Eric C Smoyer, Anthony T Thompson, and John H Hollman. 2015. Reliability and accuracy of a goniometer mobile device application for video measurement of the functional movement screen deep squat test. International journal of sports physical therapy 10, 1 (2015), 37.",
      "doi": ""
    },
    {
      "text": "Paul Lamkin. 2015. Adidas miCoach Fit Smart review. Retrieved August 28, 2018 from https://www.wareable.com/fitness-trackers/ adidas-micoach-fit-smart-review.",
      "doi": ""
    },
    {
      "text": "Silvio Lorenzetti, Turgut Gülay, Mirjam Stoop, Renate List, Hans Gerber, Florian Schellenberg, and Edgar Stüssi. 2012. Comparison of the angles and corresponding moments in the knee and hip during restricted and unrestricted squats. The Journal of Strength & Conditioning Research 26, 10 (2012), 2829--2836.",
      "doi": ""
    },
    {
      "text": "Kljajic M and Janez Krajnik. 1987. The use of ground reaction measuring shoes in gait evaluation. Clinical Physics and Physiological Measurement 8, 2 (1987), 133.",
      "doi": ""
    },
    {
      "text": "Zecca M, Saito K, Sessa S, Bartolomeo L, Lin Z, Cosentino S, Ishii H, Ikai T, and Takanishi A. 2013. Use of an ultra-miniaturized IMU-based motion capture system for objective evaluation and assessment of walking skills. In Engineering in Medicine and Biology Society (EMBC), 2013 35th Annual International Conference of the IEEE. IEEE, 4883--4886.",
      "doi": ""
    },
    {
      "text": "Chih-Chun Ma, Shih-Yao Wei, and Jung-Hsuan Lin. 2015. Smart Footwear Feedback Interface Analysis and Design. In 2015 International Conference on Computational Science and Computational Intelligence (CSCI). IEEE, 766--770.  ",
      "doi": "10.1109/CSCI.2015.107"
    },
    {
      "text": "Sumit Majumder, Tapas Mondal, and M. Jamal Deen. 2017. Wearable Sensors for Remote Health Monitoring. Sensors 17, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Andrea Mannini, Diana Trojaniello, Andrea Cereatti, and Angelo M Sabatini. 2016. A machine learning framework for gait classification using inertial sensors: Application to elderly, post-stroke and huntington's disease patients. Sensors 16, 1 (2016), 134.",
      "doi": ""
    },
    {
      "text": "Udomporn Manupibul, Warakorn Charoensuk, and Panya Kaimuk. 2014. Design and development of SMART insole system for plantar pressure measurement in imbalance human body and heavy activities. In Biomedical Engineering International Conference. IEEE, 1--5.",
      "doi": ""
    },
    {
      "text": "Sensing Mat. Retrieved August 28, 2018 from http://www.sensingtex. com/.",
      "doi": ""
    },
    {
      "text": "Denys JC Matthies, Marian Haescher, Rebekka Alm, and Bodo Urban. 2015. Properties Of A Peripheral Head-Mounted Display (PHMD). In International Conference on Human-Computer Interaction. Springer, 208--213.",
      "doi": ""
    },
    {
      "text": "Denys JC Matthies, Thijs Roumen, Arjan Kuijper, and Bodo Urban. 2017. CapSoles: who is walking on what kind of floor?. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 9.  ",
      "doi": "10.1145/3098279.3098545"
    },
    {
      "text": "Sinziana Mazilu, Ulf Blanke, Michael Hardegger, Gerhard Troster, Eran Gazit, Moran Dorfman, and Jeffrey M Hausdorff. 2014. GaitAssist: a wearable assistant for gait training and rehabilitation in Parkinson's disease. In Pervasive Computing and Communications Workshops (PERCOM Workshops), 2014 IEEE International Conference on. IEEE, 135--137.",
      "doi": ""
    },
    {
      "text": "Anita Meier, Denys JC Matthies, Bodo Urban, and Reto Wettach. 2015. Exploring vibrotactile feedback on the body and foot for the purpose of pedestrian navigation. In Proceedings of the 2nd international Workshop on Sensor-based Activity Recognition and Interaction. ACM, 11.  ",
      "doi": "10.1145/2790044.2790051"
    },
    {
      "text": "Alessandro Mengarelli, Federica Verdini, Stefano Cardarelli, Francesco Di Nardo, Laura Burattini, and Sandro Fioretti. 2018. Balance assessment during squatting exercise: A comparison between laboratory grade force plate and a commercial, low-cost device. Journal of biomechanics 71 (2018), 264--270.",
      "doi": ""
    },
    {
      "text": "Dan Morris, T Scott Saponas, Andrew Guillory, and Ilya Kelner. 2014. RecoFit: using a wearable sensor to find, recognize, and count repetitive exercises. In CHI '14. ACM, 3225--3234.  ",
      "doi": "10.1145/2556288.2557116"
    },
    {
      "text": "Joseph W Newbold, Nadia Bianchi-Berthouze, and Nicolas E Gold. 2017. Musical Expectancy in Squat Sonification For People Who Struggle With Physical Activity. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Thirawut Nilpanapan and Teerakiat Kerdcharoen. 2016. Social data shoes for gait monitoring of elderly people in smart home. In Biomedical Engineering International Conference. IEEE, 1--5.",
      "doi": ""
    },
    {
      "text": "Hawkar Oagaz, Anurag Sable, Min-Hyung Choi, Wenyao Xu, and Feng Lin. 2018. VRInsole: An unobtrusive and immersive mobility training system for stroke rehabilitation. In International Conference on Wearable and Implantable Body Sensor Networks. IEEE, 5--8.",
      "doi": ""
    },
    {
      "text": "Kim Oakes, Katie A Siek, and Haley MacLeod. 2015. MuscleMemory: identifying the scope of wearable technology in high intensity exercise communities. In Conf PervasiveHealth, 2015. IEEE, 193--200. ",
      "doi": "10.5555/2826165.2826193"
    },
    {
      "text": "Ayumi Ohnishi, Tsutomu Terada, and Masahiko Tsukamoto. 2018. A Motion Recognition Method Using Foot Pressure Sensors. In Proceedings of the 9th Augmented Human International Conference. ACM, 10. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk D.S. Elvitigala et al.  ",
      "doi": "10.1145/3174910.3174938"
    },
    {
      "text": "Biomechanics Overview. Retrieved August 28, 2018 from http://www. amti.biz/fps-overview.aspx.",
      "doi": ""
    },
    {
      "text": "Joseph Paradiso, Eric Hu, and K Yuh Hsiao. 1998. Instrumented footwear for interactive dance. In Proc. of the XII Colloquium on Musical Informatics. 24--26.",
      "doi": ""
    },
    {
      "text": "Aranzulla PJ, Muckle DS, and Cunningham JL. 1998. A portable monitoring system for measuring weight-bearing during tibial fracture healing. Medical engineering & physics 20, 7 (1998), 543--548.",
      "doi": ""
    },
    {
      "text": "PASPORT Force Platform. Retrieved August 28, 2018 from https://www.pasco.com/prodCatalog/PS/PS-2141_ pasport-force-platform/index.cfm.",
      "doi": ""
    },
    {
      "text": "Bernd Ploderer, Justin Fong, Anusha Withana, Marlena Klaic, Siddharth Nair, Vincent Crocher, Frank Vetere, and Suranga Nanayakkara. 2016. ArmSleeve: a patient monitoring system to support occupational therapists in stroke rehabilitation. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 700--711.  ",
      "doi": "10.1145/2901790.2901799"
    },
    {
      "text": "Octavian Postolache, Pedro Silva Girão, José MD Pereira, and Gabriela Postolache. 2015. Wearable system for gait assessment during physical rehabilitation process. In Advanced Topics in Electrical Engineering (ATEE), 2015 9th International Symposium on. IEEE, 321--326.",
      "doi": ""
    },
    {
      "text": "Luca Prosperini, Deborah Fortuna, Costanza Giannì, Laura Leonardi, Maria Rita Marchetti, and Carlo Pozzilli. 2013. Home-based balance training using the Wii balance board: a randomized, crossover pilot study in multiple sclerosis. Neurorehabilitation and neural repair 27, 6 (2013), 516--525.",
      "doi": ""
    },
    {
      "text": "Robin M Queen, Benjamin B Haynes, W Mack Hardaker, and William E Garrett Jr. 2007. Forefoot loading during 3 athletic tasks. The American journal of sports medicine 35, 4 (2007), 630--636.",
      "doi": ""
    },
    {
      "text": "ReTiSense. 2015. Retrieved August 28, 2018 from http://www.retisense. com.",
      "doi": ""
    },
    {
      "text": "Timothy E Roden, Rob LeGrand, Raul Fernandez, Jacqueline Brown, James Ed Deaton, and Johnny Ross. 2014. Development of a smart insole tracking system for physical therapy and athletics. In Proceedings of the 7th International Conference on PErvasive Technologies Related to Assistive Environments. ACM, 40.  ",
      "doi": "10.1145/2674396.2674415"
    },
    {
      "text": "Thijs Roumen, Simon T Perrault, and Shengdong Zhao. 2015. Notiring: A comparative study of notification channels for wearable interactive rings. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2497--2500.  ",
      "doi": "10.1145/2702123.2702350"
    },
    {
      "text": "RxFunction. Retrieved August 28, 2018 from http://rxfunction.com.",
      "doi": ""
    },
    {
      "text": "Miyazaki S, Ishida A, Iwakura H, Takino K, Ohkawa T, Tsubakimoto H, and Hayashi N. 1986. Portable limb-load monitor utilizing a thin capacitive transducer. Journal of biomedical engineering 8, 1 (1986), 67--71.",
      "doi": ""
    },
    {
      "text": "Miyazaki S and Iwakura H. 1978. Foot-force measuring device for clinical assessment of pathological gait. Medical and Biological Engineering and Computing 16, 4 (1978), 429--436.",
      "doi": ""
    },
    {
      "text": "Anne Schmitz, Mao Ye, Grant Boggess, Robert Shapiro, Ruigang Yang, and Brian Noehren. 2015. The measurement of in vivo joint angles during a squat using a single camera markerless motion capture system as compared to a marker based system. Gait & posture 41, 2 (2015), 694--698.",
      "doi": ""
    },
    {
      "text": "Brad J Schoenfeld. 2010. Squatting kinematics and kinetics and their application to exercise performance. The Journal of Strength & Conditioning Research 24, 12 (2010), 3497--3506.",
      "doi": ""
    },
    {
      "text": "Moticon Science. 2018. Retrieved August 28, 2018 from https://www. moticon.de.",
      "doi": ""
    },
    {
      "text": "Thomas Seel, Jörg Raisch, and Thomas Schauer. 2014. IMU-based joint angle measurement for gait analysis. Sensors 14, 4 (2014), 6891--6909.",
      "doi": ""
    },
    {
      "text": "Goran Seketa, Dominik Dzaja, Sara Zulj, Luka Celic, Igor Lackovi?, and Ratko Magjarevi?. 2015. Real-Time Evaluation of Repetitive Physical Exercise Using Orientation Estimation from Inertial and Magnetic Sensors. In First European Biomedical Engineering Conference for Young Investigators. Springer, 11--15.",
      "doi": ""
    },
    {
      "text": "Sensoria. 2016. Retrieved August 28, 2018 from http://www. sensoriafitness.com.",
      "doi": ""
    },
    {
      "text": "Chenguang Shen, Bo-Jhang Ho, and Mani Srivastava. 2018. Milift: Efficient smartwatch-based workout tracking using automatic segmentation. IEEE Transactions on Mobile Computing 17, 7 (2018), 1609--1622.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman and Pattie Maes. 1997. Direct Manipulation vs. Interface Agents. interactions 4, 6 (Nov. 1997), 42--61.  ",
      "doi": "10.1145/267505.267514"
    },
    {
      "text": "Lin Shu, Tao Hua, Yangyong Wang, Qiao Li, David Dagan Feng, and Xiaoming Tao. 2010. In-shoe plantar pressure measurement and analysis system based on fabric pressure sensing array. IEEE Transactions on information technology in biomedicine 14, 3 (2010), 767--775.  ",
      "doi": "10.1109/TITB.2009.2038904"
    },
    {
      "text": "Marcelo Guimarães Silva, Pedro Vieira Sarmet Moreira, and Henrique Martins Rocha. 2017. Development of a low cost force platform for biomechanical parameters analysis. Research on Biomedical Engineering 33, 3 (2017), 259--268.",
      "doi": ""
    },
    {
      "text": "Daniel Steffen, Gabriele Bleser, Markus Weber, Didier Stricker, Laetitia Fradet, and Frédéric Marin. 2011. A personalized exercise trainer for elderly. In Pervasive Computing Technologies for Healthcare (PervasiveHealth), 2011 5th International Conference on. IEEE, 24--31.",
      "doi": ""
    },
    {
      "text": "F-Scan System. 2014. Retrieved August 28, 2018 from https://www. tekscan.com/products-solutions/systems/f-scan-system.",
      "doi": ""
    },
    {
      "text": "Weijun Tao, Tao Liu, Rencheng Zheng, and Hutian Feng. 2012. Gait analysis using wearable sensors. Sensors 12, 2 (2012), 2255--2283.",
      "doi": ""
    },
    {
      "text": "Hsin-Ruey Tsai, Shih-Yao Wei, Jui-Chun Hsiao, Ting-Wei Chiu, Yi-Ping Lo, Chi-Feng Keng, Yi-Ping Hung, and Jin-Jong Chen. 2016. iKneeBraces: knee adduction moment evaluation measured by motion sensors in gait detection. In UbiComp '16. ACM, 386--391.  ",
      "doi": "10.1145/2971648.2971675"
    },
    {
      "text": "Ronald T Verrillo. 1992. Vibration sensation in humans. Music Perception: An Interdisciplinary Journal 9, 3 (1992), 281--302.",
      "doi": ""
    },
    {
      "text": "Vicon. Retrieved August 28, 2018 from https://www.vicon.com/.",
      "doi": ""
    },
    {
      "text": "Shi-Yao Wei, Chen-Yu Wang, Ting-Wei Chiu, Yi-Ping Lo, Zhi-Wei Yang, Hsing-Man Wang, and Yi-ping Hung. 2016. RunPlay: Action Recognition Using Wearable Device Apply on Parkour Game. In UIST '13. ACM, 133--135.  ",
      "doi": "10.1145/2984751.2985731"
    },
    {
      "text": "Darragh Whelan, Martin O'Reilly, Bingquan Huang, Oonagh Giggins, Tahar Kechadi, and Brian Caulfield. 2016. Leveraging IMU data for accurate exercise performance classification and musculoskeletal injury risk screening. In Engineering in Medicine and Biology Society (EMBC), 2016 IEEE 38th Annual International Conference of the. IEEE, 659--662.",
      "doi": ""
    },
    {
      "text": "Ryan Wood. 2008. \"The 7 Best Exercises for a Full-Body Workout\". Active. Retrieved August 28, 2018 from https://www.active.com/fitness/ articles/the-7-best-exercises-for-a-full-body-workout/slide-8.",
      "doi": ""
    },
    {
      "text": "Disheng Yang, Jian Tang, Yang Huang, Chao Xu, Jinyang Li, Liang Hu, Guobin Shen, Chieh-Jan Mike Liang, and Hengchang Liu. 2017. TennisMaster: An IMU-based Online Serve Performance Evaluation System. In Proceedings of the 8th Augmented Human International Conference (AH '17). ACM, New York, NY, USA, Article 17, 8 pages.  ",
      "doi": "10.1145/3041164.3041186"
    },
    {
      "text": "Mahshid Yazdifar, Mohammad Reza Yazdifar, Jamaluddin Mahmud, Ibrahim Esat, and Mahmoud Chizari. 2013. Evaluating the hip range of motion using the goniometer and video tracking methods. Procedia Engineering 68 (2013), 77--82.",
      "doi": ""
    },
    {
      "text": "Abu-Faraj ZO, Harris GF, Abler JH, Wertsch JJ, and Smith PA. 1996. A Holter-type microprocessor-based rehabilitation instrument for acquisition and storage of plantar pressure data in children with cerebral palsy. IEEE Transactions on Rehabilitation Engineering 4, 1 (1996), 33--38.",
      "doi": ""
    }
  ]
}