{
  "doi": "10.1145/3290605.3300781",
  "title": "Transforming Game Difficulty Curves using Function Composition",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-7",
  "year": 2019,
  "badges": [],
  "abstract": "Player engagement within a game is often influenced by its difficulty curve: the pace at which in-game challenges become harder. Thus, finding an optimal difficulty curve is important. In this paper, we present a flexible and formal approach to transforming game difficulty curves by leveraging function composition. This allows us to describe changes to difficulty curves, such as making them \"smoother\", in a more precise way. In an experiment with 400 players, we used function composition to modify the existing difficulty curve of the puzzle game Paradox to generate new curves. We found that transforming difficulty curves in this way impacted player engagement, including the number of levels completed and the estimated skill needed to complete those levels, as well as perceived competence. Further, we found some transformed curves dominated others with respect to engagement, indicating that different design goals can be traded-off by considering a subset of curves.",
  "tags": [
    "difficulty curve",
    "adaptivity",
    "games",
    "difficulty"
  ],
  "authors": [
    {
      "name": "Anurag Sarkar",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196504",
      "orcid": "missing"
    },
    {
      "name": "Seth Cooper",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/do/10.1145/contrib-81314493529/rel-imgonly/81314493529.jpg",
      "acmid": "81314493529",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Maria-Virginia Aponte, Guillaume Levieux, and Stephane Natkin. 2011. Measuring the level of difficulty in single player video games. Entertainment Computing 2, 4 (2011), 205--213.",
      "doi": ""
    },
    {
      "text": "Seth Cooper, Sebastian Deterding, and Theo Tsapakos. 2016. Player rating systems for balancing human computation games: testing the effect of bipartiteness. In Proceedings of the 1st International Joint Conference of DiGRA and FDG.",
      "doi": ""
    },
    {
      "text": "Valve Corporation. 2008. Left 4 Dead. Game.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1990. Flow: The Psychology of Optimal Experience. Harper and Row, NY.",
      "doi": ""
    },
    {
      "text": "Drew Dean, Sean Gaurino, Leonard Eusebi, Andrew Keplinger, Tim Pavlik, Ronald Watro, Aaron Cammarata, John Murray, Kelly McLaughlin, John Cheng, and Thomas Maddern. 2015. Lessons learned in game development for crowdsourced software formal verification. In Proceedings of the 2015 USENIX Summit on Gaming, Games, and Gamification in Security Education.",
      "doi": ""
    },
    {
      "text": "Mark E. Glickman. 1999. Parameter estimation in large dynamic paired comparison experiments. Journal of the Royal Statistical Society: Series C (Applied Statistics) 48, 3 (1999), 377--394.",
      "doi": ""
    },
    {
      "text": "Erik Harpstead and Vincent Aleven. 2015. Using empirical learning curve analysis to inform design in an educational game. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play. 197--207.  ",
      "doi": "10.1145/2793107.2793128"
    },
    {
      "text": "Robin Hunicke. 2005. The case for dynamic difficulty adjustment in games. In Proceedings of the 2005 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology. 429--433.  ",
      "doi": "10.1145/1178477.1178573"
    },
    {
      "text": "João Jacob. 2016. Estimating Player Performance and Adaptivity in Exergames and Location-Based Games. Ph.D. Dissertation. Faculdade de Engenharia da Universidade do Porto.",
      "doi": ""
    },
    {
      "text": "Martin Jennings-Teats, Gillian Smith, and Noah Wardrip-Fruin. 2010. Polymorph: dynamic difficulty adjustment through level generation. In Proceedings of the 2010 Workshop on Procedural Content Generation in Games. 11:1--11:4.  ",
      "doi": "10.1145/1814256.1814267"
    },
    {
      "text": "Conor Linehan, George Bellord, Ben Kirman, Zachary H. Morford, and Bryan Roche. 2014. Learning curves: analysing pace and challenge in four successful puzzle games. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-Human Interaction in Play. 181--190.  ",
      "doi": "10.1145/2658537.2658695"
    },
    {
      "text": "Derek Lomas, Kishan Patel, Jodi Forlizzi, and Kenneth Koedinger. 2013. Optimizing challenge in an educational game using large-scale design experiments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 89--98.  ",
      "doi": "10.1145/2470654.2470668"
    },
    {
      "text": "Vilfredo Pareto. 1963. The Mind and Society; A Treatise on General Sociology. Translated by Andrew Bongiorno and Arthur Livingston. Dover, NY.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist 55, 1 (2000), 68--78.",
      "doi": ""
    },
    {
      "text": "Anurag Sarkar and Seth Cooper. 2018. Comparing paid and volunteer recruitment in human computation games. In Proceedings of the 13th International Conference on the Foundations of Digital Games. 37:1--37:9.  ",
      "doi": "10.1145/3235765.3235796"
    },
    {
      "text": "Anurag Sarkar and Seth Cooper. 2018. Meet your match rating: providing skill information and choice in player-versus-level matchmaking. In Proceedings of the 13th International Conference on the Foundations of Digital Games. 36:1--36:8.  ",
      "doi": "10.1145/3235765.3235795"
    },
    {
      "text": "Anurag Sarkar, Michael Williams, Sebastian Deterding, and Seth Cooper. 2017. Engagement effects of player rating system-based matchmaking for level ordering in human computation games. In Proceedings of the 12th International Conference on the Foundations of Digital Games. 22:1--22:10.  ",
      "doi": "10.1145/3102071.3102093"
    },
    {
      "text": "Kristin Siu, Alexander Zook, and Mark Riedl. 2017. A framework for exploring and evaluating mechanics in human computation games. In Proceedings of the 12th International Conference on the Foundations of Digital Games. 38:1--38:4.  ",
      "doi": "10.1145/3102071.3106344"
    },
    {
      "text": "Alex Cho Snyder and Mario Izquierdo. 2014. Jumpcraft. Game.",
      "doi": ""
    },
    {
      "text": "Steve Swink. 2008. Game Feel: A Game Designer's Guide to Virtual Sensation. CRC Press.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for nonparametric factorial analyses using only ANOVA procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Alexander Zook and Mark Riedl. 2012. A temporal data-driven player model for dynamic difficulty adjustment. In Proceedings of the Eighth AAAI Conference on Artificial Intelligence and Interactive Digital Entertainment. 93--98. ",
      "doi": "10.5555/3014629.3014646"
    }
  ]
}