{
  "doi": "10.1145/3290605.3300931",
  "title": "How to Design Voice Based Navigation for How-To Videos",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "When watching how-to videos related to physical tasks, users' hands are often occupied by the task, making voice input a natural fit. To better understand the design space of voice interactions for how-to video navigation, we conducted three think-aloud studies using: 1) a traditional video interface, 2) a research probe providing a voice controlled video interface, and 3) a wizard-of-oz interface. From the studies, we distill seven navigation objectives and their underlying intents: pace control pause, content alignment pause, video control pause, reference jump, replay jump, skip jump, and peek jump. Our analysis found that users' navigation objectives and intents affect the choice of referent type and referencing approach in command utterances. Based on our findings, we recommend to 1) support conversational strategies like sequence expansions and command queues, 2) allow users to identify and refine their navigation objectives explicitly, and 3) support the seven interaction intents.",
  "tags": [
    "voice user interface",
    "video navigation",
    "video tutorials",
    "how-to videos",
    "conversational interaction"
  ],
  "authors": [
    {
      "name": "Minsuk Chang",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163123",
      "orcid": "missing"
    },
    {
      "name": "Anh Truong",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659081044",
      "orcid": "missing"
    },
    {
      "name": "Oliver Wang",
      "institution": "Adobe Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81365594740",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    },
    {
      "name": "Juho Kim",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    }
  ],
  "references": [
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Ming-Ming Cheng, Shuai Zheng, Wen-Yan Lin, Jonathan Warrell, Vibhav Vineet, Paul Sturgess, Nigel Crook, Niloy Jyoti Mitra, and Philip H. S. Torr. 2014. ImageSpirit: Verbal Guided Image Parsing. ACM Trans. Graph. 34 (2014), 3:1--3:11.  ",
      "doi": "10.1145/2682628"
    },
    {
      "text": "Pei-Yu Chi, Sally Ahn, Amanda Ren, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2012. MixT: automatic generation of step-by-step mixed media tutorials. In UIST.  ",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Chris Crockford and Harry W. Agius. 2006. An empirical investigation into user navigation of digital video using the VCR-like control set. International Journal of Man-Machine Studies 64 (2006), 340--355.  ",
      "doi": "10.1016/j.ijhcs.2005.08.012"
    },
    {
      "text": "Wei Ding and Gary Marchionini. 1998. A study on video browsing strategies. Technical Report. ",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic, Gonzalo Ramos, Jacobo Bibliowicz, Derek Nowrouzezahrai, Ravin Balakrishnan, and Karan Singh. 2008. Video browsing by direct manipulation. In CHI.  ",
      "doi": "10.1145/1357054.1357096"
    },
    {
      "text": "Ankit Gupta, Dieter Fox, Brian Curless, and Michael F. Cohen. 2012. DuploTrack: a real-time system for authoring and guiding duplo block assembly. In UIST.  ",
      "doi": "10.1145/2380116.2380167"
    },
    {
      "text": "Abir Al Hajri, Gregor Miller, Matthew Fong, and Sidney S. Fels. 2014. Visualization of personal history for video navigation. In CHI.",
      "doi": ""
    },
    {
      "text": "Daniel Jackson, James Nicholson, Gerrit Stoeckigt, Rebecca Wrobel, Anja Thieme, and Patrick Olivier. 2013. Panopticon: a parallel video overview system. In UIST.  ",
      "doi": "10.1145/2501988.2502038"
    },
    {
      "text": "Juho Kim. 2013. Toolscape: enhancing the learning experience of how-to videos. In CHI Extended Abstracts.  ",
      "doi": "10.1145/2468356.2479497"
    },
    {
      "text": "Juho Kim, Philip J. Guo, Carrie J. Cai, Shang-Wen Li, Krzysztof Z. Gajos, and Rob Miller. 2014. Data-driven interaction techniques for improving navigation of educational videos. In UIST.  ",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Juho Kim, Philip J. Guo, Daniel T. Seaton, Piotr Mitros, Krzysztof Z. Gajos, and Robert C. Miller. 2014. Understanding in-video dropouts and interaction peaks in online lecture videos Citation.",
      "doi": "10.1145/2642918.2647389"
    },
    {
      "text": "Benjamin J. Lafreniere, Andrea Bunt, Matthew Lount, and Michael A. Terry. 2013. Understanding the Roles and Uses of Web Tutorials. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Benjamin J. Lafreniere, Tovi Grossman, and George W. Fitzmaurice. 2013. Community enhanced tutorials: improving tutorials with multiple demonstrations. In CHI.  ",
      "doi": "10.1145/2470654.2466235"
    },
    {
      "text": "Walter S. Lasecki, Juho Kim, Nick Rafter, Onkur Sen, Jeffrey P. Bigham, and Michael S. Bernstein. 2015. Apparition: Crowdsourced User Interfaces that Come to Life as You Sketch Them. In CHI.  ",
      "doi": "10.1145/2702123.2702565"
    },
    {
      "text": "Francis C. Li, Anoop Gupta, Elizabeth Sanocki, Li wei He, and Yong Rui. 2000. Browsing digital video. In CHI.  ",
      "doi": "10.1145/332040.332425"
    },
    {
      "text": "Jason Linder, Gierad Laput, Mira Dontcheva, Gregg Wilensky, Walter Chang, Aseem Agarwala, and Eytan Adar. 2013. PixelTone: a multimodal interface for image editing. In CHI Extended Abstracts.  ",
      "doi": "10.1145/2468356.2479533"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2012. Swift: reducing the effects of latency in online video scrubbing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 637--646.  ",
      "doi": "10.1145/2207676.2207766"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George W. Fitzmaurice. 2013. Swifter: improved online video scrubbing. In CHI.  ",
      "doi": "10.1145/2470654.2466149"
    },
    {
      "text": "David Mogensen. 2015. I want-to-do moments: From home to beauty. Think with Google (2015).",
      "doi": ""
    },
    {
      "text": "Chelsea Myers, Anushay Furqan, Jessica Nebolsky, Karina Caro, and Jichen Zhu. 2018. Patterns for How Users Overcome Obstacles in Voice User Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 6.  ",
      "doi": "10.1145/3173574.3173580"
    },
    {
      "text": "Cuong Nguyen and Feng Liu. 2015. Making Software Tutorial Video Responsive. In CHI.  ",
      "doi": "10.1145/2702123.2702209"
    },
    {
      "text": "Suporn Pongnumkul, Mira Dontcheva, Wilmot Li, Jue Wang, Lubomir D. Bourdev, Shai Avidan, and Michael F. Cohen. 2011. Pauseand-play: automatically linking screencast video tutorials with applications. In UIST.  ",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "Martin Porcheron, Joel E Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 640.  ",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Xin Rong, Adam Fourney, Robin N Brewer, Meredith Ringel Morris, and Paul N Bennett. 2017. Managing uncertainty in time expressions for virtual assistants. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 568--579.  ",
      "doi": "10.1145/3025453.3025674"
    },
    {
      "text": "Harvey Sacks, Emanuel A Schegloff, and Gail Jefferson. 1978. A simplest systematics for the organization of turn taking for conversation. In Studies in the organization of conversational interaction. Elsevier, 7--55.",
      "doi": ""
    },
    {
      "text": "Tanmay Sinha, Patrick Jermann, Nan Li, and Pierre Dillenbourg. 2014. Your click decides your fate: Inferring Information Processing and Attrition Behavior from MOOC Video Clickstream Interactions.",
      "doi": ""
    },
    {
      "text": "Alexandra Vtyurina and Adam Fourney. 2018. Exploring the Role of Conversational Cues in Guided Task Support with Virtual Assistants. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 208.  ",
      "doi": "10.1145/3173574.3173782"
    },
    {
      "text": "w3c. 2018. Web Accessibility Initiative. https://www.w3.org/ WAI/.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, John McCarthy, Peter C Wright, and Patrick Olivier. 2013. Making design probes work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3441--3450.  ",
      "doi": "10.1145/2470654.2466473"
    },
    {
      "text": "Xu Wang, Benjamin J. Lafreniere, and Tovi Grossman. 2018. Leveraging Community-Generated Videos and Command Logs to Classify and Recommend Software Workflows. In CHI.  ",
      "doi": "10.1145/3173574.3173859"
    }
  ]
}