{
  "doi": "10.1145/3290605.3300795",
  "title": "Behind the Voices: The Practice and Challenges of Esports Casters",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Casters commentate on a live, streamed video game for a large online audience. Drawing from 20 semi-structured interviews with amateur casters of either Dota 2 or Rocket League video games and over 20 hours of participant observations, we describe the distinctive practices of two types of casters, play-by-play and color commentary. Play-by-play casters are adept at improvising a rich narrative of hype on top of live games, whereas color commentators methodically prepare to fill in the gaps of live play with informative analysis. Casters often start out alone, relying upon reflective practice to hone their craft. Through examining challenges faced by amateur casters, we identified three design opportunities for game designers to support casters and would-be casters as first-class users. Such designs would provide an antidote to the challenges faced by amateur casters: those of the lack of social support for casting, camerawork, and data availability.",
  "tags": [
    "commentary",
    "color commentary",
    "live streaming",
    "video games",
    "esports",
    "play-by-play",
    "casting"
  ],
  "authors": [
    {
      "name": "Lucas Kempe-Cook",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367101",
      "orcid": "missing"
    },
    {
      "name": "Stephen Tsung-Han Sher",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365191",
      "orcid": "missing"
    },
    {
      "name": "Norman Makoto Su",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81100108464/rel-imgonly/su_norman_2014_02_002.jpg",
      "acmid": "81100108464",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jennings Bryant, Dan Brown, Paul W. Comisky, and Dolf Zillmann. 1982. Sports and Spectators: Commentary and Appreciation. Journal of Communication 32, 1 (March 1982), 109--119.",
      "doi": ""
    },
    {
      "text": "Jennings Bryant, Paul Comisky, and Dolf Zillmann. 1977. Drama in Sports Commentary. Journal of Communication 27, 3 (Sept. 1977), 140--149.",
      "doi": ""
    },
    {
      "text": "Christian Carlsson and Alex Pelling. 2015. Designing Spectator Interfaces for Competitive Video Games. Ph.D. Dissertation. Chalmer University of Technology, Gothenburg, Sweden. http://studentarbeten.chalmers.se/publication/224247-designingspectator-interfaces-for-competitive-video-games",
      "doi": ""
    },
    {
      "text": "Esports Charts. 2018. The International 2018 Statistics. https:// esc.watch/blog/post/stats-international-2018",
      "doi": ""
    },
    {
      "text": "Gifford Cheung and Jeff Huang. 2011. Starcraft from the Stands: Understanding the Game Spectator. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 763--772.  ",
      "doi": "10.1145/1978942.1979053"
    },
    {
      "text": "Paul Comisky, Jennings Bryant, and Dolf Zillmann. 1977. Commentary as a Substitute for Action. Journal of Communication 27, 3 (Sept. 1977), 150--153.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory (4 edition ed.). SAGE Publications, Inc, Los Angeles.",
      "doi": ""
    },
    {
      "text": "Valve Corporation. 2013. Dota 2. {PC Online}.",
      "doi": ""
    },
    {
      "text": "Valve Corporation. 2018. Dota 2 - Steam Charts. http:// steamcharts.com/app/570",
      "doi": ""
    },
    {
      "text": "Valve Corporation. 2018. The International Dota2 Championships. https://www.dota2.com/international/overview/",
      "doi": ""
    },
    {
      "text": "Valve Corporation. 2018. Rocket League - Steam Charts. http: //steamcharts.com/app/252950",
      "doi": ""
    },
    {
      "text": "Kathleen M. DeWalt and Billie R. DeWalt. 2011. Participant Observation: A Guide for Fieldworkers. Rowman Altamira, Lanham, Maryland, USA.",
      "doi": ""
    },
    {
      "text": "J. L. van Ditmarsch. 2013. Video Games as a Spectator Sport. Master Thesis. Utrecht University. http://dspace.library.uu.nl/handle/1874/",
      "doi": ""
    },
    {
      "text": "Colin M. Ford. 2017. Virtuosos on the Screen: Playing Virtual Characters Like Instruments in Competitive Super Smash Bros. Melee. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1935--1948.  ",
      "doi": "10.1145/3025453.3026053"
    },
    {
      "text": "Colin M. Ford, Dan Gardner, Leah Elaine Horgan, Calvin Liu, A. M. Tsaasan, Bonnie Nardi, and Jordan Rickman. 2017. Chat Speed OP PogChamp: Practices of Coherence in Massive Twitch Chat. In Proceedings of the ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 858--871.  ",
      "doi": "10.1145/3027063.3052765"
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2017. eSports As An Emerging Research Context at CHI: Diverse Perspectives on Definitions. In Proceedings of the CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 1601--1608.  ",
      "doi": "10.1145/3027063.3053158"
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2017. Social Support in eSports: Building Emotional and Esteem Support from Instrumental Support Interactions in a Highly Competitive Environment. In Proceedings of the Annual ACM Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, New York, NY, USA, 435-- 447.  ",
      "doi": "10.1145/3116595.3116635"
    },
    {
      "text": "Jeffrey Gottfried and Elisa Shearer. 2017. Americans' online news use is closing in on TV news use. http://www.pewresearch.org/facttank/2017/09/07/americans-online-news-use-vs-tv-news-use/",
      "doi": ""
    },
    {
      "text": "Juho Hamari and Max Sjöblom. 2017. What is eSports and why do people watch it? Journal of Internet Research 27, 2 (March 2017), 211--232.",
      "doi": ""
    },
    {
      "text": "William Hamilton, Andruid Kerne, and Tom Robbins. 2012. Highperformance Pen + Touch Modality Interactions: A Real-time Strategy Game eSports Context. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 309--318.  ",
      "doi": "10.1145/2380116.2380156"
    },
    {
      "text": "William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on Twitch: Fostering Participatory Communities of Play Within Live Mixed Media. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1315--1324.  ",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "William A. Hamilton, Nic Lupfer, Nicolas Botello, Tyler Tesch, Alex Stacy, Jeremy Merrill, Blake Williford, Frank R. Bentley, and Andruid Kerne. 2018. Collaborative Live Media Curation: Shared Context for Participation in Online Learning. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 555:1--555:14.  ",
      "doi": "10.1145/3173574.3174129"
    },
    {
      "text": "Christian Heath and Paul Luff. 1992. Collaboration and Control: Crisis Management and Multimedia Technology in London Underground Line Control Rooms. In Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW '92). ACM, New York, NY, USA, 24--48.",
      "doi": ""
    },
    {
      "text": "Business Insider Intelligence. 2017. The eSports competitive video gaming market continues to grow revenues & attract investors. http://www.businessinsider.com/esports-market-growthready-for-mainstream-2017--3",
      "doi": ""
    },
    {
      "text": "Eric Laurier and Stuart Reeves. 2014. Cameras in video games: Comparing play in Counter-Strike and the Doctor Who Adventures. In Studies of Video Practices. Routledge, London, UK. https://www.routledge.com/Studies-of-Video-Practices-Videoat-Work/Broth-Laurier-Mondada/p/book/9780415728393",
      "doi": ""
    },
    {
      "text": "Donghun Lee and Linda J. Schoenstedt. 2011. Comparison of eSports and Traditional Sports Consumption Motives. ICHPER-SD Journal of Research 6, 2 (2011), 39--44. https://eric.ed.gov/?id=EJ954495",
      "doi": ""
    },
    {
      "text": "Pascal Lessel, Alexander Vielhauer, and Antonio Krüger. 2017. Expanding Video Game Live-Streams with Enhanced Communication Channels: A Case Study. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1571--1576.  ",
      "doi": "10.1145/3025453.3025708"
    },
    {
      "text": "Wendy E. MacKay. 1999. Is Paper Safer? The Role of Paper Flight Strips in Air Traffic Control. ACM Transactions on Computer-Human Interaction 6, 4 (Dec. 1999), 311--340.  ",
      "doi": "10.1145/331490.331491"
    },
    {
      "text": "Grant McCracken. 1988. The Long Interview (1 edition ed.). SAGE Publications, Inc, Newbury Park.",
      "doi": ""
    },
    {
      "text": "Matthew K. Miller, John C. Tang, Gina Venolia, Gerard Wilkinson, and Kori Inkpen. 2017. Conversational Chat Circles: Being All Here Without Having to Hear It All. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2394--2404.  ",
      "doi": "10.1145/3025453.3025621"
    },
    {
      "text": "Ilya Musabirov, Denis Bulygin, Paul Okopny, and Ksenia Konstantinova. 2018. Event-driven Spectators' Communication in Massive eSports Online Chats. In Extended Abstracts of the 2018 ACM CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, LBW564:1--LBW564:6.  ",
      "doi": "10.1145/3170427.3188447"
    },
    {
      "text": "Psyonix. 2015. Rocket League. {PC Online}.",
      "doi": ""
    },
    {
      "text": "Lee Rainie. 2017. About 6 in 10 young adults in U.S. primarily use online streaming to watch TV. http: //www.pewresearch.org/fact-tank/2017/09/13/about-6-in-10young-adults-in-u-s-primarily-use-online-streaming-to-watch-tv",
      "doi": ""
    },
    {
      "text": "Aravindh Raman, Gareth Tyson, and Nishanth Sastry. 2018. Facebook (A)Live?: Are Live Social Broadcasts Really Broadcasts?. In Proceedings of the World Wide Web Conference on World Wide Web (WWW '18). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 1491--1500.  ",
      "doi": "10.1145/3178876.3186061"
    },
    {
      "text": "Matti Siekkinen, Enrico Masala, and Teemu Kämäräinen. 2016. A First Look at Quality of Mobile Live Streaming Experience: The Case of Periscope. In Proceedings of the Internet Measurement Conference (IMC '16). ACM, New York, NY, USA, 477--483.  ",
      "doi": "10.1145/2987443.2987472"
    },
    {
      "text": "Max Sjöblom and Juho Hamari. 2016. Why Do People Watch Others Play Video Games? An Empirical Study on the Motivations of Twitch Users. SSRN Scholarly Paper ID 2779543. Social Science Research Network, Rochester, NY. https://papers.ssrn.com/abstract=2779543",
      "doi": ""
    },
    {
      "text": "Stuart Reeves, Barry Brown, and Eric Laurier. 2009. Experts at Play: Understanding Skilled Expertise. Journal of Games and Culture 4, 3 (July 2009), 205--227.",
      "doi": ""
    },
    {
      "text": "Norman Makoto Su. 2010. Street Fighter IV: Braggadocio off and Online. In Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 361--370.  ",
      "doi": "10.1145/1718918.1718981"
    },
    {
      "text": "Norman Makoto Su and Patrick C. Shih. 2011. Virtual Spectating: Hearing Beyond the Video Arcade. In Proceedings of the 25th BCS Conference on Human-Computer Interaction (BCS-HCI '11). British Computer Society, Swinton, UK, UK, 269--278. http://dl.acm.org/ citation.cfm?id=2305316.2305365 ",
      "doi": "10.5555/2305316.2305365"
    },
    {
      "text": "John C. Tang, Funda Kivran-Swaine, Kori Inkpen, and Nancy Van House. 2017. Perspectives on Live Streaming: Apps, Users, and Research. In Companion of the ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion). ACM, New York, NY, USA, 123--126.  ",
      "doi": "10.1145/3022198.3022200"
    },
    {
      "text": "John C. Tang, Gina Venolia, and Kori M. Inkpen. 2016. Meerkat and Periscope: I Stream, You Stream, Apps Stream for Live Streams. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4770--4780.  ",
      "doi": "10.1145/2858036.2858374"
    },
    {
      "text": "Burak S. Tekin and Stuart Reeves. 2017. Ways of Spectating: Unravelling Spectator Participation in Kinect Play. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1558--1570.  ",
      "doi": "10.1145/3025453.3025813"
    },
    {
      "text": "Twitchmetrics. 2018. The Most Watched Twitch Streamers, April 2018 - Twitchmetrics. http://www.twitchmetrics.net/channels/viewership",
      "doi": ""
    },
    {
      "text": "Amy Voida, Sheelagh Carpendale, and Saul Greenberg. 2010. The Individual and the Group in Console Gaming. In Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 371--380.  ",
      "doi": "10.1145/1718918.1718983"
    },
    {
      "text": "Thomas Weiss and Sabrina Schiele. 2013. Virtual worlds in competitive contexts: Analyzing eSports consumer needs. Electronic Markets 23, 4 (Dec. 2013), 307--316.",
      "doi": ""
    }
  ]
}