{
  "doi": "10.1145/3290605.3300400",
  "title": "ThermalBracelet: Exploring Thermal Haptic Feedback Around the Wrist",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "Smartwatches enable the wrist to be used as an ideal location to provide always-available haptic notifications as they are constantly worn with direct contact with the skin. With the wrist straps, the haptic feedback can be extended to the full space around the wrist to provide more spatial and enriched feedback. With ThermalBracelet, we investigate thermal feedback as a haptic feedback modality around the wrist. We present three studies that lead to the development of a smartwatch-integratable thermal bracelet that stimulates six locations around the wrist. Our initial evaluation reports on the selection of the thermal module configurations. Secondly, with the selected six-module configuration, we explore its usability in a real-world scenarios such as walking and reading. Thirdly, we investigate its capability of providing spatio temporal feedback while engaged in distracting tasks. Finally we present application scenarios that demonstrates its usability.",
  "authors": [
    {
      "name": "Roshan Lalitha Peiris",
      "institution": "Keio University Graduate School of Media Design, Yokohama, Kanagawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385592390",
      "orcid": "0000-0002-4191-3565"
    },
    {
      "name": "Yuan-Ling Feng",
      "institution": "Keio University Graduate School of Media Design, Yokohama, Kanagawa, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659189694",
      "orcid": "missing"
    },
    {
      "name": "Liwei Chan",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659142992",
      "orcid": "missing"
    },
    {
      "name": "Kouta Minamizawa",
      "institution": "Keio University Graduate School of Media Design, Yokohama, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331499667",
      "orcid": "0000-0002-6303-5791"
    }
  ],
  "references": [
    {
      "text": "Shimon Akiyama, Katsunari Sato, Yasutoshi Makino, and Takashi Maeno. 2013. ThermOn: Thermo-musical Interface for an Enhanced Emotional Experience. In Proceedings of the 2013 International Symposium on Wearable Computers (ISWC '13). ACM, New York, NY, USA, 45--52.  ",
      "doi": "10.1145/2493988.2494326"
    },
    {
      "text": "Edward Arens and H Zhang. 2006. The skin's role in human thermoregulation and comfort. 560--602.",
      "doi": ""
    },
    {
      "text": "560 {3} M. Azadi and L. A. Jones. 2014. Evaluating Vibrotactile Dimensions for the Design of Tactons. IEEE Transactions on Haptics 7, 1 (Jan 2014), 14--23.  ",
      "doi": "10.1109/TOH.2013.2296051"
    },
    {
      "text": "Stephen Brewster and Lorna M. Brown. 2004. Tactons: Structured Tactile Messages for Non-visual Information Display. In Proceedings of the Fifth Conference on Australasian User Interface - Volume 28 (AUIC '04). Australian Computer Society, Inc., Darlinghurst, Australia, Australia, 15--23. http://dl.acm.org/citation.cfm?id=976310.976313 ",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "N. A. Caswell, R. T. Yardley, M. N. Montandon, and W. R. Provancher. 2012. Design of a forearm-mounted directional skin stretch device. In 2012 IEEE Haptics Symposium (HAPTICS). 365--370.",
      "doi": ""
    },
    {
      "text": "Hsiang-Yu Chen, Joseph Santos, Matthew Graves, Kwangtaek Kim, and Hong Z. Tan. 2008. Tactor Localization at the Wrist. In Haptics: Perception, Devices and Scenarios, Manuel Ferre (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 209--218.  ",
      "doi": "10.1007/978-3-540-69057-3_25"
    },
    {
      "text": "Francesco Chinello, Mirko Aurilio, Claudio Pacchierotti, and Domenico Prattichizzo. 2014. The HapBand: A Cutaneous Device for Remote Tactile Interaction. In Haptics: Neuroscience, Devices, Modeling, and Applications, Malika Auvray and Christian Duriez (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 284--291.",
      "doi": ""
    },
    {
      "text": "Aakar Gupta, Antony Albert Raj Irudayaraj, and Ravin Balakrishnan. 2017. HapticClench: Investigating Squeeze Sensations Using Memory Alloys. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 109--117.  ",
      "doi": "10.1145/3126594.3126598"
    },
    {
      "text": "Aakar Gupta, Thomas Pietrzak, Nicolas Roussel, and Ravin Balakrishnan. 2016. Direct Manipulation in Tactile Displays. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3683--3693.  ",
      "doi": "10.1145/2858036.2858161"
    },
    {
      "text": "Martin Halvey, Graham Wilson, Stephen Brewster, and Stephen Hughes. 2012. \"Baby It's Cold Outside\": The Influence of Ambient Temperature and Humidity on Thermal Feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 715--724.  ",
      "doi": "10.1145/2207676.2207779"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASATLX (Task Load Index): Results of Empirical and Theoretical Research. 52 (1988), 139 -- 183.",
      "doi": ""
    },
    {
      "text": "Liang He, Cheng Xu, Ding Xu, and Ryan Brill. 2015. PneuHaptic: Delivering Haptic Cues with a Pneumatic Armband. In Proceedings of the 2015 ACM International Symposium on Wearable Computers (ISWC '15). ACM, New York, NY, USA, 47--48.  ",
      "doi": "10.1145/2802083.2802091"
    },
    {
      "text": "Eve Hoggan, Andrew Crossan, Stephen A. Brewster, and Topi Kaaresoja. 2009. Audio or Tactile Feedback: Which Modality when?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 2253--2256.  ",
      "doi": "10.1145/1518701.1519045"
    },
    {
      "text": "Jonggi Hong, Alisha Pradhan, Jon E. Froehlich, and Leah Findlater. 2017. Evaluating Wrist-Based Haptic Feedback for Non-Visual Target Finding and Path Tracing on a 2D Surface. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '17). ACM, New York, NY, USA, 210--219.  ",
      "doi": "10.1145/3132525.3132538"
    },
    {
      "text": "Alexandra Ion, Edward Jay Wang, and Patrick Baudisch. 2015. Skin Drag Displays: Dragging a Physical Tactor Across the User's Skin Produces a Stronger Tactile Stimulus Than Vibrotactile. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2501--2504.  ",
      "doi": "10.1145/2702123.2702459"
    },
    {
      "text": "Ali Israr and Ivan Poupyrev. 2011. Tactile Brush: Drawing on Skin with a Tactile Grid Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2019--2028.  ",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "Seungwoo Je, Minkyeong Lee, Yoonji Kim, Liwei Chan, Xing-Dong Yang, and Andrea Bianchi. 2018. PokeRing: Notifications by Poking Around the Finger. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 542, 10 pages.  ",
      "doi": "10.1145/3173574.3174116"
    },
    {
      "text": "Kyungho Jeong, Youngah Seong, Junsung Chung, Yonggook Park, and Woohyoung Lee. 2015. Directional Thermal Perception for Wearable Device. In Proceedings of the ACM SIGGRAPH Symposium on Applied Perception (SAP '15). ACM, New York, NY, USA, 133--133.  ",
      "doi": "10.1145/2804408.2814184"
    },
    {
      "text": "L. A. Jones and H. Ho. 2008. Warm or Cool, Large or Small? The Challenge of Thermal Displays. IEEE Transactions on Haptics 1, 1 (Jan 2008), 53--70.  ",
      "doi": "10.1109/TOH.2008.2"
    },
    {
      "text": "Jaeyeon Lee, Jaehyun Han, and Geehyuk Lee. 2015. Investigating the Information Transfer Efficiency of a 3x3 Watch-back Tactile Display. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1229--1232.  ",
      "doi": "10.1145/2702123.2702530"
    },
    {
      "text": "Jaeyeon Lee and Geehyuk Lee. 2016. Designing a Non-contact Wearable Tactile Display Using Airflows. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 183--194.  ",
      "doi": "10.1145/2984511.2984583"
    },
    {
      "text": "Seungyon Claire Lee and Thad Starner. 2009. Mobile Gesture Interaction Using Wearable Tactile Displays. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 3437--3442.  ",
      "doi": "10.1145/1520340.1520499"
    },
    {
      "text": "Seungyon \"Claire\" Lee and Thad Starner. 2010. BuzzWear: Alert Perception in Wearable Tactile Displays on the Wrist. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 433--442.  ",
      "doi": "10.1145/1753326.1753392"
    },
    {
      "text": "Wonjun Lee and Youn-kyung Lim. 2010. Thermo-message: Exploring the Potential of Heat As a Modality of Peripheral Expression. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, New York, NY, USA, 4231--4236.  ",
      "doi": "10.1145/1753846.1754131"
    },
    {
      "text": "Kevin A. Li, Patrick Baudisch, William G. Griswold, and James D. Hollan. 2008. Tapping and Rubbing: Exploring New Dimensions of Tactile Feedback with Voice Coil Motors. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST '08). ACM, New York, NY, USA, 181--190.  ",
      "doi": "10.1145/1449715.1449744"
    },
    {
      "text": "Yi-Chi Liao, Yi-Ling Chen, Jo-Yu Lo, Rong-Hao Liang, Liwei Chan, and Bing-Yu Chen. 2016. EdgeVib: Effective Alphanumeric Character Output Using a Wrist-Worn Tactile Display. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 595--601.  ",
      "doi": "10.1145/2984511.2984522"
    },
    {
      "text": "M. Matscheko, A. Ferscha, A. Riener, and M. Lehner. 2010. Tactor placement in wrist worn wearables. In International Symposium on Wearable Computers (ISWC) 2010. 1--8.",
      "doi": ""
    },
    {
      "text": "Francis McGlone and David Reilly. 2010. The cutaneous sensory system. Neuroscience Biobehavioral Reviews 34, 2 (2010), 148 -- 159. Touch, Temperature, Pain/Itch and Pleasure.",
      "doi": ""
    },
    {
      "text": "M. Nakashige, M. Kobayashi, H. Tamaki, and S. Higashino. 2011. ?HiyaAtsu\" mouse: A device to augment GUIs with temperature. In 2011 IEEE International Conference on Consumer Electronics (ICCE). 877--878.",
      "doi": ""
    },
    {
      "text": "Masashi Nakatani, Katsunari Sato, Kunio Sato, Yuzuru Kawana, Daisuke Takai, Kouta Minamizawa, and Susumu Tachi. 2018. A Novel Multimodal Tactile Module that Can Provide Vibro-Thermal Feedback. In Haptic Interaction, Shoichi Hasegawa, Masashi Konyo, Ki-Uk Kyung, Takuya Nojima, and Hiroyuki Kajimoto (Eds.). Springer Singapore, Singapore, 437--443.",
      "doi": ""
    },
    {
      "text": "U Norrsell and H Olausson. 1994. Spatial cues serving the tactile directional sensibility of the human forearm. The Journal of Physiology 478, 3 (1994), 533--540.",
      "doi": ""
    },
    {
      "text": "S. Paneels, M. Anastassova, S. Strachan, S. P. Van, S. Sivacoumarane, and C. Bolzmacher. 2013. What's around me? Multi-actuator haptic feedback on the wrist. In 2013 World Haptics Conference (WHC). 407-- 412.",
      "doi": ""
    },
    {
      "text": "Jerome Pasquero, Scott J. Stobbe, and Noel Stonehouse. 2011. A Haptic Wristwatch for Eyes-free Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 3257--3266.  ",
      "doi": "10.1145/1978942.1979425"
    },
    {
      "text": "Roshan Lalintha Peiris, Liwei Chan, and Kouta Minamizawa. 2018. LiquidReality: Wetness Sensations on the Face for Virtual Reality. In Haptics: Science, Technology, and Applications, Domenico Prattichizzo, Hiroyuki Shinoda, Hong Z. Tan, Emanuele Ruffaldi, and Antonio Frisoli (Eds.). Springer International Publishing, Cham, 366--378.",
      "doi": ""
    },
    {
      "text": "Roshan Lalintha Peiris, Wei Peng, Zikun Chen, Liwei Chan, and Kouta Minamizawa. 2017. ThermoVR: Exploring Integrated Thermal Haptic Feedback with Head Mounted Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5452--5456.  ",
      "doi": "10.1145/3025453.3025824"
    },
    {
      "text": "Wei Peng, Roshan Lalintha Peiris, and Kouta Minamizawa. 2017. Exploring of Simulating Passing Through Feeling on the Wrist: Using Thermal Feedback. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 187--188.  ",
      "doi": "10.1145/3131785.3131819"
    },
    {
      "text": "Romina Poguntke, Francisco Kiss, Ayhan Kaplan, Albrecht Schmidt, and Stefan Schneegass. 2018. RainSense: Exploring the Concept of a Sense for Weather Awareness. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '18). ACM, New York, NY, USA, 9--15.  ",
      "doi": "10.1145/3236112.3236114"
    },
    {
      "text": "Henning Pohl, Peter Brandes, Hung Ngo Quang, and Michael Rohs. 2017. Squeezeback: Pneumatic Compression for Notifications. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5318--5330.  ",
      "doi": "10.1145/3025453.3025526"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Shienny Karwita, David Tolley, and Ellen Yi-Luen Do. 2017. Ambiotherm: Enhancing Sense of Presence in Virtual Reality by Simulating Real-World Environmental Conditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1731--1742.  ",
      "doi": "10.1145/3025453.3025723"
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Nguyen Thi Ngoc Tram, Koon Chuan Raymond Koh, David Tolley, Shienny Karwita, Lin Lien-Ya, Yan Liangkun, Kala Shamaiah, Chow Eason Wai Tung, Ching Chiuan Yen, and Ellen Yi-Luen Do. 2018. Season Traveller: Multisensory Narration for Enhancing the Virtual Reality Experience. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 577, 13 pages.  ",
      "doi": "10.1145/3173574.3174151"
    },
    {
      "text": "Anne Roudaut, Andreas Rau, Christoph Sterz, Max Plauth, Pedro Lopes, and Patrick Baudisch. 2013. Gesture Output: Eyes-free Output Using a Force Feedback Touch Surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2547--2556.  ",
      "doi": "10.1145/2470654.2481352"
    },
    {
      "text": "Katsunari Sato and Takashi Maeno. 2012. Presentation of Sudden Temperature Change Using Spatially Divided Warm and Cool Stimuli. Springer Berlin Heidelberg, Berlin, Heidelberg, 457--468.",
      "doi": ""
    },
    {
      "text": "Youngbo Aram Shim, Jaeyeon Lee, and Geehyuk Lee. 2018. Exploring Multimodal Watch-back Tactile Display Using Wind and Vibration. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article D305, 3 pages.  ",
      "doi": "10.1145/3173574.3173706"
    },
    {
      "text": "Anshul Singhal and Lynette A. Jones. 2018. Creating Thermal Icons-A Model-Based Approach. ACM Trans. Appl. Percept. 15, 2, Article 14 (March 2018), 22 pages.  ",
      "doi": "10.1145/3182175"
    },
    {
      "text": "Sunghyun Song, Geeyoung Noh, Junwoo Yoo, Ian Oakley, Jundong Cho, and Andrea Bianchi. 2015. Hot & Tight: Exploring Thermo and Squeeze Cues Recognition on Wrist Wearables. In Proceedings of the 2015 ACM International Symposium on Wearable Computers (ISWC '15). ACM, New York, NY, USA, 39--42.  ",
      "doi": "10.1145/2802083.2802092"
    },
    {
      "text": "A. A. Stanley and K. J. Kuchenbecker. 2011. Design of body-grounded tactile actuators for playback of human physical contact. In 2011 IEEE World Haptics Conference. 563--568.",
      "doi": ""
    },
    {
      "text": "J.C. Stevens and K.K. Choo. 1998. Temperature sensitivity of the body surface over the life span. Somatosensory motor research 15 (02 1998), 13--28.",
      "doi": ""
    },
    {
      "text": "Hong Z. Tan, Nathaniel I. Durlach, William M. Rabinowitz, Charlotte M. Reed, and Jonathan R. Santos. 1997. Reception of Morse code through motional, vibrotactile, and auditory stimulation. Perception & Psychophysics 59, 7 (01 Jan 1997), 1004--1017.",
      "doi": ""
    },
    {
      "text": "Jordan Tewell, Jon Bird, and George R. Buchanan. 2017. Heat-Nav: Using Temperature Changes As Navigation Cues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1131--1135.  ",
      "doi": "10.1145/3025453.3025965"
    },
    {
      "text": "Graham Wilson, Martin Halvey, Stephen A. Brewster, and Stephen A. Hughes. 2011. Some Like It Hot: Thermal Feedback for Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2555--2564.  ",
      "doi": "10.1145/1978942.1979316"
    }
  ]
}