{
  "doi": "10.1145/3290605.3300868",
  "title": "A 2nd Person Social Perspective on Bodily Play",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Recent HCI work on digital games highlighted the advantage for designers to take on a 1st person perspective on the human body (referring to the phenomenological \"lived\" body) and a 3rd person perspective (the material \"fleshy\" body, similar to looking in the mirror). This is useful when designing bodily play, however, we note that there is not much game design discussion on the 2nd person social perspective that highlights the unique interplay between human bodies. To guide designers interested in supporting players to experience their bodies as play, we describe how game designers can engage with the 2nd person social perspective through a set of design tactics based on four of our own play systems. With our work, we hope we can aid designers in embracing this 2nd person perspective so that more people can benefit from engaging their bodies through games and play.",
  "authors": [
    {
      "name": "Florian Floyd Mueller",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260236",
      "orcid": "0000-0001-6472-3476"
    },
    {
      "name": "Zhuying Li",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659209998",
      "orcid": "missing"
    },
    {
      "name": "Richard Byrne",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/do/10.1145/contrib-81467656581/rel-imgonly/me.png",
      "acmid": "81467656581",
      "orcid": "missing"
    },
    {
      "name": "Yash Dhanpal Mehta",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/do/10.1145/contrib-99659318840/rel-imgonly/99659318840.jpg",
      "acmid": "99659318840",
      "orcid": "missing"
    },
    {
      "name": "Peter Arnold",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163029",
      "orcid": "missing"
    },
    {
      "name": "Tuomas Kari",
      "institution": "RMIT University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658688915",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lawrence W Barsalou, Paula M Niedenthal, Aron K Barbey and Jennifer A Ruppert. Social Embodiment. Psychology of learning and motivation 43 (2003), 43--92.",
      "doi": ""
    },
    {
      "text": "S. Benford, H. Schnädelbach, B. Koleva, R. Anastasi, C. Greenhalgh, T. Rodden, J. Green, A. Ghali, T. Pridmore and B. Gaver. Expected, Sensed, and Desired: A Framework for Designing Sensing-Based Interaction. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 1 (2005), 3--30.  ",
      "doi": "10.1145/1057237.1057239"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall and Tom Rodden. 2012. Uncomfortable Interactions. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems. ACM, 2208347, 2005--2014.  ",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "C. F. Bond and L. J. Titus. Social Facilitation: A Meta-Analysis of 241 Studies. Psychological Bulletin 94, 2 (1983), 265--292.",
      "doi": ""
    },
    {
      "text": "Felix Brandmueller and Zhuying Li. 2017. Guts Game: A Game Using Ingestible Sensors. Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play. ACM, 3130866, 625--631.  ",
      "doi": "10.1145/3130859.3130866"
    },
    {
      "text": "Richard Byrne, Joe Marshall and Florian Mueller. 2016. Balance Ninja: Towards the Design of Digital Vertigo Games Via Galvanic Vestibular Stimulation. In Proceedings of 2016 Annual Symposium on Computer-Human Interaction in Play. ACM, 159--170.  ",
      "doi": "10.1145/2967934.2968080"
    },
    {
      "text": "Roger Caillois. Man, Play, and Games. University of Illinois Press, 1961.",
      "doi": ""
    },
    {
      "text": "Mert Canat, Mustafa Ozan Tezcan, Celalettin Yurdakul, Eran Tiza, Bugra Can Sefercik, Idil Bostan, Oguz Turan Buruk, Tilbe Göksun and Oguzhan Özcan. 2016. Sensation: Measuring the Effects of a Human-to-Human Social Touch Based Controller on the Player Experience. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3944--3955.  ",
      "doi": "10.1145/2858036.2858418"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W McDonald and James A Landay. Designing for Healthy Lifestyles: Design Considerations for Mobile Technologies to Encourage Consumer Health and Wellness. Human--Computer Interaction 6, 3--4 (2012), 167--315. A 2nd Person Social Perspective on Bodily Play Glasgow'19, May, 2019, UK  ",
      "doi": "10.1561/1100000040"
    },
    {
      "text": "A. Crabtree, M. Rouncefield and P. Tolmie. Doing Design Ethnography. Springer, 2012.",
      "doi": ""
    },
    {
      "text": "T. Djajadiningrat, K. Overbeeke and S. Wensveen. 2002. But How, Donald, Tell Us How? On the Creation of Meaning in Interaction Design through Feedforward and Inherent Feedback. DIS '02: Proceedings of the 4th conference on Designing Interactive Systems. ACM New York, NY, USA, 285--291.  ",
      "doi": "10.1145/778712.778752"
    },
    {
      "text": "P. Dourish. Where the Action Is: The Foundations of Embodied Interaction. Boston, MA, USA: MIT Press, 2001. ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Steven Dow, Wendy Ju and Wendy Mackay. Projection, Place and Point-of-View in Research through Design. The Sage Handbook of Digital Technology Research (2013), 266.",
      "doi": ""
    },
    {
      "text": "Die Gute Fabrik. Johann Sebastian Joust. jsjoust.com.",
      "doi": ""
    },
    {
      "text": "Game Oven. 2014. Bounden. http://playbounden.com/.",
      "doi": ""
    },
    {
      "text": "Bill Gaver and John Bowers. Annotated Portfolios. interactions 19, 4 (2012), 40--49.  ",
      "doi": "10.1145/2212877.2212889"
    },
    {
      "text": "William Gaver. 2012. What Should We Expect from Research through Design? Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2208538, 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Riitta Hari, Linda Henriksson, Sanna Malinen and Lauri Parkkonen. Centrality of Social Interaction in Human Brain Function. Neuron 88, 1 (2015), 181--193.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Martin Jonsson, Anna Ståhl and Johanna Mercurio. Year. Somaesthetic Appreciation Design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'16), San Jose, CA, USA.  ",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Kristina Hook, Anna Stahl, Martin Jonsson, Johanna Mercurio, Anna Karlsson and Eva-Carin Banka Johnson. Somaesthetic Design. interactions 22, 4 (2015), 26--33.  ",
      "doi": "10.1145/2770888"
    },
    {
      "text": "Eva Hornecker, Paul Marshall and Jörn Hurtienne. 2017. Locating Theories of Embodiment Along Three Axes: 1st - 3d Person, BodyContext, Practice-Cognition. http://www.ehornecker.de/Papers/SomaestheticWSembodimentshortie.pdf.",
      "doi": ""
    },
    {
      "text": "Katherine Isbister. Enabling Social Play: A Framework for Design and Evaluation. In Evaluating User Experience in Games, Regina Bernhaupt Ed. Springer London, 2010, 11--22.",
      "doi": ""
    },
    {
      "text": "Katherine Isbister. Connecting through Play. interactions 23, 4 (2016), 26--33.  ",
      "doi": "10.1145/2946999"
    },
    {
      "text": "Katherine Isbister. How Games Move Us: Emotion by Design. Mit Press, 2016. ",
      "doi": ""
    },
    {
      "text": "Katherine Isbister, Kaho Abe and Michael Karlesky. 2017. Interdependent Wearables (for Play): A Strong Concept for Design. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 465--471.  ",
      "doi": "10.1145/3025453.3025939"
    },
    {
      "text": "Katherine Isbister, Elena Márquez Segura, Suzanne Kirkpatrick, Xiaofeng Chen, Syed Salahuddin, Gang Cao and Raybit Tang. Yamove! A Movement Synchrony Game That Choreographs Social Interaction. Human technology 12 (2016).",
      "doi": ""
    },
    {
      "text": "Katherine Isbister and Florian Mueller. Guidelines for the Design of Movement-Based Games and Their Relevance to HCI. Human-- Computer Interaction 30, 3--4 (2014), 366--399.  ",
      "doi": "10.1080/07370024.2014.996647"
    },
    {
      "text": "Astrid Larssen, Lian Loke, Tony Robertson and Jenny Edwards. 2004. Understanding Movement as Input for Interaction--a Study of Two Eyetoy Games. Proceedings of OzCHI '04.",
      "doi": ""
    },
    {
      "text": "Peter Lewinski, Ed S. Tan, Marieke L. Fransen, Karolina Czarna and Crystal Butler. Hindering Facial Mimicry in Ad Viewing: Effects on Consumers' Emotions, Attitudes and Purchase Intentions. In Advances in Advertising Research (Vol. Vi): The Digital, the Classic, the Subtle, and the Alternative, Peeter Verlegh et al. Eds. Springer Fachmedien Wiesbaden (Wiesbaden), 2016, 281--288.",
      "doi": ""
    },
    {
      "text": "Zhuying Li, Felix Brandmueller, Florian Mueller and Stefan Greuter. 2017. Ingestible Games: Swallowing a Digital Sensor to Play a Game. Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play. ACM, 3131312, 511--518.  ",
      "doi": "10.1145/3130859.3131312"
    },
    {
      "text": "Conor Linehan, Sabine Harrer, Ben Kirman, Shaun Lawson and Marcus Carter. 2015. Games against Health: A Player-Centered Design Philosophy. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2732514, 589--600.  ",
      "doi": "10.1145/2702613.2732514"
    },
    {
      "text": "Lian Loke and Toni Robertson. Moving and Making Strange: An Embodied Approach to Movement-Based Interaction Design. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 1 (2013), 7.  ",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Max van Manen. Phenomenology of Practice. Phenomenology & Practice 1, 1 (2007).",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal and Asreen Rostami. Bodystorming for Movement-Based Interaction Design. Human Technology 12 (2016).",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Asreen Rostami and Annika Waern. 2016. Embodied Sketching. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 6014--6027.  ",
      "doi": "10.1145/2858036.2858486"
    },
    {
      "text": "Joe Marshall and Conor Linehan. 2017. Misrepresentation of Health Research in Exertion Games Literature. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4899--4910.  ",
      "doi": "10.1145/3025453.3025691"
    },
    {
      "text": "Joe Marshall, Conor Linehan and Adrian Hazzard. 2016. Designing Brutal Multiplayer Video Games. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 26692680.  ",
      "doi": "10.1145/2858036.2858080"
    },
    {
      "text": "Joe Marshall, Florian Mueller, Steve Benford and Sebastiaan Pijnappel. Expanding Exertion Gaming. International Journal of Human-Computer Studies 90 (2016), 1--13.  ",
      "doi": "10.1016/j.ijhcs.2016.02.003"
    },
    {
      "text": "Joe Marshall, Duncan Rowland, Stefan Rennick Egglestone, Steve Benford, Brendan Walker and Derek McAuley. 2011. Breath Control of Amusement Rides. Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 1978955, 73--82.  ",
      "doi": "10.1145/1978942.1978955"
    },
    {
      "text": "Joe Marshall and Paul Tennent. 2017. Touchomatic: Interpersonal Touch Gaming in the Wild. Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 417--428.  ",
      "doi": "10.1145/3064663.3064727"
    },
    {
      "text": "M. Merleau-Ponty. Phenomenology of Perception (Routledge Classics). Routledge, 1945.",
      "doi": ""
    },
    {
      "text": "F. Mueller, S. Agamanolis and R. Picard. 2003. Exertion Interfaces: Sports over a Distance for Social Bonding and Fun. In Proceedings of SIGCHI conference on Human factors in computing systems. ACM, 561--568.  ",
      "doi": "10.1145/642611.642709"
    },
    {
      "text": "Florian Mueller, Stefan Agamanolis, Martin Gibbs and Frank Vetere. 2008. Remote Impact: Shadowboxing over a Distance. In Proceedings of CHI '08 Extended Abstracts on Human factors in computing systems. ACM, 2291--2296.  ",
      "doi": "10.1145/1358628.1358672"
    },
    {
      "text": "Florian Mueller, Richard Byrne, Josh Andres and Rakesh Patibanda. 2018. Experiencing the Body as Play. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 3173784, 1--13.  ",
      "doi": "10.1145/3173574.3173784"
    },
    {
      "text": "Florian Mueller, Darren Edge, Frank Vetere, Martin Gibbs, Stefan. Agamanolis, Bert Bongers and Jennifer Sheridan. 2011. Designing Sports: A Framework for Exertion Games. In Proceedings of CHI '11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2651--2660.  ",
      "doi": "10.1145/1978942.1979330"
    },
    {
      "text": "Florian Mueller, Martin R. Gibbs, Frank Vetere and Darren Edge. Designing for Bodily Interplay in Social Exertion Games. ACM Trans. Comput.-Hum. Interact. 24, 3 (2017), 1--41.  ",
      "doi": "10.1145/3064938"
    },
    {
      "text": "Florian Mueller, Martin Gibbs, Frank Vetere, Stefan Agamanolis and Darren Edge. 2014. Designing Mediated Combat Play. Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. ACM, 149--156.  ",
      "doi": "10.1145/2540930.2540937"
    },
    {
      "text": "Florian Mueller and Katherine Isbister. 2014. Movement-Based Game Guidelines. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2557163, 2191--2200.  ",
      "doi": "10.1145/2556288.2557163"
    },
    {
      "text": "Florian Mueller, Sophie Stellmach, Saul Greenberg, Andreas Dippon, Susanne Boll, Jayden Garner, Rohit Khot, Amani Naseem and David Altimira. 2014. Proxemics Play: Understanding Proxemics for Designing Digital Play Experiences. Proceedings of the 2014 conference on Designing interactive systems. ACM, 533542.  ",
      "doi": "10.1145/2598510.2598532"
    },
    {
      "text": "Florian Mueller and Damon Young. 2017. Five Lenses for Designing Exertion Experiences. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3025746, 2473--2487.  ",
      "doi": "10.1145/3025453.3025746"
    },
    {
      "text": "Stephen Purpura, Victoria Schwanda, Kaiton Williams, William Stubler and Phoebe Sengers. 2011. Fit4life: The Design of a Persuasive Technology Promoting Healthy Behavior and Ideal Weight. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1979003, 423--432.  ",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Stuart Reeves, Steve Benford, Claire O'Malley and Mike Fraser. 2005. Designing the Spectator Experience. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1055074, 741--750.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "m.c. schraefel. #Makenormalbetter. interactions 24, 5 (2017), 24--26.  ",
      "doi": "10.1145/3125393"
    },
    {
      "text": "Elena Márquez Segura and Katherine Isbister. Enabling Co-Located Physical Social Play: A Framework for Design and Evaluation. In Game User Experience Evaluation, Springer, 2015, 209--238.",
      "doi": ""
    },
    {
      "text": "Elena Marquez Segura, Annika Waern, Jin Moen and Carolina Johansson. 2013. The Design Space of Body Games: Technological, Physical, and Social Design. Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 2466461, 33653374.  ",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Magy Seif El-Nasr, Bardia Aghabeigi, David Milam, Mona Erfani, Beth Lameman, Hamid Maygoli and Sang Mah. 2010. Understanding and Evaluating Cooperative Games. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 253--262.  ",
      "doi": "10.1145/1753326.1753363"
    },
    {
      "text": "Jenny Slatman. Our Strange Body: Philosophical Reflections on Identity and Medical Interventions. Amsterdam University Press, 2016.",
      "doi": ""
    },
    {
      "text": "T. Stach, TC Graham, J. Yim and R.E. Rhodes. 2009. Heart Rate Control of Exercise Video Games. Proceedings of Graphics Interface 2009. Canadian Information Processing Society, 125--132. ",
      "doi": "10.5555/1555880.1555912"
    },
    {
      "text": "Dag Svanæs. Interaction Design for and with the Lived Body: Some Implications of Merleau-Ponty's Phenomenology. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 1 (2013), 8.  ",
      "doi": "10.1145/2442106.2442114"
    },
    {
      "text": "Jakob Tholander and Stina Nylander. 2015. Snot, Sweat, Pain, Mud, and Snow: Performance and Experience in the Use of Sports Watches. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2913--2922.  ",
      "doi": "10.1145/2702123.2702482"
    },
    {
      "text": "Oscar Tomico, VO Winthagen and MMG Van Heist. 2012. Designing for, with or Within: 1st, 2nd and 3rd Person Points of View on Designing for Systems. Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design. ACM, 180--188.  ",
      "doi": "10.1145/2399016.2399045"
    },
    {
      "text": "T. Toscos, A. Faber, S. An and M. P. Gandhi. 2006. Chick Clique: Persuasive Technology to Motivate Teenage Girls to Exercise. CHI '06 Extended Abstracts on Human factors in Computing Systems. ACM New York, NY, USA, 1873--1878.  ",
      "doi": "10.1145/1125451.1125805"
    },
    {
      "text": "A Voida and S Greenberg. 2009. Wii All Play: The Console Game as a Computational Meeting Place. Proceedings of the 27th international conference on Human factors in computing systems. ACM, 1559--1568.  ",
      "doi": "10.1145/1518701.1518940"
    },
    {
      "text": "Danielle Wilde, Thecla Schiphorst and Sietske Klooster. Move to Design/Design to Move: A Conversation About Designing for the Body. interactions 18, 4 (2011), 22--27.  ",
      "doi": "10.1145/1978822.1978828"
    },
    {
      "text": "Douglas Edward Wilson. 2012. Designing for the Pleasures of Disputation-or-How to Make Friends by Trying to Kick Them! PhD Dissertation. IT University of Copenhagen",
      "doi": ""
    },
    {
      "text": "T Winograd and F Flores. Understanding Computers and Cognition: A New Foundation for Design. Ablex Publishing Corporation (Norwood, NJ, USA), 1986. ",
      "doi": "10.5555/576359"
    },
    {
      "text": "J. Yim and T. C. N. Graham. 2007. Using Games to Increase Exercise Motivation. In Proceedings of Future Play 2007. ACM New York, NY, USA, 166--173.  ",
      "doi": "10.1145/1328202.1328232"
    },
    {
      "text": "Jeffrey Yim and T. C. Nicholas Graham. 2007. Using Games to Increase Exercise Motivation. Proceedings of the 2007 conference on Future Play. ACM, 1328232, 166--173.  ",
      "doi": "10.1145/1328202.1328232"
    },
    {
      "text": "J Zimmerman, J Forlizzi and S Evenson. 2007. Research through Design as a Method for Interaction Design Research in HCI. Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "Zhuying Li, Rakesh Patibanda, Felix Brandmueller, Wei Wang, Kyle Berean, Stefan Greuter, and Florian Mueller. 2018. The Guts Game: Towards Designing Ingestible Games. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, New York, NY, USA, 271--283.  ",
      "doi": "10.1145/3242671.3242681"
    },
    {
      "text": "Yash Dhanpal Mehta, Rohit Ashok Khot, Rakesh Patibanda, and Florian Mueller. 2018. Arm-A-Dine: Towards Understanding the Design of Playful Embodied Eating Experiences. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '18). ACM, New York, NY, USA, 299--313.  ",
      "doi": "10.1145/3242671.3242710"
    },
    {
      "text": "Zhuying Li, Yan Wang, Wei Wang, Weikang Chen, Ti Hoang, Stefan Greuter, Florian Mueller. 2019. HeatCraft: Designing?Playful Experiences with Ingestible Sensors via Localized Thermal Stimuli. In Proceedings of ACM CHI conference on Human Factors in Computing Systems (CHI 2019). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3290605.3300806"
    }
  ]
}