{
  "doi": "10.1145/3290605.3300265",
  "title": "From HCI to HCI-Amusement: Strategies for Engaging what New Technology Makes Old",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Notions of what counts as a contribution to HCI continue to be contested as our field expands to accommodate perspectives from the arts and humanities. This paper aims to advance the position of the arts and further contribute to these debates by actively exploring what a \"non-contribution\" would look like in HCI. We do this by taking inspiration from Fluxus, a collective of artists in the 1950's and 1960's who actively challenged and reworked practices of fine arts institutions by producing radically accessible, ephemeral, and modest works of \"art-amusement.\" We use Fluxus to develop three analogous forms of \"HCI-amusements,\" each of which shed light on dominant practices and values within HCI by resisting to fit into its logics.",
  "tags": [
    "design research",
    "contributions",
    "hci-amusements",
    "fluxus"
  ],
  "authors": [
    {
      "name": "Laura Devendorf",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81557677456/rel-imgonly/laura_devendorf14ga.jpg",
      "acmid": "81557677456",
      "orcid": "0000-0002-3656-7936"
    },
    {
      "name": "Kristina Andersen",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands",
      "img": "/do/10.1145/contrib-81350575388/rel-imgonly/20151105_dw_rbma_paris_12168.jpg",
      "acmid": "81350575388",
      "orcid": "missing"
    },
    {
      "name": "Daniela K. Rosner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524398",
      "orcid": "0000-0001-9448-914X"
    },
    {
      "name": "Ron Wakkary",
      "institution": "Simon Fraser University & Eindhoven University of Technology, Surrey, BC, Canada",
      "img": "/do/10.1145/contrib-81100283877/rel-imgonly/img_3637_400x400.jpeg",
      "acmid": "81100283877",
      "orcid": "0000-0003-2073-715X"
    },
    {
      "name": "James Pierce",
      "institution": "California College of the Arts & University of California, Berkeley, San Francisco/Berkeley, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100303073",
      "orcid": "0000-0002-2192-1728"
    }
  ],
  "references": [
    {
      "text": "Philip E. Agre. 1997. Computation and Human Experience. Cambridge University Press, Cambridge ; New York. ",
      "doi": "10.5555/522884"
    },
    {
      "text": "Yoko Akama, Sarah Pink, and Shanti Sumartojo. 2018. Uncertainty and Possibility: New Approaches to Future Making in Design Anthropology .Bloomsbury Academic.",
      "doi": ""
    },
    {
      "text": "Moreshin Allahyari and Daniel Rourke. 2015. The 3D Additivist Cookbook. https://additivism.org/cookbook",
      "doi": ""
    },
    {
      "text": "Sareeta Amrute. 2016. Encoding Race, Encoding Class: Indian IT workers in Berlin .Duke University Press.",
      "doi": ""
    },
    {
      "text": "Kristina Andersen, Laura Devendorf, James Pierce, Ron Wakkary, and Daniela K. Rosner. 2018. Disruptive Improvisations: Making Use of Non-Deterministic Art Practices in HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article W11, bibinfonumpages8 pages.  ",
      "doi": "10.1145/3170427.3170630"
    },
    {
      "text": "Seyram Avle and Silvia Lindtner. 2016. Design (ing)'Here'and'There': Tech Entrepreneurs, Global Markets, and Reflexivity in Design Processes. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2233--2245.  ",
      "doi": "10.1145/2858036.2858509"
    },
    {
      "text": "Seyram Avle, Silvia Lindtner, and Kaiton Williams. 2017. How methods make designers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 472--483.  ",
      "doi": "10.1145/3025453.3025864"
    },
    {
      "text": "Anne Balsamo. 2011. Designing Culture: The Technological Imagination at Work. Duke University Press Books, Durham NC. ",
      "doi": "10.5555/2031616"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Lone Koefoed Hansen. 2015. Immodest Proposals: Research Through Design and Knowledge. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2093--2102.  ",
      "doi": "10.1145/2702123.2702400"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Howard S. Becker. 1976. Art Worlds and Social Types. American Behavioral Scientist, Vol. 19, 6 (July 1976), 703--718.",
      "doi": ""
    },
    {
      "text": "Jane Bennett. 2010. Vibrant Matter: A Political Ecology of Things unknown edition ed.). Duke University Press Books, Durham.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, William Gaver, and Andy Boucher. 2012. Probes. In Inventive Methods: The Happening of the Social, Celia Lury and Nina Wakeford (Eds.).",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, David Shay, Joseph 'Jofish' Kaye, and Phoebe Sengers. 2005. Critical Technical Practice as a Methodology for Values in Design. (2005).",
      "doi": ""
    },
    {
      "text": "Rosi Braidotti. 2015. Punk Women and Riot Grrls. Performance Philosophy, Vol. 1, 1 (April 2015), 239--254.",
      "doi": ""
    },
    {
      "text": "Geroge Brecht. 1961. Two Exercises.",
      "doi": ""
    },
    {
      "text": "Alastair Brotchie and Mel Gooding. 1995. A Book of Surrealist Games. Shambhala, Boston.",
      "doi": ""
    },
    {
      "text": "Susanne Bødker. 2015. Third-wave HCI, 10 Years Later-participation and Sharing. interactions, Vol. 22, 5 (Aug. 2015), 24--31.  ",
      "doi": "10.1145/2804405"
    },
    {
      "text": "Elizabeth Chin. 2016. My life with things: The consumer diaries .Duke University Press.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial Design. MIT Press. ",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Paul Dourish. 2006. Implications for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 541--550.  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Paul Dourish and Genevieve Bell. 2014. Divining a Digital Future: Mess and Mythology in Ubiquitous Computing reprint edition ed.). The MIT Press. ",
      "doi": "10.5555/2018772"
    },
    {
      "text": "Paul Duguid. 1996. Material Matters: Aspects of the Past and the Futurology of the Book. In The Future of the Book, , Geoff Nunberg (Ed.). http://people.ischool.berkeley.edu/ duguid/SLOFI/Material_Matters.htm",
      "doi": ""
    },
    {
      "text": "Anthony Dunne. 2008. Hertzian Tales: Electronic Products, Aesthetic Experience, and Critical Design. The MIT Press, Cambridge, Mass.; London. ",
      "doi": "10.5555/1205303"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative Everything: Design, Fiction, and Social Dreaming. The MIT Press. ",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Sarah Fox and Daniela K. Rosner. 2016. Continuing the Dialogue: Bringing Research Accounts Back into the Field. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1426--1430.  ",
      "doi": "10.1145/2858036.2858054"
    },
    {
      "text": "Sarah Fox, Rachel Rose Ulgado, and Daniela Rosner. 2015. Hacking Culture, Not Devices: Access and Recognition in Feminist Hackerspaces. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 56--68.  ",
      "doi": "10.1145/2675133.2675223"
    },
    {
      "text": "Christopher Frayling. 1993. Research in Art and Design. Royal College of Art Research Papers 1 1 (1993), 1--5.",
      "doi": ""
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti. 1999. Design: Cultural Probes. interactions, Vol. 6, 1 (Jan. 1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Bill Gaver and Kia Höök. 2017a. In Search of the Elusive CHI Design Paper. Interactions, Vol. 24, 2 (Feb. 2017), 22--23.  ",
      "doi": "10.1145/3039901"
    },
    {
      "text": "William Gaver. 2012. What Should We Expect from Research Through Design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "William Gaver and Kristina Höök. 2017b. What Makes a Good CHI Design Paper? Interactions, Vol. 24, 3 (April 2017), 20--21.  ",
      "doi": "10.1145/3076255"
    },
    {
      "text": "Natilee Harren. 2015. The Crux of Fluxus: Intermedia, Rear-guard. Living Collections Catalogue, Vol. 2, 1 (March 2015). http://www.walkerart.org/collections/publications/art-expanded/crux-of-fluxus/",
      "doi": ""
    },
    {
      "text": "Natilee Harren. 2016. Fluxus and the Transitional Commodity. Art Journal, Vol. 75, 1 (Jan. 2016), 44--69.",
      "doi": ""
    },
    {
      "text": "Garnet Hertz. 2012. Crtical Making. http://conceptlab.com/criticalmaking/",
      "doi": ""
    },
    {
      "text": "Garnet Hertz. 2016. http://www.disobedientelectronics.com/",
      "doi": ""
    },
    {
      "text": "Dick Higgins. 2018. Intermedia, Fluxus and the Something Else Press. http://sigliopress.com/book/dick-higgins/",
      "doi": ""
    },
    {
      "text": "Hannah Higgins. 2002. Fluxus Experience first edition ed.). University of California Press, Berkeley.",
      "doi": ""
    },
    {
      "text": "IDEO. 2013. IDEO Method Cards: 51 Ways to Inspire Design.",
      "doi": ""
    },
    {
      "text": "Rosemary A. Joyce and Susan D. Gillespie (Eds.). 2015. Things in Motion: Object Itineraries in Anthropological Practice first edition ed.). School for Advanced Research Press, Santa Fe.",
      "doi": ""
    },
    {
      "text": "Corita Kent and Jan Steward. 2008. Learning by Heart: Teachings to Free the Creative Spirit 2nd edition ed.). Allworth Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Vera Khovanskaya, Lynn Dombrowski, Ellie Harmon, Matthias Korn, Ann Light, Michael Stewart, and Amy Voida. 2018. Designing Against the Status Quo. Interactions, Vol. 25, 2 (Feb. 2018), 64--67.  ",
      "doi": "10.1145/3178560"
    },
    {
      "text": "Alison Knowles. 1971. Journal of the Identical Lunch. http://www.walkerart.org/collections/artworks/journal-of-the-identical-lunch",
      "doi": ""
    },
    {
      "text": "Matthias Korn and Amy Voida. 2015. Creating Friction: Infrastructuring Civic Engagement in Everyday Life. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (CA '15). Aarhus University Press, 145--156.  ",
      "doi": "10.7146/aahcc.v1i1.21198"
    },
    {
      "text": "Cliff Lampe. 2016. What makes research a contribution to CHI? https://medium.com/@clifflampe/what-makes-research-a-contribution-to-chi-263873b22f0",
      "doi": ""
    },
    {
      "text": "Ann Light, Alison Powell, and Irina Shklovski. 2017a. Design for Existential Crisis in the Anthropocene Age. In Proceedings of the 8th International Conference on Communities and Technologies (C&T '17). ACM, New York, NY, USA, 270--279.  ",
      "doi": "10.1145/3083671.3083688"
    },
    {
      "text": "Ann Light, Alison Powell, and Irina Shklovski. 2017b. Design for Existential Crisis in the Anthropocene Age. In Proceedings of the 8th International Conference on Communities and Technologies (C&T '17). ACM, New York, NY, USA, 270--279.  ",
      "doi": "10.1145/3083671.3083688"
    },
    {
      "text": "Nick Logler, Daisy Yoo, and Batya Friedman. 2018. Metaphor Cards: A How-to-Guide for Making and Using a Generative Metaphorical Design Toolkit. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 1373--1386.  ",
      "doi": "10.1145/3196709.3196811"
    },
    {
      "text": "George Maciunas. 1966. Fluxus (Its Historical Development and Relationship to Avant-Garde Movements).",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical Design in HCI Research: Designing and Learning Through Use-it-yourself. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 514--523.  ",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Hans Ulrich Obrist and Independent Curators International (Eds.). 2013. do it: the compendium .Independent Curators International.",
      "doi": ""
    },
    {
      "text": "Judith S. Olson and Wendy A. Kellogg (Eds.). 2014. Ways of Knowing in HCI. Springer-Verlag, New York. //www.springer.com/us/book/9781493903771 ",
      "doi": "10.5555/2631405"
    },
    {
      "text": "Yoko Ono and John Lennon. 2000. Grapefruit: A Book of Instructions and Drawings by Yoko Ono. Simon & Schuster, New York.",
      "doi": ""
    },
    {
      "text": "Kavita Philip, Lilly Irani, and Paul Dourish. 2012. Postcolonial Computing: A Tactical Survey. Science, Technology, & Human Values, Vol. 37, 1 (Jan. 2012), 3--29.",
      "doi": ""
    },
    {
      "text": "Matt Ratto. 2011. Critical Making: Conceptual and Material Studies in Technology and Social Life. The Information Society, Vol. 27, 4 (July 2011), 252--260.  ",
      "doi": "10.1080/01972243.2011.583819"
    },
    {
      "text": "Daniela K. Rosner. 2018. Critical Fabulations: Reworking the Methods and Margins of Design .MIT Press.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner, Margaret E. Morris, Ariel Duncan, Sarah E. Fox, Kathi R. Kitner, Ankur Agrawal, and Mei J. Chen. 2016. Designing for Movement in Public Life with Itinerant Probes. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 1072--1082.  ",
      "doi": "10.1145/2901790.2901913"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph 'Jofish' Kaye. 2005. Reflective Design. In Proceedings of the 4th Decennial Conference on Critical Computing: Between Sense and Sensibility (CC '05). ACM, New York, NY, USA, 49--58.  ",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Phoebe Sengers and Garnet Hertz. 2015. Conversations in Critical Making textbar 2. Critical Technical Practice and Critical Making textbar CTheory .",
      "doi": ""
    },
    {
      "text": "Herbert Simon. 1996. The Sciences of the Artificial, Third Edition .MIT Press. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "La Monte Young (Ed.). 1963. An Anthology of Chance Operations. first edition edition ed.). La Monte Young & Jackson Mac Low.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design As a Method for Interaction Design Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An Analysis and Critique of Research Through Design: Towards a Formalization of a Research Approach. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 310--319.  ",
      "doi": "10.1145/1858171.1858228"
    }
  ]
}