{
  "doi": "10.1145/3290605.3300622",
  "title": "Why Do You Need This?: Selective Disclosure of Data Among Citizen Scientists",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "Recent scandals involving data from participatory research have contributed to broader public concern about online privacy. Such concerns might make people more reluctant to participate in research that asks them to volunteer personal data, compromising many researchers' data collection. We tested several motivational messages that encouraged participation in a citizen science project. We measured people's willingness to disclose personal information. While participants were less likely to share sensitive data than neutral data, disclosure behaviour was not affected by attitudes to privacy. Importantly, we found that citizen scientists who were exposed to a motivational message that emphasised 'learning' were more likely to share sensitive information than those presented with other types of motivational cues. Our results suggest that priming individuals with motivational messages can increase their willingness to contribute personal data to a project, even if the request pertains to sensitive information.",
  "authors": [
    {
      "name": "Anna Rudnicka",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365633",
      "orcid": "missing"
    },
    {
      "name": "Anna L. Cox",
      "institution": "University College London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81350567335/rel-imgonly/a.cox.png",
      "acmid": "81350567335",
      "orcid": "0000-0003-2231-2964"
    },
    {
      "name": "Sandy J. J. Gould",
      "institution": "University of Birmingham, Birmingham, United Kingdom",
      "img": "/do/10.1145/contrib-81502713252/rel-imgonly/s.gould.large.jpg",
      "acmid": "81502713252",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alastair R. Beresford, Dorothea Kübler, and Soren Preibusch. Unwillingness to pay for privacy: A field experiment. Economics Letters, 2012.",
      "doi": ""
    },
    {
      "text": "Rick Bonney, Caren B. Cooper, Janis Dickinson, Steve Kelling, Tina Phillips, Kenneth V. Rosenberg, and Jennifer Shirk. Citizen Science: A Developing Tool for Expanding Science Knowledge and Scientific Literacy. BioScience, 2009.",
      "doi": ""
    },
    {
      "text": "Anne Bowser, Katie Shilton, Jennifer Preece, and Elizabeth Warrick. Accounting for privacy in citizen science: Ethical research in a context of openness Volunteer Motivation. Proceedings of CSCW 2017, 2017.  ",
      "doi": "10.1145/2998181.2998305"
    },
    {
      "text": "Anne Bowser, Andrea Wiggins, Lea Shanley, Jennifer Preece, and Sandra Henderson. Sharing data while protecting privacy in citizen science. interactions, 2014.  ",
      "doi": "10.1145/2540032"
    },
    {
      "text": "Matthew Crain. The limits of transparency: Data brokers and commodification. New Media and Society, 2018.",
      "doi": ""
    },
    {
      "text": "Lea Den Broeder, Lidwien Lemmens, Serfanim Uysal, Karin Kauw, Jitske Weekenborg, Michaela Schönenberger, Simone KloosterKwakkelstein, Mieke Schoenmakers, Willie Scharwächter, Annemarije Van de Weerd, Samira El Baouchi, Albertine Jantine Schuit, and Annemarie Wagemakers. Public Health Citizen Science; Perceived Impacts on Citizen Scientists: A Case Study in a Low-Income Neighbourhood in the Netherlands. Citizen Science: Theory and Practice, 2(1):1--17, 2017.",
      "doi": ""
    },
    {
      "text": "David Diner, Shinnosuke Nakayama, Oded Nov, and Maurizio Porfiri. Social signals as design interventions for enhancing citizen science contributions. Information, Communication & Society, 21(4):594--611, 2018.",
      "doi": ""
    },
    {
      "text": "Margret C. Domroese and Elizabeth A. Johnson. Why watch bees? Motivations of citizen science volunteers in the Great Pollinator Project. Biological Conservation, 208:40--47, 4 2017.",
      "doi": ""
    },
    {
      "text": "European Union. Regulation 2016/679 of the European parliament and the Council of the European Union. Official Journal of the European Communities, 2016.",
      "doi": ""
    },
    {
      "text": "Alexandra Eveleigh, Charlene Jennett, Ann Blandford, Philip Brohan, and Anna L. Cox. Designing for dabblers and deterring drop-outs in citizen science. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14, 2014.  ",
      "doi": "10.1145/2556288.2557262"
    },
    {
      "text": "Harris and Associates Inc. and Alan Westin. E- commerce and privacy: What net users want. Technical report, Privacy and American Business and Pricewaterhouse Coopers LLP, 1998.",
      "doi": ""
    },
    {
      "text": "Michael Hoerger. Participant Dropout as a Function of Survey Length in Internet-Mediated University Studies: Implications for Study Design and Voluntary Participation in Psychological Research. Cyberpsychology, Behavior, and Social Networking, 2010.",
      "doi": ""
    },
    {
      "text": "J. Horne and O. Ostberg. A self-assessment questionnaire to determine morningness-eveningness in human circadian rhythms. Internacional Journal of Chronobiology, 4(2):97--110, 1976.",
      "doi": ""
    },
    {
      "text": "Information Commissioner's Office. Investigation into the use of data analytics in political campaigns. Investigation update. 2018.",
      "doi": ""
    },
    {
      "text": "Charlene Jennett, Dominic J. Furniss, Ioanna Iacovides, Sarah Wiseman, Sandy J. J. Gould, and Anna L. Cox. Exploring Citizen Psych-Science and the Motivations of Errordiary Volunteers. Human Computation, 2014.",
      "doi": ""
    },
    {
      "text": "Zhenhui Jiang, Cheng Suang Heng, and Ben C. F. Choi. Privacy concerns and privacy-protective behavior in synchronous online social interactions. Information Systems Research, 2013.",
      "doi": ""
    },
    {
      "text": "Sunyoung Kim, Jennifer Mankoff, and Eric Paulos. Sensr. In Proceedings of the 2013 conference on Computer supported cooperative work - CSCW '13, 2013.",
      "doi": ""
    },
    {
      "text": "Spyros Kokolakis. Privacy attitudes and privacy behaviour: A review of current research on the privacy paradox phenomenon, 2017.",
      "doi": ""
    },
    {
      "text": "Simone Leao, Kok Leong Ong, and Adam Krezel. 2Loud?: Community mapping of exposure to traffic noise with mobile phones. Environmental Monitoring and Assessment, 2014.",
      "doi": ""
    },
    {
      "text": "Tae Kyoung Lee, Kevin Crowston, Carsten Østerlund, and Grant Miller. Recruiting Messages Matter. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17 Companion, 2017.",
      "doi": ""
    },
    {
      "text": "George MacKerron and Susana Mourato. Happiness is greater in natural environments. Global Environmental Change, 23(5):992--1000, 10 2013.",
      "doi": ""
    },
    {
      "text": "Miguel Malheiros, Sacha Brostoff, Charlene Jennett, and M. Angela Sasse. Would you sell your mother's data? personal data disclosure in a simulated credit card application. In The Economics of Information Security and Privacy. 2013.",
      "doi": ""
    },
    {
      "text": "Helia Marreiros, Mirco Tonin, Michael Vlassopoulos, and M. C. Schraefel. ?Now that you mention it': A survey experiment on information, inattention and online privacy. Journal of Economic Behavior and Organization, 2017.",
      "doi": ""
    },
    {
      "text": "Patricia A. Norberg, Daniel R. Horne, and David A. Horne. The Privacy Paradox: Personal Information Disclosure Intentions versus Behaviors. Journal of Consumer Affairs, 41:100--126, 2007.",
      "doi": "10.1111/j.1745-"
    },
    {
      "text": "Ofcom. Adults' Media Use and Attitudes Report 2015. Technical report, 2015.",
      "doi": ""
    },
    {
      "text": "Ofcom. Adults' Media Use and Attitudes Report 2016. Technical report, 2016.",
      "doi": ""
    },
    {
      "text": "Ofcom. Adults' Media Use and Attitudes Report 2017. Technical report, 2017.",
      "doi": ""
    },
    {
      "text": "Jennifer Preece. Citizen Science: New Research Challenges for Human-- Computer Interaction. International Journal of Human-Computer Interaction, 2016.",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke, Ann Arbor, and Krzysztof Z. Gajos. LabintheWild: Conducting Large-Scale Online Experiments With Uncompensated Samples. CSCW, 2015.  ",
      "doi": "10.1145/2675133.2675246"
    },
    {
      "text": "Sven Schade and Chrysi Tsinaraki. Survey Report: Data Management in Citizen Science Projects. 2016.",
      "doi": ""
    },
    {
      "text": "Jonathan Silvertown. A new dawn for citizen science. Trends in Ecology and Evolution, 2009.",
      "doi": ""
    },
    {
      "text": "Robert Simpson, Kevin R. Page, and David De Roure. Zooniverse: observing the world's largest citizen science platform. In Proceedings of the 23rd International Conference on World Wide Web, pages 1049-- 1054. ACM, 2014.  ",
      "doi": "10.1145/2567948.2579215"
    },
    {
      "text": "Brian L. Sullivan, Christopher L. Wood, Marshall J. Iliff, Rick E. Bonney, Daniel Fink, and Steve Kelling. eBird: A citizen-based bird observation network in the biological sciences. Biological Conservation, 142(10):2282--2292, 10 2009.",
      "doi": ""
    },
    {
      "text": "Sarah Wiseman, Anna L. Cox, Sandy J. J. Gould, and Duncan P. Brumby. Exploring the effects of non-monetary reimbursement for participants in HCI research. Human Computation, 4(1):1--24, 2017.",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Vasyl Pihur, Lauren Schmidt, Laura Brandimarte, and Alessandro Acquisti. Would a privacy fundamentalist sell their DNA for $1000... if nothing bad happened as a result? The Westin categories, behavioral intentions, and consequences. In USENIX Association Tenth Symposium On Usable Privacy and Security, volume 1, 2014. ",
      "doi": "10.5555/3235838.3235840"
    }
  ]
}