{
  "doi": "10.1145/3290605.3300257",
  "title": "Cluster Touch: Improving Touch Accuracy on Smartphones for People with Motor and Situational Impairments",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "We present Cluster Touch, a combined user-independent and user-specific touch offset model that improves the accuracy of touch input on smartphones for people with motor impairments, and for people experiencing situational impairments while walking. Cluster Touch combines touch examples from multiple users to create a shared user-independent touch model, which is then updated with touch examples provided by an individual user to make it user-specific. Owing to this combination, Cluster Touch allows people to quickly improve the accuracy of their smartphones by providing only 20 touch examples. In a user study with 12 people with motor impairments and 12 people without motor impairments, but who were walking, Cluster Touch improved touch accuracy by 14.65% for the former group and 6.81% for the latter group over the native touch sensor. Furthermore, in an offline analysis of existing mobile interfaces, Cluster Touch improved touch accuracy by 8.21% and 4.84% over the native touch sensor for the two user groups, respectively.",
  "tags": [
    "touch input",
    "smartphones",
    "situational impairments",
    "motor impairments",
    "accessibility",
    "touch modeling",
    "ability-based design"
  ],
  "authors": [
    {
      "name": "Martez E. Mott",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81472645021/rel-imgonly/mott_headshot_2019.jpg",
      "acmid": "81472645021",
      "orcid": "0000-0003-4711-7268"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "Lisa Anthony, YooJin Kim, and Leah Findlater. 2013. Analyzing user-generated Youtube videos to understand touchscreen use by people with motor impairments. Proceedings of ACM CHI 2013, 1223--1232.  ",
      "doi": "10.1145/2470654.2466158"
    },
    {
      "text": "Ravin Balakrishnan. 2004. \"Beating\" Fitts' law: Virtual enhancements for pointing facilitation. International Journal of Human-Computer Studies 61, 6: 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta, Antti Oulasvirta, and Stephen Brewster. 2011. The effects of walking speed on target acquisition on a touchscreen interface. Proceedings of ACM MobileHCI 2011, 143--146.  ",
      "doi": "10.1145/2037373.2037396"
    },
    {
      "text": "Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. FFitts law: Modeling finger touch with Fitts' law. Proceedings of ACM CHI 2013, 1363-- 1372.  ",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Xiaojun Bi and Shumin Zhai. 2013. Bayesian touch: A statistical criterion of target selection with finger touch. Proceedings of ACM UIST 2013, 51--60.  ",
      "doi": "10.1145/2501988.2502058"
    },
    {
      "text": "Pradipta Biswas and Patrick Langdon. 2012. Developing multimodal adaptation algorithm for mobility impaired users by evaluating their hand strength. International Journal of Human-Computer Interaction 28, 9: 576--596.",
      "doi": ""
    },
    {
      "text": "Daniel Buschek and Florian Alt. 2015. TouchML: A Machine learning toolkit for modelling spatial touch targeting behaviour. Proceedings of ACM IUI 2015, 110--114.  ",
      "doi": "10.1145/2678025.2701381"
    },
    {
      "text": "Daniel Buschek and Florian Alt. 2017. ProbUI: Generalising touch target representations to enable declarative gesture definition for probabilistic GUIs. Proceedings of ACM CHI 2017, 4640--4653.  ",
      "doi": "10.1145/3025453.3025502"
    },
    {
      "text": "Daniel Buschek, Simon Rogers, and Roderick Murray-Smith. 2013. User-specific touch models in a cross-device context. Proceedings of ACM MobileHCI 2013, 382--391.  ",
      "doi": "10.1145/2493190.2493206"
    },
    {
      "text": "Karen B. Chen, Anne B. Savage, Amrish O. Chourasia, Douglas A. Wiegmann, and Mary E. Sesto. 2013. Touch screen performance by individuals with and without motor control disabilities. Applied Ergonomics 44, 2: 297--302.",
      "doi": ""
    },
    {
      "text": "Andrew Crossan, Roderick Murray-Smith, Stephen Brewster, James Kelly, and Bojan Musizza. 2005. Gait phase effects in mobile interaction. Extended Abstracts of CHI 2005, 1312--1315.  ",
      "doi": "10.1145/1056808.1056904"
    },
    {
      "text": "Biplab Deka, Zifeng Huang, Chad Franzen, Joshua Hibschman, Daniel Afergan, Yang Li, Jeffrey Nichols, and Ranjitha Kumar. 2017. RICO: A mobile app dataset for building data-driven design applications. Proceedings of ACM UIST 2017, 845--854.  ",
      "doi": "10.1145/3126594.3126651"
    },
    {
      "text": "Morgan Dixon, James Fogarty, and Jacob O. Wobbrock. 2012. A general-purpose target-aware pointing enhancement using pixel-level analysis of graphical interfaces. Proceedings of ACM CHI 2012, 3167--3176.  ",
      "doi": "10.1145/2207676.2208734"
    },
    {
      "text": "Sacha N. Duff, Curt B. Irwin, Jennifer L. Skye, Mary E. Sesto, and Douglas A. Wiegmann. 2010. The effect of disability and approach on touch screen performance during a number entry task. Proceedings of the Human Factors and Ergonomics Society Annual Conference (HFES '10), 566--570.",
      "doi": ""
    },
    {
      "text": "Leah Findlater, Alex Jansen, Kristen Shinohara, Morgan Dixon, Peter Kamb, Joshua Rakita, and Jacob O. Wobbrock. 2010. Enhanced area cursors: Reducing fine pointing demands for people with motor impairments. Proceedings of ACM UIST 2010, 153--162.  ",
      "doi": "10.1145/1866029.1866055"
    },
    {
      "text": "Leah Findlater, Karyn Moffatt, Jon E. Froehlich, Meethu Malu, and Joan Zhang. 2017. Comparing touchscreen and mouse input performance by people with and without upper body motor impairments. Proceedings of ACM CHI 2017, 6056--6061.  ",
      "doi": "10.1145/3025453.3025603"
    },
    {
      "text": "Jon Froehlich, Jacob O. Wobbrock, and Shaun K. Kane. 2007. Barrier pointing: Using physical edges to assist target acquisition on mobile device touch screens. Proceedings of ACM ASSETS 2007, 19--26.  ",
      "doi": "10.1145/1296843.1296849"
    },
    {
      "text": "Krzysztof Gajos, Jacob O. Wobbrock, and Daniel S. Weld. 2007. Automatically generating user interfaces adapted to users' motor and vision capabilities. Proceedings of ACM UIST 2007, 231--240.  ",
      "doi": "10.1145/1294211.1294253"
    },
    {
      "text": "Krzysztof Z. Gajos, Jacob O. Wobbrock, and Daniel S. Weld. 2008. Improving the performance of motor-impaired users with automatically-generated, ability-based interfaces. Proceedings of ACM CHI 2008, 1257--1266.  ",
      "doi": "10.1145/1357054.1357250"
    },
    {
      "text": "Mayank Goel, Leah Findlater, and Jacob O. Wobbrock. 2012. WalkType: Using accelerometer data to accomodate situational impairments in mobile touch screen text entry. Proceedings of ACM CHI 2012, 2687--2696.  ",
      "doi": "10.1145/2207676.2208662"
    },
    {
      "text": "Mayank Goel, Jacob O. Wobbrock, and Shwetak Patel. 2012. GripSense: Using built-in sensors to detect hand posture and pressure on commodity mobile phones. Proceedings of ACM UIST 2012, 545--554.  ",
      "doi": "10.1145/2380116.2380184"
    },
    {
      "text": "Tiago Guerreiro, Hugo Nicolau, Joaquim Jorge, and Daniel Gonçalves. 2010. Assessing mobile touch interfaces for tetraplegics. Proceedings of ACM MobileHCI 2010, 31--34.  ",
      "doi": "10.1145/1851600.1851608"
    },
    {
      "text": "Tiago Guerreiro, Hugo Nicolau, Joaquim Jorge, and Daniel Gonçalves. 2010. Towards accessible touch interfaces. Proceedings of ACM ASSETS 2010, 19--26.  ",
      "doi": "10.1145/1878803.1878809"
    },
    {
      "text": "J. A. Hartigan and M. A. Wong. 1979. Algorithm AS 136: A KMeans clustering algorithm. Journal of the Royal Statistical Society. Series C (Applied Statistics) 28, 1: 100--108.",
      "doi": ""
    },
    {
      "text": "Niels Henze, Enrico Rukzio, and Susanne Boll. 2011. 100,000,000 Taps: Analysis and improvement of touch performance in the large. Proceedings of ACM MobileHCI 2011, 133--142.  ",
      "doi": "10.1145/2037373.2037395"
    },
    {
      "text": "James J. Higgins and S Tashtoush. 1994. An aligned rank transform test for interaction. Nonlinear World 1, 2: 201--211.",
      "doi": ""
    },
    {
      "text": "Sture Holm. 1979. A simple sequentially rejective multiple test procedure. Scandinavian Journal of Statistics 6, 2: 65--70.",
      "doi": ""
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2010. The generalized perceived input point model and how to double touch accuracy by extracting fingerprints. Proceedings of ACM CHI 2010, 581--590.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2011. Understanding touch. Proceedings of ACM CHI 2011, 2501--2510.  ",
      "doi": "10.1145/1978942.1979308"
    },
    {
      "text": "Curt B. Irwin and Mary E. Sesto. 2012. Performance and touch characteristics of disabled and non-disabled participants during a reciprocal tapping task using touch screen technology. Applied Ergonomics 43, 6: 1038--1043.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Chandrika Jayant, Jacob O. Wobbrock, and Richard E. Ladner. 2009. Freedom to roam: A study of mobile device adoption and accessibility for people with visual and motor disabilities. Proceedings of ACM ASSETS 2009, 115--122.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Ian E. Smith. 2008. Getting off the treadmill: Evaluating walking user interfaces for mobile devices in public spaces. Proceedings of ACM MobileHCI 2008, 109--118.  ",
      "doi": "10.1145/1409240.1409253"
    },
    {
      "text": "Min Lin, Rich Goldman, Kathleen J. Price, Andrew Sears, and Julie Jacko. 2007. How do people tap when walking? An empirical investigation of nomadic data entry. International Journal of Human-Computer Studies 65, 9: 759--769.  ",
      "doi": "10.1016/j.ijhcs.2007.04.001"
    },
    {
      "text": "R. C. Littell, P. R. Henry, and C. B. Ammerman. 1998. Statistical analysis of repeated measures data using SAS procedures. Journal of Animal Science 76, 4: 1216--1231.",
      "doi": ""
    },
    {
      "text": "Tom M. Mitchell. 1997. Machine Learning. McGraw-Hill Education, New York. ",
      "doi": "10.5555/541177"
    },
    {
      "text": "Karyn Moffatt and Joanna McGrenere. 2010. Steadied-bubbles: Combining techniques to address pen-based pointing errors for younger and older adults. Proceedings of ACM CHI 2010, 1125-- 1134.  ",
      "doi": "10.1145/1753326.1753495"
    },
    {
      "text": "Kyle Montague, Vicki L. Hanson, and Andy Cobley. 2012. Designing for individuals: Usable touch-screen interaction through shared user models. Proceedings of ACM ASSETS 2012, 151--158.  ",
      "doi": "10.1145/2384916.2384943"
    },
    {
      "text": "Kyle Montague, Hugo Nicolau, and Vicki L. Hanson. 2014. Motorimpaired touchscreen interactions in the wild. Proceedings of ACM ASSETS 2014, 123--130.  ",
      "doi": "10.1145/2661334.2661362"
    },
    {
      "text": "Martez E. Mott, Jane E., Cynthia L. Bennett, Edward Cutrell, and Meredith Ringel Morris. 2018. Understanding the accessibility of smartphone photography for people with motor impairments. Proceedings of ACM CHI 2018, 520:1--520:12.  ",
      "doi": "10.1145/3173574.3174094"
    },
    {
      "text": "Martez E. Mott, Radu-Daniel Vatavu, Shaun K. Kane, and Jacob O. Wobbrock. 2016. Smart Touch: Improving touch accuracy for people with motor Impairments with template matching. Proceedings of ACM CHI 2016, 1934--1946.  ",
      "doi": "10.1145/2858036.2858390"
    },
    {
      "text": "Josip Music, Daryl Weir, Roderick Murray-Smith, and Simon Rogers. 2016. Modelling and correcting for the impact of the gait cycle on touch screen typing accuracy. mUX: The Journal of Mobile User Experience 5, 1: 1--11.",
      "doi": ""
    },
    {
      "text": "Maia Naftali and Leah Findlater. 2014. Accessibility in context: Understanding the truly mobile experience of smartphone users with motor impairments. Proceedings of ACM ASSETS 2014, 209--216.  ",
      "doi": "10.1145/2661334.2661372"
    },
    {
      "text": "Matei Negulescu and Joanna McGrenere. 2015. Grip change as an information side channel for mobile touch interaction. Proceedings of ACM CHI 2015, 1519--1522.  ",
      "doi": "10.1145/2702123.2702185"
    },
    {
      "text": "Alexander Ng. 2014. The effects of encumbrance on mobile interactions. Proceedings of ACM MobileHCI 2014, 405--406.  ",
      "doi": "10.1145/2628363.2634268"
    },
    {
      "text": "K. C. Salter and R. F. Fawcett. 1993. The art test of interaction: a robust and powerful rank test of interaction in factorial models. Communications in Statistics - Simulation and Computation 22, 1: 137--153.",
      "doi": ""
    },
    {
      "text": "Julia Schwarz, Scott Hudson, Jennifer Mankoff, and Andrew D. Wilson. 2010. A framework for robust and flexible handling of inputs with uncertainty. Proceedings of ACM UIST 2010, 47--56.  ",
      "doi": "10.1145/1866029.1866039"
    },
    {
      "text": "Julia Schwarz, Jennifer Mankoff, and Scott Hudson. 2011. Monte Carlo methods for managing interactive state, action and feedback under uncertainty. Proceedings of ACM UIST 2011, 235--244.  ",
      "doi": "10.1145/2047196.2047227"
    },
    {
      "text": "Julia Schwarz, Jennifer Mankoff, and Scott E. Hudson. 2015. An architecture for generating interactive feedback in probabilistic user interfaces. Proceedings of ACM CHI 2015, 2545--2554.  ",
      "doi": "10.1145/2702123.2702228"
    },
    {
      "text": "Andrew Sears, Min Lin, Julie Jacko, and Yan Xiao. 2003. When computers fade... Pervasive computing and situationally-induced impairments and disabilities. Proceedings of HCI International 2003, 1298--1302.",
      "doi": ""
    },
    {
      "text": "Andrew Sears and Mark Young. 2003. Physical disabilities and computing technologies: an analysis of impairments. In Julie A. Jacko and Andrew Sears (eds.). Lawrence Erlbaum, Hillsdale, NJ, 482--503. http://dl.acm.org/citation.cfm?id=772072.772105 ",
      "doi": "10.5555/772072.772105"
    },
    {
      "text": "Shari Trewin, Cal Swart, and Donna Pettick. 2013. Physical accessibility of touchscreen smartphones. Proceedings of ACM ASSETS 2013, 19:1--19:8.  ",
      "doi": "10.1145/2513383.2513446"
    },
    {
      "text": "Daniel Vogel and Patrick Baudisch. 2007. Shift: A technique for operating pen-based interfaces using touch. Proceedings of ACM CHI 2007, 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Chat Wacharamanotham, Jan Hurtmanns, Alexander Mertens, Martin Kronenbuerger, Christopher Schlick, and Jan Borchers. 2011. Evaluating swabbing: A touchscreen input method for elderly users with tremor. Proceedings of ACM CHI 2011, 623--626.  ",
      "doi": "10.1145/1978942.1979031"
    },
    {
      "text": "Daryl Weir. 2012. Machine learning models for uncertain interaction. Adjunct Proceedings of ACM UIST 2012, 31--34.  ",
      "doi": "10.1145/2380296.2380313"
    },
    {
      "text": "Daryl Weir, Simon Rogers, Roderick Murray-Smith, and Markus Löchtefeld. 2012. A user-specific machine learning approach for improving touch accuracy on mobile devices. Proceedings of ACM UIST 2012, 465--476.  ",
      "doi": "10.1145/2380116.2380175"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for nonparametric factorial analyses using only ANOVA procedures. Proceedings of ACM CHI 2011, 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Jacob O. Wobbrock, Krzysztof Z. Gajos, Shaun K. Kane, and Gregg C. Vanderheiden. 2018. Ability-based design. Communications of the ACM 61, 6: 62--71.  ",
      "doi": "10.1145/3148051"
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-based design: Concept, principles and examples. ACM Transactions on Accessible Computing 3, 3: 9:1--9:27.  ",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Jacob O. Wobbrock, Brad A. Myers, and John A. Kembel. 2003. EdgeWrite: A stylus-based text entry method designed for high accuracy and stability of motion. Proceedings of ACM UIST 2003, 61--70.  ",
      "doi": "10.1145/964696.964703"
    }
  ]
}