{
  "doi": "10.1145/3290605.3300723",
  "title": "Managerial Visions: Stories of Upgrading and Maintaining the Public Restroom with IoT",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [
    "Best Paper"
  ],
  "abstract": "This paper examines the entangled development of governance strategies and networked technologies in the pervasive but under-examined domain of public restrooms. Drawing on a mix of archival materials, participant observation, and interviews within and beyond the city of Seattle, Washington, we look at the motivations of public restroom facilities managers as they introduce (or consider introducing) networked technology in the spaces they administer. Over the course of the research, we found internet of things technologies-or, connected devices imbued with computational capacity-became increasingly tied up with cost-reducing efficiencies and exploitative regulatory techniques. Drawing from this case study, we develop the concept of managerial visions: ways of seeing that structure labor, enforce compliance, and define access to resources. We argue that these ways of seeing prove increasingly critical to HCI research as it attends to computer-mediated collaboration beyond white-collar settings.",
  "authors": [
    {
      "name": "Sarah E. Fox",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758668257",
      "orcid": "0000-0002-7888-2598"
    },
    {
      "name": "Kiley Sobel",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557410456",
      "orcid": "missing"
    },
    {
      "name": "Daniela K. Rosner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524398",
      "orcid": "0000-0001-9448-914X"
    }
  ],
  "references": [
    {
      "text": "Morra Aarons-Mele. 2014. Unpredictable Work Hours Are Stress-ing Too Many People Out. Harvard Business Review. Retrieved September 21, 2018 from https://hbr.org/2014/08/unpredictable-work-hours-are-stressing-too-many-people-out",
      "doi": ""
    },
    {
      "text": "Charlotte Alexander and Anna Haley-Lock. 2013. Not Enough Hours in the Day: Work Hour Insecurity and a New Approach to Wage and Hour Regulation. Social Science Research Network, Rochester, NY. Retrieved September 21, 2018 from https://papers.ssrn.com/abstract=2367070",
      "doi": ""
    },
    {
      "text": "Teresa Almeida, Rob Comber, Gavin Wood, Dean Saraf, and Madeline Balaam. 2016. On Looking at the Vagina Through Label-la. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1810--1821.  ",
      "doi": "10.1145/2858036.2858119"
    },
    {
      "text": "Sareeta Amrute. 2016. Encoding Race, Encoding Class: Indian IT Workers in Berlin. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Peter M. Asaro. 2000. Transforming society by transforming tech-nology: the science and politics of participatory design. Accounting, Management and Information Technologies 4, 10: 257--290.",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and An-drew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Ap-plication for Breastfeeding Women. In Proceedings of the 33rd An-nual ACM Conference on Human Factors in Computing Systems (CHI '15), 1709--1718.  ",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Yesterday's Tomorrows: Notes on Ubiquitous Computing's Dominant Vision. Personal Ubiq-uitous Comput. 11, 2: 133--143.  ",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Jeanette Blomberg, Lucy Suchman, and Randall H. Trigg. 1996. Reflections on a Work-Oriented Design Project. Human--Computer Interaction 11, 3: 237--265.  ",
      "doi": "10.1207/s15327051hci1103_3"
    },
    {
      "text": "Chris Bopp, Ellie Harmon, and Amy Voida. 2017. Disempowered by Data: Nonprofits, Social Enterprises, and the Consequences of Da-ta-Driven Work. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 3608--3619.  ",
      "doi": "10.1145/3025453.3025694"
    },
    {
      "text": "Geoffrey C. Bowker and Susan Leigh Star. 2000. Sorting Things Out: Classification and Its Consequences. The MIT Press, Cam-bridge, Massachusetts London, England. ",
      "doi": "10.5555/380681"
    },
    {
      "text": "danah boyd, Karen Levy, and Alice Marwick. 2014. The networked nature of algorithmic discrimination. New America.",
      "doi": ""
    },
    {
      "text": "Irus Braverman. 2010. Governing with Clean Hands: Automated Public Toilets and Sanitary Surveillance. Surveillance & Society 8, 1: 1--27.",
      "doi": ""
    },
    {
      "text": "Charles L. Briggs. 1986. Learning How to Ask: A Sociolinguistic Appraisal of the Role of the Interview in Social Science Research. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory. SAGE.",
      "doi": ""
    },
    {
      "text": "Kate Crawford. 2016. Can an Algorithm be Agonistic? Ten Scenes from Life in Calculated Publics. Science, Technology & Human Val-ues 41(1). Retrieved April 19, 2018 from https://www.microsoft.com/en-us/research/publication/can-an-algorithm-be-agonistic-ten-scenes-from-life-in-calculated-publics/",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo and Tom Jenkins. 2017. Fruit Are Heavy: A Proto-type Public IoT System to Support Urban Foraging. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 541--553.  ",
      "doi": "10.1145/3064663.3064748"
    },
    {
      "text": "Carl DiSalvo, Marti Louw, Julina Coupland, and MaryAnn Steiner. 2009. Local Issues, Local Uses: Tools for Robotics and Sensing in Community Contexts. In Proceedings of the Seventh ACM Confer-ence on Creativity and Cognition (C&C '09), 245--254.  ",
      "doi": "10.1145/1640233.1640271"
    },
    {
      "text": "Lynn Dombrowski, Adriana Alvarado Garcia, and Jessica Despard. 2017. Low-Wage Precarious Workers' Sociotechnical Practices Working Towards Addressing Wage Theft. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 4585--4598.  ",
      "doi": "10.1145/3025453.3025633"
    },
    {
      "text": "Paul Dourish. 2006. Re-space-ing Place: \"Place\" and \"Space\" Ten Years on. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (CSCW '06), 299--308.  ",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Paul Dourish and Genevieve Bell. 2011. Divining a Digital Future: Mess and Mythology in Ubiquitous Computing. The MIT Press. ",
      "doi": "10.5555/2018772"
    },
    {
      "text": "Mignon Duffy. 2007. Doing the Dirty Work: Gender, Race, and Reproductive Labor in Historical Perspective. Gender and Society 21, 3: 313--336.",
      "doi": ""
    },
    {
      "text": "Pelle Ehn. 1990. Work-Oriented Design of Computer Artifacts. L. Erlbaum Associates Inc., Hillsdale, NJ, USA. ",
      "doi": "10.5555/1102017"
    },
    {
      "text": "Pelle Ehn and Morten Kyng. 1987. The Collective Resource Ap-proach to Systems Design. In Computers and Democracy - a Scan-dinavian Challenge, Gro Bjerknes, Pelle Ehn and Morten Kyng (eds.). 17--58. Retrieved January 7, 2019 from https://pure.au.dk/portal/en/persons/morten-kyng(f0486b10-a937--4cd9-aa99--168060eea4fc)/publications/the-collective-resource-approach-to-systems-design(de84d5b0-d1fe-11df-8cb9-000ea68e967b).html",
      "doi": ""
    },
    {
      "text": "Harry Finley. Hartmann's menstrual pad (1890s). The Museum of Menstruation and Women's Health. Retrieved January 7, 2019 from http://www.mum.org/collection.htm",
      "doi": ""
    },
    {
      "text": "Joel E. Fischer, Andy Crabtree, James A. Colley, Tom Rodden, and Enrico Costanza. 2017. Data Work: How Energy Advisors and Cli-ents Make IoT Data Accountable. Computer Supported Coopera-tive Work (CSCW) 26, 4--6: 597--626.  ",
      "doi": "10.1007/s10606-017-9293-x"
    },
    {
      "text": "Sarah E. Fox, Rafael M.L. Silva, and Daniela K. Rosner. 2018. Be-yond the Prototype: Maintenance, Collective Responsibility, and Public IoT. In Proceedings of the 2018 Designing Interactive Sys-tems Conference (DIS '18), 21--32.  ",
      "doi": "10.1145/3196709.3196710"
    },
    {
      "text": "Sarah Elizabeth Fox. 2018. Maintaining the Menstruating Body: Feminist Interventions on Care Resources. University of Washing-ton, Seattle, Washington. Retrieved January 7, 2019 from https://digital.lib.washington.edu:443/researchworks/handle/1773/42879",
      "doi": ""
    },
    {
      "text": "Harold Garfinkel. 1984. Studies in Ethnomethodology. Polity, Cam-bridge, UK.",
      "doi": ""
    },
    {
      "text": "Evelyn Nakano Glenn. 1992. From Servitude to Service Work: His-torical Continuities in the Racial Division of Paid Reproductive La-bor. Signs 18, 1: 1--43.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 1994. Professional Vision. American Anthropolo-gist 96, 3: 606--633.",
      "doi": ""
    },
    {
      "text": "Jaber Gubrium and James Holstein. 1999. At the border of narra-tive and ethnography. Journal of Contemporary Ethnography - J CONTEMP ETHNOGR 28: 561--573.",
      "doi": ""
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-place-ing Space: The Roles of Place and Space in Collaborative Systems. In Proceedings of the 1996 ACM Conference on Computer Supported Cooperative Work (CSCW '96), 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Thomas Heinrich and Bob Batchelor. 2004. Kotex, Kleenex, Hug-gies: Kimberly-Clark and the Consumer Revolution in American Business. Ohio State University Press.",
      "doi": ""
    },
    {
      "text": "Lara Houston and Steven J. Jackson. 2016. Caring for the \"Next Billion\" Mobile Handsets: Opening Proprietary Closures Through the Work of Repair. In Proceedings of the Eighth International Con-ference on Information and Communication Technologies and De-velopment (ICTD '16), 10:1--10:11.  ",
      "doi": "10.1145/2909609.2909658"
    },
    {
      "text": "Lara Houston, Steven J. Jackson, Daniela K. Rosner, Syed Ishtiaque Ahmed, Meg Young, and Laewoo Kang. 2016. Values in Repair. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1403--1414.  ",
      "doi": "10.1145/2858036.2858470"
    },
    {
      "text": "Jackelyn Hwang. 2015. Gentrification in Changing Cities: Immigra-tion, New Diversity, and Racial Inequality in Neighborhood Re-newal. The ANNALS of the American Academy of Political and So-cial Science 660, 1: 319--340.",
      "doi": ""
    },
    {
      "text": "IBM Industries. The Smart Washroom by Kimberly Clark & IBM. Retrieved April 19, 2018 from https://www.youtube.com/watch?v=Sp0Wb63qMAk",
      "doi": ""
    },
    {
      "text": "Lilly Irani. 2015. Hackathons and the Making of Entrepreneurial Citizenship. Science, Technology, & Human Values 40, 5: 799--824.",
      "doi": ""
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2013. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 611--620.  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Steven J. Jackson, Tarleton Gillespie, and Sandy Payette. 2014. The Policy Knot: Re-integrating Policy, Practice and Design in Cscw Studies of Social Computing. In Proceedings of the 17th ACM Con-ference on Computer Supported Cooperative Work & Social Com-puting (CSCW '14), 588--602.  ",
      "doi": "10.1145/2531602.2531674"
    },
    {
      "text": "Steven J. Jackson, Stephanie B. Steinhardt, and Ayse Buyuktur. 2013. Why CSCW Needs Science Policy (and Vice Versa). In Pro-ceedings of the 2013 Conference on Computer Supported Coopera-tive Work (CSCW '13), 1113--1124.  ",
      "doi": "10.1145/2441776.2441902"
    },
    {
      "text": "Sheila Jasanoff. 2016. The Ethics of Invention: Technology and the Human Future. W. W. Norton & Company.",
      "doi": ""
    },
    {
      "text": "Jodi Kantor. 2014. Working Anything but 9 to 5. The New York Times. Retrieved April 19, 2018 from https://www.nytimes.com/interactive/2014/08/13/us/starbucks-workers-scheduling-hours.html, https://www.nytimes.com/interactive/2014/08/13/us/starbucks-workers-scheduling-hours.html",
      "doi": ""
    },
    {
      "text": "Jodi Kantor. 2014. Starbucks to Revise Policies to End Irregular Schedules for Its 130,000 Baristas. The New York Times. Retrieved April 19, 2018 from https://www.nytimes.com/2014/08/15/us/starbucks-to-revise-work-scheduling-policies.html",
      "doi": ""
    },
    {
      "text": "Kimberly-Clark Professional. Eliminate Problems in your Restrooms before they become Complaints. Kimberly-Clark Professional. Re-trieved April 19, 2018 from https://www2.kcprofessional.com/onvation",
      "doi": ""
    },
    {
      "text": "Kristian Helbo Kristiansen, Mathias A. Valeur-Meller, Lynn Dom-browski, and Naja L.. Holten Moller. 2018. Accountability in the Blue-Collar Data-Driven Workplace. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 332:1--332:12.  ",
      "doi": "10.1145/3173574.3173906"
    },
    {
      "text": "Stacey Kuznetsov, George Davis, Jian Cheung, and Eric Paulos. 2011. Ceci N'Est Pas Une Pipe Bombe: Authoring Urban Landscapes with Air Quality Sensors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2375--2384.  ",
      "doi": "10.1145/1978942.1979290"
    },
    {
      "text": "Stacey Kuznetsov, George Noel Davis, Eric Paulos, Mark D. Gross, and Jian Chiu Cheung. 2011. Red Balloon, Green Balloon, Sensors in the Sky. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11), 237--246.  ",
      "doi": "10.1145/2030112.2030145"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Participatory Sensing in Public Spaces: Activating Urban Surfaces with Sensor Probes. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10), 21--30.  ",
      "doi": "10.1145/1858171.1858175"
    },
    {
      "text": "Karen Levy and Solon Barocas. 2018. Refractive Surveillance: Mon-itoring Customers to Manage Workers. International Journal of Communication 12, 0: 23.",
      "doi": ""
    },
    {
      "text": "Karen E. C. Levy. 2015. The Contexts of Control: Information, Pow-er, and Truck-Driving Work. The Information Society 31, 2: 160--174.",
      "doi": "10.5555/2789961.2789966"
    },
    {
      "text": "Silvia Lindtner and Seyram Avle. 2017. Tinkering with Govern-ance: Technopolitics and the Economization of Citizenship. Proc. ACM Hum.-Comput. Interact. 1, CSCW: 70:1--70:18.  ",
      "doi": "10.1145/3134705"
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Re-constituting the Utopian Vision of Making: HCI After Technosolu-tionism. In Proceedings of the 2016 CHI Conference on Human Fac-tors in Computing Systems (CHI '16), 1390--1402.  ",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "Thomas Ludwig, Peter Tolmie, and Volkmar Pipek. 2017. From the Internet of Things to an Internet of Practices.",
      "doi": ""
    },
    {
      "text": "Wesley J. McConnell, John R. Oyler, and James A. Winder. 2002. System and method for collecting data on product consumption.",
      "doi": ""
    },
    {
      "text": "Elaine McCrate. 2005. Flexible Hours, Workplace Authority, and Compensating Wage Differentials in the US. Feminist Economics 11, 1: 11--39.",
      "doi": ""
    },
    {
      "text": "Elaine McCrate. 2018. Unstable and On-Call Work Schedules in the United States and Canada. Retrieved September 21, 2018 from http://www.ilo.org/travail/info/working/WCMS_619044/lang--en/index.htm",
      "doi": ""
    },
    {
      "text": "Maria McNamara, Philip Bohle, and Michael Quinlan. 2011. Precar-ious employment, working hours, work-life conflict and health in hotel work. Applied Ergonomics 42, 2: 225--232.",
      "doi": ""
    },
    {
      "text": "Gina Neff. 2012. Venture Labor: Work and the Burden of Risk in Innovative Industries. MIT Press. ",
      "doi": "10.5555/2789319"
    },
    {
      "text": "Safiya Umoja Noble. 2013. Google Search: Hyper-visibility as a Means of Rendering Black Women and Girls Invisible -- InVisible Culture. InVisible Culture: An Electronic Journal for Visual Culture, 19. Retrieved April 19, 2018 from http://ivc.lib.rochester.edu/google-search-hyper-visibility-as-a-means-of-rendering-black-women-and-girls-invisible/",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of Oppression: How Search Engines Reinforce Racism. NYU Press.",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble and Brendesha M. Tynes. 2016. The Intersec-tional Internet: Race, Sex, Class, and Culture Online. Peter Lang International Academic Publishers, Switzerland. ",
      "doi": "10.5555/3027513"
    },
    {
      "text": "Kathleen H. Pine and Max Liboiron. 2015. The Politics of Measure-ment and Action. In Proceedings of the 33rd Annual ACM Confer-ence on Human Factors in Computing Systems (CHI '15), 3147--3156.  ",
      "doi": "10.1145/2702123.2702298"
    },
    {
      "text": "Noopur Raval and Paul Dourish. 2016. Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing. In Proceedings of the 19th ACM Conference on Com-puter-Supported Cooperative Work & Social Computing (CSCW '16), 97--107.  ",
      "doi": "10.1145/2818048.2820026"
    },
    {
      "text": "Toni Robertson and Ina Wagner. 2015. CSCW and the Internet of Things. In ECSCW 2015: Proceedings of the 14th European Confer-ence on Computer Supported Cooperative Work, 19--23 September 2015, Oslo, Norway. Springer, Cham, 285--294.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner and Morgan Ames. 2014. Designing for Repair?: Infrastructures and Materialities of Breakdown. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), 319--331.  ",
      "doi": "10.1145/2531602.2531692"
    },
    {
      "text": "Nantiya Ruan and Nancy Reichman. 2014. Hours Equity is the New Pay Equity. Villanova Law Review 59, 1: 35.",
      "doi": ""
    },
    {
      "text": "Kjeld Schmidt. 2011. The Concept of 'Work' in CSCW. Computer Supported Cooperative Work (CSCW) 20, 4--5: 341--401.  ",
      "doi": "10.1007/s10606-011-9146-y"
    },
    {
      "text": "Noah Smith. 2018. On-Call Work Schedules Make It Hard to Have a Life. Bloomberg.com. Retrieved September 21, 2018 from https://www.bloomberg.com/view/articles/2018-06--18/on-call-work-schedules-make-it-hard-to-have-a-life",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of Silence, Are-nas of Voice: The Ecology of Visible and Invisible Work. Computer Supported Cooperative Work (CSCW) 8, 1--2: 9--30.  ",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Yolande A.A. Strengers. 2011. Designing Eco-feedback Systems for Everyday Life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2135--2144.  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Lucy Suchman. 1993. Working relations of technology production and use. Computer Supported Cooperative Work 2, 1--2: 21--39.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1995. Making Work Visible. Commun. ACM 38, 9: 56--64.  ",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Nick Taylor, Loraine Clarke, Martin Skelly, and Sara Nevay. 2018. Strategies for Engaging Communities in Creating Physical Civic Technologies. In Proceedings of the 2018 CHI Conference on Hu-man Factors in Computing Systems (CHI '18), 507:1--507:12.  ",
      "doi": "10.1145/3173574.3174081"
    },
    {
      "text": "Marcia Layton Turner. 2016. Is On-Call Scheduling In Retail Com-ing To An End? Forbes. Retrieved September 21, 2018 from https://www.forbes.com/sites/marciaturner/2016/12/31/is-on-call-scheduling-in-retail-coming-to-an-end/",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong and Deirdre K. Mulligan. 2016. When a Product Is Still Fictional: Anticipating and Speculating Futures Through Concept Videos. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 121--133.  ",
      "doi": "10.1145/2901790.2901801"
    },
    {
      "text": "Ceylan Yeginsu. 2018. Amazon holds patents for wristbands that track workers. CNBC. Retrieved April 19, 2018 from https://www.cnbc.com/2018/02/02/amazon-holds-patents-for-wristbands-that-track-workers.html",
      "doi": ""
    },
    {
      "text": "Shoshana Zuboff. 1989. In The Age Of The Smart Machine: The Future Of Work And Power. Basic Books, New York. ",
      "doi": "10.5555/47303"
    },
    {
      "text": "'Fair workweek' laws help more than 1.8 million workers: Laws promote workplace flexibility and protect against unfair scheduling practices. Economic Policy Institute. Retrieved January 7, 2019 from https://www.epi.org/publication/fair-workweek-laws-help-more-than-1--8-million-workers/",
      "doi": ""
    }
  ]
}