{
  "doi": "10.1145/3290605.3300901",
  "title": "Privacy, Anonymity, and Perceived Risk in Open Collaboration: A Study of Service Providers",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Anonymity can enable both healthy online interactions like support-seeking and toxic behaviors like hate speech. How do online service providers balance these threats and opportunities? This two-part qualitative study examines the challenges perceived by open collaboration service providers in allowing anonymous contributions to their projects. We interviewed eleven people familiar with organizational decisions related to privacy and security at five open collaboration projects and followed up with an analysis of public discussions about anonymous contribution to Wikipedia. We contrast our findings with prior work on threats perceived by project volunteers and explore misalignment between policies aiming to serve contributors and the privacy practices of contributors themselves.",
  "authors": [
    {
      "name": "Nora McDonald",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548028462",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Mako Hill",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81539037856/rel-imgonly/mako_commlead_2014-280px.png",
      "acmid": "81539037856",
      "orcid": "missing"
    },
    {
      "name": "Rachel Greenstadt",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340489296",
      "orcid": "missing"
    },
    {
      "name": "Andrea Forte",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/do/10.1145/contrib-81100401804/rel-imgonly/forte150x150.jpg",
      "acmid": "81100401804",
      "orcid": "0000-0002-2941-339X"
    }
  ],
  "references": [
    {
      "text": "Irwin Altman. 1975. The Environment and Social Behavior: Privacy, Personal Space, Territory, Crowding (Clean & Tight Contents edition ed.). Brooks/Cole, Monterey, California.",
      "doi": ""
    },
    {
      "text": "Irwin Altman. 1977. Privacy Regulation: Culturally Universal or Culturally Specifc? Journal of Social Issues 33, 3 (1977), 66--84.",
      "doi": ""
    },
    {
      "text": "Herbert Blumer. 1954. What is wrong with social theory. American Sociological Review 19, 1 (1954), 3--10.",
      "doi": ""
    },
    {
      "text": "Anne Bowser, Katie Shilton, Jenny Preece, and Elizabeth Warrick. 2017. Accounting for Privacy in Citizen Science: Ethical Research in a Context of Openness. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 2124--2136.  ",
      "doi": "10.1145/2998181.2998305"
    },
    {
      "text": "Susan L. Bryant, Andrea Forte, and Amy Bruckman. 2005. Becoming Wikipedian: transformation of participation in a collaborative online encyclopedia. In Proceedings of the 2005 ACM International Conference on Supporting Groupwork (Group) (GROUP '05). ACM, New York, NY, USA, 1--10.  ",
      "doi": "10.1145/1099203.1099205"
    },
    {
      "text": "Nicholas Diakopoulos and Mor Naaman. 2011. Towards Quality Discourse in Online News Comments. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, New York, New York, 133--142.  ",
      "doi": "10.1145/1958824.1958844"
    },
    {
      "text": "Roger Dingledine, Nick Mathewson, and Paul Syverson. 2004. Tor: The Second-generation Onion Router. In Proceedings of the 13th Conference on USENIX Security Symposium - Volume 13 (SSYM '04). USENIX Association, Berkeley, CA, USA, 21--21. http://dl.acm.org/citation.cfm?id= 1251375.1251396 ",
      "doi": "10.5555/1251375.1251396"
    },
    {
      "text": "Judith S. Donath. 1998. Identity and deception in the virtual community (Peter Kollock and Marc Smith (eds.) ed.). Routledge, London, UK, 29--59. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK",
      "doi": ""
    },
    {
      "text": "Peter Eckersley. 2010. How Unique Is Your Web Browser?. In Privacy Enhancing Technologies (Lecture Notes in Computer Science). Springer, Berlin, Germany, 1--18. ",
      "doi": "10.5555/1881151.1881152"
    },
    {
      "text": "Heather Ford and Judy Wajcman. 2017. 'Anyone can edit', not everyone does: Wikipedia's infrastructure and the gender gap. Social Studies of Science 47, 4 (Aug 2017), 511--527.",
      "doi": ""
    },
    {
      "text": "Andrea Forte, Nazanin Andalibi, and Rachel Greenstadt. 2017. Privacy, Anonymity, and Perceived Risk in Open Collaboration: A Study of Tor Users and Wikipedians. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1800--1811.  ",
      "doi": "10.1145/2998181.2998273"
    },
    {
      "text": "Andrea Forte and Clif Lampe. 2013. Defning, Understanding, and Supporting Open Collaboration: Lessons From the Literature. American Behavioral Scientist 57, 5 (May 2013), 535--547.",
      "doi": ""
    },
    {
      "text": "Gerald Friedland and Robin Sommer. 2010. Cybercasing the Joint: On the Privacy Implications of Geo-tagging. In Proceedings of the 5th USENIX Conference on Hot Topics in Security (HotSec '10). USENIX Association, Berkeley, CA, USA, 1--8. ",
      "doi": "10.5555/1924931.1924933"
    },
    {
      "text": "James Paul Gee. 2000. Identity as an Analytic Lens for Research in Education. Review of Research in Education 25 (2000), 99--125.",
      "doi": ""
    },
    {
      "text": "Barney Glaser and Anselm Strauss. 1967. The Discovery of Grounded Theory: Strategies for Qualitative Research. Aldine Transaction, New Brunswick, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Erving Gofman. 1959. The Presentation of Self in Everyday Life. Doubleday Anchor, Garden City, NY, USA.",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, R Stuart Geiger, Jonathan T Morgan, and John Riedl. 2013. The rise and decline of an open collaboration system: How Wikipedia's reaction to popularity is causing its decline. American Behavioral Scientist 57, 5 (2013), 664--688.",
      "doi": ""
    },
    {
      "text": "R. Henry and I. Goldberg. 2011. Formalizing Anonymous Blacklisting Systems. In 2011 IEEE Symposium on Security and Privacy. IEEE, New York, NY, USA, 81--95.  ",
      "doi": "10.1109/SP.2011.13"
    },
    {
      "text": "Daniel C. Howe and Helen Nissenbaum. 2009. TrackMeNot: Resisting surveillance in web search (ian kerr, carole lucock, and valier m. steeves ed.). Oxford, New York, NY, USA, 417--436.",
      "doi": ""
    },
    {
      "text": "Corey Brian Jackson, Kevin Crowston, and Carsten Østerlund. 2018. Did they login?: Patterns of anonymous contributions in online communities. Proc. ACM Hum.-Comput. Interact. 2 (Nov. 2018), 77:1--77:16.  ",
      "doi": "10.1145/3274346"
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, and Sara Kiesler. 2013. Why Do People Seek Anonymity on the Internet?: Informing Policy and Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2657--2666.  ",
      "doi": "10.1145/2470654.2481368"
    },
    {
      "text": "Clif Lampe and Paul Resnick. 2004. Slash(Dot) and Burn: Distributed Moderation in a Large Online Conversation Space. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 543--550.  ",
      "doi": "10.1145/985692.985761"
    },
    {
      "text": "Robert S. Laufer and Maxine Wolfe. 1977. Privacy as a Concept and a Social Issue: A Multidimensional Developmental Theory. Journal of Social Issues 33, 3 (Jul 1977), 22--42.",
      "doi": ""
    },
    {
      "text": "Xiao Ma, Jef Hancock, and Mor Naaman. 2016. Anonymity, Intimacy and Self-Disclosure in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3857--3869. N. McDonald et al.  ",
      "doi": "10.1145/2858036.2858414"
    },
    {
      "text": "Gary T. Marx. 1999. What's in a Name? Some Refections on the Sociology of Anonymity. The Information Society 15, 2 (1999), 99--112.",
      "doi": ""
    },
    {
      "text": "Amanda Menking and Ingrid Erickson. 2015. The Heart Work of Wikipedia: Gendered, Emotional Labor in the World's Largest Online Encyclopedia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 207--210.  ",
      "doi": "10.1145/2702123.2702514"
    },
    {
      "text": "Suvda Myagmar, Adam J. Lee, and William Yurcik. 2005. Threat modeling as a basis for security requirements. In StorageSS '05: Proceedings of the 2005 ACM workshop on Storage security and survivability. ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Dawn Nafus. 2012. 'Patches don't have gender': What is not open in open source software. New Media & Society 14, 4 (Jun 2012), 669--683.",
      "doi": ""
    },
    {
      "text": "Arvind Narayanan and Vitaly Shmatikov. 2009. De-anonymizing Social Networks. In Proceedings of the 2009 30th IEEE Symposium on Security and Privacy (SP '09). IEEE Computer Society, Washington, DC, USA, 173--187.  ",
      "doi": "10.1109/SP.2009.22"
    },
    {
      "text": "Helen Nissenbaum. 2010. Privacy in context: technology, policy, and the integrity of social life. Stanford Law Books, Stanford, Calif. ",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Michael Patton. 2001. Qualitative Research & Evaluation Methods (3rd edition ed.). SAGE Publications, Inc, Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Tom Postmes, Russel Spears, and Martin Lea. 1998. Breaching or Building Social Boundaries?: SIDE-Efects of Computer-Mediated Communication. Communication Research 25, 6 (Dec 1998), 689--715.",
      "doi": ""
    },
    {
      "text": "Lee Rainie, Sara Kiesler, Ruogu Kang, and Mary Madden. 2013. Anonymity, Privacy, and Security Online. Pew Research Center, Washington, DC, USA. http://www.pewinternet.org/2013/09/05/ anonymity-privacy-and-security-online/",
      "doi": ""
    },
    {
      "text": "Rebecca Rogers, Elizabeth Malancharuvil-Berkes, Melissa Mosley, Diane Hui, and Glynis O'Garro Joseph. 2005. Critical Discourse Analysis in Education: A Review of the Literature. Review of Educational Research 75, 3 (2005), 365--416.",
      "doi": ""
    },
    {
      "text": "Sarita Yardi Schoenebeck. 2013. The Secret Life of Online Moms: Anonymity and Disinhibition on Youbemom.Com. In Proceedings of the 7th International Conference on Weblogs and Social Media, ICWSM 2013 (ICWSM '13). AAAI, Palo Alto, CA, USA, 555--562. https://www. aaai.org/ocs/index.php/ICWSM/ICWSM13/paper/view/5973",
      "doi": ""
    },
    {
      "text": "Alfred Schutz. 1967. The Phenomenology of the Social World. Northwestern University Press, Evanston, IL, USA.",
      "doi": ""
    },
    {
      "text": "Daniel J. Solove. 2006. A Taxonomy of Privacy. University of Pennsylvania Law Review 154, 3 (2006), 477--564.",
      "doi": ""
    },
    {
      "text": "John Suler. 2004. The online disinhibition efect. Cyberpsychology & Behavior: The Impact of the Internet, Multimedia and Virtual Reality on Behavior and Society 7, 3 (Jun 2004), 321--326.",
      "doi": ""
    },
    {
      "text": "John R. Suler and Wende L. Phillips. 1998. The Bad Boys of Cyberspace: Deviant Behavior in a Multimedia Chat Community. CyberPsychology & Behavior 1, 3 (Jan 1998), 275--294.",
      "doi": ""
    },
    {
      "text": "P. P. Tsang, A. Kapadia, C. Cornelius, and S. W. Smith. 2011. Nymble: Blocking Misbehaving Users in Anonymizing Networks. IEEE Transactions on Dependable and Secure Computing 8, 2 (Mar 2011), 256--269.  ",
      "doi": "10.1109/TDSC.2009.38"
    },
    {
      "text": "Samuel D Warren and Louis D Brandeis. 1890. The Right to Privacy. Harvard Law Review 4, 5 (15 Dec 1890), 193--220.",
      "doi": ""
    },
    {
      "text": "Alan F. Westin. 2003. Social and Political Dimensions of Privacy. Journal of Social Issues 59, 2 (Jul 2003), 431--453.",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, A.K.M. Najmul Islam, Bart P. Knijnenburg, and Sameer Patil. 2015. Give Social Network Users the Privacy They Want. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 1427--1441.  ",
      "doi": "10.1145/2675133.2675256"
    }
  ]
}