{
  "doi": "10.1145/3290605.3300708",
  "title": "Only one item left?: Heuristic Information Trumps Calorie Count When Supporting Healthy Snacking Under Low Self-Control",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2019,
  "badges": [],
  "abstract": "Pursuing the goal of a healthy diet may be challenging, especially when self-control resources are low. Yet many persuasive user interfaces fostering healthy choices are designed for situations with ample self-control, e.g. showing nutritional information to support reflective decision making. In this paper we propose that under low self-control, persuasive user interfaces need to rely on simple heuristic decision making to be successful. We report an experiment that tested this assumption in a 2 (low vs. high self-control) x 2 (calorie vs. heuristic information) design. The results reveal a significant interaction effect. Participants with low self-control resources chose the healthy snack more often when snacks were labelled with heuristic information than when they were labelled with calorie information. Both strategies were about equally successful for participants with high self-control. Exploiting situations of low self-control with heuristic information is a new and promising approach to designing persuasive technology for healthy eating.",
  "tags": [
    "food choice",
    "ego depletion",
    "self-control",
    "persuasive technology",
    "heuristics"
  ],
  "authors": [
    {
      "name": "Daniel Reinhardt",
      "institution": "Julius-Maximilians-Universität, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659123209",
      "orcid": "missing"
    },
    {
      "name": "Jörn Hurtienne",
      "institution": "Julius-Maximilians-Universität, Würzburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580284",
      "orcid": "0000-0001-5295-9772"
    }
  ],
  "references": [
    {
      "text": "John A. Bargh. 2002. Losing consciousness: Automatic influences on consumer judgment, behavior, and motivation. Journal of consumer research 29, 2 (2002), 280--285.",
      "doi": ""
    },
    {
      "text": "Roy F. Baumeister, Ellen Bratslavsky, and Mark Muraven. 2018. Ego depletion: Is the active self a limited resource? In Self-Regulation and Self-Control. Routledge, 24--52.",
      "doi": ""
    },
    {
      "text": "Roy F. Baumeister and Todd F. Heatherton. 1996. Self-regulation failure: An overview. Psychological inquiry 7, 1 (1996), 1--15.",
      "doi": ""
    },
    {
      "text": "Roy F Baumeister, Kathleen D Vohs, and Dianne M Tice. 2007. The strength model of self-control. Current directions in psychological science 16, 6 (2007), 351--355.",
      "doi": ""
    },
    {
      "text": "Johannes Brug, Stef P Kremers, Frank Van Lenthe, Kylie Ball, and David Crawford. 2008. Environmental determinants of healthy eating: in need of theory and evidence: Symposium on Behavioural nutrition and energy balance in the young. Proceedings of the Nutrition Society 67, 3 (2008), 307--316.",
      "doi": ""
    },
    {
      "text": "Sabrina Bruyneel, Siegfried Dewitte, Kathleen D. Vohs, and Luk Warlop. 2006. Repeated choosing increases susceptibility to affective product features. International Journal of Research in Marketing 23, 2 (2006), 215--225.",
      "doi": ""
    },
    {
      "text": "Shelly Chaiken. 1980. Heuristic versus systematic information processing and the use of source versus message cues in persuasion. Journal of personality and social psychology 39, 5 (1980), 752.",
      "doi": ""
    },
    {
      "text": "Shelly Chaiken and Yaacov Trope. 1999. Dual-process theories in social psychology. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Pei-yu Chi, Jen-hao Chen, Hao-hua Chu, and Bing-Yu Chen. 2007. Enabling nutrition-aware cooking in a smart kitchen. Conference on Human Factors in Computing Systems: CHI'07 extended abstracts on Human factors in computing systems 28, 2333--2338.  ",
      "doi": "10.1145/1240866.1241003"
    },
    {
      "text": "Robert B. Cialdini. 2009. Influence: Science and practice. Vol. 4. Pearson education Boston, MA.",
      "doi": ""
    },
    {
      "text": "Robert B. Cialdini and Noah J. Goldstein. 2004. Social influence: Compliance and conformity. Annu. Rev. Psychol. 55 (2004), 591--621.",
      "doi": ""
    },
    {
      "text": "The Nielsen Company. 2014. Snack Attack: What Consumers Are Reaching For Around the World. (2014). http://www.nielsen.com/us/en/insights/reports/2014/snack-attack-what-consumers-are-reaching-for-around-the-world.html.",
      "doi": ""
    },
    {
      "text": "Tegan Cruwys, Kirsten E Bevelander, and Roel CJ Hermans. 2015. Social modeling of eating: A review of when and why social influence affects food intake and choice. Appetite 86 (2015), 3--18.",
      "doi": ""
    },
    {
      "text": "Jonathan St BT Evans and Keith E Stanovich. 2013. Dual-process theories of higher cognition: Advancing the debate. Perspectives on psychological science 8, 3 (2013), 223--241.",
      "doi": ""
    },
    {
      "text": "Bob M Fennis, Loes Janssen, and Kathleen D Vohs. 2008. Acts of benevolence: A limited-resource account of compliance with charitable requests. Journal of Consumer Research 35, 6 (2008), 906--924.",
      "doi": ""
    },
    {
      "text": "Eric A Finkelstein, Benjamin A Haaland, Marcel Bilger, Aarti Sahasranaman, Robert A Sloan, Ei Ei Khaing Nang, and Kelly R Evenson. 2016. Effectiveness of activity trackers with and without incentives to increase physical activity (TRIPPA): a randomised controlled trial. The lancet Diabetes & endocrinology 4, 12 (2016), 983--995.",
      "doi": ""
    },
    {
      "text": "Ayelet Fishbach and Benjamin A. Converse. 2010. Identifying and battling temptation. Handbook of self-regulation: Research, theory and applications 2 (2010), 244--260.",
      "doi": ""
    },
    {
      "text": "Ayelet Fishbach and Benjamin A. Converse. 2010. Walking the line between goals and temptations: Asymmetric effects of counteractive control. Self control in society, mind, and brain (2010), 389--407.",
      "doi": ""
    },
    {
      "text": "Ayelet Fishbach, Ronald S. Friedman, and Arie W. Kruglanski. 2003. Leading us not into temptation: Momentary allurements elicit overriding goal activation. Journal of personality and social psychology 84, 2 (2003), 296.",
      "doi": ""
    },
    {
      "text": "Brian J. Fogg. 2002. Persuasive technology: using computers to change what we think and do. Ubiquity 2002, December (2002), 5.  ",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Brian J. Fogg and Jason Hreha. 2010. Behavior wizard: a method for matching target behaviors with solutions. International Conference on Persuasive Technology, 117--131.  ",
      "doi": "10.1007/978-3-642-13226-1_13"
    },
    {
      "text": "Malte Friese, David D Loschelder, Karolin Gieseler, Julius Frankenbach, and Michael Inzlicht. 2018. Is ego depletion real? An analysis of arguments. Personality and Social Psychology Review (2018).",
      "doi": ""
    },
    {
      "text": "Bertram Gawronski and Laura A Creighton. 2013. Dual-process theories. The Oxford handbook of social cognition (2013), 282--312.",
      "doi": ""
    },
    {
      "text": "Laura Girz, Janet Polivy, C. Peter Herman, and Helen Lee. 2012. The effects of calorie information on food selection and intake. International Journal of Obesity 36, 10 (2012), 1340.",
      "doi": ""
    },
    {
      "text": "Martin S Hagger, Nikos LD Chatzisarantis, Hugo Alberts, Calvin O Anggono, Cedric Batailler, Angela R Birt, Ralf Brand, Mark J Brandt, Gene Brewer, Sabrina Bruyneel, et al. 2016. A multilab preregistered replication of the ego-depletion effect. Perspectives on Psychological Science 11, 4 (2016), 546--573.",
      "doi": ""
    },
    {
      "text": "Martin S. Hagger, Chantelle Wood, Chris Stiff, and Nikos LD Chatzisarantis. 2010. Ego depletion and the strength model of self-control: a meta-analysis. Psychological bulletin 136, 4 (2010), 495.",
      "doi": ""
    },
    {
      "text": "C. Peter Herman and Janet Polivy. 2004. The self-regulation of eating: Theoretical and practical problems. (2004).",
      "doi": ""
    },
    {
      "text": "Wilhelm Hofmann, Malte Friese, and Fritz Strack. 2009. Impulse and self-control from a dual-systems perspective. Perspectives on Psychological Science 4, 2 (2009), 162--176.",
      "doi": ""
    },
    {
      "text": "Jinghui Hou. 2017. Can Interface Cues Nudge Modeling of Food Consumption? Experiments on a Food-Ordering Website. Journal of Computer-Mediated Communication 22, 4 (2017), 196--214.",
      "doi": ""
    },
    {
      "text": "Stephen S. Intille, Charles Kukla, Ramesh Farzanfar, and Waseem Bakr. 2003. Just-in-time technology to encourage incremental, dietary behavior change. AMIA Annual Symposium Proceedings 2003, 874.",
      "doi": ""
    },
    {
      "text": "John M Jakicic, Kelliann K Davis, Renee J Rogers, Wendy C King, Marsha D Marcus, Diane Helsel, Amy D Rickman, Abdus S Wahed, and Steven H Belle. 2016. Effect of wearable technology combined with a lifestyle intervention on long-term weight loss: the IDEA randomized clinical trial. Jama 316, 11 (2016), 1161--1171.",
      "doi": ""
    },
    {
      "text": "Loes Janssen and Bob M Fennis. 2017. Mindless resistance to persuasion: Low self-control fosters the use of resistance-promoting heuristics. Journal of Consumer Behaviour 16, 6 (2017), 536--549.",
      "doi": ""
    },
    {
      "text": "Loes Janssen, Bob M Fennis, Ad Th H Pruyn, and Kathleen D Vohs. 2008. The path of least resistance: Regulatory resource depletion and the effectiveness of social influence techniques. Journal of Business Research 61, 10 (2008), 1041--1045.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman and Patrick Egan. 2011. Thinking, fast and slow. Vol. 1. Farrar, Straus and Giroux New York.",
      "doi": ""
    },
    {
      "text": "Flavius Kehr, Marc Hassenzahl, Matthias Laschke, and Sarah Diefenbach. 2012. A transformational product to improve self-control strength: the chocolate machine. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 689--694.  ",
      "doi": "10.1145/2207676.2207774"
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler, and Jodi Forlizzi. 2011. Mining behavioral economics to design persuasive technology for healthy choices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 325--334.  ",
      "doi": "10.1145/1978942.1978989"
    },
    {
      "text": "Dan Lockton, David Harrison, and Neville A. Stanton. 2010. The Design with Intent Method: A design tool for influencing user behaviour. Applied ergonomics 41, 3 (2010), 382--392.",
      "doi": ""
    },
    {
      "text": "John H Lurquin, Laura E Michaelson, Jane E Barker, Daniel E Gustavson, Claudia C Von Bastian, Nicholas P Carruth, and Akira Miyake. 2016. No evidence of the ego-depletion effect across task characteristics and individual differences: A pre-registered study. PloS one 11, 2 (2016), e0147770.",
      "doi": ""
    },
    {
      "text": "John H Lurquin and Akira Miyake. 2017. Challenges to ego-depletion research go beyond the replication crisis: a need for tackling the conceptual crisis. Frontiers in Psychology 8 (2017), 568.",
      "doi": ""
    },
    {
      "text": "Susan Michie, Charles Abraham, Craig Whittington, John McAteer, and Sunjai Gupta. 2009. Effective techniques in healthy eating and physical activity interventions: a meta-regression. Health Psychology 28, 6 (2009), 690.",
      "doi": ""
    },
    {
      "text": "Harri Oinas-Kukkonen and Marja Harjumaa. 2008. A systematic framework for designing and evaluating persuasive systems. International conference on persuasive technology, 164--176.  ",
      "doi": "10.1007/978-3-540-68504-3_15"
    },
    {
      "text": "Sherry Pagoto, Kristin Schneider, Mirjana Jojic, Michele DeBiasse, and Devin Mann. 2013. Evidence-based strategies in weight-loss mobile apps. American journal of preventive medicine 45, 5 (2013), 576--582.",
      "doi": ""
    },
    {
      "text": "Mitesh S Patel, David A Asch, and Kevin G Volpp. 2015. Wearable devices as facilitators, not drivers, of health behavior change. Jama 313, 5 (2015), 459--460.",
      "doi": ""
    },
    {
      "text": "Richard E. Petty and John T. Cacioppo. 1986. The elaboration likelihood model of persuasion. In Communication and persuasion. Springer, 1-- 24.",
      "doi": ""
    },
    {
      "text": "Daniel Reinhardt and Jörn Hurtienne. 2018. Cursor Entropy Reveals Decision Fatigue. Proceedings of the 23rd International Conference on Intelligent User Interfaces Companion, 31.  ",
      "doi": "10.1145/3180308.3180340"
    },
    {
      "text": "Stefanie J. Salmon, Emely De Vet, Marieke A. Adriaanse, Bob M. Fennis, Martijn Veltkamp, and Denise TD De Ridder. 2015. Social proof in the supermarket: Promoting healthy choices under low self-control conditions. Food Quality and Preference 45 (2015), 113--120.",
      "doi": ""
    },
    {
      "text": "Stefanie J. Salmon, Bob M. Fennis, Denise TD de Ridder, Marieke A. Adriaanse, and Emely De Vet. 2014. Health on impulse: When low self-control promotes healthy food choices. Health Psychology 33, 2 (2014), 103.",
      "doi": ""
    },
    {
      "text": "Brandon J. Schmeichel and Kathleen D. Vohs. 2018. Intellectual performance and ego depletion: Role of the self in logical reasoning and other information processing. In Self-Regulation and Self-Control. Routledge, 318--347.",
      "doi": ""
    },
    {
      "text": "Carsten Schmitz. 2015. Limesurvey: an open source survey tool. (2015). https: //www.limesurvey.org.",
      "doi": ""
    },
    {
      "text": "Danielle E. Schoffman, Gabrielle Turner-McGrievy, Sonya J. Jones, and Sara Wilcox. 2013. Mobile apps for pediatric obesity prevention and treatment, healthy eating, and physical activity promotion: just fun and games? Translational behavioral medicine 3, 3 (2013), 320--325.",
      "doi": ""
    },
    {
      "text": "Jeremy Stanley. 2017. 3 Million Instacart Orders, Open Sourced. (2017). https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2.",
      "doi": ""
    },
    {
      "text": "Richard H. Thaler and Cass R. Sunstein. 2003. Libertarian paternalism. American economic review 93, 2 (2003), 175--179.",
      "doi": ""
    },
    {
      "text": "Laura N. van der Laan, Denise TD de Ridder, Lisette Charbonnier, Max A. Viergever, and Paul AM Smeets. 2014. Sweet lies: neural, visual, and behavioral measures reveal a lack of self-control conflict during food choice in weight-concerned women. Frontiers in behavioral neuroscience 8 (2014), 184.",
      "doi": ""
    },
    {
      "text": "Kathleen D. Vohs and Todd F. Heatherton. 2000. Self-regulatory failure: A resource-depletion approach. Psychological science 11, 3 (2000), 249-- 254.",
      "doi": ""
    },
    {
      "text": "Jing Wang, Nathan Novemsky, Ravi Dhar, and Roy F. Baumeister. 2010. Trade-offs and depletion in choice. Journal of Marketing Research 47, 5 (2010), 910--919.",
      "doi": ""
    },
    {
      "text": "Brian Wansink and Jeffery Sobal. 2007. Mindless eating: The 200 daily food decisions we overlook. Environment and Behavior 39, 1 (2007), 106--123.",
      "doi": ""
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: the PANAS scales. Journal of personality and social psychology 54, 6 (1988), 1063.",
      "doi": ""
    },
    {
      "text": "Isaac Wiafe and Keiichi Nakata. 2012. Bibliographic Analysis of Persuasive Systems: Techniques; Methods and Domains of Application. Persuasive Technology: Design for Health and Safety; The 7th International Conference on Persuasive Technology; PERSUASIVE 2012; Linköping; Sweden; June 6--8; Adjunct Proceedings, 61--64.",
      "doi": ""
    }
  ]
}