{
  "doi": "10.1145/3290605.3300921",
  "title": "Virtual Objects in the Physical World: Relatedness and Psychological Ownership in Augmented Reality",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "As technology advances, people increasingly interact with virtual objects in settings such as augmented reality (AR) where the virtual layer is superimposed on top of the physical world. Similarly to interactions with physical objects, users may assign virtual objects with value, experience a sense of relatedness, and develop psychological ownership over these objects. The objective of this study is to understand how AR's unique characteristics influences the emergence of meaning and ownership perceptions amongst users. We conducted a study of users' interactions with a virtual dog over a three-week period, comparing AR and fully virtual settings. Our findings show that engagement with the application is a key determinant of the relation users develop with virtual objects. However, the effect of the background layer-whether physical or virtual-dominates the development of relatedness and ownership feelings, highlighting the importance of the \"real\" physical layer in shaping users' perceptions.",
  "tags": [
    "material culture",
    "relatedness",
    "virtual possessions",
    "qualitative analysis",
    "augmented reality",
    "ownership"
  ],
  "authors": [
    {
      "name": "Lev Poretski",
      "institution": "University of Haifa, Haifa, North, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131347",
      "orcid": "missing"
    },
    {
      "name": "Ofer Arazy",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/do/10.1145/contrib-81440606188/rel-imgonly/81440606188.jpg",
      "acmid": "81440606188",
      "orcid": "missing"
    },
    {
      "name": "Joel Lanir",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350574181",
      "orcid": "missing"
    },
    {
      "name": "Shalev Shahar",
      "institution": "University of Haifa, Haifa Israel, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365199",
      "orcid": "missing"
    },
    {
      "name": "Oded Nov",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339520089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Judith Adler, Mihaly Csikszentmihalyi, and Eugene Rochberg-Halton. (1983). The Meaning of Things: Domestic Symbols and the Self. Contemporary Sociology 12, 4 (1983).",
      "doi": ""
    },
    {
      "text": "Urs-Vito Albrecht, Kristian Folta-Schoofs, Marianne Behrends, and Ute von Jan. (2013). Effects of mobile augmented reality learning compared to textbook learning on medical students: randomized controlled pilot study. Journal of medical Internet research 15, 8 (2013), e182.",
      "doi": ""
    },
    {
      "text": "Ofer Arazy, Oded Nov, Raymond Patterson, and Lisa Yeo. (2011). Information Quality in Wikipedia: The Effects of Group Composition and Task Conflict. Journal of Management Information Systems 27, 4 (2011), 71--98.  ",
      "doi": "10.2753/MIS0742-1222270403"
    },
    {
      "text": "James B. Avey, Bruce J. Avolio, Craig D. Crossley, and Fred Luthans. (2009). Psychological ownership: Theoretical extensions, measurement and relation to work outcomes. Journal of Organizational Behavior 30, 2 (2009), 173--191.",
      "doi": ""
    },
    {
      "text": "Ronald T Azuma. (1997). A Survey of Augmented Reality. Presence: Teleoperators and virtual environments 6, 4 (1997), 355--385.  ",
      "doi": "10.1162/pres.1997.6.4.355"
    },
    {
      "text": "A Dwayne Ball and Lori H Tasaki. (1992). The role and measurement of attachment in consumer behavior. J. Consum. Psychol. 1, 2 (1992), 155-- 172.",
      "doi": ""
    },
    {
      "text": "Henri Barki, Guy Paré, and Claude Sicotte. (2008). Linking IT implementation and acceptance via the construct of psychological ownership of information technology. Journal of Information Technology 23, 4 (2008), 269--280.",
      "doi": ""
    },
    {
      "text": "Russell Belk. (1988). Possessions and the Extended Self. J. Consum. Res. 15, 2 (1988), 139--168.",
      "doi": ""
    },
    {
      "text": "Russell W. Belk, Melanie Wallendorf, and John F. Sherry, Jr. (1989). The Sacred and the Profane in Consumer Behavior: Theodicy on the Odyssey. Journal of Consumer Research 16, 1 (1989), 1.",
      "doi": ""
    },
    {
      "text": "Michael B Beverland and Francis J Farrelly. (2018). The Quest for Authenticity in Consumption?: Consumers ' Purposive Choice of Authentic Cues to Shape Experienced Outcomes. 36, February 2010 (2018).",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. (2006). Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77--101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Roderick J. Brodie, Ana Ilic, Biljana Juric, and Linda Hollebeek. (2013). Consumer engagement in a virtual brand community: An exploratory analysis. Journal of Business Research 66, 1 (2013), 105--114.",
      "doi": ""
    },
    {
      "text": "Ilona Buchem. (2012). Psychological Ownership and Personal Learning Environments: Do sense of ownership and control really matter? PLE Conference (2012), 21.",
      "doi": ""
    },
    {
      "text": "Karen Church and Rodrigo de Oliveira. (2013). What's up with whatsapp?: comparing mobile instant messaging behaviors with traditional SMS. 15th international conference on Human-computer interaction with mobile devices and services (MobileHCI'13) (2013), 352-- 361.  ",
      "doi": "10.1145/2493190.2493225"
    },
    {
      "text": "Mihaly Csikszentmihalyi and Eugene Halton. (1981). The meaning of things: Domestic symbols and the self. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Edward Deci and Richard M Ryan. (1985). Intrinsic motivation and selfdetermination in human behavior. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Chris Dede. (2009). Immersive interfaces for engagement and learning. Science 323, 66--69.",
      "doi": ""
    },
    {
      "text": "José Van Dijck. (2008). Digital photography: communication, identity, memory. Visual Communication 7, 1 (2008), 57--76.",
      "doi": ""
    },
    {
      "text": "Helga Dittmar. (1989). Gender identity-related meanings of personal possessions. British Journal of Social Psychology 28, 2 (1989), 159--171.",
      "doi": ""
    },
    {
      "text": "Helga Dittmar. (1992). The social psychology of material possessions. Harvester Wheatsheaf and St. Martin's Press.",
      "doi": ""
    },
    {
      "text": "Linn Van Dyne and Jon L. Pierce. (2004). Psychological ownership and feelings of possession: Three field studies predicting employee attitudes and organizational citizenship behavior. J. Organ. Behav. 25, 4 (2004), 439--459.",
      "doi": ""
    },
    {
      "text": "Matthew S. Eastin and Robert LaRose. (2006). Internet Self-Efficacy and the Psychology of the Digital Divide. Journal of Computer-Mediated Communication (2006).",
      "doi": ""
    },
    {
      "text": "Steven Feiner. (1994). Redefining the User Interface: Augmented Reality. ACM SIGGRAPH (1994), 1--7.",
      "doi": ""
    },
    {
      "text": "Franca Garzotto and Piazza Leonardo. Usability, Playability, and LongTerm Engagement in Computer Games ACM Classification Keywords H5.2. User Interfaces-Evaluation/Methodology.",
      "doi": ""
    },
    {
      "text": "Samuel D. Gosling, Peter J. Rentfrow, and William B. Swann. (2003). A very brief measure of the Big-Five personality domains. J. Res. Pers. 37, 6 (2003), 504--528.",
      "doi": ""
    },
    {
      "text": "Juho Hamari, Kati Alha, Simo Järvelä, J. Matias Kivikangas, Jonna Koivisto, and Janne Paavilainen. (2017). Why do players buy in-game content? An empirical study on concrete purchase motivations. Computers in Human Behavior 68, (2017), 538--546.  ",
      "doi": "10.1016/j.chb.2016.11.045"
    },
    {
      "text": "Juho Hamari and Vili Lehdonvirta. (2010). Game design as marketing: How game mechanics create demand for virtual goods. International Journal of Business Science and Applied Management 5, 1 (2010), 14--29.",
      "doi": ""
    },
    {
      "text": "Yuval Noah Harari. (2018). 21 Lessons for the 21st Century. Spiegel & Grau.",
      "doi": ""
    },
    {
      "text": "Jennefer Hart, Alistair Sutcliffe, and Antonella De Angeli. (2012). Using affect to evaluate user engagement. Proceedings of the 2012 ACM annual conference extended abstracts on Human Factors in Computing Systems Extended Abstracts - CHI EA '12 (2012), 1811.  ",
      "doi": "10.1145/2212776.2223714"
    },
    {
      "text": "H. G. Hoffman, A. Hollander, K. Schroder, S. Rousseau, and T. Furness. (1998). Physically touching and tasting virtual objects enhances the realism of virtual experiences. Virtual Reality (1998).  ",
      "doi": "10.1007/BF01408703"
    },
    {
      "text": "Ana Javornik and Ana Moutinho. (2017). MagicFace?: Stepping into Character through an Augmented Reality Mirror. January (2017).  ",
      "doi": "10.1145/3025453.3025722"
    },
    {
      "text": "Phillip Jeffrey and Gloria Mark. (1998). Constructing social spaces in virtual environments: A study of navigation and interaction. Workshop on Personalised and Social Navigation in Information Space (1998).",
      "doi": ""
    },
    {
      "text": "Elena Karahanna, Sean Xin Xu, and Nan Andy Zhang. (2018). The Needs-Affordances-Features Perspective for the use of social media. 42, 3 (2018), 737--756.",
      "doi": ""
    },
    {
      "text": "Hanna Krasnova, Sarah Spiekermann, Ksenia Koroleva, and Thomas Hildebrand. (2010). Online social networks: Why we disclose. Journal of Information Technology 25, 2 (2010), 109--125.",
      "doi": ""
    },
    {
      "text": "Jumin Lee and Ayoung Suh. (2015). How do virtual community members develop psychological ownership and what are the effects of psychological ownership in virtual communities? Computers in Human Behavior (2015).  ",
      "doi": "10.1016/j.chb.2014.12.002"
    },
    {
      "text": "Kwan Min Lee, Wei Peng, Seung-A Jin, and Chang Yan. (2006). Can robots manifest personality?: An empirical test of personality recognition, social responses, and social presence in human--robot interaction. Journal of communication 56, 4 (2006), 754--772.",
      "doi": ""
    },
    {
      "text": "Younghwa Lee and Andrew N. K. Chen. (2011). Usability Design and Psychological Ownership of a Virtual World. Journal of Management Information Systems 28, 3 (2011), 269--308.",
      "doi": "10.5555/2448803.2448812"
    },
    {
      "text": "Vili Lehdonvirta. (2009). Virtual item sales as a revenue model: Identifying attributes that drive purchase decisions. Electronic Commerce Research 9, 1--2 (2009), 97--113.  ",
      "doi": "10.1007/s10660-009-9028-2"
    },
    {
      "text": "Masaki Matsunaga. (2010). How to factor-analyze your data right: Do's, don'ts, and how-to's. International Journal of Psychological Research 3, 1 (2010), 97--110.",
      "doi": ""
    },
    {
      "text": "Gail F Melson, Peter H Kahn Jr, Alan Beck, and Batya Friedman. (2009). Robotic pets in human lives: Implications for the human--animal bond and for human relationships with personified technologies. Journal of Social Issues 65, 3 (2009), 545--567.",
      "doi": ""
    },
    {
      "text": "Masahiro Mori, Karl F. MacDorman, and Norri Kageki. (2012). The uncanny valley. IEEE Robotics and Automation Magazine 19, 2 (2012), 98--100.",
      "doi": ""
    },
    {
      "text": "Stef G. Nicovich, Gregory W. Boller, and T. Bettina Cornwell. (2006). Experienced Presence within Computer-Mediated Communications: Initial Explorations on the Effects of Gender with Respect to Empathy and Immersion. Journal of Computer-Mediated Communication (2006).",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. (2005). Emotional Design: Why We Love (or Hate) Everyday Things. Basic Books.",
      "doi": ""
    },
    {
      "text": "Jum Nunnally. (1978). Psychometric theory.",
      "doi": ""
    },
    {
      "text": "William Odom, John Zimmerman, and Jodi Forlizzi. (2011). Teenagers and T heir Virtual Possessions?: Design Opportunities and Issues. (2011), 1491--1500.  ",
      "doi": "10.1145/1978942.1979161"
    },
    {
      "text": "Chantal Olckers. (2013). Psychological ownership: Development of an instrument. SA Journal of Industrial Psychology 39, 2 (2013), 1--13.",
      "doi": ""
    },
    {
      "text": "Thomas Olsson and Markus Salo. (2012). Narratives of satisfying and unsatisfying experiences of current mobile augmented reality applications. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12 June (2012), 2779.  ",
      "doi": "10.1145/2207676.2208677"
    },
    {
      "text": "Guy Paré, Claude Sicotte, and Jacques Hélène. (2006). The effects of creating psychological ownership on physicians' acceptance of clinical information systems. J. Am. Med. Inform. Assoc. 13, 2 (2006), 197--205.",
      "doi": ""
    },
    {
      "text": "Eunil Park and Angel P Del Pobil. (2013). Users' attitudes toward service robots in South Korea. Industrial Robot: An International Journal 40, 1 (2013), 77--87.",
      "doi": ""
    },
    {
      "text": "Timo Partala. (2011). Psychological needs and virtual worlds: Case Second Life. International Journal of Human-Computer Studies 69, 12 (2011), 787--800.  ",
      "doi": "10.1016/j.ijhcs.2011.07.004"
    },
    {
      "text": "Matthew Pateman, Daniel Harrison, Paul Marshall, and Marta E. Cecchinato. (2018). The Role of Aesthetics and Design. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (2018), 1--6.  ",
      "doi": "10.1145/3170427.3188556"
    },
    {
      "text": "Joann Peck and Suzanne B Shu. (2018). The Effect of Mere Touch on Perceived Ownership. 36, October 2009 (2018), 434--447.",
      "doi": ""
    },
    {
      "text": "Jon L. Pierce, Tatiana Kostova, and Kurt T. Dirks. (2001). Toward a Theory of Pschological Ownership in Organizations. Acad. Manage. Rev. 26, 2 (2001), 298--310.",
      "doi": ""
    },
    {
      "text": "Jon L. Pierce, Tatiana Kostova, and Kurt T. Dirks. (2003). The state of psychological ownership: Integrating and extending a century of research. Review of general psychology 7.1, 84 (2003).",
      "doi": ""
    },
    {
      "text": "Lev Poretski, Joel Lanir, and Ofer Arazy. (2018). Normative Tensions in Shared Augmented Reality. In Proceedings of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing.",
      "doi": "10.1145/3274411"
    },
    {
      "text": "Daphne R. Raban and Sheizaf Rafaeli. (2007). Investigating ownership and the willingness to share information online. Computers in Human Behavior 23, 5 (2007), 2367--2382.  ",
      "doi": "10.1016/j.chb.2006.03.013"
    },
    {
      "text": "Marsha L Richins. (1994). Special Possessions and the Expression of Material Values Linked references are available on JSTOR for this article?: Special Possessions and the Expression of Material Values. 21, 3 (1994), 522--533.",
      "doi": ""
    },
    {
      "text": "Floyd W. Rudmin and John W. Berry. (1987). Semantics of ownership: A free-recall study of property. The Psychological Record 37, 257--268.",
      "doi": ""
    },
    {
      "text": "Vishal Sachdev. (2011). Motivations for social computing. IT Professional 4 (2011), 18--23.  ",
      "doi": "10.1109/MITP.2011.65"
    },
    {
      "text": "Maria V. Sanchez-Vives and Mel Slater. (2005). Opinion: From presence to consciousness through virtual reality. Nature Reviews Neuroscience (2005).",
      "doi": ""
    },
    {
      "text": "Joachim Schroer and Guido Hertel. (2009). Voluntary Engagement in an Open Web-Based Encyclopedia: Wikipedians and Why They Do It. Media Psychology 12, 1 (2009), 96--120.",
      "doi": ""
    },
    {
      "text": "Stacey D. Scott, Sheelagh M.T. Carpendale, and Kori M. Inkpen. (2004). Territoriality in collaborative tabletop workspaces. In Proceedings of the 2004 ACM conference on Computer supported cooperative work - CSCW '04, 294.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Rong An Shang, Yu Chen Chen, and Sheng Chieh Huang. (2012). A private versus a public space: Anonymity and buying decorative symbolic goods for avatars in a virtual world. Computers in Human Behavior 28, 6 (2012), 2227--2235.  ",
      "doi": "10.1016/j.chb.2012.06.030"
    },
    {
      "text": "Eugene Sivadas and Ravi Venkatesh. (1995). An examination of individual and object-specific influences on the extended self and its relation to attachment and satisfaction. ACR North American Advances (1995).",
      "doi": ""
    },
    {
      "text": "Olli Sotamaa. (2010). When the Game Is Not Enough: Motivations and Practices Among Computer Game Modding Culture. Games and Culture 5, 3 (2010), 239--255.",
      "doi": ""
    },
    {
      "text": "S Shyam Sundar, Qian Xu, Saraswathi Bellur, Jeeyun Oh, and Haiyan Jia. (2010). Modality is the Message: Interactivity Effects on Perception and Engagement CHI 2010: Work-in-Progress (Spotlight on Posters Days 3 & 4).",
      "doi": ""
    },
    {
      "text": "Leena Ventä-Olkkonen, Maaret Posti, Olli Koskenranta, and Jonna Häkkilä. (2014). Investigating the balance between virtuality and reality in mobile mixed reality UI design. Proceedings of the 8th Nordic Conference on Human-Computer Interaction Fun, Fast, Foundational NordiCHI '14 (2014), 137--146.  ",
      "doi": "10.1145/2639189.2641201"
    },
    {
      "text": "Melanie Wallendorf and Eric J. Arnould. (1988). \"My Favorite Things\": A Cross-Cultural Inquiry into Object Attachment, Possessiveness, and Social Linkage. Journal of Consumer Research 14, 4 (1988), 531.",
      "doi": ""
    },
    {
      "text": "David Weibel and Bartholomäus Wissmath. (2011). Immersion in computer games: The role of spatial presence and flow. International Journal of Computer Games Technology (2011).  ",
      "doi": "10.1155/2011/282345"
    },
    {
      "text": "Stephen Wensveen, Kees Overbeeke, and Tom Djajadiningrat. (2000). Touch me, hit me and I know how you feel: a design approach to emotionally rich interaction. In Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques, 48--52.  ",
      "doi": "10.1145/347642.347661"
    },
    {
      "text": "Laurie M. Wilcox, Robert S. Allison, Samuel Elfassy, and Cynthia Grelik. (2006). Personal space in virtual reality. ACM Transactions on Applied Perception 3, 4 (2006), 412--428.  ",
      "doi": "10.1145/1190036.1190041"
    }
  ]
}