{
  "doi": "10.1145/3290605.3300514",
  "title": "TutoriVR: A Video-Based Tutorial System for Design Applications in Virtual Reality",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Virtual Reality painting is a form of 3D-painting done in a Virtual Reality (VR) space. Being a relatively new kind of art form, there is a growing interest within the creative practices community to learn it. Currently, most users learn using community posted 2D-videos on the internet, which are a screencast recording of the painting process by an instructor. While such an approach may suffice for teaching 2D-software tools, these videos by themselves fail in delivering crucial details that required by the user to understand actions in a VR space. We conduct a formative study to identify challenges faced by users in learning to VR-paint using such video-based tutorials. Informed by results of this study, we develop a VR-embedded tutorial system that supplements video tutorials with 3D and contextual aids directly in the user's VR environment. An exploratory evaluation showed users were positive about the system and were able to use the proposed system to recreate painting tasks in VR.",
  "tags": [
    "design applications",
    "virtual reality",
    "software tutorials"
  ],
  "authors": [
    {
      "name": "Balasaravanan Thoravi Kumaravel",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-99659367003/rel-imgonly/balakumaravel_headshot.jpg",
      "acmid": "99659367003",
      "orcid": "missing"
    },
    {
      "name": "Cuong Nguyen",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-81502644262/rel-imgonly/avatar.jpg",
      "acmid": "81502644262",
      "orcid": "0000-0001-9234-9960"
    },
    {
      "name": "Stephen DiVerdi",
      "institution": "Adobe Research, San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340488763",
      "orcid": "missing"
    },
    {
      "name": "Björn Hartmann",
      "institution": "University of California, Berkeley, Berkeley, CA, USA",
      "img": "/do/10.1145/contrib-81318498266/rel-imgonly/headshot2010_130.jpg",
      "acmid": "81318498266",
      "orcid": "0000-0002-0693-0829"
    }
  ],
  "references": [
    {
      "text": "2018. Oculus Medium. https://www.oculus.com/medium/learn/",
      "doi": ""
    },
    {
      "text": "2018. Quill. https://quill.fb.com/tutorials/",
      "doi": ""
    },
    {
      "text": "Fraser Anderson, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2013. YouMove: Enhancing Movement Training with an Augmented Reality Mirror. In Proceedings of the 26th annual ACM symposium on User interface software and technology - UIST'13. ACM Press, New York, New York, USA, 311--320.  ",
      "doi": "10.1145/2501988.2502045"
    },
    {
      "text": "Jerome Ardouin, Anatole Lecuyer, Maud Marchal, and Eric Marchand. 2011. Design and evaluation of methods to prevent frame cancellation in real-time stereoscopic rendering. In 2011 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 95--98. ",
      "doi": "10.5555/2013881.2014217"
    },
    {
      "text": "Rahul Arora, Rubaiat Habib Kazi, Tovi Grossman, George Fitzmaurice, and Karan Singh. 2018. SymbiosisSketch: Combining 2D & 3D Sketching for Designing Detailed 3D Objects in Situ. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18). ACM, New York, NY, USA, Article 185, 15 pages.  ",
      "doi": "10.1145/3173574.3173759"
    },
    {
      "text": "Rahul Arora, Rubaiat Habib Kazi, Fraser Anderson, Tovi Grossman, Karan Singh, and George Fitzmaurice. 2017. Experimental Evaluation of Sketching on Surfaces in VR. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI'17. ACM Press, New York, New York, USA, 5643--5654.  ",
      "doi": "10.1145/3025453.3025474"
    },
    {
      "text": "Nikola Banovic, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2012. Waken: Reverse Engineering Usage Information and Interface Structure from Software Videos. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST'12). ACM, New York, NY, USA, 83--92.  ",
      "doi": "10.1145/2380116.2380129"
    },
    {
      "text": "Mayra D Barrera Machuca, Paul Asente, Jingwan Lu, Byungmoon Kim, and Wolfgang Stuerzlinger. 2017. Multiplanes: Assisted freehand VR drawing. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology - UIST'17. ACM Press, New York, New York, USA, 1--3.  ",
      "doi": "10.1145/3131785.3131794"
    },
    {
      "text": "Marcio C. Cabral, Carlos H. Morimoto, and Marcelo K. Zufo. 2005. On the Usability of Gesture Interfaces in Virtual Reality Environments. In Proceedings of the 2005 Latin American Conference on Human-computer Interaction (CLIHC'05). ACM, New York, NY, USA, 100--108.  ",
      "doi": "10.1145/1111360.1111370"
    },
    {
      "text": "Pei-Yu Chi, Sally Ahn, Amanda Ren, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2012. MixT: Automatic Generation of Step-by-Step Mixed Media Tutorials. In Proceedings of the 25th annual ACM symposium on User interface software and technology - UIST'12. ACM Press, New York, New York, USA, 93.  ",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Josh Constine. 2016. Oculus \"Quill\" Turns VR Painting Into Performance Art. https://techcrunch.com/2016/01/26/oculus-quill/",
      "doi": ""
    },
    {
      "text": "Dima Damen, Teesid Leelasawassuk, Osian Haines, Andrew Calway, and Walterio Mayol-Cuevas. 2014. You-Do, I-Learn: Discovering Task Relevant Objects and their Modes of Interaction from Multi-User Egocentric Video. In Proceedings of the British Machine Vision Conference 2014. British Machine Vision Association, 30.1--30.13.",
      "doi": ""
    },
    {
      "text": "Michael F. Deering. 1995. HoloSketch: a virtual reality sketching/animation tool. ACM Transactions on Computer-Human Interaction 2, 3 (1995), 220--238.  ",
      "doi": "10.1145/210079.210087"
    },
    {
      "text": "Jonathan D. Denning, William B. Kerr, and Fabio Pellacini. 2011. MeshFlow: Interactive Visualization of Mesh Construction Sequences. ACM SIGGRAPH 2011 papers on - SIGGRAPH'11 30, 4 (2011), 1.  ",
      "doi": "10.1145/1964921.1964961"
    },
    {
      "text": "Jennifer Fernquist, Tovi Grossman, and George Fitzmaurice. 2011. Sketch-sketch Revolution: An Engaging Tutorial System for Guided Sketching and Application Learning. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST'11). ACM, New York, NY, USA, 373--382.  ",
      "doi": "10.1145/2047196.2047245"
    },
    {
      "text": "Michihiko Goto, Yuko Uematsu, Hideo Saito, Shuji Senda, and Akihiko Iketani. 2010. Task support system by displaying instructional video onto AR workspace. In 2010 IEEE International Symposium on Mixed and Augmented Reality. IEEE, 83--90.",
      "doi": ""
    },
    {
      "text": "Floraine Grabler, Maneesh Agrawala, Wilmot Li, Mira Dontcheva, and Takeo Igarashi. 2009. Generating photo manipulation tutorials by demonstration. ACM Transactions on Graphics 28, 3 (jul 2009), 1.  ",
      "doi": "10.1145/1531326.1531372"
    },
    {
      "text": "Chris Greenhalgh, Martin Flintham, Jim Purbrick, and Steve Benford. 2002. Applications of temporal links: Recording and replaying virtual environments. In Virtual Reality, 2002. Proceedings. IEEE. IEEE, 101--108. ",
      "doi": "10.5555/580130.835892"
    },
    {
      "text": "Tovi Grossman and George Fitzmaurice. 2010. ToolClips: An Investigation of Contextual Video Assistance for Functionality Understanding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10). ACM, New York, NY, USA, 1515--1524.  ",
      "doi": "10.1145/1753326.1753552"
    },
    {
      "text": "Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2010. Chronicle: capture, exploration, and playback of document workfow histories. In SIGCHI conference on Human factors in computing systems. 143--152. http://dl.acm.org/citation.cfm?id=1866054  ",
      "doi": "10.1145/1866029.1866054"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASATLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139--183.",
      "doi": ""
    },
    {
      "text": "H.H. Hu, A.a. Gooch, W.B. Thompson, B.E. Smits, J.J. Rieser, and Peter Shirley. 2000. Visual cues for imminent object contact in realistic virtual environments. In Proceedings Visualization 2000. VIS 2000. IEEE, 179--185. ",
      "doi": "10.5555/375213.375238"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2011. Ambient Help. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI'11. ACM Press, New York, New York, USA, 2751.  ",
      "doi": "10.1145/1978942.1979349"
    },
    {
      "text": "Peter Mohr, David Mandl, Markus Tatzgern, Eduardo Veas, Dieter Schmalstieg, and Denis Kalkofen. 2017. Retargeting Video Tutorials Showing Tools With Surface Contact to Augmented Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI'17. ACM Press, New York, New York, USA, 6547--6558.  ",
      "doi": "10.1145/3025453.3025688"
    },
    {
      "text": "Brad A Myers, Rishi Bhatnagar, Jefrey Nichols, Choon Hong Peck, Dave Kong, Robert Miller, and A Chris. Long. 2002. Interacting at a Distance: Measuring the Performance of Laser Pointers and Other Devices. In Proceedings of the SIGCHI conference on Human factors in computing systems Changing our world, changing ourselves - CHI'02. ACM Press, New York, New York, USA, 33.  ",
      "doi": "10.1145/503376.503383"
    },
    {
      "text": "Alok Mysore and Philip J. Guo. 2017. Torta: Generating Mixed-Media GUI and Command-Line App Tutorials Using Operating-System-Wide Activity Tracing. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST'17). ACM, New York, NY, USA, 703--714.  ",
      "doi": "10.1145/3126594.3126628"
    },
    {
      "text": "Toshio Nakamura and Takeo Igarashi. 2008. An Applicationindependent System for Visualizing User Operation History. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (UIST'08). ACM, New York, NY, USA, 23--32.  ",
      "doi": "10.1145/1449715.1449721"
    },
    {
      "text": "Cuong Nguyen, Stephen DiVerdi, Aaron Hertzmann, and Feng Liu. 2018. Depth Confict Reduction for Stereo VR Video Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI'18). ACM, New York, NY, USA, Article 64, 9 pages.  ",
      "doi": "10.1145/3173574.3173638"
    },
    {
      "text": "Cuong Nguyen and Feng Liu. 2015. Making Software Tutorial Video Responsive. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI'15. ACM Press, New York, New York, USA, 1565--1568.  ",
      "doi": "10.1145/2702123.2702209"
    },
    {
      "text": "Nils Petersen and Didier Stricker. 2012. Learning task structure from video examples for workfow tracking and authoring. In IEEE International Symposium on Mixed and Augmented Reality. 237--246.  ",
      "doi": "10.1109/ISMAR.2012.6402562"
    },
    {
      "text": "Catherine Plaisant, Anne Rose, Gary Rublof, Richard Salter, and Ben Shneiderman. 1999. The design of history mechanisms and their use in collaborative educational simulations. In Proceedings of the 1999 conference on Computer support for collaborative learning - CSCL'99, Vol. 11. Association for Computational Linguistics, Morristown, NJ, USA, 44--es. ",
      "doi": "10.5555/1150240.1150284"
    },
    {
      "text": "Suporn Pongnumkul, Mira Dontcheva, Wilmot Li, Jue Wang, Lubomir Bourdev, Shai Avidan, and Michael F. Cohen. 2011. Pause-and-play: Automatically Linking Screencast Video Tutorials with Applications. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST'11). ACM, New York, NY, USA, 135--144.  ",
      "doi": "10.1145/2047196.2047213"
    },
    {
      "text": "Kevin Ponto, Joe Kohlmann, and Michael Gleicher. 2012. Efective Replays and Summarization of Virtual Experiences. IEEE Transactions on Visualization and Computer Graphics 18, 4 (April 2012), 607--616.  ",
      "doi": "10.1109/TVCG.2012.41"
    },
    {
      "text": "Stephan Reichelt, Ralf Häussler, Gerald Fütterer, and Norbert Leister. 2010. Depth cues in human visual perception and their realization in 3D displays, Bahram Javidi, Jung-Young Son, John T. Thomas, and Daniel D. Desjardins (Eds.). 76900B.",
      "doi": ""
    },
    {
      "text": "Steven Schkolne, Michael Pruett, and Peter Schröder. 2001. Surface Drawing: Creating Organic 3D Shapes with the Hand and Tangible Tools. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI'01. ACM Press, New York, New York, USA, 261--268.  ",
      "doi": "10.1145/365024.365114"
    },
    {
      "text": "Rajinder Sodhi, Hrvoje Benko, and Andrew Wilson. 2012. LightGuide: Projected Visualizations for Hand Movement Guidance. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI'12. ACM Press, New York, New York, USA, 179.  ",
      "doi": "10.1145/2207676.2207702"
    },
    {
      "text": "Geng Sun and Nick Holliman. 2009. Evaluating methods for controlling depth perception in stereoscopic cinematography. In Proc. SPIE, Andrew J. Woods, Nicolas S. Holliman, and John O. Merritt (Eds.), Vol. 7237. 72370I.",
      "doi": ""
    },
    {
      "text": "Kasim Terzi and Miles Hansard. 2016. Methods for reducing visual discomfort in stereoscopic 3D: A review. Signal Processing: Image Communication 47 (2016), 402--416.  ",
      "doi": "10.1016/j.image.2016.08.002"
    },
    {
      "text": "Gerold Wesche and Hans-Peter Seidel. 2001. FreeDrawer - A free-form sketching system on the responsive workbench. In Proceedings of the ACM symposium on Virtual reality software and technology - VRST'01. ACM Press, New York, New York, USA, 167.  ",
      "doi": "10.1145/505008.505041"
    },
    {
      "text": "Sean White, Levi Lister, and Steven Feiner. 2007. Visual hints for tangible gestures in augmented reality. In 2007 6th IEEE and ACM International Symposium on Mixed and Augmented Reality, ISMAR. IEEE, 1--4.  ",
      "doi": "10.1109/ISMAR.2007.4538824"
    },
    {
      "text": "E. Wiese, J. H. Israel, A. Meyer, and S. Bongartz. 2010. Investigating the Learnability of Immersive Free-hand Sketching. In Proceedings of the Seventh Sketch-Based Interfaces and Modeling Symposium (SBIM'10). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 135--142. http://dl.acm.org/citation.cfm?id=1923363.1923387 ",
      "doi": "10.5555/1923363.1923387"
    },
    {
      "text": "Ungyeon Yang and Gerard Jounghyun Kim. 2002. Implementation and Evaluation of \"Just Follow Me\": An Immersive, VR-Based, MotionTraining System. Presence: Teleoperators and Virtual Environments 11, 3 (2002), 304--323.  ",
      "doi": "10.1162/105474602317473240"
    }
  ]
}