{
  "doi": "10.1145/3290605.3300734",
  "title": "ALAP: Accessible LaTeX Based Mathematical Document Authoring and Presentation",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Assistive technologies such as screen readers and text editors have been used in past to improve the accessibility and authoring of scientific and mathematical documents. However, most screens readers fail to narrate complex mathematical notations and expressions as they skip symbols and necessary information required for the accurate narration of mathematical content. This study aims at evaluating a new Accessible LaTeX Based Mathematical Document Authoring and Presentation (ALAP) tool, which assist people with visual impairments in reading and writing mathematical documents. ALAP includes features like, assistive debugging, Math Mode for reading and writing mathematical notations, and automatic generation of an accessible PDF document. These features aim to improve the LaTeX debugging experience and make it simple for blind users to author mathematical content by narrating it in natural language through the use of integrated text to speech (TTS) engine. We evaluated ALAP by conducting a study with 18 visually impaired LaTeX users. The results showed that users preferred ALAP over another comparable LaTeX based authoring tool and were relatively more comfortable in completing the tasks while using ALAP.",
  "authors": [
    {
      "name": "Ahtsham Manzoor",
      "institution": "Lahore University of Management Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659312055",
      "orcid": "missing"
    },
    {
      "name": "Safa Arooj",
      "institution": "Lahore University of Management Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366125",
      "orcid": "missing"
    },
    {
      "name": "Shaban Zulfiqar",
      "institution": "Lahore University of Management Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366064",
      "orcid": "missing"
    },
    {
      "name": "Murayyiam Parvez",
      "institution": "Lahore University of Management Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261338",
      "orcid": "missing"
    },
    {
      "name": "Suleman Shahid",
      "institution": "Lahore University of Management Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371591550",
      "orcid": "missing"
    },
    {
      "name": "Asim Karim",
      "institution": "Lahore University of Management Sciences, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318498394",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Catherine M Baker, Lauren R Milne, and Richard E Ladner. 2015. Structjumper: A Tool to Help Blind Programmers Navigate and Understand the Structure of Code. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, 3043--3052.  ",
      "doi": "10.1145/2702123.2702589"
    },
    {
      "text": "Louis Braille. 2016. What Is Braille? - American Foundation for the Blind. Retrieved Jan 02, 2019 from http://www.afb.org/info/ living-with-vision-loss/braille/what-is-braille/123",
      "doi": ""
    },
    {
      "text": "Stephen Buswell. 1998. Mathematical Markup Language (MathML). Retrieved Jan 02, 2019 from https://www.w3.org/Math/ whatIsMathML.html",
      "doi": ""
    },
    {
      "text": "Michael Curran. 2006. NV Access. Retrieved Jan 02, 2019 from https://www.nvaccess.org/",
      "doi": ""
    },
    {
      "text": "Alistair DN Edwards, Heather McCartney, and Flavio Fogarolo. 2006. Lambda:: A Multimodal Approach to Making Mathematics Accessible to Blind Students. In Proceedings of the International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 48--54.  ",
      "doi": "10.1145/1168987.1168997"
    },
    {
      "text": "Helder Ferreira and Diamantino Freitas. 2005. Audiomath: Towards Automatic Readings of Mathematical Expressions. In Proceedings of In Human Computer Interaction International. HCI International.",
      "doi": ""
    },
    {
      "text": "John Hammersley. 2012. Real-Time Collaborative Writing and Publishing Tools With Integrated PDF Preview. Retrieved Jan 02, 2019 from http://www.overleaf.com/",
      "doi": ""
    },
    {
      "text": "Chandrika Jayant. 2006. A Survey of Math Accessibility for Blind Persons and An Investigation on Text/Math Separation. Seattle: University of Washington (2006).",
      "doi": ""
    },
    {
      "text": "jpallen. 2014. ShareLaTeX, The Online LaTeX Editor. Retrieved Jan 02, 2019 from http://www.sharelatex.com/",
      "doi": ""
    },
    {
      "text": "William R King and Jun He. 2006. A Meta-Analysis of the Technology Acceptance Model. Information & Management 43, 6 (2006), 740--755. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk A. Manzoor, S. Arooj, S. Zulfiqar, M. Parvez, S. Shahid, and A. Karim  ",
      "doi": "10.1016/j.im.2006.05.003"
    },
    {
      "text": "Ivan Kopecek and A Jergová. 1997. Programming and Visually Impaired People. In Proceedings of the World Computer Congress, Vol. 98. ICCHP, 365--372.",
      "doi": ""
    },
    {
      "text": "Piotr Kubowicz. 2015. Open Detex. Retrieved Jan 02, 2019 from https://github.com/pkubowicz/opendetex",
      "doi": ""
    },
    {
      "text": "Melanie LaForce, Elizabeth Noble, Heather King, Jeanne Century, Courtney Blackwell, Sandra Holt, Ahmed Ibrahim, and Stephanie Loo. 2016. The Eight Essential Elements of Inclusive STEM High Schools. International Journal of STEM Education 3, 1 (21 Nov 2016), 21.",
      "doi": ""
    },
    {
      "text": "Ahtsham Manzoor, Murayyiam Parvez, Suleman Shahid, and Asim Karim. 2018. Assistive Debugging to Support Accessible Latex Based Document Authoring. In Proceedings of the International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 432--434.  ",
      "doi": "10.1145/3234695.3241013"
    },
    {
      "text": "Giuseppe Melfi, Thorsten Schwarz, and Rainer Stiefelhagen. 2018. An Inclusive and Accessible LaTeX Editor. In Proceedings of International Conference on Computers Helping People with Special Needs. Springer, 579--582.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2012. Microsoft Speech Platform. Retrieved Jan 02, 2019 from http://msdn.microsoft.com/en-us/library/jj127449.aspx",
      "doi": ""
    },
    {
      "text": "Microsoft. 2018. Microsoft Word. Retrieved Jan 02, 2019 from https: //www.w3.org/TR/WCAG-TECHS/pdf.html",
      "doi": ""
    },
    {
      "text": "Emma Murphy, Enda Bates, and Dónal Fitzpatrick. 2010. Designing Auditory Cues to Enhance Spoken Mathematics for Visually Impaired Users. In Proceedings of the International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 75--82.  ",
      "doi": "10.1145/1878803.1878819"
    },
    {
      "text": "Christopher Muscato. 2003. Continuous and Non-Continuous Texts. Retrieved Jan 02, 2019 from https://study.com/academy/lesson/ continuous-non-continuous-texts-definitions-comparison-examples. html",
      "doi": ""
    },
    {
      "text": "Abraham Nemeth. 2017. What is MathSpeak? Retrieved Jan 02, 2019 from http://www.gh-mathspeak.com/examples/ grammar-rules/",
      "doi": ""
    },
    {
      "text": "Oren Patashnik. 1988. LaTeX - A Document Preparation System. Retrieved Jan 02, 2019 from https://www.latex-project.org/",
      "doi": ""
    },
    {
      "text": "Christian Schenk. 1991. Yet Another Previewer. Retrieved Jan 02, 2019 from http://tex.imm.uran.ru/tex/yap.html",
      "doi": ""
    },
    {
      "text": "Freedom Scientific. 1995. Freedom Scientific\"BLINDNESS SOLUTIONS: JAWS. Retrieved Jan 02, 2019 from http://www.freedomscientific. com/Products/Blindness/JAWS",
      "doi": ""
    },
    {
      "text": "Volker Sorge, Charles Chen, TV Raman, and David Tseng. 2014. Towards Making Mathematics a First Class Citizen in General Screen Readers. In Proceedings of the Web for All Conference. ACM, 40.  ",
      "doi": "10.1145/2596695.2596700"
    },
    {
      "text": "Texlipse Sourceforge. 2017. \"TeXlipse\" Homepage - LaTeX for Eclipse. Retrieved Jan 02, 2019 from http://texlipse.sourceforge.net/",
      "doi": ""
    },
    {
      "text": "Dat Tran, Philip Haines, Wanli Ma, and Dharmendra Sharma. 2007. Text-To-Speech Technology-Based Programming Tool. In Proceedings of the WSEAS International Conference on Signal, Speech and Image Processing. World Scientific and Engineering Academy and Society (WSEAS), 173--176. ",
      "doi": "10.5555/1364486.1364516"
    },
    {
      "text": "W3C. 2018. Make PDF Files Compliant With Web Content Accessibility Guidelines 2.0. Retrieved Jan 02, 2019 from https://www.w3.org/ TR/WCAG-TECHS/pdf.html",
      "doi": ""
    },
    {
      "text": "Angela M Wigmore, Eckhard Pflugel, Gordon JA Hunter, James Denholm-Price, and Martin Colbert. 2010. TalkMaths Better! Evaluating and Improving an Intelligent Interface for Creating and Editing Mathematical Text. In Proceedings of International Conference on Intelligent Environments. IEEE, 307--310.  ",
      "doi": "10.1109/IE.2010.62"
    },
    {
      "text": "Katsuhito Yamaguchi, Toshihiko Komada, Fukashi Kawane, and Masakazu Suzuki. 2008. New features in Math Accessibility With Infty Software. In Proceedings of International Conference on Computers for Handicapped Persons. Springer, 892--899.  ",
      "doi": "10.1007/978-3-540-70540-6_134"
    }
  ]
}