{
  "doi": "10.1145/3290605.3300384",
  "title": "Multi-plié: A Linear Foldable and Flattenable Interactive Display to Support Efficiency, Safety and Collaboration",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "We present the design concept of an accordion-fold interactive display to address the limits of touch-based interaction in airliner cockpits. Based on an analysis of pilot activity, tangible design principles for this design concept are identified. Two resulting functional prototypes are explored during participatory workshops with pilots, using activity scenarios. This exploration validated the design concept by revealing its ability to match pilot responsibilities in terms of safety, efficiency and collaboration. It provides an efficient visual perception of the system for real-time collaborative operations and tangible interaction to strengthen the perception of action and to manage safety through anticipation and awareness. The design work and insights enabled to specify further our needs regarding flexible screens. They also helped to better characterize the design concept as based on continuity of a developed surface, predictability of aligned folds and pleat face roles, embodied interactive properties, and flexibility through affordable reconfigurations.",
  "tags": [
    "ethnography",
    "touchscreens",
    "design",
    "tangible interaction",
    "aeronautics",
    "shape-changing interfaces",
    "safety"
  ],
  "authors": [
    {
      "name": "Sylvain Pauchet",
      "institution": "University of Toulouse - ENAC & Astrolab, Toulouse, France",
      "img": "/do/10.1145/contrib-99659122644/rel-imgonly/ident.jpg",
      "acmid": "99659122644",
      "orcid": "0000-0001-7752-1101"
    },
    {
      "name": "Jean-Luc Vinot",
      "institution": "University of Toulouse - ENAC, Toulouse, France",
      "img": "/do/10.1145/contrib-81310489790/rel-imgonly/jl_vinot.jpg",
      "acmid": "81310489790",
      "orcid": "missing"
    },
    {
      "name": "Catherine Letondal",
      "institution": "University of Toulouse - ENAC, Toulouse, France",
      "img": "/do/10.1145/contrib-81100163015/rel-imgonly/portrait2.png",
      "acmid": "81100163015",
      "orcid": "missing"
    },
    {
      "name": "Alexandre Lemort",
      "institution": "Ingenuity i/o, Ramonville Saint-Agne, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100143431",
      "orcid": "missing"
    },
    {
      "name": "Claire Lavenir",
      "institution": "Intactile Design, Montpellier, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659248906",
      "orcid": "missing"
    },
    {
      "name": "Timothée Lecomte",
      "institution": "University of Toulouse - ENAC, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367152",
      "orcid": "missing"
    },
    {
      "name": "Stéphanie Rey",
      "institution": "Berger-Levrault, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474643176",
      "orcid": "missing"
    },
    {
      "name": "Valentin Becquet",
      "institution": "University of Toulouse - ENAC, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659248945",
      "orcid": "missing"
    },
    {
      "name": "Guillaume Crouzet",
      "institution": "University of Toulouse - ENAC, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659276802",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alapetite, A., Fogh, R., Zammit-Mangion, D. et al. Direct Tactile Manipulation of the Flight Plan in a Modern Aircraft Cockpit. In Proc. of HCI Aero 2012",
      "doi": ""
    },
    {
      "text": "Jason Alexander, Andrés Lucero, and Sriram Subramanian. 2012. Tilt displays: designing display surfaces with multi-axis tilting and actuation. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12). ACM, New York, NY, USA, 161--170.  ",
      "doi": "10.1145/2371574.2371600"
    },
    {
      "text": "Jacques Bertin. La graphique et le traitement graphique de l'information. Paris : Flammarion, 1977, 273 p. (translation 1981. Graphics and graphic information-processing by William J. Berg and Paul Scott)",
      "doi": ""
    },
    {
      "text": "Cécile Bourgaux, Jacques Cellard. 2013. Les racines grecques et latines du vocabulaire français. De Boeck/Duculot, publishers, ISBN13: 978--2801116944",
      "doi": ""
    },
    {
      "text": "Guy A., Boy, 2012. What do we mean by Human-Centered Design of Life-Critical Systems? In Proceedings of the 2012 IEA World Congress on Ergonomics, Recife, Brazil.",
      "doi": ""
    },
    {
      "text": "Stephen M. Casner, S.M., Geven, R.W., Recker, M. P. and Schooler, J.W. 2014. The Retention of Manual Flying Skills in the Automated Cockpit. Human Factors: The Journal of the Human Factors and Ergonomics Society.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, Philippe Palanque, Yannick Deleris, Catherine Trask, Ashley Coveney, Marcus Yung, and Karon MacLean. 2017. Turbulent Touch: Touchscreen Input for Cockpit Flight Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6742--6753.  ",
      "doi": "10.1145/3025453.3025584"
    },
    {
      "text": "Marcelo Coelho and Jamie Zigelbaum. 2011. Shape-changing interfaces. Personal Ubiquitous Comput. 15, 2 (February 2011), 161173.  ",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Philip R. Cohen and David R. McGee. 2004. Tangible multimodal interfaces for safety-critical applications. Commun. ACM 47, 1 (January 2004), 41--46.  ",
      "doi": "10.1145/962081.962103"
    },
    {
      "text": "Degani A, Wiener E.L. Cockpit checklists: Concepts, design, and use. Human Factors. 1993;35((2)):28--43.",
      "doi": ""
    },
    {
      "text": "Sonia Dodd, Jeff Lancaster, Andrew Miranda, et al. 2014. Touch Screens on the Flight Deck: The Impact of Touch Target Size, Spacing, Touch Technology and Turbulence on Pilot Performance. In Pp. 6--10. SAGE Publications Sage CA: Los Angeles, CA.",
      "doi": ""
    },
    {
      "text": "Ken Funk. 1991. Cockpit task management: Preliminary definitions, normative theory, error taxonomy, and design recommendations. The International Journal of Aviation Psychology, 1(4), 271--285.",
      "doi": ""
    },
    {
      "text": "David T. Gallant, Andrew G. Seniuk, and Roel Vertegaal. 2008. Towards more paper-like input: flexible input devices for foldable interaction styles. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08). ACM, New York, NY, USA, 283--286.  ",
      "doi": "10.1145/1449715.1449762"
    },
    {
      "text": "Antonio Gomes and Roel Vertegaal. 2014. Paperfold: a shape changing mobile device with multiple reconfigurable electrophoretic magnetic display tiles. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 535--538.  ",
      "doi": "10.1145/2559206.2574770"
    },
    {
      "text": "Jens Emil Grønbæk, Henrik Korsgaard, Marianne Graves Petersen, Morten Henriksen Birk, and Peter Gall Krogh. 2017. Proxemic Transitions: Designing Shape-Changing Furniture for Informal Meetings. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 7029--7041.  ",
      "doi": "10.1145/3025453.3025487"
    },
    {
      "text": "Ken Hinckley, Morgan Dixon, Raman Sarin, Francois Guimbretiere, and Ravin Balakrishnan. 2009. Codex: a dual screen tablet computer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1933--1942.  ",
      "doi": "10.1145/1518701.1518996"
    },
    {
      "text": "Eva Hornecker and Jacob Buur. 2006. Getting a grip on tangible interaction: a framework on physical space and social interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, New York, NY, USA, 437--446.  ",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Sylvain Hourlier, Sandra Guérard, Jean-Luc Barou and Xavier Servantie, 2015. Testing Touch Screens in Realistic Aeronautic Turbulent Conditions (Light to Severe). SAE International Journal of Aerospace 8.",
      "doi": ""
    },
    {
      "text": "Sridher Kaminani. 2011. Human Computer Interaction Issues with Touch Screen Interfaces in the Flight Deck. In P. 6B4--1. IEEE.",
      "doi": ""
    },
    {
      "text": "Hyunyoung Kim, Celine Coutrix, and Anne Roudaut. 2018. Morphees+: Studying Everyday Reconfigurable Objects for the Design and Taxonomy of Reconfigurable UIs. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 619, 14 pages.  ",
      "doi": "10.1145/3173574.3174193"
    },
    {
      "text": "Mohammadreza Khalilbeigi, Roman Lissermann, Wolfgang Kleine, and Jürgen Steimle. 2012. FoldMe: interacting with double-sided foldable displays. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), Stephen N. Spencer (Ed.). ACM, New York, NY, USA, 33--40.  ",
      "doi": "10.1145/2148131.2148142"
    },
    {
      "text": "Koleva, B, Benford, S, Kher Hui Ng, Rodden, T. A Framework for Tangible User Interfaces, Physical Interaction (PI03) - Workshop on Real World User Interfaces, Mobile HCI Conference 2003.",
      "doi": ""
    },
    {
      "text": "Byron Lahey, Audrey Girouard, Winslow Burleson, and Roel Vertegaal. 2011. PaperPhone: understanding the use of bend gestures in mobile devices with flexible electronic paper displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1303--1312.  ",
      "doi": "10.1145/1978942.1979136"
    },
    {
      "text": "Johnny C. Lee, Scott E. Hudson, and Edward Tse. 2008. Foldable interactive displays. In Proceedings of the 21st annual ACM symposium on User interface software and technology (UIST '08). ACM, New York, NY, USA, 287--290.  ",
      "doi": "10.1145/1449715.1449763"
    },
    {
      "text": "Catherine Letondal, Jean-Luc Vinot, Sylvain Pauchet, Caroline Boussiron, Stéphanie Rey, Valentin Becquet, and Claire Lavenir. 2018. Being in the Sky: Framing Tangible and Embodied Interaction for Future Airliner Cockpits. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18). ACM, New York, NY, USA, 656--666.  ",
      "doi": "10.1145/3173225.3173229"
    },
    {
      "text": "Loukia D. Loukopoulos, R. K. Dismukes, and I. Barshi. 2001. Cockpit interruptions and distractions: A line observation study. Proceedings of the 11th international symposium on aviation psychology, Ohio State University Press Columbus, 1--6.",
      "doi": ""
    },
    {
      "text": "Mackay, W.E., Is paper safer? The role of paper flight strips in air traffic control. ACM Trans. Comput.-Hum. Interact. 6, 4 (December 1999), 311--340.  ",
      "doi": "10.1145/331490.331491"
    },
    {
      "text": "Gregory Mone. 2013. The future is flexible displays. Commun. ACM 56, 6 (June 2013), 16--17.  ",
      "doi": "10.1145/2461256.2461263"
    },
    {
      "text": "Samudrala Nagaraju. 2013. Novel user interaction styles with flexible/rollable screens. In Proceedings of the Biannual Conference of the Italian Chapter of SIGCHI (CHItaly '13). ACM, New York, NY, USA, Article 20, 7 pages.  ",
      "doi": "10.1145/2499149.2499152"
    },
    {
      "text": "Noyes, J.M. and Starr, A.F. 2007. A Comparison of Speech Input and Touch Screen for Executing Checklists in an Avionics Application. Int. J. Aviation Psychology 17.",
      "doi": ""
    },
    {
      "text": "Sylvain Pauchet, Catherine Letondal, Jean-Luc Vinot, Mickaël Causse, Mathieu Cousy, Valentin Becquet, and Guillaume Crouzet. 2018. GazeForm: Dynamic Gaze-adaptive Touch Surface for Eyesfree Interaction in Airliner Cockpits. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 1193--1205.  ",
      "doi": "10.1145/3196709.3196712"
    },
    {
      "text": "Raf Ramakers, Johannes Schöning, and Kris Luyten. 2014. Paddle: highly deformable mobile devices with physical controls. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2569--2578.  ",
      "doi": "10.1145/2556288.2557340"
    },
    {
      "text": "Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-changing interfaces: a review of the design space and open research questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 735--744.  ",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Simon Robinson, Céline Coutrix, Jennifer Pearson, Juan Rosso, Matheus Fernandes Torquato, Laurence Nigay, and Matt Jones. 2016. Emergeables: Deformable Displays for Continuous Eyes-Free Mobile Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3793--3805.  ",
      "doi": "10.1145/2858036.2858097"
    },
    {
      "text": "Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: toward high \"shape resolution\" in self-actuated flexible mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 593--602.  ",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "Jürgen Steimle, Andreas Jordt, and Pattie Maes. 2013. Flexpad: highly flexible bending interactions for projected handheld displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 237--246.  ",
      "doi": "10.1145/2470654.2470688"
    },
    {
      "text": "Dag Svanæs. 2013. Interaction design for and with the lived body: Some implications of merleau-ponty's phenomenology. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 8 (April 2013), 30 pages.  ",
      "doi": "10.1145/2442106.2442114"
    },
    {
      "text": "Melanie Tory and Robert Kincaid. 2013. Comparing physical, overlay, and touch screen parameter controls. ACM Press, 91--100.  ",
      "doi": "10.1145/2512349.2512812"
    },
    {
      "text": "Jean-Luc Vinot, Catherine Letondal, Sylvain Pauchet, and Stéphane Chatty. 2016. Could tangibility improve the safety of touch-based interaction?: exploring a new physical design space for pilot-system interfaces. In Proceedings of the International Conference on HumanComputer Interaction in Aerospace (HCI-Aero '16). ACM, New York, NY, USA, Article 8, 8 pages.  ",
      "doi": "10.1145/2950112.2964581"
    },
    {
      "text": "Simon Voelker, Kjell Ivar Øvergård, Chat Wacharamanotham, and Jan Borchers. 2015. Knobology Revisited: A Comparison of User Performance between Tangible and Virtual Rotary Knobs. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 35--38.  ",
      "doi": "10.1145/2817721.2817725"
    },
    {
      "text": "Kening Zhu, Morten Fjeld, and Ayça Ünlüer. 2018. WristOrigami: Exploring Foldable Design for Multi-Display Smartwatch. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 1207--1218.  ",
      "doi": "10.1145/3196709.3196713"
    }
  ]
}