{
  "doi": "10.1145/3290605.3300285",
  "title": "Sensing Posture-Aware Pen+Touch Interaction on Tablets",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Many status-quo interfaces for tablets with pen + touch input capabilities force users to reach for device-centric UI widgets at fixed locations, rather than sensing and adapting to the user-centric posture. To address this problem, we propose sensing techniques that transition between various nuances of mobile and stationary use via postural awareness. These postural nuances include shifting hand grips, varying screen angle and orientation, planting the palm while writing or sketching, and detecting what direction the hands approach from. To achieve this, our system combines three sensing modalities: 1) raw capacitance touchscreen images, 2) inertial motion, and 3) electric field sensors around the screen bezel for grasp and hand proximity detection. We show how these sensors enable posture-aware pen+touch techniques that adapt interaction and morph user interface elements to suit fine-grained contexts of body-, arm-, hand-, and grip-centric frames of reference.",
  "tags": [
    "grip",
    "posture",
    "sensing",
    "tablets",
    "pen + touch",
    "electric field sensing"
  ],
  "authors": [
    {
      "name": "Yang Zhang",
      "institution": "Microsoft Research & Carnegie Mellon University, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81548025596/rel-imgonly/yang.jpg",
      "acmid": "81548025596",
      "orcid": "0000-0003-2472-6968"
    },
    {
      "name": "Michel Pahud",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456607280",
      "orcid": "0000-0003-3924-1189"
    },
    {
      "name": "Christian Holz",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597100",
      "orcid": "0000-0001-9655-9519"
    },
    {
      "name": "Haijun Xia",
      "institution": "Microsoft Research & University of Toronto, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640651",
      "orcid": "0000-0002-9425-0881"
    },
    {
      "name": "Gierad Laput",
      "institution": "Microsoft Research & Carnegie Mellon University, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81502797271/rel-imgonly/gierad_laput_c2_425x425_gradient2_shift.jpg",
      "acmid": "81502797271",
      "orcid": "missing"
    },
    {
      "name": "Michael McGuffin",
      "institution": "Microsoft Research & École de Technologie Supérieure, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100605090",
      "orcid": "missing"
    },
    {
      "name": "Xiao Tu",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161174",
      "orcid": "missing"
    },
    {
      "name": "Andrew Mittereder",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367102",
      "orcid": "missing"
    },
    {
      "name": "Fei Su",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366010",
      "orcid": "missing"
    },
    {
      "name": "William Buxton",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452616426/rel-imgonly/81452616426.jpg",
      "acmid": "81452616426",
      "orcid": "0000-0002-0170-7097"
    },
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    }
  ],
  "references": [
    {
      "text": "Takamasa Adachi, Seiya Koura, Fumihisa Shibata and Asako Kimura. 2013. Forearm menu: using forearm as menu widget on tabletop system, in Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces. ACM. p. 333--336.  ",
      "doi": "10.1145/2512349.2512393"
    },
    {
      "text": "Michelle Annett, Tovi Grossman, Daniel Wigdor and George Fitzmaurice. 2011. Medusa: A Proximity-Aware Multi-touch Tabletop, in Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM. p. 337--346.  ",
      "doi": "10.1145/2047196.2047240"
    },
    {
      "text": "Michelle Annett, Anoop Gupta and Walter F. Bischof, Exploring and Understanding Unintended Touch during Direct Pen Interaction. ACM Trans. Comput.-Hum. Interact., 2014. 21(5): p. Article 28 (39pp).  ",
      "doi": "10.1145/2674915"
    },
    {
      "text": "Caroline Appert, Michel Beaudouin-Lafon and Wendy Mackay. 2004. Context matters: Evaluating interaction techniques with the CIS model, in Proc. of HCI 2004. Springer Verlag. p. 279--295.",
      "doi": ""
    },
    {
      "text": "Daniel Avrahami, Jacob O. Wobbrock and Shahram Izadi. 2011. Portico: tangible interaction on and around a tablet, in Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM. p. 347--356.  ",
      "doi": "10.1145/2047196.2047241"
    },
    {
      "text": "B. Bederson, Interfaces for Staying in the Flow. Ubiquity, 2004. 5(27).  ",
      "doi": "10.1145/1029383.1074069"
    },
    {
      "text": "Russell W. Belk, Possessions and the Extended Self. Journal of Consumer Research, 1988. 15(2): p. 139--168.",
      "doi": ""
    },
    {
      "text": "Eric A. Bier, Maureen C. Stone, Ken Pier, William Buxton and Tony D. DeRose. 1993. Toolglass and magic lenses: the see-through interface, in Proceedings of the 20th annual conference on Computer graphics and interactive techniques. ACM. p. 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Peter Brandl, Clifton Forlines, Daniel Wigdor, Michael Haller and Chia Shen. 2008. Combining and measuring the benefits of bimanual pen and direct-touch interaction on horizontal interfaces, in Proceedings of the working conference on Advanced visual interfaces (AVI '08). ACM, New York, NY, USA. p. 154--61.  ",
      "doi": "10.1145/1385569.1385595"
    },
    {
      "text": "1Peter Brandl, Jakob Leitner, Thomas Seifried, Michael Haller, Bernard Doray and Paul To. 2009. Occlusion-aware menu design for digital tabletops, in CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA. p. 322328.  ",
      "doi": "10.1145/1520340.1520461"
    },
    {
      "text": "Alex Butler, Shahram Izadi and Steve Hodges. 2008. SideSight: multi\"touch\" interaction around small devices, in UIST '08. p. 201--204.  ",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "B. Buxton. The Active Desk. 2009 Oct. 1, 2009 {cited Sept.. 9, 2016; Available from: http://www.billbuxton.com/ActiveDesk.html.",
      "doi": ""
    },
    {
      "text": "William Buxton. 1995. Integrating the Periphery and Context: A New Taxonomy of Telematics, in Proceedings of Graphics Interface '95. p. 239--246.",
      "doi": ""
    },
    {
      "text": "Drini Cami, Fabrice Matulic, Richard G. Calland, Brian Vogel and Daniel Vogel. 2018. Unimanual Pen+Touch Input Using Variations of Precision Grip Postures, in Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. ACM. p. 825837.  ",
      "doi": "10.1145/3242587.3242652"
    },
    {
      "text": "Xiang Cao, Andrew D. Wilson, Ravin Balakrishnan, Ken Hinckley and Scott E. Hudson. 2008. ShapeTouch: Leveraging contact shape on interactive surfaces, in Horizontal Interactive Human Computer Systems, 2008. TABLETOP 2008. 3rd IEEE International Workshop on. p. 129--136.",
      "doi": ""
    },
    {
      "text": "Joseph Chee Chang, Nathan Hahn and Aniket Kittur. 2016. Supporting Mobile Sensemaking Through Intentionally Uncertain Highlighting, in Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA. p. 6168.  ",
      "doi": "10.1145/2984511.2984538"
    },
    {
      "text": "Xiang 'Anthony' Chen, Julia Schwarz, Chris Harrison, Jennifer Mankoff and Scott E. Hudson. 2014. Air+touch: interweaving touch & in-air gestures, in Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA. p. 519--525.  ",
      "doi": "10.1145/2642918.2647392"
    },
    {
      "text": "Lung-Pan Cheng, Meng Han Lee, Che-Yang Wu, Fang-I Hsiao, YenTing Liu, Hsiang-Sheng Liang, Yi-Ching Chiu, Ming-Sui Lee and Mike Y. Chen. 2013. iRotateGrasp: automatic screen rotation based on grasp of mobile devices, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA. p. 3051--3054.  ",
      "doi": "10.1145/2470654.2481424"
    },
    {
      "text": "Lung-Pan Cheng, Hsiang-Sheng Liang, Che-Yang Wu and Mike Y. Chen. 2013. iGrasp: grasp-based adaptive keyboard for mobile devices, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). p. 3037--3046.  ",
      "doi": "10.1145/2470654.2481422"
    },
    {
      "text": "M. Csikszentmihalyi, Flow: The Psychology of Optimal Experience. 1991: HarperCollins.",
      "doi": ""
    },
    {
      "text": "Paul Dietz and Darren Leigh, DiamondTouch: a multi-user touch technology in Proceedings of the 14th annual ACM symposium on User interface software and technology 2001 ACM Press: Orlando, Florida p. 219--226  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Kenneth P. Fishkin, Thomas P. Moran and Beverly L. Harrison. 1998. Embodied User Interfaces: Towards Invisible User Interfaces, in Proceedings of EHCI '98. p. To appear. ",
      "doi": "10.5555/645349.650706"
    },
    {
      "text": "George Fitzmaurice, Azam Khan, Robert Piek, Bill Buxton and Gordon Kurtenbach. 2003. Tracking menus, in Proceedings of the 16th annual ACM symposium on User interface software and technology. ACM. p. 71--79.  ",
      "doi": "10.1145/964696.964704"
    },
    {
      "text": "George W. Fitzmaurice, Ravin Balakrishnan, Gordon Kurtenbach and Bill Buxton, An exploration into supporting artwork orientation in the user interface, in Proceedings of the SIGCHI conference on Human factors in computing systems: the CHI is the limit. 1999, ACM Press: Pittsburgh, Pennsylvania, United States. p. 167--174.  ",
      "doi": "10.1145/302979.303033"
    },
    {
      "text": "Clifton Forlines, Daniel Vogel and Ravin Balakrishnan. 2006. HybridPointing: fluid switching between absolute and relative pointing with a direct input device, in Proceedings of the 19th annual ACM symposium on User interface software and technology. ACM. p. 211220.  ",
      "doi": "10.1145/1166253.1166286"
    },
    {
      "text": "Cédric Foucault, Manfred Micaux, David Bonnet and Michel Beaudouin-Lafon. 2014. SPad: a bimanual interaction technique for productivity applications on multi-touch tablets, in CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA. p. 1879--1884.  ",
      "doi": "10.1145/2559206.2581277"
    },
    {
      "text": "Mathias Frisch, Jens Heydekorn and Raimund Dachselt. 2009. Investigating multi-touch and pen gestures for diagram editing on interactive surfaces, in Interactive Tabletops and Surfaces (ITS '09). ACM. p. 149--156.  ",
      "doi": "10.1145/1731903.1731933"
    },
    {
      "text": "Mayank Goel, Jacob Wobbrock and Shwetak Patel. 2012. GripSense: Using Built-In Sensors to Detect Hand Posture and Pressure on Commodity Mobile Phones, in Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA. p. 545--554.  ",
      "doi": "10.1145/2380116.2380184"
    },
    {
      "text": "Tovi Grossman, Ken Hinckley, Patrick Baudisch, Maneesh Agrawala and Ravin Balakrishnan. 2006. Hover widgets: using the tracking state to extend the capabilities of pen-operated devices, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'06). ACM. p. 861--870.  ",
      "doi": "10.1145/1124772.1124898"
    },
    {
      "text": "Yves Guiard, Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behavior, 1987. 19(4): p. 486--517.",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Robert Xiao and Chris Harrison. 2015. CapAuth: Identifying and Differentiating User Handprints on Commodity Capacitive Touchscreens, in Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces. ACM. p. 59--62.  ",
      "doi": "10.1145/2817721.2817722"
    },
    {
      "text": "William Hamilton, Andruid Kerne and Tom Robbins. 2012. High-performance pen + touch modality interactions: a real-time strategy game eSports context, in Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA. p. 309--318.  ",
      "doi": "10.1145/2380116.2380156"
    },
    {
      "text": "Beverly L. Harrison, Kenneth P. Fishkin, Anuj Gujar, Carlos Mochon and Roy Want. 1998. Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'98). ACM Press/Addison-Wesley Publishing Co. p. 17--24.  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Chris Harrison and Anind K. Dey. 2008. Lean and zoom: proximityaware user interface and content magnification, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM. p. 507--510.  ",
      "doi": "10.1145/1357054.1357135"
    },
    {
      "text": "Bjoern Hartmann, Meredith Ringel Morris, Hrvoje Benko and Andrew D. Wilson. 2010. Pictionaire: Supporting Collaborative Design Work by Integrating Physical and Digital Artifacts, in CSCW '10 Conf. on Computer Supported Collaborative Work. ACM.  ",
      "doi": "10.1145/1718918.1718989"
    },
    {
      "text": "Ken Hinckley, Jeff Pierce, Mike Sinclair and Eric Horvitz. 2000. Sensing techniques for mobile interaction, in Proceedings of the 13th annual ACM symposium on User interface software and technology. ACM. p. 91--100.  ",
      "doi": "10.1145/354401.354417"
    },
    {
      "text": "Ken Hinckley, Jeff Pierce, Eric Horvitz and Mike Sinclair, Foreground and Background Interaction with Sensor-Enhanced Mobile Devices. ACM Trans. Comput.-Hum. Interact., 2005. 12(1 (Special Issue on Sensor-Based Interaction)): p. 31--52.  ",
      "doi": "10.1145/1057237.1057240"
    },
    {
      "text": "Ken Hinckley, Koji Yatani, Michel Pahud, Nicole Coddington, Jenny Rodenhouse, Andy Wilson, Hrvoje Benko and Bill Buxton. 2010. Pen + Touch = New Tools, in Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM. p. 27--36.  ",
      "doi": "10.1145/1866029.1866036"
    },
    {
      "text": "Ken Hinckley, Xiaojun Bi, Michel Pahud and Bill Buxton. 2012. Informal Information Gathering Techniques for Active Reading, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA. p. 1893--1896.  ",
      "doi": "10.1145/2207676.2208327"
    },
    {
      "text": "Ken Hinckley, Michel Pahud, Hrvoje Benko, Pourang Irani, Francois Guimbretiere, Marcel Gavriliu, Xiang 'Anthony' Chen, Fabrice Matulic, Bill Buxton and Andrew Wilson. 2014. Sensing Techniques for Tablet+Stylus Interaction, in Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST'14). p. 605614.  ",
      "doi": "10.1145/2642918.2647379"
    },
    {
      "text": "Ken Hinckley, Seongkook Heo, Michel Pahud, Christian Holz, Hrvoje Benko, Abigail Sellen, Richard Banks, Kenton O'Hara, Gavin Smyth and William Buxton. 2016. Pre-Touch Sensing for Mobile Interaction, in Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA. p. 28692881.  ",
      "doi": "10.1145/2858036.2858095"
    },
    {
      "text": "Ken Hinckley, A background perspective on touch as a multimodal (and multisensor) construct, in The Handbook of Multimodal-Multisensor Interfaces, O. Sharon, et al., Editors. 2017, Association for Computing Machinery and Morgan & Claypool. p. 143--199.  ",
      "doi": "10.1145/3015783.3015789"
    },
    {
      "text": "Christian Holz, Senaka Buthpitiya and Marius Knaust. 2015. Bodyprint: Biometric User Identification on Mobile Devices Using the Capacitive Touchscreen to Scan Body Parts, in Proceedings of the 2015 annual conference on Human factors in computing systems (CHI '15). ACM, New York, NY, USA. p. 3011--3014.  ",
      "doi": "10.1145/2702123.2702518"
    },
    {
      "text": "Frank M. Shipman III and Catherine C. Marshall. 1999. Formality Considered Harmful: Experiences, Emerging Themes, and Directions on the Use of Formal Representations in Interactive Systems, in Computer Supported Cooperative Work (CSCW). p. 333--352.  ",
      "doi": "10.1023/A%3A1008716330212"
    },
    {
      "text": "Ahmed Kharrufa, James Nicholson, Paul Dunphy, Steve Hodges, Pam Briggs and Patrick Olivier. 2015. Using IMUs to Identify Supervisors on Touch Devices, in Interact 2015. IFIP.",
      "doi": ""
    },
    {
      "text": "Sven Kratz, Tilo Westermann, Michael Rohs and Georg Essl. 2011. CapWidgets: tangile widgets versus multi-touch controls on mobile devices, in CHI '11 Extended Abstracts on Human Factors in Computing Systems. ACM. p. 1351--1356.  ",
      "doi": "10.1145/1979742.1979773"
    },
    {
      "text": "Per Ola Kristensson and Shumin Zhai. 2007. Command strokes with and without preview: using pen gestures on keyboard for command selection, in CHI '07. p. 1137--1146.  ",
      "doi": "10.1145/1240624.1240797"
    },
    {
      "text": "Myron Krueger, Artificial Reality II. 1991: Addison-Wesley.",
      "doi": ""
    },
    {
      "text": "Myron W. Krueger, Thomas Gionfriddo and Katrin Hinrichsen. 1985. VIDEOPLACE-an artificial reality, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '85). ACM, New York, NY, USA. p. 35--40.  ",
      "doi": "10.1145/317456.317463"
    },
    {
      "text": "Gordon Kurtenbach and William Buxton. 1991. Issues in combining marking and direct manipulation techniques, in Proceedings of the 4th annual ACM symposium on User interface software and technology. ACM. p. 137--144.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "Gordon Kurtenbach, George Fitzmaurice, Thomas Baudel and Bill Buxton. 1997. The design of a GUI paradigm based on tablets, twohands, and transparency, in Proceedings of the SIGCHI conference on Human factors in computing systems. ACM. p. 35--42.  ",
      "doi": "10.1145/258549.258574"
    },
    {
      "text": "Huy Viet Le, Thomas Kosch, Patrick Bader, Sven Mayer and Niels Henze. 2018. PalmTouch: Using the Palm as an Additional Input Modality on Commodity Smartphones, in Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM. p. 1--13.  ",
      "doi": "10.1145/3173574.3173934"
    },
    {
      "text": "Rong-Hao Liang, Liwei Chan, Hung-Yu Tseng, Han-Chih Kuo, DaYuan Huang, De-Nian Yang and Bing-Yu Chen. 2014. Gaussbricks: magnetic building blocks for constructive tangible interactions on portable displays, in CHI '14 Extended Abstracts on Human Factors in Computing Systems. ACM. p. 587--590.  ",
      "doi": "10.1145/2559206.2574776"
    },
    {
      "text": "P. Luff and C. Heath. 1998. Mobility in collaboration, in Proc. CSCW '98 Conf. on Computer Supported Cooperative Work. ACM. p. 305314.  ",
      "doi": "10.1145/289444.289505"
    },
    {
      "text": "W. E. Mackay. 2002. Which Interaction Technique Works When? Floating Palettes, Marking Menus and Toolglasses Support Different Task Strategies, in Proc. AVI 2002 International Conference on Advanced Visual Interfaces. ACM. p. 203--208.  ",
      "doi": "10.1145/1556262.1556294"
    },
    {
      "text": "I. S. MacKenzie, Fitts' law as a research and design tool in human-computer interaction. Human-Computer Interaction, 1992. 7: p. 91--139.  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Nicolai Marquardt, Ricardo Jota, Saul Greenberg and Joaquim A. Jorge. 2011. The Continuous Interaction Space: Interaction Techniques Unifying Touch and Gesture on and Above an Interaction Surface, in Proceedings of the 13th IFIP TC 13 international conference on Human-computer interaction - Volume Part III (INTERACT'11). Springer-Verlag, Berlin, Heidelberg. p. 461--476. ",
      "doi": "10.5555/2042182.2042224"
    },
    {
      "text": "Fabrice Matulic, Daniel Vogel and Raimund Dachselt. 2017. Hand Contact Shape Recognition for Posture-Based Tabletop Widgets and Interaction, in Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces. ACM. p. 3--11.  ",
      "doi": "10.1145/3132272.3134126"
    },
    {
      "text": "Emily B. Moore. 2015. Tilting the Tablet: The Effect of Tablet Tilt on Hand Occlusion, in Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM. p. 1633--1638.  ",
      "doi": "10.1145/2702613.2732790"
    },
    {
      "text": "J. Nielsen, Noncommand User Interfaces. Communications of the ACM, 1993. 36(4): p. 83--89.  ",
      "doi": "10.1145/255950.153582"
    },
    {
      "text": "Mohammad Faizuddin Mohd Noor, Simon Rogers and John Williamson. 2016. Detecting Swipe Errors on Touchscreens using Grip Modulation, in Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA. p. 19091920.  ",
      "doi": "10.1145/2858036.2858474"
    },
    {
      "text": "Michael I. Norton, Daniel Mochon and Dan Ariely, The IKEA effect: When labor leads to love. Journal of Consumer Psychology, 2012. 22(3): p. 453--460.",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer, Ken Hinckley, Michel Pahud and Bill Buxton. 2017. Thumb + Pen Interaction on Tablets, in Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM. p. 32543266.  ",
      "doi": "10.1145/3025453.3025567"
    },
    {
      "text": "Ken Pier and James A. Landay. 1992. Issues for Location-Independent Interfaces, in Conference Name.",
      "doi": ""
    },
    {
      "text": "Henning Pohl and Roderick Murray-Smith. 2013. Focused and casual interactions: allowing users to vary their level of engagement, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA. p. 2223--2232.  ",
      "doi": "10.1145/2470654.2481307"
    },
    {
      "text": "Jeff Raskin, The Humane Interface: New Directions for Designing Interactive Systems. 2000: ACM Press. ",
      "doi": "10.5555/333103"
    },
    {
      "text": "Sidharth Sahdev, Clifton Forlines, Ricardo Jota, Bruno De Araujo, Braon Moseley, Jonathan Deber, Steven Sanders, Darren Leigh and Daniel Wigdor. 2017. GhostID: Enabling Non-Persistent User Differentiation in Frequency-Division Capacitive Multi-Touch Sensors, in Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM. p. 15--27.  ",
      "doi": "10.1145/3025453.3025719"
    },
    {
      "text": "Albrecht Schmidt, Kofi Asante Aidoo, Antti Takaluoma, Urpo Tuomela, Kristof Van Laerhoven and Walter Van de Velde. 1999. Advanced interaction in context, in Handheld and Ubiquitous Computing (HUC'99). p. 89--101. ",
      "doi": "10.5555/647985.743849"
    },
    {
      "text": "Abigail Sellen, Gord Kurtenbach and William Buxton, The prevention of mode errors through sensory feedback. Human Computer Interaction, 1992. 7(2): p. 141--164.  ",
      "doi": "10.1207/s15327051hci0702_1"
    },
    {
      "text": "Itiro Siio and Hitomi Tsujita. 2006. Mobile interaction using paperweight metaphor, in Proceedings of the 19th annual ACM symposium on User interface software and technology (UIST '06). ACM, New York, NY, USA. p. 111--114.  ",
      "doi": "10.1145/1166253.1166271"
    },
    {
      "text": "Minghui Sun, Xiang Cao, Hyunyoung Song, Shahram Izadi, Hrvoje Benko, Francois Guimbretiere, Xiangshi Ren and Ken Hinckley. 2011. Enhancing Naturalness of Pen-and-Tablet Drawing through Context Sensing, in ITS '11 Int'l Conf on Interactive Tabletops and Surfaces p. 212--221.  ",
      "doi": "10.1145/2076354.2076371"
    },
    {
      "text": "Hemant Bhaskar Surale, Fabrice Matulic and Daniel Vogel. 2017. Experimental Analysis of Mode Switching Techniques in Touch-based User Interfaces, in Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM. p. 3267--3280.  ",
      "doi": "10.1145/3025453.3025865"
    },
    {
      "text": "Anthony Tang, Michel Pahud, Kori Inkpen, Hrvoje Benko, John C. Tang and Bill Buxton. 2010. Three's company: understanding communication channels in three-way distributed collaboration, in Proceedings of the 2010 ACM conference on Computer supported cooperative work (CSCW '10). ACM, New York, NY, USA. p. 271--280.  ",
      "doi": "10.1145/1718918.1718969"
    },
    {
      "text": "Brandon T. Taylor and V. Michael Bove Jr. 2009. Graspables: GraspRecognition as a User Interface, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA. p. 917--926.  ",
      "doi": "10.1145/1518701.1518842"
    },
    {
      "text": "Brygg Ullmer and Hiroshi Ishii. 1997. The metaDESK: models and prototypes for tangible user interfaces, in Proceedings of the 10th annual ACM symposium on User interface software and technology. ACM. p. 223--232.  ",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "Nicolas Villar, Daniel Cletheroe, Greg Saul, Christian Holz, Tim Regan, Oscar Salandin, Misha Sra, Hui-Shyong Yeo, William Field and Haiyan Zhang. 2018. Project Zanzibar: A Portable and Flexible Tangible Interaction Platform, in Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM. p. 1--13.  ",
      "doi": "10.1145/3173574.3174089"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users, in UIST 2004.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Daniel Vogel, Matthew Cudmore, #233, ry Casiez, Ravin Balakrishnan and Liam Keliher. 2009. Hand occlusion with tablet-sized direct pen input, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM. p. 557--566.  ",
      "doi": "10.1145/1518701.1518787"
    },
    {
      "text": "Daniel Vogel and Géry Casiez. 2012. Hand occlusion on a multi-touch tabletop, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). p. 2307--2316.  ",
      "doi": "10.1145/2207676.2208390"
    },
    {
      "text": "Julie Wagner, Stéphane Huot and Wendy Mackay. 2012. BiTouch and BiPad: designing bimanual interaction for hand-held tablets, in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). p. 2317--2326.  ",
      "doi": "10.1145/2207676.2208391"
    },
    {
      "text": "Andrew M. Webb, Michel Pahud, Ken Hinckley and Bill Buxton. 2016. Wearables as Context for Guiard-abiding Bimanual Touch, in Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA. p. 287300.  ",
      "doi": "10.1145/2984511.2984564"
    },
    {
      "text": "Daniel Wigdor, Clifton Forlines, Patrick Baudisch, John Barnwell and Chia Shen. 2007. Lucid touch: a see-through mobile device, in Proceedings of the 20th annual ACM symposium on User interface software and technology. ACM. p. 269--278.  ",
      "doi": "10.1145/1294211.1294259"
    },
    {
      "text": "Raphael Wimmer and Sebastian Boring. 2009. HandSense - Discriminating Different Ways of Grasping and Holding a Tangible User Interface, in Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). ACM, New York, NY, USA. p. 359--362.  ",
      "doi": "10.1145/1517664.1517736"
    },
    {
      "text": "Mike Wu and Ravin Balakrishnan, Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays in Proceedings of the 16th annual ACM symposium on User interface software and technology (UIST '03). 2003, ACM, New York, NY, USA: Vancouver, Canada p. 193--202  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "Haijun Xia, Ricardo Jota, Benjamin McCanny, Zhe Yu, Clifton Forlines, Karan Singh and Daniel Wigdor. 2014. Zero-latency tapping: using hover information to predict touch locations and eliminate touchdown latency, in Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA. p. 205--214.  ",
      "doi": "10.1145/2642918.2647348"
    },
    {
      "text": "Haijun Xia, Ken Hinckley, Michel Pahud, Xiao Tu and Bill Buxton. 2017. WritLarge: Ink Unleashed by Unified Scope, Action, & Zoom, in Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM. p. 3227--3240.  ",
      "doi": "10.1145/3025453.3025664"
    },
    {
      "text": "Robert Xiao, Julia Schwarz and Chris Harrison. 2015. Estimating 3D Finger Angle on Commodity Touchscreens, in Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces. ACM. p. 47--50.  ",
      "doi": "10.1145/2817721.2817737"
    },
    {
      "text": "Dongwook Yoon, Ken Hinckley, Hrvoje Benko, François Guimbretière, Pourang Irani, Michel Pahud and Marcel Gavriliu. 2015. Sensing Tablet Grasp + Micro-mobility for Active Reading, in Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA. p. 477--487.  ",
      "doi": "10.1145/2807442.2807510"
    },
    {
      "text": "Neng-Hao Yu, Li-Wei Chan, Lung-Pan Cheng, Mike Y. Chen and YiPing Hung. 2010. Enabling tangible interaction on capacitive touch panels, in Adjunct proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM. p. 457--458.  ",
      "doi": "10.1145/1866218.1866269"
    },
    {
      "text": "Ulrich von Zadow, Wolfgang B, #252, schel, Ricardo Langner and Raimund Dachselt. 2014. SleeD: Using a Sleeve Display to Interact with Touch-sensitive Display Walls, in Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces. ACM. p. 129--138.  ",
      "doi": "10.1145/2669485.2669507"
    },
    {
      "text": "Robert Zeleznik, Andrew Bragdon, Ferdi Adeputra and Hsu-Sheng Ko. 2010. Hands-on math: a page-based multi-touch and pen desktop for technical work and problem solving, in Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM. p. 17--26.  ",
      "doi": "10.1145/1866029.1866035"
    },
    {
      "text": "Robert C. Zeleznik, Kenneth P. Herndon and John F. Hughes. 1996. SKETCH: An interface for sketching 3D scenes, in ACM SIGGRAPH 1996 Conference on Computer Graphics and Interactive Techniques. ACM. p. 163--170.  ",
      "doi": "10.1145/237170.237238"
    }
  ]
}