{
  "doi": "10.1145/3290605.3300818",
  "title": "Interstices: Sustained Spatial Relationships between Hands and Surfaces Reveal Anticipated Action",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Our observations of landscape architecture students revealed a new phenomenon-interstices. Their bimanual interactions with a pen and touch surface involved various sustained hand gestures, interleaved between their regular commands. Positioning of the non-preferred hand indicates anticipated actions, including: sustained hovering near the surface; pulled back but still floating above the surface; and resting in their laps. We ran a second study with 14 landscape architect students which confirmed our observations, and uncovered a new interstice i.e. stabilizing the preferred hand while handwriting. We conclude with directions for future research and challenges for designers and researchers.",
  "authors": [
    {
      "name": "Andrew M. Webb",
      "institution": "Texas A&M University and Inria, Université Paris-Saclay, Paris, France",
      "img": "/do/10.1145/contrib-81472640485/rel-imgonly/self-025-small-purple.jpg",
      "acmid": "81472640485",
      "orcid": "missing"
    },
    {
      "name": "Hannah Fowler",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659277394",
      "orcid": "missing"
    },
    {
      "name": "Andruid Kerne",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/do/10.1145/contrib-81100203284/rel-imgonly/andruidamusebouche1.jpg",
      "acmid": "81100203284",
      "orcid": "missing"
    },
    {
      "name": "Galen Newman",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659276414",
      "orcid": "missing"
    },
    {
      "name": "Jun-Hyun Kim",
      "institution": "Michigan State University, East Lansing, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366495",
      "orcid": "missing"
    },
    {
      "name": "Wendy E. Mackay",
      "institution": "Inria, Université Paris-Saclay, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100236706",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Michelle Annett, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. 2011. Medusa: A Proximity-aware Multi-touch Tabletop. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 337--346.  ",
      "doi": "10.1145/2047196.2047240"
    },
    {
      "text": "Apple iPad Pro. 2015. https://www.apple.com/ipad-pro.",
      "doi": ""
    },
    {
      "text": "Jef Avery, Sylvain Malacria, Mathieu Nancel, Géry Casiez, and Edward Lank. 2018. Introducing Transient Gestures to Improve Pan and Zoom on Touch Surfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 25, 8 pages.  ",
      "doi": "10.1145/3173574.3173599"
    },
    {
      "text": "Ravin Balakrishnan and Ken Hinckley. 2000. Symmetric Bimanual Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 33--40.  ",
      "doi": "10.1145/332040.332404"
    },
    {
      "text": "Eric A. Bier, Maureen C. Stone, Ken Pier, William Buxton, and Tony D. DeRose. 1993. Toolglass and Magic Lenses: The See-through Interface. In Proceedings of the 20th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '93). ACM, New York, NY, USA, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Peter Brandl, Clifton Forlines, Daniel Wigdor, Michael Haller, and Chia Shen. 2008. Combining and Measuring the Benefts of Bimanual Pen and Direct-touch Interaction on Horizontal Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '08). ACM, New York, NY, USA, 154--161.  ",
      "doi": "10.1145/1385569.1385595"
    },
    {
      "text": "William Buxton and Brad A. Myers. 1986. A Study in Two-handed Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '86). ACM, New York, NY, USA, 321--326.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing Grounded Theory. SAGE Publications, Los Angeles, CA, USA.",
      "doi": ""
    },
    {
      "text": "Xiang 'Anthony' Chen, Julia Schwarz, Chris Harrison, Jennifer Mankof, and Scott E. Hudson. 2014. Air+Touch: Interweaving Touch & In-air Gestures. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 519--525.  ",
      "doi": "10.1145/2642918.2647392"
    },
    {
      "text": "Victor Cheung, Jens Heydekorn, Stacey Scott, and Raimund Dachselt. 2012. Revisiting Hovering: Interaction Guides for Interactive Surfaces. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, New York, NY, USA, 355--358.  ",
      "doi": "10.1145/2396636.2396699"
    },
    {
      "text": "Georg Freitag, Michael Tränkner, and Markus Wacker. 2012. Enhanced Feed-forward for a User Aware Multi-touch Device. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, New York, NY, USA, 578-- 586.  ",
      "doi": "10.1145/2399016.2399104"
    },
    {
      "text": "Saul Greenberg, Nicolai Marquardt, Till Ballendat, Rob Diaz-Marino, and Miaosen Wang. 2011. Proxemic Interactions: The New Ubicomp? Interactions 18, 1 (Jan. 2011), 42--50.  ",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "Tovi Grossman, Ken Hinckley, Patrick Baudisch, Maneesh Agrawala, and Ravin Balakrishnan. 2006. Hover Widgets: Using the Tracking State to Extend the Capabilities of Pen-operated Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 861--870.  ",
      "doi": "10.1145/1124772.1124898"
    },
    {
      "text": "Yves Guiard. 1987. Asymmetric division of labor in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behavior 19, 4 (1987), 486--517.",
      "doi": ""
    },
    {
      "text": "Edward T. Hall. 1966. The Hidden Dimension. Doubleday.",
      "doi": ""
    },
    {
      "text": "William Hamilton, Andruid Kerne, and Tom Robbins. 2012. Highperformance Pen + Touch Modality Interactions: A Real-time Strategy Game eSports Context. In Proc. ACM UIST. ACM, New York, NY, USA, 309--318.  ",
      "doi": "10.1145/2380116.2380156"
    },
    {
      "text": "Christian Heath, Jon Hindmarsh, and Paul Luf. 2010. Video in qualitative research. Sage Publications, Los Angeles, CA, USA.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Francois Guimbretiere, Patrick Baudisch, Raman Sarin, Maneesh Agrawala, and Ed Cutrell. 2006. The Springboard: Multiple Modes in One Spring-loaded Control. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 181--190.  ",
      "doi": "10.1145/1124772.1124801"
    },
    {
      "text": "Ken Hinckley, Seongkook Heo, Michel Pahud, Christian Holz, Hrvoje Benko, Abigail Sellen, Richard Banks, Kenton O'Hara, Gavin Smyth, and William Buxton. 2016. Pre-Touch Sensing for Mobile Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2869--2881.  ",
      "doi": "10.1145/2858036.2858095"
    },
    {
      "text": "Ken Hinckley, Michel Pahud, Hrvoje Benko, Pourang Irani, François Guimbretière, Marcel Gavriliu, Xiang 'Anthony' Chen, Fabrice Matulic, William Buxton, and Andrew Wilson. 2014. Sensing Techniques for Tablet+Stylus Interaction. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 605--614.  ",
      "doi": "10.1145/2642918.2647379"
    },
    {
      "text": "Ken Hinckley, Randy Pausch, Dennis Proftt, James Patten, and Neal Kassell. 1997. Cooperative Bimanual Action. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, New York, NY, USA, 27--34.  ",
      "doi": "10.1145/258549.258571"
    },
    {
      "text": "Ken Hinckley, Koji Yatani, Michel Pahud, Nicole Coddington, Jenny Rodenhouse, Andy Wilson, Hrvoje Benko, and Bill Buxton. 2010. Pen + Touch = New Tools. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, New York, NY, USA, 27--36.  ",
      "doi": "10.1145/1866029.1866036"
    },
    {
      "text": "Uta Hinrichs and Sheelagh Carpendale. 2011. Gestures in the Wild: Studying Multi-touch Gesture Sequences on Interactive Tabletop Exhibits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 3023--3032.  ",
      "doi": "10.1145/1978942.1979391"
    },
    {
      "text": "Eva Hornecker. 2008. \"I don't understand it either, but it is cool\"- Visitor Interactions with a Multi-Touch Table in a Museum. In 3rd IEEE International Workshop on Horizontal interactive human computer systems (TABLETOP). IEEE, 113--120.",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Giulio Jacucci, Ann Morrison, Gabriela T. Richard, Jari Kleimola, Peter Peltonen, Lorenza Parisi, and Toni Laitinen. 2010. Worlds of Information: Designing for Engagement at a Public Multi-touch Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2267--2276.  ",
      "doi": "10.1145/1753326.1753669"
    },
    {
      "text": "Krzysztof Tomasz Konecki. 2011. Visual grounded theory: A methodological outline and examples from empirical work. Revija za sociologiju 41, 2 (2011), 131--160.",
      "doi": ""
    },
    {
      "text": "Gordon Kurtenbach, George Fitzmaurice, Thomas Baudel, and Bill Buxton. 1997. The Design of a GUI Paradigm Based on Tablets, Twohands, and Transparency. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, New York, NY, USA, 35--42.  ",
      "doi": "10.1145/258549.258574"
    },
    {
      "text": "Celine Latulipe, Stephen Mann, Craig S. Kaplan, and Charlie L. A. Clarke. 2006. symSpline: Symmetric Two-handed Spline Manipulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 349--358.  ",
      "doi": "10.1145/1124772.1124825"
    },
    {
      "text": "Andrea Leganchuk, Shumin Zhai, and William Buxton. 1998. Manual and Cognitive Benefts of Two-handed Input: An Experimental Study. ACM Trans. Comput.-Hum. Interact. 5, 4 (Dec. 1998), 326--359.  ",
      "doi": "10.1145/300520.300522"
    },
    {
      "text": "Paul Luf and Christian Heath. 1998. Mobility in Collaboration. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work (CSCW '98). ACM, New York, NY, USA, 305--314.  ",
      "doi": "10.1145/289444.289505"
    },
    {
      "text": "Nic Lupfer, Andruid Kerne, Andrew M. Webb, and Rhema Linder. 2016. Patterns of Free-form Curation: Visual Thinking with Web Content. In Proceedings of the 2016 ACM on Multimedia Conference (MM '16). ACM, New York, NY, USA, 12--21.  ",
      "doi": "10.1145/2964284.2964303"
    },
    {
      "text": "Wendy E Mackay. 1990. Users and customizable software: A co-adaptive phenomenon. Ph.D. Dissertation. MIT.",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Ricardo Jota, Saul Greenberg, and Joaquim A. Jorge. 2011. The Continuous Interaction Space: Interaction Techniques Unifying Touch and Gesture on and above a Digital Surface. Springer Berlin Heidelberg, Berlin, Heidelberg, 461--476.",
      "doi": "10.5555/2042182.2042224"
    },
    {
      "text": "Fabrice Matulic and Moira C. Norrie. 2013. Pen and Touch Gestural Environment for Document Editing on Interactive Tabletops. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, New York, NY, USA, 41--50.  ",
      "doi": "10.1145/2512349.2512802"
    },
    {
      "text": "Microsoft Surface. 2012. https://www.microsoft.com/surface.",
      "doi": ""
    },
    {
      "text": "Ken Pfeufer, Ken Hinckley, Michel Pahud, and Bill Buxton. 2017. Thumb + Pen Interaction on Tablets. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3254--3266.  ",
      "doi": "10.1145/3025453.3025567"
    },
    {
      "text": "Henning Pohl and Roderick Murray-Smith. 2013. Focused and Casual Interactions: Allowing Users to Vary Their Level of Engagement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2223--2232.  ",
      "doi": "10.1145/2470654.2481307"
    },
    {
      "text": "Kathy Ryall, Clifton Forlines, Chia Shen, Meredith Ringel Morris, and Katherine Everitt. 2006. Experiences with and Observations of DirectTouch Tabletops. Tabletop 6 (2006), 89--96.  ",
      "doi": "10.1109/TABLETOP.2006.12"
    },
    {
      "text": "Abigail J. Sellen, Gordon P. Kurtenbach, and William A. S. Buxton. 1992. The Prevention of Mode Errors Through Sensory Feedback. Human-Computer Interaction 7, 2 (June 1992), 141--164.  ",
      "doi": "10.1207/s15327051hci0702_1"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage Publications, Los Angeles, CA, USA.",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Ivan E. Sutherland. 1964. Sketch Pad a Man-machine Graphical Communication System. In Proceedings of the SHARE Design Automation Workshop (DAC '64). ACM, New York, NY, USA, 6.329--6.346.  ",
      "doi": "10.1145/800265.810742"
    },
    {
      "text": "Julie Wagner, Stéphane Huot, and Wendy Mackay. 2012. BiTouch and BiPad: Designing Bimanual Interaction for Hand-held Tablets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2317--2326.  ",
      "doi": "10.1145/2207676.2208391"
    },
    {
      "text": "Andrew M. Webb. 2017. Phrasing Bimanual Interaction for Visual Design. Ph.D. Dissertation. Texas A&M University.",
      "doi": ""
    },
    {
      "text": "Andrew M. Webb, Andruid Kerne, Rhema Linder, Nic Lupfer, Yin Qu, Kade Keith, Matthew Carrasco, and Yvonne Chen. 2016. A Free-Form Medium for Curating the Digital. In Curating the Digital. Springer, 73--87.",
      "doi": ""
    },
    {
      "text": "Andrew M. Webb, Michel Pahud, Ken Hinckley, and Bill Buxton. 2016. Wearables As Context for Guiard-abiding Bimanual Touch. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 287--300.  ",
      "doi": "10.1145/2984511.2984564"
    },
    {
      "text": "Gerard Wilkinson, Ahmed Kharrufa, Jonathan Hook, Bradley Pursglove, Gavin Wood, Hendrik Haeuser, Nils Y. Hammerla, Steve Hodges, and Patrick Olivier. 2016. Expressy: Using a Wrist-worn Inertial Measurement Unit to Add Expressiveness to Touch-based Interactions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2832--2844.  ",
      "doi": "10.1145/2858036.2858223"
    },
    {
      "text": "Haijun Xia, Ken Hinckley, Michel Pahud, Xiao Tu, and Bill Buxton. 2017. WritLarge: Ink Unleashed by Unifed Scope, Action, & Zoom. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3227--3240.  ",
      "doi": "10.1145/3025453.3025664"
    },
    {
      "text": "Haijun Xia, Ricardo Jota, Benjamin McCanny, Zhe Yu, Clifton Forlines, Karan Singh, and Daniel Wigdor. 2014. Zero-latency Tapping: Using Hover Information to Predict Touch Locations and Eliminate Touchdown Latency. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 205--214.  ",
      "doi": "10.1145/2642918.2647348"
    }
  ]
}