{
  "doi": "10.1145/3290605.3300512",
  "title": "Privacy, Power, and Invisible Labor on Amazon Mechanical Turk",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Tasks on crowdsourcing platforms such as Amazon Mechanical Turk often request workers' personal information, raising privacy risks that may be exacerbated by requester-worker power dynamics. We interviewed 14 workers to understand how they navigate these risks. We found that Turkers' decisions to provide personal information during tasks were based on evaluations of the pay rate, the requester, the purpose, and the perceived sensitivity of the request. Participants also engaged in multiple privacy-protective behaviors, such as abandoning tasks or providing inaccurate data, though there were costs associated with these behaviors, such as wasted time and risk of rejection. Finally, their privacy concerns and practices evolved as they learned about both the platform and worker-designed tools and forums. These findings deepen our understanding of both privacy decision-making and invisible labor in paid crowdsourcing, and emphasize a general need to understand how privacy stances change over time.",
  "authors": [
    {
      "name": "Shruti Sannon",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-99659161275/rel-imgonly/ssannon.png",
      "acmid": "99659161275",
      "orcid": "0000-0002-2018-1190"
    },
    {
      "name": "Dan Cosley",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/do/10.1145/contrib-81100288358/rel-imgonly/3435035874_f9b2a1d423_o.jpg",
      "acmid": "81100288358",
      "orcid": "0000-0001-8108-1954"
    }
  ],
  "references": [
    {
      "text": "Ali Alkhatib, Michael S Bernstein, and Margaret Levi. 2017. Examining Crowd Work and Gig Work through the Historical Lens of Piecework. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4599--4616.  ",
      "doi": "10.1145/3025453.3025974"
    },
    {
      "text": "Ann Cavoukian. 2011. Privacy by Design in Law, Policy and Practice. A white paper for regulators, decision-makers and policy-makers (2011).",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2001. Qualitative Interviewing and Grounded Theory Analysis. 675--694.",
      "doi": ""
    },
    {
      "text": "Lydia B Chilton, John J Horton, Robert C Miller, and Shiri Azenkot. 2010. Task Search in a Human Computation Market. In Proceedings of the ACM SIGKDD Workshop on Human Computation. ACM, 1--9.  ",
      "doi": "10.1145/1837885.1837889"
    },
    {
      "text": "Mary J Culnan and Pamela K Armstrong. 1999. Information Privacy Concerns, Procedural Fairness, and Impersonal Trust: An Empirical Investigation. Organization Science 10, 1 (1999), 104--115.  ",
      "doi": "10.1287/orsc.10.1.104"
    },
    {
      "text": "Djellel Difallah, Elena Filatova, and Panos Ipeirotis. 2018. Demographics and dynamics of Mechanical Turk Workers. In Proceedings of the Eleventh ACM International Conference on Web Search and Data Mining. ACM, 135--143.  ",
      "doi": "10.1145/3159652.3159661"
    },
    {
      "text": "Djellel Eddine Difallah, Michele Catasta, Gianluca Demartini, Panagiotis G Ipeirotis, and Philippe Cudré-Mauroux. 2015. The Dynamics of Micro-task Crowdsourcing: The Case of Amazon MTurk. In Proceedings of the 24th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 238--247.  ",
      "doi": "10.1145/2736277.2741685"
    },
    {
      "text": "Alek Felstiner. 2011. Working the Crowd: Employment and Labor Law in the Crowdsourcing Industry. Berkeley J. Emp. & Lab. L. 32 (2011), 143.",
      "doi": ""
    },
    {
      "text": "Ujwal Gadiraju, Ricardo Kawase, and Stefan Dietze. 2014. A Taxonomy of Microtasks on the Web. In Proceedings of the 25th ACM Conference on Hypertext and Social Media. ACM, 218--223.  ",
      "doi": "10.1145/2631775.2631819"
    },
    {
      "text": "Barney G Glaser and Anselm L Strauss. 1967. The Discovery of Grounded Theory: Strategies for Qualitative Theory. New Brunswick: Aldine Transaction (1967).",
      "doi": ""
    },
    {
      "text": "Mary L Gray, Siddharth Suri, Syed Shoaib Ali, and Deepti Kulkarni. 2016. The Crowd is a Collaborative Network. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 134--147.  ",
      "doi": "10.1145/2818048.2819942"
    },
    {
      "text": "Kotaro Hara, Abigail Adams, Kristy Milland, Saiph Savage, Chris Callison-Burch, and Jeffrey P Bigham. 2018. A Data-Driven Analysis of Workers' Earnings on Amazon Mechanical Turk. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 449.  ",
      "doi": "10.1145/3173574.3174023"
    },
    {
      "text": "Lilly C Irani and M Silberman. 2013. Turkopticon: Interrupting Worker Invisibility in Amazon Mechanical Turk. In Proceedings of the 2013 CHI Conference on Human Factors in Computing Systems. ACM, 611--620.  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Thivya Kandappu, Vijay Sivaraman, Arik Friedman, and Roksana Boreli. 2013. Exposing and Mitigating Privacy Loss in Crowdsourced Survey Platforms. In Proceedings of the 2013 Workshop on Student Workhop (CoNEXT Student Workhop '13). ACM, New York, NY, USA, 13--16.  ",
      "doi": "10.1145/2537148.2537150"
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy Attitudes of Mechanical Turk Workers and the US Public. In Symposium on Usable Privacy and Security (SOUPS), Vol. 4. 1. ",
      "doi": "10.5555/3235838.3235842"
    },
    {
      "text": "Nicolas Kaufmann, Thimo Schulze, and Daniel Veit. 2011. More than Fun and Money: Worker Motivation in Crowdsourcing -- A Study on Mechanical Turk. In AMCIS, Vol. 11. 1--11.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Jeffrey V Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The Future of Crowd Work. In Proceedings of the 2013 Conference on Computer-Supported Cooperative Work. ACM, 1301--1318.  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Walter S Lasecki, Jeffrey M Rzeszotarski, Adam Marcus, and Jeffrey P Bigham. 2015. The Effects of Sequence and Delay on Crowd Work. In Proceedings of the 2015 ACM Conference on Human Factors in Computing Systems. ACM, 1375--1378.  ",
      "doi": "10.1145/2702123.2702594"
    },
    {
      "text": "Walter S Lasecki, Jaime Teevan, and Ece Kamar. 2014. Information extraction and manipulation threats in crowd-powered systems. In Proceedings of the 17th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 248--256.  ",
      "doi": "10.1145/2531602.2531733"
    },
    {
      "text": "Matthew Lease, Jessica Hullman, Jeffrey Bigham, Michael Bernstein, Juho Kim, Walter Lasecki, Saeideh Bakhshi, Tanushree Mitra, and Robert Miller. 2013. Mechanical Turk is not Anonymous. (2013).",
      "doi": ""
    },
    {
      "text": "J Lofland, D Snow, L Anderson, and LH Lofland. 2006. Analyzing Social Settings: A Guide to Qualitative Observation and Analysis. Wadsworth/Thomson Learning.",
      "doi": ""
    },
    {
      "text": "Jennifer Marlow and Laura A Dabbish. 2014. Who's the Boss?: Requester Transparency and Motivation in a Microtask Marketplace. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 2533--2538.  ",
      "doi": "10.1145/2559206.2581262"
    },
    {
      "text": "David Martin, Benjamin V Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a Turker. In Proceedings of the 17th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 224-- 235.  ",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Alice E Marwick and danah boyd. 2018. Understanding Privacy at the Margins -- Introduction. International Journal of Communication 12 (2018), 9.",
      "doi": ""
    },
    {
      "text": "Brian McInnis, Dan Cosley, Chaebong Nam, and Gilly Leshed. 2016. Taking a HIT: Designing around Rejection, Mistrust, Risk, and Workers' Experiences in Amazon Mechanical Turk. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2271-- 2282.  ",
      "doi": "10.1145/2858036.2858539"
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as Contextual Integrity. Washington Law Review 79 (2004), 119.",
      "doi": ""
    },
    {
      "text": "Sandra Petronio. 2012. Boundaries of Privacy: Dialectics of Disclosure. SUNY Press.",
      "doi": ""
    },
    {
      "text": "Shruti Sannon, Natalya N Bazarova, and Dan Cosley. 2018. Privacy Lies: Understanding How, When, and Why People Lie to Protect their Privacy in Multiple Online Contexts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 52.  ",
      "doi": "10.1145/3173574.3173626"
    },
    {
      "text": "Shruti Sannon and Dan Cosley. 2018. It was a shady HIT: Navigating Work-Related Privacy Concerns on MTurk. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW507.  ",
      "doi": "10.1145/3170427.3188511"
    },
    {
      "text": "Trebor Scholz. 2012. Digital labor: The Internet as Playground and Factory. Routledge. ",
      "doi": "10.5555/2432415"
    },
    {
      "text": "Aaron Smith. 2016. Gig work, online selling and home sharing. Pew Research Center 17 (2016).",
      "doi": ""
    },
    {
      "text": "Jai-Yeol Son and Sung S Kim. 2008. Internet Users' Information Privacyprotective Responses: A Taxonomy and a Nomological Model. MIS Quarterly (2008), 503--529. ",
      "doi": "10.5555/2017388.2017392"
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of Silence, Arenas of Voice: The Ecology of Visible and Invisible Work. Computer-Supported Cooperative Work (CSCW) 8, 1--2 (1999), 9--30.  ",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Latanya Sweeney. 2000. Simple demographics often identify people uniquely. Carnegie Mellon, Data Privacy Working Paper 3. Pittsburgh (2000), 1--34.",
      "doi": ""
    },
    {
      "text": "Amazon Mechanical Turk. 2018. Acceptable Use Policy. (2018). https: //www.mturk.com/worker/acceptable-use-policy",
      "doi": ""
    },
    {
      "text": "Huichuan Xia, Yang Wang, Yun Huang, and Anuj Shah. 2017. \"Our privacy needs to be protected at all costs\": Crowd workers' privacy experiences on Amazon Mechanical Turk. Proc. ACM Hum.-Comput. Interact 1 (2017).  ",
      "doi": "10.1145/3134748"
    },
    {
      "text": "Jie Yang, Carlo van der Valk, Tobias Hossfeld, Judith Redi, and Alessandro Bozzon. 2018. How do Crowdworker Communities and Microtask Markets Influence Each Other? A Data-driven Study on Amazon Mechanical Turk. Technical Report. Université de Fribourg.",
      "doi": ""
    },
    {
      "text": "Ming Yin, Mary L Gray, Siddharth Suri, and Jennifer Wortman Vaughan. 2016. The Communication Network Within the Crowd. In Proceedings of the 25th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 1293--1303.  ",
      "doi": "10.1145/2872427.2883036"
    }
  ]
}