{
  "doi": "10.1145/3290605.3300290",
  "title": "Integrated Workflows: Generating Feedback Between Digital and Physical Realms",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "As design thinking shifted away from conventional methods with the rapid adoption of computer-aided design and fabrication technologies, architects have been seeking ways to initiate a comprehensive dialogue between the virtual and the material realms. Current methodologies do not offer embodied workflows that utilize the feedback obtained through a subsequent transition process between physical and digital design. Therefore, narrowing the separation between these two platforms remains as a research problem. This literature review elaborates the divide between physical and digital design, testing and manufacturing techniques in the morphological process of architectural form. We first review the digital transformation in the architectural design discourse. Then, we proceed by introducing a variety of methods that are integrating digital and physical workflows and suggesting an alternative approach. Our work unveils that there is a need for empirical research with a focus on integrated approaches to create intuitively embodied experiences for architectural designers.",
  "authors": [
    {
      "name": "Emrecan Gulay",
      "institution": "Aalto University, Espoo, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365236",
      "orcid": "missing"
    },
    {
      "name": "Andrés Lucero",
      "institution": "Aalto University, Espoo, Finland",
      "img": "/do/10.1145/contrib-81314484387/rel-imgonly/81314484387.jpg",
      "acmid": "81314484387",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agkathidis, A. (2016). Generative design: form-finding techniques in architecture. London: Laurence King Publishing. https://ebookcentral.proquest.com/lib/aalto ebooks/detail.action?docID=4536981.",
      "doi": ""
    },
    {
      "text": "Akesson, D 2016, 'Using direct manipulation for real-time structural design exploration', Licentiate, Structural Mechanics, Lund.",
      "doi": ""
    },
    {
      "text": "Akkaladevi S.C., Plasch M., Eitzinger C., Maddukuri S.C., Rinner B. (2017) Towards Learning to Handle Deviations Using User Preferences in a Human Robot Collaboration Scenario. In: Basu A., Das S., Horain P., Bhattacharya S. (eds) Intelligent Human Computer Interaction. IHCI 2016. Lecture Notes in Computer Science, vol 10127. Springer, Cham",
      "doi": ""
    },
    {
      "text": "Anderson David, Frankel James L., Marks Joe, Agarwala Aseem, Beardsley Paul, Hodgins Jessica, Leigh Darren, Ryall Kathy, Sullivan Eddie, and Yedidia Jonathan S.. 2000. Tangible interaction + graphical interpretation: a new approach to 3D modeling. In Proceedings of the 27th annual conference on Computer graphics and interactive techniques (SIGGRAPH '00). ACM Press/AddisonWesley Publishing Co., New York, NY, USA, 393--402.  ",
      "doi": "10.1145/344779.344960"
    },
    {
      "text": "Arisandi Ryan, Takami Yusuke, Otsuki Mai, Kimura Asako, Shibata Fumihisa, and Tamura Hideyuki. 2012. Enjoying virtual handcrafting with ToolDevice. In Adjunct proceedings of the 25th annual ACM symposium on User interface software and technology (UIST Adjunct Proceedings '12). ACM, New York, NY, USA, 17--18.  ",
      "doi": "10.1145/2380296.2380306"
    },
    {
      "text": "Ashbrook Daniel, Guo Shitao Stan, and Lambie Alan. 2016. Towards Augmented Fabrication: Combining Fabricated and Existing Objects. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 1510--1518.  ",
      "doi": "10.1145/2851581.2892509"
    },
    {
      "text": "Bergdoll, B. and Christensen, P. (2008). Home delivery. New York: Museum of Modern Art.",
      "doi": ""
    },
    {
      "text": "Bhooshan Shajay and El Sayed Mostafa. 2011. Use of sub-division surfaces in architectural form-finding and procedural modelling. In Proceedings of the 2011 Symposium on Simulation for Architecture and Urban Design (SimAUD '11). Society for Computer Simulation International, San Diego, CA, USA, 60--67. ",
      "doi": "10.5555/2048536.2048544"
    },
    {
      "text": "Blackshaw Matthew, DeVincenzi Anthony, Lakatos David, Leithinger Daniel, and Ishii Hiroshi. 2011. Recompose: direct and gestural interaction with an actuated surface. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 1237--1242.  ",
      "doi": "10.1145/1979742.1979754"
    },
    {
      "text": "Blikstein Paulo and Krannich Dennis. 2013. The makers' movement and FabLabs in education: experiences, technologies, and research. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, New York, NY, USA, 613--616.  ",
      "doi": "10.1145/2485760.2485884"
    },
    {
      "text": "Blikstein Paulo, Berland Matthew and A. Deborah Fields the 6th Annual Conference FabLearn '16 Stanford, CA, USA Proceedings of the 6th Annual Conference on Creativity and Fabrication in Education - FabLearn '16 Creativity and Fabrication in Education (2016).9781450348027 ,http://dl.acm.org/citation.cfm?doid=3003397 ",
      "doi": ""
    },
    {
      "text": "Boring Sebastian, Gehring Sven, Wiethoff Alexander, Blöckner Anna Magdalena, Schöning Johannes, and Butz Andreas. 2011. Multi-user interaction on media facades through live video on mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2721--2724.  ",
      "doi": "10.1145/1978942.1979342"
    },
    {
      "text": "Bradner Erin, Iorio Francesco, and Davis Mark. 2014. Parameters tell the design story: ideation and abstraction in design optimization. In Proceedings of the Symposium on Simulation for Architecture & Urban Design (SimAUD '14), David Jason Gerber and Rhys Goldstein (Eds.). Society for Computer Simulation International, San Diego, CA, USA,, Article 26, 8 pages. ",
      "doi": "10.5555/2664323.2664349"
    },
    {
      "text": "Bryden, D. (2014). CAD and rapid prototyping for product design. London: Laurence King Pub.",
      "doi": ""
    },
    {
      "text": "Budig, M., Lim, J. and Petrovic, R. (2014). Integrating Robotic Fabrication in the Design Process. Architectural Design, 84(3), pp.2243.",
      "doi": ""
    },
    {
      "text": "Carpo, M. (2017). The second digital turn. Cambridge, MA: The MIT Press.",
      "doi": ""
    },
    {
      "text": "Clarke Allison. Design anthropology / Materials and Design by Susanne Küchler. Springer, Wien, 2011.",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi M.. 1996. Creativity: Flow and the Psychology of Discovery and Invention. HarperCollinsPublishers.",
      "doi": ""
    },
    {
      "text": "De Landa Manuel. The New Materiality. Architectural Design 85, 5 (2018), 16--21.",
      "doi": ""
    },
    {
      "text": "Deuss Mario, Panozzo Daniele, Whiting Emily, Liu Yang, Block Philippe, Hornung Olga Sorkine, and Pauly Mark. 2014. Assembling self-supporting structures. ACM Trans. Graph. 33, 6, Article 214 (November 2014), 10 pages.  ",
      "doi": "10.1145/2661229.2661266"
    },
    {
      "text": "Devendorf Laura and Rosner Daniela K.. 2017. Beyond Hybrids: Metaphors and Margins in Design. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 995--1000.  ",
      "doi": "10.1145/3064663.3064705"
    },
    {
      "text": "Dunn Nick. (2012). Digital fabrication in architecture. 1st ed. London: Laurence King Publishing.",
      "doi": ""
    },
    {
      "text": "Fjeld M., Bichsel M., Rauterberg M. (1998) BUILD-IT: An intuitive design tool based on direct object manipulation. In: Wachsmuth I., Fröhlich M. (eds) Gesture and Sign Language in Human-Computer Interaction. GW 1997. Lecture Notes in Computer Science, vol 1371. Springer, Berlin, Heidelberg ",
      "doi": "10.5555/647590.728564"
    },
    {
      "text": "Follmer Sean, Leithinger Daniel, Olwal Alex, Hogge Akimitsu, and Ishii Hiroshi. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Frazer, J. (1995). An evolutionary architecture. 1st ed. London: Architectural Association.",
      "doi": ""
    },
    {
      "text": "Frishberg N (2006) Prototyping with junk. Interactions 13(1): 21--23  ",
      "doi": "10.1145/1109069.1109086"
    },
    {
      "text": "Gehring, S. & Wiethoff, A. Informatik Spektrum (2014) 37: 474.",
      "doi": ""
    },
    {
      "text": "Golsteijn Connie, Hoven Elise, Frohlich David, and Sellen Abigail. 2014. Hybrid crafting: towards an integrated practice of crafting with physical and digital components. Personal Ubiquitous Comput. 18, 3 (March 2014), 593--611.  ",
      "doi": "10.1007/s00779-013-0684-9"
    },
    {
      "text": "Gramazio Fabio, and Kohler Matthias, Made by Robots: Challenging Architecture at a Larger Scale, John Wiley & Sons, Incorporated, 2014. ProQuest Ebook Central, https://ebookcentral.proquest.com/lib/aaltoebooks/detail.action?docID=1689317.",
      "doi": ""
    },
    {
      "text": "Groth Camilla. Making Sense Through Hands: Design and Craft Practice Analysed as Embodied Cognition. Aalto University publication series DOCTORAL DISSERTATIONS, 1/2017, Helsinki, 2017.",
      "doi": ""
    },
    {
      "text": "Gulay, E. A Mobius Process: Digital Dimensions. Issuu, 2018. https://issuu.com/emrecangulay/docs/a_mobius_process__digital_dimensio.",
      "doi": ""
    },
    {
      "text": "Hull Carmen and Willett Wesl ey. 2017. Building with Data: Architectural Models as Inspiration for Data Physicalization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 12171264.  ",
      "doi": "10.1145/3025453.3025850"
    },
    {
      "text": "Igarashi Takeo, Matsuoka Satoshi, and Tanaka Hidehiko. 1999. Teddy: a sketching interface for 3D freeform design. In Proceedings of the 26th annual conference on Computer graphics and interactive techniques (SIGGRAPH '99). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 409--416.  ",
      "doi": "10.1145/311535.311602"
    },
    {
      "text": "Ishii Hiroshi and Ullmer Brygg. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems (CHI '97). ACM, New York, NY, USA, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Iwamoto, L. (2013). Digital fabrications. 1st ed. New York, NY: Princeton Architectural Press.",
      "doi": ""
    },
    {
      "text": "Jacobs Jennifer and Buechley Leah. 2013. Codeable objects: computational design and digital fabrication for novice programmers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1589--1598.  ",
      "doi": "10.1145/2470654.2466211"
    },
    {
      "text": "Jansen Yvonne, Dragicevic Pierre, and Fekete Jean-Daniel. 2013. Evaluating the efficiency of physical visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2593--2602.  ",
      "doi": "10.1145/2470654.2481359"
    },
    {
      "text": "Jansen Yvonne, Dragicevic Pierre, Isenberg Petra, Alexander Jason, Karnik Abhijit, Kildal Johan, Subramanian Sriram, and Hornbæk Kasper. 2015. Opportunities and Challenges for Data Physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3227--3236.  ",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Janssen, P., Frazer, J. & Ming-xi, T. Applied Intelligence (2002) 16: 119.  ",
      "doi": "10.1023/A%3A1013618703385"
    },
    {
      "text": "Knippers, J. and Speck, T. (2012). Design and construction principles in nature and architecture. Bioinspiration & Biomimetics, 7(1), p.015002.",
      "doi": ""
    },
    {
      "text": "Kolarevic, B. (2003). Architecture in the digital age. 1st ed. New York: Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Kolarevic, B. (2010). Performative architecture. 1st ed. New York: Spon Press.",
      "doi": ""
    },
    {
      "text": "Kolarevic, B. and Klinger, K. (2013). Manufacturing Material Effects: Rethinking Design and Making in Architecture. 1st ed. Routledge.",
      "doi": ""
    },
    {
      "text": "Konakovic Mina, Crane Keenan, Deng Bailin, Bouaziz Sofien, Piker Daniel, and Pauly Mark. 2016. Beyond developable: computational design and fabrication with auxetic materials. ACM Trans. Graph. 35, 4, Article 89 (July 2016), 11 pages.  ",
      "doi": "10.1145/2897824.2925944"
    },
    {
      "text": "Le Corbusier and Etchells, F. (1987). Towards a new architecture. 2nd ed. London: Butterworth-Heinemann.",
      "doi": ""
    },
    {
      "text": "Leithinger Daniel and Ishii Hiroshi. 2010. Relief: a scalable actuated shape display. In Proceedings of the fourth international conference on Tangible, embedded, and embodied interaction (TEI '10). ACM, New York, NY, USA, 221--222.  ",
      "doi": "10.1145/1709886.1709928"
    },
    {
      "text": "Leithinger Daniel, Lakatos Dávid DeVincenzi, Anthony, and Blackshaw Matthew. 2011. Recompose: direct and gestural interaction with an actuated surface. In ACM SIGGRAPH 2011 Emerging Technologies (SIGGRAPH '11). ACM, New York, NY, USA, Article 13, 1 pages.  ",
      "doi": "10.1145/2048259.2048272"
    },
    {
      "text": "Loke Lian and Robertson Toni. 2011. The lived body in design: mapping the terrain. In Proceedings of the 23rd Australian Computer-Human Interaction Conference (OzCHI '11). ACM, New York, NY, USA, 181--184.  ",
      "doi": "10.1145/2071536.2071565"
    },
    {
      "text": "Lucero A. (2015) Funky-Design-Spaces: Interactive Environments for Creativity Inspired by Observing Designers Making Mood Boards. In: Abascal J., Barbosa S., Fetter M., Gross T., Palanque P., Winckler M. (eds) Human-Computer Interaction -- INTERACT 2015. INTERACT 2015. Lecture Notes in Computer Science, vol 9298. Springer, Cham.  ",
      "doi": "10.1007/978-3-319-22698-9_32"
    },
    {
      "text": "Lucero Andrés. 2012. Framing, aligning, paradoxing, abstracting, and directing: how design mood boards work. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 438--447.  ",
      "doi": "10.1145/2317956.2318021"
    },
    {
      "text": "Lynn, G., Kelly, T., 1999. Animate form. Animate Form 9--43.",
      "doi": ""
    },
    {
      "text": "Maher Mary Lou (2008). Creativity, Computation, and Interaction. CHI 2008, (ACM 978--1--60558-011--1).",
      "doi": ""
    },
    {
      "text": "Maher, M., Lee, L., S. Gero, J., Yu, R. and Clausner, T. (2016). Design Computing and Cognition '16: Characterizing Tangible Interaction During a Creative Combination Task. 1st ed.",
      "doi": ""
    },
    {
      "text": "MANSUTTI, A. (2017). Tactile display for virtual 3d shape rendering.: SPRINGER INTERNATIONAL PU. ",
      "doi": "10.5555/3092624"
    },
    {
      "text": "Marble, S. (2012). Digital workflows in architecture. Barcelona: Actarbirkhauser.",
      "doi": ""
    },
    {
      "text": "McCullough Malcom. Abstracting craft. MIT Press, Cambridge, Mass., 1998. ",
      "doi": "10.5555/521472"
    },
    {
      "text": "Melcer Edward and Isbister Katherine. 2016. Motion, Emotion, and Form: Exploring Affective Dimensions of Shape. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 14301437.  ",
      "doi": "10.1145/2851581.2892361"
    },
    {
      "text": "Mellis David, Follmer Sean, Hartmann Björn, Buechley Leah, and Gross Mark D.. 2013. FAB at CHI: digital fabrication tools, design, and community. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 33073310.  ",
      "doi": "10.1145/2468356.2479673"
    },
    {
      "text": "Menges, A. (2006). Instrumental geometry. Architectural Design, 76(2), pp.42--53.",
      "doi": ""
    },
    {
      "text": "Menges, A. (2015). Fusing the Computational and the Physical: Towards a Novel Material Culture. Architectural Design, 85(5), pp.815.",
      "doi": ""
    },
    {
      "text": "Mitani Jun and Suzuki Hiromasa. 2004. Making papercraft toys from meshes using strip-based approximate unfolding. ACM Trans. Graph. 23, 3 (August 2004), 259--263.  ",
      "doi": "10.1145/1015706.1015711"
    },
    {
      "text": "Mueller Stefanie, Kruck Bastian, Baudisch Patrick. 2014. Laser origami: laser-cutting 3D objects. interactions 21, 2 (March 2014), 3641.  ",
      "doi": "10.1145/2567782"
    },
    {
      "text": "Nakagaki Ken, Vink Luke, Counts Jared, Windham Daniel, Leithinger Daniel, Follmer Sean, and Ishii Hiroshi. 2016. Materiable: Rendering Dynamic Material Properties in Response to Direct Physical Touch with Shape Changing Interfaces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2764--2772.  ",
      "doi": "10.1145/2858036.2858104"
    },
    {
      "text": "Niiyama, R. (2008). Gemotion Screen: A Generative, Emotional, Interactive 3D Display. ASIAGRAPH 2008 PROCEEDINGS.",
      "doi": ""
    },
    {
      "text": "Oxman, R. (2008). Digital architecture as a challenge for design pedagogy: theory, knowledge, models and medium. Design Studies, 29(2), pp.99--120.",
      "doi": ""
    },
    {
      "text": "Pallasmaa J.. 1996. The Eyes of the Skin: Architecture of the Senses. Wiley. Retrieved from https://books.google.fi/books?id=Ls9zQgAACAAJ",
      "doi": ""
    },
    {
      "text": "Paterson, M. (2007). The senses of touch. 1st ed. Oxford: Berg.",
      "doi": ""
    },
    {
      "text": "Peng Huaishu, Zoran Amit, and Guimbretière François V.. 2015. DCoil: A Hands-on Approach to Digital 3D Models Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1807--1815.  ",
      "doi": "10.1145/2702123.2702381"
    },
    {
      "text": "Piper Ben, Ratti Carlo, and Ishii Hiroshi. 2002. Illuminating clay: a 3D tangible interface for landscape analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 355--362.  ",
      "doi": "10.1145/503376.503439"
    },
    {
      "text": "Pohl Ingrid Maria and Loke Lian. 2014. Touch toolkit: a method to convey touch-based design knowledge and skills. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, New York, NY, USA, 251--258.  ",
      "doi": "10.1145/2540930.2540957"
    },
    {
      "text": "Poulsgaard K.S., Malafouris L. (2017) Models, Mathematics and Materials in Digital Architecture. In: Cowley S., Vallée-Tourangeau F. (eds) Cognition Beyond the Brain. Springer, Cham",
      "doi": ""
    },
    {
      "text": "Rasmussen Majken K., Pedersen Esben W., Petersen Marianne G., and Hornbæk Kasper. 2012. Shape-changing interfaces: a review of the design space and open research questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 735--744.  ",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Reichert, S., Schwinn, T., La Magna, R., Waimer, F., Knippers, J. and Menges, A. (2014). Fibrous structures: An integrative approach to design computation, simulation and fabrication for lightweight, glass and carbon fibre composite structures in architecture based on biomimetic design principles. Computer-Aided Design, 52, pp.27--39.",
      "doi": ""
    },
    {
      "text": "Rieffel John and Pollack Jordan. 2005. Automated assembly as situated development: using artificial ontogenies to evolve buildable 3-D objects. In Proceedings of the 7th annual conference on Genetic and evolutionary computation (GECCO '05), Hans-Georg Beyer (Ed.). ACM, New York, NY, USA, 99--106.  ",
      "doi": "10.1145/1068009.1068023"
    },
    {
      "text": "Scerbo Siroberto and Bowman Doug. 2012. Design issues when using commodity gaming devices for virtual object manipulation. In Proceedings of the International Conference on the Foundations of Digital Games (FDG '12). ACM, New York, NY, USA, 294--295.  ",
      "doi": "10.1145/2282338.2282406"
    },
    {
      "text": "Schleicher, Simon & Rastetter, Andrew & La Magna, Riccardo & Schönbrunner, Andreas & Haberbosch, Nicola & Knippers, Jan. (2015). Form-Finding and Design Potentials of Bending-Active Plate Structures.",
      "doi": ""
    },
    {
      "text": "Schneegass Stefan, Shirazi Alireza Sahami, Döring Tanja, Schmid David, and Schmidt Albrecht. 2014. NatCut: an interactive tangible editor for physical object fabrication. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 1441--1446.  ",
      "doi": "10.1145/2559206.2581189"
    },
    {
      "text": "Sheng Jia, Balakrishnan Ravin, and Singh Karan. 2006. An interface for virtual 3D sculpting via physical proxy. In Proceedings of the 4th international conference on Computer graphics and interactive techniques in Australasia and Southeast Asia (GRAPHITE '06). ACM, New York, NY, USA, 213--220.  ",
      "doi": "10.1145/1174429.1174467"
    },
    {
      "text": "Sing Keng Hua and Xie Wei. 2016. Garden: A Mixed Reality Experience Combining Virtual Reality and 3D Reconstruction. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 180--183.  ",
      "doi": "10.1145/2851581.2890370"
    },
    {
      "text": "Song Hyunyoung, Guimbretière François, Hu Chang, and Lipson Hod. 2006. ModelCraft: capturing freehand annotations and edits on physical 3D models. In Proceedings of the 19th annual ACM symposium on User interface software and technology (UIST '06). ACM, New York, NY, USA, 13--22.  ",
      "doi": "10.1145/1166253.1166258"
    },
    {
      "text": "Stavric, M., Sidanin, P. and Tepavcevic, B. (2013). Architectural Scale Models in the Digital Age. 1st ed. Vienna: Springer Vienna.",
      "doi": ""
    },
    {
      "text": "Stusak Simon. 2015. Exploring the Potential of Physical Visualizations. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 437--440.  ",
      "doi": "10.1145/2677199.2691604"
    },
    {
      "text": "Swaminathan Saiganesh, Shi Conglei, Jansen Yvonne, Dragicevic Pierre, Oehlberg Lora, and Fekete Jean-Daniel. 2014. Creating physical visualizations with makervis. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 543--546.  ",
      "doi": "10.1145/2559206.2574788"
    },
    {
      "text": "SYMEONIDOU, I. (2015). Analogue and digital form-finding of bending rod structures. Proceedings of IASS Annual Symposia, 2015(20).",
      "doi": ""
    },
    {
      "text": "Terrenghi Lucia, Kirk David, Sellen Abigail, and Izadi Shahram. 2007. Affordances for manipulation of physical versus digital media on interactive surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1157--1166.  ",
      "doi": "10.1145/1240624.1240799"
    },
    {
      "text": "Terzidis, K. (2016). Algorithmic architecture. 1st ed.: Routledge. ",
      "doi": "10.5555/1212925"
    },
    {
      "text": "Terzopoulos Demetri, Platt John, Barr Alan, and Fleischer Kurt. 1987. Elastically deformable models. SIGGRAPH Comput. Graph. 21, 4 (August 1987), 205--214.  ",
      "doi": "10.1145/37402.37427"
    },
    {
      "text": "Tian Rundong, Sterman Sarah, Chiou Ethan, Warner Jeremy, and Paulos Eric. 2018. MatchSticks: Woodworking through Improvisational Digital Fabrication. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 149, 12 pages.  ",
      "doi": "10.1145/3173574.3173723"
    },
    {
      "text": "Torres Cesar and Paulos Eric. 2015. MetaMorphe: Designing Expressive 3D Models for Digital Fabrication. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (C&C '15). ACM, New York, NY, USA, 73--82.  ",
      "doi": "10.1145/2757226.2757235"
    },
    {
      "text": "Tseng Tiffany and Tsai Geoff. 2015. Process Products: Capturing Design Iteration with Digital Fabrication. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 631--636.  ",
      "doi": "10.1145/2677199.2687891"
    },
    {
      "text": "Vogel, D. (2012). Form+Code in Design, Art, and Architecture, by Casey Reas, Chandler McWilliams, and LUST. Journal of Mathematics and the Arts, 6(4), pp.221--223.",
      "doi": ""
    },
    {
      "text": "Weichel Christian, Alexander Jason, Karnik Abhijit, and Gellersen Hans. 2015. SPATA: Spatio-Tangible Tools for Fabrication-Aware Design. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 189--196.  ",
      "doi": "10.1145/2677199.2680576"
    },
    {
      "text": "Weichel Christian, Hardy John, Alexander Jason, and Gellersen Hans. 2015. ReForm: Integrating Physical and Digital Design through Bidirectional Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 93--102.  ",
      "doi": "10.1145/2807442.2807451"
    },
    {
      "text": "Weizenbaum, J. (1991). Computer power and human reason. San Francisco, Ca.: S.H. Freeman.",
      "doi": ""
    },
    {
      "text": "Wiethoff Alexander and Gehring Sven. 2012. Designing interaction with media façades: a case study. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 308--317.  ",
      "doi": "10.1145/2317956.2318004"
    },
    {
      "text": "Willis Karl D.D., Xu Cheng, Wu Kuan-Ju, Levin Golan, and Gross Mark D.. 2010. Interactive fabrication: new interfaces for digital fabrication. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11). ACM, New York, NY, USA, 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "Willmann J., Gramazio F., Kohler M., Langenberg S. (2013) Digital by Material. In: Brell-Çokcan S., Braumann J. (eds) Rob | Arch 2012. Springer, Vienn",
      "doi": ""
    },
    {
      "text": "Wrensch Tom, Blauvelt Glenn, and Eisenberg Mike. 2000. The rototack: designing a computationally-enhanced craft item. In Proceedings of DARE 2000 on Designing augmented reality environments (DARE '00). ACM, New York, NY, USA, 93--101.  ",
      "doi": "10.1145/354666.354676"
    },
    {
      "text": "Yamamoto Takuya, Kawagoe Maho, Otsuki Mai, Shibata Fumihisa, and Kimura Asako. 2017. Enjoyable carving with ChiselDevice in mixed reality space. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology (VRST '17). ACM, New York, NY, USA, Article 59, 2 pages.  ",
      "doi": "10.1145/3139131.3143419"
    },
    {
      "text": "Yaneva Albena. 2005. Scaling Up and Down: Extraction Trials in Architectural Design. Social Studies of Science 35, 6: 867--894.",
      "doi": ""
    },
    {
      "text": "Yoshida Hironori, Igarashi Takeo, Obuchi Yusuke, Takami Yosuke, Sato Jun, Araki Mika, Miki Masaaki, Nagata Kosuke, Sakai Kazuhide, and Igarashi Syunsuke. 2015. Architecture-scale human-assisted additive manufacturing. ACM Trans. Graph. 34, 4, Article 88 (July 2015), 8 pages.  ",
      "doi": "10.1145/2766951"
    },
    {
      "text": "Yvette, H. Touching for Knowing; Cognitive Psychology of Haptic Manual Perception. John Benjamins, Amsterdam, 2003.",
      "doi": ""
    },
    {
      "text": "Zheng Clement and Nitsche Michael. 2017. Combining Practices in Craft and Design. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, New York, NY, USA, 331--340.  ",
      "doi": "10.1145/3024969.3024973"
    },
    {
      "text": "Zheng Clement, Do Ellen Yi-Luen, and Budd Jim. 2017. Joinery: Parametric Joint Generation for Laser Cut Assemblies. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition (C&C '17). ACM, New York, NY, USA, 63--74.  ",
      "doi": "10.1145/3059454.3059459"
    },
    {
      "text": "Zoran Amit and Paradiso Joseph A.. 2013. FreeD: a freehand digital sculpting tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2613--2616.  ",
      "doi": "10.1145/2470654.2481361"
    },
    {
      "text": "Zoran Amit. 2015. Hybrid craft: showcase of physical and digital integration of design and craft skills. In ACM SIGGRAPH Art Gallery (SIGGRAPH '15). ACM, New York, NY, USA, 384--398.  ",
      "doi": "10.1145/2810185.2810187"
    }
  ]
}