{
  "doi": "10.1145/3290605.3300685",
  "title": "Designing for Reproducibility: A Qualitative Study of Challenges and Opportunities in High Energy Physics",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Reproducibility should be a cornerstone of scientific research and is a growing concern among the scientific community and the public. Understanding how to design services and tools that support documentation, preservation and sharing is required to maximize the positive impact of scientific research. We conducted a study of user attitudes towards systems that support data preservation in High Energy Physics, one of science's most data-intensive branches. We report on our interview study with 12 experimental physicists, studying requirements and opportunities in designing for research preservation and reproducibility. Our findings suggest that we need to design for motivation and benefits in order to stimulate contributions and to address the observed scalability challenge. Therefore, researchers' attitudes towards communication, uncertainty, collaboration and automation need to be reflected in design. Based on our findings, we present a systematic view of user needs and constraints that define the design space of systems supporting reproducible practices.",
  "tags": [
    "reproducible research",
    "interview study",
    "design requirements",
    "secondary usage forms"
  ],
  "authors": [
    {
      "name": "Sebastian S. Feger",
      "institution": "Ludwig Maximilian University of Munich & CERN, Munich, Germany",
      "img": "/do/10.1145/contrib-99659365234/rel-imgonly/portrait_2019_closer.jpg",
      "acmid": "99659365234",
      "orcid": "0000-0002-0287-0945"
    },
    {
      "name": "Sünje Dallmeier-Tiessen",
      "institution": "CERN, Geneva, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556913256",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "Ludwig Maximilian University of Munich, Munich, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    },
    {
      "name": "Paweł W. Woźniak",
      "institution": "Utrecht University, Utrecht, Netherlands",
      "img": "/do/10.1145/contrib-87958813957/rel-imgonly/pawel_cropped.jpg",
      "acmid": "87958813957",
      "orcid": "0000-0003-3670-1813"
    }
  ],
  "references": [
    {
      "text": "ACM. 2018. Artifact Review and Badging. Website. (April 2018). https://www.acm.org/publications/policies/artifact-review-badging Retrieved September 10, 2018.",
      "doi": ""
    },
    {
      "text": "Monya Baker. 2016. 1,500 scientists lift the lid on reproducibility. Nature 533, 7604 (2016), 452--454.",
      "doi": ""
    },
    {
      "text": "Anna Bánáti, Péter Kacsuk, and Miklós Kozlovszky. 2015. Four level provenance support to achieve portable reproducibility of scientific workflows. 2015 38th International Convention on Information and Communication Technology, Electronics and Microelectronics, MIPRO 2015 - Proceedings (2015), 241--244.",
      "doi": ""
    },
    {
      "text": "Sean Bechhofer, Iain Buchan, David De Roure, Paolo Missier, John Ainsworth, Jiten Bhagat, Philip Couch, Don Cruickshank, Mark Delderfield, Ian Dunlop, Matthew Gamble, Danius Michaelides, Stuart Owen, David Newman, Shoaib Sufi, and Carole Goble. 2013. Why linked data is not enough for scientists. Future Generation Computer Systems 29, 2 (2013), 599--611.  ",
      "doi": "10.1016/j.future.2011.08.004"
    },
    {
      "text": "C. Glenn Begley and Lee M. Ellis. 2012. Drug development: Raise standards for preclinical cancer research. Nature 483, 7391 (2012), 531-- 3. arXiv:arXiv:cond-mat/9907372v1",
      "doi": ""
    },
    {
      "text": "Khalid Belhajjame, Jun Zhao, Daniel Garijo, Kristina Hettne, Raul Palma, Óscar Corcho, José-Manuel Gómez-Pérez, Sean Bechhofer, Graham Klyne, and Carole Goble. 2014. The Research Object Suite of Ontologies: Sharing and Exchanging Research Data and Methods on the Open Web. arXiv preprint arXiv: 1401.4307 February 2014 (2014), 20. arXiv:1401.4307 http://arxiv.org/abs/1401.4307",
      "doi": ""
    },
    {
      "text": "Gordon Bell, Jim Gray, and Alex Szalay. 2006. Petascale Computational Systems: Balanced Cyber-Infrastructure in a Data-Centric World. IEEE Computer 39 (2006), 110--113.  ",
      "doi": "10.1109/MC.2006.29"
    },
    {
      "text": "Richard Bentley, Thilo Horstmann, Klaas Sikkel, and Jonathan Trevor. 1995. Supporting collaborative information sharing with the World Wide Web: The BSCW shared workspace system. In Proceedings of the 4th International WWW Conference, Vol. 1. 63--74.",
      "doi": ""
    },
    {
      "text": "Tim Berners-Lee, Robert Cailliau, Jean-Francois Groff, and Bernd Pollermann. 1992. World-wide web: The information universe., 52--58 pages.",
      "doi": ""
    },
    {
      "text": "Ann Blandford, Dominic Furniss, and Stephann Makri. 2016. Qualitative HCI Research: Going Behind the Scenes. Morgan & Claypool Publishers, 51--60. ",
      "doi": "10.5555/3019315"
    },
    {
      "text": "Ronald F Boisvert. 2016. Incentivizing reproducibility. Commun. ACM 59, 10 (2016), 5--5.  ",
      "doi": "10.1145/2994031"
    },
    {
      "text": "Philippe Bonnet, Stefan Manegold, and Matias Bjørling. 2011. Repeatability and workability evaluation of SIGMOD 2011. ACM SIGMOD ... (2011), 45--48.  ",
      "doi": "10.1145/2034863.2034873"
    },
    {
      "text": "Christine L Borgman. 2007. Scholarship in the digital age: information, infrastructure, and the internet. MIT Press, Cambridge, MA. ",
      "doi": "10.5555/1324796"
    },
    {
      "text": "Nadia Boukhelifa, Marc-Emmanuel Perrin, Samuel Huron, and James Eagan. 2017. How Data Workers Cope with Uncertainty: A Task Characterisation Study. Chi '17 (2017), 3645--3656.  ",
      "doi": "10.1145/3025453.3025738"
    },
    {
      "text": "Christopher S. Campbell, Paul P. Maglio, Alex Cozzi, and Byron Dom. 2003. Expertise identification using email communications. Cikm 2003 January (2003), 528--531.  ",
      "doi": "10.1145/956863.956965"
    },
    {
      "text": "CERN. 2013. The birth of the web. Website. (Dec 2013). http://cds.cern.ch/record/1998446 Retrieved March 15, 2018.",
      "doi": ""
    },
    {
      "text": "CERN. 2017. CERN Annual Personnel Statistics 2017. (2017). https://cds.cern.ch/record/2317058 Personnel Statistics 2017.",
      "doi": ""
    },
    {
      "text": "Kyle Chard, Jim Pruyne, Ben Blaiszik, Rachana Ananthakrishnan, Steven Tuecke, and Ian Foster. 2015. Globus data publication as a service: Lowering barriers to reproducible science. In Proceedings 11th IEEE International Conference on eScience, eScience 2015. 401--410.  ",
      "doi": "10.1109/eScience.2015.68"
    },
    {
      "text": "Xiaoli Chen, Sünje Dallmeier-Tiessen, Anxhela Dani, Robin Dasler, Javier Delgado Fernández, Pamfilos Fokianos, Patricia Herterich, and Tibor Simko. 2016. CERN Analysis Preservation: A Novel Digital Library Service to Enable Reusable and Reproducible Research. In International Conference on Theory and Practice of Digital Libraries. Springer, 347--356.",
      "doi": ""
    },
    {
      "text": "Adrian Cho. 2011. Particle Physicists' New Extreme Teams. Science 333, 6049 (2011), 1564--1567. arXiv:http://science.sciencemag.org/content/333/6049/1564.full.pdf",
      "doi": ""
    },
    {
      "text": "Open Science Collaboration. 2012. An Open, Large-Scale, Collaborative Effort to Estimate the Reproducibility of Psychological Science. Perspectives on Psychological Science 7, 6 (2012), 657--660.",
      "doi": ""
    },
    {
      "text": "Rob Cross and Jonathon N. Cummings. 2004. Tie and network correlates of individual performance in knowledge-intensive work. Academy of Management Journal 47, 6 (2004), 928--937.",
      "doi": ""
    },
    {
      "text": "Alessandro Delfanti. 2016. Beams of particles and papers: How digital preprint archives shape authorship and credit. Social Studies of Science 46, 4 (2016), 629--645. arXiv:http://dx.doi.org/10.1177/0306312716659373",
      "doi": ""
    },
    {
      "text": "Chris Drummond. 2009. Replicability is not reproducibility: Nor is it good science. Proceedings of the Evaluation Methods for Machine Learning Workshop 26th International Conference for Machine Learning 2005 (2009), 1--4.",
      "doi": ""
    },
    {
      "text": "Kate Ehrlich, Ching-Yung Lin, and Vicky Griffiths-Fisher. 2007. Searching for experts in the enterprise: combining text and social network analysis. In Proceedings of the 2007 international ACM conference on Supporting group work. ACM, 117--126.  ",
      "doi": "10.1145/1316624.1316642"
    },
    {
      "text": "Lyndon Evans and Philip Bryant. 2008. LHC Machine. Journal of Instrumentation 3, 08 (2008), S08001.",
      "doi": ""
    },
    {
      "text": "Davide Falessi, Giovanni Cantone, and Martin Becker. 2006. Documenting design decision rationale to improve individual and team design decision making: an experimental evaluation. In Proceedings of the 2006 ACM/IEEE international symposium on Empirical software engineering. ACM, 134--143.  ",
      "doi": "10.1145/1159733.1159755"
    },
    {
      "text": "Dror G. Feitelson. 2015. From Repeatability to Reproducibility and Corroboration. ACM SIGOPS Operating Systems Review 49, 1 (2015), 3--11.  ",
      "doi": "10.1145/2723872.2723875"
    },
    {
      "text": "FORCE11. 2014. The FAIR data principles. Website. Retrieved August 8, 2017 from https://www.force11.org/group/fairgroup/fairprinciples.",
      "doi": ""
    },
    {
      "text": "Mélissa Gaillard and Stefania Pandolfi. 2017. CERN Data Centre passes the 200-petabyte milestone. (Jul 2017). http://cds.cern.ch/record/",
      "doi": ""
    },
    {
      "text": "Kristian Garza, Carole Goble, John Brooke, and Caroline Jay. 2015. Framing the Community Data System Interface. In Proceedings of the 2015 British HCI Conference (British HCI '15). ACM, New York, NY, USA, 269--270.  ",
      "doi": "10.1145/2783446.2783605"
    },
    {
      "text": "Anne Gentil-Beccot, Salvatore Mele, and Travis C. Brooks. 2010. Citing and reading behaviours in high-energy physics. Scientometrics 84, 2 (2010), 345--355. arXiv:0906.5418",
      "doi": ""
    },
    {
      "text": "Omar S. Gómez, Natalia Juristo, and Sira Vegas. 2010. Replications types in experimental disciplines. In Proceedings of the 2010 ACMIEEE International Symposium on Empirical Software Engineering and Measurement - ESEM '10. 1.  ",
      "doi": "10.1145/1852786.1852790"
    },
    {
      "text": "Gopakumar Gopalakrishnan, Krupa Benhur, Abhishek Kaushik, and Anjaneyulu Passala. 2017. Professional Network Analytics Platform for Enterprise Collaboration. Cscw 2017 (2017), 5--8.  ",
      "doi": "10.1145/3022198.3023264"
    },
    {
      "text": "Christian Greiffenhagen and Stuart Reeves. 2013. Is Replication important for HCI? CEUR Workshop Proceedings 976 (2013), 8--13.",
      "doi": ""
    },
    {
      "text": "Hans Ake Gustafsson. 2006. LHC experiments. Nuclear Physics A 774, 1--4 (2006), 361--368.",
      "doi": ""
    },
    {
      "text": "Radu Jianu and David Laidlaw. 2012. An Evaluation of How Small User Interface Changes Can Improve Scientists' Analytic Strategies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2953--2962.  ",
      "doi": "10.1145/2207676.2208704"
    },
    {
      "text": "Mallory C. Kidwell, Ljiljana B. Lazarevic, Erica Baranski, Tom E. Hardwicke, Sarah Piechowski, Lina Sophia Falkenberg, Curtis Kennett, Agnieszka Slowik, Carina Sonnleitner, Chelsey Hess-Holden, Timothy M. Errington, Susann Fiedler, and Brian A. Nosek. 2016. Badges to Acknowledge Open Practices: A Simple, Low-Cost, Effective Method for Increasing Transparency. PLoS Biology (2016).",
      "doi": ""
    },
    {
      "text": "Jeffrey T Leek and Roger D Peng. 2015. Opinion: Reproducible research can still be wrong: adopting a prevention approach. Proceedings of the National Academy of Sciences of the United States of America 112, 6 (2015), 1645--6. arXiv:1502.03169",
      "doi": ""
    },
    {
      "text": "Wendy E Mackay, Caroline Appert, Michel Beaudouin-Lafon, Olivier Chapuis, Yangzhou Du, Jean-Daniel Fekete, and Yves Guiard. 2007. Touchstone: exploratory design of experiments. CHI '07 Proceedings of the SIGCHI Conference on Human Factors in Computing System (2007), 1425--1434.  ",
      "doi": "10.1145/1240624.1240840"
    },
    {
      "text": "Zeeya Merali. 2010. The large human collider: social scientists have embedded themselves at CERN to study the world's biggest research collaboration. Zeeya Merali reports on a 10,000-person physics project. Nature 464, 7288 (2010), 482--485.",
      "doi": ""
    },
    {
      "text": "Jesper Molin, Pawel W. Wozniak, Claes Lundström, Darren Treanor, and Morten Fjeld. 2016. Understanding Design for Automated Image Analysis in Digital Pathology. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, New York, NY, USA, Article 58, 10 pages.  ",
      "doi": "10.1145/2971485.2971561"
    },
    {
      "text": "Gerard Oleksik, Natasa Milic-Frayling, and Rachel Jones. 2012. Beyond Data Sharing: Artifact Ecology of a Collaborative Nanophotonics Research Centre. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 1165--1174.  ",
      "doi": "10.1145/2145204.2145376"
    },
    {
      "text": "Heather A. Piwowar and Todd J. Vision. 2013. Data reuse and the open data citation advantage. PeerJ 1 (Oct. 2013), e175.",
      "doi": ""
    },
    {
      "text": "Florian Prinz, Thomas Schlange, and Khusru Asadullah. 2011. Believe it or not: how much can we rely on published data on potential drug targets? Nature reviews. Drug discovery 10, 9 (2011), 712. arXiv:arXiv:cond-mat/9907372v1",
      "doi": ""
    },
    {
      "text": "Tim Reichling and Volker Wulf. 2009. Expert Recommender Systems in Practice : Evaluating Semi-automatic Profile Generation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2009), 59--68.  ",
      "doi": "10.1145/1518701.1518712"
    },
    {
      "text": "Michael Rosenblatt. 2016. An incentive-based approach for improving data reproducibility. Science Translational Medicine 8, 336 (2016), 336ed5--336ed5. arXiv:http://stm.sciencemag.org/content/8/336/336ed5.full.pdf",
      "doi": ""
    },
    {
      "text": "Anisa Rowhani-Farid, Michelle Allen, and Adrian G. Barnett. 2017. What incentives increase data sharing in health and medical research? A systematic review. Research Integrity and Peer Review 2, 1 (2017), 4.",
      "doi": ""
    },
    {
      "text": "Adam Rule, Aurélien Tabard, and James D Hollan. 2018. Exploration and Explanation in Computational Notebooks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 32.  ",
      "doi": "10.1145/3173574.3173606"
    },
    {
      "text": "Jonathan F Russell. 2013. If a job is worth doing, it is worth doing twice: researchers and funding agencies need to put a premium on ensuring that results are reproducible. Nature 496, 7443 (2013), 7--8.",
      "doi": ""
    },
    {
      "text": "Jonathan R. L. Sears. 2011. Data Sharing Effect on Article Citation Rate in Paleoceanography. AGU Fall Meeting Abstracts (Dec. 2011).",
      "doi": ""
    },
    {
      "text": "N Sadat Shami, Michael Muller, and David Millen. 2011. Browse and discover: social file sharing in the enterprise. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM, 295--304.  ",
      "doi": "10.1145/1958824.1958868"
    },
    {
      "text": "N Sadat Shami, Y Connie Yuan, Dan Cosley, Ling Xia, and Geri Gay. 2007. That's what friends are for: facilitating 'who knows what' across group boundaries. Proceedings of the 2007 international ACM conference on Supporting group work (2007), 379--382.  ",
      "doi": "10.1145/1316624.1316681"
    },
    {
      "text": "Victoria Stodden and Sheila Miguez. 2014. Best Practices for Computational Science: Software Infrastructure and Environments for Reproducible and Extensible Research. Journal of Open Research Software 2, 1 (2014), 21.",
      "doi": ""
    },
    {
      "text": "Andrea K. Thomer, Michael B. Twidale, Jinlong Guo, and Matthew J. Yoder. 2016. Co-designing Scientific Software: Hackathons for Participatory Interface Design. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3219--3226.  ",
      "doi": "10.1145/2851581.2892549"
    },
    {
      "text": "Theresa Velden. 2013. Explaining Field Differences in Openness and Sharing in Scientific Communities. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW'13) (2013), 445--457.  ",
      "doi": "10.1145/2441776.2441827"
    },
    {
      "text": "Daniel M Wegner. 1987. Transactive memory: A contemporary analysis of the group mind. In Theories of group behavior. Springer, 185--208.",
      "doi": ""
    },
    {
      "text": "Mark D. Wilkinson, Michel Dumontier, IJsbrand Jan Aalbersberg, Gabrielle Appleton, Myles Axton, Arie Baak, Niklas Blomberg, JanWillem Boiten, Luiz Bonino da Silva Santos, Philip E. Bourne, Jildau Bouwman, Anthony J. Brookes, Tim Clark, Mercè Crosas, Ingrid Dillo, Olivier Dumon, Scott Edmunds, Chris T. Evelo, Richard Finkers, Alejandra Gonzalez-Beltran, Alasdair J.G. Gray, Paul Groth, Carole Goble, Jeffrey S. Grethe, Jaap Heringa, Peter A.C 't Hoen, Rob Hooft, Tobias Kuhn, Ruben Kok, Joost Kok, Scott J. Lusher, Maryann E. Martone, Albert Mons, Abel L. Packer, Bengt Persson, Philippe Rocca-Serra, Marco Roos, Rene van Schaik, Susanna-Assunta Sansone, Erik Schultes, Thierry Sengstag, Ted Slater, George Strawn, Morris a. Swertz, Mark Thompson, Johan van der Lei, Erik van Mulligen, Jan Velterop, Andra Waagmeester, Peter Wittenburg, Katherine Wolstencroft, Jun Zhao, and Barend Mons. 2016. The FAIR Guiding Principles for scientific data management and stewardship. Scientific Data 3 (2016), 160018.",
      "doi": ""
    },
    {
      "text": "Max L. L. Wilson, Paul Resnick, David Coyle, and Ed H. Chi. 2013. RepliCHI. CHI '13 Extended Abstracts on Human Factors in Computing Systems on - CHI EA '13 (2013), 3159.",
      "doi": ""
    },
    {
      "text": "Daniel J Worden. 2017. Emerging Technologies for Data Research: Implications for Bias, Curation, and Reproducible Results. In Human Capital and Assets in the Networked World.",
      "doi": ""
    }
  ]
}