{
  "doi": "10.1145/3290605.3300474",
  "title": "Data is Personal: Attitudes and Perceptions of Data Visualization in Rural Pennsylvania",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Many of the guidelines that inform how designers create data visualizations originate in studies that unintentionally exclude populations that are most likely to be among the 'data poor'. In this paper, we explore which factors may drive attention and trust in rural populations with diverse economic and educational backgrounds - a segment that is largely underrepresented in the data visualization literature. In 42 semi-structured interviews in rural Pennsylvania (USA), we find that a complex set of factors intermix to inform attitudes and perceptions about data visualization - including educational background, political affiliation, and personal experience. The data and materials for this research can be found at https://osf.io/uxwts/",
  "authors": [
    {
      "name": "Evan M. Peck",
      "institution": "Bucknell University, Lewisburg, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474642862",
      "orcid": "0000-0001-9498-5362"
    },
    {
      "name": "Sofia E. Ayuso",
      "institution": "Bucknell University, Lewisburg, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366618",
      "orcid": "missing"
    },
    {
      "name": "Omar El-Etr",
      "institution": "Bucknell University, Lewisburg, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366443",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Basak Alper, Nathalie Henry Riche, Fanny Chevalier, Jeremy Boy, and Metin Sezgin. 2017. Visualization Literacy at Elementary School. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. 5485--5497. Data is Personal CHI 2019, May 4--9, 2019, Glasgow, Scotland UK  ",
      "doi": "10.1145/3025453.3025877"
    },
    {
      "text": "Kevin Arceneaux, Martin Johnson, and Chad Murphy. 2012. Polarized political communication, oppositional media hostility, and selective exposure. The Journal of Politics 74, 1 (2012), 174--186.",
      "doi": ""
    },
    {
      "text": "Scott Bateman, Regan L Mandryk, Carl Gutwin, Aaron Genest, David Mcdine, and Christopher Brooks. 2010. Useful Junk? The Effects of Visual Embellishment on Comprehension and Memorability of Charts. In Proceedings of the 2010 CHI Conference on Human Factors in Computer Systems - CHI 2010. 2573--2582.  ",
      "doi": "10.1145/1753326.1753716"
    },
    {
      "text": "Michael A. Bedek, Alexander Nussbaumer, and Dietrich Albert Luca Huszar. 2017. Discovering Cognitive Biases in a Visual Analytics Environment. IEEE VIS 2017 Workshop: Dealing with Cognitive Biases in Visualisations (2017).",
      "doi": ""
    },
    {
      "text": "Michelle A. Borkin, Zoya Bylinskii, Nam Wook Kim, Constance May Bainbridge, Chelsea S Yeh, Daniel Borkin, Hanspeter Pfister, and Aude Oliva. 2016. Beyond Memorability: Visualization Recognition and Recall. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 519--528.",
      "doi": "10.1109/TVCG.2015.2467732"
    },
    {
      "text": "Michelle A Borkin, Azalea A Vo, Zoya Bylinskii, Phillip Isola, Shashank Sunkavalli, Aude Oliva, and Hanspeter Pfister. 2013. What makes a visualization memorable? IEEE Transactions on Visualization and Computer Graphics 19,12(2013),2306--15.  ",
      "doi": "10.1109/TVCG.2013.234"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 data-driven documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2301--2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Jeremy Boy, Anshul Vikram Pandey, John Emerson, Margaret Satterthwaite, Oded Nov, and Enrico Bertini. 2017. Showing People Behind Data. InProceedingsofthe2017CHIConferenceonHumanFactorsinComputing Systems - CHI '17. 5462--5474.  ",
      "doi": "10.1145/3025453.3025512"
    },
    {
      "text": "Jeremy Boy, Ronald A. Rensink, Enrico Bertini, and Jean Daniel Fekete. 2014. A principled way of assessing visualization literacy. IEEE Transactions on Visualization and Computer Graphics 20, 12 (2014), 1963--1972.",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2018. Thinking relationally about digital inequality in rural regions of the U.S. First Monday 23, 6 (2018).",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Linda Liska Belgrave. 2007. Grounded theory. The Blackwell encyclopedia of sociology (2007).",
      "doi": ""
    },
    {
      "text": "Luca Chittaro. 2006. Visualizing information on mobile devices. Computer 39, 3 (2006), 40--45.  ",
      "doi": "10.1109/MC.2006.109"
    },
    {
      "text": "C.A. Christofides, Pats Neelakantan, and Todd Behr. 2006. Examining the Rural-Urban Income Gap. Technical Report. Center for Rural Pennyslvania.",
      "doi": ""
    },
    {
      "text": "Evanthia Dimara, Anastasia Bezerianos, and Pierre Dragicevic. 2017. The Attraction Effect in Information Visualization. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 471--480.  ",
      "doi": "10.1109/TVCG.2016.2598594"
    },
    {
      "text": "Micheline Elias and Anastasia Bezerianos. 2011. Exploration views: Understanding dashboard creation and customization for visualization novices. In Lecture Notes in Computer Science, Vol. 6949 LNCS. 274--291. arXiv:9780201398298 ",
      "doi": "10.5555/2042283.2042312"
    },
    {
      "text": "Mi Feng, Cheng Deng, Evan M. Peck, and Lane Harrison. 2018. The Effects of Adding Search Functionality to Interactive Visualizations on the Web. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 137, 13 pages.  ",
      "doi": "10.1145/3173574.3173711"
    },
    {
      "text": "Anindya Ghose, Avi Goldfarb, and Sang Pil Han. 2012. How is the mobile Internet different? Search costs and local activities. Information Systems Research 24, 3 (2012), 613--631.",
      "doi": ""
    },
    {
      "text": "Kaushik Ghosh, Tapan S Parikh, and Apala Lahiri Chavan. 2003. Design considerations for a financial management system for rural, semi-literate users. In CHI'03 Extended Abstracts on Human Factors in Computing Systems. ACM, 824--825.  ",
      "doi": "10.1145/765891.766014"
    },
    {
      "text": "John K Gilbert. 2005. Visualization: A metacognitive skill in science and science education. In Visualization in Science Education. Springer, 9--27.",
      "doi": ""
    },
    {
      "text": "John K Gilbert. 2008. Visualization: An emergent field of practice and enquiry in science education. In Visualization: Theory and Practice in Science Education. Springer, 3--24.",
      "doi": ""
    },
    {
      "text": "Amy K Glasmeier, Chris Benner, and Chandrani Ohdedar. 2008. Broadband Internet Use in Rural Pennsylvania. Technical Report. The Center for Rural Pennsylvania.",
      "doi": ""
    },
    {
      "text": "LarsGrammel.2012. Userinterfacessupportinginformationvisualization novices in visualization construction. Ph.D. Dissertation. RWTH Aachen University. http://dspace.library.uvic.ca:8080/handle/1828/4359",
      "doi": ""
    },
    {
      "text": "Lars Grammel, Melanie Tory, and Margaret Anne Storey. 2010. How information visualization novices construct visualizations. IEEE Transactions on Visualization and Computer Graphics 16, 6 (2010), 943--952.  ",
      "doi": "10.1109/TVCG.2010.164"
    },
    {
      "text": "Anzu Hakone, Lane Harrison, Alvitta Ottley, Nathan Winters, Caitlin Gutheil, Paul K.J. Han, and Remco Chang. 2017. PROACT: Iterative Design of a Patient-Centered Visualization for Effective Prostate Cancer Health Risk Communication. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 601--610.  ",
      "doi": "10.1109/TVCG.2016.2598588"
    },
    {
      "text": "Sherry Hamby, Elizabeth Taylor, Alli Smith, Kimberly Mitchell, and Lisa Jones. 2018. Technology in Rural Appalachia: Cultural Strategies of Resistance and Navigation. International Journal of Communication 12 (2018), 1248--1268. http://ijoc.org.",
      "doi": ""
    },
    {
      "text": "Steve Haroz, Robert Kosara, and Steven L Franconeri. 2015. ISOTYPE Visualization - Working Memory, Performance, and Engagement with Pictographs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. 1191--1200.  ",
      "doi": "10.1145/2702123.2702275"
    },
    {
      "text": "Lane Harrison, Katharina Reinecke, and Remco Chang. 2015. Infographic aesthetics: Designing for the first impression. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '15. ACM, 1187--1190.  ",
      "doi": "10.1145/2702123.2702545"
    },
    {
      "text": "Lane Harrison, Drew Skau, Steven Franconeri, Aidong Lu, and Remco Chang. 2013. Influencing visual judgment through affective priming. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. 2949--2958.  ",
      "doi": "10.1145/2470654.2481410"
    },
    {
      "text": "Joseph Henrich, Steven J Heine, and Ara Norenzayan. 2010. Most people are not WEIRD. Nature 466, 7302 (2010), 29.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman, Yea-Seul Kim, Francis Nguyen, Lauren Speers, and Maneesh Agrawala. 2018. Improving Comprehension of Measurements Using Concrete Re-Expression Strategies. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. 1--12.  ",
      "doi": "10.1145/3173574.3173608"
    },
    {
      "text": "Helen Kennedy and Rosemary Lucy Hill. 2018. The feeling of numbers: Emotions in everyday engagements with data and their visualisation. Sociology 52, 4 (2018), 830--848.",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Jessica Hullman, and Maneesh Agrawala. 2016. Generating Personalized Spatial Analogies for Distances and Areas. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16 (2016), 38--48.  ",
      "doi": "10.1145/2858036.2858440"
    },
    {
      "text": "Yea-Seul Kim, Katharina Reinecke, and Jessica Hullman. 2017. Explaining the Gap. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. 1375--1386.  ",
      "doi": "10.1145/3025453.3025592"
    },
    {
      "text": "Yea Seul Kim, Katharina Reinecke, and Jessica Hullman. 2018. Data Through Others' Eyes: The Impact of Visualizing Others' Expectations on Visualization Interpretation. IEEE Transactions on Visualization and Computer Graphics 24, 1 (2018), 760--769. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Evan M. Peck, Sofia E. Ayuso, and Omar El-Etr",
      "doi": ""
    },
    {
      "text": "Laura M. Koesten, Emilia Kacprzak, Jenifer F. A. Tennison, and Elena Simperl. 2017. The Trials and tribulations of working with structured data- A study on information seeking behavior. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. 1277--1289.  ",
      "doi": "10.1145/3025453.3025838"
    },
    {
      "text": "Ha-kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2018. Frames and Slants in Titles of Visualizations on Controversial Topics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. 438:1--438:12.  ",
      "doi": "10.1145/3173574.3174012"
    },
    {
      "text": "Sukwon Lee, Sung Hee Kim, Ya Hsin Hung, Heidi Lam, Youn Ah Kang, and Ji Soo Yi. 2016. How do People Make Sense of Unfamiliar Visualizations?: A Grounded Model of Novice's Information Visualization Sensemaking. IEEETransactionsonVisualizationandComputerGraphics 22, 1 (2016), 499--508.",
      "doi": ""
    },
    {
      "text": "Sukwon Lee, Sung-Hee Kim, and Bum Chul Kwon. 2017. VLAT: Development of a visualization literacy assessment test. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 551--560.  ",
      "doi": "10.1109/TVCG.2016.2598920"
    },
    {
      "text": "Ralph Lengler. 2006. Identifying the competencies of 'Visual Literacy' - A prerequisite for knowledge visualization. In Proceedings of the International Conference on Information Visualisation. 232--236.  ",
      "doi": "10.1109/IV.2006.60"
    },
    {
      "text": "Gitte Lindgaard, Gary Fernandes, Cathy Dudek, and J. Brown. 2006. Attention web designers: You have 50 milliseconds to make a good first impression! Behaviour & Information Technology 25, 2 (2006), 115--126.",
      "doi": ""
    },
    {
      "text": "Adam V. Maltese, Joseph A Harsh, and Dubravka Svetina. 2015. Data visualization literacy: Investigating data interpretation along the novice--expert continuum. Journal of College Science Teaching 45, 1 (2015), 83--83.",
      "doi": ""
    },
    {
      "text": "Hamid Mansoor and Lane Harrison. 2017. Data Visualization Literacy and Visualization Biases : Cases for Merging Parallel Threads. IEEE VIS 2017 Workshop: Dealing with Cognitive Biases in Visualisations (2017).",
      "doi": ""
    },
    {
      "text": "Alvitta Ottley, Evan M Peck, Lane T Harrison, Daniel Afergan, Caroline Ziemkiewicz, Holly A Taylor, Paul KJ Han, and Remco Chang. 2016. Improving Bayesian reasoning: The effects of phrasing, visualization, and spatial ability. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 529--538.",
      "doi": "10.1109/TVCG.2015.2467758"
    },
    {
      "text": "Paul Parsons. 2017. Promoting Representational Fluency for Cognitive Bias Mitigation in Information Visualization. IEEE VIS 2017 Workshop: Dealing with Cognitive Biases in Visualisations (2017).",
      "doi": ""
    },
    {
      "text": "Andrew Perrin. 2017. Digital gap between rural and nonrural America persists | Pew Research Center. https://www.pewresearch.org/fact-tank/2017/05/19/ digital-gap-between-rural-and-nonrural-america-persists/",
      "doi": ""
    },
    {
      "text": "Lee Rainie, Pavani Reddy, and Peter Bell. 2004. Rural Areas and the Internet | Pew Research Center. http: //www.pewinternet.org/2004/02/17/rural-areas-and-the-internet/",
      "doi": ""
    },
    {
      "text": "Pew Research. 2014. Further Decline in Credibility Ratings for Most News Organizations. http://www.people-press.org/2012/08/16/ further-decline-in-credibility-ratings-for-most-news-organizations/ /",
      "doi": ""
    },
    {
      "text": "Jonathan C Roberts, Panagiotis D Ritsos, Sriram Karthik Badam, Dominique Brodbeck, Jessie Kennedy, and Niklas Elmqvist. 2014. Visualization beyond the desktop--the next big thing. IEEE Computer Graphics and Applications 34, 6 (2014), 26--34.",
      "doi": ""
    },
    {
      "text": "Puripant Ruchikachorn and Klaus Mueller. 2015. Learning visualizations by analogy: Promoting visual literacy through visualization morphing. IEEE Transactions on Visualization and Computer Graphics 21, 9 (2015), 1028--1044.",
      "doi": "10.1109/TVCG.2015.2413786"
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-lite: A grammar of interactive graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1 (2017), 341--350.  ",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Arvind Satyanarayan, Ryan Russell, Jane Hoffswell, and Jeffrey Heer. 2016. Reactive vega: A streaming dataflow architecture for declarative interactive visualization. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 659--668.",
      "doi": "10.1109/TVCG.2015.2467091"
    },
    {
      "text": "Christina Simeone, Theodora Okiro, and Deshaun Bennett. 2018. Reimagining Pennsylvania's Coal Communities. Technical Report. Kleinman Center for Energy Policy, University of Pennsylvania. https: //kleinmanenergy.upenn.edu/sites/default/files/proceedingsreports/ ReimaginingPennsylvaniasCoalCommunities{_}0.pdf",
      "doi": ""
    },
    {
      "text": "AaronSmith.2013. TechnologyAdoptionbyLowerIncomePopulations | Pew Research Center. http://www.pewinternet.org/2013/10/08/ technology-adoption-by-lower-income-populations/",
      "doi": ""
    },
    {
      "text": "Eric Tsetsi and Stephen A. Rains. 2017. Smartphone Internet access and use:Extendingthedigitaldivideandusagegap. MobileMedia&Communication 2013 (2017), 1--17.",
      "doi": ""
    },
    {
      "text": "André Calero Valdez, Martina Ziefle, and Michael Sedlmair. 2018. Priming and Anchoring Effects in Visualization. IEEE Transactions on Visualization and Computer Graphics 24, 1 (2018), 584--594.",
      "doi": ""
    },
    {
      "text": "Calero Valdez, Martina Ziefle, and Michael Sedlmair. 2017. A Framework for Studying Biases in Visualization Research. IEEE VIS 2017 Workshop: Dealing with Cognitive Biases in Visualisations (2017).",
      "doi": ""
    },
    {
      "text": "Fernanda B Viegas and Martin Wattenberg. 2006. Communicationminded visualization: A call to action. IBM Systems Journal 45, 4 (2006), 801.",
      "doi": "10.1147/sj.454.0801"
    },
    {
      "text": "Emily Wall, Leslie M Blaha, Celeste Lyn Paul, Kristin Cook, and Alex Endert. 2017. Four perspectives on human bias in visual analytics. IEEE VIS 2017 Workshop: Dealing with Cognitive Biases in Visualisations October (2017).",
      "doi": ""
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2016. Voyager: Exploratory analysis via faceted browsing of visualization recommendations. IEEE TransactionsonVisualization&ComputerGraphics 22,1(2016),649--658.",
      "doi": ""
    },
    {
      "text": "Wenfan Yan. 2006. Adult Education in Rural Pennsylvania. Technical Report. The Center for Rural Pennyslvania.",
      "doi": ""
    },
    {
      "text": "Liangzhi Yu. 2010. How poor informationally are the information poor? Journal of Documentation 66, 6 (2010), 906--933. arXiv:http://dx.doi.org/10.1108/BIJ-10--2012-0068",
      "doi": ""
    },
    {
      "text": "Liangzhi Yu. 2011. The divided views of the information and digital divides: A call for integrative theories of information inequality. Journal of Information Science 37, 6 (2011), 660--679.  ",
      "doi": "10.1177/0165551511426246"
    }
  ]
}