{
  "doi": "10.1145/3290605.3300280",
  "title": "Understanding Visual Cues in Visualizations Accompanied by Audio Narrations",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "It is often assumed that visual cues, which highlight specific parts of a visualization to guide the audience's attention, facilitate visualization storytelling and presentation. This assumption has not been systematically studied. We present an in-lab experiment and a Mechanical Turk study to examine the effects of integral and separable visual cues on the recall and comprehension of visualizations that are accompanied by audio narration. Eye-tracking data in the in-lab experiment confirm that cues helped the viewers focus on relevant parts of the visualization faster. We found that in general, visual cues did not have a significant effect on learning outcomes, but for specific cue techniques (e.g. glow) or specific chart types (e.g heatmap), cues significantly improved comprehension. Based on these results, we discuss how presenters might select visual cues depending on the role of the cues and the visualization type.",
  "tags": [
    "learning",
    "narrative visualization",
    "visual cues"
  ],
  "authors": [
    {
      "name": "Ha-Kyung Kong",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020996",
      "orcid": "missing"
    },
    {
      "name": "Wenjie Zhu",
      "institution": "University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365130",
      "orcid": "missing"
    },
    {
      "name": "Zhicheng Liu",
      "institution": "Adobe Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385599440",
      "orcid": "missing"
    },
    {
      "name": "Karrie Karahalios",
      "institution": "Adobe Research & University of Illinois at Urbana-Champaign, Urbana, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350570757",
      "orcid": "0000-0001-8788-3405"
    }
  ],
  "references": [
    {
      "text": "Jean-Michel Boucheix and Richard K Lowe. 2010. An eye tracking comparison of external pointing cues and internal continuous cues in learning with complex animations. Learning and instruction 20, 2 (2010), 123--135.",
      "doi": ""
    },
    {
      "text": "Jeremy Boy, Francoise Detienne, and Jean-Daniel Fekete. 2015. Storytelling in Information Visualizations: Does it Engage Users to Explore Data? Proceedings of the ACM CHI'15 Conference on Human Factors in Computing Systems 1, February 2016 (2015), 1449--1458.  ",
      "doi": "10.1145/2702123.2702452"
    },
    {
      "text": "Anna C Cavender, Jeffrey P Bigham, and Richard E Ladner. 2009. ClassInFocus: enabling improved visual attention strategies for deaf and hard of hearing students. In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility. ACM, 67--74.  ",
      "doi": "10.1145/1639642.1639656"
    },
    {
      "text": "Forrester Cole, Douglas DeCarlo, Adam Finkelstein, Kenrick Kin, R Keith Morley, and Anthony Santella. 2006. Directing Gaze in 3D Models with Stylized Focus. Rendering Techniques 2006 (2006), 17th. ",
      "doi": "10.5555/2383894.2383942"
    },
    {
      "text": "Björn B de Koning and Halszka Jarodzka. 2017. Attention guidance strategies for supporting learning from dynamic visualizations. In Learning from dynamic visualization. Springer, 255--278.",
      "doi": ""
    },
    {
      "text": "Björn B de Koning, Huib K Tabbers, Remy MJP Rikers, and Fred Paas. 2007. Attention cueing as a means to enhance learning from an animation. Applied cognitive psychology 21, 6 (2007), 731--746.",
      "doi": ""
    },
    {
      "text": "Björn B de Koning, Huib K Tabbers, Remy MJP Rikers, and Fred Paas. 2010. Attention guidance in learning from a complex animation: Seeing is understanding? Learning and instruction 20, 2 (2010), 111--122.",
      "doi": ""
    },
    {
      "text": "Björn B. de Koning, Huib K. Tabbers, Remy M. J. P. Rikers, and Fred Paas. 2007. Attention cueing as a means to enhance learning from an animation. Applied Cognitive Psychology 21, 6 (sep 2007), 731--746. arXiv:NIHMS150003",
      "doi": ""
    },
    {
      "text": "Björn B. de Koning, Huib K. Tabbers, Remy M J P Rikers, and Fred Paas. 2010. Attention guidance in learning from a complex animation: Seeing is understanding? Learning and Instruction 20, 2 (2010), 111-- 122.",
      "doi": ""
    },
    {
      "text": "Tong Gao, Jessica R. Hullman, Eytan Adar, Brent Hecht, and Nicholas Diakopoulos. 2014. NewsViews: An Automated Pipeline for Creating Custom Geovisualizations for News. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14 (2014), 3005--3014.  ",
      "doi": "10.1145/2556288.2557228"
    },
    {
      "text": "Wendell R Garner. 1976. Interaction of stimulus dimensions in concept and choice processes. Cognitive psychology 8, 1 (1976), 98--123.",
      "doi": ""
    },
    {
      "text": "Gregor Aisch, Robert Gebeloff. 2015. The Changing Nature of MiddleClass Jobs. (Feb. 2015). https://www.nytimes.com/interactive/2015/02/ 23/business/economy/the-changing-nature-of-middle-class-jobs.html",
      "doi": ""
    },
    {
      "text": "Amy L Griffin and Anthony C Robinson. 2015. Comparing color and leader line highlighting strategies in coordinated view geovisualizations. IEEE transactions on visualization and computer graphics 21, 3 (2015), 339--349.",
      "doi": "10.1109/TVCG.2014.2371858"
    },
    {
      "text": "Raphael Hoffmann, Patrick Baudisch, and Daniel S Weld. 2008. Evaluating visual cues for window switching on large screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 929--938.  ",
      "doi": "10.1145/1357054.1357199"
    },
    {
      "text": "Jessica Hullman and Nick Diakopoulos. 2011. Visualization rhetoric: Framing effects in narrative visualization. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2231--2240.  ",
      "doi": "10.1109/TVCG.2011.255"
    },
    {
      "text": "Jessica Hullman, Nicholas Diakopoulos, and Eytan Adar. 2013. Contextifier: Automatic Generation of Annotated Stock Visualizations. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13 (2013), 2707.  ",
      "doi": "10.1145/2470654.2481374"
    },
    {
      "text": "Jessica Hullman, Steven Drucker, Nathalie Henry Riche, Bongshin Lee, Danyel Fisher, and Eytan Adar. 2013. A deeper understanding of sequence in narrative visualization. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2406--2415.  ",
      "doi": "10.1109/TVCG.2013.119"
    },
    {
      "text": "Ha-Kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2017. Internal and external visual cue preferences for visualizations in presentations. In Computer Graphics Forum, Vol. 36. Wiley Online Library, 515--525.  ",
      "doi": "10.1111/cgf.13207"
    },
    {
      "text": "Robert Kosara and Jock Mackinlay. 2013. Storytelling: The Next Step for Visualization. Computer (2013), 44--50. http://kosara.net/papers/ 2013/Kosara  ",
      "doi": "10.1109/MC.2013.36"
    },
    {
      "text": "Sukwon Lee, Sung-Hee Kim, and Bum Chul Kwon. 2017. Vlat: Development of a visualization literacy assessment test. IEEE transactions on visualization and computer graphics 23, 1 (2017), 551--560.  ",
      "doi": "10.1109/TVCG.2016.2598920"
    },
    {
      "text": "Lijia Lin and Robert K Atkinson. 2011. Using animations and visual cueing to support learning of scientific concepts and processes. Computers & Education 56, 3 (2011), 650--658.  ",
      "doi": "10.1016/j.compedu.2010.10.007"
    },
    {
      "text": "Daniela Oelke, Halldor Janetzko, Svenja Simon, Klaus Neuhaus, and Daniel A Keim. 2011. Visual boosting in pixel-based visualizations. In Computer Graphics Forum, Vol. 30. Wiley Online Library, 871--880.  ",
      "doi": "10.1111/j.1467-8659.2011.01936.x"
    },
    {
      "text": "Donghao Ren, Matthew Brehmer, Bongshin Lee, Tobias Hollerer, Eun Kyoung Choe, et al. 2017. ChartAccent: Annotation for datadriven storytelling. In 2017 IEEE Pacific Visualization Symposium (PacificVis). IEEE, 230--239.",
      "doi": ""
    },
    {
      "text": "Edward Segel and Jeffrey Heer. 2010. Narrative visualization: Telling stories with data. In IEEE Transactions on Visualization and Computer Graphics, Vol. 16. 1139--1148.  ",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "The Data Team. 2017. In much of sub-Saharan Africa, mobile phones are more common than access to electricity. (Nov. 2017). https://www.economist.com/graphic-detail/2017/11/08/in-much-ofsub-saharan-africa-mobile-phones-are-more-common-than-accessto-electricity",
      "doi": ""
    },
    {
      "text": "The Data Team. 2018. How heavy use of social media is linked to mental illness. (May 2018). https://www.economist.com/graphicdetail/2018/05/18/how-heavy-use-of-social-media-is-linked-tomental-illness",
      "doi": ""
    },
    {
      "text": "The Data Team. 2018. Which traits predict graduates' earnings? (2018). https://www.economist.com/graphic-detail/2018/06/15/whichtraits-predict-graduates-earnings",
      "doi": ""
    }
  ]
}