{
  "doi": "10.1145/3290605.3300467",
  "title": "Clairbuoyance: Improving Directional Perception for Swimmers",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "While we usually have no trouble with orientation, our sense of direction frequently fails in the absence of a frame of reference. Open-water swimmers raise their heads to look for a reference point, since disorientation might result in exhaustion or even drowning. In this paper, we report on Clairbuoyance - a system that provides feedback about the swimmer's orientation through lights mounted on swimming goggles. We conducted an experiment with two versions of Clairbuoyance: Discrete signals relative to a chosen direction, and continuous signals providing a sense of absolute direction. Participants swam to a series of targets. Proficient swimmers preferred the discrete mode; novice users the continuous one. We determined that both versions of Clairbuoyance enabled reaching the target faster than without the help of the system, although the discrete mode increased error. Based on the results, we contribute insights for designing directional guidance feedback for swimmers.",
  "authors": [
    {
      "name": "Francisco Kiss",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-99659163052/rel-imgonly/kiss_francisco02.jpg",
      "acmid": "99659163052",
      "orcid": "missing"
    },
    {
      "name": "Paweł W. Woźniak",
      "institution": "Utrecht University, Utrecht, Netherlands",
      "img": "/do/10.1145/contrib-87958813957/rel-imgonly/pawel_cropped.jpg",
      "acmid": "87958813957",
      "orcid": "0000-0003-3670-1813"
    },
    {
      "name": "Felix Scheerer",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366649",
      "orcid": "missing"
    },
    {
      "name": "Julia Dominiak",
      "institution": "Lodz University of Technology, Łódz, Poland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365480",
      "orcid": "0000-0001-5584-5455"
    },
    {
      "name": "Andrzej Romanowski",
      "institution": "Lodz University of Technology, Łódz, Poland",
      "img": "/do/10.1145/contrib-81309485993/rel-imgonly/aromanowski.jpg",
      "acmid": "81309485993",
      "orcid": "missing"
    },
    {
      "name": "Albrecht Schmidt",
      "institution": "Ludwig Maximilian University of Munich, Munich, Germany",
      "img": "/do/10.1145/contrib-81100588072/rel-imgonly/albrecht.jpg",
      "acmid": "81100588072",
      "orcid": "0000-0003-3890-1990"
    }
  ],
  "references": [
    {
      "text": "Marc Bächlin, Kilian Förster, and Gerhard Tröster. 2009. SwimMaster: A Wearable Assistant for Swimmer. In Proceedings of the 11th International Conference on Ubiquitous Computing (UbiComp '09). ACM, New York, NY, USA, 215--224.  ",
      "doi": "10.1145/1620545.1620578"
    },
    {
      "text": "Stephen Brewster and Lorna M. Brown. 2004. Tactons: Structured Tactile Messages for Non-visual Information Display. In Proceedings of the Fifth Conference on Australasian User Interface - Volume 28 (AUIC '04). Australian Computer Society, Inc., Darlinghurst, Australia, Australia, 15--23. http://dl.acm.org/citation.cfm?id=976310.976313 ",
      "doi": "10.5555/976310.976313"
    },
    {
      "text": "John Brooke et al. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "Jennifer L. Burke, Matthew S. Prewett, Ashley A. Gray, Liuquin Yang, Frederick R. B. Stilson, Michael D. Coovert, Linda R. Elliot, and Elizabeth Redden. 2006. Comparing the Effects of Visual-auditory and Visual-tactile Feedback on User Performance: A Meta-analysis. In Proceedings of the 8th International Conference on Multimodal Interfaces (ICMI '06). ACM, New York, NY, USA, 108--117.  ",
      "doi": "10.1145/1180995.1181017"
    },
    {
      "text": "Andrew J Callaway, Jon E Cobb, and Ian Jones. 2009. A Comparison of Video and Accelerometer Based Approaches Applied to Performance Monitoring in Swimming. International Journal of Sports Science & Coaching 4, 1 (2009), 139--153. arXiv:https://doi.org/10.1260/1747--9541.4.1.139",
      "doi": ""
    },
    {
      "text": "Marta G. Carcedo, Soon Hau Chua, Simon Perrault, Pawel Wozniak, Raj Joshi, Mohammad Obaid, Morten Fjeld, and Shengdong Zhao. 2016. HaptiColor: Interpolating Color Information As Haptic Feedback to Assist the Colorblind. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3572--3583.  ",
      "doi": "10.1145/2858036.2858220"
    },
    {
      "text": "Woohyeok Choi, Jeungmin Oh, Darren Edge, Joohyun Kim, and Uichin Lee. 2016. SwimTrain: Exploring Exergame Design for Group Fitness Swimming. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1692--1704.  ",
      "doi": "10.1145/2858036.2858579"
    },
    {
      "text": "Enrico Costanza, Samuel A. Inverso, Elan Pavlov, Rebecca Allen, and Pattie Maes. 2006. Eye-q: Eyeglass Peripheral Display for Subtle Intimate Notifications. In Proceedings of the 8th Conference on Humancomputer Interaction with Mobile Devices and Services (MobileHCI '06). ACM, New York, NY, USA, 211--218. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Kiss et al.  ",
      "doi": "10.1145/1152215.1152261"
    },
    {
      "text": "Neil P. Davey, Megan E. Anderson, and Daniel A. James. 2005. An accelerometer-based system for elite athlete swimming performance analysis., 5649 - 5649 - 7 pages.",
      "doi": ""
    },
    {
      "text": "Neil P. Davey, Megan E. Anderson, and Daniel A. James. 2008. Validation trial of an accelerometer-based sensor platform for swimming. Sports Technology 1, 4--5 (2008), 202--207. arXiv:https://doi.org/10.1080/19346182.2008.9648474",
      "doi": ""
    },
    {
      "text": "Jan Etherington. 2015. Why open water swimming is the trend of 2015. https://www.telegraph.co.uk/comment/personal-view/ 11325401/Why-open-water-swimming-is-the-trend-of-2015.html",
      "doi": ""
    },
    {
      "text": "Aryan Firouzian, Yukitoshi Kashimoto, Zeeshan Asghar, Niina Keranen, Goshiro Yamamoto, and Petri Pulli. 2017. Twinkle Megane: Near-Eye LED Indicators on Glasses for Simple and Smart Navigation in Daily Life. In eHealth 360°, Kostas Giokas, Laszlo Bokor, and Frank Hopfgartner (Eds.). Springer International Publishing, Cham, 17--22.",
      "doi": ""
    },
    {
      "text": "Kilian Förster, Marc Bächlin, and Gerhard Tröster. 2009. Noninterrupting User Interfaces for Electronic Body-worn Swim Devices. In Proceedings of the 2nd International Conference on PErvasive Technologies Related to Assistive Environments (PETRA '09). ACM, New York, NY, USA, Article 38, 4 pages.  ",
      "doi": "10.1145/1579114.1579152"
    },
    {
      "text": "Rabee M. Hagema, Tim Haelsig, Steven G. O'Keefe, Andy Stamm, Thomas Fickenscher, and David V. Thiel. 2013. Second Generation Swimming Feedback Device Using a Wearable Data Processing System based on Underwater Visible Light Communication. Procedia Engineering 60 (2013), 34 -- 39. 6th Asia-Pacific Congress on Sports Technology (APCST).",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASATLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139--183.",
      "doi": ""
    },
    {
      "text": "Francisco Kiss, Robin Boldt, Bastian Pfleging, and Stefan Schneegass. 2018. Navigation Systems for Motorcyclists: Exploring Wearable Tactile Feedback for Route Guidance in the Real World. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 617, 7 pages.  ",
      "doi": "10.1145/3173574.3174191"
    },
    {
      "text": "Kristina Knaving, Pawel Wozniak, Morten Fjeld, and Staffan Björk. 2015. Flow is Not Enough: Understanding the Needs of Advanced Amateur Runners to Design Motivation Technology. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2013--2022.  ",
      "doi": "10.1145/2702123.2702542"
    },
    {
      "text": "Ming-Wei Lin, Yun-Maw Cheng, Wai Yu, and Frode Eika Sandnes. 2008. Investigation into the Feasibility of Using Tactons to Provide Navigation Cues in Pedestrian Situations. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat (OZCHI '08). ACM, New York, NY, USA, 299--302.  ",
      "doi": "10.1145/1517744.1517794"
    },
    {
      "text": "Morgane Mangin, Aurelien Valade, Antony Costes, Anthony Bouillod, Pascal Acco, and Georges Soto-Romero. 2015. An Instrumented Glove for Swimming Performance Monitoring. 53--58.",
      "doi": ""
    },
    {
      "text": "Joe Marshall. 2013. Smartphone Sensing for Distributed Swim Stroke Coaching and Research. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication (UbiComp '13 Adjunct). ACM, New York, NY, USA, 1413--1416.  ",
      "doi": "10.1145/2494091.2496036"
    },
    {
      "text": "Andrii Matviienko, Andreas Löcken, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2016. NaviLight: Investigating Ambient Light Displays for Turn-by-turn Navigation in Cars. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, New York, NY, USA, 283-- 294.  ",
      "doi": "10.1145/2935334.2935359"
    },
    {
      "text": "Florian Mueller, Rohit A. Khot, Alan D. Chatham, Sebastiaan Pijnappel, Cagdas \"Chad\" Toprak, and Joe Marshall. 2013. HCI with Sports. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 2509--2512.  ",
      "doi": "10.1145/2468356.2468817"
    },
    {
      "text": "Jaroslav Novak. 1983. Swimming direction and visual control. Biomechanics and medicine in swimming IV (International Series on Sport Sciences) (1983), 345--349.",
      "doi": ""
    },
    {
      "text": "Marco Parvis, Sabrina Grassini, Emma Angelini, and Pietro Scattareggia. 2016. Swimming symmetry assessment via multiple inertial measurements. In 2016 IEEE International Symposium on Medical Measurements and Applications (MeMeA). 1--6.",
      "doi": "10.1109/MeMeA.2016.7533765"
    },
    {
      "text": "Martin Pielot, Benjamin Poppinga, and Susanne Boll. 2010. PocketNavigator: Vibro-tactile Waypoint Navigation for Everyday Mobile Devices. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 423--426.  ",
      "doi": "10.1145/1851600.1851696"
    },
    {
      "text": "Martin Pielot, Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2011. A Tactile Compass for Eyes-Free Pedestrian Navigation. In Human-Computer Interaction -- INTERACT 2011, Pedro Campos, Nicholas Graham, Joaquim Jorge, Nuno Nunes, Philippe Palanque, and Marco Winckler (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 640--656. ",
      "doi": "10.5555/2042118.2042179"
    },
    {
      "text": "Benjamin Poppinga, Niels Henze, Jutta Fortmann, Wilko Heuten, and Susanne Boll. 2012. AmbiGlasses - Information in the Periphery of the Visual Field. (01 2012).",
      "doi": ""
    },
    {
      "text": "Maria Psychountaki and Yannis Zervas. 2000. Competitive Worries, Sport Confidence, and Performance Ratings for Young Swimmers. Perceptual and Motor Skills 91, 1 (2000), 87--94. arXiv:https://doi.org/10.2466/pms.2000.91.1.87 PMID: 11011876.",
      "doi": ""
    },
    {
      "text": "Jan L Souman, Ilja Frissen, Manish N Sreenivasa, and Marc O Ernst. 2009. Walking straight into circles. Current biology 19, 18 (2009), 1538--1542.",
      "doi": ""
    },
    {
      "text": "Hong Z. Tan and Alex Pentland. 1997. Tactual displays for wearable computing. Personal Technologies 1, 4 (01 Dec 1997), 225--230.",
      "doi": ""
    },
    {
      "text": "Jakob Tholander and Stina Nylander. 2015. Snot, sweat, pain, mud, and snow: Performance and experience in the use of sports watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2913--2922.  ",
      "doi": "10.1145/2702123.2702482"
    },
    {
      "text": "Hung-Yu Tseng, Rong-Hao Liang, Liwei Chan, and Bing-Yu Chen. 2015. LEaD: Utilizing Light Movement As Peripheral Visual Guidance for Scooter Navigation. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 323--326.  ",
      "doi": "10.1145/2785830.2785831"
    },
    {
      "text": "Hung-Yu Tseng, Rong-Hao Liang, Liwei Chan, and Bing-Yu Chen. 2015. Using Point-light Movement As Peripheral Visual Guidance for Scooter Navigation. In Proceedings of the 6th Augmented Human International Conference (AH '15). ACM, New York, NY, USA, 177--178.  ",
      "doi": "10.1145/2735711.2735800"
    },
    {
      "text": "Koji Tsukada and Michiaki Yasumura. 2004. Activebelt: Belt-type wearable tactile display for directional navigation. In International Conference on Ubiquitous Computing. Springer, 384--399.",
      "doi": ""
    },
    {
      "text": "Tom van Veen, Juffrizal Karjanto, and Jacques Terken. 2017. Situation Awareness in Automated Vehicles Through Proximal Peripheral Light Signals. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '17). ACM, New York, NY, USA, 287--292. Clairbuoyance CHI 2019, May 4--9, 2019, Glasgow, Scotland UK  ",
      "doi": "10.1145/3122986.3122993"
    },
    {
      "text": "Pawel Wozniak, Kristina Knaving, Staffan Björk, and Morten Fjeld. 2015. RUFUS: Remote Supporter Feedback for Long-Distance Runners. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 115--124.  ",
      "doi": "10.1145/2785830.2785893"
    }
  ]
}