{
  "doi": "10.1145/3290605.3300451",
  "title": "Detecting Personality Traits Using Eye-Tracking Data",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Personality is an established domain of research in psychology, and individual differences in various traits are linked to a variety of real-life outcomes and behaviours. Personality detection is an intricate task that typically requires humans to fill out lengthy questionnaires assessing specific personality traits. The outcomes of this, however, may be unreliable or biased if the respondents do not fully understand or are not willing to honestly answer the questions. To this end, we propose a framework for objective personality detection that leverages humans' physiological responses to external stimuli. We exemplify and evaluate the framework in a case study, where we expose subjects to affective image and video stimuli, and capture their physiological responses using a commercial-grade eye-tracking sensor. These responses are then processed and fed into a classifier capable of accurately predicting a range of personality traits. Our work yields notably high predictive accuracy, suggesting the applicability of the proposed framework for robust personality detection.",
  "authors": [
    {
      "name": "Shlomo Berkovsky",
      "institution": "Data61 - CSIRO & Macquarie University, Sydney, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100167944",
      "orcid": "missing"
    },
    {
      "name": "Ronnie Taib",
      "institution": "Data61 - CSIRO, Sydney, New South Wales, Australia",
      "img": "/do/10.1145/contrib-81309495249/rel-imgonly/ronnietaib.jpg",
      "acmid": "81309495249",
      "orcid": "missing"
    },
    {
      "name": "Irena Koprinska",
      "institution": "University of Sydney, Sydney, New South Wales, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100467034",
      "orcid": "missing"
    },
    {
      "name": "Eileen Wang",
      "institution": "University of Sydney, Sydney, New South Wales, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365613",
      "orcid": "missing"
    },
    {
      "name": "Yucheng Zeng",
      "institution": "University of Sydney, Sydney, New South Wales, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367040",
      "orcid": "missing"
    },
    {
      "name": "Jingjie Li",
      "institution": "University of Wisconsin-Madison, Madison, WI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659345193",
      "orcid": "missing"
    },
    {
      "name": "Sabina Kleitman",
      "institution": "University of Sydney, Sydney, New South Wales, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498659223",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mojtaba K. Abadi, Juan A. Miranda-Correa, Julia Wache, Heng Yang, Ioannis Patras, and Nicu Sebe. 2015. Inference of personality traits and affect schedule by analysis of spontaneous reactions to affective videos. In International Conference on Automatic Face and Gesture Recognition (FG). 1--8.",
      "doi": ""
    },
    {
      "text": "Daniel R. Ames, Paul Rose, and Cameron P. Anderson. 2006. The NPI-16 as a short measure of narcissism. Journal of Research in Personality 40, 4 (2006), 440--450.",
      "doi": ""
    },
    {
      "text": "Jeromy Anglim, Stefan Bozic, Jonathon Little, and Filip Lievens. 2018. Response distortion on personality tests in applicants: comparing high-stakes to low-stakes medical settings. Advances in Health Sciences Education 23 (10 2018), 311--321.",
      "doi": ""
    },
    {
      "text": "Michael C. Ashton, Kibeom Lee, Marco Perugini, Piotr Szarota, Reinout E. De Vries, Lisa Di Blas, Kathleen Boies, and Boele De Raad. 2004. A six-factor structure of personality-descriptive adjectives: solutions from psycholexical studies in seven languages. Journal of personality and social psychology 86, 2 (2004), 356.",
      "doi": ""
    },
    {
      "text": "Shlomo Berkovsky, Tsvi Kuflik, and Francesco Ricci. 2012. The impact of data obfuscation on the accuracy of collaborative filtering. Expert Syst. Appl. 39, 5 (2012), 5033--5042.  ",
      "doi": "10.1016/j.eswa.2011.11.037"
    },
    {
      "text": "Sabrina Boll and Matthias Gamer. 2016. Psychopathic traits affect the visual exploration of facial expressions. Biological Psychology 117 (2016), 194--201.",
      "doi": ""
    },
    {
      "text": "Daniel T. Burley, Nicola S. Gray, and Robert J. Snowden. 2017. As far as the eye can see: relationship between psychopathic traits and pupil response to affective stimuli. PloS One 12, 1 (2017), 1--22.",
      "doi": ""
    },
    {
      "text": "Suzanne R. Byrnes. 1996. The effect of audio, video, and paired audio-video stimuli on the experience of stress. Journal of Music Therapy 33, 4 (1996), 248--260.",
      "doi": ""
    },
    {
      "text": "Charles S. Carver and Teri L. White. 1994. Behavioral inhibition, behavioral activation, and affective responses to impending reward and punishment: the BIS/BAS scales. Journal of Personality and Social Psychology 67, 2 (1994), 319.",
      "doi": ""
    },
    {
      "text": "Fang Chen, Natalie Ruiz, Eric Choi, Julien Epps, M. Asif Khawaja, Ronnie Taib, Bo Yin, and Yang Wang. 2013. Multimodal Behavior and Interaction As Indicators of Cognitive Load. ACM Transactions on Interactive Intelligent Systems 2, 4 (2013), 22:1--22:36.  ",
      "doi": "10.1145/2395123.2395127"
    },
    {
      "text": "C. Robert Cloninger, Dragan M. Svrakic, and Thomas R. Przybeck. 1998. A psychobiological model of temperament and character. The development of psychiatry and its complexity 50, 12 (1998), 1--16.",
      "doi": ""
    },
    {
      "text": "Hope R. Conte and Robert Plutchik. 1981. A circumplex model for interpersonal personality traits. Journal of personality and social psychology 40, 4 (1981), 701.",
      "doi": ""
    },
    {
      "text": "Ariel L. Del Gaizo and Diana M. Falkenbach. 2008. Primary and secondary psychopathic-traits and their relationship to perception and experience of emotion. Personality and Individual Differences 45, 3 (2008), 206--212.",
      "doi": ""
    },
    {
      "text": "Susan T. Dumais, Georg Buscher, and Edward Cutrell. 2010. Individual differences in gaze patterns for web search. In Proceedings of the Symposium on Information Interaction in Context. 185--194.  ",
      "doi": "10.1145/1840784.1840812"
    },
    {
      "text": "Hans J. Eysenck. 1983. Psychophysiology and personality: Extraversion, neuroticism and psychoticism. In Individual Differences and Psychopathology. 13--30.",
      "doi": ""
    },
    {
      "text": "Gerry Fahey. 2018. Faking Good and Personality Assessments of Job applicants: A Review of the Literature. DBS Business Review 2 (2018), 45--68.",
      "doi": ""
    },
    {
      "text": "Arik Friedman, Bart P. Knijnenburg, Kris Vanhecke, Luc Martens, and Shlomo Berkovsky. 2015. Privacy Aspects of Recommender Systems. In Recommender Systems Handbook. 649--688.",
      "doi": ""
    },
    {
      "text": "Mihai Gavrilescu and Nicolae Vizireanu. 2017. Predicting the Sixteen Personality Factors (16PF) of an individual by analyzing facial features. EURASIP Journal on Image and Video Processing 2017, 1 (2017), 59.",
      "doi": ""
    },
    {
      "text": "Jennifer Golbeck, Cristina Robles, Michon Edmondson, and Karen Turner. 2011. Predicting personality from Twitter. In Proceedings of the International Conference on Social Computing (SocialCom). 149--156.",
      "doi": ""
    },
    {
      "text": "Jeffrey A. Gray. 1990. Brain systems that mediate both emotion and cognition. Cognition & Emotion 4, 3 (1990), 269--288.",
      "doi": ""
    },
    {
      "text": "Daniel F. Gros. 2011. Startle inhibition to positive-activated compared to neutral stimuli: Variations in self-reported behavioral approach. Journal of Psychopathology and Behavioral Assessment 33, 3 (2011), 308--314.",
      "doi": ""
    },
    {
      "text": "Mark A. Hall. 2000. Correlation-based Feature Selection for Discrete and Numeric Class Machine Learning. In Proceedings of the Seventeenth International Conference on Machine Learning. 359--366. ",
      "doi": "10.5555/645529.657793"
    },
    {
      "text": "Mark A. Hall, Eibe Frank, Geoffrey Holmes, Bernhard Pfahringer, Peter Reutemann, and Ian H. Witten. 2009. The WEKA data mining software: an update. SIGKDD Explorations 11, 1 (2009), 10--18.  ",
      "doi": "10.1145/1656274.1656278"
    },
    {
      "text": "Sabrina Hoppe, Tobias Loetscher, Stephanie A. Morey, and Andreas Bulling. 2018. Eye Movements During Everyday Behavior Predict Personality Traits. Frontiers in Human Neuroscience 12 (2018), 105.",
      "doi": ""
    },
    {
      "text": "David W. Hosmer Jr, Stanley Lemeshow, and Rodney X. Sturdivant. 2013. Applied logistic regression. Vol. 398. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Peter K. Jonason and Laura Krause. 2013. The emotional deficits associated with the Dark Triad traits: Cognitive empathy, affective empathy and alexithymia. Personality and Individual Differences 55, 5 (2013), 532 -- 537.",
      "doi": ""
    },
    {
      "text": "Anthony F. Jorm, Helen Christensen, Alexander S. Henderson, Patricia A. Jacomb, Ailsa E. Korten, and Bryan Rodgers. 1998. Using the BIS/BAS scales to measure behavioural inhibition and behavioural activation: Factor structure, validity and norms in a large community sample. Personality and Individual Differences 26, 1 (1998), 49 -- 58.",
      "doi": ""
    },
    {
      "text": "Michal Kosinski, David Stillwell, and Thore Graepel. 2013. Private traits and attributes are predictable from digital records of human behavior. Proceedings of the National Academy of Sciences 110, 15 (2013), 5802--5805.",
      "doi": ""
    },
    {
      "text": "Peter J. Lang, Margaret M. Bradley, and Bruce N. Cuthbert. 2008. International affective picture system (IAPS): Affective ratings of pictures and instruction manual, Technical Report. (2008).",
      "doi": ""
    },
    {
      "text": "Michael R. Levenson, Kent A. Kiehl, and Cory M. Fitzpatrick. 1995. Assessing psychopathic attributes in a noninstitutionalized population. Journal of Personality and Social Psychology 68, 1 (1995), 151.",
      "doi": ""
    },
    {
      "text": "William L. Libby and Donna Yaklevich. 1973. Personality determinants of eye contact and direction of gaze aversion. Journal of Personality and Social Psychology 27, 2 (1973), 197.",
      "doi": ""
    },
    {
      "text": "Kai K. Lim, Max Friedrich, Jenni Radun, and Kristiina Jokinen. 2013. Lying through the eyes: detecting lies through eye movements. In Proceedings of the Workshop on Eye gaze in Intelligent Human Machine Interaction: Gaze in Multimodal Interaction. 51--56.  ",
      "doi": "10.1145/2535948.2535954"
    },
    {
      "text": "Navonil Majumder, Soujanya Poria, Alexander Gelbukh, and Erik Cambria. 2017. Deep learning-based document modeling for personality detection from text. IEEE Intelligent Systems 32, 2 (2017), 74--79.  ",
      "doi": "10.1109/MIS.2017.23"
    },
    {
      "text": "Gerald Matthews, Ian J Deary, and Martha C Whiteman. 2003. Personality traits. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Robert R. McCrae and Paul T. Costa Jr. 1999. A five-factor theory of personality. Handbook of personality: Theory and Research 2 (1999), 139--153.",
      "doi": ""
    },
    {
      "text": "Leslie C. Morey. 2015. Personality Assessment Inventory (PAI). Wiley Online Library.",
      "doi": ""
    },
    {
      "text": "Carolyn C. Morf and Frederick Rhodewalt. 2001. Unraveling the paradoxes of narcissism: A dynamic self-regulatory processing model. Psychological Inquiry 12, 4 (2001), 177--196.",
      "doi": ""
    },
    {
      "text": "Tim Morris, Paul Blenkhorn, and Farhan Zaidi. 2002. Blink detection for real-time eye tracking. Journal of Network and Computer Applications 25, 2 (2002), 129--143.  ",
      "doi": "10.1006/jnca.2002.0130"
    },
    {
      "text": "Christopher J. Patrick, Margaret M. Bradley, and Peter J. Lang. 1993. Emotion in the Criminal Psychopath: Startle Reflex Modulation. Journal of Abnormal Psychology 102, 1 (1993), 82--92.",
      "doi": ""
    },
    {
      "text": "Delroy L. Paulhus and Kevin M. Williams. 2002. The dark triad of personality: Narcissism, Machiavellianism, and psychopathy. Journal of Research in Personality 36, 6 (2002), 556--563.",
      "doi": ""
    },
    {
      "text": "Lin Qiu, Han Lin, Jonathan Ramsay, and Fang Yang. 2012. You are what you tweet: Personality expression and perception on Twitter. Journal of Research in Personality 46, 6 (2012), 710--718.",
      "doi": ""
    },
    {
      "text": "George E. Raptis, Christos A. Fidas, and Nikolaos M. Avouris. 2017. On implicit elicitation of cognitive strategies using gaze transition entropies in pattern recognition tasks. In Proceedings of the CHI Conference on Human Factors in Computing Systems. 1993--2000.  ",
      "doi": "10.1145/3027063.3053106"
    },
    {
      "text": "John F. Rauthmann. 2013. Investigating the MACH--IV with item response theory and proposing the trimmed MACH. Journal of Personality Assessment 95, 4 (2013), 388--397.",
      "doi": ""
    },
    {
      "text": "John F. Rauthmann, Christian T. Seubert, Pierre Sachse, and Marco R. Furtner. 2012. Eyes as windows to the soul: Gazing behavior is related to personality. Journal of Research in Personality 46, 2 (2012), 147--156.",
      "doi": ""
    },
    {
      "text": "John F. Rauthmann and Theresa Will. 2011. Proposing a multidimensional Machiavellianism conceptualization. Social Behavior and Personality: An International Journal 39, 3 (2011), 391--403.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryckman. 2012. Theories of Personality. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Gerard Saucier. 2009. Recurrent personality dimensions in inclusive lexical studies: Indications for a Big Six structure. Journal of Personality 77, 5 (2009), 1577--1614.",
      "doi": ""
    },
    {
      "text": "Alexandre Schaefer, Frédéric Nils, Xavier Sanchez, and Pierre Philippot. 2010. Assessing the effectiveness of a large database of emotion-eliciting films: A new tool for emotion researchers. Cognition and Emotion 24, 7 (2010), 1153--1172.",
      "doi": ""
    },
    {
      "text": "Ramanathan Subramanian, Julia Wache, Mojtaba Abadi, Radu Vieriu, Stefan Winkler, and Nicu Sebe. 2016. ASCERTAIN: Emotion and Personality Recognition using Commercial Sensors. IEEE Transactions on Affective Computing 9, 2 (2016), 147--160.",
      "doi": ""
    },
    {
      "text": "Isabel Thielmann, Benjamin E. Hilbig, Ingo Zettler, and Morten Moshagen. 2016. On measuring the sixth basic personality dimension: a comparison between HEXACO honesty-humility and Big Six honesty-propriety. Assessment 24, 8 (2016), 1024--1036.",
      "doi": ""
    },
    {
      "text": "Amit Tiroshi, Shlomo Berkovsky, Mohamed Ali Kaafar, Terence Chen, and Tsvi Kuflik. 2013. Cross Social Networks Interests Predictions Based Ongraph Features. In Proceedings of the ACM Conference on Recommender Systems. 319--322.  ",
      "doi": "10.1145/2507157.2507206"
    },
    {
      "text": "Alessandro Vinciarelli and Gelareh Mohammadi. 2014. A survey of personality computing. IEEE Transactions on Affective Computing 5, 3 (2014), 273--291.",
      "doi": ""
    },
    {
      "text": "Julia Wache, Ramanathan Subramanian, Mojtaba Khomami Abadi, Radu-Laurentiu Vieriu, Nicu Sebe, and Stefan Winkler. 2015. Implicit User-centric Personality recognition based on physiological responses to emotional videos. In Proceedings of the International Conference on Multimodal Interaction. 239--246.  ",
      "doi": "10.1145/2818346.2820736"
    },
    {
      "text": "Michael Wai and Niko Tiliopoulos. 2012. The affective and cognitive empathic nature of the dark triad of personality. Personality and Individual Differences 52, 7 (2012), 794 -- 799.",
      "doi": ""
    },
    {
      "text": "Tara L. White and Richard A. Depue. 1999. Differential association of traits of fear and anxiety with norepinephrine- and dark-induced pupil reactivity. Journal Of Personality And Social Psychology 77, 4 (1999), 863--877.",
      "doi": ""
    },
    {
      "text": "Anne-Kathrin Wilbers, Alina Vennekoetter, Moritz Koster, Kai-Christoph Hamborg, and Kai Kaspar. 2015. Personality traits and eye movements: an eye-tracking and pupillometry study. In Proceedings of the European Conference on Eye Movements. 269.",
      "doi": ""
    },
    {
      "text": "Ian H. Witten, Eibe Frank, and Mark A. Hall. 2011. Data Mining: Practical Machine Learning Tools and Techniques (3rd ed.). Morgan Kaufmann Publishers. ",
      "doi": "10.5555/1972514"
    },
    {
      "text": "Jie Xu, Yang Wang, Fang Chen, and Eric Choi. 2011. Pupillary response based cognitive workload measurement under luminance changes. In IFIP Conference on Human-Computer Interaction. 178--185. ",
      "doi": "10.5555/2042118.2042136"
    },
    {
      "text": "Zhefan Ye, Yin Li, Alireza Fathi, Yi Han, Agata Rozga, Gregory D. Abowd, and James M. Rehg. 2012. Detecting eye contact using wearable eye-tracking glasses. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. 699--704.  ",
      "doi": "10.1145/2370216.2370368"
    },
    {
      "text": "Michael J. Zickar and Fritz Drasgow. 1996. Detecting faking on a personality instrument using appropriateness measurement. Applied Psychological Measurement 20, 1 (1996), 71--87.",
      "doi": ""
    },
    {
      "text": "Matthias Ziegler, Carolyn MacCann, and Richard Roberts. 2011. New perspectives on faking in personality assessment. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Lisa M. Pytlik Zillig, Scott H. Hemenover, and Richard A. Dienstbier. 2002. What do we assess when we assess a Big 5 trait? A content analysis of the affective, behavioral, and cognitive processes represented in Big 5 personality inventories. Personality and Social Psychology Bulletin 28, 6 (2002), 847--858.",
      "doi": ""
    }
  ]
}