{
  "doi": "10.1145/3290605.3300503",
  "title": "PickCells: A Physically Reconfigurable Cell-composed Touchscreen",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Touchscreens are the predominant medium for interactions with digital services; however, their current fixed form factor narrows the scope for rich physical interactions by limiting interaction possibilities to a single, planar surface. In this paper we introduce the concept of PickCells, a fully re-configurable device concept composed of cells, that breaks the mould of rigid screens and explores a modular system that affords rich sets of tangible interactions and novel across-device relationships. Through a series of co-design activities -- involving HCI experts and potential end-users of such systems -- we synthesised a design space aimed at inspiring future research, giving researchers and designers a framework in which to explore modular screen interactions. The design space we propose unifies existing works on modular touch surfaces under a general framework and broadens horizons by opening up unexplored spaces providing new interaction possibilities. In this paper, we present the PickCells concept, a design space of modular touch surfaces, and propose a toolkit for quick scenario prototyping.",
  "authors": [
    {
      "name": "Alix Goguey",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-99658641429/rel-imgonly/2263507.jpg",
      "acmid": "99658641429",
      "orcid": "0000-0003-2619-5996"
    },
    {
      "name": "Cameron Steer",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707900",
      "orcid": "0000-0001-8497-7932"
    },
    {
      "name": "Andrés Lucero",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81314484387/rel-imgonly/81314484387.jpg",
      "acmid": "81314484387",
      "orcid": "missing"
    },
    {
      "name": "Laurence Nigay",
      "institution": "Université Grenoble Alpes, Grenoble, France",
      "img": "/do/10.1145/contrib-81100087172/rel-imgonly/laurencenigay.jpg",
      "acmid": "81100087172",
      "orcid": "0000-0002-4854-626X"
    },
    {
      "name": "Deepak Ranjan Sahoo",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-99658704388/rel-imgonly/dsc_0054_413.jpeg",
      "acmid": "99658704388",
      "orcid": "missing"
    },
    {
      "name": "Céline Coutrix",
      "institution": "CNRS, Grenoble, France",
      "img": "/do/10.1145/contrib-81309485815/rel-imgonly/img_3232_2.jpg",
      "acmid": "81309485815",
      "orcid": "0000-0001-7904-4257"
    },
    {
      "name": "Anne Roudaut",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81414614562/rel-imgonly/81414614562.png",
      "acmid": "81414614562",
      "orcid": "0000-0003-3082-4564"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    },
    {
      "name": "Yutaka Tokuda",
      "institution": "University of Sussex, Brighton, United Kingdom",
      "img": "/do/10.1145/contrib-81421599806/rel-imgonly/yutakacolor.jpg",
      "acmid": "81421599806",
      "orcid": "missing"
    },
    {
      "name": "Timothy Neate",
      "institution": "City University of London, London, United Kingdom",
      "img": "/do/10.1145/contrib-99658696166/rel-imgonly/moi.jpg",
      "acmid": "99658696166",
      "orcid": "0000-0002-1387-8168"
    },
    {
      "name": "Jennifer Pearson",
      "institution": "Swansea University, Swansea, Wales, United Kingdom",
      "img": "/do/10.1145/contrib-81384596881/rel-imgonly/img_4695.jpg",
      "acmid": "81384596881",
      "orcid": "0000-0002-1960-1012"
    },
    {
      "name": "Simon Robinson",
      "institution": "Swansea University, Swansea, Wales, United Kingdom",
      "img": "/do/10.1145/contrib-81371592031/rel-imgonly/profile-small-rect.jpg",
      "acmid": "81371592031",
      "orcid": "0000-0001-9228-006X"
    },
    {
      "name": "Matt Jones",
      "institution": "Swansea University, Swansea, United Kingdom",
      "img": "/do/10.1145/contrib-81328488881/rel-imgonly/forweb.jpg",
      "acmid": "81328488881",
      "orcid": "0000-0001-7657-7373"
    }
  ],
  "references": [
    {
      "text": "Jason Alexander, Andrés Lucero, and Sriram Subramanian. 2012. Tilt Displays: Designing Display Surfaces with Multi-axis Tilting and Actuation. In Proceedings of the 14th International Conference on Humancomputer Interaction with Mobile Devices and Services (MobileHCI '12). ACM, New York, NY, USA, 161--170.  ",
      "doi": "10.1145/2371574.2371600"
    },
    {
      "text": "Ahmed Sabbir Arif, Brien East, Sean DeLong, Roozbeh Manshaei, Apurva Gupta, Manasvi Lalwani, and Ali Mazalek. 2017. Extending the Design Space of Tangible Objects via Low-Resolution Edge Displays. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, New York, NY, USA, 481--488.  ",
      "doi": "10.1145/3024969.3025078"
    },
    {
      "text": "Ahmed Sabbir Arif, Roozbeh Manshaei, Sean Delong, Brien East, Matthew Kyan, and Ali Mazalek. 2016. Sparse Tangibles: Collaborative Exploration of Gene Networks Using Active Tangibles and Interactive Tabletops. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 287--295.  ",
      "doi": "10.1145/2839462.2839500"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2004. Designing Interaction, Not Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '04). ACM, New York, NY, USA, 15--22.  ",
      "doi": "10.1145/989863.989865"
    },
    {
      "text": "Andrea Bianchi, So-Ryang Ban, and Ian Oakley. 2015. Designing a Physical Aid to Support Active Reading on Tablets. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 699--708.  ",
      "doi": "10.1145/2702123.2702303"
    },
    {
      "text": "Liwei Chan, Stefanie Müller, Anne Roudaut, and Patrick Baudisch. 2012. CapStones and ZebraWidgets: Sensing Stacks of Building Blocks, Dials and Sliders on Capacitive Touch Screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2189--2192.  ",
      "doi": "10.1145/2207676.2208371"
    },
    {
      "text": "Kimberly Chang, Wendy Xu, Nicole Francisco, Consuelo Valdes, Robert Kincaid, and Orit Shaer. 2012. SynFlo: An Interactive Installation Introducing Synthetic Biology Concepts. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, New York, NY, USA, 303--306.  ",
      "doi": "10.1145/2396636.2396685"
    },
    {
      "text": "Sandy Claes, Jorgos Coenen, Karin Slegers, and Andrew Vande Moere. 2015. Design Implications of Casual Health Visualization on Tangible Displays. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 1839--1844.  ",
      "doi": "10.1145/2702613.2732830"
    },
    {
      "text": "José María Rodríguez Corral, Antón Civit Balcells, Arturo Morgado Estévez, Gabriel Jiménez Moreno, and María José Ferreiro Ramos. 2014. A game-based approach to the teaching of object-oriented programming languages. Computers & Education 73 (2014), 83 -- 92.  ",
      "doi": "10.1016/j.compedu.2013.12.013"
    },
    {
      "text": "David Dearman, Richard Guy, and Khai Truong. 2012. Determining the Orientation of Proximate Mobile Devices Using Their Back Facing Camera. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2231--2234.  ",
      "doi": "10.1145/2207676.2208377"
    },
    {
      "text": "William Delamare, Céline Coutrix, and Laurence Nigay. 2015. Designing Guiding Systems for Gesture-based Interaction. In Proceedings of the 7th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '15). ACM, New York, NY, USA, 44--53.  ",
      "doi": "10.1145/2774225.2774847"
    },
    {
      "text": "Brien East, Sean DeLong, Roozbeh Manshaei, Ahmed Arif, and Ali Mazalek. 2016. Actibles: Open Source Active Tangibles. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and PickCells: A Physically Reconfigurable Cell-composed Touchscreen CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Spaces (ISS '16). ACM, New York, NY, USA, 469--472.  ",
      "doi": "10.1145/2992154.2996874"
    },
    {
      "text": "George W Fitzmaurice, Hiroshi Ishii, and William AS Buxton. 1995. Bricks: laying the foundations for graspable user interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/Addison-Wesley Publishing Co., 442--449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: Dynamic Physical Affordances and Constraints Through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Mark Goadrich. 2014. Incorporating Tangible Computing Devices into CS1. J. Comput. Sci. Coll. 29, 5 (May 2014), 23--31. http://dl.acm.org/ citation.cfm?id=2600623.2600627 ",
      "doi": "10.5555/2600623.2600627"
    },
    {
      "text": "Antonio Gomes, Lahiru Lakmal Priyadarshana, Aaron Visser, Juan Pablo Carrascal, and Roel Vertegaal. 2018. MagicScroll: A Rollable Display Device with Flexible Screen Real Estate and Gestural Input. In Proceedings of the 20th International Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '18). ACM, New York, NY, USA, 10. http://www.hml.queensu.ca/ s/MagicScrollWand-MobileHCI2018-Final-CRC-v60--8kr3.pdf  ",
      "doi": "10.1145/3229434.3229442"
    },
    {
      "text": "Matthew G. Gorbet, Maggie Orth, and Hiroshi Ishii. 1998. Triangles: Tangible Interface for Manipulation and Exploration of Digital Information Topography. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '98). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 49--56.  ",
      "doi": "10.1145/274644.274652"
    },
    {
      "text": "Casey Grote, Evan Segreto, Johanna Okerlund, Robert Kincaid, and Orit Shaer. 2015. Eugenie: Multi-Touch and Tangible Interaction for Bio-Design. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 217--224.  ",
      "doi": "10.1145/2677199.2680605"
    },
    {
      "text": "Peter Hamilton and Daniel J. Wigdor. 2014. Conductor: Enabling and Understanding Cross-device Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2773--2782.  ",
      "doi": "10.1145/2556288.2557170"
    },
    {
      "text": "Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical Atoms: Beyond Tangible Bits, Toward Transformable Materials. interactions 19, 1 (Jan. 2012), 38--51.  ",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, New York, NY, USA, 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "J. Knapp, J. Zeratsky, and B. Kowitz. 2016. Sprint: How to Solve Big Problems and Test New Ideas in Just Five Days. Simon & Schuster. https://books.google.fi/books?id=rV0JCgAAQBAJ",
      "doi": ""
    },
    {
      "text": "Ricardo Langner, Anton Augsburg, and Raimund Dachselt. 2014. CubeQuery: Tangible Interface for Creating and Manipulating Database Queries. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, New York, NY, USA, 423--426.  ",
      "doi": "10.1145/2669485.2669526"
    },
    {
      "text": "Mathieu Le Goc, Lawrence H. Kim, Ali Parsaei, Jean-Daniel Fekete, Pierre Dragicevic, and Sean Follmer. 2016. Zooids: Building Blocks for Swarm User Interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 97--109.  ",
      "doi": "10.1145/2984511.2984547"
    },
    {
      "text": "Ming Li and Leif Kobbelt. 2012. Dynamic Tiling Display: Building an Interactive Display Surface Using Multiple Mobile Devices. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia (MUM '12). ACM, New York, NY, USA, Article 24, 4 pages.  ",
      "doi": "10.1145/2406367.2406397"
    },
    {
      "text": "Andrés Lucero, Jussi Holopainen, and Tero Jokela. 2011. Pass-themaround: Collaborative Use of Mobile Phones for Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1787--1796.  ",
      "doi": "10.1145/1978942.1979201"
    },
    {
      "text": "Andrés Lucero, Jaakko Keränen, and Tero Jokela. 2010. Social and Spatial Interactions: Shared Co-located Mobile Phone Use. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, New York, NY, USA, 3223--3228.  ",
      "doi": "10.1145/1753846.1753962"
    },
    {
      "text": "Andrés Lucero, Kirsikka Vaajakallio, and Peter Dalsgaard. 2012. The dialogue-labs method: process, space and materials as structuring elements to spark dialogue in co-design events. CoDesign 8, 1 (2012), 1--23. arXiv:https://doi.org/10.1080/15710882.2011.609888",
      "doi": ""
    },
    {
      "text": "Roozbeh Manshaei, Nauman Baig, Sean DeLong, Shahin Khayyer, Brien East, and Ali Mazalek. 2016. Exploring Genetic Mutations on Mitochondrial DNA Cancer Data with Interactive Tabletop and Active Tangibles. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 461--464.  ",
      "doi": "10.1145/2992154.2996873"
    },
    {
      "text": "Nicolai Marquardt, Frederik Brudy, Can Liu, Ben Bengler, and Christian Holz. 2018. SurfaceConstellations: A Modular Hardware Platform for Ad-Hoc Reconfigurable Cross-Device Workspaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 354, 14 pages.  ",
      "doi": "10.1145/3173574.3173928"
    },
    {
      "text": "Meghna Mehta, Ahmed Sabbir Arif, Apurva Gupta, Sean DeLong, Roozbeh Manshaei, Graceline Williams, Manasvi Lalwani, Sanjay Chandrasekharan, and Ali Mazalek. 2016. Active Pathways: Using Active Tangibles and Interactive Tabletops for Collaborative Modeling in Systems Biology. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 129--138.  ",
      "doi": "10.1145/2992154.2992176"
    },
    {
      "text": "David Merrill, Jeevan Kalanithi, and Pattie Maes. 2007. Siftables: Towards Sensor Network User Interfaces. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (TEI '07). ACM, New York, NY, USA, 75--78.  ",
      "doi": "10.1145/1226969.1226984"
    },
    {
      "text": "David Merrill, Emily Sun, and Jeevan Kalanithi. 2012. Sifteo Cubes. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 1015--1018.  ",
      "doi": "10.1145/2212776.2212374"
    },
    {
      "text": "Heidi Selmer Nielsen, Marius Pallisgaard Olsen, Mikael B. Skov, and Jesper Kjeldskov. 2014. JuxtaPinch: An Application for Collocated Multi-device Photo Sharing. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, New York, NY, USA, 417--420.  ",
      "doi": "10.1145/2628363.2633569"
    },
    {
      "text": "Johanna Okerlund, Evan Segreto, Casey Grote, Lauren Westendorf, Anja Scholze, Romie Littrell, and Orit Shaer. 2016. SynFlo: A Tangible Museum Exhibit for Exploring Bio-Design. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 141--149.  ",
      "doi": "10.1145/2839462.2839488"
    },
    {
      "text": "Michaël Ortega, Jérôme Maisonnasse, and Laurence Nigay. 2017. EXHI-bit: A Mechanical Structure for Prototyping EXpandable Handheld Interfaces. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, Article 4, 11 pages. https: CHI 2019, May 4--9, 2019, Glasgow, Scotland UK A. Goguey et al.  ",
      "doi": "10.1145/3098279.3098533"
    },
    {
      "text": "Leonhard Oschuetz, Daniel Wessolek, and Wolfgang Sattler. 2010. Constructing with Movement: Kinematics. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '10). ACM, New York, NY, USA, 257--260.  ",
      "doi": "10.1145/1709886.1709938"
    },
    {
      "text": "Clément Pillias, Raphaël Robert-Bouchard, and Guillaume Levieux. 2014. Designing Tangible Video Games: Lessons Learned from the Sifteo Cubes. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3163--3166.  ",
      "doi": "10.1145/2556288.2556991"
    },
    {
      "text": "Roman Rädle, Hans-Christian Jetter, Nicolai Marquardt, Harald Reiterer, and Yvonne Rogers. 2014. HuddleLamp: Spatially-Aware Mobile Displays for Ad-hoc Around-the-Table Collaboration. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, New York, NY, USA, 45--54.  ",
      "doi": "10.1145/2669485.2669500"
    },
    {
      "text": "Raf Ramakers, Johannes Schöning, and Kris Luyten. 2014. Paddle: Highly Deformable Mobile Devices with Physical Controls. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2569--2578.  ",
      "doi": "10.1145/2556288.2557340"
    },
    {
      "text": "Yves Rangoni, Valérie Maquil, Eric Tobias, and Eric Ras. 2014. Implementing Widgets Using Sifteo Cubes for Visual Modelling on Tangible User Interfaces. In Proceedings of the 2014 ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '14). ACM, New York, NY, USA, 205--210.  ",
      "doi": "10.1145/2607023.2610271"
    },
    {
      "text": "Jun Rekimoto, Brygg Ullmer, and Haruo Oba. 2001. DataTiles: A Modular Platform for Mixed Physical and Graphical Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 269--276.  ",
      "doi": "10.1145/365024.365115"
    },
    {
      "text": "Simon Robinson, Jennifer Pearson, Matt Jones, Anirudha Joshi, and Shashank Ahire. 2017. Better Together: Disaggregating Mobile Services for Emergent Users. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, Article 44, 13 pages.  ",
      "doi": "10.1145/3098279.3098534"
    },
    {
      "text": "Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward High \"Shape Resolution\" in Selfactuated Flexible Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 593--602.  ",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "A. Roudaut, D. Krusteva, M. McCoy, A. Karnik, K. Ramani, and S. Subramanian. 2016. Cubimorph: Designing modular interactive devices. In 2016 IEEE International Conference on Robotics and Automation (ICRA). 3339--3345.",
      "doi": ""
    },
    {
      "text": "Pejman Sajjadi, Edgar Omar Cebolledo Gutierrez, Sandra Trullemans, and Olga De Troyer. 2014. Maze Commander: A Collaborative Asynchronous Game Using the Oculus Rift & the Sifteo Cubes. In Proceedings of the First ACM SIGCHI Annual Symposium on Computerhuman Interaction in Play (CHI PLAY '14). ACM, New York, NY, USA, 227--236.  ",
      "doi": "10.1145/2658537.2658690"
    },
    {
      "text": "Teddy Seyed, Xing-Dong Yang, and Daniel Vogel. 2016. Doppio: A Reconfigurable Dual-Face Smartwatch for Tangible Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4675--4686.  ",
      "doi": "10.1145/2858036.2858256"
    },
    {
      "text": "Teddy Seyed, Xing-Dong Yang, and Daniel Vogel. 2017. A Modular Smartphone for Lending. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 205--215.  ",
      "doi": "10.1145/3126594.3126633"
    },
    {
      "text": "Orit Shaer, Consuelo Valdes, Sirui Liu, Kara Lu, Kimberly Chang, Wendy Xu, Traci L. Haddock, Swapnil Bhatia, Douglas Densmore, and Robert Kincaid. 2014. Designing Reality-based Interfaces for Experiential Bio-design. Personal Ubiquitous Comput. 18, 6 (Aug. 2014), 1515--1532.  ",
      "doi": "10.1007/s00779-013-0752-1"
    },
    {
      "text": "D. Sweeney, N. Chen, S. Hodges, and T. Grosse-Puppendahl. 2016. Displays as a Material: A Route to Making Displays More Pervasive. IEEE Pervasive Computing 15, 3 (July 2016), 77--82.",
      "doi": "10.1109/MPRV.2016.56"
    },
    {
      "text": "Dominique Tan, Maciej Kumorek, Andres A. Garcia, Adam Mooney, and Derek Bekoe. 2015. Projectagami: A Foldable Mobile Device with Shape Interactive Applications. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 1555--1560.  ",
      "doi": "10.1145/2702613.2732801"
    },
    {
      "text": "Aneesh P. Tarun, Peng Wang, Audrey Girouard, Paul Strohmeier, Derek Reilly, and Roel Vertegaal. 2013. PaperTab: An Electronic Paper Computer with Multiple Large Flexible Electrophoretic Displays. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 3131--3134.  ",
      "doi": "10.1145/2468356.2479628"
    },
    {
      "text": "John Tiab, Sebastian Boring, Paul Strohmeier, Anders Markussen, Jason Alexander, and Kasper Hornbæk. 2018. Tiltstacks: Composing Shape-changing Interfaces Using Tilting and Stacking of Modules. In Proceedings of the 2018 International Conference on Advanced Visual Interfaces (AVI '18). ACM, New York, NY, USA, Article 44, 5 pages.  ",
      "doi": "10.1145/3206505.3206530"
    },
    {
      "text": "Consuelo Valdes, Diana Eastman, Casey Grote, Shantanu Thatte, Orit Shaer, Ali Mazalek, Brygg Ullmer, and Miriam K. Konkel. 2014. Exploring the Design Space of Gestural Interaction with Active Tokens Through User-defined Gestures. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 4107--4116.  ",
      "doi": "10.1145/2556288.2557373"
    },
    {
      "text": "Roel Vertegaal and Ivan Poupyrev. 2008. Introduction. Commun. ACM 51, 6 (June 2008), 26--30.  ",
      "doi": "10.1145/1349026.1349033"
    },
    {
      "text": "Emanuel Vonach, Georg Gerstweiler, and Hannes Kaufmann. 2014. ACTO: A Modular Actuated Tangible User Interface Object. In Proceedings of the Ninth ACM International Conference on Interactive Tabletops and Surfaces (ITS '14). ACM, New York, NY, USA, 259--268.  ",
      "doi": "10.1145/2669485.2669522"
    },
    {
      "text": "Ryoichi Watanabe, Yuichi Itoh, Masatsugu Asai, Yoshifumi Kitamura, Yoshifumi Kitamura, Fumio Kishino, and Hideo Kikuchi. 2004. The Soul of ActiveCube: Implementing a Flexible, Multimodal, Threedimensional Spatial Tangible Interface. Comput. Entertain. 2, 4 (Oct. 2004), 15--15.  ",
      "doi": "10.1145/1037851.1037874"
    },
    {
      "text": "Malte Weiss, Julie Wagner, Yvonne Jansen, Roger Jennings, Ramsin Khoshabeh, James D. Hollan, and Jan Borchers. 2009. SLAP Widgets: Bridging the Gap Between Virtual and Physical Controls on Tabletops. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 481--490.  ",
      "doi": "10.1145/1518701.1518779"
    },
    {
      "text": "Yiwei Zhao, Lawrence H. Kim, Ye Wang, Mathieu Le Goc, and Sean Follmer. 2017. Robotic Assembly of Haptic Proxy Objects for Tangible Interaction and Virtual Reality. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY, USA, 82--91.  ",
      "doi": "10.1145/3132272.3134143"
    }
  ]
}