{
  "doi": "10.1145/3290605.3300598",
  "title": "An Analytic Model for Time Efficient Personal Hierarchies",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Hierarchy structures such as file systems are widespread interfaces for item retrieval and selection tasks. Some hierarchies can be modified by end-users, such as application launchers on smartphones or pictures in a file folder. These modifiable hierarchies cannot benefit from an optimization made beforehand as their content, unknown during the design process, is constantly evolving. We hence propose an analytic model which designers can integrate in their system to recommend a range of local structure modifications (e.g., creating new folders) to end-users. Proposing a range of modifications gives flexibility to end-users regarding their own meaningful grouping and labeling choices to follow a recommendation. A first experiment confirms that the recommendations built on our model can lead to modified hierarchies resulting in faster theoretical selection times. A second experiment confirms that the theoretical selection times fit empirical selection times in different hierarchy visual layouts: linear, radial, and grid.",
  "tags": [
    "modifiable",
    "predictive model",
    "hierarchy",
    "recommendation"
  ],
  "authors": [
    {
      "name": "William Delamare",
      "institution": "Kochi University of Technology & University of Manitoba, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82259263457",
      "orcid": "missing"
    },
    {
      "name": "Ali Neshati",
      "institution": "University of Manitoba, Winnipeg, MB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658697518",
      "orcid": "0000-0002-0405-1169"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, MB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    },
    {
      "name": "Xiangshi Ren",
      "institution": "Kochi University of Technology, Kochi, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100597892",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Johnny Accot and Shumin Zhai. 1997. Beyond Fitts' law: models for trajectory-based HCI tasks. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '97. ACM Press, New York, New York, USA, 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Johnny Accot and Shumin Zhai. 2003. Refining Fitts' law models for bivariate pointing. In Proceedings of the conference on Human factors in computing systems - CHI '03. ACM Press, New York, New York, USA, 193--200.  ",
      "doi": "10.1145/642611.642646"
    },
    {
      "text": "David Ahlström, Andy Cockburn, Carl Gutwin, and Pourang Irani. 2010. Why it's quick to be square: Modelling new and existing hierarchical menu designs. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10. ACM Press, New York, New York, USA, 1371.  ",
      "doi": "10.1145/1753326.1753534"
    },
    {
      "text": "Gilles Bailly and Antti Oulasvirta. 2014. Toward Optimal Menu Design. ACM Interactions (2014), 40--45.  ",
      "doi": "10.1145/2617814"
    },
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Duncan P Brumby, and Andrew Howes. 2014. Model of visual search and selection time in linear menus. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press, New York, New York, USA, 3865--3874.  ",
      "doi": "10.1145/2556288.2557093"
    },
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Timo Kötzing, and Sabrina Hoppe. 2013. MenuOptimizer: Interactive Optimization of Menu Systems. In Proceedings of the 26th annual ACM symposium on User interface software and technology - UIST '13. ACM Press, New York, New York, USA, 331--342.  ",
      "doi": "10.1145/2501988.2502024"
    },
    {
      "text": "Ofer Bergman, Ruth Beyth-Marom, Rafi Nachmias, Noa Gradovitch, and Steve Whittaker. 2008. Improved search engines and navigation preference in personal information management. ACM Transactions on Information Systems 26, 4 (sep 2008), 1--24.  ",
      "doi": "10.1145/1402256.1402259"
    },
    {
      "text": "Richard Boardman and M Angela Sasse. 2004. \"Stuff goes into the computer and doesn't come out\" A Cross-tool Study of Personal Information Management. In Proceedings of the 2004 conference on Human factors in computing systems - CHI '04, Vol. 6. ACM Press, New York, New York, USA, 583--590.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Matthias Böhmer and Antonio Krüger. 2013. A study on icon arrangement by smartphone users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, New York, New York, USA, 2137--2146.  ",
      "doi": "10.1145/2470654.2481294"
    },
    {
      "text": "Andy Cockburn and Carl Gutwin. 2009. A Predictive Model of Human Performance With Scrolling and Hierarchical Lists. HumanComputer Interaction 24, 3 (jul 2009), 273--314.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Saul Greenberg. 2007. A predictive model of menu performance. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, New York, New York, USA, 627--636.  ",
      "doi": "10.1145/1240624.1240723"
    },
    {
      "text": "A I Danilenko and M V Goubko. 2013. Semantic-aware optimization of user interface menus. Automation and Remote Control 74, 8 (aug 2013), 1399--1411.",
      "doi": ""
    },
    {
      "text": "Donald L Fisher, Erika J Yungkurth, and Stanley M Moss. 1990. Optimal Menu Hierarchy Design: Syntax and Semantics. Human Factors: The Journal of the Human Factors and Ergonomics Society 32, 6 (dec 1990), 665--683.  ",
      "doi": "10.1177/001872089003200605"
    },
    {
      "text": "P M Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47 (sep 1954), 381 -- 391.",
      "doi": ""
    },
    {
      "text": "Mikhail V Goubko and Alexander I Danilenko. 2010. An automated routine for menu structure optimization. In Proceedings of the 2nd ACM SIGCHI symposium on Engineering interactive computing systems - EICS '10. ACM Press, New York, New York, USA, 67--76.  ",
      "doi": "10.1145/1822018.1822030"
    },
    {
      "text": "M V Goubko and A I Danilenko. 2012. Mathematical model of hierarchical menu structure optimization. Automation and Remote Control 73, 8 (aug 2012), 1410--1423.",
      "doi": ""
    },
    {
      "text": "Ray Hyman. 1953. Stimulus information as a determinant of reaction time. Journal of Experimental Psychology 45, 3 (1953), 188--196.",
      "doi": ""
    },
    {
      "text": "T K Landauer and D W Nachbar. 1985. Selection from alphabetic and numeric menu trees using a touch screen. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '85. ACM Press, New York, New York, USA, 73--78.  ",
      "doi": "10.1145/317456.317470"
    },
    {
      "text": "Eric Lee and James Macgregor. 1985. Minimizing User Search Time in Menu Retrieval Systems. Human Factors: The Journal of the Human Factors and Ergonomics Society 27, 2 (apr 1985), 157--162.",
      "doi": ""
    },
    {
      "text": "Baili Liu, Gregory Francis, and Gavriel Salvendy. 2002. Applying models of visual search to menu design. International Journal of HumanComputer Studies 56, 3 (mar 2002), 307--330.",
      "doi": ""
    },
    {
      "text": "Wanyu Liu, Gilles Bailly, and Andrew Howes. 2017. Effects of Frequency Distribution on Linear Menu Performance. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, New York, New York, USA, 1307--1312.  ",
      "doi": "10.1145/3025453.3025707"
    },
    {
      "text": "Zhengwu Lu. 2017. Optimization Approaches to Adaptive Menus. May (2017).",
      "doi": ""
    },
    {
      "text": "Shouichi Matsui and Seiji Yamada. 2008. Genetic algorithm can optimize hierarchical menus. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08, Vol. 1. ACM Press, New York, New York, USA, 1385--1388.  ",
      "doi": "10.1145/1357054.1357271"
    },
    {
      "text": "Craig S Miller and Roger W Remington. 2004. Modeling Information Navigation: Implications for Information Architecture. Human-Computer Interaction 19, 3 (sep 2004), 225--271.  ",
      "doi": "10.1207/s15327051hci1903_2"
    },
    {
      "text": "Dwight P. Miller. 1981. The Depth/Breadth Tradeoff in Hierarchical Computer Menus. Proceedings of the Human Factors Society Annual Meeting 25, 1 (oct 1981), 296--300.",
      "doi": ""
    },
    {
      "text": "Kent Norman. 1992. The Psychology of Menu Selection: Designing Cognitive Control of the Human/Computer Interface. Displays 13 (1992).",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta. 2017. User Interface Design with Combinatorial Optimization. Computer 50, 1 (jan 2017), 40--47.  ",
      "doi": "10.1109/MC.2017.6"
    },
    {
      "text": "Kenneth R Paap and Renate J. Roske-Hofstrand. 1986. The Optimal Number of Menu Options per Panel. Human Factors: The Journal of the Human Factors and Ergonomics Society 28, 4 (aug 1986), 377--385.  ",
      "doi": "10.1177/001872088602800401"
    },
    {
      "text": "Krystian Samp and Stefan Decker. 2010. Supporting menu design with radial layouts. In Proceedings of the International Conference on Advanced Visual Interfaces - AVI '10. ACM Press, New York, New York, USA, 155--162.  ",
      "doi": "10.1145/1842993.1843021"
    },
    {
      "text": "Krystian Samp and Stefan Decker. 2011. Visual search in radial menus. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Vol. 6949 LNCS. 248--255. ",
      "doi": "10.5555/2042283.2042309"
    },
    {
      "text": "Andrew Sears and Ben Shneiderman. 1994. Split menus: effectively using selection frequency to organize menus. ACM Transactions on Computer-Human Interaction 1, 1 (mar 1994), 27--51.  ",
      "doi": "10.1145/174630.174632"
    },
    {
      "text": "R. William Soukoreff and I. Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International Journal of Human-Computer Studies 61, 6 (dec 2004), 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Shengdong Zhao, Maneesh Agrawala, and Ken Hinckley. 2006. Zone and polygon menus: using relative position to increase the breadth of multi-stroke marking menus. In Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI '06. ACM Press, New York, New York, USA, 1077--1086.  ",
      "doi": "10.1145/1124772.1124933"
    }
  ]
}