{
  "doi": "10.1145/3290605.3300654",
  "title": "Understanding the Impact of TVIs on Technology Use and Selection by Children with Visual Impairments",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "The use of technology in educational settings is extremely common. For many visually impaired children, educational settings are the first place they are exposed to the assistive technology that they will need to access mainstream computing devices. Current laws provide support for students to receive training from Teachers of the Visually Impaired (TVIs) on these assistive devices. Therefore, TVIs play an important role in the selection and training of technology. Through our interviews with TVIs, we discovered the factors that impact which technologies they select, how they attempt to mitigate the stigma associated with certain technologies, and the challenges that students face in learning assistive technologies. Through this research, we identified three needs that future research on assistive technology should address: (1) increasing focus on built-in accessibility features, (2) providing support for independent learning and exploration, and (3) creating technologies that can support users with progressive vision loss.",
  "authors": [
    {
      "name": "Catherine M. Baker",
      "institution": "Creighton University, Omaha, NE, USA",
      "img": "/do/10.1145/contrib-81458642818/rel-imgonly/catieheadshot.jpeg",
      "acmid": "81458642818",
      "orcid": "missing"
    },
    {
      "name": "Lauren R. Milne",
      "institution": "Macalester University, St Paul, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358939557",
      "orcid": "missing"
    },
    {
      "name": "Richard E. Ladner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100297556/rel-imgonly/ladner3.jpg",
      "acmid": "81100297556",
      "orcid": "0000-0001-9413-6774"
    }
  ],
  "references": [
    {
      "text": "American Printing House for the Blind. APH - Distribution of Eligible Students Based on the Federal Quota Census of January 6, 2014. Retrieved from http://www.aph.org/federalquota/distribution-2015/",
      "doi": ""
    },
    {
      "text": "Andrew Leibs. Learn Why iPad Is a Great Learning Tool for Visually Impaired Students. Lifewire. Retrieved July 18, 2018 from https://www.lifewire.com/ipad-ideal-tool-blind-visually-impaired198768%0A",
      "doi": ""
    },
    {
      "text": "Robert J. Beadles Jr. 2007. Identification of Statewide Services and Best Educational Practices for Washington State Students Who are Blind, Visually Impaired, and with Multiple Disabilities: A Study of the Washington State School for the Blind and Related Statewide Services. VI RehaB Consulting. Retrieved from http://www.iowaregents.edu/media/cms/wastatereportfinalreportju ne202007-pdf5A486AE7.pdf",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Jane E, Martez E. Mott, Edward Cutrell, and Meredith Ringel Morris. 2018. How teens with visual impairments take, edit, and share photos on social media. Conference on Human Factors in Computing Systems - Proceedings 2018--April: 1--12.  ",
      "doi": "10.1145/3173574.3173650"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, Yu Zhong, Samuel White, and Jeffrey P. Bigham. 2013. Visual challenges in the everyday lives of blind people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13, 2117.  ",
      "doi": "10.1145/2470654.2481291"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative Accessibility. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, 2373--2382.  ",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. The Invisible Work of Accessibility: How Blind Employees Manage Accessibility in Mixed-Ability Workplaces. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility - ASSETS '15, 163--171.  ",
      "doi": "10.1145/2700648.2809864"
    },
    {
      "text": "Brian M. Celusnak. 2016. Teaching the iPhone with Voiceover Accessibility to People with Visual Impairments. Journal of Visual Impairment & Blindness 110, 5: 369--372. Retrieved from https://files.eric.ed.gov/fulltext/EJ1114771.pdf",
      "doi": ""
    },
    {
      "text": "Michael D. Crossland, Rui S. Silvia, and Antonio F. Macedo. 2014. Smartphone, tablet computer and e-reader use by people with vision impairment. Ophthalmic and Physiological Optics 34, 5: 552-- 557.",
      "doi": ""
    },
    {
      "text": "IDEIA. 2004. Individuals with disabilities education improvement act.",
      "doi": ""
    },
    {
      "text": "Washington Institute of Education Sciences (ED) DC. 2006. National Center for Special Education Research (NCSER) Projects and Programs: PEELS. Retrieved from https://ies.ed.gov/ncser/projects/peels/",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Chandrika Jayant, Jacob O. Wobbrock, and Richard E. Ladner. 2009. Freedom to roam. In Proceeding of the eleventh international ACM SIGACCESS conference on Computers and accessibility - ASSETS '09, 115.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Stacy M. Kelly. 2009. Use of Assistive Technology by Students with Visual Impairments: Findings from a National Survey. Journal of Visual Impairment & Blindness 103, 8: 470--480.",
      "doi": ""
    },
    {
      "text": "Amanda Lenhart. 2015. Teens, social media and technology overview 2015: Smartphones facilitate shifts in communication landscape for teens. Pew Research Center, 1--47.",
      "doi": ""
    },
    {
      "text": "Bianca Della Líbera and Claudia Jurberg. 2017. Teenagers with visual impairment and new media: A world without barriers. British Journal of Visual Impairment 35, 3: 247--256.",
      "doi": ""
    },
    {
      "text": "Craig Allan Meador. 2015. Meeting the needs of visually impaired students in Washington state: an exploratory study of the working conditions that affect teachers of the visually impaired. Washington State University. Retrieved from https://research.libraries.wsu.edu:8443/xmlui/bitstream/handle/2376 /5467/Meador_wsu_0251E_11319.pdf;sequence=1",
      "doi": ""
    },
    {
      "text": "Oussama Metatla and Clare Cullen. 2018. Bursting the Assistance Bubble. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--14.  ",
      "doi": "10.1145/3173574.3173920"
    },
    {
      "text": "Oussama Metatla and Oussama. 2017. Uncovering Challenges and Opportunities for Including Visually-Impaired and Blind Children in Mainstream Schools. In Proceedings of the 31st British Computer Society Human Computer Interaction Conference, 1--6.  ",
      "doi": "10.14236/ewic/HCI2017.102"
    },
    {
      "text": "Betsy Phillips and Hongxin Zhao. 1993. Predictors of assistive technology abandonment. Assistive technology: the official journal of RESNA 5, 1: 36--45.",
      "doi": ""
    },
    {
      "text": "Vicky Rideout. 2015. The Common Sense Census: Media Use By Tweens and Teens. Common Sense Media, 1--104.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2011. In the Shadow of Misperception: Assistive Technology Use and Social Interactions. In Proceedings of the 2011 Annual Conference on Human Factors in Computing Systems - CHI '11, 705.  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Sylvia Söderström and Borgunn Ytterhus. 2010. The use and non? use of assistive technologies from the world of information and communication technology by visually impaired young people: a walk on the tightrope of peer inclusion. Disability & Society 25, 3: 303--315.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet M. Corbin. 1990. Basics of qualitative research: Grounded theory procedures and techniques. Sage Publications, Inc, Thousand Oaks, CA, US.",
      "doi": ""
    },
    {
      "text": "Sarit Felicia Anais Szpiro, Shafeka Hashash, Yuhang Zhao, and Shiri Azenkot. 2016. How People with Low Vision Access Computing Devices. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '16 (ASSETS '16), 171--180.  ",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "Annuska Zolyomi, Anushree Shukla, and Jaime Snyder. 2017. Technology-Mediated Sight. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility ASSETS '17, 220--229.  ",
      "doi": "10.1145/3132525.3132552"
    },
    {
      "text": "SEELS Info & Reports: Behind the Label. Retrieved from https://www.seels.net/info_reports/visual_impairment.htm",
      "doi": ""
    },
    {
      "text": "WebAIM: Screen Reader User Survey #7 Results. Retrieved May 8, 2018 from https://webaim.org/projects/screenreadersurvey7/",
      "doi": ""
    },
    {
      "text": "WebAIM: Survey of Users with Low Vision #2 Results. Retrieved December 28, 2018 from https://webaim.org/projects/lowvisionsurvey2/",
      "doi": ""
    },
    {
      "text": "The Common Sense Census: Media Use by Kids Age Zero to Eight 2017 | Common Sense Media. Retrieved February 17, 2018 from https://www.commonsensemedia.org/research/the-common-sensecensus-media-use-by-kids-age-zero-to-eight-2017",
      "doi": ""
    },
    {
      "text": "Special Education Elementary Longitudinal Study (SEELS) | SRI International. Retrieved April 12, 2018 from https://www.sri.com/work/projects/special-education-elementarylongitudinal-study-seels",
      "doi": ""
    }
  ]
}