{
  "doi": "10.1145/3290605.3300331",
  "title": "RayCursor: A 3D Pointing Facilitation Technique based on Raycasting",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Raycasting is the most common target pointing technique in virtual reality environments. However, performance on small and distant targets is impacted by the accuracy of the pointing device and the user's motor skills. Current pointing facilitation techniques are currently only applied in the context of the virtual hand, i.e. for targets within reach. We propose enhancements to Raycasting: filtering the ray, and adding a controllable cursor on the ray to select the nearest target. We describe a series of studies for the design of the visual feedforward, filtering technique, as well as a comparative study between different 3D pointing techniques. Our results show that highlighting the nearest target is one of the most efficient visual feedforward technique. We also show that filtering the ray reduces error rate in a drastic way. Finally we show the benefits of RayCursor compared to Raycasting and another technique from the literature.",
  "tags": [
    "visual feedforward",
    "pointing technique",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Marc Baloup",
      "institution": "Université de Lille & Inria, Villeneuve d'Ascq, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659348668",
      "orcid": "missing"
    },
    {
      "name": "Thomas Pietrzak",
      "institution": "Université de Lille & UMR 9189 - CRIStAL, Villeneuve d'Ascq, France",
      "img": "/do/10.1145/contrib-81316490016/rel-imgonly/photo.jpg",
      "acmid": "81316490016",
      "orcid": "missing"
    },
    {
      "name": "Géry Casiez",
      "institution": "Université de Lille & UMR 9189 - CRIStAL, Villeneuve d'Ascq, France",
      "img": "/do/10.1145/contrib-81100168597/rel-imgonly/gerycasieznewlowres.png",
      "acmid": "81100168597",
      "orcid": "0000-0003-1905-815X"
    }
  ],
  "references": [
    {
      "text": "Ferran Argelaguet and Carlos Andujar. 2013. A survey of 3D object selection techniques for virtual environments. Computers and Graphics 37, 3 (2013), 121 -- 136. RayCursor CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk  ",
      "doi": "10.1016/j.cag.2012.12.003"
    },
    {
      "text": "Marc Baloup, Veis Oudjail, Thomas Pietrzak, and Géry Casiez. 2018. Pointing Techniques for Distant Targets in Virtual Reality. In Proceedings of the AFIHM Conférence Francophone sur l'interaction HommeMachine (IHM 2018) (Articles Scientifiques). Brest, France, 8. https: //hal.archives-ouvertes.fr/hal-01899061  ",
      "doi": "10.1145/3286689.3286696"
    },
    {
      "text": "Renaud Blanch, Yves Guiard, and Michel Beaudouin-Lafon. 2004. Semantic Pointing: Improving Target Acquisition with Control-display Ratio Adaptation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 519--526.  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Doug A. Bowman, Ernst Kruijff, Joseph J. LaViola, and Ivan Poupyrev. 2004. 3D User Interfaces: Theory and Practice. Addison Wesley Longman Publishing Co., Inc., Redwood City, CA, USA. ",
      "doi": "10.5555/993837"
    },
    {
      "text": "George EP Box and David R Cox. 1964. An analysis of transformations. Journal of the Royal Statistical Society. Series B (Methodological) (1964), 211--252.",
      "doi": ""
    },
    {
      "text": "Jeffrey Cashion, Chadwick Wingrave, and Joseph J LaViola Jr. 2012. Dense and dynamic 3d selection for game-based virtual environments. IEEE transactions on visualization and computer graphics 18, 4 (2012), 634--642.  ",
      "doi": "10.1109/TVCG.2012.40"
    },
    {
      "text": "Géry Casiez and Nicolas Roussel. 2011. No More Bricolage!: Methods and Tools to Characterize, Replicate and Compare Pointing Transfer Functions. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (UIST '11). ACM, New York, NY, USA, 603--614.  ",
      "doi": "10.1145/2047196.2047276"
    },
    {
      "text": "Géry Casiez, Nicolas Roussel, Romuald Vanbelleghem, and Frédéric Giraud. 2011. Surfpad: Riding Towards Targets on a Squeeze Film Effect. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2491--2500.  ",
      "doi": "10.1145/1978942.1979307"
    },
    {
      "text": "Géry Casiez, Nicolas Roussel, and Daniel Vogel. 2012. 1e Filter: A Simple Speed-based Low-pass Filter for Noisy Input in Interactive Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2527--2530.  ",
      "doi": "10.1145/2207676.2208639"
    },
    {
      "text": "Gerwin de Haan, Michal Koutek, and Frits H. Post. 2005. IntenSelect: Using Dynamic Object Rating for Assisting 3D Object Selection. In Proceedings of the 11th Eurographics Conference on Virtual Environments (EGVE'05). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 201--209. ",
      "doi": "10.5555/2385984.2386013"
    },
    {
      "text": "William Delamare, Céline Coutrix, and Laurence Nigay. 2013. Mobile Pointing Task in the Physical World: Balancing Focus and Performance While Disambiguating. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, USA, 89--98.  ",
      "doi": "10.1145/2493190.2493232"
    },
    {
      "text": "Niklas Elmqvist and Jean-Daniel Fekete. 2008. Semantic Pointing for Object Picking in Complex 3D Environments. In Proceedings of Graphics Interface 2008 (GI '08). Canadian Information Processing Society, Toronto, Ont., Canada, 243--250. http://dl.acm.org/citation. cfm?id=1375714.1375755 ",
      "doi": "10.5555/1375714.1375755"
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2005. The Bubble Cursor: Enhancing Target Acquisition by Dynamic Resizing of the Cursor's Activation Area. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2006. The Design and Evaluation of Selection Techniques for 3D Volumetric Displays. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, New York, NY, USA, 3--12.  ",
      "doi": "10.1145/1166253.1166257"
    },
    {
      "text": "Yves Guiard, Renaud Blanch, and Michel Beaudouin-Lafon. 2004. Object Pointing: A Complement to Bitmap Pointing in GUIs. In Proceedings of Graphics Interface 2004 (GI '04). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 9--16. http://dl.acm.org/citation. cfm?id=1006058.1006060 ",
      "doi": "10.5555/1006058.1006060"
    },
    {
      "text": "Maxime Guillon, François Leitner, and Laurence Nigay. 2014. Static Voronoi-Based Target Expansion Technique for Distant Pointing. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI 2014), Franca Garzotto, Paolo Paolini, Antonella De Angeli, Giulio Jacucci, Alessio Malizia, Maristella Matera, and Rosa Lanzilotti (Eds.). ACM, Como, Italy, 41--48.  ",
      "doi": "10.1145/2598153.2598178"
    },
    {
      "text": "Maxime Guillon, François Leitner, and Laurence Nigay. 2015. Investigating Visual Feedforward for Target Expansion Techniques. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2777--2786.  ",
      "doi": "10.1145/2702123.2702375"
    },
    {
      "text": "Aakar Gupta, Thomas Pietrzak, Cleon Yau, Nicolas Roussel, and Ravin Balakrishnan. 2017. Summon and Select: Rapid Interaction with Interface Controls in Mid-air. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY, USA, 52--61.  ",
      "doi": "10.1145/3132272.3134120"
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C. Goble, and Neal F. Kassell. 1994. A Survey of Design Issues in Spatial Input. In Proceedings of the 7th Annual ACM Symposium on User Interface Software and Technology (UIST '94). ACM, New York, NY, USA, 213--222.  ",
      "doi": "10.1145/192426.192501"
    },
    {
      "text": "Regis Kopper, Felipe Bacim, and Doug A Bowman. 2011. Rapid and accurate 3D selection by progressive refinement. In 2011 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, IEEE Computer Society, Washington, DC, USA, 67--74. ",
      "doi": "10.5555/2013881.2014213"
    },
    {
      "text": "Mikko Kytö, Barrett Ens, Thammathip Piumsomboon, Gun A. Lee, and Mark Billinghurst. 2018. Pinpointing: Precise Head- and Eye-Based Target Selection for Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 81, 14 pages.  ",
      "doi": "10.1145/3173574.3173655"
    },
    {
      "text": "Jiandong Liang and Mark Green. 1994. JDCAD: A highly interactive 3D modeling system. Computers & Graphics 18, 4 (1994), 499 -- 506.",
      "doi": ""
    },
    {
      "text": "Mark R Mine. 1995. Virtual environment interaction techniques. Technical Report. University of North Carolina, Chapel Hill, NC, USA. ",
      "doi": ""
    },
    {
      "text": "Mathieu Nancel, Olivier Chapuis, Emmanuel Pietriga, Xing-Dong Yang, Pourang P Irani, and Michel Beaudouin-Lafon. 2013. Highprecision pointing on large wall displays using small handheld devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 831--840.  ",
      "doi": "10.1145/2470654.2470773"
    },
    {
      "text": "Gang Ren and Eamonn O'Neill. 2013. 3D selection with freehand gesture. Computers & Graphics 37, 3 (May 2013), 101--120.  ",
      "doi": "10.1016/j.cag.2012.12.006"
    },
    {
      "text": "Hyocheol Ro, Seungho Chae, Inhwan Kim, Junghyun Byun, Yoonsik Yang, Yoonjung Park, and Tackdon Han. 2017. A dynamic depthvariable ray-casting interface for object manipulation in ar environments. In 2017 IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE Systems, Man, and Cybernetics Society, 2873-- 2878. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk M. Baloup et al.",
      "doi": ""
    },
    {
      "text": "Greg Schmidt, Yohan Baillot, Dennis G. Brown, Erik B. Tomlin, and J. Edward II Swan. 2006. Toward Disambiguating Multiple Selections for Frustum-Based Pointing. In Proceedings of the 3D User Interfaces (3DUI '06). IEEE Computer Society, Washington, DC, USA, 87--94.  ",
      "doi": "10.1109/VR.2006.133"
    },
    {
      "text": "Frank Steinicke, Timo Ropinski, and Klaus Hinrichs. 2004. Object selection in virtual environments with an improved virtual pointer metaphor. In Computer Vision and Graphics: International Conference, ICCVG 2004. Springer Netherlands, Warsaw, Poland, 320--326.",
      "doi": ""
    },
    {
      "text": "Lode Vanacken, Tovi Grossman, and Karin Coninx. 2007. Exploring the Effects of Environment Density and Target Visibility on Object Selection in 3D Virtual Environments. In 2007 IEEE Symposium on 3D User Interfaces. IEEE Computer Society, Washington, DC, USA.",
      "doi": ""
    },
    {
      "text": "Donald Lee Vickers. 1972. Sorcerer's Apprentice: Head-mounted Display and Wand. Ph.D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Vive. 2019. HTC Vive VR headset. https://www.vive.com/us/product/ vive-virtual-reality-system/, retrieved January 7th, 2019.",
      "doi": ""
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2005. Distant Freehand Pointing and Clicking on Very Large, High Resolution Displays. In Proceedings of the 18th Annual ACM Symposium on User Interface Software and Technology (UIST '05). ACM, New York, NY, USA, 33--42.  ",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    }
  ]
}