{
  "doi": "10.1145/3290605.3300287",
  "title": "Painting with CATS: Camera-Aided Texture Synthesis",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2019,
  "badges": [],
  "abstract": "We present CATS, a digital painting system that synthesizes textures from live video in real-time, short-cutting the typical brush- and texture- gathering workflow. Through the use of boundary-aware texture synthesis, CATS produces strokes that are non-repeating and blend smoothly with each other. This allows CATS to produce paintings that would be difficult to create with traditional art supplies or existing software. We evaluated the effectiveness of CATS by asking artists to integrate the tool into their creative practice for two weeks; their paintings and feedback demonstrate that CATS is an expressive tool which can be used to create richly textured paintings.",
  "tags": [
    "art",
    "creativity support",
    "digital painting"
  ],
  "authors": [
    {
      "name": "Ticha Sethapakdi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365879",
      "orcid": "0000-0002-4939-1087"
    },
    {
      "name": "James McCann",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81331499170/rel-imgonly/portrait.jpg",
      "acmid": "81331499170",
      "orcid": "0000-0002-4231-4142"
    }
  ],
  "references": [
    {
      "text": "{n. d.}. Adobe Capture. https://www.adobe.com/products/capture.html.",
      "doi": ""
    },
    {
      "text": "Adobe. 2010. Content-Aware Fill. https://research.adobe.com/project/content-aware-fill/",
      "doi": ""
    },
    {
      "text": "Bill Atkinson. {n. d.}. MacPaint. https://archive.org/details/mac_Paint_ 2.",
      "doi": ""
    },
    {
      "text": "Connelly Barnes, Dan B. Goldman, Eli Shechtman, and Adam Finkelstein. 2011. The PatchMatch Randomized Matching Algorithm for Image Manipulation. Commun. ACM 54, 11 (Nov. 2011), 103--110.  ",
      "doi": "10.1145/2018396.2018421"
    },
    {
      "text": "Connelly Barnes, Eli Shechtman, Adam Finkelstein, and Dan B Goldman. 2009. PatchMatch: A Randomized Correspondence Algorithm for Structural Image Editing. In ACM SIGGRAPH 2009 Papers (SIGGRAPH '09). ACM, New York, NY, USA, Article 24, 11 pages.  ",
      "doi": "10.1145/1576246.1531330"
    },
    {
      "text": "Erin A. Carroll and Celine Latulipe. 2009. The Creativity Support Index. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 4009--4014.  ",
      "doi": "10.1145/1520340.1520609"
    },
    {
      "text": "Soheil Darabi, Eli Shechtman, Connelly Barnes, Dan B. Goldman, and Pradeep Sen. 2012. Image Melding: Combining Inconsistent Images Using Patch-based Synthesis. ACM Trans. Graph. 31, 4, Article 82 (July 2012), 10 pages.  ",
      "doi": "10.1145/2185520.2185578"
    },
    {
      "text": "Olga Diamanti, Connelly Barnes, Sylvain Paris, Eli Shechtman, and Olga Sorkine-Hornung. 2015. Synthesis of Complex Image Appearance from Limited Exemplars. ACM Transactions on Graphics 34, 2 (2015).  ",
      "doi": "10.1145/2699641"
    },
    {
      "text": "Charles Han, Eric Risser, Ravi Ramamoorthi, and Eitan Grinspun. 2008. Multiscale Texture Synthesis. In ACM SIGGRAPH 2008 Papers (SIGGRAPH '08). ACM, New York, NY, USA, Article 51, 8 pages.  ",
      "doi": "10.1145/1399504.1360650"
    },
    {
      "text": "Anuruddha Hettiarachchi, Suranga Nanayakkara, Kian Peen Yeo, Roy Shilkrot, and Pattie Maes. 2013. FingerDraw: More Than a Digital Paintbrush. In Proceedings of the 4th Augmented Human International Conference (AH'13). ACM, New York, NY, USA, 1--4.  ",
      "doi": "10.1145/2459236.2459237"
    },
    {
      "text": "Craig Hickman. {n. d.}. Kid Pix - The Early Years. http://red-green-blue.com/kid-pix-the-early-years/.",
      "doi": ""
    },
    {
      "text": "Mami Kosaka and Kaori Fujinami. 2016. UnicrePaint: Digital Painting Through Physical Objects for Unique Creative Experiences. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 475--481.  ",
      "doi": "10.1145/2839462.2856553"
    },
    {
      "text": "Sylvain Lefebvre and Hugues Hoppe. 2005. Parallel Controllable Texture Synthesis. In ACM SIGGRAPH 2005 Papers (SIGGRAPH '05). ACM, New York, NY, USA, 777--786.  ",
      "doi": "10.1145/1186822.1073261"
    },
    {
      "text": "Sylvain Lefebvre and Hugues Hoppe. 2006. Appearance-space Texture Synthesis. In ACM SIGGRAPH 2006 Papers (SIGGRAPH '06). ACM, New York, NY, USA, 541--548.  ",
      "doi": "10.1145/1179352.1141921"
    },
    {
      "text": "Jingwan Lu, Connelly Barnes, Stephen DiVerdi, and Adam Finkelstein. 2013. RealBrush: Painting with Examples of Physical Media. ACM Trans. Graph. 32, 4, Article 117 (July 2013), 12 pages.  ",
      "doi": "10.1145/2461912.2461998"
    },
    {
      "text": "M. Lukac, P. Asente, J. Lu, E. Shechtman, and D. Sýkora. 2015. Brushables: Example-based Edge-aware Directional Texture Painting. Comput. Graph. Forum 34, 7 (Oct. 2015), 257--267.  ",
      "doi": "10.1111/cgf.12764"
    },
    {
      "text": "Michal Lukac, Jakub Fiser, Jean-Charles Bazin, Ondrej Jamriska, Alexander Sorkine-Hornung, and Daniel Sýkora. 2013. Painting by Feature: Texture Boundaries for Example-based Image Creation. ACM Trans. Graph. 32, 4, Article 116 (July 2013), 8 pages.  ",
      "doi": "10.1145/2461912.2461956"
    },
    {
      "text": "Lincoln Ritter, Wilmot Li, Brian Curless, Maneesh Agrawala, and David Salesin. 2006. Painting with Texture. In Proceedings of the 17th Eurographics Conference on Rendering Techniques (EGSR '06). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 371--376. ",
      "doi": "10.5555/2383894.2383941"
    },
    {
      "text": "Kimiko Ryokai, Stefan Marti, and Hiroshi Ishii. 2004. I/O Brush: Drawing with Everyday Objects As Ink. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 303--310.  ",
      "doi": "10.1145/985692.985731"
    },
    {
      "text": "Richard Shoup. {n. d.}. SuperPaint. https://web.archive.org/web/20020110013554/ http://www.rgshoup.com/prof/SuperPaint/.",
      "doi": ""
    },
    {
      "text": "Yonatan Wexler, Eli Shechtman, and Michal Irani. 2007. Space-Time Completion of Video. IEEE Trans. Pattern Anal. Mach. Intell. 29, 3 (March 2007), 463--476.  ",
      "doi": "10.1109/TPAMI.2007.60"
    }
  ]
}