{
  "doi": "10.1145/3290605.3300933",
  "title": "A Wee Bit More Interaction: Designing and Evaluating an Overactive Bladder App",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Overactive Bladder (OAB) is a widespread condition, affecting 20% of the population. Even though it is a treatable condition, people often do not seek treatment. In this paper, we describe how we co-designed and evaluated with 30 stakeholders (9 medical professionals and 21 end-users) an OAB mobile health application that aims to increase adherence to self-managed treatment. Our results support previous research that visualizing progress, setting goals, receiving reminders and feedback increases use. We discovered that games could be used successfully as a distraction technique for urge suppression. Contrary to the current research direction, automatically calculated features could be a detriment to app interaction. Regarding evaluation, we found that designers may not want to rely only on questionnaires when assessing the success of a game and its emotional impact on users.",
  "authors": [
    {
      "name": "Ana-Maria Salai",
      "institution": "Heriot-Watt University, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659301715",
      "orcid": "missing"
    },
    {
      "name": "Lynne Baillie",
      "institution": "Heriot-Watt University, Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100474822",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Association of Reproductive Health Professionals. 2011. Diagnosis and Management of Overactive Bladder.",
      "doi": ""
    },
    {
      "text": "Mobolaji Ayoade and Lynne Baillie. 2014. A novel knee rehabilitation system for the home. In Proc CHI '14.  ",
      "doi": "10.1145/2556288.2557353"
    },
    {
      "text": "Moses Akazue, Martin Halvey and Lynne Baillie. 2017. Using thermal stimuli to influence affect in different picture display sizes. Personal and Ubiquitous Computing.  ",
      "doi": "10.1007/s00779-017-1018-0"
    },
    {
      "text": "Lynne Baillie. 2002. The home workshop: a method for investigating the home. Ph.D. Dissertation. Edinburgh Napier University.",
      "doi": ""
    },
    {
      "text": "Lynne Baillie, Lee Morton, David C. Moffat and Stephen Uzor. 2011. Capturing the response of players to a location-based game. Personal and Ubiquitous Computing 15.1.  ",
      "doi": "10.1007/s00779-010-0309-5"
    },
    {
      "text": "Lynne Baillie and Raimund Schatz. 2005. Exploring multimodality in the laboratory and the field. In Proceedings of the 7th international conference on Multimodal interfaces.  ",
      "doi": "10.1145/1088463.1088482"
    },
    {
      "text": "Aaron Bangor, Philip T. Kortum and James T. Miller. 2008. An Empirical Evaluation of the System Usability Scale. International Journal of Human-Computer Interaction. 24 (6): 574--594.",
      "doi": ""
    },
    {
      "text": "Walter R. Boot, Arthur F. Kramer, Daniel J. Simons, Monica Fabiani and Gabriele Gratton. 2008. The effects of video game playing on attention, memory, and executive control. Acta psychologica 129.3: 387--398.",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS - A Quick and Dirty Usability Scale. Usability evaluation in industry, 189(194), pp.4--7.",
      "doi": ""
    },
    {
      "text": "Kathryn L. Burgio, Patricia S. Goode, Julie L. Locher, Mary G. Umlauf, David L. Roth, Holly E. Richter, Edward Varner and Keith Lloyd. 2002. Behavioural Training With and Without Biofeedback in the Treatment of Urge Incontinence in Older Women: A Randomized Controlled Trial. Journal of the American Medical Association",
      "doi": ""
    },
    {
      "text": "Michelle N. Burns, Mark Begale, Jennifer Duffecy, Darren Gergle, Chris J. Karr, Emily Giangrande and David C. Mohr. 2011. Harnessing context sensing to develop a mobile intervention for depression. Journal of medical Internet research, 13(3).",
      "doi": ""
    },
    {
      "text": "Candy Crush, https://candycrushsaga.com/en/",
      "doi": ""
    },
    {
      "text": "Guillaume Chanel, Cyril Rebetez, Mireille Bétrancourt and Thierry Pun. 2008. Boredom, engagement and anxiety as indicators for adaptation to difficulty in games. In Proceedings of the 12th international conference on Entertainment and media in the ubiquitous era. ACM.  ",
      "doi": "10.1145/1457199.1457203"
    },
    {
      "text": "Meng-Chieh Chiu, Shih-Ping Chang, Yu-Chen Chang, Hao-Hua Chu, Cheryl Chia-Hui Chen, Fei-Hsiu Hsiao and Ju-Chun Ko. 2009. Playful bottle: a mobile social persuasion system to motivate healthy water intake. Proceedings of the 11th international conference on Ubiquitous computing.  ",
      "doi": "10.1145/1620545.1620574"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. Proceedings of the 32nd annual ACM conference on Human factors in computing systems.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Sebastian Deterding, Andrés Lucero, Chulhong Min, Adrian Cheok, Annika Waern and Steffen Walz. 2015. Embarrassing interactions. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (pp. 2365--2368). ACM.  ",
      "doi": "10.1145/2702613.2702647"
    },
    {
      "text": "Julie A. Couture and Luc Valiquette. 2000. Urinary Incontinence. The Annals of Pharmacotherapy.",
      "doi": ""
    },
    {
      "text": "Karin S. Coyne, Alan Wein, Sean Nicholson, Marion Kvasz,Chieh-I Chen and Ian Milsom. 2014. Economic burden of urgency urinary incontinence in the United States: a systematic review. Journal of Managed Care Pharmacy.",
      "doi": ""
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi and John Zimmerman. 2017. UX Design Innovation: Challenges for Working with Machine Learning as a Design Material. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (pp. 278--288). ACM.  ",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "European Association of Urology, International Consultation on Urological Diseases. 2013. Incontinence.",
      "doi": ""
    },
    {
      "text": "Final Blog Post: TETRIS and Other Videogames' Effects on PTSD. March 2013. https://chcgamestudies.wordpress.com/2013/03/18/2973/",
      "doi": ""
    },
    {
      "text": "Eva Geurts, Mieke Haesen, Paul Dendale, Kris Luyten and Karin Coninx. 2016. Back on bike: the BoB mobile cycling app for secondary prevention in cardiac patients. Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services.  ",
      "doi": "10.1145/2935334.2935377"
    },
    {
      "text": "Barney G. Glaser and Anselm L. Strauss. 1967. The discovery of Grounded Theory: Strategies for Qualitative Research. Transaction Publishers.",
      "doi": ""
    },
    {
      "text": "Google Maps, https://en.wikipedia.org/wiki/Google_Maps?",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Vasudhara Kantroo and Rebecca E. Grinter. 2010. Let's play!: mobile health games for adults. Proceedings of the 12th ACM international conference on Ubiquitous computing, Pages 241250.  ",
      "doi": "10.1145/1864349.1864370"
    },
    {
      "text": "Lilit Hakobyan, Jo Lumsden, Rachel Shaw and Dympna O'Sullivan. 2016. A longitudinal evaluation of the acceptability and impact of a diet diary app for older adults with age-related macular degeneration. Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services.  ",
      "doi": "10.1145/2935334.2935356"
    },
    {
      "text": "Sandra G. Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the human factors and ergonomics society annual meeting (Vol. 50, No. 9, pp. 904--908). Sage CA: Los Angeles, CA: Sage Publications.",
      "doi": ""
    },
    {
      "text": "Richard Harte, Leo R Quinlan, Liam Glynn, Alejandro RodríguezMolinero, Paul MA Baker,Thomas Scharf and Gearóid ÓLaighin. 2017. Human-centered design study: enhancing the usability of a mobile phone app in an integrated falls risk detection system for use by older adult users. JMIR mHealth and uHealth.",
      "doi": ""
    },
    {
      "text": "Jennifer Healey, Pete Denman, Haroon Syed, Lama Nachman and Susanna Raj. 2018. Circles vs. scales: an empirical evaluation of emotional assessment GUIs for mobile phones. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (p. 12). ACM.  ",
      "doi": "10.1145/3229434.3229440"
    },
    {
      "text": "iP Voiding Diary. 2017. https://itunes.apple.com/us/app/ip-voidingdiary/id482034478?mt=8",
      "doi": ""
    },
    {
      "text": "Debra E. Irwin, Zoe S. Kopp, Barnabie Agatep, Ian Milsom and Paul Abrams. 2011. Worldwide prevalence estimates of lower urinary tract symptoms, overactive bladder, urinary incontinence and bladder outlet obstruction. BJU International.",
      "doi": ""
    },
    {
      "text": "Simon Jackson. 1997. The Patient with an overactive bladder -- symptoms and quality-of-life issues. Urology.",
      "doi": ""
    },
    {
      "text": "Maia Jacobs, James Clawson and Elizabeth D. Mynatt. 2016. A Cancer Journey Framework: Guiding the Design of Holistic Health Technology. Proc. 10th EAI Int'l Conf. Pervasive Computing Technologies for Healthcare. ",
      "doi": "10.5555/3021319.3021337"
    },
    {
      "text": "Hilmi Güne Kayacik, Mike Just, Lynne Baillie, David Aspinall, Nicholas Micallef. 2014.Data driven authentication: On the effectiveness of user behaviour modelling with mobile device sensors. In Proceedings of the Third Workshop on Mobile Security Technologies arXiv:1410.7743.",
      "doi": ""
    },
    {
      "text": "Kegel Trainer - Pelvic floor exercises. 2017. https://itunes.apple.com/gb/app/kegel-trainer-pelvicfloor/id578148339?mt=8",
      "doi": ""
    },
    {
      "text": "Paul Lukowicz, Tnde Kirstein and Gerhard Troster. 2004. Wearable systems for health care applications. Methods of information in Medicine.",
      "doi": ""
    },
    {
      "text": "Mark Matthews, Stephen Voida, Saeed Abdullah, Gavin Doherty, Tanzeem Choudhury, Sangha Im and Geri Gay. 2015. In situ design for mental illness: considering the pathology of bipolar disorder in mHealth design. Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services.  ",
      "doi": "10.1145/2785830.2785866"
    },
    {
      "text": "Nicholas Micallef, Lynne Baillie and Stephen Uzor. 2016. Time to Exercise! An Aide-Memoire Stroke App for Post-Stroke Arm Rehabilitation. In Proc. ACM MobileHCI.  ",
      "doi": "10.1145/2935334.2935338"
    },
    {
      "text": "Nicholas Micallef, Mike Just, Lynne Baillie, Martin Halvey and Hilmi Güne Kayacik. 2015. Why aren't Users Using Protection? Investigating the Usability of Smartphone Locking. Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, Pages 284--294  ",
      "doi": "10.1145/2785830.2785835"
    },
    {
      "text": "Rowland S. Miller. 1996. Emotions and social behavior. Embarrassment: Poise and peril in everyday life. New York, NY, US: Guilford Press.",
      "doi": ""
    },
    {
      "text": "Chulhong Min, Saumay Pushp, Seungchul Lee, Inseok Hwang, Youngki Lee, Seungwoo Kang and Junehwa Song. 2014. Uncovering embarrassing moments in in-situ exposure of incoming mobile messages. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication.  ",
      "doi": "10.1145/2638728.2641288"
    },
    {
      "text": "Hendrik Müller, Aaron Sedley and Elizabeth Ferrall-Nunge. Survey research in HCI. Ways of Knowing in HCI. Springer, New York, NY, 2014. 229--266.",
      "doi": ""
    },
    {
      "text": "My pelvic floor Fitness. 2016. http://www.lightsbytena.co.uk/mypelvic-floor-fitness/app-info/",
      "doi": ""
    },
    {
      "text": "Tom Owen, Jennifer Pearson, Harold Thimbleby and George Buchanan. 2015. ConCap: Designing to Empower Individual Reflection on Chronic Conditions using Mobile Apps. Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services.  ",
      "doi": "10.1145/2785830.2785881"
    },
    {
      "text": "Jeni Paay, Jesper Kjeldskov, Umachanger Brinthaparan, Lars Lichon, Stephan Rasmussen, Nirojan Srikandaraja, Wally Smith, Greg Wadley and Bernd Ploderer. 2014. Quitty: using technology to persuade smokers to quit. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational. ACM.  ",
      "doi": "10.1145/2639189.2639195"
    },
    {
      "text": "Bernd Ploderer, Wally Smith, Jon Pearce and Ron Borland. 2014. A mobile app offering distractions and tips to cope with cigarette craving: a qualitative study. JMIR mHealth and uHealth 2.2.",
      "doi": ""
    },
    {
      "text": "Jesper Kjeldskov and Mikael B. Skov. 2014. Was it worth the hassle?: ten years of mobile HCI research discussions on lab and field evaluations. In: Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. ACM.  ",
      "doi": "10.1145/2628363.2628398"
    },
    {
      "text": "Alessandro Puiatti, Steven Mudda, Silvia Giordano and Oscar Mayora. 2011. Smartphone-centred wearable sensors network for monitoring patients with bipolar disorder. In Engineering in Medicine and Biology Society, EMBC, 2011 annual international conference of the IEEE.",
      "doi": ""
    },
    {
      "text": "William T. Riley, Daniel E. Rivera, Audie A. Atienza, Wendy Nilsen, Susannah M. Allison and Robin Mermelstein. 2011. Health behaviour models in the age of mobile interventions: are our theories up to the task?. Translational Behavioural Medicine, Volume 1, Issue 1.",
      "doi": ""
    },
    {
      "text": "James A. Russell and Merry Bullock. 1985.Multidimensional scaling of emotional facial expressions of emotion. J Pers Soc Psychol 48:1290--1298",
      "doi": ""
    },
    {
      "text": "Ana-Maria Salai and Lynne Baillie. 2018. Exploring the Key Design Functions of an Overactive Bladder Mobile Health Application. In Proceedings of the 20th International Conference on HumanComputer Interaction with Mobile Devices and Services Adjunct (pp. 229--236). ACM.  ",
      "doi": "10.1145/3236112.3236144"
    },
    {
      "text": "Chris Shaw. 2001. A review of the psychosocial predictors of help? seeking behaviour and impact on quality of life in people with urinary incontinence. Journal of Clinical Nursing.",
      "doi": ""
    },
    {
      "text": "Smartphone adoption in the United Kingdom (UK) from 2011 to 2018. 2018. https://www.statista.com/statistics/271460/smartphone-adoptionin-the-united-kingdom-uk/",
      "doi": ""
    },
    {
      "text": "Solitaire, https://en.wikipedia.org/wiki/Patience_(game)",
      "doi": ""
    },
    {
      "text": "Squeezy - the NHS Physiotherapy App for Pelvic Floor Muscle Exercises. 2015. https://itunes.apple.com/gb/app/squeezy-nhsphysiotherapy/id700740791?mt=8",
      "doi": ""
    },
    {
      "text": "David O. Sussman. 2007. Overactive Bladder: Treatment Options in Primary Care Medicine. The Journal of the American Osteopathic Association, Vol 107, No 9.",
      "doi": ""
    },
    {
      "text": "UroToday Bladder Diary App. 2015. http://www.urotoday.com/about/1214-site-pages/53578-urotodaybladder-diary-app.html",
      "doi": ""
    },
    {
      "text": "Stephen Uzor, Lynne Baillie and Dawn Skelton. 2012. Senior Designers: Empowering Seniors to Design Enjoyable Falls Rehabilitation Tools. In Proc. ACM CHI'12.  ",
      "doi": "10.1145/2207676.2208568"
    },
    {
      "text": "Stephen Uzor and Lynne Baillie. 2018. Exploring the Communication of Progress in Home-based Falls Rehabilitation using Exergame Technologies. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies.  ",
      "doi": "10.1145/3161195"
    },
    {
      "text": "Leena Ventä, Minna Isomursu, Aino Ahtinen and Shruti Ramiah. 2008. My Phone is a Part of My Soul -- How People Bond with Their Mobile Phones. In Proc. ACM MobileHCI'08.",
      "doi": ""
    },
    {
      "text": "Lois M. Verbrugg 1980. Health diaries. Medical care 18.1: 73--95.",
      "doi": ""
    },
    {
      "text": "Graham Wilson and Stephen A. Brewster. 2017. Multi-Moji: Combining Thermal, Vibrotactile & Visual Stimuli to Expand the Affective Range of Feedback. In Proc. CHI'17.  ",
      "doi": "10.1145/3025453.3025614"
    },
    {
      "text": "2048, https://en.wikipedia.org/wiki/2048_(video_game)",
      "doi": ""
    }
  ]
}