{
  "doi": "10.1145/3290605.3300802",
  "title": "REsCUE: A framework for REal-time feedback on behavioral CUEs using multimodal anomaly detection",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Executive coaching has been drawing more and more attention for developing corporate managers. While conversing with managers, coach practitioners are also required to understand internal states of coachees through objective observations. In this paper, we present REsCUE, an automated system to aid coach practitioners in detecting unconscious behaviors of their clients. Using an unsupervised anomaly detection algorithm applied to multimodal behavior data such as the subject's posture and gaze, REsCUE notifies behavioral cues for coaches via intuitive and interpretive feedback in real-time. Our evaluation with actual coaching scenes confirms that REsCUE provides the informative cues to understand internal states of coachees. Since REsCUE is based on the unsupervised method and does not assume any prior knowledge, further applications beside executive coaching are conceivable using our framework.",
  "tags": [
    "executive coaching",
    "anomaly detection",
    "multimodal interaction",
    "nonverbal behavior analysis"
  ],
  "authors": [
    {
      "name": "Riku Arakawa",
      "institution": "University of Tokyo, Hongo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365318",
      "orcid": "0000-0001-7868-4754"
    },
    {
      "name": "Hiromu Yakura",
      "institution": "Teambox Inc. & University of Tsukuba, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527198",
      "orcid": "0000-0002-2558-735X"
    }
  ],
  "references": [
    {
      "text": "Jagdishkumar Aggarwal and Michael S. Ryoo. 2011. Human activity analysis: A review. Comput. Surveys 43, 3 (2011), 16:1--16:43.  ",
      "doi": "10.1145/1922649.1922653"
    },
    {
      "text": "Stanley Feldstein Aron W. Siegman (Ed.). 1978. Nonverbal Behavior and Communication. Lawrence Erlbaum Associates, Hillsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Andromachi Athanasopoulou and Sue Dopson. 2018. A systematic review of executive coaching outcomes: Is it the journey or the destination that matters the most? The Leadership Quarterly 29, 1 (2018), 70--88.",
      "doi": ""
    },
    {
      "text": "Tatiana Bachkirova. 2014. Psychological development in adulthood and coaching. In The Complete Handbook of Coaching (2 ed.), Elaine Cox, Tatiana Bachkirova, and David Clutterbuck (Eds.). SAGE Publications, London.",
      "doi": ""
    },
    {
      "text": "Cigdem Beyan, Francesca Capozzi, Cristina Becchio, and Vittorio Murino. 2018. Prediction of the Leadership Style of an Emergent Leader Using Audio and Visual Nonverbal Features. IEEE Transaction on Multimedia 20, 2 (2018), 441--456.  ",
      "doi": "10.1109/TMM.2017.2740062"
    },
    {
      "text": "Gary S. Bloom, Claire L. Castagna, Ellen Moir, and Betsy Warren (Eds.). 2005. Blended Coaching: Skills and Strategies to Support Principal Development. Corwin Press, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Dawn Brooker. 2003. What is person-centred care in dementia? Reviews in Clinical Gerontology 13, 3 (2003), 215--222.",
      "doi": ""
    },
    {
      "text": "Kirk W. Brown and D. S. Moskowitz. 1998. Dynamic Stability of Behavior: The Rhythms of Our Interpersonal Lives. Journal of Personality 66, 1 (1998), 105--134.",
      "doi": ""
    },
    {
      "text": "Nathan David Butzen, Victor Bissonnette, and Dan McBrayer. 2005. Effects of Modeling and Topic Stimulus on Self-Referent Touching. Perceptual and Motor Skills 101, 2 (2005), 413--420.",
      "doi": ""
    },
    {
      "text": "Laurie Carr, Marco Iacoboni, Marie-Charlotte Dubeau, John C. Mazziotta, and Gian Luigi Lenzi. 2003. Neural mechanisms of empathy in humans: A relay from neural systems for imitation to limbic areas. Proceedings of the National Academy of Sciences 100, 9 (2003), 5497--5502.",
      "doi": ""
    },
    {
      "text": "Varun Chandola, Arindam Banerjee, and Vipin Kumar. 2009. Anomaly detection: A survey. Comput. Surveys 41, 3 (2009), 15:1--15:58.  ",
      "doi": "10.1145/1541880.1541882"
    },
    {
      "text": "Elaine Cox. 2015. Coaching and Adult Learning: Theory and Practice. New Directions for Adult and Continuing Education 2015, 148 (2015), 27--38.",
      "doi": ""
    },
    {
      "text": "Rita Cucchiara, Costantino Grana, Andrea Prati, and Roberto Vezzani. 2005. Probabilistic posture classification for human-behavior analysis. IEEE Transaction on Systems, Man, and Cybernetics, Part A 35, 1 (2005), 42--54.  ",
      "doi": "10.1109/TSMCA.2004.838501"
    },
    {
      "text": "Ilke Çugu, Eren Sener, and Emre Akbas. 2017. MicroExpNet: An Extremely Small and Fast Model For Expression Recognition From Frontal Face Images. arXiv 1711.07011 (2017), 1--9. http://arxiv.org/ abs/1711.07011",
      "doi": ""
    },
    {
      "text": "Ionut Damian and Elisabeth André. 2016. Exploring the Potential of Realtime Haptic Feedback during Social Interactions. In Proceedings of the 10th International Conference on Tangible and Embedded Interaction. ACM, New York, NY, 410--416.  ",
      "doi": "10.1145/2839462.2856519"
    },
    {
      "text": "Ionut Damian, Tobias Baur, and Elisabeth André. 2016. Measuring the impact of multimodal behavioural feedback loops on social interactions. In Proceedings of the 18th ACM International Conference on Multimodal Interaction. ACM, New York, NY, 201--208.  ",
      "doi": "10.1145/2993148.2993174"
    },
    {
      "text": "Ionut Damian, Chiew Seng Sean Tan, Tobias Baur, Johannes Schöning, Kris Luyten, and Elisabeth André. 2015. Augmenting Social Interactions: Realtime Behavioural Feedback using Social Signal Processing Techniques. In Proceedings of the 2015 ACM SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 565--574.  ",
      "doi": "10.1145/2702123.2702314"
    },
    {
      "text": "Charles Darwin. 1872. The Expression of the Emotions in Man and Animals. John Murray, London.",
      "doi": ""
    },
    {
      "text": "Bella M DePaulo. 1992. Nonverbal behavior and self-presentation. Psychological bulletin 111, 2 (1992), 203.",
      "doi": ""
    },
    {
      "text": "Aaron E. Sklar and Nadine Sarter. 2000. Good Vibrations: Tactile Feedback in Support of Attention Allocation and Human-Automation Coordination in Event-Driven Domains. Human Factors 41 (2000), 543--52.",
      "doi": ""
    },
    {
      "text": "Paul Ekman, Wallace V Friesen, Maureen O'Sullivan, and Klaus Scherer. 1980. Relative importance of face, body, and speech in judgments of personality and affect. Journal of Personality and Social Psychology 38, 2 (1980), 270--277.",
      "doi": ""
    },
    {
      "text": "Andrea D. Ellinger, Alexander E. Ellinger, and Scott B. Keller. 2003. Supervisory coaching behavior, employee satisfaction, and warehouse employee performance: A dyadic perspective in the distribution industry. Human Resource Development Quarterly 14, 4 (2003), 435--458.",
      "doi": ""
    },
    {
      "text": "Ronald Fagin, Ravi Kumar, and D. Sivakumar. 2003. Comparing Top k Lists. SIAM Journal of Discrete Mathematics 17, 1 (2003), 134--160.  ",
      "doi": "10.1137/S0895480102412856"
    },
    {
      "text": "Daniel C. Feldman and Melenie J. Lankau. 2005. Executive Coaching: A Review and Agenda for Future Research. Journal of Management 31, 6 (2005), 829--848.",
      "doi": ""
    },
    {
      "text": "Annette Fillery-Travis and David Lane. 2006. Does coaching work or are we asking the wrong question? International Coaching Psychology Review 1, 1 (2006), 24--36.",
      "doi": ""
    },
    {
      "text": "Carol Kinsey Goman. 2008. The Nonverbal Advantage: Secrets and Science of Body Language at Work. Berrett-Koehler, San Francisco, CA.",
      "doi": ""
    },
    {
      "text": "Anthony M. Grant. 2007. Enhancing coaching skills and emotional intelligence through training. Industrial and Commercial Training 39, 5 (2007), 257--266.",
      "doi": ""
    },
    {
      "text": "Ewan C. Grant. 1969. Human Facial Expression. Man 4, 4 (1969), 525--692.",
      "doi": ""
    },
    {
      "text": "Robert G. Hamlin, Andrea D. Ellinger, and Rona S. Beattie. 2008. The emergent \"coaching industry': a wake-up call for HRD professionals. Human Resource Development International 11, 3 (2008), 287--305.",
      "doi": ""
    },
    {
      "text": "Robert Gale Harper, Joseph D Matarazzo, and Arthur N Wiens. 1978. Nonverbal Communication : The State of the Art. Wiley, New York, NY.",
      "doi": ""
    },
    {
      "text": "Taher H. Haveliwala. 2003. Topic-Sensitive PageRank: A ContextSensitive Ranking Algorithm for Web Search. IEEE Transaction on Knowledge and Data Engineering 15, 4 (2003), 784--796.  ",
      "doi": "10.1109/TKDE.2003.1208999"
    },
    {
      "text": "Mohammed (Ehsan) Hoque, Matthieu Courgeon, Jean-Claude Martin, Bilge Mutlu, and Rosalind W. Picard. 2013. MACH: my automated conversation coach. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, New York, NY, 697--706.  ",
      "doi": "10.1145/2493432.2493502"
    },
    {
      "text": "Patrizia M Ianiro and Simone Kauffeld. 2014. Take care what you bring with you: How coaches' mood and interpersonal behavior affect coaching success. Consulting Psychology Journal: Practice and Research 66, 3 (2014), 231--257.",
      "doi": ""
    },
    {
      "text": "Baek-Kyoo Joo. 2005. Executive coaching: A conceptual framework from an integrative review of practice and research. Human Resource Development Review 4, 4 (2005), 462--488.",
      "doi": ""
    },
    {
      "text": "Richard R. Kilburg. 2000. Executive coaching: Developing managerial wisdom in a world of chaos. American Psychological Association, Washington, DC.",
      "doi": ""
    },
    {
      "text": "Gail King. 1999. Counselling skills for teachers: Talking matters. Open University Press, Berkshire.",
      "doi": ""
    },
    {
      "text": "Lance M Kinseth. 1989. Nonverbal training for psychotherapy: Overcoming barriers to clinical work with client nonverbal behavior. The Clinical Supervisor 7, 1 (1989), 5--25.",
      "doi": ""
    },
    {
      "text": "Richard Koonce. 1994. One on One. Training & Development 48, 2 (1994), 34--40.",
      "doi": ""
    },
    {
      "text": "Karren Kowalski and Colleen Casper. 2007. The Coaching Process: An Effective Tool for Professional Development. Nursing Administration Quarterly 31, 2 (2007), 171--179.",
      "doi": ""
    },
    {
      "text": "Kazutaka Kurihara, Masataka Goto, Jun Ogata, Yosuke Matsusaka, and Takeo Igarashi. 2007. Presentation sensei: a presentation training system using speech and image processing. In Proceedings of the 9th ACM International Conference on Multimodal Interaction. ACM, 358-- 365.  ",
      "doi": "10.1145/1322192.1322256"
    },
    {
      "text": "Paula V. Lippard. 1988. \"Ask me no questions, I'll tell you no lies\": Situational exigencies for interpersonal deception. Western Journal of Speech Communication 52, 1 (1988), 91--103.",
      "doi": ""
    },
    {
      "text": "Michael J. Lyons, Shigeru Akamatsu, Miyuki Kamachi, and Jiro Gyoba. 1998. Coding Facial Expressions with Gabor Wavelets. In Proceedings of the 3rd IEEE International Conference on Automatic Face and Gesture Recognition. IEEE Computer Society, Washington, DC, 200--205. ",
      "doi": "10.5555/520809.796143"
    },
    {
      "text": "Skanda Muralidhar, Jean M. R. Costa, Laurent Son Nguyen, and Daniel Gatica-Perez. 2016. Dites-moi: wearable feedback on conversational behavior. In Proceedings of The 15th International Conference on Mobile and Ubiquitous Multimedia. ACM, New York, NY, 261--265.  ",
      "doi": "10.1145/3012709.3012733"
    },
    {
      "text": "Anh-Tuan Nguyen, Wei Chen, and Matthias Rauterberg. 2012. Online feedback system for public speakers. In Proceedings of the 2012 IEEE Symposium on E-Learning, E-Management and E-Services. IEEE Computer Society, Washington, DC, 1--5.",
      "doi": ""
    },
    {
      "text": "Fumio Nihei, Yukiko I. Nakano, and Yutaka Takase. 2017. Predicting meeting extracts in group discussions using multimodal convolutional neural networks. In Proceedings of the 19th ACM International Conference on Multimodal Interaction. ACM, New York, NY, 421--425.  ",
      "doi": "10.1145/3136755.3136803"
    },
    {
      "text": "Erik C Nook, Kristen A Lindquist, and Jamil Zaki. 2015. A new look at emotion perception: Concepts speed and shape facial emotion recognition. Emotion 15, 5 (2015), 569--578.",
      "doi": ""
    },
    {
      "text": "Ke ¸stutis Peleckis, Valentina Peleckien e, Ke ¸stutis Peleckis, and Tatjana Polajeva. 2016. Towards sustainable entrepreneurship: role of nonverbal communication in business negotiations. Entrepreneurship and Sustainability Issues 4, 2 (2016), 228--239.",
      "doi": ""
    },
    {
      "text": "Joseph O. Rentz, C. David Shepherd, Armen Tashchian, Pratibha A. Dabholkar, and Robert T. Ladd. 2002. A measure of selling skill: Scale development and validation. The Journal of Personal Selling & Sales Management 22, 1 (2002), 13--21.",
      "doi": ""
    },
    {
      "text": "Ronald E. Riggio and Joanne Lee. 2007. Emotional and interpersonal competencies and leader development. Human Resource Management Review 17, 4 (2007), 418--426.",
      "doi": ""
    },
    {
      "text": "Rachel R. Romeo, Joshua Segaran, Julia A. Leonard, Sydney T. Robinson, Martin R. West, Allyson P. Mackey, Anastasia Yendiki, Meredith L. Rowe, and John D.E. Gabrieli. 2018. Language Exposure Relates to Structural Neural Connectivity in Childhood. The Journal of Neuroscience 38, 36 (2018), 7870--7877.",
      "doi": ""
    },
    {
      "text": "Dairazalia Sanchez-Cortes, Oya Aran, Marianne Schmid Mast, and Daniel Gatica-Perez. 2012. A Nonverbal Behavior Approach to Identify Emergent Leaders in Small Groups. IEEE Transaction on Multimedia 14, 3--2 (2012), 816--832.  ",
      "doi": "10.1109/TMM.2011.2181941"
    },
    {
      "text": "Jan Schneider, Dirk Börner, Peter van Rosmalen, and Marcus Specht. 2015. Presentation Trainer, your Public Speaking Multimodal Coach. In Proceedings of the 17th ACM International Conference on Multimodal Interaction. ACM, New York, NY, 539--546.  ",
      "doi": "10.1145/2818346.2830603"
    },
    {
      "text": "Caifeng Shan, Shaogang Gong, and Peter W. McOwan. 2009. Facial expression recognition based on Local Binary Patterns: A comprehensive study. Image Vision Computing 27, 6 (2009), 803--816.  ",
      "doi": "10.1016/j.imavis.2008.08.005"
    },
    {
      "text": "Gillian Slessor, Louise H Phillips, and Rebecca Bull. 2008. Age-related declines in basic social perception: evidence from tasks assessing eyegaze processing. Psychology and Aging 23, 4 (2008), 812--822.",
      "doi": ""
    },
    {
      "text": "Lewis R Stern. 2004. Executive coaching: A working definition. Consulting Psychology Journal: Practice and Research 56, 3 (2004), 154--162.",
      "doi": ""
    },
    {
      "text": "Mohammad Iftekhar Tanveer, Emy Lin, and Mohammed (Ehsan) Hoque. 2015. Rhema: A Real-Time In-Situ Intelligent Interface to Help People with Public Speaking. In Proceedings of the 20th Annual Meeting of the Intelligent Interfaces. ACM, New York, NY, 286--295.  ",
      "doi": "10.1145/2678025.2701386"
    },
    {
      "text": "Mohammad Iftekhar Tanveer, Ru Zhao, Kezhen Chen, Zoe Tiet, and Mohammed (Ehsan) Hoque. 2016. AutoManner: An Automated Interface for Making Public Speakers Aware of Their Mannerisms. In Proceedings of the 21st Annual Meeting of the Intelligent Interfaces. ACM, New York, NY, 385--396.  ",
      "doi": "10.1145/2856767.2856785"
    },
    {
      "text": "Yla R. Tausczik and James W. Pennebaker. 2013. Improving teamwork using real-time language feedback. In Proceedings of the 2013 ACM SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 459--468.  ",
      "doi": "10.1145/2470654.2470720"
    },
    {
      "text": "Alessandro Vinciarelli, Maja Pantic, Dirk Heylen, Catherine Pelachaud, Isabella Poggi, Francesca D'Errico, and Marc Schröder. 2012. Bridging the Gap between Social Animal and Unsocial Machine: A Survey of Social Signal Processing. IEEE Transaction on Affective Computing 3, 1 (2012), 69--87.  ",
      "doi": "10.1109/T-AFFC.2011.27"
    },
    {
      "text": "Duc Minh Vo and Thai Hoang Le. 2016. Deep generic features and SVM for facial expression recognition. In Proceedings of the 3rd National Foundation for Science and Technology Development Conference on Information and Computer Science. IEEE Computer Society, Washington, DC, 80--84.",
      "doi": ""
    },
    {
      "text": "Shih-En Wei, Varun Ramakrishna, Takeo Kanade, and Yaser Sheikh. 2016. Convolutional Pose Machines. In Proceedings of the 29th IEEE Conference on Computer Vision and Pattern Recognition. IEEE Computer Society, Washington, DC, 4724--4732.",
      "doi": ""
    },
    {
      "text": "Kenji Yamanishi, Jun'ichi Takeuchi, Graham J. Williams, and Peter Milne. 2004. On-Line Unsupervised Outlier Detection Using Finite Mixtures with Discounting Learning Algorithms. Data Mining and Knowledge Discovery 8, 3 (2004), 275--300.  ",
      "doi": "10.1023/B%3ADAMI.0000023676.72185.7c"
    },
    {
      "text": "Li Zhang and Bryan Yap. 2012. Affect Detection from Text-Based Virtual Improvisation and Emotional Gesture Recognition. Advances in Human-Computer Interaction 2012, 461247 (2012), 1--12.  ",
      "doi": "10.1155/2012/461247"
    },
    {
      "text": "Cai-Nicolas Ziegler, Sean M. McNee, Joseph A. Konstan, and Georg Lausen. 2005. Improving recommendation lists through topic diversification. In Proceedings of the 14th International Conference on World Wide Web. ACM, New York, NY, 22--32.  ",
      "doi": "10.1145/1060745.1060754"
    }
  ]
}