{
  "doi": "10.1145/3290605.3300777",
  "title": "Comparing the Effects of Paper and Digital Checklists on Team Performance in Time-Critical Work",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "This mixed-methods study examines the effects of a tablet-based checklist system on team performance during a dynamic and safety-critical process of trauma resuscitation. We compared team performance from 47 resuscitations that used a paper checklist to that from 47 cases with a digital checklist to determine if digitizing a checklist led to improvements in task completion rates and in how fast the tasks were initiated for 18 most critical assessment and treatment tasks. We also compared if the checklist compliance increased with the digital design. We found that using the digital checklist led to more frequent completions of the initial airway assessment task but fewer completions of ear and lower extremities exams. We did not observe any significant differences in time to task performance, but found increased compliance with the checklist. Although improvements in team performance with the digital checklist were minor, our findings are important because they showed no adverse effects as a result of the digital checklist introduction. We conclude by discussing the takeaways and implications of these results for effective digitization of medical work.",
  "authors": [
    {
      "name": "Leah Kulp",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659091194",
      "orcid": "missing"
    },
    {
      "name": "Aleksandra Sarcevic",
      "institution": "Drexel University, Philadelphia, PA, USA",
      "img": "/do/10.1145/contrib-81100413266/rel-imgonly/profile.jpg",
      "acmid": "81100413266",
      "orcid": "missing"
    },
    {
      "name": "Megan Cheng",
      "institution": "Children's National Medical Center, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367134",
      "orcid": "missing"
    },
    {
      "name": "Yinan Zheng",
      "institution": "Children's National Medical Center, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367166",
      "orcid": "missing"
    },
    {
      "name": "Randall S. Burd",
      "institution": "Children's National Medical Center, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350580884",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aalok V. Agarwala, Paul G. Firth, Meredith A. Albrecht, Lisa Warren, and Guido Musch. 2015. An electronic checklist improves transfer and retention of critical information at intraoperative handoff of care. Anesth. Analg. 120, 1 (January 2015), 96--104.",
      "doi": ""
    },
    {
      "text": "Jakob E. Bardram and Steven Houben. 2018. Collaborative affordances of medical records. Comput Supported Coop Work 27, 1 (February 2018), 1--36.  ",
      "doi": "10.1007/s10606-017-9298-5"
    },
    {
      "text": "Marc Berg and Geoffrey Bowker. 1997. The multiple bodies of the medical record: Sociological Quarterly 38, 3 (June 1997), 513--537.",
      "doi": ""
    },
    {
      "text": "Jochen Bergs, Johan Hellings, Irina Cleemput, Ö Zurel, Vera De Troyer, Monique Van Hiel, Jean-Luc Demeere, Donald Claeys, and Dominique Vandijck. 2014. Systematic review and meta-analysis of the effect of the World Health Organization surgical safety checklist on postoperative complications. Br J Surg 101, 3 (February 2014), 150--158.",
      "doi": ""
    },
    {
      "text": "Yunan Chen. 2010. Documenting transitional information in EMR. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1787--1796.  ",
      "doi": "10.1145/1753326.1753594"
    },
    {
      "text": "Michael F. Chiang, Sarah Read-Brown, Daniel C. Tu, Dongseok Choi, David S. Sanders, Thomas S. Hwang, Steven Bailey, Daniel J. Karr, Elizabeth Cottle, John C. Morrison, David J. Wilson, and Thomas R. Yackel. 2013. Evaluation of electronic health record implementation in ophthalmology at an academic medical center. Trans Am Ophthalmol Soc 111, (September 2013), 70--92.",
      "doi": ""
    },
    {
      "text": "Stefan C. Christov, Heather M. Conboy, Nancy Famigletti, George S. Avrunin, Lori A. Clarke, and Leon J. Osterweil. 2016. Smart checklists to improve healthcare outcomes. In Proceedings of the 2016 International Workshop on Software Engineering in Healthcare Systems (SEHS '16), 54--57.  ",
      "doi": "10.1145/2897683.2897691"
    },
    {
      "text": "Shad H. Deering, Kyle Tobler, and Rebecca Cypher. 2010. Improvement in documentation using an electronic checklist for shoulder dystocia deliveries. Obstet Gynecol 116, 1 (July 2010), 63-- 66.",
      "doi": ""
    },
    {
      "text": "Aude Fourcade, Jean-Louis Blache, Catherine Grenier, Jean-Louis Bourgain, and Etienne Minvielle. 2012. Barriers to staff adoption of a surgical safety checklist. BMJ Qual Saf 21, 3 (March 2012), 191-- 197.",
      "doi": ""
    },
    {
      "text": "Eliot Grigg. 2015. Smarter clinical checklists: How to minimize checklist fatigue and maximize clinician performance. Anesth. Analg. 121, 2 (August 2015), 570--573.",
      "doi": ""
    },
    {
      "text": "Brigette Hales, Marius Terblanche, Robert Fowler, and William Sibbald. 2008. Development of medical checklists for improved quality of patient care. Int J Qual Health Care 20, 1 (February 2008), 22--30.",
      "doi": ""
    },
    {
      "text": "R. H. Harper, K. P. O'Hara, A. J. Sellen, and D. J. Duthie. 1997. Toward the paperless hospital? Br J Anaesth 78, 6 (June 1997), 762-- 767.",
      "doi": ""
    },
    {
      "text": "Glenda Hawley, Claire Jackson, Julie Hepworth, and Shelley A. Wilkinson. 2014. Sharing of clinical data in a maternity setting: How do paper hand-held records and electronic health records compare for completeness? BMC Health Services Research 14, 1 (December 2014), 650.",
      "doi": ""
    },
    {
      "text": "Alex B. Haynes, Thomas G. Weiser, William R. Berry, Stuart R. Lipsitz, Abdel-Hadi S. Breizat, E. Patchen Dellinger, Teodoro Herbosa, Sudhir Joseph, Pascience L. Kibatala, Marie Carmela M. Lapitan, Alan F. Merry, Krishna Moorthy, Richard K. Reznick, Bryce Taylor, Atul A. Gawande, and Safe Surgery Saves Lives Study Group. 2009. A surgical safety checklist to reduce morbidity and mortality in a global population. N. Engl. J. Med. 360, 5 (January 2009), 491--499.",
      "doi": ""
    },
    {
      "text": "Deirdre C. Kelleher, Elizabeth A. Carter, Lauren J. Waterhouse, Samantha E. Parsons, Jennifer L. Fritzeen, and Randall S. Burd. 2014. Effect of a checklist on advanced trauma life support task performance during pediatric trauma resuscitation. Acad Emerg Med 21, 10 (October 2014), 1129--1134.",
      "doi": ""
    },
    {
      "text": "Alyssa Klein, Leah Kulp, and Aleksandra Sarcevic. 2018. Designing and optimizing digital applications for medical emergencies. In Proceedings of the 2018 CHI Conference Extended Abstracts on Human Factors in Computing Systems, LBW588.  ",
      "doi": "10.1145/3170427.3188678"
    },
    {
      "text": "Heidi S. Kramer and Frank A. Drews. Checking the lists: A systematic review of electronic checklist use in health care. Journal of Biomedical Informatics.  ",
      "doi": "10.1016/j.jbi.2016.09.006"
    },
    {
      "text": "H. W. Kuhn and Bryn Yaw. 1955. The Hungarian method for the assignment problem. Naval Res. Logist. Quart (1955), 83--97.",
      "doi": ""
    },
    {
      "text": "Leah Kulp and Aleksandra Sarcevic. 2017. Design in the wild: Lessons from researcher participation in design of emerging technology. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 1802--1808.  ",
      "doi": "10.1145/3027063.3053170"
    },
    {
      "text": "Leah Kulp and Aleksandra Sarcevic. 2018. Design in the \"medical\" wild: Challenges of technology deployment. In Proceedings of the 2018 CHI Conference Extended Abstracts on Human Factors in Computing Systems, LBW040.  ",
      "doi": "10.1145/3170427.3188571"
    },
    {
      "text": "Leah Kulp, Aleksandra Sarcevic, Richard Farneth, Omar Ahmed, Dung Mai, Ivan Marsic, and Randall S. Burd. 2017. Exploring design opportunities for a context-adaptive medical checklist through technology probe approach. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17), 57--68.  ",
      "doi": "10.1145/3064663.3064715"
    },
    {
      "text": "Andreas Landmark, May-Britt Selnes, Elisabeth Larsen, Astrid Svensli, Linda Solum, and Berit Brattheim. 2012. The role of electronic checklists - case study on MRI-safety. Stud Health Technol Inform 180, (2012), 736--740.",
      "doi": ""
    },
    {
      "text": "Angela Lashoher, Eric B. Schneider, Catherine Juillard, Kent Stevens, Elizabeth Colantuoni, and William R. Berry. 2016. Implementation of the World Health Organization Trauma Care Checklist Program in 11 centers across multiple economic strata: Effect on care process measures. World J Surg (October 2016), 1--9.",
      "doi": ""
    },
    {
      "text": "Nir Menachemi and Taleah H Collum. 2011. Benefits and drawbacks of electronic health record systems. Risk Manag Healthc Policy 4, (May 2011), 47--55.",
      "doi": ""
    },
    {
      "text": "Ger D. J. van Olden, J. Dik Meeuwis, Hugo W. Bolhuis, Han Boxma, and R. Jan A. Goris. 2004. Clinical impact of advanced trauma life support. Am J Emerg Med 22, 7 (November 2004), 522-- 525.",
      "doi": ""
    },
    {
      "text": "Samantha E. Parsons, Elizabeth A. Carter, Lauren J. Waterhouse, Jennifer Fritzeen, Deirdre C. Kelleher, Karen J. O'connell, Aleksandra Sarcevic, Kelley M. Baker, Erik Nelson, Nicole E. Werner, Deborah A. Boehm-Davis, and Randall S. Burd. 2014. Improving ATLS performance in simulated pediatric trauma resuscitation using a checklist. Ann. Surg. 259, 4 (April 2014), 807-- 813.",
      "doi": ""
    },
    {
      "text": "Kathleen H. Pine and Melissa Mazmanian. 2014. Institutional logics of the EMR and the problem of \"Perfect\" but inaccurate accounts. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), 283--294.  ",
      "doi": "10.1145/2531602.2531652"
    },
    {
      "text": "Madhu C. Reddy, Paul Dourish, and Wanda Pratt. 2001. Coordinating heterogeneous work: Information and representation in medical care. In ECSCW 2001: Proceedings of the Seventh European Conference on Computer Supported Cooperative Work 16--20 September 2001, Bonn, Germany, Springer Netherlands, Dordrecht, 239--258. ",
      "doi": "10.5555/1241867.1241880"
    },
    {
      "text": "Aleksandra Sarcevic, Brett Rosen, Leah Kulp, Ivan Marsic, and Randall Burd. 2016. Design challenges in converting a paper checklist to digital format for dynamic medical settings. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare (Pervasive Health 2016), 1--8. ",
      "doi": "10.5555/3021319.3021325"
    },
    {
      "text": "Jonathan M. Spector, Priya Agrawal, Bhala Kodkany, Stuart Lipsitz, Angela Lashoher, Gerald Dziekan, Rajiv Bahl, Mario Merialdi, Matthews Mathai, Claire Lemer, and Atul Gawande. 2012. Improving quality of care for maternal and newborn health: Prospective pilot study of the WHO Safe Childbirth Checklist Program. PLOS ONE 7, 5 (May 2012), e35151.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Comput. Supported Coop. Work 8, 1--2 (February 1999), 9--30.  ",
      "doi": "10.1023/A%3A1008651105359"
    },
    {
      "text": "Christian P. Subbe, John Kellett, Paul Barach, Catriona Chaloner, Hayley Cleaver, Tim Cooksley, Erik Korsten, Eilish Croke, Elinor Davis, Ashley JR De Bie, Lesley Durham, Chris Hancock, Jilian Hartin, Tracy Savijn, and John Welch. 2017. Crisis checklists for inhospital emergencies: expert consensus, simulation testing and recommendations for a template determined by a multi-institutional and multi-disciplinary learning collaborative. BMC Health Services Research 17, (May 2017), 334.",
      "doi": ""
    },
    {
      "text": "Charat Thongprayoon, Andrew M. Harrison, John C. O'Horo, Ronaldo A. Sevilla Berrios, Brian W. Pickering, and Vitaly Herasevich. 2016. The effect of an electronic checklist on critical care provider workload, errors, and performance. J Intensive Care Med 31, 3 (March 2016), 205--212.",
      "doi": ""
    },
    {
      "text": "Emiel G. Verdaasdonk, Laurents P. Stassen, Prama P. Widhiasmara, and Jenny Dankelman. 2009. Requirements for the design and implementation of checklists for surgical processes. Surgical Endoscopy 23, 4 (April 2009), 715--26.",
      "doi": ""
    },
    {
      "text": "Leslie Wu, Jesse Cirimele, Kristen Leach, Stuart Card, Larry Chu, T. Kyle Harrison, and Scott R. Klemmer. 2014. Supporting crisis response with dynamic procedure aids. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14), 315--324.  ",
      "doi": "10.1145/2598510.2598565"
    },
    {
      "text": "Sun Young Park, Yunan Chen, and Scott Rudkin. 2015. Technological and organizational adaptation of EMR implementation in an emergency department. ACM Transactions on Computer-Human Interaction 22, (February 2015), 1--24.  ",
      "doi": "10.1145/2656213"
    },
    {
      "text": "Eiman Zargaran, Nadine Schuurman, Andrew J. Nicol, Richard Matzopoulos, Jonathan Cinnamon, Tracey Taulu, Britta Ricker, David Ross Garbutt Brown, Pradeep Navsaria, and S. Morad Hameed. 2014. The electronic trauma health record: Design and usability of a novel tablet-based tool for trauma care and injury surveillance in low resource settings. Journal of the American College of Surgeons 218, 1 (January 2014), 41--50.",
      "doi": ""
    },
    {
      "text": "Zhan Zhang, Aleksandra Sarcevic, Maria Yala, and Randall S. Burd. 2014. Informing digital cognitive aids design for emergency medical work by understanding paper checklist use. In Proceedings of the 18th International Conference on Supporting Group Work (GROUP '14), 204--214.  ",
      "doi": "10.1145/2660398.2660423"
    },
    {
      "text": "Xiaomu Zhou, Mark S. Ackerman, and Kai Zheng. 2009. I just don't know why it's gone: Maintaining informal information use in inpatient care. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 2061--2070.  ",
      "doi": "10.1145/1518701.1519014"
    }
  ]
}