{
  "doi": "10.1145/3290605.3300482",
  "title": "Crowdsourcing Interface Feature Design with Bayesian Optimization",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Designing novel interfaces is challenging. Designers typically rely on experience or subjective judgment in the absence of analytical or objective means for selecting interface parameters. We demonstrate Bayesian optimization as an efficient tool for objective interface feature refinement. Specifically, we show that crowdsourcing paired with Bayesian optimization can rapidly and effectively assist interface design across diverse deployment environments. Experiment 1 evaluates the approach on a familiar 2D interface design problem: a map search and review use case. Adding a degree of complexity, Experiment 2 extends Experiment 1 by switching the deployment environment to mobile-based virtual reality. The approach is then demonstrated as a case study for a fundamentally new and unfamiliar interaction design problem: web-based augmented reality. Finally, we show how the model generated as an outcome of the refinement process can be used for user simulation and queried to deliver various design insights.",
  "authors": [
    {
      "name": "John J. Dudley",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659277381",
      "orcid": "missing"
    },
    {
      "name": "Jason T. Jacques",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658722807",
      "orcid": "missing"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "University of Cambridge, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    }
  ],
  "references": [
    {
      "text": "Gilles Bailly, Antti Oulasvirta, Timo Kötzing, and Sabrina Hoppe. 2013. MenuOptimizer: Interactive Optimization of Menu Systems. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 331--342.  ",
      "doi": "10.1145/2501988.2502024"
    },
    {
      "text": "Eric Brochu, Tyson Brochu, and Nando de Freitas. 2010. A Bayesian Interactive Optimization Approach to Procedural Animation Design. In Proceedings of the 2010 ACM SIGGRAPH/Eurographics Symposium on Computer Animation (SCA '10). Eurographics Association, Goslar, Germany, 103--112. http://dl.acm.org/citation.cfm?id=1921427.1921443 ",
      "doi": "10.5555/1921427.1921443"
    },
    {
      "text": "B. Choffin and N. Ueda. 2018. Scaling Bayesian Optimization up to Higher Dimensions: a Review and Comparison of Recent Algorithms. In 2018 IEEE 28th International Workshop on Machine Learning for Signal Processing (MLSP). 1--6.",
      "doi": ""
    },
    {
      "text": "Krzysztof Gajos and Daniel S. Weld. 2004. SUPPLE: Automatically Generating User Interfaces. In Proceedings of the 9th International Conference on Intelligent User Interfaces (IUI '04). ACM, New York, NY, USA, 93--100.  ",
      "doi": "10.1145/964442.964461"
    },
    {
      "text": "Javier González, Zhenwen Dai, Philipp Hennig, and Neil Lawrence. 2016. Batch Bayesian Optimization via Local Penalization. In Proceedings of the 19th International Conference on Artificial Intelligence and Statistics (Proceedings of Machine Learning Research), Arthur Gretton and Christian C. Robert (Eds.), Vol. 51. PMLR, Cadiz, Spain, 648--657. http://proceedings.mlr.press/v51/gonzalez16a.html",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing Graphical Perception: Using Mechanical Turk to Assess Visualization Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Mohammad M. Khajah, Brett D. Roads, Robert V. Lindsey, Yun-En Liu, and Michael C. Mozer. 2016. Designing Engaging Games Using Bayesian Optimization. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5571--5582.  ",
      "doi": "10.1145/2858036.2858253"
    },
    {
      "text": "Aniket Kittur, Ed H. Chi, and Bongwon Suh. 2008. Crowdsourcing User Studies with Mechanical Turk. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Ron Kohavi, Randal M. Henne, and Dan Sommerfield. 2007. Practical Guide to Controlled Experiments on the Web: Listen to Your Customers Not to the Hippo. In Proceedings of the 13th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '07). ACM, New York, NY, USA, 959--967.  ",
      "doi": "10.1145/1281192.1281295"
    },
    {
      "text": "Steven Komarov, Katharina Reinecke, and Krzysztof Z. Gajos. 2013. Crowdsourcing Performance Evaluations of User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 207--216.  ",
      "doi": "10.1145/2470654.2470684"
    },
    {
      "text": "Yuki Koyama, Issei Sato, Daisuke Sakamoto, and Takeo Igarashi. 2017. Sequential Line Search for Efficient Visual Design Optimization by Crowds. ACM Trans. Graph. 36, 4, Article 48 (July 2017), 11 pages.  ",
      "doi": "10.1145/3072959.3073598"
    },
    {
      "text": "Wanyu Liu, Rafael Lucas D'Oliveira, Michel Beaudouin-Lafon, and Olivier Rioul. 2017. BIGnav: Bayesian Information Gain for Guiding Multiscale Navigation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5869--5880.  ",
      "doi": "10.1145/3025453.3025524"
    },
    {
      "text": "Yun-En Liu, Travis Mandel, Emma Brunskill, and Zoran Popovic. 2014. Towards Automatic Experimentation of Educational Knowledge. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3349--3358.  ",
      "doi": "10.1145/2556288.2557392"
    },
    {
      "text": "J. Derek Lomas, Jodi Forlizzi, Nikhil Poonwala, Nirmal Patel, Sharan Shodhan, Kishan Patel, Ken Koedinger, and Emma Brunskill. 2016. Interface Design Optimization As a Multi-Armed Bandit Problem. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4142--4153.  ",
      "doi": "10.1145/2858036.2858425"
    },
    {
      "text": "MM Hassan Mahmud, Benjamin Rosman, Subramanian Ramamoorthy, and Pushmeet Kohli. 2014. Adapting Interaction Environments to Diverse Users through Online Action Set Selection. In Workshops at the Twenty-Eighth AAAI Conference on Artificial Intelligence. 1--7. https: //www.aaai.org/ocs/index.php/WS/AAAIW14/paper/view/8865",
      "doi": ""
    },
    {
      "text": "Luana Micallef, Gregorio Palmas, Antti Oulasvirta, and Tino Weinkauf. 2017. Towards Perceptual Optimization of the Visual Design of Scatterplots. IEEE Transactions on Visualization and Computer Graphics 23, 6 (June 2017), 1588--1599.  ",
      "doi": "10.1109/TVCG.2017.2674978"
    },
    {
      "text": "Jay I. Myung, Daniel R. Cavagnaro, and Mark A. Pitt. 2013. A Tutorial on Adaptive Design Optimization. Journal of Mathematical Psychology 57, 3 (2013), 53 -- 67.",
      "doi": ""
    },
    {
      "text": "J. B. B. Nielsen, J. Nielsen, and J. Larsen. 2015. Perception-Based Personalization of Hearing Aids Using Gaussian Processes and Active Learning. IEEE/ACM Transactions on Audio, Speech, and Language Processing 23, 1 (Jan 2015), 162--173.  ",
      "doi": "10.1109/TASLP.2014.2377581"
    },
    {
      "text": "Peter O'Donovan, Aseem Agarwala, and Aaron Hertzmann. 2015. DesignScape: Design with Interactive Layout Suggestions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1221--1224.  ",
      "doi": "10.1145/2702123.2702149"
    },
    {
      "text": "Seonwook Park, Christoph Gebhardt, Roman Rädle, Anna Maria Feit, Hana Vrzakova, Niraj Ramesh Dayama, Hui-Shyong Yeo, Clemens N. Klokmose, Aaron Quigley, Antti Oulasvirta, and Otmar Hilliges. 2018. AdaM: Adapting Multi-User Interfaces for Collaborative Environments in Real-Time. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 184, 14 pages.  ",
      "doi": "10.1145/3173574.3173758"
    },
    {
      "text": "Carl Edward Rasmussen and Christopher K. I. Williams. 2006. Gaussian Processes for Machine Learning. MIT Press.",
      "doi": "10.5555/1162254"
    },
    {
      "text": "C. Ridpath and W. Chisholm. 2000. Techniques For Accessibility Evaluation And Repair Tools. (2000). https://www.w3.org/TR/AERT",
      "doi": ""
    },
    {
      "text": "Paulo Salem. 2017. User Interface Optimization Using Genetic Programming with an Application to Landing Pages. Proc. ACM Hum.Comput. Interact. 1, EICS, Article 13 (June 2017), 17 pages.  ",
      "doi": "10.1145/3099583"
    },
    {
      "text": "Sayan Sarcar, Jussi Joklnen, Antti Oulasvirta, Chaklam Silpasuwanchai, Zhenxin Wang, and Xiangshi Ren. 2016. Towards Ability-Based Optimization for Aging Users. In Proceedings of the International Symposium on Interactive Technology and Ageing Populations (ITAP '16). ACM, New York, NY, USA, 77--86.  ",
      "doi": "10.1145/2996267.2996275"
    },
    {
      "text": "B. Shahriari, K. Swersky, Z. Wang, R. P. Adams, and N. de Freitas. 2016. Taking the Human Out of the Loop: A Review of Bayesian Optimization. Proc. IEEE 104, 1 (Jan 2016), 148--175.",
      "doi": ""
    },
    {
      "text": "Jasper Snoek. 2013. Bayesian Optimization and Semiparametric Models with Applications to Assistive Technology. Ph.D. Dissertation. University of Toronto, Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Kashyap Todi, Daryl Weir, and Antti Oulasvirta. 2016. Sketchplore: Sketch and Explore with a Layout Optimiser. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 543--555.  ",
      "doi": "10.1145/2901790.2901817"
    },
    {
      "text": "Michael Toomim, Travis Kriplean, Claus Pörtner, and James Landay. 2011. Utility of Human-computer Interactions: Toward a Science of Preference Measurement. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2275--2284.  ",
      "doi": "10.1145/1978942.1979277"
    },
    {
      "text": "Ziyu Wang, Frank Hutter, Masrour Zoghi, David Matheson, and Nando De Freitas. 2016. Bayesian Optimization in a Billion Dimensions via Random Embeddings. Journal of Artificial Intelligence Research 55 (2016), 361--387. ",
      "doi": "10.5555/3013558.3013569"
    }
  ]
}