{
  "doi": "10.1145/3290605.3300862",
  "title": "ElectroDermis: Fully Untethered, Stretchable, and Highly-Customizable Electronic Bandages",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2019,
  "badges": [],
  "abstract": "Wearables have emerged as an increasingly promising interactive platform, imbuing the human body with always-available computational capabilities. This unlocks a wide range of applications, including discreet information access, health monitoring, fitness, and fashion. However, unlike previous platforms, wearable electronics require structural conformity, must be comfortable for the wearer, and should be soft, elastic, and aesthetically appealing. We envision a future where electronics can be temporarily attached to the body (like bandages or party masks), but in functional and aesthetically pleasing ways. Towards this vision, we introduce ElectroDermis, a fabrication approach that simplifies the creation of highly-functional and stretchable wearable electronics that are conformal and fully untethered by discretizing rigid circuit boards into individual components. These individual components are wired together using stretchable electrical wiring and assembled on a spandex blend fabric, to provide high functionality in a robust form-factor that is reusable. We describe our system in detail- including our fabrication parameters and its operational limits-which we hope researchers and practitioners can leverage. We describe a series of example applications that illustrate the feasibility and utility of our system. Overall, we believe ElectroDermis offers a complementary approach to wearable electronics-one that places value on the notion of impermanence (i.e., unlike tattoos and implants), better conforming to the dynamic nature of the human body.",
  "tags": [
    "fabrication",
    "wearable electronics",
    "spandex",
    "on-skin devices"
  ],
  "authors": [
    {
      "name": "Eric Markvicka",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365861",
      "orcid": "missing"
    },
    {
      "name": "Guanyun Wang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-87258679957/rel-imgonly/20201100____v6.jpg",
      "acmid": "87258679957",
      "orcid": "0000-0002-7904-1504"
    },
    {
      "name": "Yi-Chin Lee",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366956",
      "orcid": "missing"
    },
    {
      "name": "Gierad Laput",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81502797271/rel-imgonly/gierad_laput_c2_425x425_gradient2_shift.jpg",
      "acmid": "81502797271",
      "orcid": "missing"
    },
    {
      "name": "Carmel Majidi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459792257",
      "orcid": "missing"
    },
    {
      "name": "Lining Yao",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261439",
      "orcid": "0000-0002-8842-2317"
    }
  ],
  "references": [
    {
      "text": "An, B., Miyashita, S., Tolley, M.T., Aukes, D.M., Meeker, L., Demaine, E.D., Demaine, M.L., Wood, R.J. and Rus, D., 2014. An end-to-end approach to making self-folded 3D surface shapes by uniform heating. IEEE International Conference on Robotics and Automation (ICRA), (2014, May). 1466--1473",
      "doi": ""
    },
    {
      "text": "An, B., Tao, Y., Gu, J., Cheng, T., Chen, X. A., Zhang, X., Zhao, W., Do, Y., Takahashi, S., Wu, H.Y., Zhang, T., and Yao, L. 2018. Thermorph: Democratizing 4D Printing of Self-Folding Materials and Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. (2018, April), 260  ",
      "doi": "10.1145/3173574.3173834"
    },
    {
      "text": "Bartlett, M.D., Markvicka, E.J. and Majidi, C. 2016. Rapid Fabrication of Soft, Multilayered Electronics for Wearable Biomonitoring. Advanced Functional Materials. 26, 46 (2016), 8496--8504.",
      "doi": ""
    },
    {
      "text": "Brosteaux, D., Axisa, F., Gonzalez, M., and Vanfleteren, J. 2007. Design and fabrication of elastic interconnections for stretchable electronic circuits. IEEE Electron Device Letters, 28(7), (2007). 552--554.",
      "doi": ""
    },
    {
      "text": "Cordeiro, F., Epstein, D.A., Thomaz, E., Bales, E., Jagannathan, A.K., Abowd, G.D. and Fogarty, J. 2015. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. Proceedings of the SIGCHI conference on human factors in computing systems. CHI Conference. 2015, (Apr. 2015), 1159--1162.  ",
      "doi": "10.1145/2702123.2702155"
    },
    {
      "text": "Dementyev, A., Kao, H.-L. (cindy) and Paradiso, J.A. 2015. SensorTape: Modular and Programmable 3D-Aware Dense Sensor Network on a Tape. Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST '15 (New York, New York, USA, 2015), 649--658.  ",
      "doi": "10.1145/2807442.2807507"
    },
    {
      "text": "Gannon, M., Grossman, T., and Fitzmaurice, G. 2015. Tactum: a skin-centric approach to digital design and fabrication. Proceedings of the SIGCHI conference on human factors in computing systems. CHI Conference. 2015 (apr. 2015), 1779--1788.  ",
      "doi": "10.1145/2702123.2702581"
    },
    {
      "text": "Gemperle, F., Kasabach, C., Stivoric, J., Bauer, M., and Martin, R. 1998. Design for Wearability. Proceedings of Wearable Computers. 1998. Digest of Papers. Second Internaltional Symposium on. IEEE, 116--122. ",
      "doi": "10.5555/857199.857998"
    },
    {
      "text": "Grey, J. E., Enoch, S., & Harding, K. G. 2006. Wound assessment. Bmj, 332(7536), (2006). 285--288.",
      "doi": ""
    },
    {
      "text": "Groeger, D. and Steimle, J. 2018. ObjectSkin: Augmenting Everyday Objects with Hydroprinted Touch Sensors and Displays. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies. 1, 4 (Jan. 2018), 1--23.  ",
      "doi": "10.1145/3161165"
    },
    {
      "text": "Grosse-Puppendahl, T., Hodges, S., Chen, N., Helmes, J., Taylor, S., Scott, J., Fromm, J. and Sweeney, D. 2016. Exploring the Design Space for Energy-Harvesting Situated Displays. Proceedings of the 29th Annual Symposium on User Interface Software and Technology - UIST '16 (New York, New York, USA, 2016), 41--48.  ",
      "doi": "10.1145/2984511.2984513"
    },
    {
      "text": "Kao, H.-L. (cindy), Bedri, A., and Lyons, K. 2018. SkinWire: Fabricating a Self-Contained On-Skin PCB for the Hand. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2.3. 2018. 116.  ",
      "doi": "10.1145/3264926"
    },
    {
      "text": "Kao, H.-L. (cindy), Dementyev, A., Paradiso, J.A. and Schmandt, C. 2015. NailO: Fingernails as an Input Surface. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15 (New York, New York, USA, 2015), 3015--3018.  ",
      "doi": "10.1145/2702123.2702572"
    },
    {
      "text": "Kao, H.-L. (cindy), Holz, C., Roseway, A., Calvo, A. and Schmandt, C. 2016. DuoSkin: rapidly prototyping on-skin user interfaces using skin-friendly materials. Proceedings of the 2016 ACM International Symposium on Wearable Computers - ISWC '16 (New York, New York, USA, 2016), 16--23.  ",
      "doi": "10.1145/2971763.2971777"
    },
    {
      "text": "Kato, K. and Miyashita, H. 2015. ExtensionSticker: A Proposal for a Striped Pattern Sticker to Extend Touch Interfaces and its Assessment. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15 (New York, New York, USA, 2015), 1851--1854.  ",
      "doi": "10.1145/2702123.2702500"
    },
    {
      "text": "Kramer, R., Majidi, C., Wood, R.J. Wearable tactile keypad with stretchable artificial skin. In IEEE ICRA '11 (2011).",
      "doi": ""
    },
    {
      "text": "Laput, G., Xiao, R. and Harrison, C. 2016. ViBand. Proceedings of the 29th Annual Symposium on User Interface Software and Technology - UIST '16 (2016).",
      "doi": ""
    },
    {
      "text": "Lo, J., Lee, D.J.L., Wong, N., Bui, D. and Paulos, E. 2016. Skintillates: Designing and Creating Epidermal Interactions. Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16 (New York, New York, USA, 2016), 853--864.  ",
      "doi": "10.1145/2901790.2901885"
    },
    {
      "text": "Lu, T., Markvicka, E. J., Jin, Y., and Majidi, C. 2017. Soft-Matter Printed Circuit Board with UV Laser Micropatterning. ACS applied materials & interfaces, 9(26), (2017), 22055--22062.",
      "doi": ""
    },
    {
      "text": "Maurer, U., Rowe, A., Smailagic, A. and Siewiorek, D.P. eWatch: A Wearable Sensor and Notification Platform. International Workshop on Wearable and Implantable Body Sensor Networks (BSN'06).  ",
      "doi": "10.1109/BSN.2006.24"
    },
    {
      "text": "Niiyama, R., Sun, X., Yao, L., Ishii, H., Rus, D. and Kim, S. 2015. Sticky Actuator: Free-Form Planar Actuators for Animated Objects. Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '14 (New York, New York, USA, 2015), 77--84.  ",
      "doi": "10.1145/2677199.2680600"
    },
    {
      "text": "Nittala, A.S., Withana, A., Pourjafarian, N. and Steimle, J. 2018. Multi-Touch Skin. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (2018).",
      "doi": ""
    },
    {
      "text": "Parzer, P., Probst, K., Babic, T., Rendl, C., Vogl, A., Olwal, A. and Haller, M. 2016. FlexTiles: A Flexible, Stretchable, Formable, Pressure-Sensitive, Tactile Input Sensor. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16 (New York, New York, USA, 2016), 3754--3757.  ",
      "doi": "10.1145/2851581.2890253"
    },
    {
      "text": "Probst, K., Haller, M., Yasu, K., Sugimoto, M. and Inami, M. 2013. Move-it sticky notes providing active physical feedback through motion. Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction - TEI '14 (2013).  ",
      "doi": "10.1145/2540930.2540932"
    },
    {
      "text": "Rogers, J.A., Someya, T. and Huang, Y. 2010. Materials and Mechanics for Stretchable Electronics. Science. 327, 5973 (2010), 1603--1607.",
      "doi": ""
    },
    {
      "text": "Stoppa, M. and Chiolerio, A. 2014. Wearable electronics and smart textiles: a critical review. Sensors. 14, 7 (Jul. 2014), 11957--11992.",
      "doi": ""
    },
    {
      "text": "Tavakoli, M., Malakooti, M.H., Paisana, H., Ohm, Y., Marques, D.G., Alhais Lopes, P., Piedade, A.P., de Almeida, A.T. and Majidi, C., 2018. EGaIn?Assisted Room?Temperature Sintering of Silver Nanoparticles for Stretchable, Inkjet?Printed, Thin-Film Electronics. Advanced Materials, 1801852.",
      "doi": ""
    },
    {
      "text": "Vega, K., and Fuks, H. 2013. Beauty technology: muscle based computing interaction. In Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces (2013, October). 469--474  ",
      "doi": "10.1145/2512349.2514599"
    },
    {
      "text": "Wang, G., Yao, L., Wang, W., Ou, J., Cheng, C.Y. and Ishii, H., 2016. xPrint: A Modularized Liquid Printer for Smart Materials Deposition. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. (2016, May), 5743--5752.  ",
      "doi": "10.1145/2858036.2858281"
    },
    {
      "text": "Weigel, M., Lu, T., Bailly, G., Oulasvirta, A., Majidi, C. and Steimle, J. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15 (New York, New York, USA, 2015), 2991--3000.  ",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Weigel, M., Nittala, A. S., Olwal, A., and Steimle, J. 2017. Skinmarks: Enabling interactions on body landmarks using conformal skin electronics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. (2017, May). 3095--3105  ",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Wessely, M., Tsandilas, T. and Mackay, W.E. 2016. Stretchis: Fabricating Highly Stretchable User Interfaces. Proceedings of the 29th Annual Symposium on User Interface Software and Technology - UIST '16 (New York, New York, USA, 2016), 697--704.  ",
      "doi": "10.1145/2984511.2984521"
    },
    {
      "text": "Yao, L., Steiner, H., Wang, W., Wang, G., Cheng, C. Y., Ou, J., and Ishii, H. 2016. Second Skin: Biological Garment Powered by and Adapting to Body in Motion. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. (2016, May). 13--13.  ",
      "doi": "10.1145/2851581.2889437"
    },
    {
      "text": "Yoon, S.H., Chen, G., Huo, K., Zhang, Y. and Ramani, K. 2017. iSoft. Interactions. 25, 1 (Dec. 2017), 14--15.  ",
      "doi": "10.1145/3155046"
    }
  ]
}