{
  "doi": "10.1145/3290605.3300452",
  "title": "Patient Perspectives on Self-Management Technologies for Chronic Fatigue Syndrome",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Chronic Fatigue Syndrome (CFS) is a debilitating medical condition that is characterized by a range of physical, cognitive and social impairments. This paper investigates CFS patients' perspectives on the potential for technological support for self-management of their symptoms. We report findings from three studies in which people living with CFS 1) prioritized symptoms that they would like technologies to address, 2) articulated their current approaches to self-management alongside challenges they face, and 3) reflected on their experiences with three commercial smartphone apps related to symptom management. We contribute an understanding of the specific needs of the ME/CFS population and the ways in which they currently engage in self-management using technology. The paper ends by describing five high-level design recommendations for ME/CFS self-management technologies.",
  "authors": [
    {
      "name": "Tabby Davies",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367082",
      "orcid": "missing"
    },
    {
      "name": "Simon L. Jones",
      "institution": "University of Bath, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416593569",
      "orcid": "missing"
    },
    {
      "name": "Ryan M. Kelly",
      "institution": "The University of Melbourne, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365229",
      "orcid": "0000-0002-8773-6656"
    }
  ],
  "references": [
    {
      "text": "Leslie A Aaron, Mary M Burke, and Dedra Buchwald. 2000. Over­ lapping conditions among patients with chronic fatigue syndrome, Fibromyalgia, and temporomandibular disorder. Archives of internal medicine 160, 2 (2000), 221--227.",
      "doi": ""
    },
    {
      "text": "Susan E Abbey. 1996. Psychiatric diagnostic overlap in chronic fatigue syndrome. Chronic Fatigue Syndrome: An Integrated Approach to Evaluation and Treatment (1996), 49--71.",
      "doi": ""
    },
    {
      "text": "Phil Adams, Elizabeth L. Murnane, Michael Elfenbein, Elaine Wethington, and Geri Gay. 2017. Supporting the Self-Management of Chronic Pain Conditions with Tailored Momentary Self-Assessments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1065--1077.  ",
      "doi": "10.1145/3025453.3025832"
    },
    {
      "text": "Niloofar Afari and Dedra Buchwald. 2003. Chronic fatigue syndrome: a review. American Journal of Psychiatry 160, 2 (2003), 221--236.",
      "doi": ""
    },
    {
      "text": "Kevin Anderson, Oksana Burford, and Lynne Emmerton. 2016. App Chronic Disease Checklist: Protocol to Evaluate Mobile Apps for Chronic Disease Self-Management. JMIR Res Protoc 5, 4 (04 Nov 2016), e204.",
      "doi": ""
    },
    {
      "text": "Deborah Antcliff, Philip Keeley, Malcolm Campbell, Steve Woby, AnneMaree Keenan, and Linda McGowan. 2018. Activity pacing: moving beyond taking breaks and slowing down. Quality of Life Research 27, 01 Jul 2018, 1933--1935.",
      "doi": ""
    },
    {
      "text": "Julie Barlow, Chris Wright, Janice Sheasby, Andy Turner, and Jenny Hainsworth. 2002. Self-management approaches for people with chronic conditions: a review. Patient education and counseling 48, 2 (2002), 177--187.",
      "doi": ""
    },
    {
      "text": "Narelle Biedermann. 2018. The use of Facebook for virtual asynchro­ nous focus groups in qualitative research. Contemporary nurse 54, 1 (2018), 26--34.",
      "doi": ""
    },
    {
      "text": "Jean-François Brunet, Dominique Dagenais, Marc Therrien, Daniel Gartenberg, and Geneviève Forest. 2017. Validation of sleep-2-Peak: A smartphone application that can detect fatigue-related changes in reaction times during sleep deprivation. Behavior Research Methods 49, 4 (01 Aug 2017), 1460--1469.",
      "doi": ""
    },
    {
      "text": "Davis Buls and John Rooksby. 2017. Technology for Self-Management of Rosacea: A Survey and Field Trial. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Comput­ ing Systems (CHI EA '17). ACM, New York, NY, USA, 1516--1523.  ",
      "doi": "10.1145/3027063.3053080"
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and George Buchanan. 2016. It Feels Like I'm Managing Myself: HIV+ People Tracking Their Personal Health Information. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, New York, NY, USA, Article 55, 10 pages.  ",
      "doi": "10.1145/2971485.2971542"
    },
    {
      "text": "Kathy Charmaz. 1993. Good days, bad days: The self in chronic illness and time. Rutgers University Press.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe,Nicole B. Lee, Bongshin Lee,Wanda Pratt,and Julie A. Kientz. 2014. Understanding Quantified-selfers' Practices in Collecting and Exploring Personal Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Tommy Chou, Laura J. Bry, and Jonathan S. Comer. 2017. Multimedia Field Test: Evaluating the Creative Ambitions of SuperBetter and Its Quest to Gamify Mental Health. Cognitive and Behavioral Practice 24, 1 (2017), 115 -- 120.",
      "doi": ""
    },
    {
      "text": "Juanne N Clarke and Susan James. 2003. The radicalized self: the impact on the self of the contested nature of the diagnosis of chronic fatigue syndrome. Social Science & Medicine 57, 8 (2003), 1387--1395.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Katherine Everitt, Ian Smith, and James A. Landay. 2006. Design Requirements for Technologies That Encourage Physical Activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 457--466.  ",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity Sensing in the Wild: A Field Trial of Ubifit Garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 1985. Managing chronic illness at home: three lines of work. Qualitative Sociology 8, 3 (1985), 224--247.",
      "doi": ""
    },
    {
      "text": "Todd E Davenport, Staci R Stevens, J Mark VanNess, Jared Stevens, and Christopher R Snell. 2018. Checking our blind spots: current status of research evidence summaries in ME/CFS. British Journal of Sports Medicine (2018). arXiv:https://bjsm.bmj.com/content/early/2018/07/17/bjsports-2018­ 099553.full.pdf",
      "doi": ""
    },
    {
      "text": "Wilfred C. de Vega, Santiago Herrera, Suzanne D. Vernon, and Patrick O. McGowan. 2017. Epigenetic modifications and gluco­ corticoid sensitivity in Myalgic Encephalomyelitis/Chronic Fatigue Syndrome (ME/CFS). BMC Medical Genomics 10, 1 (23 Feb 2017), 11.",
      "doi": ""
    },
    {
      "text": "Adrienne Dellwo. 2018. Myalgic Encephalomyelitis or Chronic Fatigue Syndrome. Available Online. https: //www.verywellhealth.com/myalgic-encephalomyelitis-me-715663",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making Public Things: How HCI Design Can Express Matters of Concern. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2397--2406.  ",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "Cillian Dudley and Simon L. Jones. 2018. Fitbit for the Mind?: An Exploratory Study of 'Cognitive Personal Informatics'. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article LBW542, 6 pages.  ",
      "doi": "10.1145/3170427.3188530"
    },
    {
      "text": "Melissa Edmonds, Hugh McGuire, and Jonathan R. Price. 2004. Exercise therapy for chronic fatigue syndrome. Cochrane database of systematic reviews 3 (2004).",
      "doi": ""
    },
    {
      "text": "Emerge Australia. 2019. Managing Symptoms on a Daily Basis (webpage). https://emerge.org.au/diagnosis/ managing-symptoms-daily-basis/",
      "doi": ""
    },
    {
      "text": "Michael Falk Hvidberg, Louse Schouborg Brinth, Anne V. Olesen, Karin D. Petersen, and Lars Ehlers. 2018. The Health-Related Quality of Life for Patients with Myalgic Encephalomyelitis / Chronic Fatigue Syndrome (ME/CFS). PLoS ONE 10, 7 (2018), e0132421.",
      "doi": ""
    },
    {
      "text": "Sergio Felipe, Aneesha Singh, Caroline Bradley, Amanda C. de C. Williams, and Nadia Bianchi-Berthouze. 2015. Roles for personal informatics in chronic pain. In Pervasive Computing Technologies for Healthcare (PervasiveHealth), 2015 9th International Conference on. IEEE, 161--168. ",
      "doi": "10.5555/2826165.2826189"
    },
    {
      "text": "Keiji Fukuda, Stephen E Straus, Ian Hickie, Michael C Sharpe, James G Dobbins, and Anthony Komaroff. 1994. The chronic fatigue syndrome: a comprehensive approach to its definition and study. Annals of Internal Medicine 121, 12 (1994), 953--959.",
      "doi": ""
    },
    {
      "text": "Keith Geraghty, Mark Hann, and Stoyan Kurtev. 2017. Myalgic encephalomyelitis/chronic fatigue syndrome patients' reports of symptom changes following cognitive behavioural therapy, graded exercise therapy and pacing treatments: Analysis of a primary survey compared with secondary surveys. Journal of Health Psychology 0, 0 (2017), 1359105317726152. arXiv:https://doi.org/10.1177/1359105317726152 PMID: 28847166.",
      "doi": ""
    },
    {
      "text": "Ellen M Goudsmit, Jo Nijs, Leonard A Jason, and Karen E Wallman. 2012. Pacing as a strategy to improve energy management in myalgic encephalomyelitis/chronic fatigue syndrome: a consensus document. Disability and rehabilitation 34, 13 (2012), 1140--1147.",
      "doi": ""
    },
    {
      "text": "Stephen T Holgate, Anthony L Komaroff, Dennis Mangan, and Simon Wessely. 2011. Chronic fatigue syndrome: understanding a complex illness. Nature Reviews Neuroscience 12, 9 (2011), 539.",
      "doi": ""
    },
    {
      "text": "Leonard Jason, Susan Torres-Harding, and Mary Gloria Njoku. 2006. The Face of CFS in the U.S. The CIFIDS Chronicle (01 2006), 16--21.",
      "doi": ""
    },
    {
      "text": "Leonard A Jason. 2017. The PACE trial missteps on pacing and patient selection. Journal of Health Psychology 22, 9 (2017), 1141--1145.",
      "doi": ""
    },
    {
      "text": "Leonard A Jason, Molly Brown, Abigail Brown, Meredyth Evans, Samantha Flores, Elisa Grant-Holler, and Madison Sunnquist. 2013. En­ ergy conservation/envelope theory interventions. Fatigue: Biomedicine, Health & Behavior 1, 1--2 (2013), 27--42.",
      "doi": ""
    },
    {
      "text": "Leonard A Jason, Meredyth Evans, Suzanna So, Jilian Scott, and Abigail Brown. 2015. Problems in defining post-exertional malaise. Journal of Prevention & Intervention in the Community 43, 1 (2015), 20--31.",
      "doi": ""
    },
    {
      "text": "Leonard A Jason, Judith A Richman, Alfred W Rademaker, Karen M Jordan, Audrius V Plioplys, Renee R Taylor, William McCready, Cheng-Fang Huang, and Sigita Plioplys. 1999. A community-based study of chronic fatigue syndrome. Archives of Internal Medicine 159, 18 (1999), 2129--2137.",
      "doi": ""
    },
    {
      "text": "Simon L. Jones and Ryan Kelly. 2018. Dealing With Information Over­ load in Multifaceted Personal Informatics Systems. Human-Computer Interaction 33, 1 (2018), 1--48.",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja and Wanda Pratt. 2012. Healthcare in the pocket: mapping the space of mobile-phone health interventions. Journal of Biomedical Informatics 45, 1 (2012), 184--198.  ",
      "doi": "10.1016/j.jbi.2011.08.017"
    },
    {
      "text": "Anthony L Komaroff and Dedra Buchwald. 1991. Symptoms and signs of chronic fatigue syndrome. Reviews of Infectious Diseases 13, Supplement_1 (1991), S8--S11.",
      "doi": ""
    },
    {
      "text": "Daphne Kos, Inge Van Eupen, Jill Meirte, Deborah Van Cauwenbergh, Greta Moorkens, Mira Meeus, and Jo Nijs. 2015. Activity pacing self management in chronic fatigue syndrome: a randomized controlled trial. American Journal of Occupational Therapy 69, 5 (2015), 6905290020p1-- 6905290020p11.",
      "doi": ""
    },
    {
      "text": "Kyriaki Kouyanou, Charles E Pither, and Simon Wessely. 1997. Iatrogenic factors and chronic pain. Psychosomatic Medicine 59, 6 (1997), 597--604.",
      "doi": ""
    },
    {
      "text": "Eliana M. Lacerda, Caroline C. Kingdon, Erinna W. Bowman, and Luis Nacul. 2018. Using a participatory approach to develop and implement the UK ME/CFS Biobank. Fatigue: Biomedicine, Health & Behavior 6, 1 (2018), 1--4.",
      "doi": ""
    },
    {
      "text": "Krupp LB, Sliwinski M, Masur DM, Friedberg F, and Coyle PK. 1994. Cognitive functioning and depression in patients with chronic fatigue syndrome and multiple sclerosis. Archives of Neurology 51, 7 (1994), 705--710.",
      "doi": ""
    },
    {
      "text": "Anastasia Aldelina Lijadiand, Gertina Johanna van Schalkwyk. 2015. On­line Facebook focus group research of hard-to-reach participants. Inter­national Journal of Qualitative Methods 14, 5 (2015), 1609406915621383.",
      "doi": ""
    },
    {
      "text": "James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. Fish'N'Steps: Encouraging Physical Activity with an Interactive Computer Game. In Proceedings of the 8th International Conference on Ubiquitous Computing (UbiComp'06). Springer-Verlag, Berlin, Heidelberg, 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: Investigation of Social Scaffolding for Reflec­tive Thinking in Diabetes Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Madhavan Mani, David J Kavanagh, Leanne Hides, and Stoyan R Stoyanov. 2015. Review and Evaluation of Mindfulness-Based iPhone Apps. JMIR mHealth uHealth 3, 3 (19 Aug 2015), e82.",
      "doi": ""
    },
    {
      "text": "Mollie McKillop, Lena Mamykina, and Noémie Elhadad. 2018. Design­ing in the Dark: Eliciting Self-tracking Dimensions for Understanding Enigmatic Disease. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 565, 15 pages.  ",
      "doi": "10.1145/3173574.3174139"
    },
    {
      "text": "Aaron S Miller, Joseph A Cafazzo, and Emily Seto. 2016. A game plan: Gamification design principles in mHealth applications for chronic disease management. Health Informatics Journal 22, 2 (2016), 184--193. arXiv:https://doi.org/10.1177/1460458214537511 PMID: 24986104.",
      "doi": ""
    },
    {
      "text": "Christine Miserandino. 2003. The Spoon Theory. Available Online. https://butyoudontlooksick.com/articles/written-by-christine/ the-spoon-theory/",
      "doi": ""
    },
    {
      "text": "Florian 'Floyd' Mueller, Frank Vetere, Martin R. Gibbs, Jesper Kjeldskov, Sonja Pedell, and Steve Howard. 2005. Hug over a Distance. In CHI '05 Extended Abstracts on Human Factors in Com­puting Systems (CHI EA '05). ACM, New York, NY, USA, 1673--1676.  ",
      "doi": "10.1145/1056808.1056994"
    },
    {
      "text": "Michael J Muller. 2003. Participatory design: the third space in HCI. Human-computerinteraction:Developmentprocess 4235(2003),165--185.",
      "doi": ""
    },
    {
      "text": "Elizabeth L. Murnane, Saeed Abdullah, Mark Matthews, Matthew Kay, Julie A. Kientz, Tanzeem Choudhury, Geri Gay, and Dan Cosley. 2016. Mobile Manifestations of Alertness: Connecting Biological Rhythms with Patterns of Smartphone App Use. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, New York, NY, USA, 465--477.  ",
      "doi": "10.1145/2935334.2935383"
    },
    {
      "text": "Jo Nijs, Kenny De Meirleir, and William Duquet. 2004. Kinesiophobia in chronic fatigue syndrome: Assessment and associations with disability. Archives of physical medicine and rehabilitation 85,10(2004),1586--1592.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes and Geraldine Fitzpatrick. 2015. SelfCare Technologies and Collaboration. International Jour­nal of Human--Computer Interaction 31, 12 (2015), 869--881.",
      "doi": ""
    },
    {
      "text": "Francisco Nunes, Paula Alexandra Silva, João Cevada, Ana Cor­reia Barros, and Luís Teixeira. 2016. User interface design guidelines for smartphone applications for people with Parkinson's disease. Universal Access in the Information Society 15, 4 (01 Nov 2016), 659--679.  ",
      "doi": "10.1007/s10209-015-0440-1"
    },
    {
      "text": "Anthony Ocon. 2013. Caught in the thickness of brain fog: exploring the cognitive symptoms of Chronic Fatigue Syndrome. Frontiers in Physiology 4 (2013), 63.",
      "doi": ""
    },
    {
      "text": "Tom Owen, Jennifer Pearson, Harold Thimbleby, and George Buchanan. 2015. ConCap: Designing to Empower Individual Reflection on Chronic Conditions Using Mobile Apps. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 105--114.  ",
      "doi": "10.1145/2785830.2785881"
    },
    {
      "text": "Davy Preuveneers and Yolande Berbers. 2008. Mobile Phones Assisting with Health Self-care: A Diabetes Case Study. In Proceedings of the 10th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '08). ACM, New York, NY, USA, 177--186.  ",
      "doi": "10.1145/1409240.1409260"
    },
    {
      "text": "Mitchell E Tidy E Price, JR and V Hunot. 2008. Cognitive behaviour therapy for chronic fatigue syndrome in adults. Cochrane Database of System­atic Reviews 3 (2008).",
      "doi": ""
    },
    {
      "text": "Judith B Prins, Gijs Bleijenberg, Ellen Bazelmans, Lammy D Elving, Theo M de Boo, Johan L Severens, Gert Jan van der Wilt, Philip Spinhoven, and Jos WM Van der Meer. 2001. Cognitive behaviour therapy for chronic fatigue syndrome: a multicentre randomised controlled trial. The Lancet 357, 9259 (2001), 841--847.",
      "doi": ""
    },
    {
      "text": "Katharine A Rimes and Janet Wingrove. 2013. Mindfulness-based cognitive therapy for people with chronic fatigue syndrome still experiencing excessive fatigue after cognitive behaviour therapy: A pilot randomized study. Clinical Psychology & Psychotherapy 20, 2 (2013), 107--117.",
      "doi": ""
    },
    {
      "text": "Ann Marie Roepke, Sara R Jaffee, Olivia M Riffle, Jane McGonigal, Rose Broome, and Bez Maxwell. 2015. Randomized controlled trial of Su­ perBetter, a smartphone-based/internet-based self-help tool to reduce depressive symptoms. Games for Health Journal 4, 3 (2015), 235--246.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner, Saba Kawas, Wenqi Li, Nicole Tilly, and Yi-Chen Sung. 2016. Out of Time, Out of Place: Reflections on Design Workshops As a Research Method. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1131--1141.  ",
      "doi": "10.1145/2818048.2820021"
    },
    {
      "text": "Jessica Schroeder, Chia-Fang Chung, Daniel A. Epstein, Ravi Karkar, Adele Parsons, Natalia Murinova, James Fogarty, and Sean A. Munson. 2018. Examining Self-Tracking by People with Migraine: Goals, Needs, and Opportunities in a Chronic Health Condition. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 135--148.  ",
      "doi": "10.1145/3196709.3196738"
    },
    {
      "text": "Jessica Schroeder, Jane Hoffswell, Chia-Fang Chung, James Fogarty, Sean Munson, and Jasmine Zia. 2017. Supporting Patient-Provider Collaboration to Identify Individual Triggers Using Food and Symptom Journals. In Proceedings of the 2017 ACM Conference on Computer Sup­ ported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1726--1739.  ",
      "doi": "10.1145/2998181.2998276"
    },
    {
      "text": "M.C. Sharpe, L.C. Archard, J.E. Banatvala, L.K. Borysiewicz, A.W. Clare, A. David, R.H. Edwards, K.E. Hawton, H.P. Lambert, and R.J. Lane. 1991. A report--chronic fatigue syndrome: guidelines for research. Journal of the Royal Society of Medicine 84, 2 (1991), 118--121.",
      "doi": ""
    },
    {
      "text": "Christina Surawy, Jill Roberts, and Amy Silver. 2005. The effect of mindfulness training on mood and measures of fatigue, activity, and quality of life in patients with chronic fatigue syndrome on a hospital waiting list: a series of exploratory studies. Behavioural and Cognitive Psychotherapy 33, 1 (2005), 103--109.",
      "doi": ""
    },
    {
      "text": "David R. Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American Journal of Evaluation 27, 2 (2006), 237--246.",
      "doi": ""
    },
    {
      "text": "FN Twisk and Michael Maes. 2009. A review on cognitive behavo­rial therapy (CBT) and graded exercise therapy (GET) in myalgic encephalomyelitis (ME)/chronic fatigue syndrome (CFS): CBT/GET is not only ineffective and not evidence-based, but also potentially harmful for many patients with ME/CFS. Neuro Endocrinology Letters 30, 3 (2009), 284--299.",
      "doi": ""
    },
    {
      "text": "Boudewijn Van Houdenhove and Patrick Luyten. 2008. Customizing treatment of chronic fatigue syndrome and fibromyalgia: the role of perpetuating factors. Psychosomatics 49, 6 (2008), 470--477.",
      "doi": ""
    },
    {
      "text": "Jan H. M. M. Vercoulen, Caroline M. A. Swanink, Jan F. M. Fennis, Joep M. D. Galama, Jos W. M. van der Meer, and Gijs Bleijenberg. 1994. Dimensional assessment of chronic fatigue syndrome. Journal of Psychosomatic Research 38, 5 (1994), 383--392.",
      "doi": ""
    },
    {
      "text": "Norma C Ware. 1992. Suffering and the social construction of illness: The delegitimation of illness experience in chronic fatigue syndrome. Medical Anthropology Quarterly 6, 4 (1992), 347--361.",
      "doi": ""
    },
    {
      "text": "Carolyn Wilshire, Tom Kindlon, Alem Matthees, and Simon McGrath. 2017. Can patients with chronic fatigue syndrome really recover after graded exercise or cognitive behavioural therapy? A critical commentary and preliminary re-analysis of the PACE trial. Fatigue: Biomedicine, Health & Behavior 5, 1 (2017), 43--56.",
      "doi": ""
    },
    {
      "text": "Carolyn E. Wilshire, Tom Kindlon, Robert Courtney, Alem Matthees, David Tuller, Keith Geraghty, and Bruce Levin. 2018. Rethinking the treatment of chronic fatigue syndrome-a reanalysis and evaluation of findings from a recent major trial of graded exercise and CBT. BMC Psy­chology 6,1(22 Mar 2018),6.",
      "doi": ""
    },
    {
      "text": "Anette Winger, Mirjam Ekstedt, Vegard B Wyller, and Sølvi Helseth. 2014. 'Sometimes it feels as if the world goes on without me': Adolescents' experiences of living with chronic fatigue syndrome. Journal of Clinical Nursing 23, 17--18 (2014), 2649--2657.",
      "doi": ""
    },
    {
      "text": "Rayoung Yang, Eunice Shin, Mark W. Newman, and Mark S. Ackerman. 2015. When Fitness Trackers Don't 'Fit': End-user Difficulties in the Assessment of Personal Tracking Device Accuracy. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 623--634.  ",
      "doi": "10.1145/2750858.2804269"
    }
  ]
}