{
  "doi": "10.1145/3290605.3300575",
  "title": "AdaCAD: Crafting Software For Smart Textiles Design",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Woven smart textiles are useful in creating flexible electronics because they integrate circuitry into the structure of the fabric itself. However, there do not yet exist tools that support the specific needs of smart textiles weavers. This paper describes the process and development of AdaCAD, an application for composing smart textile weave drafts. By augmenting traditional weaving drafts, AdaCAD allows weavers to design woven structures and circuitry in tandem and offers specific support for common smart textiles techniques. We describe these techniques, how our tool supports them alongside feedback from smart textiles weavers. We conclude with a reflection on smart textiles practice more broadly and suggest that the metaphor of coproduction can be fruitful in creating effective tools and envisioning future applications in this space.",
  "tags": [
    "smart textiles",
    "weaving",
    "computer-aided design"
  ],
  "authors": [
    {
      "name": "Mikhaila Friske",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366728",
      "orcid": "missing"
    },
    {
      "name": "Shanel Wu",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366751",
      "orcid": "missing"
    },
    {
      "name": "Laura Devendorf",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81557677456/rel-imgonly/laura_devendorf14ga.jpg",
      "acmid": "81557677456",
      "orcid": "0000-0002-3656-7936"
    }
  ],
  "references": [
    {
      "text": "2011. Pressure Sensors : Dena Molnar. http://www.denamolnar.com/ textiles/pressure-sensors/ Retrieved on September 14, 2018.",
      "doi": ""
    },
    {
      "text": "2014. WOVNS. https://www.wovns.com/. Retrieved on September 14, 2018.",
      "doi": ""
    },
    {
      "text": "2017. Ponoko. https://www.ponoko.com/. Retrieved on September 17, 2018.",
      "doi": ""
    },
    {
      "text": "2017. Textile Academy. http://textile-academy.org/. Retrieved on September 17, 2018.",
      "doi": ""
    },
    {
      "text": "2018. Ada Lovelace | Babbage Engine | Computer History Museum. http://www.computerhistory.org/babbage/adalovelace/ Retrieved on September 7, 2018.",
      "doi": ""
    },
    {
      "text": "2018. Shapeways - Create Your Product. Build Your Business. https: //www.shapeways.com/. Retrieved on September 17, 2018.",
      "doi": ""
    },
    {
      "text": "Philip E. Agre. 1997. Computation and Human Experience. Cambridge University Press, Cambridge ; New York. ",
      "doi": "10.5555/522884"
    },
    {
      "text": "Anni Albers. 2003. On Weaving. Courier Corporation. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk M. Friske et al.",
      "doi": ""
    },
    {
      "text": "Lena Berglin. 2005. Spookies: Combining Smart Materials and Information Technology in an Interactive Toy. In Proceedings of the 2005 Conference on Interaction Design and Children (IDC '05). ACM, New York, NY, USA, 17--23.  ",
      "doi": "10.1145/1109540.1109543"
    },
    {
      "text": "Joanna Berzowska. 2006. Krakow: A Woven Story of Memory and Erasure: Copyright Restrictions Prevent ACM from Providing the Full Text for This Work.. In ACM SIGGRAPH 2006 Art Gallery (SIGGRAPH '06). ACM, New York, NY, USA.  ",
      "doi": "10.1145/1178977.1178992"
    },
    {
      "text": "Joanna Berzowska and Maksim Skorobogatiy. 2009. Karma Chameleon: Jacquard-woven Photonic Fiber Display. In SIGGRAPH 2009: Talks (SIGGRAPH '09). ACM, New York, NY, USA, 11:1--11:1.  ",
      "doi": "10.1145/1597990.1598001"
    },
    {
      "text": "Justin Chan and Shyamnath Gollakota. 2017. Data Storage and Interaction Using Magnetized Fabric. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 655--663.  ",
      "doi": "10.1145/3126594.3126620"
    },
    {
      "text": "Deborah Chandler. 2009. Learning to Weave (revised ed.). Interweave.",
      "doi": ""
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. \"I Don't Want to Wear a Screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 6028--6039.  ",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Laura Devendorf and Daniela K. Rosner. 2017. Beyond Hybrids: Metaphors and Margins in Design. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 995--1000.  ",
      "doi": "10.1145/3064663.3064705"
    },
    {
      "text": "Tamara Anna Efrat, Moran Mizrahi, and Amit Zoran. 2016. The Hybrid Bricolage: Bridging Parametric Design with Craft Through Algorithmic Modularity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5984--5995.  ",
      "doi": "10.1145/2858036.2858441"
    },
    {
      "text": "Ylva Fernaeus, Martin Jonsson, and Jakob Tholander. 2012. Revisiting the Jacquard Loom: Threads of History and Current Patterns in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1593--1602.  ",
      "doi": "10.1145/2207676.2208280"
    },
    {
      "text": "Mahiar Hamedi, Robert Forchheimer, and Olle Inganäs. 2007. Towards woven logic from organic electronic fibres. Nature Materials 6, 5 (May 2007), 357--362.",
      "doi": ""
    },
    {
      "text": "Anja Hertenberger, Barbro Scholz, Beam Contrechoc, Becky Stewart, Ebru Kurbak, Hannah Perner-Wilson, Irene Posch, Isabel Cabral, Jie Qi, Katharina Childs, Kristi Kuusk, Lynsey Calder, Marina Toeters, Marta Kisand, Martijn ten Bhömer, Maurin Donneaud, Meg Grant, Melissa Coleman, Mika Satomi, Mili Tharakan, Pauline Vierne, Sara Robertson, Sarah Taylor, and Troy Robert Nachtigall. 2014. 2013 eTextile Swatchbook Exchange: The Importance of Sharing Physical Work. In Proceedings of the 2014 ACM International Symposium on Wearable Computers: Adjunct Program (ISWC '14 Adjunct). ACM, New York, NY, USA, 77--81.  ",
      "doi": "10.1145/2641248.2641276"
    },
    {
      "text": "Scott E. Hudson. 2014. Printing Teddy Bears: A Technique for 3D Printing of Soft Interactive Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 459--468.  ",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Yuki Igarashi and Takeo Igarashi. 2009. Designing Plush Toys with a Computer. Commun. ACM 52, 12 (Dec. 2009), 81--88.  ",
      "doi": "10.1145/1610252.1610275"
    },
    {
      "text": "Tim Ingold. 2013. The Sighted Watchmaker. In Making: Anthropology, Archaeology, Art and Architecture. Routledge, 61--73.",
      "doi": ""
    },
    {
      "text": "Jennifer Jacobs, Joel Brandt, Radomír Mech, and Mitchel Resnick. 2018. Extending Manual Drawing Practices with Artist-Centric Programming Tools. ACM Press, 1--13.  ",
      "doi": "10.1145/3173574.3174164"
    },
    {
      "text": "Jennifer Jacobs, Mitchel Resnick, and Leah Buechley. 2014. DressCode: supporting youth in computational design and making. In Proceedings of Constructionism 2014 Conference. Vienna, Austria., 10.",
      "doi": ""
    },
    {
      "text": "Janis Jefferies. 2012. Pattern, patterning. In Inventive Methods: The Happening of the Social, Celia Lury and Nina Wakeford (Eds.). Routledge, 125--135.",
      "doi": ""
    },
    {
      "text": "Thorsten Karrer, Moritz Wittenhagen, Leonhard Lichtschlag, Florian Heller, and Jan Borchers. 2011. Pinstripe: Eyes-free Continuous Input on Interactive Clothing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1313--1322.  ",
      "doi": "10.1145/1978942.1979137"
    },
    {
      "text": "Kristi Kuusk, Marjan Kooroshnia, and Jussi Mikkonen. 2015. Crafting Butterfly Lace: Conductive Multi-color Sensor-actuator Structure. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 595--600.  ",
      "doi": "10.1145/2800835.2801669"
    },
    {
      "text": "Jessica Lingel and Tim Regan. 2014. \"It's in Your Spinal Cord, It's in Your Fingertips\": Practices of Tools and Craft in Building Software. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 295--304.  ",
      "doi": "10.1145/2531602.2531614"
    },
    {
      "text": "Pamela Liou. 2015. Doti: the Dot-Matrix Desktop Loom. http:// pamelaliou.com/blog/?p=418",
      "doi": ""
    },
    {
      "text": "Anja Lund, Karin Rundqvist, Erik Nilsson, Liyang Yu, Bengt Hagström, and Christian Müller. 2018. Energy harvesting textiles for a rainy day: woven piezoelectrics based on melt-spun PVDF microfibres with a conducting core. npj Flexible Electronics 2, 1 (March 2018), 9.",
      "doi": ""
    },
    {
      "text": "Ali Maziz, Alessandro Concas, Alexandre Khaldi, Jonas Stålhand, NilsKrister Persson, and Edwin W. H. Jager. 2017. Knitting and weaving artificial muscles. Science Advances 3, 1 (Jan. 2017), e1600327.",
      "doi": ""
    },
    {
      "text": "James McCann, Lea Albaugh, Vidya Narayanan, April Grow, Wojciech Matusik, Jennifer Mankoff, and Jessica Hodgins. 2016. A Compiler for 3D Machine Knitting. ACM Trans. Graph. 35, 4 (July 2016).  ",
      "doi": "10.1145/2897824.2925940"
    },
    {
      "text": "Jussi Mikkonen and Emmi Pouta. 2015. Weaving Electronic Circuit into Two-layer Fabric. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 245--248.  ",
      "doi": "10.1145/2800835.2800936"
    },
    {
      "text": "Stephen Monteiro. 2017. The Fabric of Interface: Mobile Media, Design, and Gender. The MIT Press. https://mitpress.mit.edu/books/ fabric-interface",
      "doi": ""
    },
    {
      "text": "Yuki Mori and Takeo Igarashi. 2007. Plushie: An Interactive Design System for Plush Toys. In ACM SIGGRAPH 2007 Papers (SIGGRAPH '07). ACM, New York, NY, USA.  ",
      "doi": "10.1145/1275808.1276433"
    },
    {
      "text": "Digital Weaving Norway. 2018. TC2 Digital Jacquard Loom. http: //www.digitalweaving.no/",
      "doi": ""
    },
    {
      "text": "Maggie Orth, Rehmi Post, and Emily Cooper. 1998. Fabric Computing Interfaces. In CHI 98 Conference Summary on Human Factors in Computing Systems (CHI '98). ACM, New York, NY, USA, 331--332.  ",
      "doi": "10.1145/286498.286800"
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal, and Michael Haller. 2017. SmartSleeve: Real-time Sensing of Surface AdaCAD: Crafting Software for Smart Textiles Design CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk and Deformation Gestures on Flexible, Interactive Textiles, Using a Hybrid Gesture Detection Pipeline. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 565--577.  ",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "Huaishu Peng, Jennifer Mankoff, Scott E. Hudson, and James McCann. 2015. A Layered Fabric 3D Printer for Soft Interactive Objects. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1789--1798.  ",
      "doi": "10.1145/2702123.2702327"
    },
    {
      "text": "Hannah Perner-Wilson, Leah Buechley, and Mika Satomi. 2011. Handcrafting Textile Interfaces from a Kit-of-no-parts. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, New York, NY, USA, 61--68.  ",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "Hannah Perner-Wilson and Mika Satomi. 2012. Involving the Machines. http://www.kobakant.at/?p=241",
      "doi": ""
    },
    {
      "text": "Hannah Perner-Wilson and Mika Satomi. 2015. Woven Pressure Sensor. http://www.kobakant.at/DIY/?p=6005",
      "doi": ""
    },
    {
      "text": "Irene Posch. 2017. Crafting Tools. Interactions 24, 2 (Feb. 2017), 78--81.  ",
      "doi": "10.1145/3038227"
    },
    {
      "text": "Irene Posch and Geraldine Fitzpatrick. 2018. Integrating Textile Materials with Electronic Making: Creating New Tools and Practices. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18). ACM, New York, NY, USA, 158--165.  ",
      "doi": "10.1145/3173225.3173255"
    },
    {
      "text": "Irene Posch and Ebru Kurbak. 2016. CRAFTED LOGIC Towards HandCrafting a Computer. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3881--3884.  ",
      "doi": "10.1145/2851581.2891101"
    },
    {
      "text": "E. R. Post, M. Orth, P. R. Russo, and N. Gershenfeld. 2000. E-broidery: Design and fabrication of textile-based computing. IBM Systems Journal 39, 3.4 (2000), 840--860.  ",
      "doi": "10.1147/sj.393.0840"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4216--4227.  ",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Anura Rathnayake and Tilak Dias. 2015. Yarns with Embedded Electronics. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 385--388.  ",
      "doi": "10.1145/2800835.2800919"
    },
    {
      "text": "Daniela K. Rosner, Samantha Shorey, Brock R. Craft, and Helen Remick. 2018. Making Core Memory: Design Inquiry into Gendered Legacies of Engineering and Craftwork. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 531:1--531:13.  ",
      "doi": "10.1145/3173574.3174105"
    },
    {
      "text": "Alice Schlein and Bhakti Ziek. 2006. The Woven Pixel: Designing for Jacquard and Dobby Looms Using Photoshop®. Bridgewater Press.",
      "doi": ""
    },
    {
      "text": "Stefan Schneegass, Mariam Hassib, Bo Zhou, Jingyuan Cheng, Fernando Seoane, Oliver Amft, Paul Lukowicz, and Albrecht Schmidt. 2015. SimpleSkin: Towards Multipurpose Smart Garments. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 241--244.  ",
      "doi": "10.1145/2800835.2800935"
    },
    {
      "text": "Oscar Tomico, Mascha van Zijverden, Tom Fejér, Yiyu Chen, Eef Lubbers, Meerthe Heuvelings, Sonia Aïssaoui, and Verena Schepperheyn. 2013. Crafting Wearables: Interaction Design Meets Fashion Design. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 2875--2876.  ",
      "doi": "10.1145/2468356.2479556"
    },
    {
      "text": "Anita Vogl, Patrick Parzer, Teo Babic, Joanne Leong, Alex Olwal, and Michael Haller. 2017. StretchEBand: Enabling Fabric-based Interactions Through Rapid Fabrication of Textile Stretch Sensors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2617--2627.  ",
      "doi": "10.1145/3025453.3025938"
    },
    {
      "text": "Michele A. Williams, Asta Roseway, Chris O'Dowd, Mary Czerwinski, and Meredith Ringel Morris. 2015. SWARM: An Actuated Wearable for Mediating Affect. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 293--300.  ",
      "doi": "10.1145/2677199.2680565"
    },
    {
      "text": "Amit Zoran, Roy Shilkrot, Suranga Nanyakkara, and Joseph Paradiso. 2014. The Hybrid Artisans: A Case Study in Smart Tools. ACM Trans. Comput.-Hum. Interact. 21, 3 (June 2014), 15:1--15:29.  ",
      "doi": "10.1145/2617570"
    },
    {
      "text": "C. Zysset, K. Cherenack, T. Kinkeldei, and G. Tröster. 2010. Weaving integrated circuits into textiles. In International Symposium on Wearable Computers (ISWC) 2010. 1--8.",
      "doi": ""
    }
  ]
}