{
  "doi": "10.1145/3290605.3300438",
  "title": "Effects of Local Latency on Game Pointing Devices and Game Pointing Tasks",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Studies have shown certain game tasks such as targeting to be negatively and significantly affected by latencies as low as 41ms. Therefore it is important to understand the relationship between local latency - delays between an input action and resulting change in the display - and common gaming tasks such as targeting and tracking. In addition, games now use a variety of input devices, including touchscreens, mice, tablets and controllers. These devices provide very different combinations of direct/indirect input, absolute/relative movement, and position/rate control, and are likely to be affected by latency in different ways. We performed a study evaluating and comparing the effects of latency across four devices (touchscreen, mouse, controller and drawing tablet) on targeting and interception tasks. We analyze both throughput and path characteristics, identify differences between devices, and provide design considerations for game designers.",
  "authors": [
    {
      "name": "Michael Long",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/do/10.1145/contrib-99659319453/rel-imgonly/small_profile.jpg",
      "acmid": "99659319453",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Human Benchmark - Reaction Time Stats. Retrieved 2018--8--15 from http://www.humanbenchmark.com/tests/reactiontime/stats.php",
      "doi": ""
    },
    {
      "text": "Glen Anderson, Rina Doherty, and Subhashini Ganapathy. 2011. User Perception of Touch Screen Latency. Springer Berlin Heidelberg, Berlin, Heidelberg, 195--202.",
      "doi": ""
    },
    {
      "text": "Tom Beigbeder, Rory Coughlan, Corey Lusher, John Plunkett, Emmanuel Agu, and Mark Claypool. 2004. The Effects of Loss and Latency on User Performance in Unreal Tournament 2003®. In Proceedings of 3rd ACM SIGCOMM Workshop on Network and System Support for Games (NetGames '04). ACM, New York, NY, USA, 144--151.  ",
      "doi": "10.1145/1016540.1016556"
    },
    {
      "text": "Mark Claypool. 2016. On Models for Game Input with Delay #x2014; Moving Target Selection with a Mouse. In 2016 IEEE International Symposium on Multimedia (ISM). 575--582.",
      "doi": ""
    },
    {
      "text": "Mark Claypool. 2018. Game Input with Delay-Moving Target Selection with a Game Controller Thumbstick. ACM Trans. Multimedia Comput. Commun. Appl. 14, 3s (jun 2018), 57:1--57:22.  ",
      "doi": "10.1145/3187288"
    },
    {
      "text": "Mark Claypool and Kajal Claypool. 2006. Latency and player actions in online games. Commun. ACM 49, 11 (2006), 40--45.  ",
      "doi": "10.1145/1167838.1167860"
    },
    {
      "text": "Mark Claypool and Kajal Claypool. 2010. Latency can kill. Proceedings of the first annual ACM SIGMM conference on Multimedia systems MMSys '10 (2010), 215.  ",
      "doi": "10.1145/1730836.1730863"
    },
    {
      "text": "Mark Claypool, Ragnhild Eg, and Kjetil Raaen. 2016. The Effects of Delay on Game Actions. Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts - CHI PLAY Companion '16 (2016), 117--123.  ",
      "doi": "10.1145/2968120.2987743"
    },
    {
      "text": "Jonathan Deber, Ricardo Jota, Clifton Forlines, and Daniel Wigdor. 2015. How Much Faster is Fast Enough? User Perception of Latency & Latency Improvements in Direct and Indirect Touch. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15 1, 1 (2015), 1827--1836.  ",
      "doi": "10.1145/2702123.2702300"
    },
    {
      "text": "Ansgar E Depping and Regan L Mandryk. 2017. Why is This Happening to Me?: How Player Attribution Can Broaden Our Understanding of Player Experience. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1040--1052.  ",
      "doi": "10.1145/3025453.3025648"
    },
    {
      "text": "Matthias Dick, Oliver Wellnitz, and Lars Wolf. 2005. Analysis of Factors Affecting Players' Performance and Perception in Multiplayer Games. In Proceedings of 4th ACM SIGCOMM Workshop on Network and System Support for Games (NetGames '05). ACM, New York, NY, USA, 1--7.  ",
      "doi": "10.1145/1103599.1103624"
    },
    {
      "text": "Carl Gutwin. 2001. The Effects of Network Delays on Group Work in Real-Time Groupware. Springer Netherlands, Dordrecht, 299--318.",
      "doi": ""
    },
    {
      "text": "Carl Gutwin, Steve Benford, Jeff Dyck, Mike Fraser, Ivan Vaghi, and Chris Greenhalgh. 2004. Revealing Delay in Collaborative Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 503--510.  ",
      "doi": "10.1145/985692.985756"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASATLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139--183.",
      "doi": ""
    },
    {
      "text": "Niels Henze, Markus Funk, and Alireza Sahami Shirazi. 2016. Softwarereduced touchscreen latency. Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI '16 (2016), 434--441.  ",
      "doi": "10.1145/2935334.2935381"
    },
    {
      "text": "Niels Henze, Sven Mayer, Huy Viet Le, and Valentin Schwind. 2017. Improving Software-reduced Touchscreen Latency. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, 107:1--107:8.  ",
      "doi": "10.1145/3098279.3122150"
    },
    {
      "text": "Errol R Hoffman. 1992. Fitts' Law with transmission delay. Ergonomics 35, 1 (1992), 37--48.",
      "doi": ""
    },
    {
      "text": "Zenja Ivkovic, Ian Stavness, Carl Gutwin, and Steven Sutcliffe. 2015. Quantifying and Mitigating the Negative Effects of Local Latencies on Aiming in 3D Shooter Games. Proceedings of the ACM CHI'15 Conference on Human Factors in Computing Systems 1 (2015), 135--144.  ",
      "doi": "10.1145/2702123.2702432"
    },
    {
      "text": "Richard J Jagacinski, Daniel W Repperger, Sharon L Ward, and Martin S Moran. 1980. A Test of Fitts' Law with Moving Targets. Human Factors 22, 2 (1980), 225--233.",
      "doi": ""
    },
    {
      "text": "Ricardo Jota, Albert Ng, Paul Dietz, and Daniel Wigdor. 2013. How Fast is Fast Enough?: A Study of the Effects of Latency in Direct-touch Pointing Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2291--2300.  ",
      "doi": "10.1145/2470654.2481317"
    },
    {
      "text": "Michael Long and Carl Gutwin. 2018. Characterizing and Modeling the Effects of Local Latency on Game Performance and Experience. In Proceedings of the ACM Symposium on Computer-Human Interaction in Play (CHI Play 2018). Melbourne, VC, Australia, 13.  ",
      "doi": "10.1145/3242671.3242678"
    },
    {
      "text": "Paul M. Fitts. 1992. The Information Capacity of the Human Motor System in Controlling the Amplitude of Movement. Journal of experimental psychology. General 121 (1992), 262--269.",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie. 1992. Fitts' law as a research and design tool in human-computer interaction. Human-computer interaction 7, 1 (1992), 91--139. arXiv:https://doi.org/10.1207/s15327051hci0701_3  ",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "I. Scott MacKenzie. 2013. Human-Computer Interaction: An Empirical Research Perspective (1st ed.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA. ",
      "doi": "10.5555/2501707"
    },
    {
      "text": "I. Scott MacKenzie, Tatu Kauppinen, and Miika Silfverberg. 2001. Accuracy Measures for Evaluating Computer Pointing Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '01). ACM, New York, NY, USA, 9--16.  ",
      "doi": "10.1145/365024.365028"
    },
    {
      "text": "I. Scott MacKenzie, Abigail Sellen, and William Buxton. 1991. A comparison of input devices in elemental pointing and dragging tasks. Proceedings of the SIGCHI conference on Human factors in computing systems: Reaching through technology 1978 (1991), 161--166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "I. Scott Mackenzie and Colin Ware. 1993. Lag as a determinant of human performance in interactive systems., 488--493 pages. ",
      "doi": "10.5555/164632.164979"
    },
    {
      "text": "Edward McAuley, Terry Duncan, and Vance V Tammen. 1989. Psychometric Properties of the Intrinsic Motivation Inventory in a Competitive Sport Setting: A Confirmatory Factor Analysis. Research Quarterly for Exercise and Sport 60, 1 (1989), 48--58.",
      "doi": ""
    },
    {
      "text": "Albert Ng, Julian Lepinski, Daniel Wigdor, Steven Sanders, and Paul Dietz. 2012. Designing for Low-latency Direct-touch Input. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 453--464.  ",
      "doi": "10.1145/2380116.2380174"
    },
    {
      "text": "Andriy Pavlovych and Wolfgang Stuerzlinger. 2011. Target Following Performance in the Presence of Latency, Jitter, and Signal CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk M. Long et al. Dropouts. In Proceedings of Graphics Interface 2011 (GI '11). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 33--40. http://dl.acm.org/citation.cfm?id=1992917.1992924 ",
      "doi": "10.5555/1992917.1992924"
    },
    {
      "text": "Peter Quax, Patrick Monsieurs, Wim Lamotte, Danny De Vleeschauwer, and Natalie Degrande. 2004. Objective and Subjective Evaluation of the Influence of Small Amounts of Delay and Jitter on a Recent First Person Shooter Game. In Proceedings of 3rd ACM SIGCOMM Workshop on Network and System Support for Games (NetGames '04). ACM, New York, NY, USA, 152--156.  ",
      "doi": "10.1145/1016540.1016557"
    },
    {
      "text": "Richard M Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The Motivational Pull of Video Games: A Self-Determination Theory Approach. Motivation and Emotion 30, 4 (dec 2006), 344--360.",
      "doi": ""
    },
    {
      "text": "Cheryl Savery, T C Nicholas Graham, Carl Gutwin, and Michelle Brown. 2014. The effects of consistency maintenance methods on player experience and performance in networked games. BT - Computer Supported Cooperative Work, CSCW '14, Baltimore, MD, USA, February 15--19, 2014. (2014), 1344--1355.  ",
      "doi": "10.1145/2531602.2531616"
    },
    {
      "text": "Colin Ware and Ravin Balakrishnan. 1994. Reaching for Objects in VR Displays: Lag and Frame Rate. ACM Trans. Comput.-Hum. Interact. 1, 4 (Dec. 1994), 331--356.  ",
      "doi": "10.1145/198425.198426"
    },
    {
      "text": "Min Hong Yun, Songtao He, and Lin Zhong. 2017. Reducing Latency by Eliminating Synchrony. Proceedings of the 26th International Conference on World Wide Web (2017), 331--340.  ",
      "doi": "10.1145/3038912.3052557"
    }
  ]
}