{
  "doi": "10.1145/3290605.3300454",
  "title": "The Dissimilarity-Consensus Approach to Agreement Analysis in Gesture Elicitation Studies",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "We introduce the dissimilarity-consensus method, a new approach to computing objective measures of consensus between users' gesture preferences to support data analysis in end-user gesture elicitation studies. Our method models and quantifies the relationship between users' consensus over gesture articulation and numerical measures of gesture dissimilarity, e.g., Dynamic Time Warping or Hausdorff distances, by employing growth curves and logistic functions. We exemplify our method on 1,312 whole-body gestures elicited from 30 children, ages 3 to 6 years, and we report the first empirical results in the literature on the consensus between whole-body gestures produced by children this young. We provide C# and R software implementations of our method and make our gesture dataset publicly available.",
  "tags": [
    "growth curves",
    "whole-body gestures",
    "consensus",
    "dataset",
    "gesture input",
    "children",
    "logistic model",
    "gesture elicitation"
  ],
  "authors": [
    {
      "name": "Radu-Daniel Vatavu",
      "institution": "University Ştefan cel Mare of Suceava, Suceava, Romania",
      "img": "/do/10.1145/contrib-81343507895/rel-imgonly/radu.jpg",
      "acmid": "81343507895",
      "orcid": "0000-0002-7631-6445"
    }
  ],
  "references": [
    {
      "text": "Abdullah X. Ali, Meredith Ringel Morris, and Jacob O. Wobbrock. 2018. Crowdsourcing Similarity Judgments for Agreement Analysis in End-User Elicitation Studies. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, New York, NY, USA, 177--188.  ",
      "doi": "10.1145/3242587.3242621"
    },
    {
      "text": "Saad Ali and Mubarak Shah. 2010. Human Action Recognition in Videos Using Kinematic Features and Multiple Instance Learning. IEEE Transactions on Pattern Analysis and Machine Intelligence 32, 2 (Feb. 2010), 288--303.  ",
      "doi": "10.1109/TPAMI.2008.284"
    },
    {
      "text": "Aishat Aloba, Gianne Flores, Julia Woodward, Alex Shaw, Amanda Castonguay, Isabella Cuba, Yuzhu Dong, Eakta Jain, and Lisa Anthony. 2018. Kinder-Gator: The UF Kinect Database of Child and Adult Motion. In EG 2018 - Short Papers, Olga Diamanti and Amir Vaxman (Eds.). The Eurographics Association. ",
      "doi": "10.5555/3308470.3308475"
    },
    {
      "text": "Dane Archer. 1997. Unspoken Diversity: Cultural Diferences in Gestures. Qualitative Sociology 20, 1 (March 1997), 79--105.",
      "doi": ""
    },
    {
      "text": "Shaikh Shawon Arefn Shimon, Courtney Lutton, Zichun Xu, Sarah Morrison-Smith, Christina Boucher, and Jaime Ruiz. 2016. Exploring Non-touchscreen Gestures for Smartwatches. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3822--3833.  ",
      "doi": "10.1145/2858036.2858385"
    },
    {
      "text": "Ilhan Aslan, Andreas Uhl, Alexander Meschtscherjakov, and Manfred Tscheligi. 2014. Mid-air Authentication Gestures: An Exploration of Authentication Based on Palm and Finger Motions. In Proceedings of the 16th International Conference on Multimodal Interaction (ICMI '14). ACM, New York, NY, USA, 311--318.  ",
      "doi": "10.1145/2663204.2663246"
    },
    {
      "text": "Gilles Bailly, Thomas Pietrzak, Jonathan Deber, and Daniel J. Wigdor. 2013. Métamorphe: Augmenting Hotkey Usage with Actuated Keys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 563--572.  ",
      "doi": "10.1145/2470654.2470734"
    },
    {
      "text": "Idil Bostan, Oguz Turan Buruk, Mert Canat, Mustafa Ozan Tezcan, Celalettin Yurdakul, Tilbe Göksun, and Oguzhan Özcan. 2017. Hands As a Controller: User Preferences for Hand Specifc On-Skin Gestures. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 1123--1134.  ",
      "doi": "10.1145/3064663.3064766"
    },
    {
      "text": "Robin Brewer, Lisa Anthony, Quincy Brown, Germaine Irwin, Jaye Nias, and Berthel Tate. 2013. Using Gamifcation to Motivate Children to Complete Empirical Studies in Lab Environments. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, New York, NY, USA, 388--391.  ",
      "doi": "10.1145/2485760.2485816"
    },
    {
      "text": "Francesco Cafaro, Leilah Lyons, and Alissa N. Antle. 2018. Framed Guessability: Improving the Discoverability of Gestures and Body Movements for Full-Body Interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 593, 12 pages.  ",
      "doi": "10.1145/3173574.3174167"
    },
    {
      "text": "Ziyun Cai, Jungong Han, Li Liu, and Ling Shao. 2017. RGB-D datasets using Microsoft Kinect or similar sensors: A survey. Multimedia Tools and Applications 76, 3 (Feb 2017), 4313--4355.  ",
      "doi": "10.1007/s11042-016-3374-6"
    },
    {
      "text": "Jessica R. Cauchard, Jane L. E, Kevin Y. Zhai, and James A. Landay. 2015. Drone & Me: An Exploration into Natural Human-Drone Interaction. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 361--365.  ",
      "doi": "10.1145/2750858.2805823"
    },
    {
      "text": "Sabrina Connell, Pei-Yi Kuo, Liu Liu, and Anne Marie Piper. 2013. A Wizard-of-Oz Elicitation Study Examining Child-defned Gestures with a Whole-body Interface. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC '13). ACM, New York, NY, USA, 277--280.  ",
      "doi": "10.1145/2485760.2485823"
    },
    {
      "text": "Suranjith De Silva, Michael Barlow, and Adam Easton. 2014. An Evaluation of DTW Approaches for Whole-of-Body Gesture Recognition. In Proceedings of the 28th International BCS Human Computer Interaction Conference on HCI 2014 - Sand, Sea and Sky - Holiday HCI (BCS-HCI '14). BCS, UK, 11--21.  ",
      "doi": "10.14236/ewic/hci2014.2"
    },
    {
      "text": "Hui Ding, Goce Trajcevski, Peter Scheuermann, Xiaoyue Wang, and Eamonn Keogh. 2008. Querying and Mining of Time Series Data: Experimental Comparison of Representations and Distance Measures. Proceedings of the VLDB Endowment 1, 2 (Aug. 2008), 1542--1552.  ",
      "doi": "10.14778/1454159.1454226"
    },
    {
      "text": "Tilman Dingler, Rufat Rzayev, Alireza Sahami Shirazi, and Niels Henze. 2018. Designing Consistent Gestures Across Device Types: Eliciting RSVP Controls for Phone, Watch, and Glasses. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 419, 12 pages.  ",
      "doi": "10.1145/3173574.3173993"
    },
    {
      "text": "Yuzhu Dong, Aishat Aloba, Sachin Paryani, Lisa Anthony, Neha Rana, and Eakta Jain. 2017. Adult2Child: Dynamic Scaling Laws to Create Child-like Motion. In Proceedings of the 10th International Conference on Motion in Games (MIG '17). ACM, New York, NY, USA, Article 13, 10 pages.  ",
      "doi": "10.1145/3136457.3136460"
    },
    {
      "text": "Marie-Pierre Dubuisson and Anil K. Jain. 1994. A modifed Hausdorf distance for object matching. In Proceedings of 12th International Conference on Pattern Recognition, Vol. 1. 566--568.",
      "doi": ""
    },
    {
      "text": "Jane L. E, Ilene L. E, James A. Landay, and Jessica R. Cauchard. 2017. Drone & Wo: Cultural Infuences on Human-Drone Interaction Techniques. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6794--6799.  ",
      "doi": "10.1145/3025453.3025755"
    },
    {
      "text": "Leah Findlater, Ben Lee, and Jacob Wobbrock. 2012. Beyond QWERTY: Augmenting Touch Screen Keyboards with Multi-touch Gestures for Non-alphanumeric Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2679--2682.  ",
      "doi": "10.1145/2207676.2208660"
    },
    {
      "text": "Bogdan-Florin Gheran, Jean Vanderdonckt, and Radu-Daniel Vatavu. 2018. Gestures for Smart Rings: Empirical Results, Insights, and Design Implications. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 623--635.  ",
      "doi": "10.1145/3196709.3196741"
    },
    {
      "text": "Jun Gong, Xing-Dong Yang, and Pourang Irani. 2016. WristWhirl: One-handed Continuous Smartwatch Input Using Wrist Gestures. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 861--872.  ",
      "doi": "10.1145/2984511.2984563"
    },
    {
      "text": "Lynn Hof, Eva Hornecker, and Sven Bertel. 2016. Modifying Gesture Elicitation: Do Kinaesthetic Priming and Increased Production Reduce Legacy Bias?. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 86--91.  ",
      "doi": "10.1145/2839462.2839472"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3131--3142.  ",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Johanna Höysniemi, Perttu Hämäläinen, and Laura Turkki. 2004. Wizard of Oz Prototyping of Computer Vision Based Action Games for Children. In Proceedings of the 2004 Conference on Interaction Design and Children: Building a Community (IDC '04). ACM, New York, NY, USA, 27--34.  ",
      "doi": "10.1145/1017833.1017837"
    },
    {
      "text": "Johanna Höysniemi, Perttu Hämäläinen, Laura Turkki, and Teppo Rouvi. 2005. Children's Intuitive Gestures in Vision-based Action Games. Commun. ACM 48, 1 (Jan. 2005), 44--50.  ",
      "doi": "10.1145/1039539.1039568"
    },
    {
      "text": "Daniel P. Huttenlocher, Gregory A. Klanderman, and William J. Rucklidge. 1993. Comparing Images Using the Hausdorf Distance. IEEE Transactions on Pattern Analysis and Machine Intelligence 15, 9 (Sept. 1993), 850--863.  ",
      "doi": "10.1109/34.232073"
    },
    {
      "text": "Shoya Ishimaru, Kai Kunze, Koichi Kise, Jens Weppner, Andreas Dengel, Paul Lukowicz, and Andreas Bulling. 2014. In the Blink of an Eye: Combining Head Motion and Eye Blink Frequency for Activity Recognition with Google Glass. In Proceedings of the 5th Augmented Human International Conference (AH '14). ACM, New York, NY, USA, Article 15, 4 pages.  ",
      "doi": "10.1145/2582051.2582066"
    },
    {
      "text": "Eakta Jain, Lisa Anthony, Aishat Aloba, Amanda Castonguay, Isabella Cuba, Alex Shaw, and Julia Woodward. 2016. Is the Motion of a Child Perceivably Diferent from the Motion of an Adult? ACM Transactions on Applied Perception 13, 4, Article 22 (July 2016), 17 pages.  ",
      "doi": "10.1145/2947616"
    },
    {
      "text": "Sujin Jang, Wolfgang Stuerzlinger, Satyajit Ambike, and Karthik Ramani. 2017. Modeling Cumulative Arm Fatigue in Mid-Air Interaction Based on Perceived Exertion and Kinetics of Arm Motion. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3328--3339.  ",
      "doi": "10.1145/3025453.3025523"
    },
    {
      "text": "Christian Kray, Daniel Nesbitt, John Dawson, and Michael Rohs. 2010. User-defned Gestures for Connecting Mobile Phones, Public Displays, and Tabletops. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 239--248.  ",
      "doi": "10.1145/1851600.1851640"
    },
    {
      "text": "Wonjun Lee, Youn-kyung Lim, and Richard Shusterman. 2014. Practicing Somaesthetics: Exploring Its Impact on Interactive Product Design Ideation. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS '14). ACM, New York, NY, USA, 1055--1064.  ",
      "doi": "10.1145/2598510.2598561"
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, Réjean Plamondon, and RaduDaniel Vatavu. 2018. KeyTime: Super-Accurate Prediction of Stroke Gesture Production Times. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 239, 12 pages.  ",
      "doi": "10.1145/3173574.3173813"
    },
    {
      "text": "Luis A. Leiva, Daniel Martín-Albo, and Radu-Daniel Vatavu. 2017. Synthesizing Stroke Gestures Across User Populations: A Case for Users with Visual Impairments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4182--4193.  ",
      "doi": "10.1145/3025453.3025906"
    },
    {
      "text": "Jiayang Liu, Lin Zhong, Jehan Wickramasuriya, and Venu Vasudevan. 2009. uWave: Accelerometer-based Personalized Gesture Recognition and Its Applications. Pervasive and Mobile Computing 5, 6 (Dec. 2009), 657--675.  ",
      "doi": "10.1016/j.pmcj.2009.07.007"
    },
    {
      "text": "Yihua Lou, Wenjun Wu, Radu-Daniel Vatavu, and Wei-Tek Tsai. 2017. Personalized gesture interactions for cyber-physical smart-home environments. Science China Information Sciences (July 2017), 60:072104.",
      "doi": ""
    },
    {
      "text": "Dan Mauney, Jonathan Howarth, Andrew Wirtanen, and Miranda Capra. 2010. Cultural Similarities and Diferences in User-defned Gestures for Touchscreen User Interfaces. In CHI '10 Extended Abstracts on Human Factors in Computing Systems (CHI EA '10). ACM, New York, NY, USA, 4015--4020.  ",
      "doi": "10.1145/1753846.1754095"
    },
    {
      "text": "Keenan R. May, Thomas M. Gable, and Bruce N. Walker. 2017. Designing an In-Vehicle Air Gesture Set Using Elicitation Methods. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '17). ACM, New York, NY, USA, 74--83.  ",
      "doi": "10.1145/3122986.3123015"
    },
    {
      "text": "Microsoft. 2018. Kinect for Windows. htp://kinectforwindows.org/",
      "doi": ""
    },
    {
      "text": "Jin Moen. 2005. Towards People Based Movement Interaction and Kinaesthetic Interaction Experiences. In Proceedings of the 4th Decennial Conference on Critical Computing: Between Sense and Sensibility (CC '05). ACM, New York, NY, USA, 121--124.  ",
      "doi": "10.1145/1094562.1094579"
    },
    {
      "text": "Meredith R. Morris. 2012. Web on the Wall: Insights from a Multimodal Interaction Elicitation Study. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, New York, NY, USA, 95--104.  ",
      "doi": "10.1145/2396636.2396651"
    },
    {
      "text": "Meredith R. Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, m. c. schraefel, and Jacob O. Wobbrock. 2014. Reducing Legacy Bias in Gesture Elicitation Studies. interactions 21, 3 (May 2014), 40--45.  ",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Miguel A. Nacenta, Yemliha Kamber, Yizhou Qiang, and Per Ola Kristensson. 2013. Memorability of Pre-designed and User-defned Gesture Sets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1099--1108.  ",
      "doi": "10.1145/2470654.2466142"
    },
    {
      "text": "Jean Piaget. 2001. The Psychology of Intelligence (2nd Ed.). London: Routledge.",
      "doi": ""
    },
    {
      "text": "Jean Piaget and BÃrbel Elisabeth Inhelder. 1969. The Psychology of the Child. New York: Basic Books.",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. 2013. User-defned Gestures for Augmented Reality. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 955--960.  ",
      "doi": "10.1145/2468356.2468527"
    },
    {
      "text": "Ronald Poppe. 2007. Vision-based Human Motion Analysis: An Overview. Computer Vision and Image Understanding 108, 1--2 (Oct. 2007), 4--18.  ",
      "doi": "10.1016/j.cviu.2006.10.016"
    },
    {
      "text": "Ronald Poppe. 2010. A Survey on Vision-based Human Action Recognition. Image and Vision Computing 28, 6 (June 2010), 976--990.  ",
      "doi": "10.1016/j.imavis.2009.11.014"
    },
    {
      "text": "Mohd. Salihan Rahman, Nazlena Mohamad Ali, and Masnizah Mohd. 2013. A Study on the Naturalness of Gesture-Based Interaction for Children. In Third International Visual Informatics Conference on Advances in Visual Informatics - Volume 8237 (IVIC'13). Springer-Verlag New York, Inc., New York, NY, USA, 718--728.  ",
      "doi": "10.1007/978-3-319-02958-0_65"
    },
    {
      "text": "Thanawin Rakthanmanon, Bilson Campana, Abdullah Mueen, Gustavo Batista, Brandon Westover, Qiang Zhu, Jesin Zakaria, and Eamonn Keogh. 2012. Searching and Mining Trillions of Time Series Subsequences Under Dynamic Time Warping. In Proceedings of the 18th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (KDD '12). ACM, New York, NY, USA, 262--270.  ",
      "doi": "10.1145/2339530.2339576"
    },
    {
      "text": "Jaime Ruiz and Yang Li. 2011. DoubleFlip: A Motion Gesture Delimiter for Mobile Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2717--2720.  ",
      "doi": "10.1145/1978942.1979341"
    },
    {
      "text": "Jaime Ruiz, Yang Li, and Edward Lank. 2011. User-defned Motion Gestures for Mobile Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 197--206.  ",
      "doi": "10.1145/1978942.1978971"
    },
    {
      "text": "Jaime Ruiz and Daniel Vogel. 2015. Soft-Constraints to Reduce Legacy and Performance Bias to Elicit Whole-body Gestures with Low Arm Fatigue. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3347--3350.  ",
      "doi": "10.1145/2702123.2702583"
    },
    {
      "text": "Teddy Seyed, Chris Burns, Mario Costa Sousa, Frank Maurer, and Anthony Tang. 2012. Eliciting Usable Gestures for Multi-display Environments. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS '12). ACM, New York, NY, USA, 41--50.  ",
      "doi": "10.1145/2396636.2396643"
    },
    {
      "text": "Gözel Shakeri, John H. Williamson, and Stephen Brewster. 2017. Novel Multimodal Feedback Techniques for In-Car Mid-Air Gesture Interaction. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '17). ACM, New York, NY, USA, 84--93.  ",
      "doi": "10.1145/3122986.3123011"
    },
    {
      "text": "Chaklam Silpasuwanchai and Xiangshi Ren. 2014. Jump and Shoot!: Prioritizing Primary and Alternative Body Gestures for Intense Gameplay. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 951--954.  ",
      "doi": "10.1145/2556288.2557107"
    },
    {
      "text": "Kathleen Sproufske. 2018. growthcurver: Simple Metrics to Summarize Growth Curves. htps://CRAN.R-project.org/package=growthcurver R package version 0.3.0.",
      "doi": ""
    },
    {
      "text": "Eugene M. Taranta II, Amirreza Samiei, Mehran Maghoumi, Pooya Khaloo, Corey R. Pittman, and Joseph J. LaViola Jr. 2017. Jackknife: A Reliable Recognizer with Few Samples and Many Modalities. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5850--5861.  ",
      "doi": "10.1145/3025453.3026002"
    },
    {
      "text": "Eugene M. Taranta II, Thaddeus K. Simons, Rahul Sukthankar, and Joseph J. Laviola Jr. 2015. Exploring the Benefts of Context in 3D Gesture Recognition for Game-Based Virtual Environments. ACM Transactions on Interactive Intelligent Systems 5, 1, Article 1 (March 2015), 34 pages.  ",
      "doi": "10.1145/2656345"
    },
    {
      "text": "Giovanni Maria Troiano, Esben Warming Pedersen, and Kasper Hornbæk. 2014. User-defned Gestures for Elastic, Deformable Displays. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14). ACM, New York, NY, USA, 1--8.  ",
      "doi": "10.1145/2598153.2598184"
    },
    {
      "text": "Anastasios Tsoularis and James Wallace. 2002. Analysis of logistic growth models. Mathematical Biosciences 179, 1 (2002), 21--55.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu. 2012. User-defned Gestures for Free-hand TV Control. In Proceedings of the 10th European Conference on Interactive TV and Video (EuroITV '12). ACM, New York, NY, USA, 45--48.  ",
      "doi": "10.1145/2325616.2325626"
    },
    {
      "text": "Radu-Daniel Vatavu. 2013. The Impact of Motion Dimensionality and Bit Cardinality on the Design of 3D Gesture Recognizers. International Journal of Human-Computer Studies 71, 4 (April 2013), 387--409.  ",
      "doi": "10.1016/j.ijhcs.2012.11.005"
    },
    {
      "text": "Radu-Daniel Vatavu. 2017. Beyond Features for Recognition: HumanReadable Measures to Understand Users Whole-Body Gesture Performance. International Journal of Human-Computer Interaction 33, 9 (2017), 713--730.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu. 2017. Smart-Pockets: Body-Deictic Gestures for Fast Access to Personal Data during Ambient Interactions. International Journal of Human-Computer Studies 103, C (July 2017), 1--21.  ",
      "doi": "10.1016/j.ijhcs.2017.01.005"
    },
    {
      "text": "Radu-Daniel Vatavu, Gabriel Cramariuc, and Doina Maria Schipor. 2015. Touch Interaction for Children Aged 3 to 6 Years: Experimental Findings and Relationship to Motor Skills. International Journal of Human-Computer Studies 74 (2015), 54--76.  ",
      "doi": "10.1016/j.ijhcs.2014.10.007"
    },
    {
      "text": "Radu-Daniel Vatavu, Bogdan-Florin Gheran, and Maria Doina Schipor. 2018. The Impact of Low Vision on Touch-Gesture Articulation on Mobile Devices. IEEE Pervasive Computing 17, 1 (Jan. 2018), 27--37.  ",
      "doi": "10.1109/MPRV.2018.011591059"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Signifcance Test, and Toolkit. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1325--1334.  ",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2016. Between-Subjects Elicitation Studies: Formalization and Tool Support. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3390--3402.  ",
      "doi": "10.1145/2858036.2858228"
    },
    {
      "text": "Eduardo Velloso, Dominik Schmidt, Jason Alexander, Hans Gellersen, and Andreas Bulling. 2015. The Feet in Human--Computer Interaction: A Survey of Foot-Based Interaction. ACM Comput. Surv. 48, 2, Article 21 (Sept. 2015), 35 pages.  ",
      "doi": "10.1145/2816455"
    },
    {
      "text": "Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A. Myers. 2005. Maximizing the Guessability of Symbolic Input. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1869--1872.  ",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith R. Morris, and Andrew D. Wilson. 2009. User-defned Gestures for Surface Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 1083--1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Jacob O. Wobbrock, Brad A. Myers, and John A. Kembel. 2003. EdgeWrite: A Stylus-based Text Entry Method Designed for High Accuracy and Stability of Motion. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, New York, NY, USA, 61--70.  ",
      "doi": "10.1145/964696.964703"
    },
    {
      "text": "Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures Without Libraries, Toolkits or Training: A $1 Recognizer for User Interface Prototypes. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 159--168.  ",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Ionut-Alexandru Zaii, Stefan Gheorghe Pentiuc, and Radu-Daniel Vatavu. 2015. On Free-Hand TV Control: Experimental Results on User-Elicited Gestures with Leap Motion. Personal and Ubiquitous Computing 19, 5--6, 821--838.",
      "doi": ""
    },
    {
      "text": "Mihai Zanfr, Marius Leordeanu, and Cristian Sminchisescu. 2013. The Moving Pose: An Efcient 3D Kinematics Descriptor for LowLatency Action Recognition and Detection. In Proceedings of the 2013 IEEE International Conference on Computer Vision (ICCV '13). IEEE Computer Society, Washington, DC, USA, 2752--2759.  ",
      "doi": "10.1109/ICCV.2013.342"
    },
    {
      "text": "Shumin Zhai, Per Kristensson, Caroline Appert, Tue Andersen, and Xiang Cao. 2012. Foundational Issues in Touch-Surface Stroke Gesture Design: An Integrative Review. Foundations and Trends in HumanComputer Interaction 5, 2 (Feb. 2012), 97--205.  ",
      "doi": "10.1561/1100000012"
    }
  ]
}