{
  "doi": "10.1145/3290605.3300359",
  "title": "\"This Girl is on Fire\": Sensemaking in an Online Health Community for Vulvodynia",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Online health communities (OHCs) allow people living with a shared diagnosis or medical condition to connect with peers for social support and advice. OHCs have been well studied in conditions like diabetes and cancer, but less is known about their role in enigmatic diseases with unknown or complex causal mechanisms. In this paper, we study one such condition: Vulvodynia, a chronic pain syndrome of the vulvar region. Through observations of and interviews with members of a vulvodynia Facebook group, we found that while the interaction types are broadly similar to those found in other OHCs, the women spent more time seeking basic information and building individualized management plans. They also encounter significant emotional and interpersonal challenges, which they discuss with each other. We use this study to extend the field's understanding of OHCs, and to propose implications for the design of self-tracking tools to support sensemaking in enigmatic conditions.",
  "authors": [
    {
      "name": "Alyson L. Young",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660419496",
      "orcid": "missing"
    },
    {
      "name": "Andrew D. Miller",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/do/10.1145/contrib-81460650224/rel-imgonly/miller2017.jpg",
      "acmid": "81460650224",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Meryl Alappattu, Georgine Lamvu, Jessica Feranec, Kathryn Witzeman, Michael Robinson, and Andrea Rapkin. 2017. Vulvodynia is not created equally: empirical classification of women with vulvodyndia. Journal of Pain Research 10 (Jul 2017), 1601-1609.",
      "doi": ""
    },
    {
      "text": "Jose De Andres, Nerea Sanchis-Lopez, Juan Marcos Asensio-Samper, Gustavo Fabregat-Cid, Vicente L. Villanueva-Perez, Vicente Monsalve Dolz, and Ana Minguez. 2016. Vulvodynia--An Evidence-Based Literature Review and Proposed Treatment Algorithm. Pain Practice: The Official Journal of the World Institute of Pain 16, 2 (Feb 2016), 204-236.",
      "doi": ""
    },
    {
      "text": "Lauren D. Arnold, Gloria A. Bachmann, Sarah Kelly, Raymond Rosen, and George G. Rhoads. 2006. Vulvodynia: Characteristics and Associations with Co-Morbidities and Quality of Life. Obstetrics & Gynecology 107, 3 (Mar 2006), 617-624.",
      "doi": ""
    },
    {
      "text": "American Diabetes Association. 2018. 6. Glycemic Targets: Standards of Medical Care in Diabetes-2018. 41, Supplement 1 (2018), S55-S64.",
      "doi": ""
    },
    {
      "text": "Kathryn Ayling and Jane M. Ussher. 2008. If sex hurts, am I still a woman?: the subjective experience of vulvodynia in hetero-sexual women. Archives of Sexual Behavior 37, 2 (Apr 2008), 294-304.",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Paul Marshall, Anna L. Cox, and Yunan Chen. 2017. Quantifying the Body and Caring for the Mind: Self-Tracking in Multiple Sclerosis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM Press, New York, NY, 6889-6901.  ",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Jacob Bornstein, Andrew T. Goldstein, Colleen K. Stockdale, Sophie Bergeron, Caroline Pukall, Denniz Zolnoun, Deborah Coady, consensus vulvar pain terminology committee of the International Society for the Study of Vulvovaginal Disease (ISSVD), the International Society for the Study of Women' s Sexual Health (ISSWSH), and the International Pelvic Pain Society (IPPS). 2016. ISSVD, ISSWSH and IPPS Consensus Terminology and Classification of Persistent Vulvar Pain and Vulvodynia. Obstetrics & Gynecology 127, 4 (Apr 2016), 745-751.",
      "doi": ""
    },
    {
      "text": "Michael Camilleri. 2004. Treating irritable bowel syndrome: overview, perspective and future therapies. British Journal of Pharmacology 141, 8 (Apr 2004), 1237-1248.",
      "doi": ""
    },
    {
      "text": "Annie T. Chen. 2012. Information seeking over the course of illness: the experience of people with fibromyalgia. Musculoskeletal Care 10, 4 (Dec 2012), 212-220.",
      "doi": ""
    },
    {
      "text": "Claudia Chisari and Joseph Chilcot. 2017. The experience of pain severity and pain interference in vulvodynia patients: The role of cognitive-behavioural factors, psychological distress and fatigue. Journal of Psychosomatic Research 93 (2017), 83-89.",
      "doi": ""
    },
    {
      "text": "Mayo Clinic. 2018. Vulvodynia-Symptoms and causes-Mayo Clinic. https://www.mayoclinic.org/diseases-conditions/vulvodynia/ symptoms-causes/syc-20353423",
      "doi": ""
    },
    {
      "text": "Kim J. Cox and Cynthia E. Neville. 2012. Assessment and management options for women with vulvodynia. Journal of midwifery and women's health 57, 3 (Jun 2012), 231-240.",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM Press, New York, NY, 731-742.  ",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Jordan Eschler, Zakariya Dehlawi, and Wanda Pratt. 2015. Self- Characterized Illness Phase and Information Needs of Participants in an Online Cancer Forum. In Proceedings of the Ninth International AAAI Conference on Web and Social Media. 101-109.",
      "doi": ""
    },
    {
      "text": "Sergio Felipe, Aneesha Singh, Caroline Bradley, Amanda CdeC Williams, and Nadia Bianchi-Berthouze. 2015. Roles for Personal Informatics in Chronic Pain. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM Press, New York, NY, 161-168. http://dl.acm.org/citation.cfm? id=2826165.2826189 ",
      "doi": "10.5555/2826165.2826189"
    },
    {
      "text": "Bernard L. Harlow and Elizabeth Gunther Stewart. 2003. A populationbased assessment of chronic unexplained vulvar pain: have we underestimated the prevalence of vulvodynia? Journal of the American Medical Women's Association (1972) 58, 2 (2003), 82-88.",
      "doi": ""
    },
    {
      "text": "Katrina L. Hinson. 2017. Framing Illness Through Facebook Enabled Online Support Groups. Communication Design Quarterly Review 4, 2b (Mar 2017), 22-31.  ",
      "doi": "10.1145/3068755.3068758"
    },
    {
      "text": "Jina Huh and Mark S. Ackerman. 2012. Collaborative Help in Chronic Disease Management: Supporting Individualized Problems. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (CSCW '12). ACM Press, New York, NY, 853-862.  ",
      "doi": "10.1145/2145204.2145331"
    },
    {
      "text": "Jina Huh, David W. McDonald, Andrea Hartzler, and Wanda Pratt. 2013. Patient Moderator Interaction in Online Health Communities. AMIA Annual Symposium Proceedings (Nov 2013), 627-636. https: //www.ncbi.nlm.nih.gov/pubmed/24551364",
      "doi": ""
    },
    {
      "text": "Jina Huh, David W. McDonald, Andrea Hartzler, and Wanda Pratt. 2014. Weaving Clinical Expertise in Online Health Communities.. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM Press, New York, NY, 1355-1364.  ",
      "doi": "10.1145/2556288.2557293"
    },
    {
      "text": "Ravi Karkar, Jessica Schroeder, Daniel A. Epstein, Laura R. Pina, Jeffrey Scofield, James Fogarty, Julie A. Kientz, Sean A. Munson, Roger Vilardaga, and Jasmine Zia. 2017. TummyTrials: A Feasibility Study of Using Self-Experimentation to Detect Individualized Food Triggers.. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '17). ACM Press, New York, NY, 6850-6863.  ",
      "doi": "10.1145/3025453.3025480"
    },
    {
      "text": "Ravi Karkar, Jasmine Zia, Roger Vilardaga, Sonali R. Mishra, James Fogarty, Sean A. Munson, and Julie A. Kientz. 2016. A framework for self-experimentation in personalized health. Journal of the American Medical Informatics Association 23, 3 (May 2016), 440-448.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A Stage-based Model of Personal Informatics Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM Press, New York, NY, 557-566.  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Haley MacLeod, Grace Bastin, Leslie S. Liu, Katie Siek, and Kay Connelly. 2017. Be Grateful You Don't Have a Real Disease: Understanding Rare Disease Relationships.. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM Press, New York, NY, 1660-1673.  ",
      "doi": "10.1145/3025453.3025796"
    },
    {
      "text": "Haley MacLeod, Anthony Tang, and Sheelagh Carpendale. 2013. Personal Informatics in Chronic Illness Management.. In Proceedings of Graphics Interface 2013 (GI '13). ACM Press, New York, NY, 149-156. http://dl.acm.org/citation.cfm?id=2532129.2532155 ",
      "doi": "10.5555/2532129.2532155"
    },
    {
      "text": "Lena Mamykina, Drashko Nakikj, and Noemie Elhadad. 2015. Collective Sensemaking in Online Health Forums.. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '15). ACM Press, New York, NY, 3217-3226.  ",
      "doi": "10.1145/2702123.2702566"
    },
    {
      "text": "Lena Mamykina, Arlene M. Smaldone, and Suzanne R. Bakken. 2015. Adopting the sensemaking perspective for chronic disease selfmanagement. Journal of Biomedical Informatics 56 (Aug 2015), 406-417.  ",
      "doi": "10.1016/j.jbi.2015.06.006"
    },
    {
      "text": "Jennifer Mankoff, Kateryna Kuksenok, Sara Kiesler, Jennifer A. Rode, and Kelly Waldman. 2011. Competing Online Viewpoints and Models of Chronic Illness.. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM Press, New York, NY, 589-598.  ",
      "doi": "10.1145/1978942.1979027"
    },
    {
      "text": "Mollie McKillop, Lena Mamykina, and Noémie Elhadad. 2018. Designing in the Dark: Eliciting Self-tracking Dimensions for Understanding Enigmatic Disease.. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '18). ACM Press, New York, NY, 585:1-585:15.  ",
      "doi": "10.1145/3173574.3174139"
    },
    {
      "text": "Priya Nambisan. 2011. Information seeking and social support in online health communities: impact on patients' perceived empathy. Journal of the American Medical Informatics Association 18, 3 (May 2011), 298-304.",
      "doi": ""
    },
    {
      "text": "Lisa Neal, Kate Oakley, Gitte Lindgaard, David Kaufman, Jan Marco Leimeister, and Ted Selker. 2007. Online Health Communities.. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM Press, New York, NY, 2129-2132.  ",
      "doi": "10.1145/1240866.1240965"
    },
    {
      "text": "Elizabeth Sillence, Claire Hardy, Pam Briggs, and Peter R Harris. 2016. How do carers of people with multiple sclerosis engage with websites containing the personal experiences of other carers and patients? Health Informatics Journal 22, 4 (Dec 2016), 1045-1054.",
      "doi": ""
    },
    {
      "text": "Meredith M. Skeels, Kenton T. Unruh, Christopher Powell, and Wanda Pratt. 2010. Catalyzing Social Support for Breast Cancer Patients.. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM Press, New York, NY, 173-182.  ",
      "doi": "10.1145/1753326.1753353"
    },
    {
      "text": "Karl E. Weick. 1995. Sensemaking in Organizations. SAGE, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Jennifer L. Welbourne, Anita L. Blanchard, and Marla D. Boughton. 2009. Supportive Communication, Sense of Virtual Community and Health Outcomes in Online Infertility Groups.. In Proceedings of the Fourth International Conference on Communities and Technologies (C&T '09). ACM Press, New York, NY, 31-40.  ",
      "doi": "10.1145/1556460.1556466"
    },
    {
      "text": "Xiaomu Zhou, Si Sun, and Jiang Yang. 2014. Sweet Home: Understanding Diabetes Management via a Chinese Online Community.. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM Press, New York, NY, 3997-4006.  ",
      "doi": "10.1145/2556288.2557344"
    },
    {
      "text": "Denniz Zolnoun, Eliza M. Park, Charity G. Moore, Cara A. Liebert, Frank F. Tu, and Sawson As-Sanie. 2008. Somatization and psychological distress among women with vulvar vestibulitis syndrome. International Journal of Gynecology & Obstetrics 103, 1 (Oct 2008), 38-43.",
      "doi": ""
    }
  ]
}