{
  "doi": "10.1145/3290605.3300319",
  "title": "Tough Times at Transitional Homeless Shelters: Considering the Impact of Financial Insecurity on Digital Security and Privacy",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Addressing digital security and privacy issues can be particularly difficult for users who face challenging circumstances. We performed semi-structured interviews with residents and staff at 4 transitional homeless shelters in the U.S. San Francisco Bay Area (n=15 residents, 3 staff) to explore their digital security and privacy challenges. Based on these interviews, we outline four tough times themes --- challenges experienced by our financially insecure participants that impacted their digital security and privacy --- which included: (1) limited financial resources, (2) limited access to reliable devices and Internet, (3) untrusted relationships, and (4) ongoing stress. We provide examples of how each theme impacts digital security and privacy practices and needs. We then use these themes to provide a framework outlining opportunities for technology creators to better support users facing security and privacy challenges related to financial insecurity.",
  "authors": [
    {
      "name": "Manya Sleeper",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488672672",
      "orcid": "missing"
    },
    {
      "name": "Tara Matthews",
      "institution": "Independent, Pullman, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100545675",
      "orcid": "missing"
    },
    {
      "name": "Kathleen O'Leary",
      "institution": "Google, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556316956",
      "orcid": "missing"
    },
    {
      "name": "Anna Turner",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021717",
      "orcid": "missing"
    },
    {
      "name": "Jill Palzkill Woelfer",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/do/10.1145/contrib-81435608664/rel-imgonly/resize_img_2697_fulbright1.jpg",
      "acmid": "81435608664",
      "orcid": "missing"
    },
    {
      "name": "Martin Shelton",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558085056",
      "orcid": "missing"
    },
    {
      "name": "Andrew Oplinger",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366029",
      "orcid": "missing"
    },
    {
      "name": "Andreas Schou",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366093",
      "orcid": "missing"
    },
    {
      "name": "Sunny Consolvo",
      "institution": "Google, Mountain View, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459425",
      "orcid": "0000-0001-5337-328X"
    }
  ],
  "references": [
    {
      "text": "Monica Anderson. 2017. Digital divide persists even as lower-income Americans make gains in tech adoption. Pew Research Center (2017).",
      "doi": ""
    },
    {
      "text": "Kimberly Bender, Stephanie Begun, Anne DePrince, Badiah Haffejee, and Sarah Kaufmann. 2014. Utilizing technology for longitudinal Tough Times at Transitional Homeless Shelters... CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk communication with homeless youth. Social Work in Health Care 53, 9 (2014), 865--882.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor and Scott Counts. 2018. Measuring employment demand using internet search data. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 122.  ",
      "doi": "10.1145/3173574.3173696"
    },
    {
      "text": "Marshini Chetty, Richard Banks, AJ Brush, Jonathan Donner, and Rebecca Grinter. 2012. You're capped: Understanding the effects of bandwidth caps on broadband use in the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3021--3030.  ",
      "doi": "10.1145/2207676.2208714"
    },
    {
      "text": "Lorrie Faith Cranor. 2008. A framework for reasoning about the human in the loop. In Proceedings of the 1st Conference on Usability, Psychology, and Security. USENIX, 1. ",
      "doi": "10.5555/1387649.1387650"
    },
    {
      "text": "Lorrie Faith Cranor and Simson Garfinkel. 2005. Security and usability: Designing secure systems that people can use. O'Reilly Media.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt, Nishan Bose, Suleman Diwan, and Asha ChenPhang. 2016. Designing for disadvantaged job seekers: Insights from early investigations. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 905--910.  ",
      "doi": "10.1145/2901790.2901865"
    },
    {
      "text": "Jill P Dimond, Casey Fiesler, and Amy S Bruckman. 2011. Domestic violence and information communication technologies. Interacting with Computers 23, 5 (2011), 413--421.  ",
      "doi": "10.1016/j.intcom.2011.04.006"
    },
    {
      "text": "Paul Dunphy, John Vines, Lizzie Coles-Kemp, Rachel Clarke, Vasilis Vlachokyriakos, Peter Wright, John McCarthy, and Patrick Olivier. 2014. Understanding the experience-centeredness of privacy and security technologies. In Proceedings of the 2014 New Security Paradigms Workshop. ACM, 83--94.  ",
      "doi": "10.1145/2683467.2683475"
    },
    {
      "text": "Karin M Eyrich-Garg. 2011. Sheltered in cyberspace? Computer use among the unsheltered 'street' homeless. Computers in Human Behavior 27, 1 (2011), 296--303.  ",
      "doi": "10.1016/j.chb.2010.08.007"
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. \"A Stalker's Paradise\": How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 667.  ",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Elizabeth Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2017. Digital technologies and intimate partner violence: A qualitative analysis with multiple stakeholders. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 46.  ",
      "doi": "10.1145/3134681"
    },
    {
      "text": "Carol Graham. 2000. The High Costs of Being Poor in America: Stress, Pain, and Worry. Brookings Institution Social Mobility Memo (2000).",
      "doi": ""
    },
    {
      "text": "Anne E Green, Yuxin Li, David Owen, and Maria De Hoyos. 2012. Inequalities in use of the Internet for job search: Similarities and contrasts by economic status in Great Britain. Environment and Planning A 44, 10 (2012), 2344--2358.",
      "doi": ""
    },
    {
      "text": "Rosanna E Guadagno, Nicole L Muscanell, and David E Pollio. 2013. The homeless use Facebook?! Similarities of social network use between college students and homeless young adults. Computers in Human Behavior 29, 1 (2013), 86--89.  ",
      "doi": "10.1016/j.chb.2012.07.019"
    },
    {
      "text": "Iulia Ion, Rob Reeder, and Sunny Consolvo. 2015. \"... No one can hack my mind\": Comparing expert and non-expert security practices.. In Proceedings of the Symposium on Usable Privacy and Security, Vol. 15. USENIX, 1--20. ",
      "doi": "10.5555/3235866.3235893"
    },
    {
      "text": "Kathleen M Kowalski-Trakofler, Charles Vaught, and Ted Scharf. 2003. Judgment and decision making under stress: An overview for emergency managers. International Journal of Emergency Management 1, 3 (2003), 278--289.",
      "doi": ""
    },
    {
      "text": "Christopher A Le Dantec. 2008. Life at the margins: Assessing the role of technology for the urban homeless. Interactions 15, 5 (2008), 24--27.  ",
      "doi": "10.1145/1390085.1390090"
    },
    {
      "text": "Tara Matthews, Kerwell Liao, Anna Turner, Marianne Berkovich, Robert Reeder, and Sunny Consolvo. 2016. She'll just grab any device that's closer: A study of everyday device & account sharing in households. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5921--5932.  ",
      "doi": "10.1145/2858036.2858051"
    },
    {
      "text": "Tara Matthews, Kathleen O'Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F Churchill, and Sunny Consolvo. 2017. Stories from survivors: Privacy & security practices when coping with intimate partner abuse. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2189--2201.  ",
      "doi": "10.1145/3025453.3025875"
    },
    {
      "text": "Board of Governors of the Federal Reserve System. 2017. Report on the Economic Well-Being of U.S. Households in 2017.",
      "doi": ""
    },
    {
      "text": "Affordable Housing Online. 2018. Don't Become a Victim! Learn how to identify common online rental housing scams. https: //affordablehousingonline.com/housing-scam-prevention-guide",
      "doi": ""
    },
    {
      "text": "David E Pollio, D Scott Batey, Kimberly Bender, Kristin Ferguson, and Sanna Thompson. 2013. Technology use among emerging adult homeless in two US cities. Social work 58, 2 (2013), 173--175.",
      "doi": ""
    },
    {
      "text": "Lori Ann Post, Federico E Vaca, Kelly M Doran, Cali Luco, Matthew Naftilan, James Dziura, Cynthia Brandt, Steven Bernstein, Liudvikas Jagminas, and Gail D'Onofrio. 2013. New media use by patients who are homeless: The potential of mHealth to build connectivity. Journal of Medical Internet Research 15, 9 (2013).",
      "doi": ""
    },
    {
      "text": "Alison Powell, Amelia Bryne, and Dharma Dailey. 2010. The essential Internet: Digital exclusion in low-income American communities. Policy & Internet 2, 2 (2010), 161--192.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles. 2018. Net benefits: Digital inequities in social capital, privacy preservation, and digital parenting practices of US social media users. In Twelfth International AAAI Conference on Web and Social Media. AAAI.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Sean Kross, and Michelle L Mazurek. 2017. Where is the digital divide?: A survey of security, privacy, and socioeconomics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 931--936.  ",
      "doi": "10.1145/3025453.3025673"
    },
    {
      "text": "Eric Rice and Anamika Barman-Adhikari. 2014. Internet and social media use as a resource among homeless youth. Journal of ComputerMediated Communication 19, 2 (2014), 232--247.  ",
      "doi": "10.1111/jcc4.12038"
    },
    {
      "text": "Eric Rice, Seth Kurzban, and Diana Ray. 2012. Homeless but connected: The role of heterogeneous social network ties and social networking technology in the mental health outcomes of street-living adolescents. Community Mental Health Journal 48, 6 (2012), 692--698.",
      "doi": ""
    },
    {
      "text": "Eric Rice, Alex Lee, and Sean Taitt. 2011. Cell phone use among homeless youth: Potential for new health interventions and research. Journal of Urban Health 88, 6 (2011), 1175--1182.",
      "doi": ""
    },
    {
      "text": "Eric Rice, Norweeta G Milburn, and Mary Jane Rotheram-Borus. 2007. Pro-social and problematic social network influences on HIV/AIDS risk behaviours among newly homeless youth in Los Angeles. AIDS Care 19, 5 (2007), 697--704.",
      "doi": ""
    },
    {
      "text": "Jahmeilah Roberson and Bonnie Nardi. 2010. Survival needs and social inclusion: Technology use among the homeless. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work. ACM, 445--448.  ",
      "doi": "10.1145/1718918.1718993"
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchill. 2018. \"Privacy is not for me, it's for those rich women\": Performative privacy practices on mobile phones by women in South Asia. In Proceedings of the Symposium on Usable Privacy and Security. USENIX. ",
      "doi": "10.5555/3291228.3291240"
    },
    {
      "text": "Jennifer Sheehy-Skeffington and Jessica Rea. 2017. How Poverty Affects People's Decision-making Processes. Joseph Rowntree Foundation York.",
      "doi": ""
    },
    {
      "text": "Aaron Smith. 2015. Searching for work in the digital era. Pew Research Center 19 (2015).",
      "doi": ""
    },
    {
      "text": "Tony Sparks. 2010. Broke not broken: Rights, privacy, and homelessness in Seattle. Urban Geography 31, 6 (2010), 842--862. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk M. Sleeper et al.",
      "doi": ""
    },
    {
      "text": "Sanna J Thompson, David E Pollio, Karin Eyrich, Emily Bradbury, and Carol S North. 2004. Successfully exiting homelessness: Experiences of formerly homeless mentally ill individuals. Evaluation and Program Planning 27, 4 (2004), 423--431.",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Richard Anderson, and Shrirang Mare. 2018. Examining security and privacy research in developing regions. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, 25.  ",
      "doi": "10.1145/3209811.3209818"
    },
    {
      "text": "Yang Wang, Gregory Norcie, Saranga Komanduri, Alessandro Acquisti, Pedro Giovanni Leon, and Lorrie Faith Cranor. 2011. I regretted the minute I pressed share: A qualitative study of regrets on Facebook. In Proceedings of the Symposium on Usable Privacy and Security. ACM, 10.  ",
      "doi": "10.1145/2078827.2078841"
    },
    {
      "text": "Rick Wash and Molly M Cooper. 2018. Who provides phishing training?: Facts, stories, and people like me. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 492.  ",
      "doi": "10.1145/3173574.3174066"
    },
    {
      "text": "Earnest Wheeler and Tawanna R Dillahunt. 2018. Navigating the job search as a low-resourced job seeker. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 48.  ",
      "doi": "10.1145/3173574.3173622"
    },
    {
      "text": "Jill Palzkill Woelfer. 2014. Engaging homeless young people in HCI research. Interactions 21, 1 (2014), 54--57.  ",
      "doi": "10.1145/2543580"
    },
    {
      "text": "Jill Palzkill Woelfer and David G Hendry. 2010. Homeless young people's experiences with information systems: Life and work in a community technology center. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2010). ACM, 1291--1300.  ",
      "doi": "10.1145/1753326.1753520"
    },
    {
      "text": "Jill Palzkill Woelfer and David G Hendry. 2011. Designing ubiquitous information systems for a community of homeless young people: Precaution and a way forward. Personal and Ubiquitous Computing 15, 6 (2011), 565--573.  ",
      "doi": "10.1007/s00779-010-0341-5"
    },
    {
      "text": "Jill Palzkill Woelfer and David G Hendry. 2012. Homeless young people on social network sites. In Proceedings of the 2012 CHI Conference on Human Factors in Computing Systems. ACM, 2825--2834.  ",
      "doi": "10.1145/2207676.2208686"
    },
    {
      "text": "Jill Palzkill Woelfer, Amy Iverson, David G Hendry, Batya Friedman, and Brian T Gill. 2011. Improving the safety of homeless young people with mobile phones: Values, form and function. In Proceedings of the 2011 CHI Conference on Human Factors in Computing Systems. ACM, 1707--1716.  ",
      "doi": "10.1145/1978942.1979191"
    },
    {
      "text": "Sarita Yardi and Amy Bruckman. 2012. Income, race, and class: Exploring socioeconomic differences in family technology use. In Proceedings of the 2012 CHI Conference on Human Factors in Computing Systems. ACM, 3041--3050.  ",
      "doi": "10.1145/2207676.2208716"
    }
  ]
}