{
  "doi": "10.1145/3290605.3300591",
  "title": "Understanding the Social Acceptability of Mobile Devices using the Stereotype Content Model",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Understanding social perception is important for designing mobile devices that are socially acceptable. Previous work not only investigated the social acceptability of mobile devices and interaction techniques but also provided tools to measure social acceptance. However, we lack a robust model that explains the underlying factors that make devices socially acceptable. In this paper, we consider mobile devices as social objects and investigate if the stereotype content model (SCM) can be applied to those devices. Through a study that assesses combinations of mobile devices and group stereotypes, we show that mobile devices have a systematic effect on the stereotypes' warmth and competence. Supported by a second study, which combined mobile devices without a specific stereotypical user, our result suggests that mobile devices are perceived stereotypically by themselves. Our combined results highlight mobile devices as social objects and the importance of considering stereotypes when assessing social acceptance of mobile devices.",
  "tags": [
    "mobile devices",
    "social objects",
    "social acceptance",
    "stereotype content model",
    "stereotypes"
  ],
  "authors": [
    {
      "name": "Valentin Schwind",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-99658638249/rel-imgonly/foto-256x256.jpg",
      "acmid": "99658638249",
      "orcid": "0000-0002-5072-8775"
    },
    {
      "name": "Niklas Deierlein",
      "institution": "University of Hagen, Hagen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366875",
      "orcid": "missing"
    },
    {
      "name": "Romina Poguntke",
      "institution": "VIS, University of Stuttgart, Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261914",
      "orcid": "missing"
    },
    {
      "name": "Niels Henze",
      "institution": "University of Regensburg, Regensburg, Germany",
      "img": "/do/10.1145/contrib-81350574049/rel-imgonly/nielshenze.jpg",
      "acmid": "81350574049",
      "orcid": "0000-0002-5702-6290"
    }
  ],
  "references": [
    {
      "text": "Gordon Willard Allport, Kenneth Clark, and Thomas Pettigrew. 1954. The Nature of Prejudice. (1954).",
      "doi": ""
    },
    {
      "text": "Reem Alnanih, Olga Ormandjieva, and T. Radhakrishnan. 2013. Context-based User Stereotype Model for Mobile User Interfaces in Health Care Applications. Procedia Computer Science 19 (2013), 1020 -- 1027. The 4th International Conference on Ambient Systems, Networks and Technologies (ANT 2013), the 3rd International Conference on Sustainable Energy Information Technology (SEIT-2013).",
      "doi": ""
    },
    {
      "text": "Paolo Antonetti and Stan Maklan. 2016. Hippies, greenies, and tree huggers: How the \"warmth\" stereotype hinders the adoption of responsible brands. Psychology & Marketing 33, 10 (2016), 796--813.",
      "doi": ""
    },
    {
      "text": "Michael Chattalas. 2015. National stereotype effects on consumer expectations and purchase likelihood: competent versus warm countries of origin. Journal of Business and Retail Management Research 10, 1 (2015).",
      "doi": ""
    },
    {
      "text": "Amy JC Cuddy and Susan T Fiske. 2002. Doddering but dear: Process, content, and function in stereotyping of older persons. Ageism: Stereotyping and prejudice against older persons 3 (2002), 26.",
      "doi": ""
    },
    {
      "text": "Amy JC Cuddy, Susan T Fiske, and Peter Glick. 2007. The BIAS map: behaviors from intergroup affect and stereotypes. Journal of personality and social psychology 92, 4 (2007), 631.",
      "doi": ""
    },
    {
      "text": "Amy JC Cuddy, Susan T Fiske, Virginia SY Kwan, Peter Glick, Stephanie Demoulin, Jacques-Philippe Leyens, Michael Harris Bond, Jean-Claude Croizet, Naomi Ellemers, Ed Sleebos, et al. 2009. Stereotype content model across cultures: Towards universal similarities and some differences. British Journal of Social Psychology 48, 1 (2009), 1--33.",
      "doi": ""
    },
    {
      "text": "Bella M. DePaulo and Wendy L. Morris. 2006. The Unrecognized Stereotyping and Discrimination Against Singles. Current Directions in Psychological Science 15, 5 (oct 2006), 251--254.",
      "doi": ""
    },
    {
      "text": "Thomas Eckes. 2002. Paternalistic and envious gender stereotypes: Testing predictions from the stereotype content model. Sex Roles 47, 3--4 (2002), 99--114.",
      "doi": ""
    },
    {
      "text": "Susan T Fiske, Amy J C Cuddy, Peter Glick, and Jun Xu. 2002. A model of (often mixed) stereotype content: competence and warmth respectively follow from perceived status and competition. Journal of personality and social psychology 82, 6 (jun 2002), 878--902. http: //www.ncbi.nlm.nih.gov/pubmed/12051578",
      "doi": ""
    },
    {
      "text": "Ingbert R. Floyd, M. Cameron Jones, and Michael B. Twidale. 2008. RESOLVING INCOMMENSURABLE DEBATES: A PRELIMINARY IDENTIFICATION OF PERSONA KINDS, ATTRIBUTES, AND CHARACTERISTICS. Artifact 2, 1 (2008), 12--26. arXiv:https://doi.org/10.1080/17493460802276836",
      "doi": ""
    },
    {
      "text": "Jonna Häkkilä, Farnaz Vahabpour, Ashley Colley, Jani Väyrynen, and Timo Koskela. 2015. Design Probes Study on User Perceptions of a Smart Glasses Concept. In Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia (MUM '15). ACM, New York, NY, USA, 223--233.  ",
      "doi": "10.1145/2836041.2836064"
    },
    {
      "text": "Yi-Ta Hsieh, Antti Jylhä, Valeria Orso, Luciano Gamberini, and Giulio Jacucci. 2016. Designing a Willing-to-Use-in-Public Hand Gestural Interaction Technique for Smart Glasses. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4203--4215.  ",
      "doi": "10.1145/2858036.2858436"
    },
    {
      "text": "Bjoern S Ivens, Alexander Leischnig, Brigitte Muller, and Katharina Valta. 2015. On the role of brand stereotypes in shaping consumer response toward brands: An empirical examination of direct and mediating effects of warmth and competence. Psychology & Marketing 32, 8 (2015), 808--820.",
      "doi": ""
    },
    {
      "text": "D. Katz and K. Braly. 1933. Racial Stereotypes of One Hundred College Students. The Journal of Abnormal and Social Psychology 28, 3 (1933), 280--290.",
      "doi": ""
    },
    {
      "text": "Aaron C. Kay, Martin V. Day, Mark P. Zanna, and A. David Nussbaum. 2013. The insidious (and ironic) effects of positive stereotypes. Journal of Experimental Social Psychology 49, 2 (2013), 287 -- 291.",
      "doi": ""
    },
    {
      "text": "Norene Kelly and Stephen Gilbert. 2016. The WEAR Scale: Developing a Measure of the Social Acceptability of a Wearable Device. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 2864--2871.  ",
      "doi": "10.1145/2851581.2892331"
    },
    {
      "text": "Nicolas Kervyn, Susan T. Fiske, and Chris Malone. 2012. Brands as intentional agents framework: How perceived intentions and ability can map brand perception. Journal of Consumer Psychology 22, 2 (2012), 166--176. arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1016/j.jcps.2011.09.006",
      "doi": ""
    },
    {
      "text": "Marion Koelle, Susanne Boll, Thomas Olsson, Julie Williamson, Halley Profita, Shaun Kane, and Robb Mitchell. 2018. (Un)Acceptable!?!: Re-thinking the Social Acceptability of Emerging Technologies. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article W03, 8 pages.  ",
      "doi": "10.1145/3170427.3170620"
    },
    {
      "text": "Marion Koelle, Matthias Kranz, and Andreas Möller. 2015. Don'T Look at Me That Way!: Understanding User Attitudes Towards Data Glasses Usage. In Proceedings of the 17th International Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 362--372.  ",
      "doi": "10.1145/2785830.2785842"
    },
    {
      "text": "Monica H Lin, Virginia SY Kwan, Anna Cheung, and Susan T Fiske. 2005. Stereotype content model explains prejudice for an envied outgroup: Scale of anti-Asian American stereotypes. Personality and Social Psychology Bulletin 31, 1 (2005), 34--47.",
      "doi": ""
    },
    {
      "text": "Andrés Lucero and Akos Vetek. 2014. NotifEye: Using Interactive Glasses to Deal with Notifications While Walking in Public. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology (ACE '14). ACM, New York, NY, USA, Article 17, 10 pages.  ",
      "doi": "10.1145/2663806.2663824"
    },
    {
      "text": "Nicola Marsden and Maren Haag. 2016. Stereotypes and Politics: Reflections on Personas. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4017--4031.  ",
      "doi": "10.1145/2858036.2858151"
    },
    {
      "text": "Gerard McAtamney and Caroline Parker. 2006. An Examination of the Effects of a Wearable Display on Informal Face-to-face Communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 45--54.  ",
      "doi": "10.1145/1124772.1124780"
    },
    {
      "text": "Calkin S. Montero, Jason Alexander, Mark T. Marshall, and Sriram Subramanian. 2010. Would You Do That?: Understanding Social Acceptance of Gestural Interfaces. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10). ACM, New York, NY, USA, 275--278.  ",
      "doi": "10.1145/1851600.1851647"
    },
    {
      "text": "Eyal Ofek, Shamsi T. Iqbal, and Karin Strauss. 2013. Reducing Disruption from Subtle Information Delivery During a Conversation: Mode and Bandwidth Investigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3111--3120.  ",
      "doi": "10.1145/2470654.2466425"
    },
    {
      "text": "D. Pohl and C. F. de Tejada Quemada. 2016. See what I see: Concepts to improve the social acceptance of HMDs. In 2016 IEEE Virtual Reality (VR). 267--268. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk V. Schwind et al.",
      "doi": ""
    },
    {
      "text": "Edwin Poppe and Hub Linssen. 1999. In-group favouritism and the reflection of realistic dimensions of difference between national states in Central and Eastern European nationality stereotypes. British Journal of Social Psychology 38, 1 (mar 1999), 85--102.",
      "doi": ""
    },
    {
      "text": "Halley Profita, Reem Albaghli, Leah Findlater, Paul Jaeger, and Shaun K. Kane. 2016. The AT Effect: How Disability Affects the Perceived Social Acceptability of Head-Mounted Display Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4884--4895.  ",
      "doi": "10.1145/2858036.2858130"
    },
    {
      "text": "Halley Pont Profita. 2017. Designing Wearable Assistive Computing Devices to Support Social Acceptability and Personal Expression. Ph.D. Dissertation. University of Colorado Boulder.",
      "doi": ""
    },
    {
      "text": "J. Pruitt and T. Adlin. 2010. The Persona Lifecycle: Keeping People in Mind Throughout Product Design. Elsevier Science. https://books. google.de/books?id=Ct7kU5kO_T8C ",
      "doi": "10.5555/1076976"
    },
    {
      "text": "Michael W. Raphael. 2017. Cognitive Sociology. Oxford Bibliographies Online in Sociology (2017).",
      "doi": ""
    },
    {
      "text": "Julie Rico and Stephen Brewster. 2010. Gesture and Voice Prototyping for Early Evaluations of Social Acceptability in Multimodal Interfaces. In International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction (ICMI-MLMI '10). ACM, New York, NY, USA, Article 16, 9 pages.  ",
      "doi": "10.1145/1891903.1891925"
    },
    {
      "text": "Julie Rico and Stephen Brewster. 2010. Usable Gestures for Mobile Interfaces: Evaluating Social Acceptability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 887--896.  ",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "Valentin Schwind, Jens Reinhardt, Rufat Rzayev, Niels Henze, and Katrin Wolf. 2018. On the Need for Standardized Methods to Study the Social Acceptability of Emerging Technologies. In CHI'18 Workshop on (Un)Acceptable!?! Re-thinking the Social Acceptability of Emerging Technologies (CHI'18 Workshops). 6.",
      "doi": ""
    },
    {
      "text": "Valentin Schwind, Jens Reinhardt, Rufat Rzayev, Niels Henze, and Katrin Wolf. 2018. Virtual Reality on the Go? A Study on Social Acceptance of VR Glasses. (2018).  ",
      "doi": "10.1145/3236112.3236127"
    },
    {
      "text": "Eliot R Smith. 2007. Multiply categorizable social objects: representational models and some potential determinants of category use. In Multiple Social Categorization. Psychology Press, 66--78.",
      "doi": ""
    },
    {
      "text": "Phil Turner and Susan Turner. 2011. Is stereotyping inevitable when designing with personas? Design Studies 32, 1 (jan 2011), 30--44.",
      "doi": ""
    },
    {
      "text": "Katherine White and Darren W. Dahl. 2006. To Be or Not Be? The Influence of Dissociative Reference Groups on Consumer Preferences. Journal of Consumer Psychology 16, 4 (2006), 404 -- 414.",
      "doi": ""
    },
    {
      "text": "Julie Rico Williamson. 2011. Send Me Bubbles: Multimodal Performance and Social Acceptability. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 899--904.  ",
      "doi": "10.1145/1979742.1979513"
    },
    {
      "text": "Katrin Wolf, Albrecht Schmidt, Agon Bexheti, and Marc Langheinrich. 2014. Lifelogging: You're wearing a camera? IEEE Pervasive Computing 13, 3 (2014), 8--12.",
      "doi": ""
    },
    {
      "text": "Qianli Xu, Michal Mukawa, Liyuan Li, Joo Hwee Lim, Cheston Tan, Shue Ching Chia, Tian Gan, and Bappaditya Mandal. 2015. Exploring Users' Attitudes Towards Social Interaction Assistance on Google Glass. In Proceedings of the 6th Augmented Human International Conference (AH '15). ACM, New York, NY, USA, 9--12.  ",
      "doi": "10.1145/2735711.2735831"
    }
  ]
}