{
  "doi": "10.1145/3290605.3300364",
  "title": "Methodological Gaps in Predicting Mental Health States from Social Media: Triangulating Diagnostic Signals",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2019,
  "badges": [],
  "abstract": "A growing body of research is combining social media data with machine learning to predict mental health states of individuals. An implication of this research lies in informing evidence-based diagnosis and treatment. However, obtaining clinically valid diagnostic information from sensitive patient populations is challenging. Consequently, researchers have operationalized characteristic online behaviors as \"proxy diagnostic signals\" for building these models. This paper posits a challenge in using these diagnostic signals, purported to support clinical decision-making. Focusing on three commonly used proxy diagnostic signals derived from social media, we find that predictive models built on these data, although offer strong internal validity, suffer from poor external validity when tested on mental health patients. A deeper dive reveals issues of population and sampling bias, as well as of uncertainty in construct validity inherent in these proxies. We discuss the methodological and clinical implications of these gaps and provide remedial guidelines for future research.",
  "authors": [
    {
      "name": "Sindhu Kiranmai Ernala",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659005332",
      "orcid": "missing"
    },
    {
      "name": "Michael L. Birnbaum",
      "institution": "Zucker Hillside Hospital, Glen Oaks, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659190241",
      "orcid": "missing"
    },
    {
      "name": "Kristin A. Candan",
      "institution": "Zucker Hillside Hospital, Glen Oaks, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366643",
      "orcid": "missing"
    },
    {
      "name": "Asra F. Rizvi",
      "institution": "Zucker Hillside Hospital, Glen Oaks, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659231460",
      "orcid": "missing"
    },
    {
      "name": "William A. Sterling",
      "institution": "Zucker Hillside Hospital, Glen Oaks, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365894",
      "orcid": "missing"
    },
    {
      "name": "John M. Kane",
      "institution": "Zucker Hillside Hospital, Glen Oaks, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659071797",
      "orcid": "missing"
    },
    {
      "name": "Munmun De Choudhury",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343491309",
      "orcid": "0000-0002-8939-264X"
    }
  ],
  "references": [
    {
      "text": "Carlos Rejón Altable. 2012. Logic structure of clinical judgment and its relation to medical and psychiatric semiology. Psychopathology 45, 6 (2012), 344--351.",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3906--3918.  ",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Nazanin Andalibi, Pinar Öztürk, and Andrea Forte. 2017. Sensitive Self-disclosures, Responses, and Social Support on Instagram: The Case of# Depression.. In CSCW. 1485--1500.  ",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "American Psychiatric Association. 2013. Diagnostic and statistical manual of mental disorders, (DSM-5). American Psychiatric Pub.",
      "doi": ""
    },
    {
      "text": "Mitja D Back, Juliane M Stopfer, Simine Vazire, Sam Gaddis, Stefan C Schmukle, Boris Egloff, and Samuel D Gosling. 2010. Facebook profiles reflect actual personality, not self-idealization. Psychological science (2010).",
      "doi": ""
    },
    {
      "text": "Timothy Baldwin, Paul Cook, Marco Lui, Andrew MacKinlay, and Li Wang. 2013. How noisy social media text, how diffrnt social media sources?. In Proceedings of the Sixth International Joint Conference on Natural Language Processing. 356--364.",
      "doi": ""
    },
    {
      "text": "Gregory Bateson, Don D Jackson, Jay Haley, and John Weakland. 1956. Toward a theory of schizophrenia. Behavioral science 1, 4 (1956), 251--264.",
      "doi": ""
    },
    {
      "text": "Adrian Benton, Margaret Mitchell, and Dirk Hovy. 2017. Multi-task learning for mental health using social media text. arXiv preprint arXiv:1712.03538 (2017).",
      "doi": ""
    },
    {
      "text": "Dinesh Bhugra. 2005. The global prevalence of schizophrenia. PLoS medicine 2, 5 (2005), e151.",
      "doi": ""
    },
    {
      "text": "Michael L. Birnbaum, Sindhu Kiranmai Ernala, Asra Rizvi, Munmun De Choudhury, and John Kane. 2017. A Clinician-Machine Collaborative Approach to Identifying Social Media Markers of Schizophrenia. Journal of medical Internet research (2017). To appear.",
      "doi": ""
    },
    {
      "text": "Michael L. Birnbaum, Sindhu Kiranmai Ernala, Asra F Rizvi, Munmun De Choudhury, and John M Kane. 2017. A Collaborative Approach to Identifying Social Media Markers of Schizophrenia by Employing Machine Learning and Clinical Appraisals. Journal of Medical Internet Research 19, 8 (2017).",
      "doi": ""
    },
    {
      "text": "Michael L. Birnbaum, Asra F. Rizvi, Christoph U. Correll, John M. Kane, and Jamie Confino. 2017. Role of social media and the I nternet in pathways to care for adolescents and young adults with psychotic disorders and non-psychotic mood disorders. Early intervention in psychiatry 11, 4 (2017), 290--295.",
      "doi": ""
    },
    {
      "text": "danah boyd and Kate Crawford. 2012. Critical questions for big data: Provocations for a cultural, technological, and scholarly phenomenon. Information, communication & society 15, 5 (2012), 662--679.",
      "doi": ""
    },
    {
      "text": "Scott R. Braithwaite, Christophe Giraud-Carrier, Josh West, Michael D. Barnes, and Carl Lee Hanson. 2016. Validating Machine Learning Algorithms for Twitter Data Against Established Measures of Suicidality. JMIR mental health 3, 2 (2016), e21.",
      "doi": ""
    },
    {
      "text": "Pete Burnap, Walter Colombo, and Jonathan Scourfield. 2015. Machine classification and analysis of suicide-related communication on twitter. In Proceedings of the 26th ACM Conference on Hypertext & Social Media. ACM, 75--84.  ",
      "doi": "10.1145/2700171.2791023"
    },
    {
      "text": "Nicolo Cesa-Bianchi and Gábor Lugosi. 2006. Prediction, learning, and games. Cambridge university press. ",
      "doi": "10.5555/1137817"
    },
    {
      "text": "Stevie Chancellor, Yannis Kalantidis, Jessica A Pater, Munmun De Choudhury, and David A Shamma. 2017. Multimodal Classification of Moderated Online Pro-Eating Disorder Content. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3213--3226.  ",
      "doi": "10.1145/3025453.3025985"
    },
    {
      "text": "Stevie Chancellor, Zhiyuan Lin, Erica L. Goodman, Stephanie Zerwas, and Munmun De Choudhury. 2016. Quantifying and Predicting Mental Illness Severity in Online Pro-Eating Disorder Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1171--1184.  ",
      "doi": "10.1145/2818048.2819973"
    },
    {
      "text": "Stevie Chancellor, Tanushree Mitra, and Munmun De Choudhury. 2016. Recovery amid pro-anorexia: Analysis of recovery in social media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2111--2123.  ",
      "doi": "10.1145/2858036.2858246"
    },
    {
      "text": "Cindy Chung and James W Pennebaker. 2007. The psychological functions of function words. Social communication (2007), 343--359.",
      "doi": ""
    },
    {
      "text": "Glen Coppersmith, Mark Dredze, and Craig Harman. 2014. Quantifying mental health signals in twitter. In ACL Workshop on Computational Linguistics and Clinical Psychology.",
      "doi": ""
    },
    {
      "text": "Glen Coppersmith, Mark Dredze, Craig Harman, and Kristy Hollingshead. 2015. From ADHD to SAD: Analyzing the language of mental health on Twitter through self-reported diagnoses. In Proceedings of the 2nd Workshop on Computational Linguistics and Clinical Psychology: From Linguistic Signal to Clinical Reality. 1--10.",
      "doi": ""
    },
    {
      "text": "Glen Coppersmith, Craig Harman, and Mark Dredze. 2014. Measuring post traumatic stress disorder in Twitter. In International Conference on Weblogs and Social Media (ICWSM).",
      "doi": ""
    },
    {
      "text": "Glen Coppersmith, Ryan Leary, Patrick Crutchley, and Alex Fine. 2018. Natural language processing of social media as screening for suicide risk. Biomedical informatics insights 10 (2018), 1178222618792860.",
      "doi": ""
    },
    {
      "text": "Glen Coppersmith, Ryan Leary, Eric Whyne, and Tony Wood. 2015. Quantifying suicidal ideation via language usage on social media. In JointStatisticsMeetingsProceedings,StatisticalComputingSection,JSM.",
      "doi": ""
    },
    {
      "text": "Patrick Corrigan. 2004. How stigma interferes with mental health care. American psychologist 59, 7 (2004), 614.",
      "doi": ""
    },
    {
      "text": "Ashlynn R Daughton, Michael J Paul, and Rumi Chunara. 2018. What Do People Tweet When They're Sick? A Preliminary Comparison of Symptom Reports and Twitter Timelines. (2018).",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013. Social media as a measurement tool of depression in populations. In Proceedings of the 5th Annual ACM Web Science Conference. ACM, 47--56.  ",
      "doi": "10.1145/2464464.2464480"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric Horvitz, and Aaron Hoff. 2014. Characterizing and Predicting Postpartum Depression from Facebook Data. In Proceedings of the ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM.  ",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, Eric J Horvitz, and Aaron Hoff. 2014. Characterizing and predicting postpartum depression from shared facebook data. In Proceedings of the 17th ACM conferenceon Computer supported cooperative work & social computing. ACM, 626--638.  ",
      "doi": "10.1145/2531602.2531675"
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting depression via social media. ICWSM 13 (2013), 1--10.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, Aaron Hoff, and Asta Roseway. 2013. \"Moon Phrases\": A Social Media Faciliated Tool for Emotional Reflection and Wellness. In Proceedings of the 7th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth'13). 41--44.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252106"
    },
    {
      "text": "Munmun De Choudhury and Emre Kiciman. 2017. The Language of Social Support in Social Media and Its Effect on Suicidal Ideation Risk. In ICWSM. 32--41.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering shifts to suicidal ideation from mental health content in social media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2098--2110.  ",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Norman K. Denzin. 2012. Triangulation 2.0. Journal of mixed methods research 6, 2 (2012), 80--88.",
      "doi": ""
    },
    {
      "text": "Richard O. Duda, Peter E. Hart, and David G. Stork. 2012. Pattern classification. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Ezekiel J Emanuel, David Wendler, and Christine Grady. 2000. What makes clinical research ethical? Jama 283, 20 (2000), 2701--2711.",
      "doi": ""
    },
    {
      "text": "T. Emmens and A. Phippen. 2010. Evaluating Online Safety Programs. Harvard Berkman Center for Internet and Society.{23 July 2011} (2010).",
      "doi": ""
    },
    {
      "text": "Sindhu Kiranmai. Ernala, Asra F. Rizvi, Michael L. Birnbaum, John M. Kane, and Munmun De Choudhury. 2017. Linguistic Markers Indicating Therapeutic Outcomes of Social Media Disclosures of Schizophrenia. Proceedings of the ACM Human Computer Interaction (PACM) (2017).  ",
      "doi": "10.1145/3134678"
    },
    {
      "text": "Carl E Fisher and Paul S Appelbaum. 2017. Beyond Googling: The Ethics of Using Patients' Electronic Footprints in Psychiatric Practice. Harvard Review of Psychiatry (2017).",
      "doi": ""
    },
    {
      "text": "George Gkotsis, Anika Oellrich, Sumithra Velupillai, Maria Liakata, Tim JP Hubbard, Richard JB Dobson, and Rina Dutta. 2017. Characterisation of mental health conditions in social media using Informed Deep Learning. Scientific reports 7 (2017), 45141.",
      "doi": ""
    },
    {
      "text": "Scott A. Golder and Michael W. Macy. 2011. Diurnal and seasonal mood vary with work, sleep, and daylength across diverse cultures. Science 333, 6051 (2011), 1878--1881.",
      "doi": ""
    },
    {
      "text": "Isabelle Guyon and André Elisseeff. 2003. An introduction to variable and feature selection. Journal of machine learning research 3, Mar (2003), 1157--1182. ",
      "doi": "10.5555/944919.944968"
    },
    {
      "text": "Douglas D. Heckathorn. 1997. Respondent-driven sampling: a new approach to the study of hidden populations. Social problems 44, 2 (1997), 174--199.",
      "doi": ""
    },
    {
      "text": "Eric H. Huang, Richard Socher, Christopher D. Manning, and Andrew Y. Ng. 2012. Improving word representations via global context and multiple word prototypes. In Proceedings of the 50th Annual Meeting of the Association for Computational Linguistics: Long Papers-Volume 1. Association for Computational Linguistics, 873--882. ",
      "doi": "10.5555/2390524.2390645"
    },
    {
      "text": "Xiaolei Huang, Xin Li, Tianli Liu, David Chiu, Tingshao Zhu, and Lei Zhang. 2015. Topic model for identifying suicidal ideation in chinese microblog. In Proceedings of the 29th Pacific Asia Conference on Language, Information and Computation. 553--562.",
      "doi": ""
    },
    {
      "text": "Xiaolei Huang, Lei Zhang, David Chiu, Tianli Liu, Xin Li, and Tingshao Zhu. 2014. Detecting suicidal ideation in Chinese microblogs with psychological lexicons. In Ubiquitous Intelligence and Computing, 2014 IEEE 11th Intl Conf on and IEEE 11th Intl Conf on and Autonomic and Trusted Computing, and IEEE 14th Intl Conf on Scalable Computing and Communications and Its Associated Workshops (UTC-ATC-ScalCom). IEEE, 844--849.  ",
      "doi": "10.1109/UIC-ATC-ScalCom.2014.48"
    },
    {
      "text": "Becky Inkster, David Stillwell, Michal Kosinski, and Peter Jones. 2016. A decade into Facebook: where is psychiatry in the digital age? The Lancet Psychiatry 3, 11 (2016), 1087--1090.",
      "doi": ""
    },
    {
      "text": "Thomas Insel, Bruce Cuthbert, Marjorie Garvey, Robert Heinssen, Daniel S. Pine, Kevin Quinn, Charles Sanislow, and Philip Wang. 2010. Research domain criteria (RDoC): toward a new classification framework for research on mental disorders.",
      "doi": ""
    },
    {
      "text": "Zunaira Jamil. 2017. Monitoring Tweets for Depression to Detect At-risk Users. Ph.D. Dissertation. Université d'Ottawa/University of Ottawa.",
      "doi": ""
    },
    {
      "text": "Rob Kitchin. 2014. Big Data, new epistemologies and paradigm shifts. Big Data & Society 1, 1 (2014), 2053951714528481.",
      "doi": ""
    },
    {
      "text": "Michal Kosinski, Sandra C Matz, Samuel D Gosling, Vesselin Popov, and David Stillwell. 2015. Facebook as a research tool for the social sciences: Opportunities, challenges, ethical considerations, and practical guidelines. American Psychologist 70, 6 (2015), 543.",
      "doi": ""
    },
    {
      "text": "Michal Kosinski, David Stillwell, and Thore Graepel. 2013. Private traits and attributes are predictable from digital records of human behavior. Proceedings of the National Academy of Sciences 110, 15 (2013), 5802--5805.",
      "doi": ""
    },
    {
      "text": "Himabindu Lakkaraju, Ece Kamar, Rich Caruana, and Eric Horvitz. 2017. Identifying Unknown Unknowns in the Open World: Representations and Policies for Guided Exploration. In AAAI, Vol. 1. 2. ",
      "doi": "10.5555/3298483.3298546"
    },
    {
      "text": "David Lazer, Ryan Kennedy, Gary King, and Alessandro Vespignani. 2014. The parable of Google Flu: traps in big data analysis. Science 343, 6176 (2014), 1203--1205.",
      "doi": ""
    },
    {
      "text": "David Lazer, Alex Sandy Pentland, Lada Adamic, Sinan Aral, Albert Laszlo Barabasi, Devon Brewer, Nicholas Christakis, Noshir Contractor, James Fowler, Myron Gutmann, et al. 2009. Life in the network: the coming age of computational social science. Science (New York, NY) 323, 5915 (2009), 721.",
      "doi": ""
    },
    {
      "text": "Anthony F. Lehman, Jeffrey A. Lieberman, Lisa B. Dixon, Thomas H McGlashan, Alexander L Miller, Diana O Perkins, Julie Kreyenbuhl, John S McIntyre, Sara C Charles, Kenneth Altshuler, et al. 2004. Practice guideline for the treatment of partients with schizophrenia. American Journal of psychiatry 161, 2 SUPPL. (2004).",
      "doi": ""
    },
    {
      "text": "Alessandro Liberati, Douglas G. Altman, Jennifer Tetzlaff, Cynthia Mulrow, Peter C. Gøtzsche, John PA Ioannidis, Mike Clarke, Pl J Devereaux, Jos Kleijnen, and David Moher. 2009. The PRISMA statement for reporting systematic reviews and meta-analyses of studies that evaluate health care interventions: explanation and elaboration. PLoS medicine 6, 7 (2009), e1000100.",
      "doi": ""
    },
    {
      "text": "Huijie Lin, Jia Jia, Quan Guo, Yuanyuan Xue, Qi Li, Jie Huang, Lianhong Cai, and Ling Feng. 2014. User-level psychological stress detection from social media using deep neural network. In Proceedings of the 22nd ACM international conference on Multimedia. ACM, 507--516.  ",
      "doi": "10.1145/2647868.2654945"
    },
    {
      "text": "Huijie Lin, Jia Jia, Liqiang Nie, Guangyao Shen, and Tat-Seng Chua. {n. d.}. What Does Social Media Say about Your Stress?.",
      "doi": ""
    },
    {
      "text": "Kate Loveys, Patrick Crutchley, Emily Wyatt, and Glen Coppersmith. 2017. Small but mighty: Affective micropatterns for quantifying mental health from social media language. In Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology-From Linguistic Signal to Clinical Reality. 85--95.",
      "doi": ""
    },
    {
      "text": "Keith A Markus and Denny Borsboom. 2013. Frontiers of test validity theory: Measurement, causation, and meaning. Routledge.",
      "doi": ""
    },
    {
      "text": "Kimberly McManus, Emily K. Mallory, Rachel L. Goldfeder, Winston A Haynes, and Jonathan D Tatum. 2015. Mining Twitter data to improve detection of schizophrenia. AMIA Summits on Translational Science Proceedings 2015 (2015), 122.",
      "doi": ""
    },
    {
      "text": "Tomas Mikolov, Kai Chen, Greg Corrado, and Jeffrey Dean. 2013. Efficient estimation of word representations in vector space. arXiv preprint arXiv:1301.3781 (2013).",
      "doi": ""
    },
    {
      "text": "Margaret Mitchell, Kristy Hollingshead, and Glen Coppersmith. 2015. Quantifying the language of schizophrenia in social media. NAACL HLT 2015 (2015), 11.",
      "doi": ""
    },
    {
      "text": "David C. Mohr, Mi Zhang, and Stephen Schueller. 2017. Personal sensing: Understanding mental health using ubiquitous sensors and machine learning. Annual Review of Clinical Psychology 13, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Roberta B. Ness, Joint Policy Committee, et al. 2007. Influence of the HIPAAprivacyruleonhealthresearch. Jama298,18(2007),2164--2170.",
      "doi": ""
    },
    {
      "text": "Thin Nguyen, Dinh Phung, Bo Dao, Svetha Venkatesh, and Michael Berk.2014. Affective and content analysis of online depression communities. IEEE Transactions on Affective Computing 5, 3 (2014), 217--226.",
      "doi": ""
    },
    {
      "text": "Bridianne O'Dea, Stephen Wan, Philip J Batterham, Alison L. Calear, Cecile Paris, and Helen Christensen. 2015. Detecting suicidality on Twitter. Internet Interventions 2, 2 (2015), 183--188.",
      "doi": ""
    },
    {
      "text": "Alexandra Olteanu, Carlos Castillo, Fernando Diaz, and Emre Kiciman. 2016. Social data: Biases, methodological pitfalls, and ethical boundaries. (2016).",
      "doi": ""
    },
    {
      "text": "Minsu Park,David W McDonald, and Meeyoung Cha.2013. Perception Differences between the Depressed and Non-depressed Users in Twitter. In Proceedings of ICWSM.",
      "doi": ""
    },
    {
      "text": "Sungkyu Park, Sang Won Lee, Jinah Kwak, Meeyoung Cha, and Bumseok Jeong. 2013. Activities on Facebook reveal the depressive state of users. Journal of medical Internet research 15, 10 (2013).",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 1999. Enhancing the quality and credibility of qualitative analysis. Health services research 34, 5 Pt 2 (1999), 1189.",
      "doi": ""
    },
    {
      "text": "James W Pennebaker, Matthias R Mehl, and Kate G Niederhoffer. 2003. Psychological aspects of natural language use: Our words, our selves. Annual review of psychology 54, 1 (2003), 547--577.",
      "doi": ""
    },
    {
      "text": "Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). 1532--1543.",
      "doi": ""
    },
    {
      "text": "Víctor M Prieto, Sergio Matos, Manuel Alvarez, Fidel Cacheda, and José Luís Oliveira. 2014. Twitter: a good place to detect health conditions. PloS one 9, 1 (2014), e86191.",
      "doi": ""
    },
    {
      "text": "Fredrick C. Redlich and Daniel X. Freedman. 1966. The theory and practice of psychiatry. (1966).",
      "doi": ""
    },
    {
      "text": "Andrew G. Reece and Christopher M. Danforth. 2017. Instagram photos revealpredictivemarkersofdepression. EPJDataScience 6,1(2017),15.",
      "doi": ""
    },
    {
      "text": "Andrew G Reece, Andrew J Reagan, Katharina LM Lix, Peter Sheridan Dodds, Christopher M Danforth, and Ellen J Langer. 2017. Forecasting the onset and course of mental illness with Twitter data. Scientific reports 7, 1 (2017), 13006.",
      "doi": ""
    },
    {
      "text": "Philip Resnik, William Armstrong Leonardo Claudino, Thang Nguyen, Viet-An Nguyen, and Jordan Boyd-Graber. 2015. Beyond LDA: exploring supervised topic modeling for depression-related language in Twitter. In Proceedings of the 2nd Workshop on Computational Linguistics and Clinical Psychology: From Linguistic Signal to Clinical Reality. 99--107.",
      "doi": ""
    },
    {
      "text": "Philip Resnik, Anderson Garron, and Rebecca Resnik. 2013. Using topic modeling to improve prediction of neuroticism and depression in college students. In Proceedings of the 2013 conference on empirical methods in natural language processing. 1348--1353.",
      "doi": ""
    },
    {
      "text": "Paul R Rosenbaum and Donald B Rubin. 1985. Constructing a control group using multivariate matched sampling methods that incorporate the propensity score. The American Statistician 39, 1 (1985), 33--38.",
      "doi": ""
    },
    {
      "text": "Donald B Rubin. 1986. Statistical matching using file concatenation with adjusted weights and multiple imputations. Journal of Business & Economic Statistics 4, 1 (1986), 87--94.",
      "doi": ""
    },
    {
      "text": "Koustuv Saha, Larry Chan, Kaya De Barbaro, Gregory D. Abowd, and Munmun De Choudhury. 2017. Inferring mood instability on social media by leveraging ecological momentary assessments. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 95.  ",
      "doi": "10.1145/3130960"
    },
    {
      "text": "Koustuv Saha and Munmun De Choudhury. 2017. Modeling stress with social media around incidents of gun violence on college campuses. Proc. ACM Hum.-Comput. Interact.(CSCW) 92 (2017), 1--92.  ",
      "doi": "10.1145/3134727"
    },
    {
      "text": "Koustuv Saha, Ingmar Weber, Michael L. Birnbaum, and Munmun De Choudhury. 2017. Characterizing Awareness of Schizophrenia Among Facebook Users by Leveraging Facebook Advertisement Estimates. Journal of medical Internet research 19, 5 (2017).",
      "doi": ""
    },
    {
      "text": "Koustuv Saha, Ingmar Weber, and Munmun De Choudhury. 2018. A Social Media Based Examination of the Effects of Counseling RecommendationsAfterStudentDeathsonCollegeCampuses. (2018).",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, Kenton P. O'Hara, and Alex S. Taylor. 2018. Let's Talk About Race: Identity, Chatbots, and AI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 315.  ",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "Douglas Schuler and Aki Namioka. 1993. Participatory design: Principles and practices. CRC Press. ",
      "doi": "10.5555/563076"
    },
    {
      "text": "H Andrew Schwartz, Johannes Eichstaedt, Margaret L Kern, Gregory Park, Maarten Sap, David Stillwell, Michal Kosinski, and Lyle Ungar. 2014. Towards assessing changes in degree of depression through facebook. In Proceedings of the Workshop on Computational Linguistics and Clinical Psychology: From Linguistic Signal to Clinical Reality. 118--125.",
      "doi": ""
    },
    {
      "text": "H Andrew Schwartz, Maarten Sap, Margaret L Kern, Johannes C Eichstaedt, Adam Kapelner, Megha Agrawal, Eduardo Blanco, Lukasz Dziurzynski, Gregory Park, David Stillwell, et al. 2016. Predicting individual well-being through the language of social media. In Pac Symp Biocomput, Vol. 21. 516--527.",
      "doi": ""
    },
    {
      "text": "Eva Sharma and Munmun De Choudhury. 2018. Mental Health Support and its Relationship to Linguistic Accommodation in Online Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 641.  ",
      "doi": "10.1145/3173574.3174215"
    },
    {
      "text": "Guangyao Shen, Jia Jia, Liqiang Nie, Fuli Feng, Cunjun Zhang, Tianrui Hu, Tat-Seng Chua, and Wenwu Zhu. {n. d.}. Depression detection via harvesting social media: A multimodal dictionary learning solution.",
      "doi": ""
    },
    {
      "text": "Judy Hanwen Shen and Frank Rudzicz. 2017. Detecting anxiety through Reddit. In Proceedings of the Fourth Workshop on Computational Linguistics and Clinical Psychology-From Linguistic Signal to Clinical Reality. 58--65.",
      "doi": ""
    },
    {
      "text": "Hidetoshi Shimodaira. 2000. Improving predictive inference under covariate shift by weighting the log-likelihood function. Journal of statistical planning and inference 90, 2 (2000), 227--244.",
      "doi": ""
    },
    {
      "text": "Raphael Silberzahn, Eric Luis Uhlmann, Dan Martin, Pasquale Anselmi, Frederik Aust, Eli C. Awtrey, Stepán Bahník, Feng Bai, Colin Bannard, Evelina Bonnier, et al. 2017. Many analysts, one dataset: Making transparent how variations in analytical choices affect results. (2017).",
      "doi": ""
    },
    {
      "text": "T Simms, C. Ramstedt, M. Rich, M. Richards, T. Martinez, and C. Giraud-Carrier. 2017. Detecting cognitive distortions through machine learning text analytics. In Healthcare Informatics (ICHI), 2017 IEEE International Conference on. IEEE, 508--512.",
      "doi": ""
    },
    {
      "text": "Robert L Spitzer, Janet BW Williams, Miriam Gibbon, and Michael B First. 1992. The structured clinical interview for DSM-III-R (SCID): I: history, rationale, and description. Archives of general psychiatry 49, 8 (1992), 624--629.",
      "doi": ""
    },
    {
      "text": "Masashi Sugiyama, Neil D. Lawrence, Anton Schwaighofer, et al. 2017. Dataset shift in machine learning. The MIT Press.",
      "doi": ""
    },
    {
      "text": "John Torous, Matcheri Keshavan, and Thomas Gutheil. 2014. Promise and perils of digital psychiatry. Asian journal of psychiatry 10 (2014), 120--122.",
      "doi": ""
    },
    {
      "text": "John Torous and Camille Nebeker. 2017. Navigating ethics in the digital age: introducing Connected and Open Research Ethics (CORE), a tool for researchers and institutional review boards. Journal of medical Internet research 19, 2 (2017).",
      "doi": ""
    },
    {
      "text": "Sho Tsugawa, Yusuke Kikuchi, Fumio Kishino, Kosuke Nakajima, Yuichi Itoh, and Hiroyuki Ohsaki. 2015. Recognizing depression from twitter activity. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3187--3196.  ",
      "doi": "10.1145/2702123.2702280"
    },
    {
      "text": "Sho Tsugawa, Yukiko Mogi, Yusuke Kikuchi, Fumio Kishino, Kazuyuki Fujita, Yuichi Itoh, and Hiroyuki Ohsaki. 2013. On estimating depressive tendencies of twitter users utilizing their tweet data. In Virtual Reality (VR), 2013 IEEE. IEEE, 1--4.",
      "doi": ""
    },
    {
      "text": "Michael Veale, Max Van Kleek, and Reuben Binns. 2018. Fairness and Accountability Design Needs for Algorithmic Support in High-Stakes Public Sector Decision-Making. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 440.  ",
      "doi": "10.1145/3173574.3174014"
    },
    {
      "text": "Nikhita Vedula and Srinivasan Parthasarathy. 2017. Emotional and linguistic cues of depression from social media. In Proceedings of the 2017 International Conference on Digital Health. ACM, 127--136.  ",
      "doi": "10.1145/3079452.3079465"
    },
    {
      "text": "Tao Wang, Markus Brede, Antonella Ianni, and Emmanouil Mentzakis. 2017. Detecting and characterizing eating-disorder communities on social media. In Proceedings of the Tenth ACM International Conference on Web Search and Data Mining. ACM, 91--100.  ",
      "doi": "10.1145/3018661.3018706"
    },
    {
      "text": "Xinyu Wang, Chunhong Zhang, Yang Ji, Li Sun, Leijia Wu, and Zhana Bao. 2013. A depression detection model based on sentiment analysis in micro-blog social network. In Pacific-Asia Conference on Knowledge Discovery and Data Mining. Springer, 201--213.  ",
      "doi": "10.1007/978-3-642-40319-4_18"
    },
    {
      "text": "Andrew Yates, Arman Cohan, and Nazli Goharian. 2017. Depression and self-harm risk assessment in online forums. arXiv preprint arXiv:1709.01848 (2017).",
      "doi": ""
    },
    {
      "text": "Sean D Young and Renee Garett. 2018. Ethical Issues in Addressing Social Media Posts About Suicidal Intentions During an Online Study Among Youth: Case Study. JMIR mental health 5, 2 (2018).",
      "doi": ""
    },
    {
      "text": "Reza Zafarani and Huan Liu. 2015. Evaluation without ground truth in social media research. Commun. ACM 58, 6 (2015), 54--60.  ",
      "doi": "10.1145/2666680"
    },
    {
      "text": "Yiheng Zhou, Jingyao Zhan, and Jiebo Luo. 2017. Predicting Multiple Risky Behaviors via Multimedia Content. In Social Informatics, Giovanni Luca Ciampaglia, Afra Mashhadi, and Taha Yasseri (Eds.). Springer International Publishing, Cham, 65--73.",
      "doi": ""
    },
    {
      "text": "Mark Zimmerman and Jill I Mattia. 2001. The Psychiatric Diagnostic Screening Questionnaire: development, reliability and validity. Comprehensive psychiatry (2001).",
      "doi": ""
    }
  ]
}