{
  "doi": "10.1145/3290605.3300771",
  "title": "Saliency Deficit and Motion Outlier Detection in Animated Scatterplots",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We report the results of a crowdsourced experiment that measured the accuracy of motion outlier detection in multivariate, animated scatterplots. The targets were outliers either in speed or direction of motion, and were presented with varying levels of saliency in dimensions that are irrelevant to the task of motion outlier detection (e.g., color, size, position). We found that participants had trouble finding the outlier when it lacked irrelevant salient features and that visual channels contribute unevenly to the odds of an outlier being correctly detected. Direction of motion contributes the most to accurate detection of speed outliers, and position contributes the most to accurate detection of direction outliers. We introduce the concept of saliency deficit in which item importance in the data space is not reflected in the visualization due to a lack of saliency. We conclude that motion outlier detection is not well supported in multivariate animated scatterplots.",
  "authors": [
    {
      "name": "Rafael Veras",
      "institution": "University of Ontario Institute of Technology, Oshawa, ON, Canada",
      "img": "/do/10.1145/contrib-81490682614/rel-imgonly/de_hbuiq_400x400.jpg",
      "acmid": "81490682614",
      "orcid": "missing"
    },
    {
      "name": "Christopher Collins",
      "institution": "University of Ontario Institute of Technology, Oshawa, ON, Canada",
      "img": "/do/10.1145/contrib-81436596812/rel-imgonly/collins-headshot.jpg",
      "acmid": "81436596812",
      "orcid": "0000-0002-4520-7000"
    }
  ],
  "references": [
    {
      "text": "Lyn Bartram, Colin Ware, and Tom Calvert. 2003. Moticons:: detection, distraction and task. Int. Journal of Human-Computer Studies 58, 5 (2003), 515--545.  ",
      "doi": "10.1016/S1071-5819%2803%2900021-1"
    },
    {
      "text": "Douglas Bates, Martin Mächler, Ben Bolker, and Steve Walker. 2015. Fitting linear mixed-effects models using lme4. Journal of Statistical Software 67, 1 (2015), 1--48.",
      "doi": ""
    },
    {
      "text": "Zoya Bylinskii, Tilke Judd, Ali Borji, Laurent Itti, Frédo Durand, Aude Oliva, and Antonio Torralba. {n. d.}. MIT Saliency Benchmark. http://saliency.mit.edu/.",
      "doi": ""
    },
    {
      "text": "Zoya Bylinskii, Nam Wook Kim, Peter O'Donovan, Sami Alsheikh, Spandan Madan, Hanspeter Pfister, Fredo Durand, Bryan Russell, and Aaron Hertzmann. 2017. Learning visual importance for graphic designs and data visualizations. In Proc. 30th ACM Symp. on User Interface Software and Technology. ACM, 57--69.  ",
      "doi": "10.1145/3126594.3126653"
    },
    {
      "text": "Helen Chen, Sophie Engle, Alark Joshi, Eric D Ragan, Beste F Yuksel, and Lane Harrison. 2018. Using Animation to Alleviate Overdraw in Multiclass Scatterplot Matrices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 417.  ",
      "doi": "10.1145/3173574.3173991"
    },
    {
      "text": "Lisa J Croner and Thomas D Albright. 1997. Image segmentation enhances discrimination of motion in visual noise. Vision Research 37, 11 (1997), 1415--1427.",
      "doi": ""
    },
    {
      "text": "M Dick, S Ullman, and D Sagi. 1987. Parallel and serial processes in motion detection. Science 237, 4813 (July 1987), 400--402.",
      "doi": ""
    },
    {
      "text": "J. Duncan and G. W. Humphreys. 1989. Visual search and stimulus similarity. Psychological Review 96, 3 (1989), 433--458.",
      "doi": ""
    },
    {
      "text": "Ronak Etemadpour and Angus Graeme Forbes. 2017. Density-based motion. Information Visualization 16, 1 (2017), 3--20.",
      "doi": ""
    },
    {
      "text": "Ronak Etemadpour, Paul Murray, and Angus Graeme Forbes. 2014. Evaluating density-based motion for big data visual analytics. In Proc. of the IEEE Int. Conf. on Big Data. IEEE, 451--460.",
      "doi": ""
    },
    {
      "text": "Wendell R Garner. 2014. The processing of Information and Structure. Psychology Press.",
      "doi": ""
    },
    {
      "text": "M. Gleicher, M. Correll, C. Nothelfer, and S. Franconeri. 2013. Perception of average value in multiclass scatterplots. IEEE Trans. on Visualization and Computer Graphics 19, 12 (Dec. 2013), 2316--2325.  ",
      "doi": "10.1109/TVCG.2013.183"
    },
    {
      "text": "Christopher Healey and James Enns. 2011. Attention and Visual Memory in Visualization and Computer Graphics. IEEE Trans. on Visualization and Computer Graphics (July 2011), 1--20.  ",
      "doi": "10.1109/TVCG.2011.127"
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using Mechanical Turk to assess visualization design. In Proc. SIGCHI Conf. on Human Factors in Computing Systems. 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Daniel E Huber and Christopher G Healey. 2005. Visualizing data with motion. In Visualization, 2005. VIS 05. IEEE. IEEE, 527--534.",
      "doi": ""
    },
    {
      "text": "Tilke Judd, Frédo Durand, and Antonio Torralba. 2012. A Benchmark of Computational Models of Saliency to Predict Human Fixations. Technical Report MIT-CSAIL-TR-2012-001.",
      "doi": ""
    },
    {
      "text": "Younghoon Kim and Jeffrey Heer. 2018. Assessing effects of task and data distribution on the effectiveness of visual encodings. Computer Graphics Forum (Proc. EuroVis) (2018).",
      "doi": ""
    },
    {
      "text": "Gordon Kindlmann and Carlos Scheidegger. 2014. An algebraic process for visualization design. IEEE Trans. on Visualization and Computer Graphics 20, 12 (2014), 2181--2190.",
      "doi": ""
    },
    {
      "text": "Yang Liu and Jeffrey Heer. 2018. Somewhere over the rainbow: An empirical assessment of quantitative colormaps. In Proc. SIGCHI Conf. on Human Factors in Computing Systems.  ",
      "doi": "10.1145/3173574.3174172"
    },
    {
      "text": "Laura E Matzen, Michael J Haass, Kristin M Divis, Zhiyuan Wang, and Andrew T Wilson. 2018. Data Visualization Saliency Model: A Tool for Evaluating Abstract Data Visualizations. IEEE Transactions on Visualization & Computer Graphics 1 (2018), 563--573.",
      "doi": ""
    },
    {
      "text": "Peter McLeod, Jon Driver, and Jennie Crisp. 1988. Visual search for a conjunction of movement and form is parallel. Nature 332, 6160 (1988), 154.",
      "doi": ""
    },
    {
      "text": "D. Moritz, C. Wang, G. Nelson, H. Lin, A. M. Smith, B. Howe, and J. Heer. 2019. Formalizing visualization design knowledge as constraints: actionable and extensible models in Draco. IEEE Trans. on Visualization and Computer Graphics (2019).",
      "doi": ""
    },
    {
      "text": "Thomas V Papathomas, Andrei Gorea, and Bela Julesz. 1991. Two carriers for motion perception: color and luminance. Vision Research 31, 11 (1991), 1883--1892.",
      "doi": ""
    },
    {
      "text": "George Robertson, Roland Fernandez, Danyel Fisher, Bongshin Lee, and John Stasko. 2008. Effectiveness of animation in trend visualization. IEEE Trans. on Visualization and Computer Graphics 14, 6 (2008), 1325-- 1332.  ",
      "doi": "10.1109/TVCG.2008.125"
    },
    {
      "text": "Ruth Rosenholtz. 1999. A simple saliency model predicts a number of motion popout phenomena. Vision Research 39 (1999), 3157--3163.",
      "doi": ""
    },
    {
      "text": "Ruth Rosenholtz, Yuanzhen Li, Jonathan Mansfield, and Zhenlan Jin. 2005. Feature Congestion: A Measure of Display Clutter. In Proc. of the SIGCHI Conf. on Human Factors in Computing Systems. 761--770.  ",
      "doi": "10.1145/1054972.1055078"
    },
    {
      "text": "Ruth Rosenholtz, Yuanzhen Li, and Lisa Nakano. 2007. Measuring visual clutter. Journal of Vision 7, 2 (2007), 17.1--22.",
      "doi": ""
    },
    {
      "text": "Ruth Rosenholtz, Allen L. Nagy, and Nicole R. Bell. 2004. The effect of background color on asymmetries in color search. Journal of Vision 4, 3 (March 2004), 224--240.",
      "doi": ""
    },
    {
      "text": "Daniel J. Simons, Steven L. Franconeri, and Rebecca L. Reimer. 2000. Change blindness in the absence of a visual disruption. Perception 29, 10 (2000), 1143--1154.",
      "doi": ""
    },
    {
      "text": "Nathaniel Smith and Stéfan van der Walt. 2015. A better default colormap for Matplotlib. https://youtu.be/xAoljeRJ3lU",
      "doi": ""
    },
    {
      "text": "Danielle Albers Szafir, Steve Haroz, Michael Gleicher, and Steven Franconeri. 2016. Four types of ensemble coding in data visualizations. Journal of Vision 16, 5 (2016), 11.",
      "doi": ""
    },
    {
      "text": "Anne M Treisman and Garry Gelade. 1980. A feature-integration theory of attention. Cognitive Psychology 12, 1 (1980), 97--136.",
      "doi": "10.1016/0010-0285%2880%2990005-"
    },
    {
      "text": "Adrian Von Mühlenen and Hermann J Müller. 2000. Perceptual integration of motion and form information: evidence of parallel-continuous processing. Perception & Psychophysics 62, 3 (2000), 517--531.",
      "doi": ""
    },
    {
      "text": "Colin Ware. 2004. Information Visualization: Perception for Design (2nd ed.). Morgan Kaufmann Publishers Inc., San Francisco. ",
      "doi": "10.5555/983611"
    },
    {
      "text": "Jeremy M Wolfe. 1998. What can 1 million trials tell us about visual search? Psychological Science 9, 1 (1998), 33--39.",
      "doi": ""
    }
  ]
}