{
  "doi": "10.1145/3290605.3300782",
  "title": "How Users Interpret Bugs in Trigger-Action Programming",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Trigger-action programming (TAP) is a programming model enabling users to connect services and devices by writing if-then rules. As such systems are deployed in increasingly complex scenarios, users must be able to identify programming bugs and reason about how to fix them. We first systematize the temporal paradigms through which TAP systems could express rules. We then identify ten classes of TAP programming bugs related to control flow, timing, and inaccurate user expectations. We report on a 153-participant online study where participants were assigned to a temporal paradigm and shown a series of pre-written TAP rules. Half of the rules exhibited bugs from our ten bug classes. For most of the bug classes, we found that the presence of a bug made it harder for participants to correctly predict the behavior of the rule. Our findings suggest directions for better supporting end-user programmers.",
  "authors": [
    {
      "name": "Will Brackenbury",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658751610",
      "orcid": "missing"
    },
    {
      "name": "Abhimanyu Deora",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365682",
      "orcid": "missing"
    },
    {
      "name": "Jillian Ritchey",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365878",
      "orcid": "missing"
    },
    {
      "name": "Jason Vallee",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366253",
      "orcid": "missing"
    },
    {
      "name": "Weijia He",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659306421",
      "orcid": "missing"
    },
    {
      "name": "Guan Wang",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659336619",
      "orcid": "missing"
    },
    {
      "name": "Michael L. Littman",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406601119",
      "orcid": "missing"
    },
    {
      "name": "Blase Ur",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/do/10.1145/contrib-81496672613/rel-imgonly/blase_headshot_400.jpg",
      "acmid": "81496672613",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sonya Alexandrova, Zachary Tatlock, and Maya Cakmak. 2015. RoboFlow: A flow-based visual programming language for mobile manipulation tasks. In Proc. ICRA.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bonar and Elliot Soloway. 1983. Uncovering principles of novice programming. In Proc. POPL.  ",
      "doi": "10.1145/567067.567069"
    },
    {
      "text": "Jeffrey Bonar and Elliot Soloway. 1985. Preprogramming knowledge: A major source of misconceptions in novice programmers. Human-Computer Interaction 1, 2 (1985), 133--161.  ",
      "doi": "10.1207/s15327051hci0102_3"
    },
    {
      "text": "Julia Brich, Marcel Walch, Michael Rietzler, Michael Weber, and Florian Schaub. 2017. Exploring end user programming needs in home automation. ACM TOCHI 24, 2 (2017), 11.  ",
      "doi": "10.1145/3057858"
    },
    {
      "text": "Federico Cabitza, Daniela Fogli, Rosa Lanzilotti, and Antonio Piccinno. 2017. Rule-based tools for the configuration of ambient intelligence systems: a comparative user study. Multimedia Tools and Applications 76, 4 (2017), 5221--5241.  ",
      "doi": "10.1007/s11042-016-3511-2"
    },
    {
      "text": "Giovanni Campagna, Rakesh Ramesh, Silei Xu, Michael Fischer, and Monica S. Lam. 2017. Almond: The architecture of an open, crowdsourced, privacy-preserving, programmable virtual assistant. In Proc. WWW.  ",
      "doi": "10.1145/3038912.3052562"
    },
    {
      "text": "Jill Cao, Kyle Rector, Thomas H. Park, Scott D. Fleming, Margaret Burnett, and Susan Wiedenbeck. 2010. A debugging perspective on end-user mashup programming. In Proc. VL/HCC.  ",
      "doi": "10.1109/VLHCC.2010.29"
    },
    {
      "text": "Meghan Clark, Mark W. Newman, and Prabal Dutta. 2017. Devices and data and agents, oh my: How smart home abstractions prime end-user mental models. ACM IMWUT 1, 3 (2017), 44.  ",
      "doi": "10.1145/3132031"
    },
    {
      "text": "Yngve Dahl and Reidar-Martin Svendsen. 2011. End-user composition interfaces for smart environments: A preliminary study of usability factors. In Design, User Experience, and Usability. Theory, Methods, Tools and Practice. 118--127.",
      "doi": ""
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Charles Yiu, John Zimmerman, and Anind K. Dey. 2006. Principles of smart home control. In Proc. UbiComp.  ",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Luigi De Russis and Fulvio Corno. 2015. Homerules: A tangible enduser programming interface for smart homes. In Proc. CHI Extended Abstracts.  ",
      "doi": "10.1145/2702613.2732795"
    },
    {
      "text": "Daniel C Dennett. 2017. Brainstorms: Philosophical essays on mind and psychology. MIT press.",
      "doi": ""
    },
    {
      "text": "Anind K. Dey, Timothy Sohn, Sara Streng, and Justin Kodama. 2006. iCAP: Interactive prototyping of context-aware applications. In Proc. Pervasive.  ",
      "doi": "10.1007/11748625_16"
    },
    {
      "text": "W. Keith Edwards and Rebecca E. Grinter. 2001. At home with ubiquitous computing: Seven challenges. In Proc. UbiComp. ",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Earlence Fernandes, Amir Rahmati, Jaeyeon Jung, and Atul Prakash. 2018. Decentralized action integrity for trigger-action IoT platforms. Proc. NDSS.",
      "doi": ""
    },
    {
      "text": "Jacopo Fiorenza and Andrea Mariani. 2015. Improving trigger action programming in smart buildings through suggestions based on behavioral graphs analysis. Technical Report. Politecnico di Milano.",
      "doi": ""
    },
    {
      "text": "Shane Frederick. 2005. Cognitive reflection and decision making. Journal of Economic Perspectives 19, 4 (2005).",
      "doi": ""
    },
    {
      "text": "Manuel García-Herranz, Pablo Haya, and Xavier Alamán. 2010. Towards a ubiquitous end-user programming system for smart spaces. Journal of Universal Computer Science 16, 12 (2010), 1633--1649.",
      "doi": ""
    },
    {
      "text": "Giuseppe Ghiani, Marco Manca, Fabio Paternò, and Carmen Santoro. 2017. Personalization of context-dependent applications through trigger-action rules. ACM TOCHI 24, 2 (2017), 14.  ",
      "doi": "10.1145/3057861"
    },
    {
      "text": "Globus. 2019. https://www.globus.org/.",
      "doi": ""
    },
    {
      "text": "Haryadi S. Gunawi, Mingzhe Hao, Tanakorn Leesatapornwongsa, Tiratat Patana-anake, Thanh Do, Jeffry Adityatama, Kurnia J. Eliazar, Agung Laksono, Jeffrey F. Lukman, Vincentius Martin, et al. 2014. What bugs live in the cloud? A study of 3000+ issues in cloud systems. In Proc. SOCC.  ",
      "doi": "10.1145/2670979.2670986"
    },
    {
      "text": "Justin Huang and Maya Cakmak. 2015. Supporting mental model accuracy in trigger-action programming. In Proc. UbiComp.  ",
      "doi": "10.1145/2750858.2805830"
    },
    {
      "text": "Ting-Hao Kenneth Huang, Amos Azaria, and Jeffrey P. Bigham. 2016. Instructablecrowd: Creating if-then rules via conversations with the crowd. In Proc. CHI Extended Abstracts.  ",
      "doi": "10.1145/2851581.2892502"
    },
    {
      "text": "Matthew Hughes. 2018. Mozilla's new Things Gateway is an open home for your smart devices. TheNextWeb.",
      "doi": ""
    },
    {
      "text": "Jan Humble, Andy Crabtree, Terry Hemmings, Karl-Petter Åkesson, Boriana Koleva, Tom Rodden, and Pär Hansson. 2003. \"Playing with the bits\" User-configuration of ubiquitous domestic environments. In Proc. UbiComp.",
      "doi": ""
    },
    {
      "text": "If This Then That. Accessed 2018. If This Then That. https://ifttt.com.",
      "doi": ""
    },
    {
      "text": "Thorin Klosowski. 2016. Automation Showdown: IFTTT vs Zapier vs Microsoft Flow. LifeHacker.",
      "doi": ""
    },
    {
      "text": "Andrew J Ko, Robin Abraham, Laura Beckwith, Alan Blackwell, Margaret Burnett, Martin Erwig, Chris Scaffidi, Joseph Lawrance, Henry Lieberman, Brad Myers, et al. 2011. The state of the art in end-user software engineering. ACM CSUR 43, 3 (2011), 21.  ",
      "doi": "10.1145/1922649.1922658"
    },
    {
      "text": "Andrew J. Ko and Brad A. Myers. 2004. Designing the Whyline: A debugging interface for asking questions about program behavior. In Proc. CHI.  ",
      "doi": "10.1145/985692.985712"
    },
    {
      "text": "Tiiu Koskela and Kaisa Väänänen-Vainio-Mattila. 2004. Evolution towards smart home environments: Empirical evaluation of three user interfaces. Personal Ubiquitous Comput. 8, 3--4 (July 2004), 234--240.  ",
      "doi": "10.1007/s00779-004-0283-x"
    },
    {
      "text": "Tanakorn Leesatapornwongsa, Jeffrey F. Lukman, Shan Lu, and Haryadi S. Gunawi. 2016. TaxDC: A taxonomy of non-deterministic concurrency bugs in datacenter distributed systems. ACM SIGPLAN Notices 51, 4 (2016), 517--530.  ",
      "doi": "10.1145/2872362.2872374"
    },
    {
      "text": "Gilly Leshed, Eben M. Haber, Tara Matthews, and Tessa Lau. 2008. CoScripter: Automating & sharing how-to knowledge in the enterprise. In Proc. CHI.  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Nat Levy. 2017. Microsoft updates IFTTT competitor Flow and custom app building tool PowerApps. GeekWire.",
      "doi": ""
    },
    {
      "text": "Chieh-Jan Mike Liang, Lei Bu, Zhao Li, Junbei Zhang, Shi Han, Karlsson F. Börje, Dongmei Zhang, and Feng Zhao. 2016. Systematically debugging IoT control system correctness for building automation. In Proc. BuildSys.  ",
      "doi": "10.1145/2993422.2993426"
    },
    {
      "text": "Henry Lieberman, Fabio Paternò, Markus Klann, and Volker Wulf. 2006. End-user development: An emerging paradigm. Springer. ",
      "doi": "10.5555/1146351"
    },
    {
      "text": "James Lin, Jeffrey Wong, Jeffrey Nichols, Allen Cypher, and Tessa A. Lau. 2009. End-user programming of mashups with Vegemite. In Proc. IUI.  ",
      "doi": "10.1145/1502650.1502667"
    },
    {
      "text": "Michelle L. Mazurek, J.P. Arsenault, Joanna Bresee, Nitin Gupta, Iulia Ion, Christina Johns, Daniel Lee, Yuan Liang, Jenny Olsen, Brandon Salmon, Richard Shay, Kami Vaniea, Lujo Bauer, Lorrie Faith Cranor, Gregory R. Ganger, and Michael K. Reiter. 2010. Access control for home data sharing: Attitudes, needs and practices. In Proc. CHI.  ",
      "doi": "10.1145/1753326.1753421"
    },
    {
      "text": "Orni Meerbaum-Salant, Michal Armoni, and Mordechai Ben-Ari. 2011. Habits of programming in Scratch. In Proc. ITiCSE.  ",
      "doi": "10.1145/1999747.1999796"
    },
    {
      "text": "Sarah Mennicken, David Kim, and Elaine May Huang. 2016. Integrating the smart home into the digital calendar. In Proc. CHI.  ",
      "doi": "10.1145/2858036.2858168"
    },
    {
      "text": "Xianghang Mi, Feng Qian, Ying Zhang, and XiaoFeng Wang. 2017. An empirical characterization of IFTTT: Ecosystem, usage, and performance. In Proc. IMC.  ",
      "doi": "10.1145/3131365.3131369"
    },
    {
      "text": "Alessandro A. Nacci, Bharathan Balaji, Paola Spoletini, Rajesh Gupta, Donatella Sciuto, and Yuvraj Agarwal. 2015. Buildingrules: A triggeraction based system to manage complex commercial buildings. In UbiComp Adjunct Proceedings.  ",
      "doi": "10.1145/2800835.2800916"
    },
    {
      "text": "Mark W. Newman, Ame Elliott, and Trevor F. Smith. 2008. Providing an integrated user experience of networked media, devices, and services CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk W. Brackenbury et al. through end-user composition. In Proc. Pervasive.",
      "doi": ""
    },
    {
      "text": "Obycode, LLC. 2018. SmartRules. http://smartrulesapp.com/.",
      "doi": ""
    },
    {
      "text": "Ed Oswald. 2016. IFTTT competitor Stringify gets a major update. TechHive.",
      "doi": ""
    },
    {
      "text": "John F. Pane, Brad A. Myers, and Leah Miller. 2002. Using HCI techniques to design a more usable programming system. Technical Report. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Roy D. Pea. 1986. Language-independent conceptual \"bugs\" in novice programming. Journal of Educational Computing Research 2, 1 (1986), 25--36.",
      "doi": ""
    },
    {
      "text": "Amir Rahmati, Earlence Fernandes, Jaeyeon Jung, and Atul Prakash. 2017. IFTTT vs. Zapier: A comparative study of trigger-action programming frameworks. arXiv:1709.02788 (2017).",
      "doi": ""
    },
    {
      "text": "T.J. Robertson, Shrinu Prabhakararao, Margaret Burnett, Curtis Cook, Joseph R. Ruthruff, Laura Beckwith, and Amit Phalgune. 2004. Impact of interruption style on end-user debugging. In Proc. CHI.  ",
      "doi": "10.1145/985692.985729"
    },
    {
      "text": "Milijana Surbatovich, Jassim Aljuraidan, Lujo Bauer, Anupam Das, and Limin Jia. 2017. Some recipes can do more than spoil your appetite: Analyzing the security and privacy risks of IFTTT recipes. In Proc. WWW.  ",
      "doi": "10.1145/3038912.3052709"
    },
    {
      "text": "Blase Ur, Elyse McManus, Melwyn Pak Yong Ho, and Michael L. Littman. 2014. Practical trigger-action programming in the smart home. In Proc. CHI.  ",
      "doi": "10.1145/2556288.2557420"
    },
    {
      "text": "Blase Ur, Melwyn Pak Yong Ho, Stephen Brawner, Jiyun Lee, Sarah Mennicken, Noah Picard, Diane Schulze, and Michael L. Littman. 2016. Trigger-action programming in the wild: An analysis of 200,000 IFTTT recipes. In Proc. CHI.  ",
      "doi": "10.1145/2858036.2858556"
    },
    {
      "text": "Qi Wang, Wajih Ul Hassan, Adam Bates, and Carl Gunter. 2018. Fear and logging in the Internet of Things. In Proc. NDSS.",
      "doi": ""
    },
    {
      "text": "Wireless Watch. 2017. Huawei could rescue Amazon's Alexa from the smart home. The Register. https://www.theregister.co.uk/2017/ 01/26/huawei_throws_amazon_alexa_a_mobile_lifeline_to_reach_ beyond_the_home/.",
      "doi": ""
    },
    {
      "text": "Jong-bum Woo and Youn-kyung Lim. 2015. User experience in do-ityourself-style smart homes. In Proc. UbiComp.  ",
      "doi": "10.1145/2750858.2806063"
    },
    {
      "text": "Lana Yarosh and Pamela Zave. 2017. Locked or not?: Mental models of IoT feature interaction. In Proc. CHI.  ",
      "doi": "10.1145/3025453.3025617"
    },
    {
      "text": "Pamela Zave, Eric Cheung, and Svetlana Yarosh. 2015. Toward user-centric feature composition for the Internet of Things. arXiv:1510.06714 (2015).",
      "doi": ""
    },
    {
      "text": "Lefan Zhang, Weijia He, Jesse Martinez, Noah Brackenbury, Shan Lu, and Blase Ur. 2019. Synthesizing and repairing trigger-action programs using LTL properties. In Proc. ICSE.",
      "doi": "10.1109/ICSE.2019.00043"
    }
  ]
}