{
  "doi": "10.1145/3290605.3300894",
  "title": "Designing Participatory Sensing with Remote Communities to Conserve Endangered Species",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2019,
  "badges": [],
  "abstract": "The increasing loss of species globally calls for effective monitoring tools and strategies to inform conservation action. The dominant approach to citizens engagement has been smart phone and platform-centric, tasking crowds to collect and analyze data. However, many critically endangered species inhabit remote areas, characterized by sparsely populated communities with poor internet connectivity. Approaches need to garner high engagement relative to population size, with data collection and knowledge synthesis suited to the local context. We conducted a field study in remote communities to understand how to enhance conservation of Bhutan's critically endangered White-bellied heron by exploring existing monitoring practices and trialing acoustic sensing technologies. We found that knowledge about the species is partial, heterogeneous, situated within and across communities and rooted in cultural beliefs. Sensors, acoustic interfaces, and playful probes provided new ways for the community to 'see' and discuss their local environment fostering them to share and grow their knowledge together. We contribute a synthesis of key considerations for designing effective participatory sensing to conserve species in remote communities.",
  "authors": [
    {
      "name": "Tshering Dema",
      "institution": "Queensland University of Technology, Brisbane, Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659035306",
      "orcid": "missing"
    },
    {
      "name": "Margot Brereton",
      "institution": "Queensland University of Technology, Brisbane, Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017862",
      "orcid": "0000-0002-0982-3404"
    },
    {
      "name": "Paul Roe",
      "institution": "Queensland University of Technology, Brisbane, Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100338049",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Paul Aoki, Allison Woodruff, Baladitya Yellapragada, and Wesley Willett. 2017. Environmental Protection and Agency: Motivations, Capacity, and Goals in Participatory Sensing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3138--3150.  ",
      "doi": "10.1145/3025453.3025667"
    },
    {
      "text": "Paul M Aoki, R J Honicky, Alan Mainwaring, Chris Myers, Eric Paulos, Sushmita Subramanian, and Allison Woodruff. 2009. A Vehicle for Research: Using Street Sweepers to Explore the Landscape of Environmental Community Action. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 375--384.  ",
      "doi": "10.1145/1518701.1518762"
    },
    {
      "text": "Nathan J Bennett, Robin Roth, Sarah C Klain, Kai Chan, Patrick Christie, Douglas A Clark, Georgina Cullman, Deborah Curran, Trevor J Durbin, Graham Epstein, Alison Greenberg, Michael P Nelson, John Sandlos, Richard Stedman, Tara L Teel, Rebecca Thomas, Diogo Verí ssimo, and Carina Wyborn. 2017. Conservation social science: Understanding and integrating human dimensions to improve conservation. Biological Conservation, Vol. 205, Supplement C (2017), 93--108.",
      "doi": ""
    },
    {
      "text": "Daniel T Blumstein, Daniel J Mennill, Patrick Clemins, Lewis Girod, Kung Yao, Gail Patricelli, Jill L Deppe, Alan H Krakauer, Christopher Clark, Kathryn A Cortopassi, Sean F Hanser, Brenda McCowan, Andreas M Ali, and Alexander N G Kirschel. 2011. Acoustic monitoring in terrestrial environments using microphone arrays: applications, technological considerations and prospectus. Journal of Applied Ecology, Vol. 48, 3 (2011), 758--767.",
      "doi": ""
    },
    {
      "text": "Anne Bowser, Derek Hansen, Yurong He, Carol Boston, Matthew Reid, Logan Gunnell, and Jennifer Preece. 2013. Using Gamification to Inspire New Citizen Science Volunteers. In Proceedings of the First International Conference on Gameful Design, Research, and Applications (Gamification '13). ACM, New York, NY, USA, 18--25.  ",
      "doi": "10.1145/2583008.2583011"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology, Vol. 3, May 2015 (2006), 77--101.",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "Margot Brereton, Alessandro Soro, Kate Vaisutis, and Paul Roe. 2015. The Messaging Kettle: Prototyping Connection over a Distance Between Adult Children and Older Parents. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 713--716.  ",
      "doi": "10.1145/2702123.2702462"
    },
    {
      "text": "George Hope Chidziwisano and Susan Wyche. 2018. M-Kulinda: Using a Sensor-Based Technology Probe to Explore Domestic Security in Rural Kenya. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 10:1--10:13.  ",
      "doi": "10.1145/3173574.3173584"
    },
    {
      "text": "Jeffrey P Cohn. 2008. Citizen Science: Can Volunteers Do Real Research? BioScience, Vol. 58, 3 (mar 2008), 192--197.",
      "doi": ""
    },
    {
      "text": "Mark Cottman-Fields, Margot Brereton, Jason Wimmer, and Paul Roe. 2014. Collaborative extension of biodiversity monitoring protocols in the bird watching community. Proceedings of the 13th Participatory Design Conference on Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts - PDC '14 - volume 2 (2014), 111--114.  ",
      "doi": "10.1145/2662155.2662193"
    },
    {
      "text": "Finn Danielsen, Neil D Burgess, Andrew Balmford, Paul F Donald, Mikkel Funder, Julia P G Jones, Philip Alviola, Danilo S Balete, Tom Blomley, Justin Brashares, Brian Child, Martin Enghoff, Jon Fjeldså, Sune Holt, Hanne Hü bertz, Arne E Jensen, Per M Jensen, John Massao, Marlynn M Mendoza, Yonika Ngaga, Michael K Poulsen, Ricardo Rueda, Moses Sam, Thomas Skielboe, Greg Stuart-Hill, Elmer Topp-Jørgensen, and Deki Yonten. 2009. Local Participation in Natural Resource Monitoring: a Characterization of Approaches. Conservation Biology, Vol. 23, 1 (2009), 31--42.",
      "doi": ""
    },
    {
      "text": "Dauna Coulter. 2011. Citizen Scientists Making Incredible Discoveries. https://science.nasa.gov/science-news/science-at-nasa/2011/22apr_zooniverse",
      "doi": ""
    },
    {
      "text": "Tshering Dema, Margot Brereton, Jessica L Cappadonna, Paul Roe, Anthony Truskinger, and Jinglan Zhang. 2017. Collaborative Exploration and Sensemaking of Big Environmental Sound Data. Computer Supported Cooperative Work (CSCW) (may 2017).  ",
      "doi": "10.1007/s10606-017-9286-9"
    },
    {
      "text": "Tawanna Dillahunt, Jennifer Mankoff, Eric Paulos, and Susan Fussell. 2009. It's Not All About \"Green\": Energy Use in Low-income Communities. In Proceedings of the 11th International Conference on Ubiquitous Computing (UbiComp '09). ACM, New York, NY, USA, 255--264.  ",
      "doi": "10.1145/1620545.1620583"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers. 2010. Mapping the Landscape of Sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Paul Dourish and Edgar Gó mez Cruz. 2018. Datafication and data fiction: Narrating data and narrating with data. Big Data & Society, Vol. 5, 2 (jul 2018), 2053951718784083.",
      "doi": ""
    },
    {
      "text": "William W Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity As a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 233--240.  ",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "William W Gaver, John Bowers, Kirsten Boehner, Andy Boucher, David W T Cameron, Mark Hauenstein, Nadine Jarvis, and Sarah Pennington. 2013. Indoor Weather Stations: Investigating a Ludic Approach to Environmental HCI Through Batch Prototyping. April (2013).  ",
      "doi": "10.1145/2470654.2466474"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Sté phane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Bjö rn Eiderb\"a ck. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "IUCN. 2017. Red list statistics. http://www.iucnredlist.org/about/summary-statistics",
      "doi": ""
    },
    {
      "text": "Paul Jepson and Richard J Ladle. 2015. Nature apps: Waiting for the revolution. Ambio, Vol. 44, 8 (dec 2015), 827--832.",
      "doi": ""
    },
    {
      "text": "Alexander Kawrykow, Gary Roumanis, Alfred Kam, Daniel Kwak, Clarence Leung, Chu Wu, Eleyine Zarour, Phylo Players, Luis Sarmenta, Mathieu Blanchette, and Jé rô me Waldispü hl. 2012. Phylo: A Citizen Science Approach for Improving Multiple Sequence Alignment. PLOS ONE, Vol. 7, 3 (mar 2012), e31362.",
      "doi": ""
    },
    {
      "text": "Joseph 'Jofish' Kaye, David Holstius, Edmund Seto, Brittany Eddy, and Michael Ritter. 2012. Using NFC Phones to Track Water Purification in Haiti. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 677--690.  ",
      "doi": "10.1145/2212776.2212839"
    },
    {
      "text": "Rod Kennett, Finn Danielsen, and Kirsten M Silvius. 2015. Citizen science is not enough on its own. Nature, Vol. 521 (may 2015), 161.",
      "doi": ""
    },
    {
      "text": "Alison Kidd. 1994. The Marks Are on the Knowledge Worker. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94). ACM, New York, NY, USA, 186--191.  ",
      "doi": "10.1145/191666.191740"
    },
    {
      "text": "Sunyoung Kim, Christine Robson, Thomas Zimmerman, Jeffrey Pierce, and Eben M. Haber. 2011. Creek Watch: Pairing Usefulness and Usability for Successful Citizen Science. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2125--2134.  ",
      "doi": "10.1145/1978942.1979251"
    },
    {
      "text": "Stacey Kuznetsov, William Odom, James Pierce, and Eric Paulos. 2011. Nurturing Natural Sensors. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11). ACM, New York, NY, USA, 227--236.  ",
      "doi": "10.1145/2030112.2030144"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Cambridge University Press,.",
      "doi": ""
    },
    {
      "text": "Chris J Lintott, Kevin Schawinski, Anvz e Slosar, Kate Land, Steven Bamford, Daniel Thomas, M Jordan Raddick, Robert C Nichol, Alex Szalay, Dan Andreescu, Phil Murray, and Jan Vandenberg. 2008. Galaxy Zoo: morphologies derived from visual inspection of galaxies from the Sloan Digital Sky Survey. Monthly Notices of the Royal Astronomical Society, Vol. 389, 3 (2008), 1179--1189.",
      "doi": ""
    },
    {
      "text": "Roman Lukyanenko, Jeffrey Parsons, and Yolanda F Wiersma. 2016. Emerging problems of data quality in citizen science. Conservation Biology, Vol. 30, 3 (feb 2016), 447--449.",
      "doi": ""
    },
    {
      "text": "Richard Mason, Paul Roe, Michael Towsey, Jinglan Zhang, Jennifer Gibson, and Stuart Gage. 2008. Towards an acoustic environmental observatory. Proceedings - 4th IEEE International Conference on eScience, eScience 2008 (2008), 135--142.  ",
      "doi": "10.1109/eScience.2008.16"
    },
    {
      "text": "Donald McMillan, Arvid Engström, Airi Lampinen, and Barry Brown. 2016. Data and the City. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2933--2944.  ",
      "doi": "10.1145/2858036.2858434"
    },
    {
      "text": "Elisa D Mekler, Florian Brü hlmann, Klaus Opwis, and Alexandre N Tuch. 2013. Disassembling Gamification: The Effects of Points and Meaning on User Motivation and Performance. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1137--1142.  ",
      "doi": "10.1145/2468356.2468559"
    },
    {
      "text": "Abraham Miller-Rushing, Richard Primack, and Rick Bonney. 2012. The history of public participation in ecological research. Frontiers in Ecology and the Environment, Vol. 10, 6 (aug 2012), 285--290.",
      "doi": ""
    },
    {
      "text": "Stuart Moran, Nadia Pantidi, Tom Rodden, Alan Chamberlain, Chloe Griffiths, Davide Zilli, Geoff Merrett, and Alex Rogers. 2014. Listening to the Forest and Its Curators: Lessons Learnt from a Bioacoustic Smartphone Application Deployment. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2387--2396.  ",
      "doi": "10.1145/2556288.2557022"
    },
    {
      "text": "Scott Newey, Paul Davidson, Sajid Nazir, Gorry Fairhurst, Fabio Verdicchio, R Justin Irvine, and René van der Wal. 2015. Limitations of recreational camera traps for wildlife management and conservation research: A practitioner's perspective. Ambio, Vol. 44, Suppl 4 (nov 2015), 624--635.",
      "doi": ""
    },
    {
      "text": "Greg Newman, Andrea Wiggins, Alycia Crall, Eric Graham, Sarah Newman, and Kevin Crowston. 2012. The future of Citizen science: Emerging technologies and shifting paradigms. Frontiers in Ecology and the Environment, Vol. 10, 6 (2012), 298--304.",
      "doi": ""
    },
    {
      "text": "Oded Nov, Ofer Arazy, and David Anderson. 2014. Scientists@Home: What Drives the Quantity and Quality of Online Citizen Science Participation? PLOS ONE, Vol. 9, 4 (2014), 1--11.",
      "doi": ""
    },
    {
      "text": "William Odom and Tijs Duel. 2018. On the Design of OLO Radio: Investigating Metadata As a Design Material. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 104:1--104:9.  ",
      "doi": "10.1145/3173574.3173678"
    },
    {
      "text": "Erick Oduor, Peninah Waweru, Jonathan Lenchner, and Carman Neustaedter. 2018. Practices and Technology Needs of a Network of Farmers in Tharaka Nithi, Kenya. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 39:1--39:11.  ",
      "doi": "10.1145/3173574.3173613"
    },
    {
      "text": "Stuart L Pimm, Sky Alibhai, Richard Bergl, Alex Dehgan, Chandra Giri, Zoe Jewell, Lucas Joppa, Roland Kays, and Scott Loarie. 2015. Emerging Technologies to Conserve Biodiversity. Trends in ecology & evolution, Vol. 30, 11 (nov 2015), 685--696.",
      "doi": ""
    },
    {
      "text": "Jennifer Preece. 2016. Citizen Science: New Research Challenges for Human-Computer Interaction. International Journal of Human-Computer Interaction, Vol. 32, 8 (2016), 585--612.",
      "doi": ""
    },
    {
      "text": "Jennifer Preece. 2017. How Two Billion Smartphone Users Can Save Species! interactions, Vol. 24, 2 (feb 2017), 26--33.  ",
      "doi": "10.1145/3043702"
    },
    {
      "text": "M. Jordan Raddick, Georgia Bracey, Pamela L. Gay, Chris J. Lintott, Phil Murray, Kevin Schawinski, Alexander S. Szalay, and Jan Vandenberg. 2010. Galaxy Zoo: Exploring the Motivations of Citizen Science Volunteers. Astronomy Education Review, Vol. 9, 1 (2010), 010103.",
      "doi": ""
    },
    {
      "text": "Toni Robertson and Lian Loke. 2009. Designing Situations. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7 (OZCHI '09). ACM, New York, NY, USA, 1--8.  ",
      "doi": "10.1145/1738826.1738828"
    },
    {
      "text": "Royal Society for Protection of Nature. {n. d.}. White-bellied Heron. http://www.rspnbhutan.org/programs/endangered-species/white-bellied-heron.html",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2014. Probes, toolkits and prototypes: three approaches to making in codesigning. CoDesign, Vol. 10, 1 (2014), 5--14.",
      "doi": ""
    },
    {
      "text": "Tobias Schwartz, Gunnar Stevens, Leonardo Ramirez, and Volker Wulf. 2013. Uncovering Practices of Making Energy Consumption Accountable: A Phenomenological Inquiry. ACM Trans. Comput.-Hum. Interact., Vol. 20, 2 (may 2013), 12:1--12:30.  ",
      "doi": "10.1145/2463579.2463583"
    },
    {
      "text": "Geraint Rhys Sethu-Jones, Yvonne Rogers, and Nicolai Marquardt. 2017. Data in the Garden: A Framework for Exploring Provocative Prototypes As Part of Research in the Wild. In Proceedings of the 29th Australian Conference on Computer-Human Interaction (OZCHI '17). ACM, New York, NY, USA, 318--327.  ",
      "doi": "10.1145/3152771.3152805"
    },
    {
      "text": "Jonathan Silvertown, Martin Harvey, Richard Greenwood, Mike Dodd, Jon Rosewell, Tony Rebelo, Janice Ansine, and Kevin McConway. 2. Crowdsourcing the identification of organisms: A case-study of iSpot. ZooKeys, Vol. 480 (feb 2), 125--146.",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Margot Brereton, Tshering Dema, Jessica L Oliver, Min Zhen Chai, and Aloha May Hufana Ambe. 2018. The Ambient Birdhouse: An IoT Device to Discover Birds and Engage with Nature. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 397:1--397:13.  ",
      "doi": "10.1145/3173574.3173971"
    },
    {
      "text": "Alessandro Soro, Margot Brereton, Jennyfer Lawrence Taylor, Anita Lee Hong, and Paul Roe. 2016. Cross-Cultural Dialogical Probes. In Proceedings of the First African Conference on Human Computer Interaction (AfriCHI'16). ACM, New York, NY, USA, 114--125.  ",
      "doi": "10.1145/2998581.2998591"
    },
    {
      "text": "Lucy Suchman. 2006. Human-machine reconfiguration: Plans and situated actions. Cambridge university press. ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Michael Towsey, Liang Zhang, Mark Cottman-Fields, Jason Wimmer, Jinglan Zhang, and Paul Roe. 2014. Visualization of long-duration acoustic recordings of the environment. Procedia Computer Science, Vol. 29 (2014), 703--712.",
      "doi": ""
    },
    {
      "text": "Anthony Truskinger, Mark Cottman-Fields, Paul Roe, and QUT Eco Acoustics Research Group. 2017. Acoustics Workbench. https://www.ecosounds.org/",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015. Sangeet Swara: A Community-Moderated Voice Forum in Rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/2702123.2702191"
    },
    {
      "text": "C. C. Wilderman, C. McEver, R. Bonney, J. Dickinson, S. Kelling, K. Rosenberg, and J. L. Shirk. 2007. Models of community science: design lessons from the field. In Citizen Science Toolkit Conference, Cornell Laboratory of Ornithology (Ed.).",
      "doi": ""
    },
    {
      "text": "Chris Wood, Brian Sullivan, Marshall Iliff, Daniel Fink, and Steve Kelling. 2011. eBird: Engaging Birders in Science and Conservation. PLOS Biology, Vol. 9, 12 (2011), 1--5.",
      "doi": ""
    },
    {
      "text": "World Wildlife Fund (WWF). {n. d.}. Living Planet Report 2016; .",
      "doi": ""
    },
    {
      "text": "Susan Wyche and Charles Steinfield. 2016. Why Don't Farmers Use Cell Phones to Access Market Prices? Technology Affordances and Barriers to Market Information Services Adoption in Rural Kenya. Information Technology for Development, Vol. 22, 2 (2016), 320--333.  ",
      "doi": "10.1080/02681102.2015.1048184"
    },
    {
      "text": "Davide Zilli, Oliver Parson, Geoff Merrett, and Alex Rogers. 2013. A hidden markov model-based acoustic cicada detector for crowdsourced smartphone biodiversity monitoring. In Proceedings of the 23rd international joint conference on artificial intelligence. 2945--2951. ",
      "doi": "10.5555/2540128.2540552"
    }
  ]
}