{
  "doi": "10.1145/3290605.3300477",
  "title": "Examining and Enhancing the Illusory Touch Perception in Virtual Reality Using Non-Invasive Brain Stimulation",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Virtual reality (VR) can be immersive to such a degree that users sometimes report feeling tactile sensations based on visualization of the touch, without any actual physical contact. This effect is not only interesting for studies of human perception, but can also be leveraged to improve the quality of VR by evoking tactile sensations without usage of specialized equipment. The aim of this paper is to study brain processing of the illusory touch and its enhancement for purposes of exploitation in VR scene design. To amplify the illusory touch, transcranial direct current stimulation (tDCS) was used. Participants attended two sessions with blinded stimulation and interacted with a virtual ball using tracked hands in VR. The effects were studied using electroencephalography (EEG), that allowed us to examine stimulation-induced changes in processing of the illusory touch in the brain, as well as to identify its neural correlates. Results confirm enhanced processing of the illusory touch after the stimulation, and some of these changes were correlated to subjective rating of its magnitude.",
  "authors": [
    {
      "name": "Filip Škola",
      "institution": "Faculty of Informatics, Masaryk University, Brno, Czech Rep",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659088705",
      "orcid": "missing"
    },
    {
      "name": "Fotis Liarokapis",
      "institution": "Faculty of Informatics, Masaryk University, Brno, Czech Rep",
      "img": "/do/10.1145/contrib-81100172661/rel-imgonly/fotis.jpg",
      "acmid": "81100172661",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andrea Antal, Nadine Brepohl, Csaba Poreisz, Klara Boros, Gabor Csifcsak, and Walter Paulus. 2008. Transcranial Direct Current Stimulation Over Somatosensory Cortex Decreases ExperimentallyInduced Acute Pain Perception. The Clinical Journal of Pain 24, 1 (Jan. 2008), 56.",
      "doi": ""
    },
    {
      "text": "Atman Binstock. 2015. Powering the Rift. Available at: https://www. oculus.com/blog/powering-the-rift/. Accessed: 2018-09-06.",
      "doi": ""
    },
    {
      "text": "DHR Blackwood and WJ Muir. 1990. Cognitive brain potentials and their application. The British Journal of Psychiatry 157, S9 (1990), 96--101.",
      "doi": ""
    },
    {
      "text": "S.-J. Blakemore, D. Bristow, G. Bird, C. Frith, and J. Ward. 2005. Somatosensory activations during the observation of touch and a case of vision--touch synaesthesia. Brain 128, 7 (July 2005), 1571--1583.",
      "doi": ""
    },
    {
      "text": "Paulo S. Boggio, Letícia O. Castro, Edna A. Savagim, Renata Braite, Viviane C. Cruz, Renata R. Rocha, Sergio P. Rigonatti, Maria T. A. Silva, and Felipe Fregni. 2006. Enhancement of non-dominant hand motor function by anodal transcranial direct current stimulation. Neuroscience Letters 404, 1 (Aug. 2006), 232--236.",
      "doi": ""
    },
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber hands 'feel'touch that eyes see. Nature 391, 6669 (1998), 756.",
      "doi": ""
    },
    {
      "text": "Woong Choi, Liang Li, Satoru Satoh, and Kozaburo Hachimura. 2016. Multisensory Integration in the Virtual Hand Illusion with Active Movement. BioMed Research International 2016 (Oct. 2016), e8163098.",
      "doi": ""
    },
    {
      "text": "Vasilios G Chouvardas, Amalia N Miliou, and Miltiadis K Hatalis. 2008. Tactile displays: Overview and recent advances. Displays 29, 3 (2008), 185--194.",
      "doi": ""
    },
    {
      "text": "Stanislas Dehaene and Lionel Naccache. 2001. Towards a cognitive neuroscience of consciousness: basic evidence and a workspace framework. Cognition 79, 1--2 (2001), 1--37.",
      "doi": ""
    },
    {
      "text": "Arnaud Delorme and Scott Makeig. 2004. EEGLAB: an open source toolbox for analysis of single-trial EEG dynamics including independent component analysis. Journal of neuroscience methods 134, 1 (2004), 9--21.",
      "doi": ""
    },
    {
      "text": "John E Desmedt and Claude Tomberg. 1989. Mapping early somatosensory evoked potentials in selective attention: critical evaluation of control conditions used for titrating by difference the cognitive P30, P40, P100 and N140. Electroencephalography and Clinical Neurophysiology/Evoked Potentials Section 74, 5 (1989), 321--346.",
      "doi": ""
    },
    {
      "text": "Jennifer K Dionne, Sean K Meehan, Wynn Legon, and W Richard Staines. 2010. Crossmodal influences in somatosensory cortex: interaction of vision and touch. Human brain mapping 31, 1 (2010), 14--25.",
      "doi": ""
    },
    {
      "text": "Frank H Durgin, Laurel Evans, Natalie Dunphy, Susan Klostermann, and Kristina Simmons. 2007. Rubber hands feel the touch of light. Psychological Science 18, 2 (2007), 152--157.",
      "doi": ""
    },
    {
      "text": "Dylan Edwards, Mar Cortes, Abhishek Datta, Preet Minhas, Eric M Wassermann, and Marom Bikson. 2013. Physiological and modeling evidence for focal transcranial electrical brain stimulation in humans: a basis for high-definition tDCS. Neuroimage 74 (2013), 266--275.",
      "doi": ""
    },
    {
      "text": "H. Enomoto, Y. Ugawa, R. Hanajima, K. Yuasa, H. Mochizuki, Y. Terao, Y. Shiio, T. Furubayashi, N.K. Iwata, and I. Kanazawa. 2001. Decreased sensory cortical excitability after 1 Hz rTMS over the ipsilateral primary motor cortex. Clinical Neurophysiology 112, 11 (Nov. 2001), 2154--2158.",
      "doi": ""
    },
    {
      "text": "A. J Fallgatter, Th. J Mueller, and W. K Strik. 1997. Neurophysiological correlates of mental imagery in different sensory modalities. International Journal of Psychophysiology 25, 2 (Feb. 1997), 145--153.",
      "doi": ""
    },
    {
      "text": "Douglas Fox. 2011. Neuroscience: brain buzz. Nature News 472, 7342 (2011), 156--159.",
      "doi": ""
    },
    {
      "text": "Alberto Gallace and Charles Spence. 2008. The cognitive and neural correlates of \"tactile consciousness\": A multisensory perspective. Consciousness and Cognition 17, 1 (March 2008), 370--407.",
      "doi": ""
    },
    {
      "text": "Bernhard Graimann, Brendan Allison, and Gert Pfurtscheller (Eds.). 2010. Brain-computer interfaces: revolutionizing human-computer interaction. Springer, Heidelberg. OCLC: ocn707710772.",
      "doi": ""
    },
    {
      "text": "Nir Grossman, David Bono, Nina Dedic, Suhasa B Kodandaramaiah, Andrii Rudenko, Ho-Jun Suk, Antonino M Cassara, Esra Neufeld, Niels Kuster, Li-Huei Tsai, et al. 2017. Noninvasive deep brain stimulation via temporally interfering electric fields. Cell 169, 6 (2017), 1029--1041.",
      "doi": ""
    },
    {
      "text": "Lisa Grundmann, Roman Rolke, Michael A. Nitsche, Goran Pavlakovic, Svenja Happe, Rolf-Detlef Treede, Walter Paulus, and Cornelius G. Bachmann. 2011. Effects of transcranial direct current stimulation of the primary sensory cortex on somatosensory perception. Brain Stimulation 4, 4 (Oct. 2011), 253--260.",
      "doi": ""
    },
    {
      "text": "Ville J Harjunen, Imtiaj Ahmed, Giulio Jacucci, Niklas Ravaja, and Michiel M Spapé. 2017. Manipulating Bodily Presence Affects CrossModal Spatial Attention: A Virtual-Reality-Based ERP Study. Frontiers in human neuroscience 11 (2017), 79.",
      "doi": ""
    },
    {
      "text": "David Hecht and Miriam Reiner. 2009. Sensory dominance in combinations of audio, visual and haptic stimuli. Experimental brain research 193, 2 (2009), 307--314.",
      "doi": ""
    },
    {
      "text": "Tobias Heed and Brigitte Röder. 2011. The body in a multisensory world. In The Neural Bases of Multisensory Processes, Micah M. Murray and Mark T. Wallace (Eds.). CRC Press/Taylor & Francis, Boca Raton, Chapter 28, 557--580.",
      "doi": ""
    },
    {
      "text": "Christoph S. Herrmann, Stefan Rach, Toralf Neuling, and Daniel Strüber. 2013. Transcranial alternating current stimulation: a review of the underlying mechanisms and modulation of cognitive processes. Frontiers in Human Neuroscience 7 (2013), 279.",
      "doi": ""
    },
    {
      "text": "Alexander Jones and Bettina Forster. 2013. Lost in vision: ERP correlates of exogenous tactile attention when engaging in a visualtask. Neuropsychologia 51, 4 (2013), 675--685.",
      "doi": ""
    },
    {
      "text": "Valer Jurcak, Daisuke Tsuzuki, and Ippeita Dan. 2007. 10/20, 10/10, and 10/5 systems revisited: their validity as relative head-surface-based positioning systems. Neuroimage 34, 4 (2007), 1600--1611.",
      "doi": ""
    },
    {
      "text": "Christian Keysers, Bruno Wicker, Valeria Gazzola, Jean-Luc Anton, Leonardo Fogassi, and Vittorio Gallese. 2004. A Touching Sight: SII/PV Activation during the Observation and Experience of Touch. Neuron 42, 2 (April 2004), 335--346.",
      "doi": ""
    },
    {
      "text": "C Kothe. 2013. The artifact subspace reconstruction method. Accessed: Jul 17 (2013), 2017.",
      "doi": ""
    },
    {
      "text": "Steven LaValle. 2016. Tracking. Cambridge University Press, Cambridge, Chapter 9, 239--275.",
      "doi": ""
    },
    {
      "text": "Benjamin Libet, WW Alberts, EW Wright, and B Feinstein. 1967. Responses of human somatosensory cortex to stimuli below threshold for conscious sensation. Science 158, 3808 (1967), 1597--1600.",
      "doi": ""
    },
    {
      "text": "Matthew R. Longo, Sean Cardozo, and Patrick Haggard. 2008. Visual enhancement of touch and the bodily self. Consciousness and Cognition 17, 4 (Dec. 2008), 1181--1191.",
      "doi": ""
    },
    {
      "text": "Matthew R Longo, Friederike Schüür, Marjolein PM Kammers, Manos Tsakiris, and Patrick Haggard. 2008. What is embodiment? A psychometric approach. Cognition 107, 3 (2008), 978--998.",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST '15. ACM Press, Daegu, Kyungpook, Republic of Korea, 11--19.  ",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, Denver, Colorado, USA, 1471--1482.  ",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Steven J Luck. 2005. Ten simple rules for designing ERP experiments. MIT Press, Bradford, Chapter 2, 17--32.",
      "doi": ""
    },
    {
      "text": "Kaoru Matsunaga, Michael A Nitsche, Sadatoshi Tsuji, and John C Rothwell. 2004. Effect of transcranial DC sensorimotor cortex stimulation on somatosensory evoked potentials in humans. Clinical Neurophysiology 115, 2 (Feb. 2004), 456--460.",
      "doi": ""
    },
    {
      "text": "Leap Motion. 2018. Home - Leap Motion. Available at: https://www. leapmotion.com. Accessed: 2018-09-05.",
      "doi": ""
    },
    {
      "text": "Javier Márquez-Ruiz, Claudia Ammann, Rocío Leal-Campanario, Giulio Ruffini, Agnès Gruart, and José M. Delgado-García. 2016. Synthetic tactile perception induced by transcranial alternating-current stimulation can substitute for natural sensory stimulus in behaving rabbits. Scientific Reports 6, 1 (April 2016), 19753.",
      "doi": ""
    },
    {
      "text": "Neuroelectrics. 2018. Products / ELECTRODES / NG GELTRODE - Neuroelectrics. Available at: https://www.neuroelectrics.com/products/ electrodes/ng-geltrode/. Accessed: 2018-09-05.",
      "doi": ""
    },
    {
      "text": "Neuroelectrics. 2018. Products / ENOBIO / ENOBIO 32 - Neuroelectrics. Available at: http://www.neuroelectrics.com/products/ enobio/enobio-32/. Accessed: 2018-09-06.",
      "doi": ""
    },
    {
      "text": "Neuroelectrics. 2018. Products / STARSTIM / STARSTIM 8 - Neuroelectrics. Available at: https://www.neuroelectrics.com/products/ starstim/starstim-8/. Accessed: 2018-09-06.",
      "doi": ""
    },
    {
      "text": "Femke Nijboer, Niels Birbaumer, and Andrea Kubler. 2010. The influence of psychological state and motivation on brain--computer interface performance in patients with amyotrophic lateral sclerosis--a longitudinal study. Frontiers in neuroscience 4 (2010), 55.",
      "doi": ""
    },
    {
      "text": "M. A. Nitsche and W. Paulus. 2000. Excitability changes induced in the human motor cortex by weak transcranial direct current stimulation. The Journal of Physiology 527 Pt 3 (Sept. 2000), 633--639.",
      "doi": ""
    },
    {
      "text": "M. A. Nitsche and W. Paulus. 2001. Sustained excitability elevations induced by transcranial DC motor cortex stimulation in humans. Neurology 57, 10 (Nov. 2001), 1899--1901.",
      "doi": ""
    },
    {
      "text": "Michael A. Nitsche, Astrid Schauenburg, Nicolas Lang, David Liebetanz, Cornelia Exner, Walter Paulus, and Frithjof Tergau. 2003. Facilitation of implicit motor learning by weak transcranial direct current stimulation of the primary motor cortex in the human. Journal of cognitive neuroscience 15, 4 (2003), 619--626.  ",
      "doi": "10.1162/089892903321662994"
    },
    {
      "text": "D. P. Purpura and J. G. Mcmurtry. 1965. Intracellular activities and evoked potential changes during polarization of motor cortex. Journal of Neurophysiology 28 (Jan. 1965), 166--185.",
      "doi": ""
    },
    {
      "text": "Yann Renard, Fabien Lotte, Guillaume Gibert, Marco Congedo, Emmanuel Maby, Vincent Delannoy, Olivier Bertrand, and Anatole Lécuyer. 2010. Openvibe: An open-source software platform to design, test, and use brain--computer interfaces in real and virtual environments. Presence: teleoperators and virtual environments 19, 1 (2010), 35--53.  ",
      "doi": "10.1162/pres.19.1.35"
    },
    {
      "text": "Tony Ro, Ruth Wallace, Judith Hagedorn, Alessandro Farné, and Elizabeth Pienkos. 2004. Visual Enhancing of Tactile Perception in the Posterior Parietal Cortex. Journal of Cognitive Neuroscience 16, 1 (Jan. 2004), 24--30.  ",
      "doi": "10.1162/089892904322755520"
    },
    {
      "text": "Andreas Rogalewski, Caterina Breitenstein, Michael A. Nitsche, Walter Paulus, and Stefan Knecht. 2004. Transcranial direct current stimulation disrupts tactile perception. European Journal of Neuroscience 20, 1 (2004), 313--316.",
      "doi": ""
    },
    {
      "text": "Maria V. Sanchez-Vives, Bernhard Spanlang, Antonio Frisoli, Massimo Bergamasco, and Mel Slater. 2010. Virtual Hand Illusion Induced by Visuomotor Correlations. PLOS ONE 5, 4 (April 2010), e10381.",
      "doi": ""
    },
    {
      "text": "Saeid Sanei and Jonathon A Chambers. 2013. EEG signal processing. John Wiley & Sons, Chippenham, Wiltshire.",
      "doi": ""
    },
    {
      "text": "Michael Schaefer, Hans-Jochen Heinze, and Michael Rotte. 2005. Viewing touch improves tactile sensory threshold:. NeuroReport 16, 4 (March 2005), 367--370.",
      "doi": ""
    },
    {
      "text": "Ruth Schubert, Felix Blankenburg, Steven Lemm, Arno Villringer, and Gabriel Curio. 2006. Now you feel it-now you don't: ERP correlates of somatosensory awareness. Psychophysiology 43, 1 (Jan. 2006), 31--40.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Daniel Perez-Marcos, H. Henrik Ehrsson, and Maria V. Sanchez-Vives. 2008. Towards a Digital Body: The Virtual Arm Illusion. Frontiers in Human Neuroscience 2 (Aug. 2008), 6.",
      "doi": ""
    },
    {
      "text": "Mel Slater and Maria V Sanchez-Vives. 2016. Enhancing our lives with immersive virtual reality. Frontiers in Robotics and AI 3 (2016), 74.",
      "doi": ""
    },
    {
      "text": "Shravani Sur and VK Sinha. 2009. Event-related potential: An overview. Industrial psychiatry journal 18, 1 (2009), 70.",
      "doi": ""
    },
    {
      "text": "F. Uhl, T. Kretschmer, G. Lindinger, G. Goldenberg, W. Lang, W. Oder, and L. Deecke. 1994. Tactile mental imagery in sighted persons and in patients suffering from peripheral blindness early in life. Electroencephalography and Clinical Neurophysiology 91, 4 (Oct. 1994), 249--255.",
      "doi": ""
    },
    {
      "text": "B. Vaseghi, M. Zoghi, and S. Jaberzadeh. 2014. Does anodal transcranial direct current stimulation modulate sensory perception and pain? A meta-analysis study. Clinical Neurophysiology 125, 9 (Sept. 2014), 1847-- 1858.",
      "doi": ""
    },
    {
      "text": "Nicolás von Ellenrieder, Jonathan Dan, Birgit Frauscher, and Jean Gotman. 2016. Sparse asynchronous cortical generators can produce measurable scalp EEG signals. NeuroImage 138 (2016), 123--133.",
      "doi": ""
    },
    {
      "text": "Filip Skola and Fotis Liarokapis. 2016. Examining the effect of body ownership in immersive virtual and augmented reality environments. The Visual Computer 32, 6--8 (June 2016), 761--770.  ",
      "doi": "10.1007/s00371-016-1246-8"
    },
    {
      "text": "Ye Wang, Ying Hao, Junhong Zhou, Peter J. Fried, Xiaoying Wang, Jue Zhang, Jing Fang, Alvaro Pascual-Leone, and Brad Manor. 2015. Direct current stimulation over the human sensorimotor cortex modulates the brain's hemodynamic response to tactile stimulation. The European journal of neuroscience 42, 3 (Aug. 2015), 1933--1940.",
      "doi": ""
    },
    {
      "text": "Geoffrey F Woodman. 2010. A brief introduction to the use of eventrelated potentials in studies of perception and attention. Attention, Perception, & Psychophysics 72, 8 (2010), 2031--2046.",
      "doi": ""
    },
    {
      "text": "A. J. Woods, A. Antal, M. Bikson, P. S. Boggio, A. R. Brunoni, P. Celnik, L. G. Cohen, F. Fregni, C. S. Herrmann, E. S. Kappenman, H. Knotkova, D. Liebetanz, C. Miniussi, P. C. Miranda, W. Paulus, A. Priori, D. Reato, C. Stagg, N. Wenderoth, and M. A. Nitsche. 2016. A technical guide to tDCS, and related non-invasive brain stimulation tools. Clinical Neurophysiology 127, 2 (Feb. 2016), 1031--1048.",
      "doi": ""
    },
    {
      "text": "Seung-Schik Yoo, Daniel K. Freeman, James J. III McCarthy, and Ferenc A. Jolesz. 2003. Neural substrates of tactile imagery: a functional MRI study. NeuroReport 14, 4 (March 2003), 581.",
      "doi": ""
    }
  ]
}