{
  "doi": "10.1145/3290605.3300304",
  "title": "Causeway: Scaling Situated Learning with Micro-Role Hierarchies",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "While educational technologies such as MOOCs have helped scale content-based learning, scaling situated learning is still challenging. The time it takes to define a real-world project and to mentor learners is often prohibitive, especially given the limited contributions that novices are able to make. This paper introduces micro-role hierarchies, a form of coordination that integrates workflows and hierarchies to help short-term novices predictably contribute to complex projects. Individuals contribute through micro-roles, small experiential assignments taking roughly 2 hours. These micro-roles support execution of the desired work process, but also sequence into learning pathways, resulting in a learning dynamic similar to moving up an organizational hierarchy. We demonstrate micro-role hierarchies through Causeway, a platform for learning web development while building websites for nonprofits. We carry out a proof-of-concept study in which learners built static websites for refugee resettlement agencies in 2 hour long roles.",
  "tags": [
    "social computing",
    "situated learning",
    "learnersourcing",
    "crowdsourcing",
    "micro-role hierarchies",
    "learning-at-scale",
    "complex crowd work"
  ],
  "authors": [
    {
      "name": "David T. Lee",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365716",
      "orcid": "missing"
    },
    {
      "name": "Emily S. Hamedian",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365644",
      "orcid": "missing"
    },
    {
      "name": "Greg Wolff",
      "institution": "University of California, Santa Cruz, Santa Cruz, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366214",
      "orcid": "missing"
    },
    {
      "name": "Amy Liu",
      "institution": "LinkedIn, Sunnyvale, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366794",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. Upwork. https://www.upwork.com/. (2017).",
      "doi": ""
    },
    {
      "text": "Paul André, Aniket Kittur, and Steven P Dow. 2014. Crowd Synthesis: Extracting Categories and Clusters from Complex Data. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 989--998.  ",
      "doi": "10.1145/2531602.2531653"
    },
    {
      "text": "John Seely Brown. 2018. Pardee RAND Commencement Speech 2018. http://www.johnseelybrown.com/JSBpardeerand.html. (June 2018). Accessed: 2018--9--10.",
      "doi": ""
    },
    {
      "text": "John Seely Brown, Allan Collins, and Paul Duguid. 1989. Situated Cognition and the Culture of Learning. Educ. Res. 18, 1 (Jan. 1989), 32--42.",
      "doi": ""
    },
    {
      "text": "G Chen, D Davis, M Krause, E Aivaloglou, C Hauff, and G Houben. 2018. From Learners to Earners: Enabling MOOC Learners to Apply Their Skills and Earn Money in an Online Market Place. IEEE Trans. Learn. Technol. 11, 2 (April 2018), 264--274.",
      "doi": ""
    },
    {
      "text": "Lydia B Chilton, Greg Little, Darren Edge, Daniel S Weld, and James A Landay. 2013. Cascade: Crowdsourcing Taxonomy Creation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 1999--2008.  ",
      "doi": "10.1145/2470654.2466265"
    },
    {
      "text": "Allan Collins, John Seely Brown, and Susan E Newman. 1989. Cognitive apprenticeship: Teaching the crafts of reading, writing, and mathematics. Knowing, learning, and instruction: Essays in honor of Robert Glaser 18 (1989), 32--42.",
      "doi": ""
    },
    {
      "text": "Seth Cooper, Firas Khatib, Adrien Treuille, Janos Barbero, Jeehyung Lee, Michael Beenen, Andrew Leaver-Fay, David Baker, Zoran Popovi?, and Foldit Players. 2010. Predicting protein structures with a multiplayer online game. Nature 466, 7307 (Aug. 2010), 756--760.",
      "doi": ""
    },
    {
      "text": "John Dewey. 2004. Democracy and Education. Courier Corporation.",
      "doi": ""
    },
    {
      "text": "John Dewey. 2007. Experience And Education. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Mira Dontcheva, Robert R Morris, Joel R Brandt, and Elizabeth M Gerber. 2014. Combining Crowdsourcing and Learning to Improve Engagement and Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3379--3388.  ",
      "doi": "10.1145/2556288.2557217"
    },
    {
      "text": "K Anders Ericsson, Ralf T Krampe, and Clemens Tesch-Römer. 1993. The role of deliberate practice in the acquisition of expert performance. Psychol. Rev. 100, 3 (1993), 363.",
      "doi": ""
    },
    {
      "text": "Thommy Eriksson, Tom Adawi, and Christian Stöhr. 2017. \"Time is the bottleneck\": a qualitative study exploring why learners drop out of MOOCs. Journal of Computing in Higher Education 29, 1 (April 2017), 133--146.",
      "doi": ""
    },
    {
      "text": "Elena L Glassman, Aaron Lin, Carrie J Cai, and Robert C Miller. 2016. Learnersourcing Personalized Hints. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1626--1636.  ",
      "doi": "10.1145/2818048.2820011"
    },
    {
      "text": "Daniel Haas, Jason Ansel, Lydia Gu, and Adam Marcus. 2015. Argonaut: Macrotask Crowdsourcing for Complex Data Processing. Proceedings VLDB Endowment 8, 12 (Aug. 2015), 1642--1653.  ",
      "doi": "10.14778/2824032.2824062"
    },
    {
      "text": "Margeret Hall, Michelle Friend, and Markus Krause. 2018. Microinternships on the Margins. In Universal Access in Human-Computer Interaction. Virtual, Augmented, and Intelligent Environments. Springer International Publishing, 486--495.",
      "doi": ""
    },
    {
      "text": "Christoph Hannebauer. 2016. Contribution Barriers to Open Source Projects. Ph.D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Christoph Hannebauer, Vincent Wolff-Marting, and Volker Gruhn. 2010. Towards a Pattern Language for FLOSS Development. In Proceedings of the 17th Conference on Pattern Languages of Programs (PLOP '10). ACM, New York, NY, USA, 15:1--15:10.  ",
      "doi": "10.1145/2493288.2493303"
    },
    {
      "text": "Kate S Hone and Ghada R El Said. 2016. Exploring the factors affecting MOOC retention: A survey study. Comput. Educ. 98 (July 2016), 157-- 168.  ",
      "doi": "10.1016/j.compedu.2016.03.016"
    },
    {
      "text": "Kim, Juho, and Ph. D. Massachusetts Institute of Technology. 2015. Learnersourcing : improving learning with collective learner activity. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Joy Kim, Justin Cheng, and Michael S Bernstein. 2014. Ensemble: Exploring Complementary Strengths of Leaders and Crowds in Creative Collaboration. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 745--755.  ",
      "doi": "10.1145/2531602.2531638"
    },
    {
      "text": "René F Kizilcec, Andrew J Saltarelli, Justin Reich, and Geoffrey L Cohen. 2017. Closing global achievement gaps in MOOCs. Science 355, 6322 (Jan. 2017), 251--252.",
      "doi": ""
    },
    {
      "text": "Markus Krause, Doris Schiöberg, and Jan David Smeddinck. 2018. Mooqita: Empowering Hidden Talents with a Novel Work-Learn Model. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, CS14.  ",
      "doi": "10.1145/3170427.3174351"
    },
    {
      "text": "Jean Lave, Etienne Wenger, and Etienne Wenger. 1991. Situated learning: Legitimate peripheral participation. Vol. 521423740. Cambridge university press Cambridge.",
      "doi": ""
    },
    {
      "text": "Kurt Luther and Amy Bruckman. 2008. Leadership in Online Creative Collaboration. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, New York, NY, USA, 343--352.  ",
      "doi": "10.1145/1460563.1460619"
    },
    {
      "text": "Kurt Luther, Nathan Hahn, Steven P Dow, and Aniket Kittur. 2015. Crowdlines: Supporting synthesis of diverse information sources through crowdsourced outlines. In Third AAAI Conference on Human Computation and Crowdsourcing. aaai.org.",
      "doi": ""
    },
    {
      "text": "W Maass. 2004. Inside an open source software community: empirical analysis on individual and group level. Proceedings of the 4th Workshop on Open Source (Jan. 2004), 65--70.",
      "doi": ""
    },
    {
      "text": "J Maloney, L Burd, Y Kafai, N Rusk, B Silverman, and M Resnick. 2004. Scratch: a sneak preview {education}. In Proceedings. Second International Conference on Creating, Connecting and Collaborating through Computing, 2004. ieeexplore.ieee.org, 104--109. ",
      "doi": "10.5555/1009376.1009408"
    },
    {
      "text": "A Mockus, R T Fielding, and J Herbsleb. 2000. A case study of open source software development: the Apache server. In Proceedings of the 2000 International Conference on Software Engineering. ICSE 2000 the New Millennium. ieeexplore.ieee.org, 263--272.  ",
      "doi": "10.1145/337180.337209"
    },
    {
      "text": "A Pendleton-Jullian and J S Brown. 2016. Pragmatic Imagination. Vol. 1367563127. Blurb.",
      "doi": ""
    },
    {
      "text": "Lee Rainie and Janna Anderson. 2017. The Future of Jobs and Jobs Training. http://www.pewinternet.org/2017/05/03/ the-future-of-jobs-and-jobs-training/. (May 2017). Accessed: 2017--6--9.",
      "doi": ""
    },
    {
      "text": "Christian Robottom Reis and Renata Pontin de Mattos Fortes. 2002. An overview of the software engineering process and tools in the Mozilla project. In Proceedings of the Open Source Software Development Workshop. ics.uci.edu, 155--175.",
      "doi": ""
    },
    {
      "text": "Daniela Retelny, Michael S Bernstein, and Melissa A Valentine. 2017. No workflow can ever be enough: How crowdsourcing workflows constrain complex work. ACM, New York, NY, USA (2017).",
      "doi": "10.1145/3134724"
    },
    {
      "text": "Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S Bernstein. 2014. Expert Crowdsourcing with Flash Teams. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 75--85.  ",
      "doi": "10.1145/2642918.2647409"
    },
    {
      "text": "Niloufar Salehi and Michael S Bernstein. 2018. Hive: Collective Design Through Network Rotation. Proc. ACM Hum. -Comput. Interact. 2, CSCW (Nov. 2018), 151:1--151:26.  ",
      "doi": "10.1145/3274420"
    },
    {
      "text": "Niloufar Salehi, Andrew McCabe, Melissa Valentine, and Michael Bernstein. 2017. Huddler: Convening Stable and Familiar Crowd Teams Despite Unpredictable Availability. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 1700--1713.  ",
      "doi": "10.1145/2998181.2998300"
    },
    {
      "text": "Robert Simpson, Kevin R Page, and David De Roure. 2014. Zooniverse: Observing the World's Largest Citizen Science Platform. In Proceedings of the 23rd International Conference on World Wide Web (WWW '14 Companion). ACM, New York, NY, USA, 1049--1054.  ",
      "doi": "10.1145/2567948.2579215"
    },
    {
      "text": "Igor Steinmacher, Marco Aurélio Graciotto Silva, and Marco Aurélio Gerosa. 2014. Barriers Faced by Newcomers to Open Source Projects: A Systematic Review. In OSS. 153--163.",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and Situated Actions: The Problem of Human-Machine Communication. Cambridge University Press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Rajan Vaish, Snehalkumar (neil) S Gaikwad, Geza Kovacs, Andreas Veit, Ranjay Krishna, Imanol Arrieta Ibarra, Camelia Simoiu, Michael Wilber, Serge Belongie, Sharad Goel, James Davis, and Michael S Bernstein. 2017. Crowd Research: Open and Scalable University Laboratories. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 829--843.  ",
      "doi": "10.1145/3126594.3126648"
    },
    {
      "text": "Rajan Vaish, Shirish Goyal, Amin Saberi, and Sharad Goel. 2018. Creating Crowdsourced Research Talks at Scale. In Proceedings of the 2018 World Wide Web Conference on World Wide Web. rajanvaish.com, 1--11.  ",
      "doi": "10.1145/3178876.3186031"
    },
    {
      "text": "Melissa A Valentine, Daniela Retelny, Alexandra To, Negar Rahmati, Tulsee Doshi, and Michael S Bernstein. 2017. Flash Organizations: Crowdsourcing Complex Work by Structuring Crowds As Organizations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3523--3537.  ",
      "doi": "10.1145/3025453.3025811"
    },
    {
      "text": "Luis von Ahn. 2013. Duolingo: Learn a Language for Free While Helping to Translate the Web. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13). ACM, New York, NY, USA, 1--2.  ",
      "doi": "10.1145/2449396.2449398"
    },
    {
      "text": "Georg von Krogh, Sebastian Spaeth, and Karim R Lakhani. 2003. Community, joining, and specialization in open source software innovation: a case study. Res. Policy 32, 7 (July 2003), 1217--1241.",
      "doi": ""
    },
    {
      "text": "M Mitchell Waldrop. 2013. Online learning: Campus 2.0. Nature 495, 7440 (March 2013), 160--163.",
      "doi": ""
    },
    {
      "text": "Max Weber. 2009. The Theory Of Social And Economic Organization. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Sarah Weir, Juho Kim, Krzysztof Z Gajos, and Robert C Miller. 2015. Learnersourcing Subgoal Labels for How-to Videos. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 405--416.  ",
      "doi": "10.1145/2675133.2675219"
    },
    {
      "text": "Etienne Wenger. 1998. Communities of Practice: Learning, Meaning, and Identity. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Joseph Jay Williams, Juho Kim, Anna Rafferty, Samuel Maldonado, Krzysztof Z Gajos, Walter S Lasecki, and Neil Heffernan. 2016. AXIS: Generating Explanations at Scale with Learnersourcing and Machine Learning. In Proceedings of the Third (2016) ACM Conference on Learning @ Scale (L@S '16). ACM, New York, NY, USA, 379--388.  ",
      "doi": "10.1145/2876034.2876042"
    },
    {
      "text": "Yunwen Ye and Kouichi Kishida. 2003. Toward an Understanding of the Motivation Open Source Software Developers. In Proceedings of the 25th International Conference on Software Engineering (ICSE '03). IEEE Computer Society, Washington, DC, USA, 419--429. ",
      "doi": "10.5555/776816.776867"
    },
    {
      "text": "Haoqi Zhang, Matthew W Easterday, Elizabeth M Gerber, Daniel Rees Lewis, and Leesha Maliakal. 2017. Agile Research Studios: Orchestrating Communities of Practice to Advance Research Training. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion). ACM, New York, NY, USA, 45--48.  ",
      "doi": "10.1145/3022198.3023265"
    },
    {
      "text": "Sharon Zhou, Melissa Valentine, and Michael S Bernstein. 2018. In Search of the Dream Team: Temporally Constrained Multi-Armed Bandits for Identifying Effective Team Structures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 108:1--108:13.  ",
      "doi": "10.1145/3173574.3173682"
    }
  ]
}