{
  "doi": "10.1145/3290605.3300288",
  "title": "A Comparison of Notification Techniques for Out-of-View Objects in Full-Coverage Displays",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Full-coverage displays can place visual content anywhere on the interior surfaces of a room (e.g., a weather display near the coat stand). In these settings, digital artefacts can be located behind the user and out of their field of view - meaning that it can be difficult to notify the user when these artefacts need attention. Although much research has been carried out on notification, little is known about how best to direct people to the necessary location in room environments. We designed five diverse attention-guiding techniques for full-coverage display rooms, and evaluated them in a study where participants completed search tasks guided by the different techniques. Our study provides new results about notification in full-coverage displays: we showed benefits of persistent visualisations that could be followed all the way to the target and that indicate distance-to-target. Our findings provide useful information for improving the usability of interactive full-coverage environments.",
  "tags": [
    "smart rooms",
    "guiding",
    "spatial notification",
    "target finding",
    "wedges",
    "full-coverage displays"
  ],
  "authors": [
    {
      "name": "Julian Petford",
      "institution": "University of St Andrews, St Andrews, Scotland",
      "img": "/do/10.1145/contrib-99659040075/rel-imgonly/img.jpg",
      "acmid": "99659040075",
      "orcid": "missing"
    },
    {
      "name": "Iain Carson",
      "institution": "University of St Andrews, St Andrews, Scotland",
      "img": "/do/10.1145/contrib-99659365543/rel-imgonly/img_6898_1.jpg",
      "acmid": "99659365543",
      "orcid": "missing"
    },
    {
      "name": "Miguel A. Nacenta",
      "institution": "University of St Andrews, St Andrews, Scotland",
      "img": "/do/10.1145/contrib-81100377766/rel-imgonly/dsc_7149-small.png",
      "acmid": "81100377766",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Petra Ahde and Jussi Mikkonen. 2008. Hello: Bracelets Communicating Nearby Presence of Friends. In Proceedings of the Tenth Anniversary Conference on Participatory Design 2008 (PDC '08). Indiana University, IN, USA, 324--325. http://dl.acm.org/citation.cfm?id=1795234.1795326 ",
      "doi": "10.5555/1795234.1795326"
    },
    {
      "text": "Mark Altosaar, Roel Vertegaal, Changuk Sohn, and Daniel Cheng. 2006. AuraOrb: Social Notification Appliance. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, New York, NY, USA, 381--386.  ",
      "doi": "10.1145/1125451.1125533"
    },
    {
      "text": "Mark Altosaar, Roel Vertegaal, Changuk Sohn, and Daniel Cheng. 2006. AuraOrb: Using Social Awareness Cues in the Design of Progressive Notification Appliances. In Proceedings of the 18th Australia Conference on Computer-Human Interaction: Design: Activities, Artefacts and Environments (OZCHI '06). ACM, New York, NY, USA, 159--166.  ",
      "doi": "10.1145/1228175.1228204"
    },
    {
      "text": "Richard Bates, M. Donegan, H. O. Istance, J. P. Hansen, and K.-J. Räihä. 2007. Introducing COGAIN: communication by gaze interaction. Universal Access in the Information Society 6, 2 (01 Sep 2007), 159--166.  ",
      "doi": "10.1007/s10209-007-0077-9"
    },
    {
      "text": "Patrick Baudisch and Ruth Rosenholtz. 2003. Halo: A Technique for Visualizing Off-screen Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 481--488.  ",
      "doi": "10.1145/642611.642695"
    },
    {
      "text": "Stefano Burigat and Luca Chittaro. 2007. Navigation in 3D Virtual Environments: Effects of User Experience and Location-pointing Navigation Aids. Int. J. Hum.-Comput. Stud. 65, 11 (Nov. 2007), 945--958.  ",
      "doi": "10.1016/j.ijhcs.2007.07.003"
    },
    {
      "text": "Andreas Butz, Michael Schneider, and Mira Spassova. 2004. SearchLight -- A Lightweight Search Function for Pervasive Environments. In Pervasive Computing, Alois Ferscha and Friedemann Mattern (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 351--356.",
      "doi": ""
    },
    {
      "text": "Christopher S. Campbell and Peter Tarasewich. 2004. Designing Visual Notification Cues for Mobile Devices. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, New York, NY, USA, 1199--1202.  ",
      "doi": "10.1145/985921.986023"
    },
    {
      "text": "Marta G. Carcedo, Soon Hau Chua, Simon Perrault, Pawel Wozniak, Raj Joshi, Mohammad Obaid, Morten Fjeld, and Shengdong Zhao. 2016. HaptiColor: Interpolating Color Information As Haptic Feedback to Assist the Colorblind. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 3572--3583.  ",
      "doi": "10.1145/2858036.2858220"
    },
    {
      "text": "Angela Chang, Ben Resner, Brad Koerner, XingChen Wang, and Hiroshi Ishii. 2001. LumiTouch: An Emotional Communication Device. In CHI '01 Extended Abstracts on Human Factors in Computing Systems (CHI EA '01). ACM, New York, NY, USA, 313--314.  ",
      "doi": "10.1145/634067.634252"
    },
    {
      "text": "Luca Chittaro and Stefano Burigat. 2004. 3D Location-pointing As a Navigation Aid in Virtual Environments. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '04). ACM, New York, NY, USA, 267--274.  ",
      "doi": "10.1145/989863.989910"
    },
    {
      "text": "Carolina Cruz-Neira, Daniel J. Sandin, Thomas A. DeFanti, Robert V. Kenyon, and John C. Hart. 1992. The CAVE: Audio Visual Experience Automatic Virtual Environment. Commun. ACM 35, 6 (June 1992), 64--72.  ",
      "doi": "10.1145/129888.129892"
    },
    {
      "text": "Andreas Rene Fender, Hrvoje Benko, and Andy Wilson. 2017. MeetAlive: Room-Scale Omni-Directional Display System for Multi-User Content and Control Sharing. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY, USA, 106--115.  ",
      "doi": "10.1145/3132272.3134117"
    },
    {
      "text": "Jutta Fortmann, Vanessa Cobus, Wilko Heuten, and Susanne Boll. 2014. WaterJewel: Be Aware of Your Daily Servings of Water with an LED illuminated Bracelet. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '14). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), ICST, Brussels, Belgium, Belgium, 195--196.  ",
      "doi": "10.4108/icst.pervasivehealth.2014.255270"
    },
    {
      "text": "Jutta Fortmann, Heiko Müller, Susanne Boll, and Wilko Heuten. 2013. Illumee: Aesthetic Light Bracelet As a Wearable Information Display for Everyday Life. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication (UbiComp '13 Adjunct). ACM, New York, NY, USA, 393--396.  ",
      "doi": "10.1145/2494091.2495970"
    },
    {
      "text": "Jutta Fortmann, Heiko Müller, Wilko Heuten, and Susanne Boll. 2014. How to Present Information on Wrist-worn Point-light Displays. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, New York, NY, USA, 955--958.  ",
      "doi": "10.1145/2639189.2670249"
    },
    {
      "text": "Hind Gacem, Gilles Bailly, James Eagan, and Eric Lecolinet. 2015. Finding Objects Faster in Dense Environments Using a Projection Augmented Robotic Arm. In Human-Computer Interaction -- INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Springer International Publishing, Cham, 221--238.  ",
      "doi": "10.1007/978-3-319-22698-9_15"
    },
    {
      "text": "Richard Langton Gregory, John Zachary Young, and Hugh Christopher Longuet-Higgins. 1968. Perceptual illusions and brain models. Proceedings of the Royal Society of London B: Biological Sciences 171, 1024, 279--296.",
      "doi": ""
    },
    {
      "text": "Uwe Gruenefeld, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2017. Visualizing Out-of-view Objects in Head-mounted Augmented Reality. In Proceedings of the 19th International Conference on HumanComputer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, Article 81, 7 pages.  ",
      "doi": "10.1145/3098279.3122124"
    },
    {
      "text": "Uwe Gruenefeld, Dag Ennenga, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2017. EyeSee360: Designing a Visualization Technique for Out-of-view Objects in Head-mounted Augmented Reality. In Proceedings of the 5th Symposium on Spatial User Interaction (SUI '17). ACM, New York, NY, USA, 109--118.  ",
      "doi": "10.1145/3131277.3132175"
    },
    {
      "text": "Sean Gustafson, Patrick Baudisch, Carl Gutwin, and Pourang Irani. 2008. Wedge: Clutter-free Visualization of Off-screen Locations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 787--796.  ",
      "doi": "10.1145/1357054.1357179"
    },
    {
      "text": "Sean G. Gustafson and Pourang P. Irani. 2007. Comparing Visualizations for Tracking Off-screen Moving Targets. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, New York, NY, USA, 2399--2404.  ",
      "doi": "10.1145/1240866.1241014"
    },
    {
      "text": "Carl Gutwin, Andy Cockburn, and Ashley Coveney. 2017. Peripheral Popout: The Influence of Visual Angle and Stimulus Intensity on Popout Effects. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 208--219.  ",
      "doi": "10.1145/3025453.3025984"
    },
    {
      "text": "Mark Hancock, Miguel Nacenta, Carl Gutwin, and Sheelagh Carpendale. 2009. The Effects of Changing Projection Geometry on the Interpretation of 3D Orientation on Tabletops. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces (ITS '09). ACM, New York, NY, USA, 157--164.  ",
      "doi": "10.1145/1731903.1731934"
    },
    {
      "text": "Rebecca Hansson and Peter Ljungstrand. 2000. The Reminder Bracelet: Subtle Notification Cues for Mobile Devices. In CHI '00 Extended Abstracts on Human Factors in Computing Systems (CHI EA '00). ACM, New York, NY, USA, 323--324.  ",
      "doi": "10.1145/633292.633488"
    },
    {
      "text": "Hyungeun Jo, Sungjae Hwang, Hyunwoo Park, and Jung-hee Ryu. 2011. Mobile Augmented Reality: Aroundplot: Focus+Context Interface for Off-screen Objects in 3D Environments. Comput. Graph. 35, 4 (Aug. 2011), 841--853.  ",
      "doi": "10.1016/j.cag.2011.04.005"
    },
    {
      "text": "Brad Johanson, Armando Fox, and Terry Winograd. 2002. The Interactive Workspaces Project: Experiences with Ubiquitous Computing Rooms. IEEE Pervasive Computing 1, 2 (April 2002), 67--74.  ",
      "doi": "10.1109/MPRV.2002.1012339"
    },
    {
      "text": "Brett R. Jones, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2013. IllumiRoom: Peripheral Projected Illusions for Interactive Experiences. In ACM SIGGRAPH 2013 Emerging Technologies (SIGGRAPH '13). ACM, New York, NY, USA, Article 7, 1 pages.  ",
      "doi": "10.1145/2503368.2503375"
    },
    {
      "text": "Lee Jones, John McClelland, Phonesavanh Thongsouksanoumane, and Audrey Girouard. 2017. Ambient Notifications with Shape Changing Circuits in Peripheral Locations. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY, USA, 405--408.  ",
      "doi": "10.1145/3132272.3132291"
    },
    {
      "text": "Kazuki Kobayashi and Seiji Yamada. 2013. Shape Changing Device for Notification. In Proceedings of the Adjunct Publication of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13 Adjunct). ACM, New York, NY, USA, 71--72.  ",
      "doi": "10.1145/2508468.2514715"
    },
    {
      "text": "Magic Leap. 2018. Magic Leap One: Creator Edition | Magic Leap. https://www.magicleap.com/magic-leap-one",
      "doi": ""
    },
    {
      "text": "Yen-Chen Lin, Yung-Ju Chang, Hou-Ning Hu, Hsien-Tzu Cheng, ChiWen Huang, and Min Sun. 2017. Tell Me Where to Look: Investigating Ways for Assisting Focus in 360? Video. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2535--2545.  ",
      "doi": "10.1145/3025453.3025757"
    },
    {
      "text": "Yung-Ta Lin, Yi-Chi Liao, Shan-Yuan Teng, Yi-Ju Chung, Liwei Chan, and Bing-Yu Chen. 2017. Outside-In: Visualizing Out-of-Sight Regionsof-Interest in a 360 Video Using Spatial Picture-in-Picture Previews. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 255--265.  ",
      "doi": "10.1145/3126594.3126656"
    },
    {
      "text": "Paul P. Maglio and Christopher S. Campbell. 2000. Tradeoffs in Displaying Peripheral Information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 241--248.  ",
      "doi": "10.1145/332040.332438"
    },
    {
      "text": "Shizuko Matsuzoe, Shan Jiang, Miwa Ueki, and Keiju Okabayashi. 2017. Intuitive Visualization Method for Locating Off-screen Objects Inspired by Motion Perception in Peripheral Vision. In Proceedings of the 8th Augmented Human International Conference (AH '17). ACM, New York, NY, USA, Article 29, 4 pages.  ",
      "doi": "10.1145/3041164.3041198"
    },
    {
      "text": "Andrii Matviienko, Andreas Löcken, Abdallah El Ali, Wilko Heuten, and Susanne Boll. 2016. NaviLight: Investigating Ambient Light Displays for Turn-by-turn Navigation in Cars. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16). ACM, New York, NY, USA, 283-- 294.  ",
      "doi": "10.1145/2935334.2935359"
    },
    {
      "text": "Microsoft. 2018. Microsoft HoloLens | The Leader in Mixed Reality Technology. https://www.microsoft.com/en-us/hololens",
      "doi": ""
    },
    {
      "text": "Heiko Müller, Andreas Löcken, Wilko Heuten, and Susanne Boll. 2014. Sparkle: An Ambient Light Display for Dynamic Off-screen Points of Interest. In Proceedings of the 8th Nordic Conference on HumanComputer Interaction: Fun, Fast, Foundational (NordiCHI '14). ACM, New York, NY, USA, 51--60.  ",
      "doi": "10.1145/2639189.2639205"
    },
    {
      "text": "Miguel A. Nacenta, Dzmitry Aliakseyeu, Sriram Subramanian, and Carl Gutwin. 2005. A Comparison of Techniques for Multi-display Reaching. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, New York, NY, USA, 371--380.  ",
      "doi": "10.1145/1054972.1055024"
    },
    {
      "text": "Miguel A. Nacenta, Mark Hancock, Carl Gutwin, and Sheelagh Carpendale. 2016. The Effects of Changing Projection Geometry on Perception of 3D Objects on and Around Tabletops. ACM Trans. Comput.-Hum. Interact. 23, 2, Article 11 (May 2016), 54 pages.  ",
      "doi": "10.1145/2845081"
    },
    {
      "text": "Miguel A. Nacenta, Satoshi Sakurai, Tokuo Yamaguchi, Yohei Miki, Yuichi Itoh, Yoshifumi Kitamura, Sriram Subramanian, and Carl Gutwin. 2007. E-conic: A Perspective-aware Interface for Multi-display Environments. In Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology (UIST '07). ACM, New York, NY, USA, 279--288.  ",
      "doi": "10.1145/1294211.1294260"
    },
    {
      "text": "Julian Petford, Miguel A. Nacenta, and Carl Gutwin. 2018. Pointing All Around You: Selection Performance of Mouse and Ray-Cast Pointing in Full-Coverage Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 533, 14 pages.  ",
      "doi": "10.1145/3173574.3174107"
    },
    {
      "text": "Julian Petford, Miguel A. Nacenta, Carl Gutwin, Joseph Eremondi, and Cody Ede. 2016. The ASPECTA Toolkit: Affordable Full Coverage Displays. In Proceedings of the 5th ACM International Symposium on Pervasive Displays (PerDis '16). ACM, New York, NY, USA, 87--105.  ",
      "doi": "10.1145/2914920.2915006"
    },
    {
      "text": "Ioannis Politis, Stephen Brewster, and Frank Pollick. 2015. Languagebased Multimodal Displays for the Handover of Control in Autonomous Cars. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '15). ACM, New York, NY, USA, 3--10.  ",
      "doi": "10.1145/2799250.2799262"
    },
    {
      "text": "Luis C. Populin. 2008. Human sound localization: measurements in untrained, head-unrestrained subjects using gaze as a pointer. Experimental Brain Research 190, 1 (01 Sep 2008), 11--30.",
      "doi": ""
    },
    {
      "text": "Kathrin Probst, Michael Haller, Kentaro Yasu, Maki Sugimoto, and Masahiko Inami. 2013. Move-it Sticky Notes Providing Active Physical Feedback Through Motion. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI '14). ACM, New York, NY, USA, 29--36.  ",
      "doi": "10.1145/2540930.2540932"
    },
    {
      "text": "Matti Rantanen, Antti Oulasvirta, Jan Blom, Sauli Tiitta, and Martti Mäntylä. 2004. InfoRadar: Group and Public Messaging in the Mobile Context. In Proceedings of the Third Nordic Conference on Humancomputer Interaction (NordiCHI '04). ACM, New York, NY, USA, 131-- 140.  ",
      "doi": "10.1145/1028014.1028035"
    },
    {
      "text": "Ramesh Raskar, Greg Welch, Matt Cutts, Adam Lake, Lev Stesin, and Henry Fuchs. 1998. The Office of the Future: A Unified Approach to Image-based Modeling and Spatially Immersive Displays. In Proceedings of the 25th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '98). ACM, New York, NY, USA, 179--188.  ",
      "doi": "10.1145/280814.280861"
    },
    {
      "text": "Jun Rekimoto and Masanori Saitoh. 1999. Augmented Surfaces: A Spatially Continuous Work Space for Hybrid Computing Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Massimo Scolari. 2012. Oblique drawing: A history of anti-perspective. MIT press.",
      "doi": ""
    },
    {
      "text": "Saqib Shah. 2016. Facebook now lets you guide viewers around your 360-degree video. https://www.digitaltrends.com/social-media/ facebook-360-video-tools-analytics/",
      "doi": ""
    },
    {
      "text": "A. Sheikh. 2016. Directing attention in 360-degree video. IET Conference Proceedings (January 2016), 29 (9 .)--29 (9 .)(1).",
      "doi": ""
    },
    {
      "text": "Teresa Siu and Valeria Herskovic. 2013. SidebARs: Improving Awareness of Off-screen Elements in Mobile Augmented Reality. In Proceedings of the 2013 Chilean Conference on Human - Computer Interaction (ChileCHI '13). ACM, New York, NY, USA, 36--41.  ",
      "doi": "10.1145/2535597.2535608"
    },
    {
      "text": "Richard Stoakley, Matthew J. Conway, and Randy Pausch. 1995. Virtual Reality on a WIM: Interactive Worlds in Miniature. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 265--272.  ",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Norbert A. Streitz, Jörg Gei, Torsten Holmer, Shin'ichi Konomi, Christian Müller-Tomfelde, Wolfgang Reischl, Petra Rexroth, Peter Seitz, and Ralf Steinmetz. 1999. i-LAND: An Interactive Landscape for Creativity and Innovation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99). ACM, New York, NY, USA, 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Peter Tarasewich, Christopher S. Campbell, Tian Xia, and Myra Dideles. 2003. Evaluation of Visual Notification Cues for Ubiquitous Computing. In UbiComp 2003: Ubiquitous Computing, Anind K. Dey, Albrecht Schmidt, and Joseph F. McCarthy (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 349--366.",
      "doi": ""
    },
    {
      "text": "Matthias Trapp, Lars Schneider, Christine Lehmann, Norman Holz, and Jurgen Dollner. 2011. Strategies for Visualising 3D Points-ofinterest on Mobile Devices. J. Locat. Based Serv. 5, 2 (June 2011), 79--99.  ",
      "doi": "10.1080/17489725.2011.579579"
    },
    {
      "text": "Maarten van Dantzich, Daniel Robbins, Eric Horvitz, and Mary Czerwinski. 2002. Scope: Providing Awareness of Multiple Notifications at a Glance. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '02). ACM, New York, NY, USA, 267--281.  ",
      "doi": "10.1145/1556262.1556306"
    },
    {
      "text": "Gina Venolia, Laura Dabbish, JJ Cadiz, and Anoop Gupta. 2001. Supporting Email Workflow. Technical Report. 8 pages. https://www.microsoft. com/en-us/research/publication/supporting-email-workflow/",
      "doi": ""
    },
    {
      "text": "John Vilk, David Molnar, Benjamin Livshits, Eyal Ofek, Chris Rossbach, Alexander Moshchuk, Helen J. Wang, and Ran Gal. 2015. SurroundWeb: Mitigating Privacy Concerns in a 3D Web Browser. In Proceedings of the 2015 IEEE Symposium on Security and Privacy (SP '15). IEEE Computer Society, Washington, DC, USA, 431--446.  ",
      "doi": "10.1109/SP.2015.33"
    },
    {
      "text": "Amanda Williams, Shelly Farnham, and Scott Counts. 2006. Exploring Wearable Ambient Displays for Social Awareness. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, New York, NY, USA, 1529--1534.  ",
      "doi": "10.1145/1125451.1125731"
    },
    {
      "text": "Andrew D. Wilson and Hrvoje Benko. 2016. Projected Augmented Reality with the RoomAlive Toolkit. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 517--520.  ",
      "doi": "10.1145/2992154.2996362"
    },
    {
      "text": "Robert Xiao, Miguel A. Nacenta, Regan L. Mandryk, Andy Cockburn, and Carl Gutwin. 2011. Ubiquitous Cursor: A Comparison of Direct and Indirect Pointing Feedback in Multi-display Environments. In Proceedings of Graphics Interface 2011 (GI '11). Canadian Human-Computer Communications Society, School of Computer Science, University of Waterloo, Waterloo, Ontario, Canada, 135--142. http://dl.acm.org/citation.cfm?id=1992917.1992939 ",
      "doi": "10.5555/1992917.1992939"
    },
    {
      "text": "Polle T. Zellweger, Jock D. Mackinlay, Lance Good, Mark Stefik, and Patrick Baudisch. 2003. City Lights: Contextual Views in Minimal Space. In CHI '03 Extended Abstracts on Human Factors in Computing Systems (CHI EA '03). ACM, New York, NY, USA, 838--839.  ",
      "doi": "10.1145/765891.766022"
    },
    {
      "text": "Leizhong Zhang, Nan Tu, and Dave Vronay. 2005. Info-lotus: A Peripheral Visualization for Email Notification. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1901--1904.  ",
      "doi": "10.1145/1056808.1057051"
    }
  ]
}