{
  "doi": "10.1145/3290605.3300356",
  "title": "How Data Science Workers Work with Data: Discovery, Capture, Curation, Design, Creation",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "With the rise of big data, there has been an increasing need for practitioners in this space and an increasing opportunity for researchers to understand their workflows and design new tools to improve it. Data science is often described as data-driven, comprising unambiguous data and proceeding through regularized steps of analysis. However, this view focuses more on abstract processes, pipelines, and workflows, and less on how data science workers engage with the data. In this paper, we build on the work of other CSCW and HCI researchers in describing the ways that scientists, scholars, engineers, and others work with their data, through analyses of interviews with 21 data science professionals. We set five approaches to data along a dimension of interventions: Data as given; as captured; as curated; as designed; and as created. Data science workers develop an intuitive sense of their data and processes, and actively shape their data. We propose new ways to apply these interventions analytically, to make sense of the complex activities around data practices.",
  "tags": [
    "data design",
    "data capture",
    "grounded theory",
    "data science",
    "data creation",
    "work-practices",
    "data curation",
    "data discovery"
  ],
  "authors": [
    {
      "name": "Michael Muller",
      "institution": "IBM Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332517372",
      "orcid": "0000-0001-7860-163X"
    },
    {
      "name": "Ingrid Lange",
      "institution": "IBM Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659349394",
      "orcid": "missing"
    },
    {
      "name": "Dakuo Wang",
      "institution": "IBM Research, Yorktown Heights, NY, USA",
      "img": "/do/10.1145/contrib-99658707626/rel-imgonly/dakuo_wang.jpg",
      "acmid": "99658707626",
      "orcid": "0000-0001-9371-9441"
    },
    {
      "name": "David Piorkowski",
      "institution": "IBM Research, Yorktown Heights, NY, USA",
      "img": "/do/10.1145/contrib-81474694114/rel-imgonly/profile_sm.jpg",
      "acmid": "81474694114",
      "orcid": "missing"
    },
    {
      "name": "Jason Tsay",
      "institution": "IBM Research, Yorktown Heights, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365749",
      "orcid": "missing"
    },
    {
      "name": "Q. Vera Liao",
      "institution": "IBM Research, Yorktown Heights, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659248963",
      "orcid": "0000-0003-4543-7196"
    },
    {
      "name": "Casey Dugan",
      "institution": "IBM Research, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340488769",
      "orcid": "0000-0002-1508-2091"
    },
    {
      "name": "Thomas Erickson",
      "institution": "Unaffiliated, Minneapolis, MN, USA",
      "img": "/do/10.1145/contrib-81100235869/rel-imgonly/tom_sol_prtl_pic_183pxsq.jpg",
      "acmid": "81100235869",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sebastian Abt and Harold Baier (2014). A plea for utilizing synthetic data when performing machine learning based cyber-security experiments. Proc. AISec 2014.  ",
      "doi": "10.1145/2666652.2666663"
    },
    {
      "text": "Ritu Agarwal and Vasant Dhar (2014). Editorial -- Big data, data science, and analytics: The opportunity and challenge for IS research. Info. Sys. Res. 25(3), 443--448.  ",
      "doi": "10.1287/isre.2014.0546"
    },
    {
      "text": "Ashton Anderson, Jon Kleinberg, and Sendhil Mullainathan (2017). Assessing human error against a benchmark of perfection. TKDD 11(4), Art. 45.  ",
      "doi": "10.1145/3046947"
    },
    {
      "text": "Jesse Anderson (2018). Data engineers vs. data scientists. O'Reilly. https://www.oreilly.com/ideas/data-engineers-vs-data-scientists .",
      "doi": ""
    },
    {
      "text": "Lora Aroyo and Chris Welty (2013). Crowd truth: Harnessing disagreement in crowdsourcing a relation extraction gold standard. Proc. Web Science 2013.",
      "doi": ""
    },
    {
      "text": "Karen S. Baker and Geoffrey C. Bowker (2007). Information ecology: Open system environments for data, memories, and knowing. J. Intell. Inf. Syst. 29, 127--144.  ",
      "doi": "10.1007/s10844-006-0035-7"
    },
    {
      "text": "Karen S. Baker and Helena Karasti (2018). Data care and its politics: Designing for local collective data management as a neglected thing. Proc. PDC 2018, Art. 10.  ",
      "doi": "10.1145/3210586.3210587"
    },
    {
      "text": "Jo Bates, Yu-Wei Lin, and Paula Goodale (2016). Data journeys: Capturing the socio-material constitution of data objects and flows. Big Data & Soc. 3(2), 112.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Gabriella Giannachi, Boriana Koleva, and Tom Rodden (2009). From interaction to trajectories: Designing coherent journeys through user experiences. Proc. CHI 2009, 709--718,  ",
      "doi": "10.1145/1518701.1518812"
    },
    {
      "text": "Hélène Bilis (2018). Mapping fiction: Social networks and the novel. Presentation at Shifting (the) boundaries conference, Wellesley College.",
      "doi": ""
    },
    {
      "text": "Herbert Blumer (1954). What is wrong with social theory? American Sociological Review 18, 3--1.",
      "doi": ""
    },
    {
      "text": "Glenn A. Bowen (2006). Grounded theory and sensitizing concepts. Int. J. Qual. Meth. 5(3), 12--23.",
      "doi": ""
    },
    {
      "text": "danah boyd and Kate Crawford (2012). Critical questions for big data: Provocations for a cultural, technological, and scholarly phenonomenon. Info. Comm. Soc. 15(5), 662--679.",
      "doi": ""
    },
    {
      "text": "Ciara Byrne (2013). The rise of the DIY data scientist. Fast Company. https://www.fastcompany.com/3014018/the-rise-of-the-diy-data-scientist .",
      "doi": ""
    },
    {
      "text": "Jennie Carroll. 2004. Completing design in use: closing the appropriation cycle. In Proceedings of the 12th European Conference on Information Systems (ECIS 2004). 337--347.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz (2015). Constructing grounded theory. Sage.",
      "doi": ""
    },
    {
      "text": "Akemi T. Chatfield, Vivian N. Shlemoon, Wilbur Redublado, and Faizur Rahman (2014). Data scientists as game changers in big data environments. Proc. ACIS 2014, 1--11.",
      "doi": ""
    },
    {
      "text": "Amy Cheatle and Steven J. Jackson (2015) \"Digital entanglements: Craft, computation and collaboration in fine art furniture production. Proc. CSCW 2015, 958--968.  ",
      "doi": "10.1145/2675133.2675291"
    },
    {
      "text": "Madeline T.H. Chi, Robert Glaser, and Marshall Farr (1988/2014) (eds.). The nature of expertise. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Søren Christensen, Jens Bæk Jørgensen, and Kim Halskov Madsen (1997). Design as interaction with computer based materials. Proc. DIS 1997, 65--71.  ",
      "doi": "10.1145/263552.263578"
    },
    {
      "text": "Juliet Corbin and Anselm L. Strauss (2007). Basics of qualitative research: Techniques and procedures for developing grounded theory. 3rd edition. Newbury Park, CA, USA: Sage.",
      "doi": ""
    },
    {
      "text": "Andrew Dearden (2006). Design as a conversation with digital materials. Des. Stud. 27(3), 399--421.",
      "doi": ""
    },
    {
      "text": "Alan Dix (2007). Designing for appropriation. Proc. BCS-HCI 2007, 27--30. ",
      "doi": "10.5555/1531407.1531415"
    },
    {
      "text": "C. Dobre and F. Xhafa (2014), Intelligent services for big data science. Fut. Gen. Comp. Sys. 37, 267--291.",
      "doi": ""
    },
    {
      "text": "Anca Dumitrache, Lora Aroyo, and Chris Welty (2018). Crowdsourcing ground truth for medical relation extraction. TIIS 8(2), art. 11.  ",
      "doi": "10.1145/3152889"
    },
    {
      "text": "Ciarán Dunne (2011). The place of literature review in grounded theory research. Int.J. Soc. Res. Meth. 14(2), 111--124.",
      "doi": ""
    },
    {
      "text": "Hugh Durrante-Whyte (2015), Data, knowledge and discovery: Machine learning meets natural science. Proc. KDD 2015, 7.  ",
      "doi": "10.1145/2783258.2785467"
    },
    {
      "text": "Melanie Feinberg (2017a). A design perspective on data. Proc. CHI 2017, 29522963.  ",
      "doi": "10.1145/3025453.3025837"
    },
    {
      "text": "Melanie Feinberg, Daniel Carter, and Julia Bullard (2014b). A story without end: Writing the residual into descriptive infrastructure. Proc. DIS 2014, 385394.  ",
      "doi": "10.1145/2598510.2598553"
    },
    {
      "text": "Melanie Feinberg, Daniel Carter, Julia Bullard, and Ayse Gursoy (2017b). Translating texture: Design as integration. Proc. DIS 2017, 297--307.  ",
      "doi": "10.1145/3064663.3064730"
    },
    {
      "text": "Batya Friedman, Peter H. Kahn, and Alan Borning (2006). Value sensitive design and information systems. In P. Zhang and D. Galletta (eds.), HumanComputer Interaction and Management Information Systems: Foundations. M.E. Sharpe.",
      "doi": ""
    },
    {
      "text": "Lisa Gitelman (2013) (ed.), \"Raw data\" is an oxymoron. MIT Press.",
      "doi": ""
    },
    {
      "text": "Barney G. Glaser (1998). Doing grounded theory: Issues and discussions. Mill Valley, CA: Sociology Press.",
      "doi": ""
    },
    {
      "text": "Barney G. Glaser (2005). The grounded theory perspective III: Theoretical coding. Mill Valley, CA, USA: Sociology Press.",
      "doi": ""
    },
    {
      "text": "Robert Glaser and Micheline T.H. Chi (1988/2014). Overview. In Michelene T.H. Chi, Robert Glaser, and Marshall J. Farr (eds). (1988/2014). The nature of expertise. Taylor and Francis.",
      "doi": ""
    },
    {
      "text": "Michele Goetz (2015). 3 ways data preparation tools help you get ahead of big data. Forrester. https://go.forrester.com/blogs/15-02--17--3_ways_data _preparation_ tools_help_you_get_ahead_of_big_data/ .",
      "doi": ""
    },
    {
      "text": "Jonathan Gray, Carolyn Gerlitz, and Liliana Bounegru (2018). Data infrastructure literacy. Big Data & Soc. 5(2), 1--13.",
      "doi": ""
    },
    {
      "text": "Shad Gross, Jeoffrey Bardzell and Shaowen Bardzell (2014). Structures, forms, and stuff: The materiality and medium of interaction. Pers. Ubiquit. Comput. 18(3), 637--649.  ",
      "doi": "10.1007/s00779-013-0689-4"
    },
    {
      "text": "Philip J. Guo, Sean Kandel, Joseph M. Hellerstein, and Jeffrey Heer (2011). Proactive wrangling: Mixed-initiative end-user programming of data transformation scripts. Proc. UIST 2011, 65--74.  ",
      "doi": "10.1145/2047196.2047205"
    },
    {
      "text": "Bob Hayes (2018a). A majority of data scientists lack competency in advanced machine learning areas and techniques. BusinessOverBroadway, http://businessoverbroadway.com/a-majority-of-data-scientists-lackcompetency-in-advanced-machine-learning-areas-and-techniques .",
      "doi": ""
    },
    {
      "text": "Bob Hayes (2018c). Most used data science tools and technologies in 2017 and what to expect for 2018. BusinessOverBroadway. http://businessoverbroadway.com/most-used-data-science-tools-andtechnologies-in-2017-and-what-to-expect-for-2018 .",
      "doi": ""
    },
    {
      "text": "Bob Hayes (2018b). Top 10 challenges to practicing data science at work. BusinessOverBroadway. http://businessoverbroadway .com/top-10challenges-to-practicing-data-science-at-work .",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer, Joseph M. Hellerstein, and Sean Kandel (2015). Predictive interaction for data transformation. Proc. CIDR 2015.",
      "doi": ""
    },
    {
      "text": "Tony Hey, Stewart Tansley, and Kristin Tolle (2009). The fourth paradigm: Data-intensive scientific discovery. Microsoft Research.",
      "doi": ""
    },
    {
      "text": "Ming-Tung Hong and Claudia Müller-Birn (2017). Conceptualization of computer-supported collaborative sensemaking. CSCW 2017 Companion, 199--202.  ",
      "doi": "10.1145/3022198.3026351"
    },
    {
      "text": "Marjin Janssen and George Kuk (2016). The challenges and limits of big data algorithms in technocratic governance. Gov. Info. Quart., 33(3), 371--377.",
      "doi": ""
    },
    {
      "text": "Kaggle (2017). Kaggle ML and data science survey, 2017: A big picture view of the state of data science and machine learning. Kaggle. https://www.kaggle.com/kaggle/kaggle-survey-2017 .",
      "doi": ""
    },
    {
      "text": "KDNuggets. (2018). Doing data science: A Kaggle walkthrough -- Cleaning data. https://www.kdnuggets.com/2016/03/doing-data-science-kaggleawalkthrough-cleaning-data.html .",
      "doi": ""
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph Hellerstein, and Jeffrey Heer (2011). Wrangler: Interactive visual specification of data transformation scripts. Proc. CHI 2011, 3363--3372.  ",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "James Max Kanter and Kalyan Veeramachaneri (2015). Deep feature synthesis: Towards automating data science endeavors. Proc. DSAA 2015, 1--10.",
      "doi": ""
    },
    {
      "text": "Jakko Kemper and Daan Kolkman (2018). Transparent to whom? No algorithmic accountability without a critical audience. Info. Comm. & Soc.",
      "doi": ""
    },
    {
      "text": "Allison Kidd (1994). The marks are on the knowledge worker. Proc. CHI 1994, 186--191.  ",
      "doi": "10.1145/191666.191740"
    },
    {
      "text": "Miryung Kim, Thomas Zimmermann, Robert DeLine, and Andrew Begel (2016). The emerging role of data scientists on software development teams. Proc. IEEE CSE 2016, 96--107.  ",
      "doi": "10.1145/2884781.2884783"
    },
    {
      "text": "John King and Roger Magoulas (2015). 2015 data science salary survey: Tools, trends, what pays (and what doesn't) data professionals. O,Reilly. http://www.eli.sdsu.edu/courses/fall16/cs696/2015-data-science-salarysurvey.pdf .",
      "doi": ""
    },
    {
      "text": "Ákos Kiss and Tamás Szirányi (2013). Evaluation of manually created ground truth for multi-view people localization. Proc. VIGTA 2013.  ",
      "doi": "10.1145/2501105.2501106"
    },
    {
      "text": "Peter Gall Krogh, Marianne Graves Petersen, Kenton O'Hara, and Jens Emil Grønbæk (2017). Sensitizing concepts for socio-spatial literacy in HCI. Proc. CHI 2017, 6449--6460.  ",
      "doi": "10.1145/3025453.3025756"
    },
    {
      "text": "Cheng Han Lee (2014). Data career paths: Data analyst vs. data scientist vs. data engineer: 3 data careers decoded and what it means for you. Udacity. https://blog.udacity.com/2014/12/data-analyst-vs-data-scientist-vs-dataengineer.html",
      "doi": ""
    },
    {
      "text": "Alan Lesgold, Harriet Rubinson, Paul Feltovich, Robert Glaser, Dale Klopfer, and Yen Wang (1988/2014). Expertise in a complex skill: Diagnosing X-ray pictures. In Michelene T.H. Chi, Robert Glaser, and Marshall J. Farr (eds). (1988/2014). The nature of expertise. Taylor and Francis.",
      "doi": ""
    },
    {
      "text": "Jessica Lingel (2016). The poetics of socio-technical space: Evaluating the Internet of things through craft. Proc. CHI 2016, 815--826.  ",
      "doi": "10.1145/2858036.2858399"
    },
    {
      "text": "Jessica Lingel and Tim Regan (2014). \"it's in your spinal cord, it's in your fingertips: practices of tools and craft in building software.\" Proc. CSCW 2014, 295--304.  ",
      "doi": "10.1145/2531602.2531614"
    },
    {
      "text": "Paul Luo Li, Andrew J. Ko, and Jiamin Zhu (2015). What makes a great software engineer? Proc. ICSE 2015, 700--710. ",
      "doi": "10.5555/2818754.2818839"
    },
    {
      "text": "Karen Grace Martin (2018). Preparing data for analysis is (more than) half the battle. Analysis Factor. https://www.theanalysisfactor.com/preparing-dataanalysis/ .",
      "doi": ""
    },
    {
      "text": "Gerry McGhee, Glenn R. Marland, and Jacqueline Atkinson (2007). Grounded theory research: Literature reviewing and reflexivity. J. Adv. Nurs. 60(3), 334342.",
      "doi": ""
    },
    {
      "text": "Helena M. Mentis, Ahmed Rahim, and Pierre Theodore (2016). Crafting the image in surgical telemedicine. Proc. CSCW 2016, 744--755.  ",
      "doi": "10.1145/2818048.2819978"
    },
    {
      "text": "Renée J. Miller (2017). The future of data integration. Proc. KDD 2017, 3.  ",
      "doi": "10.1145/3097983.3105809"
    },
    {
      "text": "Steven Miller (2014). Collaborative approaches needed to close the big data knowledge and skills gap. J. Org. Des. 3(1), 26--30.",
      "doi": ""
    },
    {
      "text": "Julia Moehrmann and Gunther Heidemann (2012). Efficient annotation of image data sets for computer vision applications. Proc. VIGTA 12.  ",
      "doi": "10.1145/2304496.2304498"
    },
    {
      "text": "Michael Muller (2014). Curiosity, creativity, and surprise as analytic tools: Grounded theory method. In Judith Olson and Wendy A. Kellogg (eds.), Ways of knowing in HCI. Springer.",
      "doi": ""
    },
    {
      "text": "Syed Sadat Nazrul (2018). DevOps for data scientists: Taming the unicorn. Medium: Towards Data Science, https://towardsdatascience.com/devopsfor-data-scientists-taming-the-unicorn-6410843990de .",
      "doi": ""
    },
    {
      "text": "Gina Neff, Ahissa Tanweer, Brittany Fiore-Gartland, and Laura Osburn (2017). Critique and contribute: A practice-based framework for improving critical data studies and data science. Big Data 5(2), 85--97.",
      "doi": ""
    },
    {
      "text": "Samir Passi and Steven J. Jackson (2017). Data vision: Learning to see through algorithmic abstraction. Proc. CSCW 2017, 2436--2447.  ",
      "doi": "10.1145/2998181.2998331"
    },
    {
      "text": "Kayur Patel, James Fogarty, James A. Landay, and Beverly Harrison (2008). Investigating statistical machine learning as a tool for software development. Proc. CHI 2008, 667--676.  ",
      "doi": "10.1145/1357054.1357160"
    },
    {
      "text": "Kathleen H. Pine and Max Liboiron (2015). The politics of measurement and action. Proc. CHI 2015, 3147--3156.  ",
      "doi": "10.1145/2702123.2702298"
    },
    {
      "text": "Sarah Pink, Minna Ruckenstein, Robert Willim, and Melisa Duque (2018). Broken data: Conceptualizing data in an emerging world. Big Data & Soc. 5(1), 1--13.",
      "doi": ""
    },
    {
      "text": "Michael I. Posner (1988/2014). Introduction. In Michelene T.H. Chi, Robert Glaser, and Marshall J. Farr (eds). (1988/2014). The nature of expertise. Taylor and Francis.",
      "doi": ""
    },
    {
      "text": "Krishna Rajan (2013). Informatics for materials science and engineering: Datadriven discovery for materials science and engineering. Elsevier.",
      "doi": ""
    },
    {
      "text": "Vijayshankar Raman and Joseph M. Hellerstein (2001). Potter's wheel: An interactive data cleaning system. Proc. VLDB 2001. ",
      "doi": "10.5555/645927.672045"
    },
    {
      "text": "Tye Rattenbury, Joseph M. Hellerstein, Jeffrey Heer, Sean Kandel, and Connor Carreras (2017). Principles of data wrangling: Practical techniques for data preparation. O'Reilly. ",
      "doi": "10.5555/3165161"
    },
    {
      "text": "David Ribes (2017). Notes on the concept of data interoperability: Cases from an ecology of AIDS research infrastructures. Proc. CSCW 2017, 1514--1526.  ",
      "doi": "10.1145/2998181.2998344"
    },
    {
      "text": "Daniela K. Rosner, Miwa Ikemiya, and Tim Regan (2015). Resisting alignment: Code and clay. Proc. TEI 2015, 181--188.  ",
      "doi": "10.1145/2677199.2680587"
    },
    {
      "text": "Evelyn Ruppert (2013). Rethinking empirical social sciences. Dial. Hum. Geo. 3(3), 268--273.",
      "doi": ""
    },
    {
      "text": "Evelyn Ruppert, Penny Harvey, Celia Lury, Adrian Mackenzie, Ruth McNally, Stephanie Alice Baker, Yannis Kallianos, and Camilla Lewis (2015). Socializing big data: From concept to practice. CRESC, U. Manchester, Open U.",
      "doi": ""
    },
    {
      "text": "Daniel M. Russell, George Furnas, Mark Stefik, Stuart Card, and Peter Pirolli (2008). Sensemaking workshop 2008. CHI EA 2008, 4751--4754.",
      "doi": ""
    },
    {
      "text": "Donald Schön (1983). The reflective practitioner. How professionals think in action. Basic Books.",
      "doi": ""
    },
    {
      "text": "Scikit-Learn (2017). scikit-learn Tutorials. http://scikit-learn.org/stable/ tutorial/index.html .",
      "doi": ""
    },
    {
      "text": "Shventank Shah, Andrew Horne, and Jaime Capella (2012). Good data won't guarantee good decisions. Harv Bus Rev, Apr 2012.",
      "doi": ""
    },
    {
      "text": "Susan Elliott Sim, Marisa Levitt Cohn, and Kavita Philip. (2009). The work of software development as an assemblage of computing practices. Proc. CHASE 2009, 92--95.  ",
      "doi": "10.1109/CHASE.2009.5071419"
    },
    {
      "text": "Charles Sutton, Timothy Hobson, James Geddes, and Rich Caruana (2018). Data diff: Interpretable, executable summaries of changes in distributions for datq wrangling. Proc. KDD 2018.  ",
      "doi": "10.1145/3219819.3220057"
    },
    {
      "text": "Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasilis Vlachokyriakos, Lillie Grainger, and Jessa Lingel (2015). Data-in-place: Thinking through relations between data and community. Proc. CHI 2015, 2863--2872.  ",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Jakob Tholander, Maria Normack, and Chiara Rossitto (2012). Understanding agency in interaction design materials. Proc. CHI 2012, 2499--2508.  ",
      "doi": "10.1145/2207676.2208417"
    },
    {
      "text": "Paul F. Uhlir and Peter Schoder (2007). Open data for global science. Data Sci. J. 6, 36--53.",
      "doi": ""
    },
    {
      "text": "Wil M.P. van der Aalst (2014). Data scientist: The engineer of the future. Proc. I-ESA 7, 13--26.",
      "doi": ""
    },
    {
      "text": "Ruben Verborgh and Max De Wilde (2013). Using OpenRefine. Packt. ",
      "doi": "10.5555/2566721"
    },
    {
      "text": "Leonard J. Waks (2001). Donald Schon's {sic} philosophy of design and design education. Int. J. Tech. Des. Educ. 11, 37--51.",
      "doi": ""
    },
    {
      "text": "Samuel F. Way, Daniel B. Larremore, and Aaron Clauset (2016). Gender, productivity, and prestige in computer science faculty hiring networks. Proc. WWW 2016, 1169--1179.  ",
      "doi": "10.1145/2872427.2883073"
    },
    {
      "text": "Mikael Wiberg (2014). Methodology for materiality: Interaction design through a material lens. Pers. Ubiquit. Comput. 18(3), 625--636.  ",
      "doi": "10.1007/s00779-013-0686-7"
    },
    {
      "text": "Fo Wilson (2010). The new materiality: Digital dialogues at the boundaries of contemporary craft. Cultura Visual 1(14), 83--88.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Alex Scuito, John Zimmerman, Jodi Forlizzi, and Aaron Steinfeld (2018a). Investigating how experienced UX designers effectively work with machine learning. Proc. DIS 2018,  ",
      "doi": "10.1145/3196709.3196730"
    },
    {
      "text": "Qian Yang, Jina Suh, Nan-Chen Chen, and Gonzalo Ramos (2018b). Grounding interactive machine learning tool design in how non-experts actually build models. Proc. DIS 2018, 573--584.  ",
      "doi": "10.1145/3196709.3196729"
    }
  ]
}