{
  "doi": "10.1145/3290605.3300571",
  "title": "City Explorer: The Design and Evaluation of a Location-Based Community Information System",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "Many working professionals commute via public transit, yet they have limited tools for learning about their urban neighborhoods and fellow commuters. We designed a location-based game called City Explorer to investigate how transit commuters capture, share, and view community information that is specifically tied to locations. Through a four-week field study, we found that participants valued the increased awareness of their personal travel routines that they gained through City Explorer. When viewing community information, they preferred information that was factual rather than opinion-based and was presented at the start and end of their commutes. Participants found less value in connecting with other transit riders because transit rides were often seen as opportunities to disengage from others. We discuss how location-based technologies can be designed to display factual community information before, during, and at the end of transit commutes.",
  "tags": [
    "location-based games",
    "community",
    "urban informatics",
    "mobile computing"
  ],
  "authors": [
    {
      "name": "Carolyn Pang",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/do/10.1145/contrib-81558581656/rel-imgonly/personal-image.jpg",
      "acmid": "81558581656",
      "orcid": "missing"
    },
    {
      "name": "Rui Pan",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658687973",
      "orcid": "missing"
    },
    {
      "name": "Carman Neustaedter",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    },
    {
      "name": "Kate Hennessy",
      "institution": "Simon Fraser University, Surrey, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758752457",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mark Ackerman, Marlene Huysman, John M. Carroll, Barry Wellman, Giorgio DeMichelis, and Volker Wulf. 2004. Communities and technologies: An approach to foster social capital?. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (CSCW '04). ACM, New York, NY, USA, 406--408. Hunt Allcott and Matthew Gentzkow. 2017. Social media and fake news in the 2016 election. Journal of Economic Perspectives 31 (2017).  ",
      "doi": "10.1145/1031607.1031675"
    },
    {
      "text": "Ionut Andone, Konrad Blaszkiewicz, Matthias Böhmer, and Alexander Markowetz. 2017. Impact of location-based games on phone usage and movement: A case study on Pokémon GO. In Proc. of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, Article 102, 8 pages.  ",
      "doi": "10.1145/3098279.3122145"
    },
    {
      "text": "Ben Bedwell, Holger Schnädelbach, Steve Benford, Tom Rodden, and Boriana Koleva. 2009. In support of city exploration. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 11711180.  ",
      "doi": "10.1145/1518701.1518879"
    },
    {
      "text": "Marek Bell, Matthew Chalmers, Louise Barkhuus, Malcolm Hall, Scott Sherwood, Paul Tennent, Barry Brown, Duncan Rowland, Steve Benford, Mauricio Capra, and Alastair Hampshire. 2006. Interweaving mobile games with everyday life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, New York, NY, USA, 417--426.  ",
      "doi": "10.1145/1124772.1124835"
    },
    {
      "text": "Nicolas Belloni, Lars Erik Holmquist, and Jakob Tholander. 2009. See you on the subway: Exploring mobile social software. In CHI '09 Extended Abstracts on Human Factors in Computing Systems (CHI EA '09). ACM, New York, NY, USA, 4543--4548.  ",
      "doi": "10.1145/1520340.1520697"
    },
    {
      "text": "Steve Benford, Andy Crabtree, Martin Flintham, Adam Drozd, Rob Anastasi, Mark Paxton, Nick Tandavanitj, Matt Adams, and Ju Row-Farr. 2006. Can You See Me Now?. ACM Trans. ComputerHuman Interaction 13, 1 (March 2006), 100--133.  ",
      "doi": "10.1145/1143518.1143522"
    },
    {
      "text": "Frank Bentley, Henriette Cramer, William Hamilton, and Santosh Basapur. 2012. Drawing the city: Differing perceptions of the urban environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1603--1606.  ",
      "doi": "10.1145/2207676.2208282"
    },
    {
      "text": "Mark Bilandzic, Marcus Foth, and Alexander De Luca. 2008. CityFlocks: Designing social navigation for urban mobile information systems. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (DIS '08). ACM, New York, NY, USA, 174--183.  ",
      "doi": "10.1145/1394445.1394464"
    },
    {
      "text": "Ceren Budak, Divyakant Agrawal, and Amr El Abbadi. 2011. Limiting the spread of misinformation in social networks. In Proceedings of the 20th International Conference on World Wide Web (WWW '11). ACM, New York, NY, USA, 665--674.  ",
      "doi": "10.1145/1963405.1963499"
    },
    {
      "text": "Tiago Camacho, Marcus Foth, and Andry Rakotonirainy. 2013. TrainRoulette. In Proc. of the 2013 ACM Conference on Pervasive and Ubiquitous Computing (UbiComp '13 Adjunct), ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Tiago Camacho, Marcus Foth, and Andry Rakotonirainy. 2013. Pervasive Technology and Public Transport: Opportunities Beyond Telematics. IEEE Pervasive Computing, 12(1), 18--25.  ",
      "doi": "10.1109/MPRV.2012.61"
    },
    {
      "text": "Tiago Camacho, Marcus Foth, Markus Rittenbruch, and Andry Rakotonirainy. 2015. TrainYarn: Probing Perceptions of Social Space in Urban Commuter Trains. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15), Bernd Ploderer, Marcus Carter, Martin Gibbs, Wally Smith, and Frank Vetere (Eds.). ACM, New York, NY, USA, 455--464.  ",
      "doi": "10.1145/2838739.2838760"
    },
    {
      "text": "John M. Carroll and Mary Beth Rosson. 2013. Wild at Home: The Neighborhood as a Living Laboratory for HCI. ACM Trans. Comput.-Hum. Interact.20, 3, Article 16 (July 2013), 28 pages.  ",
      "doi": "10.1145/2491500.2491504"
    },
    {
      "text": "Victor P. Cornet, Natalie K. Hall, Francesco Cafaro, and Erin L. Brady. 2017. How Image-Based Social Media Websites Support Social Movements. In Proc. of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 2473--2479.  ",
      "doi": "10.1145/3027063.3053257"
    },
    {
      "text": "Henriette Cramer, Mattias Rost, and Lars Erik Holmquist. 2011. Performing a Check-in: Emerging practices, norms and 'conflicts' in location-sharing using Foursquare. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 57--66.  ",
      "doi": "10.1145/2037373.2037384"
    },
    {
      "text": "David Dearman, Melanie Kellar, and Khai N. Truong. 2008. An examination of daily information needs and sharing opportunities. In Proceedings of the 2008 ACM conference on Computer Supported Cooperative Work (CSCW '08). ACM, New York, NY, USA, 679--688.  ",
      "doi": "10.1145/1460563.1460668"
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: Defining \"gamification\". In Proc. of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '11). ACM, New York, NY, USA, 9--15.  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Paul Dourish. 2001. Seeking a foundation for context-aware computing. Hum.-Comput. Interact. 16, 2 (December 2001), 229241.  ",
      "doi": "10.1207/S15327051HCI16234_07"
    },
    {
      "text": "Claude S. Fischer. 1992. America Calling: A Social History of the Telephone to 1940. University of California Press, Berkeley, CA, USA. ",
      "doi": "10.5555/530627"
    },
    {
      "text": "Zachary Fitz-Walter, Dian Tjondronegoro, and Peta Wyeth. 2011. Orientation Passport: Using gamification to engage university students. In Proceedings of the 23rd Australian Computer-Human Interaction Conference (OzCHI '11). ACM, New York, NY, USA, 122--125.  ",
      "doi": "10.1145/2071536.2071554"
    },
    {
      "text": "Stefan Foell, Reza Rawassizadeh, and Gerd Kortuem. 2013. Informing the design of future transport information services with travel behaviour data. In Proc. of the 2013 ACM Conference on Pervasive and Ubiquitous Computing (UbiComp '13 Adjunct). ACM, New York, NY, USA, 1343--1346.  ",
      "doi": "10.1145/2494091.2499219"
    },
    {
      "text": "Claude Fortin, Carman Neustaedter, and Kate Hennessy. 2014. Posting for community and culture: Considerations for the design of interactive digital bulletin boards. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1425--1434.  ",
      "doi": "10.1145/2556288.2556970"
    },
    {
      "text": "Marcus Foth, Jaz Hee-jeong Choi, and Christine Satchell. 2011. Urban informatics. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11). ACM, New York, NY, USA, 1--8.  ",
      "doi": "10.1145/1958824.1958826"
    },
    {
      "text": "Marcus Foth and Ronald Schroeter. 2010. Enhancing the experience of public transport users with urban screens and mobile applications. In Proc. of the 14th International Academic MindTrek Conference: Envisioning Future Media Environments (MindTrek '10). ACM, New York, NY, USA, 33--40.  ",
      "doi": "10.1145/1930488.1930496"
    },
    {
      "text": "William Gaver, Andy Boucher, Nadine Jarvis, David Cameron, Mark Hauenstein, Sarah Pennington, John Bowers, James Pike, Robin Beitra, and Liliana Ovalle. 2016. The Datacatcher: Batch Deployment and Documentation of 130 Location-Aware, Mobile Devices That Put Sociopolitically-Relevant Big Data in People's Hands: Polyphonic Interpretation at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1597--1607.  ",
      "doi": "10.1145/2858036.2858472"
    },
    {
      "text": "Allison Gazzard. 2011. Location, location, location: Collecting space and place in mobile media. Convergence: The International Journal of Research into New Media Technologies, 17(4), 405--417.",
      "doi": ""
    },
    {
      "text": "Antonietta Grasso, Martin Muehlenbrock, Frederic Roulland, Dave Snowdon. 2003. Supporting Communities of Practice with Large Screen Displays. In: O'Hara K., Perry M., Churchill E., Russell D. (eds) Public and Situated Displays. The Kluwer International series on Computer Supported Cooperative Work, vol 2. Springer, Dordrecht",
      "doi": ""
    },
    {
      "text": "Dize Hilviu and Amon Rapp. 2015. Narrating the quantified self. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 1051--1056.  ",
      "doi": "10.1145/2800835.2800959"
    },
    {
      "text": "Luke Hutton, Tristan Henderson, and Apu Kapadia. 2014. Short paper: \"Here I am, now pay me!\": Privacy concerns in incentivised location-sharing systems. In Proc. of the 2014 ACM Conference on Security and Privacy in Wireless & Mobile Networks (WiSec '14). ACM, New York, NY, USA, 81--86.  ",
      "doi": "10.1145/2627393.2627416"
    },
    {
      "text": "Cliff Lampe, Jessica Vitak, Rebecca Gray, and Nicole Ellison. 2012. Perceptions of Facebook's value as an information source. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 31953204.  ",
      "doi": "10.1145/2207676.2208739"
    },
    {
      "text": "Thomas Laureyssens, Tanguy Coenen, Laurence Claeys, Peter Mechant, Johan Criel, and Andrew Vande Moere. 2014. ZWERM: A modular component network approach for an urban participation game. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 32593268.  ",
      "doi": "10.1145/2556288.2557053"
    },
    {
      "text": "Janne Lindqvist, Justin Cranshaw, Jason Wiese, Jason Hong, and John Zimmerman. 2011. I'm the mayor of my house: Examining why people use Foursquare -- A social-driven location sharing application. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2409--2418.  ",
      "doi": "10.1145/1978942.1979295"
    },
    {
      "text": "Assunta Matassa and Amon Rapp. 2015. Map-making: Designing a mobile application for enhancing memories' retrieval. In Proc. of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 994--1001.  ",
      "doi": "10.1145/2786567.2794318"
    },
    {
      "text": "Carolyn Pang, Carman Neustaedter, Jason Procyk, Daniel Hawkins, and Kate Hennessy. 2015. Moving towards user-centered government: Community information needs and practices of families. In Proceedings of the 41st Graphics Interface Conference (GI '15). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 155--162. ",
      "doi": "10.5555/2788890.2788918"
    },
    {
      "text": "Sameer Patil. 2012. Will you be my friend?: Responses to friendship requests from strangers. In Proceedings of the 2012 iConference (iConference '12). ACM, New York, NY, USA, 634--635.  ",
      "doi": "10.1145/2132176.2132318"
    },
    {
      "text": "Eric Paulos and Elizabeth Goodman. 2004. The Familiar Stranger: Anxiety, comfort, and play in public places. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 223--230.  ",
      "doi": "10.1145/985692.985721"
    },
    {
      "text": "Omer Rashid, Ian Mullins, Paul Coulton, and Reuben Edwards. 2006. Extending cyberspace: Location-based games using cellular phones. Comput. Entertain. 4, 1, Article 4 (January 2006).  ",
      "doi": "10.1145/1111293.1111302"
    },
    {
      "text": "Daniela K. Rosner, Hidekazu Saegusa, Jeremy Friedland, and Allison Chambliss. 2015. Walking by Drawing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 397--406.  ",
      "doi": "10.1145/2702123.2702467"
    },
    {
      "text": "Ronald Schroeter and Marcus Foth. 2009. Discussions in Space. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7 (OZCHI '09). ACM, New York, NY, USA, 381--384.  ",
      "doi": "10.1145/1738826.1738903"
    },
    {
      "text": "Mark Shepard. (2011). Sentient City: Ubiquitous computing, architecture, and the future of urban space, The Architectural League,. New York (N.Y.): The Architectural League of New York. ",
      "doi": "10.5555/1972523"
    },
    {
      "text": "Timothy Sohn, Kevin A. Li, Gunny Lee, Ian Smith, James Scott, and William G. Griswold. 2005. Place-Its: A study of location-based reminders on mobile phones. In Proceedings of the 7th International Conference on Ubiquitous Computing (UbiComp'05), Michael Beigl, Stephen Intille, Jun Rekimoto, and Hideyuki Tokuda (Eds.). Springer-Verlag, Berlin, Heidelberg, 232--250.  ",
      "doi": "10.1007/11551201_14"
    },
    {
      "text": "Laurel Swan, Alex S. Taylor, and Richard Harper. 2008. Making place for clutter and other ideas of home. ACM Trans. Comput.Hum. Interact. 15, 2, Article 9 (July 2008), 24 pages.  ",
      "doi": "10.1145/1375761.1375764"
    },
    {
      "text": "Sarah-Kristin Thiel. 2015. Gamified participation: Investigating the influence of game elements in civic engagement tools. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (UbiComp/ISWC'15 Adjunct). ACM, New York, NY, USA, 527--532.  ",
      "doi": "10.1145/2800835.2801659"
    },
    {
      "text": "Sarah-Kristin Thiel. 2016. Reward-based vs. Social Gamification: Exploring Effectiveness of Gamefulness in Public Participation. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, New York, NY, USA, Article 104, 6 pages.  ",
      "doi": "10.1145/2971485.2996739"
    },
    {
      "text": "Dian Tjondronegoro and Tat-Seng Chua. 2012. Transforming mobile personal life log into autobiographical multimedia eChronicles. In Proceedings of the 10th International Conference on Advances in Mobile Computing & Multimedia (MoMM '12), Ismail Khalil (Ed.). ACM, New York, NY, USA, 57--63.  ",
      "doi": "10.1145/2428955.2428973"
    },
    {
      "text": "Emily Troshynski, Charlotte Lee, and Paul Dourish. 2008. Accountabilities of presence: Reframing location-based systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 487--496.  ",
      "doi": "10.1145/1357054.1357133"
    },
    {
      "text": "K.T. Unruh, K. E. Pettigrew, and J. C. Durrance. 2002. Evaluation of digital community information systems. In Proceedings of the 2nd ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL '02). ACM, New York, NY, USA, 240--241.  ",
      "doi": "10.1145/544220.544271"
    },
    {
      "text": "Gang Wang, Bolun Wang, Tianyi Wang, Ana Nika, Haitao Zheng, and Ben Y. Zhao. 2016. Defending against Sybil Devices in Crowdsourced Mapping Services. In Proceedings of the 14th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '16). ACM, New York, NY, USA, 179--191.  ",
      "doi": "10.1145/2906388.2906420"
    },
    {
      "text": "Barry Wellman. 2002. Designing the Internet for a networked society. Commun. ACM 45, 5 (May 2002), 91--96.  ",
      "doi": "10.1145/506218.506221"
    },
    {
      "text": "Barry Wellman & Barry Leighton. (1981). Networks, neighborhoods and communities: Approaches to the study of the community question: Barry Wellman and Barry Leighton. Toronto: University of Toronto. Dept. of Anthropology.",
      "doi": ""
    },
    {
      "text": "Amanda Williams, Erica Robles & Paul Dourish. (2009). Urbane-ing the City: Examining and Refining the Assumptions Behind Urban Informatics. In M. Foth (Ed.), Handbook of Research on Urban Informatics: The Practice and Promise of the Real-Time City (pp. 120). Hershey, PA: IGI Global.",
      "doi": ""
    },
    {
      "text": "Mao Ye, Peifeng Yin, and Wang-Chien Lee. 2010. Location recommendation for location-based social networks. In Proceedings of the 18th SIGSPATIAL International Conference on Advances in Geographic Information Systems (GIS '10). ACM, New York, NY, USA, 458--461.  ",
      "doi": "10.1145/1869790.1869861"
    },
    {
      "text": "Savvas Zannettou, Tristan Caulfield, Emiliano De Cristofaro, Nicolas Kourtelris, Ilias Leontiadis, Michael Sirivianos, Gianluca Stringhini, and Jeremy Blackburn. 2017. The Web Centipede. In Proc. of the 2017 Internet Measurement Conference (IMC '17). ACM, New York, NY, USA, 405--417.  ",
      "doi": "10.1145/3131365.3131390"
    }
  ]
}