{
  "doi": "10.1145/3290605.3300365",
  "title": "Putting the Value in VR: How to Systematically and Iteratively Develop a Value-Based VR Application with a Complex Target Group",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "In development, implementation and evaluation of eHealth it is essential to account for stakeholders' perspectives, opinions and values, which are statements that specify what stakeholders want to achieve or improve via a technology. The use of values enables developers to systematically include stakeholders' perspectives and the context of use in an eHealth development process. However, there are relatively few papers that explain how to use values in technology development. Consequently, in this paper we show how we formulated values during the multi-method, interdisciplinary and iterative development process of a VR application for a complex setting: forensic mental healthcare. We report the main foundations for these values: the outcomes of an online questionnaire with patients, therapists and other stakeholders (n=146) and interviews with patients and therapists (n=18). We show how a multidisciplinary project team used these qualitative results to formulate and adapt values and create lo-fi prototypes of a VR application. We discuss the importance of a systematic development process with multiple formative evaluations for eHealth and reflect on the role of values within this.",
  "authors": [
    {
      "name": "Hanneke Kip",
      "institution": "University of Twente & Stichting Transfore, Enschede, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367158",
      "orcid": "missing"
    },
    {
      "name": "Saskia M. Kelders",
      "institution": "University of Twente & North-West University, Enschede, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414618730",
      "orcid": "missing"
    },
    {
      "name": "Lisette J.E.W.C Van Gemert-Pijnen",
      "institution": "University of Twente, Enschede, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508687716",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Julia EWC van Gemert-Pijnen, Nicol Nijland, Maarten van Limburg, Hans C Ossebaard, Saskia M Kelders, Gunther Eysenbach, and Erwin R Seydel. A holistic framework to improve the uptake and impact of ehealth technologies. Journal of medical Internet research, 13(4), 2011.",
      "doi": ""
    },
    {
      "text": "Russell E Glasgow, Siobhan M Phillips, and Michael A Sanchez. Implementation science approaches for integrating ehealth research into practice and policy. International journal of medical informatics, 83(7):e1--e11, 2014.",
      "doi": ""
    },
    {
      "text": "Hanneke Kip and Lisette JEWC van Gemert-Pijnen. Holistic development of eHealth technology, pages 151--186. Routledge, 2018.",
      "doi": ""
    },
    {
      "text": "Catherine Burns. Human-centred design, book section 10. Routledge, Abingdon, 2018.",
      "doi": ""
    },
    {
      "text": "Nienke Beerlage-de Jong, Jobke Wentzel, Ron Hendrix, and Lisette van Gemert-Pijnen. The value of participatory development to support antimicrobial stewardship with a clinical decision support system. American journal of infection control, 45(4):365--371, 2017.",
      "doi": ""
    },
    {
      "text": "Lex Van Velsen, Jobke Wentzel, and Julia E. W. C. Van Gemert-Pijnen. Designing ehealth that matters via a multidisciplinary requirements development approach. JMIR Research Protocols, 2(1):e21, 2013.",
      "doi": ""
    },
    {
      "text": "Jacquelyn H Flaskerud and Betty J Winslow. Conceptualizing vulnerable populations health-related research. Nursing research, 47(2):69--78, 1998.",
      "doi": ""
    },
    {
      "text": "MichÃle Dugas, Marie-Ãve Trottier, Selma Chipenda Dansokho, Gratianne Vaisson, Thierry Provencher, Heather Colquhoun, Maman Joyce Dogba, Sophie Dup, Angela Fagerlin, and Anik MC Giguere. Involving members of vulnerable populations in the development of patient decision aids: a mixed methods sequential explanatory study. BMC medical informatics and decision making, 17(1):12, 2017.",
      "doi": ""
    },
    {
      "text": "Paul E Mullen. Forensic mental health. The British journal of psychiatry, 176(4):307--311, 2000.",
      "doi": ""
    },
    {
      "text": "Klaus H Drieschner and Anne Boomsma. The treatment motivation scales for forensic outpatient treatment (tms-f) construction and psychometric evaluation. Assessment, 15(2):224--241, 2008.",
      "doi": ""
    },
    {
      "text": "Kris R Goethals, Ellen CW Vorstenbosch, and Hjalmar JC van Marle. Diagnostic comorbidity in psychotic offenders and their criminal history: A review of the literature. 2008.",
      "doi": ""
    },
    {
      "text": "Elizabeth Greenberg, Eric Dunleavy, and Mark Kutner. Literacy behind bars: Results from the 2003 national assessment of adult literacy prison survey. nces 2007--473. National Center for Education Statistics, 2007.",
      "doi": ""
    },
    {
      "text": "Joyce Bierbooms, Yvonne Bouman, Dirk Dijkslag, Rob Kimpen, JosÃ Muller, and Rosemarie Wieske. Do's en don'ts van e-health in de forensische ggz. Kwaliteit Forensische Zorg (KFZ), 2015.",
      "doi": ""
    },
    {
      "text": "Hanneke Kip, Yvonne HA Bouman, Saskia M Kelders, and Lisette JEWC van Gemert-Pijnen. ehealth in treatment of offenders in forensic mental health: a review of the current state. Frontiers in psychiatry, 9:42, 2018.",
      "doi": ""
    },
    {
      "text": "P Fromberger, K Jordan, and JL Müller. Anwendung virtueller realitäten in der forensischen psychiatrie. Der Nervenarzt, 85(3):298--303, 2014.",
      "doi": ""
    },
    {
      "text": "Massil Benbouriche, Kevin Nolet, Dominique Trottier, and Patrice Renaud. Virtual reality applications in forensic psychiatry. In Proceedings of the 2014 Virtual Reality International Conference, page 7. ACM, 2014.  ",
      "doi": "10.1145/2617841.2620692"
    },
    {
      "text": "Hanneke Kip, Saskia M Kelders, Kirby Weerink, Ankie Kuiper, Ines Brüninghoff, Yvonne H A Bouman, Dirk Dijkslag, and Lisette JEWC van Gemert-Pijnen. Identifying the added value of virtual reality for treatment in forensic mental health: a scenario-based, qualitative approach. Submitted.",
      "doi": ""
    },
    {
      "text": "Daniel Freeman, Sarah Reeve, A Robinson, Anke Ehlers, David Clark, Bernhard Spanlang, and Mel Slater. Virtual reality in the assessment, understanding, and treatment of mental health disorders. Psychological medicine, 47(14):2393--2400, 2017.",
      "doi": "10.1017/S003329171700040X"
    },
    {
      "text": "Julia Diemer, Georg W Alpers, Henrik M Peperkorn, Youssef Shiban, and Andreas Mühlberger. The impact of perception and presence on emotional reactions: a review of research in virtual reality. Frontiers in psychology, 6:26, 2015.",
      "doi": ""
    },
    {
      "text": "Wesley A Turner and Leanne M Casey. Outcomes associated with virtual reality in psychological interventions: where are we now? Clinical psychology review, 34(8):634--644, 2014.",
      "doi": ""
    },
    {
      "text": "Patrice Renaud, Dominique Trottier, Joanne-Lucine Rouleau, Mathieu Goyette, Chantal Saumur, Tarik Boukhalfi, and Stephane Bouchard. Using immersive virtual reality and anatomically correct computergenerated characters in the forensic assessment of deviant sexual preferences. Virtual Reality, 18(1):37--47, 2014.  ",
      "doi": "10.1007/s10055-013-0235-8"
    },
    {
      "text": "Byeol Kim, Warren Schwartz, Danny Catacora, and Monifa VaughnCooke. Virtual reality behavioral therapy. Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 60(1):356--360, 2016.",
      "doi": ""
    },
    {
      "text": "Susan Michie, Lucy Yardley, Robert West, Kevin Patrick, and Felix Greaves. Developing and evaluating digital interventions to promote behavior change in health and health care: recommendations resulting from an international workshop. Journal of medical Internet research, 19(6), 2017.",
      "doi": ""
    },
    {
      "text": "Lucy Yardley, Leanne Morrison, Katherine Bradbury, and Ingrid Muller. The person-based approach to intervention development: application to digital health-related behavior change interventions. Journal of medical Internet research, 17(1), 2015.",
      "doi": ""
    },
    {
      "text": "Eric B Hekler, Predrag Klasnja, William T Riley, Matthew P Buman, Jennifer Huberty, Daniel E Rivera, and Cesar A Martin. Agile science: creating useful products for behavior change in the real world. Translational behavioral medicine, 6(2):317--328, 2016.",
      "doi": ""
    },
    {
      "text": "Kevin Patrick, Eric B Hekler, Deborah Estrin, David C Mohr, Heleen Riper, David Crane, Job Godino, and William T Riley. The pace of technologic change: implications for digital health behavior intervention research, 2016.",
      "doi": ""
    },
    {
      "text": "Hossein Saiedian and Robert Dale. Requirements engineering: making the connection between the software developer and customer. Information and Software Technology, 42(6):419--428, 2000.",
      "doi": ""
    },
    {
      "text": "Sue S Feldman, Benjamin L Schooley, and Grishma P Bhavsar. Health information exchange implementation: lessons learned and critical success factors from a case study. JMIR medical informatics, 2(2), 2014.",
      "doi": ""
    },
    {
      "text": "Judith Lynne Zaichkowsky. The personal involvement inventory: Reduction, revision, and application to advertising. Journal of advertising, 23(4):59--70, 1994.",
      "doi": ""
    },
    {
      "text": "Saskia M Kelders. Involvement as a working mechanism for persuasive technology. In International Conference on Persuasive Technology, pages 3--14. Springer, 2015.",
      "doi": ""
    },
    {
      "text": "Hennie Boeije. A purposeful approach to the constant comparative method in the analysis of qualitative interviews. Quality and quantity, 36(4):391--409, 2002.",
      "doi": ""
    },
    {
      "text": "Jobke Wentzel, Lex van Velsen, Maarten van Limburg, Nienke de Jong, Joyce Karreman, Ron Hendrix, et al. Participatory ehealth development to support nurses in antimicrobial stewardship. BMC medical informatics and decision making, 14(1):45, 2014.",
      "doi": ""
    },
    {
      "text": "Viswanath Venkatesh and Fred D Davis. A theoretical extension of the technology acceptance model: Four longitudinal field studies. Management science, 46(2):186--204, 2000. ",
      "doi": "10.5555/2786232.2786234"
    },
    {
      "text": "Lex van Velsen, Mirka Evers, Cristian-Dan Bara, Harm Op den Akker, Simone Boerema, and Hermie Hermens. Understanding the acceptance of an ehealth technology in the early stages of development: An enduser walkthrough approach and two case studies. JMIR Formative Research, 2(1):e10474, 2018.",
      "doi": ""
    },
    {
      "text": "Paul Legris, John Ingham, and Pierre Collerette. Why do people use information technology? a critical review of the technology acceptance model. Information and management, 40(3):191--204, 2003. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk Hanneke Kip, Saskia M. Kelders, and Lisette J.E.W.C. van Gemert-Pijnen  ",
      "doi": "10.1016/S0378-7206%2801%2900143-4"
    },
    {
      "text": "Claudia Pagliari. Design and evaluation in ehealth: challenges and implications for an interdisciplinary field. Journal of medical Internet research, 9(2), 2007.",
      "doi": ""
    },
    {
      "text": "Jeppe Agger Nielsen and Lars Mathiassen. Interpretive flexibility in mobile health: Lessons from a government-sponsored home care program. Journal of medical Internet research, 15(10), 2013.",
      "doi": ""
    },
    {
      "text": "Birgitta Bergvall-Kåreborn and Anna Ståhlbröst. User expressions translated into requirements. Human Technology: An Interdisciplinary Journal on Humans in ICT Environments, 2010.",
      "doi": ""
    },
    {
      "text": "Trisha Greenhalgh, Joseph Wherton, Chrysanthi Papoutsi, Jennifer Lynch, Gemma Hughes, Christine A'Court, Susan Hinder, Nick Fahy, Rob Procter, and Sara Shaw. Beyond adoption: a new framework for theorizing and evaluating nonadoption, abandonment, and challenges to the scale-up, spread, and sustainability of health and care technologies. Journal of medical Internet research, 19(11), 2017.",
      "doi": ""
    },
    {
      "text": "Xueni Pan and Antonia F de C Hamilton. Why and how to use virtual reality to study human social interaction: The challenges of exploring a new research landscape. British Journal of Psychology, 2018.",
      "doi": ""
    },
    {
      "text": "Vinoba Vinayagamoorthy, Andrea Brogni, Marco Gillies, Mel Slater, and Anthony Steed. An investigation of presence response across variations in visual realism. In The 7th Annual International Presence Workshop, pages 148--155.",
      "doi": ""
    }
  ]
}