{
  "doi": "10.1145/3290605.3300659",
  "title": "Feeling Fireworks: An Inclusive Tactile Firework Display",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "This paper presents a novel design for a large-scale interactive tactile display. Fast dynamic tactile effects are created at high spatial resolution on a flexible screen, using directable nozzles that spray water jets onto the rear of the screen. The screen further has back-projected visual content and touch interaction. The technology is demonstrated in Feeling Fireworks, a tactile firework show. The goal is to make fireworks more inclusive for the Blind and Low-Vision (BLV) community. A BLV focus group provided input during the development process, and a user study with BLV users showed that Feeling Fireworks is an enjoyable and meaningful experience. A user study with sighted users showed that users could accurately label the correspondence between the designed tactile firework effects and corresponding visual fireworks. Beyond the Feeling Fireworks application, this is a novel approach for scalable tactile displays with potential for broader use.",
  "authors": [
    {
      "name": "Dorothea Reusser",
      "institution": "Disney Research & ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659213726",
      "orcid": "missing"
    },
    {
      "name": "Espen Knoop",
      "institution": "Disney Research, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658705003",
      "orcid": "missing"
    },
    {
      "name": "Roland Siegwart",
      "institution": "ETH Zürich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81325490184",
      "orcid": "missing"
    },
    {
      "name": "Paul Beardsley",
      "institution": "Disney Research, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100489358",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aira website. 2018. aira.io/",
      "doi": ""
    },
    {
      "text": "Olivier Bau, Uros Petrevski, and Wendy Mackay. 2009. BubbleWrap: a textile-based electromagnetic haptic display. In Proc. SIGCHI Conference on Human Factors in Computing Systems, Extended Abstracts. ACM, 3607--3612.  ",
      "doi": "10.1145/1520340.1520542"
    },
    {
      "text": "O. Bau, I. Poupyrev, A. Israr, and C. Harrison. 2010. Tesla Touch: Electrovibration for touch surfaces. Proc. ACM Symposium on User Interface Software and Technology (2010), 283--292.  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Jens Bornschein, Denise Bornschein, and Gerhard Weber. 2018. Comparing Computer-Based Drawing Methods for Blind People with RealTime Tactile Feedback. In Proc. SIGCHI Conference on Human Factors in Computing Systems. ACM, 115.  ",
      "doi": "10.1145/3173574.3173689"
    },
    {
      "text": "Bristol Braille. 2019. http://www.bristolbraille.co.uk/",
      "doi": ""
    },
    {
      "text": "Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: multi-point mid-air haptic feedback for touch surfaces. In Proc. ACM Symposium on User Interface Software and Technology. ACM, 505--514.  ",
      "doi": "10.1145/2501988.2502018"
    },
    {
      "text": "Dot Watch. 2019. https://www.dotincorp.com/",
      "doi": ""
    },
    {
      "text": "eSight. 2017. eSight. https://www.esighteyewear.com/.",
      "doi": ""
    },
    {
      "text": "Exertion Games Lab. 2019. http://exertiongameslab.org/",
      "doi": ""
    },
    {
      "text": "Vocal Eye. 2015. FingerWorks. www.vocaleye.ca/fireworks",
      "doi": ""
    },
    {
      "text": "F. Follmer, D. Leithinger, A. Olwal, A. Hogge, and H. Ishii. 2013. inFORM: Dynamic physical affordances and constraints through shape and object actuation. Proc. ACM Symposium on User Interface Software and Technology (2013), 417--426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Sean Follmer, Micah Johnson, Edward Adelson, and Hiroshi Ishii. 2011. deForm: an interactive malleable surface for capturing 2.5 D arbitrary objects, tools and touch. In Proc. ACM Symposium on User Interface Software and Technology. ACM, 527--536.  ",
      "doi": "10.1145/2047196.2047265"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Nadia Cheng, and Hiroshi Ishii. 2012. Jamming user interfaces: programmable particle stiffness and sensing for malleable and shape-changing devices. In Proc. ACM Symposium on User Interface Software and Technology. ACM, 519--528.  ",
      "doi": "10.1145/2380116.2380181"
    },
    {
      "text": "FWsim. 2017. FWsim firework simulation. www.fwsim.com.",
      "doi": ""
    },
    {
      "text": "Louis H Goldish and Harry E Taylor. 1974. The Optacon: A Valuable Device for Blind Persons. New Outlook for the Blind 68, 2 (1974), 49--56.",
      "doi": ""
    },
    {
      "text": "Timo Götzelmann. 2016. LucentMaps: 3D printed audiovisual tactile maps for blind and visually impaired people. In Proc. ACM SIGACCESS Conference on Computers and Accessibility. ACM, 81--90.  ",
      "doi": "10.1145/2982142.2982163"
    },
    {
      "text": "Graphiti. 2019. https://www.aph.org/graphiti/",
      "doi": ""
    },
    {
      "text": "Richa Gupta, M Balakrishnan, and PVM Rao. 2017. Tactile Diagrams for the Visually Impaired. IEEE Potentials 36, 1 (2017), 14--18.",
      "doi": ""
    },
    {
      "text": "Junge Symphoniker Hamburg. 2016. Sound Shirt. https://sound-shirt. jimdo.com/english-1/ Feeling Fireworks: An Inclusive Tactile Firework Display CHI 2019, May 4--9, 2019, Glasgow, Scotland, UK",
      "doi": ""
    },
    {
      "text": "John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. 2015. Shapeclip: towards rapid prototyping with shapechanging displays for designers. In Proc. ACM Conference on Human Factors in Computing Systems. ACM, 19--28.  ",
      "doi": "10.1145/2702123.2702599"
    },
    {
      "text": "Chris Harrison and Scott E Hudson. 2009. Providing dynamically changeable physical buttons on a visual display. In Proc. SIGCHI Conference on Human Factors in Computing Systems. ACM, 299--308.  ",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "HIMS, Inc. 2017. Braille Sense U2 QWERTY. https://hims-inc.com/ products/braille-sense-u2-qwerty/.",
      "doi": ""
    },
    {
      "text": "HyperBraille. 2019. http://hyperbraille.de/?lang=en",
      "doi": ""
    },
    {
      "text": "A. Israr and I. Poupyrev. 2011. Tactile Brush: Drawing on skin with a tactile grid display. Proc. SIGCHI Conference on Human Factors in Computing Systems (2011).  ",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "Hiroo Iwata, Hiroaki Yano, Fumitaka Nakaizumi, and Ryo Kawamura. 2001. Project FEELEX: adding haptic surface to graphics. In Proc. Conference on Computer Graphics and Interactive Techniques. ACM, 469--476.  ",
      "doi": "10.1145/383259.383314"
    },
    {
      "text": "Yvonne Jansen, Thorsten Karrer, and Jan Borchers. 2011. MudPad: tactile feedback for touch surfaces. In Proc. SIGCHI Conference on Human Factors in Computing Systems, Extended Abstracts. ACM, 323-- 328.  ",
      "doi": "10.1145/1979742.1979702"
    },
    {
      "text": "Jingun Jung, Eunhye Youn, and Geehyuk Lee. 2017. PinPad: Touchpad Interaction with Fast and High-Resolution Tactile Output. In Proc. SIGCHI Conference on Human Factors in Computing Systems. ACM, 2416--2425.  ",
      "doi": "10.1145/3025453.3025971"
    },
    {
      "text": "Jeeeun Kim and Tom Yeh. 2015. Toward 3d-printed movable tactile pictures for children with visual impairments. In Proc. SIGCHI Conference on Human Factors in Computing Systems. ACM, 2815--2824.  ",
      "doi": "10.1145/2702123.2702144"
    },
    {
      "text": "Philip Kingsley. 2012. eTable: A haptic elastic table for 3D multi-touch interactions. Master's thesis. University of Bristol.",
      "doi": ""
    },
    {
      "text": "Espen Knoop and Jonathan Rossiter. 2015. A compliant soft-actuator laterotactile display. Smart Materials and Structures 24, 4 (2015), 045034.",
      "doi": ""
    },
    {
      "text": "Espen Knoop and Jonathan Rossiter. 2015. The tickler: a compliant wearable tactile display for stroking and tickling. In Proc. SIGCHI Conference on Human Factors in Computing Systems, Extended Abstracts. ACM, 1133--1138.  ",
      "doi": "10.1145/2702613.2732749"
    },
    {
      "text": "Gary G. Koch, J. Richard Landis, Jean L. Freeman, Daniel H. Freeman, and Robert G. Lehnen. 1977. A General Methodology for the Analysis of Experiments with Repeated Measurement of Categorical Data. Biometrics 33, 1 (1977), 133--158.",
      "doi": ""
    },
    {
      "text": "Ki-Uk Kyung, Jeong Mook Lim, Yo-An Lim, Suntak Park, Seung Koo Park, Inwook Hwang, Seungmoon Choi, Jongman Seo, Sang-Youn Kim, Tae-Heon Yang, et al. 2011. TAXEL: Initial progress toward selfmorphing visio-haptic interface. In World Haptics Conference (WHC), 2011 IEEE. IEEE, 37--42.",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Roberta L Klatzky. 2009. Haptic perception: A tutorial. Attention, Perception, & Psychophysics 71, 7 (2009), 1439--1459.",
      "doi": ""
    },
    {
      "text": "B. Long, S. Seah, T. Carter, and S. Subramanian. 2014. Rendering volumetric haptic shapes in mid-air using ultrasound. ACM Transactions on Graphics 33, 6 (2014).  ",
      "doi": "10.1145/2661229.2661257"
    },
    {
      "text": "Nature News. 2001. Deaf people use 'mind's ear' to process vibrations. http://www.nature.com/news/2001/011127/full/news011129--10.html.",
      "doi": ""
    },
    {
      "text": "Claudio Pacchierotti, Stephen Sinclair, Massimiliano Solazzi, Antonio Frisoli, Vincent Hayward, and Domenico Prattichizzo. 2017. Wearable haptic systems for the fingertip and the hand: taxonomy, review, and perspectives. IEEE Transactions on Haptics (2017).  ",
      "doi": "10.1109/TOH.2017.2689006"
    },
    {
      "text": "Yosra Rekik, Eric Vezzoli, Laurent Grisoni, and Frédéric Giraud. 2017. Localized Haptic Texture: A Rendering Technique based on Taxels for High Density Tactile Feedback. In Proc. SIGCHI Conference on Human Factors in Computing Systems. ACM, 5006--5015.  ",
      "doi": "10.1145/3025453.3026010"
    },
    {
      "text": "D. R. Sahoo, K. Hornbæk, and S. Subramanian. 2016. TableHop: An actuated fabric display using transparent electrodes. Proc. SIGCHI Conference on Human Factors in Computing Systems (2016), 3767--3780.  ",
      "doi": "10.1145/2858036.2858544"
    },
    {
      "text": "Samuel B Schorr and Allison M Okamura. 2017. Fingertip Tactile Devices for Virtual Object Manipulation and Exploration. In Proc. SIGCHI Conference on Human Factors in Computing Systems. ACM, 3115--3119.  ",
      "doi": "10.1145/3025453.3025744"
    },
    {
      "text": "Lei Shi, Ross McLachlan, Yuhang Zhao, and Shiri Azenkot. 2016. Magic Touch: Interacting with 3D Printed Graphics. In Proc. ACM SIGACCESS Conference on Computers and Accessibility. ACM, 329--330.  ",
      "doi": "10.1145/2982142.2982153"
    },
    {
      "text": "L. Shuai, Y. Kuang, and Z. Zhou. 2005. Research on robot tactile display based on water jet technology. Robotics and Biomimetics (ROBIO). 2005 IEEE Int. Conf. (2005).",
      "doi": ""
    },
    {
      "text": "Daniel Spelmezan, Deepak Ranjan Sahoo, and Sriram Subramanian. 2017. Sparkle: hover feedback with touchable electric arcs. In Proc. SIGCHI Conference on Human Factors in Computing Systems. ACM, 3705--3717.  ",
      "doi": "10.1145/3025453.3025782"
    },
    {
      "text": "Saiganesh Swaminathan, Thijs Roumen, Robert Kovacs, David Stangl, Stefanie Mueller, and Patrick Baudisch. 2016. Linespace: A sensemaking platform for the blind. In Proc. SIGCHI Conference on Human Factors in Computing Systems. ACM, 2175--2185.  ",
      "doi": "10.1145/2858036.2858245"
    },
    {
      "text": "Tactile Labs. 2017. Haptuator Mark II. http://tactilelabs.com/products/ haptics/haptuator-mark-ii-v2/.",
      "doi": ""
    },
    {
      "text": "Brandon Taylor, Anind Dey, Dan Siewiorek, and Asim Smailagic. 2016. Customizable 3D printed tactile maps as interactive overlays. In Proc. ACM SIGACCESS Conference on Computers and Accessibility. ACM, 71--79.  ",
      "doi": "10.1145/2982142.2982167"
    },
    {
      "text": "Giovanni Maria Troiano, Esben Warming Pedersen, and Kasper Hornbæk. 2014. User-defined gestures for elastic, deformable displays. In Proc. Int. Working Conference on Advanced Visual Interfaces. ACM, 1--8.  ",
      "doi": "10.1145/2598153.2598184"
    },
    {
      "text": "Dzmitry Tsetserukou, Alena Neviarouskaya, Helmut Prendinger, Naoki Kawakami, and Susumu Tachi. 2009. Affective haptics in emotional communication. In Int. Conf. Affective Computing and Intelligent Interaction. IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Jessica Tsimeris, Colin Dedman, Michael Broughton, and Tom Gedeon. 2013. ForceForm: a dynamically deformable interactive surface. In Proc. ACM Int. Conf. Interactive Tabletops and Surfaces. ACM, 175--178.  ",
      "doi": "10.1145/2512349.2512807"
    },
    {
      "text": "Marlon Twyman, Joe Mullenbach, Craig Shultz, J Edward Colgate, and Anne Marie Piper. 2015. Designing wearable haptic information displays for people with vision impairments. In Proc. Int. Conf. on Tangible, Embedded, and Embodied Interaction. ACM, 341--344.  ",
      "doi": "10.1145/2677199.2680578"
    },
    {
      "text": "Thorsten Völkel, Gerhard Weber, and Ulrich Baumann. 2008. Tactile graphics revised: the novel brailledis 9000 pin-matrix device with multitouch input. In Int. Conf. Computers for Handicapped Persons. Springer, 835--842.  ",
      "doi": "10.1007/978-3-540-70540-6_124"
    },
    {
      "text": "Rongrong Wang, Francis Quek, James KS Teh, Adrian D Cheok, and Sep Riang Lai. 2010. Design and evaluation of a wearable remote social touch device. In Int. Conf. Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction. ACM, 45.  ",
      "doi": "10.1145/1891903.1891959"
    },
    {
      "text": "Wayfindr. 2017. Wayfindr. https://www.wayfindr.net/.",
      "doi": ""
    },
    {
      "text": "Be My Eyes website. 2018. www.bemyeyes.com",
      "doi": ""
    },
    {
      "text": "Laura Winfield, John Glassmire, J Edward Colgate, and Michael Peshkin. 2007. T-pad: Tactile pattern display through variable friction reduction. In World Haptics Conference. IEEE, 421--426.  ",
      "doi": "10.1109/WHC.2007.105"
    },
    {
      "text": "Cheng Xu, Ali Israr, Ivan Poupyrev, Olivier Bau, and Chris Harrison. 2011. Tactile display for the visually impaired using TeslaTouch. In Proc. SIGCHI Conference on Human Factors in Computing Systems, Extended Abstracts. ACM, 317--322.  ",
      "doi": "10.1145/1979742.1979705"
    },
    {
      "text": "Juan Jose Zarate, Olexandr Gudozhnik, Anthony Sébastien Ruch, and Herbert Shea. 2017. Keep in Touch. In Proc. SIGCHI Conference on Human Factors in Computing Systems, Extended Abstracts. ACM Press, 349--352.  ",
      "doi": "10.1145/3027063.3052957"
    }
  ]
}