{
  "doi": "10.1145/3290605.3300464",
  "title": "\"What's Happening at that Hip?\": Evaluating an On-body Projection based Augmented Reality System for Physiotherapy Classroom",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We present two studies to discuss the design, usability analysis, and educational outcome resulting from our system Augmented Body in physiotherapy classroom. We build on prior user-centric design work that investigates existing teaching methods and discuss opportunities for intervention. We present the design and implementation of a hybrid system for physiotherapy education combining an on-body projection based virtual anatomy supplemented by pen-based tablets to create real-time annotations. We conducted a usability evaluation of this system, comparing with projection only and traditional teaching conditions. Finally, we focus on a comparative study to evaluate learning outcome among students in actual classroom settings. Our studies showed increased usage of visual representation techniques in students'11 note taking behavior and statistically significant improvement in some learning aspects. We discuss challenges for designing augmented reality systems for education, including minimizing attention split, addressing text-entry issues, and digital annotations on a moving physical body.",
  "tags": [
    "annotation",
    "augmented reality",
    "projection mapping",
    "educational system",
    "pen-based interactions"
  ],
  "authors": [
    {
      "name": "Hasan Shahid Ferdous",
      "institution": "University of Melbourne, Melbourne, Victoria, Australia",
      "img": "/do/10.1145/contrib-81467669958/rel-imgonly/9253_10151240800160126_311432181_n.jpg",
      "acmid": "81467669958",
      "orcid": "missing"
    },
    {
      "name": "Thuong Hoang",
      "institution": "Deakin University, Burwood, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442608558",
      "orcid": "0000-0001-7354-260X"
    },
    {
      "name": "Zaher Joukhadar",
      "institution": "University of Melbourne, Melbourne, Australia",
      "img": "/do/10.1145/contrib-99659160139/rel-imgonly/14519891_10154577623286800_765132742204248888_n.jpg",
      "acmid": "99659160139",
      "orcid": "missing"
    },
    {
      "name": "Martin N. Reinoso",
      "institution": "University of Melbourne, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659082269",
      "orcid": "0000-0003-1008-1935"
    },
    {
      "name": "Frank Vetere",
      "institution": "University of Melbourne, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100490463/rel-imgonly/photo-vetereciswebsite.jpeg",
      "acmid": "81100490463",
      "orcid": "0000-0003-3727-9204"
    },
    {
      "name": "David Kelly",
      "institution": "University of Melbourne, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161600",
      "orcid": "missing"
    },
    {
      "name": "Louisa Remedios",
      "institution": "University of Melbourne, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365310",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Murat Akçayr and Gökçe Akçaykr. 2017. Advantages and Challenges Associated with Augmented Reality for Education: ASystematic Review of the Literature. Educational Research Review 20 (2017), 1--11.",
      "doi": ""
    },
    {
      "text": "Daniel Andersen, Voicu Popescu, Maria Eugenia Cabrera, Aditya Shanghavi, Gerardo Gomez,Sherri Marley,Brian Mullis,and Juan Wachs. 2016. Virtual Annotations of the Surgical Field through an Augmented Reality Transparent Display. The Visual Computer 32, 11 (2016), 1481--1498.  ",
      "doi": "10.1007/s00371-015-1135-6"
    },
    {
      "text": "Jorge Bacca, Silvia Baldiris, Ramon Fabregat, and Sabine Graf. 2014. Augmented Reality Trends in Education: a Systematic Review of Research and Applications. Journal of Educational Technology & Society 17, 4 (2014), 133.",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst, Adrian Clark, and Gun Lee. 2015. A Survey of Augmented Reality. Foundations and Trends in Human Computer Interaction 8, 2--3 (2015), 73--272.  ",
      "doi": "10.1561/1100000049"
    },
    {
      "text": "A. Bornik, R. Beichel, E. Kruijff, B. Reitinger, and D. Schmalstieg. 2006. A Hybrid User Interface for Manipulation of Volumetric Medical Data. In 3D User Interfaces (3DUI'06). 29--36. ",
      "doi": ""
    },
    {
      "text": "Matt Dunleavy and Chris Dede. 2014. Augmented Reality Teaching and Learning. Springer, 735--745.",
      "doi": ""
    },
    {
      "text": "Steven Feiner and Ari Shamash. 1991. Hybrid User Interfaces: Breeding Virtually Bigger Interfaces for Physically Smaller Computers. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (UIST '91). ACM, 9--17.  ",
      "doi": "10.1145/120782.120783"
    },
    {
      "text": "Jonathan Fish and Stephen Scrivener. 1990. Amplifying the Mind's Eye: Sketching and Visual Cognition. Leonardo (1990), 117--126.",
      "doi": ""
    },
    {
      "text": "D. Gorgan, T. Stefanut, and B. Gavrea. 2007. Pen Based Graphical Annotation in Medical Education. In Proceedings of IEEE International Symposium on Computer-Based Medical Systems (CBMS'07). 681--686.  ",
      "doi": "10.1109/CBMS.2007.84"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASATLX (Task Load Index): Results of Empirical and Theoretical Research. Advances in Psychology 52 (1988), 139--183.",
      "doi": ""
    },
    {
      "text": "Thuong Hoang, Martin Reinoso, Zaher Joukhadar, Frank Vetere, and David Kelly. 2017. Augmented Studio: Projection Mapping on Moving Body for Physiotherapy Education. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, 1419--1430.  ",
      "doi": "10.1145/3025453.3025860"
    },
    {
      "text": "Thuong N. Hoang, Hasan S. Ferdous, Frank Vetere, and Martin Reinoso. 2018. Body As a Canvas: An Exploration on the Role of the Body As Display of Digital Information. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, 253--263.  ",
      "doi": "10.1145/3196709.3196724"
    },
    {
      "text": "Brett Jones, Rajinder Sodhi, Michael Murdock, Ravish Mehra, Hrvoje Benko, Andrew Wilson, Eyal Ofek, Blair MacIntyre, Nikunj Raghuvanshi,and Lior Shapira.2014. RoomAlive: Magical Experiences Enabled by Scalable, Adaptive Projector-camera Units. In Proceedings of the Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, 637--644.  ",
      "doi": "10.1145/2642918.2647383"
    },
    {
      "text": "Seungwon Kim, Gun A. Lee, Sangtae Ha, Nobuchika Sakata, and Mark Billinghurst. 2015. Automatically Freezing Live Video for Annotation During Remote Collaboration. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHIEA'15).ACM,1669--1674.  ",
      "doi": "10.1145/2702613.2732838"
    },
    {
      "text": "Veera Bhadra Harish Mandalika, Alexander I. Chernoglazov, Mark Billinghurst, Christoph Bartneck, Michael A. Hurrell, Niels de Ruiter, Anthony P. H. Butler, and Philip H. Butler. 2017. A Hybrid 2D/3D User Interface for Radiological Diagnosis. Journal of Digital Imaging (2017).",
      "doi": ""
    },
    {
      "text": "Paul G McMenamin. 2008. Body Painting as a Tool in Clinical Anatomy Teaching. Anatomical Sciences Education 1, 4 (2008), 139--144.",
      "doi": ""
    },
    {
      "text": "Ridwan R. Noel, Asif Salekin, Raihanul Islam, Sazzadur Rahaman, Rakibul Hasan, and Hasan S. Ferdous. 2011. A Natural User Interface Classroom based on Kinect. IEEE Learning Technology 13, 4 (2011).",
      "doi": ""
    },
    {
      "text": "Sharon Oviatt. 2006. Human-centered Design Meets Cognitive Load Theory: Designing Interfaces That Help People Think. In Proceedings of the 14th ACM International Conference on Multimedia (MM '06). ACM, 871--880.  ",
      "doi": "10.1145/1180639.1180831"
    },
    {
      "text": "Thomas V Perneger. 1998. What's Wrong with Bonferroni Adjustments. Bmj 316, 7139 (1998), 1236--1238.",
      "doi": ""
    },
    {
      "text": "Iulian Radu. 2014. Augmented Reality in Education: A Meta-review and Cross-media Analysis. Personal Ubiquitous Computing 18, 6 (Aug. 2014), 1533--1543.  ",
      "doi": "10.1007/s00779-013-0747-y"
    },
    {
      "text": "Dawid Sobel, Jan Kwiatkowski, Artur Ryt, Mariusz Domzal, Karol Jedrasiak, Lukasz Janik, and Aleksander Nawrat. 2014. Range of Motion Measurements Using Motion Capture Data and Augmented Reality Visualisation (Computer Vision and Graphics). Springer International Publishing, 594--601.",
      "doi": ""
    },
    {
      "text": "Matthew Turk. 2014. Multimodal Interaction: A Review. Pattern Recognition Letters 36, Supplement C (2014), 189--195.  ",
      "doi": "10.1016/j.patrec.2013.07.003"
    },
    {
      "text": "DWF Van Krevelen and Ronald Poelman. 2010. A Survey of Augmented Reality Technologies, Applications and Limitations. International Journal of Virtual Reality 9, 2 (2010), 1.",
      "doi": ""
    },
    {
      "text": "Steven G Vandenberg and Allan R Kuse. 1978. Mental Rotations, a Group Test of Three-dimensional Spatial Visualization. Perceptual and motor skills 47, 2 (1978), 599--604.",
      "doi": ""
    },
    {
      "text": "Hsin-Kai Wu, Silvia Wen-Yu Lee, Hsin-Yi Chang, and Jyh-Chong Liang. 2013. Current Status, Opportunities and Challenges of Augmented Reality in Education. Computers & Education 62 (2013), 41--49.",
      "doi": ""
    }
  ]
}