{
  "doi": "10.1145/3290605.3300401",
  "title": "HaptiVec: Presenting Haptic Feedback Vectors in Handheld Controllers using Embedded Tactile Pin Arrays",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "HaptiVec is a new haptic feedback paradigm for handheld controllers which allows users to feel directional haptic pressure vectors on their fingers and hands while interacting with virtual environments. We embed a 3 by 5 tactile pin array (with an average pin spacing of 25 mm) into the handles of two custom VR type controllers. By presenting directional pressure vectors in eight cardinal directions (N, NE, E, SE, S, SW, W, NW) to users without prior training, they were able to distinguish the correct direction with an accuracy of at least 79%. We illustrate two applications where our device enhances virtual experiences over traditional vibrotactile feedback. In the first application, through the classic first-person shooter Doom, we demonstrate that users can receive directional pressure feedback corresponding to the direction of incident enemy projectiles. In the second application, we demonstrate how our controller can create a more immersive experience by allowing the user to feel their virtual climate by randomizing the directional vectors and presenting the user with \"haptic rain\" which adapts with the intensity of the rainfall.",
  "tags": [
    "haptics",
    "tactile display",
    "controller",
    "virtual reality"
  ],
  "authors": [
    {
      "name": "Daniel K.Y. Chen",
      "institution": "Shanghai Jiao Tong University, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366330",
      "orcid": "missing"
    },
    {
      "name": "Jean-Baptiste Chossat",
      "institution": "Shanghai Jiao Tong University, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365753",
      "orcid": "missing"
    },
    {
      "name": "Peter B. Shull",
      "institution": "Shanghai Jiao Tong University, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456632965",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "3D Sytems company website. 2018. The Touch Haptic Device. Https: //Www.3dsystems.com/Haptics-Devices/Touch. Online; accessed 20-September-2018.",
      "doi": ""
    },
    {
      "text": "Tomohiro Amemiya and Hiroaki Gomi. 2013. Directional torque perception with brief, asymmetric net rotation of a flywheel. IEEE transactions on haptics 6, 3 (2013), 370--375.  ",
      "doi": "10.1109/TOH.2012.38"
    },
    {
      "text": "Tomohiro Amemiya and Hiroaki Gomi. 2016. Active manual movement improves directional perception of illusory force. IEEE transactions on haptics 9, 4 (2016), 465--473.  ",
      "doi": "10.1109/TOH.2016.2587624"
    },
    {
      "text": "Tomohiro Amemiya and Taro Maeda. 2008. Asymmetric oscillation distorts the perceived heaviness of handheld objects. IEEE Transactions on Haptics 1, 1 (2008), 9--18.  ",
      "doi": "10.1109/TOH.2008.5"
    },
    {
      "text": "Tomohiro Amemiya and Taro Maeda. 2009. Directional force sensation by asymmetric oscillation from a double-layer slider-crank mechanism. Journal of computing and information science in engineering 9, 1 (2009), 011001.",
      "doi": ""
    },
    {
      "text": "Tomohiro Amemiya and Hisashi Sugiyama. 2009. Navigation in eight cardinal directions with pseudo-attraction force for the visually impaired. In Systems, Man and Cybernetics, 2009. SMC 2009. IEEE International Conference on. IEEE, 27--32. ",
      "doi": "10.5555/1732323.1732329"
    },
    {
      "text": "Cagatay Basdogan, Suvranu De, Jung Kim, Manivannan Muniyandi, Hyun Kim, and Mandayam A Srinivasan. 2004. Haptics in minimally invasive surgical simulation and training. IEEE computer graphics and applications 2 (2004), 56--64.  ",
      "doi": "10.1109/MCG.2004.1274062"
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. Normaltouch and texturetouch: High-fidelity 3d haptic shape rendering on handheld virtual reality controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 717--728.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Ulf Berglund and Birgitta Berglund. 1970. Adaptation and recovery in vibrotactile perception. Perceptual and motor skills 30, 3 (1970), 843--853.",
      "doi": ""
    },
    {
      "text": "Grigore C Burdea. 1996. Force and touch feedback for virtual reality. (1996). ",
      "doi": "10.5555/232471"
    },
    {
      "text": "Marta G Carcedo, Soon Hau Chua, Simon Perrault, Pawel Wozniak, Raj Joshi, Mohammad Obaid, Morten Fjeld, and Shengdong Zhao. 2016. Hapticolor: Interpolating color information as haptic feedback to assist the colorblind. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3572--3583.  ",
      "doi": "10.1145/2858036.2858220"
    },
    {
      "text": "Daniel KY Chen, Iain A Anderson, Cameron G Walker, and Thor F Besier. 2016. Lower extremity lateral skin stretch perception for haptic feedback. IEEE transactions on haptics 9, 1 (2016), 62--68.  ",
      "doi": "10.1109/TOH.2016.2516012"
    },
    {
      "text": "Daniel KY Chen, Markus Haller, and Thor F Besier. 2017. Wearable lower limb haptic feedback device for retraining Foot Progression Angle and Step Width. Gait & posture 55 (2017), 177--183.",
      "doi": ""
    },
    {
      "text": "Francesco Chinello, Monica Malvezzi, Claudio Pacchierotti, and Domenico Prattichizzo. 2015. Design and development of a 3RRS wearable fingertip cutaneous device. In Advanced Intelligent Mechatronics (AIM), 2015 IEEE International Conference on. IEEE, 293--298.",
      "doi": ""
    },
    {
      "text": "Francesco Chinello, Claudio Pacchierotti, Nikos G Tsagarakis, and Domenico Prattichizzo. 2016. Design of a wearable skin stretch cutaneous device for the upper limb. In Haptics Symposium (HAPTICS), 2016 IEEE. IEEE, 14--20.",
      "doi": ""
    },
    {
      "text": "Chocolate Doom community. 2018. Chocolate Doom Wiki. https: //www.chocolate-doom.org/wiki/index.php/Chocolate_Doom. Online; accessed 21-September-2018.",
      "doi": ""
    },
    {
      "text": "Inrak Choi, Heather Culbertson, Mark R Miller, Alex Olwal, and Sean Follmer. 2017. Grabity: A Wearable Haptic Interface for Simulating Weight and Grasping in Virtual Reality. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 119--130.  ",
      "doi": "10.1145/3126594.3126599"
    },
    {
      "text": "Inrak Choi, Eyal Ofek, Hrvoje Benko, Mike Sinclair, and Christian Holz. 2018. CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 654.  ",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "Roger W Cholewiak and Amy A Collins. 2003. Vibrotactile localization on the arm: Effects of place, space, and age. Perception & psychophysics 65, 7 (2003), 1058--1077.",
      "doi": ""
    },
    {
      "text": "Heather Culbertson, Julie M Walker, and Allison M Okamura. 2016. Modeling and design of asymmetric vibrations to induce ungrounded pulling sensation through asymmetric skin displacement. In Haptics Symposium (HAPTICS), 2016 IEEE. IEEE, 27--33.",
      "doi": ""
    },
    {
      "text": "Heather Culbertson, Julie M Walker, Michael Raitor, and Allison M Okamura. 2017. WAVES: a wearable asymmetric vibration excitation system for presenting three-dimensional translation and rotation cues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4972--4982.  ",
      "doi": "10.1145/3025453.3025741"
    },
    {
      "text": "Abdulmotaleb El Saddik, Mauricio Orozco, Mohamad Eid, and Jongeun Cha. 2011. Haptics technologies: bringing touch to multimedia. Springer Science & Business Media. ",
      "doi": "10.5555/2095937"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation.. In Uist, Vol. 13. 417--426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Massimiliano Gabardi, Massimiliano Solazzi, Daniele Leonardis, and Antonio Frisoli. 2016. A new wearable fingertip haptic interface for the rendering of virtual shapes and surface features. In Haptics Symposium (HAPTICS), 2016 IEEE. IEEE, 140--146.",
      "doi": ""
    },
    {
      "text": "S Gilman. 2002. Joint position sense and vibration sense: anatomical organisation and assessment. Journal of Neurology, Neurosurgery & Psychiatry 73, 5 (2002), 473--477.",
      "doi": ""
    },
    {
      "text": "Brian T Gleeson, Scott K Horschel, and William R Provancher. 2010. Perception of direction for applied tangential skin displacement: Effects of speed, displacement, and repetition. IEEE transactions on haptics 3, 3 (2010), 177--188.  ",
      "doi": "10.1109/TOH.2010.20"
    },
    {
      "text": "Ashley L Guinan, Nathaniel A Caswell, Frank A Drews, and William R Provancher. 2013. A video game controller with skin stretch haptic feedback. In Consumer Electronics (ICCE), 2013 IEEE International Conference on. IEEE, 456--457.",
      "doi": ""
    },
    {
      "text": "Ping-Hsuan Han, Yang-Sheng Chen, Kai-Ti Yang, Wei-Shu Chuan, YuTong Chang, Tin-Ming Yang, Jia-Yan Lin, Kong-Chang Lee, Chiao-En Hsieh, Lai-Chung Lee, et al. 2017. BoEs: attachable haptics bits on gaming controller for designing interactive gameplay. In SIGGRAPH Asia 2017 VR Showcase. ACM, 3.  ",
      "doi": "10.1145/3139468.3139474"
    },
    {
      "text": "Takuya Handa, Makiko Azuma, Toshihiro Shimizu, and Satoru Kondo. 2017. GraspForm: Shape and Hardness Rendering on Handheld Device toward Universal Interface for 3D Haptic TV. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 147--149.  ",
      "doi": "10.1145/3131785.3131824"
    },
    {
      "text": "Blake Hannaford and Allison M Okamura. 2016. Haptics. In Springer Handbook of Robotics. Springer, 1063--1084.",
      "doi": ""
    },
    {
      "text": "Robert D Howe, William J Peine, Dimitrios A Kontarinis, and Jae S Son. 1995. Remote palpation technology for surgical applications. IEEE Engineering in Medicine and Biology Magazine 14, 3 (1995), 318--323.",
      "doi": ""
    },
    {
      "text": "J Timothy Inglis, Paul M Kennedy, Cari Wells, and Romeo Chua. 2002. The role of cutaneous receptors in the foot. In Sensorimotor control of movement and posture. Springer, 111--117.",
      "doi": ""
    },
    {
      "text": "Ali Israr, Siyan Zhao, Kaitlyn Schwalje, Roberta Klatzky, and Jill Lehman. 2014. Feel effects: enriching storytelling with haptic feedback. ACM Transactions on Applied Perception (TAP) 11, 3 (2014), 11.  ",
      "doi": "10.1145/2641570"
    },
    {
      "text": "Sungjune Jang, Lawrence H Kim, Kesler Tanner, Hiroshi Ishii, and Sean Follmer. 2016. Haptic edge display for mobile tactile interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3706--3716.  ",
      "doi": "10.1145/2858036.2858264"
    },
    {
      "text": "Roland S Johansson and Åke B Vallbo. 1983. Tactile sensory coding in the glabrous skin of the human hand. Trends in neurosciences 6 (1983), 27--32.",
      "doi": ""
    },
    {
      "text": "Lynette A Jones, Brett Lockyer, and Erin Piateski. 2006. Tactile display and vibrotactile pattern recognition on the torso. Advanced Robotics 20, 12 (2006), 1359--1374.",
      "doi": ""
    },
    {
      "text": "Topi Kaaresoja and Jukka Linjama. 2005. Perception of short tactile pulses generated by a vibration motor in a mobile phone. In Eurohaptics Conference, 2005 and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2005. World Haptics 2005. First Joint. IEEE, 471--472.  ",
      "doi": "10.1109/WHC.2005.103"
    },
    {
      "text": "Pulkit Kapur, Mallory Jensen, Laurel J Buxbaum, Steven A Jax, and Katherine J Kuchenbecker. 2010. Spatially distributed tactile feedback for kinesthetic motion guidance. (2010).",
      "doi": ""
    },
    {
      "text": "Seung-Chan Kim, Chong-Hui Kim, Gi-Hun Yang, Tae-Heon Yang, Byung-Kil Han, Sung-Chul Kang, and Dong-Soo Kwon. 2009. Small and lightweight tactile display (SaLT) and its application. In EuroHaptics conference, 2009 and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics 2009. Third Joint. IEEE, 69--74.  ",
      "doi": "10.1109/WHC.2009.4810820"
    },
    {
      "text": "Martin Knibestöl. 1975. Stimulus-response functions of slowly adapting mechanoreceptors in the human glabrous skin area. the Journal of Physiology 245, 1 (1975), 63--80.",
      "doi": ""
    },
    {
      "text": "Ki-Uk Kyung and Jun-Young Lee. 2009. Ubi-Pen: a haptic interface with texture and vibrotactile display. IEEE Computer Graphics and Applications 29, 1 (2009).",
      "doi": ""
    },
    {
      "text": "Matthew Heironimus. 2018. Arduino Joystick Library. https://github. com/MHeironimus/ArduinoJoystickLibrary. Online; accessed 21September-2018.",
      "doi": ""
    },
    {
      "text": "Kouta Minamizawa, Souichiro Fukamachi, Hiroyuki Kajimoto, Naoki Kawakami, and Susumu Tachi. 2007. Gravity grabber: wearable haptic display to present virtual mass sensation. In ACM SIGGRAPH 2007 emerging technologies. ACM, 8.  ",
      "doi": "10.1145/1278280.1278289"
    },
    {
      "text": "Vernon B Mountcastle. 2005. The sensory hand: neural mechanisms of somatic sensation. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Richard C Oldfield. 1971. The assessment and analysis of handedness: the Edinburgh inventory. Neuropsychologia 9, 1 (1971), 97--113.",
      "doi": ""
    },
    {
      "text": "Claudio Pacchierotti, Asad Tirmizi, and Domenico Prattichizzo. 2014. Improving transparency in teleoperation by means of cutaneous tactile force feedback. ACM Transactions on Applied Perception (TAP) 11, 1 (2014), 4.  ",
      "doi": "10.1145/2604969"
    },
    {
      "text": "Mark Paterson. 2007. The senses of touch: Haptics, affects and technologies. Berg.",
      "doi": ""
    },
    {
      "text": "Erin Piateski and Lynette Jones. 2005. Vibrotactile pattern recognition on the arm and torso. In Eurohaptics Conference, 2005 and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems, 2005. World Haptics 2005. First Joint. IEEE, 90--95.  ",
      "doi": "10.1109/WHC.2005.143"
    },
    {
      "text": "Ivan Poupyrev, Tatsushi Nashida, Shigeaki Maruyama, Jun Rekimoto, and Yasufumi Yamaji. 2004. Lumen: interactive visual and shape display for calm computing. In ACM SIGGRAPH 2004 Emerging technologies. ACM, 17.  ",
      "doi": "10.1145/1186155.1186173"
    },
    {
      "text": "Charles H Rogers. 1970. Choice of stimulator frequency for tactile arrays. IEEE Transactions on Man-Machine Systems 11, 1 (1970), 5--11.",
      "doi": ""
    },
    {
      "text": "Sonja Rümelin, Enrico Rukzio, and Robert Hardy. 2011. NaviRadar: a novel tactile information display for pedestrian navigation. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 293--302.  ",
      "doi": "10.1145/2047196.2047234"
    },
    {
      "text": "Yutaka Shimizu, Shinya Saida, and Hiroshi Shimura. 1993. Tactile pattern recognition by graphic display: Importance of 3-D information for haptic perception of familiar objects. Perception & Psychophysics 53, 1 (1993), 43--48.",
      "doi": ""
    },
    {
      "text": "Adam J Spiers and Aaron M Dollar. 2017. Design and evaluation of shape-changing haptic interfaces for pedestrian navigation assistance. IEEE transactions on haptics 10, 1 (2017), 17--28.  ",
      "doi": "10.1109/TOH.2016.2582481"
    },
    {
      "text": "P Ström, Leif Hedman, L Särnå, A Kjellin, T Wredmark, and L FelländerTsai. 2006. Early exposure to haptic feedback enhances performance in surgical simulator training: a prospective randomized crossover study in surgical residents. Surgical endoscopy and other interventional techniques 20, 9 (2006), 1383--1388.",
      "doi": ""
    },
    {
      "text": "Jonathan Tong, Oliver Mao, and Daniel Goldreich. 2013. Two-point orientation discrimination versus the traditional two-point test for tactile spatial acuity assessment. Frontiers in human neuroscience 7 (2013), 579.",
      "doi": ""
    },
    {
      "text": "Dzmitry Tsetserukou, Shotaro Hosokawa, and Kazuhiko Terashima. 2014. LinkTouch: A wearable haptic device with five-bar linkage mechanism for presentation of two-DOF force feedback at the fingerpad. In Haptics Symposium (HAPTICS), 2014 IEEE. IEEE, 307--312.",
      "doi": ""
    },
    {
      "text": "Koji Tsukada and Michiaki Yasumura. 2004. Activebelt: Belt-type wearable tactile display for directional navigation. In International Conference on Ubiquitous Computing. Springer, 384--399.",
      "doi": ""
    },
    {
      "text": "Jan BF Van Erp, Hendrik AHC Van Veen, Chris Jansen, and Trevor Dobbins. 2005. Waypoint navigation with a vibrotactile waist belt. ACM Transactions on Applied Perception (TAP) 2, 2 (2005), 106--117.  ",
      "doi": "10.1145/1060581.1060585"
    },
    {
      "text": "Ronald T Verrillo. 1980. Age related changes in the sensitivity to vibration. Journal of gerontology 35, 2 (1980), 185--193.",
      "doi": ""
    },
    {
      "text": "Julie M Walker, Heather Culbertson, Michael Raitor, and Allison M Okamura. 2018. Haptic orientation guidance using two parallel doublegimbal control moment gyroscopes. IEEE transactions on haptics 11, 2 (2018), 267--278.",
      "doi": ""
    },
    {
      "text": "Eric Whitmire, Hrvoje Benko, Christian Holz, Eyal Ofek, and Mike Sinclair. 2018. Haptic Revolver: Touch, Shear, Texture, and Shape Rendering on a Reconfigurable Virtual Reality Controller. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 86.  ",
      "doi": "10.1145/3173574.3173660"
    },
    {
      "text": "Alvar Wilska. 1954. On the vibrational sensitivity in different regions of the body surface. Acta Physiologica Scandinavica 31, 2--3 (1954), 285--289.",
      "doi": ""
    },
    {
      "text": "Kyle N Winfree, Jamie Gewirtz, Thomas Mather, Jonathan Fiene, and Katherine J Kuchenbecker. 2009. A high fidelity ungrounded torque feedback device: The iTorqU 2.0. In EuroHaptics conference, 2009 and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. World Haptics 2009. Third Joint. IEEE, 261--266.  ",
      "doi": "10.1109/WHC.2009.4810866"
    }
  ]
}