{
  "doi": "10.1145/3290605.3300560",
  "title": "Conservation of Procrastination: Do Productivity Interventions Save Time Or Just Redistribute It?",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Productivity behavior change systems help us reduce our time on unproductive activities. However, is that time actually saved, or is it just redirected to other unproductive activities? We report an experiment using HabitLab, a behavior change browser extension and phone application, that manipulated the frequency of interventions on a focal goal and measured the effects on time spent on other applications and platforms. We find that, when intervention frequency increases on the focal goal, time spent on other applications is held constant or even reduced. Likewise, we find that time is not redistributed across platforms from browser to mobile phone or vice versa. These results suggest that any conservation of procrastination effect is minimal, and that behavior change designers may target individual productivity goals without causing substantial negative second-order effects.",
  "tags": [
    "distractions and interruptions",
    "behavior change"
  ],
  "authors": [
    {
      "name": "Geza Kovacs",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81502669221/rel-imgonly/geza.png",
      "acmid": "81502669221",
      "orcid": "missing"
    },
    {
      "name": "Drew Mylander Gregory",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366046",
      "orcid": "missing"
    },
    {
      "name": "Zilin Ma",
      "institution": "Bucknell University, Lewisburg, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365187",
      "orcid": "missing"
    },
    {
      "name": "Zhengxuan Wu",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319871",
      "orcid": "missing"
    },
    {
      "name": "Golrokh Emami",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366109",
      "orcid": "missing"
    },
    {
      "name": "Jacob Ray",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366579",
      "orcid": "missing"
    },
    {
      "name": "Michael S. Bernstein",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    }
  ],
  "references": [
    {
      "text": "Charles Abraham and Susan Michie. 2008. A taxonomy of behavior change techniques used in interventions. Health psychology 27, 3 (2008), 379.",
      "doi": ""
    },
    {
      "text": "Phil Adams, Mashfiqui Rabbi, Tauhidur Rahman, Mark Matthews, Amy Voida, Geri Gay, Tanzeem Choudhury, and Stephen Voida. 2014. Towards personal stress informatics: Comparing minimally invasive techniques for measuring daily stress in the wild. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare. ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), 72--79.  ",
      "doi": "10.4108/icst.pervasivehealth.2014.254959"
    },
    {
      "text": "Ashton Anderson, Daniel Huttenlocher, Jon Kleinberg, and Jure Leskovec. 2013. Steering user behavior with badges. In Proceedings of the 22nd international conference on World Wide Web. ACM, 95--106.  ",
      "doi": "10.1145/2488388.2488398"
    },
    {
      "text": "Ashton Anderson, Daniel Huttenlocher, Jon Kleinberg, and Jure Leskovec. 2014. Engaging with massive online courses. In Proceedings of the 23rd international conference on World wide web. ACM, 687--698.  ",
      "doi": "10.1145/2566486.2568042"
    },
    {
      "text": "Steven H. Appelbaum, Adam Marchionni, and Arturo Fernandez. 2008. The multi-tasking paradox: perceptions, problems and strategies. Management Decision 46, 9 (2008), 1313--1325.",
      "doi": ""
    },
    {
      "text": "Azy Barak, Liat Hen, Meyran Boniel-Nissim, and Na'ama Shapira. 2008. A Comprehensive Review and a Meta-Analysis of the Effectiveness of Internet-Based Psychotherapeutic Interventions. Journal of Technology in Human Services 26, 2--4 (2008), 109--160. arXiv:https://doi.org/10.1080/15228830802094429",
      "doi": ""
    },
    {
      "text": "Roy E Baumeister, Ellen Bratslavsky, Mark Muraven, and Dianne M Tice. 1998. Ego Depletion: Is the Active Self a Limited Resource? Journal of Personality and Social Psychology 74, 5 (1998), 1252--1265.",
      "doi": ""
    },
    {
      "text": "Chris Beer. 2017. Multi-Device Watching Among TV Viewers. https:// blog.globalwebindex.com/chart-of-the-day/multi-device-watching/",
      "doi": ""
    },
    {
      "text": "Ashly D. Black, Josip Car, Claudia Pagliari, Chantelle Anandan, Kathrin Cresswell, Tomislav Bokun, Brian McKinstry, Rob Procter, Azeem Majeed, and Aziz Sheikh. 2011. The Impact of eHealth on the Quality and Safety of Health Care: A Systematic Overview. PLOS Medicine 8, 1 (01 2011), 1--16.",
      "doi": ""
    },
    {
      "text": "S N Blair, D R Jacobs, and K E Powell. 1985. Relationships between exercise or physical activity and other health behaviors. 100 (03 1985), 172 -- 180.",
      "doi": ""
    },
    {
      "text": "L. Mark Carrier, Nancy A. Cheever, Larry D. Rosen, Sandra Benitez, and Jennifer Chang. 2009. Multitasking across generations: Multitasking choices and difficulty ratings in three generations of Americans. Computers in Human Behavior 25, 2 (2009), 483 -- 489. Including the Special Issue: State of the Art Research into Cognitive Load Theory.  ",
      "doi": "10.1016/j.chb.2008.10.012"
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Nathaniel F Watson, and Julie A Kientz. 2011. Opportunities for computing technologies to support healthy sleep behaviors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3053--3062.  ",
      "doi": "10.1145/1978942.1979395"
    },
    {
      "text": "Robert B Cialdini and Nathalie Garde. 1987. Influence. Vol. 3. A. Michel.",
      "doi": ""
    },
    {
      "text": "The Nielsen Company. 2009. Television, Internet and mobile usage in the US. Three Screen Report. http://www.nielsen.com/us/en/insights/ news/2009/tv-internet-and-mobile-usage-in-us-continues-to-rise. html",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity Sensing in the Wild: A Field Trial of Ubifit Garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Alexander P. Cotter, Nefertiti Durant, April A. Agne, and Andrea L. Cherrington. 2014. Internet interventions to support lifestyle modification for diabetes management: A systematic review of the evidence. Journal of Diabetes and its Complications 28, 2 (2014), 243 -- 251.",
      "doi": ""
    },
    {
      "text": "Brian Cugelman. 2013. Gamification: what it is and why it matters to digital health behavior change developers. JMIR Serious Games 1, 1 (2013), e3.",
      "doi": ""
    },
    {
      "text": "Pim Cuijpers, Annemieke van Straten, and Gerhard Andersson. 2008. Internet-administered cognitive behavior therapy for health problems: a systematic review. Journal of Behavioral Medicine 31, 2 (01 Apr 2008), 169--177.",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Gloria Mark, and Víctor M González. 2011. Why do i keep interrupting myself?: environment, habit and self-interruption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3127--3130.  ",
      "doi": "10.1145/1978942.1979405"
    },
    {
      "text": "Walter Dempsey, Peng Liao, Pedja Klasnja, Inbal Nahum-Shani, and Susan A Murphy. 2015. Randomised trials for the Fitbit generation. Significance 12, 6 (2015), 20--23.",
      "doi": ""
    },
    {
      "text": "Charles Duhigg. 2012. The power of habit: Why we do what we do in life and business. Vol. 34. Random House.",
      "doi": ""
    },
    {
      "text": "Daniel A Epstein, Felicia Cordeiro, James Fogarty, Gary Hsieh, and Sean A Munson. 2016. Crumbs: Lightweight Daily Food Challenges to Promote Engagement and Mindfulness. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI).  ",
      "doi": "10.1145/2858036.2858044"
    },
    {
      "text": "Nir Eyal. 2014. Hooked: How to build habit-forming products. Penguin Canada.",
      "doi": ""
    },
    {
      "text": "Brianna S. Fjeldsoe, Alison L. Marshall, and Yvette D. Miller. 2009. Behavior Change Interventions Delivered by Mobile Telephone ShortMessage Service. American Journal of Preventive Medicine 36, 2 (2009), 165 -- 173.",
      "doi": ""
    },
    {
      "text": "Brian J Fogg. 2002. Persuasive technology: using computers to change what we think and do. Ubiquity 2002, December (2002), 5.  ",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "David Freedman. 2007. What's Next: Taskus Interruptus. https: //www.inc.com/magazine/20070201/column-freedman.html",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, Jennifer Mankoff, Sunny Consolvo, Beverly Harrison, and James A Landay. 2009. UbiGreen: investigating a mobile tool for tracking and supporting green transportation habits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1043--1052.  ",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Juho Hamari, Jonna Koivisto, and Tuomas Pakkanen. 2014. Do Persuasive Technologies Persuade? - A Review of Empirical Studies. In Persuasive Technology. Springer International Publishing, Cham, 118-- 136.  ",
      "doi": "10.1007/978-3-319-07127-5_11"
    },
    {
      "text": "Bernard J Healey and Robert S Zimmerman. 2010. The new world of health promotion : new program development, implementation, and evaluation. Jones and Bartlett Publishers.",
      "doi": ""
    },
    {
      "text": "Hasmida Jamaluddin, Zauwiyah Ahmad, Mazni Alias, and Maimun Simun. 2015. Personal Internet Use: The Use of Personal Mobile Devices at the Workplace. Procedia - Social and Behavioral Sciences 172 (2015), 495 -- 502. Contemporary Issues in Management and Social Science Research.",
      "doi": ""
    },
    {
      "text": "Jing Jin and Laura A Dabbish. 2009. Self-interruption on the computer: a typology of discretionary task interleaving. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1799-- 1808.  ",
      "doi": "10.1145/1518701.1518979"
    },
    {
      "text": "Pamela R. Johnson and Julie Indvik. 2004. The Organizational Benefits of Reducing Cyberslacking in the Workplace. Journal of Organizational Culture, Communications and Conflict 8, 2 (2004). https://www.questia.com/library/journal/1G1--167255389/ the-organizational-benefits-of-reducing-cyberslacking CHI'19, July 2019, Glasgow, UK Kovacs et al.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A Kientz. 2012. Lullaby: a capture & access system for understanding the sleep environment. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. ACM, 226--234.  ",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, K Kim, and Jinwook Seo. 2016. TimeAware: Leveraging framing effects to enhance personal productivity. In Proceedings of the SIGCHI conference on human factors in computing systems.  ",
      "doi": "10.1145/2858036.2858428"
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S Bernstein. 2018. Rotating Online Behavior Change Interventions Increases Effectiveness But Also Increases Attrition. Proc. ACM Hum.-Comput. Interact. 2, CSCW (Nov. 2018).  ",
      "doi": "10.1145/3274364"
    },
    {
      "text": "Amanda Lenhart, Kristen Purcell, Aaron Smith, and Kathryn Zickuhr. 2009. Social media and mobile Internet use among teens and young adults. Pew Internet and American Life Project (2009).",
      "doi": ""
    },
    {
      "text": "Vivien Lim. 2002. The IT Way of Loafing on the Job: Cyberloafing, Neutralizing and Organizational Justice. 23 (08 2002), 675 -- 694.",
      "doi": ""
    },
    {
      "text": "Elizabeth J Lyons, Zakkoyya H Lewis, Brian G Mayrsohn, and Jennifer L Rowland. 2014. Behavior change techniques implemented in electronic lifestyle activity monitors: a systematic content analysis. Journal of medical Internet research 16, 8 (2014), e192.",
      "doi": ""
    },
    {
      "text": "Gloria Mark. 2015. Multitasking in the Digital Age. Morgan and Claypool Publishers.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work: more speed and stress. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 107--110.  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, Paul Johns, Akane Sano, and Yuliya Lutchyn. 2016. Email duration, batching and selfinterruption: Patterns of email use on productivity and stress. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1717--1728.  ",
      "doi": "10.1145/2858036.2858262"
    },
    {
      "text": "Gloria Mark, Yiran Department of Informatics Wang, Melissa Niiya, and Stephanie Reich. 2016. Sleep Debt in Student Life: Online Attention Focus, Facebook, and Mood. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5517--5528.  ",
      "doi": "10.1145/2858036.2858437"
    },
    {
      "text": "M Neve, Philip J Morgan, PR Jones, and CE Collins. 2010. Effectiveness of web-based interventions in achieving weight loss and weight loss maintenance in overweight and obese adults: a systematic review with meta-analysis. Obesity reviews 11, 4 (2010), 306--321.",
      "doi": ""
    },
    {
      "text": "Gregory J. Norman, Marion F. Zabinski, Marc A. Adams, Dori E. Rosenberg, Amy L. Yaroch, and Audie A. Atienza. 2007. A Review of eHealth Interventions for Physical Activity and Dietary Behavior Change. American Journal of Preventive Medicine 33, 4 (2007), 336 -- 345.e16.",
      "doi": ""
    },
    {
      "text": "Jon Noronha, Eric Hysen, Haoqi Zhang, and Krzysztof Z Gajos. 2011. Platemate: crowdsourcing nutritional analysis from food photographs. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 1--12.  ",
      "doi": "10.1145/2047196.2047198"
    },
    {
      "text": "Antti Oulasvirta, Sakari Tamminen, Virpi Roto, and Jaana Kuorelahti. 2005. Interaction in 4-second bursts: the fragmented nature of attentional resources in mobile HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Jeni Paay, Jesper Kjeldskov, Mikael B Skov, Nirojan Srikandarajah, and Umachanger Brinthaparan. 2015. Personal Counseling on Smart Phones For Smoking Cessation. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1427--1432.  ",
      "doi": "10.1145/2702613.2732847"
    },
    {
      "text": "Pablo Paredes, Ran Gilad-Bachrach, Mary Czerwinski, Asta Roseway, Kael Rowan, and Javier Hernandez. 2014. PopTherapy: Coping with stress through pop-culture. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare. ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), 109--117.  ",
      "doi": "10.4108/icst.pervasivehealth.2014.255070"
    },
    {
      "text": "Loo Geok Pee, Irene M.Y. Woon, and Atreyi Kankanhalli. 2008. Explaining non-work-related computing in the workplace: A comparison of alternative models. Information and Management 45, 2 (2008), 120 -- 130.  ",
      "doi": "10.1016/j.im.2008.01.004"
    },
    {
      "text": "J O Prochaska and W F Velicer. 1997. The transtheoretical model of health behavior change. American journal of health promotion : AJHP 12 (1997), 38--48.",
      "doi": ""
    },
    {
      "text": "Mashfiqui Rabbi, Angela Pfammatter, Mi Zhang, Bonnie Spring, and Tanzeem Choudhury. 2015. Automated Personalized Feedback for Physical Activity and Dietary Behavior Change With Mobile Phones: A Randomized Controlled Trial on Adults. JMIR mHealth uHealth 3, 2 (14 May 2015), e42.",
      "doi": ""
    },
    {
      "text": "Simon Lloyd D. Restubog, Patrick Raymund James M. Garcia, Lemuel S. Toledano, Rajiv K. Amarnani, Laramie R. Tolentino, and Robert L. Tang. 2011. Yielding to (cyber)-temptation: Exploring the buffering role of self-control in the relationship between organizational justice and cyberloafing behavior in the workplace. Journal of Research in Personality 45, 2 (2011), 247 -- 251.",
      "doi": ""
    },
    {
      "text": "William T Riley, Katrina J Serrano, Wendy Nilsen, and Audie A Atienza. 2015. Mobile and wireless technologies in health behavior and the potential for intensively adaptive interventions. Current Opinion in Psychology 5 (2015), 67 -- 71. Health behavior.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Kristina Höök, Elsa Vaara, Claus Weymann, Markus Bylund, Pedro Ferreira, Nathalie Peira, and Marie Sjölinder. 2010. Mind the body!: designing a mobile stress management application encouraging personal reflection. In Proceedings of the 8th ACM conference on designing interactive systems. ACM, 47--56.  ",
      "doi": "10.1145/1858171.1858182"
    },
    {
      "text": "Bryant A Stamford, Sharleen Matter, Ronald D Fell, and Paula Papanek. 1986. Effects of smoking cessation on weight gain, metabolic rate, caloric consumption, and blood lipids. The American journal of clinical nutrition 43, 4 (1986), 486--494.",
      "doi": ""
    },
    {
      "text": "Agnis Stibe and Brian Cugelman. 2016. Persuasive Backfiring: When Behavior Change Interventions Trigger Unintended Negative Outcomes. In Persuasive Technology, Alexander Meschtscherjakov, Boris De Ruyter, Verena Fuchsberger, Martin Murer, and Manfred Tscheligi (Eds.). Springer International Publishing, Cham, 65--77.  ",
      "doi": "10.1007/978-3-319-31510-2_6"
    },
    {
      "text": "Alok Tongaonkar, Shuaifu Dai, Antonio Nucci, and Dawn Song. 2013. Understanding Mobile App Usage Patterns Using In-App Advertisements. In Passive and Active Measurement, Matthew Roughan and Rocky Chang (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 63--72.  ",
      "doi": "10.1007/978-3-642-36516-4_7"
    },
    {
      "text": "Jessica Vitak, Julia Crouse, and Robert LaRose. 2011. Personal Internet use at work: Understanding cyberslacking. Computers in Human Behavior 27, 5 (2011), 1751 -- 1759. 2009 Fifth International Conference on Intelligent Computing.  ",
      "doi": ""
    },
    {
      "text": "L. Thomas Webb, Judith Joseph, Lucy Yardley, and Susan Michie. 2010. Using the Internet to Promote Health Behavior Change: A Systematic Review and Meta-analysis of the Impact of Theoretical Basis, Use of Behavior Change Techniques, and Mode of Delivery on Efficacy. J Med Internet Res 12, 1 (17 Feb 2010), e4.",
      "doi": ""
    },
    {
      "text": "McRobbie H Bullen C Borland R Rodgers A Whittaker, R and Y Gu. 2012. Mobile phone-based interventions for smoking cessation. Cochrane Database of Systematic Reviews 11 (2012).",
      "doi": ""
    },
    {
      "text": "Steve Whittaker, Vaiva Kalnikaite, Victoria Hollis, and Andrew Guydish. 2016. 'Don't Waste My Time': Use of Time Information Improves Conservation of Procrastination CHI'19, July 2019, Glasgow, UK Focus. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1729--1738.  ",
      "doi": "10.1145/2858036.2858193"
    }
  ]
}