{
  "doi": "10.1145/3290605.3300796",
  "title": "Kyub: A 3D Editor for Modeling Sturdy Laser-Cut Objects",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We present an interactive editing system for laser cutting called kyub. Kyub allows users to create models efficiently in 3D, which it then unfolds into the 2D plates laser cutters expect. Unlike earlier systems, such as FlatFitFab, kyub affords construction based on closed box structures, which allows users to turn very thin material, such as 4mm plywood, into objects capable of withstanding large forces, such as chairs users can actually sit on. To afford such sturdy construction, every kyub project begins with a simple finger-joint \"boxel\"-a structure we found to be capable of withstanding over 500kg of load. Users then extend their model by attaching additional boxels. Boxels merge automatically, resulting in larger, yet equally strong structures. While the concept of stacking boxels allows kyub to offer the strong affordance and ease of use of a voxel-based editor, boxels are not confined to a grid and readily combine with kuyb's various geometry deformation tools. In our technical evaluation, objects built with kyub withstood hundreds of kilograms of loads. In our user study, non-engineers rated the learnability of kyub 6.1/7.",
  "authors": [
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    },
    {
      "name": "Arthur Silber",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99659366158/rel-imgonly/99659366158.jpg",
      "acmid": "99659366158",
      "orcid": "missing"
    },
    {
      "name": "Yannis Kommana",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162825",
      "orcid": "missing"
    },
    {
      "name": "Milan Gruner",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365483",
      "orcid": "missing"
    },
    {
      "name": "Ludwig Wall",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658761910/rel-imgonly/lww11.jpg",
      "acmid": "99658761910",
      "orcid": "missing"
    },
    {
      "name": "Kevin Reuss",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659356207",
      "orcid": "missing"
    },
    {
      "name": "Lukas Heilman",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365864",
      "orcid": "missing"
    },
    {
      "name": "Robert Kovacs",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658696163/rel-imgonly/robert_kovacs.jpg",
      "acmid": "99658696163",
      "orcid": "0000-0002-9427-2861"
    },
    {
      "name": "Daniel Rechlitz",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366676",
      "orcid": "missing"
    },
    {
      "name": "Thijs Roumen",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658700053/rel-imgonly/44627890994_233b53923c_o.jpg",
      "acmid": "99658700053",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anand Agarawala and Ravin Balakrishnan. 2006. Keepin' it real: pushing the desktop metaphor with physics, piles and the pen. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), Rebecca Grinter, Thomas Rodden, Paul Aoki, Ed Cutrell, Robin Jeffries, and Gary Olson (Eds.). ACM, New York, NY, USA, 1283--1292.  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Patrick Baudisch & Stefanie Mueller (2017). Personal fabrication. Foundations and Trends® in Human--Computer Interaction, 10(3--4), 165--293.",
      "doi": ""
    },
    {
      "text": "Dustin Beyer, Serafima Gurevich, Stefanie Mueller, Hsiang-Ting Chen, and Patrick Baudisch. 2015. Platener: Low-Fidelity Fabrication of 3D Objects by Substituting 3D Print with Laser-Cut Plates. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1799--1806.  ",
      "doi": "10.1145/2702123.2702225"
    },
    {
      "text": "Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert W. Sumner, Wojciech Matusik, and Bernd Bickel. 2013. Computational design of mechanical characters. ACM Trans. Graph. 32, 4, Article 83 (July 2013), 12 pages.  ",
      "doi": "10.1145/2461912.2461953"
    },
    {
      "text": "ISO 286--1:2010 - Geometrical product specifications (GPS) - ISO code system for tolerances on linear sizes - Part 1: Basis of tolerances, deviations and fits. 2010: International Organization for Standardization (ISO).",
      "doi": ""
    },
    {
      "text": "James McCrae, Karan Singh, and Niloy J. Mitra. 2011. Slices: a shape-proxy based on planar sections. ACM Trans. Graph. 30, 6, Article 168 (December 2011), 12 pages.  ",
      "doi": "10.1145/2070781.2024202"
    },
    {
      "text": "James McCrae, Nobuyuki Umetani, and Karan Singh. 2014. FlatFitFab: interactive modeling with planar sections. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 13--22.  ",
      "doi": "10.1145/2642918.2647388"
    },
    {
      "text": "Florian Heller, Jan Thar, Dennis Lewandowski, Mirko Hartmann, Pierre Schoonbrood, Sophy Stönner, Simon Voelker, and Jan Borchers. 2018. CutCAD - An Open-source Tool to Design 3D Objects in 2D. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 1135--1139.  ",
      "doi": "10.1145/3196709.3196800"
    },
    {
      "text": "Megan K. Hofmann, Gabriella Han, Scott E. Hudson, Jennifer Mankoff. 2018. Greater than the Sum of its PARTs: Expressing and Reusing Design Intent in 3D Models. To be published in 36th Annual ACM Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA  ",
      "doi": "10.1145/3173574.3173875"
    },
    {
      "text": "Takeo Igarashi, Satoshi Matsuoka, and Hidehiko Tanaka. 1999. Teddy: a sketching interface for 3D freeform design. In Proceedings of the 26th annual conference on Computer graphics and interactive techniques (SIGGRAPH '99). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 409--416.  ",
      "doi": "10.1145/311535.311602"
    },
    {
      "text": "Tinsley A. Galyean and John F. Hughes. 1991. Sculpting: an interactive volumetric modeling technique. In Proceedings of the 18th annual conference on Computer graphics and interactive techniques (SIGGRAPH '91). ACM, New York, NY, USA, 267--274.  ",
      "doi": "10.1145/122718.122747"
    },
    {
      "text": "Kimball, Ralph, and B. Verplank E. Harslem. \"Designing the Star user interface.\" Byte 7 (1982): 242--282.",
      "doi": ""
    },
    {
      "text": "Robert Kovacs, Anna Seufert, Ludwig Wall, Hsiang-Ting Chen, Florian Meinel, Willi Müller, Sijing You, Maximilian Brehm, Jonathan Striebel, Yannis Kommana, Alexander Popiak, Thomas Bläsius, and Patrick Baudisch. 2017. TrussFab: Fabricating Sturdy Large-Scale Structures on Desktop 3D Printers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2606--2616.  ",
      "doi": "10.1145/3025453.3026016"
    },
    {
      "text": "Li-Chu Lin 2006 The adaptability of two-by-four wood framing construction. In Adaptables2006: International Conference On Adaptable Building Structures. Eindhoven, the Netherlands 2006.",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive construction: interactive fabrication of functional mechanical devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA, 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Bo Nilsson 2013. Particle Board U.S. Patent No. 8,398,905. Washington, DC: U.S. Patent and Trademark Office.",
      "doi": ""
    },
    {
      "text": "Thijs Roumen, Willi Mueller and Patrick Baudisch. 2018. Grafter: Remixing 3D Printed Machines. In Proceedings of the 36th Annual ACM Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA.  ",
      "doi": "10.1145/3173574.3173637"
    },
    {
      "text": "Lawrence Sass, and Marcel Botha. \"The instant house: a model of design production with digital fabrication.\" International Journal of Architectural Computing 4, no. 4 (2006): 109--123.",
      "doi": ""
    },
    {
      "text": "Greg Saul, Manfred Lau, Jun Mitani, and Takeo Igarashi. 2010. SketchChair: an all-in-one chair design system for end users. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction (TEI '11). ACM, New York, NY, USA, 73--80.  ",
      "doi": "10.1145/1935701.1935717"
    },
    {
      "text": "Peng Song, Bailin Deng, Ziqi Wang, Zhichao Dong, Wei Li, Chi-Wing Fu, and Ligang Liu. 2016. CofiFab: coarse-to-fine fabrication of large 3D objects. ACM Trans. Graph. 35, 4, Article 45 (July 2016), 11 pages.  ",
      "doi": "10.1145/2897824.2925876"
    },
    {
      "text": "Yuliy Schwartzburg and Mark Pauly. \"Fabrication-aware design with intersecting planar pieces.\" In Computer Graphics Forum, vol. 32, no. 2pt3, pp. 317--326. Oxford, UK: Blackwell Publishing Ltd, 2013.",
      "doi": ""
    },
    {
      "text": "Rundong Tian, Sarah Sterman, Ethan Chiou, Jeremy Warner, and Eric Paulos. 2018. MatchSticks: Woodworking through Improvisational Digital Fabrication. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 149, 12 pages.  ",
      "doi": "10.1145/3173574.3173723"
    },
    {
      "text": "Oster, Thomas. Visicut: An application genre for lasercutting in personal fabrication. RWTH Aachen Univ (2011).",
      "doi": ""
    },
    {
      "text": "Nobuyuki Umetani, Takeo Igarashi, and Niloy J. Mitra. 2012. Guided exploration of physically valid shapes for furniture design. ACM Trans. Graph.31, 4, Article 86 (July 2012), 11 pages.  ",
      "doi": "10.1145/2185520.2185582"
    },
    {
      "text": "Kiril Vidimce, Alexandre Kaspar, Ye Wang, and Wojciech Matusik. 2016. Foundry: Hierarchical Material Design for Multi-Material Fabrication. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 563--574.  ",
      "doi": "10.1145/2984511.2984516"
    },
    {
      "text": "Daniel Vogel and Patrick Baudisch. 2007. Shift: a technique for operating pen-based interfaces using touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 657--666.  ",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Christian Weichel, Manfred Lau, and Hans Gellersen. 2013. Enclosed: a component-centric interface for designing prototype enclosures. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13). ACM, New York, NY, USA, 215--218.  ",
      "doi": "10.1145/2460625.2460659"
    },
    {
      "text": "Lance Williams. 1990. 3D paint. SIGGRAPH Comput. Graph. 24, 2 (February 1990), 225--233.  ",
      "doi": "10.1145/91394.91450"
    },
    {
      "text": "Jiaxian Yao, Danny M. Kaufman, Yotam Gingold, and Maneesh Agrawala. 2017. Interactive Design and Stability Analysis of Decorative Joinery for Furniture. ACM Trans. Graph. 36, 2, Article 20 (March 2017), 16 pages.  ",
      "doi": "10.1145/3054740"
    },
    {
      "text": "Yilbas, B. S. \"Effect of process parameters on the kerf width during the laser cutting process.\" Proceedings of the Institution of Mechanical Engineers, Part B: Journal of Engineering Manufacture 215, no. 10 (2001): 1357--1365.",
      "doi": ""
    },
    {
      "text": "Robert C. Zeleznik, Kenneth P. Herndon, and John F. Hughes. 2007. SKETCH: an interface for sketching 3D scenes. In ACM SIGGRAPH 2007 courses(SIGGRAPH '07). ACM, New York, NY, USA, Article 19.  ",
      "doi": "10.1145/1281500.1281530"
    },
    {
      "text": "Clement Zheng, Ellen Yi-Luen Do, and Jim Budd. 2017. Joinery: Parametric Joint Generation for Laser Cut Assemblies. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition (C&C '17). ACM, New York, NY, USA, 63--74.  ",
      "doi": "10.1145/3059454.3059459"
    },
    {
      "text": "AutoDesk. 2017. Slicer for Fusion360 https://apps.autodesk.com/FUSION/en/Detail/Index?id=8699194120463301363&os=Win64&appLang=en",
      "doi": ""
    },
    {
      "text": "Microsoft. 2011. Minecraft https://minecraft.net",
      "doi": ""
    },
    {
      "text": "Reinvent-One. 2014. Make a Box https://makeabox.io",
      "doi": ""
    }
  ]
}