{
  "doi": "10.1145/3290605.3300580",
  "title": "Engaging Lived and Virtual Realities",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "We examined the integration of VR into informal and less-structured learning environments in Atlanta (USA) and Mumbai (India) through a process of co-design, co-creation, and co-learning with students and teachers where students learned to use VR to engage with their economic, social, and cultural realities. Using qualitative methods, we engaged students and teachers at both sites in VR content creation activities; through these activities, we attempt to uncover a deeper understanding of the challenges and opportunities of introducing low-cost mobile VR for content generation, consumption, and sharing in underserved learning contexts. We also motivate future work that looks at integrating VR in new contexts, using flexible methods, across borders. The larger vision of our research is to advance us towards greater accessibility and inclusivity of VR across diverse learning environments.",
  "tags": [
    "usa",
    "hci4d",
    "vr",
    "india",
    "classrooms"
  ],
  "authors": [
    {
      "name": "Aditya Vishwanath",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658764976",
      "orcid": "missing"
    },
    {
      "name": "Naveena Karusala",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163160",
      "orcid": "0000-0003-0355-3041"
    },
    {
      "name": "Marisol Wong-Villacres",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/do/10.1145/contrib-81484657798/rel-imgonly/12208399_10155561261383647_405401115224813451_n.jpg",
      "acmid": "81484657798",
      "orcid": "0000-0002-8071-6716"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "Nicoletta Adamo-Villani and Ronnie Wilbur. 2008. Two novel technologies for accessible math and science education. IEEE MultiMedia 15, 4 (2008), 38--46.  ",
      "doi": "10.1109/MMUL.2008.97"
    },
    {
      "text": "Saleema Amershi, Meredith Ringel Morris, Neema Moraveji, Ravin Balakrishnan, and Kentaro Toyama. 2010. Multiple mouse text entry for single-display groupware. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. ACM, 169--178.  ",
      "doi": "10.1145/1718918.1718950"
    },
    {
      "text": "Morgan G. Ames. 2015. Charismatic Technology. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (AA '15). Aarhus University Press, 109--120.  ",
      "doi": "10.7146/aahcc.v1i1.21199"
    },
    {
      "text": "Aicha Blehch Amry. 2014. The impact ofwhatsapp mobile social learning on the achievement and attitudes of female students compared with face to face learning in the classroom. European Scientific Journal, ESJ 10, 22 (2014).",
      "doi": ""
    },
    {
      "text": "Atlanta Journal-Constitution 2012. East Lake success a model for other troubled areas. https://on-ajc.com/2rKwd2C.",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson, Jim Blascovich, Andrew C Beall, and Jack M Loomis. 2003. Interpersonal distance in immersive virtual environments. Personality and Social Psychology Bulletin 29, 7 (2003), 819--833.",
      "doi": "10.1145/3452918.3458804"
    },
    {
      "text": "Olivier Balet, Gérard Subsol, and Patrice Torguet. 2001. Virtual Storytelling Using Virtual Reality Technologies for Storytelling. In Conference proceedings ICVS. Springer, 14. ",
      "doi": "10.5555/646956"
    },
    {
      "text": "Lee Anne Bell. 2010. Storytelling for social justice: Connecting narrative and the arts in antiracist teaching. Routledge.",
      "doi": ""
    },
    {
      "text": "Wiebe E Bijker. 1997. Of bicycles, bakelites, and bulbs: Toward a theory of sociotechnical change. MIT press.",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst, Sisinio Baldis, Lydia Matheson, and Mark Philips. 1997. 3D palette: a virtual reality content creation tool. In Proceedings of the ACM symposium on Virtual reality software and technology. ACM, 155--156.  ",
      "doi": "10.1145/261135.261163"
    },
    {
      "text": "Mark Billinghurst and Andreas Duenser. 2012. Augmented reality in the classroom. Computer 45, 7 (2012), 56--63.  ",
      "doi": "10.1109/MC.2012.111"
    },
    {
      "text": "Mark Billinghurst, Hirokazu Kato, and Ivan Poupyrev. 2001. The magicbook-moving seamlessly between reality and virtuality. IEEE Computer Graphics and applications 21, 3 (2001), 6--8. ",
      "doi": "10.5555/616070.618818"
    },
    {
      "text": "Frank Biocca and Mark R Levy. 2013. Communication in the age of virtual reality. Routledge.",
      "doi": "10.5555/207922.207926"
    },
    {
      "text": "Jim Blascovich, Jack Loomis, Andrew C Beall, Kimberly R Swinth, Crystal L Hoyt, and Jeremy N Bailenson. 2002. Immersive virtual environment technology as a methodological tool for social psychology. Psychological Inquiry 13, 2 (2002), 103--124.",
      "doi": ""
    },
    {
      "text": "Doug A Bowman and Larry F Hodges. 1997. An evaluation of techniques for grabbing and manipulating remote objects in immersive virtual environments. In Proceedings of the 1997 symposium on Interactive 3D graphics. ACM, 35--ff.  ",
      "doi": "10.1145/253284.253301"
    },
    {
      "text": "John D Bransford, A Brown, and R Cocking. 1999. How people learn: Mind, brain, experience, and school. Washington, DC: National Research Council (1999).",
      "doi": ""
    },
    {
      "text": "Marcello Carrozzino and Massimo Bergamasco. 2010. Beyond Virtual Museums: Experiencing immersive virtual reality in real museums. Journal of Cultural Heritage 11, 4 (2010), 452--458.",
      "doi": ""
    },
    {
      "text": "Marc Cavazza, Jean-Luc Lugrin, David Pizzi, and Fred Charles. 2007. Madame bovary on the holodeck: immersive interactive storytelling. In Proceedings of the 15th ACM international conference on Multimedia. ACM, 651--660.  ",
      "doi": "10.1145/1291233.1291387"
    },
    {
      "text": "Ruy Cervantes, Mark Warschauer, Bonnie Nardi, and Nithya Sambasivan. 2011. Infrastructures for low-cost laptop use in Mexican schools. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 945--954.  ",
      "doi": "10.1145/1978942.1979082"
    },
    {
      "text": "Wenhong Chen and Barry Wellman. 2004. The global digital divide-- within and between countries. IT & society 1, 7 (2004), 39--45.",
      "doi": ""
    },
    {
      "text": "Wilma Clark and Rosemary Luckin. 2013. iPads in the Classroom. What The Research Says (2013).",
      "doi": ""
    },
    {
      "text": "Patricia Comeaux. 1995. The impact of an interactive distance learning network on classroom communication. Communication Education 44, 4 (1995), 353--361.",
      "doi": ""
    },
    {
      "text": "Carolina Cruz-Neira, Daniel J Sandin, and Thomas A DeFanti. 1993. Surround-screen projection-based virtual reality: the design and implementation of the CAVE. In Proceedings of the 20th annual conference on Computer graphics and interactive techniques. ACM, 135--142.  ",
      "doi": "10.1145/166117.166134"
    },
    {
      "text": "Sébastien Cuendet, Quentin Bonnard, Son Do-Lenh, and Pierre Dillenbourg. 2013. Designing augmented reality for the classroom. Computers & Education 68 (2013), 557--569.",
      "doi": "10.5555/2974070.2974214"
    },
    {
      "text": "Barney Dalgarno and Mark JW Lee. 2010. What are the learning affordances of 3-D virtual environments? British Journal of Educational Technology 41, 1 (2010), 10--32.",
      "doi": ""
    },
    {
      "text": "Daydream 2018. Daydream-Google VR. https://vr.google.com/ daydream/.",
      "doi": ""
    },
    {
      "text": "Allison Druin. 1999. Cooperative inquiry: developing new technologies for children with children. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 592--599.  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Mihai Duguleana, Raffaello Brodi, Florin Girbacia, Cristian Postelnicu, Octavian Machidon, and Marcello Carrozzino. 2016. Time-Travelling with Mobile Augmented Reality: A Case Study on the Piazza dei Miracoli. In Euro-Mediterranean Conference. Springer, 902--912. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Vishwanath et al.",
      "doi": "10.1007/978-3-319-48496-9_73"
    },
    {
      "text": "Barry J Fishman, William R Penuel, Anna-Ruth Allen, Britte Haugan Cheng, and NORA Sabelli. 2013. Design-based implementation research: An emerging model for transforming the relationship of research and practice. National society for the study of education 112, 2 (2013), 136--156.",
      "doi": ""
    },
    {
      "text": "Patrice Flichy. 2007. The internet imaginaire. MIT press. ",
      "doi": "10.5555/1213019"
    },
    {
      "text": "Forbes 2017. Five Reasons Why Virtual Reality Is Becoming Mainstream For Marketers. https://bit.ly/2BuJHnO.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg, Sheelagh Carpendale, Nicolai Marquardt, and Bill Buxton. 2012. The narrative storyboard: telling a story about use and context over time. interactions 19, 1 (2012), 64--69.  ",
      "doi": "10.1145/2065327.2065340"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Julian Frommel, and Enrico Rukzio. 2017. ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4021--4033.  ",
      "doi": "10.1145/3025453.3025683"
    },
    {
      "text": "Jan Gugenheimer, Dennis Wolf, Gabriel Haas, Sebastian Krebs, and Enrico Rukzio. 2016. Swivrchair: A motorized swivel chair to nudge users' orientation for 360 degree storytelling in virtual reality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1996--2000.  ",
      "doi": "10.1145/2858036.2858040"
    },
    {
      "text": "Frank Heuts and Annemarie Mol. 2013. What is a good tomato? A case of valuing in practice. Valuation Studies 1, 2 (2013), 125--146.",
      "doi": ""
    },
    {
      "text": "HTC. 2017. Discover Virtual Reality Beyond Imagination. https: //www.vive.com/us/ {Online; accessed 17-September-2017}.",
      "doi": ""
    },
    {
      "text": "Nassim JafariNaimi. 2015. MRx as a participatory platform. Digital Creativity 26, 3--4 (2015), 207--220.",
      "doi": ""
    },
    {
      "text": "Younbo Jung, Shih-Ching Yeh, and Jill Stewart. 2006. Tailoring virtual reality technology for stroke rehabilitation: a human factors design. In CHI'06 extended abstracts on Human factors in computing systems. ACM, 929--934.  ",
      "doi": "10.1145/1125451.1125631"
    },
    {
      "text": "Shunichi Kasahara, Valentin Heun, Austin S Lee, and Hiroshi Ishii. 2012. Second surface: multi-user spatial collaboration system based on augmented reality. In SIGGRAPH Asia 2012 Emerging Technologies. ACM, 20.  ",
      "doi": "10.1145/2407707.2407727"
    },
    {
      "text": "Gerard Jounghyun Kim et al. 2005. A SWOT analysis of the field of virtual reality rehabilitation and therapy. Presence: Teleoperators and Virtual Environments 14, 2 (2005), 119--146.  ",
      "doi": "10.1162/1054746053967094"
    },
    {
      "text": "David A Kolb. 2014. Experiential learning: Experience as the source of learning and development. FT press.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Aditya Vishwanath. 2018. It's getting real. Virtually real. interactions 25, 5 (2018), 64--71.  ",
      "doi": "10.1145/3236679"
    },
    {
      "text": "Busayawan Lam, Theodore Zamenopoulos, Mihaela Kelemen, and Jea Hoo Na. 2017. Unearth Hidden Assets through Community Co-design and Co-production. The Design Journal 20, sup1 (2017), S3601--S3610.",
      "doi": ""
    },
    {
      "text": "Tobias Langlotz, Stefan Mooslechner, Stefanie Zollmann, Claus Degendorfer, Gerhard Reitmayr, and Dieter Schmalstieg. 2012. Sketching up the world: in situ authoring for mobile augmented reality. Personal and ubiquitous computing 16, 6 (2012), 623--630.  ",
      "doi": "10.1007/s00779-011-0430-0"
    },
    {
      "text": "Paul Lapides, Ehud Sharlin, Mario Costa Sousa, and Lisa Streit. 2006. The 3d tractus: A three-dimensional drawing board. In Horizontal Interactive Human-Computer Systems, 2006. TableTop 2006. First IEEE International Workshop on. IEEE, 8--pp.  ",
      "doi": "10.1109/TABLETOP.2006.33"
    },
    {
      "text": "Robb Lindgren, Michael Tscholl, Shuai Wang, and Emily Johnson. 2016. Enhancing learning and engagement through embodied interaction within a mixed reality simulation. Computers & Education 95 (2016), 174--187.  ",
      "doi": "10.1016/j.compedu.2016.01.001"
    },
    {
      "text": "Doug MacLeod and Pierre Boulanger. 2001. Virtual Reality and Public Spaces. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (VRST '01). ACM, New York, NY, USA, 119--119.  ",
      "doi": "10.1145/505008.505030"
    },
    {
      "text": "Hilary Macleod. 2005. What role can educational multimedia play in narrowing the digital divide? International Journal of Education and Development using ICT 1, 4 (2005), 42--53.",
      "doi": ""
    },
    {
      "text": "Michel Maffesoli. 1995. The time of the tribes: The decline of individualism in mass society. Vol. 41. Sage.",
      "doi": ""
    },
    {
      "text": "Vincent McCurley. 2016. Storyboarding in Virtual Reality. Medium post. Retrieved August 9, 2017 from https://virtualrealitypop.com/ storyboarding-in-virtual-reality-67d3438a2fb1.",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam. 2002. Qualitative research in practice: Examples for discussion and analysis. Jossey-Bass Inc Pub.",
      "doi": ""
    },
    {
      "text": "Tassos A Mikropoulos and Joan Bellou. 2006. The unique features of educational virtual environments. Proceedings e-society (2006), 122-- 128.",
      "doi": ""
    },
    {
      "text": "Chris Milk. 2016. The Birth of Virtual Reality as an Art Form. TED talk. Retrieved August 9, 2017 from https://www.ted.com/talks/chris_ milk_the_birth_of_virtual_reality_as_an_art_form.",
      "doi": ""
    },
    {
      "text": "Shailey Minocha, Ana-Despina Tudor, and Steve Tilling. 2017. Affordances of Mobile Virtual Reality and their Role in Learning and Teaching. (2017).",
      "doi": ""
    },
    {
      "text": "Isidro Navarro, Oriol de Reina, David Fonseca, Macarena Gómez, and Álvaro Ferrer. 2017. Virtual Reality Using Smart-Devices in Educational Frameworks: Case Study: Museum Casa Batlló. International Journal of Technology and Human Interaction (IJTHI) 13, 4 (2017), 50--61.  ",
      "doi": "10.4018/IJTHI.2017100104"
    },
    {
      "text": "Laura Northrop and Erin Killeen. 2013. A framework for using iPads to build early literacy skills. The Reading Teacher 66, 7 (2013), 531--537.",
      "doi": ""
    },
    {
      "text": "Richard Noss and Celia Hoyles. 1996. Windows on mathematical meanings: Learning cultures and computers. Vol. 17. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Oculus 2018. Oculus Go. https://www.oculus.com/go/.",
      "doi": ""
    },
    {
      "text": "Jason B Ohler. 2013. Digital storytelling in the classroom: New media pathways to literacy, learning, and creativity. Corwin Press.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Rabin Patra, Sergiu Nedevschi, Madelaine Plauche, and Udai Singh Pawar. 2009. The Case of the Occasionally Cheap Computer: Low-cost Devices and Classrooms in the Developing Regions. Information Technologies & International Development 5, 1 (2009), pp-- 49.",
      "doi": ""
    },
    {
      "text": "Zhigeng Pan, Adrian David Cheok, Hongwei Yang, Jiejie Zhu, and Jiaoying Shi. 2006. Virtual reality and mixed reality for virtual learning environments. Computers & Graphics 30, 1 (2006), 20--28.  ",
      "doi": "10.1016/j.cag.2005.10.004"
    },
    {
      "text": "Alan Parkinson, Rebecca Kitchen, Ana-Despina Tudor, Shailey Minocha, and Steve Tilling. 2017. Role of smartphone-driven virtual reality field trips in inquiry-based learning. (2017).",
      "doi": ""
    },
    {
      "text": "Randy Pausch, Jon Snoddy, Robert Taylor, Scott Watson, and Eric Haseltine. 1996. Disney's Aladdin: first steps toward storytelling in virtual reality. In Proceedings of the 23rd annual conference on Computer graphics and interactive techniques. ACM, 193--203.  ",
      "doi": "10.1145/237170.237257"
    },
    {
      "text": "Deanna CC Peluso. 2012. The fast-paced iPad revolution: Can educators stay up to date and relevant about these ubiquitous devices? British Journal of Educational Technology 43, 4 (2012), E125--E127.",
      "doi": ""
    },
    {
      "text": "Lynnette R Porter. 1997. Creating the virtual classroom: Distance learning with the Internet. John Wiley & Sons, Inc. ",
      "doi": "10.5555/523612"
    },
    {
      "text": "Ivan Poupyrev, Numada Tomokazu, and Suzanne Weghorst. 1998. Virtual Notepad: handwriting in immersive VR. In Virtual Reality Annual International Symposium, 1998. Proceedings., IEEE 1998. IEEE, 126--132. ",
      "doi": "10.5555/522258.836117"
    },
    {
      "text": "Fabin Rasheed, Prasad Onkar, and Marisha Narula. 2015. Immersive Virtual Reality to Enhance the Spatial Awareness of Students. In Proceedings of the 7th International Conference on HCI, IndiaHCI 2015 (IndiaHCI'15). ACM, New York, NY, USA, 154--160.  ",
      "doi": "10.1145/2835966.2836288"
    },
    {
      "text": "Doug Reid and Nathaniel Ostashewski. 2011. iPads in the Classroom-- New Technologies, Old Issues: Are they worth the effort?. In EdMedia: World Conference on Educational Media and Technology. Association Engaging Lived and Virtual Realities CHI 2019, May 4--9, 2019, Glasgow, Scotland UK for the Advancement of Computing in Education (AACE), 1689--1694.",
      "doi": ""
    },
    {
      "text": "Tony Roberts. 2016. Women's Use of Participatory Video Technology to Tackle Gender Inequality in Zambia's ICT Sector. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. ACM, 6.  ",
      "doi": "10.1145/2909609.2909673"
    },
    {
      "text": "Judy Robertson and Judith Good. 2005. Story creation in virtual game worlds. Commun. ACM 48, 1 (2005), 61--65.  ",
      "doi": "10.1145/1039539.1039571"
    },
    {
      "text": "RoundMe. 2017. Virtual Tours Made Simple. https://roundme.com/ {Online; accessed 17-September-2017}.",
      "doi": ""
    },
    {
      "text": "M Roussos, A Johnson, J Leigh, C Vasilakis, and T Moher. 1996. Constructing collaborative stories within virtual learning landscapes. In Proceedings of the European Conference on AI in Education. 129--135.",
      "doi": ""
    },
    {
      "text": "Maria Roussos, Andrew Johnson, Thomas Moher, Jason Leigh, Christina Vasilakis, and Craig Barnes. 1999. Learning and building together in an immersive virtual world. Presence: Teleoperators and Virtual Environments 8, 3 (1999), 247--263.  ",
      "doi": "10.1162/105474699566215"
    },
    {
      "text": "Sonia Saddiqui, Maya Marcus, et al. 2017. STEAMpunk girls co-design: Exploring a more integrated approach to STEM engagement for young women. In 28th Annual Conference of the Australasian Association for Engineering Education (AAEE 2017). Australasian Association for Engineering Education, 1175.",
      "doi": ""
    },
    {
      "text": "Samsung 2018. Samsung Gear VR - The next-generation Gear VR awaits. http://www.samsung.com/us/explore/gear-vr/.",
      "doi": ""
    },
    {
      "text": "Elizabeth B-N Sanders, Sapna Singh, and Erika Braun. 2018. CoDesigning with Communities. (2018).",
      "doi": ""
    },
    {
      "text": "Hartmut Seichter, Julian Looser, and Mark Billinghurst. 2008. ComposAR: An intuitive tool for authoring AR applications. In Proceedings of the 7th IEEE/ACM international symposium on mixed and augmented reality. IEEE Computer Society, 177--178.  ",
      "doi": "10.1109/ISMAR.2008.4637354"
    },
    {
      "text": "Mel Slater and Sylvia Wilbur. 1997. A framework for immersive virtual environments (FIVE): Speculations on the role of presence in virtual environments. Presence: Teleoperators and virtual environments 6, 6 (1997), 603--616.  ",
      "doi": "10.1162/pres.1997.6.6.603"
    },
    {
      "text": "Sony Playstation 2018. PlaystationVR-Over 200 games and counting. Feel them all. https://www.playstation.com/en-us/explore/ playstation-vr/.",
      "doi": ""
    },
    {
      "text": "Ricoh Theta. 2017. 360-Degree Experience. http://theta360.com/ {Online; accessed 17-September-2017}.",
      "doi": ""
    },
    {
      "text": "Aditya Vishwanath, Matthew Kam, and Neha Kumar. 2017. Examining Low-Cost Virtual Reality for Learning in Low-Resource Environments. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 1277--1281.  ",
      "doi": "10.1145/3064663.3064696"
    },
    {
      "text": "Barry J Wadsworth. 1996. Piaget's theory of cognitive and affective development: Foundations of constructivism. Longman Publishing.",
      "doi": ""
    },
    {
      "text": "Cara Winterbottom and Edwin Blake. 2008. Constructivism, virtual reality and tools to support design. In Proceedings of the 7th ACM conference on Designing interactive systems. ACM, 230--239.  ",
      "doi": "10.1145/1394445.1394470"
    },
    {
      "text": "Matthew Wood, Gavin Wood, and Madeline Balaam. 2017. They're Just Tixel Pits, Man: Disputing the'Reality'of Virtual Reality Pornography through the Story Completion Method. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5439--5451.  ",
      "doi": "10.1145/3025453.3025762"
    }
  ]
}