{
  "doi": "10.1145/3290605.3300759",
  "title": "Understanding and Designing for Deaf or Hard of Hearing Drivers on Uber",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We used content analysis of in-app driver survey responses, customer support tickets, and tweets, and face-to-face interviews of DHH Uber drivers to better understand the DHH driver experience. Here we describe challenges DHH drivers experience and how they address those difficulties via Uber's accessibility features and their own workarounds. We also identify and discuss design and product opportunities to improve the DHH driver experience on Uber.",
  "authors": [
    {
      "name": "Sooyeon Lee",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659135375",
      "orcid": "0000-0002-4971-2004"
    },
    {
      "name": "Bjorn Hubert-Wallander",
      "institution": "Uber Technologies, Inc., San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365380",
      "orcid": "missing"
    },
    {
      "name": "Molly Stevens",
      "institution": "Uber Technologies, Inc., San Francisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366315",
      "orcid": "missing"
    },
    {
      "name": "John M. Carroll",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "{n. d.}. disabledstats. http://www.who.int/en/news-room/fact-sheets/ detail/deafness-and-hearing-loss.",
      "doi": ""
    },
    {
      "text": "{n. d.}. googledeaf. https://www.google.com/search?q=deaf.",
      "doi": ""
    },
    {
      "text": "{n. d.}. LaborStatistics. https://www.bls.gov/news.release/empsit.t06. htm.",
      "doi": ""
    },
    {
      "text": "{n. d.}. stats. http://www.DisabilityStatistics.org.",
      "doi": ""
    },
    {
      "text": "{n. d.}. VideoRelay. http://www.fcc.gov/guides/video-relay-services.",
      "doi": ""
    },
    {
      "text": "Max Atkinson. 1984. Our masters' voices: The language and body language of politics. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Mark S Baldwin, Gillian R Hayes, Oliver L Haimson, Jennifer Mankoff, and Scott E Hudson. 2017. The Tangible Desktop: A Multimodal Approach to Nonvisual Computing. ACM Transactions on Accessible Computing (TACCESS) 10, 3 (2017), 9.  ",
      "doi": "10.1145/3075222"
    },
    {
      "text": "Jeffrey P Bigham, Raja Kushalnagar, Ting-Hao Kenneth Huang, Juan Pablo Flores, and Saiph Savage. 2017. On How Deaf People Might Use Speech to Control Devices. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 383--384.  ",
      "doi": "10.1145/3132525.3134821"
    },
    {
      "text": "Danielle Bragg, Nicholas Huynh, and Richard E Ladner. 2016. A personalizable mobile sound detector app design for deaf and hard-of-hearing users. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 3--13.  ",
      "doi": "10.1145/2982142.2982171"
    },
    {
      "text": "Virginia Braun, Victoria Clarke, and Gareth Terry. 2014. Thematic analysis. Qual Res Clin Health Psychol 24 (2014), 95--114.",
      "doi": ""
    },
    {
      "text": "Lisa Elliot, Michael Stinson, James Mallory, Donna Easton, and Matt Huenerfauth. 2016. Deaf and hard of hearing individuals' perceptions of communication with hearing colleagues in small groups. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 271--272.  ",
      "doi": "10.1145/2982142.2982198"
    },
    {
      "text": "Lisa B Elliot, Michael Stinson, Syed Ahmed, and Donna Easton. 2017. User Experiences When Testing a Messaging App for Communication Between Individuals who are Hearing and Deaf or Hard of Hearing. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 405--406.  ",
      "doi": "10.1145/3132525.3134798"
    },
    {
      "text": "Adam Faeth and Chris Harding. 2014. Emergent effects in multimodal feedback from virtual buttons. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 1 (2014), 3.  ",
      "doi": "10.1145/2535923"
    },
    {
      "text": "Raymond Fok, Harmanpreet Kaur, Skanda Palani, Martez E Mott, and Walter S Lasecki. 2018. Towards More Robust Speech Interactions for Deaf and Hard of Hearing Users. (2018).",
      "doi": ""
    },
    {
      "text": "Abraham T Glasser, Kesavan R Kushalnagar, and Raja S Kushalnagar. 2017. Feasibility of Using Automatic Speech Recognition with Voices of Deaf and Hard-of-Hearing Individuals. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 373--374.  ",
      "doi": "10.1145/3132525.3134819"
    },
    {
      "text": "Jonathan V Hall and Alan B Krueger. 2018. An analysis of the labor market for Uberâ?'s driver-partners in the United States. ILR Review 71, 3 (2018), 705--732.",
      "doi": ""
    },
    {
      "text": "Judith Harkins, Paula E Tucker, Norman Williams, and Jeff Sauro. 2010. Vibration signaling in mobile devices for emergency alerting: A study with deaf evaluators. Journal of deaf studies and deaf education 15, 4 (2010), 438--445.",
      "doi": ""
    },
    {
      "text": "Seth D Harris and Alan B Krueger. 2015. A Proposal for Modernizing Labor Laws for Twenty-First-Century Work: The «Independent Worker». Brookings Washington.",
      "doi": ""
    },
    {
      "text": "Marion Hersh, James Ohene-Djan, and Saduf Naqvi. 2010. Investigating road safety issues and deaf people in the United Kingdom: an empirical study and recommendations for good practice. Journal of prevention & intervention in the community 38, 4 (2010), 290--305.",
      "doi": ""
    },
    {
      "text": "Lesley Jones and Gloria Pullen. 1989. European Social Policy Survey of People Who Are Deaf. Disability and dependency (1989), 127.",
      "doi": ""
    },
    {
      "text": "Hamed Ketabdar and Tim Polzehl. 2009. Tactile and visual alerts for deaf people by mobile phones. In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility. ACM, 253-- 254.  ",
      "doi": "10.1145/1639642.1639701"
    },
    {
      "text": "Sooyeon Lee, Chien Wen Yuan, Benjamin V Hanrahan, Mary Beth Rosson, and John M Carroll. 2017. Reaching Out: Investigating Different Modalities to Help People with Visual Impairments Acquire Items. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 389--390.  ",
      "doi": "10.1145/3132525.3134817"
    },
    {
      "text": "Tara Matthews, Scott Carter, Carol Pai, Janette Fong, and Jennifer Mankoff. 2006. Scribe4Me: Evaluating a mobile sound transcription tool for the deaf. In International Conference on Ubiquitous Computing. Springer, 159--176.  ",
      "doi": "10.1007/11853565_10"
    },
    {
      "text": "Matthias Mielke, André Schäfer, and Rainer Brück. 2010. Integrated circuit for detection of acoustic emergency signals in road traffic. In Mixed Design of Integrated Circuits and Systems (MIXDES), 2010 Proceedings of the 17th International Conference. IEEE, 562--565.",
      "doi": ""
    },
    {
      "text": "Yi-Hao Peng, Ming-Wei Hsi, Paul Taele, Ting-Yu Lin, Po-En Lai, Leon Hsu, Tzu-chuan Chen, Te-Yen Wu, Yu-An Chen, Hsien-Hui Tang, et al. 2018. SpeechBubbles: Enhancing Captioning Experiences for Deaf and Hard-of-Hearing People in Group Conversations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 293.  ",
      "doi": "10.1145/3173574.3173867"
    },
    {
      "text": "Mary R Power, Des Power, and Louise Horstmanshof. 2006. Deaf people communicating via SMS, TTY, relay service, fax, and computers in Australia. Journal of deaf studies and deaf education 12, 1 (2006), 80--92.",
      "doi": ""
    },
    {
      "text": "Mark S Rosenbaum, Mauricio Losada Otalora, and Germán Contreras Ramírez. 2017. How to create a realistic customer journey map. Business Horizons 60, 1 (2017), 143--150.",
      "doi": ""
    },
    {
      "text": "Christopher D Wickens. 2002. Multiple resources and performance prediction. Theoretical issues in ergonomics science 3, 2 (2002), 159--177.",
      "doi": ""
    },
    {
      "text": "Kanwal Yousaf, Zahid Mehmood, Tanzila Saba, Amjad Rehman, Muhammad Rashid, Muhammad Altaf, and Zhang Shuguang. 2018. A Novel Technique for Speech Recognition and Visualization Based Mobile Application to Support Two-Way Communication between Deaf-Mute and Normal Peoples. Wireless Communications and Mobile Computing 2018 (2018).",
      "doi": ""
    }
  ]
}