{
  "doi": "10.1145/3290605.3300835",
  "title": "Security - Visible, Yet Unseen?",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "An unsolved debate in the field of usable security concerns whether security mechanisms should be visible, or blackboxed away from the user for the sake of usability. However, tying this question to pragmatic usability factors only might be simplistic. This study aims at researching the impact of displaying security mechanisms on User Experience (UX) in the context of e-voting. Two versions of an e-voting application were designed and tested using a between-group experimental protocol (N=38). Version D displayed security mechanisms, while version ND did not reveal any security-related information. We collected data on UX using standardised evaluation scales and semi-structured interviews. Version D performed better overall in terms of UX and need fulfilment. Qualitative analysis of the interviews gives further insights into factors impacting perceived security. Our study adds to existing research suggesting a conceptual shift from usability to UX and discusses implications for designing and evaluating secure systems.",
  "tags": [
    "user experience",
    "empirical study",
    "e-voting",
    "usable security",
    "security mechanisms"
  ],
  "authors": [
    {
      "name": "Verena Distler",
      "institution": "University of Luxembourg, Esch-sur-Alzette, Luxembourg",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260538",
      "orcid": "0000-0002-4461-0551"
    },
    {
      "name": "Marie-Laure Zollinger",
      "institution": "University of Luxembourg, Esch-sur-Alzette, Luxembourg",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366202",
      "orcid": "missing"
    },
    {
      "name": "Carine Lallemand",
      "institution": "University of Luxembourg, Esch-sur-Alzette, Luxembourg",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486656273",
      "orcid": "missing"
    },
    {
      "name": "Peter B. Roenne",
      "institution": "University of Luxembourg, Esch-sur-Alzette, Luxembourg",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365529",
      "orcid": "missing"
    },
    {
      "name": "Peter Y. A. Ryan",
      "institution": "University of Luxembourg, Esch-sur-Alzette, Luxembourg",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332525008",
      "orcid": "missing"
    },
    {
      "name": "Vincent Koenig",
      "institution": "University of Luxembourg, Esch-sur-Alzette, Luxembourg",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550585756",
      "orcid": "0000-0001-9940-6286"
    }
  ],
  "references": [
    {
      "text": "Ruba Abu-Salma, Elissa M Redmiles, Blase Ur, and Miranda Wei. 2018. Exploring User Mental Models of End-to-End Encrypted Communication Tools. In Proceedings of the 8th USENIX Workshop on Free and Open Communications on the Internet (FOCI). Baltimore, MD, 8. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk V. Distler et al.",
      "doi": ""
    },
    {
      "text": "Claudia Z. Acemyan, Philip Kortum, Michael D. Byrne, and Dan S. Wallach. 2014. Usability of voter verifiable, end-to-end voting systems: Baseline data for Helios, Prêt à Voter, and Scantegrity II. The USENIX Journal of Election Technology and Systems 2, 3 (2014), 26--56.",
      "doi": ""
    },
    {
      "text": "Anne Adams and Martina Angela Sasse. 1999. Users are not the enemy. Commun. ACM 42, 12 (Dec. 1999), 40--46.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Ben Adida. 2008. Helios: Web-based Open-Audit Voting. 335--348. ",
      "doi": "10.5555/1496711.1496734"
    },
    {
      "text": "Benjamin B Bederson, Paul S Herrnson, Richard G Niemi, Bongshin Lee, and Robert M Sherman. 2003. Electronic Voting System Usability Issues. NEW HORIZONS 5 (2003), 8.",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "US Election Assistance Commission. {n. d.}. Elections - Critical Infrastructure - Elections as Critical Infrastructure. https://www.eac.gov/ election-officials/elections-critical-infrastructure/",
      "doi": ""
    },
    {
      "text": "Lorrie Cranor and Simson Garfinkel. 2005. Security and Usability. O'Reilly Media, Inc. ",
      "doi": "10.5555/1098730"
    },
    {
      "text": "L. F. Cranor and S. Garfinkel. 2004. Guest Editors' Introduction: Secure or Usable? IEEE Security Privacy 2, 5 (Sept. 2004), 16--18.  ",
      "doi": "10.1109/MSP.2004.69"
    },
    {
      "text": "Steve Dodier-Lazaro, M Angela Sasse, Ruba Abu-Salma, and Ingolf Becker. 2017. From Paternalistic to User-Centred Security: Putting Users First with Value-Sensitive Design. In Workshop on Values in Computing. 09 May 2017. 7.",
      "doi": ""
    },
    {
      "text": "P Dourish, R. E Grinter, J. D de la Flor, and M Joseph. 2004. Security in the Wild: User Strategies for Managing Security as an Everyday, Practical Problem. Personal and Ubiquitous Computing 8 (2004).  ",
      "doi": ""
    },
    {
      "text": "Paul Dunphy, John Vines, Lizzie Coles-Kemp, Rachel Clarke, Vasilis Vlachokyriakos, Peter Wright, John McCarthy, and Patrick Olivier. 2014. Understanding the Experience-Centeredness of Privacy and Security Technologies. ACM Press, 83--94.  ",
      "doi": "10.1145/2683467.2683475"
    },
    {
      "text": "W. Keith Edwards, Erika Shehan Poole, and Jennifer Stoll. 2008. Security automation considered harmful?. In Proceedings of the 2007 Workshop on New Security Paradigms - NSPW '07. ACM Press, New Hampshire, 33.  ",
      "doi": "10.1145/1600176.1600182"
    },
    {
      "text": "Sascha Fahl, Marian Harbach, Thomas Muders, Matthew Smith, and Uwe Sander. 2012. Helping Johnny 2.0 to encrypt his Facebook conversations. In Proceedings of the Eighth Symposium on Usable Privacy and Security - SOUPS '12. ACM Press, Washington, D.C., 1.  ",
      "doi": "10.1145/2335356.2335371"
    },
    {
      "text": "Ana Ferreira, Jean-Louis Huynen, Vincent Koenig, Gabriele Lenzini, and Salvador Rivas. 2015. Do Graphical Cues Effectively Inform Users? In Human Aspects of Information Security, Privacy, and Trust, Theo Tryfonas and Ioannis Askoxylakis (Eds.). Vol. 9190. Springer International Publishing, Cham, 323--334.  ",
      "doi": "10.1007/978-3-319-20376-8_29"
    },
    {
      "text": "Simson Garfinkel and Heather Richter Lipford. 2014. Usable Security : History, Themes, and Challenges. Morgan & Claypool Publishers, San Rafael, United States. ",
      "doi": "10.5555/2755205"
    },
    {
      "text": "Dieter Gollmann, Cormac Herley, Vincent Koenig, Wolter Pieters, and Martina Angela Sasse. 2015. Socio-Technical Security Metrics (Dagstuhl Seminar 14491). Dagstuhl reports 4, 12 (2015), 28.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl. 2008. User experience (UX): towards an experiential perspective on product quality. In Proceedings of the 20th Conference on l'Interaction Homme-Machine. ACM, 11--15.  ",
      "doi": "10.1145/1512714.1512717"
    },
    {
      "text": "Marc Hassenzahl, Sarah Diefenbach, and Anja Göritz. 2010. Needs, affect, and interactive products - Facets of user experience. Interacting with Computers 22, 5 (Sept. 2010), 353--362.  ",
      "doi": "10.1016/j.intcom.2010.04.002"
    },
    {
      "text": "Marc Hassenzahl, Kai Eckoldt, Sarah Diefenbach, Matthias Laschke, Eva Len, and Joonhwan Kim. 2013. Designing moments of meaning and pleasure. Experience design and happiness. International Journal of Design 7, 3 (2013).",
      "doi": ""
    },
    {
      "text": "Frederick Herzberg. 1976. One More Time: How Do You Motivate Employees? In Job Satisfaction - A Reader, Michael M. Gruneberg (Ed.). Palgrave Macmillan UK, London, 17--32.",
      "doi": ""
    },
    {
      "text": "Karen Holtzblatt and Hugh Beyer. 2016. Contextual design: Design for life. Morgan Kaufmann. ",
      "doi": "10.5555/3086720"
    },
    {
      "text": "James Kalbach. 2016. Mapping experiences: A complete guide to creating value through journeys, blueprints, and diagrams. \" O'Reilly Media, Inc.\". ",
      "doi": "10.5555/3051862"
    },
    {
      "text": "René F. Kizilcec. 2016. How Much Information?: Effects of Transparency on Trust in an Algorithmic Interface. ACM Press, 2390--2395.  ",
      "doi": "10.1145/2858036.2858402"
    },
    {
      "text": "Jesper Kjeldskov and Mikael B. Skov. 2007. Studying Usability In Sitro: Simulating Real World Phenomena in Controlled Environments. International Journal of Human-Computer Interaction 22, 1--2 (April 2007), 7--36.",
      "doi": ""
    },
    {
      "text": "Carine Lallemand and Vincent Koenig. 2017. Lab Testing Beyond Usability: Challenges and Recommendations for Assessing User Experiences. Journal of Usability Studies 12, 3 (2017), 133--154. ",
      "doi": "10.5555/3190862.3190866"
    },
    {
      "text": "Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and Evaluation of a User Experience Questionnaire. In HCI and Usability for Education and Work, Andreas Holzinger (Ed.). Vol. 5298. Springer Berlin Heidelberg, Berlin, Heidelberg, 63--76.  ",
      "doi": "10.1007/978-3-540-89350-9_6"
    },
    {
      "text": "Sascha Mahlke. 2008. User experience of interaction with technical systems. Doctoral dissertation.",
      "doi": ""
    },
    {
      "text": "Niels Raabjerg Mathiasen and Susanne Bodker. 2008. Threats or threads: from usable security to secure experience?. In Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges. ACM, 283--289.  ",
      "doi": "10.1145/1463160.1463191"
    },
    {
      "text": "Raydel Montesino and Stefan Fenz. 2011. Information Security Automation: How Far Can We Go?. In 2011 Sixth International Conference on Availability, Reliability and Security. IEEE, Vienna, Austria, 280--285.  ",
      "doi": "10.1109/ARES.2011.48"
    },
    {
      "text": "Donald A. Norman. 2009. When security gets in the way. interactions 16, 6 (Nov. 2009), 60.  ",
      "doi": "10.1145/1620693.1620708"
    },
    {
      "text": "Maina Olembo and Melanie Volkamer (Eds.). 2013. Human-Centered System Design for Electronic Governance: Lessons for Interface Design, User Studies, and Usability Criteria. IGI Global.",
      "doi": ""
    },
    {
      "text": "Jakob Illeborg Pagter and Marianne Graves Petersen. 2007. A Sense of Security in Pervasive Computing - Is the Light on When the Refrigerator Door Is Closed?. In International Conference on Financial Cryptography and Data Security. Springer, 383--388. ",
      "doi": "10.5555/1785594.1785643"
    },
    {
      "text": "Leysia Palen and Paul Dourish. 2003. Unpacking \"Privacy\" for a Networked World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Wolter Pieters. 2006. Acceptance of voting technology: between confidence and trust. In Trust Management, 4th International Conference, iTrust 2006, Pisa, Italy, May 16--19, 2006. Springer, 283--297.  ",
      "doi": "10.1007/11755593_21"
    },
    {
      "text": "V Roto, E Law, A Vermeeren, and J Hoonhout. 2011. User Experience White Paper. In Result from Dagstuhl Seminar on Demarcating User Experience, September 15 - 18, 2010. 12.",
      "doi": ""
    },
    {
      "text": "Peter YA Ryan, Peter B. Rønne, and Vincenzo Iovino. 2016. Selene: Voting with transparent verifiability and coercion-mitigation. In International Conference on Financial Cryptography and Data Security. Springer, 176--192. Security - Visible, Yet Unseen? CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk",
      "doi": ""
    },
    {
      "text": "Stuart E. Schechter, Rachna Dhamija, Andy Ozment, and Ian Fischer. 2007. The Emperor's New Security Indicators. IEEE, 51--65.  ",
      "doi": "10.1109/SP.2007.35"
    },
    {
      "text": "Martin Schrepp. 2018. User Experience Questionnaire Handbook. (2018), 15.",
      "doi": ""
    },
    {
      "text": "IBM Security Services. 2018. The 2018 Cost of a Data Breach Study by the Ponemon Institute. Technical Report.",
      "doi": ""
    },
    {
      "text": "Kennon M. Sheldon, Andrew J. Elliot, Youngmee Kim, and Tim Kasser. 2001. What is satisfying about satisfying events? Testing 10 candidate psychological needs. Journal of personality and social psychology 80, 2 (2001), 325.",
      "doi": "10.1037/0022-"
    },
    {
      "text": "S.W. Smith. 2003. Humans in the loop: Human-computer interaction and security. IEEE Security & Privacy Magazine 1, 3 (May 2003), 75--79.  ",
      "doi": "10.1109/MSECP.2003.1203228"
    },
    {
      "text": "Andreas Sotirakopoulos, Kirstie Hawkey, and Konstantin Beznosov. 2011. On the challenges in usable security lab studies: lessons learned from replicating a study on SSL warnings. In Proceedings of the Seventh Symposium on Usable Privacy and Security. ACM, 3.  ",
      "doi": "10.1145/2078827.2078831"
    },
    {
      "text": "Marco Winckler, Regina Bernhaupt, Philippe Palanque, David Lundin, Kieran Leach, Peter Ryan, Eugenio Alberdi, and Lorenzo Strigini. 2009. Assessing the usability of open verifiable e-voting systems: a trial with the system Prêt à Voter. In Proceedings of ICE-GOV. https://www.irit. fr/page-perso/Marco.Winckler/publications/2009-ICEGOV.pdf",
      "doi": ""
    },
    {
      "text": "Ka-Ping Yee. 2002. User interaction design for secure systems. In International Conference on Information and Communications Security. Springer, 278--290. ",
      "doi": "10.5555/646280.687663"
    }
  ]
}