{
  "doi": "10.1145/3290605.3300790",
  "title": "Geometrically Compensating Effect of End-to-End Latency in Moving-Target Selection Games",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Effects of unintended latency on gamer performance have been reported. End-to-end latency can be corrected by post-input manipulation of activation times, but this gives the player unnatural gameplay experience. For moving-target selection games such as Flappy Bird, the paper presents a predictive model of latency on error rate and a novel compensation method for the latency effects by adjusting the game's geometry design -- e.g., by modifying the size of the selection region. Without manipulation of the game clock, this can keep the user's error rate constant even if the end-to-end latency of the system changes. The approach extends the current model of moving-target selection with two additional assumptions about the effects of latency: (1) latency reduces players' cue-viewing time and (2) pushes the mean of the input distribution backward. The model and method proposed have been validated through precise experiments.",
  "authors": [
    {
      "name": "Injung Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658677861",
      "orcid": "missing"
    },
    {
      "name": "Sunjun Kim",
      "institution": "Aalto University, Espoo, Finland",
      "img": "/do/10.1145/contrib-81460641074/rel-imgonly/sunjun.png",
      "acmid": "81460641074",
      "orcid": "missing"
    },
    {
      "name": "Byungjoo Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659503945",
      "orcid": "0000-0003-0341-448X"
    }
  ],
  "references": [
    {
      "text": "Glen Anderson, Rina Doherty, and Subhashini Ganapathy. 2011. User Perception of Touch Screen Latency. In Design, User Experience, and Usability. Theory, Methods, Tools and Practice, Aaron Marcus (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 195--202.",
      "doi": ""
    },
    {
      "text": "Axel Antoine, Sylvain Malacria, and Géry Casiez. 2018. Using High Frequency Accelerometer and Mouse to Compensate for End-to-end Latency in Indirect Interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 609, 11 pages.  ",
      "doi": "10.1145/3173574.3174183"
    },
    {
      "text": "G. Armitage. 2003. An experimental estimation of latency sensitivity in multiplayer Quake 3. In The 11th IEEE International Conference on Networks, 2003. ICON2003. 137--141.",
      "doi": ""
    },
    {
      "text": "Raymond E. Barber and Henry C. Lucas, Jr. 1983. System Response Time Operator Productivity, and Job Satisfaction. Commun. ACM 26, 11 (Nov. 1983), 972--986.  ",
      "doi": "10.1145/182.358464"
    },
    {
      "text": "Tom Beigbeder, Rory Coughlan, Corey Lusher, John Plunkett, Emmanuel Agu, and Mark Claypool. 2004. The Effects of Loss and Latency on User Performance in Unreal Tournament 2003®. (2004), 144--151.  ",
      "doi": "10.1145/1016540.1016556"
    },
    {
      "text": "François Bérard and Renaud Blanch. 2013. Two Touch System Latency Estimators: High Accuracy and Low Overhead. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, New York, NY, USA, 241--250.  ",
      "doi": "10.1145/2512349.2512796"
    },
    {
      "text": "Yahn W Bernier. 2001. Latency compensating methods in client/server in-game protocol design and optimization. In Game Developers Conference, Vol. 98033.",
      "doi": ""
    },
    {
      "text": "Florian Bockes, Raphael Wimmer, and Andreas Schmid. 2018. LagBox -- Measuring the Latency of USB-Connected Input Devices., Article LBW115 (2018), 6 pages.",
      "doi": "10.1145/3170427.3188632"
    },
    {
      "text": "Catalin V Buhusi and Warren H Meck. 2005. What makes us tick? Functional and neural mechanisms of interval timing. Nature Reviews Neuroscience 6, 10 (2005), 755.",
      "doi": ""
    },
    {
      "text": "Géry Casiez, Thomas Pietrzak, Damien Marchal, Sébastien Poulmane, Matthieu Falce, and Nicolas Roussel. 2017. Characterizing Latency in Touch and Button-Equipped Interactive Systems. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 29--39.  ",
      "doi": "10.1145/3126594.3126606"
    },
    {
      "text": "Irina Ceaparu, Jonathan Lazar, Katie Bessiere, John Robinson, and Ben Shneiderman. 2004. Determining Causes and Severity of End-User Frustration. International Journal of Human-Computer Interaction 17, 3 (2004), 333--356.",
      "doi": ""
    },
    {
      "text": "Mark Claypool, Ragnhild Eg, and Kjetil Raaen. 2017. Modeling user performance for moving target selection with a delayed mouse. In International Conference on Multimedia Modeling. Springer, 226--237.",
      "doi": ""
    },
    {
      "text": "Jonathan Deber, Bruno Araujo, Ricardo Jota, Clifton Forlines, Darren Leigh, Steven Sanders, and Daniel Wigdor. 2016. Hammer Time!: A Low-Cost, High Precision, High Accuracy Tool to Measure the Latency of Touchscreen Devices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2857--2868.  ",
      "doi": "10.1145/2858036.2858394"
    },
    {
      "text": "John Gibbon, Russell M Church, and Warren H Meck. 1984. Scalar timing in memory. Annals of the New York Academy of sciences 423, 1 (1984), 52--77.",
      "doi": ""
    },
    {
      "text": "Niels Henze and Benjamin Poppinga. 2012. Measuring latency of touch and tactile feedback in touchscreen interaction using a mobile game. In Proceedings of the 3rd International Workshop on Research in the Large. New York: ACM. S. 23--26.",
      "doi": ""
    },
    {
      "text": "Zenja Ivkovic, Ian Stavness, Carl Gutwin, and Steven Sutcliffe. 2015. Quantifying and Mitigating the Negative Effects of Local Latencies on Aiming in 3D Shooter Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 135--144.  ",
      "doi": "10.1145/2702123.2702432"
    },
    {
      "text": "Aditya Jain, Ramta Bansal, Avnish Kumar, and KD Singh. 2015. A comparative study of visual and auditory reaction times on the basis of gender and physical activity levels of medical first year students. International Journal of Applied and Basic Medical Research 5, 2 (2015), 124.",
      "doi": ""
    },
    {
      "text": "Arthur R. Jensen and Ella Munro. 1979. Reaction time, movement time, and intelligence. Intelligence 3, 2 (1979), 121 -- 126.",
      "doi": ""
    },
    {
      "text": "Ricardo Jota, Albert Ng, Paul Dietz, and Daniel Wigdor. 2013. How Fast is Fast Enough?: A Study of the Effects of Latency in Direct-touch Pointing Tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2291--2300.  ",
      "doi": "10.1145/2470654.2481317"
    },
    {
      "text": "T. Kaaresoja, E. Anttila, and E. Hoggan. 2011. The effect of tactile feedback latency in touchscreen interaction. In 2011 IEEE World Haptics Conference. 65--70.",
      "doi": ""
    },
    {
      "text": "Topi Kaaresoja and Stephen Brewster. 2010. Feedback is... Late: Measuring Multimodal Delays in Mobile Device Touchscreen Interaction. In International Conference on Multimodal Interfaces and the Workshop on Machine Learning for Multimodal Interaction (ICMIMLMI '10). ACM, New York, NY, USA, Article 2, 8 pages.  ",
      "doi": "10.1145/1891903.1891907"
    },
    {
      "text": "Teemu Kämäräinen, Matti Siekkinen, Antti Ylä-Jääski, Wenxiao Zhang, and Pan Hui. 2017. A Measurement Study on Achieving Imperceptible Latency in Mobile Cloud Gaming. In Proceedings of the 8th ACM on Multimedia Systems Conference (MMSys'17). ACM, New York, NY, USA, 88--99.  ",
      "doi": "10.1145/3083187.3083191"
    },
    {
      "text": "Antti Kangasrääsiö, Kumaripaba Athukorala, Andrew Howes, Jukka Corander, Samuel Kaski, and Antti Oulasvirta. 2017. Inferring cognitive models from data using approximate Bayesian computation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1295--1306.  ",
      "doi": "10.1145/3025453.3025576"
    },
    {
      "text": "Sunjun Kim, Byungjoo Lee, and Antti Oulasvirta. 2018. Impact Activation Improves Rapid Button Pressing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 571, 8 pages.  ",
      "doi": "10.1145/3173574.3174145"
    },
    {
      "text": "Jarrod Knibbe, Hrvoje Benko, and Andrew D. Wilson. 2015. Juggling the Effects of Latency: Software Approaches to Minimizing Latency in Dynamic Projector-Camera Systems. (2015), 93--94.  ",
      "doi": "10.1145/2815585.2815735"
    },
    {
      "text": "Huy Viet Le, Valentin Schwind, Philipp Göttlich, and Niels Henze. 2017. PredicTouch: A System to Reduce Touchscreen Latency Using Neural Networks and Inertial Measurement Units. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY, USA, 230--239.  ",
      "doi": "10.1145/3132272.3134138"
    },
    {
      "text": "Byungjoo Lee, Qiao Deng, Eve Hoggan, and Antti Oulasvirta. 2017. Boxer: A Multimodal Collision Technique for Virtual Objects. In Proceedings of the 19th ACM International Conference on Multimodal Interaction (ICMI 2017). ACM, New York, NY, USA, 252--260.  ",
      "doi": "10.1145/3136755.3136761"
    },
    {
      "text": "Byungjoo Lee, Sunjun Kim, Antti Oulasvirta, Jong-In Lee, and Eunji Park. 2018. Moving Target Selection: A Cue Integration Model. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 230, 12 pages. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Injung Lee, Sunjun Kim, and Byungjoo Lee*  ",
      "doi": "10.1145/3173574.3173804"
    },
    {
      "text": "Byungjoo Lee and Antti Oulasvirta. 2016. Modelling Error Rates in Temporal Pointing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1857--1868.  ",
      "doi": "10.1145/2858036.2858143"
    },
    {
      "text": "Steven W. K. Lee and Rocky K. C. Chang. 2017. On \"shot around a corner\" in first-person shooter games. In 2017 15th Annual Workshop on Network and Systems Support for Games (NetGames). 1--6. ",
      "doi": "10.5555/3167906.3167908"
    },
    {
      "text": "Jiandong Liang, Chris Shaw, and Mark Green. 1991. On Temporalspatial Realism in the Virtual Reality Environment. In Proceedings of the 4th Annual ACM Symposium on User Interface Software and Technology (UIST '91). ACM, New York, NY, USA, 19--25.  ",
      "doi": "10.1145/120782.120784"
    },
    {
      "text": "I. Scott MacKenzie and Colin Ware. 1993. Lag As a Determinant of Human Performance in Interactive Systems. In Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems (CHI '93). ACM, New York, NY, USA, 488--493.  ",
      "doi": "10.1145/169059.169431"
    },
    {
      "text": "Gale L. Martin and Kenneth G. Corl. 1986. System response time effects on user productivity. Behaviour & Information Technology 5, 1 (1986), 3--13.",
      "doi": ""
    },
    {
      "text": "Albert Ng, Julian Lepinski, Daniel Wigdor, Steven Sanders, and Paul Dietz. 2012. Designing for Low-latency Direct-touch Input. (2012), 453--464.  ",
      "doi": "10.1145/2380116.2380174"
    },
    {
      "text": "Antti Oulasvirta, Sunjun Kim, and Byungjoo Lee. 2018. Neuromechanics of a Button Press. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 508, 13 pages.  ",
      "doi": "10.1145/3173574.3174082"
    },
    {
      "text": "Eunji Park, Hyunju Kim, and Byungjoo Lee. 2018. Button++: Designing Risk-aware Smart Buttons. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW116.  ",
      "doi": "10.1145/3170427.3188645"
    },
    {
      "text": "Eunji Park and Byungjoo Lee. 2018. Predicting Error Rates in Pointing Regardless of Target Motion. arXiv preprint arXiv:1806.02973 (2018).",
      "doi": ""
    },
    {
      "text": "Andriy Pavlovych and Wolfgang Stuerzlinger. 2009. The Tradeoff Between Spatial Jitter and Latency in Pointing Tasks. In Proceedings of the 1st ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS '09). ACM, New York, NY, USA, 187--196.  ",
      "doi": "10.1145/1570433.1570469"
    },
    {
      "text": "PlayOverwatch. 2016. Developer Update | Let's Talk Netcode | Overwatch. https://www.youtube.com/watch?v=vTH2ZPgYujQ",
      "doi": ""
    },
    {
      "text": "Peter Quax, Patrick Monsieurs, Wim Lamotte, Danny De Vleeschauwer, and Natalie Degrande. 2004. Objective and Subjective Evaluation of the Influence of Small Amounts of Delay and Jitter on a Recent First Person Shooter Game. In Proceedings of 3rd ACM SIGCOMM Workshop on Network and System Support for Games (NetGames '04). ACM, New York, NY, USA, 152--156.  ",
      "doi": "10.1145/1016540.1016557"
    },
    {
      "text": "K. Raaen, R. Eg, and C. Griwodz. 2014. Can gamers detect cloud delay?. In 2014 13th Annual Workshop on Network and Systems Support for Games. 1--3. ",
      "doi": "10.5555/2755535.2755543"
    },
    {
      "text": "Bruno H Repp. 2005. Sensorimotor synchronization: a review of the tapping literature. Psychonomic bulletin & review 12, 6 (2005), 969--992.",
      "doi": ""
    },
    {
      "text": "Walter Ritter, Guido Kempter, and Tobias Werner. 2015. UserAcceptance of Latency in Touch Interactions. In Universal Access in Human-Computer Interaction. Access to Interaction, Margherita Antona and Constantine Stephanidis (Eds.). Springer International Publishing, Cham, 139--147.",
      "doi": ""
    },
    {
      "text": "Steven C Seow. 2008. Designing and engineering time: The psychology of time perception in software. Addison-Wesley Professional. ",
      "doi": "10.5555/1377538"
    },
    {
      "text": "Jose Shelton and Gideon Praveen Kumar. 2010. Comparison between auditory and visual simple reaction times. Neuroscience & Medicine 1, 1 (2010), 30--32.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1984. Response Time and Display Rate in Human Performance with Computers. ACM Comput. Surv. 16, 3 (Sept. 1984), 265--285.  ",
      "doi": "10.1145/2514.2517"
    },
    {
      "text": "Richard H.Y. So and Michael J Griffin. 1992. Compensating lags in headcoupled displays using head position prediction and image deflection. Journal of Aircraft 29, 6 (1992), 1064--1068.",
      "doi": ""
    },
    {
      "text": "Steven L. Teal and Alexander I. Rudnicky. 1992. A Performance Model of System Delay and User Strategy Selection. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, New York, NY, USA, 295--305.  ",
      "doi": "10.1145/142750.142818"
    },
    {
      "text": "R. J. Teather, A. Pavlovych, W. Stuerzlinger, and I. S. MacKenzie. 2009. Effects of tracking technology, latency, and spatial jitter on object movement. In 2009 IEEE Symposium on 3D User Interfaces. 43--50.  ",
      "doi": "10.1109/3DUI.2009.4811204"
    },
    {
      "text": "Simon Thorpe, Denis Fize, and Catherine Marlot. 1996. Speed of processing in the human visual system. nature 381, 6582 (1996), 520.",
      "doi": ""
    },
    {
      "text": "Jiann-Rong Wu and Ming Ouhyoung. 2000. On latency compensation and its effects on head-motion trajectories in virtual environments. The Visual Computer 16, 2 (01 Mar 2000), 79--90.",
      "doi": ""
    },
    {
      "text": "Min Hong Yun, Songtao He, and Lin Zhong. 2017. Reducing Latency by Eliminating Synchrony. In Proceedings of the 26th International Conference on World Wide Web (WWW '17). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 331--340.  ",
      "doi": "10.1145/3038912.3052557"
    }
  ]
}