{
  "doi": "10.1145/3290605.3300368",
  "title": "How Guiding Questions Facilitate Feedback Exchange in Project-Based Learning",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Peer feedback is essential for learning in project-based disciplines. However, students often need guidance when acting as either a feedback provider or a feedback receiver, both to gain from peer feedback and to criticize their peers' work. This paper explores how to more effectively scaffold this exchange such that peers more deeply engage in the feedback process. Within a game design course, we introduced different processes for feedback receivers to write questions to guide peer feedback. Feedback receivers wrote four main types of guiding questions: improve, share, brainstorm, critique. We found that \"improve'' questions tended to lead to better feedback (more specific, critical, and actionable) than other question types, but feedback receivers wrote improve questions least often. We offer insights on how best to scaffold the question-writing process to facilitate peer feedback exchange.",
  "authors": [
    {
      "name": "Amy Cook",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659211415",
      "orcid": "missing"
    },
    {
      "name": "Jessica Hammer",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658650866",
      "orcid": "0000-0003-4102-2575"
    },
    {
      "name": "Salma Elsayed-Ali",
      "institution": "William & Mary, Williamsburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366078",
      "orcid": "0000-0002-3709-3787"
    },
    {
      "name": "Steven Dow",
      "institution": "University of California, San Diego, La Jolla, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758794857",
      "orcid": "0000-0002-1354-9866"
    }
  ],
  "references": [
    {
      "text": "Lorin W Anderson, David R Krathwohl, Peter W Airasian, Kathleen A Cruikshank, Richard E Mayer, Paul R Pintrich, James Raths, and Merlin C Wittrock. 2001. A Taxonomy for Learning, Teaching, and Assessing: A Revision of Bloom's Taxonomy of Educational Objectives, Abridged Edition. Technical Report. https://kkm39ysrp06.storage.googleapis. com/MDgwMTMxOTAzWA==06.pdf",
      "doi": ""
    },
    {
      "text": "Heidi Andrade and Ying Du. 2005. Student perspectives on rubricreferenced assessment. Practical Assessment, Research & Evaluation (2005). http://www.pareonline.net/pdf/v10n3.pdf",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 1997. Contextual Design: Defining Customer-Centered Systems. Elsevier. 496 pages. https://books.google. com/books?hl=en{&}lr={&}id=JxQaQgOONGIC{&}pgis=1 ",
      "doi": "10.5555/523184"
    },
    {
      "text": "Judy Bolen. 2009. An investigation of limited professional development on teacher questioning and learner responses. Ph.D. Dissertation. Walden University. http://search.proquest.com/openview/ df8d581b39771450c81c457e018d47ee/1?pq-origsite=gscholar{&}cbl= 18750{&}diss=y",
      "doi": ""
    },
    {
      "text": "David Boud and Nancy Falchikov. 1989. Quantitative studies of student self-assessment in higher education: a critical analysis of findings. Higher Education 18, 5 (1989), 529--549.",
      "doi": ""
    },
    {
      "text": "Deborah L. Butler and Phillip H. Winne. 1995. Feedback and selfregulated learning: A theoretical synthesis. Review of educational research (1995). http://rer.sagepub.com/content/65/3/245.short",
      "doi": ""
    },
    {
      "text": "MTH Chi and R Wylie. 2014. The ICAP framework: Linking cognitive engagement to active learning outcomes. Educational Psychologist (2014).",
      "doi": ""
    },
    {
      "text": "Yu-Hui Ching and Yu-Chang Hsu. 2013. Peer feedback to facilitate project-based learning in an online environment. International Review of Research in Open and Distance Learning 14, 5 (2013).",
      "doi": ""
    },
    {
      "text": "Kwangsu Cho and Christian D. Schunn. 2007. Scaffolded writing and rewriting in the discipline: A web-based reciprocal peer review system. Computers & Education 48, 3 (apr 2007), 409--426.  ",
      "doi": "10.1016/j.compedu.2005.02.004"
    },
    {
      "text": "Peggy A. Ertmer, Jennifer C. Richardson, Brian Belland, Denise Camin, Patrick Connolly, Glen Coulthard, Kimfong Lei, and Christopher Mong. 2007. Using Peer Feedback to Enhance the Quality of Student Online Postings: An Exploratory Study. Journal of Computer-Mediated Communication 12, 2 (jan 2007), 412--433.",
      "doi": ""
    },
    {
      "text": "Eureka Foong, Darren Gergle, and Elizabeth M. Gerber. 2017. Novice and Expert Sensemaking of Crowdsourced Design Feedback. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (dec 2017), 1--18.  ",
      "doi": "10.1145/3134680"
    },
    {
      "text": "Charles G. Galloway and Norma I. Mickelson. 1973. Improving Teachers' Questions. The Elementary School Journal 74, 3 (dec 1973), 145--148.",
      "doi": ""
    },
    {
      "text": "Graham Gibbs and Claire Simpson. 2004. Conditions under which assessment supports students' learning. Learning and teaching in higher education (2004). http://www2.glos.ac.uk/offload/tli/lets/lathe/ issue1/issue1.pdf{#}page=5",
      "doi": ""
    },
    {
      "text": "Sarah Gielen, Elien Peeters, Filip Dochy, Patrick Onghena, and Katrien Struyven. 2010. Improving the effectiveness of peer feedback for learning. Learning and Instruction 20, 4 (aug 2010), 304--315.",
      "doi": ""
    },
    {
      "text": "Gunnar Harboe and Elaine M. Huang. 2015. Real-World Affinity Diagramming Practices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. ACM Press, New York, New York, USA, 95--104. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Cook et al.  ",
      "doi": "10.1145/2702123.2702561"
    },
    {
      "text": "Tasos Hovardas, Olia E. Tsivitanidou, and Zacharias C. Zacharia. 2014. Peer versus expert feedback: An investigation of the quality of peer feedback among secondary school students. Computers & Education 71 (feb 2014), 133--152.  ",
      "doi": "10.1016/j.compedu.2013.09.019"
    },
    {
      "text": "Chinmay Kulkarni, Michael S. Bernstein, and Scott Klemmer. 2015. PeerStudio: Rapid Peer Feedback Emphasizes Revision and Improves Performance. Proceedings from The Second (2015) ACM Conference on Learning @ Scale (2015), 75--84. https://hci.stanford.edu/publications/ 2015/PeerStudio/Peerstudio.pdf  ",
      "doi": "10.1145/2724660.2724670"
    },
    {
      "text": "Lan Li, Xiongyi Liu, and Allen L. Steckelberg. 2010. Assessor or assessee: How student learning improves by giving and receiving peer feedback. British Journal of Educational Technology 41, 3 (may 2010), 525--536.",
      "doi": ""
    },
    {
      "text": "Ngar-Fun Liu and David Carless. 2006. Peer feedback: the learning element of peer assessment. Teaching in Higher education (2006).",
      "doi": ""
    },
    {
      "text": "David J. Nicol and Deborah Macfarlane-Dick. 2006. Formative assessment and self-regulated learning: A model and seven principles of good feedback practice. Studies in Higher Education (2006). http://ewds.strath.ac.uk/REAP/public/Papers/DN{_}SHE{_}Final.pdf",
      "doi": ""
    },
    {
      "text": "Alandeom W. Oliveira. 2010. Improving teacher questioning in science inquiry discussions through professional development. Journal of Research in Science Teaching 47, 4 (apr 2010), 422--453.",
      "doi": ""
    },
    {
      "text": "D. Royce Sadler. 1989. Formative assessment and the design of instructional systems. Instructional Science 18, 2 (jun 1989), 119--144.",
      "doi": ""
    },
    {
      "text": "Amy Shannon, Jessica Hammer, Hassler Thurston, Natalie Diehl, and Steven P. Dow. 2016. PeerPresents: A Web-Based System for In-Class Peer Feedback during Student Presentations. In Designing Interactive Systems. 447--458.  ",
      "doi": "10.1145/2901790.2901816"
    },
    {
      "text": "Amy Shannon, Alex Sciuto, Danielle Hu, Steven P. Dow, and Jessica Hammer. 2017. Better Organization or a Source of Distraction? Introducing Digital Peer Feedback to a Paper-Based Classroom. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2017). ACM.  ",
      "doi": "10.1145/3025453.3025564"
    },
    {
      "text": "David Tinapple, Loren Olson, and John Sadauskas. 2013. CritViz: Webbased software supporting peer critique in large creative classrooms. Bulletin of the IEEE Technical Committee on Learning Technology (2013). http://www.ieeetclt.org/issues/january2013/Tinapple.pdf",
      "doi": ""
    },
    {
      "text": "Kieth Topping. 1998. Peer assessment between students in colleges and universities. Review of educational Research (1998). http://rer. sagepub.com/content/68/3/249.short",
      "doi": ""
    },
    {
      "text": "A Yuan, K Luther, and M Krause. 2016. Almost an Expert: The Effects of Rubrics and Expertise on Perceived Value of Crowdsourced Design Critiques. (CSCW'16) Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (2016), 1005--1017. https://www.kurtluther.com/pdf/ CrowdCrit{_}CSCW{_}2016{_}camera.pdf  ",
      "doi": "10.1145/2818048.2819953"
    },
    {
      "text": "Haiyi Zhu, Steven P. Dow, Robert E. Kraut, and Aniket Kittur. 2014. Reviewing versus doing. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14. ACM Press, New York, New York, USA, 1445--1455.  ",
      "doi": "10.1145/2531602.2531718"
    }
  ]
}