{
  "doi": "10.1145/3290605.3300820",
  "title": "Understanding Online News Behaviors",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "The news landscape has been changing dramatically over the past few years. Whereas news once came from a small set of highly edited sources, now people can find news from thousands of news sites online, through a variety of channels such as web search, social media, email newsletters, or direct browsing. We set out to understand how Americans read news online using web browser logs collected from 174 diverse participants. We found that 20% of all news sessions started with a web search, that 16% started from social media, that 61% of news sessions only involved a single news domain, and that 47% of our participants read news from both sides of the political spectrum. We conclude with key implications for online news, social media, and search sites to encourage more balanced news browsing.",
  "authors": [
    {
      "name": "Frank Bentley",
      "institution": "Yahoo/Oath, Sunnyvale, CA, USA",
      "img": "/do/10.1145/contrib-81311482466/rel-imgonly/me.jpg",
      "acmid": "81311482466",
      "orcid": "missing"
    },
    {
      "name": "Katie Quehl",
      "institution": "Yahoo/Oath, Sunnyvale, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210813",
      "orcid": "missing"
    },
    {
      "name": "Jordan Wirfs-Brock",
      "institution": "Yahoo/Oath, Sunnyvale, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365564",
      "orcid": "missing"
    },
    {
      "name": "Melissa Bica",
      "institution": "Yahoo/Oath, Sunnyvale, CA, USA",
      "img": "/do/10.1145/contrib-99659060788/rel-imgonly/bica_profile_square.jpg",
      "acmid": "99659060788",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Rachel Weisel Amy Mitchell. 2014. Political Polarization and Media Habits: From Fox News to Facebook, How Liberals and Conservatives Keep Up with Politics. (2014). http://assets.pewresearch.org/wp-content/uploads/sites/13/2014/10/Political-Polarization-and-Media-Habits-FINAL-REPORT-7--27--15. pdf",
      "doi": ""
    },
    {
      "text": "Michael Barthel. 2017. Despite subscription surges for largest U.S. newspapers, circulation and revenue fall for industry overall. (2017). http://www.pewresearch.org/fact-tank/2017/06/01/circulation-and-revenue-fall-for-newspaper-industry/",
      "doi": ""
    },
    {
      "text": "Frank R. Bentley, Nediyana Daskalova, and Brooke White. 2017. Comparing the Reliability of Amazon Mechanical Turk and Survey Monkey to Traditional Market Research Surveys. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 1092--1099.  ",
      "doi": "10.1145/3027063.3053335"
    },
    {
      "text": "Juan Pablo Carrascal, Christopher Riederer, Vijay Erramilli, Mauro Cherubini, and Rodrigo de Oliveira. 2013. Your Browsing Behavior for a Big Mac: Economics of Personal Information Online. In Proceedings of the 22Nd International Conference on World Wide Web (WWW '13). ACM, New York, NY, USA, 189--200.  ",
      "doi": "10.1145/2488388.2488406"
    },
    {
      "text": "Steven Chaffee and Stacey Frank. 1996. How Americans get political information: Print versus broadcast news. The Annals of the American Academy of Political and Social Science 546, 1 (1996), 48--58.",
      "doi": ""
    },
    {
      "text": "ComScore. 2018. ComScore Media Metrix report for News/Information. (6 2018). https://mymetrix.comscore.com",
      "doi": ""
    },
    {
      "text": "Michael Dimock. 2014. Political Polarization in the American Public. (2014). http://www.people-press.org/2014/06/12/political-polarization-in-the-american-public/",
      "doi": ""
    },
    {
      "text": "Carol Dougherty. 2017. Political Polarization, 19942017. (2017). http://www.people-press.org/interactives/political-polarization-1994--2017/",
      "doi": ""
    },
    {
      "text": "Nina Eliasoph. 1998. Avoiding politics: How Americans produce apathy in everyday life. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Robert Faris, Hal Roberts, Bruce Etling, Nikki Bourassa, Ethan Zuckerman, and Yochai Benkler. 2017. Partisanship, propaganda, and disinformation: Online media and the 2016 US presidential election. (2017).",
      "doi": ""
    },
    {
      "text": "Seth Flaxman, Sharad Goel, and Justin M Rao. 2016. Filter bubbles, echo chambers, and online news consumption. Public opinion quarterly 80, S1 (2016), 298--320.",
      "doi": ""
    },
    {
      "text": "Martin Flintham, Christian Karner, Khaled Bachour, Helen Creswick, Neha Gupta, and Stuart Moran. 2018. Falling for Fake News: Investigating the Consumption of News via Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 376, 10 pages.  ",
      "doi": "10.1145/3173574.3173950"
    },
    {
      "text": "Gallup. 2018. Party Affiliation. (2018). https://news.gallup.com/poll/15370/party-affiliation.aspx",
      "doi": ""
    },
    {
      "text": "Gallup. 2018. Presidential Approval Ratings - Donald Trump. (2018). https://news.gallup.com/poll/203198/presidential-approval-ratings-donald-trump.aspx",
      "doi": ""
    },
    {
      "text": "Sharad Goel, Jake M Hofman, and M Irmak Sirer. 2012. Who Does What on the Web: A Large-Scale Study of Browsing Behavior. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Martijn Kleppe and Marco Otte. 2017. Analysing and understanding news consumption patterns by tracking online user behaviour with a multimodal research design. Digital Scholarship in the Humanities 32, suppl_2 (2017), ii158--ii170.",
      "doi": ""
    },
    {
      "text": "Mounia Lalmas, Heather O'Brien, and Elad Yom-Tov. 2014. Measuring User Engagement. Morgan & Claypool Publishers. Synthesis Lectures on Information Concepts, Retrieval, and Services. ",
      "doi": "10.5555/2787876"
    },
    {
      "text": "Danielle Lottridge and Frank R. Bentley. 2018. Let's Hate Together: How People Share News in Messaging, Social, and Public Networks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 60, 13 pages.  ",
      "doi": "10.1145/3173574.3173634"
    },
    {
      "text": "Eli Pariser. 2011. The filter bubble: How the new personalized web is changing what we read and how we think. Penguin. ",
      "doi": "10.5555/2361740"
    },
    {
      "text": "Markus Prior. 2007. Post-broadcast democracy: How media choice increases inequality in political involvement and polarizes elections. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Kristen Purcell, Lee Rainie, Amy Mitchell, Tom Rosenstiel, and Kenny Olmstead. 2010. Understanding the participatory news consumer. Pew Internet and American Life Project 1 (2010), 19--21.",
      "doi": ""
    },
    {
      "text": "Paul Resnick, R. Kelly Garrett, Travis Kriplean, Sean A. Munson, and Natalie Jomini Stroud. 2013. Bursting Your (Filter) Bubble: Strategies for Promoting Diverse Exposure. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work Companion (CSCW '13). ACM, New York, NY, USA, 95--100.  ",
      "doi": "10.1145/2441955.2441981"
    },
    {
      "text": "David Tewksbury. 2003. What do Americans really want to know? Tracking the behavior of news readers on the Internet. Journal of communication 53, 4 (2003), 694--710.",
      "doi": ""
    },
    {
      "text": "David Tewksbury, Michelle L Hals, and Allyson Bibart. 2008. The efficacy of news browsing: The relationship of news consumption style to social and political efficacy. Journalism & Mass Communication Quarterly 85, 2 (2008), 257--272.",
      "doi": ""
    },
    {
      "text": "Brian E Weeks and R Lance Holbert. 2013. Predicting dissemination of news content in social media: A focus on reception, friending, and partisanship. Journalism & Mass Communication Quarterly 90, 2 (2013), 212--232.",
      "doi": ""
    }
  ]
}