{
  "doi": "10.1145/3290605.3300435",
  "title": "Reading Face, Reading Health: Exploring Face Reading Technologies for Everyday Health",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "With the recent advancement in computer vision, Artificial Intelligence (AI), and mobile technologies, it has become technically feasible for computerized Face Reading Technologies (FRTs) to learn about one's health in everyday settings. However, how to design FRT-based applications for everyday health practices remains unexplored. This paper presents a design study with a technology probe called Faced, a mobile health checkup application based on the facial diagnosis method from Traditional Chinese Medicine (TCM). A field trial of Faced with 10 participants suggests potential usage modes and highlights a number of critical design issues in the use of FRTs for everyday health, including adaptability, practicality, sensitivity, and trustworthiness. We end by discussing design implications to address the unique challenges of fully integrating FRTs into everyday health practices.",
  "tags": [
    "everyday healthcare",
    "facial diagnosis",
    "design study",
    "traditional chinese medicine",
    "health monitoring",
    "face reading technologies",
    "health",
    "tcm",
    "wellbeing",
    "self care"
  ],
  "authors": [
    {
      "name": "Xianghua Ding",
      "institution": "Fudan University, Shanghai, China",
      "img": "/do/10.1145/contrib-81539424156/rel-imgonly/81539424156.png",
      "acmid": "81539424156",
      "orcid": "0000-0001-8122-6252"
    },
    {
      "name": "Yanqi Jiang",
      "institution": "Fudan University, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366232",
      "orcid": "0000-0001-9433-4500"
    },
    {
      "name": "Xiankang Qin",
      "institution": "Fudan University, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367006",
      "orcid": "missing"
    },
    {
      "name": "Yunan Chen",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131427",
      "orcid": "missing"
    },
    {
      "name": "Wenqiang Zhang",
      "institution": "Fudan University, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314487207",
      "orcid": "missing"
    },
    {
      "name": "Lizhe Qi",
      "institution": "Fudan University, Shanghai, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367065",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ashraf Abdul, Jo Vermeulen, Danding Wang, Brian Y. Lim, and Mohan Kankanhalli. 2018. Trends and Trajectories for Explainable, Accountable and Intelligible Systems: An HCI Research Agenda. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 582, 18 pages.  ",
      "doi": "10.1145/3173574.3174156"
    },
    {
      "text": "Yasmina Andreu-Cabedo, Pedro Castellano, Sara Colantonio, Giuseppe Coppini, Riccardo Favilla, Danila Germanese, Giorgos Giannakakis, Daniela Giorgi, Marcus Larsson, Paolo Marraccini, et al. 2015. Mirror mirror on the wall--An intelligent multisensory mirror for well-being self-assessment. In Multimedia and Expo (ICME), 2015 IEEE International Conference on. IEEE, 1--6.",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Paul Marshall, Anna L Cox, and Yunan Chen. 2017. Quantifying the body and caring for the mind: self-tracking in multiple sclerosis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6889--6901.  ",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Hilary Browne, Benjamin B. Bederson, Catherine Plaisant, and Allison Druin. 2001. Designing an Interactive Message Board as a Technology Probe for Family Communication. (2001).",
      "doi": ""
    },
    {
      "text": "Felix Cheung. 2011. TCM: Made in China. Nature 480, 7378 (2011).",
      "doi": ""
    },
    {
      "text": "James Clawson, Jessica A. Pater, Andrew D. Miller, Elizabeth D. Mynatt, and Lena Mamykina. 2015. No longer wearing:investigating the abandonment of personal health-tracking technologies on craigslist. In ACM International Joint Conference on Pervasive and Ubiquitous Computing. 647--658.  ",
      "doi": "10.1145/2750858.2807554"
    },
    {
      "text": "Gari D Clifford. 200 Shortliffe Edward H, Cimino James J: \"Biomedical Informatics; Computer Applications in Health Care and Biomedicine\". Biomedical Engineering Online 5, 1 (2006), 61--61.",
      "doi": ""
    },
    {
      "text": "Giuseppe Coppini, Veronica Chiara Zuccaia, Renata De Marià, JulieAnne Nazare, Maria Aurora Morales, and Sara Colantonio. 2017. User acceptance of self-monitoring technology to prevent cardio-metabolic diseases: The Wize Mirror. In Wireless and Mobile Computing, Networking and Communications (WiMob),. IEEE, 265--271.",
      "doi": ""
    },
    {
      "text": "Ciprian Adrian Corneanu, Marc Oliu Simón, Jeffrey F Cohn, and Sergio Escalera Guerrero. 2016. Survey on rgb, 3d, thermal, and multimodal approaches for facial expression recognition: History, trends, and affect-related applications. IEEE transactions on pattern analysis and machine intelligence 38, 8 (2016), 1548--1568.",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Vanessa Evers, Satyan Ramlal, Maarten van Someren, Lloyd Rutledge, Natalia Stash, Lora Aroyo, and Bob Wielinga. 2008. The effects of transparency on trust in and acceptance of a content-based art recommender. User Modeling and User-Adapted Interaction 18, 5 (20 Aug 2008), 455.  ",
      "doi": "10.1007/s11257-008-9051-3"
    },
    {
      "text": "Daniel A. Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A. Munson. 2016. Beyond Abandonment to Next Steps:Understanding and Designing for Life after Personal Informatics Tool Use. 2016 (2016), 1109--1113.  ",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. \"I Always Assumed That I Wasn'T Really That Close to {Her}\": Reasoning About Invisible Algorithms in News Feeds. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 153--162.  ",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Alexander G Logan et al. 2007. Mobile phone-based remote patient monitoring system for management of hypertension in diabetic patients. American Journal of Hypertension 20, 9 (2007), 942--948.",
      "doi": ""
    },
    {
      "text": "Darren L Walters et al. 2010. A mobile phone-based care model for outpatient cardiac rehabilitation: the care assessment platform (CAP). BMC Cardiovascular Disorders 10, 1 (2010), 5--5.",
      "doi": ""
    },
    {
      "text": "Dena M Bravata et al. 2007. Using Pedometers to Increase Physical Activity and Improve Health: A Systematic Review. JAMA 298, 19 (2007), 2296--2304.",
      "doi": ""
    },
    {
      "text": "Felicia Cordeiro et al. 2015. Barriers and Negative Nudges: Exploring Challenges in Food Journaling. 2015 (2015), 1159--1162.  ",
      "doi": "10.1145/2702123.2702155"
    },
    {
      "text": "Francisco Nunes et al. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Transactions on Computer-Human Interaction 22, 6 (2015), 33.  ",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Jakob E Bardram et al. 2013. Designing mobile health technology for bipolar disorder: a field trial of the monarca system. (2013), 2627-- 2636.  ",
      "doi": "10.1145/2470654.2481364"
    },
    {
      "text": "James Jengweei Lin et al. 2006. Fish'n'Steps: encouraging physical activity with an interactive computer game. ubiquitous computing (2006), 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Joyce K Anastasi et al. 2014. Tongue Inspection in TCM: Observations in a Study Sample of Patients Living with HIV. Medical Acupuncture 26, 1 (2014), 15--22.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina et al. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. (2008), 477--486.  ",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Rui Guo et al. 2015. Analysis and Recognition of Traditional Chinese Medicine Pulse Based on the Hilbert-Huang Transform and Random Forest in Patients with Coronary Heart Disease. Evidence-based Complementary and Alternative Medicine 2015 (2015), 895749--895749.",
      "doi": ""
    },
    {
      "text": "Gaver, Bill, Dunne, Tony, Pacenti, and Elena. 1999. Design: Cultural probes. Interactions 6, 1 (1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Erik Gronvall and Nervo Verdezoto. 2013. Beyond self-monitoring: understanding non-functional aspects of home-based healthcare technology. (2013), 587--596.  ",
      "doi": "10.1145/2493432.2493495"
    },
    {
      "text": "M. Shamim Hossain and Ghulam Muhammad. 2015. Cloud-Assisted Speech and Face Recognition Framework for Health Monitoring. Mobile Networks Applications 20, 3 (2015), 391--399.  ",
      "doi": "10.1007/s11036-015-0586-3"
    },
    {
      "text": "Yangyang Hu, Hong Lu, Jinhua Cheng, Wenqiang Zhang, Fufeng Li, and Weifei Zhang. 2016. Robust Lip Segmentation Based on Complexion Mixture Model. In Pacific-Rim Conference on Advances in Multimedia Information Processing. 85--94.  ",
      "doi": "10.1007/978-3-319-48890-5_9"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Westerlund Bo, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Helen Evans, Heiko Hansen, and Nicolas Roussel. 2003. Technology probes: inspiring design for and with families. In Sigchi Conference on Human Factors in Computing Systems. 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "H. Hutchinson, C. Plaisant, and A. Druin. 2002. Case Study: A Message Board as a Technology Probe for Family Communication and Coordination. (2002).",
      "doi": ""
    },
    {
      "text": "Yuma Inagawa, Junki Hakamta, and Masataka Tokumaru. 2013. A Support System for Healthy Eating Habits: Optimization of Recipe Retrieval. Springer Berlin Heidelberg. 168--172 pages.",
      "doi": ""
    },
    {
      "text": "Brielle Jaekel. {n. d.}. Sephora boosts augmented reality shopping with real-time facial recognition. http://t.cn/EGjuPZK. {Last accessed: August 29, 2018}.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A Kientz. 2012. Lullaby: a capture & access system for understanding the sleep environment. In Proceedings of the 2012 ACM conference on ubiquitous computing. ACM, 226--234.  ",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "K Kleisner, V Chvátalová, and J Flegr. 2014. Perceived Intelligence Is Associated with Measured Intelligence in Men but Not Women. Plos One 9, 3 (2014), e81237.",
      "doi": ""
    },
    {
      "text": "Geoff Langdale, Judy Kay, and Bob Kummerfeld. 2006. Using an intergenerational communications system as a 'light-weight' technology probe. In Extended Abstracts Proceedings of the 2006 Conference on Human Factors in Computing Systems, CHI 2006, Montréal, Québec, Canada, April. 1001--1006.  ",
      "doi": "10.1145/1125451.1125643"
    },
    {
      "text": "Fang Li, Maylor K. H. Leung, Namisha Khanna, and Purva Satija. 2007. Online fortune telling system using biometrics feature. In IEEE International Conference on Systems, Man and Cybernetics. 4002--4007.",
      "doi": ""
    },
    {
      "text": "Y. M. Li, H. Z. Yang, W. B. Guan, Q. S. Ke, M. Dai, H. P. Xie, and S. J. Zhang. 2008. Therapeutic effect of traditional Chinese medicine on coagulation disorder and accompanying intractable jaundice in hepatitis B virus-related liver cirrhosis patients. World Journal of Gastroenterology 14, 39 (2008), 6060--6064.",
      "doi": ""
    },
    {
      "text": "Chang Liu, Changbo Zhao, Guozheng Li, Fufeng Li, and Zhi Wang. 2014. Computerized color analysis for facial diagnosis in traditional Chinese medicine. In IEEE International Conference on Bioinformatics and Biomedicine. 613--614.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 20 Self-tracking, health and medicine. Health Sociology Review 26, 1 (2017), 1--5.",
      "doi": ""
    },
    {
      "text": "Andrew D Miller and Elizabeth D Mynatt. 2014. StepStream: a schoolbased pervasive social fitness system for everyday adolescent health. (2014), 2823--2832.  ",
      "doi": "10.1145/2556288.2557190"
    },
    {
      "text": "Francisco Nunes and Geraldine Fitzpatrick. 2018. Understanding the Mundane Nature of Self-care: Ethnographic Accounts of People Living with Parkinson's. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 402.  ",
      "doi": "10.1145/3173574.3173976"
    },
    {
      "text": "Kingsley C. Nwosu. 2016. MOBILE FACIAL RECOGNITION SYSTEM FOR PATIENT IDENTIFICATION IN MEDICAL EMERGENCIES FOR DEVELOPING ECONOMIES. Journal for the Advancement of Developing Economies 5, 1 (2016), 10.",
      "doi": ""
    },
    {
      "text": "William T. Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation:a long term field study of the photobox. In ACM Conference on Human Factors in Computing Systems. 1961--1970.  ",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Institute of Medicine (US) Committee on Health Literacy, L NielsenBohlman, A. M. Panzer, and D. A. Kindig. 2004. Health Literacy: A Prescription to End Confusion. National Academies Press 15, 4 (2004), 389--395.",
      "doi": ""
    },
    {
      "text": "Aisling Ann Okane, Yvonne Rogers, and Ann Blandford. 2015. Concealing or Revealing Mobile Medical Devices?: Designing for Onstage and Offstage Presentation. (2015), 1689--1698.  ",
      "doi": "10.1145/2702123.2702453"
    },
    {
      "text": "Michel Owayjan, Amer Dergham, Gerges Haber, Nidal Fakih, Ahmad Hamoush, and Elie Abdo. 2013. Face Recognition Security System. In International Joint Conferences on Computer, Information, and Systems Sciences, and Engineering.",
      "doi": ""
    },
    {
      "text": "A. Pantazi, A. Sebastian, T. A. Antonakopoulos, and P. Bächtold. 2008. Probe-based ultrahigh-density storage technology. Ibm Journal of Research Development 52, 4.5 (2008), 493--511.  ",
      "doi": "10.1147/rd.524.0493"
    },
    {
      "text": "Enrica Papi, Athina Belsi, and Alison H McGregor. 2015. A knee monitoring device and the preferences of patients living with osteoarthritis: a qualitative study. BMJ open 5, 9 (2015), e007980.",
      "doi": ""
    },
    {
      "text": "Stephen Purpura, Victoria Schwanda, Kaiton Williams, William Stubler, and Phoebe Sengers. 2011. Fit4life: the design of a persuasive technology promoting healthy behavior and ideal weight. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 423--432.  ",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Wang Qi. 2002. Status and Prospect of Constitutional Theory in Traditional Chinese Medicine. China Journal of Basic Medicine in Traditional Chinese Medicine (2002).",
      "doi": ""
    },
    {
      "text": "A Radovic, C Farris, K Reynolds, E. C. Reis, E Miller, and B. D. Stein. 2014. Primary care providers' beliefs about teen and parent barriers to depression care. Journal of Developmental Behavioral Pediatrics Jdbp 35, 8 (2014), 534--8.",
      "doi": ""
    },
    {
      "text": "Florian Schroff, Dmitry Kalenichenko, and James Philbin. 2015. FaceNet: A unified embedding for face recognition and clustering. (2015), 815--823.",
      "doi": ""
    },
    {
      "text": "Leon F Seltzer. {n. d.}. What Does It Mean When We Stick Our Tongues Out? http://t.cn/EGjudme. {Last accessed: August 31, 2018}.",
      "doi": ""
    },
    {
      "text": "J. J. Shu and Y. Sun. 2007. Developing classification indices for Chinese pulse diagnosis. Complementary Therapies in Medicine 15, 3 (2007), 190--198.",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Nadia Bianchi-Berthouze, and Amanda CdeC Williams. 2017. Supporting everyday function in chronic pain using wearable technology. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3903--3915.  ",
      "doi": "10.1145/3025453.3025947"
    },
    {
      "text": "T Tempark and T Shwayder. 2012. Chinese fortune-telling based on face and body mole positions: a hidden agenda regarding mole removal. Archives of Dermatology 148, 6 (2012), 772.",
      "doi": ""
    },
    {
      "text": "Tammy Toscos and Kay Connelly. 2013. Designing for Positive Health Affect: Decoupling Negative Emotion and Health Monitoring Technologies. (2013), 153--160.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252116"
    },
    {
      "text": "Hitomi Tsujita and Jun Rekimoto. 2011. Smiling makes happier:enhancing positive mood and communication with smileus encouraging digital appliances. In International Conference on Ubiquitous Computing. 1--10.  ",
      "doi": "10.1145/2030112.2030114"
    },
    {
      "text": "Jhim Kiel M. Verame, Enrico Costanza, and Sarvapali D. Ramchurn. 2016. The Effect of Displaying System Confidence Information on the Usage of Autonomous Systems for Non-specialist Applications: A Lab Study. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4908--4920.  ",
      "doi": "10.1145/2858036.2858369"
    },
    {
      "text": "Yonggang Wang, Yue Zhou, Jie Yang, and Qing Xu. 200 An Image Analysis System for Tongue Diagnosis in Traditional Chinese Medicine. 3314 (2004), 1181--1186.  ",
      "doi": "10.1007/978-3-540-30497-5_181"
    },
    {
      "text": "Kiyoshi Yasuda, Noriaki Kuwahara, and Kazunari Morimoto. 2009. Remote reminiscence talking and scheduling prompter for individuals with dementia using video phone. In International Conference on Universal Access in Human-Computer Interaction. Springer, 429--438.  ",
      "doi": "10.1007/978-3-642-02707-9_49"
    },
    {
      "text": "Kaipeng Zhang, Zhanpeng Zhang, Zhifeng Li, and Yu Qiao. 2016. Joint Face Detection and Alignment Using Multitask Cascaded Convolutional Networks. IEEE Signal Processing Letters 23, 10 (2016), 1499-- 1503.",
      "doi": "10.1109/LSP.2016.2603342"
    },
    {
      "text": "C. Zhao, G. Z. Li, F. Li, Z. Wang, and C. Liu. 2014. Qualitative and quantitative analysis for facial complexion in traditional Chinese medicine. Biomed Research International 2014, 3 (2014), 207589.",
      "doi": ""
    },
    {
      "text": "Jin Haia Zhou, Taoa Yang, Da Qinga Shen, and Xu Dongb Wang. 2010. Construction and application of eight principal syndrome differentiation knowledge base of tongue diagnosis based on ANN. Application Research of Computers 01, 2 (2010), 110--113.",
      "doi": ""
    },
    {
      "text": "??? and ???. 2014. ???????????? (Study on Face Shape of Patients with Five-Zang Organs Diseases). In ??? ???????????????????????.",
      "doi": ""
    },
    {
      "text": "???, ???, ???, ???, ??, ???, ???, ??, and ???. 2018. ?????????????????\"???? ??????? (Study of Yunzhongyi Mobile Health Management Platform Based on Tongue,Face and Asking Diagnosis Information). ??????? 2 (2018).",
      "doi": ""
    },
    {
      "text": "??? and ???. 2015. ????????????????? ???? (Adaptive Facial Skin Region Extraction Based on Lip Color and Complexion). ?????? 31, 8 (2015), 1--3.",
      "doi": ""
    }
  ]
}