{
  "doi": "10.1145/3290605.3300249",
  "title": "Casual Microtasking: Embedding Microtasks in Facebook",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2019,
  "badges": [],
  "abstract": "Microtasks enable people with limited time and context to contribute to a larger task. In this paper we explore casual microtasking, where microtasks are embedded into other primary activities so that they are available to be completed when convenient. We present a casual microtasking experience that inserts writing microtasks from an existing microwriting tool into the user's Facebook feed. From a two-week deployment of the system with nine people, we observe that casual microtasking enabled participants to get things done during their breaks, and that they tended to do so only after first engaging with Facebook's social content. Participants were most likely to complete the writing microtasks during periods of the day associated with low focus, and would occasionally use them as a springboard to open the original document in Word. These findings suggest casual microtasking can help people leverage spare micromoments to achieve meaningful micro-goals, and even encourage them to return to work.",
  "tags": [
    "casual microtasking",
    "tasks",
    "microtasking",
    "interruptions"
  ],
  "authors": [
    {
      "name": "Nathan Hahn",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020675",
      "orcid": "missing"
    },
    {
      "name": "Shamsi T. Iqbal",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sue K Adams, Jennifer F Daly, and Desireé N Williford. 2013. Article Commentary: Adolescent Sleep and Cellular Phone Use: Recent Trends and Implications for Research. Health services insights 6 (2013), HSI-- S11083.",
      "doi": ""
    },
    {
      "text": "Nikola Banovic, Christina Brant, Jennifer Mankoff, and Anind Dey. 2014. ProactiveTasks: the short of mobile device use sessions. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. ACM, 243--252.  ",
      "doi": "10.1145/2628363.2628380"
    },
    {
      "text": "Michael S Bernstein, Greg Little, Robert C Miller, Björn Hartmann, Mark S Ackerman, David R Karger, David Crowell, and Katrina Panovich. 2010. Soylent: a word processor with a crowd inside. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. ACM, 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Erin Brady, Meredith Ringel Morris, and Jeffrey P Bigham. 2015. Gauging receptiveness to social microvolunteering. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1055--1064.  ",
      "doi": "10.1145/2702123.2702329"
    },
    {
      "text": "Carrie J Cai, Philip J Guo, James R Glass, and Robert C Miller. 2015. Wait-learning: Leveraging wait time for second language education. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3701--3710.  ",
      "doi": "10.1145/2702123.2702267"
    },
    {
      "text": "Carrie J Cai, Shamsi T Iqbal, and Jaime Teevan. 2016. Chain reactions: The impact of order on microtask chains. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3143--3154.  ",
      "doi": "10.1145/2858036.2858237"
    },
    {
      "text": "Justin Cheng, Jaime Teevan, Shamsi T Iqbal, and Michael S Bernstein. 2015. Break it down: A comparison of macro-and microtasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 4061--4064.  ",
      "doi": "10.1145/2702123.2702146"
    },
    {
      "text": "Lydia B Chilton, Greg Little, Darren Edge, Daniel S Weld, and James A Landay. 2013. Cascade: Crowdsourcing taxonomy creation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1999--2008.  ",
      "doi": "10.1145/2470654.2466265"
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Peng Dai, Jeffrey M Rzeszotarski, Praveen Paritosh, and Ed H Chi. 2015. And now for something completely different: Improving crowdsourcing workflows with micro-diversions. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 628--638.  ",
      "doi": "10.1145/2675133.2675260"
    },
    {
      "text": "Joan Morris DiMicco, Werner Geyer, David R Millen, Casey Dugan, and Beth Brownholtz. 2009. People sensemaking and relationship building on an enterprise social network site. In System Sciences, 2009. HICSS'09. 42nd Hawaii International Conference on. IEEE, 1--10.  ",
      "doi": "10.1109/HICSS.2009.343"
    },
    {
      "text": "Victor M González and Gloria Mark. 2004. Constant, constant, multitasking craziness: managing multiple working spheres. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Nick Greer, Jaime Teevan, and Shamsi T Iqbal. 2016. An introduction to technological support for writing. Technical Report. Technical Report. Microsoft Research Tech Report MSR-TR-2016-001.",
      "doi": ""
    },
    {
      "text": "Shamsi T Iqbal and Eric Horvitz. 2007. Disruption and recovery of computing tasks: field study, analysis, and directions. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 677--686.  ",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Shamsi T. Iqbal, Jaime Teevan, Dan Liebling, and Anne Loomis Thompson. 2018. Multitasking with Play Write, a Mobile Microproductivity Tool. In Proceedings of the 31st annual ACM symposium on User interface software and technology. ACM.  ",
      "doi": "10.1145/3242587.3242611"
    },
    {
      "text": "Harmanpreet Kaur, Alex C Williams, Anne Loomis Thompson, Walter S Lasecki, Shamsi T Iqbal, and Jaime Teevan. 2018. Creating Better Action Plans for Writing Tasks via Vocabulary-based Planning. In Proceedings of the 21st ACM Conference on Computer-Supported Cooperative Work and Social Computing. ACM.",
      "doi": "10.1145/3274355"
    },
    {
      "text": "Cliff Lampe Kenneth Olmstead and Nicole Ellison. {n. d.}. Social Media and the Workplace. http://www.pewinternet.org/2016/06/22/ social-media-and-the-workplace/. Accessed: 2017-04--15.",
      "doi": ""
    },
    {
      "text": "Joy Kim, Sarah Sterman, Allegra Argent Beal Cohen, and Michael S Bernstein. 2017. Mechanical novel: Crowdsourcing complex work through reflection and revision. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 233--245.  ",
      "doi": "10.1145/2998181.2998196"
    },
    {
      "text": "Aniket Kittur, Jeffrey V Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The future of crowd work. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 1301--1318.  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Aniket Kittur, Boris Smus, Susheel Khamkar, and Robert E Kraut. 2011. Crowdforge: Crowdsourcing complex work. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 43--52.  ",
      "doi": "10.1145/2047196.2047202"
    },
    {
      "text": "Geza Kovacs. 2015. FeedLearn: Using Facebook Feeds for Microlearning. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 1461--1466.  ",
      "doi": "10.1145/2702613.2732775"
    },
    {
      "text": "Jussi Kuittinen, Annakaisa Kultima, Johannes Niemelä, and Janne Paavilainen. 2007. Casual games discussion. In Proceedings of the 2007 conference on Future Play. ACM, 105--112.  ",
      "doi": "10.1145/1328202.1328221"
    },
    {
      "text": "Anand Kulkarni, Matthew Can, and Björn Hartmann. 2012. Collaboratively crowdsourcing workflows with turkomatic. In Proceedings of the acm 2012 conference on computer supported cooperative work. ACM, 1003--1012.  ",
      "doi": "10.1145/2145204.2145354"
    },
    {
      "text": "Gloria Mark, Victor M Gonzalez, and Justin Harris. 2005. No task left behind?: examining the nature of fragmented work. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 321--330.  ",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2014. Capturing the mood: facebook and face-to-face encounters in the workplace. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 1082--1094.  ",
      "doi": "10.1145/2531602.2531673"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, and Paul Johns. 2014. Bored mondays and focused afternoons: the rhythm of attention and online activity in the workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3025--3034.  ",
      "doi": "10.1145/2556288.2557204"
    },
    {
      "text": "Gloria Mark, Yiran Wang, and Melissa Niiya. 2014. Stress and multitasking in everyday college life: an empirical study of online activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 41--50.  ",
      "doi": "10.1145/2556288.2557361"
    },
    {
      "text": "David Martin, Benjamin V Hanrahan, Jacki O'Neill, and Neha Gupta. 2014. Being a turker. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 224-- 235.  ",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Michael Nebeling, Alexandra To, Anhong Guo, Adrian A de Freitas, Jaime Teevan, Steven P Dow, and Jeffrey P Bigham. 2016. WearWrite: Crowd-assisted writing from smartwatches. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3834-- 3846.  ",
      "doi": "10.1145/2858036.2858169"
    },
    {
      "text": "Martin Pielot, Karen Church, and Rodrigo de Oliveira. 2014. An Insitu Study of Mobile Phone Notifications. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, New York, NY, USA, 233--242. Casual Microtasking: Embedding Microtasks in Facebook CHI 2019, May 4--9, 2019, Glasgow, Scotland UK  ",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "Jaime Teevan, Shamsi T Iqbal, and Curtis Von Veh. 2016. Supporting collaborative writing with microtasks. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2657--2668.  ",
      "doi": "10.1145/2858036.2858108"
    },
    {
      "text": "Jaime Teevan, Daniel J Liebling, and Walter S Lasecki. 2014. Selfsourcing personal tasks. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 2527--2532.  ",
      "doi": "10.1145/2559206.2581181"
    },
    {
      "text": "Rajan Vaish, Keith Wyngarden, Jingshu Chen, Brandon Cheung, and Michael S Bernstein. 2014. Twitch crowdsourcing: crowd contributions in short bursts of time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3645--3654.  ",
      "doi": "10.1145/2556288.2556996"
    },
    {
      "text": "Tilo Westermann, Sebastian Möller, and Ina Wechsung. 2015. Assessing the relationship between technical affinity, stress and notifications on smartphones. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct. ACM, 652--659.  ",
      "doi": "10.1145/2786567.2793684"
    },
    {
      "text": "Bu Zhong, Marie Hardin, and Tao Sun. 2011. Less effortful thinking leads to more social networking? The associations between the use of social network sites and personality traits. Computers in Human Behavior 27, 3 (2011), 1265--1271.  ",
      "doi": "10.1016/j.chb.2011.01.008"
    }
  ]
}