{
  "doi": "10.1145/3290605.3300864",
  "title": "PeerLens: Peer-inspired Interactive Learning Path Planning in Online Question Pool",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Online question pools like LeetCode provide hands-on exercises of skills and knowledge. However, due to the large volume of questions and the intent of hiding the tested knowledge behind them, many users find it hard to decide where to start or how to proceed based on their goals and performance. To overcome these limitations, we present PeerLens, an interactive visual analysis system that enables peer-inspired learning path planning. PeerLens can recommend a customized, adaptable sequence of practice questions to individual learners, based on the exercise history of other users in a similar learning scenario. We propose a new way to model the learning path by submission types and a novel visual design to facilitate the understanding and planning of the learning path. We conducted a within-subject experiment to assess the efficacy and usefulness of PeerLens in comparison with two baseline systems. Experiment results show that users are more confident in arranging their learning path via PeerLens and find it more informative and intuitive.",
  "authors": [
    {
      "name": "Meng Xia",
      "institution": "The Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659274880",
      "orcid": "missing"
    },
    {
      "name": "Mingfei Sun",
      "institution": "The Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659090636",
      "orcid": "missing"
    },
    {
      "name": "Huan Wei",
      "institution": "The Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366230",
      "orcid": "missing"
    },
    {
      "name": "Qing Chen",
      "institution": "The Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659751949",
      "orcid": "missing"
    },
    {
      "name": "Yong Wang",
      "institution": "The Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659193437",
      "orcid": "missing"
    },
    {
      "name": "Lei Shi",
      "institution": "Beihang University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366615",
      "orcid": "missing"
    },
    {
      "name": "Huamin Qu",
      "institution": "The Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337801",
      "orcid": "0000-0002-3344-9694"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "The Hong Kong University of Science and Technology, Hong Kong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    }
  ],
  "references": [
    {
      "text": "Gediminas Adomavicius and Alexander Tuzhilin. 2005. Toward the next generation of recommender systems: A survey of the state-ofthe-art and possible extensions. IEEE Transactions on Knowledge & Data Engineering 6 (2005), 734--749.  ",
      "doi": "10.1109/TKDE.2005.99"
    },
    {
      "text": "Jim Broadbent and WL Poon. 2015. Self-regulated learning strategies & academic achievement in online higher education learning environments: A systematic review. The Internet and Higher Education 27 (2015), 1--13.",
      "doi": ""
    },
    {
      "text": "Kathleen Burnett, Laurie J Bonnici, Shawne D Miksa, and Joonmin Kim. 2007. Frequency, intensity and topicality in online learning: An exploration of the interaction dimensions that contribute to student satisfaction in online learning. Journal of Education for Library and Information Science (2007), 21--35.",
      "doi": ""
    },
    {
      "text": "Nan Cao, Yu-Ru Lin, Fan Du, and Dashun Wang. 2016. Episogram: Visual summarization of egocentric social interactions. IEEE Computer Graphics and Applications 36, 5 (2016), 72--81.",
      "doi": ""
    },
    {
      "text": "Qing Chen, Xuanwu Yue, Xavier Plantaz, Yuanzhe Chen, Conglei Shi, Ting-Chuen Pong, and Huamin Qu. 2018. ViSeq: Visual Analytics of Learning Sequence in Massive Open Online Courses. IEEE Transactions on Visualization and Computer Graphics (2018).",
      "doi": ""
    },
    {
      "text": "Kuo-Kuang Chu, Chien-I Lee, and Rong-Shi Tsai. 2011. Ontology technology to assist learners' navigation in the concept map learning system. Expert Systems with Applications 38, 9 (2011), 11293--11299.  ",
      "doi": "10.1016/j.eswa.2011.02.178"
    },
    {
      "text": "Ricardo Conejo, Eduardo Guzmán, Eva Millán, Mónica Trella, José Luis Pérez-De-La-Cruz, and Antonia Ríos. 2004. SIETTE: A web-based tool for adaptive testing. International Journal of Artifcial Intelligence in Education 14, 1 (2004), 29--61. ",
      "doi": "10.5555/1434852.1434855"
    },
    {
      "text": "Question Pool Defnition. 2018. (2018). https://help.blackboard.com/ Learn/Instructor/Tests_Pools_Surveys/Reuse_Questions/Question_ Pools_Banks Accessed: 2018--9--21.",
      "doi": ""
    },
    {
      "text": "Hendrik Drachsler, Hans GK Hummel, and Rob Koper. 2008. Personal recommender systems for learners in lifelong learning networks: the requirements, techniques and model. International Journal of Learning Technology 3, 4 (2008), 404--423.  ",
      "doi": "10.1504/IJLT.2008.019376"
    },
    {
      "text": "Fan Du, Sana Malik, Georgios Theocharous, and Eunyee Koh. 2018. Personalizable and Interactive Sequence Recommender System. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW002.  ",
      "doi": "10.1145/3170427.3188506"
    },
    {
      "text": "Fan Du, Catherine Plaisant, Neil Spring, and Ben Shneiderman. 2016. EventAction: Visual analytics for temporal event sequence recommendation. In In Proceedings of Visual Analytics Science and Technology (VAST), 2016 IEEE. IEEE, 61--70.",
      "doi": ""
    },
    {
      "text": "Fan Du, Catherine Plaisant, Neil Spring, and Ben Shneiderman. 2017. Finding similar people to guide life choices: Challenge, design, and evaluation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5498--5544.  ",
      "doi": "10.1145/3025453.3025777"
    },
    {
      "text": "Elena L Glassman, Ned Gulley, and Robert C Miller. 2013. Toward facilitating assistance to students attempting engineering design problems. In Proceedings of the ninth annual international ACM conference on International Computing Education Research. ACM, 41--46.  ",
      "doi": "10.1145/2493394.2493400"
    },
    {
      "text": "Elena L Glassman, Aaron Lin, Carrie J Cai, and Robert C Miller. 2016. Learnersourcing personalized hints. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1626--1636.  ",
      "doi": "10.1145/2818048.2820011"
    },
    {
      "text": "José Janssen, Colin Tattersall, Wim Waterink, Bert Van den Berg, René Van Es, Catherine Bolman, and Rob Koper. 2007. Self-organising navigational support in lifelong learning: how predecessors can lead the way. Computers & Education 49, 3 (2007), 781--793.  ",
      "doi": "10.1016/j.compedu.2005.11.022"
    },
    {
      "text": "Hangzhou Dianzi Online Judge. 2018. (2018). http://acm.hdu.edu.cn/ Accessed: 2018--9--21.",
      "doi": ""
    },
    {
      "text": "Josua Krause, Adam Perer, and Harry Stavropoulos. 2016. Supporting iterative cohort construction with visual temporal queries. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 91--100.",
      "doi": "10.1109/TVCG.2015.2467622"
    },
    {
      "text": "Milos Krstajic, Enrico Bertini, and Daniel Keim. 2011. Cloudlines: Compact display of event episodes in multiple time-series. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2432--2439. ",
      "doi": "10.5555/2068462.2068661"
    },
    {
      "text": "Leetcode. 2018. (2018). https://leetcode.com/",
      "doi": ""
    },
    {
      "text": "Gord McCalla. 2004. The ecological approach to the design of elearning environments: Purpose-based capture and use of information about learners. Journal of Interactive Media in Education 2004, 1 (2004).",
      "doi": ""
    },
    {
      "text": "Megan Monroe, Rongjian Lan, Juan Morales del Olmo, Ben Shneiderman, Catherine Plaisant, and Jef Millstein. 2013. The challenges of specifying intervals and absences in temporal queries: A graphical language approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2349--2358.  ",
      "doi": "10.1145/2470654.2481325"
    },
    {
      "text": "Codefght User Number. 2018. (2018). https:// searchsoftwarequality.techtarget.com/news/450424234/ CodeFights-ofers-a-unique-tool-for-developer-recruiting Accessed: 2018--9--21.",
      "doi": ""
    },
    {
      "text": "Chris Piech, Mehran Sahami, Jonathan Huang, and Leonidas Guibas. 2015. Autonomously generating hints by inferring problem solving policies. In Proceedings of the Second (2015) ACM Conference on Learning@ Scale. ACM, 195--204.  ",
      "doi": "10.1145/2724660.2724668"
    },
    {
      "text": "Catherine Plaisant, Brett Milash, Anne Rose, Seth Widof, and Ben Shneiderman. 1996. LifeLines: visualizing personal histories. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 221--227.  ",
      "doi": "10.1145/238386.238493"
    },
    {
      "text": "Wikipedia Compatitive programming. 2018. (2018). https://en. wikipedia.org/wiki/Competitive_programming Accessed: 2018--9--21.",
      "doi": ""
    },
    {
      "text": "Jagath C Rajapakse and Loi Sy Ho. 2005. Markov encoding for detecting signals in genomic sequences. IEEE/ACM Transactions on Computational Biology and Bioinformatics (TCBB) 2, 2 (2005), 131--142.  ",
      "doi": "10.1109/TCBB.2005.27"
    },
    {
      "text": "Francesco Ricci, Lior Rokach, and Bracha Shapira. 2015. Recommender systems: introduction and challenges. In Recommender systems handbook. Springer, 1--34.",
      "doi": "10.5555/2857282"
    },
    {
      "text": "Alexander Rind, Taowei David Wang, Wolfgang Aigner, Silvia Miksch, Krist Wongsuphasawat, Catherine Plaisant, Ben Shneiderman, et al. 2013. Interactive information visualization to explore and query electronic health records. Foundations and Trends® in Human--Computer Interaction 5, 3 (2013), 207--298.  ",
      "doi": "10.1561/1100000039"
    },
    {
      "text": "Mojtaba Salehi and Isa Nakhai Kamalabadi. 2013. Hybrid recommendation approach for learning material based on sequential pattern of the accessed material and the learner's preference tree. Knowledge-Based Systems 48 (2013), 57--69.  ",
      "doi": "10.1016/j.knosys.2013.04.012"
    },
    {
      "text": "Antonio A Sánchez-Ruiz, Guillermo Jimenez-Diaz, Pedro P GómezMartín, and Marco A Gómez-Martín. 2017. Case-Based Recommendation for Online Judges Using Learning Itineraries. In International Conference on Case-Based Reasoning. Springer, 315--329.",
      "doi": ""
    },
    {
      "text": "Ramesh R Sarukkai. 2000. Link prediction and path analysis using Markov chains1. Computer Networks 33, 1--6 (2000), 377--386.  ",
      "doi": "10.1016/S1389-1286%2800%2900044-X"
    },
    {
      "text": "Michail Schwab, Hendrik Strobelt, James Tompkin, Colin Fredericks, Connor Huf, Dana Higgins, Anton Strezhnev, Mayya Komisarchik, Gary King, and Hanspeter Pfster. 2017. booc. io: An Education System with Hierarchical Concept Maps. IEEE Transactions on Visualization and Computer Graphics 1 (2017), 1--1.  ",
      "doi": "10.1109/TVCG.2016.2598518"
    },
    {
      "text": "Roy J Shephard. 1968. Intensity, duration and frequency of exercise as determinants of the response to a training regime. Internationale Zeitschrift fuer Angewandte Physiologie Einschliesslich Arbeitsphysiologie 26, 3 (1968), 272--278.",
      "doi": ""
    },
    {
      "text": "Ching-Ying Sung, Xun-Yi Huang, Yicong Shen, Fu-Yin Cherng, WenChieh Lin, and Hao-Chuan Wang. 2017. Exploring Online Learners' Interactive Dynamics by Visually Analyzing Their Time-anchored Comments. In Computer Graphics Forum, Vol. 36. Wiley Online Library, 145--155.",
      "doi": ""
    },
    {
      "text": "Gang Wang, Xinyi Zhang, Shiliang Tang, Haitao Zheng, and Ben Y Zhao. 2016. Unsupervised clickstream clustering for user behavior analysis. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 225--236.  ",
      "doi": "10.1145/2858036.2858107"
    },
    {
      "text": "Shuhan Wang, Fang He, and Erik Andersen. 2017. A unifed framework for knowledge assessment and progression analysis and design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 937--948.  ",
      "doi": "10.1145/3025453.3025841"
    },
    {
      "text": "Szymon Wasik, Maciej Antczak, Artur Laskowski, Tomasz Sternal, et al. 2018. A Survey on Online Judge Systems and Their Applications. ACM Computing Surveys (CSUR) 51, 1 (2018), 3.  ",
      "doi": "10.1145/3143560"
    },
    {
      "text": "Stephan Weibelzahl. 2001. Evaluation of adaptive systems. In International Conference on User Modeling. Springer, 292--294. ",
      "doi": "10.5555/647664.760620"
    },
    {
      "text": "Krist Wongsuphasawat, Catherine Plaisant, Meirav Taieb-Maimon, and Ben Shneiderman. 2012. Querying event sequences by exact match or similarity search: Design and empirical evaluation. Interacting with computers 24, 2 (2012), 55--68.  ",
      "doi": "10.1016/j.intcom.2012.01.003"
    },
    {
      "text": "Raciel Yera Toledo, Yailé Caballero Mota, and Luis Martínez. 2018. A Recommender System for Programming Online Judges Using Fuzzy Information Modeling. In Informatics, Vol. 5. Multidisciplinary Digital Publishing Institute, 17.",
      "doi": ""
    },
    {
      "text": "Chun-Kit Yeung and Dit-Yan Yeung. 2018. Addressing two problems in deep knowledge tracing via prediction-consistent regularization. arXiv preprint arXiv:1806.02180 (2018).",
      "doi": ""
    },
    {
      "text": "Huang Yueh-Min, Huang Tien-Chi, Kun-Te Wang, and Wu-Yuin Hwang. 2009. A Markov-based recommendation model for exploring the transfer of learning on the web. Journal of Educational Technology & Society 12, 2 (2009), 144.",
      "doi": ""
    },
    {
      "text": "Jian Zhao, Chidansh Bhatt, Matthew Cooper, and David A Shamma. 2018. Flexible Learning with Semantic Visual Exploration and Sequence-Based Recommendation of MOOC Videos. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 329.  ",
      "doi": "10.1145/3173574.3173903"
    },
    {
      "text": "Jian Zhao, Christopher Collins, Fanny Chevalier, and Ravin Balakrishnan. 2013. Interactive exploration of implicit and explicit relations in faceted datasets. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2080--2089.  ",
      "doi": "10.1109/TVCG.2013.167"
    },
    {
      "text": "Haiping Zhu, Feng Tian, Ke Wu, Nazaraf Shah, Yan Chen, Yifu Ni, Xinhui Zhang, Kuo-Ming Chao, and Qinghua Zheng. 2018. A multiconstraint learning path recommendation algorithm based on knowledge map. Knowledge-Based Systems 143 (2018), 102--114.",
      "doi": ""
    }
  ]
}