{
  "doi": "10.1145/3290605.3300705",
  "title": "What Makes a Good Conversation?: Challenges in Designing Truly Conversational Agents",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Conversational agents promise conversational interaction but fail to deliver. Efforts often emulate functional rules from human speech, without considering key characteristics that conversation must encapsulate. Given its potential in supporting long-term human-agent relationships, it is paramount that HCI focuses efforts on delivering this promise. We aim to understand what people value in conversation and how this should manifest in agents. Findings from a series of semi-structured interviews show people make a clear dichotomy between social and functional roles of conversation, emphasising the long-term dynamics of bond and trust along with the importance of context and relationship stage in the types of conversations they have. People fundamentally questioned the need for bond and common ground in agent communication, shifting to more utilitarian definitions of conversational qualities. Drawing on these findings we discuss key challenges for conversational agent design, most notably the need to redefine the design parameters for conversational agent interaction.",
  "authors": [
    {
      "name": "Leigh Clark",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658644284",
      "orcid": "0000-0002-9237-1057"
    },
    {
      "name": "Nadia Pantidi",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418594586",
      "orcid": "missing"
    },
    {
      "name": "Orla Cooney",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365685",
      "orcid": "missing"
    },
    {
      "name": "Philip Doyle",
      "institution": "Voysis Ltd., Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366329",
      "orcid": "0000-0002-2686-8962"
    },
    {
      "name": "Diego Garaialde",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366500",
      "orcid": "missing"
    },
    {
      "name": "Justin Edwards",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-99659366126/rel-imgonly/headshots-3.jpg",
      "acmid": "99659366126",
      "orcid": "missing"
    },
    {
      "name": "Brendan Spillane",
      "institution": "Trinity College Dublin, Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659187323",
      "orcid": "missing"
    },
    {
      "name": "Emer Gilmartin",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459540857",
      "orcid": "missing"
    },
    {
      "name": "Christine Murad",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659302769",
      "orcid": "missing"
    },
    {
      "name": "Cosmin Munteanu",
      "institution": "University of Toronto Mississauga, Mississauga, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100559377",
      "orcid": "missing"
    },
    {
      "name": "Vincent Wade",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100412983",
      "orcid": "missing"
    },
    {
      "name": "Benjamin R. Cowan",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81453633311/rel-imgonly/photo6.jpg",
      "acmid": "81453633311",
      "orcid": "0000-0002-8595-8132"
    }
  ],
  "references": [
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Stacy M Branham. 2018. Siri Talks at You: An Empirical Investigation of Voice-Activated Personal Assistant (VAPA) Usage by Individuals Who Are Blind. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 249--258.  ",
      "doi": "10.1145/3234695.3236344"
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottrjdge. 2018. Understanding the LongTerm Use of Smart Speaker Assistants. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 91.  ",
      "doi": "10.1145/3264901"
    },
    {
      "text": "Timothy Bickmore and Justine Cassell. 2001. Relational agents: a model and implementation of building user trust. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 396--403.  ",
      "doi": "10.1145/365024.365304"
    },
    {
      "text": "Timothy Bickmore and Justine Cassell. 2005. Social dialngue with embodied conversational agents. In Advances in natural multimodal dialogue systems. Springer, 23--54.",
      "doi": ""
    },
    {
      "text": "Timothy W Bickmore, Lisa Caruso, and Kerri Clough-Gorr. 2005. Acceptance and usability of a relational agent interface by urban older adults. In CHI'05 extended abstracts on Human factors in computing systems. ACM, 1212--1215.  ",
      "doi": "10.1145/1056808.1056879"
    },
    {
      "text": "Timothy W Bickmore, Suzanne E Mitchell, Brian W Jack, Michael K Paasche-Orlow, Laura M Pfeifer, and Julie O'Donnell. 2010. Response to a relational agent by hospital patients with depressive symptoms. Interacting with computers 22, 4 (2010), 289--298.  ",
      "doi": "10.1016/j.intcom.2009.12.001"
    },
    {
      "text": "Timothy W Bickmore and Rosalind W Picard. 2004. Towards caring machines. In CHI'04 extended abstracts on Human factors in computing systems. ACM, 1489--1492.  ",
      "doi": "10.1145/985921.986097"
    },
    {
      "text": "Holly P Branigan, Martin J Pickering, Jamie Pearson, Janet F McLean, and Ash Brown. 2011. The role of beliefs in lexical alignment: Evidence from dialogs with humans and computers. Cognition 121, 1 (2011), 41--57.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal. 2003. Emotion and sociable humanoid robots. International Journal of Human-Computer Studies 59, 1 (July 2003), 119--155.  ",
      "doi": "10.1016/S1071-5819%2803%2900018-1"
    },
    {
      "text": "Gillian Brown and George Yule. 1983. Discourse Analysis. Cambridge University Press. Google-Books-ID: 9gUrbzov9x0C.",
      "doi": ""
    },
    {
      "text": "Penelope Brown and Stephen C Levinson. 1987. Politeness: Some universals in language usage. Vol. 4. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "A. Bruce, I. Nourbakhsh, and R. Simmons. 2002. The role of expressiveness and attention in human-robot interaction. In Proceedings 2002 IEEE International Conference on Robotics and Automation (Cat. No.02CH37292), Vol. 4. 4138--4142 vol.4.",
      "doi": ""
    },
    {
      "text": "BusinessWire. 2018. Global Intelligent Virtual Assistant Market 20182023:. https://www.businesswire.com/news/home/20180723005506/ en/Global-Intelligent-Virtual-Assistant-Market-2018--2023-Market",
      "doi": ""
    },
    {
      "text": "C. Cheepen. 1988. The predictability of informal conversation. Pinter. https://books.google.ie/books?id=ai23AAAAIAAJ",
      "doi": ""
    },
    {
      "text": "H.H. Clark. 1996. Using Language. Cambridge University Press. https: //books.google.ie/books?id=DiWBGOP-YnoC",
      "doi": ""
    },
    {
      "text": "Herbert H Clark. 1992. Arenas of language use. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Herbert H Clark, Susan E Brennan, et al. 1991. Grounding in communication. Perspectives on socially shared cognition 13, 1991 (1991), 127--149.",
      "doi": ""
    },
    {
      "text": "Leigh Clark. 2018. Social Boundaries of Appropriate Speech in HCI: A Politeness Perspective. In Proceedings of the 32nd British Human Computer Interaction Conference. British Computer Society.  ",
      "doi": "10.14236/ewic/HCI2018.76"
    },
    {
      "text": "Benjamin R Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. What Can I Help You With?: Infrequent Users' Experiences of Intelligent Personal Assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 43.  ",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "L. Devillers, S. Rosset, G. Dubuisson Duplessis, L. Bechade, Y. Yemez, B. B. Turker, M. Sezgin, E. Erzin, K. El Haddad, S. Dupont, P. Deleglise, Y. Esteve, C. Lailler, E. Gilmartin, and N. Campbell. 2018. Multifaceted Engagement in Social Interaction with a Machine: The JOKER Project. In 2018 13th IEEE International Conference on Automatic Face Gesture Recognition (FG 2018). 697--701.",
      "doi": "10.1109/FG.2018.00110"
    },
    {
      "text": "Hugh Dubberly and Paul Pangaro. 2009. What is conversation, and how can we design for it? interactions 16, 4 (2009), 22--28.  ",
      "doi": "10.1145/1551986.1551991"
    },
    {
      "text": "Robin Dunbar. 1998. Grooming, gossip, and the evolution of language. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Aarthi Easwara Moorthy and Kim-Phuong L Vu. 2015. Privacy concerns for use of voice activated personal assistant in the public space. International Journal of Human-Computer Interaction 31, 4 (2015), 307-- 335.",
      "doi": ""
    },
    {
      "text": "Suzanne Eggins and Diana Slade. 2005. Analysing Casual Conversation. Equinox Publishing Ltd. Google-Books-ID: cTEkm6WzfNgC.",
      "doi": ""
    },
    {
      "text": "Hao Fang, Hao Cheng, Elizabeth Clark, Ariel Holtzman, Maarten Sap, Mari Ostendorf, Yejin Choi, and Noah A Smith. 2017. Sounding Board -- University of Washington's Alexa Prize Submission. (2017), 12.",
      "doi": ""
    },
    {
      "text": "Emer Gilmartin, Marine Collery, Ketong Su, Yuyun Huang, Christy Elias, Benjamin R. Cowan, and Nick Campbell. 2017. Social Talk: Making Conversation with People and Machine. In Proceedings of the 1st ACM SIGCHI International Workshop on Investigating Social Interactions with Artifcial Agents (ISIAA 2017). ACM, New York, NY, USA, 31--32.  ",
      "doi": "10.1145/3139491.3139494"
    },
    {
      "text": "Emer Gilmartin, Benjamin R. Cowan, Carl Vogel, and Nick Campbell. 2018. Explorations in multiparty casual social talk and its relevance for social human machine dialogue. Journal on Multimodal User Interfaces (Sept. 2018).",
      "doi": ""
    },
    {
      "text": "Rachel Gockley, Allison Bruce, Jodi Forlizzi, Marek Michalowski, Anne Mundell, Stephanie Rosenthal, Brennan Sellner, Reid Simmons, Kevin Snipes, Alan C Schultz, and others. 2005. Designing robots for longterm social interaction. In Intelligent Robots and Systems, 2005.(IROS 2005). 2005 IEEE/RSJ International Conference on. IEEE, 1338--1343.",
      "doi": ""
    },
    {
      "text": "Erving Gofman. 1967. Interaction Ritual : Essays in Face-to-Face Behavior. Routledge.",
      "doi": ""
    },
    {
      "text": "Adam Jaworski. 2014. Silence and small talk. In Small talk. Routledge, 130--152.",
      "doi": ""
    },
    {
      "text": "Mardi Kidwell. 2000. Common ground in cross-cultural communication: Sequential and institutional contexts in front desk service encounters. Issues in Applied Linguistics 11, 1 (2000).",
      "doi": ""
    },
    {
      "text": "Yoshinori Kuno, Kazuhisa Sadazuka, Michie Kawashima, Keiichi Yamazaki, Akiko Yamazaki, and Hideaki Kuzuoka. 2007. Museum Guide Robot Based on Sociological Interaction Analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 1191--1194.  ",
      "doi": "10.1145/1240624.1240804"
    },
    {
      "text": "Rosemarijn Looije, Mark A. Neerincx, and Fokie Cnossen. 2010. Persuasive robotic assistant for health self-management of older adults: Design and evaluation of social behaviors. International Journal of Human-Computer Studies 68, 6 (June 2010), 386--397.  ",
      "doi": "10.1016/j.ijhcs.2009.08.007"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. Like having a really bad PA: the gulf between user expectation and experience of conversational agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Bronislaw Malinowski. 1994. The problem of meaning in primitive languages. Language and literacy in social practice: A reader (1994), 1--10.",
      "doi": ""
    },
    {
      "text": "Michael McTear, Zoraida Callejas, and David Griol. 2016. The conversational interface: Talking to smart devices. Springer. ",
      "doi": "10.5555/2965050"
    },
    {
      "text": "Rishabh Mehrotra, A Hassan Awadallah, AE Kholy, and Imed Zitouni. 2017. Hey Cortana! Exploring the use cases of a Desktop based Digital Assistant. In SIGIR 1st International Workshop on Conversational Approaches to Information Retrieval (CAIR'17), Vol. 4.",
      "doi": ""
    },
    {
      "text": "Roger K. Moore. 2017. Is Spoken Language All-or-Nothing? Implications for Future Speech-Based Human-Machine Interaction. In Dialogues with Social Robots: Enablements, Analyses, and Evaluation, Kristiina Jokinen and Graham Wilcock (Eds.). Springer Singapore, Singapore, 281--291.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Pourang Irani, Sharon Oviatt, Matthew Aylett, Gerald Penn, Shimei Pan, Nikhil Sharma, Frank Rudzicz, Randy Gomez, Ben Cowan, et al. 2017. Designing Speech, Acoustic and Multimodal Interactions. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 601--608.  ",
      "doi": "10.1145/3027063.3027086"
    },
    {
      "text": "Ioannis Papaioannou, Amanda Cercas Curry, Jose L Part, Igor Shalyminov, Xinnuo Xu, Yanchao Yu, Ondrej Duek, Verena Rieser, and Oliver Lemon. 2017. Alana: Social dialogue using an ensemble model and a ranker trained on user feedback. Alexa Prize Proceedings (2017).",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 640.  ",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Amanda Purington, Jessie G Taft, Shruti Sannon, Natalya N Bazarova, and Samuel Hardman Taylor. 2017. Alexa is my new BFF: social roles, user satisfaction, and personifcation of the amazon echo. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 2853--2859.  ",
      "doi": "10.1145/3027063.3053246"
    },
    {
      "text": "Stuart Reeves. 2012. Envisioning Ubiquitous Computing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1573--1582.  ",
      "doi": "10.1145/2207676.2208278"
    },
    {
      "text": "Stuart Reeves. 2017. Some conversational challenges of talking with machines.. In In: Talking with Conversational Agents in Collaborative Action Workshop.",
      "doi": ""
    },
    {
      "text": "Tom A. Rodden, Joel E. Fischer, Nadia Pantidi, Khaled Bachour, and Stuart Moran. 2013. At home with agents: exploring attitudes towards future smart energy infrastructures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13. ACM Press, Paris, France, 1173.  ",
      "doi": "10.1145/2470654.2466152"
    },
    {
      "text": "A. M. Sabelli, T. Kanda, and N. Hagita. 2011. A conversational robot in an elderly care center: An ethnographic study. In 2011 6th ACM/IEEE International Conference on Human-Robot Interaction (HRI). 37--44.  ",
      "doi": "10.1145/1957656.1957669"
    },
    {
      "text": "Harvey Sacks. 1987. On the preferences for agreement and contiguity in sequences in conversation. Talk and social organisation (1987), 54--69.",
      "doi": ""
    },
    {
      "text": "Harvey Sacks, Emanuel A Scheglof, and Gail Jeferson. 1978. A simplest systematics for the organization of turn taking for conversation. In Studies in the organization of conversational interaction. Elsevier, 7--55.",
      "doi": ""
    },
    {
      "text": "Martin Saerbeck, Tom Schut, Christoph Bartneck, and Maddy D Janse. 2010. Expressive robots in education: varying the degree of social supportive behavior of a robotic tutor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1613--1622.  ",
      "doi": "10.1145/1753326.1753567"
    },
    {
      "text": "Klaus P. Schneider. 1988. Small talk: Analyzing phatic discourse. Vol. 1. Hitzeroth.",
      "doi": ""
    },
    {
      "text": "Brendan Spillane, Emer Gilmartin, Christian Saam, Ketong Su, Benjamin R Cowan, Séamus Lawless, and Vincent Wade. 2017. Introducing ADELE: a personalized intelligent companion. In Proceedings of the 1st ACM SIGCHI International Workshop on Investigating Social Interactions with Artifcial Agents. ACM, 43--44.  ",
      "doi": "10.1145/3139491.3139492"
    },
    {
      "text": "Adriana Tapus, Maja J Mataric, and Brian Scassellati. 2007. Socially assistive robotics {grand challenges of robotics}. IEEE Robotics & Automation Magazine 14, 1 (2007), 35--42.",
      "doi": ""
    },
    {
      "text": "Janice Y. Tsai, Tawfq Ammaria, Abraham Wallin, and Jofsh Kaye. 2018. Alexa, play some music: Categorization of Alexa Commands. In Workshop on Voice-based Conversational UX Studies and Design (CHI'18).",
      "doi": ""
    },
    {
      "text": "Laura Pfeifer Vardoulakis, Lazlo Ring, Barbara Barry, Candace L Sidner, and Timothy Bickmore. 2012. Designing relational agents as long term social companions for older adults. In International Conference on Intelligent Virtual Agents. Springer, 289--302.  ",
      "doi": "10.1007/978-3-642-33197-8_30"
    },
    {
      "text": "Svetlana Yarosh, Stryker Thompson, Kathleen Watson, Alice Chase, Ashwin Senthilkumar, Ye Yuan, and AJ Brush. 2018. Children asking questions: speech interface reformulations and personifcation preferences. In Proceedings of the 17th ACM Conference on Interaction Design and Children. ACM, 300--312.  ",
      "doi": "10.1145/3202185.3202207"
    },
    {
      "text": "Avner Ziv. 2010. The Social Function of Humor in Interpersonal Relationships. Society 47, 1 (Jan. 2010), 11--18.",
      "doi": ""
    }
  ]
}