{
  "doi": "10.1145/3290605.3300419",
  "title": "Investigating the Effect of Orientation and Visual Style on Touchscreen Slider Performance",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2019,
  "badges": [],
  "abstract": "Sliders are one of the most fundamental components used in touchscreen user interfaces (UIs). When entering data using a slider, errors occur due e.g. to visual perception, resulting in inputs not matching what is intended by the user. However, it is unclear if the errors occur uniformly across the full range of the slider or if there are systematic offsets. We conducted a study to assess the errors occurring when entering values with horizontal and vertical sliders as well as two common visual styles. Our results reveal significant effects of slider orientation and style on the precision of the entered values. Furthermore, we identify systematic offsets that depend on the visual style and the target value. As the errors are partially systematic, they can be compensated to improve users' precision. Our findings provide UI designers with data to optimize user experiences in the wide variety of application areas where slider based touchscreen input is used.",
  "authors": [
    {
      "name": "Ashley Colley",
      "institution": "University of Lapland, Rovaniemi, Finland",
      "img": "/do/10.1145/contrib-81324488657/rel-imgonly/ashley_thumbnail.jpg",
      "acmid": "81324488657",
      "orcid": "missing"
    },
    {
      "name": "Sven Mayer",
      "institution": "University of Stuttgart, Stuttgart, Germany",
      "img": "/do/10.1145/contrib-99658696530/rel-imgonly/p_mayersven.jpg",
      "acmid": "99658696530",
      "orcid": "0000-0001-5462-8782"
    },
    {
      "name": "Niels Henze",
      "institution": "University of Regensburg, Regensburg, Germany",
      "img": "/do/10.1145/contrib-81350574049/rel-imgonly/nielshenze.jpg",
      "acmid": "81350574049",
      "orcid": "0000-0002-5702-6290"
    }
  ],
  "references": [
    {
      "text": "Christopher Ahlberg, Christopher Williamson, and Ben Shneiderman. 1992. Dynamic Queries for Information Exploration: An Implementation and Evaluation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '92). ACM, New York, NY, USA, 619--626.  ",
      "doi": "10.1145/142750.143054"
    },
    {
      "text": "Alberto Betella and Paul F. M. J. Verschure. 2016. The Affective Slider: A Digital Self-Assessment Scale for the Measurement of Human Emotions. 11, 2 (2016).",
      "doi": ""
    },
    {
      "text": "Gunnar Borg and Elisabet Borg. 1991. A general psychophysical scale of blackness and its possibilities as a test of rating behaviour. Department of Psychology, University of Stockholm.",
      "doi": ""
    },
    {
      "text": "Andrew Bragdon, Eugene Nelson, Yang Li, and Ken Hinckley. 2011. Experimental Analysis of Touch-screen Gesture Designs in Mobile Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 403--412.  ",
      "doi": "10.1145/1978942.1979000"
    },
    {
      "text": "Sylvie Chokron, Seta Kazandjian, and Maria De Agostini. 2009. Effects of reading direction on visuospatial organization: a critical review. (2009).",
      "doi": ""
    },
    {
      "text": "Ashley Colley, Lasse Virtanen, Timo Ojala, and Jonna Häkkilä. 2016. Guided Touch Screen: Enhanced Eyes-free Interaction. In Proceedings of the 5th ACM International Symposium on Pervasive Displays (PerDis '16). ACM, New York, NY, USA, 80--86.  ",
      "doi": "10.1145/2914920.2915008"
    },
    {
      "text": "Audrey G Gift. 1989. Visual analogue scales: measurement of subjective phenomena. Nursing research (1989).",
      "doi": ""
    },
    {
      "text": "Miriam Greis, Hendrik Schuff, Marius Kleiner, Niels Henze, and Albrecht Schmidt. 2017. Input Controls for Entering Uncertain Data: Probability Distribution Sliders. Proc. ACM Hum.-Comput. Interact. 1, EICS, Article 3 (June 2017), 17 pages.  ",
      "doi": "10.1145/3095805"
    },
    {
      "text": "Niels Henze, Enrico Rukzio, and Susanne Boll. 2011. 100,000,000 Taps: Analysis and Improvement of Touch Performance in the Large. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 133--142.  ",
      "doi": "10.1145/2037373.2037395"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2010. The Generalized Perceived Input Point Model and How to Double Touch Accuracy by Extracting Fingerprints. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 581--590.  ",
      "doi": "10.1145/1753326.1753413"
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2011. Understanding Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2501--2510.  ",
      "doi": "10.1145/1978942.1979308"
    },
    {
      "text": "Lars Lischke, Pawel W. Wojniak, Sven Mayer, Andreas Preikschat, and Morten Fjeld. 2017. Using Variable Movement Resistance Sliders for Remote Discrete Input. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY, USA, 116--125.  ",
      "doi": "10.1145/3132272.3134135"
    },
    {
      "text": "Justin Matejka, Michael Glueck, Tovi Grossman, and George Fitzmaurice. 2016. The Effect of Visual Appearance on the Performance of Continuous Sliders and Visual Analogue Scales. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5421--5432.  ",
      "doi": "10.1145/2858036.2858063"
    },
    {
      "text": "Sven Mayer, Perihan Gad, Katrin Wolf, Pawel W. Wojniak, and Niels Henze. 2017. Understanding the Ergonomic Constraints in Designing for Touch Surfaces. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, Article 33, 9 pages.  ",
      "doi": "10.1145/3098279.3098537"
    },
    {
      "text": "Sven Mayer, Huy Viet Le, and Niels Henze. 2018. Designing Finger Orientation Input for Mobile Touchscreens. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '18). ACM, New York, NY, USA, Article 29, 9 pages.  ",
      "doi": "10.1145/3229434.3229444"
    },
    {
      "text": "Pekka Parhi, Amy K. Karlson, and Benjamin B. Bederson. 2006. Target Size Study for One-handed Thumb Use on Small Touchscreen Devices. In Proceedings of the 8th Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '06). ACM, New York, NY, USA, 203--210.  ",
      "doi": "10.1145/1152215.1152260"
    },
    {
      "text": "Agnès Paul-Dauphin, Francis Guillemin, Jean-Marc Virion, and Serge Briançon. 1999. Bias and precision in visual analogue scales: a randomized controlled trial. American journal of epidemiology 150, 10 (1999), 1117--1127.",
      "doi": ""
    },
    {
      "text": "Juan Rosso, Céline Coutrix, Matt Jones, and Laurence Nigay. 2018. Simulating an Extendable Tangible Slider for Eyes-free One-handed Interaction on Mobile Devices. In Proceedings of the 2018 International Conference on Advanced Visual Interfaces (AVI '18). ACM, New York, NY, USA, Article 16, 9 pages.  ",
      "doi": "10.1145/3206505.3206510"
    },
    {
      "text": "Jane Scott and EC Huskisson. 1979. Vertical or horizontal visual analogue scales. Annals of the rheumatic diseases 38, 6 (1979), 560.",
      "doi": ""
    },
    {
      "text": "Nancy L Stephenson and JoAnne Herman. 2000. Pain measurement: a comparison using horizontal and vertical visual analogue scales. Applied Nursing Research 13, 3 (2000), 157--158.",
      "doi": ""
    },
    {
      "text": "Da Tao, Juan Yuan, Shuang Liu, and Xingda Qu. 2018. Effects of button design characteristics on performance and perceptions of touchscreen use. International Journal of Industrial Ergonomics 64 (2018), 59--68.",
      "doi": ""
    },
    {
      "text": "Melanie Tory and Robert Kincaid. 2013. Comparing Physical, Overlay, and Touch Screen Parameter Controls. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, New York, NY, USA, 91--100.  ",
      "doi": "10.1145/2512349.2512812"
    },
    {
      "text": "Paul van Schaik and Jonathan Ling. 2003. Using On-line Surveys to Measure Three Key Constructs of the Quality of Human-computer Interaction in Web Sites: Psychometric Properties and Implications. Int. J. Hum.-Comput. Stud. 59, 5 (Nov. 2003), 545--567.  ",
      "doi": "10.1016/S1071-5819%2803%2900078-8"
    },
    {
      "text": "Sudip Vhaduri and Christian Poellabauer. 2017. Design Factors of Longitudinal Smartphone-based Health Surveys. Journal of Healthcare Informatics Research 1, 1 (2017), 52--91.",
      "doi": ""
    },
    {
      "text": "Hui Xu, Yangfan Zhou, and Michael R Lyu. 2014. Towards continuous and passive authentication via touch biometrics: An experimental study on smartphones. In Symposium On Usable Privacy and Security, SOUPS, Vol. 14. 187--198. ",
      "doi": "10.5555/3235838.3235855"
    }
  ]
}