{
  "doi": "10.1145/3290605.3300314",
  "title": "Understanding the Boundaries between Policymaking and HCI",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "There is a growing body of literature in HCI examining the intersection between policymaking and technology research. However, what it means to engage in policymaking in our field, or the ways in which evidence from HCI studies is translated into policy, is not well understood. We report on interviews with 11 participants working at the intersection of technology research and policymaking. Analysis of this data highlights how evidence is understood and made sense of in policymaking processes, what forms of evidence are privileged over others, and the work that researchers engage in to meaningfully communicate their work to policymaking audiences. We discuss how our findings pose challenges for certain traditions of research in HCI, yet also open up new policy opportunities for those engaging in more speculative research practices. We conclude by discussing three ways forward that the HCI community can explore to increase engagement with policymaking contexts.",
  "authors": [
    {
      "name": "Anne Spaa",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659351915",
      "orcid": "missing"
    },
    {
      "name": "Abigail Durrant",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488179",
      "orcid": "0000-0003-4752-5376"
    },
    {
      "name": "Chris Elsden",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-89758813157/rel-imgonly/headshotcrop.jpg",
      "acmid": "89758813157",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    }
  ],
  "references": [
    {
      "text": "C&T 2019. 2019. Communities & Technologies. Retrieved 2019-01-07 from https://2019.comtech.community/about.html",
      "doi": ""
    },
    {
      "text": "REF 2021. 2018. Research Excellence Framework. Retrieved 2018-09--19 from http://www.ref.ac.uk/",
      "doi": ""
    },
    {
      "text": "ACM. 2018. CSCW 2018 | 21st ACM Conference on ComputerSupported Cooperative Work and Social Computing. Retrieved 2018-09--19 from https://cscw.acm.org/2018/",
      "doi": ""
    },
    {
      "text": "ACM SIGCHI. 2016. CHI 2016 SIGCHI Social Impact Award: Jonathan Lazar. Retrieved 2018-09--19 from https://www.youtube.com/ watch?v=8d7le58KMk",
      "doi": ""
    },
    {
      "text": "Morgan G. Ames. 2015. Charismatic Technology. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (AA '15). Aarhus University Press, Aarhus, Denmark, 109--120.  ",
      "doi": "10.7146/aahcc.v1i1.21199"
    },
    {
      "text": "Maria Bada, Angela Sasse, and Jason R. C. Nurse. 2015. Cyber Security Awareness Campaigns: Why do they fail to change behaviour?. In International Conference on Cyber Security for Sustainable Society. 118-- 131.",
      "doi": ""
    },
    {
      "text": "Andrea Baertl. 2018. De-constructing credibility: Factors that affect a think tank's credibility. Technical Report 4. On Think Tanks.",
      "doi": ""
    },
    {
      "text": "Gary Banks AO. 2018. Challenges of evidence-based policymaking. Retrieved 2018-09--19 from https://www.apsc.gov.au/ challenges-evidence-based-policy-making",
      "doi": ""
    },
    {
      "text": "Liam J. Bannon. 1995. From Human Factors to Human Actors: The Role of Psychology and Human-Computer Interaction Studies in System Design. In Readings in Human-Computer Interaction, Ronald M. Baecker, Jonatha Grudin, William A. S. Buxton, and Saul Greenberg (Eds.). Morgan Kaufmann, 205--214. ",
      "doi": "10.5555/212925.212945"
    },
    {
      "text": "Ulrike Bechtold, Daniela Fuchs, and Niklas Gudowsky. 2017. Imagining socio-technical futures -- challenges and opportunities for technology assessment. Journal of Responsible Innovation 4, 2 (May 2017), 85--99.",
      "doi": ""
    },
    {
      "text": "Benjamin B. Bederson, Jonathan Lazar, Jeff Johnson, Harry Hochheiser, and Clare-Marie Karat. 2006. Workshop on SIGCHI Public Policy. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, New York, NY, USA, 1655--1657.  ",
      "doi": "10.1145/1125451.1125755"
    },
    {
      "text": "Alan F. Blackwell. 2015. HCI As an Inter-Discipline. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 503--516.  ",
      "doi": "10.1145/2702613"
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-Solutionist Strategies: Seriously Silly Design Fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4968--4978.  ",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Annette Boaz, Cynthia Coburn, David Gough, Larry Palinkas, Jordi Molas-Gallart, Julia Mortimer, Sarah Morton, Kathryn Oliver, Liz Farley-Ripple, Jack Spaapen, and Vivian Tseng. 2016. The future of Evidence & Policy: moving forward from Valencia. Evidence & Policy: A Journal of Research, Debate and Practice 12, 1 (Jan. 2016), 3--8.",
      "doi": ""
    },
    {
      "text": "John Bowers. 2012. The Logic of Annotated Portfolios: Communicating the Value of 'Research Through Design'. In Proceedings of the Designing Interactive Systems Conference (DIS '12). ACM, New York, NY, USA, 68--77.  ",
      "doi": "10.1145/2317956.2317968"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Susanne Bodker, and Kristina Höök. 2017. Does HCI Scale?: Scale Hacking and the Relevance of HCI. interactions 24, 5 (Aug. 2017), 28--33.  ",
      "doi": "10.1145/3125387"
    },
    {
      "text": "Antony Bryant and Kathy Charmaz. 2007. The SAGE Handbook of Grounded Theory. SAGE Publications Inc., London.",
      "doi": ""
    },
    {
      "text": "Paul Cairney. 2016. The Politics of Evidence-Based Policy Making. Palgrave Macmillan UK.",
      "doi": ""
    },
    {
      "text": "Paul Cairney and Kathryn Oliver. 2017. Evidence-based policymaking is not like evidence-based medicine, so how far should you go to bridge the divide between evidence and policy? Health Research Policy and Systems 15 (April 2017).",
      "doi": ""
    },
    {
      "text": "Paul Cairney, Kathryn Oliver, and Adam Wellstead. 2016. To Bridge the Divide between Evidence and Policy: Reduce Ambiguity as Much as Uncertainty. Public Administration Review 76, 3 (May 2016), 399--402.",
      "doi": ""
    },
    {
      "text": "Sarah Chaytor. 2017. Bridging the gap between researchers and policymakers - Palgrave Communications. Retrieved 2018-09--19 from https://youtu.be/kEqlufCbVUs",
      "doi": ""
    },
    {
      "text": "Lorrie Cranor. 2016. Lorrie Faith Cranor. Retrieved 2018-09--17 from https://www.ftc.gov/about-ftc/biographies/lorrie-faith-cranor",
      "doi": ""
    },
    {
      "text": "Janet Davis, Harry Hochheiser, Juan Pablo Hourcade, Jeff Johnson, Lisa Nathan, and Janice Tsai. 2012. Occupy CHI!: Engaging U.S. Policymakers. In CHI '12 Extended Abstracts on Human Factors in Computing Systems (CHI EA '12). ACM, New York, NY, USA, 1139--1142.  ",
      "doi": "10.1145/2212776.2212406"
    },
    {
      "text": "Andrew Denham and Mark Garnett. 1998. British Think-Tanks And The Climate Of Opinion. (Aug. 1998).",
      "doi": ""
    },
    {
      "text": "Peter Dorey. 2014. Policy Making in Britain (2nd edition ed.). SAGE Publications Inc., London.",
      "doi": ""
    },
    {
      "text": "Andy Dow, Rob Comber, and John Vines. 2018. Between Grassroots and the Hierarchy: Lessons Learned from the Design of a Public Services Directory. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 442:1-- 442:13.  ",
      "doi": "10.1145/3173574.3174016"
    },
    {
      "text": "Abigail C. Durrant, John Vines, Jayne Wallace, and Joyce Yee. 2015. Developing a Dialogical Platform for Disseminating Research through Design. Constructivist Foundations 11, 1 (2015), 8--21. https:// www.univie.ac.at/constructivism/journal/11/1/008.durrant",
      "doi": ""
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C. Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S. Kirk. 2017. On Speculative Enactments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5386--5399.  ",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "ESRC. 2019. Influencing UK public policy - Economic and Social Research Council. Retrieved 2018-09--19 from https: //esrc.ukri.org/research/impact-toolkit/influencing-policymakers/ guide-to-influencing-public-affairs/influencing-uk-public-policy/",
      "doi": ""
    },
    {
      "text": "Daniel Fallman. 2011. The New Good: Exploring the Potential of Philosophy of Technology to Contribute to Human-computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1051--1060.  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "Jodi Forlizzi, John Zimmerman, Paul Hekkert, and Ilpo Koskinen. 2018. Let's Get Divorced: Constructing Knowledge Outcomes for Critical Design and Constructive Design Research. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (DIS '18 Companion). ACM, New York, NY, USA, 395--397.  ",
      "doi": "10.1145/3197391.3197395"
    },
    {
      "text": "Verena Fuchsberger, Martin Murer, Alina Krischkowsky, and Manfred Tscheligi. 2016. Interaction Design Labels: Concepts, Inscriptions, and Concealed Intentions. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16). ACM, New York, NY, USA, 108--120.  ",
      "doi": "10.1145/2901790.2901846"
    },
    {
      "text": "Bill Gaver and John Bowers. 2012. Annotated Portfolios. interactions 19, 4 (July 2012), 40--49.  ",
      "doi": "10.1145/2212877.2212889"
    },
    {
      "text": "HM Government. 2017. Industrial Strategy - Building a Britain fit for the future. Technical Report. London. Retrieved 2018--21-09 from https://assets.publishing.service.gov.uk/government/uploads/ system/uploads/attachmentdata/file/664563/industrial-strategywhite-paper-web-ready-version.pdf",
      "doi": ""
    },
    {
      "text": "GOV.UK. 2018. Civil Service Policy Profession. Retrieved 2018-09--19 from https://www.gov.uk/government/organisations/civil-servicepolicy-profession/about",
      "doi": ""
    },
    {
      "text": "GOV.UK. 2018. Policy Profession Standards - a framework for professional development. Crown. Retrieved 2018-09--21 from https://assets.publishing.service.gov.uk/ government/uploads/system/uploads/attachmentdata/file/692329/ PolicyProfessionStandardsJan18.pdf",
      "doi": ""
    },
    {
      "text": "GOV.UK. 2019. HM Treasury. Retrieved 2018-09--21 from https: //www.gov.uk/government/organisations/hm-treasury",
      "doi": ""
    },
    {
      "text": "Richard Harper, Tom Rodden, Yvonne Rogers, and Abigail Sellen. 2008. Being Human: Human-Computer Interaction in the year 2020. Microsoft Research Ltd, Cambridge.",
      "doi": ""
    },
    {
      "text": "Sabrina Hauser, Ron Wakkary, William Odom, Peter-Paul Verbeek, Audrey Desjardins, Henry Lin, Matthew Dalton, Markus Schilling, and Gijs de Boer. 2018. Deployments of the Table-non-table: A Reflection on the Relation Between Theory and Things in the Practice of Design Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 201:1--201:13.  ",
      "doi": "10.1145/3173574.3173775"
    },
    {
      "text": "Brian W. Head. 2010. Reconsidering evidence-based policy: Key issues and challenges. Policy and Society 29, 2 (May 2010), 77--94.",
      "doi": ""
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong Concepts: Intermediate-level Knowledge in Interaction Design Research. ACM Trans. Comput.-Hum. Interact. 19, 3 (Oct. 2012), 23:1--23:18.  ",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Olya Kudina and Peter-Paul Verbeek. 2018. Ethics from Within: Google Glass, the Collingridge Dilemma, and the Mediated Value of Privacy. Science, Technology, & Human Values (Aug. 2018).",
      "doi": ""
    },
    {
      "text": "EU Policy Lab. 2018. #Blockchain4EU: Blockchain for Industrial Transformations. Retrieved 2019-01-03 from https://blogs.ec.europa.eu/ eupolicylab/blockchain4eu/",
      "doi": ""
    },
    {
      "text": "EU Policy Lab. 2018. Prototype_Gigbliss #Blockchain4EU. https: //blogs.ec.europa.eu/eupolicylab/blockchain4eu/gigbliss/",
      "doi": ""
    },
    {
      "text": "Shaun Lawson, Ben Kirman, Conor Linehan, Tom Feltwell, and Lisa Hopkins. 2015. Problematising Upstream Technology Through Speculative Design: The Case of Quantified Cats and Dogs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2663--2672.  ",
      "doi": "10.1145/2702123.2702260"
    },
    {
      "text": "Jonathan Lazar. 2010. Interacting with Public Policy. interactions 17, 1 (Jan. 2010), 40--43.  ",
      "doi": "10.1145/1649475.1649485"
    },
    {
      "text": "Jonathan Lazar. 2015. Public Policy and HCI: Making an Impact in the Future. interactions 22, 5 (Aug. 2015), 69--71.  ",
      "doi": "10.1145/2807916"
    },
    {
      "text": "Jonathan Lazar. 2017. Let's Strengthen the HCI Community by Taking a Gap Year! Interactions 25, 1 (Dec. 2017), 20--21.  ",
      "doi": "10.1145/3155054"
    },
    {
      "text": "Jonathan Lazar, Julio Abascal, Simone Barbosa, Jeremy Barksdale, Batya Friedman, Jens Grossklags, Jan Gulliksen, Jeff Johnson, Tom McEwan, Loïc Martinez-Normand, Wibke Michalk, Janice Tsai, Gerrit van der Veer, Hans von Axelson, Ake Walldius, Gill Whitney, Marco Winckler, Volker Wulf, Elizabeth F. Churchill, Lorrie Cranor, Janet Davis, Alan Hedge, Harry Hochheiser, Juan Pablo Hourcade, Clayton Lewis, Lisa Nathan, Fabio Paterno, Blake Reid, Whitney Quesenbery, Ted Selker, and Brian Wentz. 2016. Human-Computer Interaction and International Public Policymaking: A Framework for Understanding and Taking Future Actions. Foundations and Trends in Human-Computer Interaction 9, 2 (May 2016), 69--149.  ",
      "doi": "10.1561/1100000062"
    },
    {
      "text": "Joseph Lindley, Paul Coulton, and Miriam Sturdee. 2017. Implications for Adoption. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 265--277.  ",
      "doi": "10.1145/3025453.3025742"
    },
    {
      "text": "Dan Lockton. 2018. Dan Lockton. Retrieved 2018-09--17 from http: //danlockton.com/about/",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2007. Technology as Experience. MIT Press, Cambridge. https://mitpress.mit.edu/books/technologyexperience ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Enrique Mendizabal. 2013. An alternative to the supply, demand and intermediary model: competencies for all. Retrieved 2019-01-03 from https://onthinktanks.org/articles/an-alternative-to-the-supplydemand-and-intermediary-model-competencies-for-all/",
      "doi": ""
    },
    {
      "text": "Lisa P. Nathan and Batya Friedman. 2010. Interacting with Policy in a Political World: Reflections from the Voices from the Rwanda Tribunal Project. Interactions 17, 5 (Sept. 2010), 56--59.  ",
      "doi": "10.1145/1836216.1836231"
    },
    {
      "text": "Kathryn Oliver, Simon Innvaer, Theo Lorenc, Jenny Woodman, and James Thomas. 2014. A systematic review of barriers to and facilitators of the use of evidence by policymakers. BMC Health Services Research 14 (Jan. 2014).",
      "doi": ""
    },
    {
      "text": "Kathryn Oliver, Theo Lorenc, and Simon Innvaer. 2014. New directions in evidence-based policy research: a critical analysis of the literature. Health Research Policy and Systems 12 (July 2014).",
      "doi": ""
    },
    {
      "text": "Judith S. Olson and Wendy A. Kellogg (Eds.). 2014. Ways of Knowing in HCI. Springer-Verlag, New York. https://www.springer.com/us/ book/9781493903771 ",
      "doi": "10.5555/2631405"
    },
    {
      "text": "Antti Oulasvirta and Kasper Hornbaek. 2016. HCI Research As Problem-Solving. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4956--4967.  ",
      "doi": "10.1145/2858036.2858283"
    },
    {
      "text": "James Pierce, Sarah Fox, Nick Merrill, Richmond Wong, and Carl DiSalvo. 2018. An Interface Without A User: An Exploratory Design Study of Online Privacy Policies and Digital Legalese. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 1345--1358.  ",
      "doi": "10.1145/3196709.3196818"
    },
    {
      "text": "Sebastian Prost, Johann Schrammel, and Manfred Tscheligi. 2014. 'Sometimes It's the Weather's Fault': Sustainable HCI & Political Activism. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 2005--2010.  ",
      "doi": "10.1145/2559206.2581358"
    },
    {
      "text": "Stuart Reeves. 2015. Human-computer Interaction As Science. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (CA '15). Aarhus University Press, Aarhus, Denmark, 73--84.  ",
      "doi": "10.7146/aahcc.v1i1.21296"
    },
    {
      "text": "Holger Rhinow, Eva Köppen, and Christoph Meinel. 2012. Prototypes as Boundary Objects in Innovation Processes.. In Conference Paper in the Proceedings of the 2012 International Conference on Design Research Society. Bangkok, Thailand.",
      "doi": ""
    },
    {
      "text": "Sunil Rodger, John Vines, and Janice McLaughlin. 2016. Technology and the Politics of Mobility: Evidence Generation in Accessible Transport Activism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2426.  ",
      "doi": "10.1145/2858036.2858146"
    },
    {
      "text": "Abigail Sellen, Yvonne Rogers, Richard Harper, and Tom Rodden. 2009. Reflecting Human Values in the Digital Age. Commun. ACM 52, 3 (March 2009), 58--66.  ",
      "doi": "10.1145/1467247.1467265"
    },
    {
      "text": "The British Computer Society. 2018. BCS Policy Hub - The Chartered Institute for IT. Retrieved 2019-01-03 from https://policy.bcs.org/",
      "doi": ""
    },
    {
      "text": "Amin Sorkhei, Kalle Ilves, and Dorota Glowacka. 2017. Exploring Scientific Literature Search Through Topic Models. In Proceedings of the 2017 ACM Workshop on Exploratory Search and Interactive Data Analytics (ESIDA '17). ACM, New York, NY, USA, 65--68.  ",
      "doi": "10.1145/3038462.3038464"
    },
    {
      "text": "Alex Stevens. 2011. Telling policy stories: An ethnographic study of the use of evidence in policy-making in the UK. Journal of Social Policy 40 (April 2011), 237--256.",
      "doi": ""
    },
    {
      "text": "Sophie Sutcliffe and Julius Court. 2015. Evidence-Based Policymaking: What is it? How does it work? What relevance for developing countries? (2015). Retrieved 2019-01-07 from https://www.odi.org/sites/ odi.org.uk/files/odi-assets/publications-opinion-files/3683.pdf",
      "doi": ""
    },
    {
      "text": "Vanessa Thomas. 2016. International Policy Ideas Challenge Finalist - Research Portal | Lancaster University. Retrieved 2018-09--17 from http://www.research.lancs.ac.uk/portal/en/prizes/ international-policy-ideas-challenge-finalist(d2a728b6--221f-444e92a0--11795d7dcb8d).html",
      "doi": ""
    },
    {
      "text": "Vanessa Thomas, Christian Remy, Mike Hazas, and Oliver Bates. 2017. HCI and Environmental Public Policy: Opportunities for Engagement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6989.  ",
      "doi": "10.1145/3025453.3025579"
    },
    {
      "text": "HM Treasury. 2018. The Green Book. HM Treasury, London.",
      "doi": ""
    },
    {
      "text": "UCL. 2018. Evaluating Cyber Security Evidence for Policy Advice. Retrieved 2019-01-03 from https://www.ucl.ac.uk/steapp/research/ projects/ecsepa",
      "doi": ""
    },
    {
      "text": "Newcastle University. 2019. Digital Civics | Digital Civics at Open Lab. Retrieved 2018-09--17 from https://digitalcivics.io/",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2006. Materializing Morality: Design Ethics and Technological Mediation. Science, Technology, & Human Values 31, 3 (May 2006), 361--380.",
      "doi": ""
    },
    {
      "text": "John Vines, Mark Blythe, Stephen Lindsay, Paul Dunphy, Andrew Monk, and Patrick Olivier. 2012. Questionable Concepts: Critique As Resource for Designing with Eighty Somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 1169--1178.  ",
      "doi": "10.1145/2207676.2208567"
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring Participation: On How We Involve People in Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 429--438.  ",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Ron Wakkary, Doenja Oogjes, Henry W. J. Lin, and Sabrina Hauser. 2018. Philosophers Living with the Tilting Bowl. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 94:1--94:12.  ",
      "doi": "10.1145/3173574.3173668"
    },
    {
      "text": "Ding Wang. 2016. HCI, Policy and the Smart City. In Proceedings of the 30th International BCS Human Computer Interaction Conference (HCI 2016).  ",
      "doi": "10.14236/ewic/HCI2016.35"
    },
    {
      "text": "Peter Wells. 2007. New Labour and evidence based policy making: 1997--2007 | People Place and Policy., 23 pages. Retrieved 2018-07--24 from https://extra.shu.ac.uk/ppp-online/new-labour-and-evidencebased-policy-making-1997--2007/",
      "doi": ""
    },
    {
      "text": "Robin Williams and David Edge. 1996. The social shaping of technology. Research Policy 25, 6 (Sept. 1996), 865--899.",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong and Vera Khovanskaya. 2018. Speculative Design in HCI: From Corporate Imaginations to Critical Orientations. In New Directions in Third Wave Human-Computer Interaction: Volume 2 - Methodologies, Michael Filimowicz and Veronika Tzankova (Eds.). Springer International Publishing, Cham, 175.",
      "doi": ""
    },
    {
      "text": "Peter Wright, Mark Blythe, and John McCarthy. 2006. User Experience and the Idea of Design in HCI. In Interactive Systems. Design, Specification, and Verification (Lecture Notes in Computer Science), Stephen W. Gilroy and Michael D. Harrison (Eds.). Springer Berlin Heidelberg, 1--14.  ",
      "doi": "10.1007/11752707_1"
    },
    {
      "text": "Shaun P. Young. 2013. Evidence-Based Policy-Making in Canada. Oxford University Press Canada, Ontario. Retrieved 201809--19 from http://www.sfu.ca/~howlett/documents/Howlett%20&% 20Craft%20Young%2013.pdf",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An Analysis and Critique of Research Through Design: Towards a Formalization of a Research Approach. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10). ACM, New York, NY, USA, 310--319.  ",
      "doi": "10.1145/1858171.1858228"
    }
  ]
}