{
  "doi": "10.1145/3290605.3300479",
  "title": "Enhancing Texture Perception in Virtual Reality Using 3D-Printed Hair Structures",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Experiencing materials in virtual reality (VR) is enhanced by combining visual and haptic feedback. While VR easily allows changes to visual appearances, modifying haptic impressions remains challenging. Existing passive haptic techniques require access to a large set of tangible proxies. To reduce the number of physical representations, we look towards fabrication to create more versatile counterparts. In a user study, 3D-printed hairs with length varying in steps of 2.5 mm were used to influence the feeling of roughness and hardness. By overlaying fabricated hair with visual textures, the resolution of the user's haptic perception increased. As changing haptic sensations are able to elicit perceptual switches, our approach can extend a limited set of textures to a much broader set of material impressions. Our results give insights into the effectiveness of 3D-printed hair for enhancing texture perception in VR.",
  "authors": [
    {
      "name": "Donald Degraen",
      "institution": "Intel Visual Computing Institute (IVCI), Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658989098",
      "orcid": "missing"
    },
    {
      "name": "André Zenner",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/do/10.1145/contrib-87958809157/rel-imgonly/bild-andre-zenner-klein.jpg",
      "acmid": "87958809157",
      "orcid": "0000-0003-3386-1635"
    },
    {
      "name": "Antonio Krüger",
      "institution": "German Research Center for Artificial Intelligence (DFKI), Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    }
  ],
  "references": [
    {
      "text": "Bruno Araujo, Ricardo Jota, Varun Perumal, Jia Xian Yao, Karan Singh, and Daniel Wigdor. 2016. Snake Charmer: Physically Enabling Virtual Objects. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 218--226.  ",
      "doi": "10.1145/2839462.2839484"
    },
    {
      "text": "Mahdi Azmandian, Mark Hancock, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2016. Haptic Retargeting: Dynamic Repurposing of Passive Haptics for Enhanced Virtual Reality Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1968--1979.  ",
      "doi": "10.1145/2858036.2858226"
    },
    {
      "text": "Patrick Baudisch and Stefanie Müller. 2017. Personal Fabrication. Foundations and Trends® in Human-Computer Interaction 10, 3--4 (2017), 165--293.",
      "doi": ""
    },
    {
      "text": "Lung-Pan Cheng, Eyal Ofek, Christian Holz, Hrvoje Benko, and Andrew D. Wilson. 2017. Sparse Haptic Proxy: Touch Feedback in Virtual Environments Using a General Passive Prop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3718--3728.  ",
      "doi": "10.1145/3025453.3025753"
    },
    {
      "text": "Marc O. Ernst. 2012. Optimal Multisensory Integration: Assumptions and Limits. In The New Handbook of Multisensory Processes, Barry E. Stein (Ed.). MIT Press, 1084--1124.",
      "doi": ""
    },
    {
      "text": "Neil Gershenfeld. 2007. Fab: The Coming Revolution on Your Desktop-- from Personal Computers to Personal Fabrication. Basic Books. ",
      "doi": "10.5555/1211574"
    },
    {
      "text": "James Jerome Gibson. 1933. Adaptation, After-Efect and Contrast in the Perception of Curved Lines. Journal of Experimental Psychology 16, 1 (1933), 1--31.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C. Goble, and Neal F. Kassell. 1994. Passive Real-world Interface Props for Neurosurgical Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94). ACM, New York, NY, USA, 452--458.  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Yuichi Hirano, Asako Kimura, Fumihisa Shibata, and Hideyuki Tamura. 2011. Psychophysical Infuence of Mixed-Reality Visual Stimulation on Sense of Hardness. In 2011 IEEE Virtual Reality Conference. IEEE, 51--54.  ",
      "doi": "10.1109/VR.2011.5759436"
    },
    {
      "text": "Akiko Iesaki, Akihiro Somada, Asako Kimura, Fumihisa Shibata, and Hideyuki Tamura. 2008. Psychophysical Infuence on Tactual Impression by Mixed-Reality Visual Stimulation. In 2008 IEEE Virtual Reality Conference. IEEE, 265--266.",
      "doi": ""
    },
    {
      "text": "Brent Edward Insko. 2001. Passive Haptics Signifcantly Enhances Virtual Environments. Ph.D. Dissertation. University of North Carolina at Chapel Hill, USA. Advisor(s) Frederick P. Brooks Jr. http://www. cs.unc.edu/techreports/01-017.pdf",
      "doi": ""
    },
    {
      "text": "Itaru Kitahara, Morio Nakahara, and Yuichi Ohta. 2010. Sensory Properties in Fusion of Visual/Haptic Stimuli using Mixed Reality. Advances in Haptics (Apr 2010).",
      "doi": ""
    },
    {
      "text": "Luv Kohli. 2013. Redirected Touching. Ph.D. Dissertation. University of North Carolina at Chapel Hill, USA. Advisor(s) Frederick P. Brooks Jr. http://www.cs.unc.edu/techreports/13-002.pdf ",
      "doi": "10.5555/2519692"
    },
    {
      "text": "Eun Kwon, Gerard J. Kim, and Sangyoon Lee. 2009. Efects of Sizes and Shapes of Props in Tangible Augmented Reality. In 2009 8th IEEE International Symposium on Mixed and Augmented Reality. IEEE, 201-- 202.  ",
      "doi": "10.1109/ISMAR.2009.5336463"
    },
    {
      "text": "Gierad Laput, Xiang 'Anthony' Chen, and Chris Harrison. 2015. 3D Printed Hair: Fused Deposition Modeling of Soft Strands, Fibers, and Bristles. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, New York, NY, USA, 593--597.  ",
      "doi": "10.1145/2807442.2807484"
    },
    {
      "text": "Anatole Lécuyer. 2009. Simulating Haptic Feedback Using Vision: A Survey of Research and Applications of Pseudo-Haptic Feedback. Presence: Teleoperators and Virtual Environments 18, 1 (2009), 39--53.  ",
      "doi": "10.1162/pres.18.1.39"
    },
    {
      "text": "Thomas H. Massie and J. Kenneth Salisbury. 1994. The PHANToM Haptic Interface: A Device for Probing Virtual Objects. In Proceedings of the ASME Dynamic Systems and Control Division. 295--301.",
      "doi": ""
    },
    {
      "text": "William A. McNeely. 1993. Robotic Graphics: A New Approach to Force Feedback for Virtual Reality. In Proceedings of IEEE Virtual Reality Annual International Symposium. IEEE, Seattle, WA, USA, 336--341.  ",
      "doi": "10.1109/VRAIS.1993.380761"
    },
    {
      "text": "Jifei Ou, Gershon Dublon, Chin-Yi Cheng, Felix Heibeck, Karl Willis, and Hiroshi Ishii. 2016. Cilllia: 3D Printed Micro-Pillar Structures for Surface Texture, Actuation and Sensing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5753--5764.  ",
      "doi": "10.1145/2858036.2858257"
    },
    {
      "text": "Parinya Punpongsanon, Daisuke Iwai, and Kosuke Sato. 2015. SoftAR: Visually Manipulating Haptic Softness Perception in Spatial Augmented Reality. IEEE Transactions on Visualization and Computer Graphics 21, 11 (Nov 2015), 1279--1288.  ",
      "doi": "10.1109/TVCG.2015.2459792"
    },
    {
      "text": "Michael Rietzler, Florian Geiselhart, Jan Gugenheimer, and Enrico Rukzio. 2018. Breaking the Tracking: Enabling Weight Perception Using Perceivable Tracking Ofsets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 128, 12 pages.  ",
      "doi": "10.1145/3173574.3173702"
    },
    {
      "text": "Adalberto L. Simeone, Eduardo Velloso, and Hans Gellersen. 2015. Substitutional Reality: Using the Physical Environment to Design Virtual Reality Experiences. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3307--3316.  ",
      "doi": "10.1145/2702123.2702389"
    },
    {
      "text": "Mel Slater. 2009. Place Illusion and Plausibility Can Lead to Realistic Behaviour in Immersive Virtual Environments. Philosophical Transactions of the Royal Society of London B: Biological Sciences 364, 1535 (2009), 3549--3557.",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Depth of Presence in Virtual Environments. Presence: Teleoperators & Virtual Environments 3, 2 (1994), 130--144.  ",
      "doi": "10.1162/pres.1994.3.2.130"
    },
    {
      "text": "Mandayam A. Srinivasan and Cagatay Basdogan. 1997. Haptics in virtual environments: Taxonomy, research status, and challenges. Computers & Graphics 21, 4 (1997), 393--404.",
      "doi": ""
    },
    {
      "text": "Paul Strohmeier, Sebastian Boring, and Kasper Hornbæk. 2018. From Pulse Trains to \"Coloring with Vibrations\": Motion Mappings for MidAir Haptic Textures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 65, 13 pages.  ",
      "doi": "10.1145/3173574.3173639"
    },
    {
      "text": "Susumu Tachi, Taro Maeda, Ryokichi Hirata, and Hiroshi Hoshino. 1994. A Construction Method of Virtual Haptic Space. In Proc. ICAT '94. 131--138.",
      "doi": ""
    },
    {
      "text": "Haruki Takahashi and Homei Miyashita. 2016. Thickness Control Technique for Printing Tactile Sheets with Fused Deposition Modeling. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16 Adjunct). ACM, New York, NY, USA, 51--53.  ",
      "doi": "10.1145/2984751.2985701"
    },
    {
      "text": "Cesar Torres, Tim Campbell, Neil Kumar, and Eric Paulos. 2015. HapticPrint: Designing Feel Aesthetics for Digital Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 583--591.  ",
      "doi": "10.1145/2807442.2807492"
    },
    {
      "text": "Eric Whitmire, Hrvoje Benko, Christian Holz, Eyal Ofek, and Mike Sinclair. 2018. Haptic Revolver: Touch, Shear, Texture, and Shape Rendering on a Reconfgurable Virtual Reality Controller. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 86, 12 pages.  ",
      "doi": "10.1145/3173574.3173660"
    },
    {
      "text": "EJ Williams. 1949. Experimental Designs Balanced for the Estimation of Residual Efects of Treatments. Australian Journal of Chemistry 2, 2 (1949), 149--168.",
      "doi": ""
    },
    {
      "text": "Kentaro Yasu. 2017. Magnetic Plotter: A Macrotexture Design Method Using Magnetic Rubber Sheets. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 4983--4993.  ",
      "doi": "10.1145/3025453.3025702"
    },
    {
      "text": "André Zenner. 2016. Investigating Weight Distribution in Virtual Reality Proxy Interaction. Master's thesis. Saarland University & DFKI, Germany. https://www.dfki.de/web/forschung/publikationen?pubid=",
      "doi": ""
    },
    {
      "text": "André Zenner and Antonio Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (2017), 1285--1294.  ",
      "doi": "10.1109/TVCG.2017.2656978"
    },
    {
      "text": "Yiwei Zhao and Sean Follmer. 2018. A Functional Optimization Based Approach for Continuous 3D Retargeted Touch of Arbitrary, Complex Boundaries in Haptic Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 544, 12 pages.  ",
      "doi": "10.1145/3173574.3174118"
    }
  ]
}