{
  "doi": "10.1145/3290605.3300793",
  "title": "The Gendered Geography of Contributions to OpenStreetMap: Complexities in Self-Focus Bias",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Millions of people worldwide contribute content to peer production repositories that serve human information needs and provide vital world knowledge to prominent artificial intelligence systems. Yet, extreme gender participation disparities exist in which men significantly outnumber women. A central concern has been that due to self-focus bias, these disparities can lead to corresponding gender content disparities, in which content of interest to men is better represented than content of interest to women. This paper investigates the relationship between participation and content disparities in OpenStreetMap. We replicate findings that women are dramatically under-represented as OSM contributors, and observe that men and women contribute different types of content and do so about different places. However, the character of these differences confound simple narratives about self-focus bias: we find that on a proportional basis, men produced a higher proportion of contributions in feminized spaces compared to women, while women produced a higher proportion of contributions in masculinized spaces compared to men.",
  "tags": [
    "peer production",
    "openstreetmap",
    "gender",
    "rural",
    "urban",
    "self-focus bias"
  ],
  "authors": [
    {
      "name": "Maitraye Das",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-99659261723/rel-imgonly/maitrayedas.jpg",
      "acmid": "99659261723",
      "orcid": "0000-0002-8640-0544"
    },
    {
      "name": "Brent Hecht",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350577456",
      "orcid": "missing"
    },
    {
      "name": "Darren Gergle",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    }
  ],
  "references": [
    {
      "text": "2010. U.S. Census: Urban-rural. http://www.census.gov/geo/ reference/ua/urban-rural-2010.html",
      "doi": ""
    },
    {
      "text": "2013. U.S. Department of Agriculture: Rural-Urban Continuum Code. https://www.ers.usda.gov/data-products/ rural-urban-continuum-codes.aspx",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. http://download.geofabrik.de/northamerica.html.",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. https://planet.openstreetmap.org/.",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. https://wiki.openstreetmap.org/wiki/ Key:amenity.",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. https://wiki.openstreetmap.org/wiki/ Category:Users_in_the_United_States",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. https://help.openstreetmap.org/users/",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. https://gender-api.com/en/",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. https://www.google.com/maps/about/ partners/indoormaps/",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. https://wiki.openstreetmap.org/wiki/ Indoor_Mapping#active_indoor_maps",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. American FactFinder. https://factfnder.census.gov/faces/nav/jsf/pages/index.xhtml.",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. Esri Announces New Indoor Mapping Product. http://www.esri.com/esri-news/releases/18--3qtr/ esri-announces-new-indoor-mapping-product",
      "doi": ""
    },
    {
      "text": "Retrieved September 20, 2018. OSM goes indoors: Usages, tools and prospects. http://www.esri.com/esri-news/releases/18--3qtr/ esri-announces-new-indoor-mapping-product",
      "doi": ""
    },
    {
      "text": "Judd Antin, Ed H. Chi, James Howison, Sharoda Paul, Aaron Shaw, and Jude Yew. 2011. Apples to Oranges?: Comparing Across Studies of Open Collaboration/Peer Production. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11). ACM, 227--228.  ",
      "doi": "10.1145/2038558.2038610"
    },
    {
      "text": "Judd Antin, Raymond Yee, Coye Cheshire, and Oded Nov. 2011. Gender diferences in Wikipedia editing. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11), Mountain View, CA, USA. 11--14.  ",
      "doi": "10.1145/2038558.2038561"
    },
    {
      "text": "Shaowen Bardzell and Jefrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the ACM International Conference on Human Factors in Computing Systems, (CHI'11), Vancouver, BC. 675--684.  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Julia B. Bear and Benjamin Collier. 2016. Where are the women in Wikipedia? Understanding the diferent psychological experiences of men and women in Wikipedia. Sex Roles 74, 5--6 (January 2016), 254--265.",
      "doi": ""
    },
    {
      "text": "Jonathan Bright, Stefano De Sabbata, and Sumin Lee. 2017. Geodemographic biases in crowdsourced knowledge websites: do neighbours fll in the blanks? GeoJournal (2017).",
      "doi": ""
    },
    {
      "text": "Felicia M. Brown. 2017. Women's sexuality in swinging. Ph.D. Dissertation. Middle Tennessee State University, Tennessee, USA.",
      "doi": ""
    },
    {
      "text": "Nama R. Budhathoki. 2010. Participants' motivations to contribute geographic information in an online community. Ph.D. Dissertation. University of Illinois at Urbana-Champaign, Urbana, Illinois.",
      "doi": ""
    },
    {
      "text": "Ewa Callahan and Susan C. Herring. 2011. Cultural bias in Wikipedia content on famous persons. JASIST 62, 10 (2011), 1899--1915.  ",
      "doi": "10.1002/asi.21577"
    },
    {
      "text": "Le Chen, Ruijun Ma, Anikó Hannák, and Christo Wilson. 2018. Investigating the Impact of Gender on Rank in Resume Search Engines. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, 651:1--651:14.  ",
      "doi": "10.1145/3173574.3174225"
    },
    {
      "text": "Herbert H. Clark. 1996. Using Language. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Benjamin Collier and Julia Bear. 2012. Confict, criticism, or confdence: An empirical examination of the gender gap in Wikipedia contributions. In Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW '12), Seattle, WA, USA. 383--392.  ",
      "doi": "10.1145/2145204.2145265"
    },
    {
      "text": "Dan Cosley, Dan Frankowski, Loren G. Terveen, and John Riedl. 2007. SuggestBot: using intelligent task routing to help people fnd work in wikipedia. In Proceedings of the 12th International Conference on Intelligent User Interfaces, (IUI'07), Honolulu, Hawaii, USA. 32--41.  ",
      "doi": "10.1145/1216295.1216309"
    },
    {
      "text": "Martin Dittus, Giovanni Quattrone, and Licia Capra. 2017. Mass Participation During Emergency Response: Event-centric Crowdsourcing in Humanitarian Mapping. In Proceedings of the ACM Conference on Computer Supported Cooperative Work and Social Computing, (CSCW'17), Portland, OR, USA. 1290--1303. http://dl.acm.org/citation. cfm?id=2998216  ",
      "doi": "10.1145/2998181.2998216"
    },
    {
      "text": "Lauren E. Durant, Michael P. Carey, and Kerstin E. E. Schroder. 2002. Efects of Anonymity, Gender, and Erotophilia on the Quality of Data Obtained From Self-Reports of Socially Sensitive Behaviors. Journal of Behavioral Medicine 25, 5 (2002), 439--467.",
      "doi": ""
    },
    {
      "text": "Melanie Eckle and João Porto de Albuquerque. 2015. Quality assessment of remote mapping in OpenStreetMap for disaster management purposes. In Proceedings of the 12th Proceedings of the International Conference on Information Systems for Crisis Response and Management (ISCRM'15), Krystiansand, Norway. http://idl.iscram.org/fles/melanieeckle/2015/ 1218_MelanieEckle+JoaoPortodeAlbuquerque2015.pdf",
      "doi": ""
    },
    {
      "text": "R. Danielle Egan and Katherine Frank. 2005. Attempts at a feminist and interdisciplinary conversation about strip clubs. Deviant Behavior 26 (2005), 297 -- 320.",
      "doi": ""
    },
    {
      "text": "Sarah Elwood. 2008. Volunteered geographic information: Future research directions motivated by critical, participatory, and feminist GIS. GeoJournal 72 (July 2008), 173--183.",
      "doi": ""
    },
    {
      "text": "Eureka Foong, Nicholas Vincent, Elizabeth Gerber, and Brent Hecht. 2018. Women (Still) Ask For Less: Gender Diferences in Wage-Setting and Occupation in an Online Labor Marketplace. In Proceedings of the ACM Conference on Computer Supported Cooperative Work and Social Computing, (CSCW'18). ACM.",
      "doi": ""
    },
    {
      "text": "Killian Fox. 2012. OpenStreetMap: 'It's the Wikipedia of maps'. The Guardian. Retrieved September 09, 2018 from https://www.theguardian.com/theobserver/2012/feb/18/ openstreetmap-world-map-radicals",
      "doi": ""
    },
    {
      "text": "Katherine Frank. 2003. \"Just trying to relax\": masculinity, masculinizing practices, and strip club regulars. The Journal of Sex Research 40, 1 (February 2003), 61 -- 75.",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger. 2014. Bots, bespoke, code and the materiality of software platforms. Information, Communication & Society 17, 3 (2014), 342--356.",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger and Aaron Halfaker. 2013. Gender diferences in Wikipedia editing. In Proceedings of the 9th International Symposium on Wikis and Open Collaboration (WikiSym '13), Hong Kong, China.",
      "doi": ""
    },
    {
      "text": "Ruediger Glott, Philipp Schmidt, and Rishab Ghosh. 2010. Wikipedia survey- Overview of results. Technical Report. United Nations University - MERIT, Maastricht, Netherlands.",
      "doi": ""
    },
    {
      "text": "Eduardo Graells-Garrido, Mounia Lalmas, and Filippo Menczer. 2015. First women, second sex: Gender bias in Wikipedia. In Proceedings of the 26th ACM Conference on Hypertext & Social Media, (HT '15), Guzelyurt, TRNC, Cyprus. 165--174.  ",
      "doi": "10.1145/2700171.2791036"
    },
    {
      "text": "Mark Graham, Matthew Zook, and Andrew Boulton. 2013. Augmented reality in urban places: contested content and the duplicity of code. Transactions of the Institute of British Geographers 38, 3 (2013), 464--479.",
      "doi": ""
    },
    {
      "text": "Muki Haklay. 2010. How good is volunteered geographical information? A comparative study of OpenStreetMap and Ordnance Survey datasets. Environment and Planning B: Planning and Design (2010), 682 -- 703.",
      "doi": ""
    },
    {
      "text": "Muki Haklay. 2012. Nobody wants to do council estates' - digital divide, spatial justice and outliers. In Annual Meeting of the Association of American Geographers (AAG '12). https://www.slideshare.net/mukih/ nobody-wants-to-do-council-estates-digital-divide-spatial-justiceand-outliers?ref=http://povesham.wordpress.com/.",
      "doi": ""
    },
    {
      "text": "Sidsel Kirstine Harder and Jakob Demant. 2015. Failing Masculinity at the Club: A Poststructural Alternative to Intoxication Feminism. Substance Use and Misuse 50 (2015), 759 -- 767.",
      "doi": ""
    },
    {
      "text": "Darren Hardy, James Frew, and Michael F. Goodchild. 2012. Volunteered geographic information production as a spatial process. International Journal of Geographical Information Science 26, 7 (2012), 1191--1212.  ",
      "doi": "10.1080/13658816.2011.629618"
    },
    {
      "text": "Eszter Hargittai and Aaron Shaw. 2015. Mind the skills gap: The role of Internet know-how and gender in diferentiated contributions to Wikipedia. Information, Communication and Society 18, 4 (2015), 424--442.",
      "doi": ""
    },
    {
      "text": "Steven A. Harrison. 2005. \"Trim Of the Top and Close on the Sides\": America's Disappearing Legacy of Barbershops. Ph.D. Dissertation. Utah State University, Logan, Utah.",
      "doi": ""
    },
    {
      "text": "Brent J. Hecht. 2013. The mining and application of diverse cultural perspectives in user-generated content. Ph.D. Dissertation. Northwestern University, Evanston, Illinois. ",
      "doi": "10.5555/2519359"
    },
    {
      "text": "Brent J. Hecht and Darren Gergle. 2009. Measuring self-focus bias in community-maintained knowledge repositories. In Proceedings of the Fourth International Conference on Communities and Technologies, (C&T'09), University Park, PA, USA. 11--20.  ",
      "doi": "10.1145/1556460.1556463"
    },
    {
      "text": "Brent J. Hecht and Darren Gergle. 2010. On the \"localness\" of usergenerated content. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, (CSCW'10), Savannah, Georgia, USA. 229--232.  ",
      "doi": "10.1145/1718918.1718962"
    },
    {
      "text": "Brent J. Hecht and Darren Gergle. 2010. The tower of Babel meets web 2.0: user-generated content and its applications in a multilingual context. In Proceedings of the 28th International Conference on Human Factors in Computing Systems, (CHI'10), Atlanta, Georgia, USA. 291-- 300.  ",
      "doi": "10.1145/1753326.1753370"
    },
    {
      "text": "Brent J. Hecht and Monica Stephens. 2014. A tale of cities: Urban biases in volunteered geographic information. In Proceedings of the Eighth International Conference on Weblogs and Social Media, (ICWSM'14), Ann Arbor, Michigan, USA. http://www.aaai.org/ocs/ index.php/ICWSM/ICWSM14/paper/view/8114",
      "doi": ""
    },
    {
      "text": "Benjamin M. Hill and Aaron Shaw. 2013. The Wikipedia gender gap revisited: Characterizing survey response bias with propensity score estimation. PLoS ONE 8, 6, Article e65782 (June 2013).",
      "doi": ""
    },
    {
      "text": "Sarah Holder. 2018. Why equitable maps are more accurate and humane. https://www.citylab.com/equity/2018/03/ who-maps-the-world/555272/",
      "doi": ""
    },
    {
      "text": "Christoph Hube. 2017. Bias in Wikipedia. In Proceedings of the 26th International Conference on World Wide Web Companion, Perth, Australia. 717--721.  ",
      "doi": "10.1145/3041021.3053375"
    },
    {
      "text": "Mohsen Jadidi, Fariba Karimi, and Claudia Wagner. 2017. Gender disparities in science? Dropout, productivity, collaborations and success of male and female computer scientists. CoRR abs/1704.05801 (2017). http://arxiv.org/abs/1704.05801",
      "doi": ""
    },
    {
      "text": "Sheila Jefreys. 2008. Keeping Women Down and Out: The Strip Club Boom and the Reinforcement of Male Dominance. Signs: Journal of Women in Culture and Society 34, 1 (2008), 151--173.",
      "doi": ""
    },
    {
      "text": "Isaac L. Johnson, Yilun Lin, Toby Jia-Jun Li, Andrew Hall, Aaron Halfaker, Johannes Schöning, and Brent J. Hecht. 2016. Not at home on the range: Peer production and the urban/rural divide. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI'15), San Jose, CA, USA. 13--25.  ",
      "doi": "10.1145/2858036.2858123"
    },
    {
      "text": "Isaac L. Johnson, Connor McMahon, Johannes Schöning, and Brent J. Hecht. 2017. The efect of population and ?structural\" biases on social media-based algorithms - A case study in geolocation inference across the urban-rural spectrum. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI'17), Denver, CO, USA. 1167-- 1178.  ",
      "doi": "10.1145/3025453.3026015"
    },
    {
      "text": "Fariba Karimi, Claudia Wagner, Florian Lemmerich, Mohsen Jadidi, and Markus Strohmaier. 2016. Inferring gender from names on the Web: A comparative evaluation of gender detection methods. In Proceedings of the 25th International Conference on World Wide Web (WWW'16), Montreal, Canada. 53--54.  ",
      "doi": "10.1145/2872518.2889385"
    },
    {
      "text": "Aniket Kittur and Robert E. Kraut. 2008. Harnessing the Wisdom of Crowds in Wikipedia: Quality Through Coordination. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW '08). ACM, 37--46.  ",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Aniket Kittur, Bryan A. Pendleton, Bongwon Suh, and Todd Mytkowicz. 2007. Power of the few vs. wisdom of the crowd: Wikipedia and the rise of the bourgeoisie. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM.",
      "doi": ""
    },
    {
      "text": "Maximilian Klein, Harsh Gupta, Vivek Rai, Piotr Konieczny, and Haiyi Zhu. 2016. Monitoring the gender gap with Wikidata Human Gender Indicators. In Proceedings of the 12th International Symposium on Open Collaboration (OpenSym'16), Berlin, Germany. Article 16.  ",
      "doi": "10.1145/2957792.2957798"
    },
    {
      "text": "Shyong K. Lam, Anuradha Uduwage, Zhenhua Dong, Shilad Sen, David R. Musicant, Loren G. Terveen, and John Riedl. 2011. WP: clubhouse?: An exploration of Wikipedia's gender imbalance. In Proceedings of the 7th International Symposium on Wikis and Open Collaboration (WikiSym '11), Mountain View, CA, USA. 1--10.  ",
      "doi": "10.1145/2038558.2038560"
    },
    {
      "text": "J. Richard Landis and Gary G. Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics 33, 1 (1977), 159--174.",
      "doi": ""
    },
    {
      "text": "David Laniado, Andreas Kaltenbrunner, Carlos Castillo, and Mayo Fuster Morell. 2012. Emotions and dialogue in a peerproduction community: The case of Wikipedia. In Proceedings of the 8th Annual International Symposium on Wikis and Open Collaboration (WikiSym '12), Austria. Article 9.  ",
      "doi": "10.1145/2462932.2462944"
    },
    {
      "text": "Victoria Lawson. 2007. Geographies of Care and Responsibility. Annals of the Association of American Geographers 97, 1 (2007), 1--11.",
      "doi": ""
    },
    {
      "text": "Agnieszka Leszczynski and Sarah Elwood. 2015. Feminist geographies of new spatial media. The Canadian Geographer / Le Geographe Canadien 59 (2015), 12--28.",
      "doi": ""
    },
    {
      "text": "Bin Lin and Alexander Serebrenik. 2016. Recognizing Gender of Stack Overfow Users. In Proceedings of the 13th International Conference on Mining Software Repositories (MSR '16). ACM, 425--429.  ",
      "doi": "10.1145/2901739.2901777"
    },
    {
      "text": "Yuwei Lin and Manuela Schmidt. 2014. A gender-informed curriculum for teaching volunteered geographic information. In the 8th European Conference on Gender Equality in Higher Education.",
      "doi": ""
    },
    {
      "text": "Noemi De Luca, Nicole Ferber, Helena Atteneder, and Thomas Jekel. 2015. Feminist and queer approaches to education for spatial citizenship. GI_Forum - Journal for Geographic Information Science (2015), 272--282.",
      "doi": ""
    },
    {
      "text": "Afra J. Mashhadi, Giovanni Quattrone, and Licia Capra. 2013. Putting ubiquitous crowd-sourcing into context. In Proceedings of the 16th ACM Conference on Computer Supported Cooperative Work & Social Computing, (CSCW'13), San Antonio, TX, USA. 611--622.  ",
      "doi": "10.1145/2441776.2441845"
    },
    {
      "text": "Connor McMahon, Isaac Johnson, and Brent Hecht. 2017. The Substantial Interdependence of Wikipedia and Google: A Case Study on the Relationship Between Peer Production Communities and Information Technologies. In Proceedings of the International AAAI Conference on Web and Social Media (ICWSM '17). AAAI.",
      "doi": ""
    },
    {
      "text": "Olena Medelyan, David N. Milne, Catherine Legg, and Ian H. Witten. 2009. Mining meaning from Wikipedia. International Journal of Human-Computer Studies 67, 9 (2009), 716--754.  ",
      "doi": "10.1016/j.ijhcs.2009.05.004"
    },
    {
      "text": "Amanda Menking and Ingrid Erickson. 2015. The heart work of Wikipedia: Gendered, emotional labor in the world's largest online encyclopedia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, (CHI '15), Seoul, Republic of Korea. 207--210.  ",
      "doi": "10.1145/2702123.2702514"
    },
    {
      "text": "Christopher Mims. 2011. \"Wikipedia of Maps' Challenges Google. MIT Technology Review. Retrieved September 09, 2018 from https://www.technologyreview.com/s/426481/ wikipedia-of-maps-challenges-google/",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Morton. 2010. Completely straight, most of the time: An inquiry into the sexuality of male swingers. Ph.D. Dissertation. California State University, Fullerton, California, USA.",
      "doi": ""
    },
    {
      "text": "Michelle Murphy. 2012. Seizing the Means of Reproduction: Entanglements of Feminism, Health, and Technoscience. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Pascal Neis and Dennis Zielstra. 2014. Recent developments and future trends in volunteered geographic information research: The case of OpenStreetMap. Future Internet 6, 1 (2014), 76--106.",
      "doi": ""
    },
    {
      "text": "Jake Olivier, Warren L. May, and Melanie L. Bell. 2017. Relative efect sizes for measures of risk. Communications in Statistics - Theory and Methods 46, 14 (2017), 6774--6781.",
      "doi": ""
    },
    {
      "text": "Jahna Otterbacher. 2015. Linguistic Bias in Collaboratively Produced Biographies: Crowdsourcing Social Stereotypes?. In Proceedings of the Ninth International Conference on Web and Social Media, (ICWSM'15), Oxford, UK. 298--307. http://www.aaai.org/ocs/index.php/ICWSM/ ICWSM15/paper/view/10539",
      "doi": ""
    },
    {
      "text": "Katherine Panciera, Aaron Halfaker, and Loren Terveen. 2009. Wikipedians Are Born, Not Made: A Study of Power Editors on Wikipedia. In Proceedings of the ACM 2009 International Conference on Supporting Group Work (GROUP '09). ACM, 51--60.  ",
      "doi": "10.1145/1531674.1531682"
    },
    {
      "text": "Ulrike Pfeil, Panayiotis Zaphiris, and Chee Siang Ang. 2006. Cultural diferences in collaborative authoring of Wikipedia. Journal of Computer-Mediated Communication 12, 1 (2006), 88--113.",
      "doi": ""
    },
    {
      "text": "Geraldine Pratt. 2003. Valuing Childcare: Troubles in Suburbia. Antipode 35, 3 (2003), 581--602.",
      "doi": ""
    },
    {
      "text": "Ioannis Protonotarios, Vasiliki Sarimpei, and Jahna Otterbacher. 2016. Similar gaps, diferent origins? Women readers and editors at Greek Wikipedia. In Workshops of the 10th International AAAI Conference on Web and Social Media (ICWSM '16), Cologne, Germany. http: //aaai.org/ocs/index.php/ICWSM/ICWSM16/paper/view/13192",
      "doi": ""
    },
    {
      "text": "Giovanni Quattrone, Licia Capra, and Pasquale De Meo. 2015. There's no such thing as the perfect map: Quantifying bias in spatial crowdsourcing datasets. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, (CSCW'15), Vancouver, BC, Canada. 1021--1032.  ",
      "doi": "10.1145/2675133.2675235"
    },
    {
      "text": "Debra Satz. 2017. Feminist Perspectives on Reproduction and the Family. In The Stanford Encyclopedia of Philosophy (summer 2017 ed.), Edward N. Zalta (Ed.). Metaphysics Research Lab, Stanford University.",
      "doi": ""
    },
    {
      "text": "Dennis M. Savard, Thomas M. Kelley, and David M. Merolla. 2017. Routine Activities and Criminal Victimization: The Signifcance of Gendered Spaces. Journal of Interpersonal Violence (July 2017).",
      "doi": ""
    },
    {
      "text": "Jennifer Scanlon. 2007. \"If My Husband Calls I'm Not Here': The Beauty Parlor as Real and Representational Female Space. Feminist Studies 33, 2 (2007), 308--334. https://www.jstor.org/stable/20459141",
      "doi": ""
    },
    {
      "text": "Manuela Schmidt and Silvia Klettner. 2013. Gender and experiencerelated motivators for contributing to OpenStreetMap. In International Workshop on Action and Interaction in Volunteered Geographic Information (ACTIVITY), Leuven. 13--18.",
      "doi": ""
    },
    {
      "text": "Manuela Schmidt, Silvia Klettner, and Renate Steinmann. 2013. Barriers for contributing to VGI projects. In the 26th International Cartographic Conference.",
      "doi": ""
    },
    {
      "text": "Shilad W. Sen, Heather Ford, David R. Musicant, Mark Graham, Oliver S.B. Keyes, and Brent Hecht. 2015. Barriers to the Localness of Volunteered Geographic Information. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, 197--206.  ",
      "doi": "10.1145/2702123.2702170"
    },
    {
      "text": "Aaron Shaw and Eszter Hargittai. 2018. The Pipeline of Online Participation Inequalities: The Case of Wikipedia Editing. Journal of Communication 68, 1 (February 2018), 143--168.",
      "doi": ""
    },
    {
      "text": "Renate Steinmann, Elisabeth Hausler, Silvia Klettner, Manuela Schmidt, and Yuwei Lin. 2013. Gender dimensions in UGC and VGI: A desk-based study. In GI_Forum 2013, Creating the GISociety - Conference Proceedings. 355--364.",
      "doi": ""
    },
    {
      "text": "Monica Stephens. 2013. Gender and the GeoWeb: Divisions in the production of user-generated cartographic information. GeoJournal 78 (August 2013), 981--996.",
      "doi": ""
    },
    {
      "text": "Qian Hui Tan. 2014. Postfeminist possibilities: unpacking the paradoxical performances of heterosexualized femininity in club spaces. Social and Cultural Geography 15, 1 (2014), 23 -- 48.",
      "doi": ""
    },
    {
      "text": "Josh Terrell, Andrew Kofnk, Justin Middleton, Clarissa Rainear, Emerson R. Murphy-Hill, Chris Parnin, and Jon Stallings. 2017. Gender diferences and bias in open source: pull request acceptance of women versus men. PeerJ Computer Science 3, Article e111 (2017).",
      "doi": ""
    },
    {
      "text": "Claudia Wagner, David Garcia, Mohsen Jadidi, and Markus Strohmaier. 2015. It's a man's Wikipedia? Assessing gender inequality in an online encyclopedia. In Proceedings of the 9th International Conference on Web and Social Media, (ICWSM '15), Oxford, UK. 454-- 463. http://www.aaai.org/ocs/index.php/ICWSM/ICWSM15/paper/ view/10585",
      "doi": ""
    },
    {
      "text": "Claudia Wagner, Eduardo Graells-Garrido, and David Garcia. 2016. Women through the glass-ceiling: Gender asymmetries in Wikipedia. EPJ Data Science 5, 5 (2016).",
      "doi": ""
    },
    {
      "text": "Michele White. 2015. Producing women : the Internet, traditional femininity, queerness, and creativity Women fock to nail art. Routledge, New York, USA.",
      "doi": ""
    },
    {
      "text": "Olga Zagovora, Fabian Flöck, and Claudia Wagner. 2017. (Weitergeleitet von Journalistin)\": The gendered presentation of professions on Wikipedia. In Proceedings of the 2017 ACM on Web Science Conference (WebSci '17), Troy, NY, USA. 83--92.  ",
      "doi": "10.1145/3091478.3091488"
    },
    {
      "text": "Dennis Zielstra, Hartwig H. Hochmair, and Pascal Neis. 2013. Assessing the efect of data imports on the completeness of OpenStreetMap - A United States case study. Transactions in GIS 17, 3 (2013), 315--334.",
      "doi": ""
    },
    {
      "text": "Dennis Zielstra, Hartwig H. Hochmair, Pascal Neis, and Francesco Tonini. 2014. Areal delineation of home regions from contribution and editing patterns in OpenStreetMap. ISPRS International Journal of GeoInformation 3, 4 (2014), 1211--1233.",
      "doi": ""
    },
    {
      "text": "Dennis Zielstra and Alexander Zipf. 2010. A comparative study of proprietary geo-data and volunteered geographic information for Germany. In Proceedings of the 13th AGILE International Conference on Geographic Information Science.",
      "doi": ""
    }
  ]
}