{
  "doi": "10.1145/3290605.3300487",
  "title": "Predicting Cognitive Load in Future Code Puzzles",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Code puzzles are an increasingly popular way to introduce youth to programming. Yet our knowledge about how to maximize learning from puzzles is incomplete. We conducted a data collection study and trained a model that predicts cognitive load, the mental effort necessary to complete a task, on a future puzzle. Controlling cognitive load can lead to more effective learning. Our model suggests that it is possible to predict Cognitive Load on future problems; the model could correctly distinguish the more difficult puzzle within a pair 71%-79% of the time. Further, studying the model itself provides new insights into the sources of puzzle difficulty, the factors that contribute to Cognitive Load, and their inter-relationships. Finally, the ability to predict Cognitive Load on a future puzzle is an important step towards the creation of adaptive code puzzle systems.",
  "authors": [
    {
      "name": "Caitlin Kelleher",
      "institution": "Washington University in St. Louis, St Louis, MO, USA",
      "img": "/do/10.1145/contrib-81100607695/rel-imgonly/ckelleher.jpg",
      "acmid": "81100607695",
      "orcid": "missing"
    },
    {
      "name": "Wint Hnin",
      "institution": "Washington University in St. Louis, St Louis, MO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659159989",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2018. BotLogic. http://botlogic.us/#sthash.0kCo1qo6.dpbs",
      "doi": ""
    },
    {
      "text": "2018. Code Avengers. https://www.codeavengers.com/",
      "doi": ""
    },
    {
      "text": "2018. Code Combat. https://codecombat.com/",
      "doi": ""
    },
    {
      "text": "2018. code.org. https://code.org/",
      "doi": ""
    },
    {
      "text": "2018. Lightbot. http://lightbot.com/hoc.html",
      "doi": ""
    },
    {
      "text": "2018. Looking Glass. https://lookingglass.wustl.edu/",
      "doi": ""
    },
    {
      "text": "2018. Robozzle. http://www.robozzle.com/",
      "doi": ""
    },
    {
      "text": "2018. Scikit-Learn. http://scikit-learn.org/stable/",
      "doi": ""
    },
    {
      "text": "2018. Tynker. https://www.tynker.com/",
      "doi": ""
    },
    {
      "text": "M'hammed Abdous, He Wu, and Cherng-Jyh Yen. 2012. Using data mining for predicting relationships between online question theme and fnal grade. Journal of Educational Technology & Society 15, 3 (2012), 77.",
      "doi": ""
    },
    {
      "text": "Robert K. Atkinson, Richard Catrambone, and Mary Margaret Merrill. 2003. Aiding Transfer in Statistics: Examining the Use of Conceptually Oriented Equations and Elaborations During Subgoal Learning. Journal of Educational Psychology 95, 4 (2003), 762.",
      "doi": ""
    },
    {
      "text": "Robert K. Atkinson, Alexander Renkl, and Mary Margaret Merrill. 2003. Transitioning from studying examples to solving problems: Efects of self-explanation prompts and fading worked-out steps. Journal of Educational Psychology 95, 4 (2003), 774.",
      "doi": ""
    },
    {
      "text": "Ryan SJd Baker, Sujith Gowda, Michael Wixon, Jessica Kalka, Angela Wagner, Aatish Salvi, Vincent Aleven, Gail Kusbit, Jaclyn Ocumpaugh, and Lisa Rossi. 2012. Sensor-free automated detection of afect in a Cognitive Tutor for Algebra. In Educational Data Mining 2012.",
      "doi": ""
    },
    {
      "text": "Joseph Beck and Beverly Woolf. 2000. High-level student modeling with machine learning. In Intelligent tutoring systems. Springer, 584-- 593. ",
      "doi": "10.5555/648030.745810"
    },
    {
      "text": "L Breiman. 1996. Out-of-bag estimation, ftp. stat. berkeley. edu/pub/users/breiman. OOBestimation. ps 199, 6 (1996).",
      "doi": ""
    },
    {
      "text": "Leo Breiman. 2001. Random forests. Machine learning 45, 1 (2001), 5--32.  ",
      "doi": "10.1023/A%3A1010933404324"
    },
    {
      "text": "Leo Breiman. 2017. Classifcation and regression trees. Routledge.",
      "doi": ""
    },
    {
      "text": "Roland Brunken, Jan L. Plass, and Detlev Leutner. 2003. Direct measurement of cognitive load in multimedia learning. Educational psychologist 38, 1 (2003), 53--61.",
      "doi": ""
    },
    {
      "text": "PL Brusilovsky. 1992. Intelligent tutor, environment and manual for introductory programming. Educational and Training Technology International 29, 1 (1992), 26--34.",
      "doi": ""
    },
    {
      "text": "Peter Brusilovsky. 1998. Methods and techniques of adaptive hypermedia. In Adaptive hypertext and hypermedia. Springer, 1--43.",
      "doi": ""
    },
    {
      "text": "Peter Brusilovsky and Michael V Yudelson. 2008. From webex to navex: Interactive access to annotated program examples. Proc. IEEE 96, 6 (2008), 990--999.",
      "doi": ""
    },
    {
      "text": "Gino Camp, Fred Paas, Remy Rikers, and Jeroen van Merrienboer. 2001. Dynamic problem selection in air trafc control training: A comparison between performance, mental efort and mental efciency. Computers in Human Behavior 17, 5 (2001), 575--595.",
      "doi": ""
    },
    {
      "text": "Richard Catrambone. 1998. The subgoal learning model: Creating better examples so that students can solve novel problems. Journal of Experimental Psychology: General 127, 4 (1998), 355.",
      "doi": ""
    },
    {
      "text": "Paul Chandler and John Sweller. 1992. The split-attention efect as a factor in the design of instruction. British Journal of Educational Psychology 62, 2 (1992), 233--246.",
      "doi": ""
    },
    {
      "text": "Chih-Ming Chen. 2008. Intelligent web-based learning system with personalized learning path guidance. Computers & Education 51, 2 (2008), 787--814.  ",
      "doi": "10.1016/j.compedu.2007.08.004"
    },
    {
      "text": "Michelene TH Chi, Miriam Bassok, Matthew W. Lewis, Peter Reimann, and Robert Glaser. 1989. Self-explanations: How students study and use examples in learning to solve problems. Cognitive science 13, 2 (1989), 145--182.",
      "doi": ""
    },
    {
      "text": "Gemma Corbalan, Liesbeth Kester, and Jeroen JG Van Merrienboer. 2006. Towards a personalized task selection model with shared instructional control. Instructional Science 34, 5 (2006), 399--422.",
      "doi": ""
    },
    {
      "text": "Gemma Corbalan, Liesbeth Kester, and Jeroen JG Van Merrienboer. 2008. Selecting learning tasks: Efects of adaptation and shared control on learning efciency and task involvement. Contemporary Educational Psychology 33, 4 (2008), 733--756.",
      "doi": ""
    },
    {
      "text": "Albert T Corbett and John R Anderson. 1994. Knowledge tracing: Modeling the acquisition of procedural knowledge. User modeling and user-adapted interaction 4, 4 (1994), 253--278.",
      "doi": ""
    },
    {
      "text": "Jesse Davis and Mark Goadrich. 2006. The relationship between Precision-Recall and ROC curves. In Proceedings of the 23rd international conference on Machine learning. ACM, 233--240.  ",
      "doi": "10.1145/1143844.1143874"
    },
    {
      "text": "Sidney K D'mello, Scotty D Craig, Amy Witherspoon, Bethany Mcdaniel, and Arthur Graesser. 2008. Automatic detection of learner's afect from conversational cues. User modeling and user-adapted interaction 18, 1 (2008), 45--80.  ",
      "doi": "10.1007/s11257-007-9037-6"
    },
    {
      "text": "Barbara J. Ericson. 2015. Adaptive Parsons Problems with Discourse Rules. In Proceedings of the Eleventh Annual International Conference on International Computing Education Research (ICER '15). Omaha, Nebraska, USA, 259--260.  ",
      "doi": "10.1145/2787622.2787740"
    },
    {
      "text": "Barbara J Ericson. 2016. Dynamically Adaptive Parsons Problems. In Proceedings of the 2016 ACM Conference on International Computing Education Research. ACM, 269--270.  ",
      "doi": "10.1145/2960310.2960342"
    },
    {
      "text": "Barbara J Ericson, James D Foley, and Jochen Rick. 2018. Evaluating the Efciency and Efectiveness of Adaptive Parsons Problems. In Proceedings of the 2018 ACM Conference on International Computing Education Research. ACM, 60--68.  ",
      "doi": "10.1145/3230977.3231000"
    },
    {
      "text": "Barbara J Ericson, Lauren E Margulieux, and Jochen Rick. 2017. Solving parsons problems versus fxing and writing code. In Proceedings of the 17th Koli Calling Conference on Computing Education Research. ACM, 20--29.  ",
      "doi": "10.1145/3141880.3141895"
    },
    {
      "text": "Stuart Garner. 2007. An Exploration of How a Technology-Facilitated Part-Complete Solution Method Supports the Learning of Computer Programming. Issues in Informing Science & Information Technology 4 (2007).",
      "doi": ""
    },
    {
      "text": "Peter Gerjets and Katharina Scheiter. 2003. Goal confgurations and processing strategies as moderators between instructional design and cognitive load: Evidence from hypertext-based instruction. Educational psychologist 38, 1 (2003), 33--41.",
      "doi": ""
    },
    {
      "text": "Arthur C. Graesser, Katja Wiemer-Hastings, Peter Wiemer-Hastings, Roger Kreuz, and Tutoring Research Group. 1999. AutoTutor: A simulation of a human tutor. Cognitive Systems Research 1, 1 (1999), 35--51.  ",
      "doi": "10.1016/S1389-0417%2899%2900005-4"
    },
    {
      "text": "Sabine Graf and K Kinshuk. 2007. Providing adaptive courses in learning management systems with respect to learning styles. In E-Learn: World Conference on E-Learning in Corporate, Government, Healthcare, and Higher Education. Association for the Advancement of Computing in Education (AACE), 2576--2583.",
      "doi": ""
    },
    {
      "text": "Kyle J Harms, Evan Balzuweit, Jason Chen, and Caitlin Kelleher. 2016. Learning programming from tutorials and code puzzles: Children's perceptions of value. In Visual Languages and Human-Centric Computing (VL/HCC), 2016 IEEE Symposium on. IEEE, 59--67.",
      "doi": ""
    },
    {
      "text": "Kyle James Harms, Jason Chen, and Caitlin L. Kelleher. 2016. Distractors in Parsons Problems Decrease Learning Efciency for Young Novice Programmers. In Proceedings of the 2016 ACM Conference on International Computing Education Research. ACM, 241--250.  ",
      "doi": "10.1145/2960310.2960314"
    },
    {
      "text": "Kyle J Harms, Noah Rowlett, and Caitlin Kelleher. 2015. Enabling independent learning of programming concepts through programming completion puzzles. In Visual Languages and Human-Centric Computing (VL/HCC), 2015 IEEE Symposium on. IEEE, 271--279. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk",
      "doi": ""
    },
    {
      "text": "Jean-Mathias Heraud, Laure France, and Alain Mille. 2004. Pixed: An ITS that guides students with the help of learners' interaction log. In International conference on intelligent tutoring systems, workshop analyzing student tutor interaction logs to improve educational outcomes. Maceio, Brazil. 57--64.",
      "doi": ""
    },
    {
      "text": "Ada S Kim and Andrew J Ko. 2017. A pedagogical analysis of online coding tutorials. In Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education. ACM, 321--326.  ",
      "doi": "10.1145/3017680.3017728"
    },
    {
      "text": "Paul A. Kirschner, John Sweller, and Richard E. Clark. 2006. Why minimal guidance during instruction does not work: An analysis of the failure of constructivist, discovery, problem-based, experiential, and inquiry-based teaching. Educational psychologist 41, 2 (2006), 75--86.",
      "doi": ""
    },
    {
      "text": "René F Kizilcec, Chris Piech, and Emily Schneider. 2013. Deconstructing disengagement: analyzing learner subpopulations in massive open online courses. In Proceedings of the third international conference on learning analytics and knowledge. ACM, 170--179.  ",
      "doi": "10.1145/2460296.2460330"
    },
    {
      "text": "Aleksandra Klasnja-Milicevic, Boban Vesin, Mirjana Ivanovic, and Zoran Budimac. 2011. E-Learning personalization based on hybrid recommendation strategy and learning style identifcation. Computers & Education 56, 3 (2011), 885--899.  ",
      "doi": "10.1016/j.compedu.2010.11.001"
    },
    {
      "text": "Amruth N Kumar. 2018. Epplets: A Tool for Solving Parsons Puzzles. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education. ACM, 527--532.  ",
      "doi": "10.1145/3159450.3159576"
    },
    {
      "text": "Michael J Lee. 2014. Gidget: An online debugging game for learning and engagement in computing education. In Visual Languages and Human-Centric Computing (VL/HCC), 2014 IEEE Symposium on. IEEE, 193--194.",
      "doi": ""
    },
    {
      "text": "Michael J Lee and Andrew J Ko. 2015. Comparing the efectiveness of online learning approaches on CS1 learning outcomes. In Proceedings of the Eleventh Annual International Conference on International Computing Education Research. ACM, 237--246.  ",
      "doi": "10.1145/2787622.2787709"
    },
    {
      "text": "Jie Lu. 2004. A personalized e-learning material recommender system. In International Conference on Information Technology and Applications. Macquarie Scientifc Publishing.",
      "doi": ""
    },
    {
      "text": "Manolis Mavrikis. 2008. Data-driven modelling of students' interactions in an ILE. In Educational Data Mining 2008.",
      "doi": ""
    },
    {
      "text": "Loredana Mihalca, Ron JCM Salden, Gemma Corbalan, Fred Paas, and Mircea Miclea. 2011. Efectiveness of cognitive-load based adaptive instruction in genetics education. Computers in Human Behavior 27, 1 (2011), 82--88.  ",
      "doi": "10.1016/j.chb.2010.05.027"
    },
    {
      "text": "Briana B. Morrison, Brian Dorn, and Mark Guzdial. 2014. Measuring cognitive load in introductory CS: adaptation of an instrument. In Proceedings of the tenth annual conference on International computing education research. ACM, 131--138.  ",
      "doi": "10.1145/2632320.2632348"
    },
    {
      "text": "Fred Paas, Alexander Renkl, and John Sweller. 2003. Cognitive load theory and instructional design: Recent developments. Educational psychologist 38, 1 (2003), 1--4.",
      "doi": ""
    },
    {
      "text": "Fred Paas, Juhani E Tuovinen, Huib Tabbers, and Pascal WM Van Gerven. 2003. Cognitive load measurement as a means to advance cognitive load theory. Educational psychologist 38, 1 (2003), 63--71.",
      "doi": ""
    },
    {
      "text": "Fred GWC Paas, Jeroen JG Van Merrienboer, and Jos J Adam. 1994. Measurement of cognitive load in instructional research. Perceptual and motor skills 79, 1 (1994), 419--430.",
      "doi": ""
    },
    {
      "text": "Zachary A Pardos, Ryan SJD Baker, Maria OCZ San Pedro, Sujith M Gowda, and Supreeth M Gowda. 2013. Afective states and state tests: Investigating how afect throughout the school year predicts end of year learning outcomes. In Proceedings of the Third International Conference on Learning Analytics and Knowledge. ACM, 117--124.  ",
      "doi": "10.1145/2460296.2460320"
    },
    {
      "text": "Dale Parsons and Patricia Haden. 2006. Parson's programming puzzles: a fun and efective learning tool for frst programming courses. In Kelleher and Hnin. Proceedings of the 8th Australasian Conference on Computing EducationVolume 52. Australian Computer Society, Inc., 157--163. ",
      "doi": "10.5555/1151869.1151890"
    },
    {
      "text": "Thomas W Price, Yihuan Dong, and Dragan Lipovac. 2017. iSnap: towards intelligent tutoring in novice programming environments. In Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education. ACM, 483--488.  ",
      "doi": "10.1145/3017680.3017762"
    },
    {
      "text": "Stephen K. Reed, Alexandra Dempster, and Michael Ettinger. 1985. Usefulness of analogous solutions for solving algebra word problems. Journal of Experimental Psychology: Learning, Memory, and Cognition 11, 1 (1985), 106.",
      "doi": ""
    },
    {
      "text": "Brian J Reiser, John R Anderson, and Robert G Farrell. 1985. Dynamic Student Modelling in an Intelligent Tutor for LISP Programming.. In IJCAI, Vol. 85. 8--14. ",
      "doi": "10.5555/1625135.1625137"
    },
    {
      "text": "Alexander Renkl. 1997. Learning from worked-out examples: A study on individual diferences. Cognitive science 21, 1 (1997), 1--29.",
      "doi": ""
    },
    {
      "text": "Alexander Renkl, Robin Stark, Hans Gruber, and Heinz Mandl. 1998. Learning from worked-out examples: The efects of example variability and elicited self-explanations. Contemporary educational psychology 23, 1 (1998), 90--108.",
      "doi": ""
    },
    {
      "text": "Cristóbal Romero, Sebastián Ventura, Amelia Zafra, and Paul De Bra. 2009. Applying Web usage mining for personalizing hyperlinks in Web-based adaptive educational systems. Computers & Education 53, 3 (2009), 828--840.  ",
      "doi": "10.1016/j.compedu.2009.05.003"
    },
    {
      "text": "Vicente-Arturo Romero-Zaldivar, Abelardo Pardo, Daniel Burgos, and Carlos Delgado Kloos. 2012. Monitoring student progress using virtual appliances: A case study. Computers & Education 58, 4 (2012), 1058-- 1067.  ",
      "doi": "10.1016/j.compedu.2011.12.003"
    },
    {
      "text": "Ron JCM Salden, Fred Paas, Nick J Broers, and Jeroen JG Van Merrienboer. 2004. Mental efort and performance as determinants for the dynamic selection of learning tasks in air trafc control training. Instructional science 32, 1--2 (2004), 153--172.",
      "doi": ""
    },
    {
      "text": "Jesse Schell. 2014. The Art of Game Design: A book of lenses. AK Peters/CRC Press. ",
      "doi": "10.5555/3006351"
    },
    {
      "text": "Elliot M Soloway, Beverly Woolf, Eric Rubin, and Paul Barth. 1981. Meno-ii: An intelligent tutoring system for novice programmers. In Proceedings of the 7th international joint conference on Artifcial intelligenceVolume 2. Morgan Kaufmann Publishers Inc., 975--977. ",
      "doi": "10.5555/1623264.1623339"
    },
    {
      "text": "Jun-Ming Su, Shian-Shyong Tseng, Wei Wang, Jui-Feng Weng, JinTan David Yang, Wen-Nung Tsai, and others. 2006. Learning portfolio analysis and mining for SCORM compliant environment. Educational Technology & Society 9, 1 (2006), 262--275.",
      "doi": ""
    },
    {
      "text": "John Sweller. 1988. Cognitive load during problem solving: Efects on learning. Cognitive science 12, 2 (1988), 257--285.",
      "doi": ""
    },
    {
      "text": "John Sweller, Paul Ayres, and Slava Kalyuga. 2011. Measuring cognitive load. In Cognitive load theory. Springer, 71--85.",
      "doi": ""
    },
    {
      "text": "Rohani A. Tarmizi and John Sweller. 1988. Guidance during mathematical problem solving. Journal of educational psychology 80, 4 (1988), 424.",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merrienboer and Hein PM Krammer. 1990. The\" completion strategy\" in programming instruction: Theoretical and empirical support. Research on instruction: Design and efects (1990), 45--61.",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merrienboer and John Sweller. 2005. Cognitive load theory and complex learning: Recent developments and future directions. Educational psychology review 17, 2 (2005), 147--177.",
      "doi": ""
    },
    {
      "text": "Mark Ward and John Sweller. 1990. Structuring efective worked examples. Cognition and instruction 7, 1 (1990), 1--39.",
      "doi": ""
    },
    {
      "text": "A. Yan, M. J. Lee, and A. J. Ko. 2017. Predicting abandonment in online coding tutorials. In 2017 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). 191--199.",
      "doi": ""
    }
  ]
}