{
  "doi": "10.1145/3290605.3300306",
  "title": "CodeGazer: Making Code Navigation Easy and Natural With Gaze Input",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Navigating source code, an activity common in software development, is time consuming and in need of improvement. We present CodeGazer, a prototype for source code navigation using eye gaze for common navigation functions. These functions include actions such as \"Go to Definition'' and \"Find All Usages'' of an identifier, navigate to files and methods, move back and forth between visited points in code and scrolling. We present user study results showing that many users liked and even preferred the gaze-based navigation, in particular the \"Go to Definition'' function. Gaze-based navigation is also holding up well in completion time when compared to traditional methods. We discuss how eye gaze can be integrated into traditional mouse & keyboard applications in order to make \"look up'' tasks more natural.",
  "tags": [
    "source code navigation",
    "eye gaze tracking",
    "integrated development environment (ide)",
    "actigaze"
  ],
  "authors": [
    {
      "name": "Asma Shakil",
      "institution": "Media Design School & University of Auckland, Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366921",
      "orcid": "missing"
    },
    {
      "name": "Christof Lutteroth",
      "institution": "University of Bath & University of Auckland, Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100238140",
      "orcid": "0000-0003-0634-7569"
    },
    {
      "name": "Gerald Weber",
      "institution": "University of Auckland, Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100649512",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining what individual SUS scores mean: Adding an adjective rating scale. Journal of Usability Studies 4, 3 (2009), 114--123. ",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Aaron Bangor, Philip T Kortum, and James T Miller. 2008. An empirical evaluation of the system usability scale. Intl. Journal of Human-- Computer Interaction 24, 6 (2008), 574--594.",
      "doi": ""
    },
    {
      "text": "Lonni Besançon, Paul Issartel, Mehdi Ammi, and Tobias Isenberg. 2017. Mouse, tactile, and tangible input for 3D manipulation. In CHI Conference on Human Factors in Computing Systems. ACM, 4727--4740.  ",
      "doi": "10.1145/3025453.3025863"
    },
    {
      "text": "Andrew Bragdon, Robert Zeleznik, Steven P Reiss, Suman Karumuri, William Cheung, Joshua Kaplan, Christopher Coleman, Ferdi Adeputra, and Joseph J LaViola Jr. 2010. Code bubbles: a working set-based interface for code understanding and maintenance. In CHI Conference on Human Factors in Computing Systems. ACM, 2503--2512.  ",
      "doi": "10.1145/1753326.1753706"
    },
    {
      "text": "Yiu-ming Cheung and Qinmu Peng. 2015. Eye gaze tracking with a web camera in a desktop environment. IEEE Transactions on HumanMachine Systems 45, 4 (2015), 419--430.",
      "doi": ""
    },
    {
      "text": "Heiko Drewes and Albrecht Schmidt. 2007. Interacting with the computer using gaze gestures. In IFIP Conference on Human-Computer Interaction (INTERACT). Springer, 475--488. ",
      "doi": "10.5555/1778331.1778385"
    },
    {
      "text": "Len Erlikh. 2000. Leveraging legacy system dollars for e-business. IT Professional 2, 3 (2000), 17--23.  ",
      "doi": "10.1109/6294.846201"
    },
    {
      "text": "Hartmut Glücker, Felix Raab, Florian Echtler, and Christian Wolff. 2014. EyeDE: gaze-enhanced software development environments. In CHI Extended Abstracts on Human Factors in Computing Systems. ACM, 1555--1560.  ",
      "doi": "10.1145/2559206.2581217"
    },
    {
      "text": "Dan Witzner Hansen, David JC MacKay, John Paulin Hansen, and Mads Nielsen. 2004. Eye tracking off the shelf. In Symposium on Eye Tracking Research & Applications. ACM, 58--58.  ",
      "doi": "10.1145/968363.968375"
    },
    {
      "text": "Dan Witzner Hansen and Arthur EC Pece. 2005. Eye tracking in the wild. Computer Vision and Image Understanding 98, 1 (2005), 155--181. ",
      "doi": "10.5555/1061935.1649098"
    },
    {
      "text": "Dan Witzner Hansen, Henrik HT Skovsgaard, John Paulin Hansen, and Emilie Møllenbach. 2008. Noise tolerant selection by gaze-controlled pan and zoom in 3D. In Symposium on Eye Tracking Research & Applications. ACM, 205--212.  ",
      "doi": "10.1145/1344471.1344521"
    },
    {
      "text": "John Paulin Hansen, Anders Sewerin Johansen, Dan Witzner Hansen, Kenji Itoh, and Satoru Mashino. 2003. Command without a click: Dwell time typing by mouse and gaze selections. In IFIP Conference on Human-Computer Interaction (INTERACT). 121--128.",
      "doi": ""
    },
    {
      "text": "Tobii Inc. 2018. Tobii Eye Trackers For PC Gaming - 4C Plus Alienware, Acer, MSI. https://tobiigaming.com/products/ {Online; accessed 15February-2018}.",
      "doi": ""
    },
    {
      "text": "Toshiya Isomoto, Toshiyuki Ando, Buntarou Shizuki, and Shin Takahashi. 2018. Dwell time reduction technique using Fitts' law for gazebased target acquisition. In Symposium on Eye Tracking Research & Applications. ACM, 26.  ",
      "doi": "10.1145/3204493.3204532"
    },
    {
      "text": "Howell Istance, Aulikki Hyrskykari, Stephen Vickers, and Thiago Chaves. 2009. For your eyes only: Controlling 3d online games by eyegaze. In IFIP Conference on Human-Computer Interaction (INTERACT). Springer, 314--327.  ",
      "doi": "10.1007/978-3-642-03655-2_36"
    },
    {
      "text": "Rob Jacob and Sophie Stellmach. 2016. What you look at is what you get: gaze-based user interfaces. Interactions 23, 5 (2016), 62--65.  ",
      "doi": "10.1145/2978577"
    },
    {
      "text": "Robert JK Jacob. 1991. The use of eye movements in human-computer interaction techniques: what you look at is what you get. ACM Transactions on Information Systems (TOIS) 9, 2 (1991), 152--169.  ",
      "doi": "10.1145/123078.128728"
    },
    {
      "text": "JetBrains. 2017. IntelliJ IDEA the Java IDE. https://www.jetbrains. com/idea/ {Online; accessed 9-January-2017}.",
      "doi": ""
    },
    {
      "text": "Bonnie E John and David E Kieras. 1996. The GOMS family of user interface analysis techniques: comparison and contrast. ACM Transactions on Computer-Human Interaction (TOCHI) 3, 4 (1996), 320--351.  ",
      "doi": "10.1145/235833.236054"
    },
    {
      "text": "Andrew J Ko, Htet Htet Aung, and Brad A Myers. 2005. Eliciting design requirements for maintenance-oriented IDEs: a detailed study of corrective and perfective maintenance tasks. In International Conference on Software Engineering (ICSE). IEEE, 126--135.  ",
      "doi": "10.1145/1062455.1062492"
    },
    {
      "text": "Andrew J Ko, Thomas D Latoza, and Margaret M Burnett. 2015. A practical guide to controlled experiments of software engineering tools with human participants. Empirical Software Engineering 20, 1 (2015), 110--141.  ",
      "doi": "10.1007/s10664-013-9279-3"
    },
    {
      "text": "Andrew J Ko, Brad A Myers, Michael J Coblenz, and Htet Htet Aung. 2006. An exploratory study of how developers seek, relate, and collect relevant information during software maintenance tasks. IEEE Transactions on Software Engineering 32, 12 (2006), 971--987.  ",
      "doi": "10.1109/TSE.2006.116"
    },
    {
      "text": "Sai Anirudh Kondaveeti, Sandeep Vidyapu, and Samit Bhattacharya. 2016. Improved Gaze Likelihood Based Web Browsing. In Indian Conference on Human Computer Interaction (IHCI). ACM, New York, NY, USA, 84--89.  ",
      "doi": "10.1145/3014362.3014371"
    },
    {
      "text": "Per Ola Kristensson and Keith Vertanen. 2012. The potential of dwellfree eye-typing for fast assistive gaze communication. In Symposium on Eye Tracking Research & Applications. ACM, 241--244.  ",
      "doi": "10.1145/2168556.2168605"
    },
    {
      "text": "Manu Kumar and Terry Winograd. 2007. GUIDe: gaze-enhanced UI design. In CHI Extended Abstracts on Human Factors in Computing Systems. ACM, 1977--1982.  ",
      "doi": "10.1145/1240866.1240935"
    },
    {
      "text": "Manu Kumar, Terry Winograd, Terry Winograd, and Andreas Paepcke. 2007. Gaze-enhanced scrolling techniques. In CHI Extended Abstracts on Human Factors in Computing Systems. ACM, 2531--2536.  ",
      "doi": "10.1145/1240866.1241036"
    },
    {
      "text": "Andrew Kurauchi, Wenxin Feng, Ajjen Joshi, Carlos Morimoto, and Margrit Betke. 2016. EyeSwipe: dwell-free text entry using gaze paths. In CHI Conference on Human Factors in Computing Systems. ACM, 1952--1956.  ",
      "doi": "10.1145/2858036.2858335"
    },
    {
      "text": "Joseph Lawrance, Rachel Bellamy, and Margaret Burnett. 2007. Scents in programs: does information foraging theory apply to program maintenance?. In Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, 15--22.  ",
      "doi": "10.1109/VLHCC.2007.48"
    },
    {
      "text": "Dongheng Li, Jason Babcock, and Derrick J Parkhurst. 2006. openEyes: a low-cost head-mounted eye-tracking solution. In Symposium on Eye Tracking Research & Applications. ACM, 95--100.  ",
      "doi": "10.1145/1117309.1117350"
    },
    {
      "text": "Christof Lutteroth, Moiz Penkar, and Gerald Weber. 2015. Gaze vs. Mouse: A Fast and Accurate Gaze-Only Click Alternative. In Symposium on User Interface Software & Technology (UIST). ACM, 385--394.  ",
      "doi": "10.1145/2807442.2807461"
    },
    {
      "text": "Päivi Majaranta, Ulla-Kaija Ahola, and Oleg Spakov. 2009. Fast gaze typing with an adjustable dwell time. In CHI Conference on Human Factors in Computing Systems. ACM, 357--360.  ",
      "doi": "10.1145/1518701.1518758"
    },
    {
      "text": "Päivi Majaranta and Kari-Jouko Räihä. 2002. Twenty years of eye typing: systems and design issues. In Symposium on Eye Tracking Research & Applications. ACM, 15--22.  ",
      "doi": "10.1145/507072.507076"
    },
    {
      "text": "Roberto Minelli, Andrea Mocci, and Michele Lanza. 2015. I know what you did last summer: an investigation of how developers spend their time. In International Conference on Program Comprehension. IEEE, 25--35. ",
      "doi": "10.5555/2820282.2820289"
    },
    {
      "text": "Martez E Mott, Shane Williams, Jacob O Wobbrock, and Meredith Ringel Morris. 2017. Improving dwell-based gaze typing with dynamic, cascading dwell times. In CHI Conference on Human Factors in Computing Systems. ACM, 2558--2570.  ",
      "doi": "10.1145/3025453.3025517"
    },
    {
      "text": "Gail C Murphy, Mik Kersten, and Leah Findlater. 2006. How are Java software developers using the Elipse IDE? IEEE Software 23, 4 (2006), 76--83.  ",
      "doi": "10.1109/MS.2006.105"
    },
    {
      "text": "Brad A Myers, Andrew J Ko, Thomas D LaToza, and YoungSeok Yoon. 2016. Programmers are users too: human-centered methods for improving programming tools. Computer 49, 7 (2016), 44--52.",
      "doi": "10.1109/MC.2016.200"
    },
    {
      "text": "Aanand Nayyar, Utkarsh Dwivedi, Karan Ahuja, Nitendra Rajput, Seema Nagar, and Kuntal Dey. 2017. OptiDwell: intelligent adjustment of dwell click time. In International Conference on Intelligent User Interfaces (IUI). ACM, 193--204.  ",
      "doi": "10.1145/3025171.3025202"
    },
    {
      "text": "Jakob Nielsen. 1994. Usability engineering. Elsevier.",
      "doi": "10.5555/529793"
    },
    {
      "text": "Abdul Penkar, Christof Lutteroth, and Gerald Weber. 2013. Eyes only: navigating hypertext with gaze. In IFIP Conference on Human-Computer Interaction (INTERACT). Springer, 153--169.",
      "doi": ""
    },
    {
      "text": "Abdul Moiz Penkar, Christof Lutteroth, and Gerald Weber. 2012. Designing for the eye: design parameters for dwell in gaze interaction. In Australian Computer-Human Interaction Conference (OzCHI). ACM, 479--488.  ",
      "doi": "10.1145/2414536.2414609"
    },
    {
      "text": "David Piorkowski, Scott Fleming, Christopher Scaffidi, Christopher Bogart, Margaret Burnett, Bonnie John, Rachel Bellamy, and Calvin Swart. 2012. Reactive information foraging: an empirical investigation of theory-based recommender systems for programmers. In CHI Conference on Human Factors in Computing Systems. ACM, 1471--1480.  ",
      "doi": "10.1145/2207676.2208608"
    },
    {
      "text": "David J Piorkowski, Scott D Fleming, Irwin Kwan, Margaret M Burnett, Christopher Scaffidi, Rachel KE Bellamy, and Joshua Jordahl. 2013. The whats and hows of programmers' foraging diets. In CHI Conference on Human Factors in Computing Systems. ACM, 3063--3072.  ",
      "doi": "10.1145/2470654.2466418"
    },
    {
      "text": "Stevche Radevski, Hideaki Hata, and Kenichi Matsumoto. 2016. EyeNav: gaze-based code navigation. In Nordic Conference on HumanComputer Interaction. ACM, 89.  ",
      "doi": "10.1145/2971485.2996724"
    },
    {
      "text": "Javier San Agustin, Henrik Skovsgaard, Emilie Mollenbach, Maria Barret, Martin Tall, Dan Witzner Hansen, and John Paulin Hansen. 2010. Evaluation of a low-cost open-source gaze tracker. In Symposium on Eye-Tracking Research & Applications. ACM, 77--80.  ",
      "doi": "10.1145/1743666.1743685"
    },
    {
      "text": "Simon Schenk, Marc Dreiser, Gerhard Rigoll, and Michael Dorr. 2017. GazeEverywhere: enabling gaze-only user interaction on an unmodified desktop PC in everyday scenarios. In CHI Conference on Human Factors in Computing Systems. ACM, 3034--3044.  ",
      "doi": "10.1145/3025453.3025455"
    },
    {
      "text": "Laura Sesma, Arantxa Villanueva, and Rafael Cabeza. 2012. Evaluation of pupil center-eye corner vector for gaze estimation using a web cam. In Symposium on Eye Tracking Research & Applications. ACM, 217--220.  ",
      "doi": "10.1145/2168556.2168598"
    },
    {
      "text": "Claude M Steele and Joshua Aronson. 1995. Stereotype threat and the intellectual test performance of African Americans. Journal of Personality and Social Psychology 69, 5 (1995), 797.",
      "doi": ""
    },
    {
      "text": "Ken Neth Yeoh, Christof Lutteroth, and Gerald Weber. 2015. Eyes and Keys: an evaluation of click alternatives combining gaze and keyboard. In IFIP Conference on Human-Computer Interaction (INTERACT). Springer.",
      "doi": ""
    }
  ]
}