{
  "doi": "10.1145/3290605.3300425",
  "title": "Understanding Trust, Transportation, and Accessibility through Ridesharing",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "Relatively few studies of accessibility and transportation for people with vision impairments have investigated forms of transportation besides public transportation and walking. To develop a more nuanced understanding of this context, we turn to ridesharing, an increasingly used mode of transportation. We interviewed 16 visually-impaired individuals about their active use of ridesharing services like Uber and Lyft. Our findings show that, while people with vision impairments value independence, ridesharing involves building trust across a complex network of stakeholders and technologies. This data is used to start a discussion on how other systems can facilitate trust for people with vision impairments by considering the role of conversation, affordances of system incentives, and increased agency.",
  "authors": [
    {
      "name": "Robin N. Brewer",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81467645148/rel-imgonly/81467645148.jpg",
      "acmid": "81467645148",
      "orcid": "0000-0003-3790-5834"
    },
    {
      "name": "Vaishnav Kameswaran",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659027270",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Voice-based assessments of trustworthiness, competence, and warmth in blind and sighted adults. Psychonomic Bulletin & Review 24, 3 (jun 2017), 856--862.",
      "doi": ""
    },
    {
      "text": "Abdolrahmani, A., Easley, W., Williams, M. A., Ronqillo, E., Branham, S., Chen, T., and Hurst, A. Not All Errors are Created Equal: Factors that Impact Acceptance of an Indoor Navigation Aid for the Blind. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '16 (New York, New York, USA, 2016), ACM Press, pp. 301--302.  ",
      "doi": "10.1145/2982142.2982210"
    },
    {
      "text": "Ahmed, S. I., Bidwell, N. J., Zade, H., Muralidhar, S. H., Dhareshwar, A., Karachiwala, B., Tandong, C. N., and O'Neill, J. Peer-topeer in the Workplace: A View from the Road. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2016), CHI '16, ACM, pp. 5063--5075.  ",
      "doi": "10.1145/2858036.2858393"
    },
    {
      "text": "Azenkot, S., Ladner, R. E., and Wobbrock, J. O. Smartphone haptic feedback for nonvisual wayfinding. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '11 (New York, New York, USA, 2011), ACM Press, p. 281.  ",
      "doi": "10.1145/2049536.2049607"
    },
    {
      "text": "Banovic, N., Franz, R. L., Truong, K. N., Mankoff, J., and Dey, A. K. Uncovering information needs for independent spatial learning for users who are visually impaired. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '13 (New York, New York, USA, 2013), ACM Press, pp. 1--8.  ",
      "doi": "10.1145/2513383.2513445"
    },
    {
      "text": "Bickmore, T., and Cassell, J. Relational agents: a model and implementation of building user trust. Proceedings of the SIGCHI conference on Human factors in computing systems (2001).  ",
      "doi": "10.1145/365024.365304"
    },
    {
      "text": "Bickmore, T.W., and Picard, R.W. Establishing and maintaining longterm human-computer relationships. ACM Transactions on Computer- Human Interaction (2005).  ",
      "doi": "10.1145/1067860.1067867"
    },
    {
      "text": "Bigham, J. et al. VizWiz: Nearly Real-time Answers to Visual Questions. In Proc of ACM UIST (New York, NY, 2010), ACM, pp. 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Brady, E. L., Zhong, Y., Morris, M. R., and Bigham, J. P. Investigating the appropriateness of social network question asking as a resource for blind users. In Proceedings of the 2013 conference on Computer supported cooperative work - CSCW '13 (2013).  ",
      "doi": "10.1145/2441776.2441915"
    },
    {
      "text": "Branham, S. M., Abdolrahmani, A., Easley, W., Scheuerman, M., Ronqillo, E., and Hurst, A. \"Is Someone There? Do They Have a Gun\": How Visual Information about Others Can Improve Personal Safety Management for Blind Individuals. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '17 (New York, New York, USA, 2017), ACM Press, pp. 260--269.  ",
      "doi": "10.1145/3132525.3132534"
    },
    {
      "text": "Brewer, R. N., and Kameswaran, V. Understanding the Power of Control in Autonomous Vehicles for People with Vision Impairment. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '18 (New York, New York, USA, 2018), ACM Press, pp. 185--197.  ",
      "doi": "10.1145/3234695.3236347"
    },
    {
      "text": "Brinkley, J., Posadas, B.,Woodward, J., and Gilbert, J. E. Opinions and preferences of blind and low vision consumers regarding selfdriving vehicles: Results of focus group discussions. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (New York, NY, USA, 2017), ASSETS '17, ACM, pp. 290-- 299.  ",
      "doi": "10.1145/3132525.3132532"
    },
    {
      "text": "Burton, M., Brady, E., and Brewer, R. Crowdsourcing subjective fashion advice using VizWiz: challenges and opportunities. Proceedings of the 14th. .. (2012).  ",
      "doi": "10.1145/2384916.2384941"
    },
    {
      "text": "Campbell, M., Bennett, C., Bonnar, C., and Borning, A. Where's my bus stop?: supporting independence of blind transit riders with StopInfo. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility - ASSETS '14 (New York, New York, USA, 2014), ACM Press, pp. 11--18.  ",
      "doi": "10.1145/2661334.2661378"
    },
    {
      "text": "Cassell, J., and Bickmore, T. External manifestations of trustworthiness in the interface. Communications of the ACM (2000).  ",
      "doi": "10.1145/355112.355123"
    },
    {
      "text": "Chaube, V., Kavanaugh, A. L., and Perez-Quinones, M. A. Leveraging Social Networks to Embed Trust in Rideshare Programs. In 43rd Hawaii International Conference on System Sciences (2010), IEEE.  ",
      "doi": "10.1109/HICSS.2010.255"
    },
    {
      "text": "Danielsen, C. National Federation of the Blind Launches Ridesharing Testing Program. Tech. rep., National Federation of the Blind, 2017.",
      "doi": ""
    },
    {
      "text": "Dillahunt, T. R., Kameswaran, V., Li, L., and Rosenblat, T. Uncovering the Values and Constraints of Real-time Ridesharing for Low-resource Populations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (New York, New York, USA, 2017), ACM Press, pp. 2757--2769.  ",
      "doi": "10.1145/3025453.3025470"
    },
    {
      "text": "Dillahunt, T. R., and Malone, A. R. The Promise of the Sharing Economy among Disadvantaged Communities. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15 (2015), 2285--2294.  ",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Easley, W., Williams, M. A., Abdolrahmani, A., Galbraith, C., Branham, S. M., Hurst, A., and Kane, S. K. Let's get lost: Exploring social norms in predominately blind environments. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (New York, NY, USA, 2016), CHI EA '16, ACM, pp. 2034--2040.  ",
      "doi": "10.1145/2851581.2892470"
    },
    {
      "text": "Ferrari, C., Vecchi, T., Merabet, L., and Cattaneo, Z. Blindness and social trust: The effect of early visual deprivation on judgments of trustworthiness. Consciousness and Cognition 55 (oct 2017), 156--164.",
      "doi": ""
    },
    {
      "text": "Fiannaca, A., Apostolopoulous, I., and Folmer, E. Headlock. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility - ASSETS '14 (New York, New York, USA, 2014), ACM Press, pp. 19--26.  ",
      "doi": "10.1145/2661334.2661453"
    },
    {
      "text": "Flores, G. H., and Manduchi, R. A Public Transit Assistant for Blind Bus Passengers. IEEE Pervasive Computing 17, 1 (jan 2018), 49--59.  ",
      "doi": "10.1109/MPRV.2018.011591061"
    },
    {
      "text": "Fogg, B. J., and Tseng, H. The elements of computer credibility. In Proceedings of the SIGCHI conference on Human factors in computing systems the CHI is the limit - CHI '99 (1999).  ",
      "doi": "10.1145/302979.303001"
    },
    {
      "text": "Forlizzi, J., Barley,W. C., and Seder, T. Where should i turn: moving from individual to collaborative navigation strategies to inform the interaction design of future navigation systems. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10 (New York, New York, USA, 2010), ACM Press, p. 1261.  ",
      "doi": "10.1145/1753326.1753516"
    },
    {
      "text": "Glöss, M., McGregor, M., and Brown, B. Designing for labour: Uber and the on-demand mobile workforce. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2016), CHI '16, ACM, pp. 1632--1643.  ",
      "doi": "10.1145/2858036.2858476"
    },
    {
      "text": "Gridling, N., Meschtscherjakov, A., and Tscheligi, M. I need help!: Exploring collaboration in the car. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work Companion (New York, NY, USA, 2012), CSCW '12, ACM, pp. 87--90.  ",
      "doi": "10.1145/2141512.2141549"
    },
    {
      "text": "Guentert, M. Improving public transit accessibility for blind riders. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '11 (New York, New York, USA, 2011), ACM Press, p. 317.  ",
      "doi": "10.1145/2049536.2049626"
    },
    {
      "text": "Guerreiro, J., Ahmetovic, D., Kitani, K. M., and Asakawa, C. Virtual Navigation for Blind People: Building Sequential Representations of the Real-World. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '17 (New York, New York, USA, 2017), ACM Press, pp. 280--289.  ",
      "doi": "10.1145/3132525.3132545"
    },
    {
      "text": "Guy, R., and Truong, K. CrossingGuard: exploring information content in navigation aids for visually impaired pedestrians. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12 (New York, New York, USA, 2012), ACM Press, p. 405.  ",
      "doi": "10.1145/2207676.2207733"
    },
    {
      "text": "Hara, K., Froehlich, J. E., Azenkot, S., Campbell, M., Bennett, C. L., Le, V., Pannella, S., Moore, R., Minckler, K., and Ng, R. H. Improving Public Transit Accessibility for Blind Riders by Crowdsourcing Bus Stop Landmark Locations with Google Street View: An Extended Analysis. ACM Transactions on Accessible Computing 6, 2 (mar 2015), 1--23.  ",
      "doi": "10.1145/2717513"
    },
    {
      "text": "Harrington, N., Antuna, L., and Coady, Y. ABLE Transit: A Mobile Application for Visually Impaired Users to Navigate Public Transit. In 2012 Seventh International Conference on Broadband, Wireless Computing, Communication and Applications (nov 2012), IEEE, pp. 402--407.  ",
      "doi": "10.1109/BWCCA.2012.72"
    },
    {
      "text": "Kameswaran, V., Cameron, L., and Dillahunt, T. R. Support for social and cultural capital development in real-time ridesharing services. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2018), CHI '18, ACM, pp. 342:1--342:12.  ",
      "doi": "10.1145/3173574.3173916"
    },
    {
      "text": "Kameswaran, V., Gupta, J., Pal, J., O'Modhrain, S., Veinot, T. C., Brewer, R., Parameshwar, A., Y, V., and O'Neill, J. 'we can go anywhere': Understanding independence through a case study of ridehailing use by people with visual impairments in metropolitan india. Proc. ACM Hum.-Comput. Interact. 2, CSCW (Nov. 2018), 85:1--85:24.  ",
      "doi": "10.1145/3274354"
    },
    {
      "text": "Kane, S. K., Jayant, C., Wobbrock, J. O., and Ladner, R. E. Freedom to roam: A study of mobile device adoption and accessibility for people with visual and motor disabilities. In Proceedings of the 11th International ACM SIGACCESS Conference on Computers and Accessibility (New York, NY, USA, 2009), Assets '09, ACM, pp. 115--122.  ",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "Lazar, A., Edasis, C., and Piper, A. M. Supporting People with Dementia in Digital Social Sharing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (New York, New York, USA, 2017), ACM Press, pp. 2149--2162.  ",
      "doi": "10.1145/3025453.3025586"
    },
    {
      "text": "Lindley, S. E., Harper, R., and Sellen, A. Desiring to be in touch in a changing communications landscape. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09 (New York, New York, USA, 2009), ACM Press, p. 1693.  ",
      "doi": "10.1145/1518701.1518962"
    },
    {
      "text": "MacLeod, H., Bennett, C. L., Morris, M. R., and Cutrell, E. Understanding blind people's experiences with computer-generated captions of social media images. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2017), CHI '17, ACM, pp. 5988--5999.  ",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "Meurer, J., Stein, M., Randall, D., Rohde, M., and Wulf, V. Social Dependency and Mobile Autonomy Supporting Older Adults Mobility with Ridesharing ICT.",
      "doi": ""
    },
    {
      "text": "Oleszkiewicz, A., Pisanski, K., and Sorokowska, A. Does blindness influence trust? A comparative study on social trust among blind and sighted adults. Personality and Individual Differences 111 (jun 2017), 238--241.",
      "doi": ""
    },
    {
      "text": "Panëels, S. A., Olmos, A., Blum, J. R., and Cooperstock, J. R. Listen to it yourself!: evaluating usability of what's around me? for the blind. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13 (New York, New York, USA, 2013), ACM Press, p. 2107.  ",
      "doi": "10.1145/2470654.2481290"
    },
    {
      "text": "Putnam, R. D. Bowling alone: America's declining social capital. In Culture and politics. Springer, 2000, pp. 223--234.",
      "doi": ""
    },
    {
      "text": "Raval, N., and Dourish, P. Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing - CSCW '16 (2016), 97--107.  ",
      "doi": "10.1145/2818048.2820026"
    },
    {
      "text": "Saldaña, J. The coding manual for qualitative researchers. Sage, 2015.",
      "doi": ""
    },
    {
      "text": "Scheuerman, M. K., Easley, W., Abdolrahmani, A., Hurst, A., and Branham, S. Learning the Language: The Importance of Studying Written Directions in Designing Navigational Technologies for the Blind. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '17 (New York, New York, USA, 2017), ACM Press, pp. 2922--2928.  ",
      "doi": "10.1145/3027063.3053260"
    },
    {
      "text": "Szpiro, S. F. A., Hashash, S., Zhao, Y., and Azenkot, S. How People with Low Vision Access Computing Devices. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS '16 (New York, New York, USA, 2016), ACM Press, pp. 171--180.  ",
      "doi": "10.1145/2982142.2982168"
    },
    {
      "text": "Wang, Y., Winter, S., and Ronald, N. How much is trust: The cost and benefit of ridesharing with friends. Computers, Environment and Urban Systems 65 (2017), 103--112.",
      "doi": ""
    },
    {
      "text": "Williams, M. A., Hurst, A., and Kane, S. K. \"pray before you step out\": Describing personal and situational blind navigation behaviors. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (New York, NY, USA, 2013), ASSETS '13, ACM, pp. 28:1--28:8.  ",
      "doi": "10.1145/2513383.2513449"
    },
    {
      "text": "Wu, S., Wieland, J., Farivar, O., and Schiller, J. Automatic Alt-text. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17 (New York, New York, USA, 2017), ACM Press, pp. 1180--1192.  ",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Yang, R., Park, S., Mishra, S. R., Hong, Z., Newsom, C., Joo, H., Hofer, E., and Newman, M. W. Supporting spatial awareness and independent wayfinding for pedestrians with visual impairments. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility - ASSETS '11 (2011), p. 27.  ",
      "doi": "10.1145/2049536.2049544"
    },
    {
      "text": "Zhao, Y., Wu, S., Reynolds, L., and Azenkot, S. The Effect of Computer-Generated Descriptions on Photo-Sharing Experiences of People with Visual Impairments. Proceedings of the ACM on Human- Computer Interaction 1, CSCW (dec 2017), 1--22.  ",
      "doi": "10.1145/3134756"
    }
  ]
}