{
  "doi": "10.1145/3290605.3300722",
  "title": "StoryBlocks: A Tangible Programming Game To Create Accessible Audio Stories",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Block-based programming languages can support novice programmers through features such as simplified code syntax and user-friendly libraries. However, most block-based programming languages are highly visual, which makes them inaccessible to blind and visually impaired students. To address the inaccessibility of block-based languages, we introduce StoryBlocks, a tangible block-based game that enables blind programmers to learn basic programming concepts by creating audio stories. In this paper, we document the design of StoryBlocks and report on a series of design activities with groups of teachers, Braille experts, and students. Participants in our design sessions worked together to create accessible stories, and their feedback offers insights for the future development of accessible, tangible programming tools.",
  "authors": [
    {
      "name": "Varsha Koushik",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659080665",
      "orcid": "0000-0002-2088-1963"
    },
    {
      "name": "Darren Guinness",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-87959108057/rel-imgonly/darrennao.jpeg",
      "acmid": "87959108057",
      "orcid": "missing"
    },
    {
      "name": "Shaun K. Kane",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81329489903/rel-imgonly/kane-headshot.jpg",
      "acmid": "81329489903",
      "orcid": "0000-0002-0276-9417"
    }
  ],
  "references": [
    {
      "text": "Khaled Albusays and Stephanie Ludi. 2016. Eliciting Programming Challenges Faced by Developers with Visual Impairments: Exploratory Study. In Proceedings of the 9th International Workshop on Cooperative and Human Aspects of Software Engineering (CHASE '16), 82--85.  ",
      "doi": "10.1145/2897586.2897616"
    },
    {
      "text": "Catherine M. Baker, Lauren R. Milne, and Richard E. Ladner. 2015. StructJumper: A Tool to Help Blind Programmers Navigate and Understand the Structure of Code. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 3043--3052.  ",
      "doi": "10.1145/2702123.2702589"
    },
    {
      "text": "Ayah Bdeir. 2009. Electronics as material: littleBits. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI '09). ACM, New York, NY, USA, 397--400.  ",
      "doi": "10.1145/1517664.1517743"
    },
    {
      "text": "Theresa Beaubouef and John Mason. 2005. Why the high attrition rate for computer science students: some thoughts and observations. SIGCSE Bull. 37, 2 (June 2005), 103--106.  ",
      "doi": "10.1145/1083431.1083474"
    },
    {
      "text": "Jeffrey P. Bigham, Maxwell B. Aller, Jeremy T. Brudvik, Jessica O. Leung, Lindsay A. Yazzolino, and Richard E. Ladner. 2008. Inspiring Blind High School Students to Pursue Computer Science with Instant Messaging Chatbots. In Proceedings of the 39th SIGCSE Technical Symposium on Computer Science Education (SIGCSE '08), 449--453.  ",
      "doi": "10.1145/1352135.1352287"
    },
    {
      "text": "Paulo Blikstein, Arnan Sipitakiat, Jayme Goldstein, João Wilbert, Maggie Johnson, Steve Vranakis, Zebedee Pedersen, and W. Carey. 2016. Project Bloks: designing a development platform for tangible programming for children. http://projectbloks.withgoogle.com/static/Project_Bloks_position_p aper_June_2016.pdf",
      "doi": ""
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. Collaborative Accessibility: How Blind and Sighted Companions Co-Create Accessible Home Spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2373--2382.  ",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Karen Brennan and Mitchel Resnick. 2012. New frameworks for studying and assessing the development of computational thinking. In (AERA 2012), 1--25. Retrieved September 18, 2017 from http://scratched.gse.harvard.edu/ct/files/AERA2012.pdf",
      "doi": ""
    },
    {
      "text": "Robin N. Brewer. 2018. Facilitating discussion and shared meaning: Rethinking co-design sessions with people with vision impairments. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '18). ACM, New York, NY, USA, 258--262.  ",
      "doi": "10.1145/3240925.3240981"
    },
    {
      "text": "Craig Brown and Amy Hurst. 2012. VizTouch: automatically generated tactile visualizations of coordinate spaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), Stephen N. Spencer (Ed.). ACM, New York, NY, USA, 131--138.  ",
      "doi": "10.1145/2148131.2148160"
    },
    {
      "text": "MapSense: Multi-Sensory Interactive Maps for Children Living with Visual Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 445--457.  ",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Erin Buehler, Stacy Branham, Abdullah Ali, Jeremy J. Chang, Megan Kelly Hofmann, Amy Hurst, and Shaun K. Kane. 2015. Sharing is Caring: Assistive Technology Designs on Thingiverse. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 525--534.  ",
      "doi": "10.1145/2702123.2702525"
    },
    {
      "text": "Christian, C. A., Nota, A., Grice, N. A., Sabbi, E., Shaheen, N., Greenfield, P., ... & de Mink, S. E. (2014, January). You Can Touch This! Bringing HST images to life as 3-D models. In American Astronomical Society Meeting Abstracts# 223 (Vol. 223).",
      "doi": ""
    },
    {
      "text": "Elise Deitrick, Joseph Sanford, and R. Benjamin Shapiro. 2014. BlockyTalky: A low-cost, extensible, open source, programmable, networked toolkit for tangible creation. Proceedings of Conference on Interaction Design for Children, Aarhus, Denmark.",
      "doi": ""
    },
    {
      "text": "Michael S. Horn and Robert J. K. Jacob. 2007. Tangible programming in the classroom with Tern. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). ACM, New York, NY, USA, 1965--1970.  ",
      "doi": "10.1145/1240866.1240933"
    },
    {
      "text": "Michael S. Horn, Erin Treacy Solovey, R. Jordan Crouser, and Robert J.K. Jacob. 2009. Comparing the use of tangible and graphical programming languages for informal science education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, NY, USA, 975--984.  ",
      "doi": "10.1145/1518701.1518851"
    },
    {
      "text": "Amy Hurst and Jasmine Tobias. 2011. Empowering individuals with do-it-yourself assistive technology. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '11). ACM, New York, NY, USA, 11--18.  ",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Felix Hu, Ariel Zekelman, Michael Horn, and Frances Judd. 2015. Strawbies: explorations in tangible programming. In Proceedings of the 14th International Conference on Interaction Design and Children (IDC '15). ACM, New York, NY, USA, 410--413.  ",
      "doi": "10.1145/2771839.2771866"
    },
    {
      "text": "L Johnson. (1996). The Braille Literacy Crisis for Children. Journal of Visual Impairment & Blindness, 90(3), 276--78.",
      "doi": ""
    },
    {
      "text": "Sergi Jordà, Günter Geiger, Marcos Alonso, and Martin Kaltenbrunner. 2007. The reacTable: exploring the synergy between live music performance and tabletop tangible interfaces. In Proceedings of the 1st international conference on Tangible and embedded interaction (TEI '07). ACM, New York, NY, USA, 139--146.  ",
      "doi": "10.1145/1226969.1226998"
    },
    {
      "text": "Shaun K. Kane and Jeffrey P. Bigham. 2014. Tracking @Stemxcomet: Teaching Programming to Blind Students via 3D Printing, Crisis Management, and All Twitter. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education (SIGCSE '14), 247--252.  ",
      "doi": "10.1145/2538862.2538975"
    },
    {
      "text": "Shaun K. Kane, Varsha Koushik, and Annika Muehlbradt. 2018. Bonk: accessible programming for accessible audio games. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18). ACM, New York, NY, USA, 132--142.  ",
      "doi": "10.1145/3202185.3202754"
    },
    {
      "text": "Filiz Kaleliolu. 2015. A new way of teaching programming skills to K-12 students: Code. org. Computers in Human Behavior, 52, 200--210.  ",
      "doi": "10.1016/j.chb.2015.05.047"
    },
    {
      "text": "Caitlin Kelleher. 2015. Looking Glass. In Proceedings of the 46th ACM Technical Symposium on Computer Science Education (SIGCSE '15). ACM, New York, NY, USA, 271--271.  ",
      "doi": "10.1145/2676723.2691873"
    },
    {
      "text": "Caitlin Kelleher and Randy Pausch. 2005. Lowering the barriers to programming: A taxonomy of programming environments and languages for novice programmers. ACM Comput. Surv. 37, 2 (June 2005), 83--137.  ",
      "doi": "10.1145/1089733.1089734"
    },
    {
      "text": "Varsha Koushik and Clayton Lewis. 2016. An Accessible Blocks Language: Work in Progress. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '16), 317--318.  ",
      "doi": "10.1145/2982142.2982150"
    },
    {
      "text": "Richard E. Ladner. 2015. Design for User Empowerment. interactions 22, 2: 24--29.  ",
      "doi": "10.1145/2723869"
    },
    {
      "text": "Richard E. Ladner and Andreas Stefik. 2017. AccessCSforall: Making Computer Science Accessible to K-12 Students in the United States. SIGACCESS Access. Comput., 118: 3--8.  ",
      "doi": "10.1145/3124144.3124145"
    },
    {
      "text": "Stephanie Ludi and Tom Reichlmayr. 2011. The use of robotics to promote computing to pre-college students with visual impairments. ACM Transactions on Computing Education (TOCE) 11, 3: 20.  ",
      "doi": "10.1145/2037276.2037284"
    },
    {
      "text": "Stephanie Ludi. 2015. Position paper: Towards making block-based programming accessible to blind users. IEEE Blocks and Beyond Workshop, 67--69.  ",
      "doi": "10.1109/BLOCKS.2015.7369005"
    },
    {
      "text": "Roberto Manduchi, Sri Kurniawan, Editors. 2012.Assistive technology for blindness and low vision. CRC Press.",
      "doi": ""
    },
    {
      "text": "Lauren R. Milne. 2017. Blocks4All: making block programming languages accessible for blind children. ACM SIGACCESS Accessibility and Computing, 117: 26--29.  ",
      "doi": "10.1145/3051519.3051525"
    },
    {
      "text": "T. V. Raman. 1996. Emacspeak-a speech interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '96), Michael J. Tauber (Ed.). ACM, New York, NY, USA, 66--71.  ",
      "doi": "10.1145/238386.238405"
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: programming for all. Communications of the ACM 52, 11: 60-- 67.  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Kimiko Ryokai, Michael Jongseon Lee, and Jonathan Micah Breitbart. 2009. Children's storytelling and programming with robotic characters. In Proceedings of the seventh ACM conference on Creativity and cognition (C&C '09). ACM, New York, NY, USA, 19--28.  ",
      "doi": "10.1145/1640233.1640240"
    },
    {
      "text": "Jaime Sánchez and Fernando Aguayo. 2005. Blind Learners Programming Through Audio. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05), 1769--1772.  ",
      "doi": "10.1145/1056808.1057018"
    },
    {
      "text": "Eric Schweikardt and Mark D. Gross. 2006. roBlocks: a robotic construction kit for mathematics and science education. In Proceedings of the 8th international conference on Multimodal interfaces (ICMI '06). ACM, New York, NY, USA, 72--75.  ",
      "doi": "10.1145/1180995.1181010"
    },
    {
      "text": "Andreas Stefik and Susanna Siebert. 2013. An Empirical Investigation into Programming Language Syntax. Trans. Comput. Educ. 13, 4: 19:1--19:40.  ",
      "doi": "10.1145/2534973"
    },
    {
      "text": "Anja Thieme, Cecily Morrison, Nicolas Villar, Martin Grayson, and Siân Lindley. 2017. Enabling Collaboration in Learning Computer Programing Inclusive of Children with Vision Impairments. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 739--752.  ",
      "doi": "10.1145/3064663.3064689"
    },
    {
      "text": "Linda L. Werner, Brian Hanks, and Charlie McDowell. 2004. Pairprogramming helps female computer science students. J. Educ. Resour. Comput. 4, 1, Article 4 (March 2004).  ",
      "doi": "10.1145/1060071.1060075"
    },
    {
      "text": "Michele A. Williams, Erin Buehler, Amy Hurst, and Shaun K. Kane. 2015. What not to wearable: using participatory workshops to explore wearable device form factors for blind users. In Proceedings of the 12th Web for Conference (W4A '15). ACM, New York, NY, USA, Article 31, 4 pages.  ",
      "doi": "10.1145/2745555.2746664"
    },
    {
      "text": "Michele A. Williams, Amy Hurst, and Shaun K. Kane. 2013. \"Pray before you step out\": describing personal and situational blind navigation behaviors. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS '13). ACM, New York, NY, USA,, Article 28, 8 pages.  ",
      "doi": "10.1145/2513383.2513449"
    },
    {
      "text": "Jeannette M. Wing. 2006. Computational thinking. Commun. ACM 49, 3 (March 2006), 33--35.  ",
      "doi": "10.1145/1118178.1118215"
    }
  ]
}