{
  "doi": "10.1145/3290605.3300543",
  "title": "Social Reflections on Fitness Tracking Data: A Study with Families in Low-SES Neighborhoods",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Wearable activity trackers can encourage physical activity (PA)-a behavior critical for preventing obesity and reducing the risks of chronic diseases. However, prior work has rarely explored how these tools can leverage family support or help people think about strategies for being active-wo factors necessary for achieving regular PA. In this 2-month qualitative study, we investigated PA tracking practices amongst 14 families living in low-income neighborhoods, where obesity is prevalent. We characterize how social discussions of PA data rarely extended beyond the early stages of experiential learning, thus limiting the utility of PA trackers. Caregivers and children rarely analyzed their experiences to derive insights about the meaning of their PA data for their wellbeing. Those who engaged in these higher-order learning processes were often influenced by parenting beliefs shaped by personal health experiences. We contribute recommendations for how technology can more effectively support family experiential learning using PA tracking data.",
  "authors": [
    {
      "name": "Herman Saksono",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/do/10.1145/contrib-99658691732/rel-imgonly/saksono_herman-indeximage.jpg",
      "acmid": "99658691732",
      "orcid": "missing"
    },
    {
      "name": "Carmen Castaneda-Sceppa",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658689022",
      "orcid": "missing"
    },
    {
      "name": "Jessica Hoffman",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658690513",
      "orcid": "missing"
    },
    {
      "name": "Magy Seif El-Nasr",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502694399",
      "orcid": "0000-0002-7808-1686"
    },
    {
      "name": "Vivien Morris",
      "institution": "Mattapan Food and Fitness Coalition, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260426",
      "orcid": "missing"
    },
    {
      "name": "Andrea G. Parker",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556858356",
      "orcid": "0000-0002-2362-7717"
    }
  ],
  "references": [
    {
      "text": "2017. Health, United States, 2016: With Chartbook on Long-term Trends in Health. Technical Report. National Center for Health Statistics, Hyattsville, MD.",
      "doi": ""
    },
    {
      "text": "Eric P S Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI 2015. ACM, 585--594.  ",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Shlomo Berkovsky, Mac Coombe, Jill Freyne, Dipak Bhandari, and Nilufar Baghaei. 2010. Physical Activity Motivating Games: Virtual Rewards for Real Activity. In CHI 2010. ACM, Atlanta, 243--252.  ",
      "doi": "10.1145/1753326.1753362"
    },
    {
      "text": "David Boud and David Walker. 1991. Experience and Learning: Reflection at Work. EAE600 Adults Learning in the Workplace: Part A. Adult and Workplace Education, Faculty of Education, Deakin University, Geelong, Victoria, Australia. 61--82 pages.",
      "doi": ""
    },
    {
      "text": "H. E. Brown, A. J. Atkin, J. Panter, G. Wong, M. J.M. Chinapaw, and E. M.F. van Sluijs. 2016. Family-based interventions to increase physical activity in children: A systematic review, meta-analysis and realist synthesis. Obesity Reviews 17, 4 (2016), 345--360.",
      "doi": ""
    },
    {
      "text": "Nicole R. Bush, Amber L. Allison, Alison L. Miller, Julianna Deardorff, Nancy E. Adler, and W. Thomas Boyce. 2017. Socioeconomic disparities in childhood obesity risk: Association with an oxytocin receptor polymorphism. JAMA Pediatrics 171, 1 (2017), 61--67. arXiv:cond-mat/0604212v1",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017. Understanding Self-Reflection: How People Reflect on Personal Data Through Visual Data Exploration. Proc. EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth '17) (2017).  ",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Nathalie Colineau and Cécile Paris. 2010. Motivating reflection about health within the family: the use of goal setting and tailored feedback. User Modeling and User-Adapted Interaction 21, 4--5 (12 2010), 341--376.  ",
      "doi": "10.1007/s11257-010-9089-x"
    },
    {
      "text": "Sunny Consolvo, David W Mcdonald, Tammy Toscos, Mike Y Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony Lamarca, Louis Legrand, Ryan Libby, Ian Smith, and James A Landay. 2008. Activity Sensing in the Wild: A Field Trial of UbiFit Garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI 2008. Florence, 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Kristen Day. 2006. Active Living and Social Justice. Journal of American Planning Association 72, 1 (2006).",
      "doi": ""
    },
    {
      "text": "Aysegül Dogangün, Michael Schwarz, Katharina Kloppenborg, and Robert Le. 2017. An Approach to Improve Physical Activity by Generating Individual Implementation Intentions. Adjunct Publication of the 25th Conference on User Modeling, Adaptation and Personalization (2017), 370--375.  ",
      "doi": "10.1145/3099023.3099101"
    },
    {
      "text": "Joseph E Donnelly, Charles H Hillman, Darla M Castelli, Jennifer L Etnier, Sarah Lee, Phillip Tomporowski, Kate Lambourne, and Amanda N Szabo-reed. 2016. Physical Activity, Fitness, Cognitive Function, and Academic Achievement in Children: A Systematic Review. Vol. 48. 1197-- 1222 pages.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, David S Kirk, and Abigail C Durrant. 2015. A Quantified Past: Toward Design for Remembering With Personal Informatics. Human-Computer Interaction 0024, June (2015), 1--40.  ",
      "doi": "10.1080/07370024.2015.1093422"
    },
    {
      "text": "Kelly R. Evenson, Michelle M. Goto, and Robert D. Furberg. 2015. Systematic review of the validity and reliability of consumer-wearable activity trackers. International Journal of Behavioral Nutrition and Physical Activity 12, 1 (2015), 159.",
      "doi": ""
    },
    {
      "text": "Alicia L. Fedewa and Soyeon Ahn. 2011. The Effects of Physical Activity and Physical Fitness on Children's Achievement and Cognitive Outcomes: A Meta-Analysis. Research Quarterly for Exercise and Sport 82, 3 (2011), 521--535.",
      "doi": ""
    },
    {
      "text": "Tara J. J. Fenwick. 2001. Experiential Learning: A Theoretical Critique from Five Perspectives. Information Series No. 385. (2001), 76.",
      "doi": ""
    },
    {
      "text": "Rowanne Fleck. 2012. Rating reflection on experience: A case study of teachers' and tutors' reflection around images. Interacting with Computers 24, 6 (2012), 439--449.  ",
      "doi": "10.1016/j.intcom.2012.07.003"
    },
    {
      "text": "Andrea Grimes, Desney Tan, and Dan Morris. 2009. Toward Technologies that Support Family Reflections on Health. In GROUP '09. ACM Press, New York, New York, USA, 311.  ",
      "doi": "10.1145/1531674.1531721"
    },
    {
      "text": "Sabrina L Gustafson and Ryan E Rhodes. 2006. Parental correlates of physical activity in children and early adolescents. Sports Medicine 36, 1 (1 2006), 79--97.",
      "doi": ""
    },
    {
      "text": "Daniel Harrison, Paul Marshall, Nadia Bianchi-Berthouze, and Jon Bird. 2015. Activity Tracking: Barriers, Workarounds and Customisation. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '15. ACM, Osaka, 617--621.  ",
      "doi": "10.1145/2750858.2805832"
    },
    {
      "text": "Erik Hemmingsson. 2018. Early Childhood Obesity Risk Factors: Socioeconomic Adversity, Family Dysfunction, Offspring Distress, and Junk Food Self-Medication. Current Obesity Reports 7, 2 (2018), 204--209.",
      "doi": ""
    },
    {
      "text": "K Janz and Marshall H Becker. 1984. The Health Belief Model: A Decade Later. Health Education Quarterly (1984), 1--47.",
      "doi": ""
    },
    {
      "text": "Danish U. Khan, Swamy Ananthanarayan, An T. Le, Christopher L. Schaefbauer, and Katie A. Siek. 2012. Designing mobile snack application for low socioeconomic status families. In 2012 6th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth). IEEE, 57--64.",
      "doi": ""
    },
    {
      "text": "Stephen Kimani, Nilufar Baghaei, Jill Freyne, Shlomo Berkovsky, Dipak Bhandari, and Greg Smith. 2010. Gender and role differences in family-based healthy living networks. In International Conference on Human Factors in Computing Systems - CHI EA '10. 4219.  ",
      "doi": "10.1145/1753846.1754129"
    },
    {
      "text": "Ruth R. Kipping, Laura D. Howe, Russell Jago, Rona Campbell, Sian Wells, Catherine R. Chittleborough, Julie Mytton, Sian M. Noble, Tim J. Peters, and Debbie A. Lawlor. 2014. Effect of intervention aimed at increasing physical activity, reducing sedentary behaviour, and increasing fruit and vegetable consumption in children: Active for Life Year 5 (AFLY5) school based cluster randomised controlled trial. BMJ (Online) 348, 348 (2014).",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. Proceedings of the 2011 Annual Conference on Human Factors in Computing Systems - CHI '11 (2011), 3063.  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "David A. Kolb. 1984. Experiential learning: Experience as the source of learning and development. FT press.",
      "doi": ""
    },
    {
      "text": "W Kroeze, A Werkman, and J Brug. 2006. A systematic review of randomized trials on the effectiveness of computer-tailored education on physical activity and dietary behaviors. Annals of Behavioral Medicine 31, 3 (2006), 205--223.",
      "doi": ""
    },
    {
      "text": "Shiriki Kumanyika and Sonya Grier. 2006. Targeting interventions for ethnic minority and low-income populations. The Future of children / Center for the Future of Children, the David and Lucile Packard Foundation 16, 1 (1 2006), 187--207. http://www.ncbi.nlm.nih.gov/pubmed/16532664",
      "doi": ""
    },
    {
      "text": "Gwendolyn M. Lawson, Cayce J. Hook, and Martha J. Farah. 2018. A meta-analysis of the relationship between socioeconomic status and executive function performance among children. Developmental Science 21, 2 (2018), 1--22.",
      "doi": ""
    },
    {
      "text": "James J Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B Strub. 2006. Fish'n'Steps: Encouraging Physical Activity with an Interactive Computer Game. In Ubicomp 2006. 261--278.  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Andrew Macvean and Judy Robertson. 2012. iFitQuest: A School Based Study of a Mobile Location-Aware Exergame for Adolescents. In MobileHCI '12. San Francisco, 359--368.  ",
      "doi": "10.1145/2371574.2371630"
    },
    {
      "text": "Alison M McMinn, Esther Mf van Sluijs, Nicholas C Harvey, Cyrus Cooper, Hazel M Inskip, Keith M Godfrey, and Simon J Griffin. 2009. Validation of a maternal questionnaire on correlates of physical activity in preschool children. International Journal of Behavioral Nutrition and Physical Activity 6 (1 2009), 81.",
      "doi": ""
    },
    {
      "text": "Rebecca Ann Meriwether, Pamela M McMahon, Nahid Islam, and William C Steinmann. 2006. Physical activity assessment: Validation of a Clinical Assessment Tool. American Journal of Preventive Medicine 31, 6 (12 2006), 484--91.",
      "doi": ""
    },
    {
      "text": "Susan; Michie, Craig; Abraham, Charles; Whittington, John; McAteer, and Sunjai Gupta. 2009. Effective techniques in healthy eating and physical activity interventions: A meta-regression. Technical Report 6. 690-- 701 pages. arXiv:gr-qc/9809069v1",
      "doi": ""
    },
    {
      "text": "Andrew D. Miller and Elizabeth D. Mynatt. 2014. StepStream: A School-based Pervasive Social Fitness System for Everyday Adolescent Health. Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems - CHI '14 (2014), 2823--2832.  ",
      "doi": "10.1145/2556288.2557190"
    },
    {
      "text": "Beth E Molnar, Steven L Gortmaker, Fiona C Bull, and Stephen L Buka. 2004. Unsafe to Play? Neighborhood Disorder and Lack Among Urban Children and Adolescents. American Journal of Health Promotion (2004), 378--387.",
      "doi": ""
    },
    {
      "text": "Sean Munson and Sunny Consolvo. 2012. Exploring Goal-setting, Rewards, Self-monitoring, and Sharing to Motivate Physical Activity. Proceedings of the 6th International Conference on Pervasive Computing Technologies for Healthcare (2012), 25--32.",
      "doi": ""
    },
    {
      "text": "Jasmin Niess and Pawel W. Wozniak. 2018. Supporting Meaningful Personal Fitness. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18 (2018), 1--12.  ",
      "doi": "10.1145/3173574.3173745"
    },
    {
      "text": "Cynthia L. Ogden, Margaret D. Carroll, Brian K. Kit, and Katherine M. Flegal. 2014. Prevalence of Childhood and Adult Obesity in the United States, 2011--2012. JAMA: The Journal of the American Medical Association 311, 8 (2 2014), 806.",
      "doi": ""
    },
    {
      "text": "K. Patrick, J. F. Sallis, B. Long, K. J. Calfas, W. Wooten, G. Heath, and M. Pratt. 1994. A new tool for encouraging activity: Project PACE., 45--46 pages.",
      "doi": ""
    },
    {
      "text": "Laura R Pina, Sang-Wha Sien, Teresa Ward, Jason C Yip, Sean A Munson, James Fogarty, and Julie A Kientz. 2017. From Personal Informatics to Family Informatics. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17. 2300--2315.  ",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "Aare Puussaar, Adrian K Clear, and Peter Wright. 2017. Enhancing Personal Informatics Through Social Sensemaking. In CHI '17 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/3025453.3025804"
    },
    {
      "text": "J J Reilly and J Kelly. 2011. Long-term impact of overweight and obesity in childhood and adolescence on morbidity and premature mortality in adulthood: systematic review. International journal of obesity 35, July 2010 (2011), 891--898.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14 (2014), 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Herman Saksono, Carmen Castaneda-sceppa, Jessica Hoffman, Magy Seif El-nasr, Vivien Morris, and Andrea G. Parker. 2018. Family Health Promotion in Low-SES Neighborhoods: A Two-Month Study of Wearable Activity Tracking. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM, Montreal, BC, Canada, 1--13.  ",
      "doi": "10.1145/3173574.3173883"
    },
    {
      "text": "Herman Saksono and Andrea Grimes Parker. 2017. Reflective Informatics Through Family Storytelling: Self-discovering Physical Activity Predictors. In Proceedings of the 2017 ACM Conference on Human Factors in Computing Systems - CHI '17. ACM, Denver, CO, USA, 5232--5244.  ",
      "doi": "10.1145/3025453.3025651"
    },
    {
      "text": "Herman Saksono, Ashwini Ranade, Geeta Kamarthi, Carmen Castaneda-Sceppa, Jessica A. Hoffman, Cathy Wirth, and Andrea G. Parker. 2015. Spaceship Launch: Designing a Collaborative Exergame for Families. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, Vancouver, BC, Canada, 1776--1787.  ",
      "doi": "10.1145/2675133.2675159"
    },
    {
      "text": "Chris Schaefbauer, Danish Kahn, Amy Le, Garrett Sczechowski, and Katie Siek. 2015. Snack Buddy: Supporting Healthy Snacking in Low Socioeconomic Status Families. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, New York, USA, 1045--1057.  ",
      "doi": "10.1145/2675133.2675180"
    },
    {
      "text": "US Department of Health Services and Human. 2008. 2008 Physical Activity Guidelines for Americans. Technical Report. U.S. Department of Health and Human Services. https://health.gov/PAGuidelines/",
      "doi": ""
    },
    {
      "text": "Christopher Spera, Kathryn R. Wentzel, and Holly C. Matto. 2009. Parental aspirations for their children's educational attainment: Relations to ethnicity, parental education, children's academic performance, and parental perceptions of school climate. Journal of Youth and Adolescence 38, 8 (2009), 1140--1152.",
      "doi": ""
    },
    {
      "text": "Kevin G Stanley, Ian Livingston, Alan Bandurka, Robert Kapiszka, and Regan L Mandryk. 2010. PiNiZoRo: A GPS-based Exercise Game for Families. In Futureplay '10 Proceedings of the International Academic Conference on the Future of Game Design and Technology. ACM, Vancouver, British Columbia, Canada, 243--246.  ",
      "doi": "10.1145/1920778.1920817"
    },
    {
      "text": "Elizabeth Stowell, Mercedes C Lyson, Herman Saksono, Reneé C Wurth, Holly Jimison, Misha Pavel, and Andrea G. Parker. 2018. Designing and Evaluating mHealth Interventions for Vulnerable Populations: A Systematic Review. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1--17.  ",
      "doi": "10.1145/3173574.3173589"
    },
    {
      "text": "Haichun Sun. 2013. Impact of exergames on physical activity and motivation in elementary school students: A follow-up study. Journal of Sport and Health Science 2, 3 (9 2013), 138--145.",
      "doi": ""
    },
    {
      "text": "David R Thomas. 2003. A general inductive approach for qualitative data analysis. Population English Edition 27, 2 (2003), 237--246.",
      "doi": ""
    },
    {
      "text": "Stewart G Trost, Neville Owen, Adrian E Bauman, James F Sallis, and Wendy Brown. 2002. Correlates of adults' participation in physical activity: review and update. Medicine & Science in Sports & Exercise 34, 12 (2002), 1996--2001.",
      "doi": ""
    },
    {
      "text": "Amna Umer, George A Kelley, Lesley E Cottrell, Peter Giacobbi Jr, Kim E Innes, and Christa L Lilly. 2009. Childhood obesity and adult cardiovascular disease risk: a systematic review. BMC Public Health 17, 683 (2009), 1--11.",
      "doi": ""
    },
    {
      "text": "Kim M. Unertl, Chris L. Schaefbauer, Terrance R. Campbell, Charles Senteio, Katie A. Siek, Suzanne Bakken, and Tiffany C. Veinot. 2016. Integrating community-based participatory research and informatics approaches to improve the engagement and health of underserved populations. Journal of the American Medical Informatics Association 23, 1 (2016), 60--73.",
      "doi": ""
    },
    {
      "text": "Klazine Van Der Horst, Marijke J.Chin A. Paw, Jos W.R. Twisk, and Willem Van Mechelen. 2007. A brief review on correlates of physical activity and sedentariness in youth. Medicine and Science in Sports and Exercise 39, 8 (2007), 1241--1250.",
      "doi": ""
    },
    {
      "text": "Esther M F Van Sluijs, Alison M McMinn, and Simon J Griffin. 2008. Effectiveness of interventions to promote physical activity in children and adolescents: systematic review of controlled trials. British journal of sports medicine 42, 8 (2008), 653--657.",
      "doi": ""
    },
    {
      "text": "Dana L. Wolff-Hughes, David R. Bassett, and Eugene C. Fitzhugh. 2014. Population-Referenced Percentiles for Waist-Worn AccelerometerDerived Total Activity Counts in U.S. Youth: 2003 - 2006 NHANES. PLoS ONE 9, 12 (2014), e115915.",
      "doi": ""
    },
    {
      "text": "Yan Xu, Erika Shehan Poole, and Andrew D. Miller. 2012. This is not a one-horse race: understanding player types in multiplayer pervasive health games for youth. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, Seattle, 843--852.  ",
      "doi": "10.1145/2145204.2145330"
    },
    {
      "text": "Adina Zeki Al Hazzouri, Tali Elfassy, Stephen Sidney, David Jacobs, Eliseo J. Perez Stable, and Kristine Yaffe. 2017. Sustained Economic Hardship and Cognitive Function: The Coronary Artery Risk Development in Young Adults Study. Am J Prev Med. 52, 1 (2017), 1--9.",
      "doi": ""
    }
  ]
}