{
  "doi": "10.1145/3290605.3300455",
  "title": "A Framework for the Experience of Meaning in Human-Computer Interaction",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [
    "Best Paper"
  ],
  "abstract": "The view of quality in human-computer interaction continuously develops, having in past decades included consistency, transparency, usability, and positive emotions. Recently, meaning is receiving increased interest in the user experience literature and in industry, referring to the end, purpose or significance of interaction with computers. However, the notion of meaning remains elusive and a bewildering number of senses are in use. We present a framework of meaning in interaction, based on a synthesis of psychological meaning research. The framework outlines five distinct senses of the experience of meaning: connectedness, purpose, coherence, resonance, and significance. We illustrate the usefulness of the framework by analyzing a selection of recent papers at the CHI conference and by raising a series of open research questions about the interplay of meaning, user experience, reflection, and well-being.",
  "tags": [
    "user experience",
    "meaningful interaction",
    "meaning-making",
    "meaning",
    "meaningfulness"
  ],
  "authors": [
    {
      "name": "Elisa D. Mekler",
      "institution": "University of Basel, Basel, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549460056",
      "orcid": "0000-0003-0076-6703"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    }
  ],
  "references": [
    {
      "text": "Aloha Hufana Ambe, Margot Brereton, Alessandro Soro, and Paul Roe. 2017. Technology Individuation: The Foibles of Augmented Everyday Objects. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6632--6644.  ",
      "doi": "10.1145/3025453.3025770"
    },
    {
      "text": "Dan Ariely, Emir Kamenica, and Drazen Prelec. 2008. Man's search for meaning: The case of Legos. Journal of Economic Behavior & Organization 67, 3--4 (2008), 671--677.",
      "doi": ""
    },
    {
      "text": "Javier A. Bargas-Avila and Kasper Hornbæk. 2011. Old Wine in New Bottles or Novel Challenges: A Critical Analysis of Empirical Studies of User Experience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2689--2698.  ",
      "doi": "10.1145/1978942.1979336"
    },
    {
      "text": "Alexander Batthyany and Pninit Russo-Netzer. 2014. Meaning in positive and existential psychology. Springer.",
      "doi": ""
    },
    {
      "text": "Alexander Batthyany and Pninit Russo-Netzer. 2014. Psychologies of meaning. In Meaning in positive and existential psychology. Springer, 3--22.",
      "doi": ""
    },
    {
      "text": "Jack J Bauer, Dan P McAdams, and Jennifer L Pals. 2008. Narrative identity and eudaimonic well-being. Journal of happiness studies 9, 1 (2008), 81--104.",
      "doi": ""
    },
    {
      "text": "Roy F Baumeister. 1991. Meanings of life. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Roy F Baumeister and Kathleen D Vohs. 2002. The pursuit of meaningfulness in life. In Handbook of positive psychology. Vol. 1. Oxford University Press, 608--618.",
      "doi": ""
    },
    {
      "text": "Roy F. Baumeister, Kathleen D. Vohs, Jennifer L. Aaker, and Emily N. Garbinsky. 2013. Some key differences between a happy life and a meaningful life. The Journal of Positive Psychology 8, 6 (2013), 505--516.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 585--594.  ",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Ernest Becker. 2007. The denial of death. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Julia Ayumi Bopp, Elisa D. Mekler, and Klaus Opwis. 2016. Negative Emotion, Positive Experience?: Emotionally Moving Moments in Digital Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 2996--3006.  ",
      "doi": "10.1145/2858036.2858227"
    },
    {
      "text": "Robin Brewer and Anne Marie Piper. 2016. \"Tell It Like It Really Is\": A Case of Online Content Creation and Sharing Among Older Adult Bloggers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5529--5542.  ",
      "doi": "10.1145/2858036.2858379"
    },
    {
      "text": "Yves Candau, Thecla Schiphorst, and Jules Françoise. 2018. Designing from Embodied Knowing: Practice-Based Research at the Intersection Between Embodied Interaction and Somatics. In New Directions in Third Wave Human-Computer Interaction: Volume 2 - Methodologies, Michael Filimowicz and Veronika Tzankova (Eds.). Springer International Publishing, Cham, 203--230.",
      "doi": ""
    },
    {
      "text": "Vanessa Julia Carpenter and Elisa D. Mekler. 2019. Towards Metrics of Meaningfulness for Tech Practitioners. In CHI Conference on Human Factors in Computing Systems Extended Abstracts (CHI'19 Extended Abstracts). ACM, New York, NY, USA, 8.  ",
      "doi": "10.1145/3290607.3299060"
    },
    {
      "text": "Vanessa Julia Carpenter and Dan Overholt. 2017. Designing For Meaningfulness: A Case Study Of A Pregnancy Wearable For Men. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (DIS '17 Companion). ACM, New York, NY, USA, 95--100.  ",
      "doi": "10.1145/3064857.3079126"
    },
    {
      "text": "Runyuan (Jason) Chen, Mania Orand, Shin Young (Lucia) Choi, and Leena Choi. 2018. An Empirical Exploration of Mindfulness Design Using Solo Travel Domain. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 97, 12 pages.  ",
      "doi": "10.1145/3173574.3173671"
    },
    {
      "text": "EunJeong Cheon and Norman Makoto Su. 2018. The Value of Empty Space for Design. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 49, 13 pages.  ",
      "doi": "10.1145/3173574.3173623"
    },
    {
      "text": "Gilbert Cockton. 2006. Designing Worth is Worth Designing. In Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles (NordiCHI '06). ACM, New York, NY, USA, 165--174.  ",
      "doi": "10.1145/1182475.1182493"
    },
    {
      "text": "Gilbert Cockton. 2008. Designing Worth -- Connecting Preferred Means to Desired Ends. interactions 15, 4 (July 2008), 54--57.  ",
      "doi": "10.1145/1374489.1374502"
    },
    {
      "text": "Clarisse Sieckenius de Souza. 2017. Semiotics and Human-Computer Interaction. In The Wiley Handbook of Human Computer Interaction. Wiley-Blackwell, Chapter 2, 33--49.",
      "doi": ""
    },
    {
      "text": "Edward L Deci and Richard M Ryan. 2008. Facilitating optimal motivation and psychological well-being across life's domains. Canadian Psychology/Psychologie canadienne 49, 1 (2008), 14.",
      "doi": ""
    },
    {
      "text": "Antonella Delle Fave, Ingrid Brdar, Teresa Freire, Dianne Vella- Brodrick, and Marié P Wissing. 2011. The eudaimonic and hedonic components of happiness: Qualitative and quantitative findings. Social Indicators Research 100, 2 (2011), 185--207.",
      "doi": ""
    },
    {
      "text": "* Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan- Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. \"I Don'T Want to Wear a Screen\": Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 6028--6039.  ",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Marie Dezelic. 2017. Meaning Constructs and Meaning-Oriented Techniques: Clinical Applications of Meaning and Existential Exploration. Journal of Constructivist Psychology 30, 1 (2017), 32--41.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the action is: the foundations of embodied interaction. MIT press.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Jordan Eschler, Arpita Bhattacharya, and Wanda Pratt. 2018. Designing a Reclamation of Body and Health: Cancer Survivor Tattoos As Coping Ritual. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 510, 12 pages.  ",
      "doi": "10.1145/3173574.3174084"
    },
    {
      "text": "Daniel Fallman. 2011. The New Good: Exploring the Potential of Philosophy of Technology to Contribute to Human-computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1051--1060.  ",
      "doi": "10.1145/1978942.1979099"
    },
    {
      "text": "Blaine J Fowers and G Tyler Lefevor. 2015. The inescapability of intersubjectivity in meaning. American Psychologist 70, 6 (2015), 573--574.",
      "doi": ""
    },
    {
      "text": "Viktor Emil Frankl and Ilse Lasch (Translation). 1992. Man's search for meaning: An introduction to logotherapy. 4th Edition. Boston, MA, US: Beacon Press.",
      "doi": ""
    },
    {
      "text": "Guido Gainotti and Camillo Marra. 2011. Differential Contribution of Right and Left Temporo-Occipital and Anterior Temporal Lesions to Face Recognition Disorders. Frontiers in Human Neuroscience 5 (2011), 55.",
      "doi": ""
    },
    {
      "text": "Login S George and Crystal L Park. 2013. Are meaning and purpose distinct? An examination of correlates and predictors. The Journal of Positive Psychology 8, 5 (2013), 365--375.",
      "doi": ""
    },
    {
      "text": "Login S George and Crystal L Park. 2014. Existential mattering: bringing attention to a neglected but central aspect of meaning? In Meaning in positive and existential psychology. Springer, 39--51.",
      "doi": ""
    },
    {
      "text": "Login S George and Crystal L Park. 2016. Meaning in life as comprehension, purpose, and mattering: Toward integration and new research questions. Review of General Psychology 20, 3 (2016), 205.",
      "doi": ""
    },
    {
      "text": "Login S George and Crystal L Park. 2017. The multidimensional existential meaning scale: A tripartite approach to measuring meaning in life. The Journal of Positive Psychology 12, 6 (2017), 613--627.",
      "doi": ""
    },
    {
      "text": "Barbara Grosse-Hering, Jon Mason, Dzmitry Aliakseyeu, Conny Bakker, and Pieter Desmet. 2013. Slow Design for Meaningful Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 3431--3440.  ",
      "doi": "10.1145/2470654.2466472"
    },
    {
      "text": "Jane Gruning. 2018. Displaying Invisible Objects: Why People Rarely Re-read E-books. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 139, 12 pages.  ",
      "doi": "10.1145/3173574.3173713"
    },
    {
      "text": "Benjamin W. Hadden and C. Veronica Smith. 2017. I Gotta Say, Today Was a Good (and Meaningful) Day: Daily Meaning in Life as a Potential Basic Psychological Need. Journal of Happiness Studies (2017).",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI. In Alt. Chi. Session at the SIGCHI Conference on Human Factors in Computing Systems San Jose, California, USA. 1--18.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Sarah Diefenbach, and Anja Göritz. 2010. Needs, Affect, and Interactive Products - Facets of User Experience. Interact. Comput. 22, 5 (Sept. 2010), 353--362.  ",
      "doi": "10.1016/j.intcom.2010.04.002"
    },
    {
      "text": "Marc Hassenzahl, Kai Eckoldt, Sarah Diefenbach, Matthias Laschke, Eva Lenz, and Kim Joonhwan. 2013. Designing Moments of Meaning and Pleasure. Experience Design and Happiness. International Journal of Design 7, 3 (2013), 21--31.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl and Noam Tractinsky. 2006. User experience-a research agenda. Behaviour & Information Technology 25, 2 (2006), 91--97.",
      "doi": ""
    },
    {
      "text": "Steven J Heine, Travis Proulx, and Kathleen D Vohs. 2006. The meaning maintenance model: On the coherence of social motivations. Personality and Social Psychology Review 10, 2 (2006), 88--110.",
      "doi": ""
    },
    {
      "text": "Samantha J. Heintzelman and Laura A. King. 2013. On knowing more than we can tell: Intuitive processes and the experience of meaning. The Journal of Positive Psychology 8, 6 (2013), 471--482.",
      "doi": ""
    },
    {
      "text": "Samantha J Heintzelman and Laura A King. 2014. Life is pretty meaningful. American Psychologist 69, 6 (2014), 561.",
      "doi": ""
    },
    {
      "text": "Samantha J Heintzelman and Laura A King. 2014. (The feeling of) meaning-as-information. Personality and Social Psychology Review 18, 2 (2014), 153--167.",
      "doi": ""
    },
    {
      "text": "Samantha J Heintzelman and Laura A King. 2016. Meaning in life and intuition. Journal of personality and social psychology 110, 3 (2016), 477.",
      "doi": ""
    },
    {
      "text": "Samantha J Heintzelman, Jason Trent, and Laura A King. 2013. Encounters with objective coherence and the experience of meaning in life. Psychological Science 24, 6 (2013), 991--998.",
      "doi": ""
    },
    {
      "text": "Joshua A Hicks, David C Cicero, Jason Trent, Chad M Burton, and Laura A King. 2010. Positive affect, intuition, and feelings of meaning. Journal of personality and social psychology 98, 6 (2010), 967.",
      "doi": ""
    },
    {
      "text": "Joshua A Hicks and Laura A King. 2009. Meaning in life as a subjective judgment and a lived experience. Social and Personality Psychology Compass 3, 4 (2009), 638--653.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline C. M. Hummels, Katherine Isbister, Martin Jonsson, George Khut, Lian Loke, Danielle Lottridge, Patrizia Marti, Edward Melcer, Florian Floyd Müller, Marianne Graves Petersen, Thecla Schiphorst, Elena Márquez Segura, Anna Ståhl, Dag Svanæs, Jakob Tholander, and Helena Tobiasson. 2018. Embracing First-Person Perspectives in Soma-Based Design. Informatics 5, 1 (2018).",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk and Antti Oulasvirta. 2017. What Is Interaction?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5040--5052.  ",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data Engagement Through Physical Ambient Visualizations in the Home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1608--1619.  ",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Veronika Huta. 2017. Meaning as a Subjective Experience. Journal of Constructivist Psychology 30, 1 (2017), 20--25.",
      "doi": ""
    },
    {
      "text": "Veronika Huta and RichardMRyan. 2010. Pursuing pleasure or virtue: The differential and overlapping well-being benefits of hedonic and eudaimonic motives. Journal of Happiness Studies 11, 6 (2010), 735--762.",
      "doi": ""
    },
    {
      "text": "Glena H. Iten, Sharon T. Steinemann, and Klaus Opwis. 2018. Choosing to Help Monsters: A Mixed-Method Examination of Meaningful Choices in Narrative-Rich Games and Interactive Narratives. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 341, 13 pages.  ",
      "doi": "10.1145/3173574.3173915"
    },
    {
      "text": "Jaemin Jo, Sehi L'Yi, Bongshin Lee, and Jinwook Seo. 2017. Touch- Pivot: Blending WIMP & Post-WIMP Interfaces for Data Exploration on Tablet Devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2660--2671.  ",
      "doi": "10.1145/3025453.3025752"
    },
    {
      "text": "Victor Kaptelinin. 2018. Technology and the Givens of Existence: Toward an Existential Inquiry Framework in HCI Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 270, 14 pages.  ",
      "doi": "10.1145/3173574.3173844"
    },
    {
      "text": "Jinhyung Kim, Pyungwon Kang, and Incheol Choi. 2014. Pleasure now, meaning later: Temporal dynamics between pleasure and meaning. Journal of Experimental Social Psychology 55 (2014), 262 -- 270.",
      "doi": ""
    },
    {
      "text": "Jinhyung Kim, Elizabeth Seto, William E Davis, and Joshua A Hicks. 2014. Positive and existential psychological approaches to the experience of meaning in life. In Meaning in positive and existential psychology. Springer, 221--233.",
      "doi": ""
    },
    {
      "text": "Laura A King, Samantha J Heintzelman, and Sarah J Ward. 2016. Beyond the search for meaning: A contemporary science of the experience of meaning in life. Current Directions in Psychological Science 25, 4 (2016), 211--216.",
      "doi": ""
    },
    {
      "text": "Laura A King, Joshua A Hicks, Jennifer L Krull, and Amber K Del Gaiso. 2006. Positive affect and the experience of meaning in life. Journal of personality and social psychology 90, 1 (2006), 179.",
      "doi": ""
    },
    {
      "text": "* Alexandra Kitson, Thecla Schiphorst, and Bernhard E. Riecke. 2018. Are You Dreaming?: A Phenomenological Study on Understanding Lucid Dreams As a Tool for Introspection in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 343, 12 pages.  ",
      "doi": "10.1145/3173574.3173917"
    },
    {
      "text": "Mark J Landau, Jeff Greenberg, Sheldon Solomon, Tom Pyszczynski, and Andy Martens. 2006. Windows into nothingness: Terror management, meaninglessness, and negative reactions to modern art. Journal of personality and social psychology 90, 6 (2006), 879.",
      "doi": ""
    },
    {
      "text": "Sophie Landwehr Sydow, Jakob Tholander, and Martin Jonsson. 2017. \"It's a Bomb!\" -- Material Literacy and Narratives of Making. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 121--132.  ",
      "doi": "10.1145/3025453.3025529"
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. Supporting People with Dementia in Digital Social Sharing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2149--2162.  ",
      "doi": "10.1145/3025453.3025586"
    },
    {
      "text": "Dmitry Leontiev. 2017. The Divine Knot: A Relational View of Meaning. Journal of Constructivist Psychology 30, 1 (2017), 50--56.",
      "doi": ""
    },
    {
      "text": "Dmitry A. Leontiev. 2013. Personal meaning: A challenge for psychology. The Journal of Positive Psychology 8, 6 (2013), 459--470.",
      "doi": ""
    },
    {
      "text": "Ann Light, Alison Powell, and Irina Shklovski. 2017. Design for Existential Crisis in the Anthropocene Age. In Proceedings of the 8th International Conference on Communities and Technologies (C&T '17). ACM, New York, NY, USA, 270--279.  ",
      "doi": "10.1145/3083671.3083688"
    },
    {
      "text": "Ann Light, Irina Shklovski, and Alison Powell. 2017. Design for Existential Crisis. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 722--734.  ",
      "doi": "10.1145/3027063.3052760"
    },
    {
      "text": "Yichen Lu and Virpi Roto. 2015. Evoking meaningful experiences at work a positive design framework for work tools. Journal of Engineering Design 26, 4--6 (2015), 99--120.",
      "doi": ""
    },
    {
      "text": "Kai Lukoff, Cissy Yu, Julie Kientz, and Alexis Hiniker. 2018. What Makes Smartphone Use Meaningful or Meaningless? Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1, Article 22 (March 2018), 26 pages.  ",
      "doi": "10.1145/3191754"
    },
    {
      "text": "Ulrik Lyngs, Reuben Binns, Max Van Kleek, and Nigel Shadbolt. 2018. \"So, Tell Me What Users Want, What They Really, Really Want!\". In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article alt04, 10 pages.  ",
      "doi": "10.1145/3170427.3188397"
    },
    {
      "text": "Kyla A Machell, Todd B Kashdan, Jerome L Short, and John B Nezlek. 2015. Relationships between meaning in life, social and achievement events, and positive and negative affect in daily life. Journal of Personality 83, 3 (2015), 287--298.",
      "doi": ""
    },
    {
      "text": "Michael J MacKenzie and Roy F Baumeister. 2014. Meaning in life: Nature, needs, and myths. In Meaning in positive and existential psychology. Springer, 25--37.",
      "doi": ""
    },
    {
      "text": "Laura Malinverni, Julian Maya, Marie-Monique Schaper, and Narcis Pares. 2017. The World-as-Support: Embodied Exploration, Understanding and Meaning-Making of the Augmented World. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5132--5144.  ",
      "doi": "10.1145/3025453.3025955"
    },
    {
      "text": "Frank Martela, Richard M. Ryan, and Michael F. Steger. 2018. Meaningfulness as Satisfaction of Autonomy, Competence, Relatedness, and Beneficence: Comparing the Four Satisfactions and Positive Affect as Predictors of Meaning in Life. Journal of Happiness Studies 19, 5 (01 Jun 2018), 1261--1282.",
      "doi": ""
    },
    {
      "text": "Frank Martela and Michael F. Steger. 2016. The three meanings of meaning in life: Distinguishing coherence, purpose, and significance. The Journal of Positive Psychology 11, 5 (2016), 531--545.",
      "doi": ""
    },
    {
      "text": "Nathan Mascaro and David H. Rosen. 2006. The Role of Existential Meaning as a Buffer Against Stress. Journal of Humanistic Psychology 46, 2 (2006), 168--190.",
      "doi": ""
    },
    {
      "text": "Abraham Maslow. 1962. Toward a psychology of being. (1962).",
      "doi": ""
    },
    {
      "text": "Michael Massimi, Jill P. Dimond, and Christopher A. Le Dantec. 2012. Finding a New Normal: The Role of Technology in Life Disruptions. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 719--728.  ",
      "doi": "10.1145/2145204.2145314"
    },
    {
      "text": "Ian McGregor and Brian R Little. 1998. Personal projects, happiness, and meaning: on doing well and being yourself. Journal of personality and social psychology 74, 2 (1998), 494.",
      "doi": ""
    },
    {
      "text": "Patrick E McKnight and Todd B Kashdan. 2009. Purpose in life as a system that creates and sustains health and well-being: an integrative, testable theory. Review of General Psychology 13, 3 (2009), 242.",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler and Kasper Hornbæk. 2016. Momentary Pleasure or Lasting Meaning?: Distinguishing Eudaimonic and Hedonic User Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4509--4520.  ",
      "doi": "10.1145/2858036.2858225"
    },
    {
      "text": "Kellie Morrissey, John McCarthy, and Nadia Pantidi. 2017. The Value of Experience-Centred Design Approaches in Dementia Research Contexts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1326--1338.  ",
      "doi": "10.1145/3025453.3025527"
    },
    {
      "text": "* Jasmin Niess and Pawel W. Wozniak. 2018. Supporting Meaningful Personal Fitness: The Tracker Goal Evolution Model. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 171, 12 pages.  ",
      "doi": "10.1145/3173574.3173745"
    },
    {
      "text": "Mary Beth Oliver and Anne Bartsch. 2010. Appreciation as Audience Response: Exploring Entertainment Gratifications Beyond Hedonism. Human Communication Research 36, 1 (2010), 53--81.",
      "doi": ""
    },
    {
      "text": "Mary Beth Oliver, Nicholas David Bowman, Julia K Woolley, Ryan Rogers, Brett I Sherrick, and Mun-Young Chung. 2016. Video games as meaningful entertainment experiences. Psychology of Popular Media Culture 5, 4 (2016), 390.",
      "doi": ""
    },
    {
      "text": "Mary Beth Oliver and Arthur A. Raney. 2011. Entertainment as Pleasurable and Meaningful: Identifying Hedonic and Eudaimonic Motivations for Entertainment Consumption. Journal of Communication 61, 5 (2011), 984--1004.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta and Kasper Hornbæk. 2016. HCI Research As Problem-Solving. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4956--4967.  ",
      "doi": "10.1145/2858036.2858283"
    },
    {
      "text": "Crystal L Park. 2010. Making sense of the meaning literature: an integrative review of meaning making and its effects on adjustment to stressful life events. Psychological bulletin 136, 2 (2010), 257.",
      "doi": ""
    },
    {
      "text": "Crystal L Park. 2017. Unresolved tensions in the study of meaning in life. Journal of Constructivist Psychology 30, 1 (2017), 69--73.",
      "doi": ""
    },
    {
      "text": "Timo Partala and Aleksi Kallinen. 2012. Understanding the Most Satisfying and Unsatisfying User Experiences: Emotions, Psychological Needs, and Context. Interact. Comput. 24, 1 (Jan. 2012), 25--34.  ",
      "doi": "10.1016/j.intcom.2011.10.001"
    },
    {
      "text": "Christopher Peterson, Nansook Park, and Martin EP Seligman. 2005. Orientations to happiness and life satisfaction: The full life versus the empty life. Journal of happiness studies 6, 1 (2005), 25--41.",
      "doi": ""
    },
    {
      "text": "Ingrid Pettersson, Florian Lachner, Anna-Katharina Frison, Andreas Riener, and Andreas Butz. 2018. A Bermuda Triangle?: A Review of Method Application and Triangulation in User Experience Evaluation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 461, 16 pages.  ",
      "doi": "10.1145/3173574.3174035"
    },
    {
      "text": "Travis Proulx and Michael Inzlicht. 2012. The Five \"A\"s of Meaning Maintenance: Finding Meaning in the Theories of Sense-Making. Psychological Inquiry 23, 4 (2012), 317--335.",
      "doi": ""
    },
    {
      "text": "Tom Pyszczynski, Jeff Greenberg, Sander Koole, and Sheldon Solomon. 2010. Experimental existential psychology: Coping with the facts of life. In Handbook of Social Psychology. New York; McGraw-Hill, 724--757.",
      "doi": ""
    },
    {
      "text": "Amon Rapp. 2018. Gamification for Self-Tracking: From World of Warcraft to the Design of Personal Informatics Systems. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 80, 15 pages.  ",
      "doi": "10.1145/3173574.3173654"
    },
    {
      "text": "Gary T Reker and Paul TP Wong. 2012. Personal meaning in life and psychosocial adaptation in the later years. In The human quest for meaning: Theories, research, and applications. Routledge, 433--456.",
      "doi": ""
    },
    {
      "text": "Brent D Rosso, Kathryn H Dekas, and Amy Wrzesniewski. 2010. On the meaning of work: A theoretical integration and review. Research in organizational behavior 30 (2010), 91--127.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, Veronika Huta, and Edward L Deci. 2008. Living well: A self-determination theory perspective on eudaimonia. Journal of happiness studies 9, 1 (2008), 139--170.",
      "doi": ""
    },
    {
      "text": "Carol D Ryff and Burton H Singer. 2008. Know thyself and become what you are: A eudaimonic approach to psychological well-being. Journal of happiness studies 9, 1 (2008), 13--39.",
      "doi": ""
    },
    {
      "text": "Michael F Scheier, Carsten Wrosch, Andrew Baum, Sheldon Cohen, Lynn M Martire, Karen A Matthews, Richard Schulz, and Bozena Zdaniuk. 2006. The life engagement test: Assessing purpose in life. Journal of behavioral medicine 29, 3 (2006), 291.",
      "doi": ""
    },
    {
      "text": "Phoebe Sengers and Bill Gaver. 2006. Staying Open to Interpretation: Engaging Multiple Meanings in Design and Evaluation. In Proceedings of the 6th Conference on Designing Interactive Systems (DIS '06). ACM, New York, NY, USA, 99--108.  ",
      "doi": "10.1145/1142405.1142422"
    },
    {
      "text": "Kennon M Sheldon. 2014. Becoming oneself: The central role of selfconcordant goal selection. Personality and Social Psychology Review 18, 4 (2014), 349--365.",
      "doi": ""
    },
    {
      "text": "Kennon M Sheldon, Andrew J Elliot, Youngmee Kim, and Tim Kasser. 2001. What is satisfying about satisfying events? Testing 10 candidate psychological needs. Journal of personality and social psychology 80, 2 (2001), 325.",
      "doi": ""
    },
    {
      "text": "Vygandas 'Vegas Simbelis, Pedro Ferreira, Elsa Vaara, Jarmo Laaksolahti, and Kristina Höök. 2016. Repurposing Bits and Pieces of the Digital. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 840--851.  ",
      "doi": "10.1145/2858036.2858297"
    },
    {
      "text": "Linda Simon, Jamie Arndt, Jeff Greenberg, Tom Pyszczynski, and Sheldon Solomon. 1998. Terror management and meaning: Evidence that the opportunity to defend the worldview in response to mortality salience increases the meaningfulness of life in the mildly depressed. Journal of Personality 66, 3 (1998), 359--382.",
      "doi": ""
    },
    {
      "text": "Michael F. Steger. 2009. Meaning in Life. In Handbook of positive psychology. Vol. 2. Oxford University Press, 679--687.",
      "doi": ""
    },
    {
      "text": "Michael F Steger. 2012. Experiencing meaning in life: Optimal functioning at the nexus of well-being, psychopathology, and spirituality. In The human quest for meaning: Theories, research, and applications. Routledge, 165--184.",
      "doi": ""
    },
    {
      "text": "Alice Thudt, Uta Hinrichs, Samuel Huron, and Sheelagh Carpendale. 2018. Self-Reflection and Personal Physicalization Construction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 154, 13 pages.  ",
      "doi": "10.1145/3173574.3173728"
    },
    {
      "text": "Alexandre N. Tuch, Rune Trusell, and Kasper Hornbæk. 2013. Analyzing Users' Narratives to Understand Experience with Interactive Products. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2079--2088.  ",
      "doi": "10.1145/2470654.2481285"
    },
    {
      "text": "Elsa Vaara, Iuliana Silvan, Anna Ståhl, and Kristina Höök. 2010. Temporal Relations in Affective Health. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (NordiCHI '10). ACM, New York, NY, USA, 833--838.  ",
      "doi": "10.1145/1868914.1869043"
    },
    {
      "text": "Maarten Vansteenkiste, Nathalie Aelterman, Gert-Jan De Muynck, Leen Haerens, Erika Patall, and Johnmarshall Reeve. 2018. Fostering personal meaning and self-relevance: A self-determination theory perspective on internalization. The Journal of Experimental Education 86, 1 (2018), 30--49.",
      "doi": ""
    },
    {
      "text": "Alan S Waterman. 1993. Two conceptions of happiness: Contrasts of personal expressiveness (eudaimonia) and hedonic enjoyment. Journal of personality and social psychology 64, 4 (1993), 678--691.",
      "doi": ""
    },
    {
      "text": "Sarah Wiseman and Sandy J. J. Gould. 2018. Repurposing Emoji for Personalised Communication: Why \"' Means \"I Love You\". In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 152, 10 pages.  ",
      "doi": "10.1145/3173574.3173726"
    },
    {
      "text": "Paul TP Wong. 2012. From logotherapy to meaning-centered counseling and therapy. The human quest for meaning: Theories, research, and applications 2 (2012), 619--647.",
      "doi": ""
    },
    {
      "text": "Paul TPWong. 2013. The human quest for meaning: Theories, research, and applications. Routledge.",
      "doi": ""
    },
    {
      "text": "Paul TP Wong. 2014. Viktor Frankl's meaning-seeking model and positive psychology. In Meaning in positive and existential psychology. Springer, 149--184.",
      "doi": ""
    },
    {
      "text": "Alex M Wood, P Alex Linley, John Maltby, Michael Baliousis, and Stephen Joseph. 2008. The authentic personality: A theoretical and empirical conceptualization and the development of the Authenticity Scale. Journal of Counseling Psychology 55, 3 (2008), 385.",
      "doi": ""
    },
    {
      "text": "Irvin D Yalom. 1980. Existential psychotherapy. Vol. 1. Basic Books New York.",
      "doi": ""
    },
    {
      "text": "John Zimmerman. 2009. Designing for the Self: Making Products That Help People Become the Person They Desire to Be. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'09). ACM, New York, NY, USA, 395--404.  ",
      "doi": "10.1145/1518701.1518765"
    },
    {
      "text": "Mark Zuckerberg. 2018. https://www.facebook.com/zuck/posts/10104413015393571",
      "doi": ""
    }
  ]
}