{
  "doi": "10.1145/3290605.3300756",
  "title": "Does Who Matter?: Studying the Impact of Relationship Characteristics on Receptivity to Mobile IM Messages",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "This study examines the characteristics of mobile instant-messaging users' relationships with their social contacts and the effects of both relationship and interruption context on four measures of receptivity: Attentiveness, Responsiveness, Interruptibility, and Opportuneness. Overall, interruption context overshadows relationship characteristics as predictors of all four of these facets of receptivity; this overshadowing was most acute for Interruptibility and Opportuneness, but existed for all factors. In addition, while Mobile Maintenance Expectation and Activity Engagement were negatively correlated with all receptivity measures, each such measure had its own set of predictors, highlighting the conceptual differences among the measures. Finally, delving more deeply into potential relationship effects, we found that a single, simple closeness question was as effective at predicting receptivity as the 12-item Unidimensional Relationship Closeness Scale.",
  "tags": [
    "esm",
    "opportune moment",
    "interruptibility",
    "relationships",
    "mobile notifications",
    "mobile receptivity"
  ],
  "authors": [
    {
      "name": "Hao-Ping Lee",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/do/10.1145/contrib-99659200192/rel-imgonly/99659200192.jpg",
      "acmid": "99659200192",
      "orcid": "missing"
    },
    {
      "name": "Kuan-Yin Chen",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659200678",
      "orcid": "missing"
    },
    {
      "name": "Chih-Heng Lin",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659201621",
      "orcid": "missing"
    },
    {
      "name": "Chia-Yu Chen",
      "institution": "National Chengchi University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365607",
      "orcid": "missing"
    },
    {
      "name": "Yu-Lin Chung",
      "institution": "National Tsing Hua University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366445",
      "orcid": "missing"
    },
    {
      "name": "Yung-Ju Chang",
      "institution": "National Chiao Tung University, Hsinchu, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019794",
      "orcid": "0000-0001-6956-3459"
    },
    {
      "name": "Chien-Ru Sun",
      "institution": "National Chengchi University, Taipei, Taiwan Roc",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365371",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "S. Aminikhanghahi, R. Fallahzadeh, M. Sawyer, D. J. Cook, and L. B. Holder. 2017. Thyme: Improving Smartphone Prompt Timing Through Activity Awareness. In 2017 16th IEEE International Conference on Machine Learning and Applications (ICMLA), 315--322.",
      "doi": ""
    },
    {
      "text": "Arthur Aron, Elaine N. Aron, and Danny Smollan. 1992. Inclusion of Other in the Self Scale and the structure of interpersonal closeness. Journal of Personality and Social Psychology 63, 4 (1992), 596--612.",
      "doi": ""
    },
    {
      "text": "Daniel Avrahami, Susan R. Fussell, and Scott E. Hudson. 2008. IM waiting: timing and responsiveness in semi-synchronous communication. In Proceedings of the 2008 ACM conference on Computer supported cooperative work, 285--294. Retrieved February 19, 2014 from http://dl.acm.org.proxy.lib.umich.edu/citation.cfm?id=1460610  ",
      "doi": "10.1145/1460563.1460610"
    },
    {
      "text": "Daniel Avrahami and Scott E. Hudson. 2006. Communication Characteristics of Instant Messaging: Effects and Predictions of Interpersonal Relationships. In Proceedings of the 2006 20th Anniversary Conference on Computer Supported Cooperative Work (CSCW '06), 505--514.  ",
      "doi": "10.1145/1180875.1180954"
    },
    {
      "text": "Yung-Ju Chang and John C. Tang. 2015. Investigating Mobile Users' Ringer Mode Usage and Attentiveness and Responsiveness to Communication. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15), 6--15.  ",
      "doi": "10.1145/2785830.2785852"
    },
    {
      "text": "Mary Czerwinski, Edward Cutrell, and Eric Horvitz. 2000. Instant messaging: Effects of relevance and timing. In People and computers XIV: Proceedings of HCI, 71--76.",
      "doi": ""
    },
    {
      "text": "Steven R. Daugheny. 1988. A questionnaire for the measurement of social networks and social support. FROM THE NEW EDITORS 11, 2 (1988), 20.",
      "doi": ""
    },
    {
      "text": "Jayson L Dibble, Timothy R Levine, and Hee Sun Park. 2012. The Unidimensional Relationship Closeness Scale (URCS): reliability and validity evidence for a new measure of relationship closeness. Psychol. Assess. 24, 3 (September 2012), 565--572.",
      "doi": ""
    },
    {
      "text": "Tobias Dienlin, Philipp K. Masur, and Sabine Trepte. 2017. Reinforcement or Displacement? The Reciprocity of FtF, IM, and SNS Communication and Their Effects on Loneliness and Life Satisfaction. Journal of Computer-Mediated Communication 22, 2 (March 2017), 71--87.  ",
      "doi": "10.1111/jcc4.12183"
    },
    {
      "text": "John Dimmick, John Christian Feaster, and Artemio Ramirez. 2011. The niches of interpersonal media: Relationships in time and space. New Media & Society 13, 8 (December 2011), 1265--1282.",
      "doi": ""
    },
    {
      "text": "Tilman Dingler and Martin Pielot. 2015. I'll be there for you: Quantifying Attentiveness towards Mobile Messaging. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services, 1--5. Retrieved September 25, 2015 from http://dl.acm.org.proxy.lib.umich.edu/citation.cfm?id=2785840  ",
      "doi": "10.1145/2785830.2785840"
    },
    {
      "text": "Shelly D. Farnham and Elizabeth F. Churchill. 2011. Faceted Identity, Faceted Lives: Social and Technical Issues with Being Yourself Online. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11), 359--368.  ",
      "doi": "10.1145/1958824.1958880"
    },
    {
      "text": "Joel E. Fischer, Chris Greenhalgh, and Steve Benford. 2011. Investigating Episodes of Mobile Phone Activity As Indicators of Opportune Moments to Deliver Notifications. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11), 181--190.  ",
      "doi": "10.1145/2037373.2037402"
    },
    {
      "text": "Joel E. Fischer, Nick Yee, Victoria Bellotti, Nathan Good, Steve Benford, and Chris Greenhalgh. 2010. Effects of Content and Time of Delivery on Receptivity to Mobile Interruptions. In Proceedings of the 12th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '10), 103--112.  ",
      "doi": "10.1145/1851600.1851620"
    },
    {
      "text": "James Fogarty, Scott E. Hudson, Christopher G. Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C. Lee, and Jie Yang. 2005. Predicting human interruptibility with sensors. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 1 (2005), 119--146.  ",
      "doi": "10.1145/1057237.1057243"
    },
    {
      "text": "Claudio Forlivesi and Utku Günay Acer. Mindful Interruptions: A Lightweight System for Managing Interruptibility on Wearables. 6.",
      "doi": ""
    },
    {
      "text": "Simon Gächter, Chris Starmer, and Fabio Tufano. 2015. Measuring the Closeness of Relationships: A Comprehensive Evaluation of the ?Inclusion of the Other in the Self\" Scale. PLOS ONE 10, 6 (June 2015), e0129478.",
      "doi": ""
    },
    {
      "text": "Jeffrey A. Hall and Nancy K. Baym. 2012. Calling and texting (too much): Mobile maintenance expectations, (over)dependence, entrapment, and friendship satisfaction. New Media & Society 14, 2 (March 2012), 316--331.",
      "doi": ""
    },
    {
      "text": "Joyce Ho and Stephen S. Intille. 2005. Using context-aware computing to reduce the perceived burden of interruptions from mobile devices. In Proceedings of the SIGCHI conference on Human factors in computing systems, 909--918. Retrieved February 20, 2014 from http://dl.acm.org.proxy.lib.umich.edu/citation.cfm?id=1055100  ",
      "doi": "10.1145/1054972.1055100"
    },
    {
      "text": "G. H. (Henri) ter Hofte. 2007. Xensible Interruptions from Your Mobile Phone. In Proceedings of the 9th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '07), 178--181.  ",
      "doi": "10.1145/1377999.1378003"
    },
    {
      "text": "Scott E Hudson, James Fogarty, Christopher G Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C Lee, and Jie Yang. Predicting Human Interruptibility with Sensors: A Wizard of Oz Feasibility Study. 8.",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2008. Effects of intelligent notification management on users and their tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 93-- 102. Retrieved October 24, 2015 from http://dl.acm.org.proxy.lib.umich.edu/citation.cfm?id=1357070  ",
      "doi": "10.1145/1357054.1357070"
    },
    {
      "text": "Shamsi T. Iqbal and Eric Horvitz. 2010. Notifications and Awareness: A Field Study of Alert Usage and Preferences. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10), 27--30.  ",
      "doi": "10.1145/1718918.1718926"
    },
    {
      "text": "Ellen Isaacs, Alan Walendowski, Steve Whittaker, Diane J. Schiano, and Candace Kamm. 2002. The Character, Functions, and Styles of Instant Messaging in the Workplace. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work (CSCW '02), 11--20.  ",
      "doi": "10.1145/587078.587081"
    },
    {
      "text": "Kyung-Hee Kim and Haejin Yun. 2007. Cying for Me, Cying for Us: Relational Dialectics in a Korean Social Network Site. J Comput Mediat Commun 13, 1 (October 2007), 298--318.  ",
      "doi": "10.1111/j.1083-6101.2007.00397.x"
    },
    {
      "text": "Richard Ling and Birgitte Yttri. 2002. 10 Hyper--coordination via mobile phones in Norway. Perpetual contact: Mobile communication, private talk, public performance 139, (2002). ",
      "doi": "10.5555/644547.644558"
    },
    {
      "text": "Lisa M. Mai, Rainer Freudenthaler, Frank M. Schneider, and Peter Vorderer. 2015. \"I know you've seen it!\" Individual and social factors for users' chatting behavior on Facebook. Computers in Human Behavior 49, Supplement C (August 2015), 296--302.  ",
      "doi": "10.1016/j.chb.2015.01.074"
    },
    {
      "text": "Peter V. Marsden and Karen E. Campbell. 1984. Measuring Tie Strength. Soc Forces 63, 2 (December 1984), 482--501.",
      "doi": ""
    },
    {
      "text": "Abhinav Mehrotra, Mirco Musolesi, Robert Hendley, and Veljko Pejovic. 2015. Designing Content-driven Intelligent Notification Mechanisms for Mobile Applications. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 813--824.  ",
      "doi": "10.1145/2750858.2807544"
    },
    {
      "text": "Abhinav Mehrotra, Veljko Pejovic, Jo Vermeulen, Robert Hendley, and Mirco Musolesi. 2016. My Phone and Me: Understanding People's Receptivity to Mobile Notifications. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 1021--1032.  ",
      "doi": "10.1145/2858036.2858566"
    },
    {
      "text": "Henry Navarro, Giovanna Miritello, Arturo Canales, and Esteban Moro. 2017. Temporal patterns behind the strength of persistent ties. EPJ Data Sci. 6, 1 (December 2017), 31.",
      "doi": ""
    },
    {
      "text": "Tadashi Okoshi, Julian Ramos, Hiroki Nozaki, Jin Nakazawa, Anind K. Dey, and Hideyuki Tokuda. 2015. Reducing Users' Perceived Mental Effort Due to Interruptive Notifications in Multi-device Mobile Environments. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 475--486.  ",
      "doi": "10.1145/2750858.2807517"
    },
    {
      "text": "Fatih Kursat Ozenc and Shelly D. Farnham. 2011. Life \"modes\" in social media. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11, 561.",
      "doi": ""
    },
    {
      "text": "Chunjong Park, Junsung Lim, Juho Kim, Sung-Ju Lee, and Dongman Lee. 2017. Don'T Bother Me. I'M Socializing!: A Breakpoint-Based Smartphone Notification System. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 541--554.  ",
      "doi": "10.1145/2998181.2998189"
    },
    {
      "text": "Malcolm R Parks and Kory Floyd. 2006. Making Friends in Cyberspace. J. Comput. Mediat. Commun. 1, 4 (2006), 0--0.",
      "doi": ""
    },
    {
      "text": "Veljko Pejovic and Mirco Musolesi. 2014. InterruptMe: Designing Intelligent Prompting Mechanisms for Pervasive Applications. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14), 897--908.  ",
      "doi": "10.1145/2632048.2632062"
    },
    {
      "text": "Veljko Pejovic, Mirco Musolesi, and Abhinav Mehrotra. 2015. Investigating The Role of Task Engagement in Mobile Interruptibility. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '15), 1100--1105.  ",
      "doi": "10.1145/2786567.2794336"
    },
    {
      "text": "Jonathan Pettigrew. 2009. Text Messaging and Connectedness Within Close Interpersonal Relationships. Marriage & Family Review 45, 6--8 (August 2009), 697--716.",
      "doi": ""
    },
    {
      "text": "Martin Pielot. 2014. Large-scale Evaluation of Call-availability Prediction. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14), 933--937.  ",
      "doi": "10.1145/2632048.2632060"
    },
    {
      "text": "Martin Pielot, Bruno Cardoso, Kleomenis Katevas, Joan Serrà, Aleksandar Matic, and Nuria Oliver. 2017. Beyond Interruptibility: Predicting Opportune Moments to Engage Mobile Phone Users. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3 (September 2017), 91:1--91:25.  ",
      "doi": "10.1145/3130956"
    },
    {
      "text": "Martin Pielot, Karen Church, and Rodrigo de Oliveira. 2014. An Insitu Study of Mobile Phone Notifications. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14), 233--242.  ",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "Martin Pielot, Rodrigo de Oliveira, Haewoon Kwak, and Nuria Oliver. 2014. Didn't you see my message?: predicting attentiveness to mobile instant messages. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, 3319--3328. Retrieved November 5, 2014 from http://dl.acm.org.proxy.lib.umich.edu/citation.cfm?id=2556973  ",
      "doi": "10.1145/2556288.2556973"
    },
    {
      "text": "Martin Pielot, Amalia Vradi, and Souneil Park. Dismissed! A Detailed Exploration of How Mobile Phone Users Handle Push Notifications. 11.",
      "doi": ""
    },
    {
      "text": "Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2014. SensorBased identification of opportune Moments for triggering notifications. Pervasive Computing, IEEE 13, 1 (2014), 22--29.  ",
      "doi": "10.1109/MPRV.2014.15"
    },
    {
      "text": "Artemio Ramirez and Kathy Broneck. 2009. 'IM me': Instant messaging as relational maintenance and everyday communication. Journal of Social and Personal Relationships 26, 2--3 (March 2009), 291--314.",
      "doi": ""
    },
    {
      "text": "Sam G. B. Roberts and Robin I. M. Dunbar. 2011. Communication in social networks: Effects of kinship, network size, and emotional closeness. Personal Relationships 18, 3 (September 2011), 439--452.",
      "doi": ""
    },
    {
      "text": "Stephanie Rosenthal, Anind K. Dey, and Manuela Veloso. 2011. Using Decision-Theoretic Experience Sampling to Build Personalized Mobile Phone Interruption Models. In Pervasive Computing, Kent Lyons, Jeffrey Hightower and Elaine M. Huang (eds.). Springer Berlin Heidelberg, 170--187. Retrieved February 19, 2014 from http://link.springer.com.proxy.lib.umich.edu/chapter/10.1007/978--3642--21726--5_11 ",
      "doi": "10.5555/2021975.2021991"
    },
    {
      "text": "Erin K Ruppel, Tricia J Burke, and Maura R Cherney. 2017. Channel complementarity and multiplexity in long-distance friends' patterns of communication technology use. New Media & Society (March 2017), 1461444817699995.",
      "doi": ""
    },
    {
      "text": "Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber, and Albrecht Schmidt. 2014. Large-scale Assessment of Mobile Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3055-- 3064.  ",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "Hillol Sarker, Moushumi Sharmin, Amin Ahsan Ali, Md. Mahbubur Rahman, Rummana Bari, Syed Monowar Hossain, and Santosh Kumar. 2014. Assessing the Availability of Users to Engage in Justin-time Intervention in the Natural Environment. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14), 909--920.  ",
      "doi": "10.1145/2632048.2636082"
    },
    {
      "text": "Florian Schulze and Georg Groh. 2014. Studying How Character of Conversation Affects Personal Receptivity to Mobile Notifications. In Proceedings of the Extended Abstracts of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI EA '14), 1729--1734.  ",
      "doi": "10.1145/2559206.2581320"
    },
    {
      "text": "Florian Schulze and Georg Groh. 2016. Conversational Context Helps Improve Mobile Notification Management. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '16), 518--528.  ",
      "doi": "10.1145/2935334.2935347"
    },
    {
      "text": "Alireza Sahami Shirazi and Niels Henze. 2015. Assessment of Notifications on Smartwatches. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '15), 1111--1116.  ",
      "doi": "10.1145/2786567.2794338"
    },
    {
      "text": "Takahiro Tanaka and Kinya Fujita. 2011. Study of User Interruptibility Estimation Based on Focused Application Switching. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW '11), 721--724.  ",
      "doi": "10.1145/1958824.1958954"
    },
    {
      "text": "Liam D. Turner, Stuart M. Allen, and Roger M. Whitaker. 2015. Push or Delay? Decomposing Smartphone Notification Response Behaviour. In Human Behavior Understanding. Springer, Cham, 69-- 83.  ",
      "doi": "10.1007/978-3-319-24195-1_6"
    },
    {
      "text": "Jessica Vitak. 2014. Facebook Makes the Heart Grow Fonder: Relationship Maintenance Strategies Among Geographically Dispersed and Communication-restricted Connections. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14), 842--853.  ",
      "doi": "10.1145/2531602.2531726"
    },
    {
      "text": "Peter Vorderer, Dorothée Hefner, Leonard Reinecke, and Christoph Klimmt (Eds.). 2017. Permanently Online, Permanently Connected: Living and Communicating in a POPC World (1 edition ed.). Routledge, New York?; London.",
      "doi": ""
    },
    {
      "text": "Jason Wiese, Patrick Gage Kelley, Lorrie Faith Cranor, Laura Dabbish, Jason I. Hong, and John Zimmerman. 2011. Are You Close with Me? Are You Nearby?: Investigating Social Groups, Closeness, and Willingness to Share. In Proceedings of the 13th International Conference on Ubiquitous Computing (UbiComp '11), 197--206.  ",
      "doi": "10.1145/2030112.2030140"
    },
    {
      "text": "Jason Wiese, Jun-Ki Min, Jason I. Hong, and John Zimmerman. 2015. \"You Never Call, You Never Write\": Call and SMS Logs Do Not Always Indicate Tie Strength. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 765--774.  ",
      "doi": "10.1145/2675133.2675143"
    },
    {
      "text": "Fengpeng Yuan, Xianyi Gao, and Janne Lindqvist. 2017. How Busy Are You?: Predicting the Interruptibility Intensity of Mobile Users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 5346--5360.  ",
      "doi": "10.1145/3025453.3025946"
    },
    {
      "text": "Persistence of social signatures in human communication | PNAS. Retrieved September 21, 2018 from http://www.pnas.org/content/111/3/942",
      "doi": ""
    }
  ]
}