{
  "doi": "10.1145/3290605.3300336",
  "title": "`I make up a silly name': Understanding Children's Perception of Privacy Risks Online",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Children under 11 are often regarded as too young to comprehend the implications of online privacy. Perhaps as a result, little research has focused on younger kids' risk recognition and coping. Such knowledge is, however, critical for designing efficient safeguarding mechanisms for this age group. Through 12 focus group studies with 29 children aged 6-10 from UK schools, we examined how children described privacy risks related to their use of tablet computers and what information was used by them to identify threats. We found that children could identify and articulate certain privacy risks well, such as information oversharing or revealing real identities online; however, they had less awareness with respect to other risks, such as online tracking or game promotions. Our findings offer promising directions for supporting children's awareness of cyber risks and the ability to protect themselves online.",
  "authors": [
    {
      "name": "Jun Zhao",
      "institution": "University of Oxford, Oxford, Oxfordshire, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453639687",
      "orcid": "0000-0001-6935-9028"
    },
    {
      "name": "Ge Wang",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365241",
      "orcid": "0000-0003-4656-2175"
    },
    {
      "name": "Carys Dally",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365646",
      "orcid": "missing"
    },
    {
      "name": "Petr Slovak",
      "institution": "King's College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435611500",
      "orcid": "missing"
    },
    {
      "name": "Julian Edbrooke-Childs",
      "institution": "UCL Interaction Centre, University College London London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366008",
      "orcid": "missing"
    },
    {
      "name": "Max Van Kleek",
      "institution": "University of Oxford, Oxford, Oxfordshire, United Kingdom",
      "img": "/do/10.1145/contrib-81328490974/rel-imgonly/max-android.jpg",
      "acmid": "81328490974",
      "orcid": "0000-0003-3873-6366"
    },
    {
      "name": "Nigel Shadbolt",
      "institution": "University of Oxford, Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100351241",
      "orcid": "0000-0002-5085-9724"
    }
  ],
  "references": [
    {
      "text": "2013. Zero to Eight: Children's Media Use in America 2013. Technical Report. Common Sense Media. https://www.commonsensemedia.org/ research/zero-to-eight-childrens-media-use-in-america-2013",
      "doi": ""
    },
    {
      "text": "2018. Call for evidence - Age Appropriate Design Code. https://ico.org.uk/about-the-ico/ico-and-stakeholder-consultations/ call-for-evidence-age-appropriate-design-code/. Accessed: 2018-09.",
      "doi": ""
    },
    {
      "text": "2018. Children and the GDPR. https://ico.org.uk/for-organisations/ guide-to-the-general-data-protection-regulation-gdpr/childrenand-the-gdpr/. Accessed: 2018-08.",
      "doi": ""
    },
    {
      "text": "2018. Children's rights and the GDPR -- are the new consultations creating light or further confusion? http://blogs.lse.ac.uk/ mediapolicyproject/2017/05/11/childrens-rights-and-the-gdprare-the-new-consultations-creating-light-or-further-confusion/. Accessed: 2018-08.",
      "doi": ""
    },
    {
      "text": "2018. Instagram Help Center. https://help.instagram.com/ 116024195217477. Accessed: 2018-08.",
      "doi": ""
    },
    {
      "text": "2019. Must Have Apps for Kids Under Five. https:// www.lifewire.com/great-apps-for-kids-5-and-under-4152990. Accessed: 2019-02",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. Science 347, 6221 (2015), 509--514.",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti, Curtis R Taylor, and Liad Wagman. 2016. The economics of privacy. Journal of Economic Literature 52, 2 (2016).",
      "doi": ""
    },
    {
      "text": "Birch Ann. 2000. The Developmental Psychology-from infancy to adulthood. Bucharest: The Technical Publishing House (2000).",
      "doi": ""
    },
    {
      "text": "Louise Barkhuus. 2012. The mismeasurement of privacy: using contextual integrity to reconsider privacy in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 367--376.  ",
      "doi": "10.1145/2207676.2207727"
    },
    {
      "text": "Susanne Barth and Menno DT De Jong. 2017. The privacy paradox-- Investigating discrepancies between expressed privacy concerns and actual online behavior--A systematic literature review. Telematics and Informatics 34, 7 (2017), 1038--1058.  ",
      "doi": "10.1016/j.tele.2017.04.013"
    },
    {
      "text": "Sebastian Benthall, Seda Gürses, Helen Nissenbaum, Cornell Tech, and NYU Steinhardt MCC. 2017. Contextual Integrity through the Lens of Computer Science. Foundations and Trends in Privacy and Security 2 (2017), 1--69.  ",
      "doi": "10.1561/3300000016"
    },
    {
      "text": "Reuben Binns, Ulrik Lyngs, Max van Kleek, Jun Zhao, Timothy Libert, and Nigel Shadbolt. 2018. Third party tracking in the mobile ecosystem. Proceedings of the 10th International ACM Web Science Conference 2018 (2018).  ",
      "doi": "10.1145/3201064.3201089"
    },
    {
      "text": "Laura Brandimarte, Alessandro Acquisti, and George Loewenstein. 2013. Misplaced confidences privacy and the control paradox. Social Psychological and Personality Science 4, 3 (2013), 340--347.",
      "doi": ""
    },
    {
      "text": "Tanya Byron. 2010. Do we have safer children in a digital world? A review of progress since the 2008 Byron Review. (2010).",
      "doi": ""
    },
    {
      "text": "Seth Chaiklin. 2003. The zone of proximal development in Vygotsky's analysis of learning and instruction. Vygotsky's educational theory in cultural context 1 (2003), 39--64.",
      "doi": ""
    },
    {
      "text": "Michael Chandler, Anna S Fritz, and Suzanne Hala. 1989. Small-scale deceit: Deception as a marker of two-, three-, and four-year-olds' early theories of mind. Child development (1989), 1263--1277.",
      "doi": ""
    },
    {
      "text": "Cecilia Sin-Sze Cheung and Eva M Pomerantz. 2011. Parents' involvement in children's learning in the United States and China: Implications for children's academic and emotional adjustment. Child development 82, 3 (2011), 932--950.",
      "doi": ""
    },
    {
      "text": "Malinda J Colwell, Kimberly Corson, Anuradha Sastry, and Holly Wright. 2016. Secret keepers: children's theory of mind and their conception of secrecy. Early Child Development and Care 186, 3 (2016), 369--381.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission et al. 2015. Kids' Apps Disclosures Revisited.",
      "doi": ""
    },
    {
      "text": "Natalia Criado and Jose M Such. 2015. Implicit contextual integrity in online social networks. Information Sciences 325 (2015), 48--69.  ",
      "doi": "10.1016/j.ins.2015.07.013"
    },
    {
      "text": "Harry Daniels. 2005. An introduction to Vygotsky. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Allison Druin. 1999. The Role of Children in the Design Technology. Technical Report.",
      "doi": ""
    },
    {
      "text": "Jill Dunn, Colette Gray, Pamela Moffett, and Denise Mitchell. 2018. 'It's more funner than doing work': children's perspectives on using tablet computers in the early years of school. Early Child Development and Care 188, 6 (2018), 819--831.",
      "doi": ""
    },
    {
      "text": "Catherine D'Ignazio and Rahul Bhargava. 2015. Approaches to building big data literacy. In Proceedings of the Bloomberg Data for Good Exchange Conference.",
      "doi": ""
    },
    {
      "text": "Lesley-Anne Ey and C Glenn Cupit. 2011. Exploring young children's understanding of risks associated with Internet usage and their concepts of management strategies. Journal of Early Childhood Research 9, 1 (2011), 53--65.",
      "doi": ""
    },
    {
      "text": "Jennifer Fane, Colin MacDougall, Jessie Jovanovic, Gerry Redmond, and Lisa Gibbs. 2018. Exploring the use of emoji as a visual research method for eliciting young children's voices in childhood research. Early Child Development and Care 188, 3 (2018), 359--374.",
      "doi": ""
    },
    {
      "text": "Joseph L Fleiss. 1971. Measuring nominal scale agreement among many raters. Psychological bulletin 76, 5 (1971), 378.",
      "doi": ""
    },
    {
      "text": "Melissa Freeman and Sandra Mathison. 2008. Researching children's experiences. The Guilford Press.",
      "doi": ""
    },
    {
      "text": "Arup Kumar Ghosh, Karla Badillo-Urquiola, Shion Guha, Joseph J. LaViola Jr, and Pamela J. Wisniewski. 2018. Safety vs. Surveillance: What Children Have to Say About Mobile Apps for Parental Control. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 124, 14 pages.  ",
      "doi": "10.1145/3173574.3173698"
    },
    {
      "text": "Faith Gibson. 2007. Conducting focus groups with children and young people: strategies for success. Journal of research in nursing 12, 5 (2007), 473--483.",
      "doi": ""
    },
    {
      "text": "Sheila Greene and Diane Hogan. 2005. Researching children's experience: Approaches and methods. Sage.",
      "doi": ""
    },
    {
      "text": "Nancy G Guerra, Kirk R Williams, and Shelly Sadek. 2011. Understanding bullying and victimization during childhood and adolescence: A mixed methods study. Child development 82, 1 (2011), 295--310.",
      "doi": ""
    },
    {
      "text": "Yasmeen Hashish, Andrea Bunt, and James E Young. 2014. Involving children in content control: a collaborative and education-oriented content filtering approach. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 1797--1806.  ",
      "doi": "10.1145/2556288.2557128"
    },
    {
      "text": "Samantha Hautea, Sayamindu Dasgupta, and Benjamin Mako Hill. 2017. Youth perspectives on critical data literacies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 919--930.  ",
      "doi": "10.1145/3025453.3025823"
    },
    {
      "text": "Alexis Hiniker, Hyewon Suh, Sabina Cao, and Julie A Kientz. 2016. Screen time tantrums: how families manage screen media experiences for toddlers and preschoolers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 648--660.  ",
      "doi": "10.1145/2858036.2858278"
    },
    {
      "text": "Haiyan Jia, Pamela J. Wisniewski, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2015. Risk-taking As a Learning Process for Shaping Teen's Online Information Privacy Behaviors. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 583--599.  ",
      "doi": "10.1145/2675133.2675287"
    },
    {
      "text": "Steve Jones, Camille Johnson-Yale, Sarah Millermaier, and Francisco Seoane Pérez. 2009. US college students' Internet use: Race, gender and digital divides. Journal of Computer-Mediated Communication 14, 2 (2009), 244--264.",
      "doi": ""
    },
    {
      "text": "Sharon Judge, Kimberly Floyd, and Tara Jeffs. 2015. Using mobile media devices and apps to promote young children's learning. In Young Children and Families in the information age. Springer, 117--131.",
      "doi": ""
    },
    {
      "text": "Beeban Kidron, Anghrarad Rudkin, Miranda Wolpert, Joanna R. Adler, Andrew K. Przybylski, Elvira Perez Vallejos, Henrietta Bowden-Jones, Joshua J. Chauvin, Kathryn L. Mills, Marina Jirotka, and Julian Childs. 2017. Digital Childhood: Addressing Childhood Development Milestones in the Digital Environment. Technical Report. 5Rights.",
      "doi": ""
    },
    {
      "text": "Priya Kumar, Shalmali Milind naik, Utkarsha Ramesh Devkar, Marshini Chetty, Tamara L. Clegg, and Jessica Vitak. 2018. No Telling Passcodes Out Because They're Private?: Understanding Children's Mental Models of Privacy and Security Online. In Proceedings of ACM HumanComputer Interaction (CSCW '18 Online First). ACM.  ",
      "doi": "10.1145/3134699"
    },
    {
      "text": "Priya Kumar, Jessica Vitak, Marshini Chetty, Tamara L Clegg, Jonathan Yang, Brenna McNally, and Elizabeth Bonsignore. 2018. Co-designing online privacy-related games and stories with children. In Proceedings of the 17th Annual ACM Conference on Interaction Design and Children (IDC'18). doi, Vol. 10.  ",
      "doi": "10.1145/3202185.3202735"
    },
    {
      "text": "Michael E Kummer and Patrick Schulte. 2016. When private information settles the bill: Money and privacy in Google's market for smartphone applications. ZEW-Centre for European Economic Research Discussion Paper 16-031 (2016).",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone. 2006. Children's privacy online: experimenting with boundaries within and beyond the family. (2006).",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone. 2018. Children: a special case for privacy? Intermedia 46, 2 (2018), 18--23.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Alicia Blum-Ross, Jennifer Pavlick, and Kjartan Olafsson. 2018. In the digital home, how do parents support their children and who supports them? Technical Report. LSE.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Alicia Blum-Ross, and Dongmiao Zhang. 2018. What do parents think, and do, about their children's online privacy? Technical Report. LSE.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Julia Davidson, Joanne Bryce, Saqba Batool, Ciaran Haughton, and Anulekha Nandi. 2017. Children's online activities, risks and safety: a literature review by the UKCCIS evidence group. Technical Report. UKCCIS evidence group.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone and Kjartan Olafsson. 2018. When do parents think their child is ready to use the internet independently? Technical Report. LSE.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Mariya Stoilova, and Rishita Nandagiri. 2018. Conceptualising privacy online: what do, and what should, children understand? Parenting for a Digital Future (2018), 1--4.",
      "doi": ""
    },
    {
      "text": "May O Lwin, Andrea JS Stanaland, and Anthony D Miyazaki. 2008. Protecting children's privacy online: How parental mediation strategies affect website safeguard effectiveness. Journal of Retailing 84, 2 (2008), 205--217.",
      "doi": ""
    },
    {
      "text": "Sana Maqsood, Christine Mekhail, and Sonia Chiasson. 2018. A Day in the Life of Jos: A Web-based Game to Increase Children's Digital Literacy. In Proceedings of the 17th ACM Conference on Interaction Design and Children. ACM, 241--252.  ",
      "doi": "10.1145/3202185.3202753"
    },
    {
      "text": "Brenna McNally, Priya Kumar, Chelsea Hordatt, Matthew Louis Mauriello, Shalmali Naik, Leyla Norooz, Alazandra Shorter, Evan Golub, and Allison Druin. 2018. Co-designing Mobile Online Safety Applications with Children. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 523.  ",
      "doi": "10.1145/3173574.3174097"
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys that Listen: A Study of Parents, Children, and Internet-Connected Toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5197--5207.  ",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "Linda Miller and Linda Pound. 2010. Theories and approaches to learning in the early years. Sage.",
      "doi": ""
    },
    {
      "text": "Faye Mishna, Michael Saini, and Steven Solomon. 2009. Ongoing and online: Children and youth's perceptions of cyber bullying. Children and Youth Services Review 31, 12 (2009), 1222--1228.",
      "doi": ""
    },
    {
      "text": "Myfanwy Morgan, Sara Gibbs, Krista Maxwell, and Nicky Britten. 2002. Hearing children's voices: methodological issues in conducting focus groups with children aged 7--11 years. Qualitative research 2, 1 (2002), 5--20.",
      "doi": ""
    },
    {
      "text": "Michelle M Neumann and David L Neumann. 2014. Touch screen tablets and emergent literacy. Early Childhood Education Journal 42, 4 (2014), 231--239.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Wash. L. Rev. 79 (2004), 119.",
      "doi": ""
    },
    {
      "text": "ofcom.org. 2017. Children and parents: media use and attitude report. https://www.ofcom.org.uk/ data/assets/pdf_file/0020/108182/children-parents-media-useattitudes-2017.pdf",
      "doi": ""
    },
    {
      "text": "Kieron OHara. 2016. The Seven Veils of Privacy. IEEE Internet Computing 20, 2 (2016), 86--91.",
      "doi": "10.1109/MIC.2016.34"
    },
    {
      "text": "Luci Pangrazio and Neil Selwyn. 2017. 'My Data, My Bad ...': Young People's Personal Data Understandings and (Counter)Practices. In Proceedings of the 8th International Conference on Social Media & Society (#SMSociety17). ACM, New York, NY, USA, Article 52, 5 pages.  ",
      "doi": "10.1145/3097286.3097338"
    },
    {
      "text": "Stamatis Papadakis, Michail Kalogiannakis, and Nicholas Zaranis. 2016. Comparing tablets and PCs in teaching mathematics: an attempt to improve mathematics competence in early childhood education. Preschool Prim. Educ 4, 2 (2016), 241--253.",
      "doi": ""
    },
    {
      "text": "Chris Quintana, Brian J Reiser, Elizabeth A Davis, Joseph Krajcik, Eric Fretz, Ravit Golan Duncan, Eleni Kyza, Daniel Edelson, and Elliot Soloway. 2004. A scaffolding design framework for software to support science inquiry. The journal of the learning sciences 13, 3 (2004), 337-- 386.",
      "doi": ""
    },
    {
      "text": "Irwin Reyes, Primal Wiesekera, Abbas Razaghpanah, Joel Reardon, Narseo Vallina-Rodriguez, Serge Egelman, and Christian Kreibich. 2017. \"Is Our Children's Apps Learning?\" Automatically Detecting COPPA Violations. In Workshop on Technology and Consumer Protection (ConPro 2017), in conjunction with the 38th IEEE Symposium on Security and Privacy.",
      "doi": ""
    },
    {
      "text": "Irwin Reyes, Primal Wijesekera, Joel Reardon, Amit Elazari Bar On, Abbas Razaghpanah, Narseo Vallina-Rodriguez, and Serge Egelman. 2018. \"Won't Somebody Think of the Children?\" Examining COPPA Compliance at Scale. Proceedings on Privacy Enhancing Technologies 2018, 3 (2018), 63--83.",
      "doi": ""
    },
    {
      "text": "John Schacter and Booil Jo. 2016. Improving low-income preschoolers mathematics achievement with Math Shelf, a preschool tablet computer curriculum. Computers in Human Behavior 55 (2016), 223--229.  ",
      "doi": "10.1016/j.chb.2015.09.013"
    },
    {
      "text": "Cristiana S. Silva, Glívia A.R. Barbosa, Ismael S. Silva, Tatiane S. Silva, Fernando Mourão, and Flávio Coutinho. 2017. Privacy for Children and Teenagers on Social Networks from a Usability Perspective: A Case Study on Facebook. In Proceedings of the 2017 ACM on Web Science Conference (WebSci '17). ACM, New York, NY, USA, 63--71.  ",
      "doi": "10.1145/3091478.3091479"
    },
    {
      "text": "Daniel J Solove. 2008. Understanding privacy. (2008).",
      "doi": ""
    },
    {
      "text": "David W Stewart and Prem N Shamdasani. 2014. Focus groups: Theory and practice. Vol. 20. Sage publications.",
      "doi": ""
    },
    {
      "text": "Matt Tierney and Lakshminarayanan Subramanian. 2014. Realizing privacy by definition in social networks. In Proceedings of 5th AsiaPacific Workshop on Systems. ACM, 6.  ",
      "doi": "10.1145/2637166.2637232"
    },
    {
      "text": "Max Van Kleek, Reuben Binns, Jun Zhao, and Nigel Shadbolt. {n. d.}. XRay Refine: Supporting the Exploration and Refinement of Information Exposure Resulting from Smartphone Apps. In Proceedings of 2018 CHI Conference on Human Factors in Computing Systems. to appear.  ",
      "doi": "10.1145/3173574.3173967"
    },
    {
      "text": "Rick Wash. 2010. Folk Models of Home Computer Security.. In SOUPS. 1--16.  ",
      "doi": "10.1145/1837110.1837125"
    },
    {
      "text": "Margy Whalley. 2017. Involving Parents in Their Children's Learning: A Knowledge-Sharing Approach. Sage.",
      "doi": ""
    },
    {
      "text": "Primal Wijesekera, Arjun Baokar, Ashkan Hosseini, Serge Egelman, David Wagner, and Konstantin Beznosov. 2015. Android Permissions Remystified: A Field Study on Contextual Integrity.. In USENIX Security Symposium. 499--514. ",
      "doi": "10.5555/2831143.2831175"
    },
    {
      "text": "Pamela Wisniewski. 2018. The Privacy Paradox of Adolescent Online Safety: A Matter of Risk Prevention or Risk Resilience? IEEE Security & Privacy 16, 2 (2018), 86--90.",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, Arup Kumar Ghosh, Heng Xu, Mary Beth Rosson, and John M Carroll. 2017. Parental Control vs. Teen Self-Regulation: Is there a middle ground for mobile online safety?. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 51--69.  ",
      "doi": "10.1145/2998181.2998352"
    },
    {
      "text": "Pamela J Wisniewski, Heng Xu, Mary Beth Rosson, and John M Carroll. 2017. Parents Just Don't Understand: Why Teens Don't Talk to Parents about Their Online Risk Experiences.. In CSCW. 523--540.  ",
      "doi": "10.1145/2998181.2998236"
    },
    {
      "text": "Yaxing Yao, Davide Lo Re, and Yang Wang. 2017. Folk Models of Online Behavioral Advertising.. In CSCW. 1957--1969.  ",
      "doi": "10.1145/2998181.2998316"
    },
    {
      "text": "Frances Zhang, Fuming Shih, and Daniel Weitzner. 2013. No surprises: measuring intrusiveness of smartphone applications by detecting objective context deviations. In Proceedings of the 12th ACM workshop on Workshop on privacy in the electronic society. ACM, 291--296.  ",
      "doi": "10.1145/2517840.2517864"
    },
    {
      "text": "Leah Zhang-Kennedy, Yomna Abdelaziz, and Sonia Chiasson. 2017. Cyberheroes: The design and evaluation of an interactive ebook to educate children about online privacy. International Journal of ChildComputer Interaction (2017).",
      "doi": ""
    },
    {
      "text": "Leah Zhang-Kennedy and Sonia Chiasson. 2016. Teaching with an Interactive E-book to Improve Children's Online Privacy Knowledge. In Proceedings of the The 15th International Conference on Interaction Design and Children (IDC '16). ACM, New York, NY, USA, 506--511.  ",
      "doi": "10.1145/2930674.2935984"
    },
    {
      "text": "Leah Zhang-Kennedy, Christine Mekhail, Yomna Abdelaziz, and Sonia Chiasson. 2016. From Nosy Little Brothers to Stranger-Danger: Children and Parents' Perception of Mobile Threats. In Proceedings of the The 15th International Conference on Interaction Design and Children. ACM, 388--399.  ",
      "doi": "10.1145/2930674.2930716"
    }
  ]
}