{
  "doi": "10.1145/3290605.3300840",
  "title": "Care and Design: An Ethnography of Mutual Recognition in the Context of Advanced Dementia",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "While there have been considerable developments in designing for dementia within HCI, there is still a lack of empirical understanding of the experience of people with advanced dementia and the ways in which design can support and enrich their lives. In this paper, we present our findings from a long-term ethnographic study, which aimed to gain an understanding of their lived experience and inform design practices for and with people with advanced dementia in residential care. We present our findings using the social theory of recognition as an analytic lens to account for recognition in practice and its challenges in care and research. We discuss how we, as the HCI community, can pragmatically engage with people with advanced dementia and propose a set of considerations for those who wish to design for and with the values of recognition theory to promote collaboration, agency and social identity in advanced dementia care.",
  "tags": [
    "recognition theory",
    "dementia",
    "ethnography",
    "experience-centered design"
  ],
  "authors": [
    {
      "name": "Sarah Foley",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261534",
      "orcid": "missing"
    },
    {
      "name": "Nadia Pantidi",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418594586",
      "orcid": "missing"
    },
    {
      "name": "John McCarthy",
      "institution": "University College Cork, Cork, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406600199",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jeffrey C Alexander and Maria Pia Lara. 1996. Honneth's new critical theory of recognition. New Left Review: p. 126--136",
      "doi": ""
    },
    {
      "text": "Rita Maldonado Branco, Joana Quental, and Oscar Ribeiro. 2016. Playing with personalisation and openness in a codesign project involving people with dementia. In Proceedings of the 14th Participatory Design Conference on Full papers - PDC '16. 61--70.  ",
      "doi": "10.1145/2940299.2940309"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology. 3,2: 77--101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Claire Craig and John Killick. 2012. Creativity and communication in persons with dementia: a practical guide. London, UK: Jessica Kingsley Publishers,.",
      "doi": ""
    },
    {
      "text": "Anna Day, Ian James, Thomas Meyer, and David Lee. 2011. Do people with dementia find lies and deception in dementia care acceptable? Aging & Mental Health. 15,7: 822--829.",
      "doi": ""
    },
    {
      "text": "Jean-Philippe Deranty. 2009. Beyond Communication: A Critical Study of Axel Honneth's Social Philosophy. Leiden: Brill.",
      "doi": ""
    },
    {
      "text": "Murna Downs. 2000. Dementia in a socio-cultural context: an idea whose time has come. Ageing and Society. 20,3: 369--375.",
      "doi": ""
    },
    {
      "text": "Robert M. Emerson, Rachel I. Fretz, and Linda L. Shaw. 2001. Participant observation and fieldnotes. In Handbook of ethnography. 352--368.",
      "doi": ""
    },
    {
      "text": "Nancy Fraser. 2003. Distorted beyond all recognition: a rejoinder to Axel Honneth. Redistribution or recognition: 198--236.",
      "doi": ""
    },
    {
      "text": "Nancy Fraser. 1996. Justice Interruptus: Critical Reflections on the \"Postsocialist\" Condition. London: Routledge",
      "doi": ""
    },
    {
      "text": "Mary Galvin. 2016. Supporting positive interactions within dementia relationships of care. Ph.D Disseration. University College Cork, Ireland. Retreived 13th July 2018, from https://cora.ucc.ie/handle/10468/3541'show=full",
      "doi": ""
    },
    {
      "text": "Paul Michael Garrett. 2009. Recognizing the limitations of the political theory of recognition: Axel Honneth, Nancy Fraser and social work. British Journal of Social Work. 40,5: 1517--1533.",
      "doi": ""
    },
    {
      "text": "Paul Michael Garrett. 2010. Recognizing the Limitations of the Political Theory of Recognition: Axel Honneth, Nancy Fraser and Social Work. The British Journal of Social Work. 40,5: 1517--1533.",
      "doi": ""
    },
    {
      "text": "Paul Michael Garrett. 2013. Social work and social theory: Making connections. Vol. 99. Policy Press.",
      "doi": ""
    },
    {
      "text": "Niels Hendriks, Liesbeth Huybrechts, Andrea Wilkinson, and Karin Slegers. 2014.Challenges in doing participatory design with people with dementia. In Proceedings of the 13th Participatory Design Conference on Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts PDC'14 - volume 2. 33--36.  ",
      "doi": "10.1145/2662155.2662196"
    },
    {
      "text": "James Hodge, Madeline Balaam, Sandra Hastings, and Kellie Morrissey. 2018. Exploring the Design of Tailored Virtual Reality Experiences for People with Dementia. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM: Montreal QC, Canada. 1--13.  ",
      "doi": "10.1145/3173574.3174088"
    },
    {
      "text": "Axel Honneth. 1996. The struggle for recognition: The moral grammar of social conflicts. Mit Press.",
      "doi": ""
    },
    {
      "text": "Axel Honneth. 2001. Recognition or redistribution? Theory, Culture & Society. 18,2--3: 43--55.",
      "doi": ""
    },
    {
      "text": "Axel Honneth. 2003. Redistribution as recognition: A response to Nancy Fraser. Redistribution or recognition: 110--197.",
      "doi": ""
    },
    {
      "text": "Axel Honneth. 1996. The struggle for recognition: The moral grammar of social conflicts. Cambridge: MIT Press.",
      "doi": ""
    },
    {
      "text": "Jaakko Hyry, Goshiro Yamamoto, and Petri Pulli. 2011. Requirements guideline of assistive technology for people suffering from dementia. In Proceedings of the 4th International Symposium on Applied Sciences in Biomedical and Communication Technologies. ACM: Barcelona, Spain. 1--5.  ",
      "doi": "10.1145/2093698.2093737"
    },
    {
      "text": "Tom Kitwood. 1993. Towards a Theory of Dementia Care: The Interpersonal Process. Ageing and Society, 13, 1: 51--67.",
      "doi": ""
    },
    {
      "text": "Tom Kitwood, Dementia Reconsidered. 1997, London. : Open University Press.",
      "doi": ""
    },
    {
      "text": "Pia Kontos and Gary Naglie. 2007. Bridging theory and practice: Imagination, the body, and person-centred dementia care. Dementia. 6(4): 549--569.",
      "doi": ""
    },
    {
      "text": "Jane McKeown, Amanda Clarke, Christine Ingleton, Ryan Tony, and Julie Repper. 2010. The use of life story work with people with dementia to enhance person-centred care. International Journal of Older People Nursing. 5,2: 148--158.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. A Critical Lens on Dementia and Design in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM: Denver, Colorado, USA. 2175--2188.  ",
      "doi": "10.1145/3025453.3025522"
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. Supporting People with Dementia in Digital Social Sharing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. 2149--2162.  ",
      "doi": "10.1145/3025453.3025586"
    },
    {
      "text": "Stephen Lindsay, Katie Brittain, Daniel Jackson, Cassim Ladha, Karim Ladha, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM: Austin, Texas, USA. 521--530.  ",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Nam Tung Ly, Audrey Serna, Samir Aknine, and rn Hurtienne. 2016. Towards Supporting Caregivers to Monitor the Whereabouts of People with Dementia. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. ACM: Gothenburg, Sweden. 1--4.  ",
      "doi": "10.1145/2971485.2971565"
    },
    {
      "text": "John McCarthy and Peter Wright. 2007. Technology as Experience. The MIT Press. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "John McCarthy and Peter Wright. 2015. Taking {A}part: The Politics and Aesthetics of Participation in Experience-Centered Design. The MIT Press. 208. ",
      "doi": "10.5555/2742697"
    },
    {
      "text": "George Herbert Mead. 1934. Mind, self and society. Vol. 111. Chicago: University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Bere Miesen. 1992. Attachment theory and dementia. Caregiving in dementia. Research and applications 1: 38--56.",
      "doi": ""
    },
    {
      "text": "Susan Mitchell, Joan Teno, Dan Kiely, Michele Shaffer, Richard Jones, Holly Prigerson, Ladislav Volicer, Jane Givens, and Mary Beth Hamel. 2009. The clinical course of advanced dementia. New England Journal of Medicine. 361,16: 1529--1538.",
      "doi": ""
    },
    {
      "text": "Kellie Morrissey. 2017. 'I'm a rambler, I'm a gambler, I'm a long way from home': exploring participation through music and digital design in dementia care. Ph.D Disseration. University College Cork, Irelan. Retrieved 11th July 2018, from https://cora.ucc.ie/handle/10468/3524",
      "doi": ""
    },
    {
      "text": "Kellie Morrissey and John McCarthy. 2015. Creative and Opportunistic Use of Everyday Music Technologies in a Dementia Care Unit. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition - C&C '15. 295--298.  ",
      "doi": "10.1145/2757226.2757228"
    },
    {
      "text": "Kellie Morrissey, John McCarthy, and Nadia Pantidi. 2017. The Value of Experience-Centred Design Approaches in Dementia Research Contexts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM: Denver, Colorado, USA. 1326--1338.  ",
      "doi": "10.1145/3025453.3025527"
    },
    {
      "text": "Wendy Moyle, Ursula Kellett, Alison Ballantyne, and Natalie Gracia. 2011. Dementia and loneliness: An Australian perspective. Journal of clinical nursing. 20, 9--10: 1445--1453.",
      "doi": ""
    },
    {
      "text": "Maurice Mulvenna, Chris Nugent, Ferial Moelaert, David Craig, Rose-Marie Droes, and Johan Bengtsson, Supporting people with dementia using pervasive healthcare technologies, in Supporting people with dementia using pervasive health technologies. 2010, Springer. 3--14.",
      "doi": "10.5555/1738959"
    },
    {
      "text": "Mike Nolan, Sue Davies, and Jayne Brown. 2006. Transitions in care homes: towards relationship-centred care using the 'Senses Framework'. Quality in Ageing and Older Adults. 7, 3: 5--14.",
      "doi": ""
    },
    {
      "text": "Alison Phinney, Habib Chaudhury, and Deborah L. O'Connor. 2007. Doing as much as I can do: The meaning of activity for people with dementia. Aging and Mental Health. 11,4: 384--393.",
      "doi": ""
    },
    {
      "text": "Steven Sabat. 2002. Surviving Manifestations of Selfhood in Alzheimer's Disease: A case study. Dementia 1,1: 25--36.",
      "doi": ""
    },
    {
      "text": "Marijke Span, Marike Hettinga, Myrra Vernooij-Dassen, Jan Eefsting, and Carolien Smits. 2013. Involving people with dementia in the development of supportive IT applications: a systematic review. Ageing research reviews. 12,2: 535--551.",
      "doi": ""
    },
    {
      "text": "Alex Stephens, Richard Cheston, and Kate Gleeson. 2012. An exploration into the relationships people with dementia have with physical objects: An ethnographic study. Dementia. 12, 6: 697--712.",
      "doi": ""
    },
    {
      "text": "Janelle S. Taylor. 2008. On recognition, caring, and dementia. Medical anthropology quarterly. 22,4: 313--335.",
      "doi": ""
    },
    {
      "text": "Cathy Treadaway and Gail Kenning. 2015. Designing Sensory ETextiles for Dementia. In The Third International Conference on Design Creativity. The Design Society, 2015.",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM: Paris, France. 2617--2626.  ",
      "doi": "10.1145/2470654.2481363"
    },
    {
      "text": "Daniel Welsh, Kellie Morrissey, Sarah Foley, Roisin McNaney, Christos Salis, John McCarthy, and Jowhn Vines. 2018. Ticket to Talk: Supporting Conversation between Young People and People with Dementia through Digital Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI'18. 1--14.  ",
      "doi": "10.1145/3173574.3173949"
    },
    {
      "text": "Peter Wright and John McCarthy. 2010. Experience-centered design: designers, users, and communities in dialogue. Synthesis Lectures on Human-Centered Informatics. 3, 1: 1--123. ",
      "doi": "10.5555/1855065"
    }
  ]
}