{
  "doi": "10.1145/3290605.3300670",
  "title": "Mazi: Tangible Technologies as a Channel for Collaborative Play",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "This paper investigates how haptic and auditory stimulation can be playfully implemented as an accessible and stimulating form of interaction for children. We present the design of Mazi, a sonic Tangible User Interface (TUI) designed to encourage spontaneous and collaborative play between children with high support needs autism. We report on a five week study of Mazi with five children aged between 6 and 9 years old at a Special Education Needs (SEN) school in London, UK. We found that collaborative play emerged from the interaction with the system especially in regards to socialization and engagement. Our study contributes to exploring the potential of user-centered TUI development as a channel to facilitate social interaction while providing sensory regulation for children with SENs.",
  "tags": [
    "smart textiles",
    "sensory integration",
    "play",
    "children",
    "autism",
    "tangible user interfaces",
    "social interaction"
  ],
  "authors": [
    {
      "name": "Antonella Nonnis",
      "institution": "Queen Mary University of London, London, United Kingdom",
      "img": "/do/10.1145/contrib-99659365252/rel-imgonly/99659365252.jpg",
      "acmid": "99659365252",
      "orcid": "missing"
    },
    {
      "name": "Nick Bryan-Kinns",
      "institution": "Queen Mary University of London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100483855/rel-imgonly/webimagenbk.jpg",
      "acmid": "81100483855",
      "orcid": "0000-0002-1382-2914"
    }
  ],
  "references": [
    {
      "text": "Schopler, E. and Mesibov, G. B., eds (1987) Neurobiological Issues in Autism, Plenum Press",
      "doi": ""
    },
    {
      "text": "Soundbeam Project. Soundbeam. 1989. Retrieved December 20, 2018 from https://www.soundbeam.co.uk",
      "doi": ""
    },
    {
      "text": "Meckin, D., & Bryan-kinns, N. (2013). moosikMasheens?: Music, Motion and Narrative with Young People who have Complex Needs. Idc 2013, 66--73.  ",
      "doi": "10.1145/2485760.2485776"
    },
    {
      "text": "Hardy, M. W., & LaGasse, A. B. (2013). Rhythm, movement, and autism: using rhythmic rehabilitation research as a model for autism. Frontiers in Integrative Neuroscience, 7, 19.",
      "doi": ""
    },
    {
      "text": "Tam, V., Gelsomini, M., & Garzotto, F. (2017). Polipo a Tangible Toy for Children with Neurodevelopmental Disorders. Proceedings of the Tenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI 17,11--20.  ",
      "doi": "10.1145/3024969.3025006"
    },
    {
      "text": "Marshall, P., Rogers, Y. and Hornecker, E. Are tangible interfaces really any better than other kinds of interfaces? In: CHI'07 workshop on Tangible User Interfaces in Context & Theory, 28 April 2007, San Jose, California, USA.",
      "doi": ""
    },
    {
      "text": "Schopler, E., Van Bourgondien, M. E., Wellman, G. J.,& Love, S. R. (2010). Childhood Autism Rating Scale, 1971 (1978), 1978--1980.",
      "doi": ""
    },
    {
      "text": "Tsang SKM, Shek DTL, Lam LL, Tang FLY, Cheung PMP (2007) Brief report: application of the TEEACH program on chinese pre-school children with autism: does culture make a difference? J Autism Dev Dis 37: 390--396.",
      "doi": ""
    },
    {
      "text": "Shaer, O. (2009). Tangible User Interfaces: Past, Present, and Future Directions. Foundations and Trends® in Human--Computer Interaction, 3 (1--2), 1- 137.  ",
      "doi": "10.1561/1100000026"
    },
    {
      "text": "Luff, P., Jirotka, M., Yamashita, N., Kuzuoka, H., Heath, C., & Eden, G. (2013). Embedded interaction. ACM Transactions on ComputerHuman Interaction, 20(1), 1--22.  ",
      "doi": "10.1145/2442106.2442112"
    },
    {
      "text": "Hornecker, E., Marshall, P., & Rogers, Y. (2007). From entry to access: How shareability comes about. Designing Pleasurable Products and Interfaces.  ",
      "doi": "10.1145/1314161.1314191"
    },
    {
      "text": "Nind M. & Hewett D. (1994) Access to Communication: Developing the Basics of Communication with People with Severe Learning Difficulties through Intensive Interaction. David Fulton, London, GB.",
      "doi": ""
    },
    {
      "text": "Julie A. Kientz, Matthew S. Goodwin, Gillian R. Hayes, and Gregory D. Abowd. 2013. Interactive Technologies for Autism (1st ed.). Morgan & Claypool Publishers. Retrieved December 21, 2018 from https://www.morganclaypool.com/doi/suppl/10.2200/S00533ED1V01 Y201309ARH004/suppl_file/Kientz_Ch1.pdf ",
      "doi": "10.5555/2613712"
    },
    {
      "text": "Jeong, S., Breazeal, C., Logan, D., & Weinstock, P. (2017). Huggable: Impact of embodiment on promoting verbal and physical engagement for young pediatric inpatients. RO-MAN 2017 - 26th IEEE International Symposium on Robot and Human Interactive Communication, 2017--Janua, 121--126.",
      "doi": ""
    },
    {
      "text": "Hendrix, K., van Herk, R., Verhaegh, J., & Markopoulos, P. (2009). Increasing children's social competence through games, an exploratory study. Proceedings of the 8th International Conference on Interaction Design and Children - IDC '09, 182.  ",
      "doi": "10.1145/1551788.1551823"
    },
    {
      "text": "Kern, P., & Aldridge, D. (2006). Using Embedded Music Therapy Interventions to Support Outdoor Play of Young Children with Autism in an Inclusive Community-Based Child Care Program. Journal of Music Therapy, 43(4), 270--294.",
      "doi": ""
    },
    {
      "text": "Silva, G. F. M., Raposo, A., & Suplino, M. (2014). Collaborative Strategies in Multitouch Tabletop to Encourage Social Interaction in People with Autism. Proceedings of the XV International Conference on Human Computer Interaction - Interacción '14, 1--2.  ",
      "doi": "10.1145/2662253.2662266"
    },
    {
      "text": "Winoto, P., & Guan, A. (2016). \" I will Help You Pass the Puzzle Piece to Your Partner if This is What You Want Me to \": The Design of Collaborative Puzzle Games to Train Chinese Children with Autism Spectrum Disorder Joint Attention Skills. ACM SIGCHI Conference on Interaction Design and Children 2016, 601--606.  ",
      "doi": "10.1145/2930674.2936012"
    },
    {
      "text": "Amani Indunil Soysa, Abdullah Al Mahmud, and Blair Kuys. 2018. Co-designing tablet computer applications with Sri Lankan practitioners to support children with ASD. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18). ACM, New York, NY, USA, 413--419.  ",
      "doi": "10.1145/3202185.3202764"
    },
    {
      "text": "Zhiglova, Y., & Yulia. (2018). The Interactive Carpet - Smart Textile Interface for Children on Autism Spectrum Disorder. Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction - TEI '18, 712--714.  ",
      "doi": "10.1145/3173225.3173341"
    },
    {
      "text": "Sitdhisanguan, K., Chotikakamthorn, N., Dechaboon, A., & Out, P. (2012). Using tangible user interfaces in computer-based training systems for low-functioning autistic children. Personal and Ubiquitous Computing, 16(2), 143--155.  ",
      "doi": "10.1007/s00779-011-0382-4"
    },
    {
      "text": "Farr, W., Yuill, N., & Raffle, H. (2010). Social benefits of a tangible user interface for children with Autistic Spectrum Conditions. Autism, 14(3), 237--252.",
      "doi": ""
    },
    {
      "text": "Vazquez, V., Cardenas, C., Cibrian, F. L., & Tentori, M. (2016). Designing a Musical Fabric-Based Surface to Encourage Children with Autism to Practice Motor Movements. Proceedings of the 6th Mexican Conference on Human-Computer Interaction - MexIHC'16, 1--4.  ",
      "doi": "10.1145/2967175.2967384"
    },
    {
      "text": "Villafuerte, L., Markova, M., & Jorda, S. (2012). Acquisition of social abilities through musical tangible user interface. Proceedings of the 2012 ACM Annual Conference Extended Abstracts on Human Factors in Computing Systems Extended Abstracts - CHI EA '12, 745--760.  ",
      "doi": "10.1145/2212776.2212847"
    },
    {
      "text": "Andersson, A.-P., & Cappelen, B. (2013). Designing Empowering Vocal and Tangible Interaction. Proceedings of the International Conference on New Interfaces for Musical Expression, 406--412.",
      "doi": ""
    },
    {
      "text": "Boso, M., Comelli, M., Vecchi, T., Barale, F., & Politi, P. (2009). Exploring musical taste in severely autistic subjects: Preliminary data. In Annals of the New York Academy of Sciences (Vol. 1169, pp. 332--335). Blackwell Publishing Inc.",
      "doi": ""
    },
    {
      "text": "Parncutt, R. (2014). The emotional connotations of major versus minor tonality: One or more origins? Musicae Scientiae, 18(3), 324-- 353.",
      "doi": ""
    },
    {
      "text": "Salimpoor, V. N., Zald, D. H., Zatorre, R. J., Dagher, A., & McIntosh, A. R. (2015). Predictions and the brain: How musical sounds become rewarding. Trends in Cognitive Sciences.",
      "doi": ""
    },
    {
      "text": "Kanner, L. (1943). Autistic disturbances of affective contact. Nervous Child.",
      "doi": ""
    },
    {
      "text": "Wendy Symes and Neil Humphrey. 2011. School factors that facilitate or hinder the ability of teaching assistants to effectively support pupils with autism spectrum disorders (ASDs) in mainstream secondary schools. Journal of Research in Special Educational Needs 11, 3: 153--161.",
      "doi": ""
    },
    {
      "text": "Lillard, A. S. (2013). Playful learning and Montessori education. American Journal of Play, 5(2), 157--186. Retrieved from http://files.eric.ed.gov/fulltext/EJ1003949.pdf",
      "doi": ""
    },
    {
      "text": "Mastrangelo, S. (2009). Play and the child with autism spectrum disorder: From possibilities to practice. International Journal of Play Therapy, 18(1), 13--30.",
      "doi": ""
    },
    {
      "text": "Prizant, BM, Wetherby, AM, Rubin, E, Laurent, AC, & Rydell, PJ. (2006). The SCERTS Model: A Comprehensive Educational Approach for Children with Autism Spectrum Disorders, Volume I Assessment. Baltimore: Paul H. Brookes. P 166--188",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association. (2013). Diagnostic and Statistical Manual of Mental Disorders, Fifth Edition. Arlington, VA, American Psychiatric Association, Web. Mazi: Tangible Technologies as a Channel for Collaborative Play CHI 2019, May 4--9, 2019, Glasgow, Scotland UK",
      "doi": ""
    },
    {
      "text": "Christian Heath, Jon Hindmarch, and P. L. (2012). Video in qualitative research: analysing social interaction in everyday life. London: Sage Publications. Teachers College, Columbia University Working Papers in TESOL & Applied Linguistics, 12(2), 50--54",
      "doi": ""
    },
    {
      "text": "Bhattacharya, A., Gelsomini, M., Pérez-Fuster, P., Abowd, G. D., & Rozga, A. (2015). Designing motion-based activities to engage students with autism in classroom settings. Proceedings of the 14th International Conference on Interaction Design and Children - IDC '15, 69--78.  ",
      "doi": "10.1145/2771839.2771847"
    },
    {
      "text": "Mora-Guiard, J., Crowell, C., Pares, N., & Heaton, P. (2017). Sparking social initiation behaviors in children with Autism through full-body Interaction. International Journal of Child-Computer Interaction, 11, 62--71.",
      "doi": ""
    },
    {
      "text": "2014. Bare Touch Board. https://www.bareconductive.com/",
      "doi": ""
    },
    {
      "text": "2005. Attention Autism. http://ginadavies.co.uk/",
      "doi": ""
    },
    {
      "text": "2014. National curriculum for England. https://www.gov.uk/government/collections/national-curriculum",
      "doi": ""
    },
    {
      "text": "Andreae, H., Andreae, P., Low, J., & Brown, D. (2014). A study of auti: a socially assistive robotic toy. Interaction Design and Children, 245--248.  ",
      "doi": "10.1145/2593968.2610463"
    }
  ]
}