{
  "doi": "10.1145/3290605.3300929",
  "title": "LASEC: Instant Fabrication of Stretchable Circuits Using a Laser Cutter",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "This paper introduces LASEC, the first technique for instant do-it-yourself fabrication of circuits with custom stretchability on a conventional laser cutter and in a single pass. The approach is based on integrated cutting and ablation of a two-layer material using parametric design patterns. These patterns enable the designer to customize the desired stretchability of the circuit, to combine stretchable with non-stretchable areas, or to integrate areas of different stretchability. For adding circuits on such stretchable cut patterns, we contribute routing strategies and a real-time routing algorithm. An interactive design tool assists designers by automatically generating patterns and circuits from a high-level specification of the desired interface. The approach is compatible with off-the-shelf materials and can realize transparent interfaces. Several application examples demonstrate the versatility of the novel technique for applications in wearable computing, interactive textiles, and stretchable input devices.",
  "tags": [
    "laser cutting",
    "fabrication",
    "laser ablation",
    "stretchable circuits",
    "rapid prototyping"
  ],
  "authors": [
    {
      "name": "Daniel Groeger",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/do/10.1145/contrib-99659019607/rel-imgonly/daniel_15_2.png",
      "acmid": "99659019607",
      "orcid": "missing"
    },
    {
      "name": "Jürgen Steimle",
      "institution": "Saarland University, Saarland Informatics Campus, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613099",
      "orcid": "0000-0003-3493-8745"
    }
  ],
  "references": [
    {
      "text": "D. A. Bahamon, Zenan Qi, Harold S. Park, Vitor M. Pereira, and David K. Campbell. 2016. Graphene kirigami as a platform for stretchable and tunable quantum dot arrays. Phys. Rev. B 93 (Jun 2016), 235408. Issue 23.",
      "doi": ""
    },
    {
      "text": "Varun Perumal C and Daniel Wigdor. 2015. Printem: Instant Printed Circuit Boards with Standard Office Printers & Inks. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 243--251.  ",
      "doi": "10.1145/2807442.2807511"
    },
    {
      "text": "Varun Perumal C and Daniel Wigdor. 2016. Foldem: Heterogeneous Object Fabrication via Selective Ablation of Multi-Material Sheets. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5765--5775.  ",
      "doi": "10.1145/2858036.2858135"
    },
    {
      "text": "Terry C Shyu, Pablo Damasceno, Paul M Dodd, Aaron Lamoureux, Lizhi Xu, Matthew Shlian, Max Shtein, Sharon C Glotzer, and Nicholas Kotov. 2015. A kirigami approach to engineering elasticity in nanocomposites through patterned defects. Nature materials 14 (06 2015).",
      "doi": ""
    },
    {
      "text": "Stelian Coros, Bernhard Thomaszewski, Gioacchino Noris, Shinjiro Sueda, Moira Forberg, Robert W. Sumner, Wojciech Matusik, and Bernd Bickel. 2013. Computational Design of Mechanical Characters. ACM Trans. Graph. 32, 4, Article 83 (July 2013), 12 pages.  ",
      "doi": "10.1145/2461912.2461953"
    },
    {
      "text": "Nan-Wei Gong, Jürgen Steimle, Simon Olberding, Steve Hodges, Nicholas Edward Gillian, Yoshihiro Kawahara, and Joseph A. Paradiso. 2014. PrintSense: A Versatile Sensing Technique to Support Multimodal Flexible Surface Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1407--1410.  ",
      "doi": "10.1145/2556288.2557173"
    },
    {
      "text": "Joseph N Grima, Ruben Gatt, Andrew Alderson, and KE Evans. 2005. On the potential of connected stars as auxetic systems. Molecular Simulation 31, 13 (2005), 925--935.",
      "doi": ""
    },
    {
      "text": "Joseph N. Grima, Ruben Gatt, Brian Ellul, and Elaine Chetcuti. 2010. Auxetic behaviour in non-crystalline materials having star or triangular shaped perforations. Journal of Non-Crystalline Solids 356, 37 (2010), 1980 -- 1987. Joint Conferences on Advanced Materials: Functional and Nanonstructured Materials - FNMA'09; Intermolecular and Magnetic Interactions in Matter - IMIM'09.",
      "doi": ""
    },
    {
      "text": "Daniel Groeger, Elena Chong Loo, and Jürgen Steimle. 2016. HotFlex: Post-print Customization of 3D Prints Using Embedded State Change. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 420--432.  ",
      "doi": "10.1145/2858036.2858191"
    },
    {
      "text": "Ying-Shi Guan, Zhuolei Zhang, Yichao Tang, Jie Yin, and Shenqiang Ren. 2018. Kirigami-Inspired Nanoconfined Polymer Conducting Nanosheets with 2000% Stretchability. Advanced Materials 30, 20 (2018), 1706390.",
      "doi": ""
    },
    {
      "text": "Hengyu Guo, Min-Hsin Yeh, Ying-Chih Lai, Yunlong Zi, Changsheng Wu, Zhen Wen, Chenguo Hu, and Zhong Lin Wang. 2016. All-in-One Shape-Adaptive Self-Charging Power Package for Wearable Electronics. ACS Nano 10, 11 (2016), 10580--10588. PMID: 27934070.",
      "doi": ""
    },
    {
      "text": "Nur Al-huda Hamdan, Simon Voelker, and Jan Borchers. 2018. Sketch&Stitch: Interactive Embroidery for E-textiles. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 82, 13 pages.  ",
      "doi": "10.1145/3173574.3173656"
    },
    {
      "text": "P. E. Hart, N. J. Nilsson, and B. Raphael. 1968. A Formal Basis for the Heuristic Determination of Minimum Cost Paths. IEEE Transactions on Systems Science and Cybernetics 4, 2 (July 1968), 100--107.",
      "doi": ""
    },
    {
      "text": "Joe Hillman, Yefim Sukhman, and Chris Risser. 2015. Multiple Wavelength Laser Processing Technology for Flexible Manufacturing. Lasers in Manufacturing Conference 2015 (2015).",
      "doi": ""
    },
    {
      "text": "Steve Hodges, Nicolas Villar, Nicholas Chen, Tushar Chugh, Jie Qi, Diana Nowacka, and Yoshihiro Kawahara. 2014. Circuit Stickers: Peeland-stick Construction of Interactive Electronic Prototypes. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1743--1746.  ",
      "doi": "10.1145/2556288.2557150"
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial Mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 529--539.  ",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant Inkjet Circuits: Lab-based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '13). ACM, New York, NY, USA, 363--372.  ",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Konstantin Klamka and Raimund Dachselt. 2017. IllumiPaper: Illuminated Interactive Paper. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 5605--5618.  ",
      "doi": "10.1145/3025453.3025525"
    },
    {
      "text": "Mina Konakovic, Keenan Crane, Bailin Deng, Sofien Bouaziz, Daniel Piker, and Mark Pauly. 2016. Beyond Developable: Computational Design and Fabrication with Auxetic Materials. ACM Trans. Graph. 35, 4, Article 89 (July 2016), 11 pages.  ",
      "doi": "10.1145/2897824.2925944"
    },
    {
      "text": "Valentin Kunin, Shu Yang, Yigil Cho, Pierre Deymier, and David J. Srolovitz. 2016. Static and dynamic elastic properties of fractal-cut materials. Extreme Mechanics Letters 6 (2016), 103 -- 114.",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov, Piyum Fernando, Emily Ritter, Cassandra Barrett, Jennifer Weiler, and Marissa Rohr. 2018. Screenprinting and TEI: Supporting Engagement with STEAM Through DIY Fabrication of Smart Materials. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18). ACM, New York, NY, USA, 211--220.  ",
      "doi": "10.1145/3173225.3173253"
    },
    {
      "text": "Haresh Lalvani. 2011. Multi-directional and variably expanded sheet material surfaces.",
      "doi": ""
    },
    {
      "text": "C. Y. Lee. 1961. An Algorithm for Path Connections and Its Applications. IRE Transactions on Electronic Computers EC-10, 3 (Sept 1961), 346--365.",
      "doi": ""
    },
    {
      "text": "Tong Lu, Lauren Finkenauer, James Wissman, and Carmel Majidi. 2014. Rapid Prototyping for Soft-Matter Electronics. Advanced Functional Materials 24, 22 (2014), 3351--3356.",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Bastian Kruck, and Patrick Baudisch. 2013. LaserOrigami: Laser-cutting 3D Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2585--2592.  ",
      "doi": "10.1145/2470654.2481358"
    },
    {
      "text": "Steven Nagels, Raf Ramakers, Kris Luyten, and Wim Deferme. 2018. Silicone Devices: A Scalable DIY Approach for Fabricating Self-Contained Multi-Layered Soft Circuits Using Microfluidics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 188, 13 pages.  ",
      "doi": "10.1145/3173574.3173762"
    },
    {
      "text": "Hyunjoo Oh, Tung D Ta, Ryo Suzuki, Mark D Gross, Yoshihiro Kawahara, and Lining Yao. 2018. PEP (3D Printed Electronic Papercrafts): An integrated approach for 3D sculpting paper-based electronic devices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, to appear.  ",
      "doi": "10.1145/3173574.3174015"
    },
    {
      "text": "Simon Olberding, Nan-Wei Gong, John Tiab, Joseph A. Paradiso, and Jürgen Steimle. 2013. A Cuttable Multi-touch Sensor. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 245--254.  ",
      "doi": "10.1145/2501988.2502048"
    },
    {
      "text": "Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. 2015. Foldio: Digital Fabrication of Interactive and Shape-Changing Objects With Foldable Printed Electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 223--232.  ",
      "doi": "10.1145/2807442.2807494"
    },
    {
      "text": "Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: Fabricating Highly Customizable Thin-film Touchdisplays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (UIST '14). ACM, New York, NY, USA, 281--290.  ",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Jifei Ou, Zhao Ma, Jannik Peters, Sen Dai, Nikolaos Vlavianos, and Hiroshi Ishii. 2018. KinetiX - designing auxetic-inspired deformable material structures. Computers & Graphics (2018).",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Kathrin Probst, Teo Babic, Christian Rendl, Anita Vogl, Alex Olwal, and Michael Haller. 2016. FlexTiles: A Flexible, Stretchable, Formable, Pressure-Sensitive, Tactile Input Sensor. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3754--3757.  ",
      "doi": "10.1145/2851581.2890253"
    },
    {
      "text": "E. R. Post, M. Orth, P. R. Russo, and N. Gershenfeld. 2000. E-broidery: Design and Fabrication of Textile-based Computing. IBM Syst. J. 39, 3--4 (July 2000), 840--860.  ",
      "doi": "10.1147/sj.393.0840"
    },
    {
      "text": "Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: An Integrated Approach for Embedding Electronics in Paper Designs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2457--2466.  ",
      "doi": "10.1145/2702123.2702487"
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015. Makers' Marks: Physical Markup for Designing and Fabricating Functional Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 103--108.  ",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: Fabricating Custom Capacitive Touch Sensors to Prototype Interactive Objects. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (UIST '12). ACM, New York, NY, USA, 579--588.  ",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "F Scarpa, P Panayiotou, and G Tomlinson. 2000. Numerical and experimental uniaxial loading on in-plane auxetic honeycombs. The Journal of Strain Analysis for Engineering Design 35, 5 (2000), 383--388.",
      "doi": ""
    },
    {
      "text": "Giovanni Maria Troiano, Esben Warming Pedersen, and Kasper Hornbæk. 2015. Deformable Interfaces for Performing Music. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 377--386.  ",
      "doi": "10.1145/2702123.2702492"
    },
    {
      "text": "Udayan Umapathi, Hsiang-Ting Chen, Stefanie Mueller, Ludwig Wall, Anna Seufert, and Patrick Baudisch. 2015. LaserStacker: Fabricating 3D Objects by Laser Cutting and Welding. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 575--582.  ",
      "doi": "10.1145/2807442.2807512"
    },
    {
      "text": "Nicolas Vachicouras, Christina M. Tringides, Philippe B. Campiche, and Stéphanie P. Lacour. 2017. Engineering reversible elasticity in ductile and brittle thin films supported by a plastic foil. Extreme Mechanics Letters 15 (2017), 63--69.",
      "doi": ""
    },
    {
      "text": "Nirzaree Vadgama and Jürgen Steimle. 2017. Flexy: ShapeCustomizable, Single-Layer, Inkjet Printable Patterns for 1D and 2D Flex Sensing. In Proceedings of the Eleventh International Conference on Tangible, Embedded, and Embodied Interaction (TEI '17). ACM, New York, NY, USA, 153--162.  ",
      "doi": "10.1145/3024969.3024989"
    },
    {
      "text": "Anita Vogl, Patrick Parzer, Teo Babic, Joanne Leong, Alex Olwal, and Michael Haller. 2017. StretchEBand: Enabling Fabric-based Interactions Through Rapid Fabrication of Textile Stretch Sensors. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2617--2627.  ",
      "doi": "10.1145/3025453.3025938"
    },
    {
      "text": "Zhihui Wang, Ling Zhang, Shasha Duan, Hao Jiang, Jianhua Shen, and Chunzhong Li. 2017. Kirigami-patterned highly stretchable conductors from flexible carbon nanotube-embedded polymer films. J. Mater. Chem. C 5 (2017), 8714--8722. Issue 34.",
      "doi": ""
    },
    {
      "text": "Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2991--3000.  ",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Martin Weigel, Aditya Shekhar Nittala, Alex Olwal, and Jürgen Steimle. 2017. SkinMarks: Enabling Interactions on Body Landmarks Using Conformal Skin Electronics. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3095--3105.  ",
      "doi": "10.1145/3025453.3025704"
    },
    {
      "text": "Michael Wessely, Theophanis Tsandilas, and Wendy E. Mackay. 2016. Stretchis: Fabricating Highly Stretchable User Interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 697--704.  ",
      "doi": "10.1145/2984511.2984521"
    },
    {
      "text": "Anusha Withana, Daniel Groeger, and Jürgen Steimle. 2018. Tacttoo: A Thin and Feel-Through Tattoo for On-Skin Tactile Output. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (UIST '18). ACM, New York, NY, USA, to appear.  ",
      "doi": "10.1145/3242587.3242645"
    },
    {
      "text": "Junichi Yamaoka, Ryuma Niiyama, and Yasuaki Kakehi. 2017. BlowFab: Rapid Prototyping for Rigid and Reusable Objects Using Inflation of Laser-cut Surfaces. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 461--469.  ",
      "doi": "10.1145/3126594.3126624"
    },
    {
      "text": "Sang Ho Yoon, Ke Huo, Yunbo Zhang, Guiming Chen, Luis Paredes, Subramanian Chidambaram, and Karthik Ramani. 2017. iSoft: A Customizable Soft Sensor with Real-time Continuous Contact and Stretching Sensing. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 665--678.  ",
      "doi": "10.1145/3126594.3126654"
    },
    {
      "text": "Yang Zhang, Gierad Laput, and Chris Harrison. 2017. Electrick: LowCost Touch Sensing Using Electric Field Tomography. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1--14.  ",
      "doi": "10.1145/3025453.3025842"
    },
    {
      "text": "Ruike Zhao, Shaoting Lin, Hyunwoo Yuk, and Xuanhe Zhao. 2018. Kirigami enhances film adhesion. Soft Matter 14 (2018), 2515--2525. Issue 13.",
      "doi": ""
    }
  ]
}