{
  "doi": "10.1145/3290605.3300680",
  "title": "Beyond Dyadic Interactions: Considering Chatbots as Community Members",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Chatbots have grown as a space for research and development in recent years due both to the realization of their commercial potential and to advancements in language processing that have facilitated more natural conversations. However, nearly all chatbots to date have been designed for dyadic, one-on-one communication with users. In this paper we present a comprehensive review of research on chatbots supplemented by a review of commercial and independent chatbots. We argue that chatbots' social roles and conversational capabilities beyond dyadic interactions have been underexplored, and that expansion into this design space could support richer social interactions in online communities and help address the longstanding challenges of maintaining, moderating, and growing these communities. In order to identify opportunities beyond dyadic interactions, we used research-through-design methods to generate more than 400 concepts for new social chatbots, and we present seven categories that emerged from analysis of these ideas.",
  "tags": [
    "online communities",
    "chatbots",
    "social identity",
    "dyadic communication"
  ],
  "authors": [
    {
      "name": "Joseph Seering",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130823",
      "orcid": "missing"
    },
    {
      "name": "Michal Luria",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99658688561/rel-imgonly/michal_luria.jpg",
      "acmid": "99658688561",
      "orcid": "missing"
    },
    {
      "name": "Geoff Kaufman",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459698057",
      "orcid": "0000-0002-0123-3792"
    },
    {
      "name": "Jessica Hammer",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658650866",
      "orcid": "0000-0003-4102-2575"
    }
  ],
  "references": [
    {
      "text": "Norah Abokhodair, Daisy Yoo, and David W. McDonald. 2015. Dissecting a Social Botnet: Growth, Content and Influence in Twitter. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '15). ACM, New York, NY, USA, 839--851.  ",
      "doi": "10.1145/2675133.2675208"
    },
    {
      "text": "Sandeep Avula, Gordon Chadwick, Jaime Arguello, and Robert Capra. 2018. SearchBots: User Engagement with ChatBots During Collaborative Search. In Proceedings of the 2018 Conference on Human Information Interaction & Retrieval (CHIIR '18). ACM, New York, NY, USA, 52--61.  ",
      "doi": "10.1145/3176349.3176380"
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt. 2016. Contextual Design: Design for Life 2nd ed.). Morgan Kaufmann, Burlington, MA, USA.",
      "doi": ""
    },
    {
      "text": "Heloisa Candello, Claudio Pinhanez, and Flavio Figueiredo. 2017. Typefaces and the Perception of Humanness in Natural Language Chatbots. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3476--3487.  ",
      "doi": "10.1145/3025453.3025919"
    },
    {
      "text": "Heloisa Candello, Claudio Pinhanez, Mauro Carlos Pichiliani, Melina Alberio Guerra, and Maira Gatti de Bayser. 2018. Having an Animated Coffee with a Group of Chatbots from the 19th Century. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article D206, bibinfonumpages4 pages.  ",
      "doi": "10.1145/3170427.3186519"
    },
    {
      "text": "Boreum Choi, Kira Alexander, Robert E. Kraut, and John M. Levine. 2010. Socialization Tactics in Wikipedia and Their Effects. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 107--116.  ",
      "doi": "10.1145/1718918.1718940"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, 2010. Mapping the Landscape of Sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. \"Hey Google is It OK if I Eat You?\": Initial Explorations in Child-Agent Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17). ACM, New York, NY, USA, 595--600.  ",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "D Christopher Dryer. 1997. Ghosts in the machine: Personalities for socially adroit software agents. In AAAI Fall Symposium 1997 .",
      "doi": ""
    },
    {
      "text": "Samantha Finkelstein, Evelyn Yarzebinski, Callie Vaughn, Amy Ogan, and Justine Cassell. 2013. The effects of culturally congruent educational technologies on student achievement. In International Conference on Artificial Intelligence in Education. Springer, 493--502.",
      "doi": ""
    },
    {
      "text": "Milica Gavs ić, Catherine Breslin, Matthew Henderson, Dongho Kim, Martin Szummer, Blaise Thomson, Pirros Tsiakoulis, and Steve Young. 2013. On-line policy optimisation of bayesian spoken dialogue systems via human interaction. In Acoustics, Speech and Signal Processing (ICASSP), 2013 IEEE International Conference on. IEEE, 8367--8371.",
      "doi": ""
    },
    {
      "text": "R STUART GEIGER and AARON HALFAKER. 2017. Operationalizing Conflict and Cooperation between Automated Software Agents in Wikipedia: A Replication and Expansion of “Even Good Bots Fight”. Proceedings of the ACM on Human-Computer Interaction, Vol. 1, CSCW (2017).  ",
      "doi": "10.1145/3134684"
    },
    {
      "text": "R Stuart Geiger and David Ribes. 2010. The work of sustaining order in wikipedia: the banning of a vandal. In Proceedings of the 2010 ACM conference on Computer Supported Cooperative Work (CSCW '10). ACM, 117--126.  ",
      "doi": "10.1145/1718918.1718941"
    },
    {
      "text": "Steven Gianvecchio, Mengjun Xie, Zhenyu Wu, and Haining Wang. 2011. Humans and Bots in Internet Chat: Measurement, Analysis, and Automated Classification. IEEE/ACM Trans. Netw., Vol. 19, 5 (Oct. 2011), 1557--1571.  ",
      "doi": "10.1109/TNET.2011.2126591"
    },
    {
      "text": "Zafar Gilani, Ekaterina Kochmar, and Jon Crowcroft. 2017. Classification of Twitter Accounts into Automated Agents and Human Users. In Proceedings of the 2017 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining 2017 (ASONAM '17). ACM, New York, NY, USA, 489--496.  ",
      "doi": "10.1145/3110025.3110091"
    },
    {
      "text": "Michael Golembewski and Mark Selby. 2010. Ideation decks: a card-based design ideation tool. In Proceedings of the 8th ACM Conference on Designing Interactive Systems. ACM, 89--92.  ",
      "doi": "10.1145/1858171.1858189"
    },
    {
      "text": "Bettina Graf, Maike Krüger, Felix Müller, Alexander Ruhland, and Andrea Zech. 2015. Nombot: Simplify Food Tracking. In Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia (MUM '15). ACM, New York, NY, USA, 360--363.  ",
      "doi": "10.1145/2836041.2841208"
    },
    {
      "text": "Andrea Grimes and Richard Harper. 2008. Celebratory Technology: New Directions for Food Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 467--476.  ",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Susan Herring, Kirk Job-Sluder, Rebecca Scheckler, and Sasha Barab. 2002. Searching for Safety Online: Managing \"Trolling\" in a Feminist Forum. The Information Society, Vol. 18, 5 (2002), 371--384.",
      "doi": ""
    },
    {
      "text": "Michael A Hogg. 2001. A social identity theory of leadership. Personality and social psychology review, Vol. 5, 3 (2001), 184--200.",
      "doi": ""
    },
    {
      "text": "Paris (Pei-Ting) Hsu, Jingshu Zhao, Kehan Liao, Tianyi Liu, and Chen Wang. 2017. AllergyBot: A Chatbot Technology Intervention for Young Adults with Food Allergies Dining Out. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 74--79.  ",
      "doi": "10.1145/3027063.3049270"
    },
    {
      "text": "Seung-A Annie Jin and Yongjun Sung. 2010. The roles of spokes-avatars' personalities in brand communication in 3D virtual environments. Journal of Brand Management, Vol. 17, 5 (2010), 317--327.",
      "doi": ""
    },
    {
      "text": "Raghav Pavan Karumur, Bowen Yu, Haiyi Zhu, and Joseph A. Konstan. 2018. Content is King, Leadership Lags: Effects of Prior Experience on Newcomer Retention and Productivity in Online Production Groups. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 506, bibinfonumpages13 pages.  ",
      "doi": "10.1145/3173574.3174080"
    },
    {
      "text": "Sara Kiesler, Robert Kraut, Paul Resnick, and Aniket Kittur. 2012. Regulating behavior in online communities. Building Successful Online Communities: Evidence-Based Social Design (2012).",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Lorenz Cuno Klopfenstein, Saverio Delpriori, Silvia Malatini, and Alessandro Bogliolo. 2017. The Rise of Bots: A Survey of Conversational Interfaces, Patterns, and Paradigms. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 555--565.  ",
      "doi": "10.1145/3064663.3064672"
    },
    {
      "text": "Robert E Kraut and Paul Resnick. 2012. Building successful online communities: Evidence-based social design .MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/2207798"
    },
    {
      "text": "Esther Levin, Roberto Pieraccini, and Wieland Eckert. 1997. Learning dialogue strategies within the markov decision process framework. In Proceedings of the 1997 IEEE Workshop on Automatic Speech Recognition and Understanding. IEEE, 72--79.",
      "doi": ""
    },
    {
      "text": "Esther Levin, Roberto Pieraccini, and Wieland Eckert. 2000. A stochastic model of human-machine interaction for learning dialog strategies. IEEE Transactions on speech and audio processing, Vol. 8, 1 (2000), 11--23.",
      "doi": ""
    },
    {
      "text": "Jiwei Li, Will Monroe, Alan Ritter, Michel Galley, Jianfeng Gao, and Dan Jurafsky. 2016. Deep Reinforcement Learning for Dialogue Generation. In Proceedings of the 2016 Conference on Empirical Methods in Natural Language Processing. ACL, 1192--1202.",
      "doi": ""
    },
    {
      "text": "Toby Jia-Jun Li and Oriana Riva. 2018. Kite: Building Conversational Bots from Mobile Apps. In Proceedings of the 16th Annual International Conference on Mobile Systems, Applications, and Services (MobiSys '18). ACM, New York, NY, USA, 96--109.  ",
      "doi": "10.1145/3210240.3210339"
    },
    {
      "text": "Lue Lin, Luis Fernando D'Haro, and Rafael Banchs. 2016. A Web-based Platform for Collection of Human-Chatbot Interactions. In Proceedings of the Fourth International Conference on Human Agent Interaction (HAI '16). ACM, New York, NY, USA, 363--366.  ",
      "doi": "10.1145/2974804.2980500"
    },
    {
      "text": "Dan Lockton. 2018. New Metaphors. http://imaginari.es/new-metaphors/",
      "doi": ""
    },
    {
      "text": "Kiel Long, John Vines, Selina Sutton, Phillip Brooker, Tom Feltwell, Ben Kirman, Julie Barnett, and Shaun Lawson. 2017. \"Could You Define That in Bot Terms\"?: Requesting, Creating and Using Bots on Reddit. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3488--3500.  ",
      "doi": "10.1145/3025453.3025830"
    },
    {
      "text": "Wail Mardini, Yaser Khamayseh, and Ashraf Smadi. 2017. Messenger Bot for IoT Devices. In Proceedings of the 9th International Conference on Information Management and Engineering (ICIME 2017). ACM, New York, NY, USA, 182--186.  ",
      "doi": "10.1145/3149572.3149611"
    },
    {
      "text": "Laya Muralidharan, Ewart J. de Visser, and Raja Parasuraman. 2014. The Effects of Pitch Contour and Flanging on Trust in Speaking Cognitive Agents. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 2167--2172.  ",
      "doi": "10.1145/2559206.2581231"
    },
    {
      "text": "Lasguido Nio, Sakriani Sakti, Graham Neubig, Tomoki Toda, Mirna Adriani, and Satoshi Nakamura. 2014. Developing non-goal dialog system based on examples of drama television. In Natural Interaction with Robots, Knowbots and Smartphones. Springer, 355--361.",
      "doi": ""
    },
    {
      "text": "J. C. Paolillo. 1999. The virtual speech community: social network and language variation on IRC. In Proceedings of the 32nd Annual Hawaii International Conference on Systems Sciences. 1999. HICSS-32. Abstracts and CD-ROM of Full Papers, Vol. Track2. 10 pp.--. ",
      "doi": "10.5555/874069.875999"
    },
    {
      "text": "Juanan Pereira and Oscar D'iaz. 2018. A Quality Analysis of Facebook Messenger's Most Popular Chatbots. In Proceedings of the 33rd Annual ACM Symposium on Applied Computing (SAC '18). ACM, New York, NY, USA, 2144--2150.  ",
      "doi": "10.1145/3167132.3167362"
    },
    {
      "text": "David M. W. Powers, Martin H. Luerssen, Trent W. Lewis, Richard E. Leibbrandt, Marissa Milne, John Pashalis, and Kenneth Treharne. 2010. MANA for the Ageing. In Proceedings of the 2010 Workshop on Companionable Dialogue Systems (CDS '10). Association for Computational Linguistics, Stroudsburg, PA, USA, 7--12. http://dl.acm.org/citation.cfm?id=1870559.1870561 ",
      "doi": "10.5555/1870559.1870561"
    },
    {
      "text": "Adwait Ratnaparkhi. 2002. Trainable approaches to surface natural language generation and their application to conversational dialog systems. Computer Speech & Language, Vol. 16, 3--4 (2002), 435--455.",
      "doi": ""
    },
    {
      "text": "Yuqing Ren, F Maxwell Harper, Sara Drenner, Loren Terveen, Sara Kiesler, John Riedl, and Robert E Kraut. 2012. Building member attachment in online communities: Applying theories of group identity and interpersonal bonds. Mis Quarterly (2012), 841--864. ",
      "doi": "10.5555/2481655.2481665"
    },
    {
      "text": "Dan Saffer. 2005. The role of metaphor in interaction design. Information Architecture Summit, Vol. 6 (2005).",
      "doi": ""
    },
    {
      "text": "Saiph Savage, Andres Monroy-Hernandez, and Tobias Höllerer. 2016. Botivist: Calling Volunteers to Action Using Online Bots. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 813--822.  ",
      "doi": "10.1145/2818048.2819985"
    },
    {
      "text": "Ari Schlesinger, Kenton P. O'Hara, and Alex S. Taylor. 2018. Let's Talk About Race: Identity, Chatbots, and AI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 315, bibinfonumpages14 pages.  ",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "Joseph Seering, Juan Pablo Flores, Saiph Savage, and Jessica Hammer. 2018a. The Social Roles of Bots: Situating Bots in Discussions in Online Communities. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW '18). ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Robert Kraut, and Laura Dabbish. 2017. Shaping Pro and Anti-Social Behavior on Twitch Through Moderation and Example-Setting. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 111--125.  ",
      "doi": "10.1145/2998181.2998277"
    },
    {
      "text": "Joseph Seering, Felicia Ng, Zheng Yao, and Geoff Kaufman. 2018b. Applications of Social Identity Theory to Research and Design in Social Computing. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work and Social Computing (CSCW '18). ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Tony Wang, Jina Yoon, and Geoff Kaufman. 2019. Moderator Engagement and Community Development in the Age of Algorithms. New Media & Society (2019).",
      "doi": ""
    },
    {
      "text": "Sohil L. Shrestha, Saroj Panda, and Christoph Csallner. 2018. Complementing Machine Learning Classifiers via Dynamic Symbolic Execution: \"Human vs. Bot Generated\" Tweets. In Proceedings of the 6th International Workshop on Realizing Artificial Intelligence Synergies in Software Engineering (RAISE '18). ACM, New York, NY, USA, 15--20.  ",
      "doi": "10.1145/3194104.3194111"
    },
    {
      "text": "Ulrike Spierling. 2005. Beyond Virtual Tutors: Semi-autonomous Characters As Learning Companions. In ACM SIGGRAPH 2005 Educators Program (SIGGRAPH '05). ACM, New York, NY, USA, Article 5.  ",
      "doi": "10.1145/1187358.1187365"
    },
    {
      "text": "H Tajfel. 1982. Social Psychology of Intergroup Relations. Annual Review of Psychology, Vol. 33, 1 (1982), 1--39.",
      "doi": ""
    },
    {
      "text": "James C Thompson, J Gregory Trafton, and Patrick McKnight. 2011. The perception of humanness from the movements of synthetic agents. Perception, Vol. 40, 6 (2011), 695--704.",
      "doi": ""
    },
    {
      "text": "Francisco A. M. Valério, Tatiane G. Guimar aes, Raquel O. Prates, and Heloisa Candello. 2017. Here's What I Can Do: Chatbots' Strategies to Convey Their Features to Users. In Proceedings of the XVI Brazilian Symposium on Human Factors in Computing Systems (IHC 2017). ACM, New York, NY, USA, Article 28, bibinfonumpages10 pages.  ",
      "doi": "10.1145/3160504.3160544"
    },
    {
      "text": "Teun A Van Dijk. 1997. Discourse as structure and process. Vol. 1. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Marisa Vasconcelos, Heloisa Candello, Claudio Pinhanez, and Thiago dos Santos. 2017. Bottester: Testing Conversational Systems with Simulated Users. In Proceedings of the XVI Brazilian Symposium on Human Factors in Computing Systems (IHC 2017). ACM, New York, NY, USA, Article 73, bibinfonumpages4 pages.  ",
      "doi": "10.1145/3160504.3160584"
    },
    {
      "text": "Mandana Vaziri, Louis Mandel, Avraham Shinnar, Jérôme Siméon, and Martin Hirzel. 2017. Generating Chat Bots from Web API Specifications. In Proceedings of the 2017 ACM SIGPLAN International Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software (Onward! 2017). ACM, New York, NY, USA, 44--57.  ",
      "doi": "10.1145/3133850.3133864"
    },
    {
      "text": "Richard Wallace. 2003. The elements of AIML style. Alice AI Foundation (2003).",
      "doi": ""
    },
    {
      "text": "Richard S Wallace. 2009. The anatomy of ALICE. In Parsing the Turing Test. Springer, 181--210.",
      "doi": ""
    },
    {
      "text": "Patrick Wang, Rafael Angarita, and Ilaria Renna. 2018. Is This the Era of Misinformation Yet: Combining Social Bots and Fake News to Deceive the Masses. In Companion Proceedings of the The Web Conference 2018 (WWW '18). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 1557--1561.  ",
      "doi": "10.1145/3184558.3191610"
    },
    {
      "text": "Joseph Weizenbaum. 1966. ELIZA&Mdash;a Computer Program for the Study of Natural Language Communication Between Man and Machine. Commun. ACM, Vol. 9, 1 (Jan. 1966), 36--45.  ",
      "doi": "10.1145/365153.365168"
    },
    {
      "text": "Anbang Xu, Zhe Liu, Yufan Guo, Vibha Sinha, and Rama Akkiraju. 2017. A New Chatbot for Customer Service on Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3506--3510.  ",
      "doi": "10.1145/3025453.3025496"
    },
    {
      "text": "Mengting Yan, Paul Castro, Perry Cheng, and Vatche Ishakian. 2016. Building a Chatbot with Serverless Computing. In Proceedings of the 1st International Workshop on Mashups of Things and APIs (MOTA '16). ACM, New York, NY, USA, Article 5, bibinfonumpages4 pages.  ",
      "doi": "10.1145/3007203.3007217"
    },
    {
      "text": "Jennifer Zamora. 2017. Rise of the Chatbots: Finding A Place for Artificial Intelligence in India and US. In Proceedings of the 22Nd International Conference on Intelligent User Interfaces Companion (IUI '17 Companion). ACM, New York, NY, USA, 109--112.  ",
      "doi": "10.1145/3030024.3040201"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design As a Method for Interaction Design Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). ACM, New York, NY, USA, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}