{
  "doi": "10.1145/3290605.3300270",
  "title": "At Your Service: Designing Voice Assistant Personalities to Improve Automotive User Interfaces",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "This paper investigates personalized voice characters for in-car speech interfaces. In particular, we report on how we designed different personalities for voice assistants and compared them in a real world driving study. Voice assistants have become important for a wide range of use cases, yet current interfaces are using the same style of auditory response in every situation, despite varying user needs and personalities. To close this gap, we designed four assistant personalities (Friend, Admirer, Aunt, and Butler) and compared them to a baseline (Default) in a between-subject study in real traffic conditions. Our results show higher likability and trust for assistants that correctly match the user's personality while we observed lower likability, trust, satisfaction, and usefulness for incorrectly matched personalities, each in comparison with the Default character. We discuss design aspects for voice assistants in different automotive use cases.",
  "authors": [
    {
      "name": "Michael Braun",
      "institution": "BMW Group Research, New Technologies, Innovations & Ludwig Maximilian University of Munich, Garching, Germany",
      "img": "/do/10.1145/contrib-99659210552/rel-imgonly/99659210552.jpg",
      "acmid": "99659210552",
      "orcid": "missing"
    },
    {
      "name": "Anja Mainz",
      "institution": "Ludwig Maximilian University of Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366188",
      "orcid": "missing"
    },
    {
      "name": "Ronee Chadowitz",
      "institution": "BMW Group Research, New Technologies, Innovations, Garching, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659285985",
      "orcid": "missing"
    },
    {
      "name": "Bastian Pfleging",
      "institution": "Ludwig Maximilian University of Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460651934",
      "orcid": "missing"
    },
    {
      "name": "Florian Alt",
      "institution": "Bundeswehr University Munich & Ludwig Maximilian University of Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    }
  ],
  "references": [
    {
      "text": "Ignacio Alvarez, Hanan Alnizami, Jerone Dunbar, Andrea Johnson, France Jackson, and Juan E. Gilber. 2011. Designing Driver-Centric Natural Voice User Interfaces. In Adjunct Proceedings of the 3rd International Conference on Automotive User Interfaces and Interactive Vehicular Applications. online, 156--159.",
      "doi": ""
    },
    {
      "text": "Elisabeth André, Martin Klesen, Patrick Gebhard, Steve Allen, and Thomas Rist. 2000. Integrating models of personality and emotions into lifelike characters. In Afective interactions IWAI 1999. Lecture Notes in Computer Science, A. Paiva (Ed.). Vol. 1814. Springer, Berlin, Heidelberg, 150--165. ",
      "doi": "10.5555/362587.374273"
    },
    {
      "text": "Michael Argyle. 1988. Bodily communication (second ed.). Routledge, New York, NY.",
      "doi": ""
    },
    {
      "text": "Timothy W. Bickmore and Rosalind W. Picard. 2005. Establishing and Maintaining Long-term Human-computer Relationships. ACM Trans. Comput.-Hum. Interact. 12, 2 (2005), 293--327.  ",
      "doi": "10.1145/1067860.1067867"
    },
    {
      "text": "Timothy W Bickmore, Ha Trinh, Stefan Olafsson, Teresa K O'Leary, Reza Asadi, Nathaniel M Rickles, and Ricardo Cruz. 2018. Patient and Consumer Safety Risks When Using Conversational Assistants for Medical Information: An Observational Study of Siri, Alexa, and Google Assistant. Journal of Medical Internet Research 20, 9 (04 Sep 2018).",
      "doi": ""
    },
    {
      "text": "Emmanuel Bigand, Suzanne Filipic, and Philippe Lalitte. 2005. The time course of emotional responses to music. Annals of the NY Acad. of Sci. 1060, 1 (2005), 429--437.",
      "doi": ""
    },
    {
      "text": "Michael Braun, Anna-Katharina Frison, Sarah Theres Völkel, Florian Alt, Heinrich Hussmann, and Andreas Riener. 2018. Beyond Transportation: How to Keep Users Attached When They Are Neither Driving nor Owning Automated Cars? In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '18). ACM, New York, NY, USA, 175--180.  ",
      "doi": "10.1145/3239092.3265963"
    },
    {
      "text": "Angelo Cafaro, Hannes Högni Vilhjálmsson, and Timothy Bickmore. 2016. First Impressions in Human--Agent Virtual Encounters. ACM Trans. Comput.-Hum. Interact. 23, 4, Article 24 (Aug. 2016), 40 pages.  ",
      "doi": "10.1145/2940325"
    },
    {
      "text": "Meanne Chan, Katherine H. Rogers, Kate L. Parisotto, and Jeremy C. Biesanz. 2011. Forming frst impressions: The role of gender and normative accuracy in personality perception. Journal of Research in Pers. 45, 1 (2011), 117--120.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, and Alan Dix. 2018. HARK No More: On the Preregistration of CHI Experiments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 141, 12 pages.  ",
      "doi": "10.1145/3173574.3173715"
    },
    {
      "text": "N. Dahlbäck, A. Jönsson, and L. Ahrenber. 1993. Wizard of Oz studies -- why and how. Knowledge-Based Systems, Special Issue: Intelligent UIs 6, 4 (1993), 258--266.  ",
      "doi": "10.1016/0950-7051%2893%2990017-N"
    },
    {
      "text": "Daniel Danner, Beatrice Rammstedt, Matthias Bluemke, Lisa Treiber, Sabrina Berres, Christopher J. Soto, and Oliver John. 2016. Die deutsche Version des Big Five Inventory 2 (BFI-2). Technical Report. Zusammenstellung sozialwissenschaftlicher Items und Skalen.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Stavenland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (Eds.). Vol. 52. North-Holland, 139--183.",
      "doi": ""
    },
    {
      "text": "Sebastian Hergeth, Lutz Lorenz, Roman Vilimek, and Josef F. Krems. 2016. Keep Your Scanners Peeled: Gaze Behavior as a Measure of Automation Trust During Highly Automated Driving. Human Factors 58, 3 (2016), 509--519.",
      "doi": ""
    },
    {
      "text": "Oliver Jarosch and Klaus Bengler. 2019. Is It the Duration of the Ride or the Non-driving Related Task? What Afects Take-Over Performance in Conditional Automated Driving?. In Proceedings of the 20th Congress of the International Ergonomics Association (IEA 2018), Sebastiano Bagnara, Riccardo Tartaglia, Sara Albolino, Thomas Alexander, and Yushi Fujita (Eds.). Springer International Publishing, Cham, 512--523.",
      "doi": ""
    },
    {
      "text": "Malte F. Jung. 2017. Afective Grounding in Human-Robot Interaction. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). ACM, New York, NY, USA, 263--273.  ",
      "doi": "10.1145/2909824.3020224"
    },
    {
      "text": "Patrik N Juslin and Daniel Västfjäll. 2008. Emotional responses to music: The need to consider underlying mechanisms. Behavioral and Brain Sciences 31, 5 (2008), 559--575.",
      "doi": ""
    },
    {
      "text": "Lara K. Kammrath, Daniel R. Ames, and Abigail A. Scholer. 2007. Keeping up impressions: Inferential rules for impression change across the Big Five. Journal of Experimental Social Psychology 43, 3 (2007), 450 -- 457.",
      "doi": ""
    },
    {
      "text": "Joseph Kramer, Sunil Noronha, and John Vergo. 2000. A User-centered Design Approach to Personalization. Commun. ACM 43, 8 (Aug. 2000), 44--48.  ",
      "doi": "10.1145/345124.345139"
    },
    {
      "text": "Jinke D. Van Der Laan, Adriaan Heino, and Dick De Waard. 1997. A simple procedure for the assessment of acceptance of advanced transport telematics. Transportation Research Part C: Emerging Technologies 5, 1 (1997), 1 -- 10.",
      "doi": "10.1016/S0968-090X%2896%2900025-"
    },
    {
      "text": "David R. Large, Gary Burnett, Ben Anyasodo, and Lee Skrypchuk. 2016. Assessing Cognitive Demand During Natural Language Interactions with a Digital Driving Assistant. In Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Automotive'UI 16). ACM, New York, NY, USA, 67--74.  ",
      "doi": "10.1145/3003715.3005408"
    },
    {
      "text": "Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and Evaluation of a User Experience Questionnaire. In HCI and Usability for Education and Work, Andreas Holzinger (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 63--76.  ",
      "doi": "10.1007/978-3-540-89350-9_6"
    },
    {
      "text": "Nilli Lavie. 2010. Attention, Distraction, and Cognitive Control Under Load. Current Directions in Psychological Science 19, 3 (2010), 143--148.",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016.",
      "doi": ""
    },
    {
      "text": "\"Like Having a Really Bad PA",
      "doi": ""
    },
    {
      "text": ": The Gulf Between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf Between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Michal Luria. 2018. Designing Robot Personality Based on Fictional Sidekick Characters. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (HRI '18). ACM, New York, NY, USA, 307--308.  ",
      "doi": "10.1145/3173386.3176912"
    },
    {
      "text": "Jannette Maciej and Mark Vollrath. 2009. Comparison of manual vs. speech-based interaction with in-vehicle information systems. Accident Analysis & Prevention 41, 5 (2009), 924 -- 930.",
      "doi": ""
    },
    {
      "text": "Bertram F Malle and Stuti Thapa Magar. 2017. What Kind of Mind Do I Want in My Robot?: Developing a Measure of Desired Mental Capacities in Social Robots. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, New York, NY, US, 195--196. Designing Voice Assistant Personalities to Improve Automotive UIs CHI 2019, May 4--9, 2019, Glasgow, Scotland, UK  ",
      "doi": "10.1145/3029798.3038378"
    },
    {
      "text": "Robert R McCrae and Paul T Costa. 1986. Personality, coping, and coping efectiveness in an adult sample. Journal of Personality 54, 2 (1986), 385--404.",
      "doi": ""
    },
    {
      "text": "Daniel McDuf, Abdelrahman Mahmoud, Mohammad Mavadati, May Amr, Jay Turcot, and Rana el Kaliouby. 2016. AFFDEX SDK: A CrossPlatform Real-Time Multi-Face Expression Recognition Toolkit. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3723--3726.  ",
      "doi": "10.1145/2851581.2890247"
    },
    {
      "text": "Michael Minge and Laura Riedel. 2013. meCUE - Ein modularer Fragebogen zur Erfassung des Nutzungserlebens. In Mensch & Computer 2013: Interaktive Vielfalt, Susanne Boll, Susanne Maaßü, and Rainer Malaka (Eds.). Oldenbourg Verlag, München, 89--98.",
      "doi": ""
    },
    {
      "text": "M. Mori, K. F. MacDorman, and N. Kageki. 2012. The Uncanny Valley {From the Field}. IEEE Robotics Automation Magazine 19, 2 (June 2012), 98--100.",
      "doi": ""
    },
    {
      "text": "M. Nafari and C. Weaver. 2013. Augmenting Visualization with Natural Language Translation of Interaction: A Usability Study. Computer Graphics Forum 32 (2013), 391--400.  ",
      "doi": "10.1111/cgf.12126"
    },
    {
      "text": "Cliford Nass, Ing-Marie Jonsson, Helen Harris, Ben Reaves, Jack Endo, Scott Brave, and Leila Takayama. 2005. Improving Automotive Safety by Pairing Driver Emotion and Car Voice Emotion. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1973--1976.  ",
      "doi": "10.1145/1056808.1057070"
    },
    {
      "text": "Cliford Nass, Youngme Moon, B. J. Fogg, Byron Reeves, and Chris Dryer. 1995. Can Computer Personalities Be Human Personalities?. In Conference Companion on Human Factors in Computing Systems (CHI '95). ACM, New York, NY, USA, 228--229.  ",
      "doi": "10.1145/223355.223538"
    },
    {
      "text": "Cliford Nass, Jonathan Steuer, and Ellen R. Tauber. 1994. Computers Are Social Actors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94). ACM, New York, NY, USA, 72--78.  ",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Dennis Orth, Nadja Schömig, Christian Mark, Monika JagiellowiczKaufmann, Dorothea Kolossa, and Martin Heckmann. 2017. Benefts of Personalization in the Context of a Speech-Based Left-Turn Assistant. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '17). ACM, New York, NY, USA, 9.  ",
      "doi": "10.1145/3122986.3123004"
    },
    {
      "text": "A. Pauzie. 2008. A method to assess the driver mental workload: The driving activity load index (DALI). IET Intelligent Transport Systems 2, 4 (December 2008), 315--322.",
      "doi": ""
    },
    {
      "text": "Matthias Peissner, Vanessa Doebler, and Florian Metze. 2011. Can voice interaction help reducing the level of distraction and prevent accidents. Technical Report. Nuance Communications. https://wiki.iao.fraunhofer.de/images/studien/ driver-distraction-and-voice-interaction.pdf",
      "doi": ""
    },
    {
      "text": "Bastian Pfeging, Stefan Schneegass, and Albrecht Schmidt. 2012. Multimodal Interaction in the Car: Combining Speech and Gestures on the Steering Wheel. In Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '12). ACM, New York, NY, USA, 155--162.  ",
      "doi": "10.1145/2390256.2390282"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 640:1--640:12.  ",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, and Leah Findlater. 2018. Accessibility Came by Accident: Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 459, 13 pages.  ",
      "doi": "10.1145/3173574.3174033"
    },
    {
      "text": "J. R. Quinlan. 1986. Induction of decision trees. Machine Learning 1, 1 (01 Mar 1986), 81--106.  ",
      "doi": "10.1023/A%3A1022643204877"
    },
    {
      "text": "Andreas Riener, Myounghoon Jeon, Ignacio Alvarez, and Anna K. Frison. 2017. Driver in the Loop: Best Practices in Automotive Sensing and Feedback Mechanisms. In Automotive User Interfaces: Creating Interactive Experiences in the Car, Gerrit Meixner and Christian Müller (Eds.). Springer International Publishing, Cham, 295--323.",
      "doi": ""
    },
    {
      "text": "Florian Roider, Sonja Rümelin, Bastian Pfeging, and Tom Gross. 2017. The Efects of Situational Demands on Gaze, Speech and Gesture Input in the Vehicle. In Proceedings of the 9th ACM International Conference on Automotive User Interfaces and Vehicular Applications (AutomotiveUI '17). ACM, New York, NY, USA, 9.  ",
      "doi": "10.1145/3122986.3122999"
    },
    {
      "text": "Maria Schmidt and Patricia Braunger. 2018. A Survey on Diferent Means of Personalized Dialog Output for an Adaptive Personal Assistant. In Adjunct Publication of the 26th Conference on User Modeling, Adaptation and Personalization (UMAP '18). ACM, New York, NY, USA, 75--81.  ",
      "doi": "10.1145/3213586.3226198"
    },
    {
      "text": "Jacob Solomon. 2016. Heterogeneity in Customization of Recommender Systems By Users with Homogenous Preferences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 4166--4170.  ",
      "doi": "10.1145/2858036.2858513"
    },
    {
      "text": "Andreas Butz Sonja Rümelin, Peter Siegl. 2013. Could You Please... Investigating Cooperation In The Car. In Adjunct Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI '13), Eindhoven, The Netherlands, October 2013. (AutomotiveUI '13).",
      "doi": ""
    },
    {
      "text": "Shashi Thakur. 2016. Personalization for Google Now: User Understanding and Application to Information Recommendation and Exploration. In Proceedings of the 10th ACM Conference on Recommender Systems (RecSys '16). ACM, New York, NY, USA, 3--3.  ",
      "doi": "10.1145/2959100.2959192"
    },
    {
      "text": "Jessica Villing. 2009. Dialogue Behaviour Under High Cognitive Load. In Proceedings of the SIGDIAL 2009 Conference: The 10th Annual Meeting of the Special Interest Group on Discourse and Dialogue (SIGDIAL '09). Association for Computational Linguistics, Stroudsburg, PA, USA, 322-- 325. http://dl.acm.org/citation.cfm?id=1708376.1708423 ",
      "doi": "10.5555/1708376.1708423"
    },
    {
      "text": "Mark Vollrath. 2007. Speech and driving - solution or problem? IET Intelligent Transport Systems 1, 2 (June 2007), 89--94.",
      "doi": ""
    },
    {
      "text": "Walter W. Wierwille. 1993. Demands on driver resources associated with introducing advanced technology into the vehicle. Transportation Research Part C: Emerging Technologies 1, 2 (1993), 133 -- 142.",
      "doi": ""
    },
    {
      "text": "Michael Wooldridge and Nicholas R Jennings. 1995. Intelligent agents: Theory and practice. The Knowledge Engineering Review 10, 2 (1995), 115--152.",
      "doi": ""
    },
    {
      "text": "Baoshi Yan, Fuliang Weng, Zhe Feng, Florin Ratiu, Madhuri Raya, Yao Meng, Sebastian Varges, Matthew Purver, Annie Lien, Tobias Scheideck, Badri Raghunathan, Feng Lin, Rohit Mishra, Brian Lathrop, Zhaoxia Zhang, Harry Bratt, and Stanley Peters. 2007. A Conversational In-car Dialog System. In Proceedings of Human Language Technologies: The Annual Conference of the North American Chapter of the Association for Computational Linguistics: Demonstrations (NAACL-Demonstrations '07). Association for Computational Linguistics, Stroudsburg, PA, USA, 23--24. http://dl.acm.org/citation.cfm?id= 1614164.1614176 ",
      "doi": "10.5555/1614164.1614176"
    }
  ]
}