{
  "doi": "10.1145/3290605.3300481",
  "title": "Recipes for Programmable Money",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "This paper presents a qualitative study of the recent integration of a UK-based, digital-first mobile banking app - Monzo - with the web automation service IFTTT (If This Then That). Through analysis of 113 unique IFTTT 'recipes' shared by Monzo users on public community forums, we illustrate the potentially diverse functions of these recipes, and how they are achieved through different kinds of automation. Beyond achieving more convenient and efficient financial management, we note many playful and expressive applications of conditionality and automation that far extend traditional functions of banking applications and infrastructure. We use these findings to map opportunities, challenges and areas of future research in the development of 'programmable money' and related financial technologies. Specifically, we present design implications for the extension of native digital banking applications; novel uses of banking data; the applicability of blockchains and smart contracts; and future forms of financial autonomy.",
  "tags": [
    "automation",
    "fintech",
    "ifttt",
    "money"
  ],
  "authors": [
    {
      "name": "Chris Elsden",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-89758813157/rel-imgonly/headshotcrop.jpg",
      "acmid": "89758813157",
      "orcid": "missing"
    },
    {
      "name": "Tom Feltwell",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658696389",
      "orcid": "missing"
    },
    {
      "name": "Shaun Lawson",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81100192206/rel-imgonly/shaun.jpg",
      "acmid": "81100192206",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    }
  ],
  "references": [
    {
      "text": "Amelia Acker and Dhiraj Murthy. 2018. Venmo: Understanding Mobile Payments As Social Media. Proceedings of the 9th International Conference on Social Media and Society, 5--12.  ",
      "doi": "10.1145/3217804.3217892"
    },
    {
      "text": "George Okello Candiya Bongomin, Joseph M Ntayi, John C. Munene, and Charles Akol Malinga. 2018. Mobile Money and Financial Inclusion in Sub-Saharan Africa: the Moderating Role of Social Networks. Journal of African Business 19, 3 (2018), 361--384.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Monica Caraway, Daniel A. Epstein, and Sean A. Munson. 2017. Friends Don't Need Receipts: The Curious Case of Social Awareness Streams in the Mobile Payment App Venmo. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 28 (Dec. 2017), 28:1--28:17 pages.  ",
      "doi": "10.1145/3134663"
    },
    {
      "text": "Ruth Catlow, Mark Garrett, Nathan Jones, and Sam Skinner. 2017. Artists Re:thinking the Blockchain. Liverpool University Press. https: //liverpooluniversitypress.co.uk/products/100826",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding Quantified-selfers' Practices in Collecting and Exploring Personal Data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Mary Daly. 2017. Money-Related Meanings and Practices in LowIncome and Poor Families. Sociology 51, 2 (2017), 450--465.",
      "doi": ""
    },
    {
      "text": "Sinclair Davidson, Primavera De Filippi, and Jason Potts. 2016. Disrupting Governance: The New Institutional Economics of Distributed Ledger Technology. Technical Report. Rochester, NY. https://papers.ssrn.com/ abstract=2811995 {Online; accessed 2018-09--20}.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Abigail C. Durrant, David Chatting, and David S. Kirk. 2017. Designing Documentary Informatics. Proceedings of the 2017 Conference on Designing Interactive Systems, 649-- 661. https://doi.org/  ",
      "doi": "10.1145/3064663.3064714"
    },
    {
      "text": "1145/3064663.3064714 {10} Chris Elsden, Arthi Manohar, Jo Briggs, Mike Harding, Chris Speed, and John Vines. 2018. Making Sense of Blockchain Applications: A Typology for HCI. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 458:1--458:14. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk Elsden, Feltwell, Lawson, Vines.  ",
      "doi": "10.1145/3173574.3174032"
    },
    {
      "text": "Chris Elsden, Mark Selby, Abigail Durrant, and David Kirk. 2016. Fitter, happier, more productive: what to ask of a data-driven life. interactions 23, 5 (2016), 45--45.  ",
      "doi": "10.1145/2975388"
    },
    {
      "text": "Jennifer Ferreira and Mark Perry. 2014. Building an Alternative Social Currency: Dematerialising and Rematerialising Digital Money Across Media. Proceedings of HCI Korea, 122--131. http://dl.acm.org/citation. cfm?id=2729485.2729505 ",
      "doi": "10.5555/2729485.2729505"
    },
    {
      "text": "Mark Granovetter. 1985. Economic Action and Social Structure: The Problem of Embeddedness. Amer. J. Sociology 91, 3 (1 11 1985), 481--510.",
      "doi": ""
    },
    {
      "text": "IBM. 2018. Programmable money: Will central banks take the lead? Technical Report. http://www.ibm.com/services/us/gbs/thoughtleadership/ programmablemoney/ {Online; accessed 2018-09--21}.",
      "doi": ""
    },
    {
      "text": "Joseph Jofish Kaye, Mary McCuistion, Rebecca Gulotta, and David A. Shamma. 2014. Money Talks: Tracking Personal Finances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 521--530.  ",
      "doi": "10.1145/2556288.2556975"
    },
    {
      "text": "Yong Ming Kow, Xinning Gui, and Waikuen Cheng. 2017. Special Digital Monies: The Design of Alipay and WeChat Wallet for Mobile Payment Practices in China. Human-Computer Interaction -- INTERACT 2017, 136--155.  ",
      "doi": "10.1007/978-3-319-68059-0_9"
    },
    {
      "text": "Deepti Kumar, David Martin, and Jacki O'Neill. 2011. The Times They Are A-changin': Mobile Payments in India. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11), 1413--1422.  ",
      "doi": "10.1145/1978942.1979150"
    },
    {
      "text": "C. Lustig and B. Nardi. 2015. Algorithmic Authority: The Case of Bitcoin. 2015 48th Hawaii International Conference on System Sciences, 743--752.  ",
      "doi": "10.1109/HICSS.2015.95"
    },
    {
      "text": "Donald MacKenzie, Daniel Beunza, Yuval Millo, and Juan Pablo PardoGuerra. 2012. Drilling Through the Allegheny Mountains. Journal of Cultural Economy 5, 3 (2012), 279--296.",
      "doi": ""
    },
    {
      "text": "Bill Maurer. 2006. The anthropology of money. Annu. Rev. Anthropol. 35 (2006), 15--36.",
      "doi": ""
    },
    {
      "text": "Bill Maurer, Taylor C. Nelms, and Lana Swartz. 2013. When perhaps the real problem is money itself!: the practical materiality of Bitcoin. Social Semiotics 23, 2 (2013), 261--277.",
      "doi": ""
    },
    {
      "text": "Isaac Mbiti and David N Weil. 2011. Mobile Banking: The Impact of MPesa in Kenya. Technical Report. http://www.nber.org/papers/w17129",
      "doi": ""
    },
    {
      "text": "Apurv Mehra, Srihari Muralidhar, Sambhav Satija, Anupama Dhareshwar, and Jacki O'Neill. 2018. Prayana: Intermediated Financial Management in Resource-Constrained Settings. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 389:1--389:13.  ",
      "doi": "10.1145/3173574.3173963"
    },
    {
      "text": "Sarah Mennicken, Jo Vermeulen, and Elaine M. Huang. 2014. From Today's Augmented Houses to Tomorrow's Smart Homes: New Directions for Home Automation Research. Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 105--115.  ",
      "doi": "10.1145/2632048.2636076"
    },
    {
      "text": "Monzo. 2018. Automate your financial life with Monzo and IFTTT. https://monzo.com/blog/2018/06/07/monzo-on-ifttt/ {Online; accessed 2018-09--20}.",
      "doi": ""
    },
    {
      "text": "Monzo. 2018. The Internet of Banking. https://www.youtube.com/ watch?v=c5jbaC5Kdvs {Online; accessed 2018-09--21}.",
      "doi": ""
    },
    {
      "text": "Mark W. Newman, Ame Elliott, and Trevor F. Smith. 2008. Providing an Integrated User Experience of Networked Media, Devices, and Services through End-User Composition. Pervasive Computing, 213-- 227.  ",
      "doi": "10.1007/978-3-540-79576-6_13"
    },
    {
      "text": "Bettina Nissen, Larissa Pschetz, Dave Murray-Rust, Hadi Mehrpouya, Shaune Oosthuizen, and Chris Speed. 2018. GeoCoin: Supporting Ideation and Collaborative Design with Smart Contracts. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 163:1--163:10.  ",
      "doi": "10.1145/3173574.3173737"
    },
    {
      "text": "Bettina Nissen, Kate Symons, Ella Tallyn, Chris Speed, Deborah Maxwell, and John Vines. 2017. New Value Transactions: Understanding and Designing for Distributed Autonomous Organisations. Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems, 352--355.  ",
      "doi": "10.1145/3064857.3064862"
    },
    {
      "text": "Joyojeet Pal, Priyank Chandra, Vaishnav Kameswaran, Aakanksha Parameshwar, Sneha Joshi, and Aditya Johri. 2018. Digital Payment and Its Discontents: Street Shops and the Indian Government's Push for Cashless Transactions. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 229:1--229:13.  ",
      "doi": "10.1145/3173574.3173803"
    },
    {
      "text": "Mark Perry and Jennifer Ferreira. 2018. Moneywork: Practices of Use and Social Interaction Around Digital and Analog Money. ACM Trans. Comput.-Hum. Interact. 24, 6 (2018), 41:1--41:32.  ",
      "doi": "10.1145/3162082"
    },
    {
      "text": "Gary Pritchard, John Vines, and Patrick Olivier. 2015. Your Money's No Good Here: The Elimination of Cash Payment on London Buses. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 907--916.  ",
      "doi": "10.1145/2702123.2702137"
    },
    {
      "text": "Larissa Pschetz, Ella Tallyn, Rory Gianni, and Chris Speed. 2017. Bitbarista: Exploring Perceptions of Data Transactions in the Internet of Things. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2964--2975.  ",
      "doi": "10.1145/3025453.3025878"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal Tracking As Lived Informatics. Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems, 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Jessica Silver-Greenberg and Michael Corkery. 2014. Miss a Payment? Good Luck Moving That Car. https://dealbook.nytimes.com/2014/09/ 24/miss-a-payment-good-luck-moving-that-car/",
      "doi": ""
    },
    {
      "text": "Cass R. Sunstein. 1999. Free markets and social justice. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Milijana Surbatovich, Jassim Aljuraidan, Lujo Bauer, Anupam Das, and Limin Jia. 2017. Some Recipes Can Do More Than Spoil Your Appetite: Analyzing the Security and Privacy Risks of IFTTT Recipes. Proceedings of the 26th International Conference on World Wide Web, 1501--1510.  ",
      "doi": "10.1145/3038912.3052709"
    },
    {
      "text": "Ella Tallyn, Larissa Pschetz, Rory Gianni, Chris Speed, and Chris Elsden. 2018. Exploring Machine Autonomy and Provenance Data in Coffee Consumption: A Field Study of Bitbarista. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 170 (Nov. 2018), 25 pages.  ",
      "doi": "10.1145/3274439"
    },
    {
      "text": "Blase Ur, Melwyn Pak Yong Ho, Stephen Brawner, Jiyun Lee, Sarah Mennicken, Noah Picard, Diane Schulze, and Michael L. Littman. 2016. Trigger-Action Programming in the Wild: An Analysis of 200,000 IFTTT Recipes. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 3227--3231.  ",
      "doi": "10.1145/2858036.2858556"
    },
    {
      "text": "John Vines, Paul Dunphy, Mark Blythe, Stephen Lindsay, Andrew Monk, and Patrick Olivier. 2012. The Joy of Cheques: Trust, Paper and Eighty Somethings. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 147--156.  ",
      "doi": "10.1145/2145204.2145229"
    },
    {
      "text": "John Vines, Paul Dunphy, and Andrew Monk. 2014. Pay or Delay: The Role of Technology when Managing a Low Income. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 501--510. Recipes for Programmable Money CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk  ",
      "doi": "10.1145/2556288.2556961"
    },
    {
      "text": "Dhaval Vyas, Stephen Snow, Paul Roe, and Margot Brereton. 2016. Social Organization of Household Finance: Understanding Artful Financial Systems in the Home. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 1777-- 1789.  ",
      "doi": "10.1145/2818048.2819937"
    },
    {
      "text": "Wikipedia. 2018. The Lady in Red (Chris de Burgh song). https://en.wikipedia.org/w/index.php?title=The_Lady_in_Red_ (Chris_de_Burgh_song)&oldid=860467651 Page Version ID: 860467651.",
      "doi": ""
    },
    {
      "text": "Viviana A. Zelizer. 1989. The Social Meaning of Money: \"Special Monies\". Amer. J. Sociology 95, 2 (1989), 342--377.",
      "doi": ""
    },
    {
      "text": "Viviana A Zelizer. 2000. The purchase of intimacy. Law & Social Inquiry 25, 3 (2000), 817--848.",
      "doi": ""
    }
  ]
}