{
  "doi": "10.1145/3290605.3300719",
  "title": "\"Can you believe [1:21]?!\": Content and Time-Based Reference Patterns in Video Comments",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "As videos become increasingly ubiquitous, so is video-based commenting. To contextualize comments, people often reference specific audio/visual content within video. However, the literature falls short of explaining the types of video content people refer to, how they establish references and identify referents, how video characteristics (e.g., genre) impact referencing behaviors, and how references impact social engagement. We present a taxonomy for classifying video references by referent type and temporal specificity. Using our taxonomy, we analyzed 2.5K references with quotations and timestamps collected from public YouTube comments. We found: 1) people reference intervals of video more frequently than time-points, 2) visual entities are referenced more often than sounds, and 3) comments with quotes are more likely to receive replies but not more \"likes\". We discuss the need for in-situ dereferencing user interfaces, illustrate design concepts for typed referencing features, and provide a dataset for future studies.",
  "tags": [
    "youtube",
    "reference",
    "comment",
    "engagement",
    "video",
    "timestamp"
  ],
  "authors": [
    {
      "name": "Matin Yarmand",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365158",
      "orcid": "missing"
    },
    {
      "name": "Dongwook Yoon",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659515794",
      "orcid": "0000-0002-7838-8311"
    },
    {
      "name": "Samuel Dodson",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659134130",
      "orcid": "missing"
    },
    {
      "name": "Ido Roll",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/do/10.1145/contrib-81375610963/rel-imgonly/idotie.jpg",
      "acmid": "81375610963",
      "orcid": "missing"
    },
    {
      "name": "Sidney S. Fels",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327488395",
      "orcid": "0000-0001-9279-9021"
    }
  ],
  "references": [
    {
      "text": "Saeideh Bakhshi, David A Shamma, and Eric Gilbert. 2014. Faces engage us: Photos with faces attract more likes and comments on Instagram. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 965--974.  ",
      "doi": "10.1145/2556288.2557403"
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining what individual SUS scores mean: Adding an adjective rating scale. Journal of usability studies 4, 3 (2009), 114--123. ",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "John Brooke et al. 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4--7.",
      "doi": ""
    },
    {
      "text": "A. J. Bernheim Brush, David Bargeron, Jonathan Grudin, Alan Borning, and Anoop Gupta. 2002. Supporting Interaction Outside of Class: Anchored Discussions vs. Discussion Boards. In Proceedings of the Conference on Computer Support for Collaborative Learning: Foundations for a CSCL Community (CSCL '02). International Society of the Learning Sciences, 425--434. ",
      "doi": "10.5555/1658616.1658676"
    },
    {
      "text": "Konstantinos Chorianopoulos. 2018. A taxonomy of asynchronous instructional video styles. The International Review of Research in Open and Distributed Learning 19, 1 (2018), 294--311.",
      "doi": ""
    },
    {
      "text": "Gayle Christensen, Andrew Steinmetz, Brandon Alcorn, Amy Bennett, Deirdre Woods, and Ezekiel Emanuel. 2013. The MOOC phenomenon: Who takes massive open online courses and why?",
      "doi": ""
    },
    {
      "text": "Soon Hau Chua, Toni-Jan Keith Palma Monserrat, Dongwook Yoon, Juho Kim, and Shengdong Zhao. 2017. Korero: Facilitating complex referencing of visual materials in asynchronous discussion interface. Proceedings of the ACM on Human-Computer Interaction 1 (2017), 34:1-- 34:19.  ",
      "doi": "10.1145/3134669"
    },
    {
      "text": "Herbert Clark. 1996. Using language. Cambridge University Press, Cambridge, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Herbert H Clark, Susan E Brennan, et al. 1991. Grounding in communication. Perspectives on socially shared cognition 13, 1991 (1991), 127--149.",
      "doi": ""
    },
    {
      "text": "Samuel Dodson, Ido Roll, Matthew Fong, Dongwook Yoon, Negar M Harandi, and Sidney Fels. 2018. Active Viewing: A Framework for Understanding Student Engagement With Educational Videos. In Proceedings of the Fifth Annual ACM Conference on Learning at Scale. ACM, New York, NY, 24:1--24:4.  ",
      "doi": "10.1145/3231644.3231682"
    },
    {
      "text": "Brian Dorn, Larissa B Schroeder, and Adam Stankiewicz. 2015. Piloting TrACE: Exploring spatiotemporal anchored collaboration in asynchronous learning. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, New York, NY, 393--403.  ",
      "doi": "10.1145/2675133.2675178"
    },
    {
      "text": "Yrjö Engeström. 1987. Learning by Expanding: An Activity-Theoretical Approach to Developmental Research. Cambridge University Press, Cambridge, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Matthew Fong, Samuel Dodson, Xueqin Zhang, Ido Roll, and Sidney Fels. 2018. ViDeX: A platform for personalizing educational videos. In Proceedings of the 18th ACM/IEEE Joint Conference on Digital Libraries. ACM, New York, NY, 331--332.  ",
      "doi": "10.1145/3197026.3203865"
    },
    {
      "text": "Susan R Fussell, Leslie D Setlock, Jie Yang, Jiazhi Ou, Elizabeth Mauer, and Adam DI Kramer. 2004. Gestures over video streams to support remote collaboration on physical tasks. Human-Computer Interaction 19, 3 (2004), 273--309.  ",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Darren Gergle, Robert E. Kraut, and Susan R. Fussell. 2004. Language Efficiency and Visual Technology: Minimizing Collaborative Effort with Visual Information. Journal of Language and Social Psychology 23, 4 (2004), 491--517.",
      "doi": ""
    },
    {
      "text": "Elena L Glassman, Juho Kim, Andrés Monroy-Hernández, and Meredith Ringel Morris. 2015. Mudslide: A Spatially Anchored Census of Student Confusion for Online Lecture Videos. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, 1555--1564.  ",
      "doi": "10.1145/2702123.2702304"
    },
    {
      "text": "Jonathan Grudin. 1988. Why CSCW Applications Fail: Problems in the Design and Evaluationof Organizational Interfaces. In Proceedings of the 1988 ACM Conference on Computer-supported Cooperative Work (CSCW '88). ACM, New York, NY, USA, 85--93.  ",
      "doi": "10.1145/62266.62273"
    },
    {
      "text": "Christian Heilmann. 2008. YouTube now offers deep links to timestamps (via URI hash). Retrieved Jan 05, 2019 from https://christianheilmann.com/2008/10/26/youtube-now-offers-deep-links-to-timestamps-via-uri-hash/",
      "doi": ""
    },
    {
      "text": "Michel Hupet, Xavier Seron, and Yves Chantraine. 1991. The effects of the codability and discriminability of the referents on the collaborative referring procedure. British Journal of Psychology 82, 4 (1991), 449--462.",
      "doi": ""
    },
    {
      "text": "Graham M Jones and Bambi B Schieffelin. 2009. Talking text and talking back:\"My BFF Jill\" from boob tube to YouTube. Journal of Computer-Mediated Communication 14, 4 (2009), 1050--1079.",
      "doi": ""
    },
    {
      "text": "Anastasia Kavada. 2012. Engagement, bonding, and identity across multiple platforms: Avaaz on Facebook, YouTube, and MySpace. MedieKultur: Journal of media and communication research 28, 52 (2012), 21.",
      "doi": ""
    },
    {
      "text": "M. Laeeq Khan. 2017. Social media engagement: What motivates user participation and consumption on YouTube? Computers in Human Behavior 66 (2017), 236--247.  ",
      "doi": "10.1016/j.chb.2016.09.024"
    },
    {
      "text": "Juho Kim, Phu Tran Nguyen, Sarah Weir, Philip J Guo, Robert C Miller, and Krzysztof Z Gajos. 2014. Crowdsourcing step-by-step information extraction to enhance existing how-to videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 4017--4026.  ",
      "doi": "10.1145/2556288.2556986"
    },
    {
      "text": "David Kirk, Tom Rodden, and Danaë Stanton Fraser. 2007. Turn It This Way: Grounding Collaborative Action with Remote Gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 1039--1048.  ",
      "doi": "10.1145/1240624.1240782"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press, Cambridge, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Yun-Jung Lee, Jung-Min Shim, Hwan-Gue Cho, and Gyun Woo. 2010. Detecting and visualizing the dispute structure of the replying comments in the internet forum sites. In Cyber-Enabled Distributed Computing and Knowledge Discovery. IEEE, Piscataway, NJ, 456--463.  ",
      "doi": "10.1109/CyberC.2010.90"
    },
    {
      "text": "Scott LeeTiernan and Jonathan Grudin. 2001. Fostering Engagement in Asynchronous Learning through Collaborative Multimedia Annotation.. In INTERACT. Citeseer, 472--479.",
      "doi": ""
    },
    {
      "text": "Amy Madden, Ian Ruthven, and David McMenemy. 2013. A classification scheme for content analyses of YouTube video comments. Journal of Documentation 69, 5 (2013), 693--714.",
      "doi": ""
    },
    {
      "text": "Heather Molyneaux, Susan O'Donnell, Kerri Gibson, and Janice Singer. 2008. Exploring the gender divide on YouTube: An analysis of the creation and reception of vlogs. American Communication Journal 10, 2 (2008), 1--14.",
      "doi": ""
    },
    {
      "text": "Xiangming Mu. 2010. Towards effective video annotation: An approach to automatically link notes with video content. Computers & Education 55, 4 (2010), 1752--1763.  ",
      "doi": "10.1016/j.compedu.2010.07.021"
    },
    {
      "text": "Amy Pavel, Dan B. Goldman, Björn Hartmann, and Maneesh Agrawala. 2016. VidCrit: Video-based asynchronous video review. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, New York, NY, 517--528.  ",
      "doi": "10.1145/2984511.2984552"
    },
    {
      "text": "Martin Potthast and Steffen Becker. 2010. Opinion summarization of web comments. In European Conference on Information Retrieval. Springer, Berlin, Germany, 668--669.  ",
      "doi": "10.1007/978-3-642-12275-0_73"
    },
    {
      "text": "Ido Roll, Daniel M Russell, and Dragan Gaevi. 2018. Learning at Scale. International Journal of Artificial Intelligence in Education (2018), CHI 2019, May 4--9, 2019, Glasgow, Scotland UK M. Yarmand et al. 1--7.",
      "doi": ""
    },
    {
      "text": "Dana Rotman and Jennifer Preece. 2010. The'WeTube'in YouTube-- creating an online community through video sharing. International Journal of Web Based Communities 6, 3 (2010), 317--333.  ",
      "doi": "10.1504/IJWBC.2010.033755"
    },
    {
      "text": "José Miguel Santos-Espino, María Dolores Afonso-Suárez, and Cayetano Guerra-Artal. 2016. Speakers and boards: A survey of instructional video styles in MOOCs. Technical Communication 63, 2 (2016), 101--115.",
      "doi": ""
    },
    {
      "text": "Peter Schultes, Verena Dorner, and Franz Lehner. 2013. Leave a comment! An in-depth analysis of user comments on YouTube. Wirtschaftsinformatik 42 (2013), 659--673.",
      "doi": ""
    },
    {
      "text": "Peter Schultes, Verena Dorner, and Franz Lehner. 2013. Leave a Comment! An In-Depth Analysis of User Comments on YouTube. Wirtschaftsinformatik 42 (2013), 659--673.",
      "doi": ""
    },
    {
      "text": "Stefan Siersdorfer, Sergiu Chelaru, Wolfgang Nejdl, and Jose San Pedro. 2010. How useful are your comments?: Analyzing and predicting YouTube comments and comment ratings. In Proceedings of the 19th International Conference on World Wide Web. ACM, New York, NY, 891--900.  ",
      "doi": "10.1145/1772690.1772781"
    },
    {
      "text": "William Sugar, Abbie Brown, and Kenneth Luterbach. 2010. Examining the anatomy of a screencast: Uncovering common elements and instructional strategies. The International Review of Research in Open and Distributed Learning 11, 3 (2010), 1--20.",
      "doi": ""
    },
    {
      "text": "Clive Thompson. 2011. How Khan Academy is changing the rules of education. Wired Magazine 126 (2011), 1--5.",
      "doi": ""
    },
    {
      "text": "Michael Tsang, George W. Fitzmaurice, Gordon Kurtenbach, Azam Khan, and Bill Buxton. 2002. Boom Chameleon: Simultaneous Capture of 3D Viewpoint, Voice and Gesture Annotations on a Spatially-aware Display. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, New York, NY, USA, 111--120.  ",
      "doi": "10.1145/571985.572001"
    },
    {
      "text": "Dustin J Welbourne and Will J Grant. 2016. Science communication on YouTube: Factors that affect channel and video popularity. Public Understanding of Science 25, 6 (2016), 706--718.",
      "doi": ""
    },
    {
      "text": "Dongwook Yoon, Nicholas Chen, François Guimbretière, and Abigail Sellen. 2014. RichReview: Blending ink, speech, and gesture to support collaborative document review. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, 481--490.  ",
      "doi": "10.1145/2642918.2647390"
    },
    {
      "text": "Xun Yuan, Wei Lai, Tao Mei, Xian-Sheng Hua, Xiu-Qing Wu, and Shipeng Li. 2006. Automatic video genre categorization using hierarchical SVM. In International Conference on Image Processing. IEEE, Piscataway, NJ, 2905--2908.",
      "doi": ""
    },
    {
      "text": "Sacha Zyto, David Karger, Mark Ackerman, and Sanjoy Mahajan. 2012. Successful Classroom Deployment of a Social Document Annotation System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 1883--1892.  ",
      "doi": "10.1145/2207676.2208326"
    }
  ]
}