{
  "doi": "10.1145/3290605.3300599",
  "title": "Geppetto: Enabling Semantic Design of Expressive Robot Behaviors",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Expressive robots are useful in many contexts, from industrial to entertainment applications. However, designing expressive robot behaviors requires editing a large number of unintuitive control parameters. We present an interactive, data-driven system that allows editing of these complex parameters in a semantic space. Our system combines a physics-based simulation that captures the robot's motion capabilities, and a crowd-powered framework that extracts relationships between the robot's motion parameters and the desired semantic behavior. These relationships enable mixed-initiative exploration of possible robot motions. We specifically demonstrate our system in the context of designing emotionally expressive behaviors. A user-study finds the system to be useful for more quickly developing desirable robot behaviors, compared to manual parameter editing.",
  "authors": [
    {
      "name": "Ruta Desai",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702024",
      "orcid": "missing"
    },
    {
      "name": "Fraser Anderson",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456623584",
      "orcid": "0000-0003-3486-8943"
    },
    {
      "name": "Justin Matejka",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153192",
      "orcid": "missing"
    },
    {
      "name": "Stelian Coros",
      "institution": "ETH Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320488815",
      "orcid": "missing"
    },
    {
      "name": "James McCann",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81331499170/rel-imgonly/portrait.jpg",
      "acmid": "81331499170",
      "orcid": "0000-0002-4231-4142"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    }
  ],
  "references": [
    {
      "text": "Kaat Alaerts, Evelien Nackaerts, Pieter Meyns, Stephan P Swinnen, and Nicole Wenderoth. 2011. Action and emotion recognition from point light displays: an investigation of gender diferences. PloS one 6, 6 (2011), e20989.",
      "doi": ""
    },
    {
      "text": "Deepali Aneja, Alex Colburn, Gary Faigin, Linda Shapiro, and Barbara Mones. 2016. Modeling Stylized Character Expressions via Deep Learning. In Asian Conference on Computer Vision. Springer, 136--153.",
      "doi": ""
    },
    {
      "text": "Autodesk 2018. Autodesk Maya. Autodesk. https://www.autodesk. com/products/maya/overview.",
      "doi": ""
    },
    {
      "text": "Connelly Barnes, David E Jacobs, Jason Sanders, Dan B Goldman, Szymon Rusinkiewicz, Adam Finkelstein, and Maneesh Agrawala. 2008. Video puppetry: a performative interface for cutout animation. In ACM Transactions on Graphics (TOG), Vol. 27. ACM, 124.  ",
      "doi": "10.1145/1409060.1409077"
    },
    {
      "text": "Lyn Bartram and Ai Nakatani. 2010. What makes motion meaningful? Afective properties of abstract motion. In Image and Video Technology (PSIVT), 2010 Fourth Pacifc-Rim Symposium on. IEEE, 468--474.  ",
      "doi": "10.1109/PSIVT.2010.85"
    },
    {
      "text": "Aude Billard, Sylvain Calinon, Ruediger Dillmann, and Stefan Schaal. 2008. Robot programming by demonstration. In Springer handbook of robotics. Springer, 1371--1394.",
      "doi": ""
    },
    {
      "text": "Blender Foundation 2018. Blender. Blender Foundation. https: //www.blender.org/.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal, Atsuo Takanishi, and Tetsunori Kobayashi. 2008. Social robots that interact with people. In Springer handbook of robotics. Springer, 1349--1369.",
      "doi": ""
    },
    {
      "text": "Siddhartha Chaudhuri, Evangelos Kalogerakis, Stephen Giguere, and Thomas Funkhouser. 2013. Attribit: content creation with semantic attributes. In Proceedings of the 26th annual ACM symposium on User interface software and technology. ACM, 193--202.  ",
      "doi": "10.1145/2501988.2502008"
    },
    {
      "text": "Paul Christiano, Jan Leike, Tom B Brown, Miljan Martic, Shane Legg, and Dario Amodei. 2017. Deep reinforcement learning from human preferences. arXiv preprint arXiv:1706.03741 (2017).",
      "doi": ""
    },
    {
      "text": "Loïc Ciccone, Martin Guay, Maurizio Nitti, and Robert W Sumner. 2017. Authoring motion cycles. In Proceedings of the ACM SIGGRAPH/Eurographics Symposium on Computer Animation. ACM, 8.  ",
      "doi": "10.1145/3099564.3099570"
    },
    {
      "text": "László Csató. 2013. Ranking by pairwise comparisons for Swiss-system tournaments. Central European Journal of Operations Research 21, 4 (2013), 783--803.",
      "doi": ""
    },
    {
      "text": "Geof Cumming. 2014. The new statistics: Why and how. Psychological science 25, 1 (2014), 7--29.",
      "doi": ""
    },
    {
      "text": "Geof Cumming and Sue Finch. 2005. Inference by eye: confdence intervals and how to read pictures of data. American Psychologist 60, 2 (2005), 170.",
      "doi": ""
    },
    {
      "text": "Sébastien Dalibard, Nadia Magnenat-Talmann, and Daniel Thalmann. 2012. Anthropomorphism of artifcial agents: a comparative survey of expressive design and motion of virtual Characters and Social Robots. In Workshop on Autonomous Social Robots and Virtual Humans at the 25th Annual Conference on Computer Animation and Social Agents (CASA 2012).",
      "doi": ""
    },
    {
      "text": "Disney 2003. Lucky the Dinosaur. Disney. https://disneyparks.disney.go.com/blog/2013/08/ today-in-disney-history-lucky-the-dinosaur-walks-on-the-scene/.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic, Fanny Chevalier, and Stephane Huot. 2014. Running an HCI experiment in multiple parallel universes. In CHI'14 Extended Abstracts on Human Factors in Computing Systems. ACM, 607--618.  ",
      "doi": "10.1145/2559206.2578881"
    },
    {
      "text": "Abhimanyu Dubey, Nikhil Naik, Devi Parikh, Ramesh Raskar, and César A Hidalgo. 2016. Deep learning the city: Quantifying urban perception at a global scale. In European Conference on Computer Vision. Springer, 196--212.",
      "doi": ""
    },
    {
      "text": "Magda Dubois, Josep-Arnau Claret, Luis Basañez, and Gentiane Venture. 2016. Infuence of Emotional Motions in Human-Robot Interactions. In International Symposium on Experimental Robotics. Springer, 799--808.",
      "doi": ""
    },
    {
      "text": "Paul Ekman and Wallace V Friesen. 1971. Constants across cultures in the face and emotion. Journal of personality and social psychology 17, 2 (1971), 124.",
      "doi": ""
    },
    {
      "text": "Victor Emeli. 2012. Robot learning through social media crowdsourcing. In Intelligent Robots and Systems (IROS), 2012 IEEE/RSJ International Conference on. IEEE, 2332--2337.",
      "doi": ""
    },
    {
      "text": "Vittorio Gallese, Christian Keysers, and Giacomo Rizzolatti. 2004. A unifying view of the basis of social cognition. Trends in cognitive sciences 8, 9 (2004), 396--403.",
      "doi": ""
    },
    {
      "text": "Madeline Gannon. 2017. Human-Centered Interfaces for Autonomous Fabrication Machines. Ph.D. Dissertation. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Oliver Glauser, Wan-Chun Ma, Daniele Panozzo, Alec Jacobson, Otmar Hilliges, and Olga Sorkine-Hornung. 2016. Rig animation with a tangible and modular input device. ACM Transactions on Graphics (TOG) 35, 4 (2016), 144.  ",
      "doi": "10.1145/2897824.2925909"
    },
    {
      "text": "John Harris and Ehud Sharlin. 2011. Exploring the afect of abstract motion in social human-robot interaction. In RO-MAN, 2011 IEEE. IEEE, 441--448.",
      "doi": ""
    },
    {
      "text": "Malte F Jung. 2017. Afective Grounding in Human-Robot Interaction. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 263--273.  ",
      "doi": "10.1145/2909824.3020224"
    },
    {
      "text": "Heather Knight and Reid Simmons. 2016. Laban head-motions convey robot state: A call for robot body language. In Robotics and Automation (ICRA), 2016 IEEE International Conference on. IEEE, 2881--2888.",
      "doi": "10.1109/ICRA.2016.7487451"
    },
    {
      "text": "Adriana Kovashka, Devi Parikh, and Kristen Grauman. 2012. Whittlesearch: Image search with relative attribute feedback. In Computer Vision and Pattern Recognition (CVPR), 2012 IEEE Conference on. IEEE, 2973--2980. ",
      "doi": "10.5555/2354409.2354723"
    },
    {
      "text": "Yuki Koyama and Masataka Goto. 2018. OptiMo: Optimization-Guided Motion Editing for Keyframe Character Animation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 161.  ",
      "doi": "10.1145/3173574.3173735"
    },
    {
      "text": "Yuki Koyama, Daisuke Sakamoto, and Takeo Igarashi. 2014. Crowdpowered parameter analysis for visual design exploration. In Proceedings of the 27th annual ACM symposium on User interface software and technology. ACM, 65--74.  ",
      "doi": "10.1145/2642918.2647386"
    },
    {
      "text": "KUKA 2017. Industrial robots. KUKA. https://www.kuka.com/ en-us/products/robotics-systems/industrial-robots.",
      "doi": ""
    },
    {
      "text": "Pierre-Yves Lafont, Zhile Ren, Xiaofeng Tao, Chao Qian, and James Hays. 2014. Transient attributes for high-level understanding and editing of outdoor scenes. ACM Transactions on Graphics (TOG) 33, 4 (2014), 149.  ",
      "doi": "10.1145/2601097.2601101"
    },
    {
      "text": "Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R Klemmer. 2010. Designing with interactive example galleries. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2257--2266.  ",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Yueh-Hung Lin, Chia-Yang Liu, Hung-Wei Lee, Shwu-Lih Huang, and Tsai-Yen Li. 2009. Evaluating emotive character animations created with procedural animation. In Intelligent Virtual Agents. Springer, 308-- 315.  ",
      "doi": "10.1007/978-3-642-04380-2_33"
    },
    {
      "text": "Justin Matejka, Michael Glueck, Erin Bradner, Ali Hashemi, Tovi Grossman, and George Fitzmaurice. 2018. Dream Lens: Exploration and Visualization of Large-Scale Generative Design Datasets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 369.  ",
      "doi": "10.1145/3173574.3173943"
    },
    {
      "text": "Vittorio Megaro, Bernhard Thomaszewski, Maurizio Nitti, Otmar Hilliges, Markus Gross, and Stelian Coros. 2015. Interactive design of 3D-printable robotic creatures. ACM Transactions on Graphics (TOG) 34, 6 (2015), 216.  ",
      "doi": "10.1145/2816795.2818137"
    },
    {
      "text": "Microsoft Research 2017. TrueSkill. Microsoft Research. http:// trueskill.org/.",
      "doi": ""
    },
    {
      "text": "Brian K Mok, Stephen Yang, David Sirkin, and Wendy Ju. 2014. Empathy: interactions with emotive robotic drawers. In Proceedings of the 2014 ACM/IEEE international conference on Human-robot interaction. ACM, 250--251.  ",
      "doi": "10.1145/2559636.2563720"
    },
    {
      "text": "Nikhil Naik, Jade Philipoom, Ramesh Raskar, and César Hidalgo. 2014. Streetscore-predicting the perceived safety of one million streetscapes. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition Workshops. 779--785.  ",
      "doi": "10.1109/CVPRW.2014.121"
    },
    {
      "text": "Jorge Nocedal and Stephen J Wright. 2006. Numerical optimization. (2006).",
      "doi": ""
    },
    {
      "text": "Peter O'Donovan, J¯ beks, Aseem Agarwala, and Aaron Hertzanis L¯ mann. 2014. Exploratory font selection using crowdsourced attributes. ACM Transactions on Graphics (TOG) 33, 4 (2014), 92.  ",
      "doi": "10.1145/2601097.2601110"
    },
    {
      "text": "Open Source Robotics Foundation 2018. ROS. Open Source Robotics Foundation. http://www.ros.org/.",
      "doi": ""
    },
    {
      "text": "Wei Pan and Lorenzo Torresani. 2009. Unsupervised hierarchical modeling of locomotion styles. In Proceedings of the 26th Annual International Conference on Machine Learning. ACM, 785--792.  ",
      "doi": "10.1145/1553374.1553475"
    },
    {
      "text": "Devi Parikh and Kristen Grauman. 2011. Relative attributes. In Computer Vision (ICCV), 2011 IEEE International Conference on. IEEE, 503-- 510.  ",
      "doi": "10.1109/ICCV.2011.6126281"
    },
    {
      "text": "Craig W Reynolds. 1987. Flocks, herds and schools: A distributed behavioral model. ACM SIGGRAPH computer graphics 21, 4 (1987), 25--34.  ",
      "doi": "10.1145/37402.37406"
    },
    {
      "text": "Tiago Ribeiro and Ana Paiva. 2012. The illusion of robotic life: principles and practices of animation for robots. In Human-Robot Interaction (HRI), 2012 7th ACM/IEEE International Conference on. IEEE, 383--390.  ",
      "doi": "10.1145/2157689.2157814"
    },
    {
      "text": "Martin Saerbeck and Christoph Bartneck. 2010. Perception of afect elicited by robot motion. In Human-Robot Interaction (HRI), 2010 5th ACM/IEEE International Conference on. IEEE, 53--60. ",
      "doi": "10.5555/1734454.1734473"
    },
    {
      "text": "Frank L Schmidt. 2013. Eight Common But False Objections to the Discontinuation of Signifcance Testing in the. What if there were no signifcance tests? (2013), 37.",
      "doi": ""
    },
    {
      "text": "Ana Serrano, Diego Gutierrez, Karol Myszkowski, Hans-Peter Seidel, and Belen Masia. 2016. An intuitive control space for material appearance. ACM Transactions on Graphics (TOG) 35, 6 (2016), 186.  ",
      "doi": "10.1145/2980179.2980242"
    },
    {
      "text": "Ari Shapiro, Yong Cao, and Petros Faloutsos. 2006. Style components. In Proceedings of Graphics Interface 2006. Canadian Information Processing Society, 33--39. ",
      "doi": "10.5555/1143079.1143086"
    },
    {
      "text": "Ronit Slyper, Guy Hofman, and Ariel Shamir. 2015. Mirror Puppeteering: Animating Toy Robots in Front of a Webcam. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, 241--248.  ",
      "doi": "10.1145/2677199.2680548"
    },
    {
      "text": "Sichao Song and Seiji Yamada. 2017. Expressing emotions through color, sound, and vibration with an appearance-constrained social robot. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 2--11.  ",
      "doi": "10.1145/2909824.3020239"
    },
    {
      "text": "Sony 2017. Aibo. Sony. http://www.sony-aibo.com/.",
      "doi": ""
    },
    {
      "text": "Yuyin Sun and Dieter Fox. 2016. Neol: Toward never-ending object learning for robots. In Robotics and Automation (ICRA), 2016 IEEE International Conference on. IEEE, 1621--1627.",
      "doi": "10.1109/ICRA.2016.7487302"
    },
    {
      "text": "Daniel Szafr, Bilge Mutlu, and Terrence Fong. 2014. Communication of intent in assistive free fyers. In Proceedings of the 2014 ACM/IEEE international conference on Human-robot interaction. ACM, 358--365.  ",
      "doi": "10.1145/2559636.2559672"
    },
    {
      "text": "Leila Takayama, Doug Dooley, and Wendy Ju. 2011. Expressing thought: improving robot readability with animation principles. In Proceedings of the 6th international conference on Human-robot interaction. ACM, 69--76.  ",
      "doi": "10.1145/1957656.1957674"
    },
    {
      "text": "Haodan Tan, John Tiab, Selma Sabanovic, and Kasper Hornbæk. 2016. Happy Moves, Sad Grooves: Using Theories of Biological Motion and Afect to Design Shape-Changing Interfaces. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 1282--1293.  ",
      "doi": "10.1145/2901790.2901845"
    },
    {
      "text": "Frank Thomas, Ollie Johnston, and Frank. Thomas. 1995. The illusion of life: Disney animation. Hyperion New York.",
      "doi": ""
    },
    {
      "text": "Lauren Vasey, Tovi Grossman, Heather Kerrick, and Danil Nagy. 2016. The hive: a human and robot collaborative building process. In ACM SIGGRAPH 2016 Talks. ACM, 83.  ",
      "doi": "10.1145/2897839.2927404"
    },
    {
      "text": "Gentiane Venture, Hideki Kadone, Tianxiang Zhang, Julie Grèzes, Alain Berthoz, and Halim Hicheur. 2014. Recognizing emotions conveyed by human gait. International Journal of Social Robotics 6, 4 (2014), 621--632.",
      "doi": ""
    },
    {
      "text": "Jue Wang, Steven M Drucker, Maneesh Agrawala, and Michael F Cohen. 2006. The cartoon animation flter. In ACM Transactions on Graphics (TOG), Vol. 25. ACM, 1169--1173.  ",
      "doi": "10.1145/1141911.1142010"
    },
    {
      "text": "Man-Ching Yuen, Irwin King, and Kwong-Sak Leung. 2011. A survey of crowdsourcing systems. In Privacy, Security, Risk and Trust (PASSAT) and 2011 IEEE Third Inernational Conference on Social Computing (SocialCom), 2011 IEEE Third International Conference on. IEEE, 766--773.",
      "doi": ""
    },
    {
      "text": "Mehmet Ersin Yumer, Siddhartha Chaudhuri, Jessica K Hodgins, and Levent Burak Kara. 2015. Semantic shape editing using deformation handles. ACM Transactions on Graphics (TOG) 34, 4 (2015), 86.  ",
      "doi": "10.1145/2766908"
    },
    {
      "text": "Allan Zhou, Dylan Hadfeld-Menell, Anusha Nagabandi, and Anca D Dragan. 2017. Expressive robot motion timing. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 22--31.  ",
      "doi": "10.1145/2909824.3020221"
    }
  ]
}