{
  "doi": "10.1145/3290605.3300499",
  "title": "GameViews: Understanding and Supporting Data-driven Sports Storytelling",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Various stakeholders in the sports domain rely on the analysis and presentation of sports data to derive insights. In particular, sportswriters construct game stories using statistical information; fans share their viewpoints based on the real-time stats while watching the game. In this paper, we explore how these stakeholders construct data-driven sports stories. We began by observing a sportswriter, then analyzed published sports stories, and characterized 1500 fan comments about particular sporting events. We found that their story needs were similar in some respects while quite different in others. Based on the findings, we implemented two exploratory prototypes: GameViews-Writers for sportswriters to quickly extract key game information and GameViews-Fans to support a real-time data-driven game-viewing experience for fans. We report insights from two user studies conducted with four professional sportswriters and eight sports fans, respectively. We discuss the results of these studies and present several avenues for future work.",
  "authors": [
    {
      "name": "Qiyu Zhi",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/do/10.1145/contrib-99659173133/rel-imgonly/99659173133.jpg",
      "acmid": "99659173133",
      "orcid": "missing"
    },
    {
      "name": "Suwen Lin",
      "institution": "University of Notre Dame, Notre Dame, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659247310",
      "orcid": "missing"
    },
    {
      "name": "Poorna Talkad Sukumar",
      "institution": "University of Notre Dame, South Bend, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82459085157",
      "orcid": "missing"
    },
    {
      "name": "Ronald Metoyer",
      "institution": "University of Notre Dame, South Bend, IN, USA",
      "img": "/do/10.1145/contrib-81100388468/rel-imgonly/9.13.15ronaldmetoyer11560_medium.jpg",
      "acmid": "81100388468",
      "orcid": "0000-0003-2206-1720"
    }
  ],
  "references": [
    {
      "text": "Benjamin Alamar and Vijay Mehrotra. 2011. Beyond 'Moneyball': The rapidly evolving world of sports analytics, Part I. Analytics Magazine (2011).",
      "doi": ""
    },
    {
      "text": "Benjamin C Alamar. 2013. Sports analytics: A guide for coaches, managers, and other decision makers. Columbia University Press.",
      "doi": ""
    },
    {
      "text": "William Aspray and Barbara M Hayes. 2011. Everyday information: The evolution of information seeking in America. MIT Press. ",
      "doi": "10.5555/1972542"
    },
    {
      "text": "Rahul C Basole and Dietmar Saupe. 2016. Sports Data Visualization",
      "doi": ""
    },
    {
      "text": ". IEEE Computer Graphics and Applications 36, 5 (2016), 24--26.",
      "doi": ""
    },
    {
      "text": "Peter Beshai. 2014. Buckets: Basketball Shot Visualization. University of British Columbia, published Dec (2014), 547--14.",
      "doi": ""
    },
    {
      "text": "Callum Booth. 2018. Reddit surpasses Facebook to become the 3rd most visited site in the US. The Next Web (2018).",
      "doi": ""
    },
    {
      "text": "Chris Bryan, Kwan-Liu Ma, and Jonathan Woodring. 2017. Temporal summary images: An approach to narrative visualization via interactive annotation generation and placement. IEEE transactions on visualization and computer graphics 23, 1 (2017), 511--520.  ",
      "doi": "10.1109/TVCG.2016.2598876"
    },
    {
      "text": "Alberto Cairo. 2012. The Functional Art: An introduction to information graphics and visualization. New Riders. ",
      "doi": "10.5555/2432449"
    },
    {
      "text": "Michele E Capella. 2002. Measuring sports fans' involvement: The fan behavior questionnaire. Southern Business Review 27, 2 (2002), 30.",
      "doi": ""
    },
    {
      "text": "Wei Chen, Tianyi Lao, Jing Xia, Xinxin Huang, Biao Zhu, Wanqi Hu, and Huihua Guan. 2016. GameFlow: Narrative Visualization of NBA Basketball Games. IEEE Transactions on Multimedia 18, 11 (2016), 2247--2256.  ",
      "doi": "10.1109/TMM.2016.2614221"
    },
    {
      "text": "Andy Cox and John Stasko. 2006. Sportsvis: Discovering meaning in sports statistics through information visualization. In Compendium of Symposium on Information Visualization. 114--115.",
      "doi": ""
    },
    {
      "text": "Niloofar Dezfuli, Mohammadreza Khalilbeigi, Max Mühlhäuser, and David Geerts. 2011. A study on interpersonal relationships for social interactive television. In Proceedings of the 9th European Conference on Interactive TV and Video. ACM, 21--24.  ",
      "doi": "10.1145/2000119.2000123"
    },
    {
      "text": "Kevin Draper. 2018. N.B.A. Pushes for Legal Sports Gambling Nationwide and a Cut of the Bets. New York Times (2018).",
      "doi": ""
    },
    {
      "text": "Kevin Filo, Daniel Lock, and Adam Karg. 2015. Sport and social media research: A review. Sport management review 18, 2 (2015), 166--181.",
      "doi": ""
    },
    {
      "text": "Johanna Fulda, Matthew Brehmel, and Tamara Munzner. 2016. Time- LineCurator: Interactive authoring of visual timelines from unstructured text. IEEE transactions on visualization and computer graphics 22, 1 (2016), 300--309.",
      "doi": ""
    },
    {
      "text": "David Geerts, Pablo Cesar, and Dick Bulterman. 2008. The implications of program genres for the design of social television systems. In Proceedings of the 1st international conference on Designing interactive user experiences for TV and video. ACM, 71--80.  ",
      "doi": "10.1145/1453805.1453822"
    },
    {
      "text": "Nahum Gershon and Ward Page. 2001. What storytelling can do for information visualization. Commun. ACM 44, 8 (2001), 31--37.  ",
      "doi": "10.1145/381641.381653"
    },
    {
      "text": "Gunnar Harboe, Noel Massey, Crysta Metcalf, David Wheatley, and Guy Romano. 2008. The uses of social television. Computers in entertainment (CIE) 6, 1 (2008), 8.  ",
      "doi": "10.1145/1350843.1350851"
    },
    {
      "text": "Jeffrey Heer, Fernanda B Viégas, and Martin Wattenberg. 2009. Voyagers and voyeurs: Supporting asynchronous collaborative visualization. Commun. ACM 52, 1 (2009), 87--97.  ",
      "doi": "10.1145/1435417.1435439"
    },
    {
      "text": "Shawndra Hill, Aman Nalavade, and Adrian Benton. 2012. Social TV: Real-time social media response to TV advertising. In Proceedings of the Sixth International Workshop on Data Mining for Online Advertising and Internet Economy. ACM, 4.  ",
      "doi": "10.1145/2351356.2351360"
    },
    {
      "text": "Thomas Horky and Barbara Stelzner. 2013. Sports reporting and journalistic principles. Routledge handbook of sport communication (2013), 118--127.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman, Nicholas Diakopoulos, and Eytan Adar. 2013. Contextifier: automatic generation of annotated stock visualizations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2707--2716.  ",
      "doi": "10.1145/2470654.2481374"
    },
    {
      "text": "Kenneth A Hunt, Terry Bristol, and R Edward Bashaw. 1999. A conceptual approach to classifying sports fans. Journal of Services Marketing 13, 6 (1999), 439--452.",
      "doi": ""
    },
    {
      "text": "Eser Kandogan. 2012. Just-in-time annotation of clusters, outliers, and trends in point-based data visualizations. In Visual Analytics Science and Technology (VAST), 2012 IEEE Conference on. IEEE, 73--82.  ",
      "doi": "10.1109/VAST.2012.6400487"
    },
    {
      "text": "Minsam Ko, Jaeryong Yeo, Juyeong Lee, Uichin Lee, and Young Jae Jang. 2016. What makes sports fans interactive? Identifying factors affecting chat interactions in online sports viewing. PloS one 11, 2 (2016), e0148377.",
      "doi": ""
    },
    {
      "text": "Nicholas Kong and Maneesh Agrawala. 2012. Graphical overlays: Using layered elements to aid chart reading. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2631--2638.  ",
      "doi": "10.1109/TVCG.2012.229"
    },
    {
      "text": "Martin J Lee. 1985. Self-esteem and social identity in basketball fans: A closer look at basking-in-reflected glory. Journal of Sport Behavior 8, 4 (1985), 210.",
      "doi": ""
    },
    {
      "text": "Antonio G Losada, Roberto Therón, and Alejandro Benito. 2016. Bkviz: A basketball visual analysis tool. IEEE computer graphics and applications 36, 6 (2016), 58--68.  ",
      "doi": "10.1109/MCG.2016.124"
    },
    {
      "text": "Ronald Metoyer, Qiyu Zhi, Bart Janczuk, and Walter Scheirer. 2018. Coupling Story to Visualization: Using Textual Analysis as a Bridge Between Data and Interpretation. In 23rd International Conference on Intelligent User Interfaces. ACM, 503--507.  ",
      "doi": "10.1145/3172944.3173007"
    },
    {
      "text": "Thomas W Miller. 2015. Sports analytics and data science: winning the game with methods and models. FT Press.",
      "doi": ""
    },
    {
      "text": "Elia Morgulev, Ofer H Azar, and Ronnie Lidor. 2018. Sports analytics and the big-data era. International Journal of Data Science and Analytics (2018), 1--10.",
      "doi": ""
    },
    {
      "text": "Jeffrey Nichols, Jalal Mahmud, and Clemens Drews. 2012. Summarizing sporting events using twitter. In Proceedings of the 2012 ACM international conference on Intelligent User Interfaces. ACM, 189--198.  ",
      "doi": "10.1145/2166966.2166999"
    },
    {
      "text": "Dan R Olsen, Brett Partridge, and Stephen Lynn. 2010. Time warp sports for internet television. ACM Transactions on Computer-Human Interaction (TOCHI) 17, 4 (2010), 16.  ",
      "doi": "10.1145/1879831.1879834"
    },
    {
      "text": "Jameson Otto, Sara Metz, and Nathan Ensmenger. 2011. Sports fans and their information-gathering habits: How media technologies have brought fans closer to their teams over time. Everyday information: The evolution of information seeking in America (2011), 185--216.",
      "doi": ""
    },
    {
      "text": "Charles Perin, Romain Vuillemot, and Jean-Daniel Fekete. 2013. SoccerStories: A kick-off for visual soccer analysis. IEEE transactions on visualization and computer graphics 19, 12 (2013), 2506--2515.  ",
      "doi": "10.1109/TVCG.2013.192"
    },
    {
      "text": "Charles Perin, Romain Vuillemot, CD Stolper, JT Stasko, Jo Wood, and Sheelagh Carpendale. 2018. State of the art of sports data visualization. In Computer Graphics Forum, Vol. 37. Wiley Online Library, 663--686.",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan and Jeffrey Heer. 2014. Authoring narrative visualizations with ellipsis. In Computer Graphics Forum, Vol. 33. Wiley Online Library, 361--370.",
      "doi": ""
    },
    {
      "text": "Edward Segel and Jeffrey Heer. 2010. Narrative visualization: Telling stories with data. IEEE transactions on visualization and computer graphics 16, 6 (2010), 1139--1148.  ",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "Constantino Stavros, Matthew D Meng, Kate Westberg, and Francis Farrelly. 2014. Understanding fan motivation for interacting on social media. Sport management review 17, 4 (2014), 455--469.",
      "doi": ""
    },
    {
      "text": "Robert J Vallerand, Nikos Ntoumanis, Frederick L Philippe, Geneviève L Lavigne, Noémie Carbonneau, Arielle Bonneville, Camille Lagacé- Labonté, and Gabrielle Maliha. 2008. On passion and sports fans: A look at football. Journal of sports sciences 26, 12 (2008), 1279--1293.",
      "doi": ""
    },
    {
      "text": "Justin D Weisz, Sara Kiesler, Hui Zhang, Yuqing Ren, Robert E Kraut, and Joseph A Konstan. 2007. Watching together: integrating text chat with video. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 877--886.  ",
      "doi": "10.1145/1240624.1240756"
    },
    {
      "text": "Lawrence A Wenner and Walter Gantz. 1998. Watching sports on television: Audience experience, gender, fanship, and marriage. MediaSport (1998), 233--251.",
      "doi": ""
    },
    {
      "text": "Yingcai Wu, Ji Lan, Xinhuan Shu, Chenyang Ji, Kejian Zhao, Jiachen Wang, and Hui Zhang. 2018. iTTVis: Interactive Visualization of Table Tennis Data. IEEE transactions on visualization and computer graphics 24, 1 (2018), 709--718.",
      "doi": ""
    }
  ]
}