{
  "doi": "10.1145/3290605.3300458",
  "title": "On the Shoulder of the Giant: A Multi-Scale Mixed Reality Collaboration with 360 Video Sharing and Tangible Interaction",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2019,
  "badges": [],
  "abstract": "We propose a multi-scale Mixed Reality (MR) collaboration between the Giant, a local Augmented Reality user, and the Miniature, a remote Virtual Reality user, in Giant-Miniature Collaboration (GMC). The Miniature is immersed in a 360-video shared by the Giant who can physically manipulate the Miniature through a tangible interface, a combined 360-camera with a 6 DOF tracker. We implemented a prototype system as a proof of concept and conducted a user study (n=24) comprising of four parts comparing: A) two types of virtual representations, B) three levels of Miniature control, C) three levels of 360-video view dependencies, and D) four 360-camera placement positions on the Giant. The results show users prefer a shoulder mounted camera view, while a view frustum with a complimentary avatar is a good visualization for the Miniature virtual representation. From the results, we give design recommendations and demonstrate an example Giant-Miniature Interaction.",
  "authors": [
    {
      "name": "Thammathip Piumsomboon",
      "institution": "University of Canterbury & University of South Australia, Christchurch, Canterbury, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490694758",
      "orcid": "0000-0001-5870-9221"
    },
    {
      "name": "Gun A. Lee",
      "institution": "University of South Australia, Adelaide, South Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548537756",
      "orcid": "missing"
    },
    {
      "name": "Andrew Irlitti",
      "institution": "University of South Australia, Adelaide, South Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82858881857",
      "orcid": "0000-0003-2760-2995"
    },
    {
      "name": "Barrett Ens",
      "institution": "Monash University, Melbourne, Victoria, Australia",
      "img": "/do/10.1145/contrib-81488672423/rel-imgonly/hci_holiday_lunch_2013_5.jpg",
      "acmid": "81488672423",
      "orcid": "0000-0001-6695-4809"
    },
    {
      "name": "Bruce H. Thomas",
      "institution": "University of South Australia, Mawson Lakes, South Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100411664",
      "orcid": "0000-0002-9148-085X"
    },
    {
      "name": "Mark Billinghurst",
      "institution": "University of South Australia, Mawson Lakes, South Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100499261",
      "orcid": "0000-0003-4172-6759"
    }
  ],
  "references": [
    {
      "text": "Sigurdur O Adalgeirsson and Cynthia Breazeal. 2010. MeBot: a robotic platform for socially embodied presence. in Proceedings of the 5th ACM/IEEE international conference on Human-robot interaction, IEEE Press, 15--22. ",
      "doi": "10.5555/1734454.1734467"
    },
    {
      "text": "Judith Amores, Xavier Benavides and Pattie Maes. 2015. Showme: A remote collaboration system that supports immersive gestural communication. in Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 1343--1348.  ",
      "doi": "10.1145/2702613.2732927"
    },
    {
      "text": "Sathya Barathan, Gun A. Lee, Mark Billinghurst and Robert W. Lindeman. 2017. Sharing Gaze for Remote Instruction ICAT-EGVE 2017 - International Conference on Artificial Reality and Telexistence and Eurographics Symposium on Virtual Environments, The Eurographics Association. ",
      "doi": "10.5555/3298830.3298863"
    },
    {
      "text": "Stephan Beck, Andre Kunert, Alexander Kulik and Bernd Froehlich. 2013. Immersive group-to-group telepresence. IEEE Transactions on Visualization and Computer Graphics, 19 (4). 616--625.  ",
      "doi": "10.1109/TVCG.2013.33"
    },
    {
      "text": "Mark Billinghurst, Hirokazu Kato and Ivan Poupyrev. 2001. The MagicBook: a transitional AR interface. Computers & Graphics, 25 (5). 745--753.",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst, Alaeddin Nassani and Carolin Reichherzer. 2014. Social panoramas: using wearable computers to share experiences. in SIGGRAPH Asia 2014 Mobile Graphics and Interactive Applications, ACM, 25.  ",
      "doi": "10.1145/2669062.2669084"
    },
    {
      "text": "Scott Brave, Hiroshi Ishii and Andrew Dahley. 1998. Tangible interfaces for remote collaboration and communication Proceedings of the 1998 ACM conference on Computer supported cooperative work, ACM, Seattle, Washington, USA, 169--178.  ",
      "doi": "10.1145/289444.289491"
    },
    {
      "text": "Minghao Cai, Soh Masuko and Jiro Tanaka. 2018. Gesture-based Mobile Communication System Providing Side-by-side Shopping Feeling. in Proceedings of the 23rd International Conference on Intelligent User Interfaces Companion, ACM, 2.  ",
      "doi": "10.1145/3180308.3180310"
    },
    {
      "text": "Katherine M. Everitt, Scott R. Klemmer, Robert Lee and James A. Landay. 2003. Two worlds apart: bridging the gap between physical and virtual media for distributed design collaboration Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Ft. Lauderdale, Florida, USA, 553--560.  ",
      "doi": "10.1145/642611.642707"
    },
    {
      "text": "Faro. FOCUS-M 70. Retrieved January 1, 2019 from https://www.faro.com/en-sg/products/construction-bim/faro-laserscanner-focus/.",
      "doi": ""
    },
    {
      "text": "Cédric Fleury, Alain Chauffaut, Thierry Duval, Valérie Gouranton and Bruno Arnaldi. 2010. A Generic Model for Embedding Users' Physical Workspaces into Multi-Scale Collaborative Virtual Environments. in ICAT 2010 (20th International Conference on Artificial Reality and Telexistence), Adelaide, Australia.",
      "doi": ""
    },
    {
      "text": "Susan R Fussell, Leslie D Setlock and Robert E Kraut. 2003. Effects of head-mounted and scene-oriented video systems on remote collaboration on physical tasks. in Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 513--520.  ",
      "doi": "10.1145/642611.642701"
    },
    {
      "text": "Susan R Fussell, Leslie D Setlock, Jie Yang, Jiazhi Ou, Elizabeth Mauer and Adam DI Kramer. 2004. Gestures over video streams to support remote collaboration on physical tasks. Human-Computer Interaction, 19 (3). 273--309.  ",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Lei Gao, Huidong Bai, Gun Lee and Mark Billinghurst. 2016. An oriented point-cloud view for MR remote collaboration. in SIGGRAPH ASIA 2016 Mobile Graphics and Interactive Applications, ACM, 8.  ",
      "doi": "10.1145/2999508.2999531"
    },
    {
      "text": "Lei Gao, Huidong Bai, Thammathip Piumsomboon, G Lee, Robert W Lindeman and Mark Billinghurst. 2017. Real-time Visual Representations for Mixed Reality Remote Collaboration.",
      "doi": ""
    },
    {
      "text": "Garmin. VIRB 360. Retrieved January 1, 2019 from https://buy.garmin.com/en-AU/AU/p/562010.",
      "doi": ""
    },
    {
      "text": "Steffen Gauglitz, Cha Lee, Matthew Turk and Tobias Höllerer. 2012. Integrating the physical environment into mobile remote collaboration. in Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services, ACM, 241--250.  ",
      "doi": "10.1145/2371574.2371610"
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk and Tobias Höllerer. 2014. In touch with the remote world: Remote collaboration with augmented reality drawings and virtual navigation. in Proceedings of the 20th ACM Symposium on Virtual Reality Software and Technology, ACM, 197--205.  ",
      "doi": "10.1145/2671015.2671016"
    },
    {
      "text": "Steffen Gauglitz, Benjamin Nuernberger, Matthew Turk and Tobias Höllerer. 2014. World-stabilized annotations and virtual scene navigation for remote collaboration. in Proceedings of the 27th annual ACM symposium on User interface software and technology, ACM, 449--459.  ",
      "doi": "10.1145/2642918.2647372"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Julian Frommel and Enrico Rukzio. 2017. ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM, Denver, Colorado, USA, 4021--4033.  ",
      "doi": "10.1145/3025453.3025683"
    },
    {
      "text": "Kunal Gupta, Gun A Lee and Mark Billinghurst. 2016. Do You See What I See? The Effect of Gaze Tracking on Task Space Remote Collaboration. IEEE Transactions on Visualization and Computer Graphics, 22 (11). 2413--2422.",
      "doi": "10.1109/TVCG.2016.2593778"
    },
    {
      "text": "Chad Harms and Frank Biocca. 2004. Internal consistency and reliability of the networked minds measure of social presence In M. Alcaniz & B. Rey (Eds.), Seventh Annual International Workshop: Presence 2004, Valencia: Universidad Politecnica de Valencia.",
      "doi": ""
    },
    {
      "text": "Keita Higuchi, Katsuya Fujii and Jun Rekimoto. 2013. Flying head: A head-synchronization mechanism for flying telepresence. in 2013 23rd International Conference on Artificial Reality and Telexistence (ICAT), 28--34.",
      "doi": ""
    },
    {
      "text": "Keita Higuchi, Ryo Yonetani and Yoichi Sato. 2016. Can Eye Help You?: Effects of Visualizing Eye Fixations on Remote Collaboration Scenarios for Physical Tasks. in Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, ACM, 51805190.  ",
      "doi": "10.1145/2858036.2858438"
    },
    {
      "text": "HTC. Vive. Retrieved January 1, 2019 from https://www.vive.com/au/product/.",
      "doi": ""
    },
    {
      "text": "HTC. Vive Pro, Retrieved January 1, 2019 from https://www.vive.com/au/product/vive-pro/.",
      "doi": ""
    },
    {
      "text": "HTC. Vive SRWorks SDK. Retrieved January 1, 2019 from https://developer.vive.com/resources/knowledgebase/intro-vivesrworks-sdk/.",
      "doi": ""
    },
    {
      "text": "HTC. Vive Tracker. Retrieved January 1, 2019 from https://www.vive.com/au/vive-tracker/.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii. 2008. The tangible user interface and its evolution. Communications of the ACM, 51 (6). 32--36.  ",
      "doi": "10.1145/1349026.1349034"
    },
    {
      "text": "Shunichi Kasahara, Shohei Nagai and Jun Rekimoto. 2017. JackIn Head: Immersive Visual Telepresence System with Omnidirectional Wearable Camera. IEEE Transactions on Visualization and Computer Graphics, 23 (3). 1222--1234.  ",
      "doi": "10.1109/TVCG.2016.2642947"
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology, 3 (3). 203--220.",
      "doi": ""
    },
    {
      "text": "Seungwon Kim, Mark Billinghurst and Gun Lee. 2018. The Effect of Collaboration Styles and View Independence on Video-Mediated Remote Collaboration. Computer Supported Cooperative Work (CSCW). 1--39.  ",
      "doi": "10.1007/s10606-018-9324-2"
    },
    {
      "text": "Seungwon Kim, Gun A Lee, Nobuchika Sakata, Andreas Dunser, Elina Vartiainen and Mark Billinghurst. 2013. Study of augmented gesture communication cues and view sharing in remote collaboration. in Mixed and Augmented Reality (ISMAR), 2013 IEEE International Symposium on, IEEE, 261--262.",
      "doi": ""
    },
    {
      "text": "Seungwon Kim, Gun Lee, Nobuchika Sakata and Mark Billinghurst. 2014. Improving co-presence with augmented visual communication cues for sharing experience through video conference. in Mixed and Augmented Reality (ISMAR), 2014 IEEE International Symposium on, IEEE, 83--92.",
      "doi": ""
    },
    {
      "text": "Kiyoshi Kiyokawa, Haruo Takemura and Naokazu Yokoya. 1999. A collaboration support technique by integrating a shared virtual reality and a shared augmented reality. in Systems, Man, and Cybernetics, 1999. IEEE SMC'99 Conference Proceedings. 1999 IEEE International Conference on, IEEE, 48--53.",
      "doi": ""
    },
    {
      "text": "Scott R. Klemmer, Mark W. Newman, Ryan Farrell, Mark Bilezikjian and James A. Landay. 2001. The designers' outpost: a tangible interface for collaborative web site Proceedings of the 14th annual ACM symposium on User interface software and technology, ACM, Orlando, Florida, 1--10.  ",
      "doi": "10.1145/502348.502350"
    },
    {
      "text": "Regis Kopper, Tao Ni, Doug A Bowman and Marcio Pinho. 2006. Design and evaluation of navigation techniques for multiscale virtual environments. in Virtual Reality Conference, 2006, Ieee, 175182.  ",
      "doi": "10.1109/VR.2006.47"
    },
    {
      "text": "Takeshi Kurata, Nobuchika Sakata, Masakatsu Kourogi, Hideaki Kuzuoka and Mark Billinghurst. 2004. Remote collaboration using a shoulder-worn active camera/laser. in Eighth International Symposium on Wearable Computers, 62--69.  ",
      "doi": "10.1109/ISWC.2004.37"
    },
    {
      "text": "Hideaki Kuzuoka, Shinya Oyama, Keiichi Yamazaki, Kenji Suzuki and Mamoru Mitsuishi. 2000. GestureMan: a mobile robot that embodies a remote instructor's actions Proceedings of the 2000 ACM conference on Computer supported cooperative work, ACM, Philadelphia, Pennsylvania, USA, 155--162.  ",
      "doi": "10.1145/358916.358986"
    },
    {
      "text": "Joel Lanir, Ran Stone, Benjamin Cohen and Pavel Gurevich. 2013. Ownership and control of point of view in remote assistance Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Paris, France, 2243--2252.  ",
      "doi": "10.1145/2470654.2481309"
    },
    {
      "text": "Morgan Le Chénéchal, Thierry Duval, Valérie Gouranton, Jérôme Royan and Bruno Arnaldi. 2016. Vishnu: virtual immersive support for HelpiNg users an interaction paradigm for collaborative remote guiding in mixed reality. in Collaborative Virtual Environments (3DCVE), 2016 IEEE Third VR International Workshop on, IEEE, 9--12.",
      "doi": ""
    },
    {
      "text": "Morgan Le Chénéchal, Jérémy Lacoche, Jérôme Royan, Thierry Duval, Valérie Gouranton and Bruno Arnaldi. 2016. When the giant meets the ant an asymmetric approach for collaborative and concurrent object manipulation in a multi-scale environment. in Collaborative Virtual Environments (3DCVE), 2016 IEEE Third VR International Workshop on, IEEE, 18--22.",
      "doi": ""
    },
    {
      "text": "Gun A Lee, Seungwon Kim, Youngho Lee, Arindam Dey, Thammathip Piumsomboon, Mitchell Norman and Mark Billinghurst. 2017. Improving Collaboration in Augmented Video Conference using Mutually Shared Gaze.",
      "doi": ""
    },
    {
      "text": "Gun A Lee, Theophilus Teo, Seungwon Kim and Mark Billinghurst. 2017. Mixed reality collaboration through sharing a live panorama. in SIGGRAPH Asia 2017 Mobile Graphics & Interactive Applications, ACM, 14.  ",
      "doi": "10.1145/3132787.3139203"
    },
    {
      "text": "Gun A Lee, Theophilus Teo, Seungwon Kim and Mark Billinghurst. 2018. A User Study on MR Remote Collaboration using Live 360 Video 2018 IEEE International Symposium on Mixed and Augmented Reality (ISMAR '18)., 153--164",
      "doi": ""
    },
    {
      "text": "Daniel Leithinger, Sean Follmer, Alex Olwal and Hiroshi Ishii. 2014. Physical telepresence: shape capture and display for embodied, computer-mediated remote collaboration Proceedings of On the Shoulder of the Giant CHI'19, May 4--9, 2019, Glasgow, Scotland UK the 27th annual ACM symposium on User interface software and technology, ACM, Honolulu, Hawaii, USA, 461--470.  ",
      "doi": "10.1145/2642918.2647377"
    },
    {
      "text": "Tamotsu Machino, Satoshi Iwaki, Hiroaki Kawata, Yoshimasa Yanagihara, Yoshito Nanjo and Kenichiro Shimokura. 2006. Remote-collaboration system using mobile robot with camera and projector. in Proceedings 2006 IEEE International Conference on Robotics and Automation, 2006. ICRA 2006., 4063--4068.",
      "doi": ""
    },
    {
      "text": "Akira Matsuda, Takashi Miyaki and Jun Rekimoto. 2017. ScalableBody: a telepresence robot that supports face position matching using a vertical actuator Proceedings of the 8th Augmented Human International Conference, ACM, Silicon Valley, California, USA, 1--9.  ",
      "doi": "10.1145/3041164.3041182"
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A taxonomy of mixed reality visual displays. IEICE TRANSACTIONS on Information and Systems, 77 (12). 1321--1329.",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Tobias Langlotz and Holger Regenbrecht. 2016. PanoVC: Pervasive telepresence using mobile phones. in Pervasive Computing and Communications (PerCom), 2016 IEEE International Conference on, IEEE, 1--10.",
      "doi": ""
    },
    {
      "text": "Benjamin Nuernberger, Kuo-Chin Lien, Tobias Höllerer and Matthew Turk. 2016. Interpreting 2d gesture annotations in 3d augmented reality. in 3D User Interfaces (3DUI), 2016 IEEE Symposium on, IEEE, 149--158.",
      "doi": ""
    },
    {
      "text": "Benjamin Nuernberger, Matthew Turk and Tobias Höllerer. 2017. Evaluating snapping-to-photos virtual travel interfaces for 3D reconstructed visual reality. in Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology, ACM, 22.  ",
      "doi": "10.1145/3139131.3139138"
    },
    {
      "text": "Ohan Oda, Carmine Elvezio, Mengu Sukan, Steven Feiner and Barbara Tversky. 2015. Virtual replicas for remote assistance in virtual and augmented reality. in Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, ACM, 405--415.  ",
      "doi": "10.1145/2807442.2807497"
    },
    {
      "text": "Corey Pittman and Joseph J LaViola Jr. 2014. Exploring head tracked head mounted displays for first person robot teleoperation. in Proceedings of the 19th international conference on Intelligent User Interfaces, ACM, 323--328.  ",
      "doi": "10.1145/2557500.2557527"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A Lee, Barrett Ens, Bruce H Thomas and Mark Billinghurst. 2018. Superman vs Giant: A Study on Spatial Perception for a Multi-Scale Mixed Reality Flying Telepresence Interface. IEEE Transactions on Visualization and Computer Graphics. 1--1.",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Arindam Day, Barrett Ens, Youngho Lee, Gun Lee and Mark Billinghurst. 2017. Exploring enhancements for remote mixed reality collaboration SIGGRAPH Asia 2017 Mobile Graphics & Interactive Applications, ACM, Bangkok, Thailand, 1--5.  ",
      "doi": "10.1145/3132787.3139200"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A Lee and Mark Billinghurst. 2018. Snow Dome: A Multi-Scale Interaction in Mixed Reality Remote Collaboration. in Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, D115.  ",
      "doi": "10.1145/3170427.3186495"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A Lee, Jonathon D Hart, Barrett Ens, Robert W Lindeman, Bruce H Thomas and Mark Billinghurst. 2018. Mini-Me: An Adaptive Avatar for Mixed Reality Remote Collaboration. in Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, ACM, 46.  ",
      "doi": "10.1145/3173574.3173620"
    },
    {
      "text": "VR QuickTime. 1995. An Image-Based Approach to Virtual Environment Navigation, Shenchang Eric Chen, Apple Computer, Inc. in Siggraph, Computer Graphics Proceedings, Annual Conference Series, 29--38.  ",
      "doi": "10.1145/218380.218395"
    },
    {
      "text": "Abhishek Ranjan, Jeremy P. Birnholtz and Ravin Balakrishnan. 2007. Dynamic shared visual spaces: experimenting with automatic camera control in a remote repair task Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, San Jose, California, USA, 1177--1186.  ",
      "doi": "10.1145/1240624.1240802"
    },
    {
      "text": "Peter Robinson and Philip Tuddenham. 2007. Distributed Tabletops: Supporting Remote and Mixed-Presence Tabletop Collaboration. in Second Annual IEEE International Workshop on Horizontal Interactive Human-Computer Systems (TABLETOP'07), 1926.",
      "doi": ""
    },
    {
      "text": "Bektur Ryskeldiev, Michael Cohen and Jens Herder. 2017. Applying rotational tracking and photospherical imagery to immersive mobile telepresence and live video streaming groupware. in SIGGRAPH Asia 2017 Mobile Graphics & Interactive Applications, ACM, 5.  ",
      "doi": "10.1145/3132787.3132813"
    },
    {
      "text": "Nobuchika Sakata, Takeshi Kurata, Takekazu Kato, Masakatsu Kourogi and Hideaki Kuzuoka. 2003. WACL: Supporting telecommunications using wearable active camera with laser pointer. in null, IEEE, 53. ",
      "doi": "10.5555/946249.946870"
    },
    {
      "text": "MHD Yamen Saraiji, Tomoya Sasaki, Reo Matsumura, Kouta Minamizawa and Masahiko Inami. 2018. Fusion: full body surrogacy for collaborative communication ACM SIGGRAPH 2018 Emerging Technologies, ACM, Vancouver, British Columbia, Canada, 1--2.  ",
      "doi": "10.1145/3214907.3214912"
    },
    {
      "text": "Jeff Sauro and Joseph S Dumas. 2009. Comparison of three onequestion, post-task usability questionnaires. in Proceedings of the SIGCHI conference on human factors in computing systems, ACM, 1599--1608.  ",
      "doi": "10.1145/1518701.1518946"
    },
    {
      "text": "Rajinder S. Sodhi, Brett R. Jones, David Forsyth, Brian P. Bailey and Giuliano Maciocci. 2013. BeThere: 3D mobile collaboration with spatial input Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Paris, France, 179--188.  ",
      "doi": "10.1145/2470654.2470679"
    },
    {
      "text": "Open Broadcaster Software. OBS Studio. Retrieved January 1, 2019 from https://obsproject.com/.",
      "doi": ""
    },
    {
      "text": "Matthew Tait and Mark Billinghurst. 2015. The Effect of View Independence in a Collaborative AR System. Comput. Supported Coop. Work, 24 (6). 563--589.  ",
      "doi": "10.1007/s10606-015-9231-8"
    },
    {
      "text": "Anthony Tang, Omid Fakourfar, Carman Neustaedter and Scott Bateman. 2017. Collaboration in 360 Videochat: Challenges and Opportunities, University of Calgary.",
      "doi": ""
    },
    {
      "text": "Franco Tecchia, Leila Alem and Weidong Huang. 2012. 3D helping hands: a gesture based MR system for remote collaboration. in Proceedings of the 11th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and its Applications in Industry, ACM, 323--328.  ",
      "doi": "10.1145/2407516.2407590"
    },
    {
      "text": "Unity3D. Unity3D Game Engine. Retrieved January 1, 2019 from https://unity3d.com.",
      "doi": ""
    },
    {
      "text": "Valve Corp. SteamVR Plugin for Unity. Retrieved January 1, 2019 from https://assetstore.unity.com/packages/templates/systems/steamvrplugin-32647.",
      "doi": ""
    },
    {
      "text": "Peter Vorderer, Werner Wirth, Feliz Ribeiro Gouveia, Frank Biocca, Timo Saari, Lutz Jäncke, Saskia Böcking, Holger Schramm, Andre Gysbers and Tilo Hartmann. 2004. MEC Spatial Presence Questionnaire. Retrieved Sept, 18. 2015.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Leah Findlater, Darren Gergle and James J Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. in Proceedings of the SIGCHI conference on human factors in computing systems, ACM, 143--146.  ",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Catherine Zanbaka, Paula Goolkasian and Larry Hodges. 2006. Can a virtual cat persuade you?: the role of gender and realism in speaker persuasiveness. in Proceedings of the SIGCHI conference on Human Factors in computing systems, ACM, 1153--1162.  ",
      "doi": "10.1145/1124772.1124945"
    },
    {
      "text": "Xiaolong Zhang and George W Furnas. 2005. mCVEs: Using crossscale collaboration to support user interaction with multiscale structures. Presence: Teleoperators & Virtual Environments, 14 (1). 31--46.  ",
      "doi": "10.1162/1054746053890288"
    }
  ]
}