{
  "doi": "10.1145/3290605.3300883",
  "title": "Career Mentoring in Online Communities: Seeking and Receiving Advice from an Online Community",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Although people frequently seek mentoring or advice for their career, most mentoring is performed in person. Little research has examined the nature and quality of career mentoring online. To address this gap, we study how people use online Q&A forums for career advice. We develop a taxonomy of career advice requests based on a qualitative analysis of posts in a career-related online forum, identifying three key types: best practices, career threats, and time-sensitive requests. Our quantitative analysis of responses shows that both requesters and external viewers value general information, encouragement, and guidance, but not role modeling. We found no relation between the type of requests and features of responses, nor differences in responses valued by requesters versus external viewers. We present design recommendations for supporting online career advice exchange.",
  "tags": [
    "working adults",
    "online mentoring interactions",
    "online communities",
    "q&a",
    "employment",
    "career advice"
  ],
  "authors": [
    {
      "name": "Maria Tomprou",
      "institution": "Carnegie Mellon University, USA, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130429",
      "orcid": "missing"
    },
    {
      "name": "Laura Dabbish",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100650586",
      "orcid": "0000-0001-9489-4188"
    },
    {
      "name": "Robert E. Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "Fannie Liu",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659201597",
      "orcid": "0000-0002-5656-3406"
    }
  ],
  "references": [
    {
      "text": "2018. Stack Exchange. Retrieved from https://stackexchange.com/ about. Career Mentoring in Online Communities CHI 2019, May 4--9, 2019, Glasgow, Scotland UK",
      "doi": ""
    },
    {
      "text": "Lada A Adamic, Jun Zhang, Eytan Bakshy, and Mark S Ackerman. 2008. Knowledge sharing and yahoo answers: everyone knows something. In Proceedings of the 17th international conference on World Wide Web. ACM, 665--674.  ",
      "doi": "10.1145/1367497.1367587"
    },
    {
      "text": "Tammy D Allen, Lillian T Eby, Mark L Poteet, Elizabeth Lentz, and Lizzette Lima. 2004. Career benefits associated with mentoring for protégés: A meta-analysis. Journal of applied psychology 89, 1 (2004), 127.",
      "doi": ""
    },
    {
      "text": "Andrew Begel, Jan Bosch, and Margaret-Anne Storey. 2013. Social networking meets software development: Perspectives from github, msdn, stack exchange, and topcoder. IEEE Software 30, 1 (2013), 52--66. ",
      "doi": "10.5555/2478553.2478856"
    },
    {
      "text": "Steven Berglas. 2002. The very real dangers of executive coaching. Harvard business review 80, 6 (2002), 86--93.",
      "doi": ""
    },
    {
      "text": "Laura L Bierema and Sharan B Merriam. 2002. E-mentoring: Using computer mediated communication to enhance the mentoring process. Innovative Higher Education 26, 3 (2002), 211--227.",
      "doi": ""
    },
    {
      "text": "Julie Campbell, Cecilia Aragon, Katie Davis, Sarah Evans, Abigail Evans, and David Randall. 2016. Thousands of positive reviews: Distributed mentoring in online fan communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 691--704.  ",
      "doi": "10.1145/2818048.2819934"
    },
    {
      "text": "Georgia T Chao, Patm Walz, and Philip D Gardner. 1992. Formal and informal mentorships: A comparison on mentoring functions and contrast with nonmentored counterparts. Personnel psychology 45, 3 (1992), 619--636.",
      "doi": ""
    },
    {
      "text": "Chun-Wei Chiang, Anna Kasunic, and Saiph Savage. 2018. Crowd Coach: Peer Coaching for Crowd Workers' Skill Growth. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 37.  ",
      "doi": "10.1145/3274306"
    },
    {
      "text": "Suzanne C De Janasz, Sherry E Sullivan, and Vicki Whiting. 2003. Mentor networks and career success: Lessons for turbulent times. The Academy of Management Executive 17, 4 (2003), 78--91.",
      "doi": ""
    },
    {
      "text": "Jubilee Dickson, Katie Kirkpatrick-Husk, Dana Kendall, James Longabaugh, Ajal Patel, and Shannon Scielzo. 2014. Untangling protégé self-reports of mentoring functions: Further meta-analytic understanding. Journal of Career Development 41, 4 (2014), 263--281.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt, Jason Lam, Alex Lu, and Earnest Wheeler. 2018. Designing Future Employment Applications for Underserved Job Seekers: A Speed Dating Study. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, 33--44.  ",
      "doi": "10.1145/3196709.3196770"
    },
    {
      "text": "Lillian Eby, Marcus Buits, Angie Lockwood, and Shana A Simon. 2004. Protégés negative mentoring experiences: Construct development and nomological validation. Personnel Psychology 57, 2 (2004), 411--447.",
      "doi": ""
    },
    {
      "text": "Lillian T Eby, Tammy D Allen, Sarah C Evans, Thomas Ng, and David L DuBois. 2008. Does mentoring matter? A multidisciplinary metaanalysis comparing mentored and non-mentored individuals. Journal of vocational behavior 72, 2 (2008), 254--267.",
      "doi": ""
    },
    {
      "text": "Lillian T Eby, Jaime R Durley, Sarah C Evans, and Belle Rose Ragins. 2006. The relationship between short-term mentoring benefits and long-term mentor outcomes. Journal of Vocational Behavior 69, 3 (2006), 424--444.",
      "doi": ""
    },
    {
      "text": "Umer Farooq, Patricia Schank, Alexandra Harris, Judith Fusco, and Mark Schlager. 2007. Sustaining a community computing infrastructure for online teacher professional development: A case study of designing Tapped In. Computer Supported Cooperative Work (CSCW) 16, 4--5 (2007), 397--429.  ",
      "doi": "10.1007/s10606-007-9049-0"
    },
    {
      "text": "Daniel C Feldman and Melenie J Lankau. 2005. Executive coaching: A review and agenda for future research. Journal of management 31, 6 (2005), 829--848.",
      "doi": ""
    },
    {
      "text": "Denae Ford, Kristina Lustig, Jeremy Banks, and Chris Parnin. 2018. We Don't Do That Here: How Collaborative Editing with Mentors Improves Engagement in Social Q&A Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 608.  ",
      "doi": "10.1145/3173574.3174182"
    },
    {
      "text": "Itamar Gati, Mina Krausz, and Samuel H Osipow. 1996. A taxonomy of difficulties in career decision making. Journal of counseling psychology 43, 4 (1996), 510.",
      "doi": ""
    },
    {
      "text": "Judith Preissle Goetz and Margaret D LeCompte. 1981. Ethnographic research and the problem of data reduction. Anthropology & Education Quarterly 12, 1 (1981), 51--70.",
      "doi": ""
    },
    {
      "text": "Douglas T Hall. 2004. The protean career: A quarter-century journey. Journal of vocational behavior 65, 1 (2004), 1--13.",
      "doi": ""
    },
    {
      "text": "Douglas T Hall, Karen L Otazo, and George P Hollenbeck. 1999. Behind closed doors: What really happens in executive coaching. Organizational dynamics 27, 3 (1999), 39--53.",
      "doi": ""
    },
    {
      "text": "Betti A Hamilton and Terri A Scandura. 2003. E-Mentoring: Implications for organizational learning and development in a wired world. Organizational Dynamics 31, 4 (2003), 388--402.",
      "doi": ""
    },
    {
      "text": "F Maxwell Harper, Daniel Moy, and Joseph A Konstan. 2009. Facts or friends?: distinguishing informational and conversational questions in social Q&A sites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 759--768.  ",
      "doi": "10.1145/1518701.1518819"
    },
    {
      "text": "David G Hendry, Norah Abokhodair, Rose Paquet Kinsley, and Jill Palzkill Woelfer. 2017. Homeless young people, jobs, and a future vision: Community members' perceptions of the job co-op. In Proceedings of the 8th International Conference on Communities and Technologies. ACM, 22--31.  ",
      "doi": "10.1145/3083671.3083680"
    },
    {
      "text": "E Tory Higgins. 1998. Promotion and prevention: Regulatory focus as a motivational principle. In Advances in experimental social psychology. Vol. 30. Elsevier, 1--46.",
      "doi": ""
    },
    {
      "text": "Monica C Higgins and Kathy E Kram. 2001. Reconceptualizing mentoring at work: A developmental network perspective. Academy of management review 26, 2 (2001), 264--288.",
      "doi": ""
    },
    {
      "text": "Gary Hsieh, Robert E Kraut, and Scott E Hudson. 2010. Why pay?: exploring how financial incentives are used for question & answer. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 305--314.  ",
      "doi": "10.1145/1753326.1753373"
    },
    {
      "text": "Herminia Ibarra. 1993. Personal networks of women and minorities in management: A conceptual framework. Academy of management Review 18, 1 (1993), 56--87.",
      "doi": ""
    },
    {
      "text": "Valerie J. Janesick. {n. d.}. Strategies of qualitative inquiry.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, and Katherine Sutton. 2016. Strangers on your phone: Why people use anonymous communication applications. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 359--370.  ",
      "doi": "10.1145/2818048.2820081"
    },
    {
      "text": "Christina Algiere Kasprisin, Peg Boyle Single, Richard M Single, and Carol B Muller. 2003. Building a better bridge: Testing e-training to improve e-mentoring programmes in higher education. Mentoring and Tutoring 11, 1 (2003), 67--78.",
      "doi": ""
    },
    {
      "text": "Kevin R Kelly and Wei-Chien Lee. 2002. Mapping the domain of career decision problems. Journal of Vocational Behavior 61, 2 (2002), 302--326.",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Colin M Gray. 2018. What do you recommend a complete beginner like me to practice?: Professional Self-Disclosure in an Online Community. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (2018), 94.  ",
      "doi": "10.1145/3274363"
    },
    {
      "text": "Kathy E Kram and Lynn A Isabella. 1985. Mentoring alternatives: The role of peer relationships in career development. Academy of management Journal 28, 1 (1985), 110--132.",
      "doi": ""
    },
    {
      "text": "Melenie J Lankau and Terri A Scandura. 2002. An investigation of personal learning in mentoring relationships: Content, antecedents, and consequences. Academy of Management Journal 45, 4 (2002), 779--790.",
      "doi": ""
    },
    {
      "text": "Colin ISG Lee, Will Felps, and Yehuda Baruch. 2014. Toward a taxonomy of career studies through bibliometric visualization. Journal of Vocational Behavior 85, 3 (2014), 339--351. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK M. Tomprou et al.",
      "doi": ""
    },
    {
      "text": "Thomas W Lee. 1999. Using qualitative methods in organizational research. Sage.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Bella Manoim, Manas Mittal, George Hripcsak, and Björn Hartmann. 2011. Design lessons from the fastest q&a site in the west. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 2857--2866.  ",
      "doi": "10.1145/1978942.1979366"
    },
    {
      "text": "Melissa E Mitchell, Lillian T Eby, and Belle Rose Ragins. 2015. My mentor, my self: Antecedents and outcomes of perceived similarity in mentoring relationships. Journal of Vocational Behavior 89 (2015), 1--9.",
      "doi": ""
    },
    {
      "text": "Jonathan T Morgan, Siko Bouterse, Heather Walls, and Sarah Stierch. 2013. Tea and sympathy: crafting positive new user experiences on wikipedia. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 839--848.  ",
      "doi": "10.1145/2441776.2441871"
    },
    {
      "text": "Janice Morse and Lyn Richards. 2002. Read me first for a user's guide to qualitative research. CA, US: Sage Publications Thousand Oaks (2002).",
      "doi": ""
    },
    {
      "text": "Wendy Marcinkus Murphy. 2011. From e-mentoring to blended mentoring: Increasing students' developmental initiation and mentors' satisfaction. Academy of Management Learning & Education 10, 4 (2011), 606--622.",
      "doi": ""
    },
    {
      "text": "Kevin Kyung Nam, Mark S Ackerman, and Lada A Adamic. 2009. Questions in, knowledge in?: a study of naver's question answering community. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 779--788.  ",
      "doi": "10.1145/1518701.1518821"
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Kentaro Toyama, and Tawanna Dillahunt. 2018. Returning Citizens' Job Search and Technology Use: Preliminary Findings. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 365--368.  ",
      "doi": "10.1145/3272973.3274098"
    },
    {
      "text": "Michael Quinn Patton. 2005. Qualitative research. Wiley Online Library.",
      "doi": ""
    },
    {
      "text": "Sharoda A Paul, Lichan Hong, and Ed H Chi. 2012. Who is authoritative? understanding reputation mechanisms in quora. arXiv preprint arXiv:1204.3724 (2012).",
      "doi": ""
    },
    {
      "text": "Daryl Posnett, Eric Warburg, Premkumar Devanbu, and Vladimir Filkov. 2012. Mining stack exchange: Expertise is evident from initial contributions. In Social Informatics (SocialInformatics), 2012 International Conference on. IEEE, 199--204.  ",
      "doi": "10.1109/SocialInformatics.2012.67"
    },
    {
      "text": "Belle Rose Ragins and Terri A Scandura. 1999. Burden or blessing? Expected costs and benefits of being a mentor. Journal of Organizational Behavior (1999), 493--509.",
      "doi": ""
    },
    {
      "text": "Patrick Royston, Douglas G Altman, and Willi Sauerbrei. 2006. Dichotomizing continuous predictors in multiple regression: a bad idea. Statistics in medicine 25, 1 (2006), 127--141.",
      "doi": ""
    },
    {
      "text": "Terri A Scandura. 1998. Dysfunctional mentoring relationships and outcomes. Journal of management 24, 3 (1998), 449--467.",
      "doi": ""
    },
    {
      "text": "Carmit-Noa Shpigelman, Patrice L Tamar Weiss, and Shunit Reiter. 2009. E-mentoring for all. Computers in Human Behavior 25, 4 (2009), 919--928.  ",
      "doi": "10.1016/j.chb.2009.03.007"
    },
    {
      "text": "Peg Boyle Single and Carol B Muller. 2001. When email and mentoring unite: The implementation of a nationwide electronic mentoring program. Implementing successful coaching and mentoring programs (2001), 107--122.",
      "doi": ""
    },
    {
      "text": "Erik H Trainer, Arun Kalyanasundaram, and James D Herbsleb. 2017. E-mentoring for software engineering: a socio-technical perspective. In Software Engineering: Software Engineering Education and Training Track (ICSE-SEET), 2017 IEEE/ACM 39th International Conference on. IEEE, 107--116.  ",
      "doi": "10.1109/ICSE-SEET.2017.19"
    },
    {
      "text": "Gang Wang, Konark Gill, Manish Mohanlal, Haitao Zheng, and Ben Y Zhao. 2013. Wisdom in the social crowd: an analysis of quora. In Proceedings of the 22nd international conference on World Wide Web. ACM, 1341--1352.  ",
      "doi": "10.1145/2488388.2488506"
    },
    {
      "text": "Yi-Chia Wang, Robert E Kraut, and John M Levine. 2015. Eliciting and receiving online support: using computer-aided content analysis to examine the dynamics of online social support. Journal of medical Internet research 17, 4 (2015).",
      "doi": ""
    },
    {
      "text": "Earnest Wheeler and Tawanna R Dillahunt. 2018. Navigating the job search as a low-resourced job seeker. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 48.  ",
      "doi": "10.1145/3173574.3173622"
    }
  ]
}