{
  "doi": "10.1145/3290605.3300490",
  "title": "Digital Financial Needs of Micro-entrepreneur Women in Pakistan: Is Mobile Money The Answer?",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "This paper studies the use of Digital Financial Services (DFS) as a solution to women's financial inclusion in deeply patriarchal, resource constrained communities. Through a qualitative, empirical study we map the financial life cycles of 20 women micro-entrepreneurs in different cities in Pakistan and the challenges they face. We explore how technology is currently influencing these women's businesses and personal lives and reveal how mobile money is not tuned to the problems they face and their financial needs. We present alternate design directions for meeting the technological and financial needs of these women, circumnavigating the patriarchal structures that constrain them.",
  "authors": [
    {
      "name": "Maryam Mustafa",
      "institution": "Information Technology University, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460645278",
      "orcid": "missing"
    },
    {
      "name": "Noor Mazhar",
      "institution": "Information Technology University, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366787",
      "orcid": "missing"
    },
    {
      "name": "Ayesha Asghar",
      "institution": "Information Technology University Lahore, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659092783",
      "orcid": "missing"
    },
    {
      "name": "Maryem Zafar Usmani",
      "institution": "Information Technology University, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365642",
      "orcid": "missing"
    },
    {
      "name": "Lubna Razaq",
      "institution": "Information Technology University, Lahore, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659224033",
      "orcid": "missing"
    },
    {
      "name": "Richard Anderson",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371591530",
      "orcid": "0000-0002-7283-7219"
    }
  ],
  "references": [
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Jay Chen, and Nicola Dell. 2017. Digital Privacy Challenges with Shared Mobile Phone Use in Bangladesh. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 17.  ",
      "doi": "10.1145/3134652"
    },
    {
      "text": "Jenny Aker, Rachid Boumnijel, Amanda McClelland, and Niall Tierney. 2013. How do electronic transfers compare? Evidence from a mobile money cash transfer experiment in Niger. Tufts University (2013).",
      "doi": ""
    },
    {
      "text": "Siwan Anderson. 2007. The economics of dowry and brideprice. Journal of Economic Perspectives 21, 4 (2007), 151--174.",
      "doi": ""
    },
    {
      "text": "A Aslam. 2013. Moving Towards Micro and Small Enterprise Lending Opportunities and Challenges. Pakistan Microfinance Network. Islamabad: Pakistan Microfinance Network (2013).",
      "doi": ""
    },
    {
      "text": "Jyotish Prakash Basu. 2013. Microfinance and Women Empowerment An Empirical Study with special reference to West Bengal. Technical Report.",
      "doi": ""
    },
    {
      "text": "Timothy Besley, Stephen Coate, and Glenn Loury. 1993. The economics of rotating savings and credit associations. The American Economic Review (1993), 792--810.",
      "doi": ""
    },
    {
      "text": "Joshua E Blumenstock, Michael Callen, Tarek Ghani, and Lucas Koepke. 2015. Promises and pitfalls of mobile money in Afghanistan: evidence from a randomized control trial. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. ACM, 15.  ",
      "doi": "10.1145/2737856.2738031"
    },
    {
      "text": "Deena M. Burjorjee and Yasmin Bin-Humam. 2018. New Insights on Women's Mobile Phone Ownership. Technical Report. http://www.cgap.org/publications/new-insights-women%E2% 80%99s-mobile-phone-ownership",
      "doi": ""
    },
    {
      "text": "Sumedha Chauhan. 2015. Acceptance of mobile money by poor citizens of India: Integrating trust into the technology acceptance model. info 17, 3 (2015), 58--68.",
      "doi": ""
    },
    {
      "text": "Asli Demirguc-Kunt, Leora Klapper, Dorothe Singer, Saniya Ansar, and Jake Hess. 2018. The Global Findex Database 2017: Measuring Financial Inclusion and the Fintech Revolution. The World Bank.",
      "doi": ""
    },
    {
      "text": "Easypaisa 2018. Easy Paisa Mobile Wallets. https://www.easypaisa. com.pk/consumer/mobile-account",
      "doi": ""
    },
    {
      "text": "David S Evans and Alexis Pirchio. 2014. An empirical examination of why mobile money schemes ignite in some developing countries but flounder in most. Review of Network Economics 13, 4 (2014), 397--451.",
      "doi": ""
    },
    {
      "text": "Pakistan Centre for Philanthropy. 2016. The State of Individual Philanthropy in Pakistan. Technical Report.",
      "doi": ""
    },
    {
      "text": "World Economic Forum. 2017. The Global Gender Gap Report 2017. Technical Report. https://www.weforum.org/reports/ the-global-gender-gap-report-2017",
      "doi": ""
    },
    {
      "text": "Anne Marie Goetz and Rina Sen Gupta. 1996. Who takes the credit? Gender, power, and control over loan use in rural credit programs in Bangladesh. World development 24, 1 (1996), 45--63.",
      "doi": ""
    },
    {
      "text": "Jack Goody and Stanley Jeyaraja Tambiah. 1973. Bridewealth and dowry. Number 7. CUP Archive.",
      "doi": ""
    },
    {
      "text": "Samia Ibtasam, Lubna Razaq, Haider W Anwar, Hamid Mehmood, Kushal Shah, Jennifer Webster, Neha Kumar, and Richard Anderson. 2018. Knowledge, Access, and Decision-Making: Women's Financial Inclusion In Pakistan. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, 22.  ",
      "doi": "10.1145/3209811.3209819"
    },
    {
      "text": "Financial Inclusion Insights. 2018. PAKISTAN WAVE 5 REPORT FIFTH ANNUAL FII TRACKER SURVEY. Technical Report. http://finclusion. org/uploads/file/pakistan-wave-5-quicksites_final.pdf",
      "doi": ""
    },
    {
      "text": "William Jack and Tavneet Suri. 2011. Mobile money: The economics of M-PESA. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Jeffrey James. 2011. Sharing mobile phones in developing countries: Implications for the digital divide. Technological Forecasting and Social Change 78, 4 (2011), 729--735.",
      "doi": ""
    },
    {
      "text": "Jeffrey James. 2016. Mobile phone use in Africa: Implications for inequality and the digital divide. In The Impact of Mobile Phones on Poverty and Inequality in Developing Countries. Springer, 89--93.",
      "doi": ""
    },
    {
      "text": "Jazzcash 2018. Jazz Cash Mobile Wallets. https://www.jazzcash.com. pk/mobile-account/",
      "doi": ""
    },
    {
      "text": "Shireen J Jejeebhoy and Zeba A Sathar. 2001. Women's autonomy in India and Pakistan: the influence of religion and region. Population and development review 27, 4 (2001), 687--712.",
      "doi": ""
    },
    {
      "text": "Susan Johnson and Max Nino-Zarazua. 2011. Financial access and exclusion in Kenya and Uganda. The Journal of Development Studies 47, 3 (2011), 475--496.",
      "doi": ""
    },
    {
      "text": "KG Karmakar, GD Banerjee, and NP Mohapatra. 2011. Towards Financial Inclusion in India. SAGE Publications India.",
      "doi": ""
    },
    {
      "text": "Deepti Kumar, David Martin, and Jacki O'Neill. 2011. The times they are a-changin': mobile payments in india. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1413--1422.  ",
      "doi": "10.1145/1978942.1979150"
    },
    {
      "text": "Rajiv Lal and Ishan Sachdev. 2015. Mobile Money Services: Design and Development for Financial Inclusion. Citeseer.",
      "doi": ""
    },
    {
      "text": "Kate Lauer and Timothy Lyman. 2015. Digital financial inclusion: Implications for customers, regulators, supervisors, and standard-setting bodies. Note. Washington, DC: CGAP, février (2015).",
      "doi": ""
    },
    {
      "text": "Scott Mainwaring, Wendy March, and Bill Maurer. 2008. From meiwaku to tokushita!: lessons for digital money design from japan. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 21--24.  ",
      "doi": "10.1145/1357054.1357058"
    },
    {
      "text": "Indrani Medhi, Aishwarya Ratan, and Kentaro Toyama. 2009. Mobilebanking adoption and usage by low-literate, low-income users in the developing world. In International conference on internationalization, design and global development. Springer, 485--494.  ",
      "doi": "10.1007/978-3-642-02767-3_54"
    },
    {
      "text": "Apurv Mehra, Sambhav Satija, and Jacki O'Neill. 2017. Prayana: A Journey Towards Financial Inclusion. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development. ACM, 26.  ",
      "doi": "10.1145/3136560.3136591"
    },
    {
      "text": "Werner F Menski. 1998. South Asians and the dowry problem. (1998).",
      "doi": ""
    },
    {
      "text": "Valentine M Moghadam. 1992. Patriarchy and the politics of gender in modernising societies: Iran, Pakistan and Afghanistan. International Sociology 7, 1 (1992), 35--53.",
      "doi": ""
    },
    {
      "text": "Jacki O'Neill, Srihari Hulikal Muralidhar, Apurv Mehra, Anupama Dhareshwar, and Sambhav Satija. 2018. Prayana: Intermediated Financial Management in Resource-Constrained Settings. In Acm Chi Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/3173574.3173963"
    },
    {
      "text": "Joyojeet Pal, Priyank Chandra, Vaishnav Kameswaran, Aakanksha Parameshwar, Sneha Joshi, and Aditya Johri. 2018. Digital Payment and Its Discontents: Street Shops and the Indian Government's Push for Cashless Transactions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 229.  ",
      "doi": "10.1145/3173574.3173803"
    },
    {
      "text": "Aminur Rahman. 1999. Micro-credit initiatives for equitable and sustainable development: Who pays? World development 27, 1 (1999), 67--82.",
      "doi": ""
    },
    {
      "text": "Hasaan Anwar Raza. 2017. TECHNOLOGIES FOR DIGITAL FINANCIAL SERVICES. Technical Report. Karandaaz.",
      "doi": ""
    },
    {
      "text": "Stephen C Rea and Taylor C Nelms. 2017. Mobile Money: The First Decade. Technical Report. Working Paper 2017/1, Institute for Money, Technology and Financial Inclusion, University of California.",
      "doi": ""
    },
    {
      "text": "Sumaira Rehman and Muhammad Azam Roomi. 2012. Gender and work-life balance: a phenomenological study of women entrepreneurs in Pakistan. Journal of Small Business and Enterprise Development 19, 2 (2012), 209--228.",
      "doi": ""
    },
    {
      "text": "Muhammad Azam Roomi and Guy Parrott. 2008. Barriers to development and progression of women entrepreneurs in Pakistan. The Journal of Entrepreneurship 17, 1 (2008), 59--72.",
      "doi": ""
    },
    {
      "text": "Saaricom. 2017. SAFARICOM ANNUAL REPORT AND FINANCIAL STATEMENTS 2017. Technical Report. https: //www.marketscreener.com/SAFARICOM-LIMITED-6500172/ pdf/754987/Safaricom%20Limited_Annual-Report.pdf",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchill. 2018. \"Privacy is not for me, it's for those rich women\": Performative Privacy Practices on Mobile Phones by Women in South Asia. In Fourteenth Symposium on Usable Privacy and Security ({SOUPS} 2018). ",
      "doi": "10.5555/3291228.3291240"
    },
    {
      "text": "Muhammad Ali Shazia M. Amjad. 2018. Philanthropy in Pakistan. Stanford Social Innovation Review (2018). https://ssir.org/articles/ entry/philanthropy_in_pakistan",
      "doi": ""
    },
    {
      "text": "Md Nur Alam Siddik, Gang Sun, CUI Yanjuan, and Sajal Kabiraj. 2014. Financial Inclusion through Mobile Banking: A Case of Bangladesh. Journal of Applied Finance and Banking 4, 6 (2014), 109.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design Within a Patriarchal Society: Opportunities and Challenges in Designing for Rural Women in Bangladesh. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 536.  ",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Rebecca M Vonderlack and Mark Schreiner. 2002. Women, microfinance, and savings: Lessons and proposals. Development in Practice 12, 5 (2002), 602--612.",
      "doi": ""
    },
    {
      "text": "Viviana A Rotman Zelizer. 1997. The social meaning of money. Princeton University Press.",
      "doi": ""
    }
  ]
}