{
  "doi": "10.1145/3290605.3300510",
  "title": "Engaging Gentrification as a Social Justice Issue in HCI",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2019,
  "badges": [],
  "abstract": "Gentrification-the spatial expression of economic inequality-is fundamentally a matter of social justice. Yet, even as work outside of HCI has begun to discuss how computing can enable or challenge gentrification, HCI's growing social justice agenda has not engaged with this issue. This omission creates an opportunity for HCI to develop a research and design agenda at the intersection of computing, social justice, and gentrification. We begin this work by outlining existing scholarship describing how the consumption side dynamics of gentrification are mediated by contemporary socio-technical systems. Subsequently, we build on the social justice framework introduced by Dombrowski, Harmon, and Fox to discuss how HCI may resist or counter such forces. We offer six modes of research that HCI scholars can pursue to engage gentrification.",
  "authors": [
    {
      "name": "Eric Corbett",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068033",
      "orcid": "missing"
    },
    {
      "name": "Yanni Loukissas",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597675",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A BeltLine for All? -- Yanni Alexander Loukissas: 2018. http://loukissas.lmc.gatech.edu/uncategorized/a-beltline-for-all/. Accessed: 2019-01-04.",
      "doi": ""
    },
    {
      "text": "A Glorified Sidewalk, and the Path to Transform Atlanta - The New York Times: https://www.nytimes.com/2016/09/12/us/atlantabeltline.html. Accessed: 2019-01-05.",
      "doi": ""
    },
    {
      "text": "About | Counter Map Collection: http://countermapcollection.org/about/. Accessed: 2018-08--30.",
      "doi": ""
    },
    {
      "text": "Ames, M.G. et al. 2011. Understanding technology choices and values through social class. Proceedings of the ACM 2011 conference on Computer supported cooperative work - CSCW '11 (New York, New York, USA, 2011), 55.  ",
      "doi": "10.1145/1958824.1958834"
    },
    {
      "text": "Asad, M. and Le Dantec, C. a. 2015. Illegitimate civic participation: supporting community activists on the ground. Cscw 2015. (2015), 1694--1703.  ",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Asad, M. and Le Dantec, C.A. 2015. Illegitimate Civic Participation: Supporting Community Activists on the Ground. CSCW '15: Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (New York, New York, USA, Feb. 2015), 1694--1703.  ",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Atkinson, R. 2002. Does gentrification help or harm urban neighbourhoods: An assessment of the evidence-base in the context of the new urban agenda (CNR paper 5). ESRC Centre for Neighbourhood Research. June (2002), 27.",
      "doi": ""
    },
    {
      "text": "Atkinson, R. 2000. Measuring gentrification and displacement in Greater London. Urban studies. 37, 1 (2000), 149--165.",
      "doi": ""
    },
    {
      "text": "Atlanta Beltline CEO Paul Morris steps down from post: https://www.ajc.com/news/local-govt--politics/beltline-ceo-stepsdown-new-head-focus-affordablehousing/RoWS3022b1qYl8eWAoBa6M/. Accessed: 2019-01-04.",
      "doi": ""
    },
    {
      "text": "Atlanta Beltline fails to deliver on promise for affordable housing: https://www.ajc.com/news/local/how-the-atlanta-beltline-broke-itspromise-affordable-housing/0VXnu1BlYC0IbA9U4u2CEM/. Accessed: 2019-01-04.",
      "doi": ""
    },
    {
      "text": "Atlanta Map Room | Digital Integrative Liberal Arts Center: https://dilac.iac.gatech.edu/node/55. Accessed: 2018-09-07.",
      "doi": ""
    },
    {
      "text": "Bardzell and Shaowen 2010. Feminist HCI: taking stock and outlining an agenda for design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. (2010), 1301-- 1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Beauregard, R.A. 2013. The chaos and complexity of gentrification. Gentrification of the City. Routledge. 51--71.",
      "doi": ""
    },
    {
      "text": "BeltLining: Gentrification, Broken Promises, and Hope on Atlanta's Southside: 2017. https://www.housingjusticeleague.org/b4all-report/. Accessed: 2019-01-04.",
      "doi": ""
    },
    {
      "text": "Bolter, J.D. et al. 2000. Remediation: Understanding new media. mit Press. ",
      "doi": "10.5555/298574"
    },
    {
      "text": "Bonam, C.M. et al. 2016. Polluting Black Space. Journal of experimental psychology. General. 145, 11 (2016), 1561--1582.",
      "doi": ""
    },
    {
      "text": "Brown-Saracino, J. 2013. The gentrification debates: a reader. Routledge.",
      "doi": ""
    },
    {
      "text": "Byrne, J. 2003. Two Cheers for Gentrification. Georgetown Law Faculty Publications and Other Works. (Jan. 2003).",
      "doi": ""
    },
    {
      "text": "Castells, M. 1996. The Rise of the Network Society. The Information Age: Economy, Society, and Culture Volume I (Information Age Series). London: Blackwell. ",
      "doi": "10.5555/524598"
    },
    {
      "text": "Certeau, M. de 1984. The practice of everyday life. Berkeley. CA: University of California Press.",
      "doi": ""
    },
    {
      "text": "Clarke, R. et al. 2013. Digital portraits: Photo-sharing after domestic violence. Proc. CHI '13. (2013), 2517--2526.  ",
      "doi": "10.1145/2470654.2481348"
    },
    {
      "text": "Community Historians & Westside Soul | Christopher A. Le Dantec: https://ledantec.net/research/community-historianswestside-soul/. Accessed: 2018-09-07.",
      "doi": ""
    },
    {
      "text": "Cresswell, T. 2004. Place: A Short Introduction. The Professional Geographer. 58, February (2004), 153.",
      "doi": ""
    },
    {
      "text": "Crivellaro, C. et al. 2015. Contesting the city: enacting the pollitical through digitally supported urban walks. CHI '15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. (2015), 2853--2862.  ",
      "doi": "10.1145/2702123.2702176"
    },
    {
      "text": "Crivellaro, C. et al. 2016. Re-Making Places: HCI,'Community Building'and Change. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 2958--2969.  ",
      "doi": "10.1145/2858036.2858332"
    },
    {
      "text": "Le Dantec, C.A. et al. 2011. Publics in practice: Ubiquitous computing at a shelter for homeless mothers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2011), 1687--1696.  ",
      "doi": "10.1145/1978942.1979189"
    },
    {
      "text": "Delaney, D. 2002. The space that race makes. The professional geographer. 54, 1 (2002), 6--14.",
      "doi": ""
    },
    {
      "text": "Dewey, J. and Rogers, M.L. 2012. The public and its problems: An essay in political inquiry. Penn State Press.",
      "doi": ""
    },
    {
      "text": "Diedrick, K. and Dantec, C.A. Le 2017. Atlanta's Westside residents challenge the rules of sport mega-development. Third World Thematics: A TWQ Journal. 2, 1 (2017), 54--68.",
      "doi": ""
    },
    {
      "text": "DILLAHUNT, T. 2017. Everyday Resilience: Supporting Resilient Strategies among Low-socioeconomic-status Communities DHAVAL VYAS, Queensland University of Technology (QUT). (2017).",
      "doi": ""
    },
    {
      "text": "Dillahunt, T.R. 2014. Fostering Social Capital in Economically Distressed Communities. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2014), 531--540.  ",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Dillahunt, T.R. et al. 2017. Reflections on Design Methods for Underserved Communities. Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17 Companion (New York, New York, USA, 2017), 409--413.  ",
      "doi": "10.1145/3022198.3022664"
    },
    {
      "text": "Dillahunt, T.R. and Malone, A.R. 2015. The Promise of the Sharing Economy among Disadvantaged Communities. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15. (2015), 2285--2294.  ",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Dombrowski, L. et al. 2016. Social Justice-Oriented Interaction Design. Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16. (2016), 656--671.  ",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Dourish, P. 2010. HCI and environmental sustainability: the politics of design and the design of politics. Proceedings of the 8th ACM Conference on Designing Interactive Systems. ACM. (2010), 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Dourish, P. 2006. Re-Space-ing Place: \"Place\" and \"Space\" Ten Years On. Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work - CSCW '06. (2006), 299.  ",
      "doi": "10.1145/1180875.1180921"
    },
    {
      "text": "Erete, S. and Burrell, J.O. 2017. Empowered Participation: How Citizens Use Technology in Local Governance. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. (2017), 2307--2319.  ",
      "doi": "10.1145/3025453.3025996"
    },
    {
      "text": "Foucault, M. 1972. The discourse on language. Truth: Engagements across philosophical traditions. (1972), 315--335.",
      "doi": ""
    },
    {
      "text": "Fox, S. et al. 2016. Exploring Social Justice, Design, and HCI. Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16 (New York, New York, USA, 2016), 3293--3300.  ",
      "doi": "10.1145/2851581.2856465"
    },
    {
      "text": "Fox, S. 2015. Feminist Hackerspaces as Sites for Feminist Design. C&C '15. Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition. (2015), 341--342.  ",
      "doi": "10.1145/2757226.2764771"
    },
    {
      "text": "Fox, S. and Le Dantec, C. 2014. Community historians: scaffolding community engagement through culture and heritage. Proceedings of the 2014 conference on Designing interactive systems (2014), 785-- 794.  ",
      "doi": "10.1145/2598510.2598563"
    },
    {
      "text": "Gates, H.L. et al. 1999. The souls of Black folk. By WEB Du Bois. New York: VV VV Norton. (1999).",
      "doi": ""
    },
    {
      "text": "Gay, G. 2009. Context-Aware Mobile Computing: Affordances of Space, Social Awareness, and Social Influence. ",
      "doi": "10.5555/1854998"
    },
    {
      "text": "Gieryn, T.F. 2000. A Space for Place in Sociology. Annual Review of Sociology. 26, 1 (2000), 463--496.",
      "doi": ""
    },
    {
      "text": "Glass, R.L. 1964. London: aspects of change. MacGibbon & Kee.",
      "doi": ""
    },
    {
      "text": "Goodie Nation | A Tribe of Changemakers & Entrepreneurs Using Innovation to Help Under-Served Communities: http://goodienation.org/. Accessed: 2017-01-07.",
      "doi": ""
    },
    {
      "text": "Gravel, R.A. 1999. Belt line-Atlanta: design of infrastructure as a reflection of public policy. Georgia Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Hanan, J.S. 2010. Home is Where the Capital is: The Culture of Real Estate in an Era of Control Societies. Communication and Critical/Cultural Studies. 7, 2 (2010), 176--201.",
      "doi": ""
    },
    {
      "text": "Haraway, D.J. 1988. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. Feminist Studies. 14, 3 (1988), 575--599.",
      "doi": ""
    },
    {
      "text": "Harrison, S. and Dourish, P. 1996. Re-place-ing space: the roles of place and space in collaborative systems. Proceedings of the 1996 ACM conference on Computer supported cooperative work (1996), 67--76.  ",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Hayes, G.R. 2011. The relationship of action research to humancomputer interaction. ACM Transactions on Computer-Human Interaction. 18, 3 (2011), 1--20.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Housing Justice League: https://www.housingjusticeleague.org/. Accessed: 2018-08--30.",
      "doi": ""
    },
    {
      "text": "Hutton, T.A. 2004. The new economy of the inner city. Cities. 21, 2 (2004), 89--108.",
      "doi": ""
    },
    {
      "text": "Ignazio, C.D. and Klein, L.F. 2016. Feminist Data Visualization. IEEE Vis conference. (2016).",
      "doi": ""
    },
    {
      "text": "Imbroscio, D. 2004. Can We Grant a Right to Place? Politics & Society. 32, 4 (2004), 575--609.",
      "doi": ""
    },
    {
      "text": "Immergluck, D. 2009. Large redevelopment initiatives, housing values and gentrification: the case of the Atlanta Beltline. Urban Studies. 46, 8 (2009), 1723--1745.",
      "doi": ""
    },
    {
      "text": "Immergluck, D. and Tech, G. 2016. Affordability First: Concerns about Preserving Housing Options for Existing and New Residents on Atlanta's Westside. (2016), 1--5.",
      "doi": ""
    },
    {
      "text": "Irani, L. et al. 2010. Postcolonial computing: a lens on design and development. Proceedings of the SIGCHI conference on human factors in computing systems (2010), 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Irani, L.C. and Silberman, M.S. 2013. Turkopticon. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13. (2013), 611.  ",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Jackson, S.J. et al. 2014. The policy knot. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW '14 (2014).  ",
      "doi": "10.1145/2531602.2531674"
    },
    {
      "text": "Jenkins, T. et al. 2016. Object-Oriented Publics. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (2016), 827--839.  ",
      "doi": "10.1145/2858036.2858565"
    },
    {
      "text": "Jönsson, L. et al. 2010. Watt-Lite. Proceedings of the 8th ACM Conference on Designing Interactive Systems - DIS '10 (New York, New York, USA, 2010), 240.",
      "doi": ""
    },
    {
      "text": "Keating, L. 2010. Atlanta: Race, class and urban expansion. Temple University Press.",
      "doi": ""
    },
    {
      "text": "Kirkland, E. 2008. What's Race Got to Do With it? Looking for the Racial Dimensions of Gentrification. Western Journal of Black Studies. 32, 2 (2008).",
      "doi": ""
    },
    {
      "text": "Korn, M. and Back, J. 2012. Talking it further: from feelings and memories to civic discussions in and about places. Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design. (2012), 189--198.  ",
      "doi": "10.1145/2399016.2399046"
    },
    {
      "text": "Kruse, K.M. 2013. White flight: Atlanta and the making of modern conservatism. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Kurgan, L. 2013. Close Up At a Distance.",
      "doi": ""
    },
    {
      "text": "Lees, L. et al. 2013. Gentrification. Routledge.",
      "doi": ""
    },
    {
      "text": "Lees, L. 2003. Super-gentrification: The case of Brooklyn heights, New York city. Urban studies. 40, 12 (2003), 2487--2509.",
      "doi": ""
    },
    {
      "text": "Lees, L. et al. 2010. The gentrification reader. Routledge London.",
      "doi": ""
    },
    {
      "text": "Loukissas, Y. 2018. All the Homes: Zillow and the Operational Context of Data. International Conference on Information (2018), 272--281.",
      "doi": ""
    },
    {
      "text": "Loukissas, Y.A. 2017. Taking Big Data apart: local readings of composite media collections. Information, Communication & Society. 20, 5 (2017), 651--664.",
      "doi": ""
    },
    {
      "text": "Lury, C. and Wakeford, N. 2012. Inventive methods: The happening of the social. Routledge.",
      "doi": ""
    },
    {
      "text": "Maharawal, M.M. and McElroy, E. 2018. The Anti-Eviction Mapping Project: Counter Mapping and Oral History toward Bay Area Housing Justice. Annals of the American Association of Geographers. 108, 2 (Mar. 2018), 380--389.",
      "doi": ""
    },
    {
      "text": "Marcuse, P. 1984. To control gentrification: anti-displacement zoning and planning for stable residential districts. NYU Rev. L. & Soc. Change. 13, (1984), 931.",
      "doi": ""
    },
    {
      "text": "Masden, C.A. et al. 2014. Tensions in scaling-up community social media: a multi-neighborhood study of nextdoor. Proceedings of the 32nd annual ACM conference on Human factors in computing systems (2014), 3239--3248.  ",
      "doi": "10.1145/2556288.2557319"
    },
    {
      "text": "Massey, D.S. and Denton, N.A. 1993. American apartheid: Segregation and the making of the underclass. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "McNeill, D. 2016. Governing a city of unicorns: technology capital and the urban politics of San Francisco. Urban geography. 37, 4 (2016), 494--513.",
      "doi": ""
    },
    {
      "text": "Newman, K. and Wyly, E.K. 2006. The right to stay put, revisited: gentrification and resistance to displacement in New York City. Urban Studies. 43, 1 (2006), 23--57.",
      "doi": ""
    },
    {
      "text": "Noble, S.U. 2018. Algorithms of Oppression: How search engines reinforce racism. NYU Press.",
      "doi": ""
    },
    {
      "text": "O'Mara, M. 2017. Silicon Dreams: States, Markets, and the Transnational High-Tech Suburb. Making Cities Global: The Transnational Turn in Urban History. University of Pennsylvania Press. 17--47.",
      "doi": ""
    },
    {
      "text": "O'Mara, M. 2014. The environmental contradictions of high-tech urbanism. Now Urbanism. Routledge. 40--56.",
      "doi": ""
    },
    {
      "text": "Oliver, M. and Shapiro, T. 2013. Black wealth/white wealth: A new perspective on racial inequality. Routledge.",
      "doi": ""
    },
    {
      "text": "Parker, A. et al. 2012. Health promotion as activism. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12 (New York, New York, USA, 2012), 99.  ",
      "doi": "10.1145/2207676.2207692"
    },
    {
      "text": "Payne, W. 2017. Welcome to the Polygon?: Contested Digital Neighborhoods and Spatialized Segregation on Nextdoor. Computational Culture. (2017).",
      "doi": ""
    },
    {
      "text": "Rascoff, S. and Humphries, and S. 2015. Zillow Talk: Rewriting the Rules of Real Estate. Grand Central Publishing.",
      "doi": ""
    },
    {
      "text": "Rundstrom, R. 2009. Counter-Mapping. International Encyclopedia of Human Geography. Elsevier. 314--318.",
      "doi": ""
    },
    {
      "text": "Sandvig, C. et al. Can an Algorithm be Unethical?",
      "doi": ""
    },
    {
      "text": "Slater, T. 2006. The Eviction of Criticial Perspectives from Gentrification Research. International Journal of Urban and Regional Research. 30, 4 (2006), 737--757.",
      "doi": ""
    },
    {
      "text": "Smith, N. 1987. Gentrification and the rent gap. Annals of the Association of American geographers. 77, 3 (1987), 462--465.",
      "doi": ""
    },
    {
      "text": "Smith, N. and Williams, P. 2013. Gentrification of the City. Routledge.",
      "doi": ""
    },
    {
      "text": "St. Louis MapRoom: http://stlmaproom.org/. Accessed: 2018-09-07.",
      "doi": ""
    },
    {
      "text": "Taylor, N. et al. 2013. Leaving the wild: lessons from community technology handovers. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2013), 1549--1558.  ",
      "doi": "10.1145/2470654.2466206"
    },
    {
      "text": "Using Mapping to Understand Gentrification, Prevent Displacement: 2017. http://www.govtech.com/data/Using-Mappingto-Understand-Gentrification-Prevent-Displacement.html?r. Accessed: 2018-08--28.",
      "doi": ""
    },
    {
      "text": "Wachsmuth, D. and Weisler, A. 2018. Airbnb and the Rent Gap: Gentrification Through the Sharing Economy. Environment and Planning A: Economy and Space. (2018).",
      "doi": ""
    },
    {
      "text": "Woodward, C.V. 2002. The strange career of Jim Crow. Oxford University Press, USA.",
      "doi": ""
    },
    {
      "text": "Zukin, S. 1993. Landscapes of power: from Detroit to Disney World. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Zukin, S. 1989. Loft living: culture and capital in urban change. Rutgers University Press.",
      "doi": ""
    },
    {
      "text": "Zukin, S. et al. 2015. The omnivore's neighborhood? Online restaurant reviews, race, and gentrification. Journal of Consumer Culture. (2015), 1--21.",
      "doi": ""
    }
  ]
}