{
  "doi": "10.1145/3290605.3300315",
  "title": "Towards an Effective Digital Literacy Intervention to Assist Returning Citizens with Job Search",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Returning citizens (formerly incarcerated individuals) face great challenges finding employment, and these are exacerbated by the need for digital literacy in modern job search. Through 23 semi-structured interviews and a pilot digital literacy course with returning citizens in the Greater Detroit area, we explore tactics and needs with respect to job search and digital technology. Returning citizens exhibit great diversity, but overall, we find our participants to have striking gaps in digital literacy upon release, even as they are quickly introduced to smartphones by friends and family. They tend to have employable skills and ability to use offline social networks to find opportunities, but have little understanding of formal job search processes, online or offline. They mostly mirror mainstream use of mobile technology, but they have various reasons to avoid social media. These and other findings lead to recommendations for digital literacy programs for returning citizens.",
  "authors": [
    {
      "name": "Ihudiya Finda Ogbonnaya-Ogburu",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-99659022329/rel-imgonly/ihudiya_finda.png",
      "acmid": "99659022329",
      "orcid": "missing"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    },
    {
      "name": "Tawanna R. Dillahunt",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606961",
      "orcid": "0000-0002-1155-8507"
    }
  ],
  "references": [
    {
      "text": "American Library Association. {n. d.}. Digital Literacy Defnition | ALA Connect. http://connect.ala.org/node/181197",
      "doi": ""
    },
    {
      "text": "Doreen Anderson-Facile. 2009. Basic Challenges to Prisoner Reentry. Sociology Compass 3, 2 (2009), 183--195.",
      "doi": ""
    },
    {
      "text": "Demelza Baer, Avinash Bhati, Lisa Brooks, Jennifer Castro, Nancy La Vigne, Kamala Mallik, Rebecca Naser, Jenny Osborne, John Roman, Shelli Rossman, Christy Visher, and Laura Winterfeld. 2006. Understanding the Challenges of Prisoner Reentry: Research Findings from the Urban Institute's Prisoner Reentry Portfolio. Reentry Research Findings (2006). https://www.ncjrs.gov/App/abstractdb/AbstractDBDetails. aspx?id=235103",
      "doi": ""
    },
    {
      "text": "Matthew J. Bauman, Robert Sullivan, Chris Schneweis, Rayid Ghani, Kate S. Boxer, Tzu-Yun Lin, Erika Salomon, Hareem Naveed, Lauren Haynes, Joe Walsh, Jen Helsby, and Steve Yoder. 2018. Reducing Incarceration through Prioritized Interventions. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies (COMPASS) - COMPASS '18, Vol. 1953. ACM Press, New York, New York, USA, 1--8.  ",
      "doi": "10.1145/3209811.3209869"
    },
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the implication is not to design (technology). Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11 (2011), 2271.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Mark T. Berg and Beth M. Huebner. 2011. Reentry and the ties that bind: An examination of social ties, employment, and recidivism. Justice Quarterly 28, 2 (2011), 382--410.",
      "doi": ""
    },
    {
      "text": "E Ann Carson. 2016. Prisoners in 2016 Summary. Bureau of Justice Statistics Bulletin (2016), 1--34. www.bjs.gov.",
      "doi": ""
    },
    {
      "text": "Jennifer E. Cobbina. 2010. Reintegration success and failure: Factors impacting reintegration among incarcerated and formerly incarcerated women. Journal of Ofender Rehabilitation 49, 3 (2010), 210--232.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt. 2014. Fostering Social Capital in Economically Distressed Communities. CHI 2014. Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems (2014), 531-- 540.  ",
      "doi": "10.1145/2556288.2557123"
    },
    {
      "text": "Tawanna R Dillahunt, Nishan Bose, Suleman Diwan, and Asha ChenPhang. 2016. Designing for Disadvantaged Job Seekers: Insights from Early Investigations. Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16 (2016), 905--910.  ",
      "doi": "10.1145/2901790.2901865"
    },
    {
      "text": "Tawanna R. Dillahunt, Jason Lam, Alex Lu, and Earnest Wheeler. 2018. Designing Future Employment Applications for Underserved Job Seekers: A Speed Dating Study. The 2018 ACM Conference on Designing Interactive Systems (DIS '18) (2018).  ",
      "doi": "10.1145/3196709.3196770"
    },
    {
      "text": "Daniel C. Feldman and Brian S. Klaas. 2002. Internet job hunting: A feld study of applicant experiences with on-line recruiting. Human Resource Management 41, 2 (2002), 175--192.",
      "doi": ""
    },
    {
      "text": "Richard Freeman. 2003. Can we close the revolving door?: Recidivism vs. employment of ex-ofenders in the US. Prisoner Reentry Roundtable, New York University. (2003), 1--19.",
      "doi": ""
    },
    {
      "text": "Laura E. Gorgol and Brian A. Sponsler. 2011. Unlocking potential: Results of a national survey of postsecondary education in state prisons. May (2011), 1--28. http://www.ihep.org/assets/fles/publications/s-z/ Unlocking_Potential-PSCE_FINAL_REPORT_May_2011.pdf",
      "doi": ""
    },
    {
      "text": "Mark S. Granovetter. 1973. The Strength of Weak Ties. Amer. J. Sociology 78, 6 (5 1973), 1360--1380.",
      "doi": ""
    },
    {
      "text": "David J Harding, Jessica B Wyse, Cheyney Dobson, and Jefrey D Morenof. 2013. Making Ends Meet After Prison. Journal of Policy Analysis and Management 32, 2 (2013), 296--322.",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes. 2011. The relationship of action research to humancomputer interaction. ACM Transactions on Computer-Human Interaction 18, 3 (2011), 1--20.  ",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "Gillian R Hayes, V Erick Custodio, Oliver L Haimson, Kathy Nguyen, Kathryn E Ringland, Rachel Rose Ulgado, Aaron Waterhouse, and Rachel Weiner. 2015. Mobile video modeling for employment interviews for individuals with autism. Journal of Vocational Rehabilitation 43, 3 (2015), 275--287.",
      "doi": ""
    },
    {
      "text": "Ellen Johanna Helsper. 2012. A Corresponding Fields Model for the Links Between Social and Digital Exclusion. Communication Theory 22, 4 (2012), 403--426.",
      "doi": ""
    },
    {
      "text": "David G. Hendry, Norah Abokhodair, Rose Paquet Kinsley, and Jill Palzkill Woelfer. 2017. Homeless Young People, Jobs, and a Future Vision: Community Members' Perceptions of the Job Co-op. Proceedings of the 8th International Conference on Communities and Technologies - C&T '17 (2017), 22--31.  ",
      "doi": "10.1145/3083671.3083680"
    },
    {
      "text": "David G Hendry, Jill Palzkill Woelfer, and Thuy Duong. 2017. U-District Job Co-op: constructing a future vision for homeless young people and employment. Information Technology & People 30 (2017), 602--628.",
      "doi": ""
    },
    {
      "text": "H. J. Holzer, S. Raphael, and M. A. Stoll. 2003. Employment barriers facing ex-ofenders. Center for the Study of Urban Poverty Working Paper Series. (2003), 1--23. http://www.urban.org/uploadedPDF/410855_ holzer.pdf",
      "doi": ""
    },
    {
      "text": "Washington Irving. 1819. Rip Van Winkle. In The Sketch Book of Geofrey Crayon, Gent. New York, Chapter Rip Van Wi. https://www. sas.upenn.edu/~cavitch/pdf-library/Irving_RipVanWinkle.pdf",
      "doi": ""
    },
    {
      "text": "Yvonne Jewkes and Bianca C. Reisdorf. 2016. A brave new world: The problems and opportunities presented by new media technologies in prisons. Criminology and Criminal Justice 16, 5 (2016), 534--551.",
      "doi": ""
    },
    {
      "text": "Pamela K. Lattimore, Danielle M. Stefey, and Christy A. Visher. 2010. Prisoner reentry in the frst decade of the twenty-frst century. Victims and Ofenders 5, 3 (2010), 253--267.",
      "doi": ""
    },
    {
      "text": "Joan Petersilia. 2001. Prisoner Reentry: Public Safety and Reintegration Challenges. The Prison Journal 81, 3 (2001), 360--375.",
      "doi": ""
    },
    {
      "text": "Lincoln Quillian. 2005. What Employers Say Versus What They Do. American Sociological Review 70 (2005), 355--380.",
      "doi": ""
    },
    {
      "text": "Bianca C Reisdorf and R V Rikard. 2018. Digital Rehabilitation: A Model of Reentry Into the Digital Age. American Behavioral Scientist (2018), 000276421877381.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated technology use in developing communities. Proceedings of the 28th international conference on Human factors in computing systems - CHI '10 (2010), 2583.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Aaron Smith. 2015. Searching for work in the digital era. Pew Research Center (2015), 1--29. http://www.pewinternet.org/2015/11/19/ searching-for-work-in-the-digital-era/",
      "doi": ""
    },
    {
      "text": "Sandra Susan Smith. 2007. Lone pursuit: Distrust and defensive individualism among the black poor. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Amy L Solomon, Gillian L Thomson, and Sinead Keegan. 2004. Prisoner Reentry in Michigan. (2004). http://www.urban.org/UploadedPDF/ 411172_Prisoner_Reentry_MI.pdf",
      "doi": ""
    },
    {
      "text": "N. F. Sugie. 2016. Utilizing Smartphones to Study Disadvantaged and Hard-to-Reach Groups. Sociological Methods & Research (2016).",
      "doi": ""
    },
    {
      "text": "Naomi F. Sugie. 2018. Work as Foraging: A Smartphone Study of Job Search and Employment after Prison. Amer. J. Sociology 123, 5 (2018), 1453--1491.",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2015. Geek heresy: Rescuing social change from the cult of technology. PublicAfairs.",
      "doi": ""
    },
    {
      "text": "Sanne Verbaan, Clair Aldington, Roisin McNaney, and Jayne Wallace. 2018. Potentials of HCI for Prisons and Incarcerated Individuals. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, SIG17:1-- SIG17:4.  ",
      "doi": "10.1145/3170427.3185367"
    },
    {
      "text": "Christy Visher, Nancy La Vigne, and Jeremy Travis. 2004. Returning home: Understanding the Challenges of Prisoner Reentry. Urban Institute (2004).",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Yuting Liao, Mega Subramaniam, and Priya Kumar. 2018. \"I Knew It Was Too Good To Be True\": The Challenges Economically Disadvantaged Users Face in Assessing Trustworthiness, Avoiding Scams, and Developing Self-Efcacy Online. 2, November (2018).  ",
      "doi": "10.1145/3274445"
    },
    {
      "text": "E. Wheeler and T.R. Dillahunt. 2018. Navigating the job search as a low-resourced job seeker. Conference on Human Factors in Computing Systems - Proceedings 2018-April (2018), 1--10.  ",
      "doi": "10.1145/3173574.3173622"
    },
    {
      "text": "Kathryn Zickuhr and Mary Madden. 2012. Older adults and internet use. Pew Research Center (2012), 1--23.",
      "doi": ""
    }
  ]
}