{
  "doi": "10.1145/3290605.3300533",
  "title": "Social Media TestDrive: Real-World Social Media Education for the Next Generation",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "Social media sites are where life happens for many of today's young people, so it is important to teach them to use these sites safely and effectively. Many youth receive classroom education on digital literacy topics, but have few chances to build actual skills. Social Media TestDrive, an interactive social media simulation, fills a gap in digital literacy education by combining experiential learning in a realistic and safe social media environment with educator-facilitated classroom lessons. The tool was piloted with 12 educators and over 200 students, and formative evaluation data suggest that TestDrive achieved high levels of engagement with both groups. Students reported the modules enhanced their understanding of digital citizenship issues, and educators noted that students were engaging in meaningful classroom conversations. Finally, we discuss the importance of involving multiple stakeholder groups (e.g., researchers, youth, educators, curriculum developers) in designing educational technology.",
  "authors": [
    {
      "name": "Dominic DiFranzo",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655026",
      "orcid": "0000-0001-6039-1806"
    },
    {
      "name": "Yoon Hyung Choi",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658691384",
      "orcid": "missing"
    },
    {
      "name": "Amanda Purington",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163031",
      "orcid": "missing"
    },
    {
      "name": "Jessie G. Taft",
      "institution": "Cornell Tech, New York City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160568",
      "orcid": "missing"
    },
    {
      "name": "Janis Whitlock",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658691959",
      "orcid": "missing"
    },
    {
      "name": "Natalya N. Bazarova",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100246383",
      "orcid": "0000-0001-5375-6598"
    }
  ],
  "references": [
    {
      "text": "Monica Anderson and Jingjing Jiang. 2018. Teens, social media & technology 2018. Washington, DC: Pew Internet & American Life Project. Retrieved June 3 (2018), 2018.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1978. Social learning theory of aggression. Journal of communication 28, 3 (1978), 12--29.",
      "doi": ""
    },
    {
      "text": "David Bawden and others. 2008. Origins and concepts of digital literacy. Digital literacies: Concepts, policies and practices 30 (2008), 17--32.",
      "doi": ""
    },
    {
      "text": "Paul Best, Roger Manktelow, and Brian Taylor. 2014. Online communication, social media and adolescent wellbeing: A systematic narrative review. Children and Youth Services Review 41 (2014), 27--36.",
      "doi": ""
    },
    {
      "text": "danah boyd. 2014. It's complicated: The social lives of networked teens. Yale University Press. ",
      "doi": "10.5555/2584525"
    },
    {
      "text": "David Buckingham. 2007. Digital Media Literacies: Rethinking Media Education in the Age of the Internet. Research in Comparative and International Education 2, 1 (March 2007), 43--55.",
      "doi": ""
    },
    {
      "text": "Monica Bulger and Patrick Davison. 2018. The Promises, Challenges, and Futures of Media Literacy. Journal of Media Literacy Education (2018), 21.",
      "doi": ""
    },
    {
      "text": "Dominic DiFranzo, Samuel Hardman Taylor, Franccesca Kazerooni, Olivia D Wherry, and Natalya N Bazarova. 2018. Upstanding by design: Bystander intervention in cyberbullying. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 211.  ",
      "doi": "10.1145/3173574.3173785"
    },
    {
      "text": "Yoram Eshet. 2004. Digital literacy: A conceptual framework for survival skills in the digital era. Journal of educational multimedia and hypermedia 13, 1 (2004), 93--106.",
      "doi": ""
    },
    {
      "text": "Renee Hobbs. 2010. Digital and Media Literacy: A Plan of Action. A White Paper on the Digital and Media Literacy Recommendations of the Knight Commission on the Information Needs of Communities in a Democracy. ERIC.",
      "doi": ""
    },
    {
      "text": "Micah Jacobson and Mari Ruddy. 2004. Open To Outcome: A Practical Guide For Facilitating & Teaching Experiential Reflection. Wood N Barnes.",
      "doi": ""
    },
    {
      "text": "Carrie James, Katie Davis, Linda Charmaraman, Sara Konrath, Petr Slovak, Emily Weinstein, and Lana Yarosh. 2017. Digital life and youth well-being, social connectedness, empathy, and narcissism. Pediatrics 140, Supplement 2 (2017), S71--S75.",
      "doi": ""
    },
    {
      "text": "Se-Hoon Jeong, Hyunyi Cho, and Yoori Hwang. 2012. Media literacy interventions: A meta-analytic review. Journal of Communication 62, 3 (2012), 454--472.",
      "doi": ""
    },
    {
      "text": "Haiyan Jia, Pamela J. Wisniewski, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2015. Risk-taking as a Learning Process for Shaping Teen's Online Information Privacy Behaviors. ACM Press, 583--599.  ",
      "doi": "10.1145/2675133.2675287"
    },
    {
      "text": "Carolyn Kim and Karen Freberg. 2017. The state of social media curriculum: exploring professional expectations of pedagogy and practices to equip the next generation of professionals. Journal of Public Relations Education 2, 2 (2017).",
      "doi": ""
    },
    {
      "text": "David A. Kolb. 1984. Experiential Learning: Experience as the Source of Learning and Development (1 edition ed.). Prentice Hall, Englewood Cliffs, N.J.",
      "doi": ""
    },
    {
      "text": "Maria Koutamanis, Helen GM Vossen, and Patti M Valkenburg. 2015. Adolescents' comments in social media: Why do adolescents receive negative feedback and who is most at risk? Computers in Human Behavior 53 (2015), 486--494.  ",
      "doi": "10.1016/j.chb.2015.07.016"
    },
    {
      "text": "Sonia Livingstone. 2014. Developing social media literacy: How children learn to interpret risky opportunities on social network sites. Communications 39, 3 (2014), 283--303.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone and Ellen Helsper. 2010. Balancing opportunities and risks in teenagers' use of the internet: the role of online skills and internet self-efficacy. New Media & Society 12, 2 (March 2010), 309--329.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Kjartan Ólafsson, and Elisabeth Staksrud. 2013. Risky social networking practices among 'underage' users: Lessons for evidence-based policy. Journal of Computer-Mediated Communication 18, 3 (2013), 303--320.",
      "doi": ""
    },
    {
      "text": "J Nathan Matias and Merry Mou. 2018. CivilServant: Community-Led Experiments in Platform Governance. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 9.  ",
      "doi": "10.1145/3173574.3173583"
    },
    {
      "text": "Jakob Nielsen. 1993. Iterative user-interface design. Computer 11 (1993), 32--41.  ",
      "doi": "10.1109/2.241424"
    },
    {
      "text": "Karen Pittman. 1999. The Power of Engagement. (1999).",
      "doi": ""
    },
    {
      "text": "Mike S Ribble, Gerald D Bailey, and Tweed W Ross. 2004. Addressing Appropriate Technology Behavior. Learning & Leading with Technology 32, 1 (2004), 6--9.",
      "doi": ""
    },
    {
      "text": "Michael Scriven. 1996. Types of Evaluation and Types of Evaluator. Evaluation Practice (1996), 11.",
      "doi": ""
    },
    {
      "text": "Martin Tessmer. 2013. Planning and conducting formative evaluations. Routledge.",
      "doi": ""
    },
    {
      "text": "National Literacy Trust. 2018. Fake news and critical literacy: final report. (2018). http://literacytrust.org.uk/research-services/ research-reports/fake-news-and-critical-literacy-final-report/",
      "doi": ""
    },
    {
      "text": "Yalda T Uhls, Nicole B Ellison, and Kaveri Subrahmanyam. 2017. Benefits and costs of social media in adolescence. Pediatrics 140, Supplement 2 (2017), S67--S70.",
      "doi": ""
    },
    {
      "text": "Sam Wineburg, Sarah McGrew, Joel Breakstone, and Teresa Ortega. 2016. Evaluating information: The cornerstone of civic online reasoning. Stanford Digital Repository. Retrieved January 8 (2016), 2018.",
      "doi": ""
    },
    {
      "text": "Wenjing Xie and Cheeyoun Kang. 2015. See you, see me: Teenagers' self-disclosure and regret of posting on social network site. Computers in Human Behavior 52 (2015), 398--407.  ",
      "doi": "10.1016/j.chb.2015.05.059"
    }
  ]
}