{
  "doi": "10.1145/3290605.3300555",
  "title": "Scaptics and Highlight-Planes: Immersive Interaction Techniques for Finding Occluded Features in 3D Scatterplots",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Three-dimensional scatterplots suffer from well-known perception and usability problems. In particular, overplotting and occlusion, mainly due to density and noise, prevent users from properly perceiving the data. Thanks to accurate head and hand tracking, immersive Virtual Reality (VR) setups provide new ways to interact and navigate with 3D scatterplots. VR also supports additional sensory modalities such as haptic feedback. Inspired by methods commonly used in Scientific Visualisation to visually explore volumes, we propose two techniques that leverage the immersive aspects of VR: first, a density-based haptic vibration technique (Scaptics) which provides feedback through the controller; and second, an adaptation of a cutting plane for 3D scatterplots (Highlight-Plane). We evaluated both techniques in a controlled study with two tasks involving density (finding high- and low-density areas). Overall, Scaptics was the most time-efficient and accurate technique, however, in some conditions, it was outperformed by Highlight-Plane.",
  "tags": [
    "haptic",
    "3d scatterplot",
    "virtual reality",
    "vibrotactile feedback"
  ],
  "authors": [
    {
      "name": "Arnaud Prouzeau",
      "institution": "Monash University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658766854",
      "orcid": "0000-0003-3800-5870"
    },
    {
      "name": "Maxime Cordeil",
      "institution": "Monash University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488668405",
      "orcid": "0000-0002-9732-4874"
    },
    {
      "name": "Clement Robin",
      "institution": "Monash University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367192",
      "orcid": "missing"
    },
    {
      "name": "Barrett Ens",
      "institution": "Monash University, Melbourne, Victoria, Australia",
      "img": "/do/10.1145/contrib-81488672423/rel-imgonly/hci_holiday_lunch_2013_5.jpg",
      "acmid": "81488672423",
      "orcid": "0000-0001-6695-4809"
    },
    {
      "name": "Bruce H. Thomas",
      "institution": "University of South Australia, Mawson Lakes, South Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100411664",
      "orcid": "0000-0002-9148-085X"
    },
    {
      "name": "Tim Dwyer",
      "institution": "Monash University, Melbourne, Victoria, Australia",
      "img": "/do/10.1145/contrib-81100013275/rel-imgonly/tim-dwyer-2016-small.jpg",
      "acmid": "81100013275",
      "orcid": "0000-0002-9076-9571"
    }
  ],
  "references": [
    {
      "text": "B. Alper, T. Hollerer, J. Kuchera-Morin, and A. Forbes. 2011. Stereoscopic Highlighting: 2D Graph Visualization on Stereo Displays. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec 2011), 2325--2333. ",
      "doi": "10.5555/2068462.2068634"
    },
    {
      "text": "Mehdi Ammi and Brian FG Katz. 2014. Intermodal audio-haptic metaphor: improvement of target search in abstract environments. International Journal of Human-Computer Interaction 30, 11 (2014), 921--933.",
      "doi": ""
    },
    {
      "text": "O. Ariza, P. Lubos, F. Steinicke, and G. Bruder. 2015. Ring-shaped Haptic Device with Vibrotactile Feedback Patterns to Support Natural Spatial Interaction. In Proceedings of the 25th International Conference on Artificial Reality and Telexistence and 20th Eurographics Symposium on Virtual Environments (ICAT - EGVE '15). Eurographics Association, Aire-la-Ville, Switzerland, Switzerland, 175--181. ",
      "doi": "10.5555/2852313.2852337"
    },
    {
      "text": "American Psychological Association. 2009. Publication Manual of the American Psychological Association. American Psychological Association (APA).",
      "doi": ""
    },
    {
      "text": "Ricardo S. Avila and Lisa M. Sobierajski. 1996. A Haptic Interaction Method for Volume Visualization. In Proceedings of the 7th Conference on Visualization '96 (VIS '96). IEEE Computer Society Press, Los Alamitos, CA, USA, 197--204. ",
      "doi": "10.5555/244979.245054"
    },
    {
      "text": "B. Bach, P. Dragicevic, D. Archambault, C. Hurter, and S. Carpendale. 2014. A Review of Temporal Data Visualizations Based on Space-Time Cube Operations. In EuroVis - STARs, R. Borgo, R. Maciejewski, and I. Viola (Eds.). The Eurographics Association.",
      "doi": ""
    },
    {
      "text": "B. Bach, R. Sicat, J. Beyer, M. Cordeil, and H. Pfister. 2018. The Hologram in My Hand: How Effective is Interactive Exploration of 3D Visualizations in Immersive Tangible Augmented Reality? IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan 2018), 457-- 467.",
      "doi": ""
    },
    {
      "text": "Sven Bachthaler and Daniel Weiskopf. 2008. Continuous scatterplots. IEEE transactions on visualization and computer graphics 14, 6 (2008), 1428--1435.  ",
      "doi": "10.1109/TVCG.2008.119"
    },
    {
      "text": "Mohamed Benali-Khoudja, Moustapha Hafez, Jean-Marc Alexandre, and Abderrahmane Kheddar. 2004. Tactile interfaces: a state-of-the-art survey. In Int. Symposium on Robotics, Vol. 31. 23--26.",
      "doi": ""
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. Normaltouch and texturetouch: High-fidelity 3d haptic shape rendering on handheld virtual reality controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 717--728.  ",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Carlos Bermejo and Pan Hui. 2017. A survey on haptic technologies for mobile augmented reality. (2017).",
      "doi": ""
    },
    {
      "text": "Lonni Besançon, Mehdi Ammi, and Tobias Isenberg. 2017. PressureBased Gain Factor Control for Mobile 3D Interaction Using LocallyCoupled Devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1831--1842.  ",
      "doi": "10.1145/3025453.3025890"
    },
    {
      "text": "Lonni Besancon, Paul Issartel, Mehdi Ammi, and Tobias Isenberg. 2017. Hybrid Tactile/Tangible Interaction for 3D Data Exploration. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 881--890.  ",
      "doi": "10.1109/TVCG.2016.2599217"
    },
    {
      "text": "Tanja Blascheck, Lonni Besançon, Anastasia Bezerianos, Bongshin Lee, and Petra Isenberg. 2019. Glanceable Visualization: Studies of Data Comparison Performance on Smartwatches. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019).",
      "doi": "10.1109/TVCG.2018.2865142"
    },
    {
      "text": "S. Choi and K. J. Kuchenbecker. 2013. Vibrotactile Display: Perception, Technology, and Applications. Proc. IEEE 101, 9 (Sept 2013), 2093--2104.",
      "doi": ""
    },
    {
      "text": "D. Coffey, N. Malbraaten, T. B. Le, I. Borazjani, F. Sotiropoulos, A. G. Erdman, and D. F. Keefe. 2012. Interactive Slice WIM: Navigating and Interrogating Volume Data Sets Using a Multisurface, Multitouch VR Interface. IEEE Transactions on Visualization and Computer Graphics 18, 10 (Oct 2012), 1614--1626.  ",
      "doi": "10.1109/TVCG.2011.283"
    },
    {
      "text": "David J. Cowperthwaite, M. Sheelagh T. Carpendale, and F. David Fracchia. 1996. Visual Access for 3D Data. In Conference Companion on Human Factors in Computing Systems (CHI '96). ACM, New York, NY, USA, 175--176.  ",
      "doi": "10.1145/257089.257242"
    },
    {
      "text": "N. Elmqvist and P. Tsigas. 2008. A Taxonomy of 3D Occlusion Management for Visualization. IEEE Transactions on Visualization and Computer Graphics 14, 5 (Sept 2008), 1095--1109.  ",
      "doi": "10.1109/TVCG.2008.59"
    },
    {
      "text": "N. ElSayed, B. Thomas, K. Marriott, J. Piantadosi, and R. Smith. 2015. Situated Analytics. In 2015 Big Data Visual Analytics (BDVA). 1--8.",
      "doi": ""
    },
    {
      "text": "Rickard Englund, Karljohan Lundin Palmerius, Ingrid Hotz, and Anders Ynnerman. 2018. Touching Data: Enhancing Visual Exploration of Flow Data with Haptics. Computing in Science & Engineering 20, 3 (2018), 89--100.",
      "doi": ""
    },
    {
      "text": "Gustav Fechner. 1966. Elements of psychophysics. Vol. I. New York.",
      "doi": ""
    },
    {
      "text": "J. A. Wagner Filho, M. F. Rey, C. M. Freitas, and L. Nedel. 2018. Immersive Visualization of Abstract Information: An Evaluation on Dimensionally-Reduced Data Scatterplots. In 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR), Vol. 00. 483--490.",
      "doi": ""
    },
    {
      "text": "S. J. Haase and K. A. Kaczmarek. 2005. Electrotactile perception of scatterplots on the fingertips and abdomen. Medical and Biological Engineering and Computing 43, 2 (01 Apr 2005), 283--289.",
      "doi": ""
    },
    {
      "text": "Christopher G Healey. Retrieved on 2018-09--15. Perception in visualization. (Retrieved on 2018-09--15). https://www.csc2.ncsu.edu/faculty/ healey/PP/",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Randy Pausch, John C. Goble, and Neal F. Kassell. 1994. Passive Real-world Interface Props for Neurosurgical Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94). ACM, New York, NY, USA, 452--458.  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "C. Hurter, R. Taylor, S. Carpendale, and A. Telea. 2014. Color Tunneling: Interactive Exploration and Selection in Volumetric Datasets. In 2014 IEEE Pacific Visualization Symposium. 225--232.  ",
      "doi": "10.1109/PacificVis.2014.61"
    },
    {
      "text": "C. Hurter, A. Telea, and O. Ersoy. 2011. MoleView: An Attribute and Structure-Based Semantic Lens for Large Element-Based Plots. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec 2011), 2600--2609.  ",
      "doi": "10.1109/TVCG.2011.223"
    },
    {
      "text": "P. Issartel, F. Guéniat, and M. Ammi. 2014. Slicing techniques for handheld augmented reality. In 2014 IEEE Symposium on 3D User Interfaces (3DUI). 39--42.",
      "doi": ""
    },
    {
      "text": "H. Iwata and H. Noma. 1993. Volume haptization. In Proceedings of 1993 IEEE Research Properties in Virtual Reality Symposium. 16--23.",
      "doi": ""
    },
    {
      "text": "B. Jackson, T. Y. Lau, D. Schroeder, K. C. Toussaint, and D. F. Keefe. 2013. A Lightweight Tangible 3D Interface for Interactive Visualization of Thin Fiber Structures. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec 2013), 2802--2809.  ",
      "doi": "10.1109/TVCG.2013.121"
    },
    {
      "text": "Daniel A. Keim. 2000. Designing Pixel-Oriented Visualization Techniques: Theory and Applications. IEEE Transactions on Visualization and Computer Graphics 6, 1 (Jan. 2000), 59--78.  ",
      "doi": "10.1109/2945.841121"
    },
    {
      "text": "Tijmen Klein, Florimond Guéniat, Luc R. Pastur, Frédéric Vernier, and Tobias Isenberg. 2012. A Design Study of Direct-Touch Interaction for Exploratory 3D Scientific Visualization. Computer Graphics Forum 31, 3 (2012), 1225--1234.  ",
      "doi": "10.1111/j.1467-8659.2012.03115.x"
    },
    {
      "text": "Julian Kreimeier and Timo Götzelmann. 2018. FeelVR: Haptic Exploration of Virtual Objects. In Proceedings of the 11th Pervasive Technologies Related to Assistive Environments Conference. ACM, 122--125.  ",
      "doi": "10.1145/3197768.3201526"
    },
    {
      "text": "Martin Krzywinski and Naomi Altman. 2013. Points of significance: error bars. Nature Methods 10, 10 (Sept 2013), 921--922.",
      "doi": ""
    },
    {
      "text": "O. Daae Lampe and H. Hauser. 2011. Interactive visualization of streaming data with Kernel Density Estimation. In 2011 IEEE Pacific Visualization Symposium. 171--178. ",
      "doi": "10.5555/2015551.2015649"
    },
    {
      "text": "Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing data using t-SNE. Journal of machine learning research 9, Nov (2008), 2579-- 2605.",
      "doi": ""
    },
    {
      "text": "M. J. McGuffin, L. Tancau, and R. Balakrishnan. 2003. Using deformations for browsing volumetric data. In IEEE Visualization, 2003. VIS 2003. 401--408.  ",
      "doi": "10.1109/VISUAL.2003.1250400"
    },
    {
      "text": "B. Menelas, M. Ammi, L. Pastur, and P. Bourdot. 2009. Haptical exploration of an unsteady flow. In World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. 232--237.  ",
      "doi": "10.1109/WHC.2009.4810833"
    },
    {
      "text": "Bob-Antoine J. Menelas. 2014. Virtual Reality Technologies (Visual, Haptics, and Audio) in Large Datasets Analysis. In Innovative Approaches of Data Visualization and Visual Analytics, Mao Lin Huang and Weidong Huang (Eds.). IGI Global, Hershey, Pennsylvania, Chapter 6, 111--132.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2014. Visualization Analysis and Design. CRC Press.",
      "doi": ""
    },
    {
      "text": "S. Paneels and J. C. Roberts. 2010. Review of Designs for Haptic Data Visualization. IEEE Transactions on Haptics 3, 2 (April 2010), 119--137.  ",
      "doi": "10.1109/TOH.2009.44"
    },
    {
      "text": "Sabrina A. Panëels, Panagiotis D. Ritsos, Peter J. Rodgers, and Jonathan C. Roberts. 2013. Prototyping 3D haptic data visualizations. Computers & Graphics 37, 3 (2013), 179--192.  ",
      "doi": "10.1016/j.cag.2013.01.009"
    },
    {
      "text": "M. Pfeiffer and W. Stuerzlinger. 2015. 3D virtual hand pointing with EMS and vibration feedback. In 2015 IEEE Symposium on 3D User Interfaces (3DUI). 117--120.",
      "doi": ""
    },
    {
      "text": "H. Piringer, R. Kosara, and H. Hauser. 2004. Interactive focus+context visualization with linked 2D/3D scatterplots. In Proceedings. Second International Conference on Coordinated and Multiple Views in Exploratory Visualization, 2004. 49--60. ",
      "doi": "10.5555/1018416.1019220"
    },
    {
      "text": "J. Poco, R. Etemadpour, F. V. Paulovich, T. V. Long, P. Rosenthal, M. C. F. Oliveira, L. Linsen, and R. Minghim. 2011. A Framework for Exploring Multidimensional Data with 3D Projections. (2011), 1111--1120.  ",
      "doi": "10.1111/j.1467-8659.2011.01960.x"
    },
    {
      "text": "Fabio Remondino. 2003. From point cloud to surface: the modeling and visualization problem. International Archives of photogrammetry, Remote Sensing and spatial information sciences 34 (2003).",
      "doi": ""
    },
    {
      "text": "M. Sedlmair, T. Munzner, and M. Tory. 2013. Empirical Guidance on Scatterplot and Dimension Reduction Technique Choices. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec 2013), 2634--2643.  ",
      "doi": "10.1109/TVCG.2013.153"
    },
    {
      "text": "Utkarsh Soni, Yafeng Lu, Brett Hansen, Helen C. Purchase, Stephen Kobourov, and Ross Maciejewski. 2018. The Perception of Graph Properties in Graph Layouts. Computer Graphics Forum (2018).",
      "doi": ""
    },
    {
      "text": "Yuta Takeuchi, Sho Kamuro, Kouta Minamizawa, and Susumu Tachi. 2012. Haptic Duplicator. In Proceedings of the 2012 Virtual Reality International Conference (VRIC '12). ACM, New York, NY, USA, Article 30, 2 pages.  ",
      "doi": "10.1145/2331714.2331749"
    },
    {
      "text": "A. Talvas, M. Marchal, and A. Lécuyer. 2014. A Survey on Bimanual Haptic Interaction. IEEE Transactions on Haptics 7, 3 (July 2014), 285-- 300.",
      "doi": ""
    },
    {
      "text": "Steven Wall and Stephen Brewster. 2006. Feeling What You Hear: Tactile Feedback for Navigation of Audio Graphs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 1123--1132.  ",
      "doi": "10.1145/1124772.1124941"
    },
    {
      "text": "D. Wang, C. Peng, N. Afzal, W. Li, D. Wu, and Y. Zhang. 2018. Localization Performance of Multiple Vibrotactile Cues on Both Arms. IEEE Transactions on Haptics 11, 1 (Jan 2018), 97--106.",
      "doi": ""
    },
    {
      "text": "Colin Ware and Peter Mitchell. 2005. Reevaluating Stereo and Motion Cues for Visualizing Graphs in Three Dimensions. In Proceedings of the 2Nd Symposium on Applied Perception in Graphics and Visualization (APGV '05). ACM, New York, NY, USA, 51--58.  ",
      "doi": "10.1145/1080402.1080411"
    },
    {
      "text": "G. B. Wetherill and H. Levitt. 1965. Sequential Estimation of Points on a Psychometric Function. Brit. J. Math. Statist. Psych. 18, 1 (1965), 1--10.",
      "doi": ""
    },
    {
      "text": "Leland Wilkinson. 2006. The grammar of graphics. Springer Science & Business Media. ",
      "doi": "10.5555/316575"
    },
    {
      "text": "Wesley Willett, Bernhard Jenny, Tobias Isenberg, and Pierre Dragicevic. 2015. Lightweight Relief Shearing for Enhanced Terrain Perception on Interactive Maps. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3563--3572.  ",
      "doi": "10.1145/2702123.2702172"
    },
    {
      "text": "G. Yang, D. Ryu, and S. Kang. 2009. Vibrotactile display for hand-held input device providing spatial and directional information. In World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. 79--84.  ",
      "doi": "10.1109/WHC.2009.4810831"
    },
    {
      "text": "Lingyun Yu, Konstantinos Efstathiou, Petra Isenberg, and Tobias Isenberg. 2012. Efficient Structure-Aware Selection Techniques for 3D Point Cloud Visualizations with 2DOF Input. IEEE Transactions on Visualization and Computer Graphics 18, 12 (Dec. 2012), 2245--2254.  ",
      "doi": "10.1109/TVCG.2012.217"
    },
    {
      "text": "L. Yu, K. Efstathiou, P. Isenberg, and T. Isenberg. 2016. CAST: Effective and Efficient User Interaction for Context-Aware Selection in 3D Particle Clouds. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan 2016), 886--895.",
      "doi": "10.1109/TVCG.2015.2467202"
    }
  ]
}