{
  "doi": "10.1145/3290605.3300873",
  "title": "Preemptive Action: Accelerating Human Reaction using Electrical Muscle Stimulation Without Compromising Agency",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "We enable preemptive force-feedback systems to speed up human reaction time without fully compromising the user's sense of agency. Typically these interfaces actuate by means of electrical muscle stimulation (EMS) or mechanical actuators; they preemptively move the user to perform a task, such as to improve movement performance (e.g., EMS-assisted drumming). Unfortunately, when using preemptive force-feedback users do not feel in control and loose their sense of agency. We address this by actuating the user's body, using EMS, within a particular time window (160 ms after visual stimulus), which we found to speed up reaction time by 80 ms in our first study. With this preemptive timing, when the user and system move congruently, the user feels that they initiated the motion, yet their reaction time is faster than usual. As our second study demonstrated, this particular timing significantly increased agency when compared to the current practice in EMS-based devices. We conclude by illustrating, using examples from the HCI literature, how to leverage our findings to provide more agency to automated haptic interfaces.",
  "authors": [
    {
      "name": "Shunichi Kasahara",
      "institution": "Sony CSL & University of Tokyo, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556774656",
      "orcid": "0000-0002-4353-7620"
    },
    {
      "name": "Jun Nishida",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/do/10.1145/contrib-99658698158/rel-imgonly/as_sq_1024_crop.jpg",
      "acmid": "99658698158",
      "orcid": "0000-0003-3081-1587"
    },
    {
      "name": "Pedro Lopes",
      "institution": "University of Chicago, Chicago, IL, USA",
      "img": "/do/10.1145/contrib-81557182156/rel-imgonly/_pedrolopes_uchicago.jpg",
      "acmid": "81557182156",
      "orcid": "0000-0001-6527-7084"
    }
  ],
  "references": [
    {
      "text": "Josh Andres, Julian de Hoog, Jürg von Känel, Julian Berk, Bach Le, Xizi Wang, Marcus Brazil, and Florian 'Floyd' Mueller. 2016. Exploring Human: EBike Interaction to Support Rider Autonomy. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (CHI PLAY Companion '16). ACM, New York, NY, USA, 85--92.  ",
      "doi": "10.1145/2968120.2987719"
    },
    {
      "text": "A. Angel. 1973. Input-output relations in simple reaction time experiments. The Quarterly Journal of Experimental Psychology 25, 2 (May 1973), 193--200.",
      "doi": ""
    },
    {
      "text": "Tomohisa Asai. 2016. Agency elicits body-ownership: proprioceptive drift toward a synchronously acting external proxy. Experimental Brain Research 234, 5 (May 2016), 1163--1174.",
      "doi": ""
    },
    {
      "text": "Domna Banakou and Mel Slater. 2014. Body ownership causes illusory self-attribution of speaking and influences subsequent real speaking. Proceedings of the National Academy of Sciences 111, 49 (Dec. 2014), 17678--17683.",
      "doi": ""
    },
    {
      "text": "Bruno Berberian, Jean-Christophe Sarrazin, Patrick Le Blaye, and Patrick Haggard. 2012. Automation Technology and Sense of Control: A Window on Human Agency. PLOS ONE 7, 3 (March 2012), e34075.",
      "doi": ""
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta, David Coyle, Jarrod Knibbe, and Kasper Hornb\\a ek. 2018. I Really Did That: Sense of Agency with Touchpad, Keyboard, and On-skin Interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 378:1--378:8.  ",
      "doi": "10.1145/3173574.3173952"
    },
    {
      "text": "M. Botvinick and J. Cohen. 1998. Rubber hands 'feel' touch that eyes see. Nature 391, 6669 (Feb. 1998), 756.",
      "doi": ""
    },
    {
      "text": "Stuart K Card, Thomas P Moran, and Allen Newell. 1983. The psychology of human-computer interaction. L. Erlbaum Associates, Hillsdale, N.J. OCLC: 9042220. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Patricia Ivette Cornelio Martinez, Silvana De Pirro, Chi Thanh Vi, and Sriram Subramanian. 2017. Agency in Mid-air Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2426--2439.  ",
      "doi": "10.1145/3025453.3025457"
    },
    {
      "text": "Patricia I. Cornelio Martinez, Emanuela Maggioni, Kasper Hornb\\a ek, Marianna Obrist, and Sriram Subramanian. 2018. Beyond the Libet Clock: Modality Variants for Agency Measurements. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 541:1--541:14.  ",
      "doi": "10.1145/3173574.3174115"
    },
    {
      "text": "David Coyle, James Moore, Per Ola Kristensson, Paul Fletcher, and Alan Blackwell. 2012. I Did That! Measuring Users' Experience of Agency in Their Own Actions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2025--2034.  ",
      "doi": "10.1145/2207676.2208350"
    },
    {
      "text": "Nicole David, Stefan Skoruppa, Alessandro Gulberti, Johannes Schultz, and Andreas K. Engel. 2016. The Sense of Agency Is More Sensitive to Manipulations of Outcome than Movement-Related Feedback Irrespective of Sensory Modality. PLOS ONE 11, 8 (Aug. 2016), e0161156.",
      "doi": ""
    },
    {
      "text": "John A. Dewey and Günther Knoblich. 2014. Do Implicit and Explicit Measures of the Sense of Agency Measure the Same Thing? PLOS ONE 9, 10 (Oct. 2014), e110118.",
      "doi": ""
    },
    {
      "text": "Ayaka Ebisu, Satoshi Hashizume, Kenta Suzuki, Akira Ishii, Mose Sakashita, and Yoichi Ochiai. 2016. Stimulated Percussions: Techniques for Controlling Human As Percussive Musical Instrument by Using Electrical Muscle Stimulation. In SIGGRAPH ASIA 2016 Posters (SA '16). ACM, New York, NY, USA, Article 37, 2 pages.  ",
      "doi": "10.1145/3005274.3005324"
    },
    {
      "text": "Kai Engbert, Andreas Wohlschläger, and Patrick Haggard. 2008. Who is causing what? The sense of agency is relational and efferenttriggered. Cognition 107, 2 (May 2008), 693--704.",
      "doi": ""
    },
    {
      "text": "Douglas C. Engelbart and William K. English. 1968. A Research Center for Augmenting Human Intellect. In Proceedings of the December 9--11, 1968, Fall Joint Computer Conference, Part I (AFIPS '68 (Fall, part I)). ACM, New York, NY, USA, 395--410.  ",
      "doi": "10.1145/1476589.1476645"
    },
    {
      "text": "Farzam Farbiz, Zhou Hao Yu, Corey Manders, and Waqas Ahmad. 2007. An Electrical Muscle Stimulation Haptic Feedback for Mixed Reality Tennis Game. In ACM SIGGRAPH 2007 Posters (SIGGRAPH '07). ACM, New York, NY, USA, Article 140.  ",
      "doi": "10.1145/1280720.1280873"
    },
    {
      "text": "C. D. Frith, S. J. Blakemore, and D. M. Wolpert. 2000. Abnormalities in the awareness and control of action. Philosophical Transactions of the Royal Society of London. Series B, Biological Sciences 355, 1404 (Dec. 2000), 1771--1788.",
      "doi": ""
    },
    {
      "text": "Xiaochi Gu, Yifei Zhang, Weize Sun, Yuanzhe Bian, Dao Zhou, and Per Ola Kristensson. 2016. Dexmo: An Inexpensive and Lightweight Mechanical Exoskeleton for Motion Capture and Force Feedback in VR. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1991--1995.  ",
      "doi": "10.1145/2858036.2858487"
    },
    {
      "text": "Adrian G. Guggisberg and Anaïs Mottaz. 2013. Timing and awareness of movement decisions: does consciousness really come too late? Frontiers in Human Neuroscience 7 (July 2013).",
      "doi": ""
    },
    {
      "text": "Patrick Haggard, Sam Clark, and Jeri Kalogeras. 2002. Voluntary action and conscious awareness. Nature Neuroscience 5, 4 (April 2002), 382--385. IB Origin.",
      "doi": ""
    },
    {
      "text": "Uwe Herwig, Lizbeth Cardenas-Morales, Bernhard J. Connemann, Thomas Kammer, and Carlos Schönfeldt-Lecuona. 2010. Sham or real-Post hoc estimation of stimulation condition in a randomized transcranial magnetic stimulation trial. Neuroscience Letters 471, 1 (Feb. 2010), 30--33.",
      "doi": ""
    },
    {
      "text": "Ray Hyman. 1953. Stimulus information as a determinant of reaction time. Journal of Experimental Psychology 45, 3 (1953), 188--196.",
      "doi": ""
    },
    {
      "text": "Marc Jeannerod. 2003. The mechanism of self-recognition in humans. Behavioural Brain Research 142, 1--2 (June 2003), 1--15.",
      "doi": ""
    },
    {
      "text": "Seungzoo Jeong, Naoki Hashimoto, and Sato Makoto. 2004. A Novel Interaction System with Force Feedback Between Real - and Virtual Human: An Entertainment System: \"Virtual Catch Ball\". In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in Computer Entertainment Technology (ACE '04). ACM, New York, NY, USA, 61--66.  ",
      "doi": "10.1145/1067343.1067350"
    },
    {
      "text": "C. Jeunet, L. Albert, F. Argelaguet, and A. Lécuyer. 2018. \"Do You Feel in Control?\": Towards Novel Approaches to Characterise, Manipulate and Measure the Sense of Agency in Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 24, 4 (April 2018), 1486--1495.  ",
      "doi": "10.1109/TVCG.2018.2794598"
    },
    {
      "text": "Andreas Kalckert and H. Henrik Ehrsson. 2012. Moving a Rubber Hand that Feels Like Your Own: A Dissociation of Ownership and Agency. Frontiers in Human Neuroscience 6 (2012).",
      "doi": ""
    },
    {
      "text": "Benjamin Knoerlein, Gábor Székely, and Matthias Harders. 2007. Visuo-haptic Collaborative Augmented Reality Ping-pong. In Proceedings of the International Conference on Advances in Computer Entertainment Technology (ACE '07). ACM, New York, NY, USA, 91--94.  ",
      "doi": "10.1145/1255047.1255065"
    },
    {
      "text": "Ernst Kruijff, Dieter Schmalstieg, and Steffi Beckhaus. 2006. Using Neuromuscular Electrical Stimulation for Pseudo-haptic Feedback. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (VRST '06). ACM, New York, NY, USA, 316--319.  ",
      "doi": "10.1145/1180495.1180558"
    },
    {
      "text": "Benjamin Libet. 1985. Unconscious cerebral initiative and the role of conscious will in voluntary action. Behavioral and Brain Sciences 8, 4 (Dec. 1985), 529--539.",
      "doi": ""
    },
    {
      "text": "BENJAMIN LIBET, CURTIS A GLEASON, and ELWOOD W WRIGHT. {n. d.}. TIME OF CONSCIOUS INTENTION TO ACT IN RELATION TO ONSET OF CEREBRAL ACTIVITY (READINESS-POTENTIAL). ({n. d.}), 20. Libet Time.",
      "doi": ""
    },
    {
      "text": "Jakub Limanowski and Felix Blankenburg. 2016. That's not quite me: limb ownership encoding in the brain. Social Cognitive and Affective Neuroscience 11, 7 (July 2016), 1130--1140.",
      "doi": ""
    },
    {
      "text": "Hannah Limerick, James W. Moore, and David Coyle. 2015. Empirical Evidence for a Diminished Sense of Agency in Speech Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3967--3970.  ",
      "doi": "10.1145/2702123.2702379"
    },
    {
      "text": "Pedro Lopes and Patrick Baudisch. 2013. Muscle-propelled Force Feedback: Bringing Force Feedback to Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2577--2580.  ",
      "doi": "10.1145/2470654.2481355"
    },
    {
      "text": "P. Lopes and P. Baudisch. 2017. Interactive Systems Based on Electrical Muscle Stimulation. Computer 50, 10 (2017), 28--35.",
      "doi": "10.1109/MC.2017.3641627"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 11--19.  ",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, Willi Mueller, Daniel Hoffmann, Patrik Jonell, and Patrick Baudisch. 2015. Proprioceptive Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 939--948.  ",
      "doi": "10.1145/2702123.2702461"
    },
    {
      "text": "Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++: Allowing Objects to Communicate Dynamic Use. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2515--2524.  ",
      "doi": "10.1145/2702123.2702128"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1471--1482.  ",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Masao Matsuhashi and Mark Hallett. 2008. The timing of the conscious intention to move. The European journal of neuroscience 28, 11 (Dec. 2008), 2344--2351.",
      "doi": ""
    },
    {
      "text": "John McEneaney. 2013. Agency Effects in Human-Computer Interaction. International Journal of Human-Computer Interaction 29 (Sept. 2013), 798--813.",
      "doi": ""
    },
    {
      "text": "Christopher A. Miller and Raja Parasuraman. 2007. Designing for Flexible Interaction Between Humans and Automation: Delegation Interfaces for Supervisory Control. Human Factors 49, 1 (Feb. 2007), 57--75.",
      "doi": ""
    },
    {
      "text": "James W. Moore and Sukhvinder S. Obhi. 2012. Intentional binding and the sense of agency: a review. Consciousness and Cognition 21, 1 (March 2012), 546--561.",
      "doi": ""
    },
    {
      "text": "Jun Murayama, Laroussi Bougrila, Yanlin Luo, Katsuhito Akahane, Shoichi Hasegawa, Béat Hirsbrunner, and Makoto Sato. 2004. G : A Two-Handed Haptic Interface for Bimanual VR Interaction.",
      "doi": ""
    },
    {
      "text": "Pekka Niemi and Risto Näätänen. 1981. Foreperiod and simple reaction time. Psychological Bulletin 89, 1 (1981), 133--162.",
      "doi": ""
    },
    {
      "text": "Jun Nishida, Shunichi Kasahara, and Kenji Suzuki. 2017. Wired Muscle: Generating Faster Kinesthetic Reaction by Inter-personally Connecting Muscles. In ACM SIGGRAPH 2017 Emerging Technologies (SIGGRAPH '17). ACM, New York, NY, USA, Article 26, 2 pages.  ",
      "doi": "10.1145/3084822.3084844"
    },
    {
      "text": "Jun Nishida and Kenji Suzuki. 2017. bioSync: A Paired Wearable Device for Blending Kinesthetic Experience. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3316--3327.  ",
      "doi": "10.1145/3025453.3025829"
    },
    {
      "text": "Jay A. Olson, Mathieu Landry, Krystèle Appourchaux, and Amir Raz. 2016. Simulated thought insertion: Influencing the sense of agency using deception and magic. Consciousness and Cognition 43 (July 2016), 11--26.",
      "doi": ""
    },
    {
      "text": "D. Pamungkas and K. Ward. 2015. Immersive teleoperation of a robot arm using electro-tactile feedback. In 2015 6th International Conference on Automation, Robotics and Applications (ICARA). 300--305.",
      "doi": ""
    },
    {
      "text": "Max Pfeiffer, Tim Dünte, Stefan Schneegass, Florian Alt, and Michael Rohs. 2015. Cruise Control for Pedestrians: Controlling Walking Direction Using Electrical Muscle Stimulation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2505--2514.  ",
      "doi": "10.1145/2702123.2702190"
    },
    {
      "text": "Emanuele Ruffaldi, Paolo Tripicchio, Carlo Alberto Avizzano, and Massimo Bergamasco. 2011. Haptic Rendering of Juggling with Encountered Type Interfaces. Presence: Teleoperators and Virtual Environments 20, 5 (2011), 480--501. arXiv:https://doi.org/10.1162/PRESa 00067  ",
      "doi": "10.1162/PRES_a_00067"
    },
    {
      "text": "Shinsuke Shimojo. 2014. Postdiction: its implications on visual awareness, hindsight, and sense of agency. Frontiers in Psychology 5 (March 2014).",
      "doi": ""
    },
    {
      "text": "Chun Siong Soon, Marcel Brass, Hans-Jochen Heinze, and John-Dylan Haynes. 2008. Unconscious determinants of free decisions in the human brain. Nature Neuroscience 11, 5 (May 2008), 543--545.",
      "doi": ""
    },
    {
      "text": "Chris Speed and Duncan Shingleton. 2012. Take Me I'M Yours: Mimicking Object Agency. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (UbiComp '12). ACM, New York, NY, USA, 1167--1170.  ",
      "doi": "10.1145/2370216.2370465"
    },
    {
      "text": "P. Strojnik, A. Kralj, and I. Ursic. 1979. Programmed Six-Channel Electrical Stimulator for Complex Stimulation of Leg Muscles During Walking. IEEE Transactions on Biomedical Engineering BME-26, 2 (Feb 1979), 112--116.",
      "doi": ""
    },
    {
      "text": "Matthis Synofzik, Gottfried Vosgerau, and Martin Voss. 2013. The experience of agency: an interplay between prediction and postdiction. Frontiers in Psychology 4 (2013).",
      "doi": ""
    },
    {
      "text": "Emi Tamaki, Takashi Miyaki, and Jun Rekimoto. 2011. PossessedHand: Techniques for Controlling Human Hands Using Electrical Muscles Stimuli. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 543--552.  ",
      "doi": "10.1145/1978942.1979018"
    },
    {
      "text": "Manos Tsakiris, Gita Prabhu, and Patrick Haggard. 2006. Having a body versus moving your body: How agency structures bodyownership. Consciousness and Cognition 15, 2 (June 2006), 423--432. BO and SOA.",
      "doi": ""
    },
    {
      "text": "Daniel M Wegner. 2003. The mind's best trick: how we experience conscious will. Trends in Cognitive Sciences 7, 2 (Feb. 2003), 65--69.",
      "doi": ""
    },
    {
      "text": "Sébastien Weibel, Patrick Eric Poncelet, Yvonne Delevoye-Turrell, Antonio Capobianco, André Dufour, Renaud Brochard, Laurent Ott, and Anne Giersch. 2015. Feeling of control of an action after supra and subliminal haptic distortions. Consciousness and Cognition 35 (Sept. 2015), 16--29.",
      "doi": ""
    },
    {
      "text": "Wen Wen, Atsushi Yamashita, and Hajime Asama. 2015. The Sense of Agency during Continuous Action: Performance Is More Important than Action-Feedback Association. PLOS ONE 10, 4 (April 2015), e0125226.",
      "doi": ""
    },
    {
      "text": "Andrew Wold, Jakub Limanowski, Henrik Walter, and Felix Blankenburg. 2014. Proprioceptive drift in the rubber hand illusion is intensified following 1 Hz TMS of the left EBA. Frontiers in Human Neuroscience 8 (2014).",
      "doi": ""
    },
    {
      "text": "Vibol Yem, Hideaki Kuzuoka, Naomi Yamashita, Shoichi Ohta, and Yasuo Takeuchi. 2014. Hand-Skill Learning Using Outer-Covering Haptic Display. In Haptics: Neuroscience, Devices, Modeling, and Applications (Lecture Notes in Computer Science), Malika Auvray and Christian Duriez (Eds.). Springer Berlin Heidelberg, 201--207.",
      "doi": ""
    },
    {
      "text": "Regine Zopf, Vince Polito, and James Moore. 2018. Revisiting the link between body and agency: visual movement congruency enhances intentional binding but is not body-specific. Scientific Reports 8, 1 (Jan. 2018), 196.",
      "doi": ""
    }
  ]
}