{
  "doi": "10.1145/3290605.3300819",
  "title": "Vulnerability & Blame: Making Sense of Unauthorized Access to Smartphones",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Unauthorized physical access to personal devices by people known to the owner of the device is a common concern, and a common occurrence. But how do people experience incidents of unauthorized access? Using an online survey, we collected 102 accounts of unauthorized access. Participants wrote stories about past situations in which either they accessed the smartphone of someone they know, or someone they know accessed theirs. We describe the context leading up to these incidents, the course of events, and the consequences. We then identify two orthogonal themes in how participants conceptualized these incidents. First, participants understood trust as performative vulnerability: trust was necessary to sustain relationships, but building trust required displaying vulnerability to breaches. Second, participants were self-serving in their sensemaking: they blamed the circumstances, or the other person's shortcomings, but rarely themselves. We discuss the implications of our findings for security design and practice.",
  "tags": [
    "intrusions",
    "qualitative",
    "access control",
    "mobile"
  ],
  "authors": [
    {
      "name": "Diogo Marques",
      "institution": "Universidade de Lisboa, Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020775",
      "orcid": "missing"
    },
    {
      "name": "Tiago Guerreiro",
      "institution": "Universidade de Lisboa, Lisbon, Portugal",
      "img": "/do/10.1145/contrib-81350573788/rel-imgonly/aa.jpg",
      "acmid": "81350573788",
      "orcid": "0000-0002-0333-5792"
    },
    {
      "name": "Luis Carriço",
      "institution": "Universidade de Lisboa, Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100160018",
      "orcid": "missing"
    },
    {
      "name": "Ivan Beschastnikh",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81367591740",
      "orcid": "missing"
    },
    {
      "name": "Konstantin Beznosov",
      "institution": "University of British Columbia, Vancouver, BC, Canada",
      "img": "/do/10.1145/contrib-81100388506/rel-imgonly/kosta_soups.jpg",
      "acmid": "81100388506",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Android Help {n. d.}. Set your Android device to automatically unlock. Retrieved Sep. 1, 2018 from https://support.google.com/android/answer/9075927",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2016. Humanistic HCI. interactions 23, 2 (Feb. 2016), 20--29.",
      "doi": ""
    },
    {
      "text": "Roy F. Baumeister, Arlene Stillwell, and Sara R. Wotman. 1990. Victim and perpetrator accounts of interpersonal conflict: Autobiographical narratives about anger. Journal of Personality and Social Psychology 59, 5 (1990), 994--1005.",
      "doi": ""
    },
    {
      "text": "Noam Ben-Asher, Niklas Kirschnick, Hanul Sieger, Joachim Meyer, Asaf Ben-Oved, and Sebastian Möller. 2011. On the Need for Different Security Methods on Mobile Phones. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services - MobileHCI '11. ACM, New York, 465--473.  ",
      "doi": "10.1145/2037373.2037442"
    },
    {
      "text": "Virginia Braun, Victoria Clarke, Nikki Hayfield, Naomi Moller, and Irmgard Tischner. 2017. Qualitative Story Completion. In Handbook of Research Methods in Health Social Sciences. Springer, Singapore, 1--18.",
      "doi": ""
    },
    {
      "text": "Sloane C. Burke, Michele Wallen, Karen Vail-Smith, and David Knox. 2011. Using technology to control intimate partners: An exploratory study of college undergraduates. Computers in Human Behavior 27, 3 (2011), 1162--1167.  ",
      "doi": "10.1016/j.chb.2010.12.010"
    },
    {
      "text": "Ivan Cherapau, Ildar Muslukhov, Nalin Asanka, and Konstantin Beznosov. 2015. On the Impact of Touch ID on iPhone Passcodes. In Proceedings of the Eleventh Symposium On Usable Privacy and Security (SOUPS '15). USENIX Association, Berkeley, CA, USA, 257-- 276. https://www.usenix.org/conference/soups2015/proceedings/presentation/cherapau ",
      "doi": "10.5555/3235866.3235888"
    },
    {
      "text": "Erika Chin, Adrienne Porter Felt, Vyas Sekar, and David Wagner. 2012. Measuring User Confidence in Smartphone Security and Privacy. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12). ACM, New York, 1--16.  ",
      "doi": "10.1145/2335356.2335358"
    },
    {
      "text": "Jill P. Dimond, Casey Fiesler, and Amy S. Bruckman. 2011. Domestic violence and information communication technologies. Interacting with Computers 23, 5 (2011), 413--421.  ",
      "doi": "10.1016/j.intcom.2011.04.006"
    },
    {
      "text": "Serge Egelman, Sakshi Jain, Rebecca S Portnoff, Kerwell Liao, Sunny Consolvo, and David Wagner. 2014. Are You Ready to Lock? Understanding User Motivations for Smartphone Locking Behaviors. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security (CCS '14). ACM, New York, 750--761.  ",
      "doi": "10.1145/2660267.2660273"
    },
    {
      "text": "Malin Eiband, Mohamed Khamis, Emanuel von Zezschwitz, Heinrich Hussmann, and Florian Alt. 2017. Understanding Shoulder Surfing in the Wild: Stories from Users and Observers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, 4254--4265.  ",
      "doi": "10.1145/3025453.3025636"
    },
    {
      "text": "Adrienne Porter Felt, Serge Egelman, and David Wagner. 2012. I'Ve Got 99 Problems, but Vibration Ain'T One: A Survey of Smartphone Users' Concerns. In Proceedings of the Second ACM Workshop on Security and Privacy in Smartphones and Mobile Devices (SPSM '12). ACM, New York, 33--44.  ",
      "doi": "10.1145/2381934.2381943"
    },
    {
      "text": "John C Flanagan. 1954. The critical incident technique. Psychological bulletin 51, 4 (1954), 327. https://www.apa.org/pubs/databases/psycinfo/cit-article.pdf",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. \"A Stalker's Paradise\": How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, 667--667.  ",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Alina Hang, Emanuel von Zezschwitz, Alexander De Luca, and Heinrich Hussmann. 2012. Too Much Information!: User Attitudes Towards Smartphone Sharing. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction (NordiCHI '12). ACM, New York, 284--287.  ",
      "doi": "10.1145/2399016.2399061"
    },
    {
      "text": "Marian Harbach, Alexander De Luca, and Serge Egelman. 2016. The Anatomy of Smartphone Unlocking: A Field Study of Android Lock Screens. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, 4806--4817.  ",
      "doi": "10.1145/2858036.2858267"
    },
    {
      "text": "Marian Harbach, Emanuel von Zezschwitz, Andreas Fichtner, Alexander De Luca, and Matthew Smith. 2014. It's a Hard Lock Life: A Field Study of Smartphone (Un)Locking Behavior and Risk Perception. In Proceedings of the Tenth Symposium On Usable Privacy and Security (SOUPS '14). USENIX Association, Berkeley, CA, USA, 213-- 230. https://www.usenix.org/conference/soups2014/proceedings/ presentation/harbach ",
      "doi": "10.5555/3235838.3235857"
    },
    {
      "text": "Eiji Hayashi, Oriana Riva, Karin Strauss, A. J. Bernheim Brush, and Stuart Schechter. 2012. Goldilocks and the Two Mobile Devices: Going Beyond All-or-nothing Access to a Device's Applications. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12). ACM, New York, 1--11.  ",
      "doi": "10.1145/2335356.2335359"
    },
    {
      "text": "Amy K. Karlson, A.J. Bernheim Brush, and Stuart Schechter. 2009. Can I Borrow Your Phone?: Understanding Concerns when Sharing Mobile Phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, New York, 1647--1650.  ",
      "doi": "10.1145/1518701.1518953"
    },
    {
      "text": "Jill N. Kearns and Frank D. Fincham. 2005. Victim and Perpetrator Accounts of Interpersonal Transgressions: Self-Serving or RelationshipServing Biases? Personality and Social Psychology Bulletin 31, 3 (2005), 321--333.",
      "doi": ""
    },
    {
      "text": "Roy J. Lewicki, Edward C. Tomlinson, and Nicole Gillespie. 2006. Models of Interpersonal Trust Development: Theoretical Approaches, Empirical Evidence, and Future Directions. Journal of Management 32, 6 (2006), 991--1022.",
      "doi": ""
    },
    {
      "text": "Diogo Marques, Ildar Muslukhov, Tiago Guerreiro, Luís Carriço, and Konstantin Beznosov. 2016. Snooping on Mobile Phones: Prevalence and Trends. In Proceedings of the Twelfth Symposium on Usable Privacy and Security (SOUPS '16). USENIX Association, Berkeley, CA, USA, 159--174. https://www.usenix.org/conference/soups2016/technical-sessions/presentation/marques ",
      "doi": "10.5555/3235895.3235909"
    },
    {
      "text": "Tara Matthews, Kerwell Liao, Anna Turner, Marianne Berkovich, Robert Reeder, and Sunny Consolvo. 2016. \"She'l Just Grab Any Device That's Closer\": A Study of Everyday Device & Account Sharing in Households. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, 5921--5932.  ",
      "doi": "10.1145/2858036.2858051"
    },
    {
      "text": "Tara Matthews, Kathleen O'Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F. Churchill, and Sunny Consolvo. 2017. Stories from Survivors: Privacy & Security Practices when Coping with Intimate Partner Abuse. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, 2189--2201.  ",
      "doi": "10.1145/3025453.3025875"
    },
    {
      "text": "Michelle L. Mazurek, J. P. Arsenault, Joanna Bresee, Nitin Gupta, Iulia Ion, Christina Johns, Daniel Lee, Yuan Liang, Jenny Olsen, Brandon Salmon, Richard Shay, Kami Vaniea, Lujo Bauer, Lorrie Faith Cranor, Gregory R. Ganger, and Michael K. Reiter. 2010. Access Control for Home Data Sharing: Attitudes, Needs and Practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, 645--654.  ",
      "doi": "10.1145/1753326.1753421"
    },
    {
      "text": "Hendrik Müller, Jennifer L. Gove, John S. Webb, and Aaron Cheang. 2015. Understanding and Comparing Smartphone and Tablet Use: Insights from a Large-Scale Diary Study. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15). ACM, New York, 427--436.  ",
      "doi": "10.1145/2838739.2838748"
    },
    {
      "text": "Ildar Muslukhov, Yazan Boshmaf, Cynthia Kuo, Jonathan Lester, and Konstantin Beznosov. 2012. Understanding Users' Requirements for Data Protection in Smartphones. In IEEE 28th International Conference on Data Engineering Workshops (ICDEW 2012). IEEE, New York, 228-- 235.  ",
      "doi": "10.1109/ICDEW.2012.83"
    },
    {
      "text": "Ildar Muslukhov, Yazan Boshmaf, Cynthia Kuo, Jonathan Lester, and Konstantin Beznosov. 2013. Know Your Enemy: The Risk of Unauthorized Access in Smartphones by Insiders. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, 271--280.  ",
      "doi": "10.1145/2493190.2493223"
    },
    {
      "text": "Dawn Nafus and Karina Tracey. 2002. Mobile phone consumption and concepts of personhood. In Perpetual Contact: Mobile Communication, Private Talk, Public Performance, James E. Katz and Mark Aakhus (Eds.). Cambridge University Press, Cambridge, UK, 206--222. ",
      "doi": "10.5555/644547.644561"
    },
    {
      "text": "Virpi Oksman and Pirio Rautianen. 2003. \"Perhaps it is a Body Part\": How the Mobile Phone Became an Organic Part of the Everyday Lives of Finnish Children and Teenagers. In Machines That Become Us, James E. Katz (Ed.). Transaction Publishers, New Brunswick, NJ, USA, 293 -- 308.",
      "doi": ""
    },
    {
      "text": "Leysia Palen and Paul Dourish. 2003. Unpacking \"Privacy\" for a Networked World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Cheul Young Park, Cori Faklaris, Siyan Zhao, Alex Sciuto, Laura Dabbish, and Jason Hong. 2018. Share and Share Alike? An Exploration of Secure Behaviors in Romantic Relationships. In Proceedings of the Fourteenth Symposium on Usable Privacy and Security (SOUPS '18). USENIX Association, Berkeley, CA, USA, 83--102. https://www.usenix.org/conference/soups2018/presentation/park ",
      "doi": "10.5555/3291228.3291236"
    },
    {
      "text": "Eyal Peer, Laura Brandimarte, Sonam Samat, and Alessandro Acquisti. 2017. Beyond the Turk: Alternative platforms for crowdsourcing behavioral research. Journal of Experimental Social Psychology 70 (may 2017), 153--163.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2012. Privacy and Data Management on Mobile Devices. Retrieved Sep. 1, 2018 from http://www.pewinternet.org/2012/09/05/privacy-and-data-management-on-mobile-devices/",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchill. 2018. \"Privacy is not for me, it's for those rich women\": Performative Privacy Practices on Mobile Phones by Women in South Asia. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, Berkeley, CA, USA, 127--142. https://www.usenix.org/conference/soups2018/presentation/sambasivan ",
      "doi": "10.5555/3291228.3291240"
    },
    {
      "text": "Richard Shay, Iulia Ion, Robert W. Reeder, and Sunny Consolvo. 2014. \"My Religious Aunt Asked Why I Was Trying to Sell Her Viagra\": Experiences with Account Hijacking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, 2657--2666.  ",
      "doi": "10.1145/2556288.2557330"
    },
    {
      "text": "Irina Shklovski, Scott D. Mainwaring, Halla Hrund Skúladóttir, and Höskuldur Borgthorsson. 2014. Leakiness and Creepiness in App Space: Perceptions of Privacy and Mobile App Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, 2347--2356.  ",
      "doi": "10.1145/2556288.2557421"
    },
    {
      "text": "Evan Stark. 2007. Coercive control: The entrapment of women in personal life. Oxford University Press, New York.",
      "doi": ""
    },
    {
      "text": "Gareth Terry, Nikki Hayfield, Victoria Clarke, and Virginia Braun. 2017. Thematic Analysis. In The SAGE Handbook of Qualitative Research in Psychology. SAGE Publications Ltd, London, UK, 17--36.",
      "doi": ""
    },
    {
      "text": "Wali Ahmed Usmani, Diogo Marques, Ivan Beschastnikh, Konstantin Beznosov, Tiago Guerreiro, and Luís Carriço. 2017. Characterizing Social Insider Attacks on Facebook. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, 3810--3820.  ",
      "doi": "10.1145/3025453.3025901"
    },
    {
      "text": "Delanie Woodlock. 2017. The Abuse of Technology in Domestic Violence and Stalking. Violence Against Women 23, 5 (2017), 584--602.",
      "doi": ""
    },
    {
      "text": "Jeanne S. Zechmeister and Catherine Romero. 2002. Victim and offender accounts of interpersonal conflict: Autobiographical narratives of forgiveness and unforgiveness. Journal of Personality and Social Psychology 82, 4 (2002), 675--686.",
      "doi": ""
    }
  ]
}