{
  "doi": "10.1145/3290605.3300558",
  "title": "The Effects of Interruption Timings on Autonomous Height-Adjustable Desks that Respond to Task Changes",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2019,
  "badges": [],
  "abstract": "Actuated furniture, such as electric adjustable sit-stand desks, helps users vary their posture and contributes to comfort and health. However, studies found that users rarely initiate height changes. Therefore, in this paper, we look into furniture that adjusts itself to the user's needs. A situated interview study indicated task-changing as an opportune moment for automatic height adjustment. We then performed a Wizard of Oz study to find the best timing for changing desk height to minimize interruption and discomfort. The results are in line with prior work on task interruption in graphical user interfaces and show that the table should change height during a task change. However, results also indicate that until users build trust in the system, they prefer actuation after a task change to experience the impact of the adjustment. Based on the results, we discuss design guidelines for interactive desks with agency.",
  "authors": [
    {
      "name": "Bokyung Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-99658747582/rel-imgonly/bokyunglee_jpg.jpg",
      "acmid": "99658747582",
      "orcid": "missing"
    },
    {
      "name": "Sindy Wu",
      "institution": "University of Florida, Gainesville, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366757",
      "orcid": "missing"
    },
    {
      "name": "Maria Jose Reyes",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261533",
      "orcid": "missing"
    },
    {
      "name": "Daniel Saakes",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309492813",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Piotr D. Adamczyk and Brian P. Bailey. 2004. If Not Now, when?: The Effects of Interruption at Different Moments Within Task Execution. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, New York, NY, USA, 271--278.  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Gilles Bailly, Sidharth Sahdev, Sylvain Malacria, and Thomas Pietrzak. 2016. LivingDesktop: Augmenting Desktop Workstation with Actuated Devices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5298--5310.  ",
      "doi": "10.1145/2858036.2858208"
    },
    {
      "text": "Uta Brandes and Michael Erlhoff. 2012. My desk is my castle: exploring personalization cultures. Walter de Gruyter. Interruption Timings on Autonomous Height-Adjustable Desks CHI 2019, May 4--9, 2019, Glasgow, Scotland UK",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal, Andrew Wang, and Rosalind Picard. 2007. Experiments with a Robotic Computer: Body, Affect and Cognition Interactions. In Proceedings of the ACM/IEEE International Conference on Human-robot Interaction (HRI '07). ACM, New York, NY, USA, 153--160.  ",
      "doi": "10.1145/1228716.1228737"
    },
    {
      "text": "Nico J Delleman, Christine M Haslegrave, and Don B Chaffin. 2004. Working postures and movements. CRC Press.",
      "doi": ""
    },
    {
      "text": "Stir Desk. 2019. Stir Desk. (jan 2019). Retrieved 2019-01-05 from https://www.stirworks.com/",
      "doi": ""
    },
    {
      "text": "E Grandjean, W. Hünting, and M. Pidermann. 1983. VDT Workstation Design: Preferred Settings and Their Effects. Human Factors 25, 2 (1983), 161--175. PMID: 6862447.",
      "doi": ""
    },
    {
      "text": "Michael Haller, Christoph Richter, Peter Brandl, Sabine Gross, Gerold Schossleitner, Andreas Schrempf, Hideaki Nii, Maki Sugimoto, and Masahiko Inami. 2011. Finding the Right Way for Interrupting People Improving Their Sitting Posture. In Proceedings of the 13th IFIP TC 13 International Conference on Human-computer Interaction - Volume Part II (INTERACT'11). Springer-Verlag, Berlin, Heidelberg, 1--17. http: //dl.acm.org/citation.cfm?id=2042118.2042120 ",
      "doi": "10.5555/2042118.2042120"
    },
    {
      "text": "Chris Harrison and Anind K. Dey. 2008. Lean and Zoom: Proximityaware User Interface and Content Magnification. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 507--510.  ",
      "doi": "10.1145/1357054.1357135"
    },
    {
      "text": "Alan Hedge. 2004. Effects of an Electric Height-adjustable Worksurface on self-assessed Musculokeletal discomfort and Productivity in Computer Workers. Technical Report. Cornell University Human Factors and Ergonomics Research Laboratory.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Ken Hinckley, Jeff Pierce, Eric Horvitz, and Mike Sinclair. 2005. Foreground and Background Interaction with Sensor-enhanced Mobile Devices. ACM Trans. Comput.-Hum. Interact. 12, 1 (March 2005), 31--52.  ",
      "doi": "10.1145/1057237.1057240"
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2005. Investigating the Effectiveness of Mental Workload As a Predictor of Opportune Moments for Interruption. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (CHI EA '05). ACM, New York, NY, USA, 1489--1492.  ",
      "doi": "10.1145/1056808.1056948"
    },
    {
      "text": "Thomas Karakolis and Jack P. Callaghan. 2014. The impact of sit-stand office workstations on worker discomfort and productivity: A review. Applied Ergonomics 45, 3 (2014), 799 -- 806.",
      "doi": ""
    },
    {
      "text": "Lena Karlqvist. 1998. A process for the development, specification and evaluation of VDU work tables. Applied Ergonomics 29, 6 (1998), 423 -- 432.",
      "doi": ""
    },
    {
      "text": "Lena K. Karlqvist, Mats Hagberg, Max Köster, Marika Wenemark, and Rickard Anell. 1996. Musculoskeletal Symptoms among Computer assisted Design (CAD) Operators and Evaluation of a Self-assessment Questionnaire. International Journal of Occupational and Environmental Health 2, 3 (1996), 185--194. PMID: 9933873.",
      "doi": ""
    },
    {
      "text": "Karl HE Kroemer, Henrike B Kroemer, and Katrin E Kroemer-Elbert. 2001. Ergonomics: how to design for ease and efficiency. Pearson College Division.",
      "doi": ""
    },
    {
      "text": "Yoshiki Kudo, Kazuki Takashima, Morten Fjeld, and Yoshifumi Kitamura. 2018. AdapTable: Extending Reach over Large Tabletops Through Flexible Multi-Display Configuration. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces (ISS '18). ACM, New York, NY, USA, 213--225.  ",
      "doi": "10.1145/3279778.3279779"
    },
    {
      "text": "Bokyung Lee, Minjoo Cho, Joonhee Min, and Daniel Saakes. 2016. Posing and Acting As Input for Personalizing Furniture. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (NordiCHI '16). ACM, New York, NY, USA, Article 44, 10 pages.  ",
      "doi": "10.1145/2971485.2971487"
    },
    {
      "text": "Bokyung Lee, Joongi Shin, Hyoshin Bae, and Daniel Saakes. 2018. Interactive and Situated Guidelines to Help Users Design a Personal Desk That Fits Their Bodies. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 637--650.  ",
      "doi": "10.1145/3196709.3196725"
    },
    {
      "text": "S.M. McGill, N.S. Kavcic, and E. Harvey. 2006. Sitting on a chair or an exercise ball: Various perspectives to guide decision making. Clinical Biomechanics 21, 4 (2006), 353 -- 360.",
      "doi": ""
    },
    {
      "text": "Christophe Mignot, Claude Valot, and Noëlle Carbonell. 1993. An Experimental Study of Future \"Natural\" Multimodal Human-computer Interaction. In INTERACT '93 and CHI '93 Conference Companion on Human Factors in Computing Systems (CHI '93). ACM, New York, NY, USA, 67--68.  ",
      "doi": "10.1145/259964.260075"
    },
    {
      "text": "Heather L. Nerhood and Steven W. Thompson. 1994. Adjustable SitStand Workstations in the Office. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 38, 10 (1994), 668--672.",
      "doi": ""
    },
    {
      "text": "Takeshi Oozu, Aki Yamada, Yuki Enzaki, and Hiroo Iwata. 2016. Escaping Chair: Furniture-shaped Device Art. In ACM SIGGRAPH 2016 Posters (SIGGRAPH '16). ACM, New York, NY, USA, Article 8, 2 pages.  ",
      "doi": "10.1145/2945078.2945086"
    },
    {
      "text": "Julius Panero and Martin Zelnik. 2014. Human dimension and interior space: a source book of design reference standards. Watson-Guptill.",
      "doi": ""
    },
    {
      "text": "Casey Reas and Benjamin Fry. 2003. Processing: A Learning Environment for Creating Interactive Web Graphics. In ACM SIGGRAPH 2003 Web Graphics (SIGGRAPH '03). ACM, New York, NY, USA, 1--1.  ",
      "doi": "10.1145/965333.965356"
    },
    {
      "text": "Thomas B. Sheridan. 1992. Telerobotics, Automation, and Human Supervisory Control. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/134291"
    },
    {
      "text": "Joongi Shin, Woohyeok Choi, Uichin Lee, and Daniel Saakes. 2018. Actuating a Monitor for Posture Changes. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article LBW616, 6 pages.  ",
      "doi": "10.1145/3170427.3188562"
    },
    {
      "text": "David Sirkin, Brian Mok, Stephen Yang, and Wendy Ju. 2015. Mechanical Ottoman: How Robotic Furniture Offers and Withdraws Support. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI '15). ACM, New York, NY, USA, 11--18.  ",
      "doi": "10.1145/2696454.2696461"
    },
    {
      "text": "Salli Auto Smart. 2019. Salli. (jan 2019). Retrieved 2019-01-05 from https://salli.com/en/salli-autosmart",
      "doi": ""
    },
    {
      "text": "Marco Spadafora, Victor Chahuneau, Nikolas Martelaro, David Sirkin, and Wendy Ju. 2016. Designing the Behavior of Interactive Objects. In Proceedings of the TEI '16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '16). ACM, New York, NY, USA, 70--77.  ",
      "doi": "10.1145/2839462.2839502"
    },
    {
      "text": "Kazuki Takashima, Naohiro Aida, Hitomi Yokoyama, and Yoshifumi Kitamura. 2013. TransformTable: A Self-actuated Shape-changing Digital Table. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (ITS '13). ACM, New York, NY, USA, 179--188.  ",
      "doi": "10.1145/2512349.2512818"
    },
    {
      "text": "Kazuki Takashima, Yusuke Asari, Hitomi Yokoyama, Ehud Sharlin, and Yoshifumi Kitamura. 2015. MovemenTable: The Design of Moving Interactive Tabletops. In 15th IFIP TC 13 International Conference on Human-Computer Interaction - INTERACT 2015 - Volume 9298. Springer-Verlag, Berlin, Heidelberg, 296--314. DOI:http://dx.doi.org/ CHI 2019, May 4--9, 2019, Glasgow, Scotland UK  ",
      "doi": "10.1007/978-3-319-22698-9_19"
    },
    {
      "text": "Kazuki Takashima, Yusuke Asari, Hitomi Yokoyama, Ehud Sharlin, and Yoshifumi Kitamura. 2015. MovemenTable: The Design of Moving Interactive Tabletops. In Human-Computer Interaction -- INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Springer International Publishing, Cham, 296--314.  ",
      "doi": "10.1007/978-3-319-22698-9_19"
    },
    {
      "text": "Meng-Ru Tsai and Tze-Wen Lin. 2017. Desk Adjusting Method and Desk. (23 02 2017). https://patents.google.com/patent/ US20170052517A1/",
      "doi": ""
    },
    {
      "text": "C Tudor-Locke, J M Schuna Jr, L J Frensham, and M Proenca. 2013. Changing the way we work: elevating energy expenditure with workstation alternatives. International Journal Of Obesity 38 (28 11 2013), 755 EP --.",
      "doi": ""
    },
    {
      "text": "J. Verbeek. 1991. The use of adjustable furniture: Evaluation of an instruction programme for office workers. Applied Ergonomics 22, 3 (1991), 179 -- 184.",
      "doi": ""
    },
    {
      "text": "Luke Vink, Viirj Kan, Ken Nakagaki, Daniel Leithinger, Sean Follmer, Philipp Schoessler, Amit Zoran, and Hiroshi Ishii. 2015. TRANSFORM As Adaptive and Dynamic Furniture. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). ACM, New York, NY, USA, 183--183.  ",
      "doi": "10.1145/2702613.2732494"
    },
    {
      "text": "P. Vink, R. Porcar-Seder, ÃÂlvaro Page de Pozo, and F. Krause. 2007. Office chairs are often not adjusted by end-users. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 51, 17 (2007), 1015--1019.",
      "doi": ""
    },
    {
      "text": "Qi Wang, Marina Toeters, Wei Chen, Annick Timmermans, and Panos Markopoulos. 2016. Zishi: A Smart Garment for Posture Monitoring. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). ACM, New York, NY, USA, 3792--3795.  ",
      "doi": "10.1145/2851581.2890262"
    },
    {
      "text": "Stephen Wilks, Monica Mortimer, and Per Nylén. 2006. The introduction of sit-stand worktables; aspects of attitudes, compliance and satisfaction. Applied Ergonomics 37, 3 (2006), 359 -- 365.",
      "doi": ""
    },
    {
      "text": "Yu-Chian Wu, Te-Yen Wu, Paul Taele, Bryan Wang, Jun-You Liu, Pinsung Ku, Po-En Lai, and Mike Y. Chen. 2018. ActiveErgo: Automatic and Personalized Ergonomics Using Self-actuating Furniture. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 558, 8 pages.  ",
      "doi": "10.1145/3173574.3174132"
    },
    {
      "text": "S. Yang, B. K. J. Mok, D. Sirkin, H. P. Ive, R. Maheshwari, K. Fischer, and W. Ju. 2015. Experiences developing socially acceptable interactions for a robotic trash barrel. In 2015 24th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). 277--284.",
      "doi": ""
    },
    {
      "text": "Nan Zhao, Asaph Azaria, and Joseph A. Paradiso. 2017. Mediated Atmospheres: A Multimodal Mediated Work Environment. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 31 (June 2017), 23 pages.  ",
      "doi": "10.1145/3090096"
    },
    {
      "text": "Ying Zheng and John B. Morrell. 2010. A vibrotactile feedback approach to posture guidance. In 2010 IEEE Haptics Symposium. 351--358.  ",
      "doi": "10.1109/HAPTIC.2010.5444633"
    }
  ]
}