{
  "doi": "10.1145/3290605.3300594",
  "title": "Look-From Camera Control for 3D Terrain Maps",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We introduce three lightweight interactive camera control techniques for 3D terrain maps on touch devices based on a look-from metaphor (Discrete Look-From-At, Continuous Look-From-Forwards, and Continuous Look-From-Towards). These techniques complement traditional touch screen pan, zoom, rotate, and pitch controls allowing viewers to quickly transition between top-down, oblique, and ground-level views. We present the results of a study in which we asked participants to perform elevation comparison and line-of-sight determination tasks using each technique. Our results highlight how look-from techniques can be integrated on top of current direct manipulation navigation approaches by combining several direct manipulation operations into a single look-from operation. Additionally, they show how look-from techniques help viewers complete a variety of common and challenging map-based tasks.",
  "tags": [
    "look-from camera control",
    "map interaction",
    "touch",
    "terrain"
  ],
  "authors": [
    {
      "name": "Kurtis Danyluk",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260628",
      "orcid": "missing"
    },
    {
      "name": "Bernhard Jenny",
      "institution": "Monash University, Melbourne, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597718",
      "orcid": "0000-0001-6101-6100"
    },
    {
      "name": "Wesley Willett",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350572817",
      "orcid": "0000-0002-6793-3062"
    }
  ],
  "references": [
    {
      "text": "Pablo Abend, Tristan Thielmann, Ralph Ewerth, Dominik Seiler, Markus Mühling, Jörg Döring, Manfred Grauer, and Bernd Freisleben. 2012. Geobrowsing behaviour in Google Earth-A semantic video content analysis of on-screen navigation. GI_Forum (2012), 2--13.",
      "doi": ""
    },
    {
      "text": "American Psychological Association. 2017. Publication Manual of the American Psychological Association (sixth ed.). American Psychological Association, Washington.",
      "doi": ""
    },
    {
      "text": "Henrik Buchholz, Johannes Bohnet, and Jürgen Döllner. 2005. Smart and physically-based navigation in 3D geovirtual environments. In Ninth International Conference on Information Visualisation (IV'05). IEEE, 629--635.  ",
      "doi": "10.1109/IV.2005.117"
    },
    {
      "text": "Jonas Buddeberg, Bernhard Jenny, and Wesley Willett. 2017. Interactive shearing for terrain visualization: an expert study. GeoInformatica 21, 3 (jul 2017), 643--665.  ",
      "doi": "10.1007/s10707-016-0283-9"
    },
    {
      "text": "Stuart K. Card, Jock D. Mackinlay, and George G. Robertson. 1991. A morphological analysis of the design space of input devices. ACM Transactions on Information Systems 9, 2 (apr 1991), 99--122.  ",
      "doi": "10.1145/123078.128726"
    },
    {
      "text": "David B. Christianson, Sean E. Anderson, Li-wei He, David H. Salesin, Daniel S. Weld, and Michael F. Cohen. 1996. Declarative Camera Control for Automatic Cinematography. In Proceedings of the Thirteenth National Conference on Artificial Intelligence - Volume 1 (AAAI'96). AAAI Press, 148--155. http://dl.acm.org/citation.cfm?id=1892875.1892897 ",
      "doi": "10.5555/1892875.1892897"
    },
    {
      "text": "Andy Cockburn, Amy Karlson, and Benjamin B. Bederson. 2008. A review of overview+detail, zooming, and focus+context interfaces. Comput. Surveys 41, 1 (dec 2008), 1--31.  ",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Geoff Cumming. 2014. The new statistics: Why and how. Psychological science 25, 1 (2014), 7--29.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic, Fanny Chevalier, and Stephane Huot. 2014. Running an HCI Experiment in Multiple Parallel Universes. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14). ACM, New York, NY, USA, 607--618.  ",
      "doi": "10.1145/2559206.2578881"
    },
    {
      "text": "Jörg Edelmann, Andreas Schilling, and Sven Fleck. 2009. The DabR - A multitouch system for intuitive 3D scene navigation. In 2009 3DTV Conference: The True Vision - Capture, Transmission and Display of 3D Video. 1--4.",
      "doi": ""
    },
    {
      "text": "James D. Eynard and Bernhard Jenny. 2016. Illuminated and shadowed contour lines: improving algorithms and evaluating effectiveness. International Journal of Geographical Information Science (apr 2016), 1--21.",
      "doi": ""
    },
    {
      "text": "Michael Gleicher and Andrew Witkin. 1992. Through-the-lens camera control. In ACM SIGGRAPH Computer Graphics, Vol. 26. 331--340.  ",
      "doi": "10.1145/142920.134088"
    },
    {
      "text": "Benjamin Hagedorn and Jürgen Döllner. 2008. Sketch-based navigation in 3D virtual environments. In Smart Graphics. Springer Berlin Heidelberg, Berlin, 239--246.  ",
      "doi": "10.1007/978-3-540-85412-8_23"
    },
    {
      "text": "Andrew J. Hanson and Eric A. Wernert. 1997. Constrained 3D navigation with 2D controllers. In Proceedings of the 8th Conference on Visualization '97 (VIS '97). IEEE Computer Society Press, Los Alamitos, CA, USA, 175--ff. http://dl.acm.org/citation.cfm?id=266989.267052 ",
      "doi": "10.5555/266989.267052"
    },
    {
      "text": "DieterHildebrandtandRobertTimm.2014. Anassisting,constrained3D navigationtechniqueformultiscalevirtual3Dcitymodels. GeoInformatica 18, 3 (jul 2014), 537--567.  ",
      "doi": "10.1007/s10707-013-0189-8"
    },
    {
      "text": "Robert J. K. Jacob, Linda E. Sibert, Daniel C. McFarlane, and M. Preston Mullen. 1994. Integrality and separability of input devices. ACM Transactions on Computer-Human Interaction 1, 1 (mar 1994), 3--26.  ",
      "doi": "10.1145/174630.174631"
    },
    {
      "text": "Jacek Jankowski and Martin Hachet. 2015. Advances in interaction with 3D environments. In Computer Graphics Forum, Vol. 34. 152--190.  ",
      "doi": "10.1111/cgf.12466"
    },
    {
      "text": "Nico Li, Wesley Willett, Ehud Sharlin, and Mario Costa Sousa. 2017. Visibility perception and dynamic viewsheds for topographic maps and models. In Proceedings of the 5th Symposium on Spatial User Interaction - SUI '17. ACM Press, New York, 39--47.  ",
      "doi": "10.1145/3131277.3132178"
    },
    {
      "text": "Jock Mackinlay, Stuart K. Card, and George G. Robertson. 1990. A semantic analysis of the design space of input devices. Human-Computer Interaction 5, 2 (1990), 145--190.  ",
      "doi": "10.1207/s15327051hci0502%25263_2"
    },
    {
      "text": "Jock D. Mackinlay, Stuart K. Card, and George G. Robertson. 1990. Rapid Controlled Movement Through a Virtual 3D Workspace. In Proceedings of the 17th Annual Conference on Computer Graphics and Interactive Techniques (ACM SIGGRAPH Computer Graphics). ACM, New York, NY, USA, 171--176.  ",
      "doi": "10.1145/97879.97898"
    },
    {
      "text": "Anthony Martinet, Gery Casiez, and Laurent Grisoni. 2012. Integrality and separability of multitouch interaction techniques in 3D manipulation tasks. IEEE Transactions on Visualization and Computer Graphics 18, 3 (mar 2012), 369--380.  ",
      "doi": "10.1109/TVCG.2011.129"
    },
    {
      "text": "James McCrae, Igor Mordatch, Michael Glueck, and Azam Khan. 2009. Multiscale 3D Navigation. In Proceedings of the 2009 Symposium on Interactive 3D Graphics and Games (I3D '09). ACM, New York, NY, USA, 7--14.  ",
      "doi": "10.1145/1507149.1507151"
    },
    {
      "text": "Richard J. Phillips, Alande Lucia, and Nicholas Skelton. 1975. Some objective tests of the legibility of relief maps. The Cartographic Journal 12, 1 (jun 1975), 39--46.",
      "doi": ""
    },
    {
      "text": "Jeffrey S. Pierce and Randy Pausch. 2004. Navigation with place representations and visible landmarks. In IEEE Virtual Reality 2004. 173--288. ",
      "doi": "10.5555/1009389.1010387"
    },
    {
      "text": "L. M. Potash, J. P. Farrell, and T. S. Jeffrey. 1978. A technique for assessing map relief legibility. The Cartographic Journal 15, 1 (jun 1978), 28--35.",
      "doi": ""
    },
    {
      "text": "Jef Raskin. 2000. The humane interface : new directions for designing interactive systems. Addison-Wesley. 233 pages. ",
      "doi": "10.5555/333103"
    },
    {
      "text": "Jason L. Reisman, Philip L. Davidson, and Jefferson Y. Han. 2009. A screen-space formulation for 2D and 3D direct manipulation. In Proceedings of the 22nd annual ACM symposium on User interface software and technology - UIST '09. ACM Press, New York, 69.  ",
      "doi": "10.1145/1622176.1622190"
    },
    {
      "text": "Bruno Marques Ferreira da Silva, Selan Rodrigues dos Santos, and Jauvane Cavalcante de Oliveira. 2009. Using a physically-based camera to control travel in virtual environments. Symposium on Virtual and Augmented Reality (SVR).",
      "doi": ""
    },
    {
      "text": "RussellTurner,FrancisBalaguer,EnricoGobbetti,andDanielThalmann. 1991. Physically-based interactive camera motion control using 3D input devices. In Scientific Visualization of Physical Phenomena. Springer Japan, Tokyo, 135--145. ",
      "doi": "10.5555/139834.139852"
    },
    {
      "text": "Benjamin Walther-Franks, Marc Herrlich, and Rainer Malaka. 2011. A multi-touch system for 3D modelling and animation. In Smart Graphics. SG 2011, Lecture Notes in Computer Science, vol 6815, Dickmann L. et al. (Ed.). Springer, Berlin, Heidelberg, Berlin, Heidelberg, 48--59. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK K. Danyluk et al. ",
      "doi": "10.5555/2032567.2032574"
    },
    {
      "text": "Ming Wan, Frank Dachille, and Arie Kaufman. 2001. Distance-field based skeletons for virtual navigation. In Proceedings of the Conference on Visualization '01 (VIS '01). IEEE Computer Society, Washington, DC, USA, 239--246. http://dl.acm.org/citation.cfm?id=601671.601708 ",
      "doi": "10.5555/601671.601708"
    },
    {
      "text": "Colin Ware and Steven Osborne. 1990. Exploration and virtual camera control in virtual three dimensional environments. ACM SIGGRAPH Computer Graphics 24, 2 (feb 1990), 175--183.  ",
      "doi": "10.1145/91394.91442"
    },
    {
      "text": "Wesley Willett, Bernhard Jenny, Tobias Isenberg, and Pierre Dragicevic. 2015. Lightweight relief shearing for enhanced terrain perception on interactive maps. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press, New York, 3563--3572.  ",
      "doi": "10.1145/2702123.2702172"
    },
    {
      "text": "Dongbo Xiao and Roger Hubbold. 1998. Navigation guided by artificial force fields. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press, New York, 179--186.  ",
      "doi": "10.1145/274644.274671"
    },
    {
      "text": "Robert Xiao, Julia Schwarz, and Chris Harrison. 2015. Estimating 3D Finger Angle on Commodity Touchscreens. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 47--50.  ",
      "doi": "10.1145/2817721.2817737"
    },
    {
      "text": "Georgios N. Yannakakis, Héctor P. Martínez, and Arnav Jhala. 2010. Towards affective camera control in games. User Modeling and User-Adapted Interaction 20, 4 (oct 2010), 313--340.  ",
      "doi": "10.1007/s11257-010-9078-0"
    },
    {
      "text": "Robert Zeleznik and Andrew Forsberg. 1999. UniCam-2D gestural camera controls for 3D environments. In Proceedings of the 1999 symposium on Interactive 3D graphics - SI3D '99. ACM Press, New York, 169--173.  ",
      "doi": "10.1145/300523.300546"
    }
  ]
}