{
  "doi": "10.1145/3290605.3300428",
  "title": "Defending My Castle: A Co-Design Study of Privacy Mechanisms for Smart Homes",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Home is a person's castle, a private and protected space. Internet-connected devices such as locks, cameras, and speakers might make a home \"smarter\" but also raise privacy issues because these devices may constantly and inconspicuously collect, infer or even share information about people in the home. To explore user-centered privacy designs for smart homes, we conducted a co-design study in which we worked closely with diverse groups of participants in creating new designs. This study helps fill the gap in the literature between studying users' privacy concerns and designing privacy tools only by experts. Our participants' privacy designs often relied on simple strategies, such as data localization, disconnection from the Internet, and a private mode. From these designs, we identified six key design factors: data transparency and control, security, safety, usability and user experience, system intelligence, and system modality. We discuss how these factors can guide design for smart home privacy.",
  "tags": [
    "internet of things",
    "privacy",
    "smart home",
    "co-design"
  ],
  "authors": [
    {
      "name": "Yaxing Yao",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131392",
      "orcid": "missing"
    },
    {
      "name": "Justin Reed Basdeo",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365674",
      "orcid": "missing"
    },
    {
      "name": "Smirity Kaushik",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365134",
      "orcid": "0000-0001-8776-6030"
    },
    {
      "name": "Yang Wang",
      "institution": "Syracuse University, Syracuse, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82458950557",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Noah Apthorpe, Dillon Reisman, and Nick Feamster. 2017. A smart home is no castle: Privacy vulnerabilities of encrypted IoT traffic. arXiv preprint arXiv:1705.06805 (2017).",
      "doi": ""
    },
    {
      "text": "Noah Apthorpe, Dillon Reisman, Srikanth Sundaresan, Arvind Narayanan, and Nick Feamster. 2017. Spying on the smart home: Privacy attacks and defenses on encrypted iot traffic. arXiv preprint arXiv:1708.05044 (2017).",
      "doi": ""
    },
    {
      "text": "Abdullahi Arabo, Ian Brown, and Fadi El-Moussa. 2012. Privacy in the age of mobility and smart devices in smart homes. In Privacy, Security, Risk and Trust (PASSAT), 2012 International Conference on and 2012 International Confernece on Social Computing (SocialCom). IEEE, 819--826.  ",
      "doi": "10.1109/SocialCom-PASSAT.2012.108"
    },
    {
      "text": "Mikhail Bilenko, Matthew Richardson, and Janice Tsai. 2011. Targeted, not tracked: Client-side solutions for privacy-friendly behavioral advertising. In Privacy Enhancing Technologies Symposium (PETS 2011).",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "AJ Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home automation in the wild: challenges and opportunities. In proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2115--2124.  ",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Joseph Bugeja, Andreas Jacobsson, and Paul Davidsson. 2016. On privacy and security challenges in smart connected homes. In Intelligence and Security Informatics Conference (EISIC), 2016 European. IEEE, 172--175.",
      "doi": ""
    },
    {
      "text": "Antorweep Chakravorty, Tomasz Wlodarczyk, and Chunming Rong. 2013. Privacy preserving data analytics for smart homes. In Security and Privacy Workshops (SPW), 2013 IEEE. IEEE, 23--27.  ",
      "doi": "10.1109/SPW.2013.22"
    },
    {
      "text": "Federal Trade Commission et al. 2015. Internet of Things: Privacy & security in a connected world. Washington, DC: Federal Trade Commission (2015).",
      "doi": ""
    },
    {
      "text": "Anupam Das, Martin Degeling, Daniel Smullen, and Norman Sadeh. 2018. Personalized Privacy Assistants for the Internet of Things. (2018).",
      "doi": ""
    },
    {
      "text": "Trisha Datta, Noah Apthorpe, and Nick Feamster. 2018. A DeveloperFriendly Library for Smart Home IoT Privacy-Preserving Traffic Obfuscation. In Proceedings of the 2018 Workshop on IoT Security and Privacy. ACM, 43--48.  ",
      "doi": "10.1145/3229565.3229567"
    },
    {
      "text": "Ali Dorri, Salil S Kanhere, Raja Jurdak, and Praveen Gauravaram. 2017. Blockchain for IoT security and privacy: The case study of a smart home. In Pervasive Computing and Communications Workshops (PerCom Workshops), 2017 IEEE International Conference on. IEEE, 618-- 623.",
      "doi": ""
    },
    {
      "text": "Serge Egelman, AJ Brush, and Kori M Inkpen. 2008. Family accounts: a new paradigm for user accounts within the home environment. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. ACM, 669--678.  ",
      "doi": "10.1145/1460563.1460666"
    },
    {
      "text": "Joseph L Fleiss, Bruce Levin, and Myunghee Cho Paik. 2013. Statistical methods for rates and proportions. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "David Frohlich and Robert Kraut. 2003. The social context of home computing. In Inside the smart home. Springer, 127--162.",
      "doi": ""
    },
    {
      "text": "Simon Gerber, Michael Fry, Judy Kay, Bob Kummerfeld, Glen Pink, and Rainer Wasinger. 2010. PersonisJ: Mobile, Client-Side User Modelling. In International Conference on User Modeling, Adaptation, and Personalization (Lecture Notes in Computer Science), Vol. 6075. Springer Berlin / Heidelberg, 111--122.  ",
      "doi": "10.1007/978-3-642-13470-8_12"
    },
    {
      "text": "Andreas Jacobsson, Martin Boldt, and Bengt Carlsson. 2016. A risk analysis of a smart home automation system. Future Generation Computer Systems 56 (2016), 719--733.  ",
      "doi": "10.1016/j.future.2015.09.003"
    },
    {
      "text": "Andreas Jacobsson and Paul Davidsson. 2015. Towards a model of privacy and security for smart homes. In Internet of Things (WF-IoT), 2015 IEEE 2nd World Forum on. IEEE, 727--732.  ",
      "doi": "10.1109/WF-IoT.2015.7389144"
    },
    {
      "text": "Li Jiang, Da-You Liu, and Bo Yang. 2004. Smart home research. In Machine Learning and Cybernetics, 2004. Proceedings of 2004 International Conference on, Vol. 2. IEEE, 659--663.",
      "doi": ""
    },
    {
      "text": "Martin J Kraemer and Ivan Flechais. 2018. Researching privacy in smart homes: A roadmap of future directions and research methods. (2018).",
      "doi": ""
    },
    {
      "text": "Sathish Alampalayam Kumar, Tyler Vealey, and Harshit Srivastava. 2016. Security in internet of things: Challenges, solutions and future directions. In System Sciences (HICSS), 2016 49th Hawaii International Conference on. IEEE, 5772--5781.  ",
      "doi": "10.1109/HICSS.2016.714"
    },
    {
      "text": "Josephine Lau, Benjamin Zimmerman, and Florian Schaub. 2018. Alexa, are you listening? privacy perceptions, concerns and privacy-seeking behaviors with smart speakers. In Pro. ACM Human-Computer Interaction CSCW. ACM.  ",
      "doi": "10.1145/3274371"
    },
    {
      "text": "Huichen Lin and Neil W Bergmann. 2016. IoT privacy and security challenges for smart home environments. Information 7, 3 (2016), 44.",
      "doi": ""
    },
    {
      "text": "Nathan Malkin, Julia Bernd, Maritza Johnson, and Serge Egelman. 2018. \"What Can't Data Be Used For?\" Privacy Expectations about Smart TVs in the US. European Workshop on Usable Security (EuroUSEC) (2018).",
      "doi": ""
    },
    {
      "text": "Roisin McNaney, John Vines, Jamie Mercer, Leon Mexter, Daniel Welsh, and Tony Young. 2017. DemYouth: Co-Designing and Enacting Tools to Support Young People's Engagement with People with Dementia. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1313--1325.  ",
      "doi": "10.1145/3025453.3025558"
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys that listen: A study of parents, children, and internet-connected toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5197--5207.  ",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "Tiago DP Mendes, Radu Godina, Eduardo MG Rodrigues, João CO Matias, and João PS Catalão. 2015. Smart home communication technologies and applications: Wireless protocol assessment for home area network resources. Energies 8, 7 (2015), 7279--7311.",
      "doi": ""
    },
    {
      "text": "Andrew Meola. 2016. How the Internet of Things will affect security & privacy.",
      "doi": ""
    },
    {
      "text": "Simon Moncrieff, Svetha Venkatesh, and Geoff West. 2007. Dynamic privacy in a smart house environment. In Multimedia and Expo, 2007 IEEE International Conference on. IEEE, 2034--2037.",
      "doi": ""
    },
    {
      "text": "Nest. 2018. Nest Cam. https://nest.com/cameras/nest-cam-indoor/ overview/",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Washington law review 79, 1 (2004), 119--158.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2009. Privacy in context: Technology, policy, and the integrity of social life. Stanford University Press. ",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Erika Shehan Poole, Christopher A Le Dantec, James R Eagan, and W Keith Edwards. 2008. Reflecting on the invisible: understanding end-user perceptions of ubiquitous computing. In Proceedings of the 10th international conference on Ubiquitous computing. ACM, 192--201.  ",
      "doi": "10.1145/1409635.1409662"
    },
    {
      "text": "Elizabeth B-N Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. Co-design 4, 1 (2008), 5--18.",
      "doi": ""
    },
    {
      "text": "Marc Steen, Menno Manschot, and Nicole De Koning. 2011. Benefits of co-design in service design projects. International Journal of Design 5, 2 (2011).",
      "doi": ""
    },
    {
      "text": "Biljana L Risteska Stojkoska and Kire V Trivodaliev. 2017. A review of Internet of Things for smart home: Challenges and solutions. Journal of Cleaner Production 140 (2017), 1454--1464.",
      "doi": ""
    },
    {
      "text": "The New York Times. 2018. Is Alexa Listening? https://www.nytimes. com/2018/05/25/business/amazon-alexa-conversation-shared-echo. html",
      "doi": ""
    },
    {
      "text": "Froukje Sleeswijk Visser, Pieter Jan Stappers, Remko Van der Lugt, and Elizabeth BN Sanders. 2005. Contextmapping: experiences from practice. CoDesign 1, 2 (2005), 119--149.",
      "doi": ""
    },
    {
      "text": "Junjue Wang, Brandon Amos, Anupam Das, Padmanabhan Pillai, Norman Sadeh, and Mahadev Satyanarayanan. 2018. Enabling Live Video Analytics with a Scalable and Privacy-Aware Framework. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) 14, 3s (2018), 64.  ",
      "doi": "10.1145/3209659"
    },
    {
      "text": "Peter Worthy, Ben Matthews, and Stephen Viller. 2016. Trust me: doubts and concerns living with the Internet of Things. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 427--434.  ",
      "doi": "10.1145/2901790.2901890"
    },
    {
      "text": "Kenji Yoshigoe, Wei Dai, Melissa Abramson, and Alexander Jacobs. 2015. Overcoming invasion of privacy in smart home environment with synthetic packet injection. In TRON Symposium (TRONSHOW), 2015. IEEE, 1--7.",
      "doi": ""
    },
    {
      "text": "Eric Zeng, Shrirang Mare, and Franziska Roesner. 2017. End User Security & Privacy Concerns with Smart Homes. In Symposium on Usable Privacy and Security (SOUPS). ",
      "doi": "10.5555/3235924.3235931"
    },
    {
      "text": "Serena Zheng, Marshini Chetty, and Nick Feamster. 2018. User Perceptions of Privacy in Smart Homes. arXiv preprint arXiv:1802.08182 (2018).",
      "doi": ""
    },
    {
      "text": "Martina Ziefle, Carsten Rocker, and Andreas Holzinger. 2011. Medical technology in smart homes: exploring the user's perspective on privacy, intimacy and trust. In Computer Software and Applications Conference Workshops (COMPSACW), 2011 IEEE 35th Annual. IEEE, 410--415.  ",
      "doi": "10.1109/COMPSACW.2011.75"
    },
    {
      "text": "Verena Zimmermann, Merve Bennighof, Miriam Edel, Oliver Hofmann, Judith Jung, and Melina von Wick. 2018. 'Home, Smart Home'-- Exploring End Users' Mental Models of Smart Homes. Mensch und Computer 2018-Workshopband (2018).",
      "doi": ""
    }
  ]
}