{
  "doi": "10.1145/3290605.3300783",
  "title": "Evaluating Expert Curation in a Baby Milestone Tracking App",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Early childhood developmental screening is critical for timely detection and intervention. babyTRACKS (Formerly Baby CROINC, CROwd INtelligence Curation.) is a free, live, interactive developmental tracking mobile app with over 3,000 children's diaries. Parents write or select short milestone texts, like \"began taking first steps,\" to record their babies' developmental achievements, and receive crowd-based percentiles to evaluate development and catch potential delays. Currently, an expert-based Curated Crowd Intelligence (CCI) process manually groups incoming novel parent-authored milestone texts according to their similarity to existing milestones in the database (for example, starting to walk), or determining that the milestone represents a new developmental concept not seen before in another child's diary. CCI cannot scale well, however, and babyTRACKS is mature enough, with a rich enough database of existing milestone texts, to now consider machine learning tools to replace or assist the human curators. Three new studies explore (1) the usefulness of automation, by analyzing the human cost of CCI and how the work is currently broken down; (2) the validity of automation, by testing the inter-rater reliability of curators; and (3) the value of automation, by appraising the \"real world\" clinical value of milestones when assessing child development. We conclude that automation can indeed be appropriate and helpful for a large percentage, though not all, of CCI work. We further establish realistic upper bounds for algorithm performance; confirm that the babyTRACKS milestones dataset is valid for training and testing purposes; and verify that it represents clinically meaningful developmental information.",
  "authors": [
    {
      "name": "Ayelet Ben-Sasson",
      "institution": "University of Haifa, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81458658320",
      "orcid": "missing"
    },
    {
      "name": "Eli Ben-Sasson",
      "institution": "Technion, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100149497",
      "orcid": "missing"
    },
    {
      "name": "Kayla Jacobs",
      "institution": "Technion, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659237324",
      "orcid": "missing"
    },
    {
      "name": "Elisheva Rotman Argaman",
      "institution": "Technion, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366148",
      "orcid": "missing"
    },
    {
      "name": "Eden Saig",
      "institution": "Technion, Haifa, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659238774",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ayelet Ben-Sasson, Eli Ben-Sasson, Kayla Jacobs, and Eden Saig. 2017. Baby CROINC: an online, crowd-based, expert-curated system for monitoring child development. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, New York, NY, USA, 110--119.  ",
      "doi": "10.1145/3154862.3154887"
    },
    {
      "text": "Ayelet Ben-Sasson and Elad Yom-Tov. 2016. Online concerns of parents suspecting autism spectrum disorder in their child: content analysis of signs and automated prediction of risk. Journal of Medical Internet Research 18, 11 (2016), e300.",
      "doi": ""
    },
    {
      "text": "Jay M Bernhardt and Elizabeth M Felter. 2004. Online pediatric information seeking among mothers of young children: results from a qualitative study using focus groups. Journal of Medical Internet Research 6, 1 (2004), e7. Evaluating Expert Curation in a Baby Milestone Tracking App CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk",
      "doi": ""
    },
    {
      "text": "Diane D Bricker, Jane Squires, and Linda Mounts. 1999. Ages & stages questionnaires: aA parent-completed, child-monitoring system. Paul H. Brookes, Baltimore, Md.",
      "doi": ""
    },
    {
      "text": "Jed R Brubaker, Caitlin Lustig, and Gillian R Hayes. 2010. PatientsLikeMe: empowerment and representation in a patient-centered social network. In CSCW'10; Workshop on research in healthcare: past, present, and future. ACM, New York, NY, USA, 1--5.",
      "doi": ""
    },
    {
      "text": "Jorge Calvillo, Isabel Román, and Laura M Roa. 2015. How technology is empowering patients? A literature review. Health Expectations 18, 5 (2015), 643--652.",
      "doi": ""
    },
    {
      "text": "Joel Chan, Steven Dang, and Steven P Dow. 2016. Improving crowd innovation with expert facilitation. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, San Francisco, CA, USA, 1223--1235.  ",
      "doi": "10.1145/2818048.2820023"
    },
    {
      "text": "Pamela Y Collins, Beverly Pringle, Charlee Alexander, Gary L Darmstadt, Jody Heymann, Gillian Huebner, Vesna Kutlesic, Cheryl Polk, Lorraine Sherr, Andy Shih, Dragana Sretenov, and Mariana Zindel. 2017. Global services and support for children with developmental delays and disabilities: Bridging research and policy gaps. PLoS Medicine 14, 9 (2017), e1002393.",
      "doi": ""
    },
    {
      "text": "Bright Futures Steering Committee, Medical Home Initiatives for Children With Special Needs Project Advisory Committee, et al. 2006. Identifying infants and young children with developmental disorders in the medical home: An algorithm for developmental surveillance and screening. Pediatrics 118, 1 (2006), 405--420.",
      "doi": ""
    },
    {
      "text": "Roberto De Vogli. 2011. Neoliberal globalisation and health in a time of economic crisis. Social Theory & Health 9, 4 (2011), 311--325.",
      "doi": ""
    },
    {
      "text": "Mia Wechsler Doron, Emma Trenti-Paroli, and Dana Wechsler Linden. 2013. Supporting parents in the NICU: A new app from the US, 'MyPreemie': A tool to provide parents of premature babies with support, empowerment, education and participation in their infant's care. Journal of Neonatal Nursing 19, 6 (2013), 303--307.",
      "doi": ""
    },
    {
      "text": "Jodi Dworkin, Jessica Connell, and Jennifer Doty. 2013. A literature review of parents' online behavior. Cyberpsychology: Journal of Psychosocial Research on Cyberspace 7, 2 (2013), article 2.",
      "doi": ""
    },
    {
      "text": "Katherine D Ellingson, Margaret J Briggs-Gowan, Alice S Carter, and Sarah M Horwitz. 2004. Parent identification of early emerging child behavior problems: predictors of sharing parental concern with health providers. Archives of Pediatrics & Adolescent Medicine 158, 8 (2004), 766--772.",
      "doi": ""
    },
    {
      "text": "Kate Ellis-Davies, Elena Sakkalou, Nia C Fowler, Elma E Hilbrink, and Merideth Gattis. 2012. CUE: The continuous unified electronic diary method. Behavior Research Methods 44, 4 (2012), 1063--1078.",
      "doi": ""
    },
    {
      "text": "W Douglas Evans, Lorien C Abroms, Ronald Poropatich, Peter E Nielsen, and Jasmine L Wallace. 2012. Mobile health evaluation methods: the Text4baby case study. Journal of Health Communication 17, sup1 (2012), 22--29.",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention. 2013. Learn the signs. Act early. Program. www.cdc.gov/ActEarly",
      "doi": ""
    },
    {
      "text": "Gramham's Foundation. 2017. MyPreemie. http://grahamsfoundation. org/mypreemie-app/",
      "doi": ""
    },
    {
      "text": "Frances P Glascoe. 2000. Early detection of developmental and behavioral problems. Pediatrics in Review 21, 8 (2000), 272--280.",
      "doi": ""
    },
    {
      "text": "Alba Gutiérrez-Sacristán, Àlex Bravo, Marta Portero-Tresserra, Olga Valverde, Antonio Armario, MC Blanco-Gandía, Adriana Farré, Lierni Fernández-Ibarrondo, Francina Fonseca, Jesús Giraldo, et al. 2017. Text mining and expert curation to develop a database on psychiatric diseases and their genes. Database 2017 (2017), bax043.",
      "doi": ""
    },
    {
      "text": "Joseph F Hagan, Judith S Shaw, and Paula M Duncan. 2007. Bright futures: Guidelines for health supervision of infants, children, and adolescents. Am Acad Pediatrics, USA.",
      "doi": ""
    },
    {
      "text": "Gillian R Hayes, Karen G Cheng, Sen H Hirano, Karen P Tang, Marni S Nagel, and Dianne E Baker. 2014. Estrellita: a mobile capture and access tool for the support of preterm infants and their caregivers. ACM Transactions on Computer-Human Interaction (TOCHI) 21, 3 (2014), 19.  ",
      "doi": "10.1145/2617574"
    },
    {
      "text": "Jeremy Heimans and Henry Timms. 2014. Understanding 'new power'. Harvard Business Review 92, 12 (2014), 48--56.",
      "doi": ""
    },
    {
      "text": "Andreas Holzinger. 2016. Interactive machine learning for health informatics: when do we need the human-in-the-loop? Brain Informatics 3, 2 (2016), 119--131.",
      "doi": ""
    },
    {
      "text": "Voxiva Inc. 2017. Text4Baby?. https://www.text4baby.org/",
      "doi": ""
    },
    {
      "text": "Kaylyn Khoo, Penny Bolt, Franz E Babl, Susan Jury, and Ran D Goldman. 2008. Health information seeking by parents in the Internet age. Journal of Paediatrics and Child Health 44, 7--8 (2008), 419--423.",
      "doi": ""
    },
    {
      "text": "Julie A Kientz, Rosa I Arriaga, and Gregory D Abowd. 2009. Baby steps: evaluation of a system to support record-keeping for parents of young children. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1713--1722.  ",
      "doi": "10.1145/1518701.1518965"
    },
    {
      "text": "Jessica JY Lee, Wyeth W Wasserman, Georg F Hoffmann, Clara DM van Karnebeek, and Nenad Blau. 2018. Knowledge base and mini-expert platform for the diagnosis of inborn errors of metabolism. Genetics in Medicine 20, 1 (2018), 151.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2013. The digitally engaged patient: Self-monitoring and self-care in the digital health era. Social Theory & Health 11, 3 (2013), 256--270.",
      "doi": ""
    },
    {
      "text": "Ben MacNeill. 2017. Trixie Tracker?. https://www.trixietracker.com/",
      "doi": ""
    },
    {
      "text": "Ziad Obermeyer and Ezekiel J Emanuel. 2016. Predicting the futurebig data, machine learning, and clinical medicine. The New England Journal of Medicine 375, 13 (2016), 1216.",
      "doi": ""
    },
    {
      "text": "Lars Plantin and Kristian Daneback. 2009. Parenthood, information and support on the internet. A literature review of research on parents and professionals online. BMC Family Practice 10, 1 (2009), 34.",
      "doi": ""
    },
    {
      "text": "Benjamin L Ranard, Yoonhee P Ha, Zachary F Meisel, David A Asch, Shawndra S Hill, Lance B Becker, Anne K Seymour, and Raina M Merchant. 2014. Crowdsourcing-harnessing the masses to advance health and medicine, a systematic review. Journal of General Internal Medicine 29, 1 (2014), 187--203.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. CHI '14 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems 1 (2014), 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Nina Sand, Michael Silverstein, Frances P Glascoe, Vidya B Gupta, Thomas P Tonniges, and Karen G O'Connor. 2005. Pediatricians' reported practices regarding developmental screening: do guidelines work? Do they help? Pediatrics 116, 1 (2005), 174--179.",
      "doi": ""
    },
    {
      "text": "Steven P Shelov and Robert E Hannemann. 1993. Caring for Your Baby and Young Child: Birth to Age 5. The Complete and Authoritative Guide. Education Resources Information Centre, US.",
      "doi": ""
    },
    {
      "text": "Hyewon Suh, John R Porter, Alexis Hiniker, and Julie A Kientz. 2014. @ BabySteps: design and evaluation of a system for using twitter for tracking children's developmental milestones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, NY, USA, 2279--2288.  ",
      "doi": "10.1145/2556288.2557386"
    },
    {
      "text": "Melanie Swan. 2012. Crowdsourced health research studies: an important emerging complement to clinical trials in the public health research ecosystem. Journal of Medical Internet Research 14, 2 (2012), e46.",
      "doi": ""
    },
    {
      "text": "Anne M Walsh, Kyra Hamilton, Katherine M White, and Melissa K Hyde. 2015. Use of online health information to manage children's health care: a prospective study investigating parental decisions. BMC Health Services Research 15, 1 (2015), 131.",
      "doi": ""
    },
    {
      "text": "Junqing Wang, Aisling Ann O'Kane, Nikki Newhouse, Geraint Rhys Sethu-Jones, and Kaya de Barbaro. 2017. Quantified Baby: Parenting CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk A. Ben-Sasson, E. Ben-Sasson, K. Jacobs, E. Rotman Argaman, and E. Saig and the Use of a Baby Wearable in the Wild. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (2017), 108.  ",
      "doi": "10.1145/3134743"
    },
    {
      "text": "Zhuoran Wang, Anoop D Shah, A Rosemary Tate, Spiros Denaxas, John Shawe-Taylor, and Harry Hemingway. 2012. Extracting diagnoses and investigation results from unstructured text in electronic health records by semi-supervised machine learning. PLoS One 7, 1 (2012), e30412.",
      "doi": ""
    },
    {
      "text": "Kerri Wazny. 2018. Applications of crowdsourcing in health: an overview. Journal of Global Health 8, 1 (2018), 1--20.",
      "doi": ""
    },
    {
      "text": "Paul Wicks, Michael Massagli, Jeana Frost, Catherine Brownstein, Sally Okun, Timothy Vaughan, Richard Bradley, and James Heywood. 2010. Sharing health data for better outcomes on PatientsLikeMe. Journal of Medical Internet Research 12, 2 (2010), e19.",
      "doi": ""
    }
  ]
}