{
  "doi": "10.1145/3290605.3300740",
  "title": "Exploring and Designing for Memory Impairments in Depression",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "Depression is an affective disorder with distinctive autobiographical memory impairments, including negative bias, overgeneralization and reduced positivity. Several clinical therapies address these impairments, and there is an opportunity to develop new supports for treatment by considering depression-associated memory impairments within design. We report on interviews with ten experts in treating depression, with expertise in both neuropsychology and cognitive behavioral therapies. The interviews explore approaches for addressing each of these memory impairments. We found consistent use of positive memories for treating all memory impairments, the challenge of direct retrieval, and the need to support the experience of positive memories. We aim to sensitize HCI researchers to the limitations of memory technologies, broaden their awareness of memory impairments beyond episodic memory recall, and inspire them to engage with this less explored design space. Our findings open up new design opportunities for memory technologies for depression, including positive memory banks for active encoding and selective retrieval, novel cues for supporting generative retrieval, and novel interfaces to strengthen the reliving of positive memories.",
  "tags": [
    "depression",
    "memory impairment",
    "cues",
    "memory technologies"
  ],
  "authors": [
    {
      "name": "Chengcheng Qu",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659333749",
      "orcid": "missing"
    },
    {
      "name": "Corina Sas",
      "institution": "Lancaster University, Lancaster, United Kingdom",
      "img": "/do/10.1145/contrib-81100639942/rel-imgonly/dsc_0976_close_up.jpg",
      "acmid": "81100639942",
      "orcid": "missing"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "Mélissa C. Allé, Liliann Manning, Jevita Potheegadoo, Romain Coutelle, Jean Marie Danion, and Fabrice Berna. 2017. Wearable Cameras Are Useful Tools to Investigate and Remediate Autobiographical Memory Impairment: A Systematic PRISMA Review. Neuropsychol. Rev. 27, 1 (2017), 81--99.",
      "doi": ""
    },
    {
      "text": "Etaba Assigana, Eric Chang, Seungsuk Cho, Vivek Kotecha, Bing Liu, Hannah Turner, Yan Zhang, Michael G Christel, and Scott M Stevens. 2014. TF-CBT Triangle of Life: A Game to Help with Cognitive Behavioral Therapy. Proc. First ACM SIGCHI Annu. Symp. Comput. Interact. Play (2014), 9--16.  ",
      "doi": "10.1145/2658537.2658684"
    },
    {
      "text": "Sairam Balani and Munmun De Choudhury. 2015. Detecting and Characterizing Mental Health Related Self-Disclosure in Social Media. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '15, 1373--1378.  ",
      "doi": "10.1145/2702613.2732733"
    },
    {
      "text": "Matthew Barker and Janet Van der Linden. 2017. Sprite Catcher: A Handheld Self Reflection and Mindfulness Tool for Mental Healthcare. Proc. Tenth Int. Conf. Tangible, Embed. Embodied Interact. - TEI '17 (2017), 419--425.  ",
      "doi": "10.1145/3024969.3025068"
    },
    {
      "text": "Munmun De Choudhury, Scott Counts, and Eric Horvitz. 2013. Social media as a measurement tool of depression in populations. Proc. 5th Annu. ACM Web Sci. Conf. - WebSci '13 (2013), 47--56.  ",
      "doi": "10.1145/2464464.2464480"
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering Shifts to Suicidal Ideation from Mental Health Content in Social Media. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 2098--2110.  ",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Martin. A. Conway. 2001. Sensory-perceptual episodic memory and its context: Autobiographical memory. In Philosophical Transactions of the Royal Society B: Biological Sciences, 1375--1384.",
      "doi": ""
    },
    {
      "text": "Martin A Conway. 2005. Memory and the self. Journal of Memory and Language 53, 594--628.",
      "doi": ""
    },
    {
      "text": "David Coyle and Gavin Doherty. 2009. Clinical Evaluations and Collaborative Design: Developing New Technologies for Mental Healthcare Interventions. Proc. SIGCHI Conf. Hum. Factors Comput. Syst. CHI'09 (2009), 2051--2060.  ",
      "doi": "10.1145/1518701.1519013"
    },
    {
      "text": "David Coyle, Gavin Doherty, Mark Matthews, and John Sharry. 2007. Computers in talk-based mental health interventions. Interact. Comput. 19, 4 (2007), 545--562.  ",
      "doi": "10.1016/j.intcom.2007.02.001"
    },
    {
      "text": "David Coyle, Nicola McGlade, Gavin Doherty, and Gary O'Reilly. 2011. Exploratory evaluations of a computer game supporting cognitive behavioural therapy for adolescents. Proc. 2011 Annu. Conf. Hum. factors Comput. Syst. - CHI '11 (2011), 2937--2946.  ",
      "doi": "10.1145/1978942.1979378"
    },
    {
      "text": "Martín Cammarota Cristiano A.Köhler, André F. Carvalho, Gilberto S. Alves, Roger S. McIntyre, Thomas N. Hyphantis. 2015. AutobiographicalMemory Disturbances in Depression: A Novel Therapeutic Target? Neural Plast. 2015, (2015), 1--14.",
      "doi": ""
    },
    {
      "text": "Tim Dalgleish and Aliza Werner-Seidler. 2014. Disruptions in autobiographical memory processing in depression and the emergence of memory therapeutics. Trends Cogn. Sci. 18, 11 (2014), 596--604.",
      "doi": ""
    },
    {
      "text": "Claudia Daudén Roquet and Corina Sas. 2018. Evaluating Mindfulness Meditation Apps. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, 1--6.  ",
      "doi": "10.1145/3170427.3188616"
    },
    {
      "text": "Karen F. Dearing and Ian H. Gotlib. 2009. Interpretation of ambiguous information in girls at risk for depression. J. Abnorm. Child Psychol. 37, 1 (2009), 79--91.",
      "doi": ""
    },
    {
      "text": "Lina Dib, Daniela Petrelli, and Steve Whittaker. 2010. Sonic souvenirs: exploring the paradoxes of recorded sound for family remembering. Proc. 2010 ACM Conf. Comput. Support. Coop. Work. CSCW'10 (2010), 391--400.  ",
      "doi": "10.1145/1718918.1718985"
    },
    {
      "text": "Gavin Doherty, David Coyle, and John Sharry. 2012. Engagement with online mental health interventions. Proc. 2012 ACM Annu. Conf. Hum. Factors Comput. Syst. - CHI '12 (2012), 1421--1430.  ",
      "doi": "10.1145/2207676.2208602"
    },
    {
      "text": "Kevin Doherty and Gavin Doherty. 2018. The construal of experience in HCI: Understanding self-reports. Int. J. Hum. Comput. Stud. 110, (2018), 63--74.  ",
      "doi": "10.1016/j.ijhcs.2017.10.006"
    },
    {
      "text": "Edward R. Watkins, Rod Taylor, Richard Byng, Celine B. Baeyens, Rebecca Read, Katherine A. Pearson. 2012. Guided self-help concreteness training as an intervention for major depression in primary care: a Phase II randomized controlled trial. Psychol. Med. 42, 07 (2012), 1359--1371.",
      "doi": ""
    },
    {
      "text": "Gunther Eysenbach. 2005. The Law of Attrition. J. Med. INTERNET Res. 7, 1 (2005), 1.",
      "doi": ""
    },
    {
      "text": "Jennifer Fereday and Eimear Muir-Cochrane. 2006. Demonstrating Rigor Using Thematic Analysis: A Hybrid Approach of Inductive and Deductive Coding and Theme Development. Int. J. Qual. Methods 5, 1 (2006), 80--92.",
      "doi": ""
    },
    {
      "text": "Kathleen Kara Fitzpatrick, Alison Darcy, and Molly Vierhile. 2017. Delivering Cognitive Behavior Therapy to Young Adults With Symptoms of Depression and Anxiety Using a Fully Automated Conversational Agent (Woebot): A Randomized Controlled Trial. JMIR Ment. Heal. 4, 2 (2017), e19.",
      "doi": ""
    },
    {
      "text": "Michael L. Free. 2008. Cognitive Therapy in Groups: Guidelines and Resources for Practice, Second Edition.",
      "doi": ""
    },
    {
      "text": "Morgan Harvey, Marc Langheinrich, and Geoff Ward. 2015. Remembering through lifelogging: A survey of human memory augmentation. Pervasive Mob. Comput. 27, (2015), 14--26.  ",
      "doi": "10.1016/j.pmcj.2015.12.002"
    },
    {
      "text": "Caitlin Hitchcock, Aliza Werner-Seidler, Simon E. Blackwell, and Tim Dalgleish. 2017. Autobiographical episodic memory-based training for the treatment of mood, anxiety and stress-related disorders: A systematic review and meta-analysis. Clin. Psychol. Rev. 52, (2017), 92--107.",
      "doi": ""
    },
    {
      "text": "Steve Hodges, Emma Berry, and Ken Wood. 2011. SenseCam: A wearable camera that stimulates and rehabilitates autobiographical memory. Memory 19, 7 (2011), 685--696.",
      "doi": ""
    },
    {
      "text": "Elise van den Hoven and Berry Eggen. 2008. Informing augmented memory system design through autobiographical memory theory. Pers. Ubiquitous Comput. 12, 6 (2008), 433--443.  ",
      "doi": "10.1007/s00779-007-0177-9"
    },
    {
      "text": "Elise Van Den Hoven, Corina Sas, and Steve Whittaker. 2012. Introduction to this special issue on designing for personal memories: Past, present, and future. Human-Computer Interact. 27, 1--2 (2012), 1--12.",
      "doi": ""
    },
    {
      "text": "Sky Tien-yun Huang and Chloe Mun Yee Kwan. 2014. The Moment: a mobile tool for people with depression or bipolar disorder. In International Conference on Ubiquitous Computing- UbiComp '14, 235--238.  ",
      "doi": "10.1145/2638728.2638784"
    },
    {
      "text": "Nigel Davies. Huy Viet Le, Sarah Clinch, Corina Sas, Tilman Dingler, Niels Henze. 2016. Impact of Video Summary Viewing on Episodic Memory Recall. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 4793--4805.  ",
      "doi": "10.1145/2858036.2858413"
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes From the Past?: How Technology Mediated Reflection Improves Well-Being. Proc. SIGCHI Conf. Hum. Factors Comput. Syst. -CHI '13 (2013), 1071--1080. DOI:https://doi.org/bhqm  ",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Marije Kanis and Willem Paul Brinkman. 2010. Making mundane pleasures visible: Mediating daily likings with lightweight technology. Pers. Ubiquitous Comput. 14, 3 (2010), 261--269.  ",
      "doi": "10.1007/s00779-009-0256-1"
    },
    {
      "text": "Artie Konrad, Simon Tucker, John Crane, and Steve Whittaker. 2016. Technology and Reflection: Mood and Memory Mechanisms for Well-Being. Psychol. Well. Being. 6, 1 (2016), 5.",
      "doi": ""
    },
    {
      "text": "Kees Korrelboom, Martie de Jong, Irma Huijbrechts, and Peter Daansen. 2009. Competitive Memory Training (COMET) for Treating Low Self-Esteem in Patients With Eating Disorders: A Randomized Clinical Trial. J. Consult. Clin. Psychol. 77, 5 (2009), 974--980.",
      "doi": ""
    },
    {
      "text": "Matthew L. Lee and Anind K. Dey. 2007. Capture & Access Lifelogging Assistive Technology for People with Episodic Memory Impairment Non-technical Solutions. Work. Intell. Syst. Assist. Cogn. (2007), 1--9.",
      "doi": ""
    },
    {
      "text": "Matthew L. Lee and Anind K. Dey. 2008. Lifelogging memory appliance for people with episodic memory impairment. Proc. 10th Int. Conf. Ubiquitous Comput. - UbiComp '08 (2008), 44--53.  ",
      "doi": "10.1145/1409635.1409643"
    },
    {
      "text": "Lydia Manikonda and Munmun De Choudhury. 2017. Modeling and Understanding Visual Attributes of Mental Health Disclosures in Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17, 170--181.  ",
      "doi": "10.1145/3025453.3025932"
    },
    {
      "text": "Mark Matthews and Gavin Doherty. 2011. In the mood: Engaging teenagers in psychotherapy using mobile phones. Chi 2011 (2011), 2947--2956.  ",
      "doi": "10.1145/1978942.1979379"
    },
    {
      "text": "Kendal L Maxwell and Jennifer Callahan. 2013. MEmory Specificity Training ( MEST ) for Group Treatment of Posttraumatic Stress Disorder Therapist ' s Manual.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2005. Putting \"felt-life\" at the centre of human-computer interaction (HCI). Cogn. Technol. Work 7, 4 (2005), 262--271.  ",
      "doi": "10.1007/s10111-005-0011-y"
    },
    {
      "text": "Ine Mols, Elise van den Hoven, and Berry Eggen. 2016. Informing Design for Reflection: an Overview of Current Everyday Practices. Proc. 9th Nord. Conf. Human-Computer Interact. - Nord. '16 (2016), 1--10.  ",
      "doi": "10.1145/2971485.2971494"
    },
    {
      "text": "Heather S. Packer, Ash Smith, and Paul Lewis. 2012. MemoryBook: Generating Narratives from Lifelogs. Proc. 2nd Work. Narrat. hypertext - NHT '12 (2012), 7.  ",
      "doi": "10.1145/2310076.2310079"
    },
    {
      "text": "James W. Pennebaker. 2017. Expressive Writing in Psychological Science. Perspect. Psychol. Sci. 13, 2 (2017), 226--229.",
      "doi": ""
    },
    {
      "text": "Daniela Petrelli, Elise van den Hoven, and Steve Whittaker. 2009. Making history: Intentional Capture of Future Memories. Proc. 27th Int. Conf. Hum. factors Comput. Syst. - CHI 09 April (2009), 1723.  ",
      "doi": "10.1145/1518701.1518966"
    },
    {
      "text": "Chengcheng Qu and Corina Sas. 2018. Exploring Memory Interventions in Depression through Lifelogging Lens. In Proceedings of British HCI 2018, In press.  ",
      "doi": "10.14236/ewic/HCI2018.161"
    },
    {
      "text": "Filip Raes, J. Mark G. Williams, and Dirk Hermans. 2009. Reducing cognitive vulnerability to depression: A preliminary investigation of MEmory Specificity Training (MEST) in inpatients with depressive symptomatology. J. Behav. Ther. Exp. Psychiatry 40, 1 (2009), 24--38.",
      "doi": ""
    },
    {
      "text": "Stefan Rennick-Egglestone, Sarah Knowles, Gill Toms, Penny Bee, Karina Lovell, and Peter Bower. 2016. Health Technologies \"In the Wild\": Experiences of Engagement with Computerised CBT. Proc. 2016 CHI Conf. Hum. Factors Comput. Syst. CHI'16 (2016), 2124--2135.  ",
      "doi": "10.1145/2858036.2858128"
    },
    {
      "text": "Pedro Sanches, Pavel Karpashevich, Gavin Doherty, Axel Janson, Charles Windlin, Corina Sas, Camille Nadal, and Kristina Höök. 2019. HCI and Affective Health. Taking stock of a decade of studies and charting future research directions. In Conference on Human Factors in Computing Systems -CHI'19, In press.  ",
      "doi": "10.1145/3290605.3300475"
    },
    {
      "text": "Corina Sas. 2018. Exploring Self-Defining Memories in Old Age and their Digital Cues. Proc. 2018 Des. Interact. Syst. Conf. DIS'18 June 2018 (2018), 149--161.  ",
      "doi": "10.1145/3196709.3196767"
    },
    {
      "text": "Corina Sas, Scott Challioner, Christopher Clarke, Ross Wilson, Alina Coman, Sarah Clinch, Mike Harding, and Nigel Davies. 2015. Self-Defining Memory Cues: Creative Expression and Emotional Meaning. Ext. Abstr. ACM CHI'15 Conf. Hum. Factors Comput. Syst. 2, (2015), 2013--2018.  ",
      "doi": "10.1145/2702613.2732842"
    },
    {
      "text": "Corina Sas, Alan Dix, Nigel Davies, and Adrian Friday. 2006. Capturing and sharing war memories. In In CHI'06: Human factors in computing systems, Workshop on\" Designing for collective remembering.",
      "doi": ""
    },
    {
      "text": "Corina Sas and Matthew Rees. 2013. AffectCam?: Arousal -- Augmented SenseCam for Richer Recall of Episodic Memories. (2013), 1041--1046.  ",
      "doi": "10.1145/2468356.2468542"
    },
    {
      "text": "Corina Sas, Shuang Ren, Alina Coman, Sarah Clinch, and Nigel Davies. 2016. Life Review in End of Life Care. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA '16, 2947--2953.  ",
      "doi": "10.1145/2851581.2892491"
    },
    {
      "text": "Abigail J. Sellen and Steve Whittaker. 2010. Beyond total capture: A Constructive Critique of Lifelogging. Commun. ACM 53, 5 (2010), 70--77.  ",
      "doi": "10.1145/1735223.1735243"
    },
    {
      "text": "Anna Ståhl, Kristina Höök, Martin Svensson, Alex S. Taylor, and Marco Combetto. 2009. Experiencing the affective diary. Pers. Ubiquitous Comput. 13, 5 (2009), 365--378.  ",
      "doi": "10.1007/s00779-008-0202-7"
    },
    {
      "text": "Molly M. Stevens, Gregory D. Abowd, Khai N. Truong, and Florian Vollmer. 2003. Getting intothe Living Memory Box: Family archives & holistic design. Pers. Ubiquitous Comput. 7, 3--4 (2003), 210--216.  ",
      "doi": "10.1007/s00779-003-0220-4"
    },
    {
      "text": "Emily A. Holmes Tamara J. Lang, Simon E. Blackwell, Catherine J. Harmer, Phil Davison. 2012. Cognitive Bias Modification Using Mental Imagery for Depression: Developing a Novel Computerized Intervention to Change Negative Thinking Styles. Personal. Inf. Process. 26, 2 (2012), 87--189.",
      "doi": ""
    },
    {
      "text": "Sho Tsugawa, Yusuke Kikuchi, Fumio Kishino, Kosuke Nakajima, Yuichi Itoh, and Hiroyuki Ohsaki. 2015. Recognizing Depression from Twitter Activity. Proc. 33rd Annu. ACM Conf. Hum. Factors Comput. Syst. - CHI '15 (2015), 3187--3196.  ",
      "doi": "10.1145/2702123.2702280"
    },
    {
      "text": "L. A. Watson, D. Berntsen, W. Kuyken, and E. R. Watkins. 2013. Involuntary and voluntary autobiographical memory specificity as a function of depression. J. Behav. Ther. Exp. Psychiatry 44, 1 (2013), 7--13.",
      "doi": ""
    },
    {
      "text": "J Mark G Williams, Thorsten Barnhofer, Catherine Crane, Dirk Herman, Filip Raes, Ed Watkins, and Tim Dalgleish. 2007. Autobiographical memory specificity and emotional disorder. Psychol. Bull. 133, 1 (January 2007), 122--48.",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Takashi Kudo, Eiji Aramaki, and Kazuki Hattori. 2017. Changing Moods: How Manual Tracking by Family Caregivers Improves Caring and Family Communication. Proc. SIGCHI Conf. Hum. Factors Comput. Syst. -CHI '17 (2017), 158--169.  ",
      "doi": "10.1145/3025453.3025843"
    },
    {
      "text": "Extract from the CBT and Feeling Good. Retrieved September 21, 2018 from https://iveronicawalsh.files.wordpress.com/2012/06/cbtafg_abcdextract_handout.pdf",
      "doi": ""
    },
    {
      "text": "Using the Feelings Wheel | Art It Out Therapy Center | Therapy | Atlanta | East Cobb | Buckhead. Retrieved September 21, 2018 from https://www.artitout.com/single-post/2014/12/04/Using-the-Feelings-Wheel",
      "doi": ""
    }
  ]
}