{
  "doi": "10.1145/3290605.3300786",
  "title": "Evaluating Pan and Zoom Timelines and Sliders",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Pan and zoom timelines and sliders help us navigate large time series data. However, designing efficient interactions can be difficult. We study pan and zoom methods via crowd-sourced experiments on mobile and computer devices, asking which designs and interactions provide faster target acquisition. We find that visual context should be limited for low-distance navigation, but added for far-distance navigation; that timelines should be oriented along the longer axis, especially on mobile; and that, as compared to default techniques, double click, hold, and rub zoom appear to scale worse with task difficulty, whereas brush and especially ortho zoom seem to scale better. Software and data used in this research are available as open source.",
  "tags": [
    "multiscale",
    "mobile",
    "evaluation",
    "interaction",
    "zoom",
    "touch"
  ],
  "authors": [
    {
      "name": "Michail Schwab",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659093753",
      "orcid": "missing"
    },
    {
      "name": "Sicheng Hao",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366183",
      "orcid": "missing"
    },
    {
      "name": "Olga Vitek",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81485643294",
      "orcid": "missing"
    },
    {
      "name": "James Tompkin",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/do/10.1145/contrib-81453653111/rel-imgonly/img_1286_crop.jpg",
      "acmid": "81453653111",
      "orcid": "0000-0003-2218-2899"
    },
    {
      "name": "Jeff Huang",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659135891",
      "orcid": "0000-0002-3453-5666"
    },
    {
      "name": "Michelle A. Borkin",
      "institution": "Northeastern University, Boston, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585455",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Christopher Ahlberg and Ben Shneiderman. 1994. The Alphaslider: A Compact and Rapid Selector. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '94). ACM, New York, NY, USA, 365--371.  ",
      "doi": "10.1145/191666.191790"
    },
    {
      "text": "Caroline Appert and Jean-Daniel Fekete. 2006. OrthoZoom Scroller: 1D Multi-scale Navigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 21--30.  ",
      "doi": "10.1145/1124772.1124776"
    },
    {
      "text": "Ravin Balakrishnan. 2004. \"Beating\" Fitts' Law: Virtual Enhancements for Pointing Facilitation. Int. J. Hum.-Comput. Stud. 61, 6 (Dec. 2004), 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Benjamin B. Bederson and James D. Hollan. 1994. Pad++: A Zooming Graphical Interface for Exploring Alternate Interface Physics. In Proceedings of the 7th Annual ACM Symposium on User Interface Software and Technology (UIST '94). ACM, New York, NY, USA, 17--26.  ",
      "doi": "10.1145/192426.192435"
    },
    {
      "text": "Matthew Brehmer, Bongshin Lee, Benjamin Bach, Nathalie Henry Riche, and Tamara Munzner. 2017. Timelines Revisited: A Design Space and Considerations for Expressive Storytelling. IEEE Transactions on Visualization and Computer Graphics 23, 9 (Sept 2017), 2151--2164.",
      "doi": "10.1109/TVCG.2016.2614803"
    },
    {
      "text": "Matthew Brehmer, Bongshin Lee, Petra Isenberg, and Eun K. Choe. 2019. Visualizing Ranges over Time on Mobile Phones: A Task-Based Crowdsourced Evaluation. IEEE Transactions on Visualization and Computer Graphics 25, 1 (January 2019), 619--629.",
      "doi": "10.1109/TVCG.2018.2865234"
    },
    {
      "text": "Matthew Brehmer and Tamara Munzner. 2013. A Multi-Level Typology of Abstract Visualization Tasks. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec 2013), 2376--2385.  ",
      "doi": "10.1109/TVCG.2013.124"
    },
    {
      "text": "Andy Cockburn, Amy Karlson, and Benjamin B. Bederson. 2009. A Review of Overview+Detail, Zooming, and Focus+Context Interfaces. ACM Comput. Surv. 41, 1, Article 2 (Jan. 2009), 31 pages.  ",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Raimund Dachselt and Markus Weiland. 2006. TimeZoom: A Flexible Detail and Context Timeline. In CHI '06 Extended Abstracts on Human Factors in Computing Systems (CHI EA '06). ACM, New York, NY, USA, 682--687.  ",
      "doi": "10.1145/1125451.1125590"
    },
    {
      "text": "Leah Findlater, Joan Zhang, Jon E. Froehlich, and Karyn Moffatt. 2017. Differences in Crowdsourced vs. Lab-based Mobile and Desktop Input Performance Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 6813--6824.  ",
      "doi": "10.1145/3025453.3025820"
    },
    {
      "text": "Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of experimental psychology 47, 6 (June 1954), 381--391.",
      "doi": ""
    },
    {
      "text": "George W. Furnas and Benjamin B. Bederson. 1995. Spacescale Diagrams: Understanding Multiscale Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM, New York, NY, USA, 234--241.  ",
      "doi": "10.1145/223904.223934"
    },
    {
      "text": "George W. Furnas and Xiaolong Zhang. 1998. MuSE: A Multiscale Editor. In Proceedings of the 11th Annual ACM Symposium on User Interface Software and Technology (UIST '98). ACM, New York, NY, USA, 107--116.  ",
      "doi": "10.1145/288392.288579"
    },
    {
      "text": "Krzysztof Z. Gajos, Katharina Reinecke, and Charles Herrmann. 2012. Accurate Measurements of Pointing Performance from In Situ Observations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 3157--3166.  ",
      "doi": "10.1145/2207676.2208733"
    },
    {
      "text": "Yves Guiard and Michel Beaudouin-Lafon. 2004. Target acquisition in multiscale electronic worlds. International Journal of Human-Computer Studies 61,6(2004),875--905.  ",
      "doi": "10.1016/j.ijhcs.2004.09.005"
    },
    {
      "text": "Chris Harrison and Anind K. Dey. 2008. Lean and Zoom: Proximity-aware User Interface and Content Magnification. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 507--510.  ",
      "doi": "10.1145/1357054.1357135"
    },
    {
      "text": "Ken Hinckley and Hyunyoung Song. 2011. Sensor Synaesthesia: Touch in Motion, and Motion in Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 801--810.  ",
      "doi": "10.1145/1978942.1979059"
    },
    {
      "text": "Kasper Hornbæk, Benjamin B. Bederson, and Catherine Plaisant. 2002. Navigation Patterns and Usability of Zoomable User Interfaces with and Without an Overview. Transactions on Computer-Human Interaction 9, 4 (Dec. 2002), 362--389.  ",
      "doi": "10.1145/586081.586086"
    },
    {
      "text": "Takeo Igarashi and Ken Hinckley. 2000. Speed-dependent Automatic Zooming for Browsing Large Documents. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology (UIST '00). ACM, New York, NY, USA, 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "ScientiaMobile Inc. 2017. Smartphone vs Tablet Orientation: Who's Using What? https://www.scientiamobile.com/page/ smartphone-vs-tablet-orientation-whos-using-what. Accessed: March 30, 2018.",
      "doi": ""
    },
    {
      "text": "Waqas Javed, Sohaib Ghani, and Niklas Elmqvist. 2012. GravNav: Using aGravityModelforMulti-scaleNavigation.InProceedingsoftheInternational Working Conference on Advanced Visual Interfaces (AVI '12). ACM, New York, NY, USA, 217--224.  ",
      "doi": "10.1145/2254556.2254597"
    },
    {
      "text": "Neel Joshi, Abhishek Kar, and Michael Cohen. 2012. Looking at You: Fused Gyro and Face Tracking for Viewing Large Imagery on Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, New York, NY, USA, 2211--2220.  ",
      "doi": "10.1145/2207676.2208375"
    },
    {
      "text": "Susanne Jul and George W. Furnas. 1998. Critical Zones in Desert Fog: Aids to Multiscale Navigation. In Proceedings of the 11th Annual ACM Symposium on User Interface Software and Technology (UIST '98). ACM, New York, NY, USA, 97--106.  ",
      "doi": "10.1145/288392.288578"
    },
    {
      "text": "Myron W. Krueger, Thomas Gionfriddo, and Katrin Hinrichsen. 1985. VIDEOPLACE - an Artificial Reality. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '85). ACM, New York, NY, USA, 35--40.  ",
      "doi": "10.1145/317456.317463"
    },
    {
      "text": "Knight Lab. {n. d.}. TimelineJS. http://timeline.knightlab.com/",
      "doi": ""
    },
    {
      "text": "I. Scott Mackenzie. 1989. A Note on the Information-Theoretic Basis for Fitts' Law. Journal of Motor Behavior 21, 3 (1989), 323--330.",
      "doi": ""
    },
    {
      "text": "Sylvain Malacria, Eric Lecolinet, and Yves Guiard. 2010. Clutch-free Panning and Integrated Pan-zoom Control on Touch-sensitive Surfaces: The Cyclostar Approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 2615--2624.  ",
      "doi": "10.1145/1753326.1753724"
    },
    {
      "text": "Toshiyuki Masui, Kouichi Kashiwagi, and George R. Borden, IV. 1995. Elastic Graphical Interfaces to Precise Data Manipulation. In Conference Companion on Human Factors in Computing Systems (CHI '95). ACM, New York, NY, USA, 143--144.  ",
      "doi": "10.1145/223355.223471"
    },
    {
      "text": "George A. Miller. 1956. The magical number seven, plus or minus two: some limits on our capacity for processing information. Psychological review 63, 2 (1956), 81--97.",
      "doi": ""
    },
    {
      "text": "Mathieu Nancel, Julie Wagner, Emmanuel Pietriga, Olivier Chapuis, and Wendy Mackay. 2011. Mid-air Pan-and-zoom on Wall-sized Displays. In Proceedings of the SIGCHI Conference on Human Factors CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk M. Schwab et al. in Computing Systems (CHI '11). ACM, New York, NY, USA, 177--186.  ",
      "doi": "10.1145/1978942.1978969"
    },
    {
      "text": "Alex Olwal, Steven Feiner, and Susanna Heyman. 2008. Rubbing and Tapping for Precise and Rapid Selection on Touch-screen Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 295--304.  ",
      "doi": "10.1145/1357054.1357105"
    },
    {
      "text": "Ken Perlin and David Fox. 1993. Pad: An Alternative Approach to the Computer Interface. In Proceedings of the 20th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '93). ACM, New York, NY, USA, 57--64.  ",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "William Playfair. 1786. The Commercial and Political Atlas and Statistical Breviary.",
      "doi": ""
    },
    {
      "text": "Stuart Pook, Eric Lecolinet, Guy Vaysseix, and Emmanuel Barillot. 2000. Context and Interaction in Zoomable User Interfaces. In Proceedings of the Working Conference on Advanced Visual Interfaces (AVI '00). ACM, New York, NY, USA, 227--231.  ",
      "doi": "10.1145/345513.345323"
    },
    {
      "text": "Philip Quinn, Sylvain Malacria, and Andy Cockburn. 2013. Touch Scrolling Transfer Functions. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13). ACM, New York, NY, USA, 61--70.  ",
      "doi": "10.1145/2501988.2501995"
    },
    {
      "text": "Daniel Rosenberg and Anthony Grafton. 2010. Cartographies of Time: A History of the Timeline. Princeton Architectural Press.",
      "doi": ""
    },
    {
      "text": "Michail Schwab, James Tompkin, Jeff Huang, and Michelle A. Borkin. 2018. EasyPZ.js: Simple & Extendable Pan & Zoom JS Library for Mobile & Desktop. Instructions for use at https://easypz.io.",
      "doi": ""
    },
    {
      "text": "Martin Spindler, Martin Schuessler, Marcel Martsch, and Raimund Dachselt. 2014. Pinch-drag-flick vs. Spatial Input: Rethinking Zoom & Pan on Mobile Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 1113--1122.  ",
      "doi": "10.1145/2556288.2557028"
    },
    {
      "text": "Jarke J. Van Wijk and Wim A. A. Nuij. 2003. Smooth and Efficient Zooming and Panning. In Proceedings of the Ninth Annual IEEE Conference on Information Visualization (INFOVIS'03). IEEE Computer Society, Washington, DC, USA, 15--22. ",
      "doi": "10.5555/1947368.1947376"
    },
    {
      "text": "Colin Ware and Marlon Lewis. 1995. The DragMag Image Magnifier. In Conference Companion on Human Factors in Computing Systems (CHI '95). ACM, New York, NY, USA, 407--408.  ",
      "doi": "10.1145/223355.223749"
    }
  ]
}