{
  "doi": "10.1145/3290605.3300422",
  "title": "Ranked-List Visualization: A Graphical Perception Study",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Visualization of ranked lists is a common occurrence, but many in-the-wild solutions fly in the face of vision science and visualization wisdom. For example, treemaps and bubble charts are commonly used for this purpose, despite the fact that the data is not hierarchical and that length is easier to perceive than area. Furthermore, several new visual representations have recently been suggested in this area, including wrapped bars, packed bars, piled bars, and Zvinca plots. To quantify the differences and trade-offs for these ranked-list visualizations, we here report on a crowdsourced graphical perception study involving six such visual representations, including the ubiquitous scrolled barchart, in three tasks: ranking (assessing a single item), comparison (two items), and average (assessing global distribution). Results show that wrapped bars may be the best choice for visualizing ranked lists, and that treemaps are surprisingly accurate despite the use of area rather than length to represent value.",
  "tags": [
    "data visualization",
    "ranked lists",
    "graphical perception"
  ],
  "authors": [
    {
      "name": "Pranathi Mylavarapu",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366344",
      "orcid": "missing"
    },
    {
      "name": "Adil Yalcin",
      "institution": "Keshif, LLC., Alexandria, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367189",
      "orcid": "missing"
    },
    {
      "name": "Xan Gregg",
      "institution": "SAS Institute, Inc., Cary, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365512",
      "orcid": "missing"
    },
    {
      "name": "Niklas Elmqvist",
      "institution": "University of Maryland, College Park, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81100015408/rel-imgonly/niklas_elmqvist_-_2019.jpg",
      "acmid": "81100015408",
      "orcid": "0000-0001-5805-5301"
    }
  ],
  "references": [
    {
      "text": "Jacques Bertin. 1983. Semiology of Graphics. University of Wisconsin Press, Madison, Wisconsin. ",
      "doi": "10.5555/1095597"
    },
    {
      "text": "Mark Bruls, Kees Huizing, and Jarke J. van Wijk. 2000. Squarified Treemaps. In Proceedings of the Joint Eurographics/IEEE VGTC Symposium on Visualization. Eurographics Association, Geneva, Switzerland, 33--42.",
      "doi": ""
    },
    {
      "text": "William S. Cleveland. 1994. Visualizing Data. Hobart Press, Summit, NJ, USA. ",
      "doi": "10.5555/529269"
    },
    {
      "text": "William S. Cleveland and Robert McGill. 1984. Graphical Perception: Theory, Experimentation and Application to the Development of Graphical Methods. J. Amer. Statist. Assoc. 79, 387 (Sept. 1984), 531--554.",
      "doi": ""
    },
    {
      "text": "Frederick E. Croxton and Harold Stein. 1932. Graphic Comparisons by Bars, Squares, Circles, and Cubes. J. Amer. Statist. Assoc. 27, 177 (1932), 54--60.",
      "doi": ""
    },
    {
      "text": "Frederick E. Croxton and Roy E. Stryker. 1927. Bar charts versus circle diagrams. J. Amer. Statist. Assoc. 22, 160 (1927), 473--482.",
      "doi": ""
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair Statistical Communication in HCI. In Modern Statistical Methods for HCI, Judy Robertson and Maurits Kaptein (Eds.). Springer, Berlin, Heidelberg, Germany, 291--330.",
      "doi": ""
    },
    {
      "text": "Walter C. Eells. 1926. The relative merits of circles and bars for representing component parts. J. Amer. Statist. Assoc. 21, 154 (1926), 119--132.",
      "doi": ""
    },
    {
      "text": "Bradley Efron. 1992. Bootstrap methods: another look at the jackknife. In Breakthroughs in Statistics. Springer, Berlin, Heidelberg, Germany, 569--593.",
      "doi": ""
    },
    {
      "text": "Steven Few. 2013. Wrapping Graphs to Extend Their Limits. https://www.perceptualedge.com/articles/visual_business_ intelligence/wrapping_graphs_to_extend_their_limits.pdf. In Visual Business Intelligence Newsletter.",
      "doi": ""
    },
    {
      "text": "Stephen Few. 2017. The Journey to Zvinca. https://www. perceptualedge.com/articles/visual_business_intelligence/journey_ to_zvinca.pdf. In Visual Business Intelligence Newsletter.",
      "doi": ""
    },
    {
      "text": "Paul J. FitzPatrick. 1960. Leading British Statisticians of the Nineteenth Century. J. Amer. Statist. Assoc. 55, 289 (March 1960), 38--70.",
      "doi": ""
    },
    {
      "text": "Michael Friendly. 2007. A Brief History of Data Visualization. In Handbook of Computational Statistics: Data Visualization, Vol. III. Springer, 15--56.",
      "doi": ""
    },
    {
      "text": "Xan Gregg. 2017. Introducing packed bars, a new chart form. https://community.jmp.com/t5/JMP-Blog/ Introducing-packed-bars-a-new-chart-form/ba-p/39972.",
      "doi": ""
    },
    {
      "text": "Xan Gregg. 2017. Introducing the Packed Bars Chart Type. In Poster Proceedings of IEEE VIS.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using Mechanical Turk to assess visualization design. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 203--212.  ",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Jeffrey Heer, Nicholas Kong, and Maneesh Agrawala. 2009. Sizing the horizon: the effects of chart size and layering on the graphical perception of time series visualization. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1303--1312.  ",
      "doi": "10.1145/1518701.1518897"
    },
    {
      "text": "Weidong Huang, Peter Eades, and Seok-Hee Hong. 2008. Beyond time and error: a cognitive approach to the evaluation of graph drawings. In Proceedings of BELIV. 1--8.  ",
      "doi": "10.1145/1377966.1377970"
    },
    {
      "text": "Waqas Javed, Bryan McDonnel, and Niklas Elmqvist. 2010. Graphical perception of multiple time series. IEEE Transactions on Visualization and Computer Graphics 16, 6 (2010), 927--934.  ",
      "doi": "10.1109/TVCG.2010.162"
    },
    {
      "text": "Brian Johnson and Ben Shneiderman. 1991. Tree-Maps: A Space-Filling Approach to the Visualization of Hierarchical Information Structures. In Proceedings of the IEEE Conference on Visualization. IEEE, Piscataway, NJ, USA, 284--291. ",
      "doi": "10.5555/949607.949654"
    },
    {
      "text": "Gerald L. Lohse. 1993. A cognitive model for understanding graphical perception. Human-Computer Interaction 8, 4 (1993), 353--388.  ",
      "doi": "10.1207/s15327051hci0804_3"
    },
    {
      "text": "Jerry Lohse. 1991. A Cognitive Model for the Perception and Understanding of Graphs. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 137--144.  ",
      "doi": "10.1145/108844.108865"
    },
    {
      "text": "Deok Gun Park, Steven M. Drucker, Roland Fernandez, and Niklas Elmqvist. 2018. ATOM: A Grammar for Unit Visualization. IEEE Transactions on Visualization & Computer Graphics 24, 12 (2018), 3032-- 3043.",
      "doi": ""
    },
    {
      "text": "Lewis V. Peterson and Wilbur Schramm. 1954. How accurately are different kinds of graphs read? Educational Technology Research and Development 2, 3 (June 1954), 178--189.",
      "doi": ""
    },
    {
      "text": "William Playfair. 1786. The Commercial and Political Atlas: Representing, by Means of Stained Copper-Plate Charts, the Progress of the Commerce, Revenues, Expenditure and Debts of England during the Whole of the Eighteenth Century.",
      "doi": ""
    },
    {
      "text": "Joel Ross, Lilly Irani, M. Six Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who are the crowdworkers?: shifting demographics in Mechanical Turk. In Extended Abstracts of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2863--2872.  ",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "David Simkin and Reid Hastie. 1987. An Information-Processing Analysis of Graph Perception. J. Amer. Statist. Assoc. 82, 398 (June 1987), 454--465.",
      "doi": ""
    },
    {
      "text": "Weixin Wang, Hui Wang, Guozhong Dai, and Hongan Wang. 2006. Visualization of large hierarchical data by circle packing. In Proceedings of the ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 517--520.  ",
      "doi": "10.1145/1124772.1124851"
    },
    {
      "text": "Mehmet Adil Yalçn, Niklas Elmqvist, and Benjamin B Bederson. 2017. Piled Bars: Dense Visualization of Numeric Data. In Poster Proceedings of the Graphics Interface Conference.",
      "doi": ""
    },
    {
      "text": "Mehmet Adil Yalçin, Niklas Elmqvist, and Benjamin B. Bederson. 2017. Raising the Bars: Evaluating Treemaps vs. Wrapped Bars for Dense Visualization of Sorted Numeric Data. In Proceedings of the Graphics Interface Conference. ACM, New York, NY, USA, 41--49. ",
      "doi": "10.5555/3141475.3141486"
    }
  ]
}