{
  "doi": "10.1145/3290605.3300551",
  "title": "EnhancedTouchX: Smart Bracelets for Augmenting Interpersonal Touch Interactions",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "EnhancedTouchX, a bracelet-type interpersonal body area network device, not only detects but also quantifies interpersonal hand-to-hand touch interactions. Without any wired connection, it can identify the direction and gestures of a touch. The developed device can connect to an external device via Bluetooth Low Energy for monitoring and logging where, when, how long, who, and how the touch interactions occurred. These daily augmented touch interactions provided by such contextual information would offer a variety of applications to facilitate social interactions. Our experiment, conducted with several pairs of participants, demonstrates that the devices can identify the direction of a touch (from one initiating the touch (active touch) to the one being touched (passive touch)) with 95% accuracy. In addition, the devices are also capable of identifying four types of touch gestures with 85% accuracy using a simple threshold classifier.",
  "tags": [
    "interpersonal touch",
    "interpersonal body area network",
    "enhancedtouch"
  ],
  "authors": [
    {
      "name": "Taku Hachisu",
      "institution": "University of Tsukuba, Tsukuba, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482659894",
      "orcid": "missing"
    },
    {
      "name": "Baptiste Bourreau",
      "institution": "University of Tsukuba, Tsukuba, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659276972",
      "orcid": "missing"
    },
    {
      "name": "Kenji Suzuki",
      "institution": "University of Tsukuba, Tsukuba, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100184640",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A. Ahlbom, U. Bergqvist, J. H. Bernhardt, J. P. Cesarini, L. A. Court, M. Grandolfo, M. Hietanen, A. F. McKinlay, M. H. Repacholi, D. H. Sliney, J. A J Stolwijk, M. L. Swicord, L. D. Szabo, M. Taki, T. S. Tenforde, H. P. Jammet, and R. Matthes. 1998. Guidelines for limiting exposure to time-varying electric, magnetic, and electromagnetic felds (up to 300 GHz). Health Physics 74, 4 (1998), 494--521.",
      "doi": ""
    },
    {
      "text": "Joonsung Bae, Hyunwoo Cho, Kiseok Song, Hyungwoo Lee, and HoiJun Yoo. 2012. The signal transmission mechanism on the surface of human body for body channel communication. IEEE Transactions on microwave theory and techniques 60, 3 (2012), 582--593.",
      "doi": ""
    },
    {
      "text": "Mert Canat, Mustafa Ozan Tezcan, Celalettin Yurdakul, Oguz Turan Buruk, and Oguzhan Ozcan. 2016. Experiencing human-to-human touch in digital games. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 3655--3658.  ",
      "doi": "10.1145/2851581.2890231"
    },
    {
      "text": "Ciro Cattuto, Wouter Van den Broeck, Alain Barrat, Vittoria Colizza, Jean-François Pinton, and Alessandro Vespignani. 2010. Dynamics of person-to-person interactions from distributed RFID sensor networks. PloS one 5, 7 (2010), e11596.",
      "doi": ""
    },
    {
      "text": "Sung Ok Chang. 2001. The conceptual structure of physical touch in caring. Journal of advanced nursing 33, 6 (2001), 820--827.",
      "doi": ""
    },
    {
      "text": "Tanzeem Khalid Choudhury. 2004. Sensing and modeling human networks. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "April H Crusco and Christopher G Wetzel. 1984. The Midas touch: The efects of interpersonal touch on restaurant tipping. Personality and Social Psychology Bulletin 10, 4 (1984), 512--517.",
      "doi": ""
    },
    {
      "text": "Lesley Cullen and Julie Barlow. 2002. 'Kiss, Cuddle, Squeeze': The Experiences and Meaning of Touch among Parents of Children with Autism Attending a Touch Therapy Programme. Journal of Child Health Care 6, 3 (sep 2002), 171--181.",
      "doi": ""
    },
    {
      "text": "Paul Dietz and Darren Leigh. 2001. DiamondTouch: A Multi-user Touch Technology. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, New York, NY, USA, 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Kenji Doi and Tokuhisa Nishimura. 2005. High-reliability communication technology using human body as transmission medium. Matsushita Electric Works, Ltd. Technical report 53, 3 (2005), 72--76.",
      "doi": ""
    },
    {
      "text": "Tifany Field. 2002. Infants' need for touch. Human Development 45, 2 (2002), 100--103.",
      "doi": ""
    },
    {
      "text": "Tifany Field. 2010. Touch for socioemotional and physical well-being: A review. Developmental Review 30, 4 (2010), 367--383.",
      "doi": ""
    },
    {
      "text": "Masaaki Fukumoto and Mitsuru Shinagawa. 2005. Carpetlan: A novel indoor wireless (-like) networking and positioning system. In International Conference on Ubiquitous Computing. Springer, 1--18.  ",
      "doi": "10.1007/11551201_1"
    },
    {
      "text": "Alberto Gallace and Charles Spence. 2010. The science of interpersonal touch: an overview. Neuroscience & Biobehavioral Reviews 34, 2 (2010), 246--259.",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Sebastian Herber, Raphael Wimmer, Frank Englert, Sebastian Beck, Julian von Wilmsdorf, Reiner Wichert, and Arjan Kuijper. 2014. Capacitive Near-feld Communication for Ubiquitous Interaction and Perception. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, New York, NY, USA, 231--242.  ",
      "doi": "10.1145/2632048.2632053"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew S Reynolds, and Joshua R Smith. 2017. Finding common ground: A survey of capacitive sensing in human-computer interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3293--3315.  ",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Nicholas Guéguen. 2002. Kind of touch, gender, and compliance with a request. Studia Psychologica (2002).",
      "doi": ""
    },
    {
      "text": "Nicolas Guéguen. 2002. Touch, awareness of touch, and compliance with a request. Perceptual and motor skills 95, 2 (2002), 355--360.",
      "doi": ""
    },
    {
      "text": "Nicolas Guéguen. 2004. Nonverbal encouragement of participation in a course: The efect of touching. Social Psychology of Education 7, 1 (2004), 89--98.",
      "doi": ""
    },
    {
      "text": "Nicolas Guéguen and Jacques Fischer-Lokou. 2003. Tactile contact and spontaneous help: An evaluation in a natural setting. The Journal of social psychology 143, 6 (2003), 785--787. EnhancedTouchX CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk",
      "doi": ""
    },
    {
      "text": "Nicolas Guéguen, Sebastien Meineri, and Virginie Charles-Sire. 2010. Improving medication adherence by using practitioner nonverbal techniques: a feld experiment on the efect of touch. Journal of behavioral medicine 33, 6 (2010), 466--473.",
      "doi": ""
    },
    {
      "text": "Taku Hachisu, Yadong Pan, Soichiro Matsuda, Baptiste Bourreau, and Kenji Suzuki. 2018. FaceLooks: A Smart Headband for Signaling Faceto-Face Behavior. Sensors 18, 7 (2018), 2066.",
      "doi": ""
    },
    {
      "text": "Taku Hachisu and Kenji Suzuki. 2018. Tactile Apparent Motion Through Human-Human Physical Touch. In International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, 163--174.",
      "doi": ""
    },
    {
      "text": "Keisuke Hachisuka, Yusuke Terauchi, Yoshinori Kishi, Ken Sasaki, Terunao Hirota, Hiroshi Hosaka, Katsuyuki Fujii, Masaharu Takahashi, and Koichi Ito. 2006. Simplifed circuit modeling and fabrication of intrabody communication devices. Sensors and actuators A: physical 130 (2006), 322--330.",
      "doi": ""
    },
    {
      "text": "David Haddock, Aaron Quigley, and Benoit Gaudin. 2009. Sensing handshakes for social network development. In Irish Conference on Artifcial Intelligence and Cognitive Science. Springer, 289--290. ",
      "doi": "10.5555/1939047.1939083"
    },
    {
      "text": "Chris Harrison, Hrvoje Benko, and Andrew D Wilson. 2011. OmniTouch: wearable multitouch interaction everywhere. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 441--450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Maria Henricson, Anna-Lena Berglund, Sylvia Määttä, Rolf Ekman, and Kerstin Segesten. 2008. The outcome of tactile touch on oxytocin in intensive care patients: a randomised controlled trial. Journal of Clinical Nursing 17, 19 (2008), 2624--2633.",
      "doi": ""
    },
    {
      "text": "Christian Holz and Marius Knaust. 2015. Biometric Touch Sensing: Seamlessly Augmenting Each Touch with Continuous Authentication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST '15). ACM, New York, NY, USA, 303--312.  ",
      "doi": "10.1145/2807442.2807458"
    },
    {
      "text": "Jacob Hornik. 1992. Tactile stimulation and consumer response. Journal of Consumer Research 19, 3 (1992), 449--458.",
      "doi": ""
    },
    {
      "text": "Jacob Hornik and Shmuel Ellis. 1988. Strategies to secure compliance for a mall intercept interview. Public Opinion Quarterly 52, 4 (1988), 539--551.",
      "doi": ""
    },
    {
      "text": "Robert-Vincent Joule and Nicolas Guéguen. 2007. Touch, compliance, and awareness of tactile contact. Perceptual and Motor Skills 104, 2 (2007), 581--588.",
      "doi": ""
    },
    {
      "text": "Behailu Kibret, MirHojjat Seyedi, Daniel TH Lai, and Micheal Faulkner. 2014. Investigation of galvanic-coupled intrabody communication using the human body circuit model. IEEE Journal of Biomedical and Health Informatics 18, 4 (2014), 1196--1206.",
      "doi": ""
    },
    {
      "text": "Seungki Kim, Jiwoo Hong, Jaeyeon Lee, Hyun-Sook Choi, Geehyuk Lee, and Woohun Lee. 2018. TouchBranch: Understanding Interpersonal Touches in Interactive Installation. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018. ACM, 535--546.  ",
      "doi": "10.1145/3196709.3196740"
    },
    {
      "text": "Chris L Kleinke. 1977. Compliance to requests made by gazing and touching experimenters in feld settings. Journal of Experimental Social Psychology 13, 3 (1977), 218--223.",
      "doi": ""
    },
    {
      "text": "Michael W Kraus, Cassey Huang, and Dacher Keltner. 2010. Tactile communication, cooperation, and performance: An ethological study of the NBA. Emotion 10, 5 (2010), 745.",
      "doi": ""
    },
    {
      "text": "Gierad Laput, Robert Xiao, and Chris Harrison. 2016. Viband: Highfdelity bio-acoustic sensing using commodity smartwatch accelerometers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 321--333.  ",
      "doi": "10.1145/2984511.2984582"
    },
    {
      "text": "Soo-Chul Lim, Jungsoon Shin, Seung-Chan Kim, and Joonah Park. 2015. Expansion of Smartwatch Touch Interface from Touchscreen to Around Device Interface Using Infrared Line Image Sensors. Sensors 15, 7 (2015), 16642--16653.",
      "doi": ""
    },
    {
      "text": "Henrik Hautop Lund, Thomas Klitbo, and Carsten Jessen. 2005. Playware technology for physically activating play. Artifcial life and Robotics 9, 4 (2005), 165--174.",
      "doi": ""
    },
    {
      "text": "Joe Marshall and Paul Tennent. 2017. Touchomatic: interpersonal touch gaming in the wild. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, 417--428.  ",
      "doi": "10.1145/3064663.3064727"
    },
    {
      "text": "Nobuyuki Matsushita, Shigeru Tajima, Yuji Ayatsuka, and Jun Rekimoto. 2000. Wearable key: Device for personalizing nearby environment. In Wearable Computers, The Fourth International Symposium on. IEEE, 119--126. ",
      "doi": "10.5555/851037.856526"
    },
    {
      "text": "Asaki Miura, Takashi Isezaki, and Kenji Suzuki. 2013. Social playware with an enhanced reach for facilitating group interaction. In CHI'13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1155--1160.  ",
      "doi": "10.1145/2468356.2468562"
    },
    {
      "text": "Daniel Olguín Olguín, Benjamin N Waber, Taemie Kim, Akshay Mohan, Koji Ara, and Alex Pentland. 2009. Sensible organizations: Technology and methodology for automatically measuring organizational behavior. IEEE Transactions on Systems, Man, and Cybernetics, Part B (Cybernetics) 39, 1 (2009), 43--55.  ",
      "doi": "10.1109/TSMCB.2008.2006638"
    },
    {
      "text": "Rieko Otsuka, Kazuo Yano, and Nobuo Sato. 2009. An organization topographic map for visualizing business hierarchical relationships. In Visualization Symposium, 2009. PacifcVis' 09. IEEE Pacifc. IEEE, 25--32.  ",
      "doi": "10.1109/PACIFICVIS.2009.4906834"
    },
    {
      "text": "Kurt Partridge, Bradley Dahlquist, Alireza Veiseh, Annie Cain, Ann Foreman, Joseph Goldberg, and Gaetano Borriello. 2001. Empirical measurements of intrabody communication performance under varied physical confgurations. In Proceedings of the 14th annual ACM symposium on User interface software and technology. ACM, 183--190.  ",
      "doi": "10.1145/502348.502381"
    },
    {
      "text": "Munehiko Sato, Ivan Poupyrev, and Chris Harrison. 2012. Touché: enhancing touch interaction on humans, screens, liquids, and everyday objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 483--492.  ",
      "doi": "10.1145/2207676.2207743"
    },
    {
      "text": "M. Seyedi, B. Kibret, D. T. H. Lai, and M. Faulkner. 2013. A Survey on Intrabody Communications for Body Area Network Applications. IEEE Transactions on Biomedical Engineering 60, 8 (Aug. 2013), 2067--2079.",
      "doi": ""
    },
    {
      "text": "M. Shinagawa, M. Fukumoto, K. Ochiai, and H. Kyuragi. 2004. A near-feld-sensing transceiver for intrabody communication based on the electrooptic efect. IEEE Transactions on Instrumentation and Measurement 53, 6 (Dec. 2004), 1533--1538.",
      "doi": ""
    },
    {
      "text": "Kenji Suzuki, Taku Hachisu, and Kazuki Iida. 2016. EnhancedTouch: A Smart Bracelet for Enhancing Human-Human Physical Touch. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1282--1293.  ",
      "doi": "10.1145/2858036.2858439"
    },
    {
      "text": "Jan BF Van Erp and Alexander Toet. 2015. Social touch in human-- computer interaction. Frontiers in digital humanities 2 (2015), 2.",
      "doi": ""
    },
    {
      "text": "Virag Varga, Gergely Vakulya, Alanson Sample, and Thomas R. Gross. 2018. Enabling Interactive Infrastructure with Body Channel Communication. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 169 (Jan. 2018), 29 pages.  ",
      "doi": "10.1145/3161180"
    },
    {
      "text": "Virag Varga, Marc Wyss, Gergely Vakulya, Alanson Sample, and Thomas R Gross. 2018. Designing Groundless Body Channel Communication Systems: Performance and Implications. In The 31st Annual ACM Symposium on User Interface Software and Technology. ACM, 683--695. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk T. Hachisu et al.  ",
      "doi": "10.1145/3242587.3242622"
    },
    {
      "text": "Marc Simon Wegmueller, Michael Oberle, Norbert Felber, Niels Kuster, and Wolfgang Fichtner. 2010. Signal transmission by galvanic coupling through the human body. IEEE Transactions on Instrumentation and Measurement 59, 4 (2010), 963--969.",
      "doi": ""
    },
    {
      "text": "Sandra J Weiss, Peggy Wilson, and Delmont Morrison. 2004. Maternal tactile stimulation and the neurodevelopment of low birth weight infants. Infancy 5, 1 (2004), 85--107.",
      "doi": ""
    },
    {
      "text": "Tim Weißker, Erdan Genc, Andreas Berst, Frederik David Schreiber, and Florian Echtler. 2017. ShakeCast: using handshake detection for automated, setup-free exchange of contact data. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 88.  ",
      "doi": "10.1145/3098279.3122131"
    },
    {
      "text": "Sheryle J Whitcher and Jefrey D Fisher. 1979. Multidimensional reaction to therapeutic touch in a hospital setting. Journal of Personality and Social Psychology 37, 1 (1979), 87.",
      "doi": ""
    },
    {
      "text": "Robert Xiao, Teng Cao, Ning Guo, Jun Zhuo, Yang Zhang, and Chris Harrison. 2018. LumiWatch: On-Arm Projected Graphics and Touch Input. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 95.  ",
      "doi": "10.1145/3173574.3173669"
    },
    {
      "text": "Cheng Zhang, AbdelKareem Bedri, Gabriel Reyes, Bailey Bercik, Omer T Inan, Thad E Starner, and Gregory D Abowd. 2016. Tapskin: Recognizing on-skin input for smartwatches. In Proceedings of the 2016 ACM on Interactive Surfaces and Spaces. ACM, 13--22.  ",
      "doi": "10.1145/2992154.2992187"
    },
    {
      "text": "Yang Zhang, Junhan Zhou, Gierad Laput, and Chris Harrison. 2016. Skintrack: Using the body as an electrical waveguide for continuous fnger tracking on the skin. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1491--1503.  ",
      "doi": "10.1145/2858036.2858082"
    },
    {
      "text": "Junhan Zhou, Yang Zhang, Gierad Laput, and Chris Harrison. 2016. AuraSense: enabling expressive around-smartwatch interactions with electric feld sensing. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 81--86.  ",
      "doi": "10.1145/2984511.2984568"
    },
    {
      "text": "Thomas G. Zimmerman. 1995. Personal Area Networks ( PAN ) : NearField Intra-Body Communication. Master's thesis. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Thomas G. Zimmerman. 1996. Personal area networks: near-feld intrabody communication. IBM systems Journal 35, 3.4 (1996), 609-- 617.  ",
      "doi": "10.1147/sj.353.0609"
    }
  ]
}