{
  "doi": "10.1145/3290605.3300547",
  "title": "Symbiotic Encounters: HCI and Sustainable Agriculture",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Recent sustainable HCI research has advocated \"working with nature\" as a potentially efficacious alternative to human efforts to control it: yet it is less clear how to do so. We contribute to the theoretical aspect of this research by presenting an ethnographic study on alternative farming practices, in which the farm is not so much a system but an assemblage characterized by multiple systems or rationalities always evolving and changing. In them, relationships among species alternate between mutually beneficial in one moment (or season), and harmful in the next. If HCI is to participate in and to support working with nature, we believe that it will have to situate itself within such assemblages and temporalities. In this work, we look into nontraditional users (e.g., nonhumans) and emerging forms of uses (e.g., interactions between human and other species) to help open a design space for technological interventions. We offer three ethnographic accounts in which farmers-and ourselves as researchers-learn to notice, respond, and engage in symbiotic encounters with companion species and the living soil itself.",
  "authors": [
    {
      "name": "Szu-Yu (Cyn) Liu",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659184865",
      "orcid": "missing"
    },
    {
      "name": "Shaowen Bardzell",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81100057558/rel-imgonly/shaowen_bardzell.png",
      "acmid": "81100057558",
      "orcid": "0000-0001-7596-9244"
    },
    {
      "name": "Jeffrey Bardzell",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100057577",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Paul Aoki, Allison Woodruff, Baladitya Yellapragada, and Wesley Willett. 2017. Environmental Protection and Agency: Motivations, Capacity, and Goals in Participatory Sensing. In CHI '17. 3138--3150.  ",
      "doi": "10.1145/3025453.3025667"
    },
    {
      "text": "The Morton Arboretum. 2018. Scale insects. http://www.mortonarb. org/trees-plants/tree-and-plant-advice/help-pests/scale-insects",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2015. Humanistic HCI. Morgan and Claypool.  ",
      "doi": "10.1145/3068259"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Silvia Lindtner. In Press. Some Things about Innovation. In Bauhaus Futures, Laura Forlano, Molly Wright Steenson, and Mike Ananny (Eds.). MIT Press. (to appear).",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2018. Utopias of Participation: Feminism, Design, and the Futures. ACM TOCHI 25, 1 (2018), Article No. 6.  ",
      "doi": "10.1145/3127359"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology: Social Science, Feminism, and HCI. In CHI '11. 675.  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, and Sarah Ng. 2017. Supporting Cultures of Making: Technology, Policy, Visions, and Myths. In CHI '17. 6523--6535.  ",
      "doi": "10.1145/3025453.3025975"
    },
    {
      "text": "Eric P. S. Baumer and Jed R. Brubaker. 2017. Post-Userism. In CHI '17. 6291--6303.  ",
      "doi": "10.1145/3025453.3025740"
    },
    {
      "text": "Eli Blevis. 2007. Sustainable Interaction Design: Invention & Disposal, Renewal & Reuse. In CHI '07. 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Eli Blevis. 2018. Seeing What Is and What Can Be: On Sustainability, Respect for Work, and Design for Respect. In CHI '18. Paper No. 370.  ",
      "doi": "10.1145/3173574.3173944"
    },
    {
      "text": "Eli Blevis and Susan Coleman Morse. 2009. Sustainably Ours: Food, Dude. Interactions (2009), 58--62.  ",
      "doi": "10.1145/1487632.1487646"
    },
    {
      "text": "Tom Boellstorff, Bonnie Nardi, Celia Pearce, and T.L. Taylor. 2012. Ethnography and Virtual Worlds: A Handbook of Method. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Rosi Braidotti. 2016. Posthuman Critical Theory. In Critical Posthumanism and Planetary Futures, Debashish Banerji and Makarand R. Paranjape (Eds.). Chapter 2, 13--32.",
      "doi": ""
    },
    {
      "text": "Hronn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably unpersuaded: How Persuasion Narrows Our Vision of Sustainability. In CHI '12. 947--956.  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Shenglin Elijah Chang. 2013. Blue Magpie TEAgriculture: Eco-tea Cultivation and Participatory Farming in Pinglin Satoyama, Taiwan. Procedia - Social and Behavioral Sciences 101 (2013), 14--22.",
      "doi": ""
    },
    {
      "text": "Jaz Hee-jeong Choi and Eli Blevis. 2010. HCI & sustainable food culture: A design framework for engagement. In NordiCHI '10. 112--117.  ",
      "doi": "10.1145/1868914.1868931"
    },
    {
      "text": "Stephen J. Collier. 2006. Global Assemblages. Theory, Culture & Society 23, 2--3 (2006), 400.",
      "doi": ""
    },
    {
      "text": "Stephen J. Collier and Aihwa Ong. 2008. Global Assembladges, Anthropological Problems. In Global Assembladges: Technology, Politics, and Ethics as Anthropological Problems, Aihwa Ong and Stephen J. Collier (Eds.). Wiley-Blackwell.",
      "doi": ""
    },
    {
      "text": "Geoff Cooper and John Bowers. 1995. Representing the user: Notes on the disciplinary rhetoric of human-computer interaction. In The Social and Interactional Dimensions of Human-Computer Interfaces. Cambridge University Press, New York, 48--65. ",
      "doi": "10.5555/214811.214821"
    },
    {
      "text": "Paul J. Crutzen. 2002. Geology of Mankind. Nature 415, 6867 (2002), 23.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo and Jonathan Lukens. 2009. Seeing the City Through Machines: Non-Anthropocentric Design and Youth Robotics. In Digital Cities 6: Concepts, Methods and Systems of Urban Informatics (Workshop), Marcus Foth, Laura Forlano, and Hiromitsu Hattori (Eds.). State College: Penn State University Press.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo and Jonathan Lukens. 2011. Nonanthropocentrism and the Nonhuman in Design: Possibilities for Designing New Forms of Engagement with and through Technology. In From Social Butterfly to Engaged Citizen : Urban Informatics, Social Media, Ubiquitous Computing, and Mobile Technology to Support Citizen Engagement, Marcus Foth, Judith Donath, and Laura Forlano (Eds.). Number November. MIT Press, 421--436.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In CHI '10. 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Paul Dourish. 2010. HCI and Environmental Sustainability: The Politics of Design and the Design of Politics. In DIS '10. 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "Slow Food Foundation for Biodiversity. 2019. Original Dongfang Meiren Tea. https://www.fondazioneslowfood.com/en/ ark-of-taste-slow-food/original-dongfang-meiren/",
      "doi": ""
    },
    {
      "text": "Laura Forlano. 2016. Decentering the Human in the Design of Collaborative Cities. Design Issues 32, 3 (2016), 42--54.",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi. 2018. Moving Beyond User-Centered Design. Interactions 25, 5 (2018), 22--23.  ",
      "doi": "10.1145/3239558"
    },
    {
      "text": "Tse-Xin Organic Agriculture Foundation. 2018. About Tse-Xin Organic Agriculture Foundation (TOAF). http://toaf.org.tw/en",
      "doi": ""
    },
    {
      "text": "Guo Freeman, Jeffrey Bardzell, and Shaowen Bardzell. 2017. Aspirational Design and Messy Democracy: Partisanship, Policy, and Hope in an Asian City. In CSCW '17. 404--416.  ",
      "doi": "10.1145/2998181.2998291"
    },
    {
      "text": "Guo Freeman, Shaowen Bardzell, and Jeffrey Bardzell. 2018. BottomUp Imaginaries: The Cultural-Technical Practice of Inventing Regional Advantage through IT R&D. In CHI '18. Paper No. 325. CHI 2019, May 4--9, 2019, Glasgow, Scotland, U.K. Liu et al.  ",
      "doi": "10.1145/3173574.3173899"
    },
    {
      "text": "Lisa M Given, Denise Cantrell Winkler, and Kathryn Hopps-Wallis. 2017. Social Media for Social Good: A Study of Experiences and Opportunities in Rural Australia. In Proceedings of the 8th International Conference on Social Media & Society. Article No. 7.  ",
      "doi": "10.1145/3097286.3097293"
    },
    {
      "text": "Elizabeth Goodman, Mike Kuniavsky, and Andrea Moed. 2012. Observing the User Experience: A Practitioner's Guide to User Research (2nd ed.). Morgan Kaufmann. ",
      "doi": "10.5555/2385425"
    },
    {
      "text": "Maria Håkansson and Phoebe Sengers. 2013. Beyond Being Green: Simple Living Families and ICT. In CHI '13. 2725--2734.  ",
      "doi": "10.1145/2470654.2481378"
    },
    {
      "text": "Donna Haraway. 2003. The Companion Species Manifesto: Dogs, People, And Signigicant Otherness. Prickly Paradigm Press.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 2008. When Species Meet. University of Minnesota Press, London.",
      "doi": ""
    },
    {
      "text": "Donna J. Haraway. 2016. Staying with the Trouble: Making Kin in the Chthulucene. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl and Noam Tractinsky. 2006. User experience- A research agenda. Behaviour and Information Technology 25, 2 (2006), 91--97.",
      "doi": ""
    },
    {
      "text": "Katherine Hayles. 1999. How We Became Posthuman: Virtual Bodies in Cybernetics, Literature, and Informatics. University of Chicago Press. arXiv:9809069v1 ",
      "doi": "10.5555/553246"
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2013. Sustainable HCI for grassroots urban food-growing communities. In OzCHI '13. 255--264.  ",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Tad Hirsch. 2014. Beyond Gardening: A New Approach to HCI and Urban Agriculture. In Eat, Cook, Grow: Mixing Human-Computer Interactions with Human-Food Interactions, Jaz Hee-Jeong Choi, Marcus Foth, and Greg Hearn (Eds.). The MIT Press, Chapter 13, 227--242.",
      "doi": ""
    },
    {
      "text": "Heather A. Horst and Daniel Miller (Eds.). 2012. Digital Anthropology. Berg.",
      "doi": ""
    },
    {
      "text": "Sunrise Huang and Deborah Kuo. 2010. Premier looks at 'green' aspects of Pinglin township. http://focustaiwan.tw/news/aliv/ 201006270016.aspx",
      "doi": ""
    },
    {
      "text": "Ya-Xuan (NaiNai) Huang. 2018. 2018 ??????????. http: //landdykecsa.blogspot.com/2018/07/2018.html?view=magazine",
      "doi": ""
    },
    {
      "text": "Steven J. Jackson and Laewoo Kang. 2014. Breakdown, Obsolescence and Reuse: HCI and the Art of Repair. In CHI '14. 449--458.  ",
      "doi": "10.1145/2556288.2557332"
    },
    {
      "text": "Tom Jenkins, Christopher A. Le Dantec, Carl Disalvo, Thomas Lodato, and Mariam Asad. 2016. Object-Oriented Publics. In CHI '16. 827--839.  ",
      "doi": "10.1145/2858036.2858565"
    },
    {
      "text": "Hiroki Kobayashi, Ryoko Ueoka, and Michitaka Hirose. 2009. Human Computer Biosphere Interaction: Towards Sustainable Society. In CHI EA '09. 2509--2518.  ",
      "doi": "10.1145/1520340.1520355"
    },
    {
      "text": "Stacey Kuznetsov, Christina J. Santana, and Elenore Long. 2016. Everyday Food Science as a Design Space for Community Literacy and Habitual Sustainable Practice. In CHI '16. 1786--1797.  ",
      "doi": "10.1145/2858036.2858363"
    },
    {
      "text": "Land Dyke CSA. 2018. 2018 ?????????????. http: //landdykecsa.blogspot.com/",
      "doi": ""
    },
    {
      "text": "Amanda J Landon. 2008. The \"How\" of the Three Sisters : The Origins of Agriculture in Mesoamerica and the Human Niche. Nebraska Anthropologist 23 (2008), 110--124.",
      "doi": ""
    },
    {
      "text": "Joanna Latimer. 2013. Being Alongside: Rethinking Relations amongst Different Kinds. Theory, Culture & Society 30, 8 (2013), 77--104.",
      "doi": ""
    },
    {
      "text": "Ann Light, Irina Shklovski, and Alison Powell. 2017. Design for Existential Crisis. In CHI EA '17. 722--734.  ",
      "doi": "10.1145/3027063.3052760"
    },
    {
      "text": "Amber Lin. 2017. Land Dyke Feminist Family Farm: Women Create Farming Community. CommonWealth Magazine (Jun 2017). https: //english.cw.com.tw/article/article.action?id=1630",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Reconstituting the Utopian Vision of Making: HCI After Technosolutionism. In CHI '16. 1390--1402.  ",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "Jen Liu, Daragh Byrne, and Laura Devendorf. 2018. Design for Collaborative Survival : An Inquiry into Human-Fungi Relationships. In CHI'18. 1--13.  ",
      "doi": "10.1145/3173574.3173614"
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Jeffrey Bardzell, and Shaowen Bardzell. 2018. Photography as A Design Research Tool into Natureculture. In DIS '18. 777--789.  ",
      "doi": "10.1145/3196709.3196819"
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Out of Control: Reframing Sustainable HCI Using Permaculture. In Limits '18.",
      "doi": "10.1145/3232617.3232625"
    },
    {
      "text": "Peter Lyle, Jaz Hee-jeong Choi, and Marcus Foth. 2015. Growing Food in the City: Design Ideations for Urban Residential Gardeners. In C&T '15. 89--97.  ",
      "doi": "10.1145/2768545.2768549"
    },
    {
      "text": "John McCarthy and Peter Wright. 2004. Technology as Experience. The MIT Press. ",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Daniel Miller and Don Slater. 2000. The Internet: An Ethnographic Approach (1 ed.). Bloomsbury Academic.",
      "doi": ""
    },
    {
      "text": "Emilie Møllenbach and Jens Hoff. 2012. HCI and Sustainability: The Role of Macrostructures. In CHI EA '12. 2159--2164.  ",
      "doi": "10.1145/2212776.2223769"
    },
    {
      "text": "Omar Mubin, Joshua Tubb, Mauricio Novoa, Mustafa Naseem, and Samia Razaq. 2015. Understanding the Needs of Pakistani Farmers and the Prospects of an ICT Intervention. In CHI EA '15. 1109--1114.  ",
      "doi": "10.1145/2702613.2732756"
    },
    {
      "text": "Bonnie Nardi. 2010. My Life as a Night Elf Priest: An Anthropological Account of World of Warcraft. University of Michigan Press.",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi. 2016. Designing for the Future: But Which One? interactions January-February (2016), 26--33.  ",
      "doi": "10.1145/2843592"
    },
    {
      "text": "Food Nations and Agriculture Organization of the United. 2018. The State of Food Security and Nutrition in the World. Technical Report. Food and Agriculture Organization of the United Nations, Rome. http://www.fao.org/state-of-food-security-nutrition/en/",
      "doi": ""
    },
    {
      "text": "Juliet Norton, Nico Herbig, Lynn Dombrowski, Ankita Raturi, Bonnie Nardi, Sebastian Prost, Samantha McDonald, Daniel Pargman, Oliver Bates, Maria Normark, and Bill Tomlinson. 2017. A grand challenge for HCI: food + sustainability. Interactions 24, 6 (2017), 50--55.  ",
      "doi": "10.1145/3137095"
    },
    {
      "text": "Frank Noz and Jinsoo An. 2011. Cat cat revolution: An interspecies gaming experience. In CHI '11. 2661--2664.  ",
      "doi": "10.1145/1978942.1979331"
    },
    {
      "text": "William Odom. 2010. \"Mate, we don't need a chip to tell us the soil's dry\": Opportunities for Designing Interactive Systems to Support Urban Food Production. In DIS '10. 232--235.  ",
      "doi": "10.1145/1858171.1858211"
    },
    {
      "text": "William Odom. 2014.\"You Don't Have to Be a Gardener to Do Urban Agriculture\" : Understanding Opportunities for Designing Interactive Technologies to Support Urban Food Production. In Eat, Cook, Grow: Mixing Human-Computer Interactions with Human-Food Interactions. The MIT Press, 177.",
      "doi": ""
    },
    {
      "text": "Erick Oduor, Peninah Waweru, Jonathan Lenchner, and Carman Neustaedter. 2018. Practices and Technology Needs of a Network of Farmers in Tharaka Nithi, Kenya. In CHI '18. 1--11.  ",
      "doi": "10.1145/3173574.3173613"
    },
    {
      "text": "Charles Kay Ogden and Ivor Armstrong Richards. 1923. The Meaning of Meaning: A Study of the Influence of Language upon Thought and of the Science of Symbolism. Mariner Books.",
      "doi": ""
    },
    {
      "text": "James Pierce and Eric Paulos. 2012. Beyond Energy Monitors: Interaction, Energy, and Emerging Energy Systems. In CHI '12. 665--674.  ",
      "doi": "10.1145/2207676.2207771"
    },
    {
      "text": "María Puig de la Bellacasa. 2010. Ethical doings in naturecultures. Ethics, Place and Environment 13, 2 (2010), 151--169.",
      "doi": ""
    },
    {
      "text": "Andrew Quitmeyer. 2017. Digital Naturalist Design Guidelines: Theory, investigation, Development, and Evaluation of a Computational Media Framework to Support Ethological Exploration. In C&C '17. 184--196.  ",
      "doi": "10.1145/3059454.3059462"
    },
    {
      "text": "Barath Raghavan, Bonnie Nardi, Sarah T Lovell, Juliet Norton, Bill Tomlinson, and Donald J Patterson. 2016. Computational Agroecology: Sustainable Food Ecosystem Design. In CHI EA '16. 423--435.  ",
      "doi": "10.1145/2851581.2892577"
    },
    {
      "text": "Barath Raghavan and Daniel Pargman. 2017. Means and Ends in Human-Computer Interaction: Sustainability through Disintermediation. In CHI '17. 786--796. Symbiotic Encounters: HCI and Sustainable Agriculture CHI 2019, May 4--9, 2019, Glasgow, Scotland, U.K.  ",
      "doi": "10.1145/3025453.3025542"
    },
    {
      "text": "Christian Remy, Oliver Bates, Alan Dix, Vanessa Thomas, Mike Hazas, Adrian Friday, and Elaine M Huang. 2018. Evaluation beyond Usability: Validating Sustainable HCI Research. In CHI'18. 1--14.  ",
      "doi": "10.1145/3173574.3173790"
    },
    {
      "text": "Yvonne Rogers. 2012. HCI Theory: Classical, Modern, and Contemporary. Morgan & Claypool. ",
      "doi": "10.5555/3019322"
    },
    {
      "text": "Kanzo Sakata. 2010. Studies on aroma formation mechanisms during tea manufacturing suggest methods not only to improve the quality of made teas, but also to produce new types of teas. In The Internatinal Conference on O-CHA(Tea) Culture and Science. http://www.o-cha. net/english/conference2/pdf/2010/files/PROC/pr-s-08.pdf",
      "doi": ""
    },
    {
      "text": "Eric Scott. 2016. Oriental Beauty and Other Bug-Bitten Teas: Fact or Fiction ? https://worldoftea.org/oriental-beauty-bug-bitten-teas/",
      "doi": ""
    },
    {
      "text": "Nancy Smith, Shaowen Bardzell, and Jeffrey Bardzell. 2017. Designing for Cohabitation: Naturecultures, Hybrids, and Decentering the Human in Design. In CHI'17. 1714--1725.  ",
      "doi": "10.1145/3025453.3025948"
    },
    {
      "text": "Charles Steinfield, Susan Wyche, Tian Cai, and Hastings Chiwasa. 2015. The Mobile Divide Revisited: Mobile Phone Use by Smallholder Farmers in Malawi. In ICTD '15.  ",
      "doi": "10.1145/2737856.2738022"
    },
    {
      "text": "Rosemary Steup, Arvind Santhanam, Marisa Logan, Lynn Dombrowski, and Norman Makoto Su. 2018. Growing Tiny Publics: Small Farmers' Social Movement Strategies. Proceedings of the ACM on Human-Computer Interaction - CSCW 2 (2018), Article No. 165.  ",
      "doi": "10.1145/3274434"
    },
    {
      "text": "Bill Tomlinson and Benoit A. Aubert. 2017. Information Systems in a Future of Decreased and Redistributed Global Growth. In LIMITS '17. 21--28.  ",
      "doi": "10.1145/3080556.3080569"
    },
    {
      "text": "Bill Tomlinson, Eli Blevis, Bonnie Nardi, Donald J. Patterson, M. SIX Silberman, and Yue Pan. 2013. Collapse Informatics and Practice: Theory, Method, and Design. ACM TOCHI 20, 4 (2013), Article No. 24.  ",
      "doi": "10.1145/2493431"
    },
    {
      "text": "Anna Tsing. 2015. The Mushroom at the End of the World. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Anna Tsing, Heather Swanson, Elaine Gan, and Nils Bubandt (Eds.). 2017. Arts of Living on Damaged Planet: Ghosts of the Anthropocene. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Iowa State University. 2018. Scale Insects. https://hortnews.extension. iastate.edu/scale-insects",
      "doi": ""
    },
    {
      "text": "Sagar K. Wadkar, Khajan Singh, Asif Mohammad, and Shivaji D. Argade. 2017. Sustainability of the Rural ICT Project: a Case Study of aAQUA e-Agriservice, Maharashtra, India. In ICEGOV '17. 384--390.  ",
      "doi": "10.1145/3047273.3047302"
    },
    {
      "text": "Cary Wolfe. 2010. What is posthumanism? University of Minnesota Press, Minneapolis.",
      "doi": ""
    },
    {
      "text": "Peter Wright and John McCarthy. 2008. Empathy and Experience in HCI. In CHI '08. 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    },
    {
      "text": "?????????. 2018. Taiwan Bluemagpie Tea. http: //bluemagpietea.com/index.php/en/",
      "doi": ""
    },
    {
      "text": "???. 2016. ??????. ????? (2016). https://www.coa. gov.tw/ws.php?id=2504568",
      "doi": ""
    },
    {
      "text": "???. 2018. ??????????????. https://lkk.ntpc. gov.tw/News/Detail?wnd_id=4&id=5698",
      "doi": ""
    },
    {
      "text": "???. 2016. ????????. ????? (dec 2016). https: //www.coa.gov.tw/ws.php?id=2505838",
      "doi": ""
    }
  ]
}