{
  "doi": "10.1145/3290605.3300554",
  "title": "Instrumenting and Analyzing Fabrication Activities, Users, and Expertise",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "The recent proliferation of fabrication and making activities has introduced a large number of users to a variety of tools and equipment. Monitored, reactive and adaptive fabrication spaces are needed to provide personalized information, feedback and assistance to users. This paper explores the sensorization of making and fabrication activities, where the environment, tools, and users were considered to be separate entities that could be instrumented for data collection. From this exploration, we present the design of a modular system that can capture data from the varied sensors and infer contextual information. Using this system, we collected data from fourteen participants with varying levels of expertise as they performed seven representative making tasks. From the collected data, we predict which activities are being performed, which users are performing the activities, and what expertise the users have. We present several use cases of this contextual information for future interactive fabrication spaces.",
  "tags": [
    "fabrication",
    "user identification",
    "activity recognition",
    "skills evaluation"
  ],
  "authors": [
    {
      "name": "Jun Gong",
      "institution": "Autodesk Research & Dartmouth College, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659081291",
      "orcid": "missing"
    },
    {
      "name": "Fraser Anderson",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456623584",
      "orcid": "0000-0003-3486-8943"
    },
    {
      "name": "George Fitzmaurice",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502661254",
      "orcid": "0000-0002-2834-7757"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research & University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    }
  ],
  "references": [
    {
      "text": "Gregory D. Abowd and Elizabeth D. Mynatt. 2000. Charting past, present, and future research in ubiquitous computing. ACM Transactions on Computer-Human Interaction (TOCHI). 7, 1: 29--58.  ",
      "doi": "10.1145/344949.344988"
    },
    {
      "text": "Amin Ahmadi, Edmond Mitchell, Francois Destelle, et al. 2014. Automatic activity classification and movement assessment during a sports training session using wearable inertial sensors. Wearable and Implantable Body Sensor Networks (BSN), 2014 11th International Conference on, IEEE, 98--103.  ",
      "doi": "10.1109/BSN.2014.29"
    },
    {
      "text": "Amin Ahmadi, David Rowlands, and Daniel Arthur James. 2010. Towards a wearable device for skill assessment and skill acquisition of a tennis player during the first serve. Sports Technology 2, 3--4: 129--136.",
      "doi": ""
    },
    {
      "text": "Dimitrios S. Alexiadis and Petros Daras. 2014. Quaternionic Signal Processing Techniques for Automatic Evaluation of Dance Performances From MoCap Data. IEEE Trans. Multimedia 16, 5: 1391--1406.",
      "doi": ""
    },
    {
      "text": "Dimitrios S. Alexiadis, Philip Kelly, Petros Daras, Noel E. O'Connor, Tamy Boubekeur, and Maher Ben Moussa. 2011. Evaluating a dancer's performance using kinect-based skeleton tracking. In Proceedings of the 19th ACM international conference on Multimedia, 659--662.  ",
      "doi": "10.1145/2072298.2072412"
    },
    {
      "text": "Meryl Alper. 2013. Making space in the makerspace: Building a mixed-ability maker culture. Humanities, Arts, Science, and Technology Alliance and Collaboratory.",
      "doi": ""
    },
    {
      "text": "Fraser Anderson, Daniel W. Birch, Pierre Boulanger, and Walter F. Bischof. 2012. Sensor fusion for laparoscopic surgery skill acquisition. Computer Aided Surgery 17, 6: 269--283.",
      "doi": ""
    },
    {
      "text": "Fraser Anderson, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2013. YouMove: Enhancing Movement Training with an Augmented Reality Mirror. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (UIST '13), 311--320.  ",
      "doi": "10.1145/2501988.2502045"
    },
    {
      "text": "Nicola C. Anderson, Fraser Anderson, Alan Kingstone, and Walter F. Bischof. 2015. A comparison of scanpath comparison methods. Behavior research methods 47, 4: 1377--1392.",
      "doi": ""
    },
    {
      "text": "Michelle Annett, Tovi Grossman, Daniel Wigdor, George Fitzmaurice. 2018. Workshops for the 21st Century: Exploring the Role of Environments in Personal Fabrication Processes. ACM Transactions Computer-Human Interaction (TOCHI).",
      "doi": ""
    },
    {
      "text": "Matthias Baldauf, Schahram Dustdar, and Florian Rosenberg. 2007. A survey on context-aware systems. International Journal of Ad Hoc and Ubiquitous Computing 2, 4: 263--277.  ",
      "doi": "10.1504/IJAHUC.2007.014070"
    },
    {
      "text": "Patrick Baudisch and Stefanie Mueller. 2017. Personal fabrication. Foundations and Trends® in Human--Computer Interaction 10, 3--4: 165--293.",
      "doi": ""
    },
    {
      "text": "Michael Boyle and Saul Greenberg. 2005. The language of privacy: Learning from video media space analysis and design. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 2: 328--370.  ",
      "doi": "10.1145/1067860.1067868"
    },
    {
      "text": "Tim Campbell, Jonathan Harper, Bjorn Hartmann, and Eric Paulos. Towards Digital Apprenticeship: Wearable Activity Recognition in the Workshop Setting. 7.",
      "doi": ""
    },
    {
      "text": "Liwei Chan, Yi-Ling Chen, Chi-Hao Hsieh, Rong-Hao Liang, and Bing-Yu Chen. 2015. Cyclopsring: Enabling whole-hand and context-aware interactions through a fisheye ring. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST'15), 549--556.  ",
      "doi": "10.1145/2807442.2807450"
    },
    {
      "text": "Guanling Chen and David Kotz. 2000. A survey of contextaware mobile computing research. Technical Report TR2000381, Dept. of Computer Science, Dartmouth College. ",
      "doi": ""
    },
    {
      "text": "J. Chen, M. Yeasin, and R. Sharma. 2003. Visual modelling and evaluation of surgical skill. Pattern Analysis & Applications 6, 1: 1--11.",
      "doi": ""
    },
    {
      "text": "Anind K. Dey. 2001. Understanding and Using Context. Personal Ubiquitous Comput. 5, 1: 4--7.  ",
      "doi": "10.1007/s007790170019"
    },
    {
      "text": "Anind K. Dey, Gregory D. Abowd, and Daniel Salber. 2001. A Conceptual Framework and a Toolkit for Supporting the Rapid Prototyping of Context-aware Applications. Hum.-Comput. Interact. 16, 2: 97--166.  ",
      "doi": "10.1207/S15327051HCI16234_02"
    },
    {
      "text": "Yu Enokibori and Kenji Mase. 2012. A method to evaluate metal filing skill level with wearable hybrid sensor. In Proceedings of the 3rd Augmented Human International Conference (AH '12), 1--8.  ",
      "doi": "10.1145/2160125.2160131"
    },
    {
      "text": "M. S. Erden and T. Tomiyama. 2009. Identifying welding skills for training and assistance with robot. Science and Technology of Welding and Joining 14, 6: 523--532.",
      "doi": ""
    },
    {
      "text": "Miikka Ermes, Juha Parkka, Jani Mantyjarvi, and Ilkka Korhonen. 2008. Detection of daily activities and sports with wearable sensors in controlled and uncontrolled conditions. IEEE transactions on information technology in biomedicine 12, 1: 20--26.  ",
      "doi": "10.1109/TITB.2007.899496"
    },
    {
      "text": "Florian Eyben, Martin Wollmer, and Bjorn Schuller. 2009. OpenEAR-introducing the Munich open-source emotion and affect recognition toolkit. In 3rd International Conference on Affective Computing and Intelligent Interaction and Workshops, 1--6.",
      "doi": ""
    },
    {
      "text": "Jerry Fails and Dan Olsen. 2003. A design tool for camerabased interaction. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI'03), 449--456.  ",
      "doi": "10.1145/642611.642690"
    },
    {
      "text": "Davrondzhon Gafurov, Einar Snekkenes, and Patrick Bours. 2007. Gait authentication and identification using wearable accelerometer sensor. IEEE Workshop on Automatic Identification Advanced Technologies, 220--225.",
      "doi": ""
    },
    {
      "text": "Krzysztof Z. Gajos, Mary Czerwinski, Desney S. Tan, and Daniel S. Weld. 2006. Exploring the design space for adaptive graphical user interfaces. In Proceedings of the working conference on Advanced visual interfaces (AVI'06), 201--208.  ",
      "doi": "10.1145/1133265.1133306"
    },
    {
      "text": "Andy Harter, Andy Hopper, Pete Steggles, Andy Ward, and Paul Webster. 2002. The anatomy of a context-aware application. Wireless Networks 8, 2/3: 187--197.  ",
      "doi": "10.1023/A%3A1013767926256"
    },
    {
      "text": "James E. Hoffman and Baskaran Subramaniam. 1995. The role of visual attention in saccadic eye movements. Perception & psychophysics 57, 6: 787--795.",
      "doi": ""
    },
    {
      "text": "F. C. Huang, C. M. Pugh, J. L. Patton, and F. A. Mussa-Ivaldi. 2010. Learning kinematic mappings in laparoscopic surgery. In Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC'10), 2097--2102.",
      "doi": ""
    },
    {
      "text": "Scott E. Hudson and Ian Smith. 1996. Techniques for addressing fundamental privacy and disruption tradeoffs in awareness support systems. In Proceedings of the 1996 ACM conference on Computer supported cooperative work (CSCW'96), 248--257.  ",
      "doi": "10.1145/240080.240295"
    },
    {
      "text": "Jarrod Knibbe, Tovi Grossman, and George Fitzmaurice. 2015. Smart Makerspace: An Immersive Instructional Space for Physical Tasks. In Proceedings of the 2015 International Conference on Interactive Tabletops and Surfaces (ITS '15), 83-- 92.  ",
      "doi": "10.1145/2817721.2817741"
    },
    {
      "text": "Pat Langley. 1999. User modeling in adaptive interface. In UM99 User Modeling. Springer, 357--370. ",
      "doi": "10.5555/317328.317406"
    },
    {
      "text": "Gierad Laput, Robert Xiao, and Chris Harrison. 2016. Viband: High-fidelity bio-acoustic sensing using commodity smartwatch accelerometers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST'16), 321--333.  ",
      "doi": "10.1145/2984511.2984582"
    },
    {
      "text": "Gierad Laput, Chouchang Yang, Robert Xiao, Alanson Sample, and Chris Harrison. 2015. Em-sense: Touch recognition of uninstrumented, electrical and electromechanical objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (UIST'15), 157--166.  ",
      "doi": "10.1145/2807442.2807481"
    },
    {
      "text": "Gierad Laput, Yang Zhang, and Chris Harrison. 2017. Synthetic Sensors: Towards General-Purpose Sensing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 3986--3999.  ",
      "doi": "10.1145/3025453.3025773"
    },
    {
      "text": "Matthew L. Lee and Anind K. Dey. 2015. Sensor-based observations of daily living for aging in place. Personal and Ubiquitous Computing 19, 1: 27--43.  ",
      "doi": "10.1007/s00779-014-0810-3"
    },
    {
      "text": "Jaime Lien, Nicholas Gillian, M. Emre Karagozler, et al. 2016. Soli: Ubiquitous gesture sensing with millimeter wave radar. ACM Transactions on Graphics (TOG) 35, 4: 142.  ",
      "doi": "10.1145/2897824.2925953"
    },
    {
      "text": "Henry C. Lin, Izhak Shafran, David Yuh, and Gregory D. Hager. 2006. Towards automatic skill evaluation: Detection and segmentation of robot-assisted surgical motions. Computer Aided Surgery 11, 5: 220--230.",
      "doi": ""
    },
    {
      "text": "Zhuohua Lin, Munenori Uemura, Massimiliano Zecca, et al. 2013. Objective skill evaluation for laparoscopic training based on motion analysis. IEEE Transactions on Biomedical Engineering 60, 4: 977--985.",
      "doi": ""
    },
    {
      "text": "Jiming Liu, Chi Kuen Wong, and Ka Keung Hui. 2003. An adaptive user interface based on personalized learning. IEEE Intelligent Systems 18, 2: 52--57.  ",
      "doi": "10.1109/MIS.2003.1193657"
    },
    {
      "text": "Paul Lukowicz, Jamie A Ward, Holger Junker, et al. 2004. Recognizing Workshop Activity Using Body Worn Microphones and Accelerometers. In Pervasive Computing, 18--32.",
      "doi": ""
    },
    {
      "text": "John D. Mason, James Ansell, Neil Warren, and Jared Torkington. 2013. Is motion analysis a valid tool for assessing laparoscopic skill? Surgical endoscopy 27, 5: 1468--1477.",
      "doi": ""
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2011. Ambient help. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11), 2751--2760.  ",
      "doi": "10.1145/1978942.1979349"
    },
    {
      "text": "Dan Maynes-Aminzade, Terry Winograd, and Takeo Igarashi. 2007. Eyepatch: prototyping camera-based interaction through examples. In Proceedings of the 20th annual ACM symposium on User interface software and technology (UIST'07), 33--42.  ",
      "doi": "10.1145/1294211.1294219"
    },
    {
      "text": "David A. Mellis, Leah Buechley, Mitchel Resnick, and Bjorn Hartmann. 2016. Engaging Amateurs in the Design, Fabrication, and Assembly of Electronic Devices. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems.  ",
      "doi": "10.1145/2901790.2901833"
    },
    {
      "text": "Emmanuel Munguia Tapia, Stephen S. Intille, and Kent Larson. 2007. Portable Wireless Sensors for Object Usage Sensing in the Home: Challenges and Practicalities. In Proceedings of the 2007 European conference on Ambient intelligence (AmI'07), 19--37. ",
      "doi": "10.5555/1775401.1775404"
    },
    {
      "text": "Y. Munz, B. D. Kumar, K. Moorthy, S. Bann, and A. Darzi. 2004. Laparoscopic virtual reality and box trainers: is one superior to the other? Surgical Endoscopy and Other Interventional Techniques 18, 3: 485--494.",
      "doi": ""
    },
    {
      "text": "Brian O'Connell. 2015. Going from Curious to Maker: New User Experiences in a University Makerspace. VentureWell. Proceedings of Open, the Annual Conference, National Collegiate Inventors & Innovators Alliance, 1.",
      "doi": ""
    },
    {
      "text": "H. Pirsiavash and D. Ramanan. 2012. Detecting activities of daily living in first-person camera views. IEEE Conference on Computer Vision and Pattern Recognition (CVPR), 2847--2854. ",
      "doi": "10.5555/2354409.2355089"
    },
    {
      "text": "Nalini K. Ratha, Jonathan H. Connell, and Ruud M. Bolle. 2001. Enhancing security and privacy in biometrics-based authentication systems. IBM systems Journal 40, 3: 614--634.  ",
      "doi": "10.1147/sj.403.0614"
    },
    {
      "text": "Nishkam Ravi, Nikhil Dandekar, Preetham Mysore, and Michael L. Littman. 2005. Activity recognition from accelerometer data. In Proceedings of the 17th conference on Innovative applications of artificial intelligence (IAAI'05), 1541--1546. ",
      "doi": "10.5555/1620092.1620107"
    },
    {
      "text": "Carol E. Reiley, Henry C. Lin, David D. Yuh, and Gregory D. Hager. 2011. Review of methods for objective surgical skill evaluation. Surgical Endoscopy 25, 2: 356--366.",
      "doi": ""
    },
    {
      "text": "Neil Rittenhouse, Bharat Sharma, Ranil Sonnadara, Alex Mihailidis, and Teodor Grantcharov. 2014. Design and validation of an assessment tool for open surgical procedures. Surgical endoscopy 28, 3: 918--924.",
      "doi": ""
    },
    {
      "text": "Jacob Rosen and Blake Hannaford. 2000. Objective Evaluation Of Laparoscopic Surgical Skills Using Hidden Markov Models Based On Haptic Information And Tool/tissue Interactions 13.",
      "doi": ""
    },
    {
      "text": "Daniel Salber, Anind K. Dey, and Gregory D. Abowd. 1999. The Context Toolkit: Aiding the Development of Context-enabled Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '99), 434--441.  ",
      "doi": "10.1145/302979.303126"
    },
    {
      "text": "Munehiko Sato, Rohan S. Puri, Alex Olwal, et al. 2017. Zensei: Embedded, multi-electrode bioimpedance sensing for implicit, ubiquitous user recognition. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI'17).  ",
      "doi": "10.1145/3025453.3025536"
    },
    {
      "text": "Eldon Schoop, Michelle Nguyen, Daniel Lim, Valkyrie Savage, Sean Follmer, and Bjorn Hartmann. 2016. Drill Sergeant: Supporting Physical Construction Projects through an Ecosystem of Augmented Tools. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA'16), 1607--1614.  ",
      "doi": "10.1145/2851581.2892429"
    },
    {
      "text": "Makoto Segawa, Masaya Okada, Kazumi Renge, Masahiro Tada, Haruo Noma, and Akira Utsumi. 2014. Elderly driver retraining using automatic evaluation system of safe driving skill. IET Intelligent Transport Systems 8, 3: 266--272.",
      "doi": ""
    },
    {
      "text": "Weidong Shi, Jun Yang, Yifei Jiang, Feng Yang, and Yingen Xiong. 2011. Senguard: Passive user identification on smartphones using multiple sensors. IEEE 7th International Conference on Wireless and Mobile Computing, Networking and Communications (WiMob'11), 141--148.  ",
      "doi": "10.1109/WiMOB.2011.6085412"
    },
    {
      "text": "Dimitrios Stefanidis, James R. Korndorffer Jr, B. Todd Heniford, and Daniel J. Scott. 2007. Limited feedback and video tutorials optimize learning and resource utilization during laparoscopic simulator training. Surgery 142, 2: 202--206.",
      "doi": ""
    },
    {
      "text": "Thomas Stiefmeier, Daniel Roggen, Georg Ogris, Paul Lukowicz, and Gerhard Tro'ster. 2008. Wearable activity tracking in car manufacturing. IEEE Pervasive Computing 7, 2.  ",
      "doi": "10.1109/MPRV.2008.40"
    },
    {
      "text": "Jeanett Strandbygaard, Flemming Bjerrum, Mathilde Maagaard, et al. 2013. Instructor feedback versus no instructor feedback on performance in a laparoscopic virtual reality simulator: a randomized trial. Annals of surgery 257, 5: 839--844.",
      "doi": ""
    },
    {
      "text": "Yasutaka Tashiro, Hiromasa Miura, Yoshitaka Nakanishi, Ken Okazaki, and Yukihide Iwamoto. 2009. Evaluation of skills in arthroscopic training based on trajectory and force data. Clinical orthopaedics and related research 467, 2: 546--552.",
      "doi": ""
    },
    {
      "text": "Hoang Minh Thang, Vo Quang Viet, Nguyen Dinh Thuc, and Deokjai Choi. 2012. Gait identification using accelerometer on mobile phone. IEEE International Conference on Control, Automation and Information Sciences (ICCAIS'12), 344--348.",
      "doi": ""
    },
    {
      "text": "Massimo Tistarelli and Enrico Grosso. 2000. Active visionbased face authentication. Image and Vision Computing.",
      "doi": ""
    },
    {
      "text": "Jamie A Ward and Gerhard Tro ster. 2006. Activity Recognition of Assembly Tasks Using Body-Worn Microphones and Accelerometers. IEEE Transactions on Pattern Analysis and Machine Intelligence 28, 10: 15.  ",
      "doi": "10.1109/TPAMI.2006.197"
    },
    {
      "text": "M. Weiser. 1995. The computer for the 21st century. Scientific American 272, 3: 78--89.",
      "doi": ""
    },
    {
      "text": "Simplelink SensorTag - TI.com. Retrieved April 11, 2016 from http://www.ti.com/ww/en/wireless_connectivity/sensortag2 015/?INTC=SensorTag&HQS=sensortag",
      "doi": ""
    },
    {
      "text": "Pupil Labs - Pupil. Retrieved September 21, 2018 from https://pupil-labs.com/pupil/",
      "doi": ""
    },
    {
      "text": "Watch. Apple. Retrieved September 21, 2018 from https://www.apple.com/watch/",
      "doi": ""
    },
    {
      "text": "PJRC Store. Retrieved September 21, 2018 from https://www.pjrc.com/store/teensy32.html",
      "doi": ""
    }
  ]
}