{
  "doi": "10.1145/3290605.3300735",
  "title": "Embodied Imagination: An Approach to Stroke Recovery Combining Participatory Performance and Interactive Technology",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Participatory performance provides methods for exploring social identities and situations in ways that can help people to imagine new ways of being. Digital technologies provide tools that can help people envision these possibilities. We explore this combination through a performance workshop process designed to help stroke survivors imagine new physical and social possibilities by enacting fantasies of \"things they always wanted to do\". This process uses performance methods combined with specially designed real-time movement visualisations to progressively build fantasy narratives that are enacted with and for other workshop participants. Qualitative evaluations suggest this process successfully stimulates participant's embodied imagination and generates a diverse range of fantasies. The interactive and communal aspects of the workshop process appear to be especially important in achieving these effects. This work highlights how the combination of performance methods and interactive tools can bring a rich, prospective and political understanding of people's lived experience to design.",
  "tags": [
    "peer and social support",
    "stroke",
    "participatory performance",
    "embodied experiences",
    "social interaction",
    "motion capture"
  ],
  "authors": [
    {
      "name": "Rosella P. Galindo Esparza",
      "institution": "Queen Mary University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659523614",
      "orcid": "missing"
    },
    {
      "name": "Patrick G. T. Healey",
      "institution": "Queen Mary University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444593397",
      "orcid": "missing"
    },
    {
      "name": "Lois Weaver",
      "institution": "Queen Mary University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444598854",
      "orcid": "missing"
    },
    {
      "name": "Matthew Delbridge",
      "institution": "Melbourne University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659297703",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ann Elizabeth Armstrong. 2005. Building Coalitional Spaces in Lois Weaver's Performance Pedagogy. Theatre Topics 15, 2 (2005), 201--219.",
      "doi": ""
    },
    {
      "text": "American Stroke Association. {n. d.}. Successful Stroke Support Groups. Technical Report. USA. 28 pages. https: //www.strokeassociation.org/idc/groups/stroke-public/@wcm/ @hcm/@sta/documents/downloadable/ucm_309688.pdf",
      "doi": ""
    },
    {
      "text": "Stroke Association. 2018. Peer support for people affected by stroke. https://www.stroke.org.uk/finding-support/peer-support/ stroke-clubs-and-groups",
      "doi": ""
    },
    {
      "text": "Michael Baran, Nicole Lehrer, Margaret Duff, Vinay Venkataraman, Pavan Turaga, Todd Ingalls, W. Zev Rymer, Steven L. Wolf, and Thanassis Rikakis. 2015. Interdisciplinary Concepts for Design and Implementation of Mixed Reality Interactive Neurorehabilitation Systems for Stroke. Physical Therapy 95, 3 (2015), 350--359.",
      "doi": ""
    },
    {
      "text": "Michael Baran, Nicole Lehrer, Diana Siwiak, Yinpeng Chen, Margaret Duff, Todd Ingalls, and Thanassis Rikakis. 2011. Design of a HomeBased Adaptive Mixed Reality Rehabilitation System for Stroke Survivors. (2011), 7602--7605.",
      "doi": ""
    },
    {
      "text": "Augusto Boal. 2000. Theater of the Oppressed. Pluto Press.",
      "doi": ""
    },
    {
      "text": "Joke Bradt, Minjung Shim, and Sherry W Goodill. 2015. Dance/movement therapy for improving psychological and physical outcomes in cancer patients. Cochrane Database of Systematic Reviews (jan 2015).",
      "doi": ""
    },
    {
      "text": "Sue-Ellen Case. 1996. Split Britches: Lesbian Practice/Feminist Performance. Routledge, London-New York.",
      "doi": ""
    },
    {
      "text": "Yinpeng Chen, Nicole Lehrer, Hari Sundaram, and Thanassis Rikakis. 2010. Adaptive mixed reality stroke rehabilitation: System architecture and evaluation metrics. MMSys'10 - Proceedings of the 2010 ACM SIGMM Conference on Multimedia Systems (2010), 293--304.  ",
      "doi": "10.1145/1730836.1730872"
    },
    {
      "text": "Alain de Botton and John Armstrong. 2013. Art as therapy. Phaidon Press Limited, London. 239 pages.",
      "doi": ""
    },
    {
      "text": "Anna De Simoni, Andrew Shanks, Chantal Balasooriya-Smeekens, and Jonathan Mant. 2016. Stroke survivors and their families receive information and support on an individual basis from an online forum: descriptive analysis of a population of 2348 patients and qualitative study of a sample of participants. BMJ Open 6, 4 (apr 2016), e010501.",
      "doi": ""
    },
    {
      "text": "Matt Delbridge and Lee McGowan. 2015. Green: Exploring the aestheticized use of chroma-key techniques and technologies in two intermedial productions. Body, Space and Technology 14 (2015).",
      "doi": ""
    },
    {
      "text": "Ines Di Loreto and Abdelkader Gouaïch. 2011. Mixed reality serious games: The therapist perspective. 2011 IEEE 1st International Conference on Serious Games and Applications for Health, SeGAH 2011 (2011).  ",
      "doi": "10.1109/SeGAH.2011.6165462"
    },
    {
      "text": "Holly Dorning, Miranda Davies, Cono Ariti, Allen Kerry, and Theo Georghiou. 2016. Knowing you're not alone: Understanding peer support for stroke survivors. Technical Report. Nuffield Trust, UK. https://www.nuffieldtrust.org.uk/research/ knowing-you-re-not-alone-understanding-peer-support-for-stroke-survivors",
      "doi": ""
    },
    {
      "text": "Margaret Duff, Yinpeng Chen, Suneth Attygalle, Janice Herman, Hari Sundaram, Gang Qian, Jiping He, and Thanassis Rikakis. 2010. An Adaptive Mixed Reality Training System for Stroke Rehabilitation. Ieee Transactions on Neural Systems and Rehabilitation Engineering 18, 5 (2010), 531--541.",
      "doi": ""
    },
    {
      "text": "Sherry L. Dupuis, Gail J. Mitchell, Christine M. Jonas-Simpson, Colleen P. Whyte, Jennifer L. Gillies, and Jennifer D. Carson. 2016. Igniting Transformative Change in Dementia Care Through Researchbased Drama. The Gerontologist 56, 6 (dec 2016), 1042--1052.",
      "doi": ""
    },
    {
      "text": "Mental Health Foundation. 2018. Mental Health Foundation website. https://www.mentalhealth.org.uk/",
      "doi": ""
    },
    {
      "text": "Rosella P. Galindo Esparza, Patrick G.T. Healey, Lois Weaver, and Matthew Delbridge. 2018. Augmented Embodiment: Developing Interactive Technology for Stroke Survivors. In 5th International Conference on Movement and Computing.  ",
      "doi": "10.1145/3212721.3212845"
    },
    {
      "text": "Ben Gillespie. 2013. Ruff by Peggy Shaw and Lois Weaver (review). Theatre Journal 65, 4 (2013), 576--577.",
      "doi": ""
    },
    {
      "text": "Jen Harvie and Lois Weaver. 2015. The Only Way Home is Through the Show. Performance Work of Lois Weaver. Live Art Development Agency.",
      "doi": ""
    },
    {
      "text": "Nadia Hocine and Abdelkader Gouaïch. 2011. Therapeutic games' difficulty adaptation: An approach based on player's ability and motivation. In 2011 16th International Conference on Computer Games (CGAMES). 257--261.  ",
      "doi": "10.1109/CGAMES.2011.6000349"
    },
    {
      "text": "Joanna Jaaniste, Sheridan Linnell, Richard L. Ollerton, and Shameran Slewa-Younan. 2015. Drama therapy with older people with dementia - Does it improve quality of life? The Arts in Psychotherapy (2015).",
      "doi": ""
    },
    {
      "text": "Miller James and David Read Johnson. 1996. Drama therapy in the treatment of combat-related post-traumatic stress disorder. The Arts in Psychotherapy (1996).",
      "doi": ""
    },
    {
      "text": "A. Jensen and LO. Bonde. 2018. The use of arts interventions for mental health and wellbeing in health settings. Perspectives in Public Health 138, 4 (jul 2018), 209--214.",
      "doi": ""
    },
    {
      "text": "Dorothy Kessler, Mary Egan, and Lucy-Ann Kubina. 2014. Peer support for stroke survivors: a case study. BMC Health Services Research (2014).",
      "doi": ""
    },
    {
      "text": "Marie Sophie Kiepe, Barbara Stöckigt, and Thomas Keil. 2012. Effects of dance therapy and ballroom dances on physical and mental illnesses: A systematic review. Arts in Psychotherapy (2012).",
      "doi": ""
    },
    {
      "text": "Lone Koefoed Hansen and Susan Kozel. 2007. Embodied imagination: a hybrid method of designing for intimacy. Digital Creativity 18, 4 (2007), 207--220.",
      "doi": ""
    },
    {
      "text": "Willeke J. Kruithof, Maria L. van Mierlo, Johanna M. A. Visser-Meily, Caroline M. van Heugten, and Marcel W. M. Post. 2013. Associations between social support and stroke survivors' health-related quality of life - A systematic review. Patient Education and Counseling 93, 2 (2013), 169--176.",
      "doi": ""
    },
    {
      "text": "Sohye Lee, Erica Schorr, Niloufar Niakosari Hadidi, Robin Kelley, Diane Treat-Jacobson, and Ruth Lindquist. 2018. Power of Peer Support to Change Health Behavior to Reduce Risks for Heart Disease and Stroke for African American Men in a Faith-Based Community.",
      "doi": ""
    },
    {
      "text": "Nicole Lehrer, Suneth Attygalle, Steven L. Wolf, and Thanassis Rikakis. 2011. Exploring the bases for a mixed reality stroke rehabilitation system, Part I: A unified approach for representing action, quantitative evaluation, and interactive feedback. Journal of NeuroEngineering and Rehabilitation 8, 1 (2011), 15.",
      "doi": ""
    },
    {
      "text": "Nicole Lehrer and Loren Olson. 2009. Visual feedback for Mixed Reality stroke rehabilitation. October 2008 (2009), 194--194.",
      "doi": ""
    },
    {
      "text": "Ann Light. 2011. Democratising technology: Making transformation using designing, performance and props. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2239--2242.  ",
      "doi": "10.1145/1978942.1979269"
    },
    {
      "text": "Ann Light, Gini Simpson, Lois Weaver, and Patrick G.T. Healey. 2009. Geezers, turbines, fantasy personas. In Proceeding of the seventh ACM conference on Creativity and cognition - C&C '09. ACM Press, New York, New York, USA, 39.  ",
      "doi": "10.1145/1640233.1640243"
    },
    {
      "text": "Ann Light, Lois Weaver, Patick Healey, and Gini Simpson. 2008. Adventures in the Not Quite Yet: using performance techniques to raise design awareness about digital networks. In Undisciplined! Proceedings of the Design Research Society Conference 2008. Sheffield Hallam University Research Archive.",
      "doi": ""
    },
    {
      "text": "Keith W. Muir. 2009. Stroke. Medicine 37, 2 (2009), 109--114.",
      "doi": ""
    },
    {
      "text": "Jamie O'Brien. 2008. Virtual environments for stroke rehabilitation: examining a novel technology against end-user, clinical and management demands with reference to UK care provision. Ph.D. Dissertation. http: //eprints.ucl.ac.uk/12765/",
      "doi": ""
    },
    {
      "text": "Olufemi O. Oyewole, Michael O. Ogunlana, Kolawole S. Oritogun, and Caleb A. Gbiri. 2016. Post-stroke disability and its predictors among Nigerian stroke survivors. Disability and Health Journal 9, 4 (2016), 616--623.",
      "doi": ""
    },
    {
      "text": "M. Parsons. 2009. Over the Moon: Effectiveness of Using Interactive Drama in a Dementia Care Setting. London, UK: London Centre for Dementia Care by Central & Cecil, Housing Care Support. Available at http://www. artz-uk. org/inthenewsimages/OvertheMoon_Parsons. pdf (accessed 23 March 2016) (2009).",
      "doi": ""
    },
    {
      "text": "Isaac Pastor. 2012. Upper Limb Rehabilitation of Stroke Patients using Kinect and Computer Games. Ph.D. Dissertation. University of Utah.",
      "doi": ""
    },
    {
      "text": "James L. Patton, Mary Ellen Stoykov, Mark Kovic, and Ferdinando A. Mussa-Ivaldi. 2006. Evaluation of robotic training forces that either enhance or reduce error in chronic hemiparetic stroke survivors. Experimental Brain Research 168, 3 (2006), 368--383.",
      "doi": ""
    },
    {
      "text": "The Place and Life Rosetta. 2013. Remembering who I am - A stroke rehabilitation project using dance and movement.",
      "doi": ""
    },
    {
      "text": "Frances Reynolds. 2012. Art therapy after stroke: Evidence and a need for further research. The Arts in Psychotherapy 39, 4 (2012), 239--244.",
      "doi": ""
    },
    {
      "text": "Craig Robertson, Liam Vink, Holger Regenbrecht, Christof Lutteroth, and Burkhard C. Wunsche. 2013. Mixed reality Kinect Mirror box for stroke rehabilitation. International Conference Image and Vision Computing New Zealand (2013), 231--235.",
      "doi": ""
    },
    {
      "text": "Euan Sadler, Sophie Sarre, Anthea Tinker, Ajay Bhalla, and Christopher McKevitt. 2017. Developing a novel peer support intervention to promote resilience after stroke. Health & Social Care in the Community (2017).",
      "doi": ""
    },
    {
      "text": "Gary Stewart and Susan Hillier. 2015. A world first! performance.",
      "doi": ""
    },
    {
      "text": "Sandeep Subramanian, Luiz A. Knaut, Christian Beaudoin, Bradford J. McFadyen, Anatol G. Feldman, and Mindy F. Levin. 2007. Virtual reality environments for post-stroke arm rehabilitation. Journal of NeuroEngineering and Rehabilitation 4, 1 (2007), 20.",
      "doi": ""
    },
    {
      "text": "Stroke Association UK. 2016. Stroke Recovery. https://www.stroke. org.uk/what-is-stroke/diagnosis-to-discharge/recovery",
      "doi": ""
    },
    {
      "text": "Lois Weaver. 2009. Doing Time: A personal and practical account of making performance work in prisons. The applied theatre reader (2009), 55--61.",
      "doi": ""
    },
    {
      "text": "Lois Weaver and Peggy Shaw. 2018. RUFF. PAJ: A Journal of Performance and Art 40, 20 (2018), 108--132.",
      "doi": ""
    },
    {
      "text": "Hannah Zeilig, John Killick, and Chris Fox. 2014. The participative arts for people living with a dementia: a critical review. International Journal of Ageing and Later Life 9, 1 (2014), 7--34.",
      "doi": ""
    },
    {
      "text": "Hannah Zeilig, Julian West, and Millie van der Byl Williams. 2018. Cocreativity: possibilities for using the arts with people with a dementia. Quality in Ageing and Older Adults (2018).",
      "doi": ""
    },
    {
      "text": "Melvyn W. Zhang, Leonard L. Yeo, and Roger C. Ho. 2015. Harnessing smartphone technologies for stroke care, rehabilitation and beyond. BMJ Innovations 1, 4 (oct 2015), 145--150.",
      "doi": ""
    }
  ]
}