{
  "doi": "10.1145/3290605.3300298",
  "title": "Concept-Driven Visual Analytics: an Exploratory Study of Model- and Hypothesis-Based Reasoning with Visualizations",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Visualization tools facilitate exploratory data analysis, but fall short at supporting hypothesis-based reasoning. We conducted an exploratory study to investigate how visualizations might support a concept-driven analysis style, where users can optionally share their hypotheses and conceptual models in natural language, and receive customized plots depicting the fit of their models to the data. We report on how participants leveraged these unique affordances for visual analysis. We found that a majority of participants articulated meaningful models and predictions, utilizing them as entry points to sensemaking. We contribute an abstract typology representing the types of models participants held and externalized as data expectations. Our findings suggest ways for rearchitecting visual analytics tools to better support hypothesis- and model-based reasoning, in addition to their traditional role in exploratory analysis. We discuss the design implications and reflect on the potential benefits and challenges involved.",
  "tags": [
    "hypothesis- and model-based reasoning",
    "visual analytics",
    "mental models",
    "sensemaking"
  ],
  "authors": [
    {
      "name": "In Kwon Choi",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365892",
      "orcid": "missing"
    },
    {
      "name": "Taylor Childers",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365897",
      "orcid": "missing"
    },
    {
      "name": "Nirmal Kumar Raveendranath",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366447",
      "orcid": "missing"
    },
    {
      "name": "Swati Mishra",
      "institution": "Cornell University, Ithaca, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365957",
      "orcid": "missing"
    },
    {
      "name": "Kyle Harris",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366566",
      "orcid": "missing"
    },
    {
      "name": "Khairi Reda",
      "institution": "Indiana University-Purdue University Indianapolis, Indianapolis, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81552730756",
      "orcid": "0000-0002-8096-658X"
    }
  ],
  "references": [
    {
      "text": "Gregor Aisch, Amanda Cox, and Kevin Quealy. 2008. You Draw It: How Family Income Predicts Children's College Chances. http://nyti. ms/1ezbuWY. (2008). {Online; accessed 25-August-2018}.",
      "doi": ""
    },
    {
      "text": "Robert Amar, James Eagan, and John Stasko. 2005. Low-level components of analytic activity in information visualization. In Information Visualization, 2005. INFOVIS 2005. IEEE Symposium on. IEEE, 111--117.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Jillian Aurisano, Abhinav Kumar, Alberto Gonzales, Khairi Reda, Jason Leigh, Barbara Di Eugenio, and Andrew Johnson. 2015. \"Show me data\": Observational study of a conversational interface in visual data exploration. In IEEE VIS posters.",
      "doi": ""
    },
    {
      "text": "World Bank. 2018. World Development Index. https://data.worldbank. org/indicator. (2018). {Online; accessed 25-August-2018}.",
      "doi": ""
    },
    {
      "text": "Matthew Brehmer and Tamara Munzner. 2013. A multi-level typology of abstract visualization tasks. IEEE Transactions on Visualization and Computer Graphics 19, 12 (2013), 2376--2385.  ",
      "doi": "10.1109/TVCG.2013.124"
    },
    {
      "text": "Stuart Card, Jock Mackinlay, and Ben Shneiderman. 1999. Readings in information visualization: using vision to think. Morgan Kaufmann. ",
      "doi": "10.5555/300679"
    },
    {
      "text": "Remco Chang, Caroline Ziemkiewicz, Tera Marie Green, and William Ribarsky. 2009. Defining insight for visual analytics. IEEE Computer Graphics and Applications 29, 2 (2009), 14--17.",
      "doi": "10.5555/1669282.1669285"
    },
    {
      "text": "Wei Chen. 2009. Understanding mental states in natural language. In Proceedings of the Eighth International Conference on Computational Semantics. Association for Computational Linguistics, 61--72. ",
      "doi": "10.5555/1693756.1693766"
    },
    {
      "text": "Big Cities Health Coalition. 2018. Health Inventory Data. http://www. bigcitieshealth.org. (2018). {Online; accessed 25-August-2018}.",
      "doi": ""
    },
    {
      "text": "Kedar Dhamdhere, Kevin S McCurley, Ralfi Nahmias, Mukund Sundararajan, and Qiqi Yan. 2017. Analyza: Exploring data with conversation. In Proceedings of the 22nd International Conference on Intelligent User Interfaces. ACM, 493--504.  ",
      "doi": "10.1145/3025171.3025227"
    },
    {
      "text": "Kevin Dunbar. 1993. Concept discovery in a scientific domain. Cognitive Science 17, 3 (1993), 397--434.",
      "doi": ""
    },
    {
      "text": "Kevin Dunbar. 1997. How scientists think: On-line creativity and conceptual change in science. Creative thought: An investigation of conceptual structures and processes 4 (1997).",
      "doi": ""
    },
    {
      "text": "Kevin Dunbar. 2001. What scientific thinking reveals about the nature of cognition. Designing for science: Implications from everyday, classroom, and professional settings (2001), 115--140.",
      "doi": ""
    },
    {
      "text": "Alex Endert, Patrick Fiaux, and Chris North. 2012. Semantic interaction for sensemaking: inferring analytical reasoning for model steering. IEEE TVCG 18, 12 (2012), 2879--2888.  ",
      "doi": "10.1109/TVCG.2012.260"
    },
    {
      "text": "Tong Gao, Mira Dontcheva, Eytan Adar, Zhicheng Liu, and Karrie G Karahalios. 2015. Datatone: Managing ambiguity in natural language interfaces for data visualization. In Proc. ACM UIST'15. ACM, 489--500.  ",
      "doi": "10.1145/2807442.2807478"
    },
    {
      "text": "Michael S Glass and Martha W Evens. 2008. Extracting information from natural language input to an intelligent tutoring system. Far Eastern Journal of Experimental and Theoretical Artificial Intelligence 1, 2 (2008).",
      "doi": ""
    },
    {
      "text": "David Gotz and Michelle X Zhou. 2009. Characterizing users' visual analytic activity for insight provenance. Information Visualization 8, 1 (2009), 42--55.  ",
      "doi": "10.1057/ivs.2008.31"
    },
    {
      "text": "David Gotz, Michelle X Zhou, and Vikram Aggarwal. 2006. Interactive visual synthesis of analytic knowledge. In Visual Analytics Science And Technology, 2006 IEEE Symposium On. IEEE, 51--58.",
      "doi": ""
    },
    {
      "text": "Lars Grammel, Melanie Tory, and Margaret-Anne Storey. 2010. How information visualization novices construct visualizations. IEEE Transactions on Visualization and Computer Graphics 16, 6 (2010), 943--952.  ",
      "doi": "10.1109/TVCG.2010.164"
    },
    {
      "text": "Jeffrey Heer and Ben Shneiderman. 2012. Interactive dynamics for visual analysis. Queue 10, 2 (2012), 30.  ",
      "doi": "10.1145/2133416.2146416"
    },
    {
      "text": "Daniel Keim, Gennady Andrienko, Jean-Daniel Fekete, Carsten Görg, Jörn Kohlhammer, and Guy Melançon. 2008. Visual analytics: Definition, process, and challenges. In Information visualization. Springer, 154--175.  ",
      "doi": "10.1007/978-3-540-70956-5_7"
    },
    {
      "text": "Steve Kelling, Wesley M Hochachka, Daniel Fink, Mirek Riedewald, Rich Caruana, Grant Ballard, and Giles Hooker. 2009. Data-intensive science: a new paradigm for biodiversity studies. BioScience 59, 7 (2009), 613--620.",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Katharina Reinecke, and Jessica Hullman. 2017. Explaining the gap: Visualizing one's predictions improves recall and comprehension of data. In Proc CHI'17. ACM, 1375--1386.  ",
      "doi": "10.1145/3025453.3025592"
    },
    {
      "text": "Yea-Seul Kim, Katharina Reinecke, and Jessica Hullman. 2018. Data Through Others' Eyes: The Impact of Visualizing Others' Expectations on Visualization Interpretation. IEEE Transactions on Visualization & Computer Graphics 1 (2018), 1--1.",
      "doi": ""
    },
    {
      "text": "David Klahr and Kevin Dunbar. 1988. Dual space search during scientific reasoning. Cognitive science 12, 1 (1988), 1--48.",
      "doi": ""
    },
    {
      "text": "Gary Klein, Brian Moon, and Robert R Hoffman. 2006. Making sense of sensemaking 1: Alternative perspectives. IEEE intelligent systems 4 (2006), 70--73.  ",
      "doi": "10.1109/MIS.2006.75"
    },
    {
      "text": "Gary Klein, Brian Moon, and Robert R Hoffman. 2006. Making sense of sensemaking 2: A macrocognitive model. IEEE Intelligent systems 21, 5 (2006), 88--92.  ",
      "doi": "10.1109/MIS.2006.100"
    },
    {
      "text": "Gary Klein, Jennifer K Phillips, Erica L Rall, and Deborah A Peluso. 2007. A data-frame theory of sensemaking. In Expertise out of context: Proceedings of the sixth international conference on naturalistic decision making. New York, NY, USA: Lawrence Erlbaum, 113--155.",
      "doi": ""
    },
    {
      "text": "Christian Lebiere, Peter Pirolli, Robert Thomson, Jaehyon Paik, Matthew Rutledge-Taylor, James Staszewski, and John R Anderson. 2013. A functional model of sensemaking in a neurocognitive architecture. Computational intelligence and neuroscience 2013 (2013), 5.  ",
      "doi": "10.1155/2013/921695"
    },
    {
      "text": "Mihai Lintean, Vasile Rus, and Roger Azevedo. 2012. Automatic detection of student mental models based on natural language student input during metacognitive skill training. International Journal of Artificial Intelligence in Education 21, 3 (2012), 169--190. ",
      "doi": "10.5555/2512562.2512563"
    },
    {
      "text": "Zhicheng Liu and Jeffrey Heer. 2014. The effects of interactive latency on exploratory visual analysis. IEEE Transactions on Visualization & Computer Graphics 1 (2014), 1--1.",
      "doi": ""
    },
    {
      "text": "Zhicheng Liu and John Stasko. 2010. Mental models, visual reasoning and interaction in information visualization: A top-down perspective. IEEE Transactions on Visualization & Computer Graphics 6 (2010), 999-- 1008.  ",
      "doi": "10.1109/TVCG.2010.177"
    },
    {
      "text": "Jock Mackinlay, Pat Hanrahan, and Chris Stolte. 2007. Show me: Automatic presentation for visual analysis. IEEE Transactions on Visualization and Computer Graphics 13, 6 (2007).  ",
      "doi": "10.1109/TVCG.2007.70594"
    },
    {
      "text": "Mary L McHugh. 2012. Interrater reliability: the kappa statistic. Biochemia medica: Biochemia medica 22, 3 (2012), 276--282.",
      "doi": ""
    },
    {
      "text": "Chris North. 2006. Toward measuring visualization insight. IEEE computer graphics and applications 26, 3 (2006), 6--9.  ",
      "doi": "10.1109/MCG.2006.70"
    },
    {
      "text": "Hyacinth S Nwana. 1990. Intelligent tutoring systems: an overview. Artificial Intelligence Review 4, 4 (1990), 251--277.",
      "doi": ""
    },
    {
      "text": "Peter Pirolli and Stuart Card. 2005. The sensemaking process and leverage points for analyst technology as identified through cognitive task analysis. In Proceedings of international conference on intelligence analysis, Vol. 5. McLean, VA, USA, 2--4.",
      "doi": ""
    },
    {
      "text": "Xiaoying Pu and Matthew Kay. 2018. The Garden of Forking Paths in Visualization: A Design Space for Reliable Exploratory Visual Analytics. In Proceedings of the 2018 BELIV Workshop: Evaluation and Beyond -- Methodological Approaches for Visualization.",
      "doi": ""
    },
    {
      "text": "Eric D Ragan, Alex Endert, Jibonananda Sanyal, and Jian Chen. 2016. Characterizing provenance in visualization and data analysis: an organizational framework of provenance types and purposes. IEEE Transactions on Visualization and Computer Graphics 22, 1 (2016), 31--",
      "doi": "10.1109/TVCG.2015.2467551"
    },
    {
      "text": "{40} Khairi Reda, Andrew E. Johnson, Michael E. Papka, and Jason Leigh. 2015. Effects of Display Size and Resolution on User Behavior and Insight Acquisition in Visual Exploration. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 2759--2768.  ",
      "doi": "10.1145/2702123.2702406"
    },
    {
      "text": "Khairi Reda, Andrew E Johnson, Michael E Papka, and Jason Leigh. 2016. Modeling and evaluating user behavior in exploratory visual analysis. Information Visualization 15, 4 (2016), 325--339.",
      "doi": ""
    },
    {
      "text": "Dominik Sacha, Andreas Stoffel, Florian Stoffel, Bum Chul Kwon, Geoffrey Ellis, and Daniel A Keim. 2014. Knowledge generation model for visual analytics. IEEE Transactions on Visualization and Computer Graphics 20, 12 (2014), 1604--1613.",
      "doi": ""
    },
    {
      "text": "Purvi Saraiya, Chris North, and Karen Duca. 2005. An insight-based methodology for evaluating bioinformatics visualizations. IEEE Transactions on Visualization and Computer Graphics 11, 4 (2005), 443--456.  ",
      "doi": "10.1109/TVCG.2005.53"
    },
    {
      "text": "Purvi Saraiya, Chris North, Vy Lam, and Karen A Duca. 2006. An insight-based longitudinal study of visual analytics. IEEE Transactions on Visualization and Computer Graphics 12, 6 (2006), 1511--1522.  ",
      "doi": "10.1109/TVCG.2006.85"
    },
    {
      "text": "Vidya Setlur, Sarah E Battersby, Melanie Tory, Rich Gossweiler, and Angel X Chang. 2016. Eviza: A natural language interface for visual analysis. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, 365--377.  ",
      "doi": "10.1145/2984511.2984588"
    },
    {
      "text": "Ben Shneiderman. 1996. The eyes have it: A task by data type taxonomy for information visualizations. In Proceedings of the IEEE Symposium on Visual Languages. IEEE, 336--343. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "Yedendra Babu Shrinivasan and Jarke J van Wijk. 2008. Supporting the analytical reasoning process in information visualization. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1237--1246.  ",
      "doi": "10.1145/1357054.1357247"
    },
    {
      "text": "Arjun Srinivasan and John Stasko. 2017. Natural language interfaces for data analysis with visualization: Considering what has and could be asked. In Proceedings of EuroVis, Vol. 17. 55--59.  ",
      "doi": "10.2312/eurovisshort.20171133"
    },
    {
      "text": "John Stasko, Carsten Görg, and Zhicheng Liu. 2008. Jigsaw: supporting investigative analysis through interactive visualization. Information visualization 7, 2 (2008), 118--132.  ",
      "doi": "10.1145/1466620.1466622"
    },
    {
      "text": "Ben Steichen, Giuseppe Carenini, and Cristina Conati. 2013. Useradaptive information visualization: using eye gaze data to infer visualization tasks and user cognitive abilities. In Proceedings of the 2013 international conference on Intelligent user interfaces. ACM, 317--328.  ",
      "doi": "10.1145/2449396.2449439"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1994. Grounded theory methodology. Handbook of qualitative research 17 (1994), 273--85.",
      "doi": ""
    },
    {
      "text": "Yiwen Sun, Jason Leigh, Andrew Johnson, and Sangyoon Lee. 2010. Articulate: A semi-automated model for translating natural language queries into meaningful visualizations. In International Symposium on Smart Graphics. Springer, 184--195. ",
      "doi": "10.5555/1894345.1894369"
    },
    {
      "text": "Susan Trickett and Gregory Trafton. 2007. A primer on verbal protocol analysis. In Handbook of virtual environment training, J. Cohn D. Schmorrow and Nicholson (Eds.). Chapter 18.",
      "doi": ""
    },
    {
      "text": "John W Tukey. 1980. We need both exploratory and confirmatory. The American Statistician 34, 1 (1980), 23--25.",
      "doi": ""
    },
    {
      "text": "Jarke J Van Wijk. 2005. The value of visualization. In Visualization, 2005. VIS 05. IEEE. IEEE, 79--86.",
      "doi": ""
    },
    {
      "text": "Emily Wall, Leslie M Blaha, Lyndsey Franklin, and Alex Endert. 2017. Warning, bias may occur: A proposed approach to detecting cognitive bias in interactive visual analytics. In IEEE Conference on Visual Analytics Science and Technology (VAST).",
      "doi": ""
    },
    {
      "text": "Jagoda Walny, Bongshin Lee, Paul Johns, Nathalie Henry Riche, and Sheelagh Carpendale. 2012. Understanding pen and touch interaction for data exploration on interactive whiteboards. IEEE Transactions on Visualization and Computer Graphics 18, 12 (2012), 2779--2788.  ",
      "doi": "10.1109/TVCG.2012.275"
    },
    {
      "text": "Emanuel Zgraggen, Zheguang Zhao, Robert Zeleznik, and Tim Kraska. 2018. Investigating the Effect of the Multiple Comparisons Problem in Visual Analysis. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 479, 12 pages.  ",
      "doi": "10.1145/3173574.3174053"
    }
  ]
}