{
  "doi": "10.1145/3290605.3300415",
  "title": "Sketching NLP: A Case Study of Exploring the Right Things To Design with Language Intelligence",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "This paper investigates how to sketch NLP-powered user experiences. Sketching is a cornerstone of design innovation. When sketching, designers rapidly experiment with a number of abstract ideas using simple, tangible instruments such as drawings and paper prototypes. Sketching NLP-powered experiences, however, presents challenges, i.e. How to visualize abstract language interaction? How to ideate a broad range of technically feasible intelligent functionalities? As a first step towards understanding these challenges, we present a first-person account of our sketching process when designing intelligent writing assistance. We detail the challenges we encountered and emergent solutions, such as a new format of wireframe for sketching language interactions and a new wizard-of-oz-based NLP rapid prototyping method. Drawing on these findings, we discuss the importance of abstraction in sketching and other implications.",
  "authors": [
    {
      "name": "Qian Yang",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-99659021698/rel-imgonly/qian.jpg",
      "acmid": "99659021698",
      "orcid": "0000-0002-3548-2535"
    },
    {
      "name": "Justin Cranshaw",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81438597110",
      "orcid": "missing"
    },
    {
      "name": "Saleema Amershi",
      "institution": "Microsoft Research, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323487634",
      "orcid": "missing"
    },
    {
      "name": "Shamsi T. Iqbal",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "The AllenNLP toolkit demo: Text Entailment. http://demo. allennlp.org/textual-entailment.",
      "doi": ""
    },
    {
      "text": "Jonathan Bean and Daniela Rosner. 2014. Big data, diminished design? interactions 21, 3 (2014), 18--19.  ",
      "doi": "10.1145/2592267"
    },
    {
      "text": "Steven Bird, Ewan Klein, and Edward Loper. 2009. Natural language processing with Python: analyzing text with the natural language toolkit. \" O'Reilly Media, Inc.\". ",
      "doi": "10.5555/1717171"
    },
    {
      "text": "Sara Bly and Elizabeth F Churchill. 1999. Design through matchmaking: technology in search of users. interactions 6, 2 (1999), 23--31.  ",
      "doi": "10.1145/296165.296174"
    },
    {
      "text": "Geofrey C Bowker and Susan Leigh Star. 2000. Sorting things out: Classifcation and its consequences. MIT press. ",
      "doi": "10.5555/380681"
    },
    {
      "text": "Richard Buchanan. 1992. Wicked problems in design thinking. Design issues 8, 2 (1992), 5--21.",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2010. Sketching user experiences: getting the design right and the right design. Morgan Kaufmann. ",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Ana Paula Chaves and Marco Aurelio Gerosa. 2018. Single or Multiple Conversational Agents?: An Interactional Coherence Comparison. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 191, 13 pages.  ",
      "doi": "10.1145/3173574.3173765"
    },
    {
      "text": "Elizabeth Clark, Anne Spencer Ross, Chenhao Tan, Yangfeng Ji, and Noah A. Smith. 2018. Creative Writing with a Machine in the Loop: Case Studies on Slogans and Stories. In 23rd International Conference on Intelligent User Interfaces (IUI '18). ACM, New York, NY, USA, 329--340.  ",
      "doi": "10.1145/3172944.3172983"
    },
    {
      "text": "Design Council. 2005. The 'double diamond' design process model. Design Council (2005).",
      "doi": ""
    },
    {
      "text": "Justin Cranshaw, Emad Elwany, Todd Newman, Rafal Kocielnik, Bowen Yu, Sandeep Soni, Jaime Teevan, and Andrés Monroy-Hernández. 2017. Calendar. help: Designing a workfow-based scheduling agent with humans in the loop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2382--2393.  ",
      "doi": "10.1145/3025453.3025780"
    },
    {
      "text": "C. Crumlish and E. Malone. 2015. Designing Social Interfaces: Principles, Patterns, and Practices for Improving the User Experience. O'Reilly Media. https://books.google.com/books?id=dchcCgAAQBAJ",
      "doi": ""
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX Design Innovation: Challenges for Working with Machine Learning as a Design Material. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, New York, New York, USA, 278--288.  ",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "Daniel Fallman. 2003. Design-oriented human-computer interaction. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 225--232.  ",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Melanie Feinberg. 2017. A Design Perspective on Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2952--2963.  ",
      "doi": "10.1145/3025453.3025837"
    },
    {
      "text": "Matt Gardner, Joel Grus, Mark Neumann, Oyvind Tafjord, Pradeep Dasigi, Nelson F. Liu, Matthew Peters, Michael Schmitz, and Luke S. Zettlemoyer. 2017. AllenNLP: A Deep Semantic Natural Language Processing Platform. arXiv:arXiv:1803.07640",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 937--946.  ",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Fabien Girardin and Neal Lathia. 2017. When User Experience Designers Partner with Data Scientists. In The AAAI Spring Symposium Series Technical Report: Designing the User Experience of Machine Learning Systems. The AAAI Press, Palo Alto, California. https: //www.aaai.org/ocs/index.php/SSS/SSS17/paper/view/15364",
      "doi": ""
    },
    {
      "text": "Elizabeth Goodman, Erik Stolterman, and Ron Wakkary. 2011. Understanding Interaction Design Practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1061--1070.  ",
      "doi": "10.1145/1978942.1979100"
    },
    {
      "text": "Patrick Hebron. 2016. Machine learning for designers. O'Reilly Media.",
      "doi": ""
    },
    {
      "text": "S. Hoober and E. Berkman. 2011. Designing Mobile Interfaces: Patterns for Interaction Design. O'Reilly Media. https://books.google.com/ books?id=j2eYAgAAQBAJ ",
      "doi": "10.5555/2161813"
    },
    {
      "text": "Stephanie Houde and Charles Hill. 1997. What do prototypes prototype? In Handbook of Human-Computer Interaction (Second Edition). Elsevier, 367--381.",
      "doi": ""
    },
    {
      "text": "Bogyeong Kim, Jaehoon Pyun, and Woohun Lee. 2018. Enhancing Storytelling Experience with Story-Aware Interactive Puppet. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article LBW076, 6 pages.  ",
      "doi": "10.1145/3170427.3188515"
    },
    {
      "text": "Scott R. Klemmer, Anoop K. Sinha, Jack Chen, James A. Landay, Nadeem Aboobaker, and Annie Wang. 2000. Suede: A Wizard of Oz Prototyping Tool for Speech User Interfaces. In Proceedings of the 13th Annual ACM Symposium on User Interface Software and Technology (UIST '00). ACM, New York, NY, USA, 1--10.  ",
      "doi": "10.1145/354401.354406"
    },
    {
      "text": "Panagiotis Louridas. 1999. Design as bricolage: anthropology meets design thinking. Design Studies 20, 6 (1999), 517--535.",
      "doi": ""
    },
    {
      "text": "Robert J. Moore, Raphael Arar, Guang-Jie Ren, and Margaret H. Szymanski. 2017. Conversational UX Design. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 492--497.  ",
      "doi": "10.1145/3027063.3027077"
    },
    {
      "text": "Camille Moussette. 2012. Simple haptics: Sketching perspectives for the design of haptic interactions. Ph.D. Dissertation. Umeå Universitet.",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu and Gerald Penn. 2014. Speech-based Interaction: Myths, Challenges, and Opportunities. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, New York, NY, USA, 567--568.  ",
      "doi": "10.1145/2628363.2645671"
    },
    {
      "text": "Donald Murray. 1972. Teach writing as a process not product. The Leafet 71, 3 (1972), 11--14.",
      "doi": ""
    },
    {
      "text": "Marianna Obrist, Rob Comber, Sriram Subramanian, Betina PiquerasFiszman, Carlos Velasco, and Charles Spence. 2014. Temporal, Afective, and Embodied Characteristics of Taste Experiences: A Framework for Design. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2853--2862.  ",
      "doi": "10.1145/2556288.2557007"
    },
    {
      "text": "Owain Pedgley. 2007. Capturing and analysing own design activity. Design studies 28, 5 (2007), 463--483.",
      "doi": ""
    },
    {
      "text": "Jenny Preece, Yvonne Rogers, and Helen Sharp. 2001. Beyond Interaction Design: Beyond Human-Computer Interaction. John Wiley & Sons, Inc., New York, NY, USA. ",
      "doi": "10.5555/558189"
    },
    {
      "text": "Johan Redström, Maria Redström, and Ramia Mazé. 2005. IT+ textiles. Edita Publishing Oy.",
      "doi": ""
    },
    {
      "text": "Rushit Sanghrajka, Daniel Hidalgo, Patrick P Chen, and Mubbasir Kapadia. 2017. Lisa: Lexically intelligent story assistant. In Proceedings of the 13th Artifcial Intelligence and Interactive Digital Entertainment Conference.",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, Kenton P. O'Hara, and Alex S. Taylor. 2018. Let's Talk About Race: Identity, Chatbots, and AI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 315, 14 pages.  ",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "Donald Schön and John Bennett. 1996. Refective conversation with materials. In Bringing design to software. ACM, 171--189. CHI 2019, May 4--9, 2019, Glasgow, Scotland Uk",
      "doi": ""
    },
    {
      "text": "Donald A Schön. 1984. The refective practitioner: How professionals think in action. Vol. 5126. Basic books.",
      "doi": ""
    },
    {
      "text": "A. Sefah and H. Javahery. 2005. Multiple User Interfaces: Cross-Platform Applications and Context-Aware Interfaces. Wiley. https://books.google. com/books?id=zRSsGC8ecAwC",
      "doi": ""
    },
    {
      "text": "Lisa Stifelman, Adam Elman, and Anne Sullivan. 2013. Designing Natural Speech Interactions for the Living Room. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, New York, NY, USA, 1215--1220.  ",
      "doi": "10.1145/2468356.2468574"
    },
    {
      "text": "Daniel S. Weld, Corin Anderson, Pedro Domingos, Oren Etzioni, Krzysztof Gajos, Tessa Lau, and Steve Wolfman. 2003. Automatically Personalizing User Interfaces. In Proceedings of the 18th International Joint Conference on Artifcial Intelligence (IJCAI'03). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 1613--1619. http://dl.acm.org/citation.cfm?id=1630659.1630944 ",
      "doi": "10.5555/1630659.1630944"
    },
    {
      "text": "Qian Yang, Nikola Banovic, and John Zimmerman. 2018. Mapping Machine Learning Advances from HCI Research to Reveal Starting Places for Design Research. In Proceedings of the SIGCHI Conference Q. Yang et al. on Human Factors in Computing Systems - CHI '18 (CHI '18). ACM.  ",
      "doi": "10.1145/3173574.3173704"
    },
    {
      "text": "Qian Yang, Alex Scuito, John Zimmerman, Jodi Forlizzi, and Aaron Steinfeld. 2018. Investigating How Experienced UX Designers Efectively Work with Machine Learning. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 585--596.  ",
      "doi": "10.1145/3196709.3196730"
    },
    {
      "text": "Qian Yang, John Zimmerman, Aaron Steinfeld, and Anthony Tomasic. 2016. Planning Adaptive Mobile Experiences When Wireframing. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS '16. ACM Press, Brisbane, QLD, Australia, 565--576.  ",
      "doi": "10.1145/2901790.2901858"
    },
    {
      "text": "Shichao Zhang, Chengqi Zhang, and Qiang Yang. 2003. Data preparation for data mining. Applied Artifcial Intelligence 17, 5--6 (2003), 375--381.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 493--502.  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}