{
  "doi": "10.1145/3290605.3300552",
  "title": "Older People Inventing their Personal Internet of Things with the IoT Un-Kit Experience",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [],
  "abstract": "We introduce the IoT Un-Kit Experience, a co-design approach that engages people in exploring, designing and generating personally meaningful IoT applications and that also serves as a means to explore IoT kit design through in-home workshops. Un-Kit represents a seemingly uncompleted set of sensors, actuators and media elements that have a decontextualized appearance - unfinished state, undefined purpose and unboxed form. The approach emphasises users contemplating and experiencing the IoT elements in their familiar space through detailed and layered conversation with researchers; rather than focusing on connecting up the kit itself, thus their ideas are not constrained by the kit or their competence with it. We illustrate the approach through in-home workshops with older adults, envisioned users of IoT who have had limited voice in its conception. The Un-kit approach supported participants to lead the process and to imagine new artfully integrated designs, with personally legible interactions and aesthetic qualities that fit their desire. We offer insights for a more situated and responsive approach to design of the IoT and its constituent kits.",
  "authors": [
    {
      "name": "Aloha Hufana Ambe",
      "institution": "Queensland University of Technology, Brisbane, Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658949906",
      "orcid": "missing"
    },
    {
      "name": "Margot Brereton",
      "institution": "Queensland University of Technology, Brisbane, Brisbane, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017862",
      "orcid": "0000-0002-0982-3404"
    },
    {
      "name": "Alessandro Soro",
      "institution": "Queensland University of Technology, Brisbane, Australia",
      "img": "/do/10.1145/contrib-81100420083/rel-imgonly/alessandro.soro.jpg",
      "acmid": "81100420083",
      "orcid": "missing"
    },
    {
      "name": "Min Zhen Chai",
      "institution": "Queensland University of Technology, Brisbane, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163110",
      "orcid": "missing"
    },
    {
      "name": "Laurie Buys",
      "institution": "Queensland University of Technology, Brisbane, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331489885",
      "orcid": "missing"
    },
    {
      "name": "Paul Roe",
      "institution": "Queensland University of Technology, Brisbane, Queensland, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100338049",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Juan C. Aceros, Jeannette Pols, and Miquel Domènech. 2015. Where is grandma? Home telecare, good aging and the domestication of later life. Technol. Forecast. Soc. Change 93, (2015), 102--111.",
      "doi": ""
    },
    {
      "text": "Aloha Hufana Ambe, Margot Brereton, Alessandro Soro, and Paul Roe. 2017. Technology Individuation: The Foibles of Augmented Everyday Objects. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems (CHI 2017), 6632--6644.  ",
      "doi": "10.1145/3025453.3025770"
    },
    {
      "text": "Luigi Atzori, Antonio Iera, and Giacomo Morabito. 2011. SIoT: Giving a Social Structure to the Internet of Things. Communications Letters, IEEE 15, 1193--1195.",
      "doi": ""
    },
    {
      "text": "Barbara Rita Barricelli and Stefano Valtolina. 2015. Designing for enduser development in the internet of things. In International Symposium on End User Development, 9--24.",
      "doi": ""
    },
    {
      "text": "E Brandt, T Binder, and L Malmborg. 2010. Communities of Everyday Practice and Situated Elderliness As an Approach to Co-design for Senior Interaction. In Proceedings of the 22Nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction, 400--403.  ",
      "doi": "10.1145/1952222.1952314"
    },
    {
      "text": "Margot Brereton. 2009. Designing from Somewhere: A located, relational and transformative view of design. T. Bind. J. Löwgren L. Malmborg (2009), 100--119.",
      "doi": ""
    },
    {
      "text": "Margot Brereton. 2013. Habituated Objects: Everyday Tangibles That Foster the Independent Living of an Elderly Woman. Interactions 20, 4 (2013), 20--24.  ",
      "doi": "10.1145/2486227.2486233"
    },
    {
      "text": "Margot Brereton, Paul Roe, Ronald Schroeter, and Anita Lee Hong. 2014. Beyond Ethnography: Engagement and Reciprocity As Foundations for Design Research Out Here. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1183--1186.  ",
      "doi": "10.1145/2556288.2557374"
    },
    {
      "text": "Margot Brereton, Alessandro Soro, Kate Vaisutis, and Paul Roe. 2015. The Messaging Kettle: Prototyping Connection over a Distance Between Adult Children and Older Parents. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15, 713-- 716.  ",
      "doi": "10.1145/2702123.2702462"
    },
    {
      "text": "Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08, 423.",
      "doi": ""
    },
    {
      "text": "Toni Calasanti. 2016. Combating Ageism: How Successful Is Successful Aging? Gerontologist 56, 6 (2016), 1093--1101.",
      "doi": ""
    },
    {
      "text": "Jennie Carroll. 2004. Completing Design in Use?: Closing the Appropriation Cycle. In European Conference of Information Systems, January 2004, 11.",
      "doi": ""
    },
    {
      "text": "Min Zhen Chai, Alessandro Soro, Paul Roe, and Margot Brereton. 2017. Cooking Together at a Distance: Sustain Connectedness for Long Distance Families. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 2437-- 2444.  ",
      "doi": "10.1145/3027063.3053183"
    },
    {
      "text": "Minjoo Cho and Daniel Saakes. 2017. Calm Automaton: A DIY Toolkit for Ambient Displays. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17), 393-- 396.  ",
      "doi": "10.1145/3027063.3052968"
    },
    {
      "text": "Joshua Chuang, Lubaina Maimoon, Shuo Yu, Hongyi Zhu, Casper Nybroe, Owen Hsiao, Shu-hsing Li, Hsinmin Lu, and Hsinchun Chen. 2016. SilverLink: Smart Home Health Monitoring for Senior Care. In International Conference on Smart Health '15, 3--14.  ",
      "doi": "10.1007/978-3-319-29175-8_1"
    },
    {
      "text": "Giuseppe Desolda, Carmelo Ardito, and Maristella Matera. 2017. Empowering end users to customize their smart environments: model, composition paradigms, and domain-specific tools. ACM Trans. Comput. Interact. 24, 2 (2017), 12.  ",
      "doi": "10.1145/3057859"
    },
    {
      "text": "Alan Dix. 2007. Designing for Appropriation. In Proceedings of the 21st BCS HCI Group Conference, 2--5. ",
      "doi": "10.5555/1531407.1531415"
    },
    {
      "text": "Angelika Dohr, Robert Modre-Opsrian, Mario Drobics, Dieter Hayn, and Günter Schreier. 2010. The internet of things for ambient assisted living. In Information technology: new generations (ITNG), 2010 seventh international conference on, 804--809.  ",
      "doi": "10.1109/ITNG.2010.104"
    },
    {
      "text": "Nicola Dragoni, Alberto Giaretta, and Manuel Mazzara. 2016. The internet of hackable things. In International Conference in Software Engineering for Defence Applications, 129--140.",
      "doi": ""
    },
    {
      "text": "Jeannette Durick, Toni Robertson, Margot Brereton, Frank Vetere, and Bjorn Nansen. 2013. Dispelling ageing myths in technology design. Proc. 25th Aust. Comput. Interact. Conf. Augment. Appl. Innov. Collab. - OzCHI '13 (2013), 467--476.  ",
      "doi": "10.1145/2541016.2541040"
    },
    {
      "text": "Michel Ehrenhard, Bjorn Kijl, and Lambert Nieuwenhuis. 2014. Market adoption barriers of multi-stakeholder technology: Smart homes for the aging population. Technol. Forecast. Soc. Change 89, (2014), 306--315.",
      "doi": ""
    },
    {
      "text": "Rocio Fernandez-Ballesteros. 2011. Positive ageing: Objective, subjective, and combined outcomes. E-Journal Appl. Psychol. 7, 1 (2011), 22--30.",
      "doi": ""
    },
    {
      "text": "Gerhard Fischer and Andreas C. Lemke. 1988. Construction Kits and Design Environments. ACM SIGCHI Bull. 20, 1 (July 1988), 81.  ",
      "doi": "10.1145/49103.1046496"
    },
    {
      "text": "Joel E. Fischer, Andy Crabtree, Tom Rodden, James A. Colley, Enrico Costanza, Michael O. Jewell, and Sarvapali D. Ramchurn. 2016. \"Just whack it on until it gets hot\" In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 5933-- 5944.  ",
      "doi": "10.1145/2858036.2858518"
    },
    {
      "text": "Joep Frens, Mathias Funk, Bastiaan van Hout, and Joep Le Blanc. 2018. Designing the IoT Sandbox. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18), 341--354.  ",
      "doi": "10.1145/3196709.3196815"
    },
    {
      "text": "William Gaver, Andy Boucher, Sarah Pennington, and Brendan Walker. 2004. Cultural probes and the value of uncertainty. Interact. - Funology 11(5), September to October (2004), 53--56.  ",
      "doi": "10.1145/1015530.1015555"
    },
    {
      "text": "Daniel López Gómez. 2015. Little arrangements that matter. Rethinking autonomy-enabling innovations for later life. Technol. Forecast. Soc. Chang. 93, (2015), 91--101.",
      "doi": ""
    },
    {
      "text": "Florian Güldenpfennig. 2018. Tailor-made Accessible Computers: An Interactive Toolkit for Iterative Co-Design. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '18), 231--236.  ",
      "doi": "10.1145/3173225.3173237"
    },
    {
      "text": "Michael Heidt, Arne Berger, Kevin Lefeuvre, and Maximilian Eibl. 2015. Miteinander: Engaging Intergenerational Participation With Playful Methods & Intelligent Things.",
      "doi": ""
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data Engagement Through Physical Ambient Visualizations in the Home. Proc. 2016 CHI Conf. Hum. Factors Comput. Syst. (CHI '16) (2016), 1608--1619.  ",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bosse Westerlund, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, Björn Eiderbäck, Sinna Lindquist, and Yngve Sundblad. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03), 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Rikke Hagensby Jensen, Yolande Strengers, Dimitrios Raptis, Larissa Nicholls, Jesper Kjeldskov, and Mikael B Skov. 2018. Exploring Hygge As a Desirable Design Vision for the Sustainable Smart Home. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18), 355--360.  ",
      "doi": "10.1145/3196709.3196804"
    },
    {
      "text": "Marije Kanis, Saskia Robben, Judith Hagen, Anne Bimmerman, Natasja Wagelaar, and Ben Krose. 2013. Sensor Monitoring in the Home: Giving Voice to Elderly People. In Proceedings of the ICTs for improving Patients Rehabilitation Research Techniques, 97--100.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252060"
    },
    {
      "text": "Kevin Lefeuvre, Soeren Totzauer, Michael Storz, Albrecht Kurze, Andreas Bischof, and Arne Berger. 2018. Bricks, Blocks, Boxes, Cubes, and Dice: On the Role of Cubic Shapes for the Design of Tangible Interactive Devices. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18), 485--496.  ",
      "doi": "10.1145/3196709.3196768"
    },
    {
      "text": "Kevin Lefeuvre, Sören Totzauer, Andreas Bischof, Albrecht Kurze, Michael Storz, Lisa Ullmann, and Arne Berger. 2016. Loaded Dice: Exploring the Design Space of Connected Devices with Blind and Visually Impaired People. Proc. 9th Nord. Conf. Human-Computer Interact. - Nord. '16 (2016), 1--10.  ",
      "doi": "10.1145/2971485.2971524"
    },
    {
      "text": "Tuck Wah Leong and Toni Robertson. 2016. Voicing Values: Laying Foundations for Ageing People to Participate in Design. In Proceedings of the 14th Participatory Design Conference: Full Papers - Volume 1 (PDC '16), 31--40.  ",
      "doi": "10.1145/2940299.2940301"
    },
    {
      "text": "Ann Light and Yoko Akama. 2012. The Human Touch: Participatory Practice and the Role of Facilitation in Designing with Communities. In Proceedings of the 12th Participatory Design Conference: Research Papers Volume 1 (PDC '12), 61--70.  ",
      "doi": "10.1145/2347635.2347645"
    },
    {
      "text": "Ann Light, Tuck W Leong, and Toni Robertson. 2015. Ageing well with CSCW. In ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work, 19--23 September 2015, Oslo, Norway, 295--304.",
      "doi": ""
    },
    {
      "text": "Ann Light, Sonja Pedell, Toni Robertson, Jenny Waycott, Jeanette Bell, Jeannette Durick, and Tuck Wah Leong. 2016. What's special about aging. Interactions 23, 2 (2016), 66--69.  ",
      "doi": "10.1145/2886011"
    },
    {
      "text": "Y Lim, D Kim, J Jo, and J Woo. 2013. Discovery-Driven Prototyping for User-Driven Creativity. IEEE Pervasive Comput. 12, 3 (July 2013), 74--80.  ",
      "doi": "10.1109/MPRV.2012.57"
    },
    {
      "text": "Sian Lindley and Jayne Wallace. 2015. Placing in Age?: Transitioning to a New Home in Later Life. ACM Trans. Comput. Interact. 22, 4 (2015), 1-- 39.  ",
      "doi": "10.1145/2755562"
    },
    {
      "text": "Janis Lena Meissner, Angelika Strohmayer, Peter Wright, and Geraldine Fitzpatrick. 2018. A Schnittmuster for Crafting Context-Sensitive Toolkits. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 151:1--151:13.  ",
      "doi": "10.1145/3173574.3173725"
    },
    {
      "text": "David A Mellis, Sam Jacoby, Leah Buechley, Hannah Perner-Wilson, and Jie Qi. 2013. Microcontrollers As Material: Crafting Circuits with Paper, Conductive Ink, Electronic Components, and an \"Untoolkit.\" In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13), 83--90.  ",
      "doi": "10.1145/2460625.2460638"
    },
    {
      "text": "Gratiane de Moustier. 2008. The Story of Odile. Gratiane de Moustier. Retrieved June 26, 2016 from http://gratianedemoustier.com/stories/thestory-of-odile/",
      "doi": ""
    },
    {
      "text": "MJ Michael J. Muller and Sarah Kuhn. 1993. Participatory design. Commun. ACM 36, 6 (1993), 24--28.  ",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Elizabeth D. Mynatt, Jim Rowan, Annie Jacobs, and Sarah Craighill. 2001. Digital Family Portraits: Supporting Peace of Mind for Extended Family Members. Proc. SIGCHI Conf. Hum. factors Comput. Syst. (2001), 333--340.  ",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "Soud Nassir, Tuck Wah Leong, and Toni Robertson. 2015. Positive Ageing?: Elements and factors for design. In OzCHI '2015, 265--268.  ",
      "doi": "10.1145/2838739.2838796"
    },
    {
      "text": "Todd D. Nelson. 2005. Ageism: Prejudice against our feared future self. J. Soc. Issues 61, 2 (2005), 207--221.",
      "doi": ""
    },
    {
      "text": "Louis Neven. 2010. \"But obviously not for me\": robots, laboratories and the defiant identity of elder test users. Sociol. Health Illn. 32, 2 (2010), 335--347.",
      "doi": ""
    },
    {
      "text": "Aisling Ann O'Kane, Yvonne Rogers, and Ann Blandford. 2014. Gaining empathy for non-routine mobile device use hrough autoethnography. Conf. Hum. Factors Comput. Syst. - Proc. (2014).  ",
      "doi": "10.1145/2556288.2557179"
    },
    {
      "text": "Fabio Paternò and Carmen Santoro. 2017. A design space for end user development in the time of the internet of things. In New perspectives in end-user development. Springer, 43--59.",
      "doi": ""
    },
    {
      "text": "Hannah Perner-Wilson, Leah Buechley, and Mika Satomi. 2011. Handcrafting textile interfaces from a kit-of-no-parts. In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction - TEI '11, 61.  ",
      "doi": "10.1145/1935701.1935715"
    },
    {
      "text": "M W Raad and L T Yang. 2009. A ubiquitous smart home for elderly. July 2008 (2009), 529--536.  ",
      "doi": "10.1007/s10796-008-9119-y"
    },
    {
      "text": "Kai Riemer and Robert Bruce Johnstone. 2012. Place-making: A Phenomenological Theory of Technology Appropriation. In Proc. of 33rd International Conference on Information Systems.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers. 2006. Moving on from Weiser's Vision of Calm Computing: Engaging UbiComp Experiences. In UbiComp 2006: Ubiquitous Computing (Lecture Notes in Computer Science), 404--421.  ",
      "doi": "10.1007/11853565_24"
    },
    {
      "text": "Yvonne Rogers, Jeni Paay, and Margot Brereton. 2014. Never Too Old: Engaging Retired People Inventing the Future with MaKey MaKey. Chi (2014), 3913--3922.  ",
      "doi": "10.1145/2556288.2557184"
    },
    {
      "text": "Jim Rowan and Elizabeth D. Mynatt. 2005. Digital Family Portrait Field Trial: Support for Aging in Place. In Proceedings of the SIGCHI conference on Human factors in computing systems, 521--530.  ",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. CoDesign 4, 1 (March 2008), 5--18.",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2014. Probes, toolkits and prototypes: three approaches to making in codesigning. CoDesign 10, 1 (2014), 5--14.",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Aloha Hufana Ambe, and Margot Brereton. 2017. Minding the gap: Reconciling human and technical perspectives on the IoT for healthy ageing. Wirel. Commun. Mob. Comput. 2017, (2017).",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Margot Brereton, Tshering Dema, Jessica L Oliver, Min Zhen Chai, and Aloha May Hufana Ambe. 2018. The Ambient Birdhouse: An IoT Device to Discover Birds and Engage with Nature. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 397:1--397:13.  ",
      "doi": "10.1145/3173574.3173971"
    },
    {
      "text": "Alessandro Soro, Margot Brereton, and Paul Roe. 2015. The Messaging Kettle: It's IoTea Time. In Proceedings of the 5th Decennial Aarhus Conference, 57--59.",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Margot Brereton, and Paul Roe. 2016. Towards an Analysis Framework of Technology Habituation by Older Users. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS '16), 1021--1033.  ",
      "doi": "10.1145/2901790.2901806"
    },
    {
      "text": "Alessandro Soro, Margot Brereton, and Paul Roe. 2018. Social Internet of Things (1st ed.). Springer International Publishing. ",
      "doi": "10.5555/3281328"
    },
    {
      "text": "Alessandro Soro, Margot Brereton, Jennyfer Lawrence Taylor, Anita Lee Hong, and Paul Roe. 2016. Cross-cultural dialogical probes. In Proceedings of the First African Conference on Human Computer Interaction, 114--125.  ",
      "doi": "10.1145/2998581.2998591"
    },
    {
      "text": "Linda Tonolli, Maurizio Teli, and Vincenzo D'Andrea. 2015. A Design Anthropology Critique of Active Aging as Ageism. IxD&A 26, (2015), 95--113.",
      "doi": ""
    },
    {
      "text": "Kate Vaisutis, Margot Brereton, Toni Robertson, Frank Vetere, Jeannette Durick, Bjorn Nansen, and Laurie Buys. 2014. Invisible Connections: Investigating Older People's Emotions and Social Relations Around Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1937--1940.  ",
      "doi": "10.1145/2556288.2557314"
    },
    {
      "text": "John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An age-old problem: Examining the discourses of ageing in HCI and strategies for future research. ACM Trans. Comput. Interact. 22, 1 (2015), 2.  ",
      "doi": "10.1145/2696867"
    },
    {
      "text": "David Wainwright. 1997. Can sociological research be qualitative, critical and valid? Qual. Rep. 3, 2 (1997), 1--17.",
      "doi": ""
    },
    {
      "text": "Jenny Waycott, Sonja Pedell, Frank Vetere, Elizabeth Ozanne, Lars Kulik, Alan Gruner, and John Downs. 2012. Actively engaging older adults in the development and evaluation of tablet technology. OzCHI '12 Proc. 24th Aust. Comput. Interact. Conf. (2012), 643--652.  ",
      "doi": "10.1145/2414536.2414633"
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Amee Morgans, Elizabeth Ozanne, and Lars Kulik. 2016. Not For Me: Older Adults Choosing Not to Participate in a Social Isolation Intervention. In CHI '16, 745--757.  ",
      "doi": "10.1145/2858036.2858458"
    },
    {
      "text": "Susan Wyche, Phoebe Sengers, and Rebecca E Grinter. 2006. Historical analysis: Using the past to design the future. Ubicomp (2006), 35--51.  ",
      "doi": "10.1007/11853565_3"
    },
    {
      "text": "Junnan Yu and Ricarose Roque. 2018. A Survey of Computational Kits for Young Children. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18), 289--299.  ",
      "doi": "10.1145/3202185.3202738"
    },
    {
      "text": "Zhi-Kai Zhang, Michael Cheng Yi Cho, Chia-Wei Wang, Chia-Wei Hsu, Chong-Kuan Chen, and Shiuhpyng Shieh. 2014. IoT security: ongoing challenges and research opportunities. In Service-Oriented Computing and Applications (SOCA), 2014 IEEE 7th International Conference on, 230-- 234.  ",
      "doi": "10.1109/SOCA.2014.58"
    }
  ]
}