{
  "doi": "10.1145/3290605.3300807",
  "title": "TalkTraces: Real-Time Capture and Visualization of Verbal Content in Meetings",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Group Support Systems provide ways to review and edit shared content during meetings, but typically require participants to explicitly generate the content. Recent advances in speech-to-text conversion and language processing now make it possible to automatically record and review spoken information. We present the iterative design and evaluation of TalkTraces, a real-time visualization that helps teams identify themes in their discussions and obtain a sense of agenda items covered. We use topic modeling to identify themes within the discussions and word embeddings to compute the discussion \"relatedness\" to items in the meeting agenda. We evaluate TalkTraces iteratively: we first conduct a comparative between-groups study between two teams using TalkTraces and two teams using traditional notes, over four sessions. We translate the findings into changes in the interface, further evaluated by one team over four sessions. Based on our findings, we discuss design implications for real-time displays of discussion content.",
  "authors": [
    {
      "name": "Senthil Chandrasegaran",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549216656",
      "orcid": "0000-0003-0561-2148"
    },
    {
      "name": "Chris Bryan",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86159014757",
      "orcid": "missing"
    },
    {
      "name": "Hidekazu Shidara",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366145",
      "orcid": "missing"
    },
    {
      "name": "Tung-Yen Chuang",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367162",
      "orcid": "missing"
    },
    {
      "name": "Kwan-Liu Ma",
      "institution": "University of California, Davis, Davis, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452595774",
      "orcid": "0000-0001-8086-0366"
    }
  ],
  "references": [
    {
      "text": "Daniel Angus, Andrew Smith, and Janet Wiles. 2012. Conceptual recurrence plots: Revealing patterns in human discourse. IEEE Transactions on Visualization and Computer Graphics 18, 6 (2012), 988--997.  ",
      "doi": "10.1109/TVCG.2011.100"
    },
    {
      "text": "Tony Bergstrom and Karrie Karahalios. 2009. Conversation clusters: grouping conversation topics through human-computer dialog. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. 2349--2352.  ",
      "doi": "10.1145/1518701.1519060"
    },
    {
      "text": "David M. Blei. 2012. Probabilistic Topic Models. Commun. ACM 55, 4 (2012), 77--84.  ",
      "doi": "10.1145/2133806.2133826"
    },
    {
      "text": "David M Blei and John D Lafferty. 2006. Dynamic topic models. In Proceedings of the International Conference on Machine Learning. 113-- 120.  ",
      "doi": "10.1145/1143844.1143859"
    },
    {
      "text": "David M Blei, Andrew Y Ng, and Michael I Jordan. 2003. Latent dirichlet allocation. Journal of machine Learning research 3, 4/5 (2003), 993--1022. ",
      "doi": "10.5555/944919.944937"
    },
    {
      "text": "Sara A Bly, Steve R Harrison, and Susan Irwin. 1993. Media spaces: bringing people together in a video, audio, and computing environment. Commun. ACM 36, 1 (1993), 28--46.  ",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: DataDriven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2301--2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Nadieh Bremer. 2015. Create a \"gooey effect\" during transitions in d3.js. https://www.visualcinnamon.com/2015/05/gooey-effect.",
      "doi": ""
    },
    {
      "text": "Vannevar Bush. 1945. As we may think. The atlantic monthly 176, 1 (1945), 101--108.",
      "doi": ""
    },
    {
      "text": "Nan Cao, Jimeng Sun, Yu-Ru Lin, David Gotz, Shixia Liu, and Huamin Qu. 2010. Facetatlas: Multifaceted visualization for rich text corpora. IEEE Transactions on Visualization and Computer Graphics 16, 6 (2010), 1172--1181.  ",
      "doi": "10.1109/TVCG.2010.154"
    },
    {
      "text": "Sandro Castronovo, Jochen Frey, and Peter Poller. 2008. A generic layout-tool for summaries of meetings in a constraint-based approach. In International Workshop on Machine Learning for Multimodal Interaction. 248--259.  ",
      "doi": "10.1007/978-3-540-85853-9_23"
    },
    {
      "text": "Patrick Chiu, Ashutosh Kapuskar, Sarah Reitmeier, and Lynn Wilcox. 2000. Room with a rear view. Meeting capture in a multimedia conference room. IEEE MultiMedia 7, 4 (2000), 48--54.  ",
      "doi": "10.1109/93.895154"
    },
    {
      "text": "Cisco Systems Inc. 2018. Cisco Collaboration Meeting Rooms. https://www.cisco.com/c/en/us/solutions/collaboration/ pervasive-conferencing/index.html. {Online; accessed 03-April-2018}.",
      "doi": ""
    },
    {
      "text": "Stephen Clark. 2015. Vector space models of lexical meaning. The Handbook of Contemporary semantic theory (2015), 493--522.",
      "doi": ""
    },
    {
      "text": "Weiwei Cui, Shixia Liu, Li Tan, Conglei Shi, Yangqiu Song, Zekai Gao, Huamin Qu, and Xin Tong. 2011. Textflow: Towards better understanding of evolving topics in text. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2412--2421.  ",
      "doi": "10.1109/TVCG.2011.239"
    },
    {
      "text": "Wenwen Dou, Xiaoyu Wang, Drew Skau, William Ribarsky, and Michelle X Zhou. 2012. Leadline: Interactive visual analysis of text data through event identification and exploration. In IEEE Conference on Visual Analytics Science and Technology. 93--102.  ",
      "doi": "10.1109/VAST.2012.6400485"
    },
    {
      "text": "Patrick Ehlen, Matthew Purver, John Niekrasz, Kari Lee, and Stanley Peters. 2008. Meeting adjourned: off-line learning interfaces for automatic meeting understanding. In Proceedings of the ACM international conference on Intelligent user interfaces. 276--284.  ",
      "doi": "10.1145/1378773.1378810"
    },
    {
      "text": "Mennatallah El-Assady, Rita Sevastjanova, Bela Gipp, Daniel Keim, and Christopher Collins. 2017. NEREx: Named-Entity Relationship Exploration in Multi-Party Conversations. In Computer Graphics Forum, Vol. 36. 213--225.  ",
      "doi": "10.1111/cgf.13181"
    },
    {
      "text": "Sayed M Elsayed-Elkhouly, Harold Lazarus, and Volville Forsythe. 1997. Why is a third of your time wasted in meetings? Journal of Management Development 16, 9 (1997), 672--676.",
      "doi": ""
    },
    {
      "text": "Carlos Filipe Freitas, Joao Barroso, and Carlos Ramos. 2015. A Survey on Smart Meeting Rooms and Open Issues. International Journal of Smart Home 9, 9 (2015), 13--20.",
      "doi": ""
    },
    {
      "text": "Brynjar Gretarsson, John O'donovan, Svetlin Bostandjiev, Tobias Höllerer, Arthur Asuncion, David Newman, and Padhraic Smyth. 2012. Topicnets: Visual analysis of large text corpora with topic modeling. ACM Transactions on Intelligent Systems and Technology 3, 2 (2012), 23. TalkTraces CHI 2019, May 4--9, 2019, Glasgow, Scotland UK  ",
      "doi": "10.1145/2089094.2089099"
    },
    {
      "text": "Amit Gruber, Yair Weiss, and Michal Rosen-Zvi. 2007. Hidden topic markov models. In Proceedings of the International Conference on Artificial intelligence and statistics. 163--170.",
      "doi": ""
    },
    {
      "text": "Richard M Heiberger, Naomi B Robbins, et al. 2014. Design of diverging stacked bar charts for Likert scales and other applications. Journal of Statistical Software 57, 5 (2014), 1--32.",
      "doi": ""
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data engagement through physical ambient visualizations in the home. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. 1608--1619.  ",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Seth Hunter, Pattie Maes, Stacey Scott, and Henry Kaufman. 2011. MemTable: an integrated system for capture and recall of shared histories in group workspaces. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. 3305--3314.  ",
      "doi": "10.1145/1978942.1979432"
    },
    {
      "text": "Seth Hunter, Pattie Maes, Stacey Scott, and Henry Kaufman. 2011. MemTable: an integrated system for capture and recall of shared histories in group workspaces. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. 3305--3314.  ",
      "doi": "10.1145/1978942.1979432"
    },
    {
      "text": "Intel Inc. 2018. Intel Unite Solution. https://www.intel. com/content/www/us/en/architecture-and-technology/unite/ intel-unite-overview.html. {Online; accessed 03-April-2018}.",
      "doi": ""
    },
    {
      "text": "Petra Isenberg, Niklas Elmqvist, Jean Scholtz, Daniel Cernea, Kwan-Liu Ma, and Hans Hagen. 2011. Collaborative visualization: Definition, challenges, and research agenda. Information Visualization 10, 4 (2011), 310--326.  ",
      "doi": "10.1177/1473871611412817"
    },
    {
      "text": "Nassim Jafarinaimi, Jodi Forlizzi, Amy Hurst, and John Zimmerman. 2005. Breakaway: an ambient display designed to change human behavior. In ACM CHI extended abstracts on Human factors in computing systems. 1945--1948.  ",
      "doi": "10.1145/1056808.1057063"
    },
    {
      "text": "Armand Joulin, Edouard Grave, Piotr Bojanowski, and Tomas Mikolov. 2017. Bag of Tricks for Efficient Text Classification. In Proceedings of the 15th Conference of the European Chapter of the Association for Computational Linguistics: Volume 2, Short Papers. Association for Computational Linguistics, 427--431.",
      "doi": ""
    },
    {
      "text": "KyungTae Kim, Sungahn Ko, Niklas Elmqvist, and David S Ebert. 2011. WordBridge: Using composite tag clouds in node-link diagrams for visualizing content and relations in text corpora. In IEEE Hawaii International Conference on System Sciences. 1--8.  ",
      "doi": "10.1109/HICSS.2011.499"
    },
    {
      "text": "Taemie Kim, Agnes Chang, Lindsey Holland, and Alex Sandy Pentland. 2008. Meeting mediator: enhancing group collaborationusing sociometric feedback. In Proceedings of the ACM conference on Computer supported cooperative work. 457--466.  ",
      "doi": "10.1145/1460563.1460636"
    },
    {
      "text": "Kostiantyn Kucher and Andreas Kerren. 2015. Text visualization techniques: Taxonomy, visual survey, and community insights. In IEEE Pacific Visualization Symposium. 117--121.",
      "doi": ""
    },
    {
      "text": "Wei Li and Andrew McCallum. 2006. Pachinko allocation: DAGstructured mixture models of topic correlations. In Proceedings of the ACM international conference on Machine learning. 577--584.  ",
      "doi": "10.1145/1143844.1143917"
    },
    {
      "text": "Shixia Liu, Jialun Yin, Xiting Wang, Weiwei Cui, Kelei Cao, and Jian Pei. 2016. Online visual analytics of text streams. IEEE Transactions on Visualization and Computer Graphics 22, 11 (2016), 2451--2466.",
      "doi": "10.1109/TVCG.2015.2509990"
    },
    {
      "text": "Edward Loper and Steven Bird. 2002. NLTK: the natural language toolkit. In Proceedings of the ACL Workshop on Effective tools and methodologies for teaching natural language processing and computational linguistics - Volume 1. 63--70.  ",
      "doi": "10.3115/1118108.1118117"
    },
    {
      "text": "Jennifer Mankoff, Anind K Dey, Gary Hsieh, Julie Kientz, Scott Lederer, and Morgan Ames. 2003. Heuristic evaluation of ambient displays. In Proceedings of the ACM CHI conference on Human factors in computing systems. 169--176.  ",
      "doi": "10.1145/642611.642642"
    },
    {
      "text": "Microsoft Inc. 2018. IoT Smart Buldings | Microsoft. https://www. microsoft.com/en-us/internet-of-things/smart-building. {Online; accessed 03-April-2018}.",
      "doi": ""
    },
    {
      "text": "Jay F. Nunamaker, Robert O. Briggs, and Daniel D. Mittleman. 1996. Lessons from a decade of group support systems research. In Proceedings of the Hawaii International Conference on System Sciences Volume 3: Collaboration Systems and Technology. 418--427. ",
      "doi": "10.5555/795700.798564"
    },
    {
      "text": "Jay F. Nunamaker, Alan R Dennis, Joseph S Valacich, Douglas Vogel, and Joey F George. 1991. Electronic meeting systems. Commun. ACM 34, 7 (1991), 40--61.  ",
      "doi": "10.1145/105783.105793"
    },
    {
      "text": "Chris Parnin and Carsten Gorg. 2007. Design guidelines for ambient software visualization in the workplace. In IEEE International Workshop on Visualizing Software for Understanding and Analysis. 18--25.",
      "doi": ""
    },
    {
      "text": "Jeffrey Pennington, Richard Socher, and Christopher Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the conference on empirical methods in natural language processing. 1532-- 1543.",
      "doi": ""
    },
    {
      "text": "Zachary Pousman and John Stasko. 2006. A taxonomy of ambient information systems: four patterns of design. In Proceedings of the ACM conference on Advanced visual interfaces. 67--74.  ",
      "doi": "10.1145/1133265.1133277"
    },
    {
      "text": "Carlos Ramos, Juan Carlos Augusto, and Daniel Shapiro. 2008. Ambient intelligence-the next step for artificial intelligence. IEEE Intelligent Systems 23, 2 (2008), 15--18.  ",
      "doi": "10.1109/MIS.2008.19"
    },
    {
      "text": "Radim Rehurek and Petr Sojka. 2010. Software Framework for Topic Modelling with Large Corpora. In Proceedings of the LREC Workshop on New Challenges for NLP Frameworks. 45--50.",
      "doi": ""
    },
    {
      "text": "Alan R Robertson. 1977. The CIE 1976 Color-Difference Formulae. Color Research & Application 2, 1 (1977), 7--11.",
      "doi": ""
    },
    {
      "text": "Yang Shi, Chris Bryan, Sridatt Bhamidipati, Ying Zhao, Yaoxue Zhang, and Kwan-Liu Ma. 2018. MeetingVis: Visual Narratives to Assist in Recalling Meeting Context and Content. IEEE Transactions on Visualization and Computer Graphics (2018).",
      "doi": ""
    },
    {
      "text": "Yang Shi, Yang Wang, Ye Qi, John Chen, Xiaoyao Xu, and Kwan-Liu Ma. 2017. IdeaWall: improving creative collaboration through combinatorial visual stimuli. In Proceedings of the ACM Conference on Computer Supported Cooperative Work and Social Computing. 594--603.  ",
      "doi": "10.1145/2998181.2998208"
    },
    {
      "text": "Carson Sievert and Kenneth Shirley. 2014. LDAvis: A method for visualizing and interpreting topics. In Proceedings of the workshop on interactive language learning, visualization, and interfaces. 63--70.",
      "doi": ""
    },
    {
      "text": "Tobias Skog. 2004. Activity wallpaper: ambient visualization of activity information. In Proceedings of the ACM Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques. 325--328.  ",
      "doi": "10.1145/1013115.1013171"
    },
    {
      "text": "Alison Smith, Varun Kumar, Jordan Boyd-Graber, Kevin Seppi, and Leah Findlater. 2018. Closing the Loop: User-Centered Design and Evaluation of a Human-in-the-Loop Topic Modeling System. In Proceedgs of the ACM Conference on Intelligent User Interfaces. 293--304.  ",
      "doi": "10.1145/3172944.3172965"
    },
    {
      "text": "Alison Smith, Tak Yeon Lee, Forough Poursabzi-Sangdeh, Jordan BoydGraber, Niklas Elmqvist, and Leah Findlater. 2017. Evaluating visual CHI 2019, May 4--9, 2019, Glasgow, Scotland UK S. Chandrasegaran et al. representations for topic understanding and their effects on manually generated labels. Transactions of the Association of Computational Linguistics 5, 1 (2017), 1--15.",
      "doi": ""
    },
    {
      "text": "Robert Speer, Joshua Chin, and Catherine Havasi. 2017. ConceptNet 5.5: An Open Multilingual Graph of General Knowledge. In AAAI Conference on Artificial Intelligence. 4444--4451. ",
      "doi": "10.5555/3298023.3298212"
    },
    {
      "text": "Yun Sun, Yubo Tao, Geng Yang, and Hai Lin. 2013. Visitpedia: Wiki article visit log visualization for event exploration. In International Conference on Computer-Aided Design and Computer Graphics. 282--289.  ",
      "doi": "10.1109/CADGraphics.2013.44"
    },
    {
      "text": "Yuzuru Tanahashi and Kwan-Liu Ma. 2015. Stock lamp: An engagement-versatile visualization design. In Proceedings of the ACM CHI Conference on Human Factors in Computing Systems. 595--604.  ",
      "doi": "10.1145/2702123.2702323"
    },
    {
      "text": "Gokhan Tur, Andreas Stolcke, Lynn Voss, Stanley Peters, Dilek Hakkani-Tur, John Dowding, Benoit Favre, Raquel Fernández, Matthew Frampton, Mike Frandsen, Clint Frederickson, Martin Graciarena, Donald Kintzing, Kyle Leveque, Shane Mason, John Niekrasz, Matthew Purver, Korbinian Riedhammer, Elizabeth Shriberg, Jing Tien, Dimitra Vergyri, and Fan Yang. 2010. The CALO meeting assistant system. IEEE Transactions on Audio, Speech, and Language Processing 18, 6 (2010), 1601--1611.",
      "doi": "10.5555/2209814.2210553"
    },
    {
      "text": "Joseph Turian, Lev Ratinov, and Yoshua Bengio. 2010. Word representations: a simple and general method for semi-supervised learning. In Proceedings of the 48th annual meeting of the association for computational linguistics. 384--394. ",
      "doi": "10.5555/1858681.1858721"
    },
    {
      "text": "Frank Van Ham, Martin Wattenberg, and Fernanda B Viégas. 2009. Mapping text with phrase nets. IEEE Transactions on Visualization and Computer Graphics 15, 6 (2009).  ",
      "doi": "10.1109/TVCG.2009.165"
    },
    {
      "text": "Sergio A Velastin, Boghos A Boghossian, Benny PL Lo, Jie Sun, and Maria Alicia Vicencio-Silva. 2005. PRISMATICA: toward ambient intelligence in public transport environments. IEEE Transactions on Systems, Man, and Cybernetics-Part A: Systems and Humans 35, 1 (2005), 164--182.  ",
      "doi": "10.1109/TSMCA.2004.838461"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2004. Interactive public ambient displays: transitioning from implicit to explicit, public to personal, interaction with multiple users. In Proceedings of the ACM symposium on User Interface Software and Technology. 137--146.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Xiting Wang, Shixia Liu, Yang Chen, Tai-Quan Peng, Jing Su, Jing Yang, and Baining Guo. 2016. How ideas flow across multiple social groups. IEEE Transactions on Visualization and Computer Graphics, 51--60.",
      "doi": ""
    },
    {
      "text": "Xiting Wang, Shixia Liu, Yangqiu Song, and Baining Guo. 2013. Mining evolutionary multi-branch trees from text streams. In Proceedings of the ACM SIGKDD international conference on Knowledge Discovery and Data mining. 722--730.  ",
      "doi": "10.1145/2487575.2487603"
    },
    {
      "text": "Xuerui Wang and Andrew McCallum. 2006. Topics over time: a nonMarkov continuous-time model of topical trends. In Proceedings of the ACM SIGKDD international conference on Knowledge Discovery and Data mining. 424--433.  ",
      "doi": "10.1145/1150402.1150450"
    },
    {
      "text": "Furu Wei, Shixia Liu, Yangqiu Song, Shimei Pan, Michelle X Zhou, Weihong Qian, Lei Shi, Li Tan, and Qiang Zhang. 2010. Tiara: a visual exploratory text analytic system. In Proceedings of the ACM SIGKDD international conference on Knowledge discovery and data mining. 153-- 162.  ",
      "doi": "10.1145/1835804.1835827"
    },
    {
      "text": "Steve Whittaker, Simon Tucker, and Denis Lalanne. 2012. Meeting browsers and meeting assistants. In Multimodal Signal Processing: Human Interactions in Meetings, Steve Renals, Hervé Bourlard, Jean Carletta, and Andrei Popescu-Belis (Eds.). Cambridge University Press, Chapter 12, 204--217.",
      "doi": ""
    },
    {
      "text": "Felix Wortmann and Kristina Flüchter. 2015. Internet of things. Business & Information Systems Engineering 57, 3 (2015), 221--224.",
      "doi": ""
    },
    {
      "text": "Zhiwen Yu and Yuichi Nakamura. 2010. Smart meeting systems: A survey of state-of-the-art and open issues. ACM Computing Surveys (CSUR) 42, 2 (2010), 8.  ",
      "doi": "10.1145/1667062.1667065"
    }
  ]
}