{
  "doi": "10.1145/3290605.3300239",
  "title": "To Asymmetry and Beyond!: Improving Social Connectedness by Increasing Designed Interdependence in Cooperative Play",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Social play can have numerous health benefits but research has shown that not all multiplayer games are effective at promoting social engagement. Asymmetric cooperative games have shown promise in this regard but the design and dynamics of this unique style of play is not yet well understood. To address this, we present the results of two player experience studies using our custom prototype game Beam Me 'Round, Scotty! 2: the first comparing symmetric cooperative play (e.g., where players have the same interface, goals, mechanics, etc.) to asymmetric cooperative play (e.g., where players have differing roles, abilities, interfaces, etc.) and the second comparing the effect of increasing degrees of interdependence between play partners. Our results not only indicate that asymmetric cooperative games may enhance players' perceptions of connectedness, social engagement, immersion, and comfort with a game's controls, but also demonstrate how to further improve these outcomes via deliberate mechanical design changes, such as changes in cooperative action timing and direction of dependence.",
  "tags": [
    "social presence",
    "game design",
    "games user research",
    "player experience",
    "asymmetric games",
    "symmetric vs asymmetric play"
  ],
  "authors": [
    {
      "name": "John Harris",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456623140",
      "orcid": "missing"
    },
    {
      "name": "Mark Hancock",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81100211996/rel-imgonly/acm.jpg",
      "acmid": "81100211996",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sultan A Alharthi, Ruth C Torres, Ahmed S Khalaf, Zachary O Toups, Igor Dolgov, and Lennart E Nacke. 2018. Investigating the Impact of Annotation Interfaces on Player Performance in Distributed Multiplayer Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal, Quebec, Canada, 314.  ",
      "doi": "10.1145/3173574.3173888"
    },
    {
      "text": "Logic Artists. 2015. Clandestine. Game {PC}.",
      "doi": ""
    },
    {
      "text": "Entertainment Software Association. 2017. Essential facts about the computer and video game industry. Retrieved August 10, 2018 from http://www.theesa.com/wp-content/uploads/2017/09/EF2017_ Design_FinalDigital.pdf",
      "doi": ""
    },
    {
      "text": "Anastasiia Beznosyk,Peter Quax,Wim Lamotte,and Karin Coninx. 2012. The effect of closely-coupled interaction on player experience in casual games. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 7522 LNCS (2012), 243--255.  ",
      "doi": "10.1007/978-3-642-33542-6_21"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 2014. Toward a psychology of optimal experience. In Flow and the foundations of positive psychology. Springer, Dordrecht, Netherlands, 209--226.",
      "doi": ""
    },
    {
      "text": "Alena Denisova, A. Imran Nordin, and Paul Cairns. 2016. The Convergence of Player Experience Questionnaires. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, New York, NY, USA, 33--37.  ",
      "doi": "10.1145/2967934.2968095"
    },
    {
      "text": "Ansgar E. Depping and Regan L. Mandryk. 2017. Cooperation and Interdependence: How Multiplayer Games Increase Social Closeness. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, New York, NY, USA, 449--461.  ",
      "doi": "10.1145/3116595.3116639"
    },
    {
      "text": "Ansgar E. Depping, Regan L. Mandryk, Colby Johanson, Jason T. Bowey, and Shelby C. Thomson. 2016. Trust Me: Social Games Are Better Than Social Icebreakers at Building Trust. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, New York, NY, USA, 116--129.  ",
      "doi": "10.1145/2967934.2968097"
    },
    {
      "text": "Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J. Moore. 2006. \"Alone Together?\": Exploring the Social Dynamics of Massively Multiplayer Online Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06). ACM, New York, NY, USA, 407--416.  ",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "Katharina Emmerich and Maic Masuch. 2017. The Impact of Game Patterns on Player Experience and Social Interaction in Co-Located Multiplayer Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '17). ACM, New York, NY, USA, 411--422.  ",
      "doi": "10.1145/3116595.3116606"
    },
    {
      "text": "Blizzard Entertainment. 2004. World of Warcraft. Game {PC}.",
      "doi": ""
    },
    {
      "text": "M. B. Evans and M. a. Eys. 2015. Collective goals and shared tasks: Interdependence structure and perceptions of individual sport team environments. Scandinavian Journal of Medicine and Science in Sports 25 (2015), e139--e148.",
      "doi": ""
    },
    {
      "text": "FromSoftware. 2011. Dark Souls. Game {PlayStation3}. Tokyo, Japan. Last played March 2018.",
      "doi": ""
    },
    {
      "text": "Simon Gachter, Chris Starmer, and Fabio Tufano. 2015. Measuring the closeness of relationships: A comprehensive evaluation of the 'inclusion of the other in the self' scale. PLoS ONE 10, 6 (2015), e0129478.",
      "doi": ""
    },
    {
      "text": "Nintendo EPD & Platinum Games. 2016. Star Fox Zero. Game {Nintendo Wii U}.",
      "doi": ""
    },
    {
      "text": "SteelCrateGames.2015. KeepTalkingandNobodyExplodes. Game{PC}.",
      "doi": ""
    },
    {
      "text": "Kathrin Gerling and Laura Buttrick. 2014. Last Tank Rolling: Exploring Shared Motion-based Play to Empower Persons Using Wheelchairs. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, New York, NY, USA, 415--416.  ",
      "doi": "10.1145/2658537.2661303"
    },
    {
      "text": "Kathrin Gerling and Regan Mandryk. 2014. Designing Video Games for Older Adults and Caregivers. In Meaningful Play 2014. SAGE, East Lansing, MI, USA, 24 pages.",
      "doi": ""
    },
    {
      "text": "John Harris, Mark Hancock, and Stacey D. Scott. 2016. Leveraging Asymmetries in Multiplayer Games: Investigating Design Elements of Interdependent Play. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY '16). ACM, New York, NY, USA, 350--361.  ",
      "doi": "10.1145/2967934.2968113"
    },
    {
      "text": "Robin Hunicke, Marc LeBlanc, and Robert Zubek. 2004. MDA: A Formal Approach to Game Design and Game Research. Workshop on Challenges in Game AI 1 (2004), 1--4.",
      "doi": ""
    },
    {
      "text": "Katherine Isbister. 2010. Enabling Social Play: A Framework for Design and Evaluation. Springer London, London, 11--22.",
      "doi": ""
    },
    {
      "text": "Yvonne a W De Kort, Karolien Poels, and Wijnand Ijsselsteijn. 2007. Digital Games as Social Presence Technology : Development of the Social Presence in Gaming Questionnaire ( SPGQ ). Digital Games as Social Presence Technology _ PRESENCE 2007 195203 (2007), 1--9.",
      "doi": ""
    },
    {
      "text": "Lennart E. Nacke, Chris Bateman, and Regan L. Mandryk. 2014. BrainHex: A neurobiological gamer typology survey. Entertainment Computing 5, 1 (2014), 55--62.",
      "doi": ""
    },
    {
      "text": "Alexey Pajitnov. 1984. Tetris. Game {PC}.",
      "doi": ""
    },
    {
      "text": "Gene Roddenberry. 1966. Star Trek. Television Series. Retrieved September 15, 2018 from http://www.startrek.com/database_article/ star-trek-the-original-series-synopsis",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, Valerie Mims, and Richard Koestner. 1983. Relation of reward contingency and interpersonal context to intrinsic motivation: A review and test using cognitive evaluation theory. Journal of personality and Social Psychology 45, 4 (1983), 736.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344--360.",
      "doi": ""
    },
    {
      "text": "Richard Saavedra, P Christopher Earley, and Linn Van Dyne. 1993. Complexinterdependenceintask-performinggroups. JournalofAppliedPsychology 78, 1 (1993), 61--72.",
      "doi": ""
    },
    {
      "text": "Pejman Sajjadi, Edgar Omar Cebolledo Gutierrez, Sandra Trullemans, and Olga De Troyer. 2014. Maze Commander: A Collaborative Asynchronous Game Using the Oculus Rift & the Sifteo Cubes. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, New York, NY, USA, 227--236.  ",
      "doi": "10.1145/2658537.2658690"
    },
    {
      "text": "Jesse Schell. 2014. The Art of Game Design: A book of lenses. AK Peters/CRC Press, Boca Raton, Florida, USA. ",
      "doi": "10.5555/3006351"
    },
    {
      "text": "Muzafer Sherif. 1961. The Robbers Cave experiment intergroup conflict and cooperation. Vol. 10. University Book Exchange Norman, OK, Norman, Oklahoma, USA. 229 pages.",
      "doi": ""
    },
    {
      "text": "Zachary O Toups, Jessica Hammer, William A Hamilton, Ahmad Jarrah, William Graves, and Oliver Garretson. 2014. A framework for cooperative communication game mechanics from grounded theory. In Proceedings of the first ACM SIGCHI annual symposium on Computerhuman interaction in play. ACM, Toronto, Ontario, Canada, 257--266.  ",
      "doi": "10.1145/2658537.2658681"
    },
    {
      "text": "G. S. van der Vegt, Ben J. M. Emans, and Evert van de Vliert. 2001. Patterns of interdependence in work teams: A two-level investigation of the relations with job and team satisfaction. Personnel Psychology 54 (2001), 51--69.",
      "doi": ""
    },
    {
      "text": "Amy Voida, Sheelagh Carpendale, and Saul Greenberg. 2010. The IndividualandtheGroupinConsoleGaming.InProceedingsofthe2010ACM Conference on Computer Supported Cooperative Work (CSCW '10). ACM, New York, NY, USA, 371--380.  ",
      "doi": "10.1145/1718918.1718983"
    },
    {
      "text": "Jason Wuertz, Sultan A Alharthi, William A Hamilton, Scott Bateman, Carl Gutwin, Anthony Tang, Zachary Toups, and Jessica Hammer. 2018. A Design Framework for Awareness Cues in Distributed Multiplayer Games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal, Quebec, Canada, 243.  ",
      "doi": "10.1145/3173574.3173817"
    },
    {
      "text": "Jason Wuertz, Scott Bateman, and Anthony Tang. 2017. Why Players Use Pings and Annotations in Dota 2. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver, Colorado, USA, 1978--2018.  ",
      "doi": "10.1145/3025453.3025967"
    },
    {
      "text": "Nick Yee. 2006. Motivations for play in online games. CyberPsychology & behavior 9, 6 (2006), 772--775.",
      "doi": ""
    },
    {
      "text": "José P Zagal, Jochen Rick, and Idris Hsi. 2006. Collaborative games: Lessons learned from board games. Simulation & Gaming 37, 1 (2006), 24--40.  ",
      "doi": "10.1177/1046878105282279"
    }
  ]
}