{
  "doi": "10.1145/3290605.3300473",
  "title": "Communication Breakdowns Between Families and Alexa",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "We investigate how families repair communication breakdowns with digital home assistants. We recruited 10 diverse families to use an Amazon Echo Dot in their homes for four weeks. All families had at least one child between four and 17 years old. Each family participated in pre- and post- deployment interviews. Their interactions with the Echo Dot (Alexa) were audio recorded throughout the study. We analyzed 59 communication breakdown interactions between family members and Alexa, framing our analysis with concepts from HCI and speech-language pathology. Our findings indicate that family members collaborate using discourse scaffolding (supportive communication guidance) and a variety of speech and language modifications in their attempts to repair communication breakdowns with Alexa. Alexa's responses also influence the repair strategies that families use. Designers can relieve the communication repair burden that primarily rests with families by increasing digital home assistants' abilities to collaborate together with users to repair communication breakdowns.",
  "authors": [
    {
      "name": "Erin Beneteau",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365459",
      "orcid": "missing"
    },
    {
      "name": "Olivia K. Richards",
      "institution": "Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-99659163162/rel-imgonly/dsc_0949.jpg",
      "acmid": "99659163162",
      "orcid": "missing"
    },
    {
      "name": "Mingrui Zhang",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659529048/rel-imgonly/f.png",
      "acmid": "99659529048",
      "orcid": "missing"
    },
    {
      "name": "Julie A. Kientz",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81548025762/rel-imgonly/kientz-headshot-small.png",
      "acmid": "81548025762",
      "orcid": "missing"
    },
    {
      "name": "Jason Yip",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502757149",
      "orcid": "0000-0001-9980-0670"
    },
    {
      "name": "Alexis Hiniker",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258949157",
      "orcid": "0000-0003-1607-0778"
    }
  ],
  "references": [
    {
      "text": "Linda Bell and Joakim Gustafson. Interaction with an Animated Agent in a Spoken Dialogue System. Retrieved September 13, 2018 from https://www.speech.kth.se/august/eur99_augdata.html",
      "doi": ""
    },
    {
      "text": "D. Bohus and A.I. Rudnicky. 2001. Modeling the cost of misunderstanding errors in the Carnegie Mellon University Communicator dialog system. In IEEE Workshop on Automatic Speech Recognition and Understanding, 2001. ASRU '01., 252-- 255.",
      "doi": ""
    },
    {
      "text": "Dan Bohus and Eric Horvitz. 2009. Open-world dialog: Challenges, directions, and prototype. In Proceedings of IJCAI'2009 Workshop on Knowledge and Reasoning in Practical Dialogue Systems.",
      "doi": ""
    },
    {
      "text": "Dan Bohus and Eric Horvitz. 2011. Multiparty Turn Taking in Situated Dialog: Study, Lessons, and Directions. In Proceedings of the SIGDIAL 2011 Conference (SIGDIAL '11), 98--109. Retrieved from http://dl.acm.org/citation.cfm?id=2132890.2132903 ",
      "doi": "10.5555/2132890.2132903"
    },
    {
      "text": "Holly P. Branigan, Martin J. Pickering, Jamie Pearson, and Janet F. McLean. 2010. Linguistic alignment between people and computers. J. Pragmat. 42, 9 (September 2010), 2355--2368.",
      "doi": ""
    },
    {
      "text": "Bonnie Brinton, Martin Fujiki, Diane Frome Loeb, and Erika Winkler. 1986. Development of conversational repair strategies in response to requests for clarification. J. Speech Hear. Res. 29, 1 (March 1986), 75--81.",
      "doi": ""
    },
    {
      "text": "Antony Bryant and Kathy Charmaz. 2007. The SAGE handbook of grounded theory. London?: SAGE Publications, London.",
      "doi": ""
    },
    {
      "text": "Li-Rong Lilly Cheng. 2007. Codes and Contexts: Exploring Linguistic, Cultural, and Social Intelligence. ASHA Lead. 12, 7 (May 2007), 8--33.",
      "doi": ""
    },
    {
      "text": "Yi Cheng, Kate Yen, Yeqi Chen, Sijin Chen, and Alexis Hiniker. 2018. Why Doesn'T It Work?: Voice-driven Interfaces and Young Children's Communication Repair Strategies. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18), 337--348.  ",
      "doi": "10.1145/3202185.3202749"
    },
    {
      "text": "Benjamin R. Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. \"What Can I Help You with?\": Infrequent Users' Experiences of Intelligent Personal Assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17), 43:1--43:12.  ",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "John W. Creswell. 2018. Qualitative inquiry & research design: choosing among five approaches (Fourth edi ed.). SAGE, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. \"Hey Google is It OK if I Eat You?\": Initial Explorations in Child-Agent Interaction. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17), 595--600.  ",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Paula B. García, Lori Leibold, Emily Buss, Lauren Calandruccio, and Barbara Rodriguez. 2018. Code-Switching in Highly Proficient Spanish/English Bilingual Adults: Impact on Masked Word Recognition. J. Speech Lang. Hear. Res. (August 2018), 1--11.",
      "doi": ""
    },
    {
      "text": "Catherine Garvey. 1975. Requests and responses in children's speech*. J. Child Lang. 2, 1 (April 1975), 41--63.",
      "doi": ""
    },
    {
      "text": "Christina E. Gildersleeve-Neumann, Ellen S. Kester, Barbara L. Davis, and Elizabeth D. Peña. 2008. English Speech Sound Development in PreschoolAged Children From Bilingual English--Spanish Environments. Lang. Speech Hear. Serv. Sch. 39, 3 (July 2008), 314--328.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Bongshin Lee, Kiley Sobel, and Eun Kyoung Choe. 2017. Plan & Play: Supporting Intentional Media Use in Early Childhood. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC '17), 85--95.  ",
      "doi": "10.1145/3078072.3079752"
    },
    {
      "text": "Yvette D. Hyter. 2007. Pragmatic Language Assessment: A Pragmatics-AsSocial Practice Model. Top. Lang. Disord. 27, 2 (April 2007), 128--145.",
      "doi": ""
    },
    {
      "text": "Sharon L. James. 1990. Normal Language Acquisition. Allyn & Bacon, Incorporated.",
      "doi": ""
    },
    {
      "text": "Jiepu Jiang, Wei Jeng, and Daqing He. 2013. How Do Users Respond to Voice Input Errors?: Lexical and Phonetic Query Reformulation in Voice Search. In Proceedings of the 36th International ACM SIGIR Conference on Research and Development in Information Retrieval (SIGIR '13), 143--152.  ",
      "doi": "10.1145/2484028.2484092"
    },
    {
      "text": "Alan Kennedy, Alan Wilkes, Leona Elder, and Wayne S. Murray. 1988. Dialogue with machines. Cognition 30, 1 (October 1988), 37--72.",
      "doi": ""
    },
    {
      "text": "Margaret Lahey. 1988. Language Disorders and Language Development (1 edition ed.). Pearson, New York?: London.",
      "doi": ""
    },
    {
      "text": "M. Lohse, K. J. Rohlfing, B. Wrede, and G. Sagerer. 2008. \"Try something else!\" - When users change their discursive behavior in human-robot interaction. In 2008 IEEE International Conference on Robotics and Automation, 3481--3486.",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf Between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16), 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Barbara G. MacLachlan and Robin S. Chapman. 1988. Communication Breakdowns in Normal and Language Learning-Disabled Children's Conversation and Narration. J. Speech Hear. Disord. 53, (1988).",
      "doi": ""
    },
    {
      "text": "Tova Most. 2002. The Use of Repair Strategies by Children With and Without Hearing Impairment. Lang. Speech Hear. Serv. Sch. 33, 2 (April 2002), 112--123.",
      "doi": ""
    },
    {
      "text": "Clifford I. Nass, Youngme Moon, John Morkes, Eun-Young Kim, and B. J. Fogg. 1997. Human Values and the Design of Computer Technology. In Batya Friedman (ed.). Center for the Study of Language and Information, Stanford, CA, USA, 137--162. Retrieved August 31, 2018 from http://dl.acm.org/citation.cfm?id=278213.278222 ",
      "doi": "10.5555/278213.278222"
    },
    {
      "text": "M. A. Norman and P. J. Thomas. 1991. Informing HCI design through conversation analysis. Int. J. Man-Mach. Stud. 35, 2 (August 1991), 235-- 250.  ",
      "doi": "10.1016/S0020-7373%2805%2980150-6"
    },
    {
      "text": "Sharon Oviatt, Jon Bernard, and Gina-Anne Levow. 1998. Linguistic adaptations during spoken and multimodal error resolution. Lang. Speech 41, 3/4 (July 1998), 419--442.",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 2015. Qualitative research & evaluation methods: integrating theory and practice (Fourth edi ed.). SAGE Publications, Inc, Thousand Oaks, California.",
      "doi": ""
    },
    {
      "text": "Jamie Pearson, Jiang Hu, Holly P. Branigan, Martin J. Pickering, and Clifford I. Nass. 2006. Adaptive Language Behavior in HCI: How Expectations and Beliefs About a System Affect Users' Word Choice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06), 1177--1180.  ",
      "doi": "10.1145/1124772.1124948"
    },
    {
      "text": "Hannah R.M. Pelikan and Mathias Broth. 2016. Why That Nao?: How Humans Adapt to a Conventional Humanoid Robot in Taking Turns-at-Talk. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI '16, 4921--4932.  ",
      "doi": "10.1145/2858036.2858478"
    },
    {
      "text": "Sarah Perez. Voice-enabled smart speakers to reach 55% of U.S. households by 2022, says report. TechCrunch. Retrieved September 5, 2018 from http://social.techcrunch.com/2017/11/08/voice-enabledsmart-speakers-to-reach-55-of-u-s-households-by-2022-says-report/",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 640:1-- 640:12.  ",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, and Sarah Sharples. 2017. \"Do Animals Have Accents?\": Talking with Agents in Multi-Party Conversation. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17), 207--219.  ",
      "doi": "10.1145/2998181.2998298"
    },
    {
      "text": "Carol A. Prutting. 1982. Pragmatics as Social Competence. J. Speech Hear. Disord. 47, 2 (May 1982), 123--134.",
      "doi": ""
    },
    {
      "text": "Kenyatta O. Rivers, Yvette D. Hyter, and Glenda DeJarnette. 2012. Parsing Pragmatics. ASHA Lead. 17, 13 (October 2012), 14--17.",
      "doi": ""
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. \"Hey Alexa, What's Up?\": A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18), 857--868.  ",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Tina Sharpe. 2006. \"Unpacking\" Scaffolding: Identifying Discourse and Multimodal Strategies that Support Learning. Lang. Educ. Int. J. 20, 3 (May 2006), 211--231.",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and situated actions: The problem of humanmachine communication. Cambridge university press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Lori Takeuchi and R Stevens. 2011. The new coviewing: Designing for learning through joint media engagement.",
      "doi": ""
    },
    {
      "text": "Geraldine P. Wallach and Katharine G. Butler. 1994. Language Learning Disabilities in School-Age Children and Adolescents: Some Principles and Applications (1 edition ed.). Pearson, New York?: Toronto?: New York.",
      "doi": ""
    },
    {
      "text": "Akiko Yamazaki, Keiichi Yamazaki, Matthew Burdelski, Yoshinori Kuno, and Mihoko Fukushima. 2010. Coordination of verbal and non-verbal actions in human--robot interaction at museums and exhibitions. J. Pragmat. 42, 9 (September 2010), 2398--2414.",
      "doi": ""
    },
    {
      "text": "Svetlana Yarosh, Stryker Thompson, Kathleen Watson, Alice Chase, Ashwin Senthilkumar, Ye Yuan, and A. J. Bernheim Brush. 2018. Children Asking Questions: Speech Interface Reformulations and Personification Preferences. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18), 300--312.  ",
      "doi": "10.1145/3202185.3202207"
    },
    {
      "text": "Four to Five Years Old. American Speech-Language-Hearing Association. Retrieved August 20, 2018 from https://www.asha.org/public/speech/development/45/",
      "doi": ""
    }
  ]
}