{
  "doi": "10.1145/3290605.3300383",
  "title": "r/science: Challenges and Opportunities in Online Science Communication",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Online discussion websites, such as Reddit's r/science forum, have the potential to foster science communication between researchers and the general public. However, little is known about who participates, what is discussed, and whether such websites are successful in achieving meaningful science discussions. To find out, we conducted a mixed-methods study analyzing 11,859 r/science posts and conducting interviews with 18 community members. Our results show that r/science facilitates rich information exchange and that the comments section provides a unique science communication document that guides engagement with scientific research. However, this community-sourced science communication comes largely from a knowledgeable public. We conclude with design suggestions for a number of critical problems that we uncovered: addressing the problem of topic newsworthiness and balancing broader participation and rigor.",
  "authors": [
    {
      "name": "Ridley Jones",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365539",
      "orcid": "missing"
    },
    {
      "name": "Lucas Colusso",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99658986966/rel-imgonly/screenshot2015-03-15at3.00.38pm.png",
      "acmid": "99658986966",
      "orcid": "missing"
    },
    {
      "name": "Katharina Reinecke",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583575",
      "orcid": "0000-0001-7897-9325"
    },
    {
      "name": "Gary Hsieh",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495056",
      "orcid": "0000-0002-9460-2568"
    }
  ],
  "references": [
    {
      "text": "Ashley A Anderson, Dominique Brossard, Dietram A Scheufele, and Michael A Xenos. 2012. Online talk: How exposure to disagreement in online comments affects beliefs in the promise of controversial science. Citizen voices: Performing public participation in science and environment communication (2012), 119--135.",
      "doi": ""
    },
    {
      "text": "Judd Antin, Raymond Yee, Coye Cheshire, and Oded Nov. 2011. Gender differences in Wikipedia editing. In Proceedings of the 7th international symposium on wikis and open collaboration. ACM, 11--14.  ",
      "doi": "10.1145/2038558.2038561"
    },
    {
      "text": "Christopher Bartlett, Jonathan Sterne, and Matthias Egger. 2002. What is newsworthy? Longitudinal study of the reporting of medical research in two British newspapers. BMJ 325, 7355 (2002), 81--84.",
      "doi": ""
    },
    {
      "text": "John C. Besley, Anthony D. Dudo, Shupei Yuan, and Niveen Abi Ghannam. 2016. Qualitative Interviews With Science Communication Trainers About Communication Objectives and Goals. Science Communication 38, 3 (2016), 356--381.",
      "doi": ""
    },
    {
      "text": "Holly M. Bik and Miriam C. Goldstein. 2013. An Introduction to Social Media for Scientists. PLOS Biology 11, 4 (04 2013), 1--8.",
      "doi": ""
    },
    {
      "text": "Lutz Bornmann and Rüdiger Mutz. 2014. Growth rates of modern science: A bibliometric analysis. CoRR abs/1402.4578 (2014). http://arxiv.org/ abs/1402.4578",
      "doi": ""
    },
    {
      "text": "T. W. Burns, D. J. O'Connor, and S. M. Stocklmayer. 2003. Science Communication: A Contemporary Definition. Public Understanding of Science 12, 2 (2003), 183--202.",
      "doi": ""
    },
    {
      "text": "Jason Chilvers. 2010. Sustainable participation? Mapping out and reflecting on the field of public dialogue on science and technology. Technical Report. University of East Anglia, Norwich, UK.",
      "doi": ""
    },
    {
      "text": "PMD Collins and WF Bodmer. 1986. The public understanding of science. Technical Report. The Royal Institution, London, UK.",
      "doi": ""
    },
    {
      "text": "Bethan J Davies and Neil F Glasser. 2014. Analysis of www. AntarcticGlaciers. org as a tool for online science communication. Journal of Glaciology 60, 220 (2014), 399--406.",
      "doi": ""
    },
    {
      "text": "Thomas Dietz. 2013. Bringing values and deliberation to science communication. Proceedings of the National Academy of Sciences 110, Supplement 3 (2013), 14081--14087.",
      "doi": ""
    },
    {
      "text": "Aaron Drummond, Matthew A. Palmer, and James D. Sauer. 2016. Enhancing endorsement of scientific inquiry increases support for pro-environment policies. Royal Society Open Science 3, 9 (2016).",
      "doi": ""
    },
    {
      "text": "Elaine Howard Ecklund, Sarah A James, and Anne E Lincoln. 2012. How academic biologists and physicists view science outreach. PloS one 7, 5 (2012), e36240.",
      "doi": ""
    },
    {
      "text": "Denae Ford, Kristina Lustig, Jeremy Banks, and Chris Parnin. 2018. We Don't Do That Here: How Collaborative Editing with Mentors Improves Engagement in Social Q&A Communities. In Proceedings of the 2018 ACM Conference on Human Factors in Computing Systems. ACM, 608.  ",
      "doi": "10.1145/3173574.3174182"
    },
    {
      "text": "Bev France, Belinda Cridge, and Laura Fogg-Rogers. 2017. Organisational culture and its role in developing a sustainable science communication platform. International Journal of Science Education, Part B 7, 2 (2017), 146--160.",
      "doi": ""
    },
    {
      "text": "Adabriand Furtado, Nazareno Andrade, Nigini Oliveira, and Francisco Brasileiro. 2013. Contributor profiles, their dynamics, and their importance in five Q&A sites. In Proceedings of the 2013 ACM Conference on Computer Supported Cooperative Work. ACM, 1237--1252.  ",
      "doi": "10.1145/2441776.2441916"
    },
    {
      "text": "Devin Gaffney and J Nathan Matias. 2018. Caveat Emptor, Computational Social Science: Large-Scale Missing Data in a Widely-Published Reddit Corpus. arXiv preprint arXiv:1803.05046 (2018).",
      "doi": ""
    },
    {
      "text": "Barney G Glaser and Anselm L Strauss. 2017. Discovery of grounded theory: Strategies for qualitative research. Routledge.",
      "doi": ""
    },
    {
      "text": "Maria Glenski, Corey Pennycuff, and Tim Weninger. 2017. Consumers and curators: Browsing and voting patterns on Reddit. IEEE Transactions on Computational Social Systems 4, 4 (2017), 196--206.",
      "doi": ""
    },
    {
      "text": "Luke Goode. 2009. Social news, citizen journalism and democracy. New Media & Society 11, 8 (2009), 1287--1305.",
      "doi": ""
    },
    {
      "text": "David R. Gruber. 2017. Three Forms of Neurorealism: Explaining the Persistence of the \"Uncritically Real\" in Popular Neuroscience News. Written Communication 34, 2 (2017), 189--223.",
      "doi": ""
    },
    {
      "text": "Lars Guenther and Georg Ruhrmann. 2016. Scientific evidence and mass media: Investigating the journalistic intention to represent scientific uncertainty. Public Understanding of Science 25, 8 (2016), 927--943. PMID: 26802103.",
      "doi": ""
    },
    {
      "text": "Steven Johnson, Samer Faraj, and Sri Kudaravalli. 2014. Emergence of Power Laws in Online Communities: The Role of Social Mechanisms and Preferential Attachment. Management Information Systems Quarterly 38, 3 (09 2014), 795-- 808.  ",
      "doi": "10.25300/MISQ/2014/38.3.08"
    },
    {
      "text": "Dan M. Kahan. 2017. 'Ordinary science intelligence': a science-comprehension measure for study of risk and science communication, with notes on evolution and climate change. Journal of Risk Research 20, 8 (2017), 995--1016.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed Chi, Bryan A Pendleton, Bongwon Suh, and Todd Mytkowicz. 2007. Power of the few vs. wisdom of the crowd: Wikipedia and the rise of the bourgeoisie. World wide web 1, 2 (2007), 19.",
      "doi": ""
    },
    {
      "text": "Janice L. Krieger and Cindy Gallois. 2017. Translating Science: Using the Science of Language to Explicate the Language of Science. Journal of Language and Social Psychology 36, 1 (2017), 3--13.",
      "doi": ""
    },
    {
      "text": "Alex Leavitt and Joshua A Clark. 2014. Upvoting hurricane Sandy: event-based news production processes on a social news site. In Proceedings of the 2014 ACM Conference on Human Factors in Computing Systems. ACM, 1495--1504.  ",
      "doi": "10.1145/2556288.2557140"
    },
    {
      "text": "Stephan Lewandowsky and Klaus Oberauer. 2016. Motivated Rejection of Science. Current Directions in Psychological Science 25, 4 (2016), 217--222.",
      "doi": ""
    },
    {
      "text": "Q. Vera Liao, Wai-Tat Fu, and Markus Strohmaier. 2016. #Snowden: Understanding Biases Introduced by Behavioral Differences of Opinion Groups on Social Media. In Proceedings of the 2016 ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 3352--3363.  ",
      "doi": "10.1145/2858036.2858422"
    },
    {
      "text": "Susana Martinez-Conde and Stephen L. Macknik. 2017. Opinion: Finding the plot in science storytelling in hopes of enhancing science communication. Proceedings of the National Academy of Sciences 114, 31 (2017), 8127--8129.",
      "doi": ""
    },
    {
      "text": "Ashley Rose Mehlenbacher. 2017. Crowdfunding Science: Exigencies and Strategies in an Emerging Genre of Science Communication. Technical Communication Quarterly 26, 2 (2017), 127--144.",
      "doi": ""
    },
    {
      "text": "Steve Miller. 2001. Public understanding of science at the crossroads. Public Understanding of Science 10, 1 (2001), 115--120.",
      "doi": ""
    },
    {
      "text": "Blair Nonnecke, Dorine Andrews, and Jenny Preece. 2006. Non-public and public online community participation: Needs, attitudes and behavior. Electronic Commerce Research 6, 1 (2006), 7--20.  ",
      "doi": "10.1007/s10660-006-5985-x"
    },
    {
      "text": "Nigini Oliveira, Nazareno Andrade, and Katharina Reinecke. 2016. Participation differences in Q&A sites across countries: opportunities for cultural adaptation. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. ACM, 6.  ",
      "doi": "10.1145/2971485.2971520"
    },
    {
      "text": "Nigini Oliveira, Michael Muller, Nazareno Andrade, and Katharina Reinecke. 2018. The Exchange in StackExchange: Divergences between Stack Overflow and its Culturally Diverse Participants. In Proceedings of ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW). ACM.  ",
      "doi": "10.1145/3274399"
    },
    {
      "text": "Katherine Panciera, Aaron Halfaker, and Loren Terveen. 2009. Wikipedians are born, not made: a study of power editors on Wikipedia. In Proceedings of the ACM 2009 International Conference on Supporting Group Work. ACM, 51--60.  ",
      "doi": "10.1145/1531674.1531682"
    },
    {
      "text": "Vineet Pandey, Amnon Amir, Justine Debelius, Embriette R Hyde, Tomasz Kosciolek, Rob Knight, and Scott Klemmer. 2017. Gut instinct: Creating scientific theories with online learners. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6825--6836.  ",
      "doi": "10.1145/3025453.3025769"
    },
    {
      "text": "Vineet Pandey, Justine Debelius, Embriette R Hyde, Tomasz Kosciolek, Rob Knight, and Scott Klemmer. 2018. Docent: transforming personal intuitions to scientific hypotheses through content learning and process training. In Proceedings of the Fifth Annual ACM Conference on Learning at Scale. ACM, 9.  ",
      "doi": "10.1145/3231644.3231646"
    },
    {
      "text": "Pontus Plavén-Sigray, Granville James Matheson, Björn Christian Schiffler, and William Hedley Thompson. 2017. The Readability Of Scientific Texts Is Decreasing Over Time. bioRxiv (2017).",
      "doi": ""
    },
    {
      "text": "Jason Priem and Kaitlin Light Costello. 2010. How and why scholars cite on Twitter. Proceedings of the American Society for Information Science and Technology 47, 1 (2010), 1--4. ",
      "doi": "10.5555/1920331.1920440"
    },
    {
      "text": "M Jordan Raddick, Georgia Bracey, Pamela L Gay, Chris J Lintott, Carie Cardamone, Phil Murray, Kevin Schawinski, Alexander S Szalay, and Jan Vandenberg. 2013. Galaxy Zoo: Motivations of citizen scientists. arXiv preprint arXiv:1303.6886 (2013).",
      "doi": ""
    },
    {
      "text": "Lee Rainie, Cary Funk, and Monica Anderson. 2016. How Scientists Engage the Public. (2016). http://www.pewinternet.org/2015/02/15/ how-scientists-engage-public/",
      "doi": ""
    },
    {
      "text": "Mathieu Ranger and Karen Bultitude. 2016. 'The kind of mildly curious sort of science interested person like me': Science bloggers' practices relating to audience recruitment. Public Understanding of Science 25, 3 (2016), 361--378. PMID: 25361791.",
      "doi": ""
    },
    {
      "text": "reddit.com. 2018. Reddit API Documentation. (2018). https://www. reddit.com/dev/api/",
      "doi": ""
    },
    {
      "text": "Laura N. Rickard, Jonathon P. Schuldt, Gina M. Eosco, Clifford W. Scherer, and Ricardo A. Daziano. 2017. The Proof is in the Picture: The Influence of Imagery and Experience in Perceptions of Hurricane Messaging. Weather, Climate, and Society 9, 3 (2017), 471--485.",
      "doi": ""
    },
    {
      "text": "Joel Ross and Bill Tomlinson. 2011. Negabehaviors and environmental sustainability. Journal of Sustainability Education 2 (2011), 2011.",
      "doi": ""
    },
    {
      "text": "Pamela J. Shoemaker, Director Martin Eichholz, Eunyi Kim, and Brenda Wrigley. 2001. Individual and Routine Forces in Gatekeeping. Journalism & Mass Communication Quarterly 78, 2 (2001), 233--246.",
      "doi": ""
    },
    {
      "text": "Jane B Singer. 2014. User-generated visibility: Secondary gatekeeping in a shared media space. New Media & Society 16, 1 (2014), 55--73.",
      "doi": ""
    },
    {
      "text": "Kate Starbird, Jim Maddock, Mania Orand, Peg Achterman, and Robert M Mason. 2014. Rumors, false flags, and digital vigilantes: Misinformation on twitter after the 2013 boston marathon bombing. IConference 2014 Proceedings (2014).",
      "doi": ""
    },
    {
      "text": "Marzena ´ Swigo´ n. 2017. Knowledge sharing practices in informal scholarly communication amongst academics in Poland. Malaysian Journal of Library & Information Science 22, 2 (2017), 101--115.",
      "doi": ""
    },
    {
      "text": "Masamichi Takahashi, Masakazu Fujimoto, and Nobuhiro Yamasaki. 2003. The active lurker: influence of an in-house online community on its outside environment. In Proceedings of the 2003 international ACM SIGGROUP conference on Supporting group work. ACM, 1--10.  ",
      "doi": "10.1145/958160.958162"
    },
    {
      "text": "Phillip Tracy. 2018. How Reddit killed one of its most popular AMAs. (2018). https://www.dailydot.com/debug/ reddit-r-science-ama/, last accessed: 09/11/2018.",
      "doi": ""
    },
    {
      "text": "Debbie Treise and Michael F Weigold. 2002. Advancing science communication: A survey of science communicators. Science Communication 23, 3 (2002), 310-- 322.",
      "doi": ""
    },
    {
      "text": "Rajan Vaish, Shirish Goyal, Amin Saberi, and Sharad Goel. 2018. Creating Crowdsourced Research Talks at Scale. In Proceedings of the 2018 World Wide Web Conference on World Wide Web. International World Wide Web Conferences Steering Committee, 1--11.  ",
      "doi": "10.1145/3178876.3186031"
    },
    {
      "text": "Dustin J. Welbourne and Will J. Grant. 2016. Science communication on YouTube: Factors that affect channel and video popularity. Public Understanding of Science 25, 6 (2016), 706--718. PMID: 25698225.",
      "doi": ""
    },
    {
      "text": "Brooke Foucault Welles and Isabel Meirelles. 2015. Visualizing Computational Social Science: The Multiple Lives of a Complex Image. Science Communication 37, 1 (2015), 34--58.",
      "doi": ""
    },
    {
      "text": "Stephan Winter and Nicole C Krämer. 2016. Who's right: The author or the audience? Effects of user comments and ratings on the perception of online science articles. Communications--The European Journal of Communication Research 41, 3 (2016), 339--360.",
      "doi": ""
    }
  ]
}