{
  "doi": "10.1145/3290605.3300238",
  "title": "Anchored Audio Sampling: A Seamless Method for Exploring Children's Thoughts During Deployment Studies",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Many traditional HCI methods, such as surveys and interviews, are of limited value when working with preschoolers. In this paper, we present anchored audio sampling (AAS), a remote data collection technique for extracting qualitative audio samples during field deployments with young children. AAS offers a developmentally sensitive way of understanding how children make sense of technology and situates their use in the larger context of daily life. AAS is defined by an anchor event, around which audio is collected. A sliding window surrounding this anchor captures both antecedent and ensuing recording, providing the researcher insight into the activities that led up to the event of interest as well as those that followed. We present themes from three deployments that leverage this technique. Based on our experiences using AAS, we have also developed a reusable open-source library for embedding AAS into any Android application.",
  "authors": [
    {
      "name": "Alexis Hiniker",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258949157",
      "orcid": "0000-0003-1607-0778"
    },
    {
      "name": "Jon E. Froehlich",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81331492504/rel-imgonly/81331492504.jpg",
      "acmid": "81331492504",
      "orcid": "0000-0001-8291-3353"
    },
    {
      "name": "Mingrui Zhang",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659529048/rel-imgonly/f.png",
      "acmid": "99659529048",
      "orcid": "missing"
    },
    {
      "name": "Erin Beneteau",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365459",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "{n. d.}. Amazon Web Services (AWS) - Cloud Computing Services. https://aws.amazon.com/",
      "doi": ""
    },
    {
      "text": "1978. The Belmont report: Ethical principles and guidelines for the protection of human subjects of research. Superintendent of Documents.",
      "doi": ""
    },
    {
      "text": "2017. The Common Sense Census: Media Use by Kids Age Zero to Eight 2017 | Common Sense Media., 64 pages. https://www.commonsensemedia.org/research/ the-common-sense-census-media-use-by-kids-age-zero-to-eight-2017",
      "doi": ""
    },
    {
      "text": "Saeed Abdullah, Elizabeth L. Murnane, Mark Matthews, Matthew Kay, Julie A. Kientz, Geri Gay, and Tanzeem Choudhury. 2016. Cognitive rhythms. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '16. ACM Press, New York, New York, USA, 178--189.  ",
      "doi": "10.1145/2971648.2971712"
    },
    {
      "text": "Sabirah Adams, Shazly Savahl, and Tobia Fattore. 2017. Children's representations of nature using photovoice and community mapping: Perspectives from South Africa. International Journal of Qualitative Studies on Health and Well-being 12, 1 (jan 2017), 1333900.",
      "doi": ""
    },
    {
      "text": "William Albert, Thomas Tullis, and Donna Tedesco. 2009. Beyond the usability lab: Conducting large-scale online user experience studies. Morgan Kaufmann. ",
      "doi": "10.5555/1824099"
    },
    {
      "text": "AHMED S Alghamdi, ALIH Al-Badi, ROOBAEA ALROOBAEA, and P Mayhew. 2013. A Comparative Study of Synchronous and Asynchronous Remote Usability Testing Methods. International Review of Basic and Applied Sciences 1, 3 (2013), 61--97.",
      "doi": ""
    },
    {
      "text": "Morten Sieker Andreasen, Henrik Villemann Nielsen, Simon Ormholt Schrøder, and Jan Stage. 2007. What happened to remote usability testing?. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, New York, New York, USA, 1405.  ",
      "doi": "10.1145/1240624.1240838"
    },
    {
      "text": "Sangwon Bae, Tammy Chung, Denzil Ferreira, Anind K. Dey, and Brian Sufoletto. 2018. Mobile phone sensors and supervised machine learning to identify alcohol use events in young adults: Implications for just-in-time adaptive interventions. Addictive Behaviors 83 (aug 2018), 42--47.",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Olivia Richards, Mingrui Zhang, Julie A. Kientz, Jason C. Yip, and Alexis Hiniker. 2019. Communication breakdowns between families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19. 1--14.  ",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Scott Carter, Jennifer Mankof, and Jefrey Heer. 2007. Momento. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, New York, New York, USA, 125. arXiv:arXiv:1303.5153v1  ",
      "doi": "10.1145/1240624.1240644"
    },
    {
      "text": "Eve V Clark. 2009. First language acquisition. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo and Miriam Walker. 2003. Using the experience sampling method to evaluate ubicomp applications. IEEE Pervasive Computing 2, 2 (apr 2003), 24--31.  ",
      "doi": "10.1109/MPRV.2003.1203750"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2008. Basics of qualitative research: Techniques and procedures for developing grounded theory. (2008).",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. Proceedings of the 2004 conference on Human factors in computing systems - CHI '04 (2004), 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Pierre-Charles David and Thomas Ledoux. 2005. WildCAT. In Proceedings of the 3rd international workshop on Middleware for pervasive and ad-hoc computing - MPAC '05. ACM Press, New York, New York, USA, CHI 2019, May 4--9, 2019, Glasgow, Scotland UK A. Hiniker et al. 1--7.",
      "doi": ""
    },
    {
      "text": "Anind K. Dey and Jennifer Mankof. 2005. Designing mediation for context-aware applications. ACM Transactions on Computer-Human Interaction 12, 1 (mar 2005), 53--80.  ",
      "doi": "10.1145/1057237.1057241"
    },
    {
      "text": "Anind K. Dey, Katarzyna Wac, Denzil Ferreira, Kevin Tassini, Jin-Hyuk Hong, and Julian Ramos. 2011. Getting closer. In Proceedings of the 13th international conference on Ubiquitous computing - UbiComp '11. ACM Press, New York, New York, USA, 163.",
      "doi": "10.1145/2030112.2030135"
    },
    {
      "text": "Allison Druin. 1999. Cooperative inquiry. In Proceedings of the SIGCHI conference on Human factors in computing systems the CHI is the limit - CHI '99. ACM Press, New York, New York, USA, 592--599.  ",
      "doi": "10.1145/302979.303166"
    },
    {
      "text": "Allison Druin. 2002. The role of children in the design of new technology. Behaviour & Information Technology 21, 1 (jan 2002), 1--25.",
      "doi": "10.1080/01449290210147484"
    },
    {
      "text": "Nicolas Ducheneaut and Robert J. Moore. 2004. The social side of gaming. In Proceedings of the 2004 ACM conference on Computer supported cooperative work - CSCW '04. ACM Press, New York, New York, USA, 360.  ",
      "doi": "10.1145/1031607.1031667"
    },
    {
      "text": "Jóhanna Einarsdóttir. 2007. Research with children: methodological and ethical challenges. European Early Childhood Education Research Journal 15, 2 (jun 2007), 197--211.",
      "doi": ""
    },
    {
      "text": "Emre Ertin, Nathan Stohs, Santosh Kumar, Andrew Raij, Mustafa Al'Absi, and Siddharth Shah. 2011. AutoSense. In Proceedings of the 9th ACM Conference on Embedded Networked Sensor Systems SenSys '11. ACM Press, New York, New York, USA, 274.",
      "doi": ""
    },
    {
      "text": "Allison Farber, Allison Druin, Gene Chipman, Dawn Julian, and Sheila Somashekher. 2002. How Young Can Our Technology Design Partners Be?. In PDC. 272--277.",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Mike Y. Chen, Sunny Consolvo, Beverly Harrison, and James A. Landay. 2007. MyExperience. In Proceedings of the 5th international conference on Mobile systems, applications and services - MobiSys '07. ACM Press, New York, New York, USA, 57.",
      "doi": ""
    },
    {
      "text": "Amy Gallo. 2017. A Refresher on A/B Testing. Harvard Business Review (jun 2017). https://hbr.org/2017/06/a-refresher-on-ab-testing",
      "doi": ""
    },
    {
      "text": "Franca Garzotto. 2008. Broadening children's involvement as design partners. In Proceedings of the 7th international conference on Interaction design and children - IDC '08. ACM Press, New York, New York, USA, 186.  ",
      "doi": "10.1145/1463689.1463755"
    },
    {
      "text": "M Elizabeth Graue and Daniel J Walsh. 1998. Studying children in context: Theories, methods, and ethics. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Deborah Harcourt. 2011. An encounter with children: Seeking meaning and understanding about childhood. European Early Childhood Education Research Journal 19, 3 (sep 2011), 331--343.",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes, Shwetak N. Patel, Khai N. Truong, Giovanni Iachello, Julie A. Kientz, Rob Farmer, and Gregory D. Abowd. 2004. The Personal Audio Loop: Designing a Ubiquitous Audio-Based Memory Aid. Springer, Berlin, Heidelberg, 168--179.",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes, Khai N. Truong, Gregory D. Abowd, and Trevor Pering. 2005. Experience bufers. In CHI '05 extended abstracts on Human factors in computing systems - CHI '05. ACM Press, New York, New York, USA, 1435.  ",
      "doi": "10.1145/1056808.1056935"
    },
    {
      "text": "Morten Hertzum, Pia Borlund, and Kristina B. Kristofersen. 2015. What Do Thinking-Aloud Participants Say? A Comparison of Moderated and Unmoderated Usability Sessions. International Journal of Human-Computer Interaction 31, 9 (sep 2015), 557--570.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sharon S. Heung, Sungsoo (Ray) Hong, and Julie A. Kientz. 2018. Coco's Videos. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18, Vol. 2018-April. 1--13.  ",
      "doi": "10.1145/3173574.3173828"
    },
    {
      "text": "Steve Hodges, Lyndsay Williams, Emma Berry, Shahram Izadi, James Srinivasan, Alex Butler, Gavin Smyth, Narinder Kapur, and Ken Wood. 2006. SenseCam: A Retrospective Memory Aid. Springer, Berlin, Heidelberg, 177--193. arXiv:9780201398298  ",
      "doi": "10.1007/11853565_11"
    },
    {
      "text": "Karen Holtzblatt and Sandra Jones. 1993. Contextual inquiry: A participatory technique for system design. Participatory design: Principles and practices (1993), 177--210.",
      "doi": ""
    },
    {
      "text": "John Hughes, L Bannon, J Bowers, P Carstensen, K Kuutti, J Pycock, T Rodden, K Schmidt, D Shapiro, W Sharrock, and Others. 1993. Informing CSCW system requirements. COMIC, Esprit Basic Research Project 6225 (1993).",
      "doi": ""
    },
    {
      "text": "Stephen S. Intille, John Rondoni, Charles Kukla, Isabel Ancona, and Ling Bao. 2003. A context-aware experience sampling tool. In CHI '03 extended abstracts on Human factors in computer systems - CHI '03. ACM Press, New York, New York, USA, 972.  ",
      "doi": "10.1145/765891.766101"
    },
    {
      "text": "Sara Isola and Jerry Fails. 2012. Family and Design in the IDC and CHI Communitieis. IDC 2012 (2012), 40--49.  ",
      "doi": "10.1145/2307096.2307102"
    },
    {
      "text": "Janne J. Jensen and Mikael B. Skov. 2005. A review of research methods in children's technology design. In Proceeding of the 2005 conference on Interaction design and children - IDC '05. ACM Press, New York, New York, USA, 80--87.  ",
      "doi": "10.1145/1109540.1109551"
    },
    {
      "text": "Jasmine Jones, David Merritt, and Mark S. Ackerman. 2017. KidKeeper. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW '17. ACM Press, New York, New York, USA, 1864--1875.  ",
      "doi": "10.1145/2998181.2998348"
    },
    {
      "text": "Hilda K Kabali, Matilde M Irigoyen, Rosemary Nunez-Davis, Jennifer G Budacki, Sweta H Mohanty, Kristin P Leister, and Robert L Bonner. 2015. Exposure and Use of Mobile Media Devices by Young Children. Pediatrics (nov 2015), peds.2015--2151--.",
      "doi": ""
    },
    {
      "text": "Eiman Kanjo. 2010. NoiseSPY: A real-time mobile phone platform for urban noise monitoring and mapping. Mobile Networks and Applications 15, 4 (aug 2010), 562--574.  ",
      "doi": "10.1007/s11036-009-0217-y"
    },
    {
      "text": "Kostadin Kushlev and Elizabeth W. Dunn. 2018. Smartphones distract parents from cultivating feelings of connection when spending time with their children. Journal of Social and Personal Relationships (apr 2018), 026540751876938.",
      "doi": ""
    },
    {
      "text": "Reed Larson and Mihaly Csikszentmihalyi. 1983. The experience sampling method. New directions for methodology of social & behavioral science (1983).",
      "doi": ""
    },
    {
      "text": "Kai Lukof, Cissy Yu, Julie Kientz, and Alexis Hiniker. 2018. What Makes Smartphone Use Meaningful or Meaningless? Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (mar 2018), 1--26.  ",
      "doi": "10.1145/3191754"
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys that Listen. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (CHI '17). ACM, New York, 5197--5207.  ",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "David R. Millen. 2000. Rapid ethnography. In Proceedings of the conference on Designing interactive systems processes, practices, methods, and techniques - DIS '00. ACM Press, New York, New York, USA, 280--286. Anchored Audio Sampling  ",
      "doi": "10.1145/347642.347763"
    },
    {
      "text": "E Olmsted and M Gill. 2005. In-person usability study compared with self-administered web (remote-diferent time-place) study: does mode of study produce similar results. In Proceedings of UPA.",
      "doi": ""
    },
    {
      "text": "Judith S Olson and Wendy A Kellogg. 2014. Ways of Knowing in HCI. Springer Science & Business. ",
      "doi": "10.5555/2631405"
    },
    {
      "text": "Antti Oulasvirta. 2009. Field Experiments in HCI: Promises and Challenges. In Future Interaction Design II. Springer London, London, 87-- 116.",
      "doi": ""
    },
    {
      "text": "Leysia Palen and Marilyn Salzman. 2002. Voice-mail diary studies for naturalistic data capture under mobile conditions. In Proceedings of the 2002 ACM conference on Computer supported cooperative work - CSCW '02. ACM Press, New York, New York, USA, 87.  ",
      "doi": "10.1145/587078.587092"
    },
    {
      "text": "Kiran K. Rachuri, Cecilia Mascolo, Mirco Musolesi, and Peter J. Rentfrow. 2011. SociableSense. In Proceedings of the 17th annual international conference on Mobile computing and networking - MobiCom '11. ACM Press, New York, New York, USA, 73.",
      "doi": ""
    },
    {
      "text": "Kiran K. Rachuri, Mirco Musolesi, Cecilia Mascolo, Peter J. Rentfrow, Chris Longworth, and Andrius Aucinas. 2010. EmotionSense. In Proceedings of the 12th ACM international conference on Ubiquitous computing - Ubicomp '10. ACM Press, New York, New York, USA, 281.  ",
      "doi": "10.1145/1864349.1864393"
    },
    {
      "text": "Mika Raento, Antti Oulasvirta, and Nathan Eagle. 2009. Smartphones: An emerging tool for social scientists. Sociological Methods and Research 37, 3 (feb 2009), 426--454. arXiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "M. Raento, A. Oulasvirta, R. Petit, and H. Toivonen. 2005. ContextPhone: A Prototyping Platform for Context-Aware Mobile Applications. IEEE Pervasive Computing 4, 2 (apr 2005), 51--59.  ",
      "doi": "10.1109/MPRV.2005.29"
    },
    {
      "text": "Robert W. Reeder, Adrienne Porter Felt, Sunny Consolvo, Nathan Malkin, Christopher Thompson, and Serge Egelman. 2018. An Experience Sampling Study of User Reactions to Browser Warnings in the Field. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, New York, New York, USA, 1--13.  ",
      "doi": "10.1145/3173574.3174086"
    },
    {
      "text": "Katharina Reinecke and Abraham Bernstein. 2011. Improving performance, perceived usability, and aesthetics with culturally adaptive user interfaces. ACM Transactions on Computer-Human Interaction 18, 2 (jun 2011), 1--29.  ",
      "doi": "10.1145/1970378.1970382"
    },
    {
      "text": "Yvonne Rogers, Kay Connelly, Lenore Tedesco, William Hazlewood, Andrew Kurtz, Robert E. Hall, Josh Hursey, and Tammy Toscos. 2007. Why It's Worth the Hassle: The Value of In-Situ Studies When Designing Ubicomp. In UbiComp 2007: Ubiquitous Computing. Springer Berlin Heidelberg, Berlin, Heidelberg, 336--353. ",
      "doi": "10.5555/1771592.1771612"
    },
    {
      "text": "Juergen Sauer, Andreas Sonderegger, Klaus Heyden, Jasmin Biller, Julia Klotz, and Andreas Uebelbacher. 2019. Extra-laboratorial usability tests: An empirical comparison of remote and classical feld testing with lab testing. Applied Ergonomics 74 (jan 2019), 85--96.",
      "doi": ""
    },
    {
      "text": "Abigail J. Sellen, Andrew Fogg, Mike Aitken, Steve Hodges, Carsten Rother, and Ken Wood. 2007. Do life-logging technologies support memory for the past?. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '07. ACM Press, New York, New York, USA, 81.  ",
      "doi": "10.1145/1240624.1240636"
    },
    {
      "text": "Clayton Shepard, Ahmad Rahmati, Chad Tossell, Lin Zhong, and Phillip Kortum. 2011. LiveLab. ACM SIGMETRICS Performance Evaluation Review 38, 3 (jan 2011), 15. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK",
      "doi": ""
    },
    {
      "text": "Timothy Sohn, Kevin A. Li, William G. Griswold, and James D. Hollan. 2008. A diary study of mobile information needs. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI '08. ACM Press, New York, New York, USA, 433.  ",
      "doi": "10.1145/1357054.1357125"
    },
    {
      "text": "Arthur A Stone, Saul S Shifman, and Marten W DeVries. 1999. Ecological momentary assessment. (1999).",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Caroline Wang and Mary Ann Burris. 1997. Photovoice: Concept, Methodology, and Use for Participatory Needs Assessment. Health Education & Behavior 24, 3 (jun 1997), 369--387.",
      "doi": ""
    },
    {
      "text": "Rui Wang, Emily A. Scherer, Vincent W. S. Tseng, Dror Ben-Zeev, Min S. H. Aung, Saeed Abdullah, Rachel Brian, Andrew T. Campbell, Tanzeem Choudhury, Marta Hauser, John Kane, and Michael Merrill. 2016. CrossCheck: toward passive sensing and detection of mental health changes in people with schizophrenia. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp '16. ACM Press, New York, New York, USA, 886--897.  ",
      "doi": "10.1145/2971648.2971740"
    },
    {
      "text": "Rui Wang, Emily A. Scherer, Megan Walsh, Weichen Wang, Min Hane Aung, Dror Ben-Zeev, Rachel Brian, Andrew T. Campbell, Tanzeem Choudhury, Marta Hauser, and John Kane. 2018. PREDICTING SYMPTOM TRAJECTORIES OF SCHIZOPHRENIA USING MOBILE SENSING. GetMobile: Mobile Computing and Communications 22, 2 (sep 2018), 32--37.  ",
      "doi": "10.1145/3276145.3276157"
    },
    {
      "text": "Graver J. Whitehurst and Christopher J. Lonigan. 1998. Child Development and Emergent Literacy. Child Development 69, 3 (jun 1998), 848--872.",
      "doi": ""
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Caroline Pitt, Kung Jin Lee, Sijin Chen, Kari Nasu, and Laura R. Pina. 2017. Examining Adult-Child Interactions in Intergenerational Participatory Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17. ACM Press, New York, New York, USA, 5742--5754.  ",
      "doi": "10.1145/3025453.3025787"
    }
  ]
}