{
  "doi": "10.1145/3290605.3300485",
  "title": "Crowdlicit: A System for Conducting Distributed End-User Elicitation and Identification Studies",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "End-user elicitation studies are a popular design method. Currently, such studies are usually confined to a lab, limiting the number and diversity of participants, and therefore the representativeness of their results. Furthermore, the quality of the results from such studies generally lacks any formal means of evaluation. In this paper, we address some of the limitations of elicitation studies through the creation of the Crowdlicit system along with the introduction of end-user identification studies, which are the reverse of elicitation studies. Crowdlicit is a new web-based system that enables researchers to conduct online and in-lab elicitation and identification studies. We used Crowdlicit to run a crowd-powered elicitation study based on Morris's \"Web on the Wall\" study (2012) with 78 participants, arriving at a set of symbols that included six new symbols different from Morris's. We evaluated the effectiveness of 49 symbols (43 from Morris and six from Crowdlicit) by conducting a crowd-powered identification study. We show that the Crowdlicit elicitation study resulted in a set of symbols that was significantly more identifiable than Morris's.",
  "authors": [
    {
      "name": "Abdullah X. Ali",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99658705728/rel-imgonly/b0c4d23b-845f-4299-910e-8089d3809af0.jpeg",
      "acmid": "99658705728",
      "orcid": "missing"
    },
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "Luis von Ahn, and Laura Dabbish. (2004). Labeling images with a computer game. Proceedings of the ACM conference on Human factors in computing systems (CHI'04). Vienna, Austria. New York: ACM Press, pp. 319--326.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Abdullah X. Ali, Meredith R. Morris, and Jacob O. Wobbrock. (2018). Crowdsourcing Similarity Judgments for Agreement Analysis in End-User Elicitation Studies. Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '18). Berlin, Germany. New York: ACM Press, pp. 177--188.  ",
      "doi": "10.1145/3242587.3242621"
    },
    {
      "text": "Michael S. Bernstein, Greg Little, Robert C. Miller, Björn Hartmann, Mark S. Ackerman, David R. Karger, David Crowell, and Katrina Panovich. (2010). Soylent: a word processor with a crowd inside. Proceedings of the 23nd annual ACM symposium on User interface software and technology (UIST'10). New York, NY. New York: ACM Press, pp. 313--322.  ",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Aubrey Tatarowicz, Brandyn White, Samual White, and Tom Yeh. (2010). VizWiz: nearly real-time answers to visual questions. Proceedings of the ACM symposium on User interface software and technology (UIST '10). New York, NY. ACM, New York, NY, USA, pp. 333--342.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Maria Claudia Buzzi, Marina Buzzi, Barbara Leporini, and Amaury Trujillo. (2015). Exploring Visually Impaired People's Gesture Preferences for Smartphones. Proceedings of the 11th Biannual Conference on Italian SIGCHI Chapter (CHItaly'15). Rom, Italy. New York: ACM Press, pp. 94--101.  ",
      "doi": "10.1145/2808435.2808448"
    },
    {
      "text": "Krista Casler, Lydia Bickel, and Elizabeth Hackett. (2013). Separate but equal? A comparison of participants and data gathered via Amazon's MTurk, social media, and face-to-face behavioral testing. Computers in Human Behavior 29, (6) pp. 2156--2160.  ",
      "doi": "10.1016/j.chb.2013.05.009"
    },
    {
      "text": "Jessica R. Cauchard, Jane L. E., Kevin Y. Zhai, and James A. Landay. (2015). Drone & me: an exploration into natural human-drone interaction. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp'15). Osaka, Japan. New York: ACM Press, pp. 361--365.  ",
      "doi": "10.1145/2750858.2805823"
    },
    {
      "text": "Joel Chan, Steven Dang, and Steven P. Dow. (2016). Improving crowd innovation with expert facilitation. Proceedings of the ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW'16). San Francisco, CA. New York: ACM Press, pp. 1223--1235.  ",
      "doi": "10.1145/2818048.2820023"
    },
    {
      "text": "Sabrina Connell, Pei-Yi Kuo, Liu Liu, and Anne Marie Piper. (2013). A Wizardof-Oz elicitation study examining child-defined gestures with a whole-body interface. Proceedings of the 12th International Conference on Interaction Design and Children (IDC'13). New York, NY. New York: ACM Press, pp. 277--280.  ",
      "doi": "10.1145/2485760.2485823"
    },
    {
      "text": "Giuseppe Desolda, Carmelo Ardito, and Maristella Matera. (2017). Empowering End Users to Customize their Smart Environments. ACM Transactions on Computer-Human Interaction 24, (2) pp. 1--52.  ",
      "doi": "10.1145/3057859"
    },
    {
      "text": "Nem Khan Dim, Chaklam Silpasuwanchai, Sayan Sarcar, and Xiangshi Ren. (2016). Designing Mid-Air TV Gestures for Blind People Using User- and Choice-Based Elicitation Approaches. Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS'16). Brisbane, Australia. New York: ACM Press, pp. 204--214.  ",
      "doi": "10.1145/2901790.2901834"
    },
    {
      "text": "Leah Findlater, Ben Lee, and Jacob O. Wobbrock. (2012). Beyond QWERTY: augmenting touch screen keyboards with multi-touch gestures for nonalphanumeric input. Proceedings of the ACM conference on Human Factors in Computing Systems (CHI'12). Austin, Texas. New York: ACM Press, pp. 2679-- 2682.  ",
      "doi": "10.1145/2207676.2208660"
    },
    {
      "text": "Kraig Finstad. (2013). Response to commentaries on ?The usability metric for user experience.\" Interacting with Computers 25, (4) pp. 327--330.  ",
      "doi": "10.1016/j.intcom.2010.04.004"
    },
    {
      "text": "Michael D. Good, John A. Whiteside, Dennis R. Wixon, and Sandra J. Jones. (1984). Building a user-derived interface. Communications of the ACM 27, (10) pp. 1032--1043.  ",
      "doi": "10.1145/358274.358284"
    },
    {
      "text": "Lynn Hoff, Eva Hornecker, Sven Bertel. (2016). Modifying Gesture Elicitation: Do Kinaesthetic Priming and Increased Production Reduce Legacy Bias? Proceedings of the Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI'16). Eindhoven, Netherlands. New York: ACM Press, pp. 86--91.  ",
      "doi": "10.1145/2839462.2839472"
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Richard E. Ladner. (2011). Usable gestures for blind people. Proceedings of the 2011 annual conference on Human factors in computing systems (CHI'11). Vancouver, Canada. New York: ACM Press, pp. 413--422.  ",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Aniket Kittur, Ed H. Chi, Bongwon and Suh. (2008). Crowdsourcing user studies with Mechanical Turk. In Proceeding of the twenty-sixth annual conference on Human factors in computing systems (CHI'08). Florence, Italy. New York: ACM Press, pp. 453--456.  ",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Anne Köpsel, Nikola and Bubalo. (2015). Benefiting from legacy bias. Interactions 22, (5) pp. 44--47.  ",
      "doi": "10.1145/2803169"
    },
    {
      "text": "Christine Kühnel, Tilo Westermann, Fabian Hemmert, Sven Kratz, Alexander Müller, and Sebastian Möller. (2011). Im home: Defining and evaluating a gesture set for smart-home control. International Journal of Human Computer Studies 69, (11) pp. 693--704.",
      "doi": ""
    },
    {
      "text": "Sang Won Lee, Yujin Zhang, Isabelle Wong, Yiwei Yang, Stephanie D. O'Keefe, and Walter S. Lasecki. (2017). SketchExpress: Remixing Animations for More Effective Crowd-Powered Prototyping of Interactive Interfaces. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST'17). Quebec City, Canada. New York: ACM Press, pp. 817--828.  ",
      "doi": "10.1145/3126594.3126595"
    },
    {
      "text": "Hoo Yong Leng. (2017). A User-Defined Gesture Set for Music Interaction in Immersive Virtual Environment. (2) pp. 44--51.  ",
      "doi": "10.1145/3077343.3077348"
    },
    {
      "text": "Hoo Yong Leng, Noris Mohd Norowi, and Azrul Hazri Jantan. (2017). A UserDefined Gesture Set for Music Interaction in Immersive Virtual Environment. Proceedings of the 3rd International Conference on Human-Computer Interaction and User Experience in Indonesia (CHIuXiD'17,) Jakarta, Indonesia. New York: ACM Press, pp. 44--51.  ",
      "doi": "10.1145/3077343.3077348"
    },
    {
      "text": "Keenan R. May, Thomas M. Gable, and Bruce N. Walker. (2017). Designing an In-Vehicle Air Gesture Set Using Elicitation Methods. Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (AutomotiveUI'17). Oldenburg, Germany. New York: ACM Press, pp. 74--83.  ",
      "doi": "10.1145/3122986.3123015"
    },
    {
      "text": "Erin Mcaweeney,Haihua Zhang, Michael Nebeling, M. (2018). User-Driven Design Principles for Gesture Representations. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI'18).Montreal, Canada. New York: ACM Press, pp. 1--13.  ",
      "doi": "10.1145/3173574.3174121"
    },
    {
      "text": "David McGookin, Stephen Brewster, and WeiWei Jiang. (2008). Investigating touchscreen accessibility for people with visual impairments. Proceedings of the 5th Nordic conference on Human-computer interaction building bridges (NordiCHI'08). Lund, Sweden. New York: ACM Press, pp. 298--307.  ",
      "doi": "10.1145/1463160.1463193"
    },
    {
      "text": "Meredith R. Morris. (2012). Web on the Wall: Insights from a Multimodal Interaction Elicitation Study. Proceedings of the 2012 ACM international conference on Interactive tabletops and surfaces (ITS'12). Cambridge, MA. New York: ACM Press, pp. 95--104.  ",
      "doi": "10.1145/2396636.2396651"
    },
    {
      "text": "Meredith R. Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, m. c. Schraefel, and Jacob O. Wobbrock. (2014). Reducing legacy bias in gesture elicitation studies. Interactions 21, (3) pp. 40--45.  ",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Meredith R. Morris, Jacob O. Wobbrock, and Andrew D. Wilson. (2010). Understanding users' preferences for surface gestures. Proceedings of Graphics Interface (GI'10). Ottawa, CA. New York: ACM Press, pp. 261--268. ",
      "doi": "10.5555/1839214.1839260"
    },
    {
      "text": "Miguel A. Nacenta, Yemliha Kamber, Yizhou Qiang, and Per Ola Kristensson, P. O. (2013). Memorability of pre-designed and user-defined gesture sets. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI'13). Paris, France. New York: ACM Press, pp. 1099--1108.  ",
      "doi": "10.1145/2470654.2466142"
    },
    {
      "text": "Michael Nebeling, Alexander Huber, David Ott, and Moira C. Norrie. (2014). Web on the wall reloaded: Implementation, replication and refinement of userdefined interaction sets. Proceedings of the 9th ACM International Conference on Interactive Tabletops and Surfaces (ITS'14). Dresden, Germany. New York: ACM Press, pp. 15--24.  ",
      "doi": "10.1145/2669485.2669497"
    },
    {
      "text": "Michael Nebeling. (2017). XDBrowser 2. 0: Semi-Automatic Generation of Cross-Device Interfaces. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI'17). Denver, Colorado. New York: ACM Press, pp. 4574--4584.  ",
      "doi": "10.1145/3025453.3025547"
    },
    {
      "text": "Michael Nebeling, David Ott, and Moira C. Norrie. (2015). Kinect Analysis: A System for Recording, Analysing and Sharing Multimodal Interaction Elicitation Studies. Proceedings of the ACM SIGCHI Symposium on Engineering Interactive Computing Systems (EICS'15). Duisburg, Germany. New York: ACM Press, pp. 142--151.  ",
      "doi": "10.1145/2774225.2774846"
    },
    {
      "text": "Mohammad Obaid, Markus Häring, Felix Kistler, René Bühling, and Elisabeth André. (2012). User-defined body gestures for navigational control of a humanoid robot. Proceedings of the International Conference on Social Robotics. Berlin: Springer, pp. 367--377.  ",
      "doi": "10.1007/978-3-642-34103-8_37"
    },
    {
      "text": "Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. (2013). User-defined gestures for augmented reality. Proceedings of INTERACT 2013. Berlin: Springer, pp. 282--299.",
      "doi": "10.1145/2468356.2468527"
    },
    {
      "text": "Katharina Reinecke, and Krzysztof Z. Gajos. (2015). LabintheWild: Conducting Large-Scale Online Experiments With Uncompensated Samples. Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW'15). Vancouver, Canada. New York: ACM Press, pp. 1364-- 1378.  ",
      "doi": "10.1145/2675133.2675246"
    },
    {
      "text": "Theophanis Tsandilas. (2018). Fallacies of Agreement: A Critical Review of Consensus Assessment Methods for Gesture Elicitation. ACM Transactions on Computer-Human Interaction 25, (3) pp. 1--49.  ",
      "doi": "10.1145/3182168"
    },
    {
      "text": "Radu-Daniel Vatavu. (2012). User-defined gestures for free-hand TV control. In Proceedings of the 10th European conference on Interactive tv and video (EuroiTV'12). Berlin, Germany. New York: ACM Press, pp. 45--48.  ",
      "doi": "10.1145/2325616.2325626"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. (2015). Formalizing Agreement Analysis for Elicitation Studies. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI'15). Seoul, Republic of Korea. New York: ACM Press, pp. 1325--1334.  ",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. (2016). Between-Subjects Elicitation Studies. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI'16). San Jose, California, New York: ACM Press, pp. 3390--3402.  ",
      "doi": "10.1145/2858036.2858228"
    },
    {
      "text": "Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A, Myers. (2005). Maximizing the guessability of symbolic input. Proceedings of the ACM confrence on Human factors in computing systems (CHI'05). Portland, OR. New York: ACM Press, pp. 1869--1872.  ",
      "doi": "10.1145/1056808.1057043"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith R. Morris, and Andrew D. Wilson. (2009). Userdefined gestures for surface computing. Proceedings of the ACM conference on Human factors in computing systems (CHI'09). Boston, MA. New York: ACM Press, pp. 1083 -1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Kathryn Zyskowski, Meredith R. Morris, Jeffrey P. Bigham, Mary L. Gray, and Shaun K. Kane. (2015). Accessible Crowdwork?: Understanding the Value in and Challenge of Microtask Employment for People with Disabilities. Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW'15). Vancouver, Canada, New York: ACM Press, pp. 1682--1693.  ",
      "doi": "10.1145/2675133.2675158"
    }
  ]
}