{
  "doi": "10.1145/3290605.3300369",
  "title": "Exploring the Plurality of Black Women's Gameplay Experiences",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Few gender-focused studies of video games explore the gameplay experiences of women of color, and those that do tend to only emphasize negative phenomena (i.e., racial or gender discrimination). In this paper, we conduct an exploratory case study attending to the motivations and gaming practices of Black college women. Questionnaire responses and focus group discussion illuminate the plurality of gameplay experiences for this specific population of Black college women. Sixty-five percent of this population enjoy the ubiquity of mobile games with casual and puzzle games being the most popular genres. However, academic responsibilities and competing recreational interests inhibit frequent gameplay. Consequently, this population of Black college women represent two types of casual gamers who report positive gameplay experiences, providing insights into creating a more inclusive gaming subculture.",
  "tags": [
    "intersectionality",
    "gaming",
    "black women",
    "gendered game studies"
  ],
  "authors": [
    {
      "name": "Yolanda A. Rankin",
      "institution": "Florida State University, Tallahassee, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319499452",
      "orcid": "missing"
    },
    {
      "name": "Na-eun Han",
      "institution": "Florida State University, Tallahassee, FL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366147",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anna Brown. 2017. Younger men play video games, but so do a diverse group of Americans. (September 2017). Retrieved April 9, 2018 from http://pewrsr.ch/2xUYepm",
      "doi": ""
    },
    {
      "text": "Entertainment Software Association. 2017. Essential Facts about the Computer and Video Game Industry: 2017 sales, demographic and usage data.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2015. Gaming and Gamers. Pew Research Center Internet, Science & Tech. (December, 2015). Retrieved April 9, 2018 from http://pewrsr.ch/1Za2yJr",
      "doi": ""
    },
    {
      "text": "Adrienne Shaw. 2012. Do you identify as a gamer? Gender, race, sexuality, and gamer identity. New Media & Society 14, 1: 28--44.",
      "doi": ""
    },
    {
      "text": "Adrienne Shaw. 2013. On not becoming gamers: Moving beyond the constructed audience. Ada: A Journal of Gender, New Media, and Technology 2.",
      "doi": ""
    },
    {
      "text": "Nina Huntemann. 2013. Introduction: Feminist Discourses in Games/Game Studies. Ada: A Journal of Gender, New Media, and Technology 2.",
      "doi": ""
    },
    {
      "text": "Justine Cassell and Henry Jenkins. 1998. Chess for girls? Feminism and computer games. In From Barbie to Mortal Kombat: Gender and computer games, Justine Cassell and Henry Jenkins (ed.). MIT Press, Cambridge, MA, 2--45. ",
      "doi": "10.5555/295056.295058"
    },
    {
      "text": "Reijmersdal Eva A. Van, Jeroen Jansz, Oscar Peters and Noort Guda Van. 2013. Why girls go pink: Game character identification and game-players' motivations. Computers in Human Behavior 29, 6: 2640--2649.  ",
      "doi": "10.1016/j.chb.2013.06.046"
    },
    {
      "text": "Bendilin Spurr. 2012. Eulogy for 'Beat up Anita Sarkeesian.' Newgrounds. Retrieved April 9, 2018 from http://www.newgrounds.com/portal/view/598591",
      "doi": ""
    },
    {
      "text": "Kirk Hamilton. 2012. Competitive gamer's inflammatory comments spark sexual harassment debate. Kotaku. Retrieved April 9, 2018 from https://kotaku.com/5889066/competitivegamers-inflammatory-comments-spark-sexual-harassmentdebate",
      "doi": ""
    },
    {
      "text": "Mia Consalvo. 2012. Confronting toxic gamer culture: a challenge for feminist game studies scholars. Ada: A Journal of Gender, New Media & Technology 1. Leigh Alexander. 2012. In the sexism discussion, let's look at game culture. Gamasutra. Retrieved April 9, 2018 from http://gamasutra.com/view/news/174145/Opinion_In_the_sex ism_discussion_lets_look_at_game_culture.php.",
      "doi": ""
    },
    {
      "text": "Leigh Alexander. 2012. In the sexism discussion, let's look at game culture. Gamasutra. Retrieved April 9, 2018 from http://gamasutra.com/view/news/174145/Opinion_In_the_sex ism_discussion_lets_look_at_game_culture.php.",
      "doi": ""
    },
    {
      "text": "Katie Williams. 2012. I can be just as capable. Let me. Kotaku. Retrieved April 9, 2018 from http://www.kotaku.com.au/2012/06/513794/",
      "doi": ""
    },
    {
      "text": "Jennifer Jenson and Castell de. 2016. Gamer-hate and the \"problem\" of women. In Diversifying Barbie and Mortal Kombat: Intersectional Perspectives and Inclusive Designs in Gaming, Yasmin B. Kafai, Gabriela T. Richard, and Brendesha M. Tynes (ed.). ETC Press, Pittsburgh, PA, 186.",
      "doi": ""
    },
    {
      "text": "Nick Yee. 2006. The demographics, motivations, and derived experiences of users of massively multi-user online graphical environments. Presence: Teleoperators and Virtual Environments 15, 3: 309--329.  ",
      "doi": "10.1162/pres.15.3.309"
    },
    {
      "text": "Nick Yee. 2008. Maps of digital desires: Exploring the topography of gender and play in online games. In Beyond Barbie and Mortal Kombat: New perspectives on gender and gaming, Yasmin B. Kafai, Heeter Carrie, Denner Jill, and Y. Sun Jennifer (ed.). The MIT Press, 83--96.",
      "doi": ""
    },
    {
      "text": "Dmitri Williams, Nick Yee and Scott E. Caplan. 2008. Who plays, how much, and why? Debunking the stereotypical gamer profile. Journal of computer-mediated communication 13, 4: 993--1018.",
      "doi": ""
    },
    {
      "text": "Gabriela T. Richard. 2016. At the Intersections of Play. In Diversifying Barbie and Mortal Kombat: Intersectional Perspectives and Inclusive Designs in Gaming, Yasmin B. Kafai, Gabriela T. Richard, and Brendesha M. Tynes (ed.). ETC Press, Pittsburgh, PA, 71--91.",
      "doi": ""
    },
    {
      "text": "Jennifer Malkowski and Treaandrea M. Russworm. 2017. Gaming Representation: Race, gender and sexuality in video games. Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Lisa Nakamura. 2016. \"Putting Our Hearts Into It.\" In Diversifying Barbie and Mortal Kombat: Intersectional Perspectives and Inclusive Designs in Gaming, Yasmin B. Kafai, Gabriela T. Richard, and Brendesha M. Tynes (ed.). ETC Press, Pittsburgh, PA, 35--47.",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai, Gabriela T. Richard and Brendesha M. Tynes. 2016. Diversifying Barbie and Mortal Kombat: Intersectional perspectives and inclusive designs in gaming. ETC Press.",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai, Heeter Carrie, Denner Jill, and Y. Sun Jennifer. 2008. Beyond Barbie and Mortal Kombat: New perspectives on gender and gaming. The MIT Press. ",
      "doi": "10.5555/1468058"
    },
    {
      "text": "Katherine Castiello Jones, Joya Misra and K. McCurley. 2013. Intersectionality in sociology. Sociologists for Women.",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 2018. Demarginalizing the Intersection of Race and Sex: A Black feminist critique of antidiscrimination doctrine, feminist theory, and antiracist politics {1989}. In Feminist Legal Theory: Foundations, Kelly Weisberg D. (ed.). Temple University Press, Philadelphia, PA, 383--395.",
      "doi": ""
    },
    {
      "text": "Patricia Hill Collins. 1986. Learning from the outsider within: The sociological significance of Black feminist thought. Social problems 33, 6: s14-s32.",
      "doi": ""
    },
    {
      "text": "Sandra G. Harding. 2004. The feminist standpoint theory reader: Intellectual and political controversies. Psychology Press.",
      "doi": ""
    },
    {
      "text": "David Leonard. 2006. Not a hater, just keepin'it real: The importance of race-and gender-based game studies. Games and Culture 1, 1: 83--88.",
      "doi": ""
    },
    {
      "text": "David Leonard. 2009. Young, black (& brown) and don't give a fuck: Virtual gangstas in the era of state violence. Cultural Studies? Critical Methodologies 9, 2: 248--272.",
      "doi": ""
    },
    {
      "text": "Patricia Hill Collins and Sirma Bilge. 2016. Intersectionality. Polity Press.",
      "doi": ""
    },
    {
      "text": "Sheena Erete, Aarti Israni and Tawanna Dillahunt. 2018. An intersectional approach to designing in the margins. Interactions Vol 25 Issue 3 May-June 2018, 66--69.  ",
      "doi": "10.1145/3194349"
    },
    {
      "text": "Orit Shaer, Lauren Westendorf, Nicholas A. Knouf, and Claudia Pederson. 2017. Understanding gaming perceptions and experiences in a women's college community. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 1544--1577.  ",
      "doi": "10.1145/3025453.3025623"
    },
    {
      "text": "Soraya Murray. 2017. The Rubble and the Ruin: race, gender and sites of inglorious conflict in spec ops: the line. In Gaming Representation: Race, gender and sexuality in video games, Jennifer Malkowski and Treaandrea M. Russworm (ed.). Indiana University Press, Bloomington, IN, 147--163.",
      "doi": ""
    },
    {
      "text": "Treaandrea M. Russworm. 2017. Dystopian Blackness and the Limits of Racial Empathy in The Walking Dead and The Last of Us. In Gaming Representation: Race, gender and sexuality in video games, Jennifer Malkowski and Treaandrea M. Russworm (ed.). Indiana University Press, Bloomington, IN, 109--128.",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo, Sarita Yardi, Mark Guzdial, Tom McKlin, Charles Meadows, Kenneth Perry and Amy Bruckman. 2011. African American males constructing computing identity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2967--2970.  ",
      "doi": "10.1145/1978942.1979381"
    },
    {
      "text": "Cale J. Passmore, Max V. Birk, and Regan L. Mandryk. 2018. The privilege of immersion: Racial and ethnic experiences, perceptions, and beliefs in digital gaming. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18), 383.  ",
      "doi": "10.1145/3173574.3173957"
    },
    {
      "text": "Wayne Brekhus. 1998. A sociology of the unmarked: Redirecting our focus. Sociological Theory 16, 1: 34--51.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 1301--1310.  ",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, Jodi Forlizzi, John Zimmerman, and John Antanitis. 2012. Critical design and critical theory: the challenge of designing for provocation. In Proceedings of the Designing Interactive Systems Conference (DIS '12), 288297.  ",
      "doi": "10.1145/2317956.2318001"
    },
    {
      "text": "Ari W. Schlesinger, Keith Edwards and Rebecca E. Grinter. 2017. Intersectional HCI: engaging identity through gender, race, and class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17), 5412--5427.  ",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Anna Everett and Craig Watkins. 2008. The Power of Play: The portrayal and performance of race in video games. In The Ecology of Games: Connecting youth, games, and learning, Katie Salen (ed.). MIT Press, Cambridge, MA, 141--166.",
      "doi": ""
    },
    {
      "text": "André Brock. 2011. \"When Keeping it Real Goes Wrong'': Resident Evil 5, Racial Representation, and Gamers. Games and Culture 6, 5: 429--452.",
      "doi": ""
    },
    {
      "text": "Yolanda A. Rankin. 2016. Diversity by design: Designing inclusive language learning video games. In Conference Proceedings for ACM SIGCHI 2015 Case Studies (CHI '15).",
      "doi": ""
    },
    {
      "text": "Sinem Siyahhan and Elisabeth Gee. 2016. Understanding gaming and gender within the everyday lives of Mexican-American family homes. In Diversifying Barbie and Mortal Kombat: Intersectional perspectives and inclusive designs in gaming, Yasmin B. Kafai, Gabriela T. Richard, and Brendesha M. Tynes (ed). ETC Press, Pittsburgh, PA, 92--104.",
      "doi": ""
    },
    {
      "text": "Kishonna L. Gray. 2016. Solidarity is for white women in gaming. In Diversifying Barbie and Mortal Kombat: Intersectional perspectives and inclusive designs in gaming, Yasmin B. Kafai, Gabriela T. Richard, and Brendesha M. Tynes (ed). ETC Press, Pittsburgh, PA, 59--70.",
      "doi": ""
    },
    {
      "text": "Cale J. Passmore and Regan L. Mandryk. 2018. An about face: Diverse representation in games. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (CHI' 18), 365--380.  ",
      "doi": "10.1145/3242671.3242711"
    },
    {
      "text": "Leslie McCall. 2005. The complexity of intersectionality. Signs: Journal of Women in Culture and Society 30, 3: 1771--1800.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1977. Beyond boredom and anxiety: The experience of play in work and games. Jossey-Bass Publishers, San Francisco, CA.",
      "doi": ""
    },
    {
      "text": "Braxton Soderman. 2017. No Time to Dream: Killing time, casual games, and gender. In Gaming Representation: Race, gender and sexuality in video games, Jennifer Malkowski and Treaandrea M. Russworm (ed.). Indiana University Press, Bloomington, IN, 3853.",
      "doi": ""
    },
    {
      "text": "Shira Chess. 2017. Ready Player Two: women gamers and designed identity. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo, Kevin Crowley and Roy Norwood. 2008. Learning in context: Digital games and youngblackmen. Games and Culture 3, 2: 131--141.",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo. 2016. Gaming Masculinity. In Diversifying Barbie and Mortal Kombat: Intersectional Perspectives and Inclusive Designs in Gaming, Yasmin B. Kafai, Gabriela T. Richard, and Brendesha M. Tynes (ed.). ETC Press, Pittsburgh, PA, 105--117.",
      "doi": ""
    },
    {
      "text": "Jonathan McIntosh. 2014. Playing with privilege: The invisible benefits of gaming while male. Polygon. Retrieved April 12, 2018 from https://www.polygon.com/2014/4/23/5640678/playingwith-privilege-the-invisible-benefits-of-gaming-while-male",
      "doi": ""
    },
    {
      "text": "Games Newzoo. 2017. Global Games Market Report: An overview of trends and insights. Retrieved April 9, 2018 from https://newzoo.com/solutions/standard/marketforecasts/global-games-market-report/",
      "doi": ""
    },
    {
      "text": "Jussi Kuittinen, Annakaisa Kultima, Johannes Niemelä, and Janne Paavilainen. 2007. Casual games discussion. In Proceedings of the 2007 Conference on Future Play, 105--112.  ",
      "doi": "10.1145/1328202.1328221"
    }
  ]
}