{
  "doi": "10.1145/3290605.3300672",
  "title": "Ten-Minute Silence: A New Notification UX of Mobile Instant Messenger",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "People receive a tremendous number of messages through mobile instant messaging (MIM), which generates crowded notifications. This study highlights our attempt to create a new notification rule to reduce this crowdedness, which can be recognized by both senders and recipients. We developed an MIM app that provides only one notification per conversation session, which is a group of consecutive messages distinguished based on a ten-minute silence period. Through the two-week field study, 20,957 message logs and interview data from 17 participants revealed that MIM notifications affect not only the recipients' experiences before opening the app but also the entire conversation experience, including that of the senders. The new notification rule created new social norms for the participants' use of MIM. We report themes about the changes in the MIM experience, which will expand the role of notifications for future MIM apps.",
  "authors": [
    {
      "name": "In-geon Shin",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260709",
      "orcid": "missing"
    },
    {
      "name": "Jin-min Seok",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558483356",
      "orcid": "missing"
    },
    {
      "name": "Youn-kyung Lim",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, Republic of Korea",
      "img": "/do/10.1145/contrib-81100398105/rel-imgonly/ykl-e1265351534215-150x150.jpg",
      "acmid": "81100398105",
      "orcid": "0000-0003-3238-9404"
    }
  ],
  "references": [
    {
      "text": "Morgan G. Ames. 2013. Managing Mobile Multitasking: The Culture of iPhones on Stanford Campus. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 1487--1498.  ",
      "doi": "10.1145/2441776.2441945"
    },
    {
      "text": "Yung-Ju Chang, Yi-Ju Chung, Yi-Hao Shih, Hsiu-Chi Chang, and TzuHao Lin. 2017. What Do Smartphone Users Do when They Sense Phone Notifications?. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, New York, NY, USA, 904--909.  ",
      "doi": "10.1145/3123024.3124557"
    },
    {
      "text": "Yung-Ju Chang and John C. Tang. 2015. Investigating Mobile Users' Ringer Mode Usage and Attentiveness and Responsiveness to Communication. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, New York, NY, USA, 6--15.  ",
      "doi": "10.1145/2785830.2785852"
    },
    {
      "text": "Karen Church and Rodrigo de Oliveira. 2013. What's Up with Whatsapp?: Comparing Mobile Instant Messaging Behaviors with Traditional SMS. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, New York, NY, USA, 352--361.  ",
      "doi": "10.1145/2493190.2493225"
    },
    {
      "text": "Adrienne Porter Felt, Serge Egelman, and David Wagner. 2012. I've Got 99 Problems, but Vibration Ain't One: A Survey of Smartphone Users' Concerns. In Proceedings of the Second ACM Workshop on Security and Privacy in Smartphones and Mobile Devices (SPSM '12). ACM, New York, NY, USA, 33--44.  ",
      "doi": "10.1145/2381934.2381943"
    },
    {
      "text": "Joel E. Fischer, Chris Greenhalgh, and Steve Benford. 2011. Investigating Episodes of Mobile Phone Activity As Indicators of Opportune Moments to Deliver Notifications. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, New York, NY, USA, 181--190.  ",
      "doi": "10.1145/2037373.2037402"
    },
    {
      "text": "Jose A. Gallud and Ricardo Tesoriero. 2015. Smartphone Notifications: A Study on the Sound to Soundless Tendency. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '15). ACM, New York, NY, USA, 819--824.  ",
      "doi": "10.1145/2786567.2793706"
    },
    {
      "text": "Rebecca Grinter and Margery Eldridge. 2003. Wan2Tlk?: Everyday Text Messaging. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 441--448.  ",
      "doi": "10.1145/642611.642688"
    },
    {
      "text": "Rebecca E. Grinter, Leysia Palen, and Margery Eldridge. 2006. Chatting with Teenagers: Considering the Place of Chat Technologies in Teen Life. ACM Trans. Comput.-Hum. Interact. 13, 4 (Dec. 2006), 423--447.  ",
      "doi": "10.1145/1188816.1188817"
    },
    {
      "text": "Eric Horvitz, Johnson Apacible, and Muru Subramani. 2005. Balancing awareness and interruption: Investigation of notification deferral policies. In International Conference on User Modeling. Springer, 433--437.  ",
      "doi": "10.1007/11527886_59"
    },
    {
      "text": "Roberto Hoyle, Srijita Das, Apu Kapadia, Adam J. Lee, and Kami Vaniea. 2017. Was My Message Read?: Privacy and Signaling on Facebook Messenger. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 3838--3842.  ",
      "doi": "10.1145/3025453.3025925"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, New York, NY, USA, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2010. Oasis: A Framework for Linking Notification Delivery to the Perceptual Structure of Goaldirected Tasks. ACM Trans. Comput.-Hum. Interact. 17, 4, Article 15 (Dec. 2010), 28 pages.  ",
      "doi": "10.1145/1879831.1879833"
    },
    {
      "text": "Da-jung Kim and Youn-kyung Lim. 2015. Dwelling Places in KakaoTalk: Understanding the Roles and Meanings of Chatrooms in Mobile Instant Messengers. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15). ACM, New York, NY, USA, 775--784.  ",
      "doi": "10.1145/2675133.2675198"
    },
    {
      "text": "Kostadin Kushlev, Jason Proulx, and Elizabeth W. Dunn. 2016. \"Silence Your Phones\": Smartphone Notifications Increase Inattention and Hyperactivity Symptoms. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1011--1020.  ",
      "doi": "10.1145/2858036.2858359"
    },
    {
      "text": "Uichin Lee, Joonwon Lee, Minsam Ko, Changhun Lee, Yuhwan Kim, Subin Yang, Koji Yatani, Gahgene Gweon, Kyong-Mee Chung, and Junehwa Song. 2014. Hooked on Smartphones: An Exploratory Study on Smartphone Overuse Among College Students. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2327--2336.  ",
      "doi": "10.1145/2556288.2557366"
    },
    {
      "text": "Abhinav Mehrotra, Robert Hendley, and Mirco Musolesi. 2016. PrefMiner: Mining User's Preferences for Intelligent Mobile Notification Management. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '16). ACM, New York, NY, USA, 1223--1234.  ",
      "doi": "10.1145/2971648.2971747"
    },
    {
      "text": "Abhinav Mehrotra, Mirco Musolesi, Robert Hendley, and Veljko Pejovic. 2015. Designing Content-driven Intelligent Notification Mechanisms for Mobile Applications. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 813--824.  ",
      "doi": "10.1145/2750858.2807544"
    },
    {
      "text": "Abhinav Mehrotra, Veljko Pejovic, Jo Vermeulen, Robert Hendley, and Mirco Musolesi. 2016. My Phone and Me: Understanding People's Receptivity to Mobile Notifications. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1021--1032.  ",
      "doi": "10.1145/2858036.2858566"
    },
    {
      "text": "Donald A. Norman. 2008. THE WAY I SEE IT: Signifiers, Not Affordances. Interactions 15, 6 (Nov. 2008), 18--19.  ",
      "doi": "10.1145/1409040.1409044"
    },
    {
      "text": "Midas Nouwens, Carla F. Griggio, and Wendy E. Mackay. 2017. \"WhatsApp is for Family; Messenger is for Friends\": Communication Places in App Ecosystems. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 727--735.  ",
      "doi": "10.1145/3025453.3025484"
    },
    {
      "text": "Kenton P. O'Hara, Michael Massimi, Richard Harper, Simon Rubens, and Jessica Morris. 2014. Everyday Dwelling with WhatsApp. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14). ACM, New York, NY, USA, 1131--1143.  ",
      "doi": "10.1145/2531602.2531679"
    },
    {
      "text": "Tadashi Okoshi, Julian Ramos, Hiroki Nozaki, Jin Nakazawa, Anind K. Dey, and Hideyuki Tokuda. 2015. Reducing Users' Perceived Mental Effort Due to Interruptive Notifications in Multi-device Mobile Environments. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15). ACM, New York, NY, USA, 475--486.  ",
      "doi": "10.1145/2750858.2807517"
    },
    {
      "text": "Chunjong Park, Junsung Lim, Juho Kim, Sung-Ju Lee, and Dongman Lee. 2017. Don't Bother Me. I'm Socializing!: A BreakpointBased Smartphone Notification System. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17). ACM, New York, NY, USA, 541--554.  ",
      "doi": "10.1145/2998181.2998189"
    },
    {
      "text": "Martin Pielot, Karen Church, and Rodrigo de Oliveira. 2014. An Insitu Study of Mobile Phone Notifications. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, New York, NY, USA, 233--242.  ",
      "doi": "10.1145/2628363.2628364"
    },
    {
      "text": "Martin Pielot, Rodrigo de Oliveira, Haewoon Kwak, and Nuria Oliver. 2014. Didn't You See My Message?: Predicting Attentiveness to Mobile Instant Messages. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3319--3328.  ",
      "doi": "10.1145/2556288.2556973"
    },
    {
      "text": "Martin Pielot and Luz Rello. 2017. Productive, Anxious, Lonely: 24 Hours Without Push Notifications. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, Article 11, 11 pages.  ",
      "doi": "10.1145/3098279.3098526"
    },
    {
      "text": "Martin Podlubny, John Rooksby, Mattias Rost, and Matthew Chalmers. 2017. Synchronous Text Messaging: A Field Trial of Curtains Messenger. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 86 (Dec. 2017), 20 pages.  ",
      "doi": "10.1145/3134721"
    },
    {
      "text": "Mattias Rost, Christos Kitsos, Alexander Morgan, Martin Podlubny, Pietro Romeo, Edoardo Russo, and Matthew Chalmers. 2016. Forgetme-not: History-less Mobile Messaging. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 1904--1908.  ",
      "doi": "10.1145/2858036.2858347"
    },
    {
      "text": "Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber, and Albrecht Schmidt. 2014. Large-scale Assessment of Mobile Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3055--3064.  ",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "In-geon Shin, Jin-min Seok, and Youn-kyung Lim. 2018. Too Close and Crowded: Understanding Stress on Mobile Instant Messengers Based on Proxemics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 615, 12 pages.  ",
      "doi": "10.1145/3173574.3174189"
    },
    {
      "text": "Amy Voida, Wendy C. Newstetter, and Elizabeth D. Mynatt. 2002. When Conventions Collide: The Tensions of Instant Messaging Attributed. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '02). ACM, New York, NY, USA, 187--194.  ",
      "doi": "10.1145/503376.503410"
    },
    {
      "text": "Alexandra Voit, Benjamin Poppinga, Dominik Weber, Matthias Böhmer, Niels Henze, Sven Gehring, Tadashi Okoshi, and Veljko Pejovic. 2016. UbiTtention: Smart & Ambient Notification and Attention Management. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16). ACM, New York, NY, USA, 1520--1523.  ",
      "doi": "10.1145/2968219.2968542"
    },
    {
      "text": "Bin Xu, Pamara Chang, Christopher L. Welker, Natalya N. Bazarova, and Dan Cosley. 2016. Automatic Archiving Versus Default Deletion: What Snapchat Tells Us About Ephemerality in Design. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1662--1675.  ",
      "doi": "10.1145/2818048.2819948"
    },
    {
      "text": "Bin Xu, Yang Qin, and Dan Cosley. 2017. De-emphasizing Content to Study the Relationship Between Meaning, Messages, and Content in IM Systems. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS '17). ACM, New York, NY, USA, 599--610.  ",
      "doi": "10.1145/3064663.3064719"
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye Text, Hello Emoji: Mobile Communication on WeChat in China. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 748--759.  ",
      "doi": "10.1145/3025453.3025800"
    }
  ]
}