{
  "doi": "10.1145/3290605.3300245",
  "title": "BeamBand: Hand Gesture Sensing with Ultrasonic Beamforming",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2019,
  "badges": [],
  "abstract": "BeamBand is a wrist-worn system that uses ultrasonic beamforming for hand gesture sensing. Using an array of small transducers, arranged on the wrist, we can ensem-ble acoustic wavefronts to project acoustic energy at spec-ified angles and focal lengths. This allows us to interro-gate the surface geometry of the hand with inaudible sound in a raster-scan-like manner, from multiple view-points. We use the resulting, characteristic reflections to recognize hand pose at 8 FPS. In our user study, we found that BeamBand supports a six-class hand gesture set at 94.6% accuracy. Even across sessions, when the sensor is removed and reworn later, accuracy remains high: 89.4%. We describe our software and hardware, and future ave-nues for integration into devices such as smartwatches and VR controllers.",
  "tags": [
    "acoustic reflectrometry",
    "interaction techniques",
    "hand gesture",
    "wearables",
    "acoustic beamforming",
    "acoustic",
    "hand input"
  ],
  "authors": [
    {
      "name": "Yasha Iravantchi",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365852",
      "orcid": "0000-0001-5269-9579"
    },
    {
      "name": "Mayank Goel",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500642496",
      "orcid": "0000-0003-1237-7545"
    },
    {
      "name": "Chris Harrison",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "Brian Amento, Will Hill, and Loren Terveen. 2002. The sound of one hand: a wrist-mounted bio-acoustic fingertip gesture interface. In CHI '02 Extended Abstracts on Human Factors in Computing Systems (CHI EA '02). ACM, New York, NY, USA, 724--725.  ",
      "doi": "10.1145/506443.506566"
    },
    {
      "text": "Shoko Araki, Hiroshi Sawada, and Shoji Makino, 2007, April. Blind speech separation in a meeting situation with maximum SNR beamformers. In Acoustics, Speech and Signal Processing, 2007. ICASSP 2007. IEEE International Conference on (Vol. 1, pp. I-41). IEEE.",
      "doi": ""
    },
    {
      "text": "Adeola Bannis, Pei Zhang, and Shijia Pan. 2014. Adding directional context to gestures using doppler effect. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (UbiComp '14 Adjunct). ACM, New York, NY, USA, 5--8.  ",
      "doi": "10.1145/2638728.2638774"
    },
    {
      "text": "E. H. Brandt (2001). Acoustic physics: Suspended by Sound. Nature, 413(6855), 474--475.",
      "doi": ""
    },
    {
      "text": "Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: multi-point mid-air haptic feedback for touch surfaces. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 505--514.  ",
      "doi": "10.1145/2501988.2502018"
    },
    {
      "text": "Andrea Colaço, Ahmed Kirmani, Hye Soo Yang, Nan-Wei Gong, Chris Schmandt, and Vivek K. Goyal. 2013. Mime: compact, low power 3D gesture sensing for interaction with head mounted displays. In Proceedings of the 26th annual ACM symposium on User interface software and technology (UIST '13). ACM, New York, NY, USA, 227--236.  ",
      "doi": "10.1145/2501988.2502042"
    },
    {
      "text": "Artem Dementyev and Joseph A. Paradiso. 2014. WristFlex: low-power gesture input with wrist-worn pressure sensors. In Proceedings of the 27th annual ACM symposium on User interface software and technology (UIST '14). ACM, New York, NY, USA, 161--166.  ",
      "doi": "10.1145/2642918.2647396"
    },
    {
      "text": "Travis Deyle, Szabolcs Palinko, Erika Shehan Poole, and Thad Starner. 2007. Hambone: A Bio-Acoustic Gesture Interface. In Proceedings of the 2007 11th IEEE International Symposium on Wearable Computers (ISWC '07). IEEE Computer Society, Washington, DC, USA, 1--8.  ",
      "doi": "10.1109/ISWC.2007.4373768"
    },
    {
      "text": "EMCO SIP100 DC-DC Converter, http://www.eie-ic.com/Images/EMCO/EMCO/sipseries.pdf",
      "doi": ""
    },
    {
      "text": "Rui Fukui, Masahiko Watanabe, Tomoaki Gyota, Masamichi Shimosaka, and Tomomasa Sato. 2011. Hand shape classification with a wrist contour sensor: development of a prototype device. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11). ACM, New York, NY, USA, 311--314.  ",
      "doi": "10.1145/2030112.2030154"
    },
    {
      "text": "Reli Hershkovitz, Eyal Sheiner, and Moshe Mazor. \"Ultrasound in obstetrics: a review of safety.\" European Journal of Obstetrics & Gynecology and Reproductive Biology101, no. 1 (2002): 15--18.",
      "doi": ""
    },
    {
      "text": "Mohammad-Hossein Golbon-Haghighi, 2016. Beamforming in Wireless Networks. In Tech Open. http://cdn.intechopen.com/pdfs-wm/53332.pdf",
      "doi": ""
    },
    {
      "text": "Jun Gong, Xing-Dong Yang, and Pourang Irani. 2016. WristWhirl: One-handed Continuous Smartwatch Input using Wrist Gestures. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 861--872.  ",
      "doi": "10.1145/2984511.2984563"
    },
    {
      "text": "Teng Han, Khalad Hasan, Keisuke Nakamura, Randy Gomez, and Pourang Irani. 2017. SoundCraft: Enabling Spatial Interactions on Smartwatches using Hand Generated Acoustics. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 579--591.  ",
      "doi": "10.1145/3126594.3126612"
    },
    {
      "text": "Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). ACM, New York, NY, USA, 453--462.  ",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Chih-Pin Hsiao, Richard Li, Xinyan Yan, and Ellen Yi-Luen Do. 2015. Tactile Teacher: Sensing Finger Tapping in Piano Playing. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, New York, NY, USA, 257--260.  ",
      "doi": "10.1145/2677199.2680554"
    },
    {
      "text": "Takeshi Ide, James Friend, Kentaro Nakamura, and Sadayuki Ueha. A non-contact linear bearing and actuator via ultrasonic levitation. Sensors and Actuators A: Physical 135, no. 2 (2007): 740--747.",
      "doi": ""
    },
    {
      "text": "Pyeong-Gook Jung, Gukchan Lim, Seonghyok Kim, and Kyoungchul Kong. A wearable gesture recognition device for detecting muscular activities based on air-pressure sensors. IEEE Transactions on Industrial Informatics 11, no. 2 (2015): 485--494.",
      "doi": ""
    },
    {
      "text": "Frederic Kerber, Michael Puhl, and Antonio Krüger. 2017. User-independent real-time hand gesture recognition based on surface electromyography. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '17). ACM, New York, NY, USA, Article 36, 7 pages.  ",
      "doi": "10.1145/3098279.3098553"
    },
    {
      "text": "David Kim, Otmar Hilliges, Shahram Izadi, Alex D. Butler, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier. 2012. Digits: freehand 3D interactions anywhere using a wrist-worn gloveless sensor. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12). ACM, New York, NY, USA, 167--176.  ",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Hamid Krim and Mats Viberg, 1996. Two decades of array signal processing research: the parametric approach. IEEE signal processing magazine, 13(4), pp.67--94.",
      "doi": ""
    },
    {
      "text": "Carlo Kopp (December 2009). \"Identification underwater with towed array sonar\". Defense Today. pp. 32--33. http://www.ausairpower.net/SP/DT-TAS-Dec-2009.pdf",
      "doi": ""
    },
    {
      "text": "Gierad Laput, Robert Xiao, and Chris Harrison. 2016. ViBand: High-Fidelity Bio-Acoustic Sensing Using Commodity Smartwatch Accelerometers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 321--333.  ",
      "doi": "10.1145/2984511.2984582"
    },
    {
      "text": "Jhe-Wei Lin, Chiuan Wang, Yi Yao Huang, Kuan-Ting Chou, Hsuan-Yu Chen, Wei-Luan Tseng, and Mike Y. Chen. 2015. BackHand: Sensing Hand Gestures via Back of the Hand. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 557--564.  ",
      "doi": "10.1145/2807442.2807462"
    },
    {
      "text": "Shu-Yang Lin, Chao-Huai Su, Kai-Yin Cheng, Rong-Hao Liang, Tzu-Hao Kuo, and Bing-Yu Chen. 2011. Pub - point upon body: exploring eyes-free interaction and methods on an arm. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST '11). ACM, New York, NY, USA, 481--488.  ",
      "doi": "10.1145/2047196.2047259"
    },
    {
      "text": "Asier Marzo, Richard McGeehan, Jess McIntosh, Sue Ann Seah, and Sriram Subramanian. 2015. Ghost Touch: Turning Surfaces into Interactive Tangible Canvases with Focused Ultrasound. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS '15). ACM, New York, NY, USA, 137--140.  ",
      "doi": "10.1145/2817721.2817727"
    },
    {
      "text": "Jess McIntosh, Asier Marzo, Mike Fraser, and Carol Phillips. 2017. EchoFlex: Hand Gesture Recognition using Ultrasound Imaging. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 1923--1934.  ",
      "doi": "10.1145/3025453.3025807"
    },
    {
      "text": "Jess McIntosh and Mike Fraser. 2017. Improving the Feasibility of Ultrasonic Hand Tracking Wearables. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS '17). ACM, New York, NY, USA, 342--347.  ",
      "doi": "10.1145/3132272.3135075"
    },
    {
      "text": "Jess McIntosh, Asier Marzo, and Mike Fraser. 2017. SensIR: Detecting Hand Gestures with a Wearable Bracelet using Infrared Transmission and Reflection. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST '17). ACM, New York, NY, USA, 593--597.  ",
      "doi": "10.1145/3126594.3126604"
    },
    {
      "text": "Ulif Michel. 2006. History of acoustic beamforming. In Berlin Beamforming Conference, Berlin, Germany, Nov (pp. 21--22).",
      "doi": ""
    },
    {
      "text": "Adiyan Mujibiya, Xiang Cao, Desney S. Tan, Dan Morris, Shwetak N. Patel, and Jun Rekimoto. 2013. The sound of touch: on-body touch and gesture sensing based on transdermal ultrasound propagation. In Proceedings of the 2013 ACM international conference on Interactive tabletops and surfaces (ITS '13). ACM, New York, NY, USA, 189--198.  ",
      "doi": "10.1145/2512349.2512821"
    },
    {
      "text": "Masa Ogata and Michita Imai. 2015. SkinWatch: skin gesture interaction for smart watch. In Proceedings of the 6th Augmented Human International Conference (AH '15). ACM, New York, NY, USA, 21--24.  ",
      "doi": "10.1145/2735711.2735830"
    },
    {
      "text": "Fabian Pedregosa, Gaël Varoquaux, Alexandre Gramfort, Vincent Michel, Bertrand Thirion, Olivier Grisel, Mathieu Blondel et al. Scikit-learn: Machine learning in Python. Journal of machine learning research 12, no. Oct (2011): 2825--2830. ",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "John Kangchun Perng, Brian Fisher, Seth Hollar, and Kristofer SJ Pister. Acceleration sensing glove (ASG). In Wearable Computers, 1999. Digest of Papers. The Third International Symposium on, pp. 178--180. IEEE, 1999. ",
      "doi": "10.5555/519309.856474"
    },
    {
      "text": "PUI Audio 40 kHz Ultrasonic Transducer, http://www.puiaudio.com/pdf/UT-1240K-TT-R.pdf",
      "doi": ""
    },
    {
      "text": "Bhiksha Raj, Kaustubh Kalgaonkar, Chris Harrison, Paul Dietz, Ultrasonic Doppler Sensing in HCI, IEEE Pervasive Computing, v.11 n.2, p.24--29, April 2012.  ",
      "doi": "10.1109/MPRV.2012.17"
    },
    {
      "text": "Jun Rekimoto. Gesturewrist and gesturepad: Unobtrusive wearable interaction devices. In Wearable Computers, 2001. Proceedings. Fifth International Symposium on, pp. 21--27. IEEE, 2001. ",
      "doi": "10.5555/580581.856565"
    },
    {
      "text": "T. Scott Saponas, Desney S. Tan, Dan Morris, and Ravin Balakrishnan. 2008. Demonstrating the feasibility of using forearm electromyography for muscle-computer interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, New York, NY, USA, 515--524.  ",
      "doi": "10.1145/1357054.1357138"
    },
    {
      "text": "T. Scott Saponas, Desney S. Tan, Dan Morris, Ravin Balakrishnan, Jim Turner, and James A. Landay. 2009. Enabling always-available input with muscle-computer interfaces. In Proceedings of the 22nd annual ACM symposium on User interface software and technology (UIST '09). ACM, New York, NY, USA, 167--176.  ",
      "doi": "10.1145/1622176.1622208"
    },
    {
      "text": "Teensy 3.6 Microcontroller, PJRC, https://www.pjrc.com/store/teensy36.html",
      "doi": ""
    },
    {
      "text": "Thalmic Lab, Inc. http://www.thalmic.com/myo/",
      "doi": ""
    },
    {
      "text": "The Thickest Foam, HilltopStudio, https://www.amazon.com/HilltopStudio-The-Thickest-Foam/dp/B01N7XDSAN",
      "doi": ""
    },
    {
      "text": "Hsin-Ruey Tsai, Cheng-Yuan Wu, Lee-Ting Huang, and Yi-Ping Hung. 2016. ThumbRing: private interactions using one-handed thumb motion input on finger segments. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI '16). ACM, New York, NY, USA, 791--798.  ",
      "doi": "10.1145/2957265.2961859"
    },
    {
      "text": "R. J. Urick Principles of Underwater Sound, 3rd edition. (Peninsula Publishing, Los Altos, 1983).",
      "doi": ""
    },
    {
      "text": "Wei Wang, Lei Xie, and Xun Wang. 2017. Tremor detection using smartphone-based acoustic sensing. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp '17). ACM, New York, NY, USA, 309--312.  ",
      "doi": "10.1145/3123024.3123168"
    },
    {
      "text": "David Way and Joseph Paradiso. 2014. A Usability User Study Concerning Free-Hand Microgesture and Wrist-Worn Sensors. In Proceedings of the 2014 11th International Conference on Wearable and Implantable Body Sensor Networks (BSN '14). IEEE Computer Society, Washington, DC, USA, 138--142.  ",
      "doi": "10.1109/BSN.2014.32"
    },
    {
      "text": "Anusha Withana, Roshan Peiris, Nipuna Samarasekara, and Suranga Nanayakkara. 2015. zSense: Enabling Shallow Depth Gesture Recognition for Greater Input Expressivity on Smart Wearables. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 3661--3670.  ",
      "doi": "10.1145/2702123.2702371"
    },
    {
      "text": "Eric Whitmire, Mohit Jain, Divye Jain, Greg Nelson, Ravi Karkar, Shwetak Patel, and Mayank Goel. 2017. DigiTouch: Reconfigurable Thumb-to-Finger Input and Text Entry on Head-mounted Displays. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 113 (September 2017), 21 pages.  ",
      "doi": "10.1145/3130978"
    },
    {
      "text": "Chao Xu, Parth H. Pathak, and Prasant Mohapatra. 2015. Finger-writing with Smartwatch: A Case for Finger and Hand Gesture Recognition using Smartwatch. In Proceedings of the 16th International Workshop on Mobile Computing Systems and Applications (HotMobile '15). ACM, New York, NY, USA, 9--14.  ",
      "doi": "10.1145/2699343.2699350"
    },
    {
      "text": "Yang Zhang and Chris Harrison. 2015. Tomo: Wearable, Low-Cost Electrical Impedance Tomography for Hand Gesture Recognition. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST '15). ACM, New York, NY, USA, 167--173.  ",
      "doi": "10.1145/2807442.2807480"
    },
    {
      "text": "Yang Zhang, Robert Xiao, and Chris Harrison. 2016. Advancing Hand Gesture Recognition with High Resolution Electrical Impedance Tomography. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST '16). ACM, New York, NY, USA, 843--850.  ",
      "doi": "10.1145/2984511.2984574"
    },
    {
      "text": "Cheng Zhang, AbdelKareem Bedri, Gabriel Reyes, Bailey Bercik, Omer T. Inan, Thad E. Starner, and Gregory D. Abowd. 2016. TapSkin: Recognizing On-Skin Input for Smartwatches. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 13--22.  ",
      "doi": "10.1145/2992154.2992187"
    },
    {
      "text": "Cheng Zhang, Qiuyue Xue, Anandghan Waghmare, Ruichen Meng, Sumeet Jain, Yizeng Han, Xinyu Li, Kenneth Cunefare, Thomas Ploetz, Thad Starner, Omer Inan, and Gregory D. Abowd. 2018. FingerPing: Recognizing Fine-grained Hand Poses using Active Acoustic On-body Sensing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Paper 437, 10 pages.  ",
      "doi": "10.1145/3173574.3174011"
    }
  ]
}