{
  "doi": "10.1145/3290605.3300898",
  "title": "Email Makes You Sweat: Examining Email Interruptions and Stress Using Thermal Imaging",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "Workplace environments are characterized by frequent interruptions that can lead to stress. However, measures of stress due to interruptions are typically obtained through self-reports, which can be affected by memory and emotional biases. In this paper, we use a thermal imaging system to obtain objective measures of stress and investigate personality differences in contexts of high and low interruptions. Since a major source of workplace interruptions is email, we studied 63 participants while multitasking in a controlled office environment with two different email contexts: managing email in batch mode or with frequent interruptions. We discovered that people who score high in Neuroticism are significantly more stressed in batching environments than those low in Neuroticism. People who are more stressed finish emails faster. Last, using Linguistic Inquiry Word Count on the email text, we find that higher stressed people in multitasking environments use more anger in their emails. These findings help to disambiguate prior conflicting results on email batching and stress.",
  "tags": [
    "email",
    "sensors",
    "stress",
    "multitasking",
    "personality",
    "empirical study",
    "thermal imaging",
    "interruptions"
  ],
  "authors": [
    {
      "name": "Fatema Akbar",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659248401",
      "orcid": "missing"
    },
    {
      "name": "Ayse Elvan Bayraktaroglu",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365327",
      "orcid": "missing"
    },
    {
      "name": "Pradeep Buddharaju",
      "institution": "University of Houston, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81333487872",
      "orcid": "missing"
    },
    {
      "name": "Dennis Rodrigo Da Cunha Silva",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366720",
      "orcid": "missing"
    },
    {
      "name": "Ge Gao",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366737",
      "orcid": "missing"
    },
    {
      "name": "Ted Grover",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659200297",
      "orcid": "missing"
    },
    {
      "name": "Ricardo Gutierrez-Osuna",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100001355",
      "orcid": "missing"
    },
    {
      "name": "Nathan Cooper Jones",
      "institution": "University of Houston, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366150",
      "orcid": "missing"
    },
    {
      "name": "Gloria Mark",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100279599",
      "orcid": "missing"
    },
    {
      "name": "Ioannis Pavlidis",
      "institution": "University of Houston, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100120272",
      "orcid": "missing"
    },
    {
      "name": "Kevin Storer",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/do/10.1145/contrib-99659083189/rel-imgonly/scholar.jpg",
      "acmid": "99659083189",
      "orcid": "missing"
    },
    {
      "name": "Zelun Wang",
      "institution": "Texas A&M University, College Station, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659468053",
      "orcid": "missing"
    },
    {
      "name": "Amanveer Wesley",
      "institution": "University of Houston, Houston, TX, USA",
      "img": "/do/10.1145/contrib-99659365461/rel-imgonly/99659365461.jpg",
      "acmid": "99659365461",
      "orcid": "missing"
    },
    {
      "name": "Shaila Zaman",
      "institution": "University of Houston, Houston, TX, USA",
      "img": "/do/10.1145/contrib-99659366570/rel-imgonly/img_6145_low_res.jpg",
      "acmid": "99659366570",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fatema Akbar, Ayse Elvan Bayraktaroglu, Ge Gao, Ted Grover, Gloria Mark, Kevin Storer, Dennis Rodrigo Da Cunha Silva, Ricardo GutierrezOsuna, Zelun Wang, Pradeep Buddharaju, Nathan Cooper Jones, Ioannis Pavlidis, Amanveer Wesley, and Shaila Zaman. 2018. Email Makes You Sweat - CHI'19 : Dataset and Methods. https://osf.io/5surx/",
      "doi": ""
    },
    {
      "text": "David M Almeida. 2005. Resilience and vulnerability to daily stressors assessed via diary methods. Current Directions in Psychological Science 14, 2 (2005), 64--68.",
      "doi": ""
    },
    {
      "text": "Stephen R Barley, Debra E Meyerson, and Stine Grodal. 2011. E-mail as a source and symbol of stress. Organization Science 22, 4 (2011), 887--906.  ",
      "doi": "10.1287/orsc.1100.0573"
    },
    {
      "text": "Victoria Bellotti, Nicolas Ducheneaut, Mark Howard, Ian Smith, and Rebecca E Grinter. 2005. Quality versus quantity: E-mail-centric task management and its relation with overload. Human--Computer Interaction 20, 1--2 (2005), 89--138.  ",
      "doi": "10.1207/s15327051hci2001%25262_4"
    },
    {
      "text": "Adam Bradley, Duncan P Brumby, Anna L Cox, and Jon Bird. 2013. How to manage your inbox: is a once a day strategy best?. In Proceedings of the 27th International BCS Human Computer Interaction Conference. British Computer Society, 20. ",
      "doi": "10.5555/2578048.2578077"
    },
    {
      "text": "Pradeep Buddharaju, Ashik Khatri, and Ioannis Pavlidis. 2017. SInterface (Previously OTACS). (4 2017).",
      "doi": ""
    },
    {
      "text": "Yigal Attali Jill Burstein and Y Attali. 2006. Automated Essay Scoring With E-rater V. 2.0. The Journal of Technology, Learning, and Assessment 4, 3 (2006), 31.",
      "doi": ""
    },
    {
      "text": "Future Work Centre. 2015. \"You've got mail!\". http: //www.futureworkcentre.com/wp-content/uploads/2015/07/ FWC-Youve-got-mail-research-report.pdf",
      "doi": ""
    },
    {
      "text": "Daniel Chen and Roel Vertegaal. 2004. Using mental load for managing interruptions in physiologically attentive user interfaces. In CHI'04 extended abstracts on Human factors in computing systems. ACM, 1513-- 1516.  ",
      "doi": "10.1145/985921.986103"
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Laura A Dabbish and Robert E Kraut. 2006. Email overload at work: an analysis of factors associated with email strain. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. ACM, 431--440.  ",
      "doi": "10.1145/1180875.1180941"
    },
    {
      "text": "Jeanette Frost Ebstrup, Lene Falgaard Eplov, Charlotta Pisinger, and Torben Jørgensen. 2011. Association between the Five Factor personality traits and perceived stress: is the effect mediated by general self-efficacy? Anxiety, Stress & Coping 24, 4 (2011), 407--419.",
      "doi": ""
    },
    {
      "text": "Hélène Eyrolle and Jean-Marie Cellier. 2000. The effects of interruptions in work activity: Field and laboratory results. Applied ergonomics 31, 5 (2000), 537--543.",
      "doi": ""
    },
    {
      "text": "Pamela S Galluch, Varun Grover, and Jason Bennett Thatcher. 2015. Interrupting the workplace: Examining stressors in an information technology context. Journal of the Association for Information Systems 16, 1 (2015), 1.",
      "doi": ""
    },
    {
      "text": "Gloria Garcia-Banda, Mateu Servera, Karin Chellew, Victoria Meisel, Joana Fornes, Esther Cardo, Gerardo Perez, Maria Riesco, and Ronald M Doctor. 2011. Prosocial personality traits and adaptation to stress. Social Behavior and Personality: an international journal 39, 10 (2011), 1337--1348.",
      "doi": ""
    },
    {
      "text": "Nicole A Gillespie, MHWA Walsh, Anthony Harold Winefield, Jagdish Dua, and Con Stough. 2001. Occupational stress in universities: Staff perceptions of the causes, consequences and moderators of stress. Work & stress 15, 1 (2001), 53--72.",
      "doi": ""
    },
    {
      "text": "Radicati group. 2015. Email Statistics Report. https: //www.radicati.com/wp/wp-content/uploads/2015/02/ Email-Statistics-Report-2015--2019-Executive-Summary.pdf.",
      "doi": ""
    },
    {
      "text": "Ashish Gupta, Ramesh Sharda, and Robert A Greve. 2011. You've got email! Does it really matter to process emails now or later? Information Systems Frontiers 13, 5 (2011), 637--653.",
      "doi": ""
    },
    {
      "text": "Mario Hair, Karen V Renaud, and Judith Ramsay. 2007. The influence of self-esteem and locus of control on perceived email-related stress. Examining Email Interruptions and Stress with Thermal Imaging CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Computers in Human Behavior 23, 6 (2007), 2791--2803.  ",
      "doi": "10.1016/j.chb.2006.05.005"
    },
    {
      "text": "Peter A Hancock. 1989. A dynamic model of stress and sustained attention. Human factors 31, 5 (1989), 519--537.  ",
      "doi": "10.1177/001872088903100503"
    },
    {
      "text": "Jacob B Hirsh and Jordan B Peterson. 2009. Personality and language use in self-narratives. Journal of research in personality 43, 3 (2009), 524--527.",
      "doi": ""
    },
    {
      "text": "Thomas Holtgraves. 2011. Text messaging, personality, and the social context. Journal of research in personality 45, 1 (2011), 92--99.",
      "doi": ""
    },
    {
      "text": "James M Hudson, Jim Christensen, Wendy A Kellogg, and Thomas Erickson. 2002. I'd be overwhelmed, but it's just one more thing to do: Availability and interruption in research management. In Proceedings of the SIGCHI Conference on Human factors in computing systems. ACM, 97--104.  ",
      "doi": "10.1145/503376.503394"
    },
    {
      "text": "Thomas Jackson, Ray Dawson, and Darren Wilson. 2001. The cost of email interruption. Journal of Systems and Information Technology 5, 1 (2001), 81--92.",
      "doi": ""
    },
    {
      "text": "Thomas W Jackson, Ray Dawson, and Darren Wilson. 2003. Understanding email interaction increases organizational productivity. Commun. ACM 46, 8 (2003), 80--84.  ",
      "doi": "10.1145/859670.859673"
    },
    {
      "text": "Clemens Kirschbaum, Karl-Martin Pirke, and Dirk H Hellhammer. 1993. The 'Trier Social Stress Test'--a tool for investigating psychobiological stress responses in a laboratory setting. Neuropsychobiology 28, 1--2 (1993), 76--81.",
      "doi": ""
    },
    {
      "text": "Mika Kivimäki, Marianna Virtanen, Marko Elovainio, Anne Kouvonen, Ari Väänänen, and Jussi Vahtera. 2006. Work stress in the etiology of coronary heart disease--a meta-analysis. Scandinavian journal of work, environment & health (2006), 431--442.",
      "doi": ""
    },
    {
      "text": "Kostadin Kushlev and Elizabeth W Dunn. 2015. Checking email less frequently reduces stress. Computers in Human Behavior 43 (2015), 220--228.  ",
      "doi": "10.1016/j.chb.2014.11.005"
    },
    {
      "text": "Sophie Leroy. 2009. Why is it so hard to do my work? The challenge of attention residue when switching between work tasks. Organizational Behavior and Human Decision Processes 109, 2 (2009), 168--181.",
      "doi": ""
    },
    {
      "text": "James A Levine, Ioannis T Pavlidis, Leslie MacBride, Zhen Zhu, and Panagiotis Tsiamyrtzis. 2009. Description and clinical studies of a device for the instantaneous detection of office-place stress. Work 34, 3 (2009), 359--364.",
      "doi": ""
    },
    {
      "text": "Rita S Mano and Gustavo S Mesch. 2010. E-mail characteristics, work performance and distress. Computers in Human Behavior 26, 1 (2010), 61--69.  ",
      "doi": "10.1016/j.chb.2009.08.005"
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. 2008. The cost of interrupted work: more speed and stress. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. ACM, 107--110.  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, Paul Johns, Akane Sano, and Yuliya Lutchyn. 2016. Email duration, batching and selfinterruption: Patterns of email use on productivity and stress. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1717--1728.  ",
      "doi": "10.1145/2858036.2858262"
    },
    {
      "text": "Gloria Mark, Stephen Voida, and Armand Cardello. 2012. A pace not dictated by electrons: an empirical study of work without email. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 555--564.  ",
      "doi": "10.1145/2207676.2207754"
    },
    {
      "text": "Robert R McCrae and Paul T Costa Jr. 1999. A five-factor theory of personality. Handbook of personality: Theory and research 2, 1999 (1999), 139--153.",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Sarah Gontarek, and Rosalind Picard. 2014. Remote measurement of cognitive stress via heart rate variability. In Engineering in Medicine and Biology Society (EMBC), 2014 36th Annual International Conference of the IEEE. IEEE, 2957--2960.",
      "doi": ""
    },
    {
      "text": "Daniel C McFarlane and Kara A Latorella. 2002. The scope and importance of human interruption in human-computer interaction design. Human-Computer Interaction 17, 1 (2002), 1--61.  ",
      "doi": "10.1207/S15327051HCI1701_1"
    },
    {
      "text": "Brid O'Conaill and David Frohlich. 1995. Timespace in the workplace: Dealing with interruptions. In Conference companion on Human factors in computing systems. ACM, 262--263.  ",
      "doi": "10.1145/223355.223665"
    },
    {
      "text": "Peter O'Connor, Jessica Nguyen, and Jeromy Anglim. 2017. Effectively Coping with Task Stress: A Study of the Validity of the Trait Emotional Intelligence Questionnaire--Short Form (TEIQue--SF). Journal of personality assessment 99, 3 (2017), 304--314.",
      "doi": ""
    },
    {
      "text": "Jussi Okkonen, Tomi Heimonen, Reijo Savolainen, and Markku Turunen. 2017. Assessing Information Ergonomics in Work by Logging and Heart Rate Variability. In International Conference on Applied Human Factors and Ergonomics. Springer, 425--436.",
      "doi": ""
    },
    {
      "text": "Lynn M Oswald, Peter Zandi, Gerald Nestadt, James B Potash, Amanda E Kalaydjian, and Gary S Wand. 2006. Relationship between cortisol responses to stress and personality. Neuropsychopharmacology 31, 7 (2006), 1583.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta and Pertti Saariluoma. 2004. Long-term working memory and interrupting messages in human-computer interaction. Behaviour & Information Technology 23, 1 (2004), 53--64.  ",
      "doi": "10.1080/01449290310001644859"
    },
    {
      "text": "I Pavlidis, M Dcosta, S Taamneh, M Manser, T Ferris, R Wunderlich, E Akleman, and P Tsiamyrtzis. 2016. Dissecting driver behaviors under cognitive, emotional, sensorimotor, and mixed stressors. Scientific reports 6 (2016), 25651.",
      "doi": ""
    },
    {
      "text": "Ioannis Pavlidis, Panagiotis Tsiamyrtzis, Dvijesh Shastri, Avinash Wesley, Yan Zhou, Peggy Lindner, Pradeep Buddharaju, Rohan Joseph, Anitha Mandapati, Brian Dunkin, and others. 2012. Fast by naturehow stress patterns define human experience and performance in dexterous tasks. Scientific Reports 2 (2012), 305.",
      "doi": ""
    },
    {
      "text": "James W Pennebaker. 1993. Putting stress into words: Health, linguistic, and therapeutic implications. Behaviour research and therapy 31, 6 (1993), 539--548.",
      "doi": ""
    },
    {
      "text": "James W Pennebaker, Ryan L Boyd, Kayla Jordan, and Kate Blackburn. 2015. The development and psychometric properties of LIWC2015. Technical Report.",
      "doi": ""
    },
    {
      "text": "Giorgia Ponsi, Maria Serena Panasiti, Giulia Rizza, and Salvatore Maria Aglioti. 2017. Thermal facial reactivity patterns predict social categorization bias triggered by unconscious and conscious emotional stimuli. Proc. R. Soc. B 284, 1861 (2017), 20170908.",
      "doi": ""
    },
    {
      "text": "Colin Puri, Leslie Olson, Ioannis Pavlidis, James Levine, and Justin Starren. 2005. StressCam: non-contact measurement of users' emotional states through thermal imaging. In CHI'05 extended abstracts on Human factors in computing systems. ACM, 1725--1728.  ",
      "doi": "10.1145/1056808.1057007"
    },
    {
      "text": "Karen Renaud, Judith Ramsay, and Mario Hair. 2006. \" You've got e-mail!\"... shall I deal with it now? Electronic mail from the recipient's perspective. International Journal of Human-Computer Interaction 21, 3 (2006), 313--332.",
      "doi": ""
    },
    {
      "text": "Lawrence M Rudner and Tahung Liang. 2002. Automated essay scoring using Bayes' theorem. The Journal of Technology, Learning and Assessment 1, 2 (2002).",
      "doi": ""
    },
    {
      "text": "Emma Russell, Stephen A Woods, and Adrian P Banks. 2017. Examining conscientiousness as a key resource in resisting email interruptions: Implications for volatile resources and goal achievement. Journal of occupational and organizational psychology 90, 3 (2017), 407--435.",
      "doi": ""
    },
    {
      "text": "Tamera R Schneider, Tara A Rench, Joseph B Lyons, and Rebecca R Riffle. 2012. The influence of neuroticism, extraversion and openness on stress responses. Stress and Health 28, 2 (2012), 102--110.",
      "doi": ""
    },
    {
      "text": "Dvijesh Shastri, Arcangelo Merla, Panagiotis Tsiamyrtzis, and Ioannis Pavlidis. 2009. Imaging facial signs of neurophysiological responses. IEEE Transactions on Biomedical Engineering 56, 2 (2009), 477--484.",
      "doi": ""
    },
    {
      "text": "Dvijesh Shastri, Manos Papadakis, Panagiotis Tsiamyrtzis, Barbara Bass, Ioannis T Pavlidis, and others. 2012. Perinasal imaging of physiological stress and its affective potential. IEEE Trans. Affective Computing 3, 3 (2012), 366--378. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Akbar et al.  ",
      "doi": "10.1109/T-AFFC.2012.13"
    },
    {
      "text": "Sabine Sonnentag, Leonard Reinecke, Jutta Mata, and Peter Vorderer. 2018. Feeling interrupted-Being responsive: How online messages relate to affect at work. Journal of Organizational Behavior 39, 3 (2018), 369--383.",
      "doi": ""
    },
    {
      "text": "Jean-Francois Stich, Monideepa Tarafdar, Patrick Stacey, and Cary L Cooper. 2018. E-mail load, workload stress and desired e-mail load: a cybernetic approach. Information Technology & People (2018).",
      "doi": ""
    },
    {
      "text": "Feng-Tso Sun, Cynthia Kuo, Heng-Tze Cheng, Senaka Buthpitiya, Patricia Collins, and Martin Griss. 2010. Activity-aware mental stress detection using physiological sensors. In International Conference on Mobile Computing, Applications, and Services. Springer, 282--301.",
      "doi": ""
    },
    {
      "text": "Salah Taamneh, Panagiotis Tsiamyrtzis, Malcolm Dcosta, Pradeep Buddharaju, Ashik Khatri, Michael Manser, Thomas Ferris, Robert Wunderlich, and Ioannis Pavlidis. 2017. A multimodal dataset for various forms of distracted driving. Scientific data 4 (2017), 170110.",
      "doi": ""
    },
    {
      "text": "J Gregory Trafton and Christopher A Monk. 2007. Task interruptions. Reviews of human factors and ergonomics 3, 1 (2007), 111--126.",
      "doi": ""
    },
    {
      "text": "Panagiotis Tsiamyrtzis, Malcolm Dcosta, Dvijesh Shastri, Eswar Prasad, and Ioannis Pavlidis. 2016. Delineating the operational envelope of mobile and conventional EDA sensing on key body locations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 5665--5674.  ",
      "doi": "10.1145/2858036.2858536"
    },
    {
      "text": "Avinash Wesley, Peggy Lindner, and Ioannis Pavlidis. 2012. Eustressed or distressed?: combining physiology with observation in user studies. In CHI'12 Extended Abstracts on Human Factors in Computing Systems. ACM, 327--330.  ",
      "doi": "10.1145/2212776.2212811"
    },
    {
      "text": "Steve Whittaker, Victoria Bellotti, and Jacek Gwizdka. 2006. Email in personal information management. Commun. ACM 49, 1 (2006), 68--73.  ",
      "doi": "10.1145/1107458.1107494"
    },
    {
      "text": "Christopher D Wickens. 2008. Multiple resources and mental workload. Human factors 50, 3 (2008), 449--455.",
      "doi": ""
    },
    {
      "text": "Glenn Wylie and Alan Allport. 2000. Task switching and the measurement of \"switch costs\". Psychological research 63, 3--4 (2000), 212--233.",
      "doi": ""
    },
    {
      "text": "Yan Zhou, Panagiotis Tsiamyrtzis, Peggy Lindner, Ilya Timofeyev, and Ioannis Pavlidis. 2013. Spatiotemporal smoothing as a basis for facial tissue tracking in thermal imaging. IEEE Transactions on Biomedical Engineering 60, 5 (2013), 1280--1289.",
      "doi": ""
    },
    {
      "text": "Manuela Züger, Sebastian C Müller, André N Meyer, and Thomas Fritz. 2018. Sensing Interruptibility in the Office: A Field Study on the Use of Biometric and Computer Interaction Sensors. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 591.  ",
      "doi": "10.1145/3173574.3174165"
    }
  ]
}