{
  "doi": "10.1145/3290605.3300748",
  "title": "Put Your Warning Where Your Link Is: Improving and Evaluating Email Phishing Warnings",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Phishing emails often disguise a link's actual URL. Thus, common anti-phishing advice is to check a link's URL before clicking, but email clients do not support this well. Automated phishing detection enables email clients to warn users that an email is suspicious, but current warnings are often not specific. We evaluated the effects on phishing susceptibility of (1) moving phishing warnings close to the suspicious link in the email, (2) displaying the warning on hover interactions with the link, and (3) forcing attention to the warning by deactivating the original link, forcing users to click the URL in the warning. We assessed the effectiveness of such link-focused phishing warning designs in a between-subjects online experiment (n=701). We found that link-focused phishing warnings reduced phishing click-through rates compared to email banner warnings; forced attention warnings were most effective. We discuss the implications of our findings for phishing warning design.",
  "tags": [
    "warning design",
    "privacy",
    "usability",
    "security",
    "phishing"
  ],
  "authors": [
    {
      "name": "Justin Petelka",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366341",
      "orcid": "0000-0003-2423-2079"
    },
    {
      "name": "Yixin Zou",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260611",
      "orcid": "missing"
    },
    {
      "name": "Florian Schaub",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548024188",
      "orcid": "0000-0003-1039-7155"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, et al. 2017. Nudges for privacy and security: understanding and assisting users' choices online. ACM Computing Surveys (CSUR) 50, 3 (2017), 44.  ",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Devdatta Akhawe and Adrienne Porter Felt. 2013. Alice in Warningland: A Large-Scale Field Study of Browser Security Warning Effectiveness.. In USENIX security symposium, Vol. 13. ",
      "doi": "10.5555/2534766.2534789"
    },
    {
      "text": "Hazim Almuhimedi, Florian Schaub, Norman Sadeh, Idris Adjerid, Alessandro Acquisti, Joshua Gluck, Lorrie Faith Cranor, and Yuvraj Agarwal. 2015. Your location has been shared 5,398 times!: A field study on mobile app privacy nudging. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, 787--796.  ",
      "doi": "10.1145/2702123.2702210"
    },
    {
      "text": "Bonnie Brinton Anderson, C Brock Kirwan, Jeffrey L Jenkins, David Eargle, Seth Howard, and Anthony Vance. 2015. How polymorphic warnings reduce habituation in the brain: Insights from an fMRI study. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2883--2892.  ",
      "doi": "10.1145/2702123.2702322"
    },
    {
      "text": "Anti Phishing Working Group (APWG). 2016. Global Phishing Report 2015--2016. http://docs.apwg.org/reports/APWG_Global_Phishing_ Report_2015--2016.pdf",
      "doi": ""
    },
    {
      "text": "Anti Phishing Working Group (APWG). 2018. Phishing Activity Trends Report Q1 2018. Technical Report.",
      "doi": ""
    },
    {
      "text": "Lujo Bauer, Cristian Bravo-Lillo, Lorrie Cranor, and Elli Fragkaki. 2013. Carnegie Mellon University Warning Design Guidelines. Technical Report Carnegie Mellon University-CyLab-13002. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "André Bergholz, Jan De Beer, Sebastian Glahn, Marie-Francine Moens, Gerhard Paaß, and Siehyun Strobel. 2010. New filtering approaches for phishing email. Journal of computer security 18, 1 (2010), 7--35. ",
      "doi": "10.5555/1734234.1734239"
    },
    {
      "text": "Cristian Bravo-Lillo. 2014. Improving Computer Security Dialogs: An Exploration of Attention and Habituation.",
      "doi": ""
    },
    {
      "text": "Cristian Bravo-Lillo, Lorrie Cranor, Saranga Komanduri, Stuart Schechter, and Manya Sleeper. 2014. Harder to Ignore? Revisiting Pop-Up Fatigue and Approaches to Prevent It. In 10th Symposium On Usable Privacy and Security (SOUPS 2014). USENIX Association, Menlo Park, CA, 105--111. https://www.usenix.org/conference/soups2014/ proceedings/presentation/bravo-lillo ",
      "doi": "10.5555/3235838.3235847"
    },
    {
      "text": "Cristian Bravo-Lillo, Lorrie Faith Cranor, Julie Downs, and Saranga Komanduri. 2011. Bridging the Gap in Computer Security Warnings: A Mental Model Approach. IEEE Security & Privacy 9, 2 (2011), 18--26.  ",
      "doi": "10.1109/MSP.2010.198"
    },
    {
      "text": "Cristian Bravo-Lillo, Saranga Komanduri, Lorrie Faith Cranor, Robert W Reeder, Manya Sleeper, Julie Downs, and Stuart Schechter. 2013. Your attention please: designing security-decision UIs to make genuine risks harder to ignore. In Proceedings of the Ninth Symposium on Usable Privacy and Security. ACM, 6.  ",
      "doi": "10.1145/2501604.2501610"
    },
    {
      "text": "José Carlos Brustoloni and Ricardo Villamarín-Salomón. 2007. Improving security decisions with polymorphic and audited dialogs. In Proceedings of the 3rd symposium on Usable privacy and security. ACM, 76--85.  ",
      "doi": "10.1145/1280680.1280691"
    },
    {
      "text": "Madhusudhanan Chandrasekaran, Krishnan Narayanan, and Shambhu Upadhyaya. 2006. Phishing E-Mail Detection Based on Structural Properties. (2006), 7.",
      "doi": ""
    },
    {
      "text": "Lorrie Faith Cranor. 2012. Necessary but not sufficient: Standardized mechanisms for privacy notice and choice. J. on Telecomm. & High Tech. L. 10 (2012), 273.",
      "doi": ""
    },
    {
      "text": "Rachna Dhamija, J Doug Tygar, and Marti Hearst. 2006. Why phishing works. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 581--590.  ",
      "doi": "10.1145/1124772.1124861"
    },
    {
      "text": "Julie S Downs, Mandy Holbrook, and Lorrie Faith Cranor. 2007. Behavioral response to phishing risk. In Proceedings of the anti-phishing working groups 2nd annual eCrime researchers summit. ACM, 37--44.  ",
      "doi": "10.1145/1299015.1299019"
    },
    {
      "text": "Serge Egelman, Lorrie Faith Cranor, and Jason Hong. 2008. You've been warned: an empirical study of the effectiveness of web browser phishing warnings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1065--1074.  ",
      "doi": "10.1145/1357054.1357219"
    },
    {
      "text": "Adrienne Porter Felt, Alex Ainslie, Robert W Reeder, Sunny Consolvo, Somas Thyagaraja, Alan Bettes, Helen Harris, and Jeff Grimes. 2015. Improving SSL warnings: Comprehension and adherence. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2893--2902.  ",
      "doi": "10.1145/2702123.2702442"
    },
    {
      "text": "Adrienne Porter Felt, Robert W Reeder, Hazim Almuhimedi, and Sunny Consolvo. 2014. Experimenting at scale with google chrome's SSL warning. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 2667--2670.  ",
      "doi": "10.1145/2556288.2557292"
    },
    {
      "text": "Ian Fette, Norman Sadeh, and Anthony Tomasic. 2007. Learning to detect phishing emails. In Proceedings of the 16th international conference on World Wide Web. ACM, 649--656.  ",
      "doi": "10.1145/1242572.1242660"
    },
    {
      "text": "Kristin Firth, David A. Hoffman, and Tess Wilkinson-Ryan. 2017. Law and Psychology Grows Up, Goes Online, and Replicates. (2017).",
      "doi": ""
    },
    {
      "text": "Gmail Help Forum. 2018. Suspicious link issue! - Google Product Forums. https://productforums.google.com/forum/#!msg/gmail/h_ yeYefHFWk/Fj8o4q3HAQAJ",
      "doi": ""
    },
    {
      "text": "Simson Garfinkel and Heather Richter Lipford. 2014. Usable security: History, themes, and challenges. Synthesis Lectures on Information Security, Privacy, and Trust 5, 2 (2014), 1--124. ",
      "doi": "10.5555/2755205"
    },
    {
      "text": "Anti Phishing Working Group. 2017. Global Phishing Survey: Trends and Domain Name Use in 2016. https://docs.apwg.org/reports/APWG_ Global_Phishing_Report_2015--2016.pdf",
      "doi": ""
    },
    {
      "text": "Marian Harbach, Markus Hettig, Susanne Weber, and Matthew Smith. 2014. Using Personal Examples to Improve Risk Communication for Security & Privacy Decisions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 2647--2656.  ",
      "doi": "10.1145/2556288.2556978"
    },
    {
      "text": "Jason Hong. 2012. The state of phishing attacks. Commun. ACM 55, 1 (2012), 74--81.  ",
      "doi": "10.1145/2063176.2063197"
    },
    {
      "text": "The Radicati Group Inc. 2017. Email Statistics Report, 20172021. http://www.radicati.com/wp/wp-content/uploads/2017/01/ Email-Statistics-Report-2017--2021-Executive-Summary.pdf",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Joanna Bresee, Lorrie Faith Cranor, and Robert W Reeder. 2009. A nutrition label for privacy. In Proceedings of the 5th Symposium on Usable Privacy and Security. ACM, 4.  ",
      "doi": "10.1145/1572532.1572538"
    },
    {
      "text": "Soyun Kim and Michael S Wogalter. 2009. Habituation, dishabituation, and recovery effects in visual warnings. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 53. Sage Publications Sage CA: Los Angeles, CA, 1612--1616.",
      "doi": ""
    },
    {
      "text": "Ponnurangam Kumaraguru, Justin Cranshaw, Alessandro Acquisti, Lorrie Cranor, Jason Hong, Mary Ann Blair, and Theodore Pham. 2009. School of phish: a real-world evaluation of anti-phishing training. In Proceedings of the 5th Symposium on Usable Privacy and Security. ACM, 3.  ",
      "doi": "10.1145/1572532.1572536"
    },
    {
      "text": "Ponnurangam Kumaraguru, Steve Sheng, Alessandro Acquisti, Lorrie Faith Cranor, and Jason Hong. 2010. Teaching Johnny not to fall for phish. ACM Transactions on Internet Technology (TOIT) 10, 2 (2010), 7.  ",
      "doi": "10.1145/1754393.1754396"
    },
    {
      "text": "Phish Labs. 2017. 2017 Phishing and Threat Intelligence Report. https: //pages.phishlabs.com/rs/130-BFB-942/images/2017%20PhishLabs% 20Phishing%20and%20Threat%20Intelligence%20Report.pdf",
      "doi": ""
    },
    {
      "text": "Elmer Lastdrager, Inés Carvajal Gallardo, Pieter Hartel, and Marianne Junger. 2017. How Effective is Anti-Phishing Training for Children?. In Symposium on Usable Privacy and Security (SOUPS). ",
      "doi": "10.5555/3235924.3235943"
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann. ",
      "doi": "10.5555/1841406"
    },
    {
      "text": "Eric Lin, Saul Greenberg, Eileah Trotter, David Ma, and John Aycock. 2011. Does domain highlighting help people identify phishing sites?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2075--2084.  ",
      "doi": "10.1145/1978942.1979244"
    },
    {
      "text": "Gang Liu, Guang Xiang, Bryan A Pendleton, Jason I Hong, and Wenyin Liu. 2011. Smartening the crowds: computational techniques for improving human verification to fight phishing scams. In Proceedings of the Seventh Symposium on Usable Privacy and Security. ACM, 8.  ",
      "doi": "10.1145/2078827.2078838"
    },
    {
      "text": "Samuel Marchal, Giovanni Armano, Tommi Grondahl, Kalle Saari, Nidhi Singh, and N Asokan. 2017. Off-the-Hook: An Efficient and Usable Client-Side Phishing Prevention Application. IEEE Trans. Comput. (2017).",
      "doi": ""
    },
    {
      "text": "Samuel Marchal, Kalle Saari, Nidhi Singh, and N. Asokan. 2015. Know Your Phish: Novel Techniques for Detecting Phishing Sites and their Targets. CoRR abs/1510.06501 (2015). arXiv:1510.06501 http://arxiv. org.offcampus.lib.washington.edu/abs/1510.06501",
      "doi": ""
    },
    {
      "text": "Federal Bureau of Investigation Internet Crime Complaint Center. 2017. 2017 Internet Crime Report. (2017), 29.",
      "doi": ""
    },
    {
      "text": "Kenneth Olmstead and Aaron Smith. 2017. Pew Research Center. http://www.pewinternet.org/2017/03/22/ what-the-public-knows-about-cybersecurity/",
      "doi": ""
    },
    {
      "text": "Kenneth Olmstead and Aaron Smith. 2017. Pew Research Center. http: //www.pewinternet.org/2017/01/26/americans-and-cybersecurity/",
      "doi": ""
    },
    {
      "text": "Sameer Patil, Roberto Hoyle, Roman Schlegel, Apu Kapadia, and Adam J. Lee. 2015. Interrupt Now or Inform Later?: Comparing Immediate and Delayed Privacy Feedback. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, New York, NY, USA, 1415--1418.  ",
      "doi": "10.1145/2702123.2702165"
    },
    {
      "text": "Sameer Patil, Roman Schlegel, Apu Kapadia, and Adam J. Lee. 2014. Reflection or Action?: How Feedback and Control Affect Location Sharing Decisions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 101--110.  ",
      "doi": "10.1145/2556288.2557121"
    },
    {
      "text": "PhishTank. 2018. Join the fight against phishing. Technical Report. https://www.phishtank.com/",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, Adam L Durity, and Lorrie Faith Cranor. 2015. A design space for effective privacy notices. In Eleventh Symposium On Usable Privacy and Security (SOUPS 2015). 1--17. ",
      "doi": "10.5555/3235866.3235868"
    },
    {
      "text": "Stuart E. Schechter, Rachna Dhamija, Andy Ozment, and Ian Fischer. {n. d.}. The Emperor's New Security Indicators. In Security and Privacy, 2007. SP'07. IEEE Symposium On (2007). IEEE, 51--65. http://ieeexplore. ieee.org/abstract/document/4223213/  ",
      "doi": "10.1109/SP.2007.35"
    },
    {
      "text": "UC Berkeley Information Security and Policy. 2018. Phishing | Information Security and Policy. https://security.berkeley.edu/resources/ phishing",
      "doi": ""
    },
    {
      "text": "Steve Sheng, Bryant Magnien, Ponnurangam Kumaraguru, Alessandro Acquisti, Lorrie Faith Cranor, Jason Hong, and Elizabeth Nunge. 2007. Anti-Phishing Phil: The Design and Evaluation of a Game That Teaches People Not to Fall for Phish. In Proceedings of the 3rd Symposium on Usable Privacy and Security - SOUPS '07. ACM Press, Pittsburgh, Pennsylvania, 88.  ",
      "doi": "10.1145/1280680.1280692"
    },
    {
      "text": "Joshua Sunshine, Serge Egelman, Hazim Almuhimedi, Neha Atri, and Lorrie Faith Cranor. 2009. Crying Wolf: An Empirical Study of SSL Warning Effectiveness.. In USENIX Security Symposium. 399--416. ",
      "doi": "10.5555/1855768.1855793"
    },
    {
      "text": "Symantec. 2018. Internet Security Threat Report.",
      "doi": ""
    },
    {
      "text": "Janice Y Tsai, Serge Egelman, Lorrie Cranor, and Alessandro Acquisti. 2011. The effect of online privacy information on purchasing behavior: An experimental study. Information Systems Research 22, 2 (2011), 254--268.  ",
      "doi": "10.1287/isre.1090.0260"
    },
    {
      "text": "Verizon. 2018. 2018 Data Breach Investigations Report. Technical Report 11th Edition.",
      "doi": ""
    },
    {
      "text": "Melanie Volkamer, Karen Renaud, and Paul Gerber. 2016. Spot the Phish by Checking the Pruned URL. Information and Computer Security 24, 4 (Oct. 2016), 372--385.",
      "doi": ""
    },
    {
      "text": "Melanie Volkamer, Karen Renaud, Benjamin Reinheimer, and Alexandra Kunz. 2017. User experiences of TORPEDO: TOoltip-poweRed Phishing Email DetectiOn. Computers & Security 71 (2017), 100 -- 113.  ",
      "doi": "10.1016/j.cose.2017.02.004"
    },
    {
      "text": "Jaclyn Wainer, Laura Dabbish, and Robert Kraut. 2011. Should I open this email?: inbox-level cues, curiosity and attention to email. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 3439--3448.  ",
      "doi": "10.1145/1978942.1979456"
    },
    {
      "text": "Rick Wash and Molly M. Cooper. 2018. Who Provides Phishing Training?: Facts, Stories, and People Like Me. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press, Montreal QC, Canada, 1--12.  ",
      "doi": "10.1145/3173574.3174066"
    },
    {
      "text": "Liu Wenyin, Ning Fang, Xiaojun Quan, Bite Qiu, and Gang Liu. 2010. Discovering Phishing Target Based on Semantic Link Network. Future Generation Computer Systems 26, 3 (March 2010), 381--388.  ",
      "doi": "10.1016/j.future.2009.07.012"
    },
    {
      "text": "Colin Whittaker, Brian Ryner, and Marria Nazif. 2007. Large-Scale Automatic Classification of Phishing Pages. (2007), 14.",
      "doi": ""
    },
    {
      "text": "Michael S Wogalter, Vincent C Conzola, and Tonya L Smith-Jackson. 2002. based guidelines for warning design and evaluation. Applied ergonomics 33, 3 (2002), 219--230.",
      "doi": ""
    },
    {
      "text": "IBM X-Force. 2018. IBM X-Force Threat Intelligence Index 2018. https: //www.ibm.com/security/data-breach/threat-intelligence",
      "doi": ""
    },
    {
      "text": "Guang Xiang, Jason Hong, Carolyn P Rose, and Lorrie Cranor. 2011. Cantina+: A feature-rich machine learning framework for detecting phishing web sites. ACM Transactions on Information and System Security (TISSEC) 14, 2 (2011), 21.  ",
      "doi": "10.1145/2019599.2019606"
    },
    {
      "text": "Weining Yang, Jing Chen, Aiping Xiong, Robert W. Proctor, and Ninghui Li. {n. d.}. Effectiveness of a Phishing Warning in Field Settings. ACM Press, 1--2.  ",
      "doi": "10.1145/2746194.2746208"
    },
    {
      "text": "Yue Zhang, Jason I. Hong, and Lorrie F. Cranor. 2007. Cantina: A Content-Based Approach to Detecting Phishing Web Sites. In Proceedings of the 16th International Conference on World Wide Web - WWW '07. ACM Press, Banff, Alberta, Canada, 639.  ",
      "doi": "10.1145/1242572.1242659"
    }
  ]
}