{
  "doi": "10.1145/3290605.3300389",
  "title": "WhatFutures: Designing Large-Scale Engagements on WhatsApp",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2019,
  "badges": [],
  "abstract": "WhatsApp, as the world's most popular messaging application, offers significant opportunities for improving the reach and effectiveness of engagement projects. In collaboration with the International Federation of Red Cross and Red Crescent Societies (IFRC) we designed WhatFutures, a collaborative future forecasting engagement for global youth using WhatsApp. WhatFutures was successfully deployed with 487 players across 5 countries (Kenya, Bulgaria, Finland, Australia and Hong Kong) to inform strategic change within the IFRC. Based on our analysis of the activity - including 16,100 messages, 95 multimedia artifacts, and a post-engagement survey - we present a reflection upon the design decisions underpinning WhatFutures and identify how decisions made around group structures, processes and externalization of outputs influenced engagement and data quality. We conclude with the wider implications of our findings for the design of engagements that best utilize the affordances of existing messaging applications.",
  "authors": [
    {
      "name": "Daniel Lambton-Howard",
      "institution": "Newcastle University, Newcastle upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366417",
      "orcid": "missing"
    },
    {
      "name": "Robert Anderson",
      "institution": "Newcastle University, Newcastle upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261760",
      "orcid": "missing"
    },
    {
      "name": "Kyle Montague",
      "institution": "Newcastle University, Newcastle upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/do/10.1145/contrib-81472655898/rel-imgonly/xsmall_profile.jpg",
      "acmid": "81472655898",
      "orcid": "missing"
    },
    {
      "name": "Andrew Garbett",
      "institution": "Newcastle University, Newcastle upon Tyne, Tyne and Wear, United Kingdom",
      "img": "/do/10.1145/contrib-81502812670/rel-imgonly/andy.jpg",
      "acmid": "81502812670",
      "orcid": "missing"
    },
    {
      "name": "Shaun Hazeldine",
      "institution": "International Federation of Red Cross and Red Crescent Societies, Geneva, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365411",
      "orcid": "missing"
    },
    {
      "name": "Carlos Alvarez",
      "institution": "International Federation of Red Cross and Red Crescent Societies, Geneva, Switzerland",
      "img": "/do/10.1145/contrib-99659365186/rel-imgonly/ifrc201907173.jpg",
      "acmid": "99659365186",
      "orcid": "missing"
    },
    {
      "name": "John A. Sweeney",
      "institution": "Narxoz University, Almaty, Kazakhstan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366070",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    },
    {
      "name": "Ahmed Kharrufa",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479662079",
      "orcid": "missing"
    },
    {
      "name": "Tom Nappey",
      "institution": "Open Lab, Newcastle University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959298457",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amazon. 2018. Amazon Comprehend. https://aws.amazon.com/comprehend/",
      "doi": ""
    },
    {
      "text": "Michael Baker, Université Lumiè re Lyon F, Richard Joiner, and David Traum. 1999. The Role of Grounding in Collaborative Learning Tasks. Collaborative learning: Cognitive and computational approaches (1999), 63.",
      "doi": ""
    },
    {
      "text": "J Biggs and K. F. Collis. 1982. Evaluating the Quality of Learning: The SOLO Taxonomy. 13 pages.",
      "doi": ""
    },
    {
      "text": "Elizabeth Bonsignore, Vicki Moulder, Carman Neustaedter, Derek Hansen, Kari Kraus, and Allison Druin. 2014. Design Tactics for Authentic Interactive Fiction: Insights from Alternate Reality Game Designers. Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14 February 2016 (2014), 947--950.  ",
      "doi": "10.1145/2556288.2557245"
    },
    {
      "text": "Dan Bouhnik and Mor Deshen. 2014. WhatsApp Goes to School: Mobile Instant Messaging between Teachers and Students. Journal of Information Technology Education: Research, Vol. 13 (2014), 217--231.",
      "doi": ""
    },
    {
      "text": "Hanna Celina, Clement Lee, Patrick Olivier, and Ahmed Kharrufa. 2018. LearningCircle. io : Lessons Learned from Organising Courses with and without a Dedicated Platform. The Learning Circle platform : from idea to implementation .",
      "doi": ""
    },
    {
      "text": "Justin Cheng and Michael S Bernstein. 2014. Catalyst: Triggering Collective Action with Thresholds. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '14) (2014), 1211--1221.  ",
      "doi": "10.1145/2531602.2531635"
    },
    {
      "text": "Henry Chesbrough, Wim Vanhaverbeke, and Joel West. 2006. Open Innovation: Researching a New Paradigm. 373 pages.",
      "doi": ""
    },
    {
      "text": "Elizabeth G Cohen and Rachel A. Lotan. 2014. Designing groupwork: Strategies for the heterogeneous classroom. Vol. 2nd. Teachers College Press, NY. 202 pages.",
      "doi": ""
    },
    {
      "text": "D.L. De Vries and R.E. Slavin. 1978. Teams-Games-Tournaments (TGT): Review of Ten Classroom Experiments. Journal of Research and Development in Education,, Vol. 12(1) (1978), 28--38.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness. Proceedings of the 15th International Academic MindTrek Conference on Envisioning Future Media Environments - MindTrek '11 (2011), 9--11. arxiv: ACM 978--1--4503-0816--8/11/09  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Oswald Devisch, Alenka Poplin, and Simona Sofronie. 2016. The Gamification of Civic Participation: Two Experiments in Improving the Skills of Citizens to Reflect Collectively on Spatial Issues. Journal of Urban Technology, Vol. 732, June (2016), 1--22.",
      "doi": ""
    },
    {
      "text": "Andrea Forte, Niki Kittur, Vanessa Larco, and H Zhu. 2012. Coordination and beyond: social functions of groups in open content production. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work (2012), 417--426.  ",
      "doi": "10.1145/2145204.2145270"
    },
    {
      "text": "Rosemary Garris and Robert Ahlers. 2002. Games, Motivation, and Learning: A Research and Practice Model. Simulation and Gaming, Vol. 33, 4 (2002), 441--467.",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2003. What video games have to teach us about learning and literacy. Computers in Entertainment, Vol. 1, 1 (2003), 20.  ",
      "doi": "10.1145/950566.950595"
    },
    {
      "text": "Eric Gordon and Jessica Baldwin-Philippi. 2014. Playful civic learning: Enabling reflection and lateral trust in game-based public participation. International Journal of Communication, Vol. 8, 1 (2014), 759--786.",
      "doi": ""
    },
    {
      "text": "Eric Gordon, Stephen Walter, and Pablo Suarez. 2016. Engagement Games: a case for designing games to facilliate real-world action ., bibinfonumpages27 pages.",
      "doi": ""
    },
    {
      "text": "Hellmann's. {n. d.}. WhatsCook. http://cubo.cc/whatscook/",
      "doi": ""
    },
    {
      "text": "Nassim JafariNaimi and Eric M Meyers. 2015. Collective Intelligence or Group Think? Engaging Participation Patterns in World without Oil. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW '15 (2015), 1872--1881.  ",
      "doi": "10.1145/2675133.2675258"
    },
    {
      "text": "N JafariNaimi, E M Meyers, and A Trumble. 2014. Designing meaningful participation: Analyzing contribution patterns in an alternate reality game. Proceedings of the International ACM SIGGROUP Conference on Supporting Group Work (2014), 306--309.  ",
      "doi": "10.1145/2660398.2663778"
    },
    {
      "text": "Jesse Schell. 2014. The Art of Game Design: A book of lenses .AK Peters/CRC Press. ",
      "doi": "10.5555/3006351"
    },
    {
      "text": "David W. Johnson and Roger T. Johnson. 1999. Making cooperative learning work. Theory Into Practice, Vol. 38, 2 (1999), 67--73.",
      "doi": ""
    },
    {
      "text": "Paul Kariuki and Lizzy Oluwatoyin Ofusori. 2017. WhatsApp-Operated Stokvels Promoting Youth Entrepreneurship in Durban, South Africa. Proceedings of the 10th International Conference on Theory and Practice of Electronic Governance - ICEGOV '17 (2017), 253--259.  ",
      "doi": "10.1145/3047273.3047397"
    },
    {
      "text": "Jeffrey Y Kim, Jonathan P Allen, and Elan Lee. 2008. ALTERNATE REALITY GAMING. (cover story). Commun. ACM, Vol. 51, 2 (2008), 36--42.  ",
      "doi": "10.1145/1314215.1314222"
    },
    {
      "text": "Sunyoung Kim, Jennifer Mankoff, and Eric Paulos. 2013. Sensr. Proceedings of the 2013 conference on Computer supported cooperative work - CSCW '13 (2013), 1453.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur. 2010. Crowdsourcing, collaboration and creativity. XRDS: Crossroads, The ACM Magazine for Students, Vol. 17, 2 (2010), 22.  ",
      "doi": "10.1145/1869086.1869096"
    },
    {
      "text": "a Kittur, J Nickerson, and M Bernstein. 2013. The Future of Crowd Work. Proc. CSCW '13 (2013), 1--17.  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Shirlee-Ann Knight and Janice Burn. 2005. Developing a framework for assessing information quality on the World Wide Web. Informing Science Journal, Vol. 8, 3 (2005), 159 -- 172.",
      "doi": ""
    },
    {
      "text": "Edith Law, Andrea Wiggins, Mary L Gray, and Alex Williams. 2017. Crowdsourcing as a Tool for Research : Implications of Uncertainty. (2017), 1544--1561.  ",
      "doi": "10.1145/2998181.2998197"
    },
    {
      "text": "Haley MacLeod, Ben Jelen, Annu Prabhakar, Lora Oehlberg, Katie Siek, and Kay Connelly. 2017. Asynchronous Remote Communities (ARC) for Researching Distributed Populations. EAI Endorsed Transactions on Pervasive Health and Technology, Vol. 3, 11 (2017), 152898.",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Kim Oakes, Danika Geisler, Kay Connelly, and Katie Siek. 2015. Rare World: Towards Technology for Rare Diseases. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI '15 (2015), 1145--1154.  ",
      "doi": "10.1145/2702123.2702494"
    },
    {
      "text": "Juan F Maestre, Haley Macleod, Ciabhan L Connelly, Julia C Dunbar, Jordan Beck, Katie A Siek, and Patrick C Shih. 2018. Defining Through Expansion : Conducting Asynchronous Remote Communities ( ARC ) Research with Stigmatized Groups. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI'18 (2018), 1--13.  ",
      "doi": "10.1145/3173574.3174131"
    },
    {
      "text": "Jane McGonigal. 2011. Reality is broken: Why games make us better and how they can change the world. (2011). ",
      "doi": "10.5555/1972527"
    },
    {
      "text": "D. L. Morgan. 1997. Focus Groups as Qualitative Research. Sage Publications (1997), 32--46.",
      "doi": ""
    },
    {
      "text": "Lizzy Oluwatoyin Ofusori and Paul Kariuki. 2017. The Power of WhatsApp as a Communication Tool for Elections Observation and Monitoring in KwaZulu-Natal. Proceedings of the 10th International Conference on Theory and Practice of Electronic Governance - ICEGOV '17 (2017), 536--537.  ",
      "doi": "10.1145/3047273.3047398"
    },
    {
      "text": "Tamara Peyton, Alyson L. Young, and Wayne Lutters. 2013. Playing with leadership and expertise. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '13 (2013), 715.  ",
      "doi": "10.1145/2470654.2470755"
    },
    {
      "text": "Yusuf Pisan. 2007. My guild, my people: role of guilds in massively multiplayer online games. Proceedings of the 4th Australasian conference on Interactive entertainment (2007), 20. http://portal.acm.org/citation.cfm?id=1367976 ",
      "doi": "10.5555/1367956.1367976"
    },
    {
      "text": "Annu Sible Prabhakar, Lucia Guerra-Reyes, Vanessa M. Kleinschmidt, Ben Jelen, Haley MacLeod, Kay Connelly, and Katie A. Siek. 2017. Investigating the Suitability of the Asynchronous, Remote, Community-based Method for Pregnant and New Mothers. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI '17 (2017), 4924--4934.  ",
      "doi": "10.1145/3025453.3025546"
    },
    {
      "text": "Pybossa. 2018. Pybossa. https://pybossa.com/",
      "doi": ""
    },
    {
      "text": "Katharina Reinecke, Ann Arbor, and Krzysztof Z Gajos. 2015. LabintheWild : Conducting Large-Scale Online Experiments With Uncompensated Samples. Cscw (2015), 1364--1378.  ",
      "doi": "10.1145/2675133.2675246"
    },
    {
      "text": "Daniela Retelny, Sé bastien Robaszkiewicz, Alexandra To, Walter S. Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S. Bernstein. 2014. Expert crowdsourcing with flash teams. In Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST '14. 75--85.  ",
      "doi": "10.1145/2642918.2647409"
    },
    {
      "text": "Katie Salen. 1995. The Ecology of Games. Communication Theory, Vol. 13, 3 (1995).",
      "doi": ""
    },
    {
      "text": "Katie Salen and Eric Zimmerman. 2003. Rules of Play: Game Design Fundamentals. MIT Press, Vol. 2004 (2003), 688. ",
      "doi": "10.5555/1215723"
    },
    {
      "text": "AF Seay, William J Jerome, Kevin Sang Lee, and Robert E Kraut. 2004. Project Massive: A Study of Online Gaming Communities. Extended abstracts of the 2004 conference on Human factors and computing systems - CHI '04 (2004), 1421.  ",
      "doi": "10.1145/985921.986080"
    },
    {
      "text": "Ethan Seltzer and Dillon Mahmoudi. 2013. Citizen Participation, Open Innovation, and Crowdsourcing: Challenges and Opportunities for Planning. Journal of Planning Literature, Vol. 28, 1 (2013), 3--18.",
      "doi": ""
    },
    {
      "text": "Amy Soller. 2007. Supporting Social Interaction in an Intelligent Collaborative Learning System. International Journal of Artificial Intelligence in Education, Vol. 12 (2007), 40--62.",
      "doi": ""
    },
    {
      "text": "Statista. {n. d.}. Most Popular Mobile Messaging Apps Worldwide. https://www.statista.com/statistics/258749/most-popular-global-mobile-messenger-apps/",
      "doi": ""
    },
    {
      "text": "Besiki Stvilia, Les Gasser, Michael B. Twidale, and Linda C. Smith. 2007. A framework for information quality assessment. Journal of the American Society for Information Science and TechnologyJASIST, Vol. 58, 12 (2007), 1720--1733. ",
      "doi": "10.5555/1294885.1294896"
    },
    {
      "text": "Ajay Sura. {n. d.}. In a first, court to send summons via WhatsApp. https://timesofindia.indiatimes.com/city/chandigarh/in-a-first-court-to-send-summons-via-whatsapp/articleshow/58074835.cms",
      "doi": ""
    },
    {
      "text": "K Toyama. 2011. Technology as amplifier in international development. Proceedings of the 2011 iConference on - iConference '11 (2011), 75--82.  ",
      "doi": "10.1145/1940761.1940772"
    },
    {
      "text": "Zach Waggoner. 2009. My avatar, my self : identity in video role-playing games. McFarland & Company, Jefferson. 201 pages.",
      "doi": ""
    },
    {
      "text": "Alyson Young, Tamara Peyton, and Wayne Lutters. 2013. Understanding Situated Action in Ludic Ecologies. Proc. Intl. Conf. on Communities and Technologies (C&T) (2013), 100--109.  ",
      "doi": "10.1145/2482991.2483000"
    }
  ]
}