{
  "doi": "10.1145/3290605.3300602",
  "title": "\"I Bought This for Me to Look More Ordinary\": A Study of Blind People Doing Online Shopping",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "Online shopping, by reducing the needs for traveling, has become an essential part of lives for people with visual impairments. However, in HCI, research on online shopping for them has only been limited to the analysis of accessibility and usability issues. To develop a broader and better understanding of how visually impaired people shop online and design accordingly, we conducted a qualitative study with twenty blind people. Our study highlighted that blind people's desire of being treated as ordinary had significantly shaped their online shopping practices: very attentive to the visual appearance of the goods even they themselves could not see and taking great pain to find and learn what commodities are visually appropriate for them. This paper reports how their trying to appear ordinary is manifested in online shopping and suggests design implications to support these practices.",
  "authors": [
    {
      "name": "Guanhong Liu",
      "institution": "Tsinghua University & Ministry of Education, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366384",
      "orcid": "0000-0002-3266-2178"
    },
    {
      "name": "Xianghua Ding",
      "institution": "Fudan University, Shanghai, China",
      "img": "/do/10.1145/contrib-81539424156/rel-imgonly/81539424156.png",
      "acmid": "81539424156",
      "orcid": "0000-0001-8122-6252"
    },
    {
      "name": "Chun Yu",
      "institution": "Tsinghua University & Ministry of Education, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467660483",
      "orcid": "0000-0003-2591-7993"
    },
    {
      "name": "Lan Gao",
      "institution": "Beihang University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367140",
      "orcid": "missing"
    },
    {
      "name": "Xingyu Chi",
      "institution": "Kensington Park School, London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365976",
      "orcid": "missing"
    },
    {
      "name": "Yuanchun Shi",
      "institution": "Tsinghua University & Ministry of Education, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647319",
      "orcid": "0000-0003-2273-6927"
    }
  ],
  "references": [
    {
      "text": "A Aamodt, Suellen Grassl-Herwehe, Fran Farrell, and J Hutter. 1984. The child's view of chemically induced alopecia. Care: The essence of nursing and health (1984), 217--231.",
      "doi": ""
    },
    {
      "text": "Amazaon. Echo Look | Hands-Free Camera and Style Assistant with Alexa-includes Style Check to get a second opinion on your outfit. https://www.amazon.com/Amazon-Echo-Look-Camera-StyleAssistant/dp/B0186JAEWK.",
      "doi": ""
    },
    {
      "text": "Apple. IOS Accessibility Guideine. https:// developer.apple.com/accessibility/ios/.",
      "doi": ""
    },
    {
      "text": "Mona Asbjørnslett, Sølvi Helseth, and Gunn H Engelsrud. 2014. 'Being an ordinary kid'--demands of everyday life when labelled with disability. Scandinavian Journal of Disability Research 16, 4 (2014), 364--376.",
      "doi": ""
    },
    {
      "text": "Information Accessibility Research Association. 2018. Report on mobile information behavior of visually impaired people. http://www.capa.ac/Report20180409.pdf.",
      "doi": ""
    },
    {
      "text": "Stacey Menzel Baker. 2006. Consumer normalcy: Understanding the value of shopping through narratives of consumers with visual impairments. Journal of retailing 82, 1 (2006), 37--50.",
      "doi": ""
    },
    {
      "text": "Stacey Menzel Baker, Debra Lynn Stephens, and Ronald Paul Hill. 2002. How can retailers enhance accessibility: giving consumers with visual impairments a voice in the marketplace. Journal of Retailing and Consumer Services 9, 4 (2002), 227--239.",
      "doi": ""
    },
    {
      "text": "Jefferey D Beach, Judy M Robinet, and Julie Hakim-Larson. 1995. Selfesteem and independent living skills of adults with visual impairments. Journal of Visual Impairment & Blindness (1995).",
      "doi": ""
    },
    {
      "text": "Jeffrey P Bigham, Chandrika Jayant, Andrew Miller, Brandyn White, and Tom Yeh. 2010. VizWiz:: LocateIt-enabling blind people to locate objects in their environment. In Computer Vision and Pattern Recognition Workshops (CVPRW), 2010 IEEE Computer Society Conference on. IEEE, 65--72.",
      "doi": ""
    },
    {
      "text": "Michele A Burton, Erin Brady, Robin Brewer, Callie Neylan, Jeffrey P Bigham, and Amy Hurst. 2012. Crowdsourcing subjective fashion advice using VizWiz: challenges and opportunities. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility. ACM, 135--142.  ",
      "doi": "10.1145/2384916.2384941"
    },
    {
      "text": "Yu Chen, Yunan Chen, Mirana Michelle Randriambelonoro, Antoine Geissbuhler, and Pearl Pu. 2017. Design Considerations for Social Fitness Applications: Comparing Chronically Ill Patients and Healthy Adults. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 1753--1762.  ",
      "doi": "10.1145/2998181.2998350"
    },
    {
      "text": "Terry L Childers and Carol Kaufman-Scarborough. 2009. Expanding opportunities for online shoppers with disabilities. Journal of Business Research 62, 5 (2009), 572--578.",
      "doi": ""
    },
    {
      "text": "DI De Silva, MRA Nashry, S Varathalingam, R Murugathas, and TK Suriyawansa. 2017. iShop-Shopping application for visually challenged. In Knowledge and Smart Technology (KST), 2017 9th International Conference on. IEEE, 232--237.",
      "doi": ""
    },
    {
      "text": "Paul Fishwick. 2006. An introduction to aesthetic computing. Aesthetic computing (2006), 3--27.",
      "doi": ""
    },
    {
      "text": "Lok-Tsang Fok and Helene H Fung. 2004. Self-Concept Among People With and Without Visual Impairment: The Role of Achievement Motivation. Journal of Psychology in Chinese Societies (2004).",
      "doi": ""
    },
    {
      "text": "Elisabeth Fuchs and Christine Strauss. 2012. Online Shopping Involving Consumers with Visual Impairments--A Qualitative Study. In International Conference on Computers for Handicapped Persons. Springer, 378--385.  ",
      "doi": "10.1007/978-3-642-31522-0_57"
    },
    {
      "text": "Maite Garaigordobil and Elena Bernarás. 2009. Self-concept, selfesteem, personality traits and psychopathological symptoms in adolescents with and without visual impairment. The Spanish journal of psychology 12, 1 (2009), 149--160.",
      "doi": ""
    },
    {
      "text": "Harold Garfinkel. 1967. Studies in ethnomethodology. (1967).",
      "doi": ""
    },
    {
      "text": "Google. Andriod Accessibility Guideine. https:// developer.android.com/guide/topics/ui/accessibility/.",
      "doi": ""
    },
    {
      "text": "Carol Kaufman-Scarborough and Terry L Childers. 2009. Understanding markets as online public places: Insights from consumers with visual impairments. Journal of Public Policy & Marketing 28, 1 (2009), 16--28.",
      "doi": ""
    },
    {
      "text": "Sreekar Krishna, Vineeth Balasubramanian, Narayanan Chatapuram Krishnan, Colin Juillard, Terri Hedgpeth, and Sethuraman Panchanathan. 2008. A wearable wireless RFID system for accessible shopping environments. In Proceedings of the ICST 3rd international conference on Body area networks. ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), 29. ",
      "doi": "10.5555/1460257.1460296"
    },
    {
      "text": "Vladimir Kulyukin, Chaitanya Gharpure, and John Nicholson. 2005. Robocart: Toward robot-assisted navigation of grocery stores by the visually impaired. In Intelligent Robots and Systems, 2005.(IROS 2005). 2005 IEEE/RSJ International Conference on. IEEE, 2845--2850.",
      "doi": ""
    },
    {
      "text": "Vladimir Kulyukin and Aliasgar Kutiyanawala. 2010. Accessible shopping systems for blind and visually impaired individuals: Design requirements and the state of the art. The Open Rehabilitation Journal 3 (2010), 158--168.",
      "doi": ""
    },
    {
      "text": "Vladimir Kulyukin and Aliasgar Kutiyanawala. 2010. From ShopTalk to ShopMobile: vision-based barcode scanning with mobile phones for independent blind grocery shopping. In Proceedings of the 2010 Rehabilitation Engineering and Assistive Technology Society of North America Conference (RESNA 2010), Las Vegas, NV, Vol. 703. 1--5.",
      "doi": ""
    },
    {
      "text": "Vladimir Kulyukin, Tanwir Zaman, Abhishek Andhavarapu, and Aliasgar Kutiyanawala. 2012. Eyesight sharing in blind grocery shopping: remote P2P caregiving through cloud computing. In International Conference on Computers for Handicapped Persons. Springer, 75-- 82.  ",
      "doi": "10.1007/978-3-642-31534-3_12"
    },
    {
      "text": "Aliasgar Kutiyanawala, Vladimir Kulyukin, and John Nicholson. 2011. Teleassistance in accessible shopping for the blind. In Proceedings on the International Conference on Internet Computing (ICOMP). The Steering Committee of The World Congress in Computer Science, Computer Engineering and Applied Computing (WorldComp), 1.",
      "doi": ""
    },
    {
      "text": "Eli Langørgen and Eva Magnus. 2018. 'We are just ordinary people working hard to reach our goals!'Disabled students' participation in Norwegian higher education. Disability & Society 33, 4 (2018), 598-- 617.",
      "doi": ""
    },
    {
      "text": "Patrick E Lanigan, Aaron M Paulos, Andrew W Williams, Dan Rossi, and Priya Narasimhan. 2006. Trinetra: Assistive Technologies for Grocery Shopping for the Blind.. In ISWC. 147--148.",
      "doi": ""
    },
    {
      "text": "Leslie S Liu, Kori M Inkpen, and Wanda Pratt. 2015. I'm not like my friends: understanding how children with a chronic illness use technology to maintain normalcy. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 1527--1539.  ",
      "doi": "10.1145/2675133.2675201"
    },
    {
      "text": "Diego López-de Ipiña, Tania Lorido, and Unai López. 2011. Blindshopping: enabling accessible shopping for visually impaired people through mobile technologies. In International Conference on Smart Homes and Health Telematics. Springer, 266--270. ",
      "doi": "10.5555/2026187.2026232"
    },
    {
      "text": "Maria Dolores López-Justicia, Maria Carmen Pichardo Martínez, and Antonio Chacón Medina. 2005. Self-concept in low-vision children and their peers without visual problems. Self and Identity 4, 4 (2005), 305--309.",
      "doi": ""
    },
    {
      "text": "Blind Monthly. 2011. Focus on Sensitive Points for blind employment. http://www.chinadp.net.cn/datasearch/journal/mryk/2011 08/13 8510.html .",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Kori Inkpen, and Gina Venolia. 2014. Remote shop-ping advice: enhancing in-store shopping with social technologies. In Pro-ceedings of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 662--673.  ",
      "doi": "10.1145/2531602.2531707"
    },
    {
      "text": "Priya Narasimhan. 2006. Assistive embedded technologies. Computer 39, 7 (2006), 85--87.  ",
      "doi": "10.1109/MC.2006.221"
    },
    {
      "text": "John Nicholson, Vladimir Kulyukin, and Daniel Coster. 2009. ShopTalk: independent blind shopping through verbal route directions and barcode scans. The Open Rehabilitation Journal 2, 1 (2009), 11--23.",
      "doi": ""
    },
    {
      "text": "Festus E Obiakor and Stephen W Stile. 1990. The self-concepts of visually impaired and normally sighted middle school children. The Journal of psychology 124, 2 (1990), 199--206.",
      "doi": ""
    },
    {
      "text": "World Health Organization. {n. d.}. Blindness as a public health problem in China. http://www.who.int/mediacentre/factsheets/fs230/en/.",
      "doi": ""
    },
    {
      "text": "Stephen Pack, Sasha Kelly, and Monna Arvinen-Barrow. 2017. \"I think I became a swimmer rather than just someone with a disability swimming up and down:\" paralympic athletes perceptions of self and identity development. Disability and rehabilitation 39, 20 (2017), 2063--2070.",
      "doi": ""
    },
    {
      "text": "Simone Preuss. 2018. Alibaba presents shopping of the future with Fashion AI Concept Store. https://fashionunited.uk/news/retail/alibaba-presentsshopping-of-the-future-with-fashion-ai-concept-store/2018070630597.",
      "doi": ""
    },
    {
      "text": "Penny J Rhodes, Neil A Small, Hanif Ismail, and John P Wright. 2008. 'What really annoys me is people take it like it's a disability', epilepsy, disability and identity among people of Pakistani origin living in the UK. Ethnicity and Health 13, 1 (2008), 1--21.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 705--714.  ",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2016. Self-conscious or selfconfident? A diary study conceptualizing the social accessibility of assistive technology. ACM Transactions on Accessible Computing (TACCESS) 8, 2 (2016), 5.  ",
      "doi": "10.1145/2827857"
    },
    {
      "text": "Anselm Strauss and Juliet M Corbin. 1990. Basics of qualitative research: Grounded theory procedures and techniques. Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Hironobu Takagi, Shin Saito, Kentarou Fukuda, and Chieko Asakawa. 2007. Analysis of navigability of Web applications for improving blind usability. ACM Transactions on Computer-Human Interaction (TOCHI) 14, 3 (2007), 13.  ",
      "doi": "10.1145/1279700.1279703"
    },
    {
      "text": "W3C. 2018. Web Content Accessibility Guidelines (WCAG) 2.1. https://www.w3.org/TR/WCAG21/.",
      "doi": ""
    },
    {
      "text": "Nick Watson. 2002. Well, I know this is going to sound very strange to you, but I don't see myself as a disabled person: Identity and disability. Disability & Society 17, 5 (2002), 509--527.",
      "doi": ""
    },
    {
      "text": "Brian Williams, Joanne Corlett, Jon S Dowell, Joanne Coyle, and Somnath Mukhopadhyay. 2009. \"I've Never Not Had it So I Don't Really Know What it's Like Not to\": Nondifference and Biographical Disruption Among Children and Young People With Cystic Fibrosis. Qualitative Health Research 19, 10 (2009), 1443--1455.",
      "doi": ""
    },
    {
      "text": "Barbara V Wise. 2002. In their own words: The lived experience of pediatric liver transplantation. Qualitative Health Research 12, 1 (2002), 74--90.",
      "doi": ""
    },
    {
      "text": "Xiaodong Yang, Shuai Yuan, and YingLi Tian. 2014. Assistive Clothing Pattern Recognition for Visually Impaired People. IEEE Trans. Human-Machine Systems 44, 2 (2014), 234--243.",
      "doi": ""
    },
    {
      "text": "Hong Yu, Sandra Tullio-Pow, and Ammar Akhtar. 2015. Retail design and the visually impaired: A needs assessment. Journal of Retailing and Consumer Services 24 (2015), 121--129.",
      "doi": ""
    },
    {
      "text": "CHIEN WEN YUAN, BENJAMIN V HARAHAN, SOOYEON LEE, MARY BETH ROSSON, and JOHN M CARROLL. {n. d.}. I Didn't Know that You Knew I Knew: Collaborative Shopping Practices between People with Visual Impairment and People with Vision. ({n. d.}).",
      "doi": ""
    },
    {
      "text": "M Zunich and BE Ledwith. 1965. Self-concepts of visually handicapped and sighted children. Perceptual and motor skills 21, 3 (1965), 771--774.",
      "doi": ""
    }
  ]
}