{
  "doi": "10.1145/3290605.3300817",
  "title": "Group Interactions in Location-Based Gaming: A Case Study of Raiding in Pokémon GO",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "Raiding is a format in digital gaming that requires groups of people to collaborate and/or compete for a common goal. In 2017, the raiding format was introduced in the location-based mobile game Pokémon GO, which offers a mixed reality experience to friends and strangers coordinating for in-person raids. To understand this technology-mediated social phenomenon, we conducted over a year of participant observations, surveys with 510 players, and interviews with 25 players who raid in Pokémon GO. Using the analytical lens of Arrow, McGrath, and Berdahl's theory of small groups as complex systems, we identify global, local, and contextual dynamics in location-based raiding that support and challenge ad-hoc group formation in real life. Based on this empirical and theoretical understanding, we discuss implications to design for transparency, social affordances, and bridging gaps between global and contextual dynamics for increased positive and inclusive community interactions.",
  "tags": [
    "raiding",
    "location based game",
    "mixed reality game",
    "groups"
  ],
  "authors": [
    {
      "name": "Arpita Bhattacharya",
      "institution": "University of Washinggton, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130362",
      "orcid": "0000-0001-8890-5557"
    },
    {
      "name": "Travis W. Windleharth",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659247200",
      "orcid": "missing"
    },
    {
      "name": "Rio Anthony Ishii",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365581",
      "orcid": "missing"
    },
    {
      "name": "Ivy M. Acevedo",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366481",
      "orcid": "missing"
    },
    {
      "name": "Cecilia R. Aragon",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81502659190/rel-imgonly/cecilia_aragon_feb_2020_110x110.jpg",
      "acmid": "81502659190",
      "orcid": "missing"
    },
    {
      "name": "Julie A. Kientz",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81548025762/rel-imgonly/kientz-headshot-small.png",
      "acmid": "81548025762",
      "orcid": "missing"
    },
    {
      "name": "Jason C. Yip",
      "institution": "University of Washinton, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502757149",
      "orcid": "0000-0001-9980-0670"
    },
    {
      "name": "Jin Ha Lee",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332511159",
      "orcid": "0000-0002-9007-514X"
    }
  ],
  "references": [
    {
      "text": "Allana Akhtar. 2016-08-09. Is Pokémon GO racist?: How the app may be redlining people of color. USA Today. (2016-08-09).",
      "doi": ""
    },
    {
      "text": "Tim Althof, Ryen W. White, and Eric Horvitz. 2016. Infuence of Pokémon Go on Physical Activity: Study and Implications. Journal of Medical Internet Research 18, 12 (2016), e315.",
      "doi": ""
    },
    {
      "text": "Holly Arrow, Joseph E McGrath, and Jennifer L Berdahl. 2000. Small groups as complex systems: Formation, coordination, development, and adaptation. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Robert Rogers Blake and Jane Srygley Mouton. 1994-05-01. The Managerial Grid. Gulf Pub Co.",
      "doi": ""
    },
    {
      "text": "Stacey Blasiola, Miao Feng, and Adrienne Massanari. 2015. Riding in cars with strangers: A cross-cultural comparison of privacy and safety in Ingress. Social, Casual and Mobile Games: The changing gaming landscape (2015), 135--148.",
      "doi": ""
    },
    {
      "text": "Elizabeth M Bonsignore, Derek L Hansen, Zachary O Toups, Lennart E Nacke, Anastasia Salter, and Wayne Lutters. 2012. Mixed reality games. In Proceedings of the ACM 2012 conference on computer supported cooperative work companion. ACM, 7--8.  ",
      "doi": "10.1145/2141512.2141517"
    },
    {
      "text": "Ashley Colley, Jacob Thebault-Spieker, Allen Yilun Lin, Donald Degraen, Benjamin Fischman, Jonna Häkkilä, Kate Kuehl, Valentina Nisi, Nuno Jardim Nunes, Nina Wenig, and others. 2017. The geography of Pokémon GO: benefcial and problematic efects on places and movement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1179--1192.  ",
      "doi": "10.1145/3025453.3025495"
    },
    {
      "text": "Juliet Corbin, Anselm Strauss, and Anselm L Strauss. 2014. Basics of qualitative research. sage.",
      "doi": ""
    },
    {
      "text": "Rob Cover. 2016. Digital Diference: Theorizing Frameworks of Bodies, Representation and Stereotypes in Digital Games. Asia Pacifc Media Educator 26, 1 (2016), 4--16.",
      "doi": ""
    },
    {
      "text": "John W Creswell. 1998. Qualitative inquiry and research design: Choosing among fve traditions. Thousand Oaks, CA: Sage.",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Robert Kraut, and Jordan Patton. 2012. Communication and commitment in an online game team. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 879--888.  ",
      "doi": "10.1145/2207676.2208529"
    },
    {
      "text": "Yvonne AW De Kort and Wijnand A Ijsselsteijn. 2008. People, places, and play: player experience in a socio-spatial context. Computers in Entertainment (CIE) 6, 2 (2008), 18.  ",
      "doi": "10.1145/1371216.1371221"
    },
    {
      "text": "Yvonne AW De Kort, Wijnand A IJsselsteijn, and Karolien Poels. 2007. Digital games as social presence technology: Development of the Social Presence in Gaming Questionnaire (SPGQ). Proceedings of PRESENCE 195203 (2007).",
      "doi": ""
    },
    {
      "text": "Fern M Delamere and Susan M Shaw. 2008. \"They see it as a guy's game \": The politics of gender in digital games. Leisure/Loisir 32, 2 (2008), 279--302.",
      "doi": ""
    },
    {
      "text": "Nicolas Ducheneaut and Robert J Moore. 2004. The social side of gaming: a study of interaction patterns in a massively multiplayer online game. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. ACM, 360--369.  ",
      "doi": "10.1145/1031607.1031667"
    },
    {
      "text": "Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J Moore. 2006. Alone together?: exploring the social dynamics of massively multiplayer online games. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 407--416.  ",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "Leighton Evans and Michael Saker. 2018. The playeur and Pokémon Go: Examining the efects of locative play on spatiality and sociability. Mobile Media & Communication (2018), 2050157918798866.",
      "doi": ""
    },
    {
      "text": "Mike Fahey. 2016. Team Mystic is the Pokémon GO faction of choice. https://kotaku.com/ team-mystic-is-the-pokemon-go-faction-of-choice-1783441067",
      "doi": ""
    },
    {
      "text": "Martin Flintham, Steve Benford, Rob Anastasi, Terry Hemmings, Andy Crabtree, Chris Greenhalgh, Nick Tandavanitj, Matt Adams, and Ju Row-Farr. 2003. Where on-line meets on the streets: experiences with mobile mixed reality games. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 569--576.  ",
      "doi": "10.1145/642611.642710"
    },
    {
      "text": "Lisa M Given. 2008. The Sage encyclopedia of qualitative research methods. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Samuel H Goh and Molly M Wasko. 2009. Leadership in MMOGS: Emergent and transformational leadership candidates. AMCIS 2009 Proceedings (2009), 538.",
      "doi": ""
    },
    {
      "text": "Kishonna L Gray. 2012. Intersecting oppressions and online communities: Examining the experiences of women of color in Xbox Live. Information, Communication & Society 15, 3 (2012), 411--428.",
      "doi": ""
    },
    {
      "text": "Mizuko Ito, Sonja Baumer, Matteo Bittanti, Rachel Cody, Becky Herr Stephenson, Heather A Horst, Patricia G Lange, Dilan Mahendran, Katynka Z Martínez, CJ Pascoe, and others. 2009. Hanging out, messing around, and geeking out: Kids living and learning with new media. MIT press. ",
      "doi": "10.5555/1822783"
    },
    {
      "text": "Katherine P. Kaste, Robert Hofman, Barrett Caldwell, Nicholas Kasdaglis, and Kelly J. Neville. 2015. Introducing Change into Complex Cognitive Work Systems. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 59. SAGE Publications Sage CA: Los Angeles, CA, 409--412.",
      "doi": ""
    },
    {
      "text": "Nancy Katz, David Lazer, Holly Arrow, and Noshir Contractor. 2004. Network theory and small groups. Small group research 35, 3 (2004), 307--332.",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2014. Playing with strangers: understanding temporary teams in league of legends. In Proceedings of the frst ACM SIGCHI annual symposium on Computer-human interaction in play. ACM, 161--169.  ",
      "doi": "10.1145/2658537.2658538"
    },
    {
      "text": "Andrea Lancichinetti, Santo Fortunato, and János Kertész. 2009. Detecting the overlapping and hierarchical community structure in complex networks. New Journal of Physics 11, 3 (2009), 033015.",
      "doi": ""
    },
    {
      "text": "Jin Ha Lee, Travis Windleharth, Jason Yip, and Marc Schmalz. 2017. Impact of location-based augmented reality games on people's information behavior: A case study of Pokémon Go. iConference 2017 Proceedings (2017).",
      "doi": ""
    },
    {
      "text": "Yu-Hao Lee and Donghee Yvette Wohn. 2012-07-01. Are there cultural diferences in how we play? Examining cultural efects on playing social network games. Computers in Human Behavior 28, 4 (2012-07-01), 1307--1314.  ",
      "doi": "10.1016/j.chb.2012.02.014"
    },
    {
      "text": "Yvonna S Lincoln and Norman K Denzin. 1994. The ffth moment. Handbook of qualitative research 1 (1994), 575--586.",
      "doi": ""
    },
    {
      "text": "Joseph E McGrath, Holly Arrow, and Jennifer L Berdahl. 2000. The study of groups: Past, present, and future. Personality and Social Psychology Review 4, 1 (2000), 95--105.",
      "doi": ""
    },
    {
      "text": "Lauren B McInroy and Faye Mishna. 2017. Cyberbullying on online gaming platforms for children and youth. Child and adolescent social work journal 34, 6 (2017), 597--607.",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam and Elizabeth J Tisdell. 2015. Qualitative research: A guide to design and implementation. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Kiyoshi Midooka. 1990. Characteristics of Japanese-style communication. Media, Culture & Society 12, 4 (1990), 477--489.",
      "doi": ""
    },
    {
      "text": "Lisa Nakamura. 2009. Don't hate the player, hate the game: The racialization of labor in World of Warcraft. Critical Studies in Media Communication 26, 2 (2009), 128--144.",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi and Justin Harris. 2006. Strangers and friends: Collaborative play in World of Warcraft. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. ACM, 149--158.  ",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "Niantic. 2017. Niantic's blog on number of users. https://www. nianticlabs.com/blog/ CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Bhatacharya et al.",
      "doi": ""
    },
    {
      "text": "Niantic. 2017. Niantic's blogs explaining three core values in design of Pokémon GO. https://www.nianticlabs.com/blog/ nianticrealworldplatform/",
      "doi": ""
    },
    {
      "text": "Niantic. 2018. Niantic's blog on Field and Special Research. https: //pokemongolive.com/post/research/",
      "doi": ""
    },
    {
      "text": "Niantic. 2018. Niantic's blog on Raid Battles. https: //support.pokemongo.nianticlabs.com/hc/en-us/articles/ 115009004747-Raid-Battles",
      "doi": ""
    },
    {
      "text": "Susanna Paasovaara, Kaisa Väänänen, Aris Malapaschas, Ekaterina Olshannikova, Thomas Olsson, Pradthana Jarusriboonchai, Jií Hosek, ? and Pavel Masek. 2018. Playfulness and progression in technology? enhanced social experiences between nearby strangers. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction. ACM, 537--548.  ",
      "doi": "10.1145/3240167.3240212"
    },
    {
      "text": "Janne Paavilainen, Hannu Korhonen, Kati Alha, Jaakko Stenros, Elina Koskinen, and Frans Mayra. 2017. The Pokémon GO experience: A location-based augmented reality mobile game goes mainstream. In Proceedings of the 2017 CHI conference on human factors in computing systems. ACM, 2493--2498.  ",
      "doi": "10.1145/3025453.3025871"
    },
    {
      "text": "Patrick Prax. 2010. Leadership style in World of Warcraft raid guilds. Proceedings of DiGRA Nordic (2010).",
      "doi": ""
    },
    {
      "text": "Kiley Sobel, Arpita Bhattacharya, Alexis Hiniker, Jin Ha Lee, Julie A Kientz, and Jason C Yip. 2017. It wasn't really about the Pokémon: Parents' Perspectives on a Location-Based Mobile Game. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1483--1496.  ",
      "doi": "10.1145/3025453.3025761"
    },
    {
      "text": "Constance A Steinkuehler and Dmitri Williams. 2006. Where everybody knows your (screen) name: Online games as \"third places \". Journal of computer-mediated communication 11, 4 (2006), 885--909.",
      "doi": ""
    },
    {
      "text": "Niantic Support. 2016. Niantic's support page on game play for Ingress. https://support.ingress.com/hc/en-us",
      "doi": ""
    },
    {
      "text": "Alistair Sutclife. 2008. Extending small group theory for analysing complex systems. Complexity in Design and Engineering (2008).",
      "doi": ""
    },
    {
      "text": "Sherry Turkle. 2012. Alone together: Why we expect more from technology and less from each other. Hachette UK. ",
      "doi": "10.5555/1972496"
    },
    {
      "text": "Kellie Vella, Daniel Johnson, Vanessa Wan Sze Cheng, Tracey Davenport, Jo Mitchell, Madison Klarkowski, and Cody Phillips. 2017. A sense of belonging: Pokemon GO and Social Connectedness. Games and Culture (2017), 1555412017719973.",
      "doi": ""
    },
    {
      "text": "Amy Voida and Saul Greenberg. 2009. Wii all play: the console game as a computational meeting place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1559--1568.  ",
      "doi": "10.1145/1518701.1518940"
    },
    {
      "text": "Derek Wang, Tingmin Wu, Sheng Wen, Donghai Liu, Yang Xiang, Wanlei Zhou, Houcine Hassan, and Abdulhameed Alelaiwi. 2018. Pokémon GO in Melbourne CBD: A case study of the cyber-physical symbiotic social networks. Journal of computational science 26 (2018), 456--467.",
      "doi": ""
    },
    {
      "text": "Huiwen Wang, Bang Xia, and Zhe Chen. 2015. Cultural diference on team performance between Chinese and Americans in multiplayer online battle arena games. In International Conference on Cross-Cultural Design. Springer, 374--383.",
      "doi": ""
    },
    {
      "text": "Robin Whittemore, Susan K Chase, and Carol Lynn Mandle. 2001. Validity in qualitative research. Qualitative health research 11, 4 (2001), 522--537.",
      "doi": ""
    },
    {
      "text": "Fiona Y Wong. 2017. Infuence of Pokémon Go on physical activity levels of university players: a cross-sectional study. International journal of health geographics 16, 1 (2017), 8.",
      "doi": ""
    },
    {
      "text": "N Yee. 2006. Life as a guild leader from the daedlus project. The Daedlus Project (2006).",
      "doi": ""
    },
    {
      "text": "Florian J Zach and Iis P Tussyadiah. 2017. To catch them all--the (un) intended consequences of Pokémon GO on mobility, consumption, and wellbeing. In Information and communication technologies in tourism 2017. Springer, 217--227.",
      "doi": ""
    }
  ]
}