{
  "doi": "10.1145/3290605.3300320",
  "title": "The Effect of Audiences on the User Experience with Conversational Interfaces in Physical Spaces",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "How does the presence of an audience influence the social interaction with a conversational system in a physical space? To answer this question, we analyzed data from an art exhibit where visitors interacted in natural language with three chatbots representing characters from a book. We performed two studies to explore the influence of audiences. In Study 1, we did fieldwork cross-analyzing the reported perception of the social interaction, the audience conditions (visitor is alone, visitor is observed by acquaintances and/or strangers), and control variables such as the visitor's familiarity with the book and gender. In Study 2, we analyzed over 5,000 conversation logs and video recordings, identifying dialogue patterns and how they correlated with the audience conditions. Some significant effects were found, suggesting that conversational systems in physical spaces should be designed based on whether other people observe the user or not.",
  "tags": [
    "audience effects",
    "conversational interfaces",
    "chatbot design"
  ],
  "authors": [
    {
      "name": "Heloisa Candello",
      "institution": "IBM Research Brazil, Sao Paulo, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442618367",
      "orcid": "missing"
    },
    {
      "name": "Claudio Pinhanez",
      "institution": "IBM Research Brazil, Sao Paulo, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100364954",
      "orcid": "missing"
    },
    {
      "name": "Mauro Pichiliani",
      "institution": "IBM Research Brazil, Sao Paulo, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387609364",
      "orcid": "missing"
    },
    {
      "name": "Paulo Cavalin",
      "institution": "IBM Research, São Paulo, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314493324",
      "orcid": "missing"
    },
    {
      "name": "Flavio Figueiredo",
      "institution": "Universidade Federal de Minas Gerais, Belo Horizonte, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447593431",
      "orcid": "missing"
    },
    {
      "name": "Marisa Vasconcelos",
      "institution": "IBM Research Brazil, Sao Paulo, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239206",
      "orcid": "missing"
    },
    {
      "name": "Haylla Do Carmo",
      "institution": "IBM Research Brazil, Sao Paulo, Brazil",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366294",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jennifer Attride-Stirling. 2001. Thematic networks: an analytic tool for qualitative research. Qualitative Research 1, 3 (2001), 385--405. arXiv:http://qrj.sagepub.com/content/1/3/385.full.pdf+html",
      "doi": ""
    },
    {
      "text": "Bambi 2019. BAyesian Model-Building Interface (BAMBI) in Python. Retrieved Jan 04, 2019 from https://github.com/bambinos/bambi",
      "doi": ""
    },
    {
      "text": "Jim Blascovich. 2002. The Social Life of Avatars. Springer-Verlag, Berlin, Heidelberg, Chapter Social Influence Within Immersive Virtual Environments, 127--145. http://dl.acm.org/citation.cfm?id=505799. ",
      "doi": "10.5555/505799.505807"
    },
    {
      "text": "Harry Brignull and Yvonne Rogers. 2003. Enticing People to Interact with Large Public Displays in Public Spaces. In INTERACT.",
      "doi": ""
    },
    {
      "text": "Jennifer L. Butler and Roy F. Baumeister. 1998. The trouble with friendly faces: skilled performance with a supportive audience. Journal of personality and social psychology 75 5 (1998), 1213--30.",
      "doi": ""
    },
    {
      "text": "Angelo Cafaro, Hannes Högni Vilhjálmsson, and Timothy Bickmore. 2016. First Impressions in Human--Agent Virtual Encounters. ACM Trans. Comput.-Hum. Interact. 23, 4, Article 24 (Aug. 2016), 40 pages.  ",
      "doi": "10.1145/2940325"
    },
    {
      "text": "Alan D. Chatham and Florian Mueller. 2013. Adding an interactive display to a public basketball hoop can motivate players and foster community. In UbiComp.  ",
      "doi": "10.1145/2493432.2493478"
    },
    {
      "text": "N. B. Cottrell, D. L. Wack, G. J. Sekerak, and R. H Rittle. 1968. Social facilitation of dominant responses by the presence of an audience and the mere presence of others. Journal of Personality and Socia Psychology 9, 3 (1968), 245--250.",
      "doi": ""
    },
    {
      "text": "Travis Cox, Marcus Carter, and Eduardo Velloso. 2016. Public DisPLAY: Social Games on Interactive Public Screens. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (OzCHI '16). ACM, New York, NY, USA, 371--380.  ",
      "doi": "10.1145/3010915.3010917"
    },
    {
      "text": "Naomi Ellemers, Cathy Dyck, Steve Hinkle, and Annelieke Jacobs. 2000. Intergroup Differentiation in Social Context: Identity Needs versus Audience Constraints. Social Psychology Quarterly 63 (04 2000), 60--74.",
      "doi": ""
    },
    {
      "text": "Katharina Emmerich and Maic Masuch. 2018. Watch Me Play: Does Social Facilitation Apply to Digital Games?. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 100, 12 pages.  ",
      "doi": "10.1145/3173574.3173674"
    },
    {
      "text": "Joseph L Fleiss, Bruce Levin, and Myunghee Cho Paik. 2003. Statistical methods for rates and proportions; 3rd ed. Wiley, Hoboken, NJ. https: //cds.cern.ch/record/1254063",
      "doi": ""
    },
    {
      "text": "Andrew Gelman and Jennifer Hill. 2006. Data Analysis Using Regression and Multilevel/Hierarchical Models (1 ed.). Cambridge University Press. http://www.amazon. com/Analysis-Regression-Multilevel-Hierarchical-Models/dp/ 052168689X/ref=sr_1_1's=books&ie=UTF8&qid=1313405184&sr= 1--1",
      "doi": ""
    },
    {
      "text": "David C. Giles. 2002. Parasocial Interaction: A Review of the Literature and a Model for Future Research. Media Psychology 4, 3 (aug 2002), 279--305.",
      "doi": ""
    },
    {
      "text": "Shang Guo, Jonathan Lenchner, Jonathan Connell, Mishal Dholakia, and Hidemasa Muta. 2017. Conversational Bootstrapping and Other Tricks of a Concierge Robot. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). ACM, New York, NY, USA, 73--81.  ",
      "doi": "10.1145/2909824.3020232"
    },
    {
      "text": "Dennis L. Kappen, Pejman Mirza-Babaei, Jens Johannsmeier, Daniel Buckstein, James Robb, and Lennart E. Nacke. 2014. Engaged by Boos and Cheers: The Effect of Co-located Game Audiences on Social Player Experience. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play (CHI PLAY '14). ACM, New York, NY, USA, 151--160.  ",
      "doi": "10.1145/2658537.2658687"
    },
    {
      "text": "Tom Kenter and Maarten de Rijke. 2015. Short Text Similarity with Word Embeddings. In Proceedings of the 24th ACM International on Conference on Information and Knowledge Management (CIKM '15). ACM, New York, NY, USA, 1411--1420.  ",
      "doi": "10.1145/2806416.2806475"
    },
    {
      "text": "E. S. Knowles. 1983. Social physics and the effects of others: Tests of the effects of audience size and distance on social judgments and behavior. J Pers Soc Psychol 45, 6 (1983), 1263--1279.",
      "doi": ""
    },
    {
      "text": "Stefan Kopp, Lars Gesellensetter, Nicole C. Krämer, and Ipke Wachsmuth. 2005. A Conversational Agent as Museum Guide -- Design and Evaluation of a Real-World Application. In Intelligent Virtual Agents, Themis Panayiotopoulos, Jonathan Gratch, Ruth Aylett, Daniel Ballin, Patrick Olivier, and Thomas Rist (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 329--343.  ",
      "doi": "10.1007/11550617_28"
    },
    {
      "text": "Nicole Krämer, Gary Bente, and Jens Piesk. 2003. The ghost in the machine. The influence of Embodied Conversational Agents on user expectations and user behaviour in a TV/VCR application1. IMC Workshop 2003, Assistance, Mobility, Applications (01 2003).",
      "doi": ""
    },
    {
      "text": "Celine Latulipe, Erin A. Carroll, and Danielle Lottridge. 2011. Love, Hate, Arousal and Engagement: Exploring Audience Responses to Performing Arts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 1845--1854.  ",
      "doi": "10.1145/1978942.1979210"
    },
    {
      "text": "S. Lloyd. 1982. Least squares quantization in PCM. IEEE Transactions on Information Theory 28, 2 (March 1982), 129--137.  ",
      "doi": "10.1109/TIT.1982.1056489"
    },
    {
      "text": "Steve Love and Mark Perry. 2004. Dealing with Mobile Conversations in Public Places: Some Implications for the Design of Socially Intrusive Technologies. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04). ACM, New York, NY, USA, 1195--1198.  ",
      "doi": "10.1145/985921.986022"
    },
    {
      "text": "Josh Lowensohn. 2015. Elon Musk: cars you can drive will eventually be outlawed. https://www.theverge.com/transportation/2015/3/17/ 8232187/elon-musk-human-drivers-are-dangerous",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. \"Like Having a Really Bad PA\": The Gulf Between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). ACM, New York, NY, USA, 5286--5297.  ",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Ulrike Luxburg. 2007. A Tutorial on Spectral Clustering. Statistics and Computing 17, 4 (Dec. 2007), 395--416.  ",
      "doi": "10.1007/s11222-007-9033-z"
    },
    {
      "text": "Bernhard Maurer, Ilhan Aslan, Martin Wuchse, Katja Neureiter, and Manfred Tscheligi. 2015. Gaze-Based Onlooker Integration: Exploring the In-Between of Active Player and Passive Spectator in Co-Located Gaming. In Proceedings of the 2015 Annual Symposium on ComputerHuman Interaction in Play (CHI PLAY '15). ACM, New York, NY, USA, 163--173.  ",
      "doi": "10.1145/2793107.2793126"
    },
    {
      "text": "J.W. Michaels, J.M. Blommel, R.M. Brocato, R.A. Linkous, and J.S Rowe. 1982. Social facilitation and inhibition in a natural setting. Replications in social psychology 2 (1982), 21--24.",
      "doi": ""
    },
    {
      "text": "Robert J. Moore, Raphael Arar, Guang-Jie Ren, and Margaret H. Szymanski. 2017. Conversational UX Design. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '17). ACM, New York, NY, USA, 492--497.  ",
      "doi": "10.1145/3027063.3027077"
    },
    {
      "text": "Masahiro Mori, Karl F. MacDorman, and Norri Kageki. 2012. The Uncanny Valley {From the Field}. IEEE Robot. Automat. Mag. 19 (2012), 98--100. The Effect of Audiences on Conversational Interfaces CHI 2019, May 4--9, 2019, Glasgow, Scotland, UK",
      "doi": ""
    },
    {
      "text": "Heather L. O'Brien and Elaine G. Toms. 2008. What is User Engagement? A Conceptual Framework for Defining User Engagement with Technology. J. Am. Soc. Inf. Sci. Technol. 59, 6 (April 2008), 938--955. ",
      "doi": "10.5555/1358262.1358271"
    },
    {
      "text": "S. Parise, S. Kiesler, L. Sproull, and K. Waters. 1999. Cooperating with life-like interface agents. Computers in Human Behavior 15, 2 (1999), 123--142.",
      "doi": ""
    },
    {
      "text": "Jeffrey Pennington, Richard Socher, and Christopher D. Manning. 2014. Glove: Global vectors for word representation. In In EMNLP.",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Moira McGregor, Barry Brown, Ewa Luger, Heloisa Candello, and Kenton O'Hara. 2017. Talking with Conversational Agents in Collaborative Action. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion). ACM, New York, NY, USA, 431--436.  ",
      "doi": "10.1145/3022198.3022666"
    },
    {
      "text": "Stuart Reeves. 2011. Designing Interfaces in Public Settings: Understanding the Role of the Spectator in Human-Computer Interaction (1st ed.). Springer Publishing Company, Incorporated. ",
      "doi": "10.5555/1963387"
    },
    {
      "text": "Stuart Reeves, Steve Benford, Claire O'Malley, and Mike Fraser. 2005. Designing the spectator experience. In CHI.  ",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Stuart Reeves, Martin Porcheron, Joel E. Fischer, Heloisa Candello, Donald McMillan, Moira McGregor, Robert J. Moore, Rein Sikveland, Alex S. Taylor, Julia Velkovska, and Moustafa Zouinar. 2018. Voicebased Conversational UX Studies and Design. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (CHI EA '18). ACM, New York, NY, USA, Article W38, 8 pages.  ",
      "doi": "10.1145/3170427.3170619"
    },
    {
      "text": "Raoul Rickenberg and Byron Reeves. 2000. The Effects of Animated Characters on Anxiety, Task Performance, and Evaluations of User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, New York, NY, USA, 49--56.  ",
      "doi": "10.1145/332040.332406"
    },
    {
      "text": "Paul W. Schermerhorn, Matthias Scheutz, and Charles R. Crowell. 2008. Robot social presence and gender: Do females view robots differently than males? 2008 3rd ACM/IEEE International Conference on HumanRobot Interaction (HRI) (2008), 263--270.  ",
      "doi": "10.1145/1349822.1349857"
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. \"Hey Alexa, What's Up?\": A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 857--868.  ",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "John Short, Ederyn Williams, and Bruce Christie. 1976. The Social Psychology of Telecommunications. John Wiley and Sons Ltd.",
      "doi": ""
    },
    {
      "text": "spaCy 2019. spaCy. Retrieved Jan 04, 2019 from http://spacy.io",
      "doi": ""
    },
    {
      "text": "Lee Sproull, Mani Subramani, Sara Kiesler, Janet H. Walker, and Keith Waters. 1996. When the Interface is a Face. Hum.-Comput. Interact. 11, 2 (June 1996), 97--124.  ",
      "doi": "10.1207/s15327051hci1102_1"
    },
    {
      "text": "Megan Strait, Lara Vujovic, Victoria Floerke, Matthias Scheutz, and Heather L. Urry. 2015. Too Much Humanness for Human-Robot Interaction: Exposure to Highly Humanlike Robots Elicits Aversive Responding in Observers. In CHI.  ",
      "doi": "10.1145/2702123.2702415"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1994. Grounded theory methodology. In Handbook of qualitative research. 273--285.",
      "doi": ""
    },
    {
      "text": "Yee Whye Teh, Michael I. Jordan, Matthew J. Beal, and David M. Blei. 2004. Sharing Clusters among Related Groups: Hierarchical Dirichlet Processes. In NIPS. ",
      "doi": "10.5555/2976040.2976214"
    },
    {
      "text": "Jane Webster and Hayes Ho. 1997. Audience Engagement in Multimedia Presentations. SIGMIS Database 28, 2 (April 1997), 63--77.  ",
      "doi": "10.1145/264701.264706"
    },
    {
      "text": "Tom White and David Small. 1998. An Interactive Poetic Garden. In CHI 98 Conference Summary on Human Factors in Computing Systems (CHI '98). ACM, New York, NY, USA, 335--336.  ",
      "doi": "10.1145/286498.286804"
    },
    {
      "text": "Laura K. Wolf, Narges Bazargani, Emma J. Kilford, Iroise Dumontheil, and S J Blakemore. 2015. The audience effect in adolescence depends on who's looking over your shoulder. In Journal of adolescence.",
      "doi": ""
    },
    {
      "text": "Sarah Woods, Kerstin Dautenhahn, and Christina Kaouri. 2005. Is someone watching me? - consideration of social facilitation effects in human-robot interaction experiments. In CIRA. IEEE, 53--60.",
      "doi": ""
    }
  ]
}