{
  "doi": "10.1145/3290605.3300471",
  "title": "Virtual Hubs: Understanding Relational Aspects and Remediating Incubation",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "We have recently seen the emergence of new platforms that aim to provide remotely located entrepreneurs and startup companies with support analogous to that found within traditional incubation or acceleration spaces. This paper offers an understanding of these 'virtual hubs', and the inherently socio-technical interactions that occur between their members. Our study analyzes a sample of existing virtual hubs in two stages. First, we contribute broader insight into the current landscape of virtual hubs by documenting and categorizing 25 hubs regarding their form, support offered and a selection of further qualities. Second, we contribute detailed insight into the operation and experience of such hubs, from an analysis of 10 semi-structured interviews with organizers and participants of virtual hubs. We conclude by analyzing our findings in terms of relational aspects of non-virtual hubs from the literature and remediation theory, and propose opportunities for advancing the design of such platforms.",
  "tags": [
    "remediation",
    "relational aspects",
    "incubators and accelerators",
    "digital incubation",
    "virtual hubs"
  ],
  "authors": [
    {
      "name": "Jandy Luik",
      "institution": "University of York & Petra Christian University, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659276655",
      "orcid": "missing"
    },
    {
      "name": "Jenna Ng",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659276507",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Hook",
      "institution": "University of York, York, United Kingdom",
      "img": "/do/10.1145/contrib-81416594009/rel-imgonly/jonhook_florence.jpg",
      "acmid": "81416594009",
      "orcid": "0000-0002-0588-7013"
    }
  ],
  "references": [
    {
      "text": "Ban Al-Ani, Matthew J. Bietz, Yi Wang, Erik Trainer, Benjamin Koehne, Sabrina Marczak, David Redmiles, and Rafael Prikladnicki. 2013. Globally Distributed System Developers: Their Trust Expectations and Processes. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (CSCW '13). ACM, New York, NY, USA, 563--574.  ",
      "doi": "10.1145/2441776.2441840"
    },
    {
      "text": "A. Anderson, J. Park, and S. Jack. 2007. Entrepreneurial Social Capital: Conceptualizing Social Capital in New High-tech Firms. International Small Business Journal 25, 3 (2007), 245--272.",
      "doi": ""
    },
    {
      "text": "Jay David Bolter and Richard Grusin. 2000. Remediation: Understanding New Media. MIT Press.",
      "doi": "10.5555/298574"
    },
    {
      "text": "Jonathan Bone, Olivia Allen, and Christopher Halley. 2017. Business Incubator and Accelerator: UK Directory. https://www.gov.uk/government/publications/ business-incubators-and-accelerators-the-national-picture",
      "doi": ""
    },
    {
      "text": "Jonathan Bone, Olivia Allen, and Christopher Halley. 2017. Business Incubator and Accelerators: The National Picture. Technical Report. NESTA and Department for Business, Energy and Industrial Strategy UK. 76 pages. https://assets.publishing.service.gov.uk/ government/uploads/system/uploads/attachment_data/file/608409/ business-incubators-accelerators-uk-report.pdf",
      "doi": ""
    },
    {
      "text": "Erin Bradner and Gloria Mark. 2002. Why Distance Matters: Effects on Cooperation, Persuasion and Deception. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work (CSCW '02). ACM, New York, NY, USA, 226--235.  ",
      "doi": "10.1145/587078.587110"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology Using thematic analysis in psychology. Qualitative Research in Psychology ISSN: 3, 2 (2006), 77--101.",
      "doi": ""
    },
    {
      "text": "Johan Bruneel, Tiago Ratinho, Bart Clarysse, and Aard Groen. 2011. The Evolution of Business Incubators: Comparing demand and supply of business incubation services across different incubator generations. Technovation 32 (2011), 110--121.",
      "doi": ""
    },
    {
      "text": "Susan Cohen. 2013. What Do Accelerators Do? Insights from Incubators and Angels. Innovations: Technology, Governance, Globalization 8, 3--4 (2013), 19--25.",
      "doi": ""
    },
    {
      "text": "ECHN European Creative Hubs Network. 2016. Find a Hub. https: //www.creativehubs.eu/network/",
      "doi": ""
    },
    {
      "text": "Geraldine Fitzpatrick, Simon Kaplan, and Tim Mansfield. 1996. Physical Spaces, Virtual Places and Social Worlds: A Study of Work in the Virtual. In Proceedings of the 1996 ACM Conference on Computer Supported Cooperative Work (CSCW '96). ACM, New York, NY, USA, 334--343.  ",
      "doi": "10.1145/240080.240322"
    },
    {
      "text": "Hackateam. 2019. Hackateam - Online Hackathons. http://www. hackateam.com",
      "doi": ""
    },
    {
      "text": "Mads Møller Jensen, Roman Rädle, Clemens N. Klokmose, and Susanne Bodker. 2018. Remediating a Design Tool: Implications of Digitizing Sticky Notes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, Article 224, 12 pages.  ",
      "doi": "10.1145/3173574.3173798"
    },
    {
      "text": "Leah A. Lievrouw. 2006. Oppositional and Activist New Media: Remediation, Reconfiguration, Participation. In Proceedings of the Ninth Conference on Participatory Design: Expanding Boundaries in Design - Volume 1 (PDC '06). ACM, New York, NY, USA, 115--124.  ",
      "doi": "10.1145/1147261.1147279"
    },
    {
      "text": "Bou-Wen Lin, Po-Chien Li, and Ja-Shen Chen. 2006. Social capital, capabilities, and entrepreneurial strategies: a study of Taiwanese hightech new ventures. Technological Forecasting and Social Change 73, 2 (2006), 168--181. CHI 2019, May 4--9, 2019, Glasgow, Scotland UK Luik, Ng & Hook",
      "doi": ""
    },
    {
      "text": "Thomas James Lodato and Carl DiSalvo. 2015. Issue-oriented hackathons as material participation. New Media and Society 18, 4 (2015), 539--557.",
      "doi": ""
    },
    {
      "text": "Jandy Luik, Jenna Ng, and Jonathan Hook. 2018. \"More Than Just Space\": Designing to Support Assemblage in Virtual Creative Hubs. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS '18). ACM, New York, NY, USA, 1269--1281.  ",
      "doi": "10.1145/3196709.3196758"
    },
    {
      "text": "Lev Manovich. 2001. The Language of New Media. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Marshall McLuhan. 1964. Understanding Media: The extensions of man. Routledge, London. 382 pages.",
      "doi": ""
    },
    {
      "text": "Sarfraz Mian, Wadid Lamine, and Alain Fayolle. 2016. Technology Business Incubation: An overview of the state of knowledge. Technovation 50--51 (2016), 1--12.",
      "doi": ""
    },
    {
      "text": "Paul Miller and Kirsten Bound. 2011. The Startup Factories: The rise of accelerator programmes to support new technology ventures. Technical Report June. NESTA UK, London. 40 pages. arXiv:arXiv:1011.1669v3 www.nesta.org.uk",
      "doi": ""
    },
    {
      "text": "Simon Mosey and Mike Wright. 2007. From human capital to social capital: A longitudinal study of technology-based academic entrepreneurs. Entrepreneurship: Theory and Practice 31, 6 (2007), 909--935.",
      "doi": ""
    },
    {
      "text": "Michael J Nowak and Charles E Grantham. 2000. The virtual incubator: managing human capital in the software industry. Research Policy 29 (2000), 125--134.",
      "doi": ""
    },
    {
      "text": "OpenMovement. {n. d.}. Hubs. http://movement.open.co/hubs",
      "doi": ""
    },
    {
      "text": "Hassan Syed. 2017. Global List of Virtual Business Incubators. https: //ideagist.com/global-list-virtual-business-incubators/",
      "doi": ""
    },
    {
      "text": "Lisa Thomas, Pam Briggs, Finola Kerrigan, and Andrew Hart. 2018. Exploring digital remediation in support of personal reflection. International Journal of Human Computer Studies 110, October 2017 (2018), 53--62.  ",
      "doi": "10.1016/j.ijhcs.2017.10.002"
    },
    {
      "text": "Henrik Tötterman and Jan Sten. 2005. Start-ups: Business Incubation and Social Capital. International Small Business Journal 23, 5 (2005), 487--511.",
      "doi": ""
    },
    {
      "text": "Erik H. Trainer, Arun Kalyanasundaram, Chalalai Chaihirunkarn, and James D. Herbsleb. 2016. How to Hackathon: Socio-technical Tradeoffs in Brief, Intensive Collocation. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW '16). ACM, New York, NY, USA, 1118--1130.  ",
      "doi": "10.1145/2818048.2819946"
    }
  ]
}