{
  "doi": "10.1145/3290605.3300423",
  "title": "A Lie Reveals the Truth: Quasimodes for Task-Aligned Data Presentation",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2019,
  "badges": [],
  "abstract": "Designers are often discouraged from creating data visualizations that omit or distort information, because they can easily be misleading. However, the same representations that could be used to deceive can provide benefits when chosen to appropriately align with user tasks. We present an interaction technique, Perceptual Glimpses, which allows for the transparent presentation of so-called 'deceptive' views of information that are made temporary using quasimodes. When presented using Perceptual Glimpses, message-level exaggeration caused by a truncated axis on a bar chart was reduced under some conditions, but users require guidance to avoid errors, and view presentation order may affect trust. When Perceptual Glimpses was extended to display a range of views that might otherwise be deceptive or difficult to understand if shown out of context, users were able to understand and leverage these transformations to perform a range of low-level tasks. Design recommendations and examples suggest extensions of the technique.",
  "authors": [
    {
      "name": "Jacob Ritchie",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367118",
      "orcid": "missing"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    },
    {
      "name": "Fanny Chevalier",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81325488036",
      "orcid": "0000-0002-5585-7971"
    }
  ],
  "references": [
    {
      "text": "Maneesh Agrawala and Chris Stolte. 2001. Rendering Effective Route Maps. In Proceedings of the 28th Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '01). ACM, New York, NY, USA, 241--249.  ",
      "doi": "10.1145/383259.383286"
    },
    {
      "text": "Robert Amar, James Eagan, and John Stasko. 2005. Low-Level Components of Analytic Activity in Information Visualization. In Proceedings of the 2005 IEEE Symposium on Information Visualization (InfoVis '05). IEEE, 15--15.  ",
      "doi": "10.1109/INFOVIS.2005.24"
    },
    {
      "text": "Apple. 2018. Global Apple iPhone sales from 3rd quarter 2007 to 3rd quarter 2018 (in million units). https://www.statista.com/statistics/ 263401/global-apple-iphone-sales-since-3rd-quarter-2007/",
      "doi": ""
    },
    {
      "text": "Daniel Asimov. 1985. The Grand Tour: A Tool for Viewing Multidimensional Data. SIAM J. Sci. Statist. Comput. 6, 1 (Jan. 1985), 128--143.  ",
      "doi": "10.1137/0906011"
    },
    {
      "text": "Jeff Avery, Sylvain Malacria, Mathieu Nancel, Géry Casiez, and Edward Lank. 2018. Introducing Transient Gestures to Improve Pan and Zoom on Touch Surfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 25:1--25:8.  ",
      "doi": "10.1145/3173574.3173599"
    },
    {
      "text": "Nick Bansback, Linda C. Li, Larry Lynd, and Stirling Bryan. 2014. Exploiting Order Effects to Improve the Quality of Decisions. Patient Educ. Couns. 96, 2 (Aug. 2014), 197--203.",
      "doi": ""
    },
    {
      "text": "Richard A. Becker and William S. Cleveland. 1987. Brushing Scatterplots. Technometrics 29, 2 (May 1987), 127.  ",
      "doi": "10.2307/1269768"
    },
    {
      "text": "David Borland and Russell M. Taylor II. 2007. Rainbow Color Map (Still) Considered Harmful. IEEE Comput. Graph. Appl. 27, 2 (Mar. 2007), 14--17.  ",
      "doi": "10.1109/MCG.2007.323435"
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 DataDriven Documents. IEEE Trans. Vis. Comput. Graph. 17, 12 (Dec. 2011), 2301--2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Jeremy Boy, Louis Eveillard, Françoise Detienne, and Jean-Daniel Fekete. 2016. Suggested Interactivity: Seeking Perceived Affordances for Information Visualization. IEEE Trans. Vis. Comput. Graph. 22, 1 (Jan. 2016), 639--648.",
      "doi": "10.1109/TVCG.2015.2467201"
    },
    {
      "text": "Jeremy Boy, Ronald A. Rensink, Enrico Bertini, and Jean-Daniel Fekete. 2014. A Principled Way of Assessing Visualization Literacy. IEEE Trans. Vis. Comput. Graph. 20, 12 (Dec. 2014), 1963--1972.",
      "doi": ""
    },
    {
      "text": "David V. Budescu and Thomas S. Wallsten. 1985. Consistency in Interpretation of Probabilistic Phrases. Organ. Behav. Hum. Decis. Process. 36, 3 (Dec. 1985), 391--405.",
      "doi": ""
    },
    {
      "text": "Bill Buxton. {n. d.}. Bill Buxton's Home Page. https://www.billbuxton. com/",
      "doi": ""
    },
    {
      "text": "Dana R. Carney and Mahzarin R. Banaji. 2012. First is best. PLoS One 7, 6 (Jun. 2012), e35088.",
      "doi": ""
    },
    {
      "text": "Sheelagh Carpendale, Nicholas Diakopoulos, Nathalie Henry Riche, and Christophe Hurter. 2016. Data-Driven Storytelling (Dagstuhl Seminar 16061). Dagstuhl Reports 6, 2 (2016), 1--27.",
      "doi": ""
    },
    {
      "text": "William S. Cleveland, Persi Diaconis, and Robert McGill. 1982. Variables on scatterplots look more highly correlated when the scales are increased. Science 216, 4550 (Jun. 1982), 1138--1141.",
      "doi": ""
    },
    {
      "text": "William S. Cleveland and Robert McGill. 1984. Graphical Perception: Theory, Experimentation, and Application to the Development of Graphical Methods. J. Am. Stat. Assoc. 79, 387 (Sep. 1984), 531--554.",
      "doi": ""
    },
    {
      "text": "Michael Correll and Michael Gleicher. 2014. Bad for Data, Good for the Brain: Knowledge-First Axioms For Visualization Design. In Proceedings of the 1st Workshop on Dealing with Cognitive Biases in Visualisations (DECISIVe '14).",
      "doi": ""
    },
    {
      "text": "Michael Correll and Jeffrey Heer. 2017. Black Hat Visualization. In Proceedings of the 2nd Workshop on Dealing with Cognitive Biases in Visualisations (DECISIVe '17).",
      "doi": ""
    },
    {
      "text": "Gabriel Dance, Andrew DeVigal, Steve Duenes, Matthew Ericson, and Aron Pilhofer. 2009. Talk to the Newsroom: Interactive News Collaborative. https://www.nytimes.com/2009/01/19/business/media/ 19askthetimes.html",
      "doi": ""
    },
    {
      "text": "Evanthia Dimara, Anastasia Bezerianos, and Pierre Dragicevic. 2017. The Attraction Effect in Information Visualization. IEEE Trans. Vis. Comput. Graph. 23, 1 (Jan. 2017), 471--480.  ",
      "doi": "10.1109/TVCG.2016.2598594"
    },
    {
      "text": "Pierre Dragicevic, Anastasia Bezerianos, Waqas Javed, Niklas Elmqvist, and Jean-Daniel Fekete. 2011. Temporal Distortion for Animated Transitions. In Proceedings of the 2011 CHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2009.  ",
      "doi": "10.1145/1978942.1979233"
    },
    {
      "text": "Steven M. Drucker, Danyel Fisher, Ramik Sadana, Jessica Herron, and m.c. Schraefel. 2013. TouchViz: A Case Study Comparing Two Interfaces for Data Analytics on Tablets. In Proceedings of the 2013 Conference on Human Factors in Computing Systems (CHI '13). ACM, New York, NY, USA, 2301--2310.  ",
      "doi": "10.1145/2470654.2481318"
    },
    {
      "text": "Niklas Elmqvist, Pierre Dragicevic, and Jean-Daniel Fekete. 2008. Rolling the Dice: Multidimensional Visual Exploration using Scatterplot Matrix Navigation. IEEE Trans. Vis. Comput. Graph. 14, 6 (Nov. 2008), 1539--1148.",
      "doi": ""
    },
    {
      "text": "Liana Fraenkel, Marilyn Stolar, Sarah Swift, Richard L. Street, Harjinder Chowdhary, Ellen Peters, and Ellen Peters. 2017. Subjective Numeracy and the Influence of Order and Amount of Audible Information on Perceived Medication Value. Med. Decis. Making. 37, 3 (Apr. 2017), 230--238.",
      "doi": ""
    },
    {
      "text": "Michael Gleicher, Danielle Albers, Rick Walker, Ilir Jusufi, Charles D. Hansen, and Jonathan C. Roberts. 2011. Visual Comparison for Information Visualization. Inf. Vis. 10, 4 (Oct. 2011), 289--309.  ",
      "doi": "10.1177/1473871611416549"
    },
    {
      "text": "Lane Harrison, Fumeng Yang, Steven Franconeri, and Remco Chang. 2014. Ranking Visualizations of Correlation Using Weber's Law. IEEE Trans. Vis. Comput. Graph. 20, 12 (Dec. 2014), 1943--1952.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and George Robertson. 2007. Animated Transitions in Statistical Data Graphics. IEEE Trans. Vis. Comput. Graph. 13, 6 (Nov. 2007), 1240--1247.  ",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "Darrell Huff and Irving Geis. 1993. How to Lie With Statistics. W. W. Norton & Company. ",
      "doi": "10.5555/1098683"
    },
    {
      "text": "Jaemin Jo, Sehi L'Yi, Bongshin Lee, and Jinwook Seo. 2017. TouchPivot: Blending WIMP & Post-WIMP Interfaces for Data Exploration on Tablet Devices. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). ACM, New York, NY, USA, 2660--2671.  ",
      "doi": "10.1145/3025453.3025752"
    },
    {
      "text": "Ha-Kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2018. Frames and Slants in Titles of Visualizations on Controversial Topics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). ACM, New York, NY, USA, 438:1--438:12.  ",
      "doi": "10.1145/3173574.3174012"
    },
    {
      "text": "Robert Kosara. 2016. Presentation-Oriented Visualization Techniques. IEEE Comput. Graph. Appl. 36, 1 (Jan. 2016), 80--85.",
      "doi": "10.1109/MCG.2016.2"
    },
    {
      "text": "Bongshin Lee, Nathalie Henry Riche, Petra Isenberg, and Sheelagh Carpendale. 2015. More Than Telling a Story: Transforming Data into Visually Shared Stories. IEEE Comput. Graph. Appl. (2015).",
      "doi": ""
    },
    {
      "text": "Charles G. Lord, Mark R. Lepper, and Elizabeth Preston. 1984. Considering the Opposite: A Corrective Strategy for Social Judgment. J. Pers. Soc. Psychol 47, 6 (Dec. 1984), 1231--43.",
      "doi": ""
    },
    {
      "text": "Mathworks. {n. d.}. MATLAB. https://www.mathworks.com/products/ matlab.html",
      "doi": ""
    },
    {
      "text": "Hrim Mehta, Amira Chalbi, Fanny Chevalier, and and Christopher Collins. 2017. DataTours: A Data Narratives Framework. In Proceedings of the 2017 IEEE Conference on Information Visualization (InfoVis '17), Posters. IEEE.",
      "doi": ""
    },
    {
      "text": "Microsoft. {n. d.}. Microsoft Excel. https://products.office.com/en-us/ excel",
      "doi": ""
    },
    {
      "text": "Mark S. Monmonier. 1996. How to Lie with Maps (1 ed.). University of Chicago Press, Chicago, IL, USA. 222 pages.",
      "doi": ""
    },
    {
      "text": "Thomas Mussweiler, Fritz Strack, and Tim Pfeiffer. 2000. Overcoming the Inevitable Anchoring Effect: Considering the Opposite Compensates for Selective Accessibility. Pers. Soc. Psychol. Bull. 26, 9 (Sep. 2000), 1142--1150.",
      "doi": ""
    },
    {
      "text": "Shaun O'Brien and Claire Lauer. 2018. Testing the Susceptibility of Users to Deceptive Data Visualizations When Paired with Explanatory Text. In Proceedings of the 36th ACM International Conference on the Design of Communication (SIGDOC '18). ACM, New York, New York, USA, 1--8.  ",
      "doi": "10.1145/3233756.3233961"
    },
    {
      "text": "Daniel Orban, Daniel F. Keefe, Ayan Biswas, James Ahrens, and David Rogers. 2018. Drag and Track: A Direct Manipulation Interface for Contextualizing Data Instances within a Continuous Parameter Space. IEEE Trans. Vis. Comput. Graph. (Aug. 2018), 1--1.",
      "doi": ""
    },
    {
      "text": "Anshul Vikram Pandey, Anjali Manivannan, Oded Nov, Margaret Satterthwaite, and Enrico Bertini. 2014. The Persuasive Power of Data Visualization. IEEE Trans. Vis. Comput. Graph. 20, 12 (Dec. 2014), 2211--2220.",
      "doi": ""
    },
    {
      "text": "Anshul Vikram Pandey, Katharina Rall, Margaret L. Satterthwaite, Oded Nov, and Enrico Bertini. 2015. How Deceptive are Deceptive Visualizations?: An Empirical Analysis of Common Distortion Techniques. In Proceedings of the 2015 Conference on Human Factors in Computing Systems (CHI '15). ACM, 1469--1478.  ",
      "doi": "10.1145/2702123.2702608"
    },
    {
      "text": "Richard Petty and John Cacioppo. 1986. Communication and Persuasion: Central and Peripheral Routes to Attitude Change (1 ed.). SpringerVerlag, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Jef Raskin. 2000. The Humane Interface : New Directions for Designing Interactive Systems. Addison-Wesley, New York, NY, USA. 233 pages. https://dl.acm.org/citation.cfm?id=333103 ",
      "doi": "10.5555/333103"
    },
    {
      "text": "Jonathan C. Roberts. 2007. State of the Art: Coordinated & Multiple Views in Exploratory Visualization. In Proceedings of the 5th International Conference on Coordinated and Multiple Views in Exploratory Visualization (CMV '07). IEEE, 61--71.  ",
      "doi": "10.1109/CMV.2007.20"
    },
    {
      "text": "Bernice E. Rogowitz, Lloyd A. Treinish, and Steve Bryson. 1996. How Not to Lie with Visualization. Comput. Phys. 10, 3 (May 1996), 268.  ",
      "doi": "10.1063/1.4822401"
    },
    {
      "text": "Ramik Sadana and John Stasko. 2016. Expanding Selection for Information Visualization Systems on Tablet Devices. In Proceedings of the 2016 Conference on Interactive Surfaces and Spaces (ISS '16). ACM, New York, NY, USA, 149--158.  ",
      "doi": "10.1145/2992154.2992157"
    },
    {
      "text": "Abigail J. Sellen, Gordon P. Kurtenbach, and William A. S. Buxton. 1992. The Prevention of Mode Errors Through Sensory Feedback. Hum. Comput. Int. 7, 2 (Jun. 1992), 141--164.  ",
      "doi": "10.1207/s15327051hci0702_1"
    },
    {
      "text": "Ben Shneiderman. 1996. The Eyes Have It: A Task by Data Type Taxonomy for Information Visualizations. In Proceedings of the 1996 IEEE Symposium on Visual Languages (VL '96). IEEE, 336--343. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "Tableau Software. {n. d.}. Tableau. https://www.tableau.com/products",
      "doi": ""
    },
    {
      "text": "Justin Talbot, Vidya Setlur, and Anushka Anand. 2014. Four Experiments on the Perception of Bar Charts. IEEE Trans. Vis. Comput. Graph. 20, 12 (Dec. 2014), 2152--2160.",
      "doi": ""
    },
    {
      "text": "Christian Tominski, Camilla Forsell, and Jimmy Johansson. 2012. Interaction Support for Visual Comparison Inspired by Natural Behavior. IEEE Trans. Vis. Comput. Graph. 18, 12 (Dec. 2012), 2719--2728.  ",
      "doi": "10.1109/TVCG.2012.237"
    },
    {
      "text": "Edward R. Tufte. 1983. The Visual Display of Quantitative Information. Graphics Press, Cheshire, CT, USA. ",
      "doi": "10.5555/33404"
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1974. Judgement under Uncertainty: Heuristics and Biases. Science 185, 4157 (Sep. 1974), 1124--1131.",
      "doi": ""
    },
    {
      "text": "Barabara Tversky, Julie Bauer Morrison, and Mireille Betrancourt. 2002. Animation: Can it Facilitate? Int. J. Hum. Comput. Stud. (Oct. 2002).  ",
      "doi": "10.1006/ijhc.2002.1017"
    },
    {
      "text": "US Department of Agriculture. 2018. Production of soybeans in the U.S. from 2000 to 2017 (in 1,000 bushels). https://www.statista.com/statistics/192058/production-of-soybeans-for-beans-in-the-us-since-2000/",
      "doi": ""
    },
    {
      "text": "US Department of Agriculture & Economic Research Service. 2018. Major countries of destination for U.S. soybean exports in 2016 (in million metric tons). https://www.statista.com/statistics/192081/ us-soybean-exports-by-major-countries-of-destination/",
      "doi": ""
    },
    {
      "text": "Andre Calero Valdez, Martina Ziefle, and Michael Sedlmair. 2018. Priming and Anchoring Effects in Visualization. IEEE Trans. Vis. Comput. Graph. 24, 1 (Jan. 2018), 584--594.",
      "doi": ""
    },
    {
      "text": "Elisabeth Kersten van Dijk, Wijnand IJsselsteijn, and Joyce Westerink. 2016. Deceptive Visualizations and User Bias: A Case for Personalization and Ambiguity in PI Visualizations. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp '16). ACM, New York, NY, USA, 588--593.  ",
      "doi": "10.1145/2968219.2968326"
    },
    {
      "text": "Colin Ware. 2012. Information Visualization: Perception for Design. Elsevier. ",
      "doi": "10.5555/2285540"
    },
    {
      "text": "David Yanofsky. 2015. It's OK not to Start your Y-Axis at Zero. https: //qz.com/418083/its-ok-not-to-start-your-y-axis-at-zero/",
      "doi": ""
    },
    {
      "text": "Li Yu, Aidong Lu, William Ribarsky, and Wei Chen. 2010. Automatic Animation for Time-Varying Data Visualization. Computer Graphics Forum 29, 7 (Sep. 2010), 2271--2280.",
      "doi": ""
    }
  ]
}