{
  "doi": "10.1145/3290605.3300250",
  "title": "Making Sense of Art: Access for Gallery Visitors with Vision Impairments",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2019,
  "badges": [],
  "abstract": "While there is widespread recognition of the need to provide people with vision impairments (PVI) equitable access to cultural institutions such as art galleries, this is not easy. We present the results of a collaboration with a regional art gallery who wished to open their collection to PVIs in the local community. We describe a novel model that provides three different ways of accessing the gallery, depending upon visual acuity and mobility: virtual tours, self-guided tours and guided tours. As far as possible the model supports autonomous exploration by PVIs. It was informed by a value sensitive design exploration of the values and value conflicts of the primary stakeholders.",
  "tags": [
    "art",
    "vision impairment",
    "value sensitive design",
    "accessibility",
    "3d printing",
    "blindness"
  ],
  "authors": [
    {
      "name": "Leona Holloway",
      "institution": "Monash University, Caulfield East, Victoria, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260925",
      "orcid": "0000-0001-9200-5164"
    },
    {
      "name": "Kim Marriott",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320492504",
      "orcid": "0000-0002-9813-0377"
    },
    {
      "name": "Matthew Butler",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508687882",
      "orcid": "0000-0002-7950-5495"
    },
    {
      "name": "Alan Borning",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100164129/rel-imgonly/alan.jpg",
      "acmid": "81100164129",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Giorgos Anagnostakis, Michalis Antoniou, Elena Kardamitsi, Thodoris Sachinidis, Panayiotis Koutsabasis, Modestos Stavrakis, Spyros Vosinakis, and Dimitris Zissis. 2016. Accessible museum collections for the visually impaired: Combining tactile exploration, audio descriptions and mobile gestures. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI) Adjunct. ACM, 1021--1025.  ",
      "doi": "10.1145/2957265.2963118"
    },
    {
      "text": "Vassilios S. Argyropoulos and Charikleia Kanari. 2015. Re-imagining the museum through touch': Reflections of individuals with visual disability on their experience of museum-visiting in Greece. ALTER-European Journal of Disability Research/Revue Européenne de Recherche sur le Handicap 9, 2 (2015), 130--143.",
      "doi": ""
    },
    {
      "text": "Saki Asakawa, João Guerreiro, Dragan Ahmetovic, Kris M. Kitani, and Chieko Asakawa. 2018. The present and future of museum accessibility for people with visual impairments. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 382--384.  ",
      "doi": "10.1145/3234695.3240997"
    },
    {
      "text": "Elisabeth Salzhauer Axel and Paula L. Gerson. 2000. Art History Through Touch and Sound: A Multisensory Guide for the Blind and Visually Impaired. OpticalTouch Systems Publishers.",
      "doi": ""
    },
    {
      "text": "Elisabeth Salzhauer Axel, Virginia Hooper, Teresa Kardoulias, Sarah Stephenson Keyes, and Francesca Rosenberg). {n. d.}. ABS's Guidelines for Verbal Description. http://www.artbeyondsight.org/ handbook/acs-guidelines.shtml.",
      "doi": ""
    },
    {
      "text": "Elisabeth Salzhauer Axel and Nina Sobol Levent. 2003. Art Beyond Sight: A Resource Guide to Art, Creativity, and Visual Impairment. American Foundation for the Blind.",
      "doi": ""
    },
    {
      "text": "David Bearman. 2011. 3D representations in museums. Curator: The Museum Journal 54, 1 (2011), 55--61.",
      "doi": ""
    },
    {
      "text": "Jens Bornschein, Denise Bornschein, and Gerhard Weber. 2018. Comparing computer-based drawing methods for blind people with realtime tactile feedback. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM.  ",
      "doi": "10.1145/3173574.3173689"
    },
    {
      "text": "Braille Authority of North America. 2010. Guidelines and Standards for Tactile Graphics. The Braille Authority of North America. http: //www.brailleauthority.org/tg/web-manual/index.html",
      "doi": ""
    },
    {
      "text": "Lorna M. Brown and Stephen A. Brewster. 2003. Drawing by ear: Interpreting sonified line graphs. In Proceedings International Conference on Auditory Display (ICAD). 152--156.",
      "doi": ""
    },
    {
      "text": "Emeline Brule, Gilles Bailly, Anke Brock, Frédéric Valentin, Grégoire Denis, and Christophe Jouffrais. 2016. MapSense: Multi-sensory interactive maps for children living with visual impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 445--457.  ",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Fiona Candlin. 2003. Blindness, art and exclusion in museums and galleries. International Journal of Art & Design Education 22, 1 (2003), 100--110.",
      "doi": ""
    },
    {
      "text": "Fiona Candlin. 2004. Don't touch! Hands off! Art, blindness and the conservation of expertise. Body & Society 10, 1 (2004), 71--90.",
      "doi": ""
    },
    {
      "text": "Fiona Candlin. 2006. The dubious inheritance of touch: Art history and museum access. Journal of Visual Culture 5, 2 (2006), 137--154.",
      "doi": ""
    },
    {
      "text": "Fiona Candlin. 2010. Art, Museums and Touch. Manchester University Press.",
      "doi": ""
    },
    {
      "text": "Virginio Cantoni, Luca Lombardi, Alessandra Setti, Stanislav Gyoshev, Dimitar Karastoyanov, and Nikolay Stoimenov. 2018. Art masterpieces accessibility for blind and visually impaired people. In International Conference on Computers Helping People with Special Needs. Springer, 267--274.",
      "doi": ""
    },
    {
      "text": "Sofia Cavaco, J. Tomas Henriques, Michele Mengucci, Nuno Correia, and Francisco Medeiros. 2013. Color sonification for the visually impaired. Procedia Technology 9 (2013), 1048--1057.",
      "doi": ""
    },
    {
      "text": "Benjamin K. Davison. 2012. Evaluating auditory graphs with blind students in a classroom. ACM SIGACCESS Accessibility and Computing 102 (2012), 4--7.  ",
      "doi": "10.1145/2140446.2140447"
    },
    {
      "text": "Karin De Coster and Gerrit Loots. 2004. Somewhere in between touch and vision: In search of a meaningful art education for blind individuals. International Journal of Art & Design Education 23, 3 (2004), 326--334.",
      "doi": ""
    },
    {
      "text": "Fondation de France/International Council of Museums. 1991. Museums Without Barriers: A New Deal for Disabled People. Routledge.",
      "doi": ""
    },
    {
      "text": "Harriet Dunn. 2018. Comment from the field: Facilitating art access for people with visual impairment. Journal of Literary & Cultural Disability Studies 12, 2 (2018), 245--247.",
      "doi": ""
    },
    {
      "text": "Alexander Fiannaca, Ilias Apostolopoulous, and Eelke Folmer. 2014. Headlock: A wearable navigation aid that helps blind cane users traverse large open spaces. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility. ACM, 19--26.  ",
      "doi": "10.1145/2661334.2661453"
    },
    {
      "text": "Euan Freeman, Graham Wilson, Stephen Brewster, Gabriel Baud-Bovy, Charlotte Magnusson, and Hector Caltenco. 2017. Audible beacons and wearables in schools: Helping young visually impaired children play and move independently. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4146--4157.  ",
      "doi": "10.1145/3025453.3025518"
    },
    {
      "text": "Batya Friedman, David G. Hendry, and Alan Borning. 2017. A survey of value sensitive design methods. Foundations and Trends® in Human-- Computer Interaction 11, 2 (2017), 63--125.  ",
      "doi": "10.1561/1100000015"
    },
    {
      "text": "Batya Friedman, Peter H. Kahn, and Alan Borning. 2006. Value sensitive design and information systems. In Human-Computer Interaction in Management Information Systems: Foundations. Sharpe, 348--372.",
      "doi": ""
    },
    {
      "text": "Rocco Furferi, Lapo Governi, Yary Volpe, Luca Puggelli, Niccolò Vanni, and Monica Carfagni. 2014. From 2D to 2.5 D i.e. from painting to tactile model. Graphical Models 76, 6 (2014), 706--723.  ",
      "doi": "10.1016/j.gmod.2014.10.001"
    },
    {
      "text": "Kozue Handa, Hitoshi Dairoku, and Yoshiko Toriyama. 2010. Investigation of priority needs in terms of museum service accessibility for visually impaired visitors. British Journal of Visual Impairment 28, 3 (2010), 221--234.",
      "doi": ""
    },
    {
      "text": "Gretchen Henrich, Felice Q Cleveland, and Emily Wolverton. 2014. Case studies from three museums in Art Beyond Sight's multi-site museum accessibility study. Museums & Social Issues 9, 2 (2014), 124-- 143.",
      "doi": ""
    },
    {
      "text": "Ronald A. Hinton. 1991. Use of tactile pictures to communicate the work of visual artists to blind people. Journal of Visual Impairment & Blindness 85, 4 (1991), 174--175.",
      "doi": ""
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible maps for the blind: Comparing 3D printed models with tactile graphics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 198.  ",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "Finn Kensing and Kim Halskov Madsen. 1991. Generating visions: Future workshops and metaphorical design. In Design at work: Cooperative design of computer systems. L. Erlbaum Associates Inc., 155--168. ",
      "doi": "10.5555/125470.125433"
    },
    {
      "text": "Jee-Eun Kim, Masahiro Bessho, Shinsuke Kobayashi, Noboru Koshizuka, and Ken Sakamura. 2016. Navigating visually impaired travelers in a large train station using smartphone and bluetooth low energy. In Proceedings of the 31st Annual ACM Symposium on Applied Computing. ACM, 604--611.  ",
      "doi": "10.1145/2851613.2851716"
    },
    {
      "text": "Georgina Kleege. 2017. More Than Meets the Eye: What Blindness Brings to Art. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Nina Levent and Christine Reich. 2013. Museum accessibility: Combining audience research and staff training. Journal of Museum Education 38, 2 (2013), 218--226.",
      "doi": ""
    },
    {
      "text": "Morris Hargreaves McIntyre. 2008. Touching History: An Evaluation of Hands On Desks at The British Museum. London: British Museum.",
      "doi": ""
    },
    {
      "text": "Peter B. L. Meijer. 1992. An experimental system for auditory image representations. IEEE Transactions on Biomedical Engineering 39, 2 (1992), 112--121.",
      "doi": ""
    },
    {
      "text": "Moritz Neumüller, Andreas Reichinger, Florian Rist, and Christian Kern. 2014. 3D printing for cultural heritage: Preservation, accessibility, research and education. In 3D Research Challenges in Cultural Heritage. Springer, 119--134.  ",
      "doi": "10.1007/978-3-662-44630-0_9"
    },
    {
      "text": "United Nations Department of Economic and Social Affairs (UNDESA). 2006. Convention on the Rights of People with Disabilities. https://www.un.org/development/desa/disabilities/ convention-on-the-rights-of-persons-with-disabilities.html.",
      "doi": ""
    },
    {
      "text": "Charles O'Neill and Kia Ng. 2008. Hearing images: Interactive sonification interface for images. In EVA 2008.",
      "doi": ""
    },
    {
      "text": "Thierry Pun, Benoit Deville, and Guido Bologna. 2010. Sonification of colour and depth in a mobility aid for blind people. In Proceedings International Conference on Auditory Display (ICAD). 9--15.",
      "doi": ""
    },
    {
      "text": "Kyle Rector, Keith Salmon, Dan Thornton, Neel Joshi, and Meredith Ringel Morris. 2017. Eyes-free art: Exploring proxemic audio interfaces for blind and low vision art engagement. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 93.  ",
      "doi": "10.1145/3130958"
    },
    {
      "text": "Christine Reich, Anna Lindgren-Streicher, Marta Beyer, Nina Levent, Joan Pursley, and Leigh Ann Mesiti. 2011. Speaking Out on Art and Museums: A Study on the Needs and Preferences of Adults who are Blind or have Low Vision. Technical Report No. 2011--3. Museum of Science, Boston and Art Beyond Sight.",
      "doi": ""
    },
    {
      "text": "Andreas Reichinger, Stefan Maierhofer, and Werner Purgathofer. 2011. High-quality tactile paintings. Journal on Computing and Cultural Heritage (JOCCH) 4, 2 (2011), 5.  ",
      "doi": "10.1145/2037820.2037822"
    },
    {
      "text": "Jordan Boaz Rodrigues, Alinne Victoria Martins Ferreira, Ivana Marcia Oliveira Maia, Geraldo Braz Junior, João Dallyson Sousa de Almeida, and Anselmo Cardoso de Paiva. 2018. Image processing of artworks for construction of 3D models accessible to the visually impaired. In International Conference on Applied Human Factors and Ergonomics. Springer, 243--253.",
      "doi": ""
    },
    {
      "text": "Katerine Romeo, Marion Chottin, Pierre Ancet, and Edwige Pissaloux. 2018. Access to artworks and its mediation by and for visually impaired persons: Introduction to the special thematic session. In International Conference on Computers Helping People with Special Needs (ICCHP). Springer, 233--236.",
      "doi": ""
    },
    {
      "text": "Shalom H. Schwartz. 2012. An overview of the Schwartz theory of basic values. Online Readings in Psychology and Culture 2, 1 (2012), 11.",
      "doi": ""
    },
    {
      "text": "Roberto Scopigno, Paolo Cignoni, Nico Pietroni, Marco Callieri, and Matteo Dellepiane. 2014. Digital fabrication technologies for cultural heritage (STAR). In GCH '14 Proceedings of the Eurographics Workshop on Graphics and Cultural Heritage. 75--85. ",
      "doi": "10.5555/2854922.2854934"
    },
    {
      "text": "Roberto Scopigno, Paolo Cignoni, Nico Pietroni, Marco Callieri, and Matteo Dellepiane. 2017. Digital fabrication techniques for cultural heritage: A survey. In Computer Graphics Forum, Vol. 36. Wiley Online Library, 6--21.  ",
      "doi": "10.1111/cgf.12781"
    },
    {
      "text": "Abigale Stangl, Chia-Lo Hsu, and Tom Yeh. 2015. Transcribing across the senses: Community efforts to create 3D printable accessible tactile pictures for young children with visual impairments. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. ACM, 127--137.  ",
      "doi": "10.1145/2700648.2809854"
    },
    {
      "text": "Sarit Szpiro, Yuhang Zhao, and Shiri Azenkot. 2016. Finding a store, searching for a product: A study of daily challenges of low vision people. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 61--72.  ",
      "doi": "10.1145/2971648.2971723"
    },
    {
      "text": "Yary Volpe, Rocco Furferi, Lapo Governi, and Giovanna Tennirelli. 2014. Computer-based methodologies for semi-automatic 3D model generation from paintings. International Journal of Computer Aided Engineering and Technology 6, 1 (2014), 88--112.",
      "doi": ""
    },
    {
      "text": "Paul F. Wilson, Janet Stott, Jason M. Warnett, Alex Attridge, M. Paul Smith, and Mark A. Williams. 2017. Evaluation of touchable 3D-printed replicas in museums. Curator: The Museum Journal 60, 4 (2017), 445-- 465.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Krzysztof Z. Gajos, Shaun K. Kane, and Gregg C. Vanderheiden. 2018. Ability-based design. Commun. ACM 61, 6 (2018), 62--71.  ",
      "doi": "10.1145/3148051"
    },
    {
      "text": "Jizhong Xiao, Samleo L Joseph, Xiaochen Zhang, Bing Li, Xiaohai Li, and Jianwei Zhang. 2015. An assistive navigation framework for the visually impaired. IEEE Transactions on Human-Machine Systems 45, 5 (2015), 635--640.",
      "doi": ""
    },
    {
      "text": "Tsubasa Yoshida, Kris M. Kitani, Hideki Koike, Serge Belongie, and Kevin Schlei. 2011. EdgeSonic: Image feature sonification for the visually impaired. In Proceedings of the 2nd Augmented Human International Conference (AH '11). ACM, Article 11, 4 pages.  ",
      "doi": "10.1145/1959826.1959837"
    }
  ]
}