{
  "doi": "10.1145/3290605.3300540",
  "title": "On the Usability of HTTPS Deployment",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2019,
  "badges": [],
  "abstract": "HTTPS and TLS are the backbone of Internet security, however setting up web servers to run these protocols is a notoriously difficult process. In this paper, we perform two live subjects usability studies on the deployment of HTTPS in a real-world setting. Study 1 is a within subjects comparison between traditional HTTPS configuration (purchasing a certificate and installing it on a server) and Let's Encrypt, which automates much of the process. Study 2 is a between subjects study looking at the same two systems, examining why users encounter usability issues. Overall we confirm past results that HTTPS is difficult to deploy, and we find some evidence that suggests Let's Encrypt is an easier, more efficient method for deploying HTTPS.",
  "authors": [
    {
      "name": "Matthew Bernhard",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659086506",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Sharman",
      "institution": "Rice University, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365334",
      "orcid": "missing"
    },
    {
      "name": "Claudia Ziegler Acemyan",
      "institution": "Rice University, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658737521",
      "orcid": "missing"
    },
    {
      "name": "Philip Kortum",
      "institution": "Rice University, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81361608063",
      "orcid": "missing"
    },
    {
      "name": "Dan S. Wallach",
      "institution": "Rice University, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100639714",
      "orcid": "missing"
    },
    {
      "name": "J. Alex Halderman",
      "institution": "University of Michigan, Ann Arbor, MI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659333449",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "certbot. https://certbot.eff.org.",
      "doi": ""
    },
    {
      "text": "Namecheap. https://www.namecheap.com/.",
      "doi": ""
    },
    {
      "text": "OpenSSL. https://www.openssl.org/.",
      "doi": ""
    },
    {
      "text": "Surveymonkey. https://surveymonkey.com.",
      "doi": ""
    },
    {
      "text": "D. Akhawe, B. Amann, M. Vallentin, and R. Sommer. Here's my cert, so trust me, maybe?: understanding tls errors on the web. In 22nd international conference on World Wide Web, 2013.  ",
      "doi": "10.1145/2488388.2488395"
    },
    {
      "text": "D. Akhawe and A. P. Felt. Alice in warningland: A large-scale field study of browser security warning effectiveness. In 22nd USENIX Security Symposium, 2013. ",
      "doi": "10.5555/2534766.2534789"
    },
    {
      "text": "A. Bangor, P. Kortum, and J. Miller. Determining what individual sus scores mean: Adding an adjective rating scale. Journal of usability studies, 4(3):114--123, 2009. ",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "A. Bangor, P. T. Kortum, and J. T. Miller. An empirical evaluation of the system usability scale. Intl. Journal of Human--Computer Interaction, 24(6):574--594, 2008.",
      "doi": ""
    },
    {
      "text": "J. Brooke. Sus: A \"quick and dirty\" usability scale. In P. W. Jordan, B. Thomas, B. Weerdmeester, and I. L. McClelland, editors, Usability evaluation in industry, page 189--194. Taylor and Francis, 1996.",
      "doi": ""
    },
    {
      "text": "T. Chung, R. van Rijswijk-Deij, B. Chandrasekaran, D. Choffnes, D. Levin, B. M. Maggs, A. Mislove, and C. Wilson. A longitudinal, end-to-end view of the dnssec ecosystem. In 26th USENIX Security Symposium, 2017. ",
      "doi": "10.5555/3241189.3241291"
    },
    {
      "text": "The DROWN attack. https://drownattack.com/.",
      "doi": ""
    },
    {
      "text": "Z. Durumeric, D. Adrian, A. Mirian, M. Bailey, and J. A. Halderman. Tracking the FREAK attack. https://freakattack.com/.",
      "doi": ""
    },
    {
      "text": "S. Fahl, Y. Acar, H. Perl, and M. Smith. Why eve and mallory (also) love webmasters: a study on the root causes of ssl misconfigurations. In 9th ACM Symposium on Information, Computer and Communications Security, 2014.  ",
      "doi": "10.1145/2590296.2590341"
    },
    {
      "text": "G. Gebhart. We're halfway to encrypting the entire web. https://www. eff.org/deeplinks/2017/02/were-halfway-encrypting-entire-web.",
      "doi": ""
    },
    {
      "text": "ISO. ISO 9241--11:1998 Ergonomic requirements for office work with visual display terminals (VDTs) -- Part 11: Guidance on usability. Technical report, International Organization for Standardization, 1998.",
      "doi": ""
    },
    {
      "text": "P. Kortum. Usability assessment: how to measure the usability of products, services, and systems. Human Factors and Ergonomics Society, 2016.",
      "doi": ""
    },
    {
      "text": "K. Krombholz, W. Mayer, M. Schmiedecker, and E. Weippl. \"I Have No Idea What I'm Doing\"--On the Usability of Deploying HTTPS. In 26th USENIX Security Symposium, 2017. ",
      "doi": "10.5555/3241189.3241293"
    },
    {
      "text": "D. Kumar, M. Bailey, Z. Wang, M. Hyder, J. Dickinson, G. Beck, D. Adrian, J. Mason, Z. Durumeric, and J. A. Halderman. Tracking certificate misissuance in the wild. In 39th IEEE Symposium on Security and Privacy, 2018.",
      "doi": ""
    },
    {
      "text": "B. Moller, T. Duong, and K. Kotowicz. This POODLE bites: Exploiting the SSL 3.0 fallback. https://www.openssl.org/~bodo/ssl-poodle.pdf.",
      "doi": ""
    },
    {
      "text": "Netcraft. January 2018 Web Server Survey. https://news.netcraft.com/ archives/2018/01/19/january-2018-web-server-survey.html.",
      "doi": ""
    },
    {
      "text": "R. W. Reeder, A. P. Felt, S. Consolvo, N. Malkin, C. Thompson, and S. Egelman. An experience sampling study of user reactions to browser warnings in the field. In 2018 Conference on Human Factors in Computing Systems, 2018.  ",
      "doi": "10.1145/3173574.3174086"
    },
    {
      "text": "Q. SSLLabs. Ssllabs ssl server test. https://www.ssllabs.com/ssltest/.",
      "doi": ""
    },
    {
      "text": "J. Sunshine, S. Egelman, H. Almuhimedi, N. Atri, and L. F. Cranor. Crying wolf: An empirical study of ssl warning effectiveness. In 18th USENIX Security Symposium, 2009. ",
      "doi": "10.5555/1855768.1855793"
    },
    {
      "text": "B. VanderSloot, J. Amann, M. Bernhard, Z. Durumeric, M. Bailey, and J. A. Halderman. Towards a complete view of the certificate ecosystem. In 16th ACM Internet Measurement Conference, 2016.  ",
      "doi": "10.1145/2987443.2987462"
    },
    {
      "text": "S. Wells. Chrome rolls out for all users \"not secure' markers on unencrypted pages. https://techcrunch.com/2018/07/24/chrome-rolls-outfor-all-users-not-secure-markers-on-unencrypted-pages/.",
      "doi": ""
    },
    {
      "text": "J. Zhang, Z. Durumeric, M. Bailey, M. Liu, and M. Karir. On the mismanagement and maliciousness of networks. In 21st Network and Distributed Systems Security Conference, 2014.",
      "doi": ""
    }
  ]
}