{
  "doi": "10.1145/3290605.3300677",
  "title": "A is for Artificial Intelligence: The Impact of Artificial Intelligence Activities on Young Children's Perceptions of Robots",
  "published": "2019-05-02",
  "proctitle": "CHI '19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2019,
  "badges": [],
  "abstract": "We developed a novel early childhood artificial intelligence (AI) platform, PopBots, where preschool children train and interact with social robots to learn three AI concepts: knowledge-based systems, supervised machine learning, and generative AI. We evaluated how much children learned by using AI assessments we developed for each activity. The median score on the cumulative assessment was 70% and children understood knowledge-based systems the best. Then, we analyzed the impact of the activities on children's perceptions of robots. Younger children came to see robots as toys that were smarter than them, but their older counterparts saw them more as people that were not as smart as them. Children who performed worse on the AI assessments believed that robots were like toys that were not as smart as them, however children who did better on the assessments saw robots as people who were smarter than them. We believe early AI education can empower children to understand the AI devices that are increasingly in their lives.",
  "tags": [
    "social robots",
    "ai education",
    "child-robot interaction",
    "early childhood education"
  ],
  "authors": [
    {
      "name": "Randi Williams",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659182796",
      "orcid": "missing"
    },
    {
      "name": "Hae Won Park",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659133326",
      "orcid": "missing"
    },
    {
      "name": "Cynthia Breazeal",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100258451",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Yvonne Barnes-Holmes, Louise McHugh, and Dermot Barnes-Holmes. 2004. Perspective-taking and Theory of Mind: A relational frame account. The Behavior Analyst Today 5, 1 (2004), 15.",
      "doi": ""
    },
    {
      "text": "Debra Bernstein and Kevin Crowley. 2008. Searching for signs of intelligent life: An investigation of young children's beliefs about robot intelligence. The Journal of the Learning Sciences 17, 2 (2008), 225--247.",
      "doi": ""
    },
    {
      "text": "Marina Umaschi Bers. 2017. Coding as a playground: Programming and computational thinking in the early childhood classroom. Routledge.",
      "doi": ""
    },
    {
      "text": "Jacques Bughin, E Hazan, S Ramaswamy, M Chui, T Allas, P Dahlström, N Henke, and M Trench. 2017. Artificial intelligence--the next digital frontier. McKinsey Glob Institute URL https://www. mckinsey. de/files/170620_studie_ai. pdf (2017).",
      "doi": ""
    },
    {
      "text": "Massachusetts DOE. 2018. School and District Profiles. http://profiles. doe.mass.edu/",
      "doi": ""
    },
    {
      "text": "Stefania Druga, Randi Williams, Cynthia Breazeal, and Mitchel Resnick. 2017. Hey Google is it OK if I eat you?: Initial explorations in childagent interaction. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, 595--600.  ",
      "doi": "10.1145/3078072.3084330"
    },
    {
      "text": "Stefania Druga, Randi Williams, Hae Won Park, and Cynthia Breazeal. 2018. How smart are the smart toys?: Children and parents' agent interaction and intelligence attribution. In Proceedings of the 17th ACM Conference on Interaction Design and Children. ACM, 231--240.  ",
      "doi": "10.1145/3202185.3202741"
    },
    {
      "text": "Jennifer L Jipson and Susan A Gelman. 2007. Robots and rodents: Children's inferences about living and nonliving kinds. Child development 78, 6 (2007), 1675--1688.",
      "doi": ""
    },
    {
      "text": "Peter H Kahn Jr, Takayuki Kanda, Hiroshi Ishiguro, Nathan G Freier, Rachel L Severson, Brian T Gill, Jolina H Ruckert, and Solace Shen. 2012. \"Robovie, you'll have to go into the closet now\": Children's social and moral relationships with a humanoid robot. Developmental psychology 48, 2 (2012), 303.",
      "doi": ""
    },
    {
      "text": "MIT Media Lab Lifelong Kindergarten. 2018. Scratch Blocks. https: //github.com/LLK/scratch-blocks",
      "doi": ""
    },
    {
      "text": "Jin Joo Lee, Cynthia Breazeal, and David DeSteno. 2017. Role of speaker cues in attention inference. Frontiers in Robotics and AI 4 (2017), 47.",
      "doi": ""
    },
    {
      "text": "Sharona T Levy and David Mioduser. 2008. Does it \"want\" or \"was it programmed to\"? Kindergarten children's explanations of an autonomous robot's adaptive functioning. International Journal of Technology and Design Education 18, 4 (2008), 337--359.",
      "doi": ""
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys that listen: A study of parents, children, and internet-connected toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5197--5207.  ",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "David Mioduser and Sharona T. Levy. 2010. Making sense by building sense: Kindergarten children's construction and understanding of adaptive robot behaviors. International Journal of Computers for Mathematical Learning 15, 2 (01 Jul 2010), 99--127.",
      "doi": ""
    },
    {
      "text": "Hae Won Park, Mirko Gelsomini, Jin Joo Lee, and Cynthia Breazeal. 2017. Telling stories to robots: The effect of backchanneling on a child's storytelling. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). ACM, New York, NY, USA, 100--108.  ",
      "doi": "10.1145/2909824.3020245"
    },
    {
      "text": "Michael Scaife and Mike van Duuren. 1995. Do computers have brains? What children believe about intelligent artifacts. British Journal of Developmental Psychology 13, 4 (1995), 367--377.",
      "doi": ""
    },
    {
      "text": "Tencent. 2017. 2017 Global Artificial Intelligence White paper. http://www.tisi.org/Public/Uploads/file/20171201/20171201151555_ 24517.pdf",
      "doi": ""
    },
    {
      "text": "Sherry Turkle. 1984. The second self: Computers and the human spirit. Simon & Schuster, Inc., New York, NY, USA. ",
      "doi": "10.5555/2773"
    },
    {
      "text": "Sherry Turkle, Cynthia Breazeal, Olivia Dasté, and Brian Scassellati. 2006. Encounters with kismet and cog: Children respond to relational artifacts. Digital media: Transformations in human communication 120 (2006).",
      "doi": ""
    },
    {
      "text": "Henry M Wellman and David Liu. 2004. Scaling of theory-of-mind tasks. Child development 75, 2 (2004), 523--541.",
      "doi": ""
    },
    {
      "text": "Jacqueline Marie Kory Westlund, Sooyeon Jeong, Hae Won Park, Samuel Ronfard, Aradhana Adhikari, Paul L. Harris, David DeSteno, and Cynthia L. Breazeal. 2017. Flat vs. Expressive Storytelling: Young Children's Learning and Retention of a Social Robot's Narrative. 11 (06 2017).",
      "doi": ""
    },
    {
      "text": "Randi Williams. 2018. Leveraging social robots to aid preschool children's artificial intelligence education. Master's thesis. MIT. https://www. media.mit.edu/publications/pop-study-2018/",
      "doi": ""
    }
  ]
}