{
  "doi": "10.1145/503376.503402",
  "title": "Trust without touch: jumpstarting long-distance trust with initial social activities",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "141-146",
  "year": 2002,
  "badges": [],
  "abstract": "Computer-mediated communication (CMC) is thought to be inadequate when one needs to establish trust. If, however, people meet before using CMC, they trust each other, trust being established through touch. Here we show that if participants do not meet beforehand but rather engage in various getting-acquainted activities over a network, trust is much higher than if they do nothing beforehand, nearly as good as a prior meeting. Using text-chat to get acquainted is nearly as good as meeting, and even just seeing a picture is better than nothing",
  "authors": [
    {
      "name": "Jun Zheng",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100581049",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Veinott",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310499626",
      "orcid": "missing"
    },
    {
      "name": "Nathan Bos",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100632322",
      "orcid": "missing"
    },
    {
      "name": "Judith S. Olson",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/do/10.1145/contrib-81350567367/rel-imgonly/81350567367.jpg",
      "acmid": "81350567367",
      "orcid": "missing"
    },
    {
      "name": "Gary M. Olson",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/do/10.1145/contrib-81100178543/rel-imgonly/81100178543.jpg",
      "acmid": "81100178543",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bos, N. S., Olson, J., Gergle, D., Olson, G., and Wright, Z. (2002) Effects of four computer-mediated communications channels on trust development. Proceedings of the Conference on Human Factors in Computing Systems (CHI'02). {This volume.}  ",
      "doi": "10.1145/503376.503401"
    },
    {
      "text": "Butler, J. K. (1991) Toward understanding and measuring conditions of trust: Evolution of conditions of trust inventory. Journal of Management, 17: 643--663.",
      "doi": ""
    },
    {
      "text": "Handy, C. (1995) Trust and the virtual organization. Harvard Business Review. 73(3), 40--50.",
      "doi": ""
    },
    {
      "text": "Komorita, S. S. (1994) Social Dilemmas. Madison, WI: Brown & Benchmark.",
      "doi": ""
    },
    {
      "text": "Moore, D. A., Kurtzberg, T. R., Thompson, L. L. & Morris, M. W. (1999) Long and short routes to success in electronically mediated negotiations: Group affiliations and good vibrations, Organizational Behavior and Human Decision Processes, 77, 1, pp. 22--43.",
      "doi": ""
    },
    {
      "text": "Olson, J. S. Olson, G. M. and Meader, D. K. (1995) What mix of video and audio is useful for remote real-time work? Proceedings of the Conference on Human Factors in Computing Systems (CHI'95). Denver, CO: ACM Press. Pp. 362--368.  ",
      "doi": "10.1145/223904.223951"
    },
    {
      "text": "Ostrom, E., Walker, J. and Gardner, R. (1992) Covenants with and without a sword: Self-governance is possible. American Political Science Review, 1992, 86, 404--417.",
      "doi": ""
    },
    {
      "text": "Rocco, E. (1998) Trust breaks down in electronic contexts but can be repaired by some initial face-to-face contact, Proceedings of the Conference on Human Factors in Computing Systems (CHI'98). , pp 496--502.  ",
      "doi": "10.1145/274644.274711"
    },
    {
      "text": "Rocco, E., Finholt, T.A., Hofer, E.C., & Herbsleb, J.D. (2001). Out of sign, short of trust. Presentation at the Founding Conference of the European Academy of Management. Barcelona, Spain.",
      "doi": ""
    },
    {
      "text": "Rotter, J. B. (1967). A new scale for the measurement of interpersonal trust. Journal of Personality, 35 (4), 651--665.",
      "doi": ""
    }
  ]
}