{
  "doi": "10.1145/503376.503458",
  "title": "Groupware walkthrough: adding context to groupware usability evaluation",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "455-462",
  "year": 2002,
  "badges": [],
  "abstract": "Discount usability evaluation methods have recently been introduced as a way to assess groupware systems. However, one criticism of these techniques is that they do not make use of information about users and their work contexts. To address this problem, we developed groupware walkthrough, a new usability inspection technique for groupware. The technique is a substantive modification of cognitive walkthrough to include consideration for the complexities of teamwork. The two components of groupware walkthrough are a task model for identifying and analysing real-world collaborative tasks, and a walkthrough process for assessing a system's support for those tasks. Groupware walkthrough is a low-cost technique that can identify collaboration-specific usability problems and can find problems that would not be revealed through other inspection methods",
  "tags": [
    "usability inspection",
    "cognitive walkthrough",
    "mechanics of collaboration",
    "groupware walkthrough"
  ],
  "authors": [
    {
      "name": "David Pinelle",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100573952",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Annett, J. and Duncan, K.D. Task analysis and training design. Occupational Psychology, 12, (1967), 211--221.",
      "doi": ""
    },
    {
      "text": "Baker, K., Greenberg, S. and Gutwin, C. Heuristic Evaluation of Groupware Based on the Mechanics of Collaboration, Proc. 8th IFIP Working Conference on Engineering for HCI (EHCI 2001). ",
      "doi": "10.5555/645350.650731"
    },
    {
      "text": "Beyer, H., Holtzblatt, K. Contextual Design: Defining Customer-Centered Systems. Academic Press, San Diego CA, 1998. ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Diaper, D. Task Analysis for Human-Computer Interaction, Ellis Horwood, Chichester, 1989. ",
      "doi": "10.5555/533857"
    },
    {
      "text": "Ereback A.-L. and, Höök K. Using Cognitive Walkthrough for Evaluating a CSCW Application. Proc. CHI '94, ACM Press, 91--92.  ",
      "doi": "10.1145/259963.260065"
    },
    {
      "text": "Garfinkel, H. Studies in Ethnomethodology. Polity Press, Cambridge, 1967.",
      "doi": ""
    },
    {
      "text": "Grudin, J., 1990, Groupware and Cooperative Work: Problems and Prospects. In The Art of Human Computer Interface Design, B. Laurel, Ed. Addison-Wesley, 171--185.",
      "doi": ""
    },
    {
      "text": "Gutwin, C. and Greenberg, S. The Mechanics of Collaboration: Developing Low Cost Usability Evaluation Methods for Shared Workspaces. Proc. 9th IEEE WETICE 2000, IEEE Press, 98--103. ",
      "doi": "10.5555/647068.715651"
    },
    {
      "text": "Hughes, J., King, V., Rodden, T., Andersen, H. Moving out from the control room: ethnography in system design. Proc CSCW'94, ACM Press, 429--439.  ",
      "doi": "10.1145/192844.193065"
    },
    {
      "text": "Nielsen, J. Usability Engineering. Academic Press, Boston MA, 1993. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Orlikowski, W.J. Learning From Notes: Organizational Issues in Groupware Implementation. Proc. CSCW '92, ACM Press, 362--369.  ",
      "doi": "10.1145/143457.143549"
    },
    {
      "text": "Pinelle, D. and Gutwin, C. Group Task Analysis for Groupware Usability Evaluations. Proceedings of the 10th IEEE WETICE 2001, IEEE Press, 102--107. ",
      "doi": "10.5555/647069.715669"
    },
    {
      "text": "Polson, P., Lewis, C., Rieman, J., and Wharton, C. Cognitive Walkthroughs: A Method for Theory-Based Evaluation of User Interfaces. International Journal of Man-Machine Studies, 36, (1992), 741--73.  ",
      "doi": "10.1016/0020-7373%2892%2990039-N"
    },
    {
      "text": "Rubin, J. Handbook of Usability Testing: How to Plan, Design, and Conduct Effective Tests. John Wiley & Sons, New York, 1994. ",
      "doi": "10.5555/561768"
    },
    {
      "text": "Steves, M., Morse, E., Gutwin, C. and Greenberg, S. A Comparison of Observation and Inspection Methods for Evaluating Groupware. Proc. GROUP 2001, ACM Press, 125--134.  ",
      "doi": "10.1145/500286.500306"
    },
    {
      "text": "van der Veer, G.C., Lenting, B.F., and Bergevoet, B.A.J. GTA: Groupware Task Analysis - Modeling Complexity. Acta Psychologica, 91, (1996), 297--322.",
      "doi": ""
    },
    {
      "text": "van der Veer, G.C. and van Welie, M. Task Based Groupware Design: Putting Theory Into Practice, Proc. DIS2000, ACM Press, 326--337.  ",
      "doi": "10.1145/347642.347781"
    }
  ]
}