{
  "doi": "10.1145/503376.503412",
  "title": "Women take a wider view",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "195-202",
  "year": 2002,
  "badges": [],
  "abstract": "Published reports suggest that males significantly outperform females in navigating virtual environments. A novel navigation technique reported in CHI 2001, when combined with a large display and wide field of view, appeared to reduce that gender bias. That work has been extended with two navigation studies in order to understand the finding under carefully controlled conditions. The first study replicated the finding that a wide field of view coupled with a large display benefits both male and female users and reduces gender bias. The second study suggested that wide fields of view on a large display were useful to females despite a more densely populated virtual world. Implications for design of virtual worlds and large displays are discussed. Specifically, women take a wider field of view to achieve similar virtual environment navigation performance to men",
  "tags": [
    "gender effects",
    "field of view",
    "cognitive maps",
    "spatial abilities",
    "3D navigation",
    "landmark knowledge"
  ],
  "authors": [
    {
      "name": "Mary Czerwinski",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100280834/rel-imgonly/marycz.jpg",
      "acmid": "81100280834",
      "orcid": "0000-0003-0881-401X"
    },
    {
      "name": "Desney S. Tan",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    },
    {
      "name": "George G. Robertson",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81452612822/rel-imgonly/aa.jpg",
      "acmid": "81452612822",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alice 3D Authoring Tool, see http://www.alice.org/.",
      "doi": ""
    },
    {
      "text": "Alfano, P. L., Michel, G. F. (1990). \"Restricting the field of view: perceptual and performance effects.\" Perceptual and Motor Skills, 70 (1), 35--45.",
      "doi": ""
    },
    {
      "text": "Astur, R. S., Ortiz, M. L., & Sutherland, R., J. (1998). A characterization of performance by men and women in a virtual Morris water task: A large and reliable sex difference. Behavioural Brain Research, 93, 185--90.",
      "doi": ""
    },
    {
      "text": "Barfield, W., Lim, R., & Rosenberg, C. (1990). Visual enhancements and geometric field of view as factors in the design of a three-dimensional perspective display. Proceedings of the 34th Annual Meeting of the Human Factors Society, 1470--1473.",
      "doi": ""
    },
    {
      "text": "Chambers, W.W. (1982, April). Visual technology research simulator. Flight simulation-avionic systems and aero medical aspects. Royal Aeronautical Society's Flight Simulation Symposium, London.",
      "doi": ""
    },
    {
      "text": "Darken, R., Sibert, J. (1993). A toolset for navigation in virtual environments. Proceedings of UIST '93, ACM Press, 157--165.  ",
      "doi": "10.1145/168642.168658"
    },
    {
      "text": "Darken, R., Sibert, J. (1996). Navigating in large virtual worlds. The International Journal of Human-Computer Interaction, 8(1), 49--72.  ",
      "doi": "10.1080/10447319609526140"
    },
    {
      "text": "Dolezal, H. (1982). Living in a world transformed: Perceptual and performatory adaptation to visual distortion. New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Draper, M.H., Viirre, E.S., Furness, T.A. & Gawron, V.J. (2001). Effects of image scale and system time delay on simulator sickness within head-coupled virtual environments. Human Factors, 43(1), 129--146.",
      "doi": ""
    },
    {
      "text": "Eckstrom, R.B., French, J.W., Harman, HH. & Dermen, D. (1976). Kit of Factor-Referenced Cognitive Tests. Princeton, J.J.: Educational Testing Service.",
      "doi": ""
    },
    {
      "text": "Elvins, T., Nadeau, D., Schul, R., & Kirsh, D. (1998). Worldlets: 3D thumbnails for 3D browsing. Proceedings of CHI '98, ACM Press, 163--170.  ",
      "doi": "10.1145/274644.274669"
    },
    {
      "text": "Hagen, M.A., Jones, R.K., & Reed, E.S. (1978). On a neglected variable in theories of pictorial perception: truncation of the visual field. Perception and Psychophysics, 23, 326--330.",
      "doi": ""
    },
    {
      "text": "Halpern, D. F. (2000). Sex Differences in Cognitive Abilities, 3rd Edition. Lawrence Erlbaum Associates, Inc., NJ.",
      "doi": ""
    },
    {
      "text": "Hosman, R., van der Haart, J. (1981). Effects of vestibular and visual motion perception on task performance. Acta Psychol., 48, 271--281.",
      "doi": ""
    },
    {
      "text": "Kenyon, R.V., Kneller, E.W. (1993). The effects of field of view size on the control of roll motion. IEEE Transactions on Systems, Man, and Cybernetics, 23(1), 183--193.",
      "doi": ""
    },
    {
      "text": "Kimura, D. (1999). Sex and Cognition. MIT Press, Cambridge, Mass, pp. 1--66.",
      "doi": ""
    },
    {
      "text": "Lynch, K. (1960). The Image of the City. Cambridge, Massachusetts: The MIT Press.",
      "doi": ""
    },
    {
      "text": "Passini, R. (1984). Wayfinding in Architecture. New York: Van Nostrand Reinhold.",
      "doi": ""
    },
    {
      "text": "Patrick, E., Cosgrove, D., Slavkovic, A., Rode, J., Verratti, T., & Chiselko, G. (2000). Using a large projection screen as an alternative to head-mounted displays for virtual environments. Proceedings of CHI 2000, CHI Letters 2(1), 478--485.  ",
      "doi": "10.1145/332040.332479"
    },
    {
      "text": "Piantanida, T.P., Boman, D., Larimer, J., Gille, J., & Reed, C. (1992). Studies of the field-of-view/resolution tradeoff in virtual reality. Proceedings of the SPIE: Human Vision, Visual Processing and Digital Display III, 1666, 448--456.",
      "doi": ""
    },
    {
      "text": "Ruddle, R., Payne, S., & Jones, D. (1999). The effects of maps on navigation and search strategies in very-large-scale virtual environments. Journal of Experimental Psychology: Applied, 5, 54--75.",
      "doi": ""
    },
    {
      "text": "Sandor, P.B., Leger, A. (1991). Tracking with a restricted field of view. Aviation, Space, and Environmental Medicine, 62(11), 1026--1031.",
      "doi": ""
    },
    {
      "text": "Sandstrom, N. J., Kaufman, J., & Huettel, S. A. (1998). Males and females use different distal cues in a virtual environment navigation task. Cognitive Brain Research, 6, 351--60.",
      "doi": ""
    },
    {
      "text": "Siegel, A., White, S. The development of spatial representations of large-scale environments. In H. Reese (Ed.), Advances in Child Development and Behavior, 10, 10--55. New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Tan, D.S., Robertson, G.G., & Czerwinski, M. (2001). Exploring 3D navigation: combining speed-coupled flying with orbiting. Proceedings of CHI 2001, CHI Letters 2(1), 418--425.  ",
      "doi": "10.1145/365024.365307"
    },
    {
      "text": "Thorndyke, P., Hayes-Roth, B. (1982). Differences in spatial knowledge acquired from maps and navigation. Cognitive Psychology, 14, 560--589.",
      "doi": ""
    },
    {
      "text": "Vinson, N. (1999). Design guidelines for landmarks to support navigation in virtual environments. Proceedings of CHI '99, ACM Press, 278--285.  ",
      "doi": "10.1145/302979.303062"
    },
    {
      "text": "Waller, D., Hunt, E., & Knapp, D. (1998). The transfer of spatial knowledge in virtual environment training. Presence: Teleoperators and Virtual Environments, 7(2), 129--143.  ",
      "doi": "10.1162/105474698565631"
    },
    {
      "text": "Wells, M.J., Venturino, M. (1990). Performance and head movements using a helmet-mounted display with different sized fields-of-view. Optical Engineering, 29(8), 870--877.",
      "doi": ""
    },
    {
      "text": "Witmer, B., Bailey, J., Knerr, B, & Parsons, K. Virtual spaces and real world places: Transfer of route knowledge. International Journal of Human-Computer Studies, 45, 413--428.  ",
      "doi": "10.1006/ijhc.1996.0060"
    }
  ]
}