{
  "doi": "10.1145/503376.503393",
  "title": "Notification for shared annotation of digital documents",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "89-96",
  "year": 2002,
  "badges": [],
  "abstract": "Notification and shared annotations go hand-in-hand. Notification of activity in a shared document system is known to support awareness and improve asynchronous collaboration, but few studies have examined user needs and explored design tradeoffs. We examined large-scale use of notifications in a commercial system and found it lacking. We designed and deployed enhancements to the system, then conducted a field study to gauge their effect. We found that providing more information in notification messages, supporting multiple communication channels through which notifications can be received, and allowing customization of notification messages are particularly important. Overall awareness of annotation activity on software specifications increased with our enhancements",
  "tags": [
    "annotation system design",
    "notification",
    "annotation"
  ],
  "authors": [
    {
      "name": "A. J. Bernheim Brush",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81332491415/rel-imgonly/ajbrushlarge.jpg",
      "acmid": "81332491415",
      "orcid": "missing"
    },
    {
      "name": "David Bargeron",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100187010",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Grudin",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100031531/rel-imgonly/jonathan_grudin.jpg",
      "acmid": "81100031531",
      "orcid": "missing"
    },
    {
      "name": "Anoop Gupta",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452611908",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Appelt, W. What groupware functionality do users really use? Analysis of the usage of the BSCW system. Proc. 9th Euromicro Workshop on PDP. http://bscw.gmd.de/Papers/PDP2001/PDP2001.pdf",
      "doi": ""
    },
    {
      "text": "Appelt, W. WWW Based Collaboration with the BSCW System, Proc. SOFSEM'99, Springer Lecture Notes in Computer Science 1725, 66--78; http://bscw.gmd.de/Papers/SOFSEM99/sofsem.pdf ",
      "doi": "10.5555/647009.712532"
    },
    {
      "text": "Baecker, R. Nastos, D. Posner, I. and Mawby, K. The User-centered Iterative Design of Collaborative Writing Software. Proc. INTERCHI 93, 399--405.  ",
      "doi": "10.1145/169059.169312"
    },
    {
      "text": "Cadiz, J. Gupta, A. and Grudin, J. Using Web Annotations for Asynchronous Collaboration Around Documents. Proc. CSCW 2000, 309--318.  ",
      "doi": "10.1145/358916.359002"
    },
    {
      "text": "Cadiz, J. Venolia, G. Jancke, G. Gupta, A., 2001. Sideshow: Providing Peripheral Awareness of People and Information, Microsoft Technical Report 2001-83. http://research.microsoft.com/scripts/pubs/view.asp?TR_ID=MSR-TR-2001-83.",
      "doi": ""
    },
    {
      "text": "Crit.org. http://www.crit.org",
      "doi": ""
    },
    {
      "text": "Dourish P. and Bellotti V. Awareness and Coordination in Shared Workspaces. Proc CSCW '92, 107--114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Fuchs, L. AREA: A Cross-Application Notification Service for Groupware. Proc. ECSCW 99, 61--80. ",
      "doi": "10.5555/351689.351694"
    },
    {
      "text": "Gutwin, C. Roseman, M. and Greenberg, S. A Usability Study of Awareness Widgets in a Shared Workspace Groupware System. Proc. CSCW 96, 258--267.  ",
      "doi": "10.1145/240080.240298"
    },
    {
      "text": "Intraspect. Enterprise Collaboration Management with Intraspect, http://www.intraspect.com/",
      "doi": ""
    },
    {
      "text": "Koch T. and Appelt W. Beyond Web Technology- Lessons Learnt from BSCW. Proc. 1998 IEEE WEI ICE Workshop, http://bscw.gmd.de/Papers/wetice98/index.html ",
      "doi": "10.5555/647066.715186"
    },
    {
      "text": "Leland, M., Fish, R., and Kraut, R. Collaborative Document Production Using Quilt. Proc. CSCW 88, 206--215.  ",
      "doi": "10.1145/62266.62282"
    },
    {
      "text": "Livelink. Functional Assessment of Open Text Livelink. http://www.opentext.com/livelink/",
      "doi": ""
    },
    {
      "text": "Lotus QuickPlace Release 2.0 Reviewer's Guide. http://www.lotus.com/home.nsf/welcome/quickplace",
      "doi": ""
    },
    {
      "text": "Microsoft Office 2000 Web Discussions, http://office.microsoft.com/assistance/2000/wWebDiscussions.aspx",
      "doi": ""
    },
    {
      "text": "Neuwirth, C. Kaufer, D. Chandhok, R. and Morris, J. Issues in the Design of Computer Support for Co-authoring and Commenting. Proc. CSCW 90, 183--195.  ",
      "doi": "10.1145/99332.99354"
    },
    {
      "text": "Ovsiannikov, I., Arbib, M., and McNeill, T. Annotation Technology, Int. J. Human Computer Studies, (1999) 50, 329--362.  ",
      "doi": "10.1006/ijhc.1999.0247"
    },
    {
      "text": "Röscheisen, M. Mogensen, C. and Winograd, T. Shared Web Annotations as a Platform for Third-Party Value-Added, Information Providers: Architecture, Protocols, and Usage Examples, Technical Report CSDTR/DLTR (1997), Stanford University. ",
      "doi": "10.5555/892605"
    }
  ]
}