{
  "doi": "10.1145/503376.503426",
  "title": "SCANMail: a voicemail interface that makes speech browsable, readable and searchable",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "275-282",
  "year": 2002,
  "badges": [],
  "abstract": "Increasing amounts of public, corporate, and private speech data are now available on-line. These are limited in their usefulness, however, by the lack of tools to permit their browsing and search. The goal of our research is to provide tools to overcome the inherent difficulties of speech access, by supporting visual scanning, search, and information extraction. We describe a novel principle for the design of UIs to speech data: What You See Is Almost What You Hear (WYSIAWYH). In WYSIAWYH, automatic speech recognition (ASR) generates a transcript of the speech data. The transcript is then used as a visual analogue to that underlying data. A graphical user interface allows users to visually scan, read, annotate and search these transcripts. Users can also use the transcript to access and play specific regions of the underlying message. We first summarize previous studies of voicemail usage that motivated the WYSIAWYH principle, and describe a voicemail UI, SCANMail, that embodies WYSIAWYH. We report on a laboratory experiment and a two-month field trial evaluation. SCANMail outperformed a state of the art voicemail system on core voicemail tasks. This was attributable to SCANMail's support for visual scanning, search and information extraction. While the ASR transcripts contain errors, they nevertheless improve the efficiency of voicemail processing. Transcripts either provide enough information for users to extract key points or to navigate to important regions of the underlying speech, which they can then play directly",
  "tags": [
    "asynchronous communication",
    "what you see is almost what you hear",
    "empirical evaluation",
    "\"speech as data\"",
    "voicemail",
    "speech access"
  ],
  "authors": [
    {
      "name": "Steve Whittaker",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318557",
      "orcid": "missing"
    },
    {
      "name": "Julia Hirschberg",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659235440",
      "orcid": "missing"
    },
    {
      "name": "Brian Amento",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346993",
      "orcid": "missing"
    },
    {
      "name": "Litza Stark",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100218855",
      "orcid": "missing"
    },
    {
      "name": "Michiel Bacchiani",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615985",
      "orcid": "missing"
    },
    {
      "name": "Philip Isenhour",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81546277456",
      "orcid": "missing"
    },
    {
      "name": "Larry Stead",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100039671",
      "orcid": "missing"
    },
    {
      "name": "Gary Zamchick",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100041699",
      "orcid": "missing"
    },
    {
      "name": "Aaron Rosenberg",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493208",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arons, B. Interactively skimming speech. Unpublished PhD thesis, MIT Media Lab, 1994. ",
      "doi": "10.5555/920916"
    },
    {
      "text": "Askwall, S. Computer supported reading vs reading text on paper: a comparison of two reading situations, International Journal of Man Machine Studies, 22, 425--439, 1985.",
      "doi": ""
    },
    {
      "text": "Boreczky, J., Girgensohn, A., Golovchinsky, G., and Uchihashi, S. An Interactive Comic Book Presentation for Exploring Video. In CHI2000, 185--192, 2000.  ",
      "doi": "10.1145/332040.332428"
    },
    {
      "text": "Chalfonte, B., Fish, R., and Kraut, R. Expressive richness. In CHI91, 21--26, 1991.  ",
      "doi": "10.1145/108844.108848"
    },
    {
      "text": "Degen, L., Mander, R., and Salomon, G. Working with audio. In CHI92, 413--418, 1992.  ",
      "doi": "10.1145/142750.142877"
    },
    {
      "text": "Hauptmann and Witbrock, M. Informedia: News-on-Demand Multimedia Information Acquisition and Retrieval, In M. Maybury (Ed.), Intelligent Multimedia Information Retrieval, AAAI Press, pp. 213--239, 1997. ",
      "doi": "10.5555/266260.266279"
    },
    {
      "text": "Hindus, D., Schmandt, C., and Horner, C. Capturing, structuring and representing ubiquitous audio. ACM Transactions on Information Systems, 11, 1993.  ",
      "doi": "10.1145/159764.159761"
    },
    {
      "text": "Hirschberg, J., Bacchiani, M., Hindle, D., Isenhour, P., Rosenberg, A., Stark, L., Stead, L., Zamchick, G., and Whittaker, S. SCANMail: Browsing and Searching Speech Data by Content, Proceedings of Eurospeech 2001, Aalborg, 2001.",
      "doi": ""
    },
    {
      "text": "Hirschberg, J. and Nakatani, C. Acoustic indicators of topic segmentation. In ICSLP98, 1998.",
      "doi": ""
    },
    {
      "text": "Jones, G., Foote, J., Spärck Jones, K., and Young, S. Retrieving Spoken Documents by Combining Multiple Index Sources, In SIGIR96, 30--38, 1996.  ",
      "doi": "10.1145/243199.243208"
    },
    {
      "text": "Kazman, R., Al-Halimi, R., Hunt, W., and Mantei, M. Four paradigms for indexing videoconferences. In IEEE Multimedia, 3(1), 63--73, 1996.  ",
      "doi": "10.1109/93.486705"
    },
    {
      "text": "Moran, T., Palen, L., Harrison, S., Chiu, P., Kimber, D., Minneman, S., van Melle, W., and Zellweger, P. \"I'll get that off the audio\": salvaging in a multimedia meeting. In CHI97, 202--209, 1997.  ",
      "doi": "10.1145/258549.258704"
    },
    {
      "text": "Rice R. and Shook, D. Voice messaging coordination and communication. In C. Egido, J. Galegher and R. Kraut, eds., Intellectual Teamwork, Lawrence Erlbaum, NJ, 1990. ",
      "doi": "10.5555/117848.117860"
    },
    {
      "text": "Rice, R.E., & Tyler, J. (1995). Individual and organizational influences on voicemail use and evaluation. Behaviour and Information Technology, 14(6), 329--341.",
      "doi": ""
    },
    {
      "text": "Salton, G. The SMART Retrieval System, Prentice-Hall, Englewood Cliffs, NJ, 1971.",
      "doi": ""
    },
    {
      "text": "Stark, L., Whittaker, S., and Hirschberg, J. ASR satisficing: the effects of ASR accuracy on speech retrieval. In Proceedings of International Conference on Spoken Language Processing, 2000.",
      "doi": ""
    },
    {
      "text": "Stifelman, L., Arons, B., and Schmandt, C. The audio notebook: paper and pen interaction with structured speech. In CHI2001, 182--189, 2001.  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Whittaker, S., Davis, R., Hirschberg, J., and Muller, U. Jotmail: a voicemail interface that enables you to see what was said. In CHI2000, 89-96, 2000.  ",
      "doi": "10.1145/332040.332411"
    },
    {
      "text": "Whittaker, S., Hirschberg, J., Choi, J., Hindle, D., Pereira, F., and Singhal, A. SCAN: designing and evaluating user interfaces to support retrieval from speech archives. In SIGIR99, 26--33, 1999.  ",
      "doi": "10.1145/312624.312639"
    },
    {
      "text": "Whittaker, S., Hirschberg, J. and Nakatani, C. All talk and all action. In CHI98, 249--250,1998.  ",
      "doi": "10.1145/286498.286732"
    },
    {
      "text": "Whittaker, S., Hirschberg, J. and Nakatani, C. Play it again: a study of the factors underlying speech browsing behaviour. In CHI98, 247--248,1998.  ",
      "doi": "10.1145/286498.286731"
    },
    {
      "text": "Whittaker, S., Hyland, P, and Wiley, M. Filochat: handwritten notes provide access to recorded conversations. In CHI94, 271--277, 1994.  ",
      "doi": "10.1145/191666.191763"
    },
    {
      "text": "Whittaker, S. and Sidner, C. Email overload: exploring personal information management of email. http://www.research.att.com/~stevew/emlch96.pdf In CHI'96 276-283, 1996.  ",
      "doi": "10.1145/238386.238530"
    },
    {
      "text": "Wilcox, L. Chen, F., Kimber, D. and Balasubramanian, V. Segmentation of Speech Using Speaker Identification. Proc. ICASSP, 1994.",
      "doi": ""
    }
  ]
}