{
  "doi": "10.1145/503376.503418",
  "title": "How knowledge workers use the web",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "227-234",
  "year": 2002,
  "badges": [],
  "abstract": "We report on a diary study of how and why knowledge workers use the World Wide Web. By examining in detail a complete two-day set of Web activities from each of 24 people, we construct a framework with which to describe the different tasks knowledge workers undertake. By looking at the characteristics of each type of activity, we can see how certain activities are unsuited to particular kinds of technologies (e.g., mobile devices); how Web tools might be incrementally improved; and how we might better support knowledge workers' Web tasks in the future",
  "authors": [
    {
      "name": "Abigail J. Sellen",
      "institution": "Hewlett Packard Research Labs, Bristol UK",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    },
    {
      "name": "Rachel Murphy",
      "institution": "Hewlett Packard Research Labs, Bristol UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100545376",
      "orcid": "missing"
    },
    {
      "name": "Kate L. Shaw",
      "institution": "Aston University, Aston Triangle , Birmingham UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659694877",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Berners-Lee, T., Hendler, J. & Lassila, O. (2001). The semantic Web. Scientific American, Vol. 5(1).",
      "doi": ""
    },
    {
      "text": "Bruce, H. (1998). User satisfaction with information seeking on the Internet. Journal of the American Society for Information Science, 49 (6).  ",
      "doi": "10.5555/305384.305397"
    },
    {
      "text": "Buxton, W. (2001). Less is more (more or less): Some thoughts on the design of computers and the future. In P. Denning (Ed.), The Invisible Future: The seamless integration of technology in everyday life. New York: McGraw Hill. ",
      "doi": "10.5555/504949.504959"
    },
    {
      "text": "Byrne, M.D., John, B.E., Wehrle, N.S., & Crow, D.C. (1999). The tangled web we wove: A taxonomy of WWW use. Proc. CHI 99, 544--551.  ",
      "doi": "10.1145/302979.303154"
    },
    {
      "text": "Card, S, Robertson, G. & York, W. (1996). The Webbook and Web forager: An information workspace for the World Wide Web. Proc. CHI '96, New York: ACM Press.  ",
      "doi": "10.1145/238386.238446"
    },
    {
      "text": "Card, S., Pirolli, P., Van Der Wage, M., Morrison, J., Reeder, R.W., Schraedley, P.K., & Boshart, J. (2001). Information scent as a driver of web behaviour graphs: Results of a protocol analysis method for Web usability. Proc. CHI 2001, 498--505.  ",
      "doi": "10.1145/365024.365331"
    },
    {
      "text": "Chi, E.H., Pirolli, P., Chen, K., and Pitkow, J. (2001). Using information scent to model user information needs and actions on the Web. Proc. CHI 2001, 490--497.  ",
      "doi": "10.1145/365024.365325"
    },
    {
      "text": "Fogg, B.J, Marshall, J., Osipovich, A., Varma, C., Laraki, O., Fang, N., Paul, J., Rangnekar, A., Shon, J., Swani, P. and Treinen, M. (2000). Elements that affect Web credibility. Proc. CHI 2000, Extended Abstracts, 287--288.  ",
      "doi": "10.1145/633292.633460"
    },
    {
      "text": "Harmon, A. (2001). Exploration of the World Wide Web Tilts from Eclectic to Mundane. The New York Times, Aug. 26.",
      "doi": ""
    },
    {
      "text": "Huberman, B. (2001). The Laws of the Web. Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Morrison, J., Pirolli, P., and Card, S. (2001). A taxonomic analysis of what World Wide Web activities significantly impact people's decisions and actions. Proc. CHI 2001, Extended Abstracts, 163--164.  ",
      "doi": "10.1145/634067.634167"
    },
    {
      "text": "O'Hara, K., Perry, M., Sellen, A. and Brown, B. (2001). Managing information on the move. In Brown, B, Green, N and Harper, R (Eds.) Wireless world: Social and interactional aspects of the mobile age. The Hague, Netherlands: Springer Verlag.",
      "doi": ""
    },
    {
      "text": "Pettit, S. (1995). Internet use by UK academic law librarians. The Law Librarian, 26(1).",
      "doi": ""
    },
    {
      "text": "Spasojevic, M. & Kindberg, T. (2001). A study of an augmented museum experience. HP Labs Technical Report No. HPL-2001-178.",
      "doi": ""
    },
    {
      "text": "UCLA Internet Report (2000). The UCLA Internet Report: Surveying the Digital Future. Available at http://www.ccp.ucla.edu/.",
      "doi": ""
    },
    {
      "text": "Wei Choo C., Detlor, B. & Turnbull, D. (2000). Information seeking on the web: An integrated model of searching and browsing. First Monday, Vol. 5(2).",
      "doi": ""
    },
    {
      "text": "Youll, J. (2001). Wherehoo and periscope: A time & place server and tangible browser for the real world. Proc. CHI 2001, Extended Abstracts, 109--110.  ",
      "doi": "10.1145/634067.634134"
    }
  ]
}