{
  "doi": "10.1145/503376.503406",
  "title": "An evaluation of a multiple interface design solution for bloated software",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "164-170",
  "year": 2002,
  "badges": [],
  "abstract": "This study examines a novel interface design for heavily-featured productivity software. The design includes two interfaces between which the user can easily toggle: (1) an interface personalized by the user containing desired features only, and (2) the default interface with all the standard features. This design was prototyped as a front-end to a commercial word processor and evaluated in a comprehensive field study. The study tested the effects of different interface designs on users' satisfaction and their perceived ability to navigate, control, and learn the software. There were two conditions: a commercial word processor with adaptive menus and our two-interface prototype with adaptable menus for the same word processor. Results showed that participants were better able to navigate through the menus and toolbars and were better able to learn with our prototype. There were also significant differences in satisfaction and control with our design",
  "authors": [
    {
      "name": "Joanna McGrenere",
      "institution": "University of Toronto, Toronto ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    },
    {
      "name": "Ronald M. Baecker",
      "institution": "University of Toronto, Toronto ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100448368",
      "orcid": "missing"
    },
    {
      "name": "Kellogg S. Booth",
      "institution": "University of British Columbia, Vancouver BC",
      "img": "/do/10.1145/contrib-81100170154/rel-imgonly/kelly2014.jpg",
      "acmid": "81100170154",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Campbell, D.T., and Stanley, J.C. (1972). Experimental and quasi-experimental designs for research. Chicago, IL: Rand McNally & Company.",
      "doi": ""
    },
    {
      "text": "Carroll, J., and Carrithers, C. (1984). Blocking learner error states in a training-wheels system. Human Factors, 26(4), 377--389.",
      "doi": ""
    },
    {
      "text": "Fischer, G. (1993). Shared knowledge in cooperative problem-solving systems - integrating adaptive and adaptable components. In M. Schneider-Hufschmidt, T. Kuhme and U. Malinowski (Eds.), Adaptive user interfaces: Principles and practice (pp. 49--68). North Holland: Elsevier Science Publishers B.V.",
      "doi": ""
    },
    {
      "text": "Greenberg, S. (1993). The computer user as toolsmith: The use, reuse, and organization of computer-based tools. Cambridge: Cambridge University Press. ",
      "doi": "10.5555/151147"
    },
    {
      "text": "Horvitz, E. (1999). Principles of mixed-initiative user interfaces. CHI 99, 159--166.  ",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Hsi, I. and Potts, C. (2000). Studying the evolution and enhancement of software features. International Conference on Software Maintenance, 143--151. ",
      "doi": "10.5555/850948.853409"
    },
    {
      "text": "Kaufman, L. and Weed, B. (1998). Too much of a good thing? Identifying and resolving bloat in the user interface: A CHI 98 workshop. SIGCHI Bulletin, 30(4), 46--47.  ",
      "doi": "10.1145/310307.310370"
    },
    {
      "text": "Landauer, T. (1997). Chapter 9: Behavioral research methods in human-computer interaction. In M.G. Helander, T.K. Landauer, and P.V. Prabhu, (Eds), Handbook of human-computer interaction (2nd ed.) (pp. 203--227). Amsterdam: Elsevier Science B.V.",
      "doi": ""
    },
    {
      "text": "Linton, F., Joy, D. and Schaefer, P., Charron, A. (2000). OWL: A recommender system for organization-wide learning. Educational Technology & Society, 3(1).",
      "doi": ""
    },
    {
      "text": "Mackay, W. E. (1991). Triggers and barriers to customizing software. CHI'91, 153--160.  ",
      "doi": "10.1145/108844.108867"
    },
    {
      "text": "McGrenere (2002). The design and evaluation of multiple interfaces: A solution for complex software. Doctoral dissertation, University of Toronto, Canada. ",
      "doi": "10.5555/936347"
    },
    {
      "text": "McGrenere, J. and Moore, G. (2000). Are we all in the same \"bloat\"? Graphics Interface 2000, 187--196.",
      "doi": ""
    },
    {
      "text": "Microsoft Office 2000 (2000). Products Enhancements Guide. http://www.microsoft.com/>Office/evaluation/ofcpeg.htm",
      "doi": ""
    },
    {
      "text": "Miller, J.R., Sullivan, J.W., and Tyler, S.W. (1991). Introduction. In J.S. Sullivan and S.W. Tyler (Eds.) Intelligent User Interfaces (pp. 1--10). NY: ACM Press.  ",
      "doi": "10.1145/107215.128689"
    },
    {
      "text": "Norman, Don. (1998). The Invisible Computer. Cambridge, MA: MIT Press, 80. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "Shneiderman, B. (1997). Designing the user interface: Strategies for effective human-computer interaction (3rd ed.). Reading, MA: Addison-Wesley Publishing. ",
      "doi": "10.5555/523237"
    },
    {
      "text": "Shneiderman, B., and Maes, P. (1997). Direct manipulation vs. interface agents: Excerpts from debates at IUI 97 and CHI 97. Interactions, 4(6), 42--61.  ",
      "doi": "10.1145/267505.267514"
    }
  ]
}