{
  "doi": "10.1145/503376.503442",
  "title": "Statistical profiles of highly-rated web sites",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "367-374",
  "year": 2002,
  "badges": [],
  "abstract": "We are creating an interactive tool to help non-professional web site builders create high quality designs. We have previously reported that quantitative measures of web page structure can predict whether a site will be highly or poorly rated by experts, with accuracies ranging from 67--80%. In this paper we extend that work in several ways. First, we compute a much larger set of measures (157 versus 11), over a much larger collection of pages (5300 vs. 1900), achieving much higher overall accuracy (94% on average) when contrasting good, average, and poor pages. Second, we introduce new classes of measures that can make assessments at the site level and according to page type (home page, content page, etc.). Finally, we create statistical profiles of good sites, and apply them to an existing design, showing how that design can be changed to better match high-quality designs",
  "authors": [
    {
      "name": "Melody Y. Ivory",
      "institution": "UC Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100296046",
      "orcid": "missing"
    },
    {
      "name": "Marti A. Hearst",
      "institution": "UC Berkeley, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100612246/rel-imgonly/marti_small.jpg",
      "acmid": "81100612246",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Neil Bowers. Weblint: quality assurance for the World Wide Web. In Proceedings of the Fifth International World Wide Web Conference, Paris, France, May 1996. Amsterdam, The Netherlands: Elsevier Science Publishers. ",
      "doi": ""
    },
    {
      "text": "Giorgio Brajnik. Automatic web usability evaluation: Where is the limit? In Proceedings of the 6th Conference on Human Factors & the Web, Austin, TX, June 2000.",
      "doi": ""
    },
    {
      "text": "Leo Breiman, J. H. Friedman, R. A. Olshen, and C. J. Stone. Classification and Regression Trees. Wadsworth Publishing Company, Belmont, California, U.S.A., 1984.",
      "doi": ""
    },
    {
      "text": "CAST. Bobby. http://www.cast.org/bobby/, 2000.",
      "doi": ""
    },
    {
      "text": "Ed H. Chi, Peter Pirolli, and James Pitkow. The scent of a site: A system for analyzing and predicting information scent, usage, and usability of a web site. In Proceedings of the Conference on Human Factors in Computing Systems, pages 161--168, The Hague, The Netherlands, April 2000. New York, NY: ACM Press.  ",
      "doi": ""
    },
    {
      "text": "Melody Y. Ivory. An Empirical Foundation for Automated Web Interface Evaluation. PhD thesis, University of California, Berkeley, Computer Science Division, 2001. In preparation. ",
      "doi": ""
    },
    {
      "text": "Melody Y. Ivory, Rashmi R. Sinha, and Marti A. Hearst. Preliminary findings on quantitative measures for distinguishing highly rated information-centric web pages. In Proceedings of the 6th Conference on Human Factors & the Web, Austin, TX, June 2000.",
      "doi": ""
    },
    {
      "text": "Melody Y. Ivory, Rashmi R. Sinha, and Marti A. Hearst. Empirically validated web page design metrics. In Proceedings of the Conference on Human Factors in Computing Systems, volume 1, pages 53--60, Seattle, WA, March 2001.  ",
      "doi": ""
    },
    {
      "text": "N. Kim and B. J. Fogg. World wide web credibility: What effects do advertisements and typos have on the perceived credibility of web page information? Unpublished thesis, Stanford University, 1999.",
      "doi": ""
    },
    {
      "text": "Mark W. Newman and James A. Landay. Sitemaps, storyboards, and specifications: A sketch of web site design practice. In Proceedings of Designing Interactive Systems: DIS 2000, Automatic Support in Design and Use, pages 263--274, August 2000.  ",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. Designing Web Usability: The Practice of Simplicity. Indianapolis, IN: New Riders Publishing, 2000. ",
      "doi": ""
    },
    {
      "text": "Julie Ratner, Eric M. Grose, and Chris Forsythe. Characterization and assessment of HTML style guides. In Proceedings of the Conference on Human Factors in Computing Systems, volume 2, pages 115--116, Vancouver, Canada, April 1996. New York, NY: ACM Press.  ",
      "doi": "10.1145/257089.257193"
    },
    {
      "text": "Nathan Shedroff. Experience Design 1. Indianapolis, IN: New Riders Publishing, 2001. ",
      "doi": ""
    },
    {
      "text": "Rashmi Sinha, Marti Hearst, and Melody Ivory. Content or graphics? an empirical analysis of criteria for award-winning websites. In Proceedings of the 7th Conference on Human Factors & the Web, Madison, WI, June 2001.",
      "doi": ""
    },
    {
      "text": "Jared M. Spool, Tara Scanlon, Will Schroeder, Carolyn Snyder, and Terri DeAngelo. Web Site Usability: A Designer's Guide. Morgan Kaufmann Publishers, Inc., San Francisco, 1999. ",
      "doi": ""
    },
    {
      "text": "SPSS Inc. SPSS Base 10.0 Applications Guide. Chicago, IL: SPSS Inc., 1999.",
      "doi": ""
    },
    {
      "text": "The International Academy of Arts and Sciences. The webby awards 2000 judging criteria. http://www.webbyawards.com/judging/criteria.html, 2000.",
      "doi": ""
    },
    {
      "text": "Yin Leng Theng and Gil Marsden. Authoring tools: Towards continuous usability testing of web documents. In Proceedings of the 1st International Workshop on Hypermedia Development, Pittsburg, PA, June 1998.",
      "doi": ""
    },
    {
      "text": "Web Criteria. Max, and the objective measurement of web sites. http://www.webcriteria.com, 1999.",
      "doi": ""
    }
  ]
}