{
  "doi": "10.1145/503376.503428",
  "title": "Gestural and audio metaphors as a means of control for mobile devices",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "291-298",
  "year": 2002,
  "badges": [],
  "abstract": "This paper discusses the use of gesture and non-speech audio as ways to improve the user interface of a mobile music player. Their key advantages mean that users could use a player without having to look at its controls when on the move. Two very different evaluations of the player took place: one based on a standard usability experiment (comparing the new player to a standard design) and the other a video analysis of the player in use. Both of these showed significant usability improvements for the gesture/audio-based interface over a standard visual/pen-based display. The similarities and differences in the results produced by the two studies are discussed",
  "tags": [
    "gestures",
    "non-speech audio",
    "metaphor",
    "evaluation",
    "mobile computing"
  ],
  "authors": [
    {
      "name": "Antti Pirhonen",
      "institution": "University of Jyväskylä, Jyväskylä; Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100551162",
      "orcid": "missing"
    },
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow, UK",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    },
    {
      "name": "Christopher Holguin",
      "institution": "University of Glasgow, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100474693",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blattner, M., Sumikawa, D. and Greenberg, R. Earcons and icons: Their structure and common design principles. Human Computer Interaction 4, 1 (1989), 11--44.]]  ",
      "doi": ""
    },
    {
      "text": "Brewster, S.A. and Cryer, P.G. Maximising Screen-Space on Mobile Computing Devices. In Summary Proceedings of ACM CHI'99 (Pittsburgh, PA) ACM Press, 1999, pp. 224--225.]]  ",
      "doi": ""
    },
    {
      "text": "Brewster, S.A. and Walker, V.A. Non-Visual Interfaces for Wearable Computers. In Proceedings of IEE workshop on Wearable Computing (IEE, London) IEE, 00/145, 2000.]]",
      "doi": ""
    },
    {
      "text": "Brewster, S.A., Wright, P.C. and Edwards, A.D.N. An evaluation of earcons for use in auditory human-computer interfaces. In Proceedings of ACM/IFIP INTERCHI'93 (Amsterdam, Holland) ACM Press, Addison-Wesley, 1993, pp. 222--227.]] ",
      "doi": "10.1145/169059.169179"
    },
    {
      "text": "Clark-Carter, D.D., Heyes, A.D. and Howarth, C. The efficiency and walking speed of visually impaired people. Ergonomics 29, 6 (1986), 779--789.]]",
      "doi": ""
    },
    {
      "text": "Garcia, L. and Quek, F. Qualitative research in information systems: Time to be subjective? In Proceedings of Information systems and qualitative research (Philadelphia, USA), Chapman and Hall, 1997, pp. 444--465.]] ",
      "doi": ""
    },
    {
      "text": "Gentner, D. and Nielsen, J. The anti-mac interface. Communications of the ACM 39, 8 (1996), 70--82.]]  ",
      "doi": ""
    },
    {
      "text": "Harrison, B.L., Fishkin, K.P., Gujar, A., Mochon, C. and Want, R. Squeeze me, hold me, tilt me! An exploration of manipulative user interfaces. In Proceedings of ACM CHI'98 (Los Angeles, CA) ACM Press Addison-Wesley, 1998, pp. 17--24.]]  ",
      "doi": "10.1145/274644.274647"
    },
    {
      "text": "Hart, S.G. and Wickens, C. Workload assessment and prediction. In MANPRINT, an approach to systems integration, Booher, H.R. (Ed.), Van Nostrand Reinhold, New York, 1990, 257--296.]]",
      "doi": ""
    },
    {
      "text": "Johnson, P. Usability and Mobility; Interactions on the move. In First Workshop on HCI with Mobile Devices (Glasgow, UK) Glasgow University, 1998.]]",
      "doi": ""
    },
    {
      "text": "Kvale, S. Issues of validity in qualitative research. Chartwell Bratt, London, 1989.]]",
      "doi": ""
    },
    {
      "text": "Lakoff, G. and Johnson, M. Metaphors we live by. The University of Chicago Press, Chicago, 1980.]]",
      "doi": ""
    },
    {
      "text": "Lee, S.H. Usability testing for developing effective interactive multimedia software: concepts, dimensions, and procedures. Educational Technology & Society 2, 2 (1999).]]",
      "doi": ""
    },
    {
      "text": "Long, A., Landay, J. and Rowe, L. Implications for a gesture design tool. In Proceedings of ACM CHI'99 (Pittsburgh, PA) ACM Press Addison-Wesley, 1999, pp. 40--47.]]  ",
      "doi": ""
    },
    {
      "text": "Nardi, B.A. and Zarmer, C.L. Beyond models and metaphors: Visual formalism in user interface design. Journal of Visual Languages and Computing 4 (1993), 5--33.]]",
      "doi": ""
    },
    {
      "text": "Pauws, S., Bouwhuis, D. and Eggen, B. Programming and enjoying music with your eyes closed. In Proceedings of ACM CHI2000 (The Hague, The Netherlands) ACM Press, Addison-Wesley, 2000, pp. 376--383.]]  ",
      "doi": ""
    },
    {
      "text": "Petrie, H., Furner, S. and Strothotte, T. Design Lifecycles and Wearable Computers for Users with Disabilities. In First workshop on HCI mobile devices (Glasgow, UK) Glasgow University, 1998.]]",
      "doi": ""
    },
    {
      "text": "Pirhonen, A. Analysis of the concept of redundancy concerning the design of multimodal combinations of output-elements. In Proceedings of APCHI98 (Los Alamitos, CA) IEEE, 1998, pp. 273--278.]] ",
      "doi": ""
    },
    {
      "text": "Pirhonen, A. Creating virtual objects. In Proceedings of IRIS 22 Technical Report TR-21, Vol. 3. University of Jyväskylä, Department of Computer Science and Information Systems, 1999, pp. 57--69.]]",
      "doi": ""
    },
    {
      "text": "Sawhney, N. and Schmandt, C. Nomadic Radio: speech and audio interaction for contextual messaging in nomadic environments. ACM Transactions on Human-Computer Interaction 7, 3 (2000), 353--383.]]  ",
      "doi": ""
    }
  ]
}