{
  "doi": "10.1145/503376.503378",
  "title": "Where do web sites come from?: capturing and interacting with design history",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2002,
  "badges": [],
  "abstract": "To form a deep understanding of the present; we need to ?nd and engage history. We present an informal history capture and retrieval mechanism for collaborative, early-stage information design. This history system is implemented in the context of the Designers' Outpost, a wall-scale, tangible interface for collaborative web site design. The interface elements in this history system are designed to be ?uid and comfortable for early-phase design. As demonstrated by an informal lab study with six professional designers, this history system enhances the design process itself, and provides new opportunities for reasoning about the design of complex artifacts",
  "tags": [
    "sketching",
    "web design",
    "CSCW",
    "tangible UI",
    "history management",
    "activity capture",
    "informal interfaces",
    "design rationale"
  ],
  "authors": [
    {
      "name": "Scott R. Klemmer",
      "institution": "University of California, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100364989/rel-imgonly/scott2016crop.jpg",
      "acmid": "81100364989",
      "orcid": "missing"
    },
    {
      "name": "Michael Thomsen",
      "institution": "University of Aarhus, Aarhus N, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100624565",
      "orcid": "missing"
    },
    {
      "name": "Ethan Phelps-Goodman",
      "institution": "University of California, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100268477",
      "orcid": "missing"
    },
    {
      "name": "Robert Lee",
      "institution": "University of California, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452595293",
      "orcid": "missing"
    },
    {
      "name": "James A. Landay",
      "institution": "University of California, Berkeley, CA",
      "img": "/do/10.1145/contrib-81100103519/rel-imgonly/rsd17_051_0272a-small.jpg",
      "acmid": "81100103519",
      "orcid": "0000-0003-1520-8894"
    }
  ],
  "references": [
    {
      "text": "Abowd, G.D., Classroom 2000: An Experiment with the Instrumentation of a Living Educational Environment. IBM Systems Journal, 1999. 38(4): p. 508--530.  ",
      "doi": "10.1147/sj.384.0508"
    },
    {
      "text": "Bellotti, V. and Y. Rogers. From Web Press to Web Pressure: Multimedia Representations and Multimedia Publishing. In Proceedings of Human Factors in Computing Systems: CHI '97. Atlanta, GA. pp. 279--286, 1997.  ",
      "doi": "10.1145/258549.258755"
    },
    {
      "text": "Edwards, W.K. and E.D. Mynatt. Timewarp: techniques for autonomous collaboration. In Proceedings of Human factors in computing systems. Atlanta, GA: ACM Press. pp. 218--225, March 22--27, 1997.  ",
      "doi": "10.1145/258549.258710"
    },
    {
      "text": "Gamma, E., R. Helm, R. Johnson, and J. Vlissides, Command, in Design Patterns: Elements of Reusable Object-Oriented Software. Addison-Wesley Pub Co. p. 233--242, 1995. ",
      "doi": "10.5555/186897"
    },
    {
      "text": "Hong, J.I. and J.A. Landay, SATIN: A Toolkit for Informal Ink-based Applications. UIST 2000, ACM Symposium on User Interface Software and Technology, CHI Letters, 2000. 2(2): p. 63--72.  ",
      "doi": "10.1145/354401.354412"
    },
    {
      "text": "Kaasten, S. and S. Greenberg. Integrating Back, History and Bookmarks in Web Browsers. In Proceedings of Extended Abstracts of the ACM Conference of Human Factors in Computing Systems. Seattle, WA: ACM Press. pp. 379--380, 2001.  ",
      "doi": "10.1145/634067.634291"
    },
    {
      "text": "Klemmer, S.R., M.W. Newman, R. Farrell, M. Bilezikjian, and J.A. Landay, The Designers' Outpost: A Tangible Interface for Collaborative Web Site Design. The 14th Annual ACM Symposium on User Interface Software and Technology: UIST2001, CHI Letters, 2001. 3(2): p. 1--10.  ",
      "doi": "10.1145/502348.502350"
    },
    {
      "text": "Kurlander, D. and S. Feiner. A history-based macro by example system. In Proceedings of UIST '92: 5th Annual Symposium on User Interface Software and Technology. Monterey, CA, USA: ACM Press. pp. 99--106, November 15--18, 1992.  ",
      "doi": "10.1145/142621.142633"
    },
    {
      "text": "Landay, J.A. and B.A. Myers, Sketching Interfaces: Toward More Human Interface Design. IEEE Computer, 2001. 34(3): p. 56--64.  ",
      "doi": "10.1109/2.910894"
    },
    {
      "text": "MacLean, A., R.M. Young, V. Bellotti, and T.P. Moran, Questions, options, and criteria: elements of design space analysis. Human-Computer Interaction, 1991. 6(3-4): p. 201--250.",
      "doi": ""
    },
    {
      "text": "Moran, T.P. and J.M. Carroll, Design Rationale: Concepts, Techniques, and Use. ed. Lawrence Erlbaum Associates.: Mahwah, N.J., 1996. ",
      "doi": "10.5555/261685"
    },
    {
      "text": "Moran, T.P., et al. \"I'll get that off the audio\": a case study of salvaging multimedia records. In Proceedings of Conference on Human Factors in Computing Systems. Atlanta, GA. pp. 202--209, March 22--27, 1997.  ",
      "doi": "10.1145/258549.258704"
    },
    {
      "text": "Myers, B.A. and D.S. Kosbie. Reusable hierarchical command objects. In Proceedings of Human factors in computing systems. Vancouver, Canada: ACM Press. pp. 260--267, April 13--18, 1996.  ",
      "doi": "10.1145/238386.238526"
    },
    {
      "text": "Newman, M.W. and J.A. Landay. Sitemaps, Storyboards, and Specifications: A Sketch of Web Site Design Practice. In Proceedings of Designing Interactive Systems: DIS 2000. New York, NY. pp. 263--274, August 17--19, 2000.  ",
      "doi": "10.1145/347642.347758"
    },
    {
      "text": "Rhyne, J.R. and C.G. Wolf. Tools for supporting the collaborative process. In Proceedings of the fifth annual ACM symposium on User interface software and technology. Monterey, CA: ACM Press. pp. 161--170, November 15--18, 1992.  ",
      "doi": "10.1145/142621.142645"
    },
    {
      "text": "Richter, H., G.D. Abowd, W. Geyer, L. Fuchs, S. Daijavad, and S. Poltrock. Integrating Meeting Capture within a Collaborative Team Environment. In Proceedings of Ubicomp 2001. pp. 123--138, 2001. ",
      "doi": "10.5555/647987.741341"
    },
    {
      "text": "Rittel, H.W.J. and M.M. Webber, Dilemmas in a general theory of planning. Policy Sciences, 1973. 4: p. 155--169.",
      "doi": ""
    },
    {
      "text": "Shipman, F.M. and H. Hseih, Navigable History: A Reader's View of Writer's Time. The New Review of Hypermedia and Multimedia, 2000. 6(1): p. 147--167.",
      "doi": ""
    },
    {
      "text": "Stallman, R., GNU Emacs: The extensible self-documenting text editor, 1993. Free Software Foundation: Cambridge, MA. ftp://prep.ai.mit.edu/pub/gnu",
      "doi": ""
    },
    {
      "text": "Stifelman, L., B. Arons, and C. Schmandt, The audio notebook: paper and pen interaction with structured speech. CHI 2001, Human Factors in Computing Systems, CHI Letters, 2001. 3(1): p. 182--189.  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Wilcox, L.D., B.N. Schilit, and N. Sawhney. Dynomite: a dynamically organized ink and audio notebook. In Proceedings of Conference on Human Factors and Computing Systems. Atlanta, GA. pp. 186--193, March 22--27, 1997.  ",
      "doi": "10.1145/258549.258700"
    }
  ]
}