{
  "doi": "10.1145/503376.503404",
  "title": "Automating CPM-GOMS",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "147-154",
  "year": 2002,
  "badges": [],
  "abstract": "CPM-GOMS is a modeling method that combines the task decomposition of a GOMS analysis with a model of human resource usage at the level of cognitive, perceptual, and motor operations. CPM-GOMS models have made accurate predictions about skilled user behavior in routine tasks, but developing such models is tedious and error-prone. We describe a process for automatically generating CPM-GOMS models from a hierarchical task decomposition expressed in a cognitive modeling tool called Apex. Resource scheduling in Apex automates the difficult task of interleaving the cognitive, perceptual, and motor resources underlying common task operators (e.g. mouse move-and-click). Apex's UI automatically generates PERT charts, which allow modelers to visualize a model's complex parallel behavior. Because interleaving and visualization is now automated, it is feasible to construct arbitrarily long sequences of behavior. To demonstrate the process, we present a model of automated teller interactions in Apex and discuss implications for user modeling",
  "authors": [
    {
      "name": "Bonnie John",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    },
    {
      "name": "Alonso Vera",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100219909",
      "orcid": "missing"
    },
    {
      "name": "Michael Matessa",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100048363",
      "orcid": "missing"
    },
    {
      "name": "Michael Freed",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100402556",
      "orcid": "missing"
    },
    {
      "name": "Roger Remington",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100413393",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baskin, J. D., and John, B. E. (1998). Comparison of GOMS Analysis Methods. Proceedings of ACM CHI'98 Conference on Human Factors in Computing System (Summary) 1998 v.2 p.261--262.  ",
      "doi": "10.1145/286498.286742"
    },
    {
      "text": "Baumeister, L. K., John, B. E., Byrne, M. D. (2000). A Comparison of Tools for Building GOMS Models. In Proceedings of ACM CHI2000 Conference on Human Factors in Computing Systems, v.1 p.502--509.  ",
      "doi": "10.1145/332040.332485"
    },
    {
      "text": "Beard, David V., Smith, Dana K. & Denelsbeck, Kevin M. (1996). Quick and Dirty GOMS: A Case Study of Computed Tomography, Human-Computer Interaction, 11 (2) p.157--180.  ",
      "doi": "10.1207/s15327051hci1102_3"
    },
    {
      "text": "Byrne, M. D., Wood, S. D., Sukaviriya, P. N., Foley, J. D. & Kieras, D. (1994). Automating Interface Evaluation, Proceedings of ACM CHI'94 Conference on Human Factors in Computing Systems, B. Adelson, S. Dumais, & J. Olson (Eds.), v.1, pp. 232--237. New York: ACM Press.  ",
      "doi": "10.1145/191666.191752"
    },
    {
      "text": "Card, S.K., Moran, T. P., & Newell, A. (1980). The keystroke-level model for user performance with interactive systems. Communications of the ACM, 23, 396--410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Card, S. K., Moran, T.P. & Newell, A. (1983). The Psychology of Human-Computer Interaction. Hillsdale, NJ: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Chuah, M. C., John, B. E., & Pane, J. (1994). Analyzing graphic and textual layouts with GOMS: Results of a preliminary analysis. In Proceedings Companion of CHI, 1994, (Boston, MA, USA, April 24-28, 1994). New York: ACM, pp. 323--324.  ",
      "doi": "10.1145/259963.260393"
    },
    {
      "text": "Firby, R. J. (1989). Adaptive Execution in Complex Dynamic Worlds. Ph.D. thesis, Yale University, Computer Science Department. Technical Report 672. ",
      "doi": "10.5555/916113"
    },
    {
      "text": "Freed, M. (1998a) Managing multiple tasks in complex, dynamic environments. In Proceedings of 15th National Conference on Artificial Intelligence, (Madison, Wisconsin,) Menlo Park, CA: AAAI Press/ MIT Press. pp. 921--927. ",
      "doi": "10.5555/295240.295924"
    },
    {
      "text": "Freed, M. (1998b) Simulating Human Performance in Complex, Dynamic Environments. Doctoral Dissertation, Northwestern University. ",
      "doi": "10.5555/926717"
    },
    {
      "text": "Freed, M. & Remington, R. (2000a) GOMS, GOMS+ and PDL. In Working Notes of the AAAI Fall Symposium on Simulating Human Agents. Falmouth, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Freed, M. & Remington, R. (2000b) Making human-machine system simulation a practical engineering tool: An Apex overview. In Proceedings of the Third International Conference on Cognitive Modeling. Veenendaal, The Netherlands: Universal Press. pp. 110--117.",
      "doi": ""
    },
    {
      "text": "Gong, R. & Kieras, D. (1994). A Validation of the GOMS Model Methodology in the Development of a Specialized, Commercial Software Application, Proceedings of CHI, 1994, New York: ACM Press, pp. 351--357.  ",
      "doi": "10.1145/191666.191782"
    },
    {
      "text": "Gray, W. D., & Boehm-Davis, D. A. (2000). Milliseconds matter: An introduction to microstrategies and to their use in describing and predicting interactive behavior. Journal of Experimental Psychology: Applied, 6(4), 322--335.",
      "doi": ""
    },
    {
      "text": "Gray, W. D., John, B. E. & Atwood, M. E. (1993) Project Ernestine: Validating a GOMS Analysis for Predicting and Explaining Real-World Task Performance, Human-Computer Interaction, 8 (3), pp. 237--309.",
      "doi": "10.1207/s15327051hci0803_3"
    },
    {
      "text": "Hudson, S.E., John, B.E., Knudsen, K., & Byrne, M. D. (1999). A Tool for Creating Predictive Performance Models from User Interface Demonstrations. Proceedings of the ACM Symposium on User Interface Software and Technology, p.93--102.  ",
      "doi": "10.1145/320719.322590"
    },
    {
      "text": "John, B. E. (1988) Contributions to Engineering Models of human-computer interaction. Ph.D. Thesis. Carnegie Mellon University. ",
      "doi": "10.5555/914674"
    },
    {
      "text": "John, B. E. (1990) Extensions of GOMS analyses to expert performance requiring perception of dynamic visual and auditory information. In proceedings of CHI, 1990 (Seattle, Washington, April 30-May 4, 1990) ACM, New York, 107--115.  ",
      "doi": "10.1145/97243.97262"
    },
    {
      "text": "John, B. E. (1996) TYPIST: A Theory of Performance In Skilled Typing. Human-Computer Interaction , 11 (4), pp.321--355.  ",
      "doi": "10.1207/s15327051hci1104_2"
    },
    {
      "text": "John, B. E. & Gray, W. D. GOMS Analyses for Parallel Activities. Tutorial materials, presented at CHI, 1992 (Monterey, California, May 3- May 7, 1992), CHI, 1994 (Boston MA, April 24-28, 1994) and CHI, 1995 (Denver CO, May 7-11, 1995) ACM, New York.  ",
      "doi": "10.1145/259963.260522"
    },
    {
      "text": "John, B. E. & Kieras, D. E. (1996a). The GOMS family of user interface analysis techniques: Comparison and Contrast, ACM Transactions on Computer-Human Interaction, 3 (4), pp. 320--351.  ",
      "doi": "10.1145/235833.236054"
    },
    {
      "text": "John, B. E. & Kieras, D. E. (1996b) Using GOMS for user interface design and evaluation: Which technique?, ACM Transactions on Computer-Human Interaction, 3 (4), pp. 287--319.  ",
      "doi": "10.1145/235833.236050"
    },
    {
      "text": "Kieras, D. E. (1996) Guide to GOMS model usability evaluations using NGOMSL, The Handbook of Human-Computer Interaction, M. Helander and T.Landauer (Eds.), 2nd ed. North-Holland Amsterdam.",
      "doi": ""
    },
    {
      "text": "Kieras, D. E., Wood, S. D., Abotel, K., & Hornof, A. (1995). GLEAN: A Computer-Based Tool for Rapid GOMS Model Usability Evaluation of User Interface Designs. International Journal of Man-Machine Studies, 22, 365--394.",
      "doi": ""
    },
    {
      "text": "Kitajima, M. & Polson, P. G. (1995) A comprehension-based model of correct performance and errors in skilled, display-based, human-computer interaction. International Journal of Human-Computer Studies, 43(1):65--99.  ",
      "doi": "10.1006/ijhc.1995.1036"
    },
    {
      "text": "Kosbie, D. S. & John, B. E. (1994). Hierarchical Event Histories and GOMS, Poster at the Human-Computer Interaction Consortium Winter Workshop (January, 1994, Frasier, Colorado.)",
      "doi": ""
    },
    {
      "text": "Lee, Adrienne Y., Polson, Peter G. & Bailey, Wayne A. (1989). Learning and Transfer of Measurement Tasks Performing Prediction: Predicting Performance, Proceedings of ACM CHI'89 Conference on Human Factors in Computing Systems, p.115--120.  ",
      "doi": "10.1145/67449.67473"
    },
    {
      "text": "Lerch, F. J., Mantei, M. M. & Olson, J. R. (1989). Translating Ideas into Action: Cognitive Analysis of Errors in Spreadsheet Formulas, Proceedings of ACM CHI'89 Conference on Human Factors in Computing System, pp. 121--126. New York: ACM.  ",
      "doi": "10.1145/67449.67474"
    },
    {
      "text": "Pirolli, P. and Card, S. K. (1999). Information foraging. Psychological Review, 106, 643--675.",
      "doi": ""
    },
    {
      "text": "Williams, K. E. (1993) Automating the cognitive task modeling process: An extension to GOMS for HCI. In Proceedings of the Fifth International Conference on Human-Computer Interaction Poster Sessions: Abridged Proceedings (vol 3. p. 182).",
      "doi": ""
    },
    {
      "text": "Young, R. M., Green, T. R. G., & Simon, T. (1989) Programmable user models for predictive evaluation of interface designs. In J. C. Chew & J. Whiteside (Eds) Proceedings of ACM CHI'89 Conference on Human Factors in Computing Systems, 15--19. ACM Press.  ",
      "doi": "10.1145/67449.67453"
    },
    {
      "text": "Young, R. M. & Wittington, J. E. (1990) Using a knowledge analysis to predict conceptual errors in text-editor usage. In J. C. Chew & J. Whiteside (Eds) Proceedings of ACM CHI'90 Conference on Human Factors in Computing System, 91--97. ACM Press.  ",
      "doi": "10.1145/97243.97260"
    }
  ]
}