{
  "doi": "10.1145/503376.503419",
  "title": "Applying patterns of cooperative interaction to work (re)design: e-government and planning",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "235-242",
  "year": 2002,
  "badges": [],
  "abstract": "This paper presents patterns of cooperative interaction derived from ethnographic studies of cooperative work as devices for generalisation, re-use and design. These patterns consist of examples of similar social and interactional phenomena found in different studies that serve as resources for defining and envisaging design concepts, and potential work process and technical solutions. We outline new pattern examples and demonstrate their use in application to a complex setting: e-government in local government planning",
  "authors": [
    {
      "name": "David Martin",
      "institution": "Lancaster University, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100390624",
      "orcid": "missing"
    },
    {
      "name": "Mark Rouncefield",
      "institution": "Lancaster University, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589917",
      "orcid": "missing"
    },
    {
      "name": "Ian Sommerville",
      "institution": "Lancaster University, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100335980",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander, C. (1979). The Timeless Way Of Building. New York: Oxford University Press",
      "doi": ""
    },
    {
      "text": "Alexander, C., Ishikawa, S., Silverstein, M., Jacobson, M., Fiksdahl-King, I., Angel, S. (1977). A Pattern Language. New York: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Bayle, E et al (1998) Putting it all together: Towards a pattern language for interaction design. SIGCHI Bulletin, 30 (1) pp17--23, January 1998.  ",
      "doi": "10.1145/280571.280580"
    },
    {
      "text": "Bellotti, V and Bly, S. (1996) Walking Away from the Desktop Computer: Distributed Collaboration in a Product Design Team. In Proceedings of CSCW'96.  ",
      "doi": "10.1145/240080.240256"
    },
    {
      "text": "Borchers, J. (2001) A Pattern Approach to Interaction Design John Wiley and Sons. Chichester. ",
      "doi": "10.5555/558433"
    },
    {
      "text": "Bowers, J. and Martin, D. (2000). Machinery in the New Factories: Talk and technology in a bank's call centre. In Proceedings of CSCW 2000.  ",
      "doi": "10.1145/358916.358952"
    },
    {
      "text": "Cooper, J.W. (2000) Java Design Patterns. Longman. ",
      "doi": "10.5555/329888"
    },
    {
      "text": "Coplien, J. O and Schmidt, D.C. (eds) (1995) Pattern Languages of Program Design Addison Wesley. ",
      "doi": "10.5555/218662"
    },
    {
      "text": "Coplien, J. O. (1996) Software Patterns management Briefing - available at http://www1.bell-labs.com/user/cope/Patterns/WhitePaper/.",
      "doi": ""
    },
    {
      "text": "Erickson, T. (1996) Design as Storytelling. In Interactions July/August 1996.  ",
      "doi": "10.1145/234813.234817"
    },
    {
      "text": "Erickson, T. (2000) Towards a Pattern Language For Interaction Design. In Luff, P, Hindmarsh, J and Heath, C. (eds) (2000) Workplace Studies: Recovering Work Practice and Informing Systems Design. Cambridge. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Gamma, E., Helm, R., Johnson, R and Vlissides, J. (1995) Design Patterns: Elements of Reusable Object-Oriented Software. Addison-Wesley. ",
      "doi": "10.5555/186897"
    },
    {
      "text": "Hughes, J., King, V., Rodden, T., Andersen, H. (1994) Moving Out from the Control Room: Ethnography in System Design. Proceedings of ACM CSCW'94.  ",
      "doi": "10.1145/192844.193065"
    },
    {
      "text": "Luff, P, Hindmarsh, J and Heath, C. (eds) (2000) Workplace Studies: Recovering Work Practice and Informing Systems Design. Cambridge. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Martin, D. (2000). Ethnomethodology And Computer Systems Design: Interaction at the boundaries of organisations. Unpublished doctoral thesis. Department of Computer Science, University of Manchester. Copies available from d.b.martin@lancaster.ac.uk.",
      "doi": ""
    },
    {
      "text": "Martin, D. and Rouncefield, R. (2001). Making the Organisation Come Alive. To appear in the journal of HCI.",
      "doi": ""
    },
    {
      "text": "Martin, D., Rodden, T., Rouncefield, M., Sommerville, I and Viller, S. (2001) Finding Pattern in the Fieldwork. In Proceedings of ECSCW '01. ",
      "doi": "10.5555/1241867.1241870"
    },
    {
      "text": "Martin, D., Wastell, D. and Bowers, J. (1998). Ethnographically Informed Systems Design: The development and evaluation of an Internet-based electronic banking application. In Proceedings of ECIS '98.",
      "doi": ""
    },
    {
      "text": "O'Conaill, B., Frohlich, D. (1995) Timespace in the Workplace: Dealing with Interruptions. Proceedings of ACM CHI'95.  ",
      "doi": "10.1145/223355.223665"
    },
    {
      "text": "Orr, J. (1996) Talking about machines : an ethnography of a modern job. Ithaca, N.Y. : Cornell U.P.",
      "doi": ""
    },
    {
      "text": "Plowman, L., Rogers, Y., Ramage, M. (1995) What Are Workplace Studies For? ProceedingsECSCW'95. ¿ Copyright Kluwer Academic Publishers. ",
      "doi": "10.5555/1241958.1241978"
    },
    {
      "text": "Rouncefield, M., Hughes, J., Rodden, T., Viller, S. (1994). Working with \"Constant Interruption\": Proceedings of CSCW'94.  ",
      "doi": "10.1145/192844.193028"
    }
  ]
}