{
  "doi": "10.1145/503376.503454",
  "title": "Sotto voce: exploring the interplay of conversation and mobile audio spaces",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "431-438",
  "year": 2002,
  "badges": [],
  "abstract": "In addition to providing information to individual visitors, electronic guidebooks have the potential to facilitate social interaction between visitors and their companions. However, many systems impede visitor interaction. By contrast, our electronic guidebook, Sotto Voce, has social interaction as a primary design goal. The system enables visitors to share audio information - specifically, they can hear each other's guidebook activity using a technologically mediated audio eavesdropping mechanism. We conducted a study of visitors using Sotto Voce while touring a historic house. The results indicate that visitors are able to use the system effectively, both as a conversational resource and as an information appliance. More surprisingly, our results suggest that the technologically mediated audio often cohered the visitors' conversation and activity to a far greater degree than audio delivered through the open air",
  "tags": [
    "shared audio",
    "electronic guidebooks",
    "interaction analysis"
  ],
  "authors": [
    {
      "name": "Paul M. Aoki",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100590142/rel-imgonly/pma-square.jpg",
      "acmid": "81100590142",
      "orcid": "missing"
    },
    {
      "name": "Rebecca E. Grinter",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81328488487/rel-imgonly/head.jpg",
      "acmid": "81328488487",
      "orcid": "0000-0002-1957-4130"
    },
    {
      "name": "Amy Hurst",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659692402",
      "orcid": "missing"
    },
    {
      "name": "Margaret H. Szymanski",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343506379",
      "orcid": "missing"
    },
    {
      "name": "James D. Thornton",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343506925",
      "orcid": "missing"
    },
    {
      "name": "Allison Woodruff",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327302",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G.D. et al., \"Cyberguide: A Mobile Context-Aware Tour Guide,\" Wireless Networks 3, 5 (1997), 421--433.  ",
      "doi": "10.1023/A%3A1019194325861"
    },
    {
      "text": "Aoki, P.M. et al., \"Tap Tips: Lightweight Discovery of Touchscreen Targets,\" Extended Abstracts, CHI 2001, Seattle, WA, Mar. 2001, 237--238.  ",
      "doi": "10.1145/634067.634208"
    },
    {
      "text": "Bederson, B.B., \"Audio Augmented Reality: A Prototype Automated Tour Guide,\" Conf. Companion, CHI 1995, Denver, CO, May 1995, 210--211.  ",
      "doi": "10.1145/223355.223526"
    },
    {
      "text": "Blauert, J., Spatial Hearing (rev. ed.), MIT Press, Cambridge, MA, 1997.",
      "doi": ""
    },
    {
      "text": "Cassell, J. et al., \"More Than Just a Pretty Face: Affordances of Embodiment,\" Proc. IUI 2000, New Orleans, LA, Jan. 2000, 52--59.  ",
      "doi": "10.1145/325737.325781"
    },
    {
      "text": "Cheverst, K. et al., \"Developing a Context-Aware Electronic Tourist Guide: Some Issues and Experiences,\" Proc. CHI 2000, den Haag, the Netherlands, Apr. 2000, 17--24.  ",
      "doi": "10.1145/332040.332047"
    },
    {
      "text": "Ericson, M.A. and R.L. McKinley, \"The Intelligibility of Multiple Talkers Separated Spatially in Noise,\" in Binaural and Spatial Hearing in Real and Virtual Environments, R.H. Gilkey and T.A. Anderson (eds.), L. Erlbaum Associates, Mahwah, NJ, 1997, 701--724.",
      "doi": ""
    },
    {
      "text": "Goffman, E., Forms of Talk, U. Penn. Press, Philadelphia, PA, 1981.",
      "doi": ""
    },
    {
      "text": "Hood, M.G., \"Staying Away: Why People Choose Not to Visit Museums,\" Museum News 61, 4 (1983), 50--57.",
      "doi": ""
    },
    {
      "text": "Mackay, W.E., \"Media Spaces: Environments for Multimedia Interaction,\" in Computer-Supported Cooperative Work, M. Beaudouin-Lafon (ed.), Wiley & Sons, Chichester, UK, 1999, 55--82.",
      "doi": ""
    },
    {
      "text": "Martin, D., \"Audio Guides,\" Museum Practice 5, 1 (2000), 71--81.",
      "doi": ""
    },
    {
      "text": "McManus, P.M., \"Oh, Yes They Do! How Museum Visitors Read Labels and Interact with Exhibit Texts,\" Curator 32, 3 (1989), 174--189.",
      "doi": ""
    },
    {
      "text": "Petrelli, D. et al., \"A User-Centered Approach to User Modeling,\" Proc. 7th Int'l Conf. on User Modeling, Banff, Alberta, June 1999, 255--264. ",
      "doi": "10.5555/317328.317366"
    },
    {
      "text": "Sacks, H., \"An Analysis of the Course of a Joke's Telling in Conversation,\" in Explorations in the Ethnography of Speaking, R. Bauman and J. Sherzer (eds.), Cambridge Univ. Press, 1974, 337--353.",
      "doi": ""
    },
    {
      "text": "Sacks, H., \"Notes on Methodology,\" in Structures of Social Action, J.M. Atkinson and J. Heritage (eds.), Cambridge Univ. Press, 1984, 21--27.",
      "doi": ""
    },
    {
      "text": "Screven, C. G., \"The Effectiveness of Guidance Devices on Visitor Learning,\" Curator 18, 3 (1975), 219--243.",
      "doi": ""
    },
    {
      "text": "Sellen, A.J., \"Remote Conversations: The Effects of Mediating Talk with Technology,\" Human-Computer Interaction 10, 4 (1995), 401--444.  ",
      "doi": "10.1207/s15327051hci1004_2"
    },
    {
      "text": "Singer, A. et al., \"Tangible Progress: Less is More in Somewire Audio Spaces,\" Proc. CHI 1999, Pittsburgh, PA, May 1999, 104--111.  ",
      "doi": "10.1145/302979.303007"
    },
    {
      "text": "Szymanski, M.H., \"Re-engaging and Dis-engaging Talk in Activity,\" Language in Society 28, 1 (1999), 1--23.",
      "doi": ""
    },
    {
      "text": "vom Lehn, D. et al., \"Exhibiting Interaction: Conduct and Collaboration in Museums and Galleries,\" Symbolic Interaction 24, 2 (2001), 189--216.",
      "doi": ""
    },
    {
      "text": "Woodruff, A. et al., \"Electronic Guidebooks and Visitor Attention,\" Proc. 6th Int'l Cultural Heritage Informatics Meeting, Milan, Italy, Oct. 2001, 623--637.",
      "doi": ""
    },
    {
      "text": "Woodruff, A. et al., \"The Conversational Role of Electronic Guidebooks,\" Proc. Conf. on Ubiquitous Computing, Atlanta, GA, Sept. 2001, 187--208. ",
      "doi": "10.5555/647987.741321"
    }
  ]
}