{
  "doi": "10.1145/503376.503455",
  "title": "Age-old practices in the 'new world': a study of gift-giving between teenage mobile phone users",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "439-446",
  "year": 2002,
  "badges": [],
  "abstract": "In this paper, we present an overview of the data collected from an ethnographic study of teenagers and their use of mobile phones. Through the data, we suggest that teenagers use their phones to participate in social practices that closely resemble forms of ritualised gift-giving. Such practices, we claim, shape the way teenagers understand and thus use their phones. We go onto show that this insight into everyday, phone-mediated activities has practical implications for mobile phone design. Using an example, we describe how teenagers' gift-giving practices can inform design, providing an initial means to conceptualise future emerging technologies",
  "tags": [
    "cell phones",
    "SMS",
    "text messaging",
    "gift-giving",
    "ethnography",
    "mobile phones",
    "teenagers"
  ],
  "authors": [
    {
      "name": "Alex S. Taylor",
      "institution": "University of Surrey, Guildford, Surrey",
      "img": "/do/10.1145/contrib-81100517358/rel-imgonly/alex_taylor_profile.jpg",
      "acmid": "81100517358",
      "orcid": "0000-0001-6311-3967"
    },
    {
      "name": "Richard Harper",
      "institution": "University of Surrey, Guildford, Surrey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452613064",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Berking, H. Sociology of Giving. Sage, London (1999).",
      "doi": ""
    },
    {
      "text": "Cheal, D. The social dimensions of gift behaviour. Journal of Social and Personal Relationships 3, (1986), 423--439.",
      "doi": ""
    },
    {
      "text": "Cheal, D. Showing them you love them: Gift giving and the dialectic of intimacy. The Sociological Review 35, 1 (1987), 150--169.",
      "doi": ""
    },
    {
      "text": "Dineen, R. Vodafone breaks rank and comes clean. ZDNet News, http://www.zdnet.com/zdnn/stories/comment/0,5859,2811439,00.html (2001).",
      "doi": ""
    },
    {
      "text": "Eldridge, M. A Study of Teenagers and SMS, in Proceedings of Mobile Futures Workshop, CHI 2001. (Seattle WA, 31 March - 5 April 2001), ACM Press.",
      "doi": ""
    },
    {
      "text": "Fortunati, L. The mobile phone: An identity on the move. Personal and Ubiquitous Computing 5, 2 (2001), 85--98.  ",
      "doi": "10.1007/PL00000017"
    },
    {
      "text": "Garfinkel, H. Ethnomethodology's program. Social Psychology Quarterly 59, 1 (1996), 5--21.",
      "doi": ""
    },
    {
      "text": "Goffman, E. Forms of Talk. University of Pennsylvania Press, Philadelphia (1981).",
      "doi": ""
    },
    {
      "text": "Gouldner, A.W. For Sociology: Renewal and Critique in Sociology Today. Allen Lane, London (1973).",
      "doi": ""
    },
    {
      "text": "Grinter, R.E. and Eldridge, M.A. y do tngrs luv 2 txt msg?, in Proceedings of Seventh European Conference on Computer Supported Cooperative Work. (Bonn, Germany, 18--20 September, 2001). ",
      "doi": "10.5555/1241867.1241879"
    },
    {
      "text": "Licoppe, C. and Heurtin, J.P. Managing one's availability to telephone communication through mobile phones: a French case study of the development dynamics of mobile phone use. Personal and Ubiquitous Computing 5, 2 (2001), 99--108.  ",
      "doi": "10.1007/s007790170013"
    },
    {
      "text": "Ling, R. Norwegian teens, mobile telephony and text messages. Technical Newsletter from Telenor Research and Development, Oslo, (2000).",
      "doi": ""
    },
    {
      "text": "MacKenzie, D.A. and Wajcman, J., (eds.) The Social Shaping of Technology. 2nd ed. Open University Press, Buckingham (1999).",
      "doi": ""
    },
    {
      "text": "Mauss, M. The Gift: The Form and Reason for Exchange in Archaic Societies. Routledge, London (1997).",
      "doi": ""
    },
    {
      "text": "McDonough, B. IDC spots wireless handset sales slump. Wireless NewsFactor, http://Wireless.News Factor.com/perl/story/?id=13142 (2001).",
      "doi": ""
    },
    {
      "text": "Nettle, D. and Dunbar, R.I.M. Social markers and the evolution of reciprocal exchange. Current Anthropology 38, 1 (1997), 93--99.",
      "doi": ""
    },
    {
      "text": "Sahlins, M. The sociology of primitive exchange, in Stone Age Economics, Sahlins M. (ed.). Routledge, London (1974).",
      "doi": ""
    },
    {
      "text": "Schwartz, B. The social psychology of the gift. American Journal of Sociology 73, 1 (1967), 1--11.",
      "doi": ""
    },
    {
      "text": "Suchman, L. Human/Machine Reconsidered. Department of Sociology, Lancaster University, http://www.comp.lancs.ac.uk/sociology/soc040ls.html (2000).",
      "doi": ""
    },
    {
      "text": "Toffler, A. The Third Wave. Morrow, New York (1980).",
      "doi": ""
    },
    {
      "text": "Weilenmann, A. and Larsson, C., Local use and sharing of mobile phones, in Wireless World: Social and Interactional Aspects of the Mobile Age, Brown, B., Green, N., and Harper, R. (eds.). Springer Verlag, Godalming (2001), 99--115. ",
      "doi": "10.5555/510801.510811"
    },
    {
      "text": "Williams, T. Slashed Prices and Bleeding Margins Wound Handspring's Stock. The Street.com, http://www.thestreet.com/tech/telecom/10000382.html (2001).",
      "doi": ""
    }
  ]
}