{
  "doi": "10.1145/503376.503449",
  "title": "Comparing paper and tangible, multimodal tools",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "407-414",
  "year": 2002,
  "badges": [],
  "abstract": "In command posts, officers maintain situational awareness using paper maps, Post-it notes, and hand-written annotations. They do so because paper is robust to failure, it is portable, it offers a flexible means of capturing information, it has ultra-high resolution, and it readily supports face-to-face collaboration. We report herein on an evaluation comparing maps and Post-its with a tangible multimodal system called Rasa. Rasa augments these paper tools with sensors, enabling it to recognize the multimodal language (both written and spoken) that naturally occurs on them. In this study, we found that not only do users prefer Rasa to paper alone, they find it as easy or easier to use than paper tools. Moreover, Rasa introduces no discernible overhead in its operation other than error repair, yet grants the benefits inherent in digital systems. Finally, subjects confirmed that by combining physical and computational tools, Rasa is resistant to computational failure",
  "tags": [
    "tangible interfaces",
    "multimodal interfaces",
    "invisible interfaces",
    "augmented reality",
    "mixed reality"
  ],
  "authors": [
    {
      "name": "David R. McGee",
      "institution": "Rich Interaction Environments, Pacific Northwest National Laboratory, Richland, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100073964",
      "orcid": "missing"
    },
    {
      "name": "Philip R. Cohen",
      "institution": "Oregon Health and Sciences University, Portland, OR",
      "img": "/do/10.1145/contrib-81100149852/rel-imgonly/81100149852.jpg",
      "acmid": "81100149852",
      "orcid": "missing"
    },
    {
      "name": "R. Matthews Wesson",
      "institution": "Oregon Health and Sciences University, Portland, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418595068",
      "orcid": "missing"
    },
    {
      "name": "Sheilah Horman",
      "institution": "Oregon Health and Sciences University, Portland, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100002452",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bolt, R.A., Put-That-There: Voice and gesture at the graphics interface. Computer Graphics, 14(3) (1980): 262--270.  ",
      "doi": "10.1145/965105.807503"
    },
    {
      "text": "Cohen, P.R., Johnston, M., McGee, D.R., Oviatt, S., Pittman, J., Smith, I., Chen, L., and Clow, J. QuickSet: multimodal interaction for distributed applications, in the Proceedings of the International Multimedia Conference, ACM Press, (Seattle, WA, November 1997), 31--40.  ",
      "doi": "10.1145/266180.266328"
    },
    {
      "text": "Cohen, P.R., McGee, D.R., and Clow, J. The efficiency of multimodal interaction, in the Proceedings of the Applied Natural Language Programming Conference, Association for Computational Linguistics Press, (Seattle, WA, April 2000).  ",
      "doi": "10.3115/974147.974193"
    },
    {
      "text": "Gorman, P., Ash, J., Lavelle, M., Lyman, J., Delcambre, L., and Maier, D., Bundles in the Wild: Managing Information to Solve Problems and Maintain Situation Awareness. Library Trends, 49(2) (2000): 266--289.",
      "doi": ""
    },
    {
      "text": "Heath, C. and Luff, P., Technology in Action. Learning in Doing: Social, Cognitive and Computational Perspectives, R. Pea, J.S. Brown, and C. Heath (Eds.). Cambridge, UK: Cambridge University Press, (2000). ",
      "doi": "10.5555/556346"
    },
    {
      "text": "Johnston, M. Unification-based multimodal parsing, in the Proceedings of the International Joint Conference of the Association for Computational Linguistics and the International Committee on Computational Linguistics, Association for Computational Linguistics Press, (Montreal, Canada, August 1998), 624--630.  ",
      "doi": "10.3115/980845.980949"
    },
    {
      "text": "Mackay, W.E., Is paper safer? The role of flight strips in air traffic control. ACM Transactions on Computer-Human Interaction, 6(4) (1999): 311--340.  ",
      "doi": "10.1145/331490.331491"
    },
    {
      "text": "McGee, D.R. and Cohen, P.R. Creating tangible interfaces by transforming physical objects with multimodal language, in the Proceedings of the International Conference on Intelligent User Interfaces, ACM Press, (Santa Fe, NM, Jan. 14--17 2001), 113--119.  ",
      "doi": "10.1145/359784.360305"
    },
    {
      "text": "McGee, D.R., Cohen, P.R., and Wu, L. Something from nothing: Augmenting a paper-based work practice with multimodal interaction, in the Proceedings of the Conference on Designing Augmented Reality Environments, ACM Press, (Helsingor, Denmark, April 12--14 2000), 71--80.  ",
      "doi": "10.1145/354666.354674"
    },
    {
      "text": "McGee, D.R., Pavel, M., Adami, A., Wang, G., and Cohen, P.R. A visual modality for the augmentation of paper, in the Proceedings of the Workshop on Perceptive User Interfaces (PUI'01), ACM Press, (Orlando, FL, Nov. 15--16 2001).  ",
      "doi": "10.1145/971478.971480"
    },
    {
      "text": "Wellner, P. The DigitalDesk calculator: tangible manipulation on a desktop display, in the Proceedings of the Symposium on User Interface Software and Technology, ACM Press, (Hilton Head, SC, November 1991), 27--33.  ",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "Wu, L., Oviatt, S.L., and Cohen, P.R., From members to teams to committee -- a robust recognition approach to gestural and multimodal signal processing. IEEE Transactions on Neural Networks, (special issue on Intelligent Multimedia) (2002): in press.  ",
      "doi": "10.1109/TNN.2002.1021897"
    }
  ]
}