{
  "doi": "10.1145/503376.503414",
  "title": "Learning where to look: location learning in graphical user interfaces",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "211-218",
  "year": 2002,
  "badges": [],
  "abstract": "A theoretical account is presented on how locations of interface objects are learned and how the mechanisms underlying location learning interact with the representativeness of object labels. The account is embodied in a computational cognitive model built within the ACT-R/PM cognitive architecture [1, 2] and is supported by point-of-gaze and performance data collected in empirical research. The model interacts with the same software under the same experimental task conditions as study participants and replicates both performance and the finer-grained point-of-gaze data. Drawing from the data and model, location learning is characterized as a process that occurs as a by-product of interaction such that, without specific intent to do so, users can gradually learn the locations of the interface objects to which they attend. Characteristics of the user interface shape this learning process, however, by constraining the set of possible strategies for interaction. Locations are learned more quickly when the least-effortful strategy available in the interface explicitly requires retrieval of location knowledge",
  "tags": [
    "ACT-R/PM",
    "display-based interaction",
    "cognitive modeling",
    "location learning",
    "direct manipulation"
  ],
  "authors": [
    {
      "name": "Brian D. Ehret",
      "institution": "Sun Microsystems, Inc., Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100623912",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J. R., & Lebiere, C. (1998). The atomic components of thought. Mahwah, NJ: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Byrne, M. D., & Anderson, J. R. (1998). Perception and action. In J. R. Anderson & C. Lebiere (Eds.), The atomic components of thought (pp. 167--200). Mahwah, NJ: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Ehret, B.D. (1999). Learning where to look. Human Factors in Computing Systems, Chi 99 Extended Abstracts (pp.292--293). New York: ACM.  ",
      "doi": "10.1145/632716.632895"
    },
    {
      "text": "Ehret, B. D. (2000). Learning where to look: The acquisition of location knowledge in display-based interaction. Unpublished Doctoral Dissertation. Fairfax, VA: George Mason University.",
      "doi": ""
    },
    {
      "text": "Fu, W.-t., & Gray, W. D. (2000). Memory versus Perceptual-Motor Tradeoffs in a Blocks World Task. In L. R. Gleitman & A. K. Joshi (Eds.), Twenty-second Annual Conference of the Cognitive Science Society (pp. 154--159). Hillsdale, NJ: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Gray, W. D., & Fu, W.-t. (2001). Ignoring perfect knowledge in-the-world for imperfect knowledge in-the-head: Implications of rational analysis for interface design. CHI Letters, 3(1), 112--119.",
      "doi": ""
    },
    {
      "text": "Jones, W. P., & Dumais, S. T. (1986). The spatial metaphor for user interfaces: Experimental tests of reference by location versus name. ACM Transactions on Office Information Systems, 4(1), 42--63.  ",
      "doi": "10.1145/5401.5405"
    },
    {
      "text": "Moyes, J. (1994). When users do and don't rely on icon shape, Proc. of ACM CHI'94 Conference on Human Factors in Computing Systems (Vol. 2, pp. 283--284).  ",
      "doi": "10.1145/259963.260494"
    },
    {
      "text": "Moyes, J. (1995). Putting icons in context: the influence of contextual information on the usability of icons. Unpublished Doctoral Thesis, Univ. of Glasgow, Glasgow.",
      "doi": ""
    },
    {
      "text": "Somberg, B. J. (1987). A comparison of rule-based and positionally constant arrangements of computer menu items, Proceedings of ACM CHI+GI'87 (pp. 255--260).  ",
      "doi": "10.1145/29933.275639"
    },
    {
      "text": "Triesman, A., & Souther, J. (1985). Search asymmetry: A diagnostic for preattentive processing of separable features. Journal of Experimental Psychology: General, 114(3), 285--310.",
      "doi": ""
    }
  ]
}