{
  "doi": "10.1145/503376.503435",
  "title": "Diffusing information in organizational settings: learning from experience",
  "published": "2002-04-20",
  "proctitle": "CHI '02: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "331-338",
  "year": 2002,
  "badges": [],
  "abstract": "Recommender systems selectively circulate information enriched with comments and feedback based on people's experience. These systems filter information in a semi-automatic and high-quality way in order to support a community during their work or leisure practices. However recommender systems are usually separate tools that require a degree of effort to be used, both when receiving information and to insert new feedback. In this paper we present our informal experiences with the use of multiple user interfaces (interactive large screen, email, paper and PDA) as means to improve the diffusion of information through an organizational unit and to improve access to information stored within an existing recommender system",
  "tags": [
    "serendipity",
    "recommender systems",
    "large-screens",
    "information sharing"
  ],
  "authors": [
    {
      "name": "Dave Snowdon",
      "institution": "Xerox Research Centre Europe, Grenoble, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017597",
      "orcid": "missing"
    },
    {
      "name": "Antonietta Grasso",
      "institution": "Xerox Research Centre Europe, Grenoble, France",
      "img": "/do/10.1145/contrib-81100014484/rel-imgonly/anto.jpeg",
      "acmid": "81100014484",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Geissler, J. Shuffle, throw or take it! Working efficiently with an interactive wall. Proceedings of CHI'98 summary, (Los Angeles USA, April 1998).  ",
      "doi": "10.1145/286498.286745"
    },
    {
      "text": "Glance, N., Arregui, D., Dardenne, M. (1998), Knowledge Pump: Supporting the Flow and Use of Knowledge in Networked Organisations, Information Technology for Knowledge Management, Eds. Borghoff and Pareschi, Springer-Verlag, 1998.",
      "doi": ""
    },
    {
      "text": "Glance, N.S., Arregui, D., Dardenne, M. Making Recommender Systems Work for Organizations. Proceedings of PAAM'99 (London UK, April 1999).",
      "doi": ""
    },
    {
      "text": "Greenberg, S. and Rounding, M. (2000) The Notification Collage: Posting Information to Public and Personal Displays. Yellow Series Report 2000-667-19, Department of Computer Science, University of Calgary, Albert, Canada. http://www.cpsc.ucalgary.ca/grouplab/papers/index.htm",
      "doi": ""
    },
    {
      "text": "Greenhalgh, C. M. and Benford, S. D., Supporting Rich And Dynamic Communication In Large Scale Collaborative Virtual Environments, Presence: Teleoperators and Virtual Environments, Vol. 8, No. 1, February 1999, pp. 14--35, MIT Press.  ",
      "doi": "10.1162/105474699566026"
    },
    {
      "text": "Houde, S., Bellamy, R., Leahy, L. (1998), In search of design principles for Toals and Practices to Support Communication within a learning Community, SIGCHI Bulletin, 30(2), April 1998. http://www.acm.org/sigchi/bulletin/1998.2/houde.html  ",
      "doi": "10.1145/279044.279171"
    },
    {
      "text": "Huxor, A. (1998), An Active Worlds interface to BSCW, to enhance Chance Encounters, CVE 1998, June 1998, Manchester, UK, Snowdon & Churchill eds., 87--93.",
      "doi": ""
    },
    {
      "text": "Moran, T.P., van Melle, W., Chiu, P. Tailorable Domain Objects as Meeting Tools for an Electronic Whiteboard. Proceedings of CSCW'98 (Seattle USA, November 1998), 295--304.  ",
      "doi": "10.1145/289444.289504"
    },
    {
      "text": "Resnick, P., Iacovou, N., Suchak, M., Bergstrom, P. and Riedl, J. \"GroupLens: An open architecture for colla-borative filtering of netnews,\" in Proceedings of CSCW'94 (Chapel Hill, NC, October 1994), ACM Press, 175--186.  ",
      "doi": "10.1145/192844.192905"
    },
    {
      "text": "Shardanand, U. and Maes, P. \"Social information filtering:Algorithms for automating word of mouth,\" in Proceedings of CHI'95 (Denver CO, May 1995), ACM Press, 210--217.  ",
      "doi": "10.1145/223904.223931"
    }
  ]
}