{
  "doi": "10.1145/258549.258821",
  "title": "Integration and synchronization of input modes during multimodal human-computer interaction",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "415-422",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "tags": [
    "spatial location information",
    "speech and pen input",
    "integration and synchronization",
    "dynamic interactive maps",
    "predictive modeling",
    "multimodal interaction"
  ],
  "authors": [
    {
      "name": "Sharon Oviatt",
      "institution": "Center for Human-Computer Communication, Department of Computer Science and Engineering, Oregon Graduate Institute of Science & Technology, P. O. Box 91000, Portland, OR",
      "img": "/do/10.1145/contrib-81100656112/rel-imgonly/handbookv1.png",
      "acmid": "81100656112",
      "orcid": "missing"
    },
    {
      "name": "Antonella DeAngeli",
      "institution": "Center for Human-Computer Communication, Department of Computer Science and Engineering, Oregon Graduate Institute of Science & Technology, P. O. Box 91000, Portland, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100628473",
      "orcid": "missing"
    },
    {
      "name": "Karen Kuhn",
      "institution": "Center for Human-Computer Communication, Department of Computer Science and Engineering, Oregon Graduate Institute of Science & Technology, P. O. Box 91000, Portland, OR and Psychology Dept., University of Trieste, and Linguistics Dept., Portland State University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332510162",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bolt, R. \"Put-That-There\": Voice and Gesture at the hics interface, Computer Graphics, 1980, 14 (3): 270.  ",
      "doi": "10.1145/965105.807503"
    },
    {
      "text": "Cohen, P., Dalrymple, M., Moran, D. &amp; Pereira, F. Synergistic use of direct manipulation and natural language, CHI 89 Conf. Proc., ACM: Addison Wesley, New York, 1989, 227-234.  ",
      "doi": "10.1145/67449.67494"
    },
    {
      "text": "Kendon, A. Gesticulation and speech: Two aspects of the process of utterance, The Relationship of Verbal and Nonverbal Communication (ed. by M. Key), The Hague: Mouton, 1980, 207-227.",
      "doi": ""
    },
    {
      "text": "Koons, D., Sparrell, C. &amp; Thorisson, K. Integrating simultaneous input from speech, gaze, and hand gestures, Intelligent Multimedia Interfaces, ed. by M. Maybury, MIT Press: Cambridge, MA, 1993, 257-76. ",
      "doi": "10.5555/162477.162508"
    },
    {
      "text": "Levelt, W., Richardson, G. &amp; Heu, W. Pointing and voicing in deictic expressions, Jour. of Memory and Language, 1985, 24, 133-164.",
      "doi": ""
    },
    {
      "text": "McNeill, D. Hand and Mind: What gestures reveal about thought, Univ. of Chicago Press: Chicago, II1., 1992.",
      "doi": ""
    },
    {
      "text": "McNeill, D. Language as gesture (Gesture as language), Proc. of the Workshop on the Integration of Gesture in Language &amp; Speech, ed. by L. Messing, Univ. of Delaware, Oct. 1996, 1-20.",
      "doi": ""
    },
    {
      "text": "Naughton, K. Spontaneous gesture and sign: A study of ASL signs co-occurring with speech, Proc. of the Workshop on the Integration of Gesture in Language &amp; Speech, ed. by L. Messing, Univ. of Delaware, Oct. 1996, 125-34.",
      "doi": ""
    },
    {
      "text": "Neal, J. &amp; Shapiro, S. Intelligent multi-media interface technology, in Intelligent User Interfaces (J. Sullivan &amp; S. Tyler, eds.), ACM: Addison Wesley, New York, 1991, ch. 3, 45-68.  ",
      "doi": "10.1145/107215.128690"
    },
    {
      "text": "Oviatt, S.L. Multimodal interfaces for dynamic interactive maps, CHI '96 Conf Proc., New York, ACM Press, 1996, 95-102.  ",
      "doi": "10.1145/238386.238438"
    },
    {
      "text": "Oviatt, S., Cohen, P., Fong, M., &amp; Frank, M. A rapid semi-automatic simulation technique for investigating interactive speech and handwriting, Proc. of the Intl. Conf. on Spoken Language Processing, 1992, 2, 1351-54.",
      "doi": ""
    },
    {
      "text": "Oviatt, S., Cohen, P. Johnston, M. &amp; Kuhn, K. Multimodal language: Linguistic features and processing requirements, forthcoming.",
      "doi": ""
    },
    {
      "text": "Oviatt, S., Cohen, P. &amp; Wang, M. Toward interface design for human language technology: Modality and structure as determinants of linguistic complexity, Speech Communication, 1994,15 (3-4), 283-300.  ",
      "doi": "10.1016/0167-6393%2894%2990079-5"
    },
    {
      "text": "Oviatt, S. &amp; Olsen, E. Integration themes in multimodal human-computer interaction, Proc. of the lntl Conf. on Spoken Language Processing, 1994, 2, 551-554.",
      "doi": ""
    },
    {
      "text": "Oviatt, S. L. &amp; vanGent, R. Error resolution during multimodal human-computer interaction, Proc. of the Intl. Conf. on Spoken Language Processing, 1996.",
      "doi": ""
    },
    {
      "text": "Pittman, J., Cohen, P., Smith, I., Yang, T. &amp; Oviatt, S. Quickset: A multimodal interface for distributed interactive simulations, Proc. of the 6th Conf. on Computer-Generated Forces &amp; Behavior Representation, Univ. of Central Florida, Orlando, FL., 1996, 217-24.",
      "doi": ""
    }
  ]
}