{
  "doi": "10.1145/258549.258640",
  "title": "Toward an HCI research and practice agenda based on human needs and social responsibility",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "155-161",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Michael J. Muller",
      "institution": "US WEST Advanced Technologies, 4001 Discovery Drive, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332517372",
      "orcid": "0000-0001-7860-163X"
    },
    {
      "name": "Cathleen Wharton",
      "institution": "US WEST Advanced Technologies, 4001 Discovery Drive, Boulder, CO",
      "img": "/do/10.1145/contrib-81332535037/rel-imgonly/cathleenwharton.jpg",
      "acmid": "81332535037",
      "orcid": "missing"
    },
    {
      "name": "William J. McIver",
      "institution": "US WEST Advanced Technologies, 4001 Discovery Drive, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387610466",
      "orcid": "missing"
    },
    {
      "name": "Lila Laux",
      "institution": "US WEST Communications, 1801 California Street, Denver, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100249289",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bailey, R.W. (1993). Performance versus preference. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting. Seattle: Human Factors and Ergonomics Society.]]",
      "doi": ""
    },
    {
      "text": "Bergman, E., Johnson, E., Edwards, A., Kaplan, D., Lowney, G., and Raman, T.V. (1996). Universal design: Everyone has special needs, in CH196 Conference Companion. Vancouver BC: ACM, 153-154.]]  ",
      "doi": "10.1145/257089.257893"
    },
    {
      "text": "Bikson, T., Blair, J.H., Barry, R.E., Grantham, C.E., and Winograd, T. (1988). Communication, coordination, and group performance. In CSCW'88: Proceedings of the Conference on Computer-Supported Cooperative Work. Portland OR: ACM, 189-190.]]  ",
      "doi": "10.1145/62266.570362"
    },
    {
      "text": "Bjerknes, G., Ehn, P., and Kyng, M. (1987). Computers and democracy: A Scandinavian challenge. Brookfield VT: Gower.]]",
      "doi": ""
    },
    {
      "text": "Blomberg, J., Giacomi, J., Mosher, A., and Swenton- Wall, P. (1993). Ethnographic field methods and their relation to design. In D. Schuler and A. Namioka (eds.), Participatory. design. Principles andpractices. Hillsdale NJ: Erlbaum.]]",
      "doi": ""
    },
    {
      "text": "Caine, B., Grosz, E.A., and Lepervanche, M. (1988). Crossing boundaries. Feminism and the critique of knowledges. Sydney: Allen and Unwin.]]",
      "doi": ""
    },
    {
      "text": "Clement, A., and Wagner, I. (1995). Fragmented exchange: Disarticulation and the need for regionalized communication spaces. In H. Marmolin, Y. Sundblad, and K. Schmidt (eds.), ECSCW'95: Proceedings of the fourth European conference on computer-supported cooperative work. Dordrecht: Kluwer, 33-49.]] ",
      "doi": "10.5555/1241958.1241961"
    },
    {
      "text": "Floyd, C. (1987). Outline of a paradigm change in software engineering. In Bjerknes, G., Ehn, P., and Kyng, M. (Eds.) (1987). Computers and democracy: A Scandinavian challenge. Brookfield, VT: Gower.]]",
      "doi": ""
    },
    {
      "text": "Friedman, B., and Nissenbaum, H. (1993). Discerning bias in computer systems. In INTERCHI '93 Adjunct Proceedings. Amsterdam: ACM, 141-142.]]  ",
      "doi": "10.1145/259964.260152"
    },
    {
      "text": "Garson, B. (1988). The electronic sweatshop: How computers are transforming the office of the future into the factory of the past. Harmondsworth, Middlesex, UK: Penguin.]] ",
      "doi": "10.5555/535362"
    },
    {
      "text": "Gibet, S. (1994). Synthesis of sign language gestures. In CHI'94 Conference Companion. Boston: ACM, 311-312.]]  ",
      "doi": "10.1145/259963.260372"
    },
    {
      "text": "Greenbaum, J., and Kyng, M. (1991). Design at work: Cooperative design of computer systems. Hillsdale NJ: Erlbaum.]] ",
      "doi": "10.5555/125470"
    },
    {
      "text": "Greenbaum, J., Snelling, L., Jolly, C., and On', J. (1994). The limits of PD? Contingent jobs and work reorganization. In PDC'94: Proceedings of the Participatory Design Conference. Chapel Hill NC: Computer Professionals for Social Responsibility, 173-174.]]",
      "doi": ""
    },
    {
      "text": "Haywood, T. (1995). Info-rich/lnfo-poor: Access and exchange in the global information society. London: Bowker-Saur.]] ",
      "doi": "10.5555/526851"
    },
    {
      "text": "Hofmeester, G.H., Kemp, J.A.M., Blankendaal, A.C.M. (1996). Sensuality in product design: A structured approach. In CHI 96 Conference Proceedings. Vancouver BC: ACM, 428-435.]]  ",
      "doi": "10.1145/238386.238595"
    },
    {
      "text": "Hughes, J., Randall, D., and Shapiro, D. (1992). Faltering from ethnography to design. In Proceedings of CSCW'92 ~ Sharing Perspectives. Toronto ONT: ACM, 115-122.]]  ",
      "doi": "10.1145/143457.143469"
    },
    {
      "text": "Kranich, N. (1995). The Internet, access and democracy: Ensuring public places on the information superhighway. New York: Open Magazine.]]",
      "doi": ""
    },
    {
      "text": "Laudan, L. (1977). Progress and its problems: Towards a theory of scientific growth. Berkeley: University of California Press.]]",
      "doi": ""
    },
    {
      "text": "Lewis, C. (1990). A research agenda for the nineties in human-computer interaction. Human-Computer Interaction 5(2-3), 125-143.]]",
      "doi": "10.1207/s15327051hci0502%25263_1"
    },
    {
      "text": "Messer-Davidow, E., Shumway, D.R., and Sylvan, D.J. (1993). Knowledges: Historical and critical studies of disciplinarity. Charlottesville VA: University Press of Virginia.]]",
      "doi": ""
    },
    {
      "text": "Muller, M.J. (1995). Ethnocritical heuristics for HCI work with users and other stakeholders, in Proceedings of Computers in Context. /rkrhus Denmark: Arhus University, I 0-19.]]",
      "doi": ""
    },
    {
      "text": "Muller, M.J., Cart, R., Ashworth, C.A., Diekmann, B., Wharton, C., Eickstaedt, C., and Clonts, J. (1995). Telephone operators as knowledge workers: Consultants who meet customer needs. In Proceedings of CHI'95. Denver CO: ACM, 130-137.]]  ",
      "doi": "10.1145/223904.223921"
    },
    {
      "text": "Muller, M.J., Ruston, L., and Cebulka, K.D. (1990). Making separation architectures serve the user. In Proceedings of IEEE International Conference on Systems Man and Cybernetics. Los Angeles CA: IEEE Press, 820-822.]]",
      "doi": ""
    },
    {
      "text": "Nardi, B.A. (1996) (Ed.). Context and consciousness: Activity theory and human computer interaction. Cambridge MA: MIT Press.]] ",
      "doi": "10.5555/223826"
    },
    {
      "text": "Nardi, B. (1995). Some reflections on scenarios. In J. Carroll (ed.), Scenario-based design: Envisioning work and technology in system development. New York: Wiley.]] ",
      "doi": "10.5555/209227.209255"
    },
    {
      "text": "National Council on Disability (1996). Achieving independence: The challenge for the 21st century. Washington DC: National Council on Disability.]]",
      "doi": ""
    },
    {
      "text": "Nielsen, J. (1995). Scenarios in discount usability engineering. In J. Carroll (Ed.), Scenario-based design: Envisioning work and technology in syste-\" development. New York: Wiley.]] ",
      "doi": "10.5555/209227.209233"
    },
    {
      "text": "Nielsen, J. (1986). A virtual protocol model for computer-human interaction. International Journal of Man-Machine Studies 24, 301-312.]]  ",
      "doi": "10.1016/S0020-7373%2886%2980028-1"
    },
    {
      "text": "Pfaff, G.E., (1985). User interface management systems. Berlin: Springer-Verlag.]] ",
      "doi": "10.5555/583657"
    },
    {
      "text": "Plowman, L., Rogers, Y., and Harper, R. (1995). The 'professional stranger': the role of the fieldworker in workplace studies for CSCW. Workshop at ECSCW'95. Stockholm, September 1995.]]",
      "doi": ""
    },
    {
      "text": "Roy, D.M., Panayi, M., Erenshteyn, R.F., and Fawcus, R. (1994). Gestural human-machine interaction for people with severe speech and motor impairment due to cerebral palsy. In CHI'94 Conference Companion. Boston: ACM, 313-314.]]  ",
      "doi": "10.1145/259963.260375"
    },
    {
      "text": "Schiller, H.I. (1996). Information inequality. New York: Routledge.]] ",
      "doi": "10.5555/525638"
    },
    {
      "text": "Schuler, D., and Namioka, A. (1993) (Eds.). Participatory design: Principles and practices. Hillsdale NJ: Erlbaum.]] ",
      "doi": "10.5555/563076"
    },
    {
      "text": "Sherry, J. (1995). Cooperation and power. In H. Marmolin, Y. Sundblad, and K. Sehmidt (eds.), ECSCW'95: Proceedings of the fourth European conference on computer-supported cooperative work. Dordrecht: Kluwer, 67-82.]] ",
      "doi": "10.5555/1241958.1241963"
    },
    {
      "text": "Strauss, A., and Corbin, J. (1990). Basics of qualitative research: Grounded theory procedures and techniques. Newbury Park CA: Sage.]]",
      "doi": ""
    },
    {
      "text": "Strong, G.W., with Gasen, J.B., Hewett, T., Hix, D., Morris, J., Muller, M.J., and Novick, D.G. (1994). New directions in human-computer interaction education, research, and practice. Washington DC: National Science Foundation.]]",
      "doi": ""
    },
    {
      "text": "Suchman, L. (1993). Do categories have politics? The language/action perspective reconsidered. In Proceedings of the Third European Conference on Computer-Supported Cooperative Work. Milan, September 1993.]] ",
      "doi": "10.5555/1241934.1241935"
    },
    {
      "text": "Sutcliffe, A., Carroll, J., Young, R., and Long, J. (1991). HCI theory on trial. In CHI'91 Conference Proceedings. New Orleans LA: ACM, 399-400.]]  ",
      "doi": "10.1145/108844.108974"
    },
    {
      "text": "Vanka, S., and Klein, D. (1995). ColorTool: An information tool for cross cultural design. In Proceedings of the Human Factors and Ergonomics Society 39th Annual Meeting. Santa Monica CA: Human Factors and Ergonomics Society, 341-345.]]",
      "doi": ""
    },
    {
      "text": "Wharton, C., Eberts, R., Angiolillo, J., Brigham, F., Givens, B., Laux, L., Neal, D., and Owens, M. (1995). Human factors issues and the interact. In Proceedings of the Human Factors and Ergonomics Society 39th Annual Meeting. Santa Monica CA: Human Factors and Ergonomics Society, 213-217.]]",
      "doi": ""
    }
  ]
}