{
  "doi": "10.1145/258549.258710",
  "title": "Timewarp: techniques for autonomous collaboration",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "218-225",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "tags": [
    "conflict detection and resolution",
    "timewarp",
    "autonomous collaboration",
    "awareness",
    "computer-supported cooperative work"
  ],
  "authors": [
    {
      "name": "W. Keith Edwards",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth D. Mynatt",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331104",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arnold, Ken, and Gosling, James. The Java Program. ming Language. Addison-Wesley Co., Reading, Mass. 1996. ",
      "doi": "10.5555/291374"
    },
    {
      "text": "Berlage, Thomas, and Genau, Andreas. \"A Framework for Shared Applications with a Replicated Architectare,\" In Proceedings of ACM Symposium on User Interface Software and Technology (UIST). November 3-5, 1993, pp. 249-257.  ",
      "doi": "10.1145/168642.168668"
    },
    {
      "text": "Bier, Eric A., Stone, Maureen C., Pier, Ken, Buxton, WiUiam, and DeRose, Tony D. \"Toolglass and Magic Lenses: The See-Through Interface.\" In ACM Computer Graphics Proceedings, August 1993, pp. 73-80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Dourish, Paul, and Bellotti, Victoria. \"Awareness and Coordination in Shared Workspaces.'\" Proceedings of ACM Conference on Computer Supported Cooperative Work (CSCW), November 1992. pp. 107-114.  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Hudson, Scott, and Smith, Ian. \"Ultra-Lightweight Constraints:' Proceedings of ACM Symposium on User Interface Software and Technology (UIST), 1996.  ",
      "doi": "10.1145/237091.237112"
    },
    {
      "text": "Kolland, Markus. \"Distribute~ System Support for Consistency of Shared Information in CSCW (Extended Abstract).\" Workshop on Distributed Systems, Multimedia, and I~tructure. ACM Conference on Computer- Supported Cooperative Work (CSCW), Oct. 22, 1994.",
      "doi": ""
    },
    {
      "text": "Kurlander, David, and Feiner, Steve. \"A History-Based Macro by Example System:' In Proceedings of A CM Symposium on User Interface Software and Technology (UIST). November 15-18, 1992. pp. 99-106.  ",
      "doi": "10.1145/142621.142633"
    },
    {
      "text": "Rhyne, James. R., and Wolf, Catherine G., \"Tools for Supporting the Collaborative Process.\" In Proceedings of ACM Symposium on User Interface Software and Technology (UIST). November 15-18, 1992. pp. 161- 168.  ",
      "doi": "10.1145/142621.142645"
    },
    {
      "text": "Terry, Doughs B., Theimer, Marvin M, Petersen, Karin, Demers, Alan J., Spreitzer, Mike J., and Hauser, Carl. \"Managing Update Conflicts in Bayou, a Weakly Connected Replicated Storage System.\" Xerox PARC Technical Report CSL-95-4, August 1995.",
      "doi": ""
    }
  ]
}