{
  "doi": "10.1145/258549.258698",
  "title": "Maintaining a focus on user requirements throughout the development of clinical workstation software",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "170-177",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Janette M. Coble",
      "institution": "Washington Univ. School of Medicine, Box 8005, 660 S. Euclid, St. Louis, MO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332493647",
      "orcid": "missing"
    },
    {
      "name": "John Karat",
      "institution": "IBM T. J. Watson Research, 30 Saw Mill River Road, Hawthorne, NY",
      "img": "/do/10.1145/contrib-81100505984/rel-imgonly/john_pic1.jpg",
      "acmid": "81100505984",
      "orcid": "missing"
    },
    {
      "name": "Michael G. Kahn",
      "institution": "Washington Univ. School of Medicine, Box 8005, 660 S. Euclid, St. Louis, MO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100452909",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, S. The Dilbert Principle. Harper, New York, 1996.",
      "doi": ""
    },
    {
      "text": "Bennett, J. L., &amp; Karat, J. Facilitating effective HCI design meetings. In B. Adelson, S. Dumas, and J. Olson (Eds.) Human Factors in Computing Systems: CHI'94 Conference Proceedings (1994), ACM, New York, 198- 204.  ",
      "doi": "10.1145/191666.191743"
    },
    {
      "text": "Carroll, J. M. Scenario-based design. Wiley, New York, 1995.",
      "doi": "10.5555/209227"
    },
    {
      "text": "Coble, J. M., Maffitt, J. S., Orland, M. J., and Kahn, M. G. Contextual Inquiry: Discovering physicians' true needs. In Gardner, R., ed. Proceedings of the Nineteen Annual Symposium on Computer Applications in Medical Care (1995), Hanley &amp; Belfus, Philadelphia, PA, 469-473.",
      "doi": ""
    },
    {
      "text": "Curtis, B., Krasner, H., &amp; Iscoe, N. A field study of the software design process for large systems. Communications ofthe ACM, 31, 11 (1988), 1268-1287.  ",
      "doi": "10.1145/50087.50089"
    },
    {
      "text": "Danis, C., &amp; Karat, J. Technology-driven design of speech recognition systems. In G. Olson and S. Schuon (Eds.) DIS'95: Symposium on designing interactive systems. (1995), ACM, New York, 17-24.  ",
      "doi": "10.1145/225434.225437"
    },
    {
      "text": "Floyd, C., Mehl, W., Reisen, E, Schmidt, G., &amp; Wolf, G. Out of Scandinavia: Alternative Approaches to Software Design and Systems Development. Human-Computer interaction, 4 (1989), 253-350.",
      "doi": ""
    },
    {
      "text": "Fritz, K. and Kahn, M. \"Project Spectrum: An Eighteen Hospital Enterprise-Wide Electronic Medical Record.\" in C. Peter Waegemann (ed), Proceedings, Toward an Electronic Patient Record '95. Volume 2 (1995), Medical Records Institute, Newton, MA, 59-67.",
      "doi": ""
    },
    {
      "text": "Holtzblatt, K., &amp; Jones, S. Contextual inquiry: A participatory technique for system design. In A. Namioka and D. Schuler (Eds.) Participatory design: Principles and practice. Erlbaum, Hillsdale, NJ, 1993.",
      "doi": ""
    },
    {
      "text": "Kehoe, R., &amp; Jarvis, A. ISO 9000-3: A tool for software product and process improvement. Springer, New York, 1996. ",
      "doi": "10.5555/211364"
    },
    {
      "text": "Kyng, M. Making Representations Work. Communications ofthe ACM, 38, 9 (1995), 46-55.  ",
      "doi": "10.1145/223248.223261"
    },
    {
      "text": "Whiteside, J., Bennett, J., &amp; Holtzblatt, K. Usability Engineering: Our experience and evolution. In M. Helander (Ed.) Handbook of human-computer interaction. (1988), Elsevier, Amsterdam, 791-817.",
      "doi": ""
    },
    {
      "text": "Wixon, D., Ramey, J., (eds.). Field Methods Casebook for Software Design. J. Wiley, New York, 1996. ",
      "doi": "10.5555/248028"
    }
  ]
}