{
  "doi": "10.1145/258549.258782",
  "title": "PaperLink: a technique for hyperlinking from real paper to electronic content",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "327-334",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Toshifumi Arai",
      "institution": "Hitachi Researeh Laboratory, Hitachi, Ltd., 1-10mika-cho 7-chome, Hitachi, Ibaraki 319-12 Japan",
      "img": "/do/10.1145/contrib-81100405296/rel-imgonly/toshifumi-sq.jpg",
      "acmid": "81100405296",
      "orcid": "missing"
    },
    {
      "name": "Dietmar Aust",
      "institution": "University of Dortmund, Department of Computer Graphics, Otto-Hahn Str. 16, 44221 Dortmund, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100374996",
      "orcid": "missing"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Georgia Institute of Technology, Graphics, Visualization, and Usability Center, and College of Computing, Atlanta, Georgia",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "Hansen, W., HAAS, C. \"Reading and Writing with Computers: A Framework for Explaining Differences in Performance\" CACM Vol.31 No.9, 1080-1089, 1988.  ",
      "doi": "10.1145/48529.48532"
    },
    {
      "text": "Nabeshima, S., Yamamoto, S., Agusa, K., Taguchi, T. \"MEMO-PEN: A New Input Device\" CHI'95 Conference Companion, 256-257, 1995  ",
      "doi": "10.1145/223355.223662"
    },
    {
      "text": "Cypher, A.,(ed), \"Watch What I Do: Programming by Demonstration\", MIT Press, 1993. ",
      "doi": "10.5555/168080"
    },
    {
      "text": "Aust, D., \"Augmenting Paper Documents with Digital Information in a Mobile Environment\" MS Thesis, University of Dortmund, Department of Computer Graphics, 1996. Also available electronically as http:/twww, cc. gatec h. edu/gvu/peop le/Fac ulty/h udson/hybrid_paperlaust_ms_thesis.ps.",
      "doi": ""
    },
    {
      "text": "Foley, J., van Dam, A., Feiner, S., and Hughes, J., \"Computer Graphics, Principles and Practice\", Addison Wesley, 1990. ",
      "doi": "10.5555/83821"
    },
    {
      "text": "Ballard, D. and Brown, C., \"Computer Vision\", Prentice-Hall, 1982. ",
      "doi": "10.5555/578131"
    },
    {
      "text": "Bryant, A., and Bryant, J., \"Recognizing Shapes in Planar Binary Images\", Pattern Recognition, 22(2), 155-164, 1989.",
      "doi": ""
    },
    {
      "text": "Dai, M., Baylou, P., and Najim, M., \"An Efficient Algorithm for the Computation of Shape Moments from Run-Length Codes or Chain Codes\", Pattern Recognition, 25(10), 119-1128, Feb. 1992.",
      "doi": ""
    },
    {
      "text": "Primax Electronics Ltd., \"DataPenTM User's Guide\", 1995.",
      "doi": ""
    },
    {
      "text": "Olsen, D., \"MIKE: The Menu Interaction and Kontrol Environment\", ACM Transactions on Graphics, 5(4), 318-344, 1986.  ",
      "doi": "10.1145/27623.28868"
    },
    {
      "text": "Wellner, P. \"The DigitalDesk Calculator: Tangible Manipulation on a Desk Top Display\" Proceedings of UIST'91, 27-33, 1991.  ",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "Newman. W., Wellner, P. \"A Desk Supporting Computer-based Interaction with Paper Documents\" Proceedings of CHI'92, 587-592, 1992.  ",
      "doi": "10.1145/142750.143007"
    },
    {
      "text": "Mackay, W.E., Pagani, D.S., Faber, L., Inwood, B., Launiainen, P., Brenta, L., Pouzol, V. \"Ariel: Augmenting Paper Engineering Drawings\" CHI'95 Conference Companion, 421-422, 1995.  ",
      "doi": "10.1145/223355.223763"
    },
    {
      "text": "Arai, T., Machii, K., Kuzunuki, S., Shojima, H. \"InteractiveDESK: A Computer-Augmented Desk Which Responds to Operations on Real Objects\" CHI'95 Conference Companion, 141-142, 1995.  ",
      "doi": "10.1145/223355.223470"
    },
    {
      "text": "Arai, T., Machii, K., Kuzunuki, S. \"Retrieving Electronic Documents with Real- World Objects on InteractiveDESK\" Proceedings of UIST'95, 37-38, 1995.  ",
      "doi": "10.1145/215585.215642"
    },
    {
      "text": "Rekimoto, J., Nagao, K. \"The World through the Computer: Computer Augmented Interaction with Real World Environments\" Proceedings of UIST'95, 29-36, 1995.  ",
      "doi": "10.1145/215585.215639"
    },
    {
      "text": "Stifelman, L. \"Augmenting Real-World Objects: A Paper-Based Audio Notebook\" CHI'96 Conference Companion, 199-200, 1996.  ",
      "doi": "10.1145/257089.257279"
    },
    {
      "text": "Johnson, W., Jellinek, H., Klotz, L., Rao, R., Card, S. \"Bridging the Paper and Electronic Worlds: The Paper User Interface\" Proceedings of INTERCHI'93, 507-512, 1993.  ",
      "doi": "10.1145/169059.169445"
    },
    {
      "text": "Rao, R., Card, S., Johnson, W., Klotz, L., Trigg, R. \"Protofoil: Storing and Finding the Information Worker's Paper Documents in an Electronic File Cabinet\" Proceedings of CHI'94, 180-185, 1994.  ",
      "doi": "10.1145/191666.191738"
    }
  ]
}