{
  "doi": "10.1145/258549.258632",
  "title": "WorldBeat: designing a baton-based interface for an interactive music exhibit",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "131-138",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "tags": [
    "interface design",
    "baton",
    "interactive exhibit",
    "education",
    "music"
  ],
  "authors": [
    {
      "name": "Jan O. Borchers",
      "institution": "Telecooperation Research Group, Department of Computer Science, Linz University, 4040 Linz, Austria",
      "img": "/do/10.1145/contrib-81100443423/rel-imgonly/borchers_7154.jpg",
      "acmid": "81100443423",
      "orcid": "0000-0003-1509-3257"
    }
  ],
  "references": [
    {
      "text": "Albers, J. Interaction of Color, Yale University Press, New Haven, CT, 1975.]] ",
      "doi": "10.5555/1204273"
    },
    {
      "text": "Bell, T.E. US science and technology museums visitor survey, IEEE Spectrum, Vol. 32, September 1995, 50- 71, and October 1995, 48-71.]]",
      "doi": "10.1109/6.406466"
    },
    {
      "text": "Borchers, J., Deussen, O., and Kn6rzer, C. Getting It Across: Layout Issues for Kiosk Systems. In: Proceedings of the Workshop on W3-Based Online Kiosk Systems, Third International World-Wide Web Conference, Darmstadt 1995. Reprinted in: SIGCHI Bulletin, Vol. 27, No. 4, ACM Press, October 1995, 68-74.]]  ",
      "doi": "10.1145/214132.214170"
    },
    {
      "text": "Dobrian, J.C. MAX Reference Manual. Opcode Systems, Inc., Palo Alto, CA, 1995.]]",
      "doi": ""
    },
    {
      "text": "Ghias, A., Logan, J., Chamberlin, D., and Smith, B.C. Query By Humming- Large Musical Information Retrieval in An Audio Database. Proceedings of the A CM Multimedia 1995 (San Francisco, CA, November 5-9, 1995), ACM Press, New York, 1995, 213-236.]]  ",
      "doi": "10.1145/217279.215273"
    },
    {
      "text": "Janko, S., Leopoldseder, H., and Stocker, G. Ars Electronica Center.\" Museum of the Future. Ars Electronica Center, Linz, Austria, 1996.]]",
      "doi": ""
    },
    {
      "text": "Lee, M., Garnett, G., and Wessel, D. An Adaptive Conductor Follower. Proc. of the International Computer Music Conference, 1992.]]",
      "doi": ""
    },
    {
      "text": "Marrin, T. Toward an Understanding of Musical Gesture: Mapping Expressive Intention with the Digital Baton. Master's thesis, MIT Media Lab, Boston, 1996.]]",
      "doi": ""
    },
    {
      "text": "McAdams, M. Information Design and the New Media. Interactions, Vol. 11, No. 4, ACM Press, 1995, 36-46.]]  ",
      "doi": "10.1145/225362.225369"
    },
    {
      "text": "Miihlh/iuser, M., Borchers, J., Falkowski, C., and Manske, K. The Conference/Classroom of the Future: An interdisciplinary approach. In: Proceedings of the IFIP Conference \"The International Office of the Future: Design Options and Solution Strategies\" (University of Arizona, Tucson, AZ, USA, Apr. 9-1 I, 1996), Chapman and Hall, 1996, 233-250.]]",
      "doi": ""
    },
    {
      "text": "Norman, D.A. The Psychology of Everyday Things. BasicBooks, 1988.]]",
      "doi": ""
    },
    {
      "text": "Reider, D.J. The New Surf Music: Improvising on the Net. TECHNOS Quarterly Journal Agency for Instructional Technology, USA, Summer 1995.]]",
      "doi": ""
    },
    {
      "text": "Rich, R. Buchla Lightning II. Electronic Musician, Vol. 12, No. 8, Cardinal Business Media, Emeryville, CA, August 1996, 118-124.]]",
      "doi": ""
    },
    {
      "text": "Roh, J. H., and Wilcox, L. Exploring Tabla Drumming Using Rhythmic input. Proc. of the CHI '95 (Denver, CO, USA, May 7-11, 1995), ACM Press, 1995, 310-311.]]  ",
      "doi": "10.1145/223355.223689"
    },
    {
      "text": "Shubin, H., Falck, D., and Johansen, A.G. Exploring Color in Interface Design. Interactions, Vol. III, No. 4, ACM Press, July+August 1996, 36-48.]]  ",
      "doi": "10.1145/234813.234818"
    }
  ]
}