{
  "doi": "10.1145/258549.258803",
  "title": "Characterizing interactive externalizations",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "375-382",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Lisa Tweedie",
      "institution": "Department of Electrical Engineering, Imperial College of Science, Technology and Medicine, South Kensington, London SW7 2BT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100603742",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ahlberg C. and Truve S. \"Exploring Terra Incognita in the Design Space of Query Devices\" Proceedings Engineering for Human Computer Interaction, EHCI'95, North Holland. ",
      "doi": "10.5555/645348.650677"
    },
    {
      "text": "Ahlberg C., Williamson C. and Shneiderman, B. \"Dynamic Queries for Information Exploration: An implementation and Evaluation\" Proceedings of CHI'92 pp. 619-626 ACM Press.  ",
      "doi": "10.1145/142750.143054"
    },
    {
      "text": "Becker R.A., Huber P.J., Cleveland W.S. and Wilks A.R. \"Dynamic Graphics for Data Analysis\", Stat. Science 2, 1987.",
      "doi": ""
    },
    {
      "text": "Bederson B., Hollan J.D., Perlin K., Meyer J., Bacon D. and Fumas G. \"Pad++: A Zoomable Graphical Sketchpad for exploring Alternate Interface Physics\" Journal of Visual Languages and Computing (1996) 7, pp. 3-31.",
      "doi": ""
    },
    {
      "text": "Benyon D. (1992) \"Task analysis and sytem design: the discipline of data\" Interacting with Computers 4 (1) 246-249  ",
      "doi": "10.1016/0953-5438%2892%2990015-8"
    },
    {
      "text": "Bertin J. \"Graphics and Graphic Information Processing\" deGruyter Press, Berlin, 1977.",
      "doi": ""
    },
    {
      "text": "Bier E.A., Stone M.C., Fishkin K., Buxton W., Baudel T. \"A Taxonomy of See-Through Tools\" in Proceedings of CHI'94 pp. 358-364, ACM Press  ",
      "doi": "10.1145/191666.191786"
    },
    {
      "text": "Brooks, R. \"Comparative Task Analysis: An Alternative Direction for Human-Computer Interaction Science\" pp. 50- 59, in \"Designing Interaction\" John M. Carroll (Ed), Cambridge University Press (1991 ) ",
      "doi": "10.5555/120352.120356"
    },
    {
      "text": "Card S.K., Mackinlay J.D. and Robertson G.G \"The Design Space of Input Devices\" Proceedings of CHI'90, pp. 117-124 ACM Press.  ",
      "doi": "10.1145/97243.97263"
    },
    {
      "text": "Card S.K., Pirolli P. and Mackinlay J.D. \"The Cost of Knowledge Characteristic Function: Display Evaluation for Direct-walk Dynamic Information Visualizations\" Proceedings of CHI'94 ACM Press  ",
      "doi": "10.1145/191666.191753"
    },
    {
      "text": "Casner S. \"A Task-Analytic Approach to the Automated Design of Graphic Presentations\" ACM Transactions on Graphics 10, (2) pp. 111-151  ",
      "doi": "10.1145/108360.108361"
    },
    {
      "text": "Chalmers M., Ingrain R. and Pfranger C. (1996) \"Adding Imageability feature to Information Displays\" Proceedings of UIST'96 pp  ",
      "doi": "10.1145/237091.237096"
    },
    {
      "text": "Dawkes H., Tweexfie L.A. and Spence B. (1996)\"VICKI-The Visualisation Construction Kit\" in the Proceedings of Advanced Visual Interfaces '96, Gubbio, Italy.  ",
      "doi": "10.1145/948449.948490"
    },
    {
      "text": "Davidson C. \"What your database hides away\" New Scientist 9th January 1993",
      "doi": ""
    },
    {
      "text": "Draper S. \"Display Managers as the Basis for User-Machine Communication\" in (Eds) D. Norman and S. Draper User Centered System Design Lawrence Erlbaum Associates",
      "doi": ""
    },
    {
      "text": "Draper, S. \"Critical Notice: Activity theory: the new direction for HCI?\" IDIOMS (1993) pp. 812-821",
      "doi": ""
    },
    {
      "text": "Eick S.G. \"Data Visualization Sliders\" UIST'94 November pp. 119-120, ACM Press  ",
      "doi": "10.1145/192426.192472"
    },
    {
      "text": "Eick S.G., Steffen J.L. and Sumner E.E. \"SeeSoft ru _ A Tool for Visualizing Line Oriented Software\", IEEE Transactions on Software Engineering, pp. 11-18, 1992.  ",
      "doi": "10.1109/32.177365"
    },
    {
      "text": "Eisenberg M. \"The Thin Glass Line: Designing Interfaces to Algorithms\" in Proceedings of CHI'96, ACM Press.  ",
      "doi": "10.1145/238386.238474"
    },
    {
      "text": "Furnas G.W. and Zacks J. \"Multitrees: Enriching and Reusing Hierarchical Structure\" In Proceedings of CHI'94, ACM Press  ",
      "doi": "10.1145/191666.191778"
    },
    {
      "text": "Green T.R.G. \"Cognitive Dimensions of Notations\" in A.Sutcliffe and L. Macaulay \"People and Computers VI: Proceedings of HCI'89\" Nottingham, pp 443-460, Cambridge University Press. ",
      "doi": "10.5555/92968.93015"
    },
    {
      "text": "Green T.R.G. and Benyon D.R. 'if'he skull beneath the skin: entity-relationship models of information artifacts\" Int. J. Human Computer Studies (1996) 44 pp. 801-828  ",
      "doi": "10.1006/ijhc.1996.0034"
    },
    {
      "text": "Howe D. \"Data Analysis for Database Design\", Edward Arnold 1983. ",
      "doi": "10.5555/534033"
    },
    {
      "text": "lnselberg A. \"The plane with parallel coordinates\", The Visual Computer 1, pp. 69-91, 1985.",
      "doi": "10.1007/BF01898350"
    },
    {
      "text": "Keim D.A. and Kriegal H. \"VisDB: Database Exploration using Multidimensional Visualization\", IEEE Computer Graphics and Applications September, pp. 40-49, 1994.  ",
      "doi": "10.1109/38.310723"
    },
    {
      "text": "Larkin J.H. and Simon H. A. \"Why a Diagram is (Sometimes) worth Ten Thousand Words\" Cognitive Science 11 (1987) pp. 65-99",
      "doi": ""
    },
    {
      "text": "Lunzer A. \"Reconnaissance: a widely applicable approach encouraging well-informed choices in computer-based tasks. Ph.D. thesis. TR-1996-4, Department of Computing Science, University of Glasgow, February 1996. 266pp.",
      "doi": ""
    },
    {
      "text": "Mihalisin T., Gawlinski E., Timlin J. and Schwegler J. \"Visualizing Scalar Field on an N-dimensional Lattice\", Proc. of Visualization 90, IEEE CS Press, pp. 255-262, 1990. ",
      "doi": "10.5555/949531.949571"
    },
    {
      "text": "Nardi B.A. \"Context and Consciousness\" MIT Press 1996.",
      "doi": ""
    },
    {
      "text": "Nardi B.A. and Zarmer C.L. \"Beyond Models and Metaphors: Visual Formalisms in User Interface Design\", Journal of Visual Languages and Computing 4, pp. 5- 33, 1993.",
      "doi": ""
    },
    {
      "text": "Newton C.M. \"Graphics: from alpha to omega in data analysis\", in Graphical Representation of Multivariate Data, P.C.C. Wang (Ed) Academic Press, pp. 59-92, 1978.",
      "doi": ""
    },
    {
      "text": "Norman D. \"The Psychology of Everyday Things\" 1988, Basic Books.",
      "doi": ""
    },
    {
      "text": "Norman D.A. \"Cognitive Artifacts\" pp. 17-38 in \"Designing Interaction\" John Carroll (Ed), Cambridge Uni. Press (1991) ",
      "doi": "10.5555/120352.120354"
    },
    {
      "text": "Rao R. and Card S.K. \"The Table Lens\", Proceextings of CHI'94, Boston, ACM Press, pp. 318-322, 1994.  ",
      "doi": "10.1145/191666.191776"
    },
    {
      "text": "Robertson, G., Mackinlay J. and Card S.K. \"Cone Trees: Animated 3D Visualizations of Hierarchical Information\" Proceedings of CHI'91 pp. 189-194 ACM Press  ",
      "doi": "10.1145/108844.108883"
    },
    {
      "text": "Robertson, P.K. \"A Methodology for choosing Data Representations\" IEEE Computer Graphics and Applications May 1991 pp. 56-67.  ",
      "doi": "10.1109/38.79454"
    },
    {
      "text": "Simon H.A. \"The Sciences of the Artificial\" MIT Press 1969 ",
      "doi": "10.5555/237774"
    },
    {
      "text": "Smets G, Gaver W.W., Overbeeke C.J. and Stappers P.J. \"Designing in Virtual Reality: Perception-Action Coupling and Form Semantics\" Adjunct Proceedings INTERCHI'93.  ",
      "doi": "10.1145/259964.259975"
    },
    {
      "text": "Smith R. \"Experiences with the Alternate Reality Kit: An Example of the Tension between Literalism and Magic\" in the Proceedings of CHI and GI '87, ACM Press.  ",
      "doi": "10.1145/29933.30861"
    },
    {
      "text": "Spoerri A. \"lnfoCrystal: A visual tool for Information retrieval\" Proceedings of Visualization '93 pp. 150-157. ",
      "doi": "10.5555/949845.949876"
    },
    {
      "text": "Tukey J. \"Exploratory Data Analysis\" Reading, MA: Addison Wesley",
      "doi": ""
    },
    {
      "text": "Tweedie L.A. \"interactive Visualization Artifacts: how can abstractions inform design?\", People and Computers X\" Proc. of HCI'95 Huddersfield, (Eds) Kirby M.A.R., Dix A.J. and Finlay J.E., Cambridge University Press, pp. 247-265, 1995. ",
      "doi": "10.5555/215635.215702"
    },
    {
      "text": "Tweedie L.A., Spence R., Bhoghal R. and Williams D. 'if'he Attribute Explorer\", ACM, Video Proceedings and Conference Companion, CHI'94, pp. 435-436, April 1994.  ",
      "doi": "10.1145/259963.260433"
    },
    {
      "text": "Tweedie L.A., Spence R., Dawkes H. and Su H. \"Externalizing Abstract Mathematical Models\" Proceedings of CHI'96 pp. 406-412 ACM Press  ",
      "doi": "10.1145/238386.238587"
    },
    {
      "text": "Vellman P. \"The DataDesk Manual\" Data Description Inc. Ithaca N.Y. 1985",
      "doi": ""
    },
    {
      "text": "Wilkinson L. \"Enhancing Scatterplot Matrices\" in Survey and Statistical Computing A.Westlake(Ed) Elsevier Science, 1992.",
      "doi": ""
    },
    {
      "text": "Williamson C. and Shneiderman B. \"The Dynamic HomeFinder: Evaluating dynamic queries in a real estate information exploration system\", ACM, Proceedings SIGIR'92, pp. 339-346, 1992.  ",
      "doi": "10.1145/133160.133216"
    },
    {
      "text": "Young D. and Shneiderman B. \"A graphical filter/flow model for Boolean queries: An implementation and experiment\" J. of the American Soc. for Information Science 44 (4) pp. 327-339  ",
      "doi": "10.5555/160921.160924"
    },
    {
      "text": "Young F.W, Faldowski R.A. and McFarlane M.M. \"Multivariate Statistical Visualization\" in C.R. Rao (Ed) Handbook of Statistics Vol. 9, Elsevier Science (1993)",
      "doi": ""
    },
    {
      "text": "Zhang J. \"A representational analysis of relational information displays\" International Journal of Human Computer Studies, 1996, 45, pp59-74  ",
      "doi": "10.1006/ijhc.1996.0042"
    },
    {
      "text": "Zhang J. and Norman D.A. \"Representations in Distributed Cognitive Tasks\", Cognitive Science 18, pp. 87-122, 1994.",
      "doi": ""
    }
  ]
}