{
  "doi": "10.1145/258549.258797",
  "title": "The persona effect: affective impact of animated pedagogical agents",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "359-366",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "James C. Lester",
      "institution": "Department of computer Science, North Carolina State University, Raleigh, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339512416",
      "orcid": "missing"
    },
    {
      "name": "Sharolyn A. Converse",
      "institution": "Department of Psychology, North Carolina State University, Raleigh, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100420447",
      "orcid": "missing"
    },
    {
      "name": "Susan E. Kahler",
      "institution": "Department of Psychology, North Carolina State University, Raleigh, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659258479",
      "orcid": "missing"
    },
    {
      "name": "S. Todd Barlow",
      "institution": "Department of Psychology, North Carolina State University, Raleigh, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100453958",
      "orcid": "missing"
    },
    {
      "name": "Brian A. Stone",
      "institution": "Department of computer Science, North Carolina State University, Raleigh, NC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100387882",
      "orcid": "missing"
    },
    {
      "name": "Ravinder S. Bhogal",
      "institution": "London Institute, Royal College of Art, Kensington Gore, London SW7, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81546124756",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Elisabeth Andr6 and Thomas Rist. Coping with temporal constraints in multimedia presentation planning. In Proceedings of the Thirteenth National Conference on Artificial Intelligence, pages 142-147, 1996. ",
      "doi": "10.5555/1892875.1892896"
    },
    {
      "text": "Joseph Bates. The role of emotion in believable agents. Communications of the ACM, 37(7): 122-125, 1994.  ",
      "doi": "10.1145/176789.176803"
    },
    {
      "text": "Bruce Blumberg and Tinsley Galyean. Multi-level direction of autonomous creatures for real-time virtual environments. In Computer Graphics Proceedings, pages 47-54, 1995.  ",
      "doi": "10.1145/218380.218405"
    },
    {
      "text": "E. Cauzinille-Marmeche and J. Mathieu. Experimental data for the design of a microworld-based system for algebra. In Heinz Mandl and Alan Lesgold, editors, Learning Issues for Intelligent Tutoring Systems, pages 278-286. Springer-Verlag, New York, 1988. ",
      "doi": "10.5555/58195.58207"
    },
    {
      "text": "M. Chi, M. Bassok, M. Lewis, P. Reimann, and R. Glaser. Self-explanations: How students study and use examples in learning to solve problems. Cognitive Science, 13:145-1182, 1989.",
      "doi": ""
    },
    {
      "text": "Christopher R. Elliot and Beverly P. Woolf. A simulation-based tutor that reasons about multiple agents. In Proceedings of the Thirteenth National Conference on Artificial Intelligence, pages 409-415, 1996. ",
      "doi": "10.5555/1892875.1892937"
    },
    {
      "text": "John P. Granieri, Welton Becket, Barry D. Reich, Jonathan Crabtree, and Norman I. Badler. Behavioral control for real-time simulated human agents. In Proceedings of the 1995 Symposium on Interactive 3D Graphics, pages 173-180, 1995.  ",
      "doi": "10.1145/199404.199435"
    },
    {
      "text": "James D. Hollan, Edwin L. Hutchins, and Louis M. Weitzman. STEAMER: An interactive, inspectable, simulation-based training system. In Greg Kearsley, editor, Artificial intelligence and Instruction: Applications and Methods, pages 113-134. Addison-Wesley, Reading, MA, 1987. ",
      "doi": "10.5555/26306.26312"
    },
    {
      "text": "David Kurlander and Daniel T. Ling. Planning-based control of interface animation. In Proceedings of CHI '95, pages 472--479, 1995.  ",
      "doi": "10.1145/223904.223968"
    },
    {
      "text": "Robert W. Lawler and Gretchen E Lawler. Computer microworlds and reading: An analysis for their systematic application. In Robert W. Lawler and Masoud Yazdani, editors, Artificial intelligence and Education, volume 1, pages 95-115. Ablex, Norwood, NJ, 1987. ",
      "doi": "10.5555/55463.55468"
    },
    {
      "text": "James C. Lester, Patrick J. FitzGerald, and Brian A. Stone. The pedagogical design studio: Exploiting artifact-based task models for constructivist learning. In Proceedings of the Third International Conference on Intelligent User Interfaces, 1997.  ",
      "doi": "10.1145/238218.238317"
    },
    {
      "text": "James C. Lester and Brian A. Stone. Increasing believability in animated pedagogical agents. In Proceedings of the First International Conference on Autonomous Agents, 1997.  ",
      "doi": "10.1145/267658.269943"
    },
    {
      "text": "James C. Lester, Brian A. Stone, Michael A. O'Leary, and Robert B. Stevenson. Focusing problem solving in design-centered learning environments. In Proceedings of the Third International Conference on Intelligent Tutoring Systems, pages 475-483, 1996. ",
      "doi": "10.5555/648028.745145"
    },
    {
      "text": "R Maes, T. Darrell, B. Blumberg, and A. Pentland. The ALIVE system: Full-body interaction with autonomous agents. In Proceedings of the Computer Animation '95 Conference, 1995. ",
      "doi": "10.5555/791214.791451"
    },
    {
      "text": "C. Nass, J. Steuer, L. Henriksen, and H. Reeder. Anthropomorphism, agency and ethopoeia: Computers as social actors. In Proceedings of the International CHI Conference, 1993.  ",
      "doi": "10.1145/259964.260137"
    },
    {
      "text": "Clifford Nass, Youngme Moon, B. J. Fogg, Byron Reeves, and D. Christopher Dryer. Can computer personalities be human personalities. International Journal of Human-Computer Studies, 43:223-239, 1995.  ",
      "doi": "10.1006/ijhc.1995.1042"
    },
    {
      "text": "Byron Reeves and Clifford Nass. Information characteristics of media technologies that give a sense of \"being there\". In Annual Meeting of the International Communication Association, 1992.",
      "doi": ""
    },
    {
      "text": "Jeff Rickel and Lewis Johnson. Integrating pedagogical capabilities in a virtual environment agent. In Proceedings of the First International Conference on Autonomous Agents, 1997.  ",
      "doi": "10.1145/267658.267664"
    },
    {
      "text": "Brian A. Stone and James C. Lester. Dynamically sequencing an animated pedagogical agent. In Proceedings of the Thirteenth National Conference on Artificial Intelligence, pages 424--431, 1996. ",
      "doi": "10.5555/1892875.1892939"
    },
    {
      "text": "Patrick W. Thompson. Mathematical microworlds and intelligent computer-assisted instruction. In Greg Kearsley, editor, Artificial Intelligence and Instruction: Applications and Methods, pages 83-109. Addison- Wesley, Reading, MA, 1987. ",
      "doi": "10.5555/26306.26311"
    },
    {
      "text": "Xiaoyuan Tu and Demitri Terzopoulos. Artificial fishes: Physics, locomotion, perception, and behavior. In Computer Graphics Proceedings, pages 43-50, 1994.  ",
      "doi": "10.1145/192161.192170"
    }
  ]
}