{
  "doi": "10.1145/258549.258629",
  "title": "A computer participant in musical improvisation",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "123-130",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "William F. Walker",
      "institution": "Apple Research Labs, 1 Infinite Loop, MS: 301-4B, Cupertino, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100423458",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brown, J., Sex Machine 1970, Polygram Records (CD #314 517 984-2): New York.]]",
      "doi": ""
    },
    {
      "text": "Button, G., Going Up a Blind Alley: Conflating Conversation Analysis and Computational Modelling, in Computers and Conversation, P. Luff, N. Gilbert, andD. Frohlich, Editors. 1990, Academic Press Limited: London. p. 67-90.]]",
      "doi": ""
    },
    {
      "text": "Caramia, T., A Guide for Jazz Piano Harmonization. 1983, San Diego: Neil A. Kjos Music Company.]]",
      "doi": ""
    },
    {
      "text": "Davis, M., Kind of Blue 1959, Columbia: New York.]]",
      "doi": ""
    },
    {
      "text": "Ellinger, J. and M. Baker, MiBACTM Jazz Improvisation Software 1990, MiBAC Music Software: Northfield, Minnesota.]]",
      "doi": ""
    },
    {
      "text": "Franco, S., Hardware Design of a Real-Time Musical System, 1974. Doctoral Dissertation, University of Illinois at Urbana-Champaign.]] ",
      "doi": "10.5555/907416"
    },
    {
      "text": "Giomi, F. and M. Ligabue. An Interactive System for Music Improvisation in Proceedings of the International Computer Music Conference (Cologne, Germany, 1988), ICMA, 47-63.]]",
      "doi": ""
    },
    {
      "text": "Gridley, M., Jazz Styles. 1985, Englewood Cliffs: Prentice-Hail.]]",
      "doi": ""
    },
    {
      "text": "Hartmann, C., Jazz Text: Voice and Improvisation in Poetry, Jazz and Song. 1991, Princeton: Princeton University Press.]]",
      "doi": ""
    },
    {
      "text": "Heath, C. and P. Luff. Collaborative Activity and Technological Design in Proceedings of ECSCW '91 1991), 65-80.]] ",
      "doi": "10.5555/1241910.1241915"
    },
    {
      "text": "Jefferson, G., List construction as a Task and Resource, in Interaction Competence, G. Psathas, Editor. 1990, University Press of America: Lanham.]]",
      "doi": ""
    },
    {
      "text": "Johnson, R. and B. Foote, Designing Reusable Classes. Journal of Object-Oriented Programming, 1988. 1(2): p. 22B35.]]",
      "doi": ""
    },
    {
      "text": "Kaplan, S., A. Carroll, and K. MacGregor, Supporting Collaborative Processes with ConversationBuilder. ACM Special Interest Group in Office Information Systems, 1991. 12(2/3).]]  ",
      "doi": "10.1145/127769.122838"
    },
    {
      "text": "Levitt, D., A Melody Description System for jazz Improvisation, 1981. Master's Thesis, Massachussets Institute of Technology.]]",
      "doi": ""
    },
    {
      "text": "Luff, P., N. Gilbert, and D. Frolich, ed. Computers and Conversation. Computers and People Series, eds. B. Gaines and A. Monk. 1990, Academic Press: London. 284.]]",
      "doi": ""
    },
    {
      "text": "Martirano, S., A Salvatore Martirano Retrospective: 1962-1992 1995, Centaur Records: Baton Rouge.]]",
      "doi": ""
    },
    {
      "text": "Nass, C., et al., Can computer personalities be human personalities? International Journal of Human- Computer Studies, 1995.43: p. 223-239.]]  ",
      "doi": "10.1006/ijhc.1995.1042"
    },
    {
      "text": "Pachet, F. Representing Knowledge Used by Jazz Musicians in Proceedings of the International Computer Music Conference (Montr6al, 1991), ICMA, 285-288.]]",
      "doi": ""
    },
    {
      "text": "Perlman, A. and D. Greenblatt, Miles Davis Meets Noam Chomsky: Some Observations on Jazz Improvisation and Language Structure, in The Sign in Music and Language, W. Steiner, Editor. 1981, University of Texas Press: Austin.]]",
      "doi": ""
    },
    {
      "text": "Sacks, H., E. Schegloff, and G. Jefferson, A Simplest Systematics for the Organization of Turntaking for Conversation. Language: Journal of the Linguistic Society of America, 1974.50(4): p. 39.]]",
      "doi": ""
    },
    {
      "text": "Suchmann, L., Plans and Situated Actions. 1987, Cambridge: Cambridge University Press.]]",
      "doi": ""
    },
    {
      "text": "Turkle, S., The Second Self: Computer and the Human Spirit. 1984, New York: Simon and Schuster.]] ",
      "doi": "10.5555/2773"
    },
    {
      "text": "Ulrich, J. The analysis and synthesis of jazz by computer in Fifth International Joint Conference on Artificial Intelligence (Cambridge, MA, 1977), William Kaufmann, 865-872.]]",
      "doi": ""
    },
    {
      "text": "Walker, W. and B. Belet. Applying ImprovisationBuilder to Interactive Composition with MIDI Piano in Proceedings of the International Computer Music Conference (Hong Kong, 1996), ICMA, 386-389.]]",
      "doi": ""
    },
    {
      "text": "Walker, W., K. Hebel, S. Martirano, and C. Scaletti. ImprovisationBuilder: Improvisation as Conversation in Proceedings of the International Computer Music Conference (San Jose, 1992), ICMA, 190-193.]]",
      "doi": ""
    }
  ]
}