{
  "doi": "10.1145/258549.258758",
  "title": "Interval scripts: a design paradigm for story-based interactive systems",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "287-294",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Claudio S. Pinhanez",
      "institution": "MIT Media Laboratory, 20 Ames St., E15-368C, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100364954",
      "orcid": "missing"
    },
    {
      "name": "Kenji Mase",
      "institution": "ATR-MIC Research Lab., Seika-cho Soraku-gun, Kyoto 619-02, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100070056",
      "orcid": "missing"
    },
    {
      "name": "Aaron Bobick",
      "institution": "MIT Media Laboratory, 20 Ames St., E15-384B, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100441050",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alien, J. F. Towards a general theory of action and time. Artificial Intelligence 23 (1984), 123-154.  ",
      "doi": "10.1016/0004-3702%2884%2990008-0"
    },
    {
      "text": "Bates, J., Loyall, A. B., and Reilly, W. S. An architecture for action, emotion, and social behavior. In Proceedings of the Fourth European Workshop on Modeling Autonomous Agents in a Multi-Agent World (S. Martino al Cimino, Italy, July 1992). ",
      "doi": "10.5555/646907.710645"
    },
    {
      "text": "Fukumoto, M., Mase, K., and Suenaga, Y. Fingerpointer: pointing interface by image processing. Comput. ~.:; Graphics. 18, 5 (May 1994), 633-642.",
      "doi": ""
    },
    {
      "text": "Galyean, T. A. Narrative Guidance of Interactivity. PhD thesis. M.I.T. Media Arts and Sciences, 1995. ",
      "doi": "10.5555/922009"
    },
    {
      "text": "Maes, P., Darrell, T., Blumberg, B., and Pentland, A. The ALIVE system: full-body interaction with autonomous agents. In Proc. of the Computer Animation '95 Conference (Geneva, Switzerland, Apr. 1995). ",
      "doi": "10.5555/791214.791451"
    },
    {
      "text": "Pinhanez, C. S. Computer theater. Technical Report 378, M.I.T. Media Laboratory Perceptual Computing Section, May 1996.",
      "doi": ""
    },
    {
      "text": "Pinhanez, C. S., and Bobick, A. F. PNF Calculus: a method for the representation and fast recognition of temporal structure. Technical Report 389, M.I.T. Media Laboratory Perceptual Computing Section, Sept. 1996.",
      "doi": ""
    },
    {
      "text": "Tosa, N., Hashimoto, H., Sezaki, K., Kunii, Y., Yamada, T., Sabe, K., Nishino, R., Harashima, H., and Harashima, F. Network-based neuro-baby with robotic hand. In Proc. of IJCAi'95 Workshop on Entertainment and AI/Alife (Montreal, Canada, Aug. 1995).",
      "doi": ""
    },
    {
      "text": "Tosa, N., and Nakatsu, R. For interactive virtual drama: body communication actor. In Proc. of 7th International Symposium on Electronic Art (Rotterdam, The Netherlands, Sept. 1996).",
      "doi": ""
    },
    {
      "text": "Vilain, M., Kautz, H., and van Beek, P. Constraint propagation algorithms for temporal reasoning: a revised report. In Readings in Qualitative Reasoning .4bout Physical Systems, D. S. Weld and J. de Kleer, Eds. Morgan Kaufmann, San Mateo, California, 1990, pp. 373-381. ",
      "doi": "10.5555/93913.93996"
    },
    {
      "text": "Wren, C. R., Azarbayejani, A., Darrell, T. and Pentland, A. Pfinder: real-time tracking of the human body. Technical Report 353, M.I.T. Media Laboratory Perceptual Computing Section, 1995.",
      "doi": ""
    }
  ]
}