{
  "doi": "10.1145/258549.258755",
  "title": "From Web press to Web pressure: multimedia representations and multimedia publishing",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "279-286",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Victoria Bellotti",
      "institution": "Apple Research Labs, 1 Infinite Loop, MS: 301-4A, Cupertino, CA",
      "img": "/do/10.1145/contrib-81100464780/rel-imgonly/bellotti-portrait-small.jpg",
      "acmid": "81100464780",
      "orcid": "missing"
    },
    {
      "name": "Yvonne Rogers",
      "institution": "Apple Research Labs & Sussex University, Brighton BN1 9QH, UK",
      "img": "/do/10.1145/contrib-81100173923/rel-imgonly/yvonne.jpg",
      "acmid": "81100173923",
      "orcid": "0000-0001-7612-0234"
    }
  ],
  "references": [
    {
      "text": "Apple Computer, Inc. (1994). Multimedia Demystified. Random House/New Media Series, NY.]] ",
      "doi": "10.5555/527970"
    },
    {
      "text": "Baecker, R. (Ed.) (1993). Groupware and Computer- Supported Cooperative Work: Assisting Human- Human Collaboration. Morgan Kaufmann, San Mateo, CA.]] ",
      "doi": "10.5555/212925.212996"
    },
    {
      "text": "Beck, E. and Bellotti, V. (1993). Informed Opportunism as Strategy: Supporting Coordination in Distributed Collaborative Writing. In Proc. 3rd European Conference on Computer-Supported Cooperative Work (ECSCW'93), Kluwer Academic Publishers, Dordrecht, 233-248.]] ",
      "doi": "10.5555/1241934.1241950"
    },
    {
      "text": "Bellotti, V. and Bly, S. (1996). Walking away from the desktop computer: distributed collaboration and mobility in a product design team. In Proc. A CM Conference on Computer Supported Cooperative Work, CSCW'96, ACM, NY, 209-218.]]  ",
      "doi": "10.1145/240080.240256"
    },
    {
      "text": "Blattner, M.M. and Dannenberg, R.B. (1992). Multimedia Interface Design. Addison Wesley, Reading, Mass.]] ",
      "doi": "10.1145/146022"
    },
    {
      "text": "Bowers, J. and Rodden, T. (I 993). Exploding The Interface: Experiences of a CSCW Network. In Proc. Human Factors in Computing Systems, INTERCHI'93, ACM Press: NY, 255-262.]]  ",
      "doi": "10.1145/169059.169205"
    },
    {
      "text": "Card, S., Robertson, G. and York, W. (1996). The Web- Book and Web Forager: An Information Workspace for the World-Wide Web. In Proc. A CM Conference on Human Factors in Computing Systems, CHI'96, ACM, NY, 111-117.]]  ",
      "doi": "10.1145/238386.238446"
    },
    {
      "text": "Diba Inc., http://www.diba.com.]]",
      "doi": ""
    },
    {
      "text": "Elrod, S., Bruce, R., Gold, R., Goldberg, D., Halsz, E, Janssen, W., Lee, D., McCall, K., Pedersen, E., Pier, K., Tang, J. and Welch, B. (1992). Liveboard: A Large Interactive Display Supporting Group Meetings, Presentation and Remote Collaboration. In Proc. A CM Conference on Human Factors in Computing Systems, CHI'92, ACM, NY, 599-607.]]  ",
      "doi": "10.1145/142750.143052"
    },
    {
      "text": "Greenberg, S. (1991). Computer Supported Cooperative Work and Groupware. Academic Press, London, UK.]] ",
      "doi": "10.5555/122825"
    },
    {
      "text": "Greenberg, S., Hayne, S. &amp; Rada, R. (1995) Groupware for Real-Time Drawing: A Designer's Guide. McGraw- Hill International (UK) Ltd.]]",
      "doi": ""
    },
    {
      "text": "Greenberg, S., Gutwin, C. and Cockburn, A. (1996). Using Distortion-Oriented Displays to Support Workspace Awareness. In People and Computers XI, Proceedings of HCI'96, Springer-Verlag London, UK. 299- 314.]] ",
      "doi": "10.5555/646683.759481"
    },
    {
      "text": "Grudin, J. (1990). The Computer Reaches Out: The Historical Continuity of Interface Design. In Proc. A CM Conference on Human Factors in Computing Systems, CHI'90, ACM, NY, 261-268.]]  ",
      "doi": "10.1145/97243.97284"
    },
    {
      "text": "Harper, R. and Sellen, A. (1995). Collaborative Tools and the Practicalities of Professional Work at the International Monetary Fund. In Proc. A CM Conference on Human Factors in Computing Systems, CHI'95, ACM, NY. 122-129.]]  ",
      "doi": "10.1145/223904.223920"
    },
    {
      "text": "Heath, C., Jirotka, M., Luff, P. and Hindmarsh, J. (1995). Unpacking Collaboration: the Interactional Organization of Trading in a City Dealing Room. Computer-Supported Cooperative Work, 3(2), 147-165.]]  ",
      "doi": "10.1007/BF00773445"
    },
    {
      "text": "Hewson, R. (1995). Marking and Making: A Characterisation of Sketching for Typographic Design. Doctoral Thesis. Open University, UK.]]",
      "doi": ""
    },
    {
      "text": "Hutchins E. (1990). The Technology of Team Navigation. in Galagher, J., Kraut, R. and Edigo, C. (Eds.) Intellectual Teamwork: Social and Technological Foundations of Cooperative Work. Lawrence Earlbaum Associates, Hillsdale, NJ, 1990.]] ",
      "doi": "10.5555/117848.117856"
    },
    {
      "text": "Kristoffersen, S. and Rodden, T. (1996). Working by Walking Around - Requirements of Flexible Interaction Management in Video-supported Collaborative Work. In People and Computers XI, Proceedings of HCI'96. Springer-Verlag London, UK. 315-329]] ",
      "doi": "10.5555/646683.702486"
    },
    {
      "text": "Lamping, J. and Rao, R. (1996). Visualizing Large Trees Using the Hyperbolic Browser. In A CM Conference on Human Factors in Computing Systems, CHI'96 Conference Companion, ACM, NY. 388-389.]]  ",
      "doi": "10.1145/257089.257389"
    },
    {
      "text": "Microsoft Windows CE, http://www.microsoft.com/ windowsce/default.asp.]]",
      "doi": ""
    },
    {
      "text": "Minneman, S. and Bly, S. (1991). Managing a Trois: A Study of a Multi-user Drawing Tool in Distributed Design Work. In Proc. A CM Conference on Human Factors in Computing Systems, CHI'91. ACM, NY, 217-224.]]  ",
      "doi": "10.1145/108844.108893"
    },
    {
      "text": "Minneman, S. and Harrison, S. (1996). Negotiating Right Along: An Extended Case Study of the Social Activity of Engineering Design. In Proc. 1st International Engineering Design Debate, EDD'96, Glasgow, September, 1996, 16-29.]]",
      "doi": ""
    },
    {
      "text": "Newman, W. and Wellner, P. (1992). A Desk Supporting Computer-based Interaction with Paper Documents. In Proc. A CM Conference on Human Factors in Computing Systems, CH1'92, ACM Press: NY, 587-592.]]  ",
      "doi": "10.1145/142750.143007"
    },
    {
      "text": "Rogers, Y. (1994) Coordinating Computer-mediated Work. Computer-Supported Cooperative Work, 1 (4), 295-316.]]",
      "doi": ""
    },
    {
      "text": "Rouncefield, M., Hughes, J., Rodden, T. and Viller, S. (1994). Working with Constant Interruption: CSCW and the Small Office. In Proc. A CM Conference on Computer Supported Cooperative Work, CSCW'94, ACM, NY, 275 - 286.]]  ",
      "doi": "10.1145/192844.193028"
    },
    {
      "text": "Staples, L. (1993). Representation in Virtual Space: Visual Convention in the Graphical User Interface. In Proc. Human Factors in Computing Systems, INTER- CHI'93, ACM NY, 348-354.]]  ",
      "doi": "10.1145/169059.169279"
    },
    {
      "text": "Suchman, L. (1993). Technologies of Accountability. In Button (Ed.) Technology in Working Order: Studies of Work, Interaction and Technology. Roufledge, UK. 113- 126.]]",
      "doi": ""
    },
    {
      "text": "Sumner, T. (1995). The High-Tech Toolbet: A Study of Designers in the Workplace. in Proc. ACM Conference on Human Factors in Computing Systems, CH1'95, ACM, NY, 178-185.]]  ",
      "doi": "10.1145/223904.223927"
    },
    {
      "text": "Tway, L. (1995). Multimedia in Action.t AP Professional, Boston.]] ",
      "doi": "10.5555/207584"
    },
    {
      "text": "Weber, K. (1994). Marquee: A Tool for Real-Time Video Logging. In Proc. A CM Conference on Human Factors in Computing Systems, CHI'94, ACM, NY, 58- 64.]]  ",
      "doi": "10.1145/191666.191697"
    },
    {
      "text": "Whittaker, S., and Schwarz, H. (1995). Back to the Future: Pen and Paper Technology Supports Complex Group Coordination. In Proc. A CM Conference on Human Factors in Computing Systems, CHI'95, ACM, NY, 495-502.]]  ",
      "doi": "10.1145/223904.223971"
    }
  ]
}