{
  "doi": "10.1145/258549.258721",
  "title": "Does continuous visual feedback aid debugging in direct-manipulation programming systems?",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "258-265",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "E. M. Wilcox",
      "institution": "Dept. of Computer Science, Oregon State University, Corvallis, OR and Timberline Software, 9600 S.W. Nimbus Ave., Beaverton, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81451595107",
      "orcid": "missing"
    },
    {
      "name": "John W. Atwood",
      "institution": "Dept. of Computer Science, Oregon State University, Corvallis, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100028099",
      "orcid": "missing"
    },
    {
      "name": "Margaret M. Burnett",
      "institution": "Dept. of Computer Science, Oregon State University, Corvallis, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337865",
      "orcid": "missing"
    },
    {
      "name": "Jonathan J. Cadiz",
      "institution": "Dept. of Computer Science, Oregon State University, Corvallis, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100025872",
      "orcid": "missing"
    },
    {
      "name": "Curtis R. Cook",
      "institution": "Dept. of Computer Science, Oregon State University, Corvallis, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452601376",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Atwood, J., Burnett, M., Walpole, R., Wilcox, E. and Yang, S. Steering Programs Via Time Travel, 1996 IEEE Symp. Visual Languages, Boulder, CO, Sept. 3- 6, 1996, 4-11. ",
      "doi": "10.5555/832277.834339"
    },
    {
      "text": "Brown, P. and Gould, J. Experimental Study of People Creating Spreadsheets. A CM Transactions on Office Information Systems 5, 1987, 258-272.  ",
      "doi": "10.1145/27641.28058"
    },
    {
      "text": "Burnett, M. and Ambler, A. Interactive Visual Data Abstraction in a Declarative Visual Programming Language. Journal of Visual Languages and Computing 5(1), Mar. 1994, 29-60.",
      "doi": ""
    },
    {
      "text": "Cypher, A. (ed.) Watch What I Do: Programming by Demonstration, MIT Press, Cambridge, MA, 1993. ",
      "doi": "10.5555/168080"
    },
    {
      "text": "Eisenstadt, M. Why HyperTalk Debugging Is More ainful Than It Ought To Be. HCI'93 Conference, pub. as People and Computers VIII, Cambridge University Press, Cambridge, UK, 1993, 443-462.",
      "doi": ""
    },
    {
      "text": "Eisenstadt, M. Tales of Debugging from the Front Lines. Proc. Empirical Studies of Programmers, Ablex Publishing, Norwood, NJ, 1993, 86-112.",
      "doi": ""
    },
    {
      "text": "Gilmore, D. Interface Design: Have We Got It Wrong? INTERACT '95, (K. Nordby, D. Gilmore, and S. Arnesen, eds.), Chapman &amp; Hall, London, England, 1995.",
      "doi": ""
    },
    {
      "text": "Green, T. and Petre, M. Usability Analysis of Visual Programming Environments' A 'Cognitive Dimensions' Framework. Journal of Visual Languages and Computing 7(2), Jun. 1996, 131-174.",
      "doi": ""
    },
    {
      "text": "Gugerty, L. and Olson, G. Comprehension Differences in Debugging by Skilled and Novice Programmers. Proc. Empirical Studies of Programmers, (E. Soloway and S. Iyengar, eds.), Ablex Publishing: Norwood, NJ, 1986, 13-27. ",
      "doi": "10.5555/21842.28883"
    },
    {
      "text": "Lawrence, A., Badre, A. and Stasko, J. Empirically Evaluating the Use of Animations to Teach Algorithms. 1994 IEEE Syrup. Visual Languages, St. Louis, MO, Oct. 4-7, 1994, 48-54.",
      "doi": ""
    },
    {
      "text": "Martin, G. and Corl, K. System Response Time Effects on User Productivity. Behaviour and Information Technology 5(1 ), 1986, 3-13.",
      "doi": ""
    },
    {
      "text": "Nanja, M. and Cook, C. An Analysis of the On-line Debugging Process. Proc. Empirical Studies of Programmers, (G. M. Olson, S. Sheppard, and E. Soloway, eds.), Ablex Publishing, Norwood, NJ, 1987, 172-184. ",
      "doi": "10.5555/54968.54979"
    },
    {
      "text": "Nardi, B. and Miller, J. Twinkling Lights and Nested Loops: Distributed Problem Solving and Spreadsheet Development. International Journal of Man-Machine Studies 34, 1991, 161-194.  ",
      "doi": "10.1016/0020-7373%2891%2990040-E"
    },
    {
      "text": "O'Hara, K. Cost of Operations Affects Planfulness of Problem-Solving Behaviour. CHI '94 Conf. Companion, Boston, MA, Apr. 24-28, 1994, 105-106.  ",
      "doi": "10.1145/259963.260083"
    },
    {
      "text": "Oman, P., Cook, C. and Nanja, M. Effects of Programming Experience in Debugging Semantic Errors. Journal of Systems and Software 9, 1989, 197- 207.  ",
      "doi": "10.1016/0164-1212%2889%2990040-X"
    },
    {
      "text": "Shneiderman, B. Designing the User Interface: Strategies for Effective Human-Computer Interaction, Addison-Wesley, Reading, MA, 1992. ",
      "doi": "10.5555/129385"
    },
    {
      "text": "Svendsen, G. The Influence of Interface Style on Problem-Solving. International Journal of Man- Machine Studies 35, 1991, 379-397.  ",
      "doi": "10.1016/S0020-7373%2805%2980134-8"
    },
    {
      "text": "Tanimoto, S. VIVA: A Visual Language for Image Processing. Journal of Visual Languages and Computing 2(2), Jun. 1990, 127-139.",
      "doi": "10.1016/S1045-926X%2805%2980012-6"
    },
    {
      "text": "Whitley, K. Visual Programming Languages and the Empirical Evidence For and Against. Journal of Visual Languages and Computing, 1997 (to appear).",
      "doi": ""
    },
    {
      "text": "Wilcox, E., Atwood, J., Burnett, M., Cadiz, J., and Cook, C. Does Continuous Visual Feedback Aid Debugging in Direct-Manipulation Programming Systems? An Empirical Study. TR 96-60-9, Oregon State University, Dept. of Computer Science, (303 Dearborn, Corvallis, OR 97331 USA), Aug. 1996.",
      "doi": ""
    }
  ]
}