{
  "doi": "10.1145/258549.258702",
  "title": "Dynamic Soundscape: mapping time to space for audio browsing",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "194-201",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Minoru Kobayashi",
      "institution": "Speech Interface Group, MIT Media Laboratory, E15-252, 20 Ames St., Cambridge, MA and NTT Human Interface Laboratories, 1-2356 Take, Yokosuka, Kanagawa 238-03 Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100604089",
      "orcid": "missing"
    },
    {
      "name": "Chris Schmandt",
      "institution": "Speech Interface Group, MIT Media Laboratory, E15-252, 20 Ames St., Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100444749",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arons, B., A Review of the Cocktail Party Effect. Journal of the American Voice I/0 Society. 1992.",
      "doi": ""
    },
    {
      "text": "Arons, B., SpeechSkimmer: Interactively Skimming Recorded Speech, procs, of UIST '93, 1993.  ",
      "doi": "10.1145/168642.168661"
    },
    {
      "text": "Cherry, E. C., Some experiments on the recognition of speech, with one and two ears, Journal of the Acoustic Society of America, Volume 25 1953.",
      "doi": ""
    },
    {
      "text": "Cohen, M. and Ludwig, F. L., Multidimensional Audio Window Management, International Journal of Man- Machine Studies, Vol. 34, Academic Press. 1991  ",
      "doi": "10.1016/0020-7373%2891%2990023-Z"
    },
    {
      "text": "Hudson, S. E. and Smith, I., Electronic Mail Previews Using Non-Speech Audio, procs, of CHI 96, ACM. 1996.  ",
      "doi": "10.1145/257089.257299"
    },
    {
      "text": "King, W. J. and Weghorst, S. J., Ear Tracking: Visualizing Auditory Localization Strategies, procs, of CH195. ACM. 1995.  ",
      "doi": "10.1145/223355.223531"
    },
    {
      "text": "Loomis, J. M., Hebert, C., ChcineUi, J. G., Active localization of virtual sounds, Journal of Acoustical Society of America. 1990.",
      "doi": ""
    },
    {
      "text": "Mandler, J. M, Seegmiller, D. and Day, J., On the coding of spatial information, Memory &amp; Cognition 1977, Vol. 5. 1977.",
      "doi": ""
    },
    {
      "text": "Pitt, i. J. and Edwards, A. D. N., Pointing in an Auditory Interface for Blind Users, procs, of the 1995 IEEE International Conference on Systems, Man and Cybernetics, IEEE. 1995",
      "doi": ""
    },
    {
      "text": "Roy, D. K., NewsComm: A Hand-Held Device for Interactive Access to Structured Audio, procs, of CH196. ACM. 1996.  ",
      "doi": "10.1145/238386.238471"
    },
    {
      "text": "Schmandt, C., Mullins, A., AudioStreamer: Exploiting Simultaneity for Listening, procs, of CHI 95. ACM. 1995.  ",
      "doi": "10.1145/223355.223533"
    },
    {
      "text": "Schulman, A. I., Recognition memory and the recall of spatial location, Memory &amp; Cognition 1973, Vol. 1, No. 3.",
      "doi": ""
    },
    {
      "text": "Seligmann, D. D., Mercuri, R. T. and Edmark, J. T., Providing Assurances in a Multimedia Interactive Environment, procs, of CHI 95, ACM. 1995  ",
      "doi": "10.1145/223904.223936"
    },
    {
      "text": "Stifelman, L.J., Augmenting Real-World Objects: A Paper-Based Audio Notebook, a short paper in CHI 96, ACM. 1996.  ",
      "doi": "10.1145/257089.257279"
    },
    {
      "text": "Thurlow W. R., Mangels, j. W., and Runge, P. S., Head Movements During Sound Localization, Journal of the Acoustical Society of America, 1967.",
      "doi": ""
    },
    {
      "text": "Whittaker, S., Hyland, P. and Wiley M., Filochat: Handwritten Notes Provide Access To Rec, ord~ Conversations, procs, of CHI 94, ACM. 1994.  ",
      "doi": "10.1145/259963.260380"
    },
    {
      "text": "Yates, F. A., The Art of Memory, Routledge &amp; Kegan Paul. 1966.",
      "doi": ""
    },
    {
      "text": "Zimmerman, T. G., Smith, J. R., Paradiso, J. A., Allport, D. and Gershenfeld, N., Applying Electric Field Sensing to Human-Computer Interfaces, procs, of CHI 95, ACM. 1995.  ",
      "doi": "10.1145/223904.223940"
    }
  ]
}