{
  "doi": "10.1145/258549.259026",
  "title": "A factor analysis of user cognition and emotion",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "546-547",
  "year": 1997,
  "badges": [],
  "abstract": "No abstract available.",
  "tags": [
    "emotion",
    "cognition",
    "factor analysis",
    "human-computer interaction"
  ],
  "authors": [
    {
      "name": "Judith Ramsay",
      "institution": "The Center for People and Systems Interaction, South Bank University, 103 Borough Rd., London, England",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100515098",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Henderson, R. D., Deane, F. P. and Ward, M. J. (1995) Occupational Differences in Computer-related Anxiety; Implications for the Implementation of a Computerized Patient Management Information System Behaviour and Information Technology, 14, (1), 23-31.",
      "doi": ""
    },
    {
      "text": "Harrington, K. V., McElroy, J. C. and Morrow, P. C. (1990) Computer Anxiety and Computer-based Training: A Laboratory Experiment Journal of Educational Computing Research, 6, (3), 343-358.",
      "doi": ""
    },
    {
      "text": "Logan, R. J. (1994) Behavioural and Emotional Usability. In M. Wiklund (ed) Usability in Practice Cambridge, Ma. Academic Press. ",
      "doi": "10.5555/180981.180984"
    },
    {
      "text": "Raub, A. C. (1982) Correlates of Computer Anxiety in College Students Dissertation Abstracts International, Howard, G. and Smith, R. Computer Anxiety in Management: Myth or Reality? Communications of the ACM, 29, 611-615.  ",
      "doi": "10.1145/6138.6143"
    },
    {
      "text": "Clark, D. M. and Teasdale, J. D. (1982) Diurnal variation in clinical depression and accessibility of memories of positive and negative experiences. Journal of Abnormal Psychology, 91, 87-95.",
      "doi": ""
    },
    {
      "text": "Nelson, R. E. (1977) Irrational Beliefs in Depression. Journal of Consulting and Clinical Psychology, 45, 1190- 1191.",
      "doi": ""
    },
    {
      "text": "Seligman, M. E. P., Abramson, L. Y., Semmel, A. and von Bayer, C. (1979) Depressive attributional style. Journal of Abnormal Psychology, 88, 242-247.",
      "doi": ""
    },
    {
      "text": "Hollon, S. D. and Kendall, P. C. (1980) Cognitive selfstatements in depression. Development of an automatic thoughts questionnaire. Cognitive Therapy and Research, 4, 383-395.",
      "doi": ""
    },
    {
      "text": "Sarason, I. (1975) Anxiety and self-preoccupation. In I. Sarason and C. Spielberger (Eds.), Stress and Anxiety (Vol 2). Washington DC: Hemisphere Press.",
      "doi": ""
    }
  ]
}