{
  "doi": "10.1145/258549.258563",
  "title": "SenseMaker: an information-exploration interface supporting the contextual evolution of a user's interests",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "11-18",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "tags": [
    "information retrieval",
    "information seeking",
    "digital libraries",
    "information exploration"
  ],
  "authors": [
    {
      "name": "Michelle Q. Wang Baldonado",
      "institution": "Gates 3B, Computer Science Department, Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100182418",
      "orcid": "missing"
    },
    {
      "name": "Terry Winograd",
      "institution": "Gates 3B, Computer Science Department, Stanford University, Stanford, CA",
      "img": "/do/10.1145/contrib-81100454567/rel-imgonly/81100454567.jpg",
      "acmid": "81100454567",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bates, M.J. The design of browsing and berrypicking techniques for the online search interface. Online Review 13, 5 (October 1989), 407-24.",
      "doi": ""
    },
    {
      "text": "Belkin, N., Cool, C., Stein, A., and Thiel, U. Cases, scripts, and information-seeking strategies: on the design of interactive information retrieval systems. Expert Systems with Applications 9, 3 (1995), 379-395.",
      "doi": ""
    },
    {
      "text": "Chang, K., Garcia-Molina, H., and Paepcke, A. Boolean query mapping across heterogeneous information sources. IEEE Transactions on Knowledge and Database Engineering 8, 4 (August 1996), 515-521.  ",
      "doi": "10.1109/69.536244"
    },
    {
      "text": "Goldstein, J., and Roth, S. Using aggregation and dynamic queries for exploring large data sets, in Proceedings of CHI '94 (Boston MA, April 1994), ACM Press, 23-29.  ",
      "doi": "10.1145/191666.191682"
    },
    {
      "text": "Koenemann, J., and Belkin, N. A case for interaction: a study of interactive information retrieval behavior and effectiveness, in Proceedings of CHI '96 (Vancouver Canada, May 1996), ACM Press, 205-12.  ",
      "doi": "10.1145/238386.238487"
    },
    {
      "text": "Levy, D. What do you see and what do you get? Document identity and electronic media, in Screening Words: User Interfaces for Text, Proceedings of the Eighth Annual Conference of the UV Centre for the New OED and Text Research (Waterloo Canada, 1992), 109-117.",
      "doi": ""
    },
    {
      "text": "Mackinlay, J.D., Rao, R., and Card, S. An organic user interface for searching citation links, in Proceedings of CHI '95 (Denver CO, May 1995), ACM Press, 67-73.  ",
      "doi": "10.1145/223904.223913"
    },
    {
      "text": "Mann, T. Library Research Models: A Guide to Classification, Cataloging, and Computers. Oxford University Press, New York, 1993.",
      "doi": ""
    },
    {
      "text": "O'Day, V., and Jeffries, R. Orienteering in an information landscape: how information seekers get from here to there, in Proceedings of INTERCHI '93 (Amsterdam, April 1993), ACM Press, 438-445.  ",
      "doi": "10.1145/169059.169365"
    },
    {
      "text": "Paepcke, A., Cousins, S., Garcia-Molina, H., Hassan, S., Ketchpel, S., R6scheisen, M., and Winograd, T. Using distributed objects for digital library interoperability. IEEE Computer Magazine 29, 5 (May 1996), 61-68.  ",
      "doi": "10.1109/2.493458"
    },
    {
      "text": "Pirolli, P., and Card, S. Information foraging in information access environments, in Proceedings of CHI '95 (Denver CO, May 1995), ACM Press, 51-58.  ",
      "doi": "10.1145/223904.223911"
    },
    {
      "text": "Pirolli, P., Schank, P., Hearst, M., and Diehl, C. Scatter/ Gather browsing communicates the topic structure of a very large text collection, in Proceedings of CHI '96 (Vancouver Canada, May 1996), ACM Press, 213-20.  ",
      "doi": "10.1145/238386.238489"
    },
    {
      "text": "Sawyer, P., and Mariani, J. Database systems: challenges and opportunities for graphical HCI. Interacting with Computers 7, 3 (1995), 273-303.",
      "doi": ""
    },
    {
      "text": "Selberg, E., and Etzioni, O. Multi-service search and comparison using the MetaCrawler, in Proceedings of the Fourth International World W'ute Web Conference (Boston MA, December 1995), &lt;URL: http:// www. w 3. org/pub/C o nfere n ce s/WWW4/Papers/169/>.",
      "doi": ""
    },
    {
      "text": "Wake, W., and Fox, E. SortTables: A browser for a digital library, in Proceedings of the Fourth International Conference on Information and Knowledge Management (Baltimore MD, December 1995), 175-81.  ",
      "doi": "10.1145/221270.221562"
    }
  ]
}