{
  "doi": "10.1145/258549.258571",
  "title": "Cooperative bimanual action",
  "published": "1997-03-27",
  "proctitle": "CHI '97: Proceedings of the ACM SIGCHI Conference on Human factors in computing systems",
  "pages": "27-34",
  "year": 1997,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Ken Hinckley",
      "institution": "Department of Computer Science and Neurosurgery, University of Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Randy Pausch",
      "institution": "Department of Computer Science, University of Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100493478",
      "orcid": "missing"
    },
    {
      "name": "Dennis Proffitt",
      "institution": "Department of Psychology, University of Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100051854",
      "orcid": "missing"
    },
    {
      "name": "James Patten",
      "institution": "Department of Computer Science, University of Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100339352",
      "orcid": "missing"
    },
    {
      "name": "Neal Kassell",
      "institution": "Department of Neurosurgery, University of Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100259021",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abel, K., Alic, M., Mosheil, J. M. The Polyshop project, information available on the Web at: www.vsl.ist.ucf.edu/--.polyshop/polyshop.html",
      "doi": ""
    },
    {
      "text": "Annett, J., Annett, M., Hudson, P., Turner, A., \"The Control of Movement in the Preferred and Non- Preferred Hands,\" Q. J. Exp. Psych., 31, 641-652.",
      "doi": ""
    },
    {
      "text": "Bier, E., Stone, M., Pier, K., Buxton, W., DeRose, T., \"Toolglass and Magic Lenses: The See-Through Interface,\" SIGGRAPH '93, pp. 73-80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Bolt, R. A., Herranz, E., \"Two-Handed Gesture in Multi-Modal Natural Dialog,\" UIST '92, pp. 7-13.  ",
      "doi": "10.1145/142621.142623"
    },
    {
      "text": "Buxton, W., Myers, B., \"A Study in Two-Handed Input,\" Proc. CHI'86, pp. 321-326.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "Buxton, W., \"Touch, Gesture, and Marking,\" in Readings in Human-Computer Interaction: Toward the Year 2000, Morgan Kaufmann Publishers, 1995. ",
      "doi": "10.5555/212925.212968"
    },
    {
      "text": "Cremer, M., Ashton, R., \"Motor performance and concurrent cognitive tasks\", J. Motor Behavior, 13, pp. 187-196, 1981",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G., Ishii, H., Buxton, W., \"Bricks: Laying the Foundations for Graspable User Interfaces,\" Proc. CHI'95, pp. 442-449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Guiard, Y., \"Asymmetric Division of Labor in Human Skilled Bimanual Action: The Kinematic Chain as a Model,\" J. Motor Behavior, 19 (4), 1987, pp. 486-517.",
      "doi": ""
    },
    {
      "text": "Guiard, Y., \"Failure to Sing the Left-Hand Part of the Score during Piano Performance,\" J. Music Perception, 6 (3), 1989, pp. 299-314.",
      "doi": ""
    },
    {
      "text": "Guiard, Y., T. Ferrand, T., \"Asymmetry in B imanual Skills,\" in Manual asymmetries in motor performance, Elliott &amp; Roy, eds. Boca Raton, FL: CRC Press, 1995.",
      "doi": ""
    },
    {
      "text": "Halpern, D., Sex differences in cognitive ability. Lawrence Erlbaum Associates, 1992.",
      "doi": ""
    },
    {
      "text": "Hauptmann, A. G., \"Speech and Gestures for Graphic image Manipulation,\" CHI'89, pp. 241-245.  ",
      "doi": "10.1145/67449.67496"
    },
    {
      "text": "Hinckley, K., Pausch, R, Goble, J., KasseU, N., \"Passive Real-World Interface Props for Neurosurgical Visualization,\" CHI'94, pp. 452-458.  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Hinckley, Pausch, Goble, Kassell, \"A Survey of Design issues in Spatial Input,\" UIST'94, pp. 213-222.  ",
      "doi": "10.1145/192426.192501"
    },
    {
      "text": "Hinckley, K., Pausch, R., Proffitt, D., Kassell, N., \"Attention and Visual Feedback: The Bimanual Frame-of-Reference,\" ACM SIGGRAPH 1997 Symposium on Interactive 3D Graphics, to appear.  ",
      "doi": "10.1145/253284.253318"
    },
    {
      "text": "Hinckley, K. Haptic Issues for Virtual Manipulation, Ph.D. dissertation, University of Virginia, Dept. of Computer Science, December 1996. ",
      "doi": "10.5555/269527"
    },
    {
      "text": "Kabbash, P., MacKenzie, I. S., Buxton, W., \"Human Performance Using Computer Input Devices in the Preferred and Non-Preferred Hands\" CHI'93,474-481.  ",
      "doi": "10.1145/169059.169414"
    },
    {
      "text": "Kabbash, P., Buxton, W., Sellen, A., \"Two-Handed Input in a Compound Task,\" CHI'94, pp. 417-423.  ",
      "doi": "10.1145/191666.191808"
    },
    {
      "text": "Kelso, J., Southard, D., Goodman, D., \"On the Coordination of Two-Handed Movements,\" Journal of Experimental Psychology: Human Perception and Performance, 5 (2), 1979, pp. 229-238.",
      "doi": ""
    },
    {
      "text": "Leganchuk, A., Zhai, S. Buxton, W., \"Bimanual direct manipulation in area sweeping tasks,\" 1995. Web: www.dgp.toronto.edu/people/andrea/bimanual.html",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., \"Fitts' law as a research and design tool in human-computer interaction,\" Human- Computer Interaction, 7, pp. 91-139, 1992.",
      "doi": "10.1207/s15327051hci0701_3"
    },
    {
      "text": "Marteniuk, R., MacKenzie, C., Baba, D., \"Bimanual movement control: Information Processing and interaction effects,\" Q. J. Exp. Psych., 36A, 335-365.",
      "doi": ""
    },
    {
      "text": "Multigen Inc., http://www.multigen.com/smart.htm",
      "doi": ""
    },
    {
      "text": "Oldfield, R., \"The assessment and analysis of handedness: The Edinburgh inventory,\" Neuropsychologia, 9, pp. 97- I 13, 1971.",
      "doi": ""
    },
    {
      "text": "Peters, M., \"Constraints in the performance of bimanual tasks and their expression in unskilled and skilled subjects,\" Q. J. Exp. Psych., 37A, pp. 171-196.",
      "doi": ""
    },
    {
      "text": "Poston, T., Serra, L., \"Dextrous Virtual Work,\" Communications of the ACM, 39 (5), pp. 37-45, 1996.  ",
      "doi": "10.1145/229459.229464"
    },
    {
      "text": "Provins, K., Glencross, D., \"Handwriting, typewriting and handedness,\" Q. J. Exp. Psych., 20, pp. 282-289.",
      "doi": ""
    },
    {
      "text": "Sachs, E., Roberts, A., Stoops, D., \"3-Draw: A Tool for Designing 3D Shapes,\" IEEE CG&amp;A, Nov. 1991.  ",
      "doi": "10.1109/38.103389"
    },
    {
      "text": "SensAble Devices, Inc., The PHANTOM Haptic Interface. URL: http://www/tiac.net/users/sensable/",
      "doi": ""
    },
    {
      "text": "Shaw, C., Green, M., \"Two-Handed Polygonal Surface Design,\" Proc. UIST'94, pp. 205-212.  ",
      "doi": "10.1145/192426.197517"
    },
    {
      "text": "Stassen, H., Smets, G., \"Telemanipulation and Telepresence,\" 6th Symp. on Analysis, Design, and Evaluation of Man-machine Systems, 1995, pp. 13-23.",
      "doi": ""
    },
    {
      "text": "Stoakley, Conway, Pausch, \"Virtual Reality on a WIM: Interactive Worlds in Miniature,\" CHI'95.  ",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Wing, A., \"Timing and co-ordination of repetitive bimanual movements,\" Quarterly. J. Exp. Psych., 34A, pp. 339-348, 1982.",
      "doi": ""
    },
    {
      "text": "Wolff, P., Hurwitz, I., Moss, H., \"Serial organization of motor skills in left- and right-handed adults,\" Neuropsychologia, 15, pp. 539-546, 1977.",
      "doi": ""
    }
  ]
}