{
  "doi": "10.1145/1124772.1124825",
  "title": "symSpline: symmetric two-handed spline manipulation",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "349-358",
  "year": 2006,
  "badges": [],
  "abstract": "We introduce symSpline: a symmetric, dual-mouse technique for the manipulation of spline curves. In symSpline, two cursors control the positions of the ends of the tangent to an edit point. By moving the tangent with both mice, the tangent and the edit point can be translated while the curvature of the spline is adjusted simultaneously, according to the length and angle of the tangent. We compare the symSpline technique to two asymmetric dual-mouse spline manipulation techniques and to a standard single-mouse technique. In a spline matching experiment, symSpline outperformed the two asymmetric dual-mouse techniques and all three dual-mouse techniques proved to be faster than the single-mouse technique. Additionally, symSpline was the technique most preferred by test participants.",
  "tags": [
    "splines",
    "symmetric interaction",
    "two-handed interaction",
    "spline manipulation"
  ],
  "authors": [
    {
      "name": "Celine Latulipe",
      "institution": "University of Waterloo",
      "img": "/do/10.1145/contrib-81100323202/rel-imgonly/celine-1657_sm.jpg",
      "acmid": "81100323202",
      "orcid": "missing"
    },
    {
      "name": "Stephen Mann",
      "institution": "University of Waterloo",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484965",
      "orcid": "missing"
    },
    {
      "name": "Craig S. Kaplan",
      "institution": "University of Waterloo",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100155157",
      "orcid": "missing"
    },
    {
      "name": "Charlie L. A. Clarke",
      "institution": "University of Waterloo",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100390699",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Seok-Hyung Bae, Takahiro Kobayashi, Ryugo Kijima, and Won-Sup Kim. Tangible NURBS-curve manipulation techniques using graspable handles on a large display. In UIST 2004 Proceedings, 2004.  ",
      "doi": "10.1145/1029632.1029646"
    },
    {
      "text": "Ravin Balakrishnan, George Fitzmaurice, Gordon Kurtenbach, and William Buxton. Digital tape drawing. In UIST'99 Proceedings, 1999.  ",
      "doi": "10.1145/320719.322598"
    },
    {
      "text": "Ravin Balakrishnan and Ken Hinckley. Symmetric bimanual interaction. In CHI 2000 Proceedings, 2000.  ",
      "doi": "10.1145/332040.332404"
    },
    {
      "text": "Richard Bartels and John Beatty. A technique for the direct manipulation of spline curves. In Graphics Interface 1989 Proceedings, 1989.",
      "doi": ""
    },
    {
      "text": "Richard Bartels, John Beatty, Kellogg Booth, Eric Bosch, and Pierre Jolicoeur. Experimental comparison of splines using the shape-matching paradigm. ACM Transactions on Graphics, 12(3):179--208, 1993.  ",
      "doi": "10.1145/169711.169709"
    },
    {
      "text": "Didier Casalta, Yves Guiard, and Michel Beaudouin-Lafon. Evaluating two-handed input techniques: Rectangle editing and navigation. ACM CHI'99 Conference (Extended Abstracts), pages 236--237, 1999.  ",
      "doi": "10.1145/632716.632862"
    },
    {
      "text": "Jorn Diedrichsen, Richard B. Ivry, Eliot Hazeltine, Steven Kennerley, and Asher Cohen. Bimanual interference associated with the selection of target locations. Journal of Experimental Psychology: Human Perception and Performance, 29(1):64--77, 2003.",
      "doi": ""
    },
    {
      "text": "Adam Finkelstein and David H. Salesin. Multiresolution curves. Computer Graphics, 28(Annual Conference Series):261--268, 1994.  ",
      "doi": "10.1145/192161.192223"
    },
    {
      "text": "P.M. Fitts and R.L. Deininger. S-R compatibility: Correspondance among paired elements within stimulus and response codes. Journal of Experimental Psychology: Human Perception and Performance, 48:483--492, 1954.",
      "doi": ""
    },
    {
      "text": "George Fitzmaurice, Hiroshi Ishii, and William Buxton. Bricks: Laying the foundations for graspable user interfaces. In CHI'95 Proceedings, 1995.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Barry Fowler. Geometric techniques for interactive curve design. Master's thesis, University of Waterloo, 1990.",
      "doi": ""
    },
    {
      "text": "Barry Fowler. Geometric manipulation of tensor product surfaces. In SI3D '92: Proceedings of the 1992 symposium on Interactive 3D graphics, pages 101--108, New York, NY, USA, 1992. ACM Press.  ",
      "doi": "10.1145/147156.147172"
    },
    {
      "text": "Barry Fowler and Richard Bartels. Constraint-based curve manipulation. IEEE Computer Graphics and Motor Behaviour, 33(1):103--112, 2001.",
      "doi": ""
    },
    {
      "text": "Yves Guiard. Asymmetric division of labour in human skilled bimanual action: The kinematic chain as a model. Journal of Motor Behaviour, pages 486--517, 1987.",
      "doi": ""
    },
    {
      "text": "Stanley Jang, Kellogg S. Booth, David R. Forsey, and Peter Graf. Investigating the effectiveness of direct manipulation of 3D B-spline curves using the shape-matching paradigm. In Graphics Interface 1993 Proceedings, 1993.",
      "doi": ""
    },
    {
      "text": "J.A.S. Kelso, Dan L. Southard, and David Goodman. On the coordination of two-handed movements. Journal of Experimental Psychology: Human Perception and Performance, 5(2):229--238, 1979.",
      "doi": ""
    },
    {
      "text": "Gordon Kurtenbach, George Fitzmaurice, Thomas Baudel, and Bill Buxton. The design of a GUI paradigm based on tablets, two-hands and transparency. In CHI'97 Proceedings, 1997.  ",
      "doi": "10.1145/258549.258574"
    },
    {
      "text": "Celine Latulipe. Symmetric interaction in the user interface. In Companion Proceedings of UIST 2004, pages 63--66, 2004.",
      "doi": ""
    },
    {
      "text": "Celine Latulipe, Craig S. Kaplan, and Charles L.A. Clarke. Simultaneous rotation and translation. In Proceedings of HCI 2005, Volume 2, 2005.",
      "doi": ""
    },
    {
      "text": "Celine Latulipe, Craig S. Kaplan, and Charles L.A. Clarke. Unimanual and bimanual image alignment: An evaluation of mouse-based techniques. In Proceedings of UIST 2005, 2005.  ",
      "doi": "10.1145/1095034.1095057"
    },
    {
      "text": "Andrea Leganchuk, Shumin Zhai, and William Buxton. Manual and cognitive benefits of two-handed input. ACM Transactions on Computer-Human Interaction, 5(4):326--359, 1998.  ",
      "doi": "10.1145/300520.300522"
    },
    {
      "text": "Ignacio Llamas, Byungmoon Kim, Joshua Gargus, Jarek Rossignac, and Chris D. Shaw. Twister: a space-warp operator for the two-handed editing of 3D shapes. ACM Trans. Graph., 22(3):663--668, 2003.  ",
      "doi": "10.1145/882262.882323"
    },
    {
      "text": "Franz Mechsner, Dirk Kerzel, Gunther Knoblich, and Wolfgang Prinz. Perceptual basis of bimanual coordination. Nature, 414:69--73, 2001.",
      "doi": ""
    },
    {
      "text": "R. Nicoletti and C. Umilta. Right-left prevalence in spatial compatibility. Perception and Psychopysics, 35:333--345, 1984.",
      "doi": ""
    },
    {
      "text": "Russell Owen, Gordon Kurtenbach, George Fitzmaurice, Thomas Baudel, and Bill Buxton. When it gets more difficult, use both hands - exploring bimanual curve manipulation. In GI 2005 Proceedings, 2005. ",
      "doi": "10.5555/1089508.1089512"
    },
    {
      "text": "Chris Shaw and Mark Green. THRED: A two-handed design system. Multimedia Systems, 5:126--139, 1997.  ",
      "doi": "10.1007/s005300050048"
    }
  ]
}