{
  "doi": "10.1145/1124772.1124903",
  "title": "Because I carry my cell phone anyway: functional location-based reminder applications",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "889-898",
  "year": 2006,
  "badges": [],
  "abstract": "Although they have potential, to date location-based information systems have not radically improved the way we interact with our surroundings. To study related issues, we developed a location-based reminder system, PlaceMail, and demonstrate its utility in supporting everyday tasks through a month-long field study. We identify current tools and practices people use to manage distributed tasks and note problems with current methods, including the common \"to-do list\". Our field study shows that PlaceMail supports useful location-based reminders and functional place-based lists. The study also sheds rich and surprising light on a new issue: when and where to deliver location-based information. The traditional 'geofence' radius around a place proves insufficient. Instead, effective delivery depends on people's movement patterns through an area and the geographic layout of the space. Our results both provide a compelling demonstration of the utility of location-based information and raise significant new challenges for location-based information distribution.",
  "authors": [
    {
      "name": "Pamela J. Ludford",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100575572",
      "orcid": "missing"
    },
    {
      "name": "Dan Frankowski",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100071523",
      "orcid": "missing"
    },
    {
      "name": "Ken Reily",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328490304",
      "orcid": "missing"
    },
    {
      "name": "Kurt Wilms",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481740",
      "orcid": "missing"
    },
    {
      "name": "Loren Terveen",
      "institution": "University of Minnesota, Minneapolis, MN",
      "img": "/do/10.1145/contrib-81100276946/rel-imgonly/my_mcknight_photo_2017.jpg",
      "acmid": "81100276946",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bellotti, V., Dalal, B., Good, N., Flynn, P., Bobrow, D., Ducheneaut, N. (2004). What a to-do: studies of task management toward the design of a personal task list manager. Proc. CHI, ACM Press. 735--742.]]  ",
      "doi": "10.1145/985692.985785"
    },
    {
      "text": "Bellotti, V., Smith, I. Informing the Design of an Information Management System with Interactive Fieldwork.(2000). Proc. DIS, ACM Press. 227--237.]]  ",
      "doi": "10.1145/347642.347728"
    },
    {
      "text": "Bergman, O., Boardman, R., Gwizdka, J., Jones, W. Personal Information Management. (2004). Proc. CHI, Special Interest Group. 1598--1599.]]  ",
      "doi": "10.1145/985921.986164"
    },
    {
      "text": "Boardman, R., Sasse, M. (2004). Stuff Goes into the Computer and Doesn't Come Out, A cross-tool Study of Personal Information Management. Proc. CHI, ACM Press, 583--590.]]  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Burrell, J., Gay, G. (2002). E-graffiti: evaluating real-world use of a context-aware system. Interacting with Computers 14, 301--312.]]",
      "doi": ""
    },
    {
      "text": "Dey, A., Abowd. G. (2002). CybreMinder: A context-aware system for supporting reminders. Proc. Symp. Handheld and Ubiquitous Computing, 172--186.]] ",
      "doi": "10.5555/647986.757284"
    },
    {
      "text": "Espinoza , F., Persson , P., Sandin , A., Nyström , H., Cacciatore , E., Bylund, M. (2001). GeoNotes: Social and Navigational Aspects of Location-Based Information Systems, Proc. Intl. Conf. on Ubiquitous Computing,. 2--17.]] ",
      "doi": "10.5555/647987.741330"
    },
    {
      "text": "Hudson, J.M., Christensen, J., Kellogg, W.A., Erickson, T. (2002). I'd be Overwhelmed, But It's Just One More Thing to Do: Availability and Interruption in Research Management, Proc. CHI, ACM Press. 97--104.]]  ",
      "doi": "10.1145/503376.503394"
    },
    {
      "text": "Jung, Y., Persson, P., Blom, J. (2005). Dede: Design and Evaluation of a Context-Enhanced Mobile Messaging System. Proc. CHI, ACM Press, 351--360.]]  ",
      "doi": "10.1145/1054972.1055021"
    },
    {
      "text": "Kim, S., Kim, M., Park, S., Jin, Y., Choi, W. (2004). Gate Reminder: A Design Case of a Smart Reminder. Proc. DIS, ACM Press. 81--90.]]  ",
      "doi": "10.1145/1013115.1013128"
    },
    {
      "text": "Klepis, N., Nelson, W., Ott, W., Robinson, J., Tsang, A., Switzer, P., Behar, J., Hern, S., Engelmann, W. (2001). The National Human Activity Pattern Survey, Journal of Exposure Analysis and Environmental Epidemiology, May-June 2001, v. 11, n. 3, 231--252.]]",
      "doi": ""
    },
    {
      "text": "Korpipaa, P., Hakkila, J., Kela, J., Ronakainen, S., Kansala, I. (2004). Utilising context ontology in mobile device application personalization. Proc. MUM, ACM Press. 133--140.]]  ",
      "doi": "10.1145/1052380.1052399"
    },
    {
      "text": "Lansdale, M. (1988). The Psychology of Information Management. Applied Ergonomics, 19, 55--66.]]",
      "doi": ""
    },
    {
      "text": "Marmasse, N., Schmandt, C. (2000). Location-Aware Information Delivery with comMotion. Intl. Symposium on Handheld and Ubiquitous Computing, 64--73.]] ",
      "doi": "10.5555/647986.741313"
    },
    {
      "text": "Paay, J., Kjeldskov, J. (2005). Understand and Modelling the Built Environment for Mobile Guide Interface Design. Behavior, Info. Technology. 24, 21--35.]]",
      "doi": ""
    },
    {
      "text": "Sohn, T., Li, K., Lee, G., Smith, I., Scott, J., Griswold, W. (2005). Place-Its: Location-Based Reminders on Mobile Phones. Proc. Intl. Conf. on Ubiquitous Computing, 232--250.]]  ",
      "doi": "10.1007/11551201_14"
    },
    {
      "text": "Taylor, S., Swan L. List making in the home. (2004). Proc. CSCW, ACM Press, 542--545.]]  ",
      "doi": "10.1145/1031607.1031697"
    },
    {
      "text": "Tamminen, S., Oulasvirta, A., Toiskallio, K., Kankainen, A. (2004). Understanding Mobile Contexts. Personal and Ubiquitous Computing, v.8,2, 135--143.]]  ",
      "doi": ""
    },
    {
      "text": "Zhou, C., Frankowski, D., Ludford, P., Terveen, L. (2005). An Experiment in Discovering Personally Meaningful Places from Location Data, Extended Abstracts, Proc. CHI, ACM Press, 2029--2032.]]  ",
      "doi": "10.1145/1056808.1057084"
    }
  ]
}