{
  "doi": "10.1145/1124772.1124798",
  "title": "Participatory design in emergency medical service: designing for future practice",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "161-170",
  "year": 2006,
  "badges": [],
  "abstract": "We describe our research-its approach, results and products-on Danish emergency medical service (EMS) field or \"pre-hospital\" work in minor and major incidents. We discuss how commitments to participatory design and attention to the qualitative differences between minor and major incidents address challenges identified by disaster sociolo-gists when designing for major incidents. Through qualitative research and participatory design, we have examined the features of EMS work and technology use in different emergency situations from the perspective of multiple actors. We conceptualize victims in incidents-and particularly in major incidents, where on-site medical as-sessments is highly incomplete-as boundary objects over which the complex and imperfect work of coordination is done. As an outcome of our participatory design approach, we describe a set of designs in support of future EMS work.",
  "authors": [
    {
      "name": "Margit Kristensen",
      "institution": "University of Aarhus, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311483791",
      "orcid": "missing"
    },
    {
      "name": "Morten Kyng",
      "institution": "University of Aarhus, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100435567",
      "orcid": "missing"
    },
    {
      "name": "Leysia Palen",
      "institution": "University of Aarhus, Aarhus, Denmark and University of Colorado, Boulder, CO",
      "img": "/do/10.1145/contrib-81100610626/rel-imgonly/image3.jpg",
      "acmid": "81100610626",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Artman, H., Waern, Y. Distributed cognition in an emergency Co-ordination Center. H. Artman (Ed). Fördelade kunskaps-processer i ledningscentraler vid nödsituationer: koordination och situationsmedvetenhet. Linköping, Tema Kommunikation, Linköping, Sweden, (1999), 183--199.]]",
      "doi": ""
    },
    {
      "text": "Berg, M. & Bowker, G. The Multiple Bodies of the Medical Record, Sociological Quarterly, 38(3), (1997), 513--537.]]",
      "doi": ""
    },
    {
      "text": "Bowers J. M. & Martin, D. Informing collaborative Informa-tion Visualization Through an ethnography of ambulance con-trol. Proc ECSCW, (1999), 309--330.]] ",
      "doi": "10.5555/351689.351707"
    },
    {
      "text": "Bowker, G. & Star, S. L. Sorting Things Out, Cambridge, MA: MIT Press, (1999).]]",
      "doi": ""
    },
    {
      "text": "Büscher, M., Eriksen, M., Kristensen, J., & Mogensen, P. Ways of grounding imagination. Proc. PDC, (2004), 193--203.]]  ",
      "doi": "10.1145/1011870.1011893"
    },
    {
      "text": "Bødker, S, Grønbæk, K, Kyng, M. Cooperative Design: Tech-niques and experiences from the Scandinavian Scene. A. Namioka & D. Schuler (Eds.), Participatory Design, Lawrence Erlbaum Associates (1993), 157--175.]]",
      "doi": ""
    },
    {
      "text": "Camp, P.J., Hudson, J.M., Keldorph, R.B., Lewis, S., Mynatt, E.D. Supporting Communication and Collaboration Practices in Safety-Critical Situations. Proc. of CHI, (2000), 249--250.]]  ",
      "doi": "10.1145/633292.633438"
    },
    {
      "text": "Ehn, P., Kyng, M. Cardboard Computers: Mocking-it-up or Hands-on the Future, J. Greenbaum & M. Kyng (Eds.). Design at Work: Cooperative Design of Computer Systems, Lawrence Erlbaum, Hillsdale, NJ, (1991), 169--195.]] ",
      "doi": "10.5555/125470.125488"
    },
    {
      "text": "Flowers, S. Software failure: management failure -- amazing stories and cautionary tales, John Wiley & Sons Ltd, (1996).]] ",
      "doi": "10.5555/261187"
    },
    {
      "text": "Greenbaum, J. Kyng, M. Situated Design. J. Greenbaum & M. Kyng (Eds.), Design at Work: Cooperative Design of Com-puter Systems, Lawrence Erlbaum, Hillsdale, NJ, (1991), 1--24.]] ",
      "doi": "10.5555/125470"
    },
    {
      "text": "Grønbæk, K. Kyng, M., Mogensen, P. Toward a Cooperative Experimental System Development Approach. M. Kyng & L. Mathiassen (Eds), Computers and Design in Context. The MIT Press, Cambridge, Masachusetts, (1997), 201--238.]] ",
      "doi": "10.5555/270318.270326"
    },
    {
      "text": "Guidelines 2000 for cardiopulmonary resuscitation and emergency cardiovascular care. http://circ.ahajournals.org/cgi/content/full/102/suppl_1/I-1]]",
      "doi": ""
    },
    {
      "text": "Heath, C.C. & Luff, P. Collaborative Activity and Technologi-cal Design: Task Coordination in London Underground Con-trol Rooms. Proc. ECSCW, (1991), 65--80.]] ",
      "doi": "10.5555/1241910.1241915"
    },
    {
      "text": "Holzman, T. G. Computer-human interface solutions for emergency medical care.Interactions 6(3), (1999), 13--24.]]  ",
      "doi": "10.1145/301153.301160"
    },
    {
      "text": "Hughes, J.A, Randall, D., Shapiro, D. Faltering from ethnog-raphy to design, Proc. CSCW, (1992), 115--122.]]  ",
      "doi": "10.1145/143457.143469"
    },
    {
      "text": "Jiang, X., Hong, J.I., Takayama, L.A., Landay, J.A. Ubi-coutous Computing for Firefighters: Field Studies and Proto-types of Large Displays for Incident Command. CHI Letters, 6(1), (2004), 679--686.]]  ",
      "doi": "10.1145/985692.985778"
    },
    {
      "text": "Johnson, C.W. Applying the Lessons of the Attack on the World Trade Center, 11th September 2001, to the Design and Use of Interactive Evacuation Simulations. Proc. of ACM CHI, (2005), 651--660.]]  ",
      "doi": "10.1145/1054972.1055062"
    },
    {
      "text": "Kyng. M. Scandinavian Design: Users in Product Develop-ment, Proc. CHI, (1994), 3--9.]]  ",
      "doi": "10.1145/191666.191673"
    },
    {
      "text": "Lutters, W. G. & Ackerman, M. S. 2002. Achieving safety: a field study of boundary objects in aircraft technical support, Proc. of CSCW, (2002), 266--275.]]  ",
      "doi": "10.1145/587078.587116"
    },
    {
      "text": "National Commission on Terrorist Attacks upon the United States. The 9-11 Commission Report: Final Report of the Na-tional Commission on Terrorist Attacks Upon the United States, Official Government Edition, Claitor's Law Books and Publishing Division, (2004).]]",
      "doi": ""
    },
    {
      "text": "Pettersson, M., Randall, D., & Helgeson, B. Ambiguities, awareness and economy: a study of emergency service work, Proc. CSCW, (2002), 286--295.]]  ",
      "doi": "10.1145/587078.587118"
    },
    {
      "text": "Pettersson, M. WaterCalls: An ambient call queue for coopera-tion between emergency service centres. Personal Ubiquitous Comput. 8(3-4), (2004), 192--199.]]  ",
      "doi": "10.1007/s00779-004-0277-8"
    },
    {
      "text": "Quarantelli, E. L. Delivery of Emergency Medical Services in Disasters: Assumption and Realities, New York: Irvington Publishers, (1983).]]",
      "doi": ""
    },
    {
      "text": "Quarantelli, E. L. Non-Medical Difficulties During Emergency Medical Services at the Time of Disasters. University of Delaware Disaster Research Center Publication, No. 319, (1997).]]",
      "doi": ""
    },
    {
      "text": "Star, S. L. & Griesemer, J. Institutional Ecology, \"Transla-tions,\" and Boundary Objects, Social Studies of Science, 19(3), (1989), 387--420.]]",
      "doi": ""
    },
    {
      "text": "Tierney, K., & Quarantelli, E. L. Needed Innovation in the Delivery of Emergency Medical Services in Disasters: Present and Future. Disaster Management, 2:2 (1989), 70--76.]]",
      "doi": ""
    },
    {
      "text": "Wachtendorf, T. & Kendra, J.M. (2005). Improvising Disaster in the City of Jazz: Organizational Response to Hurricane Katrina. Understanding Katrina: Perspectives from the Social Sciences, http://understandingkatrina.ssrc.org/Jackson/]]",
      "doi": ""
    },
    {
      "text": "www.ist-palcom.org/]]",
      "doi": ""
    }
  ]
}