{
  "doi": "10.1145/1124772.1124929",
  "title": "groupTime: preference based group scheduling",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1047-1056",
  "year": 2006,
  "badges": [],
  "abstract": "As our business, academic, and personal lives continue to move at an ever-faster pace, finding times for busy people to meet has become an art. One of the most perplexing challenges facing groupware is effective asynchronous group scheduling (GS). This paper presents a lightweight interaction model for GS that can extend its reach beyond users of current group calendaring solutions. By expressing availability in terms of preferences, we create a flexible framework for GS that preserves plausible deniability while exerting social pressure to encourage honesty among users. We also propose an ontology that enables us to model user preferences with machine learning, predicting user responses to further lower cognitive load. The combination of visualization/direct manipulation with machine learning allows users to easily and efficiently optimize meeting times. We also suggest resulting design implications for this class of intelligent user interfaces.",
  "tags": [
    "group scheduling",
    "group calendaring",
    "machine learning",
    "supervised learning",
    "intelligent user interfaces"
  ],
  "authors": [
    {
      "name": "Mike Brzozowski",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309505971",
      "orcid": "missing"
    },
    {
      "name": "Kendra Carattini",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484395",
      "orcid": "missing"
    },
    {
      "name": "Scott R. Klemmer",
      "institution": "Stanford University, Stanford, CA",
      "img": "/do/10.1145/contrib-81100364989/rel-imgonly/scott2016crop.jpg",
      "acmid": "81100364989",
      "orcid": "missing"
    },
    {
      "name": "Patrick Mihelich",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311482542",
      "orcid": "missing"
    },
    {
      "name": "Jiang Hu",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100255358",
      "orcid": "missing"
    },
    {
      "name": "Andrew Y. Ng",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100471019",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AOL Instant Messenger, 2005. America Online, Inc.: Dulles, VA. www.aim.com",
      "doi": ""
    },
    {
      "text": "iCal, 2005. Apple Computer, Inc.: Cupertino, CA. www.apple.com/macosx/features/ical/",
      "doi": ""
    },
    {
      "text": "Lotus Notes, 2005. IBM Corporation: Armonk, NY. www.ibm.com/software/lotus/",
      "doi": ""
    },
    {
      "text": "MSN Messenger, 2005. Microsoft Corp.: Redmond, WA. messenger.msn.com/",
      "doi": ""
    },
    {
      "text": "Outlook, 2003. Microsoft Corp.: Redmond, WA. of-fice.microsoft.com",
      "doi": ""
    },
    {
      "text": "Palm Desktop, 2004. PalmSource, Inc.: Sunnyvale, CA. www.palmos.com/dev/tools/desktop/",
      "doi": ""
    },
    {
      "text": "Beard, D., M. Palaniappan, A. Humm, et al. A visual calendar for scheduling group meetings. Proc. of CSCW 1990: ACM Press. pp. 279--90, 1990.  ",
      "doi": "10.1145/99332.99361"
    },
    {
      "text": "Boser, B. E., I. M. Guyon, and V. N. Vapnik. A training algo-rithm for optimal margin classifiers. Proc. Workshop on Computational Learning Theory: ACM Press. pp. 144--52, 1992.  ",
      "doi": "10.1145/130385.130401"
    },
    {
      "text": "Dourish, P., Social Computing, in Where the Action Is: The Foundations of Embodied Interaction. MIT Press: Cambridge, MA. pp. 55--98, 2001.",
      "doi": ""
    },
    {
      "text": "Dourish, P. and S. Bly. Portholes: supporting awareness in a distributed work group. Proc. CHI 1992: ACM Press. pp. 541--47, 1992.  ",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Evite, www.evite.com. 2005.",
      "doi": ""
    },
    {
      "text": "Fogarty, J., S. E. Hudson, and J. Lai. Examining the robustness of sensor-based statistical models of human interruptibility. Proc. CHI 2004: ACM Press. pp. 207--14.  ",
      "doi": "10.1145/985692.985719"
    },
    {
      "text": "Friedman, N., D. Geiger, and M. Goldszmidt. Bayesian Net-work Classifiers. Machine Learning 29(2-3). pp. 131--63, 1997.  ",
      "doi": "10.1023/A%3A1007465528199"
    },
    {
      "text": "Gajos, K. and D. S. Weld. SUPPLE: automatically generating user interfaces. Proc. IUI 2004: ACM Press. pp. 93--100, 2004.  ",
      "doi": "10.1145/964442.964461"
    },
    {
      "text": "Gervasio, M. T., M. D. Moffitt, M. E. Pollack, et al. Active preference learning for personalized calendar scheduling assis-tance. In Proc. IUI 2005: ACM Press. pp. 90--97, 2005.  ",
      "doi": "10.1145/1040830.1040857"
    },
    {
      "text": "Grudin, J. Groupware and social dynamics: Eight challenges for developers. Communications of the ACM 37(1), 1994.  ",
      "doi": "10.1145/175222.175230"
    },
    {
      "text": "Higa, K., B. Shin, and V. Sivakumar. Meeting Scheduling: An Experimental Investigation. In Proc. IEEE International Con-ference on Systems, Man., and Cybernetics, 1996.",
      "doi": ""
    },
    {
      "text": "Horvitz, E., P. Koch, C. M. Kadie, and A. Jacobs. Coordinate: Probabilistic Forecasting of Presence and Availability. In Proc. Conf. on Uncertainty and AI: Morgan Kaufmann, 2002. ",
      "doi": "10.5555/2073876.2073903"
    },
    {
      "text": "Hu, J. and M. Brzozowski. Preference-Based Group Scheduling. In Proc. Interact 2005, 2005.  ",
      "doi": "10.1007/11555261_87"
    },
    {
      "text": "Hutchins, E., Cognition in the Wild. Cambridge, MA: MIT Press 1995.",
      "doi": ""
    },
    {
      "text": "Isbell, C. L. and J. S. Pierce. An IP Continuum for Adaptive Interface Design. In Proc. HCI International, 2005.",
      "doi": ""
    },
    {
      "text": "Kushmerick, N. and T. Lau, Automated email activity man-agement: an unsupervised learning approach, in IUI 2005. 2005, ACM Press: San Diego, CA.  ",
      "doi": "10.1145/1040830.1040854"
    },
    {
      "text": "Lamming, M., P. Brown, K. Carter, et al. The Design of a Human Memory Prosthesis. The Computer Journal 37(3). pp. 153--63, 1994.",
      "doi": ""
    },
    {
      "text": "Maes, P. Agents that reduce work and information overload. Commun. ACM 37(7). pp. 30--40, 1994.  ",
      "doi": "10.1145/176789.176792"
    },
    {
      "text": "McCullagh, P. and J. A. Nelder, Generalized Linear Models. 2nd ed. London: Chapman and Hall 1989.",
      "doi": ""
    },
    {
      "text": "Palen, L., Calendars on the New Frontier: Challenges of Groupware Technology, University of California, Irvine, 1998. ",
      "doi": "10.5555/335810"
    },
    {
      "text": "Palen, L. Social, individual and technological issues for groupware calendar systems. Proc. CHI 1999: ACM Press. pp. 17--24, 1999.  ",
      "doi": "10.1145/302979.302982"
    },
    {
      "text": "Rocco, E., Trust breaks down in electronic contexts but can be repaired by some initial face-to-face contact, in CHI 1998. 1998, ACM Press/Addison-Wesley.  ",
      "doi": "10.1145/274644.274711"
    },
    {
      "text": "Schmandt, C., N. Marmasse, S. Marti, et al. Everywhere messaging. IBM Syst. J. 39(3-4). pp. 660--77, 2000.  ",
      "doi": "10.1147/sj.393.0660"
    },
    {
      "text": "Searle, J., Speech acts: an essay in the philosophy of language. London: Cambridge University Press 1969.",
      "doi": ""
    },
    {
      "text": "Sen, S., T. Haynes, and N. Arora. Satisfying user preferences while negotiating meetings. Int. J. of Human-Computer Studies 47(3). pp. 407--27, 1997.  ",
      "doi": "10.1006/ijhc.1997.0139"
    },
    {
      "text": "Shneiderman, B. and P. Maes. Direct manipulation vs. inter-face agents. interactions 4(6). pp. 42--61, 1997.  ",
      "doi": "10.1145/267505.267514"
    },
    {
      "text": "Suchman, L. Speech acts and voices: response to Winograd et al. Comput. Supported Coop. Work 3(1). pp. 85--95, 1995.  ",
      "doi": "10.1007/BF01305852"
    },
    {
      "text": "Suchman, L. A., Plans and Situated Actions: The Problem of Human-Machine Communication: Cambridge University Press. 203 1987. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "Thrift, N., The Making of a Capitalist Time Consciousness, in The Sociology of Time, J. Hassard, Editor. St. Martin's Press: New York, 1990.",
      "doi": ""
    },
    {
      "text": "Tullio, J. Intelligent groupware to support communication and persona management. Proc. UIST 2003, 2003.",
      "doi": ""
    },
    {
      "text": "Winograd, T. A Language/Action Perspective on the Design of Cooperative Work. HCI 3(1). pp. 3--30, 1988.",
      "doi": "10.1207/s15327051hci0301_2"
    }
  ]
}