{
  "doi": "10.1145/1124772.1124783",
  "title": "Representation of interwoven surfaces in 2 1/2 D drawing",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "65-74",
  "year": 2006,
  "badges": [],
  "abstract": "The state-of-the-art in computer drawing programs is based on a number of concepts that are over two decades old. One such concept is the use of layers for ordering the surfaces in a drawing from top to bottom. Unfortunately, the use of layers unnecessarily imposes a partial ordering on the depths of the surfaces and prevents the user from creating a large class of potential drawings, e.g., of Celtic knots and interwoven surfaces. In this paper we describe a novel approach which only requires local depth ordering of segments of the boundaries of surfaces in a drawing rather than a global depth relation between entire surfaces. Our program provides an intuitive user interface which allows a novice to create complex drawings of interwoven surfaces that would be difficult and time-consuming to create with standard drawing programs.",
  "authors": [
    {
      "name": "Keith Wiley",
      "institution": "University of New Mexico, Albuquerque, NM",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481522",
      "orcid": "missing"
    },
    {
      "name": "Lance R. Williams",
      "institution": "University of New Mexico, Albuquerque, NM",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100005753",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adobe Illustrator, c 2005 Adobe.",
      "doi": ""
    },
    {
      "text": "Baudelaire, P., and M. Gangnet, Planar Maps: An Interaction Paradigm for Graphic Design, Proc. of CHI, 1989.  ",
      "doi": "10.1145/67449.67511"
    },
    {
      "text": "Coreldraw, c 2005 Corel.",
      "doi": ""
    },
    {
      "text": "Craig, D., LisaDraw 3.0 manual, 1984.",
      "doi": ""
    },
    {
      "text": "Gibson, J. J., The Ecological Approach to Visual Perception, Houghton Mifflin Co., Boston, MA, 1979.",
      "doi": ""
    },
    {
      "text": "Gleicher, M., Briar: A Constraint-Based Drawing Program, Proc. of CHI, Monterey, CA, 1992.  ",
      "doi": "10.1145/142750.143074"
    },
    {
      "text": "Huffman, D. A., Impossible Objects as Nonsense Sentences, Machine Intelligence, 6, 1971.",
      "doi": ""
    },
    {
      "text": "iDraw, c 2005 MacPowerUser.",
      "doi": ""
    },
    {
      "text": "Marsland, T. A., and M. Campbell, Parallel Search of Strongly Ordered Game Trees, ACM Computing Surveys, 14 (4), pp. 533--551, 1982.  ",
      "doi": "10.1145/356893.356895"
    },
    {
      "text": "McGrenere, J., and W. Ho, Affordances: Clarifying and Evolving a Concept, Graphics Interface, pp. 179--186, May 2000.",
      "doi": ""
    },
    {
      "text": "Metelli, F., The Perception of Transparency, Scientific American, 230 (4), pp. 90--98, 1974.",
      "doi": ""
    },
    {
      "text": "Myers, B. A., A Brief History of Human Computer Interaction Technology, ACM Interactions, 5 (2), pp. 44--54, 1998.  ",
      "doi": "10.1145/274430.274436"
    },
    {
      "text": "Norman, D. A., Affordance, Conventions, and Design, ACM Interactions, pp. 38--43, 1999.  ",
      "doi": "10.1145/301153.301168"
    },
    {
      "text": "Norman, D. A., The Design of Everyday Things, Basic Books, 2002. ",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Norman, D. A., and S. W. Draper, User Centered System Design: New Perspectives on Human-Computer Interaction, Lawrence Erlbaum Associates, Hillsdale, NJ, 1986. ",
      "doi": "10.5555/576915"
    },
    {
      "text": "Raisamo, R., and K-J R?aih ?a, Techniques for Aligning Objects in Drawing Programs, Department of Computer Science, Univ. of Tampere, Technical Report A-1996-5.",
      "doi": ""
    },
    {
      "text": "Sato, T., and B. Smith, Xfig User Manual, 2002. http://xfig.org/userman/",
      "doi": ""
    },
    {
      "text": "Scharein, R. G. Interactive Topological Drawing. PhD dissertation, University of British Columbia, 1998. ",
      "doi": "10.5555/926441"
    },
    {
      "text": "Sutherland, I. E., Sketchpad: A Man-Machine Graphical Communication System, PhD dissertation, Cambridge Univ., 1963.",
      "doi": ""
    },
    {
      "text": "Voska, R., Real-Draw manual, pp. 67-72, 2003. http://www.mediachance.com/files/RealDrawPDF.zip",
      "doi": ""
    },
    {
      "text": "Waltz, D. L., Understanding Line Drawings of Scenes with Shadows, McGraw-Hill, New York, pp. 19--92, 1975.",
      "doi": ""
    },
    {
      "text": "Weiler, K., and P. Atherton, Hidden Surface Removal Using Polygon Area Sorting, ACM SIGGRAPH, pp. 214--222, 1977.  ",
      "doi": "10.1145/965141.563896"
    },
    {
      "text": "Williams, L. R., Perceptual Completion of Occluded Surfaces, PhD dissertation, Univ. of Massachusetts at Amherst, Amherst, MA, 1994. ",
      "doi": "10.5555/192964"
    }
  ]
}