{
  "doi": "10.1145/1124772.1124942",
  "title": "Remote usability evaluations With disabled people",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1133-1141",
  "year": 2006,
  "badges": [],
  "abstract": "Finding participants for evaluations with specific demographics can be a problem for usability and user experience specialists. In particular, finding participants with disabilities is especially problematic, yet testing with disabled people is becoming increasingly important. Two case studies are presented that explore using asynchronous remote evaluation techniques with disabled participants. These show that while quantitative data are comparable, the amount and richness of qualitative data are not likely to be comparable. The implications for formative and summative evaluations are discussed and a set of principles for local and remote evaluations with disabled users is presented.",
  "tags": [
    "usability testing and evaluation",
    "disabled users",
    "usability research",
    "remote evaluation"
  ],
  "authors": [
    {
      "name": "Helen Petrie",
      "institution": "University of York, York, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022960",
      "orcid": "missing"
    },
    {
      "name": "Fraser Hamilton",
      "institution": "Designed for All, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100297138",
      "orcid": "missing"
    },
    {
      "name": "Neil King",
      "institution": "Designed for All, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100193807",
      "orcid": "missing"
    },
    {
      "name": "Pete Pavan",
      "institution": "Designed for All, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311482268",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bradner, E. (2004). Keeping your distance. User experience, 3(6), 11.",
      "doi": ""
    },
    {
      "text": "Brush, A.J., Ames, M. and Davis, J. (2004). A comparison of synchronous remote and local usability studies for an expert interface. Proc. CHI '04. New York: ACM Press.  ",
      "doi": "10.1145/985921.986018"
    },
    {
      "text": "Center for Universal Design. Principles of Universal Design. Available at: http://www.design.ncsu.edu:8120/cud/univ_design/princ_overview.htm",
      "doi": ""
    },
    {
      "text": "DeSouza, F. and Bevan, N. (1990): The use of guidelines in menu interface design: evaluation of a draft standard. In D. Diaper, D. Gilmore, G. Cockton and B. Shackel, (Eds.), Proceedings of INTERACT 90 - 3rd IFIP International Conference on Human-Computer Interaction. Cambridge, UK. ",
      "doi": "10.5555/647402.725751"
    },
    {
      "text": "Disability Rights Commission (2004). The web: access and inclusion for disabled people. London: The Stationery Office.",
      "doi": ""
    },
    {
      "text": "Hammond, N., Gardiner, M., Christie, B., and Marshall, C. (1987). The role of cognitive psychology in user-interface design. In M. Gardiner and B. Christie (Eds.), Applying cognitive psychology to user-interface design. Chichester: John Wiley. ",
      "doi": "10.5555/26115.26117"
    },
    {
      "text": "Hartson, H.R., Castillo, J.C. Kelso, J. and Neale, W.C. (1996). Remote evaluations: the network as an extension of the usability laboratory. Proc. CHI '96, New York: ACM, 228 -- 235.  ",
      "doi": "10.1145/238386.238511"
    },
    {
      "text": "Hilbert, D.M. and Redmiles, D. F. (1998). An approach to large-scale collection of application usage data over the Internet. Proc. 20th International Conference on Software Engineering. IEEE Press. ",
      "doi": "10.5555/302163.302177"
    },
    {
      "text": "Hong, J.I., Heer, J., Waterson, S. and Landay, J.A. (2001). WebQuilt: a proxy-based approach to remote web usability testing. ACM Transactions on Information Systems, 19(3), 263 -- 285.  ",
      "doi": "10.1145/502115.502118"
    },
    {
      "text": "Horstmann, M., Lorenz, M., Watkowski, A., Ioannidis, G., Herzog, O., King, A., Evans, D.G., Hagen, C., Schlieder, C., Burn, A.-M., King, N., Petrie, H., Dijkstra, S. and Crombie, D. (2004). Automated interpretation and accessible presentation of technical diagrams for blind people. New Review of Hypermedia and Multimedia, 10(2), 1 -- 23.  ",
      "doi": "10.5555/1117664.1117667"
    },
    {
      "text": "Ivory, M. Y. and Hearst, M. A. (2001). The state of the art in automated usability evaluation of user interfaces. ACM Computing Surveys, 33(4), 470 -- 516.  ",
      "doi": "10.1145/503112.503114"
    },
    {
      "text": "King, A. Blenkhorn, P., Crombie, D., Dijkstra, S., Evans, G. and Wood, J. (2004). Presenting UML software engineering diagrams to blind people. Proceedings of 9th International Conference on Computers Helping People with Special Needs, (Lecture Notes in Computer Science LNCS 3118). Berlin: Springer Verlag.",
      "doi": ""
    },
    {
      "text": "Law, C., Barnicle, K. and Henry, S.L. (2000). Usability screening techniques: evaluating for a wider range of environments, circumstances and abilities. Proc. UPA 2000. Available at: http://trace.wisc.edu/docs/usability_screen_techs_UPA2000/usability_screening_techs.htm",
      "doi": ""
    },
    {
      "text": "Löwgren, J. and Nordquist, T. (1992). Knowledge-based evaluation as design support for graphical user interfaces. Proc. CHI '92. New York: ACM Press.  ",
      "doi": "10.1145/142750.142786"
    },
    {
      "text": "Mosier, J. N. and Smith, S. L. (1986). Application of guidelines for designing user interface software. Behavior and Information Technology, 5(1), 39--46.",
      "doi": ""
    },
    {
      "text": "Newell, A.F. and Gregor, P. (2000). User sensitive inclusive design -- in search of a new paradigm. In J. Scholtz and J. Thomas (Eds.), CUU 2000: First ACM Conference on Universal Usability. New York: ACM Press.  ",
      "doi": "10.1145/355460.355470"
    },
    {
      "text": "Petrie, H. (1997). User-centred design and evaluation of adaptive and assistive technology for disabled and elderly users. Informationstechnik und Technische Informatik, 39(2), 7 -- 12.",
      "doi": ""
    },
    {
      "text": "Petrie, H. (2001). Acessibility and usability requirements for ICTs for disabled and elderly people: a functional classification approach. In J.G. Abascal and C. Nicolle (Eds.), Inclusive guidelines for human computer interaction. London: Taylor and Francis. 0-748409-48-3.",
      "doi": ""
    },
    {
      "text": "Petrie, H., and Hamilton, F. (2004). The Disability Rights Commission Formal Investigation into Web Site Accessibility. In Dearden, A. and Watts, L. (Eds.), Proceedings HCI 2004: Design For Life (Leeds, UK), pp. 157--158.",
      "doi": ""
    },
    {
      "text": "Petrie, H., O'Neill, A-M. and Colwell, C. (2002). Computer access by visually impaired people. In A. Kent and J.G. Williams (Eds.), Encyclopedia of Microcomputers Volume 28. New York: Marcel Dekker.",
      "doi": ""
    },
    {
      "text": "Petrie, H., Weber, G., and Fisher, W. (2005). Personalisation, interaction and navigation in rich multimedia documents for print-disabled users. IBM Systems Journal, 44(3).  ",
      "doi": "10.1147/sj.443.0629"
    },
    {
      "text": "Poulson, D., Ashby, M. and Richardson, S. (1996). USERfit, A practical handbook on user-centred design for Assistive Technology, Brussels-Luxembourg: ESC-EC-EAEC.",
      "doi": ""
    },
    {
      "text": "Smith, S.K. and Mosier, J.N. (1986). Guidelines for designing user interface software. Available at: http://hcibib.org/sam/",
      "doi": ""
    },
    {
      "text": "Techsmith. www.techsmith.com/products/morae",
      "doi": ""
    },
    {
      "text": "Vanderheiden, G. (2000). Fundamental principles and priority setting for universal usability. In J. Scholtz and J. Thomas (Eds.), CUU 2000: First ACM Conference on Universal Usability. New York: ACM Press.  ",
      "doi": "10.1145/355460.355469"
    },
    {
      "text": "Vanderheiden, G. and Tobias, J. (1998). Barriers, incentives and facilitators for adoption of universal design practices by consumer product manufacturers.",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium. Authoring Tool Accessibility Guidelines (ATAG). Available at: http://www.w3.org/WAI/intro/atag.php",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium. User Agent Accessibility Guidelines (UAAG). Available at: http://www.w3.org/WAI/intro/uaag.php",
      "doi": ""
    },
    {
      "text": "World Wide Web Consortium. Web Content Accessibility Guidelines (WCAG). Available at: http://www.w3.org/WAI/intro/wcag.php",
      "doi": ""
    }
  ]
}