{
  "doi": "10.1145/1124772.1124889",
  "title": "GUESS: a language and interface for graph exploration",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "791-800",
  "year": 2006,
  "badges": [],
  "abstract": "As graph models are applied to more widely varying fields, researchers struggle with tools for exploring and analyzing these structures. We describe GUESS, a novel system for graph exploration that combines an interpreted language with a graphical front end that allows researchers to rapidly prototype and deploy new visualizations. GUESS also contains a novel, interactive interpreter that connects the language and interface in a way that facilities exploratory visualization tasks. Our language, Gython, is a domain-specific embedded language which provides all the advantages of Python with new, graph specific operators, primitives, and shortcuts. We highlight key aspects of the system in the context of a large user survey and specific, real-world, case studies ranging from social and knowledge networks to distributed computer network analysis.",
  "tags": [
    "graph visualization",
    "domain-specific embedded language",
    "graph layout"
  ],
  "authors": [
    {
      "name": "Eytan Adar",
      "institution": "University of Washington, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100589033",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamic, L.A., and N. Glance, \"The Political Blogosphere and the 2004 U.S. Election: Divided They Blog,\" 2nd Annual Weblogging Workshop, WWW 2005, Chiba, Japan, May 10, 2005.",
      "doi": ""
    },
    {
      "text": "Adar, E., and J.R. Tyler, \"Zoomgraph Manual,\" www.hpl.hp.com/shl/projects/graphs/doc/zg-manual.htm",
      "doi": ""
    },
    {
      "text": "Aiken, A., J. Chen, M. Liu, M. Spalding, M. Stonebraker, and A. Woodruff, \"The Tioga-2 Database Visualization Environment,\" IEEE Vis. '95 Workshop. on Database Issues for Data Vis., Atlanta, Oct. 1995, pp. 181--207. ",
      "doi": "10.5555/646123.680582"
    },
    {
      "text": "Batagelj, V., and A. Mrvar, \"Pajek -- Program for Large Analysis,\" Connections, 21:47--47, 1998.",
      "doi": ""
    },
    {
      "text": "Bederson, B.B., J. Grosjean, and J. Meyer, \"Toolkit Design for Interactive Structured Graphics,\" IEEE Transactions on Software Engineering, 30(8):535--546.  ",
      "doi": "10.1109/TSE.2004.44"
    },
    {
      "text": "Berry, J., N. Dean, M. Goldberg, G. Shannon, and S. Skiena, \"Graph Drawing and Manipulation with LINK,\" Lecture Notes in Computer Science 1353: Graph Drawing 1997, G. Di Battista (ed.), Springer, 1997. ",
      "doi": "10.5555/647549.728916"
    },
    {
      "text": "Bosch, R., C. Stolte, D. Tang, J. Gerth, M. Rosenblum, and P. Hanrahan, \"Rivet: A Flexible Environment for Computer System Visualization,\" Computer Graphics, 34(1), 2000.  ",
      "doi": "10.1145/563788.604455"
    },
    {
      "text": "Di Battista, G., P. Eades, R. Tamassia, and I. G. Tollis, Graph Drawing: Algorithms for Visualization of Graphs, Prentice Hall, 2002. ",
      "doi": "10.5555/551884"
    },
    {
      "text": "Gansner, E.R., and S.C. North, \"An open visualization system and its applications to software engineering,\" Software -- Practice and Experience, 30(11):1203--1233, 2000.  ",
      "doi": "10.5555/358668.358697"
    },
    {
      "text": "\"The GraphML File Format,\" graphml.graphdrawing.org",
      "doi": ""
    },
    {
      "text": "Güting, R.H. \"GraphDB: Modeling and Querying Graphs in Databases,\" VLDB '94, Santiago De Chile, Chile, Sep. 12-15, 1994.",
      "doi": ""
    },
    {
      "text": "Gyseens, M., J. Paredaens, J. Van den Bussche, and D. Van Gucht, \"A Graph-Oriented Object Database Model,\" Proceedings of the 9th Symposium on Principles of Database Systems, Nashville, TN, 1990.  ",
      "doi": "10.1145/298514.298593"
    },
    {
      "text": "Heer, J., S. K. Card, and J. A. Landay, \"Prefuse: A Toolkit for Interactive Information Visualization,\" CHI 2005, Portland, OR, April 2-7, 2005.  ",
      "doi": "10.1145/1054972.1055031"
    },
    {
      "text": "Himsolt, M., \"Graphlet: design and implementation of a graph editor,\" Software -- Practice & Experience, 30(11):1303--1324, 2000.  ",
      "doi": "10.1002/1097-024X%28200009%2930%3A11%253C1303%3A%3AAID-SPE341%253E3.0.CO%3B2-3"
    },
    {
      "text": "Himsolt, M., \"GraphEd: A Graphical Platform for the Implementation of Graph Algorithms,\" Lecture Notes in Computer Science: Graph Drawing 1994, Springer, 1994. ",
      "doi": "10.5555/647546.730915"
    },
    {
      "text": "JGraph homepage, http://www.jgraph.com",
      "doi": ""
    },
    {
      "text": "JUNG homepage, http://jung.sourceforge.net",
      "doi": ""
    },
    {
      "text": "Jython homepage, http://www.jython.org",
      "doi": ""
    },
    {
      "text": "Koutsofios, E. and D. Dobkin, \"Lefty: A two-view editor for technical pictures\", Graphics Interface '91, Calgary, Alberta, 1991, pp. 68--76.",
      "doi": ""
    },
    {
      "text": "Livny, M., R. Ramakrishan, K. Beyer, G. Chen, D. Donjerkovic, S. Lawande, J. Myllymaki, and K. Wenger, \"DEVise: Integrated Querying and Visual Exploration of Large Datasets,\" Proceedings of ACM SIGMOD, 1997.  ",
      "doi": "10.1145/253260.253335"
    },
    {
      "text": "Melhorn, K., and S. Naher, \"LEDA: a platform for combinatorial and geometric computing,\" Communications of the ACM, 38(1):96--102.  ",
      "doi": "10.1145/204865.204889"
    },
    {
      "text": "Misue, K., P. Eades, W. Lai, and K. Sugiyama, \"Layout Adjustment and the Mental Map,\" Journal of Visual Languages and Computing, 6(2):183--210, 1995.",
      "doi": ""
    },
    {
      "text": "Mutzel, P., and M. Junger, Graph Drawing Software, Springer-Verlag, 2003. ",
      "doi": "10.5555/861394"
    },
    {
      "text": "Page, L., S. Brin, R. Motwani, and T. Winograd, \"The PageRank Citation Ranking: Bringing Order to the Web,\" Stanford Technical Report, 1998.",
      "doi": ""
    },
    {
      "text": "Stolte, C., D. Tang, and P. Hanrahan, \"Polaris: A System for Query, Analysis, and Visualization of Multidimensional Relational Database,\" IEEE Transactions on Visualization and Computer Graphics, 8(1), 2002.  ",
      "doi": "10.1109/2945.981851"
    },
    {
      "text": "Swayne, D.F., B. Andreas, and D.T. Lang, \"Exploratory Visual Analysis of Graphs in GGobi,\" Workshop on Distributed Statistical Computing (DSC 2003), Vienna, Austria, March 20-22, 2003.",
      "doi": ""
    },
    {
      "text": "Tom Sawyer Software, http://www.tomsawyer.com",
      "doi": ""
    },
    {
      "text": "TouchGraph, http://www.touchgraph.com",
      "doi": ""
    },
    {
      "text": "Tukey, J., Exploratory Data Analysis, Addison-Wesley, 1977.",
      "doi": ""
    },
    {
      "text": "Wasserman, S., and K. Faust, Social Network Analysis, Cambridge University Press, 1994.",
      "doi": ""
    },
    {
      "text": "Xu, Z., P. Sharma, S. Lee, and S. Banerjee, \"Netvigator: Scalable Network Proximity Estimation,\" HP Laboratories Technical Report, HPL-2004-28, Feb. 2004.",
      "doi": ""
    },
    {
      "text": "yEd by yWorks, http://www.yworks.com",
      "doi": ""
    }
  ]
}