{
  "doi": "10.1145/1124772.1124862",
  "title": "Secrecy, flagging, and paranoia: adoption criteria in encrypted email",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "591-600",
  "year": 2006,
  "badges": [],
  "abstract": "We consider the social context behind users' decisions about whether and when to encrypt email, interviewing a sample of users from an organization whose mission requires secrecy. Interview participants varied in their level of technical sophistication and in their involvement with secrets. We found that users saw universal, routine use of encryption as paranoid. Encryption flagged a message not only as confidential but also as urgent, so users found the encryption of mundane messages annoying. In general, decisions about encryption were driven not just by technical issues such as usability, but also by social factors. We argue that understanding these social factors is necessary to guide the design of encryption technologies that can be more widely adopted.",
  "tags": [
    "security",
    "encrypted e-mail",
    "extended case method",
    "activism"
  ],
  "authors": [
    {
      "name": "Shirley Gaw",
      "institution": "Princeton University, Princeton, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485460",
      "orcid": "missing"
    },
    {
      "name": "Edward W. Felten",
      "institution": "Princeton University, Princeton, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100373505",
      "orcid": "missing"
    },
    {
      "name": "Patricia Fernandez-Kelly",
      "institution": "Princeton University, Princeton, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311483971",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adams, A. and Sasse, M. A. Users are not the enemy. Commun. ACM 42, 12 (1999), 40--46.  ",
      "doi": "10.1145/322796.322806"
    },
    {
      "text": "Balfanz, D. Usable access control for the world wide web. In Proc. of ACSAC, IEEE (2003), 406--415. ",
      "doi": "10.5555/956415.956458"
    },
    {
      "text": "Balfanz, D., Durfee, G., Grinter, R. E., Smetters, D., and Stewart, P. Network-in-a-box: How to set up a secure wireless network in under a minute. In Proc. of the 13th USENIX Security Symposium, USENIX (2004), 207--222. ",
      "doi": "10.5555/1251375.1251390"
    },
    {
      "text": "Beznosov, K., Zurko, M. E., Chan, S., and Conti, G. Usability of security administration vs. usability of end-user security. SOUPS 2005 Conference Panel, 2005.",
      "doi": ""
    },
    {
      "text": "Burawoy, M., editor. Ethnography Unbound: Power and Resistance in the Modern Metropolis. University of California Press, 1991.",
      "doi": ""
    },
    {
      "text": "Cooper, A. The Inmates Are Running the Asylum: Why High Tech Products Drive Us Crazy and How to Restore the Sanity. Pearson Higher Education, 2nd edition, 2004. ",
      "doi": "10.5555/984201"
    },
    {
      "text": "Cranor, L. F. and Garfinkel, S. Guest editors' introduction: Secure or usable? IEEE Security & Privacy Magazine 2, 5 (2004), 16--18.  ",
      "doi": "10.1109/MSP.2004.69"
    },
    {
      "text": "Dhamija, R. and Tygar, J. D. The battle against phishing: Dynamic security skins. In Proc. of SOUPS 2005, ACM Press (2005), 77--88.  ",
      "doi": "10.1145/1073001.1073009"
    },
    {
      "text": "Dourish, P., Grinter, E., de la Flor, J. D., and Joseph, M. Security in the wild: user strategies for managing security as an everyday, practical problem. Personal Ubiquitous Comput. 8, 6 (2004), 391--401.  ",
      "doi": ""
    },
    {
      "text": "Edwards, W. K., Newman, M. W., Sedivy, J. Z., Smith, T. F., Balfanz, D., Smetters, D. K., Wong, H. C., and Izadi, S. Using speakeasy for ad hoc peer-to-peer collaboration. In Proc. of CSCW 2002, 2002.  ",
      "doi": "10.1145/587078.587114"
    },
    {
      "text": "Ferguson, N. and Schneier, B. Practical Cryptography. Wiley Publishing, Inc., New York, NY, 2003. ",
      "doi": "10.5555/862106"
    },
    {
      "text": "Friedman, B. Value sensitive design. In Encyclopedia of human-computer interaction, 769--774. Berkshire Publishing Group, 2004.",
      "doi": ""
    },
    {
      "text": "Garfinkel, S. L., Margrave, D., Schiller, J. I., Nordlander, E., and Miller, R. C. How to make secure email easier to use. In Proc. of CHI 2005, ACM Press (2005), 701--710.  ",
      "doi": "10.1145/1054972.1055069"
    },
    {
      "text": "Garfinkel, S. L. and Miller, R. C. Johnny 2: a user test of key continuity management with S/MIME and Outlook Express. In Proc. of SOUPS 2005, ACM Press (2005), 13--24.  ",
      "doi": "10.1145/1073001.1073003"
    },
    {
      "text": "Good, N., Dhamija, R., Grossklags, J., Thaw, D., Aronowitz, S., Mulligan, D., and Konstan, J. Stopping spyware at the gate: a user study of privacy, notice and spyware. In Proc. of SOUPS 2005, ACM Press (2005), 43--52.  ",
      "doi": "10.1145/1073001.1073006"
    },
    {
      "text": "Lichtblau, E. Large volume of FBI files alarms some US activist groups. New York Times Online, July 2005.",
      "doi": ""
    },
    {
      "text": "Millett, L. I., Friedman, B., and Felten, E. Cookies and web browser design: toward realizing informed consent online. In Proc. of CHI 2001, ACM Press (2001), 46--52.  ",
      "doi": "10.1145/365024.365034"
    },
    {
      "text": "Schneier, B. Secrets and Lies : Digital Security in a Networked World. Wiley Computer Publishing, New York, NY, 2004. ",
      "doi": "10.5555/994962"
    },
    {
      "text": "Shneiderman, B. Promoting universal usability with multi-layer interface design. In Proc. of CUU 2003, ACM Press (2003), 1--8.  ",
      "doi": "10.1145/957205.957206"
    },
    {
      "text": "Smetters, D. K. and Grinter, R. E. Moving from the design of usable security technologies to the design of useful secure applications. In Proc. of NSPW 2002. ACM Press (2002), 82--89.  ",
      "doi": "10.1145/844102.844117"
    },
    {
      "text": "Strauss, A. and Corbin, J. M. Basics of Qualitative Research : Techniques and Procedures for Developing Grounded Theory. SAGE Publications, 1998.",
      "doi": ""
    },
    {
      "text": "Weirich, D. and Sasse, M. A. Persuasive password security. In Proc. of Ext. Abstracts CHI 2001, ACM Press (2001), 139--140.  ",
      "doi": "10.1145/634067.634152"
    },
    {
      "text": "Weirich, D. and Sasse, M. A. Pretty good persuasion: a first step towards effective password security in the real world. In Proc. of NSPW 2001, ACM Press (2001), 137--143.  ",
      "doi": "10.1145/508171.508195"
    },
    {
      "text": "Whitten, A. and Tygar, J. D. Why Johnny can't encrypt: A usability evaluation of PGP 5.0. In Proc. of 8th USENIX Security Symposium. USENIX (1999), 169--184. ",
      "doi": "10.5555/1251421.1251435"
    }
  ]
}