{
  "doi": "10.1145/1124772.1124831",
  "title": "Barista: An implementation framework for enabling new tools, interaction techniques and views in code editors",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "387-396",
  "year": 2006,
  "badges": [],
  "abstract": "Recent advances in programming environments have focused on improving programmer productivity by utilizing the inherent structure in computer programs. However, because these environments represent code as plain text, it is difficult and sometimes impossible to embed interactive tools, annotations, and alternative views in the code itself. Barista is an implementation framework that enables the creation of such user interfaces by simplifying the implementation of editors that represent code internally as an abstract syntax tree and maintain a corresponding, fully structured visual representation on-screen. Barista also provides designers of editors with a standard text-editing interaction technique that closely mimics that of conventional text editors, overcoming a central usability issue of previous structured code editors.",
  "authors": [
    {
      "name": "Amy J. Ko",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100500360/rel-imgonly/2021-02.jpg",
      "acmid": "81100500360",
      "orcid": "missing"
    },
    {
      "name": "Brad A. Myers",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100013136/rel-imgonly/brad-myers-120x120.jpg",
      "acmid": "81100013136",
      "orcid": "0000-0002-4769-0219"
    }
  ],
  "references": [
    {
      "text": "Baecker, R. and Marcus, A., Design Principles for the Enhanced Presentation of Computer Program Source Text, CHI (1986), 51--58.  ",
      "doi": "10.1145/22627.22348"
    },
    {
      "text": "Birnbaum, B. E. and Goldman, K. J., Achieving Flexibility in Direct-Manipulation Programming Environments by Relaxing the Edit-Time Grammar, VL/HCC (2005), 259--266.  ",
      "doi": "10.1109/VLHCC.2005.15"
    },
    {
      "text": "Boshernitsan, M., Harmonia: A Flexible Framework for Constructing Interactive Language-Based Programming Tools, University of California, Berkeley, Technical Report CSD-01-1149, 2001. ",
      "doi": ""
    },
    {
      "text": "Garlan, D. B. and Miller, P. L., Gnome: An Introductory Programming Environment Based on a Family of Structure Editors, SESPSDE (1984), 65--72.  ",
      "doi": "10.1145/800020.808250"
    },
    {
      "text": "Graham, S. L., Harrison, M. A., and Munson, E. V., The Proteus Presentation System, SESPSDE (1992), 130--138.  ",
      "doi": "10.1145/142868.143762"
    },
    {
      "text": "Green, T. R. G. and Petre, M., Usability Analysis of Visual Programming Environments: A 'Cognitive Dimensions' Framework, JVLC, 7, (1996), 131--174.",
      "doi": ""
    },
    {
      "text": "Kehoe, C., Stasko, J., and Taylor, A., Rethinking the Evaluation of Algorithm Animations as Learning Aids: An Observational Study, IJHCS, 54, 2, (2001), 265--284.  ",
      "doi": "10.1006/ijhc.2000.0409"
    },
    {
      "text": "Kelleher, C., Cosgrove, D., Culyba, D., Forlines, C., Pratt, J., and Pausch, R., Alice2: Programming without Syntax Errors, UIST (2002).",
      "doi": ""
    },
    {
      "text": "Ko, A. J., Aung, H., and Myers, B. A., Design Requirements for More Flexible Structured Editors from a Study of Programmers' Text Editing, CHI (2005), 1557--1560.  ",
      "doi": "10.1145/1056808.1056965"
    },
    {
      "text": "Ko, A. J., Aung, H., and Myers, B. A., Eliciting Design Requirements for Maintenance-Oriented IDEs: A Detailed Study of Corrective and Perfective Maintenance Tasks, ICSE (2005), 126--135.  ",
      "doi": "10.1145/1062455.1062492"
    },
    {
      "text": "Ko, A. J. and Myers, B. A., Citrus: A Language and Toolkit for Simplifying the Creation of Structured Editors for Code and Data, UIST (2005), 3--12.  ",
      "doi": "10.1145/1095034.1095037"
    },
    {
      "text": "LaToza, T., Venolia, G., and DeLine, R., Maintaining Mental Models: A Study of Developer Work Habits, ICSE (2005), to appear.  ",
      "doi": "10.1145/1134285.1134355"
    },
    {
      "text": "Miller, P., Pane, J., Meter, G., and Vorthmann, S., Evolution of Novice Programming Environments: The Structure Editors of Carnegie Mellon University, ILE, 4, 2, (1994), 140--158.",
      "doi": ""
    },
    {
      "text": "Oman, P. and Cook, C. R., Typographic Style Is More Than Cosmetic, CACM, 33, 1990, 506--520.  ",
      "doi": "10.1145/78607.78611"
    },
    {
      "text": "Pane, J. F., Myers, B. A., and Miller, L. B., Using HCI Techniques to Design a More Usable Programming System, HCC (2002), 198--206. ",
      "doi": "10.5555/795687.797801"
    },
    {
      "text": "Reiss, S. P., Graphical Program Development with Pecan Program Development Systems, SESPSDE (1984), 30--41.  ",
      "doi": "10.1145/800020.808246"
    },
    {
      "text": "Schrage, M. M., Proxima - a Presentation-Oriented Editor for Structured Documents, Utrecht University 2004.",
      "doi": ""
    },
    {
      "text": "Teitelbaum, T. and Reps, T., The Cornell Program Synthesizer: A Syntax-Directed Programming Environment, CACM, 24, 9, (1981), 563--573.  ",
      "doi": "10.1145/358746.358755"
    },
    {
      "text": "Wagner, T. A. and Graham, S. L., Efficient and Flexible Incremental Parsing, TOPLAS, 20, 2, (1998), 980--1013.  ",
      "doi": "10.1145/293677.293678"
    }
  ]
}