{
  "doi": "10.1145/1124772.1124960",
  "title": "Getting the right design and the design right",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1243-1252",
  "year": 2006,
  "badges": [],
  "abstract": "We present a study comparing usability testing of a single interface versus three functionally equivalent but stylistically distinct designs. We found that when presented with a single design, users give significantly higher ratings and were more reluctant to criticize than when presented with the same design in a group of three. Our results imply that by presenting users with alternative design solutions, subjective ratings are less prone to inflation and give rise to more and stronger criticisms when appropriate. Contrary to our expectations, our results also suggest that usability testing by itself, even when multiple designs are presented, is not an effective vehicle for soliciting constructive suggestions about how to improve the design from end users. It is a means to identify problems, not provide solutions.",
  "tags": [
    "participatory design",
    "methods",
    "evaluation",
    "user centered design",
    "design",
    "usability testing",
    "prototyping"
  ],
  "authors": [
    {
      "name": "Maryam Tohidi",
      "institution": "University of Toronto, Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481733",
      "orcid": "missing"
    },
    {
      "name": "William Buxton",
      "institution": "Microsoft Research, Toronto, Canada",
      "img": "/do/10.1145/contrib-81452616426/rel-imgonly/81452616426.jpg",
      "acmid": "81452616426",
      "orcid": "0000-0002-0170-7097"
    },
    {
      "name": "Ronald Baecker",
      "institution": "University of Toronto, Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100448368",
      "orcid": "missing"
    },
    {
      "name": "Abigail Sellen",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bowers, J., and Pycock, J. Talking Through Design: Requirements and Resistance in Cooperative Prototyping, Proc. CHI '94, ACM Press, (1994), 299--305.  ",
      "doi": "10.1145/191666.191773"
    },
    {
      "text": "Catani, M.B. and Biers, D.W. Usability evaluation and prototype fidelity: Users and usability professionals, Proc. Human Factors and Ergonomics Society 42nd Annual Meeting, (1998), 1331--1336.",
      "doi": ""
    },
    {
      "text": "Dicks, R.S. Mis-usability: on the uses and misuses of usability testing. Proc. SIGDOC 2002, ACM Press, (2002), 26--30.  ",
      "doi": "10.1145/584955.584960"
    },
    {
      "text": "Erickson, T. Notes on Design Practice: Stories and Prototypes as Catalysts for Communication. In J. Carroll (Ed.). Scenario-Based Design: Envisioning Work and Technology in System Development. New York: Wiley & Sons, (1995), 37--58. ",
      "doi": "10.5555/209227.209231"
    },
    {
      "text": "Hornbæk, K., and Frøkjær, E. Comparing usability problems and redesign proposals as input to practical systems development, Proc. of CHI 2005, ACM Press (2005), 391--400.  ",
      "doi": "10.1145/1054972.1055027"
    },
    {
      "text": "Jensen, S. The Simplicity Shift: Innovative Design Tactics in a Corporate World, Cambridge University Press, (2002), 133--148. ",
      "doi": "10.5555/829569"
    },
    {
      "text": "Nielsen, J. and Desurvire, H. Comparative Design Review: An Exercise in Parallel Design (Panel). Proc. INTERCHI 1993, 414--417.  ",
      "doi": "10.1145/169059.169327"
    },
    {
      "text": "Nielsen, J. Usability Engineering. Academic Press (1993). ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Nielsen, J. Diversified Parallel Design: Contrasting Design Approaches (Panel). Proc. CHI 1994, ACM Press (1994), 179--180.  ",
      "doi": "10.1145/259963.260224"
    },
    {
      "text": "Ovaska, S. and Raiha, K.J. Parallel design in the classroom, Proc. CHI 1995, ACM Press (1995), 264--265.  ",
      "doi": "10.1145/223355.223666"
    },
    {
      "text": "Rettig, M., Prototyping for tiny fingers. Communications of the ACM (CACM), ACM Press (1994), 37(4), 21--27.  ",
      "doi": "10.1145/175276.175288"
    },
    {
      "text": "Rudd, J. Stern, K. and Isensee, S. Low Vs. High-Fidelity Prototyping Debate, Interactions, (1996), 76--85.  ",
      "doi": "10.1145/223500.223514"
    },
    {
      "text": "Sefelin, R., Tscheligi, M., and Giller, V. Paper prototyping -- what is it good for? A comparison of paper-and computer-based prototyping, Proc. CHI 2003, ACM Press (2003), 778--779.  ",
      "doi": "10.1145/765891.765986"
    },
    {
      "text": "Snyder C. Paper Prototyping - The Fast and Easy Way to Design and Refine User Interfaces, Morgan Kaufmann (2003).",
      "doi": ""
    },
    {
      "text": "Walker , M., Takayama, L. and Landay, J.A. High-fidelity or low-fidelity, paper or computer? Choosing attributes when testing web prototypes, Proc. Human Factors and Ergonomics Society 46th Annual Meeting, (2002), 661--665.",
      "doi": ""
    },
    {
      "text": "Wiklund, M., Thurrott, C., and Dumas, J. (1992). Does the Fidelity of Software Prototypes Affect the Perception of Usability? Proc. Human Factors Society 36th Annual Meeting, (1992), 399--403.",
      "doi": ""
    }
  ]
}