{
  "doi": "10.1145/1124772.1124875",
  "title": "Embedded phenomena: supporting science learning with classroom-sized distributed simulations",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "691-700",
  "year": 2006,
  "badges": [],
  "abstract": "'Embedded phenomena' is a learning technology framework in which simulated scientific phenomena are mapped onto the physical space of classrooms. Students monitor and control the local state of the simulation through distributed media positioned around the room, gathering and aggregating evidence to solve problems or answer questions related to those phenomena. Embedded phenomena are persistent, running continuously over weeks and months, creating information channels that are temporally and physically interleaved with, but asynchronous with respect to, the regular flow of instruction. In this paper, we describe the motivations for the framework, describe classroom experiences with three embedded phenomena in the domains of seismology, insect ecology, and astronomy, and situate embedded phenomena within the context of human-computer interaction research in co-located group interfaces and learning technologies.",
  "authors": [
    {
      "name": "Tom Moher",
      "institution": "University of Illinois at Chicago, Chicago, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100538646",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, G. Classroom 2000: An Experiment with the instrumentation of a living educational environment. IBM Systems Journal 38, 4 (1999), 508--530.]]  ",
      "doi": "10.1147/sj.384.0508"
    },
    {
      "text": "Applegate, L., Konsynski, B. and Nunamaker, J. A group decision support system for idea generation and issue analysis in organizational planning. Proc. CSCW 1986, ACM Press (1986), 16--34.]]  ",
      "doi": "10.1145/637069.637073"
    },
    {
      "text": "Barab, S., Hay, K., Squire, K., Barnett, M., Schmidt, R., Karrigan, K., Yamagata-Lynch, L., and Johnson, C. Virtual solar system project: Learning through a technology-rich, inquiry-based, participatory learning environment. Journal of Science Education and Technology 9, 1 (2000), 7--25.]]",
      "doi": ""
    },
    {
      "text": "Begeman, M., Cool, P., Ellis, C., Graf, M., Rein, G., and Smith, T. Project NICK: Meeting augmentation and analysis. Proc. CSCW 1986, ACM Press (1986), 1--5.]]  ",
      "doi": "10.1145/637069.637071"
    },
    {
      "text": "Bransford, J., Brown, A. and Cocking, R Eds. How People Learn. Washington, DC: National Academy Press (1999).]]",
      "doi": ""
    },
    {
      "text": "Colella, V. Participatory Simulations: Building collaborative understanding through immersive dynamic modeling. Journal of the Learning Sciences 9, 4 (2000), 471--500.]]",
      "doi": ""
    },
    {
      "text": "Collins, A., Brown, J., and Holum, A. Cognitive apprenticeship: Making thinking visible. American Educator 6, 11 (1991), 38--46.]]",
      "doi": ""
    },
    {
      "text": "Danesh, A., Inkpen, K., Lau, F., Shu, K., and Booth, K. Geney: Designing a collaborative activity for the Palm handheld computer. Proc. CHI 2002, ACM Press (2002), 388--395.]]  ",
      "doi": "10.1145/365024.365303"
    },
    {
      "text": "Dede, C., Salzman, M., Loftin, R. B., and Ash, K. Using virtual reality technology to convey abstract scientific concepts. In Jacobson, M. J., Kozma, R. B. (Ed.), Learning the Sciences of the 21 Century, Lawrence Erlbaum (1997).]]",
      "doi": ""
    },
    {
      "text": "Dewey, J. How we think (Rev. Ed.). Houghton Mifflin (1933/1998).]]",
      "doi": ""
    },
    {
      "text": "DiSessa, A. On learnable representations of knowledge: A meaning for the computational metaphor. MIT, AI Laboratory, LOGO Memo 47 (1997).]]",
      "doi": ""
    },
    {
      "text": "Donovan, J. and Radosevich, D. A meta-analytic review of the distribution of practice effect: Now you see it, now you don't. Journal of Applied Psychology 84, 5 (1999), 795--805.]]",
      "doi": ""
    },
    {
      "text": "Dourish, P. Where The Action Is: The Foundations of Embodied Interaction, MIT Press (2001).]] ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Dufresne, R., Gerace, W., Leonard, W., Mestre, J. and Wenk, L. Classtalk: A classroom communication system for active learning. Journal of Computing in Higher Education 7, 2 (1996), 3--47.]]",
      "doi": ""
    },
    {
      "text": "Fass, A., Forlizzi, J., and Pausch, R. MessyDesk and MessyBoard: Two designs inspired by the goal of improving human memory. Proc. DIS 2002, ACM Press (2002), 303--311.]]  ",
      "doi": "10.1145/778712.778754"
    },
    {
      "text": "Fraser, B. Test of science related skills. The Australian Council for Educational Research Limited: Hawthorn, Victoria (1981).]]",
      "doi": ""
    },
    {
      "text": "Greenberg, S. and Rounding, M. The Notification Collage: Posting information to public and personal displays. Proc. CHI 2001, ACM Press (2001), 514--521.]]  ",
      "doi": "10.1145/365024.365339"
    },
    {
      "text": "Grudin, J. Partitioning digital worlds: focal and peripheral awareness in multiple monitor use. Proc. CHI 2001, ACM Press (2001), 458--465.]]  ",
      "doi": "10.1145/365024.365312"
    },
    {
      "text": "Huang, E. and Mynatt, E. Semi-public displays for small, co-located groups. Proc. CHI 2003, ACM Press (2003), 49--56.]]  ",
      "doi": "10.1145/642611.642622"
    },
    {
      "text": "Johanson, B., Fox, A., and Winograd, T. The Interactive Workspaces Project: Experiences with Ubiquitous Computing Rooms. IEEE Pervasive Computing 1, 2 (2002), 67--74.]]  ",
      "doi": "10.1109/MPRV.2002.1012339"
    },
    {
      "text": "Kam, M, Wang, J., Iles, A., Tse, E., Chiu, J., Glaser, D., Tarshish, O., and Canny, J. Livenotes: a system for cooperative and augmented note-taking in lectures. Proc. CHI 2005, ACM Press (2005), 531--540.]]  ",
      "doi": "10.1145/1054972.1055046"
    },
    {
      "text": "Kay, A. Computers, networks and education. Scientific American 265, 3(1991), 138--148.]]",
      "doi": ""
    },
    {
      "text": "Klopfer, E., Squire, K., and Jenkins, H. Environmental Detectives: PDAs as a window into a virtual simulated world. Proc. WMTE'02 (2002), 95--98.]] ",
      "doi": "10.5555/645964.674392"
    },
    {
      "text": "Kraemer, K. and King, J. Computer-based systems for cooperative work and group decision making. ACM Comput. Surv. 20, 2(1988), 115--146.]]  ",
      "doi": "10.1145/46157.46158"
    },
    {
      "text": "Lave, J. and Wenger, E. Situated Learning: Legitimate Peripheral Participation. Cambridge, UK: Cambridge University Press (1990).]]",
      "doi": ""
    },
    {
      "text": "Mankoff, J., Dey, A.K., Hsieh, G., Kientz, J., Ames, M., Lederer, S. Heuristic evaluation of ambient displays. Proc. CHI 2003, ACM Press (2003), 169--176.]]  ",
      "doi": "10.1145/642611.642642"
    },
    {
      "text": "Moher, T., Hussain, S., Halter, T., and Kilb, D. Roomquake: embedding dynamic phenomena within the physical space of an elementary school classroom. Ext. Abstracts CHI 2005, ACM Press (2005), 1665--1668.]]  ",
      "doi": "10.1145/1056808.1056992"
    },
    {
      "text": "Papert, S. Mindstorms: Children, computers, and powerful ideas. New York: Basic Books (1980).]] ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Price, S. and Rogers, Y. Let's get physical: the learning benefits of interacting in digitally augmented physical spaces. Computers and Education 43, 1-2 (2003), 137--151.]]  ",
      "doi": "10.1016/j.compedu.2003.12.009"
    },
    {
      "text": "Price, S., Rogers, Y., Scaife, M., Stanton, D., and Neale. H. Using 'Tangibles' to promote novel forms of playful learning. Interacting with Computers 15, 2 (2003), 169--185.]]",
      "doi": ""
    },
    {
      "text": "Randell, C., Ted Phelps, T. and Rogers, Y. Ambient Wood: Demonstration of a digitally enhanced field trip for schoolchildren. Adjunct Proc. IEEE UbiComp 2003, IEEE Press (2003), 100--104.]]",
      "doi": ""
    },
    {
      "text": "Ratto, M., Shapiro R.B., Truong, T. and Griswold, W. The ActiveClass project: Experiments in encouraging classroom participation. Proc. CSCL 2003, Kluwer (2003), 477--486.]]",
      "doi": ""
    },
    {
      "text": "Resnick, M. and Wilensky, U. Diving into Complexity: Developing Probabilistic decentralized thinking through role-playing activities. Journal of the Learning Sciences 7, 2 (1997), 153--172.]]",
      "doi": ""
    },
    {
      "text": "Rogers, Y. and Price, S. Extending and augmenting scientific enquiry through pervasive kearning environments. Children Youth and Environments 14, 2 (2004), 67--83.]]",
      "doi": ""
    },
    {
      "text": "Roschelle, J. and Pea, R. A walk on the WILD side: How wireless handhelds may change computer-supported collaborative learning. International Journal of Cognition and Technology 1, 1 (2002), 145--168.]]",
      "doi": ""
    },
    {
      "text": "Slater, M. and Wilbur, S. A Framework for Immersive Virtual Environments (FIVE): Speculations on the role of presence in virtual environments. Presence 6, 6 (1997), 603--616.]]",
      "doi": "10.1162/pres.1997.6.6.603"
    },
    {
      "text": "Soloway, E., Guzdial, M., and Hay, K. Learner-centered design: The challenge for HCI in the 21st century. Interactions 1, 2 (1994), 36--48.]]  ",
      "doi": "10.1145/174809.174813"
    },
    {
      "text": "Stefik, M., Foster, G., Bobrow, D., Kahn, K., Lanning, S., and Suchman, L. Beyond the chalkboard: Computer support for collaboration and problem solving in meetings. Commun. ACM 30, 1 (1987), 32--47.]]  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "Stewart, J., Bederson, B. and Druin, A. Single Display Groupware: A model for co-present collaboration. Proc. CHI 1999, ACM Press (1999), 286--293.]]  ",
      "doi": "10.1145/302979.303064"
    },
    {
      "text": "Streitz, N., Geißler, J., Holmer, T., Konomi, S., Müller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P. and Steinmetz, R. i-LAND: An interactive landscape for creativity and innovation. Proc. CHI 1999, ACM Press (1999), 120--127.]]  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Vahey, P., Tatar, D. and Roschelle, J. Leveraging Handhelds to Increase Student Learning: Engaging middle school students with the mathematics of change. Proc. ICLS 2004, Lawrence Erlbaum (2004), 553--560.]] ",
      "doi": "10.5555/1149126.1149194"
    },
    {
      "text": "Vath, R., Lyons, L., Lee, J., Kawamura, M., Quintana, C., and Soloway, E. Addressing assessment challenges for a multi-user simulation with handheld integration (MUSHI) USA. Proc. IDC 2005, ACM Press (2005).]]",
      "doi": ""
    },
    {
      "text": "Vygotsky, L. Mind in society. Cambridge, MA: Harvard University Press (1978).]]",
      "doi": ""
    },
    {
      "text": "Wilensky, U. and Stroup, W. Learning through participatory simulations: Network-based design for systems learning in classrooms. Proc. CSCL 1999, (1999), 667--676.]] ",
      "doi": "10.5555/1150240.1150320"
    },
    {
      "text": "Wilensky, U. and Stroup, W. Networked gridlock: Students enacting complex dynamic phenomena with the HubNet architecture. Proc. ICLS 2000, Lawrence Erlbaum Associates (2000), 282--289.]]",
      "doi": ""
    },
    {
      "text": "Wilson, M. Six views of embodied cognition. Psychonomic Bulletin and Review 9, 4 (2002), 625--636.]]",
      "doi": ""
    },
    {
      "text": "Wisneski, C., lshii, H., Dahley, A., Gorbet, M., Brave, S., Ullmer, B., and Yarin, P. Ambient displays: Turning architectural space into an interface between people and digital information. Proc. International Workshop on Cooperative Buildings (1998), 22--32.]] ",
      "doi": "10.5555/645968.674740"
    }
  ]
}