{
  "doi": "10.1145/1124772.1124893",
  "title": "Keeping up appearances: understanding the dimensions of incidental information privacy",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "821-830",
  "year": 2006,
  "badges": [],
  "abstract": "We conducted a survey of 155 participants to examine privacy concerns relating to the viewing of incidental information (i.e. traces of previous activity unrelated to the task at hand) in web browsers. We have identified several dimensions of privacy for this domain. Results revealed the scope of this problem and how location and device affect web browsing activity and contribute to the types of incidental information that may be visible. We found that there are different privacy comfort levels inherent to the participant and dependent on the context of subsequent viewing of incidental information, including the sensitivity of the content, their relationship to the viewer and the level of control retained over input devices.",
  "authors": [
    {
      "name": "Kirstie Hawkey",
      "institution": "Dalhousie University, Halifax, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100432724",
      "orcid": "missing"
    },
    {
      "name": "Kori M. Inkpen",
      "institution": "Dalhousie University, Halifax, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519232",
      "orcid": "0000-0001-5661-4659"
    }
  ],
  "references": [
    {
      "text": "Platform for Privacy Preferences (P3P) Project. http://www.w3.org/P3P/.",
      "doi": ""
    },
    {
      "text": "WebRoot Software | Window Washer. http://www.webroot.com/consumer/products/windowwasher/.",
      "doi": ""
    },
    {
      "text": "Ackerman, M., Cranor, L. and Reagle, J. Privacy in E-Commerce: Examining User Scenarios and Privacy Preferences. In Proc. of EC '99, ACM Press (1999), 1--8.  ",
      "doi": "10.1145/336992.336995"
    },
    {
      "text": "Acquisti, A. Privacy in Electronic Commerce and the Economics of Immediate Gratification. In Proc. of EC '04, ACM Press (2004), 21--29.  ",
      "doi": "10.1145/988772.988777"
    },
    {
      "text": "Begole, J., Tang, J.C. and Hill, R. Rhythm Modeling, Visualizations and Applications. In Proc. of UIST 2003, ACM Press (2003), 11--20.  ",
      "doi": "10.1145/964696.964698"
    },
    {
      "text": "Boardman, R. and Sasse, M.A. \"\"Stuff Goes Into the Computer and Doesn't Come Out\"\": A Cross-tool Study of Personal Information Management. In Proc. of CHI '04, ACM Press (2004), 583--590.  ",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Cadiz, J. and Gupta, A. Privacy Interfaces for Collaboration. Microsoft Research. MSR-TR-2001-82 (2001).",
      "doi": ""
    },
    {
      "text": "Carini, R.M., Hayek, J.C., Kuh, G.D., Kennedy, J.M. and Ouimet, J.A. College Student Responses to Web and Paper Surveys: Does Mode Matter? Research in Higher Education 44, 1 (2003), 1--19.",
      "doi": ""
    },
    {
      "text": "Consolvo, S., Smith, I.E., Matthews, T., LaMarca, A., Tabert, J. and Powledge, P. Location Disclosure to Social Relations: Why, When, & What People Want to Share. In Proc. of CHI '05, ACM Press (2005), 81--90.  ",
      "doi": "10.1145/1054972.1054985"
    },
    {
      "text": "Goffman, E. The Presentation of Self in Everyday Life. Doubleday Anchor Books, Garden City, New York, 1959.",
      "doi": ""
    },
    {
      "text": "Hawkey, K. and Inkpen, K. Privacy Gradients: Exploring ways to manage incidental information during co-located collaboration. Ext. Abstracts CHI 2005, ACM Press (2005), 1431--1434.  ",
      "doi": "10.1145/1056808.1056934"
    },
    {
      "text": "Hawkey, K. and Inkpen, K. Web Browsing Today: The impact of changing contexts on user activity. Ext. Abstracts CHI 2005, ACM Press (2005), 1443--1446.  ",
      "doi": "10.1145/1056808.1056937"
    },
    {
      "text": "Hinckley, K. Distributed and Local Sensing Techniques for Face-to-Face Collaboration. In Proc. of ICMI '03, ACM Press (2003), 81--84.  ",
      "doi": "10.1145/958432.958450"
    },
    {
      "text": "Huang, E.M. and Mynatt, E.D. Semi-Public Displays for Small, Co-located Groups. In Proc. of CHI '03, ACM Press (2003), 49--56.  ",
      "doi": "10.1145/642611.642622"
    },
    {
      "text": "Jensen, C., Potts, C. and Jensen, C. Privacy practices of Internet users: Self-reports versus observed behavior. International Journal of Human-Computer Studies 63, (2005), 203--227.  ",
      "doi": "10.1016/j.ijhcs.2005.04.019"
    },
    {
      "text": "Kaasten, S., Greenberg, S. and Edwards, C. How People Recognize Previously Seen WWW Pages from Titles, URLs and Thumbnails. In Proc. of Human Computer Interaction 2002, Springer Verlag (2002), 247--265.",
      "doi": ""
    },
    {
      "text": "Lau, T., Etzioni, O. and Weld, D.S. Privacy Interfaces for Information Management. Communications of the ACM 42, 10 (1999), 89--94.  ",
      "doi": "10.1145/317665.317680"
    },
    {
      "text": "Lederer, S., Mankoff, J. and Dey, A.K. Towards a Deconstruction of the Privacy Space. Workshop on Ubicomp Communities: Privacy as Boundary Negotiation, UBICOMP 2003, http://guir.berkeley.edu/pubs/ubicomp2003/privacyworkshop/papers/lederer-privacyspace.pdf (2003).",
      "doi": ""
    },
    {
      "text": "Lederer, S., Mankoff, J. and Dey, A.K. Who Wants to Know What When? Privacy Preference Determinants in Ubiquitous Computing. Ext. Abstracts CHI 2003, ACM Press (2003), 724--725.  ",
      "doi": "10.1145/765891.765952"
    },
    {
      "text": "Moor, J.H. Towards a theory of privacy in the information age. ACM SIGCAS Computers and Society 27, 3 (1997), 27--32.  ",
      "doi": "10.1145/270858.270866"
    },
    {
      "text": "Olson, J.S., Grudin, J. and Horvitz, E. A Study of Preferences for Sharing and Privacy. Ext. Abstracts of CHI '05, ACM Press (2005), 1985--1988.  ",
      "doi": "10.1145/1056808.1057073"
    },
    {
      "text": "P&AB Consumer Privacy Attitudes: A Major Shift Since 2000 and Why. Privacy & American Business Newsletter 10, 6 (2003), 1,3--5.",
      "doi": ""
    },
    {
      "text": "Palen, L. and Dourish, P. Unpacking \"\"Privacy\"\" for a Networked World. In Proc. of CHI '03, ACM Press (2003), 129--136.  ",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Patil, S. and Lai, J. Who Gets to Know What When: Configuring Privacy Permissions in an Awareness Application. In Proc. of CHI '05, ACM Press (2005), 101--110.  ",
      "doi": "10.1145/1054972.1054987"
    },
    {
      "text": "Shoemaker, G.B.D. and Inkpen, K.M. Single Display Privacyware: Augmenting Public Displays with Private Information. In Proc. of CHI '01, ACM Press (2001), 522-529.  ",
      "doi": "10.1145/365024.365349"
    },
    {
      "text": "Spiekermann, S., Grossklags, J. and Berendt, B. E-privacy in 2nd Generation E-Commerce: Privacy Preferences versus actual Behavior. In Proc. of EC '01, ACM Press (2001), 38--47.  ",
      "doi": "10.1145/501158.501163"
    },
    {
      "text": "Household Internet use at home by Internet activity. http://www40.statcan.ca/l01/cst01/comm09a.htm.",
      "doi": ""
    },
    {
      "text": "Household Internet use by location of access. http://www40.statcan.ca/l01/cst01/comm12a.htm.",
      "doi": ""
    },
    {
      "text": "Turner, C.F., Ku, L., Rogers, S.M., Lindberg, L.D., Pleck, J.H. and Sonenstein, F.L. Adolescent sexual behaviour, drug use, & violence: Increased reporting with computer survey technology. Science 280, (1998), 867--873.",
      "doi": ""
    },
    {
      "text": "Weisband, S.P. and Reinig, B.A. Managing User Perceptions of Email Privacy. Communications of the ACM 38, 12 (1995), 40--47.  ",
      "doi": "10.1145/219663.219678"
    }
  ]
}