{
  "doi": "10.1145/1124772.1124866",
  "title": "Generating automated predictions of behavior strategically adapted to specific performance objectives",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "621-630",
  "year": 2006,
  "badges": [],
  "abstract": "It has been well established in Cognitive Psychology that humans are able to strategically adapt performance, even highly skilled performance, to meet explicit task goals such as being accurate (rather than fast). This paper describes a new capability for generating multiple human performance predictions from a single task specification as a function of different performance objective functions. As a demonstration of this capability, the Cognitive Constraint Modeling approach was used to develop models for several tasks across two interfaces from the aviation domain. Performance objectives are explicitly declared as part of the model, and the CORE (Constraint-based Optimal Reasoning Engine) architecture itself formally derives the detailed strategies that are maximally adapted to these objectives. The models are analyzed for emergent strategic variation, comparing those optimized for task time with those optimized for working memory load. The approach has potential application in user interface and procedure design.",
  "authors": [
    {
      "name": "Katherine Eng",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100112437",
      "orcid": "missing"
    },
    {
      "name": "Richard L. Lewis",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100350115",
      "orcid": "missing"
    },
    {
      "name": "Irene Tollinger",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100374934",
      "orcid": "missing"
    },
    {
      "name": "Alina Chu",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311486774",
      "orcid": "missing"
    },
    {
      "name": "Andrew Howes",
      "institution": "Manchester University, Manchester, UK",
      "img": "/do/10.1145/contrib-81100489674/rel-imgonly/mypicture.jpg",
      "acmid": "81100489674",
      "orcid": "0000-0003-4251-1127"
    },
    {
      "name": "Alonso Vera",
      "institution": "NASA Ames Research Center, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100219909",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R. The Adaptive Character of Thought. Lawrence Erlbaum Associates, Hillsdale, NJ, USA (1990).",
      "doi": ""
    },
    {
      "text": "Anderson, J.R., Bothell, D., Byrne, M.D., Douglass, S., Lebiere, C., & Qin, Y . An integrated theory of the mind. Psychological Review 111, 4 (2004), 1036--1060.",
      "doi": ""
    },
    {
      "text": "Byrne, M.D. and Bovair, S. A working memory model of a common procedural error. Cognitive Science 21, 1 (1997), 31--61.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T.P. and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, NJ, USA (1983). ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Engle, R.W. Working memory capacity as executive attention. Current Directions in Psychological Science 11, 1 (2002), 19 -- 23.",
      "doi": ""
    },
    {
      "text": "Gray, W.D. and Boehm-Davis, D. A. (2000). Milliseconds matter: An introduction to microstrategies and to their use in describing and predicting interactive behavior. Journal of Experimental Psychology: Applied, 6 (4), 322--335.",
      "doi": ""
    },
    {
      "text": "Gray, W.D., John, B.E., and Atwood, M.E. Project Ernestine: Validating GOMS for predicting and explaining real-world task performance. Human Computer Interaction 8, 3 (1993), 237--309.",
      "doi": "10.1207/s15327051hci0803_3"
    },
    {
      "text": "Howes, A., Lewis, R.L, Vera, A.H., and Richardson, J. Information-Requirements Grammar: A theory of the structure of competence for interaction. In Proc. Of CogSci 2005, Lawrence Erlbaum Associates (2005).",
      "doi": ""
    },
    {
      "text": "Howes, A., Vera, A., Lewis, R.L., and McCurdy, M. Cognitive constraint modeling: A formal approach to reasoning about behavior. In Proc. of CogSci 2004, Lawrence Erlbaum Associates (2004).",
      "doi": ""
    },
    {
      "text": "John, B.E. and Kieras, D.E. (1996) The GOMS family of user interface analysis techniques: Comparison and Contrast. ACM Transactions on Computer-Human Interaction., 3 (4), pp. 320--351.  ",
      "doi": "10.1145/235833.236054"
    },
    {
      "text": "John, B.E., Prevas, K., Salvucci, D.D., and Koedinger, K. Predictive Human Performance Modeling Made Easy. In Proc. of CHI 2004, ACM Press (2004).  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "John, B.E., Vera, A.H., and Newell, A. Toward real-time GOMS: A model of expert behavior in a highly interactive task. Behavior and Information Technology 13, 4 (1994).",
      "doi": ""
    },
    {
      "text": "Kane, M.J. and Engle, R.W. Working-memory capacity and the control of attention: The contributions of goal neglect, response competition, and task set to Stroop interference. Journal of Experimental Psychology 132, 1 (2003), 47--70.",
      "doi": ""
    },
    {
      "text": "Kieras, D.E. and Meyer, D.E. Predicting human performance on dual-task tracking and decision making with computational models using the EPIC architecture. International Symposium on Command and Control Research and Technology. National Defense University, Washington D.C. (1995).",
      "doi": ""
    },
    {
      "text": "Kieras, D.E. and Meyer, D.E. A computational theory of executive cognitive processes and multiple-task performance. Psychological Review 104, 1 (1997), 3--65.",
      "doi": ""
    },
    {
      "text": "Lewis, R.L., Newell, A., and Polk, T. Toward a Soar theory of taking instructions for immediate reasoning tasks. In Proc. of CogSci 1989, 514--521.",
      "doi": ""
    },
    {
      "text": "Lewis, R.L., Vera, A.H., and Howes, A. A constraint-based approach to understanding the composition of skill. In Proc. of ICCM 2004.",
      "doi": ""
    },
    {
      "text": "Models of Working Memory: Mechanisms of Active Maintenance and Executive Control. Akira Miyake and Priti Shah (eds). Cambridge University Press, New York, NY, USA, 1999.",
      "doi": ""
    },
    {
      "text": "Newell, A. (1990). Unified Theories of Cognition. Harvard University Press. Cambridge, Massachusetts ",
      "doi": "10.5555/86564"
    },
    {
      "text": "Ritter, F.E., Van Rooy, D., and St. Amant, R.A. User modeling design tool based on a cognitive architecture for comparing interfaces. In Proc. of the International Conference on Computer-Aided Design of User Interfaces 2002, 111--118.",
      "doi": ""
    },
    {
      "text": "Schumacher, E.H. Seymour, T.L., Glass, J.M., Fencsik, D.E., Lauber, E.J., Kieras, D.E., and Meyer, D.E. Virtually perfect time sharing in dual-task performance: Uncorking the central cognitive bottleneck. Psychological Science 12, 2 (2001), 101--108.",
      "doi": ""
    },
    {
      "text": "Simon, H.A., & Hayes, J.R. (1976). Understanding complex task instructions. In D. Klahr (Ed.), Cognition and instruction (Chap. 14). Hillsdale, NJ: Erlbaum.",
      "doi": ""
    },
    {
      "text": "Taatgen, N.A. Modeling parallelization and flexibility improvements in skill acquisition: from dual tasks to complex dynamic skills. Cognitive Science (2005), 421--455.",
      "doi": ""
    },
    {
      "text": "Tollinger, I., Lewis, R., McCurdy, M., Tollinger, P. Vera, A., Howes, A., Pelton, L. Supporting efficient development of cognitive models at multiple skill levels: Exploring recent advances in constraint-based modeling. In Proc. of CHI 2005, ACM Press (2005).  ",
      "doi": "10.1145/1054972.1055029"
    },
    {
      "text": "Vera, A.H., Howes, A., McCurdy, M., and Lewis, R.L. A constraint satisfaction approach to predicting skilled interactive cognition. In Proc. of CHI 2004, ACM Press (2004).  ",
      "doi": "10.1145/985692.985708"
    },
    {
      "text": "Vera, A.H., Tollinger, I., Eng, K., Lewis, R., and Howes, A. Architectural building blocks as the locus of adaptive behavior. In Proc. Of CogSci 2005, Lawrence Erlbaum Associates (2005).",
      "doi": ""
    },
    {
      "text": "Wickens, C. D., Seidler, K. S. Information access in a dual-task context: testing a model of optimal strategy selection. Jounal of Experimental Psychology: Applied 3, 3 (1997), 196--215.",
      "doi": ""
    }
  ]
}