{
  "doi": "10.1145/1124772.1124808",
  "title": "Tinkering and gender in end-user programmers' debugging",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "231-240",
  "year": 2006,
  "badges": [],
  "abstract": "Earlier research on gender effects with software features intended to help problem-solvers in end-user debugging environments has shown that females are less likely to use unfamiliar software features. This poses a serious problem because these features may be key to helping them with debugging problems. Contrasting this with research documenting males' inclination for tinkering in unfamiliar environments, the question arises as to whether encouraging tinkering with new features would help females overcome the factors, such as low self-efficacy, that led to the earlier results. In this paper, we present an experiment with males and females in an end-user debugging setting, and investigate how tinkering behavior impacts several measures of their debugging success. Our results show that the factors of tinkering, reflection, and self-efficacy, can combine in multiple ways to impact debugging effectiveness differently for males than for females.",
  "tags": [
    "surprise-explain-reward",
    "tinkering",
    "debugging",
    "end-user programming",
    "gender",
    "end-user software engineering",
    "self-efficacy"
  ],
  "authors": [
    {
      "name": "Laura Beckwith",
      "institution": "Oregon State University, Corvallis, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100022759",
      "orcid": "missing"
    },
    {
      "name": "Cory Kissinger",
      "institution": "Oregon State University, Corvallis, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519842",
      "orcid": "missing"
    },
    {
      "name": "Margaret Burnett",
      "institution": "Oregon State University, Corvallis, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100337865",
      "orcid": "missing"
    },
    {
      "name": "Susan Wiedenbeck",
      "institution": "Drexel University, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100387125",
      "orcid": "missing"
    },
    {
      "name": "Joseph Lawrance",
      "institution": "Oregon State University, Corvallis, OR",
      "img": "/do/10.1145/contrib-81100235486/rel-imgonly/me.png",
      "acmid": "81100235486",
      "orcid": "missing"
    },
    {
      "name": "Alan Blackwell",
      "institution": "University of Cambridge, Cambridge, UK",
      "img": "/do/10.1145/contrib-81100022210/rel-imgonly/alanblackwell-yardley2015.jpg",
      "acmid": "81100022210",
      "orcid": "missing"
    },
    {
      "name": "Curtis Cook",
      "institution": "Oregon State University, Corvallis, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452601376",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bandura, A. Social Foundations of Thought and Action. Prentice Hall, Englewood Cliffs, NJ, 1986.",
      "doi": ""
    },
    {
      "text": "Beckwith, L. and Burnett M. Gender: An important factor in end-user programming environments? In Proc. Visual Languages and Human-Centric Computing, IEEE (2004), 107--114.  ",
      "doi": "10.1109/VLHCC.2004.28"
    },
    {
      "text": "Beckwith, L. Burnett, M., Wiedenbeck, S., Cook, C., Sorte, S., and Hastings, M. Effectiveness of end-user debugging software features: Are there gender issues? In Proc. CHI 2005, ACM Press (2005), 869--878.  ",
      "doi": "10.1145/1054972.1055094"
    },
    {
      "text": "Beckwith, L., Sorte, S., Burnett, M., Wiedenbeck, S., Chintakovid, T. and Cook, C. Designing features for both genders in end-user programming environments. In Proc. Visual Languages and Human-Centric Computing, IEEE (2005), 153--160.  ",
      "doi": "10.1109/VLHCC.2005.31"
    },
    {
      "text": "Ben-Ari, M. Bricolage forever! In Proc. of the 11th Annual Workshop of the Psychology of Programming Interest Group, (1999), 53--57.",
      "doi": ""
    },
    {
      "text": "Burnett, M., Cook, C. and Rothermel G. End-user software engineering. Comm. of the ACM 47, 9 (2004), 53--58.  ",
      "doi": "10.1145/1015864.1015889"
    },
    {
      "text": "Compeau, D. and Higgins, C. Computer self-efficacy: Development of a measure and initial test. MIS Quarterly 19, 2 (1995), 189--211.  ",
      "doi": "10.2307/249688"
    },
    {
      "text": "Fisher, A., Margolis, J. and Miller, F. Undergraduate women in computer science: Experience, motivation, and culture. In Proc. SIGCSE Technical Symposium on Computer Science Education, ACM Press (1997), 106--110.  ",
      "doi": "10.1145/268084.268127"
    },
    {
      "text": "Huff, C. Gender, software design, and occupational equity. ACM SIGCSE Bulletin 34, 2 (2002), 112--115.  ",
      "doi": "10.1145/543812.543842"
    },
    {
      "text": "Jones, M. G., Brader-Araje, L., Carboni, L. W., Carter, G., Rua, M. J., Banilower, E. and Hatch, H. Tool time: Gender and students' use of tools, control, and authority. Journal of Research in Science Teaching 37, 8 (2000), 760--783.",
      "doi": ""
    },
    {
      "text": "Kahn, K. Drawings on napkins, video-game animation, and other ways to program computers. Comm. of the ACM 39, 8 (1996), 49--59.  ",
      "doi": "10.1145/232014.232028"
    },
    {
      "text": "Kelleher, C. and Pausch, R. Stencils-based tutorials: Design and evaluation. In Proc. CHI 2005, ACM Press (2005), 541--550.  ",
      "doi": "10.1145/1054972.1055047"
    },
    {
      "text": "Ko, A.J. and Myers, B.A. Designing the Whyline: A debugging interface for asking questions about program failures. In Proc. CHI 2004, ACM Press (2004), 151--158.  ",
      "doi": "10.1145/985692.985712"
    },
    {
      "text": "Lepper, M.R. and Malone, T.W. Intrinsic motivation and instructional effectiveness in computer-based education. In R.E. Snow and M.J. Farr (Eds.), Aptitude, Learning, and Instruction: Vol. 3. Conative and Affective process Analyses, 255--286. Lawrence Erlbaum, Hillsdale, NJ, 1987.",
      "doi": ""
    },
    {
      "text": "Malone, T.W. and Lepper, M.R. Making learning fun: A taxonomy of intrinsic motivations for learning. In R.E. Snow and M.J. Farr (Eds.), Aptitude, Learning and Instruction. Volume 3: Conative and Affective Process Analysis, 223--253. Lawrence Erlbaum, Hillsdale, NJ, 1987.",
      "doi": ""
    },
    {
      "text": "Martinson, A.M. Playing with technology: Designing gender sensitive games to close the gender gap. Working Paper SLISWP-03-05, School of Library and Information Science, Indiana University, http://www.slis.indiana.edu/research/working_papers/files/SLISWP-03-05.pdf, accessed Sept., 12, 2005.",
      "doi": ""
    },
    {
      "text": "Martocchio, J.J. and Webster, J. Effects of feedback and playfulness on performance in microcomputer software training. Personnel Psychology 45, (1992), 553--578.",
      "doi": ""
    },
    {
      "text": "Panko, R. What we know about spreadsheet errors. Journal of End User Computing 10, 2 (1998), 15--21. ",
      "doi": "10.5555/287893.287899"
    },
    {
      "text": "Rowe, M.B. Teaching Science as Continuous Inquiry: A Basic (2nd ed.). McGraw-Hill, New York, NY 1978.",
      "doi": ""
    },
    {
      "text": "Ruthruff, J., Phalgune, A., Beckwith, L., Burnett, M. and Cook, C. Rewarding 'good' behavior: End-user de¬bugging and rewards. In Proc. Visual Languages and Human-Centric Computing, IEEE (2004), 115--122.  ",
      "doi": "10.1109/VLHCC.2004.44"
    },
    {
      "text": "Tillberg, H.K. and Cohoon, J.M. Attracting women to the CS major. Frontiers: A Journal of Women Studies 26, 1 (2005), 126--140.",
      "doi": ""
    },
    {
      "text": "Turkle, S. and Papert, S. Epistemological pluralism and the revaluation of the concrete. Journal of Mathematical Behavior 11, 1 (1992), 3-33. Available online at http://www.papert.org/articles/EpistemologicalPluralism.html",
      "doi": ""
    },
    {
      "text": "Van Den Heuvel-Panheizen, M. Girls' and boys' problems: Gender differences in solving problems in primary school mathematics in the Netherlands. In T. Nunes and P. Bryant (Eds.), Learning and Teaching Mathematics: An International Perspective, 223--253. Psychology Press, UK, 1999.",
      "doi": ""
    },
    {
      "text": "Wagner, E.J. and Lieberman, H. Supporting user hypotheses in problem diagnosis on the web and elsewhere. In Proc. of the International Conference on Intelligent User Interfaces, ACM Press (2004), 30--37.  ",
      "doi": "10.1145/964442.964450"
    },
    {
      "text": "Washington Post. Tapping Into Tinkering: Some Makers of Electronics Benefit From Users' Modifications. July 12, 2005.",
      "doi": ""
    },
    {
      "text": "Webster, J. and Martocchio, J.J. Turning work into play: implications for microcomputer software training. Journal of Management 19, 1 (1993), 127--146.",
      "doi": ""
    },
    {
      "text": "Whitworth, J.E., Price, B.A. and Randall, C.H. Factors that affect college of business student opinion of teaching and learning. Journal of Education for Business 77, 5 (2002), 282--289.",
      "doi": ""
    },
    {
      "text": "Wilson, A., Burnett, M., Beckwith, L., Granatir, O., Casburn, L., Cook, C., Durham, M. and Rothermel, G. Harnessing curiosity to increase correctness in end-user programming. In Proc. CHI 2003, ACM Press (2003), 305--312.  ",
      "doi": "10.1145/642611.642665"
    }
  ]
}