{
  "doi": "10.1145/1124772.1124915",
  "title": "Motivating participation by displaying the value of contribution",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "955-958",
  "year": 2006,
  "badges": [],
  "abstract": "One of the important challenges faced by designers of online communities is eliciting sufficent contributions from community members. Users in online communities may have difficulty either in finding opportunities to add value, or in understanding the value of their contributions to the community. Various social science theories suggest that showing users different perspectives on the value they add to the community will lead to differing amounts of contribution. The present study investigates a design augmentation for an existing community Web site that could benefit from additional contribution. The augmented interface includes individualized opportunities for contribution and an estimate of the value of each contribution to the community. The value is computed in one of four different ways: (1) value to self; (2) value to a small group the user has affinity with; (3) value to a small group the user does not have affinity with; and (4) value to the entire user community. The study compares the effectiveness of the different notions of value to 160 community members.",
  "authors": [
    {
      "name": "Al M. Rashid",
      "institution": "University of Minnesota",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280081",
      "orcid": "missing"
    },
    {
      "name": "Kimberly Ling",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311482267",
      "orcid": "missing"
    },
    {
      "name": "Regina D. Tassone",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485160",
      "orcid": "missing"
    },
    {
      "name": "Paul Resnick",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/do/10.1145/contrib-81100225915/rel-imgonly/resnick_paul_5x7.jpeg",
      "acmid": "81100225915",
      "orcid": "missing"
    },
    {
      "name": "Robert Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "John Riedl",
      "institution": "University of Minnesota",
      "img": "/do/10.1145/contrib-81100096968/rel-imgonly/dsc_0133_riedl1_small.jpg",
      "acmid": "81100096968",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "E. Adar and B. A. Huberman. Free riding on gnutella. First Monday, July 2005.",
      "doi": ""
    },
    {
      "text": "B. Butler. The dynamics of cyberspace: Examining and modeling the dynamics of online social structure. Ph.D. Thesis, Carnegie Mellon University, Pittsburgh, 1999.",
      "doi": ""
    },
    {
      "text": "J J. Brehm. A theory of psychological reactance. Academic Press, 1966.",
      "doi": ""
    },
    {
      "text": "S. J. Karau and K. D. Williams. Social loafing: A meta-analytic review and theoretical integration. Journal of Personality and Social Psychology, 65:681--706, 1993.",
      "doi": ""
    },
    {
      "text": "K. Ling, G. Beenen, P. Ludford, X. Wang, K. Chang, X. Li, D. Cosley, D. Frakowski, L. Terveen, A. M. Rashid, P. Resnick, and R. Kraut. Using social psychology to motivate contributions to online communities. JCMC, 10(4), 2005.",
      "doi": ""
    },
    {
      "text": "B. Nonnecke and J. Preece. Lurker demographics: Counting the silent. In Proceedings of CHI, 2000.  ",
      "doi": "10.1145/332040.332409"
    },
    {
      "text": "G. Salton and C. Buckley. Term weighting approaches in automatic text retrieval. Information Processing and Management, 24(5):513--523, 1988.  ",
      "doi": "10.1016/0306-4573%2888%2990021-0"
    },
    {
      "text": "B. M. Sarwar, G. Karypis, J. A. Konstan, and J. Riedl. Item-based collaborative filtering recommendation algorithms. In Proceedings of the WWW10.  ",
      "doi": "10.1145/371920.372071"
    },
    {
      "text": "D. A. Small and G. Loewenstein. Helping 'a' victim or helping 'the' victim: Altruism and identifiability. Journal of Risk and Uncertainty, 26(1):5--16, 2003.",
      "doi": ""
    }
  ]
}