{
  "doi": "10.1145/1124772.1124800",
  "title": "A role for haptics in mobile interaction: initial design using a handheld tactile display prototype",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "171-180",
  "year": 2006,
  "badges": [],
  "abstract": "Mobile interaction can potentially be enhanced with well-designed haptic control and display. However, advances have been limited by a vicious cycle whereby inadequate haptic technology obstructs inception of vitalizing applications. We present the first stages of a systematic design effort to break that cycle, beginning with specific usage scenarios and a new handheld display platform based on lateral skin stretch. Results of a perceptual device characterization inform mappings between device capabilities and specific roles in mobile interaction, and the next step of hardware re-engineering.",
  "authors": [
    {
      "name": "Joseph Luk",
      "institution": "University of British Columbia, Vancouver, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430646439",
      "orcid": "missing"
    },
    {
      "name": "Jerome Pasquero",
      "institution": "McGill University, Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100040803",
      "orcid": "missing"
    },
    {
      "name": "Shannon Little",
      "institution": "University of British Columbia, Vancouver, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311480799",
      "orcid": "missing"
    },
    {
      "name": "Karon MacLean",
      "institution": "University of British Columbia, Vancouver, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100608981",
      "orcid": "0000-0003-2969-4627"
    },
    {
      "name": "Vincent Levesque",
      "institution": "McGill University, Montreal, Canada",
      "img": "/do/10.1145/contrib-81100206465/rel-imgonly/dsc05377.jpeg",
      "acmid": "81100206465",
      "orcid": "missing"
    },
    {
      "name": "Vincent Hayward",
      "institution": "McGill University, Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100323998",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brown, L.M., Brewster, S.A., Purchase, H.C. A first investigation into the effectiveness of tactons. In Proc. World Haptics 2005, IEEE (2005).  ",
      "doi": "10.1109/WHC.2005.6"
    },
    {
      "text": "Chan, A., MacLean, K. E., McGrenere, J. Learning and Identifying Haptic Icons under Workload. In Proc. Eu-rohaptics, WHC (2005).  ",
      "doi": "10.1109/WHC.2005.86"
    },
    {
      "text": "Chang, A. and O'Sullivan, C. 2005. Audio-haptic feed-back in mobile phones. In CHI '05 Extended Abstracts. ACM Press (2005), 1264--1267.  ",
      "doi": "10.1145/1056808.1056892"
    },
    {
      "text": "Cholewiak, R., Sherrick, C. A computer-controlled ma-trix system for presentation to skin of complex spatio-temporal pattern. Behavior Research Methods and In-strumentation, 13, 5 (1981), 667--673.",
      "doi": ""
    },
    {
      "text": "Geldard, F., Some neglected possibilities of communication. Science, 131, 3413 (1960), 1583--1588.",
      "doi": ""
    },
    {
      "text": "Gemperle, F., Ota, N., Siewiorek, D. Design of a wearable tactile display. In Proc. ISWC 2001, IEEE (2001). ",
      "doi": "10.5555/580581.856566"
    },
    {
      "text": "Enriquez, M. and MacLean, K. E. (2005). Common On-set Masking of Vibrotactile Stimuli - POSTER, in Proc. World Haptics, IEEE (2005).",
      "doi": ""
    },
    {
      "text": "Hayward, V. and Cruz-Hernandez, M. Tactile display device using distributed lateral skin stretch. In Proc. Haptic Interfaces for Virtual Environment and Teleoperator Sys. Symposium, IEEE (2000), 1309--1314.",
      "doi": ""
    },
    {
      "text": "Lévesque, V., Pasquero, J., Hayward, V., and Legault, M. 2005. Display of virtual braille dots by lateral skin deformation: feasibility study. ACM Trans. Appl. Percept. 2, 2 (Apr. 2005), 132--149.  ",
      "doi": "10.1145/1060581.1060587"
    },
    {
      "text": "Linjama, J. and Kaaresoja, T. 2004. Novel, minimalist haptic gesture interaction for mobile devices. In Pro-ceedings of the Third Nordic Conference on Human-Computer interaction. ACM Press (2004).  ",
      "doi": "10.1145/1028014.1028095"
    },
    {
      "text": "MacLean, K. E., Shaver, M. J., and Pai, D. K. Handheld Haptics: A USB Media Controller with Force Sensing, in Proc. Of Symp. On Haptic Interfaces for Virtual Environment and Teleoperator Systems (IEEE-VR) (2002). ",
      "doi": "10.5555/795682.797538"
    },
    {
      "text": "MacLean, K.E., and Enriquez, M. Perceptual Design of Haptic Icons. In Proc. EuroHaptics 2003, IEEE (2003).",
      "doi": ""
    },
    {
      "text": "Nardi, B. A., Whittaker, S., and Bradner, E. Interaction and outeraction: instant messaging in action. In Proc. of the 2000 ACM Conference on Computer Supported Co-operative Work. ACM Press (2000), 79--88.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Oulasvirta, A., Tamminen, S., Roto, V., & Kuorelahti, J. Interaction in 4-second bursts: The fragmented nature of attentional resources in mobile HCI. In Proc. CHI 2005, ACM Press (2005), 919--928.  ",
      "doi": "10.1145/1054972.1055101"
    },
    {
      "text": "Pasquero, J., Luk, J., Little, S., MacLean, K.E. Perceptual analysis of haptic icons: an investigation into the validity of cluster sorted MDS. In Proc. Of Symp. On Haptic Interfaces for Virtual Environment and Teleoperator Systems (IEEE-VR), IEEE (2006).  ",
      "doi": "10.5555/1135770.1136088"
    },
    {
      "text": "Poupyrev, I., Maruyama, S., and Rekimoto, J. Ambient Touch: Designing Tactile Interfaces for Handheld Devices. In Proc. UIST 2002, ACM Press (2002), 51--60.  ",
      "doi": "10.1145/571985.571993"
    },
    {
      "text": "Pouyrev, I., and Maruyama, S. Tactile Interfaces for Small Touch Screens. In Proc. UIST 2003, ACM Press (2003), 217--220.  ",
      "doi": "10.1145/964696.964721"
    },
    {
      "text": "Shimoga, K.B. Finger Force and Touch Feedback Issues in Dexterous Telemanipulation. In Proc. Intelligent Ro-botic Sys. for Space Exploration, IEEE (1992), 159--178.",
      "doi": ""
    },
    {
      "text": "VibeTonz system. Immersion Corporation (2005). http://www.immersion.com/mobility",
      "doi": ""
    },
    {
      "text": "Wagner, C.R., Lederman, S.J., Howe, R.D. Design and performance of a tactile display using RC servomotors. Haptics-e Electronic Journal of Haptics Research (www.haptics-e.org), 3, 4 (Sept. 1999).",
      "doi": ""
    },
    {
      "text": "Ward, L. Multidimensional scaling of the molar physical environment. Multivariate Behavioral Research, 12 (1977) 23--42.",
      "doi": ""
    }
  ]
}