{
  "doi": "10.1145/1124772.1124890",
  "title": "The Sandbox for analysis: concepts and methods",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "801-810",
  "year": 2006,
  "badges": [],
  "abstract": "The Sandbox is a flexible and expressive thinking environment that supports both ad-hoc and more formal analytical tasks. It is the evidence marshalling and sense-making component for the analytical software environment called nSpace. This paper presents innovative Sandbox human information interaction capabilities and the rationale underlying them including direct observations of analysis work as well as structured interviews. Key capabilities for the Sandbox include \"put-this-there\" cognition, automatic process model templates, gestures for the fluid expression of thought, assertions with evidence and scalability mechanisms to support larger analysis tasks. The Sandbox integrates advanced computational linguistic functions using a Web Services interface and protocol. An independent third party evaluation experiment with the Sandbox has been completed. The experiment showed that analyst subjects using the Sandbox did higher quality analysis in less time than with standard tools. Usability test results indicated the analysts became proficient in using the Sandbox with three hours of training.",
  "authors": [
    {
      "name": "William Wright",
      "institution": "Oculus Info Inc.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536188",
      "orcid": "missing"
    },
    {
      "name": "David Schroh",
      "institution": "Oculus Info Inc.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311486028",
      "orcid": "missing"
    },
    {
      "name": "Pascale Proulx",
      "institution": "Oculus Info Inc.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311483900",
      "orcid": "missing"
    },
    {
      "name": "Alex Skaburskis",
      "institution": "Oculus Info Inc.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100073360",
      "orcid": "missing"
    },
    {
      "name": "Brian Cort",
      "institution": "Oculus Info Inc.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311482452",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alonso, R. and H. Li, Combating Cognitive Biases in Information Retrieval, In Proc. International Conference on Intelligence Analysis, 2005.]]",
      "doi": ""
    },
    {
      "text": "ARDA Novel Intelligence From Massive Data, NIMD, http://www.ic-arda.org/Novel_Intelligence/ , 2002.]]",
      "doi": ""
    },
    {
      "text": "Bodnar, J.W., Warning Analysis for the Information Age: Rethinking the Intelligence Process, Joint Military Intelligence College (JMIC), December, 2003.]]",
      "doi": ""
    },
    {
      "text": "Caid, W. and Pu Oing, System and Method of Context Vector Generation and Retrieval, United States Patent 5,619,709, 1997.]]",
      "doi": ""
    },
    {
      "text": "Card, Stuart, J. Mackinlay, B. Shneiderman Readings in Information Visualization, Morgan Kaufman Publishers, San Francisco, CA., 1999.]] ",
      "doi": "10.5555/300679"
    },
    {
      "text": "Cowley, P., L. Nowell, J. Scholtz, Glass Box: An Instrumented Infrastructure for Supporting Human Interaction with Information, In Proc. Hawaii International Conf. on System Sciences, 2005, 296.3]]  ",
      "doi": "10.1109/HICSS.2005.286"
    },
    {
      "text": "Hampson, E., and P. Cowley, Instrumenting the Intelligence Analysis Process, In Proc. International Conference on Intelligence Analysis, 2005.]]",
      "doi": ""
    },
    {
      "text": "Heuer, Richard, Psychology of Intelligence Analysis, Center for the Study of Intelligence, 1999.]]",
      "doi": ""
    },
    {
      "text": "Hughes, F. and D. Schum, Discovery-Proof-Choice, The Art and Science of the Process of Intelligence Analysis -- Preparing for the Future of Intelligence Analysis, JMIC Joint Military Intelligence College, 2003.]]",
      "doi": ""
    },
    {
      "text": "Hutchings, D. and J. Stasko, QuickSpace, Short Paper, ACM CHI Conference, 2002, 802--803.]]  ",
      "doi": "10.1145/506443.506605"
    },
    {
      "text": "Institute for Human Machine Cognition, University of West Florida., Cmap Tools, http://cmap.ihmc.us/]]",
      "doi": ""
    },
    {
      "text": "i2 Limited., http://www.i2inc.com]]",
      "doi": ""
    },
    {
      "text": "Jonker, D., W. Wright, D. Schroh, P. Proulx and B. Cort, Information Triage with TRIST, In Proc. International Conference on Intelligence Analysis, 2005.]]",
      "doi": ""
    },
    {
      "text": "Johnston, R., Analytic Culture in the U.S. Intelligence Community, Center for the Study of Intelligence, Government Printing Office, Pittsburgh, PA.]]",
      "doi": ""
    },
    {
      "text": "Kapler, T. and W. Wright, GeoTime Information Visualization, Information Visualization Journal, Palgrave Macmillan, 4,(2), Summer 2005, 136--146.]]  ",
      "doi": "10.1145/1103520.1103526"
    },
    {
      "text": "Larkin, J. and H. Simon, Why a Diagram is (Sometimes) Worth Ten Thousand Words, Cognitive Science, 11(1), 1987, 65--99.]]",
      "doi": ""
    },
    {
      "text": "Mindjet Inc., http://www.mindjet.com]]",
      "doi": ""
    },
    {
      "text": "Morse, E., M. Potts Steves and J. Scholtz, Metrics and Methodologies for Evaluating Technologies for Intelligence Analysts, In Proc. Conference on Intelligence Analysis, 2005.]]",
      "doi": ""
    },
    {
      "text": "Mynatt, E., T. Igarashi, K. Edwards, A. LaMarca, Designing an Augmented Writing Surface, IEEE Computer Graphics and Applications, July 2000, 55--61.]]  ",
      "doi": "10.1109/38.851751"
    },
    {
      "text": "Pirolli, P. and S, Card, Information Foraging in Information Access Environments, In Proc. SIGCHI Conference on Human Factors, 1995, 51--58.]]  ",
      "doi": "10.1145/223904.223911"
    },
    {
      "text": "Pirolli, P. and S, Card, The Sensemaking Process and Leverage Points for Analyst Technology as Identified Through Cognitive Task Analysis, In Proc. International Conference on Intelligence Analysis, 2005.]]",
      "doi": ""
    },
    {
      "text": "Robertson, G., M. Czerwinski, , K. Larson, D. Robbins, D. Thiel and M. van Dantzich, Data Mountain, In Proc. ACM Symposium on UIST, 1998, 153--162.]]  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Rose, Russ, ChairP1000 Committee, P1000 Report, Office of Research and Development, CIA, 1996.]]",
      "doi": ""
    },
    {
      "text": "Visual Analytics Inc., http://www.visualanalytics.com]]",
      "doi": ""
    },
    {
      "text": "Wright, William and Kapler, Thomas, Speaking with Analysts -- Observations of Current Practices with Massive Data, submitted to Journal of Intelligence Community Research and Development.]]",
      "doi": ""
    }
  ]
}