{
  "doi": "10.1145/1124772.1124819",
  "title": "Effects of display position and control space orientation on user preference and performance",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "309-318",
  "year": 2006,
  "badges": [],
  "abstract": "In many environments, it is often the case that input is made to displays that are positioned non-traditionally relative to one or more users. This typically requires users to perform interaction tasks under transformed input-display spatial mappings, and the literature is unclear as to how such transformations affect performance. We present two experiments that explore the impact of display space position and input control space orientation on user's subjective preference and objective performance in a docking task. Our results provide guidelines as to optimal display placement and control orientation in collaborative computing environments with one or more shared displays.",
  "tags": [
    "performance",
    "input-output mappings",
    "spatial transformation",
    "input control space orientation",
    "display position"
  ],
  "authors": [
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto & Mitsubishi Electric Research Labs",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    },
    {
      "name": "Chia Shen",
      "institution": "Mitsubishi Electric Research Labs",
      "img": "/do/10.1145/contrib-81100343583/rel-imgonly/chiaportraitoriginal.jpg",
      "acmid": "81100343583",
      "orcid": "missing"
    },
    {
      "name": "Clifton Forlines",
      "institution": "Mitsubishi Electric Research Labs",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100584798",
      "orcid": "missing"
    },
    {
      "name": "Ravin Balakrishnan",
      "institution": "University of Toronto",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100503904",
      "orcid": "0000-0002-3379-7680"
    }
  ],
  "references": [
    {
      "text": "Bentley, R., Hughes, J., Randall, D., Rodden, T., Sawyer, P., Shapiro, D., and Sommerville, I. (1992). Ethnographically informed systems design for air traffic control. ACM Conference on Computer Supported Cooperative Work. p. 123--129.  ",
      "doi": "10.1145/143457.143470"
    },
    {
      "text": "Covi, L., Olson, J., and Rocco, E. (1998). A room of your own: What do we learn about support of teamwork from assessing teams in dedicated project rooms? Amsterdam, The Netherlands: Springer-Verlag. 53--65. ",
      "doi": "10.5555/645968.674730"
    },
    {
      "text": "Cunningham, H. (1989). Aiming error under transformed spatial mappings suggests a structure for visual-motor maps. J. of Exp. Psychology: Human Perception and Performance, 15(3). p. 493--506.",
      "doi": ""
    },
    {
      "text": "Cunningham, H.A. and Welch, R.B. (1994). Multiple concurrent visual-motor mappings: implications for models of adaptation. J. of Exp. Psychology: Human Perception and Performance, 20(5). p. 987--999.",
      "doi": ""
    },
    {
      "text": "Dietz, P. and Leigh, D. (2001). DiamondTouch: a multi-user touch technology. ACM UIST Symposium on User Interface Software and Technology. p. 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Dobbelsteen, J.v.d., Brenner, E., and Smeets, J. (2004). Body-centered visuomotor adaptation. Journal of Neurophysiology, 92(1). p. 416--423.",
      "doi": ""
    },
    {
      "text": "Heath, C. and Luff, P. (1992). Collaboration and control: Crisis management and multimedia technology in London underground line control rooms. Journal of Computer Supported Cooperative Work, 1(1). p. 24--48.",
      "doi": ""
    },
    {
      "text": "Helmholtz, H. (1866). Treatise on physiological optics.",
      "doi": ""
    },
    {
      "text": "Hindmarsh, J. and Pilnick, A. (2002). The tacit order of teamwork: Collaboration and embodied conduct in anaesthesia. Sociological Quarterly, 43(2). p. 139--164.",
      "doi": ""
    },
    {
      "text": "Baylor Photography: http://www.baylor.edu/pr/.",
      "doi": ""
    },
    {
      "text": "Johanson, B., Hutchins, G., Winograd, T., and Stone, M. (2002). PointRight: experience with flexible input redirection in interactive workspaces. ACM UIST Symposium on User Interface Software and Technology. p. 227--234.  ",
      "doi": "10.1145/571985.572019"
    },
    {
      "text": "Kagerer, F., J.Contreras-Vidal, and Stelmach, G. (1997). Adaptation to gradual as compared with sudden visuo-motor distortions. Experimental Brain Research, 115(3). p. 557--561.",
      "doi": ""
    },
    {
      "text": "Krakauer, J., Pine, Z., Ghilardi, M., and Ghez, C. (2000). Learning of visuomotor transformations for vectorial planning of rearching trajectories. Journal of Neuroscience, 20(23). p. 8916--8924.",
      "doi": ""
    },
    {
      "text": "Mark, G. (2002). Extreme collaboration. Communications of the ACM, 45(6). p. 89--93.  ",
      "doi": "10.1145/508448.508453"
    },
    {
      "text": "Masliah, M. and Milgram, P. (2000). Measuring the allocation of control in a 6 degree-of-freedom docking experiment. ACM CHI Conference on Human Factors in Computing Systems. p. 25--32.  ",
      "doi": "10.1145/332040.332403"
    },
    {
      "text": "Nacenta, M., Aliakseyeu, D., Subramanian, S., and Gutwin, C. (2005). A comparison of techniques for multi-display reaching. ACM CHI Conference on Human Factors in Computing Systems. p. 371--380.  ",
      "doi": "10.1145/1054972.1055024"
    },
    {
      "text": "Nardi, B., Schwarz, H., Kuchinsky, A., Leichner, R, Whittaker, S, and Sclabassi, R. (1996). V Turning away from talking heads: the use of video-as-data in neurosurgery. ACM CHI Conference on Human Factors in Computing Systems. p. 327--334.  ",
      "doi": "10.1145/169059.169261"
    },
    {
      "text": "Rekimoto, J. (2002). SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. ACM CHI Conference on Human Factors in Computing Systems. p. 113--120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Ringel, M., Ryall, K., Shen, C., Forlines, C., and Vernier, F. (2004). Release, relocate, reorient, resize: fluid techniques for document sharing on multi-user interactive table. Ext. Abs. of the ACM Conference on Human Factors in Computing Systems. p. 1441--1444.  ",
      "doi": "10.1145/985921.986085"
    },
    {
      "text": "Scott, S., Carpendale, S., and Habelski, S. (2005). Storage bins: Mobile storage for collaborative tabletop displays. IEEE Computer Graphics and Applications, July/August 2005. p. 58--65.  ",
      "doi": "10.1109/MCG.2005.86"
    },
    {
      "text": "Seidler, R. (2004). Multiple motor learning experiences enhance motor adaptability. Journal of Cognitive Neuroscience, 16(1). p. 65--73.  ",
      "doi": "10.1162/089892904322755566"
    },
    {
      "text": "Shen, C., Lesh, N., and Vernier, F. (2003). Personal digital historian: story sharing around the table. Interactions, 10(2). p. 15--22.  ",
      "doi": "10.1145/637848.637856"
    },
    {
      "text": "Stratton, G. (1897). Upright vision and the retinal image. Psych. Review, 4. p. 182--187.",
      "doi": ""
    },
    {
      "text": "Stratton, G. (1897). Vision without inversion of the retinal image. Psych. Review, 4. p. 341-360, 463--481.",
      "doi": ""
    },
    {
      "text": "Streitz, N., Prante, C., Muller-Tomfelde, C., Tandler, P., and Magerkurth, C. (2002). Roomware©: the second generation. Ext. Abs. of the ACM CHI Conference on Human Factors in Computing Systems. p. 506--507.  ",
      "doi": "10.1145/506443.506452"
    },
    {
      "text": "Su, R. and Bailey, B. (2005). Towards guidelines for positioning large displays in interactive workspaces. Interact Conference. p. 377--390.  ",
      "doi": "10.1007/11555261_29"
    },
    {
      "text": "Teasley, S., Covi, L., Krishnan, M., and Olson, J. (2000). How does radical collocation help a team succeed? ACM Conference on Computer Supported Cooperative Work. p. 339--346.  ",
      "doi": "10.1145/358916.359005"
    },
    {
      "text": "Tollinger, I., McCurdy, M., Vera, A., and Tollinger, P. (2004). Collaborative knowledge management supporting mars mission scientists. ACM Conference on Computer Supported Cooperative Work. p. 29--38.  ",
      "doi": "10.1145/1031607.1031614"
    },
    {
      "text": "Wu, M. and Balakrishnan, R. (2003). Multi-finger and whole hand gestural interaction techniques for multiuser tabletop displays. ACM UIST Symposium on User Interface Software and Technology. p. 193--202.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "Zhai, S. and Milgram, P. (1998). Quantifying coordination in multiple DOF movement and ints application to evaluating 6 DOF input devices. ACM CHI Conference on Human Factrs in Computing Systems. p. 320--327.  ",
      "doi": "10.1145/274644.274689"
    }
  ]
}