{
  "doi": "10.1145/1124772.1124827",
  "title": "Prototyping retractable string-based interaction techniques for dual-display mobile devices",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "369-372",
  "year": 2006,
  "badges": [],
  "abstract": "Accessing information on mobile and wearable devices often requires the user's visual attention, and the precise operation of virtual or physical widgets. However, these interactions may sometimes be too time-consuming and socially inappropriate. To address this, we introduce a novel input/output device that is based on the manipulation of a retractable string in a polar coordinate frame. Depending on how the user pulls the string from its enclosure--to a particular length, at a particular angle--various system features may be directly accessed. Furthermore, we present our concept for a 1D pixel array, embedded in the string that may be used as a secondary 1D display. Since it is possible to unwind the display itself and trigger functionality with a single pull, information may be accessed and presented quickly, and perceived at a glance. We present scenarios for how the string input/output device may be used in conjunc-tion with the mobile device's primary 2D display and describe our augmented reality proof-of-concept prototype.",
  "tags": [
    "mobile interaction",
    "retractable string-based input",
    "pixel-array displays",
    "wearable computing",
    "mobile computing"
  ],
  "authors": [
    {
      "name": "Gabor Blasko",
      "institution": "Columbia University, Department of Computer Science, New York City, NY",
      "img": "/do/10.1145/contrib-81100428195/rel-imgonly/blasko_gabor3.jpg",
      "acmid": "81100428195",
      "orcid": "missing"
    },
    {
      "name": "Chandra Narayanaswami",
      "institution": "IBM T.J. Watson Research Center, Hawthorne, NY",
      "img": "/do/10.1145/contrib-81100368798/rel-imgonly/chandraapril2019.png",
      "acmid": "81100368798",
      "orcid": "missing"
    },
    {
      "name": "Steven Feiner",
      "institution": "Columbia University, Department of Computer Science, New York City, NY",
      "img": "/do/10.1145/contrib-81100427474/rel-imgonly/feiner02nothumb.png",
      "acmid": "81100427474",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Twiddler2 by HandyKey Corporation URL: http://www.handykey.com/",
      "doi": ""
    },
    {
      "text": "Accot, J. and Zhai, S., Beyond Fitts' law: Models for trajectory-based HCI tasks, Proc. CHI '97, 1997, pp. 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Bass, L., Kasabach, C., Martin, R., Siewiorek, D.P., Smailagic, A., and Stivoric, J., The design of a wearable computer, Proc. CHI '97, 1997, pp. 139--146.  ",
      "doi": "10.1145/258549.258634"
    },
    {
      "text": "Bimber, O. and Raskar, R., Spatial Augmented Reality: Merging real and virtual worlds, A. K. Peters Ltd., Wellesley, MA, 2004. ",
      "doi": "10.5555/1088894"
    },
    {
      "text": "Callahan, J., Hopkins, D., Weiser, M., and Shneiderman, B., An empirical comparison of pie vs. linear menus, Proc. CHI '88, 1988, pp. 95--100.  ",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "Friedlander, N., Schlueter, K., and Mantei, M., Bullseye! When Fitts' law doesn't fit, Proc. CHI '98, 1998, pp. 257--264.  ",
      "doi": "10.1145/274644.274681"
    },
    {
      "text": "Holman, D., Vertegaal, R., Altosaar, M., Troje, N., and John, D., Paper windows: Interaction techniques for digital paper, Proc. CHI '05, 2005, pp. 591--599.  ",
      "doi": "10.1145/1054972.1055054"
    },
    {
      "text": "Kulik, A., Paneque, D., and Hochstrate, J., Vectorix: A Low-Tech Mechanical Tracking System, Proc. IEEE VR Workshop: Beyond Wand and Glove Based Interac-tion, 2004, pp. 25--27.",
      "doi": ""
    },
    {
      "text": "Kurtenbach, G., The design and evaluation of marking menus. PhD Thesis, Dept. of Computer Science, Univer-sity of Toronto, 1993. ",
      "doi": "10.5555/193157"
    },
    {
      "text": "Narayanaswami, C. and Raghunath, M., Designing a new form factor for wearable computing, IEEE Perva-sive Computing, 1(4), pp. 42--48, 2002.  ",
      "doi": "10.1109/MPRV.2002.1158277"
    },
    {
      "text": "Vickers, D., Sorcerer's apprentice: Head-mounted display and wand. Ph.D. Thesis, Department of Electrical Engineering, University of Utah, 1972. ",
      "doi": "10.5555/906408"
    }
  ]
}