{
  "doi": "10.1145/1124772.1124882",
  "title": "Leveraging characteristics of task structure to predict the cost of interruption",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "741-750",
  "year": 2006,
  "badges": [],
  "abstract": "A challenge in building interruption reasoning systems is to compute an accurate cost of interruption (COI). Prior work has used interface events and other cues to predict COI, but ignore characteristics related to the structure of a task. This work investigates how well characteristics of task structure can predict COI, as objectively measured by resumption lag. In an experiment, users were interrupted during task execution at various boundaries to collect a large sample of resumption lag values. Statistical methods were employed to create a parsimonious model that uses characteristics of task structure to predict COI. A subsequent experiment with different tasks showed that the model can predict COI with reasonably high accuracy. Our model can be expediently applied to many goal-directed tasks, allowing systems to make more effective decisions about when to interrupt.",
  "tags": [
    "learning",
    "attention",
    "task models",
    "interruption",
    "workload"
  ],
  "authors": [
    {
      "name": "Shamsi T. Iqbal",
      "institution": "University of Illinois, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Brian P. Bailey",
      "institution": "University of Illinois, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100615948",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adamczyk, P.D. and B.P. Bailey. If Not Now When? The Effects of Interruptions at Different Moments within Task Execution. CHI, 2004, 271--278.]]  ",
      "doi": "10.1145/985692.985727"
    },
    {
      "text": "Altmann, E.M. and J.G. Trafton. Task Interruption: Resumption Lag and the Role of Cues. CogSci, 2004.]]",
      "doi": ""
    },
    {
      "text": "Bailey, B.P., P.D. Adamczyk, T.Y. Chang and N.A. Chilson. A Framework for Specifying and Monitoring User Tasks. Journal of Computers in Human Behavior, to appear, 2006.]]",
      "doi": ""
    },
    {
      "text": "Bailey, B.P. and J.A. Konstan. On the Need for Attention Aware Systems: Measuring Effects of Interruption on Task Performance, Error Rate, and Affective State. Journal of Computers in Human Behavior, to appear, 2006.]]",
      "doi": ""
    },
    {
      "text": "Card, S., T. Moran and A. Newell. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Associates, Hillsdale, 1983.]] ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Chung, P.H. and M.D. Byrne. Visual Cues to Reduce Errors in a Routine Procedural Task. CogSci, 2004.]]",
      "doi": ""
    },
    {
      "text": "Cutrell, E., M. Czerwinski and E. Horvitz. Effects of Instant Messaging Interruptions on Computing Tasks. CHI, 2000, 99--100.]]  ",
      "doi": "10.1145/633292.633351"
    },
    {
      "text": "Czerwinski, M., E. Cutrell and E. Horvitz. Instant Messaging and Interruption: Influence of Task Type on Performance. Annual Conference of the Human Factors and Ergonomics Society of Australia (OZCHI) , 2000, 356--361.]]",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., E. Cutrell and E. Horvitz. Instant Messaging: Effects of Relevance and Timing. People and Computers XIV: Proceedings of HCI, 2000, 71--76.]]",
      "doi": ""
    },
    {
      "text": "Czerwinski, M., E. Horvitz and S. Wilhite. A Diary Study of Task Switching and Interruptions. Proceedings of the ACM Conference on Human Factors in Computing Systems, 2004, 175--182.]]  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Degani, A. and E. Wiener. Cockpit Checklists: Concepts, Design, and Use. Human Factors, 35 (2), 345--359, 1993.]]",
      "doi": ""
    },
    {
      "text": "Dragunov, A.N., T.G. Dietterich, K. Johnsrude, M. McLaughlin, L. Li and J.L. Herlocker. Tasktracer: A Desktop Environment to Support Multi-Tasking Knowledge Workers. Proc. IUI, 2005, 75--82.]]  ",
      "doi": "10.1145/1040830.1040855"
    },
    {
      "text": "Fogarty, J., S.E. Hudson and J. Lai. Examining the Robustness of Sensor-Based Statistical Models of Human Interruptibility. CHI, 2004, 207--214.]]  ",
      "doi": "10.1145/985692.985719"
    },
    {
      "text": "Fogarty, J., A.J. Ko, H.H. Aung, E. Golden, K.P. Tang and S.E. Hudson. Examining Task Engagement in Sensor-Based Statistical Models of Human Interruptibility. CHI, 2005, 331--340.]]  ",
      "doi": "10.1145/1054972.1055018"
    },
    {
      "text": "Horvitz, E. and J. Apacible. Learning and Reasoning About Interruption. ICMI, 2003, 20--27.]]  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Horvitz, E., A. Jacobs and D. Hovel. Attention-Sensitive Alerting. Conference Proceedings on Uncertainty in Artificial Intelligence, 1999, 305--313.]]",
      "doi": ""
    },
    {
      "text": "Horvitz, E., P. Koch and J. Apacible. Busybody: Creating and Fielding Personalized Models of the Cost of Interruption. CSCW, 2004, 507--510.]]  ",
      "doi": "10.1145/1031607.1031690"
    },
    {
      "text": "Hudson, J.M., J. Christensen, W.A. Kellogg and T. Erickson. \"\"I'd Be Overwhelmed, but It's Just One More Thing to Do\"\": Availability and Interruption in Research Management. CHI, 2002, 97--104.]]  ",
      "doi": "10.1145/503376.503394"
    },
    {
      "text": "Hudson, S.E., J. Fogarty, C.G. Atkeson, D. Avrahami, J. Forlizzi, S. Kiesler, J.C. Lee and J. Yang. Predicting Human Interruptibility with Sensors: A Wizard of Oz Feasibility Study. CHI, 2003, 257--264.]]  ",
      "doi": "10.1145/642611.642657"
    },
    {
      "text": "Iqbal, S.T., P.D. Adamczyk, S. Zheng and B.P. Bailey. Towards an Index of Opportunity: Understanding Changes in Mental Workload During Task Execution. CHI, 2005, 311--320.]]  ",
      "doi": "10.1145/1054972.1055016"
    },
    {
      "text": "Iqbal, S.T. and B.P. Bailey. Investigating the Effectiveness of Mental Workload as a Predictor of Opportune Moments for Interruption. CHI, 2005, 1489--1492.]]  ",
      "doi": "10.1145/1056808.1056948"
    },
    {
      "text": "Jackson, T.W., R.J. Dawson and D. Wilson. The Cost of Email Interruption. Journal of Systems and Information Technology, 5 (1), 81--92, 2001.]]",
      "doi": ""
    },
    {
      "text": "John, B.E., K. Prevas, D.D. Salvucci and K. Koedinger. Predictive Human Performance Modeling Made Easy. CHI, 2004, 455--462.]]  ",
      "doi": "10.1145/985692.985750"
    },
    {
      "text": "Maglio, P. and C.S. Campbell. Tradeoffs in Displaying Peripheral Information. CHI, 2000, 241--248.]]  ",
      "doi": "10.1145/332040.332438"
    },
    {
      "text": "McCrickard, D.S., R. Catrambone, C.M. Chewar and J.T. Stasko. Establishing Tradeoffs That Leverage Attention for Utility: Empirically Evaluating Information Display in Notification Systems. IJHCS, 58 (5), 547--582, 2003.]]  ",
      "doi": "10.1016/S1071-5819%2803%2900022-3"
    },
    {
      "text": "McFarlane, D.C. Coordinating the Interruption of People in Human-Computer Interaction. Proceedings of the IFIP TC.13 International Conference on Human-Computer Interaction, 1999, 295--303.]]",
      "doi": ""
    },
    {
      "text": "McFarlane, D.C. and K.A. Latorella. The Scope and Importance of Human Interruption in Hci Design. Human-Computer Interaction, 17 (1), 1--61, 2002.]]",
      "doi": "10.1207/S15327051HCI1701_1"
    },
    {
      "text": "Miyata, Y. and D.A. Norman. Psychological Issues in Support of Multiple Activities. In Norman, D.A. and Draper, S.W. (eds.) User Centered System Design: New Perspectives on Human-Computer Interaction, Lawrence Erlbaum Associates, Hillsdale, NJ, 1986, 265--284.]]",
      "doi": ""
    },
    {
      "text": "Monk, C.A., D.A. Boehm-Davis and J.G. Trafton. The Attentional Costs of Interrupting Task Performance at Various Stages. HFES, 2002.]]",
      "doi": ""
    },
    {
      "text": "Navon, D. and D. Gopher. On the Economy of the Human Processing Systems. Psychological Review, 86, 254--255, 1979.]]",
      "doi": ""
    },
    {
      "text": "Newell, A. and P.S. Rosenbloom. Mechanisms of Skill Acquisition and the Law of Practice. In Anderson, J.R. ed. Cognitive Skills and Their Acquisition, Erlbaum, Hillsdale, NJ, 1981, 1--55.]]",
      "doi": ""
    },
    {
      "text": "Ritter, F.E., G.D. Baxter, G. Jones and R.M. Young. Supporting Cognitive Models as Users. ACM Transactions on Computer-Human Interaction, 7 (2), 141--173, 2000.]]  ",
      "doi": "10.1145/353485.353486"
    },
    {
      "text": "Rubinstein, J.S., D.E. Meyer and J.E. Evans. Executive Control of Cognitive Processes in Task Switching. Journal of Experimental Psychology: Human Perception and Performance, 27 (4), 763--797, 2001.]]",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Designing the User Interface. Pearson Addison Wesley, Third Edition, 1997.]] ",
      "doi": "10.5555/523237"
    },
    {
      "text": "Tollinger, I., R.L. Lewis, M. McCurdy, P. Tollinger, A. Vera, A. Howes and L.J. Pelton. Supporting Efficient Development of Cognitive Models at Multiple Skill Levels: Exploring Recent Advancements in Constraint-Based Modeling. CHI, 2005, 411--420.]]  ",
      "doi": "10.1145/1054972.1055029"
    },
    {
      "text": "Trafton, J.G., E.M. Altmann, D.P. Brock and F.E. Mintz. Preparing to Resume an Interrupted Task: Effects of Prospective Goal Encoding and Retrospective Rehearsal. IJHCS, 58, 583--603, 2003.]]  ",
      "doi": "10.1016/S1071-5819%2803%2900023-5"
    },
    {
      "text": "Wickens, C.D. Multiple Resources and Performance Prediction. Theoretical Issues in Ergonomic Science, 3 (2), 159--177, 2002.]]",
      "doi": ""
    },
    {
      "text": "Zacks, J., B. Tversky and G. Iyer. Perceiving, Remembering, and Communicating Structure in Events. Journal of Experimental Psychology: General, 130 (1), 29--58, 2001.]]",
      "doi": ""
    },
    {
      "text": "Zijlstra, F.R.H., R.A. Roe, A.B. Leonora and I. Krediet. Temporal Factors in Mental Work: Effects of Interrupted Activities. Journal of Occupational and Organizational Psychology, 72, 163--185, 1999.]]",
      "doi": ""
    }
  ]
}