{
  "doi": "10.1145/1124772.1124844",
  "title": "Text entry using a dual joystick game controller",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "475-478",
  "year": 2006,
  "badges": [],
  "abstract": "We present a new bimanual text entry technique designed for today's dual-joystick game controllers. The left and right joysticks are used to independently select characters from the corresponding (left/right) half of an on-screen se-lection keyboard. Our dual-stick approach is analogous to typing on a standard keyboard, where each hand (left/right) presses keys on the corresponding side of the keyboard. We conducted a user study showing that our technique supports keyboarding skills transfer and is thereby readily learnable. Our technique increases entry speed significantly compared to the status quo single stick selection keyboard technique.",
  "authors": [
    {
      "name": "Andrew D. Wilson",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350567780",
      "orcid": "0000-0001-5751-9354"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "Microsoft Research, University of California, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "KeyStick home page, http://www.n-e-ware.com/KeyStick.htm",
      "doi": ""
    },
    {
      "text": "myText home page, http://www.my-text.com",
      "doi": ""
    },
    {
      "text": "Weegie home page, http://weegie.sourceforge.net",
      "doi": ""
    },
    {
      "text": "XNav: Gesture-based text input and device navigation, http://www.microsoft.com/mscorp/ip/ventures/technologies/XNav.asp",
      "doi": ""
    },
    {
      "text": "Bellman, T., and MacKenzie, I. S., A probabilistic character layout strategy for mobile text entry. in Proc. Graphics Interface (GI '98), (1998), 168--176.",
      "doi": ""
    },
    {
      "text": "Grudin, J. Error patterns in novice and skilled tran-scription typing. in Cooper, W.E. ed. Cognitive aspects of skilled typewriting, 1983, 121--143.",
      "doi": ""
    },
    {
      "text": "Isokoski, P., and Raisamo, R., Device independent text input: A rationale and an example. in Proc. of the Working Conference on Advanced Visual Interfaces (AVI 2000), (2000), 76--83.  ",
      "doi": "10.1145/345513.345262"
    },
    {
      "text": "MacKenzie, I.S., and Soukoreff, R. W., Phrase sets for evaluating text entry techniques. in Extended Abstracts of the ACM Conference on Human Factors in Comput-ing Systems (CHI 2003), (2003), 745--755.  ",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "MacKenzie, I.S., and Zhang, S. X., The design and evaluation of a high-performance soft keyboard. in Proc. ACM Conference on Human Factors in Comput-ing Systems (CHI '99), (1999), 25--31.  ",
      "doi": "10.1145/302979.302983"
    },
    {
      "text": "Perlin, K., Quikwriting: Continuous stylus-based text entry. in ACM UIST '98, (1998).  ",
      "doi": "10.1145/288392.288613"
    },
    {
      "text": "Venolia, G., and Neiberg, F., T-Cube: A fast, self-disclosing pen-based alphabet. in Proc. CHI 1994, (1994).  ",
      "doi": "10.1145/191666.191761"
    },
    {
      "text": "Wobbrock, J.O., and Myers, B. A. Analyzing the input stream for character-level errors in unconstrained text entry evaluations. ACM Trans. on CHI (submitted).  ",
      "doi": "10.1145/1188816.1188819"
    },
    {
      "text": "Wobbrock, J.O., Myers, B. A., and Aung, H. H., Writ-ing with a joystick: A comparison of date stamp, selec-tion keyboard and EdgeWrite. in Proc. Graphics Inter-face (GI '04), (2004), 1--8. ",
      "doi": "10.5555/1006058.1006059"
    }
  ]
}