{
  "doi": "10.1145/1124772.1124969",
  "title": "Collocation blindness in partially distributed groups: is there a downside to being collocated?",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1313-1321",
  "year": 2006,
  "badges": [],
  "abstract": "Under what circumstances might a group member be better off as a long-distance participant rather than collocated? We ran a set of experiments to study how partially-distributed groups collaborate when skill sets are unequally distributed. Partially distributed groups are those where some collaborators work together in the same space (collocated) and some work remotely using computer-mediated communications. Previous experiments had shown that these groups tend to form semi-autonomous 'in-groups'. In this set of experiments the configuration was changed so that some player skills were located only in the collocated space, and some were located only remotely, creating local surplus of some skills and local scarcity of others in the collocated room. Players whose skills were locally in surplus performed significantly worse. They experienced 'collocation blindness' and failed to pay enough attention to collaborators outside of the room. In contrast, the remote players whose skills were scarce inside the collocated room did particularly well because they charged a high price for their skills.",
  "tags": [
    "telecommuting",
    "virtual teams",
    "telework",
    "collocation",
    "co-location",
    "collaboration networks",
    "computer-mediated communication",
    "distributed work"
  ],
  "authors": [
    {
      "name": "Nathan Bos",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100632322",
      "orcid": "missing"
    },
    {
      "name": "Judith Olson",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/do/10.1145/contrib-81350567367/rel-imgonly/81350567367.jpg",
      "acmid": "81350567367",
      "orcid": "missing"
    },
    {
      "name": "Ning Nan",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100253185",
      "orcid": "missing"
    },
    {
      "name": "N Sadat Shami",
      "institution": "Cornell University",
      "img": "/do/10.1145/contrib-81100499118/rel-imgonly/sadat_shami.png",
      "acmid": "81100499118",
      "orcid": "missing"
    },
    {
      "name": "Susannah Hoch",
      "institution": "Draper Laboratory",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100590508",
      "orcid": "missing"
    },
    {
      "name": "Erik Johnston",
      "institution": "University of Michigan, Ann Arbor, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485972",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Steinberg, S. (March 29, 1976) View from 9th Avenue. New Yorker Magazine.",
      "doi": ""
    },
    {
      "text": "Bos, N.D., Olson, J.S., Gergle, D., Olson, G.M., & Wright, Z. (2002). Effects of four computer-mediated channels on trust development. In Proceedings of CHI 2002. New York: ACM Press, 135--140.  ",
      "doi": "10.1145/503376.503401"
    },
    {
      "text": "Kraut, R. E., Egido, C., Galegher, J. (1990). Patterns of contact and communication in scientific research collaborations. In Kraut, R. E., Egido, C., Galegher, J. (Ed.) Intellectual Teamwork: Social and Technological Foundations of Cooperative Work. Hillsdale, NJ: Lawrence Erlbaum, 149--172. ",
      "doi": "10.5555/117848.117854"
    },
    {
      "text": "Teasley, S. D., Covi, L.A., Krishnan, M. S., & Olson, J. S. (2002). Rapid software development through team collocation. IEEE Transactions on Software Engineering, 28(7), 671--683.  ",
      "doi": "10.1109/TSE.2002.1019481"
    },
    {
      "text": "Jarvenpaa, S., and Leidner, D. (1999) Communication and trust in global virtual teams. Organization Science, 10, 791--815.  ",
      "doi": "10.1287/orsc.10.6.791"
    },
    {
      "text": "Hinds, P. J. & Bailey, D.E. (2003). Out of sight, out of sync: Understanding conflict in distributed teams. Organization Science 14 (6), 614--632.  ",
      "doi": "10.1287/orsc.14.6.615.24872"
    },
    {
      "text": "Haywood, M. (1998) Managing Virtual Teams. Boston, MA: Artech House.",
      "doi": ""
    },
    {
      "text": "Kinney, S.T. & Panko, R.R. (1996). Project teams: profiles and member perceptions-implications for group support system research and products. In Proceedings of the 29th Annual Hawaii International Conference on System Science. ",
      "doi": "10.5555/795700.798535"
    },
    {
      "text": "Herbsleb, J.D., Mockus, A., Finholt, T.A., & Grinter, R.E. (2000). Distance dependencies, and delay in global collaboration. In Proceedings of CSCW 2000. New York: ACM Press, 319--328.  ",
      "doi": "10.1145/358916.359003"
    },
    {
      "text": "Pool, J. (1976) \"Coalition formation in small groups with incomplete communication networks.\" Journal of Personality and Social Psychology. 34 (1) 82--91.",
      "doi": ""
    },
    {
      "text": "Bélanger, F. (1999). 'Communication patterns in distributed work groups: A network analysis', IEEE Transactions on Professional Communication, 42, 261--275.",
      "doi": ""
    },
    {
      "text": "Bos, N.D, Shami, N.S., Olson, J.S., Cheshin, A. & Nan, N. (2004) In-group/ out-group effects in distributed teams: an experimental simulation. In Proceedings of CSCW 2004. New York: ACM Press. 429--436.  ",
      "doi": "10.1145/1031607.1031679"
    },
    {
      "text": "Bos, N.D., Cheshin, A., Kim, Y., Lee, K., Olson, J. & Nan, N. (in review). Contrasting Communication Styles within partially distributed teams.",
      "doi": ""
    },
    {
      "text": "Powell, W.W. (1990). Neither market nor hierarchy: network forms of organization. Research in Organizational Behavior 12, 295--336.",
      "doi": ""
    },
    {
      "text": "Davis, J.P., Farnham, S., & Jensen, C. (2002). Decreasing Online 'Bad' Behavior. Proceedings of CHI 2002 Short Papers. New York: ACM. 718--719.  ",
      "doi": "10.1145/506443.506563"
    },
    {
      "text": "Hsi, S. & Hoadley, C. (1997). Productive discussion in science: gender equity through electronic discourse. Journal of Science Education and Technology 6 (1), 23--36.",
      "doi": ""
    }
  ]
}