{
  "doi": "10.1145/1124772.1124796",
  "title": "\"LINC-ing\" the family: the participatory design of an inkable family calendar",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "141-150",
  "year": 2006,
  "badges": [],
  "abstract": "Families must continually organize, plan, and stay aware of the activities of their households in order to coordinate everyday life. Despite having organization schemes, many people still feel overwhelmed when it comes to family coordination. To help overcome this, we present our research efforts on LINC: an inkable family calendar designed for the kitchen. LINC was developed using a participatory design process involving interviews, paper prototyping, and a formative evaluation. Our work outlines key implications for digital family calendars and family coordination systems in general. We found that coordination is not typically done through the family calendar; rather, the family calendar is a tool that provides family members with an awareness of activities and changes that in turn enables coordination. Thus, digital family calendars should provide tools that enable families to use their own coordination routines which leverage the social affordances prominent in existing paper calendars.",
  "authors": [
    {
      "name": "Carman Neustaedter",
      "institution": "University of Calgary, Calgary, AB, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100495977",
      "orcid": "0000-0002-2915-018X"
    },
    {
      "name": "A. J. Bernheim Brush",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81332491415/rel-imgonly/ajbrushlarge.jpg",
      "acmid": "81332491415",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beech, S., Geelhoed, E., Murphy, R., Parker, J., Sellen, A., and Shaw, K., The Lifestyles of Working Parents, Report HPL-2003-88R1, HP Labs (2004).",
      "doi": ""
    },
    {
      "text": "Brush A., and Turner, T. A Survey of Personal and Household Scheduling, Group 2005 posters, ACM Press (2005), 330--331.  ",
      "doi": "10.1145/1099203.1099263"
    },
    {
      "text": "Crabtree, A., Rodden, T., Hemmings, T., and Benford, S., Finding a Place for UbiComp in the Home, Proc. Ubicomp 2003, Springer-Verlag (2003), 208--226.",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Hemmings, T., and Mariani, J., Informing the Development of Calendar Systems for Domestic Use, Proc ECSCW 2003, Helsinki, Finland, (2003). ",
      "doi": "10.5555/1241889.1241896"
    },
    {
      "text": "Dourish, P., Where the Action Is: The Foundations of Embodied Interaction, MIT Press (2001). ",
      "doi": "10.5555/513034"
    },
    {
      "text": "Edwards, K, and Grinter, R., At Home with Ubiquitous Computing: Seven Challenges, Proc. UbiComp 2001, Springer-Verlag, Berlin (2001), 256--272. ",
      "doi": "10.5555/647987.741327"
    },
    {
      "text": "Elliot, K., Neustaedter, C., and Greenberg, S., Time, Ownership and Awareness: Value of Contextual Locations in the Home, Proc. Ubicomp 2005, (2005).  ",
      "doi": "10.1007/11551201_15"
    },
    {
      "text": "Family Scheduler, www.familyscheduleronline.com",
      "doi": ""
    },
    {
      "text": "Harper, R., Evergeti, V., Hamill, L., and Shatwell, B., Social Organization of Communication in the Home, Journal of Cognition, Technology, Work (2003), 5:5--22.",
      "doi": ""
    },
    {
      "text": "Hutchinson, H., Bederson, B., Plaisant, C., and Druin, A., Family Calendar Survey, Report CS-TR-4412, Dept Computer Science, University of Maryland (2002).",
      "doi": ""
    },
    {
      "text": "Neustaedter, C., Elliot, K., and Greenberg, S. Foundations of Interpersonal Awareness, GroupLab Working Paper, http://grouplab.cpsc.ucalgary.ca, (2005).",
      "doi": ""
    },
    {
      "text": "Norman, D., The Invisible Computer, Cambridge, MA, MIT Press (1998), 51--68. ",
      "doi": "10.5555/288759"
    },
    {
      "text": "O'Hara, K., Perry, M., and Lewis, S., Social coordination around a situated display appliance, Proc. CHI 2003, ACM Press (2003), 65--72.  ",
      "doi": "10.1145/642611.642624"
    },
    {
      "text": "OurFamilyWizard, http://www.ourfamilywizard.com/",
      "doi": ""
    },
    {
      "text": "Palen, L., Social, Individual & Technological Issues for Groupware Calendar Systems, Proc. CHI 1999, ACM Press (1999).  ",
      "doi": "10.1145/302979.302982"
    },
    {
      "text": "Plaisant, C., Bederson, B., Clamage, A., Hutchinson, H., and Druin, A., Shared Family Calendars, Report HCIL-2003-38, Dept of CS, University of Maryland (2003).",
      "doi": ""
    },
    {
      "text": "Sellen, A., Hyams, J., and Eardley, R., The Everyday Problems of Working Parents, Report HPL-2004-37, HP Labs (2004).",
      "doi": ""
    },
    {
      "text": "Snyder, C., Paper prototyping: The fast and easy way to design and refine user interfaces, Morgan Kaufmann Publishers: London (2003).",
      "doi": ""
    },
    {
      "text": "Tam, J., and Greenberg, S., A Framework for Asynchronous Change Awareness, Int. Journal of Human Computer Studies, Elsevier (2005), In press.  ",
      "doi": "10.1016/j.ijhcs.2006.02.004"
    },
    {
      "text": "Taylor, A., and Swan, L., Artful Systems in the Home, Proc. CHI 2005, ACM Press (2005), 641--650.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Yang, L, Hinckley, K., Guan, Z., and Landay, J., Experimental analysis of mode switching techniques in pen-based user interfaces, Proc. CHI 2005, ACM Press (2005), 461--470.  ",
      "doi": "10.1145/1054972.1055036"
    }
  ]
}