{
  "doi": "10.1145/1124772.1124823",
  "title": "Error correction of voicemail transcripts in SCANMail",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "339-348",
  "year": 2006,
  "badges": [],
  "abstract": "Despite its widespread use, voicemail presents numerous usability challenges: People must listen to messages in their entirety, they cannot search by keywords, and audio files do not naturally support visual skimming. SCANMail overcomes these flaws by automatically generating text transcripts of voicemail messages and presenting them in an email-like interface. Transcripts facilitate quick browsing and permanent archive. However, errors from the automatic speech recognition (ASR) hinder the usefulness of the transcripts. The work presented here specifically addresses these problems by evaluating user-initiated error correction of transcripts. User studies of two editor interfaces-a grammar-assisted menu and simple replacement by typing-reveal reduced audio playback times and an emphasis on editing important words with the menu, suggesting its value in mobile environments where limited input capabilities are the norm and user privacy is essential. The study also adds to the scarce body of work on ASR confidence shading, suggesting that shading may be more helpful than previously reported.",
  "tags": [
    "error correction",
    "voicemail",
    "editor interfaces",
    "speech recognition",
    "confidence shading"
  ],
  "authors": [
    {
      "name": "Moira Burke",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100241308",
      "orcid": "missing"
    },
    {
      "name": "Brian Amento",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346993",
      "orcid": "missing"
    },
    {
      "name": "Philip Isenhour",
      "institution": "AT&T Labs-Research, Florham Park, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81546277456",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arons, B. SpeechSkimmer: A system for interactively skimming recorded speech. ACM Transactions on Computer-Human Interaction 4, 1 (1997).  ",
      "doi": "10.1145/244754.244758"
    },
    {
      "text": "Bacchiani, M., Hirschberg, J., Rosenberg, A., Whittaker, S., Hindle, D., Isenhour, P., Jones, M., Stark, L. and Zamchick, G. SCANMail: Audio navigation in the voicemail domain. Proc. Conference on Human Language Technology Research 2001, ACM Press (2000), 1--3.  ",
      "doi": "10.3115/1072133.1072216"
    },
    {
      "text": "Boreczky, J., Gigensohn, A., Golovchinsky, G., and Uchihashi, S. An Interactive Comic Book Presentation for Exploring Video. Proc. CHI 2000, ACM Press (2000), 185--192.  ",
      "doi": "10.1145/332040.332428"
    },
    {
      "text": "Chase, L. Word and acoustic confidence annotation for large vocabulary speech recognition. Proc. Eurospeech 1997, (1997), 815--1818.",
      "doi": ""
    },
    {
      "text": "Degen, L., Mander, R., and Salomon, G. Working with Audio. Proc. CHI 1992, ACM Press (1992), 413--418.  ",
      "doi": "10.1145/142750.142877"
    },
    {
      "text": "Feng, J. and Sears, A. Using confidence scores to improve hands-free speech based navigation in continuous dictation systems. ACM Transactions on Computer-Human Interaction, 4,11 (2004), 329--256.  ",
      "doi": "10.1145/1035575.1035576"
    },
    {
      "text": "Hakkani-Tür, D., Béchet, F., Riccardi, G. and Tür, G. Beyond ASR 1-Best: Using word confusion networks in spoken language understanding. Journal of Computer Speech and Language, Elsevier, (To appear).",
      "doi": ""
    },
    {
      "text": "Hauptmann and Witbrock, M. Informedia: News-on-demand multimedia information acquisition and retrieval. Intelligent Multimedia Information Retrieval, AAAI Press (1997), 213--239. ",
      "doi": "10.5555/266260.266279"
    },
    {
      "text": "Hazen, T., Polifroni, J., and Seneff, S. Recognition confidence scoring for use in speech understanding systems. Computer Speech and Language 16, (2002), 49--67.",
      "doi": "10.1006/csla.2001.0183"
    },
    {
      "text": "Hindus, D., Schmandt, C., and Horner, C. Capturing, structuring, and representing ubiquitous audio. ACM Transactions on Information Systems 11, 4 (1993), 376--400.  ",
      "doi": "10.1145/159764.159761"
    },
    {
      "text": "Karat, C., Halverson, C., Karat J., and Horn, D. Patterns of entry and correction in large vocabulary continuous speech recognition systems. Proc. CHI 1999, ACM Press (1999), 568--575.  ",
      "doi": "10.1145/302979.303160"
    },
    {
      "text": "Kazman, R., Al-Halimi, R., Hunt, W., and Mantei, M. Four paradigms for indexing videoconferences. IEEE Multimedia 3, 1 (1996), 63--73.  ",
      "doi": "10.1109/93.486705"
    },
    {
      "text": "Moran, T., Palen, L., Harrison, S., Chiu, P., Kimber, D., Minneman, S., van Melle, W., and Zellweger, P. \"I'll get that off the audio\": Salvaging in a multimedia meeting. Proc. CHI 1997, ACM Press (1997), 202--209.  ",
      "doi": "10.1145/258549.258704"
    },
    {
      "text": "Oviatt, S. Taming Recognition Errors with a Multimodal Interface. Communications of the ACM 43, ACM Press (2000), 45--51.  ",
      "doi": "10.1145/348941.348979"
    },
    {
      "text": "Stark, L., Whittaker, S., and Hirschberg, J. ASR satisficing: The effects of ASR accuracy on speech retrieval. Proc. International Conference on Spoken Language Processing, (2000).",
      "doi": ""
    },
    {
      "text": "Stifelman, L, Arons, B., and Schmandt, C. The audio notebook: Paper and pen interaction with structured speech. Proc. CHI 2001, ACM Press (2001), 182--189.  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Suhm, B., Myers, B. and Waibel, A. Multimodal error correction for speech user interfaces. ACM Transactions on Computer-Human Interaction 1, 8 (2001), 60--98.  ",
      "doi": "10.1145/371127.371166"
    },
    {
      "text": "Vemuri, S., DeCamp, P., Bender, W., and Schmandt, C. Improving speech playback using time-compression and speech recognition. Proc. CHI 2004, ACM Press (2004), 295--302.  ",
      "doi": "10.1145/985692.985730"
    },
    {
      "text": "Whittaker, S. and Amento, B. Semantic Speech Editing. Proc. CHI 2004, ACM Press (2004), 527--534.  ",
      "doi": "10.1145/985692.985759"
    },
    {
      "text": "Whittaker, S. and Amento, B. Seeing what you are hearing: Co-ordinating responses to trouble reports in network troubleshooting. Proc. ECSCW, Kluwer Academic Publishers (2003), 219--238. ",
      "doi": "10.5555/1241889.1241901"
    },
    {
      "text": "Whittaker, S., Davis, R., Hirshberg, J., and Muller, U. Jotmail: A voicemail interface that enables you to see what was said. Proc. CHI 2000, ACM Press (2000), 89--96.  ",
      "doi": "10.1145/332040.332411"
    },
    {
      "text": "Whittaker, S., Hirschberg, J., Amento, B., Stark, L., Bacchiani, M., Isenhour, P., Stead, L., Zamechick, G. and Rosenberg A. SCANMail: A voicemail interface that makes speech browsable, readable, and searchable. Proc. CHI 2002, ACM Press (2002), 275--282.  ",
      "doi": "10.1145/503376.503426"
    },
    {
      "text": "Whittaker, S., Hyland, P., and Wiley, M. Filochat: Handwritten notes provide access to recorded conversations. Proc. CHI 1994, ACM Press (1994), 271--277.  ",
      "doi": "10.1145/191666.191763"
    },
    {
      "text": "Wilcox, L., Chen, F., Kimber, D., and Balasubramanian, V. Segmentation of speech using speaker identification. Proc. International Conference on Acoustics, Speech, and Signal Processing (1994), 161--164.",
      "doi": ""
    }
  ]
}