{
  "doi": "10.1145/1124772.1124948",
  "title": "Adaptive language behavior in HCI: how expectations and beliefs about a system affect users' word choice",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1177-1180",
  "year": 2006,
  "badges": [],
  "abstract": "People display adaptive language behaviors in face-to-face conversations, but will computer users do the same during HCI? We report an experiment (N=20) demonstrating that users' use of language (in terms of lexical choice) is influenced by their beliefs and expectations about a system: When users believe that the system is unsophisticated and restricted in capability, they adapt their language to match the system's language more than when they believe the system is relatively sophisticated and capable. Moreover, this tendency is based entirely on users' expectations about the system; it is unaffected by the actual behavior that the system exhibits. Our results demonstrate that interface design engenders particular beliefs in users about a system's capabilities, and that these beliefs can determine the extent to which users adapt to the system. We argue that such effects can be leveraged to improve the quality and effectiveness of human-computer interactions.",
  "tags": [
    "HCI",
    "adaptation",
    "language behavior",
    "natural language",
    "interaction technologies",
    "alignment"
  ],
  "authors": [
    {
      "name": "Jamie Pearson",
      "institution": "University of Edinburgh, Edinburgh, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81546026956",
      "orcid": "missing"
    },
    {
      "name": "Jiang Hu",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100255358",
      "orcid": "missing"
    },
    {
      "name": "Holly P. Branigan",
      "institution": "University of Edinburgh, Edinburgh, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100343493",
      "orcid": "missing"
    },
    {
      "name": "Martin J. Pickering",
      "institution": "University of Edinburgh, Edinburgh, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81322503875",
      "orcid": "missing"
    },
    {
      "name": "Clifford I. Nass",
      "institution": "Stanford University, Stanford, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100153283",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bell, L. Linguistic adaptations in spoken human-computer dialogues: Empirical studies of user behavior. Doctoral dissertation. Department of Speech, Music and Hearing, KTH, Stockholm. 2003.",
      "doi": ""
    },
    {
      "text": "Branigan, H.P., Pickering, M.J., Pearson, J., McLean, J.F., Nass, C.I., and Hu, J. Beliefs about mental states in lexical and syntactic alignment: Evidence from human-computer dialogs. Proc. CUNY Conference on Human Sentence Processing 2004.",
      "doi": ""
    },
    {
      "text": "Brennan, S.E. Conversation with and through computers. User Modeling and User-Adapted Interaction, 1 (1991), 67--86.",
      "doi": ""
    },
    {
      "text": "Brennan, S.E., and Clark, H.H. Conceptual pacts and lexical choice in conversation. Journal of Experimental Psychology: Learning, Memory, and Cognition 22 (1996), 1482--1493.",
      "doi": ""
    },
    {
      "text": "Einstein robot the star of high-tech show. http://www.msnbc.msn.com/id/10085890/from/RL.3/",
      "doi": ""
    },
    {
      "text": "Garrod, S.C. and Anderson, A. Saying what you mean in dialogue: A study in conceptual and semantic co-ordination. Cognition, 27 (1987), 181--218.",
      "doi": ""
    },
    {
      "text": "Guindon, R., Shuldberg, K. and Conner, J. Grammatical and ungrammatical structures in user-adviser dialogues: Evidence for sufficiency of restricted languages in natural language interfaces to advisory systems. Proc. 25th Annual Meeting of the ACL, Association of Computational Linguistics (1987), 41--44.  ",
      "doi": "10.3115/981175.981181"
    },
    {
      "text": "Landis, J.R., Koch, G.G. The measurement of observer agreement for categorical data. Biometrics 33 (1977), 159--174.",
      "doi": ""
    },
    {
      "text": "Mori, M. The Buddha in the robot. Boston: Tuttle Publishing, 1982.",
      "doi": ""
    },
    {
      "text": "Nass, C.I., and Brave, S.B. Wired for speech: How voice activates and enhances the human-computer relationship. MIT Press, Cambridge, MA, 2005. ",
      "doi": "10.5555/1088925"
    },
    {
      "text": "Pickering, M.J., and Garrod, S. Toward a mechanistic psychology of dialogue. Behavioral and Brain Sciences 27 (2004), 169--226.",
      "doi": ""
    },
    {
      "text": "Richards, M.A. and Underwood, K.M. How should people and computers speak to one another? Proc. Interact 1984, IFIP (1984), 33--36.",
      "doi": ""
    },
    {
      "text": "Street, R.L. and Brady, R.M. Speech rate acceptance ranges as a function of evaluative domain, listener speech rate, and communication context. Communication Monographs, 49 (1982), 290--308.",
      "doi": ""
    },
    {
      "text": "Walker, M., Fromer, J., Di Frabbrizio, G., Mestel, C. and Hindle, D. What can I say?: Evaluating a spoken language interface to email. Proc. CHI 1998, ACM Press (1998), 582--589.  ",
      "doi": "10.1145/274644.274722"
    },
    {
      "text": "Wang, Q.Y., Nass, C., and Hu, J. Natural language query vs. keyword search: Effects of task complexity on search performance, user perceptions and preferences. Proc. Interact 2005, IPIF (2005), 106--116.  ",
      "doi": "10.1007/11555261_12"
    }
  ]
}