{
  "doi": "10.1145/1124772.1124801",
  "title": "The springboard: multiple modes in one spring-loaded control",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "181-190",
  "year": 2006,
  "badges": [],
  "abstract": "Modes allow a few inputs to invoke many operations, yet if a user misclassifies or forgets the state of a system, modes can result in errors. Spring-loaded modes (quasimodes) maintain a mode while the user holds a control such as a button or key. The Springboard is an interaction technique for tablet computers that extends quasimodes to encompass multiple tool modes in a single spring-loaded control. The Springboard allows the user to continue holding down a nonpreferred-hand command button after selecting a tool from a menu as a way to repeatedly apply the same tool. We find the Springboard improves performance for both a local marking menu and for a non-local marking menu (\"lagoon\") at the lower left corner of the screen. Despite the round-trip costs incurred to move the pen to a tool lagoon, a keystroke-level analysis of the true cost of each technique reveals the local marking menu is not significantly faster.",
  "tags": [
    "subtraction methodology",
    "modes",
    "tablet",
    "pen",
    "keystroke-level model",
    "marking menus",
    "command selection"
  ],
  "authors": [
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Francois Guimbretiere",
      "institution": "University of Maryland, College Park, MD",
      "img": "/do/10.1145/contrib-81100301845/rel-imgonly/81100301845.jpg",
      "acmid": "81100301845",
      "orcid": "0000-0002-5510-6799"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    },
    {
      "name": "Raman Sarin",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100396865",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    },
    {
      "name": "Ed Cutrell",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/do/10.1145/contrib-81100506242/rel-imgonly/cutrellheadshot2011-6x6.jpg",
      "acmid": "81100506242",
      "orcid": "0000-0002-9053-6057"
    }
  ],
  "references": [
    {
      "text": "Apitz, G., Guimbretiere, F. CrossY: A crossing based drawing application. UIST 2004, 3--12.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Appert, C., Beaudouin-Lafon, M., Mackay, W. Context matters: Evaluating interaction techniques with the CIS model. Proc. of HCI 2004, Springer Verlag, 279--295.",
      "doi": ""
    },
    {
      "text": "Bier, E., Stone, M., Pier, K., Buxton, W., DeRose, T. Toolglass and Magic Lenses: The See-Through Interface. Proceedings of SIGGRAPH 93, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Card, S., Moran, T., Newell, A., The Keystroke-Level Model for User Performance Time with Interactive Systems. Communications of the ACM, 1980. 23(7): p. 396-410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Dillon, R., Eday, J., Tombaugh, J., Measuring the True Cost of Command Selection: Techniques and Results.CHI'90, 19--25.  ",
      "doi": "10.1145/97243.97247"
    },
    {
      "text": "Fitzmaurice, G., Khan, A., Pieke, R., Buxton, B., Kurtenbach, G. Tracking Menus. UIST 2003, 71--79.  ",
      "doi": "10.1145/964696.964704"
    },
    {
      "text": "Grossman, T., Hinckley, K., Baudisch, P., Agrawala, M., Balakrishnan, R. Hover Widgets: Using the Tracking State to Extend the Capabilities of Pen-Operated Devices. CHI 2006.  ",
      "doi": "10.1145/1124772.1124898"
    },
    {
      "text": "Guimbretiere, F., Winograd, T. FlowMenu: Combining Command, Text, and Data Entry. UIST 2000, 213--216.  ",
      "doi": "10.1145/354401.354778"
    },
    {
      "text": "Hinckley, K., Baudisch, P., Ramos, G., Guimbretiere, F. Design and Analysis of Delimiters for Selection-Action Pen Gesture Phrases in Scriboli. CHI 2005, 451--460.  ",
      "doi": "10.1145/1054972.1055035"
    },
    {
      "text": "Johnson, J., Modes in non-computer devices. Int. J. Man-Mach. Studies, 1990. 32(4): 423--438.  ",
      "doi": "10.1016/S0020-7373%2805%2980140-3"
    },
    {
      "text": "Kurtenbach, G., Buxton, W. The Limits of Expert Performance Using Hierarchic Marking Menus. INTERCHI'93, 482--487. ",
      "doi": "10.5555/164632.164977"
    },
    {
      "text": "Kurtenbach, G., Fitzmaurice, G., Owen, R., Baudel, T. The Hotbox: Efficient Access to a Large Number of Menu-items. CHI'99, 231--237.  ",
      "doi": "10.1145/302979.303047"
    },
    {
      "text": "Kurtenbach, G., Sellen, A., Buxton, W., An emprical evaluation of some articulatory and cognitive aspects of 'marking menus'. J. Human Computer Interaction, 1993. 8(1).",
      "doi": ""
    },
    {
      "text": "Li, Y., Hinckley, K., Guan, Z., Landay, J. A. Experimental Analysis of Mode Switching Techniques in Pen-based User Interfaces. CHI 2005, 461--470.  ",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "Mackay, W. E. Which Interaction Technique Works When? Floating Palettes, Marking Menus and Toolglasses Support Different Task Strategies. ACM AVI 2002, 203--208.  ",
      "doi": "10.1145/1556262.1556294"
    },
    {
      "text": "McLoone, H., Hinckley, K., Cutrell, E. Ergonomic Principles Applied to the Design of the Microsoft Office Computer Keyboard. IEA 2003 International Ergonomics Association.",
      "doi": ""
    },
    {
      "text": "Norman, D. A., Categorization of Action Slips. Psychology Review, 1981. 88(1): p. 1--15.",
      "doi": ""
    },
    {
      "text": "Poller, M., Garter, S., The Effect of Modes on Text Editing by Experienced Editor Users. Human Factors, 26(4): 449--462.",
      "doi": ""
    },
    {
      "text": "Pook, S., Lecolinet, E., Vaysseix, G., Barillot, E. Control Menus: Execution and Control in a Single Interactor. CHI 2000 Extended Abstracts, 263--264.  ",
      "doi": "10.1145/633292.633446"
    },
    {
      "text": "Raskin, J., The Humane Interface: New Directions for Designing Interactive Systems. 2000: ACM Press. ",
      "doi": "10.5555/333103"
    },
    {
      "text": "Sellen, A., Kurtenbach, G., Buxton, W., The Prevention of Mode Errors through Sensory Feedback. J. Human Computer Interaction, 1992. 7(2): p. 141--164.",
      "doi": ""
    },
    {
      "text": "Tesler, L., The smalltalk environment. Byte 6(8): p. 90--147.",
      "doi": ""
    },
    {
      "text": "Wilson, F. R., The Hand: How its use shapes the brain, language, and human culture. 1998, New York: Pantheon.",
      "doi": ""
    },
    {
      "text": "Zhao, S., Balakrishnan, R. Simple vs. Compound Mark Hierarchical Marking Menus. UIST 2004, 33--42.  ",
      "doi": "10.1145/1029632.1029639"
    }
  ]
}