{
  "doi": "10.1145/1124772.1124917",
  "title": "Routine patterns of internet use & psychological well-being: coping with a residential move",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "969-978",
  "year": 2006,
  "badges": [],
  "abstract": "In this paper we examine how routine uses of the Internet for communication with family and friends and for entertainment may serve as indicators of overall levels of psychological well-being. Changes in psychological well-being in response to a major life event, such as a residential move, can drive changes in routine uses of the Internet, suggesting Internet-based coping strategies. Specifically, women who report high levels of depressive affect, decrease internet use for communication. Men with similar levels of depressive affect increase internet use for entertainment. We discuss implications of these findings for our understanding of the role of the Internet in everyday behavior and instances of coping with stressful situations.",
  "tags": [
    "residential mobility",
    "gender",
    "internet use",
    "loneliness",
    "depressive affect",
    "stress"
  ],
  "authors": [
    {
      "name": "Irina Shklovski",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100288406/rel-imgonly/portraits_2019-2020_colour1.jpeg",
      "acmid": "81100288406",
      "orcid": "0000-0003-1874-0958"
    },
    {
      "name": "Robert Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "Jonathon Cummings",
      "institution": "Duke University, Durham, NC",
      "img": "/do/10.1145/contrib-81100088002/rel-imgonly/cummings.jpg",
      "acmid": "81100088002",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bargh, J. and Mckenna, K. (2004), The Internet and social life. Annual Review of Psychology, 55. 573--590.",
      "doi": ""
    },
    {
      "text": "Bolger, N., Zuckerman, A. and Kessler, R.C. (2000), Invisible support and adjustment to stress. Journal of Personality & Social Psychology, 79. 953--961.",
      "doi": ""
    },
    {
      "text": "Bryce, J. (2001), The technological transformation of leisure. Social Science Computer Review, 19 (1). 7--16.  ",
      "doi": "10.1177/089443930101900102"
    },
    {
      "text": "Cohen, J., Cohen, P., West, S. and Aiken, L.(2003), Applied multiple regression/correlation analysis for the behavioral sciences. Lawrence Erlbaum, New Jersey.",
      "doi": ""
    },
    {
      "text": "Cohen, S. and Hoberman, H. (1983), Positive Events and Social Supports of Buffers of Life Change Stress. Journal of Applied Social Psychology, 13. 99--125.",
      "doi": ""
    },
    {
      "text": "Davanzo, J. (1983), Repeat migration in the United States: Who moves back and who moves on? The Review of Economics and Statistics, 65 (4). 552--559.",
      "doi": ""
    },
    {
      "text": "Diener, E., Emmons, R., Larsen, J. and Griffin, S. (1985), The satisfaction with life scale. Journal of Personality Assessment, 49 (1). 71--75.",
      "doi": ""
    },
    {
      "text": "Fischer, C. (1982), To dwell among friends: Personal networks in town and city. U. of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Folkman, S. and Moskowitz, J. (2000), Stress, Positive Emotion, and Coping. Current Directions in Psychological Science, 9 (4). 115--118.",
      "doi": ""
    },
    {
      "text": "Fox, S. (2005), Digital Divisions. Washington DC: Pew Internet & American Life Project.",
      "doi": ""
    },
    {
      "text": "Heller, T. (1982), The effects of involuntary residential relocation: A review. American Journal of Community Psychology, 10 (4). 471--492.",
      "doi": ""
    },
    {
      "text": "Hiller, H. and Franz, T. (2004), New ties, old ties and lost ties: The use of the internet in Diaspora. New Media & Society, 6 (6). 731--752.",
      "doi": ""
    },
    {
      "text": "Hoffman, D., Novak, T. and Venkatesh, A. (2004), Has the Internet become indispensable? Communications of the ACM, 47 (7). 37--42.  ",
      "doi": "10.1145/1005817.1005818"
    },
    {
      "text": "Jackson, L., Barbatsis, G., Von Eye, A., Biocca, F., Zhao, Y. and Fitzgerald, H. (2003), Internet use in low-income families: Implications for the digital divide. IT & Society, 1 (5). 141--165.",
      "doi": ""
    },
    {
      "text": "John, O., Donahue, E. and Kentle, R. (1991). The Big Five Inventory: Versions 4a and 54. The Institute of Personality and Social Research, UC Berkeley.",
      "doi": ""
    },
    {
      "text": "Kraut, R., Kiesler, S., Boneva, B., Cummings, J., Helgeson, V. and Crawford, A. (2002), Internet paradox revisited. Journal of Social Issues, 58 (1). 49--74.",
      "doi": ""
    },
    {
      "text": "Kubey, R. and Csikszentmihalyi, M. (1990), Television as escape: Subjective experience before an evening of heavy viewing. Communication Reports, 3 (2). 92--100.",
      "doi": ""
    },
    {
      "text": "Lazarus, R. (1993), From psychological stress to the emotions: A history of changing outlooks. Annual Review of Psychology, 44. 1--21.",
      "doi": ""
    },
    {
      "text": "Litwak, E. and Kulis, S. (1987), Technology, Proximity, and Measures of Kin Support. Journal of Marriage & Family, 49 (3). 649--661.",
      "doi": ""
    },
    {
      "text": "Magdol, L. (2002), Is moving gendered? The effects of residential mobility on the psychological well-being of men and women. Sex Roles, 47 (11). 553--560.",
      "doi": ""
    },
    {
      "text": "Moos, R. and Moos, B. (1994), Family environment scale manual: Development, applications, research. Consulting Psychologist Press, Palo Alto, CA.",
      "doi": ""
    },
    {
      "text": "Newell, A., Perlis, A. and Simon, H. (1967), What is computer science? Science, 157. 1373--1374.",
      "doi": ""
    },
    {
      "text": "Perlman, D. and Peplau, L. (1981), Toward a social psychology of loneliness. In Duck, S. and Gilmour, R. eds. Personal Relationships 3: Personal Relationships in Disorder., Academic Press, London.",
      "doi": ""
    },
    {
      "text": "Radloff, L. (1991), The Use of the CES-D Scale in Adolescents and Young Adults. Journal of Youth and Adolescence, 20 (2). 149--166.",
      "doi": ""
    },
    {
      "text": "Rohlfing, M. (1995), \"\"Doesn't anybody stay in one place anymore?\"\" An exploration of under-studied phenomenon of long-distance relationships. In Wood, J. and Duck, S. eds. Understudied relationships; Off the beaten track, Sage Publications, Thousand Oaks.",
      "doi": ""
    },
    {
      "text": "Russell, D., Peplau, L. and Cutrona, C. (1980), Revised UCLA loneliness scale: Concurrent and discriminant validity evidence. Journal of Personality & Social Psychology, 39 (3). 472--480.",
      "doi": ""
    },
    {
      "text": "Schachter, J. (2004). Geographic mobility: 2002-2003: U.S. Census Bureau.",
      "doi": ""
    },
    {
      "text": "Schull, N. (2002), Escape mechanism: Women, caretaking and compulsive machine gambling. Working paper, 41.",
      "doi": ""
    },
    {
      "text": "Stockols, D. and Shumacker, S. (1982), Psychological context of residential mobility and well-being. Journal of Social Issues, 38 (3). 149--171.",
      "doi": ""
    },
    {
      "text": "Taylor, A. and Swan, L. (2005), Artful systems in the home. In Proc. CHI 2005, ACM Press.  ",
      "doi": "10.1145/1054972.1055060"
    },
    {
      "text": "Tourangeau, R. (2000), Remembering What Happened: Memory Errors and Survey Reports. In Stone, A., Turkkan, J., Bachrach, C., Jobe, J., Kurtzman, H. and Cain, V. eds. The Science of Self-Report: Implications for Research and Practice, Lawrence Erlbaum, New Jersey, 29--48.",
      "doi": ""
    },
    {
      "text": "Weiss, R. (1990), Losses associated with mobility. In Fisher, S. and Cooper, C. eds. On the move: the psychology of change and transition, Wiley & Sons, West Sussex, 3--12.",
      "doi": ""
    },
    {
      "text": "Wethington, E. and Kessler, R. (1986), Perceived support, received support and adjustment to stressful life events. Journal of Health & Social Behavior, 27, 78--89.",
      "doi": ""
    },
    {
      "text": "Wood, W. and Tam, L. (2005), Changing circumstances, disrupting habits. Journal of Personality & Social Psychology, 88 (6). 918--933.",
      "doi": ""
    },
    {
      "text": "Yee, N. (2001). The Norrathian scrolls: A study of EverQuest (version 2.5). Retrieved December 15, 2004, from http://www.nickyee.com/eqt/report.html.",
      "doi": ""
    }
  ]
}