{
  "doi": "10.1145/1124772.1124897",
  "title": "Speech pen: predictive handwriting based on ambient multimodal recognition",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "851-860",
  "year": 2006,
  "badges": [],
  "abstract": "It is tedious to handwrite long passages of text by hand. To make this process more efficient, we propose predictive handwriting that provides input predictions when the user writes by hand. A predictive handwriting system presents possible next words as a list and allows the user to select one to skip manual writing. Since it is not clear if people are willing to use prediction, we first run a user study to compare handwriting and selecting from the list. The result shows that, in Japanese, people prefer to select, especially when the expected performance gain from using selection is large. Based on these observations, we designed a multimodal input system, called speech-pen, that assists digital writing during lectures or presentations with background speech and handwriting recognition. The system recognizes speech and handwriting in the background and provides the instructor with predictions for further writing. The speech-pen system also allows the sharing of context information for predictions among the instructor and the audience; the result of the instructor's speech recognition is sent to the audience to support their own note-taking. Our preliminary study shows the effectiveness of this system and the implications for further improvements.",
  "authors": [
    {
      "name": "Kazutaka Kurihara",
      "institution": "University of Tokyo",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81341492567",
      "orcid": "missing"
    },
    {
      "name": "Masataka Goto",
      "institution": "National Institute of Advanced Industrial Science and Technology, Japan",
      "img": "/do/10.1145/contrib-81100017919/rel-imgonly/masatakagoto.jpg",
      "acmid": "81100017919",
      "orcid": "0000-0003-1167-0977"
    },
    {
      "name": "Jun Ogata",
      "institution": "National Institute of Advanced Industrial Science and Technology, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81337492083",
      "orcid": "missing"
    },
    {
      "name": "Takeo Igarashi",
      "institution": "University of Tokyo",
      "img": "/do/10.1145/contrib-81100444444/rel-imgonly/photo_large.jpg",
      "acmid": "81100444444",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abowd, Classroom 2000: An Experiment with the Instrumentation of a Living Educational Environment. IBM Systems Journal, Special issue on Pervasive Computing, 38, 4, pp. 508--530, 1999.  ",
      "doi": "10.1147/sj.384.0508"
    },
    {
      "text": "Accot et al, More Than Dotting the I's - Foundations for Crossing-based Interfaces. Proc. CHI'02, pp.73--80, 2002.  ",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Anderson et al., A Study of Digital Ink in Lecture Presentation. Proc. CHI'04, pp.567--574, 2004.  ",
      "doi": "10.1145/985692.985764"
    },
    {
      "text": "Apitz et al, CrossY: A Crossing-based Drawing Application. Proc. UIST'04, pp.3--12, 2004.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Clarkson et al., An Empirical Study of Typing Rates on mini-QWERTY Keyboards. CHI'05 Extended Abstracts, pp.1288--1291, 2005.  ",
      "doi": "10.1145/1056808.1056898"
    },
    {
      "text": "Darragh et al., The Reactive Keyboard: A Predictive typing aid. IEEE Computer 23, 11, pp.41--49, 1990.  ",
      "doi": "10.1109/2.60879"
    },
    {
      "text": "Davis et al., NotePals: Lightweight Note Sharing by the Group, for the Group. Proc. CHI'99, pp. 338--345, 1999.  ",
      "doi": "10.1145/302979.303107"
    },
    {
      "text": "Denoue et al., Shared Freeform Input for Note Taking across Devices. Proc. CHI'03, pp.170--171, 2003.  ",
      "doi": "10.1145/765891.765943"
    },
    {
      "text": "Elrod et al., Liveboard: A Large Interactive Display Supporting Group meetings, Presentations, and Remote Collaboration. Proc. CHI'92, pp.599--607, 1992.  ",
      "doi": "10.1145/142750.143052"
    },
    {
      "text": "Feng, An Integrated Mulimedia Environment for Speech Recognition Using Handwriting and Written Gestures. Proc. HICSS'03, pp. 128b, 2003. ",
      "doi": "10.5555/820752.821583"
    },
    {
      "text": "Fridland et al., Teaching with an Intelligent Electric Chalkboard. ACM SIGMM Workshop on Effective Telepresence, pp.16--23, 2004.  ",
      "doi": "10.1145/1026776.1026782"
    },
    {
      "text": "Fukushima et al., A Predictive Pen-Based Japanese Text Input Method and Its Evaluation. Transactions of Information Processing Society of Japan 37, 1, pp.23--30, 1996, in Japanese.",
      "doi": ""
    },
    {
      "text": "Getschow et al., A Systematic Approach to Design a Minimum Distance Alphabetical Keyboard. Proc. RESNA'86, pp.396--398, 1986.",
      "doi": ""
    },
    {
      "text": "Goto et al., Speech Completion: On-demand Completion Assis-tance Using Filled Pauses for Speech Input Interface. Proc. ICSLP'02, pp.1489--1492, 2002.",
      "doi": ""
    },
    {
      "text": "Goto et al., Speech Spotter: On-demand Speech Recognition in Human-Human Conversation on the Telephone or in Face-to-Face Situations. Proc. ICSLP'04, pp.1533--1536, 2004.",
      "doi": ""
    },
    {
      "text": "Hindus et al., Ubiquitous Audio: Capturing Spontaneous Collaboration. Proc. CSCW'92, pp.210--217, 1992.  ",
      "doi": "10.1145/143457.143481"
    },
    {
      "text": "Iwata et al., A Study on the Participation Method of Distant Learners into the IT-supported Lecture Using an Interactive Electric Whiteboard. Transaction of Information Processing Society of Japan, 2002, 119, pp.33--40, 2002, in Japanese.",
      "doi": ""
    },
    {
      "text": "Kaiser, Multimodal New Vocabulary Recognition through Speech and Handwriting in a Whiteboard Scheduling Application. Proc.IUI'05, pp.51--58, 2005.  ",
      "doi": "10.1145/1040830.1040851"
    },
    {
      "text": "Kam et al., Livenotes: A System for Cooperative and Augmented Note-Taking in Lectures. Proc. CHI'05, pp.531--540, 2005.  ",
      "doi": "10.1145/1054972.1055046"
    },
    {
      "text": "Kawahara et al., Recent Progress of Open-source LVCSR Engine Julius and Japanese Model Repository. Proc. CSLP'04, pp.3069--3072, 2004.",
      "doi": ""
    },
    {
      "text": "Kristensson et al., SHARK2: A Large Vocabulary Shorthand Writing System for Pen-based Computers. Proc. UIST'04, pp.43--52, 2004.  ",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Lin et al., Chinese Character Entry on Mobile Phones: A longitudinal Investigation, Interacting with Computers, 17, 2, p121--146, 2005.  ",
      "doi": "10.1016/j.intcom.2004.11.003"
    },
    {
      "text": "Lyons et al., Augmenting Conversations Using Dual-Purpose Speech. Proc. IST'04, pp-237--246, 2004.  ",
      "doi": "10.1145/1029632.1029674"
    },
    {
      "text": "Masui, An Efficient Text Input Method for Pen-based Computers. Proc. CHI'98, pp.328--335, 1998.  ",
      "doi": "10.1145/274644.274690"
    },
    {
      "text": "Microsoft Mobile PC and Tablet PC Developer Center, http://msdn.microsoft.com/mobility/tabletpc/",
      "doi": ""
    },
    {
      "text": "MyFont, software by TechnoAdvance Co., Ltd., http://www.techno-advance.co.jp/product/myfont/",
      "doi": ""
    },
    {
      "text": "Ogata et al., Speech Repair: Quick Error Correction Just by Using Selection Operation for Speech Input Interface. Proc. Eurospeech'05, pp.133--136, 2005.",
      "doi": ""
    },
    {
      "text": "Oviatt et al., Individual Differences in Multimodal Integration Patterns: What Are They And Why Do They Exist?. Proc. CHI'05, pp.241--249, 2005.  ",
      "doi": "10.1145/1054972.1055006"
    },
    {
      "text": "Oviatt, Mutual Disambiguation of Recognition Errors in a Multimodal Architecture. Proc. CHI'99, pp.576--583, 1999.  ",
      "doi": "10.1145/302979.303163"
    },
    {
      "text": "Pedersen et al., Tivoli: an Electric Whiteboard for Informal Workgroup Meetings. Proc. CHI'93, pp.391--398, 1993.  ",
      "doi": "10.1145/169059.169309"
    },
    {
      "text": "PowerPoint, software by Microsoft Corporation, http://www.microsoft.com/office/powerpoint/prodinfo/",
      "doi": ""
    },
    {
      "text": "Schilit et al., Beyond Paper: Supporting Active Reading with Free Form Digital Ink Annotations. Proc. CHI'98, pp.249--256, 1998.  ",
      "doi": "10.1145/274644.274680"
    },
    {
      "text": "Stifelman et al., The Audio Notebook. Proc. CHI'01, pp.182--189, 2001.  ",
      "doi": "10.1145/365024.365096"
    },
    {
      "text": "Vertanen, Efficient Computer Interfaces Using Continuous Gestures, Language Models, and Speech. M.Phil Thesis, University of Cambridge, 2004.",
      "doi": ""
    },
    {
      "text": "Wang et al., Chinese Input with Keyboard and Eye-tracking: An Anatomical Study. Proc. CHI'01, pp.349--356, 2001.  ",
      "doi": "10.1145/365024.365298"
    },
    {
      "text": "Wilcox et al., Dynomite: A Dynamically Organized Ink and Audio Notebook. Proc. CHI'97, pp.186--193, 1997.  ",
      "doi": "10.1145/258549.258700"
    }
  ]
}