{
  "doi": "10.1145/1124772.1124792",
  "title": "Dogear: Social bookmarking in the enterprise",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "111-120",
  "year": 2006,
  "badges": [],
  "abstract": "We describe a social bookmarking service de-signed for a large enterprise. We discuss design principles addressing online identity, privacy, information discovery (including search and pivot browsing), and service extensi-bility based on a web-friendly architectural style. In addi-tion we describe the key design features of our implementa-tion. We provide the results of an eight week field trial of this enterprise social bookmarking service, including a de-scription of user activities, based on log file analysis. We share the results of a user survey focused on the benefits of the service. The feedback from the user trial, comprising survey results, log file analysis and informal communica-tions, is quite positive and suggests several promising en-hancements to the service. Finally, we discuss potential extension and integration of social bookmarking services with other corporate collaborative applications.",
  "tags": [
    "folksonomies",
    "tags",
    "social bookmarking",
    "social software"
  ],
  "authors": [
    {
      "name": "David R. Millen",
      "institution": "IBM Research, Cambridge",
      "img": "/do/10.1145/contrib-81100086599/rel-imgonly/81100086599.jpg",
      "acmid": "81100086599",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Feinberg",
      "institution": "IBM Research, Cambridge",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311482005",
      "orcid": "missing"
    },
    {
      "name": "Bernard Kerr",
      "institution": "IBM Research, Cambridge",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100007626",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abrams, D., Baecker, R., and Chignell, M. 1998. Infor-mation archiving with bookmarks: personal Web space construction and organization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Los Angeles, California, United States, April 18 - 23, 1998).  ",
      "doi": "10.1145/274644.274651"
    },
    {
      "text": "Buchanan, G. and Hinze, A. 2005. A generic alerting service for digital libraries. In Proceedings of the 5th ACM/IEEE-CS Joint Conference on Digital Libraries (Denver, CO, USA, June 07 - 11, 2005). JCDL '05. ACM Press, New York, NY, 131--140.  ",
      "doi": "10.1145/1065385.1065414"
    },
    {
      "text": "Del.icio.us; http://del.icio.us/",
      "doi": ""
    },
    {
      "text": "Fielding, Roy Thomas. Architectural Styles and the De-sign of Network-based Software Architectures. Doctoral dissertation, University of California, Irvine, 2000. ",
      "doi": "10.5555/932295"
    },
    {
      "text": "flickr : http://www.flickr.com/",
      "doi": ""
    },
    {
      "text": "Golder, S. and Huberman, B. A. 2005 The Structure of Collaborative Tagging Systems. Technical report, In-formation Dynamics Lab, HP Labs.",
      "doi": ""
    },
    {
      "text": "Kanawati, R. and Malek, M. 2002. A multi-agent system for collaborative bookmarking. In Proceedings of the First international Joint Conference on Autonomous Agents and Multiagent Systems: Part 3 (Bologna, Italy, July 15 - 19, 2002). AAMAS '02. ACM Press, New York, NY, 1137--1138.  ",
      "doi": "10.1145/545056.545084"
    },
    {
      "text": "Keller, R. M., Wolfe, S. R., Chen, J. R., Rabinowitz, J. L., and Mathe, N. 1997. A bookmarking service for or-ganizing and sharing URLs. In Selected Papers From the Sixth international Conference on World Wide Web (Santa Clara, California, United States). 1103--1114. ",
      "doi": "10.5555/283554.283358"
    },
    {
      "text": "Marais, H. and Bharat, K. 1997. Supporting cooperative and personal surfing with a desktop assistant. In Pro-ceedings of the 10th Annual ACM Symposium on User interface Software and Technology (Banff, Alberta, Canada, October 14 - 17, 1997). UIST '97. ACM Press, New York, NY, 129--138.  ",
      "doi": "10.1145/263407.263531"
    },
    {
      "text": "Millen, D. R. and Patterson, J. F. 2002. Stimulating so-cial engagement in a community network. In Proceed-ings of the 2002 ACM Conference on Computer Sup-ported Cooperative Work (New Orleans, Louisiana, USA, November 16 - 20.  ",
      "doi": "10.1145/587078.587121"
    },
    {
      "text": "My Web 2.0 Beta; http:// myweb2.search.yahoo.com/",
      "doi": ""
    },
    {
      "text": "Nonnecke, B. and Preece, J. 2000. Lurker demograph-ics: counting the silent. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (The Hague, The Netherlands, April 01 - 06, 2000). CHI '00. ACM Press, New York, NY, 73--80.  ",
      "doi": "10.1145/332040.332409"
    },
    {
      "text": "Technorati: http://www.technorati.com/",
      "doi": ""
    },
    {
      "text": "Wasserman, S., & Faust, K.1994. Social Network Analysis: Methods and Applications. New York and Cambridge, ENG: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Weinberger, D. Taxonomies to Tags: From Trees to Piles of Leaves. Release 1.0 February, 2005, pp. 2--32.",
      "doi": ""
    },
    {
      "text": "Wittenburg, K., Das, D., Hill, W., Stead, L. 1995. Group asynchronous browsing on the World Wide Web, in Proceedings of the 4th International WWW Conference, (Boston MA, December 1995), O'Reilly & Associates, 51--62.",
      "doi": ""
    }
  ]
}