{
  "doi": "10.1145/1124772.1124910",
  "title": "Investigating health management practices of individuals with diabetes",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "927-936",
  "year": 2006,
  "badges": [],
  "abstract": "Chronic diseases, endemic in the rapidly aging population, are stretching the capacity of healthcare resources. Increasingly, individuals need to adopt proactive health attitudes and contribute to the management of their own health. We investigate existing diabetes self-management practices and ways in which reflection on prior actions impacts future lifestyle choices. The findings suggest that individuals generate and evaluate hypotheses regarding health implications of their actions. Thus, health-monitoring applications can assist individuals in making educated choices by facilitating discovery of correlations between their past actions and health states. Deployment of an early prototype of a health-monitoring application demonstrated the need for careful presentation techniques to promote more robust understanding and to avoid reinforcement of biases.",
  "authors": [
    {
      "name": "Lena Mamykina",
      "institution": "Siemens Corporate Research Inc.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500656179",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth D. Mynatt",
      "institution": "Georgia Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331104",
      "orcid": "missing"
    },
    {
      "name": "David R. Kaufman",
      "institution": "Columbia University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406597727",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Beckmann, C., Consolvo, S., LaMarca, A., 2004, Some assembly required: Supporting end-user sensor installation in domestic ubiquitous computing environments. Proceedings of the Sixth International Conference on Ubiquitous Computing (Ubicomp 2004). 6--10 September 2004. Nottingham, UK.",
      "doi": ""
    },
    {
      "text": "Bodenheimer, T., et al. 2002. \"\"Patient self-management of chronic disease in primary care.\"\" JAMA 288(19): 2469--75.",
      "doi": ""
    },
    {
      "text": "Bradley MM, Lang PJ., 1994, Measuring emotion: the Self-Assessment Manikin and the Semantic Differential, J Behav Ther Exp Psychiatry. 1994 Mar;25(1):49--59.",
      "doi": ""
    },
    {
      "text": "Card, S., Keynote Address: From Information Visualization to Sensemaking: Connecting the Mind's Eye to the Mind's Muscle, in Proceedings of the IEEE Symposium on Information Visualization (InfoVis'04) pp.: xii--xii.  ",
      "doi": "10.5555/1038262.1038773"
    },
    {
      "text": "Consolvo, S. and Towle, J., 2005, Evaluating an ambient display for the home. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (Portland, OR, USA, April 02 - 07, 2005). CHI '05, pp.1304--1307.  ",
      "doi": "10.1145/1056808.1056902"
    },
    {
      "text": "Dourish, P., and Buttoon, G. 1998, On \"Technomethodology\": Foundational Relationships between Ethnomethodology and System Design. Human-Computer Interaction, 13(4), 395--432.  ",
      "doi": "10.1207/s15327051hci1304_2"
    },
    {
      "text": "Fitton, D, Chevherst, K., Rouncefield, M., Dix, A. and Crabtree, A., 2004 Probing Technology with Technology Probes. Paper presented at the Equator Workshop on Record and Replay Technologies, February 12-13, London: Equator IRC.",
      "doi": ""
    },
    {
      "text": "Fishkin, K.P., Wang, M., Borriello, G. \"\"A Ubiquitous System for Medication Monitoring,\"\" Pervasive 2004.",
      "doi": ""
    },
    {
      "text": "Gaver, B., Dunne, T., and Pacenti, E. 1999. Design: Cultural probes. interactions 6, 1 (Jan. 1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Glaser, Barney G. Theoretical Sensitivity: Advances in the Methodology of Grounded Theory. Mill Valley, CA: The Sociology Press, 1978.",
      "doi": ""
    },
    {
      "text": "Hayes, G.R., Kientz, J.A., Truong, K.N., White, D.R., Abowd, G.D., Pering, T. Designing Capture Applications to Support the Education of Children with Autism. Proceedings of UBICOMP 2004: The 6th International Conference on Ubiquitous Computing (September 7-10, Nottingham, England), 2004.",
      "doi": ""
    },
    {
      "text": "Hollan, J., Hutchins, E., and Kirsh, D. 2000. Distributed cognition: toward a new foundation for human-computer interaction research. ACM Trans. Comput.-Hum. Interact. 7, 2 (Jun. 2000), 174--196.  ",
      "doi": "10.1145/353485.353487"
    },
    {
      "text": "Hutchinson, H., Mackay, W., Westerlund, B., Bederson, B. B., Druin, A., Plaisant, C., Beaudouin-Lafon, M., Conversy, S., Evans, H., Hansen, H., Roussel, N., and Eiderbäck, B. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA, April 05 - 10, 2003). CHI '03, pp.17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Intille, S. S., \"\"Ubiquitous Computing Technology for Just-in-Time Motivation of Behavior Change (Position Paper),\"\" in Proceedings of the UbiHealth Workshop, 2003.",
      "doi": ""
    },
    {
      "text": "Jafarinaimi, N., Forlizzi, J., Hurst, A., and Zimmerman, J. 2005. Breakaway: an ambient display designed to change human behavior. In CHI '05 Extended Abstracts on Human Factors in Computing Systems (Portland, OR, USA, April 02 - 07, 2005). CHI '05, 1945--1948.  ",
      "doi": "10.1145/1056808.1057063"
    },
    {
      "text": "Kaufman, D.R., Starren, J, Patel, V.L., Morin, P.C., Hilliman, C., Pevzner, J, Weinstock, Goland, R. & Shea, S. (2003). A cognitive framework for understanding barriers to the productive use of a diabetes home telemedicine system. In M. A. Musen, C. P. Friedman and J. M. Teich (eds.) Proceedings of the American Medical Informatics Association Symposium, Fall 2003 (pp. 356--360).",
      "doi": ""
    },
    {
      "text": "Mihailidis, A. (2002, November 9 - 12). Intelligent supportive home environments for older adults with dementia: Current and future Research. Gerontechnology 2002. The International Society for Gerontechnology Conference, Miami Beach, FL, Gerontechnology (Congress Issue), 2 (1), 133.",
      "doi": ""
    },
    {
      "text": "Morris, M., Lundell, J., Dishman, E., Catalyzing social interaction with ubiquitous computing: a needs assessment of elders coping with cognitive decline. CHI Extended Abstracts 2004: 1151--1154.  ",
      "doi": "10.1145/985921.986011"
    },
    {
      "text": "Munguia Tapia, E., Intille S. S., Larson, K., \"\"Activity recognition in the home setting using simple and ubiquitous sensors,\"\" in Proceedings of PERVASIVE 2004, pp. 158--175.",
      "doi": ""
    },
    {
      "text": "Mynatt, E. D., Rowan, J., Craighill, S., and Jacobs, A. 2001. Digital family portraits: supporting peace of mind for extended family members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seattle, Washington, United States). CHI '01, pp.333--340.  ",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "National Diabetes Association Facts and Figures Sheet, www.diabetes.org",
      "doi": ""
    },
    {
      "text": "Patel, V.L., Branch, T., & Arocha, J. (2002). Errors in interpreting quantities as procedures: The case of pharmaceutical labeling. International Journal of Medical Informatics, 65, 193--211.",
      "doi": ""
    },
    {
      "text": "Prochaska, J.O., Prochaska, J.M., Why Don't Continents Move? Why Don't People Change? Journal of Psychotherapy Intergration, Vol.9, No. 1, 1999, pp.83--101.",
      "doi": ""
    },
    {
      "text": "Rowan, J. and Mynatt, E. D. 2005. Digital Family Portrait Field Trial: Support for Aging in Place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, CHI '05. pp.521--530.  ",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Wagner, E., & Groves, T. (2002). Care for chronic diseases. British Medical Journal; 325: 913--914.",
      "doi": ""
    },
    {
      "text": "Wason, P.C. (1960). On the failure to eliminate hypotheses in a conceptual task. Quarterly Journal of Experimental Psychology, 12, 129--140.",
      "doi": ""
    },
    {
      "text": "Weiser, M., \"\"Open House\"\". in Review, the web magazine of the Interactive Telecommunications Program of New York University. March 1996, ITP Review 2.0.",
      "doi": ""
    },
    {
      "text": "http://www.glucowatch.com/",
      "doi": ""
    },
    {
      "text": "http://aspe.hhs.gov/daltcp/reports/meacmpes.htm",
      "doi": ""
    },
    {
      "text": "http://www.fda.gov/",
      "doi": ""
    }
  ]
}