{
  "doi": "10.1145/1124772.1124937",
  "title": "Direct pointer: direct manipulation for large-display interaction using handheld cameras",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1107-1110",
  "year": 2006,
  "badges": [],
  "abstract": "This paper describes the design and evaluation of a technique, Direct Pointer, that enables users to interact intuitively with large displays using cameras equipped on handheld devices, such as mobile phones and personal digital assistant (PDA). In contrast to many existing interaction methods that attempt to address the same problem, ours offers direct manipulation of the pointer position with continuous visual feedback. The primary advantage of this technique is that it only requires equipment that is readily available: an electronic display, a handheld digital camera, and a connection between the two. No special visual markers in the display content are needed, nor are fixed cameras pointing at the display. We evaluated the performance of Direct Pointer as an interaction product, showing that it performs as well as comparable techniques that require more sophisticated equipment.",
  "authors": [
    {
      "name": "Hao Jiang",
      "institution": "Tsinghua University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606428",
      "orcid": "missing"
    },
    {
      "name": "Eyal Ofek",
      "institution": "Microsoft Research Asia, Beijing, China",
      "img": "/do/10.1145/contrib-81100064088/rel-imgonly/fn5a3383_small.jpg",
      "acmid": "81100064088",
      "orcid": "0000-0003-4750-1569"
    },
    {
      "name": "Neema Moraveji",
      "institution": "Microsoft Research Asia, Beijing, China",
      "img": "/do/10.1145/contrib-81100082877/rel-imgonly/23798_10150163806235134_889065133_11833318_3583492_n.jpg",
      "acmid": "81100082877",
      "orcid": "missing"
    },
    {
      "name": "Yuanchun Shi",
      "institution": "Tsinghua University, Beijing, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647319",
      "orcid": "0000-0003-2273-6927"
    }
  ],
  "references": [
    {
      "text": "Ballagas, R., Rohs, M. and Sheridan, J.G. Sweep and Point & Shoot: Phonecam-Based Interactions for Large Public Displays. Proc CHI'05, (2005).  ",
      "doi": "10.1145/1056808.1056876"
    },
    {
      "text": "ISO. Ergonomic requirements for office work with visual display terminals (VDTs) - Requirements for non-keyboard input devices. ISO 9241-9, (2000).",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S. and Jusoh, S. An Evaluation of Two InputDevices for Remote Pointing. Proc EHCI'01, (2001). ",
      "doi": "10.5555/645350.650716"
    },
    {
      "text": "MacKenzie, I.S., Kauppinen, T. and Silfverberg, M. Accuracy Measures for Evaluating Computer Pointing Devices. Proc CHI'01, (2001).  ",
      "doi": "10.1145/365024.365028"
    },
    {
      "text": "Miyaoku, K., Higashino, S. and Tonomura, Y. C-Blink: A Hue-Difference-Based Light Signal Marker for Large Screen Interaction via Any Mobile Terminal. Proc UIST'04, (2004).  ",
      "doi": "10.1145/1029632.1029657"
    },
    {
      "text": "Oh, J.-Y. and Stuerzlinger, W. Laser Pointers as Collaborative Pointing Devices. Proc Graphics Interface'02, (2002).",
      "doi": ""
    },
    {
      "text": "Olsen, D.R.J. and Nielsen, T. Laser Pointer Interaction. Proc CHI'01, (2001).  ",
      "doi": "10.1145/365024.365030"
    },
    {
      "text": "Shi, J. and Tomasi, C. Good Features to Track. Proc CVPR'94, pages 593--600, (1994).",
      "doi": ""
    },
    {
      "text": "Sukthankar, R., Stockton, R. and Mullin, P. Smarter Presentations: Exploiting Homography in Camera-Projector Systems. Proc ICCV'01, (2001).",
      "doi": ""
    },
    {
      "text": "Xiang, C. and Ravin, B. VisionWand: Interaction Techniques for Large Displays using a Passive Wand Tracked in 3D. Proc UIST'03, (2003).  ",
      "doi": "10.1145/964696.964716"
    }
  ]
}