{
  "doi": "10.1145/1124772.1124933",
  "title": "Zone and polygon menus: using relative position to increase the breadth of multi-stroke marking menus",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1077-1086",
  "year": 2006,
  "badges": [],
  "abstract": "We present Zone and Polygon menus, two new variants of multi-stroke marking menus that consider both the relative position and orientation of strokes. Our menus are designed to increase menu breadth over the 8 item limit of status quo orientation-based marking menus. An experiment shows that Zone and Polygon menus can successfully increase breadth by a factor of 2 or more over orientation-based marking menus, while maintaining high selection speed and accuracy. We also discuss hybrid techniques that may further increase menu breadth and performance. Our techniques offer UI designers new options for balancing menu breadth and depth against selection speed and accuracy.",
  "authors": [
    {
      "name": "Shengdong Zhao",
      "institution": "University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328491174",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "University of California at Berkeley, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    },
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    }
  ],
  "references": [
    {
      "text": "Balakrishnan, R., & Patel, P. (1998). The PadMouse: Facilitating selection and spatial positioning for the nondominant hand. ACM CHI Conference on Human Factors in Computing Systems. pp. 9--16.  ",
      "doi": "10.1145/274644.274646"
    },
    {
      "text": "Buxton, W. (1986) Chunking and phrasing and the design of human-computer dialogues. Readings in humancomputer interaction: Towards the year 2000, R. Baecker, J. Grudin, W. Buxton, S. Greenberg., Editors. 1986, Morgan Kaufmann. pp. 494--499. ",
      "doi": "10.5555/212925.212970"
    },
    {
      "text": "Friedlander, N., Schlueter, K. & Mantei, M. (1998). Bullseye! when Fitts' law doesn't fit. ACM CHI Conference on Human Factors in Computing Systems. pp. 257--264.  ",
      "doi": "10.1145/274644.274681"
    },
    {
      "text": "Guimbretière, F., Stone, M. & Winograd, T. (2001). Fluid interaction with high-resolution wall-size displays. ACM UIST symposium on User interface software and technology. pp. 21--30.  ",
      "doi": "10.1145/502348.502353"
    },
    {
      "text": "Jacko, J. A. & Salvendy, G. (1996). Hierarchical menu design: Breadth, depth, and task complexity. Perceptual and Motor Skills, 82, pp. 1187--1201.",
      "doi": ""
    },
    {
      "text": "Kiger, J. I. (1984). The depth/breadth tradeoff in the design of menu-driven interfaces. International Journal of Man-Machine Studies, 20, pp. 201--213.  ",
      "doi": "10.1016/S0020-7373%2884%2980018-8"
    },
    {
      "text": "Kurtenbach, G. (1993). The design and evaluation of marking menus. Ph.D. Thesis. University of Toronto. ",
      "doi": "10.5555/193157"
    },
    {
      "text": "Kurtenbach, G., & Buxton, W. (1993). The limits of expert performance using hierarchical marking menus. ACM CHI Conference on Human Factors in Computing Systems. pp. 35--42.  ",
      "doi": "10.1145/169059.169426"
    },
    {
      "text": "Kurtenbach, G., & Buxton, W. (1994). User learning and performance with marking menus. ACM CHI Conference on Human Factors in Computing Systems. pp. 258--264.  ",
      "doi": "10.1145/191666.191759"
    },
    {
      "text": "Kurtenbach, G., Fitzmaurice, G.W., Owen, R.N., & Baudel, T. (1999). The Hotbox: efficient access to a large number of menu-items. ACM CHI Conference on Human Factors in Computing Systems. pp. 231--237.  ",
      "doi": "10.1145/302979.303047"
    },
    {
      "text": "Larson, K., & Czerwinski, M. (1998). Web page design: Implications of memory, structure and scent for information retrieval. ACM CHI Conference on Human Factors in Computing Systems. pp. 25--32.  ",
      "doi": "10.1145/274644.274649"
    },
    {
      "text": "McGuffin, M.J., Burtnyk, N., & Kurtenbach, G. (2002). FaST Sliders: Integrating Marking Menus and the Adjustment of Continuous Values. The Graphics Interface Conference. pp. 35-41. 13. Perlin, K. (1998). Quikwriting: Continuous stylus-based text entry, ACM UIST Symposium on User Interface Software and Technology, pp. 215--216.  ",
      "doi": "10.1145/288392.288613"
    },
    {
      "text": "Pook, S., Lecolinet, E., Vaysseix, G. & Barillot, E. (2000). Control menus: Execution and control in a single interactor. ACM CHI Conference on Human Factors in Computing Systems. pp. 263--264.  ",
      "doi": "10.1145/633292.633446"
    },
    {
      "text": "Raskin, J. (2000). The Humane Interface: New Directions for Designing Interactive Systems. ACM Press. ",
      "doi": "10.5555/333103"
    },
    {
      "text": "Sellen, A., Kurtenbach, G., & Buxton, W. (1992). The Prevention of Mode Errors through Sensory Feedback. Journal of Human Computer Interaction. pp. 141--164.",
      "doi": "10.1207/s15327051hci0702_1"
    },
    {
      "text": "Wobbrock, J.O., Myers, B.A., & Kembel, J.A. (2003). EdgeWrite: a stylus-based text entry method designed for high accuracy and stability of motion. ACM UIST symposium on User interface software and technology. pp.61--70.  ",
      "doi": "10.1145/964696.964703"
    },
    {
      "text": "Zhao, S. & Balakrishnan, R. (2004). Simple vs. compound mark hierarchical marking menus. ACM UIST Symposium on User Interface Software and Technology, pp. 33--44.  ",
      "doi": "10.1145/1029632.1029639"
    }
  ]
}