{
  "doi": "10.1145/1124772.1124782",
  "title": "Peekaboom: a game for locating objects in images",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "55-64",
  "year": 2006,
  "badges": [],
  "abstract": "We introduce Peekaboom, an entertaining web-based game that can help computers locate objects in images. People play the game because of its entertainment value, and as a side effect of them playing, we collect valuable image metadata, such as which pixels belong to which object in the image. The collected data could be applied towards constructing more accurate computer vision algorithms, which require massive amounts of training and testing data not currently available. Peekaboom has been played by thousands of people, some of whom have spent over 12 hours a day playing, and thus far has generated millions of data points. In addition to its purely utilitarian aspect, Peekaboom is an example of a new, emerging class of games, which not only bring people together for leisure purposes, but also exist to improve artificial intelligence. Such games appeal to a general audience, while providing answers to problems that computers cannot yet solve.",
  "tags": [
    "web-based games",
    "object segmentation",
    "object recognition",
    "distributed knowledge acquisition",
    "computer vision"
  ],
  "authors": [
    {
      "name": "Luis von Ahn",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100069810/rel-imgonly/81100069810.jpg",
      "acmid": "81100069810",
      "orcid": "missing"
    },
    {
      "name": "Ruoran Liu",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311486203",
      "orcid": "missing"
    },
    {
      "name": "Manuel Blum",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100159946/rel-imgonly/81100159946.gif",
      "acmid": "81100159946",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "von Ahn, L., and Dabbish, L. Labeling Images with a Computer Game. In ACM Conference on Human Factors in Computing Systems (CHI), 2004, pages 319--326.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "von Ahn, L., Ginosar, S., Kedia, M., Ruoran, L. and Blum, M. Improving Accessibility of the Web with a Computer Game. To appear in ACM Conference on Human Factors in Computing Systems (CHI Notes), 2006.  ",
      "doi": "10.1145/1124772.1124785"
    },
    {
      "text": "von Ahn, L., Kedia, M. and Blum, M. Verbosity: A Game for Collecting Common-Sense Facts. To appear in ACM Conference on Human Factors in Computing Systems (CHI Notes), 2006.  ",
      "doi": "10.1145/1124772.1124784"
    },
    {
      "text": "Barnard, K., and Forsyth, D. A. Learning the Semantics of Words and Pictures. International Conference of Computer Vision, 2001, pages 408--415.",
      "doi": ""
    },
    {
      "text": "Duygulu, P., Barnard, K., de Freitas, N., and Forsyth, D. A. Object recognition as machine translation: Learning a lexicon for a fixed image vocabulary. European Conference on Computer Vision, 2002, pages 97--112. ",
      "doi": "10.5555/645318.649254"
    },
    {
      "text": "Fails, J. A., and Olsen, D. R. A Design Tool for Camera-Based Interaction. In ACM Conference on Human Factors in Computing Systems (CHI), 2003, pages 449--456.  ",
      "doi": "10.1145/642611.642690"
    },
    {
      "text": "Fleck, M. M., Forsyth, D. A., and Bregler, C. Finding Naked People. European Conference on Computer Vision, 1996, pages 593--602. ",
      "doi": "10.5555/645310.649014"
    },
    {
      "text": "Flickr Photo Sharing Service. http://www.flickr.com",
      "doi": ""
    },
    {
      "text": "Russell, B.C., Torralba, A. Murphy, K.P. and Freeman, W.T. LabelMe: a database and web-based tool for image annotation. MIT AI Lab Memo AIM-2005-025, September, 2005.",
      "doi": ""
    },
    {
      "text": "Scheniderman, H. and Kanade, T. Object Detection Using the Statistics of Parts. International Journal of Computer Vision, 2002.  ",
      "doi": "10.1023/B%3AVISI.0000011202.85607.00"
    },
    {
      "text": "Stork, D. G. and Lam C. P. Open Mind Animals: Ensuring the quality of data openly contributed over the World Wide Web. AAAI Workshop on Learning with Imbalanced Data Sets, 2000, pages 4--9.",
      "doi": ""
    },
    {
      "text": "Stork, D. G. The Open Mind Initiative. IEEE Intelligent Systems and Their Applications, 14-3, 1999, pp. 19--20.",
      "doi": ""
    },
    {
      "text": "Torralba, A., Murphy, K. P. and Freeman, W. T. The MIT CSAIL Database of objects and scenes. http://web.mit.edu/torralba/www/database.html",
      "doi": ""
    },
    {
      "text": "Torralba, A. An example of the importance of context in vision. http://web.mit.edu/torralba",
      "doi": ""
    }
  ]
}