{
  "doi": "10.1145/1124772.1124905",
  "title": "From awareness to connectedness: the design and deployment of presence displays",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "899-908",
  "year": 2006,
  "badges": [],
  "abstract": "Computer displays can be helpful for making users aware of the remote presence of friends and family. In many of the research projects that have explored the use of novel displays, the real goal is to improve a user's sense of connectedness to those remote loved ones. However, very few have leveraged a user-centered design process or empirically studied the effects of using a display on users' sense of awareness and connectedness. In this paper, we present our multi-phase, user-centered design process for building displays that support awareness and connectedness: Presence Displays, which are physical, peripheral awareness displays of online presence of close friends or family. We present evidence, from a 5-week long field study, that these displays provide significantly better awareness of and connectedness to a loved one, than a traditional graphical display of online presence.",
  "authors": [
    {
      "name": "Anind K. Dey",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100327371",
      "orcid": "missing"
    },
    {
      "name": "Ed de Guzman",
      "institution": "University of Illinois, Urbana-Champaign, Urbana, IL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519343",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bradner, E. Social affordances of computer-mediated communication technology: Understanding adoption. Ext. Abstracts CHI 2001, ACM Press (2001), 67--68.]]  ",
      "doi": "10.1145/634067.634111"
    },
    {
      "text": "Chang, A., et al. LumiTouch: An emotional connection device. Ext. Abstracts CHI 2001, ACM (2001), 313--314.]]  ",
      "doi": "10.1145/634067.634252"
    },
    {
      "text": "Consolvo, S., et al. The CareNet Display: Lessons learned from an in home evaluation of an ambient display. In Proc. Ubicomp 2004, Springer (2004), 1--17.]]",
      "doi": ""
    },
    {
      "text": "Cummings, J.N. et al. Communication technology and friendship during the transition from high school to college. In Domesticating Internet Technology. Kraut, R., Brynin, M. and Kiesler, S. (eds.). Oxford University Press. In Press.]]",
      "doi": ""
    },
    {
      "text": "De Guzman, E.S., et al. Exploring the design and use of peripheral displays of awareness information. Ext. Abstracts CHI 2004, ACM Press (2004), 1247--1250.]]  ",
      "doi": "10.1145/985921.986035"
    },
    {
      "text": "Dourish, P. and Bly, S. Portholes: Supporting awareness in a distributed workgroup. In Proc. CHI '92, ACM Press (1992), 541--547.]]  ",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Go, K., et al, A. Familyware: Communicating with someone you love, In Proc. Home Informatics and Telematics, Kluwer Academic Publishers (2000), 125--140.]] ",
      "doi": "10.5555/647316.723192"
    },
    {
      "text": "Gaver, B. et al. Projected realities: Conceptual design for cultural effect. Interactions 6, 1 ACM Press (1999), 21--29.]]  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Greenberg, S. and Kuzuoka, H. Using digital but physical surrogates to mediate awareness, communication and privacy in media spaces. Personal Technologies 4, 1 (2000), 182--198.]]",
      "doi": ""
    },
    {
      "text": "Greenberg, S. and Fitchett, C. Phidgets: Easy development of physical interfaces through physical widgets. In Proc. UIST 2001, ACM Press (2001), 209--218.]]  ",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Hindus, D., et al. Casablanca: Designing social communication devices for the home. In Proc. CHI 2001, ACM Press (2001), 325--332.]]  ",
      "doi": "10.1145/365024.383749"
    },
    {
      "text": "IJsselsteign, W., et al. Staying in touch: Social presence and connectedness through synchronous and asynchronous communication media. In Proc. HCI International 2003, Lawrence Erlbaum (2003), 924--928.]]",
      "doi": ""
    },
    {
      "text": "Isaacs, E., et al. Information communication re-examined: New functions for video in supporting opportunistic encounters. Video-Mediated Communication, Finn, K.E., et al. (eds.), Lawrence Erlbaum, 459--485, 1994.]]",
      "doi": ""
    },
    {
      "text": "Jancke, G., et al. Presenting to local and remote audiences: Design and use of the TELEP system. In Proc. CHI 2000, ACM Press (2000), 384--391.]]  ",
      "doi": "10.1145/332040.332461"
    },
    {
      "text": "Kitzinger J. The methodology of focus groups: The importance of interaction between research participants. Sociology of Health 16, 1 (1994), 103--121.]]",
      "doi": ""
    },
    {
      "text": "Kitzinger J. Introducing focus groups. British Medical Journal 311 (1995), 299--302.]]",
      "doi": ""
    },
    {
      "text": "Kuwabara, K., et al. Connectedness oriented communication: Fostering a sense of connectedness to augment social relationships. In Proc. 2002 Symposium on Applications and the Internet, IEEE Press (2002), 186--193.]] ",
      "doi": "10.5555/646465.691407"
    },
    {
      "text": "Mankoff, J. and Dey, A.K. From conception to design: A practical guide to designing ambient displays. In Public and Situated Displays: Social and interactional aspects of shared display technologies. O'Hara, K., et al. (eds.). Kluwer Academic Publishers. 2003.]]",
      "doi": ""
    },
    {
      "text": "Markopoulous, P., et al. Keeping in touch with the family: Home and away with the ASTRA awareness system. Ext. Abstracts CHI 2004, ACM Press (2004), 1351--1354.]]  ",
      "doi": "10.1145/985921.986062"
    },
    {
      "text": "Mynatt, E.D., et al. Designing audio aura. In Proc. CHI'98, ACM Press (1998), 566--573.]]  ",
      "doi": "10.1145/274644.274720"
    },
    {
      "text": "Nardi, B., et al. Interaction and Outeraction: Instant Messaging in Action. In Proc. CSCW 2000, ACM Press (2000), 79--88.]]  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Pederson, E.R. People presence or room activity supporting peripheral awareness over distance. Ext. Abstracts CHI'98, ACM Press (1998), 283--284.]]  ",
      "doi": "10.1145/286498.286763"
    },
    {
      "text": "Plaue, C., et al. Is a picture worth a thousand words?: An evaluation of information awareness displays. In Proc. Graphics Interface 2004, ACM Press (2004), 117--126.]] ",
      "doi": "10.5555/1006058.1006073"
    },
    {
      "text": "Rettie, R. Connectedness: A new dimension of CMC? In Proc. International Conference WWW/Internet 2003, IADIS (2003), 129--136.]]",
      "doi": ""
    },
    {
      "text": "Rettie, R. Connectedness, awareness and social presence. In Proc. PRESENCE 2003 (2003), online proceedings.]]",
      "doi": ""
    },
    {
      "text": "Rowan, J. and Mynatt, E.D. Digital Family Portrait field trial: Support for aging in place. In Proc. CHI 2005, ACM Press (2005), 521-530.]]  ",
      "doi": "10.1145/1054972.1055044"
    },
    {
      "text": "Shiu, E. et al. How Americans use Instant Messaging. Pew Internet & American Life Project. August 2004.]]",
      "doi": ""
    },
    {
      "text": "Wisneski, C., et al. Ambient Displays: Turning Architectual Space into an Interface between People and Digital Information. In Proc. CoBuild '98, Springer Press (1998), 22--32.]] ",
      "doi": "10.5555/645968.674740"
    }
  ]
}