{
  "doi": "10.1145/1124772.1124957",
  "title": "Robot-human interaction with an anthropomorphic percussionist",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1229-1232",
  "year": 2006,
  "badges": [],
  "abstract": "The paper presents our approach for human-machine interaction with an anthropomorphic mechanical percussionist that can listen to live players, analyze perceptual musical aspects in real-time, and use the product of this analysis to play along in a collaborative manner. Our robot, named Haile, is designed to combine the benefits of computational power, perceptual modeling, and algorithmic music with the richness, visual interactivity, and expression of acoustic playing. We believe that when interacting with live players, Haile can facilitate a musical experience that is not possible by any other means, inspiring users to collaborate with it in novel and expressive manners. Haile can, therefore, serve a test-bed for novel forms of musical human-machine interaction, bringing perceptual aspects of computer music into the physical world both visually and acoustically.",
  "tags": [
    "human-robot interaction",
    "music",
    "collaborative systems"
  ],
  "authors": [
    {
      "name": "Gil Weinberg",
      "institution": "Georgia Institue of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100638548",
      "orcid": "missing"
    },
    {
      "name": "Scott Driscoll",
      "institution": "Georgia Institue of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100355389",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cope, D. Experiments in Music Intelligence. A-R Editions, Madison, WI, 1996.",
      "doi": ""
    },
    {
      "text": "Cycling74 - Max/MSP http://www.cycling74.com Accessed 2005.",
      "doi": ""
    },
    {
      "text": "Dannenberg, R. An On-line Algorithm for Real-Time Accompaniment. Proceedings of the 1984 International Computer Music Conference. Paris, France.",
      "doi": ""
    },
    {
      "text": "Desain, P. and Honing, H.J. Rhythmic stability as explanation of category size. Proceedings of the 2002 of the International Conference on Music Perception and Cognition Sydney CD-Rom.",
      "doi": ""
    },
    {
      "text": "Foote, J. and Uchihashi, S. The Beat Spectrum: a new approach to rhythmic analysis. Proceedings of the 2001 International Conference on Multimedia and Expo.",
      "doi": ""
    },
    {
      "text": "Jordà, S. Afasia: The Ultimate Homeric One-man multimedia- band. Proceedings of the 2002 Conference on New Interfaces for Musical Expression, Dublin, Ireland, (2002). ",
      "doi": "10.5555/1085171.1085203"
    },
    {
      "text": "Lewis, G. Too Many Notes: Computers, Complexity and Culture in Voyager,\" Leonardo Music Journal 10 (2000) 33--39.",
      "doi": ""
    },
    {
      "text": "Makingthings - Teleo system http://www.makingthings.com",
      "doi": ""
    },
    {
      "text": "Pachet, F. The continuator: Musical interaction with style. Proceedings International Computer Music Conference, (2002) Goteborg, Sweden.",
      "doi": ""
    },
    {
      "text": "Paulus, J. and Kalpuri, A. Measuring the Similarity of Rhythmic Patterns. Proceedings of the 2002 International Conference on Music Information Retrieval. Paris, France.",
      "doi": ""
    },
    {
      "text": "Puckette, M. Real-time Audio Analysis Tools for Pd and MSP. Proceedings of the 1998 International Computer Music Conference. Cologne, Germany.",
      "doi": ""
    },
    {
      "text": "Rae, G. W. Robotic Instruments. http://logosfoundation.org/instrum_gwr/automatons.html",
      "doi": ""
    },
    {
      "text": "Rowe, R. Machine Musicianship. MIT press, 2004. ",
      "doi": "10.5555/984002"
    },
    {
      "text": "Scheirer, E. 1998. Tempo and beat analysis of acoustic musical signals. Journal of the Acoustical Society of America, 103:1 588--601.",
      "doi": ""
    },
    {
      "text": "Singer, E., Feddersen, J., Redmon, C. and Bowen B. LEMUR's Musical Robots. Proceedings of the Conference on New Interfaces for Musical Expression, Hamamatsu, Japan, (2004), pp.181--184. ",
      "doi": "10.5555/1085884.1085925"
    },
    {
      "text": "Sony QRIO conductor Robot. http://www.sony.net/sonyInfo/QRIO/works/20040325e.html",
      "doi": ""
    },
    {
      "text": "Takanishi, A. Development of Anthropomorphic Flutist Robot WF-3RIV. Proceedings of International Computer Music Conference, Ann Arbor, Michigan, (1998) 328--331.",
      "doi": ""
    },
    {
      "text": "Tanguiane, A. Artificial Perception and Music Recognition. New York Springer-Verlag. 1993. ",
      "doi": "10.5555/528955"
    },
    {
      "text": "Toyota Trumpet Robot. http://www.toyota.co.jp/ en/special/robot",
      "doi": ""
    },
    {
      "text": "Weinberg G., Orth M., and Russo P. \"\"The Embroidered Musical Ball: A Squeezable Instrument for Expressive Performance,\" Proceeding of Computer Human Interaction Conference. (CHI 2000) The Hague.  ",
      "doi": "10.1145/633292.633457"
    },
    {
      "text": "Weinberg, G. Interconnected Musical Networks - Toward a Theoretical Framework. Computer Music Journal 29, 2 Cambridge MA: MIT Press (2005) 23--39.  ",
      "doi": "10.1162/0148926054094350"
    },
    {
      "text": "Weinberg G., Driscoll S., Parry M. Musical Interactions with a Perceptual Robotic Percussionist. Proceedings of IEEE International Workshop on Robot and Human Interactive Communication. Nashville, TN (2005).",
      "doi": ""
    },
    {
      "text": "Winkler, T. 2001. Composing Interactive Music: Techniques and Ideas Using Max. Cambridge, MA MIT Press. ",
      "doi": "10.5555/517022"
    }
  ]
}