{
  "doi": "10.1145/1124772.1124871",
  "title": "Personal vs. commercial content: the similarities between consumer use of photos and music",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "667-676",
  "year": 2006,
  "badges": [],
  "abstract": "We describe the results of two ethnographic-style studies that investigated consumer use of photos and music respectively. Although the studies were designed, executed, and analyzed separately, in our findings we discovered striking similarities between the ways in which our participants used personally captured photos and commercially purchased music. These findings have implications for the design of future systems with respect to handling and sharing content in photo or music form. We discuss making allowances for satisficing behavior, sharing media as a way to reminisce or to communicate an experience (tell a story), getting sidetracked while browsing, and similarities in organizing behaviors.",
  "tags": [
    "music",
    "photo",
    "sharing",
    "consumer",
    "ethnographic study"
  ],
  "authors": [
    {
      "name": "Frank Bentley",
      "institution": "Motorola Labs",
      "img": "/do/10.1145/contrib-81311482466/rel-imgonly/me.jpg",
      "acmid": "81311482466",
      "orcid": "missing"
    },
    {
      "name": "Crysta Metcalf",
      "institution": "Motorola Labs",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311483921",
      "orcid": "missing"
    },
    {
      "name": "Gunnar Harboe",
      "institution": "Motorola Labs",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350574653",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Agosto, D. Bounded Rationality and Satisficing in Young People's Web-Based Decision Making. Journal of the American Society for Information Science and Technology 53:1 (2001), 16--27.]]  ",
      "doi": "10.1002/asi.10024"
    },
    {
      "text": "Balabanovic, M., Chu, L.L. and Wolff, G.J. (2000). Storytelling with digital photographs. Proc. Conference on Human Factors and Computing Systems. The Hague, The Netherlands.]]  ",
      "doi": "10.1145/332040.332505"
    },
    {
      "text": "Beebe, J. (2001). Rapid Assessment Process: An Introduction. Walnut Creek, CA: Altamira Press.]]",
      "doi": ""
    },
    {
      "text": "Bernard, H.R. and Ryan, G.W. (1998) \"Text Analysis: Qualitative and Quantitative Methods\" in Handbook of Methods in Cultural Anthropology, H.R. Bernard ed., Altamira Press, 595--646.]]",
      "doi": ""
    },
    {
      "text": "Beyer, H. and Holtzblatt, K. (1998). Contextual Design: Defining Customer-Centered Systems.]] ",
      "doi": "10.5555/286067"
    },
    {
      "text": "Brown, B., Geelhoed, E. and Sellen, A. (2001) Music Sharing as a Computer Supported Collaborative Application. in Prinz, W. ed. Proceedings of Ecscw 2001, Bonn, Germany., Kluwer Academic Publishers, 2001, 179--198.]] ",
      "doi": "10.5555/1241867.1241877"
    },
    {
      "text": "Brown, B., Geelhoed, E. and Sellen, A. (2001) The Use of Conventional and New Music Media: Implications for Future Technologies. In Hirose and M., editors, Proc. Interact'2001, 67--75.]]",
      "doi": ""
    },
    {
      "text": "Card, S.K. et al. Information Scent as a Driver of Web Behavior Graphs: Results of a Protocol Analysis Method for Web Usability. Proc. CHI 2001, ACM Press (2001), 498--505.]]  ",
      "doi": "10.1145/365024.365331"
    },
    {
      "text": "Chalfen, R. Snapshot versions of life. Bowling Green State University Press, Bowling Green OH, 1987.]]",
      "doi": ""
    },
    {
      "text": "Crozier, R. (1997) Music and social influence. In: The Social Psychology of Music ed. by D. Hargreaves and A. North. Oxford University Press, pp. 67--83.]]",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Rodden, T., and Mariani, J. (2004) Collaborating around collections: informing the continued development of photoware. Proc. CSCW '04. ACM Press, New York, NY, 396--405.]]  ",
      "doi": "10.1145/1031607.1031673"
    },
    {
      "text": "Cunningham,S, Reeves, N., and Britland, M. (2003) An Ethnographic Study of Music Information Seeking: Implications for the Design of a Music Digital Library. Proc. ACM/IEEE-CS joint conference on Digital libraries, Houston, Texas.]] ",
      "doi": "10.5555/827140.827142"
    },
    {
      "text": "Davis, M., King, S., Good, N., and Sarvas, R.. (2004) \"\"From Context to Content: Leveraging Context to Infer Media Metadata.\"\" Proc. International Conference on Multimedia (MM 2004). New York, 188--195.]]  ",
      "doi": "10.1145/1027527.1027572"
    },
    {
      "text": "Downie, J. S., and Cunningham, S.J. (2002) Toward a Theory of Music Information Retrieval Queries: System Design Implications. Proc. 3rd International Conference on Music Information Retrieval.]]",
      "doi": ""
    },
    {
      "text": "Dunne, J., et al. (2002) mpME!: Music Recommendation and Exploration. Proc IUI 2002, San Francisco, California. ACM Press publishers.]]  ",
      "doi": "10.1145/502716.502774"
    },
    {
      "text": "Frohlich, D.M. (2004) Audiophotography: Bringing photos to life with sounds. Kluwer Academic Publishers.]] ",
      "doi": "10.5555/1210132"
    },
    {
      "text": "Frohlich, D., Kuchinsky, A., Pering, C., Don, A. and Ariss, S. (2002). Requirements for PhotoWare. In the Proc. CSCW 2002. New Orleans, Louisiana.]]  ",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "Futrelle, J., and Downie, J.S. (2002) Interdisciplinary Communities and Research Issues in Music Information Retrieval. Proc. 3rd International Conference on Music Information Retrieval, Paris, France.]]",
      "doi": ""
    },
    {
      "text": "Gandhi, B.; Martinez, A.; Bentley, F. (2004) Intelligent multimedia content management on mobile devices. Proc. ICME '04. 1703 -- 1706.]]",
      "doi": ""
    },
    {
      "text": "Gargi, U.; Deng, Y.; Tretter, D. R. (2002) Managing and Searching Personal Photo Collections. HP Labs Technical Report HPL-2002-67, 2002.]]",
      "doi": ""
    },
    {
      "text": "Gigerenzer, G., Todd, P.M., and the ABC Research Group. Simple Heuristics That Make Us Smart. Oxford University Press, New York, NY, USA, 1999.]]",
      "doi": ""
    },
    {
      "text": "Graham, A., Garcia-Molina, H., Paepcke, A. and Winograd, T. (2002). Time as essence for photo browsing through personal digital libraries. In Proc. International Conference on Digital Libraries.]]  ",
      "doi": "10.1145/544220.544301"
    },
    {
      "text": "Hargreaves, D. J., and North, A.C. (1997) The social psychology of music. In: The Social Psychology of Music ed. by David J. Hargreaves and Adrian C. North. Oxford University Press, 1--21.]]",
      "doi": ""
    },
    {
      "text": "Kang, H. and Shneiderman, B. (2000). Visualization Methods for Personal Photo Collections Browsing and Searching in the PhotoFinder. In Proc. ICME 2000.]]",
      "doi": ""
    },
    {
      "text": "Kim, J.Y. and Belkin, N. (2002) Categories of Music Description and Search Terms and Phrases Used by Non-Music Experts. In: Proceedings of the 3rd International Conference on Music Information Retrieval, Paris, France.]]",
      "doi": ""
    },
    {
      "text": "LeCompte, M.D. and Schensul, J.J. (1999) Designing and Conducting Ethnographic Research. Ethnographer's Toolkit 1. Walnut Creek, California. Altamira Press, Sage publications.]]",
      "doi": ""
    },
    {
      "text": "Martignon, L., and Hoffrage, U. Why Does One-Reason Decision Making Work? A Case Study in Ecological Rationality. In Simple Heuristics That Make Us Smart (Gigerenzer, G., Todd, P.M., and the ABC Research Group). Oxford University Press, New York, NY, USA, 1999.]]",
      "doi": ""
    },
    {
      "text": "Mills, T., Pye, D., Sinclair, D, Wood, K. (2000). ShoeBox: A Digital Photo Management System. AT&T Laboratories Cambridge.]]",
      "doi": ""
    },
    {
      "text": "Pirolli, P., and Card, S.K. Information Foraging Models of Browsers for Very Large Document Spaces. Proc. Working Conf. on Advanced Visual Interfaces 1998, ACM Press (1998), 83--93.]]  ",
      "doi": "10.1145/948496.948509"
    },
    {
      "text": "Randall, D., Harper, R., and Rouncefield, M. (2005). Fieldwork and Ethnography: A Perspective from CSCW. Proc. EPIC 2005. 81--99.]]",
      "doi": ""
    },
    {
      "text": "Rodden, K. and Wood, K. R. (2003) How do people manage their digital photographs? In Proc CHI 2003. 409--416.]]  ",
      "doi": "10.1145/642611.642682"
    },
    {
      "text": "Schiano, D., Chen, C.P. and Isaacs, E. (2002) How Teens Take, View, Share and Store Photos. Proc. CSCW 2002. New Orleans, Louisiana.]]",
      "doi": ""
    },
    {
      "text": "Simon, H.A. A Behavioral Model of Rational Choice. Quarterly Journal of Economics 69 (1955), 99--118.]]",
      "doi": ""
    },
    {
      "text": "Simon, H.A. Rational Choice and the Structure of the Environment. Psychological Review 63 (1956), 129--138.]]",
      "doi": ""
    },
    {
      "text": "Simon, H.A. Invariants of Human Behavior. Annual Review of Psychology 41 (1990), 1--19.]]",
      "doi": ""
    },
    {
      "text": "Todd, P.M., and Miller, G.F. From Pride and Prejudice to Persuasion: Satisficing in Mate Search. In Simple Heuristics That Make Us Smart (Gigerenzer, G., Todd, P.M., and the ABC Research Group). Oxford University Press, New York, NY, USA, 1999.]]",
      "doi": ""
    },
    {
      "text": "Viégas, F.B. (2000). Collections: Adapting the display of Personal Objects for Different Audiences. Master of Science Thesis, Massachusetts Institute of Technology.]]",
      "doi": ""
    },
    {
      "text": "Voida, A., Grinter, R.E., Ducheneaut, N., Edwards, W.K., and Newman, M.W. (2005). \"\"Listening in: Practices surrounding iTunes music sharing.\"\" Proc. CHI 2005. ACM Press, pp. 191--200.]]  ",
      "doi": "10.1145/1054972.1054999"
    }
  ]
}