{
  "doi": "10.1145/1124772.1124886",
  "title": "Gaze-based interaction for semi-automatic photo cropping",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "771-780",
  "year": 2006,
  "badges": [],
  "abstract": "We present an interactive method for cropping photographs given minimal information about important content location, provided by eye tracking. Cropping is formulated in a general optimization framework that facilitates adding new composition rules, and adapting the system to particular applications. Our system uses fixation data</ to identify important image content and compute the best crop for any given aspect ratio or size, enabling applications such as automatic snapshot recomposition, adaptive documents, and thumbnailing. We validate our approach with studies in which users compare our crops to ones produced by hand and by a completely automatic approach. Experiments show that viewers prefer our gaze-based crops to uncropped images and fully automatic crops.",
  "authors": [
    {
      "name": "Anthony Santella",
      "institution": "Rutgers University, Piscataway, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100578485",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "UC Berkeley Computer Science, Berkeley, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    },
    {
      "name": "Doug DeCarlo",
      "institution": "Rutgers University, Piscataway, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100499844",
      "orcid": "missing"
    },
    {
      "name": "David Salesin",
      "institution": "Adobe Systems and University of Washington, Seattle, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100188207",
      "orcid": "missing"
    },
    {
      "name": "Michael Cohen",
      "institution": "Microsoft Research, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406592138",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arnheim, R. Art and Visual Perception. University of California Press, 1974.",
      "doi": ""
    },
    {
      "text": "Arnheim, R. The Power of the Center. University of California Press, 1988.",
      "doi": ""
    },
    {
      "text": "Banerjee, S. Composition Guided Image Aquisition. PhD thesis, University of Texas at Austin, 2004.",
      "doi": ""
    },
    {
      "text": "Byers, Z., Dixon, M., Smart, W. D., and Grimm, C. M. Say cheese!: Experiences with a robot photographer. Proceedings of the Fifteenth Innovative Applications of Artificial Intelligence Conference (IAAI-03), Acapulco, Mexico.",
      "doi": ""
    },
    {
      "text": "Chen, L., Xie, X., Fan, X., Ma, W., Shang, H., and Zhou, H. A visual attention mode for adapting images on small displays. MSR-TR-2002-125 Microsoft Research, Redmond, WA (2002).",
      "doi": ""
    },
    {
      "text": "Christoudias, C., Georgescu, B., and Meer, P. Synergism in low level vision. Proceedings ICPR 2002. ",
      "doi": "10.5555/846227.848599"
    },
    {
      "text": "Crow, F. Summed-area tables for texture mapping. Siggraph '84. 207--2 12.  ",
      "doi": "10.1145/800031.808600"
    },
    {
      "text": "David, H. A. The method of paired comparisons. Charles Griffin and Company, London, 1969.",
      "doi": ""
    },
    {
      "text": "DeCarlo, D., and Santella, A. Stylization and abstraction of photographs. Proceedings of ACM SIGGRAPH 2002. 769--776.  ",
      "doi": "10.1145/566570.566650"
    },
    {
      "text": "Duchowski, A. Acuity-matching resolution degradation through wavelet coefficient scaling. IEEE Trans. on Image Processing 9, 8 (2000), 1437--1440.  ",
      "doi": "10.1109/83.855439"
    },
    {
      "text": "Foley, J., van Dam, A., Feiner, S., and Hughes, J. Computer Graphics: Principles and Practice, 2nd edition. Addison Wesley, 1997. ",
      "doi": "10.5555/83821"
    },
    {
      "text": "Gooch, B., Reinhard, E., Moulding, C., and Shirley, P. Artistic composition for image creation. Proceedings of the 12th Eurographics workshop on Rendering Technique. 83--88. ",
      "doi": "10.5555/647653.732295"
    },
    {
      "text": "Graham, D. Composing Pictures. Van Nostrand Reinhold, 1970.",
      "doi": ""
    },
    {
      "text": "Grill, T., and Scanlon, M. Photographic Composition Guidelines for Total image control through effective design. AMPHOTO, 1988.",
      "doi": ""
    },
    {
      "text": "Itti, L., and Koch, C. A saliency-based search mechanism for overt and covert shifts of visual attention. Vision Research 40 (2000), 1489--1506.",
      "doi": ""
    },
    {
      "text": "Itti, L., Koch, C., and Niebur, E. A model of saliency-based visual attention for rapid scene analysis. IEEE Transactions on Pattern Analysis and Machine Intelligence 20 (1998), 1254--1259.  ",
      "doi": "10.1109/34.730558"
    },
    {
      "text": "Jacob, R. J. Eye-movement-based human-computer interaction techniques: Toward non-command interfaces. 151--190.",
      "doi": ""
    },
    {
      "text": "Jacobs, C., Li, W., Schrier, E., Bargeron, D., and Salesin, D. Adaptive grid-based document layout. ACM Trans. Graph. 22, 3 (2003), 838--847.  ",
      "doi": "10.1145/882262.882353"
    },
    {
      "text": "Kendall, M. G. On the method of paired comparisons. Biometrika 31 (1940), 324 --345.",
      "doi": ""
    },
    {
      "text": "Li, S. Z., Zhu, L., Zhang, Z. Q., Blake, A., Zhang, H. J., and Shum, H. Statistical learning of multi-view face detection. Proceedings 7th European Conference on Computer Vision(ECCV 2002) 4 (2002), 67 --81. ",
      "doi": "10.5555/645318.649240"
    },
    {
      "text": "Li, Y., Sun, J., Tang, C.-K., and Shum, H.-Y. Lazy snapping. ACM Trans. Graph. 23, 3 (2004), 303--308.  ",
      "doi": "10.1145/1015706.1015719"
    },
    {
      "text": "Locher, P. J. The contribution of eye-movement research to an understanding of the nature of pictorial balance perception: a review of the literature. Empirical Studies of the Arts 14, 2 (1996), 146--163.",
      "doi": ""
    },
    {
      "text": "Locher, P. J., Stappers, P. J., and Overbeeke, K. The role of balance as an organizing design principle underlying adults' compositional strategies for creating visual displays. Acta Psychologica 99 (1998), 141--161.",
      "doi": ""
    },
    {
      "text": "Locher, P. J., Stappers, P. J., and Overbeeke, K. An empirical evaluation of the visual rightness theory of pictorial composition. Acta Psychologica 103 (1999), 261--280.",
      "doi": ""
    },
    {
      "text": "Lok, S., Feiner, S., and Ngai, G. Evaluation of visual balance for automated layout. Proceedings of the 9th international conference on Intelligent user interface. 101--106.  ",
      "doi": "10.1145/964442.964462"
    },
    {
      "text": "McManus, I., Edmondson, D., and Rodgers, J. Balance in pictures. British Journal of Psychology 76 (1985), 73--94.",
      "doi": ""
    },
    {
      "text": "Peterson, B. Learning to see Creatively: How to compose great photographs. AMPHOTO, 1988.",
      "doi": ""
    },
    {
      "text": "Setlur, V., Takagi, S., Raskar, R., Gleicher, M., and Gooch, B. Automatic image retargeting. ACM SIGGRAPH Technical Sketch.  ",
      "doi": "10.1145/1186223.1186228"
    },
    {
      "text": "Suh, B., Ling, H., Bederson, B. B., and Jacobs, D. W. Automatic thumbnail cropping and it's effectivness. ACM Conference on User Interface and Software Technolgy (UIST 2003) (2003), 95--104.  ",
      "doi": "10.1145/964696.964707"
    },
    {
      "text": "Vertegaal, R. The gaze groupware system: Mediating joint attention in mutiparty communication and collaboration. Proceedings CHI '99. 294--301.  ",
      "doi": "10.1145/302979.303065"
    },
    {
      "text": "Vertegaal, R. Designing attentive interfaces. Proceedings of the Eye Tracking Research and Applications (ETRA) Symposium 2002. 23--30.  ",
      "doi": "10.1145/507072.507077"
    }
  ]
}