{
  "doi": "10.1145/1124772.1124934",
  "title": "Measuring the difficulty of steering through corners",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1087-1096",
  "year": 2006,
  "badges": [],
  "abstract": "The steering law is intended to predict the performance of cursor manipulations in user interfaces, but the law has been verified for only a few path shapes and should be verified for more if it is to be generalized. This study extends the steering law to paths with corners. Two experiments compare the movement times of negotiating paths with corners to straight paths with the same width and movement amplitude. The experimental results show a significant effect on the movement times due to the corners, extending far into the legs of the path's corner. Modeling the results using resource theory, a cognitive theory for divided attention, suggests that steering through corners is two simultaneous tasks: steering along the legs of the corner and aiming at the corner.",
  "authors": [
    {
      "name": "Robert Pastel",
      "institution": "Michigan Technological University, Houghton, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100418874",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Accot, J., and Zhai, S., Refining Law Models for Bivariate Pointing, In Proc.CHI2003 ACM Press (2003), 193--200.  ",
      "doi": "10.1145/642611.642646"
    },
    {
      "text": "Accot, J., and Zhai, S., Scale Effects in Steering Law Tasks, In Proc. CHI2001, ACM Press (2001), 1--8.  ",
      "doi": "10.1145/365024.365027"
    },
    {
      "text": "Accot, J. and Zhai, S., Performance Evaluations of Input Devices in Trajectory-based Tasks: An application of the Steering Law, In Proc. CHI99, ACM Press (1999), 466--472.  ",
      "doi": "10.1145/302979.303133"
    },
    {
      "text": "Accot, J., and Zhai, S., Beyond Fitts' Law: Models for Trajectory-Based HCI Tasks, In Proc. CHI97, ACM Press (1997), 295--302.  ",
      "doi": "10.1145/258549.258760"
    },
    {
      "text": "Ahlström, D., Modeling and Improving Selection in Cascading Pull-down Menus Using Fitts' Law, the Steering Law and Force Fields, In Proc. CHI2005, ACM Press (2005), 61--70.  ",
      "doi": "10.1145/1054972.1054982"
    },
    {
      "text": "Dennerlein, J.T., Martin, D.B. and Hasser, C., Force-Feedback Improves Performance for Steering and Combined Steering-Targeting Tasks, In Proc. CHI2000, ACM Press (2000), 423--429.  ",
      "doi": "10.1145/332040.332469"
    },
    {
      "text": "Fitts, P.M., The Information Capacity of the Human Motor System in Controlling the Amplitude of Movement, Quarterly Journal of Psychology, (1954) 47, 381--391.",
      "doi": ""
    },
    {
      "text": "Gopher, D., and Navon, D., How is Performance Limited: Testing the Notion of Central Capacity, Acta Psychologica (1980) 46, 161--180.",
      "doi": ""
    },
    {
      "text": "Hoffmann, E.R. and Lim, J.T.A., Concurrent Manual-decision Tasks, Ergonomics, (1997) 40:3, 293--318.",
      "doi": ""
    },
    {
      "text": "Langolf, G.D., Chafflin, D.B., and Foulke, J.A., An Investigation of Law Using a Wide Range of Movement Amplitude, J. Motor Behav.,(1976) 8:2,113--128.",
      "doi": ""
    },
    {
      "text": "MacKenzie, S. and Buxton, W., Extending Fitts' Law to Two-dimensional Tasks, In Proc. CHI92, (1992), 219--223.  ",
      "doi": "10.1145/142750.142794"
    },
    {
      "text": "MacKenzie, S., Sellen, A. and Buxton, W., A Comparison of Input Devices in Elemental Pointing and Dragging Tasks, In Proc. CHI91, ACM Press (1991), 161--166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "Navon, D., and Gopher, D., Task Difficulty, Resources, and Dual-task Performance, in Attention and Performance, edited by Nickersor, R.S., Erlbaum, NJ, 1980, 297--315.",
      "doi": ""
    },
    {
      "text": "Norman, D.A.and Bobrow, D.G., On Data-limited and Resource-limited Processes, Cognit. Psych., 7, 44--64, 1975.",
      "doi": ""
    },
    {
      "text": "Pinheiro, J.C. and Bates, D.M., Mixed-Effects Models in S and S-PLUS, Springer, New York, NY, 2000.",
      "doi": ""
    },
    {
      "text": "Venables, W.N. and Ripley, B.D., Modern Applied Statistics with S, Springer, New, NY, 2002.",
      "doi": "10.5555/1965392"
    },
    {
      "text": "Wickens, C.D. and Hollands, J.G., Engineering Psychology and Human Performance, third edition Prentice Hall, Upper Saddle River, New Jersey, 2000.",
      "doi": ""
    },
    {
      "text": "Wickens, C.D., and Lilu, Y., Codes and Modalities en Multiple Resources: A Success and A Qualification, Human Factors, 1988, 30, 5, 599--616. ",
      "doi": "10.1177/001872088803000505"
    }
  ]
}