{
  "doi": "10.1145/1124772.1124850",
  "title": "Using hybrid networks for the analysis of online software development communities",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "513-516",
  "year": 2006,
  "badges": [],
  "abstract": "Social network-based systems usually suffer from two major limitations: they tend to rely on a single data source (e.g. email traffic), and the form of network patterns is often privileged over their content. To go beyond these limitations we describe a system we developed to visualize and navigate hybrid networks constructed from multiple data sources - with a direct link between formal representations and the raw content. We illustrate the benefits of our approach by analyzing patterns of collaboration in a large Open Source project, using hybrid networks to uncover important roles that would otherwise have been missed.",
  "authors": [
    {
      "name": "Yevgeniy \"Eugene\" Medynskiy",
      "institution": "Cornell University, Ithaca, NY",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81375605292",
      "orcid": "missing"
    },
    {
      "name": "Nicolas Ducheneaut",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100116901/rel-imgonly/nic_photo.jpg",
      "acmid": "81100116901",
      "orcid": "missing"
    },
    {
      "name": "Ayman Farahat",
      "institution": "PricewaterhouseCoopers, Inc., San Jose, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100287398",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "De Souza, C., Dourish, P.,Froehlich, J.: Seeking the source: Software source code as a social and technical artifact. In: Proceedings of GROUP 2005, ACM, (2005).]]  ",
      "doi": "10.1145/1099203.1099239"
    },
    {
      "text": "Ducheneaut, N.: Socialization in an Open Source software community: a socio-technical analysis. Computer Supported Cooperative Work, 14 (4). (2005)]]  ",
      "doi": "10.1007/s10606-005-9000-1"
    },
    {
      "text": "Fisher, D., Dourish, P.: Social and temporal structures in everyday collaboration. In: Proceedings of CHI 2004, ACM, (2004), 551--558]]  ",
      "doi": "10.1145/985692.985762"
    },
    {
      "text": "Gibson, D.: Taking turns and talking ties: Networks and conversational interaction. American Journal of Sociology, 110 (6). (2005)]]",
      "doi": ""
    },
    {
      "text": "Goecks, J., Mynatt, E.D.: Leveraging social networks for information sharing. In: Proceedings of CSCW 2004, ACM, (2004), 328--331]]  ",
      "doi": "10.1145/1031607.1031660"
    },
    {
      "text": "Heer, J., Card, S.K., Landay, J.A.: Prefuse: a toolkit for interactive information visualization. In: Proceedings of CHI 2005, ACM, (2005), 421--430]]  ",
      "doi": "10.1145/1054972.1055031"
    },
    {
      "text": "Hofmann, T.: Probabilistic Latent Semantic Indexing. In: Proceedings of SIGIR 1999, ACM, (1999), 50--57]]  ",
      "doi": "10.1145/312624.312649"
    },
    {
      "text": "Horn, D.B., Finholt, T., Birnholtz, J.P., Motwani, D., Jayaraman, S.: Six degrees of Jonathan Grudin. In: Proceedings of CSCW 2004, ACM, (2004), 582--591]]  ",
      "doi": "10.1145/1031607.1031707"
    },
    {
      "text": "Kautz, H.A., Selman, B., Shah, M.: Referral Web: combining social networks and collaborative filtering. Communication of the ACM, 40 (3). (1997) 63--65]]  ",
      "doi": "10.1145/245108.245123"
    },
    {
      "text": "Kohonen, T.: Self-Organizing Maps. Springer, (2001)]] ",
      "doi": "10.5555/261082"
    },
    {
      "text": "Latour, B.: Science in action. Harvard University Press, (1987)]]",
      "doi": ""
    },
    {
      "text": "McDonald, D.: Recommending collaboration with social networks: a comparative evaluation. In: Proceedings of CHI 2003, ACM, (2003), 593--600]]  ",
      "doi": "10.1145/642611.642714"
    },
    {
      "text": "Ogata, H., Yano, Y., Furugori, N., Jin, Q.: Supporting social networking for augmenting cooperation. Computer Supported Cooperative Work, 10. (2001) 189--209]]  ",
      "doi": "10.1023/A%3A1011216431296"
    },
    {
      "text": "Sack, W.: Discourse diagrams: interface design for very large-scale conversations. In: Proceedings of HICSS 2000, IEEE, (2000)]] ",
      "doi": "10.5555/820261.820276"
    },
    {
      "text": "Smith, M.A., Fiore, A.T.: Visualization components for persistent conversations. In: Proceedings of CHI 2001, ACM, (2001), 136--143]]  ",
      "doi": "10.1145/365024.365073"
    },
    {
      "text": "Viegas, F., boyd, d., Nguyen, D., Potter, J., Donath, J.: Digital artifacts for remembering and storytelling. In: Proceedings of HICSS 2002, IEEE, (2002)]] ",
      "doi": "10.5555/962752.962966"
    }
  ]
}