{
  "doi": "10.1145/1124772.1124849",
  "title": "Visual search and reading tasks using ClearType and regular displays: two experiments",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "503-511",
  "year": 2006,
  "badges": [],
  "abstract": "Two experiments comparing user performance on ClearType and Regular displays are reported. In the first, 26 participants scanned a series of spreadsheets for target information. Speed of performance was significantly faster with ClearType. In the second experiment, 25 users read two articles for meaning. Reading speed was significantly faster for ClearType. In both experiments no differences in accuracy of performance or visual fatigue scores were observed. The data also reveal substantial individual differences in performance suggesting ClearType may not be universally beneficial to information workers.",
  "authors": [
    {
      "name": "Andrew Dillon",
      "institution": "University of Texas at Austin, School of Information, Austin, TX",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100023813",
      "orcid": "missing"
    },
    {
      "name": "Lisa Kleinman",
      "institution": "University of Texas at Austin, School of Information, Austin, TX",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489224",
      "orcid": "missing"
    },
    {
      "name": "Gil Ok Choi",
      "institution": "University of Texas at Austin, School of Information, Austin, TX",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100479397",
      "orcid": "missing"
    },
    {
      "name": "Randolph Bias",
      "institution": "University of Texas at Austin, School of Information, Austin, TX",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100124459",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adler, A., Gujar, A., Harrison, B., O'Hara, K. & Sellen, A. A diary study of work-related reading: Design implications for digital reading devices. In Proc. CHI 1998, ACM Press (1998), 241--248.  ",
      "doi": "10.1145/274644.274679"
    },
    {
      "text": "Boyarski, D., Neuwirth, C., Forlizzi, J. and Regli, S. H. A study of fonts designed for screen display. In Proc. CHI 1998, ACM Press (1998), 87--94.  ",
      "doi": "10.1145/274644.274658"
    },
    {
      "text": "Bernard, M., Chaparro, B., Mills, M. and Halcomb, C. Comparing the effects of text size and format on the readability of computer-displayed Times New Roman and Arial text. International Journal of Human Computer Studies, 59 (2003), 823--835.  ",
      "doi": "10.1016/S1071-5819%2803%2900121-6"
    },
    {
      "text": "Dillon, A. Reading from paper versus screens: A critical review of the empirical literature. Ergonomics, 35, 10 (1992), 1297--1326.",
      "doi": ""
    },
    {
      "text": "Dillon, A. Designing Usable Electronic Text, 2nd Edition. CRC Press, Boca Raton, FL, 2004. ",
      "doi": "10.5555/994975"
    },
    {
      "text": "Dillon, A., Kleinman, L., Bias, R., and Choi, G. and Turnbull, D. Reading and searching electronic documents: An experimental study of regular and enhanced screen displays. Proc. American Society for Information Science and Technology, ASIST 2004, Information Today (2004), 267--273.",
      "doi": ""
    },
    {
      "text": "Dyson, M.C. How do we read text on screen. In Creation, Use, and Deployment of Digital Information (H. van Oostendorp, L. Breure, & A. Dillon, Eds.), Lawrence Erlbaum Associates, Mahwah, NJ (2005), 279--306.",
      "doi": ""
    },
    {
      "text": "Gould, J. Reading is slower from CRT displays than paper: Attempts to isolate a single-variable explanation. Human Factors, 29, 3 (1987), 269--299. ",
      "doi": "10.1177/001872088702900303"
    },
    {
      "text": "Muter, P. Interface design and optimization of reading of continuous text. In Cognitive Aspects of Electronic Text Processing (H. van Oostendorp and S. de Mul, Eds.), Ablex, Norwood, NJ (1996), 161--180.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Avoiding commodity status. http://www.useit.com/alertbox/20020203.html.",
      "doi": ""
    },
    {
      "text": "O'Hara, K. & Sellen, A. A comparison of reading paper and on-line documents. . In Proc. CHI 1997, ACM Press (1997), 335--342.  ",
      "doi": "10.1145/258549.258787"
    },
    {
      "text": "Tyrrell, R. and Leibowitz, H. The relation of vergence effort to report of visual fatigue following prolonged near work. Human Factors, 32, 3 (1990), 341--357. ",
      "doi": "10.5555/96095.96112"
    },
    {
      "text": "Tyrrell, R., Pasquale, T., Aten, T. and Francis, E. Empirical evaluation of user responses to reading text rendered using ClearType technologies. Society for Information Display, Digest of Technical Papers, (2001), 1205--1207.",
      "doi": ""
    },
    {
      "text": "Underwood, G. and Batt, V. Reading and Understanding. Blackwell, Oxford, 1996.",
      "doi": ""
    }
  ]
}