{
  "doi": "10.1145/1124772.1124967",
  "title": "Synchronous broadcast messaging: the use of ICT",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1293-1302",
  "year": 2006,
  "badges": [],
  "abstract": "IBM Community Tools (ICT) is a synchronous broadcast messaging system in use by a very large, globally distributed organization. ICT is interesting for a number of reasons, including its scale of use (thousands of users per day), its usage model of employing large scale broadcast to strangers to initiate small group interactions, and the fact that it is a synchronous system used across multiple time zones. In this paper we characterize the use of ICT in its context, examine the activities for which it is used, the motivations of its users, and the values they derive from it. We also explore problems with the system, and look at the social and technical ways in which users deal with them.",
  "tags": [
    "CSCW",
    "CMC",
    "broadcast messaging",
    "IM",
    "social computing",
    "instant messaging",
    "chat"
  ],
  "authors": [
    {
      "name": "Justin D. Weisz",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81311482644/rel-imgonly/jweisz-20-sm.jpg",
      "acmid": "81311482644",
      "orcid": "missing"
    },
    {
      "name": "Thomas Erickson",
      "institution": "IBM T. J. Watson Research Center, Yorktown Heights, NY",
      "img": "/do/10.1145/contrib-81100235869/rel-imgonly/tom_sol_prtl_pic_183pxsq.jpg",
      "acmid": "81100235869",
      "orcid": "missing"
    },
    {
      "name": "Wendy A. Kellogg",
      "institution": "IBM T. J. Watson Research Center, Yorktown Heights, NY",
      "img": "/do/10.1145/contrib-81100457150/rel-imgonly/81100457150.jpg",
      "acmid": "81100457150",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackerman, M.S. and Palen, L.A., The zephyr help instance: promoting ongoing activity in a CSCW system. In Proc. CHI 1996, ACM Press (1996), 268--275.  ",
      "doi": "10.1145/238386.238528"
    },
    {
      "text": "Anderson, B. Imagined Communities: Reflections on the Origin and Spread of Nationalism. Revised Edition. London and New York: Verso, 1991.",
      "doi": ""
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M. and Smith, I. Taking email to task: the design and evaluation of a task management centered email tool. In Proc. CHI 2003, ACM Press (2003), 345--352.  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Brothers, L., Hollan, J., Neilsen, J., Stornetta, S., Abney, S., Furnas, G., and Littman, M. Supporting informal communication via ephemeral interest groups. In Proc. CSCW 1992, ACM Press (1992), 84--90.  ",
      "doi": "10.1145/143457.143465"
    },
    {
      "text": "Dabbish, L. and Kraut, R.E. Controlling interruptions: awareness displays and social motivation for coordination. In Proc. CSCW 2004, ACM Press (2004), 182--191.  ",
      "doi": "10.1145/1031607.1031638"
    },
    {
      "text": "Erickson, T., Smith, D. N., Kellogg, W. A., Laff, M., Richards, J. T., and Bradner, E. Socially translucent systems: social proxies, persistent conversation, and the design of \"\"babble\"\". In Proc. CHI 1999, ACM Press (1999), 72--79.  ",
      "doi": "10.1145/302979.302997"
    },
    {
      "text": "Granovetter, M. S. (1983) The strength of weak ties: a network theory revisited. Sociological Theory, Vol. 1, 201--233.",
      "doi": ""
    },
    {
      "text": "Herbsleb, J. D., Atkins, D. L., Boyer, D. G., Handel, M., and Finholt, T. A. Introducing instant messaging and chat in the workplace. In Proc. CHI 2002, ACM Press (2002), 171--178.  ",
      "doi": "10.1145/503376.503408"
    },
    {
      "text": "Isaacs, E., Walendowski, A., Whittaker, S., Schiano, D. J., and Kamm, C. The character, functions, and styles of instant messaging in the workplace. In Proc. CSCW 2002, ACM Press (2002), 11--20.  ",
      "doi": "10.1145/587078.587081"
    },
    {
      "text": "Jacovi, M., Soroka, V., and Ur, S. Why do we ReachOut?: functions of a semi-persistent peer support tool, In Proc. Group 2003, ACM Press (2003), 161--169.  ",
      "doi": "10.1145/958160.958186"
    },
    {
      "text": "Kraut, R. E., Morris, J., Telang, R., Filer, D., Cronin, M., and Sunder, S. Markets for attention: will postage for email help? In Proc. CSCW 2002, ACM Press (2002), 206--215.  ",
      "doi": "10.1145/587078.587108"
    },
    {
      "text": "Kollock, P. and Smith, M. Managing the virtual commons: Cooperation and conflict in computer communities. In S. Herring (Ed.), Computer-mediated communication: Linguistic, social, and cross-cultural perspectives. Amsterdam: John Benjamins, 1996.",
      "doi": ""
    },
    {
      "text": "Mackay, W. E. More than just a communications system: Diversity in the use of electronic mail. In Proc. CSCW 1988, ACM Press (1988), 344--353.  ",
      "doi": "10.1145/62266.62293"
    },
    {
      "text": "Nardi, B. A., Whittaker, S., and Bradner, E. Interaction and outeraction: instant messaging action. In Proc. CSCW 2000, ACM Press (2000), 79--88.  ",
      "doi": "10.1145/358916.358975"
    },
    {
      "text": "Nonnecke, B. and Preece, J. Lurker demographics: counting the silent. In Proc. CHI 2000, ACM Press (2000), 73--80.  ",
      "doi": "10.1145/332040.332409"
    },
    {
      "text": "O'Connaill, B. and Frohlich, D. Timespace in the workplace: dealing with interruptions. In Extended Abstr. of CHI 1995, ACM Press (1995), 262--263.  ",
      "doi": "10.1145/223355.223665"
    },
    {
      "text": "Perlow, L.A. The time famine: toward a sociology of work time. Administrative Science Quarterly, 1999, 44(1): 57--81.",
      "doi": ""
    },
    {
      "text": "Ribak, A., Jacovi, M., Soroka, V. \"\"Ask before you search\"\": peer support and community building with reachout. In Proc CSCW 2002, ACM Press (2002), 126--135.  ",
      "doi": "10.1145/587078.587097"
    },
    {
      "text": "Sproull, L. and Kiesler, S. Connections: New Ways of Working in the Networked Organization. MIT Press, Cambridge, MA, USA, 1991. ",
      "doi": "10.5555/117640"
    },
    {
      "text": "Whittaker, S. and Sidner, C. Email overload: exploring personal information management of email. In Proc. CHI 1996, ACM Press (1996), 276--283.  ",
      "doi": "10.1145/238386.238530"
    }
  ]
}