{
  "doi": "10.1145/1124772.1124896",
  "title": "Effectiveness of annotating by hand for non-alphabetical languages",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "841-850",
  "year": 2006,
  "badges": [],
  "abstract": "Unlike documents, annotation for multimedia information needs to be input as text, not in the form of symbols such as underlines and circles. This is problematic with keyboard input for non-alphabetical languages, especially the East Asian languages such as Chinese and Japanese, because it is labor intensive and imposes a high cognitive load. This study provides a quantitative analysis of the effectiveness of making annotations by hand during a note-taking task in Japanese. Although the lessons learned from this study come from Japanese text input, they are also generally applicable to other East Asian Languages which use ideographic characters such as Chinese. In our study, we focused on both the ergonomic and cognitive aspects and found that during annotation and note-taking task input by hand is more effective than input by keyboard. Finally, we anatomized the keyboard input problem and discuss it in this paper.",
  "tags": [
    "cognitive load",
    "input speed",
    "non-alphabetical languages",
    "keyboard input",
    "handwritten annotation"
  ],
  "authors": [
    {
      "name": "Muhd Dzulkhiflee Hamzah",
      "institution": "University of Electro-Communications, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311483807",
      "orcid": "missing"
    },
    {
      "name": "Shun'ichi Tano",
      "institution": "University of Electro-Communications, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100095363",
      "orcid": "missing"
    },
    {
      "name": "Mitsuru Iwata",
      "institution": "University of Electro-Communications, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485596",
      "orcid": "missing"
    },
    {
      "name": "Tomonori Hashiyama",
      "institution": "University of Electro-Communications, Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317494031",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "O'Hara, K., and Sellen, A. A Comparison of Reading Paper and On-Line Document. In Proc. CHI 1997, ACM Press (1997), 335--342.  ",
      "doi": "10.1145/258549.258787"
    },
    {
      "text": "Schilit, B.N., Golovchinsky, G., and Price, M.N. Beyond Paper: Supporting Active Reading with Free Form Digital Ink Annotations. In Proc. CHI 1998, ACM Press (1998), 249--256.  ",
      "doi": "10.1145/274644.274680"
    },
    {
      "text": "Marshall, C.C. Annotation: From Paper Books to the Digital Library. In Proc. ACM International Conference on Digital Libraries 1997, ACM Press (1997), 131--140.  ",
      "doi": "10.1145/263690.263806"
    },
    {
      "text": "Bargeron, D., Moscovich, T. Reflowing Digital Ink Annotations. In Proc. CHI 2003, ACM Press (2003), 385--392.  ",
      "doi": "10.1145/642611.642678"
    },
    {
      "text": "Tano, S., Ogisawa, D., Iwata, M., and Sasaki, Y. DynaGraffiti: Hand-written Annotation System for Interactive and Dynamic Digital Information. In Proc. HCI International 2003, 2 (2003), 781--785.",
      "doi": ""
    },
    {
      "text": "Ramos, G., and Balakrishnan, R. Fluid Interaction Techniques for the Control and Annotation of Digital Video. In Proc. UIST 2003, ACM Press (2003), 105--114.  ",
      "doi": "10.1145/964696.964708"
    },
    {
      "text": "Wang, J., Zhai, S., and Su, H. Chinese Input with Keyboard and Eye-Tracking: An Anatomical Study. In Proc. CHI 2001, ACM Press (2001), 349--356.  ",
      "doi": "10.1145/365024.365298"
    },
    {
      "text": "Ren, X., Tamura, K., Kong, J., and Zhai, S. Candidate Display Styles in Japanese Input. In Proc. INTERACT 2003, IOS Press (2003), 868--871.",
      "doi": ""
    },
    {
      "text": "Agenbroad, J. Character sets: Current Status and East Asian Prospects. In Journal of Library Automation, 13(1) (2003), 18--35.",
      "doi": ""
    },
    {
      "text": "Miyazawa, A. Character Code for Japanese Text Processing. In Journal of Information Processing, 13(1) (1990), 2--9. ",
      "doi": "10.5555/81633.81634"
    },
    {
      "text": "Umemuro, H. Lowering Japanese Elderly Users' Resistance Towards Computers by Using Touchscreen Technology. In Journal of Universal Access in the Information Society, 3(3) (2004), 276--288.  ",
      "doi": "10.5555/1028177.1028181"
    },
    {
      "text": "Morita, A. On the Optimization of Japanese Text Input System and Keyboard System. In Trans. Inst. Electron. Inf. Commun. Eng., J70D(11) (1987), 2047--2057.",
      "doi": ""
    },
    {
      "text": "Morita, A. Quantitative Comparisons on Performances of Various Japanese Text Input Systems. In Trans. Inst. Electron. Inf. Commun. Eng., J70D(11) (1987), 2182--2190.",
      "doi": ""
    },
    {
      "text": "Tamura, H., and Choui, M. Text Input Speed of the Student in University Classes. In Proc. Human Interface 2003, 81--84.",
      "doi": ""
    },
    {
      "text": "Mackenzie, I.S., Seller, A., and Buxton, W. Comparison of Input Device in Elemental Pointing and Dragging Task. In Proc. CHI 1991, ACM Press (1991), 161--166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "Uoi, H., Shinoda, M., Yamamoto, Y., Tsujino, Y., and Tokura, N. An Experimental Comparison of Pen-Tablet and Mouse in Selecting Two Targets. In IPSJ SIG Technical Reports, HI-043 (1992), 82--99.",
      "doi": ""
    },
    {
      "text": "Kato, N., and Nakagawa, M. An Investigation into the Usability of a Pen for Designing Pen User Interface. In Journal of IPSJ, 39(5) (1998), 1536--1546.",
      "doi": ""
    },
    {
      "text": "Kamura, S., Tano, S., and Iwata, M. Proposal of Digital Paper Concept for Seamless Traverse between Handwritten and Coded Information. In Proc. Human Interface 2003, 125--128.",
      "doi": ""
    },
    {
      "text": "Muhd Dzulkhiflee, Tano, S., Iwata, M., and Hashiyama, T. Qualitative Analysis of Effects of Handwritten Annotation on Intelligent Work. In Proc. HCI International 2005.",
      "doi": ""
    },
    {
      "text": "Muhd Dzulkhiflee, Tano, S., Iwata, M., and Hashiyama, T. A Quantitative Analysis on Effectiveness of Handwriting Annotation. In IPSJ SIG Technical Reports, HI-113 (2005), 51--58.",
      "doi": ""
    },
    {
      "text": "Muhd Dzulkhiflee, Tano, S., Iwata, M., and Hashiyama, T. A Comparison Analysis on Handwriting and Keyboard Input. In Proc. Human Interface 2005, 1 (2005), 163--168.",
      "doi": ""
    },
    {
      "text": "Japan Testing Association. http://nikken.goukaku.ne.jp/.",
      "doi": ""
    }
  ]
}