{
  "doi": "10.1145/1124772.1124806",
  "title": "Share and share alike: exploring the user interface affordances of file sharing",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "221-230",
  "year": 2006,
  "badges": [],
  "abstract": "With the rapid growth of personal computer networks and the Internet, sharing files has become a central activity in computer use. The ways in which users control the what, how, and with whom of sharing are dictated by the tools they use for sharing; there are a wide range of sharing practices, and hence a wide range of tools to support these practices. In practice, users' requirements for certain sharing features may dictate their choice of tool, even though the other affordances available through that tool may not be an ideal match to the desired manner of sharing.In this paper, we explore users' current practices in file sharing and examine the tools used to share files. Based on our findings, we unpack the features and affordances of these tools into a set of dimensions along which sharing tools can be characterized. Then, we present the set of user interface features we have prototyped in an interface called a sharing palette, which provides a platform for exploration and experimentation with new modalities of sharing. We briefly present the tool as a whole and then focus on the individual features of the sharing palette that support reported styles of sharing.",
  "tags": [
    "user interface design",
    "user agency",
    "file sharing",
    "sharing",
    "computer-supported cooperative work (CSCW)"
  ],
  "authors": [
    {
      "name": "Stephen Voida",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/do/10.1145/contrib-81100147302/rel-imgonly/steve_-_interactions__cropped_close_.png",
      "acmid": "81100147302",
      "orcid": "missing"
    },
    {
      "name": "W. Keith Edwards",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100595699",
      "orcid": "missing"
    },
    {
      "name": "Mark W. Newman",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406594629",
      "orcid": "0000-0001-7186-1383"
    },
    {
      "name": "Rebecca E. Grinter",
      "institution": "Georgia Institute of Technology, Atlanta, GA",
      "img": "/do/10.1145/contrib-81328488487/rel-imgonly/head.jpg",
      "acmid": "81328488487",
      "orcid": "0000-0002-1957-4130"
    },
    {
      "name": "Nicolas Ducheneaut",
      "institution": "Palo Alto Research Center, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81100116901/rel-imgonly/nic_photo.jpg",
      "acmid": "81100116901",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apple iTunes. http://www.apple.com/itunes, 2006.",
      "doi": ""
    },
    {
      "text": "Bellotti, V., Ducheneaut, N., Howard, M.A., Smith, I.E. Taking email to task: The design and evaluation of a task management centered email tool. In Proc. of CHI 2003, ACM Press (2003), 345--352.  ",
      "doi": "10.1145/642611.642672"
    },
    {
      "text": "Bentley, R., Appelt, W., Busbach, U., Hinrichs, E., Kerr, D., Sikkel, K., Trevor, J. and Woetzel, G. Basic support for cooperative work on the World Wide Web. International Journal of Human Computer Studies, 46, 6 (June 1997), 827--846.  ",
      "doi": "10.1006/ijhc.1996.0108"
    },
    {
      "text": "Brown, B., Sellen, A.J. & Geelhoed, E. Music sharing as a computer supported collaborative application. In Proc. of ECSCW 2001, Kluwer Academic Publishers (2001), 179--198. ",
      "doi": "10.5555/1241867.1241877"
    },
    {
      "text": "Deolasee, P., Katkar, A., Panchbudhe, A., Ramamritham, K. & Shenoy, P. Adaptive Push-Pull: Disseminating dynamic web data. In Proc. of the International World Wide Web Conference, ACM Press (2001), 265--274.  ",
      "doi": "10.1145/371920.372066"
    },
    {
      "text": "Edwards, W.K., Newman, M.W., Sedivy, J.Z., Smith, T.F., Balfanz, D., Smetters, D.K., Wong, H.C., and Izadi, S. Using Speakeasy for ad hoc peer--to--peer collaboration. In Proc. of CSCW 2002, ACM Press (2002), 256--265.  ",
      "doi": "10.1145/587078.587114"
    },
    {
      "text": "Erickson, T. & Kellogg, W. Social Translucence: An approach to designing systems that mesh with social processes. ACM Transactions on Computer-Human Interaction, 7, 1 (2000), 59--83.  ",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Flickr. http://www.flickr.com, 2006.",
      "doi": ""
    },
    {
      "text": "Gnutella. http://www.gnutella.com, 2006.",
      "doi": ""
    },
    {
      "text": "Good, N.S. and Krekelberg, A. Usability and privacy: A study of KaZaA P2P file sharing. In Proc. of CHI 2003, ACM Press (2003), 137--144.  ",
      "doi": "10.1145/642611.642636"
    },
    {
      "text": "Groove Virtual Office. http://www.groove.net, 2006.",
      "doi": ""
    },
    {
      "text": "Lee, J. Technical and social components of peer--to--peer computing: An end-user perspective on file-sharing systems. Communications of the ACM, 46, 2 (February 2003), 49--53.  ",
      "doi": "10.1145/606272.606300"
    },
    {
      "text": "Leuf, B. and Cunningham, W. The Wiki Way: Quick collaboration on the Web. Addison-Wesley, Boston, MA, 2001. ",
      "doi": "10.5555/375211"
    },
    {
      "text": "KaZaA Media Desktop. http://www.kazaa.com, 2006.",
      "doi": ""
    },
    {
      "text": "Napster. http://www.napster.com, 2006.",
      "doi": ""
    },
    {
      "text": "Network File System. http://www.nfsv4.org, 2006.",
      "doi": ""
    },
    {
      "text": "Norman, D.A. The Design of Everyday Things. Basic Books, New York, 1988.",
      "doi": ""
    },
    {
      "text": "Olson, J.S., Grudin, J. and Horvitz, E. Toward understanding preferences for sharing and privacy. In Extended Abstracts of CHI 2005, ACM Press (2005), 1985--1988.  ",
      "doi": "10.1145/1056808.1057073"
    },
    {
      "text": "Rodden, T. Populating the application: A model of awareness for cooperative applications. In Proc. of CSCW 1996, ACM Press (1996), 87--96.  ",
      "doi": "10.1145/240080.240200"
    },
    {
      "text": "Shen, H. and Dewan, P. Access control for collaborative environments. In Proc. of CSCW 1992, ACM Press (2002), 51--58.  ",
      "doi": "10.1145/143457.143461"
    },
    {
      "text": "Sikkel, K. A group-based authorization model for cooperative systems. In Proc. of ECSCW 1997, Kluwer Academic Publishers (1997), 345--360. ",
      "doi": "10.5555/1241980.1242003"
    },
    {
      "text": "Smetters, D.K. and Grinter, R.E. Moving from the design of usable security technology to the design of useful secure applications. In Proc. of ACM New Security Paradigms Workshop, ACM Press (2002).  ",
      "doi": "10.1145/844102.844117"
    },
    {
      "text": "Voida, A., Grinter, R.E., Ducheneaut, N., Edwards, W.K. and Newman, M.W. Listening in: Practices surrounding iTunes music sharing. In Proc. of CHI 2005, ACM Press (2005), 191--200.  ",
      "doi": "10.1145/1054972.1054999"
    },
    {
      "text": "Voida, S., Edwards, W.K. & Newman, M.W. The Sharing Palette: A user interface for file and service sharing. Poster presented at UIST '04, Santa Fe, New Mexico, October 24--27, 2004.",
      "doi": ""
    },
    {
      "text": "Yee, K. User interaction design for secure systems. In Proc. of the 4th International Conference on Information and Communications Security, Springer-Verlag (2002), 278--290. ",
      "doi": "10.5555/646280.687663"
    }
  ]
}