{
  "doi": "10.1145/1124772.1124939",
  "title": "Attention funnel: omnidirectional 3D cursor for mobile augmented reality platforms",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1115-1122",
  "year": 2006,
  "badges": [],
  "abstract": "The attention funnel is a general purpose AR interface technique that interactively guides the attention of a user to any object, person, or place in space. The technique utilizes dynamic perceptual affordances to draw user attention \"down\" the funnel to the target location. Attention funnel can be used to cue objects completely out of sight including objects behind the user, or occluded by other objects or walls.An experiment evaluating user performance with the attention funnel and other conventional AR attention directing techniques found that the attention funnel increased the consistency of the user's search by 65%, increased search speed by 22%, and decreased mental workload by 18%. The attention funnel has potential applicability as a general 3D cursor or cue in a wide array of spatially enabled mobile and AR systems, and for applications where systems can support users in visual search, object awareness, and emergency warning in indoor and outdoor spaces.",
  "authors": [
    {
      "name": "Frank Biocca",
      "institution": "Michigan State University, East Lansing, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100082338",
      "orcid": "missing"
    },
    {
      "name": "Arthur Tang",
      "institution": "University of Central Florida, Orlando, FL",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100640678",
      "orcid": "missing"
    },
    {
      "name": "Charles Owen",
      "institution": "Michigan State University, East Lansing, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408594090",
      "orcid": "missing"
    },
    {
      "name": "Fan Xiao",
      "institution": "Michigan State University, East Lansing, MI",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342516469",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Azuma, R. (1997). A survey of augmented reality. Presence: Teleoperators and Virtual Environments, 6(4): p. 355 -- 385.",
      "doi": "10.1162/pres.1997.6.4.355"
    },
    {
      "text": "Blauert, J. (1983). Spatial hearing: the psychoacoutics of human sound localization. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Bonanni, L., Lee, C. and Selker, T. (2005). Attention-based design of augmented reality interfaces. In Proc. ACM CHI 2005.  ",
      "doi": "10.1145/1056808.1056883"
    },
    {
      "text": "Burgoon, J., Buller, D. and Woodall, W. (1996). Nonverbal communication: the unspoken dialogue. McGraw-Hill Companies, Inc.",
      "doi": ""
    },
    {
      "text": "Feiner, S., MacIntyre, B. and Seligmann, D. (1993). Knowledge-baed augmented reality. Communication of the ACM, 36(7): p. 52 -- 62.  ",
      "doi": "10.1145/159544.159587"
    },
    {
      "text": "Foxlin, E., Harrington, M. and Pfeifer, G. (1998). Constellation: a wide-range wireless motion-tracking system for augmented reality and virtual set applications. In Proc. ACM SIGGRAPH 1998.  ",
      "doi": "10.1145/280814.280937"
    },
    {
      "text": "Haehnel, D., Burgard, W., Fox, D., Fishkin, K. and Philipose, M. (2004). Mapping and localization with RFID technology. In Proc. IEEE International Conference on Robotics and Automation.",
      "doi": ""
    },
    {
      "text": "Hancock, P. and Meshkati, N. (1988). Human mental workload. North-Holland, Amsterdam, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Hart, S. and Staveland, L. (1988). Development of NASA-TLX (Task Load Index): results of empirical and theoretical research, in Human Mental Workload, Hancock, P. and Meshkati, N., Editors. North-Holland, Amsterdam, The Netherlands. p. 139 -- 183.",
      "doi": ""
    },
    {
      "text": "Hearn, D. and Baker, M.P. (1996). Computer Graphics, C Version. Prentice Hall. ",
      "doi": "10.5555/6251"
    },
    {
      "text": "Hochberg, J. (1986). Representation of motion and space in video and cinematic displays, in Handbook of Perception and Human Performance, Vol. 1, Boff, K., Kaufman, L.T. and Thomas, J., Editors. Wiley, New York, NY.",
      "doi": ""
    },
    {
      "text": "Hofmann-Wellenhof, B., Lichtenegger, H. and Collins, J. (2004). Global positioning system: theory and practice. Springer.",
      "doi": ""
    },
    {
      "text": "Horvitz, E., Kadie, C., Paek, T. and Hovel, D. (2003). Models of attention in computing and communication: from principles to applications. Communication of the ACM, 46(3): p. 52--59.  ",
      "doi": "10.1145/636772.636798"
    },
    {
      "text": "Johnson, A. and Proctor, R.W. (2004). Attention: theory and practice. Sage Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Kato, H. and Billinghurst, M. (1999). Marker tracking and HMD Calibration for a video-based augmented reality conferencing system. In Proc. 2nd International Workshop on Augmented Reality. ",
      "doi": "10.5555/857202.858134"
    },
    {
      "text": "Khan, A., Matejka, J., Fitzmaurice, G. and Kurtenbach, G. (2005). Spotlight: directing users' attention on large display. In Proc. ACM CHI 2005.  ",
      "doi": "10.1145/1054972.1055082"
    },
    {
      "text": "Mann, S. (2000). Telepointer: Hands-Free Completely Self Contained Wearable Visual Augmented Reality without Headwear and without any Infrastructural Reliance. In Proc. Fourth International Symposium on Wearable Computers. ",
      "doi": "10.5555/851037.856522"
    },
    {
      "text": "McCrickard, D. and Chewar, C. (2003). Attentive user interface: attuning notification design to user goals and attention costs. Communication of the ACM, 46(3): p. 67--72.  ",
      "doi": "10.1145/636772.636800"
    },
    {
      "text": "Moran, T.P. and Dourish, P. (2001,). Introduction to This Special Issue on Context-Aware Computing. Human-Computer Interaction, 16: p. 87--95.  ",
      "doi": "10.1207/S15327051HCI16234_01"
    },
    {
      "text": "Owen, C., Tang, A. and Xiao, F. (2003). ImageTclAR: a blended script and compiled code development system for augmented reality. In Proc. STARS2003, The International Workshop on Software Technology for Augmented Reality Systems.",
      "doi": ""
    },
    {
      "text": "Redelmeier, D.A. and Tibshirani, R.J. (1997). Association between Cellular Telephone Calls and Motor Vehicle Collisions. New England Journal of Medicine, 336(7): p. 453--458.",
      "doi": ""
    },
    {
      "text": "Roel, V. (2002). Designing attentive interfaces. In Proc. Symposium on Eye Tracking Reasearch & Applications.  ",
      "doi": "10.1145/507072.507077"
    },
    {
      "text": "Schmalstieg, D. and Wagner, D. (2005). A handheld augmented reality museum guide. In Proc. IADIS International Conference on Mobile Learning 2005.",
      "doi": ""
    },
    {
      "text": "Shiffrin, R. (1979). Visual processing capacity and attentional control. Journal of Experimental Psychology: Human Perception and Performance, 5: p. 522--526.",
      "doi": ""
    },
    {
      "text": "Strayer, D.L. and A., J.W. (2001). Driven to distraction: dual-task studies of simulated driving and conversing on a cellular phone. Psychological Science, 12(6): p. 462--466.",
      "doi": ""
    },
    {
      "text": "van der Heijden, A.H.C. (1992). Selective attention in vision. Routledge, New York, NY.",
      "doi": ""
    },
    {
      "text": "van der Heijden, A.H.C. (2003). Attention in vision: perception, communication, and action. Psychology Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Wagner, D., Pintaric, T., Ledermann, F. and Schmalstieg, D. (2005). Towards massively multi-user augmented reality on handheld devices. In Proc. Third International Conference on Pervasive Computing.  ",
      "doi": "10.1007/11428572_13"
    },
    {
      "text": "Wagner, D. and Schmalstieg, D. (2003). First steps towards handheld augmented reality. In Proc. 7th Internation Symposium on Wearable Computers. ",
      "doi": "10.5555/946249.946910"
    }
  ]
}