{
  "doi": "10.1145/1124772.1124887",
  "title": "Tabletop sharing of digital photographs for the elderly",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "781-790",
  "year": 2006,
  "badges": [],
  "abstract": "We have recently begun to see hardware support for the tabletop user interface, offering a number of new ways for humans to interact with computers. Tabletops offer great potential for face-to-face social interaction; advances in touch technology and computer graphics provide natural ways to directly manipulate virtual objects, which we can display on the tabletop surface. Such an interface has the potential to benefit a wide range of the population and it is important that we design for usability and learnability with diverse groups of people.This paper describes the design of SharePic -- a multiuser, multi-touch, gestural, collaborative digital photograph sharing application for a tabletop -- and our evaluation with both young adult and elderly user groups. We describe the guidelines we have developed for the design of tabletop interfaces for a range of adult users, including elders, and the user interface we have built based on them. Novel aspects of the interface include a design strongly influenced by the metaphor of physical photographs placed on the table with interaction techniques designed to be easy to learn and easy to remember. In our evaluation, we gave users the final task of creating a digital postcard from a collage of photographs and performed a realistic think-aloud with pairs of novice participants learning together, from a tutorial script.",
  "tags": [
    "tabletop interface",
    "learnability",
    "touch",
    "photograph sharing",
    "elderly",
    "digital photograph",
    "gesture"
  ],
  "authors": [
    {
      "name": "Trent Apted",
      "institution": "University of Sydney, Sydney, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100350518",
      "orcid": "missing"
    },
    {
      "name": "Judy Kay",
      "institution": "University of Sydney, Sydney, Australia",
      "img": "/do/10.1145/contrib-81100544712/rel-imgonly/81100544712.jpg",
      "acmid": "81100544712",
      "orcid": "missing"
    },
    {
      "name": "Aaron Quigley",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331502006",
      "orcid": "0000-0002-5274-6889"
    }
  ],
  "references": [
    {
      "text": "American Foundation for the Blind. Normal changes in the aging eye. http://www.afb.org/Section.asp?SectionID=35&TopicID=212&SubTopicID=39 (2005). Verified 2005-09-23.",
      "doi": ""
    },
    {
      "text": "Apted T., Kay J., and Quigley A. A study of elder users in a face-to-face collaborative multi-touch digital photograph sharing scenario. Tech. Rep. TR576, School of IT, University of Sydney (2005).",
      "doi": ""
    },
    {
      "text": "Balabanovic M., Chu L.L., and Wolff G.J. Storytelling with digital photographs. In CHI '00: Proceedings of the SIGCHI conference on Human factors in computing systems, pp. 564--571. ACM Press, New York, NY, USA (2000). ISBN 1-58113-216-6.  ",
      "doi": "10.1145/332040.332505"
    },
    {
      "text": "Becker S.A. A study of Web usability for older adults seeking online health resources. In ACM Trans. Comput.-Hum. Interact., 11(4):387--406 (2004). ISSN 1073-0516.  ",
      "doi": "10.1145/1035575.1035578"
    },
    {
      "text": "Chadwick-Dias A., McNulty M., and Tullis T. Web usability and age: How design changes can improve performance. In CUU '03: Proceedings of the 2003 conference on Universal usability, pp. 30--37. Vancouver, British Columbia, Canada. ACM Press. (2003). ISBN 1-58113-701-X.  ",
      "doi": "10.1145/957205.957212"
    },
    {
      "text": "Chaparro A., Bohan M., abd S. D. Choi J.E.F., and Kattel B. The impact of age on computer input device use: Psychophysical and physiological measures. In Int. J. Indust. Ergonomics, 24:503--513. (1999).",
      "doi": ""
    },
    {
      "text": "Coyne K.P. and Nielsen J. Web usability for senior citizens: 46 design guidelines based on usability studies with people age 65 and older. Tech. rep., Nielsen Norman Group (2002).",
      "doi": ""
    },
    {
      "text": "Crabtree A., Rodden T., and Mariani J. Collaborating around collections: Informing the continued development of photoware. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work (CSCW'04), pp. 396--405. Chicago, IL. ACM Press (2004).  ",
      "doi": "10.1145/1031607.1031673"
    },
    {
      "text": "Dietz P. and Leigh D. DiamondTouch: A multi-user touch technology. In J. Marks and E. Mynatt, eds., Proceedings of 14th annual ACM symposium on User interface software and technology, pp. 219--226. Orlando, FL. ACM Press (2001). ISBN 1-58113-438-X.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Drucker S.M., Wong C., Roseway A., Glenner S., and De Mar S. MediaBrowser: Reclaiming the shoebox. In AVI '04: Proceedings of the working conference on Advanced visual interfaces, pp. 433--436. Gallipoli, Italy. ACM Press (2004). ISBN 1-58113-867-9.  ",
      "doi": "10.1145/989863.989944"
    },
    {
      "text": "Everitt K., Forlines C., Ryall K., and Shen C. Observations of a shared tabletop user study. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work (CSCW'04). ACM Press, Chicago, Illinois, USA (2004). Interactive Poster Abstract.",
      "doi": ""
    },
    {
      "text": "Frohlich D., Kuchinsky A., Pering C., Don A., and Ariss S. Requirements for photoware. In Proceedings of the 2002 ACM Conference on Computer Supported Cooperative Work, pp. 166--175. New Orleans, LA. ACM Press (2002).  ",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "Huynh D.F., Drucker S.M., Baudisch P., and Wong C. Time quilt: Scaling up zoomable photo browsers for large, unstructured photo collections. In CHI '05 extended abstracts on Human factors in computing systems, pp. 1937--1940. Portland, OR. ACM Press (2005). ISBN 1-59593-002-7.  ",
      "doi": "10.1145/1056808.1057061"
    },
    {
      "text": "Kruger R., Carpendale S., Scott S.D., and Tang A. Fluid integration of rotation and translation. In CHI '05: Proceedings of the SIGCHI conference on Human factors in computing systems, pp. 601--610. Portland, OR. ACM Press (2005). ISBN 1-58113-998-5.  ",
      "doi": "10.1145/1054972.1055055"
    },
    {
      "text": "Nielsen J. Usability Engineering. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA (1993). ISBN 0125184050. ",
      "doi": "10.5555/529793"
    },
    {
      "text": "Rekimoto J. SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. In D. Wixon, ed., Proceedings of the SIGCHI conference on Human factors in computing systems: Changing our world, changing ourselves, pp. 113-- 120. ACM Press, Minneapolis, Minnesota, USA (2002). ISBN 1-58113-453-3.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Ringel M., Ryall K., Shen C., Forlines C., and Vernier F. Release, relocate, reorient, resize: fluid techniques for document sharing on multi-user interactive tables. In E. Dykstra-Erickson and M. Tscheligi, eds., Extended abstracts of the 2004 conference on Human factors and computing systems, pp. 1441--1444. Vienna, Austria. ACM Press (2004). ISBN 1-58113-703-6.  ",
      "doi": "10.1145/985921.986085"
    },
    {
      "text": "Risborg P. and Quigley A. Nightingale: Reminiscence and technology -- from a user perspective. In Proceedings of OZe-WAI 2003, pp. 1--8. La Trobe University, Victoria, Australia (2003).",
      "doi": ""
    },
    {
      "text": "Rodden K. andWood K.R. How do people manage their digital photographs? In G. Cockton and P. Korhonen, eds., Proceedings of the Conference on Human Factors in Computing Systems (CHI2003), pp. 409--416. Ft. Lauderdale, FL, USA. ACM Press (2003). ISBN 1-58113-630-7.  ",
      "doi": "10.1145/642611.642682"
    },
    {
      "text": "Ryall K., Forlines C., Shen C., and Morris M.R. Exploring the effects of group size and table size on interactions with tabletop shared-display groupware. In Proceedings of the ACM Conference on Computer-Supported Cooperative Work (CSCW'04), pp. 284--293. Chicago, IL, USA. ACM Press (2004).  ",
      "doi": "10.1145/1031607.1031654"
    },
    {
      "text": "Scott S.D. Territoriality in Collaborative Tabletop Workspaces. Ph.D. thesis, Department of Computer Science, University of Calgary, Alberta, Canada (2005). ",
      "doi": "10.5555/1123527"
    },
    {
      "text": "Shen C., Lesh N.B., and Vernier F. Personal digital historian: Story sharing around the table. In ACM Interactions, 10(2):15--22 (2003). ISSN 1072-5520.  ",
      "doi": "10.1145/637848.637856"
    },
    {
      "text": "Shen C., Vernier F., Forlines C., and Ringel M. Diamond-Spin: An extensible toolkit for around-the-table interaction. In E. Dykstra-Erickson and M. Tscheligi, eds., Proceedings of the 2004 Conference on Human Factors in Computing Systems (CHI 2004), pp. 167--174. Vienna, Austria. ACM Press (2004). ISBN 1-58113-702-8.  ",
      "doi": "10.1145/985692.985714"
    },
    {
      "text": "Strong A.J., Walker N., and Rogers W.A. Searching the World Wide Web: Can older adults get what they need? In W.A. Rogers and A.D. Fisk, eds., Human Factors Interventions for the Health Care of Older Adults, pp. 255--269. Lawrence Erlbaum Assoc., Inc., Mahwah, NJ, USA (2001).",
      "doi": ""
    },
    {
      "text": "Tognazzini B. Tog on software design. Addison Wesley Longman Publishing Co., Inc., Redwood City, CA, USA (1996). ISBN 0-201-48917-1. ",
      "doi": "10.5555/229972"
    },
    {
      "text": "Vernier F., Lesh N., and Shen C. Visualization techniques for circular tabletop interfaces. In Proceedings of Advanced Visual Interfaces (AVI'02), pp. 257--266. Trento, Italy. ACM Press (2002).  ",
      "doi": "10.1145/1556262.1556305"
    },
    {
      "text": "Wu M. and Balakrishnan R. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology, pp. 192--202. Vancouver, Canada. ACM Press (2003). ISBN 1-58113-636-6.  ",
      "doi": "10.1145/964696.964718"
    }
  ]
}