{
  "doi": "10.1145/1124772.1124968",
  "title": "The impact of delayed visual feedback on collaborative performance",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1303-1312",
  "year": 2006,
  "badges": [],
  "abstract": "When pairs work together on a physical task, seeing a common workspace benefits their performance and transforms their use of language. Previous results have demonstrated that visual information helps collaborative pairs to understand the current state of their task, ground their conversations, and communicate efficiently. However, collaborative technologies often impinge on the visual information needed to support successful collaboration. One example of this is the introduction of delayed visual feedback in a collaborative environment. We present results from two studies that detail the form of the function that describes the relationship between visual delay and collaborative task performance. The first study precisely demonstrates how a range of visual delays differentially impact performance and the collaborative strategies employed. The second study describes how parameters of the task, such as the dynamics of the visual environment, reduce the amount of delay that can be tolerated.",
  "tags": [
    "empirical studies",
    "computer-supported cooperative work",
    "visual delay",
    "shared visual space",
    "language",
    "communication"
  ],
  "authors": [
    {
      "name": "Darren Gergle",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    },
    {
      "name": "Robert E. Kraut",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    },
    {
      "name": "Susan R. Fussell",
      "institution": "Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100583820/rel-imgonly/img_0320profile2.jpg",
      "acmid": "81100583820",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyle, M., and Cook, M. (1976). Gaze and mutual gaze. Cambridge University Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Boyle, E.A., Anderson, A.H., and Newlands, A. (1994). The effects of visibility on dialogue and performance in a cooperative problem solving task. Language & Speech, 37 (1), 1--20.",
      "doi": ""
    },
    {
      "text": "Brennan, S.E. (2005). How conversation is shaped by visual and spoken evidence. In Trueswell, J.C., and Tanenhaus, M.K. eds. Approaches to studying world-situated language use: Bridging the language-as-product and language-as-action traditions, 95--129. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Clark, H.H. (1996). Using language. Cambridge University Press, New York, NY, US.",
      "doi": ""
    },
    {
      "text": "Clark, H.H., and Krych, M.A. (2004). Speaking while monitoring addressees for understanding. Journal of Memory & Language, 50 (1), 62--81.",
      "doi": ""
    },
    {
      "text": "Clark, H.H., and Marshall, C.R. (1981). Definite reference and mutual knowledge. In Joshi, A.K., Webber, B.L., and Sag, I.A. eds. Elements of discourse understanding. Cambridge University Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Clark, H.H., and Wilkes-Gibbs, D. (1986). Referring as a collaborative process. Cognition, 22 (1), 1--39.",
      "doi": ""
    },
    {
      "text": "Cohen, K. (1982). Speaker interaction: Video teleconferences versus face-to-face meetings. In Proceedings of Teleconferencing and Electronic Communications, 189-199. University of Wisconsin Press.",
      "doi": ""
    },
    {
      "text": "Craven, P., and Wahba, G. (1979). Smoothing noisy data with spline functions. Estimating the correct degree of smoothing by the method of generalized cross-validation. Numerische Mathematik, 31, 317--403.",
      "doi": ""
    },
    {
      "text": "Endsley, M.R. (1995). Toward a theory of situation awareness in dynamic systems. Human Factors Special Issue: Situation Awareness, 37 (1), 32--64.",
      "doi": ""
    },
    {
      "text": "Endsley, M.R., and Garland, D.J. (2000). Situation awareness analysis and measurement. LEA, Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Friedman, J.H. (1991). Multivariate adaptive regression splines. Annals of Statistics, 19, 1--141.",
      "doi": ""
    },
    {
      "text": "Fussell, S.R., Setlock, L.D., and Parker, E.M. (2003). Where do helpers look? Gaze targets during collaborative physical tasks. In Proceedings of ACM Conference on Human Factors in Computing Systems (CHI 2003) (Extended Abstracts), 768--769. NY: ACM Press.  ",
      "doi": "10.1145/765891.765980"
    },
    {
      "text": "Gergle, D., Kraut, R.E., and Fussell, S.R. (2004). Action as language in a shared visual space. In Proceedings of ACM Conference on Computer Supported Cooperative Work (CSCW 04), 487--496. NY: ACM Press.  ",
      "doi": "10.1145/1031607.1031687"
    },
    {
      "text": "Gergle, D., Kraut, R.E., and Fussell, S.R. (2004). Language efficiency and visual technology: Minimizing collaborative effort with visual information. Journal of Language & Social Psychology, 23 (4), 491--517.",
      "doi": ""
    },
    {
      "text": "Gutwin, C. (2001). The effects of network delays on group work in real-time groupware. In Proceedings of European Conference on Computer-Supported Cooperative Work, 299--318. ",
      "doi": "10.5555/1241867.1241883"
    },
    {
      "text": "Gutwin, C., Benford, S., Dyck, J., Fraser, M., Vaghi, I., and Greenhalgh, C. (2004). Revealing delay in collaborative environments. In Proceedings of ACM Conference on Computer Human Interaction (CHI 2004), 503--510. NY: ACM Press.  ",
      "doi": "10.1145/985692.985756"
    },
    {
      "text": "Krauss, R.M., and Bricker, P.D. (1967). Effects of transmission delay and access delay on the efficiency of verbal communication. Journal of the Acoustical Society of America, 41 (2), 286--292.",
      "doi": ""
    },
    {
      "text": "Kraut, R.E., Fussell, S.R., and Siegel, J. (2003). Visual information as a conversational resource in collaborative physical tasks. Human Computer Interaction, 18 (1), 13--49.  ",
      "doi": "10.1207/S15327051HCI1812_2"
    },
    {
      "text": "Kraut, R.E., Gergle, D., and Fussell, S.R. (2002). The use of visual information in shared visual spaces: Informing the development of virtual co-presence. In Proceedings of ACM Conference on Computer Supported Cooperative Work (CSCW 2002), 31--40. ACM Press.  ",
      "doi": "10.1145/587078.587084"
    },
    {
      "text": "Nardi, B., Schwarz, H., Kuchinsky, A., Leichner, R., Whittaker, S., and Sclabassi, R.T. (1993). Turning away from talking heads: The use of video-as-data in neurosurgery. In Proceedings of ACM INTERCHI'93 Conference on Human Factors in Computing Systems, 327--334. ",
      "doi": "10.5555/164632.164937"
    },
    {
      "text": "O'Conaill, B., and Whittaker, S. (1997). Characterizing, predicting, and measuring video-mediated communication: A conversational approach. In Finn, K.E., Sellen, A.J., and Wilbur, S.B. eds. Video-Mediated Communication, 107--131. LEA.",
      "doi": ""
    },
    {
      "text": "Schober, M.F. (1993). Spatial perspective-taking in conversation. Cognition, 47, 1--24.",
      "doi": ""
    },
    {
      "text": "Tang, J.C., and Isaacs, E.A. (1993). Why do users like video? Studies of multimedia-supported collaboration. CSCW: An International Journal, 1, 163--196.",
      "doi": ""
    },
    {
      "text": "Vaghi, I., Greenhalgh, C., and Benford, S. (1999). Coping with inconsistency due to network delays in collaborative virtual environments. In Proceedings of VRST '99, 42--49.  ",
      "doi": "10.1145/323663.323670"
    },
    {
      "text": "Whittaker, S. (2003). Things to talk about when talking about things. Human-Computer Interaction, 18 (1-2), 149--170.  ",
      "doi": "10.1207/S15327051HCI1812_6"
    },
    {
      "text": "Whittaker, S., and O'Conaill, B. (1997). The role of vision in face-to-face and mediated communication. In Finn, K.E., Sellen, A.J., and Wilbur, S.B. eds. Video-Mediated Communication, 23--49. LEA.",
      "doi": ""
    }
  ]
}