{
  "doi": "10.1145/1124772.1124874",
  "title": "Beyond record and play: backpacks: tangible modulators for kinetic behavior",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "681-690",
  "year": 2006,
  "badges": [],
  "abstract": "Digital Manipulatives embed computation in familiar children's toys and provide means for children to design behavior. Some systems use \"record and play\" as a form of programming by demonstration that is intuitive and easy to learn. With others, children write symbolic programs with a GUI and download them into a toy, an approach that is conceptually extensible, but is inconsistent with the physicality of educational manipulatives. The challenge we address is to create a tangible interface that can retain the immediacy and emotional engagement of \"record and play\" and incorporate a mechanism for real time and direct modulation of behavior during program execution.We introduce the Backpacks, modular physical components that children can incorporate into robotic creations to modulate frequency, amplitude, phase and orientation of motion recordings. Using Backpacks, children can investigate basic kinematic principles that underly why their specific creations exhibit the specific behaviors they observe. We demonstrate that Backpacks make tangible some of the benefits of symbolic abstraction, and introduce sensors, feedback and behavior modulation to the record and play paradigm. Through our review of user studies with children ages 6-15, we argue that Backpacks extend the conceptual limits of record and play with an interface that is consistent with both the physicality of educational manipulatives and the local-global systems dynamics that are characteristic of complex robots.",
  "tags": [
    "toy",
    "digital manipulative",
    "children",
    "learning",
    "tangible interface",
    "modular robotics",
    "education",
    "programming by demonstration"
  ],
  "authors": [
    {
      "name": "Hayes Raffle",
      "institution": "MIT Media Lab, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100381813",
      "orcid": "missing"
    },
    {
      "name": "Amanda Parkes",
      "institution": "MIT Media Lab, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100008987",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "MIT Media Lab, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    },
    {
      "name": "Joshua Lifton",
      "institution": "MIT Media Lab, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100593837",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ackermann, E. Enactive Representations in Learning: Pretense, Models, and Machines, in Bliss, J., Light, P. and Saljo, R. eds. Learning Sites: Social and technological Contexts for learning, Elsevier, 1999, 144--154.",
      "doi": ""
    },
    {
      "text": "Ackermann, E. Perspective-taking and object construction: two keys to learning, in Kafai, Y. and Resnick, M. eds. Constructionism in practice: designing, thinking, and learning in a digital world, Lawrence Erlbaum, Mahwah, NJ, 1996, 25--35.",
      "doi": ""
    },
    {
      "text": "Ananny, M., Supporting Children's Collaborative Authoring: Practicing Written Literacy While Composing Oral Texts, in Proceedings of Computer Support for Collaborative Learning, (Boulder, Colorado, USA, 2002), Lawrence Erlbaum Associates, 595--596. ",
      "doi": "10.5555/1658616.1658739"
    },
    {
      "text": "Ananny, M. Telling Tales: A new way to encourage written literacy through oral language. PhD Thesis, Media Lab, MIT: available http://web.media.mit.edu/~ananny/thesis.html {28th February, 2003}, 2001, 165.",
      "doi": ""
    },
    {
      "text": "Chi, M. Why is self explaining an effective domain general learning activity? in Glaser, R. ed. Advances in Instructional Psychology, Lawrence Erlbaum Associates, 1997.",
      "doi": ""
    },
    {
      "text": "Cole, M., and Cole, S. The Development of Children, Fourth Edition. New York, NY : Worth Publishers, 2001.",
      "doi": ""
    },
    {
      "text": "Dataflow programming languages. http://en.wikipedia.org/wiki/Dataflow_language",
      "doi": ""
    },
    {
      "text": "Frei, P. curlybot: Designing a New Class of Computational Toys. Master's Thesis, Massachusetts Institute of Technology. 2000.",
      "doi": ""
    },
    {
      "text": "Full, R.J., Autumn, K., Chung, J.I., Ahn, A., Rapid negotiation of rough terrain by the death-head cockroach. American Zoologist. 38:81A. 1998.",
      "doi": ""
    },
    {
      "text": "Ijspeert, A., Hallam, J. and Willshaw, D. From lampreys to salamanders: evolving neural controllers for swimming and walking. In Fifth International Conference on Simulation of Adaptive Behavior, pages 390--399, 1998. ",
      "doi": "10.5555/299955.300010"
    },
    {
      "text": "Ishii, H. and Ullmer, B. Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms. Proceedings of CHI 1997, ACM Press, (1997), 234--241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Kamimura, A., Kurokawa, H., Yoshida, E., Tomita, K., Kokaji, S, and Murata, S. Distributed Adaptive Locomotion by a Modular Robotic System, M-TRAN II. Proceedings of IEEE/RSJ International conference on Intelligent Robots and Systems. 2004. 2370--2377.",
      "doi": ""
    },
    {
      "text": "Marshall, P.,Price, S., and Rogers, Y. Conceptualising tangibles to support learning. Proceedings of Interaction Design and Children, Preston, England, July 1-3, pages 101--110. 2003.  ",
      "doi": "10.1145/953536.953551"
    },
    {
      "text": "MAX/msp. http://en.wikipedia.org/wiki/Max",
      "doi": ""
    },
    {
      "text": "Mellar, H. and Bliss, J. Introduction: modelling and education, in Mellar, H., Bliss, J., Boohan, R., Ogborn, J. and Tompsett, C. eds. Learning with artificial worlds: computer-based modelling in the curriculum, The Falmer Press, London, 1994, 1--7.",
      "doi": ""
    },
    {
      "text": "Papert, S. Mindstorms: Children Computers and Powerful Ideas. Cambridge, Massachusetts: Perseus Publishing, 1980. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "Piaget, Jean. The Grasp of Consciousness. Cambridge: Harvard University Press, 1976.",
      "doi": ""
    },
    {
      "text": "Raffle, H. Parkes, A. Ishii, H. Topobo: A Constructive Assembly System with Kinetic Memory. Proceedings of CHI 04. ACM Press, (2004), 869--877.  ",
      "doi": "10.1145/985692.985774"
    },
    {
      "text": "Rao, S. Mechanical Vibrations, Fourth Edition. Upper Saddle River, N.J. : Pearson/Prentice Hall, 2004.",
      "doi": ""
    },
    {
      "text": "Resnick, Martin, Berg, et al. Digital Manipulatives: New Toys to Think With. Paper Session, Proceedings of CHI 1998, ACM Press, (1998) 281--287.  ",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Resnick, M. Decentralized Modeling and Decentralized Thinking. Modeling and Simulation in Precollege Science and Mathematics, edited by W. Feurzeig and N. Roberts. Springer: New York (1999), 114--137.",
      "doi": ""
    },
    {
      "text": "Ryokai, K., Marti, S., Ishii, H. IO Brush: Drawing with Everyday Objects as Ink, in Proceedings of CHI 04.  ",
      "doi": "10.1145/985692.985731"
    },
    {
      "text": "Sims, K. Evolving Virtual Creatures. Proceedings of SIGGRAPH 94 pp.15--22.  ",
      "doi": "10.1145/192161.192167"
    },
    {
      "text": "Sodaplay. http://www.sodaplay.com",
      "doi": ""
    },
    {
      "text": "Wyeth, P. and Purchase, H. Tangible Programming Elements for Young Children. Proceedings of CHI 2002, ACM Press, (2002) 774--775.  ",
      "doi": "10.1145/506443.506591"
    },
    {
      "text": "Yim, Duff, Roufas. PolyBot: a Modular Reconfigurable Robot, IEEE Intl. Conference on Robotics and Automation, (2000) San Francisco, CA.",
      "doi": ""
    },
    {
      "text": "Zhang, Y.; Yim, M. H.; Eldershaw, C.; Duff, D. G.; Roufas, K. D. Phase automata: a programming model of locomotion gaits for scalable chain-type modular robots. IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2003); 2003 October 27 - 31; Las Vegas, NV. Piscataway NJ: IEEE; 2003; 2442--2447.",
      "doi": ""
    },
    {
      "text": "Zuckerman O., Arida, S., and Resnick M. (2005). Extending Tangible Interfaces for Education: Digital Montessori-inspired Manipulatives. Proceedings of CHI 2005.  ",
      "doi": "10.1145/1054972.1055093"
    }
  ]
}