{
  "doi": "10.1145/1124772.1124869",
  "title": "Olfoto: designing a smell-based interaction",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "653-662",
  "year": 2006,
  "badges": [],
  "abstract": "We present a study into the use of smell for searching digi-tal photo collections. Many people now have large photo libraries on their computers and effective search tools are needed. Smell has a strong link to memory and emotion so may be a good way to cue recall when searching. Our study compared text and smell based tagging. For the first stage we generated a set of smell and tag names from user de-scriptions of photos, participants then used these to tag pho-tos, returning two weeks later to answer questions on their photos. Results showed that participants could tag effec-tively with text labels, as this is a common and familiar task. Performance with smells was lower but participants performed significantly above chance, with some partici-pants using smells well. This suggests that smell has poten-tial. Results also showed that some smells were consistently identified and useful, but some were not and highlighted issues with smell delivery devices. We also discuss some practical issues of using smell for interaction.",
  "tags": [
    "tagging",
    "searching",
    "olfaction",
    "smell",
    "digital photographs"
  ],
  "authors": [
    {
      "name": "Stephen Brewster",
      "institution": "University of Glasgow",
      "img": "/do/10.1145/contrib-81100359199/rel-imgonly/img_5764.jpg",
      "acmid": "81100359199",
      "orcid": "0000-0001-9720-3899"
    },
    {
      "name": "David McGookin",
      "institution": "University of Glasgow",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100295790",
      "orcid": "missing"
    },
    {
      "name": "Christopher Miller",
      "institution": "University of Glasgow",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311480984",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aggleton, J.P. and Waskett, L. The ability of odours to serve as state-dependent cues for real-world memories: Can Viking smells aid the recall of Viking experience? British Journal of Psychology, 90 (1999), 1--7.",
      "doi": ""
    },
    {
      "text": "Arroyo, E., Selker, T. and Stouffs, A., Interruptions as multimodal outputs: which are the less disruptive? In Proceedings of IEEE International Conference on Multimodal Interfaces (ICMI'02), IEEE Press (2002), 479--482.  ",
      "doi": "10.1109/ICMI.2002.1167043"
    },
    {
      "text": "Bedersen, B., PhotoMesa: a zoomable image browser using quantum treemaps and bubblemaps. In Proceed-ings of ACM UIST 2001, (Orlando, FL, USA), ACM Press (2001), 71--80.  ",
      "doi": "10.1145/502348.502359"
    },
    {
      "text": "Bodnar, A., Corbett, R. and Nekrasovski, D., AROMA: ambient awareness through olfaction in a messaging application. In Proceedings of ACM Inter-national Conference on Multimodal Interfaces (ICMI'04), (State College, PA, USA), ACM Press (2004), 183--190.  ",
      "doi": "10.1145/1027933.1027965"
    },
    {
      "text": "Cain, W.S. What we remember about odors. Perfumer and Flavorist, 9 (1984), 17--21.",
      "doi": ""
    },
    {
      "text": "Cann, A. and Ross, D. Olfactory stimuli as context cues in human memory. American Journal of Psychol-ogy, 102 (1) (1989), 91--102.",
      "doi": ""
    },
    {
      "text": "Engen, T. and Pfaffman, C. Absolute judgements of odor intensity. Journal of Experimental Psychology, 58 (1) (1959), 23--26.",
      "doi": ""
    },
    {
      "text": "Kaye, J. Aromatic Output for HCI. Interactions, 11 (1) (2004), 49--61.  ",
      "doi": "10.1145/962342.964333"
    },
    {
      "text": "Kaye, J. Symbolic Olfactory Display. MIT, Media, Arts and Science, School of Architecture and Planning, Masters Thesis, 2001.",
      "doi": ""
    },
    {
      "text": "Michael, G.A., Jacquot, L., Millot, J.-L. and Brand, G. Ambient odors modulate visual attentional capture. Neuroscience Letters (352) (2003), 221--225.",
      "doi": ""
    },
    {
      "text": "Rodden, K. and Wood, K.R., How Do People Manage Their Digital Photographs? In Proceedings of ACM CHI 2003, (Fort Lauderdale, FL, USA), ACM Press Addison Wesley (2003), 409--416.  ",
      "doi": "10.1145/642611.642682"
    },
    {
      "text": "Shneiderman, B. and Kang, H., Direct annotation: A drag-and-drop strategy for labelling photos. In Pro-ceedings of IEEE Information Visualisation 2000, IEEE Press (2000), 88--95. ",
      "doi": "10.5555/518910.850488"
    },
    {
      "text": "Strong, R. and Gaver, B., Feather,Scent and Shaker: Supporting Simple Intimacy. In Proceedings of CSCW '96, (Boston, MA, USA), ACM Press (1996), 29--30.",
      "doi": ""
    },
    {
      "text": "Tominaga, K., Honda, S., Ohsawa, T., Shigeno, H., Okada, K. and Matsushita, Y., \"\"Friend Park\"\"-expression of the wind and the scent on virtual space. In Proceedings of Virtual Systems and Multimedia '01, IEEE (2001), 507--515. ",
      "doi": "10.5555/882502.884818"
    },
    {
      "text": "Washburn, D. and Jones, L.M. Could olfactory dis-plays improve data visualization? Computing in Sci-ence & Engineering, 6 (6) (2004), 80--83.  ",
      "doi": "10.1109/MCSE.2004.66"
    },
    {
      "text": "Yanagida, Y., Noma, H., Tetsutani, N. and Tomono, A., An Unencumbering, Localized Olfactory Display. In Proceedings of ACM CHI 2003, (Fort Lauderdale, FL, USA), ACM Press (2003), 988--989.  ",
      "doi": "10.1145/765891.766109"
    }
  ]
}