{
  "doi": "10.1145/1124772.1124778",
  "title": "Time based patterns in mobile-internet surfing",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "31-34",
  "year": 2006,
  "badges": [],
  "abstract": "In this paper we investigate environmental factors that can result in users having different preferences and behaviors at different times of the day. An analysis is carried out of a large sample of user data for Wireless Application Protocol (WAP) browsing to determine whether user surfing patterns vary depending on time. We examine traffic on an hourly and daily basis, and show that accesses to particular categories of pages vary relative to time. We also build Markov models, which are temporal; to predict user navigation, and illustrate those predictive models are more accurate and beneficial to mobile Internet users than traditional methods. This analysis provides insight into improving the effectiveness and efficiency of navigation prediction.",
  "tags": [
    "WAP",
    "user modeling",
    "mobile",
    "log file analysis",
    "navigation prediction",
    "WWW"
  ],
  "authors": [
    {
      "name": "Martin Halvey",
      "institution": "University College Dublin",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81310486119",
      "orcid": "missing"
    },
    {
      "name": "Mark T. Keane",
      "institution": "University College Dublin",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408598290",
      "orcid": "missing"
    },
    {
      "name": "Barry Smyth",
      "institution": "University College Dublin",
      "img": "/do/10.1145/contrib-81100297638/rel-imgonly/barry.jpg",
      "acmid": "81100297638",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J. Begole, J.C. Tang and B. Hill. Rhythm Modeling, Visualizations and Applications. In Proceedings of the Symposium on User Interface Software and Technology. Pages 11--20, 2003.  ",
      "doi": "10.1145/964696.964698"
    },
    {
      "text": "S.M. Beitzel, E.C. Jensen, A. Chowdhury, D. Grossman, and O. Frieder. Hourly analysis of a very large topically categorized web query log. In Proceedings of the 27th Annual ACM Conference on Research and Development in Information Retrieval. Pages 321 -- 328, 2004.  ",
      "doi": "10.1145/1008992.1009048"
    },
    {
      "text": "M. Halvey, M.T. Keane and B. Smyth. Mobile Web Surfing is the same as Web Surfing. Communications of the ACM, March 2006. (Accepted; In Press).  ",
      "doi": "10.1145/1118178.1118179"
    },
    {
      "text": "M. Halvey, M.T. Keane and B. Smyth. Predicting navigation patterns on the mobile-internet using time of the week. In WWW Special Interest Track and Posters. Pages 958--959, 2005.  ",
      "doi": "10.1145/1062745.1062817"
    },
    {
      "text": "E. Horvitz, P. Koch, C.M. Kadie, and A. Jacobs. Coordinate: Probabilistic Forecasting of Presence and Availability. In Proceedings of the Eighteenth Conference on Uncertainty and Artificial Intelligence. Pages 224--233, 2002, Edmonton, Alberta. ",
      "doi": "10.5555/2073876.2073903"
    },
    {
      "text": "T. Lau and E. Horvitz. Patterns of Search: Analyzing and Modeling Web Query Refinement. In proceedings of the Seventh International Conference on User Modeling. 1999. ",
      "doi": "10.5555/317328.317340"
    },
    {
      "text": "P. Pirolli. Distributions of Surfers' Paths through the World Wide Web: Empirical Characterizations. The Web Journal, 2 (1998): 29--45.  ",
      "doi": "10.1023/A%3A1019288403823"
    },
    {
      "text": "M. Ramsay and J. Nielsen. Nielsen Report, \"\"WAP Usability Deja Vu: 1994 All Over Again\"\".",
      "doi": ""
    }
  ]
}