{
  "doi": "10.1145/1124772.1124794",
  "title": "Co-authoring with structured annotations",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "131-140",
  "year": 2006,
  "badges": [],
  "abstract": "Most co-authoring tools support basic annotations, such as edits and comments that are anchored at specific locations in the document. However, they do not support meta-commentary about a document (such as an author's summary of modifications) which gets separated from the document, often in the body of email messages. This causes unnecessary overhead in the write-review-edit workflow inherent in co-authoring. We present document-embedded structured annotations called \"bundles\" that incorporate the meta-commentary into a unified annotation model that meets a set of annotation requirements we identified through a small field investigation. A usability study with 20 subjects evaluated the annotation reviewing stage of co-authoring and showed that annotation bundles in our high-fidelity prototype reduced reviewing time and increased accuracy, compared to a system that only supports edits and comments.",
  "authors": [
    {
      "name": "Qixing Zheng",
      "institution": "University of British Columbia, Vancouver, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484293",
      "orcid": "missing"
    },
    {
      "name": "Kellogg Booth",
      "institution": "University of British Columbia, Vancouver, Canada",
      "img": "/do/10.1145/contrib-81100170154/rel-imgonly/kelly2014.jpg",
      "acmid": "81100170154",
      "orcid": "missing"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "University of British Columbia, Vancouver, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baecker, R. M., Nastos, D., Posner, I. R., and Mawby, K. L. The user-centered iterative design of collaborative writing software. In Proc. CHI 1993, ACM Press, (1993), 399--405.  ",
      "doi": "10.1145/169059.169312"
    },
    {
      "text": "Brush, A. J. B. Annotating Digital Documents for Asynchronous Collaboration, Ph.D. dissertation, (2002). University of Washington. ",
      "doi": "10.5555/936639"
    },
    {
      "text": "Brush, A. J. B., David, B., Anoop, G., & Cadiz, J. J. Robust annotation positioning in digital documents. In Proc. CHI 2001, ACM Press, (2001), 285--292.  ",
      "doi": "10.1145/365024.365117"
    },
    {
      "text": "Cadiz, J. J., Anop, G., & Jonathan, G. Using Web annotations for asynchronous collaboration around documents. In Proc. CSCW 2000, ACM Press, (2000), 309--318.  ",
      "doi": "10.1145/358916.359002"
    },
    {
      "text": "Catlin, T., Bush, P., & Yankelovich, N. InterNote: extending a hypermedia framework to support annotative collaboration. Proc. Hypertext 1989, ACM Press, (1989), 365--378.  ",
      "doi": "10.1145/74224.74252"
    },
    {
      "text": "Churchill, E. F., Trevor, J., Bly, S., Nelson, L., & Cubranic, D. Anchored conversations: chatting in the context of a document. In Proc. CHI 2000, ACM Press (2000), 454--461.  ",
      "doi": "10.1145/332040.332475"
    },
    {
      "text": "Cohen, J. Eta-squared and partial eta-squared in communication science. Human Communication Research, 28, Oxford Journals, (1973), 473--490.",
      "doi": ""
    },
    {
      "text": "Fish, R. S., Kraut, R. E., & Leland, M. D. P. Quilt: a collaborative tool for cooperative writing, Conference Sponsored by ACM SIGOIS and IEEECS TC-OA on Office information systems. ACM Press, (1988), 30--37.  ",
      "doi": "10.1145/45410.45414"
    },
    {
      "text": "Kahan, J, & Koivunen, M.-R. Annotea: an open RDF infrastructure for shared Web annotations. Proc. 10th International Conf. on World Wide Web. (2001), 623--632.  ",
      "doi": "10.1145/371920.372166"
    },
    {
      "text": "Landauer, T. Chapter 9: Behavioral research methods in human-computer interaction. In M. G. Helander, T. K. Landauer and P.V. Pranhu (Eds), Handbook of Human-Computer Interaction (2nd ed., pp. 203--227). Amsterdam: Elsevier Science B.V (1997).",
      "doi": ""
    },
    {
      "text": "Marshall, C. C. Annotation: from paper books to the digital library, Proc. of the 2nd ACM International Conference on Digital libraries. ACM Press (1997), 131--140.  ",
      "doi": "10.1145/263690.263806"
    },
    {
      "text": "Marshall, C. C., & Brush, A. J. B. From personal to shared annotations. Ext. Abstracts CHI 2002, (2002), 812--813.  ",
      "doi": "10.1145/506443.506610"
    },
    {
      "text": "Neuwirth, C. M., Kaufer, D. S., Chandhok, R., & Morris, J. H. Issues in the design of computer support for co-authoring and commenting, Proc. CSCW 1990, (1990), 183--195.  ",
      "doi": "10.1145/99332.99354"
    },
    {
      "text": "Noël, S., & Robert, J.-M. Empirical study on collaborative writing: What do co-authors do, use, and like? Computer Supported Cooperative Work: The Journal of Collaborative Computing, (2003), 13(1), 63--89.  ",
      "doi": "10.1023/B%3ACOSU.0000014876.96003.be"
    },
    {
      "text": "Ovsiannikov, I. A., Arbib, M.A., & McNeill, T. H. Annotation technology, International Journal. of Human-Computer Study, (1999), 50(4), 329--262.  ",
      "doi": "10.1006/ijhc.1999.0247"
    },
    {
      "text": "Resnick, M. M. a. D. Third Voice: Vox Populi Vox Dei? http://firstmonday.org/issues/issue4_10/margolis/index.html.",
      "doi": ""
    },
    {
      "text": "ScienceDaily. http://www.sciencedaily.com/",
      "doi": ""
    },
    {
      "text": "Sharples, M., Goodlet, J.S., Beck, E.E., Wood, C.C., Easterbrook, S.M. and Plowman, L. Research issues in the study of computer supported collaborative writing. In M. Sharples (Ed.), Computer Supported Collaborative Writing (pp. 9--28): Springer-Verlag, (1993).",
      "doi": ""
    },
    {
      "text": "Weng, C., & Gennari, J. Asynchronous Collaborative Writing through Annotations, Notes. Proc. CSCW 2004, ACM Press, (2004), 564--573.  ",
      "doi": "10.1145/1031607.1031705"
    },
    {
      "text": "XMetal Reviewer. http://www.xmetal.com/en_us/products/xmetal_reviewer/index.x",
      "doi": ""
    }
  ]
}