{
  "doi": "10.1145/1124772.1124790",
  "title": "Girls, technology and privacy: \"is my mother listening?\"",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "107-110",
  "year": 2006,
  "badges": [],
  "abstract": "This paper describes a study undertaken to explore the ways in which older teenage girls use technology to construct and maintain a sense of private space while living at home with parents. The study used blogging as an experimental and integral part of the research, in order to facilitate ongoing communication between researcher and participant.",
  "tags": [
    "blogs",
    "privacy",
    "teenage girls",
    "phones",
    "mobility"
  ],
  "authors": [
    {
      "name": "Wendy March",
      "institution": "Intel Research",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311483392",
      "orcid": "missing"
    },
    {
      "name": "Constance Fleuriot",
      "institution": "Featherhouse",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100524289",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Green, N. (2002). Who's Watching Whom? Monitoring and Accountability in Mobile Relations. In B. Brown, N. Green & R. Harper (Eds.), Wireless World: Social and Interactional Aspects of the Mobile Age (pp. 32-45). London: Springer-Verlag. ",
      "doi": "10.5555/510801.510806"
    },
    {
      "text": "Grinter, R.E. and Eldridge, M., y do tngrs luv 2 txt msg? Proc. of Seventh European Conference on CSCW. (Bonn, Germany, Sept. 2001). ",
      "doi": "10.5555/1241867.1241879"
    },
    {
      "text": "Grinter, R.E. and Palen, L., Instant Messaging in Teen Life. Proc. of CSCW '02. (New Orleans, USA, Nov. 2002).  ",
      "doi": "10.1145/587078.587082"
    },
    {
      "text": "Ito, M. and Okabe, D. Intimate Connections: Contextualizing Japanese Youth and Mobile Messaging in Harper, R., Palen, L. and Taylor, A. Eds., Inside the Text: Social Perspectives on SMS in the Mobile Age (Forthcoming).",
      "doi": ""
    },
    {
      "text": "March, W. and Fleuriot, C. The Worst Technology for Girls. Proc. of EPIC '06 (Redmond, USA, Nov. 2005).",
      "doi": ""
    }
  ]
}