{
  "doi": "10.1145/1124772.1124774",
  "title": "Faster document navigation with space-filling thumbnails",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2006,
  "badges": [],
  "abstract": "Scrolling is the standard way to navigate through many types of digital documents. However, moving more than a few pages can be slow because all scrolling techniques constrain visual search to only a small document region. To improve document navigation, we developed Space-Filling Thumbnails (SFT), an overview display that eliminates most scrolling. SFT provides two views: a standard page view for reading, and a thumbnail view that shows all pages. We tested SFT in three experiments that involved finding pages in documents. The first study (n=13) compared seven current scrolling techniques, and showed that SFT is significantly faster than the other methods. The second and third studies (n=32 and n=14) were detailed comparisons of SFT with thumbnail-enhanced scrollbars (TES), which performed well in the first experiment. SFT was faster than TES across all document types and lengths, particularly when tasks involved revisitation. In addition, SFT was strongly preferred by participants.",
  "authors": [
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon SK, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Jason Alexander",
      "institution": "University of Canterbury, Christchurch, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019697",
      "orcid": "0000-0001-6093-6116"
    }
  ],
  "references": [
    {
      "text": "Bederson, B. (2001). PhotoMesa: A Zoomable Image Browser Using Quantum Treemaps and Bubblemaps. Proc. UIST01, 71--80.  ",
      "doi": "10.1145/502348.502359"
    },
    {
      "text": "Bederson, B. and Hollan, J. (1994). Pad++: A Zooming Graphical Interface for Exploring Alternate Interface Physics. Proc. UIST'94, 17--26.  ",
      "doi": "10.1145/192426.192435"
    },
    {
      "text": "de Bruijn, O. and Spence, R. (2000). Rapid Serial Visual Presentation: A Space-Time Trade-Off in Information Presentation. Proc. AVI2000, 189--192.  ",
      "doi": "10.1145/345513.345309"
    },
    {
      "text": "Byrd, D. (1999). A Scrollbar-based Visualization for Document Navigation. Proc. Digital Libr. '99, 122--129.  ",
      "doi": "10.1145/313238.313283"
    },
    {
      "text": "Byrne, M., John, B., Wehrle, N. and Crow, D. (1999). The Tangled Web We Wove: A Taskonomy of WWW Use. Proc. CHI'99, 544--551.  ",
      "doi": "10.1145/302979.303154"
    },
    {
      "text": "Card, S. Mackinlay, JD and Shneiderman, B. (1999). Readings in Info. Visualization. Morgan-Kaufmann.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. and Greenberg, S. (2000). Issues of Page Representation and Organisation in Web Browser's Revisitation Tools. Aus. J. of Info. Sys, 7 (2), 120--127.",
      "doi": ""
    },
    {
      "text": "Cockburn, A. and Savage, J. (2003). Comparing Speed- Dependent Automatic Zooming with Traditional Scroll, Pan and Zoom Methods. Proc. British HCI, 87--102.",
      "doi": ""
    },
    {
      "text": "Cockburn, A., Savage, J. and Wallace, A. (2005). Tuning and Testing Scrolling Interfaces that Automatically Zoom. Proc. CHI'05, 71--80.  ",
      "doi": "10.1145/1054972.1054983"
    },
    {
      "text": "Czerwinski, M., van Dantzich, M., Robertson, G. and Hoffman, H. (1999). The Contribution of Thumbnail Image, Mouse-Over Text and Spatial Location Memory to Web Page Retrieval in 3D. Proc.Interact'99, 163--170.",
      "doi": ""
    },
    {
      "text": "Egan, D. and Gomez, M. (1985). Assaying, Isolating, and Accommodating Individual Differences in Learning a Complex Skill. in Dillon, R. ed. Individual Differences in Cognition, 173--217.",
      "doi": ""
    },
    {
      "text": "Fitts, P. (1954). The Information Capacity of the Human Motor System in Controlling the Amplitude of Movement. J. Experimental Psychology, 47, 381--391.",
      "doi": ""
    },
    {
      "text": "Gagnon, D. (1985). Videogames and Spatial Skills: An Exploratory Study. Educational Communication and Technology, 33 (4), 263--275.",
      "doi": ""
    },
    {
      "text": "Hart, S. and Staveland, L. (1988). Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. in Hancock, P.M., ed. Human Mental Workload, 139--183.",
      "doi": ""
    },
    {
      "text": "Hill, W. and Hollan, J. (1992). Edit Wear and Read Wear. Proc. CHI'92, 3--9.  ",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Hinckley, K., Cutrell, E., Bathiche, S. and Muss, T. (2002). Quantitative Analysis of Scrolling Techniques. Proc. CHI'2002, 65--72.  ",
      "doi": "10.1145/503376.503389"
    },
    {
      "text": "Hornbaek, K. and Frokjaer, E. (2003). Reading Patterns and Usability in Visualizations of Electronic Documents. ACM Trans. CHI, 10 (2), 119--149.  ",
      "doi": "10.1145/772047.772050"
    },
    {
      "text": "Igarashi, T. and Hinckley, K. (2000). Speed-dependent Automatic Zooming for Browsing Large Documents. Proc. UIST'00, 139--148.  ",
      "doi": "10.1145/354401.354435"
    },
    {
      "text": "Jones, W. and Dumais, S. (1986). The Spatial Metaphor for User Interfaces: Experimental Tests of Reference by Location versus Name. ACM Trans. OIS, 4 (1), 42--63.  ",
      "doi": "10.1145/5401.5405"
    },
    {
      "text": "Klein, C. and Bederson, B. (2005). Benefits of Animated Scrolling. Ext. Abstracts CHI'05, 1965--1968.  ",
      "doi": "10.1145/1056808.1057068"
    },
    {
      "text": "Lam, H. and Baudisch, P. (2005). Summary Thumbnails: Readable Overviews for Small Screen Web Browsers. Proc. CHI'05, 681--690.  ",
      "doi": "10.1145/1054972.1055066"
    },
    {
      "text": "Mills, C. and Weldon, L. (1986). Reading text from computer screens. ACM Comp. Surveys, 19, 329--358.  ",
      "doi": "10.1145/45075.46162"
    },
    {
      "text": "Moyes, J. (1994). When Users Do and Don't Rely on Icon Shape. Ext. Abstrs. CHI'94, 283--284.  ",
      "doi": "10.1145/259963.260494"
    },
    {
      "text": "O'Hara, K. and Sellen, A. (1997). A comparison of reading paper and on-line documents. Proc. CHI'97, 335--342.  ",
      "doi": "10.1145/258549.258787"
    },
    {
      "text": "O'Hara, K., Sellen, A. and Bentley, R. (1999). Supporting Memory for Spatial Location While Reading from Small Displays. Ext. Abs. CHI'99, 220--221.  ",
      "doi": "10.1145/632716.632853"
    },
    {
      "text": "Robertson, G., Czerwinski, M., Larson, K., Robbins, D., Thiel, D. and van Dantzich, M. (1998). Data Mountain: Using Spatial Memory for Document Management. Proc. UIST'98. 153--162.  ",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Schwarz, E., Beldie, I. and Pastoor, S. (1983). A Comparison of Paging and Scrolling for Changing Screen Contents by Inexperienced Users. Human Factors, 25 (3), 279--282.",
      "doi": ""
    },
    {
      "text": "Spence, B., Witkowski, M., Fawcett, C., Craft, B. and de Bruijn, O. (2004). Image Presentation in Space and Time: Errors, Preferences and Eye-Gaze Activity. Proc. AVI'04, 141--149.  ",
      "doi": "10.1145/989863.989884"
    },
    {
      "text": "Suh, B., Woodruff, A., Rosenholtz, R. and Glass, A. (2002). Popout Prism: Adding Perceptual Principles to Overview+Detail Document Interfaces. Proc. CHI'02, 251--258.  ",
      "doi": "10.1145/503376.503422"
    },
    {
      "text": "Sun, L. and Guimbretiere, F. (2005). Flipper: a new method of digital document navigation. Ext. Abs CHI'05, 2001--2004.  ",
      "doi": "10.1145/1056808.1057077"
    },
    {
      "text": "Sutherland, I. (1963). Sketchpad: A Man-Machine Graphical Communication System. AFIPS Spring Joint Computer Conference, 329--346.",
      "doi": "10.1145/1461551.1461591"
    },
    {
      "text": "Teitelbaum, R. and Granda, R. (1983). The Effects of Positional Constancy on Searching Menus for Information. Proc. CHI'83, 150--153.  ",
      "doi": "10.1145/800045.801600"
    },
    {
      "text": "Vicente, K., Hayes, B. and Williges, R. (1987). Assaying and Isolating Individual Differences in Searching a Hierarchical File System. Human Factors, 29 (3), 349--359. ",
      "doi": "10.1177/001872088702900308"
    },
    {
      "text": "Woodruff, A., Faulring, A., Rosenholtz, R., Morrison, J. and Pirolli, P. (2001). Using Thumbnails to Search the Web. Proc. CHI'01, 198--205.  ",
      "doi": "10.1145/365024.365098"
    },
    {
      "text": "Zhai, S., Smith, B. and Selker, T. (1997). Improving Browsing Performance: A Study of Four Input Devices for Scrolling and Pointing Tasks. Proc. INTERACT'97, 286--292. ",
      "doi": "10.5555/647403.723823"
    }
  ]
}