{
  "doi": "10.1145/1124772.1124817",
  "title": "Perspective cursor: perspective-based interaction for multi-display environments",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "289-298",
  "year": 2006,
  "badges": [],
  "abstract": "Multi-display environments and smart meeting rooms are now becoming more common. These environments build a shared display space from variety of devices: tablets, projected surfaces, tabletops, and traditional monitors. Since the different display surfaces are usually not organized in a single plane, traditional schemes for stitching the displays together can cause problems for interaction. However, there is a more natural way to compose display space -- using perspective. In this paper, we develop interaction techniques for multi-display environments that are based on the user's perspective on the room. We designed the Perspective Cursor, a mapping of cursor to display space that appears natural and logical from wherever the user is located. We conducted an experiment to compare two perspective-based techniques, the Perspective Cursor and a beam-based technique, with traditional stitched displays. We found that both perspective techniques were significantly faster for targeting tasks than the traditional technique, and that Perspective Cursor was the most preferred method. Our results show that integrating perspective into the design of multi-display environments can substantially improve performance.",
  "authors": [
    {
      "name": "Miguel A. Nacenta",
      "institution": "University of Saskatchewan, Saskatoon, Canada",
      "img": "/do/10.1145/contrib-81100377766/rel-imgonly/dsc_7149-small.png",
      "acmid": "81100377766",
      "orcid": "missing"
    },
    {
      "name": "Samer Sallam",
      "institution": "University of Saskatchewan, Saskatoon, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484069",
      "orcid": "missing"
    },
    {
      "name": "Bernard Champoux",
      "institution": "University of Saskatchewan, Saskatoon, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100396839",
      "orcid": "missing"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "University of Saskatchewan, Saskatoon, Canada",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Saskatoon, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    }
  ],
  "references": [
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P. Bederson, B., and Zierlinger, A. Drag-and-Pop and Drag-and-Pick: Techniques for Accessing Remote Screen Content on Touch- and Pen-operated Systems. Proc. Interact 2003, 57--64.",
      "doi": ""
    },
    {
      "text": "Baudisch, P., Cutrell, E., Hinckley, K. and Gruen, R., Mouse Ether: Accelerating the Acquisition of Targets Across Multi-Monitor Displays. Proc ACM CHI 2004, 1379--1382.  ",
      "doi": "10.1145/985921.986069"
    },
    {
      "text": "Baudisch, P., and Rosenholtz, R. Halo: A Technique for Visualizing Off-Screen Locations. Proc. CHI 2003, 481--488.  ",
      "doi": "10.1145/642611.642695"
    },
    {
      "text": "Balakrishnan, R. \"\"Beating\"\" Fitts' Law: virtual enhancements for pointing facilitation. IJHCS, 61, 6, (2004), 857--874.  ",
      "doi": "10.1016/j.ijhcs.2004.09.002"
    },
    {
      "text": "Benko, H. and Feiner, S. Multi-monitor mouse. Proc. CHI 2005, 1208--1211.  ",
      "doi": "10.1145/1056808.1056878"
    },
    {
      "text": "Biehl, J.T. and Bailey, B.P. ARIS: An Interface for Application Relocation in an Interactive Space, Proc. Graphics Interface, (2004), 107--116. ",
      "doi": "10.5555/1006058.1006072"
    },
    {
      "text": "Bolt, R.A. \"Put-that-there\": Voice and gesture at the graphics interface. Proc. SIGGRAPH '80, 262--270.  ",
      "doi": "10.1145/800250.807503"
    },
    {
      "text": "Booth, K., Fisher, B., Lin, R., & Argue, R. The \"\"mighty mouse\"\" multi-screen collaboration tool. Proc. UIST 2002, 209--212.  ",
      "doi": "10.1145/571985.572016"
    },
    {
      "text": "Davis, J., and Chen, X. LumiPoint: Multi-user laser-based interaction on large tiled displays. Displays 2002, 23(5):205--211.",
      "doi": ""
    },
    {
      "text": "Deitz, P. and Leigh D. DiamondTouch: A Multi-User Touch Technology. Proc. UIST 2001, 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Fox, A., Johanson, B., Hanrahan, P., and Winograd, T. Integrating Information Appliances into an Interactive Workspace. IEEE CG&A 20, 3, (2000), 54--65.  ",
      "doi": "10.1109/38.844373"
    },
    {
      "text": "Furnas, G. W., Generalized Eye Views. Proc. CHI 1986 16--23.  ",
      "doi": "10.1145/22627.22342"
    },
    {
      "text": "Geiβler, J. Shuffle, throw or take it! Working Efficiently with an Interactive Wall. Proc. CHI 1998, 265--266.  ",
      "doi": "10.1145/286498.286745"
    },
    {
      "text": "Grossman, T., and Balakrishnan, R. The Bubble Cursor: Enhancing target acquisition by dynamic resizing of the cursor's activation area. Proc. CHI 2005, 281--290.  ",
      "doi": "10.1145/1054972.1055012"
    },
    {
      "text": "Hascoët, M. Throwing models for large displays. Proc. HCI 2003, 73--77.",
      "doi": ""
    },
    {
      "text": "Hinckley, K. Synchronous Gestures for Multiple Users and Computers. Proc. UIST 2003, 149--158.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Hinckley, K., Ramos, G., Guimbretiere, F., Baudisch, P., and Smith, M. Stitching: pen gestures that span multiple displays. Proc. ACM AVI 2004, 23--31.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Johanson, B., Hutchins, G., Winograd, T., Stone, M. PointRight: Experience with Flexible Input Redirection in Interactive Workspaces. Proc. UIST 2002, 227--234.  ",
      "doi": "10.1145/571985.572019"
    },
    {
      "text": "Kohtake, N., Ohsawa, R., Yonezawa, T., Matsukura,Y. Iway, M. Takashio, K., Tokuda, H. u-Texture: Self-Organizable Universal Panels for Creating Smart Surroundings. Proc. UbiComp 2005 , 19--36.  ",
      "doi": "10.1007/11551201_2"
    },
    {
      "text": "Myers, B.A., Peck, C.H., Nichols, J., Kong, D., and Miller, R. Interacting at a Distance Using Semantic Snarfing. Proc. UbiComp 2001, 305--314. ",
      "doi": "10.5555/647987.741332"
    },
    {
      "text": "Myers, B.A., R. Bhatnagar, J. Nichols, C. H. Peck, D. Kong, R. Miller, and A. C. Long. Interacting At a Distance: Measuring the Performance of Laser Pointers and Other Devices. Proc. CHI 2002, 33--40.  ",
      "doi": "10.1145/503376.503383"
    },
    {
      "text": "Nacenta, M., Aliakseyeu, D., Subramanian, S., and Gutwin, C. A Comparison of Techniques for Multi-Display Reaching. Proc. CHI 2005, 371--380.  ",
      "doi": "10.1145/1054972.1055024"
    },
    {
      "text": "Nacenta, M. Computer Vision approaches to solve the screen pose acquisition problem for Perspective Cursor. Tech. Rep. HCI-TR-06-01, Comp. Sci. Dept., U. of Saskatchewan, (2006).",
      "doi": ""
    },
    {
      "text": "Olsen Jr., D.R. and Nielsen, T. Laser Pointer Interaction. Proc. CHI 2001, 17--22.  ",
      "doi": "10.1145/365024.365030"
    },
    {
      "text": "Parker, J. K., Mandryk, R. L, Inkpen, K. M. TractorBeam: Seamless Integration of Local and Remote Pointing for Tabletop Displays. Proc. Graphics Interface (2005), 33--40. ",
      "doi": "10.5555/1089508.1089515"
    },
    {
      "text": "Rekimoto, J. Pick-and-Drop A Direct Manipulation Technique for Multiple Computer Environments. Proc. UIST 1997, 31--39.  ",
      "doi": "10.1145/263407.263505"
    },
    {
      "text": "Rekimoto, J. and Saitoh, M. Augmented surfaces: a spatially continuous work space for hybrid computing environments. Proc. CHI 1999, 378--385.  ",
      "doi": "10.1145/302979.303113"
    },
    {
      "text": "Rekimoto, J., Ayatsuka, Y., and Kohno, M. SyncTap: An interaction technique for mobile networking. Proc. Mobile HCI (2003), 104--115.",
      "doi": ""
    },
    {
      "text": "Robertson, G., Czerwinski, M., Baudisch, P., Meyers, B., Robbins, D., Smith, G., and Tan, D. The Large-Display User Experience. IEEE CG&A, 25, 4, (2005), 44--51.  ",
      "doi": "10.1109/MCG.2005.88"
    },
    {
      "text": "Román, M., Hess, C., Cerqueira, R., Ranganathan, A., Campbell, R. H., and Nahrstedt, K. A Middleware Infrastructure for Active Spaces. IEEE Pervasive Computing, 1, 4 (2002), 74--83.  ",
      "doi": "10.1109/MPRV.2002.1158281"
    },
    {
      "text": "Streitz, N.A., Geißler, J., Holmer, T., Konomi, S., Müller-Tomfelde, C., Reischl, W., Rexroth, P., Seitz, P., and Steinmetz, R. i-LAND: An interactive Landscape for Creativitiy and Innovation. Proc. CHI 1999, 120--127.  ",
      "doi": "10.1145/302979.303010"
    },
    {
      "text": "Swaminathan, K. and Sato, S. Interaction design for large displays. Interactions, 4, 1, January 1997, 15--24.  ",
      "doi": "10.1145/242388.242395"
    },
    {
      "text": "Wu, M. and Balakrishnan, R. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. Proc. UIST '2003, 193--202.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "Yee, K.P. Peephole Displays: Pen Interaction on Spatially Aware Handheld Computers. Proc. CHI 2003, 1--8.  ",
      "doi": "10.1145/642611.642613"
    },
    {
      "text": "Zhai, S., Morimoto, C., Ihde, S. Manual and Gaze Input Cascaded (MAGIC) Pointing. Proc. CHI 1999, 246--253.  ",
      "doi": "10.1145/302979.303053"
    }
  ]
}