{
  "doi": "10.1145/1124772.1124780",
  "title": "An examination of the effects of a wearable display on informal face-to-face communication",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "45-54",
  "year": 2006,
  "badges": [],
  "abstract": "Wearable computers have the potential to support our memory, facilitate our creativity, our communication and augment our physical senses [15] but, like email and cell-phones, they also have the potential to interrupt, displace or downgrade our social interactions. This paper presents the results of a simple laboratory-based study which examines the impact of a xybernaut head-mounted Shimadzu display on conversation between two people. We hypothesized that the wearable, by reducing eye-contact and attention in the wearer would have a detrimental effect. Pairs of friends discussed pre-defined topics under three conditions, no wearable, wearable present but inactive, wearable present and active. Likert scale statements were used to record the wearer's level of attention, concentration, listening, eye contact, naturalness and relaxation, and the impact of the wearable. The presence of the wearable without an active display did not have an effect on the conversation. The quality of the interaction was however impaired in the active wearable condition and eye-contact was effected. This effect may be the result of the nature of the information type, the interface used, the characteristics of its presentation or the novelty of the display to the user. Additional research to identify design implications is discussed.",
  "tags": [
    "eye-contact",
    "displays",
    "wearables",
    "social computing",
    "conversation",
    "attention",
    "wearer vs non-wearer",
    "information"
  ],
  "authors": [
    {
      "name": "Gerard McAtamney",
      "institution": "Yell Com, Glasgow, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311482456",
      "orcid": "missing"
    },
    {
      "name": "Caroline Parker",
      "institution": "Glasgow Caledonian University, Glasgow, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311486172",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyle, M. The Psychology of Interpersonal Behaviour, 5th Edition (London: Penguin). 1994.]]",
      "doi": ""
    },
    {
      "text": "Argyle, M., & Cook, M. Gaze and Mutual Gaze. New York: Cambridge University Press.). 1976.]]",
      "doi": ""
    },
    {
      "text": "Brody AB, Gottsman EJ Pocket BargainFinder: A handheld device for augmented commerce. Proc. of 1st Int. Symp. on Handheld and Ubiquitous Computing (HUC 99), SEP 27-29, p. 44--51 (1999).]] ",
      "doi": "10.5555/647985.743706"
    },
    {
      "text": "Cavanagh, C. Managing Your E-Mail : Thinking Outside the Inbox . John Wiley & Sons. 2002.]]",
      "doi": ""
    },
    {
      "text": "Chen Y, Au J, Kazlas P, Ritenour A, Gates H, McCreary M. Electronic paper: Flexible active-matrix electronic ink display. Nature. May 8;423(6936):136 (2003)]]",
      "doi": ""
    },
    {
      "text": "Cohen, S. De-stress for success. Training & Development 51 (11): 76& NOV (1997)]]",
      "doi": ""
    },
    {
      "text": "Davis, L. L. and Stallman, L. E. 'Wearable Computing SIG', Proc. CHI Human Factors in Computing Systems, April 20-25, 2002, Minneapolis, Minnesota, USA (2002)]]",
      "doi": ""
    },
    {
      "text": "DeVaul RW, Pentland A, Corey VR The memory glasses: Subliminal vs. overt memory support with imperfect information. 7th IEEE Int. Symp. Wearable Computers Ed. Azada D 146--153, (2003)]] ",
      "doi": "10.5555/946249.946907"
    },
    {
      "text": "Dryer, D. C., Eisbach, C. and Ark, W. S. At what cost pervasive? A social computing view of mobile computing systems, IBM Systems Journal, Vol. 38 (4), pp. 652--676. (1999)]]  ",
      "doi": "10.1147/sj.384.0652"
    },
    {
      "text": "Gizmodo http://www.gizmodo.com]]",
      "doi": ""
    },
    {
      "text": "Groner, R and Groner, M.T. Attention and eye movement control: An overview, European Archives of Psychiatry and Clinical Neuroscience (Historical Archive), Volume 239, Issue 1, Jan p. 9 (1989)]]",
      "doi": ""
    },
    {
      "text": "Hargie, O., Saunders, C. and Dickson, D. Social Skills in Interpersonal Communication, 3rd Edition (London and New York: Routledge). (1994).]]",
      "doi": ""
    },
    {
      "text": "Kasai I, Tanijiri Y, Endo T, Ueda H A forgettable near eye display. Proc. 4th Int. Symp. Wearable Computers, Digest of Papers : 115--118, (2000)]] ",
      "doi": "10.5555/851037.856527"
    },
    {
      "text": "Kortuem, G., Segall, Z., and Cowan Thompson, T.G. Close Encounters: Supporting Mobile Collaboration Through Interchange of User Profiles, Lecture Notes in Computer Science, Volume 1707, p. 171 (1999).]] ",
      "doi": "10.5555/647985.743876"
    },
    {
      "text": "Kortuem, G. Wearable Computing Systems to Support Face-to-Face Communication, Proc. 4th Int. Conf. Ubiquitous Computing, September 29-October 1, Goteborg, Sweden. (2002)]]",
      "doi": ""
    },
    {
      "text": "Kourogi, M and Kurata, T. A Wearable Augmented Reality System with Personal Positioning based on Walking Locomotion Analysis, Proc 2nd Int Symp Mixed and Augmented Reality (ISMAR03) in Tokyo, Japan, pp.260--261 (2003).]] ",
      "doi": "10.5555/946248.946814"
    },
    {
      "text": "Langham, M. Picking the right communication tool for the job Thursday 9th October 2003 http://www.it-analysis.com]]",
      "doi": ""
    },
    {
      "text": "Lisetti C, Nasoz F, LeRouge C, Ozyer O, Alvarez K Developing multimodal intelligent affective interfaces for tele-home health care Int. Journal of Human-Computer Studies 59 (1-2): 245--255 JUL (2003)]]  ",
      "doi": "10.1016/S1071-5819%2803%2900051-X"
    },
    {
      "text": "Machado, L. and Rafal, R. Control of eye movement reflexes, Experimental Brain Research, Volume 135, Issue 1, Oct, Pages 73 -- 80 (2000)]]",
      "doi": ""
    },
    {
      "text": "Mann, S. 'Wearable Computing: Towards Humanistic Intelligence', IEEE Intelligent Systems, May-June, 2001, pp.10--15 (2001)]]  ",
      "doi": "10.1109/5254.940020"
    },
    {
      "text": "Markus, M.L. Finding A Happy Medium - Explaining The Negative Effects Of Electronic Communication On Social-Life At Work ACM Transactions On Information Systems 12 (2): 119--149 Apr (1994)]]  ",
      "doi": "10.1145/196734.196738"
    },
    {
      "text": "Marti, S. How does the user interface design of mobile devices influence the social impact of mobile communication?, paper written for Qualifying Exam at the MIT Media Lab, February 18, (2002) web.media.mit.edu]]",
      "doi": ""
    },
    {
      "text": "Marti, S. and Schmandt, C. Physical Embodiments for Mobile Communications Agents. Proc. UIST. October 23-27. Seattle, Washington, USA. (2005)]]  ",
      "doi": "10.1145/1095034.1095073"
    },
    {
      "text": "Microvision www.microvision.com/]]",
      "doi": ""
    },
    {
      "text": "Mitsubishi http://global.mitsubishielectric.com]]",
      "doi": ""
    },
    {
      "text": "Randell, C., and Muller, H. The Shopping Jacket: Wearable Computing for the Consumer, Personal Technologies, Volume 4, Issue 4, Pages 241 -- 244, (2000).]]  ",
      "doi": "10.1007/s007790070012"
    },
    {
      "text": "Spitzer, M. B., Rensing, N. M., McClelland, R. and Aquilino. P. Eyeglass-Based Systems For Wearable Computing, 1st Int. Symp. Wearable Computers (ISWC '97), p. 48, (1997)]] ",
      "doi": "10.5555/851036.856449"
    },
    {
      "text": "Srivastava, L Mobile phones and the evolution of social behaviour. Behaviour and Information Technology, Volume 24, Number 2, March-April, pp. 111--129(19) Publisher: Taylor and Francis Ltd (2005)]]",
      "doi": ""
    },
    {
      "text": "Toney, A., Mulley, B. Thomas, B.H., Piekarski, W. Social weight: designing to minimise the social consequences arising from technology use by the mobile professional, Personal and Ubiquitous Computing, Volume 7, Issue 5, Pages 309 -- 320 (2003)]]  ",
      "doi": "10.1007/s00779-003-0245-8"
    },
    {
      "text": "Starner, T.E., Snoeck, C.M., Wong, B.A. and McGuire, R.M. Use of Mobile Appointment Scheduling Devices. Proc. CHI Human Factors in Computing Systems, April 24-29, 2004, Vienna, Austria, (2004)]]  ",
      "doi": "10.1145/985921.986100"
    },
    {
      "text": "Wootton, D. 'Ch 4: Rousseau, the Enlightenment, and the Age of Revolution' in D. Wootton, ed., Modern Political Thought: Readings from Machiavelli to Nietzsche (Indianapolis and Cambridge: Hackett Publishing Company, Inc.). 1996.]]",
      "doi": ""
    },
    {
      "text": "Xybernaut www.xybernaut.com/]]",
      "doi": ""
    }
  ]
}