{
  "doi": "10.1145/1124772.1124947",
  "title": "Listening to your inner voices: investigating means for voice notifications",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1173-1176",
  "year": 2006,
  "badges": [],
  "abstract": "Our research investigates notification qualities of different types of voices, moving toward interfaces that support optimal allocation of attention to maximize system utility. We conducted an experiment to determine the interruption, reaction, and comprehension values of three different voice categories: the user's voice, a familiar voice, and an unfamiliar voice. Initial testing showed significant and impactful results: unfamiliar voices are the least interruptive, and a user reacts most quickly to one's own voice. Motivated by these findings, we report on the development and deployment of a notification system that exploits the differences in familiarity of a voice.",
  "authors": [
    {
      "name": "Saurabh Bhatia",
      "institution": "Virginia Tech",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484129",
      "orcid": "missing"
    },
    {
      "name": "Scott McCrickard",
      "institution": "Virginia Tech",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100006181",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexanderson, P. Peripheral Awareness and Smooth Notification: the Use of Natural Sounds in Process Control Work. In Proc. NordiCHI 2004, 281--284.  ",
      "doi": "10.1145/1028014.1028057"
    },
    {
      "text": "Gaver, W. W., Smith, R, & O'Shea, T. Effective Sounds in Complex Systems: The ARKola Simulation. In Proc CHI 1991, 85--90.  ",
      "doi": "10.1145/108844.108857"
    },
    {
      "text": "Huang, E. M. & Mynatt, E. D. Semi-Public Displays for Small, Co-located Groups. In Proc. CHI 2003, 49--56.  ",
      "doi": "10.1145/642611.642622"
    },
    {
      "text": "Lee, K. M. & Nass, C. Designing Social Presence of Social Actors in Human Computer Interaction. In Proc. CHI 2003, 289--296.  ",
      "doi": "10.1145/642611.642662"
    },
    {
      "text": "McCrickard, D. S., Chewar, C. M., Somervell, J. P., & Ndiwalana, A. A Model for Notification Systems Evaluation-Assessing User Goals for Multitasking Activity. Transactions on CHI 10 (4), 2003.  ",
      "doi": "10.1145/966930.966933"
    },
    {
      "text": "Nass, C. & Gong, L. Speech Interfaces from an Evolutionary Perspective. Communications of the ACM 43 (9), 2000, 36--43.  ",
      "doi": "10.1145/348941.348976"
    },
    {
      "text": "Sawhney, N., & Schmandt, C. Nomadic Radio: Scaleable and Contextual Notification for Wearable Audio Messaging. In Proc.CHI 1999, 96--103.  ",
      "doi": "10.1145/302979.303005"
    }
  ]
}