{
  "doi": "10.1145/1124772.1124952",
  "title": "Cooperative gestures: multi-user gestural interactions for co-located groupware",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "1201-1210",
  "year": 2006,
  "badges": [],
  "abstract": "Multi-user, touch-sensing input devices create opportunities for the use of cooperative gestures -- multi-user gestural interactions for single display groupware. Cooperative gestures are interactions where the system interprets the gestures of more than one user as contributing to a single, combined command. Cooperative gestures can be used to enhance users' sense of teamwork, increase awareness of important system events, facilitate reachability and access control on large, shared displays, or add a unique touch to an entertainment-oriented activity. This paper discusses motivating scenarios for the use of cooperative gesturing and describes some initial experiences with CollabDraw, a system for collaborative art and photo manipulation. We identify design issues relevant to cooperative gesturing interfaces, and present a preliminary design framework. We conclude by identifying directions for future research on cooperative gesturing interaction techniques.",
  "tags": [
    "cooperative gestures",
    "gestures",
    "computer-supported cooperative work",
    "single display groupware"
  ],
  "authors": [
    {
      "name": "Meredith Ringel Morris",
      "institution": "Stanford University, Stanford, CA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Anqi Huang",
      "institution": "Harvard University, Cambridge, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311483905",
      "orcid": "missing"
    },
    {
      "name": "Andreas Paepcke",
      "institution": "Stanford University, Stanford, CA",
      "img": "/do/10.1145/contrib-81100130120/rel-imgonly/paepckeportraithomepage.jpg",
      "acmid": "81100130120",
      "orcid": "missing"
    },
    {
      "name": "Terry Winograd",
      "institution": "Stanford University, Stanford, CA",
      "img": "/do/10.1145/contrib-81100454567/rel-imgonly/81100454567.jpg",
      "acmid": "81100454567",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baudel, T. and Beaudoin-Lafon, M. Charade: Remote Control of Objects Using Free-Hand Gestures. Communications of the ACM. 36(7), 28--35.  ",
      "doi": "10.1145/159544.159562"
    },
    {
      "text": "Baudisch, P., Cutrell, E., Robbins, D., Czerwinski, M., Tandler, P., Bederson, B., and Zierlinger, A. Drag-and-Pop and Drag-and-Pick: Techniques for Accessing Remote Screen Content on Touch- and Pen-operated Systems. Interact 2003.",
      "doi": ""
    },
    {
      "text": "Bratman, M. 1999. Faces of Intention. Cambridge, MA: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Buxton, W. Chunking and Phrasing and the Design of Human-Computer Dialogues. IFIP Conference, 1986, 475--480.",
      "doi": ""
    },
    {
      "text": "Cappelletti, A., Gelmini, G., Pianesi, F., Rossi, F., and Zancanaro, M. Enforcing Cooperative Storytelling: First Studies. ICALT 2004. ",
      "doi": "10.5555/1018423.1019997"
    },
    {
      "text": "Dietz, P. and Leigh, D. DiamondTouch: A Multi-User Touch Technology. UIST 2001, 219--226.  ",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Everitt, K., Shen, C., Ryall, K., and Forlines, F. Modal Spaces: Spatial Multiplexing to Mediate Direct-Touch Input on Large Displays. CHI 2005 Extended Abstracts, 1359--1362.  ",
      "doi": "10.1145/1056808.1056916"
    },
    {
      "text": "GeiBler, J. Shuffle, throw, or take it! Working Efficiently with an Interactive Wall. CHI 1998 Extended Abstracts, 265--266.  ",
      "doi": "10.1145/286498.286745"
    },
    {
      "text": "Grossman, T., Wigdor, D., and Balakrishnan, R. Multi-Finger Gestural Interaction with 3D Volumetric Displays. UIST 2004.  ",
      "doi": "10.1145/1029632.1029644"
    },
    {
      "text": "Guimbretiere, F., Stone, M., and Winograd, T. Fluid Interaction with High-Resolution Wall-Size Displays. UIST 2001, 21--30.  ",
      "doi": "10.1145/502348.502353"
    },
    {
      "text": "Guiard, Y. Asymmetric division of labor in human skilled bimanual action: the kinematic chain as a model. Journal of Motor Behaviour. 19 (4), 1987, 486--517.",
      "doi": ""
    },
    {
      "text": "Hall, E.T. The Hidden Dimension. New York: Anchor Books, 1966.",
      "doi": ""
    },
    {
      "text": "Hinckley, K. Synchronous Gestures for Multiple Persons and Computers. UIST 2003, 149--158.  ",
      "doi": "10.1145/964696.964713"
    },
    {
      "text": "Hinckley, K., Ramos, G., Guimbretiere, F., Baudisch, P., and Smith, M. Stitching: Pen Gestures that Span Multiple Displays. AVI 2004, 23--31.  ",
      "doi": "10.1145/989863.989866"
    },
    {
      "text": "Holmquist, L., Mattern, F., Schiele, B., Alahuhta, P., Beigl, M., and Gellersen, H. Smart-Its Friends: A Technique for Users to Easily Establish Connections between Smart Artefacts. UbiComp 2001, 116--122. ",
      "doi": "10.5555/647987.741340"
    },
    {
      "text": "Joyce, W.B. On the Free-Rider Problem in Cooperative Learning. Journal of Educational Business. 74(5), 271--274, May-June 1999.",
      "doi": ""
    },
    {
      "text": "Krueger, M.W., Gionfriddo, T., and Hinrichsen, K. VIDEOPLACE - An Artificial Reality. CHI 1985, 35--40.  ",
      "doi": "10.1145/317456.317463"
    },
    {
      "text": "Malik, S., Ranjan, A., Balakrishnan, R. Interacting with Large Displays from a Distance with Vision-Tracked Multi-Finger Gestural Input. UIST 2005, 43--52.  ",
      "doi": "10.1145/1095034.1095042"
    },
    {
      "text": "Maynes-Aminzade, D., Pausch, R., and Seitz, S. Techniques for Interactive Audience Participation. ICMI 2002, 15 -- 20.  ",
      "doi": "10.1109/ICMI.2002.1166962"
    },
    {
      "text": "McCullagh, P. and Nelder, J.A. Generalized Linear Models. Chapman and Hall, 2nd edition, 1989.",
      "doi": ""
    },
    {
      "text": "Morris, M.R., Ryall, K., Shen, C., Forlines, C., and Vernier, F. Beyond \"\"Social Protocols\"\": Multi-User Coordination Polices for Co-located Groupware. CSCW 2004, 262--265.  ",
      "doi": "10.1145/1031607.1031648"
    },
    {
      "text": "Oka, K., Sato, Y., and Koike, H. Real-time tracking of multiple fingertips and gesture recognition for augmented desk interface systems. IEEE International Conference on Automatic Face and Gesture Recognition, 2002, 429--434. ",
      "doi": "10.5555/874061.875437"
    },
    {
      "text": "Piper, A.M., O'Brien, E., Morris, M.R., and Winograd, T. SIDES: A Collaborative Tabletop Computer Game for Social Skills Development. Stanford Univ. Technical Report, 2005.",
      "doi": ""
    },
    {
      "text": "Rekimoto, J. SmartSkin: An Infrastructure for Freehand Manipulation on Interactive Surfaces. CHI 2002, 113--120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Rekimoto, J. SyncTap: Synchronous User Operation for Spontaneous Network Connection. Personal and Ubiquitous Computing, 8(2), May 2004, 126--134.  ",
      "doi": "10.5555/992039.992047"
    },
    {
      "text": "Reynolds, M., Schoner, B., Richards, J., Dobson, K., and Gershenfeld, N. An Immersive, Multi-User, Musical Stage Environment. SIGGRAPH 2001, 553--560.  ",
      "doi": "10.1145/383259.383324"
    },
    {
      "text": "Ringel, M., Ryall, K., Shen, C., Forlines, C., and Vernier, F. Release, Relocate, Reorient, Resize: Fluid Techniques for Document Sharing on Multi-User Interactive Tables. CHI 2004 Extended Abstracts, 1441--1444.  ",
      "doi": "10.1145/985921.986085"
    },
    {
      "text": "Ringel, M., Berg, H., Jin, Y. and Winograd, T. Barehands: Implement-Free Interaction with a Wall-Mounted Display. CHI 2001 Extended Abstracts, 367--368.  ",
      "doi": "10.1145/634067.634284"
    },
    {
      "text": "Rogers, Y. and Lindley, S. Collaborating Around Large Interactive Displays: Which Way is Best to Meet? Interacting with Computers, 2004.",
      "doi": ""
    },
    {
      "text": "Ryall, K., Esenther, A., Everitt, K., Forlines, C., Morris, M.R., Shen, C., Shipman, S. and Vernier, F. iDwidgets: Parameterizing Widgets by User Identity. Interact 2005.  ",
      "doi": "10.1007/11555261_120"
    },
    {
      "text": "Searle, J.R. Collective intentions and actions. In P. R. Cohen, J. Morgan, and M. E. Pollack, editors, Intentions in Communication, chapter 19, pages 401--416. MIT Press, Camridge, MA, 1990.",
      "doi": ""
    },
    {
      "text": "Scott, S.D., Carpendale, M.S.T., and Inkpen, K. Territoriality in Collaborative Tabletop Workspaces. CSCW 2004, 294--303.  ",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Shen, C., Vernier, F., Forlines, C., and Ringel, M. DiamondSpin: An Extensible Toolkit for Around-the-Table Interaction. CHI 2004, 167--174.  ",
      "doi": "10.1145/985692.985714"
    },
    {
      "text": "Stewart, J., Bederson, B., and Druin, A. Single Display Groupware: A Model for Co-present Collaboration. CHI 1999.  ",
      "doi": "10.1145/302979.303064"
    },
    {
      "text": "Taxén, G., Hellström, S.-O., Tobiasson, H., Back, M., and Bowers, J. The Well of Inventions -- Learning, Interaction and Participatory Design in Museum Installations. ICHIM 2003.",
      "doi": ""
    },
    {
      "text": "Ulyate, R. and Bianciardi, D. The Interactive Dance Club: Avoiding Chaos in a Multi Participant Environment. CHI 2001 Workshop on New Interfaces for Musical Expression. ",
      "doi": "10.5555/1085152.1085170"
    },
    {
      "text": "Vogel, D. and Balakrishnan, R. Interactive Public Ambient Displays: Transitioning from Implicit to Explicit, Public to Personal, Interaction with Multiple Users. UIST 2004.  ",
      "doi": "10.1145/1029632.1029656"
    },
    {
      "text": "Wellner, P. Interacting with Paper on the DigitalDesk. Communications of the ACM, 36(7), 1993, 87--96.  ",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "Wolf, C. and Rhyne, J. Gesturing with Shared Drawing Tools. CHI 1993 Extended Abstracts, 137--138.  ",
      "doi": "10.1145/259964.260150"
    },
    {
      "text": "Wu, M. and Balakrishnan, R. Multi-Finger and Whole Hand Gestural Interaction Techniques for Multi-User Tabletop Displays. UIST 2003, 193--202.  ",
      "doi": "10.1145/964696.964718"
    },
    {
      "text": "Wu, M., Shen, C., Ryall, K., Forlines, C., and Balakrishnan, R. Gesture Registration, Relaxation, and Reuse for Multi-Point Direct-Touch Surfaces. IEEE Tabletop 2006, 183--190.  ",
      "doi": "10.1109/TABLETOP.2006.19"
    }
  ]
}