{
  "doi": "10.1145/1124772.1124885",
  "title": "Understanding photowork",
  "published": "2006-04-22",
  "proctitle": "CHI '06: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "761-770",
  "year": 2006,
  "badges": [],
  "abstract": "In this paper we introduce the notion of \"photowork\" as the activities people perform with their digital photos after cap-ture but prior to end use such as sharing. Surprisingly, these processes of reviewing, downloading, organizing, editing, sorting and filing have received little attention in the litera-ture yet they form the context for a large amount of the 'search' and 'browse' activities so commonly referred to in studies of digital photo software. Through a deeper under-standing of photowork using field observation and inter-views, we seek to highlight its significance as an interaction practice. At the same time, we discover how \"search\" as it is usually defined may have much less relevance than new ways of browsing for the design of new digital photo tools, in particular, browsing in support of the photowork activi-ties we describe.",
  "authors": [
    {
      "name": "David Kirk",
      "institution": "Mixed Reality Lab, University of Nottingham, Nottingham, UK",
      "img": "/do/10.1145/contrib-81100166914/rel-imgonly/dave-kirk-3.jpg",
      "acmid": "81100166914",
      "orcid": "0000-0003-2776-0643"
    },
    {
      "name": "Abigail Sellen",
      "institution": "Microsoft Research, Cambridge, UK",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    },
    {
      "name": "Carsten Rother",
      "institution": "Microsoft Research, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100467323",
      "orcid": "missing"
    },
    {
      "name": "Ken Wood",
      "institution": "Microsoft Research, Cambridge, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81344500170",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bederson, B. PhotoMesa: a zoomable image browser using quantum treemaps and bubblemaps. In Proc. UIST 2001, (2001), 71-- 80.]]  ",
      "doi": "10.1145/502348.502359"
    },
    {
      "text": "Cox, I.J., Miller, M.L., Minka, T.P., Papathornas, T.V., Yianilos, P.N. The Bayesian Image Retrieval System, PicHunter: Theory, Implementation, and Psychophysical Experiments. IEEE Tran. On Image Processing, 9, 1, (2000), 20--37.]]",
      "doi": ""
    },
    {
      "text": "Crabtree, A., Rodden, T. & Mariani, J. Collaborating Around Collections: Informing the Continued Develop-ment of Photoware. In Proc. of CSCW 2004. ACM Press (2004), 396--405.]]  ",
      "doi": "10.1145/1031607.1031673"
    },
    {
      "text": "Drucker, S., Wong, C., Roseway, A., Glenner, S., & De Mar, S. Photo-triage: Rapidly annotating your digital photographs Microsoft Research Technical Report, MSR-TR-2003-99, December 2003.]]",
      "doi": ""
    },
    {
      "text": "Frohlich, D. M. Audiophotography: Bringing photos to life with sounds. Springer (2004).]] ",
      "doi": "10.5555/1210132"
    },
    {
      "text": "Frohlich, D. M. Kuchinsky, C. Pering, A. Don, and S. Ariss. Requirements for Photoware. In Proc. CSCW 2002, (2002), 166--175.]]  ",
      "doi": "10.1145/587078.587102"
    },
    {
      "text": "Huynh, D. F., Drucker, S. M., Baudisch, P. and Wong, C. Time Quilt: Scaling up Zoomable Photo Browsers for Large, Unstructured Photo Collections. In Proc. CHI 2005, ACM Press (2005),1937--1940.]]  ",
      "doi": "10.1145/1056808.1057061"
    },
    {
      "text": "Jaimes, A., Chang, S. and Loui, A. C. Detection of Non-Identical Duplicate Consumer Photographs. Proc. ICICS -- PCM 2003 16--20.]]",
      "doi": ""
    },
    {
      "text": "Kang, H., Shneiderman, B., .Visualization Methods for Personal Photo Libraries: Browsing and Searching in the PhotoFinder. In Proceedings of IEEE International Conference on Multimedia and Expo (2000).]]",
      "doi": ""
    },
    {
      "text": "Markkula, M., and Sormunen, E. End-user searching challenges indexing practices in the digital newspaper photo archive. Information Retrieval, 1(4), (2000), 259--285.]]  ",
      "doi": "10.1023/A%3A1009995816485"
    },
    {
      "text": "Naaman, M., Harada, S., Wang, Q. Y., Garcia-Molina, H. & Paepcke, A. Context Data in Geo-Referenced Digital Photo Collections. In Proc. of Multi Media 2004. ACM Press (2004), 196--203.]]  ",
      "doi": "10.1145/1027527.1027573"
    },
    {
      "text": "Platt, J. C., M. Czerwinski, and B. A. Field. PhotoTOC: Automatic Clustering for Browsing Personal Photo-graphs. Technical Report MSR-TR-2002-17, Microsoft Research, 2002.]]",
      "doi": ""
    },
    {
      "text": "Ringel, M., Cutrell, E., Dumais, S., and Horvitz, E. Milestones in Time: The Value of Landmarks in Re-trieving Information from Personal Stores. In Proc. of Interact, (2003).]]",
      "doi": ""
    },
    {
      "text": "Rodden, K. and Wood, K. Does Organisation by Simi-larity Assist Image Browsing? In Proc. CHI 2002, ACM Press (2002), 190--197.]]  ",
      "doi": "10.1145/365024.365097"
    },
    {
      "text": "Rodden, K. and K. Wood. How Do People Manage Their Digital Photographs? In Proc. CHI 2003, ACM Press (2003), 409--416.]]  ",
      "doi": "10.1145/642611.642682"
    },
    {
      "text": "Shneiderman, B., and Kang. H. Direct annotation: A drag-and-drop strategy for labeling photos. In Proceed-ings of the International Conference on Information Visualisation, IEEE, (2000), 88--95.]] ",
      "doi": "10.5555/518910.850488"
    },
    {
      "text": "Vroegindeweij, S. My pictures: Informal image collec-tions. HP Labs Technical Report No. HPL-2002-72R1, (2002).]]",
      "doi": ""
    }
  ]
}