{
  "doi": "10.1145/3411764.3445483",
  "title": "Touchscreen Typing As Optimal Supervisory Control",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Traditionally, touchscreen typing has been studied in terms of motor performance. However, recent research has exposed a decisive role of visual attention being shared between the keyboard and the text area. Strategies for this are known to adapt to the task, design, and user. In this paper, we propose a unifying account of touchscreen typing, regarding it as optimal supervisory control. Under this theory, rules for controlling visuo-motor resources are learned via exploration in pursuit of maximal typing performance. The paper outlines the control problem and explains how visual and motor limitations affect it. We then present a model, implemented via reinforcement learning, that simulates co-ordination of eye and finger movements. Comparison with human data affirms that the model creates realistic finger- and eye-movement patterns and shows human-like adaptation. We demonstrate the model’s utility for interface development in evaluating touchscreen keyboard designs.",
  "authors": [
    {
      "name": "Jussi Jokinen",
      "institution": "Department of Communications and Networking Aalto University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658689597",
      "orcid": "missing"
    },
    {
      "name": "Aditya Acharya",
      "institution": "Aalto University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701349",
      "orcid": "missing"
    },
    {
      "name": "Mohammad Uzair",
      "institution": "National University of Sciences and Technology, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81342514256",
      "orcid": "missing"
    },
    {
      "name": "Xinhui Jiang",
      "institution": "Center for Human-Engaged Computing (CHEC) Kochi University of Technology, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526909",
      "orcid": "missing"
    },
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    }
  ],
  "references": [
    {
      "text": "Aditya Acharya, Andrew Howes, Chris Baber, and Tom Marshall. 2018. Automation reliability and decision strategy: A sequential decision making model for automation interaction. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 62. SAGE Publications, Los Angeles, CA, 144–148. https://doi.org/10.1177/1541931218621033",
      "doi": ""
    },
    {
      "text": "John R. Anderson, Daniel Bothell, Michael D. Byrne, Scott Douglass, Christian Lebiere, and Yulin Qin. 2004. An integrated theory of the mind. Psychological Review 111, 4 (2004), 1036–1060.",
      "doi": ""
    },
    {
      "text": "Ahmed Sabbir Arif, Sunjun Kim, Wolfgang Stuerzlinger, Geehyuk Lee, and Ali Mazalek. 2016. Evaluation of a smart-restorable backspace technique to facilitate text entry error correction. In CHI ’16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, CA). ACM, New York, NY, 5151–5162. https://doi.org/10.1145/2858036.2858407",
      "doi": "10.1145/2858036.2858407"
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2009. Analysis of text entry performance metrics. In 2009 IEEE Toronto International Conference Science and Technology for Humanity (TIC-STH). IEEE, New York, NY, 100–105. https://doi.org/10.1109/TIC-STH.2009.5444533",
      "doi": ""
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2010. Predicting the cost of error correction in character-based text entry technologies. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems – CHI 2010. ACM, New York, NY, 5–14.",
      "doi": "10.1145/1753326.1753329"
    },
    {
      "text": "Patrick Armstrong and Brett Wilkinson. 2016. Text Entry of Physical and Virtual Keyboards on Tablets and the User Perception. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (Launceston) (OzCHI ’16). ACM, New York, NY, 401–405. https://doi.org/10.1145/3010915.3011006",
      "doi": "10.1145/3010915.3011006"
    },
    {
      "text": "Shiri Azenkot and Shumin Zhai. 2012. Touch Behavior with Different Postures on Soft Smartphone Keyboards. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (San Francisco, CA) (MobileHCI ’12). ACM, New York, NY, 251–260. https://doi.org/10.1145/2371574.2371612",
      "doi": "10.1145/2371574.2371612"
    },
    {
      "text": "Nikola Banovic, Varun Rao, Abinaya Saravanan, Anind K. Dey, and Jennifer Mankoff. 2017. Quantifying aversion to costly typing errors in expert mobile text entry. In CHI ’17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 4229–4241. https://doi.org/10.1145/3025453.3025695",
      "doi": "10.1145/3025453.3025695"
    },
    {
      "text": "Nikola Banovic, Ticha Sethapakdi, Yasasvi Hari, Anind K. Dey, and Jennifer Mankoff. 2019. The limits of expert text entry speed on mobile keyboards with autocorrect. In Proceedings of the 21st International Conference on Human–Computer Interaction with Mobile Devices and Services. ACM, New York, NY, 12.",
      "doi": "10.1145/3338286.3340126"
    },
    {
      "text": "Xiaojun Bi, Yang Li, and Shumin Zhai. 2013. FFitts law: Modeling finger touch with Fitts’ law. In CHI ’13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris). ACM, New York, NY, 1363–1372. https://doi.org/10.1145/2470654.2466180",
      "doi": "10.1145/2470654.2466180"
    },
    {
      "text": "Matthew Michael Botvinick. 2012. Hierarchical reinforcement learning and decision making. Current Opinion in Neurobiology 22, 6 (2012), 956–962.",
      "doi": ""
    },
    {
      "text": "Daniel Buschek, Benjamin Bisinger, and Florian Alt. 2018. ResearchIME: A mobile keyboard application for studying free typing behaviour in the wild. In CHI ’18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 14.",
      "doi": "10.1145/3173574.3173829"
    },
    {
      "text": "Shi Cao, Anson Ho, and Jibo He. 2018. Modeling and predicting mobile phone touchscreen transcription typing using an integrated cognitive architecture. International Journal of Human–Computer Interaction 34, 6(2018), 544–556. https://doi.org/10.1080/10447318.2017.1373463",
      "doi": ""
    },
    {
      "text": "Kyle R. Cave and Narcisse P. Bichot. 1999. Visuospatial attention: Beyond a spotlight model. Psychonomic Bulletin & Review 6, 2 (1999), 204–223.",
      "doi": ""
    },
    {
      "text": "Noshaba Cheema, Laura A. Frey-Law, Kourosh Naderi, Jaakko Lehtinen, Philipp Slusallek, and Perttu Hämäläinen. 2020. Predicting mid-air interaction movements and fatigue using deep reinforcement learning. In CHI ’20: Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 13.",
      "doi": "10.1145/3313831.3376701"
    },
    {
      "text": "Xiuli Chen, Gilles Bailly, Duncan P. Brumby, Antti Oulasvirta, and Andrew Howes. 2015. The emergence of interactive behavior: A model of rational menu search. In CHI ’15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, 4217–4226.",
      "doi": "10.1145/2702123.2702483"
    },
    {
      "text": "Xiuli Chen, Sandra Dorothee Starke, Chris Baber, and Andrew Howes. 2017. A cognitive model of how people make decisions through interaction with visual displays. In CHI ’17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 1205–1216.",
      "doi": "10.1145/3025453.3025596"
    },
    {
      "text": "Jacob Cohen. 1992. A power primer.Psychological Bulletin 112, 1 (1992), 155–159.",
      "doi": ""
    },
    {
      "text": "Richard P. Cooper. 2010. Cognitive control: Componential or emergent?Topics in Cognitive Science 2, 4 (2010), 598–613.",
      "doi": ""
    },
    {
      "text": "Parisa Eslambolchilar and Roderick Murray-Smith. 2008. Control centric approach in designing scrolling and zooming user interfaces. International Journal of Human–Computer Studies 66, 12 (2008), 838–856.",
      "doi": "10.1016/j.ijhcs.2008.07.005"
    },
    {
      "text": "Anna Maria Feit, Daryl Weir, and Antti Oulasvirta. 2016. How We Type: Movement Strategies and Performance in Everyday Typing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, CA) (CHI ’16). ACM, New York, NY, 4262–4273. https://doi.org/10.1145/2858036.2858233",
      "doi": "10.1145/2858036.2858233"
    },
    {
      "text": "Paul M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6 (1954), 381–391. https://doi.org/10.1037/h0055392",
      "doi": ""
    },
    {
      "text": "Michael J. Frank and David Badre. 2011. Mechanisms of hierarchical reinforcement learning in corticostriatal circuits 1: Computational analysis. Cerebral Cortex 22, 3 (June 2011), 509–526. https://doi.org/10.1093/cercor/bhr114 arXiv:http://oup.prod.sis.lan/cercor/article-pdf/22/3/509/17305694/bhr114.pdf",
      "doi": ""
    },
    {
      "text": "Julien Gori, Olivier Rioul, and Yves Guiard. 2018. Speed–accuracy tradeoff: A formal information-theoretic transmission scheme (Fitts). ACM Transactions on Computer–Human Interaction (TOCHI) 25, 5(2018), 33.",
      "doi": ""
    },
    {
      "text": "Yves Guiard, Halla B. Olafsdottir, and Simon T. Perrault. 2011. Fitt’s law as an explicit time/error trade-off. In CHI ’11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC). ACM, New York, NY, 1619–1628. https://doi.org/10.1145/1978942.1979179",
      "doi": "10.1145/1978942.1979179"
    },
    {
      "text": "Yves Guiard and Olivier Rioul. 2015. A mathematical description of the speed/accuracy trade-off of aimed movement. In Proceedings of the 2015 British HCI Conference. ACM, New York, NY, 91–100.",
      "doi": "10.1145/2783446.2783574"
    },
    {
      "text": "Paul Holleis, Friederike Otto, Heinrich Hussmann, and Albrecht Schmidt. 2007. Keystroke-level model for advanced mobile phone interaction. In CHI ’07: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, CA). ACM, New York, NY, 1505–1514. https://doi.org/10.1145/1240624.1240851",
      "doi": "10.1145/1240624.1240851"
    },
    {
      "text": "D.C. Howell, M. Rogier, V. Yzerbyt, and Y. Bestgen. 1998. Statistical methods in human sciences. Wadsworth, New York, NY.",
      "doi": ""
    },
    {
      "text": "Andrew Howes. 2018. Interaction as an emergent property of a Partially Observable Markov Decision Process. In Computational Interaction. Oxford University Press, Oxford, UK, 287–310.",
      "doi": ""
    },
    {
      "text": "Andrew Howes, Richard L. Lewis, and Alonso Vera. 2009. Rational adaptation under task and processing constraints: Implications for testing theories of cognition and action. Psychological Review 116, 4 (2009), 717–751.",
      "doi": ""
    },
    {
      "text": "Xinhui Jiang, Yang Li, Jussi P.P. Jokinen, Viet Ba Hirvola, Antti Oulasvirta, and Xiangshi Ren. 2020. How We Type: Eye and Finger Movement Strategies in Mobile Typing. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI) (CHI ’20). ACM, New York, NY, 1–14. https://doi.org/10.1145/3313831.3376711",
      "doi": "10.1145/3313831.3376711"
    },
    {
      "text": "Jussi Jokinen. 2017. Touch screen text entry as cognitively bounded rationality. In Proceedings of the 39th Annual Cognitive Science Society Meeting. Cognitive Science Society, Seattle, WA, 624.",
      "doi": ""
    },
    {
      "text": "Jussi P.P. Jokinen, Tuomo Kujala, and Antti Oulasvirta. 2020. Multitasking in driving as optimal adaptation under uncertainty. Human Factors (2020), 18. https://doi.org/10.1177/0018720820927687",
      "doi": ""
    },
    {
      "text": "Jussi P.P. Jokinen, Sayan Sarcar, Antti Oulasvirta, Chaklam Silpasuwanchai, Zhenxin Wang, and Xiangshi Ren. 2017. Modelling learning of new keyboard layouts. In CHI ’17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, CO). ACM, New York, NY, 4203–4215. https://doi.org/10.1145/3025453.3025580",
      "doi": "10.1145/3025453.3025580"
    },
    {
      "text": "Jussi P.P. Jokinen, Zhenxin Wang, Sayan Sarcar, Antti Oulasvirta, and Xiangshi Ren. 2020. Adaptive feature guidance: Modelling visual search with graphical layouts. International Journal of Human–Computer Studies 136 (2020), 102376.",
      "doi": "10.1016/j.ijhcs.2019.102376"
    },
    {
      "text": "Leslie Pack Kaelbling, Michael L. Littman, and Anthony R. Cassandra. 1998. Planning and acting in partially observable stochastic domains. Artificial Intelligence 101, 1–2 (1998), 99–134.",
      "doi": "10.5555/1643275.1643301"
    },
    {
      "text": "Antti Kangasrääsiö, Jussi PP Jokinen, Antti Oulasvirta, Andrew Howes, and Samuel Kaski. 2019. Parameter inference for computational cognitive models with Approximate Bayesian Computation. Cognitive Science 43, 6 (2019), e12738.",
      "doi": ""
    },
    {
      "text": "Davis E. Kieras and Davis E. Meyer. 1997. An overview of the EPIC architecture for cognition and performance with application to human-computer interaction. Human–Computer Interaction 12, 4 (1997), 391–438.",
      "doi": ""
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2002. A model of two-thumb text entry. In Graphics Interface. Canadian Information Processing Society, Toronto, CA, 117–124.",
      "doi": ""
    },
    {
      "text": "Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Andrei A Rusu, Joel Veness, Marc G Bellemare, Alex Graves, Martin Riedmiller, Andreas K Fidjeland, Georg Ostrovski, 2015. Human-level control through deep reinforcement learning. Nature 518, 7540 (2015), 529–533.",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Antti Oulasvirta, and Roderick Murray-Smith. 2017. Control theoretic models of pointing. ACM Transactions on Computer–Human Interaction (TOCHI) 24, 4(2017), 36.",
      "doi": ""
    },
    {
      "text": "Hugo Nicolau and Joaquim Jorge. 2012. Touch typing using thumbs: Understanding the effect of mobility and hand posture. In CHI ’12: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 2683–2686.",
      "doi": "10.1145/2207676.2208661"
    },
    {
      "text": "Donald A Norman and Tim Shallice. 1980. Attention to Action: Willed and Automatic Control of Behavior. Technical Report No. 8006.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Sunjun Kim, and Byungjoo Lee. 2018. Neuromechanics of a button press. In CHI ’18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 13.",
      "doi": "10.1145/3173574.3174082"
    },
    {
      "text": "Antti Oulasvirta, Per Ola Kristensson, Bi Xiaojun, and Andrew Howes. 2018. Computational interaction. Oxford University Press, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Anna Reichel, Wenbin Li, Yan Zhang, Myroslav Bachynskyi, Keith Vertanen, and Per Ola Kristensson. 2013. Improving Two-thumb Text Entry on Touchscreen Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris) (CHI ’13). ACM, New York, NY, 2765–2774. https://doi.org/10.1145/2470654.2481383",
      "doi": "10.1145/2470654.2481383"
    },
    {
      "text": "Kseniia Palin, Anna Maria Feit, Sunjun Kim, Per Ola Kristensson, and Antti Oulasvirta. 2019. How do people type on mobile devices? Observations from a study with 37,000 volunteers. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, New York, NY, 12.",
      "doi": "10.1145/3338286.3340120"
    },
    {
      "text": "Kseniia Palin, Anna Maria Feit, Sunjun Kim, Per Ola Kristensson, and Antti Oulasvirta. 2019. How Do People Type on Mobile Devices? Observations from a Study with 37,000 Volunteers. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei) (MobileHCI ’19). ACM, New York, NY, Article 9, 12 pages. https://doi.org/10.1145/3338286.3340120",
      "doi": "10.1145/3338286.3340120"
    },
    {
      "text": "Philip Quinn and Shumin Zhai. 2016. A Cost-Benefit Study of Text Entry Suggestion Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, CA) (CHI ’16). ACM, New York, NY, 83–88. https://doi.org/10.1145/2858036.2858305",
      "doi": "10.1145/2858036.2858305"
    },
    {
      "text": "Keith Rayner. 2009. The 35th Sir Frederick Bartlett Lecture: Eye movements and attention in reading, scene perception, and visual search. Quarterly Journal of Experimental Psychology 62, 8(2009), 1457–1506.",
      "doi": ""
    },
    {
      "text": "Dario D Salvucci. 2001. An integrated model of eye movements and visual encoding. Cognitive Systems Research 1, 4 (2001), 201–220. https://doi.org/10.1016/S1389-0417(00)00015-2",
      "doi": "10.1016/S1389-0417%2800%2900015-2"
    },
    {
      "text": "Dario D Salvucci and Niels A Taatgen. 2008. Threaded Cognition: An integrated theory of concurrent multitasking.Psychological Review 115, 1 (2008), 101–130.",
      "doi": ""
    },
    {
      "text": "Sayan Sarcar, Jussi P.P. Jokinen, Antti Oulasvirta, Zhenxin Wang, Chaklam Silpasuwanchai, and Xiangshi Ren. 2016. Towards ability-based optimization for aging users. In Proceedings of the International Symposium on Interactive Technology and Ageing Populations. ACM, New York, NY, 77–86.",
      "doi": "10.1145/2996267.2996275"
    },
    {
      "text": "Sayan Sarcar, Jussi P.P. Jokinen, Antti Oulasvirta, Zhenxin Wang, Chaklam Silpasuwanchai, and Xiangshi Ren. 2018. Ability-based optimization of touchscreen interactions. IEEE Pervasive Computing 17, 1 (2018), 15–26.",
      "doi": "10.1109/mprv.2018.011591058"
    },
    {
      "text": "John Schulman, Filip Wolski, Prafulla Dhariwal, Alec Radford, and Oleg Klimov. 2017. Proximal policy optimization algorithms. arXiv preprint arXiv:1707.06347.",
      "doi": ""
    },
    {
      "text": "Miika Silfverberg, I. Scott MacKenzie, and Panu Korhonen. 2000. Predicting text entry speed on mobile phones. In CHI ’00: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 9–16.",
      "doi": "10.1145/332040.332044"
    },
    {
      "text": "Mason R Smith, Richard L Lewis, Andrew Howes, Alina Chu, Collin Green, and Alonso Vera. 2008. More than 8,192 ways to skin a cat: Modeling behavior in multidimensional strategy spaces. In Proceedings of the 30th annual conference of the Cognitive Science Society. Cognitive Science Society, Austin, TX, 1441–1446.",
      "doi": ""
    },
    {
      "text": "Richard S. Sutton and Andrew G. Barto. 1998. Reinforcement learning: An introduction. MIT Press, Cambridge, MA.",
      "doi": "10.5555/551283"
    },
    {
      "text": "Yuan-Chi Tseng and Andrew Howes. 2008. The adaptation of visual search strategy to expected information gain. In CHI ’08: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 1075–1084.",
      "doi": "10.1145/1357054.1357221"
    },
    {
      "text": "Paul D. Varcholik, Joseph J. Laviola Jr, and Charles E. Hughes. 2012. Establishing a baseline for text entry for a multi-touch virtual keyboard. International Journal of Human–Computer Studies 70, 10 (2012), 657–672.",
      "doi": "10.1016/j.ijhcs.2012.05.007"
    },
    {
      "text": "R. William Soukoreff and I. Scott Mackenzie. 1995. Theoretical upper and lower bounds on typing speed using a stylus and a soft keyboard. Behaviour & Information Technology 14, 6 (1995), 370–379. https://doi.org/10.1080/01449299508914656",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock. 2007. Measures of Text Entry Performance. In Text Entry Systems, I. Scott MacKenzie and Kumiko Tanaka-Ishii (Eds.). Morgan Kaufmann, Burlington, 47 – 74. https://doi.org/10.1016/B978-012373591-1/50003-6",
      "doi": ""
    },
    {
      "text": "Mingrui Ray Zhang, Shumin Zhai, and Jacob O. Wobbrock. 2019. Text entry throughput: Towards unifying speed and accuracy in a single performance metric. In CHI ’19: Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 13.",
      "doi": "10.1145/3290605.3300866"
    }
  ]
}