{
  "doi": "10.1145/3411764.3445292",
  "title": "Problem-Solving Efficiency and Cognitive Load for Adaptive Parsons Problems vs. Writing the Equivalent Code",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Novice programmers need differentiated assessments (such as adaptive Parsons problems) to maximize their ability to learn how to program. Parsons problems require learners to place mixed-up code blocks in the correct order to solve a problem. We conducted a within-subjects experiment to compare the efficiency and cognitive load of solving adaptive Parsons problems versus writing the equivalent (isomorphic) code. Undergraduates were usually more significantly efficient at solving a Parsons problem than writing the equivalent code, but not when the solution to the Parsons problem was unusual. This has implications for problem creators. This paper also reports on the mean cognitive load ratings of the two problem types and the relationship between efficiency and cognitive load ratings. Lastly, it reports on think-aloud observations of 11 students solving both adaptive Parsons problems and write-code problems and the results from an end-of-course student survey.",
  "authors": [
    {
      "name": "Carl C. Haynes",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658990084",
      "orcid": "missing"
    },
    {
      "name": "Barbara J. Ericson",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100073230",
      "orcid": "0000-0001-6881-8341"
    }
  ],
  "references": [
    {
      "text": "Beth Adelson. 1984. When novices surpass experts: The difficulty of a task may increase with expertise.Journal of Experimental Psychology: Learning, Memory, and Cognition 10, 3(1984), 483.",
      "doi": ""
    },
    {
      "text": "Shulamyt Ajami, Yonatan Woodbridge, and Dror G Feitelson. 2019. Syntax, predicates, idioms—what really affects code complexity?Empirical Software Engineering 24, 1 (2019), 287–328.",
      "doi": ""
    },
    {
      "text": "Klara Benda, Amy Bruckman, and Mark Guzdial. 2012. When Life and Learning Do Not Fit: Challenges of Workload and Communication in Introductory Computer Science Online. Trans. Comput. Educ. 12, 4, Article 15 (Nov. 2012), 38 pages. https://doi.org/10.1145/2382564.2382567",
      "doi": "10.1145/2382564.2382567"
    },
    {
      "text": "Jens Bennedsen and Michael Caspersen. 2007. Failure rates in introductory programming. ACM SIGCSE Bulletin 39, 2 (2007), 32–36.",
      "doi": "10.1145/1272848.1272879"
    },
    {
      "text": "Jens Bennedsen and Michael E Caspersen. 2019. Failure rates in introductory programming: 12 years later. ACM Inroads 10, 2 (2019), 30–36.",
      "doi": "10.1145/3324888"
    },
    {
      "text": "Laura E. Berk and Adam Winsler. 1995. Scaffolding Children’s Learning: Vygotsky and Early Childhood Education. National Association for the Education of Young Children.",
      "doi": ""
    },
    {
      "text": "Maura Borrego, Kevin A Nguyen, Caroline Crockett, Matt DeMonbrun, Prateek Shekhar, Sneha Tharayil, Cynthia J Finelli, Robyn S Rosenberg, and Cynthia Waters. 2018. Systematic Literature Review of Students’ Affective Responses to Active Learning: Overview of Results. In 2018 IEEE Frontiers in Education Conference (FIE). IEEE, 1–7.",
      "doi": ""
    },
    {
      "text": "Gavin TL Brown. 2011. Self-regulation of assessment beliefs and attitudes: a review of the Students’ Conceptions of Assessment inventory. Educational Psychology 31, 6 (2011), 731–748.",
      "doi": ""
    },
    {
      "text": "Gavin TL Brown and Gerrit HF Hirschfeld. 2008. Students’ conceptions of assessment: Links to outcomes. Assessment in Education: Principles, Policy & Practice 15, 1(2008), 3–17.",
      "doi": ""
    },
    {
      "text": "Shi-Yi Chen, Zhe Feng, and Xiaolian Yi. 2017. A general introduction to adjustment for multiple comparisons. Journal of thoracic disease 9, 6 (2017), 1725.",
      "doi": ""
    },
    {
      "text": "Nick Cheng and Brian Harrington. 2017. The Code Mangler: Evaluating Coding Ability Without Writing any Code. In Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education. 123–128.",
      "doi": "10.1145/3017680.3017704"
    },
    {
      "text": "Michelene TH Chi. 2009. Active-constructive-interactive: A conceptual framework for differentiating learning activities. Topics in cognitive science 1, 1 (2009), 73–105.",
      "doi": ""
    },
    {
      "text": "Robert Coe. 2002. It’s the effect size, stupid: What effect size is and why it is important. (2002).",
      "doi": ""
    },
    {
      "text": "Gemma Corbalan, Liesbeth Kester, and Jeroen JG Van Merriënboer. 2008. Selecting learning tasks: Effects of adaptation and shared control on learning efficiency and task involvement. Contemporary Educational Psychology 33, 4 (2008), 733–756.",
      "doi": ""
    },
    {
      "text": "Paul Denny, Andrew Luxton-Reilly, and Beth Simon. 2008. Evaluating a new exam question: Parsons problems. In Proceedings of the fourth international workshop on computing education research. 113–124.",
      "doi": "10.1145/1404520.1404532"
    },
    {
      "text": "Yuemeng Du, Andrew Luxton-Reilly, and Paul Denny. 2020. A Review of Research on Parsons Problems. In Proceedings of the Twenty-Second Australasian Computing Education Conference. 195–202.",
      "doi": "10.1145/3373165.3373187"
    },
    {
      "text": "Benedict Du Boulay. 1986. Some difficulties of learning to program. Journal of Educational Computing Research 2, 1 (1986), 57–73.",
      "doi": ""
    },
    {
      "text": "Carol S Dweck. 2000. Self-theories: Their role in motivation, personality, and development. Psychology press.",
      "doi": ""
    },
    {
      "text": "Barbara Ericson, Austin McCall, and Kathryn Cunningham. 2019. Investigating the Affect and Effect of Adaptive Parsons Problems. In Proceedings of the 19th Koli Calling International Conference on Computing Education Research. 1–10.",
      "doi": "10.1145/3364510.3364524"
    },
    {
      "text": "Barbara J Ericson, James D Foley, and Jochen Rick. 2018. Evaluating the efficiency and effectiveness of adaptive parsons problems. In Proceedings of the 2018 ACM Conference on International Computing Education Research. 60–68.",
      "doi": "10.1145/3230977.3231000"
    },
    {
      "text": "Barbara J Ericson, Mark J Guzdial, and Briana B Morrison. 2015. Analysis of interactive features designed to enhance learning in an ebook. In Proceedings of the eleventh annual International Conference on International Computing Education Research. 169–178.",
      "doi": "10.1145/2787622.2787731"
    },
    {
      "text": "Barbara J Ericson, Lauren E Margulieux, and Jochen Rick. 2017. Solving parsons problems versus fixing and writing code. In Proceedings of the 17th Koli Calling International Conference on Computing Education Research. 20–29.",
      "doi": "10.1145/3141880.3141895"
    },
    {
      "text": "Barbara J Ericson and Bradley N Miller. 2020. Runestone: A Platform for Free, On-line, and Interactive Ebooks. In Proceedings of the 51st ACM Technical Symposium on Computer Science Education. 1012–1018.",
      "doi": "10.1145/3328778.3366950"
    },
    {
      "text": "K Anders Ericsson 2006. The influence of experience and deliberate practice on the development of superior expert performance. The Cambridge handbook of expertise and expert performance 38 (2006), 685–705.",
      "doi": ""
    },
    {
      "text": "Tessa HS Eysink, Ton de Jong, Kirsten Berthold, Bas Kolloffel, Maria Opfermann, and Pieter Wouters. 2009. Learner performance in multimedia learning arrangements: An analysis across instructional approaches. (2009).",
      "doi": ""
    },
    {
      "text": "Scott Freeman, Sarah L Eddy, Miles McDonough, Michelle K Smith, Nnadozie Okoroafor, Hannah Jordt, and Mary Pat Wenderoth. 2014. Active learning increases student performance in science, engineering, and mathematics. Proceedings of the National Academy of Sciences 111, 23(2014), 8410–8415.",
      "doi": ""
    },
    {
      "text": "Edith Galy, Magali Cariou, and Claudine Mélan. 2012. What is the relationship between mental workload factors and cognitive load types?International Journal of Psychophysiology 83, 3 (2012), 269–275.",
      "doi": ""
    },
    {
      "text": "Michael S Gazzaniga, Richard B Ivry, and George R Mangun. 2019. Cognitive science: The biology of the mind.",
      "doi": ""
    },
    {
      "text": "Kyle J Harms. 2015. The impact of distractors in programming completion puzzles on novice programmers position statement. In 2015 IEEE Blocks and Beyond Workshop (Blocks and Beyond). IEEE, 9–10.",
      "doi": "10.1109/BLOCKS.2015.7368990"
    },
    {
      "text": "Kyle James Harms, Jason Chen, and Caitlin L Kelleher. 2016. Distractors in Parsons problems decrease learning efficiency for young novice programmers. In Proceedings of the 2016 ACM Conference on International Computing Education Research. 241–250.",
      "doi": "10.1145/2960310.2960314"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Mark Gerard Haug. 2019. Measure of association.",
      "doi": ""
    },
    {
      "text": "Juha Helminen, Petri Ihantola, Ville Karavirta, and Satu Alaoutinen. 2013. How do students solve parsons programming problems?–execution-based vs. line-based feedback. In 2013 Learning and Teaching in Computing and Engineering. IEEE, 55–61.",
      "doi": ""
    },
    {
      "text": "Juha Helminen, Petri Ihantola, Ville Karavirta, and Lauri Malmi. 2012. How do students solve parsons programming problems? an analysis of interaction traces. In Proceedings of the ninth annual international conference on International computing education research. 119–126.",
      "doi": "10.1145/2361276.2361300"
    },
    {
      "text": "Bobby Hoffman and Gregory Schraw. 2010. Conceptions of efficiency: Applications in learning and problem solving. Educational Psychologist 45, 1 (2010), 1–14.",
      "doi": ""
    },
    {
      "text": "Henry Hsu and Peter A Lachenbruch. 2005. Paired t test. Encyclopedia of Biostatistics 6 (2005).",
      "doi": ""
    },
    {
      "text": "Petri Ihantola and Ville Karavirta. 2011. Two-dimensional parson’s puzzles: The concept, tools, and first observations. Journal of Information Technology Education 10, 2 (2011), 119–132.",
      "doi": ""
    },
    {
      "text": "Maya Israel, Gakyung Jeong, Meg Ray, and Todd Lash. 2020. Teaching Elementary Computer Science through Universal Design for Learning. In Proceedings of the 51st ACM Technical Symposium on Computer Science Education. 1220–1226.",
      "doi": "10.1145/3328778.3366823"
    },
    {
      "text": "David A Joyner, Lily Bernstein, Maria-Isabelle Dittamo, Ben Engelman, Alysha Naran, Amber Ott, Jasmine Suh, and Abby Thien. 2020. Attitudinal Trajectories in an Online CS1 Class: Demographic and Performance Trends. In Proceedings of the 2020 ACM Conference on Innovation and Technology in Computer Science Education. 335–341.",
      "doi": "10.1145/3341525.3387429"
    },
    {
      "text": "Ville Karavirta, Juha Helminen, and Petri Ihantola. 2012. A mobile learning application for parsons problems with automatic feedback. In Proceedings of the 12th Koli Calling International Conference on Computing Education Research. 11–18.",
      "doi": "10.1145/2401796.2401798"
    },
    {
      "text": "Sandra Katz, David Allbritton, John Aronis, Christine Wilson, and Mary Lou Soffa. 2006. Gender, achievement, and persistence in an undergraduate computer science program. ACM SIGMIS Database: the DATABASE for Advances in Information Systems 37, 4(2006), 42–57.",
      "doi": "10.1145/1185335.1185344"
    },
    {
      "text": "Gideon Keren. 2014. Between-or within-subjects design: A methodological dilemma. A Handbook for Data Analysis in the Behaviorial Sciences 1 (2014), 257–272.",
      "doi": ""
    },
    {
      "text": "Paivi Kinnunen and Beth Simon. 2010. Experiencing programming assignments in CS1: the emotional toll. In Proceedings of the Sixth international workshop on Computing education research. 77–86.",
      "doi": "10.1145/1839594.1839609"
    },
    {
      "text": "Päivi Kinnunen and Beth Simon. 2011. CS majors’ self-efficacy perceptions in CS1: results in light of social cognitive theory. In Proceedings of the seventh international workshop on Computing education research. 19–26.",
      "doi": "10.1145/2016911.2016917"
    },
    {
      "text": "Melina Klepsch, Florian Schmitz, and Tina Seufert. 2017. Development and validation of two instruments measuring intrinsic, extraneous, and germane cognitive load. Frontiers in psychology 8 (2017), 1997.",
      "doi": ""
    },
    {
      "text": "Melina Klepsch and Tina Seufert. 2020. Understanding instructional design effects by differentiated measurement of intrinsic, extraneous, and germane cognitive load. Instructional Science 48, 1 (2020), 45–77.",
      "doi": ""
    },
    {
      "text": "Varsha Koushik. 2020. Making block-based programming accessible to people with cognitive disabilities. ACM SIGACCESS Accessibility and Computing126 (2020), 1–1.",
      "doi": ""
    },
    {
      "text": "Amruth N Kumar. 2018. Epplets: A tool for solving parsons puzzles. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education. 527–532.",
      "doi": "10.1145/3159450.3159576"
    },
    {
      "text": "Naveen Kumar and Jyoti Kumar. 2016. Measurement of cognitive load in HCI systems using EEG power spectrum: an experimental study. Procedia Computer Science 84 (2016), 70–78.",
      "doi": ""
    },
    {
      "text": "Essi Lahtinen, Kirsti Ala-Mutka, and Hannu-Matti Järvinen. 2005. A study of the difficulties of novice programmers. Acm sigcse bulletin 37, 3 (2005), 14–18.",
      "doi": ""
    },
    {
      "text": "Daniël Lakens. 2013. Calculating and reporting effect sizes to facilitate cumulative science: a practical primer for t-tests and ANOVAs. Frontiers in psychology 4 (2013), 863.",
      "doi": ""
    },
    {
      "text": "Mark R Lepper and Maria Woolverton. 2002. The wisdom of practice: Lessons learned from the study of highly effective tutors. In Improving academic achievement. Elsevier, 135–158.",
      "doi": ""
    },
    {
      "text": "Jimmie Leppink, Fred Paas, Cees PM Van der Vleuten, Tamara Van Gog, and Jeroen JG Van Merriënboer. 2013. Development of an instrument for measuring different types of cognitive load. Behavior research methods 45, 4 (2013), 1058–1072.",
      "doi": ""
    },
    {
      "text": "Jimmie Leppink, Fred Paas, Tamara Van Gog, Cees PM van Der Vleuten, and Jeroen JG Van Merrienboer. 2014. Effects of pairs of problems and examples on task performance and different types of cognitive load. Learning and Instruction 30 (2014), 32–42.",
      "doi": ""
    },
    {
      "text": "Jimmie Leppink and Jeroen JG van Merriënboer. 2015. The beast of aggregating cognitive load measures in technology-based learning. Journal of Educational Technology & Society 18, 4 (2015), 230–245.",
      "doi": ""
    },
    {
      "text": "Alex Lishinski, Aman Yadav, Jon Good, and Richard Enbody. 2016. Learning to program: Gender differences and interactive effects of students’ motivation, goals, and self-efficacy on performance. In Proceedings of the 2016 ACM Conference on International Computing Education Research. 211–220.",
      "doi": "10.1145/2960310.2960329"
    },
    {
      "text": "Andrew Luxton-Reilly, Ibrahim Albluwi, Brett A Becker, Michail Giannakos, Amruth N Kumar, Linda Ott, James Paterson, Michael James Scott, Judy Sheard, and Claudia Szabo. 2018. Introductory programming: a systematic literature review. In Proceedings Companion of the 23rd Annual ACM Conference on Innovation and Technology in Computer Science Education. 55–106.",
      "doi": "10.1145/3293881.3295779"
    },
    {
      "text": "Lauren E Margulieux, Briana B Morrison, and Adrienne Decker. 2020. Reducing withdrawal and failure rates in introductory programming with subgoal labeled worked examples. International Journal of STEM Education 7 (2020), 1–16.",
      "doi": ""
    },
    {
      "text": "Richard E Mayer and Roxana Ed Moreno. 2010. Techniques that reduce extraneous cognitive load and manage intrinsic cognitive load during multimedia learning.(2010).",
      "doi": ""
    },
    {
      "text": "Naga Venkata Kartheek Medathati, Ruta Desai, and James Hillis. 2020. Towards inferring cognitive state changes from pupil size variations in real world conditions. In ACM Symposium on Eye Tracking Research and Applications. 1–10.",
      "doi": "10.1145/3379155.3391319"
    },
    {
      "text": "Lauren R Milne and Richard E Ladner. 2018. Blocks4All: overcoming accessibility barriers to blocks programming for children with visual impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/3173574.3173643"
    },
    {
      "text": "Briana B Morrison, Brian Dorn, and Mark Guzdial. 2014. Measuring cognitive load in introductory CS: adaptation of an instrument. In Proceedings of the tenth annual conference on International computing education research. 131–138.",
      "doi": "10.1145/2632320.2632348"
    },
    {
      "text": "Briana B Morrison, Lauren E Margulieux, Barbara Ericson, and Mark Guzdial. 2016. Subgoals help students solve Parsons problems. In Proceedings of the 47th ACM Technical Symposium on Computing Science Education. 42–47.",
      "doi": "10.1145/2839509.2844617"
    },
    {
      "text": "Briana B Morrison, Lauren E Margulieux, and Mark Guzdial. 2015. Subgoals, context, and worked examples in learning computing problem solving. In Proceedings of the eleventh annual international conference on international computing education research. 21–29.",
      "doi": "10.1145/2787622.2787733"
    },
    {
      "text": "Nadim Nachar 2008. The Mann-Whitney U: A test for assessing whether two independent samples come from the same distribution. Tutorials in quantitative Methods for Psychology 4, 1 (2008), 13–20.",
      "doi": ""
    },
    {
      "text": "D Navarro. 2015. lsr: Companion to “Learning Statistics with R”. R Package Version 5(2015).",
      "doi": ""
    },
    {
      "text": "Richard S Newman. 2008. The motivational role of adaptive help seeking in self-regulated learning. Motivation and self-regulated learning: Theory, research, and applications (2008), 315–337.",
      "doi": ""
    },
    {
      "text": "Unaizah Obaidellah, Mohammed Al Haek, and Peter C-H Cheng. 2018. A survey on the usage of eye-tracking in computer programming. ACM Computing Surveys (CSUR) 51, 1 (2018), 1–58.",
      "doi": "10.1145/3145904"
    },
    {
      "text": "Fred Paas, Tamara Van Gog, and John Sweller. 2010. Cognitive load theory: New conceptualizations, specifications, and integrated research perspectives. Educational psychology review 22, 2 (2010), 115–121.",
      "doi": ""
    },
    {
      "text": "Fred G Paas. 1992. Training strategies for attaining transfer of problem-solving skill in statistics: A cognitive-load approach.Journal of educational psychology 84, 4 (1992), 429.",
      "doi": ""
    },
    {
      "text": "Miranda C Parker, Mark Guzdial, and Shelly Engleman. 2016. Replication, validation, and use of a language independent CS1 knowledge assessment. In Proceedings of the 2016 ACM conference on international computing education research. 93–101.",
      "doi": "10.1145/2960310.2960316"
    },
    {
      "text": "Nick Parlante. 2021. CodingBat. https://codingbat.com/python",
      "doi": ""
    },
    {
      "text": "Dale Parsons and Patricia Haden. 2006. Parson’s programming puzzles: a fun and effective learning tool for first programming courses. In Proceedings of the 8th Australasian Conference on Computing Education-Volume 52. 157–163.",
      "doi": ""
    },
    {
      "text": "Thomas W Price, Zhongxiu Liu, Veronica Cateté, and Tiffany Barnes. 2017. Factors influencing students’ help-seeking behavior while programming with human and computer tutors. In Proceedings of the 2017 ACM Conference on International Computing Education Research. 127–135.",
      "doi": "10.1145/3105726.3106179"
    },
    {
      "text": "Kelly Rivers and Kenneth R Koedinger. 2017. Data-driven hint generation in vast solution spaces: a self-improving python programming tutor. International Journal of Artificial Intelligence in Education 27, 1(2017), 37–64.",
      "doi": ""
    },
    {
      "text": "Anthony V Robins. 2019. Novice programmers and introductory programming. The Cambridge Handbook of Computing Education Research, Cambridge Handbooks in Psychology (2019), 327–376.",
      "doi": ""
    },
    {
      "text": "Anthony V Robins, Lauren Margulieux, and Briana B Morrison. 2019. Cognitive sciences for computing education. (2019).",
      "doi": ""
    },
    {
      "text": "Barbara Rogoff. 1990. Apprenticeship in thinking: Cognitive development in social context.Oxford university press.",
      "doi": ""
    },
    {
      "text": "John Ruscio. 2008. A probability-based measure of effect size: Robustness to base rates and other factors.Psychological methods 13, 1 (2008), 19.",
      "doi": ""
    },
    {
      "text": "Dale H Schunk. 2012. Learning theories an educational perspective sixth edition. Pearson.",
      "doi": ""
    },
    {
      "text": "David Williamson Shaffer and Mitchel Resnick. 1999. ” Thick” Authenticity: New Media and Authentic Learning. Journal of interactive learning research 10, 2 (1999), 195–216.",
      "doi": "10.5555/325370.325387"
    },
    {
      "text": "Elliot Soloway, Mark Guzdial, and Kenneth E Hay. 1994. Learner-centered design: The challenge for HCI in the 21st century. interactions 1, 2 (1994), 36–48.",
      "doi": "10.1145/174809.174813"
    },
    {
      "text": "Constantine Stephanidis, Gavriel Salvendy, Margherita Antona, Jessie YC Chen, Jianming Dong, Vincent G Duffy, Xiaowen Fang, Cali Fidopiastis, Gino Fragomeni, Limin Paul Fu, 2019. Seven HCI grand challenges. International Journal of Human–Computer Interaction 35, 14(2019), 1229–1269.",
      "doi": ""
    },
    {
      "text": "Pearl Subban. 2006. Differentiated instruction: A research basis.International education journal 7, 7 (2006), 935–947.",
      "doi": ""
    },
    {
      "text": "Janine Swaak and Ton De Jong. 2001. Learner vs. system control in using online support for simulation-based discovery learning. Learning Environments Research 4, 3 (2001), 217–241.",
      "doi": ""
    },
    {
      "text": "John Sweller. 2010. Element interactivity and intrinsic, extraneous, and germane cognitive load. Educational psychology review 22, 2 (2010), 123–138.",
      "doi": ""
    },
    {
      "text": "John Sweller. 2017. The role of independent measures of load in cognitive load theory. Cognitive load measurement and application: A theoretical framework for meaningful research and practice. New York, NY: Routledge (2017).",
      "doi": ""
    },
    {
      "text": "John Sweller, Paul L Ayres, Slava Kalyuga, and Paul Chandler. 2003. The expertise reversal effect. (2003).",
      "doi": ""
    },
    {
      "text": "John Sweller and Graham A Cooper. 1985. The use of worked examples as a substitute for problem solving in learning algebra. Cognition and instruction 2, 1 (1985), 59–89.",
      "doi": ""
    },
    {
      "text": "John Sweller, Jeroen JG van Merriënboer, and Fred Paas. 2019. Cognitive architecture and instructional design: 20 years later. Educational Psychology Review(2019), 1–32.",
      "doi": ""
    },
    {
      "text": "Adam Szulewski, Andreas Gegenfurtner, Daniel W Howes, Marco LA Sivilotti, and Jeroen JG van Merriënboer. 2017. Measuring physician cognitive load: validity evidence for a physiologic and a psychometric tool. Advances in Health Sciences Education 22, 4 (2017), 951–968.",
      "doi": ""
    },
    {
      "text": "John Gregory Trafton and Brian J Reiser. 1994. The contributions of studying examples and solving problems to skill acquisition. Ph.D. Dissertation. Citeseer.",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merrienboer and Hein PM Krammer. 1987. Instructional strategies and tactics for the design of introductory computer programming courses in high school. Instructional Science 16, 3 (1987), 251–285.",
      "doi": ""
    },
    {
      "text": "Jeroen JG Van Merrienboer and John Sweller. 2005. Cognitive load theory and complex learning: Recent developments and future directions. Educational psychology review 17, 2 (2005), 147–177.",
      "doi": ""
    },
    {
      "text": "MW Van Someren, YF Barnard, and JAC Sandberg. 1994. The think aloud method: a practical approach to modelling cognitive. London: AcademicPress(1994).",
      "doi": ""
    },
    {
      "text": "Christopher Watson and Frederick WB Li. 2014. Failure rates in introductory programming revisited. In Proceedings of the 2014 conference on Innovation & technology in computer science education. ACM, 39–44.",
      "doi": "10.1145/2591708.2591749"
    },
    {
      "text": "Nathaniel Weinman, Armando Fox, and Marti Hearst. 2020. Exploring challenging variations of parsons problems. In Proceedings of the 51st ACM Technical Symposium on Computer Science Education. 1349–1349.",
      "doi": "10.1145/3328778.3372639"
    },
    {
      "text": "Johannes Zagermann, Ulrike Pfeil, and Harald Reiterer. 2016. Measuring cognitive load using eye tracking technology in visual computing. In Proceedings of the sixth workshop on beyond time and errors on novel evaluation methods for visualization. 78–85.",
      "doi": "10.1145/2993901.2993908"
    },
    {
      "text": "Angela Zavaleta Bernuy and Brian Harrington. 2020. What are We Asking our Students? A Literature Map of Student Surveys in Computer Science Education. In Proceedings of the 2020 ACM Conference on Innovation and Technology in Computer Science Education. 418–424.",
      "doi": "10.1145/3341525.3387383"
    },
    {
      "text": "Albina Zavgorodniaia, Rodrigo Duran, Arto Hellas, Otto Seppala, and Juha Sorva. 2020. Measuring the Cognitive Load of Learning to Program: A Replication Study. In United Kingdom & Ireland Computing Education Research conference.3–9.",
      "doi": "10.1145/3416465.3416468"
    },
    {
      "text": "Rui Zhi, Min Chi, Tiffany Barnes, and Thomas W Price. 2019. Evaluating the Effectiveness of Parsons Problems for Block-based Programming. In Proceedings of the 2019 ACM Conference on International Computing Education Research. 51–59.",
      "doi": "10.1145/3291279.3339419"
    }
  ]
}