{
  "doi": "10.1145/3411764.3445199",
  "title": "Enhancing the Composition Task in Text Entry Studies: Eliciting Difficult Text and Improving Error Rate Calculation",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2021,
  "badges": [],
  "abstract": "Participants in text entry studies usually copy phrases or compose novel messages. A composition task mimics actual user behavior and can allow researchers to better understand how a system might perform in reality. A problem with composition is that participants may gravitate towards writing simple text, that is, text containing only common words. Such simple text is insufficient to explore all factors governing a text entry method, such as its error correction features. We contribute to enhancing composition tasks in two ways. First, we show participants can modulate the difficulty of their compositions based on simple instructions. While it took more time to compose difficult messages, they were longer, had more difficult words, and resulted in more use of error correction features. Second, we compare two methods for obtaining a participant’s intended text, comparing both methods with a previously proposed crowdsourced judging procedure. We found participant-supplied references were more accurate.",
  "authors": [
    {
      "name": "Dylan Gaines",
      "institution": "Computer Science Michigan Technological University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261923",
      "orcid": "missing"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "Department of Engineering University of Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    },
    {
      "name": "Keith Vertanen",
      "institution": "Michigan Technological University, United States",
      "img": "/do/10.1145/contrib-81413602297/rel-imgonly/keith_cs.png",
      "acmid": "81413602297",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kenneth C. Arnold, Krzysztof Z. Gajos, and Adam T. Kalai. 2016. On Suggesting Phrases vs. Predicting Words for Mobile Text Composition. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). ACM, New York, NY, USA, 603–608. https://doi.org/10.1145/2984511.2984584",
      "doi": "10.1145/2984511.2984584"
    },
    {
      "text": "Marc Franco-Salvador and Luis A. Leiva. 2018. Multilingual phrase sampling for text entry evaluations. International Journal of Human-Computer Studies 113 (2018), 15 – 31. https://doi.org/10.1016/j.ijhcs.2018.01.006",
      "doi": "10.1016/j.ijhcs.2018.01.006"
    },
    {
      "text": "Clare-Marie Karat, Christine Halverson, Daniel Horn, and John Karat. 1999. Patterns of Entry and Correction in Large Vocabulary Continuous Speech Recognition Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Pittsburgh, Pennsylvania, USA) (CHI ’99). ACM, New York, NY, USA, 568–575. https://doi.org/10.1145/302979.303160",
      "doi": "10.1145/302979.303160"
    },
    {
      "text": "I. Scott MacKenzie and R. William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In Extended Abstracts on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA) (CHI EA ’03). ACM, New York, NY, USA, 754–755. https://doi.org/10.1145/765891.765971",
      "doi": ""
    },
    {
      "text": "Keith Vertanen, Crystal Fletcher, Dylan Gaines, Jacob Gould, and Per Ola Kristensson. 2018. The Impact of Word, Multiple Word, and Sentence Input on Virtual Keyboard Decoding Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 626, 12 pages. https://doi.org/10.1145/3173574.3174200",
      "doi": "10.1145/3173574.3174200"
    },
    {
      "text": "Keith Vertanen, Dylan Gaines, Crystal Fletcher, Alex M. Stanage, Robbie Watling, and Per Ola Kristensson. 2019. VelociWatch: Designing and Evaluating a Virtual Keyboard for the Input of Challenging Text. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 591, 14 pages. https://doi.org/10.1145/3290605.3300821",
      "doi": "10.1145/3290605.3300821"
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2011. A Versatile Dataset for Text Entry Evaluations Based on Genuine Mobile Emails. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices & Services (Stockholm, Sweden) (MobileHCI ’11). ACM, New York, NY, USA, 295–298. https://doi.org/10.1145/2037373.2037418",
      "doi": "10.1145/2037373.2037418"
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2014. Complementing Text Entry Evaluations with a Composition Task. ACM Transactions of Computer Human Interaction 21, 2, Article 8 (February 2014), 33 pages. https://doi.org/10.1145/2555691",
      "doi": "10.1145/2555691"
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2019. Mining, Analyzing, and Modeling Text Written on Mobile Devices. Natural Language Engineering(2019), 1–33. https://doi.org/10.1017/S1351324919000548",
      "doi": ""
    },
    {
      "text": "Keith Vertanen, Haythem Memmi, Justin Emge, Shyam Reyal, and Per Ola Kristensson. 2015. VelociTap: Investigating Fast Mobile Text Entry Using Sentence-Based Decoding of Touchscreen Keyboard Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 659–668. https://doi.org/10.1145/2702123.2702135",
      "doi": "10.1145/2702123.2702135"
    }
  ]
}