{
  "doi": "10.1145/3411764.3445709",
  "title": "Using Design Fiction Memos to Analyze UX Professionals’ Values Work Practices: A Case Study Bridging Ethnographic and Design Futuring Methods",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2021,
  "badges": [],
  "abstract": "Multiple methods have been used to study how social values and ethics are implicated in technology design and use, including empirical qualitative studies of technologists’ work. Recently, more experimental approaches such as design fiction explore these themes through fictional worldbuilding. This paper combines these approaches by adapting design fictions as a form of memoing, a qualitative analysis technique. The paper uses design fiction memos to analyze and reflect on ethnographic interviews and observational data about how user experience (UX) professionals at large technology companies engage with values and ethical issues in their work. The design fictions help explore and articulate themes about the values work practices and relationships of power that UX professionals grapple with. Through these fictions, the paper contributes a case study showing how design fiction can be used for qualitative analysis, and provides insights into the role of organizational and power dynamics in UX professionals’ values work.",
  "tags": [
    "values",
    "UX practice",
    "design fiction",
    "ethnography",
    "values work",
    "UX professionals",
    "values in design",
    "ethics"
  ],
  "authors": [
    {
      "name": "Richmond Y. Wong",
      "institution": "Center for Long-Term Cybersecurity, University of California Berkeley, United States",
      "img": "/do/10.1145/contrib-99658688813/rel-imgonly/glasses_profile_pic_square.jpg",
      "acmid": "99658688813",
      "orcid": "0000-0001-8613-0380"
    }
  ],
  "references": [
    {
      "text": "Sara Ahmed. 2019. A Complaint Biography. Biography 42, 3 (2019), 514–523. https://doi.org/10.1353/bio.2019.0057",
      "doi": ""
    },
    {
      "text": "Madeleine Akrich. 1992. The De-Scription of Technical Objects. In Shaping Technology Building Society: Studies in Sociotechnical Change, Wiebe Bijker and John Law (Eds.). MIT Press, Cambridge, Massachusetts, Chapter 7, 205–224.",
      "doi": ""
    },
    {
      "text": "Stephanie Ballard, Karen M. Chappell, and Kristen Kennedy. 2019. Judgment Call the Game: Using value sensitive design and design fiction to surface ethical concerns related to technology. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19. ACM Press, New York, New York, USA, 421–433. https://doi.org/10.1145/3322276.3323697",
      "doi": "10.1145/3322276.3323697"
    },
    {
      "text": "Eric P.S. Baumer, Timothy Berrill, Sarah C. Botwinick, Jonathan L. Gonzales, Kevin Ho, Allison Kundrik, Luke Kwon, Tim LaRowe, Chanh P. Nguyen, Fredy Ramirez, Peter Schaedler, William Ulrich, Amber Wallace, Yuchen Wan, and Benjamin Weinfeld. 2018. What Would You Do? Design fiction and ethics. In Proceedings of the 2018 ACM Conference on Supporting Groupwork. ACM, New York, NY, USA, 244–256. https://doi.org/10.1145/3148330.3149405",
      "doi": "10.1145/3148330.3149405"
    },
    {
      "text": "Eric P. S. Baumer, Mark Blythe, and Theresa Jean Tanenbaum. 2020. Evaluating Design Fiction: The Right Tool for the Job. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, New York, NY, USA, 1901–1913. https://doi.org/10.1145/3357236.3395464",
      "doi": "10.1145/3357236.3395464"
    },
    {
      "text": "Johana Bhuiyan. 2019. How the Google walkout transformed tech workers into activists. https://www.latimes.com/business/technology/story/2019-11-06/google-employee-walkout-tech-industry-activism",
      "doi": ""
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A Short Essay on Design, Science, Fact and Fiction. Technical Report March. Near Future Laboratory. 49 pages. http://www.nearfuturelaboratory.com/2009/03/17/design-fiction-a-short-essay-on-design-science-fact-and-fiction/",
      "doi": ""
    },
    {
      "text": "Mark Blythe. 2017. Research Fiction: Storytelling, Plot and Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17. ACM Press, New York, New York, USA, 5400–5411. https://doi.org/10.1145/3025453.3026023",
      "doi": "10.1145/3025453.3026023"
    },
    {
      "text": "Jenna Burrell. 2009. The Field Site as a Network: A Strategy for Locating Ethnographic Research. Field Methods 21, 2 (feb 2009), 181–199. https://doi.org/10.1177/1525822X08329699",
      "doi": ""
    },
    {
      "text": "Julia Carrie Wong. 2019. Fifth Google worker-activist fired in a month says company is targeting the vulnerable. https://www.theguardian.com/us-news/2019/dec/17/fifth-google-worker-activist-fired-in-a-month-says-company-is-targeting-the-vulnerable",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2001. Grounded Theory. In Contemporary Field Research: Perspectives and Formulations (2nd ed.), Robert M. Emerson (Ed.). Waveland Press, Long Grove, Illinois, Chapter 15, 335–352.",
      "doi": ""
    },
    {
      "text": "EunJeong Cheon and Norman Makoto Su. 2017. Configuring the User: “Robots have Needs Too”. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’17). ACM Press, New York, New York, USA, 191–206. https://doi.org/10.1145/2998181.2998329",
      "doi": "10.1145/2998181.2998329"
    },
    {
      "text": "Shruthi Sai Chivukula, Chris Rhys Watkins, Rhea Manocha, Jingle Chen, and Colin M. Gray. 2020. Dimensions of UX Practice that Shape Ethical Awareness. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376459",
      "doi": "10.1145/3313831.3376459"
    },
    {
      "text": "Lucas Colusso, Cynthia L. Bennett, Pari Gabriel, and Daniela K. Rosner. 2019. Design and Diversity? Speculations on what could go wrong. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, New York, NY, USA, 1405–1413. https://doi.org/10.1145/3322276.3323690",
      "doi": "10.1145/3322276.3323690"
    },
    {
      "text": "Kate Conger. 2021. Hundreds of Google Employees Unionize, Culminating Years of Activism. https://www.nytimes.com/2021/01/04/technology/google-employees-union.html",
      "doi": ""
    },
    {
      "text": "Paul Coulton, Joseph Lindley, Miriam Sturdee, and Michael Stead. 2017. Design Fiction as World Building. In Proceedings of the 3nd Biennial Research Through Design Conference. RTD 2017, Edinburgh, UK, 163–179. https://doi.org/10.6084/m9.figshare.4746964.Image",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins, Cayla Key, Heidi R. Biggs, and Kelsey Aschenbeck. 2019. Bespoke Booklets: A Method for Situated Co-Speculation. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19. ACM Press, New York, New York, USA, 697–709. https://doi.org/10.1145/3322276.3322311",
      "doi": "10.1145/3322276.3322311"
    },
    {
      "text": "Carl DiSalvo. 2012. Design and Agonism. In Adversarial Design. The MIT Press, Cambridge, Massachusetts, Chapter 1, 1–26.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2006. Implications for design. In Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI ’06. ACM Press, New York, New York, USA, 541. https://doi.org/10.1145/1124772.1124855",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative Everything. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C. Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S. Kirk. 2017. On Speculative Enactments. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 5386–5399. https://doi.org/10.1145/3025453.3025503",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "Mary Flanagan, Daniel C. Howe, and Helen Nissenbaum. 2008. Embodying values in technology: Theory and practice. In Information technology and Moral Philosophy, Jeroen Van Den Hovenand John (Charles Sa Weckert (Eds.). Cambridge University Press, New York, Chapter 16, 322–353. http://medcontent.metapress.com/index/A65RM03P4874243N.pdfhttp://books.google.com/books?hl=en&lr=&id=K3ziD9zQrMAC&oi=fnd&pg=PA322&dq=Embodying+Values+in+Technology+Theory+and+Practice&ots=OOnoemmbWI&sig=x8XGCzLk81Eb0qR9rgvFmbyxU-s",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Noura Howell, Richmond Wong, and Franchesca Spektor. 2019. Vivewell: Speculating Near-Future Menstrual Tracking through Current Data Practices. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19. ACM Press, New York, New York, USA, 541–552. https://doi.org/10.1145/3322276.3323695",
      "doi": "10.1145/3322276.3323695"
    },
    {
      "text": "Sheera Frenkel. 2018. Microsoft Employees Protest Work With ICE, as Tech Industry Mobilizes Over Immigration. https://www.nytimes.com/2018/06/19/technology/tech-companies-immigration-border.html",
      "doi": ""
    },
    {
      "text": "Batya Friedman, David G. Hendry, and Alan Borning. 2017. A Survey of Value Sensitive Design Methods. Foundations and Trends® in Human–Computer Interaction 11, 2(2017), 63–125. https://doi.org/10.1561/1100000015",
      "doi": ""
    },
    {
      "text": "Erin Friess. 2012. Personas and decision making in the design process: An Ethnographic Case Study. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, New York, New York, USA, 1209. https://doi.org/10.1145/2207676.2208572",
      "doi": "10.1145/2207676.2208572"
    },
    {
      "text": "Karin Garrety and Richard Badham. 2004. User-Centered Design and the Normative Politics of Technology. Science, Technology, & Human Values 29, 2 (apr 2004), 191–212. https://doi.org/10.1177/0162243903261946",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design?. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, New York, New York, USA, 937. https://doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity as a resource for design. In Proceedings of the conference on Human factors in computing systems (CHI ’03). ACM Press, New York, New York, USA, 233. https://doi.org/10.1145/642611.642653",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Clifford Geertz. 1973. Thick description: Toward an interpretive theory of culture. In Interpretation of Cultures: Selected Essays. Basic Books, New York.",
      "doi": ""
    },
    {
      "text": "Karen Golden-Biddle and Karen Locke. 1993. Appealing Work: An Investigation of How Ethnographic Texts Convince. Organization Science 4, 4 (nov 1993), 595–616. https://doi.org/10.1287/orsc.4.4.595",
      "doi": "10.1287/orsc.4.4.595"
    },
    {
      "text": "Colin M. Gray. 2014. Evolution of design competence in UX practice. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. ACM Press, New York, New York, USA, 1645–1654. https://doi.org/10.1145/2556288.2557264",
      "doi": "10.1145/2556288.2557264"
    },
    {
      "text": "Colin M Gray. 2016. ”It’s More of a Mindset Than a Method”. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16. ACM Press, New York, New York, USA, 4044–4055. https://doi.org/10.1145/2858036.2858410",
      "doi": "10.1145/2858036.2858410"
    },
    {
      "text": "Colin M. Gray and Shruthi Sai Chivukula. 2019. Ethical Mediation in UX Practice. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–11. https://doi.org/10.1145/3290605.3300408",
      "doi": ""
    },
    {
      "text": "Mary L. Gray and Siddharth Suri. 2019. Ghost Work. Houghton Mifflin Harcourt, Boston.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 2016. Staying with the Trouble: Making Kin in the Chthulucene. Duke University Press, Durham.",
      "doi": ""
    },
    {
      "text": "Matt Haughey. 2018. Mind the bot: a guide to Slackbot custom responses. https://slackhq.com/mind-the-bot-a-guide-to-slackbot-custom-responses",
      "doi": ""
    },
    {
      "text": "Arlie Russell Hochschild. 1983. The Managed Heart: Commercialization of Human Feeling. University of California Press, Berkeley, CA.",
      "doi": ""
    },
    {
      "text": "Lara Houston, Steven J Jackson, Daniela K Rosner, Syed Ishtiaque Ahmed, Meg Young, and Laewoo Kang. 2016. Values in Repair. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16. ACM Press, New York, New York, USA, 1403–1414. https://doi.org/10.1145/2858036.2858470",
      "doi": "10.1145/2858036.2858470"
    },
    {
      "text": "Lilly Irani. 2018. “Design Thinking”: Defending Silicon Valley at the Apex of Global Labor Hierarchies. Catalyst: Feminism, Theory, Technoscience 4, 1 (2018), 1–19. https://doi.org/10.28968/cftt.v4i1.29638",
      "doi": ""
    },
    {
      "text": "Nassim JafariNaimi, Lisa Nathan, and Ian Hargraves. 2015. Values as Hypotheses: Design, Inquiry, and the Service of Values. Design Issues 31, 4 (oct 2015), 91–104. https://doi.org/10.1162/DESI_a_00354",
      "doi": ""
    },
    {
      "text": "Os Keyes, Jevan Hutson, and Meredith Durbin. 2019. A Mulching Proposal. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–11. https://doi.org/10.1145/3290607.3310433 arxiv:1908.06166",
      "doi": "10.1145/3290607.3310433"
    },
    {
      "text": "Vera Khovanskaya, Phoebe Sengers, Melissa Mazmanian, and Charles Darrah. 2017. Reworking the Gaps between Design and Ethnography. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 5373–5385. https://doi.org/10.1145/3025453.3026051",
      "doi": "10.1145/3025453.3026051"
    },
    {
      "text": "David Kirby. 2010. The Future is Now: Diegetic Prototypes and the Role of Popular Films in Generating Real-world Technological Development. Social Studies of Science 40, 1 (feb 2010), 41–70. https://doi.org/10.1177/0306312709338325",
      "doi": ""
    },
    {
      "text": "Sandjar Kozubaev, Chris Elsden, Noura Howell, Marie Louise Juul Søndergaard, Nick Merrill, Britta Schulte, and Richmond Y Wong. 2020. Expanding Modes of Reflection in Design Futuring. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376526",
      "doi": "10.1145/3313831.3376526"
    },
    {
      "text": "Sandjar Kozubaev, Fernando Rochaix, Carl DiSalvo, and Christopher A. Le Dantec. 2019. Spaces and Traces: Implications of Smart Technology in Public Housing. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–13. https://doi.org/10.1145/3290605.3300669",
      "doi": "10.1145/3290605.3300669"
    },
    {
      "text": "Travis Kriplean, Ivan Beschastnikh, and David W. McDonald. 2008. Articulations of wikiwork. In Proceedings of the ACM 2008 conference on Computer supported cooperative work - CSCW ’08. ACM Press, New York, New York, USA, 47. https://doi.org/10.1145/1460563.1460573",
      "doi": "10.1145/1460563.1460573"
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2015. Back to the future: 10 years of design fiction. In Proceedings of the 2015 British HCI Conference. ACM, New York, NY, USA, 210–211. https://doi.org/10.1145/2783446.2783592",
      "doi": "10.1145/2783446.2783592"
    },
    {
      "text": "John Lofland, David Snow, Leon Anderson, and Lyn Lofland. 2006. Analyzing Social Settings: A guide to qualitaitve observation and analysis (4th ed.). Wadsworth, Belmont, CA.",
      "doi": ""
    },
    {
      "text": "Michael A. Madaio, Luke Stark, Jennifer Wortman Vaughan, and Hanna Wallach. 2020. Co-Designing Checklists to Understand Organizational Challenges and Opportunities around Fairness in AI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376445",
      "doi": "10.1145/3313831.3376445"
    },
    {
      "text": "Luiza Prado de O. Martins and Pedro J. S. Vieira de Oliveira. 2016. Breaking the cycle of Macondo: Design and decolonial futures. XRDS: Crossroads, The ACM Magazine for Students 22, 4 (jun 2016), 28–32. https://doi.org/10.1145/2930880",
      "doi": "10.1145/2930880"
    },
    {
      "text": "Nick Merrill. 2020. Security Fictions: Bridging Speculative Design and Computer Security. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, New York, NY, USA, 1727–1735. https://doi.org/10.1145/3357236.3395451",
      "doi": "10.1145/3357236.3395451"
    },
    {
      "text": "Dawn Nafus and Ken Anderson. 2006. The Real Problem: Rhetorics of Knowing in Corporate Ethnographic Research. Ethnographic Praxis in Industry Conference Proceedings 2006, 1 (sep 2006), 244–258. https://doi.org/10.1111/j.1559-8918.2006.tb00051.x",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2001. How computer systems embody values. Computer 34, 3 (mar 2001), 120–119. https://doi.org/10.1109/2.910905",
      "doi": "10.1109/2.910905"
    },
    {
      "text": "Renee Noortman, Britta F. Schulte, Paul Marshall, Saskia Bakker, and Anna L. Cox. 2019. HawkEye - Deploying a Design Fiction Probe. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–14. https://doi.org/10.1145/3290605.3300652",
      "doi": "10.1145/3290605.3300652"
    },
    {
      "text": "Pedro J.S. Vieira de Oliveira and Luiza Prado de O. Martins. 2019. Designer/Shapeshifter: A Decolonizing Redirection for Speculative and Critical Design. In Tricky Design: The Ethics of Things, Tom Fisher and Lorraine Gamman (Eds.). Bloomsbury Visual Arts, London, Chapter 6, 103–114.",
      "doi": ""
    },
    {
      "text": "Samir Passi and Steven J Jackson. 2018. Trust in Data Science: Collaboration, Translation, and Accountability in Corporate Data Science Projects. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (nov 2018), 1–28. https://doi.org/10.1145/3274405",
      "doi": "10.1145/3274405"
    },
    {
      "text": "James Pierce, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver, and Carl DiSalvo. 2015. Expanding and Refining Design and Criticality in HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2083–2092. https://doi.org/10.1145/2702123.2702438",
      "doi": "10.1145/2702123.2702438"
    },
    {
      "text": "Matt Ratto. 2011. Critical making: Conceptual and material studies in technology and social life. Information Society 27, 4 (2011), 252–260. https://doi.org/10.1080/01972243.2011.583819",
      "doi": "10.1080/01972243.2011.583819"
    },
    {
      "text": "Sarah T. Roberts. 2016. Commercial Content Moderation: Digital Laborers’ Dirty Work. In The Intersectional Internet: Race, Sex, Class and Culture Online, Safiya Umoja Noble and Brendesha M. Tynes (Eds.). Peter Lang Publishing, New York, 1–12. https://doi.org/10.1007/s13398-014-0173-7.2 arxiv:arXiv:1011.1669v3",
      "doi": ""
    },
    {
      "text": "Sarah T. Roberts. 2018. Digital detritus: ’Error’ and the logic of opacity in social media content moderation. First Monday 23, 3 (mar 2018). https://doi.org/10.5210/fm.v23i3.8283",
      "doi": ""
    },
    {
      "text": "Emma Rose and Josh Tenenberg. 2016. Arguing about design: A taxonomy of rhetorical strategies deployed by user experience practitioners. In Proceedings of the 34th ACM International Conference on the Design of Communication - SIGDOC ’16. ACM Press, New York, New York, USA, 1–10. https://doi.org/10.1145/2987592.2987608",
      "doi": "10.1145/2987592.2987608"
    },
    {
      "text": "Daniela K. Rosner. 2018. Critical Fabulations: Reworking the Methods and Margins of Design. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Daniela K Rosner, Saba Kawas, Wenqi Li, Nicole Tilly, and Yi-chen Sung. 2016. Out of Time, Out of Place: Reflections on Design Workshops as a Research Method. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing - CSCW ’16. ACM Press, New York, New York, USA, 1129–1139. https://doi.org/10.1145/2818048.2820021",
      "doi": ""
    },
    {
      "text": "Katie Shilton. 2013. Values Levers: Building Ethics into Design. Science, Technology, & Human Values 38, 3 (2013), 374–397. https://doi.org/10.1177/0162243912436985",
      "doi": ""
    },
    {
      "text": "Katie Shilton, Jes A. Koepfler, and Kenneth R. Fleischmann. 2014. How to see values in social computing: Methods for Studying Values Dimensions. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW ’14). ACM Press, New York, New York, USA, 426–435. https://doi.org/10.1145/2531602.2531625",
      "doi": "10.1145/2531602.2531625"
    },
    {
      "text": "Christo Sims. 2017. The Politics of Design, Design as Politics. In The Routledge Companion to Digital Ethnography, Larissa Hjorth, Heather Horst, Anne Galloway, and Genevieve Bell (Eds.). Routledge, New York, Chapter 40, 439–447.",
      "doi": ""
    },
    {
      "text": "Michael Skirpan and Casey Fiesler. 2018. Ad Empathy: A Design Fiction. In Proceedings of the 2018 ACM Conference on Supporting Groupwork (GROUP ’18). ACM Press, New York, New York, USA, 267–273. https://doi.org/10.1145/3148330.3149407",
      "doi": "10.1145/3148330.3149407"
    },
    {
      "text": "Robert Soden, Michael Skirpan, Casey Fiesler, Zahra Ashktorab, Eric P. S. Baumer, Mark Blythe, and Jasmine Jones. 2019. CHI4EVIL: Creative Speculation On the Negative Impacts of HCI Research. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI EA ’19. ACM Press, New York, New York, USA, 1–8. https://doi.org/10.1145/3290607.3299033",
      "doi": "10.1145/3290607.3299033"
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2018. Intimate Futures: Staying with the Trouble of Digital Personal Assistants through Design Fiction. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS ’18. ACM Press, New York, New York, USA, 869–880. https://doi.org/10.1145/3196709.3196766",
      "doi": "10.1145/3196709.3196766"
    },
    {
      "text": "Theresa Jean Tanenbaum, Karen Tanenbaum, and Ron Wakkary. 2012. Steampunk as design fiction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’12). ACM Press, New York, New York, USA, 1583. https://doi.org/10.1145/2207676.2208279",
      "doi": "10.1145/2207676.2208279"
    },
    {
      "text": "Cameron Tonkinwise. 2014. How We Intend to Future: Review of Anthony Dunne and Fiona Raby, Speculative Everything: Design, Fiction, and Social Dreaming. Design Philosophy Papers 12, 2 (dec 2014), 169–187. https://doi.org/10.2752/144871314X14159818597676",
      "doi": ""
    },
    {
      "text": "Sarah J. Tracy. 2013. Qualitative Research Methods: Collecting evidence, crafting analysis, communicating impact. Wiley-Blackwell, Chichester, West Sussex.",
      "doi": ""
    },
    {
      "text": "Janet Vertesi, David Ribes, Laura Forlano, Yanni Loukissas, and Marisa Leavitt Cohn. 2016. Engaging, Designing and Making Digital Systems. In The handbook of science and technology studies (6th ed.), Ulrike Felt, Rayvon Fouche, Clark A. Miller, and Laurel Smith-Doerr (Eds.). The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary, William Odom, Sabrina Hauser, Garnet Hertz, and Henry Lin. 2015. Material Speculation: Actual Artifacts for Critical Inquiry. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (Aarhus, Denmark) (CA ’15). Aarhus University Press, Aarhus N, 97–108. https://doi.org/10.7146/aahcc.v1i1.21299",
      "doi": "10.7146/aahcc.v1i1.21299"
    },
    {
      "text": "Alex Wilkie and Mike Michael. 2009. Expectation and Mobilisation: Enacting Future Users. Science, Technology, & Human Values 34, 4 (jul 2009), 502–522. https://doi.org/10.1177/0162243908329188",
      "doi": ""
    },
    {
      "text": "Langdon Winner. 1980. Do Artifacts Have Politics?Daedalus 109, 1 (1980), 121–136.",
      "doi": ""
    },
    {
      "text": "Richmond Y Wong, Vera Khovanskaya, Sarah E Fox, Nick Merrill, and Phoebe Sengers. 2020. Infrastructural Speculations: Tactics for Designing and Interrogating Lifeworlds. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376515",
      "doi": "10.1145/3313831.3376515"
    },
    {
      "text": "Richmond Y Wong, Nick Merrill, and John Chuang. 2018. When BCIs have APIs: Design Fictions of Everyday Brain-Computer Interface Adoption. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS ’18. ACM Press, New York, New York, USA, 1359–1371. https://doi.org/10.1145/3196709.3196746",
      "doi": "10.1145/3196709.3196746"
    },
    {
      "text": "Richmond Y. Wong, Deirdre K Mulligan, Ellen Van Wyk, James Pierce, and John Chuang. 2017. Eliciting Values Reflections by Engaging Privacy Futures Using Design Workbooks. Proceedings of the ACM on Human Computer Interaction 1, CSCW(2017), 1–27. https://doi.org/10.1145/3134746",
      "doi": "10.1145/3134746"
    },
    {
      "text": "Richmond Y. Wong, Ellen Van Wyk, and James Pierce. 2017. Real-Fictional Entanglements: Using Science Fiction and Design Fiction to Interrogate Sensing Technologies. In Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, New York, NY, USA, 567–579. https://doi.org/10.1145/3064663.3064682",
      "doi": "10.1145/3064663.3064682"
    },
    {
      "text": "Steve Woolgar. 1990. Configuring the User: The Case of Usability Trials. The Sociological Review 38, 1_suppl (may 1990), 58–99. https://doi.org/10.1111/j.1467-954X.1990.tb03349.x",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems (CHI ’07). ACM Press, New York, New York, USA, 493. https://doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "Shoshana Zuboff. 1988. In the Age of the Smart Machine: The Future of Work and Power. Basic Books, New York.",
      "doi": "10.5555/47303"
    }
  ]
}