{
  "doi": "10.1145/3411764.3445809",
  "title": "Students’ Verbalized Metacognition During Computerized Learning",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Students in computerized learning environments often direct their own learning processes, which requires metacognitive awareness of what should be learned next. We investigated a novel method of measuring verbalized metacognition by applying natural language processing (NLP) to transcripts of interviews conducted in a classroom with 99 middle school students who were using a computerized learning environment. We iteratively adapted the NLP method for the linguistic characteristics of these interviews, then applied it to study three research questions regarding the relationships between verbalized metacognition and measures of 1) learning, 2) confusion, and 3) metacognitive problem-solving strategies. Verbalized metacognition was not directly related to learning, but was related to confusion and metacognitive problem-solving strategies. Results also suggested that interviews themselves may improve learning by encouraging metacognition. We discuss implications for designing computerized environments that support self-regulated learning through metacognition.",
  "authors": [
    {
      "name": "Nigel Bosch",
      "institution": "School of Information Sciences and Department of Educational Psychology University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "88159237157",
      "orcid": "missing"
    },
    {
      "name": "Yingbin Zhang",
      "institution": "Department of Curriculum and Instruction University of Illinois Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659510972",
      "orcid": "missing"
    },
    {
      "name": "Luc Paquette",
      "institution": "College of Education University of Illinois at Urbana-Champaign, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81438593927",
      "orcid": "missing"
    },
    {
      "name": "Ryan Baker",
      "institution": "University of Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436593472",
      "orcid": "missing"
    },
    {
      "name": "Jaclyn Ocumpaugh",
      "institution": "University of Pennsylvania, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508706809",
      "orcid": "missing"
    },
    {
      "name": "Gautam Biswas",
      "institution": "Vanderbilt University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100075566",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Rakefet Ackerman and Morris Goldsmith. 2011. Metacognitive regulation of text learning: On screen versus on paper. Journal of Experimental Psychology: Applied 17, 1 (2011), 18–32. DOI: https://doi.org/10.1037/a0022086",
      "doi": ""
    },
    {
      "text": "Icek Ajzen and Martin Fishbein. 2005. The influence of attitudes on behavior. In The handbook of attitudes, Dolores Albarracín, Blair T. Johnson and Mark P. Zanna (eds.). Lawrence Erlbaum Associates Publishers, Mahwah, NJ, 173–221.",
      "doi": ""
    },
    {
      "text": "Alexandra Andres, Jaclyn Ocumpaugh, Ryan S. Baker, Stefan Slater, Luc Paquette, Yang Jiang, Nigel Bosch, Anabil Munshi, Allison L. Moore, and Gautam Biswas. 2019. Affect sequences and learning in Betty's Brain. In Proceedings of the 9th International Conference on Learning Analytics & Knowledge (LAK19), ACM, New York, NY, 383–390. DOI: https://doi.org/10.1145/3303772.3303807",
      "doi": "10.1145/3303772.3303807"
    },
    {
      "text": "Roger Azevedo and Vincent Aleven. 2013. Metacognition and learning technologies: An overview of current interdisciplinary research. In International Handbook of Metacognition and Learning Technologies, Roger Azevedo and Vincent Aleven (eds.). Springer, New York, NY, 1–16. DOI: https://doi.org/10.1007/978-1-4419-5546-3_1",
      "doi": ""
    },
    {
      "text": "Roger Azevedo, Amy Johnson, Amber Chauncey, and Candice Burkett. 2010. Self-regulated learning with MetaTutor: Advancing the science of learning with metacognitive tools. In New Science of Learning: Cognition, Computers and Collaboration in Education, Myint Swe Khine and Issa M. Saleh (eds.). Springer, New York, NY, 225–247. DOI: https://doi.org/10.1007/978-1-4419-5716-0_11",
      "doi": ""
    },
    {
      "text": "Gautam Biswas, Krittaya Leelawong, Daniel Schwartz, Nancy Vye, and The Teachable Agents Group at Vanderbilt. 2005. Learning by teaching: A new agent paradigm for educational software. Applied Artificial Intelligence 19, 3–4 (March 2005), 363–392. DOI: https://doi.org/10.1080/08839510590910200",
      "doi": ""
    },
    {
      "text": "Gautam Biswas, James R. Segedy, and Kritya Bunchongchit. 2016. From design to implementation to practice - A learning by teaching system: Betty's Brain. International Journal of Artificial Intelligence in Education 26, 1 (March 2016), 350–364. DOI: https://doi.org/10.1007/s40593-015-0057-9",
      "doi": ""
    },
    {
      "text": "A.F. Blackwell. 1996. Metacognitive theories of visual programming: What do we think we are doing? In Proceedings 1996 IEEE Symposium on Visual Languages, IEEE, 240–246. DOI: https://doi.org/10.1109/VL.1996.545293",
      "doi": ""
    },
    {
      "text": "Benjamin S. Bloom. 1968. Learning for mastery. Evaluation Comment 1, 2 (1968).",
      "doi": ""
    },
    {
      "text": "Ivar Bråten and Marit S. Samuelstuen. 2007. Measuring strategic processing: Comparing task-specific self-reports to traces. Metacognition Learning 2, 1 (April 2007), 1–20. DOI: https://doi.org/10.1007/s11409-007-9004-y",
      "doi": ""
    },
    {
      "text": "Gwendolyn E. Campbell, Natalie B. Steinhauser, Myroslava Dzikovska, Johanna D. Moore, Charles B. Callaway, and Elaine Farrow. 2009. Metacognitive awareness versus linguistic politeness: Expressions of confusion in tutorial dialogues. Naval Air Warfare Center Training Systems Div. Retrieved September 3, 2020 from https://apps.dtic.mil/sti/citations/ADA530033",
      "doi": ""
    },
    {
      "text": "Michelene T. H. Chi, Miriam Bassok, Matthew W. Lewis, Peter Reimann, and Robert Glaser. 1989. Self-explanations: How students study and use examples in learning to solve problems. Cognitive Science 13, 2 (April 1989), 145–182. DOI: https://doi.org/10.1016/0364-0213(89)90002-5",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1960. A coefficient of agreement for nominal scales. Educational and Psychological Measurement 20, (1960), 37–46. DOI: https://doi.org/10.1177/001316446002000104",
      "doi": ""
    },
    {
      "text": "Scotty D. Craig, Xiangen Hu, Arthur C. Graesser, Anna E. Bargagliotti, Allan Sterbinsky, Kyle R. Cheney, and Theresa Okwumabua. 2013. The impact of a technology-based mathematics after-school program using ALEKS on student's knowledge and behaviors. Computers & Education 68, (October 2013), 495–504. DOI: https://doi.org/10.1016/j.compedu.2013.06.010",
      "doi": ""
    },
    {
      "text": "Scotty Craig, Art Graesser, Jeremiah Sullins, and Barry Gholson. 2004. Affect and learning: An exploratory look into the role of affect in learning with AutoTutor. Journal of Educational Media 29, 3 (2004), 241–250. DOI: https://doi.org/10.1080/1358165042000283101",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo. 2016. Participatory design through a learning science lens. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), Association for Computing Machinery, New York, NY, USA, 4459–4463. DOI: https://doi.org/10.1145/2858036.2858405",
      "doi": "10.1145/2858036.2858405"
    },
    {
      "text": "Sidney K. D'Mello and Art Graesser. 2012. Dynamics of affective states during complex learning. Learning and Instruction 22, 2 (April 2012), 145–157. DOI: https://doi.org/10.1016/j.learninstruc.2011.10.001",
      "doi": ""
    },
    {
      "text": "Sidney K. D'Mello and Arthur C. Graesser. 2014. Confusion. In International Handbook of Emotions in Education, Reinhard Pekrun and Lisa Linnenbrink-Garcia (eds.). New York, NY: Routledge, 289–310.",
      "doi": ""
    },
    {
      "text": "Sidney K. D'Mello, Blair Lehman, Reinhard Pekrun, and Art Graesser. 2014. Confusion can be beneficial for learning. Learning and Instruction 29, 1 (2014), 153–170.",
      "doi": ""
    },
    {
      "text": "Yehudit Judy Dori, Zemira R. Mevarech, and Dale R. Baker (Eds.). 2018. Cognition, Metacognition, and Culture in STEM Education. Springer, Cham, CH. Retrieved from https://doi.org/10.1007/978-3-319-66659-4",
      "doi": ""
    },
    {
      "text": "Jason E. Dowd, Ives Araujo, and Eric Mazur. 2015. Making sense of confusion: Relating performance, confidence, and self-efficacy to expressions of confusion in an introductory physics class. Phys. Rev. ST Phys. Educ. Res. 11, 1 (March 2015), 010107. DOI: https://doi.org/10.1103/PhysRevSTPER.11.010107",
      "doi": ""
    },
    {
      "text": "David Dunning. 2011. Chapter five - The Dunning–Kruger effect: On being ignorant of one's own ignorance. In Advances in Experimental Social Psychology, James M. Olson and Mark P. Zanna (eds.). Academic Press, 247–296. DOI: https://doi.org/10.1016/B978-0-12-385522-0.00005-6",
      "doi": ""
    },
    {
      "text": "Anastasia Efklides. 2006. Metacognition and affect: What can metacognitive experiences tell us about the learning process? Educational Research Review 1, 1 (January 2006), 3–14. DOI: https://doi.org/10.1016/j.edurev.2005.11.001",
      "doi": ""
    },
    {
      "text": "Anastasia Efklides. 2008. Metacognition: Defining its facets and levels of functioning in relation to self-regulation and co-regulation. European Psychologist 13, 4 (January 2008), 277–287. DOI: https://doi.org/10.1027/1016-9040.13.4.277",
      "doi": ""
    },
    {
      "text": "John H. Flavell. 1976. Metacognitive aspects of problem solving. In The Nature of Intelligence, L. B. Resnick (ed.). Erlbaum, Hillsdale, NJ, 231–236.",
      "doi": ""
    },
    {
      "text": "John H. Flavell. 1979. Metacognition and cognitive monitoring: A new area of cognitive–developmental inquiry. American Psychologist 34, 10 (1979), 906–911. DOI: https://doi.org/10.1037/0003-066X.34.10.906",
      "doi": ""
    },
    {
      "text": "Matthias Gamer, Jim Lemon, Ian Fellows, and Puspendra Singh. 2019. irr: Various coefficients off interrater reliability and agreement.",
      "doi": ""
    },
    {
      "text": "Peter M. Gollwitzer and Bernd Schaal. 1998. Metacognition in action: The importance of implementation intentions. Personality and Social Psychology Review 2, 2 (May 1998), 124–136. DOI: https://doi.org/10.1207/s15327957pspr0202_5",
      "doi": ""
    },
    {
      "text": "George M. Harrison and Lisa M. Vallin. 2018. Evaluating the metacognitive awareness inventory using empirical factor-structure evidence. Metacognition and Learning 13, 1 (April 2018), 15–38. DOI: https://doi.org/10.1007/s11409-017-9176-z",
      "doi": ""
    },
    {
      "text": "Neil T. Heffernan and Cristina Lindquist Heffernan. 2014. The ASSISTments ecosystem: Building a platform that brings scientists and teachers together for minimally invasive research on human earning and teaching. Int J Artif Intell Educ 24, 4 (2014), 470–497. DOI: https://doi.org/10.1007/s40593-014-0024-x",
      "doi": ""
    },
    {
      "text": "Eddie Huang, Hannah Valdiviejas, and Nigel Bosch. 2019. I'm sure! Automatic detection of metacognition in online course discussion forums. In Proceedings of the 8th International Conference on Affective Computing and Intelligent Interaction (ACII 2019), IEEE, Piscataway, NJ, 241–247. DOI: https://doi.org/10.1109/ACII.2019.8925506",
      "doi": ""
    },
    {
      "text": "Yang Jiang, Nigel Bosch, Ryan S. Baker, Luc Paquette, Jaclyn Ocumpaugh, Juliana Ma. Alexandra L. Andres, Allison L. Moore, and Gautam Biswas. 2018. Expert feature-engineering vs. deep neural networks: Which is better for sensor-free affect detection? In Proceedings of the 19th International Conference on Artificial Intelligence in Education (AIED 2018), Springer, Cham, CH, 198–211. DOI: https://doi.org/10.1007/978-3-319-93843-1_15",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Katharina Reinecke, and Jessica Hullman. 2017. Explaining the gap: Visualizing one's predictions improves recall and comprehension of data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), Association for Computing Machinery, New York, NY, USA, 1375–1386. DOI: https://doi.org/10.1145/3025453.3025592",
      "doi": "10.1145/3025453.3025592"
    },
    {
      "text": "John S. Kinnebrew, James R. Segedy, and Gautam Biswas. 2014. Analyzing the temporal evolution of students’ behaviors in open-ended learning environments. Metacognition Learning 9, 2 (August 2014), 187–215. DOI: https://doi.org/10.1007/s11409-014-9112-4",
      "doi": ""
    },
    {
      "text": "James A. Kulik and J. D. Fletcher. 2016. Effectiveness of intelligent tutoring systems: A meta-analytic review. Review of Educational Research 86, 1 (March 2016), 42–78. DOI: https://doi.org/10.3102/0034654315581420",
      "doi": ""
    },
    {
      "text": "J. Richard Landis and Gary G. Koch. 1977. The measurement of observer agreement for categorical data. Biometrics 33, 1 (1977), 159–174. DOI: https://doi.org/10.2307/2529310",
      "doi": ""
    },
    {
      "text": "Blair Lehman and Art Graesser. 2015. To resolve or not to resolve? That is the big question about confusion. In Artificial Intelligence in Education (Lecture Notes in Computer Science), Springer International Publishing, Cham, CH, 216–225. DOI: https://doi.org/10.1007/978-3-319-19773-9_22",
      "doi": ""
    },
    {
      "text": "Diane Litman and Kate Forbes-Riley. 2013. Towards improving (meta)cognition by adapting to student uncertainty in tutorial dialogue. In International Handbook of Metacognition and Learning Technologies, Roger Azevedo and Vincent Aleven (eds.). Springer, New York, NY, 385–396. DOI: https://doi.org/10.1007/978-1-4419-5546-3_25",
      "doi": ""
    },
    {
      "text": "Dastyni Loksa, Amy J. Ko, Will Jernigan, Alannah Oleson, Christopher J. Mendez, and Margaret M. Burnett. 2016. Programming, problem solving, and self-awareness: Effects of explicit guidance. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), Association for Computing Machinery, New York, NY, USA, 1449–1461. DOI: https://doi.org/10.1145/2858036.2858252",
      "doi": "10.1145/2858036.2858252"
    },
    {
      "text": "Richard E. Mayer. 2016. The role of metacognition in STEM games and simulations. In Using Games and Simulations for Teaching and Assessment: Key Issues, Harold F. O'Neil, Eva L. Baker and Ray S. Perez (eds.). Routledge, 183–205.",
      "doi": ""
    },
    {
      "text": "Anabil Munshi, Ramkumar Rajendran, Jaclyn Ocumpaugh, Gautam Biswas, Ryan S. Baker, and Luc Paquette. 2018. Modeling learners’ cognitive and affective states to scaffold SRL in open-ended learning environments. In Proceedings of the 26th Conference on User Modeling, Adaptation and Personalization (UMAP ’18), Association for Computing Machinery, New York, NY, USA, 131–138. DOI: https://doi.org/10.1145/3209219.3209241",
      "doi": "10.1145/3209219.3209241"
    },
    {
      "text": "Joseph D. Novak and Alberto J. Cañas. 2008. The theory underlying concept maps and how to construct and use them. Florida Institute for Human and Machine Cognition (IHMC).",
      "doi": ""
    },
    {
      "text": "Ernesto Panadero. 2017. A review of self-regulated learning: Six Models and four directions for research. Frontiers in Psychology 8, (2017). DOI: https://doi.org/10.3389/fpsyg.2017.00422",
      "doi": ""
    },
    {
      "text": "Nancy E. Perry and Philip H. Winne. 2006. Learning from learning kits: gStudy traces of students’ self-regulated engagements with computerized content. Educ Psychol Rev 18, 3 (September 2006), 211–228. DOI: https://doi.org/10.1007/s10648-006-9014-3",
      "doi": ""
    },
    {
      "text": "James Prather, Raymond Pettit, Brett A. Becker, Paul Denny, Dastyni Loksa, Alani Peters, Zachary Albrecht, and Krista Masci. 2019. First things first: Providing metacognitive scaffolding for interpreting problem prompts. In Proceedings of the 50th ACM Technical Symposium on Computer Science Education (SIGCSE ’19), Association for Computing Machinery, New York, NY, USA, 531–537. DOI: https://doi.org/10.1145/3287324.3287374",
      "doi": "10.1145/3287324.3287374"
    },
    {
      "text": "James Prather, Raymond Pettit, Kayla McMurry, Alani Peters, John Homer, and Maxine Cohen. 2018. Metacognitive difficulties faced by novice programmers in automated assessment tools. In Proceedings of the 2018 ACM Conference on International Computing Education Research (ICER ’18), Association for Computing Machinery, New York, NY, USA, 41–50. DOI: https://doi.org/10.1145/3230977.3230981",
      "doi": "10.1145/3230977.3230981"
    },
    {
      "text": "R Core Team. 2013. R: A language and environment for statistical computing. (2013).",
      "doi": ""
    },
    {
      "text": "Steve Ritter, Michael Yudelson, Stephen E. Fancsali, and Susan R. Berman. 2016. How mastery learning works at scale. In Proceedings of the Third (2016) ACM Conference on Learning @ Scale (L@S ’16), ACM, New York, NY, 71–79. DOI: https://doi.org/10.1145/2876034.2876039",
      "doi": ""
    },
    {
      "text": "Rod D. Roscoe and Michelene T. H. Chi. 2007. Understanding tutor learning: Knowledge-building and knowledge-telling in peer tutors’ explanations and questions. Review of Educational Research 77, 4 (December 2007), 534–574. DOI: https://doi.org/10.3102/0034654307309920",
      "doi": ""
    },
    {
      "text": "Jonathan W. Schooler, Stellan Ohlsson, and Kevin Brooks. 1993. Thoughts beyond words: When language overshadows insight. Journal of Experimental Psychology: General 122, 2 (1993), 166–183. DOI: https://doi.org/10.1037/0096-3445.122.2.166",
      "doi": ""
    },
    {
      "text": "Gregory Schraw. 2009. A conceptual analysis of five measures of metacognitive monitoring. Metacognition Learning 4, 1 (April 2009), 33–45. DOI: https://doi.org/10.1007/s11409-008-9031-3",
      "doi": ""
    },
    {
      "text": "Gregory Schraw, Kent J. Crippen, and Kendall Hartley. 2006. Promoting self-regulation in science education: Metacognition as part of a broader perspective on learning. Research in Science Education 36, 1 (March 2006), 111–139. DOI: https://doi.org/10.1007/s11165-005-3917-8",
      "doi": "10.1007/s11165-005-"
    },
    {
      "text": "Gregory Schraw and Rayne Sperling Dennison. 1994. Assessing metacognitive awareness. Contemporary Educational Psychology 19, 4 (1994), 460–475.",
      "doi": ""
    },
    {
      "text": "James R. Segedy, John S. Kinnebrew, and Gautam Biswas. 2015. Using coherence analysis to characterize self-regulated learning behaviours in open-ended learning environments. Journal of Learning Analytics 2, 1 (May 2015), 13–48–13–48. DOI: https://doi.org/10.18608/jla.2015.21.3",
      "doi": ""
    },
    {
      "text": "Valerie J. Shute, Matthew Ventura, and Yoon Jeon Kim. 2013. Assessment and learning of qualitative physics in Newton's Playground. The Journal of Educational Research 106, 6 (2013), 423–430.",
      "doi": ""
    },
    {
      "text": "Kimberly D. Tanner. 2012. Promoting student metacognition. CBE—Life Sciences Education 11, 2 (June 2012), 113–120. DOI: https://doi.org/10.1187/cbe.12-03-0033",
      "doi": ""
    },
    {
      "text": "Marcel V. J. Veenman, Laura Bavelaar, Levina De Wolf, and Marieke G. P. Van Haaren. 2014. The on-line assessment of metacognitive skills in a computerized learning environment. Learning and Individual Differences 29, (January 2014), 123–130. DOI: https://doi.org/10.1016/j.lindif.2013.01.003",
      "doi": ""
    },
    {
      "text": "Marcel V. J. Veenman, Bernadette H. A. M. Van Hout-Wolters, and Peter Afflerbach. 2006. Metacognition and learning: Conceptual and methodological considerations. Metacognition Learning 1, 1 (April 2006), 3–14. DOI: https://doi.org/10.1007/s11409-006-6893-0",
      "doi": ""
    },
    {
      "text": "Kim-Phuong L. Vu, Gerard L. Hanley, Thomas Z. Strybel, and Robert W. Proctor. 2000. Metacognitive processes in human-computer Interaction: Self-assessments of knowledge as predictors of computer expertise. International Journal of Human–Computer Interaction 12, 1 (May 2000), 43–71. DOI: https://doi.org/10.1207/S15327590IJHC1201_2",
      "doi": ""
    },
    {
      "text": "Thiemo Wambsganss, Christina Niklaus, Matthias Cetto, Matthias Söllner, Siegfried Handschuh, and Jan Marco Leimeister. 2020. AL: An adaptive learning support system for argumentation skills. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–14. DOI: https://doi.org/10.1145/3313831.3376732",
      "doi": "10.1145/3313831.3376732"
    },
    {
      "text": "Margaret C. Wang, Geneva D. Haertel, and Herbert J. Walberg. 1990. What influences learning? A content analysis of review literature. The Journal of Educational Research 84, 1 (September 1990), 30–43. DOI: https://doi.org/10.1080/00220671.1990.10885988",
      "doi": ""
    },
    {
      "text": "Shang Wang, Deniz Sonmez Unal, and Erin Walker. 2019. MindDot: Supporting effective cognitive behaviors in concept map-based learning environments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–14. DOI: https://doi.org/10.1145/3290605.3300258",
      "doi": "10.1145/3290605.3300258"
    },
    {
      "text": "Shang Wang, Erin Walker, and Ruth Wylie. 2017. What matters in concept mapping? Maps learners create or how they create them. In Artificial Intelligence in Education (Lecture Notes in Computer Science), Springer International Publishing, Cham, CH, 406–417. DOI: https://doi.org/10.1007/978-3-319-61425-0_34",
      "doi": ""
    },
    {
      "text": "Yingbin Zhang, Luc Paquette, Ryan S. Baker, Jaclyn Ocumpaugh, Nigel Bosch, Anabil Munshi, and Gautam Biswas. 2020. The relationship between confusion and metacognitive strategies in Betty's Brain. In Proceedings of the 10th International Conference on Learning Analytics and Knowledge (LAK20), ACM, New York, NY, 276–284. DOI: https://doi.org/10.1145/3375462.3375518",
      "doi": "10.1145/3375462.3375518"
    }
  ]
}