{
  "doi": "10.1145/3411764.3445305",
  "title": "“Why lose control?” A Study of Freelancers’ Experiences with Gig Economy Platforms",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Freelancing platforms, such as Upwork, represent an expansion of the gig economy to encompass knowledge-based work. Prior research in HCI has primarily focused on forms of gig work such as ride-sharing and microwork but has not addressed how freelancing platforms are disrupting high-skilled knowledge work. To understand freelancers’ perspectives on how these platforms are disrupting their work we have collected and thematically analysed 528 posts with 7499 comments from four relevant subforums on Reddit. The qualitative findings reveal tensions between wanting autonomy and control and the necessity of opportunities and convenience. Freelancing platforms are perceived as systems that present advantages to find clients, gain experience and mitigate precarity. However, these platforms constrain the control over their work that freelancers value. The paper contributes an improved understanding of freelance work, the role and potential for freelancing platforms in the knowledge-based gig economy, and directions for worker-centred design.",
  "authors": [
    {
      "name": "Juan Carlos Alvarez de la Vega",
      "institution": "Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700584",
      "orcid": "missing"
    },
    {
      "name": "Marta E. Cecchinato",
      "institution": "Northumbria University, United Kingdom",
      "img": "/do/10.1145/contrib-81508705985/rel-imgonly/marta2.jpg",
      "acmid": "81508705985",
      "orcid": "0000-0002-0627-8658"
    },
    {
      "name": "John Rooksby",
      "institution": "Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81330497549",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andalibi, N. 2018. Social support, reciprocity, and anonymity in responses to sexual abuse disclosures on social media. ACM Transactions on Computer-Human Interaction. 25, 5 (2018). DOI: https://doi.org/10.1145/3234942.",
      "doi": "10.1145/3234942"
    },
    {
      "text": "Andalibi, N. 2016. Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity. Conference on Human Factors in Computing Systems - Proceedings. (2016), 3906–3918. DOI: https://doi.org/10.1145/2858036.2858096.",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Anderson, K.E. 2015. Ask me anything: What is reddit? Library Hi Tech News. 32, 5 (2015), 8–11. DOI: https://doi.org/10.1108/LHTN-03-2015-0018.",
      "doi": ""
    },
    {
      "text": "Anwar, M.A. and Graham, M. 2020. Between a rock and a hard place: Freedom, flexibility, precarity and vulnerability in the gig economy in Africa. Competition and Change. (2020), 1–22. DOI: https://doi.org/10.1177/1024529420914473.",
      "doi": ""
    },
    {
      "text": "Ashford, S.J. 2018. From surviving to thriving in the gig economy: A research agenda for individuals in the new world of work. Research in Organizational Behavior. 38, (2018), 23–41. DOI: https://doi.org/10.1016/j.riob.2018.11.001.",
      "doi": ""
    },
    {
      "text": "Balani, S. and De Choudhury, M. 2015. Detecting and characterizing mental health related self-disclosure in social media. Conference on Human Factors in Computing Systems - Proceedings. 18, (2015), 1373–1378. DOI: https://doi.org/10.1145/2702613.2732733.",
      "doi": "10.1145/2702613.2732733"
    },
    {
      "text": "Blaising, A. 2020. Career Trajectories in Online Freelance Platforms. Microsoft Research Virtual Symposium on the New Future of Work (2020), 1–9.",
      "doi": ""
    },
    {
      "text": "Blaising, A. 2020. Making it Work, or Not: A Longitudinal Study of Career Trajectories Among Online Freelancers. ACMHum.-Comput. Interact. 4, CSCW3 (2020), 29.",
      "doi": ""
    },
    {
      "text": "Blaising, A. 2019. Navigating uncertainty in the future of work: Information-seeking and critical events among online freelancers. Conference on Human Factors in Computing Systems - Proceedings. (2019), 1–6. DOI: https://doi.org/10.1145/3290607.3312922.",
      "doi": "10.1145/3290607.3312922"
    },
    {
      "text": "Braun, V. and Clarke, V. 2006. Qualitative Research in Psychology Using thematic analysis in psychology Using thematic analysis in psychology. Qualitative Research in Psychology. 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Braun, V. and Clarke, V. 2013. Successful Qualitative Research: A Practical Guide for Beginners. SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Cecchinato, M.E. 2017. Always On(line)? User experience of smartwatches and their role within multi-device ecologies. Conference on Human Factors in Computing Systems - Proceedings. 2017-May, (2017), 3557–3568. DOI: https://doi.org/10.1145/3025453.3025538.",
      "doi": "10.1145/3025453.3025538"
    },
    {
      "text": "Cecchinato, M.E. 2015. Working 9-5? Professional differences in email and boundary management practices. Conference on Human Factors in Computing Systems - Proceedings. 2015-April, (2015), 3989–3998. DOI: https://doi.org/10.1145/2702123.2702537.",
      "doi": ""
    },
    {
      "text": "Damian, D. and Capatina, A. 2019. Seeking freelancers’ motivations to adopt an entrepreneurial career – a storytelling approach. Proceedings of the International Conference on Business Excellence. 13, 1 (2019), 206–215. DOI: https://doi.org/10.2478/picbe-2019-0019.",
      "doi": ""
    },
    {
      "text": "Dillahunt, T.R. 2017. The Sharing Economy in Computing: A Systematic Literature Review. Proceedings of the ACM on Human-Computer Interaction. 1, CSCW (Dec. 2017), 1–26. DOI: https://doi.org/10.1145/3134673.",
      "doi": "10.1145/3134673"
    },
    {
      "text": "Donovan, S.A. 2016. What Does the Gig Economy Mean for Workers? Congressional Research Service: Report. (2016), 1–16.",
      "doi": ""
    },
    {
      "text": "Dubey, A. 2017. Analyzing gender pay gap in freelancing marketplace. SIGMIS-CPR 2017 - Proceedings of the 2017 ACM SIGMIS Conference on Computers and People Research. (2017), 13–19. DOI: https://doi.org/10.1145/3084381.3084402.",
      "doi": "10.1145/3084381.3084402"
    },
    {
      "text": "Fairwork 2020. The Gig Economy and Covid-19: Fairwork Report on Platform Policies.",
      "doi": ""
    },
    {
      "text": "Foong, E. 2018. Women (still) ask for less: Gender differences in hourly rate in an online labor marketplace. Proceedings of the ACM on Human-Computer Interaction. 2, CSCW (2018). DOI: https://doi.org/10.1145/3274322.",
      "doi": "10.1145/3274322"
    },
    {
      "text": "Fox, S.E. 2020. Worker-Centered Design: Expanding HCI Methods for Supporting Labor. Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2020), 1–8.",
      "doi": ""
    },
    {
      "text": "Franzke, shatki aline 2020. Internet Research: Ethical Guidelines 3.0.",
      "doi": ""
    },
    {
      "text": "Glöss, M. 2016. Designing for Labour. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, May 2016), 1632–1643.",
      "doi": "10.1145/2858036.2858476"
    },
    {
      "text": "Gold, M. and Mustafa, M. 2013. “Work always wins”: Client colonisation, time management and the anxieties of connected freelancers. New Technology, Work and Employment. 28, 3 (2013), 197–211. DOI: https://doi.org/10.1111/ntwe.12017.",
      "doi": ""
    },
    {
      "text": "Graham, M. and Anwar, M.A. 2019. The global gig economy: Towards a planetary labour market? First Monday. 24, 4 (2019). DOI: https://doi.org/10.5210/fm.v24i4.9913.",
      "doi": ""
    },
    {
      "text": "Gray, B. 2020. Made to work: mobilising contemporary worklives. Routledge Taylor & Francis Group.",
      "doi": ""
    },
    {
      "text": "Gray, C.M. 2020. What Kind of Work Do “Asshole Designers” Create? Describing Properties of Ethical Concern on Reddit. Proceedings of the 2020 ACM Designing Interactive Systems Conference (New York, NY, USA, Jul. 2020), 61–73.",
      "doi": "10.1145/3357236.3395486"
    },
    {
      "text": "Gray, M.L. and Suri, S. 2019. Ghost Work: How to Stop Silicon Valley from Building a New Global Underclass. Houghton Mifflin Harcourt.",
      "doi": ""
    },
    {
      "text": "Hannák, A. 2017. Bias in Online freelance marketplaces: Evidence from TaskRabbit and Fiverr. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW. (2017), 1914–1933. DOI: https://doi.org/10.1145/2998181.2998327.",
      "doi": "10.1145/2998181.2998327"
    },
    {
      "text": "Hesmondhalgh, D. and Baker, S. 2010. “A very complicated version of freedom”: Conditions and experiences of creative labour in three cultural industries. Poetics. 38, 1 (2010), 4–20. DOI: https://doi.org/10.1016/j.poetic.2009.10.001.",
      "doi": ""
    },
    {
      "text": "Irani, L.C. and Silberman, M.S. 2013. Turkopticon: Interrupting worker invisibility in Amazon Mechanical Turk. Conference on Human Factors in Computing Systems - Proceedings. (2013), 611–620. DOI: https://doi.org/10.1145/2470654.2470742.",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Jarrahi, M.H. 2020. Platformic Management, Boundary Resources for Gig Work, and Worker Autonomy. Computer Supported Cooperative Work (CSCW). 29, 1–2 (Apr. 2020), 153–189. DOI: https://doi.org/10.1007/s10606-019-09368-7.",
      "doi": "10.1007/s10606-019-09368-7"
    },
    {
      "text": "Jarrahi, M.H. and Sutherland, W. 2019. Algorithmic Management and Algorithmic Competencies: Understanding and Appropriating Algorithms in Gig Work. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). 11420 LNCS, December (2019), 578–589. DOI: https://doi.org/10.1007/978-3-030-15742-5_55.",
      "doi": ""
    },
    {
      "text": "Kasera, J. 2016. Sociality, Tempo & Flow: Learning from Namibian Ride-sharing. Proceedings of the First African Conference on Human Computer Interaction - AfriCHI’16. (2016).",
      "doi": "10.1145/2998581.2998582"
    },
    {
      "text": "Kässi, O. and Lehdonvirta, V. 2018. Online labour index: Measuring the online gig economy for policy and research. Technological Forecasting and Social Change. 137, 1934 (Dec. 2018), 241–248. DOI: https://doi.org/10.1016/j.techfore.2018.07.056.",
      "doi": ""
    },
    {
      "text": "Kinder, E. 2019. Gig Platforms, Tensions, Alliances and Ecosystems. Proceedings of the ACM on Human-Computer Interaction. 3, CSCW (Nov. 2019), 1–26. DOI: https://doi.org/10.1145/3359314.",
      "doi": "10.1145/3359314"
    },
    {
      "text": "Knittel, M.L. and Wash, R. 2019. How “true bitcoiners” work on reddit to maintain bitcoin. Conference on Human Factors in Computing Systems - Proceedings. (2019), 1–6. DOI: https://doi.org/10.1145/3290607.3312969.",
      "doi": "10.1145/3290607.3312969"
    },
    {
      "text": "Kuhn, K.M. and Maleki, A. 2017. Micro-entrepreneurs, dependent contractors, and instaserfs: Understanding online labor platform workforces. Academy of Management Perspectives. 31, 3 (2017), 183–200. DOI: https://doi.org/10.5465/amp.2015.0111.",
      "doi": ""
    },
    {
      "text": "Kumar, N. 2018. Uber in Bangladesh: The Tangled Web of Mobility and Justice. Proceedings of the ACM on Human-Computer Interaction. 2, CSCW (Nov. 2018), 1–21. DOI: https://doi.org/10.1145/3274367.",
      "doi": "10.1145/3274367"
    },
    {
      "text": "Lampinen, A. 2018. Power struggles in the digital economy: Platforms, workers, and markets. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW. (2018), 417–423. DOI: https://doi.org/10.1145/3272973.3273004.",
      "doi": "10.1145/3272973.3273004"
    },
    {
      "text": "Lascau, L. 2019. Monotasking or multitasking: Designing for crowdworkers’ preferences. Conference on Human Factors in Computing Systems - Proceedings (2019).",
      "doi": "10.1145/3290605.3300649"
    },
    {
      "text": "Lazar, A. 2019. Parting the Red Sea: Sociotechnical Systems and Lived Experiences of Menopause. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19 (New York, New York, USA, May 2019), 1–16.",
      "doi": "10.1145/3290605.3300710"
    },
    {
      "text": "Lee, M.K. 2015. Working with machines: The impact of algorithmic and data-driven management on human workers. Conference on Human Factors in Computing Systems - Proceedings. 2015-April, (2015), 1603–1612. DOI: https://doi.org/10.1145/2702123.2702548.",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Lustig, C. 2020. Stuck in the middle with you: The Transaction Costs of Corporate Employees Hiring Freelancers. Proceedings of the ACM on Human-Computer Interaction. 4, CSCW1 (2020), 1–28. DOI: https://doi.org/10.1145/3392842.",
      "doi": "10.1145/3392842"
    },
    {
      "text": "Margaryan, A. 2019. Workplace learning in crowdwork: Comparing microworkers’ and online freelancers’ practices. Journal of Workplace Learning. 31, 4 (2019), 250–273. DOI: https://doi.org/10.1108/JWL-10-2018-0126.",
      "doi": ""
    },
    {
      "text": "Martin, D. 2014. Being a turker. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW. (2014), 224–235. DOI: https://doi.org/10.1145/2531602.2531663.",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Martin, D. 2016. Turking in a Global Labour Market. Computer Supported Cooperative Work: CSCW: An International Journal. 25, 1 (2016), 39–77. DOI: https://doi.org/10.1007/s10606-015-9241-6.",
      "doi": "10.1007/s10606-015-9241-6"
    },
    {
      "text": "Massey, B.L. and Elmore, C.J. 2011. Happier working for themselves?: Job satisfaction and women freelance journalists. Journalism Practice. 5, 6 (2011), 672–686. DOI: https://doi.org/10.1080/17512786.2011.579780.",
      "doi": ""
    },
    {
      "text": "Möhlmann, M. and Zalmanson, L. 2017. Hands on the Wheel: Navigating Algorithmic Management and Uber Drivers’ Autonomy. ICIS 2017: Transforming Society with Digital Innovation (Seoul, South Korea, 2017).",
      "doi": ""
    },
    {
      "text": "Nardi, B.A. 2002. NetWORKers and their Activity in Intensional Networks. Computer Supported Cooperative Work (CSCW). 11, 1–2 (Mar. 2002), 205–242. DOI: https://doi.org/10.1023/A:1015241914483.",
      "doi": "10.1023/A%3A1015241914483"
    },
    {
      "text": "Nemkova, E. 2019. In search of meaningful work on digital freelancing platforms: the case of design professionals. New Technology, Work and Employment. 34, 3 (2019), 226–243. DOI: https://doi.org/10.1111/ntwe.12148.",
      "doi": ""
    },
    {
      "text": "NVivo 12: https://www.qsrinternational.com/nvivo-qualitative-data-analysis-software/about/nvivo.",
      "doi": ""
    },
    {
      "text": "Pongratz, H.J. 2018. Of crowds and talents: discursive constructions of global online labour. New Technology, Work and Employment. 33, 1 (2018), 58–73. DOI: https://doi.org/10.1111/ntwe.12104.",
      "doi": ""
    },
    {
      "text": "Pushshift Reddit API Documentation: 2019. https://github.com/pushshift/api. Accessed: 2020-02-10.",
      "doi": ""
    },
    {
      "text": "Ratings in the Gig Economy Are a Mess. Here's How to Fix Them.: 2017. .",
      "doi": ""
    },
    {
      "text": "Razi, A. 2020. Let's Talk about Sext: How Adolescents Seek Support and Advice about Their Online Sexual Experiences. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. (2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Reddit, Inc.: https://www.redditinc.com. Accessed: 2019-11-15.",
      "doi": ""
    },
    {
      "text": "Reddit API: https://www.reddit.com/dev/api. Accessed: 2019-11-15.",
      "doi": ""
    },
    {
      "text": "Reddit Privacy Policy: 2018. https://www.redditinc.com/policies/privacy-policy. Accessed: 2019-11-20.",
      "doi": ""
    },
    {
      "text": "Rosenblat, A. and Stark, L. 2016. Algorithmic labor and information asymmetries: A case study of Uber's drivers. International Journal of Communication. 10, (2016), 3758–3784. DOI: https://doi.org/10.2139/ssrn.2686227.",
      "doi": ""
    },
    {
      "text": "Sadler, K. 2006. Balancing work, life and other concerns: A study of mobile technology use by Australian freelancers. ACM International Conference Proceeding Series. 189, October 2006 (2006), 413–416. DOI: https://doi.org/10.1145/1182475.1182525.",
      "doi": "10.1145/1182475.1182525"
    },
    {
      "text": "Sadler, K. 2006. “It's always there, it's always on”: Australian freelancer's management of availability using mobile technologies. ACM International Conference Proceeding Series. 159, (2006), 49–52. DOI: https://doi.org/10.1145/1152215.1152226.",
      "doi": "10.1145/1152215.1152226"
    },
    {
      "text": "Shevchuk, A. 2019. The Autonomy Paradox: How Night Work Undermines Subjective Well-Being of Internet-Based Freelancers. ILR Review. 72, 1 (2019), 75–100. DOI: https://doi.org/10.1177/0019793918767114.",
      "doi": ""
    },
    {
      "text": "Smedley, R.M. and Coulson, N.S. 2018. A practical guide to analysing online support forums. Qualitative Research in Psychology. 00, 00 (2018), 1–28. DOI: https://doi.org/10.1080/14780887.2018.1475532.",
      "doi": ""
    },
    {
      "text": "Stefano, V. de 2016. The rise of the “just-in-time workforce”: On-demand work, crowdwork and labour protection in the “gig economy.”",
      "doi": ""
    },
    {
      "text": "Sutherland, W. 2019. Work Precarity and Gig Literacies in Online Freelancing. Work, Employment and Society. October (2019). DOI: https://doi.org/10.1177/0950017019886511.",
      "doi": ""
    },
    {
      "text": "Sutherland, W. and Jarrahi, M.H. 2018. The sharing economy and digital platforms: A review and research agenda. International Journal of Information Management. 43, February (2018), 328–341. DOI: https://doi.org/10.1016/j.ijinfomgt.2018.07.004.",
      "doi": ""
    },
    {
      "text": "The Coronavirus Pandemic Is Driving Huge Growth In Remote Freelance Work: 2020. https://www.forbes.com/sites/jonyounger/2020/03/29/this-pandemic-is-driving-huge-growth-in-remote-freelance-work/#453bb9ac7747. Accessed: 2020-08-18.",
      "doi": ""
    },
    {
      "text": "Ticona, J. 2018. Beyond Disruption How Tech Shapes Labor Across Domestic Work & Ridehailing.",
      "doi": ""
    },
    {
      "text": "Waters, F. and Woodcock, J. 2017. Far From Seamless: a Workers’ Inquiry at Deliveroo. Viewpoint Magazine.",
      "doi": ""
    },
    {
      "text": "White, K. 2015. Freelancing – Are you ready to go solo? Medical Writing. 24, 3 (2015), 140–144. DOI: https://doi.org/10.1179/2047480615z.000000000309.",
      "doi": ""
    },
    {
      "text": "Williams, A.C. 2019. The Perpetual Work Life of Crowdworkers: How Tooling Practices Increase Fragmentation in Crowdwork. Proc. ACM Hum.-Comput. Interact. 3, November (2019). DOI: https://doi.org/10.1145/3359126.",
      "doi": "10.1145/3359126"
    },
    {
      "text": "Wood, A.J. 2019. Good Gig, Bad Gig: Autonomy and Algorithmic Control in the Global Gig Economy. Work, Employment and Society. 33, 1 (2019), 56–75. DOI: https://doi.org/10.1177/0950017018785616.",
      "doi": ""
    },
    {
      "text": "Wood, A.J. 2018. Workers of the Internet unite? Online freelancer organisation among remote gig economy workers in six Asian and African countries. New Technology, Work and Employment. 33, 2 (2018), 95–112. DOI: https://doi.org/10.1111/ntwe.12112.",
      "doi": ""
    },
    {
      "text": "Woodcock, J. and Graham, M. 2020. The Gig Economy: A Critical Introduction. Polity Press.",
      "doi": ""
    },
    {
      "text": "Zimmerman, J. 2014. Workers as a Service The End of Employers? International Association of Societies of Design Research. April 2016 (2014), 1–12.",
      "doi": ""
    }
  ]
}