{
  "doi": "10.1145/3411764.3445786",
  "title": "MorpheesPlug: A Toolkit for Prototyping Shape-Changing Interfaces",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Toolkits for shape-changing interfaces (SCIs) enable designers and researchers to easily explore the broad design space of SCIs. However, despite their utility, existing approaches are often limited in the number of shape-change features they can express. This paper introduces MorpheesPlug , a toolkit for creating SCIs that covers seven of the eleven shape-change features identified in the literature. MorpheesPlug is comprised of (1) a set of six standardized widgets that express the shape-change features with user-definable parameters; (2) software for 3D-modeling the widgets to create 3D-printable pneumatic SCIs; and (3) a hardware platform to control the widgets. To evaluate MorpheesPlug we carried out ten open-ended interviews with novice and expert designers who were asked to design a SCI using our software. Participants highlighted the ease of use and expressivity of the MorpheesPlug.",
  "authors": [
    {
      "name": "Hyunyoung Kim",
      "institution": "University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-99659083586/rel-imgonly/square.jpeg",
      "acmid": "99659083586",
      "orcid": "missing"
    },
    {
      "name": "Aluna Everitt",
      "institution": "University of Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-99659021328/rel-imgonly/photo.png",
      "acmid": "99659021328",
      "orcid": "missing"
    },
    {
      "name": "Carlos Tejada",
      "institution": "Department of Computer Science University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-99659068879/rel-imgonly/99659068879.jpeg",
      "acmid": "99659068879",
      "orcid": "missing"
    },
    {
      "name": "Mengyu Zhong",
      "institution": "Human-centered computation University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702232",
      "orcid": "missing"
    },
    {
      "name": "Daniel Ashbrook",
      "institution": "Department of Computer Science University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81100147905/rel-imgonly/me-in-bw-new-crop2-small.jpg",
      "acmid": "81100147905",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Parastoo Abtahi and Sean Follmer. 2018. Visuo-Haptic Illusions for Improving the Perceived Performance of Shape Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173724",
      "doi": "10.1145/3173574.3173724"
    },
    {
      "text": "Jason Alexander, Anne Roudaut, Jürgen Steimle, Kasper Hornbæk, Miguel Bruns Alonso, Sean Follmer, and Timothy Merritt. 2018. Grand Challenges in Shape-Changing Interface Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 299, 14 pages. https://doi.org/10.1145/3173574.3173873",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "Ayah Bdeir. 2009. Electronics as Material: littleBits. In Proceedings of the Third International Conference on Tangible and Embedded Interaction (TEI’09). ACM, New York, New York, USA, 397–400. https://doi.org/10.1145/1517664.1517743",
      "doi": "10.1145/1517664.1517743"
    },
    {
      "text": "Federico Carpi, Claudio Salaris, and Danilo De Rossi. 2007. Folded dielectric elastomer actuators. Smart Materials and Structures 16, 2 (mar 2007), S300–S305. https://doi.org/10.1088/0964-1726/16/2/s15",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho and Pattie Maes. 2009. Shutters: A Permeable Surface for Environmental Control and Communication. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction(Cambridge, United Kingdom) (TEI ’09). Association for Computing Machinery, New York, NY, USA, 13–18. https://doi.org/10.1145/1517664.1517671",
      "doi": "10.1145/1517664.1517671"
    },
    {
      "text": "Aluna Everitt and Jason Alexander. 2017. PolySurface: a design approach for rapid prototyping of shape-changing displays using semi-solid surfaces. In Proceedings of the 2017 Conference on Designing Interactive Systems. 1283–1294.",
      "doi": "10.1145/3064663.3064677"
    },
    {
      "text": "Aluna Everitt, Faisal Taher, and Jason Alexander. 2016. ShapeCanvas: An Exploration of Shape-Changing Content Generation by Members of the Public. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2778–2782. https://doi.org/10.1145/2858036.2858316",
      "doi": "10.1145/2858036.2858316"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Nadia Cheng, and Hiroshi Ishii. 2012. Jamming User Interfaces: Programmable Particle Stiffness and Sensing for Malleable and Shape-Changing Devices. In UIST ’12: Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology. ACM Press, New York, New York, USA, 519–528. https://doi.org/10.1145/2380116.2380181",
      "doi": "10.1145/2380116.2380181"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. InFORM: Dynamic Physical Affordances and Constraints through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 417–426. https://doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Saul Greenberg. 2007. Toolkits and interface creativity. Multimedia Tools and Applications 32, 2 (01 Feb 2007), 139–159. https://doi.org/10.1007/s11042-006-0062-y",
      "doi": ""
    },
    {
      "text": "Saul Greenberg and Chester Fitchett. 2001. Phidgets: Easy Development of Physical Interfaces through Physical Widgets. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology - UIST ’01. ACM Press, Orlando, Florida, 209. https://doi.org/10.1145/502348.502388",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Joseph N Grima and Kenneth E Evans. 2006. Auxetic behavior from rotating triangles. Journal of materials science 41, 10 (2006), 3193–3196.",
      "doi": ""
    },
    {
      "text": "Erik Grönvall, Sofie Kinch, Marianne Graves Petersen, and Majken K. Rasmussen. 2014. Causing Commotion with a Shape-Changing Bench: Experiencing Shape-Changing Interfaces in Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2559–2568. https://doi.org/10.1145/2556288.2557360",
      "doi": "10.1145/2556288.2557360"
    },
    {
      "text": "John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. 2015. ShapeClip: Towards Rapid Prototyping with Shape-Changing Displays for Designers. In CHI ’15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA, 19–28. https://doi.org/10.1145/2702123.2702599",
      "doi": "10.1145/2702123.2702599"
    },
    {
      "text": "John Hardy, Christian Weichel, Faisal Taher, John Vidler, and Jason Alexander. 2015. ShapeClip: Towards Rapid Prototyping with Shape-Changing Displays for Designers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 19–28. https://doi.org/10.1145/2702123.2702599",
      "doi": "10.1145/2702123.2702599"
    },
    {
      "text": "Chris Harrison and Scott E. Hudson. 2009. Providing Dynamically Changeable Physical Buttons on a Visual Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’09). Association for Computing Machinery, Boston, MA, USA, 299–308. https://doi.org/10.1145/1518701.1518749",
      "doi": "10.1145/1518701.1518749"
    },
    {
      "text": "Björn Hartmann, Leith Abdulla, and Scott Klemmer. 2007. Authoring Sensor-Based Interactions by Demonstration with Direct Manipulation and Pattern Recognition. In CHI ’07: Proceeding of the Twenty-Fifth Annual SIGCHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": "10.1145/1240624.1240646"
    },
    {
      "text": "Steve Hodges, Nicolas Villar, Nicholas Chen, Tushar Chugh, Jie Qi, Diana Nowacka, and Yoshihiro Kawahara. 2014. Circuit Stickers: Peel-and-Stick Construction of Interactive Electronic Prototypes. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems - CHI ’14. ACM Press, Toronto, Ontario, Canada, 1743–1746. https://doi.org/10.1145/2556288.2557150",
      "doi": "10.1145/2556288.2557150"
    },
    {
      "text": "Larry L Howell. 2013. Compliant mechanisms. In 21st century kinematics. Springer, 189–216.",
      "doi": ""
    },
    {
      "text": "Hyunyoung Kim, Celine Coutrix, and Anne Roudaut. 2018. Morphees+: Studying Everyday Reconfigurable Objects for the Design and Taxonomy of Reconfigurable UIs. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 619, 14 pages. https://doi.org/10.1145/3173574.3174193",
      "doi": "10.1145/3173574.3174193"
    },
    {
      "text": "Hyunyoung Kim, Céline Coutrix, and Anne Roudaut. 2019. KnobSlider: Design of a Shape-Changing Parameter Control UI and Study of User Preferences on Its Speed and Tangibility. Frontiers in Robotics and AI 6 (2019), 79. https://doi.org/10.3389/frobt.2019.00079",
      "doi": ""
    },
    {
      "text": "Seoktae Kim, Hyunjung Kim, Boram Lee, Tek-Jin Nam, and Woohun Lee. 2008. Inflatable Mouse: Volume-Adjustable Mouse with Air-Pressure-Sensitive Input and Haptic Feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 211–224. https://doi.org/10.1145/1357054.1357090",
      "doi": "10.1145/1357054.1357090"
    },
    {
      "text": "Seoktae Kim, Hyunjung Kim, Boram Lee, Tek-Jin Nam, and Woohun Lee. 2008. Inflatable Mouse: Volume-Adjustable Mouse with Air-Pressure-Sensitive Input and Haptic Feedback. In Proceeding of the Twenty-Sixth Annual CHI Conference Extended Abstracts. ACM, New York, New York, USA, 211–224. https://doi.org/10.1145/1357054.1357090",
      "doi": "10.1145/1357054.1357090"
    },
    {
      "text": "David Ledo, Fraser Anderson, Ryan Schmidt, Lora Oehlberg, Saul Greenberg, and Tovi Grossman. 2017. Pineal: Bringing Passive Objects to Life with Embedded Mobile Devices. In CHI ’17: Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA, 2583–2593. https://doi.org/10.1145/3025453.3025652",
      "doi": "10.1145/3025453.3025652"
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation Strategies for HCI Toolkit Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 36, 17 pages. https://doi.org/10.1145/3173574.3173610",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "Jun-Young Lee, Jaemin Eom, Woo-Young Choi, and Kyu-Jin Cho. 2018. Soft LEGO: Bottom-Up Design Platform for Soft Robotics. In 2018 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 7513–7520. https://doi.org/10.1109/IROS.2018.8593546",
      "doi": "10.1109/IROS.2018.8593546"
    },
    {
      "text": "John C. McClelland, Robert J. Teather, and Audrey Girouard. 2017. Haptobend: Shape-Changing Passive Haptic Feedback in Virtual Reality. In Proceedings of the 5th Symposium on Spatial User Interaction (Brighton, United Kingdom) (SUI ’17). Association for Computing Machinery, New York, NY, USA, 82–90. https://doi.org/10.1145/3131277.3132179",
      "doi": "10.1145/3131277.3132179"
    },
    {
      "text": "Hedieh Moradi and César Torres. 2020. Siloseam: A Morphogenetic Workflow for the Design and Fabrication of Inflatable Silicone Bladders. In Proceedings of the 2020 ACM on Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 1995–2006. https://doi.org/10.1145/3357236.3395473",
      "doi": "10.1145/3357236.3395473"
    },
    {
      "text": "Hedieh Moradi and César Torres. 2020. Siloseam: A Morphogenetic Workflow for the Design and Fabrication of Inflatable Silicone Bladders. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ’20). Association for Computing Machinery, Eindhoven, Netherlands, 1995–2006. https://doi.org/10.1145/3357236.3395473",
      "doi": "10.1145/3357236.3395473"
    },
    {
      "text": "Brad A Myers, Scott E Hudson, and Randy Pausch. 2000. Past, Present, and Future of User Interface Software Tools. ACM Transactions on Computer-Human Interaction (TOCHI 7, 1 (March 2000), 3–28. https://doi.org/10.1145/344949.344959",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Ken Nakagaki, Artem Dementyev, Sean Follmer, Joseph A Paradiso, and Hiroshi Ishii. 2016. ChainFORM: a linear integrated modular hardware system for shape changing interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 87–96.",
      "doi": "10.1145/2984511.2984587"
    },
    {
      "text": "Ken Nakagaki, Sean Follmer, and Hiroshi Ishii. 2015. LineFORM: Actuated Curve Interfaces for Display, Interaction, and Constraint. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology(Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 333–339. https://doi.org/10.1145/2807442.2807452",
      "doi": "10.1145/2807442.2807452"
    },
    {
      "text": "Ken Nakagaki, Luke Vink, Jared Counts, Daniel Windham, Daniel Leithinger, Sean Follmer, and Hiroshi Ishii. 2016. Materiable: Rendering Dynamic Material Properties in Response to Direct Physical Touch with Shape Changing Interfaces. In CHI ’16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, 2764–2772. https://doi.org/10.1145/2858036.2858104",
      "doi": "10.1145/2858036.2858104"
    },
    {
      "text": "Dan R Olsen. 2007. Evaluating User Interface Systems Research. In UIST ’07: Proceedings of the 20th Annual ACM Symposium on User Interface Software and Technology. New York, New York, USA, 251–258. https://doi.org/10.1145/1294211.1294256",
      "doi": "10.1145/1294211.1294256"
    },
    {
      "text": "Jifei Ou, Mélina Skouras, Nikolaos Vlavianos, Felix Heibeck, Chin-Yi Cheng, Jannik Peters, and Hiroshi Ishii. 2016. AeroMorph - Heat-Sealing Inflatable Shape-Change Materials for Interaction Design. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 121–132. https://doi.org/10.1145/2984511.2984520",
      "doi": "10.1145/2984511.2984520"
    },
    {
      "text": "Amanda Parkes and Hiroshi Ishii. 2010. Bosu: A Physical Programmable Design Tool for Transformability with Soft Mechanics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (Aarhus, Denmark) (DIS ’10). Association for Computing Machinery, New York, NY, USA, 189–198. https://doi.org/10.1145/1858171.1858205",
      "doi": "10.1145/1858171.1858205"
    },
    {
      "text": "D. Prattichizzo, M. Malvezzi, I. Hussain, and G. Salvietti. 2014. The Sixth-Finger: A modular extra-finger to enhance human hand capabilities. In The 23rd IEEE International Symposium on Robot and Human Interactive Communication. 993–998.",
      "doi": ""
    },
    {
      "text": "Hayes Solos Raffle, Amanda J Parkes, and Hiroshi Ishii. 2004. Topobo: A Constructive Assembly System with Kinetic Memory. In CHI ’04: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, New York, USA, 647–654. https://doi.org/10.1145/985692.985774",
      "doi": "10.1145/985692.985774"
    },
    {
      "text": "Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: An Integrated Approach for Embedding Electronics in Paper Designs. In CHI ’15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA, 2457–2466. https://doi.org/10.1145/2702123.2702487",
      "doi": "10.1145/2702123.2702487"
    },
    {
      "text": "Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: Toward High ”Shape Resolution” in Self-Actuated Flexible Mobile Devices. In CHI ’13: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA, 593–602. https://doi.org/10.1145/2470654.2470738",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "Harpreet Sareen, Udayan Umapathi, Patrick Shin, Yasuaki Kakehi, Jifei Ou, Hiroshi Ishii, and Pattie Maes. 2017. Printflatables: Printing Human-Scale, Functional and Dynamic Inflatable Objects. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3669–3680. https://doi.org/10.1145/3025453.3025898",
      "doi": "10.1145/3025453.3025898"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: Fabricating Custom Capacitive Touch Sensors to Prototype Interactive Objects. In UIST ’12: Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology. ACM Press, New York, New York, USA, 579. https://doi.org/10.1145/2380116.2380189",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Pao Siangliulue, Kenneth C. Arnold, Krzysztof Z. Gajos, and Steven P. Dow. 2015. Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 937–945. https://doi.org/10.1145/2675133.2675239",
      "doi": "10.1145/2675133.2675239"
    },
    {
      "text": "Miriam Sturdee and Jason Alexander. 2018. Analysis and Classification of Shape-Changing Interfaces for Design and Application-Based Research. ACM Computing Surveys (CSUR) 51, 1 (April 2018), 2–32. https://doi.org/10.1145/3143559",
      "doi": "10.1145/3143559"
    },
    {
      "text": "F. Taher, Y. Jansen, J. Woodruff, J. Hardy, K. Hornbæk, and J. Alexander. 2017. Investigating the Use of a Dynamic Physical Bar Chart for Data Exploration and Presentation. IEEE Transactions on Visualization and Computer Graphics 23, 1(2017), 451–460.",
      "doi": "10.1109/TVCG.2016.2598498"
    },
    {
      "text": "Yasaman Tahouni, Isabel P. S. Qamar, and Stefanie Mueller. 2020. NURBSforms: A Modular Shape-Changing Interface for Prototyping Curved Surfaces. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (Sydney NSW, Australia) (TEI ’20). Association for Computing Machinery, New York, NY, USA, 403–409. https://doi.org/10.1145/3374920.3374927",
      "doi": "10.1145/3374920.3374927"
    },
    {
      "text": "John Tiab and Kasper Hornbæk. 2016. Understanding Affordance, System State, and Feedback in Shape-Changing Buttons. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2752–2763. https://doi.org/10.1145/2858036.2858350",
      "doi": "10.1145/2858036.2858350"
    },
    {
      "text": "Marynel Vázquez, Eric Brockmeyer, Ruta Desai, Chris Harrison, and Scott E Hudson. 2015. 3D Printing Pneumatic Device Controls with Variable Activation Force Capabilities. In CHI ’15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM Press, New York, New York, USA, 1295–1304. https://doi.org/10.1145/2702123.2702569",
      "doi": "10.1145/2702123.2702569"
    },
    {
      "text": "N Villar, J Scott, S Hodges, K Hammil, and C Miller. 2012. .NET Gadgeteer: A Platform for Custom Devices. In Pervasive Computing. Springer Berlin Heidelberg, 216–233. https://doi.org/10.1007/978-3-642-31205-2_14",
      "doi": ""
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In UIST ’13 Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology. ACM, New York, New York, USA, 13–22. https://doi.org/10.1145/2501988.2502037",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Hong Kai Yap, Hui Yong Ng, and Chen-Hua Yeow. 2016. High-Force Soft Printable Pneumatics for Soft Robotic Applications. Soft Robotics 3, 3 (Sept. 2016), 144–158. https://doi.org/10.1089/soro.2016.0030",
      "doi": ""
    }
  ]
}