{
  "doi": "10.1145/3411764.3445613",
  "title": "ClothTiles: A Prototyping Platform to Fabricate Customized Actuators on Clothing using 3D Printing and Shape-Memory Alloys",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Emerging research has demonstrated the viability of on-textile actuation mechanisms, however, an easily customizable and versatile on-cloth actuation mechanism is yet to be explored. In this paper, we present ClothTiles along with its rapid fabrication technique that enables actuation of clothes. ClothTiles leverage flexible 3D-printing and Shape-Memory Alloys (SMAs) alongside new parametric actuation designs. We validate the concept of fabric actuation using a base element, and then systematically explore methods of aggregating, scaling, and orienting prospects for extended actuation in garments. A user study demonstrated that our technique enables multiple actuation types applied across a variety of clothes. Users identified both aesthetic and functional applications of ClothTiles. We conclude with a number of insights for the Do-It-Yourself community on how to employ 3D-printing with SMAs to enable actuation on clothes.",
  "tags": [
    "Do-It-Yourself",
    "Textile",
    "Actuation",
    "Shape-memory Alloy",
    "Clothing",
    "Smart Textiles"
  ],
  "authors": [
    {
      "name": "Sachith Muthukumarana",
      "institution": "Augmented Human Lab, Auckland Bioengineering Institute The University of Auckland, New Zealand",
      "img": "/do/10.1145/contrib-99659133087/rel-imgonly/sachithpp3_-_copy.jpg",
      "acmid": "99659133087",
      "orcid": "missing"
    },
    {
      "name": "Moritz Alexander Messerschmidt",
      "institution": "Augmented Human Lab Auckland Bioengineering Institute, The University of Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702089",
      "orcid": "missing"
    },
    {
      "name": "Denys J.C. Matthies",
      "institution": "Technical University of Applied Sciences Lübeck, Germany",
      "img": "/do/10.1145/contrib-81548327356/rel-imgonly/citations.jpg",
      "acmid": "81548327356",
      "orcid": "missing"
    },
    {
      "name": "Jürgen Steimle",
      "institution": "Saarland University, Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613099",
      "orcid": "0000-0003-3493-8745"
    },
    {
      "name": "Philipp M. Scholl",
      "institution": "Augmented Human Lab, Auckland Bioengineering Institute The University of Auckland, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702485",
      "orcid": "missing"
    },
    {
      "name": "Suranga Nanayakkara",
      "institution": "Augmented Human Lab Auckland Bioengineering Institute, The University of Auckland, New Zealand",
      "img": "/do/10.1145/contrib-81416609140/rel-imgonly/_mg_5811-uoa.jpg",
      "acmid": "81416609140",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Roland Aigner, Andreas Pointner, Thomas Preindl, Patrick Parzer, and Michael Haller. 2020. Embroidered Resistive Pressure Sensors: A Novel Approach for Textile Interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376305",
      "doi": "10.1145/3313831.3376305"
    },
    {
      "text": "Lea Albaugh, Scott Hudson, and Lining Yao. 2019. Digital Fabrication of Soft Actuated Objects by Machine Knitting. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland UK) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3290607.3313270",
      "doi": "10.1145/3290607.3313270"
    },
    {
      "text": "Guido Belforte, Gabriella Eula, Alexandre Ivanov, and Silvia Sirolli. 2014. Soft pneumatic actuators for rehabilitation. Actuators 3, 2 (2014), 84–106.",
      "doi": ""
    },
    {
      "text": "Matthias Berning, Florian Braun, Till Riedel, and Michael Beigl. 2015. ProximityHat: A Head-Worn System for Subtle Sensory Augmentation with Tactile Stimulation. In Proceedings of the 2015 ACM International Symposium on Wearable Computers (Osaka, Japan) (ISWC ’15). Association for Computing Machinery, New York, NY, USA, 31–38. https://doi.org/10.1145/2802083.2802088",
      "doi": "10.1145/2802083.2802088"
    },
    {
      "text": "Leonardo Cappello, Kevin C Galloway, Siddharth Sanan, Diana A Wagner, Rachael Granberry, Sven Engelhardt, Florian L Haufe, Jeffrey D Peisner, and Conor J Walsh. 2018. Exploiting textile mechanical anisotropy for fabric-based pneumatic actuators. Soft robotics 5, 5 (2018), 662–674.",
      "doi": ""
    },
    {
      "text": "George Chernyshov, Benjamin Tag, Cedric Caremel, Feier Cao, Gemma Liu, and Kai Kunze. 2018. Shape Memory Alloy Wire Actuators for Soft, Wearable Haptic Devices. In Proceedings of the 2018 ACM International Symposium on Wearable Computers (Singapore, Singapore) (ISWC ’18). Association for Computing Machinery, New York, NY, USA, 112–119. https://doi.org/10.1145/3267242.3267257",
      "doi": "10.1145/3267242.3267257"
    },
    {
      "text": "Marcelo Coelho and Pattie Maes. 2008. Sprout I/O: A Texturally Rich Interface. In Proceedings of the 2nd International Conference on Tangible and Embedded Interaction (Bonn, Germany) (TEI ’08). Association for Computing Machinery, New York, NY, USA, 221–222. https://doi.org/10.1145/1347390.1347440",
      "doi": "10.1145/1347390.1347440"
    },
    {
      "text": "Artem Dementyev, Tomás Vega Gálvez, and Alex Olwal. 2019. SensorSnaps: Integrating Wireless Sensor Nodes into Fabric Snap Fasteners for Textile Interfaces. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 17–28. https://doi.org/10.1145/3332165.3347913",
      "doi": "10.1145/3332165.3347913"
    },
    {
      "text": "Jiachun Du, Panos Markopoulos, Qi Wang, Marina Toeters, and Ting Gong. 2018. ShapeTex: Implementing Shape-Changing Structures in Fabric for Wearable Actuation. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (Stockholm, Sweden) (TEI ’18). Association for Computing Machinery, New York, NY, USA, 166–176. https://doi.org/10.1145/3173225.3173245",
      "doi": "10.1145/3173225.3173245"
    },
    {
      "text": "Don Samitha Elvitigala, Denys J.C. Matthies, Löic David, Chamod Weerasinghe, and Suranga Nanayakkara. 2019. GymSoles: Improving Squats and Dead-Lifts by Visualizing the User’s Center of Pressure. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300404",
      "doi": "10.1145/3290605.3300404"
    },
    {
      "text": "Jack Forman, Taylor Tabb, Youngwook Do, Meng-Han Yeh, Adrian Galvin, and Lining Yao. 2019. ModiFiber: Two-Way Morphing Soft Thread Actuators for Tangible Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300890",
      "doi": "10.1145/3290605.3300890"
    },
    {
      "text": "FreeCAD. 2020. Open source 3D parametric modeler. FreeCAD. https://www.freecadweb.org/",
      "doi": ""
    },
    {
      "text": "Maas Goudswaard, Abel Abraham, Bruna Goveia da Rocha, Kristina Andersen, and Rong-Hao Liang. 2020. FabriClick: Interweaving Pushbuttons into Fabrics Using 3D Printing and Digital Embroidery. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 379–393. https://doi.org/10.1145/3357236.3395569",
      "doi": "10.1145/3357236.3395569"
    },
    {
      "text": "Thomas Grah, Felix Epp, Martin Wuchse, Alexander Meschtscherjakov, Frank Gabler, Arnd Steinmetz, and Manfred Tscheligi. 2015. Dorsal Haptic Display: A Shape-Changing Car Seat for Sensory Augmentation of Rear Obstacles. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(Nottingham, United Kingdom) (AutomotiveUI ’15). Association for Computing Machinery, New York, NY, USA, 305–312. https://doi.org/10.1145/2799250.2799281",
      "doi": "10.1145/2799250.2799281"
    },
    {
      "text": "Jianglong Guo, Chaoqun Xiang, Tim Helps, Majid Taghavi, and Jonathan Rossiter. 2018. Electroactive textile actuators for wearable and soft robots. In 2018 IEEE International Conference on Soft Robotics (RoboSoft). IEEE, Livorno, Italy, 339–343.",
      "doi": ""
    },
    {
      "text": "Aakar Gupta, Antony Albert Raj Irudayaraj, and Ravin Balakrishnan. 2017. HapticClench: Investigating Squeeze Sensations Using Memory Alloys. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 109–117. https://doi.org/10.1145/3126594.3126598",
      "doi": "10.1145/3126594.3126598"
    },
    {
      "text": "Nur Al-huda Hamdan, Adrian Wagner, Simon Voelker, Jürgen Steimle, and Jan Borchers. 2019. Springlets: Expressive, Flexible and Silent On-Skin Tactile Interfaces. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300718",
      "doi": "10.1145/3290605.3300718"
    },
    {
      "text": "Cedric Honnet, Hannah Perner-Wilson, Marc Teyssier, Bruno Fruchard, Jürgen Steimle, Ana C. Baptista, and Paul Strohmeier. 2020. PolySense: Augmenting Textiles with Electrical Functionality Using In-Situ Polymerization. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376841",
      "doi": "10.1145/3313831.3376841"
    },
    {
      "text": "Mohammad Mahdi Kheirikhah, Samaneh Rabiee, and Mohammad Ehsan Edalat. 2010. A review of shape memory alloy actuators in robotics. In Robot Soccer World Cup. Springer, Berlin, Heidelberg, 206–217.",
      "doi": ""
    },
    {
      "text": "Ali Kiaghadi, Morgan Baima, Jeremy Gummeson, Trisha Andrew, and Deepak Ganesan. 2018. Fabric as a Sensor: Towards Unobtrusive Sensing of Human Behavior with Triboelectric Textiles. In Proceedings of the 16th ACM Conference on Embedded Networked Sensor Systems (Shenzhen, China) (SenSys ’18). Association for Computing Machinery, New York, NY, USA, 199–210. https://doi.org/10.1145/3274783.3274845",
      "doi": "10.1145/3274783.3274845"
    },
    {
      "text": "Espen Knoop and Jonathan Rossiter. 2015. The Tickler: A Compliant Wearable Tactile Display for Stroking and Tickling. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 1133–1138. https://doi.org/10.1145/2702613.2732749",
      "doi": "10.1145/2702613.2732749"
    },
    {
      "text": "Masahiro Koge, Daichi Ogawa, Seiya Takei, Yuriko Nakai, Taira Nakamura, Takuto Nakamura, Ryuta Okazaki, Taku Hachisu, Michi Sato, and Hiroyuki Kajimoto. 2014. Haptic Bed: Bed-Style Haptic Display for Providing Weight Sensation. In Proceedings of the 11th Conference on Advances in Computer Entertainment Technology (Funchal, Portugal) (ACE ’14). Association for Computing Machinery, New York, NY, USA, Article 47, 4 pages. https://doi.org/10.1145/2663806.2663861",
      "doi": "10.1145/2663806.2663861"
    },
    {
      "text": "Michael Korger, Alexandra Glogowsky, Silke Sanduloff, Christine Steinem, Sofie Huysman, Bettina Horn, Michael Ernst, and Maike Rabe. 2020. Testing thermoplastic elastomers selected as flexible three-dimensional printing materials for functional garment and technical textile applications. Journal of Engineered Fibers and Fabrics 15 (2020), 1558925020924599.",
      "doi": ""
    },
    {
      "text": "Peter Krulevitch, Abraham P Lee, Philip B Ramsey, James C Trevino, Julie Hamilton, and M Allen Northrup. 1996. Thin film shape memory alloy microactuators. Journal of microelectromechanical systems 5, 4 (1996), 270–282.",
      "doi": ""
    },
    {
      "text": "Kristi Kuusk, Aleksander Väljamäe, and Ana Tajadura-Jiménez. 2018. Magic Lining: An Exploration of Smart Textiles Altering People’s Self-Perception. In Proceedings of the 5th International Conference on Movement and Computing (Genoa, Italy) (MOCO ’18). Association for Computing Machinery, New York, NY, USA, Article 47, 6 pages. https://doi.org/10.1145/3212721.3212893",
      "doi": "10.1145/3212721.3212893"
    },
    {
      "text": "JH Low, N Cheng, PM Khin, Nitish V Thakor, Sunil L Kukreja, HL Ren, and Chen-Hua Yeow. 2017. A bidirectional soft pneumatic fabric-based actuator for grasping applications. In 2017 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, Vancouver, BC, Canada, 1180–1186.",
      "doi": ""
    },
    {
      "text": "Robert MacCurdy, Robert Katzschmann, Youbin Kim, and Daniela Rus. 2016. Printable hydraulics: A method for fabricating robots by 3D co-printing solids and liquids. In 2016 IEEE International Conference on Robotics and Automation (ICRA). IEEE, Stockholm, Sweden, 3878–3885.",
      "doi": "10.1109/ICRA.2016.7487576"
    },
    {
      "text": "David J Miller, Larry A Fahnestock, and Matthew R Eatherton. 2012. Development and experimental validation of a nickel–titanium shape memory alloy self-centering buckling-restrained brace. Engineering Structures 40 (2012), 288–298.",
      "doi": ""
    },
    {
      "text": "Sachith Muthukumarana, Don Samitha Elvitigala, Juan Pablo Forero Cortes, Denys J.C. Matthies, and Suranga Nanayakkara. 2020. Touch Me Gently: Recreating the Perception of Touch Using a Shape-Memory Alloy Matrix. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376491",
      "doi": "10.1145/3313831.3376491"
    },
    {
      "text": "Sara Nabil, Jan Kučera, Nikoletta Karastathi, David S. Kirk, and Peter Wright. 2019. Seamless Seams: Crafting Techniques for Embedding Fabrics with Interactive Actuation. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 987–999. https://doi.org/10.1145/3322276.3322369",
      "doi": "10.1145/3322276.3322369"
    },
    {
      "text": "Suranga Nanayakkara, Lonce Wyse, and Elizabeth A. Taylor. 2012. Effectiveness of the Haptic Chair in Speech Training. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (Boulder, Colorado, USA) (ASSETS ’12). Association for Computing Machinery, New York, NY, USA, 235–236. https://doi.org/10.1145/2384916.2384970",
      "doi": "10.1145/2384916.2384970"
    },
    {
      "text": "Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, and Jürgen Steimle. 2015. Foldio. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST '15. ACM Press, Charlotte, NC, USA, 223––232. https://doi.org/10.1145/2807442.2807494",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Florian Perteneder, Kathrin Probst, Christian Rendl, Joanne Leong, Sarah Schuetz, Anita Vogl, Reinhard Schwoediauer, Martin Kaltenbrunner, Siegfried Bauer, and Michael Haller. 2018. RESi: A Highly Flexible, Pressure-Sensitive, Imperceptible Textile Interface Based on Resistive Yarns. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 745–756. https://doi.org/10.1145/3242587.3242664",
      "doi": "10.1145/3242587.3242664"
    },
    {
      "text": "Andreas Peetz, Konstantin Klamka, and Raimund Dachselt. 2019. BodyHub: A Reconfigurable Wearable System for Clothing. In The Adjunct Publication of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 39–41. https://doi.org/10.1145/3332167.3357108",
      "doi": "10.1145/3332167.3357108"
    },
    {
      "text": "Eujin Pei, Jinsong Shen, and Jennifer Watling. 2015. Direct 3D printing of polymers onto textiles: experimental studies and applications. Rapid Prototyping Journal 21, 5 (aug 2015), 556–571. https://doi.org/10.1108/rpj-09-2014-0126",
      "doi": ""
    },
    {
      "text": "Jesús Pérez, Miguel A. Otaduy, and Bernhard Thomaszewski. 2017. Computational Design and Automated Fabrication of Kirchhoff-Plateau Surfaces. ACM Trans. Graph. 36, 4, Article 62 (July 2017), 12 pages. https://doi.org/10.1145/3072959.3073695",
      "doi": "10.1145/3072959.3073695"
    },
    {
      "text": "Nils-Krister Persson, Jose G. Martinez, Yong Zhong, Ali Maziz, and Edwin W. H. Jager. 2018. Actuating Textiles: Next Generation of Smart Textiles. Advanced Materials Technologies 3, 10 (jul 2018), 1700397. https://doi.org/10.1002/admt.201700397",
      "doi": ""
    },
    {
      "text": "Michael L. Rivera, Jack Forman, Scott E. Hudson, and Lining Yao. 2020. Hydrogel-Textile Composites: Actuators for Shape-Changing Interfaces. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3382788",
      "doi": "10.1145/3334480.3382788"
    },
    {
      "text": "Michael L. Rivera and Scott E. Hudson. 2019. Desktop Electrospinning: A Single Extruder 3D Printer for Producing Rigid Plastic and Electrospun Textiles. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300434",
      "doi": "10.1145/3290605.3300434"
    },
    {
      "text": "Michael L. Rivera, Melissa Moukperian, Daniel Ashbrook, Jennifer Mankoff, and Scott E. Hudson. 2017. Stretching the Bounds of 3D Printing with Embedded Textiles. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 497–508. https://doi.org/10.1145/3025453.3025460",
      "doi": "10.1145/3025453.3025460"
    },
    {
      "text": "Hugo Rodrigue, Wei Wang, Min-Woo Han, Thomas JY Kim, and Sung-Hoon Ahn. 2017. An overview of shape memory alloy-coupled actuators and robots. Soft robotics 4, 1 (2017), 3–15.",
      "doi": ""
    },
    {
      "text": "Razieh Hashemi Sanatgar, Christine Campagne, and Vincent Nierstrasz. 2017. Investigation of the adhesion properties of direct 3D printing of polymers and nanocomposites on textiles: Effect of FDM printing process parameters. Applied Surface Science 403 (2017), 551–563.",
      "doi": ""
    },
    {
      "text": "Vanessa Sanchez, Christopher J. Payne, Daniel J. Preston, Jonathan T. Alvarez, James C. Weaver, Asli T. Atalay, Mustafa Boyvat, Daniel M. Vogt, Robert J. Wood, George M. Whitesides, and Conor J. Walsh. 2020. Smart Thermally Actuating Textiles. Advanced Materials Technologies 5, 8 (jul 2020), 2000383. https://doi.org/10.1002/admt.202000383",
      "doi": ""
    },
    {
      "text": "Elizabeth B-N Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. Co-design 4, 1 (2008), 5–18.",
      "doi": ""
    },
    {
      "text": "Robert Scheibe, Mathias Moehring, and Bernd Froehlich. 2007. Tactile feedback at the finger tips for improved direct interaction in immersive environments. In 2007 IEEE Symposium on 3D User Interfaces. IEEE, Charlotte, North Carolina, USA, 125–132.",
      "doi": ""
    },
    {
      "text": "Roshan L Shishoo. 1995. Importance of mechanical and physical properties of fabrics in the clothing manufacturing process. International Journal of Clothing Science and Technology 7, 2-1(1995), 35–42.",
      "doi": ""
    },
    {
      "text": "Melanie F. Simons, Alice C. Haynes, Yan Gao, Yihua Zhu, and Jonathan Rossiter. 2020. In Contact: Pinching, Squeezing and Twisting for Mediated Social Touch. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3382798",
      "doi": ""
    },
    {
      "text": "Massimiliano Solazzi, William R Provancher, Antonio Frisoli, and Massimo Bergamasco. 2011. Design of a SMA actuated 2-DoF tactile device for displaying tangential skin displacement. In 2011 IEEE World Haptics Conference. IEEE, Istanbul, Turkey, 31–36.",
      "doi": ""
    },
    {
      "text": "T Spahiu, N Grimmelsmann, A Ehrmann, E Piperi, and E Shehi. 2017. Effect of 3D printing on textile fabric. Engineering and Entrepreneurship 1, 1 (2017), 1–7.",
      "doi": ""
    },
    {
      "text": "Tatjana Spahiu, Erald Piperi, Andrea Ehrmann, Ermira Shehi, and Dudina Rama. 2019. 3D printed geometries on textile fabric for garment production. In International Conference of Progress in Digital and Physical Manufacturing. Springer, Leiria, Portugal, 271–276.",
      "doi": ""
    },
    {
      "text": "Scott E Stapleton, Dorit Kaufmann, Helga Krieger, Jan Schenk, Thomas Gries, and David Schmelzeisen. 2019. Finite element modeling to predict the steady-state structural behavior of 4D textiles. Textile Research Journal 89, 17 (2019), 3484–3498.",
      "doi": ""
    },
    {
      "text": "Katja Suhonen, Kaisa Väänänen-Vainio-Mattila, and Kalle Mäkelä. 2012. User experiences and expectations of vibrotactile, thermal and squeeze feedback in interpersonal communication. In The 26th BCS Conference on Human Computer Interaction. BISL, 26, 205–214.",
      "doi": ""
    },
    {
      "text": "Ruojia Sun, Ryosuke Onose, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu (Cindy) Kao. 2020. Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 365–377. https://doi.org/10.1145/3357236.3395548",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "Guanyun Wang, Tingyu Cheng, Youngwook Do, Humphrey Yang, Ye Tao, Jianzhe Gu, Byoungkwon An, and Lining Yao. 2018. Printed Paper Actuator: A Low-Cost Reversible Actuation and Sensing Method for Shape Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174143",
      "doi": "10.1145/3173574.3174143"
    },
    {
      "text": "Guanyun Wang, Ye Tao, Ozguc Bertug Capunaman, Humphrey Yang, and Lining Yao. 2019. A-Line: 4D Printing Morphing Linear Composite Structures. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300656",
      "doi": "10.1145/3290605.3300656"
    },
    {
      "text": "Guanyun Wang, Humphrey Yang, Zeyu Yan, Nurcan Gecer Ulu, Ye Tao, Jianzhe Gu, Levent Burak Kara, and Lining Yao. 2018. 4DMesh: 4D Printing Morphing Non-Developable Mesh Surfaces. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 623–635. https://doi.org/10.1145/3242587.3242625",
      "doi": "10.1145/3242587.3242625"
    },
    {
      "text": "Wen Wang, Lining Yao, Teng Zhang, Chin-Yi Cheng, Daniel Levine, and Hiroshi Ishii. 2017. Transformative Appetite: Shape-Changing Food Transforms from 2D to 3D by Water Interaction through Cooking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6123–6132. https://doi.org/10.1145/3025453.3026019",
      "doi": "10.1145/3025453.3026019"
    },
    {
      "text": "Chaoqun Xiang, Jianglong Guo, Rujie Sun, Andrew Hinitt, Tim Helps, Majid Taghavi, and Jonathan Rossiter. 2019. Electroactive textile actuators for breathability control and thermal regulation devices. Polymers 11, 7 (2019), 1199.",
      "doi": ""
    },
    {
      "text": "Sang Ho Yoon, Siyuan Ma, Woo Suk Lee, Shantanu Thakurdesai, Di Sun, Flávio P. Ribeiro, and James D. Holbery. 2019. HapSense: A Soft Haptic I/O Device with Uninterrupted Dual Functionalities of Force Sensing and Vibrotactile Actuation. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 949–961. https://doi.org/10.1145/3332165.3347888",
      "doi": "10.1145/3332165.3347888"
    },
    {
      "text": "Mengjia Zhu, Amirhossein H. Memar, Aakar Gupta, Majed Samad, Priyanshu Agarwal, Yon Visell, Sean J. Keller, and Nicholas Colonnese. 2020. PneuSleeve: In-Fabric Multimodal Actuation and Sensing in a Soft, Compact, and Expressive Haptic Sleeve. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376333",
      "doi": "10.1145/3313831.3376333"
    },
    {
      "text": "Ali Zolfagharian, Akif Kaynak, and Abbas Kouzani. 2020. Closed-loop 4D-printed soft robots. Materials & Design 188(2020), 108411.",
      "doi": ""
    }
  ]
}