{
  "doi": "10.1145/3411764.3445331",
  "title": "LGBTQ Persons' Pregnancy Loss Disclosures to Known Ties on Social Media: Disclosure Decisions and Ideal Disclosure Environments",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Pregnancy loss is a common yet stigmatized experience. We investigate (non)disclosure of pregnancy loss among LGBTQ people to known ties on identified social media as well as what constitutes ideal socio-technical disclosure environments. LGBTQ persons experiencing loss face intersectional stigma for holding a marginalized sexual and/or gender identity and experiencing pregnancy loss. We interviewed 17 LGBTQ people in the U.S. who used social media and had recently experienced pregnancy loss. We demonstrate how the Disclosure Decision-Making (DDM) framework explains LGBTQ pregnancy loss (non)disclosure decisions, thereby asserting the framework's ability to explain (non)disclosure decisions for those facing intersectional stigma. We illustrate how one's LGBTQ identity shapes (non)disclosure decisions of loss. We argue that social media platforms can better facilitate disclosures about silenced topics by enabling selective disclosure, enabling proxy content moderation, providing education about silenced experiences, and prioritizing such disclosures in news feeds. CAUTION: This paper includes quotes about pregnancy loss.",
  "tags": [
    "intersectionality",
    "miscarriage",
    "pregnancy loss",
    "reproductive health",
    "social media",
    "LGBTQ health",
    "disclosure",
    "intersectional stigma"
  ],
  "authors": [
    {
      "name": "Cassidy Pyle",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702262",
      "orcid": "0000-0003-4578-0226"
    },
    {
      "name": "Lee Roosevelt",
      "institution": "School of Nursing University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701441",
      "orcid": "missing"
    },
    {
      "name": "Ashley Lacombe-Duncan",
      "institution": "School of Social Work University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701281",
      "orcid": "missing"
    },
    {
      "name": "Nazanin Andalibi",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958798457",
      "orcid": "0000-0002-3257-2527"
    }
  ],
  "references": [
    {
      "text": "Nazanin Andalibi. 2019. What happens after disclosing stigmatized experiences on identified social media: Individual, dyadic, and social/network outcomes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, Glasgow, Scotland Uk, 1–15. DOI: https://doi.org/10.1145/3290605.3300367",
      "doi": "10.1145/3290605.3300367"
    },
    {
      "text": "Nazanin Andalibi. 2020. Disclosure, privacy, and stigma on social media: Examining non-disclosure of distressing experiences. ACM Trans. Comput.-Hum. Interact. 27, 3 (May 2020), 18:1–18:43. DOI: https://doi.org/10.1145/3386600",
      "doi": "10.1145/3386600"
    },
    {
      "text": "Nazanin Andalibi and Justin Buss. 2020. The Human in Emotion Recognition on Social Media: Attitudes, Outcomes, Risks. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–16. DOI: https://doi.org/10.1145/3313831.3376680",
      "doi": "10.1145/3313831.3376680"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing pregnancy loss on Facebook: A decision-making framework for stigmatized disclosures on identified social network sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18, ACM Press, Montreal QC, Canada, 1–14. DOI: https://doi.org/10.1145/3173574.3173732",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Responding to Sensitive Disclosures on Social Media: A Decision-Making Framework. ACM Trans. Comput.-Hum. Interact. 25, 6 (December 2018), 31:1–31:29. DOI: https://doi.org/10.1145/3241044",
      "doi": "10.1145/3241044"
    },
    {
      "text": "Nazanin Andalibi, Oliver L. Haimson, Munmun De Choudhury, and Andrea Forte. 2018. Social support, reciprocity, and anonymity in responses to sexual abuse disclosures on social media. ACM Trans. Comput.-Hum. Interact. 25, 5 (October 2018), 28:1–28:35. DOI: https://doi.org/10.1145/3234942",
      "doi": "10.1145/3234942"
    },
    {
      "text": "Nazanin Andalibi, Oliver L. Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), Association for Computing Machinery, San Jose, California, USA, 3906–3918. DOI: https://doi.org/10.1145/2858036.2858096",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Nazanin Andalibi, Margaret E. Morris, and Andrea Forte. 2018. Testing waters, sending clues: Indirect disclosures of socially stigmatized experiences on social media. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 19:1–19:23. DOI: https://doi.org/10.1145/3274288",
      "doi": "10.1145/3274288"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive self-disclosures, responses, and social support on Instagram: The case of #depression. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’17), Association for Computing Machinery, Portland, Oregon, USA, 1485–1500. DOI: https://doi.org/10.1145/2998181.2998243",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "Jonah Bardos, Daniel Hercz, Jenna Friedenthal, Stacey A. Missmer, and Zev Williams. 2015. A national survey on public perceptions of miscarriage. Obstetrics & Gynecology 125, 6 (June 2015), 1313–1320. DOI: https://doi.org/10.1097/AOG.0000000000000859",
      "doi": ""
    },
    {
      "text": "Kristen Barta. 2019. Reclaiming publicness in the face of sexual assault: Social media, disclosure, and visibility. Thesis. Retrieved December 29, 2020 from https://digital.lib.washington.edu:443/researchworks/handle/1773/45159",
      "doi": ""
    },
    {
      "text": "Natalya N. Bazarova. 2012. Public intimacy: Disclosure interpretation and social judgments on Facebook. J Commun 62, 5 (October 2012), 815–832. DOI: https://doi.org/10.1111/j.1460-2466.2012.01664.x",
      "doi": ""
    },
    {
      "text": "Rena Bivens. 2017. The gender binary will not be deprogrammed: Ten years of coding gender on Facebook. New Media & Society 19, 6 (June 2017), 880–898. DOI: https://doi.org/10.1177/1461444815621527",
      "doi": ""
    },
    {
      "text": "Beth Perry Black and Wendy Smith Fields. 2014. Contexts of reproductive loss in lesbian couples. MCN, The American Journal of Maternal/Child Nursing 39, 3 (2014), 157–162. DOI: https://doi.org/10.1097/NMC.0000000000000032",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT parents and social media: Advocacy, privacy, and disclosure during shifting social movements. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16, ACM Press, Santa Clara, California, USA, 610–622. DOI: https://doi.org/10.1145/2858036.2858342",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Amy Brainer, Mignon R. Moore, and Pallavi Banerjee. 2020. Race and ethnicity in the lives of LGBTQ Parents and their children: Perspectives from and beyond North America. In LGBTQ-Parent Families: Innovations in Research and Implications for Practice, Abbie E. Goldberg and Katherine R. Allen (eds.). Springer International Publishing, Cham, 85–103. DOI: https://doi.org/10.1007/978-3-030-35610-1_5",
      "doi": ""
    },
    {
      "text": "Gillian Brockell. Perspective | Dear tech companies, I don't want to see pregnancy ads after my child was stillborn. Washington Post. Retrieved January 5, 2021 from https://www.washingtonpost.com/lifestyle/2018/12/12/dear-tech-companies-i-dont-want-see-pregnancy-ads-after-my-child-was-stillborn/",
      "doi": ""
    },
    {
      "text": "Hannah Brooks, Carrie D Llewellyn, Tom Nadarzynski, Fernando Castilho Pelloso, Felipe De Souza Guilherme, Alex Pollard, and Christina J Jones. 2018. Sexual orientation disclosure in health care: a systematic review. Br J Gen Pract 68, 668 (March 2018), e187–e196. DOI: https://doi.org/10.3399/bjgp18X694841",
      "doi": ""
    },
    {
      "text": "Grace Burleson, Mustafa Naseem, and Kentaro Toyama. 2020. An exploration of African-American pregnant women's information-seeking behavior in Detroit. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development (ICTD2020), Association for Computing Machinery, Guayaquil, Ecuador, 1–12. DOI: https://doi.org/10.1145/3392561.3394647",
      "doi": "10.1145/3392561.3394647"
    },
    {
      "text": "Sylvia Burrow, Lisa Goldberg, Jennifer Searle, and Megan Aston. 2018. Vulnerability, harm, and compromised ethics revealed by the experiences of queer birthing women in rural healthcare. Bioethical Inquiry 15, 4 (December 2018), 511–524. DOI: https://doi.org/10.1007/s11673-018-9882-5",
      "doi": ""
    },
    {
      "text": "Albert C. Cain, Mary E. Erickson, Irene Fast, and Rebecca A. Vaughan. 1964. Children's disturbed reactions to their mother's miscarriages. Psychosomatic Medicine 26, 1 (1964), 58–66. DOI: https://doi.org/10.1097/00006842-196401000-00008",
      "doi": ""
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer visibility: Supporting LGBT+ selective visibility on social media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, Montreal QC, Canada, 1–12. DOI: https://doi.org/10.1145/3173574.3173824",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "Andre Cavalcante. 2019. Tumbling into queer utopias and vortexes: Experiences of LGBTQ social media users on Tumblr. Journal of Homosexuality 66, 12 (October 2019), 1715–1735. DOI: https://doi.org/10.1080/00918369.2018.1511131",
      "doi": ""
    },
    {
      "text": "Rosie Charter, Jane M. Ussher, Janette Perz, and Kerry Robinson. 2018. The transgender parent: Experiences and constructions of pregnancy and parenthood for transgender men in Australia. International Journal of Transgenderism 19, 1 (January 2018), 64–77. DOI: https://doi.org/10.1080/15532739.2017.1399496",
      "doi": ""
    },
    {
      "text": "Stephenie R. Chaudoir and Jeffrey D. Fisher. 2010. The disclosure processes model: Understanding disclosure decision making and postdisclosure outcomes among people living with a concealable stigmatized identity. Psychological Bulletin 136, 2 (2010), 236–256. DOI: https://doi.org/10.1037/a0018193",
      "doi": ""
    },
    {
      "text": "Alexander Cho. 2018. Default publicness: Queer youth of color, social media, and being outed by the machine. New Media & Society 20, 9 (September 2018), 3183–3200. DOI: https://doi.org/10.1177/1461444817744784",
      "doi": ""
    },
    {
      "text": "Sheldon Cohen and Harry M. Hoberman. 1983. Positive events and social supports as buffers of life change stress. Journal of Applied Social Psychology 13, 2 (1983), 99–125. DOI: https://doi.org/10.1111/j.1559-1816.1983.tb02325.x",
      "doi": ""
    },
    {
      "text": "Patricia Hill Collins and Sirma Bilge. 2020. Intersectionality. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Lisa Cosgrove. 2004. The aftermath of pregnancy loss: A feminist critique of the literature and implications for treatment. Women & Therapy 27, 3–4 (March 2004), 107–122. DOI: https://doi.org/10.1300/J015v27n03_08",
      "doi": ""
    },
    {
      "text": "Nick Couldry and Ulises A. Mejias. 2019. The Costs of Connection: How Data Is Colonizing Human Life and Appropriating It for Capitalism. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Shelley L. Craig and Lauren McInroy. 2014. You can form a part of yourself online: The influence of new media on identity development and coming out for LGBTQ youth. Journal of Gay & Lesbian Mental Health 18, 1 (January 2014), 95–109. DOI: https://doi.org/10.1080/19359705.2013.777007",
      "doi": ""
    },
    {
      "text": "Christa Craven and Elizabeth Peel. 2017. Queering reproductive loss: Exploring grief and memorialization. Loughborough University. Retrieved July 1, 2020 from https://repository.lboro.ac.uk/articles/chapter/Queering_reproductive_loss_Exploring_grief_and_memorialization/9478259",
      "doi": ""
    },
    {
      "text": "Christina Craven and Elizabeth Peel. 2014. Stories of grief and hope: Queer experiences of reproductive loss. In Queering Maternity and Motherhood: Narrative and theoretical perspectives on queer conception, birth, and parenting.",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 1989. Demarginalizing the intersection of race and sex: A Black feminist critique of antidiscrimination doctrine, feminist theory and antiracist politics. University of Chicago Legal Forum (1989). Retrieved from https://chicagounbound.uchicago.edu/uclf/vol1989/iss1/8",
      "doi": ""
    },
    {
      "text": "Carolyn E. Cutrona and Julie A. Suhr. 1992. Controllability of stressful events and satisfaction with spouse support behaviors. Communication Research 19, 2 (April 1992), 154–174. DOI: https://doi.org/10.1177/009365092019002002",
      "doi": ""
    },
    {
      "text": "Zoe Darwin and Mari Greenfield. 2019. Mothers and others: The invisibility of LGBTQ people in reproductive and infant psychology. Journal of Reproductive and Infant Psychology 37, 4 (August 2019), 341–343. DOI: https://doi.org/10.1080/02646838.2019.1649919",
      "doi": ""
    },
    {
      "text": "Joseph Nicholas DeFilippis. 2016. “What about the rest of us?” An overview of LGBT poverty issues and a call to action. Journal of Progressive Human Services 27, 3 (September 2016), 143–174. DOI: https://doi.org/10.1080/10428232.2016.1198673",
      "doi": ""
    },
    {
      "text": "Stefanie Duguay. 2016. “He has a way gayer Facebook than I do”: Investigating sexual identity disclosure and context collapse on a social networking site. New Media & Society 18, 6 (June 2016), 891–907. DOI: https://doi.org/10.1177/1461444814549930",
      "doi": ""
    },
    {
      "text": "Michele J. Eliason and Robert Schope. 2001. Does “don't ask don't tell” apply to health care? Lesbian, gay, and bisexual people's disclosure to health care providers. Journal of the Gay and Lesbian Medical Association 5, 4 (December 2001), 125–134. DOI: https://doi.org/10.1023/A:1014257910462",
      "doi": ""
    },
    {
      "text": "Simon Adriane Ellis, Danuta M. Wojnar, and Maria Pettinato. 2015. Conception, pregnancy, and birth experiences of male and gender variant gestational parents: It's how we could have a family. Journal of Midwifery & Women's Health 60, 1 (January 2015), 62–69. DOI: https://doi.org/10.1111/jmwh.12213",
      "doi": ""
    },
    {
      "text": "Jennifer Leanne Fairchild. 2009. What might have been: The communication of social support and women's post-miscarriage narrative reconstruction. Ph.D. University of Kentucky, United States – Kentucky. Retrieved September 16, 2020 from http://search.proquest.com/docview/858610979/abstract/958D3E1FF2234C61PQ/1",
      "doi": ""
    },
    {
      "text": "Casey Fiesler, Michaelanne Dye, Jessica L. Feuston, Chaya Hiruncharoenvate, C.J. Hutto, Shannon Morrison, Parisa Khanipour Roshan, Umashanthi Pavalanathan, Amy S. Bruckman, Munmun De Choudhury, and Eric Gilbert. 2017. What (or who) is public? Privacy settings and social media content sharing. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW ’17), Association for Computing Machinery, Portland, Oregon, USA, 567–580. DOI: https://doi.org/10.1145/2998181.2998223",
      "doi": "10.1145/2998181.2998223"
    },
    {
      "text": "Berenice Fisher. Affirming social value: Women without children. In Social Organization and Social Processes: Essays in Honor of Anselm Strauss. Transaction Publishers, 420.",
      "doi": ""
    },
    {
      "text": "Ryan J. Gallagher, Elizabeth Stowell, Andrea G. Parker, and Brooke Foucault Welles. 2019. Reclaiming Stigmatized Narratives: The Networked Disclosure Landscape of #MeToo. Proc. ACM Hum.-Comput. Interact. 3, CSCW (November 2019), 96:1–96:30. DOI: https://doi.org/10.1145/3359198",
      "doi": "10.1145/3359198"
    },
    {
      "text": "Susan B. Goldstein. 2017. Stigma and stigma by association in perceptions of straight allies. Journal of LGBT Youth 14, 4 (October 2017), 345–358. DOI: https://doi.org/10.1080/19361653.2017.1326867",
      "doi": ""
    },
    {
      "text": "Kathryn Greene, Valerian Derlega, and Alicia Mathews. 2006. Self-disclosure in personal relationships. In The Cambridge Handbook of Personal Relationships. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Oliver Haimson. 2018. Social media as social transition machinery. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 1–21. DOI: https://doi.org/10.1145/3274332",
      "doi": "10.1145/3274332"
    },
    {
      "text": "Oliver L Haimson, Nazanin Andalibi, Munmun De Choudhury, and Gillian R Hayes. 2018. Relationship breakup disclosures and media ideologies on Facebook. New Media & Society 20, 5 (May 2018), 1931–1952. DOI: https://doi.org/10.1177/1461444817711402",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, stress, and support during gender transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’15, ACM Press, Vancouver, BC, Canada, 1176–1190. DOI: https://doi.org/10.1145/2675133.2675152",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2016. Digital footprints and changing networks during online identity transitions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), Association for Computing Machinery, San Jose, California, USA, 2895–2907. DOI: https://doi.org/10.1145/2858036.2858136",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Oliver L. Haimson, Avery Dame-Griff, Elias Capello, and Zahari Richter. 2019. Tumblr was a trans technology: the meaning, importance, history, and future of trans technologies. Feminist Media Studies (October 2019), 1–17. DOI: https://doi.org/10.1080/14680777.2019.1678505",
      "doi": ""
    },
    {
      "text": "G. Hanscombe. 1983. The right to lesbian parenthood. Journal of Medical Ethics 9, 3 (September 1983), 133–135. DOI: https://doi.org/10.1136/jme.9.3.133",
      "doi": ""
    },
    {
      "text": "Lynne Hillier and Lyn Harrison. 2007. Building realities less limited than their own: Young people practising same-sex attraction on the internet. Sexualities 10, 1 (February 2007), 82–100. DOI: https://doi.org/10.1177/1363460707072956",
      "doi": ""
    },
    {
      "text": "Aaron Holmes. Facebook is launching a new “coronavirus information center” that will appear at the top of people's News Feeds. Business Insider. Retrieved July 1, 2020 from https://www.businessinsider.com/facebook-coronavirus-information-center-news-feed-feature-covid-2020-3",
      "doi": ""
    },
    {
      "text": "Janet Jaffe. 2014. The reproductive story: Dealing with miscarriage, stillbirth, or other perinatal demise. In Women's Reproductive Mental Health Across the Lifespan, Diana Lynn Barnes (ed.). Springer International Publishing, Cham, 159–176. DOI: https://doi.org/10.1007/978-3-319-05116-1_9",
      "doi": ""
    },
    {
      "text": "Sidney Jourard. 1971. Self-disclosure: An experimental analysis of the transparent self. Wiley, London.",
      "doi": ""
    },
    {
      "text": "Elaine Kasket. 2009. Protocol for Responding to Participant Distress, Adapted Version for Telephone/Skype.",
      "doi": ""
    },
    {
      "text": "Karen Kavanaugh and Patricia Hershberger. 2005. Perinatal loss in low-income African American parents. Journal of Obstetric, Gynecologic, & Neonatal Nursing 34, 5 (2005), 595–605. DOI: https://doi.org/10.1177/0884217505280000",
      "doi": ""
    },
    {
      "text": "Janet W. Kenney and Donna T. Tash. 1992. Lesbian childbearing couples’ dilemmas and decisions. Health Care for Women International 13, 2 (January 1992), 209–219. DOI: https://doi.org/10.1080/07399339209515993",
      "doi": ""
    },
    {
      "text": "Sofia Klittmark, Matias Garzón, Ewa Andersson, and Michael B. Wells. 2019. LGBTQ competence wanted: LGBTQ parents’ experiences of reproductive health care in Sweden. Scand J Caring Sci 33, 2 (June 2019), 417–426. DOI: https://doi.org/10.1111/scs.12639",
      "doi": ""
    },
    {
      "text": "Linda L. Layne. 2000. ‘He was a real baby with baby things’: A material culture analysis of personhood, parenthood and pregnancy loss. Journal of Material Culture 5, 3 (November 2000), 321–345. DOI: https://doi.org/10.1177/135918350000500304",
      "doi": ""
    },
    {
      "text": "Linda L. Layne. 2014. Motherhood lost: A feminist account of pregnancy loss in America. Routledge.",
      "doi": ""
    },
    {
      "text": "C. Lee, P. Slade, and V. Lygo. 1996. The influence of psychological debriefing on emotional adaptation in women following early miscarriage: A preliminary study. British Journal of Medical Psychology 69, 1 (1996), 47–58. DOI: https://doi.org/10.1111/j.2044-8341.1996.tb01849.x",
      "doi": ""
    },
    {
      "text": "Alexis D. Light, Juno Obedin-Maliver, Jae M. Sevelius, and Jennifer L. Kerns. 2014. Transgender men who experienced pregnancy after female-to-male gender transitioning. Obstetrics & Gynecology 124, 6 (December 2014), 1120–1127. DOI: https://doi.org/10.1097/AOG.0000000000000540",
      "doi": ""
    },
    {
      "text": "Emily R. M. Lind and Angie Deveau (Eds.). 2017. Interrogating pregnancy loss: Feminist writings on abortion, miscarriage, and stillbirth. Demeter Press. DOI: https://doi.org/10.2307/j.ctt1wf4cfb",
      "doi": ""
    },
    {
      "text": "Bruce G. Link and Jo C. Phelan. 2001. Conceptualizing stigma. Annual Review of Sociology 27, 1 (2001), 363–385. DOI: https://doi.org/10.1146/annurev.soc.27.1.363",
      "doi": ""
    },
    {
      "text": "Carmen H Logie, LLana James, Wangari Tharao, and Mona R Loutfy. 2012. “We don't exist”: a qualitative study of marginalization experienced by HIV-positive lesbian, bisexual, queer and transgender women in Toronto, Canada. Journal of the International AIDS Society 15, 2 (September 2012). DOI: https://doi.org/10.7448/IAS.15.2.17392",
      "doi": ""
    },
    {
      "text": "Kaitlin Mahar, Amy X. Zhang, and David Karger. 2018. Squadbox: A tool to combat email harassment using friendsourced moderation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, Montreal QC, Canada, 1–13. DOI: https://doi.org/10.1145/3173574.3174160",
      "doi": "10.1145/3173574.3174160"
    },
    {
      "text": "Alice E. Marwick and danah boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1 (February 2011), 114–133. DOI: https://doi.org/10.1177/1461444810365313",
      "doi": ""
    },
    {
      "text": "M. Chad McBride. 2016. Communicating pregnancy loss: Narrative as a method for change. Women & Language 39, 1 (Fall 2016), 133–134.",
      "doi": ""
    },
    {
      "text": "Leslie McCall. 2005. The complexity of intersectionality. Signs 30, 3 (2005), 1771–1800. DOI: https://doi.org/10.1086/426800",
      "doi": ""
    },
    {
      "text": "Elizabeth A. McConnell, Antonia Clifford, Aaron K. Korpak, Gregory Phillips, and Michelle Birkett. 2017. Identity, victimization, and support: Facebook experiences and mental health among LGBTQ youth. Computers in Human Behavior 76, (November 2017), 237–244. DOI: https://doi.org/10.1016/j.chb.2017.07.026",
      "doi": "10.1016/j.chb.2017.07.026"
    },
    {
      "text": "Elizabeth McConnell, Bálint Néray, Bernie Hogan, Aaron Korpak, Antonia Clifford, and Michelle Birkett. 2018. “Everybody Puts Their Whole Life on Facebook”: Identity Management and the Online Social Networks of LGBTQ Youth. International Journal of Environmental Research and Public Health 15, 6 (June 2018), 1078. DOI: https://doi.org/10.3390/ijerph15061078",
      "doi": ""
    },
    {
      "text": "Ryan A. Miller. 2017. “My voice is definitely strongest in online communities”: Students using social media for queer and disability identity-making. Journal of College Student Development 58, 4 (2017), 509–525. DOI: https://doi.org/10.1353/csd.2017.0040",
      "doi": ""
    },
    {
      "text": "Michael D. Mink, Lisa L. Lindley, and Ali A. Weinstein. 2014. Stress, stigma, and sexual minority status: The intersectional ecology model of LGBTQ health. Journal of Gay & Lesbian Social Services 26, 4 (October 2014), 502–521. DOI: https://doi.org/10.1080/10538720.2014.953660",
      "doi": ""
    },
    {
      "text": "Aileen Mulvihill and Trish Walsh. 2014. Pregnancy loss in rural Ireland: An experience of disenfranchised grief. Br J Soc Work 44, 8 (December 2014), 2290–2306. DOI: https://doi.org/10.1093/bjsw/bct078",
      "doi": ""
    },
    {
      "text": "R Neugebauer, J Kline, P O'Connor, P Shrout, J Johnson, A Skodol, J Wicks, and M Susser. 1992. Determinants of depressive symptoms in the early weeks after miscarriage. Am J Public Health 82, 10 (October 1992), 1332–1339. DOI: https://doi.org/10.2105/AJPH.82.10.1332",
      "doi": ""
    },
    {
      "text": "Z. Nicolazzo. 2016. “Just Go In Looking Good”: The Resilience, Resistance, and Kinship-Building of Trans* College Students. Journal of College Student Development 57, 5 (July 2016), 538–556. DOI: https://doi.org/10.1353/csd.2016.0057",
      "doi": ""
    },
    {
      "text": "Richard Nieva. Facebook tests “things in common” label to try to connect non-friends. CNET. Retrieved July 1, 2020 from https://www.cnet.com/news/facebook-tests-things-in-common-label-to-try-to-connect-non-friends/",
      "doi": ""
    },
    {
      "text": "Laura Nyblade, Melissa Stockton, Daniel Nyato, and Joyce Wamoyi. 2017. Perceived, anticipated and experienced stigma: Exploring manifestations and implications for young people's sexual and reproductive health and access to care in North-Western Tanzania. Culture, Health & Sexuality 19, 10 (October 2017), 1092–1107. DOI: https://doi.org/10.1080/13691058.2017.1293844",
      "doi": ""
    },
    {
      "text": "Julia Omarzu. 2000. A disclosure decision model: Determining how and when individuals will self-disclose. Pers Soc Psychol Rev 4, 2 (May 2000), 174–185. DOI: https://doi.org/10.1207/S15327957PSPR0402_05",
      "doi": ""
    },
    {
      "text": "E. Peel. 2010. Pregnancy loss in lesbian and bisexual women: An online survey of experiences. Human Reproduction 25, 3 (March 2010), 721–727. DOI: https://doi.org/10.1093/humrep/dep441",
      "doi": ""
    },
    {
      "text": "Elizabeth Peel. 2012. Moving beyond heterosexism? The good, the bad, and the indifferent in accounts of others’ reactions to important life events. Psychology of Sexualities Review 3, 1 (2012), 34-46.",
      "doi": ""
    },
    {
      "text": "Elizabeth Peel and Ruth Cain. 2012. “Silent” miscarriage and deafening heteronormativity: A British experiential and critical feminist account. In Understanding Reproductive Loss: Perspectives on Life, Death and Fertility. 79–92.",
      "doi": ""
    },
    {
      "text": "Robert Pralat. 2018. More natural does not equal more normal: Lesbian, gay, and bisexual people's views about different pathways to parenthood. Journal of Family Issues 39, 18 (December 2018), 4179–4203. DOI: https://doi.org/10.1177/0192513X18810951",
      "doi": ""
    },
    {
      "text": "Robert Pralat. 2020. Sexual identities and reproductive orientations: Coming out as wanting (or not wanting) to have children. Sexualities (June 2020), 1363460720926967. DOI: https://doi.org/10.1177/1363460720926967",
      "doi": ""
    },
    {
      "text": "John E. Puddifoot and Martin P. Johnson. 1997. The legitimacy of grieving: The partner's experience at miscarriage. Social Science & Medicine 45, 6 (September 1997), 837–845. DOI: https://doi.org/10.1016/S0277-9536(96)00424-8",
      "doi": ""
    },
    {
      "text": "Belle Rose Ragins. 2008. Disclosure disconnects: Antecedents and consequences of disclosing invisible stigmas across life domains. AMR 33, 1 (January 2008), 194–215. DOI: https://doi.org/10.5465/amr.2008.27752724",
      "doi": ""
    },
    {
      "text": "Leonard Reinecke and Sabine Trepte. 2014. Authenticity and well-being on social network sites: A two-wave longitudinal study on the effects of online authenticity and the positivity bias in SNS communication. Computers in Human Behavior 30, (January 2014), 95–102. DOI: https://doi.org/10.1016/j.chb.2013.07.030",
      "doi": "10.1016/j.chb.2013.07.030"
    },
    {
      "text": "Christabel L. Rogalin and Jane E. Brooks. 2018. Lesbians achieving pregnancy: The intersections of social location and the heteronormative medicalization of infertility. Sociology Compass 12, 11 (November 2018), e12637. DOI: https://doi.org/10.1111/soc4.12637",
      "doi": ""
    },
    {
      "text": "Lauren M. Rossen, Katherine A. Ahrens, and Amy M. Branum. 2018. Trends in risk of pregnancy loss among US women, 1990–2011. Paediatr Perinat Epidemiol 32, 1 (January 2018), 19–29. DOI: https://doi.org/10.1111/ppe.12417",
      "doi": ""
    },
    {
      "text": "Jennifer D. Rubin and Sara I. McClelland. 2015. ‘Even though it's a small checkbox, it's a big deal’: stresses and strains of managing sexual identity(s) on Facebook. Culture, Health & Sexuality 17, 4 (April 2015), 512–526. DOI: https://doi.org/10.1080/13691058.2014.994229",
      "doi": ""
    },
    {
      "text": "Graham Scambler. 2009. Health-related stigma. Sociology of Health & Illness 31, 3 (2009), 441–455. DOI: https://doi.org/10.1111/j.1467-9566.2009.01161.x",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of qualitative research: Techniques and procedures for developing grounded theory. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Janet M. Turan, Melissa A. Elafros, Carmen H. Logie, Swagata Banik, Bulent Turan, Kaylee B. Crockett, Bernice Pescosolido, and Sarah M. Murray. 2019. Challenges and opportunities in examining and addressing intersectional stigma and health. BMC Med 17, 1 (December 2019), 7. DOI: https://doi.org/10.1186/s12916-018-1246-9",
      "doi": ""
    },
    {
      "text": "Michelle Walks. 2007. Breaking the silence: Infertility, motherhood, and queer culture. Journal of the Motherhood Initiative for Research and Community Involvement 9, 2 (2007).",
      "doi": ""
    },
    {
      "text": "Mark Warner, Andreas Gutmann, M. Angela Sasse, and Ann Blandford. 2018. Privacy unraveling around explicit HIV status disclosure fields in the online geosocial hookup app Grindr. Proc. ACM Hum.-Comput. Interact. 2, CSCW (November 2018), 181:1–181:22. DOI: https://doi.org/10.1145/3274450",
      "doi": "10.1145/3274450"
    },
    {
      "text": "Jaclyn M. White Hughto, Sari L. Reisner, and John E. Pachankis. 2015. Transgender stigma and health: A critical review of stigma determinants, mechanisms, and interventions. Social Science & Medicine 147, (December 2015), 222–231. DOI: https://doi.org/10.1016/j.socscimed.2015.11.010",
      "doi": ""
    },
    {
      "text": "Katrien Wierckx, Eva Van Caenegem, Guido Pennings, Els Elaut, David Dedecker, Fleur Van de Peer, Steven Weyers, Petra De Sutter, and Guy T'Sjoen. 2012. Reproductive wish in transsexual men. Hum Reprod 27, 2 (February 2012), 483–487. DOI: https://doi.org/10.1093/humrep/der406",
      "doi": ""
    },
    {
      "text": "Erin Wingo, Natalie Ingraham, and Sarah C.M. Roberts. 2018. Reproductive health care priorities and barriers to effective care for LGBTQ people assigned female at birth: A qualitative study. Women's Health Issues 28, 4 (July 2018), 350–357. DOI: https://doi.org/10.1016/j.whi.2018.03.002",
      "doi": ""
    },
    {
      "text": "Danuta Wojnar. 2007. Miscarriage experiences of lesbian couples. Journal of Midwifery & Women's Health 52, 5 (September 2007), 479–485. DOI: https://doi.org/10.1016/j.jmwh.2007.03.015",
      "doi": ""
    },
    {
      "text": "Danuta M. Wojnar and Amy Katzenmeyer. 2014. Experiences of preconception, pregnancy, and new motherhood for lesbian nonbiological mothers. Journal of Obstetric, Gynecologic & Neonatal Nursing 43, 1 (January 2014), 50–60. DOI: https://doi.org/10.1111/1552-6909.12270",
      "doi": ""
    },
    {
      "text": "Danuta Wojnar and Kristen M. Swanson. 2006. Why shouldn't lesbian women who miscarry receive special consideration?: A viewpoint. Journal of GLBT Family Studies 2, 1 (January 2006), 1–12. DOI: https://doi.org/10.1300/J461v02n01_01",
      "doi": ""
    },
    {
      "text": "Marc Ziegele and Leonard Reinecke. 2017. No place for negative emotions? The effects of message valence, communication channel, and social distance on users’ willingness to respond to SNS status updates. Computers in Human Behavior 75, (October 2017), 704–713. DOI: https://doi.org/10.1016/j.chb.2017.06.016",
      "doi": "10.1016/j.chb.2017.06.016"
    },
    {
      "text": "Shoshana Zuboff. 2019. The age of surveillance capitalism: the fight for a human future at the new frontier of power (First edition ed.). PublicAffairs, New York.",
      "doi": ""
    },
    {
      "text": "Supporting Well-being with Guides on Instagram | Instagram Blog. Retrieved July 1, 2020 from https://about.instagram.com/blog/announcements/supporting-well-being-with-instagram-guides",
      "doi": ""
    },
    {
      "text": "Facebook News Feed Algorithm History | 2019 Update | Wallaroo Media. Retrieved July 1, 2020 from https://wallaroomedia.com/facebook-newsfeed-algorithm-history/",
      "doi": ""
    }
  ]
}