{
  "doi": "10.1145/3411764.3445288",
  "title": "KeyTch: Combining the Keyboard with a Touchscreen for Rapid Command Selection on Toolbars",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "",
  "tags": [
    "Ribbon",
    "Interaction techniques",
    "Object-to-Command Transition",
    "Mobile device",
    "Toolbar",
    "Command selection",
    "Menu"
  ],
  "authors": [
    {
      "name": "Elio Keddisseh",
      "institution": "University of Toulouse IRIT - Elipse, France and Oktal Sydac - Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659348796",
      "orcid": "missing"
    },
    {
      "name": "Marcos Serrano",
      "institution": "University of Toulouse IRIT - Elipse, France",
      "img": "/do/10.1145/contrib-81318491531/rel-imgonly/marcos-2018.jpg",
      "acmid": "81318491531",
      "orcid": "0000-0001-8431-0601"
    },
    {
      "name": "Emmanuel Dubois",
      "institution": "University of Toulouse IRIT - Elipse, France",
      "img": "/do/10.1145/contrib-81100177698/rel-imgonly/emmanuel_dubois.jpg",
      "acmid": "81100177698",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Gilles Bailly, Eric Lecolinet, and Laurence Nigay. 2016. Visual menu techniques. ACM Computing Surveys 49, 4. https://doi.org/10.1145/3002171",
      "doi": "10.1145/3002171"
    },
    {
      "text": "Gilles Bailly, Thomas Pietrzak, Jonathan Deber, and Daniel Wigdor. 2013. Métamorphe: Augmenting hotkey usage with actuated keys. In Conference on Human Factors in Computing Systems - Proceedings, 563–572. https://doi.org/10.1145/2470654.2470734",
      "doi": "10.1145/2470654.2470734"
    },
    {
      "text": "Aaron Bangor, Philip T. Kortum, and James T. Miller. 2008. An empirical evaluation of the system usability scale. International Journal of Human-Computer Interaction 24, 6: 574–594. https://doi.org/10.1080/10447310802205776",
      "doi": ""
    },
    {
      "text": "Xiaojun Bi, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2011. Magic desk. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11, 2511. https://doi.org/10.1145/1978942.1979309",
      "doi": "10.1145/1978942.1979309"
    },
    {
      "text": "Florian Block, Hans Gellersen, and Nicolas Villar. 2010. Touch-display keyboards. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10, 1145. https://doi.org/10.1145/1753326.1753498",
      "doi": "10.1145/1753326.1753498"
    },
    {
      "text": "John Brooke. 1996. SUS: a “quick and dirty” usability scale. In Usability evaluation in industry. 189.",
      "doi": ""
    },
    {
      "text": "Florent Cabric, Emmanuel Dubois, Pourang Irani, and Marcos Serrano. 2019. TouchGlass: Raycasting from a Glass Surface to Point at Physical Objects in Public Exhibits. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), 249–269. https://doi.org/10.1007/978-3-030-29387-1_15",
      "doi": ""
    },
    {
      "text": "Jack Callahan, Don Hopkins, Mark Weiser, and Ben Shneiderman. 1988. An empirical comparison of Pie vs. Linear menus. In Conference on Human Factors in Computing Systems - Proceedings, 95–100. https://doi.org/10.1145/57167.57182",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "Stuart K. Card, Thomas P. Moran, and Allen Newell. 1980. The Keystroke-Level Model for User Performance Time with Interactive Systems. Communications of the ACM 23, 7: 396–410. https://doi.org/10.1145/358886.358895",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Olivier Chapuis and Nicolas Roussel. 2010. UIMarks: Quick graphical interaction with specific targets. In UIST 2010 - 23rd ACM Symposium on User Interface Software and Technology, 173–182. https://doi.org/10.1145/1866029.1866057",
      "doi": "10.1145/1866029.1866057"
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, Joey Scarr, and Sylvain Malacria. 2014. Supporting novice to expert transitions in user interfaces. ACM Computing Surveys 47. https://doi.org/10.1145/2659796",
      "doi": ""
    },
    {
      "text": "Wenzhe Cui, Jingjie Zheng, Blaine Lewis, Daniel Vogel, and Xiaojun Bi. 2019. Hotstrokes: Word-gesture shortcuts on a trackpad. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3290605.3300395",
      "doi": "10.1145/3290605.3300395"
    },
    {
      "text": "Kurtis Danyluk, Bernhard Jenny, and Wesley Willett. 2019. Look-from camera control for 3D terrain maps. In Conference on Human Factors in Computing Systems - Proceedings, 1–12. https://doi.org/10.1145/3290605.3300594",
      "doi": "10.1145/3290605.3300594"
    },
    {
      "text": "Ruta Desai, Fraser Anderson, Justin Matejka, Stelian Coros, James McCann, George Fitzmaurice, and Tovi Grossman. 2019. Geppeto: Enabling semantic design of expressive robot behaviors. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3290605.3300599",
      "doi": ""
    },
    {
      "text": "Richard F. Dillon, Jeff D. Edey, and Jo W. Tombaugh. 1990. Measuring the true cost of command selection: Techniques and results. In Conference on Human Factors in Computing Systems - Proceedings, 19–25. https://doi.org/10.1145/97243.97247",
      "doi": "10.1145/97243.97247"
    },
    {
      "text": "Pierre Dragicevic. 2016. Fair Statistical Communication in HCI. . Springer, Cham, 291–330. https://doi.org/10.1007/978-3-319-26633-6_13",
      "doi": ""
    },
    {
      "text": "Emmanuel Dubois, Marcos Serrano, and Mathieu Raynal. 2018. Rolling-menu: Rapid command selection in toolbars using Roll gestures with a multi-dof Mouse. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/3173574.3173941",
      "doi": "10.1145/3173574.3173941"
    },
    {
      "text": "Anna Maria Feit, Daryl Weir, and Antti Oulasvirta. 2016. How we type: Movement strategies and performance in everyday typing. In Conference on Human Factors in Computing Systems - Proceedings, 4262–4273. https://doi.org/10.1145/2858036.2858233",
      "doi": "10.1145/2858036.2858233"
    },
    {
      "text": "Fiona Fidler. 2010. THE AMERICAN PSYCHOLOGICAL ASSOCIATION PUBLICATION MANUAL SIXTH EDITION: IMPLICATIONS FOR STATISTICS EDUCATION. Retrieved January 10, 2021 from www.stat.auckland.ac.nz/∼iase/",
      "doi": ""
    },
    {
      "text": "Bruno Fruchard, Eric Lecolinet, and Olivier Chapuis. 2017. MarkPad. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17, 5630–5642. https://doi.org/10.1145/3025453.3025486",
      "doi": "10.1145/3025453.3025486"
    },
    {
      "text": "Emmanouil Giannisakis, Gilles Bailly, Sylvain Malacria, and Fanny Chevalier. 2017. IconHK. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17, 4715–4726. https://doi.org/10.1145/3025453.3025595",
      "doi": "10.1145/3025453.3025595"
    },
    {
      "text": "Antonio Gomes, Tristan Trutna, and Roel Vertegaal. 2015. DisplayCover. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI ’15, 531–535. https://doi.org/10.1145/2785830.2785843",
      "doi": "10.1145/2785830.2785843"
    },
    {
      "text": "Tovi Grossman, Pierre Dragicevic, and Ravin Balakrishnan. 2007. Strategies for accelerating on-line learning of hotkeys. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI ’07, 1591. https://doi.org/10.1145/1240624.1240865",
      "doi": "10.1145/1240624.1240865"
    },
    {
      "text": "François Guimbretiére and Terry Winograd. 2000. FlowMenu. In Proceedings of the 13th annual ACM symposium on User interface software and technology - UIST ’00, 213–216. https://doi.org/10.1145/354401.354778",
      "doi": "10.1145/354401.354778"
    },
    {
      "text": "Jay Henderson, Sylvain Malacria, Mathieu Nancel, and Edward Lank. 2020. Investigating the Necessity of Delay in Marking Menu Invocation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–13. https://doi.org/10.1145/3313831.3376296",
      "doi": "10.1145/3313831.3376296"
    },
    {
      "text": "Yvonne Jansen, Jonas Schjerlund, and Kasper Hornbæk. 2019. Effects of locomotion and visual overview on spatial memory when interacting with wall displays. In Conference on Human Factors in Computing Systems - Proceedings, 1–12. https://doi.org/10.1145/3290605.3300521",
      "doi": "10.1145/3290605.3300521"
    },
    {
      "text": "Martin Krzywinski and Naomi Altman. 2013. Points of Significance: Error bars. Nature Methods 10, 10: 921–922. https://doi.org/10.1038/nmeth.2659",
      "doi": ""
    },
    {
      "text": "Caitlin Kuhlman, Diana Doherty, Malika Nurbekova, Goutham Deva, Zarni Phyo, Paul Henry Schoenhagen, Mary Ann VanValkenburg, Elke Rundensteiner, and Lane Harrison. 2019. Evaluating preference collection methods for interactive ranking analytics. In Conference on Human Factors in Computing Systems - Proceedings, 1–11. https://doi.org/10.1145/3290605.3300742",
      "doi": "10.1145/3290605.3300742"
    },
    {
      "text": "Jianwei Lai and Dongsong Zhang. 2014. ExtendedThumb: A motion-based virtual thumb for improving one-handed target acquisition on touch-screen mobile devices. In Conference on Human Factors in Computing Systems - Proceedings, 1825–1830. https://doi.org/10.1145/2559206.2581158",
      "doi": "10.1145/2559206.2581158"
    },
    {
      "text": "David M. Lane, H. Albert Napier, S. Camille Peres, and Anikó Sándor. 2005. Hidden costs of graphical user interfaces: Failure to make the transition from menus and icon toolbars to keyboard shortcuts. International Journal of Human-Computer Interaction 18, 2: 133–144. https://doi.org/10.1207/s15327590ijhc1802_1",
      "doi": ""
    },
    {
      "text": "Sangyoon Lee, Youn-kyung Lim, and Geehyuk Lee. 2020. MirrorPad: Mirror on Touchpad for Direct Pen Interaction in the Laptop Environment. 1–9. https://doi.org/10.1145/3313831.3376212",
      "doi": ""
    },
    {
      "text": "Blaine Lewis, Greg D'Eon, Andy Cockburn, and Daniel Vogel. 2020. KeyMap: Improving Keyboard Shortcut Vocabulary Using Norman's Mapping. In CHI’20.",
      "doi": ""
    },
    {
      "text": "Sylvain Malacria, Gilles Bailly, Joel Harrison, Andy Cockburn, and Carl Gutwin. 2013. Promoting Hotkey use through rehearsal with ExposeHK. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13, 573. https://doi.org/10.1145/2470654.2470735",
      "doi": "10.1145/2470654.2470735"
    },
    {
      "text": "Pranathi Mylavarapu, Adil Yalçin, Xan Gregg, and Niklas Elmqvist. 2019. Ranked-list visualization: A graphical perception study. In Conference on Human Factors in Computing Systems - Proceedings, 1–12. https://doi.org/10.1145/3290605.3300422",
      "doi": "10.1145/3290605.3300422"
    },
    {
      "text": "Mathieu Pecchioli, Emmanuel Dubois, Pourang Irani, and Marcos Serrano. 2019. Investigating Screen Reachability on an Articulated Dual-Display Smartphone. . Springer, Cham, 476–485. https://doi.org/10.1007/978-3-030-29387-1_27",
      "doi": "10.1007/978-3-030-29387-1_27"
    },
    {
      "text": "Gary Perelman, Marcos Serrano, Mathieu Raynal, Celia Picard, Mustapha Derras, and Emmanuel Dubois. 2015. The Roly-Poly Mouse. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, 327–336. https://doi.org/10.1145/2702123.2702244",
      "doi": "10.1145/2702123.2702244"
    },
    {
      "text": "F. P. Preparata and S. J. Hong. 1977. Convex Hulls of Finite Sets of Points in Two and Three Dimensions. Communications of the ACM 20, 2: 87–93. https://doi.org/10.1145/359423.359430",
      "doi": "10.1145/359423.359430"
    },
    {
      "text": "Jef. Raskin. 2000. The humane interface: new directions for designing interactive systems. Addison-Wesley.",
      "doi": ""
    },
    {
      "text": "Anne Roudaut, Stéphane Huot, and Eric Lecolinet. 2008. TapTap and MagStick. In Proceedings of the working conference on Advanced visual interfaces - AVI ’08, 146. https://doi.org/10.1145/1385569.1385594",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "Joey Scarr, Andy Cockburn, Carl Gutwin, and Andrea Bunt. 2012. Improving command selection with CommandMaps. In Conference on Human Factors in Computing Systems - Proceedings, 257–266. https://doi.org/10.1145/2207676.2207713",
      "doi": "10.1145/2207676.2207713"
    },
    {
      "text": "Florine Simon, Anne Roudaut, Pourang Irani, and Marcos Serrano. 2019. Finding information on non-rectangular interfaces. In Conference on Human Factors in Computing Systems - Proceedings, 1–8. https://doi.org/10.1145/3290605.3300332",
      "doi": "10.1145/3290605.3300332"
    },
    {
      "text": "Xing-Dong Yang, Edward Mak, David McCallum, Pourang Irani, Xiang Cao, and Shahram Izadi. 2010. LensMouse. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10, 2431. https://doi.org/10.1145/1753326.1753695",
      "doi": "10.1145/1753326.1753695"
    },
    {
      "text": "Shengdong Zhao and Ravin Balakrishnan. 2004. Simple vs. compound mark hierarchical marking menus. In Proceedings of the 17th annual ACM symposium on User interface software and technology - UIST ’04, 33. https://doi.org/10.1145/1029632.1029639",
      "doi": "10.1145/1029632.1029639"
    },
    {
      "text": "Jingjie Zheng, Blaine Lewis, Jeff Avery, and Daniel Vogel. 2018. FingerArc and FingerChord. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST ’18, 347–363. https://doi.org/10.1145/3242587.3242589",
      "doi": "10.1145/3242587.3242589"
    },
    {
      "text": "Jingjie Zheng and Daniel Vogel. 2016. Finger-aware shortcuts. In Conference on Human Factors in Computing Systems - Proceedings, 4274–4285. https://doi.org/10.1145/2858036.2858355",
      "doi": "10.1145/2858036.2858355"
    },
    {
      "text": "Home | Loupedeck Online Store. Retrieved January 11, 2021 from https://loupedeck.com/en",
      "doi": ""
    },
    {
      "text": "Palette Gear: la console désormais compatible avec Capture One | Lense. Retrieved January 11, 2021 from https://www.lense.fr/news/palette-gear-la-console-desormais-compatible-avec-capture-one/",
      "doi": ""
    },
    {
      "text": "Data Analysis example with data from a real study. Retrieved April 21, 2020 from https://aviz.fr/ci/",
      "doi": ""
    },
    {
      "text": "ASUS ScreenPadTM et ScreenPadTM Plus. Retrieved December 17, 2020 from https://www.asus.fr/event/ScreenPad_et_ScreenPad_Plus/",
      "doi": ""
    },
    {
      "text": "2020. https://support.apple.com/en-us/HT207055.",
      "doi": ""
    },
    {
      "text": "2020. https://www.asus.com/us/site/zenbook/ux581.html.",
      "doi": ""
    },
    {
      "text": "2020. https://www.razer.com/projectlinda.",
      "doi": ""
    },
    {
      "text": "2020. https://en.wikipedia.org/wiki/Hand_(unit).",
      "doi": ""
    }
  ]
}