{
  "doi": "10.1145/3411764.3445783",
  "title": "Applying Critical Voice in Design of User Interfaces for Supporting Self-Reflection and Emotion Regulation in Online News Commenting",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "On digital media services, uncivil commenting is a persistent issue causing negative emotional reactions. One enabler for such problematic behavior is the user interface, conditioning, and structuring text-based communication online. However, the specific roles and influences of UIs are little understood, which calls for critical analysis of the current UI solutions as well as speculative exploration of alternative designs. This paper reports a research-through-design study on the problematic phenomenon regarding uncivil and inconsiderate commenting on online news, envisioning unconventional solutions with a critical voice. We unpack this problem area and outline critical perspectives to possible solutions by describing and analyzing four designs that propose to support emotion regulation by facilitating self-reflection. The design choices are further discussed in respect to interviews of ten news media experts. The findings are reflected against the question of how can critique meaningfully manifest in this challenging problem area.",
  "authors": [
    {
      "name": "Joel Kiskola",
      "institution": "Faculty of Information Technology and Communication Tampere University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702618",
      "orcid": "missing"
    },
    {
      "name": "Thomas Olsson",
      "institution": "Faculty of Information Technology and Communication Tampere University, Finland",
      "img": "/do/10.1145/contrib-99659364710/rel-imgonly/20180530-tdo_5098_small.jpg",
      "acmid": "99659364710",
      "orcid": "missing"
    },
    {
      "name": "Heli Väätäjä",
      "institution": "Lapland University of Applied Sciences, Finland",
      "img": "/do/10.1145/contrib-81384607160/rel-imgonly/heli-web.jpg",
      "acmid": "81384607160",
      "orcid": "missing"
    },
    {
      "name": "Aleksi H. Syrjämäki",
      "institution": "Research Group for Emotions, Sociality, and Computing Tampere University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700758",
      "orcid": "missing"
    },
    {
      "name": "Anna Rantasila",
      "institution": "Faculty of Informaton Technology and Communication Sciences Tampere University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702554",
      "orcid": "missing"
    },
    {
      "name": "Poika Isokoski",
      "institution": "Tampere Unit for Computer-Human Interaction (TAUCHI) Tampere University, Finland",
      "img": "/do/10.1145/contrib-81100311272/rel-imgonly/poika2_smaller.jpg",
      "acmid": "81100311272",
      "orcid": "missing"
    },
    {
      "name": "Mirja Ilves",
      "institution": "Research Group for Emotions, Sociality, and Computing Tampere University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490688640",
      "orcid": "missing"
    },
    {
      "name": "Veikko Surakka",
      "institution": "Research Group for Emotions, Sociality, and Computing Tampere University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339531194",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, Yang Wang, and Shomir Wilson. 2017. Nudges for privacy and security: Understanding and assisting users’ choices online. ACM Comput. Surv. 50, 3 (August 2017), 1–41. DOI: https://doi.org/10.1145/3054926",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Philip E. Agre. 1997. Computation and human experience. Cambridge University Press.",
      "doi": "10.5555/522884"
    },
    {
      "text": "Alexa. 2019. Alexa - Top Sites in Finland. Retrieved April 28, 2020 from https://www.alexa.com/topsites/countries/FI",
      "doi": ""
    },
    {
      "text": "Christie Aschwanden. 2016. We Asked 8,500 Internet Commenters Why They Do What They Do. Retrieved October 17, 2019 from https://fivethirtyeight.com/features/we-asked-8500-internet-commenters-why-they-do-what-they-do/",
      "doi": ""
    },
    {
      "text": "Jae Eul Bae, Youn Kyung Lim, Jin Bae Bang, and Myung Suk Kim. 2015. Pause moment experience in SNS communication. In CHI ’15: Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2113–2116. DOI: https://doi.org/10.1145/2702123.2702435",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is critical about critical design? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13, ACM Press, New York, New York, USA, 3297. DOI: https://doi.org/10.1145/2470654.2466451",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Mark A. Blythe. 2018. Critical Theory and Interaction Design. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Erik Stolterman. 2014. Reading critical designs. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. DOI: https://doi.org/10.1145/2556288.2557137",
      "doi": "10.1145/2556288.2557137"
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, Jodi Forlizzi, John Zimmerman, and John Antanitis. 2012. Critical design and critical theory: The challenge of designing for provocation. In Proceedings of the Designing Interactive Systems Conference, DIS ’12. DOI: https://doi.org/10.1145/2317956.2318001",
      "doi": "10.1145/2317956.2318001"
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A Short Essay on Design, Science, Fact and Fiction. Retrieved January 9, 2020 from http://drbfw5wfjlxon.cloudfront.net/writing/DesignFiction_WebEdition.pdf",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Enrique Encinas, Jofish Kaye, Miriam Lueck Avery, Rob McCabe, and Kristina Andersen. 2018. Imaginary design workbooks: Constructive criticism and practical provocations. In CHI ’18: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, Association for Computing Machinery, New York, New York, USA, 1–12. DOI: https://doi.org/10.1145/3173574.3173807",
      "doi": "10.1145/3173574.3173807"
    },
    {
      "text": "Luc Bovens. 2009. The Ethics of Nudge. In Preference Change. Springer Netherlands, 207–219. DOI: https://doi.org/10.1007/978-90-481-2593-7_10",
      "doi": ""
    },
    {
      "text": "Simon John Bowen. 2009. A critical artefact methodology: using provocative conceptual designs to foster human-centred innovation. Doctoral thesis, Sheffield Hallam University. Retrieved March 6, 2019 from http://shura.shu.ac.uk/3216/",
      "doi": ""
    },
    {
      "text": "Richard Buchanan. 1992. Wicked Problems in Design Thinking. Des. Issues 8, 2 (1992), 5–21.",
      "doi": ""
    },
    {
      "text": "Simon Buckingham Shum. 2008. Cohere: Towards Web 2.0 Argumentation. In Proc. COMMA’08: 2nd International Conference on Computational Models of Argument, 97–108. DOI: https://doi.org/10.5860/choice.51-2973",
      "doi": ""
    },
    {
      "text": "Ana Caraban, Evangelos Karapanos, Daniel Gonçalves, and Pedro Campos. 2019. 23 Ways to Nudge. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM Press, New York, New York, USA, 1–15. DOI: https://doi.org/10.1145/3290605.3300733",
      "doi": "10.1145/3290605.3300733"
    },
    {
      "text": "Gina Masullo Chen and Yee Man Margaret Ng. 2017. Nasty online comments anger you more than me, but nice ones make me as happy as you. Comput. Human Behav. 71, (June 2017), 181–188. DOI: https://doi.org/10.1016/j.chb.2017.02.010",
      "doi": "10.1016/j.chb.2017.02.010"
    },
    {
      "text": "Gina Masullo Chen and Paromita Pain. 2017. Normalizing Online Comments. Journal. Pract. 11, 7 (August 2017), 876–892. DOI: https://doi.org/10.1080/17512786.2016.1205954",
      "doi": ""
    },
    {
      "text": "Thomas Davidson, Debasmita Bhattacharya, and Ingmar Weber. 2019. Racial Bias in Hate Speech and Abusive Language Detection Datasets. In In: Proceedings of the third workshop on abusive language online, Florence; 2019., Association for Computational Linguistics (ACL), 25–35. DOI: https://doi.org/10.18653/v1/w19-3504",
      "doi": ""
    },
    {
      "text": "Thomas Davidson, Dana Warmsley, Michael Macy, and Ingmar Weber. 2017. Automated Hate Speech Detection and the Problem of Offensive Language. In Proceedings of the 11th International Conference on Web and Social Media, ICWSM 2017, AAAI Press, 512–515. Retrieved December 20, 2020 from http://arxiv.org/abs/1703.04009",
      "doi": ""
    },
    {
      "text": "Pablo Delgado. 2019. How El País used Perspective API to make their comments section less toxic. Retrieved December 17, 2019 from https://www.blog.google/outreach-initiatives/google-news-initiative/how-el-pais-used-ai-make-their-comments-section-less-toxic/",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos and Mor Naaman. 2011. Towards Quality Discourse in Online News Comments Human Factors. In Proceedings of the ACM 2011 conference on Computer supported cooperative work 2011 Mar 19, 133–142. Retrieved June 19, 2019 from http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.188.3516&rep=rep1&type=pdf",
      "doi": "10.1145/1958824.1958844"
    },
    {
      "text": "Brian R. Duffy. 2003. Anthropomorphism and the social robot. In Robotics and Autonomous Systems, 177–190. DOI: https://doi.org/10.1016/S0921-8890(02)00374-3",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. Dunne & Raby Projects. Retrieved January 31, 2020 from http://dunneandraby.co.uk/content/projects",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2001. Design Noir: The Secret Life of Electronic Objects. Birkhäuser.",
      "doi": ""
    },
    {
      "text": "eBizMBA. 2019. Top 15 Most Popular News Websites | September 2019. Retrieved October 17, 2019 from http://www.ebizmba.com/articles/news-websites",
      "doi": ""
    },
    {
      "text": "Nancy Fraser. 1990. Rethinking the Public Sphere: A Contribution to the Critique of Actually Existing Democracy. Soc. Text 25/26 (1990), 56. DOI: https://doi.org/10.2307/466240",
      "doi": ""
    },
    {
      "text": "Batya Friedman. 1996. Value-sensitive design. Interactions 3, 6 (December 1996), 16–23. DOI: https://doi.org/10.1145/242485.242493",
      "doi": "10.1145/242485.242493"
    },
    {
      "text": "Becky Gardiner, Mahana Mansfield, Ian Anderson, Josh Holder, Daan Louter, and Monica Ulmanu. 2016. The dark side of Guardian comments | Technology | The Guardian. Retrieved October 16, 2019 from https://www.theguardian.com/technology/2016/apr/12/the-dark-side-of-guardian-comments?",
      "doi": ""
    },
    {
      "text": "William W. Gaver, John Bowers, Andrew Boucher, Hans Gellerson, Sarah Pennington, Albrecht Schmidt, Anthony Steed, Nicholas Villars, and Brendan Walker. 2004. The drift table. In Extended abstracts of the 2004 conference on Human factors and computing systems - CHI ’04, ACM Press, New York, New York, USA, 885. DOI: https://doi.org/10.1145/985921.985947",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2018. Custodians of the Internet: Platforms, content moderation, and the hidden decisions that shape social media. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Erving Goffmann. 1956. The Presentation of Self in Everyday Life. Doubleday.",
      "doi": ""
    },
    {
      "text": "Kirsikka Grön and Matti Nelimarkka. 2020. Party Politics, Values and the Design of Social Media Services. Proc. ACM Human-Computer Interact. 4, CSCW2 (2020). DOI: https://doi.org/10.1145/3415175",
      "doi": "10.1145/3415175"
    },
    {
      "text": "James J. Gross. 1998. The Emerging Field of Emotion Regulation: An Integrative Review. Rev. Gen. Psychol. 2, 3 (September 1998), 271–299. DOI: https://doi.org/10.1037/1089-2680.2.3.271",
      "doi": ""
    },
    {
      "text": "Ståle Grut. 2017. With a quiz to comment, readers test their article comprehension. Retrieved January 20, 2020 from https://nrkbeta.no/2017/08/10/with-a-quiz-to-comment-readers-test-their-article-comprehension/",
      "doi": ""
    },
    {
      "text": "Amos Guiora and Elizabeth A. Park. 2017. Hate Speech on Social Media. Philosophia (Mendoza). 45, 3 (September 2017), 957–971. DOI: https://doi.org/10.1007/s11406-017-9858-4",
      "doi": ""
    },
    {
      "text": "Jürgen Habermas. 1991. The Structural Transformation of the Public Sphere: An inquiry into a category of bourgeois society. The MIT Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Netta Iivari and Kari Kuutti. 2017. Critical Design Research and Information Technology. 983–993. DOI: https://doi.org/10.1145/3064663.3064747",
      "doi": ""
    },
    {
      "text": "Netta Iivari and Kari Kuutti. 2017. Towards Critical Design Science Research. In International Conference On Information (ICIS) 2017. Association For Information Systems. Retrieved August 19, 2019 from http://aisel.aisnet.org/icis2017/ResearchMethods/Presentations/10",
      "doi": ""
    },
    {
      "text": "Jigsaw. 2017. Perspective API. Retrieved October 16, 2019 from https://www.perspectiveapi.com/#/home",
      "doi": ""
    },
    {
      "text": "Leon Karlsen Johannessen. 2017. The Young Designer's Guide to Speculative and Critical Design. Norwegian University of Science and Technology.",
      "doi": ""
    },
    {
      "text": "Vera Khovanskaya, Eric P S Baumer, Dan Cosley, Stephen Voida, and Geri Gay. 2013. “Everybody Knows What You're Doing”: A Critical Design Approach to Personal Informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13).",
      "doi": "10.1145/2470654.2466467"
    },
    {
      "text": "Travis Kriplean, Jonathan Morgan, Deen Freelon, Alan Borning, and Lance Bennett. 2012. Supporting reflective public thought with considerit. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work - CSCW ’12. DOI: https://doi.org/10.1145/2145204.2145249",
      "doi": "10.1145/2145204.2145249"
    },
    {
      "text": "Minae Kwon, Malte F. Jung, and Ross A. Knepper. 2016. Human expectations of social robots. In HRI ’16: The Eleventh ACM/IEEE International Conference on Human Robot Interaction, IEEE Computer Society, 463–464. DOI: https://doi.org/10.1109/HRI.2016.7451807",
      "doi": ""
    },
    {
      "text": "Geoffrey C. Layman, Thomas M. Carsey, and Juliana Menasce Horowitz. 2006. PARTY POLARIZATION IN AMERICAN POLITICS: Characteristics, Causes, and Consequences. Annu. Rev. Polit. Sci. 9, 1 (June 2006), 83–110. DOI: https://doi.org/10.1146/annurev.polisci.9.070204.105138",
      "doi": ""
    },
    {
      "text": "Anders Sundnes Løvlie, Karoline Andrea Ihlebæk, and Anders Olof Larsson. 2018. User Experiences with Editorial Control in Online Newspaper Comment Fields. Journal. Pract. 12, 3 (March 2018), 362–381. DOI: https://doi.org/10.1080/17512786.2017.1293490",
      "doi": ""
    },
    {
      "text": "Donna Lu. 2019. Google's hate speech AI may be racially biased. New Sci. 243, 3243 (August 2019), 7. DOI: https://doi.org/10.1016/s0262-4079(19)31505-2",
      "doi": ""
    },
    {
      "text": "Matt Malpass. 2013. Between Wit and Reason: Defining Associative, Speculative, and Critical Design in Practice. Des. Cult. 5, 3 (2013), 333–356. DOI: https://doi.org/10.2752/175470813X13705953612200",
      "doi": ""
    },
    {
      "text": "Matt Malpass. 2012. Contextualising Critical Design: Towards a Taxonomy of Critical Practice in Product Design. Doctoral thesis, Nottingham Trent University. Retrieved March 6, 2019 from https://core.ac.uk/download/pdf/18419931.pdf",
      "doi": ""
    },
    {
      "text": "Courtney Napoles, Joel Tetreault, Aasish Pappu, Enrica Rosato, and Brian Provenzale. 2017. Finding Good Conversations Online: The Yahoo News Annotated Comments Corpus. (2017), 13–23. DOI: https://doi.org/10.18653/v1/w17-0802",
      "doi": ""
    },
    {
      "text": "Adewale Obadimu, Esther Mead, Muhammad Nihal Hussain, and Nitin Agarwal. 2019. Identifying toxicity within youtube video comment. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Springer Verlag, 214–223. DOI: https://doi.org/10.1007/978-3-030-21741-9_22",
      "doi": ""
    },
    {
      "text": "Thomas Olsson, Pradthana Jarusriboonchai, Paweł Woźniak, Susanna Paasovaara, Kaisa Väänänen, and Andrés Lucero. 2019. Technologies for Enhancing Collocated Social Interaction: Review of Design Solutions and Approaches. Comput. Support. Coop. Work CSCW An Int. J. (2019). DOI: https://doi.org/10.1007/s10606-019-09345-0",
      "doi": ""
    },
    {
      "text": "James Pierce. 2015. Working by Not Quite Working: Resistance as a Technique for Alternative and Oppositional Designs. Doctoral thesis, Carnegie Mellon University. Retrieved from http://reports-archive.adm.cs.cmu.edu/anon/hcii/CMU-HCII-15-109.pdf",
      "doi": ""
    },
    {
      "text": "James Pierce, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver, and Carl DiSalvo. 2015. Expanding and Refining Design and Criticality in HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, 2083–2092. DOI: https://doi.org/10.1145/2702123.2702438",
      "doi": "10.1145/2702123.2702438"
    },
    {
      "text": "Fabian Prochazka, Patrick Weber, and Wolfgang Schweiger. 2018. Effects of Civility and Reasoning in User Comments on Perceived Journalistic Quality. Journal. Stud. 19, 1 (January 2018), 62–78. DOI: https://doi.org/10.1080/1461670X.2016.1161497",
      "doi": ""
    },
    {
      "text": "Milena Radzikowska. 2015. Looking for Betsy: A Critical Theory Approach to Visibility and Pluralism in Design. Doctoral thesis, University of Alberta.",
      "doi": ""
    },
    {
      "text": "Dimitrios Raptis, Rikke Hagensby Jensen, Jesper Kjeldskov, and Mikael B. Skov. 2017. Aesthetic, Functional and Conceptual Provocation in Research Through Design. In Proceedings of the 2017 Conference on Designing Interactive Systems - DIS ’17, 29–41. DOI: https://doi.org/10.1145/3064663.3064739",
      "doi": ""
    },
    {
      "text": "Reporters Without Borders. 2020. 2020 World Press Freedom Index. Retrieved September 10, 2020 from https://rsf.org/en/ranking",
      "doi": ""
    },
    {
      "text": "Esa Reunanen. 2020. Uutismedia verkossa 2020. Reuters-instituutin Digital News Report - Suomen maaraportti. Tampere. Retrieved August 31, 2020 from http://urn.fi/URN:ISBN:978-952-03-1610-5",
      "doi": ""
    },
    {
      "text": "Ian Rowe. 2015. Civility 2.0: a comparative analysis of incivility in online political discussion. Inf. Commun. Soc. 18, 2 (February 2015), 121–138. DOI: https://doi.org/10.1080/1369118X.2014.940365",
      "doi": ""
    },
    {
      "text": "Minna Ruckenstein and Linda Lisa Maria Turunen. 2020. Re-humanizing the platform: Content moderators and the logic of care. New Media & Society, 22(6). DOI: https://doi.org/10.1177/1461444819875990",
      "doi": ""
    },
    {
      "text": "Iiris Ruoho and Sinikka Torkkola. 2018. Toward a Multidimensional Approach. 39, (2018), 67–79. DOI: https://doi.org/10.2478/nor-2018-0002.67",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Tianmi Fang, Luca Damasco, Mianhong Cherie Chen, Likang Sun, and Geoff Kaufman. 2019. Designing user interface elements to improve the quality and civility of discourse in online commenting behaviors. Conf. Hum. Factors Comput. Syst. - Proc. (2019), 1–14. DOI: https://doi.org/10.1145/3290605.3300836",
      "doi": "10.1145/3290605.3300836"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph “Jofish” Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing between sense and sensibility - CC ’05, ACM Press, New York, New York, USA, 49. DOI: https://doi.org/10.1145/1094562.1094569",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Aaron Smale. 2016. Rhetorical Strategies: Logos, Ethos, Pathos, Kairos | University of Nevada, Reno – UWSC. Retrieved October 17, 2019 from https://writingcenter.blogs.unr.edu/2016/10/12/rhetorical-strategies-logos-ethos-pathos-kairos/",
      "doi": ""
    },
    {
      "text": "Nina Springer, Ines Engelmann, and Christian Pfaffinger. 2015. User comments: motives and inhibitors to write and read. Information, Commun. Soc. 18, 7 (July 2015), 798–815. DOI: https://doi.org/10.1080/1369118X.2014.997268",
      "doi": ""
    },
    {
      "text": "Cass Sunstein and Richard Thaler. 2009. Nudge: Improving decisions about health, wealth, and happiness. Penguin.",
      "doi": ""
    },
    {
      "text": "Bruce M. Tharp and Stephanie Tharp. 2019. Discursive design: critical, speculative, and alternative things. MIT Press.",
      "doi": ""
    },
    {
      "text": "The Economist Intelligence Unit. 2020. Democracy Index 2019 - A Year of Democratic Setbacks and popular protest. London.",
      "doi": ""
    },
    {
      "text": "Jared B. Torre and Matthew D. Lieberman. 2018. Putting Feelings Into Words: Affect Labeling as Implicit Emotion Regulation. Emot. Rev. 10, 2 (April 2018), 116–124. DOI: https://doi.org/10.1177/1754073917742706",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther. 1993. Impression development in computer‐mediated interaction. West. J. Commun. 57, 4 (December 1993), 381–398. DOI: https://doi.org/10.1080/10570319309374463",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther. 1996. Computer-Mediated Communication. Communic. Res. 23, 1 (February 1996), 3–43. DOI: https://doi.org/10.1177/009365096023001001",
      "doi": ""
    },
    {
      "text": "J. David Wolfgang. 2018. Cleaning up the “Fetid Swamp.” Digit. Journal. 6, 1 (January 2018), 21–40. DOI: https://doi.org/10.1080/21670811.2017.1343090",
      "doi": ""
    },
    {
      "text": "J David Wolfgang. 2018. Taming the ‘trolls’: How journalists negotiate the boundaries of journalism and online comments. Journalism (March 2018), 146488491876236. DOI: https://doi.org/10.1177/1464884918762362",
      "doi": ""
    },
    {
      "text": "Gavin Wood, Kiel Long, Tom Feltwell, Scarlett Rowland, Phillip Brooker, Jamie Mahoney, John Vines, Julie Barnett, and Shaun Lawson. 2018. Rethinking engagement with online news through social and visual co-annotation. Conf. Hum. Factors Comput. Syst. - Proc. 2018-April, (2018), 1–12. DOI: https://doi.org/10.1145/3173574.3174150",
      "doi": "10.1145/3173574.3174150"
    }
  ]
}