{
  "doi": "10.1145/3411764.3445660",
  "title": "More Kawaii than a Real-Person Live Streamer: Understanding How the Otaku Community Engages with and Perceives Virtual YouTubers",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Live streaming has become increasingly popular, with most streamers presenting their real-life appearance. However, Virtual YouTubers (VTubers), virtual 2D or 3D avatars that are voiced by humans, are emerging as live streamers and attracting a growing viewership in East Asia. Although prior research has found that many viewers seek real-life interpersonal interactions with real-person streamers, it is currently unknown what makes VTuber live streams engaging or how they are perceived differently than real-person streamers. We conducted an interview study to understand how viewers engage with VTubers and perceive the identities of the voice actors behind the avatars (i.e., Nakanohito). The data revealed that Virtual avatars bring unique performative opportunities which result in different viewer expectations and interpretations of VTuber behavior. Viewers intentionally upheld the disembodiment of VTuber avatars from their voice actors. We uncover the nuances in viewer perceptions and attitudes and further discuss the implications of VTuber practices to the understanding of live streaming in general.",
  "tags": [
    "virtual YouTuber",
    "virtual idols",
    "user engagement",
    "social media",
    "live streaming"
  ],
  "authors": [
    {
      "name": "Zhicong Lu",
      "institution": "Department of Computer Science University of Toronto, Canada",
      "img": "/do/10.1145/contrib-99659162049/rel-imgonly/photo.jpg",
      "acmid": "99659162049",
      "orcid": "0000-0002-7761-6351"
    },
    {
      "name": "Chenxinran Shen",
      "institution": "DGP University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659699000",
      "orcid": "missing"
    },
    {
      "name": "Jiannan Li",
      "institution": "Department of Computer Science University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260950",
      "orcid": "0000-0001-8409-4910"
    },
    {
      "name": "Hong Shen",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659589829",
      "orcid": "0000-0002-5364-3718"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "Department of Computer Science University of Toronto, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    }
  ],
  "references": [
    {
      "text": "株式会社ユーザーローカル. 2020. バーチャルYouTuber、本日1万人を突破（ユーザーローカル調べ）｜株式会社ユーザーローカル. https://www.userlocal.jp/press/20200115vi/. [Online; accessed 16-January-2020].",
      "doi": ""
    },
    {
      "text": "株式会社ユーザーローカル. 2020. ファン数ランキング(1ページ) | バーチャルYouTuberランキング. https://virtual-youtuber.userlocal.jp/document/ranking. [Online; accessed 16-January-2020].",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson, Andrew C Beall, Jack Loomis, Jim Blascovich, and Matthew Turk. 2004. Transformed social interaction: Decoupling representation from behavior and form in collaborative virtual environments. Presence: Teleoperators & Virtual Environments 13, 4(2004), 428–441.",
      "doi": "10.1162/1054746041944803"
    },
    {
      "text": "Bilibili. 2020. Bilibili. https://www.bilibili.com/.",
      "doi": ""
    },
    {
      "text": "Daniel Black. 2012. The virtual idol: Producing and consuming digital femininity. In Idols and celebrity in Japanese media culture. Palgrave Macmillan, London, UK, 209–228.",
      "doi": ""
    },
    {
      "text": "Raymond Blanton and Darlene Carbajal. 2019. Not a Girl, Not Yet a Woman: A Critical Case Study on Social Media, Deception, and Lil Miquela. In Handbook of Research on Deception, Fake News, and Misinformation Online. IGI Global, Hershey, PA, USA, 87–103.",
      "doi": ""
    },
    {
      "text": "Di Laura Chen, Dustin Freeman, and Ravin Balakrishnan. 2019. Integrating Multimedia Tools to Enrich Interactions in Live Streaming for Language Learning. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 438.",
      "doi": "10.1145/3290605.3300668"
    },
    {
      "text": "Mark Childs. 2011. Identity: A Primer. Springer London, London, 13–31. https://doi.org/10.1007/978-0-85729-361-9_2",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 1998. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage Publications, Inc, Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Donna Z Davis. 2010. Exploring the media effects of three-dimensional online immersive worlds and how they impact both virtual and real social capital. University of Florida.",
      "doi": ""
    },
    {
      "text": "Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J Moore. 2006. Alone together?: exploring the social dynamics of massively multiplayer online games. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, ACM, New York, NY, USA, 407–416.",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "Dwango. 2020. Niconico. https://www.nicovideo.jp/.",
      "doi": ""
    },
    {
      "text": "Travis Faas, Lynn Dombrowski, Alyson Young, and Andrew D. Miller. 2018. Watch Me Code: Programming Mentorship Communities on Twitch.Tv. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article Article 50 (Nov. 2018), 18 pages. https://doi.org/10.1145/3274319",
      "doi": "10.1145/3274319"
    },
    {
      "text": "C Ailie Fraser, Joy O Kim, Alison Thornsberry, Scott Klemmer, and Mira Dontcheva. 2019. Sharing the Studio: How Creative Livestreaming can Inspire, Educate, and Engage. In Proceedings of the 2019 on Creativity and Cognition. ACM, ACM, New York, NY, USA, 144–155.",
      "doi": "10.1145/3325480.3325485"
    },
    {
      "text": "Guo Freeman, Samaneh Zamanifard, Divine Maloney, and Alexandra Adkins. 2020. My Body, My Avatar: How People Perceive Their Avatars in Social Virtual Reality. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382923",
      "doi": "10.1145/3334480.3382923"
    },
    {
      "text": "Noam Gal, Limor Shifman, and Zohar Kampf. 2016. “It Gets Better”: Internet memes and the construction of collective identity. New Media & Society 18, 8 (2016), 1698–1714. https://doi.org/10.1177/1461444814568784",
      "doi": ""
    },
    {
      "text": "Patrick W Galbraith. 2009. Moe: Exploring virtual potential in post-millennial Japan. electronic journal of contemporary japanese studies 9, 3 (2009).",
      "doi": ""
    },
    {
      "text": "Patrick W Galbraith. 2012. Idols: The image of desire in Japanese consumer capitalism. In Idols and celebrity in Japanese media culture. Springer, New York, NY, USA, 185–208.",
      "doi": ""
    },
    {
      "text": "Patrick W Galbraith and Jason G Karlin. 2012. Introduction: The mirror of idols and celebrity. In Idols and celebrity in Japanese media culture. Springer, New York, NY, USA, 1–32.",
      "doi": ""
    },
    {
      "text": "Seth Glickman, Nathan McKenzie, Joseph Seering, Rachel Moeller, and Jessica Hammer. 2018. Design Challenges for Livestreamed Audience Participation Games. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’18). ACM, New York, NY, USA, 187–199. https://doi.org/10.1145/3242671.3242708",
      "doi": "10.1145/3242671.3242708"
    },
    {
      "text": "Mar Gonzalez-Franco, Anthony Steed, Steve Hoogendyk, and Eyal Ofek. 2020. Using Facial Animation to Increase the Enfacement Illusion and Avatar Self-Identification. IEEE Transactions on Visualization and Computer Graphics 26, 5(2020), 2023–2029.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson and John C. Tang. 2017. What Makes Live Events Engaging on Facebook Live, Periscope, and Snapchat. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 48–60. https://doi.org/10.1145/3025453.3025642",
      "doi": ""
    },
    {
      "text": "William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on Twitch: Fostering Participatory Communities of Play Within Live Mixed Media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, New York, NY, USA, 1315–1324. https://doi.org/10.1145/2556288.2557048",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "William A. Hamilton, Nic Lupfer, Nicolas Botello, Tyler Tesch, Alex Stacy, Jeremy Merrill, Blake Williford, Frank R. Bentley, and Andruid Kerne. 2018. Collaborative Live Media Curation: Shared Context for Participation in Online Learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, Article 555, 14 pages. https://doi.org/10.1145/3173574.3174129",
      "doi": "10.1145/3173574.3174129"
    },
    {
      "text": "Hololive. 2020. Hololive. https://www.hololive.tv/.",
      "doi": ""
    },
    {
      "text": "Mizuko Ito, Daisuke Okabe, and Izumi Tsuji. 2012. Fandom unbound: Otaku culture in a connected world. Yale University Press, NEw Haven, CT, USA.",
      "doi": ""
    },
    {
      "text": "Maurice Jakesch, Megan French, Xiao Ma, Jeffrey T Hancock, and Mor Naaman. 2019. AI-Mediated Communication: How the Perception that Profile Text was Written by AI Affects Trustworthiness. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 239.",
      "doi": "10.1145/3290605.3300469"
    },
    {
      "text": "Phylis Johnson. 2010. Second Life, Media, and the Other Society. Peter Lang.",
      "doi": ""
    },
    {
      "text": "Lucas Kempe-Cook, Stephen Tsung-Han Sher, and Norman Makoto Su. 2019. Behind the Voices: The Practice and Challenges of Esports Casters. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, Article Paper 565, 12 pages. https://doi.org/10.1145/3290605.3300795",
      "doi": "10.1145/3290605.3300795"
    },
    {
      "text": "Kangsoo Kim, Arjun Nagendran, Jeremy N. Bailenson, Andrew Raij, Gerd Bruder, Myungho Lee, Ryan Schubert, Xin Yan, and Gregory F. Welch. 2017. A Large-Scale Study of Surrogate Physicality and Gesturing on Human–Surrogate Interactions in a Public Space. Frontiers in Robotics and AI 4 (2017), 32. https://doi.org/10.3389/frobt.2017.00032",
      "doi": ""
    },
    {
      "text": "Yubo Kou, Xinning Gui, Shaozeng Zhang, and Bonnie Nardi. 2017. Managing disruptive behavior through non-hierarchical governance: Crowdsourcing in League of Legends and Weibo. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 62.",
      "doi": "10.1145/3134697"
    },
    {
      "text": "Lily Kuo. 2018. World’s first AI news anchor unveiled in China. Retrieved June 7, 2019 from https://www.theguardian.com/world/2018/nov/09/worlds-first-ai-news-anchor-unveiled-in-china",
      "doi": ""
    },
    {
      "text": "Ka Yan Lam. 2016. The Hatsune Miku Phenomenon: More Than a Virtual J-Pop Diva. The Journal of Popular Culture 49, 5 (2016), 1107–1124.",
      "doi": ""
    },
    {
      "text": "Linh K Le. 2014. Examining the rise of Hatsune Miku: the first international virtual idol. The UCI Undergraduate Research Journal 13, 1 (2014), 1–12.",
      "doi": ""
    },
    {
      "text": "Alex Leavitt, Tara Knight, and Alex Yoshiba. 2016. Producing Hatsune Miku: Concerts, Commercialization, and the Politics of Peer Production. In Media Convergence in Japan. Kinema Club, New Haven, CT, USA, 200–229.",
      "doi": ""
    },
    {
      "text": "Pascal Lessel, Alexander Vielhauer, and Antonio Krüger. 2017. Expanding Video Game Live-Streams with Enhanced Communication Channels: A Case Study. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 1571–1576. https://doi.org/10.1145/3025453.3025708",
      "doi": "10.1145/3025453.3025708"
    },
    {
      "text": "Jie Li, Xinning Gui, Yubo Kou, and Yukun Li. 2019. Live Streaming as Co-Performance: Dynamics between Center and Periphery in Theatrical Engagement. Proceedings of the ACM on Human-Computer Interaction 3, CSCW, Article 64 (Nov. 2019), 22 pages. https://doi.org/10.1145/3359166",
      "doi": "10.1145/3359166"
    },
    {
      "text": "Christine Liao. 2011. Virtual fashion play as embodied identity re/assembling: Second Life fashion bloggers and their avatar bodies. In Reinventing ourselves: contemporary concepts of identity in virtual Worlds. Springer, London, UK, 101–127.",
      "doi": ""
    },
    {
      "text": "Danielle Lottridge, Frank Bentley, Matt Wheeler, Jason Lee, Janet Cheung, Katherine Ong, and Cristy Rowley. 2017. Third-Wave Livestreaming: Teens’ Long Form Selfie. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’17). Association for Computing Machinery, New York, NY, USA, Article 20, 12 pages. https://doi.org/10.1145/3098279.3098540",
      "doi": "10.1145/3098279.3098540"
    },
    {
      "text": "Zhicong Lu, Michelle Annett, Mingming Fan, and Daniel Wigdor. 2019. “I Feel It is My Responsibility to Stream”: Streaming and Engaging with Intangible Cultural Heritage through Livestreaming. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, Article Paper 229, 14 pages. https://doi.org/10.1145/3290605.3300459",
      "doi": "10.1145/3290605.3300459"
    },
    {
      "text": "Zhicong Lu, Michelle Annett, and Daniel Wigdor. 2019. Vicariously Experiencing it all without Going Outside: A Study of Outdoor Livestreaming in China. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–28.",
      "doi": "10.1145/3359127"
    },
    {
      "text": "Zhicong Lu, Seongkook Heo, and Daniel Wigdor. 2018. StreamWiki: Enabling Viewers of Knowledge Sharing Live Streams to Collaboratively Generate Archival Documentation for Effective In-Stream and Post-Hoc Learning. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), Article 112. https://doi.org/10.1145/3274381",
      "doi": "10.1145/3274381"
    },
    {
      "text": "Zhicong Lu, Haijun Xia, Seongkook Heo, and Daniel Wigdor. 2018. You Watch, You Give, and You Engage: A Study of Live Streaming Practices in China. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, Article Paper 466, 13 pages. https://doi.org/10.1145/3173574.3174040",
      "doi": "10.1145/3173574.3174040"
    },
    {
      "text": "Tetsuya Nakajo. 2020. Live2D. https://www.live2d.com/en/.",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi. 2010. My life as a night elf priest: An anthropological account of World of Warcraft. University of Michigan Press, Ann Arbor, MI, USA.",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Elena Fedorovskaya. 2009. Capturing and sharing memories in a virtual world. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 1161–1170.",
      "doi": "10.1145/1518701.1518878"
    },
    {
      "text": "Carman Neustaedter and Elena Fedorovskaya. 2009. Presenting Identity in a Virtual World through Avatar Appearances. In Proceedings of Graphics Interface 2009(GI ’09). Canadian Information Processing Society, CAN, 183–190.",
      "doi": "10.5555/1555880.1555921"
    },
    {
      "text": "Nijisanji. 2020. Nijisanji. https://nijisanji.ichikara.co.jp/.",
      "doi": ""
    },
    {
      "text": "Asaf Nissenbaum and Limor Shifman. 2017. Internet memes as contested cultural capital: The case of 4chan’s /b/ board. New Media & Society 19, 4 (2017), 483–501. https://doi.org/10.1177/1461444815609313",
      "doi": ""
    },
    {
      "text": "National Geographic of Azeroth Forum. 2020. National Geographic of Azeroth Forum: VTuber Discussion Board. https://bbs.nga.cn/thread.php?fid=-60204499.",
      "doi": ""
    },
    {
      "text": "Soo Youn Oh, Jeremy Bailenson, Nicole Krämer, and Benjamin Li. 2016. Let the Avatar Brighten Your Smile: Effects of Enhancing Facial Expressions in Virtual Environments. PLOS ONE 11, 9 (09 2016), 1–18. https://doi.org/10.1371/journal.pone.0161794",
      "doi": ""
    },
    {
      "text": "Anthony J. Pellicone and June Ahn. 2017. The Game of Performing Play: Understanding Streaming As Cultural Production. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 4863–4874. https://doi.org/10.1145/3025453.3025854",
      "doi": ""
    },
    {
      "text": "Linden Research. 2014. Live Performances - Second Live Wiki. Retrieved May 23, 2020 from http://wiki.secondlife.com/wiki/Live_Performances",
      "doi": ""
    },
    {
      "text": "Jeff T. Sheng and Sanjay R. Kairam. 2020. From Virtual Strangers to IRL Friends: Relationship Development in Livestreaming Communities on Twitch. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 94 (Oct. 2020), 34 pages. https://doi.org/10.1145/3415165",
      "doi": ""
    },
    {
      "text": "Stephen Tsung-Han Sher and Norman Makoto Su. 2019. Speedrunning for Charity: How Donations Gather Around a Live Streamed Couch. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article Article 48 (Nov. 2019), 26 pages. https://doi.org/10.1145/3359150",
      "doi": ""
    },
    {
      "text": "SimilarWeb. 2020. Bbs.nga.cn Analytics - Market Share Stats & Traffic Ranking. https://www.similarweb.com/website/bbs.nga.cn. [Online; accessed 16-January-2020].",
      "doi": ""
    },
    {
      "text": "John Tang, Gina Venolia, Kori Inkpen, Charles Parker, Robert Gruen, and Alicia Pelton. 2017. Crowdcasting: Remotely Participating in Live Events Through Multiple Live Streams. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 98 (Dec. 2017), 18 pages. https://doi.org/10.1145/3134733",
      "doi": "10.1145/3134733"
    },
    {
      "text": "John C. Tang, Gina Venolia, and Kori M. Inkpen. 2016. Meerkat and Periscope: I Stream, You Stream, Apps Stream for Live Streams. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 4770–4780. https://doi.org/10.1145/2858036.2858374",
      "doi": "10.1145/2858036.2858374"
    },
    {
      "text": "TL Taylor. 2018. Watch me play: Twitch and the rise of game live streaming. Vol. 24. Princeton University Press, Princeton, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther. 1996. Computer-mediated communication: Impersonal, interpersonal, and hyperpersonal interaction. Communication research 23, 1 (1996), 3–43.",
      "doi": ""
    },
    {
      "text": "Joseph B Walther. 2011. Theories of computer-mediated communication and interpersonal relations. The handbook of interpersonal communication 4 (2011), 443–479.",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn. 2019. Volunteer Moderators in Twitch Micro Communities: How They Get Involved, the Roles They Play, and the Emotional Labor They Experience. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 160.",
      "doi": "10.1145/3290605.3300390"
    },
    {
      "text": "Donghee Yvette Wohn, Guo Freeman, and Caitlin McLaughlin. 2018. Explaining viewers’ emotional, instrumental, and financial support provision for live streamers. In Proceedings of the 2018 CHI conference on human factors in computing systems(CHI ’18). ACM, ACM, New York, NY, USA, 474.",
      "doi": "10.1145/3173574.3174048"
    },
    {
      "text": "Jamie Woodcock and Mark R Johnson. 2019. The Affective Labor and Performance of Live Streaming on Twitch.tv. Television & New Media 20 (2019), 1527476419851077. Issue 8.",
      "doi": ""
    },
    {
      "text": "Nick Yee, Jeremy N Bailenson, and Kathryn Rickertsen. 2007. A Meta-Analysis of the Impact of the Inclusion and Realism of Human-like Faces on User Experiences in Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/1240624.1240626",
      "doi": "10.1145/1240624.1240626"
    },
    {
      "text": "Yiyi Yin. 2018. Vocaloid in China: Cosmopolitan music, cultural expression, and multilayer identity. Global Media and China 3, 1 (2018), 51–66. https://doi.org/10.1177/2059436418778600",
      "doi": ""
    },
    {
      "text": "Japan National Tourism Organization New York. 2018. JNTO to Launch ’Come to Japan’ Campaign With Kizuna AI, the World’s First Virtual YouTuber. Retrieved May 31, 2020 from https://www.prnewswire.com/news-releases/jnto-to-launch-come-to-japan-campaign-with-kizuna-ai-the-worlds-first-virtual-youtuber-300608037.html",
      "doi": ""
    },
    {
      "text": "依光流. 2018. 冯提莫不是 B 站直播的杀招，Vtuber 才是. Retrieved May 31, 2020 from https://www.ifanr.com/1325444",
      "doi": ""
    }
  ]
}