{
  "doi": "10.1145/3411764.3445649",
  "title": "Towards an Understanding of Situated AR Visualization for Basketball Free-Throw Training",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present an observational study to compare co-located and situated real-time visualizations in basketball free-throw training. Our goal is to understand the advantages and concerns of applying immersive visualization to real-world skill-based sports training and to provide insights for designing AR sports training systems. We design both a situated 3D visualization on a head-mounted display and a 2D visualization on a co-located display to provide immediate visual feedback on a player’s shot performance. Using a within-subject study design with experienced basketball shooters, we characterize user goals, report on qualitative training experiences, and compare the quantitative training results. Our results show that real-time visual feedback helps athletes refine subsequent shots. Shooters in our study achieve greater angle consistency with our visual feedback. Furthermore, AR visualization promotes an increased focus on body form in athletes. Finally, we present suggestions for the design of future sports AR studies.",
  "tags": [
    "Data Visualization",
    "Augmented Reality",
    "SportsXR",
    "Immersive Analytics",
    "Situated Analytics"
  ],
  "authors": [
    {
      "name": "Tica Lin",
      "institution": "Visual Computing Group Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702538",
      "orcid": "0000-0002-2860-0871"
    },
    {
      "name": "Rishi Singh",
      "institution": "Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700432",
      "orcid": "missing"
    },
    {
      "name": "Yalong Yang",
      "institution": "Visual Computing Group Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527018",
      "orcid": "missing"
    },
    {
      "name": "Carolina Nobre",
      "institution": "School Of Engineering And Applied Sciences Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527008",
      "orcid": "missing"
    },
    {
      "name": "Johanna Beyer",
      "institution": "Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339490397",
      "orcid": "0000-0002-3505-9171"
    },
    {
      "name": "Maurice A. Smith",
      "institution": "Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702173",
      "orcid": "missing"
    },
    {
      "name": "Hanspeter Pfister",
      "institution": "Visual Computing Group Harvard University, United States",
      "img": "/do/10.1145/contrib-81100199891/rel-imgonly/hans-web.jpg",
      "acmid": "81100199891",
      "orcid": "0000-0002-3620-2582"
    }
  ],
  "references": [
    {
      "text": "Salvatore M. Aglioti, Paola Cesari, Michela Romani, and Cosimo Urgesi. 2008. Action anticipation and motor resonance in elite basketball players. Nature Neuroscience 11, 9 (2008), 1109–1116.",
      "doi": ""
    },
    {
      "text": "Anna Akbaş, Wojciech Marszałek, Anna Kamieniarz, Jacek Polechoński, Kajetan J. Słomka, and Grzegorz Juras. 2019. Application of Virtual Reality in Competitive Athletes – A Review. Journal of Human Kinetics 69 (Oct. 2019), 5–16. https://doi.org/10.2478/hukin-2019-0023",
      "doi": ""
    },
    {
      "text": "Benjamin Alamar and Dean Oliver. 2013. Sports Analytics: A Guide for Coaches, Managers, and Other Decision Makers. Columbia University Press. https://doi.org/10.7312/columbia/9780231162920.001.0001",
      "doi": ""
    },
    {
      "text": "David Altimira, Florian ”Floyd” Mueller, Jenny Clarke, Gun Lee, Mark Billinghurst, and Christoph Bartneck. 2016. Digitally Augmenting Sports: An Opportunity for Exploring and Understanding Novel Balancing Techniques. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 1681–1691. https://doi.org/10.1145/2858036.2858277",
      "doi": "10.1145/2858036.2858277"
    },
    {
      "text": "Fraser Anderson and Walter F Bischof. 2013. Learning and performance with gesture guides. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1109–1118.",
      "doi": "10.1145/2470654.2466143"
    },
    {
      "text": "Fraser Anderson, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2013. YouMove: enhancing movement training with an augmented reality mirror. In Proceedings of the 26th annual ACM symposium on User interface software and technology(UIST ’13). Association for Computing Machinery, St. Andrews, Scotland, United Kingdom, 311–320. https://doi.org/10.1145/2501988.2502045",
      "doi": "10.1145/2501988.2502045"
    },
    {
      "text": "Basketball Reference. 2020. NBA League Averages - Per Game. https://www.basketball-reference.com/leagues/NBA_stats_per_game.html Accessed: 2020-12-31.",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch, Henning Pohl, Stefanie Reinicke, Emilia Wittmers, Patrick Lühne, Marius Knaust, Sven Köhler, Patrick Schmidt, and Christian Holz. 2013. Imaginary reality gaming: ball games without a ball. In Proceedings of the 26th annual ACM symposium on User interface software and technology - UIST ’13. ACM Press, St. Andrews, Scotland, United Kingdom, 405–410. https://doi.org/10.1145/2501988.2502012",
      "doi": "10.1145/2501988.2502012"
    },
    {
      "text": "John Branch. March 3, 2009. For free throws, 50 years of practice is no help. New York Times (March 3, 2009).",
      "doi": ""
    },
    {
      "text": "Duane C. Brown. 1966. Decentering Distortion of Lenses. Photogrammetric Engineering 32, 3 (1966), 444–462.",
      "doi": ""
    },
    {
      "text": "Samuel N Brudner, Nikhit Kethidi, Damaris Graeupner, Richard B Ivry, and Jordan A Taylor. 2016. Delayed feedback during sensorimotor learning selectively disrupts adaptation but not strategy use. J. Neurophysiol. 115, 3 (March 2016), 1499–1511.",
      "doi": ""
    },
    {
      "text": "Jacky CP Chan, Howard Leung, Jeff KT Tang, and Taku Komura. 2010. A virtual reality dance training system using motion capture technology. IEEE transactions on learning technologies 4, 2 (2010), 187–195.",
      "doi": ""
    },
    {
      "text": "J C P Chan, H Leung, J K T Tang, and T Komura. 2011. A Virtual Reality Dance Training System Using Motion Capture Technology. IEEE Transactions on Learning Technologies 4, 2 (April 2011), 187–195. https://doi.org/10.1109/TLT.2010.27",
      "doi": "10.1109/TLT.2010.27"
    },
    {
      "text": "Alan Chatham and Florian’Floyd’ Mueller. 2013. Adding an interactive display to a public basketball hoop can motivate players and foster community. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. 667–676.",
      "doi": "10.1145/2493432.2493478"
    },
    {
      "text": "Hua-Tsung Chen, Ming-Chun Tien, Yi-Wen Chen, Wen-Jiin Tsai, and Suh-Yin Lee. 2009. Physics-based ball tracking and 3D trajectory reconstruction with applications to shooting location estimation in basketball video. Journal of Visual Communication and Image Representation 20, 3(2009), 204–216.",
      "doi": "10.1016/j.jvcir.2008.11.008"
    },
    {
      "text": "Jacob Cohen. 2013. Statistical power analysis for the behavioral sciences. Academic press.",
      "doi": ""
    },
    {
      "text": "Alexandra Covaci, Anne-Helene Olivier, and Franck Multon. 2015. Visual Perspective and Feedback Guidance for VR Free-Throw Training. IEEE Computer Graphics and Applications 35, 5 (Sept. 2015), 55–65. https://doi.org/10.1109/MCG.2015.95",
      "doi": "10.1109/MCG.2015.95"
    },
    {
      "text": "Harrison Philip Crowell, Clare E. Milner, Joseph Hamill, and Irene S. Davis. 2010. Reducing impact loading during running with the use of real-time visual feedback. The Journal of Orthopaedic and Sports Physical Therapy 40, 4 (April 2010), 206–213. https://doi.org/10.2519/jospt.2010.3166",
      "doi": ""
    },
    {
      "text": "Gabor Csataljay, Peter O’Donoghue, Mike Hughes, and Henriette Dancs. 2009. Performance indicators that distinguish winning and losing teams in basketball. International Journal of Performance Analysis in Sport 9, 1 (2009), 60–66.",
      "doi": ""
    },
    {
      "text": "Arindam Dey, Mark Billinghurst, Robert W. Lindeman, and J. Edward Swan. 2018. A Systematic Review of 10 Years of Augmented Reality Usability Studies: 2005 to 2014. Frontiers in Robotics and AI 5 (April 2018), 1–28. https://doi.org/10.3389/frobt.2018.00037",
      "doi": ""
    },
    {
      "text": "Charles Faure, Annabelle Limballe, Benoit Bideau, and Richard Kulpa. 2020. Virtual reality to assess and train team ball sports performance: A scoping review. Journal of Sports Sciences 38, 2 (Jan. 2020), 192–205. https://doi.org/10.1080/02640414.2019.1689807",
      "doi": ""
    },
    {
      "text": "Feng Zhou, Henry Been-Lirn Duh, and Mark Billinghurst. 2008. Trends in augmented reality tracking, interaction and display: A review of ten years of ISMAR. In 2008 7th IEEE/ACM International Symposium on Mixed and Augmented Reality. IEEE, Cambridge, UK, 193–202. https://doi.org/10.1109/ISMAR.2008.4637362",
      "doi": "10.1109/ISMAR.2008.4637362"
    },
    {
      "text": "Shinya Fujii, Tea Lulic, and Joyce L Chen. 2016. More feedback is better than less: Learning a novel upper limb joint coordination pattern with augmented auditory feedback. Frontiers in Neuroscience 10 (2016), 251.",
      "doi": ""
    },
    {
      "text": "Mark A. Guadagnoli and Robert M. Kohl. 2001. Knowledge of Results for Motor Learning: Relationship Between Error Estimation and Knowledge of Results Frequency. Journal of Motor Behavior 33, 2 (2001), 217–224.",
      "doi": ""
    },
    {
      "text": "Anne-Laure Guinet, Guillaume Bouyer, Samir Otmane, and Eric Desailly. 2019. Reliability of the head tracking measured by Microsoft Hololens during different walking conditions. Computer Methods in Biomechanics and Biomedical Engineering 22, sup1(2019), S169–S171.",
      "doi": ""
    },
    {
      "text": "Andreas Hebbel-Seeger. 2015. Physical Skills and Digital Gaming: The Relationship between Basketball and an Augmented Reality Adaption. In Gamification in Education and Business, Torsten Reiners and Lincoln C. Wood (Eds.). Springer International Publishing, Cham, 291–313. https://doi.org/10.1007/978-3-319-10208-5_15",
      "doi": ""
    },
    {
      "text": "Takuya Honda, Masaya Hirashima, and Daichi Nozaki. 2012. Adaptation to visual feedback delay influences visuomotor learning. PLoS One 7, 5 (May 2012), e37900.",
      "doi": ""
    },
    {
      "text": "Mads Mueller Jensen, Majken K. Rasmussen, Florian ”Floyd” Mueller, and Kaj Grønbæk. 2015. Keepin’ it Real: Challenges when Designing Sports-Training Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 2003–2012. https://doi.org/10.1145/2702123.2702243",
      "doi": "10.1145/2702123.2702243"
    },
    {
      "text": "Lüder A. Kahrs, Jörg Raczkowsky, Jürgen Manner, Andreas Fischer, and Heinz Wörn. 2006. Supporting Free Throw Situations of Basketball Players with Augmented Reality. International Journal of Computer Science in Sport 5 (2006), 72–75.",
      "doi": ""
    },
    {
      "text": "Raine Kajastila, Leo Holsti, and Perttu Hämäläinen. 2016. The augmented climbing wall: High-exertion proximity interaction on a wall-sized interactive surface. In Proceedings of the 2016 CHI conference on human factors in computing systems. 758–769.",
      "doi": "10.1145/2858036.2858450"
    },
    {
      "text": "Oral Kaplan, Goshiro Yamamoto, Yasuhide Yoshitake, Takafumi Taketomi, Christian Sandor, and Hirokazu Kato. 2016. In-situ visualization of pedaling forces on cycling training videos. In 2016 IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE, Budapest, Hungary, 994–999. https://doi.org/10.1109/SMC.2016.7844371",
      "doi": ""
    },
    {
      "text": "Kangsoo Kim, Mark Billinghurst, Gerd Bruder, Henry Been-Lirn Duh, and Gregory F. Welch. 2018. Revisiting Trends in Augmented Reality Research: A Review of the 2nd Decade of ISMAR (2008–2017). IEEE Transactions on Visualization and Computer Graphics 24, 11 (Nov. 2018), 2947–2962. https://doi.org/10.1109/TVCG.2018.2868591",
      "doi": ""
    },
    {
      "text": "Bill Kozar, Ross E. Vaughn, Russel H. Whitfield, and Bobby Dye. 1994. Importance of free-throws at various stages of basketball games. Perceptual and Motor Skills 1578, 1 (1994), 243–248.",
      "doi": ""
    },
    {
      "text": "Matthew Kyan, Guoyu Sun, Haiyan Li, Ling Zhong, Paisarn Muneesawang, Nan Dong, Bruce Elder, and Ling Guan. 2015. An approach to ballet dance training through ms kinect and visualization in a cave virtual reality environment. ACM Transactions on Intelligent Systems and Technology (TIST) 6, 2(2015), 1–37.",
      "doi": "10.1145/2735951"
    },
    {
      "text": "Tica Lin, Yalong Yang, Johanna Beyer, and Hanspeter Pfister. 2020. SportsXR – Immersive Analytics in Sports. In 4th Workshop on Immersive Analytics: Envisioning Future Productivity for Immersive Analytics at ACM CHI. arxiv:2004.08010 [cs.HC]",
      "doi": ""
    },
    {
      "text": "Nreal Ltd.2020. Nreal Light AR Glasses. https://www.nreal.ai/ Accessed: 2020-09-01.",
      "doi": ""
    },
    {
      "text": "MATLAB. 2016. version 2016a. The MathWorks Inc., Natick, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Ian McMahon. November 22, 2017. Hacking the free throw: the science behind the most practiced shot in sports. The Guardian (November 22, 2017).",
      "doi": ""
    },
    {
      "text": "Helen C. Miles, Serban R. Pop, Simon J. Watt, Gavin P. Lawrence, and Nigel W. John. 2012. A review of virtual environments for training in ball sports. Computers & Graphics 36, 6 (Oct. 2012), 714–726. https://doi.org/10.1016/j.cag.2012.04.007",
      "doi": "10.1016/j.cag.2012.04.007"
    },
    {
      "text": "David R. Mullineaux and Timothy L. Uhl. 2010. Coordination-variability and kinematics of misses versus swishes of basketball free throws. Journal of Sports Sciences 28, 9 (2010), 1017–1024.",
      "doi": ""
    },
    {
      "text": "David R. Mullineaux and Timothy L. Uhl. 2010. Kinematics of the free throw in basketball. American Journal of Physics 49, 6 (2010), 1017–1024.",
      "doi": ""
    },
    {
      "text": "Nobuyasu Nakano, Yuki Inaba, Senshi Fukashiro, and Shinsuke Yoshioka. 2020. Basketball players minimize the effect of motor noise by using near-minimum release speed in free-throw shooting. Human Movement Science 70 (2020), 102583.",
      "doi": ""
    },
    {
      "text": "David L. Neumann, Robyn L. Moffitt, Patrick R. Thomas, Kylie Loveday, David P. Watling, Chantal L. Lombard, Simona Antonova, and Michael A. Tremeer. 2018. A systematic review of the application of interactive virtual reality to sport. Virtual Reality 22, 3 (Sept. 2018), 183–198. https://doi.org/10.1007/s10055-017-0320-5",
      "doi": "10.1007/s10055-017-0320-5"
    },
    {
      "text": "NEX Team Inc. 2020. HomeCourt. https://www.homecourt.ai/ Accessed: 2020-09-01.",
      "doi": ""
    },
    {
      "text": "Hiroki Okubo and Mont Hubbard. 2015. Kinematics of arm joint motions in basketball shooting. Procedia Engineering 112(2015), 443–448.",
      "doi": ""
    },
    {
      "text": "Mitchell Page and Andrew Vande Moere. 2007. Evaluating a Wearable Display Jersey for Augmenting Team Sports Awareness. In Pervasive Computing, Anthony LaMarca, Marc Langheinrich, and Khai N. Truong (Eds.). Vol. 4480. Springer Berlin Heidelberg, Berlin, Heidelberg, 91–108. https://doi.org/10.1007/978-3-540-72037-9_6Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "Rui Miguel Pascoal and Sérgio Luís Guerreiro. 2017. Information Overload in Augmented Reality: The Outdoor Sports Environments. In Information and Communication Overload in the Digital Age. IGI Global, 271–301.",
      "doi": ""
    },
    {
      "text": "C. Perin, R. Vuillemot, C. D. Stolper, J. T. Stasko, J. Wood, and S. Carpendale. 2018. State of the Art of Sports Data Visualization. Computer Graphics Forum 37, 3 (June 2018), 663–686. https://doi.org/10.1111/cgf.13447",
      "doi": ""
    },
    {
      "text": "Pillar Vision Inc.2020. Noah Shooting System. https://www.noahbasketball.com/ Accessed: 2020-09-01.",
      "doi": ""
    },
    {
      "text": "Timothy P. Ryan and Jonathan Duckworth. 2017. 2K-Reality: An Acoustic Sports Entertainment Augmentation for Pickup Basketball Play Spaces. In Proceedings of the 12th International Audio Mostly Conference on Augmented and Participatory Sound and Music Experiences. ACM, London United Kingdom, 1–8. https://doi.org/10.1145/3123514.3123529",
      "doi": ""
    },
    {
      "text": "Jaime Sampaio and Manuel Janeira. 2003. Importance of free-throw performance in game outcome during the final series of basketball play-offs. International Journal of Applied Sports Sciences 15, 2 (2003), 9–16.",
      "doi": ""
    },
    {
      "text": "Markus Santoso. 2018. Markerless augmented reality technology for real-space basketball simulation. In 2018 IEEE International Conference on Consumer Electronics (ICCE). IEEE, Las Vegas, NV, 1–3. https://doi.org/10.1109/ICCE.2018.8326335",
      "doi": ""
    },
    {
      "text": "Richard A Schmidt. 1991. Frequent augmented feedback can degrade learning: Evidence and interpretations. In Tutorials in motor neuroscience. Springer, 59–75.",
      "doi": ""
    },
    {
      "text": "Leandro de Carvalho da Silva, Carla Ferro Pereira-Monfredini, and Luis Augusto Teixeira. 2017. Improved children’s motor learning of the basketball free shooting pattern by associating subjective error estimation and extrinsic feedback. Journal of sports sciences 35, 18 (2017), 1825–1830.",
      "doi": ""
    },
    {
      "text": "Pooya Soltani and Antoine H.P. Morice. 2020. Augmented reality tools for sports education and training. Computers & Education 155 (Oct. 2020), 103923. https://doi.org/10.1016/j.compedu.2020.103923",
      "doi": ""
    },
    {
      "text": "Sports Reference. 2020. NCAA Seasons - Game Averages. https://www.sports-reference.com/cbb/seasons/game-averages.html Accessed: 2020-12-31.",
      "doi": ""
    },
    {
      "text": "Mark St. John, Michael B Cowen, Harvey S Smallman, and Heather M Oonk. 2001. The Use of 2D and 3D Displays for Shape-Understanding versus Relative-Position Tasks. Hum. Factors 43, 1 (March 2001), 79–98.",
      "doi": ""
    },
    {
      "text": "Thetuvix. [n.d.]. Hologram stability - Mixed Reality. https://docs.microsoft.com/en-us/windows/mixed-reality/hologram-stability#:~:text=HoloLens has hardware that adjusts,location, and holograms feel stable.",
      "doi": ""
    },
    {
      "text": "Bruce H. Thomas, Gregory F. Welch, Pierre Dragicevic, Niklas Elmqvist, Pourang Irani, Yvonne Jansen, Dieter Schmalstieg, Aurélien Tabard, Neven A. M. ElSayed, Ross T. Smith, and Wesley Willett. 2018. Situated Analytics. In Immersive Analytics, Kim Marriott, Falk Schreiber, Tim Dwyer, Karsten Klein, Nathalie Henry Riche, Takayuki Itoh, Wolfgang Stuerzlinger, and Bruce H. Thomas (Eds.). Vol. 11190. Springer International Publishing, Cham, 185–220. https://doi.org/10.1007/978-3-030-01388-2_7",
      "doi": ""
    },
    {
      "text": "Chau M. Tran and Larry M. Silverberg. 2008. Optimal release conditions for the free throw in men’s basketball. Journal of Sports Sciences 26, 11 (2008), 1147–1155.",
      "doi": ""
    },
    {
      "text": "Roger Y. Tsai. 1987. A Versatile Camera Calibration Technique for High-Accuracy 3D Machine Vision Metrology Using Off-the-Shelf TV Cameras and Lenses. IEEE Journal of Robotics and Automation RA-3, 4 (1987), 323–344.",
      "doi": ""
    },
    {
      "text": "Reid Vassallo, Adam Rankin, Elvis CS Chen, and Terry M Peters. 2017. Hologram stability evaluation for Microsoft HoloLens. In Medical Imaging 2017: Image Perception, Observer Performance, and Technology Assessment, Vol. 10136. International Society for Optics and Photonics, 1013614.",
      "doi": ""
    },
    {
      "text": "James S. Walker. 2017. Physics. Pearson.",
      "doi": ""
    },
    {
      "text": "Gabriele Wulf, Charles H. Shea, and Sabine Matschiner. 1997. Frequent Feedback Enhances Complex Motor Skill Learning. Journal of Motor Behavior 30, 2 (1997), 180–192.",
      "doi": ""
    },
    {
      "text": "Shuainan Ye, Zhutian Chen, Xiangtong Chu, Yifan Wang, Siwei Fu, Lejun Shen, Kun Zhou, and Yingcai Wu. 2020. Shuttlespace: Exploring and analyzing movement trajectory in immersive visualization. IEEE Transactions on Visualization and Computer Graphics (2020).",
      "doi": ""
    },
    {
      "text": "Zhengyou Zhang. 2000. A Flexible New Technique for Camera Calibration. IEEE Transactions on Pattern Analysis and Machine Intelligence 22, 11(2000), 1330–1334.",
      "doi": "10.1109/34.888718"
    }
  ]
}