{
  "doi": "10.1145/3411764.3445280",
  "title": "Designing AACs for People with Aphasia Dining in Restaurants",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "There is a growing need to design augmentative and alternative communication (AAC) devices that focus on supporting quality of life goals, such as increased social participation in leisurely activities. Yet, designing AAC applications that support leisurely activities is difficult, as the activity might require novel and specific language in a timely manner. Through observations and contextual interviews with people with aphasia, their social partners, and speech-language therapists, we characterize the important but challenging nature of supporting one specific leisure activity: meal ordering in restaurants. Based on our observational and interview data, we design and explore three prototype AAC systems to support people with aphasia in ordering meals in restaurants. Each prototype integrates a different AI technology, contributing insights into how AI may enhance AAC usage and design. The study opens up questions of designing accessible restaurant experiences for neurodivergent people and the role of AI in AAC devices more broadly.",
  "tags": [
    "aphasia",
    "language impairments",
    "augmentative and alternative communication"
  ],
  "authors": [
    {
      "name": "Mmachi God'sglory Obiorah",
      "institution": "Northwestern University, Evanston, IL, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658724514",
      "orcid": "missing"
    },
    {
      "name": "Anne Marie Marie Piper",
      "institution": "University of California, Irvine, Irvine, CA, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316490036",
      "orcid": "0000-0003-3085-3277"
    },
    {
      "name": "Michael Horn",
      "institution": "Northwestern University, Evanston, IL, United States",
      "img": "/do/10.1145/contrib-81502668367/rel-imgonly/2v0a0247-3.jpg",
      "acmid": "81502668367",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abdullah Al Mahmud, Rikkert Gerits, and Jean-Bernard Martens. 2010. XTag: Designing an Experience Capturing and Sharing Tool for Persons with Aphasia. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (New York, NY, USA, 2010) (NordiCHI ’10). ACM, Reykjavik, Iceland, 325–334. https://doi.org/10.1145/1868914.1868953",
      "doi": "10.1145/1868914.1868953"
    },
    {
      "text": "Meghan Allen, Joanna McGrenere, and Barbara Purves. 2007. The design and field evaluation of PhotoTalk: a digital image communication application for people.. In Proceedings of the 9th international ACM SIGACCESS conference on Computers and accessibility (2007) (9th). ACM, Tempe, Arizona, USA, 187–194. https://doi.org/10.1145/1296843.1296876",
      "doi": "10.1145/1296843.1296876"
    },
    {
      "text": "Meryl Alper. 2017. Giving voice: Mobile communication, disability, and inequality. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "American Speech-Language-Hearing Association -. American Speech-Language-Hearing Association | ASHA. American Speech-Language-Hearing Association. https://www.asha.org/",
      "doi": ""
    },
    {
      "text": "Rita L. Bailey, Howard P. Parette, Julia B. Stoner, Maureen E. Angell, and Kathleen Carroll. 2006. Family members’ perceptions of augmentative and alternative communication device use. Language, Speech, and Hearing Services in Schools 37, 1 (2006), 50–60. https://doi.org/10.1044/0161-1461(2006/006)",
      "doi": ""
    },
    {
      "text": "Susan Balandin and Teresa Iacono. 1998. Topics of meal-break conversations. Augmentative and Alternative Communication 14, 3 (1998), 131–146. https://doi.org/10.1080/07434619812331278316Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/07434619812331278316.",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett and Os Keyes. 2020. What is the Point of Fairness? Disability, AI and the Complexity of Justice. SIGACCESS Access. Comput. -, 125, Article 5 (March 2020), 1 pages. https://doi.org/10.1145/3386296.3386301",
      "doi": "10.1145/3386296.3386301"
    },
    {
      "text": "David R. Beukelman, Susan Fager, Laura Ball, and Aimee Dietz. 2007. AAC for adults with acquired neurological conditions: A review. Augmentative and Alternative Communication 23, 3 (2007), 230–242. https://doi.org/10.1080/07434610701553668",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C. Miller, Aubrey Tatarowicz, Brandyn White, Samuel White, and Tom Yeh. 2010. VizWiz: Nearly Real-time Answers to Visual Questions. In Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A) (New York, NY, USA, 2010) (W4A ’10). ACM, New York, NY, USA, 24:1–24:2. https://doi.org/10.1145/1805986.1806020",
      "doi": "10.1145/1805986.1806020"
    },
    {
      "text": "Sarah W. Blackstone, Michael B. Williams, and David P. Wilkins. 2007. Key principles underlying research and practice in AAC. Augmentative and Alternative Communication 23, 3 (2007), 191–203. https://doi.org/10.1080/07434610701553684Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/07434610701553684.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "John Carroll, Guido Minnen, Yvonne Canning, Siobhan Devlin, and John Tait. 1998. Practical simplification of English newspaper text to assist aphasic readers. In Proceedings of the AAAI-98 Workshop on Integrating Artificial Intelligence and Assistive Technology (1998). Citeseer, Pennsylvania, 7–10.",
      "doi": ""
    },
    {
      "text": "John Carroll, Guido Minnen, Darren Pearce, Yvonne Canning, Siobhan Devlin, and John Tait. 1999. Simplifying Text for Language-Impaired Readers. In Ninth Conference of the European Chapter of the Association for Computational Linguistics. Association for Computational Linguistics, Bergen, Norway, 269–270. https://www.aclweb.org/anthology/E99-1042",
      "doi": ""
    },
    {
      "text": "Herbert H. Clark. 2006. Context and Common Ground. In Encyclopedia of Language & Linguistics. Elsevier, Oxford, 105–108. https://doi.org/10.1016/B0-08-044854-2/01088-9",
      "doi": ""
    },
    {
      "text": "Garrison W. Cottrell. 1989. A connectionist approach to word sense disambiguation. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": ""
    },
    {
      "text": "Madeline Cruice, Linda Worrall, Louise Hickson, and Robert Murison. 2003. Finding a focus for quality of life with aphasia: Social and emotional health, and psychological well-being. Aphasiology 17, 4 (2003), 333–353. https://doi.org/10.1080/02687030244000707",
      "doi": ""
    },
    {
      "text": "Maitraye Das, Darren Gergle, and Anne Marie Piper. 2019. ”It Doesn’t Win You Friends”: Understanding Accessibility in Collaborative Writing for People with Vision Impairments. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 191 (Nov. 2019), 26 pages. https://doi.org/10.1145/3359293",
      "doi": "10.1145/3359293"
    },
    {
      "text": "Carrie Demmans Epp, Justin Djordjevic, Shimu Wu, Karyn Moffatt, and Ronald M. Baecker. 2012. Towards Providing Just-in-time Vocabulary Support for Assistive and Augmentative Communication. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (New York, NY, USA, 2012) (IUI ’12). ACM, Lisbon, Portugal, 33–36. https://doi.org/10.1145/2166966.2166973",
      "doi": "10.1145/2166966.2166973"
    },
    {
      "text": "Emma Dixon and Amanda Lazar. 2020. Approach Matters: Linking Practitioner Approaches to Technology Design for People with Dementia. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376432",
      "doi": "10.1145/3313831.3376432"
    },
    {
      "text": "Elizabeth Ellcessor. 2016. Restricted Access: Media, Disability, and the Politics of Participation. NYU Press, New York. Google-Books-ID: ygnMCgAAQBAJ.",
      "doi": "10.5555/3027788"
    },
    {
      "text": "Alexander Fiannaca, Ann Paradiso, Mira Shah, and Meredith Ringel Morris. 2017. AACrobat: Using Mobile Devices to Lower Communication Barriers and Provide Autonomy with Gaze-Based AAC. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 683–695. https://doi.org/10.1145/2998181.2998215",
      "doi": "10.1145/2998181.2998215"
    },
    {
      "text": "Leah Findlater, Steven Goodman, Yuhang Zhao, Shiri Azenkot, and Margot Hanley. 2020. Fairness Issues in AI Systems That Augment Sensory Abilities. SIGACCESS Access. Comput. -, 125, Article 8 (March 2020), 1 pages. https://doi.org/10.1145/3386296.3386304",
      "doi": ""
    },
    {
      "text": "Katherine Francis, Katina Swan, Tanya Rose, Marie Hopper, Zane Hopper, Ian Hughes, Melissa Lawrie, and Rachel Wenke. 2019. The use and impact of a supported aphasia-friendly photo menu tool on iPads in the inpatient hospital setting: a pilot study. Aphasiology 0, 0 (2019), 1–21. https://doi.org/10.1080/02687038.2019.1686747",
      "doi": ""
    },
    {
      "text": "Julia Galliers and Stephanie Wilson. 2013. An Exploratory Study into the Accessibility of a Multi-User Virtual World for Young People with Aphasia. In Proceedings of the 27th International BCS Human Computer Interaction Conference (London, UK) (BCS-HCI ’13). BCS Learning & Development Ltd., Swindon, GBR, Article 26, 6 pages.",
      "doi": "10.5555/2578048.2578083"
    },
    {
      "text": "Julia Galliers, Stephanie Wilson, Abi Roper, Naomi Cocks, Jane Marshall, Sam Muscroft, and Tim Pring. 2012. Words Are Not Enough: Empowering People with Aphasia in the Design Process. In Proceedings of the 12th Participatory Design Conference: Research Papers - Volume 1 (New York, NY, USA, 2012) (PDC ’12). ACM, New York, NY, USA, 51–60. https://doi.org/10.1145/2347635.2347643",
      "doi": "10.1145/2347635.2347643"
    },
    {
      "text": "Charles Goodwin. 2003. Conversational Frameworks for the Accomplishment of Meaning in Aphasia. In Conversation and Brain Damage, Charles Goodwin (Ed.). Oxford University Press, New York, 90–116.",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 2004. A Competent Speaker Who Can’t Speak: The Social Life of Aphasia. Journal of Linguistic Anthropology 14, 2 (2004), 151–170. http://www.jstor.org/stable/43102644",
      "doi": ""
    },
    {
      "text": "Charles Goodwin. 2006. Human Sociality as Mutual Orientation in a Rich Interactive Environment: Multimodal Utterances and Pointing in Aphasia. In Roots of Human Sociality, Nicholas J. Enfield and Stephen C. Levinson (Eds.). Berg, London, 96–125.",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Xiang ’Anthony’ Chen, Haoran Qi, Samuel White, Suman Ghosh, Chieko Asakawa, and Jeffrey P. Bigham. 2016. VizLens: A Robust and Interactive Screen Reader for Interfaces in the Real World. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 651–664. https://doi.org/10.1145/2984511.2984518",
      "doi": "10.1145/2984511.2984518"
    },
    {
      "text": "Anhong Guo, Ece Kamar, Jennifer Wortman Vaughan, Hanna Wallach, and Meredith Ringel Morris. 2020. Toward Fairness in AI for People with Disabilities SBG@a Research Roadmap. SIGACCESS Access. Comput. -, 125, Article 2 (March 2020), 1 pages. https://doi.org/10.1145/3386296.3386298",
      "doi": ""
    },
    {
      "text": "Md Sazzad Hossain, Masato Takanokura, Hiromi Sakai, and Hideki Katagiri. 2018. Using Context History and Location in Context-aware AAC Systems for Speech-language Impairments. In Proceedings of the International MultiConference of Engineers and Computer Scientists (2018), Vol. 1. IAENG, Hong Kong.",
      "doi": ""
    },
    {
      "text": "Chandrika Jayant, Hanjie Ji, Samuel White, and Jeffrey P. Bigham. 2011. Supporting Blind Photography. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility (New York, NY, USA, 2011) (ASSETS ’11). ACM, New York, NY, USA, 203–210. https://doi.org/10.1145/2049536.2049573",
      "doi": ""
    },
    {
      "text": "Sushant Kafle, Abraham Glasser, Sedeeq Al-khazraji, Larwan Berke, Matthew Seita, and Matt Huenerfauth. 2020. Artificial Intelligence Fairness in the Context of Accessibility Research on Intelligent Systems for People Who Are Deaf or Hard of Hearing. SIGACCESS Access. Comput. -, 125, Article 4 (March 2020), 1 pages. https://doi.org/10.1145/3386296.3386300",
      "doi": ""
    },
    {
      "text": "Aura Kagan. 1998. Supported Conversations for Adults with Aphasia: Methods and Resources for Training Conversation Partners. Journal of Aphasiology 12, 9 (1998), 816 –830. https://doi.org/10.1080/02687039808249575",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Barbara Linam-Church, Kyle Althoff, and Denise McCall. 2012. What we talk about: Designing a context-aware communication tool for people with aphasia. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility (2012). ACM, Boulder, Colorado, USA, 49 – 56. https://doi.org/10.1145/2384916.2384926",
      "doi": "10.1145/2384916.2384926"
    },
    {
      "text": "Gunhee Kim, Jukyung Park, Manchul Han, Sehyung Park, and Sungdo Ha. 2009. Context-aware Communication Support System with Pictographic Cards. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services (New York, NY, USA, 2009) (MobileHCI ’09). ACM, Bonn, Germany, 86:1–86:2. https://doi.org/10.1145/1613858.1613958",
      "doi": "10.1145/1613858.1613958"
    },
    {
      "text": "Tom Koppenol, Abdullah Al Mahmud, and Jean-Bernard Martens. 2010. When Words Fall Short: Helping People with Aphasia to Express. In Computers Helping People with Special Needs (Berlin, Heidelberg, 2010), Klaus Miesenberger, Joachim Klaus, Wolfgang Zagler, and Arthur Karshmer (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 45–48.",
      "doi": ""
    },
    {
      "text": "Richard E Ladner. 2011. Accessible technology and models of disability. Springer, New York, NY. 25–31 pages.",
      "doi": ""
    },
    {
      "text": "Joanne Lasker and Jan Bedrosian. 2001. Promoting acceptance of augmentative and alternative communication by adults with acquired communication disorders. Augmentative and Alternative Communication 17, 3 (2001), 141–153. https://doi.org/10.1080/aac.17.3.141.153",
      "doi": ""
    },
    {
      "text": "Joanne P. Lasker and Kathryn L. Garrett. 2008. Aphasia and AAC: Enhancing Communication Across Health Care Settings. The ASHA Leader 13, 8 (2008), 10–13. https://doi.org/10.1044/leader.FTR1.13082008.10",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. Supporting People with Dementia in Digital Social Sharing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2149–2162. https://doi.org/10.1145/3025453.3025586",
      "doi": "10.1145/3025453.3025586"
    },
    {
      "text": "Haley MacLeod, Cynthia L. Bennett, Meredith Ringel Morris, and Edward Cutrell. 2017. Understanding Blind People’s Experiences with Computer-Generated Captions of Social Media Images. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5988–5999. https://doi.org/10.1145/3025453.3025814",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "National Aphasia Association 2018. Aphasia Definitions. National Aphasia Association. https://www.aphasia.org/aphasia-definitions/",
      "doi": ""
    },
    {
      "text": "National Aphasia Association 2020. Tips for Eating at Restaurants When You Have Aphasia. National Aphasia Association. https://aphasia.org/stories/tips-for-eating-at-restaurants-when-you-have-aphasia/",
      "doi": ""
    },
    {
      "text": "Timothy Neate, Abi Roper, Stephanie Wilson, and Jane Marshall. 2019. Empowering Expression for Users with Aphasia through Constrained Creativity. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk, 2019-05-02) (CHI ’19). Association for Computing Machinery, Glasgow, Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300615",
      "doi": "10.1145/3290605.3300615"
    },
    {
      "text": "Sonya Nikolova, Jordan Boyd-Graber, and Perry R. Cook. 2009. The design of ViVA: A mixed-initiative visual vocabulary for aphasia.. In Extended Abstracts on Human Factors in Computing Systems (2009). ACM, Boston, Massachusetts, USA, 4015 – 4020. https://doi.org/10.1145/1520340.1520610",
      "doi": ""
    },
    {
      "text": "Sonya Nikolova, Marilyn Tremaine, and Perry R. Cook. 2010. Click on Bake to Get Cookies: Guiding Word-finding with Semantic Associations. In Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility (New York, NY, USA, 2010) (ASSETS ’10). ACM, Orlando, Florida, U.S.A, 155–162. https://doi.org/10.1145/1878803.1878832",
      "doi": "10.1145/1878803.1878832"
    },
    {
      "text": "A. Odom and Michael Upthegrove. 1997. Moving toward employment using AAC: case study. Augmentative and Alternative Communication 13, 4 (1997), 258–262. https://doi.org/10.1080/07434619712331278078Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/07434619712331278078.",
      "doi": ""
    },
    {
      "text": "Rupal Patel and Rajiv Radhakrishnan. 2007. Enhancing Access to Situational Vocabulary by Leveraging Geographic Context. Assistive Technology Outcomes and Benefits 4, 1 (2007), 99–114. https://eric.ed.gov/?q=Enhancing+Access+to+Situational+Vocabulary+by+Leveraging+Geographic+Context&id=EJ899370 Publisher: Assistive Technology Industry Association and SEAT Center.",
      "doi": ""
    },
    {
      "text": "Anne Marie Piper, Nadir Weibel, and James D. Hollan. 2010. Introducing multimodal paper-digital interfaces for speech-language therapy.. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility (2010). ACM, Orlando, Florida, USA, 203 – 210. https://doi.org/10.1145/1878803.1878840",
      "doi": "10.1145/1878803.1878840"
    },
    {
      "text": "Brian Roark, Andrew Fowler, Richard Sproat, Christopher Gibbons, and Melanie Fried-Oken. 2011. Towards technology-assisted co-construction with communication partners. In Proceedings of the Second Workshop on Speech and Language Processing for Assistive Technologies. Association for Computational Linguistics, Edinburgh, Scotland, UK, 22–31. https://www.aclweb.org/anthology/W11-2303",
      "doi": "10.5555/2140499.2140503"
    },
    {
      "text": "Nátali Romano and Regina Yu Shon Chun. 2018. Augmentative and Alternative Communication use: family and professionals’ perceptions of facilitators and barriers. CoDAS 30, 4 (2018), e20170138. https://doi.org/10.1590/2317-1782/20162017138",
      "doi": ""
    },
    {
      "text": "Tanya A. Rose, Linda E. Worrall, Louise M. Hickson, and Tammy C. Hoffmann. 2011-08. Aphasia friendly written health information: content and design characteristics. International Journal of Speech-Language Pathology 13, 4(2011-08), 335–347. https://doi.org/10.3109/17549507.2011.560396",
      "doi": ""
    },
    {
      "text": "Katherine Ross and Robert Wertz. 2003. Quality of life with and without aphasia. Aphasiology 17, 4 (2003), 355–364. https://doi.org/10.1080/02687030244000716Publisher: Routledge.",
      "doi": ""
    },
    {
      "text": "Donghoon Shin, Jaeyoon Song, Seokwoo Song, Jisoo Park, Joonhwan Lee, and Soojin Jun. 2020. TalkingBoogie: Collaborative Mobile AAC System for Non-Verbal Children with Developmental Disabilities and Their Caregivers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376154",
      "doi": "10.1145/3313831.3376154"
    },
    {
      "text": "Simona Spaccavento, Angela Craca, Marina Del Prete, Rosanna Falcone, Antonia Colucci, Angela Di Palma, and Anna Loverre. 2013. Quality of life measurement and outcome in aphasia. In Neuropsychiatric Disease and Treatment (2013-12-17), Vol. 10. NCBI, Bethesda, MD, 27–37. https://doi.org/10.2147/NDT.S52357",
      "doi": ""
    },
    {
      "text": "Stephanie Valencia, Amy Pavel, Jared Santa Maria, Seunga (Gloria) Yu, Jeffrey P. Bigham, and Henny Admoni. 2020. Conversational Agency in Augmentative and Alternative Communication. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376376",
      "doi": "10.1145/3313831.3376376"
    },
    {
      "text": "Donna Wang, Bronwyn Everett, Tiffany Northall, Amy R. Villarosa, and Yenna Salamonson. 2018. Access to food choices by older people in residential aged care: An integrative review. Collegian 25, 4 (2018), 457 – 465. https://doi.org/10.1016/j.colegn.2017.11.004",
      "doi": ""
    },
    {
      "text": "Kristin Williams, Karyn Moffatt, Denise McCall, and Leah Findlater. 2015. Designing Conversation Cues on a Head-Worn Display to Support Persons with Aphasia. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (New York, NY, USA, 2015) (CHI ’15). ACM, New York, NY, USA, 231–240. https://doi.org/10.1145/2702123.2702484",
      "doi": "10.1145/2702123.2702484"
    },
    {
      "text": "Cara Wilson, Margot Brereton, Bernd Ploderer, and Laurianne Sitbon. 2019. Co-Design Beyond Words: ’Moments of Interaction’ with Minimally-Verbal Children on the Autism Spectrum. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300251",
      "doi": "10.1145/3290605.3300251"
    },
    {
      "text": "Linda Worrall, Sue Sherratt, Penny Rogers, Tami Howe, Deborah Hersh, Alison Ferguson, and Bronwyn Davidson. 2011. What people with aphasia want: Their goals according to the ICF. Aphasiology 25, 3 (2011), 309–322. https://doi.org/10.1080/02687038.2010.508530Publisher: Routledge _eprint: https://doi.org/10.1080/02687038.2010.508530.",
      "doi": ""
    }
  ]
}