{
  "doi": "10.1145/3411764.3445113",
  "title": "Opening Research Commissioning To Civic Participation: Creating A Community Panel To Review The Social Impact of HCI Research Proposals",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "In this paper we report insights from the design and delivery of a process that invited distinct groups of citizens to co-develop and apply social impact assessment criteria for the purpose of reviewing research proposals on HCI, social justice and digital technologies. We describe our process, designed to create dialogic spaces that foster critical engagements with technologies and social issues, cooperation and peer-support. In our findings we explore how people defined and contextualised social impact in lived experiences, negotiated and legitimised their role as reviewers, and articulated the value of HCI research for social justice. We reflect on the significance of involving citizens in the commissioning of research that addresses inequalities and social justice in technology design and draw implications for HCI researchers concerned with ethical dimensions of technology. The work contributes to HCI and civic engagement's traditions to develop effective participatory methods and collaborative processes to produce digital technologies that support social justice.",
  "authors": [
    {
      "name": "Ian G Johnson",
      "institution": "Open Lab, Newcastle University, United Kingdom",
      "img": "/do/10.1145/contrib-99659020768/rel-imgonly/1u6a8263.jpg",
      "acmid": "99659020768",
      "orcid": "missing"
    },
    {
      "name": "Clara Crivellaro",
      "institution": "Open Lab Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959323457",
      "orcid": "0000-0002-4578-4545"
    }
  ],
  "references": [
    {
      "text": "Rediet Abebe, Solon Barocas, Jon Kleinberg, Karen Levy, Manish Raghavan, and David G. Robinson. 2020. Roles for computing in social change. In FAT* 2020 - Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency, 252–260. https://doi.org/10.1145/3351095.3372871",
      "doi": "10.1145/3351095.3372871"
    },
    {
      "text": "Shana Agid and Elizabeth Chin. 2019. Making and negotiating value: design and collaboration with community led groups. CoDesign 15, 1: 75–89. https://doi.org/10.1080/15710882.2018.1563191",
      "doi": ""
    },
    {
      "text": "Phillip E. Agre. 1997. Toward a Critical Technical Practice: Lessons Learned in Trying to Reform AI. In Social science, technical systems, and cooperative work: beyond the great divide, G.C. Bowker, S.L. Star, W. Turner and L. Gasser (eds.). Psychology Press. https://doi.org/10.1109/tpc.1999.768167",
      "doi": ""
    },
    {
      "text": "Mariam Asad. 2018. Prefigurative design as an alternative approach to civic engagement. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW, 97–100. https://doi.org/10.1145/3272973.3272983",
      "doi": "10.1145/3272973.3272983"
    },
    {
      "text": "Mariam Asad. 2019. Prefigurative Design as a Method for Research Justice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW: 1–18. https://doi.org/10.1145/3359302",
      "doi": "10.1145/3359302"
    },
    {
      "text": "Mariam Asad and Christopher A. Le Dantec. 2015. Illegitimate Civic Participation. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’15, 1694–1703. https://doi.org/10.1145/2675133.2675156",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’10), 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11, 675. https://doi.org/10.1145/1978942.1979041",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: Social science, feminism, and HCI. In Conference on Human Factors in Computing Systems - Proceedings, 675–684. https://doi.org/10.1145/1978942.1979041",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Oliver Bates, Kathy New, Matthew Louis Mauriello, Roy Bendor, Simran Chopra, Adrian K. Clear, Samantha Mitchell-Finnigan, Christian Remy, Samuel Mann, and Chris Preist. 2019. Towards a responsible innovation agenda for HCI. In Conference on Human Factors in Computing Systems - Proceedings, 1–8. https://doi.org/10.1145/3290607.3299017",
      "doi": "10.1145/3290607.3299017"
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2010. Participatory design and “democratizing innovation.” In Proceedings of the 11th Biennial Participatory Design Conference on - PDC ’10, 41–50. https://doi.org/10.1145/1900441.1900448",
      "doi": "10.1145/1900441.1900448"
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per Anders Hillgren. 2012. Agonistic participatory design: Working with marginalised social movements. CoDesign 8, 2–3: 127–144. https://doi.org/10.1080/15710882.2012.672577",
      "doi": ""
    },
    {
      "text": "Mark Blythe. 2014. Research through design fiction: Narrative in real and imaginary abstracts. In Conference on Human Factors in Computing Systems - Proceedings, 703–712. https://doi.org/10.1145/2556288.2557098",
      "doi": "10.1145/2556288.2557098"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2020. One size fits all? What counts as quality practice in (reflexive) thematic analysis? Qualitative Research in Psychology: 1–25. https://doi.org/10.1080/14780887.2020.1769238",
      "doi": ""
    },
    {
      "text": "Barry Brown, Alexandra Weilenmann, Donald McMillan, and Airi Lampinen. 2016. Five provocations for ethical HCI research. In Conference on Human Factors in Computing Systems - Proceedings, 852–863. https://doi.org/10.1145/2858036.2858313",
      "doi": "10.1145/2858036.2858313"
    },
    {
      "text": "John M. Carroll and Mary Beth Rosson. 2007. Participatory design in community informatics. Design Studies 28, 3: 243–261. https://doi.org/10.1016/j.destud.2007.02.007",
      "doi": ""
    },
    {
      "text": "Jill Clark, Karen Laing, David Leat, Rachel Lofthouse, Ulrike Thomas, Lucy Tiplady, and Pamela Woolner. 2017. Transformation in interdisciplinary research methodology: the importance of shared experiences in landscapes of practice. International Journal of Research & Method in Education 40, 3: 243–256. https://doi.org/10.1080/1743727X.2017.1281902",
      "doi": ""
    },
    {
      "text": "Eric Corbett and Christopher A. Le Dantec. 2018. The Problem of Community Engagement. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18, 1–13. https://doi.org/10.1145/3173574.3174148",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design Justice. MIT Press. https://doi.org/10.7551/mitpress/12255.001.0001",
      "doi": ""
    },
    {
      "text": "Clara Crivellaro, Lizzie Coles-Kemp, Alan Dix, and Ann Light. 2019. Not-equal: democratizing research in digital innovation for social justice. Interactions 26, 2: 70–73. https://doi.org/10.1145/3301655",
      "doi": "10.1145/3301655"
    },
    {
      "text": "Catherine D'Ignazio, Erhardt Graeff, Christina N. Harrington, and Daniela K. Rosner. 2020. Toward Equitable Participatory Design. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing, 437–445. https://doi.org/10.1145/3406865.3418588",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the formation of publics in participatory design. Social Studies of Science 43, 2: 241–264. https://doi.org/10.1177/0306312712471581",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec and Sarah Fox. 2015. Strangers at the Gate. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’15, 1348–1358. https://doi.org/10.1145/2675133.2675147",
      "doi": ""
    },
    {
      "text": "Paul Denny, Brett A. Becker, Michelle Craig, Greg Wilson, and Piotr Banaszkiewicz. 2019. Research This! Questions that computing educators most want computing education researchers to answer. In ICER 2019 - Proceedings of the 2019 ACM Conference on International Computing Education Research, 259–267. https://doi.org/10.1145/3291279.3339402",
      "doi": "10.1145/3291279.3339402"
    },
    {
      "text": "Carl Disalvo, Andrew Clement, and Volkmar Pipek. 2013. Participatory Design for, with and by communities. In Routledge International Handbook of Partcicpatory Design, Jesper Simonsen and Toni. Robertson (eds.). Routledge.",
      "doi": ""
    },
    {
      "text": "Carl Disalvo, Tom Jenkins, and Thomas Lodato. 2016. Designing speculative civics. In Conference on Human Factors in Computing Systems - Proceedings, 4979–4990. https://doi.org/10.1145/2858036.2858505",
      "doi": "10.1145/2858036.2858505"
    },
    {
      "text": "Carl DiSalvo, Jonathan Lukens, Thomas Lodato, Tom Jenkins, and Tanyoung Kim. 2014. Making public things. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14, 2397–2406. https://doi.org/10.1145/2556288.2557359",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS ’16, 656–671. https://doi.org/10.1145/2901790.2901861",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS ’16, 656–671. https://doi.org/10.1145/2901790.2901861",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Paul Dourish and Genevieve Bell. 2007. The infrastructure of experience and the experience of infrastructure: Meaning and structure in everyday encounters with space. Environment and Planning B: Planning and Design 34, 3: 414–430. https://doi.org/10.1068/b32035t",
      "doi": ""
    },
    {
      "text": "Graham Dove and Anne-Laure Fayard. Monsters, Metaphors, and Machine Learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Retrieved September 17, 2020 from http://dx.doi.org/10.1145/3313831.3376275",
      "doi": ""
    },
    {
      "text": "Sheena L. Erete. 2015. Engaging Around Neighborhood Issues. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’15, 1590–1601. https://doi.org/10.1145/2675133.2675182",
      "doi": "10.1145/2675133.2675182"
    },
    {
      "text": "Andrew Feenberg. 1999. Questioning technology. Psychology Press. https://doi.org/10.4324/9780203022313",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D R Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Retrieved September 17, 2020 from http://dx.doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Sarah Fox, Mariam Asad, Katherine Lo, Jill P. Dimond, Lynn S. Dombrowski, and Shaowen Bardzell. 2016. Exploring Social Justice, Design, and HCI. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’16), 3293–3300. https://doi.org/10.1145/2851581.2856465",
      "doi": "10.1145/2851581.2856465"
    },
    {
      "text": "Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. Social Justice and Design: Power and oppression in collaborative systems. https://doi.org/10.1145/3022198.3022201",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. 2017. Social justice and design: Power and oppression in collaborative systems. In CSCW 2017 - Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, 117–122. https://doi.org/10.1145/3022198.3022201",
      "doi": "10.1145/3022198.3022201"
    },
    {
      "text": "Sarah Fox and Daniela Rosner. 2016. Extensions from the “field”: Exploring alternative methods of research communication. Interactions 23, 68–71. https://doi.org/10.1145/2948895",
      "doi": "10.1145/2948895"
    },
    {
      "text": "Sarah Fox and Daniela K. Rosner. 2016. Continuing the dialogue: Bringing research accounts back into the field. In Conference on Human Factors in Computing Systems - Proceedings, 1426–1430. https://doi.org/10.1145/2858036.2858054",
      "doi": ""
    },
    {
      "text": "Nancy Fraser. 2008. Abnormal justice. Critical Inquiry. https://doi.org/10.1086/589478",
      "doi": ""
    },
    {
      "text": "Paulo Friere. 1970. Pedagogy of the Oppressed. Continuum, New York",
      "doi": ""
    },
    {
      "text": "Andrew Garbett, Rob Comber, Edward Jenkins, and Patrick Olivier. 2016. App movement: A platform for community commissioning of mobile applications. In Conference on Human Factors in Computing Systems - Proceedings, 26–37. https://doi.org/10.1145/2858036.2858094",
      "doi": "10.1145/2858036.2858094"
    },
    {
      "text": "William Gaver, John Bowers, Tobie Kerridge, Andy Boucher, and Nadine Jarvis. 2009. Anatomy of a failure: How we knew when our design went wrong, and what we learned from it. In Conference on Human Factors in Computing Systems - Proceedings, 2213–2222. https://doi.org/10.1145/1518701.1519040",
      "doi": "10.1145/1518701.1519040"
    },
    {
      "text": "William Gaver, Peter Wright, Andy Boucher, John Bowers, Mark Blythe, Nadine Jarvis, David Cameron, Tobie Kerridge, Alex Wilkie, and Robert Phillips. 2011. The photostroller. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11, 1757. https://doi.org/10.1145/1978942.1979198",
      "doi": "10.1145/1978942.1979198"
    },
    {
      "text": "Barbara Grimpe, Mark Hartswood, and Marina Jirotka. Towards a Closer Dialogue between Policy and Practice: Responsible Design in HCI. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. Retrieved November 3, 2020 from http://dx.doi.org/10.1145/2556288.2557364",
      "doi": ""
    },
    {
      "text": "Barbara Grimpe, Mark Hartswood, and Marina Jirotka. 2014. Towards a closer dialogue between policy and practice: Responsible design in HCI. In Conference on Human Factors in Computing Systems - Proceedings, 2965–2974. https://doi.org/10.1145/2556288.2557364",
      "doi": "10.1145/2556288.2557364"
    },
    {
      "text": "David Hankerson, Andrea R. Marshall, Jennifer Booker, Houda El Mimouni, Imani Walker, and Jennifer A. Rode. 2016. Does technology have race? In Conference on Human Factors in Computing Systems - Proceedings, 473–485. https://doi.org/10.1145/2851581.2892578",
      "doi": ""
    },
    {
      "text": "Christina N. Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging Low-Income African American Older Adults in Health Discussions through Community-based Design Workshops. 1–15. https://doi.org/10.1145/3290605.3300823",
      "doi": ""
    },
    {
      "text": "Christina N. Harrington, Anne Marie Piper, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing Community-Based Collaborative Design: Towards More Equitable Participatory Design Engagements. PACM on Human-Computer Interaction 3, CSCW. https://doi.org/10.1145/3359318",
      "doi": ""
    },
    {
      "text": "Claude P.R. Heath, Clara Crivellaro, and Lizzie Coles-Kemp. 2019. Relations are more than bytes: Re-thinking the Benefits of Smart Services with People and Things. In Conference on Human Factors in Computing Systems - Proceedings, 1–12. https://doi.org/10.1145/3290605.3300538",
      "doi": "10.1145/3290605.3300538"
    },
    {
      "text": "Lilly C. Irani and M. Six Silberman. 2016. Stories We Tell About Labor. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16, 4573–4586. https://doi.org/10.1145/2858036.2858592",
      "doi": ""
    },
    {
      "text": "Stephen Kemmis and Mervyn Wilkinson. 1998. Participatory Action Research and the Study of Practice. In Action Research in Practice: Partnership for Social Justice in Education, Bill Atweh, Stephen Kemmis and Patricia Weeks (eds.). Routledge, London",
      "doi": ""
    },
    {
      "text": "Finn Kensing and Jeanette Blomberg. 1998. Participatory Design: Issues and Concerns. Retrieved October 22, 2018 from https://link.springer.com/content/pdf/10.1023%2FA%3A1008689307411.pdf",
      "doi": "10.1023/A%3A1008689307411"
    },
    {
      "text": "Os Keyes. 2018. The misgendering machines: Trans/HCI implications of automatic gender recognition. Proceedings of the ACM on Human-Computer Interaction 2, CSCW: 1–22. https://doi.org/10.1145/3274357",
      "doi": "10.1145/3274357"
    },
    {
      "text": "Os Keyes, Josephine Hoy, and Margaret Drouhard. 2019. Human-computer insurrection notes on an anarchist HCI. In Conference on Human Factors in Computing Systems - Proceedings, 1–13. https://doi.org/10.1145/3290605.3300569",
      "doi": ""
    },
    {
      "text": "Sandjar Kozubaev and Carl DiSalvo. 2020. The future of public libraries as convivial spaces: A design fiction. In Proceedings of the International ACM SIGGROUP Conference on Supporting Group Work, 83–90. https://doi.org/10.1145/3323994.3369901",
      "doi": "10.1145/3323994.3369901"
    },
    {
      "text": "María Puig de la Bellacasa. 2012. ‘Nothing Comes Without Its World’: Thinking with Care. The Sociological Review 60, 2: 197–216. https://doi.org/10.1111/j.1467-954X.2012.02070.x",
      "doi": ""
    },
    {
      "text": "María Puig de la Bellacasa. 2017. Matters of care: Speculative ethics in more than human worlds. https://doi.org/10.1080/14636778.2019.1586527",
      "doi": ""
    },
    {
      "text": "Ann Light and Yoko Akama. 2014. Structuring future social relations: the politics of care in participatory practice. In Proceedings of the 13th Participatory Design Conference on Research Papers - PDC ’14, 151–160. https://doi.org/10.1145/2661435.2661438",
      "doi": "10.1145/2661435.2661438"
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2016. Pushing the limits of design fiction: The case for fictional research papers. In Conference on Human Factors in Computing Systems - Proceedings, 4032–4043. https://doi.org/10.1145/2858036.2858446",
      "doi": "10.1145/2858036.2858446"
    },
    {
      "text": "Stephen Lindsay, Daniel Jackson, Cas Ladha, Karim Ladha, Katie Brittain, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. In Conference on Human Factors in Computing Systems - Proceedings, 521–530. https://doi.org/10.1145/2207676.2207749",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Michael A. Madaio, Luke Stark, Jennifer Wortman Vaughan, and Hanna Wallach. 2020. Co-Designing Checklists to Understand Organizational Challenges and Opportunities around Fairness in AI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–14. https://doi.org/10.1145/3313831.3376445",
      "doi": "10.1145/3313831.3376445"
    },
    {
      "text": "Ezio Manzini. 2019. Design, When Everybody Designs. https://doi.org/10.7551/mitpress/9873.001.0001",
      "doi": ""
    },
    {
      "text": "Bella. Martin and Bruce M. Hanington. 2012. Universal methods of design: 100 ways to research complex problems, develop innovative ideas, and design effective solutions. Rockport Publishers. Retrieved April 2, 2019 from https://books.google.co.uk/books?hl=en&lr=&id=pCVATIpzYfUC&oi=fnd&pg=PA1&dq=participatory+design+methods&ots=_D6njRwNAj&sig=57-DWVIJH9VmVe10zybXB0dxTOk#v=onepage&q=participatorydesignmethods&f=false",
      "doi": ""
    },
    {
      "text": "Donald McMillan and Barry Brown. 2019. Against ethical AI guidelines and self interest. In ACM International Conference Proceeding Series, 1–3. https://doi.org/10.1145/3363384.3363393",
      "doi": ""
    },
    {
      "text": "Eric Monteiro, Neil Pollock, Ole Hanseth, and Robin Williams. 2013. From Artefacts to Infrastructures. Computer Supported Cooperative Work (CSCW) 22, 4–6: 575–607. https://doi.org/10.1007/s10606-012-9167-1",
      "doi": "10.1007/s10606-012-9167-1"
    },
    {
      "text": "Kellie Morrissey, Andrew Garbett, Peter Wright, Patrick Olivier, Edward Ian Jenkins, and Katie Brittain. 2017. Care and Connect: Exploring Dementia-friendliness through an Online Community Commissioning Platform. In Conference on Human Factors in Computing Systems - Proceedings, 2163–2174. https://doi.org/10.1145/3025453.3025732",
      "doi": "10.1145/3025453.3025732"
    },
    {
      "text": "Safiya Umoja Noble. 2019. Algorithms of Oppression. https://doi.org/10.2307/j.ctt1pwt9w5",
      "doi": ""
    },
    {
      "text": "Martha Nussbaum. 2000. Women's Capabilities and Social Justice. Journal of Human Development 1, 2: 219–247. https://doi.org/10.4324/9781315258003-15",
      "doi": ""
    },
    {
      "text": "Martha C. Nussbaum. 2005. Capabilities as fundamental entitlements: Sen and social justice. In Capabilities Equality: Basic Issues and Problems. Taylor & Francis, 44–70. https://doi.org/10.4324/9780203799444",
      "doi": ""
    },
    {
      "text": "Jasper Tran O'Leary, Sara Zewde, Jennifer Mankoff, and Daniela K. Rosner. 2019. Who gets to future? Race, representation, and design methods in Africatown. In Conference on Human Factors in Computing Systems - Proceedings, 1–13. https://doi.org/10.1145/3290605.3300791",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D R Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Patrick Olivier and Peter Wright. 2015. Digital civics. interactions 22, 4: 61–63. https://doi.org/10.1145/2776885",
      "doi": ""
    },
    {
      "text": "Dawn Opel. 2014. Social justice in technologies of prenatal care: Toward a user centered approach to technical communication in home pregnancy testing. In SIGDOC 2014 - Proceedings of the 32nd Annual International Conference on the Design of Communication. https://doi.org/10.1145/2666216.2666223",
      "doi": "10.1145/2666216.2666223"
    },
    {
      "text": "Sebastian Prost, Vasilis Vlachokyriakos, Jane Midgley, Graeme Heron, Kahina Meziant, and Clara Crivellaro. 2019. Infrastructuring Food Democracy. Proceedings of the ACM on Human-Computer Interaction 3, CSCW: 1–27. https://doi.org/10.1145/3359159",
      "doi": "10.1145/3359159"
    },
    {
      "text": "Yolanda A. Rankin and Jakita O. Thomas. 2019. Straighten up and fly right: Rethinking intersectionality in HCI research. Interactions 26, 64–68. https://doi.org/10.1145/3363033",
      "doi": "10.1145/3363033"
    },
    {
      "text": "Yolanda A Rankin and Jakita O Thomas. 2020. The Intersectional Experi-ences of Black Women in Computing. In Proceedings of the 51st ACM Technical Symposium on Computer Science Education. Retrieved November 20, 2020 from https://doi.org/10.1145/3328778",
      "doi": "10.1145/3328778.3366873"
    },
    {
      "text": "Tim Regan, David Sweeney, John Helmes, Vasilis Vlachokyriakos, Siân Lindley, and Alex Taylor. 2015. Designing Engaging Data in Communities. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’15, 271–274. https://doi.org/10.1145/2702613.2725432",
      "doi": "10.1145/2702613.2725432"
    },
    {
      "text": "Sunil Rodger, John Vines, and Janice McLaughlin. 2016. Technology and the Politics of Mobility. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16, 2417–2429. https://doi.org/10.1145/2858036.2858146",
      "doi": "10.1145/2858036.2858146"
    },
    {
      "text": "Emma J Rose, Avery Edenfield, Rebecca Walton, Laura Gonzales, Ann Shivers McNair, Tetyana Zhvotovska, Natasha Jones, Genevieve I. Garcia de Mueller, and Kristen Moore. 2018. Social Justice in UX. In Proceedings of the 36th ACM International Conference on the Design of Communication - SIGDOC ’18, 1–2. https://doi.org/10.1145/3233756.3233931",
      "doi": ""
    },
    {
      "text": "Edward W. Soja. 2010. Seeking Spatial Justice. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Kathrin Gerling, Cynthia L Bennett, Emeline Brulé, Rua M Williams, Jennifer Rode, and Jennifer Mankoff. Nothing About Us Without Us: Investigating the Role of Critical Disability Studies in HCI. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Retrieved November 20, 2020 from https://doi.org/10.1145/3334480.3375150",
      "doi": "10.1145/3334480.3375150"
    },
    {
      "text": "Angelika Strohmayer, Jenn Clamen, and Mary Laing. 2019. Technologies for Social Justice: Lessons from Sex Workers on the Front Lines. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 652:1–652:14. https://doi.org/10.1145/3290605.3300882",
      "doi": "10.1145/3290605.3300882"
    },
    {
      "text": "Matthew Sun and Marissa Gerchick. 2019. The scales of (algorithmic) justice. AI Matters 5, 2: 30–40. https://doi.org/10.1145/3340470.3340478",
      "doi": "10.1145/3340470.3340478"
    },
    {
      "text": "Joan C. Tronto. 2013. Caring democracy: Markets, equality, and justice. https://doi.org/10.1057/cpt.2015.32",
      "doi": ""
    },
    {
      "text": "Shannon Vallor. 2016. Technology and the Virtues: A Philosophical Guide to a Future Worth Wanting. Oxford University Press, New York. https://doi.org/10.5840/tej20181264",
      "doi": ""
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring participation: On How We Involve People In Design. In Proc. of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13, 429–438. https://doi.org/10.1145/2470654.2470716",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Vasilis Vlachokyriakos, Clara Crivellaro, Pete Wright, and Patrick Olivier. 2018. Infrastructuring the Solidarity economy: Unpacking strategies and tactics in designing social innovation. In Conference on Human Factors in Computing Systems - Proceedings, 1–12. https://doi.org/10.1145/3173574.3174055",
      "doi": "10.1145/3173574.3174055"
    },
    {
      "text": "Vasillis Vlachokyriakos, Clara Crivellaro, Christopher A. Le Dantec, Eric Gordon, Pete Wright, and Patrick Olivier. 2016. Digital Civics. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’16, 1096–1099. https://doi.org/10.1145/2851581.2886436",
      "doi": ""
    },
    {
      "text": "Marisol Wong-Villacres, Carl DiSalvo, Neha Kumar, and Betsy DiSalvo. 2020. Culture in Action: Unpacking Capacities to Inform Assets-Based Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–14. https://doi.org/10.1145/3313831.3376329",
      "doi": "10.1145/3313831.3376329"
    },
    {
      "text": "Richmond Y. Wong, Vera Khovanskaya, Sarah E. Fox, Nick Merrill, and Phoebe Sengers. 2020. Infrastructural Speculations: Tactics for Designing and Interrogating Lifeworlds. 1–15. https://doi.org/10.1145/3313831.3376515",
      "doi": ""
    }
  ]
}