{
  "doi": "10.1145/3411764.3445413",
  "title": "Isolation in Coordination: Challenges of Caregivers in the USA",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "As the global population ages and the prevalence of chronic conditions and acute infections rise, it is becoming imperative to understand the many forms of caregiving labor and create sociotechnical systems that support them. In this paper, we report results of a large survey study with 2000 informal caregivers in the USA, highlighting the fundamental challenges that different types of caregivers face when coordinating care with others. Our findings support previous findings on caregivers’ coordination challenges, while also offering insights into the situational, mediating factors that influence the extent to which care coordination challenges are felt. These mediating factors include caregivers’ relationships, access to a variety of resources including physical, social, and financial support, and physical and mental barriers. We discuss these challenges and mediating factors, and conclude with a discussion on how they can be considered in the design of future sociotechnical systems.",
  "authors": [
    {
      "name": "Mark Schurgin",
      "institution": "Google Health, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700891",
      "orcid": "missing"
    },
    {
      "name": "Mark Schlager",
      "institution": "Google Health Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702463",
      "orcid": "missing"
    },
    {
      "name": "Laura Vardoulakis",
      "institution": "Google Health, United States",
      "img": "/do/10.1145/contrib-86058689957/rel-imgonly/lauravar.jpeg",
      "acmid": "86058689957",
      "orcid": "missing"
    },
    {
      "name": "Laura R. Pina",
      "institution": "Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700931",
      "orcid": "missing"
    },
    {
      "name": "Lauren Wilcox",
      "institution": "Google, United States",
      "img": "/do/10.1145/contrib-81416600696/rel-imgonly/81416600696.jpeg",
      "acmid": "81416600696",
      "orcid": "0000-0001-6598-1733"
    }
  ],
  "references": [
    {
      "text": "Rikke Aarhus, Erik Grönvall, and Morten Kyng. 2010. Challenges in participation. In 2010 4th International Conference on Pervasive Computing Technologies for Healthcare. IEEE, 1–4.",
      "doi": ""
    },
    {
      "text": "Ofra Amir, Barbara J. Grosz, Krzysztof Z. Gajos, Sonja M. Swenson, and Lee M. Sanders. 2015. From Care Plans to Care Coordination: Opportunities for Computer Support of Teamwork in Complex Healthcare. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1419–1428. https://doi.org/10.1145/2702123.2702320",
      "doi": "10.1145/2702123.2702320"
    },
    {
      "text": "Stinne Aaløkke Ballegaard, Jonathan Bunde-Pedersen, and Jakob E Bardram. 2006. Where to, Roberta? Reflecting on the role of technology in assisted living. In Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles. 373–376.",
      "doi": "10.1145/1182475.1182515"
    },
    {
      "text": "The World Bank. 2019. United Nations Population Division’s World Population Prospects: 2019 Revision. https://data.worldbank.org/indicator/SP.POP.65UP.TO.ZS",
      "doi": ""
    },
    {
      "text": "Andrew B L Berry, Catherine Lim, Andrea L Hartzler, Tad Hirsch, Evette Ludman, Edward H Wagner, and James D Ralston. 2017. Creating Conditions for Patients’ Values to Emerge in Clinical Conversations: Perspectives of Health Care Team Members. In Proceedings of the 2017 Conference on Designing Interactive Systems(DIS ’17). ACM, New York, NY, USA, 1165–1174. https://doi.org/10.1145/3064663.3064669",
      "doi": "10.1145/3064663.3064669"
    },
    {
      "text": "Tone Bratteteig and Ingvild Eide. 2017. Becoming a good homecare practitioner: integrating many kinds of work. Computer Supported Cooperative Work (CSCW) 26, 4-6 (2017), 563–596.",
      "doi": "10.1007/s10606-017-9288-7"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2020. One size fits all? What counts as quality practice in (reflexive) thematic analysis?Qualitative research in psychology(2020), 1–25.",
      "doi": ""
    },
    {
      "text": "US Census Bureau. 2010. US Census Regions. https://www2.census.gov/geo/pdfs/maps-data/maps/reference/us_regdiv.pdf",
      "doi": ""
    },
    {
      "text": "AARP Family Caregiving and National Alliance for Caregiving. 2020. Caregiving in the U.S.https://www.aarp.org/content/dam/aarp/ppi/2020/05/full-report-caregiving-in-the-united-states.doi.10.26419-2Fppi.00103.001.pdf",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Measuring pursuits, marking self: Meaning construction in chronic illness. International Journal of Qualitative Studies on Health and Well-being 1, 1(2006), 27–37.",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for Caregivers: Designing for Integrality. In Proceedings of the 2013 conference on Computer Supported Cooperative Work. ACM, 91–102.",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Yunan Chen, Nervo Verdezoto, Xinning Gui, Xiaojuan Ma, Claus Bossen, Naveen Bagalkot, Valeria Herskovic, and Bernd Ploderer. 2019. Unpacking the Infrastructuring Work of Patients and Caregivers Around the World. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). ACM, New York, NY, USA, Article W03, 8 pages. https://doi.org/10.1145/3290607.3299021",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Peter Roessler, Brett E Shelton, Anthony LaMarca, Bill Schilit, and Sara Bly. 2004. Technology for care networks of elders. IEEE pervasive computing 3, 2 (2004), 22–29.",
      "doi": "10.1109/MPRV.2004.1316814"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 1985. Managing chronic illness at home: three lines of work. Qualitative sociology 8, 3 (1985), 224–247.",
      "doi": ""
    },
    {
      "text": "Flannery Currin, Gustavo Razo, and Aehong Min. 2019. Give Me a Break: Design for Communication Among Family Caregivers and Respite Caregivers. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). ACM, New York, NY, USA, Article SDC05, 6 pages. https://doi.org/10.1145/3290607.3309687",
      "doi": "10.1145/3290607.3309687"
    },
    {
      "text": "Betsy DiSalvo. 2016. Participatory Design through a Learning Science Lens. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4459–4463. https://doi.org/10.1145/2858036.2858405",
      "doi": "10.1145/2858036.2858405"
    },
    {
      "text": "Karen Donelan, Craig Hill, Catherine Hoffman, Kimberly Scoles, Penny Feldman, Carol Levine, and David Gould. 2002. Challenged To Care: Informal Caregivers In A Changing Health System. Health affairs (Project Hope) 21 (07 2002), 222–31. https://doi.org/10.1377/hlthaff.21.4.222",
      "doi": ""
    },
    {
      "text": "Hayley Evans, Udaya Lakshmi, Hue Watson, Azra Ismail, Andrew M. Sherrill, Neha Kumar, and Rosa I. Arriaga. 2020. Understanding the Care Ecologies of Veterans with PTSD. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376170",
      "doi": "10.1145/3313831.3376170"
    },
    {
      "text": "Pin Sym Foong, Charis Anne Lim, Joshua Wong, Chang Siang Lim, Simon Tangi Perrault, and Gerald CH Koh. 2020. ” You Cannot Offer Such a Suggestion” Designing for Family Caregiver Input in Home Care Systems. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376607"
    },
    {
      "text": "Pin Sym Foong, Shengdong Zhao, Felicia Tan, and Joseph Jay Williams. 2018. Harvesting Caregiving Knowledge: Design Considerations for Integrating Volunteer Input in Dementia Care. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 79, 12 pages. https://doi.org/10.1145/3173574.3173653",
      "doi": "10.1145/3173574.3173653"
    },
    {
      "text": "Sarah E Fox, Vera Khovanskaya, Clara Crivellaro, Niloufar Salehi, Lynn Dombrowski, Chinmay Kulkarni, Lilly Irani, and Jodi Forlizzi. 2020. Worker-Centered Design: Expanding HCI Methods for Supporting Labor. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": ""
    },
    {
      "text": "Amir Goren, William Montgomery, Kristin Kahle-Wrobleski, Tomomi Nakamura, and Kaname Ueda. 2016. Impact of caring for persons with Alzheimer’s disease or dementia on caregivers’ health outcomes: findings from a community based survey in Japan. BMC geriatrics 16, 1 (2016), 122.",
      "doi": ""
    },
    {
      "text": "Xinning Gui and Yunan Chen. 2019. Making Healthcare Infrastructure Work: Unpacking the Infrastructuring Work of Individuals. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 458.",
      "doi": "10.1145/3290605.3300688"
    },
    {
      "text": "Francisco J Gutierrez and Sergio F Ochoa. 2017. It takes at least two to tango: understanding the cooperative nature of elderly caregiving in Latin America. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 1618–1630.",
      "doi": "10.1145/2998181.2998314"
    },
    {
      "text": "Betty R Hasselkus and Bridget J Murray. 2007. Everyday occupation, well-being, and identity: The experience of caregivers in families with dementia. American Journal of Occupational Therapy 61, 1 (2007), 9–20.",
      "doi": ""
    },
    {
      "text": "Matthew K. Hong, Udaya Lakshmi, Kimberly Do, Sampath Prahalad, Thomas Olson, Rosa I. Arriaga, and Lauren Wilcox. 2020. Using Diaries to Probe the Illness Experiences of Adolescent Patients and Parental Caregivers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376426",
      "doi": "10.1145/3313831.3376426"
    },
    {
      "text": "Matthew K. Hong, Udaya Lakshmi, Thomas A. Olson, and Lauren Wilcox. 2018. Visual ODLs: Co-Designing Patient-Generated Observations of Daily Living to Support Data-Driven Conversations in Pediatric Care. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, New York, New York, USA, 1–13. https://doi.org/10.1145/3173574.3174050",
      "doi": "10.1145/3173574.3174050"
    },
    {
      "text": "Matthew K Hong, Lauren Wilcox, Daniel Machado, Thomas A Olson, and Stephen F Simoneaux. 2016. Care Partnerships: Toward Technology to Support Teens’ Participation in Their Health Care. In Proceedings of the 34th annual ACM Conference on Human Factors in Computing Systems. San Jose, CA. https://doi.org/10.1145/2858036.2858508",
      "doi": "10.1145/2858036.2858508"
    },
    {
      "text": "AARP Public Policy Institute. 2017. Who Relies on Medicare? A Profile of the Medicare Population. https://www.aarp.org/content/dam/aarp/ppi/2017/11/who-relies-on-medicare-a-profile-of-the-medicare-population.pdf",
      "doi": ""
    },
    {
      "text": "Maia Jacobs, Galina Gheihman, Krzysztof Z. Gajos, and Anoopum S. Gupta. 2019. ”I Think We Know More than Our Doctors”: How Primary Caregivers Manage Care Teams with Limited Disease-Related Expertise. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 159 (Nov. 2019), 22 pages. https://doi.org/10.1145/3359261",
      "doi": "10.1145/3359261"
    },
    {
      "text": "Elizabeth Kaziunas, Mark S. Ackerman, Silvia Lindtner, and Joyce M. Lee. 2017. Caring through Data: Attending to the Social and Emotional Experiences of Health Datafication. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing - CSCW ’17. ACM Press, New York, New York, USA, 2260–2272. https://doi.org/10.1145/2998181.2998303",
      "doi": "10.1145/2998181.2998303"
    },
    {
      "text": "Ivar Krumpal. 2013. Determinants of social desirability bias in sensitive surveys: a literature review. Quality & Quantity 47, 4 (2013), 2025–2047.",
      "doi": ""
    },
    {
      "text": "Ariella Lang. 2010. There’s no place like home: research, practice and policy perspectives regarding safety in homecare.",
      "doi": ""
    },
    {
      "text": "Leslie S Liu, Sen H Hirano, Monica Tentori, Karen G Cheng, Sheba George, Sun Young Park, and Gillian R Hayes. 2011. Improving communication and social support for caregivers of high-risk infants through mobile technologies. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. 475–484.",
      "doi": "10.1145/1958824.1958897"
    },
    {
      "text": "Lena Mamykina, Elizabeth Mynatt, Patricia Davidson, and Daniel Greenblatt. 2008. MAHI: Investigation of Social Scaffolding for Reflective Thinking in Diabetes Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 477–486. https://doi.org/10.1145/1357054.1357131",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "Medicaid.gov. 2020. Medicaid Statistics. https://www.medicaid.gov/medicaid/index.html",
      "doi": ""
    },
    {
      "text": "Medicaid.gov. 2020. What’s Medicare?https://www.medicare.gov/what-medicare-covers/your-medicare-coverage-choices/whats-medicare",
      "doi": ""
    },
    {
      "text": "Andrew D Miller, Sonali R Mishra, Logan Kendall, Shefali Haldar, Ari H Pollack, and Wanda Pratt. 2016. Partners in care: design considerations for caregivers and patients during a hospital stay. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 756–769.",
      "doi": "10.1145/2818048.2819983"
    },
    {
      "text": "Pedro A Moreno, Saisakul Chernbumroong, Caroline Langensiepen, Ahmad Lotfi, and Enrique J Gómez. 2016. Virtual Carer: Personalized support for informal caregivers of elderly. In Proceedings of the 9th ACM International Conference on PErvasive Technologies Related to Assistive Environments. ACM, 38.",
      "doi": "10.1145/2910674.2935855"
    },
    {
      "text": "Ingrid Mulder, Yvonne Schikhof, Martijn Vastenburg, Alan Card, Tory Dunn, Andreas Komninos, Marilyn McGee-Lennon, Mark Santcroos, Gabriele Tiotto, Mieke Van Gils, 2009. Designing with care: The future of pervasive healthcare. IEEE pervasive computing 8, 4 (2009), 85–88.",
      "doi": ""
    },
    {
      "text": "Elizabeth D. Mynatt, Jim Rowan, Sarah Craighill, and Annie Jacobs. 2001. Digital Family Portraits: Supporting Peace of Mind for Extended Family Members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seattle, Washington, USA) (CHI ’01). ACM, New York, NY, USA, 333–340. https://doi.org/10.1145/365024.365126",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Trans. Comput.-Hum. Interact. 22, 6, Article 33 (Dec. 2015), 45 pages. https://doi.org/10.1145/2803173",
      "doi": "10.1145/2803173"
    },
    {
      "text": "International Alliance of Carer Organizations. [n.d.]. Carer Facts: Recognizing Carers. https://internationalcarers.org/carer-facts/",
      "doi": ""
    },
    {
      "text": "US Dept of Veteran Affairs. 2020. About VHA. https://www.va.gov/health/aboutvha.asp",
      "doi": ""
    },
    {
      "text": "National Research Council (US) Committee on the Role of Human Factors in Home Health Care.2010. Informal Caregivers in the United States: Prevalence, Caregiver Characteristics, and Ability to Provide Care.https://www.ncbi.nlm.nih.gov/books/NBK210048/",
      "doi": ""
    },
    {
      "text": "Anthony J Onwuegbuzie and Kathleen MT Collins. 2007. A typology of mixed methods sampling designs in social science research.Qualitative Report 12, 2 (2007), 281–316.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2020. Nutrition Topics. https://www.who.int/nutrition/topics/2_background/en/",
      "doi": ""
    },
    {
      "text": "Eleanor O’Rourke, Erik Andersen, Sumit Gulwani, and Zoran Popović. 2015. A Framework for Automatically Generating Interactive Instructional Scaffolding. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1545–1554. https://doi.org/10.1145/2702123.2702580",
      "doi": "10.1145/2702123.2702580"
    },
    {
      "text": "Leysia Palen and Stinne Aaløkke. 2006. Of pill boxes and piano benches: ” home-made” methods for managing medication. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. 79–88.",
      "doi": "10.1145/1180875.1180888"
    },
    {
      "text": "Laura Pina, Sang-Wha Sien, Clarissa Song, Teresa M. Ward, James Fogarty, Sean A. Munson, and Julie A. Kientz. 2020. DreamCatcher: Exploring How Parents and School-Age Children Can Track and Review Sleep Information Together. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 070 (May 2020), 25 pages. https://doi.org/10.1145/3392882",
      "doi": "10.1145/3392882"
    },
    {
      "text": "Laura R. Pina, Sang-Wha Sien, Teresa Ward, Jason C. Yip, Sean A. Munson, James Fogarty, and Julie A. Kientz. 2017. From Personal Informatics to Family Informatics: Understanding Family Practices around Health Monitoring. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 2300–2315. https://doi.org/10.1145/2998181.2998362",
      "doi": "10.1145/2998181.2998362"
    },
    {
      "text": "Anne Marie Piper, Raymundo Cornejo, Lisa Hurwitz, and Caitlin Unumb. 2016. Technological caregiving: Supporting online activity for adults with cognitive impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5311–5323.",
      "doi": "10.1145/2858036.2858260"
    },
    {
      "text": "Mirjana Prpa, Sarah Fdili-Alaoui, Thecla Schiphorst, and Philippe Pasquier. 2020. Articulating Experience: Reflections from Experts Applying Micro-Phenomenology to Design Research in HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376664"
    },
    {
      "text": "Debra Sanders and Dorette Sugg Welk. 2005. Strategies to scaffold student learning: Applying Vygotsky’s zone of proximal development. Nurse educator 30, 5 (2005), 203–207.",
      "doi": ""
    },
    {
      "text": "Kjeld Schmidt and Carla Simonee. 1996. Coordination mechanisms: Towards a conceptual foundation of CSCW systems design. Computer Supported Cooperative Work (CSCW) 5, 2-3 (1996), 155–200.",
      "doi": "10.1007/BF00133655"
    },
    {
      "text": "Marén Schorch, Lin Wan, David William Randall, and Volker Wulf. 2016. Designing for those who are overlooked: Insider perspectives on care practices and cooperative work of elderly informal caregivers. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 787–799.",
      "doi": "10.1145/2818048.2819999"
    },
    {
      "text": "Carla Simone, Monica Divitini, and Kjeld Schmidt. 1995. A notation for malleable and interoperable coordination mechanisms for CSCW systems. In Proceedings of conference on Organizational computing systems. 44–54.",
      "doi": "10.1145/224019.224024"
    },
    {
      "text": "Portia E. Singh, Payaal Patel, Matthew L. Lee, and Mladen Milosevic. 2016. Understanding Informal Caregiver Needs for Coordinating Care to Support Aging in Place. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare (Cancun, Mexico) (PervasiveHealth ’16). ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), Brussels, BEL, 249–252.",
      "doi": "10.5555/3021319.3021359"
    },
    {
      "text": "Petr Slovák, Kael Rowan, Christopher Frauenberger, Ran Gilad-Bachrach, Mia Doces, Brian Smith, Rachel Kamb, and Geraldine Fitzpatrick. 2016. Scaffolding the Scaffolding: Supporting Children’s Social-Emotional Learning at Home. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1751–1765. https://doi.org/10.1145/2818048.2820007",
      "doi": "10.1145/2818048.2820007"
    },
    {
      "text": "Katta Spiel, Oliver L. Haimson, and Danielle Lottridge. 2019. How to Do Better with Gender on Surveys: A Guide for HCI Researchers. Interactions 26, 4 (June 2019), 62–65. https://doi.org/10.1145/3338283",
      "doi": "10.1145/3338283"
    },
    {
      "text": "Susan Leigh Star and Anselm Strauss. 1999. Layers of silence, arenas of voice: The ecology of visible and invisible work. Computer supported cooperative work (CSCW) 8, 1-2 (1999), 9–30.",
      "doi": ""
    },
    {
      "text": "A Strauss, S Fagerhaugh, B Suczek, and C Wiener. 1985. Social Organization of Medical Work University of Chicago Press. Chicago, IL (1985).",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1995. Making work visible. Commun. ACM 38, 9 (1995), 56–64.",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Charlotte Tang, Yunan Chen, Karen Cheng, Victor Ngo, and John E. Mattison. 2018. Awareness and handoffs in home care: coordination among informal caregivers. Behaviour & Information Technology 37, 1 (2018), 66–86. https://doi.org/10.1080/0144929X.2017.1405073",
      "doi": ""
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2015. Looking for respite and support: Technological opportunities for spousal caregivers. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, 1155–1158.",
      "doi": "10.1145/2702123.2702563"
    },
    {
      "text": "Matthieu Tixier and Myriam Lewkowicz. 2016. ” Counting on the Group” Reconciling Online and Offline Social Support among Older Informal Caregivers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3545–3558.",
      "doi": "10.1145/2858036.2858477"
    },
    {
      "text": "Tiffany C Veinot, Hannah Mitchell, and Jessica S Ancker. 2018. Good intentions are not enough: how informatics interventions can worsen inequality. Journal of the American Medical Informatics Association 25, 8(2018), 1080–1088.",
      "doi": ""
    },
    {
      "text": "Sheryl L Walter, Scott E Seibert, Daniel Goering, and Ernest H O’Boyle. 2019. A tale of two sample sources: Do results from online panel data and conventional data converge?Journal of Business and Psychology 34, 4 (2019), 425–452.",
      "doi": ""
    },
    {
      "text": "Jeremy Warner and Philip J. Guo. 2017. CodePilot: Scaffolding End-to-End Collaborative Software Development for Novice Programmers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1136–1141. https://doi.org/10.1145/3025453.3025876",
      "doi": "10.1145/3025453.3025876"
    },
    {
      "text": "Ryan Wedoff, Lindsay Ball, Amelia Wang, Yi Xuan Khoo, Lauren Lieberman, and Kyle Rector. 2019. Virtual Showdown: An Accessible Virtual Reality Game with Scaffolds for Youth with Visual Impairments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300371",
      "doi": "10.1145/3290605.3300371"
    },
    {
      "text": "Rainer Winkler, Sebastian Hobert, Antti Salovaara, Matthias Söllner, and Jan Marco Leimeister. 2020. Sara, the Lecturer: Improving Learning in Online Education with a Scaffolding-Based Conversational Agent. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376781",
      "doi": "10.1145/3313831.3376781"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, and Takashi Kudo. 2013. Understanding the conflicting demands of family caregivers caring for depressed family members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2637–2646.",
      "doi": "10.1145/2470654.2481365"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Takashi Kudo, Eiji Aramaki, and Kazuki Hattori. 2017. Changing Moods: How Manual Tracking by Family Caregivers Improves Caring and Family Communication. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 158–169. https://doi.org/10.1145/3025453.3025843",
      "doi": "10.1145/3025453.3025843"
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Takashi Kudo, Keiji Hirata, Eiji Aramaki, and Kazuki Hattori. 2018. How Information Sharing about Care Recipients by Family Caregivers Impacts Family Communication. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, New York, New York, USA, 1–13. https://doi.org/10.1145/3173574.3173796",
      "doi": "10.1145/3173574.3173796"
    }
  ]
}