{
  "doi": "10.1145/3411764.3445127",
  "title": "'We Can Send A Man To The Moon But We Can't Control The Temperature In Our office'; A Considerate Approach To Workplace Thermal Comfort by Older Women",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "From Fanger's seminal work on thermal comfort in the 1970s, standards governing temperatures in the workplace enshrine clothing level calculations based on full business suits, and building regulations developed using only male metabolic data, locking in a default male perspective. Even later work that highlights gender biases with regard to metabolism calculation, inclusive of both genders has focused on younger women, and the voices of older working women are missing from this discourse. We invited women over 45 to explore what they find important in workplace thermal comfort, and how devices and interfaces might meet their needs and also encourage thermal adaptivity. Our study highlights factors such as 'fresh air', and the importance of empathy to fellow inhabitants. We bring new voices to the thermal comfort discourse which supports reducing energy use in the workplace, improving thermal environments and ensuring the needs of a diverse, aging workforce are considered.",
  "tags": [
    "3",
    "User experience",
    "Menopause 4",
    "Thermal comfort",
    "2",
    "Gender",
    "1"
  ],
  "authors": [
    {
      "name": "Kathy New",
      "institution": "Lancaster University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365144",
      "orcid": "missing"
    },
    {
      "name": "Alexandra Gormally",
      "institution": "Lancaster Environment Centre Lancaster University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701375",
      "orcid": "missing"
    },
    {
      "name": "Adrian Friday",
      "institution": "School of Computing and Communications Lancaster University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533743",
      "orcid": "missing"
    },
    {
      "name": "Mike Hazas",
      "institution": "Department of Information Technology Uppsala University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100484405",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sara Arber and Jay Ginn. 1991. The Invisibility of Age: Gender and Class in Later Life. Sociol. Rev. 39, 2 (May 1991), 260–291. https://doi.org/10.1111/j.1467-954X.1991.tb02981.x",
      "doi": ""
    },
    {
      "text": "ASHRAE. 1992. ANSI/ASHRAE Standard 55-1992, Thermal environmental conditions for human occupancy. Atlanta: American Society of Heating, Refrigerating and Air-Conditioning Engineers, Inc.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Chi’10, 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": ""
    },
    {
      "text": "Vanessa Beck, Jo Brewis, & Andrea Davies, 2018. The post-re/productive: Researching the menopause. Journal of Organizational Ethnography, 7(3), 247-262",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett and Daniela K. Rosner. 2019. The Promise of Empathy: Design, Disability, and Knowing the \"Other\". In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 298, 1–13. DOI: https://doi.org/10.1145/3290605.3300528",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "Tessa Berg, 2015, Rich Picture: The Role of the Facilitator. Syst Pract Action Res 28, 67–77 https://doi-org.ezproxy.lancs.ac.uk/10.1007/s11213-014-9318-z",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Derek Foster, Shaun Lawson, Conor Linehan and Jamie Wardman. 2012. “Watts in it for me?” Design implications for implementing effective energy interventions in organisations. In Conference on Human Factors in Computing Systems - Proceedings, 2357–2366. https://doi.org/10.1145/2207676.2208396",
      "doi": ""
    },
    {
      "text": "Jaime Bochantin (2014) “Long Live the Mensi-Mob”: Communicating Support Online With Regards to Experiencing Menopause in the Workplace, Communication Studies, 65:3, 260-280, DOI: 10.1080/10510974.2013.811433",
      "doi": ""
    },
    {
      "text": "British Standards Institution, (2017). BS EN 12831-1:2017: Energy Performance of Buildings. Method for calculation of the design heat load. Space heating load, Module M3-3.",
      "doi": ""
    },
    {
      "text": "Alison Browne. 2016. Can people talk together about their practices? Focus groups, humour and the sensitive dynamics of everyday life. Area 48, 2,198–205. https://doi.org/10.1111/area.12250",
      "doi": ""
    },
    {
      "text": "Ronald J. Burke, Cary. L. Cooper and Alexander-Stamatios Antoniou, 2015. The Multi-generational and aging workforce?: challenges and opportunities. Edward Elgar Publishing, Cheltenham, UK.",
      "doi": ""
    },
    {
      "text": "CIBSE. 2015. 1.5.1 Heated, Cooled and Air. In CIBSE Guide A : Environmental Design (8th ed.). CIBSE, 402.",
      "doi": ""
    },
    {
      "text": "Adrian K. Clear, Janine Morley, Mike Hazas, Adrian Friday, and Oliver Bates, Understanding adaptive thermal comfort: new directions for UbiComp. In Proc. of UbiComp (2013), pp. 113–122.",
      "doi": "10.1145/2493432.2493451"
    },
    {
      "text": "Adrian K. Clear, Rob Comber, Sam Finnigan and Patrick Olivier. 2017. “I'd Want to Burn the Data or at Least Nobble the Numbers.” (2017), 2448–2461. https://doi.org/10.1145/2998181.2998188",
      "doi": ""
    },
    {
      "text": "Adrian K. Clear, Samantha Mitchell Finnigan, Patrick Olivier and Rob Comber (2018) ThermoKiosk: Investigating Roles for Digital Surveys of Thermal Experience in Workplace Comfort Management. In: CHI 2018 - 2018 ACM Conference on Human Factors in Computing Systems, 21st - 26th April 2018, Montreal, Canada.",
      "doi": ""
    },
    {
      "text": "Kenneth J. Collins, Arthur N. Exton-Smith and Caroline Doré 1981. Urban hypothermia: preferred temperature and thermal perception in old age. Br. Med. J. (Clin. Res. Ed). 282, 6259 (January 1981), 175–177. https://doi.org/10.1136/bmj.282.6259.175",
      "doi": ""
    },
    {
      "text": "Paul Coulton, Jonny Huck, Andrew Hudson-Smith, Ralph Barthel, Panagiotis Mavros, Jennifer Roberts, and Philip Powell. 2014. Designing interactive systems to encourage empathy between users. In Proceedings of the 2014 companion publication on Designing interactive systems (DIS Companion '14). Association for Computing Machinery, New York, NY, USA, 13–16. DOI: https://doi.org/10.1145/2598784.2602770",
      "doi": "10.1145/2598784.2602770"
    },
    {
      "text": "Caroline Criado-Perez. 2019. Invisible Women: Data Bias in a World Designed for Men. Abrams Press, New York, USA.",
      "doi": ""
    },
    {
      "text": "Julie S. Dare. 2011. Transitions in Midlife Women's Lives: Contemporary Experiences. Health Care Women Int. 32, 2 (January 2011), 111–133. https://doi.org/10.1080/07399332.2010.500753",
      "doi": ""
    },
    {
      "text": "David Degroot and Larry Kenney. 2007. Impaired defense of core temperature in aged humans during mild cold stress. Am. J. Physiol. Regul. Integr. Comp. Physiol. 292, 1 (January 2007), R103-8. https://doi.org/10.1152/ajpregu.00074.2006",
      "doi": ""
    },
    {
      "text": "Emma Dewberry and Chris Sherwin. 2002. Visioning Sustainability through Design. Greener Manag. Int. 37 (September 2002), 125–138. Retrieved from http://www.jstor.org/stable/greemanainte.37.125",
      "doi": ""
    },
    {
      "text": "Povl O. Fanger. 1972. Thermal comfort: analysis and applications in environmental engineering,. McGraw-Hill, New York.",
      "doi": ""
    },
    {
      "text": "Jane Fulton Suri (2001) The next 50 years: future challenges and opportunities for empathy in our science, Ergonomics, 44:14, 1278-1289, DOI: 10.1080/00140130110105850",
      "doi": ""
    },
    {
      "text": "Murray Goulden & Alexa Spence, 2015. Caught in the middle: The role of the Facilities Manager in organisational energy use. Energy Policy, 85, 280-287",
      "doi": ""
    },
    {
      "text": "Nobuko Hashiguchi, Yutaka Tochihara, Tadakatsu Ohnaka, Tamio Otsuki, and Chiaki Tsuchida. 2004. Physiological and subjective responses in the elderly when using floor heating and air conditioning systems. J. Physiol. Anthropol. Appl. Human Sci. 23, 6, 205–213. https://doi.org/10.2114/jpa.23.205",
      "doi": ""
    },
    {
      "text": "Rachel Hess, Rebecca C. Thurston, Ron D. Hays, Chung-Chou H. Chang, Stacey N. Dillon, Roberta B. Ness, Cindy L. Bryce, Wishwa N. Kapoor, and Karen A. Matthews . 2012. The impact of menopause on health-related quality of life: results from the STRIDE longitudinal study. Qual. Life Res. 21, 3 (2012), 535–544. DOI: https://doi.org/10.1007/s11136-011-9959-7",
      "doi": ""
    },
    {
      "text": "Sarah Homewood. 2019. Inaction as a Design Decision: Reflections on Not Designing Self-Tracking Tools for Menopause. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). Association for Computing Machinery, New York, NY, USA, Paper alt17, 1–12. DOI: https://doi.org/10.1145/3290607.3310430",
      "doi": "10.1145/3290607.3310430"
    },
    {
      "text": "Joost Van Hoof. 2008. Forty years of Fanger's model of thermal comfort: Comfort for all? Indoor Air 18, 3 (2008), 182–201. https://doi.org/10.1111/j.1600-0668.2007.00516.x",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, and Eva Carin Banka Johnson 2015. Somaesthetic design. Interactions 22, 4 (2015), 26–33. https://doi.org/10.1145/2770888",
      "doi": "10.1145/2770888"
    },
    {
      "text": "Rachel Jevons, Catriona Carmichael, A. Crossley and Angie Bone, 2016. Minimum indoor temperature threshold recommendations for English homes in winter – A systematic review, Public Health, Volume 136, Pages 4-12, https://doi.org/10.1016/j.puhe.2016.02.007",
      "doi": ""
    },
    {
      "text": "Boris Kingma and Wouter van Marken Lichtenbelt. 2015. Energy consumption in buildings and female thermal demand. Nat. Clim. Chang. 5, 12 (2015), 1054–1056. https://doi.org/10.1038/nclimate2741",
      "doi": ""
    },
    {
      "text": "Ilpo Koskinen, Katja Battarbee and Tuuli Mattelmäki. 2003. Empathic Design. IT Press, Helsinki, Finland.",
      "doi": ""
    },
    {
      "text": "Fredi Kronenberg, 1994, Hot flashes: Phenomenology, quality of life, and search for treatment options, Experimental Gerontology, Volume 29, Issues 3–4. https://doi.org/10.1016/0531-5565(94)90012-4",
      "doi": ""
    },
    {
      "text": "Fredi Kronenberg, Ruth M. Barnard, 1992. Modulation of menopausal hot flashes by ambient temperature, Journal of Thermal Biology, Volume 17, Issue 1, Pages 43-49, https://doi.org/10.1016/0306-4565(92)90018-B",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Norman Makoto Su, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Parting the Red Sea: Sociotechnical Systems and Lived Experiences of Menopause. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 480, 1–16. DOI: https://doi.org/10.1145/3290605.3300710",
      "doi": "10.1145/3290605.3300710"
    },
    {
      "text": "Leicester University, 2017, https://www2.le.ac.uk/offices/press/press-releases/2018/august/201clet2019s-say-2018menopause2019-three-times-a-day201d#.",
      "doi": ""
    },
    {
      "text": "Jessica Menold and Kathryn Jablokow 2019. Exploring the effects of cognitive style diversity and self-efficacy beliefs on final design attributes in student design teams. Des. Stud. 60, (2019), 71–102. https://doi.org/10.1016/j.destud.2018.08.001",
      "doi": ""
    },
    {
      "text": "Merriam-Webster. Empathy. Merriam-Webster. Retrieved from https://www.merriam-webster.com/dictionary/Empathy",
      "doi": ""
    },
    {
      "text": "Milan Milenkovic, Ulf Hanebutte, Yonghong Huang, David Prendergast, and Han Pham. 2013. Improving user comfort and office energy efficiency with POEM (personal office energy monitor). In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). Association for Computing Machinery, New York, NY, USA, 1455–1460. DOI: https://doi.org/10.1145/2468356.2468616",
      "doi": "10.1145/2468356.2468616"
    },
    {
      "text": "Jennie Morton. 2012. The Root Causes of Thermal Comfort. Buildings. Retrieved from https://www.buildings.com/article-details/articleid/13374/title/the-root-causes-of-thermal-comfort",
      "doi": ""
    },
    {
      "text": "NHS. 2018. Menopause. Retrieved from https://www.nhs.uk/conditions/menopause",
      "doi": ""
    },
    {
      "text": "Office for National Statistics. 2017. How do the jobs men and women do affect the gender pay gap? Retrieved from https://www.ons.gov.uk/employmentandlabourmarket/peopleinwork/earningsandworkinghours/articles/howdothejobsmenandwomendoaffectthegenderpaygap/2017-10-06",
      "doi": ""
    },
    {
      "text": "Elspeth Oppermann, Gordon Walker and Matt Brearley. 2020. Assembling a thermal rhythmanalysis: Energetic flows, heat stress and polyrhythmic interactions in the context of climate change. Geoforum 108, October 2018 (2020), 275–285. https://doi.org/10.1016/j.geoforum.2019.09.012",
      "doi": ""
    },
    {
      "text": "Henk Schellen, Wouter van Marken Lichtenbelt, Marcel Loomans, Jørn Toftum and Marij de Wit 2010. Differences between young adults and elderly in thermal comfort, productivity, and thermal physiology in response to a moderate temperature drift and a steady-state condition. Indoor Air 20, 4 (2010), 273–283. https://doi.org/10.1111/j.1600-0668.2010.00657.x",
      "doi": ""
    },
    {
      "text": "Eun Jeong Shin, Roberto Yus, Sharad Mehrotra and Nalini Venkatasubramanian. 2017. Exploring fairness in participatory thermal comfort control in smart buildings. In Proceedings of the 4th ACM International Conference on Systems for Energy-Efficient Built Environments, 0–9. https://doi.org/10.1145/3137133.3137156",
      "doi": "10.1145/3137133.3137156"
    },
    {
      "text": "Elizabeth Shove (2014) Putting practice into policy: reconfiguring questions of consumption and climate change, Contemporary Social Science, 9:4, 415-429, DOI: 10.1080/21582041.2012.692484",
      "doi": ""
    },
    {
      "text": "Stephen Snow, Anna Soska, Shre Kumar Chatterjee, and m.c. schraefel. 2016. Keep Calm and Carry On: Exploring the Social Determinants of Indoor Environment Quality. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). Association for Computing Machinery, New York, NY, USA, 1476–1482. DOI: https://doi.org/10.1145/2851581.2892490",
      "doi": "10.1145/2851581.2892490"
    },
    {
      "text": "Vered Stearns, Lynda Ullmer, Juan F Lopez, Yolanda Smith, Claudine Isaacs, Daniel F Hayes, 2002. Hot flushes, The Lancet, Volume 360, Issue 9348, Pages 1851-1861, https://doi.org/10.1016/S0140-6736(02)11774-0",
      "doi": ""
    },
    {
      "text": "Bill Tomlinson. 2020. Suffering-centered design. In Conference on Human Factors in Computing Systems - Proceedings, 1–19. https://doi.org/10.1145/3334480.3381812",
      "doi": "10.1145/3334480.3381812"
    },
    {
      "text": "Loren Toussaint and Jon Webb. 2005. Gender Differences in the Relationship Between Empathy and Forgiveness. J. Soc. Psychol. 145, (December 2005), 673–685. https://doi.org/10.3200/SOCP.145.6.673-686",
      "doi": ""
    },
    {
      "text": "Agatha Tutia, Kelda Baljon, Lan Vu, and Daniela K. Rosner. 2019. HCI and Menopause: Designing With and Around the Aging Body. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). Association for Computing Machinery, New York, NY, USA, Paper CS23, 1–8. DOI: https://doi.org/10.1145/3290607.3299066",
      "doi": "10.1145/3290607.3299066"
    },
    {
      "text": "Michal Veselý, Wim Zeiler, 2014, Personalized conditioning and its impact on thermal comfort and energy performance – A review, Renewable and Sustainable Energy Reviews, Volume 34,Pages 401-408, https://doi.org/10.1016/j.rser.2014.03.024",
      "doi": ""
    },
    {
      "text": "Peter Wright and John McCarthy 2008. Empathy and experience in HCI. Conf. Hum. Factors Comput. Syst. - Proc. (2008), 637–646. https://doi.org/10.1145/1357054.1357156",
      "doi": "10.1145/1357054.1357156"
    }
  ]
}