{
  "doi": "10.1145/3411764.3445549",
  "title": "JetController: High-speed Ungrounded 3-DoF Force Feedback Controllers using Air Propulsion Jets",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "JetController is a novel haptic technology capable of supporting high-speed and persistent 3-DoF ungrounded force feedback. It uses high-speed pneumatic solenoid valves to modulate compressed air to achieve 20-50Hz of full impulses at 4.0-1.0N, and combines multiple air propulsion jets to generate 3-DoF force feedback. Compared to propeller-based approaches, JetController supports 10-30 times faster impulse frequency, and its handheld device is significantly lighter and more compact. JetController supports a wide range of haptic events in games and VR experiences, from firing automatic weapons in games like Halo (15Hz) to slicing fruits in Fruit Ninja (up to 45Hz). To evaluate JetController, we integrated our prototype with two popular VR games, Half-life: Alyx and Beat Saber, to support a variety of 3D interactions. Study results showed that JetController significantly improved realism, enjoyment, and overall experience compared to commercial vibrating controllers, and was preferred by most participants.",
  "authors": [
    {
      "name": "Yu-Wei Wang",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-99659702103/rel-imgonly/all_photo_108_____-1_33-____e34046171_e34046171-1.jpg",
      "acmid": "99659702103",
      "orcid": "missing"
    },
    {
      "name": "Yu-Hsin Lin",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-99659680927/rel-imgonly/ethanlin__3_.jpg",
      "acmid": "99659680927",
      "orcid": "0000-0003-4384-7191"
    },
    {
      "name": "Pin-Sung Ku",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161133",
      "orcid": "missing"
    },
    {
      "name": "Yōko Miyatake",
      "institution": "Ochanomizu University, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701459",
      "orcid": "missing"
    },
    {
      "name": "Yi-Hsuan Mao",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659572168",
      "orcid": "missing"
    },
    {
      "name": "Po Yu Chen",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700451",
      "orcid": "missing"
    },
    {
      "name": "Chun-Miao Tseng",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529077",
      "orcid": "missing"
    },
    {
      "name": "Mike Y. Chen",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-81460645188/rel-imgonly/mikebiophotosmall.jpg",
      "acmid": "81460645188",
      "orcid": "0000-0001-5410-652X"
    }
  ],
  "references": [
    {
      "text": "Tomohiro Amemiya, Hideyuki Ando, and Taro Maeda. 2008. Lead-Me Interface for a Pulling Sensation from Hand-Held Devices. ACM Trans. Appl. Percept. 5, 3, Article 15 (sep 2008), 17 pages. https://doi.org/10.1145/1402236.1402239",
      "doi": "10.1145/1402236.1402239"
    },
    {
      "text": "M. Bouzit, G. Burdea, G. Popescu, and R. Boian. 2002. The Rutgers Master II-new design force-feedback glove. IEEE/ASME Transactions on Mechatronics 7, 2 (June 2002), 256–263. https://doi.org/10.1109/TMECH.2002.1011262",
      "doi": ""
    },
    {
      "text": "Inrak Choi and Sean Follmer. 2016. Wolverine: A Wearable Haptic Interface for Grasping in VR. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16 Adjunct). Association for Computing Machinery, New York, NY, USA, 117–119. https://doi.org/10.1145/2984751.2985725",
      "doi": "10.1145/2984751.2985725"
    },
    {
      "text": "Inrak Choi, Eyal Ofek, Hrvoje Benko, Mike Sinclair, and Christian Holz. 2018. CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 654, 13 pages. https://doi.org/10.1145/3173574.3174228",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "T. Endo, H. Kawasaki, T. Mouri, Y. Ishigure, H. Shimomura, M. Matsumura, and K. Koketsu. 2011. Five-Fingered Haptic Interface Robot: HIRO III. IEEE Transactions on Haptics 4, 1 (2011), 14–27.",
      "doi": "10.1109/TOH.2010.62"
    },
    {
      "text": "Domenico Formica, Steven K. Charles, Loredana Zollo, Eugenio Guglielmelli, Neville Hogan, and Hermano I. Krebs. 2012. The passive stiffness of the wrist and forearm. Journal of Neurophysiology 108, 4 (2012), 1158–1166. https://doi.org/10.1152/jn.01014.2011PMID: 22649208.",
      "doi": ""
    },
    {
      "text": "Jun Gong, Da-Yuan Huang, Teddy Seyed, Te Lin, Tao Hou, Xin Liu, Molin Yang, Boyu Yang, Yuhan Zhang, and Xing-Dong Yang. 2018. Jetto: Using Lateral Force Feedback for Smartwatch Interactions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 426, 14 pages. https://doi.org/10.1145/3173574.3174000",
      "doi": "10.1145/3173574.3174000"
    },
    {
      "text": "Hakan Gurocak, Sankar Jayaram, Benjamin Parrish, and Uma Jayaram. 2003. Weight Sensation in Virtual Environments Using a Haptic Device With Air Jets. J. Comput. Inf. Sci. Eng. 3 (06 2003), 130–135. https://doi.org/10.1115/1.1576808",
      "doi": ""
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor’s Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174099",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "Seungwoo Je, Myung Jin Kim, Woojin Lee, Byungjoo Lee, Xing-Dong Yang, Pedro Lopes, and Andrea Bianchi. 2019. Aero-Plane: A Handheld Force-Feedback Device That Renders Weight Motion Illusion on a Virtual 2D Plane. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 763–775. https://doi.org/10.1145/3332165.3347926",
      "doi": "10.1145/3332165.3347926"
    },
    {
      "text": "Seungwoo Je, Hyelip Lee, Myung Jin Kim, and Andrea Bianchi. 2018. Wind-Blaster: A Wearable Propeller-Based Prototype That Provides Ungrounded Force-Feedback. In ACM SIGGRAPH 2018 Emerging Technologies (Vancouver, British Columbia, Canada) (SIGGRAPH ’18). Association for Computing Machinery, New York, NY, USA, Article 23, 2 pages. https://doi.org/10.1145/3214907.3214915",
      "doi": "10.1145/3214907.3214915"
    },
    {
      "text": "Shi-Hong Liu, Pai-Chien Yen, Yi-Hsuan Mao, Yu-Hsin Lin, Erick Chandra, and Mike Y. Chen. 2020. HeadBlaster: A Wearable Approach to Simulating Motion Perception Using Head-Mounted Air Propulsion Jets. ACM Trans. Graph. 39, 4, Article 84 (jul 2020), 12 pages. https://doi.org/10.1145/3386569.3392482",
      "doi": "10.1145/3386569.3392482"
    },
    {
      "text": "Thomas H. Massie and J. K. Salisbury. 1994. The PHANToM haptic interface: A device for probing virtual objects. In Proceedings of the ASME Dynamic Systems and Control Division. American Society of Mechanical Engineers Staf, New York, NY, USA, 295–301.",
      "doi": ""
    },
    {
      "text": "MathWorks. 1994. Rise time, settling time, and other step-response characteristics. https://www.mathworks.com/help/control/ref/stepinfo.html",
      "doi": ""
    },
    {
      "text": "MetaCritic. 2020. Best All-time PC Video Games - Metacritic. https://www.metacritic.com/browse/games/score/metascore/all/pc/filtered?sort=desc",
      "doi": ""
    },
    {
      "text": "Kazuki Nagai, Soma Tanoue, Katsuhito Akahane, and Makoto Sato. 2015. Wearable 6-DoF Wrist Haptic Device “SPIDAR-W”. In SIGGRAPH Asia 2015 Haptic Media And Contents Design (Kobe, Japan) (SA ’15). Association for Computing Machinery, New York, NY, USA, Article 19, 2 pages. https://doi.org/10.1145/2818384.2818403",
      "doi": ""
    },
    {
      "text": "Novint. 2006. Novint Falcon Haptic Device. https://hapticshouse.com/collections/falcons",
      "doi": ""
    },
    {
      "text": "The Editors of Wikipedia. 2006. Rumble Pak. https://en.wikipedia.org/wiki/Rumble_Pak",
      "doi": ""
    },
    {
      "text": "The Editors of Wikipedia. 2009. Takahashi Meijin. https://en.wikipedia.org/wiki/Takahashi_Meijin",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto. 2014. Traxion: A Tactile Interaction Device with Virtual Force Sensation. In ACM SIGGRAPH 2014 Emerging Technologies (Vancouver, Canada) (SIGGRAPH ’14). Association for Computing Machinery, New York, NY, USA, Article 25, 1 pages. https://doi.org/10.1145/2614066.2614079",
      "doi": "10.1145/2614066.2614079"
    },
    {
      "text": "J. M. Romano and K. J. Kuchenbecker. 2009. The AirWand: Design and characterization of a large-workspace haptic device. In 2009 IEEE International Conference on Robotics and Automation. Institute of Electrical and Electronics Engineers, USA, 1461–1466.",
      "doi": ""
    },
    {
      "text": "Tomoya Sasaki, Richard Sahala Hartanto, Kao-Hua Liu, Keitarou Tsuchiya, Atsushi Hiyama, and Masahiko Inami. 2018. Leviopole: Mid-Air Haptic Interactions Using Multirotor. In ACM SIGGRAPH 2018 Emerging Technologies (Vancouver, British Columbia, Canada) (SIGGRAPH ’18). Association for Computing Machinery, New York, NY, USA, Article 12, 2 pages. https://doi.org/10.1145/3214907.3214913",
      "doi": "10.1145/3214907.3214913"
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. Transcalibur: A Weight Shifting Virtual Reality Controller for 2D Shape Rendering Based on Computational Perception Model. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300241",
      "doi": "10.1145/3290605.3300241"
    },
    {
      "text": "Silvent. 2003. AIR NOZZLE SILVENT 1001. https://www.silvent.com/products/air-nozzles/1001/",
      "doi": ""
    },
    {
      "text": "Timothy M. Simon, Ross T. Smith, and Bruce H. Thomas. 2014. Wearable Jamming Mitten for Virtual Environment Haptics. In Proceedings of the 2014 ACM International Symposium on Wearable Computers (Seattle, Washington) (ISWC ’14). Association for Computing Machinery, New York, NY, USA, 67–70. https://doi.org/10.1145/2634317.2634342",
      "doi": "10.1145/2634317.2634342"
    },
    {
      "text": "Yuqian Sun, Shigeo Yoshida, Takuji Narumi, and Michitaka Hirose. 2019. PaCaPa: A Handheld VR Device for Rendering Size, Shape, and Stiffness of Virtual Objects in Tool-Based Interactions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300682",
      "doi": "10.1145/3290605.3300682"
    },
    {
      "text": "Hsin-Ruey Tsai and Bing-Yu Chen. 2019. ElastImpact: 2.5D Multilevel Instant Impact Using Elasticity on Head-Mounted Displays. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 429–437. https://doi.org/10.1145/3332165.3347931",
      "doi": "10.1145/3332165.3347931"
    },
    {
      "text": "Hsin-Ruey Tsai, Jun Rekimoto, and Bing-Yu Chen. 2019. ElasticVR: Providing Multilevel Continuously-Changing Resistive Force and Instant Impact Using Elasticity for VR. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 220, 10 pages. https://doi.org/10.1145/3290605.3300450",
      "doi": "10.1145/3290605.3300450"
    },
    {
      "text": "Valve. 2019. Best of 2019 - Top Sellers. https://store.steampowered.com/sale/2019_top_sellers/",
      "doi": ""
    },
    {
      "text": "Striker VR. 2017. Striker VR. https://www.strikervr.com",
      "doi": ""
    },
    {
      "text": "K. N. Winfree, J. Gewirtz, T. Mather, J. Fiene, and K. J. Kuchenbecker. 2009. A high fidelity ungrounded torque feedback device: The iTorqU 2.0. In World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE Computer Society, NW Washington, DCUnited States, 261–266.",
      "doi": ""
    },
    {
      "text": "Hiroaki Yano, Masayuki Yoshie, and Hiroo Iwata. 2003. Development of a Non-Grounded Haptic Interface Using the Gyro Effect. In Proceedings of the 11th Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems (HAPTICS’03)(HAPTICS ’03). IEEE Computer Society, USA, 32.",
      "doi": "10.5555/795683.797589"
    },
    {
      "text": "A. Zenner and A. Krüger. 2017. Shifty: A Weight-Shifting Dynamic Passive Haptic Proxy to Enhance Object Perception in Virtual Reality. IEEE Transactions on Visualization and Computer Graphics 23, 4 (April 2017), 1285–1294. https://doi.org/10.1109/TVCG.2017.2656978",
      "doi": "10.1109/TVCG.2017.2656978"
    }
  ]
}