{
  "doi": "10.1145/3411764.3445666",
  "title": "Developable Metamaterials: Mass-fabricable Metamaterials by Laser-Cutting Elastic Structures",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "We propose a novel design of engineered, structured materials that leverages fast fabrication technologies, pushing them towards mass-fabrication. Specifically, our metamaterial is designed to be laser cut, to approximate the volumetric shape and allow for locally varying compliance. Traditional mechanical metamaterials consist of intricate cells arranged on a 3-dimensional grid, limiting them to 3D printing—which is slow. Our metamaterial is designed for laser cutting, which is drastically faster. Our structures are best described as ruffled strips of thin sheet material, such as paper, plastics, metals, etc. Users can interactively define the ruffles’ anisotropic stiffness directions and local density. Our computational design tool assists users by automatically optimizing the ruffle to fill the shape’s volume, and exporting the flat ruffle design ready for cutting. We demonstrate how such ruffled metamaterials can be utilized for, e.g., custom toys with locally varying compliance, custom packaging material, or lightweight formwork for architectural shells.",
  "authors": [
    {
      "name": "Madlaina Signer",
      "institution": "ETH Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701348",
      "orcid": "missing"
    },
    {
      "name": "Alexandra Ion",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, Pittsburgh, USA and Department of Computer Science, ETH Zurich, Switzerland",
      "img": "/do/10.1145/contrib-99658655048/rel-imgonly/portrait_square_20103.jpg",
      "acmid": "99658655048",
      "orcid": "missing"
    },
    {
      "name": "Olga Sorkine-Hornung",
      "institution": "ETH Zurich, Switzerland",
      "img": "/do/10.1145/contrib-82258908657/rel-imgonly/eth_2020_216_ps_crop_ft_web.jpeg",
      "acmid": "82258908657",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Patrick Baudisch, Arthur Silber, Yannis Kommana, Milan Gruner, Ludwig Wall, Kevin Reuss, Lukas Heilman, Robert Kovacs, Daniel Rechlitz, and Thijs Roumen. 2019. Kyub: A 3D Editor for Modeling Sturdy Laser-Cut Objects. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300796",
      "doi": "10.1145/3290605.3300796"
    },
    {
      "text": "Katia Bertoldi, Vincenzo Vitelli, Johan Christensen, and Martin van Hecke. 2017. Flexible mechanical metamaterials. Nature Reviews Materials 2, 11 (oct 2017), 17066. https://doi.org/10.1038/natrevmats.2017.66",
      "doi": ""
    },
    {
      "text": "Dustin Beyer, Serafima Gurevich, Stefanie Mueller, Hsiang-Ting Chen, and Patrick Baudisch. 2015. Platener: Low-Fidelity Fabrication of 3D Objects by Substituting 3D Print with Laser-Cut Plates. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1799–1806. https://doi.org/10.1145/2702123.2702225",
      "doi": "10.1145/2702123.2702225"
    },
    {
      "text": "Bernd Bickel, Moritz Bächer, Miguel A. Otaduy, Hyunho Richard Lee, Hanspeter Pfister, Markus Gross, and Wojciech Matusik. 2010. Design and Fabrication of Materials with Desired Deformation Behavior. In ACM SIGGRAPH 2010 Papers (Los Angeles, California) (SIGGRAPH ’10). Association for Computing Machinery, New York, NY, USA, Article 63, 10 pages. https://doi.org/10.1145/1833349.1778800",
      "doi": ""
    },
    {
      "text": "Tiemo Bückmann, Michael Thiel, Muamer Kadic, Robert Schittny, and Martin Wegener. 2014. An elasto-mechanical unfeelability cloak made of pentamode metamaterials. Nature Communications 5, May (2014), 1–6. https://doi.org/10.1038/ncomms5130",
      "doi": ""
    },
    {
      "text": "Richard H Byrd, Peihuang Lu, Jorge Nocedal, and Ciyou Zhu. 1995. A limited memory algorithm for bound constrained optimization. SIAM Journal on scientific computing 16, 5 (1995), 1190–1208.",
      "doi": ""
    },
    {
      "text": "Xiang ’Anthony’ Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2016. Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 29–39. https://doi.org/10.1145/2984511.2984512",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Xiang ’Anthony’ Chen, Ye Tao, Guanyun Wang, Runchang Kang, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2018. Forte: User-Driven Generative Design. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174070",
      "doi": "10.1145/3173574.3174070"
    },
    {
      "text": "Philippe Destuynder. 1985. A classification of thin shell theories. Acta Applicandae Mathematica 4, 1 (1985), 15–63.",
      "doi": ""
    },
    {
      "text": "Tobias Frenzel, Claudio Findeisen, Muamer Kadic, Peter Gumbsch, and Martin Wegener. 2016. Tailored Buckling Microlattices as Reusable Light-Weight Shock Absorbers. Advanced Materials 28, 28 (jul 2016), 5865–5870. https://doi.org/10.1002/adma.201600610",
      "doi": ""
    },
    {
      "text": "Eitan Grinspun, Anil N. Hirani, Mathieu Desbrun, and Peter Schröder. 2003. Discrete Shells. In Proceedings of the 2003 ACM SIGGRAPH/Eurographics Symposium on Computer Animation (San Diego, California) (SCA ’03). Eurographics Association, 62–67.",
      "doi": ""
    },
    {
      "text": "Daniel Groeger and Jürgen Steimle. 2019. LASEC: Instant Fabrication of Stretchable Circuits Using a Laser Cutter. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300929",
      "doi": "10.1145/3290605.3300929"
    },
    {
      "text": "Jianzhe Gu, David E. Breen, Jenny Hu, Lifeng Zhu, Ye Tao, Tyson Van de Zande, Guanyun Wang, Yongjie Jessica Zhang, and Lining Yao. 2019. Geodesy: Self-Rising 2.5D Tiles by Printing along 2D Geodesic Closed Path. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3290605.3300267",
      "doi": "10.1145/3290605.3300267"
    },
    {
      "text": "Gaël Guennebaud, Benoît Jacob, 2010. Eigen v3. http://eigen.tuxfamily.org.",
      "doi": ""
    },
    {
      "text": "Ruslan Guseinov, Eder Miguel, and Bernd Bickel. 2017. CurveUps: Shaping Objects from Flat Plates with Tension-Actuated Curvature. ACM Trans. Graph. 36, 4, Article 64 (July 2017), 12 pages. https://doi.org/10.1145/3072959.3073709",
      "doi": "10.1145/3072959.3073709"
    },
    {
      "text": "Felix Heibeck, Basheer Tome, Clark Della Silva, and Hiroshi Ishii. 2015. UniMorph: Fabricating Thin Film Composites for Shape-Changing Interfaces. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology(Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 233–242. https://doi.org/10.1145/2807442.2807472",
      "doi": "10.1145/2807442.2807472"
    },
    {
      "text": "Kristian Hildebrand, Bernd Bickel, and Marc Alexa. 2012. Crdbrd: Shape Fabrication by Sliding Planar Slices. Comput. Graph. Forum 31, 2pt3 (May 2012), 583–592. https://doi.org/10.1111/j.1467-8659.2012.03037.x",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial Mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 529–539. https://doi.org/10.1145/2984511.2984540",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Alexandra Ion, Robert Kovacs, Oliver S. Schneider, Pedro Lopes, and Patrick Baudisch. 2018. Metamaterial Textures. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173910",
      "doi": "10.1145/3173574.3173910"
    },
    {
      "text": "Alexandra Ion, David Lindlbauer, Philipp Herholz, Marc Alexa, and Patrick Baudisch. 2019. Understanding Metamaterial Mechanisms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300877",
      "doi": "10.1145/3290605.3300877"
    },
    {
      "text": "Alec Jacobson, Daniele Panozzo, 2018. libigl: A simple C++ geometry processing library. https://libigl.github.io/.",
      "doi": ""
    },
    {
      "text": "Mina Konaković, Keenan Crane, Bailin Deng, Sofien Bouaziz, Daniel Piker, and Mark Pauly. 2016. Beyond Developable: Computational Design and Fabrication with Auxetic Materials. ACM Transactions on Graphics 35, 4 (jul 2016), 1–11. https://doi.org/10.1145/2897824.2925944",
      "doi": "10.1145/2897824.2925944"
    },
    {
      "text": "Robert Kovacs, Anna Seufert, Ludwig Wall, Hsiang-Ting Chen, Florian Meinel, Willi Müller, Sijing You, Maximilian Brehm, Jonathan Striebel, Yannis Kommana, Alexander Popiak, Thomas Bläsius, and Patrick Baudisch. 2017. TrussFab: Fabricating Sturdy Large-Scale Structures on Desktop 3D Printers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2606–2616. https://doi.org/10.1145/3025453.3026016",
      "doi": "10.1145/3025453.3026016"
    },
    {
      "text": "Snežana Lawrence. 2011. Developable Surfaces: Their History and Application. Nexus Network Journal 13, 3 (2011), 701–714. https://doi.org/10.1007/s00004-011-0087-z",
      "doi": ""
    },
    {
      "text": "Danny Leen, Nadya Peek, and Raf Ramakers. 2020. LamiFold: Fabricating Objects with Integrated Mechanisms Using a Laser Cutter Lamination Workflow. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 304–316. https://doi.org/10.1145/3379337.3415885",
      "doi": "10.1145/3379337.3415885"
    },
    {
      "text": "Lin Lu, Andrei Sharf, Haisen Zhao, Yuan Wei, Qingnan Fan, Xuelin Chen, Yann Savoye, Changhe Tu, Daniel Cohen-Or, and Baoquan Chen. 2014. Build-to-Last: Strength to Weight 3D Printed Objects. ACM Trans. Graph. 33, 4, Article 97 (July 2014), 10 pages. https://doi.org/10.1145/2601097.2601168",
      "doi": "10.1145/2601097.2601168"
    },
    {
      "text": "Jonàs Martínez, Mélina Skouras, Christian Schumacher, Samuel Hornus, Sylvain Lefebvre, and Bernhard Thomaszewski. 2019. Star-Shaped Metrics for Mechanical Metamaterial Design. ACM Trans. Graph. 38, 4, Article 82 (July 2019), 13 pages. https://doi.org/10.1145/3306346.3322989",
      "doi": "10.1145/3306346.3322989"
    },
    {
      "text": "Jonàs Martínez, Haichuan Song, Jérémie Dumas, and Sylvain Lefebvre. 2017. Orthotropic ",
      "doi": "10.1145/3072959.3073638"
    },
    {
      "text": "Jonàs Martínez, Haichuan Song, Jérémie Dumas, and Sylvain Lefebvre. 2017. Orthotropic ",
      "doi": "10.1145/3072959.3073638"
    },
    {
      "text": "James McCrae, Nobuyuki Umetani, and Karan Singh. 2014. FlatFitFab: Interactive Modeling with Planar Sections. In Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST ’14. ACM Press, New York, New York, USA, 13–22. https://doi.org/10.1145/2642918.2647388",
      "doi": "10.1145/2642918.2647388"
    },
    {
      "text": "Jun Mitani and Hiromasa Suzuki. 2004. Making papercraft toys from meshes using strip-based approximate unfolding. 23, 3 (2004), 259–263.",
      "doi": ""
    },
    {
      "text": "Koryo Miura. 1985. Method of packaging and deployment of large membranes in space. Technical Report. 1–9 pages. https://repository.exst.jaxa.jp/dspace/handle/a-is/7293",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Bastian Kruck, and Patrick Baudisch. 2013. LaserOrigami: Laser-Cutting 3D Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 2585–2592. https://doi.org/10.1145/2470654.2481358",
      "doi": "10.1145/2470654.2481358"
    },
    {
      "text": "Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive Construction: Interactive Fabrication of Functional Mechanical Devices. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology(Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 599–606. https://doi.org/10.1145/2380116.2380191",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Matthias Müller, Nuttapong Chentanez, Tae-Yong Kim, and Miles Macklin. 2015. Air meshes for robust collision handling. ACM Transactions on Graphics (TOG) 34, 4 (2015), 1–9.",
      "doi": "10.1145/2766907"
    },
    {
      "text": "Jifei Ou, Zhao Ma, Jannik Peters, Sen Dai, Nikolaos Vlavianos, and Hiroshi Ishii. 2018. KinetiX - designing auxetic-inspired deformable material structures. Computers & Graphics 75(2018), 72 – 81. https://doi.org/10.1016/j.cag.2018.06.003",
      "doi": "10.1016/j.cag.2018.06.003"
    },
    {
      "text": "Julian Panetta, Qingnan Zhou, Luigi Malomo, Nico Pietroni, Paolo Cignoni, and Denis Zorin. 2015. Elastic Textures for Additive Fabrication. ACM Trans. Graph. 34, 4, Article 135 (July 2015), 12 pages. https://doi.org/10.1145/2766937",
      "doi": "10.1145/2766937"
    },
    {
      "text": "Ahmad Rafsanjani and Katia Bertoldi. 2017. Buckling-Induced Kirigami. Physical Review Letters 118, 8 (2017), 1–5. https://doi.org/10.1103/PhysRevLett.118.084301 arxiv:1702.06470",
      "doi": ""
    },
    {
      "text": "Ahmad Rafsanjani and Damiano Pasini. 2016. Bistable auxetic mechanical metamaterials inspired by ancient geometric motifs. Extreme Mechanics Letters 9 (2016), 291–296. https://doi.org/10.1016/j.eml.2016.09.001 arxiv:1612.05988",
      "doi": ""
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. RetroFab: A Design Tool for Retrofitting Physical Interfaces Using Actuators, Sensors and 3D Printing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 409–419. https://doi.org/10.1145/2858036.2858485",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Thijs Roumen, Jotaro Shigeyama, Julius Cosmo Romeo Rudolph, Felix Grzelka, and Patrick Baudisch. 2019. SpringFit: Joints and Mounts That Fabricate on Any Laser Cutter. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 727–738. https://doi.org/10.1145/3332165.3347930",
      "doi": "10.1145/3332165.3347930"
    },
    {
      "text": "Krishna Kumar Saxena, Raj Das, and Emilio P. Calius. 2016. Three Decades of Auxetics Research – Materials with Negative Poisson’s Ratio: A Review. Advanced Engineering Materials 18, 11 (nov 2016), 1847–1870. https://doi.org/10.1002/adem.201600053",
      "doi": ""
    },
    {
      "text": "Tobias A Schaedler, Alan J Jacobsen, Anna Torrents, Adam E Sorensen, Jie Lian, Julia R Greer, Lorenzo Valdevit, and Wiliam B Carter. 2011. Ultralight metallic microlattices. Science 334, 6058 (2011), 962–965.",
      "doi": ""
    },
    {
      "text": "Oliver Schneider, Karon MacLean, Colin Swindells, and Kellogg Booth. 2017. Haptic experience design: What hapticians do and where they need help. International Journal of Human-Computer Studies 107 (2017), 5–21. https://doi.org/10.1016/j.ijhcs.2017.04.004 Multisensory Human-Computer Interaction.",
      "doi": "10.1016/j.ijhcs.2017.04.004"
    },
    {
      "text": "Christian Schüller, Roi Poranne, and Olga Sorkine-Hornung. 2018. Shape Representation by Zippables. ACM Trans. Graph. 37, 4, Article 78 (July 2018), 13 pages. https://doi.org/10.1145/3197517.3201347",
      "doi": "10.1145/3197517.3201347"
    },
    {
      "text": "Christian Schumacher, Bernd Bickel, Jan Rys, Steve Marschner, Chiara Daraio, and Markus Gross. 2015. Microstructures to Control Elasticity in 3D Printing. ACM Trans. Graph. 34, 4, Article 136 (July 2015), 13 pages. https://doi.org/10.1145/2766926",
      "doi": "10.1145/2766926"
    },
    {
      "text": "Christian Schumacher, Steve Marschner, Markus Gross, and Bernhard Thomaszewski. 2018. Mechanical Characterization of Structured Sheet Materials. ACM Trans. Graph. 37, 4, Article 148 (July 2018), 15 pages. https://doi.org/10.1145/3197517.3201278",
      "doi": "10.1145/3197517.3201278"
    },
    {
      "text": "Sicong Shan, Sung H. Kang, Jordan R. Raney, Pai Wang, Lichen Fang, Francisco Candido, Jennifer A. Lewis, and Katia Bertoldi. 2015. Multistable Architected Materials for Trapping Elastic Strain Energy. Advanced Materials 27, 29 (2015), 4296–4301. https://doi.org/10.1002/adma.201501708 arxiv:1207.1956",
      "doi": ""
    },
    {
      "text": "Oded Stein, Eitan Grinspun, and Keenan Crane. 2018. Developability of triangle meshes. 37, 4 (2018).",
      "doi": ""
    },
    {
      "text": "Demetri Terzopoulos, John Platt, Alan Barr, and Kurt Fleischer. 1987. Elastically deformable models. In Proc. SIGGRAPH 1987. 205–214.",
      "doi": "10.1145/37401.37427"
    },
    {
      "text": "Skylar Tibbits. 2012. From Digital Materials to Self-Assembly. Assembly Automation 32(2012), 216–225. http://www.nature.com/doifinder/10.1038/srep07422",
      "doi": ""
    },
    {
      "text": "Udayan Umapathi, Hsiang-Ting Chen, Stefanie Mueller, Ludwig Wall, Anna Seufert, and Patrick Baudisch. 2015. LaserStacker: Fabricating 3D Objects by Laser Cutting and Welding. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 575–582. https://doi.org/10.1145/2807442.2807512",
      "doi": "10.1145/2807442.2807512"
    },
    {
      "text": "Charlie CL Wang and Kai Tang. 2004. Achieving developability of a polygonal surface by minimum deformation: a study of global and local optimization approaches. The Visual Computer 20, 8-9 (2004), 521–539.",
      "doi": ""
    },
    {
      "text": "Guanyun Wang, Humphrey Yang, Zeyu Yan, Nurcan Gecer Ulu, Ye Tao, Jianzhe Gu, Levent Burak Kara, and Lining Yao. 2018. 4DMesh: 4D Printing Morphing Non-Developable Mesh Surfaces. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 623–635. https://doi.org/10.1145/3242587.3242625",
      "doi": "10.1145/3242587.3242625"
    },
    {
      "text": "Junichi Yamaoka, Mustafa Doga Dogan, Katarina Bulovic, Kazuya Saito, Yoshihiro Kawahara, Yasuaki Kakehi, and Stefanie Mueller. 2019. FoldTronics: Creating 3D Objects with Integrated Electronics Using Foldable Honeycomb Structures. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300858",
      "doi": "10.1145/3290605.3300858"
    },
    {
      "text": "Mariette Yvinec. 2020. 2D Triangulation. In CGAL User and Reference Manual(5.1 ed.). CGAL Editorial Board. https://doc.cgal.org/5.1/Manual/packages.html#PkgTriangulation2",
      "doi": ""
    }
  ]
}