{
  "doi": "10.1145/3411764.3445121",
  "title": "Bedtime Window: A Field Study Connecting Bedrooms of Long-Distance Couples Using a Slow Photo-Stream and Shared Real-Time Inking",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "We present a system for connecting partners in long-distance relationships in bedrooms and at bedtime, a space and time that most couples share. Unlike communications explicitly initiated by users, our system is always-on, staying in the background and enabling remote presence without constant use. We present findings from a field study in which the system was deployed into participants’ bedrooms. The system includes an automated photo-stream (rather than video), which was found to provide a balance between the feeling of presence and privacy, and to remove the pressure to communicate. The system also includes a real-time shared inking canvas with disappearing ink, which was found to provide a rich versatile medium allowing for new patterns of communication, live interventions, and collaborative drawing. Learnings from how our system balances privacy and remote connectedness may also have relevance for other domains such as remote healthcare and education.",
  "authors": [
    {
      "name": "Jan Kučera",
      "institution": "Open Lab Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658637023",
      "orcid": "0000-0003-4916-114X"
    },
    {
      "name": "James Scott",
      "institution": "Microsoft, United Kingdom",
      "img": "/do/10.1145/contrib-81407592275/rel-imgonly/jws-new-sm.jpg",
      "acmid": "81407592275",
      "orcid": "missing"
    },
    {
      "name": "Siân Lindley",
      "institution": "Microsoft Research, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100028041",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Action Lab Monash University, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "WBA Research, “2013 International Bedroom Poll,” National Sleep Foundation, Washington, 2013.",
      "doi": ""
    },
    {
      "text": "C. Neustaedter and S. Greenberg, “Intimacy in Long-Distance Relationships over Video Chat,” in CHI'12, Austin, 2012.",
      "doi": "10.1145/2207676.2207785"
    },
    {
      "text": "Statistic Brain, “Long Distance Relationship Statistics – Statistic Brain,” Statistic Brain Research Institute, 14 September 2017. [Online]. Available: https://www.statisticbrain.com/long-distance-relationship-statistics/. [Accessed 19 August 2018].",
      "doi": ""
    },
    {
      "text": "W.-C. Chien and M. Hassenzahl, “Technology-Mediated Relationship Maintenance in Romantic Long-Distance Relationships: An Autoethnographical Research through Design,” Humann-Computer Interaction, vol. 00, pp. 1-48, 2017.",
      "doi": ""
    },
    {
      "text": "M. Hassenzahl, S. Heidecker, K. Eckoldt, S. Diefenbach and U. Hillmann, “All You Need is Love: Current Strategies of Mediating Intimate Relationships through Technology,” ACM Transactions on Computer-Human Interaction, vol. 19, no. 4, pp. 30:1-19, 2012.",
      "doi": "10.1145/2395131.2395137"
    },
    {
      "text": "A. J. Merolla, “Relational Maintenance and Noncopresence Reconsidered: Conceptualizing Geopgrahic Separation in Close Relationships,” Communication Theory, vol. 20, no. 2, pp. 169-193, 2010.",
      "doi": ""
    },
    {
      "text": "M. C. Pistole and A. Roberts, “Measuring Long-Distance Romantic Relationships: A Validity Study,” Measurement and Evaluation in Counselling and Development, vol. 44, no. 2, pp. 63-76, 2011.",
      "doi": ""
    },
    {
      "text": "D. J. Canary and L. Stafford, “Maintaining Relationships through Strategic and Routine Interaction,” in Communication and Relational Maintenance, San Diego, Academic Press, Inc, 1994, pp. 3-22.",
      "doi": ""
    },
    {
      "text": "F. '. Mueller, F. Vetere, M. R. Gibbs, J. Kjeldskov, S. Pedell and S. Howard, “Hug Over a Distance,” in Extended abstracts of CHI 05, Portland, 2005.",
      "doi": "10.1145/1056808.1056994"
    },
    {
      "text": "F. Gemperle, C. DiSalvo, J. Forlizzi and W. Yonkers, “The Hug: a New Form for Communication,” in Proceedings of the 2003 conference on Designing for user experiences, San Francisco, 2003.",
      "doi": "10.1145/997078.997103"
    },
    {
      "text": "D. Kontaris, D. Harrison, E. -. E. Patsoule, S. Zhuang and A. Slade, “Feelybean: Communication Touch Over Distance,” in CHI '12 Extended Abstracts on Human Factors in Computing Systems, Austin, 2012.",
      "doi": "10.1145/2212776.2212439"
    },
    {
      "text": "S. Singhal, C. Neustaedter, A. N. Antle and B. Matkin, “Flex-N-Feel: Emotive Gloves for Physical Touch Over Distance,” in Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, Portland, 2017.",
      "doi": "10.1145/3022198.3023273"
    },
    {
      "text": "H. A. Samani, R. Parsani, L. T. Rodriguez, E. Saadatian, K. H. Dissanayake and A. D. Cheok, “Kissenger: Design of a Kiss Transmission Device,” in Proceedings of the Designing Interactive Systems Conference, Newcastle, 2012.",
      "doi": "10.1145/2317956.2317965"
    },
    {
      "text": "E. Saadatian, H. Samani, R. Parsani, A. V. Pandey, J. Li, L. Tejada, A. D. Cheok and R. Nakatsu, “Mediating intimacy in long-distance relationships using kiss messaging,” Int. J. Human-Computer Studies, vol. 72, no. 10-11, pp. 736-746, 2014.",
      "doi": "10.1016/j.ijhcs.2014.05.004"
    },
    {
      "text": "J. Werner, R. Wettach and E. Hornecker, “United-Pulse: Feeling Your Partner's Pulse,” in Proceedings of the 10th international conference on Human computer interaction with mobile devices and services, Amsterdam, 2008.",
      "doi": "10.1145/1409240.1409338"
    },
    {
      "text": "C.-H. J. Lee and H. Chung, “Lover's cups: connecting you and your love one,” in ACM SIGGRAPH 2006 Research posters, Boston, 2006.",
      "doi": "10.1145/1179622.1179781"
    },
    {
      "text": "R. Pan, S. Singhal, B. E. Riecke, E. Cramer and C. Neustaedter, “\"MyEyes\": The Design and Evaluation of First Person View Video Streaming for Long-Distance Couples,” in Proceedings of the 2017 Conference on Designing Interactive Systems , Edinburgh, 2017.",
      "doi": "10.1145/3064663.3064671"
    },
    {
      "text": "R. Kowalski, S. Loehmann and D. Hausen, “cubble: A Multi-Device Hybrid Approach Supporting Communication in Long-Distance Relationships,” in Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction , Barcelona, 2013.",
      "doi": "10.1145/2460625.2460656"
    },
    {
      "text": "Y. R. Joi, T. B. Jeong, J. H. Kim, K. H. Park, T. Lee and J. D. Cho, “WearLove: Affective Communication via Wearable Device with Gamification,” in Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play, London, 2015.",
      "doi": "10.1145/2793107.2810337"
    },
    {
      "text": "J. '. Kaye, “I Just Clicked To Say I Love You: Rich Evaluations of Minimal Communication,” in CHI '06 Extended Abstracts on Human Factors in Computing Systems , Montreal, 2006.",
      "doi": "10.1145/1125451.1125530"
    },
    {
      "text": "R. S. Pujol and H. Umemuro, “Productive Love Promotion via Affective Technology: An Approach Based on Social Psychology and Philosophy,” Human Technology: An Interdisciplinary Journal on Humans in ICT Environments, vol. 6, no. 2, pp. 191-211, 2010.",
      "doi": ""
    },
    {
      "text": "E. Myodo, J. Xu, K. Tasaka, H. Yanagishara and S. Sakazawa, “Issues and Solutions to Informal Communication in Working from Home Using a Telepresence Robot,” ITE Transactions on MEdia Technology and Applications, vol. 6, no. 1, pp. 30-45, 2018.",
      "doi": ""
    },
    {
      "text": "S. Harrison, Ed., Media Space 20+ Years of Mediated Life, London: Springer-Verlag, 2009.",
      "doi": "10.5555/1557625"
    },
    {
      "text": "C. Pang, A. Fogrhani, E. Oduor, C. Neustaedter, I. Walker and D. Robinson, “Reactions to Mixed-Context Always-On Video for Connecting Close Personal and Work Contacts,” Simon Fraser University, 2014.",
      "doi": ""
    },
    {
      "text": "J. S. Lee, S. Liang, S. Park and C. Yan, “Hi Grandpa!: A communication Tool Connecting Grandparents and Grandchildren Living Apart,” in Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, Copenhagen, 2015.",
      "doi": "10.1145/2786567.2793687"
    },
    {
      "text": "J. Lundell, M. Morris and S. Intille, “Home technologies to keep elders connected,” in CHI '04 Extended Abstracts on Human Factors in Computing Systems , Vienna, 2004.",
      "doi": "10.1145/985921.986199"
    },
    {
      "text": "I. Keller, W. v. d. Hoog and P. J. Stappers, “Gust of me: reconnecting mother and son,” IEEE Pervasive Computing, vol. 3, no. 1, pp. 22-27, 2004.",
      "doi": "10.1109/MPRV.2004.1269125"
    },
    {
      "text": "J. Farny, M. Jennex, R. Olsen and M. Rodriguez, “Anchor: connecting sailors to home,” in CHI '12 Extended Abstracts on Human Factors in Computing Systems , Austin, 2012.",
      "doi": "10.1145/2212776.2212438"
    },
    {
      "text": "S. P. Wyche and M. Chetty, “\"I want to imagine how that place looks\": designing technologies to support connectivity between africans living abroad and home,” in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems , Paris, 2013.",
      "doi": "10.1145/2470654.2481381"
    },
    {
      "text": "C. Neustaedter, S. Harrison and S. Abigail, Eds., Connecting Families, London: Springer-Verlag, 2013.",
      "doi": ""
    },
    {
      "text": "T. K. Judge, C. Neustaedter and A. F. Kurtz, “The Family Window: The Design and Evaluation of a Domestic Media Space,” in CHI 2010, Atlanta, 2010.",
      "doi": "10.1145/1753326.1753682"
    },
    {
      "text": "T. K. Judge, C. Neustaedter, S. Harrison and A. Blose, “Family portals: connecting families through a multifamily media space,” in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Vancouver, 2011.",
      "doi": "10.1145/1978942.1979122"
    },
    {
      "text": "E. Oduor and C. Neustaedter, “The family room: a multi-camera, multi-display family media space,” in Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative , Baltimore, 2014.",
      "doi": "10.1145/2556420.2557640"
    },
    {
      "text": "C. Neustaedter, C. Pang, A. Forghani, E. Oduor, S. Hillman, T. K. Judge, M. Massimi and S. Greenberg, “Sharing Domestic Life through Long-Term Video Connections,” ACM Transactions on Computer-Human Interaction, vol. 22, no. 1, pp. 3:1-3:29, 2015.",
      "doi": "10.1145/2696869"
    },
    {
      "text": "D. Wan, “Magic Wardrobe: Situated Shopping from your own Bedroom,” Personal Technologies, no. 4, pp. 234-237, 2000.",
      "doi": ""
    },
    {
      "text": "W. Odom, J. Zimmerman, J. forlizzi, H. Choi and S. Meier, “Investigating the prsence, form and behavior of virtual poseessions in the context of a teen bedroom,” in Proceedings of the SIGCHI Conferece on Human Factors in Computing Systems, Austin, 2012.",
      "doi": "10.1145/2207676.2207722"
    },
    {
      "text": "C. Dodge, “The Bed: A Medium for Intimate Communication,” in CHI '97 Extended Abstracts on Human Factors in Computer Systems, Atlanta, 1997.",
      "doi": "10.1145/1120212.1120439"
    },
    {
      "text": "E. Goodman and M. Misilim, “The Sensing Beds,” in Proceedings of UbiComp 2003 Workshop, Seattle, 2003.",
      "doi": ""
    },
    {
      "text": "T. Scherini, P. Melo, T. v. Craenendonck, W. Zou and M. Kaptein, “Enhancing the Sleeping Quality of Partners Living Apart,” in Proceedings of the 8th ACM Conference on Designing Interactive Systems, Aarhus, 2010.",
      "doi": "10.1145/1858171.1858201"
    },
    {
      "text": "D. Gooch and L. Watts, “SleepyWhispers: Sharing Goodnights within Distant Relationships,” in Adjunct Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology, Cambridge, 2012.",
      "doi": "10.1145/2380296.2380322"
    },
    {
      "text": "E. K. Choe, S. Consolvo, J. Jung, B. Harrison and J. A. Kientz, “Living in a glass house: a survey of private moments in the home,” in Proceedings of the 13th international conference on Ubiquitous computing, Beijing, 2011.",
      "doi": "10.1145/2030112.2030118"
    },
    {
      "text": "D. Hindus, S. D. Mainwaring, N. Leduc, A. E. Hagström and O. Bayley, “Casablanca: Designing Social Communication Devices for the Home,” in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Seattle, 2001.",
      "doi": "10.1145/365024.383749"
    },
    {
      "text": "C. Neustaedter, S. Greenberg and M. Boyle, “Blur Filtration Fails to Preserve Privacy for Home-Based Video Conferencing,” ACM Transactions on Computer-Human Interaction, vol. 13, no. 1, pp. 1-36, 2006.",
      "doi": "10.1145/1143518.1143519"
    },
    {
      "text": "Y. Heshmat, C. Neustaedter and B. DeBrincat, “The Autobiographical Design and Long Term Usage of an Always-On Video Recording System for the Home,” in Proceedings of the 2017 Conference on Designing Interactive Systems, Edinburgh, 2017.",
      "doi": "10.1145/3064663.3064759"
    },
    {
      "text": "M. Boyle and S. Greenberg, “The Language of Privacy: Learning from Video Media Space Analysis and Design,” ACM Transactions on Computer-Human Intearction, vol. 12, no. 2, pp. 328-370, 2005.",
      "doi": "10.1145/1067860.1067868"
    },
    {
      "text": "C. J. Sutherland, A. Luxton-Reilly and B. Plimmer, “Freeform digital ink annotations in electroninc documents: A systematic mapping study,” Computers & Graphics, vol. 55, pp. 1-20, 2015.",
      "doi": "10.1016/j.cag.2015.10.014"
    },
    {
      "text": "A. Sellen, R. Harper, R. Eardley, S. Izadi, T. Regan, A. S. Taylor and K. R. Wood, “HomeNote: Supporting Situated Messaging in the Home,” in Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work, Banff, 2006.",
      "doi": "10.1145/1180875.1180933"
    },
    {
      "text": "S. E. Lindley, R. Harper and A. Sellen, “Designing a Technological Playground: A Field Study of the Emergence of Play in Household Messaging,” in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Atlanta, 2010.",
      "doi": "10.1145/1753326.1753681"
    },
    {
      "text": "J. C. Tang and S. L. Minneman, “VideoDraw: A Video Interface for Collaborative Drawing,” in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Seattle, 1990.",
      "doi": "10.1145/97243.97302"
    },
    {
      "text": "J. C. Tang and S. L. Minneman, “VideoDraw: A Video Interface for Collaborative Drawing,” ACM Transactions on Information Systems, vol. 9, no. 2, pp. 170-184, 1991.",
      "doi": "10.1145/123078.128729"
    },
    {
      "text": "H. Ishii and M. Kobayashi, “ClearBoard: A Seamless Medium for Shared Drawing and Conversation with Eye Contact,” in Proceedings of the SIGCHI Conference on Human Fcators in Computing Systems, Monterey, 1992.",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "H. Ishii, M. Kobayashi and J. Grudin, “Integration of inter-personal space and shared workspace: ClearBoard design and experiments,” in Proceedings of the 1992 ACM conference on Computer-supported cooperative work, Toronto, 1992.",
      "doi": "10.1145/143457.143459"
    },
    {
      "text": "H. Ishii, M. Kobayashi and J. Grudin, “Integration of interpersonal space and shared workspace: ClearBoard design and experiments,” ACM Transactions on Information Systems, vol. 11, no. 4, pp. 349-375, 1993.",
      "doi": "10.1145/159764.159762"
    },
    {
      "text": "P. Wellner, “Interacting with Paper on the DigitalDesk,” Communications of the ACM, vol. 36, no. 7, pp. 87-96, 1993.",
      "doi": "10.1145/159544.159630"
    },
    {
      "text": "A. D. Wilson and D. C. Robbins, “PlayTogether: Playing Games across Multiple Interactive Tabletops,” in IUI Workshop on Tangible Play: Research and Design for Tangible and Tabletop Games, Honolulu, 2007.",
      "doi": ""
    },
    {
      "text": "S. Greenberg and C. Neustaedter, “Shared Living, Experiences, and Intimacy over Video Chat in Long Distance Relationships,” in Connecting Families: The Impact of New Communication Tehcnologies on Domestic Life, London, Springer-Verlag, 2013, pp. 37-53.",
      "doi": ""
    },
    {
      "text": "U. Baishya, “In Your Eyes: Anytime, Anywhere Video and Audio Streaming for Couples,” in CSCW, Portland, 2017.",
      "doi": ""
    },
    {
      "text": "D. Kirk, A. Sellen and X. Cao, “Home Video Communication: Mediating 'Closeness',” in Proceedings of the 2010 ACM conference on Computer supported cooperative work, Savannah, 2010.",
      "doi": "10.1145/1718918.1718945"
    },
    {
      "text": "S. Kim, J. A. Kientz, S. N. Patel and G. D. Abowd, “Are You Sleeping? Sharing Portrayed Sleeping Status withing a Social Network,” in Proceedings of the 2008 ACM Conference on Computer supported cooperative work, San Diego, 2008.",
      "doi": ""
    },
    {
      "text": "H. Hutchinson, W. Mackay, B. Westerlund, B. B. Bederson, A. Druin, C. Plaisant, M. Beaudouin-Lafon, S. Conversy, H. Evans, H. Hansen, N. Roussel and B. Eiderbäck, “Technology Probes: Inspiring Design for and with Families,” in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Ft. Lauderdale, 2003.",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "J. Kučera, J. Scott, N. Chen, P. Olivier and S. Hodges, “Towards Calm Displays: Matching Ambient Illumination in Bedrooms,” Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, vol. 1, no. 2, June 2017.",
      "doi": ""
    },
    {
      "text": "J. Kučera, J. Scott, S. Lindley and P. Olivier, “Bedtime Window: A System Enabling Sharing of Bedtime for Long-Distance Couples,” in Adjunct Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers, London, 2019.",
      "doi": "10.1145/3341162.3343779"
    },
    {
      "text": "C. Neustaedter and P. Sengers, “Autobiographical Design in HCI Research: Designing and Learning through Use-It-Yourself,” in DIS, Newcastle, 2012.",
      "doi": ""
    },
    {
      "text": "M. Prasad A, M. Selvaraj and S. Madhvanath, “Peer-to-peer ink messaging across heterogeneous devices and platforms,” in COMPUTE '08 Proceedings of the 1st Bangalore Annual Compute Conference, Bangalore, 2008.",
      "doi": ""
    },
    {
      "text": "H. Ishii, M. Kobayashi and K. Arita, “Iterative design of seamless collaboration media,” Communicationcs of the ACM, vol. 37, no. 8, 1994.",
      "doi": ""
    },
    {
      "text": "M. Glass, K. Bryant, J. H. Kim and M. Desjarlais, “Come let us chat together: simultaneous typed-chat in computer-supported collaborative dialogue,” Journal of Computing Sciences in Colleges, vol. 31, no. 2, pp. 96-105, 2015.",
      "doi": "10.5555/2831432.2831447"
    },
    {
      "text": "T. Salmela, A. Colley and J. Häkkilä, “Together in Bed? Couples' Mobile Technology Use in Bed,” in Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, Glasgow, 2019.",
      "doi": "10.1145/3290605.3300732"
    }
  ]
}