{
  "doi": "10.1145/3411764.3445578",
  "title": "Tactile Fixations: A Behavioral Marker on How People with Visual Impairments Explore Raised-line Graphics",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Raised-line graphics are tactile documents made for people with visual impairments (VI). Their exploration relies on a complex two-handed behavior. To better understand the cognitive processes underlying this exploration, we proposed a new method based on “tactile fixations”. A tactile fixation occurs when a finger is stationary within a specific spatial and temporal window. It is known that stationary fingers play an active role when exploring tactile graphics, but they have never been defined or studied before. In this study, we first defined the concept of tactile fixation, then we conducted a behavioral study with ten participants with VI in order to assess the role of tactile fixations under different conditions. The results show that tactile fixations vary according to different factors such as the graphic type as well as the involved hand and the aim of the exploration.",
  "tags": [
    "Raised-line graphic",
    "Tactile Fixations",
    "Visual impairment"
  ],
  "authors": [
    {
      "name": "Kaixing Zhao",
      "institution": "IRIT University of Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659541759",
      "orcid": "missing"
    },
    {
      "name": "Sandra Bardot",
      "institution": "HCI Lab University of Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658657437",
      "orcid": "missing"
    },
    {
      "name": "Marcos Serrano",
      "institution": "University of Toulouse IRIT - Elipse, France",
      "img": "/do/10.1145/contrib-81318491531/rel-imgonly/marcos-2018.jpg",
      "acmid": "81318491531",
      "orcid": "0000-0001-8431-0601"
    },
    {
      "name": "Mathieu Simonnet",
      "institution": "LEGO IMT Atlantique, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81461658818",
      "orcid": "missing"
    },
    {
      "name": "Bernard Oriola",
      "institution": "IRIT CNRS / UPS, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100409371",
      "orcid": "0000-0001-5888-5268"
    },
    {
      "name": "Christophe Jouffrais",
      "institution": "IPAL CNRS, Singapore",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377594403",
      "orcid": "0000-0002-0768-1019"
    }
  ],
  "references": [
    {
      "text": "Sandra Bardot, Marcos Serrano, Bernard Oriola, and Christophe Jouffrais. 2017. Identifying how Visually Impaired People Explore Raised-line Diagrams to Improve the Design of Touch Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). Association for Computing Machinery, New York, NY, 550–555. https://doi.org/10.1145/3025453.3025582",
      "doi": "10.1145/3025453.3025582"
    },
    {
      "text": "Sandra Bardot, Marcos Serrano, Simon Perrault, Shengdong Zhao, and Christophe Jouffrais. 2019. Investigating Feedback for Two-Handed Exploration of Digital Maps Without Vision. In IFIP Conference on Human-Computer Interaction (INTERACT 2019). Springer, Cham, 305–324. https://doi.org/10.1007/978-3-030-29381-9_19",
      "doi": ""
    },
    {
      "text": "B. L. Bentzen. 1983. Tactile specifications of route configurations. In Proceedings of the First International Symposium on Maps and Graphics for the Visually Handicapped. Association of American Geographers, Washington, DC, 125–136.",
      "doi": ""
    },
    {
      "text": "David Beymer, Peter Z. Orton, and Daniel M. Russell. 2007. An eye tracking study of how pictures influence online reading. In IFIP Conference on Human-computer Interaction (INTERACT 2007). Springer-Verlag, Berlin, Heidelberg, 456–460. https://doi.org/10.1007/978-3-540-74800-7_41",
      "doi": ""
    },
    {
      "text": "Tanja Blascheck, Lonni Besançon, Anastasia Bezerianos, Bongshin Lee, and Petra Isenbergr. 2019. Glanceable Visualization: Studies of Data Comparison Performance on Smartwatches. IEEE Transactions on Visualization and Computer Graphics 25, 1(2019), 616–629.",
      "doi": "10.1109/TVCG.2018.2865142"
    },
    {
      "text": "Anke Brock, Samuel Lebaz, Bernard Oriola, Delphine Picard, Christophe Jouffrais, and Philippe Truillet. 2012. Kin’touch: understanding how visually impaired people explore tactile maps. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’12). Association for Computing Machinery, New York, NY, 2471–2476. https://doi.org/10.1145/2212776.2223821",
      "doi": ""
    },
    {
      "text": "Anke Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2015. Interactivity improves usability of geographic maps for visually impaired people. Human-Computer Interaction 30, 2 (2015), 156–194.",
      "doi": "10.5555/2692791.2692794"
    },
    {
      "text": "Emeline Brulé, Brianna J. Tomlinson, Oussama Metatla, Christophe Jouffrais, and Marcos Serrano. 2020. Review of Quantitative Empirical Evaluations of Technology for People with Visual Impairments. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). Association for Computing Machinery, New York, NY, 1–14. https://doi.org/10.1145/3313831.3376749",
      "doi": "10.1145/3313831.3376749"
    },
    {
      "text": "Georg Buscher, Edward Cutrell, and Meredith Ringel Morris. 2009. What do you see when you’re surfing? using eye tracking to predict salient regions of web pages. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’09). Association for Computing Machinery, New York, NY, 21–30. https://doi.org/10.1145/1518701.1518705",
      "doi": "10.1145/1518701.1518705"
    },
    {
      "text": "Julie Ducasse, Anke M. Brock, and Christophe Jouffrais. 2018. Accessible interactive maps for visually impaired users. Mobility of visually impaired people 2 (2018), 537–584.",
      "doi": ""
    },
    {
      "text": "Julie Ducasse, Marc J-M Macé, Marcos Serrano, and Christophe Jouffrais. 2016. Tangible Reels: Construction and Exploration of Tangible Maps by Visually Impaired Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16). Association for Computing Machinery, New York, NY, 2186–2197. https://doi.org/10.1145/2858036.2858058",
      "doi": "10.1145/2858036.2858058"
    },
    {
      "text": "Polly Edman. 1992. Tactile graphics. American Foundation for the Blind, USA.",
      "doi": ""
    },
    {
      "text": "Yvonne Eriksson, Gunnar Jansson, and Monica Strucel. 2003. Tactile maps: guidelines for the production of maps for the visually impaired. Swedish Library of Talking Books and Braille, Sweden.",
      "doi": ""
    },
    {
      "text": "Yvonne Eriksson and Monica Strucel. 1995. Production of tactile graphics on swellpaper. Swedish Library of Talking Books and Braille, Sweden.",
      "doi": ""
    },
    {
      "text": "Florence Gaunet and Catherine Thinus-Blanc. 1996. Early-blind subjects’ spatial abilities in the locomotor space: Exploratory strategies and reaction-to-change performance. Perception 25, 8 (1996), 967–981.",
      "doi": ""
    },
    {
      "text": "William Grussenmeyer, Jesel Garcia, and Fang Jiang. 2016. Feasibility of using haptic directions through maps with a tablet and smart watch for people who are blind and visually impaired. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI ’16). Association for Computing Machinery, New York, NY, 83–89. https://doi.org/10.1145/2935334.2935367",
      "doi": "10.1145/2935334.2935367"
    },
    {
      "text": "Tiago Guerreiro, Kyle Montague, João Guerreiro, Rafael Nunes, Hugo Nicolau, and Daniel J.V. Gonçalves. 2015. Blind People Interacting with Large Touch Surfaces: Strategies for One-handed and Two-handed Exploration. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (ITS ’15). Association for Computing Machinery, New York, NY, 25–34. https://doi.org/10.1145/2817721.2817743",
      "doi": "10.1145/2817721.2817743"
    },
    {
      "text": "Timo Götzelmann and Aleksander Pavkovic. 2014. Towards automatically generated tactile detail maps by 3D printers for blind persons. In Proceedings of International Conference on Computers for Handicapped Persons (ICCHP 2014). Springer, Cham, 1–7.",
      "doi": ""
    },
    {
      "text": "Yvette Hatwell, Arlette Streri, and Edouard Gentaz. 2003. Touching for knowing: cognitive psychology of haptic manual perception. AJohn Benjamins Publishing, Amsterdam, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Morton A Heller. 1989. Picture and Pattern Perception in the Sighted and the Blind: The Advantage of the Late Blind. Perception 18, 3 (1989), 379–389. https://doi.org/10.1068/p180379",
      "doi": ""
    },
    {
      "text": "Morton A. Heller, Melissa McCarthy, and Ashley Clark. 2005. Pattern perception and pictures for the blind. Psicologica 26, 1 (2005), 161–171.",
      "doi": ""
    },
    {
      "text": "Everett W. Hill, John J. Rieser, M-M. Hill, Marc Hill, J. Halpin, and R. Halpin. 1993. How persons with visual impairments explore novel spaces: Strategies of good and poor performers. Journal of Visual Impairment & Blindness 87, 8 (1993), 295–301.",
      "doi": ""
    },
    {
      "text": "James E. Hoffman. 1998. Visual attention and eye movements. Attention 31(1998), 119–153.",
      "doi": ""
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible Maps for the Blind: Comparing 3D Models with Tactile Graphics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). Association for Computing Machinery, New York, NY, 1–13. https://doi.org/10.1145/3173574.3173772",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "R.Dan Jacobson. 1998. Cognitive mapping without sight: Four preliminary studies of spatial learning. Journal of Environmental Psychology 18, 3 (1998), 289–305.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Meredith Ringel Morris, Annuska Z. Perkins, Daniel Wigdor, Richard E. Ladner, and Jacob O. Wobbrock. 2011. Access Overlays: Improving Non-Visual Access to Large Touch Screens for Blind Users. In Proceedings of the 24th annual ACM symposium on User interface software and technology (UIST ’11). Association for Computing Machinery, New York, NY, 273–282. https://doi.org/10.1145/2047196.2047232",
      "doi": "10.1145/2047196.2047232"
    },
    {
      "text": "John M. Kennedy and Juan Bai. 2002. Haptic Pictures: Fit Judgments Predict Identification, Recognition Memory, and Confidence. Perception 31, 8 (2002), 1013–1026.",
      "doi": ""
    },
    {
      "text": "Roberta L. Klatzky, Jack M. Loomis, Susan J. Lederman, Hiromi Wake, and Naofumi Fujita. 1993. Haptic identification of objects and their depictions. Perception & Psychophysics 54, 2 (1993), 170–178. https://doi.org/10.3758/BF03211752",
      "doi": ""
    },
    {
      "text": "Orly Lahav and David Mioduser. 2008. Haptic-feedback support for cognitive mapping of unknown spaces by people who are blind. International Journal of Human-Computer Studies 66, 1 (2008), 23–35.",
      "doi": "10.1016/j.ijhcs.2007.08.001"
    },
    {
      "text": "Steven Landau, Michael Russell, Karen Gourgey, Jane N. Erin, and Jennifer Cowan. 2003. Use of the talking tablet in mathematics testing. Journal of Visual Impairment & Blindness 97, 2 (2003), 85–96.",
      "doi": ""
    },
    {
      "text": "Samuel Lebaz, Christophe Jouffrais, and Delphine Picard. 2012. Haptic identification of raised-line drawings: high visuospatial imagers outperform low visuospatial imagers. Psychological research 76, 5 (2012), 667–675.",
      "doi": ""
    },
    {
      "text": "Susan J. Lederman and Roberta L. Klatzky. 1987. Hand movements: A window into haptic object recognition. Cognitive psychology 19, 3 (1987), 342–368.",
      "doi": ""
    },
    {
      "text": "Susan J. Lederman and Roberta L. Klatzky. 2009. Haptic perception: A tutorial. Attention, Perception & Psychophysics 71, 7 (2009), 1439–1459.",
      "doi": ""
    },
    {
      "text": "Susan J. Lederman, Roberta L. Klatzky, Cynthia Chataway, and Craig D. Summers. 1990. Visual mediation and the haptic recognition of two-dimensional pictures of common objects. Perception & Psychophysics 47, 1 (1990), 54–64.",
      "doi": ""
    },
    {
      "text": "Susan J. Lederman, Roberta L. Klatzky, April Collions, and Jackie Wardell. 1987. Exploring Environments by Hand or Foot: Time-Based Heuristics for Encoding Distance in Movement Space. Journal of Experimental Psychology: Learning, Memory, and Cognition 13, 4(1987), 606. https://doi.org/10.1037/0278-7393.13.4.606",
      "doi": ""
    },
    {
      "text": "Jack M. Loomis, Roberta L. Klatzky, and Susan J. Lederman. 1991. Similarity of tactual and visual picture recognition with limited field of view. Perception 20, 2 (1991), 167–177.",
      "doi": ""
    },
    {
      "text": "Irene Miller, Aquinas Pather, Janet Milbury, Lucia Hasty, Allison O’Day, Diane Spence, and S. Osterhaus. 2010. Guidelines and Standards for Tactile Graphics. The Braille Authority of North America, USA.",
      "doi": ""
    },
    {
      "text": "Carson Y. Nolan and June E. Morris. 1971. Improvement of Tactual Symbols for Blind Children. American Printing House for the Blind, Louisville, US.",
      "doi": ""
    },
    {
      "text": "R.M. Sakia. 1992. The Box-Cox transformation technique: a review. Journal of the Royal Statistical Society: Series D (The Statistician) 41, 2(1992), 169–178.",
      "doi": ""
    },
    {
      "text": "Dario D. Salvucci and Joseph H. Goldberg. 2000. Identifying fixations and saccades in eye-tracking protocols. In Proceedings of the symposium on eye tracking research & applications (ETRA ’00). Association for Computing Machinery, New York, NY, 71–78. https://doi.org/10.1145/355017.355028",
      "doi": ""
    },
    {
      "text": "Joan G. Snodgrass and Mary Vanderwart. 1980. A standardized set of 260 pictures: norms for name agreement, image agreement, familiarity, and visual complexity. Journal of experimental psychology: Human learning and memory 6, 2(1980), 174–215.",
      "doi": ""
    },
    {
      "text": "Mark Symmons and Barry Richardson. 2000. Raised line drawings are spontaneously explored with a single finger. Perception 29, 5 (2000), 621–626.",
      "doi": ""
    },
    {
      "text": "Jon M. Tellevik. 1992. Influence of spatial exploration patterns on cognitive mapping by blindfolded sighted persons. Journal of Visual Impairment & Blindness 86, 5 (1992), 221–224.",
      "doi": ""
    },
    {
      "text": "Leanne J. Thompson, Edward P. Chronicle, and Alan F. Collins. 2006. Enhancing 2-D Tactile Picture Design from Knowledge of 3-D Haptic Object Recognition. European Psychologist 11, 2 (2006), 110–118. https://doi.org/10.1027/1016-9040.11.2.110",
      "doi": ""
    },
    {
      "text": "Edward C. Tolman. 1948. Cognitive maps in rats and men. Psychological review 55, 4 (1948), 189.",
      "doi": ""
    },
    {
      "text": "Maarten WA Wijntjes, Thijs Van Lienen, Ilse M. Verstijnen, and Astrid M L Kappers. 2008. The influence of picture size on recognition and exploratory behaviour in raised-line drawings. Perception 37, 4 (2008), 602–614. https://doi.org/10.1068/p5714",
      "doi": ""
    },
    {
      "text": "Kaixing Zhao, Marcos Serrano, Bernard Oriola, and Christophe Jouffrais. 2020. VibHand: On-Hand Vibrotactile Interface Enhancing Non-Visual Exploration of Digital Graphics. Proc. ACM Hum.-Comput. Interact, ISS 4, 207 (2020), 1–19. https://doi.org/10.1145/3427335",
      "doi": "10.1145/3432214"
    }
  ]
}