{
  "doi": "10.1145/3411764.3445157",
  "title": "Don’t You Know That You’re Toxic: Normalization of Toxicity in Online Gaming",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Video game toxicity, endemic to online play, represents a pervasive and complex problem. Antisocial behaviours in online play directly harm player wellbeing, enjoyment, and retention—but research has also revealed that some players normalize toxicity as an inextricable and acceptable element of the competitive video game experience. In this work, we explore perceptions of toxicity and how they are predicted by player traits, demonstrating that participants reporting a higher tendency towards Conduct Reconstrual, Distorting Consequences, Dehumanization, and Toxic Online Disinhibition perceive online game interactions as less toxic. Through a thematic analysis on willingness to report, we also demonstrate that players abstain from reporting toxic content because they view it as acceptable, typical of games, as banter, or as not their concern. We propose that these traits and themes represent contributing factors to the cyclical normalization of toxicity. These findings further highlight the multifaceted nature of toxicity in online video games.",
  "authors": [
    {
      "name": "Nicole A Beres",
      "institution": "Human Computer Interaction Lab University of Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701423",
      "orcid": "missing"
    },
    {
      "name": "Julian Frommel",
      "institution": "Department of Computer Science University of Saskatchewan, Canada",
      "img": "/do/10.1145/contrib-88159458857/rel-imgonly/jf_2020_12_17_400x400.jpg",
      "acmid": "88159458857",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Reid",
      "institution": "Human Computer Interaction Lab University of Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365125",
      "orcid": "missing"
    },
    {
      "name": "Regan L Mandryk",
      "institution": "Department of Computer Science University of Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100231855",
      "orcid": "missing"
    },
    {
      "name": "Madison Klarkowski",
      "institution": "Department of Computer Science University of Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658771903",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kate Abramson. 2014. Turning up the Lights on Gaslighting. Philosophical Perspectives 28, 1 (2014), 1–30. https://doi.org/10.1111/phpe.12046",
      "doi": ""
    },
    {
      "text": "Sonam Adinolf and Selen Turkay. 2018. Toxic Behaviors in Esports Games: Player Perceptions and Coping Strategies. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts(CHI PLAY ’18 Extended Abstracts). Association for Computing Machinery, Melbourne, VIC, Australia, 365–372. https://doi.org/10.1145/3270316.3271545",
      "doi": "10.1145/3270316.3271545"
    },
    {
      "text": "Mary Elizabeth Ballard and Kelly Marie Welch. 2017. Virtual warfare: Cyberbullying and cyber-victimization in MMOG play. Games and Culture 12, 5 (2017), 466–491.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1999. Moral Disengagement in the Perpetration of Inhumanities. Personality and Social Psychology Review 3, 3 (Aug. 1999), 193–209. https://doi.org/10.1207/s15327957pspr0303_3",
      "doi": ""
    },
    {
      "text": "Jeremy Blackburn and Haewoon Kwak. 2014. STFU NOOB! predicting crowdsourced decisions on toxic behavior in online games. In Proceedings of the 23rd international conference on World wide web(WWW ’14). Association for Computing Machinery, Seoul, Korea, 877–888. https://doi.org/10.1145/2566486.2567987",
      "doi": "10.1145/2566486.2567987"
    },
    {
      "text": "Ian D. Boardley and Maria Kavussanu. 2007. Development and validation of the Moral Disengagement in Sport Scale. Journal of Sport & Exercise Psychology 29, 5 (2007), 608–628. https://doi.org/10.1037/e548052012-028",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan. 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Brenda Jo Bredemeier and David L. Shields. 1986. Game Reasoning and Interactional Morality. The Journal of Genetic Psychology 147, 2 (June 1986), 257–275. https://doi.org/10.1080/00221325.1986.9914499",
      "doi": ""
    },
    {
      "text": "Arnold H. Buss and Mark Perry. 1992. The Aggression Questionnaire. Journal of Personality and Social Psychology 63, 3(1992), 452–459. https://doi.org/10.1037/0022-3514.63.3.452",
      "doi": ""
    },
    {
      "text": "Marcus Carter and Fraser Allison. 2019. Guilt in DayZ. In Transgression in Games and Play, K. Jorgensen & F. Karlsen (Ed.). MIT Press, Cambridge, MA, Chapter 8, 134–152.",
      "doi": ""
    },
    {
      "text": "Vivian Hsueh-Hua Chen, Henry Been-Lirn Duh, and Chiew Woon Ng. 2009. Players who play to make others cry: the influence of anonymity and immersion. In Proceedings of the International Conference on Advances in Computer Enterntainment Technology(ACE ’09). Association for Computing Machinery, Athens, Greece, 341–344. https://doi.org/10.1145/1690388.1690454",
      "doi": "10.1145/1690388.1690454"
    },
    {
      "text": "Shira Chess and Adrienne Shaw. 2015. A conspiracy of fishes, or, how we learned to stop worrying about# GamerGate and embrace hegemonic masculinity. Journal of Broadcasting & Electronic Media 59, 1 (2015), 208–220.",
      "doi": ""
    },
    {
      "text": "Christine Cook, Juliette Schaafsma, and Marjolijn Antheunis. 2018. Under the bridge: An in-depth examination of online trolling in the gaming context. New Media & Society 20, 9 (2018), 3323–3340. https://doi.org/10.1177/1461444817748578",
      "doi": ""
    },
    {
      "text": "Ansgar E. Depping, Colby Johanson, and Regan L. Mandryk. 2018. Designing for Friendship: Modeling Properties of Play, In-Game Social Capital, and Psychological Well-Being. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (Melbourne, VIC, Australia) (CHI PLAY ’18). Association for Computing Machinery, New York, NY, USA, 87–100. https://doi.org/10.1145/3242671.3242702",
      "doi": "10.1145/3242671.3242702"
    },
    {
      "text": "Entertainment Software Association. 2019. Essential Facts About the Computer and Video Game Industry.",
      "doi": ""
    },
    {
      "text": "S. Eveslage and K. Delaney. 1998. Talkin’ trash at Hardwick high: a case study of insult talk on a boys’ basketball team. International Review for the Sociology of Sport 33, 3 (1998), 239–253. https://www.cabdirect.org/cabdirect/abstract/19981811828",
      "doi": ""
    },
    {
      "text": "Fair Play Alliance. 2020. Fair Play Alliance. https://fairplayalliance.org/",
      "doi": ""
    },
    {
      "text": "Chek Yang Foo and Elina M. I. Koivisto. 2004. Defining grief play in MMORPGs: player and developer perceptions. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in computer entertainment technology(ACE ’04). Association for Computing Machinery, Singapore, 245–250. https://doi.org/10.1145/1067343.1067375",
      "doi": ""
    },
    {
      "text": "Jesse Fox and Wai Yen Tang. 2014. Sexism in online video games: The role of conformity to masculine norms and social dominance orientation. Computers in Human Behavior 33 (2014), 314–320.",
      "doi": "10.1016/j.chb.2013.07.014"
    },
    {
      "text": "Kishonna L Gray. 2012. Deviant bodies, stigmatized identities, and racist acts: Examining the experiences of African-American gamers in Xbox Live. New Review of Hypermedia and Multimedia 18, 4 (2012), 261–276.",
      "doi": "10.1080/13614568.2012.746740"
    },
    {
      "text": "Kishonna L Gray. 2014. Race, gender, and deviance in Xbox live: Theoretical perspectives from the virtual margins. Routledge, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Tilo Hartmann. 2017. The ‘Moral Disengagement in Violent Videogames’ Model. Game Studies 17, 2 (2017).",
      "doi": ""
    },
    {
      "text": "Zorah Hilvert-Bruce and James T. Neill. 2020. I’m just trolling: The role of normative beliefs in aggressive behaviour in online gaming. Computers in Human Behavior 102 (Jan. 2020), 303–311. https://doi.org/10.1016/j.chb.2019.09.003",
      "doi": ""
    },
    {
      "text": "L Rowell Huesmann and Leonard D Eron. 1984. Cognitive processes and the persistence of aggressive behavior. Aggressive behavior 10, 3 (1984), 243–251.",
      "doi": ""
    },
    {
      "text": "Christoph Klimmt, Hannah Schmid, Andreas Nosper, Tilo Hartmann, and Peter Vorderer. 01 Sep. 2006. How players manage moral concerns to make video game violence enjoyable. Communications 31, 3 (01 Sep. 2006), 309 – 328. https://doi.org/10.1515/COMMUN.2006.020",
      "doi": ""
    },
    {
      "text": "Bastian Kordyaka, Katharina Jahn, and Bjoern Niehaves. 2020. Towards a unified theory of toxic behavior in video games. Internet Research 30, 4 (April 2020), 1081–1102. https://doi.org/10.1108/INTR-08-2019-0343",
      "doi": ""
    },
    {
      "text": "Jeffrey H. Kuznekoff and Lindsey M. Rose. 2013. Communication in multiplayer gaming: Examining player responses to gender cues. New Media & Society 15, 4 (June 2013), 541–556. https://doi.org/10.1177/1461444812458271",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring Cyberbullying and Other Toxic Behavior in Team Competition Online Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, Seoul, Republic of Korea, 3739–3748. https://doi.org/10.1145/2702123.2702529",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Noam Lapidot-Lefler and Azy Barak. 2012. Effects of anonymity, invisibility, and lack of eye-contact on toxic online disinhibition. Computers in Human Behavior 28, 2 (March 2012), 434–443. https://doi.org/10.1016/j.chb.2011.10.014",
      "doi": "10.1016/j.chb.2011.10.014"
    },
    {
      "text": "Sung Je Lee, Eui Jun Jeong, and Joon Hyun Jeon. 2019. Disruptive behaviors in online games: Effects of moral positioning, competitive motivation, and aggression in “League of Legends”. Social Behavior and Personality: an international journal 47, 2(2019), 1–9.",
      "doi": ""
    },
    {
      "text": "Regan L. Mandryk, Julian Frommel, Ashley Armstrong, and Daniel Johnson. 2020. How Passion for Playing World of Warcraft Predicts In-Game Social Capital, Loneliness, and Wellbeing. Frontiers in Psychology 11 (2020), 2165. https://doi.org/10.3389/fpsyg.2020.02165",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon’s Mechanical Turk. Behavior Research Methods 44, 1 (March 2012), 1–23. https://doi.org/10.3758/s13428-011-0124-6",
      "doi": ""
    },
    {
      "text": "Topias Mattinen and Joseph Macey. 2018. Online Abuse and Age in Dota 2. In Proceedings of the 22nd International Academic Mindtrek Conference(Mindtrek ’18). Association for Computing Machinery, New York, NY, USA, 69–78. https://doi.org/10.1145/3275116.3275149",
      "doi": "10.1145/3275116.3275149"
    },
    {
      "text": "Newzoo. 2019. 2018 Global Games Market Report.",
      "doi": ""
    },
    {
      "text": "Ryan Perry, Anders Drachen, Allison Kearney, Simone Kriglstein, Lennart E Nacke, Rafet Sifa, Guenter Wallner, and Daniel Johnson. 2018. Online-only friends, real-life friends or strangers? Differential associations with passion and social capital in video game play. Computers in Human Behavior 79 (2018), 202–210.",
      "doi": "10.1016/j.chb.2017.10.032"
    },
    {
      "text": "Chrisa D. Pornari and Jane Wood. 2010. Peer and cyber aggression in secondary school students: the role of moral disengagement, hostile attribution bias, and outcome expectancies. Aggressive Behavior 36, 2 (2010), 81–94. https://doi.org/10.1002/ab.20336",
      "doi": ""
    },
    {
      "text": "D.W. Rainey and V. Granito. 2010. Normative rules for trash talk among college athletes: an exploratory study. Journal of Sport Behavior 33, 3 (2010), 276–294.",
      "doi": ""
    },
    {
      "text": "Riot. 2019. Ask Riot: Will Tribunal Return?",
      "doi": ""
    },
    {
      "text": "L Rowell Huesmann. 1988. An information processing model for the development of aggression. Aggressive behavior 14, 1 (1988), 13–24.",
      "doi": ""
    },
    {
      "text": "Anastasia Salter and Bridget Blodgett. 2012. Hypermasculinity & dickwolves: The contentious role of women in the new gaming public. Journal of broadcasting & electronic media 56, 3 (2012), 401–416.",
      "doi": ""
    },
    {
      "text": "Daniel M Shafer. 2014. Moral Choice in Video Games: An Exploratory Study. Media Psychology Review 5, 1 (2014).",
      "doi": ""
    },
    {
      "text": "Cuihua Shen, Qiusi Sun, Taeyoung Kim, Grace Wolff, Rabindra Ratan, and Dmitri Williams. 2020. Viral vitriol: Predictors and contagion of online toxicity in World of Tanks. Computers in Human Behavior 108 (July 2020), 1–6. https://doi.org/10.1016/j.chb.2020.106343",
      "doi": ""
    },
    {
      "text": "David Light Shields, Christopher D. Funk, and Brenda Light Bredemeier. 2015. Predictors of Moral Disengagement in Sport. Journal of Sport and Exercise Psychology 37, 6 (Dec. 2015), 646–658. https://doi.org/10.1123/jsep.2015-0110",
      "doi": ""
    },
    {
      "text": "Kenneth B. Shores, Yilin He, Kristina L. Swanenburg, Robert Kraut, and John Riedl. 2014. The identification of deviance and its impact on retention in a multiplayer game. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(CSCW ’14). Association for Computing Machinery, Baltimore, Maryland, USA, 1356–1365. https://doi.org/10.1145/2531602.2531724",
      "doi": "10.1145/2531602.2531724"
    },
    {
      "text": "Catherine R. South and Jane Wood. 2006. Bullying in prisons: the importance of perceived social status, prisonization, and moral disengagement. Aggressive Behavior 32, 5 (2006), 490–501. https://doi.org/10.1002/ab.20149",
      "doi": ""
    },
    {
      "text": "Spam. 2020. Merriam-Webster’s Collegiate Dictionary. https://www.merriam-webster.com/dictionary/spam",
      "doi": ""
    },
    {
      "text": "Lucy Sparrow, Martin Gibbs, and Michael Arnold. 2019. Apathetic Villagers and the Trolls Who Love Them: Player Amorality in Online Multiplayer Games. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction (Fremantle, WA, Australia) (OZCHI’19). Association for Computing Machinery, New York, NY, USA, 447–451. https://doi.org/10.1145/3369457.3369514",
      "doi": "10.1145/3369457.3369514"
    },
    {
      "text": "Nicholas Stanger, Maria Kavussanu, Ian D. Boardley, and Christopher Ring. 2013. The influence of moral disengagement and negative emotion on antisocial sport behavior. Sport, Exercise, and Performance Psychology 2, 2 (2013), 117–129. https://doi.org/10.1037/a0030585",
      "doi": ""
    },
    {
      "text": "Cynthia A. Stark. 2019. Gaslighting, Misogyny, and Psychological Oppression. The Monist 102, 2 (April 2019), 221–235. https://doi.org/10.1093/monist/onz007",
      "doi": ""
    },
    {
      "text": "Ashley E. Stirling and Gretchen A. Kerr. 2008. Defining and categorizing emotional abuse in sport. European Journal of Sport Science 8, 4 (July 2008), 173–181. https://doi.org/10.1080/17461390802086281",
      "doi": ""
    },
    {
      "text": "John Suler. 2004. The Online Disinhibition Effect. CyberPsychology & Behavior 7, 3 (2004), 321–326. https://doi.org/10.1089/1094931041291295",
      "doi": ""
    },
    {
      "text": "Sabine Trepte, Leonard Reinecke, and Keno Juechems. 2012. The social side of gaming: How playing online computer games creates online and offline social support. Computers in Human behavior 28, 3 (2012), 832–839.",
      "doi": ""
    },
    {
      "text": "Anna K. Turnage. 2007. Email Flaming Behaviors and Organizational Conflict. Journal of Computer-Mediated Communication 13, 1 (Oct. 2007), 43–59. https://doi.org/10.1111/j.1083-6101.2007.00385.x",
      "doi": "10.1111/j.1083-6101.2007.00385.x"
    },
    {
      "text": "Selen Türkay, Jessica Formosa, Sonam Adinolf, Robert Cuthbert, and Roger Altizer. 2020. See No Evil, Hear No Evil, Speak No Evil: How Collegiate Players Define, Experience and Cope with Toxicity. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–13. https://doi.org/10.1145/3313831.3376191",
      "doi": "10.1145/3313831.3376191"
    },
    {
      "text": "Reinis Udris. 2014. Cyberbullying among high school students in Japan: Development and validation of the Online Disinhibition Scale. Computers in Human Behavior 41 (Dec. 2014), 253–261. https://doi.org/10.1016/j.chb.2014.09.036",
      "doi": ""
    },
    {
      "text": "Saulius Šukys and Aušra Janina Jansonienė. 2012. Relationship between Athletes’ Values and Moral Disengagement in Sport, and Differences Across Gender, Level and Years of Involvement. Baltic Journal of Sport and Health Sciences 1, 84 (2012), 55–61. https://doi.org/10.33607/bjshs.v1i84.300",
      "doi": ""
    }
  ]
}