{
  "doi": "10.1145/3411764.3445513",
  "title": "RCO : Investigating Social and Technological Constraints through Interactive Dance",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "We describe the research led by the performance Radical Choreographic Object (RCO). RCO is a participatory performance where the audience members respond to instructions and interactions sent to their mobile phones as well as invitations to dance from the performers.  The performance provides an experimental ground where we question how humans participate to the dance and how they relate to their mobile technologies.  Through observations and conversations with participants during several showings, we show that the participants progressed from obeying and feeling hostage of the interactions to re-interpreting and re-appropriating them. We then discuss these findings in the light of the norms and constraints that are imposed by social behaviours and by the abundance of mobile technologies. We also reflect on the alternatives that emerge where people break free from those norms, embrace eccentricity and dare to dance.",
  "authors": [
    {
      "name": "Sarah Fdili Alaoui",
      "institution": "Laboratoire de Recherche en Informatique Université Paris Saclay, INRIA, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702495",
      "orcid": "missing"
    },
    {
      "name": "Jean-Marc Matos",
      "institution": "K. Danse K. Danse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659046597",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Giorgio Agamben. 2014. Qu’est-ce qu’un dispositif?Éditions Payot & Rivages.",
      "doi": ""
    },
    {
      "text": "Sarah Fdili Alaoui, Kristin Carlson, and Thecla Schiphorst. 2014. Choreography as mediated through compositional tools for movement: Constructing a historical perspective. In Proceedings of the 2014 International Workshop on Movement and Computing. ACM, 1.",
      "doi": "10.1145/2617995.2617996"
    },
    {
      "text": "Laurence Allard. 2015. Mythologie du portable. Le Cavalier Bleu Editions.",
      "doi": ""
    },
    {
      "text": "Mariam Asad. 2018. Prefigurative Design As an Alternative Approach to Civic Engagement. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing(Jersey City, NJ, USA) (CSCW ’18). ACM, New York, NY, USA, 97–100. https://doi.org/10.1145/3272973.3272983",
      "doi": "10.1145/3272973.3272983"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2013. What is ”Critical” About Critical Design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). ACM, New York, NY, USA, 3297–3306. https://doi.org/10.1145/2470654.2466451",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). ACM, New York, NY, USA, 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Steve Benford and Gabriella Giannachi. 2011. Performing Mixed Reality. MIT Press.",
      "doi": "10.5555/2030028"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Andy Crabtree, Martin Flintham, Brendan Walker, Joe Marshall, Boriana Koleva, Stefan Rennick Egglestone, Gabriella Giannachi, Matt Adams, 2013. Performance-led research in the wild. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 3(2013), 1–22.",
      "doi": "10.1145/2491500.2491502"
    },
    {
      "text": "Claire Bishop. 2006. Participation. MIT Press.",
      "doi": ""
    },
    {
      "text": "Claire Bishop. 2012. Artificial Hells: Participatory Art and the Politics of Spectatorship. Verso.",
      "doi": ""
    },
    {
      "text": "Mark Blythe. 2017. Research Fiction: Storytelling, Plot and Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 5400–5411. https://doi.org/10.1145/3025453.3026023",
      "doi": "10.1145/3025453.3026023"
    },
    {
      "text": "Susanne Bødker and Morten Kyng. 2018. Participatory Design That Matters—Facing the Big Issues. ACM Trans. Comput.-Hum. Interact. 25, 1, Article 4 (Feb. 2018), 31 pages. https://doi.org/10.1145/3152421",
      "doi": "10.1145/3152421"
    },
    {
      "text": "Diogo Cabral, Urândia Carvalho, Joao Silva, Joao Valente, Carla Fernandes, and Nuno Correia. 2011. Multimodal video annotation for contemporary dance creation. In CHI’11 Extended Abstracts on Human Factors in Computing Systems. ACM, 2293–2298.",
      "doi": ""
    },
    {
      "text": "Erin A. Carroll, Danielle Lottridge, Celine Latulipe, Vikash Singh, and Melissa Word. 2012. Bodies in Critique: A Technological Intervention in the Dance Production Process. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’12). ACM, New York, NY, USA, 705–714. https://doi.org/10.1145/2145204.2145311",
      "doi": "10.1145/2145204.2145311"
    },
    {
      "text": "Teresa Cerratto-Pargman, Chiara Rossitto, and Louise Barkhuus. 2014. Understanding audience participation in an interactive theater performance. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational. 608–617.",
      "doi": "10.1145/2639189.2641213"
    },
    {
      "text": "Teresa Cerratto-Pargman, Chiara Rossitto, and Louise Barkhuus. 2014. Understanding audience participation in an interactive theater performance. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction Fun, Fast, Foundational - NordiCHI '14. ACM Press. https://doi.org/10.1145/2639189.2641213",
      "doi": "10.1145/2639189.2641213"
    },
    {
      "text": "Michel de Certeau. 1994. L’invention du quotidien. (1994).",
      "doi": ""
    },
    {
      "text": "Marianela Ciolfi Felice, Sarah Fdili Alaoui, and Wendy E. Mackay. 2018. Knotation: Exploring and Documenting Choreographic Processes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 448, 12 pages. https://doi.org/10.1145/3173574.3174022",
      "doi": "10.1145/3173574.3174022"
    },
    {
      "text": "Frédéric De Coninck. 2006. Privé/professionnel, Convergences et divergences. (2006).",
      "doi": ""
    },
    {
      "text": "Steven Dow, Manish Mehta, Ellie Harmon, Blair MacIntyre, and Michael Mateas. 2007. Presence and engagement in an interactive drama. In Proceedings of the SIGCHI conference on Human factors in computing systems. 1475–1484.",
      "doi": "10.1145/1240624.1240847"
    },
    {
      "text": "Ernest Edmonds and Linda Candy. 2010. Relating Theory, Practice and Evaluation in Practitioner Research. Leonardo 43, 5 (2010), 470–476.",
      "doi": ""
    },
    {
      "text": "Sarah Fdili Alaoui. 2019. Making an Interactive Dance Piece: Tensions in Integrating Technology in Art. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). ACM, New York, NY, USA, 1195–1208. https://doi.org/10.1145/3322276.3322289",
      "doi": "10.1145/3322276.3322289"
    },
    {
      "text": "Sarah Fdili Alaoui, Frederic Bevilacqua, and Christian Jacquemin. 2015. Interactive Visuals As Metaphors for Dance Movement Qualities. ACM Trans. Interact. Intell. Syst. 5, 3, Article 13 (Sept. 2015), 24 pages. https://doi.org/10.1145/2738219",
      "doi": "10.1145/2738219"
    },
    {
      "text": "Sarah Fdili Alaoui, Baptiste Caramiaux, Marcos Serrano, and Frédéric Bevilacqua. 2012. Movement Qualities As Interaction Modality. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). ACM, New York, NY, USA, 761–769. https://doi.org/10.1145/2317956.2318071",
      "doi": "10.1145/2317956.2318071"
    },
    {
      "text": "Mark Fisher. 2009. Capitalist Realism. John Hunt Publishing.",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 1975. Surveiller et punir, naissance de la prison. Gallimard, Paris.",
      "doi": ""
    },
    {
      "text": "Jules Françoise, Yves Candau, Sarah Fdili Alaoui, and Thecla Schiphorst. 2017. Designing for Kinesthetic Awareness: Revealing User Experiences Through Second-Person Inquiry. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 5171–5183. https://doi.org/10.1145/3025453.3025714",
      "doi": "10.1145/3025453.3025714"
    },
    {
      "text": "Jonas Frich, Michael Mose Biskjaer, and Peter Dalsgaard. 2018. Twenty Years of Creativity Research in Human-Computer Interaction: Current State and Future Directions. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). ACM, New York, NY, USA, 1235–1257. https://doi.org/10.1145/3196709.3196732",
      "doi": "10.1145/3196709.3196732"
    },
    {
      "text": "Erving Goffman. 1974. Interaction Ritual: Essays in Face to Face Behavior. Les Editions de Minuit.",
      "doi": ""
    },
    {
      "text": "E Goodman, E; Stolterman and R. Wakkary. 2011. Understanding Interaction Design Practices. In Proceedings of the ACM Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Greg Guest, Kathleen M MacQueen, and Emily E Namey. 2011. Applied thematic analysis. sage. https://doi.org/10.1080/08870440903194015",
      "doi": ""
    },
    {
      "text": "Julian Hanna, James Auger, and Enrique Encinas. 2017. Reconstrained Design: A Manifesto. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17 Companion). ACM, New York, NY, USA, 177–181. https://doi.org/10.1145/3064857.3079141",
      "doi": "10.1145/3064857.3079141"
    },
    {
      "text": "Heather Horst and Daniel Miller. 2020. The cell phone: An anthropology of communication. Routledge.",
      "doi": ""
    },
    {
      "text": "Mizuko Ito, Daisuke Okabe, and Ken Anderson. 2009. Portable objects in three global cities: The personalization of urban places. The reconstruction of space and time: mobile communication practices 22, 3(2009), 67–87.",
      "doi": ""
    },
    {
      "text": "Andrew Johnston. 2015. Conceptualising Interaction in Live Performance: Reflections on ’Encoded’. In Proceedings of the 2Nd International Workshop on Movement and Computing (Vancouver, British Columbia, Canada) (MOCO ’15). ACM, New York, NY, USA, 60–67. https://doi.org/10.1145/2790994.2791003",
      "doi": "10.1145/2790994.2791003"
    },
    {
      "text": "Laewoo (Leo) Kang and Steven Jackson. 2018. Collaborative Art Practice As HCI Research. Interactions 25, 2 (Feb. 2018), 78–81. https://doi.org/10.1145/3177816",
      "doi": ""
    },
    {
      "text": "Celine Latulipe and Sybil Huskey. 2008. Dance.Draw: Exquisite Interaction. In Proceedings of the 22Nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction - Volume 2 (Liverpool, United Kingdom) (BCS-HCI ’08). BCS Learning & Development Ltd., Swindon, UK, 47–51. http://dl.acm.org/citation.cfm?id=1531826.1531839",
      "doi": "10.5555/1531826.1531839"
    },
    {
      "text": "Ann Light. 2006. Adding method to meaning: A technique for exploring peoples’ experience with technology. Behaviour & Information Technology 25, 2 (2006), 175–187. https://doi.org/10.1080/01449290500331172",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Design and Intervention in the Age of ”No Alternative”. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (nov 2018), 1–21. https://doi.org/10.1145/3274378",
      "doi": "10.1145/3274378"
    },
    {
      "text": "Richard Ling. 2010. New tech, new ties: How mobile communication is reshaping social cohesion. MIT press.",
      "doi": ""
    },
    {
      "text": "Lian Loke, George Poonkhin Khut, Maggie Slattery, Catherine Truman, Lizzie Muller, and Jonathan Duckworth. 2013. Re-sensitising the body: interactive art and the Feldenkrais method. International Journal of Arts and Technology 6, 4 (2013), 339–356. https://doi.org/10.1504/IJART.2013.058283",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and Making Strange: An Embodied Approach to Movement-based Interaction Design. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 7 (April 2013), 25 pages. https://doi.org/10.1145/2442106.2442113",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Wendy E Mackay and Anne-Laure Fayard. 1997. HCI, natural science and design: a framework for triangulation across disciplines. In Proceedings of the 2nd conference on Designing interactive systems: processes, practices, methods, and techniques. ACM, 223–234.",
      "doi": "10.1145/263552.263612"
    },
    {
      "text": "Lev Manovich. 2013. Software Takes Command. Bloomsbury Academic.",
      "doi": "10.5555/2559562"
    },
    {
      "text": "John McCarthy and Peter Wright. 2007. Technology As Experience. The MIT Press.",
      "doi": "10.5555/1044942"
    },
    {
      "text": "Catherine Morris. 2006. 9 evenings reconsidered : art, theatre, and engineering, 1966. MIT List Visual Arts Center.",
      "doi": ""
    },
    {
      "text": "Nicolas Nova. [n.d.]. Smartphones. Une enquête anthropologique. Lectures, Publications reçues([n. d.]).",
      "doi": ""
    },
    {
      "text": "Marianna Obrist, Virpi Roto, Effie Lai-Chong Law, Kaisa Väänänen-Vainio-Mattila, Arnold Vermeeren, and Elizabeth Buie. 2012. Theories Behind UX Research and How They Are Used in Practice. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems (Austin, Texas, USA) (CHI EA ’12). ACM, New York, NY, USA, 2751–2754. https://doi.org/10.1145/2212776.2212712",
      "doi": ""
    },
    {
      "text": "Charles B. Owen, Alison Dobbins, and Lisa Rebenitsch. 2013. Theatre Engine. In Proceedings of International Conference on Advances in Mobile Computing & Multimedia - MoMM '13. ACM Press. https://doi.org/10.1145/2536853.2536867",
      "doi": ""
    },
    {
      "text": "Daniel Pargman, Elina Eriksson, Rob Comber, Ben Kirman, and Oliver Bates. 2018. The Futures of Computing and Wisdom. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). ACM, New York, NY, USA, 960–963. https://doi.org/10.1145/3240167.3240265",
      "doi": "10.1145/3240167.3240265"
    },
    {
      "text": "James Pierce, Phoebe Sengers, Tad Hirsch, Tom Jenkins, William Gaver, and Carl DiSalvo. 2015. Expanding and Refining Design and Criticality in HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 2083–2092. https://doi.org/10.1145/2702123.2702438",
      "doi": "10.1145/2702123.2702438"
    },
    {
      "text": "Jacques Ranciere. 2008. Le spectateur emancipé. La fabrique.",
      "doi": ""
    },
    {
      "text": "Jean-Philippe Rivière, Sarah Fdili Alaoui, Baptiste Caramiaux, and Wendy E Mackay. 2019. Capturing Movement Decomposition to Support Learning and Teaching in Contemporary Dance. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 86.",
      "doi": "10.1145/3359188"
    },
    {
      "text": "Yvonne Rogers. 2011. Interaction design gone wild: Striving for wild theory.Interactions (2011), 58–62.",
      "doi": "10.1145/1978822.1978834"
    },
    {
      "text": "Chiara Rossitto, Maria Normark, and Louise Barkhuus. 2017. Interactive Performance as a Means of Civic Dialogue. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 4850–4862.",
      "doi": "10.1145/3025453.3025897"
    },
    {
      "text": "Chris Salter. 2010. Entangled: Technology and the Transformation of Performance. MIT Press.",
      "doi": "10.5555/1805898"
    },
    {
      "text": "Thecla Schiphorst. 2005. Exhale: (Breath Between Bodies). In ACM SIGGRAPH 2005 Emerging Technologies (Los Angeles, California) (SIGGRAPH ’05). ACM, New York, NY, USA, Article 6. https://doi.org/10.1145/1187297.1187304",
      "doi": "10.1145/1187297.1187304"
    },
    {
      "text": "T Schiphorst, T Calvert, C Lee, C Welman, and S Gaudet. 1990. Tools for interaction with the creative process of composition. In Proceedings of the International Conference on Human Factors in Computing Systems (SIGCHI). ACM, 167–174.",
      "doi": "10.1145/97243.97270"
    },
    {
      "text": "D.A. Schön. 1983. The Reflective Practitioner: How professionals think in action. Temple Smith, London.",
      "doi": ""
    },
    {
      "text": "Nancy Smith, Shaowen Bardzell, and Jeffrey Bardzell. 2017. Designing for Cohabitation: Naturecultures, Hybrids, and Decentering the Human in Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 1714–1725. https://doi.org/10.1145/3025453.3025948",
      "doi": "10.1145/3025453.3025948"
    },
    {
      "text": "Atau Tanaka and R. Benjamin Knapp. 2002. Multimodal Interaction in Music Using the Electromyogram and Relative Position Sensing. In Proceedings of the 2002 Conference on New Interfaces for Musical Expression (Dublin, Ireland) (NIME ’02). National University of Singapore, Singapore, Singapore, 1–6. http://dl.acm.org/citation.cfm?id=1085171.1085183",
      "doi": "10.5555/1085171.1085183"
    },
    {
      "text": "Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. 2013. Democratizing Technology: Pleasure, Utility and Expressiveness in DIY and Maker Practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). ACM, New York, NY, USA, 2603–2612. https://doi.org/10.1145/2470654.2481360",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Robyn Taylor, Guy Schofield, John Shearer, Jayne Wallace, Peter Wright, Pierre Boulanger, and Patrick Olivier. 2011. Designing from within: humanaquarium. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1855–1864.",
      "doi": "10.1145/1978942.1979211"
    },
    {
      "text": "Sherry Turkle. 2017. Alone together: Why we expect more from technology and less from each other. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2005. What things do: Philosophical reflections on technology, agency, and design. Penn State Press.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design As a Method for Interaction Design Research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). ACM, New York, NY, USA, 493–502. https://doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An Analysis and Critique of Research Through Design: Towards a Formalization of a Research Approach. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (Aarhus, Denmark) (DIS ’10). ACM, New York, NY, USA, 310–319. https://doi.org/10.1145/1858171.1858228",
      "doi": "10.1145/1858171.1858228"
    }
  ]
}