{
  "doi": "10.1145/3411764.3445590",
  "title": "Reducing Uncertainty and Offering Comfort: Designing Technology for Coping with Interpersonal Racism",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "Ranging from subtle to overt, unintentional to systemic, navigating racism is additional everyday work for many people. Yet the needs of people who experience racism have been overlooked as a fertile ground for better technology. Through a series of workshops we call Foundational Fiction, we engaged BIPOC (Black, Indigenous, People of Color) in participatory design to identify qualities of technology that can support people coping before, during, and after a racist interaction. Participants developed storyboards for digital tools that offer advice, predict consequences, identify racist remarks and intervene, educate both targets and perpetrators about interpersonal and systemic racism, and more. In the paper we present our workshop method utilizing interactive fiction, participants’ design concepts, prevalent themes (reducing uncertainty and offering comfort), and we provide critical analysis of the complexity of technology in these contexts. This work identifies specific opportunities for exploring anti-racist social tools.",
  "tags": [
    "racism",
    "participatory design",
    "uncertainty",
    "microaggressions",
    "interactive fiction",
    "design workshops"
  ],
  "authors": [
    {
      "name": "Alexandra To",
      "institution": "Art + Design and Khoury College of Computer Science Northeastern University, United States",
      "img": "/do/10.1145/contrib-99658642648/rel-imgonly/ato_2021_squarec.jpg",
      "acmid": "99658642648",
      "orcid": "0000-0001-7298-7607"
    },
    {
      "name": "Hillary Carey",
      "institution": "School of Design Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99659547797/rel-imgonly/hillarycarey.jpeg",
      "acmid": "99659547797",
      "orcid": "missing"
    },
    {
      "name": "Geoff Kaufman",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459698057",
      "orcid": "0000-0002-0123-3792"
    },
    {
      "name": "Jessica Hammer",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658650866",
      "orcid": "0000-0003-4102-2575"
    }
  ],
  "references": [
    {
      "text": "Shana Agid. 2016. ”... it’s your project, but it’s not necessarily your work...” infrastructuring, situatedness, and designing relational practice. In Proceedings of the 14th Participatory Design Conference: Full papers-Volume 1. 81–90.",
      "doi": "10.1145/2940299.2940317"
    },
    {
      "text": "Nazanin Andalibi, Margaret E Morris, and Andrea Forte. 2018. Testing waters, sending clues: Indirect disclosures of socially stigmatized experiences on social media. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 19.",
      "doi": "10.1145/3274288"
    },
    {
      "text": "Mariam Asad. 2019. Prefigurative design as a method for research justice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–18.",
      "doi": "10.1145/3359302"
    },
    {
      "text": "Moya Bailey. 2016. Misogynoir in Medical Media: On Caster Semenya and R. Kelly. Catalyst: Feminism, theory, technoscience 2, 2 (2016), 1–31.",
      "doi": ""
    },
    {
      "text": "Moya Bailey and Trudy. 2018. On misogynoir: Citation, erasure, and plagiarism. Feminist Media Studies 18, 4 (2018), 762–768.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell. 2018. Utopias of participation: Feminism, design, and the futures. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 1(2018), 1–24.",
      "doi": "10.1145/3127359"
    },
    {
      "text": "Brendon Barnes, Ingrid Palmary, and Kevin Durrheim. 2001. The denial of racism: The role of humor, personal experience, and self-censorship. Journal of Language and Social Psychology 20, 3 (2001), 321–338.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell. 2006. No more SMS from Jesus: ubicomp, religion and techno-spiritual practices. In International Conference on Ubiquitous Computing. Springer, 141–158.",
      "doi": "10.1007/11853565_9"
    },
    {
      "text": "Ruha Benjamin. 2019. Race after technology: Abolitionist tools for the new jim code. Social Forces (2019).",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett and Daniela K Rosner. 2019. The Promise of Empathy: Design, Disability, and Knowing the” Other”. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300528"
    },
    {
      "text": "Erling Björgvinsson, Pelle Ehn, and Per-Anders Hillgren. 2012. Agonistic participatory design: working with marginalised social movements. CoDesign 8, 2-3 (2012), 127–144.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Zahra Ashktorab, Katherine Lo, and Liz Lee. 2016. Understanding Online Harassment: Definitions, Ethics, and Prevention. (2016).",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Nicole Ellison, Natasha Elliott-Deflo, and Raz Schwartz. 2019. Harassment in social virtual reality: Challenges for platform governance. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359202"
    },
    {
      "text": "Victoria Blake, Kerrie Buhagiar, Sylvia Kauer, Lena Sanci, Mariesa Nicholas, Julie Grey, 2016. Using participatory design to engage young people in the development of a new online tool to increase help-seeking. Journal of Applied Youth Studies 1, 3 (2016), 68.",
      "doi": ""
    },
    {
      "text": "Julian Bleecker and Nicolas Nova. 2009. A synchronicity: Design fictions for asynchronous urban computing. Architectural League of New York.",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-solutionist strategies: Seriously silly design fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4968–4978.",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Susanne Bødker and Morten Kyng. 2018. Participatory design that matters—Facing the big issues. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 1(2018), 1–31.",
      "doi": "10.1145/3152421"
    },
    {
      "text": "Joanna Boehnert, Bianca Elzenbaumer, and Dimeji Onafuwa. 2016. Design as Symbolic Violence. Design for Social Justice. Retrieved November 4 (2016), 2016.",
      "doi": ""
    },
    {
      "text": "Laurens Boer and Jared Donovan. 2012. Provotypes for participatory innovation. In Proceedings of the designing interactive systems conference. 388–397.",
      "doi": "10.1145/2317956.2318014"
    },
    {
      "text": "Eva Brandt and Jörn Messeter. 2004. Facilitating collaboration through design games. In Proceedings of the eighth conference on Participatory design: Artful integration: interweaving media, materials and practices-Volume 1. 121–131.",
      "doi": "10.1145/1011870.1011885"
    },
    {
      "text": "André Brock Jr. 2020. Distributed Blackness: African American Cybercultures. Vol. 9. NYU Press.",
      "doi": ""
    },
    {
      "text": "AUDRA BUCK-COLEMAN, UNIVERISTY OF MARYLAND, and MARK BIDDLE. [n.d.]. EMPLOYING PARTICIPATORY DESIGN TO INITIATE DIFFICULT DIALOGUE. ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Derya Ozcelik Buskermolen and Jacques Terken. 2012. Co-constructing stories: a participatory design technique to elicit in-depth user feedback and suggestions about design concepts. In Proceedings of the 12th Participatory Design Conference: Exploratory Papers, Workshop Descriptions, Industry Cases-Volume 2. 33–36.",
      "doi": "10.1145/2348144.2348156"
    },
    {
      "text": "Hillary Carey, Alexandra To, Jessica Hammer, and Geoff Kaufman. 2020. Fictional, Interactive Narrative as a Foundation to Talk about Racism. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference. 171–177.",
      "doi": "10.1145/3393914.3395885"
    },
    {
      "text": "Stevie Chancellor, Nazanin Andalibi, Lindsay Blackwell, David Nemer, and Wendy Moncur. 2019. Sensitive research, practice and design in HCI. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3290607.3299003"
    },
    {
      "text": "EunJeong Cheon, Stephen Tsung-Han Sher, Šelma Sabanović, and Norman Makoto Su. 2019. I Beg to Differ: Soft Conflicts in Collaborative Design Using Design Fictions. In Proceedings of the 2019 on Designing Interactive Systems Conference. 201–214.",
      "doi": "10.1145/3322276.3322350"
    },
    {
      "text": "EunJeong Cheon and Norman Makoto Su. 2018. Futuristic autobiographies: Weaving participant narratives to elicit values around robots. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. 388–397.",
      "doi": "10.1145/3171221.3171244"
    },
    {
      "text": "Merijke Coenraad, Jen Palmer, Diana Franklin, and David Weintrop. 2019. Enacting identities: Participatory design as a context for youth to reflect, project, and apply their emerging identities. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. 185–196.",
      "doi": "10.1145/3311927.3323148"
    },
    {
      "text": "Sasha Costanza-Chock. 2018. Design Justice: towards an intersectional feminist framework for design theory and practice. Proceedings of the Design Research Society(2018).",
      "doi": ""
    },
    {
      "text": "Ella Dagan, Elena Márquez Segura, Ferran Altarriba Bertran, Miguel Flores, and Katherine Isbister. 2019. Designing’True Colors’ A Social Wearable that Affords Vulnerability. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300263"
    },
    {
      "text": "EJR David, Jessica Petalio, and Maria C Crouch. 2018. Microaggressions and internalized oppression: Intrapersonal, interpersonal, and institutional impacts of “Internalized Microaggressions”. Microaggression theory: Influence and implications (2018), 29.",
      "doi": ""
    },
    {
      "text": "Bernhard Debatin, Jennette P Lovejoy, Ann-Kathrin Horn, and Brittany N Hughes. 2009. Facebook and online privacy: Attitudes, behaviors, and unintended consequences. Journal of computer-mediated communication 15, 1 (2009), 83–108.",
      "doi": ""
    },
    {
      "text": "Richard Delgado and Jean Stefancic. 2017. Critical race theory: An introduction. Vol. 20. nYU Press.",
      "doi": ""
    },
    {
      "text": "Michael A Devito, Ashley Marie Walker, Jeremy Birnholtz, Kathryn Ringland, Kathryn Macapagal, Ashley Kraus, Sean Munson, Calvin Liang, and Herman Saksono. 2019. Social Technologies for Digital Wellbeing Among Marginalized Communities. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. 449–454.",
      "doi": ""
    },
    {
      "text": "Jill P Dimond, Michaelanne Dye, Daphne LaRose, and Amy S Bruckman. 2013. Hollaback! The role of storytelling online in a social movement organization. In Proceedings of the 2013 conference on Computer supported cooperative work. 477–490.",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Christian Dindler and Ole Sejer Iversen. 2007. Fictional inquiry—design collaboration in a shared narrative space. CoDesign 3, 4 (2007), 213–234.",
      "doi": ""
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social justice-oriented interaction design: Outlining key design strategies and commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 656–671.",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "John F Dovidio, Samuel E Gaertner, Kerry Kawakami, and Gordon Hodson. 2002. Why can’t we just get along? Interpersonal biases and interracial distrust.Cultural Diversity and Ethnic Minority Psychology 8, 2 (2002), 88.",
      "doi": ""
    },
    {
      "text": "Sheena Erete, Aarti Israni, and Tawanna Dillahunt. 2018. An intersectional approach to designing in the margins. Interactions 25, 3 (2018), 66–69.",
      "doi": "10.1145/3194349"
    },
    {
      "text": "Sheena Erete, Love Nicole, Jesse Mumm, Anfal Boussayoud, and Ihudiya Finda Ogbonnaya-Ogburu. 2016. ” That Neighborhood is Sketchy!” Examining Online Conversations about Social Disorder in Transitioning Neighborhoods. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1180–1186.",
      "doi": "10.1145/2851581.2892550"
    },
    {
      "text": "Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. 2017. Social Justice and Design: Power and oppression in collaborative systems. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 117–122.",
      "doi": "10.1145/3022198.3022201"
    },
    {
      "text": "Cally Gatehouse, Matthew Wood, Jo Briggs, James Pickles, and Shaun Lawson. 2018. Troubling vulnerability: Designing with LGBT young people’s ambivalence towards hate crime reporting. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173683"
    },
    {
      "text": "Daniel T Gilbert, Matthew D Lieberman, Carey K Morewedge, and Timothy D Wilson. 2004. The peculiar longevity of things not so bad. Psychological Science 15, 1 (2004), 14–19.",
      "doi": ""
    },
    {
      "text": "Sarah A Gilbert, Casey Fiesler, Lindsay Blackwell, Michael Ann DeVito, Michaelanne Dye, Shamika Goddard, Kishonna L Gray, David Nemer, and C Estelle Smith. 2020. Public Scholarship and CSCW: Trials and Twitterations. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. 447–456.",
      "doi": "10.1145/3406865.3418589"
    },
    {
      "text": "Jack Glaser, Jay Dixit, and Donald P Green. 2002. Studying hate crime with the internet: What makes racists advocate racial violence?Journal of Social Issues 58, 1 (2002), 177–193.",
      "doi": ""
    },
    {
      "text": "Lyndsay Grant and Greg Villalobos. 2008. Designing Educational Technologies for Social Justice: A Handbook from Futurelab. Futurelab.",
      "doi": ""
    },
    {
      "text": "Joan Greenbaum. 1991. Toward participatory design: The head and the heart revisited. Aarhus University, Computer Science Department.",
      "doi": ""
    },
    {
      "text": "Jessica Guynn. 2019. Facebook while black: Users call it getting ‘Zucked,’say talking about racism is censored as hate speech. USA Today 24(2019).",
      "doi": ""
    },
    {
      "text": "Christine Marie Ortiz Guzman. 2017. equityXdesign: Leveraging Identity Development in the Creation of an Anti-Racist Equitable Design Thinking Process. Harvard University.",
      "doi": ""
    },
    {
      "text": "Jessica Hammer. 2020. Envisioning Jewish HCI. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–10.",
      "doi": ""
    },
    {
      "text": "David Hankerson, Andrea R Marshall, Jennifer Booker, Houda El Mimouni, Imani Walker, and Jennifer A Rode. 2016. Does technology have race?. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 473–486.",
      "doi": "10.1145/2851581.2892578"
    },
    {
      "text": "Alex Hanna, Emily Denton, Andrew Smart, and Jamila Smith-Loud. 2020. Towards a critical race methodology in algorithmic fairness. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency. 501–512.",
      "doi": "10.1145/3351095.3372826"
    },
    {
      "text": "Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing community-based collaborative design: Towards more equitable participatory design engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Christina N Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging low-income African American older adults in health discussions through community-based design workshops. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300823"
    },
    {
      "text": "Sabrina Hauser, Audrey Desjardins, and Ron Wakkary. 2014. Sfuture: envisioning a sustainable university campus in 2065. In Proceedings of the 2014 companion publication on Designing interactive systems. 29–32.",
      "doi": "10.1145/2598784.2602774"
    },
    {
      "text": "Vicki S Helgeson. 2015. The psychology of gender. Psychology Press.",
      "doi": ""
    },
    {
      "text": "J Howell, S Goodkind, LA Jacobs, D Branson, and L Miller. 2019. Pittsburgh’s inequality across gender and race” gender analysis white paper. City of Pittsburgh’s Gender Equity Commission (2019).",
      "doi": ""
    },
    {
      "text": "Yiqing Hua, Mor Naaman, and Thomas Ristenpart. 2020. Characterizing twitter users who engage in adversarial interactions against political candidates. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376548"
    },
    {
      "text": "Anne Marie Kanstrup and Pernille Bertelsen. 2016. Bringing New Voices to Design of Exercise Technology: participatory design with vulnerable young adults. In Proceedings of the 14th Participatory Design Conference: Full papers-Volume 1. 121–130.",
      "doi": "10.1145/2940299.2940305"
    },
    {
      "text": "Geoff Kaufman, Mary Flanagan, and Max Seidman. 2016. Creating stealth game interventions for attitude and behavior change: An” Embedded Design” model. Transactions of the Digital Games Research Association 2, 3(2016).",
      "doi": ""
    },
    {
      "text": "María Laura Ramírez Galleguillosand Aykut Coşkun. 2020. How Do I matter? A Review of the Participatory Design Practice with Less Privileged Participants. In Proceedings of the 16th Participatory Design Conference 2020-Participation (s) Otherwise-Volume 1. 137–147.",
      "doi": "10.1145/3385010.3385018"
    },
    {
      "text": "Christopher A Le Dantec and W Keith Edwards. 2008. Designs on dignity: perceptions of technology among the homeless. In Proceedings of the SIGCHI conference on human factors in computing systems. 627–636.",
      "doi": "10.1145/1357054.1357155"
    },
    {
      "text": "Ada Lerner, Helen Yuxun He, Anna Kawakami, Silvia Catherine Zeamer, and Roberto Hoyle. 2020. Privacy and Activism in the Transgender Community. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376339"
    },
    {
      "text": "Ann Light. 2011. HCI as heterodoxy: Technologies of identity and the queering of interaction with computers. Interacting with Computers 23, 5 (2011), 430–438.",
      "doi": "10.1016/j.intcom.2011.02.002"
    },
    {
      "text": "Ann Light and Rosemary Luckin. 2008. Designing for social justice: people, technology, learning. (2008).",
      "doi": ""
    },
    {
      "text": "Joseph Lindley and Paul Coulton. 2015. Back to the future: 10 years of design fiction. In Proceedings of the 2015 British HCI Conference. 210–211.",
      "doi": "10.1145/2783446.2783592"
    },
    {
      "text": "Joseph Lindley and Robert Potts. 2014. A machine learning: an example of HCI prototyping with design fiction. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational. 1081–1084.",
      "doi": "10.1145/2639189.2670281"
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell, and Jeffrey Bardzell. 2016. Reconstituting the utopian vision of making: HCI after technosolutionism. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 1390–1402.",
      "doi": "10.1145/2858036.2858506"
    },
    {
      "text": "Fannie Liu, Geoff Kaufman, and Laura Dabbish. 2019. The Effect of Expressive Biosignals on Empathy and Closeness for a Stigmatized Group Member. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–17.",
      "doi": "10.1145/3359303"
    },
    {
      "text": "Grace X Ma, Wanzhen Gao, Yin Tan, Wang G Chae, and Joanne Rhee. 2012. A community-based participatory approach to a hepatitis B intervention for Korean Americans. Progress in community health partnerships: research, education, and action 6, 1(2012), 7.",
      "doi": ""
    },
    {
      "text": "Henry Mainsah and Andrew Morrison. 2014. Participatory design through a cultural lens: insights from postcolonial theory. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts-Volume 2. 83–86.",
      "doi": "10.1145/2662155.2662195"
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Jacob McWilliams. 2016. Queering participatory design research. Cognition and Instruction 34, 3 (2016), 259–274.",
      "doi": ""
    },
    {
      "text": "Marcellus M Merritt, Gary G Bennett Jr, Redford B Williams, Christopher L Edwards, and John J Sollers III. 2006. Perceived racism and cardiovascular reactivity and recovery to personally relevant stress.Health Psychology 25, 3 (2006), 364.",
      "doi": ""
    },
    {
      "text": "Julie Minikel-Lacocque. 2013. Racism, college, and the power of words: Racial microaggressions reconsidered. American Educational Research Journal 50, 3 (2013), 432–465.",
      "doi": ""
    },
    {
      "text": "Terresa Moses and Lisa Elzey Mercer. [n.d.]. Racialized design: developing a vocabulary of shared intention in design. ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Michael D Mrazek, Jason M Chin, Toni Schmader, Kimberly A Hartson, Jonathan Smallwood, and Jonathan W Schooler. 2011. Threatened to distraction: Mind-wandering as a consequence of stereotype threat. Journal of Experimental Social Psychology 47, 6 (2011), 1243–1248.",
      "doi": ""
    },
    {
      "text": "Michael J Muller and Allison Druin. 2012. Participatory design: the third space in human–computer interaction. In Human Computer Interaction Handbook. CRC Press, 1125–1153.",
      "doi": ""
    },
    {
      "text": "Michael J Muller and Sarah Kuhn. 1993. Participatory design. Commun. ACM 36, 6 (1993), 24–28.",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Jack L Nelson and Valerie Ooka Pang. 2006. Racism, prejudice, and the social studies curriculum. The social studies curriculum: Purposes, problems, and possibilities 3 (2006), 115–135.",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of oppression: How search engines reinforce racism. nyu Press.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela DR Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Kentaro Toyama, and Tawanna R Dillahunt. 2019. Towards an effective digital literacy intervention to assist returning citizens with job search. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300315"
    },
    {
      "text": "Stefanie A Ollenburg. 2019. A Futures-Design-Process Model for Participatory Futures. Journal of Futures Studies 23, 4 (2019), 51–62.",
      "doi": ""
    },
    {
      "text": "Nassim Parvin. 2018. Doing justice to stories: on ethics and politics of digital storytelling. Engaging Science, Technology, and Society 4 (2018), 515–534.",
      "doi": ""
    },
    {
      "text": "Yolanda A Rankin and Jakita O Thomas. 2019. Straighten up and fly right: rethinking intersectionality in HCI research. interactions 26, 6 (2019), 64–68.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Kandrea Wade, Caitlin Lustig, and Jed R Brubaker. 2020. How We’ve Taught Algorithms to See Identity: Constructing Race and Gender in Image Databases for Facial Analysis. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–35.",
      "doi": "10.1145/3392866"
    },
    {
      "text": "Ari Schlesinger, W Keith Edwards, and Rebecca E Grinter. 2017. Intersectional HCI: Engaging identity through gender, race, and class. In Proceedings of the 2017 CHI conference on human factors in computing systems. 5412–5427.",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "James Jackson Sela Panapasa, Cleopatra Caldwell, Steve Heeringa, James McNally, David Williams, Debra Coral, Leafa Taumoepeau, Louisa Young, Setafano Young, and Saia Fa’Asisila. 2012. Community-based participatory research approach to evidence-based research: lessons from the Pacific Islander American Health Study. Progress in community health partnerships: research, education, and action 6, 1(2012), 53.",
      "doi": ""
    },
    {
      "text": "Daniel G Solórzano and Tara J Yosso. 2002. Critical race methodology: Counter-storytelling as an analytical framework for education research. Qualitative inquiry 8, 1 (2002), 23–44.",
      "doi": ""
    },
    {
      "text": "Jesse A Steinfeldt, Brad D Foltz, Jennifer K Kaladow, Tracy N Carlson, Louis A Pagano Jr, Emily Benton, and M Clint Steinfeldt. 2010. Racism in the electronic age: Role of online forums in expressing racial attitudes about American Indians.Cultural Diversity and Ethnic Minority Psychology 16, 3(2010), 362.",
      "doi": ""
    },
    {
      "text": "Bruce Sterling. 2009. COVER STORY Design fiction. interactions 16, 3 (2009), 20–24.",
      "doi": ""
    },
    {
      "text": "Angelika Strohmayer, Jenn Clamen, and Mary Laing. 2019. Technologies for Social Justice: Lessons from Sex Workers on the Front Lines. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300882"
    },
    {
      "text": "Derald Wing Sue. 2010. Microaggressions in everyday life: Race, gender, and sexual orientation. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Derald Wing Sue, Christina M Capodilupo, Gina C Torino, Jennifer M Bucceri, Aisha Holder, Kevin L Nadal, and Marta Esquilin. 2007. Racial microaggressions in everyday life: implications for clinical practice.American psychologist 62, 4 (2007), 271.",
      "doi": ""
    },
    {
      "text": "Mamello Thinyane, Karthik Bhat, Lauri Goldkind, and Vikram Kamath Cannanure. 2018. Critical participatory design: reflections on engagement and empowerment in a case of a community based organization. In Proceedings of the 15th Participatory Design Conference: Full Papers-Volume 1. 1–10.",
      "doi": "10.1145/3210586.3210601"
    },
    {
      "text": "Alexandra To, Wenxia Sweeney, Jessica Hammer, and Geoff Kaufman. 2020. ” They Just Don’t Get It”: Towards Social Technologies for Coping with Interpersonal Racism. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–29.",
      "doi": "10.1145/3392828"
    },
    {
      "text": "Jasper Tran O’Leary, Sara Zewde, Jennifer Mankoff, and Daniela K Rosner. 2019. Who gets to future? Race, representation, and design methods in Africatown. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300791"
    },
    {
      "text": "Peter Troxler and Beate Kuhnt. 2007. Future workshops. The unthinkable and how to make it happen. Hands-on knowledge co-creation and sharing: Practical methods & techniques (2007), 483–495.",
      "doi": ""
    },
    {
      "text": "Manfred Tscheligi, Stephanie Houde, Raghu Kolli, Aaron Marcus, Michael Muller, and Kevin Mullet. 1995. Creative prototyping tools: What interaction designers really need to produce advanced user interface concepts. In Conference companion on Human factors in computing systems. 170–171.",
      "doi": "10.1145/223355.223485"
    },
    {
      "text": "Sepehr Vakil, Maxine McKinney de Royston, Na’ilah Suad Nasir, and Ben Kirshner. 2016. Rethinking race and power in design-based research: Reflections from the field. Cognition and Instruction 34, 3 (2016), 194–209.",
      "doi": ""
    },
    {
      "text": "John Vines, Róisín McNaney, Stephen Lindsay, Jayne Wallace, and John McCarthy. 2014. Special topic: Designing for and with vulnerable people. interactions 21, 1 (2014), 44–46.",
      "doi": ""
    },
    {
      "text": "Dhaval Vyas and Tawanna Dillahunt. 2017. Everyday resilience: Supporting resilient strategies among low socioeconomic status communities. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–21.",
      "doi": "10.1145/3134740"
    },
    {
      "text": "Marisol Wong-Villacres, Arkadeep Kumar, Aditya Vishwanath, Naveena Karusala, Betsy DiSalvo, and Neha Kumar. 2018. Designing for intersections. In Proceedings of the 2018 Designing Interactive Systems Conference. 45–58.",
      "doi": "10.1145/3196709.3196794"
    },
    {
      "text": "Ziang Xiao, Michelle X Zhou, Wenxi Chen, Huahai Yang, and Changyan Chi. 2020. If I Hear You Correctly: Building and Evaluating Interview Chatbots with Active Listening Skills. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376131"
    },
    {
      "text": "Scott Young and Celina Brownotter. 2018. Toward a More Just Library: Participatory Design with Native American Students. Weave: Journal of Library User Experience 1, 9 (2018).",
      "doi": ""
    }
  ]
}