{
  "doi": "10.1145/3411764.3445079",
  "title": "Blending into Everyday Life: Designing a Social Media-Based Peer Support System",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Peer support through social media has been shown to have significant potential to improve health care outcomes. Despite this, very little is understood about how to design a social media-based peer support system. We use the model of unplatformed design to structure a multi-phase design process of a WhatsApp-based peer support system, with and for participants undergoing extreme weight loss as part of a health care intervention into diabetes management. From a mixed-methods evaluation of a three-month deployment of the system and reflections upon the design process we explore the value of the model in facilitating the expression of authentic peer support, and identify how the unique characteristics of unplatformed design allowed for the creation of a peer support system that was responsive to participants’ existing everyday use of social media technologies.",
  "authors": [
    {
      "name": "Daniel Lambton-Howard",
      "institution": "Open Lab Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366417",
      "orcid": "missing"
    },
    {
      "name": "Emma Simpson",
      "institution": "Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659950375",
      "orcid": "missing"
    },
    {
      "name": "Kim Quimby",
      "institution": "George Alleyne Chronic Disease Research Centre The University of the West Indies, Barbados",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702392",
      "orcid": "missing"
    },
    {
      "name": "Ahmed Kharrufa",
      "institution": "Open Lab Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81479662079",
      "orcid": "missing"
    },
    {
      "name": "Heidi Hoi Ming Ng",
      "institution": "Action Lab Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702160",
      "orcid": "missing"
    },
    {
      "name": "Emma Foster",
      "institution": "Institute of Health and Society Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658724271",
      "orcid": "missing"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Action Lab Monash University, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "James E. Aikens, Kara Zivin, Ranak Trivedi, and John D. Piette. 2014. Diabetes self-management support using mHealth and enhanced informal caregiving. J. Diabetes Complications 28, 2 (2014), 171–176. DOI: https://doi.org/10.1016/j.jdiacomp.2013.11.008",
      "doi": ""
    },
    {
      "text": "Terrance Albrecht and Mara Adelman. 1987. Communicating Social Support: A Theoretical Perspective. In Communicating Social Support.",
      "doi": ""
    },
    {
      "text": "K. Bynoe, N. Unwin, C. Taylor, M. M. Murphy, L. Bartholomew, A. Greenidge, M. Abed, S. Jeyaseelan, C. Cobelli, C. Dalla Man, and R. Taylor. 2019. Inducing remission of Type 2 diabetes in the Caribbean: findings from a mixed methods feasibility study of a low-calorie liquid diet-based intervention in Barbados. Diabet. Med. (2019), 1–9. DOI: https://doi.org/10.1111/dme.14096",
      "doi": ""
    },
    {
      "text": "Hanna Celina, Ahmed Kharrufa, Anne Preston, Rob Comber, and Patrick Olivier. 2016. SOLE Meets MOOC: Designing Infrastructure for Online Self-Organised Learning with a Social Mission. Dis 2016 (2016), 484–496. DOI: https://doi.org/10.1145/2901790.2901848",
      "doi": ""
    },
    {
      "text": "Qiang Chen, Junyan Hu, Wei Zhang, Richard Evans, Xiaoyue Ma, and Qiang Chen. 2020. Employee use of public social media: theories , constructs and conceptual frameworks frameworks. Behav. Inf. Technol. 0, 0 (2020), 1–25. DOI: https://doi.org/10.1080/0144929X.2020.1733089",
      "doi": ""
    },
    {
      "text": "Taridzo Chomutare, Naoe Tatara, Eirik Årsand, and Gunnar Hartvigsen. 2013. Designing a diabetes mobile application with social network support. Stud. Health Technol. Inform. 188, 1 (2013), 58–64. DOI: https://doi.org/10.3233/978-1-61499-266-0-58",
      "doi": ""
    },
    {
      "text": "Alexander P. Cotter, Nefertiti Durant, April A. Agne, and Andrea L. Cherrington. 2014. Internet interventions to support lifestyle modification for diabetes management: A systematic review of the evidence. J. Diabetes Complications 28, 2 (2014), 243–251. DOI: https://doi.org/10.1016/j.jdiacomp.2013.07.003",
      "doi": ""
    },
    {
      "text": "Neil S. Coulson. 2005. Receiving social support online: An analysis of a computer-mediated support group for individuals living with irritable bowel syndrome. Cyberpsychology Behav. 8, 6 (2005), 580–584. DOI: https://doi.org/10.1089/cpb.2005.8.580",
      "doi": ""
    },
    {
      "text": "Jacquelyn Crane and Frederick G. Crane. 2010. Optimal nonverbal communications strategies physicians should engage in to promote positive clinical outcomes. Health Mark. Q. (2010). DOI: https://doi.org/10.1080/07359683.2010.495300",
      "doi": ""
    },
    {
      "text": "Henk A. Van Dam, Frans G. Van Der Horst, Lut Knoops, Richard M. Ryckman, Harry F.J.M. Crebolder, and Bart H.W. Van Den Borne. 2005. Social support in diabetes: A systematic review of controlled intervention studies. Patient Educ. Couns. 59, 1 (2005), 1–12. DOI: https://doi.org/10.1016/j.pec.2004.11.001",
      "doi": ""
    },
    {
      "text": "Cindy Lee Dennis. 2003. Peer support within a health care context: A concept analysis. Int. J. Nurs. Stud. (2003). DOI: https://doi.org/10.1016/S0020-7489(02)00092-5",
      "doi": ""
    },
    {
      "text": "International Diabetes Federation. 2017. IDF Diabetes Atlas Eighth edition 2017. DOI: https://doi.org/10.1016/S0140-6736(16)31679-8",
      "doi": ""
    },
    {
      "text": "Howard S. Friedman. 1979. Nonverbal Communication Between Patients and Medical Practitioners. J. Soc. Issues (1979). DOI: https://doi.org/10.1111/j.1540-4560.1979.tb00790.x",
      "doi": ""
    },
    {
      "text": "Valerie Gavrila, Ashley Garrity, Emily Hirschfeld, Breann Edwards, and Joyce M. Lee. 2019. Peer Support Through a Diabetes Social Media Community. J. Diabetes Sci. Technol. 13, 3 (2019), 493–497. DOI: https://doi.org/10.1177/1932296818818828",
      "doi": ""
    },
    {
      "text": "Russell E. Glasgow, Deanna Kurz, Diane King, Jennifer M. Dickman, Andrew J. Faber, Eve Halterman, Tim Woolley, Deborah J. Toobert, Lisa A. Strycker, Paul A. Estabrooks, Diego Osuna, and Debra Ritzwoller. 2012. Twelve-month outcomes of an Internet-based diabetes self-management support program. Patient Educ. Couns. 87, 1 (2012), 81–92. DOI: https://doi.org/10.1016/j.pec.2011.07.024",
      "doi": ""
    },
    {
      "text": "Shefali Haldar, Sonali R. Mishra, Maher Khelifi, Ari H. Pollack, and Wanda Pratt. 2017. Opportunities and design considerations for peer support in a hospital setting. Conf. Hum. Factors Comput. Syst. - Proc. 2017-May, (2017), 867–879. DOI: https://doi.org/10.1145/3025453.3026040",
      "doi": "10.1145/3025453.3026040"
    },
    {
      "text": "Christina Howitt, Ian R. Hambleton, Angela M.C. Rose, Anselm Hennis, T. Alafia Samuels, Kenneth S. George, and Nigel Unwin. 2015. Social distribution of diabetes, hypertension and related risk factors in Barbados: A cross-sectional study. BMJ Open (2015). DOI: https://doi.org/10.1136/bmjopen-2015-008869",
      "doi": ""
    },
    {
      "text": "Kevin O. Hwang, Allison J. Ottenbacher, Angela P. Green, M. Roseann Cannon-Diehl, Oneka Richardson, Elmer V. Bernstam, and Eric J. Thomas. 2010. Social support in an Internet weight loss community. Int. J. Med. Inform. 79, 1 (2010), 5–13. DOI: https://doi.org/10.1016/j.ijmedinf.2009.10.003",
      "doi": ""
    },
    {
      "text": "Dmitri Katz, Nick Dalton, and Blaine Price. 2015. Failing the challenge: Diabetes apps & long-term daily adoption. Int. Conf. Adv. Technol. Treat. Diabetes 8th, (2015).",
      "doi": ""
    },
    {
      "text": "Clare Kelly. 2016. A pathway out of the Caribbean's diabetes crisis. VIrgin Unite. Retrieved January 24, 2020 from https://www.virgin.com/virgin-unite/pathway-out-caribbeans-diabetes-crisis",
      "doi": ""
    },
    {
      "text": "Robert E. Kraut and Paul Resnick. 2018. Building Successful Online Communities. DOI: https://doi.org/10.7551/mitpress/8472.001.0001",
      "doi": ""
    },
    {
      "text": "Daniel Lambton-Howard, Robert Anderson, Kyle Montague, Andrew Garbett, Shaun Hazeldine, Carlos Alvarez, John A. Sweeney, Patrick Olivier, and Ahmed Kharrufa. 2019. WhatFutures: Designing Large-Scale Engagements on WhatsApp. CHI Conf. Hum. Factors Comput. Syst. Proc. (CHI 2019), May 4–9, 2019, Glas. Scotl. UK. ACM, New York, NY, USA, 14 (2019), 1–14. DOI: https://doi.org/10.1145/3290605.3300389",
      "doi": ""
    },
    {
      "text": "Daniel Lambton-Howard, Jieun Kiaer, and Ahmed Kharrufa. 2020. ‘ Social media is their space ’: student and teacher use and perception of features of social media in language education social media in language education. Behav. Inf. Technol. 0, 0 (2020), 1–16. DOI: https://doi.org/10.1080/0144929X.2020.1774653",
      "doi": ""
    },
    {
      "text": "Daniel Lambton-Howard, Patrick Olivier, Vasilis Vlachokyriakos, Hanna Celina, and Ahmed Kharrufa. 2020. Unplatformed Design: A Model for Appropriating Social Media for Coordinated Participation. CHI Conf. Hum. Factors Comput. Syst. Proc. (CHI 2020), April 25-30, 2020, Honolulu, Hawaii, USA. ACM, New York, NY, USA, 14 (2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Michael EJ Lean, Wilma S. Leslie, Alison C. Barnes, Naomi Brosnahan, George Thom, Louise McCombie, Carl Peters, Sviatlana Zhyzhneuskaya, Ahmad Al-Mrabeh, Kieren G. Hollingsworth, Angela M. Rodrigues, Lucia Rehackova, Ashley J. Adamson, Falko F. Sniehotta, John C. Mathers, Hazel M. Ross, Yvonne McIlvenna, Renae Stefanetti, Michael Trenell, Paul Welsh, Sharon Kean, Ian Ford, Alex McConnachie, Naveed Sattar, and Roy Taylor. 2018. Primary care-led weight management for remission of type 2 diabetes (DiRECT): an open-label, cluster-randomised trial. Lancet 391, 10120 (2018), 541–551. DOI: https://doi.org/10.1016/S0140-6736(17)33102-1",
      "doi": ""
    },
    {
      "text": "Susanne Lindberg, Pontus Wärnestål, Jens Nygren, and Petra Svedberg. 2014. Designing Digital Peer Support for children: Design patterns for social interaction. ACM Int. Conf. Proceeding Ser. (2014), 47–56. DOI: https://doi.org/10.1145/2593968.2593972",
      "doi": "10.1145/2593968.2593972"
    },
    {
      "text": "Xiao Ma, Jeff Hancock, and Mor Naaman. 2016. Anonymity, intimacy and self-disclosure in social media. Conf. Hum. Factors Comput. Syst. - Proc. (2016), 3857–3869. DOI: https://doi.org/10.1145/2858036.2858414",
      "doi": "10.1145/2858036.2858414"
    },
    {
      "text": "Haley MacLeod, Ben Jelen, Annu Prabhakar, Lora Oehlberg, Katie Siek, and Kay Connelly. 2017. Asynchronous Remote Communities (ARC) for Researching Distributed Populations. EAI Endorsed Trans. Pervasive Heal. Technol. 3, 11 (2017), 152898. DOI: https://doi.org/10.4108/eai.18-7-2017.152898",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth D. Mynatt, Patricia R. Davidson, and Daniel Greenblatt. 2008. MAHI: Investigation of social scaffolding for reflective thinking in diabetes management. Conf. Hum. Factors Comput. Syst. - Proc. (2008), 477–486. DOI: https://doi.org/10.1145/1357054.1357131",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "H. Garth McKay, Russell E. Glasgow, Edward G. Feil, Shawn M. Boles, and Manuel, Jr. Barrera. 2002. Internet-based diabetes self-management and support: Initial outcomes from the Diabetes Network project. Rehabil. Psychol. 47, 1 (2002), 31–48. DOI: https://doi.org/10.1037/0090-5550.47.1.31",
      "doi": ""
    },
    {
      "text": "J. A. Naslund, K. A. Aschbrenner, L. A. Marsch, and S. J. Bartels. 2016. The future of mental health care: Peer-To-peer support and social media. Epidemiol. Psychiatr. Sci. (2016). DOI: https://doi.org/10.1017/S2045796015001067",
      "doi": ""
    },
    {
      "text": "John A. Naslund, Stuart W. Grande, Kelly A. Aschbrenner, and Glyn Elwyn. 2014. Naturally occurring peer support through social media: The experiences of individuals with severe mental illness using you tube. PLoS One (2014). DOI: https://doi.org/10.1371/journal.pone.0110171",
      "doi": ""
    },
    {
      "text": "Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It's not that i don't have problems, i'm just not putting them on facebook: Challenges and opportunities in using online social networks for health. Proc. ACM Conf. Comput. Support. Coop. Work. CSCW (2011), 341–350. DOI: https://doi.org/10.1145/1958824.1958876",
      "doi": ""
    },
    {
      "text": "Kathleen O'Leary, Stephen M. Schueller, Jacob O. Wobbrock, and Wanda Pratt. 2018. “Suddenly, we got to become therapists for each other.” (2018), 1–14. DOI: https://doi.org/10.1145/3173574.3173905",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "Katie O'Leary, Arpita Bhattacharya, Sean A. Munson, Jacob O. Wobbrock, and Wanda Pratt. 2017. Design opportunities for mental health peer support technologies. Proc. ACM Conf. Comput. Support. Coop. Work. CSCW (2017), 1470–1484. DOI: https://doi.org/10.1145/2998181.2998349",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "Jenny Preece. 2000. Online communities: Designing usability and supporting socialbilty. John Wiley & Sons, Inc.",
      "doi": "10.5555/517688"
    },
    {
      "text": "Jenny Preece. 2001. Sociability and usability in online communities: Determining and measuring success. Behav. Inf. Technol. (2001). DOI: https://doi.org/10.1080/01449290110084683",
      "doi": ""
    },
    {
      "text": "Stephen Purpura, Victoria Schwanda, Kaiton Williams, William Stubler, and Phoebe Sengers. 2011. Fit4life: The design of a persuasive technology promoting healthy behavior and ideal weight. Proc. 2011 Annu. Conf. Hum. factors Comput. Syst. - CHI ’11 (2011), 423. DOI: https://doi.org/10.1145/1978942.1979003",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Mary Jane Rotheram-Borus, Mark Tomlinson, Margaret Gwegwe, W. Scott Comulada, Neal Kaufman, and Marion Keim. 2012. Diabetes Buddies: Peer Support Through a Mobile Phone Buddy System. Diabetes Educ. 38, 3 (2012), 357–365. DOI: https://doi.org/10.1177/0145721712444617",
      "doi": ""
    },
    {
      "text": "SimilarWeb. The Most Popular Messaging App in Every Country. Retrieved September 13, 2018 from https://www.similarweb.com/blog/popular-messaging-apps-by-country",
      "doi": ""
    },
    {
      "text": "Joni L. Strom and Leonard E. Egede. 2012. The Impact of social support on outcomes in adult patients with type 2 diabetes: A systematic review. Current Diabetes Reports. DOI: https://doi.org/10.1007/s11892-012-0317-0",
      "doi": ""
    },
    {
      "text": "Roy Taylor. 2013. Type 2 diabetes: Etiology and reversibility. Diabetes Care. DOI: https://doi.org/10.2337/dc12-1805",
      "doi": ""
    },
    {
      "text": "Mamello Thinyane, Karthik Bhat, Lauri Goldkind, and Vikram Kamath Cannanure. 2018. Critical participatory design: Reflections on Engagement and Empowerment in a case of a Community Based Organization Mamello. Proc. 15th Particip. Des. Conf. Full Pap. - PDC ’18 (2018).",
      "doi": "10.1145/3210586.3210601"
    }
  ]
}