{
  "doi": "10.1145/3411764.3445367",
  "title": "RadarNet: Efficient Gesture Recognition Technique Utilizing a Miniature Radar Sensor",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Gestures are a promising candidate as an input modality for ambient computing where conventional input modalities such as touchscreens are not available. Existing works have focused on gesture recognition using image sensors. However, their cost, high battery consumption, and privacy concerns made cameras challenging as an always-on solution. This paper introduces an efficient gesture recognition technique using a miniaturized 60 GHz radar sensor. The technique recognizes four directional swipes and an omni-swipe using a radar chip (6.5 × 5.0 mm) integrated into a mobile phone. We developed a convolutional neural network model efficient enough for battery powered and computationally constrained processors. Its model size and inference time is less than 1/5000 compared to an existing gesture recognition technique using radar. Our evaluations with large scale datasets consisting of 558,000 gesture samples and 3,920,000 negative samples demonstrated our algorithm’s efficiency, robustness, and readiness to be deployed outside of research laboratories.",
  "authors": [
    {
      "name": "Eiji Hayashi",
      "institution": "ATAP Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702249",
      "orcid": "missing"
    },
    {
      "name": "Jaime Lien",
      "institution": "ATAP Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430608859",
      "orcid": "missing"
    },
    {
      "name": "Nicholas Gillian",
      "institution": "ATAP Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959375957",
      "orcid": "missing"
    },
    {
      "name": "Leonardo Giusti",
      "institution": "ATAP Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81309485964",
      "orcid": "missing"
    },
    {
      "name": "Dave Weber",
      "institution": "ATAP Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701884",
      "orcid": "missing"
    },
    {
      "name": "Jin Yamanaka",
      "institution": "Advanced Technology and Projects Google LLC, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702623",
      "orcid": "missing"
    },
    {
      "name": "Lauren Bedal",
      "institution": "ATAP Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702589",
      "orcid": "missing"
    },
    {
      "name": "Ivan Poupyrev",
      "institution": "ATAP Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100593278",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amazon. 2014. Echo. https://www.amazon.com/smart-home-devices/b?ie=UTF8&node=9818047011. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Apple. 2018. Siri. https://www.apple.com/siri/. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Richard A Bolt. 1980. “Put-that-there” Voice and gesture at the graphics interface. In Proceedings of the 7th annual conference on Computer graphics and interactive techniques. 262–270.",
      "doi": "10.1145/800250.807503"
    },
    {
      "text": "Alex Butler, Shahram Izadi, and Steve Hodges. 2008. SideSight: multi-” touch” interaction around small devices. In Proceedings of the 21st annual ACM symposium on User interface software and technology. 201–204.",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Kelly E Caine, Arthur D Fisk, and Wendy A Rogers. 2006. Benefits and privacy concerns of a home equipped with a visual sensing system: A perspective from older adults. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. SAGE Publications Sage CA: Los Angeles, CA, 180–184.",
      "doi": ""
    },
    {
      "text": "Ting-Han Chen, Sok-Ian Sou, and Yinman Lee. 2019. WiTrack: Human-to-Human Mobility Relationship Tracking in Indoor Environments Based on Spatio-Temporal Wireless Signal Strength(Proceedings of the IEEE International Conference on Dependable, Autonomic and Secure Computing, Vol. 00). 788–795.",
      "doi": ""
    },
    {
      "text": "Jae-Woo Choi, Si-Jung Ryu, and Jong-Hwan Kim. 2019. Short-range radar based real-time hand gesture recognition using LSTM encoder. IEEE Access 7(2019), 33610–33618.",
      "doi": ""
    },
    {
      "text": "Gabe Cohn, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. Humantenna: using the body as an antenna for real-time whole-body interaction(Proceedings of the SIGCHI Conference on Human Factors in Computing Systems). 1901–1910.",
      "doi": ""
    },
    {
      "text": "Facebook. 2012. Oculus. https://www.oculus.com/. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Google. 2015. TensorFlow Lite. https://www.tensorflow.org/lite. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Google. 2016. Google Assistant. https://assistant.google.com/. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Google. 2016. Nest Home Hub. https://store.google.com/product/google_nest_hub. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Google. 2017. Nest Thermostat. https://nest.com/. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Google. 2019. Jacquard. https://atap.google.com/jacquard/. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Sidhant Gupta, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. Soundwave: using the doppler effect to sense gestures(Proceedings of the SIGCHI Conference on Human Factors in Computing Systems). 1911–1914.",
      "doi": ""
    },
    {
      "text": "Chris Harrison and Scott E Hudson. 2009. Abracadabra: wireless, high-precision, and unpowered finger input for very small mobile devices(Proceedings of the 22nd annual ACM symposium on User interface software and technology). 121–124.",
      "doi": ""
    },
    {
      "text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep Residual Learning for Image Recognition. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR).",
      "doi": ""
    },
    {
      "text": "Marigo Heijboer, Elise Hoven, Bert Bongers, and Saskia Bakker. 2016. Facilitating Peripheral Interaction: Design and Evaluation of Peripheral Interaction for a Gesture-Based Lighting Control with Multimodal Feedback. 20, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Andrew G Howard, Menglong Zhu, Bo Chen, Dmitry Kalenichenko, Weijun Wang, Tobias Weyand, Marco Andreetto, and Hartwig Adam. 2017. Mobilenets: Efficient convolutional neural networks for mobile vision applications. arXiv preprint arXiv:1704.04861(2017).",
      "doi": ""
    },
    {
      "text": "Infenion. 2016. Infenion XENSIV. https://www.infineon.com/cms/en/product/sensor/radar-sensors/. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Bryce Kellogg, Vamsi Talla, and Shyamnath Gollakota. 2014. Bringing gesture recognition to all devices. In 11th {USENIX} Symposium on Networked Systems Design and Implementation ({NSDI} 14). 303–316.",
      "doi": ""
    },
    {
      "text": "Cem Keskin, Furkan Kıraç, Yunus Emre Kara, and Lale Akarun. 2012. Computer Vision – ECCV 2012, 12th European Conference on Computer Vision, Florence, Italy, October 7-13, 2012, Proceedings, Part VI. (2012), 852–863.",
      "doi": ""
    },
    {
      "text": "Jaime Lien, Nicholas Gillian, M. Emre Karagozler, Patrick Amihood, Carsten Schwesig, Erik Olson, Hakim Raja, and Ivan Poupyrev. 2016. Soli: ubiquitous gesture sensing with millimeter wave radar. ACM Transactions on Graphics (TOG) 35, 4, 142.",
      "doi": "10.1145/2897824.2925953"
    },
    {
      "text": "Microsoft. 2010. Kinect. https://developer.microsoft.com/en-us/windows/kinect/. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2019. Hololens: Handtracking. https://microsoft.github.io/MixedRealityToolkit-Unity/Documentation/Input/HandTracking.html. Retrieved September 10, 2020.",
      "doi": ""
    },
    {
      "text": "GRS Murthy and RS Jadon. 2009. A review of vision based hand gestures recognition. International Journal of Information Technology and Knowledge Management 2, 2 (2009), 405–410.",
      "doi": ""
    },
    {
      "text": "I. Nasr, R. Jungmaier, A. Baheti, D. Noppeney, J. S. Bal, M. Wojnowski, E. Karagozler, H. Raja, J. Lien, I. Poupyrev, and S. Trotta. 2016. A Highly Integrated 60 GHz 6-Channel Transceiver With Antenna in Package for Smart Sensing and Short-Range Communications. IEEE Journal of Solid-State Circuits 51, 9 (2016), 2066–2076. https://doi.org/10.1109/JSSC.2016.2585621",
      "doi": ""
    },
    {
      "text": "Antti Pirhonen, Stephen Brewster, and Christopher Holguin. 2002. Gestural and audio metaphors as a means of control for mobile devices. In Proceedings of the SIGCHI conference on Human factors in computing systems. 291–298.",
      "doi": "10.1145/503376.503428"
    },
    {
      "text": "Qifan Pu, Sidhant Gupta, Shyamnath Gollakota, and Shwetak Patel. 2013. Whole-home gesture recognition using wireless signals(Proceedings of the 13th Annual International Conference on Mobile Computing and Networking). 27–38.",
      "doi": ""
    },
    {
      "text": "Toby Sharp, Cem Keskin, Duncan Robertson, Jonathan Taylor, Jamie Shotton, David Kim, Christoph Rhemann, Ido Leichter, Alon Vinnikov, Yichen Wei, 2015. Accurate, robust, and flexible real-time hand tracking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 3633–3642.",
      "doi": "10.1145/2702123.2702179"
    },
    {
      "text": "Christian Szegedy, Sergey Ioffe, Vincent Vanhoucke, and Alex Alemi. 2016. Inception-v4, inception-resnet and the impact of residual connections on learning. arXiv preprint arXiv:1602.07261(2016).",
      "doi": ""
    },
    {
      "text": "Sheng Tan and Jie Yang. 2016. WiFinger: leveraging commodity WiFi for fine-grained finger gesture recognition(Proceedings of the 17th International Symposium on Mobile Ad Hoc Networking and Computing). 201–210.",
      "doi": ""
    },
    {
      "text": "S. Trotta, D. Weber, R. W. Jungmaier, A. Baheti, J. Lien, D. Noppeney, M. Tabesh, C. Rumpler, M. Aichner, S. Albel, J. S. Bal, and I. Poupyrev. 2021 (to appear). SOLI: A Tiny Device for a New Human Machine Interface. IEEE International Solid-State Circuits Conference (2021 (to appear)).",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu. 2012. Nomadic gestures: A technique for reusing gesture commands for frequent ambient interactions. Journal of Ambient Intelligence and Smart Environments 4, 2(2012), 79–93.",
      "doi": "10.5555/2350758.2350765"
    },
    {
      "text": "Saiwen Wang, Jie Song, Jaime Lien, Ivan Poupyrev, and Otmar Hilliges. 2016. Interacting with soli: Exploring fine-grained dynamic gesture recognition in the radio-frequency spectrum. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 851–860.",
      "doi": "10.1145/2984511.2984565"
    },
    {
      "text": "Mark Weiser and John Seely Brown. 1997. The coming age of calm technology. In Beyond calculation. Springer, 75–85.",
      "doi": "10.5555/504928.504934"
    },
    {
      "text": "Eric Zeng, Shrirang Mare, and Franziska Roesner. 2017. End User Security and Privacy Concerns with Smart Homes. In Thirteenth Symposium on Usable Privacy and Security (SOUPS 2017). USENIX Association, Santa Clara, CA, 65–80.",
      "doi": ""
    },
    {
      "text": "Fan Zhang, Valentin Bazarevsky, Andrey Vakunov, Andrei Tkachenka, George Sung, Chuo-Ling Chang, and Matthias Grundmann. 2020. MediaPipe Hands: On-device Real-time Hand Tracking. arXiv preprint arXiv:2006.10214(2020).",
      "doi": ""
    }
  ]
}