{
  "doi": "10.1145/3411764.3445485",
  "title": "Us and Them (and It): Social Orientation, Privacy Concerns, and Expected Use of Pandemic-Tracking Apps in the United States",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2021,
  "badges": [],
  "abstract": "The deployment of technologies to track and mitigate the spread COVID-19 has surfaced tensions between individual autonomy and the collective good. These tensions reflect a conflict between two central concerns: (i) effectively controlling the spread of the pandemic and (ii) respecting individual rights, values, and freedoms. We explored these tensions in an online experiment (n = 389) designed to identify the influence of social orientation and communicative framing on perceptions and expected use of pandemic-tracking apps. We found that social orientation is a statistically significant predictor of app perception and expected use, with collectivist social orientation associated with higher levels and individualist social orientation with lower levels for both aspects. We found interactions between social orientation and communicative framing, as well as a connection between privacy concerns and expected duration of app use. Our findings hold important implications for the design, deployment, and adoption of technology for the public good. Shaping the post-pandemic social contract requires considering the long-term sociocultural impact of these technological solutions.",
  "authors": [
    {
      "name": "John S. Seberger",
      "institution": "Informatics Indiana University, United States",
      "img": "/do/10.1145/contrib-99659701762/rel-imgonly/jss.png",
      "acmid": "99659701762",
      "orcid": "missing"
    },
    {
      "name": "Sameer Patil",
      "institution": "School of Informatics, Computing, and Engineering Indiana University, United States",
      "img": "/do/10.1145/contrib-81100485151/rel-imgonly/81100485151.jpg",
      "acmid": "81100485151",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Solomon O. Abiola, Eric Portman, Henry Kautz, and E. Ray Dorsey. 2015. Node view: A mHealth real-time infectious disease interface - 2014 Ebola outbreak case study. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (Osaka, Japan) (UbiComp/ISWC ’15 Adjunct). Association for Computing Machinery, New York, NY, USA, 297–300. https://doi.org/10.1145/2800835.2800851",
      "doi": "10.1145/2800835.2800851"
    },
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, 2017. Nudges for privacy and security: Understanding and assisting users’ choices online. ACM Computing Surveys (CSUR) 50, 3 (2017), 1–41.",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. Science 347, 6221 (2015), 509–514.",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti and Jens Grossklags. 2003. Losses, gains, and hyperbolic discounting: An experimental approach to information security attitudes and behavior. In 2nd Annual Workshop on Economics and Information Security-WEIS, Vol. 3. WEIS, Berkeley, CA, 1–27.",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti and Jens Grossklags. 2005. Privacy and rationality in individual decision making. IEEE Security & Privacy 3, 1 (2005), 26–33.",
      "doi": "10.1109/MSP.2005.22"
    },
    {
      "text": "Roy Aizen, Gabriela Marcu, Anjali Misra, Gregory Sieber, David G. Schwartz, Alexis Roth, and Stephen Lankenau. 2018. Designing an emergency response community for opioid overdoses in Philadelphia. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188581",
      "doi": "10.1145/3170427.3188581"
    },
    {
      "text": "Hazim Almuhimedi, Florian Schaub, Norman Sadeh, Idris Adjerid, Alessandro Acquisti, Joshua Gluck, Lorrie Faith Cranor, and Yuvraj Agarwal. 2015. Your location has been shared 5,398 times! A field study on mobile app privacy nudging. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 787–796. https://doi.org/10.1145/2702123.2702210",
      "doi": "10.1145/2702123.2702210"
    },
    {
      "text": "Samuel Altmann, Luke Milsom, Hannah Zillessen, Raffaele Blasone, Frederic Gerdon, Ruben Bach, Frauke Kreuter, Daniele Nosenzo, Severine Toussaert, and Johannes Abeler. 2020. Acceptability of app-based contact tracing for COVID-19: Cross-country survey evidence. https://doi.org/10.1101/2020.05.05.20091587 Preprint, medRxiv.",
      "doi": ""
    },
    {
      "text": "R. Michael Alvarez, Lonna Rae Atkeson, Ines Levin, and Yimeng Li. 2019. Paying attention to inattentive survey respondents. Political Analysis 27, 2 (2019), 145–162. https://doi.org/10.1017/pan.2018.57",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2015. The user reconfigured: On subjectivities of information. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (Aarhus, Denmark) (CA ’15). Aarhus University Press, Aarhus N, 133–144. https://doi.org/10.7146/aahcc.v1i1.21298",
      "doi": "10.7146/aahcc.v1i1.21298"
    },
    {
      "text": "Marguerite Barry, Kevin Doherty, Jose Marcano Belisario, Josip Car, Cecily Morrison, and Gavin Doherty. 2017. mHealth for maternal mental health: Everyday wisdom in ethical design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2708—2756. https://doi.org/10.1145/3025453.3025918",
      "doi": "10.1145/3025453.3025918"
    },
    {
      "text": "Eric P.S. Baumer, Phil Adams, Vera D. Khovanskaya, Tony C. Liao, Madeline E. Smith, Victoria Schwanda Sosik, and Kaiton Williams. 2013. Limiting, leaving, and (re)lapsing: An exploration of Facebook non-use practices and experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 3257–3266. https://doi.org/10.1145/2470654.2466446",
      "doi": "10.1145/2470654.2466446"
    },
    {
      "text": "Genevieve Bell. 2020. We need mass surveillance to fight COVID-19 – but it doesn’t have to be creepy. https://www.technologyreview.com/2020/04/12/999186/covid-19-contact-tracing-surveillance-data-privacy-anonymity/ MIT Technology Review, May 2020.",
      "doi": ""
    },
    {
      "text": "James Bell, David Butler, Chris Hicks, and Jon Crowcroft. 2020. Tracesecure: Towards privacy preserving contact tracing. arXiv:2004.04059.",
      "doi": ""
    },
    {
      "text": "Rafael A Calvo, Sebastian Deterding, and Richard M Ryan. 2020. Health surveillance during COVID-19 pandemic. https://doi.org/10.1136/bmj.m1373",
      "doi": ""
    },
    {
      "text": "Justin Chan, Shyam Gollakota, Eric Horvitz, Joseph Jaeger, Sham Kakade, Tadayoshi Kohno, John Langford, Jonathan Larson, Sudheesh Singanamalla, Jacob Sunshine, 2020. PACT: Privacy sensitive protocols and mechanisms for mobile contact tracing. arxiv:2004.03544",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Eric P. S. Baumer, and Munmun De Choudhury. 2019. Who is the “human” in human-centered machine learning: The case of predicting mental health from social media. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 147 (Nov. 2019), 32 pages. https://doi.org/10.1145/3359249",
      "doi": "10.1145/3359249"
    },
    {
      "text": "William F. Chaplin, Oliver P. John, and Lewis R. Goldberg. 1988. Conceptions of states and traits: dimensional attributes with ideals as prototypes.Journal of personality and social psychology 54, 4(1988), 541.",
      "doi": ""
    },
    {
      "text": "Hyunghoon Cho, Daphne Ippolito, and Yun William Yu. 2020. Contact tracing mobile apps for COVID-19: Privacy considerations and related trade-offs. arXiv:2003.11511.",
      "doi": ""
    },
    {
      "text": "Scott Clifford, Ryan M. Jewell, and Philip D. Waggoner. 2015. Are samples drawn from Mechanical Turk valid for research on political ideology?Research & Politics 2, 4 (2015), 1–9. https://doi.org/10.1177/2053168015622072",
      "doi": ""
    },
    {
      "text": "Simon P. Cohn. 2006. Privacy and confidentiality in the nationwide health information network. http://www.ncvhs.hhs.gov/060622lt.htm",
      "doi": ""
    },
    {
      "text": "Bipin C. Desai. 2020. Pandemic and Big Tech. In Proceedings of the 24th Symposium on International Database Engineering & Applications (Seoul, Republic of Korea) (IDEAS ’20). Association for Computing Machinery, New York, NY, USA, Article 20, 10 pages. https://doi.org/10.1145/3410566.3410585",
      "doi": "10.1145/3410566.3410585"
    },
    {
      "text": "Carsten F. Dormann, Jane Elith, Sven Bacher, Carsten Buchmann, Gudrun Carl, Gabriel Carré, Jaime R. García Marquéz, Bernd Gruber, Bruno Lafourcade, Pedro J. Leitão, Tamara Münkemüller, Colin McClean, Patrick E. Osborne, Björn Reineking, Boris Schröder, Andrew K. Skidmore, Damaris Zurell, and Sven Lautenbach. 2013. Collinearity: a review of methods to deal with it and a simulation study evaluating their performance. Ecography 36, 1 (2013), 27–46. https://doi.org/10.1111/j.1600-0587.2012.07348.x",
      "doi": ""
    },
    {
      "text": "Martin French and Torin Monahan. 2020. Dis-ease surveillance: How might surveillance studies address COVID-19?Surveillance & Society 18, 1 (2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Bram M. Fridhandler. 1986. Conceptual note on state, trait, and the state–trait distinction.Journal of Personality and Social Psychology 50, 1(1986), 169.",
      "doi": ""
    },
    {
      "text": "Huiqing Fu and Janne Lindqvist. 2014. General area or approximate location? How people understand location permissions. In Proceedings of the 13th Workshop on Privacy in the Electronic Society. Association for Computing Machinery, Scottsdale, AZ, 117–120.",
      "doi": ""
    },
    {
      "text": "Radhika Garg and Jenna Kim. 2018. An exploratory study for understanding reasons of (not-)using Internet of Things. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188466",
      "doi": "10.1145/3170427.3188466"
    },
    {
      "text": "Jeremy Ginsberg, Matthew H. Mohebbi, Rajan S. Patel, Lynnette Brammer, Mark S. Smolinski, and Larry Brilliant. 2009. Detecting influenza epidemics using search engine query data. Nature 457, 7232 (2009), 1012–1014.",
      "doi": ""
    },
    {
      "text": "Joseph K. Goodman, Cynthia E. Cryder, and Amar Cheema. 2013. Data collection in a flat world: The strengths and weaknesses of Mechanical Turk samples. Journal of Behavioral Decision Making 26, 3 (2013), 213–224.",
      "doi": ""
    },
    {
      "text": "Kevin D. Haggerty and Richard V. Ericson. 2000. The surveillant assemblage. The British Journal of Sociology 51, 4 (2000), 605–622. https://doi.org/10.1080/00071310020015280",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai, Minh Hao Nguyen, Jaelle Fuchs, Jonathan Gruber, Will Marler, Amanda Hunsaker, and Gokce Karaoglu. 2020. COVID-19 study on digital media and the coronavirus pandemic. http://webuse.org/covid/",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Elissa M. Redmiles. 2020. Will Americans be willing to install COVID-19 tracking apps?https://blogs.scientificamerican.com/observations/will-americans-be-willing-to-install-covid-19-tracking-apps/ Library Catalog: blogs.scientificamerican.com.",
      "doi": ""
    },
    {
      "text": "Vi Hart, Divya Siddarth, Bethan Cantrell, Lila Tretikov, Peter Eckersley, John Langford, Scott Leibrand, Sham Kakade, Dana Lewis, Stefano Tessaro, and Glen Weyl. 2020. Outpacing the virus: Digital response to containing the spread of COVID-19 while mitigating privacy risks. https://ethics.harvard.edu/outpacing-virus",
      "doi": ""
    },
    {
      "text": "Roberto Hoyle, Luke Stark, Qatrunnada Ismail, David Crandall, Apu Kapadia, and Denise Anthony. 2020. Privacy norms and preferences for photos posted online. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 4(2020), 1–27.",
      "doi": "10.1145/3380960"
    },
    {
      "text": "Human Rights Watch. 2020. COVID-19 Apps Pose Serious Human Rights Risks. https://www.hrw.org/news/2020/05/13/covid-19-apps-pose-serious-human-rights-risks",
      "doi": ""
    },
    {
      "text": "Edith Jacobson. 1965. The Self and the Object World. Hogarth Press, London.",
      "doi": ""
    },
    {
      "text": "Immanuel Kant. 1999. Critique of Pure Reason. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Michael Klenk, Hein Duijf, and Christian Engels. 2020. Ethics of digital contact tracing and COVID-19: Who is (not) free to go?https://papers.ssrn.com/sol3/papers.cfm?abstract_id=3595394",
      "doi": ""
    },
    {
      "text": "Christiane Kuhn, Martin Beck, and Thorsten Strufe. 2020. COVID notions: Towards formal definitions–and documented understanding–of privacy goals and claimed protection in proximity-tracing services. arXiv:2004.07723.",
      "doi": ""
    },
    {
      "text": "Roberta Lamb and Rob Kling. 2003. Reconceptualizing users as social actors in information systems research. MIS Quarterly 27, 2 (2003), 197–236. http://www.jstor.org/stable/30036529",
      "doi": "10.5555/2017189.2017193"
    },
    {
      "text": "Alexander D. Langmuir. 1971. Communicable disease surveillance: Evolution of the concept of surveillance in the United States. Proceedings of the Royal Society of Medicine 64, 6 (1971), 681–684.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2005. Reassembling the social: An introduction to actor-network-theory. Oxford University Press, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 2020. Imaginer les gestes-barrières contre le retour à la production d’avant-crise. https://oara.fr/sites/default/files/images/upload/bruno_latour_imaginer_les_gestes_barrie_res_1.pdf",
      "doi": ""
    },
    {
      "text": "Leslie Lenert and Brooke Yeager McSwain. 2020. Balancing health privacy, health information exchange, and research in the context of the COVID-19 pandemic. https://doi.org/10.1093/jamia/ocaa039",
      "doi": ""
    },
    {
      "text": "Jialiu Lin, Shahriyar Amini, Jason I. Hong, Norman Sadeh, Janne Lindqvist, and Joy Zhang. 2012. Expectation and purpose: Understanding users’ mental models of mobile app privacy through crowdsourcing. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (Pittsburgh, Pennsylvania) (UbiComp ’12). Association for Computing Machinery, New York, NY, USA, 501–510. https://doi.org/10.1145/2370216.2370290",
      "doi": "10.1145/2370216.2370290"
    },
    {
      "text": "Chris Y. T. Ma, David K. Y. Yau, Nung Kwan Yip, and Nageswara S. V. Rao. 2010. Privacy vulnerability of published anonymous mobility traces. In Proceedings of the Sixteenth Annual International Conference on Mobile Computing and Networking(Chicago, Illinois, USA) (MobiCom ’10). Association for Computing Machinery, New York, NY, USA, 185–196. https://doi.org/10.1145/1859995.1860017",
      "doi": ""
    },
    {
      "text": "Sascha Meinert. 2014. Field manual: Scenario building. https://www.etui.org/sites/default/files/2014_Scenario_Building_DEF.pdf",
      "doi": ""
    },
    {
      "text": "Georgina R. Mellor, Christine S. M. Currie, and Elizabeth L. Corbett. 2011. Incorporating household structure into a discrete-event simulation model of tuberculosis and HIV. ACM Trans. Model. Comput. Simul. 21, 4, Article 26 (Sept. 2011), 17 pages. https://doi.org/10.1145/2000494.2000499",
      "doi": "10.1145/2000494.2000499"
    },
    {
      "text": "Maria D. Molina. 2019. I am what you eat: Effects of social influence on meal selection online. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3308451",
      "doi": "10.1145/3290607.3308451"
    },
    {
      "text": "Abu Saleh Md Noman, Sanchari Das, and Sameer Patil. 2019. Techies against Facebook: Understanding negative sentiment toward Facebook via user generated content. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300698",
      "doi": "10.1145/3290605.3300698"
    },
    {
      "text": "Cameron D. Norman and Harvey A. Skinner. 2006. eHEALS: The eHealth Literacy Scale. Journal of Medical Internet Research 8, 4 (2006), e27. https://doi.org/10.2196/jmir.8.4.e27",
      "doi": ""
    },
    {
      "text": "Sangchul Park, Gina Jeehyun Choi, and Haksoo Ko. 2020. Information Technology-Based Tracing Strategy in Response to COVID-19 in South Korea–Privacy Controversies. https://jamanetwork.com/journals/jama/article-abstract/2765252",
      "doi": ""
    },
    {
      "text": "Sameer Patil, Greg Norcie, Apu Kapadia, and Adam J. Lee. 2012. Reasons, rewards, regrets: Privacy considerations in location sharing as an interactive practice. In Proceedings of the Eighth Symposium on Usable Privacy and Security (Washington, D.C.) (SOUPS ’12). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/2335356.2335363",
      "doi": "10.1145/2335356.2335363"
    },
    {
      "text": "Aarathi Prasad, Jacob Sorber, Timothy Stablein, Denise Anthony, and David Kotz. 2012. Understanding sharing preferences and behavior for mHealth devices. In Proceedings of the 2012 ACM Workshop on Privacy in the Electronic Society (Raleigh, North Carolina, USA) (WPES ’12). Association for Computing Machinery, New York, NY, USA, 117–128. https://doi.org/10.1145/2381966.2381983",
      "doi": "10.1145/2381966.2381983"
    },
    {
      "text": "Davy Preuveneers and Wouter Joosen. 2016. Privacy-enabled remote health monitoring applications for resource constrained wearable devices. In Proceedings of the 31st Annual ACM Symposium on Applied Computing (Pisa, Italy) (SAC ’16). Association for Computing Machinery, New York, NY, USA, 119–124. https://doi.org/10.1145/2851613.2851683",
      "doi": "10.1145/2851613.2851683"
    },
    {
      "text": "Ramesh Raskar, Isabel Schunemann, Rachel Barbar, Kristen Vilcans, Jim Gray, Praneeth Vepakomma, Suraj Kapa, Andrea Nuzzo, Rajiv Gupta, Alex Berke, 2020. Apps gone rogue: Maintaining personal privacy in an epidemic. arXiv:2003.08567.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles. 2020. User concerns & tradeoffs in technology-facilitated contact tracing. arXiv:2004.13219.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles, Sean Kross, and Michelle L. Mazurek. 2019. How well do my results generalize? Comparing security and privacy survey results from mturk, web, and telephone samples. In 2019 IEEE Symposium on Security and Privacy (SP). IEEE, San Francisco, CA, 1326–1343.",
      "doi": ""
    },
    {
      "text": "Leonie Reichert, Samuel Brack, and Björn Scheuermann. 2020. Privacy-preserving contact tracing of COVID-19 patients. https://eprint.iacr.org/2020/375.pdf Cryptology ePrint Archive, Report 2020/375, 2020.",
      "doi": ""
    },
    {
      "text": "Jean-Jacques Rousseau. 1998. The Social Contract. Wordsworth Editions Limited, London.",
      "doi": ""
    },
    {
      "text": "Kim Bartel Sheehan. 2018. Crowdsourcing research: data collection with Amazon’s Mechanical Turk. Communication Monographs 85, 1 (2018), 140–156.",
      "doi": ""
    },
    {
      "text": "Alessio Signorini, Alberto Maria Segre, and Philip M. Polgreen. 2011. The Use of Twitter to track levels of disease activity and public concern in the U.S. during the Influenza A H1N1 pandemic. PLOS ONE 6, 5 (05 2011), 1–10. https://doi.org/10.1371/journal.pone.0019467",
      "doi": ""
    },
    {
      "text": "Theodore M. Singelis, Harry C. Triandis, Dharm P. S. Bhawuk, and Michele J. Gelfand. 1995. Horizontal and vertical dimensions of individualism and collectivism: A theoretical and measurement refinement. Cross-Cultural Research 29, 3 (1995), 240–275. https://doi.org/10.1177/106939719502900302",
      "doi": ""
    },
    {
      "text": "Daniel J. Solove. 2012. Introduction: Privacy self-management and the consent dilemma. Harv. L. Rev. 126(2012), 1880.",
      "doi": ""
    },
    {
      "text": "Elizabeth Stowell, Mercedes C. Lyson, Herman Saksono, Reneé C. Wurth, Holly Jimison, Misha Pavel, and Andrea G. Parker. 2018. Designing and evaluating mHealth interventions for vulnerable populations: A systematic review. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3173574.3173589",
      "doi": "10.1145/3173574.3173589"
    },
    {
      "text": "Cass R. Sunstein. 2015. Nudging and choice architecture: Ethical considerations. Yale Journal on Regulation 32, 2 (2015), 413–450. https://www.yalejreg.com/print/the-ethics-of-nudging/",
      "doi": ""
    },
    {
      "text": "Jennifer Fries Taylor, Jodie Ferguson, and Pamela Scholder Ellen. 2015. From trait to state: Understanding privacy concerns. Journal of Consumer Marketing 32, 2 (2015), 99–112.",
      "doi": ""
    },
    {
      "text": "Stephen B. Thacker and Ruth L. Berkelman. 1988. Public health surveillance in the United States. Epidemiologic reviews 10, 1 (1988), 164–190.",
      "doi": ""
    },
    {
      "text": "Milka Trajkova and Aqueasha Martin-Hammond. 2020. “Alexa is a toy”: Exploring older adults’ reasons for using, limiting, and abandoning Echo. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376760",
      "doi": "10.1145/3313831.3376760"
    },
    {
      "text": "Harry C. Triandis. 1996. The psychological measurement of cultural syndromes.American psychologist 51, 4 (1996), 407.",
      "doi": ""
    },
    {
      "text": "Harry C. Triandis. 2001. Individualism-collectivism and personality. Journal of personality 69, 6 (2001), 907–924.",
      "doi": ""
    },
    {
      "text": "Harry C. Triandis. 2018. Individualism and collectivism. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Harry C. Triandis and Michele C. Gelfand. 1998. Converging measurement of horizontal and vertical individualism and collectivism. Journal of Personality and Social Psychology 74, 1(1998), 118–128.",
      "doi": ""
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1981. The framing of decisions and the psychology of choice. Science 211, 4481 (1981), 453–458. https://doi.org/10.1126/science.7455683",
      "doi": ""
    },
    {
      "text": "Kristina P. Vatcheva, MinJae Lee, Joseph B. McCormick, and Mohammad H. Rahbar. 2016. Multicollinearity in regression analyses conducted in epidemiologic studies. Epidemiology (Sunnyvale, Calif.) 6, 2 (2016), 2161–1165.",
      "doi": ""
    },
    {
      "text": "Rick Wash. 2010. Folk models of home computer security. In Proceedings of the Sixth Symposium on Usable Privacy and Security (Redmond, Washington, USA) (SOUPS ’10). Association for Computing Machinery, New York, NY, USA, Article 11, 16 pages. https://doi.org/10.1145/1837110.1837125",
      "doi": "10.1145/1837110.1837125"
    },
    {
      "text": "Lucretia Williams, Gillian R. Hayes, Yuqing Guo, Amir Rahmani, and Nikil Dutt. 2020. HCI and mHealth wearable tech: A multidisciplinary research challenge. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3334480.3375223",
      "doi": "10.1145/3334480.3375223"
    },
    {
      "text": "Jacob O. Wobbrock and Matthew Kay. 2016. Nonparametric statistics in human-computer interaction. Springer International Publishing, Cham, 135–170. https://doi.org/10.1007/978-3-319-26633-6_7",
      "doi": ""
    },
    {
      "text": "Heng Xu, Sumeet Gupta, Mary Beth Rosson, and John M. Carroll. 2012. Measuring mobile users’ concerns for information privacy. In International Conference on Information Systems, Vol. 3. Association for Information Systems, Orlando, FL, USA, 2278–2293.",
      "doi": ""
    },
    {
      "text": "Tyler M. Yasaka, Brandon M. Lehrich, and Ronald Sahyouni. 2020. Peer-to-peer contact tracing: Development of a privacy-preserving smartphone app. JMIR mHealth and uHealth 8, 4 (2020), e18936.",
      "doi": ""
    },
    {
      "text": "Baobao Zhang, Sarah Kreps, and Nina McMurry. 2020. Americans’ perceptions of privacy and surveillance in the COVID-19 pandemic.https://osf.io/9wz3y",
      "doi": ""
    },
    {
      "text": "Xing Zhang, Shan Liu, Xing Chen, Lin Wang, Baojun Gao, and Qing Zhu. 2018. Health information privacy concerns, antecedents, and information disclosure intention in online health communities. Information & Management 55, 4 (2018), 482–493. https://doi.org/10.1016/j.im.2017.11.003",
      "doi": ""
    },
    {
      "text": "Yulei Zhang, Yan Dang, Yi-Da Chen, Hsinchun Chen, Mark Thurmond, Chwan-Chuen King, Daniel Dajun Zeng, and Catherine A. Larson. 2008. BioPortal infectious disease informatics research: Disease surveillance and situational awareness. In Proceedings of the 2008 International Conference on Digital Government Research(dg.o ’08). Digital Government Society of North America, Montreal, Canada, 393–394.",
      "doi": ""
    },
    {
      "text": "Shoshana Zuboff. 2019. The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power. PublicAffairs, New York.",
      "doi": ""
    }
  ]
}