{
  "doi": "10.1145/3411764.3445509",
  "title": "Adaptive Subtitles: Preferences and Trade-Offs in Real-Time Media Adaption",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "Subtitles can help improve the understanding of media content. People enable subtitles based on individual characteristics (e.g., language or hearing ability), viewing environment, or media context (e.g., drama, quiz show). However, some people find that subtitles can be distracting and that they negatively impact their viewing experience. We explore the challenges and opportunities surrounding interaction with real-time personalisation of subtitled content. To understand how people currently interact with subtitles, we first conducted an online questionnaire with 102 participants. We used our findings to elicit requirements for a new approach called Adaptive Subtitles that allows the viewer to alter which speakers have subtitles displayed in real-time. We evaluated our approach with 19 participants to understand the interaction trade-offs and challenges within real-time adaptations of subtitled media. Our evaluation findings suggest that granular controls and structured onboarding allow viewers to make informed trade-offs when adapting media content, leading to improved viewing experiences.",
  "tags": [
    "Closed-captions",
    "Subtitles",
    "Media",
    "Captions",
    "Adaptive-Interfaces"
  ],
  "authors": [
    {
      "name": "Benjamin M. Gorman",
      "institution": "Bournemouth University, Bournemouth, England, UK",
      "img": "/do/10.1145/contrib-99658650473/rel-imgonly/ben2018.jpeg",
      "acmid": "99658650473",
      "orcid": "missing"
    },
    {
      "name": "Michael Crabb",
      "institution": "University of Dundee, Dundee, Scotland, UK",
      "img": "/do/10.1145/contrib-81556562156/rel-imgonly/200x200.png",
      "acmid": "81556562156",
      "orcid": "missing"
    },
    {
      "name": "Michael Armstrong",
      "institution": "BBC Research and Development, Salford, England, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658720799",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "M. Armstrong. 2017. Automatic Recovery and Verification of Subtitles for Large Collections of Video Clips. SMPTE Motion Imaging Journal 126, 8 (2017), 1–7. https://doi.org/10.5594/JMI.2017.2732858",
      "doi": ""
    },
    {
      "text": "M. Armstrong, S. Bowman, M. Brooks, A. Brown, J. Carter, A. Jones, M. Leonard, and T. Preece. 2020. Taking Object-Based Media from the Research Environment Into Mainstream Production. SMPTE Motion Imaging Journal 129, 5 (2020), 30–38. https://doi.org/10.5594/JMI.2020.2990255",
      "doi": ""
    },
    {
      "text": "Mike Armstrong, Matthew Brooks, Anthony Churnside, Michael Evans, Frank Melchior, and Matthew Shotton. 2014. Object-based broadcasting-curation, responsiveness and user experience. IBC2014 Conference 2014, 1 (2014), 1–8. https://doi.org/10.1049/ib.2014.0038",
      "doi": ""
    },
    {
      "text": "Mike Armstrong, Andy Brown, Michael Crabb, Chris J. Hughes, Rhianne Jones, and James Sandford. 2016. Understanding the Diverse Needs of Subtitle Users in a Rapidly Evolving Media Landscape. SMPTE Motion Imaging Journal 125, 9 (2016), 33–41. https://doi.org/10.5594/JMI.2016.2614919",
      "doi": ""
    },
    {
      "text": "BBC Research and Development. 2016. Subtitle Quality - Measuring and improving subtitle quality. www.bbc.co.uk/rd/projects/live-subtitle-quality",
      "doi": ""
    },
    {
      "text": "BBC Research and Development. 2019. Casualty, Loud and Clear. https://www.bbc.co.uk/rd/blog/2019-08-casualty-tv-drama-audio-mix-speech-hearing",
      "doi": ""
    },
    {
      "text": "Tim Brooks. 2019. Television and Record Industry Nielson Ratings. https://timbrooks.net/ratings/",
      "doi": ""
    },
    {
      "text": "Andy Brown, Amaia Aizpurua, Caroline Jay, Michael Evans, Maxine Glancy, and Simon Harper. 2019. Contrasting delivery modes for second screen TV content. Push or Pull?International Journal of Human-Computer Studies 129 (2019), 15–26. https://doi.org/10.1016/j.ijhcs.2019.03.007",
      "doi": ""
    },
    {
      "text": "Andy Brown, Rhia Jones, Mike Crabb, James Sandford, Matthew Brooks, Mike Armstrong, and Caroline Jay. 2015. Dynamic Subtitles: The User Experience. In Proceedings of the ACM International Conference on Interactive Experiences for TV and Online Video (Brussels, Belgium) (TVX ’15). ACM, New York, NY, USA, 103–112. https://doi.org/10.1145/2745197.2745204",
      "doi": "10.1145/2745197.2745204"
    },
    {
      "text": "Andy Brown, Jayson Turner, Jake Patterson, Anastasia Schmitz, Mike Armstrong, and Maxine Glancy. 2017. Subtitles in 360-degree Video. In Adjunct Publication of the 2017 ACM International Conference on Interactive Experiences for TV and Online Video (Hilversum, The Netherlands) (TVX ’17 Adjunct). ACM, New York, NY, USA, 3–8. https://doi.org/10.1145/3084289.3089915",
      "doi": "10.1145/3084289.3089915"
    },
    {
      "text": "Denis Burnham, Greg Leigh, William Noble, Caroline Jones, Michael Tyler, Leonid Grebennikov, and Alex Varley. 2008. Parameters in television captioning for deaf and hard-of-hearing adults: Effects of caption rate versus text reduction on comprehension. Journal of deaf studies and deaf education 13, 3 (2008), 391–404. https://doi.org/10.1093/deafed/enn003",
      "doi": ""
    },
    {
      "text": "Cristina Cambra, Olivier Penacchio, Núria Silvestre, and Aurora Leal. 2014. Visual attention to subtitles when viewing a cartoon by deaf and hearing children: an eye-tracking pilot study. Perspectives 22, 4 (2014), 607–617. https://doi.org/10.1080/0907676X.2014.923477",
      "doi": ""
    },
    {
      "text": "Jessica Carpani. 2019. BBC criticised for ’mumbling’ adaptation of A Christmas Carol. https://www.telegraph.co.uk/news/2019/12/23/bbc-criticised-mumbling-adaptation-christmas-carol/",
      "doi": ""
    },
    {
      "text": "Brad Chisholm. 1987. Reading Intertitles. Journal of Popular Film and Television 15, 3 (1987), 137–142.",
      "doi": ""
    },
    {
      "text": "British Broadcasting Corporation. 2018. BBC Global Experience Language. https://www.bbc.co.uk/gel",
      "doi": ""
    },
    {
      "text": "British Broadcasting Corporation. 2018. BBC Subtitle Guidelines. http://bbc.github.io/subtitle-guidelines/",
      "doi": ""
    },
    {
      "text": "Michael Crabb, Michael Heron, Rhianne Jones, Mike Armstrong, Hayley Reid, and Amy Wilson. 2019. Developing Accessible Services: Understanding Current Knowledge and Areas for Future Support. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 216, 12 pages. https://doi.org/10.1145/3290605.3300446",
      "doi": "10.1145/3290605.3300446"
    },
    {
      "text": "Michael Crabb, Rhianne Jones, and Mike Armstrong. 2015. The Development of a Framework for Understanding the UX of Subtitles. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility(Lisbon, Portugal) (ASSETS ’15). ACM, New York, NY, USA, 347–348. https://doi.org/10.1145/2700648.2811372",
      "doi": "10.1145/2700648.2811372"
    },
    {
      "text": "Michael Crabb, Rhianne Jones, Mike Armstrong, and Chris J. Hughes. 2015. Online News Videos: The UX of Subtitle Position. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers and Accessibility (Lisbon, Portugal) (ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 215–222. https://doi.org/10.1145/2700648.2809866",
      "doi": "10.1145/2700648.2809866"
    },
    {
      "text": "Michael Evans, Tristan Ferne, Zillah Watson, Frank Melchior, Matthew Brooks, Phil Stenton, and Ian Forrester. 2016. Creating object-based experiences in the real world. Proceedings of the IBC Conference 2016 2014, 1 (2016), 1–8. https://doi.org/10.1049/ibc.2016.0034",
      "doi": ""
    },
    {
      "text": "Wendy Fox. 2016. Integrated titles: An improved viewing experience?Eyetracking and Applied Linguistics 2 (2016), 5. https://doi.org/10.17169/langsci.b108.233",
      "doi": ""
    },
    {
      "text": "Alejandra Garrido, Sergio Firmenich, Gustavo Rossi, Julian Grigera, Nuria Medina-Medina, and Ivana Harari. 2012. Personalized web accessibility using client-side refactoring. IEEE Internet Computing 17, 4 (2012), 58–66. https://doi.org/10.1109/MIC.2012.143",
      "doi": "10.1109/MIC.2012.143"
    },
    {
      "text": "Google. 2019. Material Guidelines - Displaying State. https://material.io/design/interaction/states.html",
      "doi": ""
    },
    {
      "text": "Benjamin M. Gorman and David R. Flatla. 2017. A Framework for Speechreading Acquisition Tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 519–530. https://doi.org/10.1145/3025453.3025560",
      "doi": ""
    },
    {
      "text": "Benjamin M. Gorman and David R. Flatla. 2018. MirrorMirror: A Mobile Application to Improve Speechreading Acquisition. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173600",
      "doi": ""
    },
    {
      "text": "Vicki L. Hanson and John T. Richards. 2003. A Web Accessibility Service: Update and Findings. SIGACCESS Access. Comput. 2003, 77-78 (Sept. 2003), 169–176. https://doi.org/10.1145/1029014.1028661",
      "doi": ""
    },
    {
      "text": "Ellie Harrison. 2017. Why is it so hard to hear the dialogue in TV dramas?https://www.radiotimes.com/news/tv/2017-02-23/tv-sound-problems-drama-dialogue/",
      "doi": ""
    },
    {
      "text": "Chris Hughes, Mario Montagud Climent, and Peter tho Pesch. 2019. Disruptive Approaches for Subtitling in Immersive Environments. In Proceedings of the 2019 ACM International Conference on Interactive Experiences for TV and Online Video(Salford (Manchester), United Kingdom) (TVX ’19). Association for Computing Machinery, New York, NY, USA, 216–229. https://doi.org/10.1145/3317697.3325123",
      "doi": "10.1145/3317697.3325123"
    },
    {
      "text": "Chris J. Hughes, Mike Armstrong, Rhianne Jones, and Michael Crabb. 2015. Responsive Design for Personalised Subtitles. In Proceedings of the 12th Web for All Conference(Florence, Italy) (W4A ’15). ACM, New York, NY, USA, Article 8, 4 pages. https://doi.org/10.1145/2745555.2746650",
      "doi": "10.1145/2745555.2746650"
    },
    {
      "text": "Samantha Jaroszewski, Danielle Lottridge, Oliver L. Haimson, and Katie Quehl. 2018. ”Genderfluid” or ”Attack Helicopter”: Responsible HCI Research Practice with Non-Binary Gender Variation in Online Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3173574.3173881",
      "doi": "10.1145/3173574.3173881"
    },
    {
      "text": "Carl J Jensema, Ramalinga Sarma Danturthi, and Robert Burch. 2000. Time spent viewing captions on television programs. American annals of the deaf 2000, 1 (2000), 464–468. https://doi.org/10.1353/aad.2012.0144",
      "doi": ""
    },
    {
      "text": "Helen Katz. 2006. The media handbook: A complete guide to advertising media selection, planning, research, and buying. Routledge, Oxford, UK. https://doi.org/10.4324/9781315537870",
      "doi": ""
    },
    {
      "text": "Jan-Louis Kruger, Stephen Doherty, and María-T Soto-Sanfiel. 2017. Original Language Subtitles: Their Effects on the Native and Foreign Viewer.Comunicar: Media Education Research Journal 25, 50 (2017), 23–32. https://doi.org/10.3916/C50-2017-02",
      "doi": ""
    },
    {
      "text": "Jan-Louis Kruger, Agnieszka Szarkowska, and Izabela Krejtz. 2015. Subtitles on the moving image: an overview of eye tracking studies. Refractory: A Journal of Entertainment Media 25 (2015), 1–14. http://hdl.handle.net/1959.14/1040614",
      "doi": ""
    },
    {
      "text": "Michael Lallo. 2017. Speak up! How ’mumble acting’ is ruining TV and film. https://www.smh.com.au/entertainment/tv-and-radio/speak-up-how-mumble-acting-is-ruining-tv-and-film-20170201-gu2u5j.html",
      "doi": ""
    },
    {
      "text": "M Lambooij, MJ Murdoch, Wijnand A IJsselsteijn, and Ingrid Heynderickx. 2013. The impact of video characteristics and subtitles on visual comfort of 3D TV. Displays 34, 1 (2013), 8–16. https://doi.org/10.1016/j.displa.2012.09.002",
      "doi": ""
    },
    {
      "text": "Mina Lee, Beverly Roskos, and David R. Ewoldsen. 2013. The Impact of Subtitles on Comprehension of Narrative Film. Media Psychology 16, 4 (2013), 412–440. https://doi.org/10.1080/15213269.2013.826119",
      "doi": ""
    },
    {
      "text": "Margaret S Jelinek Lewis. 2000. Television captioning: A vehicle for accessibility and literacy. On-line Proceedings of CSUN 2000, 1 (2000), 1–5.",
      "doi": ""
    },
    {
      "text": "Lluis Manchon and Pilar Orero. 2018. Usability tests for personalised subtitles. Translation Spaces 7, 2 (2018), 263–284. https://doi.org/10.1075/ts.18016.man",
      "doi": ""
    },
    {
      "text": "Paul Markham. 1999. Captioned videotapes and second-language listening word recognition. Foreign Language Annals 32, 3 (1999), 321–328. https://doi.org/10.1111/j.1944-9720.1999.tb01344.x",
      "doi": ""
    },
    {
      "text": "Shaun Patrick McCarthy, Yaron Sole, Trevor James Walker, Arun Velayudhan Pillai, and Venkatraman Prabhu. 2020. Personalized recap clips. US Patent 10,555,023.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Holger Mitterer and James M. McQueen. 2009. Foreign Subtitles Help but Native-Language Subtitles Harm Foreign Speech Perception. PLOS ONE 4, 11 (11 2009), 1–5. https://doi.org/10.1371/journal.pone.0007785",
      "doi": ""
    },
    {
      "text": "Kyle Montague, Vicki L. Hanson, and Andy Cobley. 2012. Designing for Individuals: Usable Touch-screen Interaction Through Shared User Models. In Proceedings of the 14th International ACM SIGACCESS Conference on Computers and Accessibility (Boulder, Colorado, USA) (ASSETS ’12). ACM, New York, NY, USA, 151–158. https://doi.org/10.1145/2384916.2384943",
      "doi": "10.1145/2384916.2384943"
    },
    {
      "text": "Netflix. 2019. Netflix Subtitle Preferences. netflix.com/subtitlepreferences",
      "doi": ""
    },
    {
      "text": "K Noland and L Truong. 2015. A survey of UK television viewing conditions. BBC Research & Development White Paper 287 (2015), 1–58. https://www.bbc.co.uk/rd/publications/whitepaper287",
      "doi": ""
    },
    {
      "text": "Don Norman, Jim Miller, and Austin Henderson. 1995. What You See, Some of What’s in the Future, and How We Go About Doing It: HI at Apple Computer. In Conference Companion on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’95). ACM, New York, NY, USA, 155–. https://doi.org/10.1145/223355.223477",
      "doi": "10.1145/223355.223477"
    },
    {
      "text": "The Office of Communications UK (Ofcom). 2018. Making on-demand services accessible. https://www.ofcom.org.uk/__data/assets/pdf_file/0014/131063/Statement-Making-on-demand-services-accessible.pdf.",
      "doi": ""
    },
    {
      "text": "OfCom. 2006. Television access services review. https://www.ofcom.org.uk/consultations-and-statements/category-1/accessservs",
      "doi": ""
    },
    {
      "text": "OfCom. 2017. Ofcom’s Code on Television Access Services. https://www.ofcom.org.uk/__data/assets/pdf_file/0020/97040/Access-service-code-Jan-2017.pdf",
      "doi": ""
    },
    {
      "text": "OfCom. 2019. Adults’ media use and attitudes Report. https://www.ofcom.org.uk/research-and-data/media-literacy-research/adults/adults-media-use-and-attitudes",
      "doi": ""
    },
    {
      "text": "Matthew Paradis, Rebecca Gregory-Clarke, and Frank Melchior. 2015. VenueExplorer, Object-Based Interactive Audio for Live Events. Proceedings of the International Web Audio Conference 2015, 1 (January 2015), 1–5.",
      "doi": ""
    },
    {
      "text": "Silvia Pfeiffer. 2019. WebVTT: The Web Video Text Tracks Format. https://www.w3.org/TR/2019/CR-webvtt1-20190404/.",
      "doi": ""
    },
    {
      "text": "Krishnan Ramanathan, Yogesh Sankarasubramaniam, and Vidhya Govindaraju. 2011. Personalized Video: Leanback Online Video Consumption. In Proceedings of the 34th International ACM SIGIR Conference on Research and Development in Information Retrieval (Beijing, China) (SIGIR ’11). Association for Computing Machinery, New York, NY, USA, 1277–1278. https://doi.org/10.1145/2009916.2010158",
      "doi": "10.1145/2009916.2010158"
    },
    {
      "text": "RNID. 2016. What Happens In An Audiology Appointment. https://rnid.org.uk/information-and-support/hearing-loss/getting-your-hearing-tested/what-happens-in-an-audiology-appointment/.",
      "doi": ""
    },
    {
      "text": "S4C. 2001. Research into the demand for Welsh language subtitling in Wales. RNID, RNID Cymru. https://www.s4c.cymru/abouts4c/corporate/pdf/e_adroddiad_isdeitlo.pdf",
      "doi": ""
    },
    {
      "text": "Jason M. Silveira and Frank M. Diaz. 2014. The effect of subtitles on listeners’ perceptions of expressivity. Psychology of Music 42, 2 (2014), 233–250. https://doi.org/10.1177/0305735612463951",
      "doi": ""
    },
    {
      "text": "David Sloan, Matthew Tylee Atkinson, Colin Machin, and Yunqiu Li. 2010. The Potential of Adaptive Interfaces As an Accessibility Aid for Older Web Users. In Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A) (Raleigh, North Carolina) (W4A ’10). ACM, New York, NY, USA, Article 35, 10 pages. https://doi.org/10.1145/1805986.1806033",
      "doi": "10.1145/1805986.1806033"
    },
    {
      "text": "David Sloan, Peter Gregor, Murray Rowan, and Paul Booth. 2000. Accessible Accessibility. In Proceedings on the 2000 Conference on Universal Usability (Arlington, Virginia, USA) (CUU ’00). ACM, New York, NY, USA, 96–101. https://doi.org/10.1145/355460.355480",
      "doi": ""
    },
    {
      "text": "Peter Thompson. 2000. Notes on Subtitles and Superimpositions. Chicago Media Works 1, 18 (2000), 1–4.",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell, David R. Flatla, and Rachel Menzies. 2018. It’s Not Just the Light: Understanding the Factors Causing Situational Visual Impairments during Mobile Interaction. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). ACM, New York, NY, USA, 338–351. https://doi.org/10.1145/3240167.3240207",
      "doi": "10.1145/3240167.3240207"
    },
    {
      "text": "Garreth W. Tigwell, Benjamin M. Gorman, and Rachel Menzies. 2020. Emoji Accessibility for Visually Impaired People. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376267",
      "doi": "10.1145/3313831.3376267"
    },
    {
      "text": "Sarah J Tracy. 2019. Qualitative research methods: Collecting evidence, crafting analysis, communicating impact. John Wiley & Sons, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "European Broadcasting Union. 2018. EBU-TT-D Subtitling Distribution Format. https://tech.ebu.ch/docs/tech/tech3380.pdf",
      "doi": ""
    },
    {
      "text": "T. Vigier, Y. Baveye, J. Rousseau, and P. Le Callet. 2016. Visual attention as a dimension of QoE: Subtitles in UHD videos. 2016 Eighth International Conference on Quality of Multimedia Experience (QoMEX) 2016, 1 (June 2016), 1–6. https://doi.org/10.1109/QoMEX.2016.7498924",
      "doi": ""
    },
    {
      "text": "W3C. 2019. Making Audio and Video Media Accessible - Captions/Subtitles. https://www.w3.org/WAI/media/av/captions/",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Krzysztof Z. Gajos, Shaun K. Kane, and Gregg C. Vanderheiden. 2018. Ability-Based Design. Commun. ACM 61, 6 (May 2018), 62–71. https://doi.org/10.1145/3148051",
      "doi": "10.1145/3148051"
    }
  ]
}