{
  "doi": "10.1145/3411764.3445060",
  "title": "Perspectives of Bioartists and Community Lab Organizers on Working with Living Organisms",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "There is increasing interest within the HCI community about working with living organisms in the design of interactive systems. Bioartists and community lab participants have worked with living organisms for decades. Their motivations for doing so include artistic expression, design innovation, and activism. We interviewed 12 artists, community lab organizers, and researchers who work with or facilitate work with living organisms. Participants expressed perspectives on working with living organisms and described bioart as an effective practice for engaging and informing the public, fostering transdisciplinary collaborations, and facilitating inspiration and learning from organic processes. They also discussed questions of agency and consent, among other ethical issues in this context. Based on our findings, we present future directions to investigate the potential of hybrid living media interfaces to engage and educate human users, open up possibilities for transdisciplinary collaborations, and participate in ethical dialogues on emerging technologies in a new way.",
  "tags": [
    "community science",
    "DIYbio",
    "transgenic art",
    "biotechnology",
    "Living organisms",
    "bioart"
  ],
  "authors": [
    {
      "name": "S. Nisa Asgarali-Hoffman",
      "institution": "College of Information Studies University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701134",
      "orcid": "missing"
    },
    {
      "name": "Foad Hamidi",
      "institution": "Information Systems Department University of Maryland Baltimore County, United States",
      "img": "/do/10.1145/contrib-81456613170/rel-imgonly/screenshot2018-05-11at3.45.49pm.png",
      "acmid": "81456613170",
      "orcid": "0000-0003-1991-6062"
    }
  ],
  "references": [
    {
      "text": "Mirela Alistar and Margherita Pevere. 2020. Semina Aeternitatis: Using Bacteria for Tangible Interaction with Data. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3334480.3381817",
      "doi": ""
    },
    {
      "text": "American Society for Microbiology. ASM Agar Art Contest | Home. ASM.org. Retrieved December 30, 2020 from https://asm.org/Events/ASM-Agar-Art-Contest/Home",
      "doi": ""
    },
    {
      "text": "Carolyn Angleton. 2019. In pursuit of variegation: Art as research-based collaboration. Antennae Spring 2019, 47 (2019), 119–134.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell. 2018. Danto's Artworld: Art–and Design–as Inquiry. In Critical Theory and Interaction Design. MIT Press, Cambridge, MA, 529–558.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’10), Association for Computing Machinery, New York, NY, USA, 1301–1310. DOI:https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, and Sarah Ng. 2017. Supporting Cultures of Making: Technology, Policy, Visions, and Myths. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), Association for Computing Machinery, New York, NY, USA, 6523–6535. DOI:https://doi.org/10.1145/3025453.3025975",
      "doi": "10.1145/3025453.3025975"
    },
    {
      "text": "Erich Berger, Kasperi Mäki-Reinikka, Kira O'Reilly, and Helena Sederholm (Eds.). 2020. Art as we don't know it. Aalto University.",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’07, ACM Press, San Jose, California, USA, 503–512. DOI:https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Eli Blevis and Erik Stolterman. 2009. The Confluence of Interaction Design & Design: from Disciplinary to Transdisciplinary Perspectives. Sheffield Hallam University, Sheffield, UK. Retrieved January 11, 2021 from http://shura.shu.ac.uk/529/",
      "doi": ""
    },
    {
      "text": "Joachim Boldt. 2018. Machine metaphors and ethics in synthetic biology. Life Sciences, Society and Policy 14, 1 (June 2018), 12. DOI:https://doi.org/10.1186/s40504-018-0077-y",
      "doi": ""
    },
    {
      "text": "Oron Catts and Ionat Zurr. 2008. The ethics of experiential engagement with the manipulation of life. In Tactical Biopolitics: Art, Activism and Technoscience, Beatriz da Costa and Kavita Philip (eds.). The MIT Press. DOI:https://doi.org/10.7551/mitpress/7494.003.0010",
      "doi": ""
    },
    {
      "text": "Adrian David Cheok, Roger Thomas Kok, Chuen Tan, Owen Noel Newton Fernando, Tim Merritt, and Janyn Yen Ping Sen. 2008. Empathetic living media. In Proceedings of the 7th ACM conference on Designing interactive systems (DIS ’08), Association for Computing Machinery, New York, NY, USA, 465–473. DOI:https://doi.org/10.1145/1394445.1394495",
      "doi": "10.1145/1394445.1394495"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’10), Association for Computing Machinery, New York, NY, USA, 1975–1984. DOI:https://doi.org/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Nicola J Fawcett and Anna Dumitriu. 2018. Bacteria on display—can we, and should we? Artistically exploring the ethics of public engagement with science in microbiology. FEMS Microbiology Letters 365, fny101 (June 2018). DOI:https://doi.org/10.1093/femsle/fny101",
      "doi": ""
    },
    {
      "text": "Owen Noel Newton Fernando, Adrian David Cheok, Tim Merritt, Roshan Lalintha Peiris, Charith Lasantha Fernando, Nimesha Ranasinghe, Inosha Wickrama, Kasun Karunanayaka, Tong Wei Chua, and Christopher Aldo Tandar. 2009. Babbage Cabbage: Empathetic Biological Media. VRIC Laval Virtual Proceedings (2009), 363–366.",
      "doi": ""
    },
    {
      "text": "Piyum Fernando, Matthew Pandelakis, and Stacey Kuznetsov. 2016. Practicing DIYBiology In An HCI Setting. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’16), Association for Computing Machinery, New York, NY, USA, 2064–2071. DOI:https://doi.org/10.1145/2851581.2892325",
      "doi": "10.1145/2851581.2892325"
    },
    {
      "text": "Batya Friedman and David Hendry. 2019. Value sensitive design: shaping technology with moral imagination. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Gilad Gome, Julian Waksberg, Andrey Grishko, Iddo Yehoshua Wald, and Oren Zuckerman. 2019. OpenLH: Open Liquid-Handling System for Creative Experimentation with Biology. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’19), Association for Computing Machinery, New York, NY, USA, 55–64. DOI:https://doi.org/10.1145/3294109.3295619",
      "doi": "10.1145/3294109.3295619"
    },
    {
      "text": "Casey Grote, Evan Segreto, Johanna Okerlund, Robert Kincaid, and Orit Shaer. 2015. Eugenie: Multi-Touch and Tangible Interaction for Bio-Design. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’15), Association for Computing Machinery, New York, NY, USA, 217–224. DOI:https://doi.org/10.1145/2677199.2680605",
      "doi": "10.1145/2677199.2680605"
    },
    {
      "text": "Foad Hamidi and Melanie Baljko. 2014. Rafigh: an edible living media installation. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (TEI ’14), Association for Computing Machinery, New York, NY, USA, 345–346. DOI:https://doi.org/10.1145/2540930.2555209",
      "doi": ""
    },
    {
      "text": "Hayden Harvey, Molly Havard, David Magnus, Mildred K. Cho, and Ingmar H. Riedel‐Kruse. 2014. Innocent Fun or “Microslavery”? An ethical analysis of biotic games. Hastings Center Report 44, 6 (2014), 38–46. DOI:https://doi.org/10.1002/hast.386",
      "doi": ""
    },
    {
      "text": "David Holstius, John Kembel, Amy Hurst, Peng-Hui Wan, and Jodi Forlizzi. 2004. Infotropism: living and robotic plants as interactive displays. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS ’04), Association for Computing Machinery, New York, NY, USA, 215–221. DOI:https://doi.org/10.1145/1013115.1013145",
      "doi": "10.1145/1013115.1013145"
    },
    {
      "text": "Eduardo Kac. 1999. Genesis. Retrieved from http://www.ekac.org/geninfo.html",
      "doi": ""
    },
    {
      "text": "Eduardo Kac (Ed.). 2007. Signs of life: bio art and beyond. MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Yasmin Kafai, Orkan Telhan, Karen Hogan, Debora Lui, Emma Anderson, Justice T. Walker, and Sheri Hanna. 2017. Growing Designs with biomakerlab in High School Classrooms. In Proceedings of the 2017 Conference on Interaction Design and Children (IDC ’17), Association for Computing Machinery, New York, NY, USA, 503–508. DOI:https://doi.org/10.1145/3078072.3084316",
      "doi": "10.1145/3078072.3084316"
    },
    {
      "text": "Yasmin Kafai and Justice T. Walker. 2020. Twenty Things to Make with Biology. In Proceedings of the 2020 Constructionism Conference, Dublin, Ireland, 598–606.",
      "doi": ""
    },
    {
      "text": "cindy lin kaiying, Silvia Lindtner, and Stefanie Wuschitz. 2019. Hacking Difference in Indonesia: The Ambivalences of Designing for Alternative Futures. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), Association for Computing Machinery, New York, NY, USA, 1571–1582. DOI:https://doi.org/10.1145/3322276.3322339",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov, Cassandra Barrett, Piyum Fernando, and Kat Fowler. 2018. Antibiotic-Responsive Bioart: Exploring DIYbio as a Design Studio Practice. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–14. DOI:https://doi.org/10.1145/3173574.3174037",
      "doi": "10.1145/3173574.3174037"
    },
    {
      "text": "Stacey Kuznetsov, Carrie Doonan, Nathan Wilson, Swarna Mohan, Scott E. Hudson, and Eric Paulos. 2015. DIYbio Things: Open Source Biology Tools as Platforms for Hybrid Knowledge Production and Scientific Participation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), Association for Computing Machinery, New York, NY, USA, 4065–4068. DOI:https://doi.org/10.1145/2702123.2702235",
      "doi": "10.1145/2702123.2702235"
    },
    {
      "text": "Stacey Kuznetsov, Alex S. Taylor, Tim Regan, Nicolas Villar, and Eric Paulos. 2012. At the seams: DIYbio and opportunities for HCI. In Proceedings of the Designing Interactive Systems Conference (DIS ’12), Association for Computing Machinery, New York, NY, USA, 258–267. DOI:https://doi.org/10.1145/2317956.2317997",
      "doi": "10.1145/2317956.2317997"
    },
    {
      "text": "Andrew Lapworth. 2015. Beyond Bifurcation: Thinking the Abstractions of Art-Science after A. N. Whitehead. TRANSFORMATIONS Journal of Media & Culture 26 (2015), 1–12.",
      "doi": ""
    },
    {
      "text": "Andrew Lapworth. 2015. Habit, art, and the plasticity of the subject: the ontogenetic shock of the bioart encounter. cultural geographies 22, 1 (January 2015), 85–102. DOI:https://doi.org/10.1177/1474474013491926",
      "doi": ""
    },
    {
      "text": "Andrew Lapworth. 2016. Theorizing Bioart Encounters after Gilbert Simondon. Theory, Culture & Society 33, 3 (May 2016), 123–150. DOI:https://doi.org/10.1177/0263276415580173",
      "doi": ""
    },
    {
      "text": "Andrew Lapworth. 2020. Gilbert Simondon and the Technical Mentalities and Transindividual Affects of Art-science. Body & Society 26, 1 (March 2020), 107–134. DOI:https://doi.org/10.1177/1357034X19882750",
      "doi": ""
    },
    {
      "text": "Shaun Lawson, Ben Kirman, Conor Linehan, Tom Feltwell, and Lisa Hopkins. 2015. Problematising Upstream Technology through Speculative Design: The Case of Quantified Cats and Dogs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), Association for Computing Machinery, New York, NY, USA, 2663–2672. DOI:https://doi.org/10.1145/2702123.2702260",
      "doi": "10.1145/2702123.2702260"
    },
    {
      "text": "Seung Ah Lee, Engin Bumbacher, Alice M. Chung, Nate Cira, Byron Walker, Ji Young Park, Barry Starr, Paulo Blikstein, and Ingmar H. Riedel-Kruse. 2015. Trap it! A Playful Human-Biology Interaction for a Museum Installation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), Association for Computing Machinery, New York, NY, USA, 2593–2602. DOI:https://doi.org/10.1145/2702123.2702220",
      "doi": ""
    },
    {
      "text": "Clara Mancini. 2017. Towards an animal-centred ethics for Animal–Computer Interaction. International Journal of Human-Computer Studies 98, (February 2017), 221–233. DOI:https://doi.org/10.1016/j.ijhcs.2016.04.008",
      "doi": "10.1016/j.ijhcs.2016.04.008"
    },
    {
      "text": "Marta de Menezes. 2000. Nature? Retrieved from https://martademenezes.com/portfolio/projects/",
      "doi": ""
    },
    {
      "text": "Marta de Menezes. 2015. Biology as a new media for art: An art research endeavour. Technoetic Arts 13, 1–2 (June 2015), 115–123. DOI:https://doi.org/10.1386/tear.13.1-2.115_1",
      "doi": ""
    },
    {
      "text": "Timothy Merritt, Foad Hamidi, Mirela Alistar, and Marta DeMenezes. 2020. Living media interfaces: a multi-perspective analysis of biological materials for interaction. Digital Creativity 31, 1 (January 2020), 1–21. DOI:https://doi.org/10.1080/14626268.2019.1707231",
      "doi": ""
    },
    {
      "text": "Robert Mitchell. 2010. Bioart and the vitality of media. University of Washington Press, Seattle. Retrieved from http://site.ebrary.com/id/11137375",
      "doi": ""
    },
    {
      "text": "William Myers. 2012. Bio design: nature, science, creativity. Museum of Modern Art: Distributed in the United States and Canada by ARTBOOK/D.A.P, New York.",
      "doi": ""
    },
    {
      "text": "William Myers. 2015. Bio art: altered realities. Thames & Hudson, New York, New York.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–16. DOI:https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Marietta Radomska. 2017. Non/living Matter, Bioscientific Imaginaries and Feminist Technoecologies of Bioart. Australian Feminist Studies 32, 94 (2017), 377–394. DOI:https://doi.org/10.1080/08164649.2017.1466649",
      "doi": ""
    },
    {
      "text": "Charlotte Robinson, Clara Mancini, Janet van der Linden, Claire Guest, Lydia Swanson, Helen Marsden, Jose Valencia, and Brendan Aengenheister. 2015. Designing an emergency communication system for human and assistance dog partnerships. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp ’15), Association for Computing Machinery, New York, NY, USA, 337–347. DOI:https://doi.org/10.1145/2750858.2805849",
      "doi": "10.1145/2750858.2805849"
    },
    {
      "text": "Phoebe Sengers, Kirsten Boehner, Shay David, and Joseph “Jofish” Kaye. 2005. Reflective design. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (CC ’05), Association for Computing Machinery, New York, NY, USA, 49–58. DOI:https://doi.org/10.1145/1094562.1094569",
      "doi": "10.1145/1094562.1094569"
    },
    {
      "text": "Elizabeth R. Straughan. 2019. A touching experiment: Tissue culture, tacit knowledge, and the making of bioart. Transactions of the Institute of British Geographers 44, 2 (June 2019), 214–225. DOI:https://doi.org/10.1111/tran.12272",
      "doi": ""
    },
    {
      "text": "Nora S. Vaage. 2016. What Ethics for Bioart? Nanoethics 10, 1 (April 2016), 87–104. DOI:https://doi.org/10.1007/s11569-016-0253-6",
      "doi": ""
    },
    {
      "text": "Michelle Westerlaken and Stefano Gualeni. 2016. Becoming with: towards the inclusion of animals as participants in design processes. In Proceedings of the Third International Conference on Animal-Computer Interaction (ACI ’16), Association for Computing Machinery, New York, NY, USA, 1–10. DOI:https://doi.org/10.1145/2995257.2995392",
      "doi": "10.1145/2995257.2995392"
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. bioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), Association for Computing Machinery, New York, NY, USA, 1–10. DOI:https://doi.org/10.1145/2702123.2702611",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Ali K. Yetisen, Joe Davis, Ahmet F. Coskun, George M. Church, and Seok Hyun Yun. 2015. Bioart. Trends in Biotechnology 33, 12 (December 2015), 724–734. DOI:https://doi.org/10.1016/j.tibtech.2015.09.011",
      "doi": ""
    },
    {
      "text": "Ionat Zurr and Oron Catts. 2003. Are the Semi-Living semi-good or semi-evil? Technoetic Arts 1, 1 (March 2003), 47–60. DOI:https://doi.org/10.1386/tear.1.1.47/0",
      "doi": ""
    }
  ]
}