{
  "doi": "10.1145/3411764.3445348",
  "title": "A Chinese-Language Validation of the Video Game Demand Scale (VGDS-C): Measuring the Cognitive, Emotional, Physical, and Social Demands of Video Games",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2021,
  "badges": [],
  "abstract": "Video games are engaging multimedia experiences that require players’ cognitive, emotional, physical (in terms of controllers and exertion), and social faculties. Recent theorizing has suggested that these dimensions of demand can explain processes by which players engage with and respond to gameplay. A relatively new measure—the five-factor, 26-item Video Game Demand Scale (VGDS)—has been tested for dimensionality and measurement validity with English- and German-speaking players, but not for other play populations. Given the popularity of video games among Chinese-speaking players, this brief report demonstrates a successful translation of VGDS into Traditional Chinese (VGDS-C). A sample of N = 863 Chinese speakers in Taiwan were asked to recall and describe a recent gaming experience before completing the VGDS-C along with other gaming-related measures (tests of construct validity). VGDS-C was shown to be a reliable and valid way of assessing players’ perceptions of the myriad demands of video gaming.",
  "tags": [
    "user experience",
    "demand",
    "interactivity",
    "video games",
    "scale development"
  ],
  "authors": [
    {
      "name": "Nicholas David Bowman",
      "institution": "Media and Communication Texas Tech University, United States",
      "img": "/do/10.1145/contrib-81548025398/rel-imgonly/735546_10102888428597754_1455166459_o.jpg",
      "acmid": "81548025398",
      "orcid": "0000-0001-5594-9713"
    },
    {
      "name": "JihHsuan Tammy Lin",
      "institution": "National Chengchi University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163053",
      "orcid": "missing"
    },
    {
      "name": "Chieh Wu",
      "institution": "National Chengchi University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701595",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jaime Banks. 2015. Object, me, symbiote, other: A social typology of player-avatar relationships. First Monday 20, 2 (2015). DOI: https://doi.org/10.5210/fm.v20i2.5433",
      "doi": ""
    },
    {
      "text": "Deborah L. Bandalos and Sara Finney. 2019. Factor analysis. Exploratory and confirmatory. New York: Routledge.",
      "doi": ""
    },
    {
      "text": "Miquel Barreda-Ángeles, Sara Aleix-Guillaume, and Alexandre Perada-Baños. 2020. An “empathy machine” or a “just-for-the-fun-of-it” machine? Effects of immersion in nonfiction 360-video stories on empathy and enjoyment. Cyberpsychology, Behavior, and Social Networking 23, 10 (2020), 683-688. DOI: https://doi.org/10.1089/cyber.2019.0665",
      "doi": ""
    },
    {
      "text": "Daniel J. Benjamin, James O. Berger, Magnus Johannesson, Brian A. Nosek, Eric-Jan Wagenmakers … Valen E. Johnson. 2018. Redefine statistical significance. Nature Human Behavior 2, (2018), 6-10. DOI: https://doi.org/10.1038/s41562-017-0189-z",
      "doi": ""
    },
    {
      "text": "Julia A. Bopp, Elisa D. Mekler, and Klaus Opwis. 2016. Negative emotion, positive experiences? Emotionally moving moments in digital games. Proceedings of the 2016 CHI conference on human factors in computing systems, 2996-3006. DOI: https://doi.org/10.1145/2858036.2858227",
      "doi": "10.1145/2858036.2858227"
    },
    {
      "text": "Julia A. Bopp, Klaus Opwis, and Elisa D. Mekler. 2018. “An odd kind of pleasure”: Differentiating emotional challenge in digital games. Proceedings of the 2018 CHI conference on human factors in computing systems, 1-12. DOI: https://doi.org/10.1145/3173574.3173615",
      "doi": ""
    },
    {
      "text": "Nicholas D. Bowman (Ed.). 2018. Video games: A medium that demands our attention. New York: Routledge.",
      "doi": ""
    },
    {
      "text": "Nicholas D. Bowman. 2019. Editorial: Video games as demanding technologies. Media and Communication 7, 4 (2019), 144-148. DOI: https://doi.org/10.17645.mac.v7i4.2684",
      "doi": ""
    },
    {
      "text": "Nicholas D. Bowman and Alan Goodboy. 2020. Evolving considerations and empirical approaches to construct validity in communication science. Annals of the International Communication Association 44, 3 (2020), 219-234. DOI: https://doi.org/10.1080/23808985.2020.1792791",
      "doi": ""
    },
    {
      "text": "Nicholas D. Bowman, Justin R. Keene, and Christina Jimenez Najera. 2021. Flow encourages task focus, but frustration drives task switching: How reward and effort combine to influence player engagement in a simple video game. Proceedings of the CHI conference on human factors in computing systems. 14 pages. DOI: https://doi.org/10.1145/3411764.3445678.",
      "doi": ""
    },
    {
      "text": "Nicholas D. Bowman and Ron Tamborini. 2015: “In the mood to game”: Selective exposure and mood management processes in computer game play. New Media & Society 17, 3 (2015), 375-393. DOI: https://doi.org/10.1177%2F1461444813504274",
      "doi": ""
    },
    {
      "text": "Nicholas D. Bowman, Joseph Wasserman, and Jaime Banks. 2018. Video games: A medium that demands our attention. Development of the video game demand scale. Routledge, New York, NY.",
      "doi": ""
    },
    {
      "text": "Erik P. Bucy. 2004. Interactivity in society: Locating an elusive concept. The Information Society 20, 373-383. DOI: https://doi.org/10.1080/01972240490508063",
      "doi": ""
    },
    {
      "text": "Paul Cairns. 2019. Doing better statistics in human-computer interaction. Cambridge, UK: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Jenova Chen. 2007. Flow in games (and everything else). Communications of the ACM 50, 4 (April 2007), 31-34. DOI: https://doi.org/10.1145/1232743.1232769",
      "doi": "10.1145/1232743.1232769"
    },
    {
      "text": "Rowan Daneels, Steven Malliet, Lieven Geerts, Natalie Denayer, Michel Walrave, and Heidi Vandebosch. 20210. Assassins, gods, and androids: How narratives and game mechanics shape eudaimonic game experiences. Media and Communication 9, 1 (2021). DOI: http://dx.doi.org/10.17645/mac.v9i1.3205",
      "doi": ""
    },
    {
      "text": "Frederic de Grove, Johannes Breuer, Vivian Chen, Thorsten Quandt, Rabindra Ratan, and Jan van Looy. 2017. Validating the digital games motivation scale for comparative research between countries. Communication Research Reports 34, 1 (2017), 37-47. DOI: https://doi.org/10/1080/08824096.2016",
      "doi": ""
    },
    {
      "text": "Alena Denisova, Paul Cairns, Christian Guckelsberger, and David Zendle. 2020. Measuring perceived challenge originating from recent gameplay interaction scale (CORGIS). International Journal of Human-Computer Studies 137. DOI: https://doi.org/10.1016/j.ijhcs.2019.102383",
      "doi": ""
    },
    {
      "text": "David M. Eberhard, Gary F. Simons, and Charles D. Fennig (Eds.). 2020. Ethnologue: Languages of the World: Chinese, Mandarin. https://www.ethnologue.com/language/cmn",
      "doi": ""
    },
    {
      "text": "Allison Eden, David R. Ewoldsen, Joomi Lee, and David Beyea. 2018. Behavioral demands as behavioral affordances in video games. Video games: A medium that demands our attention. New York, NY: Routledge",
      "doi": ""
    },
    {
      "text": "Jacob T. Fisher, Frederic R. Hopp, and Rene Weber. 2019. Modality-specific effects of perceptual load in multimedia processing. Media and Communication 7, 4 (2019), 149-165. DOI: https://doi/org/10.17645/mac.v7i4.2388",
      "doi": ""
    },
    {
      "text": "Jacob T. Fisher, Richard Huskey, Justin R. Keene, and Rene Weber. 2018. The limited capacity model of motivated mediated message processing: Looking to the future. Annals of the International Communication Association, (2018), 1-21. DOI: https://doi.org/10.1080.23808985.2018.1534551",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2003. What video games have to teach us about learning and literacy. Computers in Entertainment 1, 1 (2003), 1-20.",
      "doi": "10.1145/950566.950595"
    },
    {
      "text": "Chad P. R. Gowler and Ioanna Iacovides. 2019. “Horror, guilt and shame” – Uncomfortable experiences in digital games. Proceedings of the annual symposium on computer-human interaction in play, 325-337. DOI: https://doi.org/10.1145/3311350.3347179",
      "doi": ""
    },
    {
      "text": "Shawn C. Green and Daphne Bavelier. 2003. Action video game modifies visual selective attention. Nature 423, 6939 (2003), 534-537.",
      "doi": ""
    },
    {
      "text": "Torben Grodal. 2000. Video games and the pleasures of control. Media entertainment: The psychology of its appeal. Lawrence Erlbaum Associates, Inc., Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of the NASA-TLX (Task Load Index): Results of empirical and theoretical research. Advances in Psychology 52 (1988), 139-183. DOI: https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Andrew F. Hayes and Jacob J. Coutts. 2020. Use omega rather than Cronbach's alpha for estimating reliability. But … Communication Methods and Measures 14, 1 (2020). DOI: https://doi.org/10.1080/19312458.2020.1718629",
      "doi": ""
    },
    {
      "text": "Scott H. Hemenover and Nicholas D. Bowman. 2018. Video games, emotion, and emotion regulation: bridging the gap. Annals of the International Communication Association 42, 2 (2018), 125-143. DOI: https://doi.org/10.1080/23808985.2018.1442239",
      "doi": ""
    },
    {
      "text": "Joseph Henrich, Steven J. Heine, and Ara Norenzayan. 2010. The weirdest people in the world? Behavioral and Brain Sciences (2010). DOI: https://doi/org/:10.1017/S0140525X0999152X",
      "doi": ""
    },
    {
      "text": "Matt C. Howard. 2016. A review of exploratory factor analysis decisions and overview of current practices: What we are doing and how can we improve? International Journal of Human-Computer Interaction 32, 1 (2016), 51-62. DOI: 10.1080/10447318.2015.1087664",
      "doi": ""
    },
    {
      "text": "James D. Ivory. 2013. Video games as a multifaced medium: A review of quantitative social science research on video games and a typology of video game research approaches. Review of Communication Research 1, 1 (2013), 31-68. DOI: https://doi.org/10.12840/issn.2255-4165_2013_01.01_002",
      "doi": ""
    },
    {
      "text": "James D. Ivory. 2015. A brief history of video games. The video game debate. New York: Routledge.",
      "doi": ""
    },
    {
      "text": "David M. Keating and Daniel Totzkay. 2019. We do publish (conceptual) replications (sometimes): Publication trends in communication science, 2007-2016. Annals of the International Communication Association 43, 3 (2019), 225-239. DOI: https://doi.org/10.1080/23808985.2019.1632218",
      "doi": ""
    },
    {
      "text": "Kevin Koban and Nicholas D. Bowman. 2020. Further validation and cross-cultural replication of the video game demand scale. Journal of Media Psychology (2020). DOI: https://doi.org/10.1027/1864-1105/a000280.",
      "doi": ""
    },
    {
      "text": "Annie Lang. 2020. The limited capacity model of mediated message processing. Journal of Communication 50, (2000), 46-70. DOI: https://doi.org/10.1111/j.1460-2466.2000.tb02833.x",
      "doi": ""
    },
    {
      "text": "Anthony Limperos, Edward P. Downs, James D. Ivory, and Nicholas D Bowman. 2013. Leveling up: A review of current and emerging area of interest in video games and future research direction. Communication Yearbook 37, 349-377.",
      "doi": ""
    },
    {
      "text": "Benny Liebold, Nicholas D. Bowman, and Daniel Pietschmann. 2020. Natural in the eyes of the (be)holder: A survey on novelty and learning effects in the enjoyment of naturally mapped video game controllers. Psychology of Popular Media Culture 9, 2 (2020), 255-265. DOI: https://doi.org/10.1037/ppm0000215",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler, Ioanna Iacovides, and Julia A. Bopp. 2018. “A game that makes you question…”: Exploring the role of reflection for the player experience. Proceedings of the 2018 annual symposium on computer-human interaction in play, 315-327. DOI: https://doi.org/10.1145/3242671.3242691",
      "doi": ""
    },
    {
      "text": "Bree McEwan, Christopher J. Carpenter, and David Westerman. 2018. On replication in communication science. Communication Studies 69, 3 (2018). DOI: https://doi.org/10.1080/10510974.2018.1464938",
      "doi": ""
    },
    {
      "text": "Sid Meier. 2013. Interesting decisions. Games Developers Conference Vault. San Francisco, CA. Retrieved from https://www.gdcvault.com/play/1015756/Interesting",
      "doi": ""
    },
    {
      "text": "Mary Beth Oliver, Nicholas D. Bowman, Julia K. Woolley, Ryan Rogers, Brett I. Sherrick, and Mun-Young Chung. 2015. Video games as meaningful entertainment experiences. Psychology of Popular Media and Culture 5, 4 (2015), 390-405. DOI: https://doi.org/10.1037/ppm0000066",
      "doi": ""
    },
    {
      "text": "Mary Beth Oliver and Arthur A Raney. 2011. Entertainment as pleasurable and meaningful: identifying hedonic and eudaimonic motivations for entertainment consumption. Journal of Communication 61, 5 (2011), 984-1004. DOI: https://doi.org/10.1111/j.1460-2466.2011.01585.x",
      "doi": ""
    },
    {
      "text": "Newzoo. 2018. Taiwan games market 2018. (2018). Retrieved from https://newzoo.com/insights/infographics/taiwan-games-market-2018/",
      "doi": ""
    },
    {
      "text": "Niko Partners. 2017. Taiwan Games Market Report. (2017). Retrieved from https://nikopartners.com/taiwan-games-market-report/",
      "doi": ""
    },
    {
      "text": "Fred Paas. 1992. Training strategies for attaining transfer of problem-solving skill in statistics: A cognitive load approach. Journal of Educational Psychology 84, 4 (1992), 429-434. DOI: https://psycnet.apa.org/doi/10.1037/0022-0663.84.4.429",
      "doi": ""
    },
    {
      "text": "Geah Pressgrove and Nicholas D. Bowman. 2020. From immersion to intention? Exploring advances in prosocial storytelling. International Journal of Nonprofit and Voluntary Sector Marketing (2020). https://doi.org/10.1002/nvsm.1689",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, C. Scott Rigby, and Richard M. Ryan. 2010. A motivation model of video game engagement. Review of General Psychology 14, 2 (2010),154-166. DOI: https://doi.org/10.1037/z019440",
      "doi": ""
    },
    {
      "text": "Ryan Rogers, Nicholas D. Bowman, and Mary Beth Oliver. 2015. It's not the model that doesn't fit, it's the controller! The role of cognitive skills in understanding the links between natural mapping, performance, and enjoyment of console video games. Computers in Human Behavior 49, (2015), 588-596. DOI: https://doi.org/10.1016/j.chb.03.027",
      "doi": "10.1016/j.chb.2015.03.027"
    },
    {
      "text": "Ryan Rogers, Julia K. Woolley, Mary Beth Oliver, Nicholas D. Bowman, and Brett Sherrick. 2016. Fun versus meaningful videogame experiences: A qualitative analysis of user responses. Computer Games Journal 6, 1-2 (2016), 63-79. https://doi.org/10.1007/s40869-016-0029-9",
      "doi": ""
    },
    {
      "text": "Yves Rosseel. 2012. Lavaan: An R package for structural equation modeling. Journal of Statistical Software 48, 2 (2012). 1-32. DOI: http://dx.doi.org/10.18637/jss.v048.i02",
      "doi": ""
    },
    {
      "text": "Christian Roth and Hartmut Koenitz. 2016. Evaluating the user experience of interactive digital narrative. Proceedings of the 1st International Workshop on Multimedia Alternate Realities, 31-36. DOI: https://doi.org/10.1145/2983298.2983302",
      "doi": "10.1145/2983298.2983302"
    },
    {
      "text": "Ami D. Sperber. 2004. Translation and validation of study instruments for cross-cultural research. Gastroenterology 126, (2004), S124-128. DOI: https://doi.org/10.1053/j.gastro.2003.10.016",
      "doi": ""
    },
    {
      "text": "Constance A. Steinkuehler and Dmitri Williams. 2006. Where everybody knows your (screen) name: Online game as “third places.” Journal of Computer-Mediated Communication 11, 4 (2006). 885-909. DOI: https://doi.org/10.1111/j.1083-6101.2006.00300.x",
      "doi": ""
    },
    {
      "text": "Jesse Schell, 2008. The art of game design. Morgan Kaufmann, Burlington, MA.",
      "doi": ""
    },
    {
      "text": "Christina Schumann, Nicholas D Bowman, and Daniel Schultheiss. 2016. Quality in video games: Subjective quality assessments as predictors of self-reported presence in first-person shooters and role-playing games. Journal of Broadcasting and Electronic Media 60, 4 (2016), 547-566. DOI: https://doi.org/10.1080/08838151.2016.1234473.",
      "doi": ""
    },
    {
      "text": "Constance A. Steinkuehler and Dmitri Williams. 2006. Where everybody knows your (screen) name: Online game as “third places.” Journal of Computer-Mediated Communication 11, 4 (2006). 885-909. DOI: https://doi.org/10.1111/j.1083-6101.2006.00300.x",
      "doi": ""
    },
    {
      "text": "Jonathan Steuer. 1992. Defining virtual reality: Dimensions determining telepresence. Journal of Communication 42, 4 (1992), 73-93. DOI: http://doi.org/10.1111/j.1460-2466.1992.tb00812.x",
      "doi": "10.1111/j.1460-"
    },
    {
      "text": "Rudolf Stöber. 2004. What media evolution is: A theoretical approach to the history of new media. European Journal of Communication 19, 4 (2004), 483-505. DOI: https://doi.org/10.1177%2F0267323104049461",
      "doi": ""
    },
    {
      "text": "Shyam S. Sundar. 2004. Theorizing interactivity's effects. The Information Society 20, 385-389. DOI: https://doi.org/10.1080/01972240490508072",
      "doi": ""
    },
    {
      "text": "Shyam S. Sundar and Anthony Limperos. 2013. Uses and grats 2.0: New gratifications for new media. Journal of Broadcasting and Electronic Media 57, 4 (2013), 504-525. DOI: https://doi.org/10.1080/0883811.2013.845827",
      "doi": ""
    },
    {
      "text": "Ron Tamborini, Nicholas D. Bowman, Allison Eden, Matthew Grizzard, and Ashley Organ. 2010. Defining media enjoyment as the satisfaction of intrinsic needs. Journal of Communication 60, 4 (201), 758-777. DOI: https://doi.org/10.1111/j.1460-2466.2010.01513.x",
      "doi": ""
    },
    {
      "text": "Jukka Vahlo and Veli-Matti Karhulahti. 2020. Challenge types in gaming validation of video game challenge inventory (CHA). International Journal of Human-Computer Studies, 143 (2020). DOI: https://doi.org/10.1016/j.ijhcs.2020.102473",
      "doi": ""
    },
    {
      "text": "William S-Y. Wang. 2973. The Chinese language. Scientific American 228, 2 (February 1973), 50-63.",
      "doi": ""
    },
    {
      "text": "Evan R. Watts, Kevin Koban, and Nicholas D Bowman. 2021. Digital gaming audiences: awareness, without closeness. Entertainment Computing 26 (2021). DOI: https://doi.org/10.1016/j.entcom.2020.100384",
      "doi": ""
    },
    {
      "text": "Michael Wellenreiter. 2015. Screenwriting and authorial control in narrative video games. Journal of Screenwriting 6, 3 (2015), 343-361. DOI: https://doi.org/10.1386/josc.6.3.343_1",
      "doi": ""
    },
    {
      "text": "Matthew A. Whitby, Sebastian Deterding, and Ioana Iacovides. 2019. “One of the baddies all along:” Moments that challenge a player's perspective. Proceedings of the annual symposium on computer-human interaction in play. 339-350. DOI: https://doi.org/10.1145/3311350.3347192",
      "doi": "10.1145/3311350.3347192"
    },
    {
      "text": "Shuigeng Zhou, Guobiao Hu, Zhongzhi Zhang, and Jihong Guan. 2008. An empirical study of Chinese language networks. Physica A: Statistical mechanics and its applications 387, 12 (May 2008). 3039-3047. DOI: https://doi.org/10.1016/j.physa.2008.01.024",
      "doi": ""
    }
  ]
}