{
  "doi": "10.1145/3411764.3445618",
  "title": "CoNotate: Suggesting Queries Based on Notes Promotes Knowledge Discovery",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "When exploring a new domain through web search, people often struggle to articulate queries because they lack domain-specific language and well-defined informational goals. Perhaps search tools rely too much on the query to understand what a searcher wants. Towards expanding this contextual understanding of a user during exploratory search, we introduce a novel system, CoNotate, which offers query suggestions based on analyzing the searcher’s notes and previous searches for patterns and gaps in information. To evaluate this approach, we conducted a within-subjects study where participants (n=38) conducted exploratory searches using a baseline system (standard web search) and the CoNotate system. The CoNotate approach helped searchers issue significantly more queries, and discover more terminology than standard web search. This work demonstrates how search can leverage user-generated content to help people get started when exploring complex, multi-faceted information spaces.",
  "authors": [
    {
      "name": "Srishti Palani",
      "institution": "University of California, United States",
      "img": "/do/10.1145/contrib-99659569986/rel-imgonly/screen_shot_2021-10-08_at_9.48.11_am.jpeg",
      "acmid": "99659569986",
      "orcid": "0000-0003-1805-7307"
    },
    {
      "name": "Zijian Ding",
      "institution": "University of California, United States",
      "img": "/do/10.1145/contrib-99659681789/rel-imgonly/jason.jpg",
      "acmid": "99659681789",
      "orcid": "missing"
    },
    {
      "name": "Austin Nguyen",
      "institution": "University of California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700462",
      "orcid": "missing"
    },
    {
      "name": "Andrew Chuang",
      "institution": "University of California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700952",
      "orcid": "missing"
    },
    {
      "name": "Stephen MacNeil",
      "institution": "University of California, United States",
      "img": "/do/10.1145/contrib-99658729935/rel-imgonly/h3.jpg",
      "acmid": "99658729935",
      "orcid": "missing"
    },
    {
      "name": "Steven P. Dow",
      "institution": "Department of Cognitive Science University of California, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81758794857",
      "orcid": "0000-0002-1354-9866"
    }
  ],
  "references": [
    {
      "text": "Elena Agapie, Gene Golovchinsky, and Pernilla Qvarfordt. 2013. Leading people to longer queries. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3019–3022.",
      "doi": "10.1145/2470654.2481418"
    },
    {
      "text": "Mohammad Aliannejadi, Hamed Zamani, Fabio Crestani, and W Bruce Croft. 2019. Asking clarifying questions in open-domain information-seeking conversations. In Proceedings of the 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval. 475–484.",
      "doi": "10.1145/3331184.3331265"
    },
    {
      "text": "Anne Aula and Daniel M Russell. 2008. Complex and exploratory web search. In Information Seeking Support Systems Workshop (ISSS 2008), Chapel Hill, NC, USA.",
      "doi": ""
    },
    {
      "text": "Ricardo Baeza-Yates, Carlos Hurtado, and Marcelo Mendoza. 2004. Query recommendation using query logs in search engines. In International Conference on Extending Database Technology. Springer, 588–596.",
      "doi": "10.1007/978-3-540-30192-9_58"
    },
    {
      "text": "Ricardo Baeza-Yates and Yoelle Maarek. 2012. Usage data in web search: benefits and limitations. In International Conference on Scientific and Statistical Database Management. Springer, 495–506.",
      "doi": ""
    },
    {
      "text": "Marcia J Bates. 1979. Information search tactics. Journal of the American Society for information Science 30, 4(1979), 205–214.",
      "doi": ""
    },
    {
      "text": "Michael Bernstein, Max Van Kleek, David Karger, and MC Schraefel. 2008. Information scraps: How and why information eludes our personal information management tools. ACM Transactions on Information Systems (TOIS) 26, 4 (2008), 1–46.",
      "doi": "10.1145/1402256.1402263"
    },
    {
      "text": "Mikhail Bilenko and Ryen W White. 2008. Mining the search trails of surfing crowds: identifying relevant websites from user activity. In Proceedings of the 17th international conference on World Wide Web. 51–60.",
      "doi": "10.1145/1367497.1367505"
    },
    {
      "text": "Steven Bird, Ewan Klein, and Edward Loper. 2009. Natural language processing with Python: analyzing text with the natural language toolkit. ” O’Reilly Media, Inc.”.",
      "doi": "10.5555/1717171"
    },
    {
      "text": "Pia Borlund. 2003. The IIR evaluation model: a framework for evaluation of interactive information retrieval systems. Information research 8, 3 (2003), 8–3.",
      "doi": ""
    },
    {
      "text": "Joel Brandt, Mira Dontcheva, Marcos Weskamp, and Scott R Klemmer. 2010. Example-centric programming: integrating web search into the development environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 513–522.",
      "doi": "10.1145/1753326.1753402"
    },
    {
      "text": "Robert Capra and Jaime Arguello. 2019. Using Trails to Support Users with Tasks of Varying Scope. In Proceedings of the 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval. 977–980.",
      "doi": "10.1145/3331184.3331290"
    },
    {
      "text": "Robert Capra, Jaime Arguello, Anita Crescenzi, and Emily Vardell. 2015. Differences in the use of search assistance for tasks of varying complexity. In Proceedings of the 38th International ACM SIGIR Conference on Research and Development in Information Retrieval. 23–32.",
      "doi": "10.1145/2766462.2767741"
    },
    {
      "text": "Robert Capra, Gary Marchionini, Javier Velasco-Martin, and Katrina Muller. 2010. Tools-at-hand and learning in multi-session, collaborative search. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 951–960.",
      "doi": "10.1145/1753326.1753468"
    },
    {
      "text": "Ben Carterette, Evangelos Kanoulas, Mark Hall, and Paul Clough. 2014. Overview of the TREC 2014 session track. Technical Report. DELAWARE UNIV NEWARK DEPT OF COMPUTER AND INFORMATION SCIENCES.",
      "doi": ""
    },
    {
      "text": "Joseph Chee Chang, Nathan Hahn, Adam Perer, and Aniket Kittur. 2019. SearchLens: Composing and capturing complex user interests for exploratory search. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 498–509.",
      "doi": "10.1145/3301275.3302321"
    },
    {
      "text": "Hao Chen and Susan Dumais. 2000. Bringing order to the web: Automatically categorizing search results. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 145–152.",
      "doi": "10.1145/332040.332418"
    },
    {
      "text": "MML Chiu, SKW Chu, KKK Ting, and GYC Yau. 2011. A novice-expert comparison in information search. Information Science 23(2011), 225–238.",
      "doi": ""
    },
    {
      "text": "Anita Crescenzi, Yuan Li, Yinglong Zhang, and Rob Capra. 2019. Towards Better Support for Exploratory Search through an Investigation of Notes-to-self and Notes-to-share. In Proceedings of the 42nd International ACM SIGIR Conference on Research and Development in Information Retrieval. 1093–1096.",
      "doi": "10.1145/3331184.3331309"
    },
    {
      "text": "Douglass R Cutting, David R Karger, Jan O Pedersen, and John W Tukey. 2017. Scatter/gather: A cluster-based approach to browsing large document collections. In ACM SIGIR Forum, Vol. 51. ACM New York, NY, USA, 148–159.",
      "doi": ""
    },
    {
      "text": "Allen Cypher, Mira Dontcheva, Tessa Lau, and Jeffrey Nichols. 2010. No code required: giving users tools to transform the web. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2018. Bert: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint arXiv:1810.04805(2018).",
      "doi": ""
    },
    {
      "text": "Debora Donato, Francesco Bonchi, Tom Chi, and Yoelle Maarek. 2010. Do you want to take notes? Identifying research missions in Yahoo! Search Pad. In Proceedings of the 19th international conference on World wide web. 321–330.",
      "doi": "10.1145/1772690.1772724"
    },
    {
      "text": "Gilles Fauconnier and Mark Turner. 1998. Conceptual integration networks. Cognitive science 22, 2 (1998), 133–187.",
      "doi": ""
    },
    {
      "text": "Kristie Fisher, Scott Counts, and Aniket Kittur. 2012. Distributed sensemaking: improving sensemaking by leveraging the efforts of previous users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 247–256.",
      "doi": "10.1145/2207676.2207711"
    },
    {
      "text": "William B Frakes and Ricardo Baeza-Yates. 1992. Information retrieval: data structures and algorithms. Prentice-Hall, Inc.",
      "doi": ""
    },
    {
      "text": "Cristin Ailidh Fraser. 2020. Contextually Recommending Expert Help and Demonstrations to Improve Creativity. Ph.D. Dissertation. University of California, San Diego.",
      "doi": ""
    },
    {
      "text": "Susan Gauch, Mirco Speretta, Aravind Chandramouli, and Alessandro Micarelli. 2007. User profiles for personalized information access. In The adaptive web. Springer, 54–89.",
      "doi": ""
    },
    {
      "text": "Souvick Ghosh, Manasa Rath, and Chirag Shah. 2018. Searching as learning: Exploring search behavior and learning outcomes in learning-related tasks. In Proceedings of the 2018 Conference on Human Information Interaction & Retrieval. 22–31.",
      "doi": "10.1145/3176349.3176386"
    },
    {
      "text": "Nitesh Goyal, Gilly Leshed, and Susan R Fussell. 2013. Effects of visualization and note-taking on sensemaking and analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2721–2724.",
      "doi": "10.1145/2470654.2481376"
    },
    {
      "text": "Nathan Hahn, Joseph Chang, Ji Eun Kim, and Aniket Kittur. 2016. The Knowledge Accelerator: Big picture thinking in small pieces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2258–2270.",
      "doi": "10.1145/2858036.2858364"
    },
    {
      "text": "Ken Hinckley, Shengdong Zhao, Raman Sarin, Patrick Baudisch, Edward Cutrell, Michael Shilman, and Desney Tan. 2007. InkSeine: In Situ search for active note taking. In Proceedings of the SIGCHI conference on human factors in computing systems. 251–260.",
      "doi": "10.1145/1240624.1240666"
    },
    {
      "text": "Orland Hoeber and Xue Dong Yang. 2006. A comparative user study of web search interfaces: HotMap, Concept Highlighter, and Google. In 2006 IEEE/WIC/ACM International Conference on Web Intelligence (WI 2006 Main Conference Proceedings)(WI’06). IEEE, 866–874.",
      "doi": "10.1109/WI.2006.6"
    },
    {
      "text": "Christoph Hölscher and Gerhard Strube. 2000. Web search behavior of Internet experts and newbies. Computer networks 33, 1-6 (2000), 337–346.",
      "doi": ""
    },
    {
      "text": "Ingrid Hsieh-Yee. 1993. Effects of search experience and subject knowledge on the search tactics of novice and experienced searchers. Journal of the american society for information science 44, 3(1993), 161–174.",
      "doi": ""
    },
    {
      "text": "Rong Hu, Kun Lu, and Soohyung Joo. 2013. Effects of topic familiarity and search skills on query reformulation behavior. Proceedings of the American Society for Information Science and Technology 50, 1 (2013), 1–9.",
      "doi": "10.5555/2655780.2655846"
    },
    {
      "text": "Jeff Huang, Ryen W White, and Susan Dumais. 2011. No clicks, no problem: using cursor movements to understand and improve search. In Proceedings of the SIGCHI conference on human factors in computing systems. 1225–1234.",
      "doi": "10.1145/1978942.1979125"
    },
    {
      "text": "Himanshu Jain, Venkatesh Balasubramanian, Bhanu Chunduri, and Manik Varma. 2019. Slice: Scalable linear extreme classifiers trained on 100 million labels for related searches. In Proceedings of the Twelfth ACM International Conference on Web Search and Data Mining. 528–536.",
      "doi": "10.1145/3289600.3290979"
    },
    {
      "text": "Bernard J Jansen and Michael D McNeese. 2005. Evaluating the effectiveness of and patterns of interactions with automated searching assistance. Journal of the American Society for Information Science and Technology 56, 14 (2005), 1480–1503.",
      "doi": "10.5555/1103646.1103650"
    },
    {
      "text": "Renée S Jansen, Daniel Lakens, and Wijnand A IJsselsteijn. 2017. An integrative review of the cognitive costs and benefits of note-taking. Educational Research Review 22 (2017), 223–233.",
      "doi": ""
    },
    {
      "text": "Hyoungwook Jin, Minsuk Chang, and Juho Kim. 2019. SolveDeep: A System for Supporting Subgoal Learning in Online Math Problem Solving. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3290607.3312822"
    },
    {
      "text": "Rosie Jones, Benjamin Rey, Omid Madani, and Wiley Greiner. 2006. Generating query substitutions. In Proceedings of the 15th international conference on World Wide Web. 387–396.",
      "doi": "10.1145/1135777.1135835"
    },
    {
      "text": "Yvonne Kammerer, Rowan Nairn, Peter Pirolli, and Ed H Chi. 2009. Signpost from the masses: learning effects in an exploratory social tag search browser. In Proceedings of the SIGCHI conference on human factors in computing systems. 625–634.",
      "doi": "10.1145/1518701.1518797"
    },
    {
      "text": "Makoto P Kato, Tetsuya Sakai, and Katsumi Tanaka. 2012. Structured query suggestion for specialization and parallel movement: effect on search behaviors. In Proceedings of the 21st international conference on World Wide Web. 389–398.",
      "doi": "10.1145/2187836.2187890"
    },
    {
      "text": "Diane Kelly, Amber Cushing, Maureen Dostert, Xi Niu, and Karl Gyllstrom. 2010. Effects of popularity and quality on the usage of query suggestions during information search. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 45–54.",
      "doi": "10.1145/1753326.1753334"
    },
    {
      "text": "Diane Kelly, Karl Gyllstrom, and Earl W Bailey. 2009. A comparison of query and term suggestion features for interactive searching. In Proceedings of the 32nd international ACM SIGIR conference on Research and development in information retrieval. 371–378.",
      "doi": "10.1145/1571941.1572006"
    },
    {
      "text": "Diane Kelly and Jaime Teevan. 2003. Implicit feedback for inferring user preference: a bibliography. In Acm Sigir Forum, Vol. 37. ACM New York, NY, USA, 18–28.",
      "doi": ""
    },
    {
      "text": "Fawzia Khan. 1993. A survey of note-taking practices. Hewlett-Packard Laboratories.",
      "doi": ""
    },
    {
      "text": "Kyung-Sun Kim and Bryce Allen. 2002. Cognitive and task influences on Web searching behavior. Journal of the American Society for Information Science and Technology 53, 2 (2002), 109–119.",
      "doi": "10.1002/asi.10014"
    },
    {
      "text": "David Kirsh. 2010. Thinking with external representations. AI & society 25, 4 (2010), 441–454.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Andrew M Peters, Abdigani Diriye, and Michael Bove. 2014. Standing on the schemas of giants: socially augmented information foraging. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 999–1010.",
      "doi": "10.1145/2531602.2531644"
    },
    {
      "text": "Bill Kules, Robert Capra, Matthew Banta, and Tito Sierra. 2009. What do exploratory searchers look at in a faceted search interface?. In Proceedings of the 9th ACM/IEEE-CS joint conference on Digital libraries. 313–322.",
      "doi": "10.1145/1555400.1555452"
    },
    {
      "text": "Tessa Lau and Eric Horvitz. 1999. Patterns of search: analyzing and modeling web query refinement. In UM99 user modeling. Springer, 119–128.",
      "doi": ""
    },
    {
      "text": "Min Lin, Wayne G Lutters, and Tina S Kim. 2004. Understanding the micronote lifecycle: improving mobile support for informal note taking. In Proceedings of the SIGCHI conference on Human factors in computing systems. 687–694.",
      "doi": "10.1145/985692.985779"
    },
    {
      "text": "Chang Liu, Xiangmin Zhang, and Wei Huang. 2016. The exploration of objective task difficulty and domain knowledge effects on users’ query formulation. Proceedings of the Association for Information Science and Technology 53, 1 (2016), 1–9.",
      "doi": ""
    },
    {
      "text": "Michael Xieyang Liu, Jane Hsieh, Nathan Hahn, Angelina Zhou, Emily Deng, Shaun Burley, Cynthia Taylor, Aniket Kittur, and Brad A Myers. 2019. Unakite: Scaffolding Developers’ Decision-Making Using the Web. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 67–80.",
      "doi": "10.1145/3332165.3347908"
    },
    {
      "text": "Steven Loria, P Keen, M Honnibal, R Yankovsky, D Karesh, E Dempsey, 2014. Textblob: simplified text processing. Secondary TextBlob: simplified text processing 3 (2014).",
      "doi": ""
    },
    {
      "text": "Jiyun Luo, Xuchu Dong, and Hui Yang. 2015. Session search by direct policy learning. In Proceedings of the 2015 International Conference on The Theory of Information Retrieval. 261–270.",
      "doi": "10.1145/2808194.2809461"
    },
    {
      "text": "Tamas Makany, Jonathan Kemp, and Itiel E Dror. 2009. Optimising the use of note-taking as an external cognitive aid for increasing learning. British Journal of Educational Technology 40, 4 (2009), 619–635.",
      "doi": ""
    },
    {
      "text": "Gary Marchionini. 2006. Exploratory search: from finding to understanding. Commun. ACM 49, 4 (2006), 41–46.",
      "doi": "10.1145/1121949.1121979"
    },
    {
      "text": "Catherine C Marshall and Sara Bly. 2005. Saving and using encountered information: implications for electronic periodicals. In Proceedings of the Sigchi conference on human factors in computing systems. 111–120.",
      "doi": "10.1145/1054972.1054989"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2011. Ambient help. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2751–2760.",
      "doi": "10.1145/1978942.1979349"
    },
    {
      "text": "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Advances in neural information processing systems. 3111–3119.",
      "doi": ""
    },
    {
      "text": "Dan Morris, Meredith Ringel Morris, and Gina Venolia. 2008. SearchBar: a search-centric web history for task resumption and information re-finding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1207–1216.",
      "doi": "10.1145/1357054.1357242"
    },
    {
      "text": "Meredith Ringel Morris. 2008. A survey of collaborative web search practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1657–1660.",
      "doi": "10.1145/1357054.1357312"
    },
    {
      "text": "Meredith Ringel Morris and Eric Horvitz. 2007. SearchTogether: an interface for collaborative web search. In Proceedings of the 20th annual ACM symposium on User interface software and technology. 3–12.",
      "doi": "10.1145/1294211.1294215"
    },
    {
      "text": "Xi Niu and Diane Kelly. 2014. The use of query suggestions during information search. Information Processing & Management 50, 1 (2014), 218–234.",
      "doi": "10.1016/j.ipm.2013.09.002"
    },
    {
      "text": "F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12 (2011), 2825–2830.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "Jaakko Peltonen, Kseniia Belorustceva, and Tuukka Ruotsalo. 2017. Topic-relevance map: Visualization for improving search result comprehension. In Proceedings of the 22nd international conference on intelligent user interfaces. 611–622.",
      "doi": "10.1145/3025171.3025223"
    },
    {
      "text": "Peter Pirolli and Stuart Card. 1995. Information foraging in information access environments. In Proceedings of the SIGCHI conference on Human factors in computing systems. 51–58.",
      "doi": "10.1145/223904.223911"
    },
    {
      "text": "Morgan N Price, Bill N Schilit, and Gene Golovchinsky. 1998. XLibris: The active reading machine. In CHI 98 conference summary on Human factors in computing systems. 22–23.",
      "doi": "10.1145/286498.286510"
    },
    {
      "text": "Chris Quintana and Meilan Zhang. 2004. The Digital Ideakeeper: Extending digital library services to scaffold online inquiry. In American Education Research Association Annual Meeting, San Diego, CA. Citeseer.",
      "doi": ""
    },
    {
      "text": "Filip Radlinski and Susan Dumais. 2006. Improving personalized web search using result diversification. In Proceedings of the 29th annual international ACM SIGIR conference on Research and development in information retrieval. 691–692.",
      "doi": "10.1145/1148170.1148320"
    },
    {
      "text": "Filip Radlinski, Martin Szummer, and Nick Craswell. 2010. Inferring query intent from reformulations and clicks. In Proceedings of the 19th international conference on World wide web. 1171–1172.",
      "doi": "10.1145/1772690.1772859"
    },
    {
      "text": "Radim Řehůřek and Petr Sojka. 2010. Software Framework for Topic Modelling with Large Corpora. In Proceedings of the LREC 2010 Workshop on New Challenges for NLP Frameworks. ELRA, Valletta, Malta, 45–50. http://is.muni.cz/publication/884893/en.",
      "doi": ""
    },
    {
      "text": "Eun Youp Rha, Matthew Mitsui, Nicholas J Belkin, and Chirag Shah. 2016. Exploring the relationships between search intentions and query reformulations. Proceedings of the Association for Information Science and Technology 53, 1 (2016), 1–9.",
      "doi": "10.5555/3017447.3017495"
    },
    {
      "text": "Soo Young Rieh, Kevyn Collins-Thompson, Preben Hansen, and Hye-Jung Lee. 2016. Towards searching as a learning process: A review of current perspectives and future directions. Journal of Information Science 42, 1 (2016), 19–34.",
      "doi": "10.1177/0165551515615841"
    },
    {
      "text": "Soo Young Rieh, Jacek Gwizdka, Luanne Freund, and Kevyn Collins-Thompson. 2014. Searching as learning: Novel measures for information interaction research. Proceedings of the American Society for Information Science and Technology 51, 1 (2014), 1–4.",
      "doi": ""
    },
    {
      "text": "Corbin Rosset, Chenyan Xiong, Xia Song, Daniel Campos, Nick Craswell, Saurabh Tiwary, and Paul Bennett. 2020. Leading Conversational Search by Suggesting Useful Questions. In Proceedings of The Web Conference 2020. 1160–1170.",
      "doi": "10.1145/3366423.3380193"
    },
    {
      "text": "Daniel M Russell, Gregorio Convertino, Aniket Kittur, Peter Pirolli, and Elizabeth Anne Watkins. 2018. Sensemaking in a Senseless World: 2018 Workshop Abstract. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": "10.1145/3170427.3170636"
    },
    {
      "text": "Denis Savenkov and Eugene Agichtein. 2014. To hint or not: exploring the effectiveness of search hints for complex informational tasks. In Proceedings of the 37th international ACM SIGIR conference on Research & development in information retrieval. 1115–1118.",
      "doi": "10.1145/2600428.2609523"
    },
    {
      "text": "Fabrizio Silvestri. 2010. Mining query logs: Turning search usage data into knowledge. Foundations and Trends in Information Retrieval 4, 1—2(2010), 1–174.",
      "doi": "10.1561/1500000013"
    },
    {
      "text": "Adish Singla, Ryen White, and Jeff Huang. 2010. Studying trailfinding algorithms for enhanced web search. In Proceedings of the 33rd international ACM SIGIR conference on Research and development in information retrieval. 443–450.",
      "doi": "10.1145/1835449.1835524"
    },
    {
      "text": "Alessandro Sordoni, Yoshua Bengio, Hossein Vahabi, Christina Lioma, Jakob Grue Simonsen, and Jian-Yun Nie. 2015. A hierarchical recurrent encoder-decoder for generative context-aware query suggestion. In Proceedings of the 24th ACM International on Conference on Information and Knowledge Management. 553–562.",
      "doi": "10.1145/2806416.2806493"
    },
    {
      "text": "Jaime Teevan, Susan T Dumais, and Eric Horvitz. 2005. Personalizing search via automated analysis of interests and activities. In Proceedings of the 28th annual international ACM SIGIR conference on Research and development in information retrieval. 449–456.",
      "doi": "10.1145/1076034.1076111"
    },
    {
      "text": "Kosetsu Tsukuda, Tetsuya Sakai, Zhicheng Dou, and Katsumi Tanaka. 2013. Estimating intent types for search result diversification. In Asia Information Retrieval Symposium. Springer, 25–37.",
      "doi": ""
    },
    {
      "text": "Pertti Vakkari. 2001. Changes in search tactics and relevance judgements when preparing a research proposal a summary of the findings of a longitudinal study. Information retrieval 4, 3-4 (2001), 295–310.",
      "doi": ""
    },
    {
      "text": "Pertti Vakkari. 2016. Searching as learning: A systematization based on literature. Journal of Information Science 42, 1 (2016), 7–18.",
      "doi": "10.1177/0165551515615833"
    },
    {
      "text": "Max G Van Kleek, Michael Bernstein, Katrina Panovich, Gregory G Vargas, David R Karger, and MC Schraefel. 2009. Note to self: examining personal information keeping in a lightweight note-taking tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1477–1480.",
      "doi": "10.1145/1518701.1518924"
    },
    {
      "text": "George Veletsianos. 2007. Cognitive and affective benefits of an animated pedagogical agent: Considering contextual relevance and aesthetics. Journal of Educational Computing Research 36, 4 (2007), 373–377.",
      "doi": ""
    },
    {
      "text": "Laton Vermette, Parmit Chilana, Michael Terry, Adam Fourney, Ben Lafreniere, and Travis Kerr. 2015. CheatSheet: a contextual interactive memory aid for web applications. In Proceedings of the 41st Graphics Interface Conference. 241–248.",
      "doi": ""
    },
    {
      "text": "Ryen W White, Susan T Dumais, and Jaime Teevan. 2009. Characterizing the influence of domain expertise on web search behavior. In Proceedings of the second ACM international conference on web search and data mining. 132–141.",
      "doi": "10.1145/1498759.1498819"
    },
    {
      "text": "Ryen W White and Gary Marchionini. 2007. Examining the effectiveness of real-time query expansion. Information Processing & Management 43, 3 (2007), 685–704.",
      "doi": "10.1016/j.ipm.2006.06.005"
    },
    {
      "text": "Ryen W White and Resa A Roth. 2009. Exploratory search: Beyond the query-response paradigm. Synthesis lectures on information concepts, retrieval, and services 1, 1(2009), 1–98.",
      "doi": ""
    },
    {
      "text": "Merryl J Wilkenfeld and Thomas B Ward. 2001. Similarity and emergence in conceptual combination. Journal of Memory and Language 45, 1 (2001), 21–38.",
      "doi": ""
    },
    {
      "text": "Mathew J Wilson and Max L Wilson. 2013. A comparison of techniques for measuring sensemaking and learning within participant-generated summaries. Journal of the American Society for Information Science and Technology 64, 2 (2013), 291–306.",
      "doi": "10.1002/asi.22758"
    },
    {
      "text": "Bin Wu, Chenyan Xiong, Maosong Sun, and Zhiyuan Liu. 2018. Query suggestion with feedback memory network. In Proceedings of the 2018 World Wide Web Conference. 1563–1571.",
      "doi": "10.1145/3178876.3186068"
    },
    {
      "text": "Jun Xiao, Richard Catrambone, and John Stasko. 2003. Be quiet? evaluating proactive and reactive user interface assistants. In Proceedings of INTERACT, Vol. 3. 383–390.",
      "doi": ""
    },
    {
      "text": "Yusuke Yamamoto. 2012. Disputed sentence suggestion towards credibility-oriented web search. In Asia-Pacific Web Conference. Springer, 34–45.",
      "doi": "10.1007/978-3-642-29253-8_4"
    },
    {
      "text": "Yusuke Yamamoto and Satoshi Shimada. 2016. Can Disputed Topic Suggestion Enhance User Consideration of Information Credibility in Web Search?. In Proceedings of the 27th ACM Conference on Hypertext and Social Media. 169–177.",
      "doi": "10.1145/2914586.2914592"
    },
    {
      "text": "Xiaojun Yuan and Ryen White. 2012. Building the trail best traveled: effects of domain knowledge on web search trailblazing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1795–1804.",
      "doi": "10.1145/2207676.2208312"
    },
    {
      "text": "Hua-Jun Zeng, Qi-Cai He, Zheng Chen, Wei-Ying Ma, and Jinwen Ma. 2004. Learning to cluster web search results. In Proceedings of the 27th annual international ACM SIGIR conference on Research and development in information retrieval. 210–217.",
      "doi": "10.1145/1008992.1009030"
    }
  ]
}