{
  "doi": "10.1145/3411764.3445525",
  "title": "Enacting the Last Mile: Experiences of Smart Contracts in Courier Deliveries",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Smart contract systems could change the nature of last-mile delivery for the better through enhanced precision, coordination and accountability. However, technological complexity poses a challenge for end-users participating in the design process, making it hard to explore their experiences and incorporate their perspectives. We describe a case study where technological prototypes create smart contract experiences for professional couriers and receptionists, allowing them to speculate about emerging possibilities, whilst remaining grounded in their current practices. Participants enacted a series of deliveries, choreographed by smart contracts, and their responses were explored in post-experience, one-to-one interviews. Working with professionals to explore the potential impact of smart contract technologies, revealed the systemic webs of value underlying their existing work practices. This has implications for design of such technologies, in which increased automation, efficiency and accountability must be delicately balanced with the benefits of sustaining personal values, relationships and agency.",
  "authors": [
    {
      "name": "Ella Tallyn",
      "institution": "Design Informatics University of Edinburgh, United Kingdom",
      "img": "/do/10.1145/contrib-81100477180/rel-imgonly/81100477180.jpg",
      "acmid": "81100477180",
      "orcid": "missing"
    },
    {
      "name": "Joe Revans",
      "institution": "Design Informatics University of Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659547860",
      "orcid": "missing"
    },
    {
      "name": "Evan Morgan",
      "institution": "Design Informatics University of Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84460466857",
      "orcid": "missing"
    },
    {
      "name": "Keith Fisken",
      "institution": "SEStran, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701787",
      "orcid": "missing"
    },
    {
      "name": "Dave Murray-Rust",
      "institution": "Design Informatics University of Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436598350",
      "orcid": "0000-0001-6098-7861"
    }
  ],
  "references": [
    {
      "text": "Julian Allen, Maja Piecyk, Marzena Piotrowska, Fraser McLeod, Thomas Cherrett, Karen Ghali, Thuba Nguyen, Tolga Bektas, Oliver Bates, Adrian Friday, 2018. Understanding the impact of e-commerce on last-mile light goods vehicle activity in urban areas: The case of London. Transportation Research Part D: Transport and Environment 61 (2018), 325–338.",
      "doi": ""
    },
    {
      "text": "Donald N Anderson. 2014. “Not just a taxi”? For-profit ridesharing, driver strategies, and VMT. Transportation 41, 5 (2014), 1099–1117.",
      "doi": ""
    },
    {
      "text": "Oliver Bates, Adrian Friday, Julian Allen, Tom Cherrett, Fraser McLeod, Tolga Bektas, ThuBa Nguyen, Maja Piecyk, Marzena Piotrowska, Sarah Wise, and Nigel Davies. 2018. Transforming Last-Mile Logistics: Opportunities for More Sustainable Deliveries. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174100",
      "doi": "10.1145/3173574.3174100"
    },
    {
      "text": "Oliver Bates, Carolynne Lord, Hayley Alter, and Ben Kirman. 2020. Let’s Start Talking the Walk: Capturing and Reflecting on Our Limits When Working with Gig Economy Workers. In Proceedings of the 7th International Conference on ICT for Sustainability (Bristol, United Kingdom) (ICT4S2020). Association for Computing Machinery, New York, NY, USA, 227–235. https://doi.org/10.1145/3401335.3401364",
      "doi": "10.1145/3401335.3401364"
    },
    {
      "text": "Abderrahim Benjelloun, Teodor Gabriel Crainic, and Yvon Bigras. 2010. Towards a taxonomy of City Logistics projects. Procedia-Social and Behavioral Sciences 2, 3 (2010), 6217–6228.",
      "doi": ""
    },
    {
      "text": "Leepakshi Bindra, Changyuan Lin, Eleni Stroulia, and Omid Ardakanian. 2019. Decentralized Access Control for Smart Buildings Using Metadata and Smart Contracts. In Proceedings of the 5th International Workshop on Software Engineering for Smart Cyber-Physical Systems (Montreal, Quebec, Canada) (SEsCPS ’19). IEEE Press, United States, 32–38. https://doi.org/10.1109/SEsCPS.2019.00013",
      "doi": "10.1109/SEsCPS.2019.00013"
    },
    {
      "text": "Efthimios Bothos, Dimitris Apostolou, and Gregoris Mentzas. 2013. Choice Architecture for Environmentally Sustainable Urban Mobility. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 1503–1508. https://doi.org/10.1145/2468356.2468624",
      "doi": ""
    },
    {
      "text": "Callum Cant. 2019. Riding for Deliveroo: resistance in the new economy. John Wiley & Sons, Hoboken, New Jersey, United States.",
      "doi": ""
    },
    {
      "text": "Ivan Cardenas, Yari Borbon-Galvez, Thomas Verlinden, Eddy Van de Voorde, Thierry Vanelslander, and Wouter Dewulf. 2017. City logistics, urban goods distribution and last mile delivery and collection. Competition and regulation in network industries 18, 1-2(2017), 22–43.",
      "doi": ""
    },
    {
      "text": "Ruth Catlow, Marc Garrett, Nathan Jones, and Sam Skinner. 2017. Artists Re: Thinking the Blockchain. Torque editions, England, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Nazli Cila, Gabriele Ferri, Martijn de Waal, Inte Gloerich, and Tara Karpinski. 2020. The Blockchain and the Commons: Dilemmas in the Design of Local Platforms. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376660",
      "doi": "10.1145/3313831.3376660"
    },
    {
      "text": "Jonathan Cowie. 2017. Competition and complementarity in road freight: Key drivers and consequences of a dominant market position. In The Routledge Handbook of Transport Economics. Routledge, United Kingdom, 348–367.",
      "doi": ""
    },
    {
      "text": "Jonathan Cowie and Keith Fisken. 2019. Delivering on Sustainable Logistics by thinking inside the Box – a case study of a successful business model. https://starconference.org.uk/star/2019/Cowie.pdf. In Scottish Transport Applications and Research. 2019 STAR Conference, Glasgow, UK, 1–14.",
      "doi": ""
    },
    {
      "text": "Sinclair Davidson, Primavera De Filippi, and Jason Potts. 2016. Economics of Blockchain. In Public Choice Conference. NA, Fort Lauderdale, United States, NA. https://doi.org/10.2139/ssrn.2744751",
      "doi": ""
    },
    {
      "text": "Fred Davis. 1959. The cabdriver and his fare: Facets of a fleeting relationship. American journal of sociology 65, 2 (1959), 158–165.",
      "doi": ""
    },
    {
      "text": "Lorenzo Davoli and Johan Redström. 2014. Materializing Infrastructures for Participatory Hacking. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 121–130. https://doi.org/10.1145/2598510.2602961",
      "doi": "10.1145/2598510.2602961"
    },
    {
      "text": "Claas Digmayer, Sara Vogelsang, and Eva-Maria Jakobs. 2015. Designing Mobility Apps to Support Intermodal Travel Chains. In Proceedings of the 33rd Annual International Conference on the Design of Communication (Limerick, Ireland) (SIGDOC ’15). Association for Computing Machinery, New York, NY, USA, Article 44, 11 pages. https://doi.org/10.1145/2775441.2775460",
      "doi": "10.1145/2775441.2775460"
    },
    {
      "text": "Max Dovey. 2017. Respiratory Mining. http://maxdovey.com/?page=performance&id=respiratory-mining.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Bettina Nissen, Karim Jabbar, Reem Talhouk, Caitlin Lustig, Paul Dunphy, Chris Speed, and John Vines. 2018. HCI for Blockchain: Studying, Designing, Critiquing and Envisioning Distributed Ledger Technologies. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3170427.3170602",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Ludwig Trotter, Mike Harding, Nigel Davies, Chris Speed, and John Vines. 2019. Programmable Donations: Exploring Escrow-Based Conditional Giving. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300609",
      "doi": "10.1145/3290605.3300609"
    },
    {
      "text": "Anton Fedosov, Agon Bexheti, Egor Ermolaev, and Marc Langheinrich. 2018. Sharing Physical Objects Using Smart Contracts. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, 346–352. https://doi.org/10.1145/3236112.3236162",
      "doi": "10.1145/3236112.3236162"
    },
    {
      "text": "Brian Ferris, Kari Watkins, and Alan Borning. 2010. OneBusAway: Results from Providing Real-Time Arrival Information for Public Transit. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1807–1816. https://doi.org/10.1145/1753326.1753597",
      "doi": "10.1145/1753326.1753597"
    },
    {
      "text": "Ben Fincham. 2007. ‘Generally Speaking People are in it for the Cycling and the Beer’: Bicycle Couriers, Subculture and Enjoyment. The Sociological Review 55, 2 (2007), 189–202.",
      "doi": ""
    },
    {
      "text": "Jon Froehlich, Tawanna Dillahunt, Predrag Klasnja, Jennifer Mankoff, Sunny Consolvo, Beverly Harrison, and James A. Landay. 2009. UbiGreen: Investigating a Mobile Tool for Tracking and Supporting Green Transportation Habits. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1043–1052. https://doi.org/10.1145/1518701.1518861",
      "doi": "10.1145/1518701.1518861"
    },
    {
      "text": "Silvia Gabrielli, Rosa Maimone, Paula Forbes, Judith Masthoff, Simon Wells, Laura Primerano, Laura Haverinen, Giancarlo Bo, and Marco Pompa. 2013. Designing Motivational Features for Sustainable Urban Mobility. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 1461–1466. https://doi.org/10.1145/2468356.2468617",
      "doi": ""
    },
    {
      "text": "Mareike Glöss, Moira McGregor, and Barry Brown. 2016. Designing for Labour: Uber and the On-Demand Mobile Workforce. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1632–1643. https://doi.org/10.1145/2858036.2858476",
      "doi": "10.1145/2858036.2858476"
    },
    {
      "text": "Robin Hickman. 2017. Sustainable travel or sustaining growth?In The Routledge handbook of transport economics. Routledge, UK, 311–321.",
      "doi": ""
    },
    {
      "text": "J Holguín-Veras, M Silas, J Polimeni, E Taniguchi, and R Thomson. 2008. An investigation on the attitudinal factors determining participation in cooperative multi-carrier delivery systems. Innovations in city logistics IV. Nova Science Publishers NA, NA(2008), 55–68.",
      "doi": ""
    },
    {
      "text": "Mirela Ivanova, Joanna Bronowicka, Eva Kocher, and Anne Degner. 2018. Foodora and Deliveroo: The App as a Boss? Control and autonomy in app-based management-the case of food delivery riders. Technical Report. Working Paper Forschungsförderung.",
      "doi": ""
    },
    {
      "text": "Karim Jabbar and Pernille Bjørn. 2018. Infrastructural Grind: Introducing Blockchain Technology in the Shipping Domain. In Proceedings of the 2018 ACM Conference on Supporting Groupwork (Sanibel Island, Florida, USA) (GROUP ’18). Association for Computing Machinery, New York, NY, USA, 297–308. https://doi.org/10.1145/3148330.3148345",
      "doi": "10.1145/3148330.3148345"
    },
    {
      "text": "Caroline Jaffe, Cristina Mata, and Sepandar Kamvar. 2017. Motivating urban cycling through a blockchain-based financial incentives system. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers. ACM, Maui, USA, 81–84.",
      "doi": "10.1145/3123024.3123141"
    },
    {
      "text": "Guowei Jiang, Elisa Giaccardi, and Armagan Albayrak. 2018. Walkers’ Union: Designing New Urban Walking Rituals with Blockchain. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (Hong Kong, China) (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 57–62. https://doi.org/10.1145/3197391.3205412",
      "doi": "10.1145/3197391.3205412"
    },
    {
      "text": "Guowei Jiang, Elisa Giaccardi, and Armagan Albayrak. 2018. Walkers’ Union: Designing New Urban Walking Rituals with Blockchain. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (Hong Kong, China) (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 57–62. https://doi.org/10.1145/3197391.3205412",
      "doi": "10.1145/3197391.3205412"
    },
    {
      "text": "Sarah Kaine and Emmanuel Josserand. 2019. The organisation and experience of work in the gig economy. Journal of Industrial Relations 61, 4 (2019), 479–501.",
      "doi": ""
    },
    {
      "text": "Maria Kjærup, Mikael B. Skov, and Niels Agerholm. 2020. Digital-Enabled Last Mile: A Study of Passenger Trips in Rural, Low-Density Populated Areas. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376509",
      "doi": "10.1145/3313831.3376509"
    },
    {
      "text": "Nir Kshetri. 2018. 1 Blockchain’s roles in meeting key supply chain management objectives. International Journal of Information Management 39 (2018), 80–89.",
      "doi": ""
    },
    {
      "text": "Airi Lampinen, Christoph Lutz, Gemma Newlands, Ann Light, and Nicole Immorlica. 2018. Power Struggles in the Digital Economy: Platforms, Workers, and Markets. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing(Jersey City, NJ, USA) (CSCW ’18). Association for Computing Machinery, New York, NY, USA, 417–423. https://doi.org/10.1145/3272973.3273004",
      "doi": "10.1145/3272973.3273004"
    },
    {
      "text": "Joseph Lindley. 2015. Crypto Heater: A Design Fiction. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition. ACM, Glasgow, UK, 355–356.",
      "doi": "10.1145/2757226.2757367"
    },
    {
      "text": "The Incredible Machine. 2017. Fairbike. https://the-incredible-machine.com/fairbike.html.",
      "doi": ""
    },
    {
      "text": "Fraser Maclean, Fraser McLeod, and Oliver Bates. 2019. Parcel carrier collaboration. CILT Focus Magazine NA, NA (2019), 43–45.",
      "doi": ""
    },
    {
      "text": "Jochen Maes and Thierry Vanelslander. 2012. The use of bicycle messengers in the logistics chain, concepts further revised. Procedia-Social and behavioral sciences 39 (2012), 409–423.",
      "doi": ""
    },
    {
      "text": "Sarah Manski and Michel Bauwens. 2020. Reimagining New Socio-Technical Economics Through the Application of Distributed Ledger Technologies. Frontiers in Blockchain 2 (2020), 29.",
      "doi": ""
    },
    {
      "text": "Deborah Maxwell, Chris Speed, and Dug Campbell. 2015. ’Effing’the ineffable: opening up understandings of the blockchain. In Proceedings of the 2015 British HCI Conference. ACM, Lincoln, UK, 208–209.",
      "doi": "10.1145/2783446.2783593"
    },
    {
      "text": "Moira McGregor, Barry Brown, and Mareike Glöss. 2015. Disrupting the cab: Uber, ridesharing and the taxi industry. Journal of Peer Production NA, 6 (2015), NA.",
      "doi": ""
    },
    {
      "text": "Satoshi Nakamoto. 2008. A peer-to-peer electronic cash system. https://bitcoin. org/bitcoin.pdf.",
      "doi": ""
    },
    {
      "text": "Bettina Nissen, Ella Tallyn, and Kate Symons. 2019. tangibly understanding intangible complexities: designing for distributed autonomous organizations. Ubiquity: The Journal of Pervasive Media 6, 1 (2019), 47–63.",
      "doi": ""
    },
    {
      "text": "William Odom, John Zimmerman, Scott Davidoff, Jodi Forlizzi, Anind K. Dey, and Min Kyung Lee. 2012. A Fieldwork of the Future with User Enactments. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 338–347. https://doi.org/10.1145/2317956.2318008",
      "doi": "10.1145/2317956.2318008"
    },
    {
      "text": "Kenneth Wade Ogden. 1992. Urban goods movement: a guide to policy and planning. Ashgate, Burlington, VT.",
      "doi": ""
    },
    {
      "text": "Julian Olivier. 2017. Harvest. https://julianoliver.com/output/harvest.",
      "doi": ""
    },
    {
      "text": "Alex Pazaitis, Primavera De Filippi, and Vasilis Kostakis. 2017. Blockchain and value systems in the sharing economy: The illustrative case of Backfeed. Technological Forecasting and Social Change 125 (2017), 105–115.",
      "doi": ""
    },
    {
      "text": "Gary Pritchard, John Vines, Pam Briggs, Lisa Thomas, and Patrick Olivier. 2014. Digitally Driven: How Location Based Services Impact the Work Practices of London Bus Drivers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3617–3626. https://doi.org/10.1145/2556288.2557156",
      "doi": "10.1145/2556288.2557156"
    },
    {
      "text": "Larissa Pschetz, Kruakae Pothong, and Chris Speed. 2019. Autonomous Distributed Energy Systems: Problematising the Invisible through Design, Drama and Deliberation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300617",
      "doi": "10.1145/3290605.3300617"
    },
    {
      "text": "Larissa Pschetz, Luis Lourenço Soares, Billy Dixon, Esteban Serrano, Ella Tallyn, and Joe Revans. 2020. Push-Pull Energy Futures: Using Design to Discuss Agency in Distributed Energy Systems. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 1341–1350. https://doi.org/10.1145/3357236.3395551",
      "doi": "10.1145/3357236.3395551"
    },
    {
      "text": "Jonathan Rankin, Chris Elsden, Ian Sibbald, Alan Stevenson, John Vines, and Chris Speed. 2020. PizzaBlock: Designing Artefacts and Roleplay to Understand Decentralised Identity Management Systems. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 1593–1606. https://doi.org/10.1145/3357236.3395568",
      "doi": "10.1145/3357236.3395568"
    },
    {
      "text": "Noopur Raval and Paul Dourish. 2016. Standing Out from the Crowd: Emotional Labor, Body Labor, and Temporal Labor in Ridesharing. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work and Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 97–107. https://doi.org/10.1145/2818048.2820026",
      "doi": "10.1145/2818048.2820026"
    },
    {
      "text": "Lisa Rayle, Susan A Shaheen, Nelson Chan, Danielle Dai, and Robert Cervero. 2014. App-based, on-demand ride services: comparing taxi and ridesourcing trips and user characteristics in San Francisco. Technical Report. Citeseer.",
      "doi": ""
    },
    {
      "text": "Sasank Reddy, Katie Shilton, Gleb Denisov, Christian Cenizal, Deborah Estrin, and Mani Srivastava. 2010. Biketastic: Sensing and Mapping for Better Biking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1817–1820. https://doi.org/10.1145/1753326.1753598",
      "doi": "10.1145/1753326.1753598"
    },
    {
      "text": "Tom Rye. 2017. The tools available under a green transport policy. In The Routledge Handbook of Transport Economics. Routledge, 711 Third Avenue, New York, NY10017, USA, 284–295.",
      "doi": ""
    },
    {
      "text": "Nick Szabo. 1997. Formalizing and securing relationships on public networks. First Monday NA, NA (1997), NA.",
      "doi": ""
    },
    {
      "text": "Ella Tallyn, Larissa Pschetz, Rory Gianni, Chris Speed, and Chris Elsden. 2018. Exploring Machine Autonomy and Provenance Data in Coffee Consumption: A Field Study of Bitbarista. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 170 (Nov. 2018), 25 pages. https://doi.org/10.1145/3274439",
      "doi": "10.1145/3274439"
    },
    {
      "text": "Ella Tallyn, Joe Revans, Evan Morgan, and Dave Murray-Rust. 2020. GeoPact: Engaging Publics in Location-Aware Smart Contracts through Technological Assemblies. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 799–811. https://doi.org/10.1145/3357236.3395583",
      "doi": "10.1145/3357236.3395583"
    },
    {
      "text": "Eiichi Taniguchi. 2014. Concepts of city logistics for sustainable and liveable cities. Procedia-social and behavioral sciences 151 (2014), 310–317.",
      "doi": ""
    },
    {
      "text": "Austin Toombs, Colin Gray, Guoyang Zhou, and Ann Light. 2018. Appropriated or Inauthentic Care in Gig-Economy Platforms: A Psycho-Linguistic Analysis of Uber and Lyft. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188657",
      "doi": "10.1145/3170427.3188657"
    },
    {
      "text": "Sergey Tsiulin, Kristian Hegner Reinau, Olli-Pekka Hilmola, Nikolay Goryaev, and Ahmed Karam. 2020. Blockchain-based applications in shipping and port management: a literature review towards defining key conceptual frameworks. Review of International Business and Strategy 30, 2 (2020), 201–224.",
      "doi": ""
    },
    {
      "text": "Sylvaine Tuncer and Barry Brown. 2020. E-Scooters on the Ground: Lessons for Redesigning Urban Micro-Mobility. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376499",
      "doi": "10.1145/3313831.3376499"
    },
    {
      "text": "Johan Visser, Toshinori Nemoto, and Michael Browne. 2014. Home delivery and the impacts on urban freight transport: A review. Procedia-social and behavioral sciences 125 (2014), 15–27.",
      "doi": ""
    }
  ]
}