{
  "doi": "10.1145/3411764.3445776",
  "title": "Online Mingling: Supporting Ad Hoc, Private Conversations at Virtual Conferences",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2021,
  "badges": [],
  "abstract": "Even though today’s videoconferencing systems are often very useful, these systems do not provide support for one of the most important aspects of in-person meetings: the ad hoc, private conversations that happen before, after, and during the breaks of scheduled events–the proverbial hallway conversations. Here we describe our design of a simple system, called Minglr, which supports this kind of interaction by facilitating the matching of conversational partners. We describe two studies of this system’s use at two virtual conferences with over 450 total participants. Our results provide evidence for the usefulness of this capability, showing that, for example, 81% of people who used the system successfully thought that future virtual conferences should include a tool with similar functionality. We believe that similar functionality is likely to be widely implemented in many videoconferencing systems and to increase the feasibility and desirability of many kinds of remote work and socializing.",
  "authors": [
    {
      "name": "Jaeyoon Song",
      "institution": "MIT, Cambridge, Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701154",
      "orcid": "missing"
    },
    {
      "name": "Christoph Riedl",
      "institution": "Northeastern University and MIT Center for Collective Intelligence, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371591466",
      "orcid": "missing"
    },
    {
      "name": "Thomas W. Malone",
      "institution": "Sloan School of Management Massachusetts Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81100548740/rel-imgonly/oct2010.jpg",
      "acmid": "81100548740",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "ACM. 2020. Upcoming Conferences. Retrieved 2020 from https://www.acm.org/upcoming-conferences",
      "doi": ""
    },
    {
      "text": "Thomas J. Allen and Gunter Henn. 2017. The organization and architecture of innovation: managing the flow of technology. Routledge, Taylor et Francis Group.",
      "doi": ""
    },
    {
      "text": "Pierre-Alexandre Balland, Cristian Jara-Figueroa, Sergio G Petralia, Mathieu PA Steijn, David L Rigby, and César A Hidalgo. 2020. Complex economic activities concentrate in large cities. Nature Human Behaviour 4, 3 (2020), 248–254.",
      "doi": ""
    },
    {
      "text": "Luís M. A. Bettencourt, José Lobo, Dirk Helbing, Christian Kühnert, and Geoffrey B. West. 2007. Growth, innovation, scaling, and the pace of life in cities. Proceedings of the National Academy of Sciences 104, 17(2007), 7301–7306.",
      "doi": ""
    },
    {
      "text": "Kevin J Boudreau, Tom Brady, Ina Ganguli, Patrick Gaule, Eva Guinan, Anthony Hollenberg, and Karim R Lakhani. 2017. A field experiment on search costs and the formation of scientific collaborations. Review of Economics and Statistics 99, 4 (2017), 565–576.",
      "doi": ""
    },
    {
      "text": "CarbonNeutral. 2020. Microsoft Xbox: Microsoft certifies 825,000 Xbox consoles CarbonNeutral. Retrieved 2020 from https://www.carbonneutral.com/examples/microsoft",
      "doi": ""
    },
    {
      "text": "Christian Catalini. 2018. Microgeography and the Direction of Inventive Activity. Management Science 64, 9 (2018), 4348–4364.",
      "doi": "10.1287/mnsc.2017.2798"
    },
    {
      "text": "Kate Conger. 2020. Facebook Starts Planning for Permanent Remote Workers. (2020). https://www.nytimes.com/2020/05/21/technology/facebook-remote-work-coronavirus.html",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1996. Flow and the psychology of discovery and invention. Vol. 56. New York: Harper Collins.",
      "doi": ""
    },
    {
      "text": "Donut. 2020. Donut. Retrieved 2020 from http://donut.com/",
      "doi": ""
    },
    {
      "text": "Morten Esbensen, Paolo Tell, and Jakob E Bardram. 2014. SideBar: Videoconferencing system supporting social engagement. In 10th IEEE International Conference on Collaborative Computing: Networking, Applications and Worksharing. IEEE, 358–367.",
      "doi": ""
    },
    {
      "text": "Santo Fortunato, Carl T. Bergstrom, Katy Börner, James A. Evans, Dirk Helbing, Staša Milojević, Alexander M. Petersen, Filippo Radicchi, Roberta Sinatra, Brian Uzzi, Alessandro Vespignani, Ludo Waltman, Dashun Wang, and Albert-László Barabási. 2018. Science of science. Science 359, 6379 (2018).",
      "doi": ""
    },
    {
      "text": "Edward L. Glaeser. 2010. Agglomeration economics. The University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Mark S Granovetter. 1977. The strength of weak ties. In Social networks. Elsevier, 347–367.",
      "doi": ""
    },
    {
      "text": "Martine R. Haas and Morten T. Hansen. 2007. Different knowledge, different benefits: toward a productivity perspective on knowledge sharing in organizations. Strategic Management Journal 28, 11 (2007), 1133–1153.",
      "doi": ""
    },
    {
      "text": "Morten T. Hansen. 1999. The Search-Transfer Problem: The Role of Weak Ties in Sharing Knowledge across Organization Subunits. Administrative Science Quarterly 44, 1 (1999), 82.",
      "doi": ""
    },
    {
      "text": "James Higham and Xavier Font. 2020. Decarbonising academia: confronting our climate hypocrisy. Journal of Sustainable Tourism 28, 1 (2020), 1–9.",
      "doi": ""
    },
    {
      "text": "Milena Buchs Associate Professor in Sustainability. 2020. University sector must tackle air travel emissions. The Conversation (Jun 2020). https://theconversation.com/university-sector-must-tackle-air-travel-emissions-118929",
      "doi": ""
    },
    {
      "text": "Siempre Inc.2020. Online Town. Retrieved 2020 from https://theonline.town/overview",
      "doi": ""
    },
    {
      "text": "Lisa Jacobson, Jonas Åkerman, Matteo Giusti, and Avit K. Bhowmik. 2020. Tipping to Staying on the Ground: Internalized Knowledge of Climate Change Crucial for Transformed Air Travel Behavior. Sustainability 12, 5 (2020), 1994.",
      "doi": ""
    },
    {
      "text": "[21] Jitsi.2019. Retrieved 2020 from https://jitsi.org/",
      "doi": ""
    },
    {
      "text": "Kibum Kim, John Bolton, Audrey Girouard, Jeremy Cooperstock, and Roel Vertegaal. 2012. TeleHuman: Effects of 3d Perspective on Gaze and Pose Estimation with a Life-Size Cylindrical Telepresence Pod. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2531–2540. https://doi.org/10.1145/2207676.2208640",
      "doi": "10.1145/2207676.2208640"
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Intros.at Ltd. 2020. Smart Event Matchmaking Software for Virtual, Hybrid and Live Events | Grip. Retrieved 2020 from https://grip.events/",
      "doi": ""
    },
    {
      "text": "Joseph F. McCarthy, David W. McDonald, Suzanne Soroczak, David H. Nguyen, and Al M. Rashid. 2004. Augmenting the Social Space of an Academic Conference. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (Chicago, Illinois, USA) (CSCW ’04). Association for Computing Machinery, New York, NY, USA, 39–48. https://doi.org/10.1145/1031607.1031615",
      "doi": "10.1145/1031607.1031615"
    },
    {
      "text": "Frank Nagle and Florenta Teodoridis. 2019. Jack of all trades and master of knowledge: The role of diversification in new distant knowledge integration. Strategic Management Journal 41, 1 (2019), 55–85.",
      "doi": ""
    },
    {
      "text": "Stuart S Rosenthal and William C Strange. 2001. The determinants of agglomeration. Journal of urban economics 50, 2 (2001), 191–229.",
      "doi": ""
    },
    {
      "text": "Feng Shi and James Evans. 2019. Science and Technology Advance through Surprise. (2019). arxiv:1910.09370 [cs.DL]",
      "doi": ""
    },
    {
      "text": "ACM SIGCHI. 2020. CHI 2020. Retrieved 2020 from https://chi2020.acm.org/",
      "doi": ""
    },
    {
      "text": "Paula E Stephan. 2012. How economics shapes science. Vol. 1. Harvard University Press Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Hiroko Tabuchi. 2019. ’Worse Than Anyone Expected’: Air Travel Emissions Vastly Outpace Predictions. The New York Times (Sep 2019). https://www.nytimes.com/2019/09/19/climate/air-travel-emissions.html",
      "doi": ""
    },
    {
      "text": "Zoom Technologies. 2020. qube - Zoom App Marketplace. Retrieved 2020 from https://marketplace.zoom.us/apps/CdxdZhqoSWCQ7vbLaLffWQ",
      "doi": ""
    },
    {
      "text": "Zoom Technologies. 2020. Sococo - Zoom App Marketplace. Retrieved 2020 from https://marketplace.zoom.us/apps/0F3nAYAeQoGtt39dlpFPww",
      "doi": ""
    },
    {
      "text": "B. Uzzi, S. Mukherjee, M. Stringer, and B. Jones. 2013. Atypical Combinations and Scientific Impact. Science 342, 6157 (2013), 468–472.",
      "doi": ""
    },
    {
      "text": "Roel Vertegaal, Ivo Weevers, Changuk Sohn, and Chris Cheung. 2003. GAZE-2: Conveying Eye Contact in Group Video Conferencing Using Eye-Controlled Camera Direction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Ft. Lauderdale, Florida, USA) (CHI ’03). Association for Computing Machinery, New York, NY, USA, 521–528. https://doi.org/10.1145/642611.642702",
      "doi": "10.1145/642611.642702"
    },
    {
      "text": "Andrew Winston. 2019. Should Businesses Stop Flying to Fight Climate Change?MIT Sloan Management Review (Nov 2019). https://sloanreview.mit.edu/article/should-businesses-stop-flying-to-fight-climate-change/",
      "doi": ""
    },
    {
      "text": "Andrew Winston. 2020. Is the COVID-19 Outbreak a Black Swan or the New Normal?MIT Sloan Management Review (Mar 2020). https://sloanreview.mit.edu/article/is-the-covid-19-outbreak-a-black-swan-or-the-new-normal/",
      "doi": ""
    }
  ]
}