{
  "doi": "10.1145/3411764.3445216",
  "title": "Floral Tribute Ritual in Virtual Reality: Design and Validation of SenseVase with Virtual Memorial",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "While floral tributes are commonly used for the public commemoration of victims of disasters, war, and other accidents, flowers in vases color everyday life. In this research, these features of flowers are intertwined with the recent phenomenon of online memorials to develop a virtual floral tribute concept that includes physical rituals. We designed SenseVase, a smart vase to detect flowers placed in it, and a 3DCG Virtual Memorial that illustrates floral tributes given by people using SenseVases at home. This paper describes how we developed our design concept by reviewing previous literature and social aspects, and presents a video illustrating the concept. To validate the current concept, we interviewed several experts knowledgeable in public commemorations, virtual and online communities, and the floral business. Through a discussion of our findings from the design process and interviews, we propose a new direction for how HCI technology can contribute to public commemoration in addition to personal memorialization.",
  "authors": [
    {
      "name": "Daisuke Uriu",
      "institution": "Research Center for Advanced Science and Technology, The University of Tokyo, Japan",
      "img": "/do/10.1145/contrib-81320495613/rel-imgonly/20200801_daisuke-square.jpg",
      "acmid": "81320495613",
      "orcid": "0000-0002-9697-0807"
    },
    {
      "name": "Noriyasu Obushi",
      "institution": "Research Center for Advanced Science and Technology, The University of Tokyo, Japan",
      "img": "/do/10.1145/contrib-99659324993/rel-imgonly/99659324993.jpg",
      "acmid": "99659324993",
      "orcid": "missing"
    },
    {
      "name": "Zendai Kashino",
      "institution": "Research Center for Advanced Science and Technology, The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659607192",
      "orcid": "0000-0002-7248-1099"
    },
    {
      "name": "Atsushi Hiyama",
      "institution": "Research Center for Advanced Science and Technology, The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331494695",
      "orcid": "missing"
    },
    {
      "name": "Masahiko Inami",
      "institution": "Research Center for Advanced Science and Technology, The University of Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453637682",
      "orcid": "0000-0002-8652-0730"
    }
  ],
  "references": [
    {
      "text": "Alissa N. Antle, Greg Corness, Saskia Bakker, Milena Droumeva, Elise van den Hoven, and Allen Bevans. 2009. Designing to Support Reasoned Imagination through Embodied Metaphor. In Proceedings of the Seventh ACM Conference on Creativity and Cognition (Berkeley, California, USA) (C&C ’09). Association for Computing Machinery, New York, NY, USA, 275–284. https://doi.org/10.1145/1640233.1640275",
      "doi": "10.1145/1640233.1640275"
    },
    {
      "text": "Michael Arnold, Martin Gibbs, Tamara Kohn, James Meese, and Bjorn Nansen. 2017. Death and Digital Media. Routledge. 188 pages.",
      "doi": ""
    },
    {
      "text": "Asukanet Co., Ltd.2019. ASKA3D. https://aska3d.com/en/",
      "doi": ""
    },
    {
      "text": "Asukanet Co., Ltd.2019. Omokage. https://www.mds.ne.jp/omokage/",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson and Jim Blascovich. 2011. This is your mind online. IEEE Spectrum 48, 6 (June 2011), 78–83. https://doi.org/10.1109/MSPEC.2011.5779797",
      "doi": ""
    },
    {
      "text": "Saskia Bakker, Alissa N. Antle, and Elise van den Hoven. 2012. Embodied metaphors in tangible interaction design. Personal and Ubiquitous Computing 16, 4 (2012), 433–449.",
      "doi": "10.1007/s00779-011-0410-4"
    },
    {
      "text": "Heidi Bauer-Clapp. 2017. [Review] Heritage of death: landscapes of emotion, memory and practice. Heritage & Society 10, 3 (2017), 287–290.",
      "doi": ""
    },
    {
      "text": "BBC NEWS. 2006. ‘Dangerous’ road tributes concern. http://news.bbc.co.uk/2/hi/uk_news/wales/4806870.stm Accessed: 2019-12-27.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell. 2006. No More SMS From Jesus: Ubicomp, religion and techno-spiritual practices. Proc. of UbiComp 2006(2006), 141–158.",
      "doi": ""
    },
    {
      "text": "Allison Blais and Lynn Rasic. 2011. A Place of Remembrance. National Geographic Books. 227 pages.",
      "doi": ""
    },
    {
      "text": "Tom Boellstorff. 2008. Coming of Age in Second Life: An Anthropologist Explores the Virtually Human. Princeton University Press, USA.",
      "doi": "10.5555/1435408"
    },
    {
      "text": "Sébastien Penmellen Boret. 2014. Japanese tree burial: Ecology, kinship and the culture of death. Routledge.",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker and Vanessa Callison-Burch. 2016. Legacy Contact: Designing and Implementing Post-mortem Stewardship at Facebook. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI ’16 (2016), 2908–2919.",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Lynn S. Dombrowski, Anita M. Gilbert, Nafiri Kusumakaulika, and Gillian R. Hayes. 2014. Stewarding a Legacy: Responsibilities and Relationships in the Management of Post-mortem Data. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems(CHI ’14). ACM, Toronto, Ontario, Canada New York, NY, USA, 4157–4166.",
      "doi": "10.1145/2556288.2557059"
    },
    {
      "text": "Jed R. Brubaker and Gillian R. Hayes. 2011. ”We Will Never Forget You [Online]”: An Empirical Investigation of Post-mortem Myspace Comments. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (Hangzhou, China) (CSCW ’11). ACM, New York, NY, USA, 123–132. https://doi.org/10.1145/1958824.1958843",
      "doi": ""
    },
    {
      "text": "Elizabeth Buie and Mark Blythe. 2013. Spirituality: There’s an App for That! (But Not a Lot of Research). In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 2315–2324. https://doi.org/10.1145/2468356.2468754",
      "doi": ""
    },
    {
      "text": "Candi K. Cann. 2015. Virtual Afterlives: Grieving the Dead in the Twenty-First Century (Material Worlds Series). University Press of Kentucky. 212 pages.",
      "doi": ""
    },
    {
      "text": "Augusto Celentano, , and Emmanuel Dubois. 2015. Evaluating metaphor reification in tangible interfaces. Journal on Multimodal User Interfaces 9, 3 (2015), 231–252.",
      "doi": ""
    },
    {
      "text": "Inrak Choi, Eyal Ofek, Hrvoje Benko, Mike Sinclair, and Christian Holz. 2018. CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 654, 13 pages. https://doi.org/10.1145/3173574.3174228",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "Caitlin Doughty. 2020. EXPLORING GRIEF IN ANIMAL CROSSING: NEW HORIZONS. http://www.orderofthegooddeath.com/exploring-grief-in-animal-crossing-new-horizons Accessed: 2020-9-17.",
      "doi": ""
    },
    {
      "text": "Josh K. Elliott. 2020. ‘Final Fantasy’ gamers hold online funeral for player who died of COVID-19. https://globalnews.ca/news/6832247/coronavirus-video-game-funeral/ Accessed: 2020-9-17.",
      "doi": ""
    },
    {
      "text": "Facebook. [n.d.]. About Memorialized Accounts, Facebook Help Center. https://www.facebook.com/help/1017717331640041/ Accessed: 2021-1-5.",
      "doi": ""
    },
    {
      "text": "Mattias Frihammar and Helaine Silverman. 2017. Heritage of death: landscapes of emotion, memory and practice. Routledge. 244 pages.",
      "doi": ""
    },
    {
      "text": "Eman Gadalla. 2016. Second Life as a research environment: avatar-based focus groups (AFG). Qualitative Market Research: An International Journal 19, 1 (2016), 101–114. https://doi.org/10.1108/QMR-08-2015-0070",
      "doi": ""
    },
    {
      "text": "M. Dolores Gallego, Salvador Bueno, and Jan Noyes. 2016. Second Life adoption in education: A motivational model based on Uses and Gratifications theory. Computers and Education 100 (2016), 81–93. https://doi.org/10.1016/j.compedu.2016.05.001",
      "doi": "10.1016/j.compedu.2016.05.001"
    },
    {
      "text": "Martin Gibbs, James Meese, Michael Arnold, Bjorn Nansen, and Marcus Carter. 2015. #Funeral and Instagram: Death, Social Media, and Platform Vernacular. Information Communication and Society 18, 3 (2015), 255–268.",
      "doi": ""
    },
    {
      "text": "Peter Joseph Gloviczki. 2015. Journalism and Memorialization in the Age of Social Media. Springer. 185 pages.",
      "doi": ""
    },
    {
      "text": "Stine Gotved. 2015. Privacy with public access: digital memorials on quick response codes. Information, Communication & Society 18, 3 (2015), 269–280.",
      "doi": ""
    },
    {
      "text": "Hannah Gould, Tamara Kohn, and Martin Gibbs. 2018. Uploading the ancestors: Experiments with digital Buddhist altars in contemporary Japan. Death Studies 43, 7 (2018), 456–465.",
      "doi": ""
    },
    {
      "text": "Connor Graham, Michael Arnold, Tamara Kohn, and Martin R. Gibbs. 2015. Gravesites and websites: a comparison of memorialisation. Visual Studies 30, 1 (2015), 37–53.",
      "doi": ""
    },
    {
      "text": "Rebecca Gulotta, William Odom, Haakon Faste, and Jodi Forlizzi. 2014. Legacy in the Age of the Internet: Reflections on How Interactive Systems Shape How We Are Remembered. (2014), 975–984. https://doi.org/10.1145/2598510.2598579",
      "doi": ""
    },
    {
      "text": "Rebecca Gulotta, William Odom, Jodi Forlizzi, and Haakon Faste. 2013. Digital Artifacts As Legacy: Exploring the Lifespan and Value of Digital Data. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2013), 1813–1822. https://doi.org/10.1145/2470654.2466240",
      "doi": "10.1145/2470654.2466240"
    },
    {
      "text": "Jonna Häkkilä, Ashley Colley, and Matilda Kalving. 2019. Designing an Interactive Gravestone Display. PerDis ’19 Proceedings of the 8th ACM International Symposium on Pervasive Displays (2019), 4:1–4:7.",
      "doi": "10.1145/3321335.3324952"
    },
    {
      "text": "Jonna Häkkilä, Meri-Tuulia Forsman, and Ashley Colley. 2018. Navigating the Graveyard: Designing Technology for Deathscapes. (2018), 199–204.",
      "doi": ""
    },
    {
      "text": "Jonna Häkkilä, Petri Hannula, Elina Luiro, Emilia Launne, Sanni Mustonen, Toni Westerlund, and Ashley Colley. 2019. Visiting a Virtual Graveyard: Designing Virtual Reality Cultural Heritage Experiences. MUM ‘19 Proceedings of the 18th International Conference on Mobile and Ubiquitous Multimedia(2019), 56:1–56:4.",
      "doi": ""
    },
    {
      "text": "Michelle Hlubinka, Jennifer Beaudin, Emmanuel Munguia Tapia, and John S. An. 2002. AltarNation: interface design for meditative communities. CHI ’02 extended abstracts on Human factors in computing systems (2002), 612–613.",
      "doi": "10.1145/506443.506509"
    },
    {
      "text": "Rosalie Hooi and Hichang Cho. 2013. The Virtual “Me” is the Actual Me: Self-Disclosure in Virtual Environment. In Proceedings of the 2013 46th Hawaii International Conference on System Sciences(HICSS ’13). IEEE Computer Society, USA, 883–892. https://doi.org/10.1109/HICSS.2013.546",
      "doi": "10.1109/HICSS.2013.546"
    },
    {
      "text": "Jonna Häkkilä, Ashley Colley, Matilda Kalving, and Meri-Tuulia Forsman. 2020. Exploring pervasive displays for cemeteries and memorial sites. Personal and Ubiquitous Computing(2020). https://doi.org/10.1007/s00779-019-01359-1",
      "doi": ""
    },
    {
      "text": "Castle Jason and L. Phillips William. 2003. Grief Rituals: Aspects That Facilitate Adjustment to Bereavement. Journal of Loss and Trauma 8, 1 (2003), 41–71.",
      "doi": ""
    },
    {
      "text": "Hirokazu Kato, Mark Billinghurst, and Mark Billinghurst. 1999. Marker Tracking and HMD Calibration for a Video-Based Augmented Reality Conferencing System. In Proceedings of the 2Nd IEEE and ACM International Workshop on Augmented Reality(IWAR ’99). IEEE Computer Society, Washington, DC, USA, 85–. http://dl.acm.org/citation.cfm?id=857202.858134",
      "doi": ""
    },
    {
      "text": "Tamara Kohn, Martin Gibbs, Bjorn Nansen, and Luke van Ryn. 2019. Residues of Death. Routledge. 200 pages.",
      "doi": ""
    },
    {
      "text": "Jeremy Layton. 2019. 9/11: How NYC, nation will observe 18th anniversary. New York Post (2019). https://nypost.com/2019/09/10/9-11-how-nyc-nation-will-observe-18th-anniversary/ Accessed: 2019-12-20.",
      "doi": ""
    },
    {
      "text": "Yuhu Liu, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. ShapeSense: A 2D Shape Rendering VR Device with Moving Surfaces That Controls Mass Properties and Air Resistance. In ACM SIGGRAPH 2019 Emerging Technologies (Los Angeles, California) (SIGGRAPH ’19). ACM, New York, NY, USA, Article 23, 2 pages. https://doi.org/10.1145/3305367.3327991",
      "doi": "10.1145/3305367.3327991"
    },
    {
      "text": "Mainichi Japan. 2019. Kyoto residents’ group asks KyoAni not to build memorial at arson attack site. The Mainichi (2019). https://mainichi.jp/english/articles/20191226/p2a/00m/0na/002000c Accessed: 2020-1-5.",
      "doi": ""
    },
    {
      "text": "Michael Massimi and Ronald M. Baecker. 2011. Dealing with Death in Design: Developing Systems for the Bereaved. CHI ’11 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2011), 1001–1010.",
      "doi": "10.1145/1978942.1979092"
    },
    {
      "text": "Michael Massimi and Andrea Charise. 2009. Dying, death, and mortality: towards thanatosensitivity in HCI. CHI EA ’09: Proceedings of the 27th international conference extended abstracts on Human factors in computing systems (2009), 2459–2468.",
      "doi": ""
    },
    {
      "text": "Poppy Lauretta McLeod, Yi-Ching Liu, and Jill Elizabeth Axline. 2014. When Your Second Life Comes Knocking. Comput. Hum. Behav. 39, C (2014), 59–70. https://doi.org/10.1016/j.chb.2014.06.025",
      "doi": ""
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR: An Emerging Design Framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 564, 12 pages. https://doi.org/10.1145/3290605.3300794",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Wendy Moncur, Jan Bikker, Elaine Kasket, and John Troyer. 2012. From death to final disposition: roles of technology in the post-mortem interval. CHI ’12 Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems (2012), 531–540.",
      "doi": "10.1145/2207676.2207750"
    },
    {
      "text": "Wendy Moncur, Miriam Julius, Elise van den Hoven, and David Kirk. 2015. Story Shell: The Participatory Design of a Bespoke Digital Memorial. (2015), 470–477.",
      "doi": ""
    },
    {
      "text": "Wendy Moncur and David Kirk. 2014. An Emergent Framework for Digital Memorials. Proceedings of the 2014 Conference on Designing Interactive Systems DIS ’14 (2014), 965–965.",
      "doi": "10.1145/2598510.2598516"
    },
    {
      "text": "Aron Moss. [n.d.]. Why No Flowers on Jewish Graves?https://www.chabad.org/library/article_cdo/aid/1911395/jewish/Why-No-Flowers-on-Jewish-Graves.htm Accessed: 2021-1-5.",
      "doi": ""
    },
    {
      "text": "Takuji Narumi, Yuki Ban, Takashi Kajinami, Tomohiro Tanikawa, and Michitaka Hirose. 2012. Augmented Perception of Satiety: Controlling Food Consumption by Changing Apparent Size of Food with Augmented Reality. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). ACM, New York, NY, USA, 109–118. https://doi.org/10.1145/2207676.2207693",
      "doi": "10.1145/2207676.2207693"
    },
    {
      "text": "Takuji Narumi, Shinya Nishizaka, Takashi Kajinami, Tomohiro Tanikawa, and Michitaka Hirose. 2011. Augmented Reality Flavors: Gustatory Display Based on Edible Marker and Cross-modal Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 93–102. https://doi.org/10.1145/1978942.1978957",
      "doi": "10.1145/1978942.1978957"
    },
    {
      "text": "William Odom, Richard Banks, David Kirk, Richard Harper, Siân Lindley, and Abigail Sellen. 2012. Technology heirlooms?: considerations for passing down and inheriting digital materials. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems CHI ’12 (2012), 337–337.",
      "doi": "10.1145/2207676.2207723"
    },
    {
      "text": "William Odom, Daisuke Uriu, David Kirk, Richard Banks, and Ron Wakkary. 2018. Experiences in Designing Technologies for Honoring Deceased Loved Ones. Design Issues 34, 1 (2018), 54–66.",
      "doi": ""
    },
    {
      "text": "Okiseki Co., Ltd.2018. Ohaka-Mairu. http://www.okiseki.com/app/.",
      "doi": ""
    },
    {
      "text": "ONLINE TORO NAGASHI (LANTERN FLOATING FESTIVAL). 2020. ONLINE TORO NAGASHI (LANTERN FLOATING FESTIVAL) × HIROSHIMA RIVER OF LOVE 2020. http://tourounagashi.org/en.html Accessed: 2020-9-17.",
      "doi": ""
    },
    {
      "text": "OQTA. [n.d.]. OQTA Dove Clock. https://www.oqta.com/usa Accessed: 2020-9-17.",
      "doi": ""
    },
    {
      "text": "Tekla S. Perry. 2016. Virtual reality goes social. IEEE Spectrum 53, 1 (2016), 56–57.",
      "doi": "10.1109/MSPEC.2016.7367470"
    },
    {
      "text": "Stacey Pitsillides. 2019. Digital legacy: Designing with things. Death Studies 43, 1 (2019).",
      "doi": ""
    },
    {
      "text": "Michael Ray. 2013. Sandy Hook Elementary School shooting. Britannica (2013). https://www.britannica.com/event/Newtown-shootings-of-2012 Accessed: 2019-12-30.",
      "doi": ""
    },
    {
      "text": "Bronna D. Romanoff. 1998. Rituals and the Grieving Process. Death Studies 22, 8 (1998), 697–711.",
      "doi": ""
    },
    {
      "text": "Alice Running, Lauren Woodward Tolle, and Deb Girard. 2008. Ritual: The final expression of care. International Journal of Nursing Practice 14, 4 (2008), 303–307.",
      "doi": ""
    },
    {
      "text": "Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating Implications for Design through Design Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1971–1980. https://doi.org/10.1145/2556288.2557357",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "Corina Sas, Steve Whittaker, and John Zimmerman. 2016. Design for Rituals of Letting Go: An Embodiment Perspective on Disposal Practices Informed by Grief Therapy. ACM Trans. Comput.-Hum. Interact. 23, 4 (2016), 21:1–21:37.",
      "doi": "10.1145/2926714"
    },
    {
      "text": "Jotaro Shigeyama, Takeru Hashimoto, Shigeo Yoshida, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2019. Transcalibur: A Weight Shifting Virtual Reality Controller for 2D Shape Rendering Based on Computational Perception Model. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 11, 11 pages. https://doi.org/10.1145/3290605.3300241",
      "doi": "10.1145/3290605.3300241"
    },
    {
      "text": "Robert John Smith. 1974. Ancestor Worship in Contemporary Japan. Stanford University Press. 288 pages.",
      "doi": ""
    },
    {
      "text": "Dag Svanaes and William Verplank. 2000. In Search of Metaphors for Tangible User Intefaces. In Proceedings of DARE 2000 on Designing Augmented Reality Environments (Elsinore, Denmark) (DARE ’00). Association for Computing Machinery, New York, NY, USA, 121–129. https://doi.org/10.1145/354666.354679",
      "doi": "10.1145/354666.354679"
    },
    {
      "text": "The Guardian. 2019. ‘Too painful’: Kyoto anime fans join prime ministers in mourning fire victims. https://www.theguardian.com/world/2019/jul/19/too-painful-kyoto-anime-fans-join-prime-ministers-in-mourning-fire-victims Accessed: 2019-12-30.",
      "doi": ""
    },
    {
      "text": "The Yomiuri Shimbun. 2019. Victims of Kawasaki fatal stabbing mourned. https://the-japan-news.com/news/article/0005773889 Accessed: 2019-12-27.",
      "doi": ""
    },
    {
      "text": "Daisuke Uriu, Ju-Chun Ko, Bing-Yu Chen, Atsushi Hiyama, and Masahiko Inami. 2019. Digital Memorialization in Death-Ridden Societies: How HCI Could Contribute to Death Rituals in Taiwan and Japan. Human Aspects of IT for the Aged Population. Design for the Elderly and Technology Acceptance (2019), 532–550.",
      "doi": ""
    },
    {
      "text": "Daisuke Uriu and William Odom. 2016. Designing for Domestic Memorialization and Remembrance: A Field Study of Fenestra in Japan. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems CHI ’16 (2016), 5945–5957.",
      "doi": "10.1145/2858036.2858069"
    },
    {
      "text": "Daisuke Uriu, William Odom, and Hannah Gould. 2018. Understanding Automatic Conveyor-belt Columbaria: Emerging Sites of Interactive Memorialization in Japan. Proceedings of the 2018 Designing Interactive Systems Conference (2018), 747–752.",
      "doi": "10.1145/3196709.3196801"
    },
    {
      "text": "Daisuke Uriu, William Odom, Mei-Kei Lai, Sai Taoka, and Masahiko Inami. 2018. SenseCenser: An Interactive Device for Sensing Incense Smoke & Supporting Memorialization Rituals in Japan. Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems(2018), 315–318.",
      "doi": "10.1145/3197391.3205394"
    },
    {
      "text": "Daisuke Uriu, Takahiro Ogasawara, Naohito Shimizu, and Naohito Okude. 2006. MASTABA: The Household Shrine in the Future Archived Digital Pictures. ACM SIGGRAPH 2006 Sketches, Article 151 New York, NY, USA (2006).",
      "doi": ""
    },
    {
      "text": "Daisuke Uriu and Naohito Okude. 2010. ThanatoFenestra: photographic family altar supporting a ritual to pray for the deceased. Proc. of DIS ’10 (2010), 422–425.",
      "doi": "10.1145/1858171.1858253"
    },
    {
      "text": "Jayne Wallace, Kyle Montague, Trevor Duncan, Luís P. Carvalho, Nantia Koulidou, Jamie Mahoney, Kellie Morrissey, Claire Craig, Linnea Iris Groot, Shaun Lawson, Patrick Olivier, Julie Trueman, and Helen Fisher. 2020. ReFind: Design, Lived Experience and Ongoingness in Bereavement. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376531",
      "doi": "10.1145/3313831.3376531"
    },
    {
      "text": "Jayne Wallace, James Thomas, Derek Anderson, and Patrick Olivier. 2018. Mortality as Framed by Ongoingness in Digital Design. Design Issues 34, 1 (2018), 95–107.",
      "doi": ""
    },
    {
      "text": "Tony Walter. 2015. Communication media and the dead: from the Stone Age to Facebook. Mortality 20, 3 (2015), 215–232.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. CHI ’07: Proceedings of the SIGCHI conference on Human factors in computing systems (2007), 493–502.",
      "doi": "10.1145/1240624.1240704"
    },
    {
      "text": "Fabio Zünd, Mattia Ryffel, Stéphane Magnenat, Alessia Marra, Maurizio Nitti, Mubbasir Kapadia, Gioacchino Noris, Kenny Mitchell, Markus Gross, and Robert W. Sumner. 2015. Augmented Creativity: Bridging the Real and Virtual Worlds to Enhance Creative Play. In SIGGRAPH Asia 2015 Mobile Graphics and Interactive Applications (Kobe, Japan) (SA ’15). ACM, New York, NY, USA, Article 21, 7 pages. https://doi.org/10.1145/2818427.2818460",
      "doi": "10.1145/2818427.2818460"
    }
  ]
}