{
  "doi": "10.1145/3411764.3445279",
  "title": "Flag and Flaggability in Automated Moderation: The Case of Reporting Toxic Behavior in an Online Game Community",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Online platforms rely upon users or automated tools to flag toxic behaviors, the very first step in online moderation. While much recent research has examined online moderation, the role of flag remains poorly understood. This question becomes even more urgent in automated moderation, where flagging becomes a primary source of human judgment. We conducted a qualitative study of flagging practices in League of Legends (LoL), a popular eSports game. We found stark differences between how flag is designed to identify toxicity, and flaggability, or how players use and appropriate flag. Players distrust flag, but also appropriate flag for instrumental purposes. Thus, flaggability diverges decidedly from the conception of toxicity, and must be understood within the highly competitive gaming context of LoL. These findings help shed light on the situated nature of flaggability, the role of flag in online moderation, as well as implications for designing flag and moderation.",
  "tags": [
    "competitive gaming",
    "governance",
    "toxicity",
    "toxic meritocracy",
    "Report",
    "League of Legends",
    "regulation",
    "flag",
    "toxic behavior",
    "online community",
    "moderation"
  ],
  "authors": [
    {
      "name": "Yubo Kou",
      "institution": "College of Information Sciences and Technology Pennsylvania State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020443",
      "orcid": "0000-0002-4255-3725"
    },
    {
      "name": "Xinning Gui",
      "institution": "College of Information Sciences and Technology Pennsylvania State University, United States",
      "img": "/do/10.1145/contrib-99658649184/rel-imgonly/with_melon_2.jpeg",
      "acmid": "99658649184",
      "orcid": "0000-0002-9436-7940"
    }
  ],
  "references": [
    {
      "text": "Leigh Achterbosch, Charlynn Miller, and Peter Vamplew. 2017. A taxonomy of griefer type by motivation in massively multiplayer online role-playing games. Behav. Inf. Technol. 36, 8 (August 2017), 846–860. DOI: https://doi.org/10.1080/0144929X.2017.1306109",
      "doi": "10.1080/0144929X.2017.1306109"
    },
    {
      "text": "Sonam Adinolf and Selen Turkay. 2018. Toxic Behaviors in Esports Games: Player Perceptions and Coping Strategies. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts - CHI PLAY ’18 Extended Abstracts, 365–372. DOI: https://doi.org/10.1145/3270316.3271545",
      "doi": "10.1145/3270316.3271545"
    },
    {
      "text": "Ali Alkhatib and Michael Bernstein. 2019. Street–level algorithms: A theory at the gaps between policy and decisions. In Conference on Human Factors in Computing Systems - Proceedings, 1–13. DOI: https://doi.org/10.1145/3290605.3300760",
      "doi": "10.1145/3290605.3300760"
    },
    {
      "text": "Richard A. Bartle. 1996. Hearts, Clubs, Diamonds, Spades: Players Who Suit MUDs. J. Virtual Environ. 1, 1 (1996).",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the implication is not to design (technology). In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11, 2271–2274. DOI: https://doi.org/10.1145/1978942.1979275",
      "doi": ""
    },
    {
      "text": "Jeremy Blackburn and Haewoon Kwak. 2014. STFU NOOB!: predicting crowdsourced decisions on toxic behavior in online games. In Proceedings of the 23rd international conference on World wide web - WWW ’14, 877–888. DOI: https://doi.org/10.1145/2566486.2567987",
      "doi": "10.1145/2566486.2567987"
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and Its Consequences for Online Harassment: Design Insights from HeartMob. Proc. ACM Human-Computer Interact. 1, CSCW (2017), 24. DOI: https://doi.org/10.1145/3134659",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qual. Res. Psychol. 3, 2 (January 2006), 77–101. DOI: https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Amy Bruckman, Pavel Curtis, Cliff Figallo, and Brenda Laurel. 1994. Approaches to managing deviant behavior in virtual communities. In Conference companion on Human factors in computing systems - CHI ’94, 183–184. DOI: https://doi.org/10.1145/259963.260231",
      "doi": "10.1145/259963.260231"
    },
    {
      "text": "Kate Crawford and Tarleton Gillespie. 2016. What is a flag for? Social media reporting tools and the vocabulary of complaint. New Media Soc. 18, 3 (March 2016), 410–428. DOI: https://doi.org/10.1177/1461444814543163",
      "doi": ""
    },
    {
      "text": "Nicole Crenshaw, Jaclyn LaMorte, and Bonnie Nardi. 2017. &quot;Something We Loved That Was Taken Away&quot;: Community and Neoliberalism in World of Warcraft. In Hawaii International Conference on System Sciences 2017 (HICSS-50). Retrieved May 30, 2020 from https://aisel.aisnet.org/hicss-50/dsm/games_and_gaming/5",
      "doi": ""
    },
    {
      "text": "Jessie Daniels. 2009. Cyber racism: White supremacy online and the new attack on civil rights. Rowman & Littlefield Publishers.",
      "doi": ""
    },
    {
      "text": "Jessie Daniels and Nick LaLone. 2012. Racism in video gaming: connecting extremist and mainstream expressions of white supremacy. Soc. exclusion, power, video game Play new Res. Digit. media Technol. (2012), 85–100.",
      "doi": ""
    },
    {
      "text": "Scott Donaldson. 2015. Mechanics and Metagame: Exploring Binary Expertise in League of Legends. Games Cult. (June 2015), 1–19. DOI: https://doi.org/10.1177/1555412015590063",
      "doi": ""
    },
    {
      "text": "Scott Donaldson. 2017. I Predict a Riot: Making and Breaking Rules and Norms in League of Legends. In DiGRA 2017. Retrieved June 1, 2020 from https://www.semanticscholar.org/paper/I-Predict-a-Riot%3A-Making-and-Breaking-Rules-and-in-Donaldson/99099cb226fb938ec35dfb124088151af9501afa",
      "doi": ""
    },
    {
      "text": "Bryan Dosono and Bryan Semaan. 2019. Moderation practices as emotional labor in sustaining online communities: The case of AAPI identity work on reddit. In Conference on Human Factors in Computing Systems - Proceedings. DOI: https://doi.org/10.1145/3290605.3300372",
      "doi": "10.1145/3290605.3300372"
    },
    {
      "text": "Jenny Fan and Amy X. Zhang. 2020. Digital Juries: A Civics-Oriented Approach to Platform Governance. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, 1–14. DOI: https://doi.org/10.1145/3313831.3376293",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Amy S. Bruckman, Cosmin Munteanu, Melissa Densmore, and Jenny Waycott. 2017. Research Ethics in HCI: A Town Hall Meeting. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’17, 1295–1299. DOI: https://doi.org/10.1145/3027063.3051135",
      "doi": "10.1145/3027063.3051135"
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2017. eSports as An Emerging Research Context at CHI: Diverse Perspectives on Definitions. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’17, 1601–1608. DOI: https://doi.org/10.1145/3027063.3053158",
      "doi": "10.1145/3027063.3053158"
    },
    {
      "text": "Tarleton Gillespie. 2018. Custodians of the internet: platforms, content moderation, and the hidden decisions that shape social media. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2018. Facebook and YouTube just got more transparent. What do we see? niemanlab.",
      "doi": ""
    },
    {
      "text": "James Grimmelmann. 2015. The Virtues of Moderation. Yale J. Law Technol. 17, (2015). Retrieved September 2, 2019 from https://heinonline.org/HOL/Page?handle=hein.journals/yjolt17&id=42&div=3&collection=journals",
      "doi": ""
    },
    {
      "text": "Sidney V. Irwin and Anjum Naweed. 2018. BM'ing, Throwing, Bug Exploiting, and Other Forms of (Un)Sportsmanlike Behavior in CS:GO Esports. Games Cult. (October 2018), 155541201880495. DOI: https://doi.org/10.1177/1555412018804952",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Iris Birman, Eric Gilbert, and Amy Bruckman. 2019. Human-Machine Collaboration for Content Regulation: The Case of Reddit Automoderator. ACM Trans. Comput. Interact. 26, 5 (July 2019), 1–35. DOI: https://doi.org/10.1145/3338243",
      "doi": "10.1145/3338243"
    },
    {
      "text": "Shagun Jhaver, Amy Buckman, and Eric Gilbert. 2019. Does Transparency in Moderation Really Matter?: User Behavior After Content Removal Explanations on Reddit. Proc. ACM Human-Computer Interact. 3, CSCW (2019), 27.",
      "doi": "10.1145/3359252"
    },
    {
      "text": "Simon Joss and Arthur Brownlea. 1999. Considering the concept of procedural justice for public policy- and decision-making in science and technology. Sci. Public Policy 26, 5 (October 1999), 321–330. DOI: https://doi.org/10.3152/147154399781782347",
      "doi": ""
    },
    {
      "text": "Anja Kalch and Teresa K. Naab. 2017. Replying, disliking, flagging: How users engage with uncivil and impolite comments on news sites. Stud. Commun. | Media 6, 4 (January 2017), 395–419. DOI: https://doi.org/10.5771/2192-4007-2017-4-395",
      "doi": ""
    },
    {
      "text": "Sara Kiesler, Jane Siegel, and Timothy W. McGuire. 1984. Social psychological aspects of computer-mediated communication. Am. Psychol. 39 (1984), 1123–1134.",
      "doi": ""
    },
    {
      "text": "Yubo Kou. 2020. Toxic Behaviors in Team-Based Competitive Gaming: The Case of League of Legends. In Proceedings of the 2020 Annual Symposium on Computer-Human Interaction in Play - CHI PLAY ’20, 81–92. DOI: https://doi.org/10.1145/3410404.3414243",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2018. Entangled with Numbers: Quantified Self and Others in a Team-Based Online Game. Proc. ACM Human-Computer Interact. 2, CSCW (November 2018), 1–25. DOI: https://doi.org/10.1145/3274362",
      "doi": "10.1145/3274362"
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2020. Emotion Regulation in eSports Gaming: A Qualitative Study of League of Legends. Proc. ACM Human-Computer Interact. 4, CSCW2 (October 2020), 1–25. DOI: https://doi.org/10.1145/3415229",
      "doi": "10.1145/3415229"
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2020. Mediating Community-AI Interaction through Situated Explanation: The Case of AI-Led Moderation. Proc. ACM Human-Computer Interact. 4, CSCW2 (October 2020), 1–27. DOI: https://doi.org/10.1145/3415173",
      "doi": "10.1145/3415173"
    },
    {
      "text": "Yubo Kou, Xinning Gui, and Yong Ming Kow. 2016. Ranking Practices and Distinction in League of Legends. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play - CHI PLAY ’16, 4–9. DOI: https://doi.org/10.1145/2967934.2968078",
      "doi": "10.1145/2967934.2968078"
    },
    {
      "text": "Yubo Kou, Xinning Gui, Shaozeng Zhang, and Bonnie Nardi. 2017. Managing Disruptive Behavior through Non-Hierarchical Governance: Crowdsourcing in League of Legends and Weibo. Proc. ACM Human-Computer Interact. 1, CSCW (2017), 62. DOI: https://doi.org/10.1145/3134697",
      "doi": "10.1145/3134697"
    },
    {
      "text": "Yubo Kou, Yao Li, Xinning Gui, and Eli Suzuki-Gill. 2018. Playing with Streakiness in Online Games: How Players Perceive and React to Winning and Losing Streaks in League of Legends. In CHI’2018, 1–14. DOI: https://doi.org/10.1145/3173574.3174152",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Bonnie Nardi. 2014. Governance in League of Legends: A Hybrid System. In Foundations of Digital Games.",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring Cyberbullying and Other Toxic Behavior in Team Competition Online Games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, 3739–3748. DOI: https://doi.org/10.1145/2702123.2702529",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated Learning: Legitimate Peripheral Participation (1st ed.). Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Lawrence Lessig. 2006. Code: And Other Laws of Cyberspace, Version 2.0. Basic Books.",
      "doi": "10.5555/556848"
    },
    {
      "text": "Holin Lin and Chuen-Tsai Sun. 2005. The “White-Eyed” Player Culture: Grief Play and Construction of Deviance in MMORPGs. In DiGRA 2005.",
      "doi": ""
    },
    {
      "text": "Yang Liu, Qiaozhu Mei, David A Hanauer, Kai Zheng, and Joyce M Lee. 2016. Use of Social Media in the Diabetes Community: An Exploratory Analysis of Diabetes-Related Tweets. JMIR Diabetes 1, 2 (November 2016), e4. DOI: https://doi.org/10.2196/diabetes.6256",
      "doi": ""
    },
    {
      "text": "Marçal Mora-Cantallops and Miguel-Ángel Sicilia. 2018. MOBA games: A literature review. Entertain. Comput. 26, (May 2018), 128–138. DOI: https://doi.org/10.1016/J.ENTCOM.2018.02.005",
      "doi": ""
    },
    {
      "text": "Chip Morningstar and F. Randall Farmer. 1991. The Lessons of Lucasfilm's Habitat. In Cyberspace: First Steps, Michael Benedikt (ed.). MIT Press, Cambridge, MA, USA, 273–302. Retrieved from http://dl.acm.org/citation.cfm?id=114772.114792",
      "doi": "10.5555/114772.114792"
    },
    {
      "text": "Cosmin Munteanu, Amy Bruckman, Michael Muller, Christopher Frauenberger, Casey Fiesler, Robert E. Kraut, Katie Shilton, and Jenny Waycott. 2019. SIGCHI Research Ethics Town Hall. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI EA ’19, 1–6. DOI: https://doi.org/10.1145/3290607.3311742",
      "doi": ""
    },
    {
      "text": "Teresa K Naab, Anja Kalch, and Tino GK Meitz. 2018. Flagging uncivil user comments: Effects of intervention information, type of victim, and response comments on bystander behavior. New Media Soc. 20, 2 (February 2018), 777–795. DOI: https://doi.org/10.1177/1461444816670923",
      "doi": ""
    },
    {
      "text": "Nikos Ntoumanis, Stuart J.H. Biddle, and Geoffrey Haddock. 1999. The mediating role of coping strategies on the relationship between achievement motivation and affect in sport. Anxiety, Stress Coping 12, 3 (1999), 299–327. DOI: https://doi.org/10.1080/10615809908250480",
      "doi": ""
    },
    {
      "text": "Patrick B. O'Sullivan and Andrew J. Flanagin. 2003. Reconceptualizing ‘flaming’ and other problematic messages. New Media Soc. 5, 1 (March 2003), 69–94. DOI: https://doi.org/10.1177/1461444803005001908",
      "doi": ""
    },
    {
      "text": "Simon Parkin. 2015. A Video-Game Algorithm to Solve Online Abuse. MIT Technology Review`. Retrieved from https://www.technologyreview.com/s/541151/a-video-game-algorithm-to-solve-online-abuse/",
      "doi": ""
    },
    {
      "text": "Christopher A Paul. 2018. The Toxic Meritocracy of Video Games: Why Gaming Culture Is the Worst. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "QSR International. 2019. NVivo 12. Retrieved from https://www.qsrinternational.com/nvivo/nvivo-products/nvivo-12-pro",
      "doi": ""
    },
    {
      "text": "Sarah T. Roberts. 2016. Commercial Content Moderation: Digital Laborers’ Dirty Work. Media Stud. Publ. (January 2016). Retrieved September 1, 2019 from https://ir.lib.uwo.ca/commpub/12",
      "doi": ""
    },
    {
      "text": "Kathleen Van Royen, Karolien Poels, and Heidi Vandebosch. 2016. Help, I Am Losing Control! Examining the Reporting of Sexual Harassment by Adolescents to Social Networking Sites. Cyberpsychology, Behav. Soc. Netw. 19, 1 (January 2016), 16–22. DOI: https://doi.org/10.1089/cyber.2015.0168",
      "doi": ""
    },
    {
      "text": "Kenneth B. Shores, Yilin He, Kristina L. Swanenburg, Robert Kraut, and John Riedl. 2014. The identification of deviance and its impact on retention in a multiplayer game. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW ’14, 1356–1365. DOI: https://doi.org/10.1145/2531602.2531724",
      "doi": "10.1145/2531602.2531724"
    },
    {
      "text": "Spandana Singh. 2019. Everything in Moderation: An Analysis of How Internet Platforms Are Using Artificial Intelligence to Moderate User-Generated Content.",
      "doi": ""
    },
    {
      "text": "Lee Sproull and Sara Kiesler. 1986. Reducing Social Context Cues: Electronic Mail in Organizational Communication. Manag. Sci. 32, 11 (November 1986), 1492–1512. DOI: https://doi.org/10.1287/mnsc.32.11.1492",
      "doi": ""
    },
    {
      "text": "Anselm L. Strauss. 1987. Qualitative analysis for social scientists. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Mark C. Suchman. 1995. Managing Legitimacy: Strategic and Institutional Approaches. Acad. Manag. Rev. 20, 3 (July 1995), 571–610. DOI: https://doi.org/10.2307/258788",
      "doi": ""
    },
    {
      "text": "John Suler. 2004. The online disinhibition effect. Cyberpsychology Behav. impact Internet, Multimed. virtual Real. Behav. Soc. 7, 3 (June 2004), 321–326. DOI: https://doi.org/10.1089/1094931041291295",
      "doi": ""
    },
    {
      "text": "Pete Volk. 2016. League of Legends now boasts over 100 million monthly active players worldwide. riftherald.com. Retrieved from http://www.riftherald.com/2016/9/13/12865314/monthly-lol-players-2016-active-worldwide",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn. 2019. Volunteer moderators in twitch micro communities: How they get involved, the roles they play, and the emotional labor they experience. In Conference on Human Factors in Computing Systems - Proceedings. DOI: https://doi.org/10.1145/3290605.3300390",
      "doi": "10.1145/3290605.3300390"
    },
    {
      "text": "YouTube. 2020. YouTube Trusted Flagger program. support.google.com. Retrieved from https://support.google.com/youtube/answer/7554338?hl=en",
      "doi": ""
    },
    {
      "text": "Bingjie Yu, Katta Spiel, and Leon Watts. Supporting Care as a Layer of Concern: Nurturing Attitudes in Online Community Moderation. Retrieved August 31, 2019 from https://www.metafilter.com",
      "doi": ""
    },
    {
      "text": "Amy X. Zhang, Grant Hugh, and Michael S. Bernstein. 2020. PolicyKit: Building Governance in Online Communities. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology, 365–378. DOI: https://doi.org/10.1145/3379337.3415858",
      "doi": ""
    }
  ]
}