{
  "doi": "10.1145/3411764.3445124",
  "title": "Empowering Dyads of Older Adults With Mild Cognitive Impairment And Their Care Partners Using Conversational Agents",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Conversational agents (CAs) such as Google Home or Alexa offer empowering opportunities for dyads composed of older adults with mild cognitive impairment (MCI) and their care partners. CAs support coordination and planning between the two, and can amplify the support that the care partner needs to provide. In this study, we observed how ten such dyads interacted with a Google Home over 10 weeks. We logged and analyzed 3,878 total interactions, interviewed the dyads to better understand their experiences, and also surveyed their individual preferences and priorities for automated assistance in the home. We found that CAs empowered both the people who had MCI, and their care partners. We observed that the utility of the CA in the day-to-day lives of users largely depended on how much the care partner scaffolded promising functionality, setting it up and contextualizing it for specific needs and desires.",
  "authors": [
    {
      "name": "Tamara Zubatiy",
      "institution": "Everyday Computing Laboratory Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659673448",
      "orcid": "missing"
    },
    {
      "name": "Kayci L Vickers",
      "institution": "Neurology Emory University School of Medicine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701414",
      "orcid": "missing"
    },
    {
      "name": "Niharika Mathur",
      "institution": "Everyday Computing Lab Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702344",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth D Mynatt",
      "institution": "Institute for People and Teechnology Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100331104",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Amazon Echo vs. Google Home. https://www.pcmag.com/news/amazon-echo-vs-google-home-which-smart-speaker-is-best",
      "doi": ""
    },
    {
      "text": "[n.d.]. Mild Cognitive Impairment (MCI). https://www.alz.org/alzheimers-dementia/what-is-dementia/related_conditions/mild-cognitive-impairment?utm_source=google",
      "doi": ""
    },
    {
      "text": "Noura Abdi, Kopo M Ramokapane, and Jose M Such. 2019. More than smart speakers: security and privacy perceptions of smart home personal assistants. In Fifteenth Symposium on Usable Privacy and Security ({SOUPS} 2019).",
      "doi": ""
    },
    {
      "text": "Ali Abdolrahmani, Ravi Kuber, and Stacy M Branham. 2018. ” Siri Talks at You” An Empirical Investigation of Voice-Activated Personal Assistant (VAPA) Usage by Individuals Who Are Blind. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. 249–258.",
      "doi": "10.1145/3234695.3236344"
    },
    {
      "text": "Matthias Baldauf, Raffael Bösch, Christian Frei, Fabian Hautle, and Marc Jenny. 2018. Exploring requirements and opportunities of conversational user interfaces for the cognitively impaired. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct - MobileHCI ’18. ACM Press, Barcelona, Spain, 119–126. https://doi.org/10.1145/3236112.3236128",
      "doi": "10.1145/3236112.3236128"
    },
    {
      "text": "Erin Beneteau, Ashley Boone, Yuxing Wu, Julie A Kientz, Jason Yip, and Alexis Hiniker. 2020. Parenting with Alexa: Exploring the Introduction of Smart Speakers on Family Dynamics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376344"
    },
    {
      "text": "Erin Beneteau, Olivia K Richards, Mingrui Zhang, Julie A Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication breakdowns between families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "Frank Bentley, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottridge. 2018. Understanding the Long-Term Use of Smart Speaker Assistants. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (Sept. 2018), 1–24. https://doi.org/10.1145/3264901",
      "doi": "10.1145/3264901"
    },
    {
      "text": "Jared M Bruce, Michael McQuiggan, Vanessa Williams, Holly Westervelt, and Geoffrey Tremont. 2008. Burden among spousal and child caregivers of patients with mild cognitive impairment. Dementia and geriatric cognitive disorders 25, 4 (2008), 385–390.",
      "doi": ""
    },
    {
      "text": "Clare Carroll, Catherine Chiodo, Adena Xin Lin, Meg Nidever, and Jayanth Prathipati. 2017. Robin: Enabling Independence For Individuals With Cognitive Disabilities Using Voice Assistive Technology. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’17. ACM Press, Denver, Colorado, USA, 46–53. https://doi.org/10.1145/3027063.3049266",
      "doi": "10.1145/3027063.3049266"
    },
    {
      "text": "John Carroll and Sooyeon Lee. 2020. Talk the Talk: How Human Conversational Agents Build Trust. http://casforhealth.org/wp-content/uploads/2020/04/Talk-the-Talk-How-Human-Conversational-Agents-Build-Trust.pdf",
      "doi": ""
    },
    {
      "text": "Nicole Carson, Larry Leach, and Kelly J Murphy. 2018. A re-examination of Montreal Cognitive Assessment (MoCA) cutoff scores. International Journal of Geriatric Psychiatry 33, 2(2018), 379–388.",
      "doi": ""
    },
    {
      "text": "Roger Clarke. 2009. Privacy impact assessment: Its origins and development. Computer law & security review 25, 2 (2009), 123–135.",
      "doi": ""
    },
    {
      "text": "Andrea Cuadra and Emily Tseng. 2020. Using Intelligent Voice Assistants to Enhance the Provision of Home Care for Older Adults.",
      "doi": ""
    },
    {
      "text": "Sara J Czaja and Joseph Sharit. 2016. Designing Training and Instructional Programs for Older Adults. CRC Press, London. OCLC: 957230652.",
      "doi": ""
    },
    {
      "text": "Luis Carlos Rubino de Oliveira, Andrew May, Val Mitchell, Mike Coleman, Tom Kane, and Steven Firth. 2015. Pre-installation challenges: classifying barriers to the introduction of smart home technology. In EnviroInfo and ICT for Sustainability 2015. Atlantis Press.",
      "doi": ""
    },
    {
      "text": "Andy P Dickens, Suzanne H Richards, Colin J Greaves, and John L Campbell. 2011. Interventions targeting social isolation in older people: a systematic review. BMC public health 11, 1 (2011), 647.",
      "doi": ""
    },
    {
      "text": "Arthur D. Fisk, Sara J. Czaja, Wendy A. Rogers, Neil Charness, Sara J. Czaja, and Joseph Sharit. 2018. Designing for Older Adults: Principles and Creative Human Factors Approaches, Second Edition (0 ed.). CRC Press. https://doi.org/10.1201/9781420080681",
      "doi": ""
    },
    {
      "text": "Marcia Ford and William Palmer. 2019. Alexa, are you listening to me? An analysis of Alexa voice service network traffic. Personal and Ubiquitous Computing 23, 1 (Feb. 2019), 67–79. https://doi.org/10.1007/s00779-018-1174-x",
      "doi": "10.1007/s00779-018-1174-x"
    },
    {
      "text": "Serge Gauthier, Barry Reisberg, Michael Zaudig, Ronald C Petersen, Karen Ritchie, Karl Broich, Sylvie Belleville, Henry Brodaty, David Bennett, Howard Chertkow, 2006. Mild cognitive impairment. The lancet 367, 9518 (2006), 1262–1270.",
      "doi": ""
    },
    {
      "text": "Felicia C Goldstein, Angela V Ashley, Eric Miller, Olga Alexeeva, Lavezza Zanders, and Veronique King. 2014. Validity of the montreal cognitive assessment as a screen for mild cognitive impairment and dementia in African Americans. Journal of geriatric psychiatry and neurology 27, 3 (2014), 199–203.",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI conference on Human factors in computing systems. 17–24.",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Janet Johnson, Khalil Mrini, Allison Moore, Emilia Farkas, Ndapa Nkashole, Michael Hogarth, and Nadir Weibel. 2020. Voice-Based Conversational Agents for Older Adults. http://casforhealth.org/wp-content/uploads/2020/04/Voice-Based-Conversational-Agents-for-Older-Adults.pdf",
      "doi": ""
    },
    {
      "text": "Rebecca A Johnson and Jason Karlawish. 2015. A review of ethical issues in dementia. International psychogeriatrics 27, 10 (2015), 1635–1647.",
      "doi": ""
    },
    {
      "text": "Julie A. Kientz, Shwetak N. Patel, Brian Jones, Ed Price, Elizabeth D. Mynatt, and Gregory D. Abowd. 2008. The Georgia Tech Aware Home. In CHI ’08 Extended Abstracts on Human Factors in Computing Systems (Florence, Italy) (CHI EA ’08). Association for Computing Machinery, New York, NY, USA, 3675–3680. https://doi.org/10.1145/1358628.1358911",
      "doi": "10.1145/1358628.1358911"
    },
    {
      "text": "Scott YH Kim. 2011. The ethics of informed consent in Alzheimer disease research. Nature Reviews Neurology 7, 7 (2011), 410–414.",
      "doi": ""
    },
    {
      "text": "Bret Kinsella. 2019. Voice Assistant Demographic Data - Young Consumers More Likely to Own Smart Speakers While Over 60 Bias Toward Alexa and Siri. https://voicebot.ai/2019/06/21/voice-assistant-demographic-data-young-consumers-more-likely-to-own-smart-speakers-while-over-60-bias-toward-alexa-and-siri/",
      "doi": ""
    },
    {
      "text": "Josephine Lau, Benjamin Zimmerman, and Florian Schaub. 2018. Alexa, are you listening? privacy perceptions, concerns and privacy-seeking behaviors with smart speakers. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–31.",
      "doi": "10.1145/3274371"
    },
    {
      "text": "Haley MacLeod, Maia Jacobs, Katie Siek, Kay Connelly, and Elizabeth Mynatt. 2016. Ethical Considerations in Pervasive Health Research. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare. ACM, Cancun, Mexico. https://doi.org/10.4108/eai.16-5-2016.2263813",
      "doi": "10.5555/3021319.3021378"
    },
    {
      "text": "Michael Malek-Ahmadi, Jessica J Powell, Christine M Belden, Kathy O’Connor, Linda Evans, David W Coon, and Walter Nieri. 2015. Age-and education-adjusted normative data for the Montreal Cognitive Assessment (MoCA) in older adults age 70–99. Aging, Neuropsychology, and Cognition 22, 6 (2015), 755–761.",
      "doi": ""
    },
    {
      "text": "Sadaf Arefi Milani, Michael Marsiske, Linda B Cottler, Xinguang Chen, and Catherine W Striley. 2018. Optimal cutoffs for the Montreal Cognitive Assessment vary by race and ethnicity. Alzheimer’s & Dementia: Diagnosis, Assessment & Disease Monitoring 10(2018), 773–781.",
      "doi": ""
    },
    {
      "text": "Ziad S Nasreddine, Natalie A Phillips, Valérie Bédirian, Simon Charbonneau, Victor Whitehead, Isabelle Collin, Jeffrey L Cummings, and Howard Chertkow. 2005. The Montreal Cognitive Assessment, MoCA: a brief screening tool for mild cognitive impairment. Journal of the American Geriatrics Society 53, 4 (2005), 695–699.",
      "doi": ""
    },
    {
      "text": "Jennifer M Ortman, Victoria A Velkoff, Howard Hogan, 2014. An aging nation: the older population in the United States. United States Census Bureau, Economics and Statistics Administration, US ….",
      "doi": ""
    },
    {
      "text": "Ronald C Petersen. 2004. Mild cognitive impairment as a diagnostic entity. Journal of internal medicine 256, 3 (2004), 183–194.",
      "doi": ""
    },
    {
      "text": "Martin Porcheron, Joel E. Fischer, Stuart Reeves, and Sarah Sharples. 2018. Voice Interfaces in Everyday Life. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3174214",
      "doi": "10.1145/3173574.3174214"
    },
    {
      "text": "Alisha Pradhan, Leah Findlater, and Amanda Lazar. 2019. ” Phantom Friend” or” Just a Box with Information” Personification and Ontological Categorization of Smart Speaker-based Voice Assistants by Older Adults. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–21.",
      "doi": ""
    },
    {
      "text": "Alisha Pradhan, Kanika Mehta, and Leah Findlater. 2018. ” Accessibility Came by Accident” Use of Voice-Controlled Intelligent Personal Assistants by People with Disabilities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174033"
    },
    {
      "text": "Sergio Sayago, Barbara Barbosa Neves, and Benjamin R Cowan. 2019. Voice assistants and older people: some open issues. In Proceedings of the 1st International Conference on Conversational User Interfaces - CUI ’19. ACM Press, Dublin, Ireland, 1–3. https://doi.org/10.1145/3342775.3342803",
      "doi": "10.1145/3342775.3342803"
    },
    {
      "text": "Hanna Schneider, Malin Eiband, Daniel Ullrich, and Andreas Butz. 2018. Empowerment in HCI - A Survey and Framework. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–14. https://doi.org/10.1145/3173574.3173818",
      "doi": "10.1145/3173574.3173818"
    },
    {
      "text": "James Simpson, Franziska Gaiser, Miroslav Macík, and Timna Breßgott. 2020. Daisy: A Friendly Conversational Agent for Older Adults. In Proceedings of the 2nd Conference on Conversational User Interfaces. 1–3.",
      "doi": "10.1145/3405755.3406166"
    },
    {
      "text": "Cory-Ann Smarr, Tracy L. Mitzner, Jenay M. Beer, Akanksha Prakash, Tiffany L. Chen, Charles C. Kemp, and Wendy A. Rogers. 2014. Domestic Robots for Older Adults: Attitudes, Preferences, and Potential. International Journal of Social Robotics 6, 2 (April 2014), 229–247. https://doi.org/10.1007/s12369-013-0220-0",
      "doi": ""
    },
    {
      "text": "Tamara Zubatiy and Elizabeth Mynatt. 2020. Empowering Older Adults With Mild Cognitive Impairment And Their Caregivers Using Conversational Agents. http://casforhealth.org/wp-content/uploads/2020/04/Empowering-Older-Adults-With-Mild-Cognitive-Impairment-And-Their-Caregivers-Using-Conversational-Agents.pdf",
      "doi": ""
    }
  ]
}