{
  "doi": "10.1145/3411764.3445270",
  "title": "IdeaBot: Investigating Social Facilitation in Human-Machine Team Creativity",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "The present study investigates how human subjects collaborate with a computer-mediated chatbot in creative idea generation tasks. In three text-based between-group studies, we tested whether the perceived identity (i.e., whether a partner was believed to be a bot or as a human) or conversational style (human or robotic) of a teammate would moderate the outcomes of participants’ creative production. In Study 1, participants worked with either a chatbot or a human confederate. In Study 2, all participants worked with a human teammate but were informed that their partner was either a human or a chatbot. Conversely, all participants worked with a chatbot in Study 3, but their partner was described as either a chatbot or a human. We investigated differences in idea generation outcomes and found that participants consistently contributed more ideas and ideas of higher quality when they perceived their teamworking partner to be a bot. Furthermore, when the conversational style of the partner was robotic, participants with high anxiety in group communication reported greater creative self-efficacy in task performance. Finally, whether the perceived dominance of a partner and the pressure to come up with ideas during the task mediated positive outcomes of idea generation depended on whether the conversational style of the bot partner was robot- or human-like. Based on our findings, we discussed implications for future design of artificial agents as active team players in collaboration tasks.",
  "authors": [
    {
      "name": "Angel Hsing-Chi Hwang",
      "institution": "Virtual Embodiment Lab Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702574",
      "orcid": "missing"
    },
    {
      "name": "Andrea Stevenson Won",
      "institution": "Virtual Embodiment Lab Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658763470",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Floyd H Allport. 1920. The influence of the group upon association and thought.Journal of experimental psychology 3, 3 (1920), 159.",
      "doi": ""
    },
    {
      "text": "Robert S Baron, Danny Moore, and Glenn S Sanders. 1978. Distraction as a source of drive in social facilitation research.Journal of personality and social psychology 36, 8(1978), 816.",
      "doi": ""
    },
    {
      "text": "Myriam N Bechtoldt, Carsten KW De Dreu, Bernard A Nijstad, and Hoon-Seok Choi. 2010. Motivated information processing, social tuning, and group creativity.Journal of personality and social psychology 99, 4(2010), 622.",
      "doi": ""
    },
    {
      "text": "Cindy L Bethel, Merijn Bruijnes, Malte Jung, Christoforos Mavrogiannis, Simon Parsons, Catherine Pelachaud, Rui Prada, Laurel Riek, Sarah Strohkorb Sebo, Julie Shah, 2020. 4.4 Working Group on Social Cognition for Robots and Virtual Agents. Dagstuhl Reports, Vol. 9, Issue 10 ISSN 2192-5283 (2020), 21.",
      "doi": ""
    },
    {
      "text": "Jim Blascovich, Wendy Berry Mendes, Sarah B Hunter, and Kristen Salomon. 1999. Social” facilitation” as challenge and threat.Journal of personality and social psychology 77, 1(1999), 68.",
      "doi": ""
    },
    {
      "text": "Charles F Bond. 1982. Social facilitation: A self-presentational view.Journal of Personality and Social Psychology 42, 6(1982), 1042.",
      "doi": ""
    },
    {
      "text": "Robert M Bray and Roger Sugarman. 1980. Social facilitation among interacting groups: Evidence for the evaluation-apprehension hypothesis. Personality and Social Psychology Bulletin 6, 1 (1980), 137–142.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal. 2003. Emotion and sociable humanoid robots. International journal of human-computer studies 59, 1-2 (2003), 119–155.",
      "doi": "10.1016/S1071-5819%2803%2900018-1"
    },
    {
      "text": "Cynthia L Breazeal. 2004. Designing sociable robots. MIT press.",
      "doi": "10.5555/515422"
    },
    {
      "text": "Charles S Carver and Michael F Scheier. 1981. The self-attention-induced feedback loop and social facilitation. Journal of Experimental Social Psychology 17, 6 (1981), 545–568.",
      "doi": ""
    },
    {
      "text": "Arturo Cruz-Maya, François Ferland, and Adriana Tapus. 2015. Social facilitation in a game-like human-robot interaction using synthesized emotions and episodic memory. In International Conference on Social Robotics. Springer, 164–173.",
      "doi": ""
    },
    {
      "text": "A Dennis and M Williams. 2003. Electronic brainstorming. Group creativity: Innovation through collaboration (2003), 160–178.",
      "doi": ""
    },
    {
      "text": "Elizabeth Duffy. 1962. Activation and behavior.(1962).",
      "doi": ""
    },
    {
      "text": "Friederike Eyssel, Dieta Kuchenbrandt, and Simon Bobinger. 2011. Effects of anticipated human-robot interaction and predictability of robot behavior on perceptions of anthropomorphism. In Proceedings of the 6th international conference on Human-robot interaction. 61–68.",
      "doi": "10.1145/1957656.1957673"
    },
    {
      "text": "Julia Fink. 2012. Anthropomorphism and human likeness in the design of robots and human-robot interaction. In International Conference on Social Robotics. Springer, 199–208.",
      "doi": "10.1007/978-3-642-34103-8_20"
    },
    {
      "text": "Russell G Geen. 1983. Evaluation apprehension and the social facilitation/inhibition of learning. Motivation and Emotion 7, 2 (1983), 203–212.",
      "doi": ""
    },
    {
      "text": "Barney G Glaser and Anselm L Strauss. 2017. Discovery of grounded theory: Strategies for qualitative research. Routledge.",
      "doi": ""
    },
    {
      "text": "Gabriela Goldschmidt. 2014. Linkography: unfolding the design process. Mit Press.",
      "doi": ""
    },
    {
      "text": "Jack A Goncalo and Barry M Staw. 2006. Individualism–collectivism and group creativity. Organizational behavior and human decision processes 100, 1(2006), 96–109.",
      "doi": ""
    },
    {
      "text": "William B Gudykunst. 1993. Toward a theory of effective interpersonal and intergroup communication: an anxiety/uncertainty management (AUM) perspective.(1993).",
      "doi": ""
    },
    {
      "text": "Sarah Harvey. 2014. Creative synthesis: Exploring the process of extraordinary group creativity. Academy of management review 39, 3 (2014), 324–343.",
      "doi": ""
    },
    {
      "text": "Beth A Hennessey. 2003. Is the social psychology of creativity really social. Group creativity (2003), 181–201.",
      "doi": ""
    },
    {
      "text": "Nicholas Hertz and Eva Wiese. 2017. Social facilitation with non-human agents: possible or not?. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 61. SAGE Publications Sage CA: Los Angeles, CA, 222–225.",
      "doi": ""
    },
    {
      "text": "Jess Hohenstein and Malte Jung. 2018. AI-supported messaging: An investigation of human-human text conversation with AI support. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3170427.3188487"
    },
    {
      "text": "Jess Hohenstein and Malte Jung. 2020. AI as a moral crumple zone: The effects of AI-mediated communication on attribution and trust. Computers in Human Behavior 106 (2020), 106190.",
      "doi": "10.1016/j.chb.2019.106190"
    },
    {
      "text": "Crystal L Hoyt, Jim Blascovich, and Kimberly R Swinth. 2003. Social inhibition in immersive virtual environments. Presence: Teleoperators & Virtual Environments 12, 2(2003), 183–195.",
      "doi": "10.1162/105474603321640932"
    },
    {
      "text": "Maurice Jakesch, Megan French, Xiao Ma, Jeffrey T Hancock, and Mor Naaman. 2019. AI-mediated communication: How the perception that profile text was written by AI affects trustworthiness. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300469"
    },
    {
      "text": "Malte F Jung, Nikolas Martelaro, and Pamela J Hinds. 2015. Using robots to moderate team conflict: the case of repairing violations. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. 229–236.",
      "doi": "10.1145/2696454.2696460"
    },
    {
      "text": "Jeff WT Kan and John S Gero. 2008. Acquiring information from linkography in protocol studies of designing. Design studies 29, 4 (2008), 315–337.",
      "doi": ""
    },
    {
      "text": "James C Kaufman and Robert J Sternberg. 2010. The Cambridge handbook of creativity. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Sara Kiesler, Aaron Powers, Susan R Fussell, and Cristen Torrey. 2008. Anthropomorphic interactions with a robot and robot–like agent. Social Cognition 26, 2 (2008), 169–181.",
      "doi": ""
    },
    {
      "text": "Christos Kyrlitsias and Despina Michael. 2016. Influence by others’ opinions: social pressure from agents in immersive virtual environments. In 2016 IEEE Virtual Reality (VR). IEEE, 213–214.",
      "doi": ""
    },
    {
      "text": "Elizabeth Wolef Morrison and Frances J Milliken. 2000. Organizational silence: A barrier to change and development in a pluralistic world. Academy of Management review 25, 4 (2000), 706–725.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. 72–78.",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "C Nemeth and Brendan Nemeth-Brown. 2003. Better than individuals. Group creativity: Innovation through collaboration 4 (2003), 63–84.",
      "doi": ""
    },
    {
      "text": "Sung Park and Richard Catrambone. 2007. Social facilitation effects of virtual humans. Human factors 49, 6 (2007), 1054–1060.",
      "doi": ""
    },
    {
      "text": "Paul B. Paulus and Vincent R. Brown. 2003. Enhancing ideational creativity in groups: Lessons from research on brainstorming.Oxford University Press, Paulus, Paul B., Department of Psychology, University of Texas at Arlington, Box 19528, Arlington, TX, US, 76019, 110 – 136. http://encompass.library.cornell.edu.proxy.library.cornell.edu/cgi-bin/checkIP.cgi?access=gateway_standard%26url=https://search-ebscohost-com.proxy.library.cornell.edu/login.aspx?direct=true&db=psyh&AN=2003-88061-005&site=eds-live&scope=site",
      "doi": ""
    },
    {
      "text": "Paul B Paulus and Bernard A Nijstad. 2003. Group creativity: Innovation through collaboration. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Tamyra Pierce. 2009. Social anxiety and technology: Face-to-face communication versus technological communication among teens. Computers in Human Behavior 25, 6 (2009), 1367–1372.",
      "doi": "10.1016/j.chb.2009.06.003"
    },
    {
      "text": "Aaron Powers, Sara Kiesler, Susan Fussell, and Cristen Torrey. 2007. Comparing a computer agent with a humanoid robot. In Proceedings of the ACM/IEEE international conference on Human-robot interaction. 145–152.",
      "doi": "10.1145/1228716.1228736"
    },
    {
      "text": "Raoul Rickenberg and Byron Reeves. 2000. The effects of animated characters on anxiety, task performance, and evaluations of user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 49–56.",
      "doi": "10.1145/332040.332406"
    },
    {
      "text": "Nina Riether, Frank Hegel, Britta Wrede, and Gernot Horstmann. 2012. Social facilitation with social robots?. In 2012 7th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 41–47.",
      "doi": "10.1145/2157689.2157697"
    },
    {
      "text": "Glenn S Sanders, Robert Steven Baron, and Danny L Moore. 1978. Distraction and social comparison as mediators of social facilitation effects. Journal of Experimental Social Psychology 14, 3 (1978), 291–303.",
      "doi": ""
    },
    {
      "text": "Mohanbir Sawhney, Gianmario Verona, and Emanuela Prandelli. 2005. Collaborating to create: The Internet as a platform for customer engagement in product innovation. Journal of interactive marketing 19, 4 (2005), 4–17.",
      "doi": ""
    },
    {
      "text": "R Keith Sawyer. 2011. Explaining creativity: The science of human innovation. Oxford university press.",
      "doi": ""
    },
    {
      "text": "Ameneh Shamekhi, Q Vera Liao, Dakuo Wang, Rachel KE Bellamy, and Thomas Erickson. 2018. Face Value? Exploring the effects of embodiment for a group facilitation agent. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173965"
    },
    {
      "text": "Kenneth W Spence, IE Farber, and HH McFann. 1956. The relation of anxiety (drive) level to performance in competitional and non-competitional paired-associates learning.Journal of Experimental Psychology 52, 5 (1956), 296.",
      "doi": ""
    },
    {
      "text": "Garold Stasser and Zachary Birchmeier. 2003. Group creativity and collective choice. Group creativity: Innovation through collaboration (2003), 85–109.",
      "doi": ""
    },
    {
      "text": "Timothy D Stephen and Teresa M Harrison. 1986. Assessing communication style: A new measure. American Journal of Family Therapy 14, 3 (1986), 213–234.",
      "doi": ""
    },
    {
      "text": "Brett Stoll, Malte F Jung, and Susan R Fussell. 2018. Keeping it light: perceptions of humor styles in robot-mediated conflict. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction. 247–248.",
      "doi": "10.1145/3173386.3176996"
    },
    {
      "text": "Yilu Sun, Omar Shaikh, and Andrea Stevenson Won. 2019. Nonverbal synchrony in virtual reality. PloS one 14, 9 (2019), e0221803.",
      "doi": ""
    },
    {
      "text": "Barbara G Tabachnick, Linda S Fidell, and Jodie B Ullman. 2007. Using multivariate statistics. Vol. 5. Pearson Boston, MA.",
      "doi": ""
    },
    {
      "text": "Susan L Thomas, Linda J Skitka, Stacy Christen, and Mark Jurgena. 2002. Social facilitation and impression formation. Basic and applied social psychology 24, 1 (2002), 67–70.",
      "doi": ""
    },
    {
      "text": "Pamela Tierney and Steven M Farmer. 2002. Creative self-efficacy: Its potential antecedents and relationship to creative performance. Academy of Management journal 45, 6 (2002), 1137–1148.",
      "doi": ""
    },
    {
      "text": "Olivier Toubia. 2006. Idea generation, creativity, and incentives. Marketing Science 25, 5 (2006), 411–425.",
      "doi": "10.5555/2882690.2882693"
    },
    {
      "text": "Margaret L Traeger, Sarah Strohkorb Sebo, Malte Jung, Brian Scassellati, and Nicholas A Christakis. 2020. Vulnerable robots positively shape human conversational dynamics in a human–robot team. Proceedings of the National Academy of Sciences 117, 12(2020), 6370–6375.",
      "doi": ""
    },
    {
      "text": "Lee Edward Travis. 1925. The effect of a small audience upon eye-hand coordination.The Journal of Abnormal and Social Psychology 20, 2(1925), 142.",
      "doi": ""
    },
    {
      "text": "Norman Triplett. 1898. The dynamogenic factors in pacemaking and competition. The American journal of psychology 9, 4 (1898), 507–533.",
      "doi": ""
    },
    {
      "text": "Sarah Woods, Kerstin Dautenhahn, and Christina Kaouri. 2005. Is someone watching me?-consideration of social facilitation effects in human-robot interaction experiments. In 2005 international Symposium on Computational intelligence in Robotics and Automation. IEEE, 53–60.",
      "doi": ""
    },
    {
      "text": "Robert B Zajonc. 1965. Social facilitation. Science 149, 3681 (1965), 269–274.",
      "doi": ""
    },
    {
      "text": "Catherine Amine Zanbaka, Amy Catherine Ulinski, Paula Goolkasian, and Larry F Hodges. 2007. Social responses to virtual humans: implications for future interface design. In Proceedings of the SIGCHI conference on Human factors in computing systems. 1561–1570.",
      "doi": "10.1145/1240624.1240861"
    },
    {
      "text": "Jakub Złotowski, Diane Proudfoot, Kumar Yogeeswaran, and Christoph Bartneck. 2015. Anthropomorphism: opportunities and challenges in human–robot interaction. International journal of social robotics 7, 3 (2015), 347–360.",
      "doi": ""
    }
  ]
}