{
  "doi": "10.1145/3411764.3445498",
  "title": "“It’s Complicated”: Negotiating Accessibility and (Mis)Representation in Image Descriptions of Race, Gender, and Disability",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Content creators are instructed to write textual descriptions of visual content to make it accessible; yet existing guidelines lack specifics on how to write about people’s appearance, particularly while remaining mindful of consequences of (mis)representation. In this paper, we report on interviews with screen reader users who were also Black, Indigenous, People of Color, Non-binary, and/or Transgender on their current image description practices and preferences, and experiences negotiating theirs and others’ appearances non-visually. We discuss these perspectives, and the ethics of humans and AI describing appearance characteristics that may convey the race, gender, and disabilities of those photographed. In turn, we share considerations for more carefully describing appearance, and contexts in which such information is perceived salient. Finally, we offer tensions and questions for accessibility research to equitably consider politics and ecosystems in which technologies will embed, such as potential risks of human and AI biases amplifying through image descriptions.",
  "tags": [
    "Accessibility",
    "Visual impairments",
    "Disability",
    "Race",
    "AI",
    "Image descriptions",
    "Blind",
    "Gender"
  ],
  "authors": [
    {
      "name": "Cynthia L. Bennett",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83358692957",
      "orcid": "0000-0003-1036-2497"
    },
    {
      "name": "Cole Gleason",
      "institution": "Human Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99659021609/rel-imgonly/colegleasonsquare.jpg",
      "acmid": "99659021609",
      "orcid": "missing"
    },
    {
      "name": "Morgan Klaus Scheuerman",
      "institution": "Information Science University of Colorado Boulder, United States",
      "img": "/do/10.1145/contrib-99659161210/rel-imgonly/75271432_2565167006862578_7036931708335161344_o.jpg",
      "acmid": "99659161210",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey P. Bigham",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    },
    {
      "name": "Anhong Guo",
      "institution": "Computer Science and Engineering University of Michigan, United States",
      "img": "/do/10.1145/contrib-99658635901/rel-imgonly/anhong_website.jpg",
      "acmid": "99658635901",
      "orcid": "0000-0002-4447-7818"
    },
    {
      "name": "Alexandra To",
      "institution": "Art + Design and Khoury College of Computer Science Northeastern University, United States",
      "img": "/do/10.1145/contrib-99658642648/rel-imgonly/ato_2021_squarec.jpg",
      "acmid": "99658642648",
      "orcid": "0000-0001-7298-7607"
    }
  ],
  "references": [
    {
      "text": "Algorithmic Justice League. 2020. Unmasking AI harms and biases. https://www.ajl.org/",
      "doi": ""
    },
    {
      "text": "Bobby Allyn. 2020. ‘The Computer Got It Wrong’: How Facial Recognition Led to False Arrest Of Black Man. https://www.npr.org/2020/06/24/882683463/the-computer-got-it-wrong-how-facial-recognition-led-to-a-false-arrest-in-michig",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Subini Ancy Annamma, Darrell D Jackson, and Deb Morrison. 2017. Conceptualizing color-evasiveness: using dis/ability critical race theory to expand a color-blind racial ideology in education and society. Race Ethnicity and Education 20, 2 (2017), 147–162. https://doi.org/10.1080/13613324.2016.1248837",
      "doi": ""
    },
    {
      "text": "Apple Inc. 2020. How To Make Your Own Memoji. https://apps.apple.com/us/story/id1445637997",
      "doi": ""
    },
    {
      "text": "Mariam Asad. 2019. Prefigurative Design as a Method for Research Justice. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 200 (Nov. 2019), 18 pages. https://doi.org/10.1145/3359302",
      "doi": "10.1145/3359302"
    },
    {
      "text": "Stijn Baert. 2018. Facebook profile picture appearance affects recruiters’ first hiring decisions. New Media & Society 20, 3 (2018), 1220–1239. https://doi.org/10.1177/1461444816687294",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. Association for Computing Machinery, New York, NY, USA, 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Roy F Baumeister. 1982. A self-presentational view of social phenomena.Psychological Bulletin 91, 1 (1982), 3–26. https://doi.org/10.1037/0033-2909.91.1.3",
      "doi": ""
    },
    {
      "text": "Ruha Benjamin. 2019. Race After Technology: Abolitionist Tools for the New Jim Code. Social Forces 98, 4 (12 2019), 1–3. https://doi.org/10.1093/sf/soz162 arXiv:https://academic.oup.com/sf/article-pdf/98/4/1/33382045/soz162.pdf",
      "doi": ""
    },
    {
      "text": "Cynthia Bennett and Os Keyes. 2020. What is the Point of Fairness?Interactions 27, 3 (April 2020), 35–39. https://doi.org/10.1145/3386383",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Jane E, Martez E. Mott, Edward Cutrell, and Meredith Ringel Morris. 2018. How Teens with Visual Impairments Take, Edit, and Share Photos on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173650",
      "doi": "10.1145/3173574.3173650"
    },
    {
      "text": "Berkeley Lab. 2020. Zoom Tip For Gender Pronouns (April 2020). https://diversity.lbl.gov/2020/04/14/zoom-tip-for-gender-pronouns/",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Ryan S. Kaminsky, Richard E. Ladner, Oscar M. Danielsson, and Gordon L. Hempton. 2006. WebInSight: Making Web Images Accessible. In Proceedings of the 8th International ACM SIGACCESS Conference on Computers and Accessibility (Portland, Oregon, USA) (Assets ’06). Association for Computing Machinery, New York, NY, USA, 181–188. https://doi.org/10.1145/1168987.1169018",
      "doi": "10.1145/1168987.1169018"
    },
    {
      "text": "Stacy M. Branham, Ali Abdolrahmani, William Easley, Morgan Scheuerman, Erick Ronquillo, and Amy Hurst. 2017. “Is Someone There? Do They Have a Gun”: How Visual Information about Others Can Improve Personal Safety Management for Blind Individuals. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(Baltimore, Maryland, USA) (ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 260–269. https://doi.org/10.1145/3132525.3132534",
      "doi": "10.1145/3132525.3132534"
    },
    {
      "text": "André Brock. 2012. From the Blackhand Side: Twitter as a Cultural Conversation. Journal of Broadcasting & Electronic Media 56, 4 (2012), 529–549. https://doi.org/10.1080/08838151.2012.732147",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification. In Proceedings of the 1st Conference on Fairness, Accountability and Transparency(Proceedings of Machine Learning Research, Vol. 81), Sorelle A. Friedler and Christo Wilson (Eds.). PMLR, New York, NY, USA, 77–91. http://proceedings.mlr.press/v81/buolamwini18a.html",
      "doi": ""
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer Visibility: Supporting LGBT+ Selective Visibility on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173824",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "Jiang Chang, Hailong Ren, and Qiguang Yang. 2018. A virtual gender asylum? The social media profile picture, young Chinese women’s self-empowerment, and the emergence of a Chinese digital feminism. International Journal of Cultural Studies 21, 3 (2018), 325–340. https://doi.org/10.1177/1367877916682085",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory.",
      "doi": ""
    },
    {
      "text": "Alex Chen. 2020. How to write an image description (July 2020). https://uxdesign.cc/how-to-write-an-image-description-2f30d3bf5546",
      "doi": ""
    },
    {
      "text": "Coalition for Critical Technology. 2020. Abolish the #TechToPrisonPipeline (June 2020). https://medium.com/@CoalitionForCriticalTechnology/abolish-the-techtoprisonpipeline-9b5b14366b16",
      "doi": ""
    },
    {
      "text": "Rachel Cohen-Rottenberg. 2015. We Need Your Help: Specifying Race and Gender in Image Descriptions (July 2015). https://thebodyisnotanapology.com/magazine/we-need-your-help-specifying-race-and-gender-in-image-descriptions/",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design Justice: Community-Led Practices to Build the Worlds We Need. https://doi.org/10.7551/mitpress/12255.001.0001",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 1989. Demarginalizing the Intersection of Race and Sex: A Black Feminist Critique of Antidiscrimination Doctrine, Feminist Theory and Antiracist Policies. University of Chicago Legal Forum 1989, 1 (1989), 139–167. http://chicagounbound.uchicago.edu/uclf/vol1989/iss1/8/",
      "doi": ""
    },
    {
      "text": "Crip Camp Impact Campaign. 2020. Crip Camp: The Official Virtual Experience. https://cripcamp.com/officialvirtualexperience/",
      "doi": ""
    },
    {
      "text": "Data for Black Lives. 2020. Data for Black Lives. https://d4bl.org",
      "doi": ""
    },
    {
      "text": "Bryan Dosono and Bryan Semaan. 2018. Identity Work as Deliberation: AAPI Political Discourse in the 2016 US Presidential Election. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174207",
      "doi": "10.1145/3173574.3174207"
    },
    {
      "text": "Emory James Edwards, Cella Monet Sum, and Stacy M. Branham. 2020. Three Tensions Between Personas and Complex Disability Identities. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3382931",
      "doi": "10.1145/3334480.3382931"
    },
    {
      "text": "Nirmala Erevelles and Andrea Minear. 2010. Unspeakable Offenses: Untangling Race and Disability in Discourses of Intersectionality. Journal of Literary & Cultural Disability Studies (2010). https://doi.org/10.3828/jlcds.2010.11",
      "doi": ""
    },
    {
      "text": "Heather A. Faucett, Kate E. Ringland, Amanda L. L. Cullen, and Gillian R. Hayes. 2017. (In)Visibility in Disability and Assistive Technology. ACM Trans. Access. Comput. 10, 4, Article 14 (Oct. 2017), 17 pages. https://doi.org/10.1145/3132040",
      "doi": "10.1145/3132040"
    },
    {
      "text": "Glenn Fleishman. 2000. Cartoon Captures Spirit of the Internet. https://www.nytimes.com/2000/12/14/technology/cartoon-captures-spirit-of-the-internet.html",
      "doi": ""
    },
    {
      "text": "Asia Friedman. 2016. “There are Two People at Work That I’m Fairly Certain are Black”: Uncertainty and Deliberative Thinking in Blind Race Attribution. The Sociological Quarterly 57, 3 (2016), 437–461. https://doi.org/10.1111/tsq.12140",
      "doi": ""
    },
    {
      "text": "Future of Privacy Forum. 2018. Privacy Principles for Facial Recognition Technology in Commercial Applications. https://fpf.org/wp-content/uploads/2019/03/Final-Privacy-Principles-Edits-1.pdf",
      "doi": ""
    },
    {
      "text": "Timnit Gebru, Jamie Morgenstern, Briana Vecchione, Jennifer Wortman Vaughan, Hanna Wallach, Hal Daumé III au2, and Kate Crawford. 2020. Datasheets for Datasets. arxiv:1803.09010 [cs.DB]",
      "doi": ""
    },
    {
      "text": "Gender Spectrum. 2019. The Language of Gender. https://genderspectrum.org/articles/language-of-gender",
      "doi": ""
    },
    {
      "text": "Shona Ghosh. 2019. Google AI will no longer use gender labels like ‘woman’ or ‘man’ on images of people to avoid bias. https://www.businessinsider.com/google-cloud-vision-api-wont-tag-images-by-gender-2020-2",
      "doi": ""
    },
    {
      "text": "W. Gies, J. Overby, N. Saraceno, J. Frome, E. York, and A. Salman. 2020. Restricting Data Sharing and Collection of Facial Recognition Data by the Consent of the User: A Systems Analysis. In 2020 Systems and Information Engineering Design Symposium (SIEDS). 1–6. https://doi.org/10.1109/SIEDS49339.2020.9106661",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Patrick Carrington, Cameron Cassidy, Meredith Ringel Morris, Kris M. Kitani, and Jeffrey P. Bigham. 2019. “It’s Almost like They’re Trying to Hide It”: How User-Provided Image Descriptions Have Failed to Make Twitter Accessible. In The World Wide Web Conference (San Francisco, CA, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 549–559. https://doi.org/10.1145/3308558.3313605",
      "doi": "10.1145/3308558.3313605"
    },
    {
      "text": "Cole Gleason, Amy Pavel, Emma McCamey, Christina Low, Patrick Carrington, Kris M. Kitani, and Jeffrey P. Bigham. 2020. Twitter A11y: A Browser Extension to Make Twitter Images Accessible. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376728",
      "doi": ""
    },
    {
      "text": "Neil Gotanda. 1991. A Critique of “Our Constitution Is Color-Blind”. Stanford Law Review 44, 1 (1991), 1–68. http://www.jstor.org/stable/1228940",
      "doi": ""
    },
    {
      "text": "Martin Grayson, Anja Thieme, Rita Marques, Daniela Massiceti, Ed Cutrell, and Cecily Morrison. 2020. A Dynamic AI System for Extending the Capabilities of Blind People. In CHI 2020 Extended Abstracts. ACM. https://www.microsoft.com/en-us/research/publication/a-dynamic-ai-system-for-extending-the-capabilities-of-blind-people/",
      "doi": "10.1145/3334480.3383142"
    },
    {
      "text": "Darren Guinness, Edward Cutrell, and Meredith Ringel Morris. 2018. Caption Crawler: Enabling Reusable Alternative Text Descriptions Using Reverse Image Search. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174092",
      "doi": "10.1145/3173574.3174092"
    },
    {
      "text": "Anhong Guo, Ece Kamar, Jennifer Wortman Vaughan, Hanna Wallach, and Meredith Ringel Morris. 2020. Toward Fairness in AI for People with Disabilities: A Research Roadmap. SIGACCESS Access. Comput.125, Article 2 (March 2020), 1 pages. https://doi.org/10.1145/3386296.3386298",
      "doi": "10.1145/3386296.3386298"
    },
    {
      "text": "Jessica Guynn. 2020. You can now have your very own digital avatar on Facebook and Messenger. https://www.usatoday.com/story/tech/2020/05/13/facebook-messenger-avatars-bitmoji-snapchat-emoji/3118525001/",
      "doi": ""
    },
    {
      "text": "Anthony Ha. 2020. Microsoft’s Brad Smith says company will not sell facial recognition tech to police. https://techcrunch.com/2020/06/11/microsofts-brad-smith-says-company-will-not-sell-facial-recognition-tech-to-police/",
      "doi": ""
    },
    {
      "text": "Stephanie Hackett, Bambang Parmanto, and Xiaoming Zeng. 2003. Accessibility of Internet Websites through Time. In Proceedings of the 6th International ACM SIGACCESS Conference on Computers and Accessibility (Atlanta, GA, USA) (Assets ’04). Association for Computing Machinery, New York, NY, USA, 32–39. https://doi.org/10.1145/1028630.1028638",
      "doi": ""
    },
    {
      "text": "Stephanie Hackett, Bambang Parmanto, and Xiaoming Zeng. 2005. A retrospective look at website accessibility over time. Behaviour & Information Technology 24, 6 (2005), 407–417. https://doi.org/10.1080/01449290500066661",
      "doi": ""
    },
    {
      "text": "Ever Lee Hairston, Denice Brown, Ron Brown, Bobbi Pompei, and Tarik Williams. 2020. Not Blind to Color in the Federation: A Panel on the Experience of Black and Blind in America. https://www.nfb.org/images/nfb/publications/bm/bm20/bm2008/bm200813.htm",
      "doi": ""
    },
    {
      "text": "Foad Hamidi, Morgan Klaus Scheuerman, and Stacy M. Branham. 2018. Gender Recognition or Gender Reductionism? The Social Implications of Embedded Gender Recognition Systems. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173582",
      "doi": "10.1145/3173574.3173582"
    },
    {
      "text": "Alex Hanna, Emily Denton, Andrew Smart, and Jamila Smith-Loud. 2020. Towards a Critical Race Methodology in Algorithmic Fairness. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency (Barcelona, Spain) (FAT* ’20). Association for Computing Machinery, New York, NY, USA, 501–512. https://doi.org/10.1145/3351095.3372826",
      "doi": "10.1145/3351095.3372826"
    },
    {
      "text": "Taylor Hatmaker. 2020. Portland passes expansive city ban on facial recognition tech. https://techcrunch.com/2020/09/09/facial-recognition-ban-portland-oregon/",
      "doi": ""
    },
    {
      "text": "Anna Lauren Hoffmann. [n.d.]. Terms of inclusion: Data, discourse, violence. New Media & Society 0, 0 ([n. d.]), 1461444820958725. https://doi.org/10.1177/1461444820958725",
      "doi": ""
    },
    {
      "text": "Anna Lauren Hoffmann. 2019. Where fairness fails: data, algorithms, and the limits of antidiscrimination discourse. Information, Communication & Society 22, 7 (2019), 900–915. https://doi.org/10.1080/1369118X.2019.1573912",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia L Bennett. 2020. Living Disability Theory: Reflections on Access, Research, and Design. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 4, 13 pages. https://doi.org/10.1145/3373625.3416996",
      "doi": "10.1145/3373625.3416996"
    },
    {
      "text": "Noelle J Hum, Perrin E Chamberlin, Brittany L Hambright, Anne C Portwood, Amanda C Schat, and Jennifer L Bevan. 2011. A picture is worth a thousand words: A content analysis of Facebook profile photographs. Computers in Human Behavior 27, 5 (2011), 1828–1833. https://doi.org/10.1016/j.chb.2011.04.003",
      "doi": ""
    },
    {
      "text": "Margaret Hunter. 2007. The Persistent Problem of Colorism: Skin Tone, Status, and Inequality. Sociology Compass 1, 1 (2007), 237–254. https://doi.org/10.1111/j.1751-9020.2007.00006.x",
      "doi": ""
    },
    {
      "text": "IBM. 2020. IBM CEO’s Letter to Congress on Racial Justice Reform. https://www.ibm.com/blogs/policy/facial-recognition-sunset-racial-justice-reforms/",
      "doi": ""
    },
    {
      "text": "IBM Research. 2020. 2018 Workshop on AI Fairness for People with Disabilities. https://researcher.watson.ibm.com/researcher/view_group.php?id=9642",
      "doi": ""
    },
    {
      "text": "James M Jones. 1997. Prejudice and racism. McGraw-Hill Companies, New York.",
      "doi": ""
    },
    {
      "text": "Alison Kafer. 2013. Feminist, Queer, Crip. Indiana University Press. http://www.jstor.org/stable/j.ctt16gz79x",
      "doi": ""
    },
    {
      "text": "Sanja Kapidzic and Susan C Herring. 2015. Race, gender, and self-presentation in teen profile photographs. New Media & Society 17, 6 (2015), 958–976. https://doi.org/10.1177/1461444813520301",
      "doi": ""
    },
    {
      "text": "Ellyn Kaschak. 2015. Sight Unseen. Columbia University Press. https://doi.org/10.7312/kasc17290",
      "doi": ""
    },
    {
      "text": "Os Keyes. 2018. The Misgendering Machines: Trans/HCI Implications of Automatic Gender Recognition. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 88 (Nov. 2018), 22 pages. https://doi.org/10.1145/3274357",
      "doi": "10.1145/3274357"
    },
    {
      "text": "Sooyeon Lee, Madison Reddie, Chun-Hua Tsai, Jordan Beck, Mary Beth Rosson, and John M. Carroll. 2020. The Emerging Professional Practice of Remote Sighted Assistance for People with Visual Impairments. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376591",
      "doi": ""
    },
    {
      "text": "Talila A. Lewis. 2020. Ableism 2020: An Updated Definition. https://www.talilalewis.com/blog/ableism-2020-an-updated-definition",
      "doi": ""
    },
    {
      "text": "Veronica Lewis. 2020. How to write alt text and image descriptions for photojournalism images. https://veroniiiica.com/2020/05/31/how-to-write-alt-text-and-image-descriptions-for-photojournalism-images/",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Cynthia L. Bennett, Meredith Ringel Morris, and Edward Cutrell. 2017. Understanding Blind People’s Experiences with Computer-Generated Captions of Social Media Images. Association for Computing Machinery, New York, NY, USA, 5988–5999. https://doi.org/10.1145/3025453.3025814",
      "doi": ""
    },
    {
      "text": "Christine Malec and JJ Hunt. 2020. Talk Description to Me. https://talkdescriptiontome.buzzsprout.com/",
      "doi": ""
    },
    {
      "text": "Microsoft Research. 2017. Seeing AI app – Scene Channel. https://youtu.be/4krZgdX_WT8",
      "doi": ""
    },
    {
      "text": "Ryan A Miller. 2017. “My voice is definitely strongest in online communities”: Students using social media for queer and disability identity-making., 509–525 pages. https://doi.org/10.1353/csd.2017.0040",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris. 2020. AI and Accessibility. Commun. ACM 63, 6 (May 2020), 35–37. https://doi.org/10.1145/3356727",
      "doi": "10.1145/3356727"
    },
    {
      "text": "Meredith Ringel Morris, Jazette Johnson, Cynthia L. Bennett, and Edward Cutrell. 2018. Rich Representations of Visual Content for Screen Reader Users. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3173633",
      "doi": "10.1145/3173574.3173633"
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. “With Most of It Being Pictures Now, I Rarely Use It”: Understanding Twitter’s Evolving Accessibility to Blind Users. Association for Computing Machinery, New York, NY, USA, 5506–5516. https://doi.org/10.1145/2858036.2858116",
      "doi": ""
    },
    {
      "text": "Paul Mozur. 2019. One Month, 500,000 Face Scans: How China Is Using A.I. to Profile a Minority. https://www.nytimes.com/2019/04/14/technology/china-surveillance-artificial-intelligence-racial-profiling.html",
      "doi": ""
    },
    {
      "text": "Katie Murphy. 2018. An Audio Describer Responds to “On Black Panther Audio Description — Race, Selection & Time”. https://disarts.org/an-audio-describer-responds-to-on-black-panther-audio-description-race-selection-time/",
      "doi": ""
    },
    {
      "text": "Karen Nakamura. 2019. My Algorithms Have Determined You’re Not Human: AI-ML, Reverse Turing-Tests, and the Disability Experience. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, PA, USA) (ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 1–2. https://doi.org/10.1145/3308561.3353812",
      "doi": "10.1145/3308561.3353812"
    },
    {
      "text": "National Center on Disability and Journalism. 2020. Disability Language Style Guide. https://ncdj.org/style-guide/",
      "doi": ""
    },
    {
      "text": "Netflix. 2020. Black Lives Matter recommendations. https://www.netflix.com/browse/genre/81299227",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of oppression: How search engines reinforce racism., xv, 229–xv, 229 pages.",
      "doi": ""
    },
    {
      "text": "Osagie Obasogie. 2010. Do Blind People See Race? Social, Legal, and Theoretical Considerations. Law & society review 44 (09 2010), 585–616. https://doi.org/10.1111/j.1540-5893.2010.00417.x",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Katrina M Overby. 2019. Doin’It for the Culture: Defining Blackness, Culture, and Identity on Black Twitter. (2019).",
      "doi": ""
    },
    {
      "text": "Helen Petrie, Chandra Harrison, and Sundeep Dev. 2005. Describing images on the web: a survey of current practice and prospects for the future. Proceedings of Human Computer Interaction International (HCII) 71 (2005), 2.",
      "doi": ""
    },
    {
      "text": "John R. Porter, Kiley Sobel, Sarah E. Fox, Cynthia L. Bennett, and Julie A. Kientz. 2017. Filtered Out: Disability Disclosure Practices in Online Dating Communities. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 87 (Dec. 2017), 13 pages. https://doi.org/10.1145/3134722",
      "doi": "10.1145/3134722"
    },
    {
      "text": "Halley Profita, Reem Albaghli, Leah Findlater, Paul Jaeger, and Shaun K. Kane. 2016. The AT Effect: How Disability Affects the Perceived Social Acceptability of Head-Mounted Display Use. Association for Computing Machinery, New York, NY, USA, 4884–4895. https://doi.org/10.1145/2858036.2858130",
      "doi": "10.1145/2858036.2858130"
    },
    {
      "text": "Protest Access. 2020. ProtestAccess - Twitter. https://twitter.com/protestaccess",
      "doi": ""
    },
    {
      "text": "Yolanda A. Rankin and Jakita O. Thomas. 2019. Straighten up and Fly Right: Rethinking Intersectionality in HCI Research. Interactions 26, 6 (Oct. 2019), 64–68. https://doi.org/10.1145/3363033",
      "doi": "10.1145/3363033"
    },
    {
      "text": "Thomas Reid. 2018. Reid My Mind Radio: On Black Panther Audio Description – Race, Selection & Time. http://reidmymind.com/reid-my-mind-radio-on-black-panther-audio-description-race-selection-time/",
      "doi": ""
    },
    {
      "text": "Sander De Ridder and Sofie Van Bauwel. 2013. Commenting on pictures: Teens negotiating gender and sexualities on social networking sites. Sexualities 16, 5-6 (2013), 565–586. https://doi.org/10.1177/1363460713487369",
      "doi": ""
    },
    {
      "text": "Kathryn E. Ringland, Christine T. Wolf, LouAnne E. Boyd, Mark S. Baldwin, and Gillian R. Hayes. 2016. Would You Be Mine: Appropriating Minecraft as an Assistive Technology for Youth with Autism. In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility (Reno, Nevada, USA) (ASSETS ’16). Association for Computing Machinery, New York, NY, USA, 33–41. https://doi.org/10.1145/2982142.2982172",
      "doi": "10.1145/2982142.2982172"
    },
    {
      "text": "Wendy D Roth. 2016. The multiple dimensions of race. Ethnic and Racial Studies 39, 8 (2016), 1310–1338.",
      "doi": ""
    },
    {
      "text": "Elliot Salisbury, Ece Kamar, and Meredith Morris. 2017. Toward scalable social alt text: Conversational crowdsourcing as a tool for refining vision-to-language technology for the blind. In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing, Vol. 5.",
      "doi": ""
    },
    {
      "text": "Sigal Samuel. 2019. Some AI just shouldn’t exist. https://www.vox.com/future-perfect/2019/4/19/18412674/ai-bias-facial-recognition-black-gay-transgender",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Jacob M. Paul, and Jed R. Brubaker. 2019. How Computers See Gender: An Evaluation of Gender Classification in Commercial Facial Analysis Services. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 144 (Nov. 2019), 33 pages. https://doi.org/10.1145/3359246",
      "doi": "10.1145/3359246"
    },
    {
      "text": "Morgan Klaus Scheuerman, Katta Spiel, Oliver L. Haimson, Foad Hamidi, and Stacy M. Branham. 2020. HCI Guidelines for Gender Equity and Inclusivity. https://www.morgan-klaus.com/gender-guidelines.html",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Kandrea Wade, Caitlin Lustig, and Jed R. Brubaker. 2020. How We’ve Taught Algorithms to See Identity: Constructing Race and Gender in Image Databases for Facial Analysis. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 058 (May 2020), 35 pages. https://doi.org/10.1145/3392866",
      "doi": "10.1145/3392866"
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. Association for Computing Machinery, New York, NY, USA, 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Ari Schlesinger, Kenton P. O’Hara, and Alex S. Taylor. 2018. Let’s Talk About Race: Identity, Chatbots, and AI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173889",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "Cristina Segalin, Fabio Celli, Luca Polonio, Michal Kosinski, David Stillwell, Nicu Sebe, Marco Cristani, and Bruno Lepri. 2017. What Your Facebook Profile Picture Reveals about Your Personality. In Proceedings of the 25th ACM International Conference on Multimedia (Mountain View, California, USA) (MM ’17). Association for Computing Machinery, New York, NY, USA, 460–468. https://doi.org/10.1145/3123266.3123331",
      "doi": "10.1145/3123266.3123331"
    },
    {
      "text": "Sins Invalid. 2020. An Unshamed Claim to Beauty in the Face of Invisibility.https://www.sinsinvalid.org/",
      "doi": ""
    },
    {
      "text": "Olivia Solon. 2020. Facial recognition’s ‘dirty little secret’: Millions of online photos scraped without consent. https://www.nbcnews.com/tech/internet/facial-recognition-s-dirty-little-secret-millions-online-photos-scraped-n981921",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Os Keyes, Ashley Marie Walker, Michael A. DeVito, Jeremy Birnholtz, Emeline Brulé, Ann Light, Pınar Barlas, Jean Hardy, Alex Ahmed, Jennifer A. Rode, Jed R. Brubaker, and Gopinaath Kannabiran. 2019. Queer(Ing) HCI: Moving Forward in Theory and Practice. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3290607.3311750",
      "doi": "10.1145/3290607.3311750"
    },
    {
      "text": "Abigale Stangl, Meredith Ringel Morris, and Danna Gurari. 2020. “Person, Shoes, Tree. Is the Person Naked?” What People with Vision Impairments Want in Image Descriptions. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376404",
      "doi": ""
    },
    {
      "text": "Abigale J. Stangl, Esha Kothari, Suyog D. Jain, Tom Yeh, Kristen Grauman, and Danna Gurari. 2018. BrowseWithMe: An Online Clothes Shopping Assistant for People with Visual Impairments. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (Galway, Ireland) (ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 107–118. https://doi.org/10.1145/3234695.3236337",
      "doi": "10.1145/3234695.3236337"
    },
    {
      "text": "Lee Stearns and Anja Thieme. 2018. Automated Person Detection in Dynamic Scenes to Assist People with Vision Impairments: An Initial Investigation. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (Galway, Ireland) (ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 391–394. https://doi.org/10.1145/3234695.3241017",
      "doi": "10.1145/3234695.3241017"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of qualitative research techniques. Sage publications Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Derald Wing Sue. 2010. Microaggressions in everyday life: Race, gender, and sexual orientation. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "The Amazon blog. 2020. We are implementing a one-year moratorium on police use of Rekognition. https://blog.aboutamazon.com/policy/we-are-implementing-a-one-year-moratorium-on-police-use-of-rekognition",
      "doi": ""
    },
    {
      "text": "Matt Thompson. 2013. Five Reasons Why People Code-Switch. https://www.npr.org/sections/codeswitch/2013/04/13/177126294/five-reasons-why-people-code-switch",
      "doi": ""
    },
    {
      "text": "Jutta Treviranus. 2020. We Count: Fair Treatment, Disability and Machine Learning - by Jutta Treviranus (OCAD University). https://www.w3.org/2020/06/machine-learning-workshop/talks/we_count_fair_treatment_disability_and_machine_learning.html",
      "doi": ""
    },
    {
      "text": "Shari Trewin. 2018. AI fairness for people with disabilities: Point of view. (2018). arxiv:1811.10670",
      "doi": ""
    },
    {
      "text": "Shari Trewin, Meredith Ringel Morris, Shiri Azenkot, Stacy Branham, Nicole Bleuel, Phill Jenkins, Jeffrey P. Bigham, and Walter S. Lasecki. 2019. Workshop: AI Fairness for People with Disabilities. https://assets19.sigaccess.org/ai_fairness_workshop.html",
      "doi": ""
    },
    {
      "text": "James Vincent. 2018. Amazon reportedly scraps internal AI recruiting tool that was biased against women. https://www.theverge.com/2018/10/10/17958784/ai-recruiting-tool-bias-amazon-report",
      "doi": ""
    },
    {
      "text": "Violeta Voykinska, Shiri Azenkot, Shaomei Wu, and Gilly Leshed. 2016. How Blind People Interact with Visual Content on Social Networking Services. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1584–1595. https://doi.org/10.1145/2818048.2820013",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "W3C. 2018. Web Content Accessibility Guidelines (WCAG) 2.1. https://www.w3.org/TR/WCAG21/",
      "doi": ""
    },
    {
      "text": "W3C. 2019. Informative Images • Images • WAI Web Accessibility Tutorials. https://www.w3.org/WAI/tutorials/images/informative/",
      "doi": ""
    },
    {
      "text": "Sarah Myers West, Meredith Whittaker, and Kate Crawford. 2019. DISCRIMINATING SYSTEMS: Gender, Race, and Power in AI. https://ainowinstitute.org/discriminatingsystems.html",
      "doi": ""
    },
    {
      "text": "Meredith Whittaker, Meryl Alper, Cynthia L Bennett, Sara Hendren, Liz Kaziunas, Mara Mills, Meredith Ringel Morris, Joy Rankin, Emily Rogers, Marcel Salas, 2019. Disability, Bias, and AI. AI Now Institute, November(2019).",
      "doi": ""
    },
    {
      "text": "Rua M. Williams and Juan E. Gilbert. 2019. Cyborg Perspectives on Computing Research Reform. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290607.3310421",
      "doi": "10.1145/3290607.3310421"
    },
    {
      "text": "Writing with Color. 2021. Writing with Color. https://writingwithcolor.tumblr.com/",
      "doi": ""
    },
    {
      "text": "Shaomei Wu and Lada A. Adamic. 2014. Visually Impaired Users on an Online Social Network. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3133–3142. https://doi.org/10.1145/2556288.2557415",
      "doi": "10.1145/2556288.2557415"
    },
    {
      "text": "Shaomei Wu, Jeffrey Wieland, Omid Farivar, and Julie Schiller. 2017. Automatic Alt-Text: Computer-Generated Image Descriptions for Blind Users on a Social Network Service. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1180–1192. https://doi.org/10.1145/2998181.2998364",
      "doi": "10.1145/2998181.2998364"
    },
    {
      "text": "Yuhang Zhao, Shaomei Wu, Lindsay Reynolds, and Shiri Azenkot. 2017. The Effect of Computer-Generated Descriptions on Photo-Sharing Experiences of People with Visual Impairments. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 121 (Dec. 2017), 22 pages. https://doi.org/10.1145/3134756",
      "doi": "10.1145/3134756"
    },
    {
      "text": "Yuhang Zhao, Shaomei Wu, Lindsay Reynolds, and Shiri Azenkot. 2018. A Face Recognition Application for People with Visual Impairments: Understanding Use Beyond the Lab. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173789",
      "doi": "10.1145/3173574.3173789"
    },
    {
      "text": "Wenzhi Zheng, Chih-Hung Yuan, Wei-Hung Chang, and Yen-Chun Jim Wu. 2016. Profile pictures on social media: Gender and regional differences. Computers in Human Behavior 63 (2016), 891–898.",
      "doi": "10.1016/j.chb.2016.06.041"
    }
  ]
}