{
  "doi": "10.1145/3411764.3445264",
  "title": "Buying the ‘Right’ Thing: Designing Food Recommender Systems with Critical Consumers",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Critical consumerism is complex as ethical values are difficult to negotiate, appropriate products are hard to find, and product information is overwhelming. Although recommender systems offer solutions to reduce such complexity, current designs are not appropriate for niche practices and use non-personalized intransparent ethics. To support critical consumption, we conducted a design case study on a personalized food recommender system. Therefore, we first conducted an empirical pre-study with 24 consumers to understand value negotiations and current practices, co-designed the recommender system, and finally evaluated it in a real-world trial with ten consumers. Our findings show how recommender systems can support the negotiation of ethical values within the context of consumption practices, reduce the complexity of finding products and stores, and strengthen consumers. In addition to providing implications for the design to support critical consumption practices, we critically reflect on the scope of such recommender systems and its appropriation.",
  "tags": [
    "food",
    "recommender systems",
    "consumer informatics",
    "co-design",
    "ethics",
    "critical consumerism"
  ],
  "authors": [
    {
      "name": "Dennis Lawo",
      "institution": "Information Systems University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020902",
      "orcid": "missing"
    },
    {
      "name": "Thomas Neifer",
      "institution": "Information Systems University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528986",
      "orcid": "missing"
    },
    {
      "name": "Margarita Esau",
      "institution": "Information Systems University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659481082",
      "orcid": "missing"
    },
    {
      "name": "Gunnar Stevens",
      "institution": "Information Systems University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100661746",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Johan Aberg. 2006. Dealing with Malnutrition: A Meal Planning System for Elderly.. In AAAI spring symposium: argumentation for consumers of healthcare. 1–7.",
      "doi": ""
    },
    {
      "text": "Charu C. Aggarwal. 2016. Recommender Systems. Springer International Publishing. https://doi.org/10.1007/978-3-319-29659-3",
      "doi": "10.5555/2931100"
    },
    {
      "text": "Junho Ahn, James Williamson, Mike Gartrell, Richard Han, Qin Lv, and Shivakant Mishra. 2015. Supporting Healthy Grocery Shopping via Mobile Augmented Reality. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) 12, 1s (2015), 1–24. https://doi.org/10.1145/2808207",
      "doi": "10.1145/2808207"
    },
    {
      "text": "Jessica Aschemann-Witzel and Stephan Zielke. 2015. Can’t buy me green? A review of consumer perceptions of and behavior toward the price of organic food. Journal of Consumer Affairs 51, 1 (sep 2015), 211–251. https://doi.org/10.1111/joca.12092",
      "doi": ""
    },
    {
      "text": "Lioness Ayres. 2008. Semi-structured interview. The SAGE encyclopedia of qualitative research methods 8 (2008), 811–813.",
      "doi": ""
    },
    {
      "text": "Zygmunt Bauman. 1999. In search of politics. Stanford University Press, Stanford, Calif.",
      "doi": ""
    },
    {
      "text": "Jon Bird, Vaiva Kalnikaité, and Yvonne Rogers. 2011. The Augmented Shopping Trolley: An Ambient Display To Provide Shoppers with Non-Obvious Product Information. In Proceedings of the 2nd International Workshop on Persuasion, Influence, Nudge & Coercion Through Mobile Devices. 3–6.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Lindsey B. Carfagna, Emilie A. Dubois, Connor Fitzmaurice, Monique Y. Ouimette, Juliet B. Schor, Margaret Willis, and Thomas Laidley. 2014. An emerging eco-habitus: The reconfiguration of high cultural capital practices among ethical consumers. Journal of Consumer Culture 14, 2 (2014), 158–178. https://doi.org/10.1177/1469540514526227",
      "doi": ""
    },
    {
      "text": "Michal J. Carrington, Benjamin A. Neville, and Gregory J. Whitwell. 2014. Lost in translation: Exploring the ethical consumer intention–behavior gap. Journal of Business Research 67, 1 (jan 2014), 2759–2767. https://doi.org/10.1016/j.jbusres.2012.09.022",
      "doi": ""
    },
    {
      "text": "Adrian Clear and Adrian Friday. 2012. Designing a Food’Qualculator’. In DIS 2012 workshop on Food for Thought: Designing for Critical Reflection on Food Practices. Newcastle, UK.",
      "doi": ""
    },
    {
      "text": "Kirsti Dautzenberg, Katharina Grasl, Tatjana Halm, and Anne Schulze. 2016. Buchungs- und Vergleichs-Portale – Die schwierige Suche nach dem günstigsten Preis. (2016), 80. https://www.verbraucherzentrale-brandenburg.de/sites/default/files/migration_files/media239508A.pdf",
      "doi": ""
    },
    {
      "text": "Mehdi Elahi, Mouzhi Ge, Francesco Ricci, Ignacio Fernández-Tobías, Shlomo Berkovsky, and Massimo David. 2015. Interaction design in a mobile food recommender system. In CEUR Workshop Proceedings. CEUR-WS.",
      "doi": ""
    },
    {
      "text": "Mehdi Elahi, Mouzhi Ge, Francesco Ricci, David Massimo, and Shlomo Berkovsky. 2014. Interactive Food Recommendation for Groups.. In Recsys posters. Citeseer.",
      "doi": ""
    },
    {
      "text": "David Elsweiler, Morgan Harvey, Bernd Ludwig, and Alan Said. 2015. Bringing the” healthy” into Food Recommenders.. In DMRS. 33–36.",
      "doi": ""
    },
    {
      "text": "Jill Freyne and Shlomo Berkovsky. 2010. Intelligent food planning. In Proceedings of the 15th international conference on Intelligent user interfaces. 321–324. https://doi.org/10.1145/1719970.1720021",
      "doi": "10.1145/1719970.1720021"
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, and Rob Comber. 2013. Negotiating food waste: Using a practice lens to inform design. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 2(2013), 1–25. https://doi.org/10.1145/2463579.2463582",
      "doi": "10.1145/2463579.2463582"
    },
    {
      "text": "Mickey Gjerris, Christian Gamborg, and Henrik Saxe. 2016. What to Buy? On the Complexity of Being a Critical Consumer. Journal of Agricultural and Environmental Ethics 29, 1 (dec 2016), 81–102. https://doi.org/10.1007/s10806-015-9591-6",
      "doi": ""
    },
    {
      "text": "Carlos A Gomez-Uribe and Neil Hunt. 2015. The netflix recommender system: Algorithms, business value, and innovation. ACM Transactions on Management Information Systems (TMIS) 6, 4(2015), 1–19. https://doi.org/10.1145/2843948",
      "doi": "10.1145/2843948"
    },
    {
      "text": "Emese Gulyás. 2008. Interpretations of Ethical Consumption. Review of Sociology 14, 1 (jun 2008), 25–44. https://doi.org/10.1556/revsoc.14.2008.2",
      "doi": ""
    },
    {
      "text": "Maria Håkansson and Phoebe Sengers. 2013. Beyond Being Green: Simple Living Families and ICT. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France, 2013). ACM, 2725. https://doi.org/10.1145/2470654.2481378",
      "doi": "10.1145/2470654.2481378"
    },
    {
      "text": "Neil D Hamilton. 2005. Food democracy II: Revolution or restoration. J. Food L. & Pol’y 1(2005), 13.",
      "doi": ""
    },
    {
      "text": "Morgan Harvey, Bernd Ludwig, and David Elsweiler. 2013. You Are What You Eat: Learning User Tastes for Rating Prediction. In International symposium on string processing and information retrieval. Springer, 153–164. https://doi.org/10.1007/978-3-319-02432-5_19",
      "doi": ""
    },
    {
      "text": "Nico Herbig, Gerrit Kahl, and Antonio Krüger. 2018. Design Guidelines for Assistance Systems Supporting Sustainable Purchase Decisions. In Proceedings of the 2018 Designing Interactive Systems Conference. 1333–1344. https://doi.org/10.1145/3196709.3196726",
      "doi": "10.1145/3196709.3196726"
    },
    {
      "text": "Ole Kallehave, Mikael B Skov, and Nino Tiainen. 2011. Persuasion in situ: shopping for healthy food in supermarkets. In Proceedings of PINC 2011 workshop at CHI.",
      "doi": ""
    },
    {
      "text": "Vaiva Kalnikaite, Stefan Kreitmayer, Yvonne Rogers, Jon Bird, Nicolas Villar, Khaled Bachour, Stephen Payne, Peter M. Todd, Johannes Schöning, and Antonio Krüger. 2011. How to nudge in Situ: designing lambent devices to deliver salient information in supermarkets. In Proceedings of the 13th international conference on Ubiquitous computing. 11–20. https://doi.org/10.1145/2030112.2030115",
      "doi": "10.1145/2030112.2030115"
    },
    {
      "text": "Deborah Kalte. 2020. Political Veganism: An Empirical Analysis of Vegans’ Motives, Aims, and Political Engagement. Political Studies (2020), 003232172093017. https://doi.org/10.1177/0032321720930179",
      "doi": ""
    },
    {
      "text": "Daniel Karpati, Amro Najjar, and Diego Agustin Ambrossio. 2020. Ethics of Food Recommender Applications. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society. 313–319. https://doi.org/10.1145/3375627.3375874",
      "doi": "10.1145/3375627.3375874"
    },
    {
      "text": "Cecilia Katzeff, Rebecka Milestad, Jorge Luis Zapico, and Ulrica Bohné. 2020. Encouraging Organic Food Consumption through Visualization of Personal Shopping Data. Sustainability 12, 9 (apr 2020), 3599. https://doi.org/10.3390/su12093599",
      "doi": ""
    },
    {
      "text": "Dennis Lawo, Margarita Esau, Philip Engelbutzeder, and Gunnar Stevens. 2020. Going Vegan: The Role(s) of ICT in Vegan Practice Transformation. Sustainability 12, 12 (2020), 5184. https://doi.org/10.3390/su12125184",
      "doi": ""
    },
    {
      "text": "Henry Lieberman, Fabio Paternò, Markus Klann, and Volker Wulf. 2006. End-User Development: An Emerging Paradigm. In Human-Computer Interaction Series. Springer Netherlands, 1–8. https://doi.org/10.1007/1-4020-5386-x_1",
      "doi": ""
    },
    {
      "text": "Johanna Meurer, Dennis Lawo, Christina Pakusch, Peter Tolmie, and Volker Wulf. 2019. Opportunities for Sustainable Mobility. In Proceedings of the 9th International Conference on Communities & Technologies-Transforming Communities. 102–113. https://doi.org/10.1145/3328320.3328391",
      "doi": "10.1145/3328320.3328391"
    },
    {
      "text": "Michele Micheletti, Andreas Follesdal, and Dietlind Stolle. 2004. Politics, Products, and Markets: Exploring Political Consumerism Past and Present. 84 (2004), 123–125. https://doi.org/10.1111/j.1944-8287.2008.tb00400.x",
      "doi": ""
    },
    {
      "text": "Cataldo Musto, Christoph Trattner, Alain Starke, and Giovanni Semeraro. 2020. Towards a Knowledge-aware Food Recommender System Exploiting Holistic User Models. In Proceedings of the 28th ACM Conference on User Modeling, Adaptation and Personalization. 333–337. https://doi.org/10.1145/3340631.3394880",
      "doi": "10.1145/3340631.3394880"
    },
    {
      "text": "Lene Nielsen. 2011. Personas in co-creation and co-design. In Proceedings of the 11th Human-Computer Interaction Research Symposium. 38–40.",
      "doi": ""
    },
    {
      "text": "Dara O'Rourke and Abraham Ringer. 2016. The Impact of Sustainability Information on Consumer Decision Making. Journal of Industrial Ecology 20, 4 (aug 2016), 882–892. https://doi.org/10.1111/jiec.12310",
      "doi": ""
    },
    {
      "text": "Andrea G. Parker and Rebecca E. Grinter. 2014. Collectivistic health promotion tools: Accounting for the relationship between culture, food and nutrition. International Journal of Human-Computer Studies 72, 2 (2014), 185–206. https://doi.org/10.1016/j.ijhcs.2013.08.008",
      "doi": "10.1016/j.ijhcs.2013.08.008"
    },
    {
      "text": "Sebastian Prost, Clara Crivellaro, Andy Haddon, and Rob Comber. 2018. Food Democracy in the Making: Designing with Local Food Networks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2018) (CHI ’18). ACM, 333:1–333:14. https://doi.org/10.1145/3173574.3173907",
      "doi": "10.1145/3173574.3173907"
    },
    {
      "text": "Sebastian Prost, Vasilis Vlachokyriakos, Jane Midgley, Graeme Heron, Kahina Meziant, and Clara Crivellaro. 2019. Infrastructuring Food Democracy: The Formation of a Local Food Hub in the Context of Socio-Economic Deprivation. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (nov 2019), 1–27. Issue CSCW. https://doi.org/10.1145/3359159",
      "doi": "10.1145/3359159"
    },
    {
      "text": "Wolfgang H. Reitberger, Wolfgang Spreicer, and Geraldine Fitzpatrick. 2014. Nutriflect: reflecting collective shopping behavior and nutrition. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3309–3318. https://doi.org/10.1145/2556288.2557384",
      "doi": "10.1145/2556288.2557384"
    },
    {
      "text": "Matthew B. Ruby, Steven J. Heine, Shanmukh Kamble, Tessa K. Cheng, and Mahadevi Waddar. 2013. Compassion and contamination. Cultural differences in vegetarianism. Appetite 71(2013), 340–348. https://doi.org/10.1016/j.appet.2013.09.004",
      "doi": ""
    },
    {
      "text": "Artur Saraiva, Emília Fernandes, and Moritz von Schwedler. 2020. The green identity formation process in organic consumer communities. Qualitative Market Research: An International Journal 23 (2020), 69–86. https://doi.org/10.1108/qmr-05-2018-0048",
      "doi": ""
    },
    {
      "text": "Paschal Sheeran and Thomas L. Webb. 2016. The Intention-Behavior Gap. Social and personality psychology compass 10, 9 (2016), 503–518. https://doi.org/10.1111/spc3.12265",
      "doi": ""
    },
    {
      "text": "Brent Smith and Greg Linden. 2017. Two Decades of Recommender Systems at Amazon.com. Ieee internet computing 21, 3 (2017), 12–18. https://doi.org/10.1109/mic.2017.72",
      "doi": ""
    },
    {
      "text": "Alain Starke. 2019. RecSys Challenges in achieving sustainable eating habits.. In HealthRecSys@ RecSys. 29–30.",
      "doi": ""
    },
    {
      "text": "Gunnar Stevens, Paul Bossauer, Thomas Neifer, and Stefan Hanschke. 2017. Using shopping data to design sustainable consumer apps. In 2017 Sustainable Internet and ICT for Sustainability (SustainIT). IEEE, 1–3. https://doi.org/10.23919/sustainit.2017.8379810",
      "doi": ""
    },
    {
      "text": "Dietlind Stolle and Marc Hooghe. 2004. Consumers as political participants? Shifts in political action repertoires in Western societies. Politics, products, and markets: Exploring political consumerism past and present (2004), 265–288.",
      "doi": ""
    },
    {
      "text": "Dietlind Stolle and Michele Micheletti. 2013. Political Consumerism. Cambridge University Press. https://doi.org/10.1017/cbo9780511844553",
      "doi": ""
    },
    {
      "text": "Thi Ngoc Trang Tran, Müslüm Atas, Alexander Felfernig, and Martin Stettinger. 2017. An overview of recommender systems in the healthy food domain. Journal of Intelligent Information Systems 50, 3 (jun 2017), 501–526. https://doi.org/10.1007/s10844-017-0469-0",
      "doi": ""
    },
    {
      "text": "Christoph Trattner and David Elsweiler. 2017. Food Recommender Systems: Important Contributions, Challenges and Future Research Directions. (2017). arxiv:1711.02760 [cs] http://arxiv.org/abs/1711.02760",
      "doi": ""
    },
    {
      "text": "Christoph Trattner and David Elsweiler. 2019. An Evaluation of Recommendation Algorithms for Online Recipe Portals.. In HealthRecSys@ RecSys. 24–28.",
      "doi": ""
    },
    {
      "text": "Christoph Trattner, Dominik Moesslang, and David Elsweiler. 2018. On the predictability of the popularity of online recipes. EPJ Data Science 7, 1 (2018), 20. https://doi.org/10.1140/epjds/s13688-018-0149-5",
      "doi": ""
    },
    {
      "text": "Frank Trentmann. 2007. Citizenship and consumption. Journal of Consumer Culture 7, 2 (jul 2007), 147–158. https://doi.org/10.1177/1469540507077667",
      "doi": ""
    },
    {
      "text": "Michele Trevisiol, Luca Chiarandini, and Ricardo Baeza-Yates. 2014. Buon appetito: recommending personalized menus. In Proceedings of the 25th ACM conference on Hypertext and social media. 327–329. https://doi.org/10.1145/2631775.2631784",
      "doi": "10.1145/2631775.2631784"
    },
    {
      "text": "Richard Twine. 2017. A practice theory framework for understanding vegan transition. Animal Studies Journal 6, 2 (2017), 192–224.",
      "doi": ""
    },
    {
      "text": "Tsuguya Ueta, Masashi Iwakami, and Takayuki Ito. 2011. A Recipe Recommendation System Based on Automatic Nutrition Information Extraction. In International Conference on Knowledge Science, Engineering and Management. Springer, 79–90. https://doi.org/10.1007/978-3-642-25975-3_8",
      "doi": "10.1007/978-3-642-25975-3_8"
    },
    {
      "text": "Volker Wulf, Markus Rohde, Volkmar Pipek, and Gunnar Stevens. 2011. Engaging with Practices: Design Case Studies as a Research Framework in CSCW. In Proceedings of the ACM 2011 conference on Computer supported cooperative work - CSCW '11 (Hangzhou, China). ACM Press, 505. https://doi.org/10.1145/1958824.1958902",
      "doi": "10.1145/1958824.1958902"
    },
    {
      "text": "Jorge Luis Zapico, Cecilia Katzeff, Ulrica Bohné, and Rebecka Milestad. 2016. Eco-feedback Visualization for Closing the Gap of Organic Food Consumption. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden, 2016). ACM, 1–9. https://doi.org/10.1145/2971485.2971507",
      "doi": "10.1145/2971485.2971507"
    }
  ]
}