{
  "doi": "10.1145/3411764.3445520",
  "title": "Accessibility of High-Fidelity Prototyping Tools",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "High-fidelity prototyping tools are used by software designers and developers to iron out interface details without full implementation. However, the lack of visual accessibility in these tools creates a barrier for designers who may use screen readers, such as those who are vision impaired. We assessed conformance of four prototyping tools (Sketch, Adobe XD, Balsamiq, UXPin) with accessibility guidelines, using two screen readers (Narrator and VoiceOver), focusing our analysis on GUI element accessibility and critical workflows used to create prototypes. We found few tools were fully accessible, with 45.9% of GUI elements meeting accessibility criteria (34.2% partially supported accessibility, 19.9% not supporting accessibility). Accessibility issues stymied efforts to create prototypes using screen readers. Though no screen reader-tool pairs were completely accessible, the most accessible pairs were VoiceOver-Sketch, VoiceOver-Balsamiq, and Narrator-Balsamiq. We recommend prioritizing improved accessibility for input and control instruction, alternative text, focus order, canvas element properties, and keyboard operations.",
  "tags": [
    "High-Fidelity Prototyping",
    "Prototyping Tools"
  ],
  "authors": [
    {
      "name": "Junchen Li",
      "institution": "School of Information Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702662",
      "orcid": "missing"
    },
    {
      "name": "Garreth W. Tigwell",
      "institution": "School of Information Rochester Institute of Technology, United States",
      "img": "/do/10.1145/contrib-99659067691/rel-imgonly/img_20170512_13473021.09.44.jpg",
      "acmid": "99659067691",
      "orcid": "0000-0002-3123-6361"
    },
    {
      "name": "Kristen Shinohara",
      "institution": "School of Information Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319501668",
      "orcid": "0000-0002-1157-6369"
    }
  ],
  "references": [
    {
      "text": "Chadia Abras, Diane Maloney-Krichmar, and Jenny Preece. 2004. User-centered design. Bainbridge, W. Encyclopedia of Human-Computer Interaction. Thousand Oaks: Sage Publications 37, 4: 445–456.",
      "doi": ""
    },
    {
      "text": "Dustin Adams, Sri Kurniawan, Cynthia Herrera, Veronica Kang, and Natalie Friedman. 2016. Blind Photographers and VizSnap: A Long-Term Study. Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility, 201–208. Retrieved from https://doi-org.ezproxy.rit.edu/10.1145/2982142.2982169",
      "doi": "10.1145/2982142.2982169"
    },
    {
      "text": "Cynthia L. Bennett, Jane E, Martez E. Mott, Edward Cutrell, and Meredith Ringel Morris. 2018. How Teens with Visual Impairments Take, Edit, and Share Photos on Social Media. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, Paper 76. Retrieved from https://doi-org.ezproxy.rit.edu/10.1145/3173574.3173650",
      "doi": "10.1145/3173574.3173650"
    },
    {
      "text": "Cynthia L. Bennett, Kristen Shinohara, Brianna Blaser, Andrew Davidson, and Kat M. Steele. 2016. Using a Design Workshop To Explore Accessible Ideation. In Proceedings of the ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’16), 303–304. https://doi.org/10.1145/2982142.2982209",
      "doi": ""
    },
    {
      "text": "Yevgen Borodin, Jeffrey P. Bigham, Glenn Dausch, and I. V. Ramakrishnan. 2010. More than meets the eye: a survey of screen-reader browsing strategies. Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A), Article 13. Retrieved from https://doi-org.ezproxy.rit.edu/10.1145/1805986.1806005",
      "doi": ""
    },
    {
      "text": "Robin N. Brewer. 2018. Facilitating discussion and shared meaning: Rethinking co-design sessions with people with vision impairments. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare, 258–262.",
      "doi": "10.1145/3240925.3240981"
    },
    {
      "text": "William Buxton. 2007. Sketching user experiences: getting the design right and the right design. Elsevier/Morgan Kaufmann, Amsterdam; Boston.",
      "doi": "10.5555/1526229"
    },
    {
      "text": "AnneMarie Cooke. A History of Accessibility at IBM. AccessWorld. Retrieved June 22, 2020 from https://www.afb.org/aw/5/2/14760",
      "doi": ""
    },
    {
      "text": "Jan Derboven, Dries De Roeck, Mathijs Verstraete, David Geerts, Jan Schneider-Barnes, and Kris Luyten. 2010. Comparing user interaction with low and high fidelity prototypes of tabletop surfaces. Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, 148–157. Retrieved from https://doi.org/10.1145/1868914.1868935",
      "doi": "10.1145/1868914.1868935"
    },
    {
      "text": "Priscilla Frank. 2016. 12 Blind And Partially Blind Photographers Changing The Way We See The World. HuffPost. Retrieved September 12, 2020 from https://www.huffpost.com/entry/blind-photographer-book_n_57d71a8ee4b0fbd4b7baf722?guccounter=1",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peter Kahn, and Alan Borning. 2006. Value Sensitive Design and Information Systems. M.E. Sharpe, New York.",
      "doi": ""
    },
    {
      "text": "Stephanie Hackett, Bambang Parmanto, and Xiaoming Zeng. 2003. Accessibility of Internet websites through time. Proceedings of the 6th international ACM SIGACCESS conference on Computers and accessibility, 32–39. Retrieved from https://doi.org/10.1145/1028630.1028638",
      "doi": "10.1145/1029014.1028638"
    },
    {
      "text": "Vicki L. Hanson and John T. Richards. 2013. Progress on Website Accessibility? ACM Trans. Web 7, Article 2.",
      "doi": "10.1145/2435215.2435217"
    },
    {
      "text": "Shawn Lawton Henry (ed.). 2019. Web Content Accessibility Guidelines (WCAG). Retrieved June 22, 2020 from https://www.w3.org/WAI/standards-guidelines/",
      "doi": ""
    },
    {
      "text": "Mary Hiland. Arts and Crafts After Vision Loss. VisionAware: For Independent Living with Vision Loss. Retrieved September 12, 2020 from https://visionaware.org/everyday-living/recreation-and-leisure/arts-and-crafts/",
      "doi": ""
    },
    {
      "text": "Shaun Kane. 2011. Usable Gestures for Blind People: Understanding Preference and Performance. ACM.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Jeffrey P. Bigham, and Jacob O. Wobbrock. 2008. Slide rule: making mobile touch screens accessible to blind people using multi-touch interaction techniques. In Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility, 73–80.",
      "doi": ""
    },
    {
      "text": "Peter Korn, Loïc Martínez Normand, Mike Pluke, Andi Snow-Weaver, and Gregg Vanderheiden. 2013. Guidance on Applying WCAG 2.0 to Non-Web Information and Communications Technologies (WCAG2ICT). Retrieved June 22, 2020 from https://www.w3.org/TR/wcag2ict/",
      "doi": ""
    },
    {
      "text": "Chris Law, Julie Jacko, and Paula Edwards. 2005. Programmer-focused website accessibility evaluations. Proceedings of the 7th international ACM SIGACCESS conference on Computers and accessibility, 20–27. Retrieved from https://doi-org.ezproxy.rit.edu/10.1145/1090785.1090792",
      "doi": "10.1145/1090785.1090792"
    },
    {
      "text": "Jonathan Lazar, Aaron Allen, Jason Kleinman, and Chris Malarkey. 2007. What Frustrates Screen Reader Users on the Web: A Study of 100 Blind Users. International Journal of Human–Computer Interaction 22, 3: 247–269. https://doi.org/10.1080/10447310709336964",
      "doi": ""
    },
    {
      "text": "Barbara Leporini, Maria Claudia Buzzi, and Buzzi Marina. 2012. Interacting with mobile devices via VoiceOver: usability and accessibility issues. In OzCHI ’12 Proceedings of the 24th Australian Computer-Human Interaction Conference. https://doi.org/10.1145/2414536.2414591",
      "doi": "10.1145/2414536.2414591"
    },
    {
      "text": "Youn-Kyung Lim, Erik Stolterman, and Josh Tenenberg. 2008. The anatomy of prototypes: Prototypes as filters, prototypes as manifestations of design ideas. ACM Trans. Comput.-Hum. Interact. 15, 2: 1–27.",
      "doi": "10.1145/1375761.1375762"
    },
    {
      "text": "Michael McCurdy, Christopher Connors, Guy Pyrzak, Bob Kanefsky, and Alonso Vera. 2006. Breaking the fidelity barrier: an examination of our current characterization of prototypes and an example of a mixed-fidelity success. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1233–1242. Retrieved from https://doi-org.ezproxy.rit.edu/10.1145/1124772.1124959",
      "doi": "10.1145/1124772.1124959"
    },
    {
      "text": "Meredith Ringel Morris, Jazette Johnson, Cynthia L. Bennett, and Edward Cutrell. 2018. Rich Representations of Visual Content for Screen Reader Users. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–11. https://doi.org/10.1145/3173574.3173633",
      "doi": "10.1145/3173574.3173633"
    },
    {
      "text": "Alan Newell, P Gregor, M Morgan, Graham Pullin, and C Macaulay. 2011. User-Sensitive Inclusive Design. Universal Access in the Information Society 10, 3: 235–243.",
      "doi": "10.1007/s10209-010-0203-y"
    },
    {
      "text": "Jakob Nielsen. 1990. Paper versus computer implementations as mockup scenarios for heuristic evaluation. In Proceedings of the IFIP TC13 Third Interational Conference on Human-Computer Interaction, 315–320.",
      "doi": "10.5555/647402.725312"
    },
    {
      "text": "Natalia Pérez Liebergesell, Peter-Willem Vermeersch, and Ann Heylighen. 2018. Designing from a Disabled Body: The Case of Architect Marta Bordas Eddy. Multimodal Technologies and Interaction 2, 1. https://doi.org/10.3390/mti2010004",
      "doi": ""
    },
    {
      "text": "Helen Petrie and Omar Kheir. 2007. The relationship between accessibility and usability of websites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 397–406.",
      "doi": "10.1145/1240624.1240688"
    },
    {
      "text": "Venkatesh Potluri, Tadashi Grindeland, Jon E. Froehlich, and Jennifer Mankoff. 2019. AI Assisted UI Design for Blind and Low Vision Creators. In ASSETS 2019 workshop proceedings: AI Fairness for People with Disabilities.",
      "doi": ""
    },
    {
      "text": "Venkatesh Potluri, Liang He, Christine Chen, Jon E. Froehlich, and Jennifer Mankoff. 2019. A Multi-Modal Approach for Blind and Visually Impaired Developers to Edit Webpage Designs. The 21st International ACM SIGACCESS Conference on Computers and Accessibility, 612–614. Retrieved from https://doi.org/10.1145/3308561.3354626",
      "doi": "10.1145/3308561.3354626"
    },
    {
      "text": "André Rodrigues, Kyle Montague, Hugo Nicolau, and Tiago Guerreiro. 2015. Getting Smartphones to Talkback: Understanding the Smartphone Adoption Process of Blind Users. Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility, 23–32. Retrieved from https://doi.org/10.1145/2700648.2809842",
      "doi": "10.1145/2700648.2809842"
    },
    {
      "text": "Anne Spencer Ross, Xiaoyi Zhang, James Fogarty, and Jacob O. Wobbrock. 2018. Examining Image-Based Button Labeling for Accessibility in Android Apps through Large-Scale Analysis. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility, 119–130.",
      "doi": ""
    },
    {
      "text": "Anne Spencer Ross, Xiaoyi Zhang, James Fogarty, and Jacob O. Wobbrock. 2020. An Epidemiology-inspired Large-scale Analysis of Android App Accessibility. ACM Trans. Access. Comput. 13, Article 4.",
      "doi": "10.1145/3348797"
    },
    {
      "text": "J Rudd, K Stern, and S Isensee. 1996. Low vs. high-fidelity prototyping debate. interactions 3, 1: 76–85.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Cynthia L. Bennett, and Jacob O. Wobbrock. 2016. How Designing for People With and Without Disabilities Shapes Student Design Thinking. In Proceedings of the ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’16), 229–237. https://doi.org/10.1145/2982142.2982158",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Nayeri Jacobo, Wanda Pratt, and Jacob O. Wobbrock. 2020. Design for Social Accessibility Method Cards: Engaging Users and Reflecting on Social Scenarios for Accessible Design. ACM Trans. Access. Comput. 12, 4: Article 17.",
      "doi": "10.1145/3369903"
    },
    {
      "text": "Kristen Shinohara, Jacob O. Wobbrock, and Wanda Pratt. 2018. Incorporating Social Factors in Accessible Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility, 149–160.",
      "doi": "10.1145/3234695.3236346"
    },
    {
      "text": "Ben Shneiderman. 2000. Universal usability. Communications of the ACM 43, 5: 84–91.",
      "doi": "10.1145/332833.332843"
    },
    {
      "text": "Ben Shneiderman and Catherine Plaisant. 2004. Designing the user interface: strategies for effective human-computer interaction. Pearson/Addison Wesley, Boston.",
      "doi": ""
    },
    {
      "text": "P. G. Ramachandran Shunguo Yan. 2019. The Current Status of Accessibility in Mobile Apps. In ACM Transactions on Accessible Computing (TACCESS). https://doi.org/10.1145/3300176",
      "doi": ""
    },
    {
      "text": "Derek Torsani. 2018. Being a Color Blind Designer. Medium. Retrieved September 12, 2020 from https://medium.com/@dmtors/being-a-color-blind-designer-aa6828c09a42",
      "doi": ""
    },
    {
      "text": "Robert A. Virzi, Jeffrey L. Sokolov, and Demetrios Karis. 1996. Usability problem identification using both low- and high-fidelity prototypes. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 236–243. Retrieved from https://doi.org/10.1145/238386.238516",
      "doi": "10.1145/238386.238516"
    },
    {
      "text": "WebAIM. Screen Reader User Survey #8 Results. Retrieved June 17, 2020 from https://webaim.org/projects/screenreadersurvey8/",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Krzysztof Z. Gajos, Shaun K. Kane, and Gregg C. Vanderheiden. 2018. Ability-based design. Communnications of the ACM 61, 6: 62–71.",
      "doi": "10.1145/3148051"
    },
    {
      "text": "Shunguo Yan and P. G. Ramachandran. 2019. The Current Status of Accessibility in Mobile Apps. ACM Transactions on Accessible Computing (TACCESS) 12, Article 3.",
      "doi": "10.1145/3300176"
    },
    {
      "text": "2017. Adobe Accessibility Conformance Report: Adobe Photoshop CC. Retrieved June 22, 2020 from https://www.adobe.com/accessibility/compliance/adobe-photoshop-cc-acr.html",
      "doi": ""
    },
    {
      "text": "2020. IBM Accessibility Checklist, version 7.1. IBM Accessibility. Retrieved July 22, 2020 from https://www.ibm.com/able/guidelines/ci162/accessibility_checklist.html",
      "doi": ""
    },
    {
      "text": "Section 508. Retrieved from https://www.section508.gov/",
      "doi": ""
    }
  ]
}