{
  "doi": "10.1145/3411764.3445318",
  "title": "When the Social Becomes Non-Human: Young People's Perception of Social Support in Chatbots",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Although social support is important for health and well-being, many young people are hesitant to reach out for support. The emerging uptake of chatbots for social and emotional purposes entails opportunities and concerns regarding non-human agents as sources of social support. To explore this, we invited 16 participants (16–21 years) to use and reflect on chatbots as sources of social support. Our participants first interacted with a chatbot for mental health (Woebot) for two weeks. Next, they participated in individual in-depth interviews. As part of the interview session, they were presented with a chatbot prototype providing information to young people. Two months later, the participants reported on their continued use of Woebot. Our findings provide in-depth knowledge about how young people may experience various types of social support—appraisal, informational, emotional, and instrumental support—from chatbots. We summarize implications for theory, practice, and future research.",
  "tags": [
    "Artificial Intelligence",
    "Chatbots",
    "Social support",
    "Young people"
  ],
  "authors": [
    {
      "name": "Petter Bae Bae Brandtzæg",
      "institution": "University of Oslo, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700863",
      "orcid": "missing"
    },
    {
      "name": "Marita Skjuve",
      "institution": "SINTEF Digital, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659274635",
      "orcid": "missing"
    },
    {
      "name": "Kim Kristoffer Kristoffer Dysthe",
      "institution": "University of Oslo, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702059",
      "orcid": "missing"
    },
    {
      "name": "Asbjørn Følstad",
      "institution": "SINTEF, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100583924",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lene Arnett Jensen. 2011. Bridging Cultural and Developmental Approaches to Psychology: New Syntheses in Theory, Research, and Policy. Oxford University Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Nan Lin, Walter M. Ensel, Ronald S. Simeone, and Wen Kuo. 1979. Social support, stressful life events, and illness: A model and an empirical test. J. Health. Soc. Behav. 20, 2, (Jun. 1979), 108–119. DOI: https://doi.org/10.2307/2136433",
      "doi": ""
    },
    {
      "text": "Eve Griffin and Elaine Mcmahon. 2020. Adolescent mental health: Global data informing opportunities for prevention. EClin. Med. 24 (Apr. 2007). DOI: https://doi.org/10.1016/j.eclinm.2020.100413",
      "doi": ""
    },
    {
      "text": "Helen Bould, Becky Mars, Paul Moran, Lucy Biddle, and David Gunnell. 2019. Rising suicide rates among adolescents in England and Wales. Lancet 394, 10193 (Jul. 2019), 116–117. DOI: https://doi.org/10.1016/S0140-6736(19)31102-X",
      "doi": ""
    },
    {
      "text": "Jean M. Twenge. 2020. Increases in depression, self-harm, and suicide among US adolescents after 2012 and links to technology use: Possible mechanisms. Int. J. Psychiatry Clin. Pract. appi. prcp. 20190015 (Mar. 2020), 19–25. DOI: https://doi.org/10.1176/appi.prcp.20190015",
      "doi": ""
    },
    {
      "text": "Marita Skjuve and Petter Bae Brandtzæg. 2018. Chatbots as a new user interface for providing health information to young people (pp. 59-66), in Andersson, Y., Dahlquist, U., Ohlsson, J. (Eds.). Youth and News in a Digital Media Environment – Nordic-Baltic Perspectives. Retrived from https://www.nordicom.gu.se/sites/default/files/kapitel-pdf/06_bjaalandskjuve_brandtzaeg.pdf",
      "doi": ""
    },
    {
      "text": "Debra J. Rickwood, Frank P. Deane, and Coralie J. Wilson. 2007. When and how do young people seek professional help for mental health problems? Med. J. Aust. 187, S7 (Oct. 2007), S35–S39. DOI: https://doi.org/10.5694/j.1326-5377.2007.tb01334.x",
      "doi": ""
    },
    {
      "text": "Lucie Cluver. 2020. Solving the global challenge of adolescent mental ill-health. Lancet Child Adolesc. Health 4, 8 (Aug. 2020), 556–557. DOI: https://doi.org/10.1016/S2352-4642(20)30205-4",
      "doi": ""
    },
    {
      "text": "Louise Dalton, Elizabeth Rapa, and Alan Stein. 2020. Protecting the psychological health of children through effective communication about COVID-19. Lancet Child Adolesc. Health 4, 5 (May 2020), 346–347. DOI: https://doi.org/10.1016/S2352-4642(20)30097-3",
      "doi": ""
    },
    {
      "text": "Camilla Gudmundsen Høiland, Asbjørn Følstad, and Amela Karahasanovic 2020. Hi, can I help? Exploring how to design a mental health chatbot for youths? Hum. Technol. 16, 2 (Aug. 2020), 139–169. DOI: https://doi.org/10.17011/ht/urn.202008245640",
      "doi": ""
    },
    {
      "text": "Chia-Fang Chung, Elena Agapie, Jessica Schroeder, Sonali Mishra, James Fogarty, and Sean A Munson. 2017. When personal tracking becomes social: Examining the use of Instagram for healthy eating. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, ACM Inc., New York, NY, 1674–1687. https://doi.org/10.1145/3025453.3025747",
      "doi": "10.1145/3025453.3025747"
    },
    {
      "text": "Asbjørn Følstad and Petter Bae Brandtzaeg. 2020. Users' experiences with chatbots: findings from a questionnaire study. Quality and User Experience. 5,3 (Apr. 2020), 14 pages. DOI: https://doi.org/10.1007/s41233-020-00033-2",
      "doi": ""
    },
    {
      "text": "Hao Zhou, Minlie Huang, Tianyang Zhang, Xiaoyan Zhu and Bing Liu. 2017. Emotional chatting machine: Emotional conversation generation with internal and external memory. arXiv preprint arXiv:1704.01074 (May 2017). Retrieved June 22, 2020, from https://www.arxiv-vanity.com/papers/1704.01074/",
      "doi": ""
    },
    {
      "text": "Endang Wahyu Pamungkas. 2019. Emotionally-aware chatbots: A survey. arXiv preprint arXiv:1906.09774 (Jul. 2019). Retrieved June 2, 2020, from https://arxiv.org/pdf/1906.09774.pdf",
      "doi": ""
    },
    {
      "text": "Jaya Narain, Tina Quach, Monique Davey, Hae Won Park, Cynthia Breazeal, and Rosalind Picard. 2020. Promoting wellbeing with Sunny, a chatbot that facilitates positive messages within social groups. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. ACM Inc., New York, NY, 1–8. https://doi.org/10.1145/3334480.3383062",
      "doi": "10.1145/3334480.3383062"
    },
    {
      "text": "Emily G. Lattie, Rachel Kornfield, Kathryn E. Ringland, Renwen Zhang, Nathan Winquist, and Madhu Reddy. 2020. Designing mental health technologies that support the social ecosystem of college students. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI’2020). ACM Inc., New York, NY, 1–15. https://doi.org/10.1145/3313831.3376362",
      "doi": "10.1145/3313831.3376362"
    },
    {
      "text": "Vivian Ta, Caroline Griffith, Carolynn Boatfield, Xinyu Wang, Maria Civitello, Haley Bader, Esther Decero, and Alexia Loggarakis. 2020. User experiences of social support from companion chatbots in everyday contexts: Thematic analysis. J. Medical Internet Res. 3 (March 2020), e16235. DOI: https://doi.org/10.2196/16235",
      "doi": ""
    },
    {
      "text": "Jeffrey Jensen Arnett. 2011. Emerging adulthood(s): The cultural psychology of a new life stage. In Jensen, L. A. (Ed.), Bridging Cultural and Developmental Approaches to Psychology: New Syntheses in Theory, Research, and Policy (p. 255–275). Oxford University Press, Oxford",
      "doi": ""
    },
    {
      "text": "Shyam Sundar. 2020. Rise of machine agency: A framework for studying the psychology of human–AI interaction (HAII). J. Comput.-Mediat. Commun. 25, 1 (Jan. 2020), 74–88. DOI: https://doi.org/10.1093/jcmc/zmz026",
      "doi": ""
    },
    {
      "text": "Asbjørn Følstad, Petter Bae Brandtzaeg, Tom Feltwell, Effie L. C. Law, Manfred Tscheligi, and Ewa A. Luger. 2018. SIG: Chatbots for social good. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM Inc., New York, NY, 1-4. https://doi.org/10.1145/3170427.3185372",
      "doi": ""
    },
    {
      "text": "Linett Simonsen, Tina Steinstø, Guri Verne, and Tone Bratteteig. 2020. \"I'm disabled and married to a foreign single mother.\" Public service chatbot's advice on citizens' complex lives. In Hofmann, S. (Eds.) Electronic Participation. ePart 2020 (pp 133-146). Lecture Notes in Computer Science, Vol. 12220. Springer-Verlag, New York, NY. https://doi-org-443.webvpn.fjmu.edu.cn/10.1007/978-3-030-58141-1_11",
      "doi": ""
    },
    {
      "text": "Asbjørn Følstad and Petter Bae Brandtzæg. 2017. Chatbots and the new world of HCI. Interactions 24, 4 (Jul. 2017), 38-42. DOI: https://doi.org/10.1145/3085558",
      "doi": "10.1145/3085558"
    },
    {
      "text": "Sidney Cobb. 1976. Social support as a moderator of life stress. Psychosom. Med. 38, 5 (Oct. 1976), 300-314. DOI: https://doi.org/10.1097/00006842-197609000-00003",
      "doi": ""
    },
    {
      "text": "Sheldon Ed Cohen and S. L. Syme. 1985. Social Support and Health. Academic Press, Orlando",
      "doi": ""
    },
    {
      "text": "Nan Lin, Xiaolan Ye, and Walter M. Ensel. 1999. Social support and depressed mood: A structural analysis. J. Health Soc. Behav. 4, 4 (Dec. 1999), 344-359. DOI: https://doi.org/10643160",
      "doi": ""
    },
    {
      "text": "Ellen Selkie, Victoria Adkins, Ellie Masters, Anita Bajpai, and Daniel Shumer. 2020. Transgender adolescents’ uses of social media for social support. J. Adolesc. Health. 66, 3 (Mar. 2020), 275–280. DOI: https://doi.org/10.1016/j.jadohealth.2019.08.011",
      "doi": ""
    },
    {
      "text": "James S. House, Robert L. Kahn, J.D. Mcleod, and D. Williams. 1985. Measures and concepts of social support. In Cohen, S. & Syme, S.L. (Eds.), Social Support and Health (pp. 83–108). Academic, New York, NY.",
      "doi": ""
    },
    {
      "text": "James S. House. 1987. Social support and social structure. Sociological Forum 2, 1 (Dec. 1987), 135–146. DOI: https://doi.org/10.1007/BF01107897",
      "doi": ""
    },
    {
      "text": "Robert D. Putnam. 2000. Bowling Alone: The Collapse and Revival of American Community. Simon & Schuster, New York, NY.",
      "doi": ""
    },
    {
      "text": "Jeffrey Jensen Arnett. 2000. Emerging adulthood: A theory of development from the late teens through the twenties. Am. Psychol. 55, 5 (May 2000), 469–480. DOI: https://doi.org/10.1037/0003-066X.55.5.469",
      "doi": ""
    },
    {
      "text": "Alize J. Ferrari, Fiona J. Charlson, Rosana E. Norman, Scott B. Patten, Greg Freedman, Christopher J. L. Murray, Theo Vos, and Harvey A. Whiteford. 2013. Burden of depressive disorders by country, sex, age, and year: findings from the global burden of disease study 2010. PLoS Med. 10, 11 (Nov 2013), e1001547. DOI: https://doi.org/10.1371/journal.pmed.1001547",
      "doi": ""
    },
    {
      "text": "Harvey A. Whiteford, Louisa Degenhardt, Jürgen Rehm, Amanda J. Baxter, Alize J. Ferrari, Holly E. Erskine, Fiona J. Charlson, Rosana E. Norman, Abraham D. Flaxman, and Nicole Johns. 2013. Global burden of disease attributable to mental and substance use disorders: Findings from the Global Burden of Disease Study 2010. Lancet 382, 9904 (Nov. 2013) 1575–1586. DOI: https://doi.org/10.1016/S0140-6736(13)61611-6",
      "doi": ""
    },
    {
      "text": "Richard J. Hazler and Sharon A. Denham. 2011. Social isolation of youth at risk: Conceptualizations and practical implications. J. Couns. Dev. 4 (Dec. 2011), 403–409. DOI: https://doi.org/10.1002/j.1556-6678.2002.tb00206.x",
      "doi": ""
    },
    {
      "text": "Julia Kim-Cohen, Avshalom Caspi, Terrie E. Moffitt, Honalee Harrington, Barry J. Milne, and Richie Poulton. 2003. Prior juvenile diagnoses in adults with mental disorder: Developmental follow-back of a prospective-longitudinal cohort. Arch. Gen. Psychiatry. 60, 7 (Jul. 2003), 709–717. DOI: https://doi.org/10.1001/archpsyc.60.7.709",
      "doi": ""
    },
    {
      "text": "Randy P. Auerbach, Philippe Mortier, Ronny Bruffaerts, Jordi Alonso, Corina Benjet, Pim Cuijpers, Koen Demyttenaere, David D. Ebert, Jennifer Greif Green, and Penelope Hasking. 2018. WHO World Mental Health Surveys International College Student Project: Prevalence and distribution of mental disorders. J. Abnorm. Psychol. 127, 7 (Oct. 2018), 623–638. DOI: https://doi.org/10.1037/abn0000362",
      "doi": ""
    },
    {
      "text": "Shelley E. Taylor. 2011. Social support: A review. In Friedman, H. S. (Ed.).The Oxford Handbook of Health Psychology (pp. 189–214). Oxford University Press, New York, NY",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2017. Sensitive self-disclosures, responses, and social support on Instagram: The case of# depression. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW’2017). ACM Inc., New York, NY, 1485–1500. https://doi.org/10.1145/2998181.2998243",
      "doi": "10.1145/2998181.2998243"
    },
    {
      "text": "Eline Frison and Steven Eggermont. 2020. Toward an integrated and differential approach to the relationships between loneliness, different types of Facebook use, and adolescents’ depressed mood. Commun. Res. 47, 5 (Dec. 2015), 701–728. DOI: https://doi.org/10.1177/0093650215617506",
      "doi": ""
    },
    {
      "text": "Marsha White and Steve M. Dorman. 2001. Receiving social support online: implications for health education. Health Educ. Res. 16, 6 (Dec. 2001), 693–707. DOI: https://doi.org/10.1093/her/16.6.693",
      "doi": ""
    },
    {
      "text": "Per E. Kummervold, Deede Gammon, Svein Bergvik, Jan-Are K. Johnsen, Toralf Hasvold, and Jan H. Rosenvinge. 2002. Social support in a wired world: Use of online mental health forums in Norway. Nord. J. Psychiatry 56, 1 (Jul. 2009), 59–65. DOI: https://doi.org/10.1080/08039480252803945",
      "doi": ""
    },
    {
      "text": "Claudette Pretorius, Derek Chambers, and David Coyle. 2019. Young people's online help-seeking and mental health difficulties: Systematic narrative review. J. Medical Internet Res. 21, 11 (Nov. 2019), e13873. DOI: https://doi.org/10.2196/13873",
      "doi": ""
    },
    {
      "text": "Cristina M Pulido, Laura Ruiz-Eugenio, Gisela Redondo-Sama, and Beatriz Villarejo-Carballido. 2020. A new application of social impact in social media for overcoming fake news in health. Int. J. Environ. Res. Public Health. 17, 7 (Mar. 2020), 2430. DOI: https://doi.org/10.3390/ijerph17072430",
      "doi": ""
    },
    {
      "text": "Catrin Sohrabi, Zaid Alsafi, Niamh O'neill, Mehdi Khan, Ahmed Kerwan, Ahmed Al-Jabir, Christos Iosifidis, and Riaz Agha. 2020. World Health Organization declares global emergency: A review of the 2019 novel coronavirus (COVID-19). Int. J. Surg. 76 (Apr. 2020), 71–76. DOI: https://doi.org/10.1016/j.ijsu.2020.02.034",
      "doi": ""
    },
    {
      "text": "Sylvia Deidre Kauer, Cheryl Mangan, and Lena Sanci. 2014. Do online mental health services improve help-seeking for young people? A systematic review. J. Medical Internet Res. 16, 3 (Mar. 2014), e66. DOI: https://doi.org/10.2196/jmir.3103",
      "doi": ""
    },
    {
      "text": "Victoria Rideout and Susannah Fox. 2018. Digital health practices, social media use, and mental well-being among teens and young adults in the US. Articles, Abstracts, and Reports 1093, 96 pages. Retrieved May 27, 2020 from https://digitalcommons.psjhealth.org/publications/1093",
      "doi": ""
    },
    {
      "text": "Eline Frison and Steven Eggermont. 2015. The impact of daily stress on adolescents’ depressed mood: The role of social support seeking through Facebook. ? Comput. Hum. Behav. 44, 11 (Mar. 2015), 315–325. DOI: https://doi.org/10.1016/j.chb.2014.11.070",
      "doi": "10.1016/j.chb.2014.11.070"
    },
    {
      "text": "Paula Klemm, Melanie Hurst, Sandra L. Dearholt, and Susan R. Trone. 1999. Gender differences on Internet cancer support groups. Comp. Nurs. 17, 2 (Mar, 1999), 65–72. Retrieved June 27, 2020 from https://pubmed.ncbi.nlm.nih.gov/10194883/",
      "doi": ""
    },
    {
      "text": "Ulrike Pfeil, Panayiotis Zaphiris, and Stephanie Wilson. 2009. Older adults’ perceptions and experiences of online social support. Interact. Comput. 21, 3 (Jul. 2009), 159–172. DOI: https://doi.org/10.1016/j.intcom.2008.12.001",
      "doi": "10.1016/j.intcom.2008.12.001"
    },
    {
      "text": "Norman H. Nie. 2001. Sociability, interpersonal relations, and the Internet: Reconciling conflicting findings. Am Behav Sci. 45, 3 (Nov. 2001), 420–435. DOI: https://doi.org/10.1177/00027640121957277",
      "doi": ""
    },
    {
      "text": "Petter Bae Brandtzæg. 2012. Social networking sites: Their users and social implications—A longitudinal study. J. Comput.-Mediat. Commun.17, 4 (Sept. 2012), 467–488. DOI: https://doi.org/10.1111/j.1083-6101.2012.01580.x",
      "doi": "10.1111/j.1083-6101.2012.01580.x"
    },
    {
      "text": "Candice L Odgers and Michaeline R Jensen. 2020. Annual Research Review: Adolescent mental health in the digital age: Facts, fears, and future directions. J Child Psychol Psychiatry. 61, 3 (Jan. 2020), 336–348. DOI: https://doi.org/10.1111/jcpp.13190",
      "doi": ""
    },
    {
      "text": "David A. Cole, Elizabeth A. Nick, Rachel L. Zelkowitz, Kathryn M. Roeder, and Tawny Spinelli. 2017. Online social support for young people: Does it recapitulate in-person social support; can it help? Comput. Hum. Behav. 68, 3 (Mar. 2017), 456–464. DOI: https://doi.org/10.1016/j.chb.2016.11.058",
      "doi": "10.1016/j.chb.2016.11.058"
    },
    {
      "text": "Barry Wellman and Keith Hampton. 1999. Living networked on and offline. Contemp Sociol. 28, 6 (Nov. 1999), 648–654. DOI: https://doi.org/10.2307/2655535",
      "doi": ""
    },
    {
      "text": "Xing Zhang, Shan Liu, Xing Chen, Lin Wang, Baojun Gao, and Qing Zhu. 2018. Health information privacy concerns, antecedents, and information disclosure intention in online health communities. Inf. Manag. 55, 4 (Jun. 2018), 482–493. DOI: https://doi.org/10.1016/j.im.2017.11.003",
      "doi": ""
    },
    {
      "text": "Minha Lee, Sander Ackermans, Nena Van As, Hanwen Chang, Enzo Lucas, and Wijnand Ijsselsteijn. 2019. Caring for Vincent: A chatbot for self-compassion. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI’19), ACM Inc., New York, NY, 1–13. https://doi.org/10.1145/3290605.3300932",
      "doi": "10.1145/3290605.3300932"
    },
    {
      "text": "Kathleen Kara Fitzpatrick, Alison Darcy, and Molly Vierhile. 2017. Delivering cognitive behavior therapy to young adults with symptoms of depression and anxiety using a fully automated conversational agent (Woebot): A randomized controlled trial. JMIR Mental Health 4, 2 (Apr. 2017), e19. DOI: https://doi.org/10.2196/mental.7785",
      "doi": ""
    },
    {
      "text": "Mauro De Gennaro, Eva G. Krumhuber, and Gale Lucas. 2020. Effectiveness of an empathic chatbot in combating adverse effects of social exclusion on mood. Front. Psychol. 10 (Jan. 2020), Article 3061, 14 pages. DOI: https://doi.org/10.3389/fpsyg.2019.03061",
      "doi": ""
    },
    {
      "text": "Naomi Aoki. 2020. An experimental study of public trust in AI chatbots in the public sector. Gov Inf Q. 37, 4 (Oct. 2020), 101490. DOI: https://doi.org/10.1016/j.giq.2020.101490",
      "doi": ""
    },
    {
      "text": "Junhan Kim, Yoojung Kim, Byungjoon Kim, Sukyung Yun, Minjoon Kim, and Joongseek Lee. 2018. Can a machine tend to teenagers’ emotional needs? A study with conversational agents. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, ACM Inc., New York, NY, 1–6. https://doi.org/10.1145/3170427.3188548",
      "doi": "10.1145/3170427.3188548"
    },
    {
      "text": "Ashish Viswanath Prakash and Saini Das. 2020. Intelligent conversational agents in mental healthcare services: A thematic analysis of user perceptions. Pacific Asia Journal of the Association for Information Systems 12, 2 (June 2020), Article 1. DOI: https://doi.org/10.17705/1pais.12201",
      "doi": ""
    },
    {
      "text": "Nan Hu, Paul A. Pavlou, and Jennifer Zhang. 2006. Can online reviews reveal a product's true quality? Empirical findings and analytical modeling of online word-of-mouth communication. In Proceedings of the 7th ACM conference on Electronic commerce. ACM Inc., New York, NY, 324–330. https://doi.org/10.1145/1134707.1134743",
      "doi": ""
    },
    {
      "text": "Lise Tevik Løvseth and Olaf G Aasland. 2010. Confidentiality as a barrier to social support: A cross-sectional study of Norwegian emergency and human service workers. Int. J. Stress Manag. 17, 3 (Mar. 2010), 214–231. DOI: https://doi.org/10.1037/a0018904",
      "doi": ""
    },
    {
      "text": "Qian Yu, Tonya Nguyen, Soravis Prakkamakul, and Niloufar Salehi. 2019. “I almost fell in love with a machine”: Speaking with computers affects self-disclosure. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI’19). ACM Inc., New York, NY, 1–6. https://doi.org/10.1145/3290607.3312918",
      "doi": "10.1145/3290607.3312918"
    },
    {
      "text": "Yi-Chieh Lee, Naomi Yamashita, Yun Huang, and Wai Fu. 2020. “I hear you, I feel you”: Encouraging deep self-disclosure through a chatbot. In Proceedings of the 2020 CHI conference on human factors in computing systems. ACM Inc., New York, NY, 1–12. https://doi.org/10.1145/3313831.3376175",
      "doi": "10.1145/3313831.3376175"
    },
    {
      "text": "Nancy L Collins and Lynn Carol Miller. 1994. Self-disclosure and liking: A meta-analytic review. Psychological Bulletin 116, 3 (Apr. 1994), 457–475. DOI: https://doi.org/10.1037/0033-2909.116.3.457",
      "doi": ""
    },
    {
      "text": "Renwen Zhang. 2017. The stress-buffering effect of self-disclosure on Facebook: An examination of stressful life events, social support, and mental health among college students. Comput. Hum. Behav. 75, 10 (May 2020), 527–537. DOI: https://doi.org/10.1016/j.chb.2017.05.043",
      "doi": "10.1016/j.chb.2017.05.043"
    },
    {
      "text": "Pratyusha Kalluri. 2020. Don't ask if artificial intelligence is good or fair, ask how it shifts power. Nature 583, (July 2020), 7815. DOI: https://doi.org/10.1038/d41586-020-02003-2",
      "doi": ""
    },
    {
      "text": "Jessica Vitak and Nicole B. Ellison. 2013. ‘There's a network out there you might as well tap’: Exploring the benefits of and barriers to exchanging informational and support-based resources on Facebook. New Media Soc. 15, 2 (July 2012), 243–259. DOI: https://doi.org/10.1177/1461444812451566",
      "doi": ""
    },
    {
      "text": "Petter Bae Brandtzaeg, Antoine Pultier, and Gro Mette Moen. 2019. Losing control to data-hungry apps: A mixed-methods approach to mobile app privacy. Soc. Sci. Comput. Rev. 37, 4 (May 2018) 466–488. DOI: https://doi.org/10.1177/0894439318777706",
      "doi": "10.1177/0894439318777706"
    },
    {
      "text": "Adam N. Joinson. 2008. Looking at, looking up or keeping up with people? Motives and use of Facebook. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems (CHI’08). ACM Inc., New York, NY, 1027–1036. https://doi.org/10.1145/1357054.1357213",
      "doi": "10.1145/1357054.1357213"
    },
    {
      "text": "Petter Bae Brandtzæg, Jan Heim, and Amela Karahasanović. 2011. Understanding the new digital divide—A typology of Internet users in Europe. Int. J. Hum. Comput. Stud. 69, 3 (Mar. 2011), 123–138. DOI: https://doi.org/10.1016/j.ijhcs.2010.11.004",
      "doi": ""
    },
    {
      "text": "Bryan Marshall, Peter Cardon, Amit Poddar, and Renee Fontenot. 2013. Does sample size matter in qualitative research?: A review of qualitative interviews in IS research. J. Comput. Inf. Syst. 54, 1 (Dec. 2015), 11–22. DOI: https://doi.org/10.1080/08874417.2013.11645667",
      "doi": ""
    },
    {
      "text": "Glenn A. Bowen. 2008. Naturalistic inquiry and the saturation concept: A research note. Qual. Research 8, 1 (Feb. 2018), 137–152. DOI: https://doi.org/10.1177/1468794107085301",
      "doi": ""
    },
    {
      "text": "Douglas Ezzy. 2013. Qualitative Analysis. Routledge. New York, NY.",
      "doi": ""
    },
    {
      "text": "Amanda L. Forest and Joanne V. Wood. 2012. When social networking is not working: Individuals with low self-esteem recognize but do not reap the benefits of self-disclosure on Facebook. Psychol. Sci. 23, 3 (Feb. 2012), 295–302. DOI: https://doi.org/10.1177/0956797611429709",
      "doi": ""
    },
    {
      "text": "Sherry Turkle. 2011. Alone Together: Why We Expect More from Technology and Less from Each Other. Basic Books, New York, NY.",
      "doi": "10.5555/1972496"
    },
    {
      "text": "Curtis D. Hardin and Terri Conley. 2001. A relational approach to cognition: Shared experience and relationship affirmation in social cognition. In Hardin, C. D., Conley, T. D., & Moskowitz, G. B. (Eds.), Cognitive SocialPsychology: The Princeton Symposium on the Legacy and Future of Social Cognition (pp. 3–17). Lawrence Erlbaum Associates Publishers, Mahwah, NJ.",
      "doi": ""
    },
    {
      "text": "Marita Skjuve and Petter Bae Brandzaeg. 2019. Measuring user experience in chatbots: An approach to interpersonal communication competence. In Bodrunova, S. (Eds.) Internet Science. INSCI 2018. Lecture Notes in Computer Science, Vol. 11551. Springer, Cham. https://doi.org/10.1007/978-3-030-17705-8_10",
      "doi": ""
    }
  ]
}