{
  "doi": "10.1145/3411764.3445284",
  "title": "People May Punish, But Not Blame Robots",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "As robots may take a greater part in our moral decision-making processes, whether people hold them accountable for moral harm becomes critical to explore. Blame and punishment signify moral accountability, often involving emotions. We quantitatively looked into people’s willingness to blame or punish an emotional vs. non-emotional robot that admits to its wrongdoing. Studies 1 and 2 (online video interaction) showed that people may punish a robot due to its lack of perceived emotional capacity than its perceived agency. Study 3 (in the lab) demonstrated that people were neither willing to blame nor punish the robot. Punishing non-emotional robots seems more likely than blaming them, yet punishment towards robots is more likely to arise online than offline. We reflect on if and why victimized humans (and those who care for them) may seek out retributive justice against robot scapegoats when there are no humans to hold accountable for moral harm.",
  "tags": [
    "punishment",
    "morality",
    "human-robot interaction",
    "Blame",
    "robots",
    "retributive justice",
    "retribution gap",
    "responsibility gap"
  ],
  "authors": [
    {
      "name": "Minha Lee",
      "institution": "Industrial Design, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365787",
      "orcid": "missing"
    },
    {
      "name": "Peter Ruijten",
      "institution": "Human-Technology Interaction, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558243656",
      "orcid": "missing"
    },
    {
      "name": "Lily Frank",
      "institution": "Philosophy and Ethics, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659207457",
      "orcid": "missing"
    },
    {
      "name": "Yvonne de Kort",
      "institution": "Human Technology Interaction, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100272468",
      "orcid": "missing"
    },
    {
      "name": "Wijnand IJsselsteijn",
      "institution": "Human Technology Interaction, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100032008",
      "orcid": "0000-0001-6856-9269"
    }
  ],
  "references": [
    {
      "text": "Arthur Aron, Elaine N Aron, and Danny Smollan. 1992. Inclusion of other in the self scale and the structure of interpersonal closeness. Journal of Personality and Social Psychology 63, 4(1992), 596–612.",
      "doi": ""
    },
    {
      "text": "Christoph Bartneck and Merel Keijsers. 2020. The morality of abusing a robot. Paladyn, Journal of Behavioral Robotics 11, 1 (2020), 271–283.",
      "doi": ""
    },
    {
      "text": "Iris Bohnet and Bruno S Frey. 1999. Social distance and other-regarding behavior in dictator games: Comment. American Economic Review 89, 1 (1999), 335–339.",
      "doi": ""
    },
    {
      "text": "Kevin M Carlsmith, John M Darley, and Paul H Robinson. 2002. Why do we punish? Deterrence and just deserts as motives for punishment. Journal of Personality and Social Psychology 83, 2(2002), 284.",
      "doi": ""
    },
    {
      "text": "Andreas Brekke Carlsson. 2017. Blameworthiness as deserved guilt. The Journal of Ethics 21, 1 (2017), 89–115.",
      "doi": ""
    },
    {
      "text": "Mark Coeckelbergh. 2009. Virtual moral agency, virtual moral responsibility: on the moral significance of the appearance, perception, and performance of artificial agents. AI & Society 24, 2 (2009), 181–189.",
      "doi": "10.1007/s00146-009-0208-3"
    },
    {
      "text": "John Danaher. 2016. Robots, law and the retribution gap. Ethics and Information Technology 18, 4 (2016), 299–309.",
      "doi": "10.1007/s10676-016-9403-3"
    },
    {
      "text": "John Danaher. 2019. Welcoming Robots into the Moral Circle: A Defence of Ethical Behaviourism. Science and Engineering Ethics(2019), 1–27.",
      "doi": ""
    },
    {
      "text": "Stephen Darwall. 2004. Respect and the second-person standpoint. In Proceedings and Addresses of the American Philosophical Association, Vol. 78. JSTOR, 43–59.",
      "doi": ""
    },
    {
      "text": "Celso M de Melo and Jonathan Gratch. 2015. People show envy, not guilt, when making decisions with machines. In 2015 International Conference on Affective Computing and Intelligent Interaction (ACII). IEEE, 315–321.",
      "doi": "10.1109/ACII.2015.7344589"
    },
    {
      "text": "Daniel Dennett. 2009. Darwin’s “strange inversion of reasoning”. Proceedings of the National Academy of Sciences 106, Supplement 1(2009), 10061–10065.",
      "doi": ""
    },
    {
      "text": "Daniel C Dennett. 2017. From bacteria to Bach and back: The evolution of minds. WW Norton & Company.",
      "doi": ""
    },
    {
      "text": "Antony Duff and Zachary Hoskins. 2017. Legal Punishment. Stanford Encyclopedia of Philosophy (Jul 2017). https://plato.stanford.edu/entries/legal-punishment/PosRetMeaDes (Accessed on 12/23/2020).",
      "doi": ""
    },
    {
      "text": "Robin Antony Duff. 2003. Probation, punishment and restorative justice: Should Al Turism be engaged in punishment?The Howard Journal of Criminal Justice 42, 2 (2003), 181–197.",
      "doi": ""
    },
    {
      "text": "Luciano Floridi and Jeff W Sanders. 2004. On the morality of artificial agents. Minds and Machines 14, 3 (2004), 349–379.",
      "doi": "10.1023/B%3AMIND.0000035461.63578.9d"
    },
    {
      "text": "Philippa Foot. 1967. The problem of abortion and the doctrine of double effect. Oxford Review 5(1967).",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 2012 [1975]. Discipline and punish: The birth of the prison. Vintage.",
      "doi": ""
    },
    {
      "text": "Miranda Fricker. 2016. What’s the point of blame? A paradigm based explanation. Noûs 50, 1 (2016), 165–183.",
      "doi": ""
    },
    {
      "text": "Caleb Furlough, Thomas Stokes, and Douglas J Gillan. 2019. Attributing Blame to Robots: I. The Influence of Robot Autonomy. Human Factors (2019), 1–11.",
      "doi": ""
    },
    {
      "text": "Geoffrey P Goodwin, Jared Piazza, and Paul Rozin. 2014. Moral character predominates in person perception and evaluation.Journal of Personality and Social Psychology 106, 1(2014), 148–168.",
      "doi": ""
    },
    {
      "text": "Heather M Gray, Kurt Gray, and Daniel M Wegner. 2007. Dimensions of mind perception. science 315, 5812 (2007), 619–619.",
      "doi": ""
    },
    {
      "text": "Kurt Gray, Chelsea Schein, and Adrian F Ward. 2014. The myth of harmless wrongs in moral cognition: Automatic dyadic completion from sin to suffering.Journal of Experimental Psychology: General 143, 4 (2014), 1600.",
      "doi": ""
    },
    {
      "text": "Kurt Gray, Liane Young, and Adam Waytz. 2012. Mind perception is the essence of morality. Psychological inquiry 23, 2 (2012), 101–124.",
      "doi": ""
    },
    {
      "text": "Jonathan Haidt. 2003. The moral emotions. In Series in Affective Science. Handbook of Affective Sciences, & H. H. Goldsmit R. J. Davidson, K. R. Scherer (Ed.). Vol. 11. Oxford University Press, 852–870.",
      "doi": ""
    },
    {
      "text": "Francis Hutcheson. 2008 [1725]. An Inquiry into the Original of Our Ideas of Beauty and Virtue: In Two Treatises. Liberty Fund.",
      "doi": ""
    },
    {
      "text": "David O Johnson and Raymond H Cuijpers. 2019. Investigating the effect of a humanoid robot’s head position on imitating human emotions. International Journal of Social Robotics 11, 1 (2019), 65–74.",
      "doi": ""
    },
    {
      "text": "Merel Keijsers and Christoph Bartneck. 2018. Mindless Robots Get Bullied. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (Chicago, IL, USA) (HRI ’18). Association for Computing Machinery, New York, NY, USA, 205–214.",
      "doi": "10.1145/3171221.3171266"
    },
    {
      "text": "Mansur Khamitov, Jeff D Rotman, and Jared Piazza. 2016. Perceiving the agency of harmful agents: A test of dehumanization versus moral typecasting accounts. Cognition 146(2016), 33–47.",
      "doi": ""
    },
    {
      "text": "Taemie Kim and Pamela Hinds. 2006. Who should I blame? Effects of autonomy and transparency on attributions in human-robot interaction. In 15th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 80–85.",
      "doi": ""
    },
    {
      "text": "Joshua Knobe. 2003. Intentional action and side effects in ordinary language. Analysis 63, 3 (2003), 190–194.",
      "doi": ""
    },
    {
      "text": "Takanori Komatsu. 2016. How do people judge moral wrongness in a robot and in its designers and owners regarding the consequences of the robot’s behaviors?. In 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 1168–1171.",
      "doi": "10.1109/ROMAN.2016.7745256"
    },
    {
      "text": "Minha Lee, Gale Lucas, and Jonathan Gratch. 2021. Comparing mind perception in strategic exchanges: Human-agent negotiation, dictator and ultimatum games. Journal of Multimodal User Interfaces. In press (2021), 1–15.",
      "doi": ""
    },
    {
      "text": "Minha Lee, Gale Lucas, Johnathan Mell, Emmanuel Johnson, and Jonathan Gratch. 2019. What’s on Your Virtual Mind? Mind Perception in Human-Agent Negotiations. In Proceedings of the 19th ACM International Conference on Intelligent Virtual Agents (Paris, France) (IVA ’19). Association for Computing Machinery, New York, NY, USA, 38–45.",
      "doi": "10.1145/3308532.3329465"
    },
    {
      "text": "Daniel T Levin, Stephen S Killingsworth, Megan M Saylor, Stephen M Gordon, and Kazuhiko Kawamura. 2013. Tests of concepts about different kinds of minds: Predictions about the behavior of computers, robots, and people. Human–Computer Interaction 28, 2 (2013), 161–191.",
      "doi": ""
    },
    {
      "text": "Bertram F. Malle, Matthias Scheutz, Thomas Arnold, John Voiklis, and Corey Cusimano. 2015. Sacrifice One For the Good of Many? People Apply Different Moral Norms to Human and Robot Agents. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction (Portland, Oregon, USA) (HRI ’15). Association for Computing Machinery, New York, NY, USA, 117–124.",
      "doi": "10.1145/2696454.2696458"
    },
    {
      "text": "Andreas Matthias. 2004. The responsibility gap: Ascribing responsibility for the actions of learning automata. Ethics and Information Technology 6, 3 (2004), 175–183.",
      "doi": "10.1007/s10676-004-3422-1"
    },
    {
      "text": "Daniel McDermott. 2001. The permissibility of punishment. Law and Philosophy 20, 4 (2001), 403–432.",
      "doi": ""
    },
    {
      "text": "Robert M McFatter. 1978. Sentencing strategies and justice: Effects of punishment philosophy on sentencing decisions.Journal of Personality and Social Psychology 36, 12(1978), 1490–1500.",
      "doi": ""
    },
    {
      "text": "Catrin Misselhorn. 2015. Collective agency and cooperation in natural and artificial systems. In Collective Agency and Cooperation in Natural and Artificial Systems, Catrin Misselhorn (Ed.). Springer, 3–24.",
      "doi": ""
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R. Tauber. 1994. Computers Are Social Actors. In Conference Companion on Human Factors in Computing Systems (Boston, Massachusetts, USA) (CHI ’94). Association for Computing Machinery, New York, NY, USA, 204.",
      "doi": "10.1145/259963.260288"
    },
    {
      "text": "Sven Nyholm. 2018. Attributing agency to automated systems: Reflections on human–robot collaborations and responsibility-loci. Science and Engineering Ethics 24, 4 (2018), 1201–1219.",
      "doi": ""
    },
    {
      "text": "Sven Nyholm. 2020. Humans and robots: Ethics, agency, and anthropomorphism. Rowman & Littlefield Publishers.",
      "doi": ""
    },
    {
      "text": "Yohsuke Ohtsubo. 2007. Perceived intentionality intensifies blameworthiness of negative behaviors: Blame-praise asymmetry in intensification effect. Japanese Psychological Research 49, 2 (2007), 100–110.",
      "doi": ""
    },
    {
      "text": "Jesse Prinz. 2008. Is morality innate?In Moral psychology. The evolution of morality: Adaptations and innateness, Walter Sinnott-Armstrong (Ed.). Vol. 1. MIT Press Cambridge, 367–406.",
      "doi": ""
    },
    {
      "text": "Byron Reeves and Clifford Ivar Nass. 1996. The media equation: How people treat computers, television, and new media like real people and places.Cambridge University Press.",
      "doi": "10.5555/236605"
    },
    {
      "text": "Beat Rossmy, Sarah Theres Völkel, Elias Naphausen, Patricia Kimm, Alexander Wiethoff, and Andreas Muxel. 2020. Punishable AI: Examining Users’ Attitude Towards Robot Punishment. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 179–191.",
      "doi": "10.1145/3357236.3395542"
    },
    {
      "text": "P. Salvini, G. Ciaravella, W. Yu, G. Ferri, A. Manzi, B. Mazzolai, C. Laschi, S. R. Oh, and P. Dario. 2010. How safe are service robots in urban environments? Bullying a robot. In 19th International Symposium in Robot and Human Interactive Communication (ROMAN). 1–7.",
      "doi": ""
    },
    {
      "text": "Thomas Michael Scanlon. 2013. Interpreting blame. In Blame. Its nature and norms, D. Justin Coates and Neal A. Tognazzini (Eds.). 84–99.",
      "doi": ""
    },
    {
      "text": "Simone Schnall, Jonathan Haidt, Gerald L Clore, and Alexander H Jordan. 2008. Disgust as embodied moral judgment. Personality and social psychology bulletin 34, 8 (2008), 1096–1109.",
      "doi": ""
    },
    {
      "text": "David Shoemaker. 2013. Blame and punishment. Blame: Its nature and norms(2013), 100–118.",
      "doi": ""
    },
    {
      "text": "Elaine Short, Justin Hart, Michelle Vu, and Brian Scassellati. 2010. No fair!! an interaction with a cheating robot. In 2010 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, 219–226.",
      "doi": ""
    },
    {
      "text": "Eva EA Skoe, Nancy Eisenberg, and Amanda Cumberland. 2002. The role of reported emotion in real-life and hypothetical moral dilemmas. Personality and Social Psychology Bulletin 28, 7 (2002), 962–973.",
      "doi": ""
    },
    {
      "text": "Robert Sparrow. 2007. Killer robots. Journal of Applied Philosophy 24, 1 (2007), 62–77.",
      "doi": ""
    },
    {
      "text": "Peter Frederick Strawson. 2008 [1963]. Freedom and resentment and other essays. Routledge.",
      "doi": ""
    },
    {
      "text": "Judith Jarvis Thomson. 1976. Killing, letting die, and the trolley problem. The Monist 59, 2 (1976), 204–217.",
      "doi": ""
    },
    {
      "text": "John Voiklis, Boyoung Kim, Corey Cusimano, and Bertram F Malle. 2016. Moral judgments of human vs. robot agents. In 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 775–780.",
      "doi": "10.1109/ROMAN.2016.7745207"
    }
  ]
}