{
  "doi": "10.1145/3411764.3445363",
  "title": "The Ethics of Multiplayer Game Design and Community Management: Industry Perspectives and Challenges",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Game industry professionals are frequently implementing new methods of addressing ethical issues related to in-game toxicity and disruptive player behaviours associated with online multiplayer games. However, academic work on these behaviours tends to focus on the perspectives of players rather than the industry. To fully understand the ethics of multiplayer games and promote ethical design, we must examine the challenges facing those designing multiplayer games through an ethical lens. To this end, this paper presents a reflexive thematic analysis of 21 in-depth interviews with games industry professionals on their ethical views and experiences in game design and community management. We identify a number of tensions involved in making ethics-related design decisions for divided player communities alongside current game design practices that are concerned with functionality, revenue and entertainment. We then put forward a set of design considerations for integrating ethics into multiplayer game design.",
  "authors": [
    {
      "name": "Lucy A. Sparrow",
      "institution": "School of Computing and Information Systems The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659495931",
      "orcid": "missing"
    },
    {
      "name": "Martin Gibbs",
      "institution": "School of Computing and Information Systems, The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100536739",
      "orcid": "0000-0002-1990-1955"
    },
    {
      "name": "Michael Arnold",
      "institution": "School of Historical and Philosophical Studies The University of Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406595579",
      "orcid": "0000-0002-5796-4578"
    }
  ],
  "references": [
    {
      "text": "Leigh Achterbosch, Charlynn Miller, and Peter Vamplew. 2013. Ganking, corpse camping and ninja looting from the perception of the MMORPG community: Acceptable behavior or unacceptable griefing? In Proceedings of the 9th Australasian Conference on Interactive Entertainment: Matters of Life and Death, ACM, New York, NY, 1–8. https://doi.org/10.1145/2513002.2513007",
      "doi": "10.1145/2513002.2513007"
    },
    {
      "text": "Sonam Adinolf and Selen Türkay. 2018. Toxic behaviors in Esports games: Player perceptions and coping strategies. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, New York, NY, 365–372. https://doi.org/10.1145/3270316.3271545",
      "doi": "10.1145/3270316.3271545"
    },
    {
      "text": "Burcu Bakioğlu. 2019. Lore of mayhem: Griefers and the radical deployment of spatial storytelling. Journal of Gaming & Virtual Worlds 11, 3, 231–250. doi:10.1386/jgvw.11.3.231_1",
      "doi": ""
    },
    {
      "text": "BBC News. 2018. Fortnite cheat YouTuber sued by Epic Games. Retrieved Sep 17, 2020 from https://www.bbc.com/news/technology-45876864",
      "doi": ""
    },
    {
      "text": "BBC News. 2019. EA games: Loot boxes aren't gambling, they're just like a Kinder egg. Retrieved Sep 18, 2020 from https://www.bbc.com/news/newsbeat-48701962",
      "doi": ""
    },
    {
      "text": "Matthew Beale, Megan McKittrick, and Daniel Richards. 2016. “Good” grief: Subversion, praxis, and the unmasked ethics of griefing guides. Technical Communication Quarterly 25, 3, 191–201. http://dx.doi.org/10.1080/10572252.2016.1185160",
      "doi": ""
    },
    {
      "text": "Elettra Bietti. 2020. From ethics washing to ethics bashing: A view on tech ethics from within moral philosophy. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency, ACM, New York, NY, 210–219. https://doi.org/10.1145/3351095.3372860",
      "doi": ""
    },
    {
      "text": "Jeremy Blackburn, Nicolas Kourtellis, and John Skvoretz. 2014. Cheating in online games: A social network perspective. ACM Transactions on Internet Technology, 13, 3, 9:1–9:25. http://dx.doi.org/10.1145/2602570",
      "doi": "10.1145/2602570"
    },
    {
      "text": "Frank G. Bosman. 2019. There is no solution!: “Wicked problems” in digital games. Games and Culture 14, 5, 543–559. https://doi.org/10.1177/1555412017716603",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology, 3, 2, 77–101. http://dx.doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health, 11, 4, 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "Virginia Braun, Victoria Clarke, Nikki Hayfield, and Gareth Terry. 2019. Thematic Analysis. In Handbook of Research Methods in Health Social Sciences, P. Liamputtong (ed.), 843–860. Springer Nature Singapore.",
      "doi": ""
    },
    {
      "text": "Richard Buchanan. 1992. Wicked problems in design thinking. Design Issues, 8, 2, 5–21.",
      "doi": ""
    },
    {
      "text": "Thorsten Busch, Kelly Boudreau, and Mia Consalvo. 2016. Toxic gamer culture, corporate regulation, and standards of behavior among players of online games. In Video game policy: Production, distribution, and consumption, S. Conway & J. deWinter (eds.), 176–190. Routledge. New York, NY.",
      "doi": ""
    },
    {
      "text": "Nicole Carpenter. 2019. Ubisoft suing hackers that sold ‘hundreds of thousands of dollars’ in Rainbow Six Siege cheats. Polygon. Retrieved Sep 17, 2020 from https://www.polygon.com/2019/10/24/20929739/",
      "doi": ""
    },
    {
      "text": "Marcus Carter. 2015. Massively multiplayer dark play: Treacherous play in EVE Online. In The Dark Side of Game Play: Controversial Issues in Playful Environments, T. Mortensen, J. Linderoth, & A. M. L. Brown (Eds.), 191–209. Routledge. New York.",
      "doi": ""
    },
    {
      "text": "Marcus Carter. 2020. Valuing play in Survivor: A constructionist approach to multiplayer games. Games and Culture 15, 4, 434–452. doi:10.1177/1555412018804327",
      "doi": ""
    },
    {
      "text": "Marcus Carter and Fraser Allison. 2018. Guilt in the zombie apocalypse. In Transgressive Games Aesthetics, K. Jorgensen & F. Karlsen (eds.), pp. 134-152. MIT Press. Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Marcus Carter, Martin Gibbs, and Michael Arnold. 2015. The demarcation problem in multiplayer games: Boundary-work in EVE Online's eSport. Games Studies, 15, 1. http://gamestudies.org/1501/articles/carter",
      "doi": ""
    },
    {
      "text": "Thomas Chesney, Iain Coyne, Brian Logan, and Neil Madden. 2009. Griefing in virtual worlds: Causes, casualties and coping strategies. Information Systems Journal, 19, 525–548. https://doi.org/10.1111/j.1365-2575.2009.00330.x",
      "doi": ""
    },
    {
      "text": "Peter Christiansen. 2017. Designing ethical systems for video games. In Proceedings of the 12th International Conference on the Foundations of Digital Games. ACM, New York, NY. http://dx.doi.org/10.1145/3102071.3102088",
      "doi": "10.1145/3102071.3102088"
    },
    {
      "text": "C. West Churchman. 1967. Wicked problems. Management Science, 14, 4, B141–B142.",
      "doi": "10.1287/mnsc.14.4.B141"
    },
    {
      "text": "Peter Allen Clark. 2019. What to know about Blizzard, Hong Kong and the controversy over politics in Esports. Time. Retrieved Sep 16, 2020 from https://time.com/5702971/blizzard-esports-hearthstone-hong-kong-protests-backlash-blitzchung/",
      "doi": ""
    },
    {
      "text": "Natalie Clayton. 2019. “Disruptive behaviour” dropped 40 per cent after Overwatch introduced endorsements. PC Games Insider. Retrieved 17 Sep, 2020 from https://www.pcgamesinsider.biz/news/68744",
      "doi": ""
    },
    {
      "text": "Mia Consalvo. 2005. Rule sets, cheating, and magic circles: Studying games and ethics. International Review of Information Ethics, 4, 7–12.",
      "doi": ""
    },
    {
      "text": "Mia Consalvo. 2007. Cheating: Gaining advantage in videogames. MIT Press. Cambridge, MA.",
      "doi": "10.5555/1202447"
    },
    {
      "text": "Mia Consalvo. 2009. There is no magic circle. Games and Culture, 4, 4, 408–417. doi:10.1177/1555412009343575",
      "doi": ""
    },
    {
      "text": "Mia Consalvo. 2012. Confronting toxic gamer culture: A challenge for feminist game studies scholars. Journal of Gender New Media and Technology, 1. http://dx.doi.org/10.7264/N33X84KH",
      "doi": ""
    },
    {
      "text": "Iain Coyne, Thomas Chesney, Brian Logan, and Neil Madden. 2009. Griefing in a virtual community: An exploratory survey of Second Life residents. Zeitschrift Für Psychologie / Journal of Psychology, 217, 4, 214–221. https://doi.org/10.1027/0044-3409.217.4.214",
      "doi": ""
    },
    {
      "text": "James Croft. 2011. “It's just a game”: Ethical reasoning within virtual worlds. GoodWork Project Report Series, 73. http://thegoodproject.org/pdf/73-Its-Just-a-Game.pdf",
      "doi": ""
    },
    {
      "text": "John Danaher. 2018. The law and ethics of virtual sexual assault. In Barfield, W. and Blitz, M. (Eds.), The Law of Virtual and Augmented Reality. Edward Elgar Publishers. Cheltenham, UK.",
      "doi": ""
    },
    {
      "text": "Julian Dibbell. 1998. A rape in cyberspace (or TINYSOCIETY, and how to make one). In My Tiny Life: Crime and Passion in a Virtual World (pp. 11–33). Henry Holt. New York. http://www.juliandibbell.com/articles/a-rape-in-cyberspace/",
      "doi": ""
    },
    {
      "text": "Draggles, Fearless, Bioluminescence and Scathlocke. 2018. Will Tribunal return? Nexus, League of Legends. Retrieved Sep 17, 2020 from https://nexus.leagueoflegends.com/en-au/2018/08/will-tribunal-return/",
      "doi": ""
    },
    {
      "text": "Jeff Dunn. 2012. Virtual worlds and moral evaluation. Ethics and Information Technology 14, 255–265. https://doi.org/10.1007/s10676-012-9298-6",
      "doi": "10.1007/s10676-012-9298-6"
    },
    {
      "text": "Andrea Flores and Carrie James. 2012. Morality and ethics behind the screen: Young people's perspectives on digital life. New Media and Society, 0, 1–19. https://doi.org/10.1177/1461444812462842",
      "doi": ""
    },
    {
      "text": "Gamasutra. 2020. Kitfox's Victoria Tran aims to kill toxic game communities with kindness. Retrieved 17 Sep, 2020 from https://www.gamasutra.com/view/news/358497",
      "doi": ""
    },
    {
      "text": "Martin Gibbs, Marcus Carter, Michael Arnold, and Bjørn Nansen. 2013. Serenity now bombs a World of Warcraft funeral: Negotiating the morality, reality and taste of online gaming practices. In Selected Papers of Internet Research, 14.0, Denver, USA. Retrieved Sep 17, 2020 from http://marcuscarter.com/wp-content/uploads/2014/05/AoIR-WoW-Funeral-Final.pdf",
      "doi": ""
    },
    {
      "text": "Geert Gooskens. 2010. The ethical status of virtual actions. Ethical Perspectives, 17, 1, 59–78. doi:10.2143/ep.17.1.2046957",
      "doi": ""
    },
    {
      "text": "Colin M. Gray and Shruthi Sai Chivukula. 2019. Ethical mediation in UX practice. In Proceedings of the CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 11 pages. https://doi.org/10.1145/3290605.3300408",
      "doi": ""
    },
    {
      "text": "Raiford Guins. 2015. Morality settings: New generation game systems and parental controls. Design Issues 31, 3, 55–65. doi:10.1162/DESI_a_00338",
      "doi": ""
    },
    {
      "text": "Eugen Harton. 2016. Once a cheat always a cheater: Gotta catch ‘em all. GDC Vault. Retrieved Sep 17, 2020 from https://www.gdcvault.com/play/1023193",
      "doi": ""
    },
    {
      "text": "Michael Heron and Pauline Belford. 2014. ‘It's only a game’: Ethics, empathy and identification in game morality systems. The Computer Games Journal 3, 1, 35–53. https://doi.org/10.1007/BF03392356",
      "doi": ""
    },
    {
      "text": "Jeroen van den Hoven, Pieter E. Vermaas, and Ibo van de Poel. 2015. Design for values: An introduction. In Handbook of ethics, values, and technological design, 1–7. Springer.",
      "doi": ""
    },
    {
      "text": "Chuck Huff, Deborah G. Johnson, and Keith Miller, K. 2003. Virtual harms and real responsibility. IEEE Technology and Society Magazine 22, 2, 12–19. https://doi.org/10.1109/MTAS.2003.1216238",
      "doi": ""
    },
    {
      "text": "Brendan Keogh. 2019. From aggressively formalized to intensely in/formalized: accounting for a wider range of videogame development practices. Creative Industries Journal, 12, 1, 14–33. https://doi.org/10.1080/17510694.2018.1532760",
      "doi": ""
    },
    {
      "text": "Aphra Kerr and John D. Kelleher. 2015. The recruitment of passion and community in the service of capital: Community managers in the digital games industry. Critical Studies in Media Communication, 13, 3, 177-192. https://doi.org/10.1080/15295036.2015.1045005",
      "doi": ""
    },
    {
      "text": "Christoph Klimmt, Hannah Schmid, Andreas Nosper, Tilo Hartmann, and Peter Vorderer. 2006. How players manage moral concerns to make video game violence enjoyable. Communications 31, 309–328. doi:10.1515/COMMUN.2006.020",
      "doi": ""
    },
    {
      "text": "Annakaisa Kultima. 2017. Multidisciplinary game design research. In Game design research: An introduction to theory and practice, P. Lankoski and J. Holopainen (eds.), 35–50. ETC Press.",
      "doi": ""
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, Seungyeop Han. 2015. Exploring cyberbullying and other toxic behavior in team competition online games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, 3739–3748. https://doi.org/10.1145/2702123.2702529",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Petri Lankoski and Jussi Holopainen. 2017. Game design research: An introduction to theory and practice. ETC Press.",
      "doi": ""
    },
    {
      "text": "Yannick LeJacq. 2015. How League of Legends enables toxicity. Kotaku. Retrieved 17 Sep, 2020 from https://www.kotaku.com.au/2015/03/how-league-of-legends-enables-toxicity/",
      "doi": ""
    },
    {
      "text": "Jeffrey Lin. 2013. The science behind shaping player behavior in online games. GDC Vault. Retrieved 17 Sep, 2020 from https://www.gdcvault.com/play/1017940/",
      "doi": ""
    },
    {
      "text": "Morgan Luck. 2009. Crashing a virtual funeral: Morality in MMORPGs. Journal of Information, Communication & Ethics in Society, 7, 4, 280–285. https://doi.org/10.1108/14779960911004516",
      "doi": ""
    },
    {
      "text": "James W. Malazita and Alexander Jenkins. 2017. Digital games and moral packaging: The impacts of in-game decisions on public pedagogical deliberation. Journal of Gaming & Virtual Worlds, 9, 1, 3–20. https://doi.org/10.1386/jgvw.9.1.3_1",
      "doi": ""
    },
    {
      "text": "Sean Martin. 2020. The night that might have killed Eve Echoes. Pocket Tactics. Retrieved Sep 17, 2020 from https://www.pockettactics.com/eve-echoes/autopilot",
      "doi": ""
    },
    {
      "text": "Alissa McAloon. 2018. To prevent toxicity, design games with community management in mind. Gamasutra. Retrieved 17 Sep, 2020 from https://www.gamasutra.com/view/news/315930",
      "doi": ""
    },
    {
      "text": "Brian Myers. 2017. Friends with benefits: Plausible optimism and the practice of teabagging in video games. Games and Culture. https://doi.org/10.1177/1555412017732855",
      "doi": ""
    },
    {
      "text": "Joaquim A. M. Neto, Kazuki M. Yokoyama, K. Becker. 2017. Studying toxic behavior influence and player chat in an online video game. In Proceedings of the International Conference on Web Intelligence 2017. ACM, New York, NY, 26–33. https://doi.org/10.1145/3106426.3106452",
      "doi": "10.1145/3106426.3106452"
    },
    {
      "text": "C. Thi Nguyen and José P. Zagal. 2016. Good violence, bad violence: The ethics of competition in multiplayer games. In Proceedings of the 1st International Joint Conference of DiGRA and FDG. Digital Games Research Association and Society for the Advancement of the Science of Digital Games, 1–16.",
      "doi": ""
    },
    {
      "text": "Casey O'Donnell. 2014. Developer's dilemma: The secret world of videogame creators. The MIT Press. Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Ashley Oh. 2018. Everything you need to know about Overwatch endorsements. Retrieved Sep 17, 2020 from https://www.polygon.com/2018/7/2/17527694",
      "doi": ""
    },
    {
      "text": "Sebastian Ostritsch. 2017. The amoralist challenge to gaming and the gamer's moral obligation. Ethics and Information Technology, 19, 117–128. doi:10.1007/s10676-017-9420-x",
      "doi": "10.1007/s10676-017-9420-x"
    },
    {
      "text": "Michael Quinn Patton. 1990. Qualitative evaluation and research methods (2nd ed.). Sage Publications, Inc. Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Stephanie L. Patridge. 2011. The incorrigible social meaning of video game imagery. Ethics and Information Technology, 13, 303–312. doi:10.1007/s10676-010-9250-6",
      "doi": "10.1007/s10676-010-9250-6"
    },
    {
      "text": "Christopher A. Paul. 2018. The toxic meritocracy of video games: Why gaming culture is the worst. University of Minnesota Press. https://doi.org/10.5749/j.ctt2204rbz",
      "doi": ""
    },
    {
      "text": "Thomas M. Powers, 2003. Real wrongs in virtual communities. Ethics and Information Technology, 5, 191–198. https://doi.org/10.1023/B:ETIN.0000017737.56971.20",
      "doi": "10.1023/B%3AETIN.0000017737.56971.20"
    },
    {
      "text": "Chris Priebe. 2017. Trolls: The cost of doing nothing. GDC Vault. Retrieved 17 Sep, 2020 from https://www.gdcvault.com/play/1024034/",
      "doi": ""
    },
    {
      "text": "Horst W. J. Rittel and Melvin M. Webber. 1973. Dilemmas in a general theory of planning. Policy Sciences, 4, 155–169",
      "doi": ""
    },
    {
      "text": "Judd Ethan Ruggill and Ken S. McAllister. 2016. E(SRB) is for everyone: Game ratings and the practice of content evaluation. In Video game policy: Production, distribution, and consumption, S. Conway & J. deWinter (eds.), 71–84. Routledge. New York, NY.",
      "doi": ""
    },
    {
      "text": "Helen Ryland. 2019. Getting away with murder: Why virtual murder in MMORPGs can be wrong on Kantian grounds. Ethics and Information Technology 21, 105–115. https://doi.org/10.1007/s10676-019-09498-y",
      "doi": "10.1007/s10676-019-09498-y"
    },
    {
      "text": "Corina Sas, Steve Whittaker, Steven Dow, Jodi Forlizzi, and John Zimmerman. 2014. Generating implications for design through design research. In Proceedings of the 2014 SIGCHI Conference on Human Factors in Computing Systems (CHI’14), April, 2014, Toronto, Canada. ACM, New York, NY, 1971-1980. https://doi.org/10.1145/2556288.2557357",
      "doi": "10.1145/2556288.2557357"
    },
    {
      "text": "Anna Schaverien. 2018. Consumers do care about retailers’ ethics and brand purpose, Accenture research finds. Forbes. Retrieved Sep 16, 2020 from https://www.forbes.com/sites/annaschaverien/2018/12/12/consumers-do-care-about-retailers-ethics-and-brand-purpose-accenture-research-finds",
      "doi": ""
    },
    {
      "text": "Karen Schrier and David Gibson. 2011. Ethics and game design: Teaching values through play. IGI Global. Hershey, PA.",
      "doi": ""
    },
    {
      "text": "Marcus Schulzke. 2010. Defending the morality of violent video games. Ethics and Information Technology, 12, 127–138. doi:10.1007/s10676-010-9222-x",
      "doi": "10.1007/s10676-010-9222-x"
    },
    {
      "text": "Kenneth B. Shores, Yilin He, Kristina L. Swanenburg, Robert Kraut, and John Riedl. 2014. The identification of deviance and its impact on retention in a multiplayer game. In Proceedings of the 17th ACM conference on Computer Supported Cooperative Work & Social Computing. ACM, New York, NY, 1356–1365. https://doi.org/10.1145/2531602.2531724",
      "doi": "10.1145/2531602.2531724"
    },
    {
      "text": "Miguel Sicart. 2009. The ethics of computer games. The MIT Press. Cambridge, MA.",
      "doi": "10.5555/1462128"
    },
    {
      "text": "Miguel Sicart. 2013. Moral dilemmas in computer games. Design Issues, 29, 3, https://doi.org/10.1162/DESI_a_00219",
      "doi": ""
    },
    {
      "text": "Andy Smith. 2010. Cultivating work-based ethics with massively multiplayer games. Journal of Interactive Learning Research, 21, 2, 273–293.",
      "doi": ""
    },
    {
      "text": "Lucy A. Sparrow, Martin Gibbs, and Michael Arnold. 2019. Apathetic villagers and the trolls who love them: Player amorality in online multiplayer games. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction, ACM, New York, NY, 447–451. https://doi.org/10.1145/3369457.3369514",
      "doi": "10.1145/3369457.3369514"
    },
    {
      "text": "Lucy A. Sparrow, Madeleine Antonellos, Martin Gibbs, and Michael Arnold. 2020. ‘From “Silly” to “Scumbag”: Reddit discussion of a case of groping in a virtual reality game’. In Proceedings of the 2020 Digital Games Research Association (DiGRA’20). http://www.digra.org/wp-content/uploads/digital-library/DiGRA_2020_paper_272.pdf",
      "doi": ""
    },
    {
      "text": "Lucy Sparrow, Martin Gibbs, and Michael Arnold. 2020. Ludic Ethics: The ethical negotiations of players in online multiplayer games. Games and Culture. https://doi.org/10.1177/1555412020971534",
      "doi": ""
    },
    {
      "text": "Dan Staines, Paul Formosa, and Malcolm Ryan. 2019. Morality play: A model for developing games of moral expertise. Games and Culture, 14, 4, 410–429. doi:10.1177/1555412017729596",
      "doi": ""
    },
    {
      "text": "Litska Strikwerda. 2015. Present and future instances of virtual rape in light of three categories of legal philosophical theories on rape. Philosophy and Technology, 28, 491–510. doi:10.1007/s13347-014-0167-6",
      "doi": ""
    },
    {
      "text": "Pontus Strimling and Seth Frey. 2018. Emergent cultural differences in online communities’ norms of fairness. Games and Culture, 1–17. https://doi.org/10.1177/1555412018800650",
      "doi": ""
    },
    {
      "text": "Selen Türkay, Jessica Formosa, Sonam Adinolf-Dinnerstein, Robert Cuthbert, and Roger Altizer Jr. 2020. See no evil, hear no evil, speak no evil: How collegiate esports players define, experience and cope with toxicity. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, 1–13. https://doi.org/10.1145/3313831.3376191",
      "doi": "10.1145/3313831.3376191"
    },
    {
      "text": "Kimberly Voll. 2018. Fair Play Alliance keynote. GDC Vault. Retrieved 17 Sep, 2020 from https://www.gdcvault.com/play/1024946",
      "doi": ""
    },
    {
      "text": "Nick van Vugt and Owen Lawson. 2016. Dealing with cheating: Five years of evolving approaches. GDC Vault. Retrieved Sep 17, 2020 from https://www.gdcvault.com/play/1023053",
      "doi": ""
    },
    {
      "text": "Vivienne Waller, Karen Farquharson, and Deborah Dempsey. 2016. Qualitative social research: Contemporary methods for the digital age. SAGE Publications Ltd. London.",
      "doi": ""
    },
    {
      "text": "Laura Warner, Kenny Shores, and Jess Hollmeier. 2019. Basic tools for healthy communities. GDC Vault. Retrieved Sep 17, 2020 from https://www.gdcvault.com/play/1025802/Basic-Tools-for-Healthy-Communities",
      "doi": ""
    },
    {
      "text": "Alex Wawro. 2020. There's a new initiative to create a game industry code of ethics. Gamasutra. Retrieved Sep 17, 2020 from https://www.gamasutra.com/view/news/366371",
      "doi": ""
    },
    {
      "text": "Tyler Wilde. 2020. The controversy over Riot's Vanguard anti-cheat software, explained. PC Gamer. Retrieved Sep 17, 2020 from https://www.pcgamer.com/au/the-controversy-over-riots-vanguard-anti-cheat-software-explained/",
      "doi": ""
    },
    {
      "text": "Jessica Wolfendale. 2007. My avatar, myself: Virtual harm and attachment. Ethics and Information Technology, 9, 111–119. doi:10.1007/s10676-006-9125-z",
      "doi": "10.1007/s10676-006-9125-z"
    },
    {
      "text": "Nick Yee. 2014. The Proteus Paradox: How online games and virtual worlds change us—and how they don't. Yale University Press.",
      "doi": "10.5555/2584522"
    },
    {
      "text": "José P. Zagal. 2009. Ethically notable videogames: Moral dilemmas and gameplay. In Proceedings of the 2009 DiGRA International Conference: Breaking New Ground: Innovation in Games, Play, Practice and Theory.",
      "doi": ""
    }
  ]
}