{
  "doi": "10.1145/3411764.3445523",
  "title": "Personalised Recommendations in Mental Health Apps: The Impact of Autonomy and Data Sharing",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "The recent growth of digital interventions for mental well-being prompts a call-to-arms to explore the delivery of personalised recommendations from a user’s perspective. In a randomised placebo study with a two-way factorial design, we analysed the difference between an autonomous user experience as opposed to personalised guidance, with respect to both users’ preference and their actual usage of a mental well-being app. Furthermore, we explored users’ preference in sharing their data for receiving personalised recommendations, by juxtaposing questionnaires and mobile sensor data. Interestingly, self-reported results indicate the preference for personalised guidance, whereas behavioural data suggests that a blend of autonomous choice and recommended activities results in higher engagement. Additionally, although users reported a strong preference of filling out questionnaires instead of sharing their mobile data, the data source did not have any impact on the actual app use. We discuss the implications of our findings and provide takeaways for designers of mental well-being applications.",
  "tags": [
    "User Perception",
    "Recommender Systems",
    "Personality Traits",
    "Personalisation"
  ],
  "authors": [
    {
      "name": "Svenja Pieritz",
      "institution": "Telefonica Alpha, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701050",
      "orcid": "missing"
    },
    {
      "name": "Mohammed Khwaja",
      "institution": "Imperial College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659463903",
      "orcid": "missing"
    },
    {
      "name": "A. Aldo Faisal",
      "institution": "Imperial College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659275017",
      "orcid": "missing"
    },
    {
      "name": "Aleksandar Matic",
      "institution": "Koa Health, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472655117",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jan Blom. 2000. Personalization: a taxonomy. In CHI’00 extended abstracts on Human factors in computing systems. 313–314.",
      "doi": ""
    },
    {
      "text": "Christopher Burr, Mariarosaria Taddeo, and Luciano Floridi. 2020. The ethics of digital well-being: A thematic review. Science and engineering ethics(2020), 1–31.",
      "doi": ""
    },
    {
      "text": "Silvina Catuara-Solarz, Bartlomiej Skorulski, Inaki Estella, Claudia Avella-Garcia, Sarah Shepherd, Emily Stott, and Sophie Dix. 2021. Efficacy of Foundations, a Digital Mental Health App to Improve Mental Well-Being, during COVID-19: A Randomised Controlled Trial. Manuscript submitted for publication(2021).",
      "doi": ""
    },
    {
      "text": "Nitesh V Chawla and Darcy A Davis. 2013. Bringing big data to personalized healthcare: a patient-centered framework. Journal of general internal medicine 28, 3 (2013), 660–665.",
      "doi": ""
    },
    {
      "text": "Hao-Fei Cheng, Ruotong Wang, Zheng Zhang, Fiona O’Connell, Terrance Gray, F Maxwell Harper, and Haiyi Zhu. 2019. Explaining decision-making algorithms through UI: Strategies to help non-expert stakeholders. In Proceedings of the 2019 chi conference on human factors in computing systems. 1–12.",
      "doi": "10.1145/3290605.3300789"
    },
    {
      "text": "Prerna Chikersal, Danielle Belgrave, Gavin Doherty, Angel Enrique, Jorge E Palacios, Derek Richards, and Anja Thieme. 2020. Understanding client support strategies to improve clinical outcomes in an online mental health intervention. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376341"
    },
    {
      "text": "Gokul Chittaranjan, Jan Blom, and Daniel Gatica-Perez. 2011. Who’s who with big-five: Analyzing and classifying personality traits with smartphones. In Wearable Computers (ISWC), 2011 15th Annual International Symposium on. IEEE, 29–36.",
      "doi": "10.1109/ISWC.2011.29"
    },
    {
      "text": "Gokul Chittaranjan, Jan Blom, and Daniel Gatica-Perez. 2013. Mining large-scale smartphone data for personality studies. Personal and Ubiquitous Computing 17, 3 (2013), 433–450.",
      "doi": "10.1007/s00779-011-0490-1"
    },
    {
      "text": "Yves-Alexandre de Montjoye, Jordi Quoidbach, Florent Robic, and Alex Sandy Pentland. 2013. Predicting personality using novel mobile phone-based metrics. In International conference on social computing, behavioral-cultural modeling, and prediction. Springer, 48–55.",
      "doi": "10.1007/978-3-642-37210-0_6"
    },
    {
      "text": "Edward L Deci and Richard M Ryan. 2012. Self-determination theory.(2012).",
      "doi": ""
    },
    {
      "text": "M Brent Donnellan, Frederick L Oswald, Brendan M Baird, and Richard E Lucas. 2006. The mini-IPIP scales: tiny-yet-effective measures of the Big Five factors of personality.Psychological assessment 18, 2 (2006), 192.",
      "doi": ""
    },
    {
      "text": "Catherine Dwyer, Starr Hiltz, and Katia Passerini. 2007. Trust and privacy concern within social networking sites: A comparison of Facebook and MySpace. AMCIS 2007 proceedings(2007), 339.",
      "doi": ""
    },
    {
      "text": "Mahmoud Elkhodr, Seyed Shahrestani, and Hon Cheung. 2012. A review of mobile location privacy in the internet of things. In 2012 Tenth International Conference on ICT and Knowledge Engineering. IEEE, 266–272.",
      "doi": ""
    },
    {
      "text": "Gunther Eysenbach. 2005. The law of attrition. Journal of medical Internet research 7, 1 (2005), e11.",
      "doi": ""
    },
    {
      "text": "Bruce Ferwerda and Marko Tkalcic. 2018. Predicting Users’ Personality from Instagram Pictures: Using Visual and/or Content Features?. In The 26th Conference on User Modeling, Adaptation and Personalization, Singapore (2018).",
      "doi": "10.1145/3209219.3209248"
    },
    {
      "text": "Bruce Ferwerda and Marko Tkalcic. 2018. You Are What You Post: What the Content of Instagram Pictures Tells About Users’ Personality. In The 23rd International on Intelligent User Interfaces.",
      "doi": ""
    },
    {
      "text": "Luciano Floridi. 2016. Tolerant paternalism: Pro-ethical design as a resolution of the dilemma of toleration. Science and engineering ethics 22, 6 (2016), 1669–1688.",
      "doi": ""
    },
    {
      "text": "Luciano Floridi, Josh Cowls, Monica Beltrametti, Raja Chatila, Patrice Chazerand, Virginia Dignum, Christoph Luetge, Robert Madelin, Ugo Pagallo, Francesca Rossi, 2018. AI4People—an ethical framework for a good AI society: opportunities, risks, principles, and recommendations. Minds and Machines 28, 4 (2018), 689–707.",
      "doi": "10.1007/s11023-018-9482-5"
    },
    {
      "text": "Peter Gilbert, Landon P Cox, Jaeyeon Jung, and David Wetherall. 2010. Toward trustworthy mobile sensing. In Proceedings of the Eleventh Workshop on Mobile Computing Systems & Applications. 31–36.",
      "doi": "10.1145/1734583.1734592"
    },
    {
      "text": "Lewis R Goldberg, John A Johnson, Herbert W Eber, Robert Hogan, Michael C Ashton, C Robert Cloninger, and Harrison G Gough. 2006. The international personality item pool and the future of public-domain personality measures. Journal of Research in personality 40, 1 (2006), 84–96.",
      "doi": ""
    },
    {
      "text": "Farrokh Habibzadeh. 2017. Statistical data editing in scientific articles. Journal of Korean medical science 32, 7 (2017), 1072–1076.",
      "doi": ""
    },
    {
      "text": "Sajanee Halko and Julie A Kientz. 2010. Personality and persuasive technology: an exploratory study on health-promoting mobile applications. In International conference on persuasive technology. Springer, 150–161.",
      "doi": "10.1007/978-3-642-13226-1_16"
    },
    {
      "text": "Margeret Hall and Simon Caton. 2017. Am I who I say I am? Unobtrusive self-representation and personality recognition on Facebook. PloS one 12, 9 (2017), e0184417.",
      "doi": ""
    },
    {
      "text": "John D Hunter. 2007. Matplotlib: A 2D graphics environment. Computing in science & engineering 9, 3 (2007), 90–95.",
      "doi": ""
    },
    {
      "text": "Arshad Jamal, Jane Coughlan, and Muhammad Kamal. 2013. Mining social network data for personalisation and privacy concerns: a case study of Facebook’s Beacon. International Journal of Business Information Systems 13, 2 (2013), 173–198.",
      "doi": "10.1504/IJBIS.2013.054334"
    },
    {
      "text": "Eric Jones, Travis Oliphant, Pearu Peterson, 2001. SciPy: Open source scientific tools for Python. (2001).",
      "doi": ""
    },
    {
      "text": "Ivar Jorstad, D Van Thanh, and Schahram Dustdar. 2005. The personalization of mobile services. In WiMob’2005), IEEE International Conference on Wireless And Mobile Computing, Networking And Communications, 2005., Vol. 4. IEEE, 59–65.",
      "doi": ""
    },
    {
      "text": "Evangelos Karapanos. 2015. Sustaining user engagement with behavior-change tools. Interactions 22, 4 (2015), 48–52.",
      "doi": "10.1145/2775388"
    },
    {
      "text": "Mohammed Khwaja, Miquel Ferrer, Jesus Omana Iglesias, A Aldo Faisal, and Aleksandar Matic. 2019. Aligning daily activities with personality: towards a recommender system for improving wellbeing. In Proceedings of the 13th ACM Conference on Recommender Systems. 368–372.",
      "doi": "10.1145/3298689.3347020"
    },
    {
      "text": "Mohammed Khwaja, Sumer S Vaid, Sara Zannone, Gabriella M Harari, A Aldo Faisal, and Aleksandar Matic. 2019. Modeling personality vs. modeling personalidad: In-the-wild mobile data analysis in five countries suggests cultural impact on personality models. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 1–24.",
      "doi": "10.1145/3351246"
    },
    {
      "text": "Seoyoung Kim, Arti Thakur, and Juho Kim. 2020. Understanding Users’ Perception Towards Automated Personality Detection with Group-specific Behavioral Data. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376250"
    },
    {
      "text": "Younghwa Lee, Kenneth A Kozar, and Kai RT Larsen. 2003. The technology acceptance model: Past, present, and future. Communications of the Association for information systems 12, 1(2003), 50.",
      "doi": ""
    },
    {
      "text": "Cong Li. 2016. When does web-based personalization really work? The distinction between actual personalization and perceived personalization. Computers in Human Behavior 54 (2016), 25–33.",
      "doi": "10.1016/j.chb.2015.07.049"
    },
    {
      "text": "Rui Neves Madeira, Helena Germano, Patrícia Macedo, and Nuno Correia. 2018. Personalising the user experience of a mobile health application towards Patient Engagement. Procedia Computer Science 141 (2018), 428–433.",
      "doi": ""
    },
    {
      "text": "Tamar R Makin, Frederique de Vignemont, and A Aldo Faisal. 2017. Neurocognitive barriers to the embodiment of technology. Nature Biomedical Engineering 1, 1 (2017), 1–3.",
      "doi": ""
    },
    {
      "text": "Aleksandar Matic, Martin Pielot, and Nuria Oliver. 2017. ” OMG! How did it know that?” Reactions to Highly-Personalized Ads. In Adjunct Publication of the 25th Conference on User Modeling, Adaptation and Personalization. 41–46.",
      "doi": "10.1145/3099023.3101411"
    },
    {
      "text": "Jonathan Mayer, Patrick Mutchler, and John C Mitchell. 2016. Evaluating the privacy properties of telephone metadata. Proceedings of the National Academy of Sciences 113, 20(2016), 5536–5541.",
      "doi": ""
    },
    {
      "text": "Patrick E McKight and Julius Najab. 2010. Kruskal-wallis test. The corsini encyclopedia of psychology(2010), 1–1.",
      "doi": ""
    },
    {
      "text": "Patrick E McKnight and Julius Najab. 2010. Mann-Whitney U Test. The Corsini encyclopedia of psychology(2010), 1–1.",
      "doi": ""
    },
    {
      "text": "Bjarke Mønsted, Anders Mollgaard, and Joachim Mathiesen. 2018. Phone-based metric as a predictor for basic personality traits. Journal of Research in Personality 74 (2018), 16–22.",
      "doi": ""
    },
    {
      "text": "Rahul Mukerjee and CF Jeff Wu. 2007. A modern theory of factorial design. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Elizabeth Murray, Eric B Hekler, Gerhard Andersson, Linda M Collins, Aiden Doherty, Chris Hollis, Daniel E Rivera, Robert West, and Jeremy C Wyatt. 2016. Evaluating digital health interventions: key questions and approaches.",
      "doi": ""
    },
    {
      "text": "Gideon Nave, Juri Minxha, David M Greenberg, Michal Kosinski, David Stillwell, and Jason Rentfrow. 2018. Musical preferences predict personality: evidence from active listening and facebook likes. Psychological Science 29, 7 (2018), 1145–1158.",
      "doi": ""
    },
    {
      "text": "Seth M Noar, Christina N Benac, and Melissa S Harris. 2007. Does tailoring matter? Meta-analytic review of tailored print health behavior change interventions.Psychological bulletin 133, 4 (2007), 673.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2020. Coronavirus disease 2019 (COVID-19): situation report, 72. (2020).",
      "doi": ""
    },
    {
      "text": "Wei Peng, Shaheen Kanthawala, Shupei Yuan, and Syed Ali Hussain. 2016. A qualitative study of user perceptions of mobile health apps. BMC public health 16, 1 (2016), 1–11.",
      "doi": ""
    },
    {
      "text": "Dorian Peters, Rafael A Calvo, and Richard M Ryan. 2018. Designing for motivation, engagement and wellbeing in digital experience. Frontiers in psychology 9 (2018), 797.",
      "doi": ""
    },
    {
      "text": "Betty Pfefferbaum and Carol S North. 2020. Mental health and the Covid-19 pandemic. New England Journal of Medicine(2020).",
      "doi": ""
    },
    {
      "text": "Stephen R Porter, Michael E Whitcomb, and William H Weitzer. 2004. Multiple surveys of students and survey fatigue. New directions for institutional research 2004, 121 (2004), 63–73.",
      "doi": ""
    },
    {
      "text": "Daryl Pullman. 1999. The ethics of autonomy and dignity in long-term care. Canadian Journal on Aging/La Revue canadienne du vieillissement 18, 1(1999), 26–46.",
      "doi": ""
    },
    {
      "text": "Cosima Rughiniş, Răzvan Rughiniş, and Ştefania Matei. 2015. A touching app voice thinking about ethics of persuasive technology through an analysis of mobile smoking-cessation apps. Ethics and Information Technology 17, 4 (2015), 295–309.",
      "doi": "10.1007/s10676-016-9385-1"
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being.American psychologist 55, 1 (2000), 68.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan, C Scott Rigby, and Andrew Przybylski. 2006. The motivational pull of video games: A self-determination theory approach. Motivation and emotion 30, 4 (2006), 344–360.",
      "doi": ""
    },
    {
      "text": "Barry Schwartz. 2004. The paradox of choice: Why more is less. Ecco New York.",
      "doi": ""
    },
    {
      "text": "Saul Shiffman, Arthur A Stone, and Michael R Hufford. 2008. Ecological momentary assessment. Annu. Rev. Clin. Psychol. 4 (2008), 1–32.",
      "doi": ""
    },
    {
      "text": "Janice C Sipior, Burke T Ward, and Linda Volonino. 2014. Privacy concerns associated with smartphone use. Journal of Internet Commerce 13, 3-4 (2014), 177–193.",
      "doi": ""
    },
    {
      "text": "Marcin Skowron, Marko Tkalčič, Bruce Ferwerda, and Markus Schedl. 2016. Fusing social media cues: personality prediction from twitter and instagram. In Proceedings of the 25th international conference companion on world wide web. International World Wide Web Conferences Steering Committee, 107–108.",
      "doi": "10.1145/2872518.2889368"
    },
    {
      "text": "Jacopo Staiano, Bruno Lepri, Nadav Aharony, Fabio Pianesi, Nicu Sebe, and Alex Pentland. 2012. Friends don’t lie: inferring personality traits from social network structure. In Proceedings of the 2012 ACM conference on ubiquitous computing. 321–330.",
      "doi": "10.1145/2370216.2370266"
    },
    {
      "text": "Amir Tal and John Torous. 2017. The digital mental health revolution: Opportunities and risks.(2017).",
      "doi": ""
    },
    {
      "text": "Paul Voigt and Axel Von dem Bussche. 2017. The EU General Data Protection Regulation (GDPR). A Practical Guide, 1st Ed., Cham: Springer International Publishing (2017).",
      "doi": "10.5555/3152676"
    },
    {
      "text": "Sarah Theres Völkel, Renate Haeuslschmid, Anna Werner, Heinrich Hussmann, and Andreas Butz. 2020. How to Trick AI: Users’ Strategies for Protecting Themselves from Automatic Personality Assessment. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376877"
    },
    {
      "text": "Rui Wang, Fanglin Chen, Zhenyu Chen, Tianxing Li, Gabriella Harari, Stefanie Tignor, Xia Zhou, Dror Ben-Zeev, and Andrew T Campbell. 2014. StudentLife: assessing mental health, academic performance and behavioral trends of college students using smartphones. In Proceedings of the 2014 ACM international joint conference on pervasive and ubiquitous computing. 3–14.",
      "doi": "10.1145/2632048.2632054"
    },
    {
      "text": "Weichen Wang, Gabriella M Harari, Rui Wang, Sandrine R Müller, Shayan Mirjafari, Kizito Masaba, and Andrew T Campbell. 2018. Sensing Behavioral Change over Time: Using Within-Person Variability Features from Mobile Sensing to Predict Personality Traits. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 141.",
      "doi": "10.1145/3264951"
    },
    {
      "text": "Nick Yee, Nicolas Ducheneaut, Les Nelson, and Peter Likarish. 2011. Introverted elves & conscientious gnomes: the expression of personality in world of warcraft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 753–762.",
      "doi": "10.1145/1978942.1979052"
    },
    {
      "text": "Charles Zaiontz. 2020. Real statistics using Excel. Computer software] http://www. real-statistics. com/free-download (2020).",
      "doi": ""
    },
    {
      "text": "Markus Zanker, Laurens Rook, and Dietmar Jannach. 2019. Measuring the impact of online personalisation: Past, present and future. International Journal of Human-Computer Studies 131 (2019), 160–168.",
      "doi": "10.1016/j.ijhcs.2019.06.006"
    }
  ]
}