{
  "doi": "10.1145/3411764.3445149",
  "title": "danceON: Culturally Responsive Creative Computing",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Dance provides unique opportunities for embodied interdisciplinary learning experiences that can be personally and culturally relevant. danceON is a system that supports learners to leverage their body movement as they engage in artistic practices across data science, computing, and dance. The technology includes a Domain Specific Language (DSL) with declarative syntax and reactive behavior, a media player with pose detection and classification, and a web-based IDE. danceON provides a low-floor allowing users to bind virtual shapes to body positions in under three lines of code, while also enabling complex, dynamic animations that users can design working with conditionals and past position data. We developed danceON to support distance learning and deployed it in two consecutive cohorts of a remote, two-week summer camp for young women of color. We present our findings from an analysis of the experience and the resulting computational performances. The work identifies implications for how design can support learners’ expression across culturally relevant themes and examines challenges from the lens of usability of the computing language and technology.",
  "authors": [
    {
      "name": "William Christopher Payne",
      "institution": "New York University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659476416",
      "orcid": "missing"
    },
    {
      "name": "Yoav Bergner",
      "institution": "New York University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "60000000411",
      "orcid": "missing"
    },
    {
      "name": "Mary Etta West",
      "institution": "University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659676398",
      "orcid": "missing"
    },
    {
      "name": "Carlie Charp",
      "institution": "University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701092",
      "orcid": "missing"
    },
    {
      "name": "R. Benjamin Benjamin Shapiro",
      "institution": "University of Colorado Boulder, United States",
      "img": "/do/10.1145/contrib-81316490277/rel-imgonly/skullct.png",
      "acmid": "81316490277",
      "orcid": "missing"
    },
    {
      "name": "Danielle Albers Szafir",
      "institution": "University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659179583",
      "orcid": "0000-0003-3634-8597"
    },
    {
      "name": "Edd V. Taylor",
      "institution": "University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701558",
      "orcid": "missing"
    },
    {
      "name": "Kayla DesPortes",
      "institution": "New York University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658637008",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Samuel Aaron, Alan F. Blackwell, and Pamela Burnard. 2016. The development of Sonic Pi and its use in educational partnerships: Co-creating pedagogies for learning computer programming. Journal of Music, Technology and Education 9, 1 (5 2016), 75–94. https://doi.org/10.1386/jmte.9.1.75_1",
      "doi": ""
    },
    {
      "text": "Brittany Aronson and Judson Laughter. 2016. The Theory and Practice of Culturally Relevant Education: A Synthesis of Research Across Content Areas. Review of Educational Research 86, 1 (2016), 163–206. https://doi.org/10.3102/0034654315582066",
      "doi": ""
    },
    {
      "text": "Computer Science Teachers Association. 2017. CSTA K-12 Computer Science Standards, Revised 2017. http://www.csteachers.org/standards",
      "doi": ""
    },
    {
      "text": "Mary M Atwater, Melody Russell, and Malcolm B Butler. 2013. Multicultural science education: Preparing teachers for equity and social justice. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Engineer Bainomugisha, Andoni Lombide Carreton, Tom van Cutsem, Stijn Mostinckx, and Wolfgang de Meuter. 2013. A survey on reactive programming. ACM Computing Surveys (CSUR) 45, 4 (2013), 1–34.",
      "doi": "10.1145/2501654.2501666"
    },
    {
      "text": "Arthur Bakker. 2018. Design research in education: A practical guide for early career researchers. Routledge.",
      "doi": ""
    },
    {
      "text": "Jeanne Shapiro Bamberger and Armando Hernandez. 2000. Developing musical intuitions: A project-based introduction to making and understanding music. Oxford University Press, USA.",
      "doi": ""
    },
    {
      "text": "Yoav Bergner, Shiri Mund, Ofer Chen, and Willie Payne. 2020. Leveraging interest-driven embodied practices to build quantitative literacies: A case study using motion and audio capture from dance. Educational Technology Research and Development (2020), 1–24.",
      "doi": ""
    },
    {
      "text": "Rahul Bhargava, Ricardo Kadouaki, Emily Bhargava, Guilherme Castro, and Catherine D’Ignazio. 2016. Data murals: Using the arts to build data literacy. The Journal of Community Informatics 12, 3 (2016).",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (1 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Karen Brennan and Mitchel Resnick. 2012. New frameworks for studying and assessing the development of computational thinking. In Proceedings of the 2012 annual meeting of the American educational research association, Vancouver, Canada, Vol. 1. 25.",
      "doi": ""
    },
    {
      "text": "Gregor Broll and Steve Benford. 2005. Seamful design for location-based mobile games. In International Conference on Entertainment Computing. Springer, 155–166.",
      "doi": "10.1007/11558651_16"
    },
    {
      "text": "Zhe Cao, Gines Hidalgo, Tomas Simon, Shih-En Wei, and Yaser Sheikh. 2018. OpenPose: realtime multi-person 2D pose estimation using Part Affinity Fields. (2018). arxiv:1812.08008",
      "doi": ""
    },
    {
      "text": "Michelle Carney, Barron Webster, Irene Alvarado, Kyle Phillips, Noura Howell, Jordan Griffith, Jonas Jongejan, Amit Pitaru, and Alexander Chen. 2020. Teachable Machine: Approachable Web-Based Tool for Exploring Machine Learning Classification(CHI EA ’20). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3334480.3382839",
      "doi": ""
    },
    {
      "text": "Dionne N Champion. 2018. The STEAM dance makerspace: A context for integration: An investigation of learning at the intersections of STEM, art, making and embodiment. Ph.D. Dissertation. Northwestern University.",
      "doi": ""
    },
    {
      "text": "John Clements, Matthias Felleisen, Robert Bruce Findler, Matthew Flatt, and Shriram Krishnamurthi. 2004. Fostering Little Languages. Dr. Dobb’s Journal 29, 3 (2004), 16–24.",
      "doi": ""
    },
    {
      "text": "Kathryn Cunningham. 2020. Purpose-first Programming: A Programming Learning Approach for Learners who Care Most About What Code Achieves. In Proceedings of the 2020 ACM Conference on International Computing Education Research. 348–349.",
      "doi": "10.1145/3372782.3407102"
    },
    {
      "text": "Shaundra B Daily, Alison E Leonard, Sophie Jörg, Sabarish Babu, and Kara Gundersen. 2014. Dancing alice: Exploring embodied pedagogical strategies for learning computational thinking. In Proceedings of the 45th ACM technical symposium on Computer science education. 91–96.",
      "doi": "10.1145/2538862.2538917"
    },
    {
      "text": "Shaundra B Daily, Alison E Leonard, Sophie Jörg, Sabarish Babu, Kara Gundersen, and Dhaval Parmar. 2015. Embodying computational thinking: Initial design of an emerging technological learning tool. Technology, Knowledge and Learning 20, 1 (2015), 79–84.",
      "doi": ""
    },
    {
      "text": "Kayla DesPortes, Monet Spells, and Betsy DiSalvo. 2016. The MoveLab: Developing Congruence Between Students’ Self-Concepts and Computing. Proceedings of the 47th ACM Technical Symposium on Computing Science Education - SIGCSE ’16(2016), 267–272. https://doi.org/10.1145/2839509.2844586",
      "doi": "10.1145/2839509.2844586"
    },
    {
      "text": "Catherine D’Ignazio. 2017. Creative data literacy. Information Design Journal 23, 1 (7 2017), 6–18. https://doi.org/10.1075/idj.23.1.03dig",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio and Lauren F Klein. 2020. Data feminism. MIT Press.",
      "doi": ""
    },
    {
      "text": "Betsy DiSalvo. 2014. Graphical qualities of educational technology: Using drag-and-drop and text-based programs for introductory computer science. IEEE computer graphics and applications 34, 6 (2014), 12–15.",
      "doi": ""
    },
    {
      "text": "Benedict du Boulay, Tim O’Shea, and John Monk. 1981. The black box inside the glass box: presenting computing concepts to novices. International Journal of Man-Machine Studies 14, 3 (1981), 237–249.",
      "doi": ""
    },
    {
      "text": "Alireza Ebrahimi. 1994. Novice programmer errors: Language constructs and plan composition. International Journal of Human-Computer Studies 41, 4 (1994), 457–480.",
      "doi": "10.1006/ijhc.1994.1069"
    },
    {
      "text": "Matthias Felleisen, Robert Bruce Findler, Matthew Flatt, and Shriram Krishnamurthi. 2009. A functional I/O system or, fun for freshman kids. ACM Sigplan Notices 44, 9 (2009), 47–58.",
      "doi": "10.1145/1631687.1596561"
    },
    {
      "text": "Matthias Felleisen, Robert Bruce Findler, Matthew Flatt, and Shriram Krishnamurthi. 2018. How to design programs: an introduction to programming and computing. MIT Press.",
      "doi": ""
    },
    {
      "text": "Lila Finch, Celeste Moreno, and R Benjamin Shapiro. 2020. Teacher and student enactments of a transdisciplinary art-science-computing unit. Instructional Science(2020), 1–44.",
      "doi": ""
    },
    {
      "text": "Kathi Fisler. 2014. The recurring rainfall problem. In Proceedings of the tenth annual conference on International computing education research. 35–42.",
      "doi": "10.1145/2632320.2632346"
    },
    {
      "text": "Jason Freeman, Brian Magerko, Tom McKlin, Mike Reilly, Justin Permar, Cameron Summers, and Eric Fruchter. 2014. Engaging underrepresented groups in high school introductory computing through computational remixing with EarSketch. In Proceedings of the 45th ACM technical symposium on Computer science education - SIGCSE ’14. ACM Press, New York, New York, USA, 85–90. https://doi.org/10.1145/2538862.2538906",
      "doi": "10.1145/2538862.2538906"
    },
    {
      "text": "Geneva Gay. 2002. Preparing for culturally responsive teaching. Journal of teacher education 53, 2 (2002), 106–116.",
      "doi": ""
    },
    {
      "text": "Berto Gonzalez, Erin Cherry, and Celine Latulipe. 2012. Dance-inspired technology, Technology-inspired dance. NordiCHI 2012: Making Sense Through Design - Proceedings of the 7th Nordic Conference on Human-Computer Interaction. https://doi.org/10.1145/2399016.2399078",
      "doi": ""
    },
    {
      "text": "Norma González, Rosi Andrade, Marta Civil, and Luis Moll. 2004. Bridging funds of distributed knowledge: Creating zones of practices in mathematics. 6, 1-2 (2004), 115–132. https://doi.org/10.1207/s15327671espr0601-2_7",
      "doi": ""
    },
    {
      "text": "Kris D Gutiérrez and Barbara Rogoff. 2003. Cultural ways of learning: Individual traits or repertoires of practice. Educational researcher 32, 5 (2003), 19–25.",
      "doi": ""
    },
    {
      "text": "Mark Guzdial. 2003. A media computation course for non-majors. In Proceedings of the 8th annual conference on Innovation and technology in computer science education. 104–108.",
      "doi": "10.1145/961511.961542"
    },
    {
      "text": "Brian Harvey and Matthew Wright. 1999. Simply Scheme: introducing computer science. Mit Press.",
      "doi": ""
    },
    {
      "text": "Katrina Hazzard-Gordon. 1985. African-American vernacular dance: core culture and meaning operatives. Journal of Black Studies 15, 4 (1985), 427–445.",
      "doi": ""
    },
    {
      "text": "Christopher M Hoadley. 2004. Methodological alignment in design-based research. Educational psychologist 39, 4 (2004), 203–212.",
      "doi": ""
    },
    {
      "text": "Robert Holwerda and Felienne Hermans. 2018. A usability analysis of blocks-based programming editors using cognitive dimensions. In 2018 IEEE symposium on visual languages and human-centric computing (VL/HCC). IEEE, 217–225.",
      "doi": ""
    },
    {
      "text": "Liwen Huang and Paul Hudak. 2003. Dance: A declarative language for the control of humanoid robots. Yale, Department of Computer Science, Yale University New Haven, CT 06520, Tech. Rep. (2003).",
      "doi": ""
    },
    {
      "text": "Shriram Krishnamurthi and Kathi Fisler. 2019. Programming paradigms and beyond. The Cambridge Handbook of Computing Education Research 37 (2019).",
      "doi": ""
    },
    {
      "text": "Gloria Ladson-Billings. 2014. Culturally relevant pedagogy 2.0: aka the remix. Harvard Educational Review 84, 1 (2014), 74–84.",
      "doi": ""
    },
    {
      "text": "Alison E Leonard and Shaundra B Daily. 2014. The Dancing Alice Project: Computational and embodied arts research in middle school education. In Proceedings of the 45th ACM Technical Symposium on Computer Science Education.",
      "doi": ""
    },
    {
      "text": "Alison E Leonard, Shaundra B Daily, Sophie Jörg, and Sabarish V Babu. 2020. Coding moves: Design and research of teaching computational thinking through dance choreography and virtual interactions. Journal of Research on Technology in Education (2020), 1–19.",
      "doi": ""
    },
    {
      "text": "Alison E Leonard, Nikeetha Dsouza, Sabarish V Babu, Shaundra B Daily, Sophie Jörg, Cynthia Waddell, Dhaval Parmar, Kara Gundersen, Jordan Gestring, and Kevin Boggs. 2015. Embodying and programming a constellation of multimodal literacy practices: Computational thinking, creative movement, biology, & virtual environment interactions. Journal of Language and Literacy Education 11, 2 (2015), 64–93.",
      "doi": ""
    },
    {
      "text": "Lindsay Lindberg, Deborah Ann Fields, and Yasmin B Kafai. 2020. STEAM maker education: Conceal/reveal of personal, artistic and computational dimensions in high school student projects. In Frontiers in Education, Vol. 5. Frontiers Research Foundation, 1.",
      "doi": ""
    },
    {
      "text": "John Maloney, Mitchel Resnick, Natalie Rusk, Brian Silverman, and Evelyn Eastmond. 2010. The scratch programming language and environment. ACM Transactions on Computing Education (TOCE) 10, 4 (2010), 1–15.",
      "doi": "10.1145/1868358.1868363"
    },
    {
      "text": "Bill Manaris, Blake Stevens, and Andrew R. Brown. 2016. JythonMusic: An environment for teaching algorithmic music composition, dynamic coding and musical performativity. Journal of Music, Technology and Education 9, 1 (5 2016), 33–56. https://doi.org/10.1386/jmte.9.1.33_1",
      "doi": ""
    },
    {
      "text": "Lauren McCarthy. 2020. p5.js. https://p5js.org",
      "doi": ""
    },
    {
      "text": "Orni Meerbaum-Salant, Michal Armoni, and Mordechai Ben-Ari. 2011. Habits of programming in scratch. In Proceedings of the 16th annual joint conference on Innovation and technology in computer science education. 168–172.",
      "doi": "10.1145/1999747.1999796"
    },
    {
      "text": "Leo A. Meyerovich, Arjun Guha, Jacob Baskin, Gregory H. Cooper, Michael Greenberg, Aleks Bromfield, and Shriram Krishnamurthi. 2009. Flapjax: A programming language for Ajax applications. Proceedings of the Conference on Object-Oriented Programming Systems, Languages, and Applications, OOPSLA(2009), 1–20. https://doi.org/10.1145/1640089.1640091",
      "doi": "10.1145/1640089.1640091"
    },
    {
      "text": "Sten Minör. 1992. Interacting with structure-oriented editors. International Journal of Man-Machine Studies 37, 4 (1992), 399–418.",
      "doi": "10.1016/0020-7373%2892%2990002-3"
    },
    {
      "text": "Jessica Morales-Chicas, Mauricio Castillo, Ireri Bernal, Paloma Ramos, and Bianca L Guzman. 2019. Computing with relevance and purpose: A review of culturally relevant education in computing.International Journal of Multicultural Education 21, 1 (2019), 125–155.",
      "doi": ""
    },
    {
      "text": "Marco T Morazán. 2018. Infusing an HtDP-based CS1 with distributed programming using functional video games.J. Funct. Program. 28(2018), e5.",
      "doi": ""
    },
    {
      "text": "Bahare Naimipour, Mark Guzdial, and Tamara Shreiner. 2019. Helping social studies teachers to design learning experiences around data: Participatory design for new teacher-centric programming languages. In Proceedings of the 2019 ACM Conference on International Computing Education Research. 313–313.",
      "doi": "10.1145/3291279.3341211"
    },
    {
      "text": "Bahare Naimipour, Mark Guzdial, and Tamara Shreiner. 2020. Engaging pre-service teachers in front-end design: Developing technology for a social studies classroom. In Proceedings of Frontiers in Education (FIE) 2020. IEEE.",
      "doi": ""
    },
    {
      "text": "Enrico Nardelli. 2019. Do we really need computational thinking?Commun. ACM 62, 2 (2019), 32–35.",
      "doi": "10.1145/3231587"
    },
    {
      "text": "Chris Nash and Alan Blackwell. 2012. Liveness and flow in notation use. NIME 2012 Proceedings of the International Conference on New Interfaces for Musical Expression (2012), 76–81.",
      "doi": ""
    },
    {
      "text": "National Science Foundation, National Center for Science and Engineering Statistics. 2019. Degrees awarded to women: Mathematics and statistics, 1997, 2006, 2016. https://ncses.nsf.gov/pubs/nsf19304/digest/field-of-degree-women#mathematics-and-statistics",
      "doi": ""
    },
    {
      "text": "Tor Ole B Odden and Rosemary S Russ. 2019. Defining sensemaking: Bringing clarity to a fragmented theoretical construct. Science Education 103, 1 (2019), 187–205.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Cathy O’neil. 2016. Weapons of math destruction: How big data increases inequality and threatens democracy. Broadway Books.",
      "doi": "10.5555/3002861"
    },
    {
      "text": "John F Pane, Chotirat Ratanamahatana, and Brad A a Myers. 2001. Studying the language and structure in non-programmers’ solutions to programming problems. International Journal of Human-Computer Studies 54, 2 (2001), 237–264.",
      "doi": "10.1006/ijhc.2000.0410"
    },
    {
      "text": "Django Paris. 2012. Culturally sustaining pedagogy: A needed change in stance, terminology, and practice. Educational Researcher 41, 3 (2012), 93–97. https://doi.org/10.3102/0013189X12441244",
      "doi": ""
    },
    {
      "text": "D. Parmar, J. Isaac, S. V. Babu, N. D’Souza, A. E. Leonard, S. Jörg, K. Gundersen, and S. B. Daily. 2016. Programming moves: Design and evaluation of applying embodied interaction in virtual environments to enhance computational thinking in middle school students. In 2016 IEEE Virtual Reality (VR). 131–140.",
      "doi": ""
    },
    {
      "text": "Roy D Pea. 1986. Language-independent conceptual “bugs” in novice programming. Journal of educational computing research 2, 1 (1986), 25–36.",
      "doi": ""
    },
    {
      "text": "John Peterson, Gregory D Hager, and Paul Hudak. 1999. A language for declarative robotic programming. In Proceedings 1999 IEEE International Conference on Robotics and Automation (Cat. No. 99CH36288C), Vol. 2. IEEE, 1144–1151.",
      "doi": ""
    },
    {
      "text": "Nichole Pinkard, Caitlin Kennedy Martin, and Sheena Erete. 2020. Equitable approaches: opportunities for computational thinking with emphasis on creative production and connections to community. Interactive Learning Environments 28, 3 (2020), 347–361.",
      "doi": ""
    },
    {
      "text": "Joe Politz, Benjamin Lerner, Sorawee Porncharoenwase, and Shriram Krishnamurthi. 2019. Event loops as first-class values: A case study in pedagogic language design. The Art, Science, and Engineering of Programming (2019). https://doi.org/10.22152/programming-journal.org/2019/3/11",
      "doi": ""
    },
    {
      "text": "Justin Pombrio, Shriram Krishnamurthi, and Kathi Fisler. 2017. Teaching programming languages by experimental and adversarial thinking. In 2nd Summit on Advances in Programming Languages (SNAPL 2017). Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik.",
      "doi": ""
    },
    {
      "text": "Thomas W Price and Tiffany Barnes. 2015. Comparing textual and block interfaces in a novice programming environment. In Proceedings of the eleventh annual international conference on international computing education research. 91–99.",
      "doi": "10.1145/2787622.2787712"
    },
    {
      "text": "Charlie Roberts, Jesse Allison, Daniel Holmes, Benjamin Taylor, Matthew Wright, and JoAnn Kuchera-Morin. 2016. Educational design of live coding environments for the browser. Journal of Music, Technology and Education 9, 1 (5 2016), 95–116. https://doi.org/10.1386/jmte.9.1.95_1",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A grammar of interactive graphics. IEEE Transactions on Visualization & Computer Graphics (Proc. InfoVis) (2017). https://doi.org/10.1109/tvcg.2016.2599030",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Ryan Russell, Jane Hoffswell, and Jeffrey Heer. 2015. Reactive vega: A streaming dataflow architecture for declarative interactive visualization. IEEE transactions on visualization and computer graphics 22, 1(2015), 659–668.",
      "doi": ""
    },
    {
      "text": "Emmanuel Schanzer, Shriram Krishnamurthi, and Kathi Fisler. 2018. Creativity, customization, and ownership: Game design in Bootstrap: Algebra. In Proceedings of the 49th ACM Technical Symposium on Computer Science Education. 161–166.",
      "doi": "10.1145/3159450.3159471"
    },
    {
      "text": "Kimberly A Scott, Kimberly M Sheridan, and Kevin Clark. 2015. Culturally responsive computing: A theory revisited. Learning, Media and Technology 40, 4 (2015), 412–436.",
      "doi": ""
    },
    {
      "text": "Kimberly A Scott and Mary Aleta White. 2013. COMPUGIRLSâ€™standpoint: Culturally responsive computing and its effect on girls of color. Urban Education 48, 5 (2013), 657–681.",
      "doi": ""
    },
    {
      "text": "Kristin A Searle and Yasmin B Kafai. 2015. Culturally responsive making with American Indian girls: Bridging the identity gap in crafting and computing with electronic textiles. In Proceedings of the Third Conference on GenderIT. 9–16.",
      "doi": "10.1145/2807565.2807707"
    },
    {
      "text": "Otto Seppälä, Petri Ihantola, Essi Isohanni, Juha Sorva, and Arto Vihavainen. 2015. Do we know how difficult the rainfall problem is?. In Proceedings of the 15th Koli Calling Conference on Computing Education Research. 87–96.",
      "doi": "10.1145/2828959.2828963"
    },
    {
      "text": "R Benjamin Shapiro and Matthew Ahrens. 2016. Beyond blocks: Syntax and semantics. Commun. ACM 59, 5 (2016), 39–41.",
      "doi": "10.1145/2903751"
    },
    {
      "text": "Elliot Soloway. 1986. Learning to program= learning to construct mechanisms and explanations. Commun. ACM 29, 9 (1986), 850–858.",
      "doi": "10.1145/6592.6594"
    },
    {
      "text": "Tensorflow. 2020. Pose Detection in the Browser: PoseNet Model.",
      "doi": ""
    },
    {
      "text": "The Design-Based Research Collective. 2003. Design-Based Research: An Emerging Paradigm for Educational Inquiry. Educational Researcher 32, 1 (1 2003), 5–8. https://doi.org/10.3102/0013189X032001005",
      "doi": ""
    },
    {
      "text": "David Weintrop and Uri Wilensky. 2015. To block or not to block, that is the question: students’ perceptions of blocks-based programming. In Proceedings of the 14th international conference on interaction design and children. 199–208.",
      "doi": "10.1145/2771839.2771860"
    },
    {
      "text": "David Weintrop and Uri Wilensky. 2017. Comparing block-based and text-based programming in high school computer science classrooms. ACM Transactions on Computing Education (TOCE) 18, 1 (2017), 1–25.",
      "doi": "10.1145/3089799"
    },
    {
      "text": "David Weintrop and Uri Wilensky. 2017. How block-based languages support novices. Journal of Visual Languages and Sentient Systems 3 (2017), 92–100.",
      "doi": ""
    },
    {
      "text": "Jeannette M Wing. 2008. Computational thinking and thinking about computing. Philosophical Transactions of the Royal Society A: Mathematical, Physical and Engineering Sciences 366, 1881 (2008), 3717–3725.",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-based design: Concept, principles and examples. ACM Trans. Access. Comput. 3, 3, Article 9 (April 2011), 27 pages. https://doi.org/10.1145/1952383.1952384",
      "doi": "10.1145/1952383.1952384"
    }
  ]
}