{
  "doi": "10.1145/3411764.3445619",
  "title": "Tailoring Persuasive and Behaviour Change Systems Based on Stages of Change and Motivation",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2021,
  "badges": [],
  "abstract": "Persuasive systems (PS) are effective at motivating behaviour change using various persuasive strategies. Research shows that tailoring these systems increases their effectiveness. However, there is little knowledge on how PS can be tailored to people's Stages of Change (SoC). We conduct a large-scale study of 568 participants to investigate how individuals at different SoC respond to various strategies. We also explore why the strategies motivate behaviour change using the ARCS motivation model. Our results show that people's SoC plays a significant role in the perceived persuasiveness of different strategies and that the strategies motivate for different reasons. For instance, people at the precontemplation stage tend to be strongly motivated by self-monitoring strategy because it raises their consciousness or self-awareness. Our work is the first to link research on the theory of SoC with the theory of motivation and Persuasive Systems Design (PSD) model to develop practical guidelines to inform the tailoring of persuasive systems.",
  "tags": [
    "Risky health behaviour",
    "Behaviour change theory",
    "Persuasive system",
    "Motivation",
    "Health and Wellness",
    "Behaviour change system",
    "Persuasive strategies",
    "Behaviour change",
    "Personalization",
    "Design implications",
    "Tailoring",
    "Stage of change"
  ],
  "authors": [
    {
      "name": "Oladapo Oyebode",
      "institution": "Faculty of Computer Science, Dalhousie University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659344238",
      "orcid": "missing"
    },
    {
      "name": "Chinenye Ndulue",
      "institution": "Faculty of Computer Science, Dalhousie University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659344025",
      "orcid": "0000-0002-7050-0612"
    },
    {
      "name": "Dinesh Mulchandani",
      "institution": "Faculty of Computer Science, Dalhousie University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700975",
      "orcid": "missing"
    },
    {
      "name": "Ashfaq A. Zamil Adib",
      "institution": "Faculty of Computer Science, Dalhousie University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701380",
      "orcid": "missing"
    },
    {
      "name": "Mona Alhasani",
      "institution": "Faculty of Computer Science, Dalhousie University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702061",
      "orcid": "missing"
    },
    {
      "name": "Rita Orji",
      "institution": "Faculty of Computer Science, Dalhousie University, Canada",
      "img": "/do/10.1145/contrib-81548037192/rel-imgonly/ritaheadshot.jpg",
      "acmid": "81548037192",
      "orcid": "0000-0001-6152-8034"
    }
  ],
  "references": [
    {
      "text": "Abdessettar, S. 2016. Persuasive Technologies for Efficient Adaptable Self-Education. Eighth International Conference on Mobile, Hybrid, and Online Learning (2016), 70–75.",
      "doi": ""
    },
    {
      "text": "Adamo, E.K. 2015. Using Video Modeling, Prompting, and Behavior-Specific Praise to Increase Moderate-to-Vigorous Physical Activity for Young Children With Down Syndrome. Journal of Early Intervention. 37, 4 (Dec. 2015), 270–285. DOI: https://doi.org/10.1177/1053815115620211",
      "doi": ""
    },
    {
      "text": "Ajzen, I. and others 1991. The theory of planned behavior. Organizational behavior and human decision processes. 50, 2 (1991), 179–211.",
      "doi": ""
    },
    {
      "text": "Al-Tawfiq, J.A. and Pittet, D. 2013. Improving Hand Hygiene Compliance in Healthcare Settings Using Behavior Change Theories: Reflections. Teaching and Learning in Medicine. 25, 4 (Oct. 2013), 374–382. DOI: https://doi.org/10.1080/10401334.2013.827575",
      "doi": ""
    },
    {
      "text": "Almutari, N. and Orji, R. 2019. How effective are social influence strategies in persuasive apps for promoting physical activity? A systematic review. ACM UMAP 2019 Adjunct - Adjunct Publication of the 27th Conference on User Modeling, Adaptation and Personalization (Jun. 2019), 167–172.",
      "doi": "10.1145/3314183.3323855"
    },
    {
      "text": "Alqahtani, F. 2019. Apps for Mental Health: An Evaluation of Behavior Change Strategies and Recommendations for Future Development. Frontiers in Artificial Intelligence. 2, (2019), 1–11. DOI: https://doi.org/10.3389/frai.2019.00030",
      "doi": ""
    },
    {
      "text": "Anagnostopoulou, E. 2017. Exploring the links between persuasion, personality and mobility types in personalized mobility applications. International Conference on Persuasive Technology (2017), 107–118.",
      "doi": ""
    },
    {
      "text": "Anagnostopoulou, E. 2018. Persuasive interventions for sustainable travel choices leveraging users’ personality and mobility type. International Conference on Persuasive Technology (PERSUASIVE 2018) (Apr. 2018), 229–241.",
      "doi": ""
    },
    {
      "text": "Anderson, J.C. and Gerbing, D.W. 1988. Structural equation modeling in practice: A review and recommended two-step approach. Psychological Bulletin. 103, 3 (1988), 411–423.",
      "doi": ""
    },
    {
      "text": "Andrew, A. 2007. Toward a systematic understanding of suggestion tactics in persuasive technologies. International Conference on Persuasive Technology (2007), 259–270.",
      "doi": "10.5555/1780402.1780445"
    },
    {
      "text": "Arshad, R. 2019. Acceptability of Persuasive Prompts to Induce Behavioral Change in People Suffering from Depression. IFIP Conference on Human-Computer Interaction (INTERACT 2019) (Sep. 2019), 120–139.",
      "doi": "10.1007/978-3-030-29390-1_7"
    },
    {
      "text": "Arteaga, S.M. 2009. Combating obesity trends in teenagers through persuasive mobile technology. ACM SIGACCESS Accessibility and Computing. 94, 94 (Jun. 2009), 17–25. DOI: https://doi.org/10.1145/1595061.1595064",
      "doi": ""
    },
    {
      "text": "Balsamiq. Rapid, effective and fun wireframing software: https://balsamiq.com/. Accessed: 2019-03-31.",
      "doi": ""
    },
    {
      "text": "Bandura, A. 1977. Self-efficacy: Toward a unifying theory of behavioral change. Psychological Review. 84, 2 (Mar. 1977), 191–215. DOI: https://doi.org/10.1037/0033-295X.84.2.191",
      "doi": "10.1037/0033-295x.84.2.191"
    },
    {
      "text": "Bandura, A. and Schunk, D.H. 1981. Cultivating competence, self-efficacy, and intrinsic interest through proximal self-motivation. Journal of Personality and Social Psychology. 41, 3 (1981), 586–598. DOI: https://doi.org/10.1037/0022-3514.41.3.586",
      "doi": ""
    },
    {
      "text": "Bardram, J.E. 2012. The MONARCA self-assessment system - A persuasive personal monitoring system for bipolar patients. Proceedings of the 2nd ACM SIGHIT International Health Informatics Symposium (Miami, Florida, USA, 2012), 21–30.",
      "doi": "10.1145/2110363.2110370"
    },
    {
      "text": "Berkovsky, S. 2016. Adaptivity and personalization in persuasive technologies. CEUR Workshop Proceedings. 1582, (2016), 13–25.",
      "doi": ""
    },
    {
      "text": "Bomfim, M.C.C. and Wallace, J.R. 2018. Pirate bri's grocery adventure: Teaching food literacy through shopping. Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada, Apr. 2018), 1–6.",
      "doi": "10.1145/3170427.3188496"
    },
    {
      "text": "Brown, B. 2006. Reflecting on Health: A system for students to monitor diet and exercise. CHI ’06 Extended Abstracts on Human Factors in Computing Systems (Montreal, Quebec, Canada, 2006), 1807–1812.",
      "doi": ""
    },
    {
      "text": "Buhrmester, M. 2015. Amazon's Mechanical Turk: A new source of inexpensive, yet high-quality data? Methodological issues and strategies in clinical research (4th ed.). A.E. Kazdin, ed. American Psychological Association. 133–139.",
      "doi": ""
    },
    {
      "text": "Busch, M. 2016. Using player type models for personalized game design - An empirical investigation. Interaction Design and Architecture(s). 28, 1 (2016), 145–163.",
      "doi": ""
    },
    {
      "text": "Calvaresi, D. 2019. Social network chatbots for smoking cessation: Agent and multi-agent frameworks. 2019 IEEE/WIC/ACM International Conference on Web Intelligence (WI) (Thessaloniki, Greece, Oct. 2019), 286–292.",
      "doi": "10.1145/3350546.3352532"
    },
    {
      "text": "Canale, N. 2015. The efficacy of computerized alcohol intervention tailored to drinking motives among college students: a quasi-experimental pilot study. The American Journal of Drug and Alcohol Abuse. 41, 2 (Mar. 2015), 183–187. DOI: https://doi.org/10.3109/00952990.2014.991022",
      "doi": ""
    },
    {
      "text": "Chang, Y.-H. 2020. Development of a Kinect-Based English Learning System Based on Integrating the ARCS Model with Situated Learning. Sustainability. 12, 5 (Mar. 2020), 2037. DOI: https://doi.org/10.3390/su12052037",
      "doi": ""
    },
    {
      "text": "Chau, Y. 2017. Designing a Motivated Tangible Multimedia System for Preschoolers. World Academy of Science, Engineering and Technology, International Journal of Social, Behavioral, Educational, Economic, Business and Industrial Engineering. 11, 2 (2017), 422–430.",
      "doi": ""
    },
    {
      "text": "Chin, W.W. 1998. The partial least squares approach to structural equation modeling. Modern methods for business research. 295, 2 (1998), 295–336.",
      "doi": ""
    },
    {
      "text": "Choe, E.K. 2017. Understanding self-reflection: How people reflect on personal data through visual data exploration. Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (Barcelona, Spain, May 2017), 173–182.",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Cialdini, R.B. 2001. Harnessing the Science of Persuasion. Harvard Business Review. 79, 9 (2001), 72–81.",
      "doi": ""
    },
    {
      "text": "Cibrian, F.L. 2016. Hunting Relics: A Persuasive Exergame to Promote Collective Exercise in Young Children. International Journal of Human-Computer Interaction. 32, 3 (Mar. 2016), 277–294. DOI: https://doi.org/10.1080/10447318.2016.1136180",
      "doi": ""
    },
    {
      "text": "Connors, G.J. and DiClemente, Carlo C., Velasquez, Mary Marden, Donovan, D.M. 2013. Substance Abuse Treatment and the Stages of Change: Selecting and Planning Interventions. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Consolvo, S. 2006. Design requirements for technologies that encourage physical activity. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montreal, Quebec, Canada, 2006), 457–466.",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Costanza, E. 2014. Don't forget your pill!: designing effective medication reminder apps that support users’ daily routines. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada, 2014), 2269–2278.",
      "doi": ""
    },
    {
      "text": "Curtis, K.E. 2015. Targeting Parents for Childhood Weight Management: Development of a Theory-Driven and User-Centered Healthy Eating App. JMIR mHealth and uHealth. 3, 2 (Jun. 2015), e69. DOI: https://doi.org/10.2196/mhealth.3857",
      "doi": ""
    },
    {
      "text": "Damanhoori, F. 2012. E-mentoring System Development using ARCS Motivational Strategies. International Journal of Smart Home. 6, 3 (2012), 83–90.",
      "doi": ""
    },
    {
      "text": "Derbali, L. and Frasson, C. 2012. Assessment of learners’ motivation during interactions with serious games: A study of some motivational strategies in food-force. Advances in Human-Computer Interaction. 2012, (2012). DOI: https://doi.org/10.1155/2012/624538",
      "doi": ""
    },
    {
      "text": "Derbali, L. and Frasson, C. 2011. Physiological evaluation of attention getting strategies during serious game play. International Conference on Artificial Intelligence in Education (2011), 447–449.",
      "doi": ""
    },
    {
      "text": "Derbali, L. and Frasson, C. 2010. Players’ motivation and EEG waves patterns in a serious game environment. International Conference on Intelligent Tutoring Systems (2010), 297–299.",
      "doi": "10.1007/978-3-642-13437-1_50"
    },
    {
      "text": "Difallah, D. 2018. Demographics and dynamics of Mechanical Turk workers. WSDM 2018 - Proceedings of the 11th ACM International Conference on Web Search and Data Mining (Feb. 2018), 135–143.",
      "doi": "10.1145/3159652.3159661"
    },
    {
      "text": "Drozd, F. 2012. Exploring perceived persuasiveness of a behavior change support system: A structural model. International Conference on Persuasive Technology (PERSUASIVE 2012) (2012), 157–168.",
      "doi": "10.1007/978-3-642-31037-9_14"
    },
    {
      "text": "Duan, H. 2020. Using goal-directed design to create a mobile health app to improve patient compliance with hypertension self-management: Development and deployment. JMIR mHealth and uHealth. 8, 2 (Feb. 2020), e14466. DOI: https://doi.org/10.2196/14466",
      "doi": ""
    },
    {
      "text": "Edney, S. 2017. “Active Team” a social and gamified app-based physical activity intervention: Randomised controlled trial study protocol. BMC Public Health. 17, 1 (Nov. 2017), 859. DOI: https://doi.org/10.1186/s12889-017-4882-7.",
      "doi": ""
    },
    {
      "text": "Ehn, M. 2018. Activity Monitors as Support for Older Persons’ Physical Activity in Daily Life: Qualitative Study of the Users’ Experiences. JMIR mHealth and uHealth. 6, 2 (Feb. 2018), e34. DOI: https://doi.org/10.2196/mhealth.8345",
      "doi": ""
    },
    {
      "text": "Evers, K.E. 2006. A randomized clinical trial of a population- and transtheoretical model-based stress-management intervention. Health Psychology. 25, 4 (Jul. 2006), 521–529. DOI: https://doi.org/10.1037/0278-6133.25.4.521",
      "doi": ""
    },
    {
      "text": "Evers, K.E. 2012. Results of a Transtheoretical Model-Based Alcohol, Tobacco and Other Drug Intervention in Middle Schools. Addictive Behaviors. 37, 9 (Sep. 2012), 1009–1018. DOI: https://doi.org/10.1016/j.addbeh.2012.04.008",
      "doi": ""
    },
    {
      "text": "Fenicio, A. and Calvary, G. 2015. Persuasion through an ambient device: Proof of concept and early evaluation of cregrette, a smoking cessation system. European Conference on Ambient Intelligence (Nov. 2015), 252–267.",
      "doi": ""
    },
    {
      "text": "Ferron, M. and Massa, P. 2013. Transtheoretical model for designing technologies supporting an active lifestyle. Proceedings of the Biannual Conference of the Italian Chapter of SIGCHI (Trento, Italy, 2013), 1–8.",
      "doi": "10.1145/2499149.2499158"
    },
    {
      "text": "Fogg, B.J. and Fogg, G.E. 2003. Persuasive Technology: Using Computers to Change What We Think and Do. Morgan Kaufmann.",
      "doi": "10.5555/640634"
    },
    {
      "text": "Fry, J.P. and Neff, R.A. 2009. Periodic prompts and reminders in health promotion and health behavior interventions: Systematic review. Journal of Medical Internet Research. 11, 2 (Apr. 2009), e16. DOI: https://doi.org/10.2196/jmir.1138",
      "doi": ""
    },
    {
      "text": "Fuller-Tyszkiewicz, M. 2018. A Mobile App-Based Intervention for Depression: End-User and Expert Usability Testing Study. JMIR mental health. 5, 3 (Aug. 2018), e54. DOI: https://doi.org/10.2196/mental.9445",
      "doi": ""
    },
    {
      "text": "Ganesan, A.N. 2016. International Mobile-Health Intervention on Physical Activity, Sitting, and Weight: The Stepathlon Cardiovascular Health Study. Journal of the American College of Cardiology. 67, 21 (May 2016), 2453–2463. DOI: https://doi.org/10.1016/j.jacc.2016.03.472",
      "doi": ""
    },
    {
      "text": "Gonzalez-Ramirez, L.P. 2017. Validation of health behavior and stages of change questionnaire. Breast Cancer: Targets and Therapy. 9, (Mar. 2017), 199–205. DOI: https://doi.org/10.2147/BCTT.S129855",
      "doi": ""
    },
    {
      "text": "Gopalan, V. 2017. A review of the motivation theories in learning. AIP Conference Proceedings (Oct. 2017), 020043.",
      "doi": ""
    },
    {
      "text": "Greene, G.W. 2013. Baseline transtheoretical and dietary behavioral predictors of dietary fat moderation over 12 and 24months. Eating Behaviors. 14, 3 (Aug. 2013), 255–262. DOI: https://doi.org/10.1016/j.eatbeh.2013.01.014",
      "doi": ""
    },
    {
      "text": "Hair, J.F. 2011. PLS-SEM: Indeed a silver bullet. Journal of Marketing Theory and Practice. 19, 2 (Apr. 2011), 139–152. DOI: https://doi.org/10.2753/MTP1069-6679190202",
      "doi": ""
    },
    {
      "text": "Hair Jr, J.F. 2017. Advanced issues in partial least squares structural equation modeling. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Hale, J.L. 2002. The theory of reasoned action. The persuasion handbook: Developments in theory and practice. 14, (2002), 259–286.",
      "doi": ""
    },
    {
      "text": "Hamari, J. 2014. Do persuasive technologies persuade? - A review of empirical studies. International Conference on Persuasive Technology (PERSUASIVE 2014) (2014), 118–136.",
      "doi": "10.1007/978-3-319-07127-5_11"
    },
    {
      "text": "Hamzah, W.M.A.F.W. 2015. Enhancement of the ARCS model for gamification of learning. Proceedings - 2014 3rd International Conference on User Science and Engineering: Experience. Engineer. Engage, i-USEr 2014 (Jan. 2015), 287–291.",
      "doi": ""
    },
    {
      "text": "Haque, M.S. 2020. A Persuasive mHealth Behavioral Change Intervention for Promoting Physical Activity in the Workplace: Feasibility Randomized Controlled Trial. JMIR formative research. 4, 5 (May 2020), e15083. DOI: https://doi.org/10.2196/15083",
      "doi": ""
    },
    {
      "text": "Haque, S. 2018. Measuring the Influence of a Persuasive Application to Promote Physical Activity. Personalizing Persuasive Technologies (PPT) Workshop at PERSUASIVE 2018 Conference (2018), 43–57.",
      "doi": ""
    },
    {
      "text": "He, H.A. 2010. One size does not fit all: Applying the transtheoretical model to energy feedback technology design. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA, 2010), 927–936.",
      "doi": "10.1145/1753326.1753464"
    },
    {
      "text": "Henseler, J. 2014. A new criterion for assessing discriminant validity in variance-based structural equation modeling. Journal of the Academy of Marketing Science. 43, 1 (Aug. 2014), 115–135. DOI: https://doi.org/10.1007/s11747-014-0403-8",
      "doi": ""
    },
    {
      "text": "Henseler, J. 2016. Testing measurement invariance of composites using partial least squares. International Marketing Review. 33, 3 (May 2016), 405–431. DOI: https://doi.org/10.1108/IMR-09-2014-0304",
      "doi": ""
    },
    {
      "text": "Higgins, S.T. 2015. A literature review on prevalence of gender differences and intersections with other vulnerabilities to tobacco use in the United States, 2004-2014. Preventive Medicine. 80, (Nov. 2015), 89–100. DOI: https://doi.org/10.1016/j.ypmed.2015.06.009",
      "doi": ""
    },
    {
      "text": "HORIUCHI, S. 2010. Relationships between stage of change for stress management behavior and perceived stress and coping. Japanese Psychological Research. 52, 4 (Nov. 2010), 291–297. DOI: https://doi.org/10.1111/j.1468-5884.2010.00444.x",
      "doi": ""
    },
    {
      "text": "Horwath, C.C. 1999. Applying the transtheoretical model to eating behaviour change: challenges and opportunities. Nutrition Research Reviews. 12, 2 (Dec. 1999), 281–317. DOI: https://doi.org/10.1079/095442299108728965",
      "doi": ""
    },
    {
      "text": "Hosseini, S. 2018. SilverCycling: Evaluating persuasive strategies to promote physical activity among older adults. Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (Hong Kong, China, May 2018), 45–50.",
      "doi": ""
    },
    {
      "text": "Hsu, A. 2014. Persuasive technology for overcoming food cravings and improving snack choices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada, 2014), 3403–3412.",
      "doi": "10.1145/2556288.2557099"
    },
    {
      "text": "Jalowski, M. 2020. Integrating Persuasive Technology in Participatory Design Workshops: Prototypes for Participant Support. International Conference on Persuasive Technology (PERSUASIVE 2020) (Apr. 2020), 30–42.",
      "doi": ""
    },
    {
      "text": "Jeen, Y. 2007. Persuasive interaction strategy for self diet system: Exploring the relation of user attitude and intervention by computerized systematic methods. International Conference on Human-Computer Interaction (2007), 450–458.",
      "doi": ""
    },
    {
      "text": "Jia, Y. 2016. Personality-targeted gamification: A survey study on personality traits and motivational affordances. Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA, May 2016), 2001–2013.",
      "doi": "10.1145/2858036.2858515"
    },
    {
      "text": "Johnson, S.S. 2008. Transtheoretical Model-based multiple behavior intervention for weight management: Effectiveness on a population basis. Preventive Medicine. 46, 3 (Mar. 2008), 238–246. DOI: https://doi.org/10.1016/j.ypmed.2007.09.010",
      "doi": ""
    },
    {
      "text": "Kaiser, H.F. 1970. A second generation little jiffy. Psychometrika. 35, 4 (1970), 401–415.",
      "doi": ""
    },
    {
      "text": "Kaptein, M. 2012. Adaptive Persuasive Systems: A Study of Tailored Persuasive Text Messages to Reduce Snacking. ACM Transactions on Interactive Intelligent Systems. 2, 2 (2012), 1–25. DOI: https://doi.org/10.1145/2209310.2209313",
      "doi": "10.1145/2209310.2209313"
    },
    {
      "text": "Kaptein, M. 2011. Means based adaptive persuasive systems. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada, 2011), 335–344.",
      "doi": "10.1145/1978942.1978990"
    },
    {
      "text": "Kaptein, M. 2015. Personalizing persuasive technologies: Explicit and implicit personalization using persuasion profiles. International Journal of Human Computer Studies. 77, (2015), 38–51. DOI: https://doi.org/10.1016/j.ijhcs.2015.01.004",
      "doi": "10.1016/j.ijhcs.2015.01.004"
    },
    {
      "text": "Karim, N.S.A. 2017. Mobile Application on Smoking Cessation Based on Persuasive Design Theory. PACIS 2017 Proceedings (Jul. 2017), 1–14.",
      "doi": ""
    },
    {
      "text": "Keller, J.M. 1987. Development and use of the ARCS model of instructional design. Journal of Instructional Development. 10, 3 (Sep. 1987), 2–10. DOI: https://doi.org/10.1007/BF02905780",
      "doi": ""
    },
    {
      "text": "Keller, J.M. 1983. Motivational design of instruction. Instructional design theories and models: An overview of their current status. 1, 1983 (1983), 383–434.",
      "doi": ""
    },
    {
      "text": "Khan, S. and Peña, J. 2020. Using persuasive messages to increase engagement with mental health video game apps. Technology and Health. Elsevier. 353–376.",
      "doi": ""
    },
    {
      "text": "Klein, P. 2019. Tailoring of a Smartphone Smoking Cessation App (Kick.it) for Serious Mental Illness Populations: Qualitative Study. JMIR human factors. 6, 3 (Sep. 2019), e14023. DOI: https://doi.org/10.2196/14023",
      "doi": ""
    },
    {
      "text": "Kupek, E. 2006. Beyond logistic regression: Structural equations modelling for binary variables and its application to investigating unobserved confounders. BMC Medical Research Methodology. 6, 1 (Mar. 2006), 1–10. DOI: https://doi.org/10.1186/1471-2288-6-13",
      "doi": ""
    },
    {
      "text": "de la Torre Díez, I. 2017. A New mHealth App for Monitoring and Awareness of Healthy Eating: Development and User Evaluation by Spanish Users. Journal of Medical Systems. 41, 7 (Jul. 2017), 1–7. DOI: https://doi.org/10.1007/s10916-017-0753-0",
      "doi": "10.1007/s10916-017-0753-0"
    },
    {
      "text": "Lankes, M. 2015. From classes to mechanics - Player type driven persuasive game development. Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom, Oct. 2015), 595–600.",
      "doi": "10.1145/2793107.2810316"
    },
    {
      "text": "Lee, J.E. 2017. Development of tailored nutrition information messages based on the transtheoretical model for smartphone application of an obesity prevention and management program for elementary-school students. Nutrition Research and Practice. 11, 3 (Jun. 2017), 247–256. DOI: https://doi.org/10.4162/nrp.2017.11.3.247",
      "doi": ""
    },
    {
      "text": "Lehto, T. and Oinas-Kukkonen, H. 2015. Examining the Persuasive Potential of Web-based Health Behavior Change Support Systems. AIS Transactions on Human-Computer Interaction. 7, 3 (Jan. 2015), 126–140.",
      "doi": ""
    },
    {
      "text": "Lehto, T. and Oinas-Kukkonen, H. 2010. Persuasive features in six weight loss websites: A qualitative evaluation. International Conference on Persuasive Technology (PERSUASIVE 2010) (2010), 162–173.",
      "doi": ""
    },
    {
      "text": "Lehto, T. and Oinas-Kukkonen, H. 2011. Persuasive features in web-based alcohol and smoking interventions: A systematic review of the literature. Journal of Medical Internet Research. 13, 3 (Jul. 2011), e46. DOI: https://doi.org/10.2196/jmir.1559",
      "doi": ""
    },
    {
      "text": "Lieffers, J.R.L. 2018. Experiences and Perceptions of Adults Accessing Publicly Available Nutrition Behavior-Change Mobile Apps for Weight Management. Journal of the Academy of Nutrition and Dietetics. 118, 2 (Feb. 2018), 229-239.e3. DOI: https://doi.org/10.1016/j.jand.2017.04.015",
      "doi": ""
    },
    {
      "text": "Van Der Lubbe, L.M. and Klein, M.C.A. 2019. Designing a system with persuasive communication to improve diet compliance for elderly users. Proceedings of the 13th EAI International Conference on Pervasive Computing Technologies for Healthcare (Trento, Italy, May 2019), 234–241.",
      "doi": "10.1145/3329189.3329217"
    },
    {
      "text": "Ludden, G.D.S. and Hekkert, P. 2014. Design for healthy behavior: design interventions and stages of change. The Colors of Care: The 9th International Conference on Design & Emotion (Bogota, Colombia, 2014), 482–488.",
      "doi": ""
    },
    {
      "text": "Mason, W. and Suri, S. 2012. Conducting behavioral research on Amazon's Mechanical Turk. Behavior Research Methods. 44, 1 (Mar. 2012), 1–23. DOI: https://doi.org/10.3758/s13428-011-0124-6",
      "doi": ""
    },
    {
      "text": "Miller, A.D. and Mynatt, E.D. 2014. StepStream: A school-based pervasive social fitness system for everyday adolescent health. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada, 2014), 2823–2832.",
      "doi": "10.1145/2556288.2557190"
    },
    {
      "text": "Moore, G. 2017. Remember to smile design of a mobile affective technology to help promote individual happiness through smiling. Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (Barcelona, Spain, May 2017), 348–354.",
      "doi": "10.1145/3154862.3154936"
    },
    {
      "text": "Mumm, J. and Mutlu, B. 2011. Designing motivational agents: The role of praise, social comparison, and embodiment in computer feedback. Computers in Human Behavior (Sep. 2011), 1643–1650.",
      "doi": ""
    },
    {
      "text": "Mun, M. 2009. PEIR, the personal environmental impact report, as a platform for participatory sensing systems research. Proceedings of the 7th ACM International Conference on Mobile Systems, Applications, and Services (Krakow, Poland, 2009), 55–68.",
      "doi": "10.1145/1555816.1555823"
    },
    {
      "text": "Muneer, A. 2020. Smart health monitoring system using IoT based smart fitness mirror. Telkomnika (Telecommunication Computing Electronics and Control). 1 (Feb. 2020), 317–331. DOI: https://doi.org/10.12928/TELKOMNIKA.v18i1.12434",
      "doi": ""
    },
    {
      "text": "Ndulue, C. and Orji, R. 2018. STD PONG: Changing risky sexual behaviour in Africa through persuasive games. Proceedings of the Second African Conference for Human Computer Interaction: Thriving Communities (Windhoek, Namibia, Dec. 2018), 1–5.",
      "doi": ""
    },
    {
      "text": "Noorbehbahani, F. and Zarein, Z. 2018. The impact of demographic factors on persuasion strategies in personalized recommender system. 2018 8th International Conference on Computer and Knowledge Engineering, ICCKE 2018 (Dec. 2018), 104–109.",
      "doi": ""
    },
    {
      "text": "Oinas-Kukkonen, H. and Harjumaa, M. 2009. Persuasive Systems Design: Key Issues, Process Model, and System Features. Communications of the Association for Information Systems. 24, 1 (2009), 96.",
      "doi": ""
    },
    {
      "text": "Opinio: https://surveys.dal.ca. Accessed: 2020-09-05.",
      "doi": ""
    },
    {
      "text": "Orji, R. 2019. Deconstructing persuasiveness of strategies in behaviour change systems using the ARCS model of motivation. Behaviour and Information Technology. 38, 4 (2019), 319–335. DOI: https://doi.org/10.1080/0144929X.2018.1520302",
      "doi": ""
    },
    {
      "text": "Orji, R. 2014. Design for Behaviour Change: A Model- driven Approach for Tailoring Persuasive Technologies. University of Saskatchewan.",
      "doi": ""
    },
    {
      "text": "Orji, R. 2015. Gender, age, and responsiveness to cialdini's persuasion strategies. International Conference on Persuasive Technology (PERSUASIVE 2015) (2015), 147–159.",
      "doi": ""
    },
    {
      "text": "Orji, R. 2017. Improving the efficacy of games for change using personalization models. ACM Transactions on Computer-Human Interaction (TOCHI). 24, 5 (2017). DOI: https://doi.org/10.1145/3119929",
      "doi": "10.1145/3119929"
    },
    {
      "text": "Orji, R. 2014. Modeling the efficacy of persuasive strategies for different gamer types in serious games for health. User Modeling and User-Adapted Interaction. 24, 5 (2014), 453–498. DOI: https://doi.org/10.1007/s11257-014-9149-8",
      "doi": "10.1007/s11257-014-9149-8"
    },
    {
      "text": "Orji, R. 2018. Personalizing persuasive strategies in gameful systems to gamification user types. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18 (2018), 1–14.",
      "doi": "10.1145/3173574.3174009"
    },
    {
      "text": "Orji, R. 2018. Personalizing persuasive technologies: Do gender and age affect susceptibility to persuasive strategies? Adjunct Publication of the 26th Conference on User Modeling, Adaptation and Personalization (Singapore, Singapore, Jul. 2018), 329–334.",
      "doi": ""
    },
    {
      "text": "Orji, R. 2018. Socially-driven persuasive health intervention design: Competition, social comparison, and cooperation. Health Informatics Journal. (2018). DOI: https://doi.org/10.1177/1460458218766570",
      "doi": ""
    },
    {
      "text": "Orji, R. 2013. Tailoring persuasive health games to gamer type. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France, 2013), 2467–2476.",
      "doi": "10.1145/2470654.2481341"
    },
    {
      "text": "Orji, R. 2017. Towards personality-driven persuasive health games and gamified systems. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17 (2017), 1015–1027.",
      "doi": "10.1145/3025453.3025577"
    },
    {
      "text": "Orji, R. 2018. Tracking feels oppressive and ‘punishy’: Exploring the costs and benefits of self-monitoring for health and wellness. DIGITAL HEALTH. 4, (Jan. 2018), 205520761879755. DOI: https://doi.org/10.1177/2055207618797554",
      "doi": ""
    },
    {
      "text": "Orji, R. and Moffatt, K. 2018. Persuasive technology for health and wellness: State-of-the-art and emerging trends. Health Informatics Journal. 24, 1 (2018), 66–91. DOI: https://doi.org/10.1177/1460458216650979",
      "doi": ""
    },
    {
      "text": "Oyebode, O. 2020. HeartHealth: A Persuasive Mobile App for Mitigating the Risk of Ischemic Heart Disease. International Conference on Persuasive Technology (Cham, 2020), 126–138.",
      "doi": ""
    },
    {
      "text": "Oyebode, O. 2020. Using Machine Learning and Thematic Analysis Methods to Evaluate Mental Health Apps Based on User Reviews. IEEE Access. 8, (2020), 111141–111158. DOI: https://doi.org/10.1109/ACCESS.2020.3002176",
      "doi": ""
    },
    {
      "text": "Oyebode, O. and Orji, R. 2020. Deconstructing Persuasive Strategies in Mental Health Apps Based on User Reviews using Natural Language Processing. Proceedings of the Eighth International Workshop on Behavior Change Support Systems co-located with the 15th International Conference on Persuasive Technology (PERSUASIVE 2020) (2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Oyibo, K. and Vassileva, J. 2020. Persuasive Features that Drive the Adoption of a Fitness Application and the Moderating Effect of Age and Gender. Multimodal Technologies and Interaction. 4, 2 (May 2020), 17. DOI: https://doi.org/10.3390/mti4020017",
      "doi": ""
    },
    {
      "text": "Paay, J. 2015. Personal counseling on smart phones for smoking cessation. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (Seoul, Republic of Korea, Apr. 2015), 1427–1432.",
      "doi": "10.1145/2702613.2732847"
    },
    {
      "text": "Paay, J. 2014. Quitty: Using technology to persuade smokers to quit. Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (Helsinki, Finland, Oct. 2014), 551–560.",
      "doi": "10.1145/2639189.2639195"
    },
    {
      "text": "Paay, J. 2015. Understanding individual differences for tailored smoking cessation apps. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea, Apr. 2015), 1699–1708.",
      "doi": "10.1145/2702123.2702321"
    },
    {
      "text": "Paldán, K. 2019. Feasibility and Clinical Relevance of a Mobile Intervention Using TrackPAD to Support Supervised Exercise Therapy in Patients With Peripheral Arterial Disease: Study Protocol for a Randomized Controlled Pilot Trial. JMIR Research Protocols. 8, 6 (Jun. 2019), e13651. DOI: https://doi.org/10.2196/13651",
      "doi": ""
    },
    {
      "text": "Patwardhan, M. 2015. Designing a mobile application to support the indicated prevention and early intervention of childhood anxiety. Proceedings of the conference on Wireless Health (Bethesda, Maryland, Oct. 2015), 1–8.",
      "doi": "10.1145/2811780.2811954"
    },
    {
      "text": "Pollak, J.P. 2010. It's time to Eat! Using mobile games to promote healthy eating. IEEE Pervasive Computing. 9, 3 (Jul. 2010), 21–27. DOI: https://doi.org/10.1109/MPRV.2010.41",
      "doi": "10.1109/MPRV.2010.41"
    },
    {
      "text": "Portz, J.D. 2016. Persuasive features in health information technology interventions for older adults with chronic diseases: a systematic review. Health and Technology. 6, 2 (2016), 89–99. DOI: https://doi.org/10.1007/s12553-016-0130-x",
      "doi": ""
    },
    {
      "text": "Prochaska, J.O. 1993. In search of how people change: Applications to addictive behaviors. Journal of Addictions Nursing. 5, 1 (1993), 2–16. DOI: https://doi.org/10.3109/10884609309149692",
      "doi": ""
    },
    {
      "text": "Prochaska, J.O. 2015. The Transtheoretical Model and Stages of Change. Health Behavior: Theory, Research, and Practice. John Wiley & Sons. 125–148.",
      "doi": ""
    },
    {
      "text": "Prochaska, J.O. and Velicer, W.F. 1997. The transtheoretical model of health behavior change. American Journal of Health Promotion. 12, 1 (Sep. 1997), 38–48. DOI: https://doi.org/10.4278/0890-1171-12.1.38",
      "doi": ""
    },
    {
      "text": "Product | SmartPLS: https://www.smartpls.com/. Accessed: 2020-08-21.",
      "doi": ""
    },
    {
      "text": "Proto.io - Prototypes that feel real: https://proto.io/. Accessed: 2020-09-05.",
      "doi": ""
    },
    {
      "text": "Puddephatt, J.-A. 2019. A Qualitative Evaluation of the Acceptability of a Tailored Smartphone Alcohol Intervention for a Military Population: Information About Drinking for Ex-Serving Personnel (InDEx) App. JMIR mHealth and uHealth. 7, 5 (May 2019), e12267. DOI: https://doi.org/10.2196/12267",
      "doi": ""
    },
    {
      "text": "Purpura, S. 2011. Fit4Life: The design of a persuasive technology promoting healthy behavior and ideal weight. Conference on Human Factors in Computing Systems - Proceedings. (2011), 423–432. DOI: https://doi.org/10.1145/1978942.1979003",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Rezai, L.S. and Burns, C.M. 2014. Using Cognitive Work Analysis and a Persuasive Design Approach to Create Effective Blood Pressure Management Systems. Proceedings of the International Symposium on Human Factors and Ergonomics in Health Care. 3, 1 (Jun. 2014), 36–43. DOI: https://doi.org/10.1177/2327857914031005",
      "doi": ""
    },
    {
      "text": "Ross, J. 2009. Who are the turkers? worker demographics in amazon mechanical turk. Tech. Rep. (2009).",
      "doi": ""
    },
    {
      "text": "Ryan, R.M. and Deci, E.L. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist. 55, 1 (2000), 68–78.",
      "doi": ""
    },
    {
      "text": "Salim, M.H.M. 2017. Mobile Application on Healthy Diet for Elderly Based on Persuasive Design. International Journal on Advanced Science, Engineering and Information Technology. 7, 1 (2017), 222–227.",
      "doi": ""
    },
    {
      "text": "Sangeeta, M. 2014. Effectiveness of ARCS Model of Motivational Design to overcome Non-Completion Rate of Students in Distance Education. Turkish Online Journal of Distance Education. 15, 2 (Apr. 2014), 194–200.",
      "doi": ""
    },
    {
      "text": "Sarstedt, M. 2011. Multigroup analysis in partial least squares (PLS) path modeling: Alternative methods and empirical results. Advances in International Marketing. 22, (2011), 195–218. DOI: https://doi.org/10.1108/S1474-7979(2011)0000022012",
      "doi": ""
    },
    {
      "text": "Sarstedt, M. and Cheah, J.-H. 2019. Partial least squares structural equation modeling using SmartPLS: a software review. Journal of Marketing Analytics. 7, 3 (2019), 196–202. DOI: https://doi.org/10.1057/s41270-019-00058-3",
      "doi": ""
    },
    {
      "text": "Schnall, R. 2015. mHealth Technology as a Persuasive Tool for Treatment, Care and Management of Persons Living with HIV. AIDS and Behavior. 19, 2 (Jun. 2015), 81–89. DOI: https://doi.org/10.1007/s10461-014-0984-8",
      "doi": ""
    },
    {
      "text": "Schulz, D.N. 2013. Effects of a web-based tailored intervention to reduce alcohol consumption in adults: Randomized controlled trial. Journal of Medical Internet Research. 15, 9 (Sep. 2013), e206. DOI: https://doi.org/10.2196/jmir.2568",
      "doi": ""
    },
    {
      "text": "Siawsolit, C. 2017. Personalized assistant for health-conscious grocery shoppers. International Conference on Persuasive Technology (PERSUASIVE 2017) (2017), 95–106.",
      "doi": ""
    },
    {
      "text": "Silva, J.M. 2006. Promoting a healthy lifestyle through a Virtual Specialist solution. CHI ’06 Extended Abstracts on Human Factors in Computing Systems (Montreal, Quebec, Canada, 2006), 1867–1872.",
      "doi": ""
    },
    {
      "text": "Small, R. V. 1997. Motivation in Instructional Design. ERIC Digest. (1997), 2–5.",
      "doi": ""
    },
    {
      "text": "Stockdale, J. 2014. Applying the ARCS design model to breastfeeding advice by midwives in order to motivate mothers to personalise their experience. Evidence Based Midwifery. 12, 1 (Mar. 2014), 4–10.",
      "doi": ""
    },
    {
      "text": "The Transtheoretical Model (Stages of Change): 2019. https://sphweb.bumc.bu.edu/otlt/mph-modules/sb/behavioralchangetheories/BehavioralChangeTheories6.html. Accessed: 2020-09-12.",
      "doi": ""
    },
    {
      "text": "Toscos, T. 2006. Chick Clique: Persuasive technology to motivate teenage girls to exercise. Conference on Human Factors in Computing Systems - Proceedings. (2006), 1873–1878. DOI: https://doi.org/10.1145/1125451.1125805",
      "doi": "10.1145/1125451.1125805"
    },
    {
      "text": "Toscos, T. 2008. Encouraging Physical Activity in Teens: Can technology help reduce barriers to physical activity in adolescent girls? 2nd International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealthcare) (2008), 218–221.",
      "doi": ""
    },
    {
      "text": "van Velsen, L. 2019. Tailoring persuasive electronic health strategies for older adults on the basis of personal motivation: Web-based survey study. Journal of Medical Internet Research. 21, 9 (Sep. 2019), e11759. DOI: https://doi.org/10.2196/11759",
      "doi": ""
    },
    {
      "text": "Vilardaga, R. 2018. User-Centered Design of Learn to Quit, a Smoking Cessation Smartphone App for People With Serious Mental Illness. JMIR serious games. 6, 1 (Jan. 2018), e2. DOI: https://doi.org/10.2196/games.8881",
      "doi": ""
    },
    {
      "text": "Wang, Y. and Reiterer, H. 2019. The point-of-choice prompt or the always-on progress bar?: A pilot study of reminders for prolonged sedentary behavior change. Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland UK, May 2019), 1–6.",
      "doi": "10.1145/3290607.3313050"
    },
    {
      "text": "Wiafe, I. and Nakata, K. 2012. Bibliographic analysis of persuasive systems: techniques, methods and domains of application. 7th International Conference on Persuasive Technology (PERSUASIVE 2012) (Linköping, Sweden, 2012), 61–64.",
      "doi": ""
    },
    {
      "text": "Wigfield, A. and Eccles, J.S. 2000. Expectancy–Value Theory of Achievement Motivation. Contemporary Educational Psychology. 25, 1 (Jan. 2000), 68–81. DOI: https://doi.org/10.1006/CEPS.1999.1015",
      "doi": ""
    },
    {
      "text": "Ying, M.-H. and Yang, K.-T. 2013. A game-based learning system using the ARCS model and fuzzy logic. Journal of Software. 8, 9 (2013), 2155–2163.",
      "doi": ""
    },
    {
      "text": "Yocco, V. 2018. Dwelling On The Past: The Importance Of Self Reflection (Part 2). Smashing Magazine.",
      "doi": ""
    },
    {
      "text": "Yusoff, Z. and Kamsin, A. 2015. Game rhetoric: Interaction design model of persuasive learning for serious games. International Conference on Learning and Collaboration Technologies (2015), 644–654.",
      "doi": ""
    },
    {
      "text": "Zan, S. 2015. Patient engagement with a mobile web-based telemonitoring system for heart failure self-management: a pilot study. JMIR mHealth and uHealth. 3, 2 (Apr. 2015), e33. DOI: https://doi.org/10.2196/mhealth.3789",
      "doi": ""
    },
    {
      "text": "Zulkifli, A.N. 2015. Interactive persuasive learning elements among elderly: A measurement model. Jurnal Teknologi. 77, 4 (2015).",
      "doi": ""
    }
  ]
}