{
  "doi": "10.1145/3411764.3445044",
  "title": "Exploring the Opportunities for Online Learning Platforms to Support the Emergency Home School Context",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The COVID-19 pandemic and subsequent closure of schools forced families across the globe to transition to school at home. This unprecedented context is likely to have a lasting impact on the practice of schooling and the role of online, digital platforms within school contexts. In this paper we present a contextual inquiry of an ‘emergency home school context’, detailing how nine young families in Melbourne, Australia adapted to the unexpected introduction of school to the home following the government-directed closure of schools. Through an online interview and photo-journal study, we develop an emplaced understanding of the context detailing how the relations between people and places around the home evolved over time. We present five design considerations for digital platforms to support the emergency home school context, placing focus on the fluid roles, relationships and evolving sense of place.",
  "authors": [
    {
      "name": "Bronwyn J. Cumbo",
      "institution": "Faculty of Education Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758976557",
      "orcid": "missing"
    },
    {
      "name": "Tom Bartindale",
      "institution": "Action Lab, Faculty of IT Monash University, Australia",
      "img": "/do/10.1145/contrib-81416597993/rel-imgonly/81416597993.jpg",
      "acmid": "81416597993",
      "orcid": "0000-0002-0476-3422"
    },
    {
      "name": "Dan Richardson",
      "institution": "Action Lab, Faculty of IT Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021231",
      "orcid": "0000-0001-6652-071X"
    }
  ],
  "references": [
    {
      "text": "Elen Mae M Apostol, Abegail M Apolonio, Bonifacio R. Jose Jr., Eleanor G Garingan, and Romiro G Bautista. 2016. Optimizing classroom instruction through online instructional delivery technique. American Journal of Educational Research 4, 4 (2016), 302–306. https://doi.org/10.12691/education-4-4-2",
      "doi": ""
    },
    {
      "text": "H. Beyer and K. Holtzblatt. 1994. Contextual Design. In Defining Customer Centered Systems. Morgan Kaufmann, Burlington, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Aras Bozkurt, Insung Jung, Junhong Xiao, Viviane Vladimirschi, Robert Schuwer, Gennady Egorov, Sarah R Lambert, Maha Al-Freih, Judith Pete, Don Olcott, Virginia Rodes, Ignacio Aranciaga, Maha Bali, Abel V Alvarez, Jennifer Roberts, Angelica Pazurek, Juliana Elisa Raffaghelli, Nikos Panagiotou, Perrine De Coëtlogon, Sadik Shahadu, Mark Brown, Tutaleni I Asino, Josephine Tumwesige, Tzinti Ramírez Reyes, Emma Barrios Ipenza, Ebba Ossiannilsson, Melissa Bond, Kamel Belhamel, Valerie Irvine, Ramesh C Sharma, Taskeen Adam, Ben Janssen, Tatiana Sklyarova, Nicoleta Olcott, Alejandra Ambrosino, Chrysoula Lazou, Bertrand Mocquet, Mattias Mano, and Michael Paskevicius. 2020. A global outlook to the interruption of education due to COVID-19 Pandemic: Navigating in a time of uncertainty and crisis. Asian Journal of Distance Education 15, 1 (2020), 1–126. https://doi.org/10.5281/zenodo.3878572",
      "doi": ""
    },
    {
      "text": "Sjaak Braster, Ian Grosvenor, and Maria del Mar del Pozo Andres. 2011. The Black Box of Schooling: A Cultural History of the Classroom. Peter Lang, New York, New York. 330 pages.",
      "doi": ""
    },
    {
      "text": "Urie Bronfenbrenner. 1992. Ecological systems theory.Jessica Kingsley Publishers.",
      "doi": ""
    },
    {
      "text": "Natalie Brown, Kitty Te Riele, Becky Shelley, Jessica Woodroffe, Aishah Bakhtiar, Tess Crellin, Shoni Ellis, Oliver Grant, Vikki Iwanicki, Grace Johnston, Subhash Koirala, Megan Lang, Dean Mundey, Sarah Stewart, and Melody West. 2020. Learning at home during COVID-19: Effects on vulnerable young Australians Independent Rapid Response Report. Technical Report April. Peter Underwood Centre, Hobart, Tas. http://creativecommons.org/licenses/by/3.0/au/deed.en.Thefulllicencetermsareavailablefromhttp://creativecommons.org/licenses/by/3.0/au/legalcode.",
      "doi": ""
    },
    {
      "text": "C. Burke, P. Cunninghma, and I. Grosvenor. 2010. Putting education in its place’: space, place and materialities in the history of education. History of Education 39, 6 (2010), 677–680.",
      "doi": ""
    },
    {
      "text": "Richard Allen Carter, Mary Rice, Sohyun Yang, and Haidee A. Jackson. 2020. Self-regulated learning in online learning environments: strategies for remote learning. Information and Learning Science 121, 5-6 (2020), 311–319. https://doi.org/10.1108/ILS-04-2020-0114",
      "doi": ""
    },
    {
      "text": "Lorenzo Alemán de la Garza, Alessandra Anichini, Péter Antal, Aurélie Beaune, and Helen Crompton. 2019. Rethinking Pedagogy: Exploring the Potential of Digital Technology in Achieving Quality Education. Technical Report. Mahatma Gandhi Institute of Education for Peace and Sustainable Development, New Dehli, India. 4534–4538 pages. https://doi.org/10.21125/inted.2020.1260",
      "doi": ""
    },
    {
      "text": "Terrence Defranco and Jeremy Roschelle. 2020. Detecting/preventing infections, and moving instruction online. Commun. ACM 63, 6 (2020), 8–9. https://doi.org/10.1145/3392370",
      "doi": "10.1145/3392370"
    },
    {
      "text": "M. D. Dickey. 2005. Three-dimensional virtual worlds and distance learning: two case studies of Active Worlds as a medium for distance education. British Journal of Educational Technology 36, 3 (2005), 439–451. https://doi.org/10.1016/B978-0-12-813467-2.00063-8",
      "doi": ""
    },
    {
      "text": "P. Dourish. 2004. What we talk about when we talk about context. Personal and Ubiquitous Computing 8, 1 (2004), 19–30. https://doi.org/10.1007/s00779-003-0253-8",
      "doi": "10.1007/s00779-003-0253-8"
    },
    {
      "text": "Catherine Drane, Lynette Vernon, and Sarah O Shea. 2020. The Impact of ‘ Learning at Home ’ on The Educational Outcomes of Vulnerable Children in Australia during the COVID-19 Pandemic. Technical Report. Curtin University, Australia.https://www.ncsehe.edu.au/publications/learning-at-home-educational-outcomes-vulnerable-children-australia-covid-19/",
      "doi": ""
    },
    {
      "text": "Anne Edwards. 2011. Building common knowledge at the boundaries between professional practices: Relational agency and relational expertise in systems of distributed expertise. International Journal of Educational Research 50, 1 (2011), 33–39. https://doi.org/10.1016/j.ijer.2011.04.007",
      "doi": ""
    },
    {
      "text": "Neyfy Fernandez. 2020. Primary Education and the Use of Technology. (2020).",
      "doi": ""
    },
    {
      "text": "Fernando M. Reimers and Andreas Schleicher. 2020. A framework to guide an education response to the COVID - 19 Pandemic of 2020. Oecd (2020), 1–40.",
      "doi": ""
    },
    {
      "text": "GCSN. 2020. Closing the Digital Divide during the COVID-19 Lockdown : Student , whānau and staff perspectives. Technical Report. Greater Christchurch Schools Network, Christchurch, New Zealand. 1–97 pages. https://www.gcsn.school.nz/post/report-closing-the-digital-divide-during-the-covid-19-lockdown",
      "doi": ""
    },
    {
      "text": "Amanda Gearing. 2013. Harnessing the power of real and virtual social networks during disasters. The National Emergency Response 26, 3 Winter (2013), 8–11.",
      "doi": ""
    },
    {
      "text": "Charles Hodges, Stephanie Moore, Barb Lockee, Torrey Trust, and Aaron Bond. 2020. The difference between emergency remote teaching and online learning. Educause Review 27(2020).",
      "doi": ""
    },
    {
      "text": "Anne Jonas. 2019. Off limits: Virtual schools in an era of connection and inequality. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW (2019), 60–63. https://doi.org/10.1145/3311957.3361847",
      "doi": "10.1145/3311957.3361847"
    },
    {
      "text": "David A Joyner. 2020. Peripheral and Semi-Peripheral Community. In Proceedings of the Seventh ACM Conference on Learning @ Scale (L@S’20). Association for Computing Machinery, New York, NY, USA, 313–316. https://doi.org/10.1145/3386527.3406736",
      "doi": "10.1145/3386527.3406736"
    },
    {
      "text": "Fernando Kleiman, Sebastiaan Meijer, and Marijn Janssen. 2020. Gaming for Meaningful Interactions in Teleworking Lessons Learned during the COVID-19 Pandemic from Integrating. Digit. Gov. Res. Pract. 1, 4 (2020), 1–5.",
      "doi": "10.1145/3416308"
    },
    {
      "text": "Johannes König, Daniela J. Jäger-Biela, and Nina Glutsch. 2020. Adapting to online teaching during COVID-19 school closure: teacher education and teacher competence effects among early career teachers in Germany. European Journal of Teacher Education(2020), 1–15. https://doi.org/10.1080/02619768.2020.1809650",
      "doi": ""
    },
    {
      "text": "Jean Lave, Etienne Wenger, 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Danielle Lottridge. 2020. A crash course in online learning. Interactions 27, 4 (2020), 9–10. https://doi.org/10.1145/3406106",
      "doi": "10.1145/3406104"
    },
    {
      "text": "Megan R Luce, Shelley Goldman, and Tanner Vea. 2017. Designing for family science explorations anytime, anywhere. Science Education 101, 2 (2017), 251–277.",
      "doi": ""
    },
    {
      "text": "L. Major, P. Warwick, I. Rasmussen, S. Ludvigsen, and V. Cook. 2018. Classroom dialogue and digital technologies: A scoping review. Education and Information Technologies 23, 5 (2018), 1995–2028. https://doi.org/10.1007/s10639-018-9701-y",
      "doi": "10.1007/s10639-018-9701-y"
    },
    {
      "text": "Teresa Martín-Blas and Ana Serrano-Fernández. 2009. The role of new technologies in the learning process: Moodle as a teaching tool in Physics. Computers & Education 52, 1 (2009), 35–44.",
      "doi": "10.1016/j.compedu.2008.06.005"
    },
    {
      "text": "Gadille Martine and Impedovo Maria Antonietta. 2019. School goes online with avatars: Extended learning in a secondary school. Computer-Supported Collaborative Learning Conference, CSCL 2 (2019), 549–552.",
      "doi": ""
    },
    {
      "text": "Matthew B Miles and A Michael Huberman. 1994. Qualitative data analysis: An expanded sourcebook. sage.",
      "doi": ""
    },
    {
      "text": "Martin Oliver. 2016. Of clouds and cables: What do students need when they learn with technology?. In Proceedings of the Knowledge Management in Organisations Conference (KMO’16). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/2925995.2926051",
      "doi": "10.1145/2925995.2926051"
    },
    {
      "text": "Debajyoti Pal, Vajirasak Vanijja, and Syamal Patra. 2020. E-Learning During Covid-19. The Veterinary record 186, 16 (2020), 521.",
      "doi": ""
    },
    {
      "text": "Thanaporn Patikorn and Neil T. Heffernan. 2020. Effectiveness of Crowd-Sourcing On-Demand Assistance from Teachers in Online Learning Platforms. (2020), 115–124. https://doi.org/10.1145/3386527.3405912",
      "doi": ""
    },
    {
      "text": "Sarah Pink. 2011. From embodiment to emplacement: Re-thinking competing bodies, senses and spatialities. Sport, Education and Society 16, 3 (2011), 343–355. https://doi.org/10.1080/13573322.2011.565965",
      "doi": ""
    },
    {
      "text": "Dan Richardson and Ahmed Kharrufa. 2020. We are the Greatest Showmen: Configuring a Framework for Project-Based Mobile Learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376650"
    },
    {
      "text": "Pasi Sahlberg. 2020. Will the pandemic change schools?Journal of Professional Capital and Community (2020). https://doi.org/10.1108/JPCC-05-2020-0026",
      "doi": ""
    },
    {
      "text": "Neil Selwyn. 2011. ’It’s all about standardisation’ - Exploring the digital (re)configuration of school management and administration. Cambridge Journal of Education 41, 4 (2011), 473–488. https://doi.org/10.1080/0305764X.2011.625003",
      "doi": ""
    },
    {
      "text": "Neil Selwyn and Petar Jandrić. 2020. Postdigital Living in the Age of Covid-19: Unsettling What We See as Possible. Postdigital Science and EducationJuly (2020), 1–17. https://doi.org/10.1007/s42438-020-00166-9",
      "doi": ""
    },
    {
      "text": "Mike Sharples, Maria Aristeidou, Eloy Villasclaras-Fernández, Christothea Herodotou, and Eileen Scanlon. 2017. The Sense-it App: A Smartphone Sensor Toolkit for Citizen Inquiry Learning. International Journal of Mobile and Blended Learning (IJMBL) 9, 2(2017), 16–38.",
      "doi": "10.4018/IJMBL.2017040102"
    },
    {
      "text": "Clay Spinuzzi. 2005. The methodology of participatory design. Technical communication 52, 2 (2005), 163–174.",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press.",
      "doi": "10.5555/38407"
    },
    {
      "text": "Na Sun. 2017. Enhancing visibility of distance learners to promote community. CSCW 2017 - Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(2017), 101–105. https://doi.org/10.1145/3022198.3024943",
      "doi": "10.1145/3022198.3024943"
    },
    {
      "text": "Na Sun, Xiying Wang, and Mary Beth Rosson. 2019. How do distance learners connect? Shared identity, focused work and future possibilities. Conference on Human Factors in Computing Systems - Proceedings (2019), 1–12. https://doi.org/10.1145/3290605.3300662",
      "doi": ""
    },
    {
      "text": "Tuul Triyason, Anuchart Tassanaviboon, and Prasert Kanthamanon. 2020. Hybrid Classroom. Proceedings of the 11th International Conference on Advances in Information Technology (2020), 1–8. https://doi.org/10.1145/3406601.3406635",
      "doi": ""
    },
    {
      "text": "Wim Van Lancker and Zachary Parolin. 2020. COVID-19, school closures, and child poverty: a social crisis in the making. , e243-e244 pages. https://doi.org/10.1016/S2468-2667(20)30084-0",
      "doi": ""
    },
    {
      "text": "Sue Waite. 2010. Losing our way? The downward path for outdoor learning for children aged 2–11 years. Journal of Adventure Education & Outdoor Learning 10, 2 (2010), 111–126.",
      "doi": ""
    },
    {
      "text": "Steve Wheeler. 2001. Information and communication technologies and the changing role of the teacher. Journal of Educational Media 26, 1 (2001), 7–17.",
      "doi": ""
    }
  ]
}