{
  "doi": "10.1145/3411764.3445720",
  "title": "The Public Life of Data: Investigating Reactions to Visualizations on Reddit",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "This research investigates how people engage with data visualizations when commenting on the social platform Reddit. There has been considerable research on collaborative sensemaking with visualizations and the personal relation of people with data. Yet, little is known about how public audiences without specific expertise and shared incentives openly express their thoughts, feelings, and insights in response to data visualizations. Motivated by the extensive social exchange around visualizations in online communities, this research examines characteristics and motivations of people’s reactions to posts featuring visualizations. Following a Grounded Theory approach, we study 475 reactions from the /r/dataisbeautiful community, identify ten distinguishable reaction types, and consider their contribution to the discourse. A follow-up survey with 168 Reddit users clarified their intentions to react. Our results help understand the role of personal perspectives on data and inform future interfaces that integrate audience reactions into visualizations to foster a public discourse about data.",
  "tags": [
    "data visualization",
    "reddit",
    "personal data"
  ],
  "authors": [
    {
      "name": "Tobias Kauer",
      "institution": "School of Informatics University of Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700522",
      "orcid": "missing"
    },
    {
      "name": "Marian Dörk",
      "institution": "UCLAB University of Applied Sciences Potsdam, Germany",
      "img": "/do/10.1145/contrib-81414607074/rel-imgonly/fhp_2019_portrait_closeup.jpg",
      "acmid": "81414607074",
      "orcid": "missing"
    },
    {
      "name": "Arran L. Ridley",
      "institution": "UCLAB Potsdam University of Applied Science, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700421",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Bach",
      "institution": "School of Informatics Edinburgh University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482661013",
      "orcid": "0000-0002-9201-7744"
    }
  ],
  "references": [
    {
      "text": "Benjamin Bach, Nathalie Henry Riche, Sheelagh Carpendale, and Hanspeter Pfister. 2017. The emerging genre of data comics. IEEE computer graphics and applications 37, 3 (2017), 6–13.",
      "doi": "10.1109/MCG.2017.33"
    },
    {
      "text": "Elizabeth F Churchill, Jonathan Trevor, Sara Bly, Les Nelson, and Davor Cubranic. 2000. Anchored conversations: chatting in the context of a document. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 454–461.",
      "doi": "10.1145/332040.332475"
    },
    {
      "text": "Matthew Conlen, Alex Kale, and Jeffrey Heer. 2019. Capture & analysis of active reading behaviors for interactive articles on the web. In Computer Graphics Forum, Vol. 38. Wiley Online Library, 687–698.",
      "doi": ""
    },
    {
      "text": "Alexandra Diehl, Alfie Abdul-Rahman, Mennatallah El-Assady, Benjamin Bach, Daniel A Keim, and Min Chen. 2018. VisGuides: A Forum for Discussing Visualization Guidelines.. In EuroVis (Short Papers). 61–65.",
      "doi": ""
    },
    {
      "text": "Marian Dörk, Patrick Feng, Christopher Collins, and Sheelagh Carpendale. 2013. Critical InfoVis: exploring the politics of visualization. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 2189–2198.",
      "doi": ""
    },
    {
      "text": "Bryan Dosono, Bryan Semaan, and Jeff Hemsley. 2017. Exploring AAPI identity online: Political ideology as a factor affecting identity work on Reddit. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 2528–2535.",
      "doi": "10.1145/3027063.3053185"
    },
    {
      "text": "Catherine D’Ignazio and Lauren F Klein. 2016. Feminist data visualization. In Workshop on Visualization for the Digital Humanities (VIS4DH), Baltimore. IEEE.",
      "doi": ""
    },
    {
      "text": "Micheline Elias and Anastasia Bezerianos. 2012. Annotating BI visualization dashboards: Needs & challenges. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1641–1650.",
      "doi": "10.1145/2207676.2208288"
    },
    {
      "text": "Eric Gilbert. 2013. Widespread underprovision on Reddit. In Proceedings of the 2013 conference on Computer supported cooperative work. 803–808.",
      "doi": "10.1145/2441776.2441866"
    },
    {
      "text": "Steve Haroz, Robert Kosara, and Steven L Franconeri. 2015. Isotype visualization: Working memory, performance, and engagement with pictographs. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1191–1200.",
      "doi": "10.1145/2702123.2702275"
    },
    {
      "text": "Jeffrey Heer, Fernanda B Viégas, and Martin Wattenberg. 2007. Voyagers and voyeurs: supporting asynchronous collaborative information visualization. In Proceedings of the SIGCHI conference on Human factors in computing systems. 1029–1038.",
      "doi": "10.1145/1240624.1240781"
    },
    {
      "text": "William C Hill, James D Hollan, Dave Wroblewski, and Tim McCandless. 1992. Edit wear and read wear. In Proceedings of the SIGCHI conference on Human factors in computing systems. 3–9.",
      "doi": "10.1145/142750.142751"
    },
    {
      "text": "Uta Hinrichs, Holly Schmidt, and Sheelagh Carpendale. 2008. EMDialog: Bringing information visualization into the museum. IEEE transactions on visualization and computer graphics 14, 6(2008), 1181–1188.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman, Nicholas Diakopoulos, Elaheh Momeni, and Eytan Adar. 2015. Content, context, and critique: Commenting on a data visualization blog. In Proceedings of the 18th ACM conference on computer supported cooperative work & social computing. 1170–1175.",
      "doi": "10.1145/2675133.2675207"
    },
    {
      "text": "Ya-Hsin Hung and Paul Parsons. 2017. Assessing user engagement in information visualization. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1708–1717.",
      "doi": "10.1145/3027063.3053113"
    },
    {
      "text": "Samuel Huron, Petra Isenberg, and Jean Daniel Fekete. 2013. PolemicTweet: Video annotation and analysis through tagged tweets. In IFIP Conference on Human-Computer Interaction. Springer, 135–152.",
      "doi": ""
    },
    {
      "text": "Petra Isenberg, Niklas Elmqvist, Jean Scholtz, Daniel Cernea, Kwan-Liu Ma, and Hans Hagen. 2011. Collaborative visualization: Definition, challenges, and research agenda. Information Visualization 10, 4 (2011), 310–326.",
      "doi": "10.1177/1473871611412817"
    },
    {
      "text": "Tobias Kauer, Benjamin Bach, and Marian Dörk. 2019. Participatory Deep Maps: Towards Discursive User Engagement With Data Visualizations. In CityVis: 2nd Workshop on Urban Data at IEEE VIS.",
      "doi": ""
    },
    {
      "text": "Helen Kennedy and Rosemary Lucy Hill. 2018. The feeling of numbers: Emotions in everyday engagements with data and their visualisation. Sociology 52, 4 (2018), 830–848.",
      "doi": ""
    },
    {
      "text": "Helen Kennedy, Rosemary Lucy Hill, William Allen, and Andy Kirk. 2016. Engaging with (big) data visualizations: Factors that affect engagement and resulting new definitions of effectiveness. First Monday 21, 11 (2016).",
      "doi": ""
    },
    {
      "text": "Danielle K Kilgo, Joseph J Yoo, Vinicio Sinta, Stephanie Geise, Melissa Suran, and Thomas J Johnson. 2016. Led it on Reddit: An exploratory study examining opinion leadership on Reddit. First Monday (2016).",
      "doi": ""
    },
    {
      "text": "Manissa M Maharawal and Erin McElroy. 2018. The Anti-Eviction Mapping Project: Counter Mapping and Oral History toward Bay Area Housing Justice. Annals of the American Association of Geographers 108, 2(2018), 380–389.",
      "doi": ""
    },
    {
      "text": "Narges Mahyar, Sung-Hee Kim, and Bum Chul Kwon. 2015. Towards a taxonomy for evaluating user engagement in information visualization. In Workshop on Personal Visualization: Exploring Everyday Life, Vol. 3. 2.",
      "doi": ""
    },
    {
      "text": "Alexey N Medvedev, Renaud Lambiotte, and Jean-Charles Delvenne. 2017. The anatomy of Reddit: An overview of academic research. In Dynamics on and of Complex Networks. Springer, 183–204.",
      "doi": ""
    },
    {
      "text": "Thomas L Naps, Guido Rößling, Vicki Almstrum, Wanda Dann, Rudolf Fleischer, Chris Hundhausen, Ari Korhonen, Lauri Malmi, Myles McNally, Susan Rodger, 2002. Exploring the role of visualization and engagement in computer science education. In Working group reports from ITiCSE on Innovation and technology in computer science education. 131–152.",
      "doi": ""
    },
    {
      "text": "Evan M Peck, Sofia E Ayuso, and Omar El-Etr. 2019. Data is personal: Attitudes and perceptions of data visualization in rural pennsylvania. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Donghao Ren, Matthew Brehmer, Bongshin Lee, Tobias Höllerer, and Eun Kyoung Choe. 2017. Chartaccent: Annotation for data-driven storytelling. In 2017 IEEE Pacific Visualization Symposium (PacificVis). Ieee, 230–239.",
      "doi": ""
    },
    {
      "text": "Edward Segel and Jeffrey Heer. 2010. Narrative visualization: Telling stories with data. IEEE transactions on visualization and computer graphics 16, 6(2010), 1139–1148.",
      "doi": ""
    },
    {
      "text": "Xinhuan Shu, Aoyu Wu, Junxiu Tang, Benjamin Bach, Yingcai Wu, and Huamin Qu. 2020. What Makes a Data-GIF Understandable?arXiv preprint arXiv:2008.07227(2020).",
      "doi": ""
    },
    {
      "text": "David Sprague and Melanie Tory. 2012. Exploring how and why people use visualizations in casual contexts: Modeling user goals and regulated motivations. Information Visualization 11, 2 (2012), 106–123.",
      "doi": "10.1177/1473871611433710"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1994. Grounded theory methodology. Handbook of qualitative research 17, 1 (1994), 273–285.",
      "doi": ""
    },
    {
      "text": "Alice Thudt, Uta Hinrichs, and Sheelagh Carpendale. 2012. The bohemian bookshelf: supporting serendipitous book discoveries through information visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1461–1470.",
      "doi": "10.1145/2207676.2208607"
    },
    {
      "text": "Nina Valkanova, Robert Walter, Andrew Vande Moere, and Jörg Müller. 2014. MyPosition: sparking civic discourse by a public interactive poll visualization. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 1323–1332.",
      "doi": "10.1145/2531602.2531639"
    },
    {
      "text": "Pierre Vanhulst, Florian Evequoz, Raphael Tuor, and Denis Lalanne. 2018. A descriptive attribute-based framework for annotations in data visualization. In International Joint Conference on Computer Vision, Imaging and Computer Graphics. Springer, 143–166.",
      "doi": ""
    },
    {
      "text": "Pierre Vanhulst, Florian Évéquoz, Raphaël Tuor, and Denis Lalanne. 2018. Designing a Classification for User-authored Annotations in Data Visualization.. In VISIGRAPP (3: IVAPP). 85–96.",
      "doi": ""
    },
    {
      "text": "Fernanda B Viegas, Martin Wattenberg, Frank Van Ham, Jesse Kriss, and Matt McKeon. 2007. Manyeyes: a site for visualization at internet scale. IEEE transactions on visualization and computer graphics 13, 6(2007), 1121–1128.",
      "doi": ""
    },
    {
      "text": "Jagoda Walny, Sarah Storteboom, Richard Pusch, Steven Munsu Hwang, Søren Knudsen, Sheelagh Carpendale, and Wesley Willett. 2020. PixelClipper: Supporting Public Engagement and Conversation About Visualizations. IEEE Computer Graphics and Applications 40, 2 (2020), 57–70.",
      "doi": "10.1109/MCG.2020.2968906"
    },
    {
      "text": "Zezhong Wang, Shunming Wang, Matteo Farinella, Dave Murray-Rust, Nathalie Henry Riche, and Benjamin Bach. 2019. Comparing Effectiveness and Engagement of Data Comics and Infographics. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300483"
    },
    {
      "text": "Martin Wattenberg. 2005. Baby names, visualization, and social data analysis. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005. IEEE, 1–7.",
      "doi": ""
    },
    {
      "text": "Wesley Willett, Jeffrey Heer, Joseph Hellerstein, and Maneesh Agrawala. 2011. CommentSpace: structured support for collaborative visual analysis. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 3131–3140.",
      "doi": "10.1145/1978942.1979407"
    },
    {
      "text": "Zhenpeng Zhao, Rachael Marr, and Niklas Elmqvist. 2015. Data comics: Sequential art for data-driven storytelling. tech. report (2015).",
      "doi": ""
    }
  ]
}