{
  "doi": "10.1145/3411764.3445222",
  "title": "Personalizing Ambience and Illusionary Presence: How People Use “Study with me” Videos to Create Effective Studying Environments",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "“Study with me” videos contain footage of people studying for hours, in which social components like conversations or informational content like instructions are absent. Recently, they became increasingly popular on video-sharing platforms. This paper provides the first broad look into what “study with me” videos are and how people use them. We analyzed 30 “study with me” videos and conducted 12 interviews with their viewers to understand their motivation and viewing practices. We identified a three-factor model that explains the mechanism for shaping a satisfactory studying experience in general. One of the factors, a well-suited ambience, was difficult to achieve because of two common challenges: external conditions that prevent studying in study-friendly places and extra cost needed to create a personally desired ambience. We found that the viewers used “study with me” videos to create a personalized ambience at a lower cost, to find controllable peer pressure, and to get emotional support. These findings suggest that the viewers self-regulate their learning through watching “study with me” videos to improve efficiency even when studying alone at home.",
  "tags": [
    "interview",
    "social presence",
    "motivation",
    "distraction",
    "social learning",
    "productivity",
    "mixed-method",
    "study with me",
    "self-regulated learning"
  ],
  "authors": [
    {
      "name": "Yoonjoo Lee",
      "institution": "School of Computing, KAIST, Daejeon, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702253",
      "orcid": "0000-0001-7491-986X"
    },
    {
      "name": "John Joon Young Chung",
      "institution": "Computer Science and Engineering, University of Michigan, Ann Arbor, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474867",
      "orcid": "missing"
    },
    {
      "name": "Jean Y. Song",
      "institution": "School of Computing, KAIST, Daejeon, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659249417",
      "orcid": "0000-0003-4379-3971"
    },
    {
      "name": "Minsuk Chang",
      "institution": "School of Computing, KAIST, Daejeon and Naver AI Lab, Seongnam, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163123",
      "orcid": "missing"
    },
    {
      "name": "Juho Kim",
      "institution": "School of Computing, KAIST, Daejeon, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484651506",
      "orcid": "0000-0001-6348-4127"
    }
  ],
  "references": [
    {
      "text": "Rachel F Adler and Raquel Benbunan-Fich. 2013. Self-interruptions in discretionary multitasking. Computers in Human Behavior 29, 4 (2013), 1441–1449.",
      "doi": "10.1016/j.chb.2013.01.040"
    },
    {
      "text": "Morgan G. Ames, Janet Go, Joseph ’Jofish’ Kaye, and Mirjana Spasojevic. 2010. Making Love in the Network Closet: The Benefits and Work of Family Videochat. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (Savannah, Georgia, USA) (CSCW ’10). Association for Computing Machinery, New York, NY, USA, 145–154. https://doi.org/10.1145/1718918.1718946",
      "doi": "10.1145/1718918.1718946"
    },
    {
      "text": "Laurensia Anjani, Terrance Mok, Anthony Tang, Lora Oehlberg, and Wooi Boon Goh. 2020. Why Do People Watch Others Eat Food? An Empirical Study on the Motivations and Practices of Mukbang Viewers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376567",
      "doi": "10.1145/3313831.3376567"
    },
    {
      "text": "Albert Bandura. 1971. Social learning theory. Morristown.",
      "doi": ""
    },
    {
      "text": "Jered Borup, Richard E West, and Charles R Graham. 2012. Improving online social presence through asynchronous video. The Internet and Higher Education 15, 3 (2012), 195–203.",
      "doi": ""
    },
    {
      "text": "Jered Borup, Richard E West, Rebecca A Thomas, and Charles R Graham. 2014. Examining the impact of video feedback on instructor social presence in blended courses. International Review of Research in Open and Distributed Learning 15, 3(2014), 232–256.",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Gina Venolia, and John C. Tang. 2012. Focusing on Shared Experiences: Moving beyond the Camera in Video Communication. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 96–105. https://doi.org/10.1145/2317956.2317973",
      "doi": "10.1145/2317956.2317973"
    },
    {
      "text": "Francesco Cirillo. 2006. The pomodoro technique (the pomodoro). Agile Processes in Software Engineering and 54, 2 (2006), 35.",
      "doi": ""
    },
    {
      "text": "Derrick Coetzee, Armando Fox, Marti A. Hearst, and Bjoern Hartmann. 2014. Chatrooms in MOOCs: All Talk and No Action. In Proceedings of the First ACM Conference on Learning @ Scale Conference (Atlanta, Georgia, USA) (L@S ’14). Association for Computing Machinery, New York, NY, USA, 127–136. https://doi.org/10.1145/2556325.2566242",
      "doi": "10.1145/2556325.2566242"
    },
    {
      "text": "D. Coetzee, Seongtaek Lim, Armando Fox, Bjorn Hartmann, and Marti A. Hearst. 2015. Structuring Interactions for Large-Scale Synchronous Peer Learning. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1139–1152. https://doi.org/10.1145/2675133.2675251",
      "doi": "10.1145/2675133.2675251"
    },
    {
      "text": "Catherine H Crouch and Eric Mazur. 2001. Peer instruction: Ten years of experience and results. American journal of physics 69, 9 (2001), 970–977.",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Gloria Mark, and Víctor M. González. 2011. Why Do i Keep Interrupting Myself? Environment, Habit and Self-Interruption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 3127–3130. https://doi.org/10.1145/1978942.1979405",
      "doi": "10.1145/1978942.1979405"
    },
    {
      "text": "Estudiar Derecho. 2020 (accessed September 14, 2020). Primer study with me. https://www.youtube.com/watch?v=g8F23R-P14k",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM transactions on computer-human interaction (TOCHI) 7, 1(2000), 59–83.",
      "doi": ""
    },
    {
      "text": "Forest. (Online; Retrieved July 16, 2020). Forestapp.cc. https://www.forestapp.cc",
      "doi": ""
    },
    {
      "text": "Nancy Fried Foster, Helen Anderson, Alison Bersani, Solomon Blaylock, Judi Briden, Susan K Cardinal, Cynthia Carlton, Katie Clark, Nora Dimmock, Sarada George, 2013. Studying students: A second look. Association of College & Research Libraries Chicago, Ill., USA.",
      "doi": ""
    },
    {
      "text": "C. Ailie Fraser, Joy O. Kim, Alison Thornsberry, Scott Klemmer, and Mira Dontcheva. 2019. Sharing the Studio: How Creative Livestreaming Can Inspire, Educate, and Engage. In Proceedings of the 2019 on Creativity and Cognition (San Diego, CA, USA) (C&C ’19). Association for Computing Machinery, New York, NY, USA, 144–155. https://doi.org/10.1145/3325480.3325485",
      "doi": "10.1145/3325480.3325485"
    },
    {
      "text": "Freedom. (Online; Retrieved July 16, 2020). freedom.to. https://freedom.to",
      "doi": ""
    },
    {
      "text": "Barney G Glaser, Anselm L Strauss, and Elizabeth Strutzel. 1968. The discovery of grounded theory; strategies for qualitative research. Nursing research 17, 4 (1968), 364.",
      "doi": ""
    },
    {
      "text": "Leo A. Goodman. 1961. Snowball Sampling. The Annals of Mathematical Statistics 32, 1 (1961), 148–170. http://www.jstor.org/stable/2237615",
      "doi": ""
    },
    {
      "text": "Gooroomee. (Online; Retrieved Sep 12, 2020). gooroomee.com. https://gooroomee.com",
      "doi": ""
    },
    {
      "text": "Jeffrey Alan Greene and Roger Azevedo. 2007. A theoretical review of Winne and Hadwin’s model of self-regulated learning: New perspectives and directions. Review of educational research 77, 3 (2007), 334–372.",
      "doi": ""
    },
    {
      "text": "Douglas J Hacker, John Dunlosky, and Arthur C Graesser. 1998. Metacognition in educational theory and practice. Routledge, UK. 277–‐304 pages.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson and John C. Tang. 2017. What Makes Live Events Engaging on Facebook Live, Periscope, and Snapchat. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 48–60. https://doi.org/10.1145/3025453.3025642",
      "doi": "10.1145/3025453.3025642"
    },
    {
      "text": "William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on Twitch: Fostering Participatory Communities of Play within Live Mixed Media. Association for Computing Machinery, New York, NY, USA, 1315–1324. https://doi.org/10.1145/2556288.2557048",
      "doi": ""
    },
    {
      "text": "Asha Hegde, Patricia Boucher, and Allison Lavelle. 2018. How Do you Work? Understanding User Needs for Responsive Study Space Design. College & Research Libraries 79, 7 (2018), 895. https://doi.org/10.5860/crl.79.7.895",
      "doi": ""
    },
    {
      "text": "Yasamin Heshmat, Lillian Yang, and Carman Neustaedter. 2018. Quality ’Alone’ Time through Conversations and Storytelling: Podcast Listening Behaviors and Routines. In Proceedings of the 44th Graphics Interface Conference (Toronto, Canada) (GI ’18). Canadian Human-Computer Communications Society, Waterloo, CAN, 76–83. https://doi.org/10.20380/GI2018.11",
      "doi": "10.20380/GI2018.11"
    },
    {
      "text": "Alexis Hiniker, Sungsoo (Ray) Hong, Tadayoshi Kohno, and Julie A. Kientz. 2016. MyTime: Designing and Evaluating an Intervention for Smartphone Non-Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4746–4757. https://doi.org/10.1145/2858036.2858403",
      "doi": "10.1145/2858036.2858403"
    },
    {
      "text": "Jim Hollan and Scott Stornetta. 1992. Beyond Being There. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). Association for Computing Machinery, New York, NY, USA, 119–125. https://doi.org/10.1145/142750.142769",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Y. Linlin Huang, Kate Starbird, Mania Orand, Stephanie A. Stanek, and Heather T. Pedersen. 2015. Connected Through Crisis: Emotional Proximity and the Spread of Misinformation Online. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 969–980. https://doi.org/10.1145/2675133.2675202",
      "doi": "10.1145/2675133.2675202"
    },
    {
      "text": "Jing Jin and Laura A. Dabbish. 2009. Self-Interruption on the Computer: A Typology of Discretionary Task Interleaving. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1799–1808. https://doi.org/10.1145/1518701.1518979",
      "doi": "10.1145/1518701.1518979"
    },
    {
      "text": "David H Jonassen. 1991. Objectivism versus constructivism: Do we need a new philosophical paradigm?Educational technology research and development 39, 3(1991), 5–14.",
      "doi": ""
    },
    {
      "text": "Sin-Hwa Kang, James H. Watt, and Sasi Kanth Ala. 2008. Social Copresence in Anonymous Social Interactions Using a Mobile Video Telephone. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1535–1544. https://doi.org/10.1145/1357054.1357295",
      "doi": "10.1145/1357054.1357295"
    },
    {
      "text": "Demetrios Karis, Daniel Wildman, and Amir Mané. 2016. Improving remote collaboration with video conferencing and video portals. Human–Computer Interaction 31, 1 (2016), 1–58.",
      "doi": ""
    },
    {
      "text": "Young-Ho Kim, Eun Kyoung Choe, Bongshin Lee, and Jinwook Seo. 2019. Understanding Personal Productivity: How Knowledge Workers Define, Evaluate, and Reflect on Their Productivity. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300845",
      "doi": "10.1145/3290605.3300845"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging Framing Effects to Enhance Personal Productivity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 272–283. https://doi.org/10.1145/2858036.2858428",
      "doi": "10.1145/2858036.2858428"
    },
    {
      "text": "Minsam Ko, Subin Yang, Joonwon Lee, Christian Heizmann, Jinyoung Jeong, Uichin Lee, Daehee Shin, Koji Yatani, Junehwa Song, and Kyong-Mee Chung. 2015. NUGU: A Group-Based Intervention App for Improving Self-Regulation of Limiting Smartphone Use. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1235–1245. https://doi.org/10.1145/2675133.2675244",
      "doi": "10.1145/2675133.2675244"
    },
    {
      "text": "Chinmay Kulkarni, Julia Cambre, Yasmine Kotturi, Michael S. Bernstein, and Scott R. Klemmer. 2015. Talkabout: Making Distance Matter with Small Groups in Massive Classes. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1116–1128. https://doi.org/10.1145/2675133.2675166",
      "doi": "10.1145/2675133.2675166"
    },
    {
      "text": "Uichin Lee, Joonwon Lee, Minsam Ko, Changhun Lee, Yuhwan Kim, Subin Yang, Koji Yatani, Gahgene Gweon, Kyong-Mee Chung, and Junehwa Song. 2014. Hooked on Smartphones: An Exploratory Study on Smartphone Overuse among College Students. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2327–2336. https://doi.org/10.1145/2556288.2557366",
      "doi": "10.1145/2556288.2557366"
    },
    {
      "text": "Yi-Chieh Lee, Wen-Chieh Lin, Fu-Yin Cherng, Hao-Chuan Wang, Ching-Ying Sung, and Jung-Tai King. 2015. Using Time-Anchored Peer Comments to Enhance Social Interaction in Online Educational Videos. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 689–698. https://doi.org/10.1145/2702123.2702349",
      "doi": "10.1145/2702123.2702349"
    },
    {
      "text": "Zhicong Lu, Michelle Annett, and Daniel Wigdor. 2019. Vicariously experiencing it all without going outside: A study of outdoor livestreaming in China. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–28.",
      "doi": "10.1145/3359127"
    },
    {
      "text": "Zhicong Lu, Haijun Xia, Seongkook Heo, and Daniel Wigdor. 2018. You Watch, You Give, and You Engage: A Study of Live Streaming Practices in China. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174040",
      "doi": "10.1145/3173574.3174040"
    },
    {
      "text": "Alendra Lyons, Stephen Reysen, and Lindsey Pierce. 2012. Video lecture format, student technological efficacy, and social presence in online courses. Computers in Human Behavior 28, 1 (2012), 181–186.",
      "doi": "10.1016/j.chb.2011.08.025"
    },
    {
      "text": "Gloria Mark, Mary Czerwinski, and Shamsi T. Iqbal. 2018. Effects of Individual Differences in Blocking Workplace Distractions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173666",
      "doi": "10.1145/3173574.3173666"
    },
    {
      "text": "Jennifer Marlow, Scott Carter, Nathaniel Good, and Jung-Wei Chen. 2016. Beyond Talking Heads: Multimedia Artifact Creation, Use, and Sharing in Distributed Meetings. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1703–1715. https://doi.org/10.1145/2818048.2819958",
      "doi": "10.1145/2818048.2819958"
    },
    {
      "text": "Michael J. Muller and Sandra Kogan. 2012. Grounded Theory Method in Human-Computer Interaction and Computer-Supported Cooperative Work. In The Human Computer Interaction Handbook(3 ed.), Julie A. Jacko (Ed.). CRC Press, Boca Raton, FL, Chapter 44, 1003–1024. https://doi.org/10.1201/b11963-51",
      "doi": ""
    },
    {
      "text": "Bilge Mutlu and Jodi Forlizzi. 2008. Robots in Organizations: The Role of Workflow, Social, and Environmental Factors in Human-Robot Interaction. In Proceedings of the 3rd ACM/IEEE International Conference on Human Robot Interaction (Amsterdam, The Netherlands) (HRI ’08). Association for Computing Machinery, New York, NY, USA, 287–294. https://doi.org/10.1145/1349822.1349860",
      "doi": "10.1145/1349822.1349860"
    },
    {
      "text": "Carman Neustaedter and Saul Greenberg. 2012. Intimacy in Long-Distance Relationships over Video Chat. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 753–762. https://doi.org/10.1145/2207676.2207785",
      "doi": "10.1145/2207676.2207785"
    },
    {
      "text": "Anthony J. Pellicone and June Ahn. 2017. The Game of Performing Play: Understanding Streaming as Cultural Production. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4863–4874. https://doi.org/10.1145/3025453.3025854",
      "doi": "10.1145/3025453.3025854"
    },
    {
      "text": "Paul R. Pintrich. 2000. Chapter 14 - The Role of Goal Orientation in Self-Regulated Learning. In Handbook of Self-Regulation, Monique Boekaerts, Paul R. Pintrich, and Moshe Zeidner(Eds.). Academic Press, San Diego, 451 – 502. https://doi.org/10.1016/B978-012109890-2/50043-3",
      "doi": ""
    },
    {
      "text": "Karine Pires and Gwendal Simon. 2015. YouTube Live and Twitch: A Tour of User-Generated Live Streaming Systems. In Proceedings of the 6th ACM Multimedia Systems Conference (Portland, Oregon) (MMSys ’15). Association for Computing Machinery, New York, NY, USA, 225–230. https://doi.org/10.1145/2713168.2713195",
      "doi": "10.1145/2713168.2713195"
    },
    {
      "text": "Pomofocus. (Online; Retrieved Sep 12, 2020). pomofocus.io. https://pomofocus.io",
      "doi": ""
    },
    {
      "text": "Leo Porter, Cynthia Bailey Lee, and Beth Simon. 2013. Halving Fail Rates Using Peer Instruction: A Study of Four Computer Science Courses. In Proceeding of the 44th ACM Technical Symposium on Computer Science Education (Denver, Colorado, USA) (SIGCSE ’13). Association for Computing Machinery, New York, NY, USA, 177–182. https://doi.org/10.1145/2445196.2445250",
      "doi": "10.1145/2445196.2445250"
    },
    {
      "text": "Mariana Regalado and Maura A Smale. 2015. “I am more productive in the library because it’s quiet”: Commuter students in the college library. College & research libraries 76, 7 (2015), 899–913.",
      "doi": ""
    },
    {
      "text": "RescueTime. (Online; Retrieved July 16, 2020). rescuetime.com. http://rescuetime.com",
      "doi": ""
    },
    {
      "text": "Ido Roll and Philip H Winne. 2015. Understanding, evaluating, and supporting self-regulated learning using learning analytics. Journal of Learning Analytics 2, 1 (2015), 7–12.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Parvin Asadzadeh, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2016. Personal Tracking of Screen Time on Digital Devices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 284–296. https://doi.org/10.1145/2858036.2858055",
      "doi": "10.1145/2858036.2858055"
    },
    {
      "text": "Virtual Study Room. (Online; Retrieved Sep 12, 2020). virtual-study-room.com. https://www.virtual-study-room.com",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. Sage, UK.",
      "doi": ""
    },
    {
      "text": "Nurain Adila Abdul Samat, Harwati Hashim, and Melor Md Yunus. 2019. Live Streaming: A New Platform for ESL Learning. Creative Education 10, 12 (2019), 2899–2906.",
      "doi": ""
    },
    {
      "text": "Max Sjblom and Juho Hamari. 2017. Why Do People Watch Others Play Video Games? An Empirical Study on the Motivations of Twitch Users. Comput. Hum. Behav. 75, C (Oct. 2017), 985–996. https://doi.org/10.1016/j.chb.2016.10.019",
      "doi": ""
    },
    {
      "text": "Michelle K Smith, William B Wood, Wendy K Adams, Carl Wieman, Jennifer K Knight, Nancy Guild, and Tin Tin Su. 2009. Why peer discussion improves student performance on in-class concept questions. Science 323, 5910 (2009), 122–124.",
      "doi": ""
    },
    {
      "text": "Matt Southern. 2020 (accessed September 10, 2020). Google Lists 5 Key Trends Shaping Consumer Behavior Amid COVID-19. https://www.searchenginejournal.com/google-lists-5-key-trends-shaping-consumer-behavior-amid-covid-19/368874/#close",
      "doi": ""
    },
    {
      "text": "StayFocusd. (Online; Retrieved July 16, 2020). stayfocusd.en.softonic.com. https://stayfocusd.en.softonic.com",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of qualitative research techniques. Sage publications Thousand Oaks, CA, USA.",
      "doi": ""
    },
    {
      "text": "Minhyang Suh, Frank Bentley, and Danielle Lottridge. 2018. ” It’s Kind of Boring Looking at Just the Face” How Teens Multitask During Mobile Videochat. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–23.",
      "doi": ""
    },
    {
      "text": "Casey Swezey and Janet Vertesi. 2019. Working apart, together: The challenges of co-work. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": "10.1145/3359306"
    },
    {
      "text": "Lee Taber, Leya Breanna Baltaxe-Admony, and Kevin Weatherwax. 2019. What makes a live stream companion? animation, beats, and parasocial relationships. interactions 27, 1 (2019), 52–57.",
      "doi": ""
    },
    {
      "text": "John C. Tang, Gina Venolia, and Kori M. Inkpen. 2016. Meerkat and Periscope: I Stream, You Stream, Apps Stream for Live Streams. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4770–4780. https://doi.org/10.1145/2858036.2858374",
      "doi": "10.1145/2858036.2858374"
    },
    {
      "text": "Lev Semenovich Vygotsky. 1980. Mind in society: The development of higher psychological processes. Harvard university press, USA.",
      "doi": ""
    },
    {
      "text": "Steve Whittaker, Vaiva Kalnikaite, Victoria Hollis, and Andrew Guydish. 2016. ’Don’t Waste My Time’: Use of Time Information Improves Focus. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1729–1738. https://doi.org/10.1145/2858036.2858193",
      "doi": "10.1145/2858036.2858193"
    },
    {
      "text": "Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath Day Home Automation: ”It’s like Mixing Technology and Religion”. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 527–536. https://doi.org/10.1145/1240624.1240710",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Rui Zhou, Zhonghe Wen, Muchao Tang, and Betsy DiSalvo. 2017. Navigating Media Use: Chinese Parents and Their Overseas Adolescent Children on WeChat. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 1025–1037. https://doi.org/10.1145/3064663.3064701",
      "doi": "10.1145/3064663.3064701"
    },
    {
      "text": "Barry J Zimmerman. 1986. Development of self-regulated learning: Which are the key subprocesses. Contemporary educational psychology 16, 3 (1986), 307–313.",
      "doi": ""
    },
    {
      "text": "Sacha Zyto, David Karger, Mark Ackerman, and Sanjoy Mahajan. 2012. Successful Classroom Deployment of a Social Document Annotation System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1883–1892. https://doi.org/10.1145/2207676.2208326",
      "doi": "10.1145/2207676.2208326"
    }
  ]
}