{
  "doi": "10.1145/3411764.3445069",
  "title": "A Decade of Sustainable HCI: Connecting SHCI to the Sustainable Development Goals",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2021,
  "badges": [],
  "abstract": "Sustainable HCI (SHCI) constitutes a relatively new research field within HCI. We have identified four literature reviews of the field conducted between 2009-2014. In this paper, we present and discuss the results of a systematic literature review of peer-reviewed conference and journal articles that have been published in the field during the last ten years (2010-2019). To this end, we apply the United Nations’ Sustainable Development Goals (SDGs) as a framework to classify and discern high-level goals SHCI researchers have worked towards during this period. This paper contributes to HCI by 1) identifying Sustainable Development Goals that SHCI researchers have worked towards, 2) discerning main research trends in the field during the last decade, 3) using the SDG framework generatively to enumerate and reflect on areas that this far have not been covered by SHCI research and 4) presenting takeaways and opportunities for further research by the larger HCI community.",
  "authors": [
    {
      "name": "Lon Åke Erni Johannes Hansson",
      "institution": "Stockholm University Dept. Of Computer and Systems Sciences, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701043",
      "orcid": "missing"
    },
    {
      "name": "Teresa Cerratto Pargman",
      "institution": "Stockholm university Dept. Of Computer and Systems Sciences, Sweden",
      "img": "/do/10.1145/contrib-81317492026/rel-imgonly/tessyfacebook.jpg",
      "acmid": "81317492026",
      "orcid": "missing"
    },
    {
      "name": "Daniel Sapiens Pargman",
      "institution": "Department of Media Technology and Interaction Design KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-81544532156/rel-imgonly/pargmansmall.jpg",
      "acmid": "81544532156",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arman Arakelyan and David Lamas. 2013. Facilitation of Sustainability through Appropriation-Enabling Design. In Proceedings of the International Conference on Multimedia, Interaction, Design and Innovation (Warsaw, Poland) (MIDI ’13). Association for Computing Machinery, New York, NY, USA, Article 5, 9 pages. https://doi.org/10.1145/2500342.2500347",
      "doi": "10.1145/2500342.2500347"
    },
    {
      "text": "Ranjula Bali Swain. 2017. A Critical Analysis of the Sustainable Development Goals. Springer, Cham, Cham, Switzerland, 341–355. https://doi.org/10.1007/978-3-319-63007-6_20",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell. 2009. Interaction Criticism and Aesthetics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 2357–2366. https://doi.org/10.1145/1518701.1519063",
      "doi": "10.1145/1518701.1519063"
    },
    {
      "text": "Mary Barreto, Evangelos Karapanos, and Nuno Nunes. 2011. Social Translucence as a Theoretical Framework for Sustainable HCI. In Proceedings of the 13th IFIP TC 13 International Conference on Human-Computer Interaction - Volume Part IV (Lisbon, Portugal) (INTERACT’11). Springer-Verlag, Berlin, Heidelberg, 195–203.",
      "doi": ""
    },
    {
      "text": "Oliver Bates, Mike Hazas, Adrian Friday, Janine Morley, and Adrian K. Clear. 2014. Towards an Holistic View of the Energy and Environmental Impacts of Domestic Media and IT. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1173–1182. https://doi.org/10.1145/2556288.2556968",
      "doi": "10.1145/2556288.2556968"
    },
    {
      "text": "Avit Bhowmik, Mark McCaffrey, Abigail Ruskey, Chad Frischmann, and Owen Gaffney. 2020. Powers of 10: Seeking ’sweet spots’ for rapid climate and sustainability actions between individual and global scales. Environmental Research Letters 15, 9 (06 2020). https://doi.org/10.1088/1748-9326/ab9ed0",
      "doi": ""
    },
    {
      "text": "A. K. Bhuie, O. A. Ogunseitan, J.-D. M. Saphores, and A. A. Shapiro. 2004. Environmental and Economic Trade-Offs in Consumer Electronic Products Recycling: A Case Study of Cell Phones and Computers. In Proceedings of the International Symposium on Electronics and the Environment(ISEE ’04). IEEE Computer Society, USA, 74–79.",
      "doi": ""
    },
    {
      "text": "Aksel Biørn-Hansen and Maria Håkansson. 2018. Building Momentum: Scaling up Change in Community Organizations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173984",
      "doi": "10.1145/3173574.3173984"
    },
    {
      "text": "Eli Blevis. 2007. Sustainable Interaction Design: Invention & Disposal, Renewal & Reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 503–512. https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Eli Blevis, Chris Preist, Daniel Schien, and Priscilla Ho. 2017. Further Connecting Sustainable Interaction Design with Sustainable Digital Infrastructure Design. In Proceedings of the 2017 Workshop on Computing Within Limits (Santa Barbara, California, USA) (LIMITS ’17). Association for Computing Machinery, New York, NY, USA, 71–83. https://doi.org/10.1145/3080556.3080568",
      "doi": "10.1145/3080556.3080568"
    },
    {
      "text": "Andy Boucher, David Cameron, and Nadine Jarvis. 2012. Power to the People: Dynamic Energy Management through Communal Cooperation. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 612–620. https://doi.org/10.1145/2317956.2318048",
      "doi": "10.1145/2317956.2318048"
    },
    {
      "text": "Anne E. Bowser, Oliver L. Haimson, Edward F. Melcer, and Elizabeth F. Churchill. 2015. On Vintage Values: The Experience of Secondhand Fashion Reacquisition. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 897–906. https://doi.org/10.1145/2702123.2702394",
      "doi": "10.1145/2702123.2702394"
    },
    {
      "text": "Loove Broms, Cecilia Katzeff, Magnus Bång, Åsa Nyblom, Sara Ilstedt Hjelm, and Karin Ehrnberger. 2010. Coffee Maker Patterns and the Design of Energy Feedback Artefacts. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (Aarhus, Denmark) (DIS ’10). Association for Computing Machinery, New York, NY, USA, 93–102. https://doi.org/10.1145/1858171.1858191",
      "doi": "10.1145/1858171.1858191"
    },
    {
      "text": "Gro Bruntland 1987. Our common future. Oxford University Press, Oxford. 45–65 pages.",
      "doi": ""
    },
    {
      "text": "Hronn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably Unpersuaded: How Persuasion Narrows Our Vision of Sustainability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 947–956. https://doi.org/10.1145/2207676.2208539",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Hronn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably Unpersuaded: How Persuasion Narrows Our Vision of Sustainability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 947–956. https://doi.org/10.1145/2207676.2208539",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Ana Caraban, Evangelos Karapanos, Daniel Gonçalves, and Pedro Campos. 2019. 23 Ways to Nudge: A Review of Technology-Mediated Nudging in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300733",
      "doi": "10.1145/3290605.3300733"
    },
    {
      "text": "Teresa Cerratto-Pargman, Daniel Pargman, and Bonnie Nardi. 2016. The Internet at the eco-village: Performing sustainability in the twenty-first century. First Monday 21, 5 (2016).",
      "doi": ""
    },
    {
      "text": "Rob Comber and Anja Thieme. 2013. Designing beyond Habit: Opening Space for Improved Recycling and Food Waste Behaviors through Processes of Persuasion, Social Influence and Aversive Affect. Personal Ubiquitous Comput. 17, 6 (Aug. 2013), 1197–1210. https://doi.org/10.1007/s00779-012-0587-1",
      "doi": "10.1007/s00779-012-0587-1"
    },
    {
      "text": "Enrico Costanza, Sarvapali D. Ramchurn, and Nicholas R. Jennings. 2012. Understanding Domestic Energy Consumption through Interactive Visualisation: A Field Study. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (Pittsburgh, Pennsylvania) (UbiComp ’12). Association for Computing Machinery, New York, NY, USA, 216–225. https://doi.org/10.1145/2370216.2370251",
      "doi": "10.1145/2370216.2370251"
    },
    {
      "text": "Vânia Paula de Almeida Neris, Kamila Rios da Hora Rodrigues, and Renata Firmino Lima. 2014. A systematic review of sustainability and aspects of human-computer interaction. In International Conference on Human-Computer Interaction. Springer, Springer, Cham, Cham, Switzerland, 742–753.",
      "doi": ""
    },
    {
      "text": "UN Desa 2016. Transforming our world: The 2030 agenda for sustainable development. Technical Report. UN General Assembly, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the Landscape of Sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1975–1984. https://doi.org/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Paul Dourish. 2010. HCI and Environmental Sustainability: The Politics of Design and the Design of Politics. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (Aarhus, Denmark) (DIS ’10). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/1858171.1858173",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "John S Dryzek. 2005. The politics of the earth : environmental discourses. Oxford University Press, Oxford.",
      "doi": ""
    },
    {
      "text": "Callum Egan, Richard Thompson, and Andrew O’Dowd. 2019. The Lions’ Gate: Towards a Permaculture-Inspired Blended Space. In Proceedings of the Fifth Workshop on Computing within Limits (Lappeenranta, Finland) (LIMITS ’19). Association for Computing Machinery, New York, NY, USA, Article 7, 8 pages. https://doi.org/10.1145/3338103.3338110",
      "doi": "10.1145/3338103.3338110"
    },
    {
      "text": "Johanne Mose Entwistle, Mia Kruse Rasmussen, Nervo Verdezoto, Robert S. Brewer, and Mads Schaarup Andersen. 2015. Beyond the Individual: The Contextual Wheel of Practice as a Research Framework for Sustainable HCI. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1125–1134. https://doi.org/10.1145/2702123.2702232",
      "doi": "10.1145/2702123.2702232"
    },
    {
      "text": "Elina Eriksson, Daniel Pargman, Oliver Bates, Maria Normark, Jan Gulliksen, Mikael Anneroth, and Johan Berndtsson. 2016. HCI and UN’s Sustainable Development Goals: Responsibilities, Barriers and Opportunities. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 140, 2 pages. https://doi.org/10.1145/2971485.2987679",
      "doi": "10.1145/2971485.2987679"
    },
    {
      "text": "Ylva Fernaeus, Martin Jonsson, and Jakob Tholander. 2012. Revisiting the Jacquard Loom: Threads of History and Current Patterns in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1593–1602. https://doi.org/10.1145/2207676.2208280",
      "doi": "10.1145/2207676.2208280"
    },
    {
      "text": "Jon Froehlich, Leah Findlater, and James Landay. 2010. The Design of Eco-Feedback Technology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1999–2008. https://doi.org/10.1145/1753326.1753629",
      "doi": "10.1145/1753326.1753629"
    },
    {
      "text": "Silke Gegenbauer and Elaine M. Huang. 2012. Inspiring the Design of Longer-Lived Electronics through an Understanding of Personal Attachment. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 635–644. https://doi.org/10.1145/2317956.2318052",
      "doi": "10.1145/2317956.2318052"
    },
    {
      "text": "Elizabeth Goodman. 2009. Three Environmental Discourses in Human-Computer Interaction. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2535–2544. https://doi.org/10.1145/1520340.1520358",
      "doi": "10.1145/1520340.1520358"
    },
    {
      "text": "Anton Gustafsson and Magnus Gyllenswärd. 2005. The Power-Aware Cord: Energy Awareness through Ambient Information Display. In CHI ’05 Extended Abstracts on Human Factors in Computing Systems (Portland, OR, USA) (CHI EA ’05). Association for Computing Machinery, New York, NY, USA, 1423–1426. https://doi.org/10.1145/1056808.1056932",
      "doi": "10.1145/1056808.1056932"
    },
    {
      "text": "Alexa M. Harris, Diego Gómez-Zará, Leslie A. DeChurch, and Noshir S. Contractor. 2019. Joining Together Online: The Trajectory of CSCW Scholarship on Group Formation. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 148 (Nov. 2019), 27 pages. https://doi.org/10.1145/3359250",
      "doi": "10.1145/3359250"
    },
    {
      "text": "Hanna Hasselqvist, Cristian Bogdan, and Filip Kis. 2016. Linking Data to Action: Designing for Amateur Energy Management. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 473–483. https://doi.org/10.1145/2901790.2901837",
      "doi": "10.1145/2901790.2901837"
    },
    {
      "text": "Hanna Hasselqvist and Elina Eriksson. 2018. Designing for Diverse Stakeholder Engagement in Resource-Intensive Practices. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). Association for Computing Machinery, New York, NY, USA, 426–438. https://doi.org/10.1145/3240167.3240193",
      "doi": "10.1145/3240167.3240193"
    },
    {
      "text": "Hanna Hasselqvist, Mia Hesselgren, and Cristian Bogdan. 2016. Challenging the Car Norm: Opportunities for ICT to Support Sustainable Transportation Practices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1300–1311. https://doi.org/10.1145/2858036.2858468",
      "doi": "10.1145/2858036.2858468"
    },
    {
      "text": "Mike Hazas and Lisa Nathan. 2017. Digital Technology and Sustainability: Engaging the Paradox. Routledge, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2013. Sustainable HCI for Grassroots Urban Food-Growing Communities. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (Adelaide, Australia) (OzCHI ’13). Association for Computing Machinery, New York, NY, USA, 255–264. https://doi.org/10.1145/2541016.2541023",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Hrönn Brynjarsdóttir Holmer, Carl DiSalvo, Phoebe Sengers, and Thomas Lodato. 2015. Constructing and Constraining Participation in Participatory Arts and HCI. Int. J. Hum.-Comput. Stud. 74, C (Feb. 2015), 107–123. https://doi.org/10.1016/j.ijhcs.2014.10.003",
      "doi": "10.1016/j.ijhcs.2014.10.003"
    },
    {
      "text": "Maria Håkansson and Phoebe Sengers. 2013. Beyond Being Green: Simple Living Families and ICT. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 2725–2734. https://doi.org/10.1145/2470654.2481378",
      "doi": "10.1145/2470654.2481378"
    },
    {
      "text": "Maria Håkansson and Phoebe Sengers. 2014. No Easy Compromise: Sustainability and the Dilemmas and Dynamics of Change. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 1025–1034. https://doi.org/10.1145/2598510.2598569",
      "doi": "10.1145/2598510.2598569"
    },
    {
      "text": "Alexander Ilic, Thorsten Staake, and Elgar Fleisch. 2009. Using Sensor Information to Reduce the Carbon Footprint of Perishable Goods. IEEE Pervasive Computing 8, 1 (Jan. 2009), 22–29. https://doi.org/10.1109/MPRV.2009.20",
      "doi": "10.1109/MPRV.2009.20"
    },
    {
      "text": "Rachel Jacobs, Steve Benford, Ewa Luger, and Candice Howarth. 2016. The Prediction Machine: Performing Scientific and Artistic Process. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 497–508. https://doi.org/10.1145/2901790.2901825",
      "doi": "10.1145/2901790.2901825"
    },
    {
      "text": "Ravi Jain and John Wullert. 2002. Challenges: Environmental Design for Pervasive Computing Systems. In Proceedings of the 8th Annual International Conference on Mobile Computing and Networking(Atlanta, Georgia, USA) (MobiCom ’02). Association for Computing Machinery, New York, NY, USA, 263–270. https://doi.org/10.1145/570645.570678",
      "doi": "10.1145/570645.570678"
    },
    {
      "text": "Rikke Hagensby Jensen, Jesper Kjeldskov, and Mikael B. Skov. 2016. HeatDial: Beyond User Scheduling in Eco-Interaction. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 74, 10 pages. https://doi.org/10.1145/2971485.2971525",
      "doi": "10.1145/2971485.2971525"
    },
    {
      "text": "Rikke Hagensby Jensen, Jesper Kjeldskov, and Mikael B. Skov. 2018. Assisted Shifting of Electricity Use: A Long-Term Study of Managing Residential Heating. ACM Trans. Comput.-Hum. Interact. 25, 5, Article 25 (Oct. 2018), 33 pages. https://doi.org/10.1145/3210310",
      "doi": "10.1145/3210310"
    },
    {
      "text": "Rikke Hagensby Jensen, Dimitrios Raptis, Jesper Kjeldskov, and Mikael B. Skov. 2018. Washing with the Wind: A Study of Scripting towards Sustainability. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 1387–1400. https://doi.org/10.1145/3196709.3196779",
      "doi": "10.1145/3196709.3196779"
    },
    {
      "text": "Somya Joshi and Teresa Cerratto Pargman. 2015. In Search of Fairness: Critical Design Alternatives for Sustainability. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives (Aarhus, Denmark) (CA ’15). Aarhus University Press, Aarhus N, 37–40. https://doi.org/10.7146/aahcc.v1i1.21301",
      "doi": "10.7146/aahcc.v1i1.21301"
    },
    {
      "text": "Somya Joshi and Teresa Cerratto Pargman. 2015/09. On fairness & sustainability: Motivating change in the networked society. In Proceedings of EnviroInfo and ICT for Sustainability 2015. Atlantis Press, Paris, France, 335–344. https://doi.org/10.2991/ict4s-env-15.2015.38",
      "doi": ""
    },
    {
      "text": "Cecilia Katzeff, Loove Broms, Li Jönsson, Ulrika Westholm, and Minna Räsänen. 2013. Exploring sustainable practices in workplace settings through visualizing electricity consumption. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 5(2013), 1–22.",
      "doi": "10.1145/2501526"
    },
    {
      "text": "Bran Knowles, Oliver Bates, and Maria Håkansson. 2018. This Changes Sustainable HCI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174045",
      "doi": "10.1145/3173574.3174045"
    },
    {
      "text": "Bran Knowles, Lynne Blair, Mike Hazas, and Stuart Walker. 2013. Exploring Sustainability Research in Computing: Where We Are and Where We Go Next. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Zurich, Switzerland) (UbiComp ’13). Association for Computing Machinery, New York, NY, USA, 305–314. https://doi.org/10.1145/2493432.2493474",
      "doi": "10.1145/2493432.2493474"
    },
    {
      "text": "Bran Knowles, Lynne Blair, Stuart Walker, Paul Coulton, Lisa Thomas, and Louise Mullagh. 2014. Patterns of Persuasion for Sustainability. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 1035–1044. https://doi.org/10.1145/2598510.2598536",
      "doi": "10.1145/2598510.2598536"
    },
    {
      "text": "Bran Knowles, Lynne Blair, Stuart Walker, Paul Coulton, Lisa Thomas, and Louise Mullagh. 2014. Patterns of Persuasion for Sustainability. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 1035–1044. https://doi.org/10.1145/2598510.2598536",
      "doi": "10.1145/2598510.2598536"
    },
    {
      "text": "Lenneke Kuijer, Annelise de Jong, and Daan van Eijk. 2013. Practices as a Unit of Design: An Exploration of Theoretical Guidelines in a Study on Bathing. ACM Trans. Comput.-Hum. Interact. 20, 4, Article 21 (Sept. 2013), 22 pages. https://doi.org/10.1145/2493382",
      "doi": "10.1145/2493382"
    },
    {
      "text": "Neha Kumar, Vikram Kamath Cannanure, Dilrukshi Gamage, Annu Sible Prabhakar, Christian Sturm, Cuauhtémoc Rivera Loaiza, Dina Sabie, Md. Moinuddin Bhuiyan, and Mario A. Moreno Rocha. 2020. HCI Across Borders and Sustainable Development Goals. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3375067",
      "doi": "10.1145/3334480.3375067"
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. UpStream: Motivating Water Conservation with Low-Cost Water Flow Sensing and Persuasive Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1851–1860. https://doi.org/10.1145/1753326.1753604",
      "doi": "10.1145/1753326.1753604"
    },
    {
      "text": "Ann Light, Eric Kasper, and Sabine Hielscher. 2020. Wicked Solutions: SDGs, Research Design and the “Unfinishedness” of Sustainability. n/a n/a, n/a (2020). https://doi.org/10.31235/osf.io/m948c",
      "doi": ""
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Out of Control: Reframing Sustainable HCI Using Permaculture. In Proceedings of the 2018 Workshop on Computing within Limits (Toronto, Ontario, Canada) (LIMITS ’18). Association for Computing Machinery, New York, NY, USA, Article 2, 8 pages. https://doi.org/10.1145/3232617.3232625",
      "doi": ""
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2019. Symbiotic Encounters: HCI and Sustainable Agriculture. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300547",
      "doi": "10.1145/3290605.3300547"
    },
    {
      "text": "Carolynne Lord, Mike Hazas, Adrian K. Clear, Oliver Bates, Rosalind Whittam, Janine Morley, and Adrian Friday. 2015. Demand in My Pocket: Mobile Devices and the Data Connectivity Marshalled in Support of Everyday Practice. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2729–2738. https://doi.org/10.1145/2702123.2702162",
      "doi": "10.1145/2702123.2702162"
    },
    {
      "text": "Jennifer C. Mankoff, Eli Blevis, Alan Borning, Batya Friedman, Susan R. Fussell, Jay Hasbrouck, Allison Woodruff, and Phoebe Sengers. 2007. Environmental Sustainability and Interaction. In CHI ’07 Extended Abstracts on Human Factors in Computing Systems (San Jose, CA, USA) (CHI EA ’07). Association for Computing Machinery, New York, NY, USA, 2121–2124. https://doi.org/10.1145/1240866.1240963",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "Matthew Louis Mauriello, Brenna McNally, and Jon E. Froehlich. 2019. Thermporal: An Easy-To-Deploy Temporal Thermographic Sensor System to Support Residential Energy Audits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300343",
      "doi": "10.1145/3290605.3300343"
    },
    {
      "text": "Matthew Louis Mauriello, Leyla Norooz, and Jon E. Froehlich. 2015. Understanding the Role of Thermography in Energy Auditing: Current Practices and the Potential for Automated Solutions. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1993–2002. https://doi.org/10.1145/2702123.2702528",
      "doi": "10.1145/2702123.2702528"
    },
    {
      "text": "Matthew Louis Mauriello, Manaswi Saha, Erica Brown Brown, and Jon E. Froehlich. 2017. Exploring Novice Approaches to Smartphone-Based Thermographic Energy Auditing: A Field Study. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1768–1780. https://doi.org/10.1145/3025453.3025471",
      "doi": "10.1145/3025453.3025471"
    },
    {
      "text": "San Murugesan. 2008. Harnessing green IT: Principles and practices. IT professional 10, 1 (2008), 24–33.",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi, Bill Tomlinson, Donald J Patterson, Jay Chen, Daniel Pargman, Barath Raghavan, and Birgit Penzenstadler. 2018. Computing within limits. Commun. ACM 61, 10 (2018), 86–93.",
      "doi": "10.1145/3183582"
    },
    {
      "text": "Juliet Norton, Ankita Raturi, Bonnie Nardi, Sebastian Prost, Samantha McDonald, Daniel Pargman, Oliver Bates, Maria Normark, Bill Tomlinson, Nico Herbig, 2017. A grand challenge for HCI: food+ sustainability. interactions 24, 6 (2017), 50–55.",
      "doi": "10.1145/3137095"
    },
    {
      "text": "C. Okoli. 2015. A Guide to Conducting a Standalone Systematic Literature Review. Commun. Assoc. Inf. Syst. 37 (2015), 43.",
      "doi": ""
    },
    {
      "text": "Yue Pan and Eli Blevis. 2014. Fashion Thinking: Lessons from Fashion and Sustainable Interaction Design, Concepts and Issues. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 1005–1014. https://doi.org/10.1145/2598510.2598586",
      "doi": "10.1145/2598510.2598586"
    },
    {
      "text": "Yue Pan, David Roedl, Eli Blevis, and John Thomas. 2012. Re-Conceptualizing Fashion in Sustainable HCI. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 813–815. https://doi.org/10.1145/2317956.2318087",
      "doi": "10.1145/2317956.2318087"
    },
    {
      "text": "Daniel Pargman and Barath Raghavan. 2014. Rethinking Sustainability in Computing: From Buzzword to Non-Negotiable Limits. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (Helsinki, Finland) (NordiCHI ’14). Association for Computing Machinery, New York, NY, USA, 638–647. https://doi.org/10.1145/2639189.2639228",
      "doi": "10.1145/2639189.2639228"
    },
    {
      "text": "Petromil Petkov, Suparna Goswami, Felix Köbler, and Helmut Krcmar. 2012. Personalised Eco-Feedback as a Design Technique for Motivating Energy Saving Behaviour at Home. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (Copenhagen, Denmark) (NordiCHI ’12). Association for Computing Machinery, New York, NY, USA, 587–596. https://doi.org/10.1145/2399016.2399106",
      "doi": "10.1145/2399016.2399106"
    },
    {
      "text": "Petromil Petkov, Felix Köbler, Marcus Foth, and Helmut Krcmar. 2011. Motivating Domestic Energy Conservation through Comparative, Community-Based Feedback in Mobile and Social Media. In Proceedings of the 5th International Conference on Communities and Technologies (Brisbane, Australia) (C&T ’11). Association for Computing Machinery, New York, NY, USA, 21–30. https://doi.org/10.1145/2103354.2103358",
      "doi": "10.1145/2103354.2103358"
    },
    {
      "text": "James Pierce and Eric Paulos. 2012. Beyond Energy Monitors: Interaction, Energy, and Emerging Energy Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 665–674. https://doi.org/10.1145/2207676.2207771",
      "doi": "10.1145/2207676.2207771"
    },
    {
      "text": "James Pierce, Diane J. Schiano, and Eric Paulos. 2010. Home, Habits, and Energy: Examining Domestic Interactions and Energy Consumption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1985–1994. https://doi.org/10.1145/1753326.1753627",
      "doi": "10.1145/1753326.1753627"
    },
    {
      "text": "James Pierce, Yolande Strengers, Phoebe Sengers, and Susanne Bødker. 2013. Introduction to the Special Issue on Practice-Oriented Approaches to Sustainable HCI. , 8 pages. https://doi.org/10.1145/2494260",
      "doi": ""
    },
    {
      "text": "Chris Preist, Daniel Schien, and Eli Blevis. 2016. Understanding and Mitigating the Effects of Device and Cloud Service Design Decisions on the Environmental Footprint of Digital Infrastructure. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1324–1337. https://doi.org/10.1145/2858036.2858378",
      "doi": "10.1145/2858036.2858378"
    },
    {
      "text": "Chris Preist, Daniel Schien, and Paul Shabajee. 2019. Evaluating Sustainable Interaction Design of Digital Services: The Case of YouTube. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300627",
      "doi": "10.1145/3290605.3300627"
    },
    {
      "text": "Barath Raghavan and Daniel Pargman. 2017. Means and Ends in Human-Computer Interaction: Sustainability through Disintermediation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 786–796. https://doi.org/10.1145/3025453.3025542",
      "doi": "10.1145/3025453.3025542"
    },
    {
      "text": "Majken K. Rasmussen, Mia Kruse Rasmussen, Nervo Verdezoto, Robert Brewer, Laura L. Nielsen, and Niels Olof Bouvin. 2017. Exploring the Flexibility of Everyday Practices for Shifting Energy Consumption through Clockcast. In Proceedings of the 29th Australian Conference on Computer-Human Interaction (Brisbane, Queensland, Australia) (OZCHI ’17). Association for Computing Machinery, New York, NY, USA, 296–306. https://doi.org/10.1145/3152771.3152803",
      "doi": "10.1145/3152771.3152803"
    },
    {
      "text": "Christian Remy, Oliver Bates, Alan Dix, Vanessa Thomas, Mike Hazas, Adrian Friday, and Elaine M. Huang. 2018. Evaluation Beyond Usability: Validating Sustainable HCI Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173790",
      "doi": "10.1145/3173574.3173790"
    },
    {
      "text": "Christian Remy, Oliver Bates, Vanessa Thomas, and Elaine M. Huang. 2017. The Limits of Evaluating Sustainability. In Proceedings of the 2017 Workshop on Computing Within Limits (Santa Barbara, California, USA) (LIMITS ’17). Association for Computing Machinery, New York, NY, USA, 103–110. https://doi.org/10.1145/3080556.3080567",
      "doi": "10.1145/3080556.3080567"
    },
    {
      "text": "Christian Remy, Silke Gegenbauer, and Elaine M. Huang. 2015. Bridging the Theory-Practice Gap: Lessons and Challenges of Applying the Attachment Framework for Sustainable HCI Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1305–1314. https://doi.org/10.1145/2702123.2702567",
      "doi": "10.1145/2702123.2702567"
    },
    {
      "text": "Tina Ringenson, Elina Eriksson, Miriam Börjesson Rivera, and Josefin Wangel. 2017. The Limits of the Smart Sustainable City. In Proceedings of the 2017 Workshop on Computing Within Limits (Santa Barbara, California, USA) (LIMITS ’17). Association for Computing Machinery, New York, NY, USA, 3–9. https://doi.org/10.1145/3080556.3080559",
      "doi": "10.1145/3080556.3080559"
    },
    {
      "text": "David Roedl, Shaowen Bardzell, and Jeffrey Bardzell. 2015. Sustainable Making? Balancing Optimism and Criticism in HCI Discourse. ACM Trans. Comput.-Hum. Interact. 22, 3, Article 15 (June 2015), 27 pages. https://doi.org/10.1145/2699742",
      "doi": "10.1145/2699742"
    },
    {
      "text": "EA Shove, M Hand, J Ingram, and M Watson. 2007. The Design of Everyday Life.Berg, Oxford.",
      "doi": ""
    },
    {
      "text": "Viktoria Spaiser, Shyam Ranganathan, Ranjula Bali Swain, and David JT Sumpter. 2017. The sustainable development oxymoron: quantifying and modelling the incompatibility of sustainable development goals. International Journal of Sustainable Development & World Ecology 24, 6(2017), 457–470.",
      "doi": ""
    },
    {
      "text": "Yolande A.A. Strengers. 2011. Designing Eco-Feedback Systems for Everyday Life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2135–2144. https://doi.org/10.1145/1978942.1979252",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Valerie Sugarman and Edward Lank. 2015. Designing Persuasive Technology to Manage Peak Electricity Demand in Ontario Homes. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1975–1984. https://doi.org/10.1145/2702123.2702364",
      "doi": "10.1145/2702123.2702364"
    },
    {
      "text": "Theresa Jean Tanenbaum, Marcel Pufal, and Karen Tanenbaum. 2016. The Limits of Our Imagination: Design Fiction as a Strategy for Engaging with Dystopian Futures. In Proceedings of the Second Workshop on Computing within Limits (Irvine, California) (LIMITS ’16). Association for Computing Machinery, New York, NY, USA, Article 10, 9 pages. https://doi.org/10.1145/2926676.2926687",
      "doi": "10.1145/2926676.2926687"
    },
    {
      "text": "Anja Thieme, Rob Comber, Julia Miebach, Jack Weeden, Nicole Kraemer, Shaun Lawson, and Patrick Olivier. 2012. ”We’ve Bin Watching You”: Designing for Reflection and Social Persuasion to Promote Sustainable Lifestyles. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2337–2346. https://doi.org/10.1145/2207676.2208394",
      "doi": "10.1145/2207676.2208394"
    },
    {
      "text": "Vanessa Thomas, Christian Remy, and Oliver Bates. 2017. The Limits of HCD: Reimagining the Anthropocentricity of ISO 9241-210. In Proceedings of the 2017 Workshop on Computing Within Limits (Santa Barbara, California, USA) (LIMITS ’17). Association for Computing Machinery, New York, NY, USA, 85–92. https://doi.org/10.1145/3080556.3080561",
      "doi": "10.1145/3080556.3080561"
    },
    {
      "text": "Bill Tomlinson, M. Six Silberman, Donald Patterson, Yue Pan, and Eli Blevis. 2012. Collapse Informatics: Augmenting the Sustainability & ICT4D Discourse in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 655–664. https://doi.org/10.1145/2207676.2207770",
      "doi": "10.1145/2207676.2207770"
    },
    {
      "text": "Sanna Tuomela, Netta Iivari, and Rauli Svento. 2019. User Values of Smart Home Energy Management System: Sensory Ethnography in VSD Empirical Investigation. In Proceedings of the 18th International Conference on Mobile and Ubiquitous Multimedia (Pisa, Italy) (MUM ’19). Association for Computing Machinery, New York, NY, USA, Article 32, 12 pages. https://doi.org/10.1145/3365610.3365641",
      "doi": "10.1145/3365610.3365641"
    },
    {
      "text": "Phil Turner and Susan Turner. 2011. My Grandfather’s IPod: An Investigation of Emotional Attachment to Digital and Non-Digital Artefacts. In Proceedings of the 29th Annual European Conference on Cognitive Ergonomics (Rostock, Germany) (ECCE ’11). Association for Computing Machinery, New York, NY, USA, 149–156. https://doi.org/10.1145/2074712.2074742",
      "doi": "10.1145/2074712.2074742"
    },
    {
      "text": "Niels van Berkel, Eleftherios Papachristos, Anastasia Giachanou, Simo Hosio, and Mikael B. Skov. 2020. A Systematic Assessment of National Artificial Intelligence Policies: Perspectives from the Nordics and Beyond. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society (Tallinn, Estonia) (NordiCHI ’20). Association for Computing Machinery, New York, NY, USA, Article 10, 12 pages. https://doi.org/10.1145/3419249.3420106",
      "doi": "10.1145/3419249.3420106"
    },
    {
      "text": "Dhaval Vyas. 2012. Domestic Artefacts: Sustainability in the Context of Indian Middle Class. In Proceedings of the 4th International Conference on Intercultural Collaboration (Bengaluru, India) (ICIC ’12). Association for Computing Machinery, New York, NY, USA, 119–128. https://doi.org/10.1145/2160881.2160900",
      "doi": "10.1145/2160881.2160900"
    },
    {
      "text": "Ron Wakkary, Audrey Desjardins, Sabrina Hauser, and Leah Maestri. 2013. A Sustainable Design Fiction: Green Practices. ACM Trans. Comput.-Hum. Interact. 20, 4, Article 23 (Sept. 2013), 34 pages. https://doi.org/10.1145/2494265",
      "doi": "10.1145/2494265"
    },
    {
      "text": "Allison Woodruff, Jay Hasbrouck, and Sally Augustin. 2008. A Bright Green Perspective on Sustainable Choices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 313–322. https://doi.org/10.1145/1357054.1357109",
      "doi": "10.1145/1357054.1357109"
    },
    {
      "text": "Ray Yun, Peter Scupelli, Azizan Aziz, and Vivian Loftness. 2013. Sustainability in the Workplace: Nine Intervention Techniques for Behavior Change. In Proceedings of the 8th International Conference on Persuasive Technology (Sydney, NSW, Australia) (PERSUASIVE’13). Springer-Verlag, Berlin, Heidelberg, 253–265. https://doi.org/10.1007/978-3-642-37157-8_30",
      "doi": "10.1007/978-3-642-37157-8_30"
    },
    {
      "text": "Jorge Luis Zapico, Cecilia Katzeff, Ulrica Bohné, and Rebecka Milestad. 2016. Eco-Feedback Visualization for Closing the Gap of Organic Food Consumption. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 75, 9 pages. https://doi.org/10.1145/2971485.2971507",
      "doi": "10.1145/2971485.2971507"
    }
  ]
}