{
  "doi": "10.1145/3411764.3445533",
  "title": "Exploring Awareness of Breathing through Deep Touch Pressure",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Deep Pressure Therapy relies on exerting firm touch to help individuals with sensory sensitivity. We performed first-person explorations of deep pressure enabled by shape-changing actuation driven by breathing sensing. This revealed a novel design space with rich, evocative, aesthetically interesting interactions that can help increase breathing awareness and appreciation through: (1) applying symmetrical as well as asymmetrical pressure on the torso; (2) using pressure to direct attention to muscles or bone structure involved in different breathing patterns; (3) apply synchronous as well as asynchronous feedback following or opposing the user’s breathing rhythm through applying rhythmic pressure. Taken together these explorations led us to design (4) breathing correspondence interactions – a balance point right between leading and following users’ breathing patterns by first applying deep pressure – almost to the point of being unpleasant – and then releasing in rhythmic flow.",
  "tags": [
    "Deep Touch Pressure",
    "Shape-Changing Interfaces",
    "Breathing",
    "Soma Design",
    "Wearables"
  ],
  "authors": [
    {
      "name": "Annkatrin Jung",
      "institution": "KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702019",
      "orcid": "missing"
    },
    {
      "name": "Miquel Alfaras",
      "institution": "Universitat Jaume I, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659462785",
      "orcid": "missing"
    },
    {
      "name": "Pavel Karpashevich",
      "institution": "MID KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-99659120383/rel-imgonly/ld0soyoo_yy.jpg",
      "acmid": "99659120383",
      "orcid": "0000-0003-0874-3338"
    },
    {
      "name": "William Primett",
      "institution": "FCT Universidade NOVA de Lisboa, Portugal",
      "img": "/do/10.1145/contrib-99659502233/rel-imgonly/snapinsta.app_1080_327811499_846415439803721_3519156476050497050_n.jpg",
      "acmid": "99659502233",
      "orcid": "missing"
    },
    {
      "name": "Kristina Höök",
      "institution": "Media Technology and Interaction Design KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-81341491415/rel-imgonly/rigakiafeb2017.jpg",
      "acmid": "81341491415",
      "orcid": "0000-0002-0002-4825"
    }
  ],
  "references": [
    {
      "text": "Ahmad Abushakra and Miad Faezipour. 2014. Augmenting Breath Regulation Using a Mobile Driven Virtual Reality Therapy Framework. IEEE Journal of Biomedical and Health Informatics 18, 3 (May 2014), 746–752. https://doi.org/10.1109/JBHI.2013.2281195Conference Name: IEEE Journal of Biomedical and Health Informatics.",
      "doi": ""
    },
    {
      "text": "Jason Alexander, Anne Roudaut, Jürgen Steimle, Kasper Hornbæk, Miguel Bruns Alonso, Sean Follmer, and Timothy Merritt. 2018. Grand Challenges in Shape-Changing Interface Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173873",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "Miquel Alfaras, Vasiliki Tsaknaki, Pedro Sanches, Charles Windlin, Muhammad Umair, Corina Sas, and Kristina Höök. 2020. From Biodata to Somadata. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376684",
      "doi": "10.1145/3313831.3376684"
    },
    {
      "text": "Ilhan Aslan, Hadrian Burkhardt, Julian Kraus, and Elisabeth André. 2016. Hold my Heart and Breathe with Me: Tangible Somaesthetic Designs. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction - NordiCHI ’16. ACM Press, Gothenburg, Sweden, 1–6. https://doi.org/10.1145/2971485.2996727",
      "doi": "10.1145/2971485.2996727"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2005–2014. https://doi.org/10.1145/2207676.2208347",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Marco Bertamini and Giulia Rampone. 2020. The Study of Symmetry in Empirical Aesthetics. In The Oxford Handbook of Empirical Aesthetics, Marcos Nadal and Oshin Vartanian (Eds.). Oxford University Press, Oxford, United Kingdom. https://doi.org/10.1093/oxfordhb/9780198824350.013.23",
      "doi": ""
    },
    {
      "text": "Peter M. Bingham, Jason H. T. Bates, John Thompson-Figueroa, and Thomas Lahiri. 2010. A Breath Biofeedback Computer Game for Children With Cystic Fibrosis. Clinical Pediatrics 49, 4 (April 2010), 337–342. https://doi.org/10.1177/0009922809348022",
      "doi": ""
    },
    {
      "text": "Boris Bornemann, Beate M. Herbert, Wolf E. Mehling, and Tania Singer. 2015. Differential changes in self-reported aspects of interoceptive awareness through 3 months of contemplative training. Frontiers in Psychology 5 (Jan. 2015), 1–13. https://doi.org/10.3389/fpsyg.2014.01504",
      "doi": ""
    },
    {
      "text": "Antoinette Leanna Bumatay and Jinsil Hwaryoung Seo. 2017. Investigating the Role of Biofeedback and Haptic Stimulation in Mobile Paced Breathing Tools. In Augmented Cognition. Neurocognition and Machine Learning - 11th International Conference, AC 2017, Held as Part of HCI International 2017, Vancouver, BC, Canada, July 9-14, 2017, Proceedings, Part I(Lecture Notes in Computer Science, Vol. 10284), Dylan D. Schmorrow and Cali M. Fidopiastis (Eds.). Springer, Vancouver, Canada, 287–303. https://doi.org/10.1007/978-3-319-58628-1_23",
      "doi": ""
    },
    {
      "text": "Anita C. Bundy, Shelly Lane, Elizabeth A. Murray, and Anne G. Fisher. 2002. Sensory integration: theory and practice(2nd ed ed.). F.A. Davis, Philadelphia.",
      "doi": ""
    },
    {
      "text": "Adam Burke and Sean Marconett. 2008. The Role of Breath in Yogic Traditions: Alternate Nostril Breathing.Biofeedback 36, 2 (2008), 67–69.",
      "doi": ""
    },
    {
      "text": "Henning Cammann and Josef Michel. 2002. How to avoid misinterpretation of heart rate variability power spectra?Computer Methods and Programs in Biomedicine 68, 1(2002), 15 – 23. https://doi.org/10.1016/S0169-2607(01)00154-7",
      "doi": ""
    },
    {
      "text": "Charles Windlin, Anna Ståhl, Pedro Sanches, Vasiliki Tsaknaki, Pavel Karpashevich, Madeline Balaam, and Kristina Höök. 2019. Soma Bits - Mediating Technology to Orchestrate Bodily Experiences. Proceedings of the 4th Biennial Research Through Design Conference 4, Article 25 (March 2019), 1–16. https://doi.org/10.6084/",
      "doi": ""
    },
    {
      "text": "Erwan Codrons, Nicolò F Bernardi, Matteo Vandoni, and Luciano Bernardi. 2014. Spontaneous group synchronization of movements and respiratory rhythms. PLoS One 9, 9 (2014), e107538.",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho and Jamie Zigelbaum. 2011. Shape-changing interfaces. Personal and Ubiquitous Computing 15, 2 (2011), 161–173. https://doi.org/10.1007/s00779-010-0311-y",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Rodrigo Andrés Cárdenas and Lauren Julius Harris. 2006. Symmetrical decorations enhance the attractiveness of faces and abstract designs. Evolution and Human Behavior 27, 1 (Jan. 2006), 1–18. https://doi.org/10.1016/j.evolhumbehav.2005.05.002",
      "doi": ""
    },
    {
      "text": "Char Davies and John Harrison. 1996. Osmose: Towards Broadening the Aesthetics of Virtual Reality. SIGGRAPH Comput. Graph. 30, 4 (Nov. 1996), 25–28. https://doi.org/10.1145/240806.240808",
      "doi": "10.1145/240806.240808"
    },
    {
      "text": "Alexandra Delazio, Ken Nakagaki, Roberta L. Klatzky, Scott E. Hudson, Jill Fain Lehman, and Alanson P. Sample. 2018. Force Jacket: Pneumatically-Actuated Jacket for Embodied Haptic Experiences. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173894",
      "doi": "10.1145/3173574.3173894"
    },
    {
      "text": "John Desnoyers-Stewart, Ekaterina R. Stepanova, Philippe Pasquier, and Bernhard E. Riecke. 2019. JeL: Connecting Through Breath in Virtual Reality. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312845",
      "doi": "10.1145/3290607.3312845"
    },
    {
      "text": "Esko Dijk and Alina Weffers. 2011. Breathe with the Ocean. In Special Symposium at EuroHaptics 2010: Haptic and Audio-Visual Stimuli: Enhancing Experiences and Interaction. Universiteit Twente, Enschede, Amsterdam, Netherlands, 14.",
      "doi": ""
    },
    {
      "text": "Panteleimon Dimitriadis and Jason Alexander. 2014. Evaluating the Effectiveness of Physical Shape-Change for in-Pocket Mobile Device Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2589–2592. https://doi.org/10.1145/2556288.2557164",
      "doi": "10.1145/2556288.2557164"
    },
    {
      "text": "Julia C. Duvall, Nicholas Schleif, Lucy E. Dunne, and Brad Holschuh. 2019. Dynamic Compression Garments for Sensory Processing Disorder Treatment Using Integrated Active Materials. Journal of Medical Devices 13, 2 (June 2019), 021001. https://doi.org/10.1115/1.4042599",
      "doi": ""
    },
    {
      "text": "Andreas Ejupi and Carlo Menon. 2018. Detection of Talking in Respiratory Signals: A Feasibility Study Using Machine Learning and Wearable Textile-Based Sensors. Sensors 18, 8 (Aug. 2018), 2474. https://doi.org/10.3390/s18082474Number: 8 Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "Doreen Fertel-Daly, Gary Bedell, and Jim Hinojosa. 2001. Effects of a weighted vest on attention to task and self-stimulatory behaviors in preschoolers with pervasive developmental disorders. American Journal of Occupational Therapy 55, 6 (2001), 629–640.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. InFORM: Dynamic Physical Affordances and Constraints through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 417–426. https://doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Esther Foo, Justin Baker, Crystal Compton, and Brad Holschuh. 2020. Soft Robotic Compression Garment to Assist Novice Meditators. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382919",
      "doi": "10.1145/3334480.3382919"
    },
    {
      "text": "Esther W Foo, J. Walter Lee, Crystal Compton, Simon Ozbek, and Brad Holschuh. 2019. User experiences of garment-based dynamic compression for novel haptic applications. In Proceedings of the 23rd International Symposium on Wearable Computers - ISWC ’19. ACM Press, London, United Kingdom, 54–59. https://doi.org/10.1145/3341163.3347732",
      "doi": "10.1145/3341163.3347732"
    },
    {
      "text": "Jérémy Frey, May Grabli, Ronit Slyper, and Jessica R. Cauchard. 2018. Breeze: Sharing Biofeedback through Wearable Technologies. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3174219",
      "doi": "10.1145/3173574.3174219"
    },
    {
      "text": "Asma Ghandeharioun and Rosalind Picard. 2017. BrightBeat: Effortlessly Influencing Breathing for Cultivating Calmness and Focus. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, Denver, Colorado, USA, 1624–1631. https://doi.org/10.1145/3027063.3053164 Type: 10.1145/3027063.3053164.",
      "doi": "10.1145/3027063.3053164"
    },
    {
      "text": "Antonio Gomes, Andrea Nesbitt, and Roel Vertegaal. 2013. MorePhone: A Study of Actuated Shape Deformations for Flexible Thin-Film Smartphone Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 583–592. https://doi.org/10.1145/2470654.2470737",
      "doi": "10.1145/2470654.2470737"
    },
    {
      "text": "Temple Grandin. 1992. Calming Effects of Deep Touch Pressure in Patients with Autistic Disorder, College Students, and Animals. Journal of Child and Adolescent Psychopharmacology 2, 1 (Jan. 1992), 63–72. https://doi.org/10.1089/cap.1992.2.63",
      "doi": ""
    },
    {
      "text": "Erik Grönvall, Sofie Kinch, Marianne Graves Petersen, and Majken K. Rasmussen. 2014. Causing Commotion with a Shape-Changing Bench: Experiencing Shape-Changing Interfaces in Use. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2559–2568. https://doi.org/10.1145/2556288.2557360",
      "doi": "10.1145/2556288.2557360"
    },
    {
      "text": "Sondre Hamnvik, Pierre Bernabé, and Sagar Sen. 2020. Yolo4Apnea: Real-time Detection of Obstructive Sleep Apnea. In Proceedings of the Twenty-Ninth International Joint Conference on Artificial Intelligence. International Joint Conferences on Artificial Intelligence Organization, Yokohama, Japan, 5234–5236. https://doi.org/10.24963/ijcai.2020/754",
      "doi": ""
    },
    {
      "text": "Jason Harris, Sarah Vance, Odair Fernandes, Avinash Parnandi, and Ricardo Gutierrez-Osuna. 2014. Sonic Respiration: Controlling Respiration Rate through Auditory Biofeedback. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 2383–2388. https://doi.org/10.1145/2559206.2581233",
      "doi": "10.1145/2559206.2581233"
    },
    {
      "text": "Fabian Hemmert, Susann Hamann, Matthias Löwe, Anne Wohlauf, and Gesche Joost. 2010. Shape-Changing Mobiles: Tapering in One-Dimensional Deformational Displays in Mobile Phones. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (Cambridge, Massachusetts, USA) (TEI ’10). Association for Computing Machinery, New York, NY, USA, 249–252. https://doi.org/10.1145/1709886.1709936",
      "doi": "10.1145/1709886.1709936"
    },
    {
      "text": "Hsin-Yung Chen, Hsiang Yang, Huang-Ju Chi, and Hsin-Ming Chen. 2013. Physiological Effects of Deep Touch Pressure on Anxiety Alleviation: The Weighted Blanket Approach. Journal of Medical and Biological Engineering 33, 5(2013), 463. https://doi.org/10.5405/jmbe.1043",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Baptiste Caramiaux, Cumhur Erkut, Jodi Forlizzi, Nassrin Hajinejad, Michael Haller, Caroline Hummels, Katherine Isbister, Martin Jonsson, George Khut, Lian Loke, Danielle Lottridge, Patrizia Marti, Edward Melcer, Florian Müller, Marianne Petersen, Thecla Schiphorst, Elena Segura, Anna Ståhl, Dag Svanæs, Jakob Tholander, and Helena Tobiasson. 2018. Embracing First-Person Perspectives in Soma-Based Design. Informatics 5, 1 (Feb. 2018), 8. https://doi.org/10.3390/informatics5010008",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 3131–3142. https://doi.org/10.1145/2858036.2858583",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Tim Ingold. 2011. Being Alive: Essays on Movement, Knowledge and Description (1st edition ed.). Routledge, Abingdon, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Yuichiro Katsumoto, Satoru Tokuhisa, and Masa Inakage. 2013. Ninja Track: Design of Electronic Toy Variable in Shape and Flexibility. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction(Barcelona, Spain) (TEI ’13). Association for Computing Machinery, New York, NY, USA, 17–24. https://doi.org/10.1145/2460625.2460628",
      "doi": "10.1145/2460625.2460628"
    },
    {
      "text": "Peter E Keller, Giacomo Novembre, and Michael J Hove. 2014. Rhythm in joint action: psychological and neurophysiological mechanisms for real-time interpersonal coordination. Philosophical Transactions of the Royal Society B: Biological Sciences 369, 1658 (2014), 20130394.",
      "doi": ""
    },
    {
      "text": "Jina Kim, Young-Woo Park, and Tek-Jin Nam. 2015. BreathingFrame: An Inflatable Frame for Remote Breath Signal Sharing. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction(Stanford, California, USA) (TEI ’15). Association for Computing Machinery, New York, NY, USA, 109–112. https://doi.org/10.1145/2677199.2680606",
      "doi": "10.1145/2677199.2680606"
    },
    {
      "text": "Kirsten E. Krauss. 1987. The Effects of Deep Pressure Touch on Anxiety. American Journal of Occupational Therapy 41 (June 1987), 366–373. https://doi.org/10.5014/ajot.41.6.366",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. The MIT Press, Cambridge, Massachusetts, United States.",
      "doi": ""
    },
    {
      "text": "Sabina Kupershmidt and Traci Barnable. 2019. Definition of a Yoga Breathing (Pranayama) Protocol That Improves Lung Function. Holistic Nursing Practice 33, 4 (Aug. 2019), 197–203. https://doi.org/10.1097/HNP.0000000000000331",
      "doi": ""
    },
    {
      "text": "Matthijs Kwak, Kasper Hornbæk, Panos Markopoulos, and Miguel Bruns Alonso. 2014. The design space of shape-changing interfaces: a repertory grid study. In Proceedings of the 2014 conference on Designing interactive systems - DIS ’14. ACM Press, Vancouver, BC, Canada, 181–190. https://doi.org/10.1145/2598510.2598573",
      "doi": "10.1145/2598510.2598573"
    },
    {
      "text": "Daniel J. Levitin. 2019. This is your brain on music: understanding a human obsession. Penguin Books, London.",
      "doi": ""
    },
    {
      "text": "Rong-Hao Liang, Bin Yu, Mengru Xue, Jun Hu, and Loe M. G. Feijs. 2018. BioFidget: Biofeedback for Respiration Training Using an Augmented Fidget Spinner. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3174187",
      "doi": ""
    },
    {
      "text": "I-Mei Lin, L.Y. Tai, and Sheng-Yu Fan. 2014. Breathing at a rate of 5.5breaths per minute with equal inhalation-to-exhalation ratio increases heart rate variability. International Journal of Psychophysiology 91, 3 (2014), 206 – 211. https://doi.org/10.1016/j.ijpsycho.2013.12.006",
      "doi": ""
    },
    {
      "text": "Lian Loke and George Poonkhin Khut. 2014. Intimate aesthetics and facilitated interaction. In Interactive Experience in the Digital Age. Springer, Sydney, Australia, 91–108.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and making strange: An embodied approach to movement-based interaction design. ACM Transactions on Computer-Human Interaction 20, 1 (March 2013), 1–25. https://doi.org/10.1145/2442106.2442113",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Squease Ltd.2014. Squease Vest. Squease Ltd. https://www.squeasewear.com",
      "doi": ""
    },
    {
      "text": "Tware Pte Ltd. 2020. Tjacket. Tware Pte Ltd. https://www.mytjacket.com",
      "doi": ""
    },
    {
      "text": "Jonas Löwgren. 2009. Toward an articulation of interaction esthetics. The New Review of Hypermedia and Multimedia 15 (08 2009), 129–146. https://doi.org/10.1080/13614560903117822",
      "doi": ""
    },
    {
      "text": "Joe Marshall, Duncan Rowland, Stefan Rennick Egglestone, Steve Benford, Brendan Walker, and Derek McAuley. 2011. Breath Control of Amusement Rides. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 73–82. https://doi.org/10.1145/1978942.1978955",
      "doi": "10.1145/1978942.1978955"
    },
    {
      "text": "Ian Christopher McManus. 2005. Symmetry and asymmetry in aesthetics and the arts. European Review 13, S2 (Oct. 2005), 157–180. https://doi.org/10.1017/S1062798705000736",
      "doi": ""
    },
    {
      "text": "Pardis Miri, Robert Flory, Andero Uusberg, Heather Culbertson, Richard H. Harvey, Agata Kelman, Davis Erik Peper, James J. Gross, Katherine Isbister, and Keith Marzullo. 2020. PIV: Placement, Pattern, and Personalization of an Inconspicuous Vibrotactile Breathing Pacer. ACM Trans. Comput.-Hum. Interact. 27, 1, Article 5 (Jan. 2020), 44 pages. https://doi.org/10.1145/3365107",
      "doi": "10.1145/3365107"
    },
    {
      "text": "Stuart Moran, Nils Jäger, Holger Schnädelbach, and Kevin Glover. 2016. ExoPranayama: a biofeedback-driven actuated environment for supporting yoga breathing practices. Pers. Ubiquitous Comput. 20, 2 (2016), 261–275. https://doi.org/10.1007/s00779-016-0910-3",
      "doi": "10.1007/s00779-016-0910-3"
    },
    {
      "text": "Neema Moraveji, Athman Adiseshan, and Takehiro Hagiwara. 2012. BreathTray: Augmenting Respiration Self-Regulation without Cognitive Deficit. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems (Austin, Texas, USA) (CHI EA ’12). Association for Computing Machinery, New York, NY, USA, 2405–2410. https://doi.org/10.1145/2212776.2223810",
      "doi": "10.1145/2212776.2223810"
    },
    {
      "text": "Neema Moraveji, Ben Olson, Truc Nguyen, Mahmoud Saadat, Yaser Khalighi, Roy Pea, and Jeffrey Heer. 2011. Peripheral paced respiration: influencing user physiology during information work. In Proceedings of the 24th annual ACM symposium on User interface software and technology(UIST ’11). Association for Computing Machinery, New York, NY, USA, 423–428. https://doi.org/10.1145/2047196.2047250",
      "doi": "10.1145/2047196.2047250"
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical Design in HCI Research: Designing and Learning through Use-It-Yourself. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 514–523. https://doi.org/10.1145/2317956.2318034",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Kas Oosterhuis and Nimish Biloria. 2008. Interactions with Proactive Architectural Spaces: The Muscle Projects. Commun. ACM 51, 6 (June 2008), 70–78. https://doi.org/10.1145/1349026.1349041",
      "doi": "10.1145/1349026.1349041"
    },
    {
      "text": "Avinash Parnandi, Beena Ahmed, Eva Shipp, and Ricardo Gutierrez-Osuna. 2014. Chill-Out: Relaxation Training through Respiratory Biofeedback in a Mobile Casual Game. In Mobile Computing, Applications, and Services, Gérard Memmi and Ulf Blanke (Eds.). Vol. 130. Springer International Publishing, Cham, 252–260. https://doi.org/10.1007/978-3-319-05452-0_18Series Title: Lecture Notes of the Institute for Computer Sciences, Social Informatics and Telecommunications Engineering.",
      "doi": ""
    },
    {
      "text": "Rakesh Patibanda, Florian ’Floyd’ Mueller, Matevz Leskovsek, and Jonathan Duckworth. 2017. Life Tree: Understanding the Design of Breathing Exercise Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17). Association for Computing Machinery, New York, NY, USA, 19–31. https://doi.org/10.1145/3116595.3116621",
      "doi": "10.1145/3116595.3116621"
    },
    {
      "text": "Andrea M. Pisa, George Chernyshov, Andriana F. Nassou, and Kai Kunze. 2017. Towards Interactive Mindfulness Training Using Breathing Based Feedback. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (Maui, Hawaii) (UbiComp ’17). Association for Computing Machinery, New York, NY, USA, 688–692. https://doi.org/10.1145/3123024.3129268",
      "doi": "10.1145/3123024.3129268"
    },
    {
      "text": "Mirjana Prpa, Karen Cochrane, and Bernhard E Riecke. 2016. Hacking Alternatives in 21st Century: Designing a Bio-Responsive Virtual Environment for Stress Reduction. In Pervasive Computing Paradigms for Mental Health: 5th International Conference, MindCare 2015, Milan, Italy, September 24-25, 2015, Revised Selected Papers, Vol. 604. Springer, Milan, Italy, 34.",
      "doi": ""
    },
    {
      "text": "Mirjana Prpa, Ekaterina R. Stepanova, Thecla Schiphorst, Bernhard E. Riecke, and Philippe Pasquier. 2020. Inhaling and Exhaling: How Technologies Can Perceptually Extend our Breath Awareness. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–15. https://doi.org/10.1145/3313831.3376183",
      "doi": "10.1145/3313831.3376183"
    },
    {
      "text": "Mirjana Prpa, Kıvanç Tatar, Jules Françoise, Bernhard Riecke, Thecla Schiphorst, and Philippe Pasquier. 2018. Attending to Breath: Exploring How the Cues in a Virtual Environment Guide the Attention to Breath and Shape the Quality of Experience to Support Mindfulness. In Proceedings of the 2018 on Designing Interactive Systems Conference 2018 - DIS ’18. ACM Press, Hong Kong, China, 71–84. https://doi.org/10.1145/3196709.3196765",
      "doi": "10.1145/3196709.3196765"
    },
    {
      "text": "Shawn P. Quigley, Lloyd Peterson, Jessica E. Frieder, and Stephanie Peterson. 2011. Effects of a weighted vest on problem behaviors during functional analyses in children with Pervasive Developmental Disorders. Research in Autism Spectrum Disorders 5 (2011), 529–538.",
      "doi": ""
    },
    {
      "text": "Swami Rama, Rudolph Ballentine, and Alan Hymes. 1998. Science of Breath: A Practical Guide. Himalayan Institute Press, Honesdale, Pennsylvania, United States. https://books.google.de/books?id=oSg0N_GrRsQC",
      "doi": ""
    },
    {
      "text": "Majken K. Rasmussen, Esben W. Pedersen, Marianne G. Petersen, and Kasper Hornbæk. 2012. Shape-Changing Interfaces: A Review of the Design Space and Open Research Questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 735–744. https://doi.org/10.1145/2207676.2207781",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Majken K. Rasmussen, Giovanni M. Troiano, Marianne G. Petersen, Jakob G. Simonsen, and Kasper Hornbæk. 2016. Sketching Shape-Changing Interfaces: Exploring Vocabulary, Metaphors Use, and Affordances. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2740–2751. https://doi.org/10.1145/2858036.2858183",
      "doi": "10.1145/2858036.2858183"
    },
    {
      "text": "Andrea Ravignani. 2017. Interdisciplinary debate: Agree on definitions of synchrony. Nature 545 (05 2017), 158–158. https://doi.org/10.1038/545158c",
      "doi": ""
    },
    {
      "text": "Andrea Ravignani, Daniel L Bowling, and W Tecumseh Fitch. 2014. Chorusing, synchrony, and the evolutionary functions of rhythm. Frontiers in Psychology 5 (2014), 1–15.",
      "doi": ""
    },
    {
      "text": "Steve Reich. 2004. Writings on Music 1965–2000: 1965-2000. Oxford University Press, USA. https://doi.org/10.1093/acprof:oso/9780195151152.001.0001",
      "doi": ""
    },
    {
      "text": "Joan Sol Roo, Renaud Gervais, Jeremy Frey, and Martin Hachet. 2017. Inner Garden: Connecting Inner States to a Mixed Reality Sandbox for Mindfulness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1459–1470. https://doi.org/10.1145/3025453.3025743",
      "doi": "10.1145/3025453.3025743"
    },
    {
      "text": "Marc A. Russo, Danielle M. Santarelli, and Dean O’Rourke. 2017. The physiological effects of slow breathing in the healthy human. Breathe 13, 4 (Dec. 2017), 298–309. https://doi.org/10.1183/20734735.009817",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Kristina Höök, Corina Sas, and Anna Ståhl. 2019. Ambiguity as a Resource to Inform Proto-Practices: The Case of Skin Conductance. ACM Transactions on Computer-Human Interaction 26, 4 (July 2019), 1–32. https://doi.org/10.1145/3318143",
      "doi": "10.1145/3318143"
    },
    {
      "text": "Thecla Schiphorst. 2006. Breath, skin and clothing: Using wearable technologies as an interface into ourselves. International Journal of Performance Arts and Digital Media 2, 2(2006), 171–186. https://doi.org/10.1386/padm.2.2.171_1",
      "doi": ""
    },
    {
      "text": "Holger Schnädelbach, Ainojie Irune, David Kirk, Kevin Glover, and Patrick Brundell. 2012. ExoBuilding: Physiologically Driven Adaptive Architecture. ACM Trans. Comput.-Hum. Interact. 19, 4, Article 25 (Dec. 2012), 22 pages. https://doi.org/10.1145/2395131.2395132",
      "doi": "10.1145/2395131.2395132"
    },
    {
      "text": "Pallav Sengupta. 2012. Health Impacts of Yoga and Pranayama: A State-of-the-Art Review. International journal of preventive medicine 3 (07 2012), 444–58.",
      "doi": ""
    },
    {
      "text": "Ameneh Shamekhi and Timothy Bickmore. 2018. Breathe Deep: A Breath-Sensitive Interactive Meditation Coach. In Proceedings of the 12th EAI International Conference on Pervasive Computing Technologies for Healthcare(New York, NY, USA) (PervasiveHealth ’18). Association for Computing Machinery, New York, NY, USA, 108–117. https://doi.org/10.1145/3240925.3240940",
      "doi": "10.1145/3240925.3240940"
    },
    {
      "text": "Chris D Shaw, Diane Gromala, and A Fleming Seay. 2007. The Meditation Chamber: Enacting Autonomic Senses. In 4th International Conference on Enactive Interfaces 2007. Association ACROE, Grenoble, France, 405–424.",
      "doi": ""
    },
    {
      "text": "George Sioros, Marius Miron, Matthew Davies, Fabien Gouyon, and Guy Madison. 2014. Syncopation creates the sensation of groove in synthesized music examples. Frontiers in Psychology 5 (2014), 1036.",
      "doi": ""
    },
    {
      "text": "Heikki Sjöman, Nazare Soares, Martinus Suijkerbuijk, Jørgen Blindheim, Martin Steinert, and Dag T. Wisland. 2018. The Breathing Room: Breathing Interval and Heart Rate Capturing through Ultra Low Power Radar. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3170427.3186473",
      "doi": "10.1145/3170427.3186473"
    },
    {
      "text": "Tobias Sonne and Mads Møller Jensen. 2016. ChillFish: A Respiration Game for Children with ADHD. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction(Eindhoven, Netherlands) (TEI ’16). Association for Computing Machinery, New York, NY, USA, 271–278. https://doi.org/10.1145/2839462.2839480",
      "doi": "10.1145/2839462.2839480"
    },
    {
      "text": "Florian Soyka, Markus Leyrer, Joe Smallwood, Chris Ferguson, Bernhard E. Riecke, and Betty J. Mohler. 2016. Enhancing stress management techniques using virtual reality. In Proceedings of the ACM Symposium on Applied Perception(SAP ’16). Association for Computing Machinery, Anaheim, California, 85–88. https://doi.org/10.1145/2931002.2931017",
      "doi": "10.1145/2931002.2931017"
    },
    {
      "text": "Anna Ståhl, Jonas Löwgren, and Kristina Höök. 2014. Evocative Balance : Designing for Interactional Empowerment. International Journal of Design 8, 1 (2014), 43–57. QC 20141110.",
      "doi": ""
    },
    {
      "text": "Patrick R. Steffen, Tara Austin, Andrea DeBarros, and Tracy Brown. 2017-08-25. The Impact of Resonance Frequency Breathing on Measures of Heart Rate Variability, Blood Pressure, and Mood. Frontiers in Public Health 5 (2017-08-25), 1–6. https://doi.org/10.3389/fpubh.2017.00222",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, Kristina Höök, and Eva-Carin Banka Johnson. 2016. The Soma Mat and Breathing Light. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’16. ACM Press, San Jose, California, USA, 305–308. https://doi.org/10.1145/2851581.2889464",
      "doi": "10.1145/2851581.2889464"
    },
    {
      "text": "Xiaotian Sun and Kiyoshi Tomimatsu. 2017. Breath is to be perceived - breathing signal sharing involved in remote emotional communication. In Distributed, Ambient and Pervasive Interactions - 5th International Conference, DAPI 2017 Held as Part of HCI International 2017, Proceedings(Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics)), Norbert Streitz and Panos Markopoulos (Eds.). Springer Verlag, Vancouver, Canada, 472–481. https://doi.org/10.1007/978-3-319-58697-7_35",
      "doi": "10.1007/978-3-319-58697-7_35"
    },
    {
      "text": "Petra Sundström, Elsa Vaara, Jordi Solsona, Niklas Wirström, Marcus Lundén, Jarmo Laaksolhati, Annika Waern, and Kristina Höök. 2011. Experiential artifacts as a design method for somaesthetic service development. In Proceedings of the 2011 ACM symposium on The role of design in UbiComp research & practice - RDURP ’11. ACM Press, Beijing, China, 33. https://doi.org/10.1145/2030031.2030041",
      "doi": "10.1145/2030031.2030041"
    },
    {
      "text": "Auditya Purwandini Sutarto, Muhammad Nubli Abdul Wahab, and Nora Mat Zin. 2012. Resonant Breathing Biofeedback Training for Stress Reduction Among Manufacturing Operators. International Journal of Occupational Safety and Ergonomics 18, 4(2012), 549–561. https://doi.org/10.1080/10803548.2012.11076959PMID: 23294659.",
      "doi": ""
    },
    {
      "text": "Faisal Taher, John Hardy, Abhijit Karnik, Christian Weichel, Yvonne Jansen, Kasper Hornbæk, and Jason Alexander. 2015. Exploring Interactions with Physically Dynamic Bar Charts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3237–3246. https://doi.org/10.1145/2702123.2702604",
      "doi": "10.1145/2702123.2702604"
    },
    {
      "text": "James Keng Soon Teh, Adrian David Cheok, Yongsoon Choi, Charith Lasantha Fernando, Roshan Lalintha Peiris, and Owen Noel Newton Fernando. 2009. Huggy pajama: a parent and child hugging communication system. In Proceedings of the 8th International Conference on Interaction Design and Children - IDC ’09. ACM Press, Como, Italy, 290. https://doi.org/10.1145/1551788.1551861",
      "doi": ""
    },
    {
      "text": "Kiyoshi Tomimatsu and Xiaotian Sun. 2016. Breathing shelter—Relieve citizen pressure with the breath control. ADADA international conference 2016 proceedings 15 (Nov. 2016), 3–7.",
      "doi": ""
    },
    {
      "text": "Muhammad Umair, Corina Sas, and Muhammad Hamza Latif. 2019. Towards Affective Chronometry: Exploring Smart Materials and Actuators for Real-time Representations of Changes in Arousal. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19. ACM Press, San Diego, CA, USA, 1479–1494. https://doi.org/10.1145/3322276.3322367",
      "doi": "10.1145/3322276.3322367"
    },
    {
      "text": "Jan Van Dixhoorn. 2007. Whole body breathing. Principles and practices of stress management 36, 3(2007), 291–332.",
      "doi": ""
    },
    {
      "text": "Marieke van Rooij, Adam Lobel, Owen Harris, Niki Smit, and Isabela Granic. 2016. DEEP: A Biofeedback Virtual Reality Game for Children At-risk for Anxiety. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’16. ACM Press, San Jose, California, USA, 1989–1997. https://doi.org/10.1145/2851581.2892452",
      "doi": "10.1145/2851581.2892452"
    },
    {
      "text": "Evgeny G Vaschillo, Bronya Vaschillo, and Paul M Lehrer. 2006. Characteristics of resonance in heart rate variability stimulated by biofeedback. Applied psychophysiology and biofeedback 31, 2 (2006), 129–142.",
      "doi": ""
    },
    {
      "text": "Cati Vaucelle, Leonardo Bonanni, and Hiroshi Ishii. 2009. Design of haptic interfaces for therapy. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press, Boston, MA, USA, 467. https://doi.org/10.1145/1518701.1518776",
      "doi": "10.1145/1518701.1518776"
    },
    {
      "text": "Jay Vidyarthi, Bernhard E. Riecke, and Diane Gromala. 2012. Sonic Cradle: designing for an immersive experience of meditation by connecting respiration to music. In Proceedings of the Designing Interactive Systems Conference on - DIS ’12. ACM Press, Newcastle Upon Tyne, United Kingdom, 408. https://doi.org/10.1145/2317956.2318017",
      "doi": "10.1145/2317956.2318017"
    },
    {
      "text": "Kanit Wongsuphasawat, Alex Gamburg, and Neema Moraveji. 2012. You Can’t Force Calm: Designing and Evaluating Respiratory Regulating Interfaces for Calming Technology. In Adjunct Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (Cambridge, Massachusetts, USA) (UIST Adjunct Proceedings ’12). Association for Computing Machinery, New York, NY, USA, 69–70. https://doi.org/10.1145/2380296.2380326",
      "doi": ""
    },
    {
      "text": "Libby Worth. 2015. Symmetry and asymmetry in dance and movement training using the Feldenkrais Method®. Theatre, Dance and Performance Training 6, 2 (May 2015), 130–144. https://doi.org/10.1080/19443927.2015.1049708",
      "doi": ""
    },
    {
      "text": "Bin Yu, Loe Feijs, Mathias Funk, and Jun Hu. 2015. Breathe with Touch: A Tactile Interface for Breathing Assistance System. In Human-Computer Interaction – INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Vol. 9298. Springer International Publishing, Cham, 45–52. https://doi.org/10.1007/978-3-319-22698-9_4Series Title: Lecture Notes in Computer Science.",
      "doi": "10.1007/978-3-319-22698-9_4"
    },
    {
      "text": "Semir Zeki. 2013. Clive Bell’s “Significant Form” and the neurobiology of aesthetics. Frontiers in Human Neuroscience 7 (Nov. 2013), 1–14. https://doi.org/10.3389/fnhum.2013.00730",
      "doi": ""
    }
  ]
}