{
  "doi": "10.1145/3411764.3445420",
  "title": "“It cannot do all of my work”: Community Health Worker Perceptions of AI-Enabled Mobile Health Applications in Rural India",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2021,
  "badges": [],
  "abstract": "Recent advances in Artificial Intelligence (AI) suggest that AI applications could transform healthcare delivery in the Global South. However, as researchers and technology companies rush to develop AI applications that aid the health of marginalized communities, it is critical to consider the needs and perceptions of the community health workers (CHWs) who will have to integrate these AI applications into the essential healthcare services they provide to rural communities. We describe a qualitative study examining CHWs’ perceptions of an AI application for automated disease diagnosis. Drawing on data from 21 interviews with CHWs in rural India, we characterize (1) CHWs’ knowledge, perceptions, and understandings of AI; and (2) the benefits and challenges that CHWs anticipate as AI applications are integrated into their workflows, including their opinions on automation of their work, possible misdiagnosis and errors, data access and surveillance issues, security and privacy challenges, and questions concerning trust. We conclude by discussing the implications of our work for HCI and AI research in low-resource environments.",
  "tags": [
    "Community health worker",
    "CHW",
    "Artificial Intelligence",
    "AI",
    "ICTD",
    "mHealth",
    "HCI4D"
  ],
  "authors": [
    {
      "name": "Chinasa T. Okolo",
      "institution": "Computer Science Cornell University, United States",
      "img": "/do/10.1145/contrib-99659700674/rel-imgonly/dpe_1001_med.jpg",
      "acmid": "99659700674",
      "orcid": "missing"
    },
    {
      "name": "Srujana Kamath",
      "institution": "Independent Researcher, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701258",
      "orcid": "missing"
    },
    {
      "name": "Nicola Dell",
      "institution": "Jacobs Institute Cornell Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486656510",
      "orcid": "0000-0002-6119-705X"
    },
    {
      "name": "Aditya Vashistha",
      "institution": "Cornell University, United States",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    }
  ],
  "references": [
    {
      "text": "2020. About Accredited Social Health Activist (ASHA) : National Health Mission. https://nhm.gov.in/index1.php?lang=1&level=1&sublinkid=150&lid=226",
      "doi": ""
    },
    {
      "text": "2020. India States Briefs – Uttar Pradesh. https://www.worldbank.org/en/country/india/brief/india-states-briefs-uttar-pradesh",
      "doi": ""
    },
    {
      "text": "2020. VR for Impact. https://vrforimpact.com",
      "doi": ""
    },
    {
      "text": "NITI Aayog. 2018. National strategy for artificial intelligence. Paper. June (2018).",
      "doi": ""
    },
    {
      "text": "Ashraf Abdul, Jo Vermeulen, Danding Wang, Brian Y. Lim, and Mohan Kankanhalli. 2018. Trends and Trajectories for Explainable, Accountable and Intelligible Systems: An HCI Research Agenda. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3173574.3174156",
      "doi": "10.1145/3173574.3174156"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Jay Chen, and Nicola Dell. 2017. Digital privacy challenges with shared mobile phone use in bangladesh. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–20.",
      "doi": "10.1145/3134652"
    },
    {
      "text": "[7] Wadhwani AI.2020. Retrieved September 8, 2020 from https://www.wadhwaniai.org/",
      "doi": ""
    },
    {
      "text": "Wadhwani AI. 2020. AI-POWERED ANTHROPOMETRY. Retrieved September 8, 2020 from https://www.wadhwaniai.org/work/maternal-newborn-child-health/",
      "doi": ""
    },
    {
      "text": "Saleema Amershi. 2020. Toward Responsible AI by Planning to Fail. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. 3607–3607.",
      "doi": "10.1145/3394486.3409557"
    },
    {
      "text": "Saleema Amershi. 2020. Toward Responsible AI by Planning to Fail. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining(KDD ’20). Association for Computing Machinery, New York, NY, USA, 3607. https://doi.org/10.1145/3394486.3409557",
      "doi": "10.1145/3394486.3409557"
    },
    {
      "text": "Saleema Amershi, Maya Cakmak, William Bradley Knox, and Todd Kulesza. 2014. Power to the people: The role of humans in interactive machine learning. Ai Magazine 35, 4 (2014), 105–120.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, 2019. Guidelines for human-AI interaction. In Proceedings of the 2019 CHI conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Morgan G Ames. 2019. The charisma machine: The life, death, and legacy of One Laptop per Child. MIT.",
      "doi": ""
    },
    {
      "text": "Yaw Anokwa, Thomas N Smyth, Divya Ramachandran, Jahanzeb Sherwani, Yael Schwartzman, Rowena Luk, Melissa Ho, Neema Moraveji, and Brian DeRenzi. 2009. Stories from the field: Reflections on HCI4D experiences. Information Technologies & International Development 5, 4(2009), pp–101.",
      "doi": ""
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Walter S Lasecki, Daniel S Weld, and Eric Horvitz. 2019. Beyond accuracy: The role of mental models in human-AI team performance. In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing, Vol. 7. 2–11.",
      "doi": ""
    },
    {
      "text": "Abdullah H Baqui, Shams El-Arifeen, Gary L Darmstadt, Saifuddin Ahmed, Emma K Williams, Habibur R Seraji, Ishtiaq Mannan, Syed M Rahman, Rasheduzzaman Shah, Samir K Saha, 2008. Effect of community-based newborn-care intervention package implemented through two service-delivery strategies in Sylhet district, Bangladesh: a cluster-randomised controlled trial. The lancet 371, 9628 (2008), 1936–1944.",
      "doi": ""
    },
    {
      "text": "Emma Beede, Elizabeth Baylor, Fred Hersch, Anna Iurchenko, Lauren Wilcox, Paisan Ruamviboonsuk, and Laura M Vardoulakis. 2020. A Human-Centered Evaluation of a Deep Learning System Deployed in Clinics for the Detection of Diabetic Retinopathy. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376718"
    },
    {
      "text": "Michael L Best and Rajendra Kumar. 2008. Sustainability failures of rural telecenters: Challenges from the sustainable access in rural india (sari) project. (2008).",
      "doi": ""
    },
    {
      "text": "Pranav Bhagat, Sachin Kumar Prajapati, and Aaditeshwar Seth. 2020. Initial Lessons from Building an IVR-based Automated Question-Answering System. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–5.",
      "doi": "10.1145/3392561.3397581"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Anna Brown, Alexandra Chouldechova, Emily Putnam-Hornstein, Andrew Tobin, and Rhema Vaithianathan. 2019. Toward Algorithmic Accountability in Public Services: A Qualitative Study of Affected Community Perspectives on Algorithmic Decision-making in Child Welfare Services. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300271",
      "doi": "10.1145/3290605.3300271"
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on fairness, accountability and transparency. 77–91.",
      "doi": ""
    },
    {
      "text": "Margaret Burnett. 2020. Explaining AI: Fairly? Well?. In Proceedings of the 25th International Conference on Intelligent User Interfaces (Cagliari, Italy) (IUI ’20). Association for Computing Machinery, New York, NY, USA, 1–2. https://doi.org/10.1145/3377325.3380623",
      "doi": "10.1145/3377325.3380623"
    },
    {
      "text": "Carrie J. Cai, Samantha Winter, David Steiner, Lauren Wilcox, and Michael Terry. 2019. ”Hello AI”: Uncovering the Onboarding Needs of Medical Practitioners for Human-AI Collaborative Decision-Making. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 104 (Nov. 2019), 24 pages. https://doi.org/10.1145/3359206",
      "doi": "10.1145/3359206"
    },
    {
      "text": "Vikram Kamath Cannanure, Timothy X Brown, and Amy Ogan. 2020. DIA: A Human AI Hybrid Conversational Assistant for Developing Contexts. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development (Guayaquil, Ecuador) (ICTD 2020). Association for Computing Machinery, New York, NY, USA, Article 24, 5 pages. https://doi.org/10.1145/3392561.3397577",
      "doi": "10.1145/3392561.3397577"
    },
    {
      "text": "Y. Cao, C. Liu, B. Liu, M. J. Brunette, N. Zhang, T. Sun, P. Zhang, J. Peinado, E. S. Garavito, L. L. Garcia, and W. H. Curioso. 2016. Improving Tuberculosis Diagnostics Using Deep Learning and Mobile Health Technologies among Resource-Poor and Marginalized Communities. In 2016 IEEE First International Conference on Connected Health: Applications, Systems and Engineering Technologies (CHASE). 274–281.",
      "doi": ""
    },
    {
      "text": "Stephen Cave, Kate Coughlan, and Kanta Dihal. 2019. ”Scary Robots”: Examining Public Responses to AI. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (Honolulu, HI, USA) (AIES ’19). Association for Computing Machinery, New York, NY, USA, 331–337. https://doi.org/10.1145/3306618.3314232",
      "doi": "10.1145/3306618.3314232"
    },
    {
      "text": "Tathagata Chakraborti and Subbarao Kambhampati. 2019. (When) can AI bots lie?. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society. 53–59.",
      "doi": "10.1145/3306618.3314281"
    },
    {
      "text": "Jay Chen, Michael Paik, and Kelly McCabe. 2014. Exploring internet security perceptions and practices in urban ghana. In Proceedings of the Tenth USENIX Conference on Usable Privacy and Security(SOUPS ’14). USENIX Association, USA, 129–142.",
      "doi": "10.5555/3235838.3235850"
    },
    {
      "text": "Liang-Kung Chen. 2018. Artificial intelligence in medicine and healthcare.",
      "doi": ""
    },
    {
      "text": "Ivan Contreras and Josep Vehi. 2018. Artificial intelligence for diabetes management and decision support: literature review. Journal of medical Internet research 20, 5 (2018), e10775.",
      "doi": ""
    },
    {
      "text": "Sara Corbett. 2008. Can the Cellphone Help End Global Poverty?The New York Times (April 2008). https://www.nytimes.com/2008/04/13/magazine/13anthropology-t.html",
      "doi": ""
    },
    {
      "text": "Darcy A. Davis, Nitesh V. Chawla, Nicholas Blumm, Nicholas Christakis, and Albert-László Barabasi. 2008. Predicting Individual Disease Risk Based on Medical History. In Proceedings of the 17th ACM Conference on Information and Knowledge Management (Napa Valley, California, USA) (CIKM ’08). Association for Computing Machinery, New York, NY, USA, 769–778. https://doi.org/10.1145/1458082.1458185",
      "doi": "10.1145/1458082.1458185"
    },
    {
      "text": "Nicola Dell and Gaetano Borriello. 2013. Mobile tools for point-of-care diagnostics in the developing world. In Proceedings of the 3rd ACM Symposium on Computing for Development. 1–10.",
      "doi": "10.1145/2442882.2442894"
    },
    {
      "text": "Nicola Dell, Jessica Crawford, Nathan Breit, Timóteo Chaluco, Aida Coelho, Joseph McCord, and Gaetano Borriello. 2013. Integrating ODK Scan into the Community Health Worker Supply Chain in Mozambique. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1 (Cape Town, South Africa) (ICTD ’13). Association for Computing Machinery, New York, NY, USA, 228–237. https://doi.org/10.1145/2516604.2516611",
      "doi": "10.1145/2516604.2516611"
    },
    {
      "text": "Nicola Dell, Ian Francis, Haynes Sheppard, Raiva Simbi, and Gaetano Borriello. 2014. Field evaluation of a camera-based mobile health system in low-resource settings. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. 33–42.",
      "doi": "10.1145/2628363.2628366"
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The ins and outs of HCI for development. In Proceedings of the 2016 CHI conference on human factors in computing systems. 2220–2232.",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. ”Yours is Better!”: Participant Response Bias in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1321–1330. https://doi.org/10.1145/2207676.2208589",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Brian DeRenzi, Nicola Dell, Jeremy Wacksman, Scott Lee, and Neal Lesh. 2017. Supporting community health workers in India through voice-and web-based feedback. In Proceedings of the 2017 CHI conference on human factors in computing systems. 2770–2781.",
      "doi": "10.1145/3025453.3025514"
    },
    {
      "text": "Brian DeRenzi, Leah Findlater, Jonathan Payne, Benjamin Birnbaum, Joachim Mangilima, Tapan Parikh, Gaetano Borriello, and Neal Lesh. 2012. Improving community health worker performance through automated SMS. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development. 25–34.",
      "doi": "10.1145/2160673.2160677"
    },
    {
      "text": "Brian DeRenzi, Neal Lesh, Tapan Parikh, Clayton Sims, Werner Maokla, Mwajuma Chemba, Yuna Hamisi, David S hellenberg, Marc Mitchell, and Gaetano Borriello. 2008. E-IMCI: Improving pediatric health care in low-income countries. In Proceedings of the SIGCHI conference on human factors in computing systems. 753–762.",
      "doi": "10.1145/1357054.1357174"
    },
    {
      "text": "Brian DeRenzi, Jeremy Wacksman, Nicola Dell, Scott Lee, Neal Lesh, Gaetano Borriello, and Andrew Ellner. 2016. Closing the feedback Loop: A 12-month evaluation of ASTA, a self-tracking application for ASHAs. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. 1–10.",
      "doi": "10.1145/2909609.2909652"
    },
    {
      "text": "Xianghua Ding, Yanqi Jiang, Xiankang Qin, Yunan Chen, Wenqiang Zhang, and Lizhe Qi. 2019. Reading Face, Reading Health: Exploring Face Reading Technologies for Everyday Health. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300435",
      "doi": "10.1145/3290605.3300435"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social Justice-Oriented Interaction Design: Outlining Key Design Strategies and Commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems(DIS ’16). Association for Computing Machinery, New York, NY, USA, 656–671. https://doi.org/10.1145/2901790.2901861",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Artificial Intelligence Task Force. 2018. Artificial Intelligence Task Force, constituted by Ministry of Commerce and Industry. Government of the Republic of India, available online at www.aitf.org.in (2018).",
      "doi": ""
    },
    {
      "text": "Martin Ford. 2015. Rise of the Robots: Technology and the Threat of a Jobless Future. Basic Books.",
      "doi": ""
    },
    {
      "text": "Batya Friedman and Peter H Kahn Jr. 2003. Human values, ethics, and design. The human-computer interaction handbook(2003), 1177–1201.",
      "doi": ""
    },
    {
      "text": "Katy Ilonka Gero, Zahra Ashktorab, Casey Dugan, Qian Pan, James Johnson, Werner Geyer, Maria Ruiz, Sarah Miller, David R. Millen, Murray Campbell, Sadhana Kumaravel, and Wei Zhang. 2020. Mental Models of AI Agents in a Cooperative Game Setting. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376316",
      "doi": "10.1145/3313831.3376316"
    },
    {
      "text": "Abid Haleem, Mohd Javaid, and Ibrahim Haleem Khan. 2019. Current status and applications of Artificial Intelligence (AI) in medical field: An overview. Current Medicine Research and Practice 9, 6 (2019), 231 – 237. https://doi.org/10.1016/j.cmrp.2019.11.005",
      "doi": ""
    },
    {
      "text": "Carl Hartung, Adam Lerer, Yaw Anokwa, Clint Tseng, Waylon Brunette, and Gaetano Borriello. 2010. Open Data Kit: Tools to Build Information Services for Developing Regions. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (London, United Kingdom) (ICTD ’10). Association for Computing Machinery, New York, NY, USA, Article 18, 12 pages. https://doi.org/10.1145/2369220.2369236",
      "doi": "10.1145/2369220.2369236"
    },
    {
      "text": "Lara Houston, Steven J Jackson, Daniela K Rosner, Syed Ishtiaque Ahmed, Meg Young, and Laewoo Kang. 2016. Values in repair. In Proceedings of the 2016 CHI conference on human factors in computing systems. 1403–1414.",
      "doi": "10.1145/2858036.2858470"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’03). Association for Computing Machinery, New York, NY, USA, 17–24. https://doi.org/10.1145/642611.642616",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "[53] Google Research India.2020. Retrieved September 8, 2020 from https://research.google/locations/india/",
      "doi": ""
    },
    {
      "text": "Google Research India. 2020. Applying AI to Big Problems. Retrieved September 8, 2020 from https://india.googleblog.com/2020/02/applying-ai-to-big-problemssix-research.html?m=1",
      "doi": ""
    },
    {
      "text": "Internet.org. 2020. Free Basics from Facebook. Retrieved September 8, 2020 from https://info.internet.org/en/story/free-basics-from-internet-org/",
      "doi": ""
    },
    {
      "text": "Azra Ismail, Naveena Karusala, and Neha Kumar. 2018. Bridging Disconnected Knowledges for Community Health. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–27.",
      "doi": "10.1145/3274344"
    },
    {
      "text": "Azra Ismail and Neha Kumar. 2018. Engaging solidarity in data collection practices for community health. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–24.",
      "doi": "10.1145/3274345"
    },
    {
      "text": "Steven J Jackson, Syed Ishtiaque Ahmed, and Md Rashidujjaman Rifat. 2014. Learning, innovation, and sustainability among mobile phone repairers in Dhaka, Bangladesh. In Proceedings of the 2014 conference on Designing interactive systems. 905–914.",
      "doi": "10.1145/2598510.2598576"
    },
    {
      "text": "Steven J Jackson, Alex Pompe, and Gabriel Krieshok. 2012. Repair worlds: maintenance, repair, and ICT for development in rural Namibia. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. 107–116.",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Mohit Jain, Pratyush Kumar, Ishita Bhansali, Q. Vera Liao, Khai Truong, and Shwetak Patel. 2018. FarmChat: A Conversational Agent to Answer Farmer Queries. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (Dec. 2018), 170:1–170:22. https://doi.org/10.1145/3287048",
      "doi": "10.1145/3287048"
    },
    {
      "text": "Maurice Jakesch, Megan French, Xiao Ma, Jeffrey T Hancock, and Mor Naaman. 2019. AI-mediated communication: How the perception that profile text was written by AI affects trustworthiness. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300469"
    },
    {
      "text": "Huanhuan Ji, Zhenbing Liu, Wei Qi Yan, and Reinhard Klette. 2019. Early Diagnosis of Alzheimer’s Disease Using Deep Learning. In Proceedings of the 2nd International Conference on Control and Computer Vision (Jeju, Republic of Korea) (ICCCV 2019). Association for Computing Machinery, New York, NY, USA, 87–91. https://doi.org/10.1145/3341016.3341024",
      "doi": "10.1145/3341016.3341024"
    },
    {
      "text": "Anna Jobin, Marcello Ienca, and Effy Vayena. 2019. The global landscape of AI ethics guidelines. Nature Machine Intelligence 1, 9 (2019), 389–399.",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Yongwei Yang, Courtney Heldreth, Christopher Moessner, Aaron Sedley, Andreas Kramm, David Newman, and Allison Woodruff. 2019. ” Happy and Assured that life will be easy 10years from now.”: Perceptions of Artificial Intelligence in 8 Countries. arXiv preprint arXiv:2001.00081(2019).",
      "doi": ""
    },
    {
      "text": "Rafal Kocielnik, Saleema Amershi, and Paul N Bennett. 2019. Will you accept an imperfect AI? exploring designs for adjusting end-user expectations of AI systems. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300641"
    },
    {
      "text": "Mamidala Jagadesh Kumar. 2019. National Centre on Artificial Intelligence: India on the Move.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J Anderson. 2015. Mobile phones for maternal health in rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 427–436.",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Neha Kumar, Waylon Brunette, Nicola Dell, Trevor Perrier, Beth Kolko, Gaetano Borriello, and Richard Anderson. 2015. Understanding sociotechnical implications of mobile health deployments in India, Kenya, and Zimbabwe. Information Technologies & International Development 11, 4(2015), pp–17.",
      "doi": ""
    },
    {
      "text": "Vishwajeet Kumar, Saroj Mohanty, Aarti Kumar, Rajendra P Misra, Mathuram Santosham, Shally Awasthi, Abdullah H Baqui, Pramod Singh, Vivek Singh, Ramesh C Ahuja, 2008. Effect of community-based behaviour change management on neonatal mortality in Shivgarh, Uttar Pradesh, India: a cluster-randomised controlled trial. The Lancet 372, 9644 (2008), 1151–1162.",
      "doi": ""
    },
    {
      "text": "Jeff Larson, Surya Mattu, Lauren Kirchner, and Julia Angwin. 2016. How we analyzed the COMPAS recidivism algorithm. ProPublica (5 2016) 9, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Q. Vera Liao, Daniel Gruen, and Sarah Miller. 2020. Questioning the AI: Informing Design Practices for Explainable AI User Experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376590",
      "doi": "10.1145/3313831.3376590"
    },
    {
      "text": "Joseph Lindley, Haider Ali Akmal, Franziska Pilling, and Paul Coulton. 2020. Researching AI Legibility through Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376792",
      "doi": "10.1145/3313831.3376792"
    },
    {
      "text": "Duri Long and Brian Magerko. 2020. What is AI Literacy? Competencies and Design Considerations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376727"
    },
    {
      "text": "Frank Marcinkowski, Kimon Kieslich, Christopher Starke, and Marco Lünich. 2020. Implications of AI (un-) fairness in higher education admissions: the effects of perceived AI (un-) fairness on exit, voice and organizational reputation. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency. 122–130.",
      "doi": "10.1145/3351095.3372867"
    },
    {
      "text": "Paul K McClure. 2018. “You’re fired,” says the robot: The rise of automation in the workplace, technophobes, and fears of unemployment. Social Science Computer Review 36, 2 (2018), 139–156.",
      "doi": "10.1177/0894439317698637"
    },
    {
      "text": "Indrani Medhi and Kentaro Toyama. 2007. Full-context videos for first-time, non-literate PC users. In 2007 International Conference on Information and Communication Technologies and Development. 1–9. https://doi.org/10.1109/ICTD.2007.4937400",
      "doi": ""
    },
    {
      "text": "Tim Miller. 2019. Explanation in artificial intelligence: Insights from the social sciences. Artificial Intelligence 267 (Feb. 2019), 1–38. https://doi.org/10.1016/j.artint.2018.07.007",
      "doi": ""
    },
    {
      "text": "Maletsabisa Molapo, Melissa Densmore, and Brian DeRenzi. 2017. Video consumption patterns for first time smartphone users: Community health workers in Lesotho. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6159–6170.",
      "doi": "10.1145/3025453.3025616"
    },
    {
      "text": "Maletsabisa Molapo, Melissa Densmore, and Limpho Morie. 2016. Designing with community health workers: enabling productive participation through exploration. In Proceedings of the First African Conference on Human Computer Interaction. 58–68.",
      "doi": "10.1145/2998581.2998589"
    },
    {
      "text": "Michael Muller and Q. Vera Liao. 2017. Exploring AI Ethics and Values through Participatory Design Fictions. Human Computer Interaction Consortium(2017).",
      "doi": ""
    },
    {
      "text": "Sundaram Natarajan, Astha Jain, Radhika Krishnan, Ashwini Rogye, and Sobha Sivaprasad. 2019. Diagnostic Accuracy of Community-Based Diabetic Retinopathy Screening With an Offline Artificial Intelligence System on a Smartphone. JAMA Ophthalmology 137, 10 (10 2019), 1182–1188. https://doi.org/10.1001/jamaophthalmol.2019.2923arXiv:https://jamanetwork.com/journals/jamaophthalmology/articlepdf/2747315/ jamaophthalmology_natarajan_2019_oi_190055.pdf",
      "doi": ""
    },
    {
      "text": "United Nations. 2019. Towards an Ethics of Artificial Intelligence. https://www.un.org/en/chronicle/article/towards-ethics-artificial-intelligence Publisher: United Nations.",
      "doi": ""
    },
    {
      "text": "Kee Yuan Ngiam and Wei Khor. 2019. Big data and machine learning algorithms for health-care delivery. The Lancet Oncology 20, 5 (2019), e262–e273.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2009. Privacy in context: Technology, policy, and the integrity of social life. Stanford University Press.",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Adeline Nyamathi, Alecia Y. Hanson, Benissa E. Salem, Sanjeev Sinha, Kalyan K. Ganguly, Barbara Leake, Kartik Yadav, and Mary Marfisee. 2012. Impact of a Rural Village Women (Asha) Intervention on Adherence to Antiretroviral Therapy in Southern India. Nursing research 61, 5 (2012), 353–362. https://doi.org/10.1097/NNR.0b013e31825fe3ef",
      "doi": ""
    },
    {
      "text": "Ziad Obermeyer and Sendhil Mullainathan. 2019. Dissecting racial bias in an algorithm that guides health decisions for 70 million people. In Proceedings of the Conference on Fairness, Accountability, and Transparency. 89–89.",
      "doi": "10.1145/3287560.3287593"
    },
    {
      "text": "Fabian Okeke, Lucas Nene, Anne Muthee, Stephen Odindo, Dianna Kane, Isaac Holeman, and Nicola Dell. 2019. Opportunities and challenges in connecting care recipients to the community health feedback loop. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. 1–11.",
      "doi": "10.1145/3287098.3287111"
    },
    {
      "text": "Fabian Okeke, Beatrice Wasunna, Mercy Amulele, Isaac Holeman, and Nicola Dell. 2019. Including the Voice of Care Recipients in Community Health Feedback Loops in Rural Kenya. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–20.",
      "doi": "10.1145/3359173"
    },
    {
      "text": "World Health Organization. 2019. Pneumonia: Key Facts. Retrieved September 8, 2020 from https://www.who.int/news-room/fact-sheets/detail/pneumonia",
      "doi": ""
    },
    {
      "text": "Martin T Orne. 1962. On the social psychology of the psychological experiment: With particular reference to demand characteristics and their implications.American psychologist 17, 11 (1962), 776.",
      "doi": ""
    },
    {
      "text": "Caroline O’Neill. 2017. Is AI a threat or benefit to health workers?",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Anjuli Dasika, Ahmad Hasan, Jackie Wolf, Nick Reid, Vaishnav Kameswaran, Purva Yardi, Allyson Mackay, Abram Wagner, Bhramar Mukherjee, 2017. Changing data practices for community health workers: Introducing digital data collection in West Bengal, India. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development. 1–12.",
      "doi": "10.1145/3136560.3136582"
    },
    {
      "text": "Chunjong Park, Alex Mariakakis, Jane Yang, Diego Lassala, Yasamba Djiguiba, Youssouf Keita, Hawa Diarra, Beatrice Wasunna, Fatou Fall, Marème Soda Gaye, 2020. Supporting Smartphone-Based Image Capture of Rapid Diagnostic Tests in Low-Resource Settings. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–11.",
      "doi": "10.1145/3392561.3394630"
    },
    {
      "text": "Sun Young Park, Pei-Yi Kuo, Andrea Barbarin, Elizabeth Kaziunas, Astrid Chow, Karandeep Singh, Lauren Wilcox, and Walter S. Lasecki. 2019. Identifying Challenges and Opportunities in Human-AI Collaboration in Healthcare. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (Austin, TX, USA) (CSCW ’19). Association for Computing Machinery, New York, NY, USA, 506–510. https://doi.org/10.1145/3311957.3359433",
      "doi": "10.1145/3311957.3359433"
    },
    {
      "text": "Giorgio Quer, Evan D Muse, Nima Nikzad, Eric J Topol, and Steven R Steinhubl. 2017. Augmenting diagnostic vision with AI. The Lancet 390, 10091 (2017), 221.",
      "doi": ""
    },
    {
      "text": "John A Quinn, Rose Nakasi, Pius KB Mugagga, Patrick Byanyima, William Lubega, and Alfred Andama. 2016. Deep convolutional neural networks for microscopy-based point of care diagnostics. In Machine Learning for Healthcare Conference. 271–281.",
      "doi": ""
    },
    {
      "text": "Divya Ramachandran, John Canny, Prabhu Dutta Das, and Edward Cutrell. 2010. Mobile-izing health workers in rural India. In Proceedings of the SIGCHI conference on human factors in computing systems. 1889–1898.",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Ludovic Righetti, Raj Madhavan, and Raja Chatila. 2019. Unintended Consequences of Biased Robotic and Artificial Intelligence Systems [Ethical, Legal, and Societal Issues]. IEEE Robotics & Automation Magazine 26, 3 (2019), 11–13.",
      "doi": ""
    },
    {
      "text": "Francesca Rossi. 2018. Building trust in artificial intelligence. Journal of international affairs 72, 1 (2018), 127–134.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchill. 2018. ” Privacy is not for me, it’s for those rich women”: Performative Privacy Practices on Mobile Phones by Women in South Asia. In Fourteenth Symposium on Usable Privacy and Security ({SOUPS} 2018). 127–142.",
      "doi": ""
    },
    {
      "text": "[101] Nehru Yuva Sangthan-Tisi.2020. Retrieved September 8, 2020 from https://www.nystindia.org/",
      "doi": ""
    },
    {
      "text": "Edward Santow. 2020. Emerging from AI utopia.",
      "doi": ""
    },
    {
      "text": "Lipekho Saprii, Esther Richards, Puni Kokho, and Sally Theobald. 2015. Community health workers in rural India: analysing the opportunities and challenges Accredited Social Health Activists (ASHAs) face in realising their multiple roles. Human Resources for Health 13, 1 (Dec. 2015), 95. https://doi.org/10.1186/s12960-015-0094-3",
      "doi": ""
    },
    {
      "text": "Mike Schaekermann, Graeme Beaton, Elaheh Sanoubari, Andrew Lim, Kate Larson, and Edith Law. 2020. Ambiguity-Aware AI Assistants for Medical Data Analysis. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376506",
      "doi": "10.1145/3313831.3376506"
    },
    {
      "text": "Helen Schneider, Dickson Okello, and Uta Lehmann. 2016. The global pendulum swing towards community health workers in low-and middle-income countries: a scoping review of trends, geographical distribution and programmatic orientations, 2005 to 2014. Human resources for health 14, 1 (2016), 65.",
      "doi": ""
    },
    {
      "text": "Judy Scott and Carlton Scott. 2017. Drone delivery models for healthcare. In Proceedings of the 50th Hawaii international conference on system sciences.",
      "doi": ""
    },
    {
      "text": "Kerry Scott, SW Beckham, Margaret Gross, George Pariyo, Krishna D Rao, Giorgio Cometto, and Henry B Perry. 2018. What do we know about community-based health worker programs? A systematic review of existing reviews on community health workers. Human resources for health 16, 1 (2018), 39.",
      "doi": ""
    },
    {
      "text": "Nigam H Shah, Arnold Milstein, and Steven C Bagley. 2019. Making machine learning models clinically useful. Jama 322, 14 (2019), 1351–1352.",
      "doi": ""
    },
    {
      "text": "Nick Taylor, Keith Cheverst, Peter Wright, and Patrick Olivier. 2013. Leaving the wild: lessons from community technology handovers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 1549–1558. https://doi.org/10.1145/2470654.2466206",
      "doi": "10.1145/2470654.2466206"
    },
    {
      "text": "Divy Thakkar, Neha Kumar, and Nithya Sambasivan. 2020. Towards an AI-Powered Future that Works for Vocational Workers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376674"
    },
    {
      "text": "Indrani Medhi Thies, Nandita Menon, Sneha Magapu, Manisha Subramony, and Jacki O’Neill. 2017. How do you want your chatbot? An exploratory Wizard-of-Oz study with young, urban Indians. In IFIP Conference on Human-Computer Interaction. Springer, 441–459.",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2015. Geek heresy: Rescuing social change from the cult of technology. PublicAffairs.",
      "doi": ""
    },
    {
      "text": "Khandekar V. 2014. Strengthening Primary Health Care Through Asha Workers: A Novel Approach in India. Primary Health Care: Open Access 04 (01 2014). https://doi.org/10.4172/2167-1079.1000149",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Richard Anderson, and Shrirang Mare. 2018. Examining Security and Privacy Research in Developing Regions. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies(COMPASS ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3209811.3209818",
      "doi": "10.1145/3209811.3209818"
    },
    {
      "text": "Aditya Vashistha, Richard Anderson, and Shrirang Mare. 2019. Examining the use and non-use of mobile payment systems for merchant payments in India. In Proceedings of the 2nd ACM SIGCAS Conference on Computing and Sustainable Societies(COMPASS ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3314344.3332499",
      "doi": "10.1145/3314344.3332499"
    },
    {
      "text": "Aditya Vashistha, Neha Kumar, Anil Mishra, and Richard Anderson. 2016. Mobile video dissemination for community health. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. 1–11.",
      "doi": "10.1145/2909609.2909655"
    },
    {
      "text": "Aditya Vashistha, Neha Kumar, Anil Mishra, and Richard Anderson. 2017. Examining localization approaches for community health. In Proceedings of the 2017 Conference on Designing Interactive Systems. 357–368.",
      "doi": "10.1145/3064663.3064754"
    },
    {
      "text": "Aditya Vashistha, Fabian Okeke, Richard Anderson, and Nicola Dell. 2018. ’You Can Always Do Better!”: The Impact of Social Proof on Participant Response Bias. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174126",
      "doi": "10.1145/3173574.3174126"
    },
    {
      "text": "Dakuo Wang, Justin D Weisz, Michael Muller, Parikshit Ram, Werner Geyer, Casey Dugan, Yla Tausczik, Horst Samulowitz, and Alexander Gray. 2019. Human-AI Collaboration in Data Science: Exploring Data Scientists’ Perceptions of Automated AI. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359313"
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, and Brian Y. Lim. 2019. Designing Theory-Driven User-Centric Explainable AI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300831",
      "doi": "10.1145/3290605.3300831"
    },
    {
      "text": "Apichai Wattanapisit, Chin Hai Teo, Sanhapan Wattanapisit, Emylia Teoh, Wing Jun Woo, and Chirk Jenn Ng. 2020. Can mobile health apps replace GPs? A scoping review of comparisons between mobile apps and GP tasks. BMC medical informatics and decision making 20, 1 (2020), 5.",
      "doi": ""
    },
    {
      "text": "Darrell M West. 2018. The future of work: Robots, AI, and automation. Brookings Institution Press.",
      "doi": ""
    },
    {
      "text": "Caroline Whidden, Kassoum Kayentao, Jenny X Liu, Scott Lee, Youssouf Keita, Djoumé Diakité, Alexander Keita, Samba Diarra, Jacqueline Edwards, Amanda Yembrick, 2018. Improving Community Health Worker performance by using a personalised feedback dashboard for supervision: a randomised controlled trial. Journal of global health 8, 2 (2018).",
      "doi": ""
    },
    {
      "text": "Randi Williams, Hae Won Park, and Cynthia Breazeal. 2019. A is for artificial intelligence: the impact of artificial intelligence activities on young children’s perceptions of robots. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300677"
    },
    {
      "text": "Ching-seh Mike Wu, Mustafa Badshah, and Vishwa Bhagwat. 2019. Heart Disease Prediction Using Data Mining Techniques. In Proceedings of the 2019 2nd International Conference on Data Science and Information Technology (Seoul, Republic of Korea) (DSIT 2019). Association for Computing Machinery, New York, NY, USA, 7–11. https://doi.org/10.1145/3352411.3352413",
      "doi": "10.1145/3352411.3352413"
    },
    {
      "text": "Susan Wyche. 2019. Using Cultural Probes In New Contexts: Exploring the Benefits of Probes in HCI4D/ICTD. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing(CSCW ’19). Association for Computing Machinery, New York, NY, USA, 423–427. https://doi.org/10.1145/3311957.3359454",
      "doi": "10.1145/3311957.3359454"
    },
    {
      "text": "Yao Xie, Melody Chen, David Kao, Ge Gao, and Xiang’Anthony’ Chen. 2020. CheXplain: Enabling Physicians to Explore and Understand Data-Driven, AI-Enabled Medical Imaging Analysis. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376807"
    },
    {
      "text": "Haoyi Xiong, Jinghe Zhang, Yu Huang, Kevin Leach, and Laura E. Barnes. 2017. Daehr: A Discriminant Analysis Framework for Electronic Health Record Data and an Application to Early Detection of Mental Health Disorders. ACM Trans. Intell. Syst. Technol. 8, 3, Article 47 (Feb. 2017), 21 pages. https://doi.org/10.1145/3007195",
      "doi": "10.1145/3007195"
    },
    {
      "text": "Deepika Yadav, Anushka Bhandari, and Pushpendra Singh. 2019. LEAP: Scaffolding Collaborative Learning of Community Health Workers in India. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": "10.1145/3359271"
    },
    {
      "text": "Deepika Yadav, Prerna Malik, Kirti Dabas, and Pushpendra Singh. 2019. Feedpal: Understanding opportunities for chatbots in breastfeeding education of women in india. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–30.",
      "doi": "10.1145/3359272"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Rosé, and John Zimmerman. 2020. Re-Examining Whether, Why, and How Human-AI Interaction Is Uniquely Difficult to Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376301",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Cheryl Young, Stephen Barker, Rodney Ehrlich, Barry Kistnasamy, and Annalee Yassi. 2020. Computer-aided detection for tuberculosis and silicosis in chest radiographs of gold miners of South Africa. The International Journal of Tuberculosis and Lung Disease 24, 4(2020), 444–451.",
      "doi": ""
    },
    {
      "text": "Yunfeng Zhang, Q. Vera Liao, and Rachel K. E. Bellamy. 2020. Effect of Confidence and Explanation on Accuracy and Trust Calibration in AI-Assisted Decision Making. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency (Barcelona, Spain) (FAT* ’20). Association for Computing Machinery, New York, NY, USA, 295–305. https://doi.org/10.1145/3351095.3372852",
      "doi": "10.1145/3351095.3372852"
    },
    {
      "text": "Nengjun Zhu, Jian Cao, Kunwei Shen, Xiaosong Chen, and Siji Zhu. 2020. A Decision Support System with Intelligent Recommendation for Multi-Disciplinary Medical Treatment. ACM Trans. Multimedia Comput. Commun. Appl. 16, 1s, Article 33 (March 2020), 23 pages. https://doi.org/10.1145/3352573",
      "doi": "10.1145/3352573"
    }
  ]
}