{
  "doi": "10.1145/3411764.3445201",
  "title": "BezelGlide: Interacting with Graphs on Smartwatches with Minimal Screen Occlusion",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "We present BezelGlide, a novel suite of bezel interaction techniques, designed to minimize screen occlusion and ‘fat finger’ effects, when interacting with common graphs on smartwatches. To explore the design of BezelGlide, we conducted two user studies. First, we quantified the amount of screen occlusion experienced when interacting with the smartwatch bezel. Next, we designed two techniques that involve gliding the finger along the smartwatch bezel for graph interaction. Full BezelGlide (FBG) and Partial BezelGlide (PBG), use the full or a portion of the bezel, respectively, to reduce screen occlusion while scanning a line chart for data. In the common value detection task, we find that PBG outperforms FBG and Shift, a touchscreen occlusion-free technique, both quantitatively and subjectively, also while mobile. We finally illustrate the generzability potential of PBG to interact with common graph types making it a valuable interaction technique for smartwatch users.",
  "authors": [
    {
      "name": "Ali Neshati",
      "institution": "Computer Science University of Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658697518",
      "orcid": "0000-0002-0405-1169"
    },
    {
      "name": "Bradley Rey",
      "institution": "Department of Computer Science/Human Computer Interaction Lab University of Manitoba, Canada",
      "img": "/do/10.1145/contrib-99659536233/rel-imgonly/bradleyrey_headshot_round.png",
      "acmid": "99659536233",
      "orcid": "0000-0001-7356-0656"
    },
    {
      "name": "Ahmed Shariff Mohommed Faleel",
      "institution": "Department of Computer Science University of Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700497",
      "orcid": "missing"
    },
    {
      "name": "Sandra Bardot",
      "institution": "HCI Lab University of Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658657437",
      "orcid": "missing"
    },
    {
      "name": "Celine Latulipe",
      "institution": "Department of Computer Science University of Manitoba, Canada",
      "img": "/do/10.1145/contrib-81100323202/rel-imgonly/celine-1657_sm.jpg",
      "acmid": "81100323202",
      "orcid": "missing"
    },
    {
      "name": "Pourang Irani",
      "institution": "Department of Computer Science University of Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    }
  ],
  "references": [
    {
      "text": "Sunggeun Ahn, Jaeyeon Lee, Keunwoo Park, and Geehyuk Lee. 2018. Evaluation of edge-based interaction on a square smartwatch. International Journal of Human-Computer Studies 109 (2018), 68–78.",
      "doi": "10.1016/j.ijhcs.2017.08.004"
    },
    {
      "text": "Fereshteh Amini, Khalad Hasan, Andrea Bunt, and Pourang Irani. 2017. Data representations for in-situ exploration of health and fitness data. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare. 163–172.",
      "doi": "10.1145/3154862.3154879"
    },
    {
      "text": "Shaikh Shawon Arefin Shimon, Courtney Lutton, Zichun Xu, Sarah Morrison-Smith, Christina Boucher, and Jaime Ruiz. 2016. Exploring non-touchscreen gestures for smartwatches. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3822–3833.",
      "doi": "10.1145/2858036.2858385"
    },
    {
      "text": "Tanja Blascheck, Lonni Besançon, Anastasia Bezerianos, Bongshin Lee, and Petra Isenberg. 2018. Glanceable visualization: Studies of data comparison performance on smartwatches. IEEE transactions on visualization and computer graphics 25, 1(2018), 630–640.",
      "doi": "10.1109/TVCG.2018.2865142"
    },
    {
      "text": "Emeline Brulé, Gilles Bailly, Marcos Serrano, Marc Teyssier, and Samuel Huron. 2017. Investigating the design space of smartwatches combining physical rotary inputs. In Proceedings of the 29th Conference on l’Interaction Homme-Machine. 13–20.",
      "doi": "10.1145/3132129.3132139"
    },
    {
      "text": "Jaemin Chun, Anind Dey, Kyungtaek Lee, and SeungJun Kim. 2018. A qualitative study of smartwatch usage and its usability. Human Factors and Ergonomics in Manufacturing & Service Industries 28, 4(2018), 186–199.",
      "doi": ""
    },
    {
      "text": "Tak chung Fu, Fu lai Chung, Robert Luk, and Chak man Ng. 2007. Stock time series pattern matching: Template-based vs. rule-based approaches. Engineering Applications of Artificial Intelligence 20, 3(2007), 347 – 364. https://doi.org/10.1016/j.engappai.2006.07.003",
      "doi": "10.1016/j.engappai.2006.07.003"
    },
    {
      "text": "Frederick E Croxton and Harold Stein. 1932. Graphic comparisons by bars, squares, circles, and cubes. J. Amer. Statist. Assoc. 27, 177 (1932), 54–60.",
      "doi": ""
    },
    {
      "text": "Walter Crosby Eells. 1926. The relative merits of circles and bars for representing component parts. J. Amer. Statist. Assoc. 21, 154 (1926), 119–132.",
      "doi": ""
    },
    {
      "text": "Paolo Federico, Stephan Hoffmann, Alexander Rind, Wolfgang Aigner, and Silvia Miksch. 2014. Qualizon graphs: Space-efficient time-series visualization with qualitative abstractions. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces. 273–280.",
      "doi": "10.1145/2598153.2598172"
    },
    {
      "text": "Johannes Fuchs, Fabian Fischer, Florian Mansmann, Enrico Bertini, and Petra Isenberg. 2013. Evaluation of alternative glyph designs for time series data in a small multiple setting. In Proceedings of the SIGCHI conference on human factors in computing systems. 3237–3246.",
      "doi": "10.1145/2470654.2466443"
    },
    {
      "text": "Rúben Gouveia, Fábio Pereira, Evangelos Karapanos, Sean A Munson, and Marc Hassenzahl. 2016. Exploring the design space of glanceable feedback for physical activity trackers. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 144–155.",
      "doi": "10.1145/2971648.2971754"
    },
    {
      "text": "Garrett Grolemund and Hadley Wickham. 2015. Visualizing complex data with embedded plots. Journal of Computational and Graphical Statistics 24, 1(2015), 26–43.",
      "doi": ""
    },
    {
      "text": "Radim Halır and Jan Flusser. 1998. Numerically stable direct least squares fitting of ellipses. In Proc. 6th International Conference in Central Europe on Computer Graphics and Visualization. WSCG, Vol. 98. Citeseer, 125–132.",
      "doi": ""
    },
    {
      "text": "Teng Han, Khalad Hasan, Keisuke Nakamura, Randy Gomez, and Pourang Irani. 2017. Soundcraft: Enabling spatial interactions on smartwatches using hand generated acoustics. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. 579–591.",
      "doi": "10.1145/3126594.3126612"
    },
    {
      "text": "Teng Han, Jiannan Li, Khalad Hasan, Keisuke Nakamura, Randy Gomez, Ravin Balakrishnan, and Pourang Irani. 2018. PageFlip: Leveraging Page-Flipping Gestures for Efficient Command and Value Selection on Smartwatches. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174103"
    },
    {
      "text": "Ming C Hao, Umeshwar Dayal, Daniel A Keim, and Tobias Schreck. 2005. Importance-driven visualization layouts for large time series data. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005. IEEE, 203–210.",
      "doi": ""
    },
    {
      "text": "Ming C Hao, Manish Marwah, Halldór Janetzko, Umeshwar Dayal, Daniel A Keim, Debprakash Patnaik, Naren Ramakrishnan, and Ratnesh K Sharma. 2012. Visual exploration of frequent patterns in multivariate time series. Information Visualization 11, 1 (2012), 71–83.",
      "doi": "10.1177/1473871611430769"
    },
    {
      "text": "Kiyotaka Hara, Takeshi Umezawa, and Noritaka Osawa. 2015. Effect of button size and location when pointing with index finger on smartwatch. In International Conference on Human-Computer Interaction. Springer, 165–174.",
      "doi": ""
    },
    {
      "text": "Khalad Hasan, Xing-Dong Yang, Hai-Ning Liang, and Pourang Irani. 2012. How to position the cursor? an exploration of absolute and relative cursor positioning for back-of-device input. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services. 103–112.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI conference on human factors in computing systems. 203–212.",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Waqas Javed, Bryan McDonnel, and Niklas Elmqvist. 2010. Graphical perception of multiple time series. IEEE transactions on visualization and computer graphics 16, 6(2010), 927–934.",
      "doi": "10.1109/TVCG.2010.162"
    },
    {
      "text": "Amy K Karlson and Benjamin B Bederson. 2007. ThumbSpace: generalized one-handed input for touchscreen-based mobile devices. In IFIP Conference on Human-Computer Interaction. Springer, 324–338.",
      "doi": ""
    },
    {
      "text": "Eamonn Keogh, Harry Hochheiser, and Ben Shneiderman. 2002. An augmented visual query mechanism for finding patterns in time series data. In International Conference on Flexible Query Answering Systems. Springer, 240–250.",
      "doi": ""
    },
    {
      "text": "Frederic Kerber, Tobias Kiefer, Markus Löchtefeld, and Antonio Krüger. 2017. Investigating current techniques for opposite-hand smartwatch interaction. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–12.",
      "doi": "10.1145/3098279.3098542"
    },
    {
      "text": "Yuki Kubo, Buntarou Shizuki, and Jiro Tanaka. 2016. B2B-Swipe: Swipe gesture for rectangular smartwatches from a bezel to a bezel. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3852–3856.",
      "doi": "10.1145/2858036.2858216"
    },
    {
      "text": "Bongshin Lee, Catherine Plaisant, Cynthia Sims Parr, Jean-Daniel Fekete, and Nathalie Henry. 2006. Task taxonomy for graph visualization. In Proceedings of the 2006 AVI workshop on BEyond time and errors: novel evaluation methods for information visualization. 1–5.",
      "doi": "10.1145/1168149.1168168"
    },
    {
      "text": "Luis A Leiva, Alireza Sahami, Alejandro Catala, Niels Henze, and Albrecht Schmidt. 2015. Text entry on tiny qwerty soft keyboards. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 669–678.",
      "doi": "10.1145/2702123.2702388"
    },
    {
      "text": "Jessica Lin, Eamonn Keogh, and Stefano Lonardi. 2005. Visualizing and discovering non-trivial patterns in large time series databases. Information visualization 4, 2 (2005), 61–82.",
      "doi": ""
    },
    {
      "text": "Donald McMillan, Barry Brown, Airi Lampinen, Moira McGregor, Eve Hoggan, and Stefania Pizza. 2017. Situating wearables: Smartwatch use in context. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3582–3594.",
      "doi": "10.1145/3025453.3025993"
    },
    {
      "text": "Andrew Vande Moere and Helen Purchase. 2011. On the role of design in information visualization. Information Visualization 10, 4 (2011), 356–371.",
      "doi": "10.1177/1473871611415996"
    },
    {
      "text": "Ali Neshati, Yumiko Sakamoto, Launa C Leboe-McGowan, Jason Leboe-McGowan, Marcos Serrano, and Pourang Irani. 2019. G-Sparks: Glanceable Sparklines on Smartwatches.. In Graphics Interface. 23–1.",
      "doi": ""
    },
    {
      "text": "Alexander Ng, John Williamson, and Stephen Brewster. 2015. The effects of encumbrance and mobility on touch-based gesture interactions for mobile phones. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. 536–546.",
      "doi": "10.1145/2785830.2785853"
    },
    {
      "text": "Ian Oakley and Doyoung Lee. 2014. Interaction on the edge: offset sensing for small devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 169–178.",
      "doi": "10.1145/2556288.2557138"
    },
    {
      "text": "Ian Oakley, Carina Lindahl, Khanh Le, DoYoung Lee, and MD Rasel Islam. 2016. The flat finger: Exploring area touches on smartwatches. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4238–4249.",
      "doi": "10.1145/2858036.2858179"
    },
    {
      "text": "Keunwoo Park, Daehwa Kim, Seongkook Heo, and Geehyuk Lee. 2020. MagTouch: Robust Finger Identification for a Smartwatch Using a Magnet Ring and a Built-in Magnetometer. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376234",
      "doi": "10.1145/3313831.3376234"
    },
    {
      "text": "J Parnow. 2015. Micro visualizations: How can micro visualisations enhance text comprehension, memorability, and exploitation?Design MS Thesis, Potsdam Univ. Appl. Sci., Potsdam, Germany (2015).",
      "doi": ""
    },
    {
      "text": "Lewis V Peterson and Wilbur Schramm. 1954. How accurately are different kinds of graphs read?Audiovisual communication review 2, 3 (1954), 178–189.",
      "doi": ""
    },
    {
      "text": "Zablon Pingo and Bhuva Narayan. 2019. “My smartwatch told me to see a sleep doctor”: a study of activity tracker use. Online Information Review(2019).",
      "doi": ""
    },
    {
      "text": "Stefania Pizza, Barry Brown, Donald McMillan, and Airi Lampinen. 2016. Smartwatch in vivo. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 5456–5469.",
      "doi": "10.1145/2858036.2858522"
    },
    {
      "text": "Katrin Plaumann, Michael Müller, and Enrico Rukzio. 2016. CircularSelection: optimizing list selection for smartwatches. In Proceedings of the 2016 ACM International Symposium on Wearable Computers. 128–135.",
      "doi": "10.1145/2971763.2971766"
    },
    {
      "text": "Volker Roth and Thea Turner. 2009. Bezel swipe: conflict-free scrolling and multiple selection on mobile touch screen devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1523–1526.",
      "doi": "10.1145/1518701.1518933"
    },
    {
      "text": "Anne Roudaut, Stéphane Huot, and Eric Lecolinet. 2008. TapTap and MagStick: improving one-handed target acquisition on small touch-screens. In Proceedings of the working conference on Advanced visual interfaces. 146–153.",
      "doi": "10.1145/1385569.1385594"
    },
    {
      "text": "Léa Saviot, Frederik Brudy, and Steven Houben. 2017. WRISTBAND. IO: expanding input and output spaces of a Smartwatch. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 2025–2033.",
      "doi": "10.1145/3027063.3053132"
    },
    {
      "text": "Marcos Serrano, Eric Lecolinet, and Yves Guiard. 2013. Bezel-Tap gestures: quick activation of commands from sleep mode on tablets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3027–3036.",
      "doi": "10.1145/2470654.2481421"
    },
    {
      "text": "Tomoki Shibata, Daniel Afergan, Danielle Kong, Beste F Yuksel, I Scott MacKenzie, and Robert JK Jacob. 2016. DriftBoard: A panning-based text entry technique for ultra-small touchscreens. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 575–582.",
      "doi": "10.1145/2984511.2984591"
    },
    {
      "text": "Katie A Siek, Yvonne Rogers, and Kay H Connelly. 2005. Fat finger worries: how older and younger users physically interact with PDAs. In IFIP Conference on Human-Computer Interaction. Springer, 267–280.",
      "doi": "10.1007/11555261_24"
    },
    {
      "text": "Gaganpreet Singh, William Delamare, and Pourang Irani. 2018. D-SWIME: A design space for smartwatch interaction techniques supporting mobility and encumbrance. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174208"
    },
    {
      "text": "Srinath Sridhar, Anders Markussen, Antti Oulasvirta, Christian Theobalt, and Sebastian Boring. 2017. WatchSense: On-and above-skin input sensing through a wearable depth sensor. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3891–3902.",
      "doi": "10.1145/3025453.3026005"
    },
    {
      "text": "John Trimpop, Hannes Schenk, Gerald Bieber, Friedrich Lämmel, and Paul Burggraf. 2017. Smartwatch based respiratory rate and breathing pattern recognition in an end-consumer environment. In Proceedings of the 4th international Workshop on Sensor-based Activity Recognition and Interaction. 1–5.",
      "doi": "10.1145/3134230.3134235"
    },
    {
      "text": "Aku Visuri, Zhanna Sarsenbayeva, Niels van Berkel, Jorge Goncalves, Reza Rawassizadeh, Vassilis Kostakos, and Denzil Ferreira. 2017. Quantifying sources and types of smartwatch usage sessions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3569–3581.",
      "doi": "10.1145/3025453.3025817"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2010. Occlusion-aware interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 263–272.",
      "doi": "10.1145/1753326.1753365"
    },
    {
      "text": "Daniel Vogel and Patrick Baudisch. 2007. Shift: a technique for operating pen-based interfaces using touch. In Proceedings of the SIGCHI conference on Human factors in computing systems. 657–666.",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Daniel Vogel and Géry Casiez. 2012. Hand occlusion on a multi-touch tabletop. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2307–2316.",
      "doi": "10.1145/2207676.2208390"
    },
    {
      "text": "Daniel Vogel, Matthew Cudmore, Géry Casiez, Ravin Balakrishnan, and Liam Keliher. 2009. Hand occlusion with tablet-sized direct pen input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 557–566.",
      "doi": "10.1145/1518701.1518787"
    },
    {
      "text": "Bryan Wang and Tovi Grossman. 2020. BlyncSync: Enabling Multimodal Smartwatch Gestures with Synchronous Touch and Blink. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376132",
      "doi": "10.1145/3313831.3376132"
    },
    {
      "text": "Marc Weber, Marc Alexa, and Wolfgang Müller. 2001. Visualizing time-series on spirals.. In Infovis, Vol. 1. 7–14.",
      "doi": ""
    },
    {
      "text": "Pui Chung Wong, Kening Zhu, Xing-Dong Yang, and Hongbo Fu. 2020. Exploring Eyes-free Bezel-initiated Swipe on Round Smartwatches. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3313831.3376393"
    },
    {
      "text": "Haijun Xia, Tovi Grossman, and George Fitzmaurice. 2015. NanoStylus: Enhancing input on ultra-small displays with a finger-mounted stylus. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 447–456.",
      "doi": "10.1145/2807442.2807500"
    },
    {
      "text": "Robert Xiao, Teng Cao, Ning Guo, Jun Zhuo, Yang Zhang, and Chris Harrison. 2018. LumiWatch: On-arm projected graphics and touch input. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3173574.3173669"
    },
    {
      "text": "Hui-Shyong Yeo, Juyoung Lee, Andrea Bianchi, and Aaron Quigley. 2016. WatchMI: pressure touch, twist and pan gesture input on unmodified smartwatches. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. 394–399.",
      "doi": "10.1145/2935334.2935375"
    },
    {
      "text": "Xin Yi, Chun Yu, Weijie Xu, Xiaojun Bi, and Yuanchun Shi. 2017. Compass: Rotational keyboard on non-touch smartwatches. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 705–715.",
      "doi": "10.1145/3025453.3025454"
    },
    {
      "text": "Cheng Zhang, Junrui Yang, Caleb Southern, Thad E Starner, and Gregory D Abowd. 2016. WatchOut: extending interactions on a smartwatch with inertial sensing. In Proceedings of the 2016 ACM International Symposium on Wearable Computers. 136–143.",
      "doi": "10.1145/2971763.2971775"
    },
    {
      "text": "Junhan Zhou, Yang Zhang, Gierad Laput, and Chris Harrison. 2016. AuraSense: enabling expressive around-smartwatch interactions with electric field sensing. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 81–86.",
      "doi": "10.1145/2984511.2984568"
    }
  ]
}