{
  "doi": "10.1145/3411764.3445773",
  "title": "Understanding the Design Space of Embodied Passwords based on Muscle Memory",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Passwords have become a ubiquitous part of our everyday lives, needed for every web-service and system. However, it is challenging to create safe and diverse alphanumeric passwords, and to recall them, imposing a cognitive burden on the user. Through consecutive experiments, we explored the movement space, affordances and interaction, and memorability of a tangible, handheld, embodied password. In this context, we found that: (1) a movement space of 200 mm × 200 mm is preferred; (2) each context has a perceived level of safety, which—together with the affordances and link to familiarity—influences how the password is performed. Furthermore, the artefact’s dimensions should be balanced within the design itself, with the user, and the context, but there is a trade-off between the perceived safety and ergonomics; and (3) the designed embodied passwords can be recalled for at least a week, with participants creating unique passwords which were reproduced consistently.",
  "tags": [
    "Affordances",
    "Authentication",
    "Movement",
    "Useable security",
    "Embodied Interaction",
    "Explorative Research"
  ],
  "authors": [
    {
      "name": "Rosa van Koningsbruggen",
      "institution": "Human-Computer Interaction Bauhaus-Universität Weimar, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659697617",
      "orcid": "missing"
    },
    {
      "name": "Bart Hengeveld",
      "institution": "Industrial Design Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81324490289",
      "orcid": "missing"
    },
    {
      "name": "Jason Alexander",
      "institution": "Computer Science University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019697",
      "orcid": "0000-0001-6093-6116"
    }
  ],
  "references": [
    {
      "text": "Anne Adams and Martina Angela Sasse. 1999. Users are not the enemy. Commun. ACM 42, 12 (12 1999), 40–46. https://doi.org/10.1145/322796.322806",
      "doi": ""
    },
    {
      "text": "Jason Alexander, Anne Roudaut, Jürgen Steimle, Kasper Hornbæk, Miguel Bruns Alonso, Sean Follmer, and Timothy Merritt. 2018. Grand challenges in Shape-changing interface research. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2018-April. ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173873",
      "doi": "10.1145/3173574.3173873"
    },
    {
      "text": "Bander AlFayyadh, Per Thorsheim, Audun Jøsang, and Henning Klevjer. 2012. Improving Usability of Password Management with Standardized Password Policies. 7eme Conférence sur la ... 4 (2012), 48 – 42. https://www.researchgate.net/publication/262802201_Improving_Usability_of_Password_Management_with_Standardized_Password_Policieshttp://folk.uio.no/josang/papers/ATJK2012-SARSSI.pdf",
      "doi": ""
    },
    {
      "text": "Andrea Bianchi, Ian Oakley, and Dong Soo Kwon. 2010. The secure haptic keypad. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, New York, New York, USA, 1089. https://doi.org/10.1145/1753326.1753488",
      "doi": "10.1145/1753326.1753488"
    },
    {
      "text": "Andrea Bianchi, Ian Oakley, Jong Keun Lee, and Dong Soo Kwon. 2010. The haptic wheel. In Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems - CHI EA ’10. ACM Press, New York, New York, USA, 3625. https://doi.org/10.1145/1753846.1754029",
      "doi": "10.1145/1753846.1754029"
    },
    {
      "text": "Bourns and Inc. 2019. EAW-Absolute Contacting Encoder (ACE ™). , 6 pages. https://www.bourns.com/docs/product-datasheets/ace.pdf",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (1 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "V. Chislett and A. Chapman. 2005. VAK Learning Styles Self-Assessment Questionnaire. https://www.businessballs.com/self-awareness/vak-learning-styles/",
      "doi": ""
    },
    {
      "text": "Sangeeta Dey and A. Kapoor. 2015. Sex determination from hand dimensions for forensic identification. International Journal of Research in Medical Sciences 3, June, No 6(2015), 1466–1472. https://doi.org/10.18203/2320-6012.ijrms20150169",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2001. Where the Action Is The Foundations of Embodied Interaction. The MIT Press, Cambridge, MA. 248 pages. https://mitpress.mit.edu/books/where-action",
      "doi": ""
    },
    {
      "text": "Kenneth P. Fishkin, Anuj Gujar, Beverly L. Harrison, Thomas P. Moran, and Roy Want. 2000. Embodied user interfaces for really direct manipulation. Commun. ACM 43, 9 (9 2000), 74–80. https://doi.org/10.1145/348941.348998",
      "doi": ""
    },
    {
      "text": "Paul Fitts and Michael Posner. 1967. Human performance. Brooks/Cole Pub. Co., Belmont Calif. 162 pages.",
      "doi": ""
    },
    {
      "text": "Maiken Hillerup Fogtmann, Jonas Fritsch, and Karen Johanne Kortbek. 2008. Kinesthetic interaction. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction Designing for Habitus and Habitat - OZCHI ’08. ACM Press, New York, New York, USA, 89. https://doi.org/10.1145/1517744.1517770",
      "doi": "10.1145/1517744.1517770"
    },
    {
      "text": "Sondra Fraleigh and Maxine Sheets-Johnstone. 2002. The Primacy of Movement. Dance Research Journal 34, 1 (2002), 119. https://doi.org/10.2307/1478145",
      "doi": ""
    },
    {
      "text": "William W. Gaver. 1991. Technology affordances. In Proceedings of the SIGCHI conference on Human factors in computing systems Reaching through technology - CHI ’91. ACM Press, New York, New York, USA, 79–84. https://doi.org/10.1145/108844.108856",
      "doi": "10.1145/108844.108856"
    },
    {
      "text": "James J. Gibson. 1979. The Ecological Approach to Visual Perception. Psychology Press, New York. 346 pages.",
      "doi": ""
    },
    {
      "text": "Joseph Goldberg, Jennifer Hagman, and Vibha Sazawal. 2002. Doodling our way to better authentication. In CHI ’02 extended abstracts on Human factors in computer systems - CHI ’02. ACM Press, New York, New York, USA, 868. https://doi.org/10.1145/506621.506639",
      "doi": ""
    },
    {
      "text": "Paul A Grassi, James L Fenton, Elaine M Newton, Ray A Perlner, Andrew R Regenscheid, William E Burr, Justin P Richer, Naomi B Lefkovitz, Jamie M Danker, Yee-Yin Choong, Kristen K Greene, and Mary F Theofanos. 2017. Digital identity guidelines: authentication and lifecycle management. Technical Report. National Institute of Standards and Technology, Gaithersburg, MD. https://doi.org/10.6028/NIST.SP.800-63b",
      "doi": ""
    },
    {
      "text": "Rex Hartson. 2003. Cognitive, physical, sensory, and functional affordances in interaction design. Behaviour & Information Technology 22, 5 (9 2003), 315–338. https://doi.org/10.1080/01449290310001592587",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Michael Burmester, and Franz Koller. 2003. AttrakDiff: Ein Fragebogen zur Messung wahrgenommener hedonischer und pragmatischer Qualität. In Mensch & Computer. J.Ziegler & G. Szwillus (Eds.), Stuttgart, 187–196. https://doi.org/10.1007/978-3-322-80058-9_19",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body - Somaesthetic Interaction Design. The MIT Press, Cambridge, MA. 272 pages. https://mitpress.mit.edu/books/designing-body",
      "doi": ""
    },
    {
      "text": "Eva Hornecker and Jacob Buur. 2006. Getting a grip on tangible interaction. In Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI ’06. ACM Press, New York, New York, USA, 437. https://doi.org/10.1145/1124772.1124838",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Philip G. Inglesant and Martina Angela Sasse. 2010. The true cost of unusable password policies. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, New York, New York, USA, 383. https://doi.org/10.1145/1753326.1753384",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii, Dávid Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical atoms. Interactions 19, 1 (1 2012), 38–51. https://doi.org/10.1145/2065327.2065337",
      "doi": ""
    },
    {
      "text": "Anil K. Jain, Ruud Bolle, and Sharath Pankanti. 1999. Biometrics: Personal Identification in Networked Security. Kluwer Academic Publishers, Norwell. 411 pages. https://doi.org/10.1007/978-0-387-32659-7",
      "doi": ""
    },
    {
      "text": "Ian Jermyn, Alain Mayer, Fabian Monrose, Michael K. Reiter, and Aviel D. Rubin. 1999. The Design and Analysis of Graphical Passwords. In Proceedings of the 8th USENIX Security Symposium. The USENIX Association, Washington, D.C., 1. http://arxiv.org/abs/2009.01282",
      "doi": ""
    },
    {
      "text": "Avi Karni, Gundela Meyer, Christine Rey-Hipolito, Peter Jezzard, Michelle M. Adams, Robert Turner, and Leslie G. Ungerleider. 1998. The acquisition of skilled motor performance: Fast and slow experience-driven changes in primary motor cortex. Proceedings of the National Academy of Sciences 95, 3 (2 1998), 861–868. https://doi.org/10.1073/pnas.95.3.861",
      "doi": ""
    },
    {
      "text": "Sungshin Kim, Kenji Ogawa, Jinchi Lv, Nicolas Schweighofer, and Hiroshi Imamizu. 2015. Neural Substrates Related to Motor Memory with Multiple Timescales in Sensorimotor Adaptation. PLOS Biology 13, 12 (12 2015), e1002312. https://doi.org/10.1371/journal.pbio.1002312",
      "doi": ""
    },
    {
      "text": "Saranga Komanduri, Richard Shay, Patrick Gage Kelley, Michelle L. Mazurek, Lujo Bauer, Nicolas Christin, Lorrie Faith Cranor, and Serge Egelman. 2011. Of passwords and people: measuring the effect of password-composition policies. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11. ACM Press, New York, New York, USA, 2595. https://doi.org/10.1145/1978942.1979321",
      "doi": "10.1145/1978942.1979321"
    },
    {
      "text": "John W. Krakauer and Reza Shadmehr. 2006. Consolidation of motor memory. Trends in Neurosciences 29, 1 (1 2006), 58–64. https://doi.org/10.1016/j.tins.2005.10.003",
      "doi": ""
    },
    {
      "text": "Pierre Lévy and Bart Hengeveld. 2016. What matters for ritual visualization: towards a design tool for the description and the composition of rituals.. In Proceedings of Kansei Engineering and Emotion Research International Conference 2016. Japan Society of Kansei Engineering, University of Leeds, 14.",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and making strange. ACM Transactions on Computer-Human Interaction 20, 1 (3 2013), 1–25. https://doi.org/10.1145/2442106.2442113",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Yiqin Lu, Chun Yu, Xin Yi, Yuanchun Shi, and Shengdong Zhao. 2017. BlindType. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 2 (6 2017), 1–24. https://doi.org/10.1145/3090083",
      "doi": ""
    },
    {
      "text": "Sana Maqsood. 2014. Shoulder surfing susceptibility of bend passwords. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems. ACM, New York, NY, USA, 915–920. https://doi.org/10.1145/2559206.2579411",
      "doi": ""
    },
    {
      "text": "Sana Maqsood, Sonia Chiasson, and Audrey Girouard. 2016. Bend Passwords: using gestures to authenticate on flexible devices. Personal and Ubiquitous Computing 20, 4 (8 2016), 573–600. https://doi.org/10.1007/s00779-016-0928-6",
      "doi": ""
    },
    {
      "text": "Wendy Moncur and Grégory Leplâtre. 2007. Pictures at the ATM. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’07. ACM Press, New York, New York, USA, 887–894. https://doi.org/10.1145/1240624.1240758",
      "doi": "10.1145/1240624.1240758"
    },
    {
      "text": "Martez Mott, Thomas Donahue, G. Michael Poor, and Laura Leventhal. 2012. Leveraging motor learning for a tangible password system. In Proceedings of the 2012 ACM annual conference extended abstracts on Human Factors in Computing Systems Extended Abstracts - CHI EA ’12. ACM Press, New York, New York, USA, 2597. https://doi.org/10.1145/2212776.2223842",
      "doi": "10.1145/2212776.2223842"
    },
    {
      "text": "Salil Prabhakar, Sharath Pankanti, and Anil K. Jain. 2003. Biometric recognition: Security and privacy concerns. https://doi.org/10.1109/MSECP.2003.1193209",
      "doi": ""
    },
    {
      "text": "Philip R. Ross and Stephan A.G. Wensveen. 2010. Designing behavior in interaction: Using aesthetic experience as a mechanism for design. International Journal of Design 4, 2 (2010), 3–13.",
      "doi": ""
    },
    {
      "text": "Martina Angela Sasse, Sacha Brostoff, and D. Weirich. 2001. Transforming the ’weakest link’ - A human/computer interaction approach to usable and effective security. BT Technology Journal 19, 3 (7 2001), 122–131. https://doi.org/10.1023/A:1011902718709",
      "doi": "10.1023/A%3A1011902718709"
    },
    {
      "text": "Reza Shadmehr and Thomas Brashers-Krug. 1997. Functional Stages in the Formation of Human Long-Term Motor Memory. The Journal of Neuroscience 17, 1 (1 1997), 409–419. https://doi.org/10.1523/JNEUROSCI.17-01-00409.1997",
      "doi": ""
    },
    {
      "text": "Orit Shaer. 2009. Tangible User Interfaces: Past, Present, and Future Directions. Foundations and Trends® in Human–Computer Interaction 3, 1-2(2009), 1–137. https://doi.org/10.1561/1100000026",
      "doi": ""
    },
    {
      "text": "Elizabeth Stobert. 2010. Usability and strength in click-based graphical passwords. In Proceedings of the 28th of the international conference extended abstracts on Human factors in computing systems - CHI EA ’10. ACM Press, New York, New York, USA, 4303. https://doi.org/10.1145/1753846.1754144",
      "doi": "10.1145/1753846.1754144"
    },
    {
      "text": "David Sweatt. 2010. Mechanisms of Memory. Elsevier, London, UK. 1–23 pages. https://doi.org/10.1016/C2009-0-03605-8",
      "doi": ""
    },
    {
      "text": "Anke van Oosterhout and Eve Hoggan. 2020. Reshaping Interaction with Rotary Knobs. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, New York, NY, USA, 1973–1982. https://doi.org/10.1145/3357236.3395536",
      "doi": "10.1145/3357236.3395536"
    },
    {
      "text": "Anke van Oosterhout, Majken Kirkegård Rasmussen, Eve Hoggan, and Miguel Bruns. 2018. Knobology 2.0. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings. ACM, New York, NY, USA, 197–199. https://doi.org/10.1145/3266037.3271649",
      "doi": "10.1145/3266037.3271649"
    },
    {
      "text": "David Watson, Lee Anna Clark, and Auke Tellegen. 1988. Development and Validation of Brief Measures of Positive and Negative Affect: The PANAS Scales. Journal of Personality and Social Psychology 54, 6(1988), 1063–1070. https://doi.org/10.1037/0022-3514.54.6.1063",
      "doi": ""
    },
    {
      "text": "Stephan A.G. Wensveen. 2005. A tangibility approach to affective interaction. Ph.D. Dissertation. Technische Universiteit Delft.",
      "doi": ""
    },
    {
      "text": "Susan Wiedenbeck, Jim Waters, Jean-Camille Birget, Alex Brodskiy, and Nasir Memon. 2005. PassPoints: Design and longitudinal evaluation of a graphical password system. International Journal of Human-Computer Studies 63, 1-2 (7 2005), 102–127. https://doi.org/10.1016/j.ijhcs.2005.04.010",
      "doi": "10.1016/j.ijhcs.2005.04.010"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’07. ACM Press, New York, New York, USA, 493–502. https://doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}