{
  "doi": "10.1145/3411764.3445586",
  "title": "Interaction Illustration Taxonomy: Classification of Styles and Techniques for Visually Representing Interaction Scenarios",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-22",
  "year": 2021,
  "badges": [],
  "abstract": "Static illustrations are ubiquitous means to represent interaction scenarios. Across papers and reports, these visuals demonstrate people’s use of devices, explain systems, or show design spaces. Creating such figures is challenging, and very little is known about the overarching strategies for visually representing interaction scenarios. To mitigate this task, we contribute a unified taxonomy of design elements that compose such figures. In particular, we provide a detailed classification of Structural and Interaction strategies, such as composition, visual techniques, dynamics, representation of users, and many others – all in context of the type of scenarios. This taxonomy can inform researchers’ choices when creating new figures, by providing a concise synthesis of visual strategies, and revealing approaches they were not aware of before. Furthermore, to support the community for creating further taxonomies, we also provide three open-source software facilitating the coding process and visual exploration of the coding scheme.",
  "authors": [
    {
      "name": "Axel Antoine",
      "institution": "Univ. Lille, CNRS, Inria, Centrale Lille, UMR 9189 CRIStAL - Lille, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659083851",
      "orcid": "missing"
    },
    {
      "name": "Sylvain Malacria",
      "institution": "Univ. Lille, Inria, CNRS, Centrale Lille, UMR 9189 CRIStAL - Lille, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414620309",
      "orcid": "0000-0002-5201-5875"
    },
    {
      "name": "Nicolai Marquardt",
      "institution": "University College London - London, UK",
      "img": "/do/10.1145/contrib-81324491951/rel-imgonly/portraitnic3.jpg",
      "acmid": "81324491951",
      "orcid": "0000-0002-5473-2448"
    },
    {
      "name": "Géry Casiez",
      "institution": "Univ. Lille, CNRS, Inria, Centrale Lille, UMR 9189 CRIStAL - Lille, France",
      "img": "/do/10.1145/contrib-81100168597/rel-imgonly/gerycasieznewlowres.png",
      "acmid": "81100168597",
      "orcid": "0000-0003-1905-815X"
    }
  ],
  "references": [
    {
      "text": "Maneesh Agrawala, Doantam Phan, Julie Heiser, John Haymaker, Jeff Klingner, Pat Hanrahan, and Barbara Tversky. 2003. Designing Effective Step-by-Step Assembly Instructions. In ACM SIGGRAPH 2003 Papers (San Diego, California) (SIGGRAPH ’03). Association for Computing Machinery, New York, NY, USA, 828–837. https://doi.org/10.1145/1201775.882352",
      "doi": ""
    },
    {
      "text": "Emre Aksan, Fabrizio Pece, and Otmar Hilliges. 2018. DeepWriting. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173779",
      "doi": ""
    },
    {
      "text": "Fouad Alallah, Ali Neshati, Nima Sheibani, Yumiko Sakamoto, Andrea Bunt, Pourang Irani, and Khalad Hasan. 2018. Crowdsourcing vs Laboratory-Style Social Acceptability Studies?. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173884",
      "doi": "10.1145/3173574.3173884"
    },
    {
      "text": "Axel Antoine, Sylvain Malacria, Nicolai Marquardt, and Géry Casiez. 2019. Esquisse: Using 3D Models Staging to Facilitate the Creation of Vector-Based Trace Figures. In Human-Computer Interaction – INTERACT 2019, David Lamas, Fernando Loizides, Lennart Nacke, Helen Petrie, Marco Winckler, and Panayiotis Zaphiris (Eds.). Springer International Publishing, Cham, 496–516.",
      "doi": ""
    },
    {
      "text": "Mary Bellis. 2019. The Rules for Patents Drawings. Retrieved May 25th, 2020 from https://www.thoughtco.com/rules-for-patent-drawings-1992228",
      "doi": ""
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta, Kasper Hornbæk, and Sebastian Boring. 2018. It's a Wrap. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174138",
      "doi": "10.1145/3173574.3174138"
    },
    {
      "text": "Jacques Bertin. 1983. Semiology of graphics; diagrams networks maps. Technical Report.",
      "doi": ""
    },
    {
      "text": "James C. Bezdek, Robert Ehrlich, and William Full. 1984. FCM: The fuzzy c-means clustering algorithm. Computers and Geosciences 10, 2 (1984), 191 – 203. https://doi.org/10.1016/0098-3004(84)90020-7",
      "doi": ""
    },
    {
      "text": "M. Bostock, V. Ogievetsky, and J. Heer. 2011. D³ Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12(2011), 2301–2309.",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Michael Brock, Aaron Quigley, and Per Ola Kristensson. 2018. Change Blindness in Proximity-Aware Mobile Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3173574.3173617",
      "doi": "10.1145/3173574.3173617"
    },
    {
      "text": "Frederik Brudy, Joshua Kevin Budiman, Steven Houben, and Nicolai Marquardt. 2018. Investigating the Role of an Overview Device in Multi-Device Collaboration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173874",
      "doi": "10.1145/3173574.3173874"
    },
    {
      "text": "Simon Butscher, Sebastian Hubenschmid, Jens Müller, Johannes Fuchs, and Harald Reiterer. 2018. Clusters, Trends, and Outliers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173664",
      "doi": "10.1145/3173574.3173664"
    },
    {
      "text": "David C. Buuck. 2013. Providing tactile output and interaction. https://patentimages.storage.googleapis.com/af/b0/b3/241c27d8e77d55/US8593420.pdf US Patent 8,593,420 B1.",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2007. Sketching User Experiences: Getting the Design Right and the Right Design. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Sheelagh Carpendale. 2003. Considering Visual Variables as a Basis for Information Visualisation. Technical Report. University of Calgary. https://doi.org/10.11575/PRISM/30495",
      "doi": ""
    },
    {
      "text": "Hong-Yu Chang, Wen-Jie Tseng, Chia-En Tsai, Hsin-Yu Chen, Roshan Lalintha Peiris, and Liwei Chan. 2018. FacePush. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242588",
      "doi": ""
    },
    {
      "text": "Xiang 'Anthony' Chen, Ye Tao, Guanyun Wang, Runchang Kang, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2018. Forte. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174070",
      "doi": ""
    },
    {
      "text": "Pei-Yu Chi. 2016. Designing Video-Based Interactive Instructions. Ph.D. Dissertation. University of California, Berkeley.",
      "doi": ""
    },
    {
      "text": "Pei-Yu (Peggy) Chi, Daniel Vogel, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2016. Authoring Illustrations of Human Movements by Iterative Physical Demonstration. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(Tokyo, Japan) (UIST ’16). ACM, New York, NY, USA, 809–820. https://doi.org/10.1145/2984511.2984559",
      "doi": ""
    },
    {
      "text": "Pei-Yu (Peggy) Chi, Daniel Vogel, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2016. Authoring Illustrations of Human Movements by Iterative Physical Demonstration. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 809–820. https://doi.org/10.1145/2984511.2984559",
      "doi": ""
    },
    {
      "text": "Christian Corsten, Simon Voelker, Andreas Link, and Jan Borchers. 2018. Use the Force Picker, Luke. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174235",
      "doi": ""
    },
    {
      "text": "James E Cutting. 2002. Representing Motion in a Static Image: Constraints and Parallels in Art, Science, and Popular Culture. Perception 31, 10 (2002), 1165–1193. https://doi.org/10.1068/p3318 PMID: 12430945.",
      "doi": ""
    },
    {
      "text": "Alix Ducros, Clemens N. Klokmose, and Aurélien Tabard. 2019. Situated Sketching and Enactment for Pervasive Displays. In Proceedings of the 2019 ACM International Conference on Interactive Surfaces and Spaces (Daejeon, Republic of Korea) (ISS ’19). Association for Computing Machinery, New York, NY, USA, 217–228. https://doi.org/10.1145/3343055.3359702",
      "doi": "10.1145/3343055.3359702"
    },
    {
      "text": "J. C. Dunn. 1973. A Fuzzy Relative of the ISODATA Process and Its Use in Detecting Compact Well-Separated Clusters. Journal of Cybernetics 3, 3 (1973), 32–57. https://doi.org/10.1080/01969727308546046 arXiv:https://doi.org/10.1080/01969727308546046",
      "doi": ""
    },
    {
      "text": "Elsevier. 2020. Graphical abstracts. Retrieved June 9th, 2020 from https://www.elsevier.com/authors/journal-authors/graphical-abstract",
      "doi": ""
    },
    {
      "text": "Joseph L. Fleiss. 1971. Measuring nominal scale agreement among many raters.Psychological Bulletin 76, 5 (1971), 378–382. https://doi.org/10.1037/h0031619 Place: US Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Malcolm Fleming. 1967. Classification and Analysis of Instructional Illustrations. AV Communication Review 15, 3 (1967), 246–258. http://www.jstor.org/stable/30217383",
      "doi": ""
    },
    {
      "text": "Euan Freeman, Julie Williamson, Sriram Subramanian, and Stephen Brewster. 2018. Point-and-Shake. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173592",
      "doi": ""
    },
    {
      "text": "Emmanouil Giannisakis, Gilles Bailly, Sylvain Malacria, and Fanny Chevalier. 2017. IconHK: Using Toolbar Button Icons to Communicate Keyboard Shortcuts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4715–4726. https://doi.org/10.1145/3025453.3025595",
      "doi": "10.1145/3025453.3025595"
    },
    {
      "text": "Alix Goguey, Sylvain Malacria, and Carl Gutwin. 2018. Improving Discoverability and Expert Performance in Force-Sensitive Text Selection for Touch Devices with Mode Gauges. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174051",
      "doi": "10.1145/3173574.3174051"
    },
    {
      "text": "Saul Greenberg, Sheelagh Carpendale, Nicolai Marquardt, and Bill Buxton. 2011. Sketching User Experiences: The Workbook(1st ed.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": "10.5555/2208198"
    },
    {
      "text": "Tovi Grossman, Fanny Chevalier, and Rubaiat Habib Kazi. 2015. Your Paper is Dead! Bringing Life to Research Articles with Animated Figures. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 461–475. https://doi.org/10.1145/2702613.2732501",
      "doi": "10.1145/2702613.2732501"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Harpreet Sareen, and Enrico Rukzio. 2018. FaceDisplay. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173628",
      "doi": ""
    },
    {
      "text": "Y.. Hansen. 2000. Visualization for Thinking, Planning, and Problem Solving. 193–220 pages. https://mediosavanzados.files.wordpress.com/2007/06/visualization-for-thinking.pdf",
      "doi": ""
    },
    {
      "text": "S. Haroz, R. Kosara, and S. L. Franconeri. 2016. The Connected Scatterplot for Presenting Paired Time Series. IEEE Transactions on Visualization and Computer Graphics 22, 9(2016), 2174–2186.",
      "doi": "10.1109/TVCG.2015.2502587"
    },
    {
      "text": "Kasper Hornbæk and Antti Oulasvirta. 2017. What Is Interaction?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 5040–5052. https://doi.org/10.1145/3025453.3025765",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "Jin Huang, Feng Tian, Xiangmin Fan, Xiaolong (Luke) Zhang, and Shumin Zhai. 2018. Understanding the Uncertainty in 1D Unidirectional Moving Target Selection. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173811",
      "doi": "10.1145/3173574.3173811"
    },
    {
      "text": "Jessica Hullman and Benjamin Bach. 2018. Picturing Science: Design Patterns in Graphical Abstracts. In International Conference on Theory and Application of Diagrams. Springer.",
      "doi": ""
    },
    {
      "text": "Ke Huo, Yuanzhi Cao, Sang Ho Yoon, Zhuangying Xu, Guiming Chen, and Karthik Ramani. 2018. Scenariot. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173793",
      "doi": ""
    },
    {
      "text": "Ke Huo, Tianyi Wang, Luis Paredes, Ana M. Villanueva, Yuanzhi Cao, and Karthik Ramani. 2018. SynchronizAR. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242595",
      "doi": ""
    },
    {
      "text": "Yunwoo Jeong, Han-Jong Kim, and Tek-Jin Nam. 2018. Mechanism Perfboard. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173985",
      "doi": ""
    },
    {
      "text": "Robert E. Kahn and John H. Cafarela. 1998. Unconstraned ponting interface for natural human interaction wth a display-based computer system. https://patentimages.storage.googleapis.com/e0/a6/26/bb6514edf9149e/US5793361.pdf US Patent 5,793,361.",
      "doi": ""
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, and George Fitzmaurice. 2014. Kitty: Sketching Dynamic and Interactive Illustrations. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 395–405. https://doi.org/10.1145/2642918.2647375",
      "doi": "10.1145/2642918.2647375"
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, Shengdong Zhao, and George Fitzmaurice. 2014. Draco: Bringing Life to Illustrations with Kinetic Textures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 351–360. https://doi.org/10.1145/2556288.2556987",
      "doi": "10.1145/2556288.2556987"
    },
    {
      "text": "Mohamed Khamis, Ludwig Trotter, Ville Mäkelä, Emanuel von Zezschwitz, Jens Le, Andreas Bulling, and Florian Alt. 2018. CueAuth. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (dec 2018), 1–22. https://doi.org/10.1145/3287052",
      "doi": "10.1145/3287052"
    },
    {
      "text": "Rushil Khurana, Karan Ahuja, Zac Yu, Jennifer Mankoff, Chris Harrison, and Mayank Goel. 2018. GymCam. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (dec 2018), 1–17. https://doi.org/10.1145/3287063",
      "doi": "10.1145/3287063"
    },
    {
      "text": "Thomas Kosch, Mariam Hassib, Paweł W. Woźniak, Daniel Buschek, and Florian Alt. 2018. Your Eyes Tell. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174010",
      "doi": "10.1145/3173574.3174010"
    },
    {
      "text": "Klaus Krippendorff. 1970. Estimating the Reliability, Systematic Error and Random Error of Interval Data. Educational and Psychological Measurement 30, 1 (1970), 61–70. https://doi.org/10.1177/001316447003000105 arXiv:https://doi.org/10.1177/001316447003000105",
      "doi": ""
    },
    {
      "text": "J. Richard Landis and Gary G. Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics 33, 1 (1977), 159–174. http://www.jstor.org/stable/2529310",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2010. Research Methods in Human-Computer Interaction. Wiley Publishing.",
      "doi": "10.5555/1841406"
    },
    {
      "text": "Huy Viet Le, Thomas Kosch, Patrick Bader, Sven Mayer, and Niels Henze. 2018. PalmTouch. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173934",
      "doi": ""
    },
    {
      "text": "Joon Hyub Lee, Sang-Gyun An, Yongkwan Kim, and Seok-Hyung Bae. 2018. Projective Windows. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173792",
      "doi": ""
    },
    {
      "text": "Rong-Hao Liang, Meng-Ju Hsieh, Jheng-You Ke, Jr-Ling Guo, and Bing-Yu Chen. 2018. RFIMatch. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242620",
      "doi": ""
    },
    {
      "text": "Hyunchul Lim, Jungmin Chung, Changhoon Oh, SoHyun Park, Joonhwan Lee, and Bongwon Suh. 2018. Touch+Finger. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242651",
      "doi": "10.1145/3242587.3242651"
    },
    {
      "text": "Wanyu Liu, Olivier Rioul, Joanna McGrenere, Wendy E. Mackay, and Michel Beaudouin-Lafon. 2018. BIGFile. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173959",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Sijing You, Alexandra Ion, and Patrick Baudisch. 2018. Adding Force Feedback to Mixed Reality Experiences and Games using Electrical Muscle Stimulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174020",
      "doi": "10.1145/3173574.3174020"
    },
    {
      "text": "Nicolai Marquardt, Frederik Brudy, Can Liu, Ben Bengler, and Christian Holz. 2018. SurfaceConstellations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173928",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Ken Hinckley, and Saul Greenberg. 2012. Cross-Device Interaction via Micro-Mobility and f-Formations. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 13–22. https://doi.org/10.1145/2380116.2380121",
      "doi": "10.1145/2380116.2380121"
    },
    {
      "text": "Patricia I. Cornelio Martinez, Emanuela Maggioni, Kasper Hornbæk, Marianna Obrist, and Sriram Subramanian. 2018. Beyond the Libet Clock. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174115",
      "doi": "10.1145/3173574.3174115"
    },
    {
      "text": "Sebastian Marwecki and Patrick Baudisch. 2018. Scenograph. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242648",
      "doi": ""
    },
    {
      "text": "Sebastian Marwecki, Maximilian Brehm, Lukas Wagner, Lung-Pan Cheng, Florian 'Floyd' Mueller, and Patrick Baudisch. 2018. VirtualSpace - Overloading Physical Space with Multiple Virtual Reality Users. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173815",
      "doi": "10.1145/3173574.3173815"
    },
    {
      "text": "Damien Masson, Sylvain Malacria, Edward Lank, and Géry Casiez. 2020. Chameleon: Bringing Interactivity to Static Digital Documents. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376559",
      "doi": "10.1145/3313831.3376559"
    },
    {
      "text": "Sven Mayer, Valentin Schwind, Robin Schweigert, and Niels Henze. 2018. The Effect of Offset Correction and Cursor on Mid-Air Pointing in Real and Virtual Environments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174227",
      "doi": "10.1145/3173574.3174227"
    },
    {
      "text": "Erin McAweeney, Haihua Zhang, and Michael Nebeling. 2018. User-Driven Design Principles for Gesture Representations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174121",
      "doi": "10.1145/3173574.3174121"
    },
    {
      "text": "Scott McCloud. 1993. Understanding Comics: The Invisible Art. Tundra Publishing Ltd.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 72 (Nov. 2019), 23 pages. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Fabrizio Pece, Juan Jose Zarate, Velko Vechev, Nadine Besse, Olexandr Gudozhnik, Herbert Shea, and Otmar Hilliges. 2017. MagTics: Flexible and Thin Form Factor Magnetic Actuators for Dynamic and Wearable Haptic Feedback. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 143–154. https://doi.org/10.1145/3126594.3126609",
      "doi": "10.1145/3126594.3126609"
    },
    {
      "text": "Eujin Pei, R.I. Campbell, and Mark Evans. 2011. A Taxonomic Classification of Visual Design Representations Used by Industrial Designers and Engineering Designers. The Design Journal 14(2011), 64–91. https://doi.org/10.2752/175630610X12877385838803",
      "doi": ""
    },
    {
      "text": "David Petrou. 2012. Head-mounted display that displays a visual representation of physical interaction with an input interface located outside of the field of view. https://patentimages.storage.googleapis.com/5a/23/22/d3db8fd8048482/US8217856.pdf US Patent 8,217,856 B1.",
      "doi": ""
    },
    {
      "text": "Henning Pohl and Kasper Hornbæk. 2018. ElectricItch. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242647",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev and Gaetano Roberto Aiello. 2015. Radar-based gesture-recognition through a wearable device. https://patentimages.storage.googleapis.com/77/69/61/d96948a8b469ba/US20150346820A1.pdf US Patent 2015/0346820A1.",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev and Shigeaki Maruyama. 2011. Apparatus and method for touch screen interaction based on tactile feedback and pressure measurement. https://patentimages.storage.googleapis.com/b4/7e/9f/37227d90b5fa6c/US7952566B2.pdf US Patent 7,952,566 B2.",
      "doi": ""
    },
    {
      "text": "Abbas Rafii. 2014. Two-dimensional method and system enabling three-dimiensional user interaction with a device. https://patentimages.storage.googleapis.com/4b/15/08/06d12780bfec5d/US8686943.pdf US Patent 8,686,943 B1.",
      "doi": ""
    },
    {
      "text": "Nimesha Ranasinghe, Adrian David Cheok, Owen Noel Newton Fernando, Hideaki Nii, and Gopalakrishnakone Ponnampalam. 2011. Electronic Taste Stimulation. In Proceedings of the 13th International Conference on Ubiquitous Computing (Beijing, China) (UbiComp ’11). Association for Computing Machinery, New York, NY, USA, 561–562. https://doi.org/10.1145/2030112.2030213",
      "doi": "10.1145/2030112.2030213"
    },
    {
      "text": "Nimesha Ranasinghe, Adrian David Cheok, and Ryohei Nakatsu. 2012. Taste/IP: The Sensation of Taste for Digital Communication. In Proceedings of the 14th ACM International Conference on Multimodal Interaction (Santa Monica, California, USA) (ICMI ’12). Association for Computing Machinery, New York, NY, USA, 409–416. https://doi.org/10.1145/2388676.2388768",
      "doi": "10.1145/2388676.2388768"
    },
    {
      "text": "Oliver Schneider, Jotaro Shigeyama, Robert Kovacs, Thijs Jan Roumen, Sebastian Marwecki, Nico Boeckhoff, Daniel Amadeus Gloeckner, Jonas Bounama, and Patrick Baudisch. 2018. DualPanto. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242604",
      "doi": ""
    },
    {
      "text": "Youngbo Aram Shim, Jaeyeon Lee, and Geehyuk Lee. 2018. Exploring Multimodal Watch-back Tactile Display using Wind and Vibration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173706",
      "doi": ""
    },
    {
      "text": "Nikos Sidiropoulos, Sina Hadi Sohi, Thomas Lin Pedersen, Bo Torben Porse, Ole Winther, Nicolas Rapin, and Frederik Otzen Bagger. 2018. SinaPlot: an enhanced chart for simple and truthful representation of single observations over multiple classes. Journal of Computational and Graphical Statistics 27, 3(2018), 673–676.",
      "doi": ""
    },
    {
      "text": "Alexa F. Siu, Eric J. Gonzalez, Shenli Yuan, Jason B. Ginsberg, and Sean Follmer. 2018. shapeShift. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173865",
      "doi": "10.1145/3173574.3173865"
    },
    {
      "text": "Kinga Skorupska, Manuel Nunez, Wieslaw Kopec, and Radoslaw Nielek. 2018. Older Adults and Crowdsourcing: Android TV App for Evaluating TEDx Subtitle Quality. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 159 (Nov. 2018), 23 pages. https://doi.org/10.1145/3274428",
      "doi": "10.1145/3274428"
    },
    {
      "text": "Brian A. Smith and Shree K. Nayar. 2018. The RAD. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174090",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Jun Kato, Mark D. Gross, and Tom Yeh. 2018. Reactile. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173773",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Junichi Yamaoka, Daniel Leithinger, Tom Yeh, Mark D. Gross, Yoshihiro Kawahara, and Yasuaki Kakehi. 2018. Dynablock. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242659",
      "doi": ""
    },
    {
      "text": "Shan-Yuan Teng, Tzu-Sheng Kuo, Chi Wang, Chi huan Chiang, Da-Yuan Huang, Liwei Chan, and Bing-Yu Chen. 2018. PuPoP. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242628",
      "doi": ""
    },
    {
      "text": "M. Tovey, S. Porter, and R. Newman. 2003. Sketching, concept development and automotive design. Design Studies 24, 2 (2003), 135 – 153. https://doi.org/10.1016/S0142-694X(02)00035-2",
      "doi": ""
    },
    {
      "text": "Daniel Trindade, André Rodrigues, Tiago Guerreiro, and Hugo Nicolau. 2018. Hybrid-Brailler. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173601",
      "doi": ""
    },
    {
      "text": "Erick Tseng, Daniel Johansson, Michael A. Cleron, and Indika C. Mendis. 2015. Long press interface interactions. https://patentimages.storage.googleapis.com/1a/34/db/59a5f539644bce/US8954887.pdf US Patent 8,954,887 B1.",
      "doi": ""
    },
    {
      "text": "USPTO. 2018. Drawings section. Retrieved May 25th, 2020 from https://www.uspto.gov/web/offices/pac/mpep/s1825.html",
      "doi": ""
    },
    {
      "text": "Claus O Wilke. 2019. Fundamentals of data visualization: a primer on making informative and compelling figures. O’Reilly Media.",
      "doi": ""
    },
    {
      "text": "Anusha Withana, Daniel Groeger, and Jürgen Steimle. 2018. Tacttoo. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242645",
      "doi": ""
    },
    {
      "text": "Pui Chung Wong, Kening Zhu, and Hongbo Fu. 2018. FingerT9. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173752",
      "doi": "10.1145/3173574.3173752"
    },
    {
      "text": "Yu-Chian Wu, Te-Yen Wu, Paul Taele, Bryan Wang, Jun-You Liu, Pin sung Ku, Po-En Lai, and Mike Y. Chen. 2018. ActiveErgo. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3174132",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Nathalie Henry Riche, Fanny Chevalier, Bruno De Araujo, and Daniel Wigdor. 2018. DataInk. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI '18. ACM Press. https://doi.org/10.1145/3173574.3173797",
      "doi": ""
    },
    {
      "text": "Keng-Ta Yang, Chiu-Hsuan Wang, and Liwei Chan. 2018. ShareSpace. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242630",
      "doi": ""
    },
    {
      "text": "Jingjie Zheng, Blaine Lewis, Jeff Avery, and Daniel Vogel. 2018. FingerArc and FingerChord. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST '18. ACM Press. https://doi.org/10.1145/3242587.3242589",
      "doi": ""
    }
  ]
}