{
  "doi": "10.1145/3411764.3445410",
  "title": "“Can I Not Be Suicidal on a Sunday?”: Understanding Technology-Mediated Pathways to Mental Health Support",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Individuals in distress adopt varied pathways in pursuit of care that aligns with their individual needs. Prior work has established that the first resource an individual leverages can influence later care and recovery, but less is understood about how the design of a point of care might interact with subsequent pathways to care. We investigate how the design of the Indian mental health helpline system interacts with complex sociocultural factors to marginalize caller needs. We draw on interviews with 18 helpline stakeholders, including individuals who have engaged with helplines in the past, shedding light on how they navigate both technological and structural barriers in pursuit of relief. Finally, we use a design justice framework rooted in Amartya Sen’s conceptualization of realization-focused justice to discuss implications and present recommendations towards the design of technology-mediated points of mental health support.",
  "tags": [
    "Social Justice",
    "Technology-Mediated Mental Health Support",
    "India",
    "Mental Health",
    "Realization-Focused Justice",
    "Pathways to Care"
  ],
  "authors": [
    {
      "name": "Sachin R Pendse",
      "institution": "School of Interactive Computing Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366119",
      "orcid": "missing"
    },
    {
      "name": "Amit Sharma",
      "institution": "Microsoft Research India, India",
      "img": "/do/10.1145/contrib-60000000084/rel-imgonly/amitsharma_photo.jpg",
      "acmid": "60000000084",
      "orcid": "missing"
    },
    {
      "name": "Aditya Vashistha",
      "institution": "Cornell University, United States",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    },
    {
      "name": "Munmun De Choudhury",
      "institution": "School of Interactive Computing Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343491309",
      "orcid": "0000-0002-8939-264X"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. FCC 12-149: Facilitating the Deployment of Text-to-911 and Other Next Generation 911 Applications.",
      "doi": ""
    },
    {
      "text": "[2] Aasra.2020. (2020). http://www.aasra.info/helpline.html",
      "doi": ""
    },
    {
      "text": "Gregory Armstrong, Michelle Kermode, Shoba Raja, Sujatha Suja, Prabha Chandra, and Anthony F Jorm. 2011. A mental health training program for community health workers in India: impact on knowledge and attitudes. International journal of mental health systems 5, 1 (2011), 17.",
      "doi": ""
    },
    {
      "text": "Mariam Asad. 2019. Prefigurative design as a method for research justice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–18.",
      "doi": "10.1145/3359302"
    },
    {
      "text": "[5] The Banyan.2020. (2020). https://thebanyan.org/",
      "doi": ""
    },
    {
      "text": "Ho Bao, Scott A Henning, Christopher E Pearce, and James David Williams. 2011. System and method for routing calls. US Patent 7,974,277.",
      "doi": ""
    },
    {
      "text": "Susan Beaton, Peter Forster, and Myfanwy Maple. 2013. Suicide and language: Why we shouldn’t use the’C’word. InPsych (2013).",
      "doi": ""
    },
    {
      "text": "Robinder P Bedi, Pavithra A Thomas, Damanjit Sandhu, and Sachin Jain. 2020. Survey of counselling psychologists in India. Counselling Psychology Quarterly 33, 1 (2020), 100–120.",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett, Daniela K Rosner, and Alex S Taylor. 2020. The care work of access. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376568"
    },
    {
      "text": "RagHurama Bhat, Mukul Jain, and Joseph F Khouri. 2011. Dynamic callbacks from a contact center. US Patent App. 12/580,716.",
      "doi": ""
    },
    {
      "text": "Kamaldeep Bhui and Dinesh Bhugra. 2002. Mental illness in Black and Asian ethnic minorities: Pathways to care and outcomes. Advances in Psychiatric Treatment 8, 1 (2002), 26–33.",
      "doi": ""
    },
    {
      "text": "Patrick Biernacki and Dan Waldorf. 1981. Snowball sampling: Problems and techniques of chain referral sampling. Sociological methods & research 10, 2 (1981), 141–163.",
      "doi": ""
    },
    {
      "text": "Michael L Birnbaum, Asra F Rizvi, Keren Faber, Jean Addington, Christoph U Correll, Carla Gerber, Adrienne C Lahti, Rachel L Loewy, Daniel H Mathalon, Leigh Anne Nelson, 2018. Digital trajectories to care in first-episode psychosis. Psychiatric Services 69, 12 (2018), 1259–1263.",
      "doi": ""
    },
    {
      "text": "Jonathan K Burns and Andrew Tomita. 2015. Traditional and religious healers in the pathway to care for people with mental disorders in Africa: a systematic review and meta-analysis. Social psychiatry and psychiatric epidemiology 50, 6(2015), 867–877.",
      "doi": ""
    },
    {
      "text": "Chee-Hon Chan, Ho-Kit Wong, and Paul Siu-Fai Yip. 2018. Exploring the use of telephone helpline pertaining to older adult suicide prevention: A Hong Kong experience. Journal of affective disorders 236 (2018), 75–79.",
      "doi": ""
    },
    {
      "text": "Prabha S Chandra, Padmavathy Doraiswamy, Anuroopa Padmanabh, and Mariamma Philip. 2014. Do newspaper reports of suicides comply with standard suicide reporting guidelines? A study from Bangalore, India. International journal of social psychiatry 60, 7 (2014), 687–694.",
      "doi": ""
    },
    {
      "text": "Qijin Cheng and Elad Yom-Tov. 2019. Do search engine helpline notices aid in preventing suicide? Analysis of archival data. Journal of medical internet research 21, 3 (2019), e12235.",
      "doi": ""
    },
    {
      "text": "James CS Chiang, Alex SY Chow, Raymond CK Chan, CW Law, and Eric YH Chen. 2005. Pathway to care for patients with first-episode psychosis in Hong Kong. Hong Kong Journal of Psychiatry 15, 1 (2005), 18–23.",
      "doi": ""
    },
    {
      "text": "Kirstyn Yuk Sim Chun and Anneliese A Singh. 2010. The bisexual youth of color intersecting identities development model: A contextual approach to understanding multiple marginalization experiences. Journal of Bisexuality 10, 4 (2010), 429–451.",
      "doi": ""
    },
    {
      "text": "Alex Cohen, Vikram Patel, and Harry Minas. 2014. A brief history of global mental health. Global mental health: Principles and practice (2014), 3–26.",
      "doi": ""
    },
    {
      "text": "Eleanor Cole, Gerard Leavey, Michael King, Eric Johnson-Sabine, and Amanda Hoar. 1995. Pathways to care for patients with a first episode of psychosis: a comparison of ethnic groups. The British Journal of Psychiatry 167, 6 (1995), 770–776.",
      "doi": ""
    },
    {
      "text": "Patricia Hill Collins. 1990. Black feminist thought in the matrix of domination. Black feminist thought: Knowledge, consciousness, and the politics of empowerment 138(1990), 221–238.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design justice: Community-led practices to build the worlds we need. MIT Press.",
      "doi": ""
    },
    {
      "text": "Catherine M Coveney, Kristian Pollock, Sarah Armstrong, and John Moore. 2012. Callers’ experiences of contacting a national suicide prevention helpline. Crisis (2012).",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 1990. Mapping the margins: Intersectionality, identity politics, and violence against women of color. Stan. L. Rev. 43(1990), 1241.",
      "doi": ""
    },
    {
      "text": "[26] The Blue Dawn.2020. (2020). https://twitter.com/thebluedawn56",
      "doi": ""
    },
    {
      "text": "Vladimir N Deryugin, Dimitriy A Torba, and Igor Neyman. 1999. Method for routing calls to call centers based on statistical modeling of call behavior. US Patent 5,926,538.",
      "doi": ""
    },
    {
      "text": "Amit Dias, Fredric Azariah, Stewart J Anderson, Miriam Sequeira, Alex Cohen, Jennifer Q Morse, Pim Cuijpers, Vikram Patel, and Charles F Reynolds. 2019. Effect of a lay counselor intervention on prevention of major depression in older adults living in low-and middle-income countries: a randomized clinical trial. JAMA psychiatry 76, 1 (2019), 13–20.",
      "doi": ""
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social justice-oriented interaction design: Outlining key design strategies and commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 656–671.",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Claire Burke Draucker, Donna S Martsolf, and Candice Poole. 2009. Developing distress protocols for research on sensitive topics. Archives of psychiatric nursing 23, 5 (2009), 343–350.",
      "doi": ""
    },
    {
      "text": "Richard M Duffy and Brendan D Kelly. 2020. India’s Rights of Persons with Disabilities Act, 2016. In India’s Mental Healthcare Act, 2017. Springer, 61–80.",
      "doi": ""
    },
    {
      "text": "S Faizan, BN Raveesh, LS Ravindra, and K Sharath. 2012. Pathways to psychiatric care in South India and their socio-demographic and attitudinal correlates. In BMC proceedings, Vol. 6. BioMed Central, 1–1.",
      "doi": ""
    },
    {
      "text": "Stephanie S Felder, Jamie Seligman, Cicely K Burrows-McElwain, Maryann E Robinson, and Erik Hierholzer. 2014. Disaster trauma: federal resources that help communities on their road to recovery. Disaster medicine and public health preparedness 8, 2(2014), 174–178.",
      "doi": ""
    },
    {
      "text": "Raymond Fink, Sam Shapiro, and Sidney S Goldensohn. 1970. Family physician referrals for psychiatric consultation and patient initiative in seeking care. Social Science & Medicine (1967) 4, 3 (1970), 273–291.",
      "doi": ""
    },
    {
      "text": "[35] The Live Love Laugh Foundation.2020. (2020). https://www.thelivelovelaughfoundation.org/helpline.html",
      "doi": ""
    },
    {
      "text": "Myfanwy Franks and Ros Medforth. 2005. Young helpline callers and difference: exploring gender, ethnicity and sexuality in helpline access and provision. Child & Family Social Work 10, 1 (2005), 77–85.",
      "doi": ""
    },
    {
      "text": "Robert Eric Frykenberg. 2008. Avarna and Adivasi Christians and Missions: a paradigm for understanding Christian movements in India. International bulletin of missionary research 32, 1 (2008), 14–20.",
      "doi": ""
    },
    {
      "text": "Padma R Gargeya, Charles M White, and Stuart Dufour. 2004. System and method for implementing wait time estimation in automatic call distribution queues. US Patent 6,714,643.",
      "doi": ""
    },
    {
      "text": "R Gater, Almeida E Sousa, B De, G Barrientos, J Caraveo, CR Chandrashekar, M Dhadphale, D Goldberg, AH Al Kathiri, M Mubbashar, 1991. The pathways to psychiatric care: a cross-cultural study. Psychological medicine 21, 3 (1991), 761–774.",
      "doi": ""
    },
    {
      "text": "David Goldberg and Peter Huxley. 1980. Mental health in the community: The pathways to psychiatric care. London (UK): Tavistock Publications(1980).",
      "doi": ""
    },
    {
      "text": "Philip Henson, Hannah Wisniewski, Chris Hollis, Matcheri Keshavan, and John Torous. 2019. Digital mental health apps and the therapeutic alliance: initial review. BJPsych Open 5, 1 (2019).",
      "doi": ""
    },
    {
      "text": "Peter E Hodgkinson and Michael Stewart. 1991. Coping with catastrophe: A handbook of disaster management.Taylor & Frances/Routledge.",
      "doi": ""
    },
    {
      "text": "Melanie A Hom, Brian W Bauer, Ian H Stanley, Joseph W Boffa, Dese’Rae L Stage, Daniel W Capron, Norman B Schmidt, and Thomas E Joiner. 2020. Suicide attempt survivors’ recommendations for improving mental health treatment for attempt survivors.Psychological services(2020).",
      "doi": ""
    },
    {
      "text": "Anna Huguet, Sanjay Rao, Patrick J McGrath, Lori Wozney, Mike Wheaton, Jill Conrod, and Sharlene Rozario. 2016. A systematic review of cognitive behavioral therapy and behavioral activation apps for depression. PloS one 11, 5 (2016), e0154248.",
      "doi": ""
    },
    {
      "text": "Peter Huxley. 1996. Mental illness in the community: the Goldberg-Huxley model of the pathway to psychiatric care. Nordic Journal of Psychiatry 50, sup37 (1996), 47–53.",
      "doi": ""
    },
    {
      "text": "[46] iCALL.2020. (2020). http://icallhelpline.org/",
      "doi": ""
    },
    {
      "text": "Yeshim Iqbal, Rubina Jahan, and Muhtasabbib Rumman Matin. 2019. Descriptive characteristics of callers to an emotional support and suicide prevention helpline in Bangladesh (first five years). Asian journal of psychiatry 45 (2019), 63–65.",
      "doi": ""
    },
    {
      "text": "Jemimah A Johnson, Janhavi Devdutt, Seema Mehrotra, Poornima Bhola, Paulomi Sudhir, and Amit Sharma. 2020. Barriers to Professional Help-seeking for Distress and Potential Utility of a Mental Health App Components: Stakeholder Perspectives. Cureus 12, 2 (2020).",
      "doi": ""
    },
    {
      "text": "Ravindra Lai Kapur. 1946. The story of community mental health in India. Mental health: An Indian perspective 2003 (1946), 92–100.",
      "doi": ""
    },
    {
      "text": "Ravi L Kapur. 1979. The role of traditional healers in mental health care in rural India. Social Science & Medicine. Part B: Medical Anthropology 13, 1(1979), 27–31.",
      "doi": ""
    },
    {
      "text": "Sarbjeet Khurana and Shweta Sharma. 2016. National mental health program of India: a review of the history and the current scenario. Int J Community Med Public Health 3 (2016), 2696–2704.",
      "doi": ""
    },
    {
      "text": "Arthur Kleinman. 1978. Concepts and a model for the comparison of medical systems as cultural systems. Social Science & Medicine. Part B: Medical Anthropology 12 (1978), 85–93.",
      "doi": ""
    },
    {
      "text": "K Krishnamurthy, D Venugopal, and AK Alimchandani. 2000. Mental hospitals in India. Indian journal of psychiatry 42, 2 (2000), 125.",
      "doi": ""
    },
    {
      "text": "Anant Kumar. 2004. History of mental health services in India. Journal of Personality and Clinical Studies 20, 1-2 (2004).",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Nassim Jafarinaimi, and Mehrab Bin Morshed. 2018. Uber in Bangladesh: The Tangled Web of mobility and justice. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–21.",
      "doi": "10.1145/3274367"
    },
    {
      "text": "Chandrakant Lahariya, Shyam Singhal, Sumeet Gupta, and Ashok Mishra. 2010. Pathway of care among psychiatric patients attending a mental health institution in central India. Indian journal of psychiatry 52, 4 (2010), 333.",
      "doi": ""
    },
    {
      "text": "James D Livingston and Jennifer E Boyd. 2010. Correlates and consequences of internalized stigma for people living with mental illness: A systematic review and meta-analysis. Social science & medicine 71, 12 (2010), 2150–2161.",
      "doi": ""
    },
    {
      "text": "Hennie Lötter. 2011. Poverty, ethics and justice. University of Wales Press.",
      "doi": ""
    },
    {
      "text": "Kathleen MacDonald, Nina Fainman-Adelman, Kelly K Anderson, and Srividya N Iyer. 2018. Pathways to mental health services for young people: a systematic review. Social psychiatry and psychiatric epidemiology 53, 10(2018), 1005–1038.",
      "doi": ""
    },
    {
      "text": "Martin N Marshall. 1996. Sampling for qualitative research. Family practice 13, 6 (1996), 522–526.",
      "doi": ""
    },
    {
      "text": "Suresh Bada Math, Guru S Gowda, Vinay Basavaraju, Narayana Manjunatha, Channaveerachari Naveen Kumar, Arun Enara, Mahesh Gowda, and Jagadisha Thirthalli. 2019. Cost estimation for the implementation of the Mental Healthcare Act 2017. Indian Journal of Psychiatry 61, Suppl 4 (2019), S650.",
      "doi": ""
    },
    {
      "text": "Hendrika Meischke, Brooke Ike, Ian Painter, Devora Chavez, Mei Po Yip, Steven M Bradley, and Shin-Ping Tu. 2015. Delivering 9-1-1 CPR instructions to limited english proficient callers: a simulation experiment. Journal of immigrant and minority health 17, 4 (2015), 1049–1054.",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam and Robin S Grenier. 2019. Qualitative research in practice: Examples for discussion and analysis. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Brian L Mishara, François Chagnon, Marc Daigle, Bogdan Balan, Sylvaine Raymond, Isabelle Marcoux, Cécile Bardon, Julie K Campbell, and Alan Berman. 2007. Which helper behaviors and intervention styles are related to better short-term outcomes in telephone crisis intervention? Results from a silent monitoring study of calls to the US 1-800-SUICIDE network. Suicide and Life-Threatening Behavior 37, 3 (2007), 308–321.",
      "doi": ""
    },
    {
      "text": "Brian L Mishara and Marc Daigle. 2001. Helplines and crisis intervention services: Challenges for the future. Suicide prevention: Resources for the millennium (2001), 153–171.",
      "doi": ""
    },
    {
      "text": "Brian L Mishara and David N Weisstub. 2016. The legal status of suicide: A global review. International journal of law and psychiatry 44 (2016), 54–74.",
      "doi": ""
    },
    {
      "text": "Shubhangi Misra. 2020. Most suicide helplines are of little help as they don’t work when people need them. The Print (2020).",
      "doi": ""
    },
    {
      "text": "Pranav D Modi, Rajavi Solanki, Tripti S Nagdev, Pallavi D Yadav, Nyayosh K Bharucha, Ajay Desai, Paresh Navalkar, Sunil B Kelgane, and Deepak Langade. 2018. Public awareness of the emergency medical services in Maharashtra, India: A questionnaire-based survey. Cureus 10, 9 (2018).",
      "doi": ""
    },
    {
      "text": "Parimala Moodley and Rachel E Perkins. 1991. Routes to psychiatric inpatient care in an Inner London Borough. Social Psychiatry and Psychiatric Epidemiology 26, 1(1991), 47–51.",
      "doi": ""
    },
    {
      "text": "Craig Morgan, Rosemarie Mallett, Gerard Hutchinson, Hemant Bagalkote, Kevin Morgan, Paul Fearon, Paola Dazzan, Jane Boydell, Kwame McKenzie, Glynn Harrison, 2005. Pathways to care and ethnicity. 1: Sample characteristics and compulsory admission: Report from the AeSOP study. The British journal of psychiatry 186, 4 (2005), 281–289.",
      "doi": ""
    },
    {
      "text": "Craig Morgan, Rosemarie Mallett, Gerard Hutchinson, and Julian Leff. 2004. Negative pathways to psychiatric care and ethnicity: the bridge between social science and psychiatry. Social science & medicine 58, 4 (2004), 739–752.",
      "doi": ""
    },
    {
      "text": "Preeti Mudliar. 2020. Whither Humane-Computer Interaction? Adult and Child Value Conflicts in the Biometric Fingerprinting for Food. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376564"
    },
    {
      "text": "Robin J Munro. 2002. Political psychiatry in post-Mao China and its origins in the cultural revolution. Journal of the American Academy of Psychiatry and the Law Online 30, 1(2002), 97–106.",
      "doi": ""
    },
    {
      "text": "Vanessa Murphree, Bryan H Reber, and Frederick Blevens. 2009. Superhero, instructor, optimist: FEMA and the frames of disaster in Hurricanes Katrina and Rita. Journal of Public Relations Research 21, 3 (2009), 273–294.",
      "doi": ""
    },
    {
      "text": "James Y Nazroo, Kamaldeep S Bhui, and James Rhodes. 2020. Where next for understanding race/ethnic inequalities in severe mental illness? Structural, interpersonal and institutional racism. Sociology of Health & Illness 42, 2 (2020), 262–276.",
      "doi": ""
    },
    {
      "text": "Martha Neary and Stephen M Schueller. 2018. State of the field of mental health apps. Cognitive and Behavioral Practice 25, 4 (2018), 531–537.",
      "doi": ""
    },
    {
      "text": "H Blaise Nguendo-Yongsi. 2020. Access to health care in African cities: therapeutic pathways of city dwellers with mental health problems in Yaoundé–Cameroon. Cities & Health (2020), 1–10.",
      "doi": ""
    },
    {
      "text": "Mark Nichter. 1981. Idioms of distress: Alternatives in the expression of psychosocial distress: A case study from South India. Culture, medicine and psychiatry 5, 4 (1981), 379–408.",
      "doi": ""
    },
    {
      "text": "Devyani Nighoskar. 2018. 40 Unanswered Calls Show Us The Grim Reality Of Suicide Helplines In India. Homegrown (2018).",
      "doi": ""
    },
    {
      "text": "S Haque Nizamie and Nishant Goyal. 2010. History of psychiatry in India. Indian journal of psychiatry 52, Suppl1 (2010), S7.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2020. Coronavirus disease 2019 (COVID-19): situation report, 72. (2020).",
      "doi": ""
    },
    {
      "text": "Oladapo Oyebode, Felwah Alqahtani, and Rita Orji. 2020. Using machine learning and thematic analysis methods to evaluate mental health apps based on user reviews. IEEE Access 8(2020), 111141–111158.",
      "doi": ""
    },
    {
      "text": "Deepak Padmanabhan and Savitha Sam Abraham. 2020. Representativity Fairness in Clustering. In 12th ACM Conference on Web Science (Southampton, United Kingdom) (WebSci ’20). Association for Computing Machinery, New York, NY, USA, 202–211. https://doi.org/10.1145/3394231.3397910",
      "doi": ""
    },
    {
      "text": "R Padmavati. 2005. Community mental health care in India. International Review of Psychiatry 17, 2 (2005), 103–107.",
      "doi": ""
    },
    {
      "text": "SR Parkar, VS Dawani, JS Apte, 2001. History of psychiatry in India.Journal of postgraduate Medicine 47, 1 (2001), 73.",
      "doi": ""
    },
    {
      "text": "Sachin R Pendse, Naveena Karusala, Divya Siddarth, Pattie Gonsalves, Seema Mehrotra, John A Naslund, Mamta Sood, Neha Kumar, and Amit Sharma. 2019. Mental health in the global south: challenges and opportunities in HCI for development. In Proceedings of the 2nd ACM SIGCAS Conference on Computing and Sustainable Societies. 22–36.",
      "doi": "10.1145/3314344.3332483"
    },
    {
      "text": "Sachin R Pendse, Faisal M Lalani, Munmun De Choudhury, Amit Sharma, and Neha Kumar. 2020. ” Like Shock Absorbers”: Understanding the Human Infrastructures of Technology-Mediated Mental Health Support. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376465"
    },
    {
      "text": "L.L. Piepzna-Samarasinha and E. Dixon. 2020. Beyond Survival: Strategies and Stories from the Transformative Justice Movement. AK Press. https://books.google.com/books?id=t2iRDwAAQBAJ",
      "doi": ""
    },
    {
      "text": "Leah Lakshmi Piepzna-Samarasinha. 2018. Care work: Dreaming disability justice. arsenal pulp press.",
      "doi": ""
    },
    {
      "text": "Ministry of Statistics Press Information Bureau, Government of India and Programme Implementation. 2020. First Advance Estimates of National Income, 2019-20. (2020).",
      "doi": ""
    },
    {
      "text": "R Raguram, Mitchell G Weiss, Harshad Keval, and SM Channabasavanna. 2001. Cultural dimensions of clinical depression in Bangalore, India. Anthropology & Medicine 8, 1 (2001), 31–46.",
      "doi": ""
    },
    {
      "text": "Pallavi Rao. 2018. Caste and the LoSHA discourse. Communication Culture & Critique 11, 3 (2018), 494–497.",
      "doi": ""
    },
    {
      "text": "Sharadamba Rao. 1966. Caste and mental disorders in Bihar. American Journal of Psychiatry 122, 9 (1966), 1045–1055.",
      "doi": ""
    },
    {
      "text": "John Rawls. 1971. A theory of justice. Harvard university press.",
      "doi": ""
    },
    {
      "text": "Patricia R Recupero. 2020. Social Media and the Internet. The American Psychiatric Association Publishing Textbook of Suicide Risk Assessment and Management(2020), 321.",
      "doi": ""
    },
    {
      "text": "Bernadette Richardson. 2012. Wireless emergency routing on empirical data: shaving time saves lives. International Journal of Emergency Services(2012).",
      "doi": ""
    },
    {
      "text": "Lionel P Robert, Casey Pierce, Liz Marquis, Sangmi Kim, and Rasha Alahmad. 2020. Designing fair AI for managing employees in organizations: a review, critique, and design agenda. Human–Computer Interaction(2020), 1–31.",
      "doi": ""
    },
    {
      "text": "Rebecca Rodrigues, Arlene G MacDougall, Guangyong Zou, Michael Lebenbaum, Paul Kurdyak, Lihua Li, Salimah Z Shariff, and Kelly K Anderson. 2020. Risk of involuntary admission among first-generation ethnic minority groups with early psychosis: a retrospective cohort study using health administrative data. Epidemiology and Psychiatric Sciences 29 (2020).",
      "doi": ""
    },
    {
      "text": "Valerian Rodrigues. 2011. Justice as the Lens: Interrogating Rawls through Sen and Ambedkar. Indian Journal of Human Development 5, 1 (2011), 153–174.",
      "doi": ""
    },
    {
      "text": "Vanda Scott. 2001. Volunteer Action in Preventing Suicide. Suicide prevention: Resources for the millennium (2001), 265.",
      "doi": ""
    },
    {
      "text": "Irving Seidman. 2006. A guide for researchers in education and the social sciences.",
      "doi": ""
    },
    {
      "text": "Amartya Kumar Sen. 2009. The idea of justice. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "S Sharma and RK Chadda. 1996. Recommendations of WHO workshop on “Future role on mental hospitals in mental health care.” In: Mental Hospitals in India: Current Status and Role in Mental Health Care. Institute of Human Behaviour and Allied Sciences, Delhi (1996).",
      "doi": ""
    },
    {
      "text": "Shridhar Sharma and LP Varma. 1984. History of mental hospitals in Indian sub-continent. Indian journal of psychiatry 26, 4 (1984), 295.",
      "doi": ""
    },
    {
      "text": "Rahul Shidhaye and Michelle Kermode. 2013. Stigma and discrimination as a barrier to mental health service utilization in India. International health 5, 1 (2013), 6–8.",
      "doi": ""
    },
    {
      "text": "Kevin Shinseki. 2018. System and method for providing chat-based customer callbacks. US Patent App. 16/058,044.",
      "doi": ""
    },
    {
      "text": "Amresh K Shrivastava, Megan E Johnston, Larry Stitt, Meghana Thakar, Gopa Sakel, Sunita Iyer, Nilesh Shah, and Yves Bureau. 2012. Reducing treatment delay for early intervention: evaluation of a community based crisis helpline. Annals of general psychiatry 11, 1 (2012), 20.",
      "doi": ""
    },
    {
      "text": "Sujata Sriram, Aparna Joshi, and Paras Sharma. 2016. Telephone Counselling in India: Lessons from iCALL. In Counselling in India. Springer, 201–216.",
      "doi": ""
    },
    {
      "text": "Amresh Srivastava, Megan Johnston, Larry Stitt, Meghana Thanksr, Sunita Iyer, 2013. Suicidal ideation in callers to a crisis hotline in Mumbai. Journal of Public Health 5, 7 (2013), 305–308.",
      "doi": ""
    },
    {
      "text": "[110] Alternative Story.2020. (2020). http://alternativestory.in/",
      "doi": ""
    },
    {
      "text": "Your Story. 2019. These suicide prevention helplines ensure support is just a call away. (2019). https://yourstory.com/herstory/2019/09/suicide-prevention-helplines-support-mental-health-women",
      "doi": ""
    },
    {
      "text": "[112] It’s Ok To Talk.2020. (2020). http://itsoktotalk.in/",
      "doi": ""
    },
    {
      "text": "Rangawsamy Thara, Ramachandran Padmavati, Jothy R Aynkran, and Sujit John. 2008. Community mental health in India: A rethink. International Journal of Mental Health Systems 2, 1 (2008), 1–7.",
      "doi": ""
    },
    {
      "text": "John Torous, Jennifer Nicholas, Mark E Larsen, Joseph Firth, and Helen Christensen. 2018. Clinical review of user engagement with mental health smartphone apps: evidence, theory and improvements. Evidence-based mental health 21, 3 (2018), 116–119.",
      "doi": ""
    },
    {
      "text": "Sarah J Tracy. 2002. When questioning turns to face threat: an interactional sensitivity in 911 call-taking. Western Journal of Communication (includes Communication Reports) 66, 2(2002), 129–157.",
      "doi": ""
    },
    {
      "text": "Kai Wang, Deepthi S Varma, and Mattia Prosperi. 2018. A systematic review of the effectiveness of mobile apps for monitoring and management of mental health symptoms or disorders. Journal of psychiatric research 107 (2018), 73–78.",
      "doi": ""
    },
    {
      "text": "Sara M Williams, Laura M Frey, Dese’Rae L Stage, and Julie Cerel. 2018. Exploring lived experience in gender and sexual minority suicide attempt survivors.American journal of orthopsychiatry 88, 6 (2018), 691.",
      "doi": ""
    },
    {
      "text": "Iris Marion Young. 2011. Justice and the Politics of Difference. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Zahoor Zafrulla, John Etherton, and Thad Starner. 2008. TTY phone: direct, equal emergency access for the deaf. In Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility. 277–278.",
      "doi": "10.1145/1414471.1414536"
    },
    {
      "text": "Howard Zehr. 2005. Changing Lenses: A New Focus for Crime and Justice, 3rd edn. Scottdale.",
      "doi": ""
    }
  ]
}