{
  "doi": "10.1145/3411764.3445630",
  "title": "Detecting Data Falsification by Front-line Development Workers: A Case Study of Vaccination in Pakistan",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Front-line workers in global development are often responsible for data collection and record-keeping about their own work. The authenticity of such data and the role of mid-level supervisors, however, remains understudied. We report on the case of immunization in Pakistan, where, through interviews with 30 mid-level vaccination managers in Punjab district, we find that data falsification by vaccinators is common, though not necessarily rampant. Because of an intricate protocol for record-keeping, supervisors can detect data falsification, and we find they have devised an array of methods, broadly classifiable into four types: triangulation, supplementary data collection, anomaly detection, and interrogation. We also find that the strategies that supervisors use to detect falsification seem linked to their style of management, with authoritarian supervisors preferring supplementary data collection and spot checks, while supportive supervisors use triangulation. Our findings lead to recommendations for designing technologies intended to monitor and manage front-line data.",
  "tags": [
    "Developing Countries",
    "Supervisors",
    "Data Falsification",
    "Mid-level Managers",
    "Technology",
    "Immunization",
    "Healthcare",
    "Supportive Supervision",
    "Front-line Workers"
  ],
  "authors": [
    {
      "name": "Amna Batool",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658766961",
      "orcid": "0000-0001-5207-5352"
    },
    {
      "name": "Kentaro Toyama",
      "institution": "School of Information University of Michigan, United States",
      "img": "/do/10.1145/contrib-81100410420/rel-imgonly/kentarotoyamaportrait201411480x640.jpg",
      "acmid": "81100410420",
      "orcid": "0000-0002-9128-2255"
    },
    {
      "name": "Tiffany Veinot",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447601417",
      "orcid": "missing"
    },
    {
      "name": "Beenish Fatima",
      "institution": "Department of Computer Science Information Technology University, Pakistan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81493659553",
      "orcid": "missing"
    },
    {
      "name": "Mustafa Naseem",
      "institution": "School of Information University of Michigan Ann Arbor, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658696046",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "SO Ayaya, E Liechty, JH Conway, T Kamau, and FO Esamai. 2007. Training needs for mid-level managers and immunisation coverage in Western Kenya. East African medical journal 84, 7 (2007), 342–352.",
      "doi": ""
    },
    {
      "text": "G Babu, V Singh, S Nandy, S Jana, Satyanarayana TN, and Sadhana SM. 2010. Supportive supervision and immunization coverage: Evidence from India. Int J Epidemiol 9, 2 (2010).",
      "doi": ""
    },
    {
      "text": "Claire Bailey, Carolyn Blake, Michael Schriver, Vincent Kalumire Cubaka, Tisa Thomas, and Adriane Martin Hilber. 2016. A systematic review of supportive supervision as a strategy to improve primary healthcare services in Sub-Saharan Africa. International Journal of Gynecology & Obstetrics 132, 1(2016), 117–125.",
      "doi": ""
    },
    {
      "text": "Shrikant I Bangdiwala, Sharon Fonn, Osegbeaghe Okoye, and Stephen Tollman. 2010. Workforce resources for health in developing countries. Public Health Reviews 32, 1 (2010), 296–318.",
      "doi": ""
    },
    {
      "text": "Amna Batool, Umair Ali, Samia Razaq, and Mustafa Naseem. 2016. Child Immunization Health Card Redesign: an Iterative, User-Centered Approach. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. 1–4.",
      "doi": ""
    },
    {
      "text": "Benjamin Birnbaum, Gaetano Borriello, Abraham D Flaxman, Brian DeRenzi, and Anna R Karlin. 2013. Using behavioral data to identify interviewer fabrication in surveys. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2911–2920.",
      "doi": "10.1145/2470654.2481404"
    },
    {
      "text": "Benjamin Birnbaum, Brian DeRenzi, Abraham D Flaxman, and Neal Lesh. 2012. Automated quality control for mobile data collection. In Proceedings of the 2nd ACM Symposium on Computing for Development. 1–10.",
      "doi": "10.1145/2160601.2160603"
    },
    {
      "text": "Xavier Bosch-Capblanch and Paul Garner. 2008. Primary health care supervision in developing countries. Tropical medicine & international health 13, 3 (2008), 369–383.",
      "doi": ""
    },
    {
      "text": "Xavier Bosch-Capblanch, Sajil Liaqat, and Paul Garner. 2011. Managerial supervision to improve primary health care in low-and middle-income countries. Cochrane database of systematic reviews9 (2011).",
      "doi": ""
    },
    {
      "text": "Sebastian Bredl, Peter Winker, and Kerstin Kötschau. 2008. A statistical approach to detect cheating interviewers. Technical Report. Discussion Paper.",
      "doi": ""
    },
    {
      "text": "John M Bushery, Jennifer W Reichert, Keith A Albright, and John C Rossiter. 1999. Using date and time stamps to detect interviewer falsification. In Proceedings of the American Statistical Association (Survey Research Methods Section). 316–320.",
      "doi": ""
    },
    {
      "text": "Michael Callen, Saad Gulzar, Ali Hasanain, Abdul Rehman Khan, Yasir Khan, and Muhammad Zia Mehmood. 2013. Improving Public Health Delivery in Punjab, Pakistan: Issues and Opportunities.Lahore Journal of Economics 18 (2013).",
      "doi": ""
    },
    {
      "text": "C John Clements, Pieter H Streefland, and Clement Malau. 2007. Supervision in Primary Health Care 128;“Can it be Carried Out Effectively in Developing Countries?Current drug safety 2, 1 (2007), 19–23.",
      "doi": ""
    },
    {
      "text": "Nicola Dell, Trevor Perrier, Neha Kumar, Mitchell Lee, Rachel Powers, and Gaetano Borriello. 2015. Digital Workflows in Global Development Organizations. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1659–1669.",
      "doi": "10.1145/2675133.2675145"
    },
    {
      "text": "Brian DeRenzi, Gaetano Borriello, Jonathan Jackson, Vikram S Kumar, Tapan S Parikh, Pushwaz Virk, and Neal Lesh. 2011. Mobile phone tools for field-based health care workers in low-income countries. Mount Sinai Journal of Medicine: A Journal of Translational and Personalized Medicine 78, 3 (2011), 406–418.",
      "doi": ""
    },
    {
      "text": "Brian DeRenzi, Nicola Dell, Jeremy Wacksman, Scott Lee, and Neal Lesh. 2017. Supporting community health workers in India through voice-and web-based feedback. In Proceedings of the 2017 CHI conference on human factors in computing systems. 2770–2781.",
      "doi": "10.1145/3025453.3025514"
    },
    {
      "text": "Brian DeRenzi, Leah Findlater, Jonathan Payne, Benjamin Birnbaum, Joachim Mangilima, Tapan Parikh, Gaetano Borriello, and Neal Lesh. 2012. Improving community health worker performance through automated SMS. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development. 25–34.",
      "doi": "10.1145/2160673.2160677"
    },
    {
      "text": "Brian DeRenzi, Jeremy Wacksman, Nicola Dell, Scott Lee, Neal Lesh, Gaetano Borriello, and Andrew Ellner. 2016. Closing the feedback Loop: A 12-month evaluation of ASTA, a self-tracking application for ASHAs. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. 1–10.",
      "doi": "10.1145/2909609.2909652"
    },
    {
      "text": "Mamuka Djibuti, George Gotsadze, Akaki Zoidze, George Mataradze, Laura C Esmail, and Jillian Clare Kohler. 2009. The role of supportive supervision on immunization program outcome-a randomized field trial from Georgia. BMC international health and human rights 9, S1 (2009), S11.",
      "doi": ""
    },
    {
      "text": "Robert M Emerson, Rachel I Fretz, and Linda L Shaw. 2011. Writing ethnographic fieldnotes. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Paul J Freund and Katele Kalumba. 1985. Monitoring and evaluation of primary health care in rural Zambia: a comparative study. Scandinavian journal of social medicine 13, 4 (1985), 137–146.",
      "doi": ""
    },
    {
      "text": "Devon Greyson. 2018. Information triangulation: A complex and agentic everyday information practice. Journal of the Association for Information Science and Technology 69, 7(2018), 869–878.",
      "doi": ""
    },
    {
      "text": "Carl Hartung, Adam Lerer, Yaw Anokwa, Clint Tseng, Waylon Brunette, and Gaetano Borriello. 2010. Open data kit: tools to build information services for developing regions. In Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development. 1–12.",
      "doi": "10.1145/2369220.2369236"
    },
    {
      "text": "Samia Ibtasam, Lubna Razaq, Maryam Ayub, Jennifer R Webster, Syed Ishtiaque Ahmed, and Richard Anderson. 2019. ” My cousin bought the phone for me. I never go to mobile shops.” The Role of Family in Women’s Technological Inclusion in Islamic Culture. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–33.",
      "doi": ""
    },
    {
      "text": "Azra Ismail and Neha Kumar. 2018. Engaging solidarity in data collection practices for community health. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–24.",
      "doi": "10.1145/3274345"
    },
    {
      "text": "Naveena Karusala, Jennifer Wilson, Phebe Vayanos, and Eric Rice. 2019. Street-Level Realities of Data Practices in Homeless Services Provision. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359286"
    },
    {
      "text": "Pamela Kiecker and James E Nelson. 1996. Do interviewers follow telephone survey instructions?Market Research Society. Journal. 38, 2 (1996), 1–14.",
      "doi": ""
    },
    {
      "text": "Sue M Kilminster and Brian C Jolly. 2000. Effective supervision in clinical practice settings: a literature review. Medical education 34, 10 (2000), 827–840.",
      "doi": ""
    },
    {
      "text": "Judith Kimchi, Barbara Polivka, and Joanne Sabol Stevenson. 1991. Triangulation: operational definitions. Nursing research 40, 6 (1991), 364–366.",
      "doi": ""
    },
    {
      "text": "Elizabeth A Krejsa, Mary C Davis, and Joan M Hill. 1999. Evaluation of the quality assurance falsification interview used in the census 2000 dress rehearsal. ASA Section on Survey Research Methods(1999), 635–640.",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, 2015. Projecting health: community-led video education for maternal health. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. 1–10.",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Rajesh Kumar. 1993. Streamlined records benefit maternal and child health care. In World health forum 1993; 14 (3): 305-307.",
      "doi": ""
    },
    {
      "text": "Simon Lewin, John N Lavis, Andrew D Oxman, Gabriel Bastías, Mickey Chopra, Agustín Ciapponi, Signe Flottorp, Sebastian García Martí, Tomas Pantoja, Gabriel Rada, 2008. Supporting the delivery of cost-effective interventions in primary health-care systems in low-income and middle-income countries: an overview of systematic reviews. The Lancet 372, 9642 (2008), 928–939.",
      "doi": ""
    },
    {
      "text": "BENJAMIN P LOEVINSOHN. 1994. Data utilization and analytical skills among mid-level health programme managers in a developing country. International journal of epidemiology 23, 1 (1994), 194–200.",
      "doi": ""
    },
    {
      "text": "Megh Marathe and Priyank Chandra. 2020. Officers Never Type: Examining the Persistence of Paper in e-Governance. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376216"
    },
    {
      "text": "João C Mavimbe, Jørn Braa, and Gunnar Bjune. 2005. Assessing immunization data quality from routine reports in Mozambique. BMC public health 5, 1 (2005), 108.",
      "doi": ""
    },
    {
      "text": "Maletsabisa Molapo, Melissa Densmore, and Brian DeRenzi. 2017. Video consumption patterns for first time smartphone users: Community health workers in Lesotho. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6159–6170.",
      "doi": "10.1145/3025453.3025616"
    },
    {
      "text": "Joe Murphy, Rodney Baxter, Joe Eyerman, David Cunningham, and Joel Kennet. 2004. A system for detecting interviewer falsification. In American Association for Public Opinion Research 59th Annual Conference. 4968–4975.",
      "doi": ""
    },
    {
      "text": "National Institute of Pakistan Studiesand ICF. 2019. Pakistan demographic and health survey 2017–2018.",
      "doi": ""
    },
    {
      "text": "Pakistan Bureau of Statistics. [n.d.]. ”Pakistan Social and Living Standards Measurement Survey (2018-19)”. http://www.pbs.gov.pk/sites/default/files//pslm/publications/pslm2018-19/pslm_report_2018-19_national_provincial.pdf",
      "doi": ""
    },
    {
      "text": "SR Onta, S Sabroe, and EH Hansen. 1998. The quality of immunization data from routine primary health care reports: a case from Nepal. Health Policy and Planning 13, 2 (1998), 131–139.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2003. The immunization data quality audit (DQA) procedure. Technical Report. World Health Organization.",
      "doi": ""
    },
    {
      "text": "World Health Organization 2016. Planning and implementing high-quality supplementary immunization activities for injectable vaccines using an example of measles and rubella vaccines: field guide. (2016).",
      "doi": ""
    },
    {
      "text": "WHO Pakistan. [n.d.]. Expanded Program for immunization. World Health Organization.[Internet].[cited 2014 Dec 15]. Available from: http://www. emro. who. int/pak/programmes/expanded-programme-on-immunization. html([n. d.]).",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Anjuli Dasika, Ahmad Hasan, Jackie Wolf, Nick Reid, Vaishnav Kameswaran, Purva Yardi, Allyson Mackay, Abram Wagner, Bhramar Mukherjee, 2017. Changing data practices for community health workers: Introducing digital data collection in West Bengal, India. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development. 1–12.",
      "doi": "10.1145/3136560.3136582"
    },
    {
      "text": "Tapan S Parikh, Paul Javid, Kaushik Ghosh, and Kentaro Toyama. 2006. Mobile phones and paper documents: evaluating a new approach for capturing microfinance data in rural India. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 551–560.",
      "doi": "10.1145/1124772.1124857"
    },
    {
      "text": "Divya Ramachandran, John Canny, Prabhu Dutta Das, and Edward Cutrell. 2010. Mobile-izing health workers in rural India. In Proceedings of the SIGCHI conference on human factors in computing systems. 1889–1898.",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Aishwarya Lakshmi Ratan, Kentaro Toyama, Sunandan Chakraborty, Keng Siang Ooi, Mike Koenig, Pushkar V Chitnis, and Matthew Phiong. 2010. Managing microfinance with paper, pen and digital slate. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development. 1–11.",
      "doi": "10.1145/2369220.2369255"
    },
    {
      "text": "Samia Razaq, Amna Batool, Umair Ali, Muhammad Salman Khalid, Umar Saif, and Mustafa Naseem. 2016. Iterative Design of an Immunization Information System in Pakistan. In Proceedings of the 7th Annual Symposium on Computing for Development. 1–10.",
      "doi": "10.1145/3001913.3001925"
    },
    {
      "text": "O Ronveaux, D Rickert, S Hadler, H Groom, J Lloyd, A Bchir, and M Birmingham. 2005. The immunization data quality audit: verifying the quality and consistency of immunization monitoring systems. Bulletin of the World Health Organization 83 (2005), 503–510.",
      "doi": ""
    },
    {
      "text": "Irwin D Schreiner, Jennifer Newbrough, and Karen Pennie. 1988. Interviewer falsification in census bureau surveys. US Census Bureau [custodian].",
      "doi": ""
    },
    {
      "text": "Colleen Scott, Kristie EN Clarke, Jan Grevendonk, Samantha B Dolan, Hussein Osman Ahmed, Peter Kamau, Peter Aswani Ademba, Lynda Osadebe, George Bonsu, Joseph Opare, 2017. Country immunization information system assessments—Kenya, 2015 and Ghana, 2016. MMWR. Morbidity and mortality weekly report 66, 44 (2017), 1226.",
      "doi": ""
    },
    {
      "text": "Kizito Shirima, Oscar Mukasa, Joanna Armstrong Schellenberg, Fatuma Manzi, Davis John, Adiel Mushi, Mwifadhi Mrisho, Marcel Tanner, Hassan Mshinda, and David Schellenberg. 2007. The use of personal digital assistants for data entry at the point of collection in a large household survey in southern Tanzania. Emerging themes in epidemiology 4, 1 (2007), 1–8.",
      "doi": ""
    },
    {
      "text": "Carla Willig and Wendy Stainton Rogers. 2017. The SAGE handbook of qualitative research in psychology. Sage.",
      "doi": ""
    },
    {
      "text": "Fouzia Younas, Mustafa Naseem, and Maryam Mustafa. 2020. Patriarchy and Social Media: Women Only Facebook Groups as Safe Spaces for Support Seeking in Pakistan. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development (Guayaquil, Ecuador) (ICTD2020). Association for Computing Machinery, New York, NY, USA, Article 11, 11 pages. https://doi.org/10.1145/3392561.3394639",
      "doi": "10.1145/3392561.3394639"
    }
  ]
}