{
  "doi": "10.1145/3411764.3445089",
  "title": "VisiFit: Structuring Iterative Improvement for Novice Designers",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Visual blends are an advanced graphic design technique to seamlessly integrate two objects into one. Existing tools help novices create prototypes of blends, but it is unclear how they would improve them to be higher fidelity. To help novices, we aim to add structure to the iterative improvement process. We introduce a method for improving prototypes that uses secondary design dimensions to explore a structured design space. This method is grounded in the cognitive principles of human visual object recognition. We present VisiFit – a computational design system that uses this method to enable novice graphic designers to improve blends with computationally generated options they can select, adjust, and chain together. Our evaluation shows novices can substantially improve 76% of blends in under 4 minutes. We discuss how the method can be generalized to other blending problems, and how computational tools can support novices by enabling them to explore a structured design space quickly and efficiently.",
  "authors": [
    {
      "name": "Lydia B Chilton",
      "institution": "Computer Science Department Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480701",
      "orcid": "0000-0002-1737-1276"
    },
    {
      "name": "Ecenaz Jen Ozmen",
      "institution": "Computer Science Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659508991",
      "orcid": "missing"
    },
    {
      "name": "Sam H Ross",
      "institution": "Barnard College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659509276",
      "orcid": "missing"
    },
    {
      "name": "Vivian Liu",
      "institution": "Computer Science Department Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528782",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Martín Abadi, Ashish Agarwal, Paul Barham, Eugene Brevdo, Zhifeng Chen, Craig Citro, Greg S. Corrado, Andy Davis, Jeffrey Dean, Matthieu Devin, Sanjay Ghemawat, Ian Goodfellow, Andrew Harp, Geoffrey Irving, Michael Isard, Yangqing Jia, Rafal Jozefowicz, Lukasz Kaiser, Manjunath Kudlur, Josh Levenberg, Dan Mané, Rajat Monga, Sherry Moore, Derek Murray, Chris Olah, Mike Schuster, Jonathon Shlens, Benoit Steiner, Ilya Sutskever, Kunal Talwar, Paul Tucker, Vincent Vanhoucke, Vijay Vasudevan, Fernanda Viégas, Oriol Vinyals, Pete Warden, Martin Wattenberg, Martin Wicke, Yuan Yu, and Xiaoqiang Zheng. 2015. TensorFlow: Large-Scale Machine Learning on Heterogeneous Systems. http://tensorflow.org/ Software available from tensorflow.org.",
      "doi": ""
    },
    {
      "text": "Maneesh Agrawala, Wilmot Li, and Floraine Berthouzoz. 2011. Design Principles for Visual Communication. Commun. ACM 54, 4 (April 2011), 60–69. https://doi.org/10.1145/1924421.1924439",
      "doi": "10.1145/1924421.1924439"
    },
    {
      "text": "Pete Barry. 2016. The Advertising Concept Book: Think Now, Design Later (Third). Thames & Hudson, London, UK. 296 pages.",
      "doi": ""
    },
    {
      "text": "Gilbert Louis Bernstein and Wilmot Li. 2015. Lillicon: Using Transient Widgets to Create Scale Variations of Icons. ACM Trans. Graph. 34, 4, Article 144 (July 2015), 11 pages. https://doi.org/10.1145/2766980",
      "doi": "10.1145/2766980"
    },
    {
      "text": "Dino Borri and Domenico Camarda. 2009. The Cooperative Conceptualization of Urban Spaces in AI-assisted Environmental Planning. In Proceedings of the 6th International Conference on Cooperative Design, Visualization, and Engineering (Luxembourg, Luxembourg) (CDVE’09). Springer-Verlag, Berlin, Heidelberg, 197–207. http://dl.acm.org/citation.cfm?id=1812983.1813012",
      "doi": "10.5555/1812983.1813012"
    },
    {
      "text": "Zoya Bylinskii, Nam Wook Kim, Peter O’Donovan, Sami Alsheikh, Spandan Madan, Hanspeter Pfister, Fredo Durand, Bryan Russell, and Aaron Hertzmann. 2017. Learning Visual Importance for Graphic Designs and Data Visualizations. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology(Québec City, QC, Canada) (UIST ’17). ACM, New York, NY, USA, 57–69. https://doi.org/10.1145/3126594.3126653",
      "doi": "10.1145/3126594.3126653"
    },
    {
      "text": "Zoya Bylinskii, Nam Wook Kim, Peter O’Donovan, Sami Alsheikh, Spandan Madan, Hanspeter Pfister, Fredo Durand, Bryan Russell, and Aaron Hertzmann. 2017. Learning Visual Importance for Graphic Designs and Data Visualizations. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 57–69. https://doi.org/10.1145/3126594.3126653",
      "doi": "10.1145/3126594.3126653"
    },
    {
      "text": "Erin Cherry and Celine Latulipe. 2014. Quantifying the Creativity Support of Digital Tools through the Creativity Support Index. ACM Trans. Comput.-Hum. Interact. 21, 4, Article 21 (June 2014), 25 pages. https://doi.org/10.1145/2617588",
      "doi": "10.1145/2617588"
    },
    {
      "text": "Lydia B. Chilton, Savvas Petridis, and Maneesh Agrawala. 2019. VisiBlends: A Flexible Workflow for Visual Blends. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 172, 14 pages. https://doi.org/10.1145/3290605.3300402",
      "doi": "10.1145/3290605.3300402"
    },
    {
      "text": "Nicholas Davis, Chih-PIn Hsiao, Kunwar Yashraj Singh, Lisa Li, Sanat Moningi, and Brian Magerko. 2015. Drawing Apprentice: An Enactive Co-Creative Agent for Artistic Collaboration. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (Glasgow, United Kingdom) (C&C ’15). Association for Computing Machinery, New York, NY, USA, 185–186. https://doi.org/10.1145/2757226.2764555",
      "doi": "10.1145/2757226.2764555"
    },
    {
      "text": "Niraj Ramesh Dayama, Kashyap Todi, Taru Saarelainen, and Antti Oulasvirta. 2020. GRIDS: Interactive Layout Design with Integer Programming. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376553",
      "doi": "10.1145/3313831.3376553"
    },
    {
      "text": "Biplab Deka, Zifeng Huang, Chad Franzen, Joshua Hibschman, Daniel Afergan, Yang Li, Jeffrey Nichols, and Ranjitha Kumar. 2017. Rico: A Mobile App Dataset for Building Data-Driven Design Applications. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 845–854. https://doi.org/10.1145/3126594.3126651",
      "doi": "10.1145/3126594.3126651"
    },
    {
      "text": "Richard O. Duda and Peter E. Hart. 1972. Use of the Hough Transformation to Detect Lines and Curves in Pictures. Commun. ACM 15, 1 (Jan. 1972), 11–15. https://doi.org/10.1145/361237.361242",
      "doi": "10.1145/361237.361242"
    },
    {
      "text": "Morwaread M. Farbood, Egon Pasztor, and Kevin Jennings. 2004. Hyperscore: A Graphical Sketchpad for Novice Composers. IEEE Comput. Graph. Appl. 24, 1 (Jan. 2004), 50–54. https://doi.org/10.1109/MCG.2004.1255809",
      "doi": "10.1109/MCG.2004.1255809"
    },
    {
      "text": "G. Fauconnier and M. Turner. 2002. The Way We Think: Conceptual Blending and the Mind’s Hidden Complexities. Basic Books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Charles Forceville. 1994. Pictorial Metaphor in Advertisements. Metaphor and Symbolic Activity 9, 1 (1994), 1–29.",
      "doi": ""
    },
    {
      "text": "Jonas Frich, Lindsay MacDonald Vermeulen, Christian Remy, Michael Mose Biskjaer, and Peter Dalsgaard. 2019. Mapping the Landscape of Creativity Support Tools in HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 389, 18 pages. https://doi.org/10.1145/3290605.3300619",
      "doi": "10.1145/3290605.3300619"
    },
    {
      "text": "Krzysztof Z. Gajos, Daniel S. Weld, and Jacob O. Wobbrock. 2010. Automatically Generating Personalized User Interfaces with Supple. Artif. Intell. 174, 12-13 (Aug. 2010), 910–950. https://doi.org/10.1016/j.artint.2010.05.005",
      "doi": "10.1016/j.artint.2010.05.005"
    },
    {
      "text": "Leon A. Gatys, Alexander S. Ecker, and Matthias Bethge. 2016. Image Style Transfer Using Convolutional Neural Networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). IEEE, New York, NY, USA, 2414–2423.",
      "doi": ""
    },
    {
      "text": "Ross Girshick, Ilija Radosavovic, Georgia Gkioxari, Piotr Dollár, and Kaiming He. 2018. Detectron. https://github.com/facebookresearch/detectron.",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Scott R. Klemmer, Michael Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective Physical Prototyping Through Integrated Design, Test, and Analysis. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology(Montreux, Switzerland) (UIST ’06). ACM, New York, NY, USA, 299–308. https://doi.org/10.1145/1166253.1166300",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Narayan Hegde, Jason D Hipp, Yun Liu, Michael Emmert-Buck, Emily Reif, Daniel Smilkov, Michael Terry, Carrie J Cai, Mahul B Amin, Craig H Mermel, Phil Q Nelson, Lily H Peng, Greg S Corrado, and Martin C Stumpe. 2019. Similar image search for histopathology: SMILY. npj Digital Medicine 2, 1 (2019), 56. https://doi.org/10.1038/s41746-019-0131-z",
      "doi": ""
    },
    {
      "text": "Elizabeth Holmes. 2015. Athleisure: A Workout Look for Every Occasion. https://www.wsj.com/video/athleisure-a-workout-look-for-every-occasion/D0174829-3288-40F1-9E12-0F420E38AA9A.html",
      "doi": ""
    },
    {
      "text": "Q. Hou, M. Cheng, X. Hu, A. Borji, Z. Tu, and P. H. S. Torr. 2019. Deeply Supervised Salient Object Detection with Short Connections. IEEE Transactions on Pattern Analysis and Machine Intelligence 41, 4(2019), 815–828. https://doi.org/10.1109/TPAMI.2018.2815688",
      "doi": "10.1109/TPAMI.2018.2815688"
    },
    {
      "text": "P. Karimi, M. L. Maher, K. Grace, and N. Davis. 2019. A computational model for visual conceptual blends. IBM Journal of Research and Development 63, 1 (2019), 5:1–5:10.",
      "doi": "10.1147/JRD.2018.2881736"
    },
    {
      "text": "P. Karimi, M. L. Maher, k. Grace, and N. Davis. 2019. A Computational Model for Visual Conceptual Blends. IBM J. Res. Dev. 63, 1, Article 1 (Jan. 2019), 10 pages. https://doi.org/10.1147/JRD.2018.2881736",
      "doi": "10.1147/JRD.2018.2881736"
    },
    {
      "text": "Joy Kim, Maneesh Agrawala, and Michael S. Bernstein. 2017. Mosaic: Designing online creative communities for sharing works-in-progress. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW. Association for Computing Machinery, New York, New York, USA, 246–258. https://doi.org/10.1145/2998181.2998195 arxiv:1611.02666",
      "doi": "10.1145/2998181.2998195"
    },
    {
      "text": "Joy Kim, Sarah Sterman, Allegra Argent Beal Cohen, and Michael S. Bernstein. 2017. Mechanical novel: Crowdsourcing complex work through reflection and revision. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW. Association for Computing Machinery, New York, New York, USA, 233–245. https://doi.org/10.1145/2998181.2998196 arxiv:1611.02682",
      "doi": "10.1145/2998181.2998196"
    },
    {
      "text": "Janin Koch, Andrés Lucero, Lena Hegemann, and Antti Oulasvirta. 2019. May AI? Design ideation with cooperative contextual bandits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, New York, USA, 1–12.",
      "doi": ""
    },
    {
      "text": "Ranjitha Kumar, Arvind Satyanarayan, Cesar Torres, Maxine Lim, Salman Ahmad, Scott R. Klemmer, and Jerry O. Talton. 2013. Webzeitgeist: Design Mining the Web. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). ACM, New York, NY, USA, 3083–3092. https://doi.org/10.1145/2470654.2466420",
      "doi": "10.1145/2470654.2466420"
    },
    {
      "text": "James A. Landay. 1996. SILK: Sketching Interfaces Like Krazy. In Conference Companion on Human Factors in Computing Systems (Vancouver, British Columbia, Canada) (CHI ’96). ACM, New York, NY, USA, 398–399. https://doi.org/10.1145/257089.257396",
      "doi": ""
    },
    {
      "text": "James Lin, Mark W. Newman, Jason I. Hong, and James A. Landay. 2000. DENIM: Finding a Tighter Fit Between Tools and Practice for Web Site Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI ’00). ACM, New York, NY, USA, 510–517. https://doi.org/10.1145/332040.332486",
      "doi": "10.1145/332040.332486"
    },
    {
      "text": "Greg Little, Lydia B. Chilton, Max Goldman, and Robert C. Miller. 2010. TurKit: Human Computation Algorithms on Mechanical Turk. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (New York, New York, USA) (UIST ’10). ACM, New York, NY, USA, 57–66. https://doi.org/10.1145/1866029.1866040",
      "doi": "10.1145/1866029.1866040"
    },
    {
      "text": "J. Derek Lomas, Jodi Forlizzi, Nikhil Poonwala, Nirmal Patel, Sharan Shodhan, Kishan Patel, Ken Koedinger, and Emma Brunskill. 2016. Interface Design Optimization As a Multi-Armed Bandit Problem. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 4142–4153. https://doi.org/10.1145/2858036.2858425",
      "doi": "10.1145/2858036.2858425"
    },
    {
      "text": "Ryan Louie, Andy Coenen, Cheng Zhi Huang, Michael Terry, and Carrie J. Cai. 2020. Novice-AI Music Co-Creation via AI-Steering Tools for Deep Generative Models. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376739",
      "doi": "10.1145/3313831.3376739"
    },
    {
      "text": "Kurt Luther, Amy Pavel, Wei Wu, Jari-lee Tolentino, Maneesh Agrawala, Björn Hartmann, and Steven P. Dow. 2014. CrowdCrit: Crowdsourcing and Aggregating Visual Design Critique. In Proceedings of the Companion Publication of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA) (CSCW Companion ’14). ACM, New York, NY, USA, 21–24. https://doi.org/10.1145/2556420.2556788",
      "doi": "10.1145/2556420.2556788"
    },
    {
      "text": "J. Marks, B. Andalman, P. A. Beardsley, W. Freeman, S. Gibson, J. Hodgins, T. Kang, B. Mirtich, H. Pfister, W. Ruml, K. Ryall, J. Seims, and S. Shieber. 1997. Design Galleries: A General Approach to Setting Parameters for Computer Graphics and Animation. In Proceedings of the 24th Annual Conference on Computer Graphics and Interactive Techniques(SIGGRAPH ’97). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 389–400. https://doi.org/10.1145/258734.258887",
      "doi": "10.1145/258734.258887"
    },
    {
      "text": "Justin Matejka, Michael Glueck, Erin Bradner, Ali Hashemi, Tovi Grossman, and George Fitzmaurice. 2018. Dream Lens: Exploration and Visualization of Large-Scale Generative Design Datasets. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 369, 12 pages. https://doi.org/10.1145/3173574.3173943",
      "doi": "10.1145/3173574.3173943"
    },
    {
      "text": "Brad A. Myers, Ashley Lai, Tam Minh Le, Young Seok Yoon, Andrew Faulring, and Joel Brandt. 2015. Selective undo support for painting applications. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2015-April. Association for Computing Machinery, New York, New York, USA, 4227–4236. https://doi.org/10.1145/2702123.2702543",
      "doi": "10.1145/2702123.2702543"
    },
    {
      "text": "J. Nielsen. 1993. Iterative user-interface design. Computer 26, 11 (1993), 32–41.",
      "doi": "10.1109/2.241424"
    },
    {
      "text": "Peter O’Donovan, Aseem Agarwala, and Aaron Hertzmann. 2014. Learning Layouts for Single-Page Graphic Designs. IEEE Transactions on Visualization and Computer Graphics 20, 8(2014), 1200–1213.",
      "doi": "10.1109/TVCG.2014.48"
    },
    {
      "text": "The Editors of WHY Magazine. 1972. Design Q & A: Charles and Ray Eames. https://www.hermanmiller.com/stories/why-magazine/design-q-and-a-charles-and-ray-eames/",
      "doi": ""
    },
    {
      "text": "Francisco Pereira. 2007. Creativity and AI: A Conceptual Blending Approach. Mouton de Gruyter, Berlin, Germany.",
      "doi": ""
    },
    {
      "text": "Savvas Petridis and Lydia B. Chilton. 2019. Human Errors in Interpreting Visual Metaphor. In Proceedings of the 2019 on Creativity and Cognition (San Diego, CA, USA) (C&C ’19). Association for Computing Machinery, New York, NY, USA, 187–197. https://doi.org/10.1145/3325480.3325503",
      "doi": "10.1145/3325480.3325503"
    },
    {
      "text": "Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S. Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S. Bernstein. 2014. Expert Crowdsourcing with Flash Teams. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (Honolulu, Hawaii, USA) (UIST ’14). ACM, New York, NY, USA, 75–85. https://doi.org/10.1145/2642918.2647409",
      "doi": "10.1145/2642918.2647409"
    },
    {
      "text": "M. Riddoch and G. Humphreys. 2001. Object Recognition. In B. Rapp (Ed.), Handbook of Cognitive Neuropsychology. Psychology Press, Hove, England.",
      "doi": ""
    },
    {
      "text": "Carsten Rother, Vladimir Kolmogorov, and Andrew Blake. 2004. ”GrabCut”: Interactive Foreground Extraction Using Iterated Graph Cuts. In ACM SIGGRAPH 2004 Papers(Los Angeles, California) (SIGGRAPH ’04). ACM, New York, NY, USA, 309–314. https://doi.org/10.1145/1186562.1015720",
      "doi": "10.1145/1186562.1015720"
    },
    {
      "text": "Sam Sanders. 2015. For The Modern Man, The Sweatpant Moves Out Of The Gym. https://www.npr.org/2015/04/08/397138654/for-the-modern-man-the-sweatpant-moves-out-of-the-gym",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2007. Creativity Support Tools: Accelerating Discovery and Innovation. Commun. ACM 50, 12 (Dec. 2007), 20–32. https://doi.org/10.1145/1323688.1323689",
      "doi": "10.1145/1323688.1323689"
    },
    {
      "text": "Pao Siangliulue, Joel Chan, Steven P. Dow, and Krzysztof Z. Gajos. 2016. IdeaHound: Improving Large-scale Collaborative Ideation with Crowd-Powered Real-time Semantic Modeling. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). ACM, New York, NY, USA, 609–624. https://doi.org/10.1145/2984511.2984578",
      "doi": "10.1145/2984511.2984578"
    },
    {
      "text": "Vikash Singh, Celine Latulipe, Erin Carroll, and Danielle Lottridge. 2011. The Choreographer’s Notebook: A Video Annotation System for Dancers and Choreographers. In Proceedings of the 8th ACM Conference on Creativity and Cognition (Atlanta, Georgia, USA) (C&C ’11). Association for Computing Machinery, New York, NY, USA, 197–206. https://doi.org/10.1145/2069618.2069653",
      "doi": "10.1145/2069618.2069653"
    },
    {
      "text": "Gillian Smith, Jim Whitehead, and Michael Mateas. 2010. Tanagra: A Mixed-initiative Level Design Tool. In Proceedings of the Fifth International Conference on the Foundations of Digital Games (Monterey, California) (FDG ’10). ACM, New York, NY, USA, 209–216. https://doi.org/10.1145/1822348.1822376",
      "doi": "10.1145/1822348.1822376"
    },
    {
      "text": "Robert J Sternberg. 2011. Cognitive Psychology. Cengage Learning, Boston, MA, USA.",
      "doi": ""
    },
    {
      "text": "Sou Tabata, Hiroki Yoshihara, Haruka Maeda, and Kei Yokoyama. 2019. Automatic Layout Generation for Graphical Design Magazines. In ACM SIGGRAPH 2019 Posters (Los Angeles, California) (SIGGRAPH ’19). ACM, New York, NY, USA, Article 9, 2 pages. https://doi.org/10.1145/3306214.3338574",
      "doi": ""
    },
    {
      "text": "Michael Terry and Elizabeth D. Mynatt. 2002. Side Views: Persistent, on-Demand Previews for Open-Ended Tasks. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (Paris, France) (UIST ’02). Association for Computing Machinery, New York, NY, USA, 71–80. https://doi.org/10.1145/571985.571996",
      "doi": "10.1145/571985.571996"
    },
    {
      "text": "Kashyap Todi, Jussi Jokinen, Kris Luyten, and Antti Oulasvirta. 2019. Individualising Graphical Layouts with Predictive Visual Search Models. ACM Trans. Interact. Intell. Syst. 10, 1, Article 9 (Aug. 2019), 24 pages. https://doi.org/10.1145/3241381",
      "doi": ""
    },
    {
      "text": "Rajan Vaish, Shirish Goyal, Amin Saberi, and Sharad Goel. 2018. Creating Crowdsourced Research Talks at Scale. In Proceedings of the 2018 World Wide Web Conference(Lyon, France) (WWW ’18). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 1–11. https://doi.org/10.1145/3178876.3186031",
      "doi": "10.1145/3178876.3186031"
    },
    {
      "text": "Margot van Mulken, Rob le Pair, and Charles Forceville. 2010. The impact of perceived complexity, deviation and comprehension on the appreciation of visual metaphor in advertising across three European countries. Journal of Pragmatics 42, 12 (2010), 3418 – 3430. https://doi.org/10.1016/j.pragma.2010.04.030",
      "doi": ""
    },
    {
      "text": "Hao-Chuan Wang, Dan Cosley, and Susan R. Fussell. 2010. Idea Expander: Supporting Group Brainstorming with Conversationally Triggered Visual Thinking Stimuli. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work (Savannah, Georgia, USA) (CSCW ’10). Association for Computing Machinery, New York, NY, USA, 103–106. https://doi.org/10.1145/1718918.1718938",
      "doi": "10.1145/1718918.1718938"
    },
    {
      "text": "Jingdong Wang and Xian-Sheng Hua. 2011. Interactive image search by color map. ACM Transactions on Intelligent Systems and Technology (TIST) 3, 1(2011), 1–23.",
      "doi": "10.1145/2036264.2036276"
    },
    {
      "text": "Kento Watanabe, Yuichiroh Matsubayashi, Kentaro Inui, Tomoyasu Nakano, Satoru Fukayama, and Masataka Goto. 2017. LyriSys: An interactive support system for writing lyrics based on topic transition. In International Conference on Intelligent User Interfaces, Proceedings IUI. Association for Computing Machinery, New York, New York, USA, 559–563. https://doi.org/10.1145/3025171.3025194",
      "doi": "10.1145/3025171.3025194"
    },
    {
      "text": "Ariel Weingarten, Ben Lafreniere, George Fitzmaurice, and Tovi Grossman. 2019. DreamRooms: Prototyping Rooms in Collaboration with a Generative Process. In Proceedings of the 45th Graphics Interface Conference on Proceedings of Graphics Interface 2019(Kingston, Canada) (GI’19). Canadian Human-Computer Communications Society, Waterloo, CAN, Article 19, 9 pages. https://doi.org/10.20380/GI2019.19",
      "doi": "10.20380/GI2019.19"
    },
    {
      "text": "Anbang Xu, Shih-Wen Huang, and Brian Bailey. 2014. Voyant: Generating Structured Feedback on Visual Designs Using a Crowd of Non-experts. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA) (CSCW ’14). ACM, New York, NY, USA, 1433–1444. https://doi.org/10.1145/2531602.2531604",
      "doi": "10.1145/2531602.2531604"
    },
    {
      "text": "Lixiu Yu, Aniket Kittur, and Robert E. Kraut. 2014. Distributed Analogical Idea Generation: Inventing with Crowds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 1245–1254. https://doi.org/10.1145/2556288.2557371",
      "doi": "10.1145/2556288.2557371"
    },
    {
      "text": "Lixiu Yu, Aniket Kittur, and Robert E. Kraut. 2014. Searching for Analogical Ideas with Crowds. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 1225–1234. https://doi.org/10.1145/2556288.2557378",
      "doi": "10.1145/2556288.2557378"
    },
    {
      "text": "Lixiu Yu and Jeffrey V. Nickerson. 2011. Cooks or Cobblers?: Crowd Creativity Through Combination. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 1393–1402. https://doi.org/10.1145/1978942.1979147",
      "doi": "10.1145/1978942.1979147"
    },
    {
      "text": "Zhenpeng Zhao, Sriram Karthik Badam, Senthil Chandrasegaran, Deok Gun Park, Niklas Elmqvist, Lorraine Kisselburgh, and Karthik Ramani. 2014. SkWiki: A multimedia sketching system for collaborative creativity. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery, New York, New York, USA, 1235–1244. https://doi.org/10.1145/2556288.2557394",
      "doi": "10.1145/2556288.2557394"
    }
  ]
}