{
  "doi": "10.1145/3411764.3445205",
  "title": "EarRumble: Discreet Hands- and Eyes-Free Input by Voluntary Tensor Tympani Muscle Contraction",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "We explore how discreet input can be provided using the tensor tympani - a small muscle in the middle ear that some people can voluntarily contract to induce a dull rumbling sound. We investigate the prevalence and ability to control the muscle through an online questionnaire (N=192) in which 43.2% of respondents reported the ability to “ear rumble”. Data collected from participants (N=16) shows how in-ear barometry can be used to detect voluntary tensor tympani contraction in the sealed ear canal. This data was used to train a classifier based on three simple ear rumble “gestures” which achieved 95% accuracy. Finally, we evaluate the use of ear rumbling for interaction, grounded in three manual, dual-task application scenarios (N=8). This highlights the applicability of EarRumble as a low-effort and discreet eyes- and hands-free interaction technique that users found “magical” and “almost telepathic”.",
  "tags": [
    "earables",
    "discreet interaction",
    "tensor tympani muscle",
    "subtle gestures",
    "in-ear barometry",
    "hearables"
  ],
  "authors": [
    {
      "name": "Tobias Röddiger",
      "institution": "TECO / Pervasive Computing Systems Karlsruhe Institute of Technology (KIT), Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659309767",
      "orcid": "missing"
    },
    {
      "name": "Christopher Clarke",
      "institution": "Lancaster University, United Kingdom",
      "img": "/do/10.1145/contrib-99658704149/rel-imgonly/headshot-smile-small.jpg",
      "acmid": "99658704149",
      "orcid": "0000-0003-3916-7708"
    },
    {
      "name": "Daniel Wolffram",
      "institution": "TECO / Pervasive Computing Systems Karlsruhe Institute of Technology (KIT), Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659501303",
      "orcid": "missing"
    },
    {
      "name": "Matthias Budde",
      "institution": "TECO / Pervasive Computing Systems Karlsruhe Institute of Technology (KIT), Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81472643333",
      "orcid": "missing"
    },
    {
      "name": "Michael Beigl",
      "institution": "TECO Karlsruhe Institute of Technology (KIT), Germany",
      "img": "/do/10.1145/contrib-81100440045/rel-imgonly/beigl_300dpi_bw.jpg",
      "acmid": "81100440045",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Takashi Amesaka, Hiroki Watanabe, and Masanori Sugimoto. 2019. Facial expression recognition using ear canal transfer function. In Proceedings of the 23rd International Symposium on Wearable Computers. 1–9.",
      "doi": "10.1145/3341163.3347747"
    },
    {
      "text": "Oliver Amft, Mathias Stäger, Paul Lukowicz, and Gerhard Tröster. 2005. Analysis of chewing sounds for dietary monitoring. In International Conference on Ubiquitous Computing. Springer, 56–72.",
      "doi": "10.1007/11551201_4"
    },
    {
      "text": "Toshiyuki Ando, Yuki Kubo, Buntarou Shizuki, and Shin Takahashi. 2017. Canalsense: Face-related movement recognition system based on sensing air pressure in ear canals. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. 679–689.",
      "doi": "10.1145/3126594.3126649"
    },
    {
      "text": "RD Angeli, M Lise, CC Tabajara, and TB Maffacioli. 2013. Voluntary contraction of the tensor tympani muscle and its audiometric effects. The Journal of Laryngology and Otology 127, 12 (2013), 1235.",
      "doi": ""
    },
    {
      "text": "Takayuki Arakawa, Takafumi Koshinaka, Shohei Yano, Hideki Irisawa, Ryoji Miyahara, and Hitoshi Imaoka. 2016. Fast and accurate personal authentication using ear acoustics. In 2016 Asia-Pacific Signal and Information Processing Association Annual Summit and Conference (APSIPA). IEEE, 1–4.",
      "doi": ""
    },
    {
      "text": "Daniel Ashbrook, Carlos Tejada, Dhwanit Mehta, Anthony Jiminez, Goudam Muralitharam, Sangeeta Gajendra, and Ross Tallents. 2016. Bitey: An exploration of tooth click gestures for hands-free user interface control. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. 158–169.",
      "doi": "10.1145/2935334.2935389"
    },
    {
      "text": "Abdelkareem Bedri, David Byrd, Peter Presti, Himanshu Sahni, Zehua Gue, and Thad Starner. 2015. Stick it in your ear: Building an in-ear jaw movement sensor. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers. 1333–1338.",
      "doi": "10.1145/2800835.2807933"
    },
    {
      "text": "Victoria Bellotti, Maribeth Back, W Keith Edwards, Rebecca E Grinter, Austin Henderson, and Cristina Lopes. 2002. Making sense of sensing systems: five questions for designers and researchers. In Proceedings of the SIGCHI conference on Human factors in computing systems. 415–422.",
      "doi": "10.1145/503376.503450"
    },
    {
      "text": "Vincent Buil, Gerard Hollemans, and Sander van de Wijdeven. 2005. Headphones with touch control. In Proceedings of the 7th international conference on Human computer interaction with mobile devices & services. 377–378.",
      "doi": "10.1145/1085777.1085877"
    },
    {
      "text": "Stuart K Card, Thomas P Moran, and Allen Newell. 1980. The keystroke-level model for user performance time with interactive systems. Commun. ACM 23, 7 (1980), 396–410.",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Liwei Chan, Rong-Hao Liang, Ming-Chang Tsai, Kai-Yin Cheng, Chao-Huai Su, Mike Y. Chen, Wen-Huang Cheng, and Bing-Yu Chen. 2013. FingerPad: Private and Subtle Interaction Using Fingertips. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 255–260. https://doi.org/10.1145/2501988.2502016",
      "doi": "10.1145/2501988.2502016"
    },
    {
      "text": "Maximilian Christ, Nils Braun, Julius Neuffer, and Andreas W Kempa-Liehr. 2018. Time series feature extraction on basis of scalable hypothesis tests (tsfresh–a python package). Neurocomputing 307(2018), 72–77.",
      "doi": "10.1016/j.neucom.2018.03.067"
    },
    {
      "text": "SJ Cooper. 1985. Relationship of hearing protector type and prevalence of external auditory canal pathology. In Am. Ind. Hyg. Asso. Conf. Las Vegas, NV, paper, Vol. 23.",
      "doi": ""
    },
    {
      "text": "Enrico Costanza, Samuel A Inverso, and Rebecca Allen. 2005. Toward subtle intimate interfaces for mobile devices using an EMG controller. In Proceedings of the SIGCHI conference on Human factors in computing systems. 481–489.",
      "doi": "10.1145/1054972.1055039"
    },
    {
      "text": "Alexander De Luca, Roman Weiss, and Heiko Drewes. 2007. Evaluation of Eye-Gaze Interaction Methods for Security Enhanced PIN-Entry. In Proceedings of the 19th Australasian Conference on Computer-Human Interaction: Entertaining User Interfaces (Adelaide, Australia) (OZCHI ’07). Association for Computing Machinery, New York, NY, USA, 199–202. https://doi.org/10.1145/1324892.1324932",
      "doi": "10.1145/1324892.1324932"
    },
    {
      "text": "Artem Dementyev and Joseph A Paradiso. 2014. WristFlex: low-power gesture input with wrist-worn pressure sensors. In Proceedings of the 27th annual ACM symposium on User interface software and technology. 161–166.",
      "doi": "10.1145/2642918.2647396"
    },
    {
      "text": "Gisle Djupesland. 1964. Middle ear muscle reflexes elicited by acoustic and nonacoustic stimulation. Acta oto-laryngologica 57, sup188 (1964), 287–292.",
      "doi": ""
    },
    {
      "text": "Euan Freeman, Gareth Griffiths, and Stephen A. Brewster. 2017. Rhythmic Micro-Gestures: Discreet Interaction on-the-Go. In Proceedings of the 19th ACM International Conference on Multimodal Interaction (Glasgow, UK) (ICMI ’17). Association for Computing Machinery, New York, NY, USA, 115–119. https://doi.org/10.1145/3136755.3136815",
      "doi": "10.1145/3136755.3136815"
    },
    {
      "text": "Pablo Gallego Cascón, Denys J.C. Matthies, Sachith Muthukumarana, and Suranga Nanayakkara. 2019. ChewIt. An Intraoral Interface for Discreet Interactions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300556",
      "doi": "10.1145/3290605.3300556"
    },
    {
      "text": "Emilien Ghomi, Guillaume Faure, Stéphane Huot, Olivier Chapuis, and Michel Beaudouin-Lafon. 2012. Using rhythmic patterns as an input method. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1253–1262.",
      "doi": "10.1145/2207676.2208579"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Juan David Hincapié-Ramos, Xiang Guo, Paymahn Moghadasian, and Pourang Irani. 2014. Consumed endurance: a metric to quantify arm fatigue of mid-air interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1063–1072.",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Ken Hinckley and Daniel Wigdor. 2002. Input technologies and techniques. The human-computer interaction handbook: fundamentals, evolving technologies and emerging applications(2002), 151–168.",
      "doi": ""
    },
    {
      "text": "Hans-Eric Holst, Sven Ingelstedt, and Urban Örtegren. 1963. Ear drum movements following stimulation of the middle ear muscles. Acta Oto-Laryngologica 56, sup182 (1963), 73–83.",
      "doi": ""
    },
    {
      "text": "Lei Jing, Zixue Cheng, Yinghui Zhou, Junbo Wang, and Tongjun Huang. 2013. Magic Ring: a self-contained gesture input device on finger. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia. 1–4.",
      "doi": "10.1145/2541831.2541875"
    },
    {
      "text": "Heath G Jones, Nathaniel T Greene, and William A Ahroon. 2019. Human middle-ear muscles rarely contract in anticipation of acoustic impulses: Implications for hearing risk assessments. Hearing research 378(2019), 53–62.",
      "doi": ""
    },
    {
      "text": "Christina Katsini, Yasmeen Abdrabou, George E Raptis, Mohamed Khamis, and Florian Alt. 2020. The Role of Eye Gaze in Security and Privacy Applications: Survey and Future HCI Research Directions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–21.",
      "doi": "10.1145/3313831.3376840"
    },
    {
      "text": "Takashi Kikuchi, Yuta Sugiura, Katsutoshi Masai, Maki Sugimoto, and Bruce H Thomas. 2017. EarTouch: turning the ear into an input surface. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–6.",
      "doi": "10.1145/3098279.3098538"
    },
    {
      "text": "Ingmar Klockhoff. 1961. Middle ear muscle reflexes in man. Journal of Occupational and Environmental Medicine 3, 10 (1961), 486.",
      "doi": ""
    },
    {
      "text": "Juyoung Lee, Hui-Shyong Yeo, Murtaza Dhuliawala, Jedidiah Akano, Junichi Shimizu, Thad Starner, Aaron Quigley, Woontack Woo, and Kai Kunze. 2017. Itchy Nose: Discreet Gesture Interaction Using EOG Sensors in Smart Eyewear. In Proceedings of the 2017 ACM International Symposium on Wearable Computers (Maui, Hawaii) (ISWC ’17). Association for Computing Machinery, New York, NY, USA, 94–97. https://doi.org/10.1145/3123021.3123060",
      "doi": "10.1145/3123021.3123060"
    },
    {
      "text": "Roman Lissermann, Jochen Huber, Aristotelis Hadjakos, and Max Mühlhäuser. 2013. Earput: Augmenting behind-the-ear devices for ear-based interaction. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 1323–1328.",
      "doi": "10.1145/2468356.2468592"
    },
    {
      "text": "Mingyu Liu, Mathieu Nancel, and Daniel Vogel. 2015. Gunslinger: Subtle Arms-down Mid-Air Interaction. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 63–71. https://doi.org/10.1145/2807442.2807489",
      "doi": "10.1145/2807442.2807489"
    },
    {
      "text": "Roya Lotfi, George Tzanetakis, Rasit Eskicioglu, and Pourang Irani. 2020. A comparison between audio and IMU data to detect chewing events based on an earable device. In Proceedings of the 11th Augmented Human International Conference. 1–8.",
      "doi": "10.1145/3396339.3396362"
    },
    {
      "text": "Hiroyuki Manabe and Masaaki Fukumoto. 2011. Tap control for headphones without sensors. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 309–314.",
      "doi": "10.1145/2047196.2047236"
    },
    {
      "text": "Denys JC Matthies. 2013. InEar BioFeedController: a headset for hands-free and eyes-free interaction with mobile devices. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 1293–1298.",
      "doi": ""
    },
    {
      "text": "Denys JC Matthies, Bernhard A Strecker, and Bodo Urban. 2017. Earfieldsensing: A novel in-ear electric field sensing to enrich wearable gesture input through facial expressions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 1911–1922.",
      "doi": "10.1145/3025453.3025692"
    },
    {
      "text": "R Mazlan, L Saim, A Thomas, R Said, and B Liyab. 2002. Ear infection and hearing loss amongst headphone users. The Malaysian journal of medical sciences: MJMS 9, 2 (2002), 17.",
      "doi": ""
    },
    {
      "text": "Edward D McCoul, Vijay K Anand, and Paul J Christos. 2012. Validating the clinical assessment of eustachian tube dysfunction: The eustachian tube dysfunction questionnaire (ETDQ-7). The Laryngoscope 122, 5 (2012), 1137–1141.",
      "doi": ""
    },
    {
      "text": "Christian Metzger, Matt Anderson, and Thad Starner. 2004. Freedigiter: A contact-free device for gesture control. In Eighth International Symposium on Wearable Computers, Vol. 1. IEEE, 18–21.",
      "doi": "10.1109/ISWC.2004.23"
    },
    {
      "text": "Aage R Møller. 1961. Network model of the middle ear. The Journal of the Acoustical Society of America 33, 2 (1961), 168–176.",
      "doi": ""
    },
    {
      "text": "Aage R Møller. 1974. The acoustic middle ear muscle reflex. In Auditory system. Springer, 519–548.",
      "doi": ""
    },
    {
      "text": "Henning Pohl, Andreea Muresan, and Kasper Hornbæk. 2019. Charting Subtle Interaction in the HCI Literature. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300648",
      "doi": "10.1145/3290605.3300648"
    },
    {
      "text": "Adam Politzer. 1902. A Text-Book of the Diseases of the Ear for Students and Practitioners. Baillière, Tindall and Cox.",
      "doi": ""
    },
    {
      "text": "Adam Politzer. 1909. A Text-book of the Diseases of the Ear: For Students and Practitioners. Lea Bros.",
      "doi": ""
    },
    {
      "text": "Mark D. Reilly, Haifeng Shen, Paul R. Calder, and Henry Been-Lirn Duh. 2013. Understanding the Effects of Discreet Real-Time Social Interaction on Student Engagement in Lectures. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (Adelaide, Australia) (OzCHI ’13). Association for Computing Machinery, New York, NY, USA, 193–196. https://doi.org/10.1145/2541016.2541086",
      "doi": "10.1145/2541016.2541086"
    },
    {
      "text": "Julie Rico and Stephen Brewster. 2009. Gestures all around us: user differences in social acceptability perceptions of gesture based interfaces. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–2.",
      "doi": "10.1145/1613858.1613936"
    },
    {
      "text": "Himanshu Sahni, Abdelkareem Bedri, Gabriel Reyes, Pavleen Thukral, Zehua Guo, Thad Starner, and Maysam Ghovanloo. 2014. The tongue and ear interface: a wearable system for silent speech recognition. In Proceedings of the 2014 ACM International Symposium on Wearable Computers. 47–54.",
      "doi": "10.1145/2634317.2634322"
    },
    {
      "text": "Gerhard Salomon and Arnold Starr. 1963. Electromyography of middle ear muscles in man during motor activities. Acta Neurologica Scandinavica 39, 2 (1963), 161–168.",
      "doi": ""
    },
    {
      "text": "Richard C Simpson and Heidi Horstmann Koester. 1999. Adaptive one-switch row-column scanning. IEEE Transactions on Rehabilitation Engineering 7, 4(1999), 464–473.",
      "doi": ""
    },
    {
      "text": "Susan Standring. 2015. Gray’s anatomy e-book: the anatomical basis of clinical practice. Elsevier Health Sciences.",
      "doi": ""
    },
    {
      "text": "Ravi Vaidyanathan, Beomsu Chung, Lalit Gupta, Hyunseok Kook, Srinivas Kota, and James D West. 2007. Tongue-movement communication and control concept for hands-free human–machine interfaces. IEEE Transactions on Systems, Man, and Cybernetics-Part A: Systems and Humans 37, 4 (2007), 533–546.",
      "doi": "10.1109/TSMCA.2007.897919"
    },
    {
      "text": "Tomás Vega Gálvez, Shardul Sapkota, Alexandru Dancu, and Pattie Maes. 2019. Byte.It: Discreet Teeth Gestures for Mobile Device Interaction. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312925",
      "doi": ""
    },
    {
      "text": "Eduardo Velloso, Marcus Carter, Joshua Newn, Augusto Esteves, Christopher Clarke, and Hans Gellersen. 2017. Motion correlation: Selecting objects by matching their movement. ACM Transactions on Computer-Human Interaction (TOCHI) 24, 3(2017), 1–35.",
      "doi": "10.1145/3064937"
    },
    {
      "text": "Ruolin Wang, Chun Yu, Xing-Dong Yang, Weijie He, and Yuanchun Shi. 2019. EarTouch: facilitating smartphone use for visually impaired people in mobile and public scenarios. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300254"
    },
    {
      "text": "Katrin Wolf, Anja Naumann, Michael Rohs, and Jörg Müller. 2011. A taxonomy of microinteractions: Defining microgestures based on ergonomic and scenario-Dependent requirements. In IFIP conference on human-computer interaction. Springer, 559–575.",
      "doi": ""
    },
    {
      "text": "Xuhai Xu, Haitian Shi, Xin Yi, Wenjia Liu, Yukang Yan, Yuanchun Shi, Alex Mariakakis, Jennifer Mankoff, and Anind K Dey. 2020. EarBuddy: Enabling On-Face Interaction via Wireless Earbuds. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376836"
    },
    {
      "text": "Tengxiang Zhang, Xin Yi, Ruolin Wang, Yuntao Wang, Chun Yu, Yiqin Lu, and Yuanchun Shi. 2018. Tap-to-Pair: Associating Wireless Devices with Synchronous Tapping. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–21.",
      "doi": "10.1145/3287079"
    }
  ]
}