{
  "doi": "10.1145/3411764.3445489",
  "title": "GoldenTime: Exploring System-Driven Timeboxing and Micro-Financial Incentives for Self-Regulated Phone Use",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "User-driven intervention tools such as self-tracking help users to self-regulate problematic smartphone usage. These tools basically assume active user engagement, but prior studies warned a lack of user engagement over time. This paper proposes GoldenTime, a mobile app that promotes self-regulated usage behavior via system-driven proactive timeboxing and micro-financial incentives framed as gain or loss for behavioral reinforcement. We conducted a large-scale user study (n = 210) to explore how our proactive timeboxing and micro-financial incentives influence users’ smartphone usage behaviors. Our findings show that GoldenTime’s timeboxing based micro-financial incentives are effective in self-regulating smartphone usage, and incentive framing has a significant impact on user behavior. We provide practical design guidelines for persuasive technology design related to promoting digital wellbeing.",
  "authors": [
    {
      "name": "Joonyoung Park",
      "institution": "Graduate School of Knowledge Service Engineering KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659401613",
      "orcid": "missing"
    },
    {
      "name": "Hyunsoo Lee",
      "institution": "Graduate School of Knowledge Service Engineering KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367228",
      "orcid": "missing"
    },
    {
      "name": "Sangkeun Park",
      "institution": "Graduate School of Knowledge Service Engineering KAIST, Korea, Republic of",
      "img": "/do/10.1145/contrib-82858787057/rel-imgonly/82858787057.jpg",
      "acmid": "82858787057",
      "orcid": "missing"
    },
    {
      "name": "Kyong-Mee Chung",
      "institution": "Yonsei University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958650757",
      "orcid": "missing"
    },
    {
      "name": "Uichin Lee",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317496784",
      "orcid": "0000-0002-1888-1569"
    }
  ],
  "references": [
    {
      "text": "Elena Agapie, Daniel Avrahami, and Jennifer Marlow. 2016. Staying the course: System-driven lapse management for supporting behavior change. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1601 Broadway, Times Square, New York City., 1072–1083.",
      "doi": "10.1145/2858036.2858142"
    },
    {
      "text": "Nabil Alshurafa, Jayalakshmi Jain, Rawan Alharbi, Gleb Iakovlev, Bonnie Spring, and Angela Pfammatter. 2018. Is more always better?: discovering incentivized mHealth intervention engagement related to health behavior trends. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 153.",
      "doi": "10.1145/3287031"
    },
    {
      "text": "Ashton Anderson, Daniel Huttenlocher, Jon Kleinberg, and Jure Leskovec. 2013. Steering user behavior with badges. In Proceedings of the 22nd international conference on World Wide Web. ACM, 1601 Broadway, Times Square, New York City, 95–106.",
      "doi": "10.1145/2488388.2488398"
    },
    {
      "text": "Albert Bandura 1991. Social cognitive theory of self-regulation. Organizational behavior and human decision processes 50, 2 (1991), 248–287.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the sigchi conference on human factors in computing systems. ACM, 1601 Broadway, Times Square, New York City, 2005–2014.",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting statistical patterns between wellbeing data and context in natural language to promote behavior change. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 5(2013), 1–27.",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Ross Buck. 1985. Prime theory: An integrated view of motivation and emotion.Psychological review 92, 3 (1985), 389.",
      "doi": ""
    },
    {
      "text": "James Clawson, Jessica A Pater, Andrew D Miller, Elizabeth D Mynatt, and Lena Mamykina. 2015. No longer wearing: investigating the abandonment of personal health-tracking technologies on craigslist. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, ACM, 1601 Broadway, Times Square, New York City, 647–658.",
      "doi": "10.1145/2750858.2807554"
    },
    {
      "text": "Emily IM Collins, Anna L Cox, Jon Bird, and Daniel Harrison. 2014. Social networking use and RescueTime: the issue of engagement. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication. ACM, 1601 Broadway, Times Square, New York City, 687–690.",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, David W McDonald, and James A Landay. 2009. Theory-driven design strategies for technologies that support behavior change in everyday life. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, ACM, 1601 Broadway, Times Square, New York City, 405–414.",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Sunny Consolvo and Miriam Walker. 2003. Using the experience sampling method to evaluate ubicomp applications. IEEE Pervasive Computing 2, 2 (2003), 24–31.",
      "doi": "10.1109/MPRV.2003.1203750"
    },
    {
      "text": "Anna L Cox, Sandy JJ Gould, Marta E Cecchinato, Ioanna Iacovides, and Ian Renfree. 2016. Design frictions for mindful interactions: The case for microboundaries. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1601 Broadway, Times Square, New York City, 1389–1397.",
      "doi": "10.1145/2851581.2892410"
    },
    {
      "text": "Hossein Falaki, Ratul Mahajan, Srikanth Kandula, Dimitrios Lymberopoulos, Ramesh Govindan, and Deborah Estrin. 2010. Diversity in smartphone usage. In Proceedings of the 8th international conference on Mobile systems, applications, and services. ACM, 1601 Broadway, Times Square, New York City, 179–194.",
      "doi": "10.1145/1814433.1814453"
    },
    {
      "text": "Franz Faul, Edgar Erdfelder, Albert-Georg Lang, and Axel Buchner. 2007. G* Power 3: A flexible statistical power analysis program for the social, behavioral, and biomedical sciences. Behavior research methods 39, 2 (2007), 175–191.",
      "doi": ""
    },
    {
      "text": "Stephen Ray Flora. 2012. Power of Reinforcement, The. SUNY Press, Albany, NY, United States.",
      "doi": ""
    },
    {
      "text": "Brian J Fogg. 2002. Persuasive technology: using computers to change what we think and do. Ubiquity 2002, December (2002), 2.",
      "doi": "10.1145/764008.763957"
    },
    {
      "text": "Brian J Fogg. 2019. Tiny Habits: The Small Changes That Change Everything. Houghton Mifflin Harcourt, 125 High St, Boston, MA 02110.",
      "doi": ""
    },
    {
      "text": "David Gibson, Nathaniel Ostashewski, Kim Flintoff, Sheryl Grant, and Erin Knight. 2015. Digital badges in education. Education and Information Technologies 20, 2 (2015), 403–410.",
      "doi": "10.1007/s10639-013-9291-7"
    },
    {
      "text": "Fausto Giunchiglia, Mattia Zeni, Elisa Gobbi, Enrico Bignotti, and Ivano Bison. 2018. Mobile social media usage and academic performance. Computers in Human Behavior 82 (2018), 177–185.",
      "doi": ""
    },
    {
      "text": "Uri Gneezy, Stephan Meier, and Pedro Rey-Biel. 2011. When and why incentives (don’t) work to modify behavior. Journal of Economic Perspectives 25, 4 (2011), 191–210.",
      "doi": ""
    },
    {
      "text": "Deborah J Hennrikus and Robert W Jeffery. 1996. Worksite intervention for weight control: a review of the literature. American Journal of Health Promotion 10, 6 (1996), 471–498.",
      "doi": ""
    },
    {
      "text": "Stephen T Higgins, Kenneth Silverman, and Sarah H Heil. 2007. Contingency management in substance abuse treatment. Guilford Press, 370 Seventh Avenue Suite 1200 New York, NY 10001-1020.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sungsoo Hong, Tadayoshi Kohno, and Julie A Kientz. 2016. MyTime: designing and evaluating an intervention for smartphone non-use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1601 Broadway, Times Square, New York City, 4746–4757.",
      "doi": "10.1145/2858036.2858403"
    },
    {
      "text": "Alexis Hiniker, Bongshin Lee, Kiley Sobel, and Eun Kyoung Choe. 2017. Plan & play: supporting intentional media use in early childhood. In Proceedings of the 2017 Conference on Interaction Design and Children. ACM, 1601 Broadway, Times Square, New York City, 85–95.",
      "doi": "10.1145/3078072.3079752"
    },
    {
      "text": "Robert W Jeffery, Jean L Forster, Simone A French, Steven H Kelder, Harry A Lando, Paul G McGovern, David R Jacobs Jr, and Judith E Baxter. 1993. The Healthy Worker Project: a work-site intervention for weight control and smoking cessation.American journal of public health 83, 3 (1993), 395–401.",
      "doi": ""
    },
    {
      "text": "Gyuwon Jung, Jio Oh, Youjin Jung, Juho Sun, Ha-Kyung Kong, and Uichin Lee. 2021. “Good Enough!”: Flexible Goal Achievement with Margin-based Outcome Evaluation. In In CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman, Jack L Knetsch, and Richard H Thaler. 1991. Anomalies: The endowment effect, loss aversion, and status quo bias. Journal of Economic perspectives 5, 1 (1991), 193–206.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman and Amos Tversky. 2013. Prospect theory: An analysis of decision under risk. In Handbook of the fundamentals of financial decision making: Part I. World Scientific, 5 Toh Tuck Link Singapore, 596224. Singapore., 99–127.",
      "doi": ""
    },
    {
      "text": "Inyeop Kim, Hwarang Goh, Nematjon Narziev, Youngtae Noh, and Uichin Lee. 2020. Understanding User Contexts and Coping Strategies for Context-Aware Phone Distraction Management System Design. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 134 (Dec. 2020), 33 pages. https://doi.org/10.1145/3432213",
      "doi": "10.1145/3432213"
    },
    {
      "text": "Inyeop Kim, Gyuwon Jung, Hayoung Jung, Minsam Ko, and Uichin Lee. 2017. Let’s FOCUS: mitigating mobile phone use in college classrooms. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 1–29.",
      "doi": "10.1145/3131893"
    },
    {
      "text": "Jaejeung Kim, Chiwoo Cho, and Uichin Lee. 2017. Technology supported behavior restriction for mitigating self-interruptions in multi-device environments. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (2017), 1–21.",
      "doi": "10.1145/3131893"
    },
    {
      "text": "Jaejeung Kim, Hayoung Jung, Minsam Ko, and Uichin Lee. 2019. GoalKeeper: Exploring Interaction Lockout Mechanisms for Regulating Smartphone Use. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 1 (2019), 1–29.",
      "doi": "10.1145/3314403"
    },
    {
      "text": "Jaejeung Kim, Joonyoung Park, Hyunsoo Lee, Minsam Ko, and Uichin Lee. 2019. LocknType: Lockout task intervention for discouraging smartphone app use. In Proceedings of the 2019 CHI conference on human factors in computing systems. ACM, 1601 Broadway, Times Square, New York City, 1–12.",
      "doi": "10.1145/3290605.3300927"
    },
    {
      "text": "Mijung Kim. 2014. The effects of external cues on media habit and use: Push notification alerts and mobile application usage habits. Michigan State University, 220 Trowbridge Rd East Lansing, MI 48824, USA.",
      "doi": ""
    },
    {
      "text": "Minsam Ko, Seungwoo Choi, Subin Yang, Joonwon Lee, and Uichin Lee. 2015. FamiLync: facilitating participatory parental mediation of adolescents’ smartphone use. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 1601 Broadway, Times Square, New York City, 867–878.",
      "doi": "10.1145/2750858.2804283"
    },
    {
      "text": "Minsam Ko, Seungwoo Choi, Koji Yatani, and Uichin Lee. 2016. Lock n’LoL: group-based limiting assistance app to mitigate smartphone distractions in group activities. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1601 Broadway, Times Square, New York City, 998–1010.",
      "doi": ""
    },
    {
      "text": "Minsam Ko, Subin Yang, Joonwon Lee, Christian Heizmann, Jinyoung Jeong, Uichin Lee, Daehee Shin, Koji Yatani, Junehwa Song, and Kyong-Mee Chung. 2015. NUGU: a group-based intervention app for improving self-regulation of limiting smartphone use. In Proceedings of the 18th ACM conference on computer supported cooperative work & social computing. ACM, 1601 Broadway, Times Square, New York City, 1235–1245.",
      "doi": "10.1145/2675133.2675244"
    },
    {
      "text": "Nicholas D Lane, Li Pengyu, Lin Zhou, and Feng Zhao. 2014. Connecting personal-scale sensing and networked community behavior to infer human activities. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 1601 Broadway, Times Square, New York City, 595–606.",
      "doi": "10.1145/2632048.2636094"
    },
    {
      "text": "Robert LaRose. 2007. Uses and gratifications of Internet addiction. In Internet addiction: A handbook and guide to evaluation and treatment. Wiley Online Library, Hoboken, New Jersey, Chapter 4, 55–72.",
      "doi": ""
    },
    {
      "text": "Robert LaRose, Carolyn A Lin, and Matthew S Eastin. 2003. Unregulated Internet usage: Addiction, habit, or deficient self-regulation?Media Psychology 5, 3 (2003), 225–253.",
      "doi": ""
    },
    {
      "text": "Hyunsoo Lee, Auk Kim, Hwajung Hong, and Uichin Lee. 2021. Sticky Goals: Understanding Goal Commitments for Behavioral Changes in the Wild. In In CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Hyunsoo Lee, Uichin Lee, and Hwajung Hong. 2019. Commitment devices in online behavior change support systems. In Proceedings of Asian CHI Symposium 2019: Emerging HCI Research Collection. ACM, 1601 Broadway, Times Square, New York City, 105–113.",
      "doi": "10.1145/3309700.3338446"
    },
    {
      "text": "Uichin Lee, Kyungsik Han, Hyunsung Cho, Kyong-Mee Chung, Hwajung Hong, Sung-Ju Lee, Youngtae Noh, Sooyoung Park, and John M. Carroll. 2019. Intelligent positive computing with mobile, wearable, and IoT devices: Literature review and research directions. Ad Hoc Networks 83(2019), 8 – 24.",
      "doi": ""
    },
    {
      "text": "Brian Y Lim, Judy Kay, and Weilong Liu. 2019. How Does a Nation Walk?: Interpreting Large-Scale Step Count Activity with Weekly Streak Patterns. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 2 (2019), 57.",
      "doi": "10.1145/3328928"
    },
    {
      "text": "Markus Löchtefeld, Matthias Böhmer, and Lyubomir Ganev. 2013. AppDetox: helping users with mobile app addiction. In Proceedings of the 12th international conference on mobile and ubiquitous multimedia. ACM, 1601 Broadway, Times Square, New York City, 1–2.",
      "doi": "10.1145/2541831.2541870"
    },
    {
      "text": "Edwin A Locke and Gary P Latham. 2006. New directions in goal-setting theory. Current directions in psychological science 15, 5 (2006), 265–268.",
      "doi": ""
    },
    {
      "text": "Danielle Lottridge, Eli Marschner, Ellen Wang, Maria Romanovsky, and Clifford Nass. 2012. Browser design impacts multitasking. In Proceedings of the human factors and Ergonomics Society Annual Meeting. SAGE Publications Sage CA: Los Angeles, CA, SAGE Publications, Newbury Park, California., 1957–1961.",
      "doi": ""
    },
    {
      "text": "Kai Lukoff, Cissy Yu, Julie Kientz, and Alexis Hiniker. 2018. What Makes Smartphone Use Meaningful or Meaningless?Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1 (2018), 1–26.",
      "doi": "10.1145/3191754"
    },
    {
      "text": "Ulrik Lyngs, Kai Lukoff, Petr Slovak, Reuben Binns, Adam Slack, Michael Inzlicht, Max Van Kleek, and Nigel Shadbolt. 2019. Self-Control in Cyberspace: Applying Dual Systems Theory to a Review of Digital Self-Control Tools. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 1601 Broadway, Times Square, New York City, 1–18.",
      "doi": "10.1145/3290605.3300361"
    },
    {
      "text": "Brian E Mavis and Bertram E Stöffelmayr. 1994. Multidimensional evaluation of monetary incentive strategies for weight control. The Psychological Record 44, 2 (1994), 239–252.",
      "doi": ""
    },
    {
      "text": "Marc S Mitchell and Paul I Oh. 2016. Framing financial incentives to increase physical activity among overweight and obese adults. Annals of internal medicine 165, 8 (2016), 599–600.",
      "doi": ""
    },
    {
      "text": "Tanushree Mitra, Clayton J Hutto, and Eric Gilbert. 2015. Comparing person-and process-centric strategies for obtaining quality data on amazon mechanical turk. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, ACM, 1601 Broadway, Times Square, New York City, 1345–1354.",
      "doi": "10.1145/2702123.2702553"
    },
    {
      "text": "David C Mohr, Stephen M Schueller, Enid Montague, Michelle Nicole Burns, and Parisa Rashidi. 2014. The behavioral intervention technology model: an integrated conceptual and technological framework for eHealth and mHealth interventions. Journal of medical Internet research 16, 6 (2014), e146.",
      "doi": ""
    },
    {
      "text": "Mohamed Musthag, Andrew Raij, Deepak Ganesan, Santosh Kumar, and Saul Shiffman. 2011. Exploring micro-incentive strategies for participant compensation in high-burden studies. In Proceedings of the 13th international conference on Ubiquitous computing. ACM, 1601 Broadway, Times Square, New York City, 435–444.",
      "doi": "10.1145/2030112.2030170"
    },
    {
      "text": "Harri Oinas-Kukkonen, Khin Than Win, Evangelos Karapanos, Pasi Karppinen, and Eleni Kyza. 2019. Persuasive Technology: Development of Persuasive and Behavior Change Support Systems: 14th International Conference, PERSUASIVE 2019, Limassol, Cyprus, April 9–11, 2019, Proceedings. Vol. 11433. Springer, 11 West 42nd Street[6] in Manhattan, New York City.",
      "doi": ""
    },
    {
      "text": "Fabian Okeke, Michael Sobolev, Nicola Dell, and Deborah Estrin. 2018. Good vibrations: can a digital nudge reduce digital overload?. In Proceedings of the 20th international conference on human-computer interaction with mobile devices and services. ACM, 1601 Broadway, Times Square, New York City, 1–12.",
      "doi": "10.1145/3229434.3229463"
    },
    {
      "text": "Viktoria Pammer and Marina Bratic. 2013. Surprise, surprise: activity log based time analytics for time management. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. ACM, 1601 Broadway, Times Square, New York City, 211–216.",
      "doi": ""
    },
    {
      "text": "Mitesh S Patel, David A Asch, Roy Rosin, Dylan S Small, Scarlett L Bellamy, Jack Heuer, Susan Sproat, Chris Hyson, Nancy Haff, Samantha M Lee, 2016. Framing financial incentives to increase physical activity among overweight and obese adults: a randomized, controlled trial. Annals of internal medicine 164, 6 (2016), 385–394.",
      "doi": ""
    },
    {
      "text": "Jiaxi Peng, Danmin Miao, and Wei Xiao. 2013. Why are gainers more risk seeking. Judgment and Decision Making 8, 2 (2013), 150.",
      "doi": ""
    },
    {
      "text": "James O Prochaska and Wayne F Velicer. 1997. The transtheoretical model of health behavior change. American journal of health promotion 12, 1 (1997), 38–48.",
      "doi": ""
    },
    {
      "text": "Sasank Reddy, Deborah Estrin, Mark Hansen, and Mani Srivastava. 2010. Examining micro-payments for participatory sensing data collections. In Proceedings of the 12th ACM international conference on Ubiquitous computing. ACM, 1601 Broadway, Times Square, New York City, 33–36.",
      "doi": "10.1145/1864349.1864355"
    },
    {
      "text": "Paul Romanowich and RJ Lamb. 2013. The effect of framing incentives as either losses or gains with contingency management for smoking cessation. Addictive behaviors 38, 4 (2013), 2084–2088.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Parvin Asadzadeh, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2016. Personal tracking of screen time on digital devices. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 1601 Broadway, Times Square, New York City, 284–296.",
      "doi": "10.1145/2858036.2858055"
    },
    {
      "text": "Mical Kay Shilts, Marcel Horowitz, and Marilyn S Townsend. 2004. Goal setting as a strategy for dietary and physical activity behavior change: a review of the literature. American Journal of Health Promotion 19, 2 (2004), 81–93.",
      "doi": ""
    },
    {
      "text": "Burrhus F Skinner. 1963. Operant behavior.American psychologist 18, 8 (1963), 503.",
      "doi": ""
    },
    {
      "text": "Vincent W-S Tseng, Matthew L Lee, Laurent Denoue, and Daniel Avrahami. 2019. Overcoming Distractions during Transitions from Break to Work using a Conversational Website-Blocking System. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 1601 Broadway, Times Square, New York City, 1–13.",
      "doi": "10.1145/3290605.3300697"
    },
    {
      "text": "Alexander JAM Van Deursen, Colin L Bolle, Sabrina M Hegner, and Piet AM Kommers. 2015. Modeling habitual and addictive smartphone behavior: The role of smartphone usage types, emotional intelligence, social stress, self-regulation, age, and gender. Computers in human behavior 45 (2015), 411–420.",
      "doi": "10.1016/j.chb.2014.12.039"
    },
    {
      "text": "Kevin G Volpp, Andrea B Troxel, Mark V Pauly, Henry A Glick, Andrea Puig, David A Asch, Robert Galvin, Jingsan Zhu, Fei Wan, Jill DeGuzman, 2009. A randomized, controlled trial of financial incentives for smoking cessation. N Engl J Med 360(2009), 699–709.",
      "doi": ""
    },
    {
      "text": "Tetsuo Yamabe, Vili Lehdonvirta, Hitoshi Ito, Hayuru Soma, Hiroaki Kimura, and Tatsuo Nakajima. 2009. Applying pervasive technologies to create economic incentives that alter consumer behavior. In Proceedings of the 11th international conference on Ubiquitous computing. ACM, 1601 Broadway, Times Square, New York City, 175–184.",
      "doi": "10.1145/1620545.1620573"
    }
  ]
}