{
  "doi": "10.1145/3411764.3445125",
  "title": "Producing Liveness: The Trials of Moving Folk Clubs Online During the Global Pandemic",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The global pandemic has driven musicians online. We report an ethnographic account of how two traditional folk clubs with little previous interest in digital platforms transitioned to online experiences. They followed very different approaches: one adapted their existing singaround format to video conferencing while the other evolved a weekly community-produced, pre-recorded show that could be watched together. However, despite their successes, participants ultimately remained unable to ‘sing in chorus’ due to network constraints. We draw on theories of liveness from performance studies to explain our findings, arguing that HCI might orientate itself to online liveness as being co-produced through rich participatory structures that dissolve traditional distinctions between live and recorded and performer and audience. We discuss how participants appropriated existing platforms to achieve this, but these in turn shaped their practices in unforeseen ways. We draw out implications for the design and deployment of future live performance platforms.",
  "authors": [
    {
      "name": "Steve Benford",
      "institution": "University of Nottingham, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484684",
      "orcid": "0000-0001-8041-2520"
    },
    {
      "name": "Paul Mansfield",
      "institution": "Independent researcher, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701424",
      "orcid": "missing"
    },
    {
      "name": "Jocelyn Spence",
      "institution": "Mixed Reality Lab University of Nottingham, United Kingdom",
      "img": "/do/10.1145/contrib-81556356156/rel-imgonly/img_5689.jpg",
      "acmid": "81556356156",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Philip Auslander. 1999. Liveness: Performance in a mediatized culture. Routledge.",
      "doi": ""
    },
    {
      "text": "Philip Auslander. 2012. Digital liveness: A historico-philosophical perspective. PAJ: A Journal of Performance and Art 34, 3 (2012), 3–11.",
      "doi": ""
    },
    {
      "text": "Sarah J. Bartolome. 2013. ‘It's like a Whole Bunch of Me!’: The Perceived Values and Benefits of the Seattle Girls’ Choir Experience. Journal of Research in Music Education 60, 4 (2013), 395–418.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, and David Lloyd. 1997. Crowded collaborative virtual environments. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. ACM, 59-66.",
      "doi": "10.1145/258549.258588"
    },
    {
      "text": "Steve Benford, Adrian Hazzard, Alan Chamberlain, Kevin Glover, Chris  Greenhalgh, Liming Xu, L. Michaela Hoare, and Dimitri Darzentas. 2016. Accountable artefacts: The case of the Carolan guitar. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1163-1175. 10.1145/2858036.2858306",
      "doi": ""
    },
    {
      "text": "Steve Benford, Peter Tolmie, Ahmed Yousif Ahmed, Andy Crabtree, and Tom Rodden. 2012. Supporting traditional music-making: Designing for situated discretion. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, 127-136. 10.1145/2145204.2145227",
      "doi": "10.1145/2145204.2145227"
    },
    {
      "text": "Cynthia L. Bennett and Daniela K. Rosner. 2019. The promise of empathy: Design, disability, and knowing the ‘other’. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Paper No 298. 10.1145/3290605.3300528",
      "doi": ""
    },
    {
      "text": "Jay David Bolter and Richard Grusin. 1996. Remediation. Configurations 4, 3 (1996), 311-358. ",
      "doi": ""
    },
    {
      "text": "Juan-Pablo Cáceres and Alain B. Renaud. 2008. Playing the network: The use of time delays as musical devices. In Proceedings of International Computer Music Conference (ICMC), nycemf.org, 244–250.",
      "doi": ""
    },
    {
      "text": "Alexander Carôt and Christian Werner. 2007. Network music performance – Problems, approaches and perspectives. In Proceedings of the Music and the Global Village Conference, Vol. 162, 10–23.",
      "doi": ""
    },
    {
      "text": "Jennie Carroll, Steve Howard, Frank Vetere, Jane Peck, and John Murphy. 2001. Identity, power and fragmentation in cyberspace: Technology appropriation by young people. ACIS 2001 Proceedings. 6. http://aisel.aisnet.org/acis2001/6",
      "doi": ""
    },
    {
      "text": "Matthew Chalmers and Areti Galani. 2004. Seamful interweaving: Heterogeneity in the theory and design of interactive systems. In Proceedings of the 5th conference on Designing interactive systems: Processes, practices, methods, and techniques. ACM, 243-252. 10.1145/1013115.1013149",
      "doi": "10.1145/1013115.1013149"
    },
    {
      "text": "Maria Chatzichristodoulou and Rachel Zerihan (Eds). 2012. Intimacy across visceral and digital performance. Palgrave Macmillan.",
      "doi": ""
    },
    {
      "text": "Lindsay B. Cummings. 2016. Empathy as dialogue in theatre and performance. Palgrave Macmillan.",
      "doi": ""
    },
    {
      "text": "Tia DeNora. 2000. Music in everyday life. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Alan Dix. 2007. Designing for appropriation. In Proceedings of HCI 2007 The 21st British HCI Group Annual Conference. BCS, 1-4.",
      "doi": ""
    },
    {
      "text": "Steve Dixon. 2007. Digital performance: A history of new media in theater, dance, performance art, and installation. MIT Press.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2003. The appropriation of interactive technologies. Computer Supported Cooperative Work 12, 4 (2003), 465-490.",
      "doi": "10.1023/A%3A1026149119426"
    },
    {
      "text": "Carolyn Ellis. 2004. The ethnographic I: A methodological novel about autoethnography. AltaMira Press.",
      "doi": ""
    },
    {
      "text": "Ruth Finnegan. 2007. The hidden musicians: Music-making in an English town. Wesleyan University Press.",
      "doi": ""
    },
    {
      "text": "Erika Fischer-Lichte. 2008. The transformative power of performance: A new aesthetics. Routledge.",
      "doi": ""
    },
    {
      "text": "John Miles Foley. 2012. Oral tradition and the Internet: Pathways of the mind. University of Illinois Press.",
      "doi": ""
    },
    {
      "text": "Colombine Gardair, Patrick G. T. Healey, and Martin Welton. 2011. Performing places. In Proceedings of the 8th ACM conference on Creativity and cognition. ACM, 51-60. 10.1145/2069618.2069629",
      "doi": "10.1145/2069618.2069629"
    },
    {
      "text": "Chris Greenhalgh and Steven Benford. 1995. MASSIVE: A collaborative virtual environment for teleconferencing. ACM Transactions on Computer-Human Interaction (TOCHI) 2, 3 (1995), 239-261.",
      "doi": "10.1145/210079.210088"
    },
    {
      "text": "Matthew Tobias Harris. 2017. Liveness: An interactional account. PhD thesis, Queen Mary University of London.",
      "doi": ""
    },
    {
      "text": "Fay Hield. 2010. English folk singing and the construction of community. PhD. thesis, University of Sheffield.",
      "doi": ""
    },
    {
      "text": "Fay Hield and Paul Mansfield. 2020. Anything goes? Recognising norms, leadership and moderating behaviours at folk clubs in England. Ethnomusicology Forum 28, 3 (2020), 338-361.",
      "doi": ""
    },
    {
      "text": "Jonathan Hook, Guy Schofield, Robyn Taylor, Tom Bartindale, John McCarthy, and Peter Wright. 2012. Exploring HCI's relationship with liveness. In Proceedings of the Conference on Human Factors in Computing Systems. ACM, 2771–74. 10.1145/2212776.2212717",
      "doi": "10.1145/2212776.2212717"
    },
    {
      "text": "Kleomenis Katevas, Patrick G. T. Healey, and Matthew Tobias Harris. 2015. Robot Comedy Lab: Experimenting with the social dynamics of live performance. Frontiers in Psychology 6, Article 1253. https://doi.org/10.3389/fpsyg.2015.01253",
      "doi": ""
    },
    {
      "text": "Andy Lavender. 2016. Performance in the twenty-first century: Theatres of engagement. Routledge.",
      "doi": ""
    },
    {
      "text": "Niall MacKinnon. 1993. The British folk scene: Musical performance and social identity. Open University Press.",
      "doi": ""
    },
    {
      "text": "Garance Maréchal. 2010. Autoethnography. In Albert J. Mills, Gabrielle Durepos & Elden Wiebe (Eds.), Encyclopedia of case study research, Vol. 2. Sage Publications, 43-45.",
      "doi": ""
    },
    {
      "text": "John McCarthy and Peter Wright. 2015. Taking [A]Part: The politics and aesthetics of participation in experience-centered design. MIT Press.",
      "doi": "10.5555/2742697"
    },
    {
      "text": "Robin Nelson, Andy Lavender, Sarah Bay-Cheng, and Chiel Kattenbelt (Eds). 2010. Mapping intermediality in performance. Amsterdam University Press.",
      "doi": ""
    },
    {
      "text": "Wanda J. Orlikowski. 1992. Learning from notes: Organizational issues in groupware implementation. Proceedings of the 1992 ACM conference on Computer-supported cooperative work. ACM, 362-369. 10.1145/143457.143549",
      "doi": "10.1145/143457.143549"
    },
    {
      "text": "Ana Paiva, Iolanda Leite, Hana Boukricha, and Ipke Wachsmuth. 2017. Empathy in virtual agents and robots: A survey. In ACM Transactions on Interactive Intelligent Systems 7, 3 (2017), Article 11.",
      "doi": "10.1145/2912150"
    },
    {
      "text": "Samuli Pekkola. 2003. Designed for unanticipated use: Common artefacts as design principle for CSCW applications. Proceedings of the 2003 international ACM SIGGROUP conference on Supporting group work. ACM, 359–368. 10.1145/958160.958218.",
      "doi": "10.1145/958160.958218"
    },
    {
      "text": "Peggy Phelan. 1993. The ontology of performance: Representation without reproduction. In Unmarked: The politics of performance, Routledge, 146–166.",
      "doi": ""
    },
    {
      "text": "Pablo-Alejandro Quinones, Stephanie D. Teasley, and Steven Lonn. 2013. Appropriation by unanticipated users: Looking beyond design intent and expected use. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 1515-1526. 10.1145/2441776.2441949",
      "doi": "10.1145/2441776.2441949"
    },
    {
      "text": "Matthew Reason and Anja Mølle Lindelof (Eds). 2017. Experiencing liveness in contemporary performance: Interdisciplinary perspectives. Routledge.",
      "doi": ""
    },
    {
      "text": "Mike Robinson. 1993. Design for unanticipated use... In Proceedings of the third conference on European Conference on Computer-Supported Cooperative Work. ACM, 187-202. 10.5555/1241934.1241947",
      "doi": "10.5555/1241934.1241947"
    },
    {
      "text": "Cristina Emma Margherita Rottondi, Michele Buccoli, Massimiliano Zanoni, Dario Giuseppe Garao, Giacomo Verticale, and Augusto Sarti. 2015. Feature-based analysis of the effects of packet delay on networked musical interactions. Journal of the Audio Engineering Society, 63, 11 (2015), 864-875.",
      "doi": ""
    },
    {
      "text": "Guy Schofield, Tom Bartindale, and Peter Wright. 2015. Bootlegger: Turning fans into film crew. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 767-776. 10.1145/2702123.2702229",
      "doi": "10.1145/2702123.2702229"
    },
    {
      "text": "Norman Makoto Su. 2013. The social life of tunes: Representing the aesthetics of reception. In ECSCW 2013: Proceedings of the 13th European Conference on Computer Supported Cooperative Work. Springer, 207-228.",
      "doi": ""
    },
    {
      "text": "Hiroyuki Tarumi, Tomoki Nakai, Kei Miyazaki, Daiki Yamashita, and Yuya Takasaki. 2017. What do remote performances lack? In Collaboration Technologies and Social Computing, Vol. LNCS 10329, Takashi Yoshino, Takaya Yuizono, Gustavo Zurita, and Julita Vassileva (Eds). Springer, 14–21.",
      "doi": ""
    },
    {
      "text": "Diana Taylor. 2003. The archive and the repertoire: Cultural memory and performance in the Americas. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Andrew M. Webb, Chen Wang, Andruid Kerne, and Pablo Cesar. 2016. Distributed liveness: Understanding how new technologies transform performance experiences. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW. ACM, 432–37. 10.1145/2818048.2819974",
      "doi": "10.1145/2818048.2819974"
    }
  ]
}