{
  "doi": "10.1145/3411764.3445103",
  "title": "Getting Ourselves Together: Data-centered participatory design research & epistemic burden",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Data-centered participatory design research projects—wherein researchers collaborate with community members for the purpose of gathering, generating, or communicating data about the community or their causes—can place epistemic burdens on minoritized or racialized groups, even in projects focused on social justice outcomes. Analysis of epistemic burden encourages researchers to rethink the purpose and value of data in community organizing and activism more generally. This paper describes three varieties of epistemic burden drawn from two case studies based on the authors’ previous work with anti-police brutality community organizations. The authors conclude with a discussion of ways to alleviate and avoid these issues through a series of questions about participatory research design. Ultimately, we call for a reorientation of knowledge production away from putative design solutions to community problems and toward a more robust interrogation of the power dynamics of research itself.",
  "tags": [
    "Participatory Design",
    "Critical/Activism/Ethics"
  ],
  "authors": [
    {
      "name": "Jennifer Pierre",
      "institution": "University of California, Los Angeles, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659085587",
      "orcid": "missing"
    },
    {
      "name": "Roderic Crooks",
      "institution": "Department of Informatics University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658949854",
      "orcid": "missing"
    },
    {
      "name": "Morgan Currie",
      "institution": "University of Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210144",
      "orcid": "missing"
    },
    {
      "name": "Britt Paris",
      "institution": "Library and Information Science Rutgers University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701750",
      "orcid": "missing"
    },
    {
      "name": "Irene Pasquetto",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658950036",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sara Ahmed. 2007. A phenomenology of whiteness. Feminist Theory 8, 2 (Aug. 2007), 149–168. https://doi.org/10.1177/1464700107078139Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Michelle Alexander. 2012. The New Jim Crow: Mass Incarceration in the Age of Colorblindness. The New Press, New York.",
      "doi": ""
    },
    {
      "text": "Karl Baumann, Benjamin Stokes, François Bar, and Ben Caldwell. 2017. Infrastructures of the Imagination: Community Design for Speculative Urban Technologies. In Proceedings of the 8th International Conference on Communities and Technologies. ACM, Troyes France, 266–269. https://doi.org/10.1145/3083671.3083700",
      "doi": "10.1145/3083671.3083700"
    },
    {
      "text": "Christoph Becker, Ann Light, Chris Frauenberger, Dawn Walker, Victoria Palacin, Syed Ishtiaque Ahmed, Rachel Charlotte Smith, Pedro Reynolds Cuéllar, and David Nemer. 2020. Computing Professionals for Social Responsibility: The Past, Present and Future Values of Participatory Design. In Proceedings of the 16th Participatory Design Conference 2020-Participation (s) Otherwise-Volume 2. 181–184.",
      "doi": "10.1145/3384772.3385163"
    },
    {
      "text": "Ruha Benjamin. 2019. Race After Technology: Abolitionist Tools for the New Jim Code (1 edition ed.). Polity, Medford, MA.",
      "doi": ""
    },
    {
      "text": "Laura Benton, Asimina Vasalou, Rilla Khaled, Hilary Johnson, and Daniel Gooch. 2014. Diversity for design: a framework for involving neurodiverse children in the technology design process. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. ACM Press, Toronto, Ontario, Canada, 3747–3756. https://doi.org/10.1145/2556288.2557244",
      "doi": "10.1145/2556288.2557244"
    },
    {
      "text": "Nora Berenstain. 2016. Epistemic Exploitation. Ergo, an Open Access Journal of Philosophy 3 (2016). https://doi.org/10.3998/ergo.12405314.0003.022",
      "doi": ""
    },
    {
      "text": "Devorah Blachor. 2020. How to Use the Past Exonerative Tense to Uphold White Supremacy. https://www.mcsweeneys.net/articles/how-to-use-the-past-exonerative-tense-to-uphold-white-supremacy",
      "doi": ""
    },
    {
      "text": "Alan Borning and Michael Muller. 2012. Next Steps for Value Sensitive Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 1125–1134. https://doi.org/10.1145/2207676.2208560",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Tone Bratteteig and Ina Wagner. 2016. What is a participatory design result?. In Proceedings of the 14th Participatory Design Conference on Full papers - PDC ’16. ACM Press, Aarhus, Denmark, 141–150. https://doi.org/10.1145/2940299.2940316",
      "doi": "10.1145/2940299.2940316"
    },
    {
      "text": "Tom Clark. 2008. ‘We’re Over-Researched Here!’: Exploring Accounts of Research Fatigue within Qualitative Research Engagements. Sociology (Oct. 2008). https://doi.org/10.1177/0038038508094573Publisher: SAGE PublicationsSage UK: London, England.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design Justice: Community-Led Practices to Build the Worlds We Need. The MIT Press, Cambridge, MA.",
      "doi": "10.7551/mitpress/12255.001.0001"
    },
    {
      "text": "Roderic Crooks and Morgan E. Currie. 2021. Numbers Will Not Save Us: Agonistic Data Practices. The Information Society Forthcoming (2021).",
      "doi": ""
    },
    {
      "text": "Morgan Currie, Britt S. Paris, Irene Pasquetto, and Jennifer Pierre. 2016. The conundrum of police officer-involved homicides: Counter-data in Los Angeles County. Big Data & Society 3, 2 (Dec. 2016), 2053951716663566. https://doi.org/10.1177/2053951716663566",
      "doi": ""
    },
    {
      "text": "Lina Dencik, Arne Hintz, Joanna Redden, and Emiliano Treré. 2019. Exploring Data Justice: Conceptions, Applications and Directions. Information, Communication & Society 22, 7 (June 2019), 873–881. https://doi.org/10.1080/1369118X.2019.1606268Publisher: Routledge _eprint: https://doi.org/10.1080/1369118X.2019.1606268.",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio, Erhardt Graeff, Christina N Harrington, and Daniela K Rosner. 2020. Toward Equitable Participatory Design: Data Feminism for CSCW amidst Multiple Pandemics. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. 437–445.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo. 2015. Adversarial design. OCLC: 907512742.",
      "doi": ""
    },
    {
      "text": "Kristie Dotson. 2014. Conceptualizing Epistemic Oppression. Social Epistemology 28, 2 (April 2014), 115–138. https://doi.org/10.1080/02691728.2013.782585Publisher: Routledge _eprint: https://doi.org/10.1080/02691728.2013.782585.",
      "doi": ""
    },
    {
      "text": "Paul Dourish, Christopher Lawrence, Tuck Wah Leong, and Greg Wadley. 2020. On Being Iterated: The Affective Demands of Design Participation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3313831.3376545",
      "doi": "10.1145/3313831.3376545"
    },
    {
      "text": "Max Felker-Kantor. 2020. Liberal Law-and-Order: The Politics of Police Reform in Los Angeles. Journal of Urban History 46, 5 (Sept. 2020), 1026–1049. https://doi.org/10.1177/0096144217705462Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Reuben Fischer-Baum. 2014. Nobody Knows How Many Americans the Police Kill Each Year. http://fivethirtyeight.com/features/how-many-americans-the-police-kill-each-year/",
      "doi": ""
    },
    {
      "text": "Miranda Fricker. 2007. Epistemic Injustice: Power and the Ethics of Knowing. Oxford University Press, Oxford, UK. https://www.oxfordscholarship.com/view/10.1093/acprof:oso/9780198237907.001.0001/acprof-9780198237907 Publication Title: Epistemic Injustice.",
      "doi": ""
    },
    {
      "text": "Lisa Gitelman (Ed.). 2013. Raw Data Is An Oxymoron. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Erhardt Graeff. 2020. The Responsibility to Not Design and the Need for Citizen Professionalism. Computing Professionals for Social Responsibility: The Past, Present and Future Values of Participatory Design (May 2020). https://pdc2020cpsr.pubpub.org/pub/vizamy14/release/1 Publisher: PubPub.",
      "doi": ""
    },
    {
      "text": "Stuart Hall. 2001. Encoding/Decoding. In Media And Cultural Studies: Keyworks, Meenakshi Gigi Durham and Kellner (Eds.). Blackwell Publishing, Ltd., Malden, MA.",
      "doi": ""
    },
    {
      "text": "Christina Harrington, Sheena Erete, and Anne Marie Piper. 2019. Deconstructing Community-Based Collaborative Design: Towards More Equitable Participatory Design Engagements. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 216:1–216:25. https://doi.org/10.1145/3359318",
      "doi": "10.1145/3359318"
    },
    {
      "text": "Iain Hay and Samantha Muller. 2014. Questioning generosity in the golden age of philanthropy: Towards critical geographies of super-philanthropy. Progress in Human Geography 38, 5 (Oct. 2014), 635–653. https://doi.org/10.1177/0309132513500893Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Gillian R. Hayes. 2011. The Relationship of Action Research to Human-Computer Interaction. ACM Trans. Comput.-Hum. Interact. 18, 3, Article 15 (Aug. 2011), 20 pages. https://doi.org/10.1145/1993060.1993065",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "John Heron. 1996. Co-Operative Inquiry: Research Into the Human Condition. SAGE Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Sofia Hussain, Elizabet Sanders, and Martin Stienert. 2012. Participatory Design with Marginalized People in Developing Countries: Challenges and Opportunities Experienced in a Field Study in Cambodia. International Journal of Design 6, 2 (2012), 91–109.",
      "doi": ""
    },
    {
      "text": "Julia E Janes. 2016. Democratic encounters? Epistemic privilege, power, and community-based participatory action research. Action Research 14, 1 (March 2016), 72–87. https://doi.org/10.1177/1476750315579129Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Candice Lanius. 2015. Fact Check: Your Demand for Statistical Proof is Racist. https://thesocietypages.org/cyborgology/2015/01/12/fact-check-your-demand-for-statistical-proof-is-racist/",
      "doi": ""
    },
    {
      "text": "John Lehry. 2016. “Officer-Involved” Obfuscation. https://jacobinmag.com/2016/09/eula-love-officer-involved-shooting-black-lives-matter/",
      "doi": ""
    },
    {
      "text": "Audre Lorde. 1984. The Master’s Tools Will Never Dismantle the Master’s House. In Sister Outsider: Essays and Speeches. Crossing Press, Berkeley, CA, 110–114.",
      "doi": ""
    },
    {
      "text": "José Medina. 2013. The Epistemology of Resistance: Gender and Racial Oppression, Epistemic Injustice, and the Social Imagination. OUP USA. Google-Books-ID: j_nUeoyASq8C.",
      "doi": ""
    },
    {
      "text": "Toni Morrison. 1975. A Humanist View. https://www.mackenzian.com/wp-content/uploads/2014/07/Transcript_PortlandState_TMorrison.pdf",
      "doi": ""
    },
    {
      "text": "José Esteban Muñoz. 1999. Disidentifications: Queers of Color and the Performance of Politics. University of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "B.S. Olgado, L. Pei, S. Rana, K. Vasques, E. Partida, and Roderic Crooks. 2021. Response-able Ethics in Computer Science: Reflections on an NSF-REU Program. Computer Science Education Under Review (2021).",
      "doi": ""
    },
    {
      "text": "Britt S. Paris and Jennifer Pierre. 2017. Bad Data. https://culanth.org/fieldsights/1107-bad-data",
      "doi": ""
    },
    {
      "text": "Britt S. Paris and Jennifer Pierre. 2017. Naming Experience: Registering Resistance and Mobilizing Change with Qualitative Tools. InterActions: UCLA Journal of Education and Information Studies 13, 1(2017). https://escholarship.org/uc/item/02d9w4qd",
      "doi": ""
    },
    {
      "text": "James Pierce. 2012. Undesigning technology: considering the negation of design by design. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, Austin, Texas, USA, 957. https://doi.org/10.1145/2207676.2208540",
      "doi": "10.1145/2207676.2208540"
    },
    {
      "text": "Jenny Reardon, Jacob Metcalf, Martha Kenney, and Karen Barad. 2015. Science & Justice: The Trouble and the Promise. Catalyst: Feminism, Theory, Technoscience 1, 1 (Sept. 2015), 1–49. https://doi.org/10.28968/cftt.v1i1.28817Number: 1.",
      "doi": ""
    },
    {
      "text": "Rashida Richardson, Jason Schultz, and Kate Crawford. 2019. Dirty Data, Bad Predictions: How Civil Rights Violations Impact Police Data, Predictive Policing Systems, and Justice. SSRN Scholarly Paper ID 3333423. Social Science Research Network, Rochester, NY. https://papers.ssrn.com/abstract=3333423",
      "doi": ""
    },
    {
      "text": "Devansh Saxena, Erhardt Graeff, Shion Guha, EunJeong Cheon, Pedro Reynolds-Cuéllar, Dawn Walker, Christoph Becker, and Kenneth R Fleischmann. 2020. Collective Organizing and Social Responsibility at CSCW. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. 503–509.",
      "doi": "10.1145/3406865.3418593"
    },
    {
      "text": "Leigh Star and Geoffrey C. Bowker. 1999. Sorting Things Out: Classification and Its Consequences. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2000. Embodied Practices of Engineering Work. Mind, Culture, and Activity 7, 1-2 (May 2000), 4–18. https://doi.org/10.1080/10749039.2000.9677645Publisher: Routledge _eprint: https://doi.org/10.1080/10749039.2000.9677645.",
      "doi": ""
    },
    {
      "text": "John Vines, Rachel Clarke, Peter Wright, John McCarthy, and Patrick Olivier. 2013. Configuring Participation: On How We Involve People in Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 429–438. https://doi.org/10.1145/2470654.2470716",
      "doi": "10.1145/2470654.2470716"
    },
    {
      "text": "Tyreasa Washington, Theda Rose, Gia Colombo, Jun Sung Hong, and Stephanie Irby Coard. 2015. Family-level factors and African American children’s behavioral health outcomes: A systematic review. In Child & Youth Care Forum, Vol. 44. Springer, 819–834.",
      "doi": ""
    },
    {
      "text": "Xuecong Xu, Xiang Yan, and Tawanna R. Dillahunt. 2019. Reaching Hard-To-Reach Populations: An Analysis of Survey Recruitment Methods. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. ACM, Austin TX USA, 428–432. https://doi.org/10.1145/3311957.3359447",
      "doi": ""
    }
  ]
}