{
  "doi": "10.1145/3411764.3445672",
  "title": "Overlooking Context: How do Defaults and Framing Reduce Deliberation in Smart Home Privacy Decision-Making?",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2021,
  "badges": [],
  "abstract": "Research has demonstrated that users’ heuristic decision-making processes cause external factors like defaults and framing to influence the outcome of privacy decisions. Proponents of “privacy nudging” have proposed leveraging these effects to guide users’ decisions. Our research shows that defaults and framing not only influence the outcome of privacy decisions, but also the process of evaluating the contextual factors associated with the decision, effectively making the decision-making process more heuristic. In our analysis of an existing dataset of scenario-based smart home privacy decisions, we demonstrate that defaults and framing not only have a direct effect on participants’ decisions; they also moderate the effect of their cognitive appraisals of the presented scenarios on the decision. These results suggest that nudges like defaults and framing exacerbate the well-researched problem that people often employ heuristics rather than making deliberate privacy decisions, and that privacy-setting interfaces should avoid the effects of heuristic decision-making.",
  "tags": [
    "Smart Home IoT",
    "Privacy Decision Making",
    "Defaults and Framing"
  ],
  "authors": [
    {
      "name": "Paritosh Bahirat",
      "institution": "Clemson University, United States of America",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659248429",
      "orcid": "missing"
    },
    {
      "name": "Martijn Willemsen",
      "institution": "TU Eindhoven and Jheronimus Academy of Data Science, Netherlands",
      "img": "/do/10.1145/contrib-81444608032/rel-imgonly/martijn2011.jpg",
      "acmid": "81444608032",
      "orcid": "missing"
    },
    {
      "name": "Yangyang He",
      "institution": "Clemson University, United States of America",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659249794",
      "orcid": "missing"
    },
    {
      "name": "Qizhang Sun",
      "institution": "TU Eindhoven, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659247281",
      "orcid": "missing"
    },
    {
      "name": "Bart Knijnenburg",
      "institution": "Clemson University, United States of America",
      "img": "/do/10.1145/contrib-81548023386/rel-imgonly/dsc_7933.jpg",
      "acmid": "81548023386",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti. 2009. Nudging privacy: The behavioral economics of personal information. IEEE security & privacy 7, 6 (2009), 82–85.",
      "doi": "10.1109/MSP.2009.163"
    },
    {
      "text": "Alessandro Acquisti and Jens Grossklags. 2007. What can behavioral economics teach us about privacy. Digital privacy: theory, technologies and practices 18 (2007), 363–377.",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti, Leslie K John, and George Loewenstein. 2012. The impact of relative standards on the propensity to disclose. Journal of Marketing Research 49, 2 (2012), 160–174.",
      "doi": ""
    },
    {
      "text": "Idris Adjerid, Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2013. Sleights of privacy: Framing, disclosures, and the limits of transparency. In Proceedings of the ninth symposium on usable privacy and security. ACM, 9.",
      "doi": "10.1145/2501604.2501613"
    },
    {
      "text": "Reza Ghaiumy Anaraky, Bart P Knijnenburg, and Marten Risius. 2020. Exacerbating Mindless Compliance: The Danger of Justifications during Privacy Decision Making in the Context of Facebook Applications. AIS Transactions on Human-Computer Interaction 12, 2(2020), 70–95.",
      "doi": ""
    },
    {
      "text": "Reza Ghaiumy Anaraky, Tahereh Nabizadeh, Bart P Knijnenburg, and Marten Risius. 2018. Reducing Default and Framing Effects in Privacy Decision-Making. (2018).",
      "doi": ""
    },
    {
      "text": "Paritosh Bahirat, Yangyang He, Abhilash Menon, and Bart Knijnenburg. 2018. A data-driven approach to developing iot privacy-setting interfaces. In 23rd International Conference on Intelligent User Interfaces. ACM, 165–176.",
      "doi": "10.1145/3172944.3172982"
    },
    {
      "text": "Gianmarco Baldini, Maarten Botterman, Ricardo Neisse, and Mariachiara Tallacchini. 2018. Ethical design in the internet of things. Science and engineering ethics 24, 3 (2018), 905–925.",
      "doi": ""
    },
    {
      "text": "Rebecca Balebako, Pedro G Leon, Hazim Almuhimedi, Patrick Gage Kelley, Jonathan Mugan, Alessandro Acquisti, Lorrie Faith Cranor, and Norman Sadeh. 2011. Nudging users towards privacy on mobile devices. In Proc. CHI 2011 Workshop on Persuasion, Nudge, Influence and Coercion. Citeseer, 193–201.",
      "doi": ""
    },
    {
      "text": "J Balz, C Sunstein, and R Thaler. 2014. Choice architecture. E. Shafir, The behavioral foundations of public policy (2014), 428–439.",
      "doi": ""
    },
    {
      "text": "Gaurav Bansal, Fatemeh Mariam Zahedi, and David Gefen. 2016. Do context and personality matter? Trust and privacy concerns in disclosing private information online. Information & Management 53, 1 (2016), 1–21.",
      "doi": "10.5555/2873818.2873843"
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2016. Amazon’s Mechanical Turk: A new source of inexpensive, yet high-quality data?(2016).",
      "doi": ""
    },
    {
      "text": "Ramón Compañó and Wainer Lusoli. 2010. The policy maker’s anguish: Regulating personal data behavior between paradoxes and dilemmas. In Economics of Information Security and Privacy. Springer, 169–185.",
      "doi": ""
    },
    {
      "text": "Georgiana Craciun. 2018. Choice defaults and social consensus effects on online information sharing: The moderating role of regulatory focus. Computers in Human Behavior 88 (2018), 89–102.",
      "doi": ""
    },
    {
      "text": "Ratan Dey, Zubin Jelveh, and Keith Ross. 2012. Facebook users have become much more private: A large-scale study. In 2012 IEEE International Conference on Pervasive Computing and Communications Workshops. IEEE, 346–352.",
      "doi": ""
    },
    {
      "text": "Isaac Dinner, Eric J Johnson, Daniel G Goldstein, and Kaiya Liu. 2011. Partitioning default effects: why people choose not to choose.Journal of Experimental Psychology: Applied 17, 4 (2011), 332.",
      "doi": ""
    },
    {
      "text": "EU. 2016. Regulation (EU) 2016/679 of the European Parliament and the Council of 27 April 2016 on the protection of individuals with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC (General Data Protection Regulation). http://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32016R0679",
      "doi": ""
    },
    {
      "text": "Ralph Gross and Alessandro Acquisti. 2005. Information revelation and privacy in online social networks. In Proceedings of the 2005 ACM workshop on Privacy in the electronic society. ACM, 71–80.",
      "doi": "10.1145/1102199.1102214"
    },
    {
      "text": "Yangyang He, Paritosh Bahirat, Bart P Knijnenburg, and Abhilash Menon. 2019. A Data-Driven Approach to Designing for Privacy in Household IoT. ACM Transactions on Interactive Intelligent Systems (TiiS) 10, 1(2019), 1–47.",
      "doi": "10.1145/3331450"
    },
    {
      "text": "Jon M Jachimowicz, Shannon Duncan, Elke U Weber, and Eric J Johnson. 2017. When and why defaults influence decisions: A meta-analysis of default effects. Behavioural Public Policy(2017), 1–28.",
      "doi": ""
    },
    {
      "text": "Eric J Johnson, Steven Bellman, and Gerald L Lohse. 2002. Defaults, framing and privacy: Why opting in-opting out. Marketing Letters 13, 1 (2002), 5–15.",
      "doi": ""
    },
    {
      "text": "Eric J Johnson and Daniel Goldstein. 2003. Do defaults save lives?Science 302, 5649 (2003), 1338–1339.",
      "doi": ""
    },
    {
      "text": "Eric J Johnson, Gerald Häubl, and Anat Keinan. 2007. Aspects of endowment: a query theory of value construction.Journal of experimental psychology: Learning, memory, and cognition 33, 3(2007), 461.",
      "doi": ""
    },
    {
      "text": "Eric J Johnson, Suzanne B Shu, Benedict GC Dellaert, Craig Fox, Daniel G Goldstein, Gerald Häubl, Richard P Larrick, John W Payne, Ellen Peters, David Schkade, 2012. Beyond nudges: Tools of a choice architecture. Marketing Letters 23, 2 (2012), 487–504.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman and Amos Tversky. 2013. Prospect theory: An analysis of decision under risk. In Handbook of the fundamentals of financial decision making: Part I. World Scientific, 99–127.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy attitudes of mechanical turk workers and the us public. In 10th Symposium On Usable Privacy and Security ({SOUPS} 2014). 37–49.",
      "doi": "10.5555/3235838.3235842"
    },
    {
      "text": "Aniket Kittur, Ed H Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI conference on human factors in computing systems. 453–456.",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Bart Piet Knijnenburg. 2015. A user-tailored approach to privacy decision support. Ph.D. Dissertation. UC Irvine.",
      "doi": ""
    },
    {
      "text": "Bart Piet Knijnenburg and Alfred Kobsa. 2014. Increasing sharing tendency without reducing satisfaction: finding the best privacy-settings user interface for social networks. (2014).",
      "doi": ""
    },
    {
      "text": "Bart P. Knijnenburg, Alfred Kobsa, and Hongxia Jin. 2013. Counteracting the negative effect of form auto-completion on the privacy calculus. (2013).",
      "doi": ""
    },
    {
      "text": "Alfred Kobsa, Ramnath K Chellappa, and Sarah Spiekermann. 2006. Privacy-enhanced personalization. In CHI’06 extended abstracts on Human factors in computing systems. ACM, 1631–1634.",
      "doi": ""
    },
    {
      "text": "Yee-Lin Lai and Kai-Lung Hui. 2004. Opting-in or Opting-out on the Internet: Does it Really Matter?ICIS 2004 Proceedings(2004), 63.",
      "doi": ""
    },
    {
      "text": "Yee-Lin Lai and Kai-Lung Hui. 2006. Internet opt-in and opt-out: investigating the roles of frames, defaults and privacy concerns. In Proceedings of the 2006 ACM SIGMIS CPR conference on computer personnel research: Forty four years of computer personnel research: achievements, challenges & the future. ACM, 253–263.",
      "doi": "10.1145/1125170.1125230"
    },
    {
      "text": "Scott Lederer, Jennifer Mankoff, and Anind K. Dey. 2003. Who Wants to Know What when? Privacy Preference Determinants in Ubiquitous Computing. In CHI ’03 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’03). ACM, New York, NY, USA, 724–725. https://doi.org/10.1145/765891.765952event-place: Ft. Lauderdale, Florida, USA.",
      "doi": ""
    },
    {
      "text": "Irwin P Levin. 1987. Associative effects of information framing. Bulletin of the psychonomic society 25, 2 (1987), 85–86.",
      "doi": ""
    },
    {
      "text": "Chris Lu. 2014. Overview of security and privacy issues in the internet of things. Internet of Things (IoT): A vision, Architectural Elements, and Future Directions (2014).",
      "doi": ""
    },
    {
      "text": "Brigitte C Madrian and Dennis F Shea. 2001. The power of suggestion: Inertia in 401 (k) participation and savings behavior. The Quarterly journal of economics 116, 4 (2001), 1149–1187.",
      "doi": ""
    },
    {
      "text": "Naresh K Malhotra, Sung S Kim, and James Agarwal. 2004. Internet users’ information privacy concerns (IUIPC): The construct, the scale, and a causal model. Information systems research 15, 4 (2004), 336–355.",
      "doi": ""
    },
    {
      "text": "Craig RM McKenzie, Michael J Liersch, and Stacey R Finkelstein. 2006. Recommendations implicit in policy defaults. Psychological Science 17, 5 (2006), 414–420.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Wash. L. Rev. 79(2004), 119.",
      "doi": ""
    },
    {
      "text": "Patricia A Norberg, Daniel R Horne, and David A Horne. 2007. The privacy paradox: Personal information disclosure intentions versus behaviors. Journal of consumer affairs 41, 1 (2007), 100–126.",
      "doi": "10.1111/j.1745-"
    },
    {
      "text": "Sameer Patil and Jennifer Lai. 2005. Who Gets to Know What when: Configuring Privacy Permissions in an Awareness Application. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’05). ACM, New York, NY, USA, 101–110. https://doi.org/10.1145/1054972.1054987event-place: Portland, Oregon, USA.",
      "doi": "10.1145/1054972.1054987"
    },
    {
      "text": "Andreas Pfitzmann and Marit Köhntopp. 2001. Anonymity, unobservability, and pseudonymity—a proposal for terminology. In Designing privacy enhancing technologies. Springer, 1–9.",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Bastian Könings, and Michael Weber. 2015. Context-adaptive privacy: Leveraging context awareness to support privacy decision making. IEEE Pervasive Computing 14, 1 (2015), 34–43.",
      "doi": "10.1109/MPRV.2015.5"
    },
    {
      "text": "Norbert Schwarz and Gerald L Clore. 2007. Feelings and phenomenal experiences.(2007).",
      "doi": ""
    },
    {
      "text": "Shlomi Sher and Craig R. M. McKenzie. 2006. Information leakage from logically equivalent frames. Cognition 101, 3 (Oct. 2006), 467–494. https://doi.org/10.1016/j.cognition.2005.11.001",
      "doi": ""
    },
    {
      "text": "N Craig Smith, Daniel G Goldstein, and Eric J Johnson. 2013. Choice without awareness: Ethical and policy implications of defaults. Journal of Public Policy & Marketing 32, 2 (2013), 159–172.",
      "doi": ""
    },
    {
      "text": "Daniel J Solove. 2012. Introduction: Privacy self-management and the consent dilemma. Harv. L. Rev. 126(2012), 1880.",
      "doi": ""
    },
    {
      "text": "Frederic D Stutzman, Ralph Gross, and Alessandro Acquisti. 2013. Silent listeners: The evolution of privacy and disclosure on facebook. Journal of privacy and confidentiality 4, 2 (2013), 2.",
      "doi": ""
    },
    {
      "text": "Alanoud Subahi and George Theodorakopoulos. 2018. Ensuring compliance of IoT devices with their Privacy Policy Agreement. In 2018 IEEE 6th International Conference on Future Internet of Things and Cloud (FiCloud). IEEE, 100–107.",
      "doi": ""
    },
    {
      "text": "Cass R Sunstein. 2014. Why nudge?: The politics of libertarian paternalism. Yale University Press.",
      "doi": ""
    },
    {
      "text": "Keith S Taber. 2018. The use of Cronbach’s alpha when developing and reporting research instruments in science education. Research in Science Education 48, 6 (2018), 1273–1296.",
      "doi": ""
    },
    {
      "text": "Richard H Thaler and Cass R Sunstein. 2009. Nudge: Improving decisions about health, wealth, and happiness. Penguin.",
      "doi": ""
    },
    {
      "text": "Vassilios S Verykios, Elisa Bertino, Igor Nai Fovino, Loredana Parasiliti Provenza, Yucel Saygin, and Yannis Theodoridis. 2004. State-of-the-art in privacy preserving data mining. ACM Sigmod Record 33, 1 (2004), 50–57.",
      "doi": "10.1145/974121.974131"
    },
    {
      "text": "Na Wang, Pamela Wisniewski, Heng Xu, and Jens Grossklags. 2014. Designing the default privacy settings for facebook applications. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 249–252.",
      "doi": "10.1145/2556420.2556495"
    },
    {
      "text": "Bruce D Weinberg, George R Milne, Yana G Andonova, and Fatima M Hajjat. 2015. Internet of Things: Convenience vs. privacy and secrecy. Business Horizons 58, 6 (2015), 615–624.",
      "doi": ""
    },
    {
      "text": "Meredydd Williams, Jason RC Nurse, and Sadie Creese. 2016. The perfect storm: The privacy paradox and the Internet-of-Things. In 2016 11th International Conference on Availability, Reliability and Security (ARES). IEEE, 644–652.",
      "doi": ""
    },
    {
      "text": "Meredydd Williams, Jason RC Nurse, and Sadie Creese. 2017. Privacy is the boring bit: user perceptions and behaviour in the Internet-of-Things. In 2017 15th Annual Conference on Privacy, Security and Trust (PST). IEEE, 181–18109.",
      "doi": ""
    },
    {
      "text": "Chin-Shan Wu and Fei-Fei Cheng. 2011. The joint effect of framing and anchoring on internet buyers’ decision-making. Electronic Commerce Research and Applications 10, 3(2011), 358–368.",
      "doi": "10.1016/j.elerap.2011.01.002"
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Smirity Kaushik, and Yang Wang. 2019. Defending My Castle: A Co-Design Study of Privacy Mechanisms for Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 198.",
      "doi": "10.1145/3290605.3300428"
    },
    {
      "text": "Ka-Ping Yee. 2002. User interaction design for secure systems. In International Conference on Information and Communications Security. Springer, 278–290.",
      "doi": ""
    },
    {
      "text": "Tianlong Yu, Vyas Sekar, Srinivasan Seshan, Yuvraj Agarwal, and Chenren Xu. 2015. Handling a trillion (unfixable) flaws on a billion devices: Rethinking network security for the internet-of-things. In Proceedings of the 14th ACM Workshop on Hot Topics in Networks. ACM, 5.",
      "doi": "10.1145/2834050.2834095"
    }
  ]
}