{
  "doi": "10.1145/3411764.3445087",
  "title": "StoryMap: Using Social Modeling and Self-Modeling to Support Physical Activity Among Families of Low-SES Backgrounds",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Physical activity (PA) is crucial for reducing the risk of obesity, an epidemic that disproportionately burdens families of low-socioeconomic status (SES). While fitness tracking tools can increase PA awareness, more work is needed to examine (1) how such tools can help people benefit from their social environment, and (2) how reflections can help enhance PA attitudes. We investigated how fitness tracking tools for families can support social modeling and self-modeling (through reflection), two critical processes in Social Cognitive Theory. We developed StoryMap, a novel fitness tracking app for families aimed at supporting both modes of modeling. Then, we conducted a five-week qualitative study evaluating StoryMap with 16 low-SES families. Our findings contribute an understanding of how social and self-modeling can be implemented in fitness tracking tools and how both modes of modeling can enhance key PA attitudes: self-efficacy and outcome expectations. Finally, we propose design recommendations for social personal informatics tools.",
  "authors": [
    {
      "name": "Herman Saksono",
      "institution": "Harvard University, United States",
      "img": "/do/10.1145/contrib-99658691732/rel-imgonly/saksono_herman-indeximage.jpg",
      "acmid": "99658691732",
      "orcid": "missing"
    },
    {
      "name": "Carmen Castaneda-Sceppa",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658689022",
      "orcid": "missing"
    },
    {
      "name": "Jessica A. Hoffman",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658690513",
      "orcid": "missing"
    },
    {
      "name": "Magy Seif El-Nasr",
      "institution": "University of California at Santa Cruz,, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502694399",
      "orcid": "0000-0002-7808-1686"
    },
    {
      "name": "Andrea Parker",
      "institution": "School of Interactive Computing, Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556858356",
      "orcid": "0000-0002-2362-7717"
    }
  ],
  "references": [
    {
      "text": "Phil Adams, Eric P.S. Baumer, and Geri Gay. 2014. Staccato social support in mobile health applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’14), 653–662. https://doi.org/10.1145/2556288.2557297",
      "doi": "10.1145/2556288.2557297"
    },
    {
      "text": "Deemah Alqahtani, Caroline Jay, and Markel Vigo. 2020. The Effect of Goal Moderation on the Achievement and Satisfaction of Physical Activity Goals. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 4. https://doi.org/10.1145/3432209",
      "doi": "10.1145/3432209"
    },
    {
      "text": "Albert Bandura. 1986. Social foundations of thought and action: A social cognitive theory. Prentice Hall, Englewood Cliffs, NJ. https://doi.org/10.1037/13273-005",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1997. Self-efficacy: the exercise of control. W.H. Freeman and Company, New York. https://doi.org/10.5860/choice.35-1826",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1998. Health promotion from the perspective of social cognitive theory. Psychology and Health 13, 4: 623–649. https://doi.org/10.1080/08870449808407422",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 1999. Social cognitive theory: An agentic perspective. Asian Journal of Social Psychology 2: 21–41. https://doi.org/10.1111/1467-839X.00024",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2001. Social Cognitive Theory of Mass Communication. Media Psychology 3, 3: 265–299. https://doi.org/10.1207/S1532785XMEP0303_03",
      "doi": ""
    },
    {
      "text": "Roy F. Baumeister and Mark R. Leary. 1995. The Need to Belong: Desire for Interpersonal Attachments as a Fundamental Human Motivation Roy. Psychological Bulletin 117, 3: 497–529. https://doi.org/10.1037/0033-2909.117.3.497",
      "doi": ""
    },
    {
      "text": "Eric P S Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI 2015, 585–594. https://doi.org/10.1145/2702123.2702234",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, and Peter Stephenson. 2013. Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Transactions on Computer-Human Interaction 20, 5: 1–27. https://doi.org/10.1145/2503823",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Martine A.H. Braaksma, Gert Rijlaarsdama, and Huub Van Den Bergh. 2002. Observational learning and the effects of model-observer similarity. Journal of Educational Psychology 94, 2: 405–415. https://doi.org/10.1037/0022-0663.94.2.405",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017. Understanding Self-Reflection: How People Reflect on Personal Data Through Visual Data Exploration. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth ’17). https://doi.org/10.1145/3154862.3154881",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Chia-Fang Chung, Elena Agapie, Jessica Schroeder, Sonali Mishra, James Fogarty, and Sean A Munson. 2017. When Personal Tracking Becomes Social: Examining the Use of Instagram for Healthy Eating. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). https://doi.org/10.1145/3025453.3025747",
      "doi": "10.1145/3025453.3025747"
    },
    {
      "text": "J. Clawson, J. Pater, A. Miller, E. Mynatt, and L. Mamykina. 2015. No longer wearing: investigating the abandonment of personal health-tracking technologies on craigslist. In ACM International Joint Conference on Pervasive and Ubiquitous Computing, 647–658. https://doi.org/10.1145/2750858.2807554",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W. McDonald, and James A. Landay. 2009. Goal-setting considerations for persuasive technologies that encourage physical activity. In Proceedings of the 4th International Conference on Persuasive Technology - Persuasive ’09, 1. https://doi.org/10.1145/1541948.1541960",
      "doi": ""
    },
    {
      "text": "Sunny Consolvo, David W Mcdonald, Tammy Toscos, Mike Y Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony Lamarca, Louis Legrand, Ryan Libby, Ian Smith, and James A Landay. 2008. Activity Sensing in the Wild: A Field Trial of UbiFit Garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI 2008, 1797–1806. https://doi.org/10.1145/1357054.1357335",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Nediyana Daskalova, Bongshin Lee, Jeff Huang, Chester Ni, and Jessica Lundin. 2018. Investigating the Effectiveness of Cohort-Based Sleep Recommendations. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol 2, 3, Article 101 (September 2018): 1–19. https://doi.org/10.1145/3264911",
      "doi": "10.1145/3264911"
    },
    {
      "text": "Kristen Day. 2006. Active Living and Social Justice. Journal of American Planning Association 72, 1",
      "doi": ""
    },
    {
      "text": "Jill P. Dimond, Michaelanne Dye, Daphne Larose, and Amy S. Bruckman. 2013. Hollaback!: The role of collective storytelling online in a social movement organization. In Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW ’13), 477–489. https://doi.org/10.1145/2441776.2441831",
      "doi": ""
    },
    {
      "text": "Peter W. Dowrick. 1999. A review of self modeling and related interventions. Applied and Preventive Psychology 8, 1: 23–39. https://doi.org/10.1016/S0962-1849(99)80009-2",
      "doi": ""
    },
    {
      "text": "Chris Elsden, David S Kirk, and Abigail C Durrant. 2015. A Quantified Past: Toward Design for Remembering With Personal Informatics. Human-Computer Interaction 0024, June: 1–40. https://doi.org/10.1080/07370024.2015.1093422",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Mira Dontcheva, James Fogarty, and Sean A. Munson. 2020. Yarn: Adding meaning to shared personal data through structured storytelling. In Proceedings of Graphics Interface 2020. https://doi.org/10.20380/GI2020.18",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A lived informatics model of personal informatics. In UbiComp 2015 - Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 731–742. https://doi.org/10.1145/2750858.2804250",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Daniel Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean Munson. 2014. Taming Data Complexity in Lifelogs: Exploring Visual Cuts of Personal Informatics Data. DIS ’14 Proceedings of the 2014 conference on Designing interactive systems: 667–676. https://doi.org/10.1145/2598510.2598558",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Clayton Feustel, Shyamak Aggarwal, Bongshin Lee, and Lauren Wilcox. 2018. People Like Me: Designing for Reflection on Aggregate Cohort Data in Personal Informatics Systems. Proc. ACMInteract. Mob. Wearable Ubiquitous Technol. 2, 2, 3, Article 107 (September 2018): 1–21. https://doi.org/10.1145/3264917",
      "doi": "10.1145/3264917"
    },
    {
      "text": "Jim Gemmell, Aleks Aris, and Roger Lueder. 2005. Telling stories with MyLifeBits. IEEE International Conference on Multimedia and Expo, ICME 2005 2005: 1536–1539. https://doi.org/10.1109/ICME.2005.1521726",
      "doi": ""
    },
    {
      "text": "Thomas R. George, Deborah L. Feltz, and Melissa A. Chase. 2016. Effects of Model Similarity on Self-Efficacy and Muscular Endurance: A Second Look. Journal of Sport and Exercise Psychology 14, 3: 237–248. https://doi.org/10.1123/jsep.14.3.237",
      "doi": ""
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2015. How Do We Engage With Activity Trackers? A Longitudinal Study of Habito. In UbiComp 2015 - Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 1305–1316. https://doi.org/10.1145/2750858.2804290",
      "doi": "10.1145/2750858.2804290"
    },
    {
      "text": "Andrea Grimes, Martin Bednar, Jay David Bolter, and Rebecca E Grinter. 2008. EatWell: Sharing Nutrition-Related Memories in a Low-Income Community. In Proceedings of the 2008 ACM conference on Computer Supported Cooperative Work (CSCW ’08). https://doi.org/10.1145/1460563.1460579",
      "doi": "10.1145/1460563.1460579"
    },
    {
      "text": "Sabrina L Gustafson and Ryan E Rhodes. 2006. Parental correlates of physical activity in children and early adolescents. Sports Medicine 36, 1: 79–97. https://doi.org/10.2165/00007256-200636010-00006",
      "doi": ""
    },
    {
      "text": "Carol Haigh and Pip Hardy. 2011. Tell Me a Story—A Conceptual Exploration of Storytelling in Healthcare Education. Nurse Education Today 31",
      "doi": ""
    },
    {
      "text": "Eric B. Hekler, Predrag Klasnja, Jon E. Froehlich, and Matthew P. Buman. 2013. Mind the theoretical gap: Interpreting, using, and developing behavioral theory in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), 3307–3316. https://doi.org/10.1145/2470654.2466452",
      "doi": ""
    },
    {
      "text": "Klazine Van Der Horst, Marijke J.Chin A. Paw, Jos W.R. Twisk, and Willem Van Mechelen. 2007. A brief review on correlates of physical activity and sedentariness in youth. Medicine and Science in Sports and Exercise 39, 8: 1241–1250. https://doi.org/10.1249/mss.0b013e318059bf35",
      "doi": ""
    },
    {
      "text": "Judith A. Howard and Daniel G. Renfrow. 2014. Intersectionality. In Handbook of the Social Psychology of Inequality, Edward J. Schwalbe, Michael McLeod and Jane D. Lawler (eds.). Springer, 749. https://doi.org/10.1007/978-94-017-9002-4",
      "doi": ""
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the past: How Technology Mediated Reflection Improves Well-Being. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13). https://doi.org/10.1145/2470654.2466137",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Ntwa Katule, Melissa Densmore, and Ulrike Rivett. 2016. Leveraging intermediated interactions to support utilization of persuasive personal health informatics. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development (ICTD ’16), 1–11. https://doi.org/10.1145/2909609.2909664",
      "doi": "10.1145/2909609.2909664"
    },
    {
      "text": "Ntwa Katule, Ulrike Rivett, and Melissa Densmore. 2016. A Family Health App: Engaging Children to Manage Wellness of Adults. In Proceedings of the 7th Annual Symposium on Computing for Development, 1–10. https://doi.org/10.1145/3001913.3001920",
      "doi": "10.1145/3001913.3001920"
    },
    {
      "text": "Elisabeth T. Kersten-van Dijk and Wijnand A. IJsselsteijn. 2016. Design beyond the numbers: Sharing, comparing, storytelling and the need for a quantified us. Interaction Design and Architecture(s) 29, 1: 121–135",
      "doi": ""
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to evaluate technologies for health behavior change in HCI research. In Proceedings of the 2011 Annual Conference on Human Factors in Computing Systems - CHI ’11, 3063. https://doi.org/10.1145/1978942.1979396",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Predrag Klasnja, Shawna Smith, Nicholas J. Seewald, Andy Lee, Kelly Hall, Brook Luers, Eric B. Hekler, and Susan A. Murphy. 2019. Efficacy of contextually tailored suggestions for physical activity: A micro-randomized optimization trial of heart steps. Annals of Behavioral Medicine 53, 6: 573–582. https://doi.org/10.1093/abm/kay067",
      "doi": ""
    },
    {
      "text": "Rafal Kocielnik, Lillian Xiao, Daniel Avrahami, and Gary Hsieh. 2018. Reflection Companion: A Conversational System for Engaging Users in Reflection on Physical Activity. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol Article 2, 70: 261145–3214273. https://doi.org/10.1145/3214273",
      "doi": ""
    },
    {
      "text": "David A. Kolb. 1984. Experiential Learning: Experience as the Source of Learning and Development. FT press. https://doi.org/10.1016/B978-0-7506-7223-8.50017-4",
      "doi": ""
    },
    {
      "text": "Shiriki Kumanyika and Sonya Grier. 2006. Targeting interventions for ethnic minority and low-income populations. The Future of Children 16, 1: 187–207. Retrieved from http://www.ncbi.nlm.nih.gov/pubmed/16532664",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Junsung Kim, Jodi Forlizzi, and Sara Kiesler. 2015. Personalization revisited: A reflective approach helps people better personalize health services and motivates them to increase physical activity. UbiComp 2015 - Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing: 743–754. https://doi.org/10.1145/2750858.2807552",
      "doi": "10.1145/2750858.2807552"
    },
    {
      "text": "Ian Li, A Dey, and J Forlizzi. 2010. A Stage-Based Model of Personal Informatics Systems. CHI 2010: 557–566. https://doi.org/10.1145/1753326.1753409",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "James J Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B Strub. 2006. Fish'n’Steps: Encouraging Physical Activity with an Interactive Computer Game. In Ubicomp 2006, 261–278. https://doi.org/10.1007/11853565_16",
      "doi": ""
    },
    {
      "text": "Lena Mamykina and E Mynatt. 2008. MAHI: investigation of social scaffolding for reflective thinking in diabetes management. In CHI 2008, 477–486. https://doi.org/10.1145/1357054.1357131",
      "doi": "10.1145/1357054.1357131"
    },
    {
      "text": "M. Marathe, Jacki O'Neill, Paromita Pain, and William Thies. 2015. Revisiting CGNet Swara and its Impact in Rural India. ACM International Conference Proceeding Series 15. https://doi.org/10.1145/2737856.2738026",
      "doi": "10.1145/2737856.2738026"
    },
    {
      "text": "Gabriela Marcu, Karina Caro, Meghan M Plank, and Andrea M Barsevick. 2018. Bounce: Designing a Physical Activity Intervention for Breast Cancer Survivors. In PervasiveHealth ’18. https://doi.org/10.1145/3240925.3240927",
      "doi": ""
    },
    {
      "text": "Karen S. Meaney, L. Kent Griffin, and Melanie A. Hart. 2005. The effect of model similarity on girls’ motor performance. Journal of Teaching in Physical Education 24, 2: 165–178. https://doi.org/10.1123/jtpe.24.2.165",
      "doi": ""
    },
    {
      "text": "Lydia Michie, Madeline Balaam, John McCarthy, Timur Osadchiy, and Kellie Morrissey. 2018. From Her Story, to Our Story: Digital Storytelling as Public Engagement around Abortion Rights Advocacy in Ireland. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–15. https://doi.org/10.1145/3173574.3173931",
      "doi": "10.1145/3173574.3173931"
    },
    {
      "text": "Andrew D. Miller and Elizabeth D. Mynatt. 2014. StepStream: A School-based Pervasive Social Fitness System for Everyday Adolescent Health. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems - CHI ’14, 2823–2832. https://doi.org/10.1145/2556288.2557190",
      "doi": ""
    },
    {
      "text": "Sean Munson and Sunny Consolvo. 2012. Exploring Goal-setting, Rewards, Self-monitoring, and Sharing to Motivate Physical Activity. In 6th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth) and Workshops, 25–32. https://doi.org/10.4108/icst.pervasivehealth.2012.248691",
      "doi": ""
    },
    {
      "text": "National Center for Health Statistics. 2017. Health, United States, 2016: With Chartbook on Long-term Trends in Health. Hyattsville, MD.",
      "doi": ""
    },
    {
      "text": "S Tejaswi Peesapati, Victoria Schwanda, Johnathon Schultz, Matt Lepage, So-yae Jeong, and Dan Cosley. 2010. Pensieve: Supporting Everyday Reminiscence. In CHI 2010, 2027–2036. https://doi.org/10.1145/1753326.1753635",
      "doi": "10.1145/1753326.1753635"
    },
    {
      "text": "Kenneth E. Powell, Abby C. King, David M. Buchner, Wayne W. Campbell, Loretta DiPietro, Kirk I. Erickson, Charles H. Hillman, John M. Jakicic, Kathleen F. Janz, Peter T. Katzmarzyk, William E. Kraus, Richard F. Macko, David X. Marquez, Anne McTiernan, Russell R. Pate, Linda S. Pescatello, and Melicia C. Whitt-Glover. 2019. The scientific foundation for the physical activity guidelines for Americans, 2nd edition. Journal of Physical Activity and Health 16, 1: 1–11. https://doi.org/10.1123/jpah.2018-0618",
      "doi": ""
    },
    {
      "text": "Aare Puussaar, Adrian K Clear, and Peter Wright. 2017. Enhancing Personal Informatics Through Social Sensemaking. In CHI ’17 Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3025453.3025804",
      "doi": ""
    },
    {
      "text": "J. J. Reilly and J. Kelly. 2011. Long-term impact of overweight and obesity in childhood and adolescence on morbidity and premature mortality in adulthood: Systematic review. International Journal of Obesity 35, 7: 891–898. https://doi.org/10.1038/ijo.2010.222",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner and Kimiko Ryokai. 2008. Spyn: Augmenting knitting to support storytelling and reflection. UbiComp 2008 - Proceedings of the 10th International Conference on Ubiquitous Computing: 340–349. https://doi.org/10.1145/1409635.1409682",
      "doi": ""
    },
    {
      "text": "Herman Saksono, Amanda Carriero, Arushi Singh, and Andrea G. Parker. Storywell Storybooks. Retrieved December 18, 2020 from https://github.com/WellnessLab/storywell_content",
      "doi": ""
    },
    {
      "text": "Herman Saksono, Carmen Castaneda-sceppa, Jessica Hoffman, Magy Seif El-nasr, Vivien Morris, and Andrea G. Parker. 2018. Family Health Promotion in Low-SES Neighborhoods: A Two-Month Study of Wearable Activity Tracking. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18, 1–13. https://doi.org/10.1145/3173574.3173883",
      "doi": ""
    },
    {
      "text": "Herman Saksono, Carmen Castaneda-Sceppa, Jessica Hoffman, Vivien Morris, Magy Seif El-Nasr, and Andrea G Parker. 2020. Storywell: Designing for Family Fitness App Motivation by Using Social Rewards and Reflection. In CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2020). https://doi.org/10.1145/3313831.3376686",
      "doi": "10.1145/3313831.3376686"
    },
    {
      "text": "Herman Saksono, Carmen Castaneda-Sceppa, Jessica Hoffman, Magy Seif El-Nasr, Vivien Morris, and Andrea G Parker. 2019. Social Reflections on Fitness Tracking Data: A Study with Families in Low-SES Neighborhoods. In CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019), 14. https://doi.org/10.1145/3290605.3300543",
      "doi": "10.1145/3290605.3300543"
    },
    {
      "text": "Herman Saksono and Andrea G. Parker. Storywell Android. Retrieved January 3, 2020 from https://github.com/WellnessLab/storywell_android",
      "doi": ""
    },
    {
      "text": "Herman Saksono and Andrea Grimes Parker. 2017. Reflective Informatics Through Family Storytelling: Self-discovering Physical Activity Predictors. In Proceedings of the 2017 ACM Conference on Human Factors in Computing Systems - CHI ’17, 5232–5244. https://doi.org/10.1145/3025453.3025651",
      "doi": "10.1145/3025453.3025651"
    },
    {
      "text": "Herman Saksono, Ashwini Ranade, Geeta Kamarthi, Carmen Castaneda-Sceppa, Jessica A. Hoffman, Cathy Wirth, and Andrea G. Parker. 2015. Spaceship Launch: Designing a Collaborative Exergame for Families. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’15, 1776–1787. https://doi.org/10.1145/2675133.2675159",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr, Shree Durga, Mariya Shiyko, and Carmen Sceppa. 2015. Data-Driven Retrospective Interviewing (DDRI): A proposed methodology for formative evaluation of pervasive games. Entertainment Computing 11: 1–19. https://doi.org/10.1016/j.entcom.2015.07.002",
      "doi": ""
    },
    {
      "text": "Daniel G. Solórzano and Tara J. Yosso. 2002. Critical Race Methodology: Counter-Storytelling as an Analytical Framework for Education Research. Qualitative Inquiry 8, 1: 23–44. https://doi.org/10.1177/107780040200800103",
      "doi": ""
    },
    {
      "text": "Elizabeth Stowell, Mercedes C Lyson, Herman Saksono, Reneé C Wurth, Holly Jimison, Misha Pavel, and Andrea G Parker. 2018. Designing and Evaluating mHealth Interventions for Vulnerable Populations: A Systematic Review. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1–17. https://doi.org/10.1145/3173574.3173589",
      "doi": "10.1145/3173574.3173589"
    },
    {
      "text": "Stewart G Trost, Neville Owen, Adrian E Bauman, James F Sallis, and Wendy Brown. 2002. Correlates of adults’ participation in physical activity: review and update. Medicine & Science in Sports & Exercise 34, 12: 1996–2001. https://doi.org/10.1249/01.MSS.0000038974.76900.92",
      "doi": ""
    },
    {
      "text": "Amna Umer, George A Kelley, Lesley E Cottrell, Peter Giacobbi Jr, Kim E Innes, and Christa L Lilly. 2009. Childhood obesity and adult cardiovascular disease risk: a systematic review. BMC Public Health (2017) 17, 683: 1–11. https://doi.org/10.1038/ijo.2009.61",
      "doi": ""
    },
    {
      "text": "Joanne V. Wood. 1989. Theory and Research Concerning Social Comparisons of Personal Attributes. Psychological Bulletin 106, 2: 231–248. https://doi.org/10.1037/0033-2909.106.2.231",
      "doi": ""
    }
  ]
}