{
  "doi": "10.1145/3411764.3445508",
  "title": "Sketchnote Components, Design Space Dimensions, and Strategies for Effective Visual Note Taking",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Sketchnoting is a form of visual note taking where people listen to, synthesize, and visualize ideas from a talk or other event using a combination of pictures, diagrams, and text. Little is known about the design space of this kind of visual note taking. With an eye towards informing the implementation of digital equivalents of sketchnoting, inking, and note taking, we introduce a classification of sketchnote styles and techniques, with a qualitative analysis of 103 sketchnotes, and situated in context with six semi-structured follow up interviews. Our findings distill core sketchnote components (content, layout, structuring elements, and visual styling) and dimensions of the sketchnote design space, classifying levels of conciseness, illustration, structure, personification, cohesion, and craftsmanship. We unpack strategies to address particular note taking challenges, for example dealing with constraints of live drawings, and discuss relevance for future digital inking tools, such as recomposition, styling, and design suggestions.",
  "authors": [
    {
      "name": "Rebecca Zheng",
      "institution": "Mumbli, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701549",
      "orcid": "missing"
    },
    {
      "name": "Marina Fernández Camporro",
      "institution": "University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526467",
      "orcid": "missing"
    },
    {
      "name": "Hugo Romat",
      "institution": "ETH, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658993819",
      "orcid": "0000-0002-9194-8889"
    },
    {
      "name": "Nathalie Henry Riche",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502798938",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Bach",
      "institution": "School of Informatics Edinburgh University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482661013",
      "orcid": "0000-0002-9201-7744"
    },
    {
      "name": "Fanny Chevalier",
      "institution": "Department of Computer Science and Statistical Sciences University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81325488036",
      "orcid": "0000-0002-5585-7971"
    },
    {
      "name": "Ken Hinckley",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519448",
      "orcid": "0000-0002-4733-4927"
    },
    {
      "name": "Nicolai Marquardt",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81324491951/rel-imgonly/portraitnic3.jpg",
      "acmid": "81324491951",
      "orcid": "0000-0002-5473-2448"
    }
  ],
  "references": [
    {
      "text": "Michelle Annett, Fraser Anderson, Walter F. Bischof, and Anoop Gupta. 2014. The Pen is Mightier: Understanding Stylus Behaviour While Inking on Tablets. In Proceedings of Graphics Interface 2014(GI ’14). Canadian Information Processing Society, Toronto, Ont., Canada, Canada, 193–200. event-place: Montreal, Quebec, Canada.",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L. Cox. 2018. Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 28:1–28:14. https://doi.org/10.1145/3173574.3173602 event-place: Montreal QC, Canada.",
      "doi": "10.1145/3173574.3173602"
    },
    {
      "text": "Benjamin Bach, Zezhong Wang, Matteo Farinella, Dave Murray-Rust, and Nathalie Henry Riche. 2018. Design Patterns for Data Comics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 38:1–38:12. https://doi.org/10.1145/3173574.3173612 event-place: Montreal QC, Canada.",
      "doi": "10.1145/3173574.3173612"
    },
    {
      "text": "Mark Baskinger. 2008. Pencils Before Pixels: A Primer in Hand-generated Sketching. interactions 15, 2 (March 2008), 28–36. https://doi.org/10.1145/1340961.1340969",
      "doi": ""
    },
    {
      "text": "Craighton Berman. 2011. Sketchnotes 101: The Basics of Visual Note-taking. https://www.core77.com//posts/19678/Sketchnotes-101-The-Basics-of-Visual-Note-taking",
      "doi": ""
    },
    {
      "text": "Michael Bernstein, Max Van Kleek, David Karger, and M. C. Schraefel. 2008. Information scraps: How and why information eludes our personal information management tools. ACM Transactions on Information Systems 26, 4 (Oct. 2008), 24:1–24:46. https://doi.org/10.1145/1402256.1402263",
      "doi": "10.1145/1402256.1402263"
    },
    {
      "text": "L. Bollini. 2017. Drawing as learning enabling meta-language. using sketch-noting in the field of education. In ICERI2017 Proceedings (Seville, Spain) (10th annual International Conference of Education, Research and Innovation). IATED, Spain, 8030–8036. https://doi.org/10.21125/iceri.2017.2144",
      "doi": ""
    },
    {
      "text": "Michelle A. Borkin, Azalea A. Vo, Zoya Bylinskii, Phillip Isola, Shashank Sunkavalli, Aude Oliva, and Hanspeter Pfister. 2013. What Makes a Visualization Memorable?IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec. 2013), 2306–2315. https://doi.org/10.1109/TVCG.2013.234",
      "doi": "10.1109/TVCG.2013.234"
    },
    {
      "text": "Williemien Brand. 2017. Visual Thinking: Empowering People and Organisations throughVisual Collaboration (01 edition ed.). BIS Publishers, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Willemien Brand. 2018. Visual Doing: Applying Visual Thinking in your Day to Day Business: Applying Visual Thinking in your Day to Day Business (01 edition ed.). BIS Publishers, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Peter Brandl, Christoph Richter, and Michael Haller. 2010. NiCEBook: Supporting Natural Note Taking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). ACM, New York, NY, USA, 599–608. https://doi.org/10.1145/1753326.1753417 event-place: Atlanta, Georgia, USA.",
      "doi": "10.1145/1753326.1753417"
    },
    {
      "text": "Nathalie Bressa, Kendra Wannamaker, Henrik Korsgaard, Wesley Willett, and Jo Vermeulen. 2019. Sketching and Ideation Activities for Situated Visualization Design. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). ACM, New York, NY, USA, 173–185. https://doi.org/10.1145/3322276.3322326 event-place: San Diego, CA, USA.",
      "doi": "10.1145/3322276.3322326"
    },
    {
      "text": "Bill Buxton. 2007. Sketching User Experiences: Getting the Design Right and the Right Design (illustrated edition ed.). Morgan Kaufmann, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Kevin Cheng. 2012. See What I Mean: How to Use Comics to Communicate Ideas. Rosenfeld Media, USA.",
      "doi": ""
    },
    {
      "text": "Youngjun Cho, Andrea Bianchi, Nicolai Marquardt, and Nadia Bianchi-Berthouze. 2016. RealPen: Providing Realism in Handwriting Tasks on Touch Surfaces Using Auditory-Tactile Feedback. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 195–205. https://doi.org/10.1145/2984511.2984550",
      "doi": "10.1145/2984511.2984550"
    },
    {
      "text": "Ben Crothers. 2017. Presto Sketching: The Magic of Simple Drawing for Brilliant Product Thinking and Design. O’Reilly, Sebastopol, CA.",
      "doi": ""
    },
    {
      "text": "Raimund Dachselt, Mathias Frisch, and Eike Decker. 2008. Enhancing UML sketch tools with digital pens and paper. In Proceedings of the 4th ACM symposium on Software visualization(SoftVis ’08). Association for Computing Machinery, Ammersee, Germany, 203–204. https://doi.org/10.1145/1409720.1409756",
      "doi": "10.1145/1409720.1409756"
    },
    {
      "text": "Jara Dean‐Coffey. 2013. Graphic Recording. New Directions for Evaluation 2013, 140 (2013), 47–67. https://doi.org/10.1002/ev.20073",
      "doi": ""
    },
    {
      "text": "Robert Dimeo. 2016. Sketchnoting: An Analog Skill in the Digital Age. SIGCAS Comput. Soc. 46, 3 (Dec. 2016), 9–16. https://doi.org/10.1145/3024949.3024951",
      "doi": "10.1145/3024949.3024951"
    },
    {
      "text": "Marina Fernández Camporro and Nicolai Marquardt. 2020. Live Sketchnoting Across Platforms: Exploring the Potential and Limitations of Analogue and Digital Tools. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–12. https://doi.org/10.1145/3313831.3376192",
      "doi": "10.1145/3313831.3376192"
    },
    {
      "text": "Gene Golovchinsky, Morgan N. Price, and Bill N. Schilit. 1999. From Reading to Retrieval: Freeform Ink Annotations As Queries. In Proceedings of the 22Nd Annual International ACM SIGIR Conference on Research and Development in Information Retrieval(SIGIR ’99). ACM, New York, NY, USA, 19–25. https://doi.org/10.1145/312624.312637 event-place: Berkeley, California, USA.",
      "doi": "10.1145/312624.312637"
    },
    {
      "text": "Saul Greenberg, Sheelagh Carpendale, Nicolai Marquardt, and Bill Buxton. 2012. Sketching User Experiences: The Workbook (1 ed.). Morgan Kaufmann, USA.",
      "doi": ""
    },
    {
      "text": "Ken Hinckley and Bill Buxton. 2016. Inking Outside the Box: How Context Sensing Affords More Natural Pen (and Touch) Computing. In Revolutionizing Education with Digital Ink: The Impact of Pen and Touch Technology on Education, Tracy Hammond, Stephanie Valentine, and Aaron Adler(Eds.). Springer International Publishing, Cham, 27–47. https://doi.org/10.1007/978-3-319-31193-7_3",
      "doi": ""
    },
    {
      "text": "Ken Hinckley, Koji Yatani, Michel Pahud, Nicole Coddington, Jenny Rodenhouse, Andy Wilson, Hrvoje Benko, and Bill Buxton. 2010. Pen + Touch = New Tools. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology(UIST ’10). ACM, New York, NY, USA, 27–36. https://doi.org/10.1145/1866029.1866036 event-place: New York, New York, USA.",
      "doi": "10.1145/1866029.1866036"
    },
    {
      "text": "Alma R. Hoffmann. 2019. Sketching as Design Thinking. Routledge, London ; New York.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman and Benjamin Bach. 2018. Picturing Science: Design Patterns in Graphical Abstracts. In Diagrammatic Representation and Inference(Lecture Notes in Computer Science), Peter Chapman, Gem Stapleton, Amirouche Moktefi, Sarah Perez-Kriz, and Francesco Bellucci (Eds.). Springer International Publishing, Cham, 183–200. https://doi.org/10.1007/978-3-319-91376-6_19",
      "doi": ""
    },
    {
      "text": "Michael Hung, David Ledo, and Lora Oehlberg. 2019. WatchPen: Using Cross-Device Interaction Concepts to Augment Pen-Based Interaction. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 11, 8 pages. https://doi.org/10.1145/3338286.3340122",
      "doi": "10.1145/3338286.3344413"
    },
    {
      "text": "David Kirsh. 1995. The Intelligent Use of Space. Artif. Intell. 73, 1–2 (Feb. 1995), 31–68. https://doi.org/10.1016/0004-3702(94)00017-U",
      "doi": "10.1016/0004-3702%2894%2900017-U"
    },
    {
      "text": "David Kirsh. 2010. Thinking with external representations. AI & SOCIETY 25, 4 (Nov. 2010), 441–454. https://doi.org/10.1007/s00146-010-0272-8",
      "doi": ""
    },
    {
      "text": "Makayla Lewis and Mark Perry. 2019. Follow the Money: Managing Personal Finance Digitally. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, Glasgow, Scotland Uk, 1–14. https://doi.org/10.1145/3290605.3300620",
      "doi": "10.1145/3290605.3300620"
    },
    {
      "text": "Makayla Lewis, Miriam Sturdee, Jason Alexander, Jelle Van Dijk, Majken Kirkeg\\a ard Rasmussen, and Thuong Hoang. 2017. SketchingDIS: Hand-drawn Sketching in HCI. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems(DIS ’17 Companion). ACM, New York, NY, USA, 356–359. https://doi.org/10.1145/3064857.3064863 event-place: Edinburgh, United Kingdom.",
      "doi": "10.1145/3064857.3064863"
    },
    {
      "text": "Makayla Lewis, Miriam Sturdee, and Nicolai Marquardt. 2019. Sketching in HCI: Hands-on Course of Sketching Techniques. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(CHI EA ’19). ACM, New York, NY, USA, C04:1–C04:5. https://doi.org/10.1145/3290607.3298805 event-place: Glasgow, Scotland Uk.",
      "doi": "10.1145/3290607.3298805"
    },
    {
      "text": "Yang Li, Ken Hinckley, , Zhiwei Guan, and James A. Landay. 2005. Experimental Analysis of Mode Switching Techniques in Pen-based User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’05). ACM, New York, NY, USA, 461–470. https://doi.org/10.1145/1054972.1055036 event-place: Portland, Oregon, USA.",
      "doi": "10.1145/1054972.1055036"
    },
    {
      "text": "Min Lin, Wayne G. Lutters, and Tina S. Kim. 2004. Understanding the Micronote Lifecycle: Improving Mobile Support for Informal Note Taking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’04). ACM, New York, NY, USA, 687–694. https://doi.org/10.1145/985692.985779 event-place: Vienna, Austria.",
      "doi": "10.1145/985692.985779"
    },
    {
      "text": "Narges Mahyar, Ali Sarvghad, and Melanie Tory. 2012. Note-taking in co-located collaborative visual analytics: Analysis of an observational study. Information Visualization 11, 3 (2012), 190–204. https://doi.org/10.1177/1473871611433713",
      "doi": "10.1177/1473871611433713"
    },
    {
      "text": "Nicolai Marquardt and Saul Greenberg. 2012. Sketchnotes for Visual Thinking in HCI. In In CHI 2012 Workshop on Visual Thinking and Digital Imagery. (Workshop held at the ACM CHI Conference), Vol. 5. CHI 2021, USA, 5.",
      "doi": ""
    },
    {
      "text": "Scott McCloud. 1993. Understanding Comics: The Invisible Art (1st harperperennial ed edition ed.). William Morrow Paperbacks, New York.",
      "doi": ""
    },
    {
      "text": "Scott McCloud. 2006. Making Comics: Storytelling Secrets of Comics, Manga and Graphic Novels (illustrated edition ed.). William Morrow Paperbacks, New York.",
      "doi": ""
    },
    {
      "text": "Emily Mills. 2019. The Art of Visual Notetaking: A comprehensive guide to visual communication and sketchnoting: An interactive guide to visual communication and sketchnoting(01 edition ed.). Walter Foster Publishing, USA.",
      "doi": ""
    },
    {
      "text": "Thomas P. Moran, Patrick Chiu, and William van Melle. 1997. Pen-Based Interaction Techniques for Organizing Material on an Electronic Whiteboard. In Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology (Banff, Alberta, Canada) (UIST ’97). Association for Computing Machinery, New York, NY, USA, 45–54. https://doi.org/10.1145/263407.263508",
      "doi": "10.1145/263407.263508"
    },
    {
      "text": "Jennifer Pearson, George Buchanan, and Harold Thimbleby. 2011. The Reading Desk: Applying Physical Interactions to Digital Documents. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). ACM, New York, NY, USA, 3199–3202. https://doi.org/10.1145/1978942.1979416 event-place: Vancouver, BC, Canada.",
      "doi": "10.1145/1978942.1979416"
    },
    {
      "text": "Frank D. Prager. 1968. A Manuscript of Taccola, Quoting Brunelleschi, on Problems of Inventors and Builders. Proceedings of the American Philosophical Society 112, 3 (1968), 131–149. https://www.jstor.org/stable/986159 Publisher: American Philosophical Society.",
      "doi": ""
    },
    {
      "text": "Yann Riche, Nathalie Henry Riche, Ken Hinckley, Sheri Panabaker, Sarah Fuelling, and Sarah Williams. 2017. As We May Ink?: Learning from Everyday Analog Pen Use to Improve Digital Ink Experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). ACM Press, Denver, Colorado, USA, 3241–3253. https://doi.org/10.1145/3025453.3025716",
      "doi": "10.1145/3025453.3025716"
    },
    {
      "text": "Irma A. Richter and Thereza Wells. 2008. Leonardo da Vinci Notebooks(new edition ed.). OUP Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Mike Rohde. 2013. The sketchnote handbook: the illustrated guide to visual note taking. Peachpit Press, San Francisco, CA. OCLC: ocn796754744.",
      "doi": ""
    },
    {
      "text": "Mike Rohde. 2014. The Sketchnote Workbook: Advanced techniques for taking visual notes you can use anywhere. Peachpit Press, San Francisco.",
      "doi": ""
    },
    {
      "text": "Mike Rohde. 2021. Sketchnote Army Blog. https://sketchnotearmy.com/",
      "doi": ""
    },
    {
      "text": "Bill N. Schilit, Gene Golovchinsky, and Morgan N. Price. 1998. Beyond Paper: Supporting Active Reading with Free Form Digital Ink Annotations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Los Angeles, California, USA) (CHI ’98). ACM Press/Addison-Wesley Publishing Co., USA, 249–256. https://doi.org/10.1145/274644.274680",
      "doi": ""
    },
    {
      "text": "Abigail J. Sellen and Richard H.R. Harper. 2003. The Myth of the Paperless Office. MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/778158"
    },
    {
      "text": "Miriam Sturdee, Jason Alexander, Paul Coulton, and Sheelagh Carpendale. 2018. Sketch & The Lizard King: Supporting Image Inclusion in HCI Publishing. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3170427.3188408",
      "doi": "10.1145/3170427.3188408"
    },
    {
      "text": "Miriam Sturdee, Makayla Lewis, and Nicolai Marquardt. 2018. Feeling SketCHI?: The Lasting Appeal of the Drawn Image in HCI. Interactions 25, 6 (Oct. 2018), 64–69. https://doi.org/10.1145/3274562",
      "doi": "10.1145/3281661"
    },
    {
      "text": "Miriam Sturdee, Makayla Lewis, and Nicolai Marquardt. 2018. SketchBlog #1: The Rise and Rise of the Sketchnote. Interactions 25, 6 (Oct. 2018), 6–8. https://doi.org/10.1145/3281661",
      "doi": "10.1145/3281661"
    },
    {
      "text": "Minghui Sun, Xiang Cao, Hyunyoung Song, Shahram Izadi, Hrvoje Benko, Francois Guimbretiere, Xiangshi Ren, and Ken Hinckley. 2011. Enhancing Naturalness of Pen-and-tablet Drawing Through Context Sensing. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces(ITS ’11). ACM, New York, NY, USA, 83–86. https://doi.org/10.1145/2076354.2076371 event-place: Kobe, Japan.",
      "doi": "10.1145/2076354.2076371"
    },
    {
      "text": "Jagoda Walny, Sheelagh Carpendale, Nathalie Henry Riche, Gina Venolia, and Philip Fawcett. 2011. Visual Thinking In Action: Visualizations As Used On Whiteboards. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2508–2517. https://doi.org/10.1109/TVCG.2011.251",
      "doi": "10.1109/TVCG.2011.251"
    },
    {
      "text": "Steve Whittaker, Patrick Hyland, and Myrtle Wiley. 1994. FILOCHAT: Handwritten Notes Provide Access to Recorded Conversations. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’94). ACM, New York, NY, USA, 271–277. https://doi.org/10.1145/191666.191763 event-place: Boston, Massachusetts, USA.",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Nathalie Henry Riche, Fanny Chevalier, Bruno De Araujo, and Daniel Wigdor. 2018. DataInk: Direct and Creative Data-Oriented Drawing. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173797",
      "doi": "10.1145/3173574.3173797"
    }
  ]
}