{
  "doi": "10.1145/3411764.3445427",
  "title": "Parental Mediation for Young Children’s Use of Educational Media: A Case Study with Computational Toys and Kits",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Parental mediation literature is mostly situated in the contexts of television, Internet use, video games, and mobile devices, while there is less understanding of how parents mediate their children’s engagement with educational-focused media. We examine parental involvement in young children’s use of a creation-oriented educational media, i.e., coding kits, from a mediation perspective through an interview study. We frame parents’ mediation practices along three dimensions: (1) creative mediation, where parents mediate to support children’s creating and learning with media; (2) preparative mediation, where parents explore and prepare media for children’s engagement; and (3) administrative mediation, where parents administer and regulate their children’s media use. Compared to the restrictive, active, and co-using mediation theory, our proposed framework highlights various supportive practices parents take to help their children learn and create with media. We further connect our findings to Joint Media Engagement and reflect on implications for parent involvement in children’s creation-oriented media design.",
  "tags": [
    "Young Children",
    "Parental Mediation Theory",
    "Parents",
    "Educational Media"
  ],
  "authors": [
    {
      "name": "Junnan Yu",
      "institution": "Department of Information Science University of Colorado Boulder, United States",
      "img": "/do/10.1145/contrib-99659276681/rel-imgonly/cute_kittens-wide.jpg",
      "acmid": "99659276681",
      "orcid": "0000-0002-0869-0304"
    },
    {
      "name": "Andrea DeVore",
      "institution": "University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701066",
      "orcid": "missing"
    },
    {
      "name": "Ricarose Roque",
      "institution": "University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502704620",
      "orcid": "0000-0003-3100-2466"
    }
  ],
  "references": [
    {
      "text": "Janice Anderson and Michael Barnett. 2011. Using video games to support pre-service elementary teachers learning of basic physics principles. Journal of Science Education and Technology 20, 4 (2011), 347–362.",
      "doi": ""
    },
    {
      "text": "Monica Anderson and Jingjing Jiang. 2018. Teens, Social Media & Technology 2018. Technical Report. Pew Research Center. 20 pages.",
      "doi": ""
    },
    {
      "text": "Brigid Barron, Caitlin Kennedy Martin, Lori Takeuchi, and Rachel Fithian. 2009. Parents as Learning Partners in the Development of Technological Fluency. International Journal of Learning and Media 1, 2 (2009), 55–77.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101.",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Jennifer L Chakroff and Amy I Nathanson. 2008. Parent and school interventions: Mediation and media literacy. The handbook of children, media, and development (2008), 552–576.",
      "doi": ""
    },
    {
      "text": "Lynn Schofield Clark. 2011. Parental Mediation Theory for the Digital Age. Communication Theory 21, 4 (2011), 323–343.",
      "doi": "10.1111/j.1468-"
    },
    {
      "text": "Yeshe Colliver. 2016. Mothers’ Perspectives on Learning through Play in the Home. Australasian Journal of Early Childhood 41, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Yeshe Colliver, Maria Hatzigianni, and Ben Davies. 2019. Why can’t I find quality apps for my child? A model to understand all stakeholders’ perspectives on quality learning through digital play. Early Child Development and Care(2019), 1–15.",
      "doi": ""
    },
    {
      "text": "DevTech Research Group at Tufts University, Lifelong Kindergarten Group at the MIT Media Lab, and The Playful Invention Company. 2020. ScratchJr. http://scratchjr.org",
      "doi": ""
    },
    {
      "text": "Matthew S Eastin, Bradley S Greenberg, and Linda Hofschire. 2006. Parenting the Internet. Journal of Communication 56, 3 (2006), 486–504.",
      "doi": ""
    },
    {
      "text": "Fisher-Price Think & Learn. 2020. Code-a-pillar. https://www.fisher-price.com/en-us/product/think-learn-code-a-pillar-twist-gfp25",
      "doi": ""
    },
    {
      "text": "Brianna Hightower, Kelly Sheehan, Alexis Lauricella, and Ellen Wartella. 2019. Exploring parent use of early STEM media to inform design for children. In Proceedings of the 18th ACM International Conference on Interaction Design and Children, IDC 2019. 102–108.",
      "doi": "10.1145/3311927.3323124"
    },
    {
      "text": "Alexis Hiniker, Bongshin Lee, Julie A Kientz, and Jenny S Radesky. 2018. Let’s Play! Digital and Analog Play Patterns between Preschoolers and Parents. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC, Canada, 1–13.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sarita Y. Schoenebeck, and Julie A Kientz. 2016. Not at the Dinner Table: Parents’ and Children’s Perspectives on Family Technology Rules. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, San Francisco, California, USA, 1374–1387.",
      "doi": "10.1145/2818048.2819940"
    },
    {
      "text": "Mizuko Ito, Sonja Baumer, Matteo Bittanti, Danah Boyd, Rachel Cody, Becky Herr-Stephenson, Heather A. Horst, Patricia G. Lange, Dilan Mahendran, Katynka Z. Martínez, C. J. Pascoe, Dan Perkel, Laura Robinson, Christo Sims, and Lisa Tripp. 2013. Hanging Out, Messing Around, and Geeking Out: Kids Living and Learning with New Media. The MIT Press. 440 pages.",
      "doi": "10.5555/1822783"
    },
    {
      "text": "Hee Jhee Jiow, Sun Sun Lim, and Julian Lin. 2017. Level Up! Refreshing Parental Mediation Theory for Our Digital Media Landscape. Communication Theory 27, 3 (2017), 309–328.",
      "doi": ""
    },
    {
      "text": "Vikki S. Katz and Carmen Gonzalez. 2016. Community Variations in Low-Income Latino Families’ Technology Adoption and Integration. American Behavioral Scientist 60, 1 (2016), 59–80.",
      "doi": ""
    },
    {
      "text": "Lucyna Kirwil. 2009. Parental mediation of children’s internet use in different European countries. Journal of Children and Media 3, 4 (2009), 394–409.",
      "doi": ""
    },
    {
      "text": "Minsam Ko, Seungwoo Choi, Subin Yang, Joonwon Lee, and Uichin Lee. 2015. FamiLync: Facilitating participatory parental mediation of adolescents’ smartphone Use. In UbiComp 2015 - Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, Osaka, Japan, 867–878.",
      "doi": "10.1145/2750858.2804283"
    },
    {
      "text": "J Richard Landis and Gary G Koch. 1977. The Measurement of Observer Agreement for Categorical Data. Biometrics 33, 1 (1977), 159–174.",
      "doi": ""
    },
    {
      "text": "Jo-Anne LeFevre, Sheri-Lynn Skwarchuk, Brenda Smith-Chant, Lisa L. Fast, Deepthi Kamawar, and Jeffrey Bisanz. 2009. Home numeracy experiences and children’s math performance in the early school years. Canadian Journal of Behavioural Science 41, 2 (2009), 55–66.",
      "doi": ""
    },
    {
      "text": "Amber Maria Levinson and Brigid Barron. 2018. Latino immigrant families learning with digital media across settings and generations. Digital Education Review33 (2018), 150–169.",
      "doi": ""
    },
    {
      "text": "LightBot Inc. 2020. Lightbot. http://lightbot.com/index.html",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone and Ellen J. Helsper. 2008. Parental mediation of children’s internet use. Journal of Broadcasting and Electronic Media 52, 4 (2008), 581–599.",
      "doi": ""
    },
    {
      "text": "Michael A. Madaio, Vikram Kamath, Evelyn Yarzebinski, Shelby Zasacky, Fabrice Tanoh, Joelle Hannon-Cropp, Justine Cassell, Kaja Jasinska, and Amy Ogan. 2019. ”You give a little of yourself”: Family support for children’s use of an IVR literacy system. In COMPASS 2019 - Proceedings of the 2019 Conference on Computing and Sustainable Societies. ACM, Accra, Ghana, 86–98.",
      "doi": "10.1145/3314344.3332504"
    },
    {
      "text": "Jane Mavoa, Marcus Carter, and Martin Gibbs. 2017. Beyond Addiction: Positive and Negative Parent Perceptions of Minecraft Play. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play - CHI PLAY ’17. 171–181.",
      "doi": "10.1145/3116595.3116638"
    },
    {
      "text": "Modular Robotics. 2020. Cubelets. https://www.modrobotics.com/cubelets/",
      "doi": ""
    },
    {
      "text": "Movetheturtle.com. 2020. Move the Turtle. http://movetheturtle.com/",
      "doi": ""
    },
    {
      "text": "Amy I Nathanson. 2008. Parental mediation strategies. The international encyclopedia of communication (2008).",
      "doi": ""
    },
    {
      "text": "National Research Council. 2011. Report of a workshop on the pedagogical aspects of computational thinking. National Academies Press.",
      "doi": ""
    },
    {
      "text": "Peter Nikken and Jeroen Jansz. 2006. Parental mediation of children’s videogame playing: A comparison of the reports by parents and children. Learning, Media and Technology 31, 2 (2006), 181–202.",
      "doi": ""
    },
    {
      "text": "Peter Nikken and Jeroen Jansz. 2014. Developing scales to measure parental mediation of young children’s internet use. Learning, Media and Technology 39, 2 (2014), 250–266.",
      "doi": ""
    },
    {
      "text": "OSMO. 2020. Coding Awbie. https://www.playosmo.com/en/coding/",
      "doi": ""
    },
    {
      "text": "Laura R. Pina, Carmen Gonzalez, Carolina Nieto, Wendy Roldan, Edgar Onofre, and Jason C. Yip. 2018. How Latino children in the U.S. engage in collaborative online information problem solving with their families. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018).",
      "doi": "10.1145/3274409"
    },
    {
      "text": "PRIMO. 2020. Cubetto. https://www.primotoys.com/",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick and Brian Silverman. 2005. Some Reflections on Designing Construction Kits for Kids. In Proceeding of the 2005 conference on Interaction design and children (IDC ’05). 117–122.",
      "doi": "10.1145/1109540.1109556"
    },
    {
      "text": "Victoria Rideout and VJR Consulting. 2017. The Common Sense Census: Media Use by Kids Age Zero to Eight. Technical Report. Common Sense Media, San Francisco, CA. 64pages.",
      "doi": ""
    },
    {
      "text": "Ricarose Roque, Karina Lin, and Richard Liuzzi. 2016. I’m Not Just a Mom: Parents Developing Multiple Roles in Creative Computing. In 12th International Conference of the Learning Sciences. 663–671.",
      "doi": ""
    },
    {
      "text": "Parisa Khanipour Roshan, Maia Jacobs, Michaelanne Dye, and Betsy DiSalvo. 2014. Exploring how parents in economically depressed communities access learning resources. In Proceedings of the International ACM SIGGROUP Conference on Supporting Group Work. ACM, Sanibel Island, FL, USA, 131–141.",
      "doi": "10.1145/2660398.2660415"
    },
    {
      "text": "Betty Sargeant. 2013. Interactive storytelling: How picture book conventions inform multimedia book app narratives. Australian Journal of Intelligent Information Processing Systems 13, 3(2013), 29–35.",
      "doi": ""
    },
    {
      "text": "Wonsun Shin and Jisu Huh. 2011. Parental mediation of teenagers’ video game playing: Antecedents and consequences. New Media & Society 13, 6 (2011), 945–962.",
      "doi": ""
    },
    {
      "text": "Kiley Sobel, Arpita Bhattacharya, Alexis Hiniker, Jin Ha Lee, Julie A. Kiemtz, and Jason C. Yip. 2017. ”It wasn’t really about the Pokémon”: Parents’ Perspectives on a Location-Based Mobile Game. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver, Colorado, USA, 1483–1496.",
      "doi": "10.1145/3025453.3025761"
    },
    {
      "text": "Sphero. 2020. Sphero Kit. https://sphero.com/",
      "doi": ""
    },
    {
      "text": "Lori Takeuchi and Reed Stevens. 2011. The New Coviewing: Designing for Learning through Joint-Media Engagement. Technical Report. The Joan Ganz Cooney Center at Sesame Workshop. 75 pages.",
      "doi": ""
    },
    {
      "text": "The Toy Association. 2017. STEM/STEAM Formula for Success. Technical Report. 24 pages.",
      "doi": ""
    },
    {
      "text": "Patti M Valkenburg, Marina Krcmar, Allerd L Peeters, and Nies M Marseille. 1999. Developing a scale to assess three styles of television mediation: “Instructive mediation,” “restrictive mediation,” and “social coviewing”. Journal of Broadcasting & Electronic Media 43, 1 (1999), 52–66.",
      "doi": ""
    },
    {
      "text": "Jeannette M. Wing. 2006. Computational Thinking. Commun. ACM 49, 3 (2006), 33–35.",
      "doi": "10.1145/1118178.1118215"
    },
    {
      "text": "Pamela Wisniewski, Arup Kumar Ghosh, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2017. Parental control vs. teen self-regulation: Is there a middle ground for mobile online safety?. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW. ACM, Portland, OR, USA, 51–69.",
      "doi": "10.1145/2998181.2998352"
    },
    {
      "text": "Pamela Wisniewski, Haiyan Jia, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2015. “Preventative” vs. “Reactive”: How Parental Mediation Influences Teens’ Social Media Privacy Behaviors. In CSCW 2015 - Proceedings of the 2015 ACM International Conference on Computer-Supported Cooperative Work and Social Computing. ACM, Vancouver, BC, Canada, 302–316.",
      "doi": "10.1145/2675133.2675293"
    },
    {
      "text": "Wonder Workshop. 2020. Dash & Dot. https://www.makewonder.com/",
      "doi": ""
    },
    {
      "text": "Sarita Yardi and Amy Bruckman. 2011. Social and technical challenges in parenting teens’ social media use. In CHI ’11: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Vancouver, BC, Canada, 3237–3246.",
      "doi": "10.1145/1978942.1979422"
    },
    {
      "text": "Junnan Yu, Chenke Bai, and Ricarose Roque. 2020. Considering Parents in Coding Kit Design: Understanding Parents’ Perspectives and Roles. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu, HI, USA, 1–14.",
      "doi": "10.1145/3313831.3376130"
    },
    {
      "text": "Junnan Yu and Ricarose Roque. 2019. A review of computational toys and kits for young children. International Journal of Child-Computer Interaction 21 (2019), 17–36.",
      "doi": "10.1016/j.ijcci.2019.04.001"
    }
  ]
}