{
  "doi": "10.1145/3411764.3445730",
  "title": "Cracking Public Space Open: Design for Public Librarians",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Public libraries in the U.S. and around the world are rapidly changing due to expanding technological and social needs of their communities. Furthermore, in recent years, public spaces, including libraries, have faced budgetary and other pressures, putting a strain on the resources available to librarians. As such, public libraries are a compelling cite for uncovering socio-technical entanglements between government services, technology use, public space, and civic participation. In this paper, we report on a qualitative study of librarians in a U.S. urban public library system undergoing substantial renovations and transformations. We frame the work of librarians as a range of infrastructuring practices, which help uncover insights about the socio-material and political conditions of public service in libraries. Using the metaphor of cracking public space open, we contribute a set of design provocations to support an increasingly complex work of public librarians.",
  "authors": [
    {
      "name": "Sandjar Kozubaev",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/do/10.1145/contrib-99659082270/rel-imgonly/99659082270.jpg",
      "acmid": "99659082270",
      "orcid": "missing"
    },
    {
      "name": "Carl DiSalvo",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100258547",
      "orcid": "0000-0002-7344-8741"
    }
  ],
  "references": [
    {
      "text": "Colleen Alstad and Ann Curry. 2003. Public Space, Public Discourse, and Public Libraries. Libres 13, 1.",
      "doi": ""
    },
    {
      "text": "American Library Association. Number of Libraries in the United States. Retrieved November 10, 2018, 2018 from http://libguides.ala.org/numberoflibraries",
      "doi": ""
    },
    {
      "text": "Mariam Asad and Christopher Le Dantec. 2017. Tap the \"Make This Public\" Button: A Design-Based Inquiry into Issue Advocacy and Digital Civics. In Proceedings of Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver, Colorado, USA, 6304-6316. http://dx.doi.org/10.1145/3025453.3026034",
      "doi": "10.1145/3025453.3026034"
    },
    {
      "text": "Mariam Asad and Christopher A. Le Dantec. 2017. Tap the \"Make This Public\" Button: A Design-Based Inquiry into Issue Advocacy and Digital Civics. In Proceedings of Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver, Colorado, USA, 6304-6316. http://dx.doi.org/10.1145/3025453.3026034",
      "doi": ""
    },
    {
      "text": "Mariam Asad and Christopher Le Dantec. 2015. Illegitimate Civic Participation: Supporting Community Activists on the Ground. In Proceedings of Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, Vancouver, BC, Canada, 1694-1703. http://dx.doi.org/10.1145/2675133.2675156",
      "doi": "10.1145/2675133.2675156"
    },
    {
      "text": "Tridib Banerjee. 2001. The Future of Public Space: Beyond Invented Streets and Reinvented Places. Journal of the American Planning Association 67, 1, 9-24. http://dx.doi.org/10.1080/01944360108976352",
      "doi": ""
    },
    {
      "text": "Donald A. Barclay. 2017. Space and the Social Worth of Public Libraries. Public Library Quarterly 36, 4, 267-273. http://dx.doi.org/10.1080/01616846.2017.1327767",
      "doi": ""
    },
    {
      "text": "John Carlo Bertot. 2016. Building Digitally Inclusive Communities: The Roles of Public Libraries in Digital Inclusion and Development. In Proceedings of Proceedings of the 9th International Conference on Theory and Practice of Electronic Governance. Association for Computing Machinery, Montevideo, Uruguay, 95–102. http://dx.doi.org/10.1145/2910019.2910082",
      "doi": "10.1145/2910019.2910082"
    },
    {
      "text": "John Carlo Bertot, Brian Real and Paul T. Jaeger. 2016. Public Libraries Building Digital Inclusive Communities: Data and Findings from the 2013 Digital Inclusion Survey. The Library Quarterly 86, 3, 270-289. http://dx.doi.org/10.1086/686674",
      "doi": ""
    },
    {
      "text": "Susanne Bødker, Christian Dindler and Ole Sejer Iversen. 2017. Tying Knots: Participatory Infrastructuring at Work. Computer Supported Cooperative Work (CSCW) 26, 1, 245-273. http://dx.doi.org/10.1007/s10606-017-9268-y",
      "doi": "10.1007/s10606-017-9268-y"
    },
    {
      "text": "France Bouthillier. 2000. The Meaning of Service: Ambiguities and Dilemmas for Public Library Service Providers. Library & Information Science Research 22, 3, 243-272. https://doi.org/10.1016/S0740-8188(99)00055-9",
      "doi": ""
    },
    {
      "text": "A Bryant and K Charmaz. 2007. Introduction. Grounded Theory Research: Methods and Practices. In The Sage Handbook of Grounded Theory, A Bryant and K Charmaz Eds. Sage Publications Ltd, London, UK, 1.",
      "doi": ""
    },
    {
      "text": "M. F. Cavanagh. 2006. Re-Conceptualizing the ‘Reference Transaction’ — the Case for Interaction and Information Relationships at the Public Library Reference Desk. Canadian Journal of Information and Library Sciences 30, 1/2, 1-19.",
      "doi": ""
    },
    {
      "text": "Gobinda Chowdhury, Alan Poulter and David McMenemy. 2006. Public Library 2.0: Towards a New Mission for Public Libraries as a “Network of Community Knowledge”. Online Information Review 30, 4, 454-460. http://dx.doi.org/10.1108/14684520610686328",
      "doi": ""
    },
    {
      "text": "Rachel Ivy Clarke. 2018. How We Done It Good: Research through Design as a Legitimate Methodology for Librarianship. Library & Information Science Research 40, 3, 255-261. https://doi.org/10.1016/j.lisr.2018.09.007",
      "doi": ""
    },
    {
      "text": "Rachel Ivy Clarke and Sayward Schoonmaker. 2020. The Critical Catalog: Library Information Systems, Tricksterism, and Social Justice. In Proceedings of Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Honolulu, HI, USA, 1–13. http://dx.doi.org/10.1145/3313831.3376307",
      "doi": "10.1145/3313831.3376307"
    },
    {
      "text": "Terry Costantino, Steven LeMay, Linnea Vizard, Heather Moore, Dara Renton, Sandra Gornall and Ian Strang. 2014. Exploring Participation in the Design of Public Library E-Services. In Proceedings of Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts - Volume 2. ACM, Windhoek, Namibia, 17-20. http://dx.doi.org/10.1145/2662155.2662174",
      "doi": "10.1145/2662155.2662174"
    },
    {
      "text": "Clara Crivellaro, Rob Comber, Martyn Dade-Robertson, Simon J. Bowen, Peter C. Wright and Patrick Olivier. 2015. Contesting the City: Enacting the Political through Digitally Supported Urban Walks. In Proceedings of Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul, Republic of Korea, 2853-2862. http://dx.doi.org/10.1145/2702123.2702176",
      "doi": ""
    },
    {
      "text": "Amber L. Cushing. 2016. “If It Computes, Patrons Have Brought It In”: Personal Information Management and Personal Technology Assistance in Public Libraries. Library & Information Science Research 38, 1, 81-88. https://doi.org/10.1016/j.lisr.2016.01.005",
      "doi": ""
    },
    {
      "text": "Peter Dalsgaard, Christian Dindler and Eva Eriksson. 2008. Designing for Participation in Public Knowledge Institutions. In Proceedings of Proceedings of the 5th Nordic conference on Human-computer interaction: building bridges. ACM, Lund, Sweden, 93-102. http://dx.doi.org/10.1145/1463160.1463171",
      "doi": "10.1145/1463160.1463171"
    },
    {
      "text": "Peter Dalsgaard and Eva Eriksson. 2013. Large-Scale Participation: A Case Study of a Participatory Approach to Developing a New Public Library. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 399-408.",
      "doi": "10.1145/2470654.2470713"
    },
    {
      "text": "Peter Dalsgaard and Kim Halskov. 2010. Designing Urban Media Façades: Cases and Challenges. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Atlanta, Georgia, USA, 2277-2286. https://doi.org/10.1145/1753326.1753670",
      "doi": "10.1145/1753326.1753670"
    },
    {
      "text": "John Dewey. 1954. The Public and Its Problems. Swallow, Athens, Ohio.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Andrew Clement and Volkmar Pipek. 2013. Communities: Participatory Design for, with and by Communities. In Routledge International Handbook of Participatory Design, Jesper Simonsen and Toni Robertson Eds. Routledge,, London, 182-209.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo and Tom Jenkins. 2017. Fruit Are Heavy: A Prototype Public Iot System to Support Urban Foraging. In Proceedings of Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, Edinburgh, United Kingdom, 541-553. http://dx.doi.org/10.1145/3064663.3064748",
      "doi": "10.1145/3064663.3064748"
    },
    {
      "text": "Carl DiSalvo, Tom Jenkins and Thomas Lodato. 2016. Designing Speculative Civics. In Proceedings of Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose, California, USA, 4979-4990. http://dx.doi.org/10.1145/2858036.2858505",
      "doi": "10.1145/2858036.2858505"
    },
    {
      "text": "Emily Drabinski. 2019. What Is Critical About Critical Librarianship? Art Libraries Journal 44, 2, 49-57. http://dx.doi.org/10.1017/alj.2019.3",
      "doi": ""
    },
    {
      "text": "Tineke M. Egyedi, Donna C. Mehos and Wim G. Vree. 2012. Introducing Inverse Infrastructures. In Inverse Infrastructures: Desrupting Networks from Below, T. M. Egyedi and D. C. Mehos Eds. Edward Elgar Publishing. , Cheltenham, UK. https://doi.org/10.4337/9781781952290",
      "doi": ""
    },
    {
      "text": "Pelle Ehn. Year. Participation in Design Things. In Proceedings of PDC '08. Indiana University, 92-101.",
      "doi": ""
    },
    {
      "text": "Summer Evans. 2019. First ‘Drag Queen Story Hour’ to Be Held at Atlanta City Hall This Weekend. Retrieved September 5, 2019 from https://www.wabe.org/first-drag-queen-story-hour-to-be-held-at-georgia-capitol-this-weekend/",
      "doi": ""
    },
    {
      "text": "Patrick Tobias Fischer and Eva Hornecker. 2012. Urban Hci: Spatial Aspects in the Design of Shared Encounters for Media Facades. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Austin, Texas, USA, 307-316. http://dx.doi.org/10.1145/2207676.2207719",
      "doi": "10.1145/2207676.2207719"
    },
    {
      "text": "Sarah E. Fox, Kiley Sobel and Daniela K. Rosner. 2019. Managerial Visions: Stories of Upgrading and Maintaining the Public Restroom with Iot. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1-15. http://dx.doi.org/10.1145/3290605.3300723",
      "doi": ""
    },
    {
      "text": "Benjamin Franklin. 1904. In The Works of Benjamin Franklin, John Bigelow Ed. G.P. Putnam's Sons, The Knicker New York.",
      "doi": ""
    },
    {
      "text": "Mark A. Giesler. 2017. A Place to Call Home?: A Qualitative Exploration of Public Librarians' Response to Homelessness. Journal of Access Services 14, 4, 188-214. http://dx.doi.org/10.1080/15367967.2017.1395704",
      "doi": ""
    },
    {
      "text": "Darrin Hodgetts, Ottilie Stolte, Kerry Chamberlain, Alan Radley, Linda Nikora, Eci Nabalarua and Shiloh Groot. 2008. A Trip to the Library: Homelessness and Social Inclusion. Social & Cultural Geography 9, 8, 933-953. http://dx.doi.org/10.1080/14649360802441432",
      "doi": ""
    },
    {
      "text": "John Horrigan. 2016. Libraries 2016. Retrieved September 10, 2019 from https://www.pewinternet.org/2016/09/09/libraries-2016/",
      "doi": ""
    },
    {
      "text": "Noura Howell, Greg Niemeyer and Kimiko Ryokai. 2019. Life-Affirming Biosensing in Public: Sounding Heartbeats on a Red Bench. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1-16. http://dx.doi.org/10.1145/3290605.3300910",
      "doi": "10.1145/3290605.3300910"
    },
    {
      "text": "Liesbeth Huybrechts, Henric Benesch and Jon Geib. 2017. Institutioning: Participatory Design, Co-Design and the Public Realm. CoDesign 13, 3, 148-159. http://dx.doi.org/10.1080/15710882.2017.1355006",
      "doi": ""
    },
    {
      "text": "Paul T. Jaeger, Katie Shilton and Jes Koepfler. 2016. The Rise of Social Justice as a Guiding Principle in Library and Information Science Research. The Library Quarterly 86, 1, 1-9. http://dx.doi.org/10.1086/684142",
      "doi": ""
    },
    {
      "text": "Tom Jenkins. 2017. Living Apart, Together: Cohousing as a Site for Ict Design. In Proceedings of Proceedings of the 2017 Conference on Designing Interactive Systems. ACM, Edinburgh, United Kingdom, 1039-1051. http://dx.doi.org/10.1145/3064663.3064751",
      "doi": "10.1145/3064663.3064751"
    },
    {
      "text": "Tom Jenkins, Christopher A. Le Dantec, Carl DiSalvo, Thomas Lodato and Mariam Asad. 2016. Object-Oriented Publics. In Proceedings of Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose, California, USA, 827-839. http://dx.doi.org/10.1145/2858036.2858565",
      "doi": ""
    },
    {
      "text": "Helena Karasti. 2014. Infrastructuring in Participatory Design. In Proceedings of Proceedings of the 13th Participatory Design Conference: Research Papers - Volume 1. Association for Computing Machinery, Windhoek, Namibia, 141–150. http://dx.doi.org/10.1145/2661435.2661450",
      "doi": "10.1145/2661435.2661450"
    },
    {
      "text": "Helena Karasti, Karen S. Baker and Florence Millerand. 2010. Infrastructure Time: Long-Term Matters in Collaborative Development. Computer Supported Cooperative Work 19, 3, 377-415. http://dx.doi.org/10.1007/s10606-010-9113-z",
      "doi": "10.1007/s10606-010-9113-z"
    },
    {
      "text": "Helena Karasti, Andrea Botero, Elena Parmiggiani, Karen Baker, Sanna Marttila, Joanna Saad-Sulonen and Hanne Cecilie Geirbo. 2018. Infrastructuring in Pd: What Does Infrastructuring Look Like? When Does It Look Like That? In Proceedings of Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial - Volume 2. Association for Computing Machinery, Hasselt and Genk, Belgium, Article 45. http://dx.doi.org/10.1145/3210604.3210618",
      "doi": "10.1145/3210604.3210618"
    },
    {
      "text": "Safirotu Khoir, Jia Tina Du, Robert M. Davison and Andy Koronios. 2017. Contributing to Social Capital: An Investigation of Asian Immigrants' Use of Public Library Services. Library & Information Science Research 39, 1, 34-45. https://doi.org/10.1016/j.lisr.2017.01.005",
      "doi": ""
    },
    {
      "text": "Michael Khoo, Lily Rozaklis and Catherine Hall. 2012. A Survey of the Use of Ethnographic Methods in the Study of Libraries and Library Users. Library & Information Science Research 34, 2, 82-91. https://doi.org/10.1016/j.lisr.2011.07.010",
      "doi": ""
    },
    {
      "text": "Eric Kleinberg. 2015. Heat Wave: A Social Autopsy of Disaster in Chicago. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Eric Klienberg. 2018. Palaces for the People : How Social Infrastructure Can Help Fight Inequality, Polarization, and the Decline of Civic Life. Crown, New York.",
      "doi": ""
    },
    {
      "text": "M. Korn and A. Voida. 2015. Creating Friction: Infrastructuring Civic Engagement in Everyday Life. Critical Alternatives 1 https://doi.org/10.7146/aahcc.v1i1.21198",
      "doi": ""
    },
    {
      "text": "Sandjar Kozubaev and Carl DiSalvo. 2020. The Future of Public Libraries as Convivial Spaces: A Design Fiction. In Proceedings of Companion of the 2020 ACM International Conference on Supporting Group Work. Association for Computing Machinery, Sanibel Island, Florida, USA, 83–90. http://dx.doi.org/10.1145/3323994.3369901",
      "doi": "10.1145/3323994.3369901"
    },
    {
      "text": "Sandjar Kozubaev, Fernando Rochaix, Carl DiSalvo and Christopher A. Le Dantec. 2019. Spaces and Traces: Implications of Smart Technology in Public Housing. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1-13. http://dx.doi.org/10.1145/3290605.3300669",
      "doi": ""
    },
    {
      "text": "Donna Lanclos and Andrew D. Asher. 2016. “Ethnographish”: The State of the Ethnography in Libraries. JOurnal of Library User Experience 1, 5. http://dx.doi.org/10.3998/weave.12535642.0001.503",
      "doi": ""
    },
    {
      "text": "Christopher Le Dantec. 2012. Participation and Publics: Supporting Community Engagement. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Austin, Texas, USA, 1351-1360. http://dx.doi.org/10.1145/2207676.2208593",
      "doi": "10.1145/2207676.2208593"
    },
    {
      "text": "Christopher Le Dantec and Carl DiSalvo. 2013. Infrastructuring and the Formation of Publics in Participatory Design. Social Studies of Science 43, 2, 241-264. http://dx.doi.org/10.1177/0306312712471581",
      "doi": ""
    },
    {
      "text": "Noah Lenstra and Christine D'Arpa. 2019. Food Justice in the Public Library: Information, Resources, and Meals The International Journal of Information, Diversity and Inclusion 3, 4. https://doi.org/10.33137/ijidi.v3i4.33010",
      "doi": ""
    },
    {
      "text": "Tuck W. Leong and Martin Brynskov. 2009. Co2nfession: Engaging with Values through Urban Conversations. In Proceedings of Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7. ACM, Melbourne, Australia, 209-216. http://dx.doi.org/10.1145/1738826.1738860",
      "doi": ""
    },
    {
      "text": "Ann Light and Anna Seravalli. 2019. The Breakdown of the Municipality as Caring Platform: Lessons for Co-Design and Co-Learning in the Age of Platform Capitalism. CoDesign 15, 3, 192-211. http://dx.doi.org/10.1080/15710882.2019.1631354",
      "doi": ""
    },
    {
      "text": "K. Lindström, Ståhl, Å. 2014. Patchworking Publics-in-the-Making - Design, Media and Public Engagement. thesis. Malmö University,",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Shaowen Bardzell and Jeffrey Bardzell. 2018. Design and Intervention in the Age of “No Alternative”. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 109. http://dx.doi.org/10.1145/3274378",
      "doi": "10.1145/3274378"
    },
    {
      "text": "Patrick Lloyd. 2020. The Public Library as a Protective Factor: An Introduction to Library Social Work. Public Library Quarterly 39, 1, 50-63. http://dx.doi.org/10.1080/01616846.2019.1581872",
      "doi": ""
    },
    {
      "text": "Thomas Lodato. 2015. Division of Domestic Data. Retrieved September 10, 2019 from http://thomaslodato.info/projects/division-of-domestic-data/",
      "doi": ""
    },
    {
      "text": "Noortje Marres. 2007. The Issues Deserve More Credit: Pragmatist Contributions to the Study of Public Involvement in Controversy. Social Studies of Science 37, 5, 759-780. http://dx.doi.org/10.1177/0306312706077367",
      "doi": ""
    },
    {
      "text": "Noortje Marres. 2007. The Issues Deserve More Credit:Pragmatist Contributions to the Study of Public Involvement in Controversy. Social Studies of Science 37, 5, 759-780. http://dx.doi.org/10.1177/0306312706077367",
      "doi": ""
    },
    {
      "text": "Shannon Mattern. 2014. Library as Infrastructure. Places Journal, June. https://doi.org/10.22269/140609",
      "doi": ""
    },
    {
      "text": "Pamela J. McKenzie, Elena M Prigoda, Kristen Clement and Lynn McKechnie. 2007. Behind the Program-Room Door: The Creation of Parochial and Private Women's Realms in a Canadian Public Library. In The Library as Place: History, Community and Culture, John E Buschman and Gloria J. Leckie Eds. Libraries Unlimited, Westport, CT, 117-134.",
      "doi": ""
    },
    {
      "text": "Gabrielle Morley, Shellie Cooking and Crawford. Scott. 2019. Believe the Data! Expert Tips on Analyzing Data and Trends in Collection Development. Library Journal Webcast from February 5, 2019",
      "doi": ""
    },
    {
      "text": "Ray Oldenburg. 1989. The Great Good Place. Paragon Press, New York.",
      "doi": ""
    },
    {
      "text": "Ray Oldenburg. 2002. Celebrating the Third Place. De Capo Press, Boston, MA.",
      "doi": ""
    },
    {
      "text": "Tracey A. Overbey. 2020. Food Deserts, Libraries, and Urban Communities: What Is the Connection? Public Library Quarterly 39, 1, 37-49. http://dx.doi.org/10.1080/01616846.2019.1591156",
      "doi": ""
    },
    {
      "text": "Eric Paulos and Elizabeth Goodman. 2004. The Familiar Stranger: Anxiety, Comfort, and Play in Public Places. In Proceedings of Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Vienna, Austria, 223-230. http://dx.doi.org/10.1145/985692.985721",
      "doi": "10.1145/985692.985721"
    },
    {
      "text": "Lara Penin, Eduardo Staszowski, John Bruce, Barbara Adams and Mariana Amatullo. 2019. Public Libraries as Engines of Democracy: A Research and Pedagogical Case Study on Designing for Re-Entry. Nordes 2019: Who Cares? 2019, 8.",
      "doi": ""
    },
    {
      "text": "Steve Potash. 2019. Macmillan Publishes a Work of Fiction. Retrieved September 10, 2019 from https://overdrivesteve.com/macmillan-publishes-a-work-of-fiction/",
      "doi": ""
    },
    {
      "text": "Tara Pressley. 2017. Public Libraries, Serious Mental Illness, and Homelessness: A Survey of Public Librarians. Public Library Quarterly 36, 1, 61-76. http://dx.doi.org/10.1080/01616846.2017.1275772",
      "doi": ""
    },
    {
      "text": "Sebastian Prost, Vasilis Vlachokyriakos, Jane Midgley, Graeme Heron, Kahina Meziant and Clara Crivellaro. 2019. Infrastructuring Food Democracy: The Formation of a Local Food Hub in the Context of Socio-Economic Deprivation. Proc. ACM Hum.-Comput. Interact. 3, CSCW, 1-27. http://dx.doi.org/10.1145/3359159",
      "doi": ""
    },
    {
      "text": "Brian Real and Gayle Bogel. 2019. Public Libraries and the Opioid Crisis, Part 2: Community-Centered Responses. Public Library Quarterly 38, 3, 270-289. http://dx.doi.org/10.1080/01616846.2019.1635326",
      "doi": ""
    },
    {
      "text": "R. Anthony Reese. 2003. The First Sale Doctrine in the Era of Digital Networks. U of Texas Law, Public Law Research Paper No. 57; and U of Texas Law, Law and Econ Research Paper No. 004., 2003.",
      "doi": ""
    },
    {
      "text": "Ian Reid. 2017. The 2017 Public Library Data Service Report: Characteristics and Trends",
      "doi": ""
    },
    {
      "text": "Rachel Scott. 2011. The Role of Public Libraries in Community Building. Public Library Quarterly 30, 3, 191-227. http://dx.doi.org/10.1080/01616846.2011.599283",
      "doi": ""
    },
    {
      "text": "Bryan Semaan. 2019. “Routine Infrastructuring” as “Building Everyday Resilience with Technology”: When Disruption Becomes Ordinary. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 73. http://dx.doi.org/10.1145/3359175",
      "doi": "10.1145/3359175"
    },
    {
      "text": "Anna Seravalli, Mette Agger Eriksen and Per-Anders Hillgren. 2017. Co-Design in Co-Production Processes: Jointly Articulating and Appropriating Infrastructuring and Commoning with Civil Servants. CoDesign 13, 3, 187-201. http://dx.doi.org/10.1080/15710882.2017.1355004",
      "doi": ""
    },
    {
      "text": "Sofia Serholt, Eva Eriksson, Peter Dalsgaard, Raphaëlle Bats and Alix Ducros. 2018. Opportunities and Challenges for Technology Development and Adoption in Public Libraries. In Proceedings of Proceedings of the 10th Nordic Conference on Human-Computer Interaction. ACM, Oslo, Norway, 311-322. http://dx.doi.org/10.1145/3240167.3240198",
      "doi": "10.1145/3240167.3240198"
    },
    {
      "text": "Jo Shin, Gabriela Aceves Sepúlveda and William Odom. 2019. \"Collective Wisdom\": Inquiring into Collective Homes as a Site for Hci Design. In Proceedings of Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow, Scotland Uk, 1-14. http://dx.doi.org/10.1145/3290605.3300546",
      "doi": "10.1145/3290605.3300546"
    },
    {
      "text": "Jonas Söderholm and Jan Nolin. 2015. Collections Redux: The Public Library as a Place of Community Borrowing. The Library Quarterly: Information, Community, Policy 85, 3, 244-260. http://dx.doi.org/10.1086/681608",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Geoffrey C Bowker. 2002. How to Infrastructure. In The Handbook of New Media, L.A. Lievrouw and S.M Livingstone Eds. Sage, London, UK, 151-162.",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Geoffrey C. Bowker. 2002. How to Infrastructure. In Handbook of New Media: Social Shaping and Consequences of Icts, Leah A. Lievrouw and Sonia Livingstone Eds. SAGE Publications, Ltd, London. http://dx.doi.org/10.4135/9781848608245",
      "doi": ""
    },
    {
      "text": "Susan Leigh Star and Karen Ruhleder. 1994. Steps Towards an Ecology of Infrastructure: Complex Problems in Design and Access for Large-Scale Collaborative Systems. In Proceedings of Proceedings of the 1994 ACM conference on Computer supported cooperative work. Association for Computing Machinery, Chapel Hill, North Carolina, USA, 253–264. http://dx.doi.org/10.1145/192844.193021",
      "doi": "10.1145/192844.193021"
    },
    {
      "text": "Rosemary Steup, Arvind Santhanam, Marisa Logan, Lynn Dombrowski and Norman Makoto Su. 2018. Growing Tiny Publics: Small Farmers’ Social Movement Strategies. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 165. http://dx.doi.org/10.1145/3274434",
      "doi": "10.1145/3274434"
    },
    {
      "text": "Jennifer Stoll, W. Keith Edwards and Kirsten A. Foot. 2012. Between Us and Them: Building Connectedness within Civic Networks. In Proceedings of Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work. ACM, Seattle, Washington, USA, 237-240. http://dx.doi.org/10.1145/2145204.2145240",
      "doi": ""
    },
    {
      "text": "Kathleen Sturgeon. 2019. Drag Queen Snubbed from Alpharetta Library Storytime Fights Back Retrieved September 2, 2019 from https://patch.com/georgia/alpharetta/drag-queen-snubbed-alpharetta-library-storytime-fights-back.",
      "doi": ""
    },
    {
      "text": "Vasillis Vlachokyriakos, Clara Crivellaro, Christopher A. Le Dantec, Eric Gordon, Pete Wright and Patrick Olivier. 2016. Digital Civics: Citizen Empowerment with and through Technology. In Proceedings of Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, San Jose, California, USA, 1096-1099. http://dx.doi.org/10.1145/2851581.2886436",
      "doi": "10.1145/2851581.2886436"
    },
    {
      "text": "Vasillis Vlachokyriakos, Clara Crivellaro, Pete Wright and Patrick Olivier. 2018. Infrastructuring the Solidarity Economy: Unpacking Strategies and Tactics in Designing Social Innovation. In Proceedings of Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Montreal QC, Canada, Paper 481. http://dx.doi.org/10.1145/3173574.3174055",
      "doi": "10.1145/3173574.3174055"
    },
    {
      "text": "Emily Wagner. 2019. Ala Denounces New Macmillan Library Lending Model, Urging Library Customer Voice Objections. Retrieved September 10, 2019 from http://www.ala.org/news/press-releases/2019/07/ala-denounces-new-macmillan-library-lending-model-urges-library-customers.",
      "doi": ""
    },
    {
      "text": "David Weinberger. 2012. Library as Platform.",
      "doi": ""
    },
    {
      "text": "Wayne A Wiegand. 2015. Part of Our Lives: A People's History of the American Public Library. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Taylor L. Willingham. 2008. Libraries as Civic Agents. Public Library Quarterly 27, 2, 97-110. http://dx.doi.org/10.1080/01616840802114820",
      "doi": ""
    },
    {
      "text": "Emma Wood. 2020. Libraries Full Circle: The Cross Section of Community, the Public Sphere, and Third Place. Public Library Quarterly, 1-23. http://dx.doi.org/10.1080/01616846.2020.1737491",
      "doi": ""
    },
    {
      "text": "Johanna Ylipulli and Aale Luusua. 2019. Without Libraries What Have We? Public Libraries as Nodes for Technological Empowerment in the Era of Smart Cities, Ai and Big Data. In Proceedings of Proceedings of the 9th International Conference on Communities & Technologies - Transforming Communities. Association for Computing Machinery, Vienna, Austria, 92–101. http://dx.doi.org/10.1145/3328320.3328387",
      "doi": ""
    },
    {
      "text": "Daisy Yoo, Peter Dalsgaard, Alix Ducros, Aurélien Tabard, Eva Eriksson and Clemens Nylandsted Klokmose. 2020. Putting Down Roots: Exploring the Placeness of Virtual Collections in Public Libraries. In Proceedings of Proceedings of the 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, Eindhoven, Netherlands, 723–734. http://dx.doi.org/10.1145/3357236.3395587",
      "doi": "10.1145/3357236.3395587"
    },
    {
      "text": "Daisy Yoo, Aurélien Tabard, Alix Ducros, Peter Dalsgaard, Clemens Nylandsted Klokmose, Eva Eriksson and Sofia Serholt. 2020. Computational Alternatives Vignettes for Place- and Activity-Centered Digital Services in Public Libraries. In Proceedings of Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Honolulu, HI, USA, 1–12. http://dx.doi.org/10.1145/3313831.3376597",
      "doi": "10.1145/3313831.3376597"
    }
  ]
}