{
  "doi": "10.1145/3411764.3445426",
  "title": "Remote and Collaborative Virtual Reality Experiments via Social VR Platforms",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Virtual reality (VR) researchers struggle to conduct remote studies. Previous work has focused on working around limitations imposed by traditional crowdsourcing methods. However, the potential for leveraging social VR platforms for HCI evaluations is largely unexplored. These platforms have large VR-ready user populations, distributed synchronous virtual environments, and support for user-generated content. We demonstrate how social VR platforms can be used to practically and ethically produce valid research results by replicating two studies using one such platform (VRChat): a quantitative study on Fitts’ Law and a qualitative study on tabletop collaboration. Our replication studies exhibited analogous results to the originals, indicating the research validity of this approach. Moreover, we easily recruited experienced VR users with their own hardware for synchronous, remote, and collaborative participation. We further provide lessons learned for future researchers experimenting using social VR platforms. This paper and all supplemental materials are available at osf.io/c2amz.",
  "authors": [
    {
      "name": "David Saffo",
      "institution": "Khoury College of Computer Sciences, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526566",
      "orcid": "0000-0001-9515-048X"
    },
    {
      "name": "Sara Di Bartolomeo",
      "institution": "Khoury College of Computer Sciences, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529145",
      "orcid": "missing"
    },
    {
      "name": "Caglar Yildirim",
      "institution": "Khoury College of Computer Sciences, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658713768",
      "orcid": "missing"
    },
    {
      "name": "Cody Dunne",
      "institution": "Khoury College of Computer Sciences, Northeastern University, United States",
      "img": "/do/10.1145/contrib-81384605317/rel-imgonly/cody_dunne_2016_ccis_photo_shoot_small.jpg",
      "acmid": "81384605317",
      "orcid": "0000-0002-1609-9776"
    }
  ],
  "references": [
    {
      "text": "Fouad Alallah, Ali Neshati, Nima Sheibani, Yumiko Sakamoto, Andrea Bunt, Pourang Irani, and Khalad Hasan. 2018. Crowdsourcing vs Laboratory-Style Social Acceptability Studies? Examining the Social Acceptability of Spatial User Interactions for Head-Worn Displays. In Proc. 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3173574.3173884",
      "doi": ""
    },
    {
      "text": "Sara Albakry, Kami Vaniea, and Maria K. Wolters. 2020. What is This URL’s Destination? Empirical Evaluation of Users’ URL Reading. In Proc. 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376168",
      "doi": "10.1145/3313831.3376168"
    },
    {
      "text": "Mayra Donaji Barrera Machuca and Wolfgang Stuerzlinger. 2019. The Effect of Stereo Display Deficiencies on Virtual Hand Pointing. In Proc. 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300437",
      "doi": "10.1145/3290605.3300437"
    },
    {
      "text": "Adam J. Berinsky, Gregory A. Huber, and Gabriel S. Lenz. 2012. Evaluating Online Labor Markets for Experimental Research: Amazon.com’s Mechanical Turk. Political Analysis 20, 3 (2012), 351–368. https://doi.org/10.1093/pan/mpr057",
      "doi": ""
    },
    {
      "text": "Conrad Boton. 2018. Supporting constructability analysis meetings with Immersive Virtual Reality-based collaborative BIM 4D simulation. Automation in Construction 96 (2018), 1 – 15. https://doi.org/10.1016/j.autcon.2018.08.020",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D. Gosling. 2011. Amazon’s mechanical Turk: A new source of inexpensive, yet high-quality, data?Perspectives on Psychological Science 6, 1 (23 8 2011), 3–5. https://doi.org/10.1177/1745691610393980",
      "doi": ""
    },
    {
      "text": "Yeonjoo Cha and Rohae Myung. 2013. Extended Fitts’ law for 3D pointing tasks using 3D target arrangements. International Journal of Industrial Ergonomics 43, 4(2013), 350 – 355. https://doi.org/10.1016/j.ergon.2013.05.005",
      "doi": ""
    },
    {
      "text": "Logan D. Clark, Aakash B. Bhagat, and Sara L. Riggs. 2020. Extending Fitts’ law in three-dimensional virtual environments with current low-cost virtual reality technology. International Journal of Human-Computer Studies 139 (2020), 102413. https://doi.org/10.1016/j.ijhcs.2020.102413",
      "doi": ""
    },
    {
      "text": "William S. Cleveland and Robert McGill. 1984. Graphical Perception: Theory, Experimentation, and Application to the Development of Graphical Methods. J. Amer. Statist. Assoc. 79, 387 (1984), 531–554. https://doi.org/10.1080/01621459.1984.10478080",
      "doi": "10.2307/2288400"
    },
    {
      "text": "Arindam Dey, Thammathip Piumsomboon, Youngho Lee, and Mark Billinghurst. 2017. Effects of Sharing Physiological States of Players in a Collaborative Virtual Reality Gameplay. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4045–4056. https://doi.org/10.1145/3025453.3026028",
      "doi": "10.1145/3025453.3026028"
    },
    {
      "text": "Sara Di Bartolomeo, Aditeya Pandey, Aristotelis Leventidis, David Saffo, Uzma Haque Syeda, Elin Carstensdottir, Magy Seif El-Nasr, Michelle A. Borkin, and Cody Dunne. 2020. Evaluating the Effect of Timeline Shape on Visualization Task Performance. In Proc. 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376237",
      "doi": "10.1145/3313831.3376237"
    },
    {
      "text": "Leah Findlater, Joan Zhang, Jon E. Froehlich, and Karyn Moffatt. 2017. Differences in Crowdsourced vs. Lab-Based Mobile and Desktop Input Performance Data. In Proc. 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6813–6824. https://doi.org/10.1145/3025453.3025820",
      "doi": "10.1145/3025453.3025820"
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing Graphical Perception: Using Mechanical Turk to Assess Visualization Design. In Proc. SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 203–212. https://doi.org/10.1145/1753326.1753357",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Errol R. Hoffman. 1995. Effective target tolerance in an inverted Fitts task. Ergonomics 38, 4 (1995), 828–836. https://doi.org/10.1080/00140139508925153",
      "doi": ""
    },
    {
      "text": "Jonggi Hong, Kyungjun Lee, June Xu, and Hernisa Kacorri. 2020. Crowdsourcing the Perception of Machine Teaching. In Proc. 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376428",
      "doi": "10.1145/3313831.3376428"
    },
    {
      "text": "Bernd Huber and Krzysztof Z. Gajos. 2020. Conducting online virtual environment experiments with uncompensated, unsupervised samples. PLOS ONE 15, 1 (01 2020), 1–17. https://doi.org/10.1371/journal.pone.0227629",
      "doi": ""
    },
    {
      "text": "Aristotelis Leventidis, Jiahui Zhang, Cody Dunne, Wolfgang Gatterbauer, H.V. Jagadish, and Mirek Riedewald. 2020. QueryVis: Logic-Based Diagrams Help Users Understand Complicated SQL Queries Faster. In Proc. 2020 ACM SIGMOD International Conference on Management of Data (Portland, OR, USA) (SIGMOD ’20). 2303–2318. https://doi.org/10.1145/3318464.3389767",
      "doi": "10.1145/3318464.3389767"
    },
    {
      "text": "Xiao Ma, Megan Cackett, Leslie Park, Eric Chien, and Mor Naaman. 2018. Web-Based VR Experiments Powered by the Crowd. In Proc. 2018 World Wide Web Conference(WWW ’18). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 33–43. https://doi.org/10.1145/3178876.3186034",
      "doi": "10.1145/3178876.3186034"
    },
    {
      "text": "Maya Mathur and Tyler VanderWeele. 2019. Challenges and suggestions for defining replication ”success” when effects may be heterogeneous: Comment on Hedges and Schauer (2019). Psychological Methods 24 (10 2019), 571–575. https://doi.org/10.1037/met0000223",
      "doi": ""
    },
    {
      "text": "MerlinVR. 2020. UdonSharp. https://github.com/MerlinVR/UdonSharp.",
      "doi": ""
    },
    {
      "text": "Aske Mottelson and Kasper Hornbundefinedk. 2017. Virtual Reality Studies Outside the Laboratory. In Proc. 23rd ACM Symposium on Virtual Reality Software and Technology (Gothenburg, Sweden) (VRST ’17). Association for Computing Machinery, New York, NY, USA, Article 9, 10 pages. https://doi.org/10.1145/3139131.3139141",
      "doi": "10.1145/3139131.3139141"
    },
    {
      "text": "Atsuo Murata and Hirokazu Iwase. 2001. Extending Fitts’ law to a three-dimensional pointing task. Human Movement Science 20, 6 (2001), 791 – 805. https://doi.org/10.1016/S0167-9457(01)00058-6",
      "doi": ""
    },
    {
      "text": "Oculus. 2020. A Single Way to Log Into Oculus and Unlock Social Features. https://www.oculus.com/blog/a-single-way-to-log-into-oculus-and-unlock-social-features/",
      "doi": ""
    },
    {
      "text": "G. Paolacci, J. Chandler, and P.G. Ipeirotis. 2010. Running experiments on Amazon Mechanical Turk. Judgment and Decision Making 5, 5 (2010), 411–419. https://ssrn.com/abstract=1626226",
      "doi": ""
    },
    {
      "text": "David G. Rand. 2012. The promise of Mechanical Turk: How online labor markets can help theorists run behavioral experiments. Journal of Theoretical Biology 299 (2012), 172 – 179. https://doi.org/10.1016/j.jtbi.2011.03.004 Evolution of Cooperation.",
      "doi": ""
    },
    {
      "text": "Joel Ross, Lilly Irani, M. Six Silberman, Andrew Zaldivar, and Bill Tomlinson. 2010. Who Are the Crowdworkers? Shifting Demographics in Mechanical Turk. In CHI ’10 Extended Abstracts on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI EA ’10). Association for Computing Machinery, New York, NY, USA, 2863–2872. https://doi.org/10.1145/1753846.1753873",
      "doi": "10.1145/1753846.1753873"
    },
    {
      "text": "David Saffo, Caglar Yildirim, Sara Di Bartolomeo, and Cody Dunne. 2020. Crowdsourcing Virtual Reality Experiments Using VRChat. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382829",
      "doi": "10.1145/3334480.3382829"
    },
    {
      "text": "SCRN-VRC. 2020. SimpNet-Deep-Learning-in-a-Shader. https://github.com/SCRN-VRC/SimpNet-Deep-Learning-in-a-Shader.",
      "doi": ""
    },
    {
      "text": "Danielle N. Shapiro, Jesse Chandler, and Pam A. Mueller. 2013. Using Mechanical Turk to Study Clinical Populations. Clinical Psychological Science 1, 2 (2013), 213–220. https://doi.org/10.1177/2167702612469015",
      "doi": ""
    },
    {
      "text": "A. Steed, Sebastian Friston, María Murcia-López, Jason Drummond, Ye Pan, and D. Swapp. 2016. An ‘In the Wild’ Experiment on Presence and Embodiment using Consumer Virtual Reality Equipment. IEEE Transactions on Visualization and Computer Graphics 22 (2016), 1406–1414.",
      "doi": "10.1109/TVCG.2016.2518135"
    },
    {
      "text": "Anthony Steed, Francisco R. Ortega, Adam S. Williams, Ernst Kruijff, Wolfgang Stuerzlinger, Anil Ufuk Batmaz, Andrea Stevenson Won, Evan Suma Rosenberg, Adalberto L. Simeone, and Aleshia Hayes. 2020. Evaluating Immersive Experiences during Covid-19 and Beyond. Interactions 27, 4 (2020), 62–67. https://doi.org/10.1145/3406098",
      "doi": "10.1145/3406098"
    },
    {
      "text": "suzuki_i. 2020. Portal Gun (UDON). https://vrchat.com/home/launch?worldId=wrld_b0396e28-6d1c-4b8a-86b6-31b8389154e5.",
      "doi": ""
    },
    {
      "text": "[33] Anthony Tang.2020.",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Melanie Tory, Barry Po, Petra Neumann, and Sheelagh Carpendale. 2006. Collaborative Coupling over Tabletop Displays. In Proc. SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 1181–1190. https://doi.org/10.1145/1124772.1124950",
      "doi": "10.1145/1124772.1124950"
    },
    {
      "text": "Varneon. 2020. Extended clip from my upcoming monthly development vlog showing the #UdonSharp Cubic Bezier Curve I did few weeks ago. #VRChat #MadeWithUdon. https://twitter.com/VarneonOfficial/status/1300438000745078786.",
      "doi": ""
    },
    {
      "text": "@VRChat. 2019. Thanks to our community for making 2018 #VRChat’s best year yet!Tweet. Retrieved 02 Nov 2019 from https://twitter.com/VRChat/status/1086389685268635648.",
      "doi": ""
    },
    {
      "text": "VRChat. 2019. VRChat Partners with HTC and Makers Fund to Close $10m Series C. https://medium.com/vrchat/vrchat-partners-with-htc-and-makers-fund-to-close-10m-series-c-50ea04d5ca23",
      "doi": ""
    },
    {
      "text": "Cheng Yao Wang, Mose Sakashita, Upol Ehsan, Jingjin Li, and Andrea Stevenson Won. 2020. Again, Together: Socially Reliving Virtual Reality Experiences When Separated. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376642",
      "doi": "10.1145/3313831.3376642"
    }
  ]
}