{
  "doi": "10.1145/3411764.3445117",
  "title": "Vinci: An Intelligent Graphic Design System for Generating Advertising Posters",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "Advertising posters are a commonly used form of information presentation to promote a product. Producing advertising posters often takes much time and effort of designers when confronted with abundant choices of design elements and layouts. This paper presents Vinci, an intelligent system that supports the automatic generation of advertising posters. Given the user-specified product image and taglines, Vinci uses a deep generative model to match the product image with a set of design elements and layouts for generating an aesthetic poster. The system also integrates online editing-feedback that supports users in editing the posters and updating the generated results with their design preference. Through a series of user studies and a Turing test, we found that Vinci can generate posters as good as human designers and that the online editing-feedback improves the efficiency in poster modification.",
  "tags": [
    "Graphic design",
    "design tool",
    "deep generative networks"
  ],
  "authors": [
    {
      "name": "Shunan Guo",
      "institution": "Intelligent Big Data Visualization Lab Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261837",
      "orcid": "0000-0001-5355-8399"
    },
    {
      "name": "Zhuochen Jin",
      "institution": "Intelligent Big Data Visualization Lab Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659283931",
      "orcid": "missing"
    },
    {
      "name": "Fuling Sun",
      "institution": "Intelligent Big Data Visualization Lab Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701949",
      "orcid": "missing"
    },
    {
      "name": "Jingwen Li",
      "institution": "Intelligent Big Data Visualization Lab, Tongji University, China, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702660",
      "orcid": "missing"
    },
    {
      "name": "Zhaorui Li",
      "institution": "Intelligent Big Data Visualization Lab Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700937",
      "orcid": "missing"
    },
    {
      "name": "Yang Shi",
      "institution": "Intelligent Big Data Visualization Lab Tongji College of Design and Innovation, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556666156",
      "orcid": "missing"
    },
    {
      "name": "Nan Cao",
      "institution": "Intelligent Big Data Visualization Lab Tongji College of Design and Innovation, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320488328",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fernando Alonso, José Luis Fuertes, Ángel Lucas González, and Loïc Martínez. 2010. On the Testability of WCAG 2.0 for Beginners. In Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A) (Raleigh, North Carolina) (W4A ’10). Association for Computing Machinery, New York, NY, USA, Article 9, 9 pages. https://doi.org/10.1145/1805986.1806000",
      "doi": "10.1145/1805986.1806000"
    },
    {
      "text": "Christopher M Bishop. 1994. Mixture density networks. Technical Report. Citeseer.",
      "doi": ""
    },
    {
      "text": "Samuel R. Bowman, Luke Vilnis, Oriol Vinyals, Andrew Dai, Rafal Jozefowicz, and Samy Bengio. 2016. Generating Sentences from a Continuous Space. In Proceedings of The 20th SIGNLL Conference on Computational Natural Language Learning. Association for Computational Linguistics, Berlin, Germany, 10–21. https://doi.org/10.18653/v1/K16-1002",
      "doi": ""
    },
    {
      "text": "Nan Cao, Xin Yan, Yang Shi, and Chaoran Chen. 2019. AI-Sketcher : A Deep Generative Model for Producing High-Quality Sketches. Proceedings of the AAAI Conference on Artificial Intelligence 33, 01 (Jul. 2019), 2564–2571. https://doi.org/10.1609/aaai.v33i01.33012564",
      "doi": "10.1609/aaai.v33i01.33012564"
    },
    {
      "text": "Jie Chang, Yujun Gu, and Ya Zhang. 2017. Chinese Typeface Transformation with Hierarchical Adversarial Network. CoRR abs/1711.06448(2017), 9. arxiv:1711.06448http://arxiv.org/abs/1711.06448",
      "doi": ""
    },
    {
      "text": "Gang Chen, Peihong Xie, Jing Dong, and Tianfu Wang. 2019. Understanding programmatic creative: The role of AI. Journal of Advertising 48, 4 (2019), 347–355.",
      "doi": ""
    },
    {
      "text": "Peggy Chi, Zheng Sun, Katrina Panovich, and Irfan Essa. 2020. Automatic Video Creation From a Web Page. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 279–292. https://doi.org/10.1145/3379337.3415814",
      "doi": "10.1145/3379337.3415814"
    },
    {
      "text": "J. Deng, W. Dong, R. Socher, L. Li, Kai Li, and Li Fei-Fei. 2009. ImageNet: A large-scale hierarchical image database. In 2009 IEEE Conference on Computer Vision and Pattern Recognition. IEEE, Miami, FL, USA, 248–255. https://doi.org/10.1109/CVPR.2009.5206848",
      "doi": ""
    },
    {
      "text": "V. Dibia and Ç. Demiralp. 2019. Data2Vis: Automatic Generation of Data Visualizations Using Sequence-to-Sequence Recurrent Neural Networks. IEEE Computer Graphics and Applications 39, 5 (2019), 33–46. https://doi.org/10.1109/MCG.2019.2924636",
      "doi": "10.1109/MCG.2019.2924636"
    },
    {
      "text": "Leon A Gatys, Alexander S Ecker, and Matthias Bethge. 2016. Image style transfer using convolutional neural networks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. IEEE, Las Vegas, NV, USA, 2414–2423.",
      "doi": ""
    },
    {
      "text": "Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. 2014. Generative adversarial nets. In Advances in neural information processing systems. Curran Associates, Inc., Palais des Congrès de Montréal, Montréal CANADA, 2672–2680.",
      "doi": ""
    },
    {
      "text": "David Ha and Douglas Eck. 2017. A Neural Representation of Sketch Drawings. CoRR abs/1704.03477(2017), 15. arxiv:1704.03477http://arxiv.org/abs/1704.03477",
      "doi": ""
    },
    {
      "text": "Melanie Hartmann. 2009. Challenges in Developing User-Adaptive Intelligent User Interfaces. In LWA 2009: Workshop-Woche: Lernen, Wissen, Adaptivität, Darmstadt, 21.-23. September 2009, Melanie Hartmann and Frederik Janssen (Eds.), Vol. TUD-CS-2009-0157/TUD-KE-2009-04. FG Telekooperation/FG Knowledge Engineering, Technische Universität Darmstadt, Germany, Darmstadt, Germany, ABIS:6–10.",
      "doi": ""
    },
    {
      "text": "Simon Haykin. 1994. Neural Networks: A Comprehensive Foundation (1st ed.). Prentice Hall PTR, USA.",
      "doi": ""
    },
    {
      "text": "Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long short-term memory. Neural Computation 9, 8 (1997), 1735–1780.",
      "doi": "10.1162/neco.1997.9.8.1735"
    },
    {
      "text": "Ali Jahanian. 2016. Automatic Design of Self-Published Media: A Case Study of Magazine Covers. Springer International Publishing, Cham, 69–99. https://doi.org/10.1007/978-3-319-31486-0_5",
      "doi": ""
    },
    {
      "text": "Anthony David Jameson. 2009. Understanding and dealing with usability side effects of intelligent processing. AI Magazine 30, 4 (2009), 23–23.",
      "doi": ""
    },
    {
      "text": "Yanghua Jin, Jiakai Zhang, Minjun Li, Yingtao Tian, Huachun Zhu, and Zhihao Fang. 2018. MakeGirlsMoe - Create Anime Characters with A.I.!https://make.girls.moe/.",
      "doi": ""
    },
    {
      "text": "David Johnson. 2005. Psychology of Colors.",
      "doi": ""
    },
    {
      "text": "Diederik P. Kingma and Jimmy Ba. 2017. Adam: A Method for Stochastic Optimization. arxiv:1412.6980 [cs.LG]",
      "doi": ""
    },
    {
      "text": "Diederik P Kingma and Max Welling. 2014. Auto-Encoding Variational Bayes. arxiv:1312.6114 [stat.ML]",
      "doi": ""
    },
    {
      "text": "Solomon Kullback and Richard A Leibler. 1951. On information and sufficiency. The Annals of Mathematical Statistics 22, 1 (1951), 79–86.",
      "doi": "10.1214/aoms"
    },
    {
      "text": "Robin Landa. 2010. Graphic design solutions.",
      "doi": ""
    },
    {
      "text": "Yann LeCun, Léon Bottou, Yoshua Bengio, and Patrick Haffner. 1998. Gradient-based learning applied to document recognition. Proc. IEEE 86, 11 (1998), 2278–2324.",
      "doi": ""
    },
    {
      "text": "Jianan Li, Jimei Yang, Aaron Hertzmann, Jianming Zhang, and Tingfa Xu. 2019. LayoutGAN: Generating Graphic Layouts with Wireframe Discriminators. arxiv:1901.06767 [cs.CV]",
      "doi": ""
    },
    {
      "text": "Simon Lok and Steven Feiner. 2001. A survey of automated layout techniques for information presentations. Proceedings of SmartGraphics 2001 (2001), 61–68.",
      "doi": ""
    },
    {
      "text": "Jock Mackinlay. 1988. Applying a theory of graphical presentation to the graphic design of user interfaces. In Proceedings of the ACM SIGGRAPH symposium on User Interface Software. ACM, Alberta, Canada, 179–189.",
      "doi": "10.1145/62402.62431"
    },
    {
      "text": "Peter O’Donovan, Aseem Agarwala, and Aaron Hertzmann. 2015. Designscape: Design with interactive layout suggestions. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, Seoul, Republic of Korea, 1221–1224.",
      "doi": "10.1145/2702123.2702149"
    },
    {
      "text": "Yu-ting Qiang, Yan-Wei Fu, Xiao Yu, Yan-Wen Guo, Zhi-Hua Zhou, and Leonid Sigal. 2019. Learning to Generate Posters of Scientific Papers by Probabilistic Graphical Models. Journal of Computer Science and Technology 34, 1 (2019), 155–169.",
      "doi": ""
    },
    {
      "text": "Steven F. Roth, John Kolojejchick, Joe Mattis, and Jade Goldstein. 1994. Interactive graphic design using automatic presentation knowledge. In Conference on Human Factors in Computing Systems, CHI 1994, Boston, Massachusetts, USA, April 24-28, 1994, Proceedings, Beth Adelson, Susan T. Dumais, and Judith S. Olson(Eds.). ACM, Massachusetts, USA, 112–117. https://doi.org/10.1145/191666.191719",
      "doi": ""
    },
    {
      "text": "Olga Russakovsky, Jia Deng, Hao Su, Jonathan Krause, Sanjeev Satheesh, Sean Ma, Zhiheng Huang, Andrej Karpathy, Aditya Khosla, Michael Bernstein, 2015. Imagenet large scale visual recognition challenge. International Journal of Computer Vision 115, 3 (2015), 211–252.",
      "doi": "10.1007/s11263-015-0816-y"
    },
    {
      "text": "Timothy Samara. 2017. Making and Breaking the Grid, Updated and Expanded: A Graphic Design Layout Workshop.",
      "doi": ""
    },
    {
      "text": "Yang Shi, Nan Cao, Xiaojuan Ma, Siji Chen, and Pei Liu. 2020. EmoG: Supporting the Sketching of Emotional Expressions for Storyboarding. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Oahu, Hawaii, USA, 1–12.",
      "doi": "10.1145/3313831.3376520"
    },
    {
      "text": "Terry Lee Stone, Sean Adams, and Noreen Morioka. 2008. Color design workbook: A real world guide to using color in graphic design.",
      "doi": ""
    },
    {
      "text": "Chen Sun, Abhinav Shrivastava, Saurabh Singh, and Abhinav Gupta. 2017. Revisiting unreasonable effectiveness of data in deep learning era. In Proceedings of the IEEE international conference on computer vision. IEEE, Venice, Italy, 843–852.",
      "doi": ""
    },
    {
      "text": "Sou Tabata, Haruka Maeda, Keigo Hirokawa, and Kei Yokoyama. 2019. Diverse Layout Generation for Graphical Design Magazines. In SIGGRAPH Asia 2019 Posters. ACM, BCEC, Brisbane, Australia, 1–2.",
      "doi": ""
    },
    {
      "text": "Sou Tabata, Hiroki Yoshihara, Haruka Maeda, and Kei Yokoyama. 2019. Automatic layout generation for graphical design magazines. In ACM SIGGRAPH 2019 Posters. ACM, Los Angeles, USA, 1–2.",
      "doi": "10.1145/3306214.3338574"
    },
    {
      "text": "Kashyap Todi, Daryl Weir, and Antti Oulasvirta. 2016. Sketchplore: Sketch and explore with a layout optimiser. In Proceedings of the ACM Conference on Designing Interactive Systems. ACM, Brisbane QLD Australia, 543–555.",
      "doi": "10.1145/2901790.2901817"
    },
    {
      "text": "Sreekanth Vempati, Korah T Malayil, Sruthi V, and Sandeep R. 2019. Enabling Hyper-Personalisation: Automated Ad Creative Generation and Ranking for Fashion e-Commerce. arxiv:1908.10139 [cs.IR]",
      "doi": ""
    },
    {
      "text": "Xin Wang, Geoffrey Oxholm, Da Zhang, and Yuan-Fang Wang. 2017. Multimodal transfer: A hierarchical deep convolutional neural network for fast artistic style transfer. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. IEEE, Honolulu, HI, USA, 5239–5247.",
      "doi": ""
    },
    {
      "text": "Xuyong Yang, Tao Mei, Ying-Qing Xu, Yong Rui, and Shipeng Li. 2016. Automatic generation of visual-textual presentation layout. ACM Transactions on Multimedia Computing, Communications, and Applications 12, 2(2016), 33.",
      "doi": "10.1145/2818709"
    },
    {
      "text": "Wenyuan Yin, Tao Mei, and Chang Wen Chen. 2013. Automatic generation of social media snippets for mobile browsing. In Proceedings of the ACM International Conference on Multimedia. ACM, Barcelona, Spain, 927–936.",
      "doi": "10.1145/2502081.2502116"
    },
    {
      "text": "Lvmin Zhang, Chengze Li, Tien-Tsin Wong, Yi Ji, and Chunping Liu. 2018. Two-stage sketch colorization. In SIGGRAPH Asia Technical Papers. ACM, ACM, Tokyo, Japan, 261.",
      "doi": ""
    },
    {
      "text": "Nanxuan Zhao, Ying Cao, and Rynson WH Lau. 2018. What characterizes personalities of graphic designs?ACM Transactions on Graphics 37, 4 (2018), 116.",
      "doi": ""
    },
    {
      "text": "Nanxuan Zhao, Nam Wook Kim, Laura Mariah Herman, Hanspeter Pfister, Rynson WH Lau, Jose Echevarria, and Zoya Bylinskii. 2020. ICONATE: Automatic Compound Icon Generation and Ideation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Oahu, Hawaii, USA, 1–13.",
      "doi": "10.1145/3313831.3376618"
    },
    {
      "text": "Shuyu Zheng, Ziniu Hu, and Yun Ma. 2019. FaceOff: Assisting the Manifestation Design of Web Graphical User Interface. In Proceedings of the ACM International Conference on Web Search and Data Mining. ACM, Melbourne, Australia, 774–777.",
      "doi": "10.1145/3289600.3290610"
    },
    {
      "text": "Xinru Zheng, Xiaotian Qiao, Ying Cao, and Rynson WH Lau. 2019. Content-aware generative modeling of graphic design layouts. ACM Transactions on Graphics (TOG) 38, 4 (2019), 1–15.",
      "doi": "10.1145/3306346.3322971"
    },
    {
      "text": "Jun-Yan Zhu, Philipp Krähenbühl, Eli Shechtman, and Alexei A Efros. 2016. Generative visual manipulation on the natural image manifold. In Proceedings of the European Conference on Computer Vision. Springer, Springer, Amsterdam, The Netherlands, 597–613.",
      "doi": ""
    },
    {
      "text": "Jun-Yan Zhu, Taesung Park, Phillip Isola, and Alexei A. Efros. 2017. Unpaired Image-to-Image Translation Using Cycle-Consistent Adversarial Networks. In IEEE International Conference on Computer Vision. IEEE, Venice, Italy, 2242–2251.",
      "doi": ""
    }
  ]
}