{
  "doi": "10.1145/3411764.3445431",
  "title": "EventAnchor: Reducing Human Interactions in Event Annotation of Racket Sports Videos",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "The popularity of racket sports (e.g., tennis and table tennis) leads to high demands for data analysis, such as notational analysis, on player performance. While sports videos offer many benefits for such analysis, retrieving accurate information from sports videos could be challenging. In this paper, we propose EventAnchor, a data analysis framework to facilitate interactive annotation of racket sports video with the support of computer vision algorithms. Our approach uses machine learning models in computer vision to help users acquire essential events from videos (e.g., serve, the ball bouncing on the court) and offers users a set of interactive tools for data annotation. An evaluation study on a table tennis annotation system built on this framework shows significant improvement of user performances in simple annotation tasks on objects of interest and complex annotation tasks requiring domain knowledge.",
  "tags": [
    "computer vision",
    "Racket sports",
    "data annotation",
    "visualization"
  ],
  "authors": [
    {
      "name": "Dazhen Deng",
      "institution": "The State Key Lab of CAD&CG, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701443",
      "orcid": "missing"
    },
    {
      "name": "Jiang Wu",
      "institution": "The State Key Lab of CAD&CG, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702487",
      "orcid": "missing"
    },
    {
      "name": "Jiachen Wang",
      "institution": "The State Key Lab of CAD&CG, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702657",
      "orcid": "missing"
    },
    {
      "name": "Yihong Wu",
      "institution": "The State Key Lab of CAD&CG, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701449",
      "orcid": "missing"
    },
    {
      "name": "Xiao Xie",
      "institution": "The State Key Lab of CAD&CG, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702570",
      "orcid": "missing"
    },
    {
      "name": "Zheng Zhou",
      "institution": "Department of Sport Science, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701240",
      "orcid": "missing"
    },
    {
      "name": "Hui Zhang",
      "institution": "Department of Sport Science, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700984",
      "orcid": "missing"
    },
    {
      "name": "Xiaolong (Luke) Zhang",
      "institution": "College of Information Sciences and Technology, Pennsylvania State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316491376",
      "orcid": "missing"
    },
    {
      "name": "Yingcai Wu",
      "institution": "The State Key Lab of CAD&CG, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81388595547",
      "orcid": "0000-0002-1119-3237"
    }
  ],
  "references": [
    {
      "text": "2004. Notational Analysis of Sport: Systems for Better Coaching and Performance in Sport. Journal of Sports Science & Medicine 3, 2 (01 Jun 2004), 104–104.",
      "doi": ""
    },
    {
      "text": "2019. ITF Global Tennis Report 2019: A Report on Tennis Participation and Performance Worldwide. http://itf.uberflip.com/i/1169625-itf-global-tennis-report-2019-overview. Accessed: 2020-08-27.",
      "doi": ""
    },
    {
      "text": "Abir Al Hajri, Matthew Fong, Gregor Miller, and Sidney S Fels. 2014. Fast forward with your VCR: visualizing single-video viewing statistics for navigation and sharing.. In Graphics Interface. 123–128.",
      "doi": ""
    },
    {
      "text": "Alex Bewley, ZongYuan Ge, Lionel Ott, Fabio Ramos, and Ben Upcroft. 2016. Simple Online and Realtime Tracking. CoRR abs/1602.00763(2016). http://arxiv.org/abs/1602.00763",
      "doi": ""
    },
    {
      "text": "Simone Bianco, Gianluigi Ciocca, Paolo Napoletano, and Raimondo Schettini. 2015. An interactive tool for manual, semi-automatic and automatic video annotation. Computer Vision and Image Understanding 131 (2015), 88–99. https://doi.org/10.1016/j.cviu.2014.06.015",
      "doi": "10.1016/j.cviu.2014.06.015"
    },
    {
      "text": "Tewodros A Biresaw, Tahir Nawaz, James Ferryman, and Anthony I Dell. 2016. ViTBAT: Video tracking and behavior annotation tool. In 2016 13th IEEE International Conference on Advanced Video and Signal Based Surveillance (AVSS). IEEE, 295–301.",
      "doi": ""
    },
    {
      "text": "Zhe Cao, Gines Hidalgo, Tomas Simon, Shih-En Wei, and Yaser Sheikh. 2018. OpenPose: Realtime Multi-Person 2D Pose Estimation using Part Affinity Fields. CoRR abs/1812.08008(2018).",
      "doi": ""
    },
    {
      "text": "Zhe Cao, Tomas Simon, Shih-En Wei, and Yaser Sheikh. 2017. Realtime Multi-Person 2D Pose Estimation using Part Affinity Fields. In Conference on Computer Vision and Pattern Recognition.",
      "doi": ""
    },
    {
      "text": "Lung-Ming Chen, Yi-Hsiang Pan, and Yung-Jen Chen. 2009. A Study of Shuttlecock’s Trajectory in Badminton.Journal of sports science & medicine 8 (2009), 657–62. Issue 4.",
      "doi": ""
    },
    {
      "text": "Tom Decroos, Lotte Bransen, Jan Van Haaren, and Jesse Davis. 2019. Actions speak louder than goals: Valuing player actions in soccer. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. ACM, 1851–1861.",
      "doi": "10.1145/3292500.3330758"
    },
    {
      "text": "David Doermann and David Mihalcik. 2000. Tools and techniques for video performance evaluation. In Proceedings 15th International Conference on Pattern Recognition. ICPR-2000, Vol. 4. IEEE, 167–170.",
      "doi": ""
    },
    {
      "text": "Paul Downward, Bernd Frick, Brad Humphreys, Tim Pawlowski, Jane Ruseski, and Brian Soebbing. 2019. The SAGE Handbook of Sports Economics. https://doi.org/10.4135/9781526470447",
      "doi": ""
    },
    {
      "text": "K He, X Zhang, S Ren, and J Sun. 2015. Deep residual learning for image recognition. Computer Vision and Pattern Recognition (CVPR). In 2016 IEEE Conference on, Vol. 5. 6.",
      "doi": ""
    },
    {
      "text": "Fabian Caba Heilbron, Joon-Young Lee, Hailin Jin, and Bernard Ghanem. 2018. What do i annotate next? an empirical study of active learning for action localization. In European Conference on Computer Vision. Springer, 212–229.",
      "doi": "10.1007/978-3-030-01252-6_13"
    },
    {
      "text": "Keita Higuchi, Ryo Yonetani, and Yoichi Sato. 2017. Egoscanning: Quickly scanning first-person videos with egocentric elastic timelines. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6536–6546.",
      "doi": "10.1145/3025453.3025821"
    },
    {
      "text": "Yu-Chuan Huang, I-No Liao, Ching-Hsuan Chen, Tsì-Uí İk, and Wen-Chih Peng. 2019. TrackNet: A Deep Learning Network for Tracking High-speed and Tiny Objects in Sports Applications. In IEEE International Conference on Advanced Video and Signal Based Surveillance. IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "M Hughes and P Moore. 2002. 36 Movement analysis of elite level male ‘serve and volley’ tennis players. Science and racket sports II(2002), 254.",
      "doi": ""
    },
    {
      "text": "Neel Joshi, Wolf Kienzle, Mike Toelle, Matt Uyttendaele, and Michael F Cohen. 2015. Real-time hyperlapse creation via optimal frame selection. ACM Transactions on Graphics (TOG) 34, 4 (2015), 1–9.",
      "doi": "10.1145/2766954"
    },
    {
      "text": "Alexandre Kaspar, Geneviève Patterson, Changil Kim, Yağız Aksoy, Wojciech Matusik, and Mohamed Elgharib. 2018. Crowd-Guided Ensembles: How Can We Choreograph Crowd Workers for Video Segmentation?. In In Proceeding of ACM CHI.",
      "doi": ""
    },
    {
      "text": "Juho Kim, Phu Tran Nguyen, Sarah Weir, Philip J Guo, Robert C Miller, and Krzysztof Z Gajos. 2014. Crowdsourcing step-by-step information extraction to enhance existing how-to videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 4017–4026.",
      "doi": "10.1145/2556288.2556986"
    },
    {
      "text": "Yu Kong and Yun Fu. 2018. Human Action Recognition and Prediction: a Survey. (2018). arXiv:1806.11230",
      "doi": ""
    },
    {
      "text": "Adriana Kovashka, Olga Russakovsky, Li Fei-Fei, and Kristen Grauman. 2016. Crowdsourcing in computer vision. (2016). arXiv:1611.02145",
      "doi": ""
    },
    {
      "text": "Ranjay A Krishna, Kenji Hata, Stephanie Chen, Joshua Kravitz, David A Shamma, Li Fei-Fei, and Michael S Bernstein. 2016. Embracing error to enable rapid crowdsourcing. In Proceedings of the 2016 CHI conference on human factors in computing systems. 3167–3179.",
      "doi": "10.1145/2858036.2858115"
    },
    {
      "text": "Alex Krizhevsky, Ilya Sutskever, and Geoffrey E Hinton. 2012. Imagenet classification with deep convolutional neural networks. In Advances in neural information processing systems. 1097–1105.",
      "doi": ""
    },
    {
      "text": "Gordon Kurtenbach, George W Fitzmaurice, Russell N Owen, and Thomas Baudel. 1999. The Hotbox: efficient access to a large number of menu-items. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 231–237.",
      "doi": "10.1145/302979.303047"
    },
    {
      "text": "Victor Lavrenko, SL Feng, and Raghavan Manmatha. 2004. Statistical models for automatic video annotation and retrieval. In 2004 IEEE International Conference on Acoustics, Speech, and Signal Processing, Vol. 3. IEEE, iii–1044.",
      "doi": ""
    },
    {
      "text": "Adrian Lees. 2003. Science and the major racket sports: a review. Journal of Sports Sciences 21, 9 (2003), 707–732. https://doi.org/10.1080/0264041031000140275 PMID: 14579868.",
      "doi": ""
    },
    {
      "text": "Hongsen Liao, Li Chen, Yibo Song, and Hao Ming. 2016. Visualization-based active learning for video annotation. IEEE Transactions on Multimedia 18, 11 (2016), 2196–2205.",
      "doi": "10.1109/TMM.2016.2614227"
    },
    {
      "text": "Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C Lawrence Zitnick. 2014. Microsoft COCO: Common objects in context. In European conference on computer vision. Springer, 740–755.",
      "doi": ""
    },
    {
      "text": "Xuebo Liu, Ding Liang, Shi Yan, Dagui Chen, Yu Qiao, and Junjie Yan. 2018. FOTS: Fast oriented text spotting with a unified network. In Proceedings of the IEEE conference on computer vision and pattern recognition. 5676–5685.",
      "doi": ""
    },
    {
      "text": "Tze Chien Loh and Oleksandr Krasilshchikov. 2015. Competition performance variables differences in elite and U-21 international men singles table tennis players.Journal of Physical Education & Sport 15, 4 (2015).",
      "doi": ""
    },
    {
      "text": "Nuno Luz, Nuno Silva, and Paulo Novais. 2015. A survey of task-oriented crowdsourcing. Artificial Intelligence Review 44, 2 (2015), 187–213.",
      "doi": "10.1007/s10462-014-9423-5"
    },
    {
      "text": "Jorge Piazentin Ono, Arvi Gjoka, Justin Salamon, Carlos Dietrich, and Claudio T. Silva. 2019. HistoryTracker: Minimizing Human Interactions in Baseball Game Annotation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Article 63, 12 pages.",
      "doi": ""
    },
    {
      "text": "Dim P Papadopoulos, Jasper RR Uijlings, Frank Keller, and Vittorio Ferrari. 2017. Extreme clicking for efficient object annotation. In Proceedings of the IEEE international conference on computer vision. 4930–4939.",
      "doi": ""
    },
    {
      "text": "Charles Perin, Romain Vuillemot, and Jean-Daniel Fekete. 2013. Real-Time Crowdsourcing of Detailed Soccer Data. In What’s the score? The 1st Workshop on Sports Data Visualization.",
      "doi": ""
    },
    {
      "text": "Tom Polk, Dominik Jäckle, Johannes Häußler, and Jing Yang. 2019. CourtTime: Generating actionable insights into tennis matches using visual analytics. IEEE Transactions on Visualization and Computer Graphics 26, 1(2019), 397–406.",
      "doi": ""
    },
    {
      "text": "Tom Polk, Jing Yang, Yueqi Hu, and Ye Zhao. 2014. TenniVis: Visualization for tennis match analysis. IEEE transactions on visualization and computer graphics 20, 12(2014), 2339–2348.",
      "doi": ""
    },
    {
      "text": "Vignesh Ramanathan, Jonathan Huang, Sami Abu-El-Haija, Alexander Gorban, Kevin Murphy, and Li Fei-Fei. 2016. Detecting events and key actors in multi-person videos. In Proceedings of the IEEE conference on computer vision and pattern recognition. 3043–3053.",
      "doi": ""
    },
    {
      "text": "Joseph Redmon, S. Divvala, Ross B. Girshick, and Ali Farhadi. 2016. You Only Look Once: Unified, Real-Time Object Detection. 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016), 779–788.",
      "doi": ""
    },
    {
      "text": "Shaoqing Ren, Kaiming He, Ross Girshick, and Jian Sun. 2015. Faster r-cnn: Towards real-time object detection with region proposal networks. In Advances in neural information processing systems. 91–99.",
      "doi": ""
    },
    {
      "text": "Xindi Shang, Donglin Di, Junbin Xiao, Yu Cao, Xun Yang, and Tat-Seng Chua. 2019. Annotating objects and relations in user-generated videos. In Proceedings of the 2019 on International Conference on Multimedia Retrieval. 279–287.",
      "doi": "10.1145/3323873.3325056"
    },
    {
      "text": "Huang-Chia Shih. 2017. A survey of content-aware video analysis for sports. IEEE Transactions on Circuits and Systems for Video Technology 28, 5(2017), 1212–1231.",
      "doi": ""
    },
    {
      "text": "Jean Y Song, Stephan J Lemmer, Michael Xieyang Liu, Shiyan Yan, Juho Kim, Jason J Corso, and Walter S Lasecki. 2019. Popup: reconstructing 3D video using particle filtering to aggregate crowd responses. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 558–569.",
      "doi": "10.1145/3301275.3302305"
    },
    {
      "text": "Anthony Tang and Sebastian Boring. 2012. # EpicPlay: Crowd-sourcing sports video highlights. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1569–1572.",
      "doi": "10.1145/2207676.2208622"
    },
    {
      "text": "Graham Thomas, Rikke Gade, Thomas B Moeslund, Peter Carr, and Adrian Hilton. 2017. Computer vision for sports: Current applications and research topics. Computer Vision and Image Understanding 159 (2017), 3–18.",
      "doi": ""
    },
    {
      "text": "Alexander Toshev and Christian Szegedy. 2014. Deeppose: Human pose estimation via deep neural networks. In Proceedings of the IEEE conference on computer vision and pattern recognition. 1653–1660.",
      "doi": "10.1109/CVPR.2014.214"
    },
    {
      "text": "Guido Van Oorschot, Marieke Van Erp, and Chris Dijkshoorn. 2012. Automatic Extraction of Soccer Game Events from Twitter. In Proceedings of the Workshop on Detection, Representation, and Exploitation of Events in the Semantic Web. 21–30.",
      "doi": ""
    },
    {
      "text": "Carl Vondrick, Donald Patterson, and Deva Ramanan. 2013. Efficiently scaling up crowdsourced video annotation. International journal of computer vision 101, 1 (2013), 184–204.",
      "doi": "10.1007/s11263-012-0564-1"
    },
    {
      "text": "Carl Vondrick and Deva Ramanan. 2011. Video annotation and tracking with active learning. In Advances in Neural Information Processing Systems. 28–36.",
      "doi": ""
    },
    {
      "text": "Fangshi Wang, De Xu, Wei Lu, and Weixin Wu. 2007. Automatic video annotation and retrieval based on bayesian inference. In International Conference on Multimedia Modeling. Springer, 279–288.",
      "doi": ""
    },
    {
      "text": "Jiachen Wang, Kejian Zhao, Dazhen Deng, Anqi Cao, Xiao Xie, Zheng Zhou, Hui Zhang, and Yingcai Wu. 2019. Tac-Simur: Tactic-based Simulative Visual Analytics of Table Tennis. IEEE transactions on visualization and computer graphics (2019).",
      "doi": ""
    },
    {
      "text": "Nicolai Wojke, Alex Bewley, and Dietrich Paulus. 2017. Simple Online and Realtime Tracking with a Deep Association Metric. In 2017 IEEE International Conference on Image Processing (ICIP). IEEE, 3645–3649. https://doi.org/10.1109/ICIP.2017.8296962",
      "doi": "10.1109/ICIP.2017.8296962"
    },
    {
      "text": "H Wu, Z Li, Z Tao, W Ding, and J Zhou. 1989. Methods of actual strength evaluation and technical diagnosis in table tennis match. Journal of National Research Institute of Sports Science 1 (1989), 32–41.",
      "doi": ""
    },
    {
      "text": "Jiang Wu, Ziyang Guo, Zuobin Wang, Qingyang Xu, and Yingcai Wu. [n.d.]. Visual analytics of multivariate event sequence data in racquet sports. In 2020 IEEE Conference on Visual Analytics Science and Technology (VAST).",
      "doi": ""
    },
    {
      "text": "Yingcai Wu, Ji Lan, Xinhuan Shu, Chenyang Ji, Kejian Zhao, Jiachen Wang, and Hui Zhang. 2018. iTTVis: Interactive Visualization of Table Tennis Data. IEEE Transaction on Visualization and Computer Graphic. 24, 1(2018), 709–718.",
      "doi": ""
    },
    {
      "text": "Yingcai Wu, Xiao Xie, Jiachen Wang, Dazhen Deng, Hongye Liang, Hui Zhang, Shoubin Cheng, and Wei Chen. 2018. Forvizor: Visualizing spatio-temporal team formations in soccer. IEEE transactions on visualization and computer graphics 25, 1(2018), 65–75.",
      "doi": ""
    },
    {
      "text": "Xiao Xie, Jiachen Wang, Hongye Liang, Dazhen Deng, Shoubin Cheng, Hui Zhang, Wei Chen, and Yingcai Wu. 2020. PassVizor: Toward better understanding of the dynamics of soccer passes. IEEE Transactions on Visualization and Computer Graphics (2020).",
      "doi": ""
    },
    {
      "text": "Shuainan Ye, Zhutian Chen, Xiangtong Chu, Yifan Wang, Siwei Fu, Lejun Shen, Kun Zhou, and Yingcai Wu. 2020. Shuttlespace: Exploring and analyzing movement trajectory in immersive visualization. IEEE Transactions on Visualization and Computer Graphics (2020).",
      "doi": ""
    },
    {
      "text": "Jenny Yuen, Bryan Russell, Ce Liu, and Antonio Torralba. 2009. LabelMe video: Building a video database with human annotations. In 2009 IEEE 12th International Conference on Computer Vision. IEEE, 1451–1458.",
      "doi": ""
    },
    {
      "text": "Man-Ching Yuen, Irwin King, and Kwong-Sak Leung. 2011. A survey of crowdsourcing systems. In 2011 IEEE third international conference on privacy, security, risk and trust and 2011 IEEE third international conference on social computing. IEEE, 766–773.",
      "doi": ""
    },
    {
      "text": "Hui Zhang, Wei Liu, Jin-ju Hu, and Rui-zhi Liu. 2013. Evaluation of elite table tennis players’ technique effectiveness. Journal of sports sciences 31, 14 (2013), 1526–1534.",
      "doi": ""
    },
    {
      "text": "Hui Zhang, Zheng Zhou, and Qing Yang. 2018. Match analyses of table tennis in China: a systematic review. Journal of sports sciences 36, 23 (2018), 2663–2674.",
      "doi": ""
    },
    {
      "text": "Tianyi Zhang, Abdallah El Ali, Chen Wang, Alan Hanjalic, and Pablo Cesar. 2020. RCEA: Real-time, Continuous Emotion Annotation for Collecting Precise Mobile Video Ground Truth Labels. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376808"
    },
    {
      "text": "Guangyu Zhu, Changsheng Xu, Qingming Huang, and Wen Gao. 2006. Action recognition in broadcast tennis video. In 18th International Conference on Pattern Recognition (ICPR’06), Vol. 1. IEEE, 251–254.",
      "doi": ""
    }
  ]
}