{
  "doi": "10.1145/3411764.3445268",
  "title": "Community Supported Agriculture: The Concept of Solidarity in Mitigating Between Harvests and Needs",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "There is a developing recognition of the social and economic costs entailed in global supply chains. In this paper, we report on efforts to provide alternative, more sustainable and resilient models of production. Community Supported Agricultures (CSAs) address this problem but require new means of exchange which, we suggest, offer a design opportunity for sustainable HCI research. This paper presents a two months participatory observation in a food movement, a German CSA which developed a distribution system involving their own currency. Based on our ethnographic observations, we focus our discussion on (1) the solidaristic principles upon which the movement is based and (2) techniques of mediating between consumers’ wishes and the constraints of local agricultural production. By relating to the continued development of CSAs, we identify three interrelated innovation gaps and discuss new software architectures aimed at resolving the problems which arise as the movement grows.",
  "authors": [
    {
      "name": "Marvin Landwehr",
      "institution": "University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659444750",
      "orcid": "0000-0001-7001-5281"
    },
    {
      "name": "Philip Engelbutzeder",
      "institution": "University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659481143",
      "orcid": "0000-0002-9219-7327"
    },
    {
      "name": "Volker Wulf",
      "institution": "University of Siegen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100659507",
      "orcid": "0000-0002-1214-1551"
    }
  ],
  "references": [
    {
      "text": "Miguel A Altieri. 2009. Agroecology, small farms, and food sovereignty. Monthly review 61, 3 (2009), 102–113.",
      "doi": ""
    },
    {
      "text": "Irene Antoni-Komar. 2016. Urban Gardening, Food Coops, Community Supported Agriculture: Transformative Wirtschaftsformen – Konsumpraktiken – Marktbeziehungen. Haushalt in Bildung & Forschung 5, 3 (2016), 82–96. https://doi.org/10.3224/hibifo.v5i3.8",
      "doi": ""
    },
    {
      "text": "Bauwens, Michel, and Alex Pazaitis. [n.d.]. P2P accounting for planetary survival. http://commonstransition. org/p2p-accounting-for-planetary-survival/",
      "doi": ""
    },
    {
      "text": "Marjolijn Bloemmen, Roxana Bobulescu, Nhu Tuyen Le, and Claudio Vitari. 2015. Microeconomic degrowth: The case of Community Supported Agriculture. Ecological Economics 112(2015), 110–115. https://doi.org/10.1016/j.ecolecon.2015.02.013",
      "doi": ""
    },
    {
      "text": "Joan M Brehm and Brian W Eisenhauer. 2008. Motivations for participating in community-supported agriculture and their relationship with community attachment and social capital. Journal of Rural Social Sciences 23, 1 (2008), 5.",
      "doi": ""
    },
    {
      "text": "Hronn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 947–956.",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "John M. Carroll and Victoria Bellotti. 2015. Creating Value Together. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’15, Dan Cosley, Andrea Forte, Luigina Ciolfi, and David McDonald (Eds.). ACM Press, New York, New York, USA, 1500–1510. https://doi.org/10.1145/2675133.2675270",
      "doi": ""
    },
    {
      "text": "Jacques M Chevalier and Daniel J Buckles. 2019. Participatory action research: Theory and methods for engaged inquiry. Routledge.",
      "doi": ""
    },
    {
      "text": "Cynthia Cone and Andrea Myhre. 2000. Community-supported agriculture: A sustainable alternative to industrial agriculture?Human organization 59, 2 (2000), 187–197.",
      "doi": ""
    },
    {
      "text": "Jodi Dean. 1995. Reflective solidarity. Constellations 2, 1 (1995), 114–140.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI conference on human factors in computing systems. 1975–1984.",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Nigel Dodd. 2015. Utopianism and the Future of Money. In Re-Imagining Economic Sociology, Patrik Aspers and Nigel Dodd (Eds.). Oxford University Press, 79–102. https://doi.org/10.1093/acprof:oso/9780198748465.003.0004",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Arthi Manohar, Jo Briggs, Mike Harding, Chris Speed, and John Vines. 2018. Making sense of blockchain applications: A typology for HCI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3174032"
    },
    {
      "text": "Amitai Etzioni. 1996. A moderate communitarian proposal. Political Theory 24, 2 (1996), 155–171.",
      "doi": ""
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, Özge Subasi, and Florian Güldenpfennig. 2014. Think globally, act locally. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW ’14, Susan Fussell, Wayne Lutters, Meredith Ringel Morris, and Madhu Reddy (Eds.). ACM Press, New York, New York, USA, 911–921. https://doi.org/10.1145/2531602.2531664",
      "doi": "10.1145/2531602.2531664"
    },
    {
      "text": "Maja Göpel. 2016. Why the Mainstream Economic Paradigm Cannot Inform Sustainability Transformations. In The Great Mindshift. Springer, 53–117.",
      "doi": ""
    },
    {
      "text": "Kirsten Gram-Hanssen. 2011. Understanding change and continuity in residential energy consumption. Journal of consumer culture 11, 1 (2011), 61–78.",
      "doi": ""
    },
    {
      "text": "Kirsten Gram-Hanssen, Anders Rhiger Hansen, and Mette Mechlenborg. 2020. Danish PV Prosumers’ Time-Shifting of Energy-Consuming Everyday Practices. Sustainability 12, 10 (2020), 4121.",
      "doi": ""
    },
    {
      "text": "Eric Harris-Braun, Nicolas Luck, and Arthur Brock. 2018. Holochain: scalable agent-centric distributed computing. GitHub. URL: https://github. com/holochain/holochain-proto/blob/whitepaper/holochain. pdf(2018).",
      "doi": ""
    },
    {
      "text": "Jennifer Hayden and Daniel Buck. 2012. Doing community supported agriculture: Tactile space, affect and effects of membership. Geoforum 43, 2 (2012), 332–341. https://doi.org/10.1016/j.geoforum.2011.08.003",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2013. Sustainable HCI for grassroots urban food-growing communities. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration. 255–264.",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Carol Peppe Hewitt. 2014. Financing Our Foodshed: Growing Local Food with Slow Money. New Society Publishers, Gabriola Island. https://ebookcentral.proquest.com/lib/gbv/detail.action?docID=5180730",
      "doi": ""
    },
    {
      "text": "Tad Hirsch, Phoebe Sengers, Eli Blevis, Richard Beckwith, and Tapan Parikh. 2010. Making food, producing sustainability. In CHI’10 Extended Abstracts on Human Factors in Computing Systems. 3147–3150.",
      "doi": ""
    },
    {
      "text": "Jiao Huang, Muriel Tichit, Monique Poulot, Ségolène Darly, Shuangcheng Li, Caroline Petit, and Christine Aubry. 2015. Comparative review of multifunctionality and ecosystem services in sustainable agriculture. Journal of environmental management 149 (2015), 138–147. https://doi.org/10.1016/j.jenvman.2014.10.020",
      "doi": ""
    },
    {
      "text": "Andreas Kamilaris, Agusti Fonts, and Francesc X. Prenafeta-Bold. 2019. The rise of blockchain technology in agriculture and food supply chains. Trends in Food Science & Technology 91 (2019), 640–652. https://doi.org/10.1016/j.tifs.2019.07.034",
      "doi": ""
    },
    {
      "text": "Bran Knowles, Oliver Bates, and Maria Håkansson. 2018. This changes sustainable hci. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174045"
    },
    {
      "text": "Bran Knowles, Lynne Blair, Mike Hazas, and Stuart Walker. 2013. Exploring sustainability research in computing: where we are and where we go next. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. 305–314.",
      "doi": "10.1145/2493432.2493474"
    },
    {
      "text": "Szu-Yu Liu, Shaowen Bardzell, and Jeffrey Bardzell. 2019. Symbiotic encounters: HCI and sustainable agriculture. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300547"
    },
    {
      "text": "Caitlin Lustig and Bonnie Nardi. 2015. Algorithmic authority: The case of Bitcoin. In 2015 48th Hawaii International Conference on System Sciences. IEEE, 743–752.",
      "doi": "10.1109/HICSS.2015.95"
    },
    {
      "text": "Peter Lyle, Jaz Hee-jeong Choi, and Marcus Foth. 2014. Designing for grassroots food production: an event-based urban agriculture community. In Proceedings of the 26th Australian computer-human interaction conference on designing futures: The future of design. 362–365.",
      "doi": "10.1145/2686612.2686666"
    },
    {
      "text": "Alice McIntyre. 2008. Participatory action research. Vol. 52. Sage Publications.",
      "doi": ""
    },
    {
      "text": "Juliet Norton, Birgit Penzenstadler, and Bill Tomlinson. 2019. Implications of Grassroots Sustainable Agriculture Community Values on the Design of Information Systems. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22. https://doi.org/10.1145/3359136",
      "doi": "10.1145/3359136"
    },
    {
      "text": "Juliet Norton, Ankita Raturi, Bonnie Nardi, Sebastian Prost, Samantha McDonald, Daniel Pargman, Oliver Bates, Maria Normark, Bill Tomlinson, Nico Herbig, and Lynn Dombrowski. 2017. A grand challenge for HCI. Interactions 24, 6 (2017), 50–55. https://doi.org/10.1145/3137095",
      "doi": "10.1145/3137095"
    },
    {
      "text": "Sabine U. O’Hara and Sigrid Stagl. 2001. Global Food Markets and Their Local Alternatives: A Socio-Ecological Economic Perspective. Population and Environment 22, 6 (2001), 533–554. https://doi.org/10.1023/A:1010795305097",
      "doi": ""
    },
    {
      "text": "Stephan Pabst, Wolfgang Eichinger, Michaela Fassl, Eva Maria Haas, Martin Mayer, Ulla Weißhuhn, and Marianne Penker. 2015. Transdisziplinäre Aktionsforschung zur Verbreitung von Community Supported Agriculture (CSA) in Österreich. Masterarbeit. BOKU Wien(2015).",
      "doi": ""
    },
    {
      "text": "Thomas Rippel, Silke Helfrich, Felicitas Sommer, and Jardim Pedro. [n.d.]. Terrafina: Ein Blockchain basiertes Governance Framework für eine Vielfalt von Land-Commons. https://wiki.p2pfoundation.net/Terrafina_Foundation",
      "doi": ""
    },
    {
      "text": "George Ritzer, Paul Dean, and Nathan Jurgenson. 2012. The coming of age of the prosumer. American behavioral scientist 56, 4 (2012), 379–398.",
      "doi": ""
    },
    {
      "text": "George Ritzer and Nathan Jurgenson. 2010. Production, consumption, prosumption: The nature of capitalism in the age of the digital ‘prosumer’. Journal of consumer culture 10, 1 (2010), 13–36.",
      "doi": ""
    },
    {
      "text": "Corina Sas and Irni Eliana Khairuddin. 2015. Exploring trust in Bitcoin technology: a framework for HCI research. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. 338–342.",
      "doi": "10.1145/2838739.2838821"
    },
    {
      "text": "Tobias Schwartz, Sebastian Denef, Gunnar Stevens, Leonardo Ramirez, and Volker Wulf. 2013. Cultivating energy literacy: results from a longitudinal living lab study of a home energy management system. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1193–1202.",
      "doi": "10.1145/2470654.2466154"
    },
    {
      "text": "Tobias Schwartz, Gunnar Stevens, Timo Jakobi, Sebastian Denef, Leonardo Ramirez, Volker Wulf, and Dave Randall. 2015. What people do with consumption feedback: a long-term living lab study of a home energy management system. Interacting with Computers 27, 6 (2015), 551–576.",
      "doi": ""
    },
    {
      "text": "Patrick C. Shih, Victoria Bellotti, Kyungsik Han, and John M. Carroll. 2015. Unequal Time for Unequal Value. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, Bo Begole, Jinwoo Kim, Kori Inkpen, and Woontack Woo (Eds.). ACM Press, New York, New York, USA, 1075–1084. https://doi.org/10.1145/2702123.2702560",
      "doi": "10.1145/2702123.2702560"
    },
    {
      "text": "Elizabeth Shove. 2010. Beyond the ABC: climate change policy and theories of social change. Environment and planning A 42, 6 (2010), 1273–1285.",
      "doi": ""
    },
    {
      "text": "M Six Silberman, Lisa Nathan, Bran Knowles, Roy Bendor, Adrian Clear, Maria Håkansson, Tawanna Dillahunt, and Jennifer Mankoff. 2014. Next steps for sustainable HCI. interactions 21, 5 (2014), 66–69.",
      "doi": ""
    },
    {
      "text": "Stephen A Small and Lynet Uttal. 2005. Action-oriented research: Strategies for engaged scholarship. Journal of Marriage and Family 67, 4 (2005), 936–948.",
      "doi": ""
    },
    {
      "text": "Dean Spade. 2020. Solidarity Not Charity. Social Text (2020).",
      "doi": ""
    },
    {
      "text": "Craig J. Thompson and Gokcen Coskuner-Balli. 2007. Enchanting Ethical Consumerism. Journal of Consumer Culture 7, 3 (2007), 275–303. https://doi.org/10.1177/1469540507081631",
      "doi": ""
    },
    {
      "text": "Mischa Tripoli and Josef Schmidhuber. 2018. Emerging Opportunities for the Application of Blockchain in the Agri-food Industry. FAO and ICTSD: Rome and Geneva. Licence: CC BY-NC-SA 3 (2018).",
      "doi": ""
    },
    {
      "text": "Michael R. van Waardhuizen, Catherine E. Peloquin, and Uttam Kokil. 2009. CropConnect: enabling community supported agriculture. In Proceedings of the 27th international conference extended abstracts on Human factors in computing systems - CHI EA ’09, Dan R. Olsen, Richard B. Arthur, Ken Hinckley, Meredith Ringel Morris, Scott Hudson, and Saul Greenberg (Eds.). ACM Press, New York, New York, USA, 2799. https://doi.org/10.1145/1520340.1520405",
      "doi": "10.1145/1520340.1520405"
    },
    {
      "text": "Alan Warde. 2005. Consumption and theories of practice. Journal of consumer culture 5, 2 (2005), 131–153.",
      "doi": ""
    },
    {
      "text": "Hanna Weber, Karoline Poeggel, Hallie Eakin, Daniel Fischer, Daniel J Lang, Henrik von Wehrden, and Arnim Wiek. 2020. What are the ingredients for food systems change towards sustainability?-Insights from the literature. Environmental Research Letters(2020).",
      "doi": ""
    },
    {
      "text": "Volker Wulf, Markus Rohde, Volkmar Pipek, and Gunnar Stevens. 2011. Engaging with practices: design case studies as a research framework in CSCW. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. 505–512.",
      "doi": "10.1145/1958824.1958902"
    },
    {
      "text": "Hang Xiong, Tobias Dalhaus, Puqing Wang, and Jiajin Huang. 2020. Blockchain Technology for Agriculture: Applications and Rationale. Frontiers in Blockchain 3 (2020). https://doi.org/10.3389/fbloc.2020.00007",
      "doi": ""
    }
  ]
}