{
  "doi": "10.1145/3411764.3445784",
  "title": "UISketch: A Large-Scale Dataset of UI Element Sketches",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "This paper contributes the first large-scale dataset of 17,979 hand-drawn sketches of 21 UI element categories collected from 967 participants, including UI/UX designers, front-end developers, HCI, and CS grad students, from 10 different countries. We performed a perceptual study with this dataset and found out that UI/UX designers can recognize the UI element sketches with ~96% accuracy. To compare human performance against computational recognition methods, we trained the state-of-the-art DNN-based image classification models to recognize the UI elements sketches. This study revealed that the ResNet-152 model outperforms other classification networks and detects unknown UI element sketches with 91.77% accuracy (chance is 4.76%). We have open-sourced the entire dataset of UI element sketches to the community intending to pave the way for further research in utilizing AI to assist the conversion of lo-fi UI sketches to higher fidelities.",
  "tags": [
    "Sketch dataset",
    "Deep Neural Networks",
    "Wireframes",
    "Low-fidelity prototypes",
    "UI element sketches",
    "Dataset",
    "Sketching interfaces",
    "Sketch recognition"
  ],
  "authors": [
    {
      "name": "Vinoth Pandian Sermuga Pandian",
      "institution": "RWTH Aachen University, Germany",
      "img": "/do/10.1145/contrib-99659365403/rel-imgonly/profile.jpg",
      "acmid": "99659365403",
      "orcid": "missing"
    },
    {
      "name": "Sarah Suleri",
      "institution": "RWTH Aachen University, Germany",
      "img": "/do/10.1145/contrib-99659366574/rel-imgonly/suleri_picture_0.75x.jpg",
      "acmid": "99659366574",
      "orcid": "missing"
    },
    {
      "name": "Prof. Dr. Matthias Jarke",
      "institution": "RWTH Aachen University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702259",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "GeekyAnts 2020. GeekyAnts/NativeBase. GeekyAnts. https://github.com/GeekyAnts/NativeBase",
      "doi": ""
    },
    {
      "text": "React Native Elements 2020. React-Native-Elements/React-Native-Elements. React Native Elements. https://github.com/react-native-elements/react-native-elements",
      "doi": ""
    },
    {
      "text": "Shoutem 2020. Shoutem/Ui. Shoutem. https://github.com/shoutem/ui",
      "doi": ""
    },
    {
      "text": "Georgia Albuquerque, Thomas Löwe, and Marcus Magnor. 2011. Synthetic Generation of High-Dimensional Datasets. IEEE transactions on visualization and computer graphics 17 (12 2011), 2317–24. https://doi.org/10.1109/tvcg.2011.237",
      "doi": "10.5555/2068462.2068633"
    },
    {
      "text": "Kumar Ashwin. 2018. sketch-code. https://github.com/ashnkumar/sketch-code.",
      "doi": ""
    },
    {
      "text": "Wilkins Benjamin. 2017. Sketching Interfaces - Generating code from low fidelity wireframes. https://airbnb.design/sketching-interfaces/.",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2007. Sketching User Experiences: Getting the Design Right and the Right Design (nachdr. ed.). Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Adrien Coyette and Jean Vanderdonckt. 2005. A sketching tool for designing anyuser, anyplatform, anywhere user interfaces. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 3585 LNCS (2005), 550–564. https://doi.org/10.1007/11555261_45",
      "doi": ""
    },
    {
      "text": "Biplab Deka, Zifeng Huang, Chad Franzen, Joshua Hibschman, Daniel Afergan, Yang Li, Jeffrey Nichols, and Ranjitha Kumar. 2017. Rico: A Mobile App Dataset for Building Data-Driven Design Applications. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 845–854. https://doi.org/10.1145/3126594.3126651",
      "doi": "10.1145/3126594.3126651"
    },
    {
      "text": "Douglas K. Van Duyne, James Landay, and Jason I. Hong. 2002. The Design of Sites: Patterns, Principles, and Processes for Crafting a Customer-Centered Web Experience. Addison-Wesley Longman Publishing Co., Inc., USA.",
      "doi": ""
    },
    {
      "text": "Mathias Eitz, James Hays, and Marc Alexa. 2012. How Do Humans Sketch Objects?ACM Trans. Graph. 31, 4, Article 44 (July 2012), 10 pages. https://doi.org/10.1145/2185520.2185540",
      "doi": "10.1145/2185520.2185540"
    },
    {
      "text": "Fastai. 2020. Fastai - Vision.Learner. https://fastai1.fast.ai/vision.learner.html#Customize-your-model",
      "doi": ""
    },
    {
      "text": "framework7io. 2020. Framework7 - Full Featured Framework For Building iOS, Android & Desktop Apps. https://framework7.io/",
      "doi": ""
    },
    {
      "text": "Ian Goodfellow, Yoshua Bengio, and Aaron Courville. 2016. Deep Learning. MIT Press. http://www.deeplearningbook.org.",
      "doi": "10.5555/3086952"
    },
    {
      "text": "Google. 2020. Material Design. https://material.io/design",
      "doi": ""
    },
    {
      "text": "David Ha and Douglas Eck. 2018. A Neural Representation of Sketch Drawings. In 6th International Conference on Learning Representations, ICLR 2018, Vancouver, BC, Canada, April 30 - May 3, 2018, Conference Track Proceedings. OpenReview.net. https://openreview.net/forum?id=Hy6GHpkCW",
      "doi": ""
    },
    {
      "text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2015. Deep Residual Learning for Image Recognition. (2015). arxiv:1512.03385 [cs] http://arxiv.org/abs/1512.03385",
      "doi": ""
    },
    {
      "text": "Jeremy Howard and Sylvain Gugger. 2020. Deep Learning for Coders with Fastai and PyTorch. https://www.oreilly.com/library/view/deep-learning-for/9781492045519/",
      "doi": ""
    },
    {
      "text": "Jeremy Howard and Sylvain Gugger. 2020. Fastai: A Layered API for Deep Learning. 11, 2 (2020), 108. https://doi.org/10.3390/info11020108",
      "doi": ""
    },
    {
      "text": "Forrest Huang, John F. Canny, and Jeffrey Nichols. 2019. Swire: Sketch-based User Interface Retrieval(CHI ’19). ACM, New York, NY, USA, Article 104, 10 pages. https://doi.org/10.1145/3290605.3300334",
      "doi": "10.1145/3290605.3300334"
    },
    {
      "text": "Gao Huang, Zhuang Liu, Laurens van der Maaten, and Kilian Q. Weinberger. 2018. Densely Connected Convolutional Networks. (2018). arxiv:1608.06993 [cs] http://arxiv.org/abs/1608.06993",
      "doi": ""
    },
    {
      "text": "Forrest N. Iandola, Song Han, Matthew W. Moskewicz, Khalid Ashraf, William J. Dally, and Kurt Keutzer. 2016. SqueezeNet: AlexNet-Level Accuracy with 50x Fewer Parameters and < 0.5MB Model Size. (2016). arxiv:1602.07360 [cs] http://arxiv.org/abs/1602.07360",
      "doi": ""
    },
    {
      "text": "Alex Krizhevsky. 2014. One Weird Trick for Parallelizing Convolutional Neural Networks. (2014). arxiv:1404.5997 [cs] http://arxiv.org/abs/1404.5997",
      "doi": ""
    },
    {
      "text": "A. Lancaster. 2004. Paper Prototyping: The Fast and Easy Way to Design and Refine User Interfaces. IEEE Transactions on Professional Communication 47, 4 (Dec. 2004), 335–336. https://doi.org/10.1109/tpc.2004.837973",
      "doi": ""
    },
    {
      "text": "Yann LeCun, Yoshua Bengio, and Geoffrey Hinton. 2015. Deep learning. Nature 521 (27 May 2015), 436. https://doi.org/10.1038/nature14539",
      "doi": ""
    },
    {
      "text": "Thomas F. Liu, Mark Craft, Jason Situ, Ersin Yumer, Radomir Mech, and Ranjitha Kumar. 2018. Learning Design Semantics for Mobile Apps. In The 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). ACM, New York, NY, USA, 569–579. https://doi.org/10.1145/3242587.3242650",
      "doi": "10.1145/3242587.3242650"
    },
    {
      "text": "Microsoft. 2018. Sketch2Code - Microsoft/ailab. https://github.com/Microsoft/ailab/tree/master/Sketch2Code.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2020. Microsoft Design. https://www.microsoft.com/design/fluent/",
      "doi": ""
    },
    {
      "text": "Nobuyuki Otsu. 1979. A Threshold Selection Method from Gray-Level Histograms. (1979), 5.",
      "doi": ""
    },
    {
      "text": "Adam Paszke, Sam Gross, Francisco Massa, Adam Lerer, James Bradbury, Gregory Chanan, Trevor Killeen, Zeming Lin, Natalia Gimelshein, Luca Antiga, Alban Desmaison, Andreas Kopf, Edward Yang, Zachary DeVito, Martin Raison, Alykhan Tejani, Sasank Chilamkurthy, Benoit Steiner, Lu Fang, Junjie Bai, and Soumith Chintala. 2019. PyTorch: An Imperative Style, High-Performance Deep Learning Library. In Advances in Neural Information Processing Systems 32, H. Wallach, H. Larochelle, A. Beygelzimer, F. dAlché Buc, E. Fox, and R. Garnett (Eds.). Curran Associates, Inc., 8024–8035. http://papers.neurips.cc/paper/9015-pytorch-an-imperative-style-high-performance-deep-learning-library.pdf",
      "doi": "10.5555/3454287.3455008"
    },
    {
      "text": "Waseem Rawat and Zenghui Wang. 2017. Deep Convolutional Neural Networks for Image Classification: A Comprehensive Review. 29, 9 (2017), 2352–2449. https://doi.org/10.1162/neco_a_00990",
      "doi": ""
    },
    {
      "text": "Jim Rudd, Ken Stern, and Scott Isensee. 1996. Low vs. High-Fidelity Prototyping Debate. https://doi.org/10.1145/223500.223514",
      "doi": ""
    },
    {
      "text": "Olga Russakovsky, Jia Deng, Hao Su, Jonathan Krause, Sanjeev Satheesh, Sean Ma, Zhiheng Huang, Andrej Karpathy, Aditya Khosla, Michael Bernstein, Alexander C. Berg, and Li Fei-Fei. 2015. ImageNet Large Scale Visual Recognition Challenge. 115, 3 (2015), 211–252. https://doi.org/10.1007/s11263-015-0816-y",
      "doi": ""
    },
    {
      "text": "Patsorn Sangkloy, Nathan Burnell, Cusuh Ham, and James Hays. 2016. The Sketchy Database: Learning to Retrieve Badly Drawn Bunnies. ACM Trans. Graph. 35, 4, Article 119 (July 2016), 12 pages. https://doi.org/10.1145/2897824.2925954",
      "doi": "10.1145/2897824.2925954"
    },
    {
      "text": "Kazuma Sasaki, Madoka Yamakawa, Kana Sekiguchi, and Tetsuya Ogata. 2016. Classification of Photo and Sketch Images Using Convolutional Neural Networks. In Artificial Neural Networks and Machine Learning – ICANN 2016 (Cham, 2016) (Lecture Notes in Computer Science), Alessandro E.P. Villa, Paolo Masulli, and Antonio Javier Pons Rivero (Eds.). Springer International Publishing, 283–290. https://doi.org/10.1007/978-3-319-44781-0_34",
      "doi": ""
    },
    {
      "text": "Omar Seddati, Stéphane Dupont, and Saïd Mahmoudi. 2015. DeepSketch: Deep Convolutional Neural Networks for Sketch Recognition and Similarity Search. In 2015 13th International Workshop on Content-Based Multimedia Indexing (CBMI) (2015-06). 1–6. https://doi.org/10.1109/CBMI.2015.7153606",
      "doi": ""
    },
    {
      "text": "Omar Seddati, Stéphane Dupont, and Saïd Mahmoudi. 2016. DeepSketch 2: Deep convolutional neural networks for partial sketch recognition. In 2016 14th International Workshop on Content-Based Multimedia Indexing (CBMI). Ieee, 1–6. https://doi.org/10.1109/cbmi.2016.7500261",
      "doi": ""
    },
    {
      "text": "Omar Seddati, Stéphane Dupont, and Saïd Mahmoudi. 2017. DeepSketch 3. Multimedia Tools and Applications 76, 21 (1 Nov. 2017), 22333–22359. https://doi.org/10.1007/s11042-017-4799-2",
      "doi": ""
    },
    {
      "text": "Vinoth Pandian Sermuga Pandian, Sarah Suleri, and Matthias Jarke. 2020. Syn: Synthetic Dataset for Training UI Element Detector From Lo-Fi Sketches (poster - forthcoming). In Proceedings of the 25th International Conference on Intelligent User Interfaces: Companion (Cagliari, Italy) (IUI ’20). Association for Computing Machinery, New York, NY, USA, 2.",
      "doi": "10.1145/3379336.3381498"
    },
    {
      "text": "Connor Shorten and Taghi M. Khoshgoftaar. 2019. A Survey on Image Data Augmentation for Deep Learning. 6, 1 (2019), 60. https://doi.org/10.1186/s40537-019-0197-0",
      "doi": ""
    },
    {
      "text": "Karen Simonyan and Andrew Zisserman. 2015. Very Deep Convolutional Networks for Large-Scale Image Recognition. (2015). arxiv:1409.1556 [cs] http://arxiv.org/abs/1409.1556",
      "doi": ""
    },
    {
      "text": "Leslie N. Smith. 2017. Cyclical Learning Rates for Training Neural Networks. (2017). arxiv:1506.01186 [cs] http://arxiv.org/abs/1506.01186",
      "doi": ""
    },
    {
      "text": "Sarah Suleri, Vinoth Pandian Sermuga Pandian, Svetlana Shishkovets, and Matthias Jarke. 2019. Eve: A Sketch-based Software Prototyping Workbench. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland UK) (CHI EA ’19). ACM, New York, NY, USA, Article Lbw1410, 6 pages. https://doi.org/10.1145/3290607.3312994",
      "doi": "10.1145/3290607.3312994"
    },
    {
      "text": "Christian Szegedy, Wei Liu, Yangqing Jia, Pierre Sermanet, Scott Reed, Dragomir Anguelov, Dumitru Erhan, Vincent Vanhoucke, and Andrew Rabinovich. 2014. Going Deeper with Convolutions. (2014). arxiv:1409.4842 [cs] http://arxiv.org/abs/1409.4842",
      "doi": ""
    },
    {
      "text": "Christian Szegedy, Vincent Vanhoucke, Sergey Ioffe, Jonathon Shlens, and Zbigniew Wojna. 2015. Rethinking the Inception Architecture for Computer Vision. (2015). arxiv:1512.00567 [cs] http://arxiv.org/abs/1512.00567",
      "doi": ""
    },
    {
      "text": "Mingxing Tan and Quoc V. Le. 2019. MixConv: Mixed Depthwise Convolutional Kernels. (2019). arxiv:1907.09595 [cs] http://arxiv.org/abs/1907.09595",
      "doi": ""
    },
    {
      "text": "Mingxing Tan and Quoc V. Le. 2020. EfficientNet: Rethinking Model Scaling for Convolutional Neural Networks. (2020). arxiv:1905.11946 [cs, stat] http://arxiv.org/abs/1905.11946",
      "doi": ""
    },
    {
      "text": "Laurens van der Maaten and Geoffrey Hinton. 2008. Visualizing Data Using T-SNE. 9 (2008), 2579–2605. http://www.jmlr.org/papers/v9/vandermaaten08a.html",
      "doi": ""
    },
    {
      "text": "Saining Xie, Ross Girshick, Piotr Dollár, Zhuowen Tu, and Kaiming He. 2017. Aggregated Residual Transformations for Deep Neural Networks. (2017). arxiv:1611.05431 [cs] http://arxiv.org/abs/1611.05431",
      "doi": ""
    },
    {
      "text": "Yongxin Yang and Timothy M. Hospedales. 2015. Deep Neural Networks for Sketch Recognition. CoRR abs/1501.07873(2015). arxiv:1501.07873http://arxiv.org/abs/1501.07873",
      "doi": ""
    },
    {
      "text": "Qian Yu, Yongxin Yang, Yi-Zhe Song, Tao Xiang, and Timothy Hospedales. 2015. Sketch-a-Net That Beats Humans. In Procedings of the British Machine Vision Conference 2015 (Swansea, 2015). British Machine Vision Association, 7.1–7.12. https://doi.org/10.5244/C.29.7",
      "doi": ""
    },
    {
      "text": "Sergey Zagoruyko and Nikos Komodakis. 2017. Wide Residual Networks. (2017). arxiv:1605.07146 [cs] http://arxiv.org/abs/1605.07146",
      "doi": ""
    },
    {
      "text": "Hua Zhang, Si Liu, Changqing Zhang, Wenqi Ren, Rui Wang, and Xiaochun Cao. 2016. SketchNet: Sketch Classification with Web Images. In 2016 IEEE Conference on Computer Vision and Pattern Recognition (CVPR) (2016-06). 1105–1113. https://doi.org/10.1109/CVPR.2016.125",
      "doi": ""
    }
  ]
}