{
  "doi": "10.1145/3411764.3445758",
  "title": "“I Am Iron Man”: Priming Improves the Learnability and Memorability of User-Elicited Gestures",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Priming is used as a way of increasing the diversity of proposals in end-user elicitation studies, but priming has not been investigated thoroughly in this context. We conduct a distributed end-user elicitation study with 167 participants, which had three priming groups: a no-priming control group, sci-fi priming, and a creative mindset group. We evaluated the gestures proposed by these groups in a distributed learnability and memorability study with 18 participants. We found that the user-elicited gestures from the sci-fi group were significantly faster to learn, requiring an average of 1.22 viewings to learn compared to 1.60 viewings required to learn the control gestures, and 1.56 viewings to learn the gestures elicited from the creative mindset group. In addition, both primed gesture groups had higher memorability with 80% of the sci-fi-primed gestures and 73% of the creative mindset group gestures were recalled correctly after one week without practice compared to 43% of the control group gestures.",
  "tags": [
    "end-user identification, learnability",
    "crowdsourcing, Mechanical Turk",
    "Distributed Interaction Design, end-user elicitation study",
    "memorability"
  ],
  "authors": [
    {
      "name": "Abdullah Ali",
      "institution": "Information School University of Washington, United States",
      "img": "/do/10.1145/contrib-99658705728/rel-imgonly/b0c4d23b-845f-4299-910e-8089d3809af0.jpeg",
      "acmid": "99658705728",
      "orcid": "missing"
    },
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500653200",
      "orcid": "missing"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "The Information School University of Washington, United States",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "Chadia Abras, Diane Maloney-Krichmar, and Jenny Preece. 2004. User-Centered Design. Encyclopedia of Human-Computer Interaction: 14.",
      "doi": ""
    },
    {
      "text": "Alan Agresti. 2010. Analysis of Ordinal Categorical Data. John Wiley & Sons, Inc.",
      "doi": ""
    },
    {
      "text": "Abdullah X. Ali, Meredith Ringel Morris, and Jacob O. Wobbrock. 2018. Crowdsourcing Similarity Judgments for Agreement Analysis in End-User Elicitation Studies. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology - UIST ’18 (UIST ’18), 177–188. https://doi.org/10.1145/3242587.3242621",
      "doi": ""
    },
    {
      "text": "Abdullah X Ali, Meredith Ringel Morris, and Jacob O. Wobbrock. 2019. Crowdlicit: A System for Conducting Distributed End-User Elicitation and Identification Studies. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 255. https://doi.org/10.1145/3290605.3300485",
      "doi": ""
    },
    {
      "text": "Yoav Benjamini and Henry Braun. 2002. John W. Tukey's Contributions to Multiple Comparisons. The Annals of Statistics 30, 6: 1576–1594.",
      "doi": ""
    },
    {
      "text": "Ceylan Beşevli, Oğuz Turan Buruk, Merve Erkaya, and Oğuzhan Özcan. 2018. Investigating the Effects of Legacy Bias: User Elicited Gestures from the End Users Perspective. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility - DIS ’18, 277–281. https://doi.org/10.1145/3197391.3205449",
      "doi": "10.1145/3197391.3205449"
    },
    {
      "text": "David Brin. 2010. Future Tense: How the Net ensures our cosmic survival. Communications of the ACM 53, 6: 120–ff. https://doi.org/10.1145/1743546.1743576",
      "doi": "10.1145/1743546.1743576"
    },
    {
      "text": "Jessica R. Cauchard, Jane L. E, Kevin Y. Zhai, and James A. Landay. 2015. Drone & me: an exploration into natural human-drone interaction. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing - UbiComp ’15, 361–365. https://doi.org/10.1145/2750858.2805823",
      "doi": "10.1145/2750858.2805823"
    },
    {
      "text": "Sabrina Connell, Pei-Yi Kuo, Liu Liu, and Anne Marie Piper. 2013. A Wizard-of-Oz elicitation study examining child-defined gestures with a whole-body interface. In Proceedings of the 12th International Conference on Interaction Design and Children - IDC ’13, 277–280. https://doi.org/10.1145/2485760.2485823",
      "doi": "10.1145/2485760.2485823"
    },
    {
      "text": "Hessam Jahani Fariman, Hasan J. Alyamani, Manolya Kavakli, and Len Hamey. 2016. Designing a User-defined Gesture Vocabulary for an In-vehicle Climate Control System. In (OzCHI ’16), 391–395. https://doi.org/10.1145/3010915.3010955",
      "doi": ""
    },
    {
      "text": "Lucas S. Figueiredo, Mariana G.M. Gonçalves Maciel Pinheiro, Edvar X.C. Vilar Neto, and Veronica Teichrieb. 2015. An Open Catalog of Hand Gestures from Sci-Fi Movies. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’15), 1319–1324. https://doi.org/10.1145/2702613.2732888",
      "doi": ""
    },
    {
      "text": "Leah Findlater, Ben Lee, and Jacob Wobbrock. 2012. Beyond QWERTY: augmenting touch screen keyboards with multi-touch gestures for non-alphanumeric input. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12, 2679–2682. https://doi.org/10.1145/2207676.2208660",
      "doi": "10.1145/2207676.2208660"
    },
    {
      "text": "Brigitte N. Frederick. 1999. Fixed-, Random-, and Mixed-Effects ANOVA Models: A User-Friendly Guide for Increasing the Generalizability of ANOVA Results. Retrieved July 1, 2020 from https://eric.ed.gov/?id=ED426098",
      "doi": ""
    },
    {
      "text": "A. R. Gilmour, R. D. Anderson, and A. L. Rae. 1985. The analysis of binomial data by a generalized linear mixed model. Biometrika 72, 3: 593–599. https://doi.org/10.1093/biomet/72.3.593",
      "doi": ""
    },
    {
      "text": "Donald Hedeker and Robert D. Gibbons. 1994. A Random-Effects Ordinal Regression Model for Multilevel Analysis. Biometrics 50, 4: 933–944. https://doi.org/10.2307/2533433",
      "doi": ""
    },
    {
      "text": "James J. Higgins and Suleiman Tashtoush. 1994. An aligned rank transform test for interaction. Nonlinear World 1, 2: 201–211.",
      "doi": ""
    },
    {
      "text": "Lynn Hoff, Eva Hornecker, and Sven Bertel. 2016. Modifying Gesture Elicitation: Do Kinaesthetic Priming and Increased Production Reduce Legacy Bias? In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI ’16, 86–91. https://doi.org/10.1145/2839462.2839472",
      "doi": "10.1145/2839462.2839472"
    },
    {
      "text": "Wen-jun Hou, Kai-xiang Chen, Hao Li, and Hu Zhou. 2018. User Defined Eye Movement-Based Interaction for Virtual Reality. In Cross-Cultural Design. Methods, Tools, and Users (Lecture Notes in Computer Science), 18–30.",
      "doi": ""
    },
    {
      "text": "Jon Favreau. 2010. Iron Man II. Paramount Pictures.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Richard E. Ladner. 2011. Usable Gestures for Blind People: Understanding Preference and Performance. In (CHI ’11), 413–422. https://doi.org/10.1145/1978942.1979001",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Anne Köpsel and Nikola Bubalo. 2015. Benefiting from legacy bias. interactions 22, 5: 44–47. https://doi.org/10.1145/2803169",
      "doi": ""
    },
    {
      "text": "William H. Kruskal and W. Allen Wallis. 1952. Use of Ranks in One-Criterion Variance Analysis. Journal of the American Statistical Association 47, 260: 583–621. https://doi.org/10.2307/2280779",
      "doi": ""
    },
    {
      "text": "Jerrod Larson. 2008. Limited imagination: Depictions of computers in science fiction film. Futures 40, 3: 293–299. https://doi.org/10.1016/j.futures.2007.08.015",
      "doi": ""
    },
    {
      "text": "K. S. Lashley. 1951. The Problem of Serial Order in Behavior. New York: Wiley.: PP. 112-131.",
      "doi": ""
    },
    {
      "text": "Eckhard Limpert, Werner A. Stahel, and Markus Abbt. 2001. Log-normal Distributions across the Sciences: Keys and CluesOn the charms of statistics, and how mechanical models resembling gambling machines offer a link to a handy way to characterize log-normal distributions, which can provide deeper insight into variability and probability—normal or log-normal: That is the question. BioScience 51, 5: 341–352. https://doi.org/10.1641/0006-3568(2001)051%5b0341:LNDATS%5d2.0.CO;2",
      "doi": ""
    },
    {
      "text": "R. C. Littell, P. R. Henry, and C. B. Ammerman. 1998. Statistical analysis of repeated measures data using SAS procedures. Journal of Animal Science 76, 4: 1216–1231. https://doi.org/10.2527/1998.7641216x",
      "doi": ""
    },
    {
      "text": "Nathan Magrofuoco and Jean Vanderdonckt. 2019. Gelicit: A Cloud Platform for Distributed Gesture Elicitation Studies. Proceedings of the ACM on Human-Computer Interaction. 3, EICS: 6:1–6:41. https://doi.org/10.1145/3331148",
      "doi": ""
    },
    {
      "text": "H. B. Mann and D. R. Whitney. 1947. On a Test of Whether one of Two Random Variables is Stochastically Larger than the Other. The Annals of Mathematical Statistics 18, 1: 50–60.",
      "doi": ""
    },
    {
      "text": "Aaron Marcus. 2013. The History of the Future: Sci-fi Movies and HCI. interactions 20, 4: 64–67. https://doi.org/10.1145/2486227.2486240",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris. 2012. Web on the Wall: Insights from a Multimodal Interaction Elicitation Study. In Proceedings of the 2012 ACM International Conference on Interactive Tabletops and Surfaces (ITS ’12), 95–104. https://doi.org/10.1145/2396636.2396651",
      "doi": "10.1145/2396636.2396651"
    },
    {
      "text": "Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, c. schraefel, and Jacob O. Wobbrock. 2014. Reducing legacy bias in gesture elicitation studies. interactions 21, 3: 40–45. https://doi.org/10.1145/2591689",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Jacob O. Wobbrock, and Andrew D. Wilson. 2010. Understanding Users’ Preferences for Surface Gestures. In Proceedings of graphics interface 2010 (GI ’10), 261–268. Retrieved February 25, 2018 from http://dl.acm.org/citation.cfm?id=1839214.1839260",
      "doi": ""
    },
    {
      "text": "Omar Mubin, Mohammad Obaid, Philipp Jordan, Patricia Alves-Oliveria, Thommy Eriksson, Wolmet Barendregt, Daniel Sjolle, Morten Fjeld, Simeon Simoff, and Mark Billinghurst. 2016. Towards an Agenda for Sci-Fi Inspired HCI Research. In Proceedings of the 13th International Conference on Advances in Computer Entertainment Technology (ACE ’16), 10:1–10:6. https://doi.org/10.1145/3001773.3001786",
      "doi": "10.1145/3001773.3001786"
    },
    {
      "text": "Michael J. Muller and Sarah Kuhn. 1993. Participatory design. Communications of the ACM 36, 6: 24–28. https://doi.org/10.1145/153571.255960",
      "doi": "10.1145/153571.255960"
    },
    {
      "text": "Miguel A. Nacenta, Yemliha Kamber, Yizhou Qiang, and Per Ola Kristensson. 2013. Memorability of pre-designed and user-defined gesture sets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13, 1099. https://doi.org/10.1145/2470654.2466142",
      "doi": "10.1145/2470654.2466142"
    },
    {
      "text": "Mohammad Obaid, Markus Häring, Felix Kistler, René Bühling, and Elisabeth André. 2012. User-Defined Body Gestures for Navigational Control of a Humanoid Robot. In Social Robotics, Shuzhi Sam Ge, Oussama Khatib, John-John Cabibihan, Reid Simmons and Mary-Anne Williams (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 367–377. https://doi.org/10.1007/978-3-642-34103-8_37",
      "doi": ""
    },
    {
      "text": "Mohammad Obaid, Felix Kistler, Gabriel\\.e Kasparavičiūt\\.e, Asim Evren Yantaç, and Morten Fjeld. 2016. How Would You Gesture Navigate a Drone?: A User-centered Approach to Control a Drone. In (AcademicMindtrek ’16), 113–121. https://doi.org/10.1145/2994310.2994348",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. 2013. User-Defined Gestures for Augmented Reality. In Human-Computer Interaction – INTERACT 2013 (Lecture Notes in Computer Science), 282–299. https://doi.org/10.1007/978-3-642-40480-1_18",
      "doi": ""
    },
    {
      "text": "Patricia Pons and Javier Jaen. 2019. Interactive spaces for children: gesture elicitation for controlling ground mini-robots. Journal of Ambient Intelligence and Humanized Computing. https://doi.org/10.1007/s12652-019-01290-6",
      "doi": ""
    },
    {
      "text": "Jaime Ruiz and Daniel Vogel. 2015. Soft-Constraints to Reduce Legacy and Performance Bias to Elicit Whole-body Gestures with Low Arm Fatigue. In (CHI ’15), 3347–3350. https://doi.org/10.1145/2702123.2702583",
      "doi": ""
    },
    {
      "text": "Kai Sassenberg and Gordon B. Moskowitz. 2005. Don't stereotype, think different! Overcoming automatic stereotype activation by mindset priming. Journal of Experimental Social Psychology 41, 5: 506–514. https://doi.org/10.1016/j.jesp.2004.10.002",
      "doi": ""
    },
    {
      "text": "Kai Sassenberg, Gordon B. Moskowitz, Adam Fetterman, and Thomas Kessler. 2017. Priming creativity as a strategy to increase creative performance by facilitating the activation and use of remote associations. Journal of Experimental Social Psychology 68: 128–138. https://doi.org/10.1016/j.jesp.2016.06.010",
      "doi": ""
    },
    {
      "text": "Michael Schmitz, Christoph Endres, and Andreas Butz. 2007. A Survey of Human-computer Interaction Design in Science Fiction Movies. In Proceedings of the 2Nd International Conference on INtelligent TEchnologies for Interactive enterTAINment (INTETAIN ’08), 7:1–7:10. Retrieved February 20, 2019 from http://dl.acm.org/citation.cfm?id=1363200.1363210",
      "doi": ""
    },
    {
      "text": "Nathan Shedroff and Chris Noessel. 2012. Make It So: Learning from Sci-fi Interfaces. In Proceedings of the International Working Conference on Advanced Visual Interfaces (AVI ’12), 7–8. https://doi.org/10.1145/2254556.2254561",
      "doi": "10.1145/2254556.2254561"
    },
    {
      "text": "John W. Tukey. 1949. Comparing Individual Means in the Analysis of Variance. Biometrics 5, 2: 99–114. https://doi.org/10.2307/3001913",
      "doi": ""
    },
    {
      "text": "John W. Tukey. 1953. The Problem of Multiple Comparisons. Princeton, NJ: Princeton University.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, 1325–1334. https://doi.org/10.1145/2702123.2702223",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2016. Between-Subjects Elicitation Studies: Formalization and Tool Support. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16, 3390–3402. https://doi.org/10.1145/2858036.2858228",
      "doi": ""
    },
    {
      "text": "Santiago Villarreal-Narvaez, Jean Vanderdonckt, Radu-Daniel Vatavu, and Jacob O Wobbrock. A Systematic Review of Gesture Elicitation Studies: What Can We Learn from 216 Studies? 26.",
      "doi": ""
    },
    {
      "text": "Tijana Vuletic, Alex Duffy, Laura Hay, Chris McTeague, Gerard Campbell, and Madeleine Grealy. 2019. Systematic literature review of hand gestures used in human computer interaction interfaces. International Journal of Human-Computer Studies 129: 74–94. https://doi.org/10.1016/j.ijhcs.2019.03.011",
      "doi": "10.1016/j.ijhcs.2019.03.011"
    },
    {
      "text": "Jacob O. Wobbrock, Htet Htet Aung, Brandon Rothrock, and Brad A. Myers. 2005. Maximizing the guessability of symbolic input. In CHI ’05 extended abstracts on Human factors in computing systems - CHI ’05, 1869. https://doi.org/10.1145/1056808.1057043",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11), 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. 2009. User-defined gestures for surface computing. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09 (CHI ’09), 1083–1092. https://doi.org/10.1145/1518701.1518866",
      "doi": ""
    },
    {
      "text": "Yiqi Xiao and Renke He. 2018. The Handlebar as an Input Field: Evaluating Finger Gestures Designed for Bicycle Riders. In Advances in Human Aspects of Transportation (Advances in Intelligent Systems and Computing), 648–659. https://doi.org/10.1007/978-3-319-93885-1_59",
      "doi": ""
    }
  ]
}