{
  "doi": "10.1145/3411764.3445767",
  "title": "Patterns for Representing Knowledge Graphs to Communicate Situational Knowledge of Service Robots",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Service robots are envisioned to be adaptive to their working environment based on situational knowledge. Recent research focused on designing visual representation of knowledge graphs for expert users. However, how to generate an understandable interface for non-expert users remains to be explored. In this paper, we use knowledge graphs (KGs) as a common ground for knowledge exchange and develop a pattern library for designing KG interfaces for non-expert users. After identifying the types of robotic situational knowledge from the literature, we present a formative study in which participants used cards to communicate the knowledge for given scenarios. We iteratively coded the results and identified patterns for representing various types of situational knowledge. To derive design recommendations for applying the patterns, we prototyped a lab service robot and conducted Wizard-of-Oz testing. The patterns and recommendations could provide useful guidance in designing knowledge-exchange interfaces for robots.",
  "authors": [
    {
      "name": "Shengchen Zhang",
      "institution": "College of Design and Innovation Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701622",
      "orcid": "missing"
    },
    {
      "name": "Zixuan Wang",
      "institution": "College of Design and Innovation Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702302",
      "orcid": "missing"
    },
    {
      "name": "Chaoran Chen",
      "institution": "College of Design and Innovation Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659463412",
      "orcid": "missing"
    },
    {
      "name": "Yi Dai",
      "institution": "College of Design and Innovation Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700943",
      "orcid": "missing"
    },
    {
      "name": "Lyumanshan Ye",
      "institution": "College of Design and Innovation Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701032",
      "orcid": "missing"
    },
    {
      "name": "Xiaohua Sun",
      "institution": "College of Design and Innovation Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488646368",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Christopher Alexander. 1977. A pattern language: towns, buildings, construction. Oxford university press.",
      "doi": ""
    },
    {
      "text": "Christopher Alexander. 1979. The Timeless Way of Building. Oxford University Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Patricia A. Alexander and Judith E. Judy. 1988. The Interaction of Domain-Specific and Strategic Knowledge in Academic Performance. Review of Educational Research 58, 4 (1988), 375–404. https://doi.org/10.3102/00346543058004375",
      "doi": ""
    },
    {
      "text": "Helio Azevedo, José Pedro R. Belo, and Roseli A. F. Romero. 2019. Using Ontology as a Strategy for Modeling the Interface Between the Cognitive and Robotic Systems. Journal of Intelligent & Robotic Systems (Aug. 2019). https://doi.org/10.1007/s10846-019-01076-0",
      "doi": ""
    },
    {
      "text": "Evan Barba, Anthony Lioon, Christopher Miller, and Yasir Majeed Khan. 2020. Tele-robotic Interface Design in Context: A Case for Recursive Design. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": ""
    },
    {
      "text": "Emanuele Bastianelli, Domenico Bloisi, Roberto Capobianco, Guglielmo Gemignani, Luca Iocchi, and Daniele Nardi. 2013. Knowledge representation for robots through human-robot interaction. arXiv preprint arXiv:1307.7351(2013).",
      "doi": ""
    },
    {
      "text": "Barbara Bruno, Carmine Tommaso Recchiuto, Irena Papadopoulos, Alessandro Saffiotti, Christina Koulouglioti, Roberto Menicatti, Fulvio Mastrogiovanni, Renato Zaccaria, and Antonio Sgorbissa. 2019. Knowledge Representation for Culturally Competent Personal Robots: Requirements, Design Principles, Implementation, and Assessment. International Journal of Social Robotics 11, 3 (June 2019), 515–538. https://doi.org/10.1007/s12369-019-00519-w",
      "doi": ""
    },
    {
      "text": "Taylor J Carpenter and Wayne W Zachary. 2017. Using context and robot-human communication to resolve unexpected situational conflicts. In 2017 IEEE Conference on Cognitive and Computational Aspects of Situation Management (CogSIMA). IEEE, 1–7.",
      "doi": ""
    },
    {
      "text": "Doo Soo Chang, Gun Hee Cho, and Yong Suk Choi. 2020. Ontology-based knowledge model for human-robot interactive services. In Proceedings of the 35th Annual ACM Symposium on Applied Computing. 2029–2038.",
      "doi": ""
    },
    {
      "text": "Mimi V Chapman, Shiyou Wu, and Meihua Zhu. 2017. What is a picture worth? A primer for coding and interpreting photographic data. Qualitative Social Work 16, 6 (2017), 810–824.",
      "doi": ""
    },
    {
      "text": "Jessie YC Chen, Ellen C Haas, and Michael J Barnes. 2007. Human performance issues and user interface design for teleoperated robots. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews) 37, 6 (2007), 1231–1245.",
      "doi": "10.1109/TSMCC.2007.905819"
    },
    {
      "text": "Ton de Jong and Monica G.M. Ferguson-Hessler. 1996. Types and qualities of knowledge. Educational Psychologist 31, 2 (1996), 105–113. https://doi.org/10.1207/s15326985ep3102_2",
      "doi": ""
    },
    {
      "text": "James P Diprose, Beryl Plimmer, Bruce A MacDonald, John Hosking, 2012. How people naturally describe robot behaviour. (2012).",
      "doi": ""
    },
    {
      "text": "J P Diprose, B Plimmer, B A MacDonald, and J G Hosking. 2012. How People Naturally Describe Robot Behaviour. New Zealand. (2012), 9.",
      "doi": ""
    },
    {
      "text": "Rui Fang, Malcolm Doering, and Joyce Y Chai. 2015. Embodied collaborative referring expression generation in situated human-robot interaction. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. 271–278.",
      "doi": "10.1145/2696454.2696467"
    },
    {
      "text": "Aidan Hogan, Eva Blomqvist, Michael Cochez, Claudia d’Amato, Gerard de Melo, Claudio Gutierrez, José Emilio Labra Gayo, Sabrina Kirrane, Sebastian Neumaier, Axel Polleres, 2020. Knowledge graphs. arXiv preprint arXiv:2003.02320(2020).",
      "doi": ""
    },
    {
      "text": "Il Hong Suh, Gi Hyun Lim, Wonil Hwang, Hyowon Suh, Jung-Hwa Choi, and Young-Tack Park. 2007. Ontology-based multi-layered robot knowledge framework (OMRKF) for robot intelligence. In 2007 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, San Diego, CA, USA, 429–436. https://doi.org/10.1109/IROS.2007.4399082",
      "doi": ""
    },
    {
      "text": "Binal Javia and Philipp Cimiano. 2016. A knowledge-based architecture supporting declarative action representation for manipulation of everyday objects. In Proceedings of the 3rd Workshop on Model-Driven Robot Software Engineering. 40–46.",
      "doi": "10.1145/3022099.3022105"
    },
    {
      "text": "Hwawoo Jeon, Kyon-Mo Yang, Sungkee Park, Jongsuk Choi, and Yoonseob Lim. [n.d.]. An Ontology-based Home Care Service Robot for Persons with Dementia. ([n. d.]), 6.",
      "doi": ""
    },
    {
      "text": "Meng Jiang. 2020. Improving situational awareness with collective artificial intelligence over knowledge graphs. In Artificial Intelligence and Machine Learning for Multi-Domain Operations Applications II, Vol. 11413. International Society for Optics and Photonics, 114130J.",
      "doi": ""
    },
    {
      "text": "Kristiina Jokinen, Satoshi Nishimura, Kentaro Watanabe, and Takuichi Nishimura. 2019. Human-robot dialogues for explaining activities. In 9th International Workshop on Spoken Dialogue System Technology. Springer, 239–251.",
      "doi": ""
    },
    {
      "text": "Peter H Kahn, Nathan G Freier, Takayuki Kanda, Hiroshi Ishiguro, Jolina H Ruckert, Rachel L Severson, and Shaun K Kane. 2008. Design patterns for sociality in human-robot interaction. In Proceedings of the 3rd ACM/IEEE international conference on Human robot interaction. 97–104.",
      "doi": "10.1145/1349822.1349836"
    },
    {
      "text": "Peter H. Kahn, Nathan G. Freier, Takayuki Kanda, Hiroshi Ishiguro, Jolina H. Ruckert, Rachel L. Severson, and Shaun K. Kane. 2008. Design patterns for sociality in human-robot interaction. In Proceedings of the 3rd ACM/IEEE international conference on Human robot interaction(HRI ’08). Association for Computing Machinery, New York, NY, USA, 97–104. https://doi.org/10.1145/1349822.1349836",
      "doi": "10.1145/1349822.1349836"
    },
    {
      "text": "Ajay Kattepur. 2019. RoboPlanner: autonomous robotic action planning via knowledge graph queries. In Proceedings of the 34th ACM/SIGAPP Symposium on Applied Computing. 953–956.",
      "doi": "10.1145/3297280.3297568"
    },
    {
      "text": "Casey Kennington and Aprajita Shukla. 2017. A Graphical Digital Personal Assistant that Grounds and Learns Autonomously. In Proceedings of the 5th International Conference on Human Agent Interaction. 353–357.",
      "doi": "10.1145/3125739.3132592"
    },
    {
      "text": "Simon Klakegg, Niels van Berkel, Aku Visuri, Hanna-Leena Huttunen, Simo Hosio, Chu Luo, Jorge Goncalves, and Denzil Ferreira. 2017. Designing a context-aware assistive infrastructure for elderly care. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers. 563–568.",
      "doi": "10.1145/3123024.3124403"
    },
    {
      "text": "Krzysztof Tomasz Konecki. 2011. Visual grounded theory: A methodological outline and examples from empirical work. Revija za sociologiju 41, 2 (2011), 131–160.",
      "doi": ""
    },
    {
      "text": "Geert-Jan M. Kruijff, Hendrik Zender, Patric Jensfelt, and Henrik I. Christensen. 2007. Situated Dialogue and Spatial Organization: What, Where… and Why?International Journal of Advanced Robotic Systems 4, 1 (March 2007), 16. https://doi.org/10.5772/5701",
      "doi": ""
    },
    {
      "text": "John E. Laird, Christian Lebiere, and Paul S. Rosenbloom. 2017. A Standard Model of the Mind: Toward a Common Computational Framework across Artificial Intelligence, Cognitive Science, Neuroscience, and Robotics. AI Magazine 38, 4 (Dec. 2017), 13–26. https://doi.org/10.1609/aimag.v38i4.2744",
      "doi": ""
    },
    {
      "text": "Séverin Lemaignan, Mathieu Warnier, E Akin Sisbot, Aurélie Clodic, and Rachid Alami. 2017. Artificial cognition for social human–robot interaction: An implementation. Artificial Intelligence 247 (2017), 45–69.",
      "doi": "10.1016/j.artint.2016.07.002"
    },
    {
      "text": "Séverin Lemaignan, Mathieu Warnier, E. Akin Sisbot, Aurélie Clodic, and Rachid Alami. 2017. Artificial cognition for social human–robot interaction: An implementation. Artificial Intelligence 247 (June 2017), 45–69. https://doi.org/10.1016/j.artint.2016.07.002",
      "doi": "10.1016/j.artint.2016.07.002"
    },
    {
      "text": "Nicola Leonardi, Marco Manca, Fabio Paternò, and Carmen Santoro. 2019. Trigger-action programming for personalising humanoid robot behaviour. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300675"
    },
    {
      "text": "Gi Hyun Lim, Il Hong Suh, and Hyowon Suh. 2011. Ontology-Based Unified Robot Knowledge for Service Robots in Indoor Environments. IEEE Transactions on Systems, Man, and Cybernetics - Part A: Systems and Humans 41, 3 (May 2011), 492–509. https://doi.org/10.1109/TSMCA.2010.2076404",
      "doi": "10.1109/TSMCA.2010.2076404"
    },
    {
      "text": "Changsong Liu, Jacob Walker, and Joyce Y Chai. 2010. Ambiguities in spatial language understanding in situated human robot dialogue. In 2010 AAAI Fall Symposium Series.",
      "doi": ""
    },
    {
      "text": "Hangxin Liu, Yaofang Zhang, Wenwen Si, Xu Xie, Yixin Zhu, and Song-Chun Zhu. 2018. Interactive robot knowledge patching using augmented reality. In 2018 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 1947–1954.",
      "doi": "10.1109/ICRA.2018.8462837"
    },
    {
      "text": "Christof Mahieu, Femke Ongenae, Femke De Backere, Pieter Bonte, Filip De Turck, and Pieter Simoens. 2019. Semantics-based platform for context-aware and personalized robot interaction in the internet of robotic things. Journal of Systems and Software 149 (March 2019), 138–157. https://doi.org/10.1016/j.jss.2018.11.022",
      "doi": ""
    },
    {
      "text": "Patricia Yancey Martin and Barry A Turner. 1986. Grounded theory and organizational research. The journal of applied behavioral science 22, 2 (1986), 141–157.",
      "doi": ""
    },
    {
      "text": "Jeremy A Marvel, Shelly Bagchi, Megan Zimmerman, and Brian Antonishek. 2020. Towards Effective Interface Designs for Collaborative HRI in Manufacturing: Metrics and Measures. ACM Transactions on Human-Robot Interaction (THRI) 9, 4 (2020), 1–55.",
      "doi": "10.1145/3385009"
    },
    {
      "text": "Tina Mioch, Wietse Ledegang, Rosie Paulissen, Mark A Neerincx, and Jurriaan van Diggelen. 2014. Interaction design patterns for coherent and re-usable shape specifications of human-robot collaboration. In Proceedings of the 2014 ACM SIGCHI symposium on Engineering interactive computing systems. 75–83.",
      "doi": "10.1145/2607023.2607037"
    },
    {
      "text": "Carlos Nieto-Granda, John G Rogers, Alexander JB Trevor, and Henrik I Christensen. 2010. Semantic map partitioning in indoor environments using regional analysis. In 2010 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 1451–1456.",
      "doi": ""
    },
    {
      "text": "Ozgur S Oguz, Wolfgang Rampeltshammer, Sebastian Paillan, and Dirk Wollherr. 2019. An Ontology for Human-Human Interactions and Learning Interaction Behavior Policies. ACM Transactions on Human-Robot Interaction (THRI) 8, 3 (2019), 1–26.",
      "doi": "10.1145/3326539"
    },
    {
      "text": "Alberto Olivares-Alarcos, Daniel Beßler, Alaa Khamis, Paulo Goncalves, Maki K. Habib, Julita Bermejo-Alonso, Marcos Barreto, Mohammed Diab, Jan Rosell, João Quintas, Joanna Olszewska, Hirenkumar Nakawala, Edison Pignaton, Amelie Gyrard, Stefano Borgo, Guillem Alenyà, Michael Beetz, and Howard Li. 2019. A review and comparison of ontology-based approaches to robot autonomy. The Knowledge Engineering Review 34 (2019), e29. https://doi.org/10.1017/S0269888919000237",
      "doi": ""
    },
    {
      "text": "Raquel Oliveira, Patrícia Arriaga, Patrícia Alves-Oliveira, Filipa Correia, Sofia Petisca, and Ana Paiva. 2018. Friends or foes? Socioemotional support and gaze behaviors in mixed groups of humans and robots. In Proceedings of the 2018 ACM/IEEE international conference on human-robot interaction. 279–288.",
      "doi": "10.1145/3171221.3171272"
    },
    {
      "text": "Stefano Padilla, Thomas S. Methven, David A. Robb, and Mike J. Chantler. 2017. Understanding Concept Maps: A Closer Look at How People Organise Ideas. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 815–827. https://doi.org/10.1145/3025453.3025977",
      "doi": "10.1145/3025453.3025977"
    },
    {
      "text": "Chris Paxton, Felix Jonathan, Andrew Hundt, Bilge Mutlu, and Gregory D Hager. 2018. Evaluating methods for end-user creation of robot task plans. In 2018 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, 6086–6092.",
      "doi": "10.1109/IROS.2018.8594127"
    },
    {
      "text": "Roy D Pea. 1987. User centered system design: new perspectives on human-computer interaction. (1987).",
      "doi": ""
    },
    {
      "text": "Andrzej Pronobis and Patric Jensfelt. 2012. Large-scale semantic mapping and reasoning with heterogeneous modalities. In 2012 IEEE international conference on robotics and automation. IEEE, 3515–3522.",
      "doi": ""
    },
    {
      "text": "Jennifer M Riley, Laura D Strater, Sheryl L Chappell, Erik S Connors, and Mica R Endsley. 2010. Situation awareness in human-robot interaction: Challenges and user interface requirements. Human-Robot Interactions in Future Military Operations (2010), 171–192.",
      "doi": ""
    },
    {
      "text": "Allison Sauppé and Bilge Mutlu. 2014. Design patterns for exploring and prototyping human-robot interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1439–1448.",
      "doi": "10.1145/2556288.2557057"
    },
    {
      "text": "Martin Schrepp and Jörg Thomaschewski. 2019. Eine modulare Erweiterung des User Experience Questionnaire. https://doi.org/10.18420/muc2019-up-0108",
      "doi": ""
    },
    {
      "text": "Ahmed Seffah. 2010. The evolution of design patterns in HCI: from pattern languages to pattern-oriented design. In Proceedings of the 1st International Workshop on Pattern-Driven Engineering of Interactive Computing Systems. 4–9.",
      "doi": "10.1145/1824749.1824751"
    },
    {
      "text": "E Akin Sisbot, Raquel Ros, and Rachid Alami. 2011. Situation assessment for human-robot interactive object manipulation. In 2011 RO-MAN. IEEE, 15–20.",
      "doi": ""
    },
    {
      "text": "Moritz Tenorth and Michael Beetz. 2013. KnowRob: A knowledge processing infrastructure for cognition-enabled robots. The International Journal of Robotics Research 32, 5 (April 2013), 566–590. https://doi.org/10.1177/0278364913481635",
      "doi": "10.1177/0278364913481635"
    },
    {
      "text": "Ilaria Tiddi, Emanuele Bastianelli, Gianluca Bardaro, Mathieu d’Aquin, and Enrico Motta. 2017. An ontology-based approach to improve the accessibility of ROS-based robotic systems. In Proceedings of the Knowledge Capture Conference. 1–8.",
      "doi": "10.1145/3148011.3148014"
    },
    {
      "text": "Ilaria Tiddi, Emanuele Bastianelli, Gianluca Bardaro, and Enrico Motta. 2018. A User-friendly Interface to Control ROS Robotic Platforms.. In International Semantic Web Conference (P&D/Industry/BlueSky).",
      "doi": ""
    },
    {
      "text": "Elin Anna Topp. 2017. Interaction patterns in human augmented mapping. Advanced Robotics 31, 5 (2017), 258–267.",
      "doi": ""
    },
    {
      "text": "Konstantinos Tsiakas, Michalis Papakostas, Michail Theofanidis, Morris Bell, Rada Mihalcea, Shouyi Wang, Mihai Burzo, and Fillia Makedon. 2017. An interactive multisensing framework for personalized human robot collaboration and assistive training using reinforcement learning. In Proceedings of the 10th International Conference on PErvasive Technologies Related to Assistive Environments. 423–427.",
      "doi": "10.1145/3056540.3076191"
    },
    {
      "text": "Wayne Zachary, Matthew Johnson, R Hoffman, Travis Thomas, Andrew Rosoff, and Thomas Santarelli. 2015. A context-based approach to robot-human interaction. Procedia Manufacturing 3(2015), 1052–1059.",
      "doi": ""
    },
    {
      "text": "W Zachary, A Rosoff, L Miller, S Read, K Laskey, I Emmons, and P Costa. 2013. Context as cognitive process. In Proc. of.",
      "doi": ""
    }
  ]
}