{
  "doi": "10.1145/3411764.3445764",
  "title": "Evaluating an App to Promote a Better Visit Through Shared Activities for People Living with Dementia and their Families",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "This project aims to foster shared positive experiences between people living with moderate to advanced dementia and their visitors as they may struggle to find topics to talk about and engaging things to do together. To promote a better visit, we trialed a previously developed app that includes eight games with twenty-one residents and their partners or carers across four care centers for three months each. Through interviews and data logging, we found that residents preferred games that were closer to their interests and skills, and that gameplay and cooperation fostered meaningful and shared interactions between residents and their visitors. The contribution of this work is twofold: (1) insights and opportunities into dyadic interactions when using an app and into promoting positive social experiences through technology design, and (2) reflections on the challenges of evaluating the benefits of technology for people living with dementia.",
  "tags": [
    "person-centered care",
    "dyadic interactions",
    "dementia",
    "app evaluation"
  ],
  "authors": [
    {
      "name": "Diego Muñoz",
      "institution": "Centre for Design Innovation Swinburne University of Technology, Australia",
      "img": "/do/10.1145/contrib-86158689157/rel-imgonly/profile_photo.jpg",
      "acmid": "86158689157",
      "orcid": "missing"
    },
    {
      "name": "Stu Favilla",
      "institution": "Future Self and Design Living Lab Swinburne University of Technology, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81314493647",
      "orcid": "missing"
    },
    {
      "name": "Sonja Pedell",
      "institution": "Centre for Design Innovation Swinburne University of Technology, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100224964",
      "orcid": "missing"
    },
    {
      "name": "Andrew Murphy",
      "institution": "Future Self and Living Design Lab Swinburne University of Technology, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659117104",
      "orcid": "missing"
    },
    {
      "name": "Jeanie Beh",
      "institution": "Future Self and Design Living Lab Swinburne University of Technology, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81551300456",
      "orcid": "missing"
    },
    {
      "name": "Tanya Petrovich",
      "institution": "Centre for Dementia Learning, Dementia Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702120",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Arlene J. Astell, Nicole Bouranis, Jesse Hoey, Allison Lindauer, Alex Mihailidis, Chris Nugent, and Julie M. Robillard. 2019. Technology and Dementia: The Future is Now. Dementia and geriatric cognitive disorders. https://doi.org/10.1159/000497800",
      "doi": ""
    },
    {
      "text": "Arlene J Astell and Maggie P Ellis. 2006. The social function of imitation in severe dementia. Infant and Child Development 15, 3: 311–319. https://doi.org/10.1002/icd.455",
      "doi": ""
    },
    {
      "text": "Arlene J Astell, Maggie P Ellis, Lauren Bernardi, Norman Alm, Richard Dye, Gary Gowans, and Jim Campbell. 2010. Using a touch screen computer to support relationships between people with dementia and caregivers. Interacting with Computers 22, 4: 267–275. https://doi.org/10.1016/j.intcom.2010.03.003",
      "doi": "10.1016/j.intcom.2010.03.003"
    },
    {
      "text": "Jeanie Beh and Sonja Pedell. 2017. When interest pays off: The relationship between motivation, wellbeing and learning of technologies by older adults. In Proceedings of the Fourth International Conference on Design4Health, 27–30.",
      "doi": ""
    },
    {
      "text": "Jennifer Boger, Babak Taati, and Alex Mihailidis. 2016. Interdisciplinary development of manual and automated product usability assessments for older adults with dementia: lessons learned. Disability and Rehabilitation: Assistive Technology 11, 7: 581–587. https://doi.org/10.3109/17483107.2015.1063714",
      "doi": ""
    },
    {
      "text": "Dawn Brooker. 2005. Dementia Care Mapping: A Review of the Research Literature. The Gerontologist 45, suppl_1: 11–18. https://doi.org/10.1093/geront/45.suppl_1.11",
      "doi": ""
    },
    {
      "text": "J.-A. Brown. 2012. The most difficult decision: dementia and the move into residential aged care. In Dementia Australia Special Report, 1–40.",
      "doi": ""
    },
    {
      "text": "Lynette Chenoweth, Jane Stein-Parbury, Samuel Lapkin, Alex Wang, Zhixin Liu, and Anna Williams. 2019. Effects of person-centered care at the organisational-level for people with dementia. A systematic review. PLOS ONE 14, 2: 1–21. https://doi.org/10.1371/journal.pone.0212686",
      "doi": ""
    },
    {
      "text": "Lynn Chenoweth, Madeleine T King, Yun-Hee Jeon, Henry Brodaty, Jane Stein-Parbury, Richard Norman, Marion Haas, and Georgina Luscombe. 2009. Caring for Aged Dementia Care Resident Study (CADRES) of person-centred care, dementia-care mapping, and usual care in dementia: a cluster-randomised trial. The Lancet Neurology 8, 4: 317–325. https://doi.org/10.1016/S1474-4422(09)70045-6",
      "doi": ""
    },
    {
      "text": "Emma Dixon. 2019. Understanding the Occupational Therapists Method to Inform the Design of Technologies for People with Dementia. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), 1–6. https://doi.org/10.1145/3290607.3308453",
      "doi": "10.1145/3290607.3308453"
    },
    {
      "text": "Emma Dixon and Amanda Lazar. 2020. Approach Matters: Linking Practitioner Approaches to Technology Design for People with Dementia. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–15. https://doi.org/10.1145/3313831.3376432",
      "doi": "10.1145/3313831.3376432"
    },
    {
      "text": "James Edmeads and Oussama Metatla. 2019. Designing for Reminiscence with People with Dementia. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), 1–6. https://doi.org/10.1145/3290607.3313059",
      "doi": ""
    },
    {
      "text": "Stu Favilla and Sonja Pedell. 2013. Touch screen ensemble music: Collaborative interaction for older people with dementia. Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration, OzCHI 2013: 481–484. https://doi.org/10.1145/2541016.2541088",
      "doi": "10.1145/2541016.2541088"
    },
    {
      "text": "Stu Favilla, Sonja Pedell, Jeanie Beh, Andrew Murphy, and Tanya Petrovich. 2018. Designing a better visit: Touch-screen apps for older people living with dementia and their loved ones. In Proceedings of the 5th Conference on Design4Health.",
      "doi": ""
    },
    {
      "text": "Howard Feldman and Michael Grundman. 1999. Symptomatic treatments for Alzheimer's disease. In Clinical Diagnosis and Management of Alzheimer's Disease (2nd ed.), Serge Gauthier (ed.). Martin Dunitz Ltd, London, England, 249–262.",
      "doi": ""
    },
    {
      "text": "Sarah Foley, John McCarthy, and Nadia Pantidi. 2019. The Struggle for Recognition in Advanced Dementia: Implications for Experience-Centered Design. ACM Trans. Comput.-Hum. Interact. 26, 6. https://doi.org/10.1145/3359594",
      "doi": "10.1145/3359594"
    },
    {
      "text": "Sarah Foley, Nadia Pantidi, and John McCarthy. 2019. Care and Design: An Ethnography of Mutual Recognition in the Context of Advanced Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 1–15. https://doi.org/10.1145/3290605.3300840",
      "doi": "10.1145/3290605.3300840"
    },
    {
      "text": "Pin Sym Foong, Shengdong Zhao, Kelsey Carlson, and Zhe Liu. 2017. VITA: Towards Supporting Volunteer Interactions with Long-Term Care Residents with Dementia. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 6195–6207. https://doi.org/10.1145/3025453.3025776",
      "doi": "10.1145/3025453.3025776"
    },
    {
      "text": "Sandra Garrido, Laura Dunne, Esther Chang, Janette Perz, Catherine J Stevens, and Maggie Haertsch. 2017. The Use of Music Playlists for People with Dementia: A Critical Synthesis. Journal of Alzheimer's Disease 60: 1129–1142. https://doi.org/10.3233/JAD-170612",
      "doi": ""
    },
    {
      "text": "Aideen Gibson, Claire McCauley, Maurice Mulvenna, Assumpta Ryan, Liz Laird, Kevin Curran, Brendan Bunting, Finola Ferry, and Raymond Bond. 2016. Assessing Usability Testing for People Living with Dementia. In Proceedings of the 4th Workshop on ICTs for Improving Patients Rehabilitation Research Techniques (REHAB ’16), 25–31. https://doi.org/10.1145/3051488.3051492",
      "doi": "10.1145/3051488.3051492"
    },
    {
      "text": "Gary Gowans, Jim Campbell, Norm Alm, Richard Dye, Arlene Astell, and Maggie Ellis. 2004. Designing a Multimedia Conversation Aid for Reminiscence Therapy in Dementia Care Environments. In CHI ’04 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’04), 825–836. https://doi.org/10.1145/985921.985943",
      "doi": ""
    },
    {
      "text": "Bart Hattink, Rose-Marie Droes, Sietske Sikkes, Ellen Oostra, and Afina W Lemstra. 2016. Evaluation of the Digital Alzheimer Center: Testing Usability and Usefulness of an Online Portal for Patients with Dementia and Their Carers. JMIR Res Protoc 5, 3: e144. https://doi.org/10.2196/resprot.5040",
      "doi": ""
    },
    {
      "text": "HealthDirect. 2019. How technology is helping people with dementia. Retrieved September 9, 2020 from https://www.healthdirect.gov.au/blog/how-technology-is-helping-people-with-dementia",
      "doi": ""
    },
    {
      "text": "Hsiu-Fang Hsieh and Sarah E Shannon. 2005. Three Approaches to Qualitative Content Analysis. Qualitative Health Research 15, 9: 1277–1288. https://doi.org/10.1177/1049732305276687",
      "doi": ""
    },
    {
      "text": "Stephan Huber, Alexander Bejan, Beate Radzey, and Jörn Hurtienne. 2019. Proxemo or How to Evaluate User Experience for People with Dementia. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), 1–6. https://doi.org/10.1145/3290607.3313018",
      "doi": "10.1145/3290607.3313018"
    },
    {
      "text": "Ann Hurley and Ladislav Volicer. 1998. Hospice Care for Patients with Advanced Progressive Dementia. Springer Publishing Company, New York. Retrieved from http://ezproxy.lib.swin.edu.au/login?url=//search.ebscohost.com/login.aspx?direct=true&db=e000xww&AN=246106&site=ehost-live&scope=site",
      "doi": ""
    },
    {
      "text": "Emily S Ihara, Catherine J Tompkins, Megumi Inoue, and Sonya Sonneman. 2019. Results from a person-centered music intervention for individuals living with dementia. Geriatrics & Gerontology International 19, 1: 30–34. https://doi.org/10.1111/ggi.13563",
      "doi": ""
    },
    {
      "text": "T Jones, D Kay, P Upton, and D Upton. 2013. An evaluation of older adults use of ipads in eleven UK care-homes. International Journal of Mobile Human Computer Interaction 5, 3: 62–76. https://doi.org/10.4018/jmhci.2013070104",
      "doi": "10.4018/jmhci.2013070104"
    },
    {
      "text": "Gail Kenning. 2018. Reciprocal design: inclusive design approaches for people with late stage dementia. Design for Health 2, 1: 142–162. https://doi.org/10.1080/24735132.2018.1453638",
      "doi": ""
    },
    {
      "text": "Tom Kitwood. 1997. Dementia reconsidered: the person comes first. Open University Press, Buckingham, England.",
      "doi": ""
    },
    {
      "text": "Tom Kitwood and Kathleen Bredin. 1992. Towards a Theory of Dementia Care: Personhood and Well-being. Ageing and Society 12, 3: 269–287. https://doi.org/10.1017/S0144686X0000502X",
      "doi": ""
    },
    {
      "text": "Ann Light, Tuck W Leong, and Toni Robertson. 2015. Ageing Well with CSCW. In ECSCW 2015: Proceedings of the 14th European Conference on Computer Supported Cooperative Work, 19-23 September 2015, Oslo, Norway, Nina Boulus-Rødje, Gunnar Ellingsen, Tone Bratteteig, Margunn Aanestad and Pernille Bjørn (eds.). Springer International Publishing, Cham, 295–304. https://doi.org/10.1007/978-3-319-20499-4_16",
      "doi": ""
    },
    {
      "text": "Siân Lindley and Jayne Wallace. 2015. Placing in Age: Transitioning to a New Home in Later Life. ACM Trans. Comput.-Hum. Interact. 22, 4: 1–39. https://doi.org/10.1145/2755562",
      "doi": "10.1145/2755562"
    },
    {
      "text": "Franka J M Meiland, Ans I E Bouman, Stefan Sävenstedt, Sanne Bentvelzen, Richard J Davies, Maurice D Mulvenna, Chris D Nugent, Ferial Moelaert, Marike E Hettinga, Johan E Bengtsson, and Rose-Marie Dröes. 2012. Usability of a new electronic assistive device for community-dwelling persons with mild dementia. Aging & Mental Health 16, 5: 584–591. https://doi.org/10.1080/13607863.2011.651433",
      "doi": ""
    },
    {
      "text": "Akira Minematsu. 2006. The Frequency of Family Visits Influences the Behavioral and Psychological Symptoms of Dementia (BPSD) of Aged People with Dementia in a Nursing Home. Journal of Physical Therapy Science 18, 2: 123–126. https://doi.org/10.1589/jpts.18.123",
      "doi": ""
    },
    {
      "text": "Andrew Murphy, Stu Favilla, Sonja Pedell, Jeanie Beh, and Tanya Petrovich. 2020. Designing Novel and Engaging Interactions with and for Residents Living with Dementia and their Visitors. In Proceedings of DRS2020, 14.",
      "doi": ""
    },
    {
      "text": "Timothy Neate, Aikaterini Bourazeri, Abi Roper, Simone Stumpf, and Stephanie Wilson. 2019. Co-Created Personas: Engaging and Empowering Users with Diverse Needs Within the Design Process. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 1–12. https://doi.org/10.1145/3290605.3300880",
      "doi": "10.1145/3290605.3300880"
    },
    {
      "text": "Michael Quinn Patton. 2002. Qualitative research and evaluation methods. Sage, Thousand Oaks, California.",
      "doi": ""
    },
    {
      "text": "Sonja Pedell, Stu Favilla, Andrew Murphy, Jeanie Beh, and Tanya Petrovich. 2020. Promoting Personhood for People with Dementia Through Shared Social Touchscreen Interactions. In Design of Assistive Technology for Ageing Populations, Andree Woodcock, Louise Moody, Deana McDonagh, Ajita Jain and Lakhmi C Jain (eds.). Springer International Publishing, Cham, 335–361. https://doi.org/10.1007/978-3-030-26292-1_18",
      "doi": ""
    },
    {
      "text": "Philippa Riley, Norman Alm, and Alan Newell. 2009. An interactive tool to promote musical creativity in people with dementia. Computers in Human Behavior 25, 3: 599–608. https://doi.org/10.1016/j.chb.2008.08.014",
      "doi": "10.1016/j.chb.2008.08.014"
    },
    {
      "text": "Celia Roberts and Maggie Mort. 2009. Reshaping what counts as care: Older people, work and new technologies. Alter 3, 2: 138–158. https://doi.org/10.1016/j.alter.2009.01.004",
      "doi": ""
    },
    {
      "text": "Toni Robertson. 2012. Actual bodies are ageing bodies. In Proc. of the 2nd International Body in Design Workshop.",
      "doi": ""
    },
    {
      "text": "Verna Schofield. 2001. Rituals of visiting people with dementia in residential care. Australasian Journal on Ageing 20, 4: 187–191. https://doi.org/10.1111/j.1741-6612.2001.tb00384.x",
      "doi": ""
    },
    {
      "text": "Teepa Snow. 2019. 6 GEMS® You Need to Know For A Positive Approach to Dementia Care. Retrieved January 4, 2021 from https://teepasnow.com/blog/6-gems-you-need-to-know-for-a-positive-approach-to-dementia-care/",
      "doi": ""
    },
    {
      "text": "Australian Bureau of Statistics. 2018. Disability, Ageing and Carers, Australia: Summary of Findings. Retrieved January 11, 2021 from https://www.abs.gov.au/statistics/health/disability/disability-ageing-and-carers-australia-summary-findings/latest-release",
      "doi": ""
    },
    {
      "text": "Ponnusamy Subramaniam and Bob Woods. 2016. Digital life storybooks for people with dementia living in care homes: an evaluation. Clinical interventions in aging 11: 1263–1276. https://doi.org/10.2147/CIA.S111097",
      "doi": ""
    },
    {
      "text": "Cathy Treadaway, Aidan Taylor, and Jac Fennell. 2019. Compassionate design for dementia care. International Journal of Design Creativity and Innovation 7, 3: 144–157. https://doi.org/10.1080/21650349.2018.1501280",
      "doi": ""
    },
    {
      "text": "Charlie Tyack and Paul M Camic. 2017. Touchscreen interventions and the well-being of people with dementia and caregivers: a systematic review. International psychogeriatrics. 29, 1261–1280. https://doi.org/10.1017/S1041610217000667",
      "doi": ""
    },
    {
      "text": "David Unbehaun, Konstantin Aal, Daryoush Daniel Vaziri, Rainer Wieching, Peter Tolmie, and Volker Wulf. 2018. Facilitating Collaboration and Social Experiences with Videogames in Dementia: Results and Implications from a Participatory Design Study. Proc. ACM Hum.-Comput. Interact. 2, CSCW. https://doi.org/10.1145/3274444",
      "doi": "10.1145/3274444"
    },
    {
      "text": "Dominic Upton, Penney Upton, Tim Jones, Karan Jutla, and Dawn Brooker. 2011. Evaluation of the impact of touch screen technology on people with dementia and their carers within care home settings. University of Worcester.",
      "doi": ""
    },
    {
      "text": "Daniel Welsh, Kellie Morrissey, Sarah Foley, Roisin McNaney, Christos Salis, John McCarthy, and John Vines. 2018. Ticket to Talk: Supporting Conversation between Young People and People with Dementia through Digital Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–14. https://doi.org/10.1145/3173574.3173949",
      "doi": "10.1145/3173574.3173949"
    },
    {
      "text": "Bree J Westphal, Hyowon Lee, Ngai-Man Cheung, Chor Guan Teo, and Wei Kiat Leong. 2017. Experience of Designing and Deploying a Tablet Game for People with Dementia. In Proceedings of the 29th Australian Conference on Computer-Human Interaction (OZCHI ’17), 31–40. https://doi.org/10.1145/3152771.3152775",
      "doi": "10.1145/3152771.3152775"
    },
    {
      "text": "M Yasini and G Marchand. 2016. Adoption and Use of a Mobile Health Application in Older Adults for Cognitive Stimulation. Stud Health Technol Inform 221: 13–17.",
      "doi": ""
    }
  ]
}