{
  "doi": "10.1145/3411764.3445321",
  "title": "“I Choose Assistive Devices That Save My Face”: A Study on Perceptions of Accessibility and Assistive Technology Use Conducted in China",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Despite the potential benefits of assistive technologies (ATs) for people with various disabilities, only around 7% of Chinese with disabilities have had an opportunity to use ATs. Even for those who have used ATs, the abandonment rate was high. Although China has the world’s largest population with disabilities, prior research exploring how ATs are used and perceived, and why ATs are abandoned have been conducted primarily in North America and Europe. In this paper, we present an interview study conducted in China with 26 people with various disabilities to understand their practices, challenges, perceptions, and misperceptions of using ATs. From the study, we learned about factors that influence AT adoption practices (e.g., misuse of accessible infrastructure, issues with replicating existing commercial ATs), challenges using ATs in social interactions (e.g., Chinese stigma), and misperceptions about ATs (e.g., ATs should overcome inaccessible social infrastructures). Informed by the findings, we derive a set of design considerations to bridge the existing gaps in AT design (e.g., manual vs. electronic ATs) and to improve ATs’ social acceptability in China.",
  "authors": [
    {
      "name": "Franklin Mingzhe Li",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99659463523/rel-imgonly/citations.jpg",
      "acmid": "99659463523",
      "orcid": "0000-0003-4995-4545"
    },
    {
      "name": "Di Laura Chen",
      "institution": "Department of Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366319",
      "orcid": "missing"
    },
    {
      "name": "Mingming Fan",
      "institution": "School of Information, Rochester Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81482645714/rel-imgonly/official-photo-rit-mingming-fan.jpg",
      "acmid": "81482645714",
      "orcid": "0000-0002-0356-4712"
    },
    {
      "name": "Khai N. Truong",
      "institution": "Computer Science, University of Toronto, Canada",
      "img": "/do/10.1145/contrib-81339532748/rel-imgonly/81339532748.jpg",
      "acmid": "81339532748",
      "orcid": "0000-0003-0774-5964"
    }
  ],
  "references": [
    {
      "text": "State Taxation Administration. 2007. The notice of having tax reduction by employing people with disabilities. http://www.chinatax.gov.cn/n810341/n810765/n812176/n812778/c1194284/content.html?wscckey=0c6f683a502e4ff6_1599689299. (Accessed on 09/09/2020).",
      "doi": ""
    },
    {
      "text": "William Armstrong, Kim D Reisinger, and William K Smith. 2007. Evaluation of CIR-whirlwind wheelchair and service provision in Afghanistan. Disability and rehabilitation 29, 11-12 (2007), 935–948.",
      "doi": ""
    },
    {
      "text": "Salman Asghar, George Edward Torrens, and Robert Harland. 2019. Cultural influences on perception of disability and disabled people: a comparison of opinions from students in the United Kingdom (UK) Pakistan (PAK) about a generic wheelchair using a semantic differential scale. Disability and Rehabilitation: Assistive Technology (2019), 1–13.",
      "doi": ""
    },
    {
      "text": "Salman Asghar, George Edward Torrens, Hassan Iftikhar, Ruth Welsh, and Robert Harland. 2019. The influence of social context on the perception of assistive technology: using a semantic differential scale to compare young adults’ views from the United Kingdom and Pakistan. Disability and Rehabilitation: Assistive Technology (2019), 1–14.",
      "doi": ""
    },
    {
      "text": "Mark S Baldwin, Gillian R Hayes, Oliver L Haimson, Jennifer Mankoff, and Scott E Hudson. 2017. The tangible desktop: a multimodal approach to nonvisual computing. ACM Transactions on Accessible Computing (TACCESS) 10, 3 (2017), 9.",
      "doi": "10.1145/3075222"
    },
    {
      "text": "Cynthia L Bennett, Erin Brady, and Stacy M Branham. 2018. Interdependence as a frame for assistive technology research and design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 161–173.",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Jeffrey P Bigham, Chandrika Jayant, Hanjie Ji, Greg Little, Andrew Miller, Robert C Miller, Robin Miller, Aubrey Tatarowicz, Brandyn White, Samual White, 2010. VizWiz: nearly real-time answers to visual questions. In Proceedings of the 23nd annual ACM symposium on User interface software and technology. 333–342.",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Josieli Aparecida Marques Boiani, Sara Raquel Martins Barili, Fausto Orsi Medola, and Frode Eika Sandnes. 2019. On the non-disabled perceptions of four common mobility devices in Norway: a comparative study based on semantic differentials. Technology and Disability 31, 1-2 (2019), 15–25.",
      "doi": ""
    },
    {
      "text": "Stacy M Branham and Shaun K Kane. 2015. Collaborative accessibility: How blind and sighted companions co-create accessible home spaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 2373–2382.",
      "doi": "10.1145/2702123.2702511"
    },
    {
      "text": "Erin Buehler, Stacy Branham, Abdullah Ali, Jeremy J Chang, Megan Kelly Hofmann, Amy Hurst, and Shaun K Kane. 2015. Sharing is caring: Assistive technology designs on thingiverse. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 525–534.",
      "doi": "10.1145/2702123.2702525"
    },
    {
      "text": "Erin Buehler, Shaun K Kane, and Amy Hurst. 2014. ABC and 3D: opportunities and obstacles to 3D printing in special education environments. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. ACM, 107–114.",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "Anne Campbell and Marie Uren. 2011. ” The Invisibles”... Disability in China in the 21st Century.International Journal of Special Education 26, 1 (2011), 12–24.",
      "doi": ""
    },
    {
      "text": "Stefan Parry Carmien and Gerhard Fischer. 2008. Design, adoption, and assessment of a socio-technical environment supporting independence for persons with cognitive disabilities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 597–606.",
      "doi": "10.1145/1357054.1357151"
    },
    {
      "text": "Patrick Carrington, Kevin Chang, Helena Mentis, and Amy Hurst. 2015. ” But, I don’t take steps” Examining the Inaccessibility of Fitness Trackers for Wheelchair Athletes. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. 193–201.",
      "doi": "10.1145/2700648.2809845"
    },
    {
      "text": "Juliet M Corbin and Anselm Strauss. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative sociology 13, 1 (1990), 3–21.",
      "doi": ""
    },
    {
      "text": "Wangyun Dai. 2017. Invisible Millions: China’s Unnoticed Disabled People. https://www.sixthtone.com/news/1001285/invisible-millions-chinas-unnoticed-disabled-people. (Accessed on 12/11/2019).",
      "doi": ""
    },
    {
      "text": "Katherine Deibel. 2013. A convenient heuristic model for understanding assistive technology adoption. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility. 1–2.",
      "doi": "10.1145/2513383.2513427"
    },
    {
      "text": "Wenqi Du. 2017. Chinese Cultural Perspectives and Interventions on Disabilities. https://lendblog.ahslabs.uic.edu/2017/05/29/chinese-cultural/. (Accessed on 01/14/2020).",
      "doi": ""
    },
    {
      "text": "Arne H Eide and Tone Øderud. 2009. Assistive technology in low-income countries. In Disability & international development. Springer, 149–160.",
      "doi": ""
    },
    {
      "text": "Mingming Fan, Zhen Li, and Franklin Mingzhe Li. 2020. Eyelid Gestures on Mobile Devices for People with Motor Impairments. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 15, 8 pages. https://doi.org/10.1145/3373625.3416987",
      "doi": "10.1145/3373625.3416987"
    },
    {
      "text": "China Disabled Persons’ Federation. 2014. Communique On Major Statistics Of the Second China National Sample Survey on Disability. https://archive.is/20141013223328http://www.cdpf.org.cn/english/contactus/content/2008-04/14/content_84989.htm",
      "doi": ""
    },
    {
      "text": "John Grumbine. 2018. What percentage of the American population lives apartments, and what percent in houses?https://www.quora.com/What-percentage-of-the-American-population-lives-apartments-and-what-percent-in-houses. (Accessed on 12/12/2019).",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Xiang’Anthony’ Chen, Haoran Qi, Samuel White, Suman Ghosh, Chieko Asakawa, and Jeffrey P Bigham. 2016. Vizlens: A robust and interactive screen reader for interfaces in the real world. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 651–664.",
      "doi": "10.1145/2984511.2984518"
    },
    {
      "text": "Chun-ning Guo. 2014. The development of the policy of persons with disabilities in China. China Journal of Social Work 7, 2 (2014), 202–207.",
      "doi": ""
    },
    {
      "text": "Rex Hartson and Pardha S Pyla. 2012. The UX Book: Process and guidelines for ensuring a quality user experience. Elsevier.",
      "doi": "10.5555/2207824"
    },
    {
      "text": "Jeffrey Hays. 2011. Handicapped people in China. http://factsanddetails.com/china/cat13/sub83/item1906.html",
      "doi": ""
    },
    {
      "text": "Amy Hurst and Jasmine Tobias. 2011. Empowering individuals with do-it-yourself assistive technology. In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility. 11–18.",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Kwang-Kuo Hwang. 2006. Moral face and social face: Contingent self-esteem in Confucian society. International Journal of Psychology 41, 4 (2006), 276–281.",
      "doi": ""
    },
    {
      "text": "Disability in China. [n.d.]. ChinaDP website. http://www.chinadp.net.cn/. (Accessed on 11/11/2019).",
      "doi": ""
    },
    {
      "text": "Susanne Iwarsson and Agnetha Ståhl. 2003. Accessibility, usability and universal design-positioning and definition of concepts describing person-environment relationships. Disability and rehabilitation 25, 2 (2003), 57–66.",
      "doi": ""
    },
    {
      "text": "Shaun K Kane and Jeffrey P Bigham. 2014. Tracking@ stemxcomet: teaching programming to blind students via 3D printing, crisis management, and twitter. In Proceedings of the 45th ACM technical symposium on Computer science education. ACM, 247–252.",
      "doi": "10.1145/2538862.2538975"
    },
    {
      "text": "Shaun K Kane, Jeffrey P Bigham, and Jacob O Wobbrock. 2008. Slide rule: making mobile touch screens accessible to blind people using multi-touch interaction techniques. In Proceedings of the 10th international ACM SIGACCESS conference on Computers and accessibility. 73–80.",
      "doi": "10.1145/1414471.1414487"
    },
    {
      "text": "Shaun K Kane, Chandrika Jayant, Jacob O Wobbrock, and Richard E Ladner. 2009. Freedom to roam: a study of mobile device adoption and accessibility for people with visual and motor disabilities. In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility. 115–122.",
      "doi": "10.1145/1639642.1639663"
    },
    {
      "text": "H Stephen Kaye, Patricia Yeager, and Myisha Reed. 2008. Disparities in usage of assistive technology among people with disabilities. Assistive Technology 20, 4 (2008), 194–203.",
      "doi": ""
    },
    {
      "text": "Mohammad Kianpisheh, Franklin Mingzhe Li, and Khai N Truong. 2019. Face Recognition Assistant for People with Visual Impairments. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 1–24.",
      "doi": "10.1145/3351248"
    },
    {
      "text": "Eunjoo Kim, Jie Zhang, and Xiaoke Sun. 2019. Comparison of Special Education in the United States, Korea, and China.International Journal of Special Education 33, 4 (2019), 796–814.",
      "doi": ""
    },
    {
      "text": "Anja Kintsch and Rogerio DePaula. 2002. A framework for the adoption of assistive technology. SWAAAC 2002: Supporting learning through assistive technology (2002), 1–10.",
      "doi": ""
    },
    {
      "text": "Franklin Mingzhe Li, Di Laura Chen, Mingming Fan, and Khai N Truong. 2019. FMT: A Wearable Camera-Based Object Tracking Memory Aid for Older Adults. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 1–25.",
      "doi": "10.1145/3300961"
    },
    {
      "text": "Mingzhe Li, Mingming Fan, and Khai N Truong. 2017. BrailleSketch: A Gesture-based Text Input Method for People with Visual Impairments. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 12–21.",
      "doi": "10.1145/3132525.3132528"
    },
    {
      "text": "Zhen Li, Mingming Fan, Ying Han, and Khai N. Truong. 2020. iWink: Exploring Eyelid Gestures on Mobile Devices. In Proceedings of the 1st International Workshop on Human-Centric Multimedia Analysis (Seattle, WA, USA) (HuMA’20). Association for Computing Machinery, New York, NY, USA, 83–89. https://doi.org/10.1145/3422852.3423479",
      "doi": "10.1145/3422852.3423479"
    },
    {
      "text": "Stephen Lindsay, Katie Brittain, Daniel Jackson, Cassim Ladha, Karim Ladha, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 521–530.",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Harry Low. 2019. Spikes - and other ways disabled people combat unwanted touching. https://www.bbc.com/news/disability-49584591?fbclid=IwAR0iQluQZKWb6wwRNKPahK3KRt141FSQ1gHkaNqvaD3q0XJrUNICtpo4bM8. (Accessed on 11/07/2019).",
      "doi": ""
    },
    {
      "text": "Zhicong Lu, Michelle Annett, Mingming Fan, and Daniel Wigdor. 2019. I feel it is my responsibility to stream: Streaming and Engaging with Intangible Cultural Heritage through Livestreaming. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 229.",
      "doi": "10.1145/3290605.3300459"
    },
    {
      "text": "Zhicong Lu, Haijun Xia, Seongkook Heo, and Daniel Wigdor. 2018. You watch, you give, and you engage: a study of live streaming practices in China. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3174040"
    },
    {
      "text": "Teresa May-Teerink. 1999. A survey of rehabilitative services and people coping with physical disabilities in Uganda, East Africa.International journal of rehabilitation research. Internationale Zeitschrift fur Rehabilitationsforschung. Revue internationale de recherches de readaptation 22, 4 (1999), 311–316.",
      "doi": ""
    },
    {
      "text": "Roisin McNaney, John Vines, Daniel Roggen, Madeline Balaam, Pengfei Zhang, Ivan Poliakov, and Patrick Olivier. 2014. Exploring the Acceptability of Google Glass As an Everyday Assistive Device for People with Parkinson’s. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 2551–2554. https://doi.org/10.1145/2556288.2557092",
      "doi": "10.1145/2556288.2557092"
    },
    {
      "text": "Maia Naftali and Leah Findlater. 2014. Accessibility in context: understanding the truly mobile experience of smartphone users with motor impairments. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. ACM, 209–216.",
      "doi": "10.1145/2661334.2661372"
    },
    {
      "text": "U.S. Department of Education. 2018. Digest of education statistics, 2016. https://nces.ed.gov/programs/digest/d16/ch_2.asp",
      "doi": ""
    },
    {
      "text": "Ministry of Education of the People’s Republic of China. 2018. National educational statistics in 2017. (2018). http://www.moe.gov.cn/jyb_sjzl/sjzl_fztjgb/201807/t20180719_343508.html",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Anandhi Viswanathan, Priyank Chandra, Anisha Nazareth, Vaishnav Kameswaran, Hariharan Subramonyam, Aditya Johri, Mark S Ackerman, and Sile O’Modhrain. 2017. Agency in assistive technology adoption: visual impairment and smartphone use in Bangalore. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5929–5940.",
      "doi": "10.1145/3025453.3025895"
    },
    {
      "text": "Phil Parette and Marcia Scherer. 2004. Assistive technology use and stigma. Education and Training in Developmental Disabilities (2004), 217–226.",
      "doi": ""
    },
    {
      "text": "Betsy Phillips and Hongxin Zhao. 1993. Predictors of assistive technology abandonment. Assistive technology 5, 1 (1993), 36–45.",
      "doi": ""
    },
    {
      "text": "Halley Profita, Reem Albaghli, Leah Findlater, Paul Jaeger, and Shaun K Kane. 2016. The AT effect: how disability affects the perceived social acceptability of head-mounted display use. In proceedings of the 2016 CHI conference on human factors in computing systems. ACM, 4884–4895.",
      "doi": "10.1145/2858036.2858130"
    },
    {
      "text": "Halley P Profita. 2016. Designing wearable computing technology for acceptability and accessibility. ACM SIGACCESS Accessibility and Computing114 (2016), 44–48.",
      "doi": ""
    },
    {
      "text": "Neeraja Ravindran and Barbara J Myers. 2012. Cultural influences on perceptions of health, illness, and disability: A review and focus on autism. Journal of Child and Family Studies 21, 2 (2012), 311–319.",
      "doi": ""
    },
    {
      "text": "Reddit. [n.d.]. Accessibility community in reddit. https://www.reddit.com/r/accessibility/. (Accessed on 11/11/2019).",
      "doi": ""
    },
    {
      "text": "Andreas Reichinger, Helena Garcia Carrizosa, Joanna Wood, Svenja Schröder, Christian Löw, Laura Rosalia Luidolt, Maria Schimkowitsch, Anton Fuhrmann, Stefan Maierhofer, and Werner Purgathofer. 2018. Pictures in your mind: using interactive gesture-controlled reliefs to explore art. ACM Transactions on Accessible Computing (TACCESS) 11, 1 (2018), 2.",
      "doi": ""
    },
    {
      "text": "Marti L Riemer-Reiss and Robbyn R Wacker. 2000. Factors associated with assistive technology discontinuance among individuals with disabilities.Journal of Rehabilitation 66, 3 (2000).",
      "doi": ""
    },
    {
      "text": "Jacquie Ripat and Roberta Woodgate. 2011. The intersection of culture, disability and assistive technology. Disability and Rehabilitation: Assistive Technology 6, 2 (2011), 87–96.",
      "doi": ""
    },
    {
      "text": "André Rodrigues, Kyle Montague, Hugo Nicolau, and Tiago Guerreiro. 2015. Getting smartphones to talkback: Understanding the smartphone adoption process of blind users. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. 23–32.",
      "doi": "10.1145/2700648.2809842"
    },
    {
      "text": "James Ross. 2017. Gap Between Subway Trains and Platforms. https://www.ttc.ca/About_the_TTC/Commission_reports_and_information/Commission_meetings/2017/November_13/Reports/11_Gap_Between_Subway_Trains_and_Platforms.pdf. (Accessed on 01/21/2020).",
      "doi": ""
    },
    {
      "text": "Rose M Rubin and Shelley I White-Means. 2001. Race, disability and assistive devices: Sociodemographics or discrimination. International Journal of Social Economics(2001).",
      "doi": ""
    },
    {
      "text": "Marcia J Scherer. 1996. Outcomes of assistive technology use on quality of life. Disability and rehabilitation 18, 9 (1996), 439–448.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Josh Tenenberg. 2009. A blind person’s interactions with technology. Commun. ACM 52, 8 (2009), 58–66.",
      "doi": "10.1145/1536616.1536636"
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 705–714.",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2016. Self-conscious or self-confident? A diary study conceptualizing the social accessibility of assistive technology. ACM Transactions on Accessible Computing (TACCESS) 8, 2 (2016), 5.",
      "doi": "10.1145/2827857"
    },
    {
      "text": "Kristen Shinohara, Jacob O Wobbrock, and Wanda Pratt. 2018. Incorporating social factors in accessible design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 149–160.",
      "doi": "10.1145/3234695.3236346"
    },
    {
      "text": "Healthwise Staff. 2018. Learning About Instrumental Activities of Daily Living (IADLs). https://myhealth.alberta.ca/health/AfterCareInformation/pages/conditions.aspx?HwId=abk6308. (Accessed on 01/14/2020).",
      "doi": ""
    },
    {
      "text": "M Susanne 2018. Disability in the Workplace in China: Situation Assessment. (2018).",
      "doi": ""
    },
    {
      "text": "Danielle Taylor. 2017. Disability Statistics from the U.S. Census Bureau in 2017/2018. (2017).",
      "doi": ""
    },
    {
      "text": "the office of the second national sample survey of people with disability. 2007. the Second National Sample Survey of People with Disability. Hua Xia Chu Ban She. https://books.google.ca/books?id=R4TsnQAACAAJ",
      "doi": ""
    },
    {
      "text": "Herman Wahidin, Jenny Waycott, and Steven Baker. 2018. The challenges in adopting assistive technologies in the workplace for people with visual impairments. In Proceedings of the 30th Australian Conference on Computer-Human Interaction. 432–442.",
      "doi": "10.1145/3292147.3292175"
    },
    {
      "text": "Yunping Wang 2009. the Documentary of the Service of Assistive Technology in Midwest China. Disability of China 10(2009).",
      "doi": ""
    },
    {
      "text": "Limin Zeng and Gerhard Weber. 2015. A pilot study of collaborative accessibility: How blind people find an entrance. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, 347–356.",
      "doi": "10.1145/2785830.2785875"
    },
    {
      "text": "Chao Zhang. 2017. ‘Nothing about us without us’: the emerging disability movement and advocacy in China. Disability & Society 32, 7 (2017), 1096–1101. https://doi.org/10.1080/09687599.2017.1321229",
      "doi": ""
    }
  ]
}