{
  "doi": "10.1145/3411764.3445438",
  "title": "Human-Nature Relations in Urban Gardens: Explorations with Camera Traps",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "As cities grow, their people become increasingly distanced from nature except within private and public green spaces. Sensing technologies provide a means to harness curiosity about the animals living in these spaces, and possibly also connect interest to care. Yet little is known as to how people may use these technologies, or the implications for human-nature relations. To learn more, we gave commercial camera traps to ten adult participants to understand how they explored their gardens, what they wanted to learn, and what they did with this knowledge. We discovered trade-offs between control and care; the usefulness of different media and mystery; the temporalities of engaging in natural sensing practice; and a prevalence of sharing media within households. We discuss design for convivial cohabitation with the creatures in our garden. This research contributes to better human-nature relations through citizen sensing, as well as HCI for urban biodiversity conservation.",
  "tags": [
    "Gardening",
    "Care",
    "More-than-Human",
    "Cameras",
    "Human Computer Interaction",
    "Citizen Sensing",
    "Urban Biodiversity"
  ],
  "authors": [
    {
      "name": "Kellie Vella",
      "institution": "Queensland University of Technology (QUT), Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503685970",
      "orcid": "0000-0002-1125-5530"
    },
    {
      "name": "Bernd Ploderer",
      "institution": "School of Computer Science Queensland University of Technology (QUT), Australia",
      "img": "/do/10.1145/contrib-81311485528/rel-imgonly/bp2017-167a8820portrait.jpg",
      "acmid": "81311485528",
      "orcid": "missing"
    },
    {
      "name": "Margot Brereton",
      "institution": "Science and Engineering QUT, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017862",
      "orcid": "0000-0002-0982-3404"
    }
  ],
  "references": [
    {
      "text": "Ashraful Alam, Andrew McGregor, Donna Houston. 2018. Photo-response: Approaching participatory photography as a more-than-human research method. Area. 50, 2: 256-265. http://dx.doi.org/10.1111/area.12368",
      "doi": ""
    },
    {
      "text": "Philip Armstrong. 2011. \"The Gaze of Animals\". In Theorizing Animals: Re-thinking Humanimal Relations, N Taylor and T Signal (eds.). BRILL, 175- 202.",
      "doi": ""
    },
    {
      "text": "M. F. Aronson, F. A. La Sorte, C. H. Nilon, M. Katti, M. A. Goddard, C. A. Lepczyk, P. S. Warren, N. S. Williams, S. Cilliers, B. Clarkson, C. Dobbs, R. Dolan, M. Hedblom, S. Klotz, J. L. Kooijmans, I. Kühn, I. Macgregor-Fors, M. McDonnell, U. Mörtberg, P. Pysek, S. Siebert, J. Sushinsky, P. WernerM. Winter. 2014. A global analysis of the impacts of urbanization on bird and plant diversity reveals key anthropogenic drivers. Proc. R. Soc. B. 281, 1780: 20133330. http://dx.doi.org/10.1098/rspb.2013.3330",
      "doi": ""
    },
    {
      "text": "Myla F. J. Aronson, Christopher A. Lepczyk, Karl L. Evans, Mark A. Goddard, Susannah B. Lerman, J. Scott MacIvor, Charles H. Nilon, Timothy Vargo. 2017. Biodiversity in the city: key challenges for urban green space management. Front Ecol Environ. 15, 4: 189-196. http://dx.doi.org/10.1002/fee.1480",
      "doi": ""
    },
    {
      "text": "Fredrik Aspling, Oskar Juhlin. 2017. Theorizing animal–computer interaction as machinations. Int. J. Hum. Comput. Stud. 98, C: 135-149. http://dx.doi.org/10.1016/j.ijhcs.2016.05.005",
      "doi": "10.1016/j.ijhcs.2016.05.005"
    },
    {
      "text": "J. Amy Belaire, Christopher J. Whelan, Emily S. Minor. 2014. Having our yards and sharing them too: the collective effects of yards on native bird species in an urban landscape. Ecol. Appl. 24, 8: 2132-2143. http://dx.doi.org/10.1890/13-2259.1",
      "doi": ""
    },
    {
      "text": "Graham Burnett. 2008. Permaculture: A beginner's guide. Spiralseed. Westcliff on Sea, UK",
      "doi": ""
    },
    {
      "text": "Rachel Clarke, Sara Heitlinger, Ann Light, Laura Forlano, Marcus Foth, Carl DiSalvo. 2019. More-than-human participation: design for sustainable smart city futures. Interactions. 26, 3: 60-63. http://dx.doi.org/10.1145/3319075",
      "doi": "10.1145/3319075"
    },
    {
      "text": "Paul Coulton, Joseph Galen Lindley. 2019. More-Than Human Centred Design: Considering Other Things. The Design Journal. 22, 4: 463-481. http://dx.doi.org/10.1080/14606925.2019.1614320",
      "doi": ""
    },
    {
      "text": "Tshering Dema, Margot Brereton, Jessica L. Cappadonna, Paul Roe, Anthony Truskinger, Dan Zhang. 2017. Collaborative exploration and sensemaking of big environmental sound data. Comp Support Comp W. 26, 4-6: 693-731. http://dx.doi.org/10.1007/s10606-017-9286-9",
      "doi": "10.1007/s10606-017-9286-9"
    },
    {
      "text": "Tshering Dema, Margot Brereton, Michael Esteban, Alessandro Soro, Sherub Sherub, Paul Roe. 2020. \"Designing in the Network of Relations for Species Conservation: The Playful Tingtibi Community Birdhouse\". In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA. 1–14. http://dx.doi.org/10.1145/3313831.3376713",
      "doi": "10.1145/3313831.3376713"
    },
    {
      "text": "Jacques Derrida, David Wills. 2002. The Animal That Therefore I Am (More to Follow). Crit. Inq. 28, 2: 369-418.",
      "doi": ""
    },
    {
      "text": "Finis Dunaway. 2000. Hunting with the Camera: Nature Photography, Manliness, and Modern Memory, 1890-1930. J. Am. Stud. 34, 2: 207-230.",
      "doi": ""
    },
    {
      "text": "Laura Forlano. 2016. Decentering the Human in the Design of Collaborative Cities. Des. Issues. 32, 42-54. http://dx.doi.org/10.1162/DESI_a_00398",
      "doi": ""
    },
    {
      "text": "A. Foster, I.M. Dunham, C. Kaylor. 2017. Citizen Science for Urban Forest Management? Predicting the Data Density and Richness of Urban Forest Volunteered Geographic Information. Urban Sci. 1, 30. http://dx.doi.org/10.3390/urbansci1030030",
      "doi": ""
    },
    {
      "text": "Adrian Franklin. 2017. The more-than-human city. Am. Sociol. Rev. 65, 2: 202-217. http://dx.doi.org/10.1111/1467-954X.12396",
      "doi": ""
    },
    {
      "text": "Jennifer Gabrys. 2014. Programming Environments: Environmentality and Citizen Sensing in the Smart City. 32, 1: 30-48. http://dx.doi.org/10.1068/d16812",
      "doi": ""
    },
    {
      "text": "Nadinè J. Galle, Sophie A. Nitoslawski, Francesco Pilla. 2019. The Internet of Nature: How taking nature online can shape urban ecosystems. Anthropocene Rev. 6, 3: 279-287. http://dx.doi.org/10.1177/2053019619877103",
      "doi": ""
    },
    {
      "text": "William Gaver, Andy Boucher, Michail Vanis, Andy Sheen, Dean Brown, Liliana Ovalle, Naho Matsuda, Amina Abbas-Nazari, Robert Phillips. 2019. \"My Naturewatch Camera: Disseminating Practice Research with a Cheap and Easy DIY Design\". In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, Glasgow, Scotland Uk. Paper 302. http://dx.doi.org/10.1145/3290605.3300532",
      "doi": "10.1145/3290605.3300532"
    },
    {
      "text": "Mark Goddard, Andrew Dougill, Tim Benton. 2009. Scaling up from gardens: biodiversity conservation in urban environments. Trends Ecol. Evol. 25, 90-8. http://dx.doi.org/10.1016/j.tree.2009.07.016",
      "doi": ""
    },
    {
      "text": "Edgar Gómez Cruz, Eric T. Meyer. 2012. Creation and Control in the Photographic Process: iPhones and the emerging fifth moment of photography. Photographies. 5, 2: 203-221. http://dx.doi.org/10.1080/17540763.2012.702123",
      "doi": ""
    },
    {
      "text": "Daniel Gooch, Matthew Barker, Lorraine Hudson, Ryan Kelly, Gerd Kortuem, Janet Van Der Linden, Marian Petre, Rebecca Brown, Anna Klis-Davies, Hannah Forbes, Jessica Mackinnon, Robbie MacphersonClare Walton. 2018. Amplifying Quiet Voices: Challenges and Opportunities for Participatory Design at an Urban Scale. ACM Trans. Comput.-Hum. Interact. 25, Article 2. http://dx.doi.org/10.1145/3139398",
      "doi": "10.1145/3139398"
    },
    {
      "text": "Elizabeth Goodman. 2009. \"Three environmental discourses in human-computer interaction\". In Proceedings of the (CHI EA '09) Extended Abstracts on Human Factors in Computing Systems, 2535-2544. http://dx.doi.org/10.1145/1520340.1520358",
      "doi": "10.1145/1520340.1520358"
    },
    {
      "text": "Kelly Greenop. 2008. \"Uncanny Brisbane: new ways of looking at urban indigenous place\". In Proceedings of the Society of Architectural Historians, Australia and New Zealand (SAHANZ) Annual Conference, Geelong, Australia.",
      "doi": ""
    },
    {
      "text": "Bjørn Grinde, Grete Grindal Patil. 2009. Biophilia: does visual contact with nature impact on health and well-being? Int J Environ Res Public Health. 6, 9: 2332-2343. http://dx.doi.org/10.3390/ijerph6092332",
      "doi": ""
    },
    {
      "text": "Donna J. Haraway. 2007. When Species Meet. University of Minnesota Press. Minneapolis",
      "doi": ""
    },
    {
      "text": "Donna J. Haraway. 2016. Staying with the Trouble: Making Kin in the Chthulucene. Duke University Press. http://dx.doi.org/10.1215/9780822373780",
      "doi": ""
    },
    {
      "text": "Judith Heerwagen. 2009. \"Biophilia, health, and well-being\". In Restorative commons: creating health and well-being through urban landscapes, L Campbell and A Wiesen (eds.). U.S. Forest Service, Northern Research Station, 38-57.",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, Rob Comber. 2018. Connected seeds and sensors: co-designing internet of things for sustainable smart cities with urban food-growing communities. http://dx.doi.org/10.1145/3210604.3210620",
      "doi": ""
    },
    {
      "text": "Timothy Hodgetts, Jamie Lorimer. 2014. Methodologies for animals’ geographies: cultures, communication and genomics. Cult. Geogr. 22, 2: 285-295. http://dx.doi.org/10.1177/1474474014525114",
      "doi": ""
    },
    {
      "text": "Donna Houston, Jean Hillier, Diana MacCallum, Wendy Steele, Jason Byrne. 2017. Make kin, not cities! Multispecies entanglements and ‘becoming-world’ in planning theory. Plan. Theory. 17, 2: 190-212. http://dx.doi.org/10.1177/1473095216688042",
      "doi": ""
    },
    {
      "text": "Christopher D. Ives, Pia E. Lentini, Caragh G. Threlfall, Karen Ikin, Danielle F. Shanahan, Georgia E. Garrard, Sarah A. Bekessy, Richard A. Fuller, Laura Mumaw, Laura Rayner, Ross Rowe, Leonie E. ValentineDave Kendal. 2016. Cities are hotspots for threatened species. Glob. Ecol. Biogeogr. 25, 1: 117-126. http://dx.doi.org/10.1111/geb.12404",
      "doi": ""
    },
    {
      "text": "D. S. Kirk, A. J. Sellen, C. Rother, K. R. Wood, Understanding photowork, 2006. p. 761-770.",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "Christopher Lepczyk, Frank La Sorte, Myla Aronson, Mark Goddard, Ian MacGregor-Fors, Charles Nilon, Paige Warren. 2017. \"Global Patterns and Drivers of Urban Bird Diversity\". In Ecology and Conservation of Birds in Urban Environments, E Murgui and M Hedblom (eds.). Springer, Cham, 13-33. http://dx.doi.org/10.1007/978-3-319-43314-1_2",
      "doi": ""
    },
    {
      "text": "Jamie Lorimer. 2010. Moving image methodologies for more-than-human geographies. Cult. Geogr. 17, 2: 237-258.",
      "doi": ""
    },
    {
      "text": "Cecily Maller, Leila Farahani. 2018. \"Snakes in the city: understanding urban residents' responses to greening interventions for biodiversity\". In Proceedings of the 8th State of Australian Cities National Conference, Adelaide, Australia. http://dx.doi.org/10.4225/50/5b2dc36e758f5",
      "doi": ""
    },
    {
      "text": "Clara Mancini, Jussi Lehtonen. 2018. \"The Emerging Nature of Participation in Multispecies Interaction Design\". In Proceedings of the Proceedings of the 2018 Designing Interactive Systems Conference, Hong Kong, China. 907–918. http://dx.doi.org/10.1145/3196709.3196785",
      "doi": "10.1145/3196709.3196785"
    },
    {
      "text": "Paul D. Meek, Guy-Anthony Ballard, Peter J. S. Fleming, Michael Schaefer, Warwick Williams, Greg Falzon. 2014. Camera Traps Can Be Heard and Seen by Animals. PLOS ONE. 9, 10: e110832. http://dx.doi.org/10.1371/journal.pone.0110832",
      "doi": ""
    },
    {
      "text": "Charles Nilon, Myla Aronson, S. Cilliers, Cynnamon Dobbs, Lauren Frazee, Mark Goddard, Karen O'Neill, Debra Roberts, Emilie Stander, Peter Werner, Marten WinterKen Yocom. 2017. Planning for the Future of Urban Biodiversity: A Global Review of City-Scale Initiatives. BioScience. 67, 332-342. http://dx.doi.org/10.1093/biosci/bix012",
      "doi": ""
    },
    {
      "text": "Allan F. O'Connell, James D. Nichols, K. Ullas Karanth. 2011. Camera traps in animal ecology: Methods and analyses. Springer Japan. http://dx.doi.org/10.1007/978-4-431-99495-4",
      "doi": ""
    },
    {
      "text": "William E. Odum. 1982. Environmental Degradation and the Tyranny of Small Decisions. BioScience. 32, 9: 728-729. http://dx.doi.org/10.2307/1308718",
      "doi": ""
    },
    {
      "text": "Jessica L. Oliver, Margot Brereton, Selen Turkay, David M. Watson, Paul Roe, Exploration of aural & visual media about birds informs lessons for citizen science design, in Proceedings of the 2020 ACM Designing Interactive Systems Conference2020, Association for Computing Machinery: Eindhoven, Netherlands. p. 1687–1700.",
      "doi": ""
    },
    {
      "text": "Louise Gwenneth Phillips. 2018. T Bunda. Research through, with and as storying. (First edition. ed.) Routledge, Taylor & Francis Group. London ;",
      "doi": ""
    },
    {
      "text": "R. Phillips, R. Anderson, A. Abbas-Nazari, B. Gaver, A. Boucher. 2020. \"‘Urban and suburban nature interactions’, Impacts and serendipitous narratives of the My Naturewatch project\". In Proceedings of the Design Society: DESIGN Conference, 2109-2118. http://dx.doi.org/10.1017/dsd.2020.6",
      "doi": ""
    },
    {
      "text": "Bernd Ploderer, Tuck Leong. 2012. \"A process of engagement: engaging with the process\". In Proceedings of the Designing Interactive Systems Conference 2012, Newcastle, UK. http://dx.doi.org/10.1145/2317956.2317992",
      "doi": "10.1145/2317956.2317992"
    },
    {
      "text": "Kerith Power, Margaret Somerville. 2015. \"The fence as technology of (post-)colonial childhood in contemporary australia\". In Unsettling the Colonial Places and Spaces of Early Childhood Education, V Pacini-Ketchabaw and A Taylor (eds.). 63-77.",
      "doi": ""
    },
    {
      "text": "Jennifer Preece. 2017. How two billion smartphone users can save species. Interactions. 24, 2: 26-33. http://dx.doi.org/10.1145/3043702",
      "doi": "10.1145/3043702"
    },
    {
      "text": "Maria Puig de la Bellacasa. 2015. Making time for soil: Technoscientific futurity and the pace of care. Soc. Stud. Sci. 45, 5: 691-716. http://dx.doi.org/10.1177/0306312715599851",
      "doi": ""
    },
    {
      "text": "María Puig de la Bellacasa. 2017. Matters of Care: Speculative Ethics in More than Human Worlds. University of Minnesota Press. Minneapolis",
      "doi": ""
    },
    {
      "text": "Astrid Schrader. 2015. Abyssal intimacies and temporalities of care: How (not) to care about deformed leaf bugs in the aftermath of Chernobyl. Soc. Stud. Sci. 45, 5: 665-690. http://dx.doi.org/10.1177/0306312715603249",
      "doi": ""
    },
    {
      "text": "Nancy Smith, Shaowen Bardzell, Jeffrey Bardzell. 2017. \"Designing for Cohabitation: Naturecultures, Hybrids, and Decentering the Human in Design\". In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, Denver, CO, USA. 1714-1725. http://dx.doi.org/10.1145/3025453.3025948",
      "doi": "10.1145/3025453.3025948"
    },
    {
      "text": "Alessandro Soro, Margot Brereton, Tshering Dema, Jessica L. Oliver, Min Zhen Chai, Aloha May Hufana Ambe. 2018. \"The ambient birdhouse: An IoT device to discover birds and engage with nature\". In Proceedings of the CHI '18: Conference on Human Factors in Computing Systems, Montreal, Canada. http://dx.doi.org/10.1145/3173574.3173971",
      "doi": "10.1145/3173574.3173971"
    },
    {
      "text": "Brian L. Sullivan, Christopher L. Wood, Marshall J. Iliff, Rick E. Bonney, Daniel Fink, Steve Kelling. 2009. eBird: A citizen-based bird observation network in the biological sciences. Biol. Conserv. 142, 10: 2282-2292. http://dx.doi.org/10.1016/j.biocon.2009.05.006",
      "doi": ""
    },
    {
      "text": "Don E. Swann, Nic Perkins. 2014. \"Camera trapping fo animal monitoring and management: A review of applications\". In Camera Trapping: Wildlife Management and Research P Meek, P Fleming, and G Ballard (eds.). CSIRO Publishing, Collingwood, Victoria, 27-140.",
      "doi": ""
    },
    {
      "text": "Alexandra Swanson, Margaret Kosmala, Chris Lintott, Robert Simpson, Arfon Smith, Craig Packer. 2015. Snapshot Serengeti, high-frequency annotated camera trap images of 40 mammalian species in an African savanna. Sci. Data. 2, 1: 150026. http://dx.doi.org/10.1038/sdata.2015.26",
      "doi": ""
    },
    {
      "text": "Hollis Taylor. 2017. \"Marginalized voices: Zoömusicology through a participatory lens\". In Participatory Research in More-than-Human Worlds, M Bastian, (eds.). Routledge, Taylor and Francis Group, London; New York. http://dx.doi.org/10.4324/9781315661698",
      "doi": ""
    },
    {
      "text": "Mardie Townsend. 2006. Feel blue? Touch green! Participation in forest/woodland management as a treatment for depression. Urban For. Urban Gree. 5, 3: 111-120. http://dx.doi.org/10.1016/j.ufug.2006.02.001",
      "doi": ""
    },
    {
      "text": "T. van Dooren, D.B. Rose. 2012. Storied-places in a multispecies city. Humanimalia. 3, 2: 1-27.",
      "doi": ""
    },
    {
      "text": "Gavan Peter Longley Watson. 2011. Field birding and digital objects: immaterial technologies and their implications for one practice of coming to know the more-than-human. Environ. Educ. Res. 17, 6: 789-799. http://dx.doi.org/10.1080/13504622.2011.618623",
      "doi": ""
    },
    {
      "text": "Karl Weick, Kathleen Sutcliffe, David Obstfeld. 2005. Organizing and the Process of Sensemaking. Organ. Sci. 16, 4: 409-421. http://dx.doi.org/10.1287/orsc.1050.0133",
      "doi": "10.1287/orsc.1050.0133"
    }
  ]
}