{
  "doi": "10.1145/3411764.3445214",
  "title": "NFCSense: Data-Defined Rich-ID Motion Sensing for Fluent Tangible Interaction Using a Commodity NFC Reader",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "This paper presents NFCSense, a data-defined rich-ID motion sensing technique for fluent tangible interaction design by using commodity near-field communication (NFC) tags and a single NFC tag reader. An NFC reader can reliably recognize the presence of an NFC tag at a high read rate (∼ 300 reads/s) with low latency, but such high-speed reading has rarely been exploited because the reader may not effectively resolve collisions of multiple tags. Therefore, its human–computer interface applications have been typically limited to a discrete, hands-on interaction style using one tag at a time. In this work, we realized fluent, hands-off, and multi-tag tangible interactions by leveraging gravity and anti-collision physical constraints, which support effortless user input and maximize throughput. Furthermore, our system provides hot-swappable interactivity that enables smooth transitions throughout extended use. Based on the design parameters explored through a series of studies, we present a design space with proof-of-concept implementations in various applications.",
  "tags": [
    "Physical Constraints",
    "Fluent",
    "Tangible Interaction",
    "Tags",
    "NFC",
    "Rich-ID",
    "Motion Sensing"
  ],
  "authors": [
    {
      "name": "Rong-Hao Liang",
      "institution": "Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81321494894",
      "orcid": "0000-0003-3239-8749"
    },
    {
      "name": "Zengrong Guo",
      "institution": "Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659676724",
      "orcid": "0000-0001-7842-5779"
    }
  ],
  "references": [
    {
      "text": "Daniel Avrahami and Scott E. Hudson. 2002. Forming Interactivity: A Tool for Rapid Prototyping of Physical Interactive Products. In Proc. ACM DIS ’02. 141–146.",
      "doi": "10.1145/778712.778735"
    },
    {
      "text": "Daniel Avrahami, Jacob O. Wobbrock, and Shahram Izadi. 2011. Portico: Tangible Interaction on and around a Tablet. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 347–356. https://doi.org/10.1145/2047196.2047241",
      "doi": "10.1145/2047196.2047241"
    },
    {
      "text": "Maribeth Back, Jonathan Cohen, Rich Gold, Steve Harrison, and Scott Minneman. 2001. Listen Reader: An Electronically Augmented Paper-based Book. In Proc. ACM CHI ’01. 23–29.",
      "doi": "10.1145/365024.365031"
    },
    {
      "text": "Victoria Bellotti, Maribeth Back, W. Keith Edwards, Rebecca E. Grinter, Austin Henderson, and Cristina Lopes. 2002. Making Sense of Sensing Systems: Five Questions for Designers and Researchers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Minneapolis, Minnesota, USA) (CHI ’02). Association for Computing Machinery, New York, NY, USA, 415–422. https://doi.org/10.1145/503376.503450",
      "doi": "10.1145/503376.503450"
    },
    {
      "text": "Eugen Berlin, Jun Liu, Kristof van Laerhoven, and Bernt Schiele. 2010. Coming to Grips with the Objects We Grasp: Detecting Interactions with Efficient Wrist-worn Sensors. In Proc. TEI ’10. 57–64.",
      "doi": "10.1145/1709886.1709898"
    },
    {
      "text": "Andrea Bianchi and Ian Oakley. 2013. Designing Tangible Magnetic Appcessories. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (Barcelona, Spain) (TEI ’13). Association for Computing Machinery, New York, NY, USA, 255–258. https://doi.org/10.1145/2460625.2460667",
      "doi": "10.1145/2460625.2460667"
    },
    {
      "text": "Keywon Chung, Michael Shilman, Chris Merrill, and Hiroshi Ishii. 2010. OnObject: Gestural Play with Tagged Everyday Objects. In Adjunct Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology (New York, New York, USA) (UIST ’10). Association for Computing Machinery, New York, NY, USA, 379–380. https://doi.org/10.1145/1866218.1866229",
      "doi": "10.1145/1866218.1866229"
    },
    {
      "text": "Crampton Smith, G.1995. The hand that rocks the cradle.ID magazine, 60–65..",
      "doi": ""
    },
    {
      "text": "Assaf Feldman, Emmanuel Munguia Tapia, Sajid Sadi, Pattie Maes, and Chris Schmandt. 2005. ReachMedia: On-the-move Interaction with Everyday Objects. In Proc. IEEE ISWC ’05. 52–59.",
      "doi": "10.1109/ISWC.2005.44"
    },
    {
      "text": "Klaus Finkenzeller. 2003. RFID Handbook: Fundamentals and Applications in Contactless Smart Cards and Identification(2nd ed.). Wiley Publishing.",
      "doi": ""
    },
    {
      "text": "KennethP. Fishkin, Bing Jiang, Matthai Philipose, and Sumit Roy. 2004. I Sense a Disturbance in the Force: Unobtrusive Detection of Interactions with RFID-tagged Objects. In UbiComp 2004: Ubiquitous Computing, Nigel Davies, ElizabethD. Mynatt, and Itiro Siio(Eds.). Lecture Notes in Computer Science, Vol. 3205. Springer Berlin Heidelberg, 268–282. http://dx.doi.org/10.1007/978-3-540-30119-6_16",
      "doi": ""
    },
    {
      "text": "K. P. Fishkin, M. Philipose, and A. Rea. 2005. Hands-on RFID: wireless wearables for detecting use of objects. In Proc. IEEE ISWC ’05. 38–41.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. InFORM: Dynamic Physical Affordances and Constraints through Shape and Object Actuation. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 417–426. https://doi.org/10.1145/2501988.2502032",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "James J Gibson. 1977. The theory of affordances. (1977).",
      "doi": ""
    },
    {
      "text": "Jason T. Griffin, Steven Henry Fyke, Christopher Lyle Bender, Santiago Carbonell Duque, David Ryan Walker, and Jerome Pasquero. 2014. Near-field communication (NFC) system providing mobile wireless communications device operations based upon timing and sequence of NFC sensor communication and related methods. U.S. Patent 8,670,709.",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Sebastian Herber, Raphael Wimmer, Frank Englert, Sebastian Beck, Julian von Wilmsdorff, Reiner Wichert, and Arjan Kuijper. 2014. Capacitive Near-Field Communication for Ubiquitous Interaction and Perception. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Seattle, Washington) (UbiComp ’14). Association for Computing Machinery, New York, NY, USA, 231–242. https://doi.org/10.1145/2632048.2632053",
      "doi": "10.1145/2632048.2632053"
    },
    {
      "text": "Changyo Han, Katsufumi Matsui, and Takeshi Naemura. 2020. ForceStamps: Fiducial Markers for Pressure-Sensitive Touch Surfaces to Support Rapid Prototyping of Physical Control Interfaces. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (Sydney NSW, Australia) (TEI ’20). Association for Computing Machinery, New York, NY, USA, 273–285. https://doi.org/10.1145/3374920.3374924",
      "doi": "10.1145/3374920.3374924"
    },
    {
      "text": "Chris Harrison, Robert Xiao, and Scott Hudson. 2012. Acoustic Barcodes: Passive, Durable and Inexpensive Notched Identification Tags. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology(Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 563–568. https://doi.org/10.1145/2380116.2380187",
      "doi": "10.1145/2380116.2380187"
    },
    {
      "text": "Meng-Ju Hsieh, Jr-Ling Guo, Chin-Yuan Lu, Han-Wei Hsieh, Rong-Hao Liang, and Bing-Yu Chen. 2019. RFTouchPads: Batteryless and Wireless Modular Touch Sensor Pads Based on RFID. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 999–1011. https://doi.org/10.1145/3332165.3347910",
      "doi": "10.1145/3332165.3347910"
    },
    {
      "text": "Meng-Ju Hsieh, Rong-Hao Liang, Da-Yuan Huang, Jheng-You Ke, and Bing-Yu Chen. 2018. RFIBricks: Interactive Building Blocks Based on RFID. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 189, 10 pages. https://doi.org/10.1145/3173574.3173763",
      "doi": "10.1145/3173574.3173763"
    },
    {
      "text": "Scott E Hudson and Jennifer Mankoff. 2014. Concepts, values, and methods for technical human–computer interaction research. In Ways of Knowing in HCI. Springer, 69–93.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’97). ACM, New York, NY, USA, 234–241. https://doi.org/10.1145/258549.258715",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Haojian Jin, Jingxian Wang, Zhijian Yang, Swarun Kumar, and Jason Hong. 2018. WiSh: Towards a Wireless Shape-aware World Using Passive RFIDs. In Proceedings of the 16th Annual International Conference on Mobile Systems, Applications, and Services(Munich, Germany) (MobiSys ’18). ACM, New York, NY, USA, 428–441. https://doi.org/10.1145/3210240.3210328",
      "doi": "10.1145/3210240.3210328"
    },
    {
      "text": "Keiko Katsuragawa, Ju Wang, Ziyang Shan, Ningshan Ouyang, Omid Abari, and Daniel Vogel. 2019. Tip-Tap: Battery-Free Discrete 2D Fingertip Input. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1045–1057. https://doi.org/10.1145/3332165.3347907",
      "doi": "10.1145/3332165.3347907"
    },
    {
      "text": "Han-Chih Kuo, Rong-Hao Liang, Long-Fei Lin, and Bing-Yu Chen. 2016. GaussMarbles: Spherical Magnetic Tangibles for Interacting with Portable Physical Constraints. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4228–4232. https://doi.org/10.1145/2858036.2858559",
      "doi": "10.1145/2858036.2858559"
    },
    {
      "text": "Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2161–2170. https://doi.org/10.1145/2702123.2702414",
      "doi": "10.1145/2782782.2792490"
    },
    {
      "text": "Hanchuan Li, Eric Brockmeyer, Elizabeth J. Carter, Josh Fromm, Scott E. Hudson, Shwetak N. Patel, and Alanson Sample. 2016. PaperID: A Technique for Drawing Functional Battery-Free Wireless Interfaces on Paper. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 5885–5896. https://doi.org/10.1145/2858036.2858249",
      "doi": "10.1145/2858036.2858249"
    },
    {
      "text": "Hanchuan Li, Can Ye, and Alanson P. Sample. 2015. IDSense: A Human Object Interaction Detection System Based on Passive UHF RFID. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 2555–2564. https://doi.org/10.1145/2702123.2702178",
      "doi": "10.1145/2702123.2702178"
    },
    {
      "text": "Rong-Hao Liang, Kai-Yin Cheng, Liwei Chan, Chuan-Xhyuan Peng, Mike Y. Chen, Rung-Huei Liang, De-Nian Yang, and Bing-Yu Chen. 2013. GaussBits: Magnetic Tangible Bits for Portable and Occlusion-Free near-Surface Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1391–1400. https://doi.org/10.1145/2470654.2466185",
      "doi": "10.1145/2470654.2466185"
    },
    {
      "text": "Rong-Hao Liang, Meng-Ju Hsieh, Jheng-You Ke, Jr-Ling Guo, and Bing-Yu Chen. 2018. RFIMatch: Distributed Batteryless Near-Field Identification Using RFID-Tagged Magnet-Biased Reed Switches. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). ACM, New York, NY, USA, 473–483. https://doi.org/10.1145/3242587.3242620",
      "doi": "10.1145/3242587.3242620"
    },
    {
      "text": "Rong-Hao Liang, Han-Chih Kuo, and Bing-Yu Chen. 2016. GaussRFID: Reinventing Physical Toys Using Magnetic RFID Development Kits. In Proc. ACM CHI ’16(Santa Clara, California, USA) (CHI ’16). 4233–4237.",
      "doi": ""
    },
    {
      "text": "Rong-Hao Liang, Shun-Yao Yang, and Bing-Yu Chen. 2019. InDexMo: Exploring Finger-Worn RFID Motion Tracking for Activity Recognition on Tagged Objects. In Proceedings of the 23rd International Symposium on Wearable Computers (London, United Kingdom) (ISWC ’19). Association for Computing Machinery, New York, NY, USA, 129–134. https://doi.org/10.1145/3341163.3347724",
      "doi": "10.1145/3341163.3347724"
    },
    {
      "text": "Rong-Hao Liang, Bin Yu, Mengru Xue, Jun Hu, and Loe M. G. Feijs. 2018. BioFidget: Biofeedback for Respiration Training Using an Augmented Fidget Spinner. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174187",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Alex S. Taylor, Nicolas Villar, and Saul Greenberg. 2010. Rethinking RFID: Awareness and Control for Interaction with RFID Systems. In Proc. ACM CHI ’10. 2307–2316.",
      "doi": "10.1145/1753326.1753674"
    },
    {
      "text": "Einar Sneve Martinussen and Timo Arnall. 2009. Designing with RFID. In Proc. ACM TEI ’09. 343–350.",
      "doi": "10.1145/1517664.1517734"
    },
    {
      "text": "Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014. FaBrickation: Fast 3D Printing of Functional Objects by Integrating Construction Kit Building Blocks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3827–3834. https://doi.org/10.1145/2556288.2557005",
      "doi": "10.1145/2556288.2557005"
    },
    {
      "text": "Jun Rekimoto, Brygg Ullmer, and Haruo Oba. 2001. DataTiles: A Modular Platform for Mixed Physical and Graphical Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seattle, Washington, USA) (CHI ’01). ACM, New York, NY, USA, 269–276. https://doi.org/10.1145/365024.365115",
      "doi": "10.1145/365024.365115"
    },
    {
      "text": "A.P. Sample, D.J. Yeager, and J.R. Smith. 2009. A capacitive touch interface for passive RFID tags. In 2009 IEEE International Conference on RFID. 103–109.",
      "doi": ""
    },
    {
      "text": "Valkyrie Savage, Colin Chang, and Björn Hartmann. 2013. Sauron: Embedded Single-Camera Sensing of Printed Physical User Interfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 447–456. https://doi.org/10.1145/2501988.2501992",
      "doi": "10.1145/2501988.2501992"
    },
    {
      "text": "Valkyrie Savage, Andrew Head, Björn Hartmann, Dan B. Goldman, Gautham Mysore, and Wilmot Li. 2015. Lamello: Passive Acoustic Sensing for Tangible Input Components. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1277–1280. https://doi.org/10.1145/2702123.2702207",
      "doi": "10.1145/2702123.2702207"
    },
    {
      "text": "Claude Elwood Shannon. 1949. Communication in the presence of noise. Proceedings of the IRE 37, 1 (1949), 10–21.",
      "doi": ""
    },
    {
      "text": "Timothy M. Simon, Bruce H. Thomas, Ross T. Smith, and Mark Smith. 2014. Adding Input Controls and Sensors to RFID Tags to Support Dynamic Tangible User Interfaces. In Proc. ACM TEI ’14. 165–172.",
      "doi": ""
    },
    {
      "text": "Andrew Spielberg, Alanson Sample, Scott E. Hudson, Jennifer Mankoff, and James McCann. 2016. RapID: A Framework for Fabricating Low-Latency Interactive Objects with RFID Tags. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5897–5908. https://doi.org/10.1145/2858036.2858243",
      "doi": "10.1145/2858036.2858243"
    },
    {
      "text": "Brygg Ullmer, Hiroshi Ishii, and Robert JK Jacob. 2005. Token+ constraint systems for tangible interaction with digital information. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 1(2005), 81–118.",
      "doi": "10.1145/1057237.1057242"
    },
    {
      "text": "Nicolas Villar, Daniel Cletheroe, Greg Saul, Christian Holz, Tim Regan, Oscar Salandin, Misha Sra, Hui-Shyong Yeo, William Field, and Haiyan Zhang. 2018. Project Zanzibar: A Portable and Flexible Tangible Interaction Platform. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174089",
      "doi": "10.1145/3173574.3174089"
    },
    {
      "text": "Neng-Hao Yu, Li-Wei Chan, Seng Yong Lau, Sung-Sheng Tsai, I-Chun Hsiao, Dian-Je Tsai, Fang-I Hsiao, Lung-Pan Cheng, Mike Chen, Polly Huang, and Yi-Ping Hung. 2011. TUIC: Enabling Tangible Interaction on Capacitive Multi-Touch Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2995–3004. https://doi.org/10.1145/1978942.1979386",
      "doi": "10.1145/1978942.1979386"
    },
    {
      "text": "T. Zhang, N. Becker, Y. Wang, Y. Zhou, and Y. Shi. 2017. BitID: Easily Add Battery-Free Wireless Sensors to Everyday Objects. In 2017 IEEE International Conference on Smart Computing (SMARTCOMP). 1–8. https://doi.org/10.1109/SMARTCOMP.2017.7946990",
      "doi": ""
    },
    {
      "text": "Shilin Zhu and Yilong Li. 2018. 2DR: Towards Fine-Grained 2-D RFID Touch Sensing. arXiv preprint arXiv:1808.08808(2018).",
      "doi": ""
    },
    {
      "text": "Oren Zuckerman, Saeed Arida, and Mitchel Resnick. 2005. Extending Tangible Interfaces for Education: Digital Montessori-Inspired Manipulatives. CHI 2005: Technology, Safety, Community: Conference Proceedings - Conference on Human Factors in Computing Systems. https://doi.org/10.1145/1054972.1055093",
      "doi": "10.1145/1054972.1055093"
    }
  ]
}