{
  "doi": "10.1145/3411764.3445516",
  "title": "Bolder is Better: Raising User Awareness through Salient and Concise Privacy Notices",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "This paper addresses the question whether the recently proposed approach of concise privacy notices in apps and on websites is effective in raising user awareness. To assess the effectiveness in a realistic setting, we included concise notices in a fictitious but realistic fitness tracking app and asked participants recruited from an online panel to provide their feedback on the usability of the app as a cover story. Importantly, after giving feedback, users were also asked to recall the data practices described in the notices. The experimental setup included the variation of different levels of saliency and riskiness of the privacy notices. Based on a total sample of 2,274 participants, our findings indicate that concise privacy notices are indeed a promising approach to raise user awareness for privacy information when displayed in a salient way, especially in case the notices describe risky data practices. Our results may be helpful for regulators, user advocates and transparency-oriented companies in creating or enforcing better privacy transparency towards average users that do not read traditional privacy policies.",
  "tags": [
    "Privacy notices",
    "information saliency",
    "privacy awareness",
    "experimental design",
    "privacy communication",
    "information systems"
  ],
  "authors": [
    {
      "name": "Nico Ebert",
      "institution": "Institute of Business Information Technology ZHAW School of Management and Law, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526709",
      "orcid": "0000-0002-9683-4792"
    },
    {
      "name": "Kurt Alexander Ackermann",
      "institution": "Institute of Marketing Management ZHAW School of Management and Law, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701946",
      "orcid": "missing"
    },
    {
      "name": "Björn Scheppler",
      "institution": "Institute of Business Information Technology ZHAW School of Management and Law, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701734",
      "orcid": "0000-0002-9589-6123"
    }
  ],
  "references": [
    {
      "text": "Alessandro Acquisti, Leslie K. John, and George Loewenstein. 2013. What Is Privacy Worth? The Journal of Legal Studies 42, 2 (June 2013), 249–274. DOI: https://doi.org/10.1086/671754",
      "doi": ""
    },
    {
      "text": "Ryan Amos, Gunes Acar, Elena Lucherini, Mihir Kshirsagar, Arvind Narayanan, and Jonathan Mayer. 2020. Privacy Policies over Time: Curation andAnalysis of a Million-Document Dataset. arXiv:2008.09159 [cs] (August 2020). Retrieved August 31, 2020 from http://arxiv.org/abs/2008.09159",
      "doi": ""
    },
    {
      "text": "Rebecca Balebako, Florian Schaub, Idris Adjerid, Alessandro Acquisti, and Lorrie Cranor. 2015. The Impact of Timing on the Salience of Smartphone App Privacy Notices. In Proceedings of the 5th Annual ACM CCS Workshop on Security and Privacy in Smartphones and Mobile Devices (SPSM ’15), ACM, New York, NY, USA, 63–74. DOI: https://doi.org/10.1145/2808117.2808119",
      "doi": "10.1145/2808117.2808119"
    },
    {
      "text": "Fred H. Cate. 2006. The failure of fair information practice principles. In Consumer protection in the age of the information economy, Jane K. Winn (ed.). Ashgate Publishing.",
      "doi": ""
    },
    {
      "text": "Fred H. Cate. 2010. The limits of notice and choice. IEEE Security & Privacy 8, 2 (2010), 59–62.",
      "doi": "10.1109/MSP.2010.84"
    },
    {
      "text": "N. Cowan. 2008. 2.03 - Sensory Memory. In Learning and Memory: A Comprehensive Reference, John H. Byrne (ed.). Academic Press, Oxford, 23–32. DOI: https://doi.org/10.1016/B978-012370509-9.00172-8",
      "doi": ""
    },
    {
      "text": "Lorrie Faith Cranor. 2012. Necessary but Not Sufficient: Standardized Mechanisms for Privacy Notice and Choice. J. on Telecomm. & High Tech. L. 10, (2012), 273.",
      "doi": ""
    },
    {
      "text": "Nico Ebert, Kurt Alexander Ackermann, and Peter Heinrich. 2020. Does Context in Privacy Communication Really Matter? – A Survey on Consumer Concerns and Preferences. In Proceedings of the SIGCHI Conference on Human factors in Computing Systems, ACM.",
      "doi": "10.1145/3313831.3376575"
    },
    {
      "text": "Benjamin Fabian, Tatiana Ermakova, and Tino Lentz. 2017. Large-scale Readability Analysis of Privacy Policies. In Proceedings of the International Conference on Web Intelligence (WI ’17), ACM, New York, NY, USA, 18–25. DOI: https://doi.org/10.1145/3106426.3106427",
      "doi": "10.1145/3106426.3106427"
    },
    {
      "text": "Meadhbh I. Foster and Mark T. Keane. 2019. The Role of Surprise in Learning: Different Surprising Outcomes Affect Memorability Differentially. Topics in Cognitive Science 11, 1 (2019), 75–87. DOI: https://doi.org/10.1111/tops.12392",
      "doi": ""
    },
    {
      "text": "Staff Report FTC. 2015. IoT Privacy and Security in a Connected World. Retrieved January 13, 2018 from https://www.ftc.gov/system/files/documents/reports/federal-trade-commission-staff-report-november-2013-workshop-entitled-internet-things-privacy/150127iotrpt.pdf",
      "doi": ""
    },
    {
      "text": "Christopher S Gates, Jing Chen, Ninghui Li, and Robert W Proctor. 2013. Effective risk communication for android apps. IEEE Transactions on dependable and secure computing 11, 3 (2013), 252–265.",
      "doi": "10.1109/TDSC.2013.58"
    },
    {
      "text": "S. E. Gathercole. 2008. 2.04 - Working Memory. In Learning and Memory: A Comprehensive Reference, John H. Byrne (ed.). Academic Press, Oxford, 33–51. DOI: https://doi.org/10.1016/B978-012370509-9.00179-0",
      "doi": ""
    },
    {
      "text": "Robert Gellman and Pam Dixon. 2011. Online Privacy: A Reference Handbook. ABC-CLIO.",
      "doi": ""
    },
    {
      "text": "Joshua Gluck, Florian Schaub, Amy Friedman, Hana Habib, Norman Sadeh, Lorrie Faith Cranor, and Yuvraj Agarwal. 2016. How short is too short? Implications of length and framing on the effectiveness of privacy notices. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016), 321–340.",
      "doi": ""
    },
    {
      "text": "Victoria Groom and Ryan Calo. 2011. Reversing the Privacy Paradox: An Experimental Study. Social Science Research Network, Rochester, NY. Retrieved February 6, 2020 from https://papers.ssrn.com/abstract=1993125",
      "doi": ""
    },
    {
      "text": "Saul Hansell. 2002. Compressed Data; The Big Yahoo Privacy Storm That Wasn't. The New York Times. Retrieved February 6, 2020 from https://www.nytimes.com/2002/05/13/business/compressed-data-the-big-yahoo-privacy-storm-that-wasn-t.html",
      "doi": ""
    },
    {
      "text": "Andrew F. Hayes and Li Cai. 2007. Using heteroskedasticity-consistent standard error estimators in OLS regression: An introduction and software implementation. Behavior Research Methods 39, 4 (November 2007), 709–722. DOI: https://doi.org/10.3758/BF03192961",
      "doi": ""
    },
    {
      "text": "Hofstede, Geert. Cultural dimensions. Hofstede Insights. Retrieved February 19, 2020 from https://www.hofstede-insights.com/product/compare-countries/",
      "doi": ""
    },
    {
      "text": "Kai-Lung Hui, Hock Hai Teo, and Sang-Yong Tom Lee. 2007. The Value of Privacy Assurance: An Exploratory Field Experiment. MIS Quarterly 31, 1 (2007), 19–33. DOI: https://doi.org/10.2307/25148779",
      "doi": "10.5555/2017327.2017330"
    },
    {
      "text": "Carlos Jensen and Colin Potts. 2004. Privacy Policies as Decision-Making Tools: An Evaluation of Online Privacy Notices. Volume 6, Number 1 (2004), 471–478. DOI: https://doi.org/10.1145/1456403.1456413",
      "doi": "10.1145/985692.985752"
    },
    {
      "text": "Carlos Jensen, Colin Potts, and Christian Jensen. 2005. Privacy practices of Internet users: Self-reports versus observed behavior. International Journal of Human-Computer Studies 63, 1 (July 2005), 203–227. DOI: https://doi.org/10.1016/j.ijhcs.2005.04.019",
      "doi": "10.1016/j.ijhcs.2005.04.019"
    },
    {
      "text": "Nicola Jentzsch, Sören Preibusch, and Andreas Harasser. 2012. Study on monetising privacy. An economic model for pricing personal information. ENISA. Retrieved February 7, 2020 from https://www.enisa.europa.eu/publications/monetising-privacy",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Lucian Cesca, Joanna Bresee, and Lorrie Faith Cranor. 2010. Standardizing privacy notices: an online study of the nutrition label approach. In Proceedings of the SIGCHI Conference on Human factors in Computing Systems, ACM, 1573–1582.",
      "doi": "10.1145/1753326.1753561"
    },
    {
      "text": "Patrick Gage Kelley, Lorrie Faith Cranor, and Norman Sadeh. 2013. Privacy as part of the app decision-making process. In Proceedings of the SIGCHI conference on human factors in computing systems, ACM Press, 3393–3402.",
      "doi": "10.1145/2470654.2466466"
    },
    {
      "text": "E.A. Kensinger. 2011. Remembering Emotional Experiences: The Contribution of Valence and Arousal. Reviews in the Neurosciences 15, 4 (2011), 241–252. DOI: https://doi.org/10.1515/REVNEURO.2004.15.4.241",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Kensinger and Suzanne Corkin. 2003. Memory enhancement for emotional words: Are emotional words more vividly remembered than neutral words? Memory & Cognition 31, 8 (December 2003), 1169–1180. DOI: https://doi.org/10.3758/BF03195800",
      "doi": ""
    },
    {
      "text": "Robert Larose and Nora J. Rifon. 2007. Promoting i-Safety: Effects of Privacy Warnings and Privacy Seals on Risk Assessment and Online Privacy Behavior. Journal of Consumer Affairs 41, 1 (2007), 127–149. DOI: https://doi.org/10.1111/j.1745-6606.2006.00071.x",
      "doi": ""
    },
    {
      "text": "Thomas W. Lauer and Xiaodong Deng. 2007. Building online trust through privacy practices. Int. J. Inf. Secur. 6, 5 (September 2007), 323–331. DOI: https://doi.org/10.1007/s10207-007-0028-8",
      "doi": "10.1007/s10207-007-0028-8"
    },
    {
      "text": "Naresh K. Malhotra, Sung S. Kim, and James Agarwal. 2004. Internet Users’ Information Privacy Concerns (IUIPC): The Construct, the Scale, and a Causal Model. Information Systems Research 15, 4 (December 2004), 336–355. DOI: https://doi.org/10.1287/isre.1040.0032",
      "doi": "10.1287/isre.1040.0032"
    },
    {
      "text": "Yannic Meier, Johanna Schäwel, and Nicole C. Krämer. 2020. The Shorter the Better? Effects of Privacy Policy Length on Online Privacy Decision-Making. Media and Communication 8, 2 (June 2020), 291–301. DOI: https://doi.org/10.17645/mac.v8i2.2846",
      "doi": ""
    },
    {
      "text": "Miriam J. Metzger. 2006. Effects of Site, Vendor, and Consumer Characteristics on Web Site Trust and Disclosure. Communication Research 33, 3 (June 2006), 155–179. DOI: https://doi.org/10.1177/0093650206287076",
      "doi": ""
    },
    {
      "text": "Sandra J. Milberg, H. Jeff Smith, and Sandra J. Burke. 2000. Information Privacy: Corporate Management and National Regulation. Organization Science 11, 1 (February 2000), 35–57. DOI: https://doi.org/10.1287/orsc.11.1.35.12567",
      "doi": "10.1287/orsc.11.1.35.12567"
    },
    {
      "text": "George R. Milne and Mary J. Culnan. 2004. Strategies for reducing online privacy risks: Why consumers read (or don't read) online privacy notices. Journal of Interactive Marketing 18, 3 (January 2004), 15–29. DOI: https://doi.org/10.1002/dir.20009",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2011. A contextual approach to privacy online. Daedalus 140, 4 (2011), 32–48.",
      "doi": ""
    },
    {
      "text": "Jonathan A. Obar and Anne Oeldorf-Hirsch. 2020. The biggest lie on the Internet: ignoring the privacy policies and terms of service policies of social networking services. Information, Communication & Society 23, 1 (January 2020), 128–147. DOI: https://doi.org/10.1080/1369118X.2018.1486870",
      "doi": ""
    },
    {
      "text": "Kevin N. Ochsner. 2000. Are affective events richly recollected or simply familiar? The experience and process of recognizing feelings past. Journal of Experimental Psychology: General 129, 2 (2000), 242–261. DOI: https://doi.org/10.1037/0096-3445.129.2.242",
      "doi": ""
    },
    {
      "text": "Anne Oeldorf-Hirsch and Jonathan A. Obar. 2019. Overwhelming, Important, Irrelevant: Terms of Service and Privacy Policy Reading among Older Adults. In Proceedings of the 10th International Conference on Social Media and Society (SMSociety ’19), Association for Computing Machinery, Toronto, ON, Canada, 166–173. DOI: https://doi.org/10.1145/3328529.3328557",
      "doi": ""
    },
    {
      "text": "Yue Pan and George M. Zinkhan. 2006. Exploring the impact of online privacy disclosures on consumer trust. Journal of Retailing 82, 4 (January 2006), 331–338. DOI: https://doi.org/10.1016/j.jretai.2006.08.006",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, and Lorrie Faith Cranor. 2017. Designing Effective Privacy Notices and Controls. IEEE Internet Computing 21, 3 (May 2017), 70–77. DOI: https://doi.org/10.1109/MIC.2017.75",
      "doi": "10.1109/MIC.2017.75"
    },
    {
      "text": "Fuming Shih, Ilaria Liccardi, and Daniel Weitzner. 2015. Privacy Tipping Points in Smartphones Privacy Preferences. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, ACM Press, Seoul, Republic of Korea, 807–816. DOI: https://doi.org/10.1145/2702123.2702404",
      "doi": "10.1145/2702123.2702404"
    },
    {
      "text": "Geoff Skinner. 2007. The TLC-PP framework for delivering a Privacy Augmented Collaborative Environment (PACE). In 2007 International Conference on Collaborative Computing: Networking, Applications and Worksharing (CollaborateCom 2007), 289–293. DOI: https://doi.org/10.1109/COLCOM.2007.4553844",
      "doi": "10.1109/COLCOM.2007.4553844"
    },
    {
      "text": "H. Jeff Smith, Sandra J. Milberg, and Sandra J. Burke. 1996. Information Privacy: Measuring Individuals’ Concerns about Organizational Practices. MIS Quarterly 20, 2 (1996), 167–196. DOI: https://doi.org/10.2307/249477",
      "doi": "10.2307/249477"
    },
    {
      "text": "Nili Steinfeld. 2016. “I agree to the terms and conditions”: (How) do users read privacy policies online? An eye-tracking experiment. Computers in Human Behavior 55, (February 2016), 992–1000. DOI: https://doi.org/10.1016/j.chb.2015.09.038",
      "doi": "10.1016/j.chb.2015.09.038"
    },
    {
      "text": "Stanford E. Taylor. 1965. Eye movements in reading: Facts and fallacies. American Educational Research Journal 2, 4 (1965), 187–202.",
      "doi": ""
    },
    {
      "text": "Janice Y. Tsai, Serge Egelman, Lorrie Cranor, and Alessandro Acquisti. 2010. The Effect of Online Privacy Information on Purchasing Behavior: An Experimental Study. Information Systems Research 22, 2 (February 2010), 254–268. DOI: https://doi.org/10.1287/isre.1090.0260",
      "doi": ""
    },
    {
      "text": "P. Wijesekera, A. Baokar, L. Tsai, J. Reardon, S. Egelman, D. Wagner, and K. Beznosov. 2017. The Feasibility of Dynamically Granted Permissions: Aligning Mobile Privacy with User Preferences. In 2017 IEEE Symposium on Security and Privacy (SP), 1077–1093. DOI: https://doi.org/10.1109/SP.2017.51",
      "doi": ""
    },
    {
      "text": "Kuang-Wen Wu, Shaio Yan Huang, David C. Yen, and Irina Popova. 2012. The effect of online privacy policy on consumer privacy concern and trust. Computers in Human Behavior 28, 3 (May 2012), 889–897. DOI: https://doi.org/10.1016/j.chb.2011.12.008",
      "doi": "10.1016/j.chb.2011.12.008"
    },
    {
      "text": "Privacy - Control. Apple. Retrieved February 5, 2020 from https://www.apple.com/privacy/control/",
      "doi": ""
    },
    {
      "text": "Privacy policies for Android apps from developers other than Google - Google Play Help. Retrieved February 9, 2020 from https://support.google.com/googleplay/answer/2666094?hl=en",
      "doi": ""
    },
    {
      "text": "Privacy Policy Reminder - News - Apple Developer. Retrieved February 9, 2020 from https://developer.apple.com/news/?id=08312018a",
      "doi": ""
    }
  ]
}