{
  "doi": "10.1145/3411764.3445725",
  "title": "Typing Efficiency and Suggestion Accuracy Influence the Benefits and Adoption of Word Suggestions",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Suggesting words to complete a given sequence of characters is a common feature of typing interfaces. Yet, previous studies have not found a clear benefit, some even finding it detrimental. We report on the first study to control for two important factors, word suggestion accuracy and typing efficiency. Our accuracy factor is enabled by a new methodology that builds on standard metrics of word suggestions. Typing efficiency is based on device type. Results show word suggestions are used less often in a desktop condition, with little difference between tablet and phone conditions. Very accurate suggestions do not improve entry speed on desktop, but do on tablet and phone. Based on our findings, we discuss implications for the design of automation features in typing systems.",
  "authors": [
    {
      "name": "Quentin Roy",
      "institution": "School of Computer Science University of Waterloo, Canada",
      "img": "/do/10.1145/contrib-81556833156/rel-imgonly/quentinroy_2x.jpg",
      "acmid": "81556833156",
      "orcid": "missing"
    },
    {
      "name": "Sébastien Berlioux",
      "institution": "School of Computer Science University of Waterloo, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700962",
      "orcid": "missing"
    },
    {
      "name": "Géry Casiez",
      "institution": "Univ. Lille, CNRS, Inria, Centrale Lille, UMR 9189 CRIStAL, Lille, France",
      "img": "/do/10.1145/contrib-81100168597/rel-imgonly/gerycasieznewlowres.png",
      "acmid": "81100168597",
      "orcid": "0000-0003-1905-815X"
    },
    {
      "name": "Daniel Vogel",
      "institution": "Cheriton School of Computer Science University of Waterloo, Canada",
      "img": "/do/10.1145/contrib-81100054467/rel-imgonly/purple_shirt_selfie_redmond.jpg",
      "acmid": "81100054467",
      "orcid": "0000-0001-7620-0541"
    }
  ],
  "references": [
    {
      "text": "Denis Anson, Penni Moist, Mary Przywara, Heather Wells, Heather Saylor, and Hantz Maxime. 2006. The Effects of Word Completion and Word Prediction on Typing Rates Using On-Screen Keyboards. Assistive Technology 18, 2 (2006), 146–154. https://doi.org/10.1080/10400435.2006.10131913",
      "doi": ""
    },
    {
      "text": "Apple. 2020. NSSpellChecker: An interface to the Cocoa spell-checking service. https://developer.apple.com/documentation/appkit/nsspellchecker Accessed: 2020-09-07.",
      "doi": ""
    },
    {
      "text": "Ahmed Sabbir Arif and Wolfgang Stuerzlinger. 2009. Analysis of Text Entry Performance Petrics. In 2009 IEEE Toronto International Conference Science and Technology for Humanity (TIC-STH), Vol. 43. 100–105.",
      "doi": ""
    },
    {
      "text": "Kenneth C. Arnold, Krysta Chauncey, and Krzysztof Z. Gajos. 2020. Predictive Text Encourages Predictable Writing. In Proceedings of the 25th International Conference on Intelligent User Interfaces (Cagliari, Italy) (IUI ’20). Association for Computing Machinery, New York, NY, USA, 128–138. https://doi.org/10.1145/3377325.3377523",
      "doi": "10.1145/3377325.3377523"
    },
    {
      "text": "Kenneth C. Arnold, Krzysztof Z Gajos, and Adam T. Kalai. 2016. On Suggesting Phrases vs. Predicting Words for Mobile Text Composition. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(UIST ’16). ACM, New York, NY, USA, 603–608. https://doi.org/10.1145/2984511.2984584",
      "doi": "10.1145/2984511.2984584"
    },
    {
      "text": "Nikola Banovic, Varun Rao, Abinaya Saravanan, Anind K. Dey, and Jennifer Mankoff. 2017. Quantifying Aversion to Costly Typing Errors in Expert Mobile Text Entry. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4229–4241. https://doi.org/10.1145/3025453.3025695",
      "doi": "10.1145/3025453.3025695"
    },
    {
      "text": "Nikola Banovic, Ticha Sethapakdi, Yasasvi Hari, Anind K. Dey, and Jennifer Mankoff. 2019. The Limits of Expert Text Entry Speed on Mobile Keyboards with Autocorrect. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, Article 15, 12 pages. https://doi.org/10.1145/3338286.3340126",
      "doi": "10.1145/3338286.3340126"
    },
    {
      "text": "Android Jelly Bean. 2012. List of English words with their adjusted frequency of appearance. https://android.googlesource.com/platform/packages/inputmethods/LatinIME/+/jb-release/dictionaries/en_us_wordlist.xml Accessed: 2019-07-08.",
      "doi": ""
    },
    {
      "text": "Android Jelly Bean. 2012. Word prediction scoring algorithm. https://android.googlesource.com/platform/packages/inputmethods/LatinIME/+/jb-release/native/jni/src/correction.cpp#1098 Accessed: 2019-07-08.",
      "doi": ""
    },
    {
      "text": "Xiaojun Bi, Shiri Azenkot, Kurt Partridge, and Shumin Zhai. 2013. Octopus: Evaluating Touchscreen Keyboard Correction and Recognition Algorithms Via. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 543–552. https://doi.org/10.1145/2470654.2470732",
      "doi": "10.1145/2470654.2470732"
    },
    {
      "text": "Daniel Buschek, Benjamin Bisinger, and Florian Alt. 2018. ResearchIME: A Mobile Keyboard Application for Studying Free Typing Behaviour in the Wild. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173829",
      "doi": "10.1145/3173574.3173829"
    },
    {
      "text": "Patrick W Demasco and Kathleen F McCoy. 1992. Generating Text from Compressed Input: An Intelligent Interface for People with Severe Motor Impairments. Commun. ACM 35, 5 (may 1992), 68–78. https://doi.org/10.1145/129875.129881",
      "doi": "10.1145/129875.129881"
    },
    {
      "text": "Mark Dunlop and John Levine. 2012. Multidimensional Pareto Optimization of Touchscreen Keyboards for Speed, Familiarity and Improved Spell Checking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). ACM, New York, NY, USA, 2669–2678. https://doi.org/10.1145/2207676.2208659",
      "doi": "10.1145/2207676.2208659"
    },
    {
      "text": "Andrew Fowler, Kurt Partridge, Ciprian Chelba, Xiaojun Bi, Tom Ouyang, and Shumin Zhai. 2015. Effects of Language Modeling and Its Personalization on Touchscreen Typing Performance. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 649–658. https://doi.org/10.1145/2702123.2702503",
      "doi": "10.1145/2702123.2702503"
    },
    {
      "text": "Nestor Garay-Vitoria and Julio Abascal. 2006. Text prediction systems: a survey. Universal Access in the Information Society 4, 3 (mar 2006), 188–203. https://doi.org/10.1007/s10209-005-0005-9",
      "doi": "10.1007/s10209-005-0005-9"
    },
    {
      "text": "Surjya Ghosh, Kaustubh Hiware, Niloy Ganguly, Bivas Mitra, and Pradipta De. 2019. Does Emotion Influence the Use of Auto-Suggest during Smartphone Typing?. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 144–149. https://doi.org/10.1145/3301275.3302329",
      "doi": "10.1145/3301275.3302329"
    },
    {
      "text": "J.E. Gold, J.B. Driban, N. Thomas, T. Chakravarty, V. Channell, and E. Komaroff. 2012. Postures, typing strategies, and gender differences in mobile device usage: An observational study. Applied Ergonomics 43, 2 (2012), 408 – 412. https://doi.org/10.1016/j.apergo.2011.06.015 Special Section on Product Comfort.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index); Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A Hancock and Najmedin Meshkati (Eds.). Advances in Psychology, Vol. 52. North-Holland, 139–183. https://doi.org/10.1016/S0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Dan Jurafsky. 2000. Speech & language processing. Pearson Education India.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Shwetak N. Patel, and Julie A. Kientz. 2015. How Good is 85%?: A Survey Tool to Connect Classifier Evaluation to Acceptability of Accuracy. Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI 2015) (2015), 347–356. https://doi.org/bqd5",
      "doi": "10.1145/2702123.2702603"
    },
    {
      "text": "Heidi Horstmann Koester and Simon Levine. 1996. Effect of a word prediction feature on user performance. Augmentative and Alternative Communication 12, 3 (1996), 155–168. https://doi.org/10.1080/07434619612331277608",
      "doi": ""
    },
    {
      "text": "H H Koester and S P Levine. 1994. Modeling the speed of text entry with a word prediction interface. IEEE Transactions on Rehabilitation Engineering 2, 3(1994), 177–187. https://doi.org/10.1109/86.331567",
      "doi": ""
    },
    {
      "text": "Per Ola Kristensson and Shumin Zhai. 2004. SHARK2: a large vocabulary shorthand writing system for pen-based computers. In UIST ’04. ACM Press, New York, New York, USA, 43–52. https://doi.org/10.1145/1029632.1029640",
      "doi": ""
    },
    {
      "text": "John D. Lee and Katrina A. See. 2004. Trust in automation: Designing for appropriate reliance. Human factors 46, 1 (2004), 50–80.",
      "doi": ""
    },
    {
      "text": "I Scott MacKenzie and R William Soukoreff. 2003. Phrase Sets for Evaluating Text Entry Techniques. In CHI ’03 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’03). ACM, New York, NY, USA, 754–755. https://doi.org/10.1145/765891.765971",
      "doi": "10.1145/765891.765971"
    },
    {
      "text": "Christopher D Manning, Christopher D Manning, and Hinrich Schütze. 1999. Foundations of statistical natural language processing. MIT press.",
      "doi": "10.5555/311445"
    },
    {
      "text": "Kseniia Palin, Anna Maria Feit, Sunjun Kim, Per Ola Kristensson, and Antti Oulasvirta. 2019. How Do People Type on Mobile Devices? Observations from a Study with 37,000 Volunteers. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’19). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3338286.3340120",
      "doi": "10.1145/3338286.3340120"
    },
    {
      "text": "Raja Parasuraman and Victor Riley. 1997. Humans and Automation: Use, Misuse, Disuse, Abuse. Human Factors 39, 2 (1997), 230–253. https://doi.org/10.1518/001872097778543886",
      "doi": ""
    },
    {
      "text": "Raja Parasuraman, Thomas B Sheridan, and Christopher D Wickens. 2000. A model for types and levels of human interaction with automation. IEEE Transactions on systems, man, and cybernetics-Part A: Systems and Humans 30, 3 (2000), 286–297.",
      "doi": "10.1109/3468.844354"
    },
    {
      "text": "Philip Quinn and Andy Cockburn. 2016. When Bad Feels Good: Assistance Failures and Interface Preferences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 4005–4010. https://doi.org/10.1145/2858036.2858074",
      "doi": "10.1145/2858036.2858074"
    },
    {
      "text": "Philip Quinn and Shumin Zhai. 2016. A Cost-Benefit Study of Text Entry Suggestion Interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 83–88. https://doi.org/10.1145/2858036.2858305",
      "doi": "10.1145/2858036.2858305"
    },
    {
      "text": "Quentin Roy, Futian Zhang, and Daniel Vogel. 2019. Automation Accuracy Is Good, but High Controllability May Be Better. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–8. https://doi.org/10.1145/3290605.3300750",
      "doi": "10.1145/3290605.3300750"
    },
    {
      "text": "Sherry Ruan, Jacob O. Wobbrock, Kenny Liou, Andrew Ng, and James A. Landay. 2018. Comparing Speech and Keyboard Text Entry for Short Messages in Two Languages on Touchscreen Phones. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 159 (Jan. 2018), 23 pages. https://doi.org/10.1145/3161187",
      "doi": "10.1145/3161187"
    },
    {
      "text": "Robert L Solso and Joseph F King. 1976. Frequency and versatility of letters in the English language. Behavior Research Methods & Instrumentation 8, 3(1976), 283–286.",
      "doi": ""
    },
    {
      "text": "Andrew Swiffin, John Arnott, J. Adrian Pickering, and Alan Newell. 1987. Adaptive and predictive techniques in a communication prosthesis. Augmentative and Alternative Communication 3, 4 (1987), 181–191. https://doi.org/10.1080/07434618712331274499",
      "doi": ""
    },
    {
      "text": "Keith Trnka, John McCaw, Debra Yarrington, Kathleen F McCoy, and Christopher Pennington. 2008. Word prediction and communication rate in AAC. In Proceedings of the IASTED International Conference on Telehealth/Assistive Technologies (Telehealth/AT’08). ACTA Press Anaheim, CA, USA Baltimore, MD, 19–24.",
      "doi": "10.5555/1722763.1722768"
    },
    {
      "text": "Keith Trnka, John McCaw, Debra Yarrington, Kathleen F McCoy, and Christopher Pennington. 2009. User Interaction with Word Prediction: The Effects of Prediction Quality. ACM Trans. Access. Comput. 1, 3 (feb 2009), 17:1–17:34. https://doi.org/10.1145/1497302.1497307",
      "doi": "10.1145/1497302.1497307"
    },
    {
      "text": "Horabail Venkatagiri. 1994. Effect of window size on rate of communication in a lexical prediction AAC system. Augmentative and Alternative Communication 10, 2 (1994), 105–112. https://doi.org/10.1080/07434619412331276810",
      "doi": ""
    },
    {
      "text": "Daniel Vogel and Patrick Baudisch. 2007. Shift: A Technique for Operating Pen-Based Interfaces Using Touch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 657–666. https://doi.org/10.1145/1240624.1240727",
      "doi": "10.1145/1240624.1240727"
    },
    {
      "text": "Daryl Weir, Henning Pohl, Simon Rogers, Keith Vertanen, and Per Ola Kristensson. 2014. Uncertain Text Entry on Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, New York, NY, USA, 2307–2316. https://doi.org/10.1145/2556288.2557412",
      "doi": "10.1145/2556288.2557412"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). ACM, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Jacob O Wobbrock and Brad A Myers. 2006. From Letters to Words: Efficient Stroke-based Word Completion for Trackball Text Entry. In Proceedings of the 8th International ACM SIGACCESS Conference on Computers and Accessibility(Assets ’06). ACM, New York, NY, USA, 2–9. https://doi.org/10.1145/1168987.1168990",
      "doi": "10.1145/1168987.1168990"
    },
    {
      "text": "Hisao Yamada. 1980. A historical study of typewriters and typing methods, from the position of planning Japanese parallels. Journal of Information Processing.",
      "doi": ""
    },
    {
      "text": "Ming Yin, Jennifer Wortman Vaughan, and Hanna Wallach. 2019. Understanding the Effect of Accuracy on Trust in Machine Learning Models. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 279:1–279:12. https://doi.org/10.1145/3290605.3300509",
      "doi": "10.1145/3290605.3300509"
    }
  ]
}