{
  "doi": "10.1145/3411764.3445665",
  "title": "Sharing Heartbeats: Motivations of Citizen Scientists in Times of Crises",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "With the rise of COVID-19 cases globally, many countries released digital tools to mitigate the effects of the pandemic. In Germany the Robert Koch Institute (RKI) published the Corona-Data-Donation-App, a virtual citizen science (VCS) project, to establish an early warning system for the prediction of potential COVID-19 hotspots using data from wearable devices. While work on motivation for VCS projects in HCI often presents egoistic motives as prevailing, there is little research on such motives in crises situations. In this paper, we explore the socio-psychological processes and motivations to share personal data during a pandemic. Our findings indicate that collective motives dominated among app reviews (n=464) and in in-depth interviews (n=10). We contribute implications for future VCS tools in times of crises that highlight the importance of communication, transparency and responsibility.",
  "authors": [
    {
      "name": "Daniel Diethei",
      "institution": "University of Bremen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659344012",
      "orcid": "missing"
    },
    {
      "name": "Jasmin Niess",
      "institution": "University of Bremen, Germany",
      "img": "/do/10.1145/contrib-99659260376/rel-imgonly/niessj.jpg",
      "acmid": "99659260376",
      "orcid": "0000-0003-3529-0653"
    },
    {
      "name": "Carolin Stellmacher",
      "institution": "University of Bremen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474130",
      "orcid": "missing"
    },
    {
      "name": "Evropi Stefanidi",
      "institution": "University of Bremen, Germany",
      "img": "/do/10.1145/contrib-99659279435/rel-imgonly/evropi-bremen.jpg",
      "acmid": "99659279435",
      "orcid": "0000-0001-5547-6426"
    },
    {
      "name": "Johannes Schöning",
      "institution": "University of Bremen, Germany",
      "img": "/do/10.1145/contrib-81508685058/rel-imgonly/20160404_5404_dsc_6947_small.jpg",
      "acmid": "81508685058",
      "orcid": "0000-0002-8823-4607"
    }
  ],
  "references": [
    {
      "text": "Daniel Batson, Nadia Ahmad, and Jo-Ann Tsang. 2002. Four motives for community involvement. Journal of social issues 58, 3 (2002), 429–445.",
      "doi": ""
    },
    {
      "text": "Ann Blandford, Dominic Furniss, and Stephann Makri. 2016. Qualitative HCI Research: Going Behind the Scenes. Synthesis Lectures on Human-Centered Informatics 9, 1 (April 2016), 1–115. https://doi.org/10.2200/S00706ED1V01Y201602HCI034Publisher: Morgan & Claypool Publishers.",
      "doi": "10.5555/3019315"
    },
    {
      "text": "Anne Bowser, Katie Shilton, Jenny Preece, and Elizabeth Warrick. 2017. Accounting for privacy in citizen science: Ethical research in a context of openness. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 2124–2136.",
      "doi": "10.1145/2998181.2998305"
    },
    {
      "text": "Danah Boyd, Scott Golder, and Gilad Lotan. 2010. Tweet, tweet, retweet: Conversational aspects of retweeting on twitter. In 2010 43rd Hawaii international conference on system sciences. IEEE, 1–10.",
      "doi": "10.1109/HICSS.2010.412"
    },
    {
      "text": "Barry Brown and Oskar Juhlin. 2015. Enjoying machines. Mit Press.",
      "doi": ""
    },
    {
      "text": "Douglas Busvine. 2020. Germany launches smartwatch app to monitor coronavirus spread. Retrieved September 14, 2020 from https://www.reuters.com/article/us-health-coronavirus-germany-tech/germany-launches-smartwatch-app-to-monitor-coronavirus-spread-idUSKBN21P1SS",
      "doi": ""
    },
    {
      "text": "Brian Butler, Lee Sproull, Sara Kiesler, and Robert Kraut. 2002. Community effort in online groups: Who does the work and why. Leadership at a distance: Research in technologically supported work 1 (2002), 171–194.",
      "doi": ""
    },
    {
      "text": "ccc.de. 2020. CCC analysiert Corona-Datenspende des RKI. Retrieved December 17, 2020 from https://www.ccc.de/de/updates/2020/abofalle-datenspende",
      "doi": ""
    },
    {
      "text": "CEBM. 2020. COVID-19: What proportion are asymptomatic?Retrieved September 14, 2020 from https://www.cebm.net/covid-19/covid-19-what-proportion-are-asymptomatic/",
      "doi": ""
    },
    {
      "text": "Centers for Disease Control and Prevention, USA. 2020. Coronavirus Disease 2019 (COVID-19) - Transmission. Retrieved September 14, 2020 from https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/how-covid-spreads.html",
      "doi": ""
    },
    {
      "text": "Charite, Germany. 2020. CovApp: Recommendations and information regarding coronavirus. Retrieved September 14, 2020 from https://covapp.charite.de/",
      "doi": ""
    },
    {
      "text": "Apoorva Chauhan and Amanda L. Hughes. 2017. Providing Online Crisis Information: An Analysis of Official Sources during the 2014 Carlton Complex Wildfire. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3151–3162. https://doi.org/10.1145/3025453.3025627",
      "doi": "10.1145/3025453.3025627"
    },
    {
      "text": "Justin Cranshaw and Aniket Kittur. 2011. The polymath project: lessons from a successful online collaboration in mathematics. In Proceedings of the SIGCHI conference on human factors in computing systems. 1865–1874.",
      "doi": "10.1145/1978942.1979213"
    },
    {
      "text": "Vickie Curtis. 2015. Online citizen science projects: an exploration of motivation, contribution and participation. Ph.D. Dissertation. The Open University.",
      "doi": ""
    },
    {
      "text": "Samira Davalbhakta, Shailesh Advani, Shobhit Kumar, Vishwesh Agarwal, Samruddhi Bhoyar, Elizabeth Fedirko, Durga Misra, Ashish Goel, Latika Gupta, and Vikas Agarwal. 2020. A systematic review of the smartphone applications available for coronavirus disease 2019 (COVID19) and their assessment using the mobile app rating scale (MARS). medRxiv (2020).",
      "doi": ""
    },
    {
      "text": "Ensheng Dong, Hongru Du, and Lauren Gardner. 2020. An interactive web-based dashboard to track COVID-19 in real time. The Lancet infectious diseases 20, 5 (2020), 533–534.",
      "doi": ""
    },
    {
      "text": "Cathal Doyle, Rodreck David, Yevgeniya Li, Markus Luczak-Roesch, Dayle Anderson, and Cameron M. Pierson. 2019. Using the web for science in the classroom: Online citizen science participation in teaching and learning. In Proceedings of the 10th ACM Conference on Web Science. 71–80.",
      "doi": "10.1145/3292522.3326022"
    },
    {
      "text": "Nature Education. 2014. Controlling Dengue Outbreaks. Retrieved December 28, 2020 from https://www.nature.com/scitable/topicpage/controlling-dengue-outbreaks-22403714/",
      "doi": ""
    },
    {
      "text": "Melissa V Eitzel, Jessica L Cappadonna, Chris Santos-Lang, Ruth Ellen Duerr, Arika Virapongse, Sarah Elizabeth West, Christopher Kyba, Anne Bowser, Caren Beth Cooper, Andrea Sforzi, 2017. Citizen science terminology matters: exploring key terms. Citizen science: Theory and practice 2, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A. Munson. 2016. Beyond Abandonment to Next Steps: Understanding and Designing for Life after Personal Informatics Tool Use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1109–1113. https://doi.org/10.1145/2858036.2858045",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 731–742. https://doi.org/10.1145/2750858.2804250",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "European Cluster Collaboration Platform. 2020. ProteGO Safe application. Retrieved September 14, 2020 from https://www.clustercollaboration.eu/forum/best-practices-sharing/protego-safe-application",
      "doi": ""
    },
    {
      "text": "Alexandra Eveleigh, Charlene Jennett, Ann Blandford, Philip Brohan, and Anna L. Cox. 2014. Designing for Dabblers and Deterring Drop-Outs in Citizen Science. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2985–2994. https://doi.org/10.1145/2556288.2557262",
      "doi": "10.1145/2556288.2557262"
    },
    {
      "text": "Alexandra Eveleigh, Charlene Jennett, Stuart Lynn, and Anna L. Cox. 2013. “I Want to Be a Captain! I Want to Be a Captain!”: Gamification in the Old Weather Citizen Science Project. In Proceedings of the First International Conference on Gameful Design, Research, and Applications (Toronto, Ontario, Canada) (Gamification ’13). Association for Computing Machinery, New York, NY, USA, 79–82. https://doi.org/10.1145/2583008.2583019",
      "doi": "10.1145/2583008.2583019"
    },
    {
      "text": "Federal Press Office Germany. 2020. Datenspende gegen Corona. Retrieved September 14, 2020 from https://www.bundesregierung.de/breg-de/themen/coronavirus/datenspende-app-1739928",
      "doi": ""
    },
    {
      "text": "Arup Kumar Ghosh, Karla Badillo-Urquiola, Shion Guha, Joseph J. LaViola Jr, and Pamela J. Wisniewski. 2018. Safety vs. Surveillance: What Children Have to Say about Mobile Apps for Parental Control. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173698",
      "doi": "10.1145/3173574.3173698"
    },
    {
      "text": "Xinning Gui, Yubo Kou, Kathleen Pine, Elisa Ladaw, Harold Kim, Eli Suzuki-Gill, and Yunan Chen. 2018. Multidimensional Risk Communication: Public Discourse on Risks during an Emerging Epidemic. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173788",
      "doi": "10.1145/3173574.3173788"
    },
    {
      "text": "Trisha Gura. 2013. Citizen science: amateur experts. Nature 496, 7444 (2013), 259–261. ISBN: 0028-0836 Publisher: Nature Research.",
      "doi": ""
    },
    {
      "text": "Chris Hagar. 2006. Using research to aid the design of a crisis information management course. In ALISE Annual Conference SIG Multicultural, Ethnic & Humanistic Concerns (MEH). Information Seeking and Service Delivery for Communities in Disaster/Crisis, San Antonio.",
      "doi": ""
    },
    {
      "text": "Isobel Asher Hamilton. 2020. Poland made an app that forces coronavirus patients to take regular selfies to prove they’re indoors or face a police visit. Retrieved September 14, 2020 from https://www.businessinsider.com/poland-app-coronavirus-patients-mandaotory-selfie-2020-3?r=DE&IR=T",
      "doi": ""
    },
    {
      "text": "Eric Hand. 2010. People power: networks of human minds are taking citizen science to a new level. Nature 466, 7307 (2010), 685–688. ISBN: 0028-0836 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Steffen Hedegaard and Jakob Grue Simonsen. 2013. Extracting usability and user experience information from online user reviews. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2089–2098.",
      "doi": "10.1145/2470654.2481286"
    },
    {
      "text": "Guido Hertel, Sven Niedner, and Stefanie Herrmann. 2003. Motivation of software developers in Open Source projects: an Internet-based survey of contributors to the Linux kernel. Research policy 32, 7 (2003), 1159–1177.",
      "doi": ""
    },
    {
      "text": "Nan Hu, Paul A Pavlou, and Jennifer Zhang. 2006. Can online reviews reveal a product’s true quality? Empirical findings and analytical modeling of online word-of-mouth communication. In Proceedings of the 7th ACM conference on Electronic commerce. 324–330.",
      "doi": ""
    },
    {
      "text": "Chaolin Huang, Yeming Wang, Xingwang Li, Lili Ren, Jianping Zhao, Yi Hu, Li Zhang, Guohui Fan, Jiuyang Xu, and Xiaoying Gu. 2020. Clinical features of patients infected with 2019 novel coronavirus in Wuhan, China. The lancet 395, 10223 (2020), 497–506. ISBN: 0140-6736 Publisher: Elsevier.",
      "doi": ""
    },
    {
      "text": "Y. Linlin Huang, Kate Starbird, Mania Orand, Stephanie A. Stanek, and Heather T. Pedersen. 2015. Connected Through Crisis: Emotional Proximity and the Spread of Misinformation Online. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 969–980. https://doi.org/10.1145/2675133.2675202",
      "doi": "10.1145/2675133.2675202"
    },
    {
      "text": "Alan Irwin. 1995. Citizen science: A study of people, expertise and sustainable development. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Corey Brian Jackson, Carsten Østerlund, Kevin Crowston, Mahboobeh Harandi, and Laura Trouille. 2020. Shifting Forms of Engagement: Volunteer Learning in Online Citizen Science. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 036 (May 2020), 19 pages. https://doi.org/10.1145/3392841",
      "doi": "10.1145/3392841"
    },
    {
      "text": "Caroline Jay, Robert Dunne, David Gelsthorpe, and Markel Vigo. 2016. To Sign Up, or Not to Sign Up? Maximizing Citizen Science Contribution Rates through Optional Registration. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1827–1832. https://doi.org/10.1145/2858036.2858319",
      "doi": "10.1145/2858036.2858319"
    },
    {
      "text": "Charlene Jennett, Laure Kloetzer, Daniel Schneider, Ioanna Iacovides, Anna Cox, Margaret Gold, Brian Fuchs, Alexandra Eveleigh, Kathleen Methieu, Zoya Ajani, 2016. Motivations, learning and creativity in online citizen science. Journal of Science Communication 15, 3 (2016).",
      "doi": ""
    },
    {
      "text": "Johns Hopkins University. 2020. COVID-19 Dashboard by the Center for Systems Science and Engineering (CSSE) at Johns Hopkins University (JHU). (2020).",
      "doi": ""
    },
    {
      "text": "Isaac Johnson, Connor McMahon, Johannes Schöning, and Brent Hecht. 2017. The Effect of Population and” Structural” Biases on Social Media-based Algorithms: A Case Study in Geolocation Inference Across the Urban-Rural Spectrum. In Proceedings of the 2017 CHI conference on Human Factors in Computing Systems. 1167–1178.",
      "doi": "10.1145/3025453.3026015"
    },
    {
      "text": "Isaac L Johnson, Yilun Lin, Toby Jia-Jun Li, Andrew Hall, Aaron Halfaker, Johannes Schöning, and Brent Hecht. 2016. Not at home on the range: Peer production and the urban/rural divide. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 13–25.",
      "doi": "10.1145/2858036.2858123"
    },
    {
      "text": "Evangelos Karapanos, John Zimmerman, Jodi Forlizzi, and Jean-Bernard Martens. 2009. User Experience over Time: An Initial Framework. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 729–738. https://doi.org/10.1145/1518701.1518814",
      "doi": "10.1145/1518701.1518814"
    },
    {
      "text": "Sunyoung Kim, Christine Robson, Thomas Zimmerman, Jeffrey Pierce, and Eben M Haber. 2011. Creek watch: pairing usefulness and usability for successful citizen science. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2125–2134.",
      "doi": "10.1145/1978942.1979251"
    },
    {
      "text": "Bert Klandermans. 1997. The social psychology of protest. Blackwell, Oxford, UK.",
      "doi": ""
    },
    {
      "text": "Anne M Land-Zandstra, Jeroen LA Devilee, Frans Snik, Franka Buurmeijer, and Jos M van den Broek. 2016. Citizen science on a smartphone: Participants’ motivations and learning. Public Understanding of Science 25, 1 (2016), 45–60.",
      "doi": ""
    },
    {
      "text": "MDR. 2020. Die Chronik der Corona-Krise. Retrieved September 14, 2020 from https://www.mdr.de/nachrichten/politik/corona-chronik-chronologie-coronavirus-100.html",
      "doi": ""
    },
    {
      "text": "Oded Nov. 2007. What motivates wikipedians?Commun. ACM 50, 11 (2007), 60–64.",
      "doi": "10.1145/1297797.1297798"
    },
    {
      "text": "Oded Nov, Ofer Arazy, and David Anderson. 2011. Dusting for science: motivation and participation of digital citizen science volunteers. In Proceedings of the 2011 iConference. 68–74.",
      "doi": "10.1145/1940761.1940771"
    },
    {
      "text": "Encyclopedia of Life. 2020. Encyclopedia of Life. Retrieved September 14, 2020 from https://eol.org/",
      "doi": ""
    },
    {
      "text": "The Cornell Lab of Ornithology. 2020. eBird - Discover a new world of birding...Retrieved September 14, 2020 from https://ebird.org/home",
      "doi": ""
    },
    {
      "text": "U.S. Department of the Interior. 2020. Gulf Coast Inventory & Monitoring Network (U.S. National Park Service). Retrieved September 14, 2020 from https://www.nps.gov/im/guln/index.htm",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2019. Measles. Retrieved December 28, 2020 from https://www.who.int/news-room/fact-sheets/detail/measles",
      "doi": ""
    },
    {
      "text": "Jennifer Preece. 2016. Citizen science: New research challenges for human–computer interaction. International Journal of Human-Computer Interaction 32, 8(2016), 585–612.",
      "doi": ""
    },
    {
      "text": "Qkopy. 2020. GoK Direct - Kerala - Apps on Google Play. Retrieved September 14, 2020 from https://play.google.com/store/apps/details?id=com.qkopy.prdkerala&hl=en",
      "doi": ""
    },
    {
      "text": "Giorgio Quer, Jennifer M Radin, Matteo Gadaleta, Katie Baca-Motes, Lauren Ariniello, Edward Ramos, Vik Kheterpal, Eric J Topol, and Steven R Steinhubl. 2020. Passive Monitoring of Physiological Data and Self-reported Symptoms to Detect Clusters of People with COVID-19. medRxiv (2020).",
      "doi": ""
    },
    {
      "text": "Jordan Raddick, Georgia Bracey, Pamela Gay, Chris Lintott, Carolin Cardamone, Phil Murray, Kevin Schawinski, Alexander Szalay, and Jan Vandenberg. 2013. Galaxy Zoo: Motivations of Citizen Scientists. Astronomy Education Review 12 (12 2013), 0106–. https://doi.org/10.3847/AER2011021",
      "doi": ""
    },
    {
      "text": "Jennifer M Radin, Nathan E Wineinger, Eric J Topol, and Steven R Steinhubl. 2020. Harnessing wearable device data to improve state-level real-time surveillance of influenza-like illness in the USA: a population-based study. The Lancet Digital Health 2, 2 (2020), e85–e93.",
      "doi": ""
    },
    {
      "text": "Neal T. Reeves and Elena Simperl. 2019. Efficient, but Effective? Volunteer Engagement in Short-Term Virtual Citizen Science Projects. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 177 (Nov. 2019), 35 pages. https://doi.org/10.1145/3359279",
      "doi": ""
    },
    {
      "text": "RKI. 2020. Aktuelle Fieberkurve für Deutschland. Retrieved September 14, 2020 from https://corona-datenspende.de/science/monitor/",
      "doi": ""
    },
    {
      "text": "RKI. 2020. Corona-Warn-App. Retrieved September 14, 2020 from https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/WarnApp/Warn_App.html",
      "doi": ""
    },
    {
      "text": "RKI. 2020. Datenspende: Robert Koch-Institut - Corona-Datenspende. Retrieved September 14, 2020 from https://corona-datenspende.de/",
      "doi": ""
    },
    {
      "text": "RKI. 2020. Ein Dankeschön an die Spender:innen!Retrieved September 14, 2020 from https://corona-datenspende.de/science/reports/thank-you",
      "doi": ""
    },
    {
      "text": "RKI. 2020. Robert Koch Institute - Corona-Datenspende-App. Retrieved September 14, 2020 from https://www.rki.de/DE/Content/InfAZ/N/Neuartiges_Coronavirus/Corona-Datenspende-allgemein.html",
      "doi": ""
    },
    {
      "text": "Jeffrey A Roberts, Il-Horn Hann, and Sandra A Slaughter. 2006. Understanding the motivations, participation, and performance of open source software developers: A longitudinal study of the Apache projects. Management science 52, 7 (2006), 984–999.",
      "doi": ""
    },
    {
      "text": "Dana Rotman, Jen Hammock, Jenny Preece, Derek Hansen, Carol Boston, Anne Bowser, and Yurong He. 2014. Motivations affecting initial and long-term participation in citizen science projects in three countries. IConference 2014 Proceedings(2014).",
      "doi": ""
    },
    {
      "text": "Dana Rotman, Jenny Preece, Jen Hammock, Kezee Procita, Derek Hansen, Cynthia Parr, Darcy Lewis, and David Jacobs. 2012. Dynamic changes in motivation in collaborative citizen-science projects. In Proceedings of the ACM 2012 conference on computer supported cooperative work. 217–226.",
      "doi": "10.1145/2145204.2145238"
    },
    {
      "text": "Joachim Schroer and Guido Hertel. 2009. Voluntary engagement in an open web-based encyclopedia: Wikipedians and why they do it. Media Psychology 12, 1 (2009), 96–120.",
      "doi": ""
    },
    {
      "text": "Elena Simperl, Neal Reeves, Chris Phethean, Todd Lynes, and Ramine Tinati. 2018. Is Virtual Citizen Science A Game?Trans. Soc. Comput. 1, 2, Article 6 (June 2018), 39 pages. https://doi.org/10.1145/3209960",
      "doi": ""
    },
    {
      "text": "Jaime Snyder. 2017. Vernacular Visualization Practices in a Citizen Science Project. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 2097–2111. https://doi.org/10.1145/2998181.2998239",
      "doi": "10.1145/2998181.2998239"
    },
    {
      "text": "Robert Soden, Perrine Hamel, David Lallemant, and James Pierce. 2020. The Disaster and Climate Change Artathon: Staging Art/Science Collaborations in Crisis Informatics. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 1273–1286. https://doi.org/10.1145/3357236.3395461",
      "doi": "10.1145/3357236.3395461"
    },
    {
      "text": "Robert Soden and Leysia Palen. 2018. Informating Crisis: Expanding Critical Perspectives in Crisis Informatics. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 162 (Nov. 2018), 22 pages. https://doi.org/10.1145/3274431",
      "doi": "10.1145/3274431"
    },
    {
      "text": "Kate Starbird and Leysia Palen. 2011. ”Voluntweeters”: Self-Organizing by Digital Volunteers in Times of Crisis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 1071–1080. https://doi.org/10.1145/1978942.1979102",
      "doi": "10.1145/1978942.1979102"
    },
    {
      "text": "Katarzyna Stawarz, Anna L. Cox, and Ann Blandford. 2014. Don’t Forget Your Pill! Designing Effective Medication Reminder Apps That Support Users’ Daily Routines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2269–2278. https://doi.org/10.1145/2556288.2557079",
      "doi": "10.1145/2556288.2557079"
    },
    {
      "text": "Brian L Sullivan, Christopher L Wood, Marshall J Iliff, Rick E Bonney, Daniel Fink, and Steve Kelling. 2009. eBird: A citizen-based bird observation network in the biological sciences. Biological conservation 142, 10 (2009), 2282–2292.",
      "doi": ""
    },
    {
      "text": "tagesschau.de. 2020. Hunderttausende nutzen ”Datenspende”-App. Retrieved September 14, 2020 from https://www.tagesschau.de/inland/datenspende-app-rki-corona-101.html",
      "doi": ""
    },
    {
      "text": "tagesschau.de. 2020. Mit Fitnessdaten das Virus verstehen. Retrieved December 17, 2020 from https://www.tagesschau.de/inland/app-rki-101.html",
      "doi": ""
    },
    {
      "text": "tagesschau.de. 2020. Sendung: tagesschau 07.04.2020 20:00 Uhr. Retrieved December 17, 2020 from https://www.tagesschau.de/multimedia/sendung/ts-36515.html",
      "doi": ""
    },
    {
      "text": "Marion Lara Tan, Raj Prasanna, Kristin Stock, Emma Hudson-Doyle, Graham Leonard, and David Johnston. 2017. Mobile applications in crisis informatics literature: A systematic review. International journal of disaster risk reduction 24 (2017), 297–311.",
      "doi": ""
    },
    {
      "text": "Economic Times. 2020. Those in home quarantine in Karnataka directed to send selfies every hour to govt. Retrieved September 14, 2020 from https://economictimes.indiatimes.com/news/politics-and-nation/those-in-home-quarantine-in-karnataka-directed-to-send-selfies-every-hour-to-govt/articleshow/74907051.cms?from=mdr",
      "doi": ""
    },
    {
      "text": "Emmanuelle Vaast and Cathy Urquhart. 2017. Building Grounded Theory with Social Media Data. In Routledge Companion to Qualitative Research in Organization Studies, Raza Mir and Sanjay Jain (Eds.). Routledge, Chapter 14.",
      "doi": ""
    },
    {
      "text": "Raju Vaishya, Mohd Javaid, Ibrahim Haleem Khan, and Abid Haleem. 2020. Artificial Intelligence (AI) applications for COVID-19 pandemic. Diabetes & Metabolic Syndrome: Clinical Research & Reviews 14, 4(2020).",
      "doi": ""
    },
    {
      "text": "Sarah Vieweg, Amanda L. Hughes, Kate Starbird, and Leysia Palen. 2010. Microblogging during Two Natural Hazards Events: What Twitter May Contribute to Situational Awareness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1079–1088. https://doi.org/10.1145/1753326.1753486",
      "doi": "10.1145/1753326.1753486"
    },
    {
      "text": "Sera Whitelaw, Mamas A Mamas, Eric Topol, and Harriette GC Van Spall. 2020. Applications of digital technology in COVID-19 pandemic planning and response. The Lancet Digital Health(2020).",
      "doi": ""
    },
    {
      "text": "WHO. 2020. Novel Coronavirus – China. Retrieved September 14, 2020 from http://www.who.int/csr/don/12-january-2020-novel-coronavirus-china/en/",
      "doi": ""
    },
    {
      "text": "WHO. 2020. Q&A: How is COVID-19 transmitted?Retrieved September 14, 2020 from https://www.who.int/news-room/q-a-detail/q-a-how-is-covid-19-transmitted",
      "doi": ""
    },
    {
      "text": "WHO. 2020. Q&A on coronaviruses (COVID-19). Retrieved September 14, 2020 from https://www.who.int/news-room/q-a-detail/q-a-coronaviruses",
      "doi": ""
    },
    {
      "text": "WHO. 2020. WHO Coronavirus Disease (COVID-19) Dashboard. Retrieved September 14, 2020 from hhttps://covid19.who.int/",
      "doi": ""
    },
    {
      "text": "Andrea Wiggins and Kevin Crowston. 2011. From conservation to crowdsourcing: A typology of citizen science. In 2011 44th Hawaii international conference on system sciences. IEEE, 1–10.",
      "doi": "10.1109/HICSS.2011.207"
    },
    {
      "text": "Wikimedia Foundation. 2020. COVID-19 apps. Retrieved September 14, 2020 from https://en.wikipedia.org/wiki/COVID-19_apps",
      "doi": ""
    },
    {
      "text": "Wikimedia Foundation. 2020. COVID Symptom Study. Retrieved September 14, 2020 from https://en.wikipedia.org/wiki/COVID_Symptom_Study",
      "doi": ""
    },
    {
      "text": "Wikimedia Foundation. 2020. COVIDSafe. Retrieved September 14, 2020 from https://en.wikipedia.org/wiki/COVIDSafe",
      "doi": ""
    },
    {
      "text": "Wikimedia Foundation. 2020. TraceTogether. Retrieved September 14, 2020 from https://en.wikipedia.org/wiki/TraceTogether",
      "doi": ""
    },
    {
      "text": "worldometers.info. 2020. COVID-19 Coronavirus Pandemic. Retrieved September 14, 2020 from https://www.worldometers.info/coronavirus/",
      "doi": ""
    },
    {
      "text": "zdf.de. 2020. RKI stellt App für Krankheitssymptome vor. Retrieved December 17, 2020 from https://www.zdf.de/nachrichten/panorama/coronavirus-rki-102.html",
      "doi": ""
    },
    {
      "text": "zdf.de. 2020. RKI veröffentlicht ”Corona-Datenspende” App. Retrieved December 17, 2020 from https://www.zdf.de/nachrichten/heute-19-uhr/videos/corona-datenspende-app-100.html",
      "doi": ""
    },
    {
      "text": "Zooniverse. 2020. Zooniverse. Retrieved September 14, 2020 from https://www.zooniverse.org/projects/zookeeper/galaxy-zoo/",
      "doi": ""
    }
  ]
}