{
  "doi": "10.1145/3411764.3445703",
  "title": "Super-Resolution Capacitive Touchscreens",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2021,
  "badges": [],
  "abstract": "Capacitive touchscreens are near-ubiquitous in today’s touch-driven devices, such as smartphones and tablets. By using rows and columns of electrodes, specialized touch controllers are able to capture a 2D image of capacitance at the surface of a screen. For over a decade, capacitive “pixels” have been around 4 millimeters in size – a surprisingly low resolution that precludes a wide range of interesting applications. In this paper, we show how super-resolution techniques, long used in fields such as biology and astronomy, can be applied to capacitive touchscreen data. By integrating data from many frames, our software-only process is able to resolve geometric details finer than the original sensor resolution. This opens the door to passive tangibles with higher-density fiducials and also recognition of every-day metal objects, such as keys and coins. We built several applications to illustrate the potential of our approach and report the findings of a multipart evaluation.",
  "authors": [
    {
      "name": "Sven Mayer",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99658696530/rel-imgonly/p_mayersven.jpg",
      "acmid": "99658696530",
      "orcid": "0000-0001-5462-8782"
    },
    {
      "name": "Xiangyu Xu",
      "institution": "Robotics Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701659",
      "orcid": "missing"
    },
    {
      "name": "Chris Harrison",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "Simon Baker and Takeo Kanade. 2002. Limits on super-resolution and how to break them. IEEE Transactions on Pattern Analysis and Machine Intelligence 24, 9(2002), 1167–1183. https://doi.org/10.1109/TPAMI.2002.1033210",
      "doi": "10.1109/TPAMI.2002.1033210"
    },
    {
      "text": "Eric Betzig, George H. Patterson, Rachid Sougrat, O. Wolf Lindwasser, Scott Olenych, Juan S. Bonifacino, Michael W. Davidson, Jennifer Lippincott-Schwartz, and Harald F. Hess. 2006. Imaging Intracellular Fluorescent Proteins at Nanometer Resolution. Science 313, 5793 (2006), 1642–1645. https://doi.org/10.1126/science.1127344",
      "doi": ""
    },
    {
      "text": "David S Bolme, J Ross Beveridge, Bruce A Draper, and Yui Man Lui. 2010. Visual object tracking using adaptive correlation filters. In 2010 IEEE Computer Society Conference on Computer Vision and Pattern Recognition(CVPR ’10). IEEE, 2544–2550. https://doi.org/10.1109/CVPR.2010.5539960",
      "doi": ""
    },
    {
      "text": "Roberto Brunelli. 2009. Template Matching Techniques in Computer Vision: Theory and Practice. John Wiley & Sons.",
      "doi": "10.5555/1643435"
    },
    {
      "text": "Liwei Chan, Stefanie Müller, Anne Roudaut, and Patrick Baudisch. 2012. CapStones and ZebraWidgets: Sensing Stacks of Building Blocks, Dials and Sliders on Capacitive Touch Screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2189–2192. https://doi.org/10.1145/2207676.2208371",
      "doi": "10.1145/2207676.2208371"
    },
    {
      "text": "Peter Dalsgaard and Kim Halskov. 2012. Tangible 3D Tabletops: Combining Tangible Tabletop Interaction and 3D Projection. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (Copenhagen, Denmark) (NordiCHI ’12). Association for Computing Machinery, New York, NY, USA, 109–118. https://doi.org/10.1145/2399016.2399033",
      "doi": "10.1145/2399016.2399033"
    },
    {
      "text": "Paul Dietz and Darren Leigh. 2001. DiamondTouch: A Multi-User Touch Technology. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (Orlando, Florida) (UIST ’01). Association for Computing Machinery, New York, NY, USA, 219–226. https://doi.org/10.1145/502348.502389",
      "doi": "10.1145/502348.502389"
    },
    {
      "text": "Chao Dong, Chen Change Loy, Kaiming He, and Xiaoou Tang. 2016. Image Super-Resolution Using Deep Convolutional Networks. IEEE Transactions on Pattern Analysis and Machine Intelligence 38, 2(2016), 295–307. https://doi.org/10.1109/TPAMI.2015.2439281",
      "doi": "10.1109/TPAMI.2015.2439281"
    },
    {
      "text": "Thibaud Ehret, Axel Davy, Pablo Arias, and Gabriele Facciolo. 2019. Joint Demosaicking and Denoising by Fine-Tuning of Bursts of Raw Images. In IEEE/CVF International Conference on Computer Vision(ICCV ’19). IEEE, 8867–8876. https://doi.org/10.1109/ICCV.2019.00896",
      "doi": ""
    },
    {
      "text": "Georgios D. Evangelidis and Emmanouil Z. Psarakis. 2008. Parametric Image Alignment Using Enhanced Correlation Coefficient Maximization. IEEE Transactions on Pattern Analysis and Machine Intelligence 30, 10(2008), 1858–1865. https://doi.org/10.1109/TPAMI.2008.113",
      "doi": "10.1109/TPAMI.2008.113"
    },
    {
      "text": "James R. Fienup. Fienup. 1997. Invariant error metrics for image reconstruction. Applied optics 36, 32 (Nov 1997), 8352–8357. https://doi.org/10.1364/AO.36.008352",
      "doi": ""
    },
    {
      "text": "Andrew W. Fitzgibbon and Robert B. Fisher. 1995. A Buyer’s Guide to Conic Fitting. In Proceedings of the 6th British conference on Machine vision(BMVC ’95, Vol. 2). BMVA Press, 513–522. https://doi.org/10.5244/C.9.51",
      "doi": ""
    },
    {
      "text": "George W. Fitzmaurice, Hiroshi Ishii, and William A. S. Buxton. 1995. Bricks: Laying the Foundations for Graspable User Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’95). ACM Press/Addison-Wesley Publishing Co., USA, 442–449. https://doi.org/10.1145/223904.223964",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Tom Goldstein and Stanley Osher. 2009. The split Bregman method for L1-regularized problems. SIAM Journal on Imaging Sciences 2 2 (2009), 323–343. https://doi.org/10.1137/080725891",
      "doi": ""
    },
    {
      "text": "Hayit Greenspan. 2008. Super-Resolution in Medical Imaging. Comput. J. 52, 1 (02 2008), 43–63. https://doi.org/10.1093/comjnl/bxm075",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew S. Reynolds, and Joshua R. Smith. 2017. Finding Common Ground: A Survey of Capacitive Sensing in Human-Computer Interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3293–3315. https://doi.org/10.1145/3025453.3025808",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Manuel Guizar-Sicairos, Samuel T. Thurman, and James R. Fienup. 2008. Efficient subpixel image registration algorithms. Opt. Lett. 33, 2 (Jan 2008), 156–158. https://doi.org/10.1364/OL.33.000156",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Robert Xiao, and Chris Harrison. 2015. CapAuth: Identifying and Differentiating User Handprints on Commodity Capacitive Touchscreens. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (Madeira, Portugal) (ITS ’15). Association for Computing Machinery, New York, NY, USA, 59–62. https://doi.org/10.1145/2817721.2817722",
      "doi": "10.1145/2817721.2817722"
    },
    {
      "text": "Nils Gustafsson, Siân Culley, George Ashdown, Dylan M. Owen, Pedro Matos Pereira, and Ricardo Henriques. 2016. Fast live-cell conventional fluorophore nanoscopy with ImageJ through super-resolution radial fluctuations. Nature Communications 7, 1 (12 Aug 2016), 12471. https://doi.org/10.1038/ncomms12471",
      "doi": ""
    },
    {
      "text": "Changyo Han, Katsufumi Matsui, and Takeshi Naemura. 2020. ForceStamps: Fiducial Markers for Pressure-Sensitive Touch Surfaces to Support Rapid Prototyping of Physical Control Interfaces. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction (Sydney NSW, Australia) (TEI ’20). Association for Computing Machinery, New York, NY, USA, 273–285. https://doi.org/10.1145/3374920.3374924",
      "doi": "10.1145/3374920.3374924"
    },
    {
      "text": "David Held, Sebastian Thrun, and Silvio Savarese. 2016. Learning to Track at 100 FPS with Deep Regression Networks. In Computer Vision – ECCV 2016(ECCV ’16), Bastian Leibe, Jiri Matas, Nicu Sebe, and Max Welling(Eds.). Springer International Publishing, Cham, 749–765. https://doi.org/10.1007/978-3-319-46448-0_45 arXiv:1604.01802",
      "doi": ""
    },
    {
      "text": "Christian Holz, Senaka Buthpitiya, and Marius Knaust. 2015. Bodyprint: Biometric User Identification on Mobile Devices Using the Capacitive Touchscreen to Scan Body Parts. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3011–3014. https://doi.org/10.1145/2702123.2702518",
      "doi": "10.1145/2702123.2702518"
    },
    {
      "text": "Mareki Honma, Kazunori Akiyama, Makoto Uemura, and Shiro Ikeda. 2014. Super-resolution imaging with radio interferometry using sparse modeling. Publications of the Astronomical Society of Japan 66, 5 (09 2014), 14. https://doi.org/10.1093/pasj/psu070 95.",
      "doi": ""
    },
    {
      "text": "Hsieh Hou and H. Andrews. 1978. Cubic splines for image interpolation and digital filtering. IEEE Transactions on Acoustics, Speech, and Signal Processing 26, 6(1978), 508–517. https://doi.org/10.1109/TASSP.1978.1163154",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’97). Association for Computing Machinery, New York, NY, USA, 234–241. https://doi.org/10.1145/258549.258715",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Zdenek Kalal, Krystian Mikolajczyk, and Jiri Matas. 2010. Forward-Backward Error: Automatic Detection of Tracking Failures. In Proceedings of the 20th International Conference on Pattern Recognition(ICPR ’10). IEEE, 2756–2759. https://doi.org/10.1109/ICPR.2010.675",
      "doi": "10.1109/ICPR.2010.675"
    },
    {
      "text": "Martin Kaltenbrunner and Ross Bencina. 2007. ReacTIVision: A Computer-Vision Framework for Table-Based Tangible Interaction. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction(Baton Rouge, Louisiana) (TEI ’07). Association for Computing Machinery, New York, NY, USA, 69–74. https://doi.org/10.1145/1226969.1226983",
      "doi": "10.1145/1226969.1226983"
    },
    {
      "text": "Levon Khachatryan. 2019. Centroid Based Object Tracking. https://github.com/lev1khachatryan/Centroid-Based_Object_Tracking.",
      "doi": ""
    },
    {
      "text": "Sven Kratz, Tilo Westermann, Michael Rohs, and Georg Essl. 2011. CapWidgets: Tangile Widgets versus Multi-Touch Controls on Mobile Devices. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 1351–1356. https://doi.org/10.1145/1979742.1979773",
      "doi": "10.1145/1979742.1979773"
    },
    {
      "text": "Abinaya Kumar, Aishwarya Radjesh, Sven Mayer, and Huy Viet Le. 2019. Improving the Input Accuracy of Touchscreens Using Deep Learning. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312928",
      "doi": "10.1145/3290607.3312928"
    },
    {
      "text": "Huy Viet Le, Thomas Kosch, Patrick Bader, Sven Mayer, and Niels Henze. 2018. PalmTouch: Using the Palm as an Additional Input Modality on Commodity Smartphones. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173934",
      "doi": "10.1145/3173574.3173934"
    },
    {
      "text": "Huy Viet Le, Sven Mayer, and Niels Henze. 2018. InfiniTouch: Finger-Aware Interaction on Fully Touch Sensitive Smartphones. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology(Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 779–792. https://doi.org/10.1145/3242587.3242605",
      "doi": "10.1145/3242587.3242605"
    },
    {
      "text": "Huy Viet Le, Sven Mayer, and Niels Henze. 2019. Investigating the Feasibility of Finger Identification on Capacitive Touchscreens Using Deep Learning. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 637–649. https://doi.org/10.1145/3301275.3302295",
      "doi": "10.1145/3301275.3302295"
    },
    {
      "text": "Rong-Hao Liang, Han-Chih Kuo, Liwei Chan, De-Nian Yang, and Bing-Yu Chen. 2014. GaussStones: Shielded Magnetic Tangibles for Multi-Token Interactions on Portable Displays. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology (Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 365–372. https://doi.org/10.1145/2642918.2647384",
      "doi": "10.1145/2642918.2647384"
    },
    {
      "text": "Zhouchen Lin and Heung-Yeung Shum. 2004. Fundamental limits of reconstruction-based superresolution algorithms under local translation. IEEE Transactions on Pattern Analysis and Machine Intelligence 26, 1(2004), 83–97. https://doi.org/10.1109/TPAMI.2004.1261081",
      "doi": "10.1109/TPAMI.2004.1261081"
    },
    {
      "text": "Sven Mayer, Huy Viet Le, and Niels Henze. 2017. Estimating the Finger Orientation on Capacitive Touchscreens Using Convolutional Neural Networks. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (Brighton, United Kingdom) (ISS ’17). Association for Computing Machinery, New York, NY, USA, 220–229. https://doi.org/10.1145/3132272.3134130",
      "doi": "10.1145/3132272.3134130"
    },
    {
      "text": "Microsoft Corporation. 2008 (accessed December 13, 2020). PixelSense. Microsoft Corporation. https://en.wikipedia.org/wiki/Microsoft_PixelSense",
      "doi": ""
    },
    {
      "text": "Viet Nguyen, Siddharth Rupavatharam, Luyang Liu, Richard Howard, and Marco Gruteser. 2019. HandSense: Capacitive Coupling-Based Dynamic, Micro Finger Gesture Recognition. In Proceedings of the 17th Conference on Embedded Networked Sensor Systems (New York, New York) (SenSys ’19). Association for Computing Machinery, New York, NY, USA, 285–297. https://doi.org/10.1145/3356250.3360040",
      "doi": "10.1145/3356250.3360040"
    },
    {
      "text": "Alex Olwal and Andrew D. Wilson. 2008. SurfaceFusion: Unobtrusive Tracking of Everyday Objects in Tangible User Interfaces. In Proceedings of Graphics Interface 2008 (Windsor, Ontario, Canada) (GI ’08). Canadian Information Processing Society, CAN, 235–242.",
      "doi": ""
    },
    {
      "text": "Esben Warming Pedersen and Kasper Hornbæk. 2011. Tangible Bots: Interaction with Active Tangibles in Tabletop Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2975–2984. https://doi.org/10.1145/1978942.1979384",
      "doi": "10.1145/1978942.1979384"
    },
    {
      "text": "Klaus G. Puschmann and Franz Kneer. 2005. On super-resolution in astronomical imaging. Astronomy & Astrophysics 436, 1 (2005), 373–378. https://doi.org/10.1051/0004-6361:20042320",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto. 2002. SmartSkin: An Infrastructure for Freehand Manipulation on Interactive Surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Minneapolis, Minnesota, USA) (CHI ’02). Association for Computing Machinery, New York, NY, USA, 113–120. https://doi.org/10.1145/503376.503397",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Adrian Rosebrock. 2018. Simple object tracking with OpenCV. https://www.pyimagesearch.com/2018/07/23/simple-object-tracking-with-opencv/.",
      "doi": ""
    },
    {
      "text": "Martin Schmitz, Jürgen Steimle, Jochen Huber, Niloofar Dezfuli, and Max Mühlhäuser. 2017. Flexibles: Deformation-Aware 3D-Printed Tangibles for Capacitive Touchscreens. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1001–1014. https://doi.org/10.1145/3025453.3025663",
      "doi": "10.1145/3025453.3025663"
    },
    {
      "text": "Jack Sklansky. 1982. Finding the Convex Hull of a Simple Polygon. Pattern Recogn. Lett. 1, 2 (Dec. 1982), 79–83. https://doi.org/10.1016/0167-8655(82)90016-2",
      "doi": "10.1016/0167-8655%2882%2990016-2"
    },
    {
      "text": "Satoshi Suzuki and Keiicji Abe. 1985. Topological structural analysis of digitized binary images by border following. Computer Vision, Graphics, and Image Processing 30, 1(1985), 32 – 46. https://doi.org/10.1016/0734-189X(85)90016-7",
      "doi": ""
    },
    {
      "text": "Godfried T. Toussaint. 1983. Solving geometric problems with the rotating calipers. In Proc. IEEE Melecon, Vol. 83. IEEE, A10.",
      "doi": ""
    },
    {
      "text": "Brygg Ullmer and Hiroshi Ishii. 1997. The MetaDESK: Models and Prototypes for Tangible User Interfaces. In Proceedings of the 10th Annual ACM Symposium on User Interface Software and Technology (Banff, Alberta, Canada) (UIST ’97). Association for Computing Machinery, New York, NY, USA, 223–232. https://doi.org/10.1145/263407.263551",
      "doi": "10.1145/263407.263551"
    },
    {
      "text": "John Underkoffler and Hiroshi Ishii. 1999. Urp: A Luminous-Tangible Workbench for Urban Planning and Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Pittsburgh, Pennsylvania, USA) (CHI ’99). Association for Computing Machinery, New York, NY, USA, 386–393. https://doi.org/10.1145/302979.303114",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Nicolas Villar, Daniel Cletheroe, Greg Saul, Christian Holz, Tim Regan, Oscar Salandin, Misha Sra, Hui-Shyong Yeo, William Field, and Haiyan Zhang. 2018. Project Zanzibar: A Portable and Flexible Tangible Interaction Platform. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174089",
      "doi": "10.1145/3173574.3174089"
    },
    {
      "text": "Simon Voelker, Christian Cherek, Jan Thar, Thorsten Karrer, Christian Thoresen, Kjell Ivar Øvergård, and Jan Borchers. 2015. PERCs: Persistently Trackable Tangibles on Capacitive Multi-Touch Displays. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 351–356. https://doi.org/10.1145/2807442.2807466",
      "doi": "10.1145/2807442.2807466"
    },
    {
      "text": "Simon Voelker, Kosuke Nakajima, Christian Thoresen, Yuichi Itoh, Kjell Ivar Øvergård, and Jan Borchers. 2013. PUCs: Detecting Transparent, Passive Untouched Capacitive Widgets on Unmodified Multi-Touch Displays. In Proceedings of the 2013 ACM International Conference on Interactive Tabletops and Surfaces (St. Andrews, Scotland, United Kingdom) (ITS ’13). Association for Computing Machinery, New York, NY, USA, 101–104. https://doi.org/10.1145/2512349.2512791",
      "doi": "10.1145/2512349.2512791"
    },
    {
      "text": "Geoff Walker. 2012. A review of technologies for sensing contact location on the surface of a display. Journal of the Society for Information Display 20, 8 (2012), 413–440. https://doi.org/10.1002/jsid.100",
      "doi": ""
    },
    {
      "text": "John Wang and Edwin Olson. 2016. AprilTag 2: Efficient and robust fiducial detection. In RSJ International Conference on Intelligent Robots and Systems (IROS)(IROS ’16). IEEE, 4193–4198. https://doi.org/10.1109/IROS.2016.7759617",
      "doi": "10.1109/IROS.2016.7759617"
    },
    {
      "text": "Yilun Wang, Junfeng Yang, Wotao Yin, and Yin Zhang. 2008. A new alternating minimization algorithm for total variation image reconstruction. SIAM Journal on Imaging Sciences 1, 3 (2008), 248–272. https://doi.org/10.1137/080724265",
      "doi": "10.1137/080724265"
    },
    {
      "text": "Frederick W. Wheeler, Xiaoming Liu, and Peter H. Tu. 2007. Multi-Frame Super-Resolution for Face Recognition. In First IEEE International Conference on Biometrics: Theory, Applications, and Systems. IEEE, 1–6. https://doi.org/10.1109/BTAS.2007.4401949",
      "doi": ""
    },
    {
      "text": "Andrew D. Wilson and Raman Sarin. 2007. BlueTable: Connecting Wireless Mobile Devices on Interactive Surfaces Using Vision-Based Handshaking. In Proceedings of Graphics Interface 2007 (Montreal, Canada) (GI ’07). Association for Computing Machinery, New York, NY, USA, 119–125. https://doi.org/10.1145/1268517.1268539",
      "doi": ""
    },
    {
      "text": "Bartlomiej Wronski, Ignacio Garcia-Dorado, Manfred Ernst, Damien Kelly, Michael Krainin, Chia-Kai Liang, Marc Levoy, and Peyman Milanfar. 2019. Handheld Multi-Frame Super-Resolution. ACM Trans. Graph. 38, 4, Article 28 (July 2019), 18 pages. https://doi.org/10.1145/3306346.3323024",
      "doi": "10.1145/3306346.3323024"
    },
    {
      "text": "Robert Xiao, Scott Hudson, and Chris Harrison. 2016. CapCam: Enabling Rapid, Ad-Hoc, Position-Tracked Interactions Between Devices. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces(Niagara Falls, Ontario, Canada) (ISS ’16). Association for Computing Machinery, New York, NY, USA, 169–178. https://doi.org/10.1145/2992154.2992182",
      "doi": "10.1145/2992154.2992182"
    },
    {
      "text": "Robert Xiao, Julia Schwarz, and Chris Harrison. 2015. Estimating 3D Finger Angle on Commodity Touchscreens. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces (Madeira, Portugal) (ITS ’15). Association for Computing Machinery, New York, NY, USA, 47–50. https://doi.org/10.1145/2817721.2817737",
      "doi": "10.1145/2817721.2817737"
    },
    {
      "text": "Li Xu, Cewu Lu, Yi Xu, and Jiaya Jia. 2011. Image Smoothing via L0 Gradient Minimization. In Proceedings of the 2011 SIGGRAPH Asia Conference(Hong Kong, China) (SA ’11). Association for Computing Machinery, New York, NY, USA, Article 174, 12 pages. https://doi.org/10.1145/2024156.2024208",
      "doi": "10.1145/2024156.2024208"
    },
    {
      "text": "Li Xu, Shicheng Zheng, and Jiaya Jia. 2013. Unnatural L0 Sparse Representation for Natural Image Deblurring. In IEEE Conference on Computer Vision and Pattern Recognition(CVPR ’13). IEEE, 1107–1114. https://doi.org/10.1109/CVPR.2013.147",
      "doi": "10.1109/CVPR.2013.147"
    },
    {
      "text": "Xiangyu Xu, Yongrui Ma, and Wenxiu Sun. 2019. Towards Real Scene Super-Resolution With Raw Images. In Conference on Computer Vision and Pattern Recognition(CVPR ’19). IEEE, 1723–1731. https://doi.org/10.1109/CVPR.2019.00182",
      "doi": ""
    },
    {
      "text": "Mehrdad Yaghoobi, Stephen McLaughlin, and Mike E Davies. 2013. Super-resolution Sparse Projected Capacitive Multitouch Sensing. IET Conference Proceedings, 1.3–1.3(1). https://doi.org/10.1049/cp.2013.2041",
      "doi": ""
    },
    {
      "text": "Jianchao Yang, John Wright, Thomas S. Huang, and Yi Ma. 2010. Image Super-Resolution Via Sparse Representation. IEEE Transactions on Image Processing 19, 11 (2010), 2861–2873. https://doi.org/10.1109/TIP.2010.2050625",
      "doi": "10.1109/TIP.2010.2050625"
    },
    {
      "text": "Alper Yilmaz, Omar Javed, and Mubarak Shah. 2006. Object Tracking: A Survey. Comput. Surveys 38, 4 (Dec. 2006), 13–es. https://doi.org/10.1145/1177352.1177355",
      "doi": "10.1145/1177352.1177355"
    },
    {
      "text": "Neng-Hao Yu, Li-Wei Chan, Seng Yong Lau, Sung-Sheng Tsai, I-Chun Hsiao, Dian-Je Tsai, Fang-I Hsiao, Lung-Pan Cheng, Mike Chen, Polly Huang, and Yi-Ping Hung. 2011. TUIC: Enabling Tangible Interaction on Capacitive Multi-Touch Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2995–3004. https://doi.org/10.1145/1978942.1979386",
      "doi": "10.1145/1978942.1979386"
    },
    {
      "text": "Yang Zhang, Wolf Kienzle, Yanjun Ma, Shiu S. Ng, Hrvoje Benko, and Chris Harrison. 2019. ActiTouch: Robust Touch Detection for On-Skin AR/VR Interfaces. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1151–1159. https://doi.org/10.1145/3332165.3347869",
      "doi": "10.1145/3332165.3347869"
    }
  ]
}