{
  "doi": "10.1145/3411764.3445644",
  "title": "Tactile Compass: Enabling Visually Impaired People to Follow a Path with Continuous Directional Feedback",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Accurate and effective directional feedback is crucial for an electronic traveling aid device that guides visually impaired people in walking through paths. This paper presents Tactile Compass, a hand-held device that provides continuous directional feedback with a rotatable needle pointing toward the planned direction. We conducted two lab studies to evaluate the effectiveness of the feedback solution. Results showed that, using Tactile Compass, participants could reach the target direction in place with a mean deviation of 3.03° and could smoothly navigate along paths of 60cm width, with a mean deviation from the centerline of 12.1cm. Subjective feedback showed that Tactile Compass was easy to learn and use.",
  "tags": [
    "accessibility",
    "path-following tasks",
    "tactile directional feedback"
  ],
  "authors": [
    {
      "name": "Guanhong Liu",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366384",
      "orcid": "0000-0002-3266-2178"
    },
    {
      "name": "Tianyu Yu",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528656",
      "orcid": "0000-0003-0609-0994"
    },
    {
      "name": "Chun Yu",
      "institution": "Department of Computer science and Technology Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467660483",
      "orcid": "0000-0003-2591-7993"
    },
    {
      "name": "Haiqing Xu",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702024",
      "orcid": "0000-0002-6933-2156"
    },
    {
      "name": "Shuchang Xu",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474913",
      "orcid": "missing"
    },
    {
      "name": "Ciyuan Yang",
      "institution": "Department of Computer Science and Technology Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659576898",
      "orcid": "missing"
    },
    {
      "name": "Feng Wang",
      "institution": "Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366708",
      "orcid": "missing"
    },
    {
      "name": "Haipeng Mi",
      "institution": "Tsinghua University, China",
      "img": "/do/10.1145/contrib-81453645353/rel-imgonly/mismall.jpg",
      "acmid": "81453645353",
      "orcid": "0000-0003-0560-4228"
    },
    {
      "name": "Yuanchun Shi",
      "institution": "Department of Computer science and Technology Tsinghua University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100647319",
      "orcid": "0000-0003-2273-6927"
    }
  ],
  "references": [
    {
      "text": "Dragan Ahmetovic, Cole Gleason, Chengxiong Ruan, Kris Kitani, Hironobu Takagi, and Chieko Asakawa. 2016. NavCog: a navigational cognitive assistant for the blind. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services. 90–99.",
      "doi": "10.1145/2935334.2935361"
    },
    {
      "text": "Tomohiro Amemiya. 2009. Haptic Direction Indicator for Visually Impaired People Based on Pseudo-Attraction Force. e-Minds 1(2009).",
      "doi": ""
    },
    {
      "text": "Tomohiro Amemiya and Hisashi Sugiyama. 2008. Design of a Haptic Direction Indicator for Visually Impaired People in Emergency Situations. (2008), 1141–1144.",
      "doi": ""
    },
    {
      "text": "T. Ando, R. Tsukahara, M. Seki, and M. G. Fujie. 2012. A Haptic Interface “Force Blinker 2” for Navigation of the Visually Impaired. IEEE Transactions on Industrial Electronics 59, 11 (Nov 2012), 4112–4119. https://doi.org/10.1109/TIE.2011.2173894",
      "doi": ""
    },
    {
      "text": "Michele Antolini, Monica Bordegoni, and Umberto Cugini. 2011. A haptic direction indicator using the gyro effect. 2011 IEEE World Haptics Conference(2011), 251–256.",
      "doi": ""
    },
    {
      "text": "Shiri Azenkot, Richard E. Ladner, and Jacob O. Wobbrock. 2011. Smartphone Haptic Feedback for Nonvisual Wayfinding. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility(Dundee, Scotland, UK) (ASSETS ’11). Association for Computing Machinery, New York, NY, USA, 281–282. https://doi.org/10.1145/2049536.2049607",
      "doi": ""
    },
    {
      "text": "Jeffrey R. Blum, Mathieu Bouchard, and Jeremy R. Cooperstock. 2011. What’s around Me? Spatialized Audio Augmented Reality for Blind Users with a Smartphone. (2011).",
      "doi": ""
    },
    {
      "text": "M Bouzit, A Chaibi, KJ De Laurentis, and C Mavroidis. 2004. Tactile feedback navigation handle for the visually impaired. In ASME 2004 International Mechanical Engineering Congress and Exposition. American Society of Mechanical Engineers Digital Collection, 1171–1177.",
      "doi": ""
    },
    {
      "text": "Carlos Campos, Richard Elvira, Juan J Gómez Rodríguez, José MM Montiel, and Juan D Tardós. 2020. ORB-SLAM3: An accurate open-source library for visual, visual-inertial and multi-map SLAM. arXiv preprint arXiv:2007.11898(2020).",
      "doi": ""
    },
    {
      "text": "A. Cassinelli, C. Reynolds, and M. Ishikawa. 2006. Augmenting spatial awareness with Haptic Radar. In 2006 10th IEEE International Symposium on Wearable Computers. 61–64. https://doi.org/10.1109/ISWC.2006.286344",
      "doi": ""
    },
    {
      "text": "Jan BF Van Erp, Hendrik AHC Van Veen, Chris Jansen, and Trevor Dobbins. 2005. Waypoint navigation with a vibrotactile waist belt. ACM Transactions on Applied Perception (TAP) 2, 2 (2005), 106–117.",
      "doi": "10.1145/1060581.1060585"
    },
    {
      "text": "Hugo Fernandes, Paulo Costa, Vitor Filipe, Hugo Paredes, and João Barroso. 2019. A Review of Assistive Spatial Orientation and Navigation Technologies for the Visually Impaired. Univers. Access Inf. Soc. 18, 1 (March 2019), 155–168. https://doi.org/10.1007/s10209-017-0570-8",
      "doi": "10.1007/s10209-017-0570-8"
    },
    {
      "text": "Alexander Fiannaca, Ilias Apostolopoulous, and Eelke Folmer. 2014. Headlock: a wearable navigation aid that helps blind cane users traverse large open spaces. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. 19–26.",
      "doi": "10.1145/2661334.2661344"
    },
    {
      "text": "G. Flores, S. Kurniawan, R. Manduchi, E. Martinson, L. M. Morales, and E. A. Sisbot. 2015. Vibrotactile Guidance for Wayfinding of Blind Walkers. IEEE Transactions on Haptics 8, 3 (2015), 306–317.",
      "doi": "10.1109/TOH.2015.2409980"
    },
    {
      "text": "João Guerreiro, Dragan Ahmetovic, Daisuke Sato, Kris Kitani, and Chieko Asakawa. 2019. Airport accessibility and navigation assistance for people with visual impairments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300246"
    },
    {
      "text": "João Guerreiro, Daisuke Sato, Saki Asakawa, Huixu Dong, Kris M Kitani, and Chieko Asakawa. 2019. CaBot: Designing and Evaluating an Autonomous Navigation Robot for Blind People. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 68–82.",
      "doi": "10.1145/3308561.3353771"
    },
    {
      "text": "Wilko Heuten, Niels Henze, Susanne Boll, and Martin Pielot. 2008. Tactile Wayfinder: A Non-Visual Support System for Wayfinding. In Proceedings of the 5th Nordic Conference on Human-Computer Interaction: Building Bridges (Lund, Sweden) (NordiCHI ’08). Association for Computing Machinery, New York, NY, USA, 172–181. https://doi.org/10.1145/1463160.1463179",
      "doi": "10.1145/1463160.1463179"
    },
    {
      "text": "Slim Kammoun, Wahiba Bouhani, and Mohamed Jemni. 2015. Sole Based Tactile Information Display for Visually Impaired Pedestrian Navigation. In Proceedings of the 8th ACM International Conference on PErvasive Technologies Related to Assistive Environments (Corfu, Greece) (PETRA ’15). Association for Computing Machinery, New York, NY, USA, Article 31, 4 pages. https://doi.org/10.1145/2769493.2769561",
      "doi": "10.1145/2769493.2769561"
    },
    {
      "text": "Slim Kammoun, Christophe Jouffrais, Tiago Guerreiro, Hugo Nicolau, and Joaquim Jorge. 2012. Guiding blind people with haptic feedback. Frontiers in Accessibility for Pervasive Computing (Pervasive 2012) 3 (2012).",
      "doi": ""
    },
    {
      "text": "Brian F. G. Katz, Slim Kammoun, Gatan Parseihian, Olivier Gutierrez, Adrien Brilhault, Malika Auvray, Philippe Truillet, Michel Denis, Simon Thorpe, and Christophe Jouffrais. 2012. NAVIG: augmented reality guidance system for the visually impaired. Virtual Reality 16, 4 (2012), 253–269.",
      "doi": "10.1007/s10055-012-0213-6"
    },
    {
      "text": "L. Kay. 1974. A sonar aid to enhance spatial perception of the blind: engineering design and evaluation. Radio & Electronic Engineer 44, 11 (1974), 605–627.",
      "doi": ""
    },
    {
      "text": "Vladimir Kulyukin, Chaitanya Gharpure, John Nicholson, and Sachin Pavithran. 2004. RFID in robot-assisted indoor navigation for the visually impaired. In 2004 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)(IEEE Cat. No. 04CH37566), Vol. 2. IEEE, 1979–1984.",
      "doi": ""
    },
    {
      "text": "Peng Li, Cai-yun Yang, Rui Wang, and Shuo Wang. 2020. A high-efficiency, information-based exploration path planning method for active simultaneous localization and mapping. International Journal of Advanced Robotic Systems 17, 1 (2020), 1729881420903207.",
      "doi": ""
    },
    {
      "text": "Ming-Wei Lin, Yun-Maw Cheng, and Wai Yu. 2008. Using Tactons to Provide Navigation Cues in Pedestrian Situations. In Proceedings of the 5th Nordic Conference on Human-Computer Interaction: Building Bridges (Lund, Sweden) (NordiCHI ’08). Association for Computing Machinery, New York, NY, USA, 507–510. https://doi.org/10.1145/1463160.1463231",
      "doi": "10.1145/1463160.1463231"
    },
    {
      "text": "D. Ni, L. Wang, Y. Ding, J. Zhang, A. Song, and J. Wu. 2013. The design and implementation of a walking assistant system with vibrotactile indication and voice prompt for the visually impaired. In 2013 IEEE International Conference on Robotics and Biomimetics (ROBIO). 2721–2726.",
      "doi": ""
    },
    {
      "text": "Vanessa Petrausch, Thorsten Schwarz, and Rainer Stiefelhagen. 2018. Prototype Development of a Low-Cost Vibro-Tactile Navigation Aid for the Visually Impaired. (2018), 63–69.",
      "doi": ""
    },
    {
      "text": "Martin Pielot, Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2012. PocketNavigator: studying tactile navigation systems in-situ. (2012), 3131–3140.",
      "doi": ""
    },
    {
      "text": "Martin Pielot, Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2012. PocketNavigator: Studying Tactile Navigation Systems in-Situ. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 3131–3140. https://doi.org/10.1145/2207676.2208728",
      "doi": "10.1145/2207676.2208728"
    },
    {
      "text": "Sonja Rümelin, Enrico Rukzio, and Robert Hardy. 2011. NaviRadar: A Novel Tactile Information Display for Pedestrian Navigation. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 293–302. https://doi.org/10.1145/2047196.2047234",
      "doi": "10.1145/2047196.2047234"
    },
    {
      "text": "Dongseok Ryu, Gi-Hun Yang, and Sungchul Kang. 2012. T-Hive: Bilateral Haptic Interface Using Vibrotactile Cues for Presenting Spatial Information. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews) 42(2012), 1318–1325.",
      "doi": "10.1109/TSMCC.2011.2182647"
    },
    {
      "text": "Daisuke Sato, Uran Oh, Kakuya Naito, Hironobu Takagi, Kris Kitani, and Chieko Asakawa. 2017. NavCog3: An evaluation of a smartphone-based blind indoor navigation assistant with semantic features in a large-scale environment. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. 270–279.",
      "doi": "10.1145/3132525.3132535"
    },
    {
      "text": "Adam J. Spier and Aaron M. Dollar. 2017. Design and Evaluation of Shape-Changing Haptic Interfaces for Pedestrian Navigation Assistance. IEEE Transactions on Haptics(2017).",
      "doi": ""
    },
    {
      "text": "Adam Spiers, Aaron Dollar, Janet Van Der Linden, and Maria Oshodi. 2015. First validation of the haptic sandwich: A shape changing handheld haptic navigation aid. In 2015 International Conference on Advanced Robotics (ICAR). IEEE, 144–151.",
      "doi": ""
    },
    {
      "text": "Adam J Spiers and Aaron M Dollar. 2016. Design and evaluation of shape-changing haptic interfaces for pedestrian navigation assistance. IEEE transactions on haptics 10, 1 (2016), 17–28.",
      "doi": ""
    },
    {
      "text": "Adam J. Spiers and Aaron M. Dollar. 2016. Outdoor pedestrian navigation assistance with a shape-changing haptic interface and comparison with a vibrotactile device. In 2016 IEEE Haptics Symposium (HAPTICS).",
      "doi": ""
    },
    {
      "text": "Adam J. Spiers, Janet Van Der Linden, Maria Oshodi, and Aaron M. Dollar. 2016. Development and Experimental Validation of a Minimalistic Shape Changing Haptic Navigation Device. In 2016 IEEE International Conference on Robotics and Automation (ICRA).",
      "doi": "10.1109/ICRA.2016.7487430"
    },
    {
      "text": "Adam J. Spiers, Janet van der Linden, Sarah Wiseman, and Maria Oshodi. 2018. Testing a Shape-Changing Haptic Navigation Device With Vision-Impaired and Sighted Audiences in an Immersive Theater Setting. IEEE Transactions on Human-Machine Systems PP, 99 (2018), 1–12.",
      "doi": ""
    },
    {
      "text": "Kazuteru Tobita, Katsuyuki Sagayama, and Hironori Ogawa. 2017. Examination of a Guidance Robot for Visually Impaired People. Journal of Robotics and Mechatronics 29, 4 (2017), 720–727.",
      "doi": ""
    },
    {
      "text": "Koji Tsukada and Michiaki Yasumura. 2004. ActiveBelt: Belt-Type Wearable Tactile Display for Directional Navigation. ubiquitous computing(2004), 384–399.",
      "doi": ""
    },
    {
      "text": "A. Wachaja, P. Agarwal, M. Zink, M. R. Adame, K. Möller, and W. Burgard. 2015. Navigating blind people with a smart walker. In 2015 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). 6014–6019.",
      "doi": ""
    },
    {
      "text": "Shuchang Xu, Ciyuan Yang, Wenhao Ge, Chun Yu, and Yuanchun Shi. 2020. Virtual Paving: Rendering a Smooth Path for People with Visual Impairment through Vibrotactile and Audio Feedback. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 3, Article 99 (Sept. 2020), 25 pages. https://doi.org/10.1145/3411814",
      "doi": "10.1145/3411814"
    },
    {
      "text": "Gi-Hun Yang, Dongseok Ryu, and Sungchul Kang. 2009. Vibrotactile display for hand-held input device providing spatial and directional information. World Haptics 2009 - Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems (2009), 79–84.",
      "doi": "10.1109/WHC.2009.4810831"
    },
    {
      "text": "Gi-Hun Yang, Moon sub Jin, Yeonsub Jin, and Sungchul Kang. 2010. T-mobile: Vibrotactile display pad with spatial and directional information for hand-held device. 2010 IEEE/RSJ International Conference on Intelligent Robots and Systems (2010), 5245–5250.",
      "doi": ""
    },
    {
      "text": "Yuhang Zhao, Cynthia L. Bennett, Hrvoje Benko, Edward Cutrell, Christian Holz, Meredith Ringel Morris, and Mike Sinclair. 2018. Enabling People with Visual Impairments to Navigate Virtual Reality with a Haptic and Auditory Cane Simulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173690",
      "doi": "10.1145/3173574.3173690"
    },
    {
      "text": "Yuhang Zhao, Elizabeth Kupferstein, Hathaitorn Rojnirun, Leah Findlater, and Shiri Azenkot. 2020. The Effectiveness of Visual and Audio Wayfinding Guidance on Smartglasses for People with Low Vision. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376516",
      "doi": "10.1145/3313831.3376516"
    }
  ]
}