{
  "doi": "10.1145/3411764.3445242",
  "title": "Understanding Blind Screen-Reader Users’ Experiences of Digital Artboards",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2021,
  "badges": [],
  "abstract": "Two-dimensional canvases are the core components of many digital productivity and creativity tools, with “artboards” containing objects rather than pixels. Unfortunately, the contents of artboards remain largely inaccessible to blind users relying on screen-readers, but the precise problems are not well understood. This study sought to understand how blind screen-reader users interact with artboards. Specifically, we conducted contextual interviews, observations, and task-based usability studies with 15 blind participants to understand their experiences of artboards found in Microsoft PowerPoint, Apple Keynote, and Google Slides. Participants expressed that the inaccessibility of these artboards contributes to significant educational and professional barriers. We found that the key problems faced were: (1) high cognitive loads from a lack of feedback about artboard contents and object state; (2) difficulty determining relationships among artboard objects; and (3) constant uncertainty about whether object manipulations were successful. We offer design remedies that improve feedback for object state, relationships, and manipulations.",
  "tags": [
    "blind and low-vision users.",
    "usability",
    "art and design programs",
    "accessibility",
    "creativity applications",
    "Computers and creativity"
  ],
  "authors": [
    {
      "name": "Anastasia Schaadhardt",
      "institution": "Information School, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700586",
      "orcid": "0000-0002-8831-368X"
    },
    {
      "name": "Alexis Hiniker",
      "institution": "Information School, University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "82258949157",
      "orcid": "0000-0003-1607-0778"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "Information School, University of Washington, United States",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "A. Awada, Y. B. Issa, C. Ghannam, J. Tekli, and R. Chbeir. 2012. Towards Digital Image Accessibility for Blind Users Via Vibrating Touch Screen: A Feasibility Test Protocol. In 2012 Eighth International Conference on Signal Image Technology and Internet Based Systems. IEEE, Naples, 547–554. https://doi.org/10.1109/SITIS.2012.85 Meeting Name: 2012 Eighth International Conference on Signal-Image Technology & Internet-Based Systems (SITIS 2012) Reporter: 2012 Eighth International Conference on Signal Image Technology and Internet Based Systems.",
      "doi": ""
    },
    {
      "text": "Amine Awada, Youssef Bou Issa, Joe Tekli, and Richard Chbeir. 2013. Evaluation of touch screen vibration accessibility for blind users. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS ’13. ACM Press, Bellevue, Washington, 1–2. https://doi.org/10.1145/2513383.2513430 Meeting Name: the 15th International ACM SIGACCESS Conference Reporter: Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility - ASSETS ’13.",
      "doi": ""
    },
    {
      "text": "Albert Bandura. 2010. Self-efficacy. The Corsini encyclopedia of psychology(2010), 1–3.",
      "doi": ""
    },
    {
      "text": "Sandra Bardot, Marcos Serrano, and Christophe Jouffrais. 2016. From tactile to virtual: using a smartwatch to improve spatial map exploration for visually impaired users. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI ’16. ACM Press, Florence, Italy, 100–111. https://doi.org/10.1145/2935334.2935342 Meeting Name: the 18th International Conference Reporter: Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI ’16.",
      "doi": ""
    },
    {
      "text": "Cynthia L Bennett, Erin Brady, and Stacy M Branham. 2018. Interdependence as a frame for assistive technology research and design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. 161–173.",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Jeffrey P Bigham, Irene Lin, and Saiph Savage. 2017. The Effects of” Not Knowing What You Don’t Know” on Web Accessibility for Blind Web Users. In Proceedings of the 19th international ACM SIGACCESS conference on computers and accessibility. 101–109.",
      "doi": "10.1145/3132525.3132533"
    },
    {
      "text": "Pranjal Protim Borah and Keyur Sorathia. 2019. Direct observation of tactile geometric drawing by visually impaired and blind students. In Proceedings of the 10th Indian Conference on Human-Computer Interaction - IndiaHCI ’19. ACM Press, Hyderabad, India, 1–10. https://doi.org/10.1145/3364183.3364185 Meeting Name: the 10th Indian Conference Reporter: Proceedings of the 10th Indian Conference on Human-Computer Interaction - IndiaHCI ’19.",
      "doi": ""
    },
    {
      "text": "Jens Bornschein. 2016. Digital and tactile drawing-system for blind users. SIGACCESS Access. Comput.114 (March 2016), 11–15. https://doi.org/10.1145/2904092.2904095 Number: 114 Reporter: ACM SIGACCESS Accessibility and Computing.",
      "doi": ""
    },
    {
      "text": "Jens Bornschein, Denise Bornschein, and Gerhard Weber. 2018. Comparing Computer-Based Drawing Methods for Blind People with Real-Time Tactile Feedback. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–13. https://doi.org/10.1145/3173574.3173689 Meeting Name: the 2018 CHI Conference Reporter: Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18.",
      "doi": ""
    },
    {
      "text": "Jens Bornschein, Denise Prescher, and Gerhard Weber. 2015. Collaborative creation of digital tactile graphics. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility. 117–126.",
      "doi": "10.1145/2700648.2809869"
    },
    {
      "text": "Jens Bornschein and Gerhard Weber. 2017. Digital Drawing Tools for Blind Users: A State-of-the-Art and Requirement Analysis. In Proceedings of the 10th International Conference on PErvasive Technologies Related to Assistive Environments - PETRA ’17. ACM Press, Island of Rhodes, Greece, 21–28. https://doi.org/10.1145/3056540.3056542 Meeting Name: the 10th International Conference Reporter: Proceedings of the 10th International Conference on PErvasive Technologies Related to Assistive Environments - PETRA ’17.",
      "doi": ""
    },
    {
      "text": "Stacy M. Branham and Shaun K. Kane. 2015. The Invisible Work of Accessibility: How Blind Employees Manage Accessibility in Mixed-Ability Workplaces. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (Lisbon, Portugal) (ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 163–171. https://doi.org/10.1145/2700648.2809864",
      "doi": "10.1145/2700648.2809864"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "L. M. Brown, S. A. Brewster, S. A. Ramloll, R. Burton, and B. Riedel. 2003. Design guidelines for audio presentation of graphs and tables. http://eprints.gla.ac.uk/3196/",
      "doi": ""
    },
    {
      "text": "Xiang ’Anthony’ Chen, Tovi Grossman, Daniel J. Wigdor, and George Fitzmaurice. 2014. Duet: Exploring Joint Interactions on a Smart Phone and a Smart Watch. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, New York, NY, USA, 159–168. https://doi.org/10.1145/2556288.2556955 Reporter: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems event-place: Toronto, Ontario, Canada.",
      "doi": "10.1145/2556288.2556955"
    },
    {
      "text": "Robert F. Cohen, Arthur Meacham, and Joelle Skaff. 2006. Teaching Graphs to Visually Impaired Students Using an Active Auditory Interface. In Proceedings of the 37th SIGCSE Technical Symposium on Computer Science Education(SIGCSE ’06). ACM, New York, NY, USA, 279–282. https://doi.org/10.1145/1121341.1121428 Reporter: Proceedings of the 37th SIGCSE Technical Symposium on Computer Science Education event-place: Houston, Texas, USA.",
      "doi": ""
    },
    {
      "text": "Maitraye Das, Darren Gergle, and Anne Marie Piper. 2019. ”It Doesn’t Win You Friends”: Understanding Accessibility in Collaborative Writing for People with Vision Impairments. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 191 (Nov. 2019), 26 pages. https://doi.org/10.1145/3359293",
      "doi": "10.1145/3359293"
    },
    {
      "text": "Franco Delogu, Massimiliano Palmiero, Stefano Federici, Catherine Plaisant, Haixia Zhao, and Olivetti Belardinelli. 2010. Non-visual exploration of geographic maps: Does sonification help?Disability and Rehabilitation: Assistive Technology 5, 3 (May 2010), 164–174. https://doi.org/10.3109/17483100903100277 Number: 3 Reporter: Disability and Rehabilitation: Assistive Technology.",
      "doi": ""
    },
    {
      "text": "Christin Engel, Nadja Konrad, and Gerhard Weber. 2020. TouchPen: Rich Interaction Technique for Audio-Tactile Charts by Means of Digital Pens. In Computers Helping People with Special Needs(Lecture Notes in Computer Science), Klaus Miesenberger, Roberto Manduchi, Mario Covarrubias Rodriguez, and Petr Peňáz (Eds.). Springer International Publishing, Cham, 446–455. https://doi.org/10.1007/978-3-030-58796-3_52",
      "doi": ""
    },
    {
      "text": "Nicholas A. Giudice, Hari Prasath Palani, Eric Brenner, and Kevin M. Kramer. 2012. Learning non-visual graphical information using a touch-based vibro-audio interface. In Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility - ASSETS ’12. ACM Press, Boulder, Colorado, USA, 103. https://doi.org/10.1145/2384916.2384935 Meeting Name: the 14th international ACM SIGACCESS conference Reporter: Proceedings of the 14th international ACM SIGACCESS conference on Computers and accessibility - ASSETS ’12.",
      "doi": ""
    },
    {
      "text": "Cagatay Goncu and Kim Marriott. 2011. GraVVITAS: Generic Multi-touch Presentation of Accessible Graphics. In Human-Computer Interaction – INTERACT 2011(Lecture Notes in Computer Science), Pedro Campos, Nicholas Graham, Joaquim Jorge, Nuno Nunes, Philippe Palanque, and Marco Winckler (Eds.). Springer, Berlin, Heidelberg, 30–48. https://doi.org/10.1007/978-3-642-23774-4_5 Reporter: Human-Computer Interaction – INTERACT 2011.",
      "doi": ""
    },
    {
      "text": "William Grussenmeyer and Eelke Folmer. 2016. AudioDraw: user preferences in non-visual diagram drawing for touchscreens. In Proceedings of the 13th Web for All Conference on - W4A ’16. ACM Press, Montreal, Canada, 1–8. https://doi.org/10.1145/2899475.2899483 Meeting Name: the 13th Web for All Conference Reporter: Proceedings of the 13th Web for All Conference on - W4A ’16.",
      "doi": ""
    },
    {
      "text": "Susumu Harada, Jacob O Wobbrock, and James A Landay. 2007. Voicedraw: a hands-free voice-driven drawing application for people with motor impairments. In Proceedings of the 9th international ACM SIGACCESS conference on Computers and accessibility. 27–34.",
      "doi": "10.1145/1296843.1296850"
    },
    {
      "text": "Anthony J Hornof and Anna Cavender. 2005. EyeDraw: enabling children with severe motor impairments to draw with their eyes. In Proceedings of the SIGCHI conference on Human factors in computing systems. 161–170.",
      "doi": "10.1145/1054972.1054995"
    },
    {
      "text": "DIN ISO. 2020. ISO 9241-110: 2020–Ergonomics of human-system interaction–Part 110: Interaction principles. ISO. org (2020).",
      "doi": ""
    },
    {
      "text": "Nikolaos Kaklanis, Konstantinos Votis, and Dimitrios Tzovaras. 2013. A Mobile Interactive Maps Application for a Visually Impaired Audience. In Proceedings of the 10th International Cross-Disciplinary Conference on Web Accessibility(W4A ’13). ACM, New York, NY, USA, 23:1–23:2. https://doi.org/10.1145/2461121.2461152 Reporter: Proceedings of the 10th International Cross-Disciplinary Conference on Web Accessibility event-place: Rio de Janeiro, Brazil.",
      "doi": ""
    },
    {
      "text": "Hesham M Kamel and James A Landay. [n.d.]. A Study of Blind Drawing Practice: Creating Graphical Information Without the Visual Channel. ([n. d.]), 8.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Meredith Ringel Morris, Annuska Z. Perkins, Daniel Wigdor, Richard E. Ladner, and Jacob O. Wobbrock. 2011. Access overlays: improving non-visual access to large touch screens for blind users. In Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST ’11. ACM Press, Santa Barbara, California, USA, 273. https://doi.org/10.1145/2047196.2047232 Meeting Name: the 24th annual ACM symposium Reporter: Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST ’11.",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Meredith Ringel Morris, and Jacob O. Wobbrock. 2013. Touchplates: Low-Cost Tactile Overlays for Visually Impaired Touch Screen Users. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility(Bellevue, Washington) (ASSETS ’13). Association for Computing Machinery, New York, NY, USA, Article 22, 8 pages. https://doi.org/10.1145/2513383.2513442",
      "doi": "10.1145/2513383.2513442"
    },
    {
      "text": "Andrea R. Kennel. 1996. Audiograf: A Diagram-reader for the Blind. In Proceedings of the Second Annual ACM Conference on Assistive Technologies(Assets ’96). ACM, New York, NY, USA, 51–56. https://doi.org/10.1145/228347.228357 Reporter: Proceedings of the Second Annual ACM Conference on Assistive Technologies event-place: Vancouver, British Columbia, Canada.",
      "doi": "10.1145/228347.228357"
    },
    {
      "text": "Martin Kurze. 1996. TDraw: a computer-based tactile drawing tool for blind people. In Proceedings of the second annual ACM conference on Assistive technologies - Assets ’96. ACM Press, Vancouver, British Columbia, Canada, 131–138. https://doi.org/10.1145/228347.228368 Meeting Name: the second annual ACM conference Reporter: Proceedings of the second annual ACM conference on Assistive technologies - Assets ’96.",
      "doi": "10.1145/228347.228368"
    },
    {
      "text": "Barbara Leporini and Fabio Paternò. 2004. Increasing usability when interacting through screen readers. Universal access in the information society 3, 1 (2004), 57–70.",
      "doi": ""
    },
    {
      "text": "Alan Lundgard, Crystal Lee, and Arvind Satyanarayan. [n.d.]. Sociotechnical Considerations for Accessible Visualization Design. ([n. d.]), 5.",
      "doi": ""
    },
    {
      "text": "Oussama Metatla and Clare Cullen. 2018. “Bursting the Assistance Bubble”: Designing Inclusive Technology with Children with Mixed Visual Abilities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–14. https://doi.org/10.1145/3173574.3173920",
      "doi": "10.1145/3173574.3173920"
    },
    {
      "text": "Joe Mullenbach, Craig Shultz, J. Edward Colgate, and Anne Marie Piper. 2014. Exploring affective communication through variable-friction surface haptics. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. ACM Press, Toronto, Ontario, Canada, 3963–3972. https://doi.org/10.1145/2556288.2557343 Meeting Name: the 32nd annual ACM conference Reporter: Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14.",
      "doi": ""
    },
    {
      "text": "Joe Mullenbach, Craig Shultz, Anne Marie Piper, Michael Peshkin, and J. Edward Colgate. 2013. Surface haptic interactions with a TPad tablet. In Proceedings of the adjunct publication of the 26th annual ACM symposium on User interface software and technology - UIST ’13 Adjunct. ACM Press, St. Andrews, Scotland, United Kingdom, 7–8. https://doi.org/10.1145/2508468.2514929 Meeting Name: the adjunct publication of the 26th annual ACM symposium Reporter: Proceedings of the adjunct publication of the 26th annual ACM symposium on User interface software and technology - UIST ’13 Adjunct.",
      "doi": ""
    },
    {
      "text": "Hugo Nicolau, Kyle Montague, João Guerreiro, Diogo Marques, Tiago Guerreiro, Craig Stewart, and Vicki Hanson. 2013. Augmenting braille input through multitouch feedback. In Proceedings of the adjunct publication of the 26th annual ACM symposium on User interface software and technology - UIST ’13 Adjunct. ACM Press, St. Andrews, Scotland, United Kingdom, 81–82. https://doi.org/10.1145/2508468.2514720 Meeting Name: the adjunct publication of the 26th annual ACM symposium Reporter: Proceedings of the adjunct publication of the 26th annual ACM symposium on User interface software and technology - UIST ’13 Adjunct.",
      "doi": ""
    },
    {
      "text": "HariPrasath Palani and Nicholas A. Giudice. 2014. Evaluation of Non-visual Panning Operations Using Touch-screen Devices. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility(ASSETS ’14). ACM, New York, NY, USA, 293–294. https://doi.org/10.1145/2661334.2661336 Reporter: Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility event-place: Rochester, New York, USA.",
      "doi": ""
    },
    {
      "text": "Hari Prasath Palani, G. Bernard Giudice, and Nicholas A. Giudice. 2018. Haptic Information Access Using Touchscreen Devices: Design Guidelines for Accurate Perception of Angular Magnitude and Line Orientation. In Universal Access in Human-Computer Interaction. Methods, Technologies, and Users, Margherita Antona and Constantine Stephanidis (Eds.). Vol. 10907. Springer International Publishing, Cham, 243–255. https://doi.org/10.1007/978-3-319-92049-8_18 Reporter: Universal Access in Human-Computer Interaction. Methods, Technologies, and Users.",
      "doi": ""
    },
    {
      "text": "Helen Petrie and Omar Kheir. 2007. The relationship between accessibility and usability of websites. In Proceedings of the SIGCHI conference on Human factors in computing systems. 397–406.",
      "doi": "10.1145/1240624.1240688"
    },
    {
      "text": "Lorenzo Porzi, Stefano Messelodi, Carla Mara Modena, and Elisa Ricci. 2013. A smart watch-based gesture recognition system for assisting people with visual impairments. In Proceedings of the 3rd ACM international workshop on Interactive multimedia on mobile & portable devices - IMMPD ’13. ACM Press, Barcelona, Spain, 19–24. https://doi.org/10.1145/2505483.2505487 Meeting Name: the 3rd ACM international workshop Reporter: Proceedings of the 3rd ACM international workshop on Interactive multimedia on mobile & portable devices - IMMPD ’13.",
      "doi": "10.1145/2505483.2505487"
    },
    {
      "text": "Venkatesh Potluri, Tadashi Grindeland, Jon E Froehlich, and Jennifer Mankoff. [n.d.]. AI-Assisted UI Design for Blind and Low-Vision Creators. ([n. d.]), 7.",
      "doi": ""
    },
    {
      "text": "Venkatesh Potluri, Liang He, Christine Chen, Jon E Froehlich, and Jennifer Mankoff. 2019. A Multi-Modal Approach for Blind and Visually Impaired Developers to Edit Webpage Designs. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 612–614.",
      "doi": "10.1145/3308561.3354626"
    },
    {
      "text": "Denise Prescher, Gerhard Weber, and Martin Spindler. 2010. A tactile windowing system for blind users. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility. 91–98.",
      "doi": "10.1145/1878803.1878821"
    },
    {
      "text": "Ather Sharif and Babak Forouraghi. 2018. evoGraphs — A jQuery plugin to create web accessible graphs. In 2018 15th IEEE Annual Consumer Communications Networking Conference (CCNC). 1–4. https://doi.org/10.1109/CCNC.2018.8319239 ISSN: 2331-9860.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Cynthia L. Bennett, Wanda Pratt, and Jacob O. Wobbrock. 2018. Tenets for Social Accessibility: Towards Humanizing Disabled People in Design. ACM Trans. Access. Comput. 11, 1 (April 2018), 1–31. https://doi.org/10.1145/3178855",
      "doi": "10.1145/3178855"
    },
    {
      "text": "Kristen Shinohara, Michael McQuaid, and Nayeri Jacobo. 2020. Access Diferential and Inequitable Access: Inaccessibility for Doctoral Students in Computing. (2020), 12.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara and Jacob O Wobbrock. 2011. In the shadow of misperception: assistive technology use and social interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 705–714.",
      "doi": "10.1145/1978942.1979044"
    },
    {
      "text": "Kristen Shinohara and Jacob O. Wobbrock. 2016. Self-Conscious or Self-Confident? A Diary Study Conceptualizing the Social Accessibility of Assistive Technology. ACM Trans. Access. Comput. 8, 2 (Jan. 2016), 5:1–5:31. https://doi.org/10.1145/2827857",
      "doi": "10.1145/2827857"
    },
    {
      "text": "Kristen Shinohara, Jacob O. Wobbrock, and Wanda Pratt. 2018. Incorporating Social Factors in Accessible Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, Galway Ireland, 149–160. https://doi.org/10.1145/3234695.3236346",
      "doi": "10.1145/3234695.3236346"
    },
    {
      "text": "Mary Frances Theofanos and Janice Redish. 2003. Bridging the gap: between accessibility and usability. interactions 10, 6 (2003), 36–51.",
      "doi": ""
    },
    {
      "text": "Shannon M Tomlinson. 2016. Perceptions of accessibility and usability by blind or visually impaired persons: a pilot study. Proceedings of the Association for Information Science and Technology 53, 1 (2016), 1–4.",
      "doi": ""
    },
    {
      "text": "Steven Wall and Stephen Brewster. 2006. Feeling what you hear: tactile feedback for navigation of audio graphs. In Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI ’06. ACM Press, Montréal, Québec, Canada, 1123. https://doi.org/10.1145/1124772.1124941 Meeting Name: the SIGCHI conference Reporter: Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI ’06.",
      "doi": "10.1145/1124772.1124941"
    },
    {
      "text": "Cheng Xu, Ali Israr, Ivan Poupyrev, Olivier Bau, and Chris Harrison. 2011. Tactile Display for the Visually Impaired Using TeslaTouch. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’11). ACM, New York, NY, USA, 317–322. https://doi.org/10.1145/1979742.1979705 Reporter: CHI ’11 Extended Abstracts on Human Factors in Computing Systems event-place: Vancouver, BC, Canada.",
      "doi": ""
    },
    {
      "text": "Hanlu Ye, Meethu Malu, Uran Oh, and Leah Findlater. 2014. Current and future mobile and wearable device use by people with visual impairments. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. ACM Press, Toronto, Ontario, Canada, 3123–3132. https://doi.org/10.1145/2556288.2557085 Meeting Name: the 32nd annual ACM conference Reporter: Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14.",
      "doi": ""
    },
    {
      "text": "Tsubasa Yoshida, Kris M. Kitani, Hideki Koike, Serge Belongie, and Kevin Schlei. 2011. EdgeSonic: image feature sonification for the visually impaired. In Proceedings of the 2nd Augmented Human International Conference on - AH ’11. ACM Press, Tokyo, Japan, 1–4. https://doi.org/10.1145/1959826.1959837 Meeting Name: the 2nd Augmented Human International Conference Reporter: Proceedings of the 2nd Augmented Human International Conference on - AH ’11.",
      "doi": "10.1145/1959826.1959837"
    },
    {
      "text": "Wai Yu and Stephen Brewster. [n.d.]. Multimodal Virtual Reality Versus Printed Medium in Visualization for Blind People. ([n. d.]), 8.",
      "doi": ""
    }
  ]
}