{
  "doi": "10.1145/3411764.3445552",
  "title": "DistanciAR: Authoring Site-Specific Augmented Reality Experiences for Remote Environments",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Most augmented reality (AR) authoring tools only support the author’s current environment, but designers often need to create site-specific experiences for a different environment. We propose DistanciAR, a novel tablet-based workflow for remote AR authoring. Our baseline solution involves three steps. A remote environment is captured by a camera with LiDAR; then, the author creates an AR experience from a different location using AR interactions; finally, a remote viewer consumes the AR content on site. A formative study revealed understanding and navigating the remote space as key challenges with this solution. We improved the authoring interface by adding two novel modes: Dollhouse, which renders a bird’s-eye view, and Peek, which creates photorealistic composite images using captured images. A second study compared this improved system with the baseline, and participants reported that the new modes made it easier to understand and navigate the remote scene.",
  "authors": [
    {
      "name": "Zeyu Wang",
      "institution": "Yale University, United States",
      "img": "/do/10.1145/contrib-99658760300/rel-imgonly/photo.png",
      "acmid": "99658760300",
      "orcid": "missing"
    },
    {
      "name": "Cuong Nguyen",
      "institution": "Adobe Research, United States",
      "img": "/do/10.1145/contrib-81502644262/rel-imgonly/avatar.jpg",
      "acmid": "81502644262",
      "orcid": "0000-0001-9234-9960"
    },
    {
      "name": "Paul Asente",
      "institution": "Adobe Research Adobe, United States",
      "img": "/do/10.1145/contrib-81100185028/rel-imgonly/img_6021.jpg",
      "acmid": "81100185028",
      "orcid": "0000-0002-7009-9734"
    },
    {
      "name": "Julie Dorsey",
      "institution": "Yale University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100369597",
      "orcid": "0000-0003-2495-4979"
    }
  ],
  "references": [
    {
      "text": "Edward H Adelson, Charles H Anderson, James R Bergen, Peter J Burt, and Joan M Ogden. 1984. Pyramid Methods in Image Processing. RCA Engineer 29, 6 (1984), 33–41.",
      "doi": ""
    },
    {
      "text": "Adobe. 2020. Aero. https://www.adobe.com/products/aero.html. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Apple. 2020. ARKit. https://developer.apple.com/documentation/arkit. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Apple. 2020. Reality Composer. https://developer.apple.com/augmented-reality/reality-composer/. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Apple. 2020. RealityKit. https://developer.apple.com/documentation/realitykit. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Apple. 2020. SceneKit. https://developer.apple.com/documentation/scenekit. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Narges Ashtari, Andrea Bunt, Joanna McGrenere, Michael Nebeling, and Parmit K Chilana. 2020. Creating Augmented and Virtual Reality Applications: Current Practices, Challenges, and Opportunities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376722"
    },
    {
      "text": "Matt Bell. 2020. Matterport. https://matterport.com/. Accessed Dec 17, 2020.",
      "doi": ""
    },
    {
      "text": "Jan Brejcha, Michal Lukác, Zhili Chen, Stephen DiVerdi, and Martin Cadík. 2018. Immersive Trip Reports. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany). Association for Computing Machinery, New York, NY, USA, 389–401.",
      "doi": "10.1145/3242587.3242653"
    },
    {
      "text": "Ricardo Cabello. 2020. three.js. https://threejs.org/. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Amy Karlson, and Benjamin B Bederson. 2009. A Review of Overview+Detail, Zooming, and Focus+Context Interfaces. Comput. Surveys 41, 1 (2009), 1–31.",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Ruofei Du, Eric Turner, Maksym Dzitsiuk, Luca Prasso, Ivo Duarte, Jason Dourgarian, Joao Afonso, Jose Pascoal, Josh Gladstone, Nuno Cruces, Shahram Izadi, Adarsh Kowdle, Konstantine Tsotsos, and David Kim. 2020. DepthLab: Real-Time 3D Interaction with Depth Maps for Mobile Augmented Reality. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology(Virtual Event, USA). Association for Computing Machinery, New York, NY, USA, 829–843.",
      "doi": "10.1145/3379337.3415881"
    },
    {
      "text": "Facebook. 2020. Spark AR Studio. https://sparkar.facebook.com/ar-studio/. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Ilter Canberk, Hannah Murphy, Andrés Monroy-Hernández, and Rajan Vaish. 2019. Blocks: Collaborative and Persistent Augmented Reality Experiences. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 3, Article 83 (Sept. 2019), 24 pages.",
      "doi": "10.1145/3351241"
    },
    {
      "text": "Sinem Guven, Steven Feiner, and Ohan Oda. 2006. Mobile Augmented Reality Interaction Techniques for Authoring Situated Media On-Site. In 2006 IEEE/ACM International Symposium on Mixed and Augmented Reality. IEEE, 235–236.",
      "doi": ""
    },
    {
      "text": "André Kunert, Alexander Kulik, Stephan Beck, and Bernd Froehlich. 2014. Photoportals: Shared References in Space and Time. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA). Association for Computing Machinery, New York, NY, USA, 1388–1399.",
      "doi": "10.1145/2531602.2531727"
    },
    {
      "text": "Germán Leiva, Cuong Nguyen, Rubaiat Habib Kazi, and Paul Asente. 2020. Pronto: Rapid Augmented Reality Video Prototyping Using Sketches and Enaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376160"
    },
    {
      "text": "Yuwei Li, Xi Luo, Youyi Zheng, Pengfei Xu, and Hongbo Fu. 2017. SweepCanvas: Sketch-based 3D Prototyping on an RGB-D Image. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. 387–399.",
      "doi": "10.1145/3126594.3126611"
    },
    {
      "text": "David Lindlbauer and Andy D. Wilson. 2018. Remixed Reality: Manipulating Space and Time in Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3173703"
    },
    {
      "text": "Chen Liu, Kihwan Kim, Jinwei Gu, Yasutaka Furukawa, and Jan Kautz. 2019. PlaneRCNN: 3D Plane Detection and Reconstruction from a Single Image. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 4450–4459.",
      "doi": ""
    },
    {
      "text": "Feng Liu, Yu-hen Hu, and Michael L. Gleicher. 2008. Discovering Panoramas in Web Videos. In Proceedings of the 16th ACM International Conference on Multimedia (Vancouver, British Columbia, Canada). Association for Computing Machinery, New York, NY, USA, 329–338.",
      "doi": "10.1145/1459359.1459404"
    },
    {
      "text": "Blair MacIntyre, Maribeth Gandy, Jay Bolter, Steven Dow, and Brendan Hannigan. 2003. DART: the Designer’s Augmented Reality Toolkit. In The Second IEEE and ACM International Symposium on Mixed and Augmented Reality, 2003. Proceedings. IEEE, 329–330.",
      "doi": ""
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L. Davidson, Sameh Khamis, Mingsong Dou, Vladimir Tankovich, Charles Loop, Qin Cai, Philip A. Chou, Sarah Mennicken, Julien Valentin, Vivek Pradeep, Shenlong Wang, Sing Bing Kang, Pushmeet Kohli, Yuliya Lutchyn, Cem Keskin, and Shahram Izadi. 2016. Holoportation: Virtual 3D Teleportation in Real-Time. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan). Association for Computing Machinery, New York, NY, USA, 741–754.",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Patrick Paczkowski, Min H. Kim, Yann Morvan, Julie Dorsey, Holly Rushmeier, and Carol O’Sullivan. 2011. Insitu: Sketching Architectural Designs in Context. ACM Trans. Graph. 30, 6 (Dec. 2011), 1–10.",
      "doi": "10.1145/2070781.2024216"
    },
    {
      "text": "Benjamin Reynolds, Hisham Bedri, Valentin Heun, Anna Fusté, and Christian Vazquez. 2019. Remote Spatial Programming and Collaboration Using a Real-Time Volumetric Capture Space. In ACM SIGGRAPH 2019 Virtual, Augmented, and Mixed Reality (Los Angeles, California). Association for Computing Machinery, New York, NY, USA, Article 27, 1 pages.",
      "doi": "10.1145/3306449.3328821"
    },
    {
      "text": "Armin Ronacher. 2020. Flask. https://flask.palletsprojects.com/en/1.1.x/. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Aditya Sankar and Steve M. Seitz. 2017. Interactive Room Capture on 3D-Aware Mobile Devices. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada). Association for Computing Machinery, New York, NY, USA, 415–426.",
      "doi": "10.1145/3126594.3126629"
    },
    {
      "text": "Noah Snavely, Steven M. Seitz, and Richard Szeliski. 2006. Photo Tourism: Exploring Photo Collections in 3D. ACM Trans. Graph. 25, 3 (July 2006), 835–846.",
      "doi": "10.1145/1141911.1141964"
    },
    {
      "text": "Noah Snavely, Steven M Seitz, and Richard Szeliski. 2008. Modeling the World from Internet Photo Collections. International Journal of Computer Vision 80, 2 (2008), 189–210.",
      "doi": "10.1007/s11263-007-0107-3"
    },
    {
      "text": "Rajinder S. Sodhi, Brett R. Jones, David Forsyth, Brian P. Bailey, and Giuliano Maciocci. 2013. BeThere: 3D Mobile Collaboration with Spatial Input. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France). Association for Computing Machinery, New York, NY, USA, 179–188.",
      "doi": "10.1145/2470654.2470679"
    },
    {
      "text": "Richard Stoakley, Matthew J. Conway, and Randy Pausch. 1995. Virtual Reality on a WIM: Interactive Worlds in Miniature. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA). ACM Press/Addison-Wesley Publishing Co., USA, 265–272.",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Yuta Sugiura, Hikaru Ibayashi, Toby Chong, Daisuke Sakamoto, Natsuki Miyata, Mitsunori Tada, Takashi Okuma, Takeshi Kurata, Takashi Shinmura, Masaaki Mochimaru, and Takeo Igarashi. 2018. An Asymmetric Collaborative System for Architectural-Scale Space Design. In Proceedings of the 16th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and Its Applications in Industry (Tokyo, Japan). Association for Computing Machinery, New York, NY, USA, Article 21, 6 pages.",
      "doi": "10.1145/3284398.3284416"
    },
    {
      "text": "Franco Tecchia, Leila Alem, and Weidong Huang. 2012. 3D Helping Hands: A Gesture Based MR System for Remote Collaboration. In Proceedings of the 11th ACM SIGGRAPH International Conference on Virtual-Reality Continuum and Its Applications in Industry (Singapore, Singapore). Association for Computing Machinery, New York, NY, USA, 323–328.",
      "doi": "10.1145/2407516.2407590"
    },
    {
      "text": "Unity Technologies. 2020. Unity. https://unity.com/. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Fraser Anderson, George Fitzmaurice, Björn Hartmann, and Tovi Grossman. 2019. Loki: Facilitating Remote Instruction of Physical Tasks Using Bi-Directional Mixed-Reality Telepresence. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA). Association for Computing Machinery, New York, NY, USA, 161–174.",
      "doi": "10.1145/3332165.3347872"
    },
    {
      "text": "Michael Tsang, George W. Fitzmaurice, Gordon Kurtenbach, Azam Khan, and Bill Buxton. 2002. Boom Chameleon: Simultaneous Capture of 3D Viewpoint, Voice and Gesture Annotations on a Spatially-Aware Display. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (Paris, France). Association for Computing Machinery, New York, NY, USA, 111–120.",
      "doi": "10.1145/571985.572001"
    },
    {
      "text": "Tianyi Wang, Xun Qian, Fengming He, Xiyun Hu, Ke Huo, Yuanzhi Cao, and Karthik Ramani. 2020. CAPturAR: An Augmented Reality Tool for Authoring Human-Involved Context-Aware Applications. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA). Association for Computing Machinery, New York, NY, USA, 328–341.",
      "doi": "10.1145/3379337.3415815"
    },
    {
      "text": "Zeyu Wang, Shiyu Qiu, Qingyang Chen, Natallia Trayan, Alexander Ringlein, Julie Dorsey, and Holly Rushmeier. 2019. AniCode: Authoring Coded Artifacts for Network-Free Personalized Animations. The Visual Computer 35, 6-8 (2019), 885–897.",
      "doi": "10.1007/s00371-019-01681-y"
    },
    {
      "text": "Michelle Q Wang Baldonado, Allison Woodruff, and Allan Kuchinsky. 2000. Guidelines for Using Multiple Views in Information Visualization. In Proceedings of the Working Conference on Advanced Visual Interfaces. 110–119.",
      "doi": "10.1145/345513.345271"
    },
    {
      "text": "Evan You. 2020. Vue.js. https://vuejs.org/. Accessed Sep 12, 2020.",
      "doi": ""
    },
    {
      "text": "Ya-Ting Yue, Yong-Liang Yang, Gang Ren, and Wenping Wang. 2017. SceneCtrl: Mixed Reality Enhancement via Efficient Scene Editing. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada). Association for Computing Machinery, New York, NY, USA, 427–436.",
      "doi": "10.1145/3126594.3126601"
    },
    {
      "text": "Yinda Zhang, Neal Wadhwa, Sergio Orts-Escolano, Christian Häne, Sean Fanello, and Rahul Garg. 2020. Du2Net: Learning Depth Estimation from Dual-Cameras and Dual-Pixels. In European Conference on Computer Vision, Andrea Vedaldi, Horst Bischof, Thomas Brox, and Jan-Michael Frahm (Eds.). Springer International Publishing, Cham, 582–598.",
      "doi": ""
    }
  ]
}