{
  "doi": "10.1145/3411764.3445375",
  "title": "Identity Claims that Underlie Ethical Awareness and Action",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "HCI and STS researchers have previously described the ethical complexity of practice, drawing together aspects of organizational complexity, design knowledge, and ethical frameworks. Building on this work, we investigate the identity claims and beliefs that impact practitioners’ ability to recognize and act upon ethical concerns in a range of technology-focused disciplines. In this paper, we report results from an interview study with 12 practitioners, identifying and describing their identity claims related to ethical awareness and action. We conducted a critically-focused thematic analysis to identify eight distinct claims representing roles relating to learning, educating, following policies, feeling a sense of responsibility, being a member of a profession, a translator, an activist, and deliberative. Based on our findings, we demonstrate how the claims foreground building competence in relation to ethical practice. We highlight the dynamic interplay among these claims and point towards implications for identity work in socio-technical contexts.",
  "tags": [
    "ethical awareness",
    "practice-led research",
    "technologists",
    "ethical action",
    "identity claims"
  ],
  "authors": [
    {
      "name": "Shruthi Sai Chivukula",
      "institution": "Purdue University, United States",
      "img": "/do/10.1145/contrib-99659197076/rel-imgonly/download.png",
      "acmid": "99659197076",
      "orcid": "missing"
    },
    {
      "name": "Aiza Hasib",
      "institution": "Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701916",
      "orcid": "missing"
    },
    {
      "name": "Ziqing Li",
      "institution": "Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700939",
      "orcid": "missing"
    },
    {
      "name": "Jingle Chen",
      "institution": "Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527450",
      "orcid": "missing"
    },
    {
      "name": "Colin M. Gray",
      "institution": "Purdue University, United States",
      "img": "/do/10.1145/contrib-87959081657/rel-imgonly/gray_headshot.jpg",
      "acmid": "87959081657",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. ACM Code of Ethics and Professional Conduct. https://www.acm.org/code-of-ethics. Accessed: 2020-8-14.",
      "doi": ""
    },
    {
      "text": "Dominic Abrams and Michael A Hogg. 2006. Social Identifications: A Social Psychology of Intergroup Relations and Group Processes. Routledge.",
      "doi": ""
    },
    {
      "text": "Daniel Bell. 1972. The Cultural Contradictions of Capitalism. Journal of Aesthetic Education 6, 1/2 (1972), 11–38. https://doi.org/10.2307/3331409",
      "doi": ""
    },
    {
      "text": "Tua A Björklund, Teo Keipi, and Hanna Maula. 2020. Crafters, explorers, innovators, and co-creators: Narratives in designers’ identity work. Design Studies 68 (May 2020), 82–112. https://doi.org/10.1016/j.destud.2020.02.003",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (Aug. 2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": "10.1080/2159676X.2019.1628806"
    },
    {
      "text": "Harry Brignull. 2013. Dark Patterns: inside the interfaces designed to trick you. The Verge (2013).",
      "doi": ""
    },
    {
      "text": "Andrew D Brown. 2015. Identities and Identity Work in Organizations. International Journal of Management Reviews 17, 1 (Jan. 2015), 20–40. https://doi.org/10.1111/ijmr.12035",
      "doi": ""
    },
    {
      "text": "Francis Phil Carspecken. 2013. Critical ethnography in educational research: A theoretical and practical guide. Routledge.",
      "doi": ""
    },
    {
      "text": "Phil Francis Carspecken and Paula A Cordeiro. 1995. Being, Doing, and Becoming: Textual Interpretations of Social Identity and a Case Study. Qual. Inq. 1, 1 (March 1995), 87–109. https://doi.org/10.1177/107780049500100106",
      "doi": ""
    },
    {
      "text": "S S Chivukula, C R Watkins, R Manocha, and others. 2020. Dimensions of UX Practice that Shape Ethical Awareness. Proceedings of the (2020).",
      "doi": ""
    },
    {
      "text": "Leonhard Dobusch and Dennis Schoeneborn. 2015. Fluidity, Identity, and Organizationality: The Communicative Constitution of Anonymous. Jour. of Manage. Stud. 52, 8 (Dec. 2015), 1005–1035. https://doi.org/10.1111/joms.12139",
      "doi": ""
    },
    {
      "text": "Trine Falbe, Martin Michael Frederiksen, and Kim Andersen. [n.d.]. The Ethical Design Handbook. Smashing Media AG, Freiburg, Germany.",
      "doi": ""
    },
    {
      "text": "Batya Friedman and David G Hendry. 2019. Value Sensitive Design: Shaping Technology with Moral Imagination. MIT Press.",
      "doi": ""
    },
    {
      "text": "Philip Gleason. 1983. Identifying Identity: A Semantic History. The Journal of American History 69, 4 (1983), 910–931. https://doi.org/10.2307/1901196",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1956. The Presentation of Self in Everyday Life. Doubleday. 259 pages. https://play.google.com/store/books/details?id=1G89PgAACAAJ",
      "doi": ""
    },
    {
      "text": "Elizabeth Goodman. 2013. Delivering Design: Performance and Materiality in Professional Interaction Design. Ph.D. Dissertation. UC Berkeley. https://escholarship.org/uc/item/31w6q6x3",
      "doi": ""
    },
    {
      "text": "Elizabeth Goodman, Erik Stolterman, and Ron Wakkary. 2011. Understanding Interaction Design Practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 1061–1070. https://doi.org/10.1145/1978942.1979100",
      "doi": "10.1145/1978942.1979100"
    },
    {
      "text": "Emma Graham-Harrison and Carole Cadwalladr. 2018. Revealed: 50 million Facebook profiles harvested for Cambridge Analytica in major data breach. The Guardian (March 2018).",
      "doi": ""
    },
    {
      "text": "Colin M Gray. 2014. Evolution of design competence in UX practice. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14 (Toronto, Ontario, Canada) (CHI ’14). ACM Press, New York, New York, USA, 1645–1654. https://doi.org/10.1145/2556288.2557264",
      "doi": "10.1145/2556288.2557264"
    },
    {
      "text": "Colin M Gray. 2016. It’s More of a Mindset Than a Method: UX Practitioners’ Conception of Design Methods. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (Santa Clara, California, USA). ACM, New York, New York, USA, 4044–4055. https://doi.org/10.1145/2858036.2858410",
      "doi": "10.1145/2858036.2858410"
    },
    {
      "text": "Colin M Gray and Elizabeth Boling. 2016. Inscribing ethics and values in designs for learning: a problematic. Educ. Technol. Res. Dev. 64, 5 (Oct. 2016), 969–1001. https://doi.org/10.1007/s11423-016-9478-x",
      "doi": ""
    },
    {
      "text": "Colin M Gray and Shruthi Sai Chivukula. 2019. Ethical Mediation in UX Practice. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, 178:1–178:11. https://doi.org/10.1145/3290605.3300408",
      "doi": "10.1145/3290605.3300408"
    },
    {
      "text": "Colin M Gray, Yubo Kou, Bryan Battles, Joseph Hoggatt, and Austin L Toombs. 2018. The Dark (Patterns) Side of UX Design. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18, Paper 534). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174108",
      "doi": "10.1145/3173574.3174108"
    },
    {
      "text": "Colin M Gray, Austin L Toombs, and Shad Gross. 2015. Flow of Competence in UX Design Practice. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 3285–3294. https://doi.org/10.1145/2702123.2702579",
      "doi": "10.1145/2702123.2702579"
    },
    {
      "text": "Colin M Gray, Austin L Toombs, and Christian McKay. 2016. Meaning Reconstruction As an Approach to Analyze Critical Dimensions of HCI Research. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). ACM, New York, NY, USA, 328–340. https://doi.org/10.1145/2851581.2892571",
      "doi": "10.1145/2851581.2892571"
    },
    {
      "text": "Harris, Tristan and Raskin, Aza and and Fernando, Randima. [n.d.]. Center for Humane Technology. https://www.humanetech.com/. Accessed: 2020-8-15.",
      "doi": ""
    },
    {
      "text": "Michael A Hogg. 2000. Social Identity and Social Comparison. In Handbook of Social Comparison: Theory and Research, Jerry Suls and Ladd Wheeler (Eds.). Springer US, Boston, MA, 401–421. https://doi.org/10.1007/978-1-4615-4237-7_19",
      "doi": ""
    },
    {
      "text": "Michael A Hogg and Cecilia L Ridgeway. 2003. Social Identity: Sociological and Social Psychological Perspectives. Soc. Psychol. Q. 66, 2 (2003), 97–100.",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Colin M Gray. 2018. Towards Professionalization in an Online Community of Emerging Occupation: Discourses among UX Practitioners. In Proceedings of the 2018 ACM Conference on Supporting Groupwork. ACM, New York, New York, USA, 322–334. https://doi.org/10.1145/3148330.3148352",
      "doi": "10.1145/3148330.3148352"
    },
    {
      "text": "Kari Kuutti and Liam J Bannon. 2014. The turn to practice in HCI: towards a research agenda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New York, New York, USA). ACM, 3543–3552. https://doi.org/10.1145/2556288.2557111",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Mike Monteiro. 2019. Ruined by design: How designers destroyed the world, and what we can do to fix it. Mule Design.",
      "doi": ""
    },
    {
      "text": "Maurice Mulvenna, Jennifer Boger, and Raymond Bond. 2017. Ethical by Design: A Manifesto. In Proceedings of the European Conference on Cognitive Ergonomics 2017 (Umeå, Sweden) (ECCE 2017). ACM, New York, NY, USA, 51–54. https://doi.org/10.1145/3121283.3121300",
      "doi": "10.1145/3121283.3121300"
    },
    {
      "text": "Harold G Nelson and Erik Stolterman. 2003. The Design Way: Intentional Change in an Unpredictable World : Foundations and Fundamentals of Design Competence. Educational Technology.",
      "doi": ""
    },
    {
      "text": "Victor J Papanek. 1972. Design for the real world; human ecology and social change. Pantheon Books, New York, NY. http://www.worldcat.org/title/design-for-the-real-world-human-ecology-and-social-change/oclc/321041632",
      "doi": ""
    },
    {
      "text": "Francesca Polletta and James M Jasper. 2001. Collective identity and social movements. Annu. Rev. Sociol. 27, 1 (2001), 283–305.",
      "doi": ""
    },
    {
      "text": "Bing Ran and P Robert Duimering. 2007. Imaging the Organization: Language Use in Organizational Identity Claims. Journal of Business and Technical Communication 21, 2 (April 2007), 155–187. https://doi.org/10.1177/1050651906297167",
      "doi": ""
    },
    {
      "text": "Stuart Reeves. 2019. How UX Practitioners Produce Findings in Usability Testing. ACM transactions on computer-human interaction: a publication of the Association for Computing Machinery 26, 1 (2019), 1–38. https://doi.org/10.1145/3299096",
      "doi": ""
    },
    {
      "text": "Stuart Reeves, Sara Ljungblad, Elizabeth Buie, Torkil Clemmensen, Susan Dray, Rowanne Fleck, Colin M Gray, Keith Instone, Carine Lallemand, Gitte Lindgaard, Andreas Resmini, Marty Siegel, Simone Stumpf, Raphael Velt, and Selena Whitehead. 2018. Proceedings of the Nottingham Symposium on Connecting HCI and UX. Technical Report. https://doi.org/10.17639/8vez-c741",
      "doi": ""
    },
    {
      "text": "Katie Shilton. 2013. Values Levers: Building Ethics into Design. Science, technology & human values 38, 3 (May 2013), 374–397. https://doi.org/10.1177/0162243912436985",
      "doi": ""
    },
    {
      "text": "Katie Shilton. 2018. Engaging Values Despite Neutrality: Challenges and Approaches to Values Reflection during the Design of Internet Infrastructure. Science, technology & human values 43, 2 (March 2018), 016224391771486. https://doi.org/10.1177/0162243917714869",
      "doi": ""
    },
    {
      "text": "Katie Shilton. 2018. Values and Ethics in Human-Computer Interaction. Foundations and Trends® Human–Computer Interaction 12, 2(2018), 107–171. https://doi.org/10.1561/1100000073",
      "doi": ""
    },
    {
      "text": "Katie Shilton and Sara Anderson. 2017. Blended, Not Bossy: Ethics Roles, Responsibilities and Expertise in Design. Interacting with computers 29, 1 (Jan. 2017), 71–79. https://doi.org/10.1093/iwc/iww002",
      "doi": ""
    },
    {
      "text": "Katie Shilton, Donal Heidenblad, Adam Porter, Susan Winter, and Mary Kendig. 2020. Role-Playing Computer Ethics: Designing and Evaluating the Privacy by Design (PbD) Simulation. Science and engineering ethics (July 2020). https://doi.org/10.1007/s11948-020-00250-0",
      "doi": ""
    },
    {
      "text": "Katie Shilton, Jes A Koepfler, and Kenneth R Fleischmann. 2014. How to see values in social computing: methods for studying values dimensions. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW ’14 (Baltimore, Maryland, USA). ACM Press, New York, New York, USA, 426–435. https://doi.org/10.1145/2531602.2531625",
      "doi": "10.1145/2531602.2531625"
    },
    {
      "text": "David A Snow and Leon Anderson. 1987. Identity Work Among the Homeless: The Verbal Construction and Avowal of Personal Identities. Am. J. Sociol. 92, 6 (May 1987), 1336–1371. https://doi.org/10.1086/228668",
      "doi": ""
    },
    {
      "text": "Jan E Stets and Peter J Burke. 2000. Identity Theory and Social Identity Theory. Soc. Psychol. Q. 63, 3 (2000), 224–237. https://doi.org/10.2307/2695870",
      "doi": ""
    },
    {
      "text": "E Stolterman. 2008. The nature of design practice and implications for interaction design research. International Journal of Design 2, 1 (Jan. 2008), 55–65. https://doi.org/10.1016/j.phymed.2007.09.005",
      "doi": ""
    },
    {
      "text": "M W Tracey and A Hutchinson. 2018. Reflection and professional identity development in design education. Int. J. Technol. Des. Educ.(2018).",
      "doi": ""
    },
    {
      "text": "Aimee van Wynsberghe and Scott Robbins. 2014. Ethicist as designer: a pragmatic approach to ethics in the lab. Sci. Eng. Ethics 20, 4 (Dec. 2014), 947–961. https://doi.org/10.1007/s11948-013-9498-4",
      "doi": ""
    },
    {
      "text": "Peter-Paul Verbeek. 2006. Materializing Morality: Design Ethics and Technological Mediation. In Science, Technology & Human Values. Vol. 31. 361–380. https://doi.org/10.1177/0162243905285847",
      "doi": ""
    },
    {
      "text": "Christopher Rhys Watkins, Colin M Gray, Austin L Toombs, and Paul Parsons. 2020. Tensions in Enacting a Design Philosophy in UX Practice. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 2107–2118. https://doi.org/10.1145/3357236.3395505",
      "doi": "10.1145/3357236.3395505"
    },
    {
      "text": "Karl E Weick. 1995. Sensemaking in Organizations. SAGE.",
      "doi": ""
    }
  ]
}