{
  "doi": "10.1145/3411764.3445477",
  "title": "“I Got Some Free Time”: Investigating Task-execution and Task-effort Metrics in Mobile Crowdsourcing Tasks",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Using a mixed-methods approach over six weeks, we studied 30 smartphone users’ task choices, task execution and effort devoted to two commercial mobile crowdsourcing platforms in the wild. We focused on the influence of activity contexts, characterized by breakpoint situations and activity attributes. In line with their stated preferences, the participants were more likely to proactively perform mobile crowdsourcing tasks during transitions between activities than during an ongoing activity and during long breaks, respectively. Their task choices were influenced by various activity attributes, and more impacted by their current and preceding activities than their upcoming ones. Two of our three target outcomes, task execution and task choice, were also influenced by individuals’ stress and energy levels. Our qualitative data provide further insights into participants’ decisions about which crowdsourcing tasks to perform and when; and our results’ implications for the design of future mobile crowdsourcing task-prompting mechanisms are also discussed.",
  "tags": [
    "Mobile crowdsourcing",
    "qualitative analysis",
    "ESM",
    "interruption",
    "notification",
    "mixed-effect logistic regression"
  ],
  "authors": [
    {
      "name": "Chia-En Chiang",
      "institution": "Department of computer science National Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659578070",
      "orcid": "missing"
    },
    {
      "name": "Yu-Chun Chen",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528264",
      "orcid": "0000-0002-9484-986X"
    },
    {
      "name": "Fang-Yu Lin",
      "institution": "Institute of Applied Arts National Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659487133",
      "orcid": "missing"
    },
    {
      "name": "Felicia Feng",
      "institution": "International Bilingual School at Hsinchu Science Park, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659577729",
      "orcid": "missing"
    },
    {
      "name": "Hao-An Wu",
      "institution": "National Chiao Tung University Institute of Multimedia Engineering, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701388",
      "orcid": "missing"
    },
    {
      "name": "Hao-Ping Lee",
      "institution": "Department of Computer Science National Chiao Tung University, Taiwan",
      "img": "/do/10.1145/contrib-99659200192/rel-imgonly/99659200192.jpg",
      "acmid": "99659200192",
      "orcid": "missing"
    },
    {
      "name": "Chang-Hsuan Yang",
      "institution": "National Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702435",
      "orcid": "missing"
    },
    {
      "name": "Yung-Ju Chang",
      "institution": "Department of Computer Science National Chiao Tung University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548019794",
      "orcid": "0000-0001-6956-3459"
    }
  ],
  "references": [
    {
      "text": "Piotr D. Adamczyk and Brian P. Bailey. 2004. If not now, when?: the effects of interruption at different moments within task execution. In Proceedings of the 2004 conference on Human factors in computing systems(CHI ’04). ACM Press, Vienna, Austria, 271–278. https://doi.org/10.1145/985692.985727",
      "doi": ""
    },
    {
      "text": "Elena Agapie, Jaime Teevan, and Andrés Monroy-Hernández. 2015. Crowdsourcing in the field: A case study using local crowds for event reporting. In Third AAAI Conference on Human Computation and Crowdsourcing(HCOMP ’15).",
      "doi": ""
    },
    {
      "text": "Brian P. Bailey and Joseph A. Konstan. 2006. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Computers in Human Behavior 22, 4 (July 2006), 685–708. https://doi.org/10.1016/j.chb.2005.12.009",
      "doi": ""
    },
    {
      "text": "Francesco Calabrese, Massimo Colonna, Piero Lovisolo, Dario Parata, and Carlo Ratti. 2011. Real-Time Urban Monitoring Using Cell Phones: A Case Study in Rome. IEEE Transactions on Intelligent Transportation Systems 12, 1 (March 2011), 141–151. https://doi.org/10.1109/TITS.2010.2074196",
      "doi": "10.1109/TITS.2010.2074196"
    },
    {
      "text": "Yung-Ju Chang, Gaurav Paruthi, Hsin Ying Wu, Hsin Yu Lin, and Mark W. Newman. 2017. An investigation of using mobile and situated crowdsourcing to collect annotated travel activity data in real-word settings. International Journal of Human Computer Studies 102 (June 2017), 81–102. https://doi.org/10.1016/j.ijhcs.2016.11.001",
      "doi": "10.1016/j.ijhcs.2016.11.001"
    },
    {
      "text": "Yung-Ju Chang and John C. Tang. 2015. Investigating Mobile Users’ Ringer Mode Usage and Attentiveness and Responsiveness to Communication. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (Copenhagen, Denmark) (MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 6–15. https://doi.org/10.1145/2785830.2785852",
      "doi": "10.1145/2785830.2785852"
    },
    {
      "text": "Yung-Ju Chang, Chu-Yuan Yang, Ying-Hsuan Kuo, Wen-Hao Cheng, Chun-Liang Yang, Fang-Yu Lin, I-Hui Yeh, Chih-Kuan Hsieh, Ching-Yu Hsieh, and Yu-Shuen Wang. 2019. Tourgether: Exploring Tourists’ Real-Time Sharing of Experiences as a Means of Encouraging Point-of-Interest Exploration. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 3, 4, Article 128 (Dec. 2019), 25 pages. https://doi.org/10.1145/3369832",
      "doi": "10.1145/3369832"
    },
    {
      "text": "Pei-Yu (Peggy) Chi, Anurag Batra, and Maxwell Hsu. 2018. Mobile crowdsourcing in the wild: challenges from a global community. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, 410–415. https://doi.org/10.1145/3236112.3236176",
      "doi": "10.1145/3236112.3236176"
    },
    {
      "text": "Pei-Yu (Peggy) Chi, Matthew Long, Akshay Gaur, Abhimanyu Deora, Anurag Batra, and Daphne Luong. 2019. Crowdsourcing Images for Global Diversity. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’19). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3338286.3347546",
      "doi": ""
    },
    {
      "text": "Joel E. Fischer, Nick Yee, Victoria Bellotti, Nathan Good, Steve Benford, and Chris Greenhalgh. 2010. Effects of content and time of delivery on receptivity to mobile interruptions. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services(MobileHCI ’10). Association for Computing Machinery, New York, NY, USA, 103–112. https://doi.org/10.1145/1851600.1851620",
      "doi": "10.1145/1851600.1851620"
    },
    {
      "text": "Kapil Garg, Yongsung Kim, Darren Gergle, and Haoqi Zhang. 2019. 4X: A Hybrid Approach for Scaffolding Data Collection and Interest in Low-Effort Participatory Sensing. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 90:1–90:28. https://doi.org/10.1145/3359192",
      "doi": "10.1145/3359192"
    },
    {
      "text": "Jorge Goncalves, Simo Hosio, Niels van Berkel, Furqan Ahmed, and Vassilis Kostakos. 2017. CrowdPickUp: Crowdsourcing Task Pickup in the Wild. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (Sept. 2017), 51:1–51:22. https://doi.org/10.1145/3130916",
      "doi": "10.1145/3130916"
    },
    {
      "text": "Ching-Yu Hsieh, Yi-Shyuan Chiang, Hung-Yu Chiu, and Yung-Ju Chang. 2020. Bridging the Virtual and Real Worlds: A Preliminary Study of Messaging Notifications in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376228",
      "doi": "10.1145/3313831.3376228"
    },
    {
      "text": "Kazushi Ikeda and Keiichiro Hoashi. 2017. Crowdsourcing GO: Effect of Worker Situation on Mobile Crowdsourcing Performance. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 1142–1153. https://doi.org/10.1145/3025453.3025917",
      "doi": "10.1145/3025453.3025917"
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2005. Investigating the effectiveness of mental workload as a predictor of opportune moments for interruption. In CHI ’05 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’05). Association for Computing Machinery, New York, NY, USA, 1489–1492. https://doi.org/10.1145/1056808.1056948",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. 2008. Effects of intelligent notification management on users and their tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). Association for Computing Machinery, New York, NY, USA, 93–102. https://doi.org/10.1145/1357054.1357070",
      "doi": ""
    },
    {
      "text": "Ellen Isaacs, Nicholas Yee, Diane J Schiano, Nathan Good, Nicolas Ducheneaut, and Victoria Bellotti. 2009. Mobile Microwaiting Moments: The Role of Context in Receptivity to Content While on the Go. http://www.izix.com/pubs/Isaacs-InfoOnTheGo-2009.pdf",
      "doi": ""
    },
    {
      "text": "Thivya Kandappu, Nikita Jaiman, Randy Tandriansyah, Archan Misra, Shih-Fen Cheng, Cen Chen, Hoong Chuin Lau, Deepthi Chander, and Koustuv Dasgupta. 2016. TASKer: behavioral insights via campus-based experimental mobile crowd-sourcing. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’16). Association for Computing Machinery, New York, NY, USA, 392–402. https://doi.org/10.1145/2971648.2971690",
      "doi": "10.1145/2971648.2971690"
    },
    {
      "text": "Ioanna Katidioti, Jelmer P. Borst, Marieke K. van Vugt, and Niels A. Taatgen. 2016. Interrupt me: External interruptions are less disruptive than self-interruptions. Computers in Human Behavior 63 (Oct. 2016), 906–915. https://doi.org/10.1016/j.chb.2016.06.037",
      "doi": ""
    },
    {
      "text": "Yongsung Kim, Darren Gergle, and Haoqi Zhang. 2018. Hit-or-Wait: Coordinating Opportunistic Low-effort Contributions to Achieve Global Outcomes in On-the-go Crowdsourcing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173670",
      "doi": "10.1145/3173574.3173670"
    },
    {
      "text": "Stephen F. King and Paul Brown. 2007. Fix my street or else: using the internet to voice local public service concerns. In Proceedings of the 1st international conference on Theory and practice of electronic governance(ICEGOV ’07). Association for Computing Machinery, New York, NY, USA, 72–80. https://doi.org/10.1145/1328057.1328076",
      "doi": "10.1145/1328057.1328076"
    },
    {
      "text": "Alisa Kongthon, Choochart Haruechaiyasak, Jaruwat Pailai, and Sarawoot Kongyoung. 2014. The Role of Social Media During a Natural Disaster: A Case Study of the 2011 Thai Flood. International Journal of Innovation and Technology Management 11, 03 (April 2014), 1440012. https://doi.org/10.1142/S0219877014400124",
      "doi": ""
    },
    {
      "text": "Terry K. Koo and Mae Y. Li. 2016. A Guideline of Selecting and Reporting Intraclass Correlation Coefficients for Reliability Research. Journal of Chiropractic Medicine 15, 2 (June 2016), 155–163. https://doi.org/10.1016/j.jcm.2016.02.012",
      "doi": ""
    },
    {
      "text": "Kostadin Kushlev, Bruno Cardoso, and Martin Pielot. 2017. Too tense for candy crush: affect influences user engagement with proactively suggested content. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, Vienna Austria, 1–6. https://doi.org/10.1145/3098279.3098569",
      "doi": "10.1145/3098279.3098569"
    },
    {
      "text": "Florian Künzler, Varun Mishra, Jan-Niklas Kramer, David Kotz, Elgar Fleisch, and Tobias Kowatsch. 2019. Exploring the State-of-Receptivity for mHealth Interventions. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 4 (Dec. 2019), 140:1–140:27. https://doi.org/10.1145/3369805",
      "doi": "10.1145/3369805"
    },
    {
      "text": "Hao-Ping Lee, Kuan-Yin Chen, Chih-Heng Lin, Chia-Yu Chen, Yu-Lin Chung, Yung-Ju Chang, and Chien-Ru Sun. 2019. Does Who Matter? Studying the Impact of Relationship Characteristics on Receptivity to Mobile IM Messages. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300756",
      "doi": "10.1145/3290605.3300756"
    },
    {
      "text": "Nicolas Maisonneuve, Matthias Stevens, and Bartek Ochab. 2010. Participatory noise pollution monitoring using mobile phones. Information Polity 15, 1,2 (Jan. 2010), 51–71. https://doi.org/10.3233/IP-2010-0200",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, Mary Czerwinski, and Paul Johns. 2015. Focused, Aroused, but so Distractible: Temporal Perspectives on Multitasking and Communications. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). ACM Press, Vancouver, BC, Canada, 903–916. https://doi.org/10.1145/2675133.2675221",
      "doi": "10.1145/2675133.2675221"
    },
    {
      "text": "Daniel C. McFarlane. 1999. Coordinating the interruption of people in human–computer interaction. In IFIP TC.13 International Conference on Human-Computer Interaction(INTERACT ’99). IOS Press, Edinburgh, UK, 295–303. Google-Books-ID: yXehjiOd_kkC.",
      "doi": ""
    },
    {
      "text": "Abhinav Mehrotra, Mirco Musolesi, Robert Hendley, and Veljko Pejovic. 2015. Designing content-driven intelligent notification mechanisms for mobile applications. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 813–824. https://doi.org/10.1145/2750858.2807544",
      "doi": "10.1145/2750858.2807544"
    },
    {
      "text": "Abhinav Mehrotra, Veljko Pejovic, Jo Vermeulen, Robert Hendley, and Mirco Musolesi. 2016. My Phone and Me: Understanding People’s Receptivity to Mobile Notifications. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 1021–1032. https://doi.org/10.1145/2858036.2858566",
      "doi": "10.1145/2858036.2858566"
    },
    {
      "text": "Tadashi Okoshi, Jin Nakazawa, and Hideyuki Tokuda. 2014. Attelia: Sensing User’s Attention Status on Smart Phones. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication (Seattle, Washington) (UbiComp ’14 Adjunct). Association for Computing Machinery, New York, NY, USA, 139–142. https://doi.org/10.1145/2638728.2638802",
      "doi": "10.1145/2638728.2638802"
    },
    {
      "text": "Tadashi Okoshi, Julian Ramos, Hiroki Nozaki, Jin Nakazawa, Anind K. Dey, and Hideyuki Tokuda. 2015. Attelia: Reducing user’s cognitive load due to interruptive notifications on smart phones. In 2015 IEEE International Conference on Pervasive Computing and Communications(PerCom ’15). IEEE, Los Alamitos, CA, USA, 96–104. https://doi.org/10.1109/PERCOM.2015.7146515 ISSN: null.",
      "doi": ""
    },
    {
      "text": "Tadashi Okoshi, Julian Ramos, Hiroki Nozaki, Jin Nakazawa, Anind K. Dey, and Hideyuki Tokuda. 2015. Reducing Users’ Perceived Mental Effort Due to Interruptive Notifications in Multi-Device Mobile Environments. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 475–486. https://doi.org/10.1145/2750858.2807517",
      "doi": "10.1145/2750858.2807517"
    },
    {
      "text": "Tadashi Okoshi, Kota Tsubouchi, Masaya Taji, Takanori Ichikawa, and Hideyuki Tokuda. 2017. Attention and engagement-awareness in the wild: A large-scale study with adaptive notifications. In 2017 IEEE International Conference on Pervasive Computing and Communications (PerCom). IEEE, 100–110. https://doi.org/10.1109/PERCOM.2017.7917856 ISSN: 2474-249X.",
      "doi": ""
    },
    {
      "text": "Tadashi Okoshi, Kota Tsubouchi, and Hideyuki Tokuda. 2019. Real-World Product Deployment of Adaptive Push Notification Scheduling on Smartphones. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining(KDD ’19). ACM, Anchorage AK USA, 2792–2800. https://doi.org/10.1145/3292500.3330732",
      "doi": "10.1145/3292500.3330732"
    },
    {
      "text": "Chunjong Park, Junsung Lim, Juho Kim, Sung-Ju Lee, and Dongman Lee. 2017. Don’t Bother Me. I’m Socializing!: A Breakpoint-Based Smartphone Notification System. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). ACM, Portland Oregon USA, 541–554. https://doi.org/10.1145/2998181.2998189",
      "doi": "10.1145/2998181.2998189"
    },
    {
      "text": "Veljko Pejovic and Mirco Musolesi. 2014. InterruptMe: Designing Intelligent Prompting Mechanisms for Pervasive Applications. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’14). ACM, New York, NY, USA, 897–908. https://doi.org/10.1145/2632048.2632062",
      "doi": "10.1145/2632048.2632062"
    },
    {
      "text": "Veljko Pejovic, Mirco Musolesi, and Abhinav Mehrotra. 2015. Investigating The Role of Task Engagement in Mobile Interruptibility. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(MobileHCI ’15). ACM, New York, NY, USA, 1100–1105. https://doi.org/10.1145/2786567.2794336",
      "doi": "10.1145/2786567.2794336"
    },
    {
      "text": "Maria Clara Pestana and Vaninha Vieira. 2018. Context-Aware Task Distribution for Mobile Crowdsourcing. In Proceedings of the 17th Brazilian Symposium on Human Factors in Computing Systems(IHC 2018). ACM, New York, NY, USA, 1–8. https://doi.org/10.1145/3274192.3274206",
      "doi": "10.1145/3274192.3274206"
    },
    {
      "text": "Martin Pielot, Bruno Cardoso, Kleomenis Katevas, Joan Serrà, Aleksandar Matic, and Nuria Oliver. 2017. Beyond Interruptibility: Predicting Opportune Moments to Engage Mobile Phone Users. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 3 (Sept. 2017), 1–25. https://doi.org/10.1145/3130956",
      "doi": "10.1145/3130956"
    },
    {
      "text": "Martin Pielot, Tilman Dingler, Jose San Pedro, and Nuria Oliver. 2015. When attention is not scarce - detecting boredom from mobile phone usage. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’15). ACM, Osaka, Japan, 825–836. https://doi.org/10.1145/2750858.2804252",
      "doi": "10.1145/2750858.2804252"
    },
    {
      "text": "Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2014. Sensor-Based Identification of Opportune Moments for Triggering Notifications. IEEE Pervasive Computing 13, 1 (Jan. 2014), 22–29. https://doi.org/10.1109/MPRV.2014.15",
      "doi": "10.1109/MPRV.2014.15"
    },
    {
      "text": "Kayela Robertson, Cody Rosasco, Kyle Feuz, Maureen Schmitter-Edgecombe, and Diane Cook. 2015. Prompting technologies: A comparison of time-based and context-aware transition-based prompting. Technology and health care : official journal of the European Society for Engineering and Medicine 23, 6 (2015), 745–756. https://doi.org/10.3233/THC-151033",
      "doi": ""
    },
    {
      "text": "Manaswi Saha, Michael Saugstad, Hanuma Teja Maddali, Aileen Zeng, Ryan Holland, Steven Bower, Aditya Dash, Sage Chen, Anthony Li, Kotaro Hara, and Jon Froehlich. 2019. Project Sidewalk: A Web-based Crowdsourcing Tool for Collecting Sidewalk Accessibility Data At Scale. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300292",
      "doi": "10.1145/3290605.3300292"
    },
    {
      "text": "Takeshi Sakaki, Makoto Okazaki, and Yutaka Matsuo. 2010. Earthquake shakes Twitter users: real-time event detection by social sensors. In Proceedings of the 19th international conference on World wide web(WWW ’10). Association for Computing Machinery, New York, NY, USA, 851–860. https://doi.org/10.1145/1772690.1772777",
      "doi": "10.1145/1772690.1772777"
    },
    {
      "text": "Hillol Sarker, Moushumi Sharmin, Amin Ahsan Ali, Md. Mahbubur Rahman, Rummana Bari, Syed Monowar Hossain, and Santosh Kumar. 2014. Assessing the Availability of Users to Engage in Just-in-time Intervention in the Natural Environment. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’14). ACM, New York, NY, USA, 909–920. https://doi.org/10.1145/2632048.2636082",
      "doi": "10.1145/2632048.2636082"
    },
    {
      "text": "SeeClickFix. 2008. SeeClickFix | 311 Request and Work Management Software. https://seeclickfix.com",
      "doi": ""
    },
    {
      "text": "Brian L. Sullivan, Christopher L. Wood, Marshall J. Iliff, Rick E. Bonney, Daniel Fink, and Steve Kelling. 2009. eBird: A citizen-based bird observation network in the biological sciences. Biological Conservation 142, 10 (Oct. 2009), 2282–2292. https://doi.org/10.1016/j.biocon.2009.05.006",
      "doi": ""
    },
    {
      "text": "J. Gregory Trafton, Erik M Altmann, Derek P Brock, and Farilee E Mintz. 2003. Preparing to resume an interrupted task: effects of prospective goal encoding and retrospective rehearsal. International Journal of Human-Computer Studies 58, 5 (May 2003), 583–603. https://doi.org/10.1016/S1071-5819(03)00023-5",
      "doi": "10.1016/S1071-5819%2803%2900023-5"
    },
    {
      "text": "Liam D. Turner, Stuart M. Allen, and Roger M. Whitaker. 2017. Reachable but not receptive: Enhancing smartphone interruptibility prediction by modelling the extent of user engagement with notifications. Pervasive and Mobile Computing 40 (Sept. 2017), 480–494. https://doi.org/10.1016/j.pmcj.2017.01.011",
      "doi": "10.1016/j.pmcj.2017.01.011"
    },
    {
      "text": "Heli Väätäjä and Paul Egglestone. 2012. Briefing news reporting with mobile assignments: perceptions, needs and challenges. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work(CSCW ’12). Association for Computing Machinery, New York, NY, USA, 485–494. https://doi.org/10.1145/2145204.2145280",
      "doi": "10.1145/2145204.2145280"
    },
    {
      "text": "Dominik Weber, Alexandra Voit, and Niels Henze. 2019. Clear All: A Large-Scale Observational Study on Mobile Notification Drawers. In Proceedings of Mensch und Computer 2019(MuC’19). Association for Computing Machinery, New York, NY, USA, 361–372. https://doi.org/10.1145/3340764.3340765",
      "doi": "10.1145/3340764.3340765"
    },
    {
      "text": "Huimin Wen, Zhongwei Hu, Jifu Guo, Liyun Zhu, and Jianping Sun. 2008. Operational Analysis on Beijing Road Network during the Olympic Games. Journal of Transportation Systems Engineering and Information Technology 8, 6 (Dec. 2008), 32–37. https://doi.org/10.1016/S1570-6672(09)60003-9",
      "doi": ""
    },
    {
      "text": "Tilo Westermann, Ina Wechsung, and Sebastian Möller. 2016. Smartphone Notifications in Context: a Case Study on Receptivity by the Example of an Advertising Service. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 2355–2361. https://doi.org/10.1145/2851581.2892383",
      "doi": "10.1145/2851581.2892383"
    },
    {
      "text": "Qian Yang, Alex Scuito, John Zimmerman, Jodi Forlizzi, and Aaron Steinfeld. 2018. Investigating How Experienced UX Designers Effectively Work with Machine Learning. In Proceedings of the 2018 Designing Interactive Systems Conference(DIS ’18). Association for Computing Machinery, New York, NY, USA, 585–596. https://doi.org/10.1145/3196709.3196730",
      "doi": "10.1145/3196709.3196730"
    }
  ]
}