{
  "doi": "10.1145/3411764.3445351",
  "title": "Effects of Semantic Segmentation Visualization on Trust, Situation Awareness, and Cognitive Load in Highly Automated Vehicles",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "Autonomous vehicles could improve mobility, safety, and inclusion in traffic. While this technology seems within reach, its successful introduction depends on the intended user’s acceptance. A substantial factor for this acceptance is trust in the autonomous vehicle’s capabilities. Visualizing internal information processed by an autonomous vehicle could calibrate this trust by enabling the perception of the vehicle’s detection capabilities (and its failures) while only inducing a low cognitive load. Additionally, the simultaneously raised situation awareness could benefit potential take-overs. We report the results of two comparative online studies on visualizing semantic segmentation information for the human user of autonomous vehicles. Effects on trust, cognitive load, and situation awareness were measured using a simulation (N=32) and state-of-the-art panoptic segmentation on a pre-recorded real-world video (N=41). Results show that the visualization using Augmented Reality increases situation awareness while remaining low cognitive load.",
  "authors": [
    {
      "name": "Mark Colley",
      "institution": "Institute of Media Informatics Ulm University, Germany",
      "img": "/do/10.1145/contrib-99659260328/rel-imgonly/img_6166.jpg",
      "acmid": "99659260328",
      "orcid": "0000-0001-5207-5029"
    },
    {
      "name": "Benjamin Eder",
      "institution": "Institute of Media Informatics Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702479",
      "orcid": "missing"
    },
    {
      "name": "Jan Ole Rixen",
      "institution": "Ulm University Institute of Media Informatics, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261477",
      "orcid": "missing"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "University of Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "Volkswagen AG. 2020. Head-up-Display. https://www.volkswagen-newsroom.com/de/head-up-display-3957. [Online; accessed: 07-AUGUST-2020].",
      "doi": ""
    },
    {
      "text": "Johannes Beller, Matthias Heesen, and Mark Vollrath. 2013. Improving the Driver–Automation Interaction: An Approach Using Automation Uncertainty. Human Factors 55, 6 (2013), 1130–1141. https://doi.org/10.1177/0018720813482327 PMID: 24745204.",
      "doi": ""
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1(1994), 49–59.",
      "doi": "10.1016/0005-7916%2894%2990063-9"
    },
    {
      "text": "S. Brandenburg and E. M. Skottke. 2014. Switching from manual to automated driving and reverse: Are drivers behaving more risky after highly automated driving?. In 17th International IEEE Conference on Intelligent Transportation Systems (ITSC). IEEE, New York, NY, USA, 2978–2983. https://doi.org/10.1109/ITSC.2014.6958168",
      "doi": ""
    },
    {
      "text": "John Brooke 1996. SUS-A quick and dirty usability scale. Usability evaluation in industry 189, 194 (1996), 4–7.",
      "doi": ""
    },
    {
      "text": "Bike Chen, Chen Gong, and Jian Yang. 2018. Importance-aware semantic segmentation for autonomous vehicles. IEEE Transactions on Intelligent Transportation Systems 20, 1(2018), 137–148. https://doi.org/10.1109/TITS.2018.2801309",
      "doi": ""
    },
    {
      "text": "Bowen Cheng. 2020. Panoptic-DeepLab. https://github.com/bowenc0221/panoptic-deeplab. [Online; accessed: 28-JULY-2020].",
      "doi": ""
    },
    {
      "text": "Bowen Cheng, Maxwell D. Collins, Yukun Zhu, Ting Liu, Thomas S. Huang, Hartwig Adam, and Liang-Chieh Chen. 2020. Panoptic-DeepLab: A Simple, Strong, and Fast Baseline for Bottom-Up Panoptic Segmentation. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition (CVPR). IEEE, New York, NY, USA, 12475–12485.",
      "doi": ""
    },
    {
      "text": "Mark Colley, Christian Bräuner, Mirjam Lanzer, Walch Marcel, Martin Baumann, and Rukzio Rukzio. 2020. Effect of Visualization of Pedestrian Intention Recognition on Trust and Cognitive Load. In Proceedings of the 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3409120.3410648",
      "doi": "10.1145/3409120.3410648"
    },
    {
      "text": "Marius Cordts, Mohamed Omran, Sebastian Ramos, Timo Rehfeld, Markus Enzweiler, Rodrigo Benenson, Uwe Franke, Stefan Roth, and Bernt Schiele. 2016. The Cityscapes Dataset for Semantic Urban Scene Understanding. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). IEEE, New York, NY, USA, 3213–3223.",
      "doi": ""
    },
    {
      "text": "Joost CF De Winter, Riender Happee, Marieke H Martens, and Neville A Stanton. 2014. Effects of adaptive cruise control and highly automated driving on workload and situation awareness: A review of the empirical evidence. Transportation research part F: traffic psychology and behaviour 27 (2014), 196–217.",
      "doi": ""
    },
    {
      "text": "Na Du, Jacob Haspiel, Qiaoning Zhang, Dawn Tilbury, Anuj K. Pradhan, X. Jessie Yang, and Lionel P. Robert. 2019. Look who’s talking now: Implications of AV’s explanations on driver’s trust, AV preference, anxiety and mental workload. Transportation Research Part C: Emerging Technologies 104 (2019), 428–442. https://doi.org/10.1016/j.trc.2019.05.025 ID: 271729.",
      "doi": ""
    },
    {
      "text": "Mica R Endsley, Stephen J Selcon, Thomas D Hardiman, and Darryl G Croft. 1998. A comparative analysis of SAGAT and SART for evaluations of situation awareness. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 42. SAGE Publications Sage CA: Los Angeles, CA, SAGE Publications, Los Angeles, CA, USA, 82–86.",
      "doi": ""
    },
    {
      "text": "Daniel J Fagnant and Kara Kockelman. 2015. Preparing a nation for autonomous vehicles: opportunities, barriers and policy recommendations. Transportation Research Part A: Policy and Practice 77 (2015), 167–181.",
      "doi": ""
    },
    {
      "text": "J. L. Gabbard, G. M. Fitch, and H. Kim. 2014. Behind the Glass: Driver Challenges and Opportunities for AR Automotive Applications. Proc. IEEE 102, 2 (2014), 124–136.",
      "doi": ""
    },
    {
      "text": "Clément Godard, Oisin Mac Aodha, Michael Firman, and Gabriel J. Brostow. 2019. Digging Into Self-Supervised Monocular Depth Estimation. In Proceedings of the IEEE/CVF International Conference on Computer Vision (ICCV). IEEE, New York, NY, USA, 3828–3838.",
      "doi": ""
    },
    {
      "text": "Renate Haeuslschmid, Yixin Shou, John O’Donovan, Gary Burnett, and Andreas Butz. 2016. First Steps towards a View Management Concept for Large-Sized Head-up Displays with Continuous Depth. In Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Ann Arbor, MI, USA) (Automotive’UI 16). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3003715.3005418",
      "doi": "10.1145/3003715.3005418"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, Amsterdam, The Netherlands, 139–183.",
      "doi": ""
    },
    {
      "text": "Renate Häuslschmid, Max von Bülow, Bastian Pfleging, and Andreas Butz. 2017. Supporting Trust in Autonomous Driving. In Proceedings of the 22nd International Conference on Intelligent User Interfaces (Limassol, Cyprus) (IUI ’17). Association for Computing Machinery, New York, NY, USA, 319–329. https://doi.org/10.1145/3025171.3025198",
      "doi": "10.1145/3025171.3025198"
    },
    {
      "text": "Tove Helldin, Göran Falkman, Maria Riveiro, and Staffan Davidsson. 2013. Presenting System Uncertainty in Automotive UIs for Supporting Trust Calibration in Autonomous Driving. In Proceedings of the 5th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(Eindhoven, Netherlands) (AutomotiveUI ’13). Association for Computing Machinery, New York, NY, USA, 210–217. https://doi.org/10.1145/2516540.2516554",
      "doi": "10.1145/2516540.2516554"
    },
    {
      "text": "Philipp Hock, Franziska Babel, Johannes Kraus, Enrico Rukzio, and Martin Baumann. 2019. Towards Opt-Out Permission Policies to Maximize the Use of Automated Driving. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 101–112. https://doi.org/10.1145/3342197.3344521",
      "doi": "10.1145/3342197.3344521"
    },
    {
      "text": "Philipp Hock, Johannes Kraus, Franziska Babel, Marcel Walch, Enrico Rukzio, and Martin Baumann. 2018. How to Design Valid Simulator Studies for Investigating User Experience in Automated Driving: Review and Hands-On Considerations. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Toronto, ON, Canada) (AutomotiveUI ’18). Association for Computing Machinery, New York, NY, USA, 105–117. https://doi.org/10.1145/3239060.3239066",
      "doi": "10.1145/3239060.3239066"
    },
    {
      "text": "Jiun-Yin Jian, Ann M Bisantz, and Colin G Drury. 2000. Foundations for an empirically determined scale of trust in automated systems. International Journal of Cognitive Ergonomics 4, 1 (2000), 53–71.",
      "doi": ""
    },
    {
      "text": "Christina Kaß, Stefanie Schoch, Frederik Naujoks, Sebastian Hergeth, Andreas Keinath, and Alexandra Neukum. 2020. Standardized Test Procedure for External Human–Machine Interfaces of Automated Vehicles. Information 11, 3 (2020), 173.",
      "doi": ""
    },
    {
      "text": "Tanja Keller and Sigmar-Olaf Tergan. 2005. Visualizing Knowledge and Information: An Introduction. Springer Berlin Heidelberg, Berlin, Heidelberg, 1–23. https://doi.org/10.1007/11510154_1",
      "doi": ""
    },
    {
      "text": "Jeamin Koo, Jungsuk Kwac, Wendy Ju, Martin Steinert, Larry Leifer, and Clifford Nass. 2015. Why did my car just do that? Explaining semi-autonomous driving actions to improve driver understanding, trust, and performance. International Journal on Interactive Design and Manufacturing (IJIDeM) 9, 4(2015), 269–275.",
      "doi": ""
    },
    {
      "text": "Moritz Körber. 2019. Theoretical Considerations and Development of a Questionnaire to Measure Trust in Automation. In Proceedings of the 20th Congress of the International Ergonomics Association (IEA 2018), Sebastiano Bagnara, Riccardo Tartaglia, Sara Albolino, Thomas Alexander, and Yushi Fujita(Eds.). Springer International Publishing, Cham, 13–30.",
      "doi": "10.1007/978-"
    },
    {
      "text": "Oswald Kothgassner, A Felnhofer, N Hauk, E Kastenhofer, J Gomm, and I Krysprin-Exner. 2013. Technology Usage Inventory. https://www.ffg.at/sites/default/files/allgemeine_downloads/thematische%20programme/programmdokumente/tui_manual.pdf. Manual. Wien: ICARUS 17, 04 (2013), 90. [Online; accessed: 05-JULY-2020].",
      "doi": ""
    },
    {
      "text": "Johannes Kraus, David Scholz, Dina Stiegemeier, and Martin Baumann. 0. The More You Know: Trust Dynamics and Calibration in Highly Automated Driving and the Effects of Take-Overs, System Malfunction, and System Transparency. Human Factors 0, 0 (0), 0018720819853686. https://doi.org/10.1177/0018720819853686 PMID: 31233695.",
      "doi": ""
    },
    {
      "text": "Alexander Kunze, Stephen J. Summerskill, Russell Marshall, and Ashleigh J. Filtness. 2018. Augmented Reality Displays for Communicating Uncertainty Information in Automated Driving. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Toronto, ON, Canada) (AutomotiveUI ’18). Association for Computing Machinery, New York, NY, USA, 164–175. https://doi.org/10.1145/3239060.3239074",
      "doi": "10.1145/3239060.3239074"
    },
    {
      "text": "Alexander Kunze, Stephen J. Summerskill, Russell Marshall, and Ashleigh J. Filtness. 2019. Conveying Uncertainties Using Peripheral Awareness Displays in the Context of Automated Driving. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 329–341. https://doi.org/10.1145/3342197.3344537",
      "doi": "10.1145/3342197.3344537"
    },
    {
      "text": "Miltos Kyriakidis, Riender Happee, and Joost CF de Winter. 2015. Public opinion on automated driving: Results of an international questionnaire among 5000 respondents. Transportation research part F: traffic psychology and behaviour 32 (2015), 127–140.",
      "doi": ""
    },
    {
      "text": "Patrick Lindemann, Tae-Young Lee, and Gerhard Rigoll. 2018. Catch my drift: Elevating situation awareness for highly automated driving with an explanatory windshield display user interface. Multimodal Technologies and Interaction 2, 4 (2018), 71.",
      "doi": ""
    },
    {
      "text": "Andreas Löcken, Wilko Heuten, and Susanne Boll. 2016. AutoAmbiCar: Using Ambient Light to Inform Drivers About Intentions of Their Automated Cars. In Adjunct Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Ann Arbor, MI, USA) (AutomotiveUI ’16 Adjunct). Association for Computing Machinery, New York, NY, USA, 57–62. https://doi.org/10.1145/3004323.3004329",
      "doi": "10.1145/3004323.3004329"
    },
    {
      "text": "Natasha Merat, A. Hamish Jamson, Frank C.H. Lai, Michael Daly, and Oliver M.J. Carsten. 2014. Transition to manual: Driver behaviour when resuming control from a highly automated vehicle. Transportation Research Part F: Traffic Psychology and Behaviour 27 (2014), 274 – 282. https://doi.org/10.1016/j.trf.2014.09.005",
      "doi": ""
    },
    {
      "text": "David Moher, Alessandro Liberati, Jennifer Tetzlaff, and Douglas G Altman. 2009. Preferred reporting items for systematic reviews and meta-analyses: the PRISMA statement. Annals of internal medicine 151, 4 (2009), 264–269.",
      "doi": ""
    },
    {
      "text": "Bonnie M Muir and Neville Moray. 1996. Trust in automation. Part II. Experimental studies of trust and human intervention in a process control simulation. Ergonomics 39, 3 (1996), 429–460.",
      "doi": ""
    },
    {
      "text": "Richard E Nisbett and Timothy D Wilson. 1977. The halo effect: evidence for unconscious alteration of judgments.Journal of personality and social psychology 35, 4(1977), 250.",
      "doi": ""
    },
    {
      "text": "Kimihiro Noguchi, Yulia R Gel, Edgar Brunner, and Frank Konietschke. 2012. nparLD: an R software package for the nonparametric analysis of longitudinal data in factorial experiments. Journal of Statistical Software 50, 12 (2012), 23.",
      "doi": ""
    },
    {
      "text": "Scott E. Page. 2008. Uncertainty, Difficulty, and Complexity. Journal of Theoretical Politics 20, 2 (2008), 115–149. https://doi.org/10.1177/0951629807085815",
      "doi": ""
    },
    {
      "text": "Indrajeet Patil. 2018. ggstatsplot: ’ggplot2’ Based Plots with Statistical Details. https://doi.org/10.5281/zenodo.2074621",
      "doi": ""
    },
    {
      "text": "Bastian Pfleging, Maurice Rang, and Nora Broy. 2016. Investigating User Needs for Non-Driving-Related Activities during Automated Driving. In Proceedings of the 15th International Conference on Mobile and Ubiquitous Multimedia (Rovaniemi, Finland) (MUM ’16). Association for Computing Machinery, New York, NY, USA, 91–99. https://doi.org/10.1145/3012709.3012735",
      "doi": "10.1145/3012709.3012735"
    },
    {
      "text": "Robert Rosenthal, Harris Cooper, and L Hedges. 1994. Parametric measures of effect size. The handbook of research synthesis 621, 2 (1994), 231–244.",
      "doi": ""
    },
    {
      "text": "Jeff Sauro. 2011. Measuring usability with the system usability scale (SUS).",
      "doi": ""
    },
    {
      "text": "Brandon Schoettle and Michael Sivak. 2014. A survey of public opinion about autonomous and self-driving vehicles in the US, the UK, and Australia. Technical Report. University of Michigan, Ann Arbor, Transportation Research Institute.",
      "doi": ""
    },
    {
      "text": "Missie Smith, Joseph L. Gabbard, and Christian Conley. 2016. Head-Up vs. Head-Down Displays: Examining Traditional Methods of Display Assessment While Driving. In Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Ann Arbor, MI, USA) (Automotive’UI 16). Association for Computing Machinery, New York, NY, USA, 185–192. https://doi.org/10.1145/3003715.3005419",
      "doi": "10.1145/3003715.3005419"
    },
    {
      "text": "Richard M Taylor. 2017. Situational awareness rating technique (SART): The development of a tool for aircrew systems design. In Situational awareness. Routledge, Abingdon, UK, 111–128.",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2019. Unity. Unity Technologies. https://unity.com/",
      "doi": ""
    },
    {
      "text": "Marc Wilbrink, Anna Schieben, and Michael Oehl. 2020. Reflecting the Automated Vehicle’s Perception and Intention: Light-Based Interaction Approaches for on-Board HMI in Highly Automated Vehicles. In Proceedings of the 25th International Conference on Intelligent User Interfaces Companion(Cagliari, Italy) (IUI ’20). Association for Computing Machinery, New York, NY, USA, 105–107. https://doi.org/10.1145/3379336.3381502",
      "doi": "10.1145/3379336.3381502"
    },
    {
      "text": "Philipp Wintersberger, Anna-Katharina Frison, Andreas Riener, and Tamara von Sawitzky. 2019. Fostering User Acceptance and Trust in Fully Automated Vehicles: Evaluating the Potential of Augmented Reality. PRESENCE: Virtual and Augmented Reality 27, 1 (2019), 46–62. https://doi.org/10.1162/pres_a_00320",
      "doi": "10.1162/pres_a_00320"
    }
  ]
}