{
  "doi": "10.1145/3411764.3445468",
  "title": "TUI as Social Entity: a Study of Joint-actuation and Turn-taking-actuation in Actuated-interfaces",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "We present an actuated-interface that is not only a tangible interface but also an autonomous object, designed as an independent entity that takes a similar role to the user’s role in an anagram word game. We highlight two leading interaction paradigms: Turn-taking-actuation and Joint-actuation, and evaluate both in a qualitative interaction study with the autonomous actuated-interface. Our findings reveal that all participants perceived the interaction as a social experience. The different interaction paradigms led to different interpretations: Turn-taking-actuation was interpreted as a competitive experience, while Joint-actuation was interpreted as a collaborative experience. The interaction paradigms also influenced the intensity of emotions and perception of control, with Joint-actuation leading to more intense emotions and higher sensitivity to control in the interaction. To conclude, our findings show that it is possible to design an actuated-interface that users perceive both as a tangible interface and as a social entity with its own intent.",
  "authors": [
    {
      "name": "Oren Zuckerman",
      "institution": "Media Innovation Lab The Interdisciplinary Center (IDC) Herzliya, Israel",
      "img": "/do/10.1145/contrib-81100224720/rel-imgonly/oren_h.jpg",
      "acmid": "81100224720",
      "orcid": "missing"
    },
    {
      "name": "Ofir Sadka",
      "institution": "Media Innovation Lab The Interdisciplinary Center (IDC) Herzlyia, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659182217",
      "orcid": "missing"
    },
    {
      "name": "Ron Gissin",
      "institution": "Media Innovation Lab The Interdisciplinary Center (IDC) Herzlyia, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702380",
      "orcid": "missing"
    },
    {
      "name": "Hadas Erel",
      "institution": "Media Innovation Lab The Interdisciplinary Center (IDC) Herzlyia, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260836",
      "orcid": "0000-0001-7099-6104"
    }
  ],
  "references": [
    {
      "text": "Tobias Alrøe, Jonas Grann, Erik Grönvall, Marianne Graves Petersen, and Jesper L Rasmussen. 2012. Aerial tunes: exploring interaction qualities of mid-air displays. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design. 514–523.",
      "doi": "10.1145/2399016.2399095"
    },
    {
      "text": "Lucy Anderson-Bashan, Benny Megidish, Hadas Erel, Iddo Wald, Guy Hoffman, Oren Zuckerman, and Andrey Grishko. 2018. The greeting machine: an abstract robotic object for opening encounters. In 2018 27th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 595–602.",
      "doi": "10.1109/ROMAN.2018.8525516"
    },
    {
      "text": "Alissa N Antle. 2007. The CTI framework: informing the design of tangible systems for children. In Proceedings of the 1st international conference on Tangible and embedded interaction. 195–202.",
      "doi": "10.1145/1226969.1227010"
    },
    {
      "text": "Matthew Barr. 2018. Student attitudes to games-based skills development: Learning from video games in higher education. Computers in Human Behavior 80 (2018), 283–294.",
      "doi": "10.1016/j.chb.2017.11.030"
    },
    {
      "text": "Michel Beaudouin-Lafon. 2004. Designing interaction, not interfaces. In Proceedings of the working conference on Advanced visual interfaces. 15–22.",
      "doi": "10.1145/989863.989865"
    },
    {
      "text": "Matthew Blackshaw, Anthony DeVincenzi, David Lakatos, Daniel Leithinger, and Hiroshi Ishii. 2011. Recompose: direct and gestural interaction with an actuated surface. In CHI’11 Extended Abstracts on Human Factors in Computing Systems. 1237–1242.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "Marcelo Coelho and Jamie Zigelbaum. 2011. Shape-changing interfaces. Personal and Ubiquitous Computing 15, 2 (2011), 161–173.",
      "doi": "10.1007/s00779-010-0311-y"
    },
    {
      "text": "Hadas Erel, Tzachi Shem Tov, Yoav Kessler, and Oren Zuckerman. 2019. Robots are Always Social: Robotic Movements are Automatically Interpreted as Social Cues. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3290607.3312758"
    },
    {
      "text": "Kenneth P Fishkin. 2004. A taxonomy for and analysis of tangible interfaces. Personal and Ubiquitous computing 8, 5 (2004), 347–358.",
      "doi": ""
    },
    {
      "text": "George W Fitzmaurice, Hiroshi Ishii, and William AS Buxton. 1995. Bricks: laying the foundations for graspable user interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. 442–449.",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation.. In Uist, Vol. 13. 2501988–2502032.",
      "doi": ""
    },
    {
      "text": "G Gibbs. 2008. Analysing qualitative data (Qualitative research kit). Retrieved from (2008).",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. 234–241.",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Robert JK Jacob, Audrey Girouard, Leanne M Hirshfield, Michael S Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. 2008. Reality-based interaction: a framework for post-WIMP interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. 201–210.",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "Wendy Ju and Leila Takayama. 2009. Approachability: How people interpret automatic door movement as gesture. International Journal of Design 3, 2 (2009).",
      "doi": ""
    },
    {
      "text": "Hyunyoung Kim, Céline Coutrix, and Anne Roudaut. 2019. KnobSlider: Design of a Shape-Changing Parameter Control UI and User Preference Study on Its Speed and Tangibility. Frontiers in Robotics and AI 6 (2019), 79.",
      "doi": ""
    },
    {
      "text": "Matthew V Law, JiHyun Jeong, Amritansh Kwatra, Malte F Jung, and Guy Hoffman. 2019. Negotiating the Creative Space in Human-Robot Collaborative Design. In Proceedings of the 2019 on Designing Interactive Systems Conference. 645–657.",
      "doi": "10.1145/3322276.3322343"
    },
    {
      "text": "Michal Luria, Guy Hoffman, Benny Megidish, Oren Zuckerman, and Sung Park. 2016. Designing Vyo, a robotic Smart Home assistant: Bridging the gap between device and social agent. In 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 1019–1025.",
      "doi": "10.1109/ROMAN.2016.7745234"
    },
    {
      "text": "Benny Megidish. 2017. Butter. https://butter-robotics.web.app/",
      "doi": ""
    },
    {
      "text": "Benny Megidish, Oren Zuckerman, and Guy Hoffman. 2017. Animating mechanisms: A pipeline for authoring robot gestures. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. 45–45.",
      "doi": "10.1145/3029798.3036667"
    },
    {
      "text": "Ditte Hvas Mortensen, Sam Hepworth, Kirstine Berg, and Marianne Graves Petersen. 2012. ” It’s in love with you” communicating status and preference with simple product movements. In CHI’12 Extended Abstracts on Human Factors in Computing Systems. 61–70.",
      "doi": ""
    },
    {
      "text": "Ken Nakagaki, Sean Follmer, and Hiroshi Ishii. 2015. Lineform: Actuated curve interfaces for display, interaction, and constraint. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 333–339.",
      "doi": "10.1145/2807442.2807452"
    },
    {
      "text": "Austin Lee Nichols and Jon K Maner. 2008. The good-subject effect: Investigating participant demand characteristics. The Journal of general psychology 135, 2 (2008), 151–166.",
      "doi": ""
    },
    {
      "text": "Diana Nowacka and David Kirk. 2014. Tangible autonomous interfaces (TAIs) exploring autonomous behaviours in TUIs. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. 1–8.",
      "doi": "10.1145/2540930.2540942"
    },
    {
      "text": "Raymond Opdenakker. 2006. Advantages and disadvantages of four interview techniques in qualitative research. In Forum qualitative sozialforschung/forum: Qualitative social research, Vol. 7.",
      "doi": ""
    },
    {
      "text": "Gian Pangaro, Dan Maynes-Aminzade, and Hiroshi Ishii. 2002. The actuated workbench: computer-controlled actuation in tabletop tangible interfaces. In Proceedings of the 15th annual ACM symposium on User interface software and technology. 181–190.",
      "doi": "10.1145/571985.572011"
    },
    {
      "text": "James Patten and Hiroshi Ishii. 2007. Mechanical constraints as computational constraints in tabletop tangible interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. 809–818.",
      "doi": "10.1145/1240624.1240746"
    },
    {
      "text": "Esben W Pedersen, Sriram Subramanian, and Kasper Hornbæk. 2014. Is my phone alive? A large-scale study of shape change in handheld devices using videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2579–2588.",
      "doi": "10.1145/2556288.2557018"
    },
    {
      "text": "Ivan Poupyrev, Tatsushi Nashida, and Makoto Okabe. 2007. Actuation and tangible user interfaces: the Vaucanson duck, robots, and shape displays. In Proceedings of the 1st international conference on Tangible and embedded interaction. 205–212.",
      "doi": "10.1145/1226969.1227012"
    },
    {
      "text": "Majken Kirkegaard Rasmussen, Erik Grönvall, Sofie Kinch, and Marianne Graves Petersen. 2013. ” It’s alive, it’s magic, it’s in love with you” opportunities, challenges and open questions for actuated interfaces. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration. 63–72.",
      "doi": ""
    },
    {
      "text": "Majken Kirkegård Rasmussen, Timothy Merritt, Miguel Bruns Alonso, and Marianne Graves Petersen. 2016. Balancing user and system control in shape-changing interfaces: a designerly exploration. In Proceedings of the TEI’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. 202–210.",
      "doi": "10.1145/2839462.2839499"
    },
    {
      "text": "Eckard Riedenklau, Thomas Hermann, and Helge Ritter. 2012. An integrated multi-modal actuated tangible user interface for distributed collaborative planning. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction. 169–174.",
      "doi": "10.1145/2148131.2148167"
    },
    {
      "text": "Dan Rosenfeld, Michael Zawadzki, Jeremi Sudol, and Ken Perlin. 2004. Physical objects as bidirectional user interface elements. IEEE Computer Graphics and Applications 24, 1 (2004), 44–49.",
      "doi": "10.1109/MCG.2004.1255808"
    },
    {
      "text": "Anne Roudaut, Abhijit Karnik, Markus Löchtefeld, and Sriram Subramanian. 2013. Morphees: toward high” shape resolution” in self-actuated flexible mobile devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 593–602.",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "Orit Shaer and Eva Hornecker. 2010. Tangible user interfaces: past, present, and future directions. Now Publishers Inc.",
      "doi": ""
    },
    {
      "text": "Stuart M Shieber. 1996. A call for collaborative interfaces. ACM Computing Surveys (CSUR) 28, 4es (1996), 143–es.",
      "doi": "10.1145/242224.242408"
    },
    {
      "text": "Marco Spadafora, Victor Chahuneau, Nikolas Martelaro, David Sirkin, and Wendy Ju. 2016. Designing the behavior of interactive objects. In Proceedings of the TEI’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. 70–77.",
      "doi": "10.1145/2839462.2839502"
    },
    {
      "text": "Miriam Sturdee and Jason Alexander. 2018. Analysis and classification of shape-changing interfaces for design and application-based research. ACM Computing Surveys (CSUR) 51, 1 (2018), 1–32.",
      "doi": "10.1145/3143559"
    },
    {
      "text": "Ivan E Sutherland. 1965. The ultimate display. Multimedia: From Wagner to virtual reality 1 (1965).",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Jun Kato, Mark D Gross, and Tom Yeh. 2018. Reactile: Programming swarm user interfaces through direct physical manipulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173773"
    },
    {
      "text": "Haodan Tan, John Tiab, Selma Šabanović, and Kasper Hornbæk. 2016. Happy moves, sad grooves: using theories of biological motion and affect to design shape-changing interfaces. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 1282–1293.",
      "doi": "10.1145/2901790.2901845"
    },
    {
      "text": "John Tiab and Kasper Hornbæk. 2016. Understanding affordance, system state, and feedback in shape-changing buttons. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 2752–2763.",
      "doi": "10.1145/2858036.2858350"
    },
    {
      "text": "Oren Zuckerman, Dina Walker, Andrey Grishko, Tal Moran, Chen Levy, Barak Lisak, Iddo Yehoshua Wald, and Hadas Erel. 2020. Companionship Is Not a Function: The Effect of a Novel Robotic Object on Healthy Older Adults’ Feelings of” Being-Seen”. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376411"
    }
  ]
}