{
  "doi": "10.1145/3411764.3445719",
  "title": "“Warm Bodies”: A Post-Processing Technique for Animating Dynamic Blood Flow on Photos and Avatars",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2021,
  "badges": [],
  "abstract": "What breathes life into an embodied agent or avatar? While body motions such as facial expressions, speech and gestures have been well studied, relatively little attention has been applied to subtle changes due to underlying physiology. We argue that subtle pulse signals are important for creating more lifelike and less disconcerting avatars. We propose a method for animating blood flow patterns, based on a data-driven physiological model that can be used to directly augment the appearance of synthetic avatars and photo-realistic faces. While the changes are difficult for participants to “see”, they significantly more frequently select faces with blood flow as more anthropomorphic and animated than faces without blood flow. Furthermore, by manipulating the frequency of the heart rate in the underlying signal we can change the perceived arousal of the character.",
  "authors": [
    {
      "name": "Daniel McDuff",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490688111",
      "orcid": "missing"
    },
    {
      "name": "Ewa M. Nowara",
      "institution": "Rice University, Houston, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660007181",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mohammed Hazim Alkawaz and Ahmad Hoirul Basori. 2012. The effect of emotional colour on creating realistic expression of avatar. In Proceedings of the 11th ACM SIGGRAPH international conference on virtual-reality continuum and its applications in industry. ACM, 143–152.",
      "doi": "10.1145/2407516.2407555"
    },
    {
      "text": "Mohammed Hazim Alkawaz, Ahmad Hoirul Basori, and Siti Zaiton Mohd Hashim. 2017. Oxygenation absorption and light scattering driven facial animation of natural virtual human. Multimedia Tools and Applications 76, 7 (2017), 9587–9623.",
      "doi": "10.1007/s11042-016-3564-2"
    },
    {
      "text": "Christoph Bartneck, Elizabeth Croft, and Dana Kulic. 2008. Measuring the anthropomorphism, animacy, likeability, perceived intelligence and perceived safety of robots. (2008).",
      "doi": ""
    },
    {
      "text": "Ethan B Blackford, Justin R Estepp, and Daniel J McDuff. 2018. Remote spectral measurements of the blood volume pulse with applications for imaging photoplethysmography. In Optical Diagnostics and Sensing XVIII: Toward Point-of-Care Diagnostics, Vol. 10501. International Society for Optics and Photonics, 105010Z.",
      "doi": ""
    },
    {
      "text": "Anne M Brumfield and Michael E Andrew. 2005. Digital pulse contour analysis: investigating age-dependent indices of arterial compliance. Physiological measurement 26, 5 (2005), 599.",
      "doi": ""
    },
    {
      "text": "Weixuan Chen and Daniel McDuff. 2018. DeepMag: Source Specific Motion Magnification Using Gradient Ascent. arXiv preprint arXiv:1808.03338(2018).",
      "doi": ""
    },
    {
      "text": "Weixuan Chen and Daniel McDuff. 2018. Deepphys: Video-based physiological measurement using convolutional attention networks. In Proceedings of the European Conference on Computer Vision (ECCV). 349–365.",
      "doi": "10.1007/978-3-030-01216-8_22"
    },
    {
      "text": "Eugene d’Eon, David Luebke, and Eric Enderton. 2007. Efficient rendering of human skin. In Proceedings of the 18th Eurographics conference on Rendering Techniques. Eurographics Association, 147–157.",
      "doi": ""
    },
    {
      "text": "Justin R Estepp, Ethan B Blackford, and Christopher M Meier. 2014. Recovering pulse rate during motion artifact with a multi-imager array for non-contact imaging photoplethysmography. In 2014 IEEE International Conference on Systems, Man, and Cybernetics (SMC). IEEE, 1462–1469.",
      "doi": ""
    },
    {
      "text": "Shaojing Fan, Tian-Tsong Ng, Jonathan S Herberg, Bryan L Koenig, and Shiqing Xin. 2012. Real or fake?: human judgments about photographs and computer-generated images of faces. In SIGGRAPH Asia 2012 technical briefs. ACM, 17.",
      "doi": ""
    },
    {
      "text": "Thomas B Fitzpatrick. 1988. The validity and practicality of sun-reactive skin types I through VI. Archives of dermatology 124, 6 (1988), 869–871.",
      "doi": ""
    },
    {
      "text": "Arthur SP Jansen, Xay Van Nguyen, Vladimir Karpitskiy, Thomas C Mettenleiter, and Arthur D Loewy. 1995. Central command neurons of the sympathetic nervous system: basis of the fight-or-flight response. Science 270, 5236 (1995), 644–646.",
      "doi": ""
    },
    {
      "text": "Jorge Jimenez, Timothy Scully, Nuno Barbosa, Craig Donner, Xenxo Alvarez, Teresa Vieira, Paul Matts, Verónica Orvalho, Diego Gutierrez, and Tim Weyrich. 2010. A practical appearance model for dynamic facial color. ACM Transactions on Graphics (TOG) 29, 6 (2010), 141.",
      "doi": "10.1145/1882261.1866167"
    },
    {
      "text": "Jorge Jimenez, David Whelan, Veronica Sundstedt, and Diego Gutierrez. 2010. Real-time realistic skin translucency. IEEE Computer Graphics and Applications 30, 4 (2010), 32–41.",
      "doi": "10.1109/MCG.2010.39"
    },
    {
      "text": "Aobo Jin, Qixin Deng, Yuting Zhang, and Zhigang Deng. 2019. A Deep Learning-Based Model for Head and Eye Motion Generation in Three-party Conversations. Proceedings of the ACM on Computer Graphics and Interactive Techniques 2, 2(2019), 1–19.",
      "doi": "10.1145/3340250"
    },
    {
      "text": "Alexei A Kamshilin, Serguei Miridonov, Victor Teplov, Riku Saarenheimo, and Ervin Nippolainen. 2011. Photoplethysmographic imaging of high spatial resolution. Biomedical optics express 2, 4 (2011), 996–1006.",
      "doi": ""
    },
    {
      "text": "Jari Kätsyri, Klaus Förger, Meeri Mäkäräinen, and Tapio Takala. 2015. A review of empirical evidence on different uncanny valley hypotheses: support for perceptual mismatch as one road to the valley of eeriness. Frontiers in psychology 6 (2015), 390.",
      "doi": ""
    },
    {
      "text": "Natasha Kholgade, Iain Matthews, and Yaser Sheikh. 2011. Content retargeting using parameter-parallel facial layers. In Proceedings of the 2011 ACM SIGGRAPH/Eurographics Symposium on Computer Animation. ACM, 195–204.",
      "doi": "10.1145/2019406.2019433"
    },
    {
      "text": "Mayank Kumar, James Suliburk, Ashok Veeraraghavan, and Ashutosh Sabharwal. 2016. PulseCam: High-resolution blood perfusion imaging using a camera and a pulse oximeter. In 2016 38th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 3904–3909.",
      "doi": ""
    },
    {
      "text": "Mayank Kumar, Ashok Veeraraghavan, and Ashutosh Sabharwal. 2015. DistancePPG: Robust non-contact vital signs monitoring using a camera. Biomedical optics express 6, 5 (2015), 1565–1588.",
      "doi": ""
    },
    {
      "text": "Seunghwan Lee, Moonseok Park, Kyoungmin Lee, and Jehee Lee. 2019. Scalable muscle-actuated human simulation and control. ACM Transactions on Graphics (TOG) 38, 4 (2019), 1–13.",
      "doi": "10.1145/3306346.3322972"
    },
    {
      "text": "Xueming Lin and Gerard de Haan. 2014. Using blood volume pulse vector to extract rPPG signal in infrared spectrum. (2014).",
      "doi": ""
    },
    {
      "text": "Xiaolei Lv, Jinxiang Chai, and Shihong Xia. 2016. Data-driven inverse dynamics for human motion. ACM Transactions on Graphics (TOG) 35, 6 (2016), 163.",
      "doi": "10.1145/2980179.2982440"
    },
    {
      "text": "Meeri Mäkäräinen, Jari Kätsyri, and Tapio Takala. 2014. Exaggerating facial expressions: A way to intensify emotion or a way to the uncanny valley?Cognitive Computation 6, 4 (2014), 708–721.",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Ethan B Blackford, Justin R Estepp, and Izumi Nishidate. 2018. A fast non-contact imaging photoplethysmography method using a tissue-like model. In Optical Diagnostics and Sensing XVIII: Toward Point-of-Care Diagnostics, Vol. 10501. International Society for Optics and Photonics, 105010Q.",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Sarah Gontarek, and Rosalind W Picard. 2014. Improvements in remote cardiopulmonary measurement using a five band digital camera. IEEE Transactions on Biomedical Engineering 61, 10 (2014), 2593–2601.",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Sarah Gontarek, and Rosalind W Picard. 2014. Remote detection of photoplethysmographic systolic and diastolic peaks using a digital camera. IEEE Transactions on Biomedical Engineering 61, 12 (2014), 2948–2954.",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Christophe Hurter, and Mar Gonzalez-Franco. 2017. Pulse and vital sign measurement in mixed reality using a HoloLens. In Proceedings of the 23rd ACM Symposium on Virtual Reality Software and Technology. 1–9.",
      "doi": "10.1145/3139131.3139134"
    },
    {
      "text": "Wade J Mitchell, Kevin A Szerszen Sr, Amy Shirong Lu, Paul W Schermerhorn, Matthias Scheutz, and Karl F MacDorman. 2011. A mismatch in the human realism of face and voice produces an uncanny valley. i-Perception 2, 1 (2011), 10–12.",
      "doi": ""
    },
    {
      "text": "M. Mori. 1970. The uncanny valley. Energy 7, 4 (1970), 33–35.",
      "doi": ""
    },
    {
      "text": "Izumi Nishidate, Kiyohiro Sasaoka, Testuya Yuasa, Kyuichi Niizeki, Takaaki Maeda, and Yoshihisa Aizu. 2008. Visualizing of skin chromophore concentrations by use of RGB images. Optics letters 33, 19 (2008), 2263–2265.",
      "doi": ""
    },
    {
      "text": "Izumi Nishidate, Chihiro Tanabe, Daniel J McDuff, Kazuya Nakano, Kyuichi Niizeki, Yoshihisa Aizu, and Hideaki Haneishi. 2019. RGB camera-based noncontact imaging of plethysmogram and spontaneous low-frequency oscillation in skin perfusion before and during psychological stress. In Optical Diagnostics and Sensing XIX: Toward Point-of-Care Diagnostics, Vol. 10885. International Society for Optics and Photonics, 1088507.",
      "doi": ""
    },
    {
      "text": "Ewa Magdalena Nowara, Tim K Marks, Hassan Mansour, and Ashok Veeraraghavan. 2018. SparsePPG: towards driver monitoring using camera-based vital signs estimation in near-infrared. In 2018 IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). IEEE, 1353–135309.",
      "doi": ""
    },
    {
      "text": "Ewa M Nowara, Daniel McDuff, and Ashok Veeraraghavan. 2020. A Meta-Analysis of the Impact of Skin Tone and Gender on Non-Contact Photoplethysmography Measurements. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops. 284–285.",
      "doi": ""
    },
    {
      "text": "Tae-Hyun Oh, Ronnachai Jaroensri, Changil Kim, Mohamed Elgharib, Fr’edo Durand, William T Freeman, and Wojciech Matusik. 2018. Learning-based video motion magnification. In Proceedings of the European Conference on Computer Vision (ECCV). 633–648.",
      "doi": "10.1007/978-3-030-01225-0_39"
    },
    {
      "text": "Ming-Zher Poh, Daniel McDuff, and Rosalind W Picard. 2010. Non-contact, automated cardiac pulse measurements using video imaging and blind source separation.Optics express 18, 10 (2010), 10762–10774.",
      "doi": ""
    },
    {
      "text": "Emmanuel Promayon, Pierre Baconnier, and Claude Puech. 1997. Physically-based model for simulating the human trunk respiration movements. In CVRMed-MRCAS’97. Springer, 379–388.",
      "doi": ""
    },
    {
      "text": "AM Seifalian, G Stansby, A Jackson, K Howell, and G Hamilton. 1994. Comparison of laser Doppler perfusion imaging, laser Doppler flowmetry, and thermographic imaging for assessment of blood flow in human skin. European journal of vascular surgery 8, 1 (1994), 65–69.",
      "doi": ""
    },
    {
      "text": "Myoung Kook Seo, Hyuk Jin Kwon, Bilal Ahmed, Young Yi Lee, Jae Doug Yoo, In Yeop Jang, Seung Joo Lee, Kwan H Lee, 2012. Rendering of human skin during physical exercise. In ACM SIGGRAPH 2012 Posters. ACM, 111.",
      "doi": "10.1145/2342896.2343024"
    },
    {
      "text": "Michael Seymour, Kai Riemer, and Judy Kay. 2019. Mapping Beyond the Uncanny Valley: A Delphi Study on Aiding Adoption of Realistic Digital Faces.. In HICSS. 1–11.",
      "doi": ""
    },
    {
      "text": "Supasorn Suwajanakorn, Steven M Seitz, and Ira Kemelmacher-Shlizerman. 2017. Synthesizing obama: learning lip sync from audio. ACM Transactions on Graphics (TOG) 36, 4 (2017), 95.",
      "doi": "10.1145/3072959.3073640"
    },
    {
      "text": "Sarah Taylor, Taehwan Kim, Yisong Yue, Moshe Mahler, James Krahe, Anastasio Garcia Rodriguez, Jessica Hodgins, and Iain Matthews. 2017. A deep learning approach for generalized speech animation. ACM Transactions on Graphics (TOG) 36, 4 (2017), 93.",
      "doi": "10.1145/3072959.3073699"
    },
    {
      "text": "Aggeliki Tsoli, Naureen Mahmood, and Michael J Black. 2014. Breathing life into shape: capturing, modeling and animating 3D human breathing. ACM Transactions on graphics (TOG) 33, 4 (2014), 52.",
      "doi": "10.1145/2601097.2601225"
    },
    {
      "text": "Sergey Tulyakov, Xavier Alameda-Pineda, Elisa Ricci, Lijun Yin, Jeffrey F Cohn, and Nicu Sebe. 2016. Self-adaptive matrix completion for heart rate estimation from face videos under realistic conditions. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 2396–2404.",
      "doi": ""
    },
    {
      "text": "Wim Verkruysse, Lars O Svaasand, and J Stuart Nelson. 2008. Remote plethysmographic imaging using ambient light.Optics express 16, 26 (2008), 21434–21445.",
      "doi": ""
    },
    {
      "text": "Neal Wadhwa, Michael Rubinstein, Frédo Durand, and William T Freeman. 2013. Phase-based video motion processing. ACM Transactions on Graphics (TOG) 32, 4 (2013), 80.",
      "doi": "10.1145/2461912.2461966"
    },
    {
      "text": "Wenjin Wang, Albertus C den Brinker, Sander Stuijk, and Gerard de Haan. 2016. Algorithmic principles of remote PPG. IEEE Transactions on Biomedical Engineering 64, 7 (2016), 1479–1491.",
      "doi": ""
    },
    {
      "text": "Wenjin Wang, Albertus C den Brinker, Sander Stuijk, and Gerard de Haan. 2017. Algorithmic principles of remote PPG. IEEE Transactions on Biomedical Engineering 64, 7 (2017), 1479–1491.",
      "doi": ""
    },
    {
      "text": "Benjamin Weyrauch, Bernd Heisele, Jennifer Huang, and Volker Blanz. 2004. Component-based face recognition with 3D morphable models. In 2004 Conference on Computer Vision and Pattern Recognition Workshop. IEEE, 85–85.",
      "doi": ""
    },
    {
      "text": "Hao-Yu Wu, Michael Rubinstein, Eugene Shih, John Guttag, Frédo Durand, and William Freeman. 2012. Eulerian video magnification for revealing subtle changes in the world. (2012).",
      "doi": ""
    }
  ]
}