{
  "doi": "10.1145/3411764.3445138",
  "title": "Vid2Doppler: Synthesizing Doppler Radar Data from Videos for Training Privacy-Preserving Activity Recognition",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2021,
  "badges": [],
  "abstract": "Millimeter wave (mmWave) Doppler radar is a new and promising sensing approach for human activity recognition, offering signal richness approaching that of microphones and cameras, but without many of the privacy-invading downsides. However, unlike audio and computer vision approaches that can draw from huge libraries of videos for training deep learning models, Doppler radar has no existing large datasets, holding back this otherwise promising sensing modality. In response, we set out to create a software pipeline that converts videos of human activities into realistic, synthetic Doppler radar data. We show how this cross-domain translation can be successful through a series of experimental results. Overall, we believe our approach is an important stepping stone towards significantly reducing the burden of training such as human sensing systems, and could help bootstrap uses in human-computer interaction.",
  "tags": [
    "Human activity recognition",
    "HAR",
    "Privacy-preserving sensing",
    "Doppler sensing",
    "Datasets",
    "Cross domain translation"
  ],
  "authors": [
    {
      "name": "Karan Ahuja",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99659136980/rel-imgonly/karan_pic.png",
      "acmid": "99659136980",
      "orcid": "0000-0003-2497-0530"
    },
    {
      "name": "Yue Jiang",
      "institution": "Max Planck Institute for Informatics, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659698169",
      "orcid": "missing"
    },
    {
      "name": "Mayank Goel",
      "institution": "School of Computer Science Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500642496",
      "orcid": "0000-0003-1237-7545"
    },
    {
      "name": "Chris Harrison",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "2004. CMU MoCap. http://mocap.cs.cmu.edu/.",
      "doi": ""
    },
    {
      "text": "2004. SFU MoCap. https://mocap.cs.sfu.ca/.",
      "doi": ""
    },
    {
      "text": "Nimsiri Abhayasinghe and Iain Murray. 2014. Human activity recognition using thigh angle derived from single thigh mounted imu data. In 2014 International Conference on Indoor Positioning and Indoor Navigation (IPIN). IEEE, 111–115.",
      "doi": ""
    },
    {
      "text": "Sami Abu-El-Haija, Nisarg Kothari, Joonseok Lee, Paul Natsev, George Toderici, Balakrishnan Varadarajan, and Sudheendra Vijayanarasimhan. 2016. Youtube-8m: A large-scale video classification benchmark. arXiv preprint arXiv:1609.08675(2016).",
      "doi": ""
    },
    {
      "text": "Karan Ahuja, Dohyun Kim, Franceska Xhakaj, Virag Varga, Anne Xie, Stanley Zhang, Jay Eric Townsend, Chris Harrison, Amy Ogan, and Yuvraj Agarwal. 2019. EduSense: Practical classroom sensing at Scale. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 1–26.",
      "doi": "10.1145/3351229"
    },
    {
      "text": "H-E Albrecht, Nils Damaschke, Michael Borys, and Cameron Tropea. 2013. Laser Doppler and phase Doppler measurement techniques. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Md Tanvir Islam Aumi, Sidhant Gupta, Mayank Goel, Eric Larson, and Shwetak Patel. 2013. DopLink: using the doppler effect for multi-device interaction. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. 583–586.",
      "doi": "10.1145/2493432.2493515"
    },
    {
      "text": "Yusuf Aytar, Carl Vondrick, and Antonio Torralba. 2016. Soundnet: Learning sound representations from unlabeled video. In Advances in neural information processing systems. 892–900.",
      "doi": ""
    },
    {
      "text": "Fabien Baradel, Christian Wolf, and Julien Mille. 2018. Human activity recognition with pose-driven attention to rgb.",
      "doi": ""
    },
    {
      "text": "Barry C Barish and Rainer Weiss. 1999. LIGO and the detection of gravitational waves. Physics Today 52(1999), 44–50.",
      "doi": ""
    },
    {
      "text": "Djamila Romaissa Beddiar, Brahim Nini, Mohammad Sabokrou, and Abdenour Hadid. 2020. Vision-based human activity recognition: a survey. Multimedia Tools and Applications 79, 41 (2020), 30509–30555.",
      "doi": "10.1007/s11042-020-09004-3"
    },
    {
      "text": "Fabian Caba Heilbron, Victor Escorcia, Bernard Ghanem, and Juan Carlos Niebles. 2015. Activitynet: A large-scale video benchmark for human activity understanding. In Proceedings of the ieee conference on computer vision and pattern recognition. 961–970.",
      "doi": ""
    },
    {
      "text": "Kelly E Caine, Arthur D Fisk, and Wendy A Rogers. 2006. Benefits and privacy concerns of a home equipped with a visual sensing system: A perspective from older adults. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. SAGE Publications Sage CA: Los Angeles, CA, 180–184.",
      "doi": ""
    },
    {
      "text": "Joao Carreira and Andrew Zisserman. 2017. Quo vadis, action recognition? a new model and the kinetics dataset. In proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 6299–6308.",
      "doi": ""
    },
    {
      "text": "Pierluigi Casale, Oriol Pujol, and Petia Radeva. 2011. Human activity recognition from accelerometer data using a wearable device. In Iberian Conference on Pattern Recognition and Image Analysis. Springer, 289–296.",
      "doi": ""
    },
    {
      "text": "Chen Chen, Roozbeh Jafari, and Nasser Kehtarnavaz. 2015. UTD-MHAD: A multimodal dataset for human action recognition utilizing a depth camera and a wearable inertial sensor. In 2015 IEEE International conference on image processing (ICIP). IEEE, 168–172.",
      "doi": "10.1109/ICIP.2015.7350781"
    },
    {
      "text": "Ke-Yu Chen, Daniel Ashbrook, Mayank Goel, Sung-Hyuck Lee, and Shwetak Patel. 2014. AirLink: sharing files between multiple devices using in-air gestures. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 565–569.",
      "doi": "10.1145/2632048.2632090"
    },
    {
      "text": "Qingchao Chen, Kevin Chetty, Karl Woodbridge, and Bo Tan. 2016. Signs of life detection using wireless passive radar. In 2016 IEEE Radar Conference (RadarConf). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Qingchao Chen, Yang Liu, Francesco Fioranelli, Matthiew Ritchie, and Kevin Chetty. 2019. Eliminate Aspect Angle Variations for Human Activity Recognition using Unsupervised Deep Adaptation Network. In 2019 IEEE Radar Conference (RadarConf). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Qingchao Chen, Yang Liu, Bo Tan, Karl Woodbridge, and Kevin Chetty. 2020. Respiration and Activity Detection Based on Passive Radio Sensing in Home Environments. IEEE Access 8(2020), 12426–12437.",
      "doi": ""
    },
    {
      "text": "Qingchao Chen, Matthew Ritchie, Yang Liu, Kevin Chetty, and Karl Woodbridge. 2017. Joint fall and aspect angle recognition using fine-grained micro-Doppler classification. In 2017 IEEE Radar Conference (RadarConf). IEEE, 0912–0916.",
      "doi": ""
    },
    {
      "text": "Qingchao Chen, Bo Tan, Kevin Chetty, and Karl Woodbridge. 2016. Activity recognition based on micro-Doppler signature with in-home Wi-Fi. In 2016 IEEE 18th International Conference on e-Health Networking, Applications and Services (Healthcom). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Kevin Chetty, Graeme E Smith, and Karl Woodbridge. 2011. Through-the-wall sensing of personnel using passive bistatic wifi radar at standoff distances. IEEE Transactions on Geoscience and Remote Sensing 50, 4 (2011), 1218–1226.",
      "doi": ""
    },
    {
      "text": "Vasileios Choutas, Philippe Weinzaepfel, Jérôme Revaud, and Cordelia Schmid. 2018. Potion: Pose motion representation for action recognition. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 7024–7033.",
      "doi": ""
    },
    {
      "text": "CNBC. 2020. Google Data Leaks. Retrieved 2020 from https://www.cnbc.com/2019/07/11/google-admits-leaked-private-voice-conversations.html",
      "doi": ""
    },
    {
      "text": "Digikey. 2020. DigiKey Doppler Sensor TI. Retrieved 2020 from https://www.digikey.com/product-detail/en/texas-instruments/AWR1642ABIGABLRQ1/296-49116-2-ND/9169365",
      "doi": ""
    },
    {
      "text": "Jeffrey Donahue, Lisa Anne Hendricks, Sergio Guadarrama, Marcus Rohrbach, Subhashini Venugopalan, Kate Saenko, and Trevor Darrell. 2015. Long-term recurrent convolutional networks for visual recognition and description. In Proceedings of the IEEE conference on computer vision and pattern recognition. 2625–2634.",
      "doi": ""
    },
    {
      "text": "Wenbin Du, Yali Wang, and Yu Qiao. 2017. Rpan: An end-to-end recurrent pose-attention network for action recognition in videos. In Proceedings of the IEEE International Conference on Computer Vision. 3725–3734.",
      "doi": ""
    },
    {
      "text": "Yong Du, Wei Wang, and Liang Wang. 2015. Hierarchical recurrent neural network for skeleton based action recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition. 1110–1118.",
      "doi": ""
    },
    {
      "text": "Miikka Ermes, Juha Parkka, and Luc Cluitmans. 2008. Advancing from offline to online activity recognition with wearable sensors. In 2008 30th Annual International Conference of the IEEE Engineering in Medicine and Biology Society. IEEE, 4451–4454.",
      "doi": ""
    },
    {
      "text": "Barıs Erol and Sevgi Zubeyde Gurbuz. 2015. A kinect-based human micro-doppler simulator. IEEE Aerospace and Electronic Systems Magazine 30, 5 (2015), 6–17.",
      "doi": ""
    },
    {
      "text": "Baris Erol, Sevgi Z Gurbuz, and Moeness G Amin. 2019. GAN-based synthetic radar micro-Doppler augmentations for improved human activity recognition. In 2019 IEEE Radar Conference (RadarConf). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Barış Erol, Cesur Karabacak, Sevgi Zübeyde Gürbüz, and Ali Cafer Gürbüz. 2014. Simulation of human micro-Doppler signatures with Kinect sensor. In 2014 IEEE Radar Conference. IEEE, 0863–0868.",
      "doi": ""
    },
    {
      "text": "Facebook. 2020. Facebook. Retrieved 2020 from https://portal.facebook.com/",
      "doi": ""
    },
    {
      "text": "Tenglong Fan, Chao Ma, Zhitao Gu, Qinyi Lv, Jialong Chen, Dexin Ye, Jiangtao Huangfu, Yongzhi Sun, Changzhi Li, and Lixin Ran. 2016. Wireless hand gesture recognition based on continuous-wave Doppler radar sensors. IEEE Transactions on Microwave Theory and Techniques 64, 11(2016), 4012–4020.",
      "doi": ""
    },
    {
      "text": "Basura Fernando, Efstratios Gavves, Jose M Oramas, Amir Ghodrati, and Tinne Tuytelaars. 2015. Modeling video evolution for action recognition. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 5378–5387.",
      "doi": ""
    },
    {
      "text": "Biying Fu, Florian Kirchbuchner, Arjan Kuijper, Andreas Braun, and Dinesh Vaithyalingam Gangatharan. 2018. Fitness activity recognition on smartphones using Doppler measurements. In Informatics, Vol. 5. Multidisciplinary Digital Publishing Institute, 24.",
      "doi": ""
    },
    {
      "text": "Ennio Gambi, Gianluca Ciattaglia, Adelmo De Santis, and Linda Senigagliesi. 2020. Millimeter wave radar data of people walking. Data in brief 31(2020), 105996.",
      "doi": ""
    },
    {
      "text": "Clint Gibler, Jonathan Crussell, Jeremy Erickson, and Hao Chen. 2012. AndroidLeaks: automatically detecting potential privacy leaks in android applications on a large scale. In International Conference on Trust and Trustworthy Computing. Springer, 291–307.",
      "doi": "10.1007/978-3-642-30921-2_17"
    },
    {
      "text": "Mayank Goel, Chen Zhao, Ruth Vinisha, and Shwetak N Patel. 2015. Tongue-in-cheek: Using wireless signals to enable non-intrusive and flexible facial gestures detection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 255–258.",
      "doi": "10.1145/2702123.2702591"
    },
    {
      "text": "Sidhant Gupta, Daniel Morris, Shwetak Patel, and Desney Tan. 2012. Soundwave: using the doppler effect to sense gestures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1911–1914.",
      "doi": "10.1145/2207676.2208331"
    },
    {
      "text": "Marc Habermann, Weipeng Xu, Michael Zollhofer, Gerard Pons-Moll, and Christian Theobalt. 2020. Deepcap: Monocular human performance capture using weak supervision. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 5052–5063.",
      "doi": ""
    },
    {
      "text": "Eugene Hecht. 2002. Optics, 5e. Pearson Education India.",
      "doi": ""
    },
    {
      "text": "Yonghong Hou, Zhaoyang Li, Pichao Wang, and Wanqing Li. 2016. Skeleton optical spectra-based action recognition using convolutional neural networks. IEEE Transactions on Circuits and Systems for Video Technology 28, 3(2016), 807–811.",
      "doi": ""
    },
    {
      "text": "Yinghao Huang, Manuel Kaufmann, Emre Aksan, Michael J Black, Otmar Hilliges, and Gerard Pons-Moll. 2018. Deep inertial poser: learning to reconstruct human pose from sparse inertial measurements in real time. ACM Transactions on Graphics (TOG) 37, 6 (2018), 1–15.",
      "doi": "10.1145/3158353"
    },
    {
      "text": "Noureldien Hussein, Efstratios Gavves, and Arnold WM Smeulders. 2019. Timeception for complex action recognition. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 254–263.",
      "doi": ""
    },
    {
      "text": "Texas Instruments. 2020. Texas Instruments mmWave. Retrieved 2020 from https://www.ti.com/product/AWR1642",
      "doi": ""
    },
    {
      "text": "Texas Instruments. 2020. Texas Instruments Person Tracking. Retrieved 2020 from https://www.ti.com/tool/TIDEP-01000",
      "doi": ""
    },
    {
      "text": "Phillip Isola, Jun-Yan Zhu, Tinghui Zhou, and Alexei A Efros. 2017. Image-to-image translation with conditional adversarial networks. In Proceedings of the IEEE conference on computer vision and pattern recognition. 1125–1134.",
      "doi": ""
    },
    {
      "text": "Hueihan Jhuang, Juergen Gall, Silvia Zuffi, Cordelia Schmid, and Michael J Black. 2013. Towards understanding action recognition. In Proceedings of the IEEE international conference on computer vision. 3192–3199.",
      "doi": "10.1109/ICCV.2013.396"
    },
    {
      "text": "Shian-Ru Ke, Hoang Le Uyen Thuc, Yong-Jin Lee, Jenq-Neng Hwang, Jang-Hee Yoo, and Kyoung-Ho Choi. 2013. A review on video-based human activity recognition. Computers 2, 2 (2013), 88–131.",
      "doi": ""
    },
    {
      "text": "Rushil Khurana, Karan Ahuja, Zac Yu, Jennifer Mankoff, Chris Harrison, and Mayank Goel. 2018. GymCam: Detecting, recognizing and tracking simultaneous exercises in unconstrained scenes. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–17.",
      "doi": "10.1145/3287063"
    },
    {
      "text": "Youngwook Kim and Hao Ling. 2009. Human activity classification based on micro-Doppler signatures using a support vector machine. IEEE Transactions on Geoscience and Remote Sensing 47, 5 (2009), 1328–1337.",
      "doi": ""
    },
    {
      "text": "Diederik P Kingma and Jimmy Ba. 2014. Adam: A method for stochastic optimization. arXiv preprint arXiv:1412.6980(2014).",
      "doi": ""
    },
    {
      "text": "Muhammed Kocabas, Nikos Athanasiou, and Michael J Black. 2020. VIBE: Video inference for human body pose and shape estimation. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 5253–5263.",
      "doi": ""
    },
    {
      "text": "Hildegard Kuehne, Hueihan Jhuang, Estíbaliz Garrote, Tomaso Poggio, and Thomas Serre. 2011. HMDB: a large video database for human motion recognition. In 2011 International Conference on Computer Vision. IEEE, 2556–2563.",
      "doi": "10.1109/ICCV.2011.6126543"
    },
    {
      "text": "Hyeokhyen Kwon, Catherine Tong, Harish Haresamudram, Yan Gao, Gregory D Abowd, Nicholas D Lane, and Thomas Ploetz. 2020. IMUTube: Automatic extraction of virtual on-body accelerometry from video for human activity recognition. arXiv preprint arXiv:2006.05675(2020).",
      "doi": ""
    },
    {
      "text": "Ivan Laptev and Tony Lindeberg. 2004. Velocity adaptation of space-time interest points. In Proceedings of the 17th International Conference on Pattern Recognition, 2004. ICPR 2004., Vol. 1. IEEE, 52–56.",
      "doi": ""
    },
    {
      "text": "Gierad Laput, Karan Ahuja, Mayank Goel, and Chris Harrison. 2018. Ubicoustics: Plug-and-play acoustic activity recognition. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 213–224.",
      "doi": "10.1145/3242587.3242609"
    },
    {
      "text": "Oscar D Lara and Miguel A Labrador. 2012. A survey on human activity recognition using wearable sensors. IEEE communications surveys & tutorials 15, 3 (2012), 1192–1209.",
      "doi": ""
    },
    {
      "text": "Jiayi Li, Aman Shrestha, Julien Le Kernec, and Francesco Fioranelli. 2019. From Kinect skeleton data to hand gesture recognition with radar. The Journal of Engineering 2019, 20 (2019), 6914–6919.",
      "doi": ""
    },
    {
      "text": "Wenda Li, Bo Tan, and Robert J Piechocki. 2016. Non-contact breathing detection using passive radar. In 2016 IEEE International Conference on Communications (ICC). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Wenda Li, Bo Tan, Yangdi Xu, and Robert J Piechocki. 2018. Log-likelihood clustering-enabled passive RF sensing for residential activity recognition. IEEE Sensors Journal 18, 13 (2018), 5413–5421.",
      "doi": ""
    },
    {
      "text": "Zhenyang Li, Kirill Gavrilyuk, Efstratios Gavves, Mihir Jain, and Cees GM Snoek. 2018. Videolstm convolves, attends and flows for action recognition. Computer Vision and Image Understanding 166 (2018), 41–50.",
      "doi": "10.1016/j.cviu.2017.10.011"
    },
    {
      "text": "Dawei Liang and Edison Thomaz. 2019. Audio-based activities of daily living (adl) recognition with large-scale acoustic embeddings from online videos. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 1 (2019), 1–18.",
      "doi": "10.1145/3314404"
    },
    {
      "text": "Jaime Lien, Nicholas Gillian, M Emre Karagozler, Patrick Amihood, Carsten Schwesig, Erik Olson, Hakim Raja, and Ivan Poupyrev. 2016. Soli: Ubiquitous gesture sensing with millimeter wave radar. ACM Transactions on Graphics (TOG) 35, 4 (2016), 1–19.",
      "doi": "10.1145/2897824.2925953"
    },
    {
      "text": "Yier Lin and Julien Le Kernec. 2017. Performance analysis of classification algorithms for activity recognition using micro-Doppler feature. In 2017 13th International Conference on Computational Intelligence and Security (CIS). IEEE, 480–483.",
      "doi": ""
    },
    {
      "text": "Jun Liu, Amir Shahroudy, Dong Xu, and Gang Wang. 2016. Spatio-temporal lstm with trust gates for 3d human action recognition. In European conference on computer vision. Springer, 816–833.",
      "doi": ""
    },
    {
      "text": "Matthew Loper, Naureen Mahmood, Javier Romero, Gerard Pons-Moll, and Michael J. Black. 2015. SMPL: A Skinned Multi-Person Linear Model. ACM Trans. Graphics (Proc. SIGGRAPH Asia) 34, 6 (Oct. 2015), 248:1–248:16.",
      "doi": "10.1145/2816795.2818013"
    },
    {
      "text": "Dushyant Mehta, Oleksandr Sotnychenko, Franziska Mueller, Weipeng Xu, Mohamed Elgharib, Pascal Fua, Hans-Peter Seidel, Helge Rhodin, Gerard Pons-Moll, and Christian Theobalt. 2020. XNect: Real-time multi-person 3D motion capture with a single RGB camera. ACM Transactions on Graphics (TOG) 39, 4 (2020), 82–1.",
      "doi": "10.1145/3386569.3392410"
    },
    {
      "text": "Bingbing Ni, Pierre Moulin, Xiaokang Yang, and Shuicheng Yan. 2015. Motion part regularization: Improving action recognition via trajectory selection. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 3698–3706.",
      "doi": ""
    },
    {
      "text": "Ferda Ofli, Rizwan Chaudhry, Gregorij Kurillo, René Vidal, and Ruzena Bajcsy. 2013. Berkeley mhad: A comprehensive multimodal human action database. In 2013 IEEE Workshop on Applications of Computer Vision (WACV). IEEE, 53–60.",
      "doi": "10.1109/WACV.2013.6474999"
    },
    {
      "text": "Charith Perera, Arkady Zaslavsky, Peter Christen, and Dimitrios Georgakopoulos. 2013. Context aware computing for the internet of things: A survey. IEEE communications surveys & tutorials 16, 1 (2013), 414–454.",
      "doi": ""
    },
    {
      "text": "Joseph Phelps, Glen Nowak, and Elizabeth Ferrell. 2000. Privacy concerns and consumer willingness to provide personal information. Journal of Public Policy & Marketing 19, 1 (2000), 27–41.",
      "doi": ""
    },
    {
      "text": "Benjamin Planche, Ziyan Wu, Kai Ma, Shanhui Sun, Stefan Kluckner, Oliver Lehmann, Terrence Chen, Andreas Hutter, Sergey Zakharov, Harald Kosch, 2017. Depthsynth: Real-time realistic synthetic data generation from cad models for 2.5 d recognition. In 2017 International Conference on 3D Vision (3DV). IEEE, 1–10.",
      "doi": ""
    },
    {
      "text": "Qifan Pu, Sidhant Gupta, Shyamnath Gollakota, and Shwetak Patel. 2013. Whole-home gesture recognition using wireless signals. In Proceedings of the 19th annual international conference on Mobile computing & networking. 27–38.",
      "doi": "10.1145/2500423.2500436"
    },
    {
      "text": "Bhiksha Raj, Kaustubh Kalgaonkar, Chris Harrison, and Paul Dietz. 2012. Ultrasonic doppler sensing in hci. IEEE Pervasive Computing 11, 2 (2012), 24–29.",
      "doi": "10.1109/MPRV.2012.17"
    },
    {
      "text": "Olaf Ronneberger, Philipp Fischer, and Thomas Brox. 2015. U-net: Convolutional networks for biomedical image segmentation. In International Conference on Medical image computing and computer-assisted intervention. Springer, 234–241.",
      "doi": ""
    },
    {
      "text": "Amir Shahroudy, Jun Liu, Tian-Tsong Ng, and Gang Wang. 2016. Ntu rgb+ d: A large scale dataset for 3d human activity analysis. In Proceedings of the IEEE conference on computer vision and pattern recognition. 1010–1019.",
      "doi": ""
    },
    {
      "text": "Shikhar Sharma, Ryan Kiros, and Ruslan Salakhutdinov. 2015. Action recognition using visual attention. arXiv preprint arXiv:1511.04119(2015).",
      "doi": ""
    },
    {
      "text": "Xingjian Shi, Zhourong Chen, Hao Wang, Dit-Yan Yeung, Wai-Kin Wong, and Wang-chun Woo. 2015. Convolutional LSTM network: A machine learning approach for precipitation nowcasting. Advances in neural information processing systems 28 (2015), 802–810.",
      "doi": ""
    },
    {
      "text": "Karen Simonyan and Andrew Zisserman. 2014. Very deep convolutional networks for large-scale image recognition. arXiv preprint arXiv:1409.1556(2014).",
      "doi": ""
    },
    {
      "text": "Akash Deep Singh, Sandeep Singh Sandha, Luis Garcia, and Mani Srivastava. 2019. Radhar: Human activity recognition from point clouds generated through a millimeter-wave radar. In Proceedings of the 3rd ACM Workshop on Millimeter-wave Networks and Sensing Systems. 51–56.",
      "doi": "10.1145/3349624.3356768"
    },
    {
      "text": "Google ATAP Soli. 2020. Google ATAP Soli. Retrieved 2020 from https://atap.google.com/soli/",
      "doi": ""
    },
    {
      "text": "Sijie Song, Cuiling Lan, Junliang Xing, Wenjun Zeng, and Jiaying Liu. 2016. An end-to-end spatio-temporal attention model for human action recognition from skeleton data. arXiv preprint arXiv:1611.06067(2016).",
      "doi": ""
    },
    {
      "text": "Khurram Soomro, Amir Roshan Zamir, and Mubarak Shah. 2012. UCF101: A dataset of 101 human actions classes from videos in the wild. arXiv preprint arXiv:1212.0402(2012).",
      "doi": ""
    },
    {
      "text": "Bo Tan, Karl Woodbridge, and Kevin Chetty. 2016. Awireless passive radar system for real-time through-wall movement detection. IEEE Trans. Aerospace Electron. Systems 52, 5 (2016), 2596–2603.",
      "doi": ""
    },
    {
      "text": "Emmanuel Munguia Tapia, Stephen S Intille, and Kent Larson. 2004. Activity recognition in the home using simple and ubiquitous sensors. In International conference on pervasive computing. Springer, 158–175.",
      "doi": ""
    },
    {
      "text": "Emmanuel Munguia Tapia, Stephen S Intille, and Kent Larson. 2007. Portable wireless sensors for object usage sensing in the home: Challenges and practicalities. In European Conference on Ambient Intelligence. Springer, 19–37.",
      "doi": ""
    },
    {
      "text": "Gül Varol, Ivan Laptev, and Cordelia Schmid. 2017. Long-term temporal convolutions for action recognition. IEEE transactions on pattern analysis and machine intelligence 40, 6(2017), 1510–1517.",
      "doi": ""
    },
    {
      "text": "Gul Varol, Javier Romero, Xavier Martin, Naureen Mahmood, Michael J Black, Ivan Laptev, and Cordelia Schmid. 2017. Learning from synthetic humans. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 109–117.",
      "doi": ""
    },
    {
      "text": "Chunyu Wang, Yizhou Wang, and Alan L Yuille. 2013. An approach to pose-based action recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition. 915–922.",
      "doi": "10.1109/CVPR.2013.123"
    },
    {
      "text": "Limin Wang, Yu Qiao, and Xiaoou Tang. 2015. Action recognition with trajectory-pooled deep-convolutional descriptors. In Proceedings of the IEEE conference on computer vision and pattern recognition. 4305–4314.",
      "doi": ""
    },
    {
      "text": "Limin Wang, Yuanjun Xiong, Zhe Wang, Yu Qiao, Dahua Lin, Xiaoou Tang, and Luc Van Gool. 2016. Temporal segment networks: Towards good practices for deep action recognition. In European conference on computer vision. Springer, 20–36.",
      "doi": ""
    },
    {
      "text": "Saiwen Wang, Jie Song, Jaime Lien, Ivan Poupyrev, and Otmar Hilliges. 2016. Interacting with soli: Exploring fine-grained dynamic gesture recognition in the radio-frequency spectrum. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 851–860.",
      "doi": "10.1145/2984511.2984565"
    },
    {
      "text": "Xiaolong Wang and Abhinav Gupta. 2018. Videos as space-time region graphs. In Proceedings of the European conference on computer vision (ECCV). 399–417.",
      "doi": "10.1007/978-3-030-01228-1_25"
    },
    {
      "text": "Jason Wu, Chris Harrison, Jeffrey P Bigham, and Gierad Laput. 2020. Automated Class Discovery and One-Shot Interactions for Acoustic Activity Recognition. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376875"
    },
    {
      "text": "Bruce Xiaohan Nie, Caiming Xiong, and Song-Chun Zhu. 2015. Joint action recognition and pose estimation from video. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 1293–1301.",
      "doi": ""
    },
    {
      "text": "Lan Xu, Weipeng Xu, Vladislav Golyanik, Marc Habermann, Lu Fang, and Christian Theobalt. 2020. EventCap: Monocular 3D Capture of High-Speed Human Motions using an Event Camera. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition. 4968–4978.",
      "doi": ""
    },
    {
      "text": "Yuya Yoshikawa, Jiaqing Lin, and Akikazu Takeuchi. 2018. STAIR Actions: A Video Dataset of Everyday Home Actions. arXiv preprint arXiv:1804.04326(2018). http://arxiv.org/abs/1804.04326",
      "doi": ""
    },
    {
      "text": "Joe Yue-Hei Ng, Matthew Hausknecht, Sudheendra Vijayanarasimhan, Oriol Vinyals, Rajat Monga, and George Toderici. 2015. Beyond short snippets: Deep networks for video classification. In Proceedings of the IEEE conference on computer vision and pattern recognition. 4694–4702.",
      "doi": ""
    },
    {
      "text": "Wojciech Zaremba, Ilya Sutskever, and Oriol Vinyals. 2014. Recurrent neural network regularization. arXiv preprint arXiv:1409.2329(2014).",
      "doi": ""
    },
    {
      "text": "Chenyang Zhang and Yingli Tian. 2012. RGB-D camera-based daily living activity recognition. Journal of computer vision and image processing 2, 4 (2012), 12.",
      "doi": ""
    },
    {
      "text": "Hansong Zhang and Kenneth E Hoff III. 1997. Fast backface culling using normal masks. In Proceedings of the 1997 symposium on Interactive 3D graphics. 103–ff.",
      "doi": "10.1145/253284.253314"
    },
    {
      "text": "Zhilu Zhang and Mert Sabuncu. 2018. Generalized cross entropy loss for training deep neural networks with noisy labels. In Advances in neural information processing systems. 8778–8788.",
      "doi": ""
    },
    {
      "text": "Yang Zhao, Zicheng Liu, Lu Yang, and Hong Cheng. 2012. Combing rgb and depth map features for human activity recognition. In Proceedings of The 2012 Asia Pacific Signal and Information Processing Association Annual Summit and Conference. IEEE, 1–4.",
      "doi": ""
    },
    {
      "text": "Yipin Zhou, Zhaowen Wang, Chen Fang, Trung Bui, and Tamara L Berg. 2018. Visual to sound: Generating natural sound for videos in the wild. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 3550–3558.",
      "doi": ""
    },
    {
      "text": "Wangjiang Zhu, Jie Hu, Gang Sun, Xudong Cao, and Yu Qiao. 2016. A key volume mining deep framework for action recognition. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 1991–1999.",
      "doi": ""
    },
    {
      "text": "Mohammadreza Zolfaghari, Gabriel L Oliveira, Nima Sedaghat, and Thomas Brox. 2017. Chained multi-stream networks exploiting pose, motion, and appearance for action classification and detection. In Proceedings of the IEEE International Conference on Computer Vision. 2904–2913.",
      "doi": ""
    }
  ]
}