{
  "doi": "10.1145/3411764.3445546",
  "title": "Elbow-Anchored Interaction: Designing Restful Mid-Air Input",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "We designed a mid-air input space for restful interactions on the couch. We observed people gesturing in various postures on a couch and found that posture affects the choice of arm motions when no constraints are imposed by a system. Study participants that sat with the arm rested were more likely to use the forearm and wrist, as opposed to the whole arm. We investigate how a spherical input space, where forearm angles are mapped to screen coordinates, can facilitate restful mid-air input in multiple postures. We present two controlled studies. In the first, we examine how a spherical space compares with a planar space in an elbow-anchored setup, with a shoulder-level input space as baseline. In the second, we examine the performance of a spherical input space in four common couch postures that set unique constraints to the arm. We observe that a spherical model that captures forearm movement facilitates comfortable input across different seated postures.",
  "authors": [
    {
      "name": "Rafael Veras",
      "institution": "Human-Machine Interaction Lab, Huawei, Canada",
      "img": "/do/10.1145/contrib-81490682614/rel-imgonly/de_hbuiq_400x400.jpg",
      "acmid": "81490682614",
      "orcid": "missing"
    },
    {
      "name": "Gaganpreet Singh",
      "institution": "Human-Machine Interaction Lab, Huawei, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260392",
      "orcid": "missing"
    },
    {
      "name": "Farzin Farhadi-Niaki",
      "institution": "Human-Machine Interaction Lab, Huawei, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508707493",
      "orcid": "missing"
    },
    {
      "name": "Ritesh Udhani",
      "institution": "Department of Computer Science, University of Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659534462",
      "orcid": "missing"
    },
    {
      "name": "Parth Pradeep Patekar",
      "institution": "Department of Computer Science, University of Manitoba, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659487791",
      "orcid": "missing"
    },
    {
      "name": "Wei Zhou",
      "institution": "Human-Machine Interaction Lab, Huawei, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659469132",
      "orcid": "0000-0003-3641-1429"
    },
    {
      "name": "Pourang Irani",
      "institution": "Department of Computer Science, University of Manitoba and Human-Machine Interaction Lab, Huawei, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    },
    {
      "name": "Wei Li",
      "institution": "Human-Machine Interaction Lab, Huawei, Canada",
      "img": "/do/10.1145/contrib-81392599313/rel-imgonly/header_people_wei.jpg",
      "acmid": "81392599313",
      "orcid": "0000-0001-7174-9228"
    }
  ],
  "references": [
    {
      "text": "2014. Input Methods | SAMSUNG Developers. Retrieved September 03, 2019 from https://developer.samsung.com/tv/develop/legacy-platform-library/2014/03_input_method",
      "doi": ""
    },
    {
      "text": "2017. This Car Gadget Can Help You Keep Your Eyes On the Road. Retrieved January 08, 2020 from https://time.com/4583451/navdy-heads-up-display/",
      "doi": ""
    },
    {
      "text": "2019. LG G8 ThinQ air motion: Learn how touchless works. Retrieved September 03, 2019 from https://lg.com/us/mobile-phones/g8-thinq/air-motion",
      "doi": ""
    },
    {
      "text": "2019. Thumbs Up: Hand Tracking on Oculus Quest This Week. Retrieved January 08, 2020 from https://www.oculus.com/blog/thumbs-up-hand-tracking-now-available-on-oculus-quest/?locale=en_US",
      "doi": ""
    },
    {
      "text": "2020. Control your Pixel without touching it. Retrieved January 08, 2020 from https://support.google.com/pixelphone/answer/9517454?hl=en",
      "doi": ""
    },
    {
      "text": "Ilhan Aslan, Tabea Schmidt, Jens Woehrle, Lukas Vogel, and Elisabeth André. 2018. Pen + Mid-Air Gestures: Eliciting Contextual Gestures. In Proceedings of the 20th ACM International Conference on Multimodal Interaction (Boulder, CO, USA) (ICMI ’18). Association for Computing Machinery, New York, NY, USA, 135–144. https://doi.org/10.1145/3242969.3242979",
      "doi": "10.1145/3242969.3242979"
    },
    {
      "text": "Myroslav Bachynskyi, Gregorio Palmas, Antti Oulasvirta, Jürgen Steimle, and Tino Weinkauf. 2015. Performance and Ergonomics of Touch Surfaces: A Comparative Study using Biomechanical Simulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seoul, Korea) (CHI ’15). ACM, New York, NY, USA, 10 pages.",
      "doi": ""
    },
    {
      "text": "Gilles Bailly, Robert Walter, Jörg Müller, Tongyan Ning, and Eric Lecolinet. 2011. Comparing free hand menu techniques for distant displays using linear, marking and finger-count menus. In IFIP Conference on Human-Computer Interaction. Springer, 248–262.",
      "doi": ""
    },
    {
      "text": "Renaud Blanch, Yves Guiard, and Michel Beaudouin-Lafon. 2004. Semantic Pointing: Improving Target Acquisition with Control-Display Ratio Adaptation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vienna, Austria) (CHI ’04). Association for Computing Machinery, New York, NY, USA, 519–526. https://doi.org/10.1145/985692.985758",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Michelle A. Brown, Wolfgang Stuerzlinger, and E. J. Mendonça Filho. 2014. The Performance of Un-Instrumented in-Air Pointing. In Proceedings of Graphics Interface 2014 (Montreal, Quebec, Canada) (GI ’14). Canadian Information Processing Society, CAN, 59–66.",
      "doi": "10.5555/2619648.2619659"
    },
    {
      "text": "Debaleena Chattopadhyay and Davide Bolchini. 2014. Touchless circular menus: toward an intuitive UI for touchless interactions with large displays. In Proceedings of the International Working Conference on Advanced Visual Interfaces. ACM, Association for Computing Machinery, New York, NY, USA, 33–40.",
      "doi": "10.1145/2598153.2598181"
    },
    {
      "text": "Debaleena Chattopadhyay and Davide Bolchini. 2015. Motor-intuitive interactions based on image schemas: Aligning touchless interaction primitives with human sensorimotor abilities. Interacting with Computers 27, 3 (2015), 327–343.",
      "doi": ""
    },
    {
      "text": "Andy Cockburn and Andrew Firth. 2003. Improving the Acquisition of Small Targets. People and Computers (04 2003). https://doi.org/10.1007/978-1-4471-3754-2_11",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Philip Quinn, Carl Gutwin, Gonzalo Ramos, and Julian Looser. 2011. Air pointing: Design and evaluation of spatial target acquisition with and without visual feedback. International Journal of Human-Computer Studies 69, 6 (2011), 401–414.",
      "doi": "10.1016/j.ijhcs.2011.02.005"
    },
    {
      "text": "Clifton Forlines, Daniel Vogel, and Ravin Balakrishnan. 2006. HybridPointing: Fluid Switching between Absolute and Relative Pointing with a Direct Input Device. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (Montreux, Switzerland) (UIST ’06). Association for Computing Machinery, New York, NY, USA, 211–220. https://doi.org/10.1145/1166253.1166286",
      "doi": "10.1145/1166253.1166286"
    },
    {
      "text": "Dustin Freeman, Ramadevi Vennelakanti, and Sriganesh Madhvanath. 2012. Freehand pose-based gestural interaction: Studies and implications for interface design. In Proceedings of the 4th International Conference on Intelligent Human Computer Interaction (IHCI). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Jun Gong, Xing-Dong Yang, and Pourang Irani. 2016. Wristwhirl: One-handed continuous smartwatch input using wrist gestures. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. Association for Computing Machinery, New York, NY, USA, 861–872.",
      "doi": "10.1145/2984511.2984563"
    },
    {
      "text": "François Guimbretière and Chau Nguyen. 2012. Bimanual marking menu for near surface interactions. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 825–828.",
      "doi": "10.1145/2207676.2208521"
    },
    {
      "text": "Darren Guinness, Alvin Jude, G Michael Poor, and Ashley Dover. 2015. Models for rested touchless gestural interaction. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction. ACM, 34–43.",
      "doi": "10.1145/2788940.2788948"
    },
    {
      "text": "Sandra G Hart. 2006. NASA-task load index (NASA-TLX); 20 years later. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 50. Sage publications Sage CA: Los Angeles, CA, 904–908.",
      "doi": "10.1177/154193120605000909"
    },
    {
      "text": "Juan David Hincapié-Ramos, Xiang Guo, Paymahn Moghadasian, and Pourang Irani. 2014. Consumed endurance: a metric to quantify arm fatigue of mid-air interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Association for Computing Machinery, New York, NY, USA, 1063–1072.",
      "doi": "10.1145/2556288.2557130"
    },
    {
      "text": "Sujin Jang, Wolfgang Stuerzlinger, Satyajit Ambike, and Karthik Ramani. 2017. Modeling Cumulative Arm Fatigue in Mid-Air Interaction Based on Perceived Exertion and Kinetics of Arm Motion. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3328–3339. https://doi.org/10.1145/3025453.3025523",
      "doi": "10.1145/3025453.3025523"
    },
    {
      "text": "Alvin Jude, G. Michael Poor, and Darren Guinness. 2014. Personal Space: User Defined Gesture Space for GUI Interaction. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 1615–1620. https://doi.org/10.1145/2559206.2581242",
      "doi": "10.1145/2559206.2581242"
    },
    {
      "text": "Daniel Kharlamov, Brandon Woodard, Liudmila Tahai, and Krzysztof Pietroszek. 2016. TickTockRay: Smartwatch-Based 3D Pointing for Smartphone-Based Virtual Reality. In Proceedings of the 22nd ACM Conference on Virtual Reality Software and Technology(Munich, Germany) (VRST ’16). Association for Computing Machinery, New York, NY, USA, 365–366. https://doi.org/10.1145/2993369.2996311",
      "doi": "10.1145/2993369.2996311"
    },
    {
      "text": "Michael Kipp. 2008. Spatiotemporal Coding in ANVIL. In Proceedings of the Sixth International Conference on Language Resources and Evaluation (LREC’08).",
      "doi": ""
    },
    {
      "text": "Werner A. König, Jens Gerken, Stefan Dierdorf, and Harald Reiterer. 2009. Adaptive Pointing: Implicit Gain Adaptation for Absolute Pointing Devices. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems (Boston, MA, USA) (CHI EA ’09). Association for Computing Machinery, New York, NY, USA, 4171–4176. https://doi.org/10.1145/1520340.1520635",
      "doi": "10.1145/1520340.1520635"
    },
    {
      "text": "Arun Kulshreshth and Joseph J LaViola Jr. 2014. Exploring the usefulness of finger-based 3D gesture menu selection. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Association for Computing Machinery, New York, NY, USA, 1093–1102.",
      "doi": "10.1145/2556288.2557122"
    },
    {
      "text": "Frank Chun Yat Li, David Dearman, and Khai N Truong. 2009. Virtual shelves: interactions with orientation aware devices. In Proceedings of the 22nd Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, New York, NY, USA, 125–128.",
      "doi": ""
    },
    {
      "text": "Jing Z. Liu, Robert W. Brown, and Guang H. Yue. 2002. A Dynamical Model of Muscle Activation, Fatigue, and Recovery. Biophysical Journal 82, 5 (2002), 2344 – 2359. https://doi.org/10.1016/S0006-3495(02)75580-X",
      "doi": ""
    },
    {
      "text": "Mingyu Liu, Mathieu Nancel, and Daniel Vogel. 2015. Gunslinger: Subtle Arms-down Mid-Air Interaction. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 63–71. https://doi.org/10.1145/2807442.2807489",
      "doi": "10.1145/2807442.2807489"
    },
    {
      "text": "Paul Lubos, Gerd Bruder, Oscar Ariza, and Frank Steinicke. 2016. Touching the sphere: Leveraging joint-centered kinespheres for spatial user interaction. In Proceedings of the 2016 Symposium on Spatial User Interaction. Association for Computing Machinery, New York, NY, USA, 13–22.",
      "doi": "10.1145/2983310.2985753"
    },
    {
      "text": "Anders Markussen, Mikkel Rønne Jakobsen, and Kasper Hornbæk. 2014. Vulture: a mid-air word-gesture keyboard. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1073–1082.",
      "doi": "10.1145/2556288.2556964"
    },
    {
      "text": "David E. Meyer, Richard A. Abrams, Sylvan Kornblum, Charles E. Wright, and J. E. Keith Smith. 1988. Optimality in human motor performance: ideal control of rapid aimed movements. Psychological Review 95(1988), 340–370.",
      "doi": ""
    },
    {
      "text": "Roberto A Montano Murillo, Sriram Subramanian, and Diego Martinez Plasencia. 2017. Erg-O: ergonomic optimization of immersive virtual environments. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, New York, NY, USA, 759–771.",
      "doi": "10.1145/3126594.3126605"
    },
    {
      "text": "Richard Morey. 2008. Confidence Intervals from Normalized Data: A correction to Cousineau (2005). Tutorials in Quantitative Methods for Psychology 4 (09 2008). https://doi.org/10.20982/tqmp.04.2.p061",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Andreea Danielescu, Steven Drucker, Danyel Fisher, Bongshin Lee, m. c. schraefel, and Jacob O. Wobbrock. 2014. Reducing Legacy Bias in Gesture Elicitation Studies. Interactions 21, 3 (May 2014), 40–45. https://doi.org/10.1145/2591689",
      "doi": "10.1145/2591689"
    },
    {
      "text": "Brad A. Myers, Rishi Bhatnagar, Jeffrey Nichols, Choon Hong Peck, Dave Kong, Robert Miller, and A. Chris Long. 2002. Interacting at a Distance: Measuring the Performance of Laser Pointers and Other Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Minneapolis, Minnesota, USA) (CHI ’02). Association for Computing Machinery, New York, NY, USA, 33–40. https://doi.org/10.1145/503376.503383",
      "doi": "10.1145/503376.503383"
    },
    {
      "text": "Mathieu Nancel, Emmanuel Pietriga, Olivier Chapuis, and Michel Beaudouin-Lafon. 2015. Mid-Air Pointing on Ultra-Walls. ACM Trans. Comput.-Hum. Interact. 22, 5, Article 21 (Aug. 2015), 62 pages. https://doi.org/10.1145/2766448",
      "doi": "10.1145/2766448"
    },
    {
      "text": "Mathieu Nancel, Julie Wagner, Emmanuel Pietriga, Olivier Chapuis, and Wendy Mackay. 2011. Mid-Air Pan-and-Zoom on Wall-Sized Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 177–186. https://doi.org/10.1145/1978942.1978969",
      "doi": "10.1145/1978942.1978969"
    },
    {
      "text": "J NASA. 2000. Anthropometry and biomechanics. Man systems integration standards 1 (2000).",
      "doi": ""
    },
    {
      "text": "Fabrizio Nunnari, Myroslav Bachynskyi, and Alexis Heloir. 2016. Introducing postural variability improves the distribution of muscular loads during mid-air gestural interaction. In Proceedings of the 9th International Conference on Motion in Games. ACM, Association for Computing Machinery, New York, NY, USA, 155–160.",
      "doi": "10.1145/2994258.2994278"
    },
    {
      "text": "Ji-Young Oh and Wolfgang Stuerzlinger. 2002. Laser Pointers as Collaborative Pointing Devices. Proceedings - Graphics Interface 2002 (10 2002).",
      "doi": ""
    },
    {
      "text": "Jose Pinheiro, Douglas Bates, Saikat DebRoy, Deepayan Sarkar, and R Core Team. 2020. nlme: Linear and Nonlinear Mixed Effects Models. https://CRAN.R-project.org/package=nlme R package version 3.1-147.",
      "doi": ""
    },
    {
      "text": "Jakub Segen and Senthil Kumar. 2000. Look Ma, No Mouse!Commun. ACM 43, 7 (July 2000), 102–109. https://doi.org/10.1145/341852.341869",
      "doi": "10.1145/341852.341869"
    },
    {
      "text": "David E Vaillancourt and Karl M Newell. 2000. Amplitude changes in the 8–12, 20–25, and 40 Hz oscillations in finger tremor. Clinical Neurophysiology 111, 10 (2000), 1792 – 1801. https://doi.org/10.1016/S1388-2457(00)00378-3",
      "doi": ""
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2005. Distant freehand pointing and clicking on very large, high resolution displays. In Proceedings of the 18th annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, New York, NY, USA, 33–42.",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Johann Wentzel, Greg d’Eon, and Daniel Vogel. 2020. Improving Virtual Reality Ergonomics through Reach-Bounded Non-Linear Input Amplification. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, Article 558, 12 pages. https://doi.org/10.1145/3313831.3376687",
      "doi": "10.1145/3313831.3376687"
    },
    {
      "text": "Ting Xia and Laura Law. 2008. A theoretical approach for modeling peripheral muscle fatigue and recovery. Journal of biomechanics 41 (10 2008), 3046–52. https://doi.org/10.1016/j.jbiomech.2008.07.013",
      "doi": ""
    }
  ]
}