{
  "doi": "10.1145/3411764.3445086",
  "title": "Examining Mobility Among People Living with HIV in Rural Areas",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "The rise of ridesharing platforms has transformed traditional transportation, making it more accessible for getting to work and accessing grocery stores and healthcare providers, which are essential to physical and mental well-being. However, such technologies are not available everywhere. Additionally, there is a scarcity of HCI work that investigates how vulnerable populations such as rural-dwelling people with HIV face and overcome transportation barriers. To extend past research, we conducted 31 surveys and 18 interviews with people living with HIV (22 surveys, 14 interviews) and their case coordinators (9 surveys, 4 interviews) in rural areas. Contrary to past research, we found that the use of alternative vehicles, extensive support networks, and nonprofit health organizations facilitated transportation. However, distance, the lack of trust and infrastructure, stigma, and other cultural underpinnings made popular forms of urban transportation unappealing. We contextualize our findings with prior research and contribute implications for future research and design.",
  "tags": [
    "Mobility",
    "HIV Care and Management",
    "Transportation Barriers",
    "Rural Communities"
  ],
  "authors": [
    {
      "name": "Juan F. Maestre",
      "institution": "School of Informatics, Computing and Engineering Indiana University Bloomington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659233507",
      "orcid": "0000-0002-5403-9387"
    },
    {
      "name": "Tawanna Dillahunt",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416606961",
      "orcid": "0000-0002-1155-8507"
    },
    {
      "name": "Alec Andrew Theisz",
      "institution": "School of Informatics, Computing, and Engineering Indiana University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702116",
      "orcid": "missing"
    },
    {
      "name": "Megan Furness",
      "institution": "Department of Chemistry Indiana University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700948",
      "orcid": "0000-0002-7014-9949"
    },
    {
      "name": "Vaishnav Kameswaran",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659027270",
      "orcid": "missing"
    },
    {
      "name": "Tiffany Veinot",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81447601417",
      "orcid": "missing"
    },
    {
      "name": "Patrick C. Shih",
      "institution": "School of Informatics, Computing, and Engineering Indiana University, United States",
      "img": "/do/10.1145/contrib-81430642614/rel-imgonly/shih-patrick-06-2018.jpg",
      "acmid": "81430642614",
      "orcid": "0000-0003-2460-0468"
    }
  ],
  "references": [
    {
      "text": "Ruth E Anderson, Waylon Brunette, Erica Johnson, Caitlin Lustig, Anthony Poon, Cynthia Putnam, Odina Salihbaeva, Beth E Kolko, and Gaetano Borriello. 2010. Experiences with a transportation information system that uses only GPS and SMS. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development, 1–10.",
      "doi": "10.1145/2369220.2369223"
    },
    {
      "text": "Ruth E Anderson, Anthony Poon, Caitlin Lustig, Waylon Brunette, Gaetano Borriello, and Beth E Kolko. 2009. Building a transportation information system using only GPS and basic SMS infrastructure. In 2009 International Conference on Information and Communication Technologies and Development (ICTD), IEEE, 233–242.",
      "doi": ""
    },
    {
      "text": "Thomas A Arcury, John S Preisser, Wilbert M Gesler, and James M Powers. 2005. Access to transportation and health care utilization in a rural region. J. Rural Heal. 21, 1 (2005), 31–38.",
      "doi": ""
    },
    {
      "text": "Tonatzin Yutzin Baños, Emmanuel Aquino, Fernando David Sernas, Yazmín Regina López, and Roberto Carlos Mendoza. 2007. EMI: A system to improve and promote the use of public transportation. In CHI’07 Extended Abstracts on Human Factors in Computing Systems, 2037–2042.",
      "doi": ""
    },
    {
      "text": "José A Bauermeister, Emily S Pingel, Laura Jadwin-Cakmak, Steven Meanley, Deepak Alapati, Michael Moore, Matthew Lowther, Ryan Wade, and Gary W Harper. 2015. The use of mystery shopping for quality assurance evaluations of HIV/STI testing sites offering services to young gay and bisexual men. AIDS Behav. 19, 10 (2015), 1919–1927.",
      "doi": ""
    },
    {
      "text": "Victoria M. E. Bellotti, Sara Cambridge, Karen Hoy, Patrick C. Shih, Lisa Renery Handalian, Kyungsik Han, and John M. Carroll. 2014. Towards community-centered support for peer-to-peer service exchange: Rethinking the timebanking metaphor. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2975–2984. DOI:https://doi.org/10.1145/2556288.2557061",
      "doi": ""
    },
    {
      "text": "Margot Brereton, Paul Roe, Marcus Foth, Jonathan M Bunker, and Laurie Buys. 2009. Designing participation in agile ridesharing with mobile social software. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7, 257–260.",
      "doi": ""
    },
    {
      "text": "Linda M Burton, Daniel T Lichter, Regina S Baker, and John M Eason. 2013. Inequality, family processes, and health in the “new” rural America. Am. Behav. Sci. 57, 8 (2013), 1128–1151.",
      "doi": ""
    },
    {
      "text": "Colin Buzza, Sarah S Ono, Carolyn Turvey, Stacy Wittrock, Matt Noble, Gautam Reddy, Peter J Kaboli, and Heather Schacht Reisinger. 2011. Distance is relative: unpacking a principal barrier in rural healthcare. J. Gen. Intern. Med. 26, 2 (2011), 648.",
      "doi": ""
    },
    {
      "text": "J.M. Carroll, P.C. Shih, K. Han, and J. Kropczynski. 2017. Coordinating community cooperation: Integrating timebanks and nonprofit volunteering by design. Int. J. Des. 11, 1 (2017).",
      "doi": ""
    },
    {
      "text": "John M Carroll. 2013. Co-production scenarios for mobile time banking. In International Symposium on End User Development, 137–152.",
      "doi": ""
    },
    {
      "text": "Rural Health Research Center. RUCA Data.",
      "doi": ""
    },
    {
      "text": "Blerim Cici, Athina Markopoulou, Enrique Frias-Martinez, and Nikolaos Laoutaris. 2014. Assessing the potential of ride-sharing using mobile and social data: a tale of four cities. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 201–211.",
      "doi": "10.1145/2632048.2632055"
    },
    {
      "text": "Kelly J Clifton. 2004. Mobility strategies and food shopping for low-income families: A case study. J. Plan. Educ. Res. 23, 4 (2004), 402–413.",
      "doi": ""
    },
    {
      "text": "Carl Collins, Amy Grude, Matthew Scholl, and Robert Thompson. 2007. txt bus: wait time information on demand. In CHI’07 Extended Abstracts on Human Factors in Computing Systems, 2049–2054.",
      "doi": ""
    },
    {
      "text": "Brian J Coltin and Manuela Veloso. 2013. Towards ridesharing with passenger transfers. In Proceedings of the 2013 international conference on Autonomous agents and multi-agent systems, 1299–1300.",
      "doi": ""
    },
    {
      "text": "Lisa Créno and Béatrice Cahour. 2014. Chronicles of Lived Experiences for studying the process of trust building in carpooling. In Proceedings of the 2014 European Conference on Cognitive Ergonomics, 1–8.",
      "doi": "10.1145/2637248.2637255"
    },
    {
      "text": "Tisha L Deen, Ana J Bridges, Tara C McGahan, and Arthur R Andrews III. 2012. Cognitive appraisals of specialty mental health services and their relation to mental health service utilization in the rural population. J. Rural Heal. 28, 2 (2012), 142–151.",
      "doi": ""
    },
    {
      "text": "Tawanna R Dillahunt, Vaishnav Kameswaran, Linfeng Li, and Tanya Rosenblat. 2017. Uncovering the values and constraints of real-time ridesharing for low-resource populations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2757–2769.",
      "doi": "10.1145/3025453.3025470"
    },
    {
      "text": "Tawanna R Dillahunt and Amelia R Malone. 2015. The promise of the sharing economy among disadvantaged communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2285–2294.",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Tawanna R Dillahunt, Sylvia Simioni, and Xuecong Xu. 2019. Online Grocery Delivery Services: An Opportunity to Address Food Disparities in Transportation-scarce Areas. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–15.",
      "doi": "10.1145/3290605.3300879"
    },
    {
      "text": "Tawanna R Dillahunt and Tiffany C Veinot. 2018. Getting there: Barriers and facilitators to transportation access in underserved communities. ACM Trans. Comput. Interact. 25, 5 (2018), 1–39.",
      "doi": "10.1145/3233985"
    },
    {
      "text": "Putu Duff, Walter Kipp, T Cameron Wild, Tom Rubaale, and Joa Okech-Ojony. 2010. Barriers to accessing highly active antiretroviral therapy by HIV-positive women attending an antenatal clinic in a regional hospital in western Uganda. J. Int. AIDS Soc. 13, 1 (2010), 37.",
      "doi": ""
    },
    {
      "text": "Brian Ferris, Kari Watkins, and Alan Borning. 2010. OneBusAway: results from providing real-time arrival information for public transit. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1807–1816.",
      "doi": "10.1145/1753326.1753597"
    },
    {
      "text": "Silvia Figueira, Michael Brew, Bryant Larsen, Pratyusha Joginipally, Sowmya Chandrashekarappa, and Ty Van Herweg. 2015. Text for a Ride, in Uganda. In Proceedings of the 2015 Annual Symposium on Computing for Development, 75–76.",
      "doi": "10.1145/2830629.2835220"
    },
    {
      "text": "Claude S Fischer. 1982. To dwell among friends: Personal networks in town and city. University of chicago Press.",
      "doi": ""
    },
    {
      "text": "Allison R Fleming, Noel A Ysasi, Debra A Harley, and Malachy L Bishop. 2018. Resilience and strengths of rural communities. In Disability and Vocational Rehabilitation in Rural Settings. Springer, 117–136.",
      "doi": ""
    },
    {
      "text": "Cynthia Needles Fletcher, Steven B Garasky, Helen H Jensen, and Robert B Nielsen. 2010. Transportation access: A key employment barrier for rural low-income families. J. Poverty 14, 2 (2010), 123–144.",
      "doi": ""
    },
    {
      "text": "Stefan Foell, Gerd Kortuem, Reza Rawassizadeh, Marcus Handte, Umer Iqbal, and Pedro Marrón. 2014. Micro-navigation for urban bus passengers: using the Internet of Things to improve the public transport experience. arXiv Prepr. arXiv1412.6605 (2014).",
      "doi": ""
    },
    {
      "text": "Jodi Forlizzi, William C Barley, and Thomas Seder. 2010. Where should i turn: moving from individual to collaborative navigation strategies to inform the interaction design of future navigation systems. In Proceedings of the SIGCHI conference on human factors in computing systems, 1261–1270.",
      "doi": "10.1145/1753326.1753516"
    },
    {
      "text": "European AIDS Treatment Group. 2020. EmERGE Project.",
      "doi": ""
    },
    {
      "text": "Greg Guest, Arwen Bunce, and Laura Johnson. 2006. How many interviews are enough? An experiment with data saturation and variability. Field methods 18, 1 (2006), 59–82.",
      "doi": ""
    },
    {
      "text": "K. Han, P.C. Shih, V. Bellotti, and J.M. Carroll. 2015. It's time there was an app for that too: A usability study of mobile timebanking. Int. J. Mob. Hum. Comput. Interact. 7, 2 (2015). DOI:https://doi.org/10.4018/ijmhci.2015040101",
      "doi": ""
    },
    {
      "text": "Jean Hardy, Susan Wyche, and Tiffany Veinot. 2019. Rural HCI research: Definitions, distinctions, methods, and opportunities. Proc. ACM Human-Computer Interact. 3, CSCW (2019), 1–33.",
      "doi": "10.1145/3359298"
    },
    {
      "text": "Christina N. Harrington and Tawanna R. Dillahunt. 2021. Eliciting Tech Futures Among Black Young Adults: A Case Study of Remote Speculative Co-Design. In 2021 CHI Conference on Human Factors in Computing Systems (to appear).",
      "doi": ""
    },
    {
      "text": "Hanna Hasselqvist, Mia Hesselgren, and Cristian Bogdan. 2016. Challenging the car norm: Opportunities for ICT to support sustainable transportation practices. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 1300–1311.",
      "doi": "10.1145/2858036.2858468"
    },
    {
      "text": "Lisa I Iezzoni, Mary B Killeen, and Bonnie L O'Day. 2006. Rural residents with disabilities confront substantial barriers to obtaining primary care. Health Serv. Res. 41, 4p1 (2006), 1258–1275.",
      "doi": ""
    },
    {
      "text": "Francisco Kiss, Robin Boldt, Bastian Pfleging, and Stefan Schneegass. 2018. Navigation systems for motorcyclists: exploring wearable tactile feedback for route guidance in the real world. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1–7.",
      "doi": "10.1145/3173574.3174191"
    },
    {
      "text": "Sara Lichtenwalter, Gary Koeske, and Esther Sales. 2006. Examining transportation and employment outcomes: Evidence for moving beyond the bus pass. J. Poverty 10, 1 (2006), 93–115.",
      "doi": ""
    },
    {
      "text": "Daniel T Lichter and David L Brown. 2011. Rural America in an urban society: Changing spatial and social boundaries. Annu. Rev. Sociol. 37, (2011), 565–592.",
      "doi": ""
    },
    {
      "text": "Yi-Tien Lin, Hsiao-Ching Su, I-Wen Lo, and Po-Lin Chou. 2016. BringUBus: Matching Buses to Passengers with Lower Mobility. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems, 44–49.",
      "doi": "10.1145/2851581.2890640"
    },
    {
      "text": "Juan F. Maestre, Elizabeth V. Eikey, Mark Warner, Svetlana Yarosh, Jessica Pater, Maia Jacobs, Gabriela Marcu, and Patrick C. Shih. 2018. Conducting research with stigmatized populations: Practices, challenges, and lessons learned. In Companion of the 2018 ACM conference on computer supported cooperative work and social computing, 385–392. DOI:https://doi.org/10.1145/3272973.3273003",
      "doi": ""
    },
    {
      "text": "Juan F. Maestre, K. Cassie Kresnye, Julia C. Dunbar, Ciabhan L. Connelly, Katie A. Siek, and Patrick C. Shih. 2020. Conducting HCI Research with People Living with HIV Remotely. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, Association for Computing Machinery (ACM), New York, NY, USA, 1–8. DOI:https://doi.org/10.1145/3334480.3375202",
      "doi": ""
    },
    {
      "text": "Juan F. Maestre, Patrycja Zdziarska, Aehong Min, Anna N. Baglione, Chia-Fang Chung, and Patrick C. Shih. 2020. Not Another Medication Adherence App: Critical Reflections on Addressing Public HIV-related Stigma Through Design. Proc. ACM Human-Computer Interact. CSCW (2020).",
      "doi": ""
    },
    {
      "text": "Juan F Maestre, Haley MacLeod, Ciabhan L Connelly, Julia C Dunbar, Jordan Beck, Katie A Siek, and Patrick C Shih. 2018. Defining through expansion: conducting asynchronous remote communities (arc) research with stigmatized groups. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1–13.",
      "doi": "10.1145/3173574.3174131"
    },
    {
      "text": "Gabriela Marcu, Nadia Dowshen, Shuvadittya Saha, Ressa Reneth Sarreal, and Nazanin Andalibi. TreatYoSelf: Empathy-driven behavioral intervention for marginalized youth living with HIV.",
      "doi": ""
    },
    {
      "text": "Jeremy Mattson. 2017. Rural Transit Fact Book 2017. 2020.",
      "doi": ""
    },
    {
      "text": "Carolyn McAndrews, Kirsten Beyer, Clare E Guse, and Peter Layde. 2017. Are rural places less safe for motorists? Definitions of urban and rural to understand road safety disparities. Inj. Prev. 23, 6 (2017), 412–415.",
      "doi": ""
    },
    {
      "text": "Bradley W. McDaniels, Debra A. Harley, and David T. Beach. 2017. Transportation, accessibility, and accommodation in rural communities. In Disability and Vocational Rehabilitation in Rural Settings: Challenges to Service Delivery. DOI:https://doi.org/10.1007/978-3-319-64786-9_3",
      "doi": ""
    },
    {
      "text": "Johanna Meurer, Martin Stein, David Randall, Markus Rohde, and Volker Wulf. 2014. Social dependency and mobile autonomy: supporting older adults’ mobility with ridesharing ict. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1923–1932.",
      "doi": "10.1145/2556288.2557300"
    },
    {
      "text": "Linda Moneyham, Jen McLeod, Amelia Boehme, Laura Wright, Michael Mugavero, Paula Seal, Wynne E Norton, and Mirjam-Colette Kempf. 2010. Perceived barriers to HIV care among HIV-infected women in the Deep South. J. Assoc. Nurses AIDS Care 21, 6 (2010), 467–477.",
      "doi": ""
    },
    {
      "text": "Lois Wright Morton and Troy C Blanchard. 2007. Starved for access: life in rural America's food deserts. Rural Realities 1, 4 (2007), 1–10.",
      "doi": ""
    },
    {
      "text": "Laura Nyblade, Anne Stangl, Ellen Weiss, and Kim Ashburn. 2009. Combating HIV stigma in health care settings: what works? J. Int. AIDS Soc. 12, 1 (2009), 15.",
      "doi": ""
    },
    {
      "text": "Laurence Palk, Justin T Okano, Luckson Dullie, and Sally Blower. 2020. Travel time to health-care facilities, mode of transportation, and HIV elimination in Malawi: a geospatial modelling analysis. Lancet Glob. Heal. 8, 12 (2020), e1555–e1564.",
      "doi": ""
    },
    {
      "text": "Konstantinos Papangelis, Somayajulu Sripada, David Corsar, Nagendra Velaga, Peter Edwards, and John D Nelson. 2013. Developing a real time passenger information system for rural areas. In International Conference on Human Interface and the Management of Information, Springer, 153–162.",
      "doi": "10.1007/978-3-642-39215-3_19"
    },
    {
      "text": "Mark D Partridge and Dan S Rickman. 2006. The geography of American poverty: Is there a need for place-based policies? WE Upjohn Institute.",
      "doi": ""
    },
    {
      "text": "Jennifer A Pellowski. 2013. Barriers to care for rural people living with HIV: a review of domestic research and health care models. J. Assoc. Nurses AIDS Care 24, 5 (2013), 422–437.",
      "doi": ""
    },
    {
      "text": "Jennifer A Pellowski, Seth C Kalichman, Karen A Matthews, and Nancy Adler. 2013. A pandemic of the poor: Social disadvantage and the US HIV epidemic. Am. Psychol. 68, 4 (2013), 197.",
      "doi": ""
    },
    {
      "text": "Kameshwari Pothukuchi and Richard Wallace. 2009. Sustainable food systems: Perspectives on transportation policy. (2009).",
      "doi": ""
    },
    {
      "text": "Manoj Prasad, Paul Taele, Daniel Goldberg, and Tracy A Hammond. 2014. Haptimoto: Turn-by-turn haptic route guidance interface for motorcyclists. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3597–3606.",
      "doi": "10.1145/2556288.2557404"
    },
    {
      "text": "Centers for Disease Control and Prevention. 2018. HIV and Older Americans. CDC.",
      "doi": ""
    },
    {
      "text": "Sasank Reddy, Katie Shilton, Gleb Denisov, Christian Cenizal, Deborah Estrin, and Mani Srivastava. 2010. Biketastic: sensing and mapping for better biking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1817–1820.",
      "doi": "10.1145/1753326.1753598"
    },
    {
      "text": "S Reif, C E Golin, and S R Smith. 2005. Barriers to accessing HIV/AIDS care in North Carolina: Rural and urban differences. AIDS Care 17, 5 (2005), 558–565.",
      "doi": ""
    },
    {
      "text": "Susan Sullins Reif, Susan DesHarnais, and Shulamit Bernard. 1999. Rural health research community perceptions of the effects of rural hospital closure on access to care. J. Rural Heal. 15, 2 (1999), 202–209.",
      "doi": ""
    },
    {
      "text": "Sergio Rueda, Sanjana Mitra, Shiyi Chen, David Gogolishvili, Jason Globerman, Lori Chambers, Mike Wilson, Carmen H Logie, Qiyun Shi, Sara Morassaei, and others. 2016. Examining the associations between HIV-related stigma and health outcomes in people living with HIV/AIDS: a series of meta-analyses. BMJ Open 6, 7 (2016), e011453.",
      "doi": ""
    },
    {
      "text": "Lynda M Sagrestano, Joy Clay, Ruthbeth Finerman, Jennifer Gooch, and Melanie Rapino. 2014. Transportation vulnerability as a barrier to service utilization for HIV-positive individuals. AIDS Care 26, 3 (2014), 314–319.",
      "doi": ""
    },
    {
      "text": "Manaswi Saha, Michael Saugstad, Hanuma Teja Maddali, Aileen Zeng, Ryan Holland, Steven Bower, Aditya Dash, Sage Chen, Anthony Li, Kotaro Hara, and others. 2019. Project sidewalk: A web-based crowdsourcing tool for collecting sidewalk accessibility data at scale. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–14.",
      "doi": "10.1145/3290605.3300292"
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Clea C Sarnquist, Shila Soni, Helen Hwang, Barbara B Topol, Salima Mutima, and Yvonne A Maldonado. 2011. Rural HIV-infected women's access to medical care: ongoing needs in California. AIDS Care 23, 7 (2011), 792–796.",
      "doi": ""
    },
    {
      "text": "Economic Research Service. County Level Data Set.",
      "doi": ""
    },
    {
      "text": "Ajay K Sethi, David D Celentano, Stephen J Gange, Richard D Moore, and Joel E Gallant. 2003. Association between adherence to antiretroviral therapy and human immunodeficiency virus drug resistance. Clin. Infect. Dis. 37, 8 (2003), 1112–1118.",
      "doi": ""
    },
    {
      "text": "Joseph R Sharkey. 2009. Measuring potential access to food stores and food-service places in rural areas in the US. Am. J. Prev. Med. 36, 4 (2009), S151–S155.",
      "doi": ""
    },
    {
      "text": "Ian Shergold, Graham Parkhurst, and Charles Musselwhite. 2012. Rural car dependence: an emerging barrier to community activity for older people. Transp. Plan. Technol. 35, 1 (2012), 69–85.",
      "doi": ""
    },
    {
      "text": "Patrick C. Shih, Victoria M. E. Bellotti, Kyungsik Han, and John M. Carroll. 2015. Unequal time for unequal value: Implications of differing motivations for participation in timebanking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 1075–1084. DOI:https://doi.org/10.1145/2702123.2702560",
      "doi": ""
    },
    {
      "text": "Erkki Siira and Samuli Heinonen. 2015. Enabling mobility for the elderly: design and Implementation of Assistant navigation service. In Proceedings of 14th International Conference on Mobility and Transport for Elderly and Disabled Persons.",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Jo Gibbs, and Ann Blandford. 2019. Emotion and Experience in Negotiating HIV-Related Digital Resources: “ It's not just a runny nose!” In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–14.",
      "doi": "10.1145/3290605.3300829"
    },
    {
      "text": "Peter J Smit, Michael Brady, Michael Carter, Ricardo Fernandes, Lance Lamore, Michael Meulbroek, Michel Ohayon, Tom Platteau, Peter Rehberg, Jürgen K Rockstroh, and others. 2012. HIV-related stigma within communities of gay men: a literature review. AIDS Care 24, 4 (2012), 405–412.",
      "doi": ""
    },
    {
      "text": "Aaron Smith. 2016. Shared, Collaborative and On Demand: The New Digital Economy.",
      "doi": ""
    },
    {
      "text": "Matthew Lee Smith, Thomas R Prohaska, Kara E MacLeod, Marcia G Ory, Amy R Eisenstein, David R Ragland, Cheryl Irmiter, Samuel D Towne, and William A Satariano. 2017. Non-emergency medical transportation needs of middle-aged and older adults: A rural-urban comparison in Delaware, USA. Int. J. Environ. Res. Public Health 14, 2 (2017), 174.",
      "doi": ""
    },
    {
      "text": "Martin Stein, Johanna Meurer, Alexander Boden, and Volker Wulf. 2017. Mobility in later life: Appropriation of an integrated transportation platform. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 5716–5729.",
      "doi": "10.1145/3025453.3025672"
    },
    {
      "text": "Gunnar Stevens, Paul Bossauer, Stephanie Vonholdt, and Christina Pakusch. 2019. Using Time and Space Efficiently in Driverless Cars: Findings of a Co-Design Study. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–14.",
      "doi": "10.1145/3290605.3300635"
    },
    {
      "text": "Eileen S Stommes and Dennis M Brown. 2002. Transportation in rural America: Issues for the 21st century. Rural Am. Dev. Perspect. 16, 2221-2019–2484 (2002), 2–10.",
      "doi": ""
    },
    {
      "text": "Michael K Svangren, Mikael B Skov, and Jesper Kjeldskov. 2018. Passenger trip planning using ride-sharing services. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1–12.",
      "doi": "10.1145/3173574.3174054"
    },
    {
      "text": "Shahram Tahmasseby, Lina Kattan, and Brian Barbour. 2016. Propensity to participate in a peer‐to‐peer social‐network‐based carpooling system. J. Adv. Transp. 50, 2 (2016), 240–254.",
      "doi": ""
    },
    {
      "text": "James M Tesoriero, Britney L Johnson, Rachel Hart-Malloy, Jennifer L Cukrovany, Brenda L Moncur, Kathleen M Bogucki, Bridget J Anderson, and Megan C Johnson. 2017. Improving retention in HIV care through New York's expanded partner services data-to-care pilot. J. Public Heal. Manag. Pract. 23, 3 (2017), 255.",
      "doi": ""
    },
    {
      "text": "Kimberly B Ulett, James H Willig, Hui-Yi Lin, Justin S Routman, Sarah Abroms, Jeroan Allison, Ashlee Chatham, James L Raper, Michael S Saag, and Michael J Mugavero. 2009. The therapeutic implications of timely linkage and early retention in HIV care. AIDS Patient Care STDS 23, 1 (2009), 41–49.",
      "doi": ""
    },
    {
      "text": "Tiffany Veinot. 2009. “A lot of people didn't have a chance to support us because we never told them” Stigma management, information poverty and HIV/AIDS information/help networks. Proc. Am. Soc. Inf. Sci. Technol. 46, 1 (2009), 1–20.",
      "doi": ""
    },
    {
      "text": "Tiffany C Veinot and Roma Harris. 2011. Talking about, knowing about HIV/AIDS in Canada: A rural‐urban comparison. J. Rural Heal. 27, 3 (2011), 310–318.",
      "doi": ""
    },
    {
      "text": "Katherine J Curtis White and Avery M Guest. 2003. Community lost or transformed? Urbanization and social ties. City Community 2, 3 (2003), 239–259.",
      "doi": ""
    },
    {
      "text": "K Robin Yabroff, William F Lawrence, Jason C King, Patricia Mangan, Kathleen Shakira Washington, Bin Yi, and Jeanne S Mandelblatt. 2005. Mortality: what are the roles of risk factor prevalence, screening, and use of recommended treatment? J. Rural Heal. 21, 2 (2005), 149–157.",
      "doi": ""
    },
    {
      "text": "Desheng Zhang, Tian He, Fan Zhang, Mingming Lu, Yunhuai Liu, Haengju Lee, and Sang H Son. 2016. Carpooling service for large-scale taxicab networks. ACM Trans. Sens. Networks 12, 3 (2016), 1–35.",
      "doi": "10.1145/2886775"
    },
    {
      "text": "John Zimmerman, Anthony Tomasic, Charles Garrod, Daisy Yoo, Chaya Hiruncharoenvate, Rafae Aziz, Nikhil Ravi Thiruvengadam, Yun Huang, and Aaron Steinfeld. 2011. Field trial of tiramisu: crowd-sourcing bus arrival times to spur co-design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1677–1686.",
      "doi": "10.1145/1978942.1979187"
    },
    {
      "text": "2020. Fixed Broadband Deployment. Commission, Fedearl Communications.",
      "doi": ""
    }
  ]
}