{
  "doi": "10.1145/3411764.3445503",
  "title": "CakeVR: A Social Virtual Reality (VR) Tool for Co-designing Cakes",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Cake customization services allow clients to collaboratively personalize cakes with pastry chefs. However, remote (e.g., email) and in-person co-design sessions are prone to miscommunication, due to natural restrictions in visualizing cake size, decoration, and celebration context. This paper presents the design, implementation, and expert evaluation of a social VR application (CakeVR) that allows a client to remotely co-design cakes with a pastry chef, through real-time realistic 3D visualizations. Drawing on expert semi-structured interviews (4 clients, 5 pastry chefs), we distill and incorporate 8 design requirements into our CakeVR prototype. We evaluate CakeVR with 10 experts (6 clients, 4 pastry chefs) using cognitive walkthroughs, and find that it supports ideation and decision making through intuitive size manipulation, color/flavor selection, decoration design, and custom celebration theme fitting. Our findings provide recommendations for enabling co-design in social VR and highlight CakeVR’s potential to transform product design communication through remote interactive and immersive co-design.",
  "authors": [
    {
      "name": "Yanni Mei",
      "institution": "Centrum Wiskunde & Informatica, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700511",
      "orcid": "missing"
    },
    {
      "name": "Jie Li",
      "institution": "Centrum Wiskunde & Informatica, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260993",
      "orcid": "missing"
    },
    {
      "name": "Huib de Ridder",
      "institution": "Dept Industrial Design Engineering Delft University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339496246",
      "orcid": "missing"
    },
    {
      "name": "Pablo Cesar",
      "institution": "CWI, Netherlands",
      "img": "/do/10.1145/contrib-81318497573/rel-imgonly/pablo.jpg",
      "acmid": "81318497573",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Samar Altarteer, Charissis Vassilis, David Harrison, and Warren Chan. 2016. Product customisation: virtual reality and new opportunities for luxury brands online trading. In Proceedings of the 21st International Conference on Web3D Technology. ACM, New York, NY, USA, 173–174.",
      "doi": "10.1145/2945292.2945317"
    },
    {
      "text": "Christoph Anthes, Rubén Jesús García-Hernández, Markus Wiedemann, and Dieter Kranzlmüller. 2016. State of the art of virtual reality technology. In 2016 IEEE Aerospace Conference. IEEE, Big Sky, MT, USA, 1–19.",
      "doi": ""
    },
    {
      "text": "Susanna Aromaa and Kaisa Väänänen. 2016. Suitability of virtual prototypes to support human factors/ergonomics evaluation during the design. Applied ergonomics 56(2016), 11–18.",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining what individual SUS scores mean: Adding an adjective rating scale. Journal of usability studies 4, 3 (2009), 114–123.",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Hrvoje Benko, Christian Holz, Mike Sinclair, and Eyal Ofek. 2016. Normaltouch and texturetouch: High-fidelity 3d haptic shape rendering on handheld virtual reality controllers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 717–728.",
      "doi": "10.1145/2984511.2984526"
    },
    {
      "text": "Sussane Bodker. 1996. Creating conditions for participation: Conflicts and resources in systems development. Human–computer interaction 11, 3 (1996), 215–236.",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS: a “quick and dirty’usability. CRC press, London, UK. 189 pages.",
      "doi": ""
    },
    {
      "text": "John Brooke. 2013. SUS: a retrospective. Journal of usability studies 8, 2 (2013), 29–40.",
      "doi": "10.5555/2817912.2817913"
    },
    {
      "text": "Elchanan Bruckheimer, Carmel Rotschild, Tamir Dagan, Gabriel Amir, Aviad Kaufman, Shaul Gelman, and Einat Birk. 2016. Computer-generated real-time digital holography: first time use in clinical medical imaging. European Heart Journal-Cardiovascular Imaging 17, 8 (2016), 845–849.",
      "doi": ""
    },
    {
      "text": "Robert G Burgess. 2003. Field research: A sourcebook and field manual. Vol. 4. Routledge, London and New York.",
      "doi": ""
    },
    {
      "text": "Simon R Charsley. 1992. Wedding cakes and cultural history. Taylor & Francis, London, UK.",
      "doi": ""
    },
    {
      "text": "Elizabeth F Churchill and Dave Snowdon. 1998. Collaborative virtual environments: an introductory review of issues and systems. virtual reality 3, 1 (1998), 3–15.",
      "doi": ""
    },
    {
      "text": "Elizabeth F Churchill, David N Snowdon, and Alan J Munro. 2012. Collaborative virtual environments: digital places and spaces for interaction. Springer Science & Business Media, London, UK.",
      "doi": ""
    },
    {
      "text": "Darren W Dahl and C Page Moreau. 2007. Thinking inside the box: Why consumers enjoy constrained creative experiences. Journal of Marketing Research 44, 3 (2007), 357–369.",
      "doi": ""
    },
    {
      "text": "Deborah Dougherty. 1992. Interpretive barriers to successful product innovation in large firms. Organization science 3, 2 (1992), 179–202.",
      "doi": "10.1287/orsc.3.2.179"
    },
    {
      "text": "Mary Douglas. 2014. Food in the social order. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Tobias Drey, Jan Gugenheimer, Julian Karlbauer, Maximilian Milo, and Enrico Rukzio. 2020. VRSketchIn: Exploring the Design Space of Pen and Tablet Interaction for 3D Sketching in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376628"
    },
    {
      "text": "Elena Dzardanova, Vlasios Kasapakis, and Damianos Gavalas. 2018. On the effect of social context in virtual reality: An examination of the determinants of human behavior in shared immersive virtual environments. IEEE Consumer Electronics Magazine 7, 4 (2018), 44–52.",
      "doi": ""
    },
    {
      "text": "Gerhard Fischer and Eric Scharff. 2000. Meta-design: design for designers. In Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques. ACM, New York, NY, USA, 396–405.",
      "doi": "10.1145/347642.347798"
    },
    {
      "text": "Maia Garau, Mel Slater, Vinoba Vinayagamoorthy, Andrea Brogni, Anthony Steed, and M Angela Sasse. 2003. The impact of avatar realism and eye gaze control on perceived quality of communication in a shared immersive virtual environment. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, New York, NY, USA, 529–536.",
      "doi": "10.1145/642611.642703"
    },
    {
      "text": "Sukeshini A Grandhi, Gina Joue, and Irene Mittelberg. 2011. Understanding naturalness and intuitiveness in gesture production: insights for touchless gestural interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 821–824.",
      "doi": "10.1145/1978942.1979061"
    },
    {
      "text": "Guido Hermans. 2014. Investigating the unexplored possibilities of digital-physical toolkits in lay design. International Journal of Design 8, 2 (2014), 15–28.",
      "doi": ""
    },
    {
      "text": "Masakazu Hirota, Hiroyuki Kanda, Takao Endo, Tomomitsu Miyoshi, Suguru Miyagawa, Yoko Hirohara, Tatsuo Yamaguchi, Makoto Saika, Takeshi Morimoto, and Takashi Fujikado. 2019. Comparison of visual fatigue caused by head-mounted display for virtual reality and two-dimensional display using objective and subjective evaluation. Ergonomics 62, 6 (2019), 759–766.",
      "doi": ""
    },
    {
      "text": "S Jack Hu. 2013. Evolving paradigms of manufacturing: from mass production to mass customization and personalization. Procedia Cirp 7(2013), 3–8.",
      "doi": ""
    },
    {
      "text": "Yu-Chun Huang and Sooyeon Rosie Han. 2014. An immersive virtual reality museum via second life. In International Conference on Human-Computer Interaction. Springer, Springer, Cham, New York, NY, USA, 579–584.",
      "doi": ""
    },
    {
      "text": "Baking IT. 2015. BakingIT: A Platform for Organising, Managing and Running Your Cake Business. Baking It Ltd. Retrieved September 3, 2020 from https://www.bakingit.com",
      "doi": ""
    },
    {
      "text": "Jacek Jankowski and Martin Hachet. 2013. A Survey of Interaction Techniques for Interactive 3D Environments. In Eurographics 2013 - State of the Art Reports, M. Sbert and L. Szirmay-Kalos (Eds.). The Eurographics Association, Girona, Spain, 65–93. https://doi.org/10.2312/conf/EG2013/stars/065-093",
      "doi": ""
    },
    {
      "text": "Eva Johansson and Donna Berthelsen. 2014. The birthday cake: Social relations and professional practices around mealtimes with toddlers in child care. In Lived Spaces of Infant-Toddler Education and Care. Springer, New York, NY, USA, 75–88.",
      "doi": ""
    },
    {
      "text": "Claire-Marie Karat, Robert Campbell, and Tarra Fiegel. 1992. Comparison of Empirical Testing and Walkthrough Methods in User Interface Evaluation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). Association for Computing Machinery, New York, NY, USA, 397–404. https://doi.org/10.1145/142750.142873",
      "doi": "10.1145/142750.142873"
    },
    {
      "text": "Rahul Karyappa and Michinao Hashimoto. 2019. chocolate-based ink three-dimensional Printing (Ci3DP). Scientific reports 9, 1 (2019), 1–11.",
      "doi": ""
    },
    {
      "text": "Beth L Leech. 2002. Asking questions: Techniques for semistructured interviews. PS: Political science and politics 35, 4 (2002), 665–668.",
      "doi": ""
    },
    {
      "text": "Jie Li, Yiping Kong, Thomas Röggla, Francesca De Simone, Swamy Ananthanarayan, Huib de Ridder, Abdallah El Ali, and Pablo Cesar. 2019. Measuring and understanding photo sharing experiences in social Virtual Reality. In Proceedings of the ACM CHI 2019 Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 667.",
      "doi": "10.1145/3290605.3300897"
    },
    {
      "text": "Fabien Lotte, Aurelien Van Langhenhove, Fabrice Lamarche, Thomas Ernest, Yann Renard, Bruno Arnaldi, and Anatole Lécuyer. 2010. Exploring large virtual environments by thoughts using a brain–computer interface based on motor imagery and high-level commands. Presence: teleoperators and virtual environments 19, 1(2010), 54–70.",
      "doi": ""
    },
    {
      "text": "Robert F Lusch and Stephen L Vargo. 2014. The service-dominant logic of marketing: Dialog, debate, and directions. Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Thuy Mai. 2012. NASA Technology Readiness Level (TRL). National Aeronautics and Space Administration. Retrieved January 4, 2020 from https://www.nasa.gov/directorates/heo/scan/engineering/technology/txt_accordion1.html",
      "doi": ""
    },
    {
      "text": "Jaques Marc, Nadira Belkacem, and Jaques Marsot. 2007. Virtual reality: A design tool for enhanced consideration of usability “validation elements”. Safety science 45, 5 (2007), 589–601.",
      "doi": ""
    },
    {
      "text": "Michael McCurdy, Christopher Connors, Guy Pyrzak, Bob Kanefsky, and Alonso Vera. 2006. Breaking the Fidelity Barrier: An Examination of Our Current Characterization of Prototypes and an Example of a Mixed-Fidelity Success. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 1233–1242. https://doi.org/10.1145/1124772.1124959",
      "doi": "10.1145/1124772.1124959"
    },
    {
      "text": "Mark McGill, John H Williamson, and Stephen Brewster. 2016. Examining the role of smart TVs and VR HMDs in synchronous at-a-distance media consumption. ACM Transactions on Computer-Human Interaction (TOCHI) 23, 5(2016), 33.",
      "doi": "10.1145/2983530"
    },
    {
      "text": "Albert Mehrabian. 2007. Nonverbal Communication. New Brunswick.",
      "doi": ""
    },
    {
      "text": "Mako Miyatake, Aoi Watanabe, and Yoshihiro Kawahara. 2020. Interactive Cake Decoration with Whipped Cream. In Proceedings of the 2020 Multimedia on Cooking and Eating Activities Workshop. ACM, New York, NY, USA, 7–11.",
      "doi": "10.1145/3379175.3391711"
    },
    {
      "text": "D Mourtzis, M Doukas, and C Vandera. 2014. Mobile apps for product customisation and design of manufacturing networks. Manufacturing Letters 2, 2 (2014), 30–34.",
      "doi": ""
    },
    {
      "text": "Joschka Mütterlein, Sebastian Jelsch, and Thomas Hess. 2018. Specifics of Collaboration in Virtual Reality: How Immersion Drives the Intention to Collaborate.. In PACIS. PACIS, Yokohama, Japan, 318.",
      "doi": ""
    },
    {
      "text": "Marianna Obrist, Sriram Subramanian, Elia Gatti, Benjamin Long, and Thomas Carter. 2015. Emotions mediated through mid-air haptics. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2053–2062.",
      "doi": "10.1145/2702123.2702361"
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L Davidson, Sameh Khamis, Mingsong Dou, 2016. Holoportation: Virtual 3d teleportation in real-time. In Proceedings of the 29th UIST. ACM, ACM, New York, NY, USA, 741–754.",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Alessandro Perin, Tommaso Francesco Galbiati, Roberta Ayadi, Enrico Gambatesa, Eleonora Francesca Orena, Nicole Irene Riker, Hagit Silberberg, Donatella Sgubin, Torstein Ragnar Meling, and Francesco DiMeco. 2020. Informed consent through 3D virtual reality: a randomized clinical trial. Acta Neurochir (Wien) April 3, 2020, online(2020), 1–8.",
      "doi": ""
    },
    {
      "text": "Frank Piller, Petra Schubert, Michael Koch, and Kathrin Moesleim. 2004. From mass customization to collaborative customer codesign. In In Proceedings of the 12th European Conference on Information Systems (ECIS) 2004. ECIS, Turku, Finland, 118.",
      "doi": ""
    },
    {
      "text": "B Joseph Pine. 1993. Mass customization. Vol. 17. Harvard business school press Boston, Boston, Massachusetts, USA.",
      "doi": ""
    },
    {
      "text": "Antti Pirinen 2016. The barriers and enablers of co-design for services. International Journal of Design 10, 3 (2016), 27–42.",
      "doi": ""
    },
    {
      "text": "Havi Propel. 2020. Cake Configurator. Havi Propel Product Customizer. Retrieved September 3, 2020 from https://www.havipropel.com/cake-configurator",
      "doi": ""
    },
    {
      "text": "Leiying Pu. 2019. Co-design approach: a collective design method for improving working efficiency and satisfaction in user support design processes: an empirical study based on three comparison groups simulating a real-world quick start guide design process. Master’s thesis. University of Twente.",
      "doi": ""
    },
    {
      "text": "Andrea L Pusic, Anne F Klassen, Laura Snell, Stefan J Cano, Colleen McCarthy, Amie Scott, Yeliz Cemal, Lisa R Rubin, and Peter G Cordeiro. 2012. Measuring and managing patient expectations for breast reconstruction: impact on quality of life and patient satisfaction. Expert review of pharmacoeconomics & outcomes research 12, 2(2012), 149–158.",
      "doi": ""
    },
    {
      "text": "Anett Racz and Gergo Zilizi. 2018. VR aided architecture and interior design. In 2018 International Conference on Advances in Computing and Communication Engineering (ICACCE). IEEE, IEEE, Paris, France, 11–16.",
      "doi": ""
    },
    {
      "text": "Nimesha Ranasinghe, Pravar Jain, Shienny Karwita, David Tolley, and Ellen Yi-Luen Do. 2017. Ambiotherm: enhancing sense of presence in virtual reality by simulating real-world environmental conditions. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1731–1742.",
      "doi": "10.1145/3025453.3025723"
    },
    {
      "text": "John Rieman, Marita Franzke, and David Redmiles. 1995. Usability evaluation with the cognitive walkthrough. In Conference companion on Human factors in computing systems. ACM, New York, NY, USA, 387–388.",
      "doi": "10.1145/223355.223735"
    },
    {
      "text": "Jose Luis Rubio-Tamayo, Manuel Gertrudix Barrio, and Francisco García García. 2017. Immersive environments and virtual reality: Systematic review and advances in communication, interaction and simulation. Multimodal Technologies and Interaction 1, 4 (2017), 21.",
      "doi": ""
    },
    {
      "text": "Bhawna Sachdeva. 2015. How to Prepare and Conduct Cake Consultation. Baking It Ltd. Retrieved September 1, 2020 from https://blog.bakingit.com/how-to-prepare-and-conduct-cake-consultation",
      "doi": ""
    },
    {
      "text": "Elizabeth B-N Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. Co-design 4, 1 (2008), 5–18.",
      "doi": ""
    },
    {
      "text": "Liz Sanders. 2012. Convivial Toolbox: Generative Research for the Front End of Design. BIS Publisher, Amsterdam, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Samuel B Schorr and Allison M Okamura. 2017. Fingertip tactile devices for virtual object manipulation and exploration. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 3115–3119.",
      "doi": "10.1145/3025453.3025744"
    },
    {
      "text": "Harrison Jesse Smith and Michael Neff. 2018. Communication behavior in embodied virtual reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3173863"
    },
    {
      "text": "Rainer Stark, Johann Habakuk Israel, and Thomas Wöhler. 2010. Towards hybrid modelling environments—Merging desktop-CAD and virtual reality-technologies. CIRP annals 59, 1 (2010), 179–182.",
      "doi": ""
    },
    {
      "text": "Shishir Subramanyam, Jie Li, Irene Viola, and Pablo Cesar. 2020. Comparing the Quality of Highly Realistic Digital Humans in 3DoF and 6DoF: A Volumetric Video Case Study. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, IEEE, Atlanta, Georgia, USA, 127–136.",
      "doi": ""
    },
    {
      "text": "Jie Sun, Zhuo Peng, Weibiao Zhou, Jerry YH Fuh, Geok Soon Hong, and Annette Chiu. 2015. A review on 3D printing for customized food fabrication. Procedia Manufacturing 1(2015), 308–319.",
      "doi": ""
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237–246.",
      "doi": ""
    },
    {
      "text": "Dominic Thompson and Ruth Filik. 2016. Sarcasm in written communication: Emoticons are efficient markers of intention. Journal of Computer-Mediated Communication 21, 2 (2016), 105–120.",
      "doi": "10.1111/jcc4.12156"
    },
    {
      "text": "Tarja Tiainen and Tiina Jouppila. 2019. Use of Virtual Environment and Virtual Prototypes in Co-Design: The Case of Hospital Design. Computers 8, 2 (2019), 44.",
      "doi": ""
    },
    {
      "text": "Jakob Trischler, Simon J Pervan, Stephen J Kelly, and Don R Scott. 2018. The value of codesign: The effect of customer involvement in service design teams. Journal of Service Research 21, 1 (2018), 75–100.",
      "doi": ""
    },
    {
      "text": "Jose E Venson, Jean Berni, Carlos S Maia, A Marques da Silva, Marcos d’Ornelas, and Anderson Maciel. 2016. Medical imaging VR: can immersive 3D aid in diagnosis?. In Proceedings of the 22nd ACM VRST. ACM, ACM, New York, NY, USA, 349–350.",
      "doi": "10.1145/2993369.2996333"
    },
    {
      "text": "Adrien Verhulst, Jean-Marie Normand, Cindy Lombart, and Guillaume Moreau. 2017. A study on the use of an immersive virtual reality store to investigate consumer perceptions and purchase behavior toward non-standard fruits and vegetables. In 2017 IEEE Virtual Reality (VR). IEEE, IEEE, Los Angeles, California, USA, 55–63.",
      "doi": ""
    },
    {
      "text": "Arnold P. O. S. Vermeeren, Effie Lai-Chong Law, Virpi Roto, Marianna Obrist, Jettie Hoonhout, and Kaisa Väänänen-Vainio-Mattila. 2010. User Experience Evaluation Methods: Current State and Development Needs. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries(Reykjavik, Iceland) (NordiCHI ’10). Association for Computing Machinery, New York, NY, USA, 521–530. https://doi.org/10.1145/1868914.1868973",
      "doi": "10.1145/1868914.1868973"
    },
    {
      "text": "Vinoba Vinayagamoorthy, Maxine Glancy, Christoph Ziegler, and Richard Schäffer. 2019. Personalising the TV Experience using Augmented Reality: An Exploratory Study on Delivering Synchronised Sign Language Interpretation. In Proceedings of the ACM CHI 2019 Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 532.",
      "doi": "10.1145/3290605.3300762"
    },
    {
      "text": "Cheng Yao Wang, Mose Sakashita, Upol Ehsan, Jingjin Li, and Andrea Stevenson Won. 2020. Again, Together: Socially Reliving Virtual Reality Experiences When Separated. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376642"
    },
    {
      "text": "Yi Wang, Hai-Shu Ma, Jing-Hui Yang, and Ke-Sheng Wang. 2017. Industry 4.0: a way from mass customization to mass personalization production. Advances in Manufacturing 5, 4 (2017), 311–320.",
      "doi": ""
    },
    {
      "text": "Tong Xue, Jie Li, Guo Chen, and Pablo Cesar. 2020. A Social VR Clinic for Knee Arthritis Patients with Haptics. In Proceedings of the 2020 ACM IMX Conference on Interactive Media Experiences. ACM IMX 2020, Barcelona, Spain, 1==5.",
      "doi": ""
    },
    {
      "text": "Hwanmoo Yong, Jisuk Lee, and Jongeun Choi. 2019. Emotion Recognition in Gamers Wearing Head-mounted Display. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, IEEE, Osaka, Japan, 1251–1252.",
      "doi": ""
    },
    {
      "text": "Yajie Zhao, Qingguo Xu, Weikai Chen, Chao Du, Jun Xing, Xinyu Huang, and Ruigang Yang. 2019. Mask-off: Synthesizing face images in the presence of head-mounted displays. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, IEEE, Osaka, Japan, 267–276.",
      "doi": ""
    },
    {
      "text": "Peter Zimmermann. 2008. Virtual Reality Aided Design. A survey of the use of VR in automotive industry. Springer Netherlands, Dordrecht, 277–296.",
      "doi": ""
    },
    {
      "text": "Paul Zipkin. 2001. The limits of mass customization. MIT Sloan management review 42, 3 (2001), 81.",
      "doi": ""
    }
  ]
}