{
  "doi": "10.1145/3411764.3445143",
  "title": "Understanding Tilt in Esports: A Study on Young League of Legends Players",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2021,
  "badges": [],
  "abstract": "Tilt as a gaming term is associated with frustration, rage, and deterioration of gameplay ability. In this exploratory study, we surveyed 95 esports players in a high school esports league on their definitions of tilt, triggers for tilting, responses to tilt, and perception of its malleability. We found that players are tilted most commonly by their own teammates rather than opponents, with their most negative tilt responses reserved for themselves. The majority surveyed believe that they can change how easily they are tilted and believing so was found to lead players to choose more positive responses to tilt. In contrast, perceiving tilt as malleable was found to increase the probability that participants respond with positive strategies. Implications for efforts to improve esports culture and community are discussed.",
  "authors": [
    {
      "name": "Minerva Wu",
      "institution": "Dept of Informatics University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702464",
      "orcid": "missing"
    },
    {
      "name": "Je Seok Lee",
      "institution": "Informatics University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658748274",
      "orcid": "missing"
    },
    {
      "name": "Constance Steinkuehler",
      "institution": "University of California, Irvine, United States",
      "img": "/do/10.1145/contrib-81317490024/rel-imgonly/screen_shot_2022-10-21_at_9.12.00_pm.png",
      "acmid": "81317490024",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Craig Anderson, Kathryn Campbell, and Constance Steinkuehler. 2019. Building persistence through failure: the role of challenge in video games. In Proceedings of the 14th International Conference on the Foundations of Digital Games (pp. 1-6).",
      "doi": "10.1145/3337722.3337741"
    },
    {
      "text": "Earl Babbie, Wagner E. William III, and Jeanne Zaino. 2019. Adventures in Social Research: Data Analysis Using IBM SPSS Statistics, 10th Edition. Thousand Oaks CA: Sage.",
      "doi": ""
    },
    {
      "text": "Steven E. Barkan. 2015. Law and Dispute Resolution. Law and Society: An Introduction. Routledge.",
      "doi": ""
    },
    {
      "text": "Pierpaolo Battigalli, Martin Dufwenberg, and Alec Smith. 2015. Frustration and anger in games. CES Ifo Working Paper, No. 5258. Center for Economic Studies and ifo Institute, Munich.",
      "doi": ""
    },
    {
      "text": "Basil R. Browne. 1989. Going on tilt: Frequent poker players and control. Journal of Gambling Behavior, 5, 1, 3-21.",
      "doi": ""
    },
    {
      "text": "Gifford Cheung and Jeff Huang. 2011. Starcraft from the stands: understanding the game spectator. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 763-772.",
      "doi": "10.1145/1978942.1979053"
    },
    {
      "text": "Collaborative for Academic, Social and Emotional Learning. 2020. Core SEL Competencies. Casel.org. Retrieved from https://casel.org/core-competencies/.",
      "doi": ""
    },
    {
      "text": "Aaron M. Duncan. 2015. Gambling with the Myth of the American Dream. Routledge Research in Sport Culture and Society. Routledge.",
      "doi": ""
    },
    {
      "text": "Carol S. Dweck. 1975. The role of expectations and attributions in the alleviation of learned helplessness. Journal of Personality and Social Psychology, 31, 674-680.",
      "doi": ""
    },
    {
      "text": "Carol S. Dweck, and Ellen L. Leggett. 1988. A social-cognitive approach to motivation and personality. Psychological review, 95(2), 256.",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2017. Social support in eSports: building emotional and esteem support from instrumental support interactions in a highly competitive environment. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. 435-447.",
      "doi": "10.1145/3116595.3116635"
    },
    {
      "text": "Guo Freeman and Donghee Yvette Wohn. 2018. Understanding eSports Team Formation and Coordination. Comput. Support. Coop. Work CSCW An Int. J. 27, 3–6 (December 2018), 1019–1050. DOI: https://doi.org/10.1007/s10606-017-9299-4",
      "doi": ""
    },
    {
      "text": "Kiel M Gilleade and Alan Dix. 2004. Using frustration in the design of adaptive videogames. In Proceedings of the 2004 ACM SIGCHI International Conference on Advances in computer entertainment technology (ACE '04). Association for Computing Machinery, New York, NY, USA, 228–232. DOI: https://doi.org/10.1145/1067343.1067372",
      "doi": "10.1145/1067343.1067372"
    },
    {
      "text": "Thomas Gilovich, Robert Vallone, and Amos Tversky. 1985. The hot hand in basketball: On the misperception of random sequences. Cognitive Psychology 17, 3: 295 - 314.",
      "doi": ""
    },
    {
      "text": "Barney G. Glaser, and Anselm L. Strauss. 1967. The discovery of grounded theory: Strategies for qualitative research. Chicago: Aldine.",
      "doi": ""
    },
    {
      "text": "Juliana M. Horowitz and Nikki Graf. 2019. Most US Teens See Anxiety and Depression as a Major Problem Among Their Peers. PEW Research Center. Retrieved March 2019 from https://www.pewsocialtrends.org/2019/02/20/most-u-s-teens-see-anxiety-and-depression-as-a-major-problem-among-their-peers/",
      "doi": ""
    },
    {
      "text": "Daniel Johnson, Lennart E. Nacke, and Peta Wyeth. 2015. All about that base: differing player experiences in video game genres and the unique case of moba games. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, 2265-2274.",
      "doi": "10.1145/2702123.2702447"
    },
    {
      "text": "Young Ji Kim, David Engel, Anita Williams Woolley, Jeffrey Yu-Ting Lin, Naomi McArthur, and Thomas W. Malone. 2017. What makes a strong team? Using collective intelligence to predict team performance in League of Legends. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, 2316-2329.",
      "doi": ""
    },
    {
      "text": "Yubo Kou, and Xinning Gui. 2014. Playing with strangers: understanding temporary teams in League of Legends. In Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play, 161-169.",
      "doi": "10.1145/2658537.2658538"
    },
    {
      "text": "Yubo Kou, Yao Li, Xinning Gui, and Eli Suzuki-Gill. 2018. Playing with Streakiness in Online Games: How Players Perceive and React to Winning and Losing Streaks in League of Legends. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1-14.",
      "doi": "10.1145/3173574.3174152"
    },
    {
      "text": "Yubo Kou and Xinning Gui. 2020. Emotion Regulation in eSports Gaming: A Qualitative Study of League of Legends. In Proceedings of the ACM on Human-Computer Interaction, Vol 4, No. CSCW2, Article 158 (October 2020). 26 pages. https://doi.org/10.1145/3415229",
      "doi": "10.1145/3415229"
    },
    {
      "text": "Haewoon Kwak, Jeremy Blackburn, and Seungyeop Han. 2015. Exploring Cyberbullying and Other Toxic Behavior in team Competition Online Games. In Proceedings of the 2015 CHI Conference on Human Factors in Computing Systems, 3739 - 3748.",
      "doi": "10.1145/2702123.2702529"
    },
    {
      "text": "Je Seok Lee, Minerva Wu, Diana Lee, Lee Fleming, Lindsay Ruben, Tom Turner, Kevin Brown, and Constance Steinkuehler. 2020. Designing an Interest-Based Integrated Curriculum Around Esports. International Journal of Designs for Learning. 11, 3 (Aug. 2020), 78-95. DOI: https://doi.org/10.14434/ijdl.v11i3.27663.",
      "doi": ""
    },
    {
      "text": "Marcus Märtens, Siqi Shen, Alexandru Iosup, and Gernando Kuipers. 2015. Toxicity Detection in Multiplayer Online Games. 2015 International Workshop on Network and Systems Support for Games (NetGames). IEEE. 1-6.",
      "doi": ""
    },
    {
      "text": "North America Scholastic Esports Federation (2020). “Locations “ Retrieved March 2020 from https://www.nasef.org/clubs/locations/",
      "doi": ""
    },
    {
      "text": "Andrew K. Przybylski, C. Scott Rigby, and Richard M. Ryan. 2010. A motivational model of video game engagement. Review of general psychology, 14(2), 154-166.",
      "doi": ""
    },
    {
      "text": "Natasha Dow Schull. 2016. Abiding chance: Online poker and the software of self-discipline. Public Culture. 28 (3). 563-592.",
      "doi": ""
    },
    {
      "text": "Yuri Seo, and Sang-uk Jung. 2016. Beyond solitary play in computer games: The social practices of eSports. Journal of Consumer Culture, 16(3), 635–655. https://doi.org/10.1177/1469540514553711",
      "doi": ""
    },
    {
      "text": "Catherine A. Spann, Valerie J. Shute, Seyedahmad Rahimi, and Sidney K. D'Mello. 2019. The productive role of cognitive reappraisal in regulating affect during game-based learning. Computers in Human Behavior, 100, 358-369.",
      "doi": ""
    },
    {
      "text": "Michael G. Wagner. 2006. On the Scientific Relevance of eSports. In International conference on internet computing, 437-442.",
      "doi": ""
    },
    {
      "text": "Xingjie Wei*, Jussi Palomaki*, Jeff Yan, and Peter Robinson. 2016. The Science and detection of tilting. In Proceedings of the 2016 ACM on International Conference on Multimedia Retrieval, 79-86.",
      "doi": ""
    },
    {
      "text": "White and Daniela M. Romano. 2020. Scalable Psychological Momentum Forecasting in Esports. In SUM '20: State-based User Modelling. 10.13140/RG.2.2.21224.21769",
      "doi": ""
    },
    {
      "text": "Emma Witkowski. 2012. On the digital playing field: How we “do sport” with networked computer games. Games and Culture, 7(5), 349-374.",
      "doi": ""
    }
  ]
}