{
  "doi": "10.1145/3411764.3445558",
  "title": "SoniBand: Understanding the Effects of Metaphorical Movement Sonifications on Body Perception and Physical Activity",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "Negative body perceptions are a major predictor of physical inactivity, a serious health concern. Sensory feedback can be used to alter such body perceptions; movement sonification, in particular, has been suggested to affect body perception and levels of physical activity (PA) in inactive people. We investigated how metaphorical sounds impact body perception and PA. We report two qualitative studies centered on performing different strengthening/flexibility exercises using SoniBand, a wearable that augments movement through different sounds. The first study involved physically active participants and served to obtain a nuanced understanding of the sonifications’ impact. The second, in the home of physically inactive participants, served to identify which effects could support PA adherence. Our findings show that movement sonification based on metaphors led to changes in body perception (e.g., feeling strong) and PA (e.g., repetitions) in both populations, but effects could differ according to the existing PA-level. We discuss principles for metaphor-based sonification design to foster PA.",
  "tags": [
    "auditory body perception",
    "physically inactive population",
    "multimodal interfaces",
    "movement sonification",
    "interaction styles",
    "sensory feedback"
  ],
  "authors": [
    {
      "name": "Judith Ley-Flores",
      "institution": "DEI Interactive Systems Group, Universidad Carlos III de Madrid, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701241",
      "orcid": "missing"
    },
    {
      "name": "Laia Turmo Vidal",
      "institution": "Dept of Informatics and Media, Uppsala University, Sweden",
      "img": "/do/10.1145/contrib-99659019371/rel-imgonly/_mg_8750.jpg",
      "acmid": "99659019371",
      "orcid": "missing"
    },
    {
      "name": "Nadia Berthouze",
      "institution": "UCL Interaction Centre University College London, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350585889",
      "orcid": "0000-0001-8921-0044"
    },
    {
      "name": "Aneesha Singh",
      "institution": "UCL Interaction Centre University College London, UK",
      "img": "/do/10.1145/contrib-81502753265/rel-imgonly/aneeshalinkedinphoto.jpg",
      "acmid": "81502753265",
      "orcid": "0000-0003-0835-5802"
    },
    {
      "name": "Frédéric Bevilacqua",
      "institution": "STMS IRCAM-CNRS-Sorbonne Université, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100077889",
      "orcid": "missing"
    },
    {
      "name": "Ana Tajadura-Jiménez",
      "institution": "Universidad Carlos III de Madrid and UCL Interaction Centre University College London, Spain",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416598418",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lisa Feldman Barrett. 2017. The theory of constructed emotion: an active inference account of interoception and categorization. Social Cognitive and Affective Neuroscience 12, 1: 1–23. https://doi.org/10.1093/scan/nsw154",
      "doi": ""
    },
    {
      "text": "Stuart Biddle. 2007. Psychology of Physical Activity. Routledge. https://doi.org/10.4324/9780203019320",
      "doi": ""
    },
    {
      "text": "Matthew Botvinick and Jonathan Cohen. 1998. Rubber hands ‘feel’ touch that eyes see. Nature 391, 6669: 756–756. https://doi.org/10.1038/35784",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "John Cairney, John Hay, Brent Faught, James Mandigo, and Andreas Flouris. 2005. Developmental coordination disorder, self-efficacy toward physical activity, and play: Does gender matter? Adapted Physical Activity Quarterly. https://doi.org/10.1123/apaq.22.1.67",
      "doi": ""
    },
    {
      "text": "Daniel Cesarini, Davide Calvaresi, Chiara Farnesi, Diego Taddei, Stefano Frediani, Bodo E. Ungerechts, and Thomas Hermann. 2016. MEDIATION: An eMbEddeD System for Auditory Feedback of Hand-water InterAcTION while Swimming. Procedia Engineering 147: 324–329. https://doi.org/10.1016/j.proeng.2016.06.301",
      "doi": ""
    },
    {
      "text": "David E. Conroy, Chih Hsiang Yang, and Jaclyn P. Maher. 2014. Behavior change techniques in top-ranked mobile apps for physical activity. American Journal of Preventive Medicine 46, 6: 649–652. https://doi.org/10.1016/j.amepre.2014.01.010",
      "doi": ""
    },
    {
      "text": "Jules Françoise, Yves Candau, Sarah Fdili Alaoui, and Thecla Schiphorst. 2017. Designing for Kinesthetic Awareness: Revealing User Experiences Through Second-Person Inquiry. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 5171–5183. https://doi.org/10.1145/3025453.3025714",
      "doi": "10.1145/3025453.3025714"
    },
    {
      "text": "Emma Frid, Roberto Bresin, Paolo Alborno, and Ludvig Elblaus. 2016. Interactive sonification of spontaneous movement of children-cross-modal mapping and the perception of body movement qualities through sound. Frontiers in Neuroscience 10, NOV. https://doi.org/10.3389/fnins.2016.00521",
      "doi": ""
    },
    {
      "text": "Denise Gastaldo, Natalia Rivas-Quarneti, and Lilian Magalhães. 2018. Body-map storytelling as a health research methodology: Blurred lines creating clear pictures. Forum Qualitative Sozialforschung. https://doi.org/10.17169/fqs-19.2.2858",
      "doi": ""
    },
    {
      "text": "Hilde Geraedts, Agnes Zijlstra, Sjoerd K. Bulstra, Martin Stevens, and Wiebren Zijlstra. 2013. Effects of remote feedback in home-based physical activity interventions for older adults: A systematic review. Patient Education and Counseling 91, 14–24. https://doi.org/10.1016/j.pec.2012.10.018",
      "doi": ""
    },
    {
      "text": "Tobias Grundgeiger, Jürgen Pichen, Jennifer Häfner, Birgit Wallmann-Sperlich, Diana Löffler, and Stephan Huber. 2017. Combating Sedentary Behavior: An App Based on a Distributed Prospective Memory Approach. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’17. https://doi.org/10.1145/3027063.3053094",
      "doi": "10.1145/3027063.3053094"
    },
    {
      "text": "Maria Hagströmer, Pekka Oja, and Michael Sjöström. 2006. The International Physical Activity Questionnaire (IPAQ): a study of concurrent and construct validity. Public Health Nutrition 9, 06. https://doi.org/10.1079/PHN2005898",
      "doi": ""
    },
    {
      "text": "Daniel Harrison, Nadia Berthouze, Paul Marshall, and Jon Bird. 2014. Tracking Physical Activity: Problems Related to Running Longitudinal Studies with Commercial Devices. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing Adjunct Publication - UbiComp ’14 Adjunct, 699–702. https://doi.org/10.1145/2638728.2641320",
      "doi": "10.1145/2638728.2641320"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Stå ahl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), 3131–3142. https://doi.org/10.1145/2858036.2858583",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Elisabeth T. Kersten-van Dijk, Joyce H.D.M. Westerink, Femke Beute, and Wijnand A. IJsselsteijn. 2017. Personal Informatics, Self-Insight, and Behavior Change: A Critical Review of Current Literature. Human–Computer Interaction 32, 5–6: 268–296. https://doi.org/10.1080/07370024.2016.1276456",
      "doi": "10.1080/07370024.2016.1276456"
    },
    {
      "text": "Patty Kostkova, Lynne Margaret Coventry, Alycia N Sullivan, and Margie E Lachman. 2017. Behavior Change with Fitness Technology in Sedentary Adults: A Review of the Evidence for. Increasing Physical Activity. Front. Public Health 4: 289. https://doi.org/10.3389/fpubh.2016.00289",
      "doi": ""
    },
    {
      "text": "Judith Ley-Flores, Frederic Bevilacqua, Nadia Bianchi-Berthouze, and Ana Taiadura-Jimenez. 2019. Altering body perception and emotion in physically inactive people through movement sonification. In 2019 8th International Conference on Affective Computing and Intelligent Interaction (ACII), 1–7. https://doi.org/10.1109/ACII.2019.8925432",
      "doi": ""
    },
    {
      "text": "Lian Loke and Toni Robertson. 2013. Moving and making strange: An embodied approach to movement-based interaction design. ACM Transactions on Computer-Human Interaction. https://doi.org/10.1145/2442106.2442113",
      "doi": "10.1145/2442106.2442113"
    },
    {
      "text": "Edward McAuley. 1993. Self-efficacy and the maintenance of exercise participation in older adults. Journal of Behavioral Medicine 16, 1: 103–113. https://doi.org/10.1007/BF00844757",
      "doi": ""
    },
    {
      "text": "Fritz Menzer, Anna Brooks, Pär Halje, Christof Faller, Martin Vetterli, and Olaf Blanke. 2010. Feeling in control of your footsteps: Conscious gait monitoring and the auditory consequences of footsteps. Cognitive Neuroscience 1, 3: 184–192. https://doi.org/10.1080/17588921003743581",
      "doi": ""
    },
    {
      "text": "Nanette Mutrie and Avril Blamey. 2008. Thinking about becoming more active? . 24.",
      "doi": ""
    },
    {
      "text": "Joseph Newbold, Nicolas E. Gold, and Nadia Bianchi-Berthouze. 2020. Movement sonification expectancy model: leveraging musical expectancy theory to create movement-altering sonifications. Journal on Multimodal User Interfaces 14, 2: 153–166. https://doi.org/10.1007/s12193-020-00322-2",
      "doi": ""
    },
    {
      "text": "Joseph W. Newbold, Nadia Bianchi-Berthouze, and Nicolas E. Gold. 2017. Musical Expectancy in Squat Sonification for People Who Struggle with Physical Activity. In Proceedings of the 23rd International Conference on Auditory Display - ICAD 2017, 65–72. https://doi.org/10.21785/icad2017.008",
      "doi": ""
    },
    {
      "text": "Joseph W. Newbold, Nadia Bianchi-Berthouze, Nicolas E. Gold, Ana Tajadura-Jiménez, and Amanda CdC Williams. 2016. Musically Informed Sonification for Chronic Pain Rehabilitation. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16, 5698–5703. https://doi.org/10.1145/2858036.2858302",
      "doi": "10.1145/2858036.2858302"
    },
    {
      "text": "Matthew P. Normand. 2008. Increasing physical activity through self-monitoring, goal setting, and feedback. Behavioral Interventions 23, 4: 227–236. https://doi.org/10.1002/bin.267",
      "doi": ""
    },
    {
      "text": "Claudia Núñez-Pacheco and Lian Loke. 2017. Tacit Narratives: Surfacing aesthetic meaning by using wearable props and focusing. In TEI 2017 - Proceedings of the 11th International Conference on Tangible, Embedded, and Embodied Interaction. https://doi.org/10.1145/3024969.3024979",
      "doi": "10.1145/3024969.3024979"
    },
    {
      "text": "Patricia Rick, Milagrosa Bianchi-Berthouze, Nadia Sánchez-Martín, Aneesha Singh, and Ana Borda Mas, Mercedes Tajadura-Jiménez. 2019. Identifying psychological factors to improve adherence to physical activity in the obese population. In 5th annual CBC conference, Behaviour Change for Health: Digital and Other Innovative Methods.",
      "doi": ""
    },
    {
      "text": "Patricia Rick, Milagrosa Sánchez-Martín, Aneesha Singh, Sergio Navas-León, Mercedes Bordá-Más, Nadia Bianchi-Berthouze, Ana Tajadura-Jiménez, Milagrosa Sánchez-Martin, Aneesha Singh, Navas-León Sergio, Bordá-Más Mercedes, Nadia Bianchi-Berthouze, and Ana Tajadura-Jiménez. 2020. Embedding Psychological Factors in Technology Design to Improve Adherence to Physical Activity: Literature Review and Survey. Pre-print. https://doi.org/10.2196/preprints.19663",
      "doi": ""
    },
    {
      "text": "Giulio Rosati, Antonio Rodà, Federico Avanzini, and Stefano Masiero. 2013. On the Role of Auditory Feedback in Robot-Assisted Movement Training after Stroke: Review of the Literature. Computational Intelligence and Neuroscience 2013: 1–15. https://doi.org/10.1155/2013/586138",
      "doi": ""
    },
    {
      "text": "Nina Schaffert, Thenille Braun Janzen, Klaus Mattes, and Michael H. Thaut. 2019. A Review on the Relationship Between Sound and Movement in Sports and Rehabilitation. Frontiers in Psychology 10, FEB. https://doi.org/10.3389/fpsyg.2019.00244",
      "doi": ""
    },
    {
      "text": "Nina Schaffert and Klaus Mattes. 2015. Interactive Sonification in Rowing: Acoustic Feedback for On-Water Training. IEEE MultiMedia 22, 1: 58–67. https://doi.org/10.1109/MMUL.2015.9",
      "doi": "10.1109/MMUL.2015.9"
    },
    {
      "text": "Gerd Schmitz, Jeannine Bergmann, Alfred O. Effenberg, Carmen Krewer, Tong-Hun Hwang, and Friedemann Müller. 2018. Movement Sonification in Stroke Rehabilitation. Frontiers in Neurology 9. https://doi.org/10.3389/fneur.2018.00389",
      "doi": ""
    },
    {
      "text": "Daniel S Scholz, Sönke Rhode, Michael Großbach, Jens Rollnik, and Eckart Altenmüller. 2015. Moving with music for stroke rehabilitation: a sonification feasibility study. Annals of the New York Academy of Sciences 1337, 1: 69–76. https://doi.org/10.1111/nyas.12691",
      "doi": ""
    },
    {
      "text": "Aneesha Singh. 2016. Staying active despite pain: Investigating feedback mechanisms to support physical activity in people with chronic musculoskeletal pain.",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Nadia Bianchi-Berthouze, and Amanda CdeC Williams. 2017. Supporting Everyday Function in Chronic Pain Using Wearable Technology. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems - CHI ’17, 3903–3915. https://doi.org/10.1145/3025453.3025947",
      "doi": "10.1145/3025453.3025947"
    },
    {
      "text": "Aneesha Singh, Annina Klapper, Jinni Jia, Antonio Fidalgo, Ana Tajadura Jimenez, Natalie Kanakam, Nadia Bianchi-Berthouze, and Amanda Williams. 2014. Motivating people with chronic pain to do physical activity: Opportunities for technology design. In Conference on Human Factors in Computing Systems - Proceedings. https://doi.org/10.1145/2556288.2557268",
      "doi": "10.1145/2556288.2557268"
    },
    {
      "text": "Aneesha Singh, Stefano Piana, Davide Pollarolo, Gualtiero Volpe, Giovanna Varni, Ana Tajadura-Jiménez, Amanda CdeC Williams, Antonio Camurri, and Nadia Bianchi-Berthouze. 2015. Go-with-the-Flow: tracking, analysis and sonification of movement and breathing to build confidence in activity despite chronic pain. Human–Computer Interaction 0024, January 2016: 1–49. https://doi.org/10.1080/07370024.2015.1085310",
      "doi": "10.1080/07370024.2015.1085310"
    },
    {
      "text": "Ana Tajadura Jimenez, Manos Tsakiris, Torsten Marquardt, and Nadia Bianchi Berthouze. 2015. Action sounds update the mental representation of arm dimension: Contributions of kinaesthesia and agency. Frontiers in Psychology 6. https://doi.org/10.3389/fpsyg.2015.00689",
      "doi": ""
    },
    {
      "text": "Ana Tajadura-Jiménez, Maria Basia, Ophelia Deroy, Merle Fairhurst, Nicolai Marquardt, and Nadia Bianchi-Berthouze. 2015. As Light as your Footsteps: Altering Walking Sounds to Change Perceived Body Weight, Emotional State and Gait. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, 2943–2952. https://doi.org/10.1145/2702123.2702374",
      "doi": "10.1145/2702123.2702374"
    },
    {
      "text": "Ana Tajadura-Jiménez, Francisco Cuadrado, Patricia Rick, Nadia Bianchi-Berthouze, Aneesha Singh, Aleksander Väljamäe, and Frédéric Bevilacqua. 2018. Designing a gesture-sound wearable system to motivate physical activity by altering body perception. In Proceedings of the 5th International Conference on Movement and Computing - MOCO ’18, 1–6. https://doi.org/10.1145/3212721.3212877",
      "doi": "10.1145/3212721.3212877"
    },
    {
      "text": "Ana Tajadura-Jiménez, Joseph Newbold, Linge Zhang, Patricia Rick, and Nadia Bianchi-Berthouze. 2019. As Light as You Aspire to Be: Changing Body Perception with Sound to Support Physical Activity. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, 1–14. https://doi.org/10.1145/3290605.3300888",
      "doi": "10.1145/3290605.3300888"
    },
    {
      "text": "Ana Tajadura-Jiménez, Maria Vakali, Merle T. Fairhurst, Alisa Mandrigin, Nadia Bianchi-Berthouze, and Ophelia Deroy. 2017. Contingent sounds change the mental representation of one's finger length. Scientific Reports 7, 1: 5748. https://doi.org/10.1038/s41598-017-05870-4",
      "doi": ""
    },
    {
      "text": "Ana Tajadura-Jiménez, Aleksander Väljamäe, Frédéric Bevilacqua, and Nadia Bianchi-Berthouze. 2017. Principles for Designing Body-Centered Auditory Feedback. In The Wiley Handbook of Human Computer Interaction. John Wiley & Sons, Ltd, Chichester, UK, 371–403. https://doi.org/10.1002/9781118976005.ch18",
      "doi": ""
    },
    {
      "text": "Ana Tajadura-Jiménez, Aleksander Väljamäe, Iwaki Toshima, Toshitaka Kimura, Manos Tsakiris, and Norimichi Kitagawa. 2012. Action sounds recalibrate perceived tactile distance. Current Biology 22, 13: R516–R517. https://doi.org/10.1016/J.CUB.2012.04.028",
      "doi": ""
    },
    {
      "text": "Lie Ming Tang and Judy Kay. 2017. Harnessing Long Term Physical Activity Data—How Long-term Trackers Use Data and How an Adherence-based Interface Supports New Insights. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies. https://doi.org/10.1145/3090091",
      "doi": "10.1145/3090091"
    },
    {
      "text": "Vasiliki Tsaknaki, Madeline Balaam, Anna Ståhl, Pedro Sanches, Charles Windlin, Pavel Karpashevich, and Kristina Höök. 2019. Teaching soma design. In DIS 2019 - Proceedings of the 2019 ACM Designing Interactive Systems Conference. https://doi.org/10.1145/3322276.3322327",
      "doi": "10.1145/3322276.3322327"
    },
    {
      "text": "I Wallis, T Ingalls, T Rikakis, L Olsen, Y Chen, W Xu, and H Sundaram. 2007. Real-Time Sonification of Movement for an Immersive Stroke Rehabilitation Environment. In International Community of Auditory Display.",
      "doi": ""
    },
    {
      "text": "Charles Windlin, Anna Ståhl, Pedro Sanches, Vasiliki Tsaknaki, Pavel Karpashevich, Madeline Balaam, and Kristina Höök. 2019. Soma Bits-Mediating Technology to Orchestrate Bodily Experiences. In RTD 2019-Research through Design Conference 2019, the Science Centre, Delft, on 19th to 22nd March 2019.",
      "doi": ""
    },
    {
      "text": "Che-Chang Yang and Yeh-Liang Hsu. 2010. A Review of Accelerometry-Based Wearable Motion Detectors for Physical Activity Monitoring. Sensors 10: 7772–7788. https://doi.org/10.3390/s100807772",
      "doi": ""
    },
    {
      "text": "Che-Chang Yang, Yeh-Liang Hsu, Che-Chang Yang, and Yeh-Liang Hsu. 2010. A Review of Accelerometry-Based Wearable Motion Detectors for Physical Activity Monitoring. Sensors 10, 8: 7772–7788. https://doi.org/10.3390/s100807772",
      "doi": ""
    },
    {
      "text": "2010. Global Recommendations on Physical Activity for Health. World Health Organization, Switzerland.",
      "doi": ""
    }
  ]
}