{
  "doi": "10.1145/3411764.3445164",
  "title": "Exploring User-Centered Security Design for Usable Authentication Ceremonies",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Security technology often follows a systems design approach that focuses on components instead of users. As a result, the users’ needs and values are not sufficiently addressed, which has implications on security usability. In this paper, we report our lessons learned from applying a user-centered security design process to a well-understood security usability challenge, namely key authentication in secure instant messaging. Users rarely perform these key authentication ceremonies, which makes their end-to-end encrypted communication vulnerable. Our approach includes collaborative design workshops, an expert evaluation, iterative storyboard prototyping, and an online evaluation.  While we could not demonstrate that our design approach resulted in improved usability or user experience, we found that user-centered prototypes can increase the users’ comprehension of security implications. Hence, prototypes based on users’ intuitions, needs, and values are useful starting points for approaching long-standing security challenges. Applying complementary design approaches may improve usability and user experience further.",
  "authors": [
    {
      "name": "Matthias Fassl",
      "institution": "CISPA Helmholtz Center for Information Security, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700447",
      "orcid": "0000-0002-2894-3751"
    },
    {
      "name": "Lea Theresa Gröber",
      "institution": "CISPA Helmholtz Center for Information Security, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700604",
      "orcid": "missing"
    },
    {
      "name": "Katharina Krombholz",
      "institution": "CISPA Helmholtz Center for Information Security, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86158755757",
      "orcid": "0000-0003-2425-3013"
    }
  ],
  "references": [
    {
      "text": "Ruba Abu-Salma, M. Angela Sasse, Joseph Bonneau, Anastasia Danilova, Alena Naiakshina, and Matthew Smith. 2017. Obstacles to the Adoption of Secure Communication Tools. In 2017 IEEE Symposium on Security and Privacy (S&P 2017). IEEE, 137–153. https://doi.org/10.1109/sp.2017.65",
      "doi": ""
    },
    {
      "text": "Chris Alexander and Ian Goldberg. 2007. Improved user authentication in off-the-record messaging. In Proceedings of the 2007 ACM Workshop on Privacy in Electronic Society (WPES 2007). ACM, 41–47. https://doi.org/10.1145/1314333.1314340",
      "doi": "10.1145/1314333.1314340"
    },
    {
      "text": "Morten Sieker Andreasen, Henrik Villemann Nielsen, Simon Ormholt Schrøder, and Jan Stage. 2007. What happened to remote usability testing?: an empirical study of three methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’07). ACM, 1405–1414. https://doi.org/10.1145/1240624.1240838",
      "doi": "10.1145/1240624.1240838"
    },
    {
      "text": "Dirk Balfanz, DK Smetters, Paul Stewart, and H Chi Wong. 2002. Talking To Strangers: Authentication in Ad-Hoc Wireless Networks. In Proceedings of Network and Distributed System Security Symposium 2002 (NDSS ’02). Internet Society.",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip T. Kortum, and James T. Miller. 2008. An Empirical Evaluation of the System Usability Scale. International Journal of Human-Computer Interaction 24, 6(2008), 574–594. https://doi.org/10.1080/10447310802205776",
      "doi": ""
    },
    {
      "text": "Fabrice Boudot, Berry Schoenmakers, and Jacques Traoré. 2001. A fair and efficient solution to the socialist millionaires’ problem. Discrete Applied Mathematics 111, 1-2 (2001), 23—36. https://doi.org/10.1016/s0166-218x(00)00342-5",
      "doi": ""
    },
    {
      "text": "Anders Bruun, Peter Gull, Lene Hofmeister, and Jan Stage. 2009. Let your users do the testing: a comparison of three remote asynchronous usability testing methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’09). ACM, 1619–1628. https://doi.org/10.1145/1518701.1518948",
      "doi": "10.1145/1518701.1518948"
    },
    {
      "text": "Susanne Bødker and Kaj Grønbæk. 1991. Cooperative Prototyping: Users and Designers in Mutual Activity. International Journal of Man-Machine Studies 34 (1991), 453 — 478. https://doi.org/10.7146/dpb.v19i332.6562",
      "doi": "10.1016/0020-7373%2891%2990030-B"
    },
    {
      "text": "Geoff Cooper and John Bowers. 1995. Representing the user: Notes on the disciplinary rhetoric of human-computer interaction. In The Social and Interactional Dimensions of Human-Computer Interfaces, Peter J. Thomas (Ed.). Cambridge University Press, 48—66.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design Justice: Community-Led Practices to Build the Worlds We Need. MIT Press. https://books.google.de/books?id=m4LPDwAAQBAJ",
      "doi": "10.7551/mitpress/12255.001.0001"
    },
    {
      "text": "Sauvik Das, Tiffany Hyun-Jin Kim, Laura A Dabbish, and Jason I Hong. 2014. The Effect of Social Influence on Security Sensitivity. In 10th Symposium On Usable Privacy and Security (SOUPS 2014). USENIX Association, 143–157.",
      "doi": ""
    },
    {
      "text": "Sauvik Das, Adam D.I. Kramer, Laura A. Dabbish, and Jason I. Hong. 2015. The Role of Social Influence in Security Feature Adoption. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW ’15). ACM, 1416–1426. https://doi.org/10.1145/2675133.2675225",
      "doi": "10.1145/2675133.2675225"
    },
    {
      "text": "Verena Distler, Marie-Laure Zollinger, Carine Lallemand, Peter B Roenne, Peter Y A Ryan, and Vincent Koenig. 2019. Security - Visible, Yet Unseen?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI 2019). ACM, 1–13. https://doi.org/10.1145/3290605.3300835",
      "doi": "10.1145/3290605.3300835"
    },
    {
      "text": "Steve Dodier-Lazaro, Ruba Abu-Salma, Ingolf Becker, and M. Angela Sasse. 2017. From Paternalistic to User-Centred Security: Putting Users First with Value-Sensitive Design. In Workshop on Values in Computing. ACM.",
      "doi": ""
    },
    {
      "text": "Ksenia Ermoshina, Harry Halpin, and Francesca Musiani. 2017. Can Johnny build a protocol? Co-ordinating developer and user intentions for privacy-enhanced secure messaging protocols. In The 2nd European Workshop on Usable Security (EuroUSEC). IEEE. https://doi.org/10.14722/eurousec.2017.23016",
      "doi": ""
    },
    {
      "text": "Thomas Franke, Christiane Attig, and Daniel Wessel. 2019. A Personal Resource for Technology Interaction: Development and Validation of the Affinity for Technology Interaction (ATI) Scale. International Journal of Human–Computer Interaction 35, 6(2019), 456—467. https://doi.org/10.1080/10447318.2018.1456150",
      "doi": ""
    },
    {
      "text": "Shirley Gaw, Edward W Felten, and Patricia Fernandez-Kelly. 2006. Secrecy, Flagging, and Paranoia: Adoption Criteria in Encrypted Email. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’06). ACM, 591–600.",
      "doi": "10.1145/1124772.1124862"
    },
    {
      "text": "Christian Gehrmann, Chris J. Mitchell, and Kaisa Nyberg. 2004. Manual authentication for wireless devices. RSA Cryptobytes 7, 1 (2004), 29—37.",
      "doi": ""
    },
    {
      "text": "Dan Goodin. 2018. Police decrypt 258,000 messages after breaking pricey IronChat crypto app. https://arstechnica.com/?p=1408441. Accessed: 2021-1-7.",
      "doi": ""
    },
    {
      "text": "Peter Leo Gorski, Yasemin Acar, Luigi Lo Iacono, and Sascha Fahl. 2020. Listen to Developers! A Participatory Design Study on Security Warnings for Cryptographic APIs. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). ACM, 1—13.",
      "doi": "10.1145/3313831.3376142"
    },
    {
      "text": "Saul Greenberg and Bill Buxton. 2008. Usability evaluation considered harmful (some of the time). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’08). ACM, 111–120. https://doi.org/10.1145/1357054.1357074",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Amir Herzberg and Hemi Leibowitz. 2016. Can Johnny finally encrypt?: evaluating E2E-encryption in popular IM applications. In Proceedings of the 6th Workshop on Socio-Technical Aspects in Security and Trust (STAST ’16). ACM, 17–28. https://doi.org/10.1145/3046055.3046059",
      "doi": "10.1145/3046055.3046059"
    },
    {
      "text": "Lars Erik Holmquist, Friedemann Mattern, Bernt Schiele, Petteri Alahuhta, Michael Beigl, and Hans-W. Gellersen. 2001. Smart-Its Friends: A Technique for Users to Easily Establish Connections between Smart Artefacts. In Proceedings of the 3rd international conference on Ubiquitous Computing (UbiComp ’01). Springer-Verlag, 116—122.",
      "doi": "10.5555/647987.741340"
    },
    {
      "text": "Jason L. Huang, Nathan A. Bowling, Mengqiao Liu, and Yuhui Li. 2015. Detecting Insufficient Effort Responding with an Infrequency Scale: Evaluating Validity and Participant Reactions. Journal of Business and Psychology 30, 2 (2015), 299–311. https://doi.org/10.1007/s10869-014-9357-6",
      "doi": ""
    },
    {
      "text": "Alfred Kobsa, Rahim Sonawalla, Gene Tsudik, Ersin Uzun, and Yang Wang. 2009. Serial Hook-Ups: A Comparative Usability Study of Secure Device Pairing Methods. In Proceedings of the 5th Symposium on Usable Privacy and Security (SOUPS ’09). USENIX Association, 12. https://doi.org/10.1145/1572532.1572546",
      "doi": "10.1145/1572532.1572546"
    },
    {
      "text": "Niels Raabjerg Mathiasen and Susanne Bødker. 2008. Threats or threads: from usable security to secure experience?. In Proceedings of the 5th Nordic Conference on Human-Computer Interaction: Building Bridges (NordiCHI ’08). ACM, 283–289. https://doi.org/10.1145/1463160.1463191",
      "doi": "10.1145/1463160.1463191"
    },
    {
      "text": "Niels Raabjerg Mathiasen and Susanne Bødker. 2011. Experiencing Security in Interaction Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11). ACM, 2325–2334. https://doi.org/10.1145/1978942.1979283",
      "doi": "10.1145/1978942.1979283"
    },
    {
      "text": "Jonathan M. McCune, Adrian Perrig, and Michael K. Reiter. 2005. Seeing-Is-Believing: Using Camera Phones for Human-Verifiable Authentication. In 2005 IEEE Symposium on Security and Privacy (S&P ’05). IEEE.",
      "doi": ""
    },
    {
      "text": "Marcela S Melara, Aaron Blankstein, Joseph Bonneau, Edward W Felten, and Michael J Freedman. 2015. CONIKS: Bringing Key Transparency to End Users.. In 24th USENIX Security Symposium (USENIX Security 15). USENIX Association, 383–398.",
      "doi": "10.5555/2831143.2831168"
    },
    {
      "text": "Nelly Oudshoorn, Els Rommes, and Marcelle Stienstra. 2004. Configuring the User as Everybody: Gender and Design Cultures in Information and Communication Technologies. Science, Technology & Human Values 29, 1 (2004), 30–63. https://doi.org/10.1177/0162243903259190",
      "doi": ""
    },
    {
      "text": "Press Statement of the Dutch Police. 2018. Police have achieved a breakthrough in the interception and decryption of crypto communication. https://www.politie.nl/en/news/2018/november/02-apeldoorn-police-have-achieved-a-breakthrough-in-the-interception-and-decryption-of-crypto-communication.html. Accessed: 2021-1-7.",
      "doi": ""
    },
    {
      "text": "Scott Ruoti, Jeff Andersen, Scott Heidbrink, Mark O’Neill, Elham Vaziripour, Justin Wu, Daniel Zappala, and Kent Seamons. 2016. We’re on the Same Page: A Usability Study of Secure Email Using Pairs of Novice Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16). ACM, 4298–4308. https://doi.org/10.1145/2858036.2858400",
      "doi": "10.1145/2858036.2858400"
    },
    {
      "text": "Scott Ruoti and Kent Seamons. 2016. Standard Metrics and Scenarios for Usable Authentication. In Who Are You?! Adventures in Authentication Workshop (WAY). USENIX Association.",
      "doi": ""
    },
    {
      "text": "Dan Saffer. 2010. Designing for Interaction, Second Edition: Creating Innovative Applications and Devices. New Riders.",
      "doi": ""
    },
    {
      "text": "Christine Satchell and Paul Dourish. 2009. Beyond the user: use and non-use in HCI. In Proceedings of the 21st conference of the computer-human interaction special interest group of Australia on Computer-human interaction: design (OZCHI ’09). ACM, 9–16. https://doi.org/10.1145/1738826.1738829",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Joost Schellevis. 2018. Beveiliging door politie gekraakte ’cryptofoons’ was twijfelachtig. https://www.nos.nl/l/2258309. Accessed: 2021-1-7.",
      "doi": ""
    },
    {
      "text": "Svenja Schröder, Markus Huber, David Wind, and Christoph Rottermanner. 2016. When SIGNAL hits the Fan: On the Usability and Security of State-of-the-Art Secure Mobile Messaging. In European Workshop on Usable Security (EuroUSEC 2016). IEEE. https://doi.org/10.14722/eurousec.2016.23012",
      "doi": ""
    },
    {
      "text": "Clay Spinuzzi. 2005. The Methodology of Participatory Design. Technical Communication 52, 2 (2005), 163—174. https://doi.org/10.1016/j.infsof.2008.09.005",
      "doi": ""
    },
    {
      "text": "Joshua Tan, Lujo Bauer, Joseph Bonneau, Lorrie Faith Cranor, Jeremy Thomas, and Blase Ur. 2017. Can Unicorns Help Users Compare Crypto Key Fingerprints?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17). ACM, 3787–3798. https://doi.org/10.1145/3025453.3025733",
      "doi": "10.1145/3025453.3025733"
    },
    {
      "text": "Ersin Uzun, Nitesh Saxena, and Arun Kumar. 2011. Pairing Devices for Social Interactions: A Comparative Usability Evaluation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’11). ACM, 2315–2324. https://doi.org/10.1145/1978942.1979282",
      "doi": "10.1145/1978942.1979282"
    },
    {
      "text": "Elham Vaziripour, Reza Farahbakhsh, Mark O’Neill, Justin Wu, Kent Seamons, and Daniel Zappala. 2018. A Survey Of the Privacy Preferences and Practices of Iranian Users of Telegram. In Workshop on Usable Security (USEC 2018). Internet Society. https://doi.org/10.14722/usec.2018.23033",
      "doi": ""
    },
    {
      "text": "Elham Vaziripour, Devon Howard, Jake Tyler, Mark O’Neill, Justin Wu, Kent Seamons, and Daniel Zappala. 2019. I Don’t Even Have to Bother Them!: Using Social Media to Automate the Authentication Ceremony in Secure Messaging. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). ACM, 1–12. https://doi.org/10.1145/3290605.3300323",
      "doi": "10.1145/3290605.3300323"
    },
    {
      "text": "Elham Vaziripour, Justin Wu, Mark O’Neill, Daniel Metro, Josh Cockrell, Timothy Moffett, Jornad Whitehead, Nick Bonner, Kent Seamons, and Daniel Zappala. 2018. Action Needed! Helping Users Find and Complete the Authentication Ceremony in Signal. In Proceedings of the Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, 47–62.",
      "doi": ""
    },
    {
      "text": "Elham Vaziripour, Justin Wu, Mark O’Neill, Ray Clinton, Jordan Whitehead, Scott Heidbrink, Kent Seamons, and Daniel Zappala. 2017. Is that you, Alice? A Usability Study of the Authentication Ceremony of Secure Messaging Applications. In Thirteenth Symposium on Usable Privacy and Security (SOUPS 2017). USENIX Association, 29—47.",
      "doi": ""
    },
    {
      "text": "Susanne Weber, Marian Harbach, and Matthew Smith. 2015. Participatory Design for Security-Related User Interfaces. In Workshop on Usable Security (USEC ’15). Internet Society. https://doi.org/10.14722/usec.2015.23011",
      "doi": ""
    },
    {
      "text": "Justin Wu, Cyrus Gattrell, Devon Howard, Jake Tyler, Elham Vaziripour, Kent Seamons, and Daniel Zappala. 2019. ”Something isn’t secure, but I’m not sure how that translates into a problem”: Promoting autonomy by designing for understanding in Signal. In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019). USENIX Association.",
      "doi": ""
    },
    {
      "text": "Mary Ellen Zurko and Richard T. Simon. 1996. User-Centered Security. In Proceedings of the 1996 Workshop on New Security Paradigms (NSPW 1996). 27—33. https://doi.org/10.1145/304851.304859",
      "doi": ""
    }
  ]
}