{
  "doi": "10.1145/3411764.3445119",
  "title": "Can Playing with Toy Blocks Reflect Behavior Problems in Children?",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Although children’s behavioral and mental problems are generally diagnosed in clinical settings, the prediction and awareness of children’s mental wellness in daily settings are getting increased attention. Toy blocks are both accessible in most children’s daily lives and provide physicality as a unique non-verbal channel to express their inner world. In this paper, we propose a toy block approach for predicting a range of behavior problems in young children (4-6 years old) measured by the Child Behavior Checklist (CBCL). We defined and classified a set of quantitative play actions from IMU-embedded toy blocks. Play data collected from 78 preschoolers revealed that specific play actions and patterns indicate total problems, internalizing problems, and aggressive behavior in children. The results align with our qualitative observations, and suggest the potential of predicting the clinical behavior problems of children based on short free-play sessions with sensor-embedded toy blocks.",
  "authors": [
    {
      "name": "Xiyue Wang",
      "institution": "Tohoku University, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659262029",
      "orcid": "missing"
    },
    {
      "name": "Kazuki Takashima",
      "institution": "Tohoku University, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351601788",
      "orcid": "0000-0002-1020-5750"
    },
    {
      "name": "Tomoaki Adachi",
      "institution": "Miyagi Gakuin Women's University, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658656057",
      "orcid": "missing"
    },
    {
      "name": "Yoshifumi Kitamura",
      "institution": "Tohoku University, Japan",
      "img": "/do/10.1145/contrib-81100273942/rel-imgonly/yk-180x120.jpg",
      "acmid": "81100273942",
      "orcid": "0000-0002-7047-627X"
    }
  ],
  "references": [
    {
      "text": "Thomas M Achenbach. 1991. Manual for the child behavior checklist/4-18 and 1991 profile. University of Vermont, Department of Psychiatry (1991).",
      "doi": ""
    },
    {
      "text": "Soroor Arman, Hajar Salimi, and MohammadReza Maracy. 2018. Parenting styles and psychiatric disorders in children of bipolar parents. Advanced Biomedical Research 7, 1 (2018), 147. https://doi.org/10.4103/abr.abr_131_18",
      "doi": ""
    },
    {
      "text": "ATR-Promotions. 2017. TSND121/151. http://www.atr-p.com/products/TSND121.html",
      "doi": ""
    },
    {
      "text": "Jennifer Baggerly and Herbert A. Exum. 2007. Counseling children after natural disasters: guidance for family therapists. The American Journal of Family Therapy 36, 1, 79–93. https://doi.org/10.1080/01926180601057598",
      "doi": ""
    },
    {
      "text": "Laura Bartoli, Franca Garzotto, Mirko Gelsomini, Luigi Oliveto, and Matteo Valoriani. 2014. Designing and evaluating touchless playful interaction for ASD children. In Proceedings of Conference on Interaction Design and Children. 17–26.",
      "doi": "10.1145/2593968.2593976"
    },
    {
      "text": "Miguel Angel Bautista, Antonio Hernández-Vela, Sergio Escalera, Laura Igual, Oriol Pujol, Josep Moya, Verónica Violant, and María T Anguera. 2015. A gesture recognition system for detecting behavioral patterns of ADHD. IEEE Transactions on Cybernetics 46, 1 (2015), 136–147.",
      "doi": ""
    },
    {
      "text": "J Biederman, MC Monuteaux, E Kendrick, KL Klein, and SV Faraone. 2005. The CBCL as a screen for psychiatric comorbidity in paediatric patients with ADHD. Archives of Disease in Childhood 90, 10 (2005), 1010–1015.",
      "doi": ""
    },
    {
      "text": "Joseph Biederman, Carter R Petty, Helen Day, Rachel L Goldin, Thomas Spencer, Stephen V Faraone, Craig BH Surman, and Janet Wozniak. 2012. Severity of the aggression/anxiety-depression/attention (AAA) CBCL profile discriminates between different levels of deficits in emotional regulation in youth with ADHD. Journal of Developmental and Behavioral Pediatrics 33, 3(2012), 236–243.",
      "doi": ""
    },
    {
      "text": "Niels Bilenberg. 1999. The Child Behavior Checklist (CBCL) and related material: standardization and validation in Danish population based and clinically based samples. Acta Psychiatrica Scandinavica 100 (1999), 2–52.",
      "doi": ""
    },
    {
      "text": "Laura Boccanfuso, Erin Barney, Claire Foster, Yeojin Amy Ahn, Katarzyna Chawarska, Brian Scassellati, and Frederick Shic. 2016. Emotional robot to examine different play patterns and affective responses of children with and without ASD. In Proceedings of ACM/IEEE International Conference on Human-Robot Interaction. 19–26.",
      "doi": ""
    },
    {
      "text": "Brad J Bushman and L Rowell Huesmann. 2006. Short-term and long-term effects of violent media on aggression in children and adults. Archives of Pediatrics & Adolescent Medicine 160, 4 (2006), 348–352.",
      "doi": ""
    },
    {
      "text": "Susan B Campbell. 1995. Behavior problems in preschool children: A review of recent research. Journal of Child Psychology and Psychiatry 36, 1 (1995), 113–149.",
      "doi": ""
    },
    {
      "text": "Sally Cartwright. 1988. Play can be the building blocks of learning. Young Children 43, 5, 44–47.",
      "doi": ""
    },
    {
      "text": "Iris Chin, Matthew S Goodwin, Soroush Vosoughi, Deb Roy, and Letitia R Naigles. 2018. Dense home-based recordings reveal typical and atypical development of tense/aspect in a child with delayed language development. Journal of Child Language 45, 1 (2018), 1–34.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1960. A coefficient of agreement for nominal scales. Educational and Psychological Measurement 20, 1 (1960), 37–46.",
      "doi": ""
    },
    {
      "text": "ELAN (Version 5.9). 2020. Nijmegen: Max Planck Institute for Psycholinguistics, The Language Archive.https://archive.mpi.nl/tla/elan",
      "doi": ""
    },
    {
      "text": "Min Fan, Alissa N Antle, Maureen Hoskyn, Carman Neustaedter, and Emily S Cramer. 2017. Why tangibility matters: a design case study of at-risk children learning to read and spell. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems. 1805–1816. https://doi.org/10.1145/3025453.3026048",
      "doi": "10.1145/3025453.3026048"
    },
    {
      "text": "Stephen V Faraone, Robert R Althoff, James J Hudziak, Michael Monuteaux, and Joseph Biederman. 2005. The CBCL predicts DSM bipolar disorder in children: a receiver operating characteristic curve analysis. Bipolar Disorders 7, 6 (2005), 518–524.",
      "doi": ""
    },
    {
      "text": "Robert F Ferdinand. 2008. Validity of the CBCL/YSR DSM-IV scales anxiety problems and affective problems. Journal of Anxiety Disorders 22, 1 (2008), 126–134.",
      "doi": ""
    },
    {
      "text": "Davide Figo, Pedro C. Diniz, Diogo R. Ferreira, and João M. P. Cardoso. 2010. Preprocessing techniques for context recognition from accelerometer data. Personal and Ubiquitous Computing 14, 7, 645–662. https://doi.org/10.1007/s00779-010-0293-9",
      "doi": "10.1007/s00779-010-0293-9"
    },
    {
      "text": "Takeo Fujiwara, Junko Yagi, Hiroaki Homma, Hirobumi Mashiko, Keizo Nagao, Makiko Okuyama, 2014. Clinically significant behavior problems among young children 2 years after the Great East Japan Earthquake. PLoS One 9, 10 (2014), e109342.",
      "doi": ""
    },
    {
      "text": "Hannah Gilbert, Ling Qin, Dandan Li, Xuehua Zhang, and Stuart J Johnstone. 2016. Aiding the diagnosis of AD/HD in childhood: using actigraphy and a continuous performance test to objectively quantify symptoms. Research in Developmental Disabilities 59 (2016), 35–42.",
      "doi": ""
    },
    {
      "text": "Audrey Girouard, David McGookin, Peter Bennett, Orit Shaer, Katie A. Siek, and Marilyn Lennon. 2016. Tangibles for health workshop. In Extended Abstracts of the SIGCHI Conference on Human Factors in Computing Systems. 3461–3468. https://doi.org/10.1145/2851581.2856469",
      "doi": "10.1145/2851581.2856469"
    },
    {
      "text": "Rosanne Regan Hansel. 2015. Kindergarten: Bringing blocks back to the kindergarten classroom. YC Young Children 70, 1 (2015), 44–51.",
      "doi": ""
    },
    {
      "text": "Craig Anne Heflinger, Celeste G Simpkins, and Terri Combs-Orme. 2000. Using the CBCL to determine the clinical status of children in state custody. Children and Youth Services Review 22, 1 (2000), 55–73.",
      "doi": ""
    },
    {
      "text": "Elisabeth S. Hirsch. 1996. The block book. National Association for the Education of Young Children.",
      "doi": ""
    },
    {
      "text": "Yukiko Honda, Takeo Fujiwara, Junko Yagi, Hiroaki Homma, Hirobumi Mashiko, Keizo Nagao, Makiko Okuyama, Masako Ono-Kihara, and Masahiro Kihara. 2019. Long-term impact of parental PTSD symptoms on mental health of their offspring after the Great East Japan Earthquake. Frontiers in Psychiatry 10 (2019), 496.",
      "doi": ""
    },
    {
      "text": "Toshiki Hosoi, Kazuki Takashima, Tomoaki Adachi, Yuichi Itoh, and Yoshifumi Kitamura. 2014. A-blocks: recognizing and assessing child building processes during play with toy blocks. In Proceedings of SIGGRAPH Asia 2014 Emerging Technologies. Article 1, 2 pages. https://doi.org/10.1145/2669047.2669061",
      "doi": "10.1145/2669047.2669061"
    },
    {
      "text": "Syed Arshad Husain, Maureen A Allwood, and Debora J Bell. 2008. The relationship between PTSD symptoms and attention problems in children exposed to the Bosnian war. Journal of Emotional and Behavioral Disorders 16, 1 (2008), 52–62.",
      "doi": ""
    },
    {
      "text": "Jittrapol Intarasirisawat, Chee Siang Ang, Christos Efstratiou, Luke William Feidhlim Dickens, and Rupert Page. 2019. Exploring the touch and motion features in game-based cognitive assessments. In Proceedings of ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies, Vol. 3. Article 87, 25 pages. https://doi.org/10.1145/3351245",
      "doi": "10.1145/3351245"
    },
    {
      "text": "T Itani. 2001. Standardization of the Japanese version of the child behavior checklist/4-18. Psychiatr Neurol Pediatr Jpn 41 (2001), 243–252.",
      "doi": ""
    },
    {
      "text": "Sigal Jacoby, Galia Gutwillig, Doron Jacoby, Naomi Josman, Patrice L. Weiss, Minori Koike, Yuichi Itoh, Norifumi Kawai, Yoshifumi Kitamura, and Ehud Sharlin. 2009. PlayCubes: monitoring constructional ability in children using a tangible user interface and a playful virtual environment. In Proceedings of IEEE Virtual Rehabilitation International Conference. 42–49. https://doi.org/10.1109/ICVR.2009.5174203",
      "doi": ""
    },
    {
      "text": "Xinlong Jiang, Yiqiang Chen, Wuliang Huang, Teng Zhang, Chenlong Gao, Yunbing Xing, and Yi Zheng. 2020. WeDA: Designing and Evaluating A Scale-Driven Wearable Diagnostic Assessment System for Children with ADHD. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems. 1–12. https://doi.org/10.1145/3313831.3376374",
      "doi": "10.1145/3313831.3376374"
    },
    {
      "text": "Heidi Kaduson and Charles E. Schaefer. 2010. 101 favorite play therapy techniques. Volume III. Jason Aronson. 430 pages.",
      "doi": ""
    },
    {
      "text": "Noriko Kato, Toshihiko Yanagawa, Takeo Fujiwara, and Alina Morawska. 2015. Prevalence of children’s mental health problems and the effectiveness of population-level family interventions. Journal of Epidemiology 25, 8 (2015), 507–516.",
      "doi": ""
    },
    {
      "text": "Ronald C Kessler, Patricia Berglund, Olga Demler, Robert Jin, Kathleen R Merikangas, and Ellen E Walters. 2005. Lifetime prevalence and age-of-onset distributions of DSM-IV disorders in the National Comorbidity Survey Replication. Archives of General Psychiatry 62, 6 (2005), 593–602.",
      "doi": ""
    },
    {
      "text": "Ronald C Kessler, Katie A McLaughlin, Jennifer Greif Green, Michael J Gruber, Nancy A Sampson, Alan M Zaslavsky, Sergio Aguilar-Gaxiola, Ali Obaid Alhamzawi, Jordi Alonso, Matthias Angermeyer, 2010. Childhood adversities and adult psychopathology in the WHO World Mental Health Surveys. The British Journal of Psychiatry 197, 5 (2010), 378–385.",
      "doi": ""
    },
    {
      "text": "A M Khan, Young-Koo Lee, S Y Lee, and Tae-Seong Kim. 2010. A triaxial accelerometer-based physical-activity recognition via augmented-signal features and a hierarchical recognizer. IEEE Transactions on Information Technology in Biomedicine 14, 5, 1166–1172. https://doi.org/10.1109/TITB.2010.2051955",
      "doi": "10.1109/TITB.2010.2051955"
    },
    {
      "text": "Naoko Kimura. 2009. How to do the screening for developmental disorder in the routine 18 month and 36 month health check up [in Japanese]. Research Bulletin of Naruto University of Education24, 13–19.",
      "doi": ""
    },
    {
      "text": "Yoshifumi Kitamura, Yuichi Itoh, and Fumio Kishino. 2001. Real-time 3D interaction with ActiveCube. In Proceedings of Extended Abstracts on the SIGCHI Conference on Human Factors in Computing Systems. 355–356. https://doi.org/10.1145/634067.634277",
      "doi": "10.1145/634067.634277"
    },
    {
      "text": "Michael D Kogan, Stephen J Blumberg, Laura A Schieve, Coleen A Boyle, James M Perrin, Reem M Ghandour, Gopal K Singh, Bonnie B Strickland, Edwin Trevathan, and Peter C van Dyck. 2009. Prevalence of parent-reported diagnosis of autism spectrum disorder among children in the US, 2007. Pediatrics 124, 5 (2009), 1395–1403.",
      "doi": ""
    },
    {
      "text": "J Richard Landis and Gary G Koch. 1977. The measurement of observer agreement for categorical data. Biometrics (1977), 159–174.",
      "doi": ""
    },
    {
      "text": "Patrick WL Leung, SL Kwong, CP Tang, TP Ho, SF Hung, CC Lee, SL Hong, CM Chiu, and WS Liu. 2006. Test–retest reliability and criterion validity of the Chinese version of CBCL, TRF, and YSR. Journal of Child Psychology and Psychiatry 47, 9 (2006), 970–973.",
      "doi": ""
    },
    {
      "text": "Xiao Li, Jessilyn Dunn, Denis Salins, Gao Zhou, Wenyu Zhou, Sophia Miryam Schüssler-Fiorenza Rose, Dalia Perelman, Elizabeth Colbert, Ryan Runge, Shannon Rego, 2017. Digital health: tracking physiomes and activity using wearable biosensors reveals useful health-related information. PLoS Biology 15, 1 (2017), e2001402.",
      "doi": ""
    },
    {
      "text": "Gabriela Marcu, Anind K Dey, and Sara Kiesler. 2012. Parent-driven use of wearable cameras for autism support: a field study with families. In Proceedings of ACM Conference on Ubiquitous Computing. 401–410.",
      "doi": "10.1145/2370216.2370277"
    },
    {
      "text": "Kathleen R Merikangas, Robert Jin, Jian-Ping He, Ronald C Kessler, Sing Lee, Nancy A Sampson, Maria Carmen Viana, Laura Helena Andrade, Chiyi Hu, Elie G Karam, 2011. Prevalence and correlates of bipolar spectrum disorder in the world mental health survey initiative. Archives of General Psychiatry 68, 3 (2011), 241–251.",
      "doi": ""
    },
    {
      "text": "Stephanie E Meyer, Gabrielle A Carlson, Eric Youngstrom, Donna S Ronsaville, Pedro E Martinez, Philip W Gold, Rashelle Hakak, and Marian Radke-Yarrow. 2009. Long-term outcomes of youth who manifested the CBCL-Pediatric Bipolar Disorder phenotype during childhood and/or adolescence. Journal of Affective Disorders 113, 3 (2009), 227–235.",
      "doi": ""
    },
    {
      "text": "Svetlana Mironcika, Antoine de Schipper, Annette Brons, Huub Toussaint, Ben Kröse, and Ben Schouten. 2018. Smart toys design opportunities for measuring children’s fine motor skills development. In Proceedings of International Conference on Tangible, Embedded, and Embodied Interaction. 349–356. https://doi.org/10.1145/3173225.3173256",
      "doi": "10.1145/3173225.3173256"
    },
    {
      "text": "Kim T Mueser and Jonas Taub. 2008. Trauma and PTSD among adolescents with severe emotional disorders involved in multiple service systems. Psychiatric Services 59, 6 (2008), 627–634.",
      "doi": ""
    },
    {
      "text": "Mario Muñoz-Organero, Lauren Powell, Ben Heller, Val Harpin, and Jack Parker. 2018. Automatic extraction and detection of characteristic movement patterns in children with ADHD based on a convolutional neural network (CNN) and acceleration images. Sensors 18, 11 (2018), 3924.",
      "doi": ""
    },
    {
      "text": "Fnu Nazneen, Fatima A Boujarwah, Shone Sadler, Amha Mogus, Gregory D Abowd, and Rosa I Arriaga. 2010. Understanding the challenges and opportunities for richer descriptions of stereotypical behaviors of children with ASD: a concept exploration and validation. In Proceedings of International ACM SIGACCESS Conference on Computers and Accessibility. 67–74.",
      "doi": "10.1145/1878803.1878817"
    },
    {
      "text": "Daniel Ness and Stephen J Farenga. 2016. Blocks, bricks, and planks: Relationships between affordance and visuo-spatial constructive play objects.American Journal of Play 8, 2 (2016), 201–227.",
      "doi": ""
    },
    {
      "text": "Nichigan Original. 2017. Unpainted Wooden Blocks. http://www.nocorp.co.jp/mutoso/",
      "doi": ""
    },
    {
      "text": "Ehimwenma Nosakhare and Rosalind Picard. 2019. Probabilistic latent variable modeling for assessing behavioral influences on well-being. In Proceedings of ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. 2718–2726. https://doi.org/10.1145/3292500.3330738",
      "doi": "10.1145/3292500.3330738"
    },
    {
      "text": "Ehimwenma Nosakhare and Rosalind Picard. 2020. Toward assessing and recommending combinations of behaviors for improving health and well-being. ACM Transactions on Computing for Healthcare 1, 1, Article 4 (March 2020), 29 pages. https://doi.org/10.1145/3368958",
      "doi": "10.1145/3368958"
    },
    {
      "text": "World Health Organization. 2001. The World Health Report 2001: Mental health: new understanding, new hope. World Health Organization.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2005. Atlas: child and adolescent mental health resources: global concerns, implications for the future. World Health Organization. Collaboration between the World Health Organization, the World Psychiatric Association Presidential Global Programme on Child and Adolescent Mental Health, and the International Association for Child and Adolescent Mental Health and Allied Professions 47 pages.",
      "doi": ""
    },
    {
      "text": "John Parsons, Thomas J Kehle, and Steve V Owen. 1990. Incidence of behavior problems among children of Vietnam war veterans. School Psychology International 11, 4 (1990), 253–259.",
      "doi": ""
    },
    {
      "text": "Vikram Patel and Arthur Kleinman. 2003. Poverty and common mental disorders in developing countries. Bulletin of the World Health Organization 81 (2003), 609–615.",
      "doi": ""
    },
    {
      "text": "Skyler Place, Danielle Blanch-Hartigan, Channah Rubin, Cristina Gorrostieta, Caroline Mead, John Kane, Brian P Marx, Joshua Feast, Thilo Deckersbach, Andrew Nierenberg, 2017. Behavioral indicators on a mobile sensing platform predict clinically validated psychiatric symptoms of mood and anxiety disorders. Journal of Medical Internet Research 19, 3 (2017), e75.",
      "doi": ""
    },
    {
      "text": "Guilherme V Polanczyk, Giovanni A Salum, Luisa S Sugaya, Arthur Caye, and Luis A Rohde. 2015. Annual research review: A meta-analysis of the worldwide prevalence of mental disorders in children and adolescents. Journal of Child Psychology and Psychiatry 56, 3 (2015), 345–365.",
      "doi": ""
    },
    {
      "text": "Mary Jo. Pollman. 2010. Blocks and beyond : strengthening early math and science skills through spatial learning. Paul H. Brookes Pub. Co. 176 pages.",
      "doi": ""
    },
    {
      "text": "Reconstruction Agency. [n.d.]. Progress to Date. Retrieved January 12, 2021 from https://www.reconstruction.go.jp/english/topics/Progress_to_date/index.html",
      "doi": ""
    },
    {
      "text": "Linda A. Reddy, Tara M. Files-Hall, and Charles E. Schaefer. 2005. Empirically Based Play Interventions for Children. American Psychological Association, Washington. https://doi.org/10.1037/11086-000",
      "doi": ""
    },
    {
      "text": "Akane Sano, Sara Taylor, Andrew W McHill, Andrew JK Phillips, Laura K Barger, Elizabeth Klerman, and Rosalind Picard. 2018. Identifying objective physiological markers and modifiable behaviors for self-reported stress and mental health status using wearable sensors and mobile phones: observational study. Journal of Medical Internet Research 20, 6 (2018), e210.",
      "doi": ""
    },
    {
      "text": "Julie Sarama and Douglas H. Clements. 2009. Building blocks and cognitive building blocks: playing to know the world mathematically. In American Journal of Play, Vol. 1. 313–337. https://eric.ed.gov/?id=EJ1069014",
      "doi": ""
    },
    {
      "text": "Raul R Silva, Murray Alpert, Dinohra M Munoz, Sanjay Singh, Fred Matzner, and Steven Dummit. 2000. Stress and vulnerability to posttraumatic stress disorder in children and adolescents. American Journal of Psychiatry 157, 8 (2000), 1229–1235.",
      "doi": ""
    },
    {
      "text": "Emily Simonoff, Andrew Pickles, Tony Charman, Susie Chandler, Tom Loucas, and Gillian Baird. 2008. Psychiatric disorders in children with autism spectrum disorders: prevalence, comorbidity, and associated factors in a population-derived sample. Journal of the American Academy of Child and Adolescent Psychiatry 47, 8(2008), 921–929.",
      "doi": ""
    },
    {
      "text": "Beverly A. Snyder. 1997. Expressive art therapy techniques: healing the soul through creativity. The Journal of Humanistic Education and Development 36, 2, 74–82. https://doi.org/10.1002/j.2164-4683.1997.tb00375.x",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Eva Hornecker, and Geraldine Fitzpatrick. 2017. When empathy is not enough: Assessing the experiences of autistic children with technologies. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems. 2853–2864. https://doi.org/10.1145/3025453.3025785",
      "doi": "10.1145/3025453.3025785"
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Os Keyes, and Geraldine Fitzpatrick. 2019. Agency of autistic children in technology research—A critical literature review. ACM Transactions on Computer-Human Interaction 26, 6, Article 38 (Nov. 2019), 40 pages. https://doi.org/10.1145/3344919",
      "doi": "10.1145/3344919"
    },
    {
      "text": "Victor C Strasburger, Amy B Jordan, and Ed Donnerstein. 2010. Health effects of media on children and adolescents. Pediatrics 125, 4 (2010), 756–767.",
      "doi": ""
    },
    {
      "text": "Andrija Tomović, Predrag Janičić, and Vlado Kešelj. 2006. n-Gram-based classification and unsupervised hierarchical clustering of genome sequences. Computer Methods and Programs in Biomedicine 81, 2(2006), 137 – 153. https://doi.org/10.1016/j.cmpb.2005.11.007",
      "doi": ""
    },
    {
      "text": "John Torous, Mathew V Kiang, Jeanette Lorme, and Jukka-Pekka Onnela. 2016. New tools for new research in psychiatry: a scalable and customizable platform to empower data driven smartphone research. JMIR Mental Health 3, 2 (2016), e16.",
      "doi": ""
    },
    {
      "text": "FRANK C. VERHULST, HANS M. KOOT, and GUY F.M.G. BERDEN. 1990. Four-Year Follow-up of an Epidemiological Sample. Journal of the American Academy of Child and Adolescent Psychiatry 29, 3(1990), 440 – 448. https://doi.org/10.1097/00004583-199005000-00016",
      "doi": ""
    },
    {
      "text": "Daniel Vigo, Graham Thornicroft, and Rifat Atun. 2016. Estimating the true global burden of mental illness. The Lancet Psychiatry 3, 2 (2016), 171–178.",
      "doi": ""
    },
    {
      "text": "Emanuel Vonach, Marianne Ternek, Georg Gerstweiler, and Hannes Kaufmann. 2016. Design of a health monitoring toy for children. Proceedings of the International Conference on Interaction Design and Children, 58–67. https://doi.org/10.1145/2930674.2930694",
      "doi": "10.1145/2930674.2930694"
    },
    {
      "text": "Soroush Vosoughi, Matthew S Goodwin, Bill Washabaugh, and Deb Roy. 2012. A portable audio/video recorder for longitudinal study of child development. In Proceedings of ACM International Conference on Multimodal Interaction. 193–200.",
      "doi": "10.1145/2388676.2388715"
    },
    {
      "text": "Rafael Wampfler, Severin Klingler, Barbara Solenthaler, Victor R. Schinazi, and Markus Gross. 2020. Affective state prediction based on semi-supervised learning from smartphone touch data. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems. 1–13. https://doi.org/10.1145/3313831.3376504",
      "doi": ""
    },
    {
      "text": "Philip S Wang, Sergio Aguilar-Gaxiola, Jordi Alonso, Matthias C Angermeyer, Guilherme Borges, Evelyn J Bromet, Ronny Bruffaerts, Giovanni De Girolamo, Ron De Graaf, Oye Gureje, 2007. Use of mental health services for anxiety, mood, and substance disorders in 17 countries in the WHO world mental health surveys. The Lancet 370, 9590 (2007), 841–850.",
      "doi": ""
    },
    {
      "text": "Xiyue Wang, Kazuki Takashima, Tomoaki Adachi, Patrick Finn, Ehud Sharlin, and Yoshifumi Kitamura. 2020. AssessBlocks: Exploring Toy Block Play Features for Assessing Stress in Young Children after Natural Disasters. Proceedings of ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 1, Article 30 (March 2020), 29 pages. https://doi.org/10.1145/3381016",
      "doi": "10.1145/3381016"
    },
    {
      "text": "Karyn Wellhousen and Judith E Kieff. 2001. A constructivist approach to block play in early childhood. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "Tracy L. Westeyn, Gregory D. Abowd, Thad E. Starner, Jeremy M. Johnson, Peter W. Presti, and Kimberly A. Weaver. 2012. Monitoring children’s developmental progress using augmented toys and activity recognition. Personal and Ubiquitous Computing 16, 2, 169–191. https://doi.org/10.1007/s00779-011-0386-0",
      "doi": "10.1007/s00779-011-0386-0"
    },
    {
      "text": "Robert C Whitaker, Shannon M Phillips, and Sean M Orzol. 2006. Food insecurity and the risks of depression and anxiety in mothers and behavior problems in their preschool-aged children. Pediatrics 118, 3 (2006), e859–e868.",
      "doi": ""
    },
    {
      "text": "WHO. 2019. Autism spectrum disorders. https://www.who.int/en/news-room/fact-sheets/detail/autism-spectrum-disorders",
      "doi": ""
    }
  ]
}