{
  "doi": "10.1145/3411764.3445250",
  "title": "Auditing E-Commerce Platforms for Algorithmically Curated Vaccine Misinformation",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-27",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "There is a growing concern that e-commerce platforms are amplifying vaccine-misinformation. To investigate, we conduct two-sets of algorithmic audits for vaccine misinformation on the search and recommendation algorithms of Amazon—world’s leading e-retailer. First, we systematically audit search-results belonging to vaccine-related search-queries without logging into the platform—unpersonalized audits. We find 10.47% of search-results promote misinformative health products. We also observe ranking-bias, with Amazon ranking misinformative search-results higher than debunking search-results. Next, we analyze the effects of personalization due to account-history, where history is built progressively by performing various real-world user-actions, such as clicking a product. We find evidence of filter-bubble effect in Amazon’s recommendations; accounts performing actions on misinformative products are presented with more misinformation compared to accounts performing actions on neutral and debunking products. Interestingly, once user clicks on a misinformative product, homepage recommendations become more contaminated compared to when user shows an intention to buy that product.",
  "tags": [
    "e-commerce platforms",
    "search engines",
    "health misinformation",
    "algorithmic audits",
    "algorithmic bias",
    "search results",
    "personalization",
    "vaccine misinformation",
    "recommendations"
  ],
  "authors": [
    {
      "name": "Prerna Juneja",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659490327",
      "orcid": "0000-0003-1779-4276"
    },
    {
      "name": "Tanushree Mitra",
      "institution": "University of Washington, United States",
      "img": "/do/10.1145/contrib-81553902156/rel-imgonly/tanu_sm.jpg",
      "acmid": "81553902156",
      "orcid": "0000-0002-9507-6192"
    }
  ],
  "references": [
    {
      "text": "10under100. 2020. 20 Eye Opening Amazon Statistics & Facts For 2020. https://10under100.com/amazon-statistics-facts/",
      "doi": ""
    },
    {
      "text": "Loren Baker. 2018. Amazon’s Search Engine Ranking Algorithm: What Marketers Need to Know. https://www.searchenginejournal.com/amazon-search-engine-ranking-algorithm-explained/265173/",
      "doi": ""
    },
    {
      "text": "P Ball. 2020. Anti-vaccine movement could undermine efforts to end coronavirus pandemic, researchers warn.",
      "doi": ""
    },
    {
      "text": "Philip Ball and Amy Maxmen. 2020. The epic battle against coronavirus misinformation and conspiracy theories. Nature (London) 581, 7809 (2020), 371–374.",
      "doi": ""
    },
    {
      "text": "Julia Belluz. 2016. Amazon is a giant purveyor of medical quackery. https://www.vox.com/2016/9/6/12815250/amazon-health-products-bogus",
      "doi": ""
    },
    {
      "text": "Nicola Luigi Bragazzi, Ilaria Barberis, Roberto Rosselli, Vincenza Gianfredi, Daniele Nucci, Massimo Moretti, Tania Salvatori, Gianfranco Martucci, and Mariano Martini. 2017. How often people google for vaccination: Qualitative and quantitative insights from a systematic search of the web-based activities using Google Trends. Human Vaccines & Immunotherapeutics 13, 2 (2017), 464–469. https://doi.org/10.1080/21645515.2017.1264742 PMID: 27983896.",
      "doi": ""
    },
    {
      "text": "Christina Caron. 2019. Pinterest Restricts Vaccine Search Results to Curb Spread of Misinformation. https://www.nytimes.com/2019/02/23/health/pinterest-vaccination-searches.html",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2006. Most internet users start at a search engine when looking for health information online.https://www.pewresearch.org/internet/2006/10/29/most-internet-users-start-at-a-search-engine-when-looking-for-health-information-online/",
      "doi": ""
    },
    {
      "text": "Amazon Seller Central. accessed in 2020. Dietary Supplements. https://sellercentral.amazon.com/gp/help/external/G201829010?language=en_US",
      "doi": ""
    },
    {
      "text": "Le Chen, Ruijun Ma, Anikó Hannák, and Christo Wilson. 2018. Investigating the Impact of Gender on Rank in Resume Search Engines. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174225",
      "doi": "10.1145/3173574.3174225"
    },
    {
      "text": "Le Chen, Alan Mislove, and Christo Wilson. 2016. An Empirical Analysis of Algorithmic Pricing on Amazon Marketplace. In Proceedings of the 25th International Conference on World Wide Web (Montréal, Québec, Canada) (WWW ’16). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 1339–1349. https://doi.org/10.1145/2872427.2883089",
      "doi": ""
    },
    {
      "text": "Alessandro Cossard, Gianmarco De Francisci Morales, Kyriaki Kalimeri, Yelena Mejova, Daniela Paolotti, and Michele Starnini. 2020. Falling into the Echo Chamber: The Italian Vaccination Debate on Twitter. Proceedings of the International AAAI Conference on Web and Social Media 14, 1 (May 2020), 130–140. https://ojs.aaai.org/index.php/ICWSM/article/view/7285",
      "doi": ""
    },
    {
      "text": "Enyan Dai, Yiwei Sun, and Suhang Wang. 2020. Ginger Cannot Cure Cancer: Battling Fake Health News with a Comprehensive Data Repository. Proceedings of the International AAAI Conference on Web and Social Media 14, 1 (May 2020), 853–862. https://www.aaai.org/ojs/index.php/ICWSM/article/view/7350",
      "doi": ""
    },
    {
      "text": "Emily Dayton. 2020. Amazon Statistics You Should Know: Opportunities to Make the Most of America’s Top Online Marketplace. https://www.bigcommerce.com/blog/amazon-statistics/#10-fascinating-amazon-statistics-sellers-need-to-know-in-2020",
      "doi": ""
    },
    {
      "text": "Brian Dean. 2019. Here’s What We Learned About Organic Click Through Rate. https://backlinko.com/google-ctr-stats",
      "doi": ""
    },
    {
      "text": "Nicholas Diakopoulos, Daniel Trielli, Jennifer Stark, and Sean Mussenden. 2018. I vote for—how search informs our choice of candidate.",
      "doi": ""
    },
    {
      "text": "Renee Diresta. 2019. How Amazon’s Algorithms Curated a Dystopian Bookstore. https://www.wired.com/story/amazon-and-the-spread-of-health-misinformation/",
      "doi": ""
    },
    {
      "text": "Tom Dreisbach. 2020. On Amazon, Dubious ’Antiviral’ Supplements Proliferate Amid Pandemic. https://www.npr.org/2020/07/27/894825441/on-amazon-dubious-antiviral-supplements-proliferate-amid-pandemic",
      "doi": ""
    },
    {
      "text": "Benjamin Edelman and Michael Luca. 2014. Digital Discrimination: The Case of Airbnb.com. https://doi.org/10.2139/ssrn.2377353",
      "doi": ""
    },
    {
      "text": "Robert Epstein and Ronald E Robertson. 2015. The search engine manipulation effect (SEME) and its possible impact on the outcomes of elections. Proceedings of the National Academy of Sciences 112, 33(2015), E4512–E4521.",
      "doi": ""
    },
    {
      "text": "Semih Erden, Kevser Nalbant, and Hurşit Ferahkaya. 2019. Autism and Vaccinations: Does Google side with Science?Journal of Contemporary Medicine 9, 3 (2019), 295–299.",
      "doi": ""
    },
    {
      "text": "The Financial. 2020. Amazon removed 1 million fake coronavirus cures and overpriced products. https://www.finchannel.com/world/77738-amazon-removed-1-million-fake-and-overpriced-coronavirus-products",
      "doi": ""
    },
    {
      "text": "Susannah Fox. 2006. Online Health Search 2006. https://www.pewresearch.org/internet/2006/10/29/online-health-search-2006/",
      "doi": ""
    },
    {
      "text": "Amira Ghenai and Yelena Mejova. 2017. Catching Zika Fever: Application of Crowdsourcing and Machine Learning for Tracking Health Misinformation on Twitter. arxiv:1707.03778",
      "doi": ""
    },
    {
      "text": "Amira Ghenai and Yelena Mejova. 2018. Fake cures: user-centric modeling of health misinformation in social media. Proceedings of the ACM on human-computer interaction 2, CSCW(2018), 1–20.",
      "doi": "10.1145/3274327"
    },
    {
      "text": "Pietro Ghezzi, Peter Bannister, Gonzalo Casino, Alessia Catalani, Michel Goldman, Jessica Morley, Marie Neunez, Andreu Prados-Bo, Pierre Smeesters, Mariarosaria Taddeo, Tania Vanzolini, and Luciano Floridi. 2020. Online Information of Vaccines: Information Quality, Not Only Privacy, Is an Ethical Responsibility of Search Engines. Frontiers in Medicine 7 (08 2020). https://doi.org/10.3389/fmed.2020.00400",
      "doi": ""
    },
    {
      "text": "April Glaser. 2017. Amazon Is Suggesting “Frequently Bought Together” Items That Can Make a Bomb. https://slate.com/technology/2017/09/amazons-algorithm-is-suggesting-items-frequently-bought-together-that-can-make-a-bomb.html",
      "doi": ""
    },
    {
      "text": "Olivia Goldhill. 2020. Amazon is selling coronavirus misinformation. https://qz.com/1816973/amazon-is-selling-coronavirus-misinformation/",
      "doi": ""
    },
    {
      "text": "Google. 2019. Google’s Search Quality Rating Guidelines. https://static.googleusercontent.com/media/guidelines.raterhub.com/en//searchqualityevaluatorguidelines.pdf",
      "doi": ""
    },
    {
      "text": "Google. 2020. Google Search Help. https://support.google.com/websearch/answer/9281931?hl=en",
      "doi": ""
    },
    {
      "text": "Zhiwei Guan and Edward Cutrell. 2007. An Eye Tracking Study of the Effect of Target Rank on Web Search. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 417–420. https://doi.org/10.1145/1240624.1240691",
      "doi": "10.1145/1240624.1240691"
    },
    {
      "text": "Aniko Hannak, Piotr Sapiezynski, Arash Molavi Kakhki, Balachander Krishnamurthy, David Lazer, Alan Mislove, and Christo Wilson. 2013. Measuring Personalization of Web Search. In Proceedings of the 22nd International Conference on World Wide Web (Rio de Janeiro, Brazil) (WWW ’13). Association for Computing Machinery, New York, NY, USA, 527–538. https://doi.org/10.1145/2488388.2488435",
      "doi": "10.1145/2488388.2488435"
    },
    {
      "text": "Aniko Hannak, Gary Soeller, David Lazer, Alan Mislove, and Christo Wilson. 2014. Measuring Price Discrimination and Steering on E-Commerce Web Sites. In Proceedings of the 2014 Conference on Internet Measurement Conference (Vancouver, BC, Canada) (IMC ’14). Association for Computing Machinery, New York, NY, USA, 305–318. https://doi.org/10.1145/2663716.2663744",
      "doi": "10.1145/2663716.2663744"
    },
    {
      "text": "M. Herr. 2017. Writing and Publishing Your Book: A Guide for Experts in Every Field. Greenwood, USA. https://books.google.com/books?id=r2fuswEACAAJ",
      "doi": ""
    },
    {
      "text": "Desheng Hu, Shan Jiang, Ronald E. Robertson, and Christo Wilson. 2019. Auditing the Partisanship of Google Search Snippets. In The World Wide Web Conference (San Francisco, CA, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 693–704. https://doi.org/10.1145/3308558.3313654",
      "doi": "10.1145/3308558.3313654"
    },
    {
      "text": "Eslam Hussein, Prerna Juneja, and Tanushree Mitra. 2020. Measuring Misinformation in Video Search Platforms: An Audit Study on YouTube. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–27.",
      "doi": "10.1145/3392854"
    },
    {
      "text": "Andrew Hutchinsona. 2019. Pinterest Will Limit Search Results for Vaccine-Related Queries to Content from Official Health Outlets. https://www.socialmediatoday.com/news/pinterest-will-limit-search-results-for-vaccine-related-queries-to-content/561885/",
      "doi": ""
    },
    {
      "text": "Anna Kata. 2010. A postmodern Pandora’s box: anti-vaccination misinformation on the Internet. Vaccine 28, 7 (2010), 1709–1716.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Cynthia Matuszek, and Sean A. Munson. 2015. Unequal Representation and Gender Stereotypes in Image Search Results for Occupations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3819–3828. https://doi.org/10.1145/2702123.2702520",
      "doi": "10.1145/2702123.2702520"
    },
    {
      "text": "Sangyeon Kim, Omer F. Yalcin, Samuel E. Bestvater, Kevin Munger, Burt L. Monroe, and Bruce A. Desmarais. 2020. The Effects of an Informational Intervention on Attention to Anti-Vaccination Content on YouTube. Proceedings of the International AAAI Conference on Web and Social Media 14, 1 (May 2020), 949–953. https://ojs.aaai.org/index.php/ICWSM/article/view/7364",
      "doi": ""
    },
    {
      "text": "Silvia Knobloch-Westerwick, Benjamin K Johnson, Nathaniel A Silver, and Axel Westerwick. 2015. Science exemplars in the eye of the beholder: How exposure to online science information affects attitudes. Science Communication 37, 5 (2015), 575–601.",
      "doi": ""
    },
    {
      "text": "Juhi Kulshrestha, Motahhare Eslami, Johnnatan Messias, Muhammad Bilal Zafar, Saptarshi Ghosh, Krishna P. Gummadi, and Karrie Karahalios. 2017. Quantifying Search Bias: Investigating Sources of Bias for Political Searches in Social Media. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 417–432. https://doi.org/10.1145/2998181.2998321",
      "doi": "10.1145/2998181.2998321"
    },
    {
      "text": "Louise Matsakis. 2019. Facebook Will Crack Down on Anti-Vaccine Content. https://www.wired.com/story/facebook-anti-vaccine-crack-down/",
      "doi": ""
    },
    {
      "text": "Matt McGee. 2013. In Quality Raters’ Handbook, Google Adds Higher Standards For “Your Money Or Your Life” Websites. https://searchengineland.com/quality-raters-handbook-your-money-or-your-life-177663",
      "doi": ""
    },
    {
      "text": "Tanushree Mitra, Scott Counts, and James W. Pennebaker. 2016. Understanding Anti-Vaccination Attitudes in Social Media. In Proceedings of the Tenth International Conference on Web and Social Media, Cologne, Germany, May 17-20, 2016. AAAI Press, Cologne, Germany, 269–278. http://www.aaai.org/ocs/index.php/ICWSM/ICWSM16/paper/view/13073",
      "doi": ""
    },
    {
      "text": "Tanushree Mitra, C.J. Hutto, and Eric Gilbert. 2015. Comparing Person- and Process-Centric Strategies for Obtaining Quality Data on Amazon Mechanical Turk. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1345–1354. https://doi.org/10.1145/2702123.2702553",
      "doi": "10.1145/2702123.2702553"
    },
    {
      "text": "Bjarke Mønsted and Sune Lehmann. 2019. Algorithmic Detection and Analysis of Vaccine-Denialist Sentiment Clusters in Social Networks. arxiv:1905.12908http://arxiv.org/abs/1905.12908",
      "doi": ""
    },
    {
      "text": "Eni Mustafaraj, Emma Lurie, and Claire Devine. 2020. The Case for Voter-Centered Audits of Search Engines during Political Elections. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency(Barcelona, Spain) (FAT* ’20). Association for Computing Machinery, New York, NY, USA, 559–569. https://doi.org/10.1145/3351095.3372835",
      "doi": "10.1145/3351095.3372835"
    },
    {
      "text": "Laura Hazard Owen. 2020. One group that’s really benefited from Covid-19: Anti-vaxxers. https://www.niemanlab.org/2020/07/one-group-thats-really-benefitted-from-covid-19-anti-vaxxers/",
      "doi": ""
    },
    {
      "text": "Andrew Perrin. 2016. Book Reading 2016. https://www.pewresearch.org/internet/2016/09/01/book-reading-2016/",
      "doi": ""
    },
    {
      "text": "Peter Pirolli. 2005. Rational Analyses of Information Foraging on the Web. Cognitive Science 29, 3 (2005), 343–373. https://doi.org/10.1207/s15516709cog0000_20 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1207/s15516709cog0000_20",
      "doi": ""
    },
    {
      "text": "Cornelius Puschmann. 2019. Beyond the Bubble: Assessing the Diversity of Political Search Results. Digital Journalism 7, 6 (2019), 824–843. https://doi.org/10.1080/21670811.2018.1539626 arXiv:https://doi.org/10.1080/21670811.2018.1539626",
      "doi": ""
    },
    {
      "text": "Lee Rainie and Susannah Fox. 2000. The Online Health Care Revolution. https://www.pewresearch.org/internet/2000/11/26/the-online-health-care-revolution/",
      "doi": ""
    },
    {
      "text": "Inioluwa Deborah Raji and Joy Buolamwini. 2019. Actionable Auditing: Investigating the Impact of Publicly Naming Biased Performance Results of Commercial AI Products. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (Honolulu, HI, USA) (AIES ’19). Association for Computing Machinery, New York, NY, USA, 429–435. https://doi.org/10.1145/3306618.3314244",
      "doi": "10.1145/3306618.3314244"
    },
    {
      "text": "Matt Reynolds. 2019. Amazon sells ’autism cure’ books that suggest children drink toxic, bleach-like substances. https://www.wired.co.uk/article/amazon-autism-fake-cure-books",
      "doi": ""
    },
    {
      "text": "Ronald E Robertson, Shan Jiang, Kenneth Joseph, Lisa Friedland, David Lazer, and Christo Wilson. 2018. Auditing partisan audience bias within google search. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–22.",
      "doi": "10.1145/3274417"
    },
    {
      "text": "Shannon Roddy. 2019. Recent Updates to Amazon Verified Purchase Reviews. https://www.marketplacesellercourses.com/recent-updates-to-amazon-verified-purchase-reviews/",
      "doi": ""
    },
    {
      "text": "Gary Schwitzer. 2017. Pollution of health news.",
      "doi": ""
    },
    {
      "text": "Jieun Shin and Thomas Valente. 2020. Algorithms and Health Misinformation: A Case Study of Vaccine Books on Amazon. Journal of Health Communication 25, 5 (2020), 394–401. https://doi.org/10.1080/10810730.2020.1776423 PMID: 32536257.",
      "doi": ""
    },
    {
      "text": "Carrie Spector. 2017. Stanford scholars observe ’experts’ to see how they evaluate the credibility of information online. https://news.stanford.edu/press-releases/2017/10/24/fact-checkers-ouline-information/",
      "doi": ""
    },
    {
      "text": "Miriam Steiner, Melanie Magin, Birgit Stark, and Stefan Geiß. 2020. Seek and you shall find? A content analysis on the diversity of five search engines’ results on political queries. Information, Communication & Society 0, 0 (2020), 1–25. https://doi.org/10.1080/1369118X.2020.1776367 arXiv:https://doi.org/10.1080/1369118X.2020.1776367",
      "doi": ""
    },
    {
      "text": "Daniel Trielli and Nicholas Diakopoulos. 2019. Search as News Curator: The Role of Google in Shaping Attention to News Information. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300683",
      "doi": "10.1145/3290605.3300683"
    },
    {
      "text": "Toni GLA van der Meer and Yan Jin. 2020. Seeking formula for misinformation treatment in public health crises: The effects of corrective information type and source. Health Communication 35, 5 (2020), 560–575.",
      "doi": ""
    }
  ]
}