{
  "doi": "10.1145/3411764.3445151",
  "title": "TiltChair: Manipulative Posture Guidance by Actively Inclining the Seat of an Office Chair",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "We propose TiltChair, an actuated office chair that physically manipulates the user’s posture by actively inclining the chair’s seat to address problems associated with prolonged sitting. The system controls the inclination angle and motion speed with the aim of achieving manipulative but unobtrusive posture guidance. To demonstrate its potential, we first built a prototype of TiltChair with a seat that could be tilted by pneumatic control. We then investigated the effects of the seat’s inclination angle and motions on task performance and overall sitting experience through two experiments. The results show that the inclination angle mainly affects the difficulty of maintaining one’s posture, while the motion speed affected the conspicuousness and subjective acceptability of the motion. However, these seating conditions did not affect objective task performance. Based on these results, we propose a design space for facilitating effective seat-inclination behavior using the three dimensions of angle, speed, and continuity. Furthermore, we discuss promising applications.",
  "authors": [
    {
      "name": "Kazuyuki Fujita",
      "institution": "Tohoku University, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81442608795",
      "orcid": "0000-0002-1039-0167"
    },
    {
      "name": "Aoi Suzuki",
      "institution": "Tohoku University, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702072",
      "orcid": "missing"
    },
    {
      "name": "Kazuki Takashima",
      "institution": "Tohoku University, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351601788",
      "orcid": "0000-0002-1020-5750"
    },
    {
      "name": "Kaori Ikematsu",
      "institution": "Yahoo Japan Corporation and Tohoku University, Japan",
      "img": "/do/10.1145/contrib-81557296256/rel-imgonly/ikematsu.png",
      "acmid": "81557296256",
      "orcid": "missing"
    },
    {
      "name": "Yoshifumi Kitamura",
      "institution": "Tohoku University, Japan",
      "img": "/do/10.1145/contrib-81100273942/rel-imgonly/yk-180x120.jpg",
      "acmid": "81100273942",
      "orcid": "0000-0002-7047-627X"
    }
  ],
  "references": [
    {
      "text": "Brian P Bailey, Joseph A Konstan, and John V Carlis. 2000. Adjusting Windows: Balancing Information Awareness with Intrusion. In Proceedings of Conference on Human Factors and the Web. 39–83.",
      "doi": ""
    },
    {
      "text": "Gilles Bailly, Sidharth Sahdev, Sylvain Malacria, and Thomas Pietrzak. 2016. LivingDesktop: Augmenting Desktop Workstation with Actuated Devices. In Proceedings of Conference on Human Factors in Computing Systems. 5298–5310. https://doi.org/10.1145/2858036.2858208",
      "doi": "10.1145/2858036.2858208"
    },
    {
      "text": "Yuki Ban, Sho Sakurai, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2015. Improving Work Productivity by Controlling the Time Rate Displayed by the Virtual Clock. In Proceedings of Augmented Human International Conference. 25–32. https://doi.org/10.1145/2735711.2735791",
      "doi": "10.1145/2735711.2735791"
    },
    {
      "text": "Erik A Beers, James N Roemmich, Leonard H Epstein, and Peter J Horvath. 2008. Increasing Passive Energy expenditure during clerical work. European Journal of Applied Physiology 103, 3 (2008), 353–360.",
      "doi": ""
    },
    {
      "text": "Fabiana Braga Benatti and Mathias Ried-Larsen. 2015. The Effects of Breaking up Prolonged Sitting Time: A Review of Experimental Studies. Medicine & Science in Sports & Exercise 47, 10 (2015), 2053–2061.",
      "doi": ""
    },
    {
      "text": "Tom Bendix. 1984. Seated trunk posture at various seat inclinations, seat heights, and table heights. Human factors 26, 6 (1984), 695–703.",
      "doi": ""
    },
    {
      "text": "Tom Bendix, Flemming Bo Jessen, and JØrgen Winkel. 1986. An Evaluation of a Tiltable Office Chair with Respect to Seat Height, Backrest Position and Task. European Journal of Applied Physiology and Occupational Physiology 55, 1(1986), 30–36.",
      "doi": ""
    },
    {
      "text": "Tom Bendix, JØrgen Winkel, and Flemming Jessen. 1985. Comparison of Office Chairs with Fixed Forwards or Backwards Inclining, or Tiltable Seats. European Journal of Applied Physiology and Occupational Physiology 54, 4(1985), 378–385.",
      "doi": ""
    },
    {
      "text": "Aviroop Biswas, Paul I Oh, Guy E Faulkner, Ravi R Bajaj, Michael A Silver, Marc S Mitchell, and David A Alter. 2015. Sedentary Time and Its Association with Risk for Disease Incidence, Mortality, and Hospitalization in Adults: A Systematic Review and Meta-analysis. Annals of Internal Medicine 162, 2 (2015), 123–132. https://doi.org/10.7326/M14-1651",
      "doi": ""
    },
    {
      "text": "Allen C Bluedorn, Daniel B Turban, and Mary Sue Love. 1999. The Effects of Stand-up and Sit-down Meeting Formats on Meeting Outcomes.Journal of Applied Psychology 84, 2 (1999), 277.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal, Andrew Wang, and Rosalind Picard. 2007. Experiments with a Robotic Computer: Body, Affect and Cognition Interactions. In Proceedings of ACM/IEEE International Conference on Human-Robot Interaction. 153–160. https://doi.org/10.1145/1228716.1228737",
      "doi": "10.1145/1228716.1228737"
    },
    {
      "text": "Lucas J Carr, Hotaka Maeda, Brandon Luther, Patrick Rider, Sharon J Tucker, and Christoph Leonhard. 2014. Acceptability and effects of a seated active workstation during sedentary work. International Journal of Workplace Health Management (2014).",
      "doi": ""
    },
    {
      "text": "I. Daian, A. M. van Ruiten, A. Visser, and S. Zubic. 2007. Sensitive Chair: A Force Sensing Chair with Multimodal Real-Time Feedback via Agent. In Proceedings of European Conference on Cognitive Ergonomics: Invent! Explore!163–166. https://doi.org/10.1145/1362550.1362583",
      "doi": ""
    },
    {
      "text": "Nico J Delleman, Christine M Haslegrave, and Don B Chaffin. 2004. Working postures and movements. CRC Press.",
      "doi": ""
    },
    {
      "text": "Keith M Diaz, Virginia J Howard, Brent Hutto, Natalie Colabianchi, John E Vena, Monika M Safford, Steven N Blair, and Steven P Hooker. 2017. Patterns of Sedentary Behavior and Mortality in US Middle-aged and Older Adults: A National Cohort Study. Annals of Internal Medicine 167, 7 (2017), 465–475.",
      "doi": ""
    },
    {
      "text": "Soya Eguchi, Yukako Yazaki, Riku Kato, Yusaku Arita, Takumi Moriya, and Hiroya Tanaka. 2020. Proto-Chair: Posture-Sensing Smart Furniture with 3D-Printed Auxetics. In Extended Abstracts of CHI Conference on Human Factors in Computing Systems. 1–7. https://doi.org/10.1145/3334480.3383036",
      "doi": "10.1145/3334480.3383036"
    },
    {
      "text": "Etienne Grandjean, W Hünting, and M Pidermann. 1983. VDT Workstation Design: Preferred Settings and Their Effects. Human factors 25, 2 (1983), 161–175.",
      "doi": ""
    },
    {
      "text": "Diane E Gregory, Nadine M Dunk, and Jack P Callaghan. 2006. Stability Ball versus Office Chair: Comparison of Muscle Activation and Lumbar Spine Posture during Prolonged Sitting. Human Factors 48, 1 (2006), 142–153.",
      "doi": ""
    },
    {
      "text": "Jens Emil Grønbæk, Henrik Korsgaard, Marianne Graves Petersen, Morten Henriksen Birk, and Peter Gall Krogh. 2017. Proxemic Transitions: Designing Shape-Changing Furniture for Informal Meetings. In Proceedings of Conference on Human Factors in Computing Systems. 7029–7041. https://doi.org/10.1145/3025453.3025487",
      "doi": ""
    },
    {
      "text": "Jens Emil Grønbæk, Majken Kirkegaard Rasmussen, Kim Halskov, and Marianne Graves Petersen. 2020. KirigamiTable: Designing for Proxemic Transitions with a Shape-Changing Tabletop. In Proceedings of Conference on Human Factors in Computing Systems. 1–15. https://doi.org/10.1145/3313831.3376834",
      "doi": ""
    },
    {
      "text": "Peter Gust, Sebastian P Kampa, Nico Feller, Max Vom Stein, Ines Haase, and Valerio Virzi. 2018. Intelligent Seating System with Haptic Feedback for Active Health Support. In Proceedings of the Future Technologies Conference. 856–873.",
      "doi": ""
    },
    {
      "text": "Edward O Haeggstrom, Pia M Forsman, Anders E Wallin, Esko M Toppila, and Ilmari V Pyykko. 2006. Evaluating Sleepiness using Force Platform Posturography. IEEE Transactions on Biomedical Engineering 53, 8 (2006), 1578–1585.",
      "doi": ""
    },
    {
      "text": "Thomas R Hales and Bruce P Bernard. 1996. Epidemiology of Work-related Musculoskeletal Disorders.The Orthopedic Clinics of North America 27, 4 (1996), 679–709.",
      "doi": ""
    },
    {
      "text": "Michael Haller, Christoph Richter, Peter Brandl, Sabine Gross, Gerold Schossleitner, Andreas Schrempf, Hideaki Nii, Maki Sugimoto, and Masahiko Inami. 2011. Finding the Right Way for Interrupting People Improving Their Sitting Posture. In Proceedings of IFIP TC 13 International Conference on Human-Computer Interaction - Volume Part II. 1–17.",
      "doi": ""
    },
    {
      "text": "Marc T Hamilton, Deborah G Hamilton, and Theodore W Zderic. 2007. Role of Low Energy Expenditure and Sitting in Obesity, Metabolic Syndrome, Type 2 Diabetes, and Cardiovascular Disease. Diabetes 56, 11 (2007), 2655–2667.",
      "doi": ""
    },
    {
      "text": "Chris Harrison and Anind K. Dey. 2008. Lean and Zoom: Proximity-Aware User Interface and Content Magnification. In Proceedings of Conference on Human Factors in Computing Systems. 507–510. https://doi.org/10.1145/1357054.1357135",
      "doi": "10.1145/1357054.1357135"
    },
    {
      "text": "Haruna Ishimatsu and Ryoko Ueoka. 2014. BITAIKA: Development of Self Posture Adjustment System. In Proceedings of Augmented Human International Conference. Article 30, 2 pages. https://doi.org/10.1145/2582051.2582081",
      "doi": "10.1145/2582051.2582081"
    },
    {
      "text": "Nassim Jafarinaimi, Jodi Forlizzi, Amy Hurst, and John Zimmerman. 2005. Breakaway: An Ambient Display Designed to Change Human Behavior. In Extended Abstracts on Human Factors in Computing Systems. 1945–1948. https://doi.org/10.1145/1056808.1057063",
      "doi": ""
    },
    {
      "text": "Kiyoshi Kiyokawa, Masahide Hatanaka, Kazufumi Hosoda, Masashi Okada, Hironori Shigeta, Yasunori Ishihara, Fukuhito Ooshita, Hirotsugu Kakugawa, Satoshi Kurihara, and Koichi Moriyama. 2012. Owens Luis—A Context-aware Multi-modal Smart Office Chair in an Ambient Environment. In Proceedings of IEEE Virtual Reality Workshops. 1–4.",
      "doi": "10.1109/VR.2012.6180951"
    },
    {
      "text": "KHE Kroemer. 1994. Sitting (or Standing?) at the Computer. Hard Facts About Soft Machines: The Ergonomics Of Seating (1994), 181.",
      "doi": ""
    },
    {
      "text": "Yoshiki Kudo, Kazuki Takashima, Morten Fjeld, and Yoshifumi Kitamura. 2018. AdapTable: Extending Reach over Large Tabletops through Flexible Multi-Display Configuration. In Proceedings of ACM International Conference on Interactive Surfaces and Spaces. 213–225. https://doi.org/10.1145/3279778.3279779",
      "doi": "10.1145/3279778.3279779"
    },
    {
      "text": "Bokyung Lee, Joongi Shin, Hyoshin Bae, and Daniel Saakes. 2018. Interactive and Situated Guidelines to Help Users Design a Personal Desk That Fits Their Bodies. In Proceedings of Designing Interactive Systems Conference. 637–650. https://doi.org/10.1145/3196709.3196725",
      "doi": "10.1145/3196709.3196725"
    },
    {
      "text": "Bokyung Lee, Sindy Wu, Maria Jose Reyes, and Daniel Saakes. 2019. The Effects of Interruption Timings on Autonomous Height-Adjustable Desks That Respond to Task Changes. In Proceedings of Conference on Human Factors in Computing Systems. 1–10. https://doi.org/10.1145/3290605.3300558",
      "doi": "10.1145/3290605.3300558"
    },
    {
      "text": "James A Levine and Jennifer M Miller. 2007. The Energy Expenditure of using a “Walk-and-work” Desk for Office Workers with Obesity. British Journal of Sports Medicine 41, 9 (2007), 558–561.",
      "doi": ""
    },
    {
      "text": "David Lindlbauer, Jörg Mueller, and Marc Alexa. 2017. Changing the Appearance of Real-World Objects By Modifying Their Surroundings. In Proceedings of Conference on Human Factors in Computing Systems. 3954–3965. https://doi.org/10.1145/3025453.3025795",
      "doi": "10.1145/3025453.3025795"
    },
    {
      "text": "ÅGE C MANDAL. 1976. Work-chair with Tilting Seat. Ergonomics 19, 2 (1976), 157–164.",
      "doi": ""
    },
    {
      "text": "Corinne Mattmann, Oliver Amft, Holger Harms, Gerhard Troster, and Frank Clemens. 2007. Recognizing Upper Body Postures using Textile Strain Sensors. In Proceedings of IEEE international symposium on wearable computers. 29–36.",
      "doi": "10.1109/ISWC.2007.4373773"
    },
    {
      "text": "David A McAlpine, Chinmay U Manohar, Shelly K McCrady, Donald Hensrud, and James A Levine. 2007. An Office-place Stepping Device to Promote Workplace Physical Activity. British Journal of Sports Medicine 41, 12 (2007), 903–907.",
      "doi": ""
    },
    {
      "text": "SM McGill, NS Kavcic, and E Harvey. 2006. Sitting on a Chair or an Exercise Ball: Various Perspectives to Guide Decision Making. Clinical Biomechanics 21, 4 (2006), 353–360.",
      "doi": ""
    },
    {
      "text": "Don A Moore and Elizabeth R Tenney. 2012. Time pressure, performance, and productivity. Research on managing groups and teams 15 (2012), 305–326.",
      "doi": ""
    },
    {
      "text": "Bilge Mutlu, Andreas Krause, Jodi Forlizzi, Carlos Guestrin, and Jessica Hodgins. 2007. Robust, Low-Cost, Non-Intrusive Sensing and Recognition of Seated Postures. In Proceedings of Annual ACM Symposium on User Interface Software and Technology. 149–158. https://doi.org/10.1145/1294211.1294237",
      "doi": "10.1145/1294211.1294237"
    },
    {
      "text": "Minoru Nakayama, Keiko Yamamoto, and Fumio Kobayashi. 2008. Estimation of Sleepiness using Frequency Components of Pupillary Response. In Proceedings of IEEE Biomedical Circuits and Systems Conference. 357–360.",
      "doi": ""
    },
    {
      "text": "Kieran O’Sullivan, Mary O’Keeffe, Leonard O’Sullivan, Peter O’Sullivan, and Wim Dankaerts. 2012. The Effect of Dynamic Sitting on the Prevention and Management of Low Back Pain and Low Back Discomfort: A Systematic Review. Ergonomics 55, 8 (2012), 898–908.",
      "doi": ""
    },
    {
      "text": "Meredith C Peddie, Julia L Bone, Nancy J Rehrer, C Murray Skeaff, Andrew R Gray, and Tracy L Perry. 2013. Breaking Prolonged Sitting Reduces Postprandial Glycemia in Healthy, Normal-weight Adults: A Randomized Crossover Trial. The American Journal of Clinical Nutrition 98, 2 (2013), 358–366.",
      "doi": ""
    },
    {
      "text": "Florian Perteneder, Kathrin Probst, Joanne Leong, Sebastian Gassler, Christian Rendl, Patrick Parzer, Katharina Fluch, Sophie Gahleitner, Sean Follmer, Hideki Koike, and Michael Haller. 2020. Foxels: Build Your Own Smart Furniture. In Proceedings of International Conference on Tangible, Embedded, and Embodied Interaction. 111–122. https://doi.org/10.1145/3374920.3374935",
      "doi": "10.1145/3374920.3374935"
    },
    {
      "text": "Kathrin Probst, Michael Haller, Kentaro Yasu, Maki Sugimoto, and Masahiko Inami. 2014. Move-It Sticky Notes Providing Active Physical Feedback through Motion. In Proceedings of International Conference on Tangible, Embedded and Embodied Interaction. 29–36. https://doi.org/10.1145/2540930.2540932",
      "doi": ""
    },
    {
      "text": "Harpreet Sareen, Udayan Umapathi, Patrick Shin, Yasuaki Kakehi, Jifei Ou, Hiroshi Ishii, and Pattie Maes. 2017. Printflatables: Printing Human-Scale, Functional and Dynamic Inflatable Objects. In Proceedings of Conference on Human Factors in Computing Systems. 3669–3680. https://doi.org/10.1145/3025453.3025898",
      "doi": "10.1145/3025453.3025898"
    },
    {
      "text": "Florian Schaule, Jan Ole Johanssen, Bernd Bruegge, and Vivian Loftness. 2018. Employing Consumer Wearables to Detect Office Workers’ Cognitive Load for Interruption Management. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 1, Article 32 (March 2018), 20 pages. https://doi.org/10.1145/3191764",
      "doi": "10.1145/3191764"
    },
    {
      "text": "Joon Gi Shin, Doheon Kim, Chaehan So, and Daniel Saakes. 2020. Body Follows Eye: Unobtrusive Posture Manipulation Through a Dynamic Content Position in Virtual Reality. In Proceedings of Conference on Human Factors in Computing Systems. 1–14. https://doi.org/10.1145/3313831.3376794",
      "doi": "10.1145/3313831.3376794"
    },
    {
      "text": "Joon-Gi Shin, Eiji Onchi, Maria Jose Reyes, Junbong Song, Uichin Lee, Seung-Hee Lee, and Daniel Saakes. 2019. Slow Robots for Unobtrusive Posture Correction. In Proceedings of Conference on Human Factors in Computing Systems. 1–10. https://doi.org/10.1145/3290605.3300843",
      "doi": "10.1145/3290605.3300843"
    },
    {
      "text": "Nipun Shrestha, Katriina T Kukkonen-Harjula, Jos H Verbeek, Sharea Ijaz, Veerle Hermans, and Zeljko Pedisic. 2018. Workplace Interventions for Reducing Sitting at Work. Cochrane Database of Systematic Reviews6, Article CD010912(2018).",
      "doi": ""
    },
    {
      "text": "David Sirkin, Brian Mok, Stephen Yang, and Wendy Ju. 2015. Mechanical Ottoman: How Robotic Furniture Offers and Withdraws Support. In Proceedings of Annual ACM/IEEE International Conference on Human-Robot Interaction. 11–18. https://doi.org/10.1145/2696454.2696461",
      "doi": "10.1145/2696454.2696461"
    },
    {
      "text": "Leon Straker, James Levine, and Amity Campbell. 2009. The Effects of Walking and Cycling Computer Workstations on Keyboard and Mouse Performance. Human Factors 51, 6 (2009), 831–844.",
      "doi": ""
    },
    {
      "text": "Ryo Suzuki, Ryosuke Nakayama, Dan Liu, Yasuaki Kakehi, Mark D. Gross, and Daniel Leithinger. 2020. LiftTiles: Constructive Building Blocks for Prototyping Room-Scale Shape-Changing Interfaces. In Proceedings of International Conference on Tangible, Embedded, and Embodied Interaction. 143–151. https://doi.org/10.1145/3374920.3374941",
      "doi": "10.1145/3374920.3374941"
    },
    {
      "text": "Kazuki Takashima, Naohiro Aida, Hitomi Yokoyama, and Yoshifumi Kitamura. 2013. TransformTable: A Self-Actuated Shape-Changing Digital Table. In Proceedings of ACM International Conference on Interactive Tabletops and Surfaces. 179–188. https://doi.org/10.1145/2512349.2512818",
      "doi": "10.1145/2512349.2512818"
    },
    {
      "text": "Kazuki Takashima, Yusuke Asari, Hitomi Yokoyama, Ehud Sharlin, and Yoshifumi Kitamura. 2015. MovemenTable: The Design of Moving Interactive Tabletops. In Proceedings of IFIP Conference on Human-Computer Interaction. 296–314.",
      "doi": "10.1007/978-3-319-22698-9_19"
    },
    {
      "text": "Takahiro Tanaka, Ryosuke Abe, Kazuaki Aoki, and Kinya Fujita. 2015. Interruptibility Estimation Based on Head Motion and PC Operation. International Journal of Human–Computer Interaction 31, 3(2015), 167–179. https://doi.org/10.1080/10447318.2014.986635",
      "doi": ""
    },
    {
      "text": "Shan-Yuan Teng, Cheng-Lung Lin, Chi-huan Chiang, Tzu-Sheng Kuo, Liwei Chan, Da-Yuan Huang, and Bing-Yu Chen. 2019. TilePoP: Tile-Type Pop-up Prop for Virtual Reality. In Proceedings of Annual ACM Symposium on User Interface Software and Technology. 639–649. https://doi.org/10.1145/3332165.3347958",
      "doi": "10.1145/3332165.3347958"
    },
    {
      "text": "C Tudor-Locke, JM Schuna, LJ Frensham, and M Proenca. 2014. Changing the Way We Work: Elevating Energy Expenditure with Workstation Alternatives. International Journal of Obesity 38, 6 (2014), 755–765.",
      "doi": ""
    },
    {
      "text": "Leo L Van Deursen, Jaap Patijn, John R Durinck, Ruud Brouwer, Jeanne R van Erven-Sommers, and Bernard J Vortman. 1999. Sitting and Low Back Pain: The Positive Effect of Rotatory Dynamic Stimuli during Prolonged Sitting. European Spine Journal 8, 3 (1999), 187–193.",
      "doi": ""
    },
    {
      "text": "JHL Van Dieën, MP De Looze, and V Hermans. 2001. Effects of Dynamic Office Chairs on Trunk Kinematics, Trunk Extensor EMG and Spinal Shrinkage. Ergonomics 44, 7 (2001), 739–750.",
      "doi": ""
    },
    {
      "text": "Luke Vink, Viirj Kan, Ken Nakagaki, Daniel Leithinger, Sean Follmer, Philipp Schoessler, Amit Zoran, and Hiroshi Ishii. 2015. TRANSFORM as Adaptive and Dynamic Furniture. In Extended Abstracts on Human Factors in Computing Systems. 183. https://doi.org/10.1145/2702613.2732494",
      "doi": ""
    },
    {
      "text": "Peter Vink, Ineke Konijn, Ben Jongejan, and Monique Berger. 2009. Varying the Office Work Posture between Standing, Half-Standing and Sitting Results in Less Discomfort. In Proceedings of International Conference on Ergonomics and Health Aspects of Work with Computers: Held as Part of HCI International. 115–120. https://doi.org/10.1007/978-3-642-02731-4_14",
      "doi": "10.1007/978-3-642-02731-4_14"
    },
    {
      "text": "Qi Wang, Marina Toeters, Wei Chen, Annick Timmermans, and Panos Markopoulos. 2016. Zishi: A Smart Garment for Posture Monitoring. In Extended Abstracts on Human Factors in Computing Systems. 3792–3795. https://doi.org/10.1145/2851581.2890262",
      "doi": ""
    },
    {
      "text": "Stephen Wilks, Monica Mortimer, and Per Nylén. 2006. The introduction of sit–stand worktables; aspects of attitudes, compliance and satisfaction. Applied ergonomics 37, 3 (2006), 359–365.",
      "doi": ""
    },
    {
      "text": "Yu-Chian Wu, Te-Yen Wu, Paul Taele, Bryan Wang, Jun-You Liu, Pin-sung Ku, Po-En Lai, and Mike Y. Chen. 2018. ActiveErgo: Automatic and Personalized Ergonomics Using Self-Actuating Furniture. In Proceedings of Conference on Human Factors in Computing Systems. 1–8. https://doi.org/10.1145/3173574.3174132",
      "doi": "10.1145/3173574.3174132"
    },
    {
      "text": "Li Yujian and Liu Bo. 2007. A Normalized Levenshtein Distance Metric. IEEE Transactions on Pattern Analysis and Machine Intelligence 29, 6(2007), 1091–1095.",
      "doi": "10.1109/TPAMI.2007.1078"
    },
    {
      "text": "Nan Zhao, Asaph Azaria, and Joseph A. Paradiso. 2017. Mediated Atmospheres: A Multimodal Mediated Work Environment. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 2, Article 31 (June 2017), 23 pages. https://doi.org/10.1145/3090096",
      "doi": "10.1145/3090096"
    },
    {
      "text": "Ying Zheng and John B Morrell. 2010. A Vibrotactile Feedback Approach to Posture Guidance. In Proceedings of IEEE Haptics Symposium. 351–358. https://doi.org/10.1109/HAPTIC.2010.5444633",
      "doi": "10.1109/HAPTIC.2010.5444633"
    }
  ]
}