{
  "doi": "10.1145/3411764.3445440",
  "title": "ADIO: An Interactive Artifact Physically Representing the Intangible Digital Audiobook Listening Experience in Everyday Living Spaces",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Although audiobooks are increasingly being used, people tend to perceive audiobook experiences as 'not real reading' due to its intangibility and ephemerality. In this paper, we developed ADIO, a device augmenting audiobook experience through representing personal listening state in the form of an interactive physical bookshelf. ADIO displays a user's listening progress through a pendant's changing length and the user's digital audiobook archive titles. The result of our four-week in-field study with six participants revealed that ADIO provided proof of the user's listening-to, which brought a sense of reading and gave a trigger for recalling the listened-to audiobook content. Additionally, audiobooks' improved visibility reminded participants to listen to them, and ADIO's physical interaction allowed participants to form personal patterns for listening to audiobooks. Our findings proposed new methods for augmenting the audiobook listening experience at three stages and further implications for designing physical curation on users’ digital archives.",
  "tags": [
    "Digital possession",
    "Data physicalization",
    "Audiobook",
    "Physical interaction"
  ],
  "authors": [
    {
      "name": "Kyung-Ryong Lee",
      "institution": "Graduate School of Creative Design Engineering UNIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162777",
      "orcid": "missing"
    },
    {
      "name": "Beom Kim",
      "institution": "Department of Design UNIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702358",
      "orcid": "missing"
    },
    {
      "name": "Junyoung Kim",
      "institution": "Graduate School of Creative Design Engineering UNIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701639",
      "orcid": "missing"
    },
    {
      "name": "Hwajung Hong",
      "institution": "Department of Communication Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022414",
      "orcid": "0000-0001-5268-3331"
    },
    {
      "name": "Young-Woo Park",
      "institution": "Department of Design UNIST, Korea, Republic of",
      "img": "/do/10.1145/contrib-81413599235/rel-imgonly/untitled-1.jpg",
      "acmid": "81413599235",
      "orcid": "0000-0003-2257-9394"
    }
  ],
  "references": [
    {
      "text": "Audio Publishers Association. 2020. 2020 Consumer 2019 Sales Surveys Announcement. (2020). https://www.audiopub.org/uploads/pdf/2020-Consumer-Survey-and-2019-Sales-Survey-Press-Release-FINAL.Pdf",
      "doi": ""
    },
    {
      "text": "Audioclip. Naver. https://audioclip.naver.com/",
      "doi": ""
    },
    {
      "text": "Ana Caraban, Evangelos Karapanos, Daniel Gonçalves, and Pedro Campos. 2019. 23 Ways to Nudge: A Review of Technology-Mediated Nudging in Human-Computer Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. DOI: http://dx.doi.org/10.1145/3290605.3300733",
      "doi": "10.1145/3290605.3300733"
    },
    {
      "text": "D. Crasto, A. Kale, and C. Jaynes. 2005. The Smart Bookshelf: A Study of Camera Projector Scene Augmentation of an Everyday Environment. In 2005 Seventh IEEE Workshops on Applications of Computer Vision (WACV/MOTION’05) - Volume 1, Vol. 1. 218–225.",
      "doi": ""
    },
    {
      "text": "Lavinia Egidi and Marco Furini. 2006. From Digital Audiobook to Secure Digital Multimedia-Book. Comput. Entertain. 4, 3 (July 2006), 5–es. DOI: http://dx.doi.org/10.1145/1146816.1146825",
      "doi": "10.1145/1146816.1146825"
    },
    {
      "text": "Chris Elsden, David Kirk, Mark Selby, and Chris Speed. 2015. Beyond Personal Informatics: Designing for Experiences with Data. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 2341–2344. DOI: http://dx.doi.org/10.1145/2702613.2702632",
      "doi": "10.1145/2702613.2702632"
    },
    {
      "text": "Marco Furini. 2007. Beyond passive audiobook: How digital audiobooks get interactive. In 2007 4th IEEE Consumer Communications and Networking Conference. IEEE, 971–975.",
      "doi": "10.1109/CCNC.2007.196"
    },
    {
      "text": "David B. Gerritsen, Dan Tasse, Jennifer K. Olsen, Tatiana A. Vlahovic, Rebecca Gulotta, William Odom, Jason Wiese, and John Zimmerman. 2016. Mailing Archived Emails as Postcards: Probing the Value of Virtual Collections. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1187–1199. DOI: http://dx.doi.org/10.1145/2858036.2858541",
      "doi": "10.1145/2858036.2858541"
    },
    {
      "text": "Jane Gruning. 2018. Displaying Invisible Objects: Why People Rarely Re-Read E-Books. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. DOI: http://dx.doi.org/10.1145/3173574.3173713",
      "doi": "10.1145/3173574.3173713"
    },
    {
      "text": "Rebecca Gulotta, Alex Sciuto, Aisling Kelliher, and Jodi Forlizzi. 2015. Curatorial Agents: How Systems Shape Our Understanding of Personal and Familial Digital Information. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3453–3462. DOI: http://dx.doi.org/10.1145/2702123.2702297",
      "doi": "10.1145/2702123.2702297"
    },
    {
      "text": "Aakar Gupta, Bo Rui Lin, Siyi Ji, Arjav Patel, and Daniel Vogel. 2020. Replicate and Reuse: Tangible Interaction Design for Digitally-Augmented Physical Media Objects. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. DOI: http://dx.doi.org/10.1145/3313831.3376139",
      "doi": "10.1145/3313831.3376139"
    },
    {
      "text": "Iben Have and Birgitte Stougaard Pedersen. 2012. Conceptualising the audiobook experience. SoundEffects-An Interdisciplinary Journal of Sound and Sound Experience 2, 2 (2012), 79–95.",
      "doi": ""
    },
    {
      "text": "Iben Have and Birgitte Stougaard Pedersen. 2020. The audiobook circuit in digital publishing: Voicing the silent revolution. New Media & Society 22, 3 (2020), 409–428.",
      "doi": ""
    },
    {
      "text": "Luc Hermans, Mendel Broekhuijsen, and Panos Markopoulos. 2017. Memora: A Design for Teenagers to Connect Virtual and Physical Possessions. In Proceedings of the European Conference on Cognitive Ergonomics 2017 (ECCE 2017). Association for Computing Machinery, New York, NY, USA, 121–128. DOI: http://dx.doi.org/10.1145/3121283.3121312",
      "doi": "10.1145/3121283.3121312"
    },
    {
      "text": "Annika Hinze, Dana McKay, Nicholas Vanderschantz, Claire Timpany, and Sally Jo Cunningham. 2012. Book Selection Behavior in the Physical Library: Implications for Ebook Collections. In Proceedings of the 12th ACM/IEEE-CS Joint Conference on Digital Libraries (JCDL ’12). Association for Computing Machinery, New York, NY, USA, 305–314. DOI: http://dx.doi.org/10.1145/2232817.2232874",
      "doi": "10.1145/2232817.2232874"
    },
    {
      "text": "Eva Hornecker and Jacob Buur. 2006. Getting a Grip on Tangible Interaction: A Framework on Physical Space and Social Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’06). Association for Computing Machinery, New York, NY, USA, 437–446. DOI: http://dx.doi.org/10.1145/1124772.1124838",
      "doi": "10.1145/1124772.1124838"
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data Engagement Through Physical Ambient Visualizations in the Home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1608–1619. DOI: http://dx.doi.org/10.1145/2858036.2858059",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Annika Hupfeld and Tom Rodden. 2014. Books as a Social Technology. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work amp; Social Computing (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 639–651. DOI: http://dx.doi.org/10.1145/2531602.2531647",
      "doi": "10.1145/2531602.2531647"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and Challenges for Data Physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3227–3236. DOI: http://dx.doi.org/10.1145/2702123.2702180",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Mads Møller Jensen, Roman Rädle, Clemens N. Klokmose, and Susanne Bodker. 2018. Remediating a Design Tool: Implications of Digitizing Sticky Notes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. DOI: http://dx.doi.org/10.1145/3173574.3173798",
      "doi": "10.1145/3173574.3173798"
    },
    {
      "text": "Somi Ju, Kyung-Ryong Lee, Subin Kim, and Young-Woo Park. 2019. Bookly: An Interactive Everyday Artifact Showing the Time of Physically Accumulated Reading Activity. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–8. DOI: http://dx.doi.org/10.1145/3290605.3300614",
      "doi": "10.1145/3290605.3300614"
    },
    {
      "text": "Kyung Jin Kim, Sangsu Jang, Bomin Kim, Hyosun Kwon, and Young-Woo Park. 2019. MuRedder: Shredding Speaker for Ephemeral Musical Experience. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19). Association for Computing Machinery, New York, NY, USA, 127–134. DOI: http://dx.doi.org/10.1145/3322276.3322362",
      "doi": "10.1145/3322276.3322362"
    },
    {
      "text": "Sarah Kozloff. 1995. Audio books in a visual culture. The Journal of American Culture 18, 4 (1995), 83.",
      "doi": ""
    },
    {
      "text": "Daye Kwon and Woohun Lee. 2018. Artifact Mixtape: Curating Music in Personal Tangible Artifacts. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 265–270. DOI: http://dx.doi.org/10.1145/3197391.3205447",
      "doi": "10.1145/3197391.3205447"
    },
    {
      "text": "Andrew Manches, Claire O'Malley, and Steve Benford. 2009. Physical Manipulation: Evaluating the Potential for Tangible Designs. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (TEI ’09). Association for Computing Machinery, New York, NY, USA, 77–84. DOI: http://dx.doi.org/10.1145/1517664.1517688",
      "doi": "10.1145/1517664.1517688"
    },
    {
      "text": "Kazuhiro Matsushita, Daisuke Iwai, and Kosuke Sato. 2011. Interactive Bookshelf Surface for in Situ Book Searching and Storing Support. In Proceedings of the 2nd Augmented Human International Conference (AH’11). Association for Computing Machinery, New York, NY, USA, Article 2, 8 pages. DOI: http://dx.doi.org/10.1145/1959826.1959828",
      "doi": "10.1145/1959826.1959828"
    },
    {
      "text": "Donald McMillan, Barry Brown, Abigail Sellen, Siân Lindley, and Roy Martens. 2015. Pick up and Play: Understanding Tangibility for Cloud Media. In Proceedings of the 14th International Conference on Mobile and Ubiquitous Multimedia (MUM ’15). Association for Computing Machinery, New York, NY, USA, 1–13. DOI: http://dx.doi.org/10.1145/2836041.2836042",
      "doi": "10.1145/2836041.2836042"
    },
    {
      "text": "Barry D. Moore. 2020. Audiobook Statistics Reveals How Experts Use Audiobooks. (2020). https://www.greatworklife.com/how-to-listen-to-audiobooks-statistics",
      "doi": ""
    },
    {
      "text": "Tatsuo Nakajima, Vili Lehdonvirta, Eiji Tokunaga, and Hiroaki Kimura. 2008. Reflecting Human Behavior to Motivate Desirable Lifestyle. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (DIS’08). Association for Computing Machinery, New York, NY, USA, 405–414. DOI: http://dx.doi.org/10.1145/1394445.1394489",
      "doi": "10.1145/1394445.1394489"
    },
    {
      "text": "Wendy Nie, Tugce Tasci, and R. Pidaparthi. 2013. Book and Audiobook Synchronization.",
      "doi": ""
    },
    {
      "text": "Musa Nushi and Mohamad Hosein Eqbali. 2017. Duolingo: A Mobile Application to Assist Second Language Learning. Teaching English with Technology 17, 1 (2017), 89–98.",
      "doi": ""
    },
    {
      "text": "Jonathan Nyström Müller and Casper Engström. 2019. Consumer adoption of audiobook streaming services. (2019).",
      "doi": ""
    },
    {
      "text": "William Odom, Richard Banks, David Kirk, Richard Harper, Siân Lindley, and Abigail Sellen. 2012a. Technology Heirlooms? Considerations for Passing down and Inheriting Digital Materials. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’12). Association for Computing Machinery, New York, NY, USA, 337–346. DOI: http://dx.doi.org/10.1145/2207676.2207723",
      "doi": "10.1145/2207676.2207723"
    },
    {
      "text": "William Odom, Abi Sellen, Richard Harper, and Eno Thereska. 2012b. Lost in Translation: Understanding the Possession of Digital Things in the Cloud. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’12). Association for Computing Machinery, New York, NY, USA, 781–790. DOI: http://dx.doi.org/10.1145/2207676.2207789",
      "doi": "10.1145/2207676.2207789"
    },
    {
      "text": "William Odom, John Zimmerman, and Jodi Forlizzi. 2014. Placelessness, Spacelessness, and Formlessness: Experiential Qualities of Virtual Possessions. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS ’14). Association for Computing Machinery, New York, NY, USA, 985–994. DOI: http://dx.doi.org/10.1145/2598510.2598577",
      "doi": "10.1145/2598510.2598577"
    },
    {
      "text": "William Odom, John Zimmerman, Jodi Forlizzi, Ana López Higuera, Mauro Marchitto, José Cañas, Youn-kyung Lim, Tek-Jin Nam, Moon-Hwan Lee, Yeoreum Lee, Da-jung Kim, Yea-kyung Row, Jinmin Seok, Bokyung Sohn, and Heather Moore. 2013. Fragmentation and Transition: Understanding Perceptions of Virtual Possessions among Young Adults in Spain, South Korea and the United States. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1833–1842. DOI: http://dx.doi.org/10.1145/2470654.2466242",
      "doi": "10.1145/2470654.2466242"
    },
    {
      "text": "Anna-Marie Ortloff, Lydia Güntner, Maximiliane Windl, Thomas Schmidt, Martin Kocur, and Christian Wolff. 2019. SentiBooks: Enhancing Audiobooks via Affective Computing and Smart Light Bulbs. In Proceedings of Mensch Und Computer 2019 (MuC’19). Association for Computing Machinery, New York, NY, USA, 863–866. DOI: http://dx.doi.org/10.1145/3340764.3345368",
      "doi": "10.1145/3340764.3345368"
    },
    {
      "text": "Matthew K.X.J. Pan, Gordon Jih-Shiang Chang, Gokhan H. Himmetoglu, AJung Moon, Thomas W. Hazelton, Karon E. MacLean, and Elizabeth A. Croft. 2011. Galvanic Skin Response-Derived Bookmarking of an Audio Stream. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 1135–1140. DOI: http://dx.doi.org/10.1145/1979742.1979716",
      "doi": ""
    },
    {
      "text": "Daniela Petrelli and Steve Whittaker. 2010. Family memories in the home: contrasting physical and digital mementos. Personal and Ubiquitous Computing 14, 2 (2010), 153–169.",
      "doi": "10.1007/s00779-009-0279-7"
    },
    {
      "text": "Mark Rouncefield and Peter Tolmie. 2011. Digital Words: Reading and the 21st Century Home. Springer London, London, 133–162. DOI: http://dx.doi.org/10.1007/978-0-85729-476-0_8",
      "doi": ""
    },
    {
      "text": "Rishi Shukla and Rebecca Stewart. 2017. Metronome Music Time Capsule: Rematerialising Music Consumption and Exchange. In Proceedings of the 12th International Audio Mostly Conference on Augmented and Participatory Sound and Music Experiences (AM’17). Association for Computing Machinery, New York, NY, USA, Article 6, 4 pages. DOI: http://dx.doi.org/10.1145/3123514.3123548",
      "doi": "10.1145/3123514.3123548"
    },
    {
      "text": "Alice Thudt, Uta Hinrichs, Samuel Huron, and Sheelagh Carpendale. 2018. Self-Reflection and Personal Physicalization Construction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. DOI: http://dx.doi.org/10.1145/3173574.3173728",
      "doi": "10.1145/3173574.3173728"
    },
    {
      "text": "Lukas Van Campenhout, Joep Frens, Caroline Hummels, Achiel Standaert, and Herbert Peremans. 2019. The enriching limitations of the physical world. Personal and Ubiquitous Computing 23, 1 (2019), 81–98.",
      "doi": "10.1007/s00779-018-1176-8"
    },
    {
      "text": "LDE Van Campenhout, JW Frens, CJ Overbeeke, Achiel Standaert, and Herbert Peremans. 2013. Physical interaction in a dematerialized world. International Journal of Design 7, 1 (2013), 1–18.",
      "doi": ""
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2014. Research through design in HCI. In Ways of Knowing in HCI. Springer, 167–189.",
      "doi": ""
    }
  ]
}