{
  "doi": "10.1145/3411764.3446862",
  "title": "Investigating Car Drivers’ Information Demand after Safety and Security Critical Incidents",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "Modern cars include a vast array of computer systems designed to remove the burden on drivers and enhance safety. As cars are evolving towards autonomy and taking over control, e.g. in the form of autopilots, it becomes harder for drivers to pinpoint the root causes of a car’s malfunctioning. Drivers may need additional information to assess these ambiguous situations correctly. However, it is yet unclear which information is relevant and helpful to drivers in such situations. Hence, we conducted a mixed-methods online survey (N = 60) on Amazon MTurk where we exposed participants to two security- and safety-critical situations with one of three different explanations. We applied Thematic and Correspondence Analysis to understand which factors in these situations moderate drivers’ information demand. We identified a fundamental information demand across scenarios that is expanded by error-specific information types. Moreover, we found that it is necessary to communicate error sources, since drivers might not be able to identify them correctly otherwise. Thereby, malicious intrusions are typically perceived as more critical than technical malfunctions.",
  "tags": [
    "modern cars",
    "intelligibility"
  ],
  "authors": [
    {
      "name": "Lea Theresa Gröber",
      "institution": "CISPA Helmholtz Center for Information Security, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700604",
      "orcid": "missing"
    },
    {
      "name": "Matthias Fassl",
      "institution": "CISPA Helmholtz Center for Information Security, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700447",
      "orcid": "0000-0002-2894-3751"
    },
    {
      "name": "Abhilash Gupta",
      "institution": "CISPA, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700956",
      "orcid": "missing"
    },
    {
      "name": "Katharina Krombholz",
      "institution": "CISPA Helmholtz Center for Information Security Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86158755757",
      "orcid": "0000-0003-2425-3013"
    }
  ],
  "references": [
    {
      "text": "Devdatta Akhawe and Adrienne Porter Felt. 2013. Alice in warningland: A large-scale field study of browser security warning effectiveness. In Presented as part of the 22nd USENIX Security Symposium (USENIX Security 13). USENIX Association, Berkeley, 257–272.",
      "doi": ""
    },
    {
      "text": "Paul Andre, Sanjay Chetwani, Kailasnath Dornadula, and Ashok Teckchandani. 2003. Automotive security and monitoring system. US Patent App. 10/073,725.",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti and Keith Edwards. 2001. Intelligibility and accountability: human considerations in context-aware systems. Human–Computer Interaction 16, 2-4 (2001), 193–212.",
      "doi": "10.1207/S15327051HCI16234_05"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Jae Bong Chang, Jayson L Lusk, and F Bailey Norwood. 2009. How closely do hypothetical surveys and laboratory experiments predict field behavior?American Journal of Agricultural Economics 91, 2 (2009), 518–534.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. Sage, London.",
      "doi": ""
    },
    {
      "text": "Hongjun Choi, Wen-Chuan Lee, Yousra Aafer, Fan Fei, Zhan Tu, Xiangyu Zhang, Dongyan Xu, and Xinyan Deng. 2018. Detecting attacks against robotic vehicles: A control invariant approach. In Proceedings of the 2018 ACM SIGSAC Conference on Computer and Communications Security. ACM, New York, 801–816.",
      "doi": "10.1145/3243734.3243752"
    },
    {
      "text": "Verena Distler, Marie-Laure Zollinger, Carine Lallemand, Peter B Roenne, Peter YA Ryan, and Vincent Koenig. 2019. Security-Visible, Yet Unseen?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, 1–13.",
      "doi": "10.1145/3290605.3300835"
    },
    {
      "text": "Finale Doshi-Velez, Mason Kortz, Ryan Budish, Chris Bavitz, Sam Gershman, David O’Brien, Stuart Schieber, James Waldo, David Weinberger, and Alexandra Wood. 2017. Accountability of AI under the law: The role of explanation. arXiv (2017). arXiv:arXiv:1711.01134",
      "doi": ""
    },
    {
      "text": "Raj Gautam Dutta, Feng Yu, Teng Zhang, Yaodan Hu, and Yier Jin. 2018. Security for safety: a path toward building trusted autonomous vehicles. In Proceedings of the International Conference on Computer-Aided Design. ACM, New York, 1–6.",
      "doi": "10.1145/3240765.3243496"
    },
    {
      "text": "Mary T Dzindolet, Scott A Peterson, Regina A Pomranky, Linda G Pierce, and Hall P Beck. 2003. The role of trust in automation reliance. International journal of human-computer studies 58, 6 (2003), 697–718.",
      "doi": "10.1016/S1071-5819%2803%2900038-7"
    },
    {
      "text": "Thomas Franke, Christiane Attig, and Daniel Wessel. 2019. A personal resource for technology interaction: development and validation of the affinity for technology interaction (ATI) scale. International Journal of Human–Computer Interaction 35, 6(2019), 456–467.",
      "doi": ""
    },
    {
      "text": "Flavio D Garcia, David Oswald, Timo Kasper, and Pierre Pavlidès. 2016. Lock it and still lose it—on the (in) security of automotive remote keyless entry systems. In 25th USENIX Security Symposium (USENIX Security 16). USENIX Association, Berkeley.",
      "doi": ""
    },
    {
      "text": "Jairo Giraldo, Sahand Hadizadeh Kafash, Justin Ruths, and Alvaro A Cardenas. 2020. DARIA: Designing Actuators to Resist Arbitrary Attacks Against Cyber-Physical Systems. In 2020 IEEE European Symposium on Security and Privacy (EuroS&P). IEEE, New York, 339–353.",
      "doi": ""
    },
    {
      "text": "Alyssa Glass, Deborah L McGuinness, and Michael Wolverton. 2008. Toward establishing trust in adaptive agents. In Proceedings of the 13th international conference on Intelligent user interfaces. ACM, New York, 227–236.",
      "doi": "10.1145/1378773.1378804"
    },
    {
      "text": "Michael Greenacre. 2017. Correspondence analysis in practice. CRC press, Boca Raton.",
      "doi": ""
    },
    {
      "text": "Andy Greenberg. 2013. Forbes, ”Hackers Reveal Nasty New Car Attacks–With Me Behind The Wheel (Video)”. https://www.forbes.com/sites/andygreenberg/2013/07/24/hackers-reveal-nasty-new-car-attacks-with-me-behind-the-wheel-video/. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Andy Greenberg. 2015. Wired, ”Hackers Remotely Kill a Jeep on the Highway—With Me in It”. https://www.wired.com/2015/07/hackers-remotely-kill-jeep-highway/. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Andy Greenberg. 2016. Wired, A New Wireless Hack Can Unlock 100 Million Volkswagens. https://www.wired.com/2016/08/oh-good-new-hack-can-unlock-100-million-volkswagens/. Accessed: 2019-15-11.",
      "doi": ""
    },
    {
      "text": "Andy Greenberg. 2017. Wired, ”Just a Pair of These $11 Radio Gadgets Can Steal a Car”. https://www.wired.com/2017/04/just-pair-11-radio-gadgets-can-steal-car/. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Andy Greenberg. 2018. Wired, ”Hackers Can Steal a Tesla Model S in Seconds by Cloning Its Key Fob”. https://www.wired.com/story/hackers-steal-tesla-model-s-seconds-key-fob/. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Andy Greenberg. 2019. Wired, ”Hackers Could Steal a Tesla Model S by Cloning Its Key Fob—Again”. https://www.wired.com/story/hackers-steal-tesla-model-s-key-fob-encryption/. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Andy Greenberg. 2020. Wired, ”Split-Second ‘Phantom’ Images Can Fool Tesla’s Autopilot”. https://www.wired.com/story/tesla-model-x-autopilot-phantom-images/. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Andy Greenberg. 2020. Wired, ”This Bluetooth Attack Can Steal a Tesla Model X in Minutes”. https://www.wired.com/story/tesla-model-x-hack-bluetooth/. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Shirley Gregor and Izak Benbasat. 1999. Explanations from intelligent systems: Theoretical foundations and implications for practice. MIS quarterly (1999), 497–530.",
      "doi": ""
    },
    {
      "text": "Peter A Hancock, Deborah R Billings, Kristin E Schaefer, Jessie YC Chen, Ewart J De Visser, and Raja Parasuraman. 2011. A meta-analysis of factors affecting trust in human-robot interaction. Human factors 53, 5 (2011), 517–527.",
      "doi": ""
    },
    {
      "text": "Helen Hastie, Francisco J Chiyah Garcia, David A Robb, Atanas Laskov, and Pedro Patron. 2018. MIRIAM: A multimodal interface for explaining the reasoning behind actions of remote autonomous systems. In Proceedings of the 2018 on International Conference on Multimodal Interaction. ACM, New York, 557–558.",
      "doi": "10.1145/3242969.3266297"
    },
    {
      "text": "Kevin Anthony Hoff and Masooda Bashir. 2015. Trust in automation: Integrating empirical evidence on factors that influence trust. Human factors 57, 3 (2015), 407–434.",
      "doi": ""
    },
    {
      "text": "Andreas Holzinger. 2018. From machine learning to explainable AI. In 2018 World Symposium on Digital Intelligence for Systems and Machines (DISA). IEEE, New York, 55–66.",
      "doi": ""
    },
    {
      "text": "Timo Jakobi, Gunnar Stevens, Nico Castelli, Corinna Ogonowski, Florian Schaub, Nils Vindice, Dave Randall, Peter Tolmie, and Volker Wulf. 2018. Evolving needs in iot control and accountability: A longitudinal study on smart home intelligibility. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–28.",
      "doi": "10.1145/3287049"
    },
    {
      "text": "Jiun-Yin Jian, Ann M Bisantz, and Colin G Drury. 2000. Foundations for an empirically determined scale of trust in automated systems. International Journal of Cognitive Ergonomics 4, 1 (2000), 53–71.",
      "doi": ""
    },
    {
      "text": "W Lewis Johnson. 1994. Agents that Learn to Explain Themselves. In AAAI-94 Proceedings. AAAI, Palo Alto, 1257–1263.",
      "doi": ""
    },
    {
      "text": "Samy Kamkar. 2015. Drive it like you hacked it: New attacks and tools to wirelessly steal cars. Presentation at DEFCON 23 (2015).",
      "doi": ""
    },
    {
      "text": "Swati Khandelwal. 2016. Hackernews, ”Car Thieves Can Unlock 100 Million Volkswagens With A Simple Wireless Hack”. https://thehackernews.com/2016/08/hack-unlock-car-door.html. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Klaus Krippendorff. 2004. Content analysis: An introduction to its methodology. Sage, London. chap. 11 pages.",
      "doi": ""
    },
    {
      "text": "Thomas Kundinger, Philipp Wintersberger, and Andreas Riener. 2019. (Over) Trust in Automated Driving: The Sleeping Pill of Tomorrow?. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, 1–6.",
      "doi": "10.1145/3290607.3312869"
    },
    {
      "text": "Matt Lake. 2001. The New York Times, ”HOW IT WORKS; Remote Keyless Entry: Staying a Step Ahead of Car Thieves”. https://www.nytimes.com/2001/06/07/technology/how-it-works-remote-keyless-entry-staying-a-step-ahead-of-car-thieves.html. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Pat Langley, Ben Meadows, Mohan Sridharan, and Dongkyu Choi. 2017. Explainable agency for intelligent autonomous systems. In Twenty-Ninth AAAI Conference. AAAI, Palo Alto.",
      "doi": ""
    },
    {
      "text": "John D Lee and Katrina A See. 2004. Trust in automation: Designing for appropriate reliance. Human factors 46, 1 (2004), 50–80.",
      "doi": ""
    },
    {
      "text": "Brian Y Lim and Anind K Dey. 2009. Assessing demand for intelligibility in context-aware applications. In Proceedings of the 11th international conference on Ubiquitous computing. ACM, New York, 195–204.",
      "doi": "10.1145/1620545.1620576"
    },
    {
      "text": "Brian Y Lim and Anind K Dey. 2010. Toolkit to support intelligibility in context-aware applications. In Proceedings of the 12th ACM international conference on Ubiquitous computing. ACM, New York, 13–22.",
      "doi": "10.1145/1864349.1864353"
    },
    {
      "text": "Brian Y Lim, Anind K Dey, and Daniel Avrahami. 2009. Why and why not explanations improve the intelligibility of context-aware intelligent systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, 2119–2128.",
      "doi": "10.1145/1518701.1519023"
    },
    {
      "text": "Poornima Madhavan and Douglas A Wiegmann. 2007. Similarities and differences between human–human and human–automation trust: an integrative review. Theoretical Issues in Ergonomics Science 8, 4 (2007), 277–301.",
      "doi": ""
    },
    {
      "text": "Deborah L McGuinness, Alyssa Glass, Michael Wolverton, and Paulo Pinheiro Da Silva. 2007. A Categorization of Explanation Questions for Task Processing Systems. In ExaCt. AAAI, Palo Alto, 42–48.",
      "doi": ""
    },
    {
      "text": "Stephanie M Merritt and Daniel R Ilgen. 2008. Not all trust is created equal: Dispositional and history-based trust in human-automation interactions. Human Factors 50, 2 (2008), 194–210.",
      "doi": ""
    },
    {
      "text": "Hyeran Mun, Kyusuk Han, and Dong Hoon Lee. 2020. Ensuring Safety and Security in CAN-based Automotive Embedded Systems: A Combination of Design Optimization and Secure Communication. IEEE Transactions on Vehicular Technology(2020).",
      "doi": ""
    },
    {
      "text": "NIST. 2021. Cybersecurity Framework. https://www.nist.gov/cyberframework. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Stefan Nürnberger and Christian Rossow. 2016. –vatiCAN–Vetted, Authenticated CAN Bus. In International Conference on Cryptographic Hardware and Embedded Systems. Springer, Cham, 106–124.",
      "doi": ""
    },
    {
      "text": "OPM.GOV. 2021. EDUCATION LEVEL. https://dw.opm.gov/datastandards/referenceData/1435/current?index=E. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Sean Kross, and Michelle L Mazurek. 2019. How well do my results generalize? comparing security and privacy survey results from mturk, web, and telephone samples. In 2019 2019 IEEE Symposium on Security and Privacy (SP), Vol. 00. IEEE, New York, 227–244.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Everest Liu, and Michelle L Mazurek. 2017. You Want Me To Do What? A Design Study of Two-Factor Authentication Messages.. In SOUPS. USENIX Association, Berkley.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Amelia R Malone, and Michelle L Mazurek. 2016. I Think They’re Trying to Tell Me Something: Advice Sources and Selection for Digital Security. In Security and Privacy (SP), 2016 IEEE Symposium on. IEEE, New York, 272–288.",
      "doi": ""
    },
    {
      "text": "Robert W Reeder, Adrienne Porter Felt, Sunny Consolvo, Nathan Malkin, Christopher Thompson, and Serge Egelman. 2018. An experience sampling study of user reactions to browser warnings in the field. In Proceedings of the 2018 CHI conference on human factors in computing systems. ACM, New York, 1–13.",
      "doi": "10.1145/3173574.3174086"
    },
    {
      "text": "John K Rempel, John G Holmes, and Mark P Zanna. 1985. Trust in close relationships.Journal of personality and social psychology 49, 1(1985), 95.",
      "doi": ""
    },
    {
      "text": "Ishtiaq Rouf, Robert D Miller, Hossen A Mustafa, Travis Taylor, Sangho Oh, Wenyuan Xu, Marco Gruteser, Wade Trappe, and Ivan Seskar. 2010. Security and Privacy Vulnerabilities of In-Car Wireless Networks: A Tire Pressure Monitoring System Case Study.. In USENIX Security Symposium, Vol. 10. USENIX Association, Berkley.",
      "doi": ""
    },
    {
      "text": "Wojciech Samek. 2019. Explainable AI: Interpreting, explaining and visualizing deep learning. Springer Nature, Cham.",
      "doi": "10.1007/978-3-030-28954-6"
    },
    {
      "text": "Markus Pauly Sarah Friedrich, Frank Konietschke. 2020. MANOVA.RM Documentation. https://cran.r-project.org/web/packages/MANOVA.RM/MANOVA.RM.pdf. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Fabian A. Scherschel. 2018. Heise, ”Schlüssel-Hack: Autos von Tesla lassen sich in Sekunden öffnen”. https://www.heise.de/security/meldung/Schluessel-Hack-Autos-von-Tesla-lassen-sich-in-Sekunden-oeffnen-4161136.html. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Matthew Smith, Martin Strohmeier, Jonathan Harman, Vincent Lenders, and Ivan Martinovic. 2020. A view from the cockpit: exploring pilot reactions to attacks on avionic systems. NDSS (2020).",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet M Corbin. 1997. Grounded theory in practice. Sage, London.",
      "doi": ""
    },
    {
      "text": "Tesla. 2020. Tesla’s Autopilot. https://www.tesla.com/autopilot. Accessed: 2019-07-10.",
      "doi": ""
    },
    {
      "text": "Daniel Wessel Thomas Franke, Christiane Attig. 2021. ATI Scale. https://ati-scale.org/. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Amazon Mechanical Turk. 2021. Amazon Mechanical Turk. https://www.mturk.com/. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Amazon Mechanical Turk. 2021. FAQs - About Amazon Mechanical Turk. https://www.mturk.com/worker/help. Accessed: 2021-01-11.",
      "doi": ""
    },
    {
      "text": "Marko Wolf, André Weimerskirch, and Christof Paar. 2004. Security in automotive bus systems. In Workshop on Embedded Security in Cars. isits AG, Bochum.",
      "doi": ""
    },
    {
      "text": "Eray Yağdereli, Cemal Gemci, and A Ziya Aktaş. 2015. A study on cyber-security of autonomous and unmanned vehicles. The Journal of Defense Modeling and Simulation 12, 4(2015), 369–381.",
      "doi": ""
    },
    {
      "text": "Chen Yan, Wenyuan Xu, and Jianhao Liu. 2016. Can you trust autonomous vehicles: Contactless attacks against sensors of self-driving vehicle. DEF CON 24(2016).",
      "doi": ""
    },
    {
      "text": "YouTube. 2020. ”AReallyBadDay: Tesla Crash into Construction Barrels”. https://www.youtube.com/watch?v=i9r4nS5EjjQ. Accessed: 2020-09-17.",
      "doi": ""
    }
  ]
}