{
  "doi": "10.1145/3411764.3445735",
  "title": "Planning for Natural Language Failures with the AI Playbook",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "Prototyping AI user experiences is challenging due in part to probabilistic AI models making it difficult to anticipate, test, and mitigate AI failures before deployment. In this work, we set out to support practitioners with early AI prototyping, with a focus on natural language (NL)-based technologies. Our interviews with 12 NL practitioners from a large technology company revealed that, in addition to challenges prototyping AI, prototyping was often not happening at all or focused only on idealized scenarios due to a lack of tools and tight timelines. These findings informed our design of the AI Playbook, an interactive and low-cost tool we developed to encourage proactive and systematic consideration of AI errors before deployment. Our evaluation of the AI Playbook demonstrates its potential to 1) encourage product teams to prioritize both ideal and failure scenarios, 2) standardize the articulation of AI failures from a user experience perspective, and 3) act as a boundary object between user experience designers, data scientists, and engineers.",
  "authors": [
    {
      "name": "Matthew K. Hong",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700944",
      "orcid": "missing"
    },
    {
      "name": "Adam Fourney",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81330490871/rel-imgonly/adamfo.png",
      "acmid": "81330490871",
      "orcid": "missing"
    },
    {
      "name": "Derek DeBellis",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701316",
      "orcid": "missing"
    },
    {
      "name": "Saleema Amershi",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81323487634",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery, New York, New York, USA, 1–13. https://doi.org/10.1145/3290605.3300233",
      "doi": ""
    },
    {
      "text": "Dan Bohus and Alexander I Rudnicky. 2005. Sorry, I Didn’t Catch That! - An Investigation of Non-Understanding Errors and Recovery Strategies. In 6th SIGdial workshop on discourse and dialogue.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Bill Buxton. 2010. Sketching user experiences: getting the design right and the right design. Morgan kaufmann.",
      "doi": ""
    },
    {
      "text": "Herbert H Clark. 1996. Using language. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Justin Cranshaw, Emad Elwany, Todd Newman, Rafal Kocielnik, Bowen Yu, Sandeep Soni, Jaime Teevan, and Andrés Monroy-Hernández. 2017. Calendar.help: Designing a Workflow-Based Scheduling Agent with Humans in the Loop. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2017-May. Association for Computing Machinery, New York, NY, USA, 2382–2393. https://doi.org/10.1145/3025453.3025780",
      "doi": "10.1145/3025453.3025780"
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX design innovation: Challenges for working with machine learning as a design material. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2017-May. Association for Computing Machinery, New York, NY, USA, 278–288. https://doi.org/10.1145/3025453.3025739",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "Rahhal Errattahi, Asmaa El Hannani, and Hassan Ouahmane. 2018. Automatic speech recognition errors detection and correction: A review. In Procedia Computer Science, Vol. 128. Elsevier B.V., 32–37. https://doi.org/10.1016/j.procs.2018.03.005",
      "doi": ""
    },
    {
      "text": "Jerry Alan Fails and Dan R. Olsen. 2003. A design tool for camera-based interaction. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery (ACM), New York, New York, USA, 449–456. https://doi.org/10.1145/642611.642690",
      "doi": "10.1145/642611.642690"
    },
    {
      "text": "Norman M. Fraser and G. Nigel Gilbert. 1991. Simulating Speech Systems. Computer Speech and Language 5, 1 (1 1991), 81–99. https://doi.org/10.1016/0885-2308(91)90019-M",
      "doi": ""
    },
    {
      "text": "Google PAIR. 2019. People + AI Guidebook. https://pair.withgoogle.com/guidebook/",
      "doi": ""
    },
    {
      "text": "John D Gould, John Conti, and Todd Hovanyecz. 1983. Composing Letters With a Simulated Listening Typewriter. Commun. ACM 26, 4 (4 1983), 295–308. https://doi.org/10.1145/2163.358100",
      "doi": ""
    },
    {
      "text": "Ryuichiro Higashinaka, Kotaro Funakoshi, Masahiro Araki, Hiroshi Tsukahara, Yuka Kobayashi, and Masahiro Mizukami. 2015. Towards taxonomy of errors in chat-oriented dialogue systems. In Proceedings of the 16th annual meeting of the special interest group on discourse and dialogue. 87–95.",
      "doi": ""
    },
    {
      "text": "Kenneth Holstein, Jennifer Wortman Vaughan, Hal Daumé, Miro Dudik, and Hanna Wallach. 2019. Improving Fairness in Machine Learning Systems: What Do Industry Practitioners Need?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3290605.3300830",
      "doi": "10.1145/3290605.3300830"
    },
    {
      "text": "Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Conference on Human Factors in Computing Systems - Proceedings. ACM Press, New York, New York, USA, 159–166. https://doi.org/10.1145/302979.303030",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "IBM. 2019. IBM Design for AI: Conversation planning. https://www.ibm.com/design/ai/conversation/planning/",
      "doi": ""
    },
    {
      "text": "J. F. Kelley. 1984. An Iterative Design Methodology for User-Friendly Natural Language Office Information Applications. ACM Transactions on Information Systems (TOIS) 2, 1 (1 1984), 26–41. https://doi.org/10.1145/357417.357420",
      "doi": "10.1145/357417.357420"
    },
    {
      "text": "Walter S. Lasecki, Juho Kim, Nicholas Rafter, Onkur Sen, Jeffrey P. Bigham, and Michael S. Bernstein. 2015. Apparition: Crowdsourced user interfaces that come to life as you sketch them. In Conference on Human Factors in Computing Systems - Proceedings, Vol. 2015-April. Association for Computing Machinery, 1925–1934. https://doi.org/10.1145/2702123.2702565",
      "doi": "10.1145/2702123.2702565"
    },
    {
      "text": "Michael A Madaio, Luke Stark, Jennifer Wortman Vaughan, and Hanna Wallach. 2020. Co-Designing Checklists to Understand Organizational Challenges and Opportunities around Fairness in AI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376445",
      "doi": "10.1145/3313831.3376445"
    },
    {
      "text": "Sean McGregor. 2020. Preventing Repeated Real World AI Failures by Cataloging Incidents: The AI Incident Database. arXiv preprint arXiv:2011.08512(2020).",
      "doi": ""
    },
    {
      "text": "Margaret Mitchell, Simone Wu, Andrew Zaldivar, Parker Barnes, Lucy Vasserman, Ben Hutchinson, Elena Spitzer, Inioluwa Deborah Raji, and Timnit Gebru. 2019. Model cards for model reporting. In FAT* 2019 - Proceedings of the 2019 Conference on Fairness, Accountability, and Transparency. Association for Computing Machinery, Inc, New York, New York, USA, 220–229. https://doi.org/10.1145/3287560.3287596",
      "doi": ""
    },
    {
      "text": "Dan Moldovan, Marius Paşca, Sanda Harabagiu, and Mihai Surdeanu. 2003. Performance issues and error analysis in an open-domain question answering system. ACM Transactions on Information Systems 21, 2 (4 2003), 133–154. https://doi.org/10.1145/763693.763694",
      "doi": "10.1145/763693.763694"
    },
    {
      "text": "Tim Paek. 2003. Toward a taxonomy of communication errors. In ISCA Tutorial and Research Workshop on Error Handling in Spoken Dialogue Systems.",
      "doi": ""
    },
    {
      "text": "Tim Paek and Eric Horvitz. 2000. Conversation as Action under Uncertainty. In Proceedings of the Sixteenth Conference on Uncertainty in Artificial Intelligence(UAI’00). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 455–464.",
      "doi": "10.5555/2073946.2073999"
    },
    {
      "text": "Laurel Riek. 2012. Wizard of Oz Studies in HRI: A Systematic Review and New Reporting Guidelines. Journal of Human-Robot Interaction (8 2012), 119–136. https://doi.org/10.5898/jhri.1.1.riek",
      "doi": ""
    },
    {
      "text": "Stephan Schlögl, Gavin Doherty, and Saturnino Luz. 2015. Wizard of Oz Experimentation for Language Technology Applications: Challenges and Tools. Interacting with Computers 27, 6 (11 2015), 592–615. https://doi.org/10.1093/iwc/iwu016",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Andrew D. Wilson, and Yang Li. 2007. Gestures without libraries, toolkits or training: A $1 recognizer for user interface prototypes. In UIST: Proceedings of the Annual ACM Symposium on User Interface Softaware and Technology. ACM Press, New York, New York, USA, 159–168. https://doi.org/10.1145/1294211.1294238",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Qian Yang, Justin Cranshaw, Saleema Amershi, Shamsi T Iqbal, and Jaime Teevan. 2019. Sketching Nlp: A Case Study of Exploring the Right Things to Design With Language Intelligence. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery, New York, New York, USA, 1–12. https://doi.org/10.1145/3290605.3300415",
      "doi": "10.1145/3290605.3300415"
    },
    {
      "text": "Qian Yang, Alex Scuito, John Zimmerman, Jodi Forlizzi, and Aaron Steinfeld. 2018. Investigating how experienced UX designers effectively work with machine learning. In DIS 2018 - Proceedings of the 2018 Designing Interactive Systems Conference. Association for Computing Machinery, Inc, New York, NY, USA, 585–596. https://doi.org/10.1145/3196709.3196730",
      "doi": "10.1145/3196709.3196730"
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, Carolyn Rosé, and John Zimmerman. 2020. Re-Examining Whether, Why, and How Human-AI Interaction Is Uniquely Difficult to Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376301",
      "doi": "10.1145/3313831.3376301"
    },
    {
      "text": "Qian Yang, Jina Suh, Nan Chen Chen, and Gonzalo Ramos. 2018. Grounding interactive machine learning tool design in how non-experts actually build models. In DIS 2018 - Proceedings of the 2018 Designing Interactive Systems Conference. Association for Computing Machinery, Inc, New York, NY, USA, 573–584. https://doi.org/10.1145/3196709.3196729",
      "doi": "10.1145/3196709.3196729"
    },
    {
      "text": "Tomáš Zemčík. 2020. Failure of chatbot Tay was evil, ugliness and uselessness in its nature or do we judge it through cognitive shortcuts and biases?AI and Society (2020). https://doi.org/10.1007/s00146-020-01053-4",
      "doi": ""
    }
  ]
}