{
  "doi": "10.1145/3411764.3445239",
  "title": "What do Teens Make of Personal Informatics?: Young People's Responses to Self-Tracking Practices for Self-Determined Motives",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2021,
  "badges": [],
  "abstract": "Personal informatics (PI) technologies allow users to collect data about aspects of their lifestyle like mood or step count. Though teens increasingly encounter and use such technologies, little is known about how they ascribe meaning to their own PI activities. We report a qualitative study of the PI experiences of eighteen teens (aged 14 – 17). Following a learning phase focused on interpreting PI data, participants chose a personal goal that interested them and a PI tool to track it for 4-8 weeks in everyday contexts. Participants proved to be competent, flexible users of PI tools, tracking a range of meaningful life factors, from ‘worries’ to ‘exercise’; they valued learning about ‘natural patterns’ in their lives and were motivated to manage their emotions and evaluate whether they were doing the right thing. Our findings contribute to understanding how young people can engage in appropriation and interpretation of PI data – suggesting opportunities for educational interventions and design.",
  "tags": [
    "teen users",
    "self-tracking",
    "personal informatics",
    "data interpretation"
  ],
  "authors": [
    {
      "name": "Kyrill Potapov",
      "institution": "UCL Interaction Centre UCL, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366149",
      "orcid": "missing"
    },
    {
      "name": "Asimina Vasalou",
      "institution": "UCL Knowledge Lab University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485195",
      "orcid": "missing"
    },
    {
      "name": "Victor Lee",
      "institution": "Graduate School of Education Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467644126",
      "orcid": "missing"
    },
    {
      "name": "Paul Marshall",
      "institution": "University of Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280485",
      "orcid": "0000-0003-2950-8310"
    }
  ],
  "references": [
    {
      "text": "Lisa Cadmus-Bertram, Bess Marcus, Ruth Patterson, Barbara Parker, and Brittany Morey, 2015. Randomized Trial of a Fitbit-Based Physical Activity Intervention for Women. Am J Prev Med 49, 3 (Sep), 414-418. DOI= http://dx.doi.org/10.1016/j.amepre.2015.01.020.",
      "doi": ""
    },
    {
      "text": "Sharon Lynn Chu, Brittany Garcia, and Beth Nam, 2019. Understanding Context in Children's Use of Smartwatches for Everyday Science Reflections. In Proceedings of the 18th ACM International Conference on Interaction Design and Children, 83-93.",
      "doi": "10.1145/3311927.3323144"
    },
    {
      "text": "Victoria Clarke and Virginia Braun, 2014. Thematic analysis. In Encyclopedia of critical psychology Springer, 1947-1952.",
      "doi": ""
    },
    {
      "text": "Tamara Clegg, Leyla Norooz, Seokbin Kang, Virginia Byrne, Monica Katzen, Rafael Velez, Angelisa Plane, Vanessa Oguamanam, Thomas Outing, and Jason Yip, 2017. Live physiological sensing and visualization ecosystems: an activity theory analysis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2029-2041.",
      "doi": "10.1145/3025453.3025987"
    },
    {
      "text": "Jan Derry, 2013. Vygotsky: Philosophy and education. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Joel R Drake, Ryan Cain, and Victor R Lee, 2018. From Wearing to Wondering: Treating Wearable Activity Trackers as Objects of Inquiry. In Wearable Technologies: Concepts, Methodologies, Tools, and Applications IGI Global, 810-832.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Bettina Nissen, Andrew Garbett, David Chatting, David Kirk, and John Vines, 2016. Metadating: exploring the romance and future of personal data. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems ACM, 685-698.",
      "doi": "10.1145/2858036.2858173"
    },
    {
      "text": "Yrjö Engeström, 2014. Learning by expanding. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "John Evans, Emma Rich, Brian Davies, and Rachel Allwood, 2008. Education, disordered eating and obesity discourse: Fat fabrications. Routledge.",
      "doi": ""
    },
    {
      "text": "Luis Fernandez-Luque, Meghna Singh, Ferda Ofli, Yelena A. Mejova, Ingmar Weber, Michael Aupetit, Sahar Karim Jreige, Ahmed Elmagarmid, Jaideep Srivastava, and Mohamed Ahmedna, 2017. Implementing 360° Quantified Self for childhood obesity: feasibility study and experiences from a weight loss camp in Qatar. BMC Medical Informatics and Decision Making 17, 1 (April 13), 37. DOI= http://dx.doi.org/10.1186/s12911-017-0432-6.",
      "doi": ""
    },
    {
      "text": "Joel E Fischer, Andy Crabtree, James A Colley, Tom Rodden, and Enrico Costanza, 2017. Data work: how energy advisors and clients make IoT data accountable. Computer Supported Cooperative Work (CSCW) 26, 4-6, 597-626.",
      "doi": "10.1007/s10606-017-9293-x"
    },
    {
      "text": "Andrew Garbett, David Chatting, Gerard Wilkinson, Clement Lee, and Ahmed Kharrufa, 2018. ThinkActive: Designing for Pseudonymous Activity Tracking in the Classroom.",
      "doi": ""
    },
    {
      "text": "Juan Jimenez Garcia, Hilde de Bruyckere, David V. Keyson, and Natalia Romero, 2013. Designing Personal Informatics for Self-reflection and Self-awareness: The Case of Children with Attention Deficit Hyperactivity Disorder Springer International Publishing, Cham, 109-123.",
      "doi": ""
    },
    {
      "text": "Jeffrey Gaudet, François Gallant, and Mathieu Bélanger, 2017. A Bit of Fit: Minimalist Intervention in Adolescents Based on a Physical Activity Tracker. JMIR Mhealth Uhealth 5, 7 (2017/07/06), e92. DOI= http://dx.doi.org/10.2196/mhealth.7647.",
      "doi": ""
    },
    {
      "text": "Matthew K Hong, Udaya Lakshmi, Thomas A Olson, and Lauren Wilcox, 2018. Visual ODLs: Co-designing patient-generated observations of daily living to support data-driven conversations in pediatric care. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1-13.",
      "doi": "10.1145/3173574.3174050"
    },
    {
      "text": "EV Ilyenkov, 1974. Activity and knowledge. Philosophy and culture.",
      "doi": ""
    },
    {
      "text": "Pradthana Jarusriboonchai, Thomas Olsson, Jarno Ojala, and Kaisa Väänänen-Vainio-Mattila, 2014. Opportunities and challenges of mobile applications as tickets-to-talk: a scenario-based user study. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia ACM, 89-97.",
      "doi": "10.1145/2677972.2677993"
    },
    {
      "text": "Victor Kaptelinin and Bonnie Nardi, 2012. Activity theory in HCI: Fundamentals and reflections. Synthesis Lectures Human-Centered Informatics 5, 1, 1-105.",
      "doi": "10.5555/2361921"
    },
    {
      "text": "Charlotte Kerner and Victoria A. Goodyear, 2017. The Motivational Impact of Wearable Healthy Lifestyle Technologies: A Self-determination Perspective on Fitbits With Adolescents. American Journal of Health Education 48, 5 (2017/09/03), 287-297. DOI= http://dx.doi.org/10.1080/19325037.2017.1343161.",
      "doi": ""
    },
    {
      "text": "Elisabeth T. Kersten-van Dijk, Joyce H. D. M. Westerink, Femke Beute, and Wijnand A. Ijsselsteijn, 2017. Personal Informatics, Self-Insight, and Behavior Change: A Critical Review of Current Literature. Human–Computer Interaction 32, 5-6 (2017/11/02), 268-296. DOI= http://dx.doi.org/10.1080/07370024.2016.1276456.",
      "doi": "10.1080/07370024.2016.1276456"
    },
    {
      "text": "Eeva Kettunen, Markus Makkonen, Tuomas Kari, and Will Critchley, 2019. Using Sport and Wellness Technology to Promote Physical Activity: An Intervention Study among Teenagers. In Proceedings of the 52nd Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Nam Wook Kim, Hyejin Im, Nathalie Henry Riche, Alicia Wang, Krzysztof Gajos, and Hanspeter Pfister, 2019. DataSelfie: Empowering People to Design Personalized Visuals to Represent Their Data. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems ACM, 79.",
      "doi": "10.1145/3290605.3300309"
    },
    {
      "text": "Yong Ming Kow, 2018. Digital Introspection Within Learning-on-my-Own Rhetoric Among Computer Gamers. Mind, Culture, and Activity 25, 1, 40-52.",
      "doi": ""
    },
    {
      "text": "Victor R Lee and Mary Briggs, 2014. Lessons learned from an initial effort to bring a quantified self meetup experience to a new demographic. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication ACM, 707-710.",
      "doi": "10.1145/2638728.2641321"
    },
    {
      "text": "Victor R Lee and Jonathan M Thomas, 2011. Integrating physical activity data technologies into elementary school classrooms. Educational Technology Research and Development 59, 6, 865-884.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi, 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI conference on human factors in computing systems ACM, 557-566.",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Stine Lomborg and Kirsten Frandsen, 2016. Self-tracking as communication. Information, Communication & Society 19, 7, 1015-1027.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton, 2014. Self-tracking cultures: towards a sociology of personal informatics. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design ACM, 77-86.",
      "doi": "10.1145/2686612.2686623"
    },
    {
      "text": "Ivana Matteucci, 2017. Information About Ourselves from Ourselves: Young Users of Wearable Technologies in Secondary School. European Journal Of Interdisciplinary Studies 9, 1, 42.",
      "doi": ""
    },
    {
      "text": "Kate C McLean, 2005. Late adolescent identity development: narrative meaning making and memory telling. Developmental psychology 41, 4, 683.",
      "doi": ""
    },
    {
      "text": "Mika Pantzar and Minna Ruckenstein, 2017. Living the metrics: Self-tracking and situated objectivity. DIGITAL HEALTH 3, 2055207617712590.",
      "doi": ""
    },
    {
      "text": "Alina Pommeranz, Christian Detweiler, Pascal Wiggers, and Catholijn M. Jonker, 2011. Self-reflection on personal values to support value-sensitive design. In Proceedings of the Proceedings of the 25th BCS Conference on Human-Computer Interaction (Newcastle-upon-Tyne, United Kingdom2011), BCS Learning & Development Ltd., 491–496.",
      "doi": ""
    },
    {
      "text": "May Britt Postholm, 2015. Methodologies in Cultural–Historical Activity Theory: The example of school-based development. Educational Research 57, 1, 43-58.",
      "doi": ""
    },
    {
      "text": "Kyrill Potapov and Paul Marshall, 2020. LifeMosaic: co-design of a personal informatics tool for youth. In Proceedings of the Interaction Design and Children Conference, 519-531.",
      "doi": ""
    },
    {
      "text": "Emma; Lewis Rich, Sarah; Lupton, Deborah; Miah, Andy; Piwek, Lukasz, 2020. Digital Health Generation?: Young People's Use of ‘Healthy Lifestyle’ Technologies. University of Bath.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers, 2014. Personal tracking as lived informatics. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems ACM, 1163-1172.",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Gianine D Rosenblum and Michael Lewis, 2003. Emotional development in adolescence.",
      "doi": ""
    },
    {
      "text": "Harvey Sacks, 1995. Lectures on Conversation (Published by von Gail Jefferson), Volume 2. Malden Oxford, Victoria: Blackwell Publishing, p.195.",
      "doi": ""
    },
    {
      "text": "Sara E Schaefer, Cynthia Carter Ching, Heather Breen, and J Bruce German, 2016. Wearing, thinking, and moving: testing the feasibility of fitness tracking with urban youth. American Journal of Health Education 47, 1, 8-16.",
      "doi": ""
    },
    {
      "text": "Courtney C Simpson and Suzanne E Mazzeo, 2017. Calorie counting and fitness tracking technology: Associations with eating disorder symptomatology. Eating behaviors 26, 89-92.",
      "doi": ""
    },
    {
      "text": "Steven Sommer and Joe Polman, 2018. From Quantified Self to Building a More Fit Community; Data Tracking and Science Infographics as Boundary Objects. Rethinking learning in the digital age: Making the Learning Sciences count, 13th International Conference of the Learning Sciences (ICLS) 2, 1001-1004.",
      "doi": ""
    },
    {
      "text": "Amy Stornaiuolo, 2020. Authoring Data Stories in a Media Makerspace: Adolescents Developing Critical Data Literacies. Journal of the Learning Sciences 29, 1 (2020/01/01), 81-103. DOI= http://dx.doi.org/10.1080/10508406.2019.1689365.",
      "doi": ""
    },
    {
      "text": "Melanie Swan, 2012. Sensor mania! the internet of things, wearable computing, objective metrics, and the quantified self 2.0. Journal of Sensor and Actuator Networks 1, 3, 217-253.",
      "doi": ""
    },
    {
      "text": "Patrick Timpel, Fernando Henpin Yue Cesena, Christiane da Silva Costa, Matheus Dorigatti Soldatelli, Emanuel Gois, Eduardo Castrillon, Lina Johana Jaime Díaz, Gabriela M. Repetto, Fanah Hagos, Raul E. Castillo Yermenos, Kevin Pacheco-Barrios, Wafaa Musallam, Zilda Braid, Nesreen Khidir, Marcela Romo Guardado, and Roberta Muriel Longo Roepke, 2018. Efficacy of gamification-based smartphone application for weight loss in overweight and obese adolescents: study protocol for a phase II randomized controlled trial. Therapeutic Advances in Endocrinology and Metabolism 9, 6 (2018/06/01), 167-176. DOI= http://dx.doi.org/10.1177/2042018818770938.",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, James Colley, and Ewa Luger, 2016. “This has to be the cats” Personal Data Legibility in Networked Sensing Systems. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing, 491-502.",
      "doi": "10.1145/2818048.2819992"
    },
    {
      "text": "Nikolai Veresov, 2017. The concept of perezhivanie in cultural-historical theory: Content and contexts. In Perezhivanie, Emotions and Subjectivity Springer, 47-70.",
      "doi": ""
    },
    {
      "text": "Lev S Vygotsky, 1987. The collected works of LS Vygotsky: Volume 1: Problems of general psychology, including the volume Thinking and Speech. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Kate Weiner, Flis Henwood, Catherine Will, and Rosalind Williams, 2017. Self-monitoring for health: Questions for an emerging field. Available at SSRN 3051201.",
      "doi": ""
    },
    {
      "text": "Slavoj Žižek, 2012. Less than nothing: Hegel and the shadow of dialectical materialism. Verso Books.",
      "doi": ""
    }
  ]
}