{
  "doi": "10.1145/3411764.3445102",
  "title": "Beyond Kant and Bentham: How Ethical Theories are being used in Artificial Moral Agents",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "From robots to autonomous vehicles, the design of artificial moral agents (AMAs) is an area of growing interest to HCI, and rising concern for the implications of deploying moral machines raises questions about which ethical frameworks are being used in AMAs. We performed a literature review to identify and synthesize key themes in how ethical theories have been applied to AMAs. We reviewed 53 papers and performed a thematic analysis to describe and synthesize the current conversation across HCI. We found many describe the value of ethical theories and implement them as technical contributions, but very few conduct empirical studies in real settings. Furthermore, we found AMA development is dominated by two ethical theories: deontology and consequentialism. We argue that the focus on deontology and consequentialism risks creating AMAs based on a narrow set of Western ethical values and concepts at the expense of other forms of moral reasoning.",
  "authors": [
    {
      "name": "John Zoshak",
      "institution": "Human Centered Design and Engineering University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701544",
      "orcid": "missing"
    },
    {
      "name": "Kristin Dew",
      "institution": "Human Centered Design & Engineering University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557055656",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Madeline Akrich. 1992. The De-Scription of Technical Objects. In Bijker, WE. Law, J.(eds) Shaping technology/building society, MIT Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Fahad Alaieri and André Vellino. 2016. Ethical Decision Making in Robots: Autonomy, Trust and Responsibility. In: Agah A., Cabibihan JJ., Howard A., Salichs M., He H. (eds) Social Robotics. ICSR 2016. Lecture Notes in Computer Science, vol 9979. Springer, Cham. https://doi.org/10.1007/978-3-319-47437-3_16",
      "doi": ""
    },
    {
      "text": "Colin Allen, Iva Smit, and Wendell Wallach. 2005. Artificial Morality: Top-down, Bottom-up, and Hybrid Approaches. Ethics and Inf. Technol. 7, 3 (September 2005), 149–155. DOI: https://doi.org/10.1007/s10676-006-0004-4",
      "doi": "10.1007/s10676-006-0004-4"
    },
    {
      "text": "Colin Allen, Gary Varner, and Jason Zinse. 2000. Prolegomena to any future artificial moral agent. J. Exp. Theor. Artif. Intell.. 12. 251-261. 10.1080/09528130050111428",
      "doi": ""
    },
    {
      "text": "Michael Anderson, Susan Leigh Anderson and Vincent Berenz. 2017. A Value Driven Agent: Instantiation of a Case-Supported Principle-Based Behavior Paradigm. In: AAAI 2016 Workshop on AI, Ethics & Society",
      "doi": ""
    },
    {
      "text": "Michael Anderson and Susan Leigh Anderson. 2014. GenEth: a general ethical dilemma analyzer. Paladyn, Journal of Behavioral Robotics, 9, 337 - 357.",
      "doi": ""
    },
    {
      "text": "Michael Anderson and Susan Leigh Anderson. 2014. Toward Ethical Intelligent Autonomous Healthcare Agents: A Case-Supported Principle-Based Behavior Paradigm. AISB 2014 - 50th Annual Convention of the AISB. ",
      "doi": ""
    },
    {
      "text": "Michael Anderson and Susan Leigh Anderson. 2008. ETHEL: Toward a Principled Ethical Eldercare Robot. In: Procs. AAAI Fall 2008 Symposium on AI in Eldercare (2008).",
      "doi": ""
    },
    {
      "text": "Susan Leigh Anderson and Michael Anderson. 2011. A prima facie duty approach to machine ethics and its application to elder care. In Proceedings of the 12th AAAI Conference on Human-Robot Interaction in Elder Care (AAAIWS'11-12). AAAI Press, 2–7.",
      "doi": "10.5555/2908724.2908725"
    },
    {
      "text": "Michael Anderson, Susan Leigh Anderson and Chris Armen. 2006. \"An Approach to Computing Ethics,\" in IEEE Intelligent Systems, vol. 21, no. 4, pp. 56-63, July-Aug. 2006, doi: 10.1109/MIS.2006.64.",
      "doi": "10.1109/MIS.2006.64"
    },
    {
      "text": "Michael Anderson, Susan Leigh Anderson, and Chris Armen. 2005. Towards machine ethics: Implementing two action-based ethical theories. AAAI Fall Symposium – Technical Report 1-7.",
      "doi": ""
    },
    {
      "text": "Konstantine Arkoudas, Selmer Bringsjord, and Paul Bello. 2005. Toward ethical robots via mechanized deontic logic. AAAI Fall Symposium - Technical Report.",
      "doi": ""
    },
    {
      "text": "Thomas Arnold and Matthias Scheutz. 2017. Beyond Moral Dilemmas: Exploring the Ethical Landscape in HRI. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). Association for Computing Machinery, New York, NY, USA, 445–452. DOI: https://doi.org/10.1145/2909824.3020255",
      "doi": "10.1145/2909824.3020255"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). Association for Computing Machinery, New York, NY, USA, 1301–1310. DOI:https://doi-org.offcampus.lib.washington.edu/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Ruha Benjamin. 2019. Race after Technology : Abolitionist Tools for the New Jim Code. Cambridge, UK ; Medford, MA: Polity",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett and Os Keyes. 2020. What is the point of fairness? disability, AI and the complexity of justice. SIGACCESS Access. Comput., 125, Article 5 (October 2019), 1 pages. DOI:https://doi-org.offcampus.lib.washington.edu/10.1145/3386296.3386301",
      "doi": "10.1145/3386296.3386301"
    },
    {
      "text": "Jeremy Bentham. 2007. An Introduction to the Principles of Morals and Legislation. Dover Press. (originally published in 1789, of course).",
      "doi": ""
    },
    {
      "text": "Martin Bentzen The Principle of Double Effect Applied to Ethical Dilemmas of Social Robots. Robophilosophy/TRANSOR (2016). doi: 10.3233/978-1-61499-708-5-268",
      "doi": ""
    },
    {
      "text": "Martin Bentzen and Felix Lindner. 2018. A Formalization of Kant's Second Formulation of the Categorical Imperative. In the proceedings of AIES 2018.",
      "doi": ""
    },
    {
      "text": "Wiebe E Bijker, Thomas P Hughes, and Trevor Pinch, (Eds.). 2012. The social construction of technological systems: New directions in the sociology and history of technology. MIT press.",
      "doi": ""
    },
    {
      "text": "Fiona Berreby, Gauvain Bourgne, and Jean-Gabriel Ganascia. 2017. A Declarative Modular Framework for Representing and Applying Ethical Principles. In Proceedings of the 16th Conference on Autonomous Agents and MultiAgent Systems (AAMAS '17). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 96–104.",
      "doi": "10.5555/3091125.3091145"
    },
    {
      "text": "Fiona Berreby, Gauvain Bourgne, and Jean-Gabriel Ganascia. 2015. Modelling Moral Reasoning and Ethical Responsibility with Logic Programming. In: Davis M., Fehnker A., McIver A., Voronkov A. (eds) Logic for Programming, Artificial Intelligence, and Reasoning. LPAR 2015. Lecture Notes in Computer Science, vol 9450. Springer, Berlin, Heidelberg. https://doi.org/10.1007/978-3-662-48899-7_37",
      "doi": "10.1007/978-3-662-48899-7_37"
    },
    {
      "text": "Adil Bilal, Stephen Wingreen, and Ravishankar Sharma. 2020. Virtue Ethics as a Solution to the Privacy Paradox and Trust in Emerging Technologies. In Proceedings of the 2020 The 3rd International Conference on Information Science and System (ICISS 2020). Association for Computing Machinery, New York, NY, USA, 224–228. DOI: https://doi.org/10.1145/3388176.3388196",
      "doi": "10.1145/3388176.3388196"
    },
    {
      "text": "Susanne Bødker, Pelle Ehn, Dan Sjögren, and Yngve Sundblad. 2000. Co-operative Design—perspectives on 20 years with ‘the Scandinavian IT Design Model’. In proceedings of NordiCHI (Vol. 2000, pp. 22-24).",
      "doi": ""
    },
    {
      "text": "Jean-Fran¸cois Bonnefon, Azim Shariff, and Iyad Rahwan. 2015. Autonomous Vehicles Need Experimental Ethics: Are We Ready for Utilitarian Cars?",
      "doi": ""
    },
    {
      "text": "Vincent Bonnemains, Claire Saurel, and Catherine Tessier. 2018. Embedded ethics: some technical and ethical challenges. Ethics and Inf. Technol. 20, 1 (March 2018), 41–58.",
      "doi": ""
    },
    {
      "text": "Selmer Bringsjord, Konstantine Arkoudas and Paul Bello, \"Toward a General Logicist Methodology for Engineering Ethically Correct Robots,\" in IEEE Intelligent Systems, vol. 21, no. 4, pp. 38-44, July-Aug. 2006, doi: 10.1109/MIS.2006.82.",
      "doi": ""
    },
    {
      "text": "José-Antonio Cervantes, Sonia López, Luis-Felipe Rodríguez, Salvador Cervantes, Francisco Cervantes, and Félix Ramos. 2020. Artificial Moral Agents: A Survey of the Current Status. Sci Eng Ethics. 2020;26(2):501-532. doi:10.1007/s11948-019-00151-x",
      "doi": ""
    },
    {
      "text": "José-Antonio Cervantes, Luis-Felipe Rodríguez, Sonia López, Félix Ramos and Francisco Robles. 2016. Autonomous Agents and Ethical Decision-Making. Cogn Comput 8, 278–296 (2016). https://doi.org/10.1007/s12559-015-9362-8",
      "doi": ""
    },
    {
      "text": "Nicolas Cointe, Grégory Bonnet, and Olivier Boissier. 2016. Ethical Judgment of Agents' Behaviors in Multi-Agent Systems. In Proceedings of the 2016 International Conference on Autonomous Agents & Multiagent Systems (AAMAS '16). International Foundation for Autonomous Agents and Multiagent Systems, Richland, SC, 1106–1114.",
      "doi": "10.5555/2936924.2937086"
    },
    {
      "text": "Morteza Dehghani, Emmett Tomai, and Matthew Klenk. 2008. An Integrated Reasoning Approach to Moral Decision-Making. Proceedings of the Twenty-Third AAAI Conference on Artificial Intelligence, AAAI 2008, Chicago, Illinois, USA, July 13-17, 2008. 1280-1286. 10.1017/CBO9780511978036.024. ",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). Association for Computing Machinery, New York, NY, USA, 1975–1984. DOI:https://doi-org.offcampus.lib.washington.edu/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Paul Dourish. 2017. The Stuff of Bits. MIT Press.",
      "doi": ""
    },
    {
      "text": "Sjur Dyrkolbotn, Truls Pedersen, and Marija Slavkovik. 2018. On the Distinction between Implicit and Explicit Ethical Agency. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society (AIES '18). Association for Computing Machinery, New York, NY, USA, 74–80. DOI:https://doi.org/10.1145/3278721.3278769",
      "doi": "10.1145/3278721.3278769"
    },
    {
      "text": "Pelle Ehn. 1993. Scandinavian design: On participation and skill. Participatory design: Principles and practices, 41, 77.",
      "doi": ""
    },
    {
      "text": "Pablo G. Esteban, Daniel Hernández García, Hee Rin Lee, Pauline Chevalier, Paul Baxter, and Cindy Bethel. 2018. Social Robots in Therapy: Focusing on Autonomy and Ethical Challenges. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (HRI '18). Association for Computing Machinery, New York, NY, USA, 391–392. DOI: https://doi.org/10.1145/3173386.3173562",
      "doi": "10.1145/3173386.3173562"
    },
    {
      "text": "Bernice Fisher and Joan C. Tronto (1990). Toward a Feminist Theory of Caring. In Circles of Care: Work and identity in women's lives, pp. 35-62.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. 2017. Social Justice and Design: Power and oppression in collaborative systems. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (CSCW '17 Companion). Association for Computing Machinery, New York, NY, USA, 117–122. DOI: https://doi-org.offcampus.lib.washington.edu/10.1145/3022198.3022201",
      "doi": "10.1145/3022198.3022201"
    },
    {
      "text": "Batya Friedman and David Hendry. 2019. Value Sensitive Deisgn. The MIT Press. ",
      "doi": ""
    },
    {
      "text": "Batya Friedman and Helen Nissenbaum. 1997. Software agents and user autonomy. In Proceedings of the first international conference on Autonomous agents (AGENTS '97). Association for Computing Machinery, New York, NY, USA, 466–469. DOI: https://doi-org.offcampus.lib.washington.edu/10.1145/267658.267772",
      "doi": "10.1145/267658.267772"
    },
    {
      "text": "Jean-Gabriel Ganascia. 2015. Non-monotonic Resolution of Conflicts for Ethical Reasoning. In: Trappl R. (eds) A Construction Manual for Robots' Ethical Systems. Cognitive Technologies. Springer, Cham. https://doi.org/10.1007/978-3-319-21548-8_6",
      "doi": ""
    },
    {
      "text": "James Gips. 1995. Towards the Ethical Robot, in K. Ford, C. Glymour and P. Hayes, ed., Android Epistemology, Cambridge MA: MIT Press, pp. 243–252.",
      "doi": ""
    },
    {
      "text": "Naveen Sundar Govindarajulu, Selmer Bringsjord, Rikhiya Ghosh, and Vasanth Sarathy. 2019. Toward the Engineering of Virtuous Machines. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (AIES '19). Association for Computing Machinery, New York, NY, USA, 29–35. DOI:https://doi.org/10.1145/3306618.3314256",
      "doi": "10.1145/3306618.3314256"
    },
    {
      "text": "Naveen Sundar Govindarajulu, Selmer Bringsjord, Rikhiya Ghosh, and Matthew Peveler 2019. Beyond the Doctrine of Double Effect: A Formal Model of True Self-sacrifice. In: Aldinhas Ferreira M., Silva Sequeira J., Singh Virk G., Tokhi M., E. Kadar E. (eds) Robotics and Well-Being. Intelligent Systems, Control and Automation: Science and Engineering, vol 95. Springer, Cham. https://doi.org/10.1007/978-3-030-12524-0_5",
      "doi": ""
    },
    {
      "text": "Naveen Sundar Govindarajulu, and Selmer Bringsjord. 2017. On Automating the Doctrine of Double Effect. In: Proceedings of the twenty-sixth international joint conference on artificial intelligence (IJCAI 2017), Melbourne, Australia, preprint available at this https://arxiv.org/abs/1703.08922",
      "doi": ""
    },
    {
      "text": "Christopher Grau. 2006. \"There Is No \"I\" in \"Robot\": Robots and Utilitarianism\" in IEEE Intelligent Systems, vol. 21, no. 04, pp. 52-55, 2006. doi: 10.1109/MIS.2006.81",
      "doi": "10.1109/MIS.2006.81"
    },
    {
      "text": "Joshua Greene, Francesca Rossi, John Tasioulas, Kristen Brent Venable, and Brian Williams. 2016. Embedding Ethical Principles in Collective Decision Support Systems. In the Advancement of Artificial Intelligence (AAAI) Conference on Artificial Intelligence. ",
      "doi": ""
    },
    {
      "text": "Marcello Guarini. 2012. Conative Dimensions of Machine Ethics: A Defense of Duty. IEEE Trans. Affect. Comput. 3, 4 (January 2012), 434–442. DOI: https://doi-org.offcampus.lib.washington.edu/10.1109/T-AFFC.2012.27",
      "doi": "10.1109/T-AFFC.2012.27"
    },
    {
      "text": "John N. Hooker and Tae Wan N. Kim. 2018. Toward Non-Intuition-Based Machine and Artificial Intelligence Ethics: A Deontological Approach Based on Modal Logic. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society (AIES '18). Association for Computing Machinery, New York, NY, USA, 130–136. DOI:https://doi.org/10.1145/3278721.3278753",
      "doi": ""
    },
    {
      "text": "Lily Hu. 2018. Justice Beyond Utility in Artificial Intelligence. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society (AIES '18). Association for Computing Machinery, New York, NY, USA, 368–369. DOI:https://doi.org/10.1145/3278721.3278798",
      "doi": "10.1145/3278721.3278798"
    },
    {
      "text": "Internet Encyclopedia of Philosophy. 2020. Ethics. Retrieved from: https://iep.utm.edu/ethics/",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). Association for Computing Machinery, New York, NY, USA, 1311–1320. DOI:https://doi-org.offcampus.lib.washington.edu/10.1145/1753326.1753522",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Michael James Heron and Pauline Belford. 2015. Fuzzy ethics: or how I learned to stop worrying and love the bot. SIGCAS Comput. Soc. 45, 4 (November 2015), 4–6. DOI: https://doi.org/10.1145/2856428.2856429",
      "doi": "10.1145/2856428.2856429"
    },
    {
      "text": "Sophie Jentzsch, Patrick Schramowski, Constantin Rothkopf, and Kristian Kersting. 2019. Semantics Derived Automatically from Language Corpora Contain Human-like Moral Choices. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (AIES '19). Association for Computing Machinery, New York, NY, USA, 37–44. DOI:https://doi-org.offcampus.lib.washington.edu/10.1145/3306618.3314267",
      "doi": "10.1145/3306618.3314267"
    },
    {
      "text": "Deborah G. Johnson and Keith W. Miller. 2008. Un-making artificial moral agents. Ethics and Inf. Technol. 10, 2–3 (September 2008), 123–133. DOI:https://doi.org/10.1007/s10676-008-9174-6",
      "doi": "10.1007/s10676-008-9174-6"
    },
    {
      "text": "Imanuel Kant. 2012. The Moral Law: Groundwork of the Metaphysic of Morals. Routledge Classics. Routledge (originally published in 1785, of course).",
      "doi": ""
    },
    {
      "text": "Os Keyes, Jevan Hutson, and Meredith Durbin. 2019. A Mulching Proposal: Analysing and Improving an Algorithmic System for Turning the Elderly into High-Nutrient Slurry. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA '19). Association for Computing Machinery, New York, NY, USA, Paper alt06, 1–11. DOI: https://doi.org/10.1145/3290607.3310433",
      "doi": "10.1145/3290607.3310433"
    },
    {
      "text": "Richard Kim, Max Kleiman-Weiner, Andrés Abeliuk, Edmond Awad, Sohan Dsouza, Joshua B. Tenenbaum, and Iyad Rahwan. 2018. A Computational Model of Commonsense Moral Decision Making. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society (AIES '18). Association for Computing Machinery, New York, NY, USA, 197–203. DOI:https://doi.org/10.1145/3278721.3278770",
      "doi": "10.1145/3278721.3278770"
    },
    {
      "text": "Wilhelm E. J. Klein. 2016. Robots make ethics honest: and vice versa. SIGCAS Comput. Soc. 45, 3 (September 2015), 261–269. DOI: https://doi.org/10.1145/2874239.2874276",
      "doi": "10.1145/2874239.2874276"
    },
    {
      "text": "Benjamin Kuipers. 2018. How can we trust a robot? Commun. ACM 61, 3 (March 2018), 86–95. DOI:https://doi.org/10.1145/3173087",
      "doi": "10.1145/3173087"
    },
    {
      "text": "Liz Lane. 2016. Ethics of Activist Design: Designing a Technical Communication Pedagogy Grounded in Civic Engagement Activism. In Proceedings of the 34th ACM International Conference on the Design of Communication (SIGDOC '16). Association for Computing Machinery, New York, NY, USA, Article 54, 1. DOI: https://doi.org/10.1145/2987592.2987655",
      "doi": "10.1145/2987592.2987655"
    },
    {
      "text": "Bruno LaTour. 1992. Where are the Missing Masses, sociology of a few mundane artefacts. In Shaping Technology-Building Society. Studies in Sociotechnical Change, Wiebe Bijker and John Law (editors), MIT Press, Cambridge Mass. pp. 225-259, 1992 [new expanded and revised version of article (35). Republication in the reader Johnson, Deborah J., and Jameson M Wetmore, eds. Technology and Society, Building Our Sociotechnical Future. Cambridge, Mass: MIT Press, 2008 pp. 151-180]",
      "doi": ""
    },
    {
      "text": "Felix Lindner and Martin Mose Bentzen. 2017. The Hybrid Ethical Reasoning Agent IMMANUEL. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (HRI '17). Association for Computing Machinery, New York, NY, USA, 187–188. DOI:https://doi.org/10.1145/3029798.3038404",
      "doi": "10.1145/3029798.3038404"
    },
    {
      "text": "F. Lindner, M. M. Bentzen and B. Nebel, \"The HERA approach to morally competent robots,\" 2017 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS), Vancouver, BC, 2017, pp. 6991-6997, doi: 10.1109/IROS.2017.8206625.",
      "doi": ""
    },
    {
      "text": "Suvradip Maitra. 2020. Artificial Intelligence and Indigenous Perspectives: Protecting and Empowering Intelligent Human Beings. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society (AIES '20). Association for Computing Machinery, New York, NY, USA, 320–326. DOI:https://doi.org/10.1145/3375627.3375845",
      "doi": "10.1145/3375627.3375845"
    },
    {
      "text": "Donald McMillan and Barry Brown. 2019. Against Ethical AI. In Proceedings of the Halfway to the Future Symposium 2019 (HTTF 2019). Association for Computing Machinery, New York, NY, USA, Article 9, 1–3. DOI:https://doi.org/10.1145/3363384.3363393",
      "doi": "10.1145/3363384.3363393"
    },
    {
      "text": "John Stuart Mill. 2002. Utilitarianism. Hackett Publishing Company, Inc.; Second Edition. (originally published in 1863, of course).",
      "doi": ""
    },
    {
      "text": "Darakhshan Mir, Iris Howley, Janet Davis, Evan Peck, and Deborah Tatar. 2019. Make and Take an Ethics Module: Ethics Across the CS Curriculum. In Proceedings of the 50th ACM Technical Symposium on Computer Science Education (SIGCSE '19). Association for Computing Machinery, New York, NY, USA, 1239. DOI: https://doi.org/10.1145/3287324.3287543",
      "doi": "10.1145/3287324.3287543"
    },
    {
      "text": "Alexander G. Mirnig and Alexander Meschtscherjakov. 2019. Trolled by the Trolley Problem: On What Matters for Ethical Decision Making in Automated Vehicles. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI '19). Association for Computing Machinery, New York, NY, USA, Paper 509, 1–10. DOI: https://doi.org/10.1145/3290605.3300739",
      "doi": ""
    },
    {
      "text": "Luís Moniz Pereira and Ari Saptawijaya. 2007. Modelling morality with prospective logic. In Proceedings of the aritficial intelligence 13th Portuguese conference on Progress in artificial intelligence (EPIA'07). Springer-Verlag, Berlin, Heidelberg, 99–111.",
      "doi": "10.5555/1782254.1782264"
    },
    {
      "text": "Alistair Morrison, Donald McMillan, and Matthew Chalmers. 2014. Improving consent in large scale mobile HCI through personalised representations of data. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (NordiCHI '14). Association for Computing Machinery, New York, NY, USA, 471–480. DOI: https://doi.org/10.1145/2639189.2639239",
      "doi": "10.1145/2639189.2639239"
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O'Donnell, and John Vines. 2015. Situational Ethics: Re-thinking Approaches to Formal Ethics Requirements for Human-Computer Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 105–114. DOI: https://doi.org/10.1145/2702123.2702481",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "New York Times. 2018. Self-Driving Uber Car Kills Pedestrian in Arizona, Where Robots Roam. Retrieved from: https://www.nytimes.com/2018/03/19/technology/uber-driverless-fatality.html#:∼:text=The%20company%20quickly%20suspended%20testing%20in%20Tempe%20as,Newly%20released%20video%20offers%20clues%20about%20what%20happened",
      "doi": ""
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D.R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI '20). Association for Computing Machinery, New York, NY, USA, 1–16. DOI: https://doi-org.offcampus.lib.washington.edu/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "James E. Pickering, Patricia Ashman, Alex Gilbert, Dobrila Petrovic, Kevin Warwick and Keith. J. Burnham. 2018. Model-to-Decision Approach for Autonomous Vehicle Convoy Collision Ethics. 2018 UKACC 12th International Conference on Control (CONTROL), Sheffield, 2018, pp. 301-308, doi: 10.1109/CONTROL.2018.8516846.",
      "doi": ""
    },
    {
      "text": "Thomas M. Powers. 2006. Prospects for a Kantian Machine, in IEEE Intelligent Systems, vol. 21, no. 4, pp. 46-51, July-Aug. 2006, doi: 10.1109/MIS.2006.77.",
      "doi": "10.1109/MIS.2006.77"
    },
    {
      "text": "ProPublica. 2016. How We Analyzed the COMPAS Recidivism Algorithm. Retrieved from: https://www.propublica.org/article/how-we-analyzed-the-compas-recidivism-algorithm",
      "doi": ""
    },
    {
      "text": "Anna Vartapetiance Samlasi and Lee Gillam. 2009. Machine Ethics for Metaverse Gambling: No Stake in a $24m Market?, 2009 Conference in Games and Virtual Worlds for Serious Applications. Coventry pp. 209-212, doi: 10.1109/VS-GAMES.2009.39.",
      "doi": ""
    },
    {
      "text": "Katie Shilton. 2018. Values and Ethics in Human-Computer Interaction. Now Publishing. ",
      "doi": ""
    },
    {
      "text": "Katie Shilton and Jes A. Koepfler. 2013. Making space for values: communication & values levers in a virtual team. In Proceedings of the 6th International Conference on Communities and Technologies (C&T '13). Association for Computing Machinery, New York, NY, USA, 110–119. DOI: https://doi.org/10.1145/2482991.2482993",
      "doi": ""
    },
    {
      "text": "Stanford Encyclopedia of Philosophy. 2019. Consequentialism. Retrieved from: https://plato.stanford.edu/entries/consequentialism/",
      "doi": ""
    },
    {
      "text": "Stanford Encyclopedia of Philosophy. 2018. Chinese Ethics. Retrieved from: https://plato.stanford.edu/entries/ethics-chinese/ ",
      "doi": ""
    },
    {
      "text": "Stanford Encyclopedia of Philosopjy. 2018. Doctrine of Double Effect. Retrieved from: https://plato.stanford.edu/entries/double-effect/",
      "doi": ""
    },
    {
      "text": "Stanford Encyclopedia of Philosophy. 2016. Virtue Ethics. Retrieved from: https://plato.stanford.edu/entries/ethics-virtue/",
      "doi": ""
    },
    {
      "text": "Stanford Encyclopedia of Philosophy. 2016. Kant's Moral Philosophy. Retrieved from: https://plato.stanford.edu/entries/kant-moral/",
      "doi": ""
    },
    {
      "text": "Stanford Encyclopedia of Philosophy. 2016. Deontological Ethics. Retrieved from: https://plato.stanford.edu/entries/ethics-deontological/",
      "doi": ""
    },
    {
      "text": "Stanford Encyclopedia of Philosophy. 2012. William David Ross. Retrieved from: https://plato.stanford.edu/entries/william-david-ross/",
      "doi": ""
    },
    {
      "text": "Julia Stoyanovich, Bill Howe, Serge Abiteboul, Gerome Miklau, Arnaud Sahuguet, and Gerhard Weikum. 2017. Fides: Towards a Platform for Responsible Data Science. In Proceedings of the 29th International Conference on Scientific and Statistical Database Management (SSDBM '17). Association for Computing Machinery, New York, NY, USA, Article 26, 1–6. DOI: https://doi.org/10.1145/3085504.3085530",
      "doi": "10.1145/3085504.3085530"
    },
    {
      "text": "Petros Terzis. 2020. Onward for the freedom of others: marching beyond the AI ethics. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency (FAT* '20). Association for Computing Machinery, New York, NY, USA, 220–229. DOI:https://doi.org/10.1145/3351095.3373152",
      "doi": ""
    },
    {
      "text": "Ryan Tonkens. 2009. A Challenge for Machine Ethics. Minds Mach. 19, 3 (August 2009), 421–438. DOI:https://doi.org/10.1007/s11023-009-9159-1",
      "doi": "10.1007/s11023-009-9159-1"
    },
    {
      "text": "Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 629–638. DOI: https://doi-org.offcampus.lib.washington.edu/10.1145/2702123.2702522",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Peter-Paul Verbeek. 2006. Materializing morality: Design ethics and technological mediation. Science, Technology, & Human Values, 31(3), 361-380.",
      "doi": ""
    },
    {
      "text": "Ilse Verdiesen. 2018. The Design of Human Oversight in Autonomous Weapon Systems. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society (AIES '18). Association for Computing Machinery, New York, NY, USA, 388–389. DOI: https://doi.org/10.1145/3278721.3278785",
      "doi": "10.1145/3278721.3278785"
    },
    {
      "text": "Laura Wächter and Felix Lindner. 2018. An Explorative Comparison of Blame Attributions to Companion Robots Across Various Moral Dilemmas. In Proceedings of the 6th International Conference on Human-Agent Interaction (HAI '18). Association for Computing Machinery, New York, NY, USA, 269–276. DOI:https://doi.org/10.1145/3284432.3284463",
      "doi": "10.1145/3284432.3284463"
    },
    {
      "text": "Wendell Wallach and Colin Allen. 2009. Moral Machines: Teaching Robots Right from Wrong. Oxford University Press.",
      "doi": "10.5555/1522444"
    },
    {
      "text": "Ruchen Wen, Blake Jackson, Tom Williams, and Qin Zhu. Towards a role ethics approach to command rejection. In HRI Workshop on the Dark Side of Human-Robot Interaction. 2019.",
      "doi": ""
    },
    {
      "text": "Jess Whittlestone, Rune Nyrup, Anna Alexandrova, and Stephen Cave. 2019. The Role and Limits of Principles in AI Ethics: Towards a Focus on Tensions. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (AIES '19). Association for Computing Machinery, New York, NY, USA, 195–200. DOI: https://doi.org/10.1145/3306618.3314289",
      "doi": "10.1145/3306618.3314289"
    },
    {
      "text": "Vincent Wiegel and Jan van den Berg. 2009. Combining Moral Theory, Modal Logic and Mas to Create Well-Behaving Artificial Agents. Int J of Soc Robotics 1, 233–242 (2009). https://doi.org/10.1007/s12369-009-0023-5",
      "doi": ""
    },
    {
      "text": "Tom Williams, Qin Zhu, Ruchen Wen, and Ewart J. de Visser. 2020. The Confucian Matador: Three Defenses Against the Mechanical Bull. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction (HRI '20). Association for Computing Machinery, New York, NY, USA, 25–33. DOI:https://doi.org/10.1145/3371382.3380740",
      "doi": ""
    },
    {
      "text": "Ava Thomas Wright. 2020. A Deontic Logic for Programming Rightful Machines. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society (AIES '20). Association for Computing Machinery, New York, NY, USA, 392. DOI:https://doi.org/10.1145/3375627.3375867",
      "doi": "10.1145/3375627.3375867"
    },
    {
      "text": "Ava Thomas Wright. 2019. Rightful Machines and Dilemmas. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (AIES '19). Association for Computing Machinery, New York, NY, USA, 3–4. DOI: https://doi-org.offcampus.lib.washington.edu/10.1145/3306618.3314261",
      "doi": "10.1145/3306618.3314261"
    },
    {
      "text": "Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 629–638. DOI: https://doi-org.offcampus.lib.washington.edu/10.1145/2702123.2702522",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Levent Yilmaz. 2017. Verification and validation of ethical decision-making in autonomous systems. In Proceedings of the Symposium on Modeling and Simulation of Complexity in Intelligent, Adaptive and Autonomous Systems (MSCIAAS '17). Society for Computer Simulation International, San Diego, CA, USA, Article 1, 1–12.",
      "doi": "10.5555/3108414.3108415"
    },
    {
      "text": "Meg Young, Luke Rodriguez, Emily Keller, Feiyang Sun, Boyang Sa, Jan Whittington, and Bill Howe. 2019. Beyond Open vs. Closed: Balancing Individual Privacy and Public Accountability in Data Sharing. In Proceedings of the Conference on Fairness, Accountability, and Transparency (FAT* '19). Association for Computing Machinery, New York, NY, USA, 191–200. DOI: https://doi.org/10.1145/3287560.3287577",
      "doi": "10.1145/3287560.3287577"
    },
    {
      "text": "Qin Zhu, Tom Williams, Blake Jackson, and Ruchen Wen. 2020. Blame-Laden Moral Rebukes and the Morally Competent Robot: A Confucian Ethical Perspective. Sci Eng Ethics (2020). https://doi.org/10.1007/s11948-020-00246-w",
      "doi": ""
    },
    {
      "text": "Qin Zhu, Tom Williams, and Ruchen Wen. 2019. Confucian robot ethics. In D. Wittkower (Ed.), 2019 Computer Ethics - Philosophical Enquiry (CEPE) Proceedings, (11 pp.). doi: 10.25884/5qbh-m581",
      "doi": ""
    }
  ]
}