{
  "doi": "10.1145/3411764.3445323",
  "title": "XRStudio: A Virtual Production and Live Streaming System for Immersive Instructional Experiences",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "There is increased interest in using virtual reality in education, but it often remains an isolated experience that is difficult to integrate into current instructional experiences. In this work, we adapt virtual production techniques from filmmaking to enable mixed reality capture of instructors so that they appear to be standing directly in the virtual scene. We also capitalize on the growing popularity of live streaming software for video conferencing and live production. With XRStudio, we develop a pipeline for giving lectures in VR, enabling live compositing using a variety of presets and real-time output to traditional video and more immersive formats. We present interviews with media designers experienced in film and MOOC production that informed our design. Through walkthrough demonstrations of XRStudio with instructors experienced with VR, we learn how it could be used in a variety of domains. In end-to-end evaluations with students, we analyze and compare differences of traditional video vs. more immersive lectures with XRStudio.",
  "authors": [
    {
      "name": "Michael Nebeling",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484640607",
      "orcid": "0000-0003-3743-2387"
    },
    {
      "name": "Shwetha Rajaram",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529394",
      "orcid": "0000-0001-7645-4488"
    },
    {
      "name": "Liwei Wu",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700936",
      "orcid": "missing"
    },
    {
      "name": "Yifei Cheng",
      "institution": "Swarthmore College Swarthmore College, Swarthmore, Pennsylvania, United States, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659476403",
      "orcid": "missing"
    },
    {
      "name": "Jaylin Herskovitz",
      "institution": "Computer Science & Engineering University of Michigan, United States",
      "img": "/do/10.1145/contrib-99659365819/rel-imgonly/me.jpeg",
      "acmid": "99659365819",
      "orcid": "0000-0002-9049-5056"
    }
  ],
  "references": [
    {
      "text": "Narges Ashtari, Andrea Bunt, Joanna McGrenere, Michael Nebeling, and Parmit K. Chilana. 2020. Creating Augmented and Virtual Reality Applications: Current Practices, Challenges, and Opportunities. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020, Regina Bernhaupt, Florian ‘Floyd’ Mueller, David Verweij, Josh Andres, Joanna McGrenere, Andy Cockburn, Ignacio Avellino, Alix Goguey, Pernille Bjøn, Shengdong Zhao, Briane Paul Samson, and Rafal Kocielnik (Eds.). ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376722",
      "doi": ""
    },
    {
      "text": "Jeremy N Bailenson, Nick Yee, Jim Blascovich, Andrew C Beall, Nicole Lundblad, and Michael Jin. 2008. The use of immersive virtual reality in the learning sciences: Digital transformations of teachers, students, and social context. The Journal of the Learning Sciences 17, 1 (2008), 102–141.",
      "doi": ""
    },
    {
      "text": "Catherine Ball and Kyle Johnsen. 2016. An accessible platform for everyday educational virtual reality. In 2nd IEEE Workshop on Everyday Virtual Reality, WEVR@VR 2016, Greenville, SC, USA, March 20, 2016. IEEE Computer Society, New York, NY, USA, 26–31. https://doi.org/10.1109/WEVR.2016.7859540",
      "doi": ""
    },
    {
      "text": "Liwei Chan and Kouta Minamizawa. 2017. FrontFace: facilitating communication between HMD users and outsiders using front-facing-screen HMDs. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2017, Vienna, Austria, September 4-7, 2017, Matt Jones, Manfred Tscheligi, Yvonne Rogers, and Roderick Murray-Smith (Eds.). ACM, New York, NY, USA, 22:1–22:5. https://doi.org/10.1145/3098279.3098548",
      "doi": "10.1145/3098279.3098548"
    },
    {
      "text": "Chih-Ming Chen and Chung-Hsin Wu. 2015. Effects of different video lecture types on sustained attention, emotion, cognitive load, and learning performance. Computers & Education 80 (2015), 108–121.",
      "doi": "10.1016/j.compedu.2014.08.015"
    },
    {
      "text": "Jiawen Chen, Shahram Izadi, and Andrew W. Fitzgibbon. 2012. KinÊtre: animating the world with the human body. In The 25th Annual ACM Symposium on User Interface Software and Technology, UIST ’12, Cambridge, MA, USA, October 7-10, 2012, Rob Miller, Hrvoje Benko, and Celine Latulipe(Eds.). ACM, New York, NY, USA, 435–444. https://doi.org/10.1145/2380116.2380171",
      "doi": "10.1145/2380116.2380171"
    },
    {
      "text": "Alan Cheng, Lei Yang, and Erik Andersen. 2017. Teaching Language and Culture with a Virtual Reality Game. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, Denver, CO, USA, May 06-11, 2017, Gloria Mark, Susan R. Fussell, Cliff Lampe, m. c. schraefel, Juan Pablo Hourcade, Caroline Appert, and Daniel Wigdor(Eds.). ACM, New York, NY, USA, 541–549. https://doi.org/10.1145/3025453.3025857",
      "doi": "10.1145/3025453.3025857"
    },
    {
      "text": "Kevin Chow, Caitlin Coyiuto, Cuong Nguyen, and Dongwook Yoon. 2019. Challenges and Design Considerations for Multimodal Asynchronous Collaboration in VR. Proc. ACM Hum. Comput. Interact. 3, CSCW (2019), 40:1–40:24. https://doi.org/10.1145/3359142",
      "doi": "10.1145/3359142"
    },
    {
      "text": "Charles Crook and Louise Schofield. 2017. The video lecture. The Internet and Higher Education 34 (2017), 56–64.",
      "doi": ""
    },
    {
      "text": "Mira Dontcheva, Gary D. Yngve, and Zoran Popovic. 2003. Layered acting for character animation. ACM Trans. Graph. 22, 3 (2003), 409–416. https://doi.org/10.1145/882262.882285",
      "doi": "10.1145/882262.882285"
    },
    {
      "text": "Thierry Duval and Cédric Fleury. 2009. An asymmetric 2D Pointer/3D Ray for 3D interaction within collaborative virtual environments. In Proceeding of the 14th International Conference on 3D Web Technology, Web3D 2009, Darmstadt, Germany, June 16-17, 2009, Stephen N. Spencer, Dieter W. Fellner, Johannes Behr, and Krzysztof Walczak (Eds.). ACM, New York, NY, USA, 33–41. https://doi.org/10.1145/1559764.1559769",
      "doi": "10.1145/1559764.1559769"
    },
    {
      "text": "Daniel Fällman, Anders Backman, and Kenneth Holmlund. 1999. VR in education: An introduction to multisensory constructivist learning environments. In Conference on University Pedagogy, Umea University, Umea, Sweden, February 18-19, 1999. Umea University, Umea, Sweden, 10.",
      "doi": ""
    },
    {
      "text": "Dustin E. R. Freeman, Stephanie Santosa, Fanny Chevalier, Ravin Balakrishnan, and Karan Singh. 2014. LACES: live authoring through compositing and editing of streaming video. In CHI Conference on Human Factors in Computing Systems, CHI’14, Toronto, ON, Canada - April 26 - May 01, 2014, Matt Jones, Philippe A. Palanque, Albrecht Schmidt, and Tovi Grossman (Eds.). ACM, New York, NY, USA, 1207–1216. https://doi.org/10.1145/2556288.2557304",
      "doi": "10.1145/2556288.2557304"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Julian Frommel, and Enrico Rukzio. 2017. ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, Denver, CO, USA, May 06-11, 2017, Gloria Mark, Susan R. Fussell, Cliff Lampe, m. c. schraefel, Juan Pablo Hourcade, Caroline Appert, and Daniel Wigdor (Eds.). ACM, New York, NY, USA, 4021–4033. https://doi.org/10.1145/3025453.3025683",
      "doi": "10.1145/3025453.3025683"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Harpreet Sareen, and Enrico Rukzio. 2018. FaceDisplay: Towards Asymmetric Multi-User Interaction for Nomadic Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, CHI 2018, Montreal, QC, Canada, April 21-26, 2018, Regan L. Mandryk, Mark Hancock, Mark Perry, and Anna L. Cox (Eds.). ACM, New York, NY, USA, 54. https://doi.org/10.1145/3173574.3173628",
      "doi": "10.1145/3173574.3173628"
    },
    {
      "text": "Philip J. Guo, Juho Kim, and Rob Rubin. 2014. How video production affects student engagement: an empirical study of MOOC videos. In First (2014) ACM Conference on Learning @ Scale, L@S 2014, Atlanta, GA, USA, March 4-5, 2014, Mehran Sahami, Armando Fox, Marti A. Hearst, and Michelene T. H. Chi (Eds.). ACM, New York, NY, USA, 41–50. https://doi.org/10.1145/2556325.2566239",
      "doi": "10.1145/2556325.2566239"
    },
    {
      "text": "Anna Hansch, Lisa Hillers, Katherine McConachie, Christopher Newman, Thomas Schildhauer, and J. Philipp Schmidt. 2015. Video and online learning: Critical reflections and findings from the field. HIIG Discussion Paper Series 2 (2015), 1–34.",
      "doi": ""
    },
    {
      "text": "John Hedberg and Shirley Alexander. 1994. Virtual Reality in Education: Defining Researchable Issues. Educational Media International 31, 4 (1994), 214–220. https://doi.org/10.1080/0952398940310402",
      "doi": ""
    },
    {
      "text": "Robert Held, Ankit Gupta, Brian Curless, and Maneesh Agrawala. 2012. 3D puppetry: a kinect-based interface for 3D animation. In The 25th Annual ACM Symposium on User Interface Software and Technology, UIST ’12, Cambridge, MA, USA, October 7-10, 2012, Rob Miller, Hrvoje Benko, and Celine Latulipe(Eds.). ACM, New York, NY, USA, 423–434. https://doi.org/10.1145/2380116.2380170",
      "doi": "10.1145/2380116.2380170"
    },
    {
      "text": "Sandra Helsel. 1992. Virtual Reality and Education. Educational Technology 32, 5 (1992), 38–42. http://www.jstor.org/stable/44425644",
      "doi": "10.5555/134958.134965"
    },
    {
      "text": "Roland Holm, Erwin Stauder, Roland R. Wagner, Markus Priglinger, and Jens Volkert. 2002. A Combined Immersive and Desktop Authoring Tool for Virtual Environments. In IEEE Virtual Reality Conference 2002, VR ’02, Orlando, Florida, USA, March 24-28, 2002, Proceedings. IEEE Computer Society, New York, NY, USA, 93–100. https://doi.org/10.1109/VR.2002.996511",
      "doi": ""
    },
    {
      "text": "Akira Ishii, Masaya Tsuruta, Ippei Suzuki, Shuta Nakamae, Tatsuya Minagawa, Junichi Suzuki, and Yoichi Ochiai. 2017. ReverseCAVE: providing reverse perspectives for sharing VR experience. In Special Interest Group on Computer Graphics and Interactive Techniques Conference, SIGGRAPH ’17, Los Angeles, CA, USA, July 30 - August 03, 2017, Posters Proceedings. ACM, New York, NY, USA, 28:1–28:2. https://doi.org/10.1145/3102163.3102208",
      "doi": "10.1145/3102163.3102208"
    },
    {
      "text": "G. Michael Lemole Jr., P. Pat Banerjee, Cristian Luciano, Sergey Neckrysh, and Fady T. Charbel. 2007. Virtual Reality in Neurosurgical Education: Part-task Ventriculostomy Simulation with Dynamic Visual and Haptic Feedback. Neurosurgery 61, 1 (07 2007), 142–149. https://doi.org/10.1227/01.neu.0000279734.22931.21arXiv:https://academic.oup.com/neurosurgery/article-pdf/61/1/142/24538719/00006123-200707000-00016.pdf",
      "doi": ""
    },
    {
      "text": "Hannes Kaufmann, Dieter Schmalstieg, and Michael G. Wagner. 2000. Construct3D: A Virtual Reality Application for Mathematics and Geometry Education. Educ. Inf. Technol. 5, 4 (2000), 263–276. https://doi.org/10.1023/A%3A1012049406877",
      "doi": "10.1023/A%3A1012049406877"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Fraser Anderson, George W. Fitzmaurice, Bjoern Hartmann, and Tovi Grossman. 2019. Loki: Facilitating Remote Instruction of Physical Tasks Using Bi-Directional Mixed-Reality Telepresence. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology, UIST 2019, New Orleans, LA, USA, October 20-23, 2019, François Guimbretière, Michael Bernstein, and Katharina Reinecke (Eds.). ACM, New York, NY, USA, 161–174. https://doi.org/10.1145/3332165.3347872",
      "doi": "10.1145/3332165.3347872"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Cuong Nguyen, Stephen DiVerdi, and Björn Hartmann. 2019. TutoriVR: A Video-Based Tutorial System for Design Applications in Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019, Stephen A. Brewster, Geraldine Fitzpatrick, Anna L. Cox, and Vassilis Kostakos (Eds.). ACM, New York, NY, USA, 284. https://doi.org/10.1145/3290605.3300514",
      "doi": "10.1145/3290605.3300514"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Cuong Nguyen, Stephen DiVerdi, and Bjoern Hartmann. 2020. TransceiVR: Bridging Asymmetrical Communication Between VR Users and External Collaborators. In UIST ’20: The 33rd Annual ACM Symposium on User Interface Software and Technology, Virtual Event, USA, October 20-23, 2020, Shamsi T. Iqbal, Karon E. MacLean, Fanny Chevalier, and Stefanie Mueller (Eds.). ACM, New York, NY, USA, 182–195. https://doi.org/10.1145/3379337.3415827",
      "doi": "10.1145/3379337.3415827"
    },
    {
      "text": "David Ledo, Steven Houben, Jo Vermeulen, Nicolai Marquardt, Lora Oehlberg, and Saul Greenberg. 2018. Evaluation Strategies for HCI Toolkit Research. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, CHI 2018, Montreal, QC, Canada, April 21-26, 2018, Regan L. Mandryk, Mark Hancock, Mark Perry, and Anna L. Cox (Eds.). ACM, New York, NY, USA, 36. https://doi.org/10.1145/3173574.3173610",
      "doi": "10.1145/3173574.3173610"
    },
    {
      "text": "Stefan Marks, David White, and Manpreet Singh. 2017. Getting up Your Nose: A Virtual Reality Education Tool for Nasal Cavity Anatomy. In SIGGRAPH Asia 2017 Symposium on Education (Bangkok, Thailand) (SA ’17). ACM, New York, NY, USA, Article 1, 7 pages. https://doi.org/10.1145/3134368.3139218",
      "doi": "10.1145/3134368.3139218"
    },
    {
      "text": "Zahira Merchant, Ernest T. Goetz, Lauren Cifuentes, Wendy Keeney-Kennicutt, and Trina J. Davis. 2014. Effectiveness of virtual reality-based instruction on students’ learning outcomes in K-12 and higher education: A meta-analysis. Comput. Educ. 70(2014), 29–40. https://doi.org/10.1016/j.compedu.2013.07.033",
      "doi": "10.5555/2753872.2753891"
    },
    {
      "text": "Michael Nebeling, Katy Lewis, Yu-Cheng Chang, Lihan Zhu, Michelle Chung, Piaoyang Wang, and Janet Nebeling. 2020. XRDirector: A Role-Based Collaborative Immersive Authoring System. In CHI ’20: CHI Conference on Human Factors in Computing Systems, Honolulu, HI, USA, April 25-30, 2020, Regina Bernhaupt, Florian ‘Floyd’ Mueller, David Verweij, Josh Andres, Joanna McGrenere, Andy Cockburn, Ignacio Avellino, Alix Goguey, Pernille Bjøn, Shengdong Zhao, Briane Paul Samson, and Rafal Kocielnik (Eds.). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376637",
      "doi": "10.1145/3313831.3376637"
    },
    {
      "text": "Michael Nebeling and Katy Madier. 2019. 360proto: Making Interactive Virtual Reality & Augmented Reality Prototypes from Paper. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019, Stephen A. Brewster, Geraldine Fitzpatrick, Anna L. Cox, and Vassilis Kostakos (Eds.). ACM, New York, NY, USA, 596. https://doi.org/10.1145/3290605.3300826",
      "doi": "10.1145/3290605.3300826"
    },
    {
      "text": "Sebastian Oberdörfer, David Heidrich, and Marc Erich Latoschik. 2019. Usability of Gamified Knowledge Learning in VR and Desktop-3D. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019, Stephen A. Brewster, Geraldine Fitzpatrick, Anna L. Cox, and Vassilis Kostakos (Eds.). ACM, New York, NY, USA, 175. https://doi.org/10.1145/3290605.3300405",
      "doi": "10.1145/3290605.3300405"
    },
    {
      "text": "Joseph Psotka. 1995. Immersive training systems: Virtual reality and education and training. Instructional Science 23, 5/6 (1995), 405–431. http://www.jstor.org/stable/23370939",
      "doi": ""
    },
    {
      "text": "Muhamad Izzat Rahim and Sarimah Shamsudin. 2019. Video Lecture Styles in MOOCs by Malaysian Polytechnics. In Proceedings of the 2019 3rd International Conference on Education and Multimedia Technology (Nagoya, Japan) (ICEMT 2019). ACM, New York, NY, USA, 64–68. https://doi.org/10.1145/3345120.3345169",
      "doi": "10.1145/3345120.3345169"
    },
    {
      "text": "George G. Robertson, Stuart K. Card, and Jock D. Mackinlay. 1993. Three views of virtual reality: nonimmersive virtual reality. Computer 26, 2 (1993), 81–. https://doi.org/10.1109/2.192002",
      "doi": "10.1109/2.192002"
    },
    {
      "text": "José Miguel Santos-Espino, María Dolores Afonso-Suárez, and Cayetano Guerra-Artal. 2016. Speakers and boards: A survey of instructional video styles in MOOCs. Technical Communication 63, 2 (2016), 101–115.",
      "doi": ""
    },
    {
      "text": "Nazmus Saquib, Rubaiat Habib Kazi, Li-Yi Wei, and Wilmot Li. 2019. Interactive Body-Driven Graphics for Augmented Video Performance. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019, Stephen A. Brewster, Geraldine Fitzpatrick, Anna L. Cox, and Vassilis Kostakos (Eds.). ACM, New York, NY, USA, 622. https://doi.org/10.1145/3290605.3300852",
      "doi": "10.1145/3290605.3300852"
    },
    {
      "text": "Christopher D. Wickens. 1992. Virtual reality and education. In Proceedings of the 1992 IEEE International Conference on Systems, Man, and Cybernetics, Vol. 1. IEEE, New York, NY, USA, 842–847. https://doi.org/10.1109/ICSMC.1992.271688",
      "doi": ""
    },
    {
      "text": "William Winn. 1993. A conceptual basis for educational applications of virtual reality.",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Sebastian Herscher, Ken Perlin, and Daniel Wigdor. 2018. Spacetime: Enabling Fluid Individual and Collaborative Editing in Virtual Reality. In The 31st Annual ACM Symposium on User Interface Software and Technology, UIST 2018, Berlin, Germany, October 14-17, 2018, Patrick Baudisch, Albrecht Schmidt, and Andy Wilson(Eds.). ACM, New York, NY, USA, 853–866. https://doi.org/10.1145/3242587.3242597",
      "doi": ""
    },
    {
      "text": "Kexin Yang, Xiaofei Zhou, and Iulian Radu. 2020. XR-Ed Framework: Designing Instruction-driven and Learner-centered Extended Reality Systems for Education. CoRR abs/2010.13779(2020), 1–21. arxiv:2010.13779https://arxiv.org/abs/2010.13779",
      "doi": ""
    },
    {
      "text": "Yu Zhu, Kang Zhu, Qiang Fu, Xilin Chen, Huixing Gong, and Jingyi Yu. 2016. SAVE: shared augmented virtual environment for real-time mixed reality applications. In Proceedings of the 15th ACM SIGGRAPH Conference on Virtual-Reality Continuum and Its Applications in Industry, VRCAI 2016, Zhuhai, China, December 3-4, 2016, Yiyu Cai and Daniel Thalmann (Eds.). ACM, New York, NY, USA, 13–21. https://doi.org/10.1145/3013971.3013979",
      "doi": "10.1145/3013971.3013979"
    }
  ]
}