{
  "doi": "10.1145/3411764.3445486",
  "title": "Reward Seeking or Loss Aversion?: Impact of Regulatory Focus Theory on Emotional Induction in Children and Their Behavior Towards a Social Robot",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "According to psychology research, emotional induction has positive implications in many domains such as therapy and education. Our aim in this paper was to manipulate the Regulatory Focus Theory to assess its impact on the induction of regulatory focus related emotions in children in a pretend play scenario with a social robot. The Regulatory Focus Theory suggests that people follow one of two paradigms while attempting to achieve a goal; by seeking gains (promotion focus - associated with feelings of happiness) or by avoiding losses (prevention focus - associated with feelings of fear). We conducted a study with 69 school children in two different conditions (promotion vs. prevention). We succeeded in inducing happiness emotions in the promotion condition and found a resulting positive effect of the induction on children’s social engagement with the robot. We also discuss the important implications of these results in both educational and child robot interaction fields.",
  "authors": [
    {
      "name": "Maha Elgarf",
      "institution": "KTH Royal Institute of Technology, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659363309",
      "orcid": "missing"
    },
    {
      "name": "Natalia Calvo-Barajas",
      "institution": "Department of Information Technology Uppsala Univesity, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659686530",
      "orcid": "missing"
    },
    {
      "name": "Ana Paiva",
      "institution": "INESC-ID, IST University of Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436595004",
      "orcid": "missing"
    },
    {
      "name": "Ginevra Castellano",
      "institution": "Social Robotics Lab Uppsala University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335488884",
      "orcid": "missing"
    },
    {
      "name": "Christopher Peters",
      "institution": "Embodied Social Agents Lab KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-81100523411/rel-imgonly/pic.jpg",
      "acmid": "81100523411",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kim Adams, Adriana Rios, Lina Becerra, and Paola Esquivel. 2015. Using robots to access play at different developmental levels for children with severe disabilities: a pilot study. In RESNA Conference. RESNA, Washington DC.",
      "doi": ""
    },
    {
      "text": "Ralph Adolphs, Daniel Tranel, S Hamann, Andrew W Young, Andrew J Calder, Elizabeth A Phelps, Al Anderson, Gregory P Lee, and Antonio R Damasio. 1999. Recognition of facial emotion in nine individuals with bilateral amygdala damage. Neuropsychologia 37, 10 (1999), 1111–1117.",
      "doi": ""
    },
    {
      "text": "Roxana Agrigoroaie, Stefan-Dan Ciocirlan, and Adriana Tapus. 2020. In the Wild HRI Scenario: Influence of Regulatory Focus Theory. Frontiers in Robotics and AI 7 (2020).",
      "doi": ""
    },
    {
      "text": "Helga Andresen. 2005. Role play and language development in the preschool years. Culture & Psychology 11, 4 (2005), 387–414.",
      "doi": ""
    },
    {
      "text": "Sean Andrist, Bilge Mutlu, and Adriana Tapus. 2015. Look like me: matching robot personality via gaze to increase motivation. In Proceedings of the 33rd annual ACM conference on human factors in computing systems (CHI ’15). ACM, New York, NY, USA, 3603–3612.",
      "doi": "10.1145/2702123.2702592"
    },
    {
      "text": "Matthijs Baas, Carsten KW De Dreu, and Bernard A Nijstad. 2008. A meta-analysis of 25 years of mood-creativity research: Hedonic tone, activation, or regulatory focus?Psychological bulletin 134, 6 (2008), 779.",
      "doi": ""
    },
    {
      "text": "Matthijs Baas, Carsten KW De Dreu, and Bernard A Nijstad. 2011. When prevention promotes creativity: The role of mood, regulatory focus, and regulatory closure.Journal of personality and social psychology 100, 5(2011), 794.",
      "doi": ""
    },
    {
      "text": "Roger Bakeman and Vicenç Quera. 2011. Sequential analysis and observational methods for the behavioral sciences. Cambridge University Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Linda Bell, Joakim Gustafson, and Mattias Heldner. 2003. Prosodic adaptation in human-computer interaction. In Proceedings of ICPHS 2003, Vol. 3. Citeseer, USA, 833–836.",
      "doi": ""
    },
    {
      "text": "Doris Bergen. 2002. The role of pretend play in children’s cognitive development.Early Childhood Research & Practice 4, 1 (2002), n1.",
      "doi": ""
    },
    {
      "text": "Ginevra Castellano, André Pereira, Iolanda Leite, Ana Paiva, and Peter W McOwan. 2009. Detecting user engagement with a robot companion using task and social interaction-based features. In Proceedings of the 2009 international conference on Multimodal interfaces. ACM, New York, NY, USA, 119–126.",
      "doi": "10.1145/1647314.1647336"
    },
    {
      "text": "Jill MacLaren Chorney, C Meghan McMurtry, Christine T Chambers, and Roger Bakeman. 2015. Developing and modifying behavioral coding schemes in pediatric psychology: a practical guide. Journal of pediatric psychology 40, 1 (2015), 154–164.",
      "doi": ""
    },
    {
      "text": "Ellen Crowe and E Tory Higgins. 1997. Regulatory focus and strategic inclinations: Promotion and prevention in decision-making. Organizational behavior and human decision processes 69, 2 (1997), 117–132.",
      "doi": ""
    },
    {
      "text": "Arturo Cruz-Maya, Roxana Agrigoroaie, and Adriana Tapus. 2017. Improving user’s performance by motivation: Matching robot interaction strategy with user’s regulatory state. In International Conference on Social Robotics. Springer, New York, USA, 464–473.",
      "doi": ""
    },
    {
      "text": "Arturo Cruz-Maya and Adriana Tapus. 2018. Adapting Robot Behavior using Regulatory Focus Theory, User Physiological State and Task-Performance Information. In 2018 27th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, New York, USA, 644–651.",
      "doi": ""
    },
    {
      "text": "Jesus Alfonso D Datu, Ronnel B King, and Jana Patricia M Valdez. 2017. The academic rewards of socially-oriented happiness: Interdependent happiness promotes academic engagement. Journal of School Psychology 61 (2017), 19–31.",
      "doi": ""
    },
    {
      "text": "Paul Ekman and Wallace V Friesen. 1978. Manual for the facial action coding system. Consulting Psychologists Press, Palo Alto, CA, USA.",
      "doi": ""
    },
    {
      "text": "Caroline Faur, Jean-Claude Martin, and Celine Clavel. 2015. Matching artificial agents’ and users’ personalities: designing agents with regulatory-focus and testing the regulatory fit effect.. In CogSci. Cognitive Science Society, Washington, USA.",
      "doi": ""
    },
    {
      "text": "Ronald S Friedman and Jens Förster. 2005. Effects of motivational cues on perceptual asymmetry: Implications for creativity and analytical problem solving.Journal of personality and social psychology 88, 2(2005), 263.",
      "doi": ""
    },
    {
      "text": "Jose Maria Garcia-Garcia, Victor MR Penichet, and Maria D Lozano. 2017. Emotion detection: a technology review. In Proceedings of the XVIII international conference on human computer interaction. Springer, USA, 1–8.",
      "doi": "10.1145/3123818.3123852"
    },
    {
      "text": "Patrick Gomez, PG Zimmermann, Sissel Guttormsen Schär, and Brigitta Danuser. 2009. Valence lasts longer than arousal: Persistence of induced moods as assessed by psychophysiological measures. Journal of Psychophysiology 23, 1 (2009), 7–17.",
      "doi": ""
    },
    {
      "text": "E Tory Higgins. 1997. Beyond pleasure and pain.American psychologist 52, 12 (1997), 1280.",
      "doi": ""
    },
    {
      "text": "Rens Hoegen, Deepali Aneja, Daniel McDuff, and Mary Czerwinski. 2019. An end-to-end conversational style matching agent. In Proceedings of the 19th ACM International Conference on Intelligent Virtual Agents. ACM, New York, NY, USA, 111–118.",
      "doi": "10.1145/3308532.3329473"
    },
    {
      "text": "Rens Hoegen, Job Van Der Schalk, Gale Lucas, and Jonathan Gratch. 2018. The impact of agent facial mimicry on social behavior in a prisoner’s dilemma. In Proceedings of the 18th International Conference on Intelligent Virtual Agents. ACM, New York, NY, USA, 275–280.",
      "doi": "10.1145/3267851.3267911"
    },
    {
      "text": "Galit Hofree, Paul Ruvolo, Marian Stewart Bartlett, and Piotr Winkielman. 2014. Bridging the mechanical and the human mind: spontaneous mimicry of a physically present android. PloS one 9, 7 (2014), e99934.",
      "doi": ""
    },
    {
      "text": "Henning Holle and Robert Rein. 2015. EasyDIAg: A tool for easy determination of interrater agreement. Behavior research methods 47, 3 (2015), 837–847.",
      "doi": ""
    },
    {
      "text": "Alice M Isen. 1987. Positive affect, cognitive processes, and social behavior. In Advances in experimental social psychology. Vol. 20. Elsevier, Amsterdam, Netherlands, 203–253.",
      "doi": ""
    },
    {
      "text": "Alice M Isen, Kimberly A Daubman, and Gary P Nowicki. 1987. Positive affect facilitates creative problem solving.Journal of personality and social psychology 52, 6(1987), 1122.",
      "doi": ""
    },
    {
      "text": "Jason F Jent, Larissa N Niec, and Sarah E Baker. 2011. Play and interpersonal processes. Play in clinical practice: evidence-based approaches. Guilford Press, New York 2, 2 (2011), 23–47.",
      "doi": ""
    },
    {
      "text": "Eun Ho Kim, Sonya S Kwak, and Yoon Keun Kwak. 2009. Can robotic emotional expressions induce a human to empathize with a robot?. In RO-MAN 2009-The 18th IEEE International Symposium on Robot and Human Interactive Communication. IEEE, USA, 358–362.",
      "doi": ""
    },
    {
      "text": "J. Kkedzierski, R. Muszyński, C. Zoll, A. Oleksy, and M. Frontkiewicz. 2013. EMYS—emotive head of a social robot. International Journal of Social Robotics 5, 2 (2013), 237–249.",
      "doi": ""
    },
    {
      "text": "Jacqueline M Kory-Westlund and Cynthia Breazeal. 2019. Exploring the effects of a social robot’s speech entrainment and backstory on young children’s emotion, rapport, relationship, and learning. Frontiers in Robotics and AI 6 (2019), 54.",
      "doi": ""
    },
    {
      "text": "Dalibor Kučera and Jiří Haviger. 2012. Using mood induction procedures in psychological research. Procedia-Social and Behavioral Sciences 69 (2012), 31–40.",
      "doi": ""
    },
    {
      "text": "Andre Kuijsters, Judith Redi, Boris de Ruyter, and Ingrid Heynderickx. 2016. Inducing sadness and anxiousness through visual media: Measurement techniques and persistence. Frontiers in psychology 7 (2016), 1141.",
      "doi": ""
    },
    {
      "text": "Sonya S Kwak, Yunkyung Kim, Eunho Kim, Christine Shin, and Kwangsu Cho. 2013. What makes people empathize with an emotional robot?: The impact of agency and physical embodiment on human empathy for a robot. In 2013 IEEE RO-MAN. IEEE, USA, 180–185.",
      "doi": ""
    },
    {
      "text": "Heather C Lench, Sarah A Flores, and Shane W Bench. 2011. Discrete emotions predict changes in cognition, judgment, experience, behavior, and physiology: a meta-analysis of experimental emotion elicitations.Psychological bulletin 137, 5 (2011), 834.",
      "doi": ""
    },
    {
      "text": "C. Li, Q. Jia, and Y. Feng. 2016. Human-Robot Interaction Design for Robot-Assisted Intervention for Children with Autism Based on E-S Theory. In 2016 8th International Conference on Intelligent Human-Machine Systems and Cybernetics (IHMSC), Vol. 02. CPS, USA, 320–324.",
      "doi": ""
    },
    {
      "text": "John D Mayer, Laura J McCormick, and Sara E Strong. 1995. Mood-congruent memory and natural mood: New evidence. Personality and Social Psychology Bulletin 21, 7 (1995), 736–746.",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Abdelrahman Mahmoud, Mohammad Mavadati, May Amr, Jay Turcot, and Rana el Kaliouby. 2016. AFFDEX SDK: a cross-platform real-time multi-face expression recognition toolkit. In Proceedings of the 2016 CHI conference extended abstracts on human factors in computing systems. ACM, New York, NY, USA, 3723–3726.",
      "doi": "10.1145/2851581.2890247"
    },
    {
      "text": "Candice M Mottweiler and Marjorie Taylor. 2014. Elaborated role play and creativity in preschool age children.Psychology of Aesthetics, Creativity, and the Arts 8, 3 (2014), 277.",
      "doi": ""
    },
    {
      "text": "John W Mullennix, Steven E Stern, Stephen J Wilson, and Corrie-lynn Dyson. 2003. Social perception of male and female computer synthesized speech. Computers in Human Behavior 19, 4 (2003), 407–424.",
      "doi": ""
    },
    {
      "text": "Yfke P Ongena and Wil Dijkstra. 2006. Methods of behavior coding of survey interviews. Journal of Official Statistics 22, 3 (2006), 419.",
      "doi": ""
    },
    {
      "text": "Maike Paetzel, Isabelle Hupont, Giovanna Varni, Mohamed Chetouani, Christopher Peters, and Ginevra Castellano. 2017. Exploring the Link between Self-assessed Mimicry and Embodiment in HRI. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, New York, NY, USA, 245–246.",
      "doi": "10.1145/3029798.3038317"
    },
    {
      "text": "Nicolas Poirel, Mathieu Cassotti, Virginie Beaucousin, Arlette Pineau, and Olivier Houdé. 2012. Pleasant emotional induction broadens the visual world of young children. Cognition & emotion 26, 1 (2012), 186–191.",
      "doi": ""
    },
    {
      "text": "Kenneth M Prkachin, Rhonda M Williams-Avery, Caroline Zwaal, and David E Mills. 1999. Cardiovascular changes during induced emotion: An application of Lang’s theory of emotional imagery. Journal of psychosomatic research 47, 3 (1999), 255–267.",
      "doi": ""
    },
    {
      "text": "Fabiana Silva Ribeiro, Flávia Heloísa Santos, Pedro Barbas Albuquerque, and Patrícia Oliveira-Silva. 2019. Emotional induction through music: Measuring cardiac and electrodermal responses of emotional states and their persistence. Frontiers in psychology 10 (2019), 451.",
      "doi": ""
    },
    {
      "text": "Laurel D Riek, Philip C Paul, and Peter Robinson. 2010. When my robot smiles at me: Enabling human-robot rapport via real-time head gesture mimicry. Journal on Multimodal User Interfaces 3, 1-2 (2010), 99–108.",
      "doi": ""
    },
    {
      "text": "Ben Robins, Kerstin Dautenhahn, Rene Te Boekhorst, and Aude Billard. 2005. Robotic assistants in therapy and education of children with autism: can a small humanoid robot help encourage social interaction skills?Universal access in the information society 4, 2 (2005), 105–120.",
      "doi": ""
    },
    {
      "text": "Natacha Rouaix, Laure Retru-Chavastel, Anne-Sophie Rigaud, Clotilde Monnet, Hermine Lenoir, and Maribel Pino. 2017. Affective and engagement issues in the conception and assessment of a robot-assisted psychomotor therapy for persons with dementia. Frontiers in psychology 8 (2017), 950.",
      "doi": ""
    },
    {
      "text": "Gillian Rowe, Jacob B Hirsh, and Adam K Anderson. 2007. Positive affect increases the breadth of attentional selection. Proceedings of the National Academy of Sciences 104, 1 (2007), 383–388.",
      "doi": ""
    },
    {
      "text": "Sandra W Russ and Julie A Fiorelli. 2010. Developmental approaches to creativity. The Cambridge handbook of creativity 12 (2010), 233–249.",
      "doi": ""
    },
    {
      "text": "Anara Sandygulova and Gregory MP O’Hare. 2016. Investigating the impact of gender segregation within observational pretend play interaction. In 2016 11th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, USA, 399–406.",
      "doi": ""
    },
    {
      "text": "Sofia Serholt and Wolmet Barendregt. 2016. Robots tutoring children: Longitudinal evaluation of social engagement in child-robot interaction. In Proceedings of the 9th nordic conference on human-computer interaction. ACM, New York, NY, USA, 1–10.",
      "doi": "10.1145/2971485.2971536"
    },
    {
      "text": "Ewa Siedlecka and Thomas F Denson. 2019. Experimental methods for inducing basic emotions: A qualitative review. Emotion Review 11, 1 (2019), 87–97.",
      "doi": ""
    },
    {
      "text": "Elly Singer, Merel Nederend, Lotte Penninx, Mehrnaz Tajik, and Jan Boom. 2014. The teacher’s role in supporting young children’s level of play engagement. Early Child Development and Care 184, 8 (2014), 1233–1249.",
      "doi": ""
    },
    {
      "text": "Bram Vanderborght, Ramona Simut, Jelle Saldien, Cristina Pop, Alina S Rusu, Sebastian Pintea, Dirk Lefeber, and Daniel O David. 2012. Using the social robot probo as a social story telling agent for children with ASD. Interaction Studies 13, 3 (2012), 348–372.",
      "doi": ""
    },
    {
      "text": "Rainer Westermann, Kordelia Spies, Günter Stahl, and Friedrich W Hesse. 1996. Relative effectiveness and validity of mood induction procedures: A meta-analysis. European Journal of social psychology 26, 4 (1996), 557–580.",
      "doi": ""
    },
    {
      "text": "Peter Wittenburg, Hennie Brugman, Albert Russel, Alex Klassmann, and Han Sloetjes. 2006. ELAN: a professional framework for multimodality research. In 5th International Conference on Language Resources and Evaluation (LREC 2006). European Language Resources Association, Marseille, France, 1556–1559.",
      "doi": ""
    },
    {
      "text": "Xuan Zhang, Hui W Yu, and Lisa F Barrett. 2014. How does this make you feel? A comparison of four affect induction procedures. Frontiers in psychology 5 (2014), 689.",
      "doi": ""
    }
  ]
}