{
  "doi": "10.1145/3411764.3445108",
  "title": "Qualitative Secondary Analysis as an Alternative Approach for Cross-Cultural Design: A Case Study with Saudi transnationals",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "It is widely acknowledged in HCI that culture is embodied in many aspects of an individual's identity and interaction with technology. Whilst existing cultural models have been criticized for providing a deterministic view of culture, alternative methods for incorporating culture in design remain scarce. We introduce the use of Qualitative Secondary Analysis (QSA) as a bottom-up approach to construct a richer and more dynamic understanding of culture to inform our best practices in Cross-Cultural Design. We demonstrate the use of QSA within a culturally specific context, namely Saudi transnationals. We draw upon two case studies (with 55 participants) to investigate the cultural factors underpinning our participants views. We conclude with a reflection on key affordances and challenges of QSA, illustrating how QSA can be leveraged to unravel otherwise overlooked knowledge present in many qualitative HCI studies.",
  "tags": [
    "Culture",
    "Qualitative Secondary Analysis (QSA)",
    "Cross-Cultural Design"
  ],
  "authors": [
    {
      "name": "Taghreed Alshehri",
      "institution": "Open Lab, Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527367",
      "orcid": "0000-0002-6075-8652"
    },
    {
      "name": "Norah Abokhodair",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558376656",
      "orcid": "missing"
    },
    {
      "name": "Reuben Kirkham",
      "institution": "Faculty of Information Technology Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458712957",
      "orcid": "0000-0002-1902-549X"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Action Lab Monash University, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Norah Abokhodair, Sofiane Abbar, Sarah Vieweg, and Yelena Mejova. 2016. Privacy and twitter in qatar: Traditional Values in the Digital World. Proceedings of the 8th ACM Conference on Web Science - WebSci ’16 (2016), 66–77. DOI: https://doi.org/10.1145/2908131.2908146",
      "doi": "10.1145/2908131.2908146"
    },
    {
      "text": "Norah Abokhodair, Adam Hodges, and Sarah Vieweg. 2017. Photo Sharing in the Arab Gulf: Expressing the Collective and Autonomous Selves. In Proceedings of CSCW 2017, ACM Press, 696–711. DOI: https://doi.org/10.1145/2998181.2998338",
      "doi": "10.1145/2998181.2998338"
    },
    {
      "text": "Norah Abokhodair and Sarah Vieweg. 2016. Privacy & Social Media in the Context of the Arab Gulf. DIS ’16 Proceedings of the 2016 ACM Conference on Designing Interactive Systems (2016), 672–683. DOI: https://doi.org/10.1145/2901790.2901873",
      "doi": "10.1145/2901790.2901873"
    },
    {
      "text": "Zakari Abubakari, Min Wang, and Rexford Paa-Grant. 2018. Hofstede-GLOBE inspired cultural dimensions: a review and application in international business research and cross-cultural strategy. In Proceedings of the 2018 International Conference on Information Management & Management Science - IMMS ’18, ACM Press, Chengdu, China, 83–88. DOI: https://doi.org/10.1145/3277139.3277153",
      "doi": "10.1145/3277139.3277153"
    },
    {
      "text": "Nitin Agarwal, Merlyna Lim, and Rolf Wigand. 2012. Raising and rising voices in social media: A novel methodological approach in studying cyber-collective movements. Business and Information Systems Engineering 4, 3 (2012), 113–126. DOI: https://doi.org/10.1007/s12599-012-0210-z",
      "doi": ""
    },
    {
      "text": "Manail Anis Ahmed. 2015. Outward Mobility of Saudi Students: An Overview. International Higher Education 83 (December 2015), 19. DOI: https://doi.org/10.6017/ihe.2015.83.9084",
      "doi": ""
    },
    {
      "text": "Jamil Al Wekhian. 2015. Acculturation Process of Arab-Muslim Immigrants in the United States. Asian Culture and History 8, 1 (November 2015), 89. DOI: https://doi.org/10.5539/ach.v8n1p89",
      "doi": ""
    },
    {
      "text": "Adel Al-Dawood, Norah Abokhodair, Houda El mimouni, and Svetlana Yarosh. 2017. “Against Marrying a Stranger”: Marital Matchmaking Technologies in Saudi Arabia. In Proceedings of the 2017 Conference on Designing Interactive Systems - DIS ’17, ACM Press, Edinburgh, United Kingdom, 1013–1024. DOI: https://doi.org/10.1145/3064663.3064683",
      "doi": "10.1145/3064663.3064683"
    },
    {
      "text": "Majid Aldraehim, Sylvia L Sl Edwards, Jason Watson, and Chan Taizan. 2013. Cultural impact on e-service use in Saudi Arabia: the need for interaction with other humans. International Journal for Infonomics (IJI) 3, 3 (2013), 655–662.",
      "doi": ""
    },
    {
      "text": "Madawi Al-Rasheed. 2013. A Most Masculine State: Gender, Politics, and Religion in Saudi Arabia. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Mohammed Alsaif. 2014. Factors Affecting Citizens’ Adoption of e- Government Moderated by Socio and Cultural Values in Saudi Arabia. Ph.D. Dissertation. University of Birmingham, Birmingham, UK, Birmingham, UK.",
      "doi": ""
    },
    {
      "text": "Taghreed Alshehri, Reuben Kirkham, and Patrick Olivier. 2020. Scenario Co-Creation Cards: A Culturally Sensitive Tool for Eliciting Values. CHI 2020 (2020), 14.",
      "doi": ""
    },
    {
      "text": "Abdullah Mohammed AL-Shehry. 2008. Transformation towards E-government in The Kingdom of Saudi Arabia: Technological and Organisational Perspectives. Ph.D. Dissertation. De Montfort University, Leicester, UK.",
      "doi": ""
    },
    {
      "text": "Tamara Alsheikh, Jennifer a. Rode, and Siân E Lindley. 2011. (Whose) Value-Sensitive Design? A study of long- distance relationships in an Arabic cultural context. Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (CSCW ’11) (2011), 75–84. DOI: https://doi.org/10.1145/1958824.1958836",
      "doi": "10.1145/1958824.1958836"
    },
    {
      "text": "Kirk St Amant. 2015. Introduction to the special issue Cultural Considerations for Communication Design: Integrating Ideas of Culture, Communication, and Context into User Experience Design. (2015), 17.",
      "doi": ""
    },
    {
      "text": "Andrew Molinsky. 2007. Cross-Cultural Code-Switching: The Psychological Challenges of Adapting Behavior in Foreign Cultural Interactions. The Academy of Management Review 32, 2 (2007), 622–640.",
      "doi": ""
    },
    {
      "text": "John W. Berry, Ype H. Poortinga, Marshall H. Segall, and Pierre R. Dasen. 2002. Cross-Cultural Psychology: Research and Applications. Cambridge University Press (2002), 611.",
      "doi": ""
    },
    {
      "text": "Dinesh Bhugra and Matthew A. Becker. 2005. Migration, cultural bereavement and cultural identity. World Psychiatry (2005), 7.",
      "doi": ""
    },
    {
      "text": "Lawrence Blum. 2004. Stereotypes and Stereotyping: A Moral Analysis. Philosophical Papers 33, 3 (November 2004), 251–289. DOI: https://doi.org/10.1080/05568640409485143",
      "doi": ""
    },
    {
      "text": "Mariya Bobina, Stephanie Vergnaud, Mikhail Grachev, and Richard Soparnot. 2010. From cultural stereotypes to cross-cultural analysis: a case of France. In Proceedings of the 3rd international conference on Intercultural collaboration - ICIC ’10, ACM Press, Copenhagen, Denmark, 3.",
      "doi": "10.1145/1841853.1841894"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. DOI: https://doi.org/The publisher's URL is: http://dx.doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (August 2019), 589–597. DOI: https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": "10.1080/2159676X.2019.1628806"
    },
    {
      "text": "Christoph Brumann. 1999. Writing for Culture: Why a Successful Concept Should Not Be Discarded. Current Anthropology 40, S1 (February 1999), S1–S27. DOI: https://doi.org/10.1086/200058",
      "doi": ""
    },
    {
      "text": "Jean Pierre Cassarino. 2004. Theorising Return Migration: The ConceptualApproach to Return Migrants Revisited. International Journal on Multicultural Societies (IJMS) 6, 2 (2004), 253–279.",
      "doi": ""
    },
    {
      "text": "Christopher Clary and Mara E. Karlin. 2011. Saudi Arabia's Reform Gamble. Survival 53, 5 (November 2011), 15–20. DOI: https://doi.org/10.1080/00396338.2011.621619",
      "doi": ""
    },
    {
      "text": "Carrie Coltart, Karen Henwood, and Fiona Shirani. 2013. Qualitative Secondary Analysis in Austere Times: Ethical, Professional and Methodological Considerations. Forum: Qualitative Social Research 14, 1 (2013), 20.",
      "doi": ""
    },
    {
      "text": "John W. Creswell. 2014. Research design: qualitative, quantitative, and mixed methods approaches (4th ed ed.). SAGE Publications, Thousand Oaks.",
      "doi": ""
    },
    {
      "text": "Janet Davis and Lisa P. Nathan. 2013. Value Sensitive Design: Applications, Adaptations, and Critiques. In Handbook of Ethics, Values, and Technological Design, Jeroen van den Hoven, Pieter E. Vermaas and Ibo van de Poel (eds.). Springer Netherlands, Dordrecht, 1–26. DOI: https://doi.org/10.1007/978-94-007-6994-6_3-1",
      "doi": ""
    },
    {
      "text": "Nicole Dubois and Jean Léon Beauvois. 2005. Normativeness and individualism. European Journal of Social Psychology 35, 1 (2005), 123–146. DOI: https://doi.org/10.1002/ejsp.236",
      "doi": ""
    },
    {
      "text": "Maha Faisal and Asmaa Alsumait. 2011. Social Network Privacy and Trust Concerns. Proc. of the 13th International Conference on Information Integration and Web-based Applications and Services (2011), 416–419. DOI: https://doi.org/10.1145/2095536.2095620",
      "doi": "10.1145/2095536.2095620"
    },
    {
      "text": "Batya Friedman, Peter H Kahn, and Alan Borning. 2002. Value Sensitive Design: Theory and Methods. UW CSE Technical Report (2002), 8.",
      "doi": ""
    },
    {
      "text": "F. Gregory Gause. 2011. Saudi Arabia in the New Middle East.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. 1981. Culture and Organizations. International Studies of Management & Organization.",
      "doi": ""
    },
    {
      "text": "Reece George, Keith Nesbitt, Michael Donovan, and John Maynard. 2012. Evaluating Indigenous Design Features Using Cultural Dimensions. User Interfaces 126, (2012), 10.",
      "doi": ""
    },
    {
      "text": "Lisa M. Given. 2008. The SAGE Encyclopaedia of Qualitative Research Methods. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Barney G Glaser. 1963. Retreading Research Materials: The Use of Secondary Analysis by the Independent Researcher. American Behavioral Scientist 6, (1963), 11–14.",
      "doi": ""
    },
    {
      "text": "Edward T. Hall. 1976. Beyond Culture. Anchor Press, New York.",
      "doi": ""
    },
    {
      "text": "Martyn Hammersley. 2010. Can We Re-Use Qualitative Data via Secondary Analysis? Notes on Some Terminological and Substantive Issues. Sociological Research Online 15, 1 (February 2010), 47–53. DOI: https://doi.org/10.5153/sro.2076",
      "doi": ""
    },
    {
      "text": "Shahad Hazmi and Sherif Mohamed. 2015. Influence of National Culture on Staff Preferences to Knowledge Sharing Practices: The Case of Saudi Arabia. In The 6th International Conference on Construction Engineering and Project Management, ICCEPM 2015, Busan, Korea, 7–11.",
      "doi": ""
    },
    {
      "text": "Janet Heaton. 2004. Reworking Qualitative Data. SAGE Publications Ltd, 1 Oliver's Yard, 55 City Road, London England EC1Y 1SP United Kingdom. DOI: https://doi.org/10.4135/9781849209878",
      "doi": ""
    },
    {
      "text": "Pamela Hinds and Katharina Reinecke. 2014. Advancing methodologies for cross- cultural studies of collaborative systems. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing - CSCW Companion ’14, ACM Press, Baltimore, Maryland, USA, 323–326. DOI: https://doi.org/10.1145/2556420.2558856",
      "doi": "10.1145/2556420.2558856"
    },
    {
      "text": "Mark Hobart. 2000. After culture: anthropology as radical metaphysical critique. Duta Wacana University Press, Yogyakarta.",
      "doi": ""
    },
    {
      "text": "Geert Hofstede. What about Saudi Arabia? Retrieved August 26, 2019 from https://geert-hofstede.com/saudi-arabia.html",
      "doi": ""
    },
    {
      "text": "Jeroen van den Hoven. 2015. Value Sensitive Design and Responsible Innovation. In Social Responsibility and Science in Innovation Economy, Pawelec Kawa and Rafael P Weirzchoslawski (eds.). Learned Society of KUL & John Paul II Catholic University of Lublin, 115–164.",
      "doi": ""
    },
    {
      "text": "Jeroen van den Hoven, Pieter E. Vermaas, and Ibo Van de Poel (Eds.). 2015. Handbook of Ethics, Values, and Technological Design Sources, Theory, Values and Application Domains. Springer Science+Business Media Dordrecht 2015, Delft, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Sarah Irwin. 2013. Qualitative secondary data analysis: Ethics, epistemology and context. Progress in Development Studies 13, 4 (October 2013), 295–306. DOI: https://doi.org/10.1177/1464993413490479",
      "doi": ""
    },
    {
      "text": "Sarah Irwin and Mandy Winterton. 2011. Debates in Qualitative Secondary Analysis: Critical Reflections. Timescapes Working Paper Series 4 (2011), 24.",
      "doi": ""
    },
    {
      "text": "Michelle L. Kaarst-Brown and Indira R. Guzman. 2014. Cultural richness versus cultural large scale insights: culture, globalization, and it workers. In Proceedings of the 52nd ACM conference on Computers and people research - SIGSIM-CPR ’14, ACM Press, Singapore, Singapore, 55–58. DOI: https://doi.org/10.1145/2599990.2600002",
      "doi": ""
    },
    {
      "text": "Sahar Khamis and Katherine Vaughn. 2011. Cyberactivism in the Egyptian Revolution: How Civic Engagement and Citizen Journalism Tilted the Balanc. Arab Media & Society. Retrieved September 17, 2016 from http://www.arabmediasociety.com/?article=769",
      "doi": ""
    },
    {
      "text": "Nouf Khashman and Andrew Large. 2012. Arabic web interface design through the eyes of Hofstede. Proceedings of the American Society for Information Science and Technology 49, 1 (2012), 1–3. DOI: https://doi.org/10.1002/meet.14504901369",
      "doi": ""
    },
    {
      "text": "Nouf Khashman and Andrew Large. 2013. Arabic Website Design: User Evaluation from a Cultural Perspective. In Cross-Cultural Design. Cultural Differences in Everyday Life, P. L. Patrick Rau (ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 424–431. DOI: https://doi.org/10.1007/978-3-642-39137-8_47",
      "doi": ""
    },
    {
      "text": "A. L. Kroeber and Clyde Kluckhohn. 1952. Culture: a critical review of concepts and definitions. Peabody Museum of American Archaeology and Ethnology, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Amélie Le Renard. 2008. “Only for Women:” Women, the State, and Reform in Saudi Arabia. The Middle East Journal 62, 4 (October 2008), 610–629. DOI: https://doi.org/10.3751/62.4.13",
      "doi": ""
    },
    {
      "text": "Xin Li, Traci J. Hess, Anna L. McNab, and Yanjun Yu. 2009. Culture and acceptance of global web sites: a cross-country study of the effects of national cultural values on acceptance of a personal web portal. ACM SIGMIS Database 40, 4 (October 2009), 49. DOI: https://doi.org/10.1145/1644953.1644959",
      "doi": "10.1145/1644953.1644959"
    },
    {
      "text": "Ping Liu and Chun Keung. 2013. Defining Cross-Culture Theoretical Framework of User Interface. In Cross-Cultural Design. Methods, Practice, and Case Studies, P. L. Patrick Rau (ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 235–242.",
      "doi": ""
    },
    {
      "text": "Tracy Long-Sutehall, Magi Sque, and Julia Addington-Hall. 2010. Secondary analysis of qualitative data: a valuable method for exploring sensitive issues with an elusive population? Journal of Research in Nursing 16, 4 (July 2010), 335–344. DOI: https://doi.org/10.1177/1744987110381553",
      "doi": ""
    },
    {
      "text": "Jerry D. Moore. 2009. Visions of culture: an introduction to anthropological theories and theorists (3rd ed ed.). AltaMira Press, Lanham, MD.",
      "doi": ""
    },
    {
      "text": "Carlyle Murphy. 2012. A Kingdom's Future: Saudi Arabia through the eyes of its twentysomethimgs. Wilson International Center for Scholars, Washington, D.C. Retrieved from www.wilsoncenter.org/middleeast",
      "doi": ""
    },
    {
      "text": "Caryle Murphy. 2012. Saudi Arabia's Youth and the Kingdom's Future. Middle East Program, Occasional Paper Series (2012). Retrieved from http://scholar.google.com/scholar?hl=en&btnG=Search&q=intitle:Saudi+Arabia's+Youth+and+the+Kingdom's+Future#6",
      "doi": ""
    },
    {
      "text": "W. Lawrence Neuman. 2014. Social Research Methods: Qualitative and Quantitative Approaches (7th ed. ed.). Pearson Education Limited, Edinburgh. Retrieved September 9, 2019 from http://www.jstor.org/stable/3211488?origin=crossref",
      "doi": ""
    },
    {
      "text": "Khaled Saleh Al Omoush, Saad Ghaleb Yaseen, and Mohammad Atwah Alma'Aitah. 2012. The impact of Arab cultural values on online social networking: The case of Facebook. Computers in Human Behavior 28, 6 (2012), 2387–2399. DOI: https://doi.org/10.1016/j.chb.2012.07.010",
      "doi": "10.1016/j.chb.2012.07.010"
    },
    {
      "text": "Daphna Oyserman. 2011. Culture as situated cognition: Cultural mindsets, cultural fluency, and meaning making. European Review of Social Psychology 22, 1 (March 2011), 164–214. DOI: https://doi.org/10.1080/10463283.2011.627187",
      "doi": ""
    },
    {
      "text": "Daphna Oyserman and Spike W S Lee. 2008. Does culture influence what and how we think? Effects of priming individualism and collectivism. Psychological bulletin 134, 2 (2008), 311–42. DOI: https://doi.org/10.1037/0033-2909.134.2.311",
      "doi": ""
    },
    {
      "text": "Tom Plocher, Pei-Luen Patrick Rau, and Yee-Yin Choong. 2012. Cross-Cultural Design. In Handbook of Human Factors and Ergonomics, Gavriel Salvendy (ed.). John Wiley & Sons, Inc., Hoboken, NJ, USA, 162–191. DOI: https://doi.org/10.1002/9781118131350.ch6",
      "doi": ""
    },
    {
      "text": "Elisabeth Plum. 2009. Cultural intelligence: the art of leading cultural complexity. In Proceeding of the 2009 international workshop on Intercultural collaboration - IWIC ’09, ACM Press, Palo Alto, California, USA, 293. DOI: https://doi.org/10.1145/1499224.1499280",
      "doi": "10.1145/1499224.1499280"
    },
    {
      "text": "Pablo Rodríguez Del Pozo and Joseph J Fins. 2008. Islam and Informed Consent: Notes from Doha. Cambridge Quarterly of Healthcare Ethics 17, 3 (2008), 273–9. DOI: https://doi.org/10.1017/S096318010808033X",
      "doi": ""
    },
    {
      "text": "Victoria Sherif. 2018. Evaluating Preexisting Qualitative Research Data for Secondary Analysis. Forum: Qualitative Social Research 19, 2 (2018), 17.",
      "doi": ""
    },
    {
      "text": "Nitish Singh. 2002. From Cultural Models to Cultural Categories: A Framework for Cultural Analysis. In NA - Advances in Consumer Research, Association for Consumer Research, Valdosta, GA, 239–240.",
      "doi": ""
    },
    {
      "text": "Kirk St. Amant. 2016. Introduction to the special issue: Cultural considerations for communication design. Communication Design Quarterly Review 4, 1 (2016), 6–22. DOI: https://doi.org/10.1145/2875501.2875502",
      "doi": "10.1145/2875501.2875502"
    },
    {
      "text": "Huatong Sun. 2002. Why Cultural Contexts Are Missing: A Rhetorical Critique of Localization Practices. In Proceedings of STC (Society for Technical Communicators), Nashville, TN, 5.",
      "doi": ""
    },
    {
      "text": "Huatong Sun. 2012. Cross-Cultural Technology Design Creating Culture-Sensitive Technology for Local Users. Oxford University Press. DOI: https://doi.org/10.1093/acprof:oso/9780199744763.001.0001",
      "doi": ""
    },
    {
      "text": "Huatong Sun. 2015. Operationalizing culture with design cards in cross- cultural design: Translating critical knowledge into provocative insights. Rhetoric, Professional Communication and Globalization 7, 1 (2015), 61–78.",
      "doi": ""
    },
    {
      "text": "Anna Tarrant. 2017. Getting out of the swamp? Methodological reflections on using qualitative secondary analysis to develop research design. International Journal of Social Research Methodology 20, 6 (November 2017), 599–611. DOI: https://doi.org/10.1080/13645579.2016.1257678",
      "doi": ""
    },
    {
      "text": "Fons Trompenaars and Charles Hampden-Turner. 2011. Riding the waves of culture: Understanding cultural diversity in business. Hachette, UK. Retrieved from https://linkinghub.elsevier.com/retrieve/pii/002463019390118Y",
      "doi": ""
    },
    {
      "text": "Sampo S.I. Tukiainen. 2010. Coping with cultural dominance in cross cultural interaction. In Proceedings of the 3rd international conference on Intercultural collaboration - ICIC ’10, ACM Press, Copenhagen, Denmark, 255. DOI: https://doi.org/10.1145/1841853.1841901",
      "doi": "10.1145/1841853.1841901"
    },
    {
      "text": "UNDP (Ed.). 2016. Youth and the prospects for human development in a changing reality. United Nations Development Programme, Regional Bureau for Arab States, New York, NY.",
      "doi": ""
    },
    {
      "text": "Natasha F. Veltri and Wafa Elgarah. 2009. The Role of National Cultural Differences in User Adoption of social Networking. Proceedings of the Southern Association for Information Systems Conference 2007, January 2007 (2009), 169–174.",
      "doi": ""
    },
    {
      "text": "Steven Vertovec. 1999. Conceiving and researching transnationalism. Ethnic and Racial Studies 22, 2 (January 1999), 447–462. DOI: https://doi.org/10.1080/014198799329558",
      "doi": ""
    },
    {
      "text": "Sarah Vieweg and Adam Hodges. 2016. Surveillance & Modesty on Social Media: How Qataris Navigate Modernity and Maintain Tradition. Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing - CSCW ’16 (2016), 526–537. DOI: https://doi.org/10.1145/2818048.2819966",
      "doi": "10.1145/2818048.2819966"
    },
    {
      "text": "Frank E. Vogel. 2012. Shari‘a in the Politics of Saudi Arabia. The Review of Faith & International Affairs 10, 4 (December 2012), 18–27. DOI: https://doi.org/10.1080/15570274.2012.739892",
      "doi": ""
    },
    {
      "text": "Tanja Walsh, Piia Nurkka, and Rod Walsh. 2010. Cultural differences in smartphone user experience evaluation. In Proceedings of the 9th International Conference on Mobile and Ubiquitous Multimedia - MUM ’10, ACM Press, Limassol, Cyprus, 1–9. DOI: https://doi.org/10.1145/1899475.1899499",
      "doi": "10.1145/1899475.1899499"
    },
    {
      "text": "Yang Wang and Blase Ur. 2013. A Cross-Cultural Framework for Protecting User Privacy in Online Social Media. International World Wide Web Conference Committee (IW3C2) (2013), 1–8.",
      "doi": ""
    },
    {
      "text": "Carla Willig. 2013. Introducing qualitative research in psychology (3. ed ed.). Open Univ. Press, Maidenhead.",
      "doi": ""
    },
    {
      "text": "James Wynbrandt. 2010. A brief history of Saudi Arabia (2nd ed ed.). Facts On File, New York, NY.",
      "doi": ""
    },
    {
      "text": "Tamara Yakaboski, Karla Perez-Velez, and Yousef Almutairi. 2017. Collectivists’ Decision-Making: Saudi Arabian Graduate Students’ Study Abroad Choices. Journal of International Students 7, 1 (January 2017), 94–112. DOI: https://doi.org/10.32674/jis.v7i1.247",
      "doi": ""
    }
  ]
}