{
  "doi": "10.1145/3411764.3445491",
  "title": "Eyecam: Revealing Relations between Humans and Sensing Devices through an Anthropomorphic Webcam",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "We are surrounded by sensing devices. We are accustomed to them, appreciate their benefits, and even create affective bonds and might neglect the implications they might have for our daily life. By presenting Eyecam, an anthropomorphic webcam mimicking a human eye, we challenge conventional relationships with ubiquitous sensing devices and call to re-think how sensing devices might appear and behave. Inspired by critical design, Eyecam is an exaggeration of a familiar sensing device which allows for critical reflections on its perceived functionalities and its impact on human-human and human-device relations. We identify 5 different roles Eyecam can take: Mediator, Observer, Mirror, Presence, and Agent. Contributing design fictions and thinking prompts, we allow for articulation on privacy awareness and intrusion, affect in mediated communication, agency and self-perception along with speculation on potential futures. We envision this work to contribute to a bold and responsible design of ubiquitous sensing devices.",
  "authors": [
    {
      "name": "Marc Teyssier",
      "institution": "Saarland University Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019889",
      "orcid": "missing"
    },
    {
      "name": "Marion Koelle",
      "institution": "Saarland University Saarland Informatics Campus, Germany",
      "img": "/do/10.1145/contrib-86158741357/rel-imgonly/marionkoelle_xs.jpg",
      "acmid": "86158741357",
      "orcid": "0000-0002-5931-3218"
    },
    {
      "name": "Paul Strohmeier",
      "institution": "Saarland Informatics Campus Saarland University, Germany",
      "img": "/do/10.1145/contrib-81498658319/rel-imgonly/crop.jpg",
      "acmid": "81498658319",
      "orcid": "0000-0002-7442-2607"
    },
    {
      "name": "Bruno Fruchard",
      "institution": "Saarland University Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161949",
      "orcid": "0000-0002-2488-6032"
    },
    {
      "name": "Jürgen Steimle",
      "institution": "Saarland University, Saarland Informatics Campus, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384613099",
      "orcid": "0000-0003-3493-8745"
    }
  ],
  "references": [
    {
      "text": "Henny Admoni and Brian Scassellati. 2017. Social Eye Gaze in Human-Robot Interaction: A Review. J. Hum.-Robot Interact. 6, 1 (May 2017), 25–63. https://doi.org/10.5898/JHRI.6.1.Admoni",
      "doi": "10.5898/JHRI.6.1.Admoni"
    },
    {
      "text": "Imtiaz Ahmad, Rosta Farzan, Apu Kapadia, and Adam J. Lee. 2020. Tangible Privacy: Towards User-Centric Sensor Designs for Bystander Privacy. Proc. ACM Hum.-Comput. Interact. 4, CSCW2, Article 116 (Oct. 2020), 28 pages. https://doi.org/10.1145/3415187",
      "doi": "10.1145/3415187"
    },
    {
      "text": "Isaac Asimov. 1950. I, Robot, Robot series.",
      "doi": ""
    },
    {
      "text": "Saskia Bakker, Doris Hausen, and Ted Selker. 2016. Introduction: Framing Peripheral Interaction. 1–10. https://doi.org/10.1007/978-3-319-29523-7_1",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell. 2011. Interaction criticism: An introduction to the practice. Interacting with computers 23, 6 (2011), 604–621.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, Jodi Forlizzi, John Zimmerman, and John Antanitis. 2012. Critical design and critical theory: the challenge of designing for provocation. In Proceedings of the Designing Interactive Systems Conference. 288–297.",
      "doi": "10.1145/2317956.2318001"
    },
    {
      "text": "Victoria Bellotti and Abigail Sellen. 1993. Design for privacy in ubiquitous computing environments. In Proceedings of the Third European Conference on Computer-Supported Cooperative Work 13–17 September 1993, Milan, Italy ECSCW’93. Springer, 77–92.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the sigchi conference on human factors in computing systems. 2005–2014.",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Samuel Bianchini, Florent Levillain, Armando Menicacci, Emanuele Quinz, and Elisabetta Zibetti. 2016. Towards behavioral objects: A twofold approach for a system of notation to design and implement behaviors in non-anthropomorphic robotic artifacts. In Dance Notations and Robot Motion. Springer, 1–24.",
      "doi": ""
    },
    {
      "text": "Mark Blythe. 2014. Research through design fiction: narrative in real and imaginary abstracts. In Proceedings of the SIGCHI conference on human factors in computing systems. 703–712.",
      "doi": "10.1145/2556288.2557098"
    },
    {
      "text": "Matthew Brocker and Stephen Checkoway. 2014. iSeeYou: Disabling the MacBook Webcam Indicator {LED}. In 23rd {USENIX} Security Symposium ({USENIX} Security 14). 337–352.",
      "doi": ""
    },
    {
      "text": "A. Bruce, I. Nourbakhsh, and R. Simmons. 2002. The role of expressiveness and attention in human-robot interaction. In Proceedings 2002 IEEE International Conference on Robotics and Automation (Cat. No.02CH37292), Vol. 4. 4138–4142 vol.4.",
      "doi": ""
    },
    {
      "text": "Sloane C. Burke, Michele Wallen, Karen Vail-Smith, and David Knox. 2011. Using technology to control intimate partners: An exploratory study of college undergraduates. Computers in Human Behavior 27, 3 (2011), 1162 – 1167. https://doi.org/10.1016/j.chb.2010.12.010 Group Awareness in CSCL Environments.",
      "doi": "10.1016/j.chb.2010.12.010"
    },
    {
      "text": "Roser Cañigueral and Antonia F. de C. Hamilton. 2019. The Role of Eye Gaze During Natural Social Interactions in Typical and Autistic People. Frontiers in Psychology 10 (2019), 560. https://doi.org/10.3389/fpsyg.2019.00560",
      "doi": ""
    },
    {
      "text": "Yu-Ting Cheng, Mathias Funk, Wenn-Chieh Tsai, and Lin-Lin Chen. 2019. Peekaboo Cam: Designing an Observational Camera for Home Ecologies Concerning Privacy. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 823–836. https://doi.org/10.1145/3322276.3323699",
      "doi": "10.1145/3322276.3323699"
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, and Julie A. Kientz. 2011. Living in a Glass House: A Survey of Private Moments in the Home. In Proceedings of the 13th International Conference on Ubiquitous Computing (Beijing, China) (UbiComp ’11). Association for Computing Machinery, New York, NY, USA, 41–44. https://doi.org/10.1145/2030112.2030118",
      "doi": "10.1145/2030112.2030118"
    },
    {
      "text": "Nazli Cila, Iskander Smit, Elisa Giaccardi, and Ben Kröse. 2017. Products as Agents: Metaphors for Designing the Products of the IoT Age. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 448–459. https://doi.org/10.1145/3025453.3025797",
      "doi": "10.1145/3025453.3025797"
    },
    {
      "text": "Tamara Denning, Zakariya Dehlawi, and Tadayoshi Kohno. 2014. In Situ with Bystanders of Augmented Reality Glasses: Perspectives on Recording and Privacy-mediating Technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’14)(CHI’14). ACM, New York, NY, 2377–2386. https://doi.org/10.1145/2556288.2557352",
      "doi": "10.1145/2556288.2557352"
    },
    {
      "text": "Tom Djajadiningrat, Stephan Wensveen, Joep Frens, and Kees Overbeeke. 2004. Tangible products: redressing the balance between appearance and action. Personal and Ubiquitous Computing 8, 5 (2004), 294–309.",
      "doi": "10.1007/s00779-004-0293-8"
    },
    {
      "text": "Paul Dourish and Genevieve Bell. 2014. “Resistance is futile”: reading science fiction alongside ubiquitous computing. Personal and Ubiquitous Computing 18, 4 (2014), 769–778.",
      "doi": "10.1007/s00779-013-0678-7"
    },
    {
      "text": "Brian R Duffy. 2003. Anthropomorphism and the social robot. Robotics and autonomous systems 42, 3-4 (2003), 177–190.",
      "doi": ""
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative everything: design, fiction, and social dreaming. MIT press.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Jinjuan Feng, Jonathan Lazar, and Jenny Preece. 2004. Empathy and online interpersonal trust: A fragile relationship. Behaviour & Information Technology 23, 2 (2004), 97–106. https://doi.org/10.1080/01449290310001659240 arXiv:https://doi.org/10.1080/01449290310001659240",
      "doi": ""
    },
    {
      "text": "Tom Foulsham, Esther Walker, and Alan Kingstone. 2011. The where, what and when of gaze allocation in the lab and the natural environment. Vision Research 51, 17 (2011), 1920 – 1931. https://doi.org/10.1016/j.visres.2011.07.002",
      "doi": ""
    },
    {
      "text": "Thomas Fuchs. 2001. The tacit dimension. Philosophy, Psychiatry, & Psychology 8, 4 (2001), 323–326.",
      "doi": ""
    },
    {
      "text": "Maia Garau, Mel Slater, Vinoba Vinayagamoorthy, Andrea Brogni, Anthony Steed, and M Angela Sasse. 2003. The impact of avatar realism and eye gaze control on perceived quality of communication in a shared immersive virtual environment. In Proceedings of the SIGCHI conference on Human factors in computing systems. 529–536.",
      "doi": "10.1145/642611.642703"
    },
    {
      "text": "Björn Hartmann, Scott R Klemmer, Michael Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective physical prototyping through integrated design, test, and analysis. In Proceedings of the 19th annual ACM symposium on User interface software and technology. 299–308.",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Mariam Hassib, Daniel Buschek, Paweł W. Wozniak, and Florian Alt. 2017. HeartChat: Heart Rate Augmented Mobile Chat to Support Empathy and Awareness. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2239–2251. https://doi.org/10.1145/3025453.3025758",
      "doi": "10.1145/3025453.3025758"
    },
    {
      "text": "Doris Hausen, Hendrik Richter, Adalie Hemme, and Andreas Butz. 2013. Comparing input modalities for peripheral interaction: A case study on peripheral music control. In IFIP Conference on Human-Computer Interaction. Springer, 162–179.",
      "doi": ""
    },
    {
      "text": "Fabian Hemmert. 2008. Ambient Life: Permanent Tactile Life-like Actuation as a Status Display in Mobile Phones. In UIST’08: Adjunct Proceedings of the 21st annual ACM symposium on User Interface Software and Technology (Monterey, California, USA, October 20-22, 2008).",
      "doi": ""
    },
    {
      "text": "Fabian Hemmert, Matthias Löwe, Anne Wohlauf, and Gesche Joost. 2013. Animate Mobiles: Proxemically Reactive Posture Actuation as a Means of Relational Interaction with Mobile Phones. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (Barcelona, Spain) (TEI ’13). Association for Computing Machinery, New York, NY, USA, 267–270. https://doi.org/10.1145/2460625.2460669",
      "doi": "10.1145/2460625.2460669"
    },
    {
      "text": "Alison Hirst and Christina Schwabenland. 2018. Doing gender in the ‘new office’. Gender, Work & Organization 25, 2 (2018), 159–176.",
      "doi": ""
    },
    {
      "text": "Simon Ho, Tom Foulsham, and Alan Kingstone. 2015. Speaking and Listening with the Eyes: Gaze Signaling during Dyadic Interactions. PLOS ONE 10, 8 (08 2015), 1–18. https://doi.org/10.1371/journal.pone.0136905",
      "doi": ""
    },
    {
      "text": "Cedric Honnet, Hannah Perner-Wilson, Marc Teyssier, Bruno Fruchard, Juergen Steimle, Ana C Baptista, and Paul Strohmeier. 2020. PolySense: Augmenting Textiles with Electrical Functionality using In-Situ Polymerization. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376841"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3131–3142. https://doi.org/10.1145/2858036.2858583",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Noura Howell, Greg Niemeyer, and Kimiko Ryokai. 2019. Life-Affirming Biosensing in Public: Sounding Heartbeats on a Red Bench. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3290605.3300910",
      "doi": "10.1145/3290605.3300910"
    },
    {
      "text": "Google Inc.2020. Google Lens - Search What You See. https://lens.google.com/. [Online; accessed 17-Sept-2020].",
      "doi": ""
    },
    {
      "text": "IDEO Inc.2021. How Might We, IDEO Methods Kit. https://www.designkit.org/methods/3. [Online; accessed 08-jan-2021].",
      "doi": ""
    },
    {
      "text": "Microsoft Inc.2020. Seeing AI App from Microsoft. https://www.microsoft.com/en-us/ai/seeing-ai. [Online; accessed 17-Sept-2020].",
      "doi": ""
    },
    {
      "text": "Brett R. Jones, Hrvoje Benko, Eyal Ofek, and Andrew D. Wilson. 2013. IllumiRoom: Peripheral Projected Illusions for Interactive Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 869–878. https://doi.org/10.1145/2470654.2466112",
      "doi": "10.1145/2470654.2466112"
    },
    {
      "text": "James Kennedy, Paul Baxter, and Tony Belpaeme. 2015. Comparing robot embodiments in a guided discovery learning interaction with children. International Journal of Social Robotics 7, 2 (2015), 293–308.",
      "doi": ""
    },
    {
      "text": "Sara Kiesler, Jane Siegel, and Timothy W McGuire. 1984. Social psychological aspects of computer-mediated communication.American psychologist 39, 10 (1984), 1123.",
      "doi": ""
    },
    {
      "text": "Georg Klein and David Murray. 2009. Parallel tracking and mapping on a camera phone. In 2009 8th IEEE International Symposium on Mixed and Augmented Reality. IEEE, 83–86.",
      "doi": "10.1109/ISMAR.2009.5336495"
    },
    {
      "text": "Marion Koelle, Swamy Ananthanarayan, Simon Czupalla, Wilko Heuten, and Susanne Boll. 2018. Your Smart Glasses’ Camera Bothers Me!: Exploring Opt-in and Opt-out Gestures for Privacy Mediation. In Proceedings of the Nordic Conference on Human-Computer Interaction(NordiCHI’18). ACM, New York, NY, USA, 473–481. https://doi.org/10.1145/3240167.3240174",
      "doi": "10.1145/3240167.3240174"
    },
    {
      "text": "Marion Koelle, Wilko Heuten, and Susanne Boll. 2017. Are You Hiding It? Usage Habits of Lifelogging Camera Wearers. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (Vienna, Austria) (MobileHCI ’17). Association for Computing Machinery, New York, NY, USA, Article 80, 8 pages. https://doi.org/10.1145/3098279.3122123",
      "doi": "10.1145/3098279.3122123"
    },
    {
      "text": "Marion Koelle, Matthias Kranz, and Andreas Möller. 2015. Don’t Look at Me That Way! Understanding User Attitudes Towards Data Glasses Usage. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (Copenhagen, Denmark) (MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 362–372. https://doi.org/10.1145/2785830.2785842",
      "doi": "10.1145/2785830.2785842"
    },
    {
      "text": "Marion Koelle, Torben Wallbaum, Wilko Heuten, and Susanne Boll. 2019. Evaluating a Wearable Camera’s Social Acceptability In-the-Wild. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312837",
      "doi": "10.1145/3290607.3312837"
    },
    {
      "text": "Marion Koelle, Katrin Wolf, and Susanne Boll. 2018. Beyond LED Status Lights - Design Requirements of Privacy Notices for Body-Worn Cameras. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction (Stockholm, Sweden) (TEI ’18). Association for Computing Machinery, New York, NY, USA, 177–187. https://doi.org/10.1145/3173225.3173234",
      "doi": "10.1145/3173225.3173234"
    },
    {
      "text": "Kamil Kopecký. 2016. Misuse of web cameras to manipulate children within the so-called webcam trolling. Telematics and Informatics 33, 1 (2016), 1 – 7. https://doi.org/10.1016/j.tele.2015.06.005",
      "doi": "10.1016/j.tele.2015.06.005"
    },
    {
      "text": "Hagen Lehmann, Alessandro Roncone, Ugo Pattacini, and Giorgio Metta. 2016. Physiologically inspired blinking behavior for a humanoid robot. In International Conference on Social Robotics. Springer, 83–93.",
      "doi": ""
    },
    {
      "text": "Roxanne Leitão. 2019. Anticipating Smart Home Security and Privacy Threats with Survivors of Intimate Partner Abuse. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 527–539. https://doi.org/10.1145/3322276.3322366",
      "doi": "10.1145/3322276.3322366"
    },
    {
      "text": "Daniel Leyzberg, Samuel Spaulding, Mariya Toneva, and Brian Scassellati. 2012. The physical presence of a robot tutor increases cognitive learning gains. In Proceedings of the annual meeting of the cognitive science society, Vol. 34.",
      "doi": ""
    },
    {
      "text": "Jaime Lien, Nicholas Gillian, M. Emre Karagozler, Patrick Amihood, Carsten Schwesig, Erik Olson, Hakim Raja, and Ivan Poupyrev. 2016. Soli: Ubiquitous Gesture Sensing with Millimeter Wave Radar. ACM Trans. Graph. 35, 4, Article 142 (July 2016), 19 pages. https://doi.org/10.1145/2897824.2925953",
      "doi": "10.1145/2897824.2925953"
    },
    {
      "text": "Shao-Kang Lo. 2008. The nonverbal communication functions of emoticons in computer-mediated communication. CyberPsychology & Behavior 11, 5 (2008), 595–597.",
      "doi": ""
    },
    {
      "text": "Josh Lovejoy. 2018. The UX of AI: Using Google Clips to Understand How a Human-Centered Design Process Elevates Artificial Intelligence. In Proceedings of the AAAI Spring Symposium Series. https://aaai.org/ocs/index.php/SSS/SSS18/paper/viewPDFInterstitial/17565/15461",
      "doi": ""
    },
    {
      "text": "Daniel Lundqvist, Francisco Esteves, and Arne Ohman. 1999. The face of wrath: Critical features for conveying facial threat. Cognition & Emotion 13, 6 (1999), 691–711.",
      "doi": ""
    },
    {
      "text": "Dominique Machuletz, Stefan Laube, and Rainer Böhme. 2018. Webcam Covering as Planned Behavior. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173754",
      "doi": "10.1145/3173574.3173754"
    },
    {
      "text": "Dominique Machuletz, Henrik Sendt, Stefan Laube, and Rainer Böhme. 2016. Users Protect Their Privacy If They Can: Determinants of Webcam Covering Behavior. In Proceedings of the European Workshop on Usable Security at the Privacy Enhaning Technologies Symposium (EuroSEC’16)(EuroUSEC’16). Internet Society, Reston, VA. https://doi.org/10.14722/eurousec.2016.23014",
      "doi": ""
    },
    {
      "text": "Angus Main. 2019. Countermeasures: Learning to Lie to Objects. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3290607.3310420",
      "doi": "10.1145/3290607.3310420"
    },
    {
      "text": "S. Mann. 2000. Telepointer: Hands-free completely self-contained wearable visual augmented reality without headwear and without any infrastructural reliance. In Proceedings of the International Symposium on Wearable Computers (ISWC’00). IEEE Computer Society, 177–178. https://doi.org/10.1109/ISWC.2000.888489",
      "doi": ""
    },
    {
      "text": "Betti Marenko. 2014. Neo-Animism and Design. Design and Culture 6, 2 (2014), 219–241. https://doi.org/10.2752/175470814X14031924627185 arXiv:https://doi.org/10.2752/175470814X14031924627185",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Saul Greenberg. 2003. The design of a context-aware home media space for balancing privacy and awareness. In International Conference on Ubiquitous Computing. Springer, 297–314.",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Saul Greenberg. 2012. Intimacy in Long-distance Relationships over Video Chat. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI’12)(CHI’12). ACM, New York, NY, 753. https://doi.org/10.1145/2207676.2207785",
      "doi": "10.1145/2207676.2207785"
    },
    {
      "text": "Carman Neustaedter, Saul Greenberg, and Michael Boyle. 2006. Blur Filtration Fails to Preserve Privacy for Home-Based Video Conferencing. ACM Trans. Comput.-Hum. Interact. 13, 1 (March 2006), 1–36. https://doi.org/10.1145/1143518.1143519",
      "doi": "10.1145/1143518.1143519"
    },
    {
      "text": "Patricia A Norberg, Daniel R Horne, and David A Horne. 2007. The privacy paradox: Personal information disclosure intentions versus behaviors. Journal of consumer affairs 41, 1 (2007), 100–126.",
      "doi": "10.1111/j.1745-"
    },
    {
      "text": "Antti Oulasvirta, Aurora Pihlajamaa, Jukka Perkiö, Debarshi Ray, Taneli Vähäkangas, Tero Hasu, Niklas Vainio, and Petri Myllymäki. 2012. Long-Term Effects of Ubiquitous Surveillance in the Home. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (Pittsburgh, Pennsylvania) (UbiComp ’12). Association for Computing Machinery, New York, NY, USA, 41–50. https://doi.org/10.1145/2370216.2370224",
      "doi": "10.1145/2370216.2370224"
    },
    {
      "text": "Costas Panagopoulos and Sander van der Linden. 2017. The feeling of being watched: Do eye cues elicit negative affect?North American Journal of Psychology 19, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Joohee Park, Young-Woo Park, and Tek-Jin Nam. 2014. Wrigglo: shape-changing peripheral for interpersonal mobile communication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3973–3976.",
      "doi": "10.1145/2556288.2557166"
    },
    {
      "text": "Esben W Pedersen, Sriram Subramanian, and Kasper Hornbæk. 2014. Is my phone alive? A large-scale study of shape change in handheld devices using videos. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2579–2588.",
      "doi": "10.1145/2556288.2557018"
    },
    {
      "text": "Per Persson, Jarmo Laaksolahti, and Peter Lönnqvist. 2000. Anthropomorphism–A multi-layered phenomenon. Proc. Socially Intelligent Agents–The Human in the Loop, AAAI Press, Technical report FS-00-04 (2000), 131–135.",
      "doi": ""
    },
    {
      "text": "Chanda Phelan, Cliff Lampe, and Paul Resnick. 2016. It’s Creepy, But It Doesn’t Bother Me. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5240–5251. https://doi.org/10.1145/2858036.2858381",
      "doi": "10.1145/2858036.2858381"
    },
    {
      "text": "James Pierce. 2014. On the presentation and production of design research artifacts in HCI. In Proceedings of the 2014 conference on Designing interactive systems. 735–744.",
      "doi": "10.1145/2598510.2598525"
    },
    {
      "text": "James Pierce. 2019. Lamps, Curtains, Robots: 3 Scenarios for the Future of the Smart Home. In Proceedings of the 2019 on Creativity and Cognition (San Diego, CA, USA) (C& C ’19). Association for Computing Machinery, New York, NY, USA, 423–424. https://doi.org/10.1145/3325480.3329181",
      "doi": "10.1145/3325480.3329181"
    },
    {
      "text": "James Pierce. 2019. Smart Home Security Cameras and Shifting Lines of Creepiness: A Design-Led Inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300275",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "James Pierce. 2020. Roomba+Clips Cam: Exploring Unpredictable Autonomy in Everyday Smart Systems. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference(Eindhoven, Netherlands) (DIS’ 20 Companion). Association for Computing Machinery, New York, NY, USA, 317–320. https://doi.org/10.1145/3393914.3395816",
      "doi": "10.1145/3393914.3395816"
    },
    {
      "text": "James Pierce and Eric Paulos. 2015. Making multiple uses of the obscura 1C digital camera: reflecting on the design, production, packaging and distribution of a counterfunctional device. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2103–2112.",
      "doi": "10.1145/2702123.2702405"
    },
    {
      "text": "James Pierce, Richmond Y. Wong, and Nick Merrill. 2020. Sensor Illumination: Exploring Design Qualities and Ethical Implications of Smart Cameras and Image/Video Analytics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–19. https://doi.org/10.1145/3313831.3376347",
      "doi": "10.1145/3313831.3376347"
    },
    {
      "text": "Patryk Pomykalski, Mikołaj P. Woundefinedniak, Paweł W. Woundefinedniak, Krzysztof Grudzień, Shengdong Zhao, and Andrzej Romanowski. 2020. Considering Wake Gestures for Smart Assistant Use. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3383089",
      "doi": ""
    },
    {
      "text": "Rebecca S. Portnoff, Linda N. Lee, Serge Egelman, Pratyush Mishra, Derek Leung, and David Wagner. 2015. Somebody’s Watching Me? Assessing the Effectiveness of Webcam Indicator Lights. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1649–1658. https://doi.org/10.1145/2702123.2702164",
      "doi": "10.1145/2702123.2702164"
    },
    {
      "text": "Blaine A. Price, Avelie Stuart, Gul Calikli, Ciaran Mccormick, Vikram Mehta, Luke Hutton, Arosha K. Bandara, Mark Levine, and Bashar Nuseibeh. 2017. Logging You, Logging Me: A Replicable Study of Privacy and Sharing Behaviour in Groups of Visual Lifeloggers. PROC ACM IMWUT 1, 2 (2017), 22:1–22:18. https://doi.org/10.1145/3090087",
      "doi": ""
    },
    {
      "text": "Kimiko Ryokai, Julia Park, and Wesley Deng. 2020. Personal Laughter Archives: Reflection through Visualization and Interaction. In Adjunct Proceedings of the 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2020 ACM International Symposium on Wearable Computers (Virtual Event, Mexico) (UbiComp-ISWC ’20). Association for Computing Machinery, New York, NY, USA, 115–118. https://doi.org/10.1145/3410530.3414419",
      "doi": "10.1145/3410530.3414419"
    },
    {
      "text": "Alireza Sahami Shirazi, Yomna Abdelrahman, Niels Henze, Stefan Schneegass, Mohammadreza Khalilbeigi, and Albrecht Schmidt. 2014. Exploiting Thermal Reflection for Interactive Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3483–3492. https://doi.org/10.1145/2556288.2557208",
      "doi": "10.1145/2556288.2557208"
    },
    {
      "text": "Alex Sciuto, Arnita Saini, Jodi Forlizzi, and Jason I. Hong. 2018. ”Hey Alexa, What’s Up?”: A Mixed-Methods Studies of In-Home Conversational Agent Usage. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 857–868. https://doi.org/10.1145/3196709.3196772",
      "doi": "10.1145/3196709.3196772"
    },
    {
      "text": "Atsushi Senju and Toshikazu Hasegawa. 2005. Direct gaze captures visuospatial attention. Visual Cognition 12, 1 (2005), 127–144. https://doi.org/10.1080/13506280444000157 arXiv:https://doi.org/10.1080/13506280444000157",
      "doi": ""
    },
    {
      "text": "Mary Wollstonecraft Shelley. 1818. Frankenstein; or, The Modern Prometheus. Lackington, London.",
      "doi": ""
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, Thecla Schiphorst, Anthony Tang, Abhisekh Patra, and Rui Pan. 2016. You are Being Watched: Bystanders’ Perspective on the Use of Camera Devices in Public Spaces. In Proceedings of the SIGCHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI’16 EA). ACM Press, New York, New York, USA, 3197–3203. https://doi.org/10.1145/2851581.2892522",
      "doi": "10.1145/2851581.2892522"
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2018. Intimate Futures: Staying with the Trouble of Digital Personal Assistants through Design Fiction. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 869–880. https://doi.org/10.1145/3196709.3196766",
      "doi": "10.1145/3196709.3196766"
    },
    {
      "text": "Yunpeng Song, Yun Huang, Zhongmin Cai, and Jason I. Hong. 2020. I’m All Eyes and Ears: Exploring Effective Locators for Privacy Awareness in IoT Scenarios. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376585",
      "doi": "10.1145/3313831.3376585"
    },
    {
      "text": "Anna Ståhl, Kristina Höök, Martin Svensson, Alex S Taylor, and Marco Combetto. 2009. Experiencing the affective diary. Personal and Ubiquitous Computing 13, 5 (2009), 365–378.",
      "doi": "10.1007/s00779-008-0202-7"
    },
    {
      "text": "Julian Steil, Marion Koelle, Wilko Heuten, Susanne Boll, and Andreas Bulling. 2019. PrivacEye: Privacy-Preserving Head-Mounted Eye Tracking Using Egocentric Scene Image and Eye Movement Features. In Proceedings of the 11th ACM Symposium on Eye Tracking Research & Applications (Denver, Colorado) (ETRA ’19). Association for Computing Machinery, New York, NY, USA, Article 26, 10 pages. https://doi.org/10.1145/3314111.3319913",
      "doi": "10.1145/3314111.3319913"
    },
    {
      "text": "Paul Strohmeier, Juan Pablo Carrascal, Bernard Cheng, Margaret Meban, and Roel Vertegaal. 2016. An evaluation of shape changes for conveying emotions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3781–3792.",
      "doi": "10.1145/2858036.2858537"
    },
    {
      "text": "Shan-Yuan Teng, Da-Yuan Huang, Chi Wang, Jun Gong, Teddy Seyed, Xing-Dong Yang, and Bing-Yu Chen. 2019. Aarnio: Passive Kinesthetic Force Output for Foreground Interactions on an Interactive Chair(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300902",
      "doi": "10.1145/3290605.3300902"
    },
    {
      "text": "Marc Teyssier, Gilles Bailly, Catherine Pelachaud, and Eric Lecolinet. 2018. MobiLimb: Augmenting Mobile Devices with a Robotic Limb. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 53–63. https://doi.org/10.1145/3242587.3242626",
      "doi": "10.1145/3242587.3242626"
    },
    {
      "text": "Marc Teyssier, Gilles Bailly, Catherine Pelachaud, and Eric Lecolinet. 2020. Conveying Emotions Through Device-Initiated Touch. IEEE Transactions on Affective Computing(2020).",
      "doi": ""
    },
    {
      "text": "Marc Teyssier, Gilles Bailly, Catherine Pelachaud, Eric Lecolinet, Andrew Conn, and Anne Roudaut. 2019. Skin-On Interfaces: A Bio-Driven Approach for Artificial Skin Design to Cover Interactive Devices. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 307–322. https://doi.org/10.1145/3332165.3347943",
      "doi": "10.1145/3332165.3347943"
    },
    {
      "text": "Jonas Togler, Fabian Hemmert, and Reto Wettach. 2009. Living interfaces: the thrifty faucet. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction. 43–44.",
      "doi": "10.1145/1517664.1517680"
    },
    {
      "text": "Philip van Allen, Joshua McVeigh-Schultz, Brooklyn Brown, Hye Mi Kim, and Daniel Lara. 2013. AniThings: Animism and Heterogeneous Multiplicity. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (Paris, France) (CHI EA ’13). Association for Computing Machinery, New York, NY, USA, 2247–2256. https://doi.org/10.1145/2468356.2468746",
      "doi": ""
    },
    {
      "text": "Jelle van Dijk. 2020. Post-Human Interaction Design, Yes, but Cautiously. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS’ 20 Companion). Association for Computing Machinery, New York, NY, USA, 257–261. https://doi.org/10.1145/3393914.3395886",
      "doi": "10.1145/3393914.3395886"
    },
    {
      "text": "Peter-Paul Verbeek. 2005. What things do: Philosophical reflections on technology, agency, and design. Penn State Press.",
      "doi": ""
    },
    {
      "text": "Nicolas Villar, Daniel Cletheroe, Greg Saul, Christian Holz, Tim Regan, Oscar Salandin, Misha Sra, Hui-Shyong Yeo, William Field, and Haiyan Zhang. 2018. Project Zanzibar: A Portable and Flexible Tangible Interaction Platform. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174089",
      "doi": "10.1145/3173574.3174089"
    },
    {
      "text": "Paul Viola and Michael Jones. 2001. Rapid object detection using a boosted cascade of simple features. In Proceedings of the 2001 IEEE computer society conference on computer vision and pattern recognition. CVPR 2001, Vol. 1. IEEE, I–I.",
      "doi": ""
    },
    {
      "text": "Kazuyoshi Wada and Takanori Shibata. 2007. Living with seal robots—its sociopsychological and physiological influences on the elderly at a care house. IEEE transactions on robotics 23, 5 (2007), 972–980.",
      "doi": "10.1109/TRO.2007.906261"
    },
    {
      "text": "Saiwen Wang, Jie Song, Jaime Lien, Ivan Poupyrev, and Otmar Hilliges. 2016. Interacting with Soli: Exploring Fine-Grained Dynamic Gesture Recognition in the Radio-Frequency Spectrum. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 851–860. https://doi.org/10.1145/2984511.2984565",
      "doi": "10.1145/2984511.2984565"
    },
    {
      "text": "Te-Yen Wu, Lu Tan, Yuji Zhang, Teddy Seyed, and Xing-Dong Yang. 2020. Capacitivo: Contact-Based Object Recognition on Interactive Fabrics Using Capacitive Sensing. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 649–661. https://doi.org/10.1145/3379337.3415829",
      "doi": "10.1145/3379337.3415829"
    },
    {
      "text": "Yaxing Yao, Justin Reed Basdeo, Oriana Rosata Mcdonough, and Yang Wang. 2019. Privacy Perceptions and Designs of Bystanders in Smart Homes. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 59 (Nov. 2019), 24 pages. https://doi.org/10.1145/3359161",
      "doi": "10.1145/3359161"
    },
    {
      "text": "Cristina Zaga, Roelof A.J. de Vries, Jamy Li, Khiet P. Truong, and Vanessa Evers. 2017. A Simple Nod of the Head: The Effect of Minimal Robot Movements on Children’s Perception of a Low-Anthropomorphic Robot. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 336–341. https://doi.org/10.1145/3025453.3025995",
      "doi": "10.1145/3025453.3025995"
    },
    {
      "text": "Dingtian Zhang, Jung Wook Park, Yang Zhang, Yuhui Zhao, Yiyang Wang, Yunzhi Li, Tanvi Bhagwat, Wen-Fang Chou, Xiaojia Jia, Bernard Kippelen, Canek Fuentes-Hernandez, Thad Starner, and Gregory D. Abowd. 2020. OptoSense: Towards Ubiquitous Self-Powered Ambient Light Sensing Surfaces. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 3, Article 103 (Sept. 2020), 27 pages. https://doi.org/10.1145/3411826",
      "doi": "10.1145/3411826"
    },
    {
      "text": "Yang Zhang, Chouchang (Jack) Yang, Scott E. Hudson, Chris Harrison, and Alanson Sample. 2018. Wall++: Room-Scale Interactive and Context-Aware Sensing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3173574.3173847",
      "doi": "10.1145/3173574.3173847"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI conference on Human factors in computing systems. 493–502.",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}