{
  "doi": "10.1145/3411764.3445591",
  "title": "Cody: An AI-Based System to Semi-Automate Coding for Qualitative Research",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Qualitative research can produce a rich understanding of a phenomenon but requires an essential and strenuous data annotation process known as coding. Coding can be repetitive and time-consuming, particularly for large datasets. Existing AI-based approaches for partially automating coding, like supervised machine learning (ML) or explicit knowledge represented in code rules, require high technical literacy and lack transparency. Further, little is known about the interaction of researchers with AI-based coding assistance. We introduce Cody, an AI-based system that semi-automates coding through code rules and supervised ML. Cody supports researchers with interactively (re)defining code rules and uses ML to extend coding to unseen data. In two studies with qualitative researchers, we found that (1) code rules provide structure and transparency, (2) explanations are commonly desired but rarely used, (3) suggestions benefit coding quality rather than coding speed, increasing the intercoder reliability, calculated with Krippendorff’s Alpha, from 0.085 (MAXQDA) to 0.33 (Cody).",
  "authors": [
    {
      "name": "Tim Rietz",
      "institution": "Karlsruhe Institute of Technology (KIT), Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588011",
      "orcid": "missing"
    },
    {
      "name": "Alexander Maedche",
      "institution": "Karlsruhe Institute of Technology (KIT), Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100465867",
      "orcid": "0000-0001-6546-4816"
    }
  ],
  "references": [
    {
      "text": "Ahmed Abbasi. 2016. Big Data Research in Information Systems: Toward an Inclusive Research Agenda. Journal of the Association for Information Systems 17, 2 (2016), 1–32. https://doi.org/10.1017/CBO9781107415324.004",
      "doi": ""
    },
    {
      "text": "Giuseppe Abrami, Andy Lücking, Alexander Mehler, Elias Rieb, and Philipp Helfrich. 2019. TEXTANNOTATOR : A flexible framework for semantic annotations. In Proceedings of the 15th Joint ACL - ISO Workshop on Interoperable Semantic Annotation (ISA-15). Association for Computational Linguistics, London, UK, 1–12.",
      "doi": ""
    },
    {
      "text": "Tehmina N. Basit. 2003. Manual or electronic? The role of coding in qualitative data analysis. Educational Research 45, 2 (2003), 143–154. https://doi.org/10.1080/0013188032000133548",
      "doi": ""
    },
    {
      "text": "Peter M. Bednar and Christine Welch. 2009. Contextual Inquiry and Requirements Shaping. In Information Systems Development. Springer International Publishing, New York, NY, USA, 225–236. https://doi.org/10.1007/978-0-387-68772-8_18",
      "doi": ""
    },
    {
      "text": "Matt Chaput. 2020. Whoosh. https://whoosh.readthedocs.io/en/latest/index.html",
      "doi": ""
    },
    {
      "text": "Nan Chen Chen, Margaret Drouhard, Rafal Kocielnik, Jina Suh, and Cecilia R. Aragon. 2018. Using machine learning to support qualitative coding in social science: Shifting the focus to ambiguity. ACM Transactions on Interactive Intelligent Systems 8, 2 (2018), 1–21. https://doi.org/10.1145/3185515",
      "doi": "10.1145/3185515"
    },
    {
      "text": "Nan-chen Chen, Rafal Kocielnik, Margaret Drouhard, Jina Suh, Keting Cen, Xiangyi Zheng, Cecilia R. Aragon, and Vanessa Pena-Araya. 2016. Challenges of Applying Machine Learning to Qualitative Coding. In ACM SIGCHI Workshop on Human-Centered Machine Learning. Association for Computing Machinery, New York, NY, USA, 6. http://hcml2016.goldsmithsdigital.com/program/",
      "doi": ""
    },
    {
      "text": "Hao Fei Cheng, Ruotong Wang, Zheng Zhang, Fiona O’Connell, Terrance Gray, F. Maxwell Harper, and Haiyi Zhu. 2019. Explaining decision-making algorithms through UI: Strategies to help non-expert stakeholders. In Proceedings of the Conference on Human Factors in Computing Systems (CHI ’19). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300789",
      "doi": "10.1145/3290605.3300789"
    },
    {
      "text": "Edward Collins, Nikolai Rozanov, and Bingbing Zhang. 2019. LIDA: Lightweight Interactive Dialogue Annotator. (2019), 121–126 pages. https://doi.org/10.18653/v1/d19-3021",
      "doi": ""
    },
    {
      "text": "Kevin Crowston, Eileen E. Allen, and Robert Heckman. 2012. Using natural language processing technology for qualitative data analysis. International Journal of Social Research Methodology 15, 6(2012), 523–543. https://doi.org/10.1080/13645579.2011.625764",
      "doi": ""
    },
    {
      "text": "Kevin Crowston, Xiaoxhong Liu, and Eileen E. Allen. 2010. Machine Learning and Rule-Based Automated Coding of Qualitative Data. proceedings of the American Society for Information Science and Technology 47, 1 (2010), 1–2. https://crowston.syr.edu/content/machine-learning-and-rule-based-automated-coding-qualitative-data",
      "doi": ""
    },
    {
      "text": "Carla Azevedo De Almeida, Fabio Freitas, Antonio Pedro Costa, and Antonio Moreira. 2019. WEBQDA: The Quest for a Place in the Competitive World of CAQDAS. In Proceedings of the 2019 International Conference on Engineering Applications (ICEA). IEEE, New York, NY, USA, 1–7. https://doi.org/10.1109/CEAP.2019.8883456",
      "doi": ""
    },
    {
      "text": "Margaret Drouhard, Nan Chen Chen, Jina Suh, Rafal Kocielnik, Vanessa Pena-Araya, Keting Cen, Xiangyi Zheng, and Cecilia R. Aragon. 2017. Aeonium: Visual analytics to support collaborative qualitative coding. In 2017 IEEE Pacific Visualization Symposium (PacificVis). IEEE, New York, NY, USA, 220–229. https://doi.org/10.1109/PACIFICVIS.2017.8031598",
      "doi": ""
    },
    {
      "text": "Jeanine C. Evers. 2018. Current issues in qualitative data analysis software (QDAS): A user and developer perspective. Qualitative Report 23, 13 (2018), 61–73.",
      "doi": ""
    },
    {
      "text": "Mingming Fan, Yue Li, and Khai N. Truong. 2020. Automatic Detection of Usability Problem Encounters in Think-aloud Sessions. ACM Transactions on Interactive Intelligent Systems 10, 2 (2020), 1–24. https://doi.org/10.1145/3385732",
      "doi": "10.1145/3385732"
    },
    {
      "text": "Fábio Freitas, Jaime Ribeiro, Catarina Brandão, Francislê Neri de Souza, António Pedro Costa, and Luís Paulo Reis. 2018. In case of doubt see the manual: A comparative analysis of (self)learning packages qualitative research software. Advances in Intelligent Systems and Computing 621 (2018), 176–192. https://doi.org/10.1007/978-3-319-61121-1_16",
      "doi": ""
    },
    {
      "text": "Abbas Ganji, Mania Orand, and David W. McDonald. 2018. Ease on Down the Code: Complex Collaborative Qualitative Coding Simplified with ’Code Wizard’. Proceedings of the ACM on Human-Computer Interaction 2, CSCW, Article 132 (Nov. 2018), 24 pages. https://doi.org/10.1145/3274401",
      "doi": "10.1145/3274401"
    },
    {
      "text": "Justin Grimmer and Brandon M. Stewart. 2013. Text as data: The promise and pitfalls of automatic content analysis methods for political texts. Political Analysis 21, 3 (2013), 267–297. https://doi.org/10.1093/pan/mps028",
      "doi": ""
    },
    {
      "text": "Jamie Harding. 2015. Identifying Themes and Coding Interview Data: Reflective Practice in Higher Education. SAGE Publications Ltd., London, UK. https://doi.org/10.4135/9781473942189",
      "doi": ""
    },
    {
      "text": "Neringa Kalpokaite and Ivana Radivojevic. 2018. Best practice article: Auto-coding and Smart Coding in ATLAS.ti Cloud. https://atlasti.com/2018/09/27/auto-coding-and-smart-coding-in-atlas-ti-cloud/",
      "doi": ""
    },
    {
      "text": "Jan-Christoph Klie, Michael Bugert, Beto Boullosa, Richard Eckart de Castilho, and Iryna Gurevych. 2018. The INCEpTION Platform: Machine-Assisted and Knowledge-Oriented Interactive Annotation. In Proceedings of the International Conference on Computational Linguistics. Association for Computational Linguistics, Santa Fe, New Mexico, USA, 5–9. http://tubiblio.ulb.tu-darmstadt.de/106270/https://www.youtube.com/watch?v=Xz3Hs8Lyoeg/https://inception-project.github.io/publications/",
      "doi": ""
    },
    {
      "text": "Klaus Krippendorff. 2004. Reliability in Content Analysis: Some Common Misconceptions and Recommendations. Technical Report. University of Pennsylvania. http://repository.upenn.edu/ascpapers/242",
      "doi": ""
    },
    {
      "text": "C Lejeune. 2011. An Illustration of the Benefits of Cassandre for Qualitative Analysis. Forum: Qualitative Sozialforschung = Forum: Qualitative Social Research [FQS] 12, 1(2011), 19. https://doi.org/10.17169/12.1.1513",
      "doi": ""
    },
    {
      "text": "Seth C Lewis, Rodrigo Zamith, and Alfred Hermida. 2013. Content Analysis in an Era of Big Data. Journal of Broadcasting & Electronic Media 57, 1 (2013), 34–52. https://doi.org/10.1080/08838151.2012.76170",
      "doi": ""
    },
    {
      "text": "Aron Lindberg. 2020. Developing theory through integrating human and machine pattern recognition. Journal of the Association for Information Systems 21, 1 (2020), 90–116. https://doi.org/10.17705/1jais.00593",
      "doi": ""
    },
    {
      "text": "Megh Marathe and Kentaro Toyama. 2018. Semi-automated coding for Qualitative research: A user-centered inquiry and initial prototypes. In Proceedings of the Conference on Human Factors in Computing Systems (CHI’18). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173922",
      "doi": "10.1145/3173574.3173922"
    },
    {
      "text": "MAXQDA. 2020. Keyword-in-Context | MAXQDA. https://www.maxqda.de/hilfe-mx20-dictio/keyword-in-context",
      "doi": ""
    },
    {
      "text": "Nancy McCracken, Jasy Suet Yan Yan, and Kevin Crowston. 2014. Design of an Active Learning System with Human Correction for Content Analysis. In Proceedings of the Workshop on Interactive Language Learning, Visualization, and Interfaces. Association for Computational Linguistics, Stroudsburg, PA, USA, 59–62. https://doi.org/10.3115/v1/W14-3109",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-Rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW, Article 72 (2019), 23 pages. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Tetsuya Nakatoh, Satoru Uchida, Emi Ishita, and Toru Oga. 2016. Automated generation of coding rules: Text-mining approach to ISO 26000. In Proceedings - 2016 5th IIAI International Congress on Advanced Applied Informatics, IIAI-AAI 2016. IEEE, New York, NY, USA, 154–158. https://doi.org/10.1109/IIAI-AAI.2016.210",
      "doi": ""
    },
    {
      "text": "Nvivo. 2020. NVivo 11 - Automatic coding in document sources. http://help-nv11.qsrinternational.com/desktop/procedures/automatic_coding_in_document_sources.htm",
      "doi": ""
    },
    {
      "text": "Pablo Paredes, Ana Rufino Ferreira, Cory Schillaci, Gene Yoo, Pierre Karashchuk, Dennis Xing, Coye Cheshire, and John Canny. 2017. Inquire: Large-scale early insight discovery for qualitative research. In Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW. ACM, New York, NY, USA, 1562–1575. https://doi.org/10.1145/2998181.2998363",
      "doi": "10.1145/2998181.2998363"
    },
    {
      "text": "Michael Quinn Patton. 2002. Qualitative Research & Evaluation Methods. Sage Publications Ltd., London, UK. 342 pages. http://books.google.com/books/about/Qualitative_research_and_evaluation_meth.html?id=FjBw2oi8El4C",
      "doi": ""
    },
    {
      "text": "F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. (2011), 2825–2830 pages. https://scikit-learn.org/stable/index.html",
      "doi": ""
    },
    {
      "text": "Lyn Richards. 2002. Qualitative computing—a methods revolution?International Journal of Social Research Methodology 5, 3(2002), 263–276. https://doi.org/10.1080/13645570210146302",
      "doi": ""
    },
    {
      "text": "Tim Rietz and Alexander Maedche. 2019. LadderBot: A Requirements Self-Elicitation System. In 2019 IEEE 27th International Requirements Engineering Conference (RE). IEEE, New York, NY, USA, 357–362. https://doi.org/10.1109/RE.2019.00045",
      "doi": ""
    },
    {
      "text": "Tim Rietz and Alexander Maedche. 2020. Towards the Design of an Interactive Machine Learning System for Qualitative Coding. In Proceedings of the 41st International Conference on Information Systems (ICIS 2020). AIS, New York, NY, USA, 9. https://doi.org/10.5445/IR/1000124563",
      "doi": ""
    },
    {
      "text": "Jane Ritchie and Jane Lewis. 2003. Qualitative Research Practice: A guide for social science students and researchers. Vol. 1. SAGE Publications Ltd., London, UK. 336 pages. https://doi.org/10.18352/jsi.39",
      "doi": ""
    },
    {
      "text": "Stefan Schrunner, Bernhard C. Geiger, Anja Zernig, and Roman Kern. 2020. A generative semi-supervised classifier for datasets with unknown classes. In Proceedings of the ACM Symposium on Applied Computing. ACM, New York, NY, USA, 1066–1074. https://doi.org/10.1145/3341105.3373890",
      "doi": "10.1145/3341105.3373890"
    },
    {
      "text": "Stephen Soderland. 1999. Learning information extraction rules for semi-structured and free text. Machine Learning 34, 1 (1999), 233–272. https://doi.org/10.1023/A:1007562322031",
      "doi": "10.1023/A%3A1007562322031"
    },
    {
      "text": "Kazuko Takahashi, Hiroya Takamura, and Manabu Okumura. 2005. Automatic occupation coding with combination of machine learning and hand-grafted rules. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 3518 LNAI, May 2005(2005), 269–279. https://doi.org/10.1007/11430919_34",
      "doi": ""
    },
    {
      "text": "Ella Tallyn, Hector Fried, Rory Gianni, Amy Isard, and Chris Speed. 2018. The Ethnobot: Gathering ethnographies in the age of IoT. Conference on Human Factors in Computing Systems - Proceedings 2018-April (2018), 1–13. https://doi.org/10.1145/3173574.3174178",
      "doi": "10.1145/3173574.3174178"
    },
    {
      "text": "Tabea Tietz, Joscha Jäger, Jörg Waitelonis, and Harald Sack. 2016. Semantic annotation and information visualization for blogposts with refer. CEUR Workshop Proceedings 1704 (2016), 28–40.",
      "doi": ""
    },
    {
      "text": "Peyman Toreini, Moritz Langner, and Alexander Maedche. 2020. Using eye-tracking for visual attention feedback. In Lecture Notes in Information Systems and Organisation, Vol. 32. Springer International Publishing, New York, NY, USA, 261–270. https://doi.org/10.1007/978-3-030-28144-1_29",
      "doi": ""
    },
    {
      "text": "Gregor Wiedemann. 2013. Opening up to big data: Computer-assisted analysis of textual data in social sciences. Historical Social Research 38, 4 (2013), 332–358. https://doi.org/10.12759/hsr.38.2013.4.332-358",
      "doi": ""
    },
    {
      "text": "Ziang Xiao, Michelle X. Zhou, Q. Vera Liao, Gloria Mark, Changyan Chi, Wenxi Chen, and Huahai Yang. 2020. Tell Me About Yourself: Using an AI-Powered Chatbot to Conduct Conversational Surveys with Open-Ended Questions. ACM Transactions on Computer-Human Interaction 27, 3, Article 15 (June 2020), 37 pages. https://doi.org/10.1145/3381804",
      "doi": "10.1145/3381804"
    },
    {
      "text": "Jasy Liew Suet Yan, Nancy McCracken, Shichun Zhou, and Kevin Crowston. 2014. Optimizing Features in Active Machine Learning for Complex Qualitative Content Analysis. In Proceedings of the ACL Workshop on Language Technologies and Computational Social Science. Association for Computational Linguistics, Baltimore, MD, USA, 44–48. https://doi.org/10.3115/v1/w14-2513",
      "doi": ""
    },
    {
      "text": "Seid Muhie Yimam, Chris Biemann, Richard Eckart de Castilho, and Iryna Gurevych. 2014. Automatic Annotation Suggestions and Custom Annotation Layers in WebAnno. In Proceedings of 52nd Annual Meeting of the Association for Computational Linguistics: System Demonstrations. Association for Computational Linguistics, Baltimore, MA, USA, 91–96. https://doi.org/10.3115/v1/P14-5016",
      "doi": ""
    },
    {
      "text": "Seid Muhie Yimam, Chris Biemann, Ljiljana Majnaric, Šefket Šabanović, and Andreas Holzinger. 2015. Interactive and Iterative Annotation for Biomedical Entity Recognition. In Proceeding of Brain Informatics and Health (BIH 2015), Vol. 9250. Springer International Publishing, New York, NY, USA, 347–357. https://doi.org/10.1007/978-3-319-23344-4_34",
      "doi": ""
    }
  ]
}