{
  "doi": "10.1145/3411764.3445647",
  "title": "TapeBlocks: A Making Toolkit for People Living with Intellectual Disabilities",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "The accessibility and affordability of tangible electronic toolkits are significant barriers to their uptake by people with disabilities. We present the design and evaluation of TapeBlocks, a low-cost, low-fidelity toolkit intended to be accessible for people with intellectual disabilities while promoting creativity and engagement. We evaluated TapeBlocks by interviewing makers, special educational needs teachers and support coaches. Analysis of these interviews informed the design of a series of maker workshops using TapeBlocks with young adults living with intellectual disabilities, led by support coaches with support from the research team. Participants were able to engage with TapeBlocks and making, eventually building their own TapeBlocks to make personal creations. Our evaluation reveals how TapeBlocks supports accessible making and playful discovery of electronics for people living with disabilities, and addresses a gap in existing toolkits by being tinkerable, affordable and having a low threshold for engagement.",
  "authors": [
    {
      "name": "Kirsten Ellis",
      "institution": "Department of Human-Centred Computing Monash University, Australia",
      "img": "/do/10.1145/contrib-81100164670/rel-imgonly/kirsten_ellis_2016_small_square.jpg",
      "acmid": "81100164670",
      "orcid": "0000-0002-7570-0939"
    },
    {
      "name": "Emily Dao",
      "institution": "Department of Human-Centred Computing Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700524",
      "orcid": "missing"
    },
    {
      "name": "Osian Smith",
      "institution": "FIT Lab Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-99659700881/rel-imgonly/img_0161.jpeg",
      "acmid": "99659700881",
      "orcid": "missing"
    },
    {
      "name": "Stephen Lindsay",
      "institution": "FIT Lab Swansea University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384616016",
      "orcid": "0000-0001-6063-3676"
    },
    {
      "name": "Patrick Olivier",
      "institution": "Action Lab Monash University, Australia",
      "img": "/do/10.1145/contrib-81100295667/rel-imgonly/81100295667.jpg",
      "acmid": "81100295667",
      "orcid": "0000-0003-2841-7580"
    }
  ],
  "references": [
    {
      "text": "Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2017. Trigger-Action-Circuits: Leveraging Generative Design to Enable Novices to Design and Build Circuitry. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 331–342. https://doi.org/10.1145/3126594.3126637",
      "doi": "10.1145/3126594.3126637"
    },
    {
      "text": "Giulia Barbareschi, Enrico Costanza, and Catherine Holloway. 2020. TIP-Toy: A Tactile, Open-Source Computational Toolkit to Support Learning across Visual Abilities. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 21, 14 pages. https://doi.org/10.1145/3373625.3417005",
      "doi": "10.1145/3373625.3417005"
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, and Austin Toombs. 2014. ”now That’s Definitely a Proper Hack”: Self-Made Tools in Hackerspaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 473–476. https://doi.org/10.1145/2556288.2557221",
      "doi": "10.1145/2556288.2557221"
    },
    {
      "text": "Ayah Bdeir. 2009. Electronics as Material: LittleBits. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (Cambridge, United Kingdom) (TEI ’09). Association for Computing Machinery, New York, NY, USA, 397–400. https://doi.org/10.1145/1517664.1517743",
      "doi": "10.1145/1517664.1517743"
    },
    {
      "text": "Cynthia L. Bennett, Abigale Stangl, Alexa F. Siu, and Joshua A. Miele. 2019. Making Nonvisually: Lessons from the Field. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, PA, USA) (ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 279–285. https://doi.org/10.1145/3308561.3355619",
      "doi": "10.1145/3308561.3355619"
    },
    {
      "text": "Paulo Blinkstein and Marcelo Worsley. 2016. Children are not Hackers - Building a Culture of Powerful Ideas, Deep Learning and Equity in the Maker Movement. In Makeology: Makerspace as Learning Enviroments, Kylie Peppler, Erica Rosenfeld Haverson, and Yasmin B. Kafai (Eds.). Vol. 1. Routledge, 64–81.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa https://www.tandfonline.com/doi/pdf/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Craig Brown and Amy Hurst. 2012. VizTouch: Automatically Generated Tactile Visualizations of Coordinate Spaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (Kingston, Ontario, Canada) (TEI ’12). Association for Computing Machinery, New York, NY, USA, 131–138. https://doi.org/10.1145/2148131.2148160",
      "doi": "10.1145/2148131.2148160"
    },
    {
      "text": "Leah Buechley, Mike Eisenberg, Jaime Catchen, and Ali Crockett. 2008. The LilyPad Arduino: Using Computational Textiles to Investigate Engagement, Aesthetics, and Diversity in Computer Science Education. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 423–432. https://doi.org/10.1145/1357054.1357123",
      "doi": "10.1145/1357054.1357123"
    },
    {
      "text": "Erin Buehler, Niara Comrie, Megan Hofmann, Samantha McDonald, and Amy Hurst. 2016. Investigating the Implications of 3D Printing in Special Education. ACM Trans. Access. Comput. 8, 3, Article 11 (March 2016), 28 pages. https://doi.org/10.1145/2870640",
      "doi": "10.1145/2870640"
    },
    {
      "text": "Dorota Chapko, Pino Frumiento, Nalini Edwards, Lizzie Emeh, Donald Kennedy, David McNicholas, Michaela Overton, Mark Snead, Robyn Steward, Jenny M. Sutton, Evie Jeffreys, Catherine Long, Jess Croll-Knight, Ben Connors, Sam Castell-Ward, David Coke, Bethany McPeake, William Renel, Chris McGinley, Anna Remington, Dora Whittuck, John Kieffer, Sarah Ewans, Mark Williams, and Mick Grierson. 2020. ”We Have Been Magnified for Years - Now You Are under the Microscope!”: Co-Researchers with Learning Disabilities Created an Online Survey to Challenge Public Understanding of Learning Disabilities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3313831.3376278",
      "doi": "10.1145/3313831.3376278"
    },
    {
      "text": "Australian Public Service Commission. 2017. Definition of disability. https://www.apsc.gov.au/definition-disability.",
      "doi": ""
    },
    {
      "text": "Dale Dougherty. 2016. Free to make: How the maker movement is changing our schools, our jobs, and our minds. North Atlantic Books.",
      "doi": ""
    },
    {
      "text": "Uta Frith and Christopher D. Frith. 1974. SPECIFIC MOTOR DISABILITIES IN DOWNS SYNDROME. Journal of Child Psychology and Psychiatry 15, 4 (1974), 293–301. https://doi.org/10.1111/j.1469-7610.1974.tb01253.x https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1469-7610.1974.tb01253.x",
      "doi": ""
    },
    {
      "text": "Emilie Giles and Janet van der Linden. 2015. Imagining Future Technologies: ETextile Weaving Workshops with Blind and Visually Impaired People. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (Glasgow, United Kingdom) (C&C ’15). Association for Computing Machinery, New York, NY, USA, 3–12. https://doi.org/10.1145/2757226.2757247",
      "doi": "10.1145/2757226.2757247"
    },
    {
      "text": "Florian Güldenpfennig. 2017. Making a Customized DIY-Computer with Infobricks. (2017), 1–12. https://doi.org/10.14236/ewic/HCI2017.52",
      "doi": ""
    },
    {
      "text": "Nic Hollinworth, Faustina Hwang, Kate Allen, Gosia Malgosia Kwiatkowska, and Andy Minnion. 2014. Making Electronics More Accessible to People with Learning Disabilities. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 1255–1260. https://doi.org/10.1145/2559206.2581175",
      "doi": ""
    },
    {
      "text": "Nicholas D. Hollinworth, Faustina Hwang, Kate Allen, Gosia Kwiatkowska, and Andy Minnion. 2014. LittleBits Go LARGE: Making Electronics More Accessible to People with Learning Disabilities. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility (Rochester, New York, USA) (ASSETS ’14). Association for Computing Machinery, New York, NY, USA, 305–306. https://doi.org/10.1145/2661334.2661341",
      "doi": "10.1145/2661334.2661341"
    },
    {
      "text": "Amy Hurst and Jasmine Tobias. 2011. Empowering Individuals with Do-It-Yourself Assistive Technology. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility(Dundee, Scotland, UK) (ASSETS ’11). Association for Computing Machinery, New York, NY, USA, 11–18. https://doi.org/10.1145/2049536.2049541",
      "doi": "10.1145/2049536.2049541"
    },
    {
      "text": "Majeed Kazemitabaar, Liang He, Katie Wang, Chloe Aloimonos, Tony Cheng, and Jon E. Froehlich. 2016. ReWear: Early Explorations of a Modular Wearable Construction Kit for Young Children. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 2072–2080. https://doi.org/10.1145/2851581.2892525",
      "doi": "10.1145/2851581.2892525"
    },
    {
      "text": "Ben Leduc-Mills, Jaymes Dec, and John Schimmel. 2013. Evaluating Accessibility in Fabrication Tools for Children. In Proceedings of the 12th International Conference on Interaction Design and Children (New York, New York, USA) (IDC ’13). Association for Computing Machinery, New York, NY, USA, 617–620. https://doi.org/10.1145/2485760.2485882",
      "doi": "10.1145/2485760.2485882"
    },
    {
      "text": "Kevin Lefeuvre, Sören Totzauer, Andreas Bischof, Albrecht Kurze, Michael Storz, Lisa Ullmann, and Arne Berger. 2016. Loaded Dice: Exploring the Design Space of Connected Devices with Blind and Visually Impaired People. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction (Gothenburg, Sweden) (NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, Article 31, 10 pages. https://doi.org/10.1145/2971485.2971524",
      "doi": "10.1145/2971485.2971524"
    },
    {
      "text": "Jen Lewis. 2015. Barriers to women’s involvement in hackspaces and makerspaces. Access as spaces. Available at: http://make-cdn.s3.amazonaws.com/make/advertising/MFBA%202014%20research%20deck_FINAL.pdf (accessed 10 May 2016) (2015).",
      "doi": ""
    },
    {
      "text": "MakeMedia. 2014. Attendee study Maker Faire Bay Area 2014. Retrived from http://make-cdn.s3.amazonaws.com/make/advertising/MFBA%202014%20research%20deck_FINAL.pdf.",
      "doi": ""
    },
    {
      "text": "J. Maloney, L. Burd, Y. Kafai, N. Rusk, B. Silverman, and M. Resnick. 2004. Scratch: a sneak preview [education]. In Proceedings. Second International Conference on Creating, Connecting and Collaborating through Computing, 2004, Kyoto, Japan, 104–109.",
      "doi": ""
    },
    {
      "text": "Lauren R. Milne and Richard E. Ladner. 2018. Blocks4All: Overcoming Accessibility Barriers to Blocks Programming for Children with Visual Impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3173574.3173643",
      "doi": "10.1145/3173574.3173643"
    },
    {
      "text": "Vivian Genaro Motti and Anna Evmenova. 2019. Designing Technologies for Neurodiverse Users: Considerations from Research Practice.",
      "doi": ""
    },
    {
      "text": "National Health Service. 2018. Severe head injury. https://www.nhs.uk/conditions/severe-head-injury/",
      "doi": ""
    },
    {
      "text": "Aisling Ann O’Kane, Amy Hurst, Gerrit Niezen, Nicolai Marquardt, Jon Bird, and Gregory Abowd. 2016. Advances in DIY Health and Wellbeing. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems - CHI EA ’16. ACM Press, New York, New York, USA, 3453–3460. https://doi.org/10.1145/2851581.2856467",
      "doi": "10.1145/2851581.2856467"
    },
    {
      "text": "Jie Qi, Leah Buechley, Andrew “bunnie” Huang, Patricia Ng, Sean Cross, and Joseph A. Paradiso. 2018. Chibitronics in the Wild: Engaging New Communities in Creating Technology with Paper Electronics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 252, 11 pages. https://doi.org/10.1145/3173574.3173826",
      "doi": "10.1145/3173574.3173826"
    },
    {
      "text": "Mitchel Resnick and Eric Rosenbaum. 2013. Designing for tinkerability. Design, make, play: Growing the next generation of STEM innovators (2013), 163–181.",
      "doi": ""
    },
    {
      "text": "JooYoung Seo. 2019. Is the Maker Movement Inclusive of ANYONE?: Three Accessibility Considerations to Invite Blind Makers to the Making World. TechTrends 63, 5 (2019), 514–520. https://doi.org/10.1007/s11528-019-00377-3",
      "doi": ""
    },
    {
      "text": "The Office Of National Statistics. 2019. Disability pay gaps in the UK: 2018. https://www.ons.gov.uk/peoplepopulationandcommunity/healthandsocialcare/disability/articles/disabilitypaygapsintheuk/2018.",
      "doi": ""
    },
    {
      "text": "Nick Taylor, Ursula Hurley, and Philip Connolly. 2016. Making Community: The Wider Role of Makerspaces in Public Life. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 1415–1425. https://doi.org/10.1145/2858036.2858073",
      "doi": "10.1145/2858036.2858073"
    },
    {
      "text": "Austin L. Toombs, Shaowen Bardzell, and Jeffrey Bardzell. 2015. The Proper Care and Feeding of Hackerspaces: Care Ethics and Cultures of Making. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 629–638. https://doi.org/10.1145/2702123.2702522",
      "doi": "10.1145/2702123.2702522"
    },
    {
      "text": "Christopher James Vincent, Gerrit Niezen, Aisling Ann O’Kane, and Katarzyna Stawarz. 2015. Can Standards and Regulations Keep Up With Health Technology?JMIR mHealth uHealth 3, 2 (03 Jun 2015), e64. https://doi.org/10.2196/mhealth.3918",
      "doi": ""
    }
  ]
}