{
  "doi": "10.1145/3411764.3445311",
  "title": "FlexTruss: A Computational Threading Method for Multi-material, Multi-form and Multi-use Prototyping",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "3D printing, as a rapid prototyping technique, usually fabricates objects that are difficult to modify physically. This paper presents FlexTruss, a design and construction pipeline based on the assembly of modularized truss-shaped objects fabricated with conventional 3D printers and assembled by threading. To create an end-to-end system, a parametric design tool with an optimal Euler path calculation method is developed, which can support both inverse and forward design workflow and multi-material construction of modular parts. In addition, the assembly of truss modules by threading is evaluated with a series of application cases to demonstrate the affordance of FlexTruss. We believe that FlexTruss extends the design space of 3D printing beyond typically hard and fixed forms, and it will provide new capabilities for designers and researchers to explore the use of such flexible truss structures in human-object interaction.",
  "authors": [
    {
      "name": "Lingyun Sun",
      "institution": "International Design Institute Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659025067",
      "orcid": "0000-0002-5561-0493"
    },
    {
      "name": "Jiaji Li",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529777",
      "orcid": "0000-0002-8864-2061"
    },
    {
      "name": "Yu Chen",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528259",
      "orcid": "missing"
    },
    {
      "name": "Yue Yang",
      "institution": "Zhejiang University, China",
      "img": "/do/10.1145/contrib-99659527017/rel-imgonly/___.jpeg",
      "acmid": "99659527017",
      "orcid": "0000-0002-1771-8057"
    },
    {
      "name": "Zhi Yu",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658715918",
      "orcid": "missing"
    },
    {
      "name": "Danli Luo",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588096",
      "orcid": "0000-0001-6459-2859"
    },
    {
      "name": "Jianzhe Gu",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260311",
      "orcid": "missing"
    },
    {
      "name": "Lining Yao",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261439",
      "orcid": "0000-0002-8842-2317"
    },
    {
      "name": "Ye Tao",
      "institution": "Zhejiang University City College, China",
      "img": "/do/10.1145/contrib-87258822957/rel-imgonly/tao_2015.jpg",
      "acmid": "87258822957",
      "orcid": "0000-0002-9152-7793"
    },
    {
      "name": "Guanyun Wang",
      "institution": "Zhejiang University, China",
      "img": "/do/10.1145/contrib-87258679957/rel-imgonly/20201100____v6.jpg",
      "acmid": "87258679957",
      "orcid": "0000-0002-7904-1504"
    }
  ],
  "references": [
    {
      "text": "Harshit Agrawal, Udayan Umapathi, Robert Kovacs, Johannes Frohnhofen, Hsiang-Ting Chen, Stefanie Mueller, and Patrick Baudisch. 2015. Protopiper: Physically Sketching Room-Sized Objects at Actual Scale. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST ’15), 427–436. https://doi.org/10.1145/2807442.2807505",
      "doi": "10.1145/2807442.2807505"
    },
    {
      "text": "Davide Jose Nogueira Amorim, Troy Nachtigall, and Miguel Bruns Alonso. 2019. Exploring mechanical meta-material structures through personalised shoe sole design. In Proceedings of the ACM Symposium on Computational Fabrication, 1–8. https://doi.org/10.1145/3328939.3329001",
      "doi": "10.1145/3328939.3329001"
    },
    {
      "text": "Dustin Beyer, Serafima Gurevich, Stefanie Mueller, Hsiang-Ting Chen, and Patrick Baudisch. 2015. Platener: Low-Fidelity Fabrication of 3D Objects by Substituting 3D Print with Laser-Cut Plates. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), 1799–1806. https://doi.org/10.1145/2702123.2702225",
      "doi": "10.1145/2702123.2702225"
    },
    {
      "text": "Xiang “Anthony” Chen, Stelian Coros, and Scott E. Hudson. 2018. Medley: A Library of Embeddables to Explore Rich Material Properties for 3D Printed Objects. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1–12. https://doi.org/10.1145/3173574.3173736",
      "doi": "10.1145/3173574.3173736"
    },
    {
      "text": "Paolo Cignoni, Nico Pietroni, Luigi Malomo, and Roberto Scopigno. 2014. Field-Aligned Mesh Joinery. ACM Trans. Graph. 33, 1. https://doi.org/10.1145/2537852",
      "doi": "10.1145/2537852"
    },
    {
      "text": "Laura Devendorf and Kimiko Ryokai. 2015. Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), 2477–2486. https://doi.org/10.1145/2702123.2702547",
      "doi": "10.1145/2702123.2702547"
    },
    {
      "text": "Loe Feijs, Troy Nachtigall, and Oscar Tomico. Sole Maker: Towards Ultra- personalised Shoe Design Using Voronoi Diagrams and 3D Printing. 11.",
      "doi": ""
    },
    {
      "text": "Madeline Gannon, Tovi Grossman, and George Fitzmaurice. 2016. ExoSkin: On-Body Fabrication. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), 5996–6007. https://doi.org/10.1145/2858036.2858576",
      "doi": "10.1145/2858036.2858576"
    },
    {
      "text": "Jianzhe Gu, David E. Breen, Jenny Hu, Lifeng Zhu, Ye Tao, Tyson Van de Zande, Guanyun Wang, Yongjie Jessica Zhang, and Lining Yao. 2019. Geodesy: Self-Rising 2.5D Tiles by Printing along 2D Geodesic Closed Path. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 1–10. https://doi.org/10.1145/3290605.3300267",
      "doi": "10.1145/3290605.3300267"
    },
    {
      "text": "Jianzhe Gu, Vidya Narayanan, Guanyun Wang, Danli Luo, Harshika Jain, Kexin Lu, Fang Qin, Sijia Wang, James McCann, and Lining Yao. 2020. Inverse Design Tool for Asymmetrical Self-Rising Surfaces with Color Texture. In Symposium on Computational Fabrication (SCF ’20). https://doi.org/10.1145/3424630.3425420",
      "doi": ""
    },
    {
      "text": "Yijiang Huang, Juyong Zhang, Xin Hu, Guoxian Song, Zhongyuan Liu, Lei Yu, and Ligang Liu. 2016. FrameFab: Robotic Fabrication of Frame Shapes. ACM Trans. Graph. 35, 6. https://doi.org/10.1145/2980179.2982401",
      "doi": "10.1145/2980179.2982401"
    },
    {
      "text": "Emmanuel Iarussi, Wilmot Li, and Adrien Bousseau. 2015. WrapIt: Computer-Assisted Crafting of Wire Wrapped Jewelry. ACM Trans. Graph. 34, 6. https://doi.org/10.1145/2816795.2818118",
      "doi": "10.1145/2816795.2818118"
    },
    {
      "text": "Alexandra Ion, David Lindlbauer, Philipp Herholz, Marc Alexa, and Patrick Baudisch. 2019. Understanding Metamaterial Mechanisms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 1–14. https://doi.org/10.1145/3290605.3300877",
      "doi": "10.1145/3290605.3300877"
    },
    {
      "text": "Alexandra Ion, Ludwig Wall, Robert Kovacs, and Patrick Baudisch. 2017. Digital Mechanical Metamaterials. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 977–988. https://doi.org/10.1145/3025453.3025624",
      "doi": "10.1145/3025453.3025624"
    },
    {
      "text": "Alec Jacobson. 2019. RodSteward: A Design-to-Assembly System for Fabrication using 3D-Printed Joints and Precision-Cut Rods.",
      "doi": ""
    },
    {
      "text": "Michael D. Jones, Kevin Seppi, and Dan R. Olsen. 2016. What You Sculpt is What You Get: Modeling Physical Interactive Devices with Clay and 3D Printed Widgets. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), 876–886. https://doi.org/10.1145/2858036.2858493",
      "doi": "10.1145/2858036.2858493"
    },
    {
      "text": "Robert Kovacs, Alexandra Ion, Pedro Lopes, Tim Oesterreich, Johannes Filter, Philipp Otto, Tobias Arndt, Nico Ring, Melvin Witte, Anton Synytsia, and Patrick Baudisch. 2019. TrussFormer: 3D Printing Large Kinetic Structures. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), 1. https://doi.org/10.1145/3290607.3311766",
      "doi": "10.1145/3290607.3311766"
    },
    {
      "text": "Robert Kovacs, Anna Seufert, Ludwig Wall, Hsiang-Ting Chen, Florian Meinel, Willi Müller, Sijing You, Maximilian Brehm, Jonathan Striebel, Yannis Kommana, Alexander Popiak, Thomas Bläsius, and Patrick Baudisch. 2017. TrussFab: Fabricating Sturdy Large-Scale Structures on Desktop 3D Printers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 2606–2616. https://doi.org/10.1145/3025453.3026016",
      "doi": "10.1145/3025453.3026016"
    },
    {
      "text": "Robert Kovacs, Anna Seufert, Ludwig Wall, Hsiang-Ting Chen, Florian Meinel, Willi Müller, Sijing You, Maximilian Brehm, Jonathan Striebel, Yannis Kommana, Alexander Popiak, Thomas Bläsius, and Patrick Baudisch. 2017. TrussFab: Fabricating Sturdy Large-Scale Structures on Desktop 3D Printers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 2606–2616. https://doi.org/10.1145/3025453.3026016",
      "doi": "10.1145/3025453.3026016"
    },
    {
      "text": "Danny Leen, Raf Ramakers, and Kris Luyten. 2017. StrutModeling: A Low-Fidelity Construction Kit to Iteratively Model, Test, and Adapt 3D Objects. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (UIST ’17), 471–479. https://doi.org/10.1145/3126594.3126643",
      "doi": "10.1145/3126594.3126643"
    },
    {
      "text": "Wallace Lira, Chi-Wing Fu, and Hao Zhang. 2019. Fabricable eulerian wires for 3D shape abstraction. ACM Transactions on Graphics 37, 6: 1–13. https://doi.org/10.1145/3272127.3275049",
      "doi": "10.1145/3272127.3275049"
    },
    {
      "text": "Vittorio Megaro, Jonas Zehnder, Moritz Bächer, Stelian Coros, Markus Gross, and Bernhard Thomaszewski. 2017. A Computational Design Tool for Compliant Mechanisms. ACM Trans. Graph. 36, 4. https://doi.org/10.1145/3072959.3073636",
      "doi": "10.1145/3072959.3073636"
    },
    {
      "text": "Eder Miguel, Mathias Lepoutre, and Bernd Bickel. 2016. Computational Design of Stable Planar-Rod Structures. ACM Trans. Graph. 35, 4. https://doi.org/10.1145/2897824.2925978",
      "doi": "10.1145/2897824.2925978"
    },
    {
      "text": "Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, François Guimbretière, and Patrick Baudisch. 2014. WirePrint: 3D printed previews for fast prototyping. In Proceedings of the 27th annual ACM symposium on User interface software and technology - UIST ’14, 273–280. https://doi.org/10.1145/2642918.2647359",
      "doi": "10.1145/2642918.2647359"
    },
    {
      "text": "Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, and Patrick Baudisch. 2014. faBrickation: fast 3D printing of functional objects by integrating construction kit building blocks. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14, 3827–3834. https://doi.org/10.1145/2556288.2557005",
      "doi": "10.1145/2556288.2557005"
    },
    {
      "text": "Ken Nakagaki, Artem Dementyev, Sean Follmer, Joseph A. Paradiso, and Hiroshi Ishii. 2016. ChainFORM: A Linear Integrated Modular Hardware System for Shape Changing Interfaces. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (UIST ’16), 87–96. https://doi.org/10.1145/2984511.2984587",
      "doi": "10.1145/2984511.2984587"
    },
    {
      "text": "Ken Nakagaki, Sean Follmer, and Hiroshi Ishii. 2015. LineFORM: Actuated Curve Interfaces for Display, Interaction, and Constraint. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (UIST ’15), 333–339. https://doi.org/10.1145/2807442.2807452",
      "doi": "10.1145/2807442.2807452"
    },
    {
      "text": "Christos H. Papadimitriou. 1976. On the Complexity of Edge Traversing. J. ACM 23, 3: 544–554. https://doi.org/10.1145/321958.321974",
      "doi": "10.1145/321958.321974"
    },
    {
      "text": "Huaishu Peng, Jimmy Briggs, Cheng-Yao Wang, Kevin Guo, Joseph Kider, Stefanie Mueller, Patrick Baudisch, and François Guimbretière. 2018. RoMA: Interactive Fabrication with Augmented Reality and a Robotic 3D Printer. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–12. https://doi.org/10.1145/3173574.3174153",
      "doi": "10.1145/3173574.3174153"
    },
    {
      "text": "Huaishu Peng, Rundong Wu, Steve Marschner, and François Guimbretière. 2016. On-The-Fly Print: Incremental Printing While Modelling. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 887–896. https://doi.org/10.1145/2858036.2858106",
      "doi": "10.1145/2858036.2858106"
    },
    {
      "text": "Huaishu Peng, Amit Zoran, and François V. Guimbretière. 2015. D-Coil: A Hands-on Approach to Digital 3D Models Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), 1807–1815. https://doi.org/10.1145/2702123.2702381",
      "doi": ""
    },
    {
      "text": "Hiroki Sato, Young ah Seong, Ryosuke Yamamura, Hiromasa Hayashi, Katsuhiro Hata, Hisato Ogata, Ryuma Niiyama, and Yoshihiro Kawahara. 2020. Soft yet Strong Inflatable Structures for a Foldable and Portable Mobility. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA ’20), 1–4. https://doi.org/10.1145/3334480.3383147",
      "doi": "10.1145/3334480.3383147"
    },
    {
      "text": "Roy Shilkrot, Pattie Maes, Joseph A. Paradiso, and Amit Zoran. 2015. Augmented Airbrush for Computer Aided Painting (CAP). ACM Trans. Graph. 34, 2. https://doi.org/10.1145/2699649",
      "doi": "10.1145/2699649"
    },
    {
      "text": "Mélina Skouras, Bernhard Thomaszewski, Peter Kaufmann, Akash Garg, Bernd Bickel, Eitan Grinspun, and Markus Gross. 2014. Designing Inflatable Structures. ACM Trans. Graph. 33, 4. https://doi.org/10.1145/2601097.2601166",
      "doi": "10.1145/2601097.2601166"
    },
    {
      "text": "Sporadical. Dolní Břežany Sports Hall. Retrieved from https://www.archdaily.com/889816/dolni-brezany-sports-hall-sporadical",
      "doi": ""
    },
    {
      "text": "Lingyun Sun, Jiaji Li, Yu Chen, Yue Yang, Ye Tao, Guanyun Wang, and Lining Yao. 2020. 4DTexture: A Shape-Changing Fabrication Method for 3D Surfaces with Texture. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, 1–7. https://doi.org/10.1145/3334480.3383053",
      "doi": "10.1145/3334480.3383053"
    },
    {
      "text": "Haruki Takahashi and Jeeeun Kim. 2019. 3D Pen + 3D Printer: Exploring the Role of Humans and Fabrication Machines in Creative Making. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 1–12. https://doi.org/10.1145/3290605.3300525",
      "doi": "10.1145/3290605.3300525"
    },
    {
      "text": "Ye Tao, Guanyun Wang, Caowei Zhang, Nannan Lu, Xiaolian Zhang, Cheng Yao, and Fangtian Ying. 2017. WeaveMesh: A Low-Fidelity and Low-Cost Prototyping Approach for 3D Models Created by Flexible Assembly. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 509–518. https://doi.org/10.1145/3025453.3025699",
      "doi": "10.1145/3025453.3025699"
    },
    {
      "text": "Guanyun Wang, Tingyu Cheng, Youngwook Do, Humphrey Yang, Ye Tao, Jianzhe Gu, Byoungkwon An, and Lining Yao. 2018. Printed Paper Actuator: A Low-Cost Reversible Actuation and Sensing Method for Shape Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–12. https://doi.org/10.1145/3173574.3174143",
      "doi": "10.1145/3173574.3174143"
    },
    {
      "text": "Guanyun Wang, Fang Qin, Haolin Liu, Ye Tao, Yang Zhang, Yongjie Jessica Zhang, and Lining Yao. 2020. MorphingCircuit: An Integrated Design, Simulation, and Fabrication Workflow for Self-Morphing Electronics. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4. https://doi.org/10.1145/3432232",
      "doi": "10.1145/3432232"
    },
    {
      "text": "Guanyun Wang, Ye Tao, Ozguc Bertug Capunaman, Humphrey Yang, and Lining Yao. 2019. A-Line: 4D Printing Morphing Linear Composite Structures. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 1–12. https://doi.org/10.1145/3290605.3300656",
      "doi": "10.1145/3290605.3300656"
    },
    {
      "text": "Guanyun Wang, Humphrey Yang, Zeyu Yan, Nurcan Gecer Ulu, Ye Tao, Jianzhe Gu, Levent Burak Kara, and Lining Yao. 2018. 4DMesh: 4D Printing Morphing Non-Developable Mesh Surfaces. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST ’18, 623–635. https://doi.org/10.1145/3242587.3242625",
      "doi": "10.1145/3242587.3242625"
    },
    {
      "text": "Christian Weichel, John Hardy, Jason Alexander, and Hans Gellersen. 2015. ReForm: Integrating Physical and Digital Design through Bidirectional Fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST ’15, 93–102. https://doi.org/10.1145/2807442.2807451",
      "doi": "10.1145/2807442.2807451"
    },
    {
      "text": "Karl D.D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin, and Mark D. Gross. 2010. Interactive Fabrication: New Interfaces for Digital Fabrication. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’11), 69–72. https://doi.org/10.1145/1935701.1935716",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "Rundong Wu, Huaishu Peng, François Guimbretière, and Steve Marschner. 2016. Printing Arbitrary Meshes with a 5DOF Wireframe Printer. ACM Trans. Graph. 35, 4. https://doi.org/10.1145/2897824.2925966",
      "doi": "10.1145/2897824.2925966"
    },
    {
      "text": "Ya-Ting Yue, Xiaolong Zhang, Yongliang Yang, Gang Ren, Yi-King Choi, and Wenping Wang. 2017. WireDraw: 3D Wire Sculpturing Guided with Mixed Reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 3693–3704. https://doi.org/10.1145/3025453.3025792",
      "doi": "10.1145/3025453.3025792"
    },
    {
      "text": "Jonas Zehnder, Stelian Coros, and Bernhard Thomaszewski. 2016. Designing Structurally-Sound Ornamental Curve Networks. ACM Trans. Graph. 35, 4. https://doi.org/10.1145/2897824.2925888",
      "doi": "10.1145/2897824.2925888"
    },
    {
      "text": "Haisen Zhao, Fanglin Gu, Qi-Xing Huang, Jorge Garcia, Yong Chen, Changhe Tu, Bedrich Benes, Hao Zhang, Daniel Cohen-Or, and Baoquan Chen. 2016. Connected Fermat Spirals for Layered Fabrication. ACM Trans. Graph. 35, 4. https://doi.org/10.1145/2897824.2925958",
      "doi": "10.1145/2897824.2925958"
    },
    {
      "text": "Amit Zoran. 2013. Hybrid Basketry: Interweaving Digital Practice within Contemporary Craft. In ACM SIGGRAPH 2013 Art Gallery (SIGGRAPH ’13), 324–331. https://doi.org/10.1145/2503649.2503651",
      "doi": "10.1145/2503649.2503651"
    },
    {
      "text": "Amit Zoran and Joseph A. Paradiso. 2013. FreeD: A Freehand Digital Sculpting Tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), 2613–2616. https://doi.org/10.1145/2470654.2481361",
      "doi": "10.1145/2470654.2481361"
    },
    {
      "text": "Meshlab. Retrieved September 18, 2020 from https://www.meshlab.net/",
      "doi": ""
    }
  ]
}