{
  "doi": "10.1145/3411764.3445282",
  "title": "CHI Against Bullying: Taking Stock of the Past and Envisioning the Future",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "Bullying is a challenge concerning us all, and particularly our children. This has already been acknowledged by CHI, among others. Despite the interest, there is a lack of comprehensive understanding of the state of the art – a critical review is needed, addressing bullying in the lives of children, in the context of and/or by the means of design and technology, covering CHI as well as related computing fields, being inspired by the strong body of knowledge within human sciences. We report on a comprehensive literature review on the topic, with the aim to understand what and how has been done so far to handle this troublesome and widespread phenomenon as well as to indicate how to move the field forward. We report how the topic has been examined and with what kind of means tackled, revealing interesting underlying assumptions about design, technology and human agency.",
  "authors": [
    {
      "name": "Netta Iivari",
      "institution": "University of Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331495181",
      "orcid": "missing"
    },
    {
      "name": "Leena Ventä-Olkkonen",
      "institution": "INTERACT Research Unit University of Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81453660175",
      "orcid": "missing"
    },
    {
      "name": "Sumita Sharma",
      "institution": "INTERACT Research Unit University of Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86159148557",
      "orcid": "missing"
    },
    {
      "name": "Tonja Molin-Juustila",
      "institution": "INTERACT research unit University of Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385604296",
      "orcid": "missing"
    },
    {
      "name": "Essi Kinnunen",
      "institution": "INTERACT Research Unit University of Oulu, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701745",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Patricia W. Agatston, Robin Kowalski and Susan Limber. 2007. Students' Perspectives on Cyber Bullying. Journal of Adolescent Health 41 (6 SUPPL.): S59-S60. https://doi.org/10.1016/j.jadohealth.2007.09.003",
      "doi": ""
    },
    {
      "text": "Álvarez-García, D., García, T. and Núñez, J.C., 2015. Predictors of school bullying perpetration in adolescence: A systematic review. Aggression and Violent Behavior, 23, pp.126-136.",
      "doi": ""
    },
    {
      "text": "Alissa N. Antle, Ofir Sadka, Iulian Radu, Boxiao Gong, Victor Cheung, and Uddipana Baishya. 2019. EmotoTent: Reducing School Violence through Embodied Empathy Games. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19). Association for Computing Machinery, New York, NY, USA, 755–760. https://doi.org/10.1145/3311927.3326596",
      "doi": "10.1145/3311927.3326596"
    },
    {
      "text": "Asher, Y., Stark, A. and Fireman, G.D., 2017. Comparing electronic and traditional bullying in embarrassment and exclusion scenarios. Computers in Human Behavior, 76, pp. 26-34.",
      "doi": "10.1016/j.chb.2017.06.037"
    },
    {
      "text": "Zahra Ashktorab and Jessica Vitak. 2016. Designing Cyberbullying Mitigation and Prevention Solutions through Participatory Design With Teenagers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI '16). Association for Computing Machinery, New York, NY, USA, 3895–3905. https://doi.org/10.1145/2858036.2858548",
      "doi": "10.1145/2858036.2858548"
    },
    {
      "text": "Ruth Aylett, Sandy Louchart, João Dias, Ana Paiva, Marco Vala. 2005. FearNot! – An Experiment in Emergent Narrative. International Workshop on Intelligent Virtual Agents, 305-316. Springer, Berlin, Heidelberg. https://doi.org/10.1007/11550617_26",
      "doi": "10.1007/11550617_26"
    },
    {
      "text": "Niels Baas, Menno De Jong, and Constance Drossaert. 2013. Children's Perspectives on Cyberbullying: Insights Based on Participatory Research. Cyberpsychology, Behavior, and Social Networking 16 (4): 248-253. https://doi.otg/10.1089/cyber.2012.0079",
      "doi": ""
    },
    {
      "text": "Karla Badillo-Urquiola, Diva Smriti, Brenna McNally Evan Golub, Elizabeth Bonsignore, and Pamela J. Wisniewski. 2019. Stranger Danger! Social Media App Features Co-designed with Children to Keep Them Safe Online. Proceedings of the 18th ACM International Conference on Interaction Design and Children, 394-406. https://doi.org/10.1145/3311927.3323133",
      "doi": ""
    },
    {
      "text": "Glenda J.L. Battey and Vicki Ebbeck. 2013. A Qualitative Exploration of an Experiential Education Bully Prevention Curriculum. Journal of Experiential Education 36 (3): 203–17. https://doi.org/10.1177/1053825913489102",
      "doi": ""
    },
    {
      "text": "Linda Beckman, Curt Hagquist and Lisa Hellström. 2013. Discrepant Gender Patterns for Cyberbullyiyng and Traditional Bullying - an Analysis of Swedish Adolescent Data. Computers in Human Behavior 29 (5): 1896-1903. https://doi.org/10.1016/j.chb.2013.03.010",
      "doi": ""
    },
    {
      "text": "Maria Beltrán-Catalán, Izabela Zych, Rosario Ortega-Ruiz, and Vicente J. Llorent. 2018. Victimisation through Bullying and Cyberbullying: Emotional Intelligence, Severity of Victimisation and Technology Use in Different Types of Victims. Psicothema 30 (2): 183–88. https://doi.org/10.7334/psicothema2017.313",
      "doi": ""
    },
    {
      "text": "Beran, T., Mishna, F., McInroy, L.B. and Shariff, S., 2015. Children's experiences of cyberbullying: A Canadian national study. Children & Schools, 37(4), pp.207-214.",
      "doi": ""
    },
    {
      "text": "Cindy L. Bethel, Zachary Henkel, Deborah Eakin, David. C. May, and Melinda Pilkinton. 2017. Moving Toward an Intelligent Interactive Social Engagement Framework for Information Gathering. https://doi.org/10.1109/SAMI.2017.7880307",
      "doi": ""
    },
    {
      "text": "Rina A. Bonanno and Shelley Hymel. 2013. Cyber Bullying and Internalizing Difficulties: Above and Beyond the Impact of Traditional Forms of Bullying. Journal of Youth and Adolescence 42 (5): 685-697. https://doi.org/10.1007/s10964-013-9937-1",
      "doi": ""
    },
    {
      "text": "Tibor Bosse Sven Stam. 2011. A normative agent system to prevent cyberbullying. In 2011 IEEE/WIC/ACM International Conferences on Web Intelligence and Intelligent Agent Technology (Vol. 2, pp. 425-430). IEEE. https://doi.org/10.1109/WI-IAT.2011.24",
      "doi": ""
    },
    {
      "text": "Leanne Bowler, Cory Knobel & Eleanor Mattern. 2015. From cyberbullying to well‐being: A narrative‐based participatory approach to values‐oriented design for social media. Journal of the Association for Information Science and Technology, 66(6), 1274-1293. https://doi.org/10.1002/asi.23270",
      "doi": "10.5555/3150797.3150812"
    },
    {
      "text": "Bradshaw, C.P. and Johnson, R.M., 2011. The social context of bullying and peer victimization: An introduction to the special issue. Journal of School Violence, 10(2), pp.107-114.",
      "doi": ""
    },
    {
      "text": "Sheryl Brahnam, Jenifer J. Roberts, Loris Nanni, Cathy L. Starr and Sandra L. Bailey. 2015. Design of a Bullying detection/alert System for School-Wide Intervention. Lecture Notes in Computer Science (Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Vol. 9170. https://doi.org/10.1007/978-3-319-20916-6_64",
      "doi": ""
    },
    {
      "text": "Steven Lawrence Brewer Jr, Hannah Meckley-Brewer, and Philip M. Stinson. 2017. Fearful and Distracted in School: Predicting Bullying among Youths. Children & Schools 39 (4): 219–26. https://doi.org/10.1093/cs/cdx021",
      "doi": ""
    },
    {
      "text": "Calvo-Morata, A., Freire-Morán, M., Martínez-Ortiz, I., & Fernández-Manjón, B. (2019). Applicability of a cyberbullying videogame as a teacher tool: Comparing teachers and educational sciences students. IEEE Access, 7, 55841-55850.",
      "doi": ""
    },
    {
      "text": "Antonio Calvo-Morata, Dan Christian Rotaru, Cristina Alonso-Fernández, Manuel Freire, Iván Martínez-Ortiz & Baltasar Fernández-Manjón. Validation of a cyberbullying serious game using game analytics. IEEE Transactions on Learning Technologies. https://doi.org/10.1109/TLT.2018.2879354.",
      "doi": ""
    },
    {
      "text": "Antonio Calvo-Morata, Dan Cristina Alonso-Fernández, Manuel Freire, Iván Martínez-Ortiz & Baltasar Fernández-Manjón 2020. Serious games to prevent and detect bullying and cyberbullying: A systematic serious games and literature review. Computers & Education, 157, 103958. https://doi.org/10.1016/j.compedu.2020.103958",
      "doi": ""
    },
    {
      "text": "Marilyn Campbell, Barbara Spears, Phillip Slee, Des Butler and Sally Kif. 2012. Victims' Perceptions of Traditional and Cyberbullying, and the Psychosocial Correlates of their Victimisation. Emotional and Behavioural Difficulties 17 (3-4): 389-401. https://doi.org/10.1080/13632752.2012.704316",
      "doi": ""
    },
    {
      "text": "Charles M. Carson. 2005. . \"A Historical View of Douglas McGregor's Theory Y.\" Management Decision 43 (3): 450-460. https://doi.org/10.1108/00251740510589814",
      "doi": ""
    },
    {
      "text": "José A. Casas, Rosario Del Rey and Rosario Ortega-Ruiz. 2013. Bullying and Cyberbullying: Convergent and Divergent Predictor Variables. Computers in Human Behavior 29 (3), 580-587. https://doi.org/10.1016/j.chb.2012.11.015",
      "doi": "10.1016/j.chb.2012.11.015"
    },
    {
      "text": "Chalamandaris, A.G. and Piette, D., 2015. School-based anti-bullying interventions: Systematic review of the methodology to assess their effectiveness. Aggression and violent behavior, 24, pp.131-174.",
      "doi": ""
    },
    {
      "text": "Chan, H.C.O. and Wong, D.S., 2015. Traditional school bullying and cyberbullying in Chinese societies: Prevalence and a review of the whole-school intervention approach. Aggression and Violent Behavior, 23, pp.98-108.",
      "doi": ""
    },
    {
      "text": "Nee Nee Chan, P. Ahrumugam, Herbert Scheithauer, Anja Schultze-Krumbholz, and P. B. Ooi. 2020. A Hermeneutic Phenomenological Study of Students' and School Counsellors' “lived Experiences” of Cyberbullying and Bullying. Computers and Education 146. https://doi.org/10.1016/j.compedu.2019.103755",
      "doi": ""
    },
    {
      "text": "Yunfei Chen, Lanbo Zhang, Aaron Michelony, and Yi Zhang. 2012. 4Is of social bully filtering: identity, inference, influence, and intervention. In Proceedings of the 21st ACM international conference on Information and knowledge management (CIKM '12). Association for Computing Machinery, New York, NY, USA, 2677–2679. https://doi.org/10.1145/2396761.2398723",
      "doi": "10.1145/2396761.2398723"
    },
    {
      "text": "Chen, Y.T. and Li, C.C., 2014, September. Study of service innovation on School Bullying treatment with inviting Knowledge Management features. In 2014 IEEE International Conference on Management of Innovation and Technology (pp. 306-311). IEEE.",
      "doi": ""
    },
    {
      "text": "Li‐Ming Chen. 2015. Self-Reported Frequency and Perceived Severity of being Bullied among Elementary School Students. Journal of School Health 85 (9): 587-594. https://doi.org/10.1111/josh.12289",
      "doi": ""
    },
    {
      "text": "Enrica Ciucci, Andrea Baroncelli, Ilaria Grazzani, Veronica Ornaghi and Claudia Caprin. 2016 .Emotional Arousal and Regulation: Further Evidence of the Validity of the \"how I Feel\" Questionnaire for use with School-Age Children. Journal of School Health 86 (3): 195-203. https://doi.org/10.1111/josh.12370",
      "doi": ""
    },
    {
      "text": "Clarke, A.M., Kuosmanen, T. and Barry, M.M., 2015. A systematic review of online youth mental health promotion and prevention interventions. Journal of youth and adolescence, 44(1), pp.90-113.",
      "doi": ""
    },
    {
      "text": "Coelho, V.A. and Romão, A.M., 2018. The relation between social anxiety, social withdrawal and (cyber) bullying roles: A multilevel analysis. Computers in Human Behavior, 86, pp. 218-226.",
      "doi": ""
    },
    {
      "text": "Robin Cohen, Disney Yan Lam, Nikhil Agarwal, Michael Cormier, Jasmeet Jagdev, Tianqi Jin, Madhur Kukreti, Jiawei Liu, Kamal Rahim, Rahul Rawat, W. Sun, D. Wang & M. Wexler. 2014. Using computer technology to address the problem of cyberbullying. ACM SIGCAS Computers and Society, 44(2), 52-61. https://doi.org/10.1145/2656870.2656876",
      "doi": "10.1145/2656870.2656876"
    },
    {
      "text": "Justin Connolly, Pamela Hussey, and Regina Connolly. 2014. Technology-Enabled Bullying and Adolescent Resistance to Report: The Need to Examine Causal Factors. Interactive Technology and Smart Education 11 (2): 86-98. https://.doi.org/10.1108/ITSE-04-2014-0003",
      "doi": ""
    },
    {
      "text": "Peter de Jong and Insoo Kim Berg. 2016. Ratkaisukeskeisen lyhytterapian oppikirja. Helsinki: Lyhytterapiainstutuutti Oy. (Original Peter de Jong and Insoo Kim Berg. 2008. Interviewing for solutions (3rd ed.). Belmont, CA: Thomson Higher Education.)",
      "doi": ""
    },
    {
      "text": "Jan Derboven, Maarten Van Mechelen, and Karin Slegers. 2015. Multimodal Analysis in Participatory Design with Children: A Primary School Case Study. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 2825–2828. https://doi.org/10.1145/2702123.2702475",
      "doi": "10.1145/2702123.2702475"
    },
    {
      "text": "Ann DeSmet, Nathalie Aelterman, Sara Bastiaensens, Katrien Van Cleemput, Karolien Poels, Heidi Vandebosch, Greet Cardon, and Ilse De Bourdeaudhuij. 2015. Secondary School Educators' Perceptions and Practices in Handling Cyberbullying among Adolescents: A Cluster Analysis. Computers and Education 88: 192-201. https://doi.org/10.1016/j.compedu.2015.05.006",
      "doi": "10.1016/j.compedu.2015.05.006"
    },
    {
      "text": "DeSmet, A., Bastiaensens, S., Van Cleemput, K., Poels, K., Vandebosch, H., Deboutte, G., Herrewijn, L., Malliet, S., Pabian, S., Van Broeckhoven, F. and De Troyer, O., 2018. The efficacy of the Friendly Attac serious digital game to promote prosocial bystander behavior in cyberbullying among young adolescents: a cluster-randomized controlled trial. Computers in Human Behavior, 78, pp.336-347.",
      "doi": "10.1016/j.chb.2017.10.011"
    },
    {
      "text": "Karthik Dinakar, Birago Jones, Catherina Havasi, Henry Lieberman & Rosalind Picard.2012. Common sense reasoning for detection, prevention, and mitigation of cyberbullying. ACM Transactions on Interactive Intelligent Systems (TiiS), 2(3), 1-30. https://doi.org/10.1145/2362394.2362400",
      "doi": "10.1145/2362394.2362400"
    },
    {
      "text": "Ding, Y., Li, D., Li, X., Xiao, J., Zhang, H. and Wang, Y., 2020. Profiles of adolescent traditional and cyber bullying and victimization: The role of demographic, individual, family, school, and peer factors. Computers in Human Behavior, p.106439.",
      "doi": ""
    },
    {
      "text": "Edgerton, E., Reiney, E., Mueller, S., Reicherter, B., Curtis, K., Waties, S. and Limber, S.P., 2016. Identifying new strategies to assess and promote online health communication and social media outreach: an application in bullying prevention. Health promotion practice, 17(3), pp.448-456.",
      "doi": ""
    },
    {
      "text": "April Edwards, David Demoll, Lynne Edwards. 2020.Detecting Cyberbullying Activity Across Platforms. 17th International Conference on Information Technology–New Generations (ITNG 2020), 45-50. https://doi.org/10.1007/978-3-030-43020-7_7",
      "doi": ""
    },
    {
      "text": "Sibylle Enz, Cheryl Zoll, Nicola Vannini, Wolfgang Schneider, Lynne Hall, Ana Paiva, and Ruth Aylett. 2007. E-Motional Learning in Primary Schools: Fearnot! an Anti-Bullying Intervention Based on Virtual Role-Play with Intelligent Synthetic Characters. Electronic Journal of e-Learning, 6(2), 111-118.",
      "doi": ""
    },
    {
      "text": "Eva Eriksson, Gökçe Elif Baykal, Staffan Björk, and Olof Torgersson. 2019. Using Gameplay Design Patterns with Children in the Redesign of a Collaborative Co-located Game. Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19). Association for Computing Machinery, New York, NY, USA, 15–25. https://doi.org/10.1145/3311927.3323155",
      "doi": "10.1145/3311927.3323155"
    },
    {
      "text": "Evans, C.B., Fraser, M.W. and Cotter, K.L., 2014. The effectiveness of school-based bullying prevention programs: A systematic review. Aggression and Violent Behavior, 19(5), pp.532-544.",
      "doi": ""
    },
    {
      "text": "Hany Ferdinando, Tuija Huuki, Liang Ye, Tian Han, Zhu Zhang, Guobing Sun, Tapio Seppänen and Esko Alasaarela. 2019. VITEC: A Violence Detection Framework. Lecture Notes of the Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering, LNICST. Vol. 287. https://doi.org/10.1007/978-3-030-22971-9_1",
      "doi": ""
    },
    {
      "text": "Renata Ferreira, Mirna Frota, Jose de Vasconcelos Filho, Antonio Bastos, Geisy Luna & Karla Rolim, 2020. Comparison of features of a mobile application to report school violence through benchmarking. Journal of school health, 90(4), 295-300. https://doi.org/10.1111/josh.12876",
      "doi": ""
    },
    {
      "text": "Ferreira, P.C., Simão, A.V., Paiva, A. and Ferreira, A., 2020. Responsive bystander behaviour in cyberbullying: a path through self-efficacy. Behaviour & Information Technology, 39(5), pp.511-524.",
      "doi": ""
    },
    {
      "text": "Cynthia Franklin. 2015. An update on strengths-based, solution-focused brief therapy. Health & Social Work, 40, 73-76. https://doi.org/10.1093/hsw/hlv022",
      "doi": ""
    },
    {
      "text": "Cynthia Franklin, Anao Zhang, Adam Froerer & Shannon Johnson. 2017. Solution-focused brief therapy: A systematic review and meta‐summary of process research. Journal of Marital and Family Therapy, 43(1), 16-30. https://doi.org/10.1111/jmft.12193",
      "doi": ""
    },
    {
      "text": "Shangbin Gao and Liang Ye. 2019. A Physical and Verbal Bullying Detecting Algorithm Based on K-NN for School Bullying Prevention. Lecture Notes of the Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering, LNICST. Vol. 287. https://doi.org/10.1007/978-3-030-22971-9_13",
      "doi": ""
    },
    {
      "text": "Garzotto, F., Valoriani, M., & Bartoli, L. (2014). Touchless motion-based interaction for therapy of autistic children. In Virtual, Augmented Reality and Serious Games for Healthcare 1, 471-494. Springer, Berlin, Heidelberg. https://doi.org/10.1007/978-3-642-54816-1_23",
      "doi": ""
    },
    {
      "text": "Goodwin, J., Bradley, S.K., Donohoe, P., Queen, K., O'Shea, M. and Horgan, A., 2019. Bullying in schools: an evaluation of the use of drama in bullying prevention. Journal of Creativity in Mental Health, 14(3), pp.329-342.",
      "doi": ""
    },
    {
      "text": "Gutierrez Aponte, D.F. and Richards, D., 2013. Managing cyber-bullying in online educational virtual worlds. In Greuter, Stefan. IE2013 : proceedings of the 9th Australasian Conference on Interactive Entertainment : matters of life and death, p.1-9",
      "doi": ""
    },
    {
      "text": "Lynne Hall, Sarah Woods, Kerstin Dautenhahn, and Polly Sobreperez. 2004. Using storyboards to guide virtual world design. In Proceedings of the 2004 conference on Interaction design and children: building a community (IDC '04). Association for Computing Machinery, New York, NY, USA, 125–126. https://doi.org10.1145/1017833.1017853",
      "doi": "10.1145/1017833.1017853"
    },
    {
      "text": "Lynne Hall, Marco Vala, Marc Hall, Marc Webster, Sarah Woods, Adrian Gordon & Ruth Aylett. 2006. FearNot's Appearance: Reflecting children's expectations and perspectives. International Workshop on Intelligent Virtual Agents, 407-419. Springer, Berlin, Heidelberg. https://doi.org/10.1007/11821830_33",
      "doi": "10.1007/11821830_33"
    },
    {
      "text": "Lynne Hall, Susan Jones, Ana Paiva, and Ruth Aylett. 2009. FearNot! providing children with strategies to cope with bullying. In Proceedings of the 8th International Conference on Interaction Design and Children (IDC '09). Association for Computing Machinery, New York, NY, USA, 276–277. https://doi.org/10.1145/1551788.1551854",
      "doi": ""
    },
    {
      "text": "Tian Han, Jincheng Zhang, Zhu Zhang, Guobing Sun, Liang Ye, Hany Ferdinando, Esko Alasaarela, Tapio Seppänen, Xiaoyang Yu, and Shuchang Yang. 2018. Emotion Recognition and School Violence Detection from Children Speech. EURASIP Journal on Wireless Communications & Networking 2018 (1): 1. https://doi.org/10.1186/s13638-018-1253-8",
      "doi": ""
    },
    {
      "text": "Hartati, S., Safitri, D., Marini, A. and Wahyudi, A., 2020. Bullying Behavior in Early Childhood: Study at Early Childhood Education Institution in East Jakarta in Indonesia. Journal of Talent Development and Excellence, 12(1), pp.55-63.",
      "doi": ""
    },
    {
      "text": "Anne Helgeland, and Ingrid Lund. 2017. Children's Voices on Bullying in Kindergarten. Early Childhood Education Journal 45 (1): 133–41. https://doi.org/10.1007/s10643-016-0784-z",
      "doi": ""
    },
    {
      "text": "Henkel, Z. and Bethel, C.L., 2017, March. A robot forensic interviewer: The bad, the good, and the undiscovered. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (pp. 10-20).",
      "doi": ""
    },
    {
      "text": "Honjo, M., Hasegawa, T., Hasegawa, T., Mishima, K., Suda, T. and Yoshida, T., 2011, October. A framework to identify relationships among students in school bullying using digital communication media. In 2011 IEEE Third International Conference on Privacy, Security, Risk and Trust and 2011 IEEE Third International Conference on Social Computing (pp. 1474-1479). IEEE.",
      "doi": ""
    },
    {
      "text": "Horner, S., Asher, Y. and Fireman, G.D., 2015. The impact and response to electronic bullying and traditional bullying among adolescents. Computers in human behavior, 49, pp.288-295.",
      "doi": ""
    },
    {
      "text": "Yulin Hswen, Lauren Rubenzahl, and David S. Bickham. 2014. Feasibility of an online and mobile videogame curriculum for teaching children safe and healthy cellphone and Internet behaviors.\" GAMES FOR HEALTH: Research, Development, and Clinical Applications 3.4: 252-259. https://doi.org/10.1089/g4h.2013.0074",
      "doi": ""
    },
    {
      "text": "Huang, Y.Y. and Chou, C., 2010. An analysis of multiple factors of cyberbullying among junior high school students in Taiwan. Computers in Human Behavior, 26(6), pp.1581-1590",
      "doi": "10.1016/j.chb.2010.06.005"
    },
    {
      "text": "Qianjia Huang, Vivek Kumar Singh, and Pradeep Kumar Atrey. 2014. Cyber Bullying Detection Using Social and Textual Analysis. Proceedings of the 3rd International Workshop on Socially-Aware Multimedia (SAM '14). Association for Computing Machinery, New York, NY, USA, 3–6. https://doi.org/10.1145/2661126.2661133",
      "doi": "10.1145/2661126.2661133"
    },
    {
      "text": "Huang, C.L., Zhang, S. and Yang, S.C., 2020. How students react to different cyberbullying events: Past experience, judgment, perceived seriousness, helping behavior and the effect of online disinhibition. Computers in Human Behavior, p.106338.",
      "doi": ""
    },
    {
      "text": "Ada Johansson, Anne Huhtamäki, Miia Sainio, Anne Kaljonen, Michel Boivin and Christina Salmivalli. 2020. \"Heritability of Bullying and Victimization in Children and Adolescents: Moderation by the KiVa Antibullying Program. Journal of Clinical Child and Adolescent Psychology. https://doi.org/10.1080/15374416.2020.1731820",
      "doi": ""
    },
    {
      "text": "Katja Joronen, Anne Konu, Sally H. Rankin & Päivi Åstedt-Kurki. 2012. An evaluation of a drama program to enhance social relationships and anti-bullying at elementary school: a controlled study. Health Promotion International, 27(1), 5-14. https://doi.org/10.1093/heapro/dar012",
      "doi": ""
    },
    {
      "text": "Jaana Juvonen and Elisheva F. Gross. 2008. Extending the School Grounds?-Bullying Experiences in Cyberspace. The Journal of School Health 78 (9): 496-505. https://doi.org/10.1111/j.1746-1561.2008.00335.x",
      "doi": ""
    },
    {
      "text": "Tessa M. L. Kaufman, Gijs Huitsing and René Veenstra. 2020. Refining Victims’ Self-Reports on Bullying: Assessing Frequency, Intensity, Power Imbalance, and Goal-Directedness. Social Development 29 (2): 375-390. https://doi.org/10.1111/sode.12441",
      "doi": ""
    },
    {
      "text": "Soyeon Kim, Scott R. Colwell, Anna Kata, Michael H. Boyle, and Katholiki Georgiades. 2018. Cyberbullying Victimization and Adolescent Mental Health: Evidence of Differential Effects by Sex and Mental Health Problem Type. Journal of Youth and Adolescence 47 (3): 661-672. https://doi.org/10.1007/s10964-017-0678-4",
      "doi": ""
    },
    {
      "text": "Johnny Kim, Sara Smock Jordan, Cynthia Franklin & Adam Froerer. 2019. Is solution-focused brief therapy evidence-based? An update 10 years later. Families in Society: The Journal of Contemporary Social Services, 100, 1-12.",
      "doi": ""
    },
    {
      "text": "Kokkinos, C.M., Antoniadou, N., Dalara, E., Koufogazou, A. and Papatziki, A., 2013. Cyber-bullying, personality and coping among pre-adolescents. International Journal of Cyber Behavior, Psychology and Learning (IJCBPL), 3(4), pp.55-69.",
      "doi": "10.4018/ijcbpl.2013100104"
    },
    {
      "text": "Svjetlana Kolić‐Vehovec, Sanja Smojver‐Ažić, Tamara Martinac Dorčić, Barbara Rončević Zubković. 2020. Evaluation of Serious Game for Changing Students' Behaviour in Bullying Situation. Journal of Computer Assisted Learning 36 (3): 323-334. https://doi.org/10.1111/jcal.12402",
      "doi": ""
    },
    {
      "text": "April Kontostathis, Kelly Reynolds, Andy Garron & Lynne Edwards. 2013. Detecting cyberbullying: query terms and techniques. Proceedings of the 5th annual acm web science conference, 195-204. https://doi.org/10.1145/2464464.2464499",
      "doi": "10.1145/2464464.2464499"
    },
    {
      "text": "Richard E. Kopelman, David J. Prottas, David W. Falk. 2010. \"Construct Validation of a Theory X/Y Behavior Scale.\" Leadership and Organization Development Journal 31 (2): 120-135. https://doi.org/10.1108/01437731011024385",
      "doi": ""
    },
    {
      "text": "Kowalski, R.M., Giumetti, G.W., Schroeder, A.N. and Lattanner, M.R., 2014. Bullying in the digital age: A critical review and meta-analysis of cyberbullying research among youth. Psychological bulletin, 140(4), p.1073.",
      "doi": ""
    },
    {
      "text": "Simone Kriglstein, Fabian Hengstberger, Florian Fribert, Katharina Stiehl, Beate Schrank, Alexander Pfeiffer, Thomas Wernbacher, Günter Wallner. 2020. Be a Buddy not a Bully-Two Educational Games to Help Prevent Bullying in Schools. In Extended Abstracts of the 2020 Annual Symposium on Computer-Human Interaction in Play (pp. 287-291). https://doi.org/10.1145/3383668.3419914",
      "doi": "10.1145/3383668.3419914"
    },
    {
      "text": "Violaine Kubiszewski, Roger Fontaine Catherine Potard and Laurent Auzoult. 2015. Does Cyberbullying Overlap with School Bullying when Taking Modality of Involvement into Account? Computers in Human Behavior 43: 49-57. https://doi.org/10.1016/j.chb.2014.10.049",
      "doi": "10.1016/j.chb.2014.10.049"
    },
    {
      "text": "Antti Kärnä, Marinus Voeten, Todd D. Little, Elisa Poskiparta, Anne Kaljonen, and Christina Salmivalli. 2011. A Large-Scale Evaluation of the KiVa Antibullying Program: Grades 4-6.” Child Development 82, no. 1 (January 2011): 311–30. https://doi.org/10.1111/j.1467-8624.2010.01557.x",
      "doi": ""
    },
    {
      "text": "Laferriere, J. and McCreery, M., 2017, October. Examining the Efficacy of a Bullying Prevention Video Game: An Intervention for Pre-Service Teachers. In European Conference on Games Based Learning (pp. 952-954). Academic Conferences International Limited.",
      "doi": ""
    },
    {
      "text": "Lapidot-Lefler, N. and Dolev-Cohen, M., 2015. Comparing cyberbullying and school bullying among school students: Prevalence, gender, and grade level differences. Social psychology of education, 18(1), pp.1-16.",
      "doi": ""
    },
    {
      "text": "Law, D.M., Shapka, J.D., Hymel, S., Olson, B.F. and Waterhouse, T., 2012. The changing face of bullying: An empirical comparison between traditional and internet bullying and victimization. Computers in Human Behavior, 28(1), pp.226-232.",
      "doi": "10.1016/j.chb.2011.09.004"
    },
    {
      "text": "Levine, E. and Tamburrino, M., 2014. Bullying among young children: Strategies for prevention. Early childhood education journal, 42(4), pp.271-278.",
      "doi": ""
    },
    {
      "text": "Ziyi Li, Junpei Kawamoto, Yaokai Feng & Kouichi Sakurai. 2016. Cyberbullying detection using parent-child relationship between comments. Proceedings of the 18th International Conference on Information Integration and Web-based Applications and Services, 325-334. https://doi.org/10.1145/3011141.3011182",
      "doi": "10.1145/3011141.3011182"
    },
    {
      "text": "Henry Lieberman, Karthik Dinakar, and Birago Jones. 2013. Crowdsourced ethics with personalized story matching. CHI'13 Extended Abstracts on Human Factors in Computing Systems, 709-714. https://doi.org/10.1145/2468356.2468481",
      "doi": "10.1145/2468356.2468481"
    },
    {
      "text": "Raquel Lozano-Blasco, Alejandra Cortés-Pascual and Maria Pilar Latorre-Martínez. 2020. Being a Cybervictim and a Cyberbully – the Duality of Cyberbullying: A Meta-Analysis.\"Computers in Human Behavior 111. https://doi.org/10.1016/j.chb.2020.106444",
      "doi": ""
    },
    {
      "text": "Jamie Macbeth, Hanna Adeyema, Henry Lieberman & Christopher Fry. 2013. Script-based story matching for cyberbullying prevention. CHI'13 Extended Abstracts on Human Factors in Computing Systems, 901-906. https://doi.org/10.1145/2468356.2468517",
      "doi": "10.1145/2468356.2468517"
    },
    {
      "text": "Juan F. Mancilla-Caceres, Eyal Amir, and Dorothy Espelage. 2013. Adaptive game for reducing aggressive behavior. In Proceedings of the companion publication of the 2013 international conference on Intelligent user interfaces companion (IUI '13 Companion). Association for Computing Machinery, New York, NY, USA, 21–24. https://doi.org/10.1145/2451176.2451183",
      "doi": "10.1145/2451176.2451183"
    },
    {
      "text": "Mancilla-Caceres, J.F., Espelage, D. and Amir, E., 2014. Emotions in social computer games: Relations with bullying, aggression, and school belonging. International Journal of Gaming and Computer-Mediated Simulations (IJGCMS), 6(3), pp.50-67.",
      "doi": "10.4018/ijgcms.2014070104"
    },
    {
      "text": "Nick Mavroudis and Pagona Bournelli. 2016. The role of drama in education in counteracting bullying in schools. Cogent education 3.1: 1233843. https://doi.org/10.1080/2331186X.2016.1233843",
      "doi": ""
    },
    {
      "text": "Brenna McNally, Priya Kumar, Chelsea Hordatt, Matthew Louis Mauriello, Shalmali Naik, Leyla Norooz, Alazandra Shorter, Evan Golub, and Allison Druin. 2018. Co-designing Mobile Online Safety Applications with Children. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Paper 523, 1–9. https://doi.org/10.1145/3173574.3174097",
      "doi": "10.1145/3173574.3174097"
    },
    {
      "text": "Mehari, K.R., Farrell, A.D. and Le, A.T.H., 2014. Cyberbullying among adolescents: Measures in search of a construct. Psychology of Violence, 4(4), p.399.",
      "doi": ""
    },
    {
      "text": "Menard, S. and Grotpeter, J.K., 2014. Evaluation of bully-proofing your school as an elementary school antibullying intervention. Journal of School Violence, 13(2), pp.188-209.",
      "doi": ""
    },
    {
      "text": "Midthassel, U.V., Bru, E. and Idsoe, T., 2008. Is the sustainability of reduction in bullying related to follow‐up procedures?. Educational Psychology, 28(1), pp.83-95.",
      "doi": ""
    },
    {
      "text": "Migliaccio, T. and Raskauskas, J., 2013. Small-scale bullying prevention discussion video for classrooms: A preliminary evaluation. Children & Schools, 35(2), pp.71-81.",
      "doi": ""
    },
    {
      "text": "Faye Mishna, Michael Saini and Steven Solomon. 2009. \"Ongoing and Online: Children and Youth's Perceptions of Cyber Bullying.\" Children and Youth Services Review 31 (12): 1222-1228. https://doi.org/10.1016/j.childyouth.2009.05.004",
      "doi": ""
    },
    {
      "text": "Mohyla, J. and Slee, P.T., 2012, July. THE PEACE Pack & SITE Software: Interventions to reduce bullying in Australian schools. In 2012 7th International Conference on Computer Science & Education (ICCSE) (pp. 457-461). IEEE.",
      "doi": ""
    },
    {
      "text": "Mudraka, G. and Semwalb, S.K., 2015. Modeling aggression and bullying: a complex systems approach. Annual Review Of Cybertherapy And Telemedicine 2015, p.187.",
      "doi": ""
    },
    {
      "text": "George Mudrak and Sudhanshu Kumar Semwal. 2016. Group Aggression and Bullying through Complex Systems Agent Based Modeling. Annual Review of CyberTherapy and Telemedicine 14: 189-193.",
      "doi": ""
    },
    {
      "text": "Neo, H.F., Teo, C.C. and Boon, J.L.H., 2018, October. Mobile Edutainment Learning Approach: # StopBully. In Proceedings of the 2nd International Conference on Digital Technology in Education (pp. 6-10).",
      "doi": ""
    },
    {
      "text": "Iolie Nicolaidou & Agnes Venizelou. 2020. Improving children's E-safety skills through an interactive learning environment: A quasi-experimental study. Multimodal Technologies and Interaction, 4(2) https://doi.org/10.3390/mti4020010",
      "doi": ""
    },
    {
      "text": "Nikiforos, S., Tzanavaris, S. and Kermanidis, K.L., Virtual learning communities (VLCs) rethinking: influence on behavior modification—bullying detection through machine learning and natural language processing. Journal of Computers in Education 2020.",
      "doi": ""
    },
    {
      "text": "Nocentini, A., Zambuto, V. and Menesini, E., 2015. Anti-bullying programs and Information and Communication Technologies (ICTs): A systematic review. Aggression and Violent Behavior, 23, pp.52-60.",
      "doi": ""
    },
    {
      "text": "Dan Olweus. 1994. Bullying at School. In: Huesmann L.R. (eds) Aggressive Behavior. The Plenum Series in Social/Clinical Psychology. Springer, Boston, MA. https://doi.org/10.1007/978-1-4757-9116-7_5",
      "doi": ""
    },
    {
      "text": "Dan Olweus. 2012. Cyberbullying: An Overrated Phenomenon? European Journal of Developmental Psychology 9 (5), 520-538. https://doi.org/10.1080/17405629.2012.682358",
      "doi": ""
    },
    {
      "text": "Olweus, D., 2013. School bullying: Development and some important challenges. Annual review of clinical psychology, 9, pp.751-780.",
      "doi": ""
    },
    {
      "text": "Osumi, T., Osawa, H. and Imai, M., 2016. Simulation of bullying and conforming in a class based on socion theory. Electronics and Communications in Japan, 99(7), pp.12-24.",
      "doi": "10.1002/ecj.11786"
    },
    {
      "text": "Palladino, B.E., Nocentini, A. and Menesini, E., 2016. Evidence‐based intervention against bullying and cyberbullying: Evaluation of the NoTrap! program in two independent trials. Aggressive behavior, 42(2), pp.194-206.",
      "doi": ""
    },
    {
      "text": "Samiullah Paracha, Lynne Hall, Kathy Clawson, Nicole Mitsche. 2020. Design, Development, and Usability of a Virtual Environment on Moral, Social, and Emotional Leaning. International Journal of Virtual and Personal Learning Environments 10 (2): 50-65. https://doi.org/10.4018/IJVPLE.2020070104",
      "doi": ""
    },
    {
      "text": "Cátia Raminhos, Ana Paula Cláudio, Maria Beatriz Carmo, Susana Carvalhosa, Maria de Jesus Candeias, and Augusta Gaspar. 2015. A serious game-based solution to prevent bullying. In Proceedings of the 13th International Conference on Advances in Mobile Computing and Multimedia (MoMM 2015). Association for Computing Machinery, New York, NY, USA, 63–72. https://doi.org/10.1145/2837126.2837135",
      "doi": "10.1145/2837126.2837135"
    },
    {
      "text": "Resett, S. and Gámez-Guadix, M., 2017. Traditional bullying and cyberbullying: Differences in emotional problems, and personality. Are cyberbullies more Machiavellians?. Journal of Adolescence, 61, pp.113-116.",
      "doi": ""
    },
    {
      "text": "Roberts Jr, W. B., & Morotti, A. A. (2000). The bully as victim: Understanding bully behaviors to increase the effectiveness of interventions in the bully-victim dyad. Professional School Counseling, 4(2), 148.",
      "doi": ""
    },
    {
      "text": "Alice Rubin-Vaughan, Debra Pepler, Steven Brown and Wendy Craig. 2011. Quest for the Golden Rule: An Effective Social Skills Promotion and Bullying Prevention Program.\" Computers and Education 56 (1): 166-175. https://doi.org/10.1016/j.compedu.2010.08.009",
      "doi": "10.1016/j.compedu.2010.08.009"
    },
    {
      "text": "Carolina Beniamina Rutta, Gianluca Schiavo, Massimo Zancanaro, and Elisa Rubegni. 2019. Comic-based Digital Storytelling with Primary School Children. Proceedings of the 18th ACM International Conference on Interaction Design and Children (IDC '19). Association for Computing Machinery, New York, NY, USA, 508–513. https://doi.org/10.1145/3311927.3325331",
      "doi": "10.1145/3311927.3325331"
    },
    {
      "text": "Carolina Beniamina Rutta, Gianluca Schiavo, Massimo Zancanaro, and Elisa Rubegni. 2020. Collaborative comic-based digital storytelling with primary school children. Proceedings of the Interaction Design and Children Conference (IDC '20). Association for Computing Machinery, New York, NY, USA, 426–437. https://doi.org10.1145/3392063.3394433",
      "doi": "10.1145/3392063.3394433"
    },
    {
      "text": "Mustafa Şahin. 2012. The Relationship between the cyberbullying/cybervictmization and Loneliness among Adolescents. Children and Youth Services Review 34 (4): 834-837. https://doi.org/10.1016/j.childyouth.2012.01.010",
      "doi": ""
    },
    {
      "text": "Salcedo, L.P. and Contreras, A.R., 2011, May. Group formation for minimizing bullying probability. A proposal based on genetic algorithms. In International Work-Conference on the Interplay Between Natural and Artificial Computation (pp. 148-156). Springer, Berlin, Heidelberg.",
      "doi": ""
    },
    {
      "text": "Christina Salmivalli, Elisa Poskiparta, Annarilla Ahtola, and Anne Haataja. 2013. The Implementation and Effectiveness of the KiVa Antibullying Program in Finland. European Psychologist, School Success, 18, no. 2, 79–88. https://doi.org/10.1027/1016-9040/a000140",
      "doi": ""
    },
    {
      "text": "Ana Dolores Vargas Sánchez and Luis Eduardo Veloza Chamucero. 2017. Education in Conflict Resolution using ICT: A Case Study in Colombia. Journal of Cases on Information Technology 19 (2): 29-43. https://doi.org/10.4018/JCIT.2017040103",
      "doi": "10.4018/JCIT.2017040103"
    },
    {
      "text": "Olivia Saracho. 2017. Bullying Prevention Strategies in Early Childhood Education. Early Childhood Education Journal 45 (4): 453–60. https://doi.org/10.1007/s10643-016-0793-y",
      "doi": ""
    },
    {
      "text": "Carmen R. Sedano, Edson L. Ursini and Paulo S. Martins. 2017. A Bullying-Severity Identifier Framework Based on Machine Learning and Fuzzy Logic. Lecture Notes in Computer Science (Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Vol. 10245 LNAI. https://doi.org/10.1007/978-3-319-59063-9_28",
      "doi": ""
    },
    {
      "text": "Shaw, T., Campbell, M.A., Eastham, J., Runions, K.C., Salmivalli, C. and Cross, D., 2019. Telling an adult at school about bullying: Subsequent victimization and internalizing problems. Journal of Child and Family Studies, 28(9), pp.2594-2605.",
      "doi": ""
    },
    {
      "text": "Shiakou, M. and Piki, L., 2020. Assessing the role of drama on children's understanding of bullying. International Journal of School & Educational Psychology, 8(1), pp.11-20.",
      "doi": ""
    },
    {
      "text": "Yasin N. Silva, Christopher Rich, Jaime Chon & Lisa M. Tsosie. 2016. BullyBlocker: An app to identify cyberbullying in facebook. In 2016 IEEE/ACM International Conference on Advances in Social Networks Analysis and Mining (ASONAM), 1401-1405. IEEE. https://doi.org/10.1109/ASONAM.2016.7752430",
      "doi": ""
    },
    {
      "text": "Phillip T. Slee and Jury Mohyla. 2007. The PEACE Pack: an evaluation of interventions to reduce bullying in four Australian primary schools, Educational Research, 49:2, 103-114, https://doi.org/10.1080/00131880701369610",
      "doi": ""
    },
    {
      "text": "Slonje, R., Smith, P.K. and Frisén, A., 2013. The nature of cyberbullying, and strategies for prevention. Computers in human behavior, 29(1), pp.26-32.",
      "doi": ""
    },
    {
      "text": "Jiyeon Song and Insoo Oh. 2018. Factors Influencing Bystanders' Behavioral Reactions in Cyberbullying Situations. Computers in Human Behavior 78: 273-282. https://doi.org/10.1016/j.chb.2017.10.008",
      "doi": "10.1016/j.chb.2017.10.008"
    },
    {
      "text": "Michael Sloenthorn Speek and Maarten Van Mechelen. 2018. Storytelling shapes: a toolkit to enable children to express their needs and wishes. In Proceedings of the 17th ACM Conference on Interaction Design and Children (IDC '18). Association for Computing Machinery, New York, NY, USA, 619–624. https://doi.org/10.1145/3202185.3210785",
      "doi": "10.1145/3202185.3210785"
    },
    {
      "text": "Kalliopi-Evangelia Stavroulia, A. Ruiz-Harisiou, Elena Manouchou, K. Georgiou, F. Sella, and Andreas Lanitis. 2016. A 3D Virtual Environment for Training Teachers to Identify Bullying. https://doi.org/10.1109/MELCON.2016.7495417",
      "doi": ""
    },
    {
      "text": "Claire Sutherland, Lynne Coventry, and Elizabeth Sillence. 2014. Using animated scenarios to explore severity of cyberbullying and reporting readiness. Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design, 448-451. https://doi.org/10.1145/2686612.2686683",
      "doi": "10.1145/2686612.2686683"
    },
    {
      "text": "Nargess Tahmasbi, and Elham Rastegari. 2018. A socio-contextual approach in automated detection of public cyberbullying on Twitter. ACM Transactions on Social Computing 1.4: 1-22. https://doi.org/10.1145/3290838",
      "doi": "10.1145/3290838"
    },
    {
      "text": "James M. Thomas and Melissa E. DeRosier. 2010. Toward effective game-based social skills tutoring for children: an evaluation of a social adventure game. In Proceedings of the Fifth International Conference on the Foundations of Digital Games (FDG '10). Association for Computing Machinery, New York, NY, USA, 217–223. https://doi.org/10.1145/1822348.1822377",
      "doi": ""
    },
    {
      "text": "Jane Timmons-Mitchell, Deborah A. Levesque, Leon A. Harris III, Daniel J. Flannery, and Tatiana Falcone. 2016. Pilot Test of StandUp, an Online School-Based Bullying Prevention Program. Children & Schools 38 (2): 71–79. https://doi.org/10.1093/cs/cdw010",
      "doi": ""
    },
    {
      "text": "Min-Kun Tsai, Shian-Shyong Tseng and Jui-Feng Weng. 2011. A Pilot Study of Interactive Storytelling for Bullying Prevention Education. Lecture Notes in Computer Science (Including Subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Vol. 6872 LNCS. https://doi.org/10.1007/978-3-642-23456-9_89",
      "doi": ""
    },
    {
      "text": "Michael Tsang, Vadim Korolik, Stefan Scherer and Maja J. Mataric. 2018. Comparing Models for Gesture Recognition of Children's Bullying Behaviors. https://doi.org/10.1109/ACII.2017.8273591",
      "doi": ""
    },
    {
      "text": "Ttofi, M.M. and Farrington, D.P., 2011. Effectiveness of school-based programs to reduce bullying: A systematic and meta-analytic review. Journal of Experimental Criminology, 7(1), pp.27-56.",
      "doi": ""
    },
    {
      "text": "Janneke Van Der Zwaan, Virginia Dignum, Catholijn Jonker. 2010. Simulating peer support for victims of cyberbullying. In BNAIC 2010: 22rd Benelux Conference on Artificial Intelligence, Luxembourg, 25-26 October 2010.",
      "doi": ""
    },
    {
      "text": "Maarten Van Mechelen, Gavin Sim, Bieke Zaman, Peggy Gregory, Karin Slegers, and Matthew Horton. 2014. Applying the CHECk tool to participatory design sessions with children. In Proceedings of the 2014 conference on Interaction design and children (IDC '14). Association for Computing Machinery, New York, NY, USA, 253–256. https://doi.org/10.1145/2593968.2610465",
      "doi": "10.1145/2593968.2610465"
    },
    {
      "text": "Maarten Van Mechelen, Ann Laenen, Bieke Zaman, Bert Willems, Vero Vanden Abeele. 2019. Collaborative Design Thinking (CoDeT): A co-design approach for high child-to-adult ratios. In International Journal of Human-Computer Studies, Volume 130, 179-195. https://doi.org/10.1016/j.ijhcs.2019.06.013",
      "doi": "10.1016/j.ijhcs.2019.06.013"
    },
    {
      "text": "Natalie Vannini, Sibylle Enz, Maria Sapouna, Dieter Wolke, Scott Watson, Sarah Woods, Kerstin Dautenhahn, Lynne Hall, Ana Paiva, Elizabeth André, Ruth Aylett & Wolfgang Schneider. 2011. “FearNot!”: a computer-based anti-bullying-programme designed to foster peer intervention. European journal of psychology of education, 26(1), 21-44. https://doi.org/10.1007/s10212-010-0035-4",
      "doi": ""
    },
    {
      "text": "Wassanasompong, W. and tussaworn, S., 2019, October. The Effects of Health Education Instruction Using Problem-based Learning on Knowledge and Critical Thinking about Cyberbullying of Junior High School Students. In Proceedings of the 2019 The 3rd International Conference on Digital Technology in Education (pp. 68-72).",
      "doi": ""
    },
    {
      "text": "Scott E.J. Watson, Natalie Vannini, Sarah Woods, Kerstin Dautenhah, Maria Sapouna, Sibylle Enz, Wolfgang Schneider, Dieter Wolke, Lynne Hall, Ana Paiva, Elizabeth André &Ruth Aylett. 2010. Inter-cultural differences in response to a computer-based anti-bullying intervention. Educational Research, 52(1), 61-80. https://doi.org/10.1080/00131881003588261",
      "doi": ""
    },
    {
      "text": "Anne Williford and Kathryn J. DePaolis. 2019. Validation of a Cyber Bullying and Victimization Measure among Elementary School-Aged Children. Child and Adolescent Social Work Journal 36 (5): 557-570. https://doi.org/10.1007/s10560-018-0583-z",
      "doi": ""
    },
    {
      "text": "Vreeman, R.C. and Carroll, A.E., 2007. A systematic review of school-based interventions to prevent bullying. Archives of pediatrics & adolescent medicine, 161(1), pp.78-88.",
      "doi": ""
    },
    {
      "text": "Jun-Ming Xu, Xiaojin Zhu, and Amy Bellmore. 2012. Fast learning for sentiment analysis on bullying. In Proceedings of the First International Workshop on Issues of Sentiment Discovery and Opinion Mining (WISDOM '12). Association for Computing Machinery, New York, NY, USA, Article 10, 1–6. https://doi.org/10.1145/2346676.2346686",
      "doi": "10.1145/2346676.2346686"
    },
    {
      "text": "Yang, A. and Salmivalli, C., 2015. Effectiveness of the KiVa antibullying programme on bully-victims, bullies and victims. Educational research, 57(1), pp.80-90.",
      "doi": ""
    },
    {
      "text": "Liang Ye, Peng Wang, Le Wang, Hany Ferdinando, Tapio Seppänen and Esko Alasaarela. 2018. A Combined Motion-Audio School Bullying Detection Algorithm. International Journal of Pattern Recognition and Artificial Intelligence 32 (12). https://doi.org/10.1142/S0218001418500465",
      "doi": ""
    },
    {
      "text": "Liang Ye, Jifu Shi, Hany Ferdinando, Tapio Seppänen and Esko Alasaarela. 2020. School Violence Detection Based on Multi-Sensor Fusion and Improved Relief-F Algorithms. Lecture Notes of the Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering, LNICST. Vol. 287. https://doi.org/10.1007/978-3-030-22971-9_22",
      "doi": ""
    },
    {
      "text": "Yokoo, M., Wakuta, M. and Shimizu, E., 2018. Educational effectiveness of a video lesson for bullying prevention. Children & Schools, 40(2), pp.71-79.",
      "doi": ""
    },
    {
      "text": "Eun Young Oh, Donggil Song and Hyeonmi Hong. 2020. Interactive computing technology in anti-bullying education: The effects of conversation-bot's role on K-12 students’ attitude change toward bullying problems. Journal of Educational Computing Research 58.1, 200-219. https://doi.org/10.1177/0735633119839177",
      "doi": ""
    },
    {
      "text": "Sue Young. 2016. Ratkaisukeskeinen lähetymistapa koulukiusaamiseen. In Peter de Jong and Insoo Kim Berg. 2016 Ratkaisukeskeisen lyhytterapian oppikirja. Helsinki: Lyhytterapiainstutuutti Oy, 287-296. (Original Sue Young. Solutions for Bullying in Primary Schools. In Peter de Jong and Insoo Kim Berg. 2008. Interviewing for solutions (3rd ed.). Belmont, CA: Thomson Higher Education, 308-318.)",
      "doi": ""
    }
  ]
}