{
  "doi": "10.1145/3411764.3445694",
  "title": "AdolescentBot: Understanding Opportunities for Chatbots in Combating Adolescent Sexual and Reproductive Health Problems in Bangladesh",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Traditional face-to-face health consultation-based systems largely failed to attract teenagers to get reproductive and sexual health supports from doctors and practitioners in Bangladesh as ‘sex’ or ‘adolescent’ related issues are considered social taboos and are rarely discussed openly with anyone. This has damaging implications for the physiological and mental well-being of a large group of people. In this paper, we study chatbot’s effectiveness to assist adolescents in seeking reproductive and sexual health supports by analyzing the responses from 256 participants, including adolescents and medical personnel from six different regions of Bangladesh. We prototype an interactive chatbot, namely AdolescentBot, and analyzed users’ communication patterns, feelings, and contexts of use as the first point of support for getting adolescence related health advice. Our analysis finds that a chatbot can satisfy most of the users’ queries, and the majority of the queries are associated with wrong-beliefs. Finally, we discuss ethical and societal issues with chatbot usage and recommend a set of design propositions for the AdolescentBot.",
  "tags": [
    "HCI4D",
    "Bangladesh",
    "Chatbot",
    "Adolescent health"
  ],
  "authors": [
    {
      "name": "Rifat Rahman",
      "institution": "Computer Science and Engineering Bangladesh University of Engineering and Technology, Bangladesh",
      "img": "/do/10.1145/contrib-99659701782/rel-imgonly/50107962_165452367753199_4800384732267282432_o_-_copy.jpg",
      "acmid": "99659701782",
      "orcid": "missing"
    },
    {
      "name": "Md. Rishadur Rahman",
      "institution": "Computer Science and Engineering Bangladesh University of Engineering and Technology, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701309",
      "orcid": "missing"
    },
    {
      "name": "Nafis Irtiza Tripto",
      "institution": "Computer Science and Engineering Bangladesh University of Engineering and Technology, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659337866",
      "orcid": "missing"
    },
    {
      "name": "Mohammed Eunus Ali",
      "institution": "Computer Science and Engineering Bangladesh University of Engineering and Technology, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435597825",
      "orcid": "missing"
    },
    {
      "name": "Sajid Hasan Apon",
      "institution": "Computer Science and Engineering Bangladesh University of Engineering and Technology, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659335199",
      "orcid": "missing"
    },
    {
      "name": "Rifat Shahriyar",
      "institution": "Computer Science and Engineering Bangladesh University of Engineering and Technology, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350603030",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Monica Agrawal, Janette Cheng, and Caelin Tran. 2017. What’s Up, Doc? A Medical Diagnosis Bot. (2017).",
      "doi": ""
    },
    {
      "text": "Sigma Ainul, Ashish Bajracharya, Laura Reichenbach, and Kate Gilles. 2017. Adolescents in Bangladesh: A situation analysis of programmatic approaches to sexual and reproductive health education and services.(2017).",
      "doi": ""
    },
    {
      "text": "S Ainul, I Ehsan, T Tanjeen, and L Reichenbach. 2017. Adolescent Friendly Health Corners (AFHCs) in selected government health facilities in Bangladesh: An early qualitative assessment.(2017).",
      "doi": ""
    },
    {
      "text": "Gerald Albaum. 1997. The Likert scale revisited. Market Research Society. Journal. 39, 2 (1997), 1–21.",
      "doi": ""
    },
    {
      "text": "Flora Amato, Stefano Marrone, Vincenzo Moscato, Gabriele Piantadosi, Antonio Picariello, and Carlo Sansone. 2017. Chatbots meet eHealth: automatizing healthcare. (2017).",
      "doi": ""
    },
    {
      "text": "Sandeep Avula. 2018. Wizard of Oz: Protocols and Challenges in Studying Searchbots to Support Collaborative Search. In SIGIR 2nd International Workshop on Conversational Approaches to Information Retrieval (CAIR’18). Association for Computing Machinery, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Abul Barkat and Murtaza Majid. 2003. Adolescent reproductive health in Bangladesh: Status, policies, programs and issues. POLICY Project Report, USAID Asia/Near East Bureau (2003).",
      "doi": ""
    },
    {
      "text": "Dina LG Borzekowski and Vaughn I Rickert. 2001. Adolescent cybersurfing for health information: a new resource that crosses barriers. Archives of pediatrics & adolescent medicine 155, 7 (2001), 813–817.",
      "doi": ""
    },
    {
      "text": "Ana Paula Chaves and Marco Aurelio Gerosa. 2018. Single or Multiple Conversational Agents? An Interactional Coherence Comparison. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Benilda Eleonor V Comendador, Bien Michael B Francisco, Jefferson S Medenilla, and Sharleen Mae. 2015. Pharmabot: a pediatric generic medicine consultant chatbot’. Journal of Automation and Control Engineering Vol 3, 2 (2015).",
      "doi": ""
    },
    {
      "text": "Rik Crutzen, Gjalt-Jorn Y Peters, Sarah Dias Portugal, Erwin M Fisser, and Jorne J Grolleman. 2011. An artificially intelligent chat agent that answers adolescents’ questions related to sex, drugs, and alcohol: an exploratory study. Journal of Adolescent Health 48, 5 (2011), 514–519.",
      "doi": ""
    },
    {
      "text": "Lei Cui, Shaohan Huang, Furu Wei, Chuanqi Tan, Chaoqun Duan, and Ming Zhou. 2017. SuperAgent: A Customer Service Chatbot for E-commerce Websites. In ACL.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Emre Kiciman, Mark Dredze, Glen Coppersmith, and Mrinal Kumar. 2016. Discovering shifts to suicidal ideation from mental health content in social media. In Proceedings of the 2016 CHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 2098–2110.",
      "doi": "10.1145/2858036.2858207"
    },
    {
      "text": "Edgard E Delvin phD8t9, Emile Levy phD7t9, and James A Hanley phD. 2003. The Quebec Child and Adolescent Health and Social Survey: design and methods of a cardiovascular risk factor survey for youth. Can J Cardiol 19, 5 (2003).",
      "doi": ""
    },
    {
      "text": "Robert F DeVellis. 2016. Scale development: Theory and applications. Vol. 26. Sage publications, Newbury Park, CA.",
      "doi": ""
    },
    {
      "text": "Asbjørn Følstad, Petter Bae Brandtzaeg, Tom Feltwell, Effie L-C Law, Manfred Tscheligi, and Ewa Luger. 2018. Chatbots for social good. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Suad F Ghaddar, Melissa A Valerio, Carolyn M Garcia, and Lucy Hansen. 2012. Adolescent health literacy: the importance of credible sources for online health information. Journal of school health 82, 1 (2012), 28–36.",
      "doi": ""
    },
    {
      "text": "Nicola J Gray, Jonathan D Klein, Peter R Noyce, Tracy S Sesselberg, and Judith A Cantrill. 2005. Health information-seeking behaviour in adolescence: the place of the internet. Social science & medicine 60, 7 (2005), 1467–1478.",
      "doi": ""
    },
    {
      "text": "Robert M Groves, Floyd J Fowler Jr, Mick P Couper, James M Lepkowski, Eleanor Singer, and Roger Tourangeau. 2011. Survey methodology. Vol. 561. John Wiley & Sons, Hoboken, New Jersey.",
      "doi": ""
    },
    {
      "text": "Khari Hohnson. 2018. Facebook Messenger passes 300,000 bots.",
      "doi": ""
    },
    {
      "text": "Jing Huang, Qi Li, Yuanyuan Xue, Taoran Cheng, Shuangqing Xu, Jia Jia, and Ling Feng. 2015. Teenchat: a chatterbot system for sensing and releasing adolescents’ stress. In International Conference on Health Information Science. Springer, Springer, Cham, 133–145.",
      "doi": ""
    },
    {
      "text": "Ariful Haq Kabir and Farjana Akter. 2014. Parental Involvement in the Secondary Schools in Bangladesh: Challenges and a Way Forward.International Journal of Whole Schooling 10, 2 (2014), 1–18.",
      "doi": ""
    },
    {
      "text": "M Karlsson, G Penteniari, H Croxson, 2017. Accelerating affordable smartphone ownership in emerging markets. GSMA (2017), 1–59.",
      "doi": ""
    },
    {
      "text": "Tobias Kowatsch, Marcia Nißen, Chen-Hsuan I Shih, Dominik Rüegger, Dirk Volland, Andreas Filler, Florian Künzler, Filipe Barata, Severin Hung, Dirk Büchter, 2017. Text-based Healthcare Chatbots Supporting Patient and Health Professional Teams: Preliminary Results of a Randomized Controlled Trial on Childhood Obesity. In Persuasive Embodied Agents for Behavior Change (PEACH2017). ETH Zurich.",
      "doi": ""
    },
    {
      "text": "Presser Krosnick, J. A.2010. Question and questionnaire design. Handbook of survey research 2 (2010), 263–313.",
      "doi": ""
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, 2015. Projecting health: community-led video education for maternal health. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. Association for Computing Machinery, New York, NY, USA, 1–10.",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Abbas Saliimi Lokman, Jasni Mohamad Zain, Fakulti Sistem Komputer, and Kejuruteraan Perisian. 2009. Designing a Chatbot for diabetic patients. In International Conference on Software Engineering & Computer Systems (ICSECS’09). 19–21.",
      "doi": ""
    },
    {
      "text": "Divya Madhu, CJ Neeraj Jain, Elmy Sebastain, Shinoy Shaji, and Anandhu Ajayakumar. 2017. A novel approach for medical assistance using trained chatbot. In Inventive Communication and Computational Technologies (ICICCT), 2017 International Conference on. IEEE, IEEE, Coimbatore, India, 243–246.",
      "doi": ""
    },
    {
      "text": "Quamrun Nahar, Cristóbal Tuñón, Irit Houvras, Rukhsana Gazi, Masud Reza, Nafisa Lira Huq, 1999. Reproductive health needs of adolescents in Bangladesh: A study report. International Centre for Diarrhoeal Diseases Research Bangladesh: Dhaka.",
      "doi": ""
    },
    {
      "text": "Lin Ni, Chenhao Lu, Niu Liu, and Jiamou Liu. 2017. MANDY: Towards a Smart Primary Care Chatbot Application. In International Symposium on Knowledge and Systems Sciences. Springer, Springer, Singapore, 38–52.",
      "doi": ""
    },
    {
      "text": "Ardis L Olson, Cecelia A Gaffney, Viking A Hedberg, and Gwendolyn R Gladstone. 2009. Use of inexpensive technology to enhance adolescent health screening and counseling. Archives of pediatrics & adolescent medicine 163, 2 (2009), 172–177.",
      "doi": ""
    },
    {
      "text": "Lara SG Piccolo, Martino Mensio, and Harith Alani. 2018. Chasing the chatbots. In International Conference on Internet Science. Springer, Springer, Cham, 157–169.",
      "doi": ""
    },
    {
      "text": "Divya Ramachandran, John Canny, Prabhu Dutta Das, and Edward Cutrell. 2010. Mobile-izing health workers in rural India. In Proceedings of the SIGCHI conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 1889–1898.",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Carl Ransom Rogers 1959. A theory of therapy, personality, and interpersonal relationships: As developed in the client-centered framework. Vol. 3. McGraw-Hill New York, New York.",
      "doi": ""
    },
    {
      "text": "Lipekho Saprii, Esther Richards, Puni Kokho, and Sally Theobald. 2015. Community health workers in rural India: analysing the opportunities and challenges Accredited Social Health Activists (ASHAs) face in realising their multiple roles. Human resources for health 13, 1 (2015), 1–13.",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, Kenton P O’Hara, and Alex S Taylor. 2018. Let’s talk about race: Identity, chatbots, and AI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3173574.3173889"
    },
    {
      "text": "Joseph Seering, Juan Pablo Flores, Saiph Savage, and Jessica Hammer. 2018. The social roles of bots: evaluating impact of bots on discussions in online communities. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–29.",
      "doi": "10.1145/3274426"
    },
    {
      "text": "Amir Shevat. 2017. Designing bots: Creating conversational experiences. ” O’Reilly Media, Inc.”, Sebastopol, California.",
      "doi": ""
    },
    {
      "text": "Arlene Smaldone, Melissa S Stockwell, Jennel C Osborne, Yamnia Cortes, ElShadey Bekele, and Nancy S Green. 2015. Adolescent and parent use of new technologies for health communication: a study in an urban latino community. Journal of public health research 4, 1 (2015).",
      "doi": ""
    },
    {
      "text": "Piya Sorcar, Benjamin Strauber, Prashant Loyalka, Neha Kumar, and Shelley Goldman. 2017. Sidestepping the elephant in the classroom: Using culturally localized technology to teach around taboos. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2792–2804.",
      "doi": "10.1145/3025453.3025958"
    },
    {
      "text": "BANGLADESH BUREAU OF STATISTICS. 2015. Yearbook of agricultural statistics 2013. Dhaka: Bangladesh Bureau of Statistics(2015).",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Anna L Cox, and Ann Blandford. 2014. Don’t forget your pill! Designing effective medication reminder apps that support users’ daily routines. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2269–2278.",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Anna L Cox, and Ann Blandford. 2015. Beyond self-tracking and reminders: designing smartphone apps that support habit formation. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. Association for Computing Machinery, New York, NY, USA, 2653–2662.",
      "doi": "10.1145/2702123.2702230"
    },
    {
      "text": "Indrani Medhi Thies, Nandita Menon, Sneha Magapu, Manisha Subramony, and Jacki O’neill. 2017. How do you want your chatbot? An exploratory Wizard-of-Oz study with young, urban Indians. In IFIP Conference on Human-Computer Interaction. Springer, Springer, Cham, 441–459.",
      "doi": ""
    },
    {
      "text": "Roger Tourangeau and Norman M Bradburn. 2010. The psychology of survey response. Handbook of survey research 2 (2010), 315–346.",
      "doi": ""
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Neha Kumar, and Pushpendra Singh. 2018. Learning from and with Menstrupedia: Towards menstrual health education in India. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–20.",
      "doi": "10.1145/3274443"
    },
    {
      "text": "Joseph Weizenbaum. 1966. ELIZA - a computer program for the study of natural language communication between man and machine. Commun. ACM 9(1966), 36–45.",
      "doi": "10.1145/365153.365168"
    },
    {
      "text": "Jessica Wolfendale. 2007. My avatar, my self: Virtual harm and attachment. Ethics and information technology 9, 2 (2007), 111–119.",
      "doi": ""
    },
    {
      "text": "Beverly Wright and Alphonso O Ogbuehi. 2014. Surveying adolescents: The impact of data collection methodology on response quality. Electronic Journal of Business Research Methods 12, 1 (2014), 41.",
      "doi": ""
    },
    {
      "text": "Deepika Yadav, Prerna Malik, Kirti Dabas, and Pushpendra Singh. 2019. Feedpal: Understanding opportunities for chatbots in breastfeeding education of women in india. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–30.",
      "doi": "10.1145/3359272"
    },
    {
      "text": "Deepika Yadav, Pushpendra Singh, Kyle Montague, Vijay Kumar, Deepak Sood, Madeline Balaam, Drishti Sharma, Mona Duggal, Tom Bartindale, Delvin Varghese, 2017. Sangoshthi: Empowering community health workers through peer learning in rural india. In Proceedings of the 26th International Conference on World Wide Web. International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 499–508.",
      "doi": "10.1145/3038912.3052624"
    }
  ]
}