{
  "doi": "10.1145/3411764.3445161",
  "title": "Using Intersectional Representation & Embodied Identification in Standard Video Game Play to Reduce Societal Biases",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2021,
  "badges": [],
  "abstract": "While virtual character embodiment has been studied as a mitigator of singular societal biases in fully immersive VR and empathy games, there have been no major studies on representation featuring standard game play or intersectional identities. In our study, participants played a short 2D video game with racial and gender character manipulations. They then rated a LinkedIn profile application to examine interactions of racial and gender biases. White male participants showed bias against black and female applicants, with the black female applicant experiencing both racial and gender bias. However, participants who embodied certain underrepresented characters in the game displayed reduced biases. Participants’ perceived identification with the characters moderated this effect. The study highlights a lack of homogeneity in the prevalence and potential reduction of different societal biases and incorporates intersectionality to illustrate how multiple parts of a player character’s identity can be used to combat biases.",
  "tags": [
    "intersectionality",
    "gender bias",
    "video games",
    "racial bias",
    "virtual characters",
    "identification",
    "embodiment",
    "representation"
  ],
  "authors": [
    {
      "name": "Marie Jarrell",
      "institution": "School of Computing Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475534",
      "orcid": "missing"
    },
    {
      "name": "Reza Ghaiumy Anaraky",
      "institution": "School of Computing Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480892",
      "orcid": "missing"
    },
    {
      "name": "Bart Knijnenburg",
      "institution": "School of Computing Clemson University, United States",
      "img": "/do/10.1145/contrib-81548023386/rel-imgonly/dsc_7933.jpg",
      "acmid": "81548023386",
      "orcid": "missing"
    },
    {
      "name": "Erin Ash",
      "institution": "Department of Communication Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701958",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Haleh Afshar and Mary Maynard. 1994. The dynamics of” race” and gender: some feminist interventions. Taylor & Francis, London.",
      "doi": ""
    },
    {
      "text": "Ritu Agarwal and Elena Karahanna. 2000. Time Flies When You’re Having Fun: Cognitive Absorption and Beliefs about Information Technology Usage. MIS Quarterly 24, 4 (2000), 665–694. https://doi.org/10.2307/3250951",
      "doi": "10.2307/3250951"
    },
    {
      "text": "Erin Ash. 2016. Priming or Proteus Effect? Examining the Effects of Avatar Race on In-Game Behavior and Post-Play Aggressive Cognition and Affect in Video Games. Games and Culture 11, 4 (June 2016), 422–440. https://doi.org/10.1177/1555412014568870",
      "doi": ""
    },
    {
      "text": "Domna Banakou, Parasuram D. Hanumanthu, and Mel Slater. 2016. Virtual Embodiment of White People in a Black Virtual Body Leads to a Sustained Reduction in Their Implicit Racial Bias. Frontiers in Human Neuroscience 10 (Nov. 2016), 601. https://doi.org/10.3389/fnhum.2016.00601",
      "doi": ""
    },
    {
      "text": "Domna Banakou, Sameer Kishore, and Mel Slater. 2018. Virtually Being Einstein Results in an Improvement in Cognitive Task Performance and a Decrease in Age Bias. Frontiers in psychology 9 (2018), 917. https://doi.org/10.3389/fpsyg.2018.00917 Publisher: Frontiers.",
      "doi": ""
    },
    {
      "text": "Clare Beckett and Marie Macey. 2001. Race, gender and sexuality: The oppression of multiculturalism. Women’s Studies International Forum 24, 3 (May 2001), 309–319. https://doi.org/10.1016/S0277-5395(01)00185-6",
      "doi": ""
    },
    {
      "text": "Marianne Bertrand and Sendhil Mullainathan. 2003. Are Emily and Greg More Employable than Lakisha and Jamal? A Field Experiment on Labor Market Discrimination. https://doi.org/10.3386/w9873 Series: Working Paper Series.",
      "doi": ""
    },
    {
      "text": "Catherine I. Bolzendahl and Daniel J. Myers. 2004. Feminist Attitudes and Support for Gender Equality: Opinion Change in Women and Men, 1974–1998. Social Forces 83, 2 (Dec. 2004), 759–789. https://doi.org/10.1353/sof.2005.0005",
      "doi": ""
    },
    {
      "text": "CBC Radio. 2015. 286: Empathy games, intangible art and more | CBC Radio. https://www.cbc.ca/radio/spark/286-empathy-games-intangible-art-and-more-1.3073000",
      "doi": ""
    },
    {
      "text": "Xiao-Ping Chen, Xin Yao, and Suresh Kotha. 2009. Entrepreneur Passion And Preparedness In Business Plan Presentations: A Persuasion Analysis Of Venture Capitalists’ Funding Decisions. Academy of Management Journal 52, 1 (Feb. 2009), 199–214. https://doi.org/10.5465/amj.2009.36462018",
      "doi": ""
    },
    {
      "text": "Maria Christofi and Despina Michael-Grigoriou. 2017. Virtual reality for inducing empathy and reducing prejudice towards stigmatized groups: A survey. , 8 pages. https://doi.org/10.1109/VSMM.2017.8346252 ISSN: 2474-1485.",
      "doi": ""
    },
    {
      "text": "Jonathan Cohen. 2001. Defining Identification: A Theoretical Look at the Identification of Audiences With Media Characters. Mass Communication and Society 4, 3 (Aug. 2001), 245–264. https://doi.org/10.1207/S15327825MCS0403_01",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 1989. Demarginalizing the Intersection of Race and Sex: A Black Feminist Critique of Antidiscrimination Doctrine, Feminist Theory and Antiracist Politics. University of Chicago Legal Forum 1989 (1989), 139–168. https://heinonline.org/HOL/P?h=hein.journals/uchclf1989&i=143",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 1991. Mapping the Margins: Intersectionality, Identity Politics, and Violence against Women of Color. Stanford Law Review 43, 6 (1991), 1241–1299. https://doi.org/10.2307/1229039",
      "doi": ""
    },
    {
      "text": "Chicago Face Database. 2018. CFD | Chicago Face Database. https://chicagofaces.org/default/ Library Catalog: chicagofaces.org.",
      "doi": ""
    },
    {
      "text": "Anneke de Graaf, Hans Hoeken, José Sanders, and Johannes W. J. Beentjes. 2012. Identification as a Mechanism of Narrative Persuasion. Communication Research 39, 6 (Dec. 2012), 802–823. https://doi.org/10.1177/0093650211408594",
      "doi": ""
    },
    {
      "text": "Matthew S. Eastin, Osei Appiah, and Vincent Cicchirllo. 2009. Identification and the Influence of Cultural Stereotyping on Postvideogame Play Hostility. Human Communication Research 35, 3 (July 2009), 337–356. https://doi.org/10.1111/j.1468-2958.2009.01354.x",
      "doi": ""
    },
    {
      "text": "Anna Everett and S. Craig Watkins. 2007. The power of play: The portrayal and performance of race in video games.MacArthur Foundation Digital Media and Learning Initiative, Cambridge, MA. 141–164 pages. https://doi.org/10.1162/dmal.9780262693646.141",
      "doi": ""
    },
    {
      "text": "Xiang Fang, Surendra Singh, and Rohini Ahluwalia. 2007. An Examination of Different Explanations for the Mere Exposure Effect. Journal of Consumer Research 34, 1 (June 2007), 97–103. https://doi.org/10.1086/513050",
      "doi": ""
    },
    {
      "text": "Harry Farmer and Lara Maister. 2017. Putting Ourselves in Another’s Skin: Using the Plasticity of Self-Perception to Enhance Empathy and Decrease Prejudice. Social Justice Research 30, 4 (Dec. 2017), 323–354. https://doi.org/10.1007/s11211-017-0294-1",
      "doi": ""
    },
    {
      "text": "Christopher Franklin. 2016. Diaries of a Spaceport Janitor (Spoilers). https://www.youtube.com/watch?v=B5mcEG10wAs",
      "doi": ""
    },
    {
      "text": "Jared Friedberg. 2015. Gender Games: A Content Analysis Of Gender Portrayals In Modern, Narrative Video Games. https://scholarworks.gsu.edu/sociology_theses/52",
      "doi": ""
    },
    {
      "text": "Alessandro Gabbiadini, Paolo Riva, Luca Andrighetto, Chiara Volpato, and Brad J. Bushman. 2016. Acting like a Tough Guy: Violent-Sexist Video Games, Identification with Game Characters, Masculine Beliefs, & Empathy for Female Violence Victims. PLOS ONE 11, 4 (April 2016), e0152121. https://doi.org/10.1371/journal.pone.0152121",
      "doi": ""
    },
    {
      "text": "S. Michael Gaddis. 2017. How Black Are Lakisha and Jamal? Racial Perceptions from Names Used in Correspondence Audit Studies. Sociological Science 4 (Sept. 2017), 469–489. https://doi.org/10.15195/v4.a19",
      "doi": ""
    },
    {
      "text": "Judit García-González, Patricia Forcén, and Maria Jimenez-Sanchez. 2019. Men and women differ in their perception of gender bias in research institutions. PLOS ONE 14, 12 (Dec. 2019), e0225763. https://doi.org/10.1371/journal.pone.0225763",
      "doi": ""
    },
    {
      "text": "Christina R. Glaubke, Patti Miller, McCrae A. Parker, and Eileen Espejo. 2001. Fair Play? Violence, Gender and Race in Video Games. https://eric.ed.gov/?id=ED463092",
      "doi": ""
    },
    {
      "text": "Cristina Gonzalez-Liencres, Luis E. Zapata, Guillermo Iruretagoyena, Sofia Seinfeld, Lorena Perez-Mendez, Jorge Arroyo-Palacios, David Borland, Mel Slater, and Maria V. Sanchez-Vives. 2020. Being the Victim of Intimate Partner Violence in Virtual Reality: First- Versus Third-Person Perspective. Frontiers in psychology 11 (2020), 820. https://doi.org/10.3389/fpsyg.2020.00820 Publisher: Frontiers.",
      "doi": ""
    },
    {
      "text": "Google Inc. & Gallup Inc.2016. Diversity Gaps in Computer Science: Exploring the Underrepresentation of Girls, Blacks and Hispanics.http://goo.gl/PG34aH",
      "doi": ""
    },
    {
      "text": "Christina Gough. 2019. Distribution of computer and video gamers in the United States from 2006 to 2019, by gender.",
      "doi": ""
    },
    {
      "text": "Pamela Grimm. 2010. Social Desirability Bias. In Wiley International Encyclopedia of Marketing. American Cancer Society, Atlanta, GA. https://doi.org/10.1002/9781444316568.wiem02057 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/9781444316568.wiem02057.",
      "doi": ""
    },
    {
      "text": "Victoria Groom, Jeremy N. Bailenson, and Clifford Nass. 2009. The influence of racial embodiment on racial bias in immersive virtual environments. Social Influence 4, 3 (July 2009), 231–248. https://doi.org/10.1080/15534510802643750",
      "doi": ""
    },
    {
      "text": "Belinda Gutierrez, Anna Kaatz, Sarah Chu, Dennis Ramirez, Clem Samson-Samuel, and Molly Carnes. 2014. “Fair Play”: A Videogame Designed to Address Implicit Race Bias Through Active Perspective Taking. Games for Health Journal 3, 6 (Sept. 2014), 371–378. https://doi.org/10.1089/g4h.2013.0071",
      "doi": ""
    },
    {
      "text": "Béatrice S. Hasler, Bernhard Spanlang, and Mel Slater. 2017. Virtual race transformation reverses racial in-group bias. PLOS ONE 12, 4 (April 2017), e0174965. https://doi.org/10.1371/journal.pone.0174965",
      "doi": ""
    },
    {
      "text": "Aisha Hassan. 2018. Video game companies are leaving a lot more than money on the table if they lack diversity. https://qz.com/quartzy/1467237/video-game-companies-leave-much-more-than-just-money-on-the-table-if-they-lack-diversity/",
      "doi": ""
    },
    {
      "text": "Dorothée Hefner, Christoph Klimmt, and Peter Vorderer. 2007. Identification with the Player Character as Determinant of Video Game Enjoyment. In Entertainment Computing – ICEC 2007(Lecture Notes in Computer Science), Lizhuang Ma, Matthias Rauterberg, and Ryohei Nakatsu (Eds.). Springer, Berlin, Heidelberg, 39–48. https://doi.org/10.1007/978-3-540-74873-1_6",
      "doi": ""
    },
    {
      "text": "Peter Hellman. 1987. Street Smart: How Big Bird & Co. Do It. New York Magazine 20, 46 (Nov. 1987), 48–53. http://muppetbalcony.blogspot.com/2011/03/street-smart-how-big-bird-co-do-it.html",
      "doi": ""
    },
    {
      "text": "Jeroen Jansz and Raynel G Martis. 2003. 21. THE REPRESENTATION OF GENDER AND ETHNICITY IN DIGITAL INTERACTIVE GAMES.",
      "doi": ""
    },
    {
      "text": "Gaetane Jean-Marie, Vicki A. Williams, and Sheila L. Sherman. 2009. Black Women’s Leadership Experiences: Examining the Intersectionality of Race and Gender. Advances in Developing Human Resources 11, 5 (Oct. 2009), 562–581. https://doi.org/10.1177/1523422309351836",
      "doi": ""
    },
    {
      "text": "Uma R. Karmarkar and Zakary L. Tormala. 2010. Believe Me, I Have No Idea What I’m Talking About: The Effects of Source Certainty on Consumer Involvement and Persuasion. Journal of Consumer Research 36, 6 (April 2010), 1033–1049. https://doi.org/10.1086/648381",
      "doi": ""
    },
    {
      "text": "Melissa S Kearney and Phillip B Levine. 2015. Early Childhood Education by MOOC: Lessons from Sesame Street. Working Paper 21229. National Bureau of Economic Research. https://doi.org/10.3386/w21229",
      "doi": ""
    },
    {
      "text": "Christoph Klimmt, Dorothée Hefner, and Peter Vorderer. 2009. The Video Game Experience as “True” Identification: A Theory of Enjoyable Alterations of Players’ Self-Perception. Communication Theory 19, 4 (Nov. 2009), 351–373. https://doi.org/10.1111/j.1468-2885.2009.01347.x",
      "doi": ""
    },
    {
      "text": "Christoph Klimmt, Dorothée Hefner, Peter Vorderer, Christian Roth, and Christopher Blake. 2010. Identification With Video Game Characters as Automatic Shift of Self-Perceptions. Media Psychology 13, 4 (Nov. 2010), 323–338. https://doi.org/10.1080/15213269.2010.524911",
      "doi": ""
    },
    {
      "text": "Rex B Kline. 2015. Principles and practice of structural equation modeling. Guilford publications, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Xeniya Kondrat. 2015. Gender and video games: How is female gender generally represented in various genres of video games?Journal of Comparative Research in Anthropology and Sociology 6, 01(2015), 171–193. https://www.ceeol.com/search/article-detail?id=289532",
      "doi": ""
    },
    {
      "text": "Elly A. Konijn, Marije Nije Bijvank, and Brad J. Bushman. 2007. I wish I were a warrior: The role of wishful identification in the effects of violent video games on aggression in adolescent boys. Developmental Psychology 43, 4 (2007), 1038–1044. https://doi.org/10.1037/0012-1649.43.4.1038",
      "doi": ""
    },
    {
      "text": "Jan Van Looy, Cédric Courtois, Melanie De Vocht, and Lieven De Marez. 2012. Player Identification in Online Games: Validation of a Scale for Measuring Identification in MMOGs. Media Psychology 15, 2 (May 2012), 197–221. https://doi.org/10.1080/15213269.2012.674917",
      "doi": ""
    },
    {
      "text": "Antonio M Lopez, Kun Zhang, and Frederick G Lopez. 2008. Gender and race: Stereotyping, coping selfefficacy and collective self-esteem in the CSET undergraduate pipeline. In 2008 38th Annual Frontiers in Education Conference (Saratoga Springs, NY, USA). IEEE, IEEE Computer Society, Washington, DC, USA, F4B–20.",
      "doi": ""
    },
    {
      "text": "Teresa Lynch, Jessica E Tompkins, Irene I van Driel, and Niki Fritz. 2016. Sexy, strong, and secondary: A content analysis of female characters in video games across 31 years. Journal of Communication 66, 4 (2016), 564–584.",
      "doi": ""
    },
    {
      "text": "Matt McGloin. 2019. Mortal Kombat 11 Backlash Erupts Over Female Characters. https://cosmicbook.news/mortal-kombat-11-backlash-female-characters",
      "doi": ""
    },
    {
      "text": "Denis McQuail. 2010. McQuail’s mass communication theory. Sage publications, Newbury Park, California.",
      "doi": ""
    },
    {
      "text": "Monica K. Miller and Alicia Summers. 2007. Gender Differences in Video Game Characters’ Roles, Appearances, and Attire as Portrayed in Video Game Magazines. Sex Roles 57, 9 (Nov. 2007), 733–742. https://doi.org/10.1007/s11199-007-9307-0",
      "doi": ""
    },
    {
      "text": "Corinne A Moss-Racusin, John F Dovidio, Victoria L Brescoll, Mark J Graham, and Jo Handelsman. 2012. Science faculty’s subtle gender biases favor male students. Proceedings of the national academy of sciences 109, 41(2012), 16474–16479.",
      "doi": ""
    },
    {
      "text": "Yi Mou and Wei Peng. 2009. Gender and Racial Stereotypes in Popular Video Games. In Handbook of research on effective electronic gaming in education. IGI Global, Hershey, Pennsylvania, 922–937. https://doi.org/10.4018/978-1-59904-808-6.ch053",
      "doi": ""
    },
    {
      "text": "NASA Archives. 2014. Space History Photo: Nichelle Nichols, NASA Recruiter | Space. https://www.space.com/24147-nichelle-nichols-nasa-recruiter.html",
      "doi": ""
    },
    {
      "text": "Soo Youn Oh, Jeremy Bailenson, Erika Weisz, and Jamil Zaki. 2016. Virtually old: Embodied perspective taking and the reduction of ageism under threat. Computers in Human Behavior 60 (2016), 398–410. https://doi.org/10.1016/j.chb.2016.02.007",
      "doi": "10.1016/j.chb.2016.02.007"
    },
    {
      "text": "Roobina Ohanian. 1990. Construction and Validation of a Scale to Measure Celebrity Endorsers’ Perceived Expertise, Trustworthiness, and Attractiveness. Journal of Advertising 19, 3 (Oct. 1990), 39–52. https://doi.org/10.1080/00913367.1990.10673191",
      "doi": ""
    },
    {
      "text": "Benjamin Paaßen, Thekla Morgenroth, and Michelle Stratemeyer. 2017. What is a true gamer? The male gamer stereotype and the marginalization of women in video game culture. Sex Roles 76, 7-8 (2017), 421–435.",
      "doi": ""
    },
    {
      "text": "Damon Packwood. 2018. The era of white male games for white male gamers is ending. https://qz.com/1433085/the-era-of-white-male-games-for-white-male-gamers-is-ending/",
      "doi": ""
    },
    {
      "text": "Simon Parkin. 2014. Zoe Quinn’s Depression Quest. https://www.newyorker.com/tech/elements/zoe-quinns-depression-quest",
      "doi": ""
    },
    {
      "text": "Cale J. Passmore, Max V. Birk, and Regan L. Mandryk. 2018. The Privilege of Immersion: Racial and Ethnic Experiences, Perceptions, and Beliefs in Digital Gaming. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 383:1–383:19. https://doi.org/10.1145/3173574.3173957 event-place: Montreal QC, Canada.",
      "doi": "10.1145/3173574.3173957"
    },
    {
      "text": "Cale J. Passmore, Rowan Yates, Max V. Birk, and Regan L. Mandryk. 2017. Racial Diversity in Indie Games: Patterns, Challenges, and Opportunities. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’17 Extended Abstracts). ACM, New York, NY, USA, 137–151. https://doi.org/10.1145/3130859.3131438 event-place: Amsterdam, The Netherlands.",
      "doi": "10.1145/3130859.3131438"
    },
    {
      "text": "Cale J Passmore, Rowan Yates, Max V Birk, and Regan L Mandryk. 2017. Racial diversity in indie games: patterns, challenges, and opportunities. In Extended abstracts publication of the annual symposium on computer-human interaction in play. ACM, Association for Computing Machinery, New York, New York, 137–151.",
      "doi": ""
    },
    {
      "text": "Ivan Patané, Anne Lelgouarch, Domna Banakou, Gregoire Verdelet, Clement Desoche, Eric Koun, Romeo Salemme, Mel Slater, and Alessandro Farnè. 2020. Exploring the Effect of Cooperation in Reducing Implicit Racial Bias and Its Relationship With Dispositional Empathy and Political Attitudes. Frontiers in Psychology 11 (2020), 2281. https://doi.org/10.3389/fpsyg.2020.510787 Publisher: Frontiers.",
      "doi": ""
    },
    {
      "text": "Hyun Kyoung Ro and Karla I. Loya. 2015. The Effect of Gender and Race Intersectionality on Student Learning Outcomes In Engineering. The Review of Higher Education 38, 3 (March 2015), 359–396. https://doi.org/10.1353/rhe.2015.0014",
      "doi": ""
    },
    {
      "text": "Dana N. Ruggiero. 2014. Spent: Changing Students’ Affective Learning Toward Homelessness Through Persuasive Video Game Play. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, New York, NY, USA, 3423–3432. https://doi.org/10.1145/2556288.2557390 event-place: Toronto, Ontario, Canada.",
      "doi": "10.1145/2556288.2557390"
    },
    {
      "text": "Carol Saunders, Anne F. Rutkowski, Michiel Genuchten van, Doug Vogel, and Julio Molina Orrego. 2011. Virtual Space and Place: Theory And Test. MIS Quarterly 35, 4 (2011), 1079–1098. https://doi.org/10.2307/41409974",
      "doi": "10.5555/2208940.2208954"
    },
    {
      "text": "Mike Schmierbach, Qian Xu, Anne Oeldorf-Hirsch, and Frank E. Dardis. 2012. Electronic Friend or Virtual Foe: Exploring the Role of Competitive and Cooperative Multiplayer Video Game Modes in Fostering Enjoyment. Media Psychology 15, 3 (July 2012), 356–371. https://doi.org/10.1080/15213269.2012.702603",
      "doi": ""
    },
    {
      "text": "Jason Schreier. 2020. Ubisoft Family Accused of Mishandling Sexual Misconduct Claims. https://www.bloomberg.com/news/articles/2020-07-21/ubisoft-sexual-misconduct-scandal-harassment-sexism-and-abuse",
      "doi": ""
    },
    {
      "text": "Sharon L. Segrest Purkiss, Pamela L. Perrewé, Treena L. Gillespie, Bronston T. Mayes, and Gerald R. Ferris. 2006. Implicit sources of bias in employment interview judgments and decisions. Organizational Behavior and Human Decision Processes 101, 2 (Nov. 2006), 152–167. https://doi.org/10.1016/j.obhdp.2006.06.005",
      "doi": ""
    },
    {
      "text": "Adrienne Shaw. 2010. Identity, Identification, and Media Representation in Video Game Play: An audience reception study. https://repository.upenn.edu/edissertations/286",
      "doi": ""
    },
    {
      "text": "Sanjay Srivastava, Maya Tamir, Kelly M. McGonigal, Oliver P. John, and James J. Gross. 2009. The social costs of emotional suppression: A prospective study of the transition to college. Journal of Personality and Social Psychology 96, 4(2009), 883–897. https://doi.org/10.1037/a0014755",
      "doi": ""
    },
    {
      "text": "The Game Awards. 2019. Games for Impact | Nominees | The Game Awards. https://thegameawards.com/nominees/games-for-impact",
      "doi": ""
    },
    {
      "text": "The Nielsen Company. 2017. For Us By Us? The Mainstream Appeal of Black Content. https://www.nielsen.com/us/en/insights/article/2017/for-us-by-us-the-mainstream-appeal-of-black-content/",
      "doi": ""
    },
    {
      "text": "Johanna Weststar, Victoria O’Meara, and Marie-Josée Legault. 2018. Developer Satisfaction Survey 2017 Summary Report. , 35 pages. https://s3-us-east-2.amazonaws.com/igda-website/wp-content/uploads/2019/04/11143720/IGDA_DSS_2017_SummaryReport.pdf",
      "doi": ""
    },
    {
      "text": "Grace S. Yang, L. Rowell Huesmann, and Brad J. Bushman. 2014. Effects of playing a violent video game as male versus female avatar on subsequent aggression in male and female players. Aggressive Behavior 40, 6 (2014), 537–541. https://doi.org/10.1002/ab.21551",
      "doi": ""
    },
    {
      "text": "Nick Yee and Jeremy Bailenson. 2007. The Proteus Effect: The Effect of Transformed Self-Representation on Behavior. Human Communication Research 33, 3 (July 2007), 271–290. https://doi.org/10.1111/j.1468-2958.2007.00299.x",
      "doi": ""
    },
    {
      "text": "Robert B. Zajonc. 1968. Attitudinal effects of mere exposure. Journal of Personality and Social Psychology 9, 2, Pt.2(1968), 1–27. https://doi.org/10.1037/h0025848",
      "doi": ""
    },
    {
      "text": "Leslie A. Zebrowitz, Benjamin White, and Kristin Wieneke. 2008. Mere Exposure and Racial Prejudice: Exposure to Other-Race Faces Increases Liking for Strangers of that Race. Social Cognition 26, 3 (June 2008), 259–275. https://doi.org/10.1521/soco.2008.26.3.259",
      "doi": ""
    },
    {
      "text": "Leslie A. Zebrowitz and Yi Zhang. 2012. Neural evidence for reduced apprehensiveness of familiarized stimuli in a mere exposure paradigm. Social Neuroscience 7, 4 (July 2012), 347–358. https://doi.org/10.1080/17470919.2011.628409",
      "doi": ""
    }
  ]
}