{
  "doi": "10.1145/3411764.3446647",
  "title": "ExplAIn Yourself! Transparency for Positive UX in Autonomous Driving",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "In a fully autonomous driving situation, passengers hand over the steering control to a highly automated system. Autonomous driving behaviour may lead to confusion and negative user experience. When establishing such new technology, the user’s acceptance and understanding are crucial factors regarding success and failure. Using a driving simulator and a mobile application, we evaluated if system transparency during and after the interaction can increase the user experience and subjective feeling of safety and control. We contribute an initial guideline for autonomous driving experience design, bringing together the areas of user experience, explainable artificial intelligence and autonomous driving. The AVAM questionnaire, UEQ-S and interviews show that explanations during or after the ride help turn a negative user experience into a neutral one, which might be due to the increased feeling of control. However, we did not detect an effect for combining explanations during and after the ride.",
  "authors": [
    {
      "name": "Tobias Schneider",
      "institution": "Mobile Media Stuttgart Media University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659694046",
      "orcid": "missing"
    },
    {
      "name": "Joana Hois",
      "institution": "RD/RTS Artificial Intelligence Research Mercedes-Benz AG, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659906392",
      "orcid": "missing"
    },
    {
      "name": "Alischa Rosenstein",
      "institution": "E/E Concepts (RD/RTS) Mercedes-Benz AG, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702393",
      "orcid": "missing"
    },
    {
      "name": "Sabiha Ghellal",
      "institution": "Mobile Media Stuttgart Media University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311485210",
      "orcid": "missing"
    },
    {
      "name": "Dimitra Theofanou-Fülbier",
      "institution": "Research & Development Mercedes-Benz AG, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659466928",
      "orcid": "missing"
    },
    {
      "name": "Ansgar R.S. Gerlicher",
      "institution": "Mobile Media Stuttgart Media University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496685525",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amina Adadi and Mohammed Berrada. 2018. Peeking Inside the Black-Box: A Survey on Explainable Artificial Intelligence (XAI). IEEE Access 6(2018), 52138–52160. https://doi.org/10.1109/ACCESS.2018.2870052",
      "doi": ""
    },
    {
      "text": "Icek Ajzen. 2002. Perceived behavioral control, self-efficacy, locus of control, and the theory of planned behavior 1. Journal of applied social psychology 32, 4 (2002), 665–683.",
      "doi": ""
    },
    {
      "text": "Statistisches Amt. 2016. Die wirtschaftliche Lage des Hamburger Taxengewerbes 2016. Technical Report. https://www.hamburg.de/taxi/2935760/taxigewerbe/",
      "doi": ""
    },
    {
      "text": "Nadia Bekri, Jasmin Kling, and Marco Huber. 2019. A Study on Trust in Black Box Models and Post-hoc Explanations. 35–46. https://doi.org/10.1007/978-3-030-20055-8_4",
      "doi": ""
    },
    {
      "text": "Dawn Branley-Bell, Rebecca Whitworth, and Lynne Coventry. 2020. User Trust and Understanding of Explainable AI: Exploring Algorithm Visualisations and User Biases. In Human-Computer Interaction. Human Values and Quality of Life, Masaaki Kurosu (Ed.). Springer International Publishing, Cham, 382–399. https://link.springer.com/content/pdf/10.1007%2F978-3-030-49065-2_27.pdf",
      "doi": ""
    },
    {
      "text": "Lee J. Cronbach. 1951. Coefficient alpha and the internal structure of tests. Psychometrika 16, 3 (Sept. 1951), 297–334.",
      "doi": ""
    },
    {
      "text": "Deloitte 2019. 2019 Deloitte Global Automotive Consumer Study – Advanced vehicle technologies and multimodal transportation. Retrieved June 08, 2020 from https://www2.deloitte.com/content/dam/Deloitte/us/Documents/manufacturing/us-global-automotive-consumer-study-2019.pdf",
      "doi": ""
    },
    {
      "text": "John Dewey. 2005. Art as Experience. Penguin.",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Andrii Matviienko, Melanie Berger, Bastian Pfleging, Marieke Martens, and Jacques Terken. 2020. Communicating the intention of an automated vehicle to pedestrians: The contributions of eHMI and vehicle behavior. it - Information Technology(2020). https://doi.org/10.1515/itit-2020-0025",
      "doi": ""
    },
    {
      "text": "Filip Došilović, Mario Brcic, and Nikica Hlupic. 2018. Explainable Artificial Intelligence: A Survey. In 2018 41st International convention on information and communication technology, electronics and microelectronics (MIPRO). IEEE, 0210–0215. https://doi.org/10.23919/MIPRO.2018.8400040",
      "doi": ""
    },
    {
      "text": "Mengnan Du, Ninghao Liu, and Xia Hu. 2020. Techniques for Interpretable Machine Learning. Commun. ACM (2020), 68–77. https://doi.org/10.1145/3359786",
      "doi": ""
    },
    {
      "text": "Fredrick Ekman, Mikael Johansson, and Jana Sochor. 2016. To See or Not to See - The Effect of Object Recognition on Users’ Trust in ”Automated Vehicles”. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. ACM Press, New York, USA, 1–4.",
      "doi": "10.1145/2971485.2971551"
    },
    {
      "text": "Stefanie Faas, Lesley-Ann Mathis, and Martin Baumann. 2020. External HMI for self-driving vehicles: Which information shall be displayed?Transportation Research Part F Traffic Psychology and Behaviour 68 (01 2020), 171–186. https://doi.org/10.1016/j.trf.2019.12.009",
      "doi": ""
    },
    {
      "text": "Sarah Faltaous, Martin Baumann, Stefan Schneegass, and Lewis Chuang. 2018. Design Guidelines for Reliability Communication in Autonomous Vehicles. In Proceedings of the 7th international conference on automotive user interfaces and interactive vehicular applications. ACM Press, New York, New York, USA, 258–267.",
      "doi": "10.1145/3239060.3239072"
    },
    {
      "text": "Jodi Forlizzi and Katja Battarbee. 2004. Understanding Experience in Interactive Systems. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques(Cambridge, MA, USA) (DIS ’04). Association for Computing Machinery, New York, NY, USA, 261––268. https://doi.org/10.1145/1013115.1013152",
      "doi": "10.1145/1013115.1013152"
    },
    {
      "text": "Lex Fridman. 2018. Human-Centered Autonomous Vehicle Systems: Principles of Effective Shared Autonomy. ArXiv (2018). https://arxiv.org/pdf/1810.01835.pdf",
      "doi": ""
    },
    {
      "text": "Anna-Katharina Frison, Philipp Wintersberger, Tianjia Liu, and Andreas Riener. 2019. Why do you like to drive automated? - a context-dependent analysis of highly automated driving to elaborate requirements for intelligent user interfaces. In Proceedings of the 24th International Conference on Intelligent User Interfaces. ACM Press, New York, USA, 528–537.",
      "doi": "10.1145/3301275.3302331"
    },
    {
      "text": "Peter Fröhlich, Raimund Schatz, Markus Buchta, Johann Schrammel, Stefan Suette, and Manfred Tscheligi. 2019. “What’s the Robo-Driver up to?” Requirements for Screen-based Awareness and Intent Communication in Autonomous Buses. i-com 18, 2 (2019), 151–165.",
      "doi": ""
    },
    {
      "text": "Franziska Hartwich, Cornelia Schmidt, Daniela Gräfing, and Josef F. Krems. 2020. In the passenger seat: differences in the perception of human vs. automated vehicle control and resulting HMI demands of users. In International Conference on Human-Computer Interaction. Springer, 31–45.",
      "doi": "10.1007/978-3-030-50523-3_3"
    },
    {
      "text": "Jacob Haspiel, Na Du, Jill Meyerson, Lionel P. Robert Jr., Dawn Tilbury, X. Jessie Yang, and Anuj K. Pradhan. 2018. Explanations and Expectations: Trust Building in Automated Vehicles. In Companion of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (Chicago, IL, USA) (HRI ’18). Association for Computing Machinery, New York, NY, USA, 119–120. https://doi.org/10.1145/3173386.3177057",
      "doi": "10.1145/3173386.3177057"
    },
    {
      "text": "Marc Hassenzahl. 2007. The hedonic/pragmatic model of user experience. Towards a UX manifesto 10 (2007).",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl and Sarah Diefenbach. 2012. Well-being, need fulfillment, and Experience Design. In Proceedings of the DIS 2012 Workshop on Designing Wellbeing.",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl and Noam Tractinsky. 2006. User experience - a research agenda.Behaviour & IT 25, 2 (2006), 91–97.",
      "doi": ""
    },
    {
      "text": "Renate Häuslschmid, Max von Bülow, Bastian Pfleging, and Andreas Butz. 2017. Supporting Trust in Autonomous Driving. In Proceedings of the 22nd International Conference on Intelligent User Interfaces (Limassol, Cyprus) (IUI ’17). Association for Computing Machinery, New York, NY, USA, 319–329. https://doi.org/10.1145/3025171.3025198",
      "doi": "10.1145/3025171.3025198"
    },
    {
      "text": "Charlie Hewitt, Ioannis Politis, Theocharis Amanatidis, and Advait Sarkar. 2019. Assessing public perception of self-driving cars: The autonomous vehicle acceptance model. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 518–527.",
      "doi": "10.1145/3301275.3302268"
    },
    {
      "text": "High-Level Expert Group on AI. 2019. Ethics guidelines for trustworthy AI. Technical Report. European Commission. Retrieved June 08, 2020 from https://ec.europa.eu/digital-single-market/en/news/ethics-guidelines-trustworthy-ai",
      "doi": ""
    },
    {
      "text": "Joana Hois, Dimitra Theofanou-Fuelbier, and Alischa J. Junk. 2019. How to Achieve Explainability and Transparency in Human AI Interaction. In HCI International 2019 - Posters. Springer, Cham, Cham, 177–183.",
      "doi": ""
    },
    {
      "text": "Lynn M. Hulse, Hui Xie, and Edwin R. Galea. 2018. Perceptions of autonomous vehicles: Relationships with road users, risk, gender and age. Safety Science 102(2018), 1–13. https://doi.org/10.1016/j.ssci.2017.10.001",
      "doi": ""
    },
    {
      "text": "Calin Iclodean, Nicolae Cordos, and Bogdan Ovidiu Varga. 2020. Autonomous Shuttle Bus for Public Transportation: A Review. Energies 13, 11 (2020). https://doi.org/10.3390/en13112917",
      "doi": ""
    },
    {
      "text": "Information Commissioner’s Office and The Alan Turing Institute. 2020. Explaining decisions made with AI. Retrieved June 08, 2020 from https://ico.org.uk/media/for-organisations/guide-to-data-protection/key-data-protection-themes/explaining-decisions-made-with-artificial-intelligence-1-0.pdf",
      "doi": ""
    },
    {
      "text": "Myounghoon Jeon, Andreas Riener, Jason Sterkenburg, Ju-Hwan Lee, Bruce N. Walker, and Ignacio Alvarez. 2018. An International Survey on Automated and Electric Vehicles: Austria, Germany, South Korea, and USA. In Digital Human Modeling. Applications in Health, Safety, Ergonomics, and Risk Management. Springer, Cham, Cham, 579–587.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman, Edward Diener, and Norbert Schwarz. 1999. Well-being: Foundations of hedonic psychology. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Viktoriya Kolarova. 2020. Exploring the Elements and Determinants of the Value of Time for Manual Driving and Autonomous Driving using a Qualitative Approach. In 99th Annual Meeting of the Transport Research Board (TRB). https://doi.org/10.1177/0361198120953770",
      "doi": ""
    },
    {
      "text": "Jeamin Koo, Jungsuk Kwac, Wendy Ju, Martin Steinert, Larry Leifer, and Clifford Nass. 2014. Why did my car just do that? Explaining semi-autonomous driving actions to improve driver understanding, trust, and performance. International Journal on Interactive Design and Manufacturing (IJIDeM) 9, 4 (April 2014), 269–275.",
      "doi": ""
    },
    {
      "text": "Isaac Lage, Emily Chen, Jeffrey He, Menaka Narayanan, Been Kim, Samuel J. Gershman, and Finale Doshi-Velez. 2018. An Evaluation of the Human-Interpretability of Explanation. In Conference on Neural Information Processing Systems (NeurIPS) Workshop on Correcting and Critiquing Trends in Machine Learning.",
      "doi": ""
    },
    {
      "text": "Margarita Martínez-Díaz and Francesc Soriguera. 2018. Autonomous vehicles: theoretical and practical challenges. Transportation Research Procedia 33 (2018), 275–282. https://doi.org/10.1016/j.trpro.2018.10.103 XIII Conference on Transport Engineering, CIT2018.",
      "doi": ""
    },
    {
      "text": "Bernt W. Meerbeek, Christel de Bakker, Yvonne A. W. de Kort, Evert J. van Loenen, and T. Bergman. 2016. Automated blinds with light feedback to increase occupant satisfaction and energy saving. Building and Environment 103 (July 2016), 70–85.",
      "doi": ""
    },
    {
      "text": "Johanna Meurer, Christina Pakusch, Gunnar Stevens, Dave Randall, and Volker Wulf. 2020. A Wizard of Oz Study on Passengers’ Experiences of a Robo-Taxi Service in Real-Life Settings. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (Eindhoven, Netherlands) (DIS ’20). Association for Computing Machinery, New York, NY, USA, 1365–1377. https://doi.org/10.1145/3357236.3395465",
      "doi": "10.1145/3357236.3395465"
    },
    {
      "text": "Tim Miller. 2019. Explanation in artificial intelligence: Insights from the social sciences. Artificial Intelligence 267 (Feb. 2019), 1–38.",
      "doi": ""
    },
    {
      "text": "Sina Mohseni, Niloofar Zarei, and Eric D. Ragan. 2018. A Survey of Evaluation Methods and Measures for Interpretable Machine Learning. CoRR abs/1811.11839(2018). arxiv:1811.11839http://arxiv.org/abs/1811.11839",
      "doi": ""
    },
    {
      "text": "National Highway Traffic Safety Administration. 2016. Federal Automated Vehicles Policy: Accelerating the Next Revolution In Roadway Safety. Retrieved June 24, 2020 from https://www.hsdl.org/?abstract&did=795644",
      "doi": ""
    },
    {
      "text": "P. Jonathon Phillips, Carina A. Hahn, Peter C. Fontana, David A. Broniatowski, and Mark A. Przybocki. 2020. Four Principles of Explainable Artificial Intelligence. Technical Report. https://doi.org/10.6028/NIST.IR.8312-draft",
      "doi": ""
    },
    {
      "text": "SAE On-Road Automated Vehicle Standards Committee and others. 2018. Taxonomy and Definitions for Terms Related to Driving Automation Systems for On-Road Motor Vehicles. SAE International Warrendale, PA, USA(2018).",
      "doi": ""
    },
    {
      "text": "Arto O. Salonen and Noora Haavisto. 2019. Towards Autonomous Transportation. Passengers’ Experiences, Perceptions and Feelings in a Driverless Shuttle Bus in Finland. Sustainability 11, 3 (2019). https://doi.org/10.3390/su11030588",
      "doi": ""
    },
    {
      "text": "Wojciech Samek and Klaus-Robert Müller. 2019. Towards Explainable Artificial Intelligence. Springer International Publishing, Cham, 5–22. https://doi.org/10.1007/978-3-030-28954-6_1",
      "doi": ""
    },
    {
      "text": "Martin Schrepp, Andreas Hinderks, and Jörg Thomaschewski. 2017. Design and Evaluation of a Short Version of the User Experience Questionnaire (UEQ-S). International Journal of Interactive Multimedia and Artificial Intelligence (IJIMAI) 4, 6 (2017), 103–108.",
      "doi": ""
    },
    {
      "text": "Chris Schwarz, John Gaspar, and Timothy Brown. 2019. The effect of reliability on drivers’ trust and behavior in conditional automation. 21 (2019), 41–54. Issue 21. https://rd.springer.com/article/10.1007/s10111-018-0522-y",
      "doi": ""
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, and Brian Y. Lim. 2019. Designing Theory-Driven User-Centric Explainable AI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300831",
      "doi": "10.1145/3290605.3300831"
    },
    {
      "text": "Philipp Wintersberger, Tamara von Sawitzky, Anna-Katharina Frison, and Andreas Riener. 2017. Traffic Augmentation as a Means to Increase Trust in Automated Driving Systems. In Proceedings of the 12th Biannual Conference on Italian SIGCHI Chapter(CHItaly ’17). Association for Computing Machinery, New York, USA. https://doi.org/10.1145/3125571.3125600",
      "doi": "10.1145/3125571.3125600"
    },
    {
      "text": "Christine T. Wolf. 2019. Explainability Scenarios: Towards Scenario-Based XAI Design. In Proceedings of the 24th International Conference on Intelligent User Interfaces(IUI ’19). Association for Computing Machinery, New York, USA, 252–257. https://doi.org/10.1145/3301275.3302317",
      "doi": "10.1145/3301275.3302317"
    },
    {
      "text": "Robert Wortham, Andreas Theodorou, and Joanna Bryson. 2016. What does the robot think? Transparency as a fundamental design requirement for intelligent systems. In International Joint Conferences on Artificial Intelligence 2016: ethics for artificial intelligence workshop.",
      "doi": ""
    }
  ]
}