{
  "doi": "10.1145/3411764.3445206",
  "title": "What Do We See in Them? Identifying Dimensions of Partner Models for Speech Interfaces Using a Psycholexical Approach",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Perceptions of system competence and communicative ability, termed partner models, play a significant role in speech interface interaction. Yet we do not know what the core dimensions of this concept are. Taking a psycholexical approach, our paper is the first to identify the key dimensions that define partner models in speech agent interaction. Through a repertory grid study (N=21), a review of key subjective questionnaires, an expert review of resulting word pairs and an online study of 356 users of speech interfaces, we identify three key dimensions that make up a users’ partner model: 1) perceptions towards partner competence and dependability; 2) assessment of human-likeness; and 3) a system’s perceived cognitive flexibility. We discuss the implications for partner modelling as a concept, emphasising the importance of salience and the dynamic nature of these perceptions.",
  "tags": [
    "mental models",
    "speech interfaces",
    "partner models",
    "psycholexical",
    "psychometrics",
    "human-machine dialogue"
  ],
  "authors": [
    {
      "name": "Philip R Doyle",
      "institution": "School of Information & Communication Studies University College Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659366329",
      "orcid": "0000-0002-2686-8962"
    },
    {
      "name": "Leigh Clark",
      "institution": "Computer Science Swansea University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658644284",
      "orcid": "0000-0002-9237-1057"
    },
    {
      "name": "Benjamin R. Cowan",
      "institution": "School of Information & Communication Studies University College Dublin, Ireland",
      "img": "/do/10.1145/contrib-81453633311/rel-imgonly/photo6.jpg",
      "acmid": "81453633311",
      "orcid": "0000-0002-8595-8132"
    }
  ],
  "references": [
    {
      "text": "Icek Ajzen. 2006. Constructing a theory of planned behavior questionnaire.",
      "doi": ""
    },
    {
      "text": "Kei Akuzawa, Yusuke Iwasawa, and Yutaka Matsuo. 2018. Expressive speech synthesis via modeling expressions with variational autoencoder. arXiv preprint arXiv:1804.02135(2018).",
      "doi": ""
    },
    {
      "text": "René Amalberti, Noëlle Carbonell, and Pierre Falzon. 1993. User representations of computer systems in human-computer speech interaction. International Journal of Man-Machine Studies 38, 4 (1993), 547–566. https://doi.org/10.1006/imms.1993.1026",
      "doi": "10.1006/imms.1993.1026"
    },
    {
      "text": "Jackie Andrade, Jon May, Catherine Deeprose, Sarah-Jane Baugh, and Giorgio Ganis. 2014. Assessing vividness of mental imagery: The Plymouth Sensory Imagery Questionnaire. British Journal of Psychology 105, 4 (2014), 547–563. https://doi.org/10.1111/bjop.12050",
      "doi": ""
    },
    {
      "text": "Benjamin Balas, Lauren Tupa, and Jonathan Pacella. 2018. Measuring social variables in real and artificial faces. Computers in Human Behavior 88 (2018), 236–243.",
      "doi": "10.1016/j.chb.2018.07.013"
    },
    {
      "text": "Simon Baron-Cohen and Sally Wheelwright. 2003. The Friendship Questionnaire: An Investigation of Adults with Asperger Syndrome or High-Functioning Autism, and Normal Sex Differences. Journal of Autism and Developmental Disorders 33, 5 (2003), 509–517. https://doi.org/10.1023/A:1025879411971",
      "doi": ""
    },
    {
      "text": "Justin L Barrett and Frank C Keil. 1996. Conceptualizing a nonnatural entity: Anthropomorphism in God concepts. Cognitive psychology 31, 3 (1996), 219–247.",
      "doi": ""
    },
    {
      "text": "Christoph Bartneck, Dana Kulić, Elizabeth Croft, and Susana Zoghbi. 2009. Measurement Instruments for the Anthropomorphism, Animacy, Likeability, Perceived Intelligence, and Perceived Safety of Robots. International Journal of Social Robotics 1, 1 (2009), 71–81. https://doi.org/10.1007/s12369-008-0001-3",
      "doi": ""
    },
    {
      "text": "Bernard M Bass and Bruce J Avolio. 2004. Multifactor Leadership Questionnaire: MLQ; manual and sampler set. Mind Garden.",
      "doi": ""
    },
    {
      "text": "Allan Bell. 1984. Language style as audience design. Language in society 13, 2 (1984), 145–204.",
      "doi": ""
    },
    {
      "text": "Linda Bell and Joakim Gustafson. 1999. Interaction with an animated agent in a spoken dialogue system. In Sixth European Conference on Speech Communication and Technology.",
      "doi": ""
    },
    {
      "text": "Kirsten Bergmann, Holly P. Branigan, and Stefan Kopp. 2015. Exploring the Alignment Space: Lexical and Gestural Alignment with Real and Virtual Humans. Frontiers in ICT 2(2015). https://doi.org/10.3389/fict.2015.00007",
      "doi": ""
    },
    {
      "text": "Coen A. Bernaards and Robert I. Jennrich. 2005. Gradient Projection Algorithms and Software for Arbitrary Rotation Criteria in Factor Analysis. Educational and Psychological Measurement 65 (2005), 676–696.",
      "doi": ""
    },
    {
      "text": "Johan Bos, Staffan Larsson, I Lewin, C Matheson, and D Milward. 1999. Survey of existing interactive systems. Trindi (Task Oriented Instructional Dialogue) reportD1 (1999), 3.",
      "doi": ""
    },
    {
      "text": "Holly P. Branigan, Martin J. Pickering, Jamie Pearson, and Janet F. McLean. 2010. Linguistic alignment between people and computers. Journal of Pragmatics 42, 9 (2010), 2355–2368. https://doi.org/10.1016/j.pragma.2009.12.012",
      "doi": ""
    },
    {
      "text": "Holly P. Branigan, Martin J. Pickering, Jamie Pearson, Janet F. McLean, and Ash Brown. 2011. The role of beliefs in lexical alignment: Evidence from dialogs with humans and computers. Cognition 121, 1 (2011), 41–57. https://doi.org/10.1016/j.cognition.2011.05.011",
      "doi": ""
    },
    {
      "text": "Susan E. Brennan, Alexia Galati, and Anna K. Kuhlen. 2010. Two Minds, One Dialog. In Psychology of Learning and Motivation. Vol. 53. Elsevier, 301–344. https://doi.org/10.1016/S0079-7421(10)53008-1",
      "doi": ""
    },
    {
      "text": "Susan E. Brennan and Justina O. Ohaeri. 1994. Effects of message style on users’ attributions toward agents. In Conference companion on Human factors in computing systems - CHI ’94 (Boston, Massachusetts, United States). ACM Press, 281–282. https://doi.org/10.1145/259963.260492",
      "doi": ""
    },
    {
      "text": "Donald E Broadbent, P Fitzgerald Cooper, Paul FitzGerald, and Katharine R Parkes. 1982. The cognitive failures questionnaire (CFQ) and its correlates. British journal of clinical psychology 21, 1 (1982), 1–16.",
      "doi": ""
    },
    {
      "text": "Jeanne H. Brockmyer, Christine M. Fox, Kathleen A. Curtiss, Evan McBroom, Kimberly M. Burkhart, and Jacquelyn N. Pidruzny. 2009. The development of the Game Engagement Questionnaire: A measure of engagement in video game-playing. Journal of Experimental Social Psychology 45, 4 (2009), 624 – 634. https://doi.org/10.1016/j.jesp.2009.02.016",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS: a “quick and dirty’usability. Usability evaluation in industry(1996), 189.",
      "doi": ""
    },
    {
      "text": "Martin Bruder, Peter Haffke, Nick Neave, Nina Nouripanah, and Roland Imhoff. 2013. Measuring individual differences in generic beliefs in conspiracy theories across cultures: Conspiracy Mentality Questionnaire. Frontiers in psychology 4 (2013), 225.",
      "doi": ""
    },
    {
      "text": "Martin Brüne. 2005. Emotion recognition,‘theory of mind,’and social behavior in schizophrenia. Psychiatry research 133, 2-3 (2005), 135–147.",
      "doi": ""
    },
    {
      "text": "F.B. Bryant and P.R. Yarnold. 1995. Principal-components analysis and exploratory and confirmatory factor analysis. In Reading and understanding multivariate statistics. A.P.A., 99–136.",
      "doi": ""
    },
    {
      "text": "Christopher G Buchanan, Matthew P Aylett, and David A Braude. 2018. Adding personality to neutral speech synthesis voices. In International Conference on Speech and Computer. Springer, 49–57.",
      "doi": ""
    },
    {
      "text": "Duane Buhrmester, Wyndol Furman, Mitchell T. Wittenberg, and Harry T. Reis. 1988. Five domains of interpersonal competence in peer relationships.Journal of Personality and Social Psychology 55, 6(1988), 991–1008. https://doi.org/10.1037/0022-3514.55.6.991",
      "doi": ""
    },
    {
      "text": "Sam Cartwright-Hatton and Adrian Wells. 1997. Beliefs about Worry and Intrusions: The Meta-Cognitions Questionnaire and its Correlates. Journal of Anxiety Disorders 11, 3 (1997), 279–296. https://doi.org/10.1016/S0887-6185(97)00011-X",
      "doi": ""
    },
    {
      "text": "Sherry Perdue Casali, Beverly H. Williges, and Robert D. Dryden. 1990. Effects of Recognition Accuracy and Vocabulary Size of a Speech Recognition System on Task Performance and User Acceptance. Human Factors: The Journal of the Human Factors and Ergonomics Society 32, 2(1990), 183–196. https://doi.org/10.1177/001872089003200206",
      "doi": "10.1177/001872089003200206"
    },
    {
      "text": "Matthew G Chin, Valerie K Sims, Bryan Clark, and Gabriel Rivera Lopez. 2004. Measuring individual differences in anthropomorphism toward machines and animals. In Proceedings of the human factors and ergonomics society annual meeting, Vol. 48. SAGE Publications Sage CA: Los Angeles, CA, 1252–1255.",
      "doi": ""
    },
    {
      "text": "Matthew G Chin, Ryan E Yordon, Bryan R Clark, Tatiana Ballion, Michael J Dolezal, Randall Shumaker, and Neal Finkelstein. 2005. Developing and anthropomorphic tendencies scale. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 49. SAGE Publications, Los Angeles, CA, 1266–1268.",
      "doi": ""
    },
    {
      "text": "Vincent Cho and Robert Wright. 2010. Exploring the evaluation framework of strategic information systems using repertory grid technique: a cognitive perspective from chief information officers. Behaviour & Information Technology 29, 5 (2010), 447–457. https://doi.org/10.1080/01449290802121206",
      "doi": "10.1080/01449290802121206"
    },
    {
      "text": "Herbert H. Clark. 1996. Using language. Cambridge University Press. https://doi.org/10.1017/CBO9780511620539",
      "doi": ""
    },
    {
      "text": "Leigh Clark, Phillip Doyle, Diego Garaialde, Emer Gilmartin, Stephan Schlögl, Jens Edlund, Matthew Aylett, João Cabral, Cosmin Munteanu, and Benjamin Cowan. 2019. The State of Speech in HCI: Trends, Themes and Challenges. Interact with Computers(2019), 29.",
      "doi": ""
    },
    {
      "text": "Leigh Clark, Abdulmalik Ofemile, Svenja Adolphs, and Tom Rodden. 2016. A Multimodal Approach to Assessing User Experiences with Agent Helpers. ACM Transactions on Interactive Intelligent Systems 6, 4 (2016), 1–31. https://doi.org/10.1145/2983926",
      "doi": "10.1145/2983926"
    },
    {
      "text": "Lee Anna Clark and David Watson. 2016. Constructing validity: Basic issues in objective scale development.(2016).",
      "doi": ""
    },
    {
      "text": "Nancy L Collins. 1996. Working models of attachment: Implications for explanation, emotion, and behavior.Journal of personality and social psychology 71, 4(1996), 810.",
      "doi": ""
    },
    {
      "text": "Benjamin R Cowan. 2014. Understanding speech and language interactions in HCI: The importance of theory-based human-human dialogue research. (2014), 4.",
      "doi": ""
    },
    {
      "text": "Benjamin R Cowan and Holly Branigan. 2017. They Know as Much as We Do: Knowledge Estimation and Partner Modelling of Artificial Partners. (2017), 6.",
      "doi": ""
    },
    {
      "text": "Benjamin R. Cowan, Holly P. Branigan, Mateo Obregón, Enas Bugis, and Russell Beale. 2015. Voice anthropomorphism, interlocutor modelling and alignment effects on syntactic choices in human computer dialogue. International Journal of Human-Computer Studies 83 (2015), 27–42. https://doi.org/10.1016/j.ijhcs.2015.05.008",
      "doi": "10.1016/j.ijhcs.2015.05.008"
    },
    {
      "text": "Benjamin R. Cowan, Philip Doyle, Justin Edwards, Diego Garaialde, Ali Hayes-Brady, Holly P. Branigan, João Cabral, and Leigh Clark. 2019. What’s in an accent?: the impact of accented synthetic speech on lexical choice in human-machine dialogue. In Proceedings of the 1st International Conference on Conversational User Interfaces - CUI ’19 (Dublin, Ireland). ACM Press, 1–8. https://doi.org/10.1145/3342775.3342786",
      "doi": "10.1145/3342775.3342786"
    },
    {
      "text": "B. R. Cowan and M. A. Jack. 2014. Measuring Anxiety Towards Wiki Editing: Investigating the Dimensionality of the Wiki Anxiety Inventory-Editing. Interacting with Computers 26, 6 (2014), 557–571. https://doi.org/10.1093/iwc/iwt050",
      "doi": ""
    },
    {
      "text": "Benjamin R. Cowan, Nadia Pantidi, David Coyle, Kellie Morrissey, Peter Clarke, Sara Al-Shehri, David Earley, and Natasha Bandeira. 2017. ”What can I help you with?”: infrequent users’ experiences of intelligent personal assistants. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services - MobileHCI ’17 (Vienna, Austria). ACM Press, 1–12. https://doi.org/10.1145/3098279.3098539",
      "doi": "10.1145/3098279.3098539"
    },
    {
      "text": "Kenneth J. W. Craik. 1943. The Nature of Explanation. The Journal of Philosophy 40, 24 (1943), 667. https://doi.org/10.2307/2018933",
      "doi": ""
    },
    {
      "text": "Douglas P Crowne and David Marlowe. 1960. A new scale of social desirability independent of psychopathology.Journal of consulting psychology 24, 4 (1960), 349.",
      "doi": ""
    },
    {
      "text": "Nils Dahlbäck, QianYing Wang, Clifford Nass, and Jenny Alwin. 2007. Similarity is more important than expertise: accent effects in speech interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI ’07(San Jose, California, USA). ACM Press, 1553. https://doi.org/10.1145/1240624.1240859",
      "doi": "10.1145/1240624.1240859"
    },
    {
      "text": "Hannah Darwin, Nick Neave, and Joni Holmes. 2011. Belief in conspiracy theories. The role of paranormal belief, paranoid ideation and schizotypy. Personality and Individual Differences 50, 8 (2011), 1289–1293.",
      "doi": ""
    },
    {
      "text": "B Alexander Diaz, Sophie Van Der Sluis, Sarah Moens, Jeroen S Benjamins, Filippo Migliorati, Diederick Stoffers, Anouk Den Braber, Simon-Shlomo Poil, Richard Hardstone, Dennis Van’t Ent, 2013. The Amsterdam Resting-State Questionnaire reveals multiple phenotypes of resting-state cognition. Frontiers in human neuroscience 7 (2013), 446.",
      "doi": ""
    },
    {
      "text": "DL Dintruff, DG Grice, and TG Wang. 1985. User acceptance of speech technologies. Speech Technology 2, 4 (1985), 16–21.",
      "doi": ""
    },
    {
      "text": "Philip R. Doyle, Justin Edwards, Odile Dumbleton, Leigh Clark, and Benjamin R. Cowan. 2019. Mapping Perceptions of Humanness in Intelligent Personal Assistant Interaction. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei Taiwan). ACM, 1–12. https://doi.org/10.1145/3338286.3340116",
      "doi": "10.1145/3338286.3340116"
    },
    {
      "text": "Louise Dulude. 2002. Automated telephone answering systems and aging. Behaviour & Information Technology 21, 3 (2002), 171–184. https://doi.org/10.1080/0144929021000013482",
      "doi": ""
    },
    {
      "text": "Nicholas Duran, Rick Dale, and Alexia Galati. 2016. Toward Integrative Dynamic Models for Adaptive Perspective Taking. Topics in Cognitive Science 8, 4 (2016), 761–779. https://doi.org/10.1111/tops.12219",
      "doi": ""
    },
    {
      "text": "Jens Edlund, Joakim Gustafson, Mattias Heldner, and Anna Hjalmarsson. 2008. Towards human-like spoken dialogue systems. Speech Communication 50, 8 (2008), 630–645. https://doi.org/10.1016/j.specom.2008.04.002",
      "doi": "10.1016/j.specom.2008.04.002"
    },
    {
      "text": "Jens Edlund, Julia Bell Hirschberg, and Mattias Heldner. 2009. Pause and gap length in face-to-face interaction. Columbia University (2009). https://doi.org/10.7916/d82f7wt9",
      "doi": ""
    },
    {
      "text": "Rochelle E. Evans and Philip Kortum. 2010. The impact of voice characteristics on user response in an interactive voice response system. Interacting with Computers 22, 6 (2010), 606–614. https://doi.org/10.1016/j.intcom.2010.07.001",
      "doi": "10.1016/j.intcom.2010.07.001"
    },
    {
      "text": "Daniel Fallman and John Waterworth. 2010. Capturing User Experiences of Mobile Information Technology With the Repertory Grid Technique. Human Technology: An Interdisciplinary Journal on Humans in ICT Environments 6, 2 (2010), 250–268. https://doi.org/10.17011/ht/urn.201011173094",
      "doi": ""
    },
    {
      "text": "Bruce A. Fernie, Marcantonio M. Spada, Ana V. Nikčević, George A. Georgiou, and Giovanni B. Moneta. 2009. Metacognitive Beliefs About Procrastination: Development and Concurrent Validity of a Self-Report Questionnaire. Journal of Cognitive Psychotherapy 23, 4 (2009), 283–293. https://doi.org/10.1891/0889-8391.23.4.283 arXiv:https://connect.springerpub.com/content/sgrjcp/23/4/283.full.pdf",
      "doi": ""
    },
    {
      "text": "Andy Field, Jeremy Miles, and Zoë Field. 2013. Discovering Statistics Using R by Andy Field, Jeremy Miles, Zoë Field. International Statistical Review 81, 1 (2013), 169–170. https://doi.org/10.1111/insr.12011_21",
      "doi": ""
    },
    {
      "text": "Yannick Forster, Frederik Naujoks, and Alexandra Neukum. 2017. Increasing anthropomorphism and trust in automated driving functions by adding speech output. In 2017 IEEE intelligent vehicles symposium (IV). IEEE, 365–372.",
      "doi": ""
    },
    {
      "text": "Fay Fransella, Richard Bell, and D. Bannister. 2004. A manual for repertory grid technique(2nd ed ed.). John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Susan R. Fussell and Robert M. Krauss. 1992. Coordination of knowledge in communication: Effects of speakers’ assumptions about what others know.Journal of Personality and Social Psychology 62, 3(1992), 378–391. https://doi.org/10.1037/0022-3514.62.3.378",
      "doi": ""
    },
    {
      "text": "Emer Gilmartin, Marine Collery, Ketong Su, Yuyun Huang, Christy Elias, Benjamin R. Cowan, and Nick Campbell. 2017. Social talk: making conversation with people and machine. In Proceedings of the 1st ACM SIGCHI International Workshop on Investigating Social Interactions with Artificial Agents - ISIAA 2017 (Glasgow, UK). ACM Press, 31–32. https://doi.org/10.1145/3139491.3139494",
      "doi": "10.1145/3139491.3139494"
    },
    {
      "text": "Li Gong and Jennifer Lai. 2001. Shall we mix synthetic speech and human speech?: impact on users’ performance, perception, and attitude. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI ’01 (Seattle, Washington, United States). ACM Press, 158–165. https://doi.org/10.1145/365024.365090",
      "doi": "10.1145/365024.365090"
    },
    {
      "text": "Robert Goodman. 2001. Psychometric Properties of the Strengths and Difficulties Questionnaire. Journal of the American Academy of Child & Adolescent Psychiatry 40, 11(2001), 1337–1345. https://doi.org/10.1097/00004583-200111000-00015",
      "doi": ""
    },
    {
      "text": "Frank M Gresham and Stephen N Elliott. 1990. Social skills rating system: Manual. American Guidance Service.",
      "doi": ""
    },
    {
      "text": "Christiaan Grootaert. 2004. Measuring social capital: an integrated questionnaire. no. 18 (2004).",
      "doi": ""
    },
    {
      "text": "Marc Hassenzahl, Michael Burmester, and Franz Koller. 2003. AttrakDiff: Ein Fragebogen zur Messung wahrgenommener hedonischer und pragmatischer Qualität. In Mensch & computer 2003. Springer, 187–196.",
      "doi": ""
    },
    {
      "text": "Trevor Hogan and Eva Hornecker. 2013. Blending the repertory grid technique with focus groups to reveal rich design relevant insight. In Proceedings of the 6th International Conference on Designing Pleasurable Products and Interfaces - DPPI ’13 (Newcastle upon Tyne, United Kingdom). ACM Press, 116. https://doi.org/10.1145/2513506.2513519",
      "doi": "10.1145/2513506.2513519"
    },
    {
      "text": "Kate S. Hone and Robert Graham. 2000. Towards a tool for the Subjective Assessment of Speech System Interfaces (SASSI). Natural Language Engineering 6, 3 (2000), 287–303. https://doi.org/10.1017/S1351324900002497",
      "doi": "10.1017/S1351324900002497"
    },
    {
      "text": "Francis Huang. 2015. Horn’s (1965) Test to Determine the Number of Components/Factors. (Version 1).",
      "doi": ""
    },
    {
      "text": "Elin Jacob and Debora Shaw. 1998. Sociocognitive Perspectives on Representation. Annual Review of Information Science and Technology 33 (1998), 131–85.",
      "doi": ""
    },
    {
      "text": "Devi Jankowicz. 2004. The easy guide to repertory grids. Wiley.",
      "doi": ""
    },
    {
      "text": "Alan M Jette, Allyson R Davies, Paul D Cleary, David R Calkins, Lisa V Rubenstein, Arlene Fink, Jacqueline Kosecoff, Roy T Young, Robert H Brook, and Thomas L Delbanco. 1986. The functional status questionnaire. Journal of general internal medicine 1, 3 (1986), 143–149.",
      "doi": ""
    },
    {
      "text": "Philip N. Johnson-Laird. 1980. Mental Models in Cognitive Science. Cognitive Science 4(1980), 71–115.",
      "doi": ""
    },
    {
      "text": "P. N. Johnson-Laird. 2010. Mental models and human reasoning. Proceedings of the National Academy of Sciences 107, 43(2010), 18243–18250. https://doi.org/10.1073/pnas.1012933107",
      "doi": ""
    },
    {
      "text": "AF Jorm. 1994. A short form of the Informant Questionnaire on Cognitive Decline in the Elderly (IQCODE): development and cross-validation. Psychological medicine 24, 1 (1994), 145–153.",
      "doi": ""
    },
    {
      "text": "Shaughan A Keaton. 2017. Interpersonal Reactivity Index (IRI) (Davis, 1980). The Sourcebook of listening research: Methodology and measures (2017), 340–347.",
      "doi": ""
    },
    {
      "text": "George Kelly. 1991. The psychology of personal constructs. Routledge in association with the Centre for Personal Construct Psychology.",
      "doi": ""
    },
    {
      "text": "Peter Kinderman and Richard P Bentall. 1996. A new measure of causal locus: the internal, personal and situational attributions questionnaire. Personality and Individual differences 20, 2 (1996), 261–264.",
      "doi": ""
    },
    {
      "text": "Sabina Kleitman and Lazar Stankov. 2007. Self-confidence and metacognitive processes. Learning and Individual Differences 17, 2 (2007), 161 – 173. https://doi.org/10.1016/j.lindif.2007.03.004",
      "doi": ""
    },
    {
      "text": "Paul Kline. 2000. A psychometrics primer. Free Association. OCLC: 833721971.",
      "doi": ""
    },
    {
      "text": "Paul Kline. 2013. Handbook of Psychological Testing(2 ed.). Routledge. https://doi.org/10.4324/9781315812274",
      "doi": ""
    },
    {
      "text": "Leanne K. Knobloch and Denise Haunani Solomon. 2005. Relational Uncertainty and Relational Information Processing: Questions without Answers?Communication Research 32, 3 (2005), 349–388. https://doi.org/10.1177/0093650205275384",
      "doi": ""
    },
    {
      "text": "A. Baki Kocaballi, Juan C. Quiroz, Liliana Laranjo, Dana Rezazadegan, Rafal Kocielnik, Leigh Clark, Q. Vera Liao, Sun Young Park, Robert J. Moore, and Adam Miner. 2020. Conversational Agents for Health and Wellbeing. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3375154",
      "doi": "10.1145/3334480.3375154"
    },
    {
      "text": "Chris E. Lalonde and Michael J. Chandler. 1995. False belief understanding goes to school: On the social-emotional consequences of coming early or late to a first theory of mind. Cognition & Emotion 9, 2 (1995), 167–185. https://doi.org/10.1080/02699939508409007",
      "doi": ""
    },
    {
      "text": "Lars Bo Larsen. 2003. Assessment of Spoken Dialogue System Usability - What are We really Measuring?. In Proceedings from EuroSpeech 2003 - Interspeech 2003 8th European Conference on Speech Communication and Technology (Geneva). ISCA.",
      "doi": ""
    },
    {
      "text": "Lucian Leahu, Marisa Cohn, and Wendy March. 2013. How categories come to matter. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13 (Paris, France). ACM Press, 3331. https://doi.org/10.1145/2470654.2466455",
      "doi": "10.1145/2470654.2466455"
    },
    {
      "text": "Kwan Min Lee and Clifford Nass. 2003. Designing social presence of social actors in human computer interaction. In Proceedings of the conference on Human factors in computing systems - CHI ’03 (Ft. Lauderdale, Florida, USA). ACM Press, 289. https://doi.org/10.1145/642611.642662",
      "doi": "10.1145/642611.642662"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. ”Like Having a Really Bad PA”: The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems - CHI ’16 (Santa Clara, California, USA). ACM Press, 5286–5297. https://doi.org/10.1145/2858036.2858288",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Michael R. Maniaci and Ronald D. Rogge. 2014. Caring about carelessness: Participant inattention and its effects on research. Journal of Research in Personality 48 (2014), 61 – 83. https://doi.org/10.1016/j.jrp.2013.09.008",
      "doi": ""
    },
    {
      "text": "Rod A. Martin, Patricia Puhlik-Doris, Gwen Larsen, Jeanette Gray, and Kelly Weir. 2003. Individual differences in uses of humor and their relation to psychological well-being: Development of the Humor Styles Questionnaire. Journal of Research in Personality 37, 1 (2003), 48 – 75. https://doi.org/10.1016/S0092-6566(02)00534-2",
      "doi": ""
    },
    {
      "text": "Roger K Moore. 2017. Is spoken language all-or-nothing? Implications for future speech-based human-machine interaction. In Dialogues with Social Robots. Springer, 281–291.",
      "doi": ""
    },
    {
      "text": "Nick Neave, Rachel Jackson, Tamsin Saxton, and Johannes Hönekopp. 2015. The influence of anthropomorphic tendencies on human hoarding behaviours. Personality and Individual Differences 72 (2015), 214–219. https://doi.org/10.1016/j.paid.2014.08.041",
      "doi": ""
    },
    {
      "text": "Raymond S. Nickerson. 1999. How we know—and sometimes misjudge—what others know: Imputing one’s own knowledge to others.Psychological Bulletin 125, 6 (1999), 737–759. https://doi.org/10.1037/0033-2909.125.6.737",
      "doi": ""
    },
    {
      "text": "Donald Norman. 1983. Some Observations on Mental Models. In Mental Models (1sted.). Psychology Press, 7–15.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 2013. The design of everyday things(revised and expanded edition ed.). Basic Books.",
      "doi": ""
    },
    {
      "text": "Sally Olderbak and Oliver Wilhelm. 2017. Emotion perception and empathy: An individual differences test of relations.Emotion 17, 7 (2017), 1092.",
      "doi": ""
    },
    {
      "text": "Sharon Oviatt, Jon Bernard, and Gina-Anne Levow. 1998. Linguistic Adaptations During Spoken and Multimodal Error Resolution. Language and Speech 41, 3 (1998), 419–442. https://doi.org/10.1177/002383099804100409",
      "doi": ""
    },
    {
      "text": "Arun Parasuraman, Leonard L Berry, and Valarie A Zeithaml. 1991. Refinement and reassessment of the SERVQUAL scale. Journal of retailing 67, 4 (1991), 420.",
      "doi": ""
    },
    {
      "text": "Jamie Pearson, Jiang Hu, Holly P Branigan, Martin J Pickering, and Clifford I Nass. 2006. Adaptive Language Behavior in HCI: How Expectations and Beliefs about a System Affect Users’ Word Choice. (2006), 4.",
      "doi": "10.1145/1124772.1124948"
    },
    {
      "text": "Jan Hyld Pejtersen, Tage Søndergård Kristensen, Vilhelm Borg, and Jakob Bue Bjorner. 2010. The second version of the Copenhagen Psychosocial Questionnaire. Scandinavian journal of public health 38, 3_suppl (2010), 8–24.",
      "doi": ""
    },
    {
      "text": "John L. Perry, Peter J. Clough, Lee Crust, Keith Earle, and Adam R. Nicholls. 2013. Factorial validity of the Mental Toughness Questionnaire-48. Personality and Individual Differences 54, 5 (2013), 587 – 592. https://doi.org/10.1016/j.paid.2012.11.020",
      "doi": ""
    },
    {
      "text": "Christopher Peterson, Amy Semmel, Carl Von Baeyer, Lyn Y Abramson, Gerald I Metalsky, and Martin EP Seligman. 1982. The attributional style questionnaire. Cognitive therapy and research 6, 3 (1982), 287–299.",
      "doi": ""
    },
    {
      "text": "Paul R. Pintrich and Elisabeth V. De Groot. 1990. Motivational and Self-Regulated Learning Components of Classroom Academic Performance. Journal of Educational Psychology 82, 1 (1990), 33–40.",
      "doi": ""
    },
    {
      "text": "Melanie D Polkosky. 2005. Toward a social-cognitive psychology of speech technology: Affective responses to speech-based eservice. (2005). https://scholarcommons.usf.edu/cgi/viewcontent.cgi?article=1818&context=etd",
      "doi": ""
    },
    {
      "text": "Melanie D Polkosky and James R Lewis. 2003. Expanding the MOS: Development and psychometric evaluation of the MOS-R and MOS-X. International Journal of Speech Technology 6, 2 (2003), 161–182.",
      "doi": ""
    },
    {
      "text": "Pernilla Qvarfordt, Arne Jönsson, and Nils Dahlbäck. 2003. The role of spoken feedback in experiencing multimodal interfaces as human-like. In Proceedings of the 5th international conference on Multimodal interfaces - ICMI ’03 (Vancouver, British Columbia, Canada). ACM Press, 250. https://doi.org/10.1145/958432.958478",
      "doi": "10.1145/958432.958478"
    },
    {
      "text": "R Development Core Team. 2009. R: A Language and Environment for Statistical Computing. R Foundation for Statistical Computing, Vienna, Austria. http://www.R-project.orgISBN 3-900051-07-0.",
      "doi": ""
    },
    {
      "text": "Renate LEP Reniers, Rhiannon Corcoran, Richard Drake, Nick M Shryane, and Birgit A Völlm. 2011. The QCAE: A questionnaire of cognitive and affective empathy. Journal of personality assessment 93, 1 (2011), 84–95.",
      "doi": ""
    },
    {
      "text": "William Revelle. 2020. psych: Procedures for Psychological, Psychometric, and Personality Research. Northwestern University, Evanston, Illinois. https://CRAN.R-project.org/package=psychR package version 2.0.8.",
      "doi": ""
    },
    {
      "text": "Carolien Rieffe, Lizet Ketelaar, and Carin H Wiefferink. 2010. Assessing empathy in young children: Construction and validation of an Empathy Questionnaire (EmQue). Personality and individual differences 49, 5 (2010), 362–367.",
      "doi": ""
    },
    {
      "text": "GC Roberts and G Balagué. 1991. The development and validation of the Perception of Success Questionnaire. In FEPSAC Congress, Cologne, Germany.",
      "doi": ""
    },
    {
      "text": "Peter AM Ruijten, Antal Haans, Jaap Ham, and Cees JH Midden. 2019. Perceived human-likeness of social robots: testing the Rasch model as a method for measuring anthropomorphism. International Journal of Social Robotics 11, 3 (2019), 477–494.",
      "doi": ""
    },
    {
      "text": "Maha Salem, Friederike Eyssel, Katharina Rohlfing, Stefan Kopp, and Frank Joublin. 2013. To Err is Human(-like): Effects of Robot Gesture on Perceived Anthropomorphism and Likability. International Journal of Social Robotics 5, 3 (2013), 313–323. https://doi.org/10.1007/s12369-013-0196-9",
      "doi": ""
    },
    {
      "text": "Irwin G. Sarason, Henry M. Levine, Robert B. Basham, and Barbara R. Sarason. 1983. Assessing social support: The Social Support Questionnaire.Journal of Personality and Social Psychology 44, 1(1983), 127–139. https://doi.org/10.1037/0022-3514.44.1.127",
      "doi": ""
    },
    {
      "text": "Sau-lai Lee, Ivy Yee-man Lau, S. Kiesler, and Chi-Yue Chiu. 2005. Human Mental Models of Humanoid Robots. In Proceedings of the 2005 IEEE International Conference on Robotics and Automation (Barcelona, Spain). IEEE, 2767–2772. https://doi.org/10.1109/ROBOT.2005.1570532",
      "doi": ""
    },
    {
      "text": "Elisabeth Schaffalitzky, Sinead NiMhurchadha, Pamela Gallagher, Susan Hofkamp, Malcolm MacLachlan, and Stephen T. Wegener. 2009. Identifying the Values and Preferences of Prosthetic Users: A Case Study Series Using the Repertory Grid Technique. Prosthetics and Orthotics International 33, 2 (2009), 157–166. https://doi.org/10.1080/03093640902855571",
      "doi": ""
    },
    {
      "text": "Gregory Schraw and Rayne Sperling Dennison. 1994. Assessing metacognitive awareness. Contemporary educational psychology 19, 4 (1994), 460–475.",
      "doi": ""
    },
    {
      "text": "Martin Schrepp, Andreas Hinderks, and Jörg Thomaschewski. 2017. Design and Evaluation of a Short Version of the User Experience Questionnaire (UEQ-S).IJIMAI 4, 6 (2017), 103–108.",
      "doi": ""
    },
    {
      "text": "Mildred L.G. Shaw and Laurie F. Thomas. 1978. FOCUS on education—an interactive computer system for the development and analysis of repertory grids. International Journal of Man-Machine Studies 10, 2 (1978), 139–173. https://doi.org/10.1016/S0020-7373(78)80009-1",
      "doi": ""
    },
    {
      "text": "Virginia Slaughter, Michelle J Dennis, and Michelle Pritchard. 2002. Theory of mind and peer acceptance in preschool children. British journal of developmental psychology 20, 4 (2002), 545–564.",
      "doi": ""
    },
    {
      "text": "Michael A. Smyer, Brian F. Hofland, and Edward A. Jonas. 1979. Validity Study of the Short Portable Mental Status Questionnaire for the Elderly*. Journal of the American Geriatrics Society 27, 6 (1979), 263–269. https://doi.org/10.1111/j.1532-5415.1979.tb06128.x",
      "doi": ""
    },
    {
      "text": "Brendan Spillane, Emer Gilmartin, Christian Saam, and Vincent Wade. 2019. Issues Relating to Trust in Care Agents for the Elderly. In Proceedings of the 1st International Conference on Conversational User Interfaces (Dublin, Ireland) (CUI ’19). Association for Computing Machinery, New York, NY, USA, Article 20, 3 pages. https://doi.org/10.1145/3342775.3342808",
      "doi": "10.1145/3342775.3342808"
    },
    {
      "text": "R. Nathan Spreng, Margaret C. McKinnon, Raymond A. Mar, and Brian Levine. 2009. The Toronto Empathy Questionnaire: Scale Development and Initial Validation of a Factor-Analytic Solution to Multiple Empathy Measures. Journal of Personality Assessment 91, 1 (2009), 62–71. https://doi.org/10.1080/00223890802484381",
      "doi": ""
    },
    {
      "text": "Michael F Steger, Patricia Frazier, Shigehiro Oishi, and Matthew Kaler. 2006. The meaning in life questionnaire: Assessing the presence of and search for meaning in life.Journal of counseling psychology 53, 1 (2006), 80.",
      "doi": ""
    },
    {
      "text": "Anita Tobar-Henríquez, Hugh Rabagliati, and Holly P. Branigan. 2020. Lexical entrainment reflects a stable individual trait: Implications for individual differences in language processing.Journal of Experimental Psychology: Learning, Memory, and Cognition 46, 6(2020), 1091–1105. https://doi.org/10.1037/xlm0000774",
      "doi": ""
    },
    {
      "text": "Lai Lai Tung, Yun Xu, and Felix B. Tan. 2009. Attributes of Web Site Usability: A Study of Web Users with the Repertory Grid Technique. International Journal of Electronic Commerce 13, 4 (2009), 97–126. https://doi.org/10.2753/JEC1086-4415130405",
      "doi": "10.2753/JEC1086-4415130405"
    },
    {
      "text": "Larry Vandergrift, Christine CM Goh, Catherine J Mareschal, and Marzieh H Tafaghodtari. 2006. The metacognitive awareness listening questionnaire: Development and validation. Language learning 56, 3 (2006), 431–462.",
      "doi": ""
    },
    {
      "text": "Sarah Theres Völkel, Ramona Schödel, Daniel Buschek, Clemens Stachl, Verena Winterhalter, Markus Bühner, and Heinrich Hussmann. 2020. Developing a Personality Model for Speech-based Conversational Agents Using the Psycholexical Approach. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu HI USA). ACM, 1–14. https://doi.org/10.1145/3313831.3376210",
      "doi": "10.1145/3313831.3376210"
    },
    {
      "text": "Marilyn A. Walker, Jeanne Fromer, Giuseppe Di Fabbrizio, Craig Mestel, and Don Hindle. 1998. What can I say?: evaluating a spoken language interface to Email. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI ’98 (Los Angeles, California, United States). ACM Press, 582–589. https://doi.org/10.1145/274644.274722",
      "doi": "10.1145/274644.274722"
    },
    {
      "text": "Marilyn A Walker, Diane J Litman, Candace A Kamm, and Alicia Abella. 1998. Evaluating spoken dialogue agents with PARADISE: Two case studies. Computer speech and language 12, 4 (1998), 317–348.",
      "doi": ""
    },
    {
      "text": "Adam Waytz, John Cacioppo, and Nicholas Epley. 2010. Who Sees Human?: The Stability and Importance of Individual Differences in Anthropomorphism. Perspectives on Psychological Science 5, 3 (2010), 219–232. https://doi.org/10.1177/1745691610369336",
      "doi": ""
    },
    {
      "text": "Lynn Westbrook. 2006. Mental models: a theoretical overview and preliminary study. Journal of Information Science 32, 6 (2006), 563–579. https://doi.org/10.1177/0165551506068134",
      "doi": "10.1177/0165551506068134"
    },
    {
      "text": "Sally Wheelwright, Simon Baron-Cohen, Nigel Goldenfeld, Joe Delaney, Debra Fine, Richard Smith, Leonora Weil, and Akio Wakabayashi. 2006. Predicting autism spectrum quotient (AQ) from the systemizing quotient-revised (SQ-R) and empathy quotient (EQ). Brain research 1079, 1 (2006), 47–56.",
      "doi": ""
    },
    {
      "text": "Carsten Zoll and Sibylle Enz. 2010. A questionnaire to assess affective and cognitive empathy in children. (2010).",
      "doi": ""
    }
  ]
}