{
  "doi": "10.1145/3411764.3445441",
  "title": "User Authentication via Electrical Muscle Stimulation",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "We propose a novel modality for active biometric authentication: electrical muscle stimulation (EMS). To explore this, we engineered an interactive system, which we call ElectricAuth, that stimulates the user’s forearm muscles with a sequence of electrical impulses (i.e., EMS challenge) and measures the user’s involuntary finger movements (i.e., response to the challenge). ElectricAuth leverages EMS’s intersubject variability, where the same electrical stimulation results in different movements in different users because everybody’s physiology is unique (e.g., differences in bone and muscular structure, skin resistance and composition, etc.). As such, ElectricAuth allows users to login without memorizing passwords or PINs.  ElectricAuth’s challenge-response structure makes it secure against data breaches and replay attacks, a major vulnerability facing today’s biometrics such as facial recognition and fingerprints. Furthermore, ElectricAuth never reuses the same challenge twice in authentications – in just one second of stimulation it encodes one of 68M possible challenges. In our user studies, we found that ElectricAuth resists: (1) impersonation attacks (false acceptance rate: 0.17% at 5% false rejection rate); (2) replay attacks (false acceptance rate: 0.00% at 5% false rejection rate); and, (3) synthesis attacks (false acceptance rates: 0.2-2.5%). Our longitudinal study also shows that ElectricAuth produces consistent results over time and across different humidity and muscle conditions.",
  "tags": [
    "electrical muscle stimulation",
    "wearable",
    "biometric authentication"
  ],
  "authors": [
    {
      "name": "Yuxin Chen",
      "institution": "University of Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528260",
      "orcid": "missing"
    },
    {
      "name": "Zhuolin Yang",
      "institution": "University of Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700804",
      "orcid": "missing"
    },
    {
      "name": "Ruben Abbou",
      "institution": "University of Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700790",
      "orcid": "missing"
    },
    {
      "name": "Pedro Lopes",
      "institution": "University of Chicago, United States",
      "img": "/do/10.1145/contrib-81557182156/rel-imgonly/_pedrolopes_uchicago.jpg",
      "acmid": "81557182156",
      "orcid": "0000-0001-6527-7084"
    },
    {
      "name": "Ben Y. Zhao",
      "institution": "University of Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700527",
      "orcid": "missing"
    },
    {
      "name": "Haitao Zheng",
      "institution": "University of Chicago, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452605074",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ali Ahanger and Anil Kumar. 2014. Effect of Anthropometric Factors on Motor Nerve Conduction Velovity in Healthy Kashmiri Population. International Journal of Medical and Applied Sciences 3 (feb 2014), 125–132.",
      "doi": ""
    },
    {
      "text": "Karan Ahuja, Rahul Islam, Varun Parashar, Kuntal Dey, Chris Harrison, and Mayank Goel. 2018. EyeSpyVR: Interactive Eye Sensing Using Off-the-Shelf, Smartphone-Based VR Headsets. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 2, Article 57 (July 2018), 10 pages. https://doi.org/10.1145/3214260",
      "doi": "10.1145/3214260"
    },
    {
      "text": "A. Ali-Gombe, E. Elyan, and C. Jayne. 2019. Multiple Fake Classes GAN for Data Augmentation in Face Image Dataset. In 2019 International Joint Conference on Neural Networks (IJCNN). 1–8.",
      "doi": ""
    },
    {
      "text": "Aware. 2020. Voice Authentication. https://www.aware.com/voice-authentication/.",
      "doi": ""
    },
    {
      "text": "Xueliang Bao, Yuxuan Zhou, Yunlong Wang, Jianjun Zhang, Xiaoying Lü, and Zhigong Wang. 2018. Electrode placement on the forearm for selective stimulation of finger extension/flexion. PloS one 13, 1 (2018).",
      "doi": ""
    },
    {
      "text": "Thomas Brewster. 2019. We Broke Into A Bunch Of Android Phones With A 3D-Printed Head. https://www.forbes.com/sites/thomasbrewster/2018/12/13/we-broke-into-a-bunch-of-android-phones-with-a-3d-printed-head/#4a9a79213307.",
      "doi": ""
    },
    {
      "text": "Saikiran Bulusu, Bhavya Kailkhura, Bo Li, Pramod K. Varshney, and Dawn Song. 2020. Anomalous Instance Detection in Deep Learning: A Survey. arxiv:2003.06979 [cs.LG]",
      "doi": ""
    },
    {
      "text": "Joseph P Campbell. 1997. Speaker recognition: A tutorial. Proc. IEEE 85, 9 (1997), 1437–1462.",
      "doi": ""
    },
    {
      "text": "Z. Cao, G. Hidalgo Martinez, T. Simon, S. Wei, and Y. A. Sheikh. 2019. OpenPose: Realtime Multi-Person 2D Pose Estimation using Part Affinity Fields. IEEE Transactions on Pattern Analysis and Machine Intelligence (2019).",
      "doi": "10.1109/TPAMI.2019.2929257"
    },
    {
      "text": "R. Chandler, C. Clauser, J. McConville, Herbert Reynolds, and J. Young. 1975. Investigation of Inertial Properties of the Human Body. (03 1975), 171.",
      "doi": ""
    },
    {
      "text": "Charles E Clauser, John T McConville, and J W Young. 1971. Weight, Volumn, and Center of Mass of Segments of The Human Body. Journal of Occupational and Environmental Medicine (1971).",
      "doi": ""
    },
    {
      "text": "Cory Cornelius, Ronald Peterson, Joseph Skinner, Ryan Halter, and David Kotz. 2014. A Wearable System That Knows Who Wears It. In Proceedings of the 12th Annual International Conference on Mobile Systems, Applications, and Services (Bretton Woods, New Hampshire, USA) (MobiSys ’14). Association for Computing Machinery, New York, NY, USA, 55–67. https://doi.org/10.1145/2594368.2594369",
      "doi": "10.1145/2594368.2594369"
    },
    {
      "text": "A Desplantez, C Cornu, and F Goubel. 1999. Viscous properties of human muscle during contraction. Journal of biomechanics 32, 6 (1999), 555–562. https://doi.org/10.1016/S0021-9290(99)00039-1",
      "doi": ""
    },
    {
      "text": "K.N. Dewangan, G.V. [Prasanna Kumar], P.L. Suja, and M.D. Choudhury. 2005. Anthropometric dimensions of farm youth of the north eastern region of India. International Journal of Industrial Ergonomics 35, 11(2005), 979 – 989. https://doi.org/10.1016/j.ergon.2005.04.003",
      "doi": ""
    },
    {
      "text": "Laura Dipietro, Angelo M Sabatini, and Paolo Dario. 2008. A survey of glove-based systems and their applications. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews) 38, 4 (2008), 461–482.",
      "doi": "10.1109/TSMCC.2008.923862"
    },
    {
      "text": "Carl Doersch. 2016. Tutorial on Variational Autoencoders. arxiv:1606.05908 [stat.ML]",
      "doi": ""
    },
    {
      "text": "R Drillis, R Contini, and M Bluestein. 1964. Body Segment Parameters; A Survey of Measurement Techniques. Artificial limbs 8(1964), 44–66. http://europepmc.org/abstract/MED/14208177",
      "doi": ""
    },
    {
      "text": "Simon Eberz, Nicola Paoletti, Marc Roeschlin, Andrea Patané, Marta Kwiatkowska, and Ivan Martinovic. 2017. Broken Hearted: How To Attack ECG Biometrics. In 24th Annual Network and Distributed System Security Symposium, NDSS 2017, San Diego, California, USA, February 26 - March 1, 2017. The Internet Society. https://www.ndss-symposium.org/ndss2017/ndss-2017-programme/broken-hearted-how-attack-ecg-biometrics/",
      "doi": ""
    },
    {
      "text": "[19] Basic VAE Example.2019. https://github.com/pytorch/examples/tree/master/vae.",
      "doi": ""
    },
    {
      "text": "Farzam Farbiz, Zhou Hao Yu, Corey Manders, and Waqas Ahmad. 2007. An Electrical Muscle Stimulation Haptic Feedback for Mixed Reality Tennis Game. In ACM SIGGRAPH 2007 Posters (San Diego, California) (SIGGRAPH ’07). Association for Computing Machinery, New York, NY, USA, 140–es. https://doi.org/10.1145/1280720.1280873",
      "doi": "10.1145/1280720.1280873"
    },
    {
      "text": "Michael J. Grey. 1997. Viscoelastic properties of the human wrist during the stabilization phase of a targeted movement. Master’s thesis. Simon Fraser University, Burnaby, Canada.",
      "doi": ""
    },
    {
      "text": "Anhong Guo, Robert Xiao, and Chris Harrison. 2015. CapAuth: Identifying and Differentiating User Handprints on Commodity Capacitive Touchscreens. In Proceedings of the 2015 International Conference on Interactive Tabletops Surfaces (Madeira, Portugal) (ITS ’15). Association for Computing Machinery, New York, NY, USA, 59–62. https://doi.org/10.1145/2817721.2817722",
      "doi": "10.1145/2817721.2817722"
    },
    {
      "text": "SDR Harridge, R Bottinelli, M Canepari, MA Pellegrino, C Reggiani, M Esbjörnsson, and B Saltin. 1996. Whole-muscle and single-fibre contractile properties and myosin heavy chain isoforms in humans. Pflügers Archiv 432, 5 (1996), 913–920.",
      "doi": ""
    },
    {
      "text": "[24] Hasomed.2020. https://hasomed.de/en/.",
      "doi": ""
    },
    {
      "text": "Andres Hernandez-Matamorosb, Hamido Fujita, and Hector Perez-Meanac. 2020. A novel approach to create synthetic biomedical signals using BiRNN. Elsevier Information Sciences 541 (Dec 2020), 218–241.",
      "doi": ""
    },
    {
      "text": "AL Hof. 1998. In vivo measurement of the series elasticity release curve of human triceps surae muscle. Journal of biomechanics 31, 9 (1998), 793–800.",
      "doi": ""
    },
    {
      "text": "Christian Holz and Patrick Baudisch. 2013. Fiberio: A Touchscreen That Senses Fingerprints. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology (St. Andrews, Scotland, United Kingdom) (UIST ’13). Association for Computing Machinery, New York, NY, USA, 41–50. https://doi.org/10.1145/2501988.2502021",
      "doi": "10.1145/2501988.2502021"
    },
    {
      "text": "Christian Holz and Marius Knaust. 2015. Biometric Touch Sensing: Seamlessly Augmenting Each Touch with Continuous Authentication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 303–312. https://doi.org/10.1145/2807442.2807458",
      "doi": "10.1145/2807442.2807458"
    },
    {
      "text": "Christopher-Eyk Hrabia, Katrin Wolf, and Mathias Wilhelm. 2013. Whole Hand Modeling Using 8 Wearable Sensors: Biomechanics for Hand Pose Prediction. In Proceedings of the 4th Augmented Human International Conference (Stuttgart, Germany) (AH ’13). Association for Computing Machinery, New York, NY, USA, 21–28. https://doi.org/10.1145/2459236.2459241",
      "doi": "10.1145/2459236.2459241"
    },
    {
      "text": "[30] Report: Data Breach in Biometric Security Platform Affecting Millions of Users.2019. https://www.vpnmentor.com/blog/report-biostar2-leak/.",
      "doi": ""
    },
    {
      "text": "Steven A Israel and John M Irvine. 2012. Heartbeat biometrics: a sensing system perspective. International Journal of Cognitive Biometrics 1, 1 (2012), 39–65.",
      "doi": ""
    },
    {
      "text": "Zach Jorgensen and Ting Yu. 2011. On mouse dynamics as a behavioral biometric for authentication. In Proceedings of the 6th ACM Symposium on Information, Computer and Communications Security. 476–482.",
      "doi": "10.1145/1966913.1966983"
    },
    {
      "text": "T. Keller, M. Lawrence, A. Kuhn, and M. Morari. 2006. New Multi-Channel Transcutaneous Electrical Stimulation Technology for Rehabilitation. In 2006 International Conference of the IEEE Engineering in Medicine and Biology Society. 194–197.",
      "doi": ""
    },
    {
      "text": "David Kim, Otmar Hilliges, Shahram Izadi, Alex D. Butler, Jiawen Chen, Iason Oikonomidis, and Patrick Olivier. 2012. Digits: Freehand 3D Interactions Anywhere Using a Wrist-Worn Gloveless Sensor. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology(UIST’12). Association for Computing Machinery, New York, NY, USA, 167–176. https://doi.org/10.1145/2380116.2380139",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Tomi Kinnunen, Md. Sahidullah, Héctor Delgado, Massimiliano Todisco, Nicholas Evans, Junichi Yamagishi, and Kong Aik Lee. 2017. The ASVspoof 2017 Challenge: Assessing the Limits of Replay Spoofing Attack Detection. In Proc. Interspeech 2017. 2–6. https://doi.org/10.21437/Interspeech.2017-1111",
      "doi": ""
    },
    {
      "text": "Jarrod Knibbe, Paul Strohmeier, Sebastian Boring, and Kasper Hornbæk. 2017. Automatic Calibration of High Density Electric Muscle Stimulation. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 68 (Sept. 2017), 17 pages. https://doi.org/10.1145/3130933",
      "doi": "10.1145/3130933"
    },
    {
      "text": "Michinari Kono, Takumi Takahashi, Hiromi Nakamura, Takashi Miyaki, and Jun Rekimoto. 2018. Design Guideline for Developing Safe Systems That Apply Electricity to the Human Body. ACM Trans. Comput.-Hum. Interact. 25, 3, Article 19 (June 2018), 36 pages. https://doi.org/10.1145/3184743",
      "doi": "10.1145/3184743"
    },
    {
      "text": "Okan Köpüklü, Ahmet Gunduz, Neslihan Kose, and Gerhard Rigoll. 2019. Real-time Hand Gesture Detection and Classification Using Convolutional Neural Networks. In 14th IEEE International Conference on Automatic Face & Gesture Recognition, FG 2019, Lille, France, May 14-18, 2019. IEEE, 1–8. https://doi.org/10.1109/FG.2019.8756576",
      "doi": ""
    },
    {
      "text": "Ernst Kruijff, Dieter Schmalstieg, and Steffi Beckhaus. 2006. Using Neuromuscular Electrical Stimulation for Pseudo-Haptic Feedback. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (Limassol, Cyprus) (VRST ’06). Association for Computing Machinery, New York, NY, USA, 316–319. https://doi.org/10.1145/1180495.1180558",
      "doi": "10.1145/1180495.1180558"
    },
    {
      "text": "Jingjie Li, Kassem Fawaz, and Younghyun Kim. 2019. Velody: Nonlinear Vibration Challenge-Response for Resilient User Authentication. In Proceedings of the 2019 ACM SIGSAC Conference on Computer and Communications Security(London, United Kingdom) (CCS ’19). Association for Computing Machinery, New York, NY, USA, 1201–1213. https://doi.org/10.1145/3319535.3354242",
      "doi": "10.1145/3319535.3354242"
    },
    {
      "text": "Chong L. Lim, Chris Rennie, Robert J. Barry, Homayoun Bahramali, Ilario Lazzaro, Barry Manor, and Evian Gordon. 1997. Decomposing skin conductance into tonic and phasic components. International Journal of Psychophysiology 25, 2 (1997), 97 – 109. https://doi.org/10.1016/S0167-8760(96)00713-1",
      "doi": ""
    },
    {
      "text": "Feng Lin, Kun Woo Cho, Chen Song, Wenyao Xu, and Zhanpeng Jin. 2018. Brain Password: A Secure and Truly Cancelable Brain Biometrics for Smart Headwear. In Proceedings of the 16th Annual International Conference on Mobile Systems, Applications, and Services (Munich, Germany) (MobiSys ’18). Association for Computing Machinery, New York, NY, USA, 296–309. https://doi.org/10.1145/3210240.3210344",
      "doi": "10.1145/3210240.3210344"
    },
    {
      "text": "Pedro Lopes and Patrick Baudisch. 2013. Muscle-Propelled Force Feedback: Bringing Force Feedback to Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 2577–2580. https://doi.org/10.1145/2470654.2481355",
      "doi": "10.1145/2470654.2481355"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 11–19. https://doi.org/10.1145/2807442.2807443",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, Willi Mueller, Daniel Hoffmann, Patrik Jonell, and Patrick Baudisch. 2015. Proprioceptive Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 939–948. https://doi.org/10.1145/2702123.2702461",
      "doi": "10.1145/2702123.2702461"
    },
    {
      "text": "Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++: Allowing Objects to Communicate Dynamic Use. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2515–2524. https://doi.org/10.1145/2702123.2702128",
      "doi": "10.1145/2702123.2702128"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1471–1482. https://doi.org/10.1145/3025453.3025600",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Pedro Lopes, Sijing You, Alexandra Ion, and Patrick Baudisch. 2018. Adding Force Feedback to Mixed Reality Experiences and Games Using Electrical Muscle Stimulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 446, 13 pages. https://doi.org/10.1145/3173574.3174020",
      "doi": "10.1145/3173574.3174020"
    },
    {
      "text": "Pedro Lopes, Doăa Yüksel, François Guimbretière, and Patrick Baudisch. 2016. Muscle-Plotter: An Interactive System Based on Electrical Muscle Stimulation That Produces Spatial Output. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 207–217. https://doi.org/10.1145/2984511.2984530",
      "doi": "10.1145/2984511.2984530"
    },
    {
      "text": "Y. Luo and B. Lu. 2018. EEG Data Augmentation for Emotion Recognition Using a Conditional Wasserstein GAN. In 2018 40th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). 2535–2538.",
      "doi": ""
    },
    {
      "text": "Davide Maltoni, Dario Maio, Anil K Jain, and Salil Prabhakar. 2009. Handbook of fingerprint recognition. Springer Science & Business Media.",
      "doi": "10.5555/1557624"
    },
    {
      "text": "Meethu Malu, Pramod Chundury, and Leah Findlater. 2018. Exploring Accessible Smartwatch Interactions for People with Upper Body Motor Impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 12. https://doi.org/10.1145/3173574.3174062",
      "doi": "10.1145/3173574.3174062"
    },
    {
      "text": "Wayne J Millar. 1986. Distribution of body weight and height: comparison of estimates based on self-reported and observed measures.Journal of Epidemiology & Community Health 40, 4 (1986), 319–323.",
      "doi": ""
    },
    {
      "text": "Tahrima Mustafa, Richard Matovu, Abdul Serwadda, and Nicholas Muirhead. 2018. Unsure How to Authenticate on Your VR Headset? Come on, Use Your Head!. In Proceedings of the Fourth ACM International Workshop on Security and Privacy Analytics (Tempe, AZ, USA) (IWSPA ’18). Association for Computing Machinery, New York, NY, USA, 23–30. https://doi.org/10.1145/3180445.3180450",
      "doi": "10.1145/3180445.3180450"
    },
    {
      "text": "Gergana Stefanova Nikolova and Yuli Emilov Toshev. 2007. Estimation of male and female body segment parameters of the Bulgarian population using a 16-segmental mathematical model. Journal of Biomechanics 40, 16 (2007), 3700–3707. https://doi.org/10.1016/j.jbiomech.2007.06.016",
      "doi": ""
    },
    {
      "text": "Oculus. 2019. Introducing Hand Tracking on Oculus Quest-Bringing Your Real Hands into VR. https://www.oculus.com/blog/introducing-hand-tracking-on-oculus-quest-bringing-your-real-hands-into-vr/.",
      "doi": ""
    },
    {
      "text": "Patrick Howell O’Neill. 2019. Data leak exposes unchangeable biometric data of over 1 million people. https://www.technologyreview.com/f/614163/data-leak-exposes-unchangeable-biometric-data-of-over-1-million-people/.",
      "doi": ""
    },
    {
      "text": "Francisco Javier Ordóñez and Daniel Roggen. 2016. Deep Convolutional and LSTM Recurrent Neural Networks for Multimodal Wearable Activity Recognition.Sensors (Basel) 16, 1 (Jan 2016). https://doi.org/10.3390/s16010115",
      "doi": ""
    },
    {
      "text": "Marcos Ortega, M.G. Penedo, J. Rouco, N. Barreira, and M.J. Carreira. 2009. Personal verification based on extraction and characterisation of retinal feature points. Journal of Visual Languages & Computing 20, 2 (2009), 80–90. https://doi.org/10.1016/j.jvlc.2009.01.006",
      "doi": "10.1016/j.jvlc.2009.01.006"
    },
    {
      "text": "Shwetak N. Patel, Jeffrey S. Pierce, and Gregory D. Abowd. 2004. A Gesture-Based Authentication Scheme for Untrusted Public Terminals. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (Santa Fe, NM, USA) (UIST ’04). Association for Computing Machinery, New York, NY, USA, 157–160. https://doi.org/10.1145/1029632.1029658",
      "doi": "10.1145/1029632.1029658"
    },
    {
      "text": "P. Hunter Peckham and Jayme S. Knutson. 2005. Functional Electrical Stimulation for Neuromuscular Applications. Annual Review of Biomedical Engineering 7, 1 (2005), 327–360. https://doi.org/10.1146/annurev.bioeng.6.040803.140103",
      "doi": ""
    },
    {
      "text": "Ken Pfeuffer, Matthias J. Geiger, Sarah Prange, Lukas Mecke, Daniel Buschek, and Florian Alt. 2019. Behavioural Biometrics in VR: Identifying People from Body Motion and Relations in Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 110, 12 pages. https://doi.org/10.1145/3290605.3300340",
      "doi": "10.1145/3290605.3300340"
    },
    {
      "text": "Marco A.F. Pimentel, David A. Clifton, Lei Clifton, and Lionel Tarassenko. 2014. A review of novelty detection. Signal Processing 99(2014), 215 – 249. https://doi.org/10.1016/j.sigpro.2013.12.026",
      "doi": "10.1016/j.sigpro.2013.12.026"
    },
    {
      "text": "D. Popovic, L. L. Baker, and G. E. Loeb. 2007. Recruitment and Comfort of BION Implanted Electrical Stimulation: Implications for FES Applications. IEEE Transactions on Neural Systems and Rehabilitation Engineering 15, 4(2007), 577–586.",
      "doi": ""
    },
    {
      "text": "Ana Popović-Bijelić, Goran Bijelić, Nikola Jorgovanović, Dubravka Bojanić, Mirjana B. Popović, and Dejan B. Popović. 2005. Multi-Field Surface Electrode for Selective Electrical Stimulation. Artificial Organs 29, 6 (2005), 448–452. https://doi.org/10.1111/j.1525-1594.2005.29075.x",
      "doi": ""
    },
    {
      "text": "Vijay Rajanna, Seth Polsley, Paul Taele, and Tracy Hammond. 2017. A Gaze Gesture-Based User Authentication System to Counter Shoulder-Surfing Attacks. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI EA ’17). Association for Computing Machinery, New York, NY, USA, 1978–1986. https://doi.org/10.1145/3027063.3053070",
      "doi": "10.1145/3027063.3053070"
    },
    {
      "text": "Kasper Bonne Rasmussen, Marc Roeschlin, Ivan Martinovic, and Gene Tsudik. 2014. Authentication Using Pulse-Response Biometrics. In 21st Annual Network and Distributed System Security Symposium, NDSS 2014, San Diego, California, USA, February 23-26, 2014. The Internet Society. https://www.ndss-symposium.org/ndss2014/authentication-using-pulse-response-biometrics",
      "doi": ""
    },
    {
      "text": "Brian Reed. 1997. The physiology of neuromuscular electrical stimulation. Pediatric Physical Therapy 9, 3 (1997), 96–102. https://journals.lww.com/pedpt/Fulltext/1997/00930/The_Physiology_of_Neuromuscular_Electrical.2.aspx",
      "doi": ""
    },
    {
      "text": "Tim Salimans, Andrej Karpathy, Xi Chen, and Diederik P. Kingma. 2017. PixelCNN++: A PixelCNN Implementation with Discretized Logistic Mixture Likelihood and Other Modifications. In ICLR.",
      "doi": ""
    },
    {
      "text": "Munehiko Sato, Rohan S. Puri, Alex Olwal, Yosuke Ushigome, Lukas Franciszkiewicz, Deepak Chandra, Ivan Poupyrev, and Ramesh Raskar. 2017. Zensei: Embedded, Multi-Electrode Bioimpedance Sensing for Implicit, Ubiquitous User Recognition. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3972–3985. https://doi.org/10.1145/3025453.3025536",
      "doi": "10.1145/3025453.3025536"
    },
    {
      "text": "T. Simon, H. Joo, I. Matthews, and Y. Sheikh. 2017. Hand Keypoint Detection in Single Images Using Multiview Bootstrapping. In 2017 IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 4645–4653. https://doi.org/10.1109/CVPR.2017.494",
      "doi": ""
    },
    {
      "text": "Ayan Sinha, Chiho Choi, and Karthik Ramani. 2016. DeepHand: Robust Hand Pose Estimation by Completing a Matrix Imputed With Deep Features. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 4150–4158. https://doi.org/10.1109/CVPR.2016.450",
      "doi": ""
    },
    {
      "text": "Ivo Sluganovic, Marc Roeschlin, Kasper B. Rasmussen, and Ivan Martinovic. 2016. Using Reflexive Eye Movements for Fast Challenge-Response Authentication. In Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security(Vienna, Austria) (CCS ’16). Association for Computing Machinery, New York, NY, USA, 1056–1067. https://doi.org/10.1145/2976749.2978311",
      "doi": "10.1145/2976749.2978311"
    },
    {
      "text": "Spiceworks. 2018. Spiceworks Study Reveals Nearly 90 Percent of Businesses Will Use Biometric Authentication Technology by 2020. https://www.spiceworks.com/press/releases/spiceworks-study-reveals-nearly-90-percent-businesses-will-use-biometric-authentication-technology-2020/.",
      "doi": ""
    },
    {
      "text": "Diana S. Stetson, James W. Albers, Barbara A. Silverstein, and Robert A. Wolfe. 1992. Effects of age, sex, and anthropometric factors on nerve conduction measures. Muscle & Nerve 15, 10 (1992), 1095–1104. https://doi.org/10.1002/mus.880151007",
      "doi": ""
    },
    {
      "text": "Primož Strojnik, Alojz Kralj, and I Ursic. 1979. Programmed six-channel electrical stimulator for complex stimulation of leg muscles during walking. IEEE Transactions on Biomedical Engineering2 (1979), 112–116.",
      "doi": ""
    },
    {
      "text": "Fangmin Sun, Chenfei Mao, Xiaomao Fan, and Ye Li. 2019. Accelerometer-Based Speed-Adaptive Gait Authentication Method for Wearable IoT Devices. IEEE Internet of Things Journal 6, 1 (2019), 820–830. https://doi.org/10.1109/JIOT.2018.2860592",
      "doi": ""
    },
    {
      "text": "Fangmin Sun, Chenfei Mao, Xiaomao Fan, and Ye Li. 2019. Accelerometer-Based Speed-Adaptive Gait Authentication Method for Wearable IoT Devices. IEEE Internet of Things Journal 6, 1 (2019), 820–830. https://doi.org/10.1109/JIOT.2018.2860592",
      "doi": ""
    },
    {
      "text": "Emi Tamaki, Takashi Miyaki, and Jun Rekimoto. 2011. PossessedHand: Techniques for Controlling Human Hands Using Electrical Muscles Stimuli. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 543–552. https://doi.org/10.1145/1978942.1979018",
      "doi": "10.1145/1978942.1979018"
    },
    {
      "text": "Pin Shen Teh, Andrew Beng Jin Teoh, and Shigang Yue. 2013. A survey of keystroke dynamics biometrics. The Scientific World Journal 2013 (2013). https://doi.org/10.1155/2013/408280",
      "doi": ""
    },
    {
      "text": "The Muscle Physiology Laboratory UCSD. 2008. Fundamental Functional Properties of Skeletal Muscle. http://muscle.ucsd.edu/musintro/props.shtml.",
      "doi": ""
    },
    {
      "text": "Kai Uffmann, Stefan Maderwald, Waleed Ajaj, Craig G Galban, Serban Mateiescu, Harald H Quick, and Mark E Ladd. 2004. In vivo elasticity measurements of extremity skeletal muscle with MR elastography. NMR in Biomedicine: An International Journal Devoted to the Development and Application of Magnetic Resonance In Vivo 17, 4 (2004), 181–190.",
      "doi": ""
    },
    {
      "text": "Tran Huy Vu, Archan Misra, Quentin Roy, Kenny Choo Tsu Wei, and Youngki Lee. 2018. Smartwatch-Based Early Gesture Detection 8 Trajectory Tracking for Interactive Gesture-Driven Applications. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 1 (March 2018), 27. https://doi.org/10.1145/3191771",
      "doi": "10.1145/3191771"
    },
    {
      "text": "Chengde Wan, Thomas Probst, Luc Van Gool, and Angela Yao. 2019. Self-Supervised 3D Hand Pose Estimation Through Training by Fitting. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR). 10845–10854. https://doi.org/10.1109/CVPR.2019.01111",
      "doi": ""
    },
    {
      "text": "Richard P Wildes. 1997. Iris recognition: an emerging biometric technology. Proc. IEEE 85, 9 (1997), 1348–1363.",
      "doi": ""
    },
    {
      "text": "Davey Winder. 2019. Apple’s iPhone FaceID Hacked In Less Than 120 Seconds. https://www.forbes.com/sites/daveywinder/2019/08/10/apples-iphone-faceid-hacked-in-less-than-120-seconds/#449ff4b621bc.",
      "doi": ""
    },
    {
      "text": "Davey Winder. 2019. Hackers Claim Any Smartphone Fingerprint Lock Can Be Broken In 20 Minutes. https://www.forbes.com/sites/daveywinder/2019/11/02/smartphone-security-alert-as-hackers-claim-any-fingerprint-lock-broken-in-20-minutes/#588a90116853.",
      "doi": ""
    },
    {
      "text": "Yi Xu, True Price, Jan-Michael Frahm, and Fabian Monrose. 2016. Virtual U: Defeating Face Liveness Detection by Building Virtual Models from Your Public Photos. In 25th USENIX Security Symposium, USENIX Security 16, Austin, TX, USA, August 10-12, 2016, Thorsten Holz and Stefan Savage (Eds.). USENIX Association, 497–512.",
      "doi": ""
    },
    {
      "text": "Jian Zhao, Lin Xiong, Karlekar Jayashree, Jianshu Li, Fang Zhao, Zhecan Wang, Sugiri Pranata, Shengmei Shen, Shuicheng Yan, and Jiashi Feng. 2017. Dual-Agent GANs for Photorealistic and Identity Preserving Profile Face Synthesis. In Proceedings of the 31st International Conference on Neural Information Processing Systems (Long Beach, California, USA) (NIPS’17). Curran Associates Inc., Red Hook, NY, USA, 65–75.",
      "doi": "10.5555/3294771.3294778"
    },
    {
      "text": "Junhan Zhou, Yang Zhang, Gierad Laput, and Chris Harrison. 2016. AuraSense: Enabling Expressive Around-Smartwatch Interactions with Electric Field Sensing. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 81–86. https://doi.org/10.1145/2984511.2984568",
      "doi": "10.1145/2984511.2984568"
    }
  ]
}