{
  "doi": "10.1145/3411764.3445743",
  "title": "Understanding Data Accessibility for People with Intellectual and Developmental Disabilities",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Using visualization requires people to read abstract visual imagery, estimate statistics, and retain information. However, people with Intellectual and Developmental Disabilities (IDD) often process information differently, which may complicate connecting abstract visual information to real-world quantities. This population has traditionally been excluded from visualization design, and often has limited access to data related to their well being. We explore how visualizations may better serve this population. We identify three visualization design elements that may improve data accessibility: chart type, chart embellishment, and data continuity. We evaluate these elements with populations both with and without IDD, measuring accuracy and efficiency in a web-based online experiment with time series and proportion data. Our study identifies performance patterns and subjective preferences for people with IDD when reading common visualizations. These findings suggest possible solutions that may break the cognitive barriers caused by conventional design guidelines.",
  "tags": [
    "human-subjects quantitative studies",
    "graphical perception & cognition"
  ],
  "authors": [
    {
      "name": "Keke Wu",
      "institution": "ATLAS Institute, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701844",
      "orcid": "0000-0003-2361-7284"
    },
    {
      "name": "Emma Petersen",
      "institution": "ATLAS Institute University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701670",
      "orcid": "0000-0001-8708-8647"
    },
    {
      "name": "Tahmina Ahmad",
      "institution": "Department of Computer Science, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702234",
      "orcid": "missing"
    },
    {
      "name": "David Burlinson",
      "institution": "ATLAS Institute, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83059017857",
      "orcid": "missing"
    },
    {
      "name": "Shea Tanis",
      "institution": "Coleman Institute for Cognitive Disabilities, University of Colorado Anschutz Medical Campus, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548661456",
      "orcid": "missing"
    },
    {
      "name": "Danielle Albers Szafir",
      "institution": "ATLAS Institute, University of Colorado Boulder, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659179583",
      "orcid": "0000-0003-3634-8597"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Accessibility in amCharts 4. https://www.amcharts.com/accessibility/accessible-charts/",
      "doi": ""
    },
    {
      "text": "[n.d.]. Frequently Asked Questions on Intellectual Disability. https://www.aaidd.org/intellectual-disability/definition/faqs-on-intellectual-disability",
      "doi": ""
    },
    {
      "text": "2011. World Report on Disability. World Health Organization, Geneva, Switzerland.",
      "doi": ""
    },
    {
      "text": "2015. Cognitive Accessibility User Research. https://www.w3.org/TR/coga-user-research/#research-on-cognitive-function/",
      "doi": ""
    },
    {
      "text": "2019. 41st Annual Report to Congress on the Implementation of the Individuals with Disabilities Education Act.",
      "doi": ""
    },
    {
      "text": "2020. Autism Data Visualization Tool. https://www.cdc.gov/ncbddd/autism/data/index.html",
      "doi": ""
    },
    {
      "text": "2020. What is Autism Spectrum Disorder?https://www.cdc.gov/ncbddd/autism/facts.html",
      "doi": ""
    },
    {
      "text": "Danielle Albers, Michael Correll, and Michael Gleicher. 2014. Task-Driven Evaluation of Aggregation in Time Series Visualization. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 551–560. https://doi.org/10.1145/2556288.2557200",
      "doi": "10.1145/2556288.2557200"
    },
    {
      "text": "Erik W Anderson. 2012. Evaluating visualization using cognitive measures. In Proceedings of the 2012 BELIV Workshop: Beyond Time and Errors-Novel Evaluation Methods for Visualization. 1–4.",
      "doi": "10.1145/2442576.2442581"
    },
    {
      "text": "Adriana Arcia. 2019. Colors and Imagery in Tailored Infographics for Communicating Health Information to Patients and Research Participants. (2019).",
      "doi": ""
    },
    {
      "text": "Scott Bateman, Regan L Mandryk, Carl Gutwin, Aaron Genest, David McDine, and Christopher Brooks. 2010. Useful junk? The effects of visual embellishment on comprehension and memorability of charts. In Proceedings of the SIGCHI conference on human factors in computing systems. 2573–2582.",
      "doi": "10.1145/1753326.1753716"
    },
    {
      "text": "Jennifer Birch. 2012. Worldwide prevalence of red-green color deficiency. Journal of the Optical Society of America. A, Optics, image science, and vision 29 (03 2012), 313–20. https://doi.org/10.1364/JOSAA.29.000313",
      "doi": ""
    },
    {
      "text": "M. A. Borkin, Z. Bylinskii, N. W. Kim, C. M. Bainbridge, C. S. Yeh, D. Borkin, H. Pfister, and A. Oliva. 2016. Beyond Memorability: Visualization Recognition and Recall. IEEE Transactions on Visualization and Computer Graphics 22, 1(2016), 519–528.",
      "doi": "10.1109/TVCG.2015.2467732"
    },
    {
      "text": "Katy Borner, Andreas Bueckle, and Michael Ginda. 2019. Data visualization literacy: Definitions, conceptual frameworks, exercises, and assessments. Proceedings of the National Academy of Sciences 116 (02 2019), 201807180. https://doi.org/10.1073/pnas.1807180116",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301–2309. https://doi.org/10.1109/TVCG.2011.185",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Coleen Boyle, Sheree Boulet, Laura Schieve, Robin Cohen, Stephen Blumberg, Marshalyn Yeargin-Allsopp, Susanna Visser, and Michael Kogan. 2011. Trends in the Prevalence of Developmental Disabilities in US Children, 1997-2008. Pediatrics 127 (06 2011), 1034–42. https://doi.org/10.1542/peds.2010-2989",
      "doi": ""
    },
    {
      "text": "David Braddock, Richard Hemp, Amie Lulinski, and Emily Tanis. 2017. The State of the States in Intellectual and Developmental Disabilities: 2017.",
      "doi": ""
    },
    {
      "text": "Alex Chaparro and Maria Chaparro. 2016. Applications of Color in Design for Color-Deficient Users. Ergonomics in Design: The Quarterly of Human Factors Applications 25 (11 2016). https://doi.org/10.1177/1064804616635382",
      "doi": ""
    },
    {
      "text": "Chaomei Chen and Yue Yu. 2000. Empirical studies of information visualization: a meta-analysis. Int. J. Hum. Comput. Stud. 53 (2000), 851–866.",
      "doi": "10.1006/ijhc.2000.0422"
    },
    {
      "text": "Jinho Choi, Sanghun Jung, Deok Gun Park, Jaegul Choo, and Niklas Elmqvist. 2019. Visualizing for the Non-Visual: Enabling the Visually Impaired to Use Visualization. Computer Graphics Forum(2019). https://doi.org/10.1111/cgf.13686",
      "doi": ""
    },
    {
      "text": "William S. Cleveland and Robert McGill. 1984. Graphical Perception: Theory, Experimentation, and Application to the Development of Graphical Methods. J. Amer. Statist. Assoc. 79, 387 (1984), 531–554. https://doi.org/10.1080/01621459.1984.10478080",
      "doi": "10.2307/2288400"
    },
    {
      "text": "Michael Cooper, Alastair Campbell, and Andrew Kirkpatrick. 2020. Web Content Accessibility Guidelines (WCAG) 2.2. W3C Working Draft. W3C. https://www.w3.org/TR/2020/WD-WCAG22-20200227/.",
      "doi": ""
    },
    {
      "text": "Franco Delogu, Massimiliano Palmiero, Stefano Federici, Catherine Plaisant, Haixia Zhao, and Olivetti Belardinelli. 2010. Non-visual exploration of geographic maps: does sonification help?Disability and Rehabilitation: Assistive Technology 5, 3 (2010), 164–174.",
      "doi": ""
    },
    {
      "text": "Yu-Min Fang, Chun Lin, and Bo-Cheng Chu. 2019. Older Adults’ Usability and Emotional Reactions toward Text, Diagram, Image, and Animation Interfaces for Displaying Health Information. Applied Sciences 9 (03 2019), 1058. https://doi.org/10.3390/app9061058",
      "doi": ""
    },
    {
      "text": "Rhonda Faragher and Barbara Clarke. 2014. Educating learners with down syndrome: research, theory, and practice with children and adolescents. Routledge.",
      "doi": ""
    },
    {
      "text": "E Gullone, RA Cummins, and NJ King. 1996. Self-reported fears: a comparison study of youths with and without an intellectual disability. Journal of Intellectual Disability Research 40, 3 (1996), 227–240.",
      "doi": ""
    },
    {
      "text": "Steve Haroz, Robert Kosara, and Steven L. Franconeri. 2015. ISOTYPE Visualization: Working Memory, Performance, and Engagement with Pictographs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1191–1200. https://doi.org/10.1145/2702123.2702275",
      "doi": "10.1145/2702123.2702275"
    },
    {
      "text": "Lane Harrison, Fumeng Yang, Steven Franconeri, and Remco Chang. 2014. Ranking visualizations of correlation using weber’s law. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 1943–1952.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer, Michael Bostock, and Vadim Ogievetsky. 2010. A Tour through the Visualization Zoo.ACM Queue 8 (01 2010), 20. https://doi.org/10.1145/1794514.1805128",
      "doi": ""
    },
    {
      "text": "Elizabeth Hensel, J Rose, B Stenfert Kroese, and J Banks-Smith. 2002. Subjective judgements of quality of life: a comparison study between people with intellectual disability and those without disability. Journal of Intellectual Disability Research 46, 2 (2002), 95–107.",
      "doi": ""
    },
    {
      "text": "Leona Holloway, Kim Marriott, and Matthew Butler. 2018. Accessible maps for the blind: Comparing 3D printed models with tactile graphics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173772"
    },
    {
      "text": "J. Hullman, E. Adar, and P. Shah. 2011. Benefitting InfoVis with Visual Difficulties. IEEE Transactions on Visualization and Computer Graphics 17, 12(2011), 2213–2222.",
      "doi": "10.1109/TVCG.2011.175"
    },
    {
      "text": "Ohad Inbar, Noam Tractinsky, and Joachim Meyer. 2007. Minimalism in information visualization: attitudes towards maximizing the data-ink ratio. In ECCE ’07.",
      "doi": ""
    },
    {
      "text": "Robert Kosara. 2019. The Impact of Distribution and Chart Type on Part-to-Whole Comparisons. In 21st Eurographics Conference on Visualization, EuroVis 2019-Short Papers.",
      "doi": ""
    },
    {
      "text": "Jan Kuhl, Daniel Sinner, and Marco Ennemoser. 2012. Training Quantity–Number Competencies in Students With Intellectual Disabilities. Journal of Cognitive Education and Psychology 11, 2(2012), 128–142.",
      "doi": ""
    },
    {
      "text": "Henry Kwok and Patrick WH Cheung. 2007. Co-morbidity of psychiatric disorder and medical illness in people with intellectual disabilities. Current Opinion in Psychiatry 20, 5 (2007), 443–449.",
      "doi": ""
    },
    {
      "text": "H. Lam, E. Bertini, P. Isenberg, C. Plaisant, and S. Carpendale. 2012. Empirical Studies in Information Visualization: Seven Scenarios. IEEE Transactions on Visualization and Computer Graphics 18, 9(2012), 1520–1536.",
      "doi": "10.1109/TVCG.2011.279"
    },
    {
      "text": "Sukwon Lee, Sung-Hee Kim, and Bum Chul Kwon. 2017. VLAT: Development of a Visualization Literacy Assessment Test. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 551–560. https://doi.org/10.1109/TVCG.2016.2598920",
      "doi": "10.1109/TVCG.2016.2598920"
    },
    {
      "text": "Alan Lundgard, Crystal Lee, and Arvind Satyanarayan. 2019. Sociotechnical Considerations for Accessible Visualization Design. arxiv:1909.05118 [cs.CY]",
      "doi": ""
    },
    {
      "text": "Matthew Maenner, Kelly Shaw, Jon Baio, Anita Washington, Mary Patrick, Monica DiRienzo, Deborah Christensen, Lisa Wiggins, Sydney Pettygrove, Jennifer Andrews, Maya Lopez, Allison Hudson, Thaer Baroud, Yvette Schwenk, Tiffany White, Cordelia Rosenberg, Li-Ching Lee, R. Harrington, Margaret Huston, and Patricia Dietz. 2020. Prevalence of Autism Spectrum Disorder Among Children Aged 8 Years — Autism and Developmental Disabilities Monitoring Network, 11 Sites, United States, 2016. MMWR. Surveillance Summaries 69 (03 2020), 1–12. https://doi.org/10.15585/mmwr.ss6904a1",
      "doi": ""
    },
    {
      "text": "Marjorie Montague. 1997. Cognitive Strategy Instruction in Mathematics for Students with Learning Disabilities. Journal of Learning Disabilities 30, 2 (1997), 164–177. https://doi.org/10.1177/002221949703000204 PMID: 9066277.",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2014. Visualization analysis and design. CRC press.",
      "doi": ""
    },
    {
      "text": "Jamie R. Nuñez, Christopher R. Anderton, and Ryan S. Renslow. 2018. Optimizing colormaps with consideration for color vision deficiency to enable accurate interpretation of scientific data. PLoS ONE 13(2018).",
      "doi": ""
    },
    {
      "text": "Sushil K Oswal. 2019. Breaking the exclusionary boundary between user experience and access: steps toward making UX inclusive of users with disabilities. In Proceedings of the 37th ACM International Conference on the Design of Communication. 1–8.",
      "doi": "10.1145/3328020.3353957"
    },
    {
      "text": "Evan M Peck, Sofia E Ayuso, and Omar El-Etr. 2019. Data is personal: Attitudes and perceptions of data visualization in rural pennsylvania. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Minna Reuhkala. 2001. Mathematical skills in ninth-graders: Relationship with visuo-spatial abilities and working memory. Educational Psychology 21, 4 (2001), 387–399.",
      "doi": ""
    },
    {
      "text": "Bahador Saket, Alex Endert, and Çağatay Demiralp. 2018. Task-based effectiveness of basic visualizations. IEEE Transactions on Visualization and Computer Graphics 25, 7(2018), 2505–2512.",
      "doi": ""
    },
    {
      "text": "David Simkin and Reid Hastie. 1987. An information-processing analysis of graph perception. J. Amer. Statist. Assoc. 82, 398 (1987), 454–465.",
      "doi": ""
    },
    {
      "text": "Joschua Simon-Liedtke, David R Flatla, and Eskild Narum Bakken. 2017. Checklist for Daltonization methods: Requirements and characteristics of a good recolouring method. Electronic Imaging 2017, 18 (2017), 21–27.",
      "doi": ""
    },
    {
      "text": "Drew Skau and Robert Kosara. 2016. Arcs, angles, or areas: Individual data encodings in pie and donut charts. In Computer Graphics Forum, Vol. 35. Wiley Online Library, 121–130.",
      "doi": ""
    },
    {
      "text": "Edward R. Tufte. 1986. The Visual Display of Quantitative Information. Graphics Press, USA.",
      "doi": "10.5555/33404"
    },
    {
      "text": "Delinda Van Garderen. 2006. Spatial Visualization, Visual Imagery, and Mathematical Problem Solving of Students With Varying Abilities. Journal of Learning Disabilities 39 (12 2006), 496–506. https://doi.org/10.1177/00222194060390060201",
      "doi": ""
    },
    {
      "text": "Vanessa Vega, Katherine Exss, Izaskun Álvarez Aguado, Marcela Azagra, and Herbert Spencer. 2020. Including intellectual disability in participatory design processes: Methodological adaptations and supports. https://doi.org/10.1145/3385010.3385023",
      "doi": ""
    },
    {
      "text": "W3C Web Accessibility Initiative (WAI). 2020. Tools and Techniques. https://www.w3.org/WAI/people-use-web/tools-techniques/#tools",
      "doi": ""
    },
    {
      "text": "Colin Ware. 2019. Information visualization: perception for design. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2020. American Association on Intellectual and Developmental Disabilities — Wikipedia, The Free Encyclopedia. http://en.wikipedia.org/w/index.php?title=American%20Association%20on%20Intellectual%20and%20Developmental%20Disabilities&oldid=970390704. [Online; accessed 14-September-2020].",
      "doi": ""
    },
    {
      "text": "Disabled World. 2020. What Is: Neurodiversity, Neurodivergent, Neurotypical. https://www.disabled-world.com/disability/awareness/neurodiversity/",
      "doi": ""
    },
    {
      "text": "Keke Wu, Shea Tanis, and Danielle Albers Szafir. 2019. Designing Communicative Visualization for People with Intellectual Developmental Disabilities. (08 2019). https://doi.org/10.31219/osf.io/zbjhr",
      "doi": ""
    },
    {
      "text": "Yalong Yang, Kim Marriott, Matthew Butler, Cagatay Goncu, and Leona Holloway. [n.d.]. Tactile presentation of network data: Text, matrix or diagram?ACM Conference on Human Factors in Computing Systems ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Jeffrey M. Zacks and Barbara Tversky. 1999. Bars and lines: A study of graphic communication. Memory & Cognition 27(1999), 1073–1079.",
      "doi": ""
    },
    {
      "text": "Dake Zhang, Yi Ding, Joanna Stegall, and Lei Mo. 2012. The effect of visual-chunking-representation accommodation on geometry testing for students with math disabilities. Learning Disabilities Research & Practice 27, 4 (2012), 167–177.",
      "doi": ""
    }
  ]
}