{
  "doi": "10.1145/3411764.3445415",
  "title": "How Should AI Systems Talk to Users when Collecting their Personal Information? Effects of Role Framing and Self-Referencing on Human-AI Interaction",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "AI systems collect our personal information in order to provide personalized services, raising privacy concerns and making users leery. As a result, systems have begun emphasizing overt over covert collection of information by directly asking users. This poses an important question for ethical interaction design, which is dedicated to improving user experience while promoting informed decision-making: Should the interface tout the benefits of information disclosure and frame itself as a help-provider? Or, should it appear as a help-seeker? We decided to find out by creating a mockup of a news recommendation system called Mindz and conducting an online user study (N=293) with the following four variations: AI system as help seeker vs. help provider vs. both vs. neither. Data showed that even though all participants received the same recommendations, power users tended to trust a help-seeking Mindz more whereas non-power users favored one that is both help-seeker and help-provider.",
  "authors": [
    {
      "name": "Mengqi Liao",
      "institution": "Media Effects Research Laboratory The Pennsylvania State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701950",
      "orcid": "0000-0001-7287-7731"
    },
    {
      "name": "S. Shyam Sundar",
      "institution": "Media Effects Research Laboratory The Pennsylvania State University, United States",
      "img": "/do/10.1145/contrib-81456626968/rel-imgonly/shyam.jpeg",
      "acmid": "81456626968",
      "orcid": "0000-0002-5779-8864"
    }
  ],
  "references": [
    {
      "text": "Russell Ames and Sing Lau. 1982. An attributional analysis of student help-seeking in academic settings. Journal of Educational Psychology 74, 3 (1982), 414–423. DOI:https://doi.org/10.1037/0022-0663.74.3.414",
      "doi": ""
    },
    {
      "text": "Naveen Farag Awad and M. S. Krishnan. 2006. The personalization privacy paradox: an empirical evaluation of information transparency and the willingness to be profiled online for personalization. MIS Quarterly 30, 1 (2006), 13–28. DOI:https://doi.org/10.2307/25148715",
      "doi": "10.5555/2017284.2017287"
    },
    {
      "text": "Veena Chattaraman, Wi-Suk Kwon, Juan E. Gilbert, and Kassandra Ross. 2019. Should AI-based, conversational digital assistants employ social- or task-oriented interaction style? A task-competency and reciprocity perspective for older adults. Computers in Human Behavior 90, (2019), 315–330. DOI:https://doi.org/10.1016/j.chb.2018.08.048",
      "doi": ""
    },
    {
      "text": "Erin K. Chiou, John D. Lee, and Tianshuo Su. 2019. Negotiated and reciprocal exchange structures in human-agent cooperation. Computers in Human Behavior 90, (January 2019), 288–297. DOI:https://doi.org/10.1016/j.chb.2018.08.012",
      "doi": ""
    },
    {
      "text": "Jaewon Choi, Hong Joo Lee, and Yong Cheol Kim. 2011. The influence of social presence on customer intention to reuse online recommender systems: The roles of personalization and product type. International Journal of Electronic Commerce 16, 1 (October 2011), 129–154. DOI:https://doi.org/10.2753/JEC1086-4415160105",
      "doi": "10.2753/JEC1086-4415160105"
    },
    {
      "text": "Mary J. Culnan and Pamela K. Armstrong. 1999. Information privacy concerns, procedural fairness, and impersonal trust: An empirical investigation. Organization Science 10, 1 (February 1999), 104–115. DOI:https://doi.org/10.1287/orsc.10.1.104",
      "doi": "10.1287/orsc.10.1.104"
    },
    {
      "text": "Bella M. DePaulo and Jeffrey D. Fisher. 1980. The costs of asking for help. Basic and Applied Social Psychology 1, 1 (March 1980), 23–35. DOI:https://doi.org/10.1207/s15324834basp0101_3",
      "doi": ""
    },
    {
      "text": "Peter R. Druian and Bella M. DePaulo. 1977. Asking a child for help. Social Behavior and Personality: An International Journal 5, 1 (1977), 33–39. DOI:https://doi.org/10.2224/sbp.1977.5.1.33",
      "doi": ""
    },
    {
      "text": "Håkan Gulliksson. 2012. Human - information - thing interaction: technology and design. Retrieved October 29, 2019 from http://urn.kb.se/resolve?urn=urn:nbn:se:umu:diva-62946",
      "doi": ""
    },
    {
      "text": "Andrew F. Hayes. 2017. Introduction to mediation, moderation, and conditional process analysis: A regression-based approach. (2nd. ed.).Guilford Publications, New York, NY.",
      "doi": ""
    },
    {
      "text": "Carolin Ischen, Theo Araujo, Hilde Voorveld, Guda van Noort, and Edith Smit. 2020. Privacy concerns in chatbot interactions. In Chatbot Research and Design (Lecture Notes in Computer Science), Springer International Publishing, Cham, 34–48. DOI:https://doi.org/10.1007/978-3-030-39540-7_3",
      "doi": ""
    },
    {
      "text": "Stuart A. Karabenick and John R. Knapp. 1988. Help seeking and the need for academic assistance. Journal of Educational Psychology 80, 3 (1988), 406–408. DOI:https://doi.org/10.1037/0022-0663.80.3.406",
      "doi": ""
    },
    {
      "text": "Kapil Kaushik, Nikunj Kumar Jain, and Alok Kumar Singh. 2018. Antecedents and outcomes of information privacy concerns: Role of subjective norm and social presence. Electronic Commerce Research and Applications 32, (November 2018), 57–68. DOI:https://doi.org/10.1016/j.elerap.2018.11.003",
      "doi": ""
    },
    {
      "text": "Flavius Kehr, Tobias Kowatsch, Daniel Wentzel, and Elgar Fleisch. 2015. Blissfully ignorant: the effects of general privacy concerns, general institutional trust, and affect in the privacy calculus. Information Systems Journal 25, 6 (2015), 607–635. DOI:https://doi.org/10.1111/isj.12062",
      "doi": "10.1111/isj.12062"
    },
    {
      "text": "Ki Joon Kim, Eunil Park, and S. Shyam Sundar. 2013. Caregiving role in human–robot interaction: A study of the mediating effects of perceived benefit and social presence. Computers in Human Behavior 29, 4 (July 2013), 1799–1806. DOI:https://doi.org/10.1016/j.chb.2013.02.009",
      "doi": ""
    },
    {
      "text": "Bart P. Knijnenburg, Martijn C. Willemsen, Zeno Gantner, Hakan Soncu, and Chris Newell. 2012. Explaining the user experience of recommender systems. User Model User-Adap Inter 22, 4 (October 2012), 441–504. DOI:https://doi.org/10.1007/s11257-011-9118-4",
      "doi": "10.1007/s11257-011-9118-4"
    },
    {
      "text": "Robert S. Laufer and Maxine Wolfe. 1977. Privacy as a concept and a social issue: A multidimensional developmental theory. Journal of Social Issues 33, 3 (1977), 22–42. DOI:https://doi.org/10.1111/j.1540-4560.1977.tb01880.x",
      "doi": ""
    },
    {
      "text": "Fiona Lee. 2002. The social costs of seeking help. The Journal of Applied Behavioral Science 38, 1 (March 2002), 17–35. DOI:https://doi.org/10.1177/0021886302381002",
      "doi": ""
    },
    {
      "text": "Kwan Min Lee, Wei Peng, Seung-A. Jin, and Chang Yan. 2006. Can robots manifest personality?: An empirical test of personality recognition, social responses, and social presence in Human–Robot Interaction. Journal of Communication 56, 4 (2006), 754–772. DOI:https://doi.org/10.1111/j.1460-2466.2006.00318.x",
      "doi": ""
    },
    {
      "text": "Kimberly Ling, Gerard Beenen, Pamela Ludford, Xiaoqing Wang, Klarissa Chang, Xin Li, Dan Cosley, Dan Frankowski, Loren Terveen, Al Mamunur Rashid, Paul Resnick, and Robert Kraut. 2005. Using social psychology to motivate contributions to online communities. Journal of Computer-Mediated Communication 10, 4 (2005), 00–00. DOI:https://doi.org/10.1111/j.1083-6101.2005.tb00273.x",
      "doi": ""
    },
    {
      "text": "Maria Madsen and Shirley Gregor. 2000. Measuring human-computer trust. In Proceedings of the 11th Australasian Conference on Information Systems, (Sydney, AU), Springer-Verlag, 6–8.",
      "doi": ""
    },
    {
      "text": "Naresh Malhotra, Sung Kim, and James Agarwal. 2004. Internet Users’ Information Privacy Concerns (IUIPC): The construct, the scale, and a causal model. Information Systems Research 15, (December 2004), 336–355. DOI:https://doi.org/10.1287/isre.1040.0032",
      "doi": "10.1287/isre.1040.0032"
    },
    {
      "text": "Sampada Sameer Marathe, S. Shyam Sundar, Marije Nije Bijvank, Henriette van Vugt, and Jolanda Veldhuis (2007). Who are these power users anyway? Building a psychological profile. Paper presented at the 57th annual conference of the International Communication Association, San Francisco, CA.",
      "doi": ""
    },
    {
      "text": "Roger C. Mayer, James H. Davis, and F. David Schoorman. 1995. An Iintegrative model of organizational trust. The Academy of Management Review 20, 3 (1995), 709–734. DOI:https://doi.org/10.2307/258792",
      "doi": ""
    },
    {
      "text": "Ann Scheck McAlearney, Sharon B. Schweikhart, and Mitchell A. Medow. 2004. Doctors’ experience with handheld computers in clinical practice: qualitative study. BMJ 328, 7449 (May 2004), 1162. DOI:https://doi.org/10.1136/bmj.328.7449.1162",
      "doi": ""
    },
    {
      "text": "Linda D. Molm, Nobuyuki Takahashi, and Gretchen Peterson. 2000. Risk and trust in social exchange: An experimental test of a classical proposition. American Journal of Sociology 105, 5 (March 2000), 1396–1427. DOI:https://doi.org/10.1086/210434",
      "doi": ""
    },
    {
      "text": "Yunhe Pan. 2016. Heading toward Artificial Intelligence 2.0. Engineering 2, 4 (December 2016), 409–413. DOI:https://doi.org/10.1016/J.ENG.2016.04.018",
      "doi": ""
    },
    {
      "text": "David Premack and Guy Woodruff. 1978. Does the chimpanzee have a theory of mind? Behavioral and Brain Sciences 1, 4 (December 1978), 515–526. DOI:https://doi.org/10.1017/S0140525X00076512",
      "doi": ""
    },
    {
      "text": "Byron Reeves and Clifford Ivar Nass. 1996. The media equation: How people treat computers, television, and new media like real people and places. Cambridge University Press, New York, NY, US.",
      "doi": "10.5555/236605"
    },
    {
      "text": "Sarah Strohkorb Sebo, Margaret Traeger, Malte Jung, and Brian Scassellati. 2018. The ripple effects of vulnerability: The effects of a robot's vulnerable behavior on trust in Human-Robot teams. In Proceedings of the 2018 ACM/IEEE International Conference on Human-Robot Interaction (HRI ’18), Association for Computing Machinery, Chicago, IL, USA, 178–186. DOI:https://doi.org/10.1145/3171221.3171275",
      "doi": "10.1145/3171221.3171275"
    },
    {
      "text": "Rosanne M. Siino, Justin Chung, and Pamela J. Hinds. 2008. Colleague vs. tool: Effects of disclosure in Human-Robot collaboration. In RO-MAN 2008 - The 17th IEEE International Symposium on Robot and Human Interactive Communication, 558–562. DOI:https://doi.org/10.1109/ROMAN.2008.4600725",
      "doi": ""
    },
    {
      "text": "S. Shyam Sundar. 2020. Rise of Machine Agency: A Framework for studying the psychology of Human–AI Interaction (HAII). Journal of Computer-Mediated Communication 25, 1 (March 2020), 74–88. DOI:https://doi.org/10.1093/jcmc/zmz026",
      "doi": ""
    },
    {
      "text": "S. Shyam Sundar and Jinyoung Kim. 2019. Machine Heuristic: when we trust computers more than humans with our personal information. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1–9. https://doi.org/10.1145/3290605.3300768",
      "doi": "10.1145/3290605.3300768"
    },
    {
      "text": "S. Shyam Sundar and Sampada S. Marathe. 2010. Personalization versus Customization: The importance of agency, privacy, and power usage. Human Communication Research 36, 3 (2010), 298–322. DOI:https://doi.org/10.1111/j.1468-2958.2010.01377.x",
      "doi": ""
    },
    {
      "text": "Bill Underwood and Bert Moore. 1982. Perspective-taking and altruism. Psychological Bulletin 91, 1 (1982), 143–173. DOI:https://doi.org/10.1037/0033-2909.91.1.143",
      "doi": ""
    },
    {
      "text": "Gerben A. Van Kleef, Carsten K. W. De Dreu, and Antony S. R. Manstead. 2010. Chapter 2 - An Interpersonal approach to emotion in social decision making: The emotions as social information model. In Advances in Experimental Social Psychology. Academic Press, 45–96. DOI:https://doi.org/10.1016/S0065-2601(10)42002-X",
      "doi": ""
    },
    {
      "text": "Susan M. Weinschenk. 2009. Neuro web design: What makes them click? (1st ed.). New Riders Publishing, USA.",
      "doi": ""
    },
    {
      "text": "Valarie Zeithaml, A Parsu Parasuraman, and Arvind Malhotra. 2000. A conceptual framework for understanding e-service quality: Implications for future research and managerial practice. Marketing Science Institute Working Paper Report No (January 2000).",
      "doi": ""
    },
    {
      "text": "Bo Zhang and S. Shyam Sundar. 2019. Proactive vs. reactive personalization: Can customization of privacy enhance user experience? International Journal of Human-Computer Studies 128, (August 2019), 86–99. DOI:https://doi.org/10.1016/j.ijhcs.2019.03.002",
      "doi": "10.1016/j.ijhcs.2019.03.002"
    },
    {
      "text": "Jakub Złotowski, Kumar Yogeeswaran, and Christoph Bartneck. 2017. Can we control it? Autonomous robots threaten human identity, uniqueness, safety, and resources. International Journal of Human-Computer Studies 100, (2017), 48–54. DOI:https://doi.org/10.1016/j.ijhcs.2016.12.008",
      "doi": ""
    }
  ]
}