{
  "doi": "10.1145/3411764.3445150",
  "title": "Exploring A Reporting Tool to Empower Individuals with Intellectual and Developmental Disabilities to Self-Report Abuse",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "In the US, abuse of individuals with intellectual and developmental disabilities (I/DD) is at epidemic proportions. Further, abuse incidents of individuals with I/DD are woefully under-reported. We surveyed practitioners who help individuals with I/DD post-abuse to get a broader context on the problem. We found that abuse of individuals with I/DD was often reported by someone other than the survivor, as survivors faced impediments in reporting. Consequently, we argue for developing a mobile-computing-based reporting tool for empowering individuals with I/DD to self-report abuse. Next, we conducted focus groups of individuals with I/DD to evaluate the tool’s viability, with respect to their ability to recognize/report abuse and use mobile-computing devices. We found individuals with I/DD could recognize/report abuse well when they received appropriate training. We also found individuals with I/DD could independently use their devices, though they shared access to them with family. Based on these findings, we call for several lines of accessibility research in designing an abuse self-reporting tool for individuals with I/DD.",
  "tags": [
    "Abuse",
    "Abuse reporting",
    "Mobile computing",
    "Security",
    "Safety",
    "Intellectual disability",
    "Developmental disability"
  ],
  "authors": [
    {
      "name": "Krishna Venkatasubramanian",
      "institution": "Computer Science and Statistics University of Rhode Island, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659899178",
      "orcid": "0000-0001-7593-2513"
    },
    {
      "name": "Jeanine L. M. Skorinko",
      "institution": "Social Science & Policy Studies Worcester Polytechnic Insitute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490689472",
      "orcid": "missing"
    },
    {
      "name": "Mariam Kobeissi",
      "institution": "Department of Psychology American University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701738",
      "orcid": "missing"
    },
    {
      "name": "Brittany Lewis",
      "institution": "Computer Science University of Rhode Island, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702608",
      "orcid": "0000-0003-2584-5483"
    },
    {
      "name": "Nicole Jutras",
      "institution": "Department of Computer Science Worcester Polytechnic Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701974",
      "orcid": "missing"
    },
    {
      "name": "Pauline Bosma",
      "institution": "Massachusetts Advocates Standing Strong, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701438",
      "orcid": "missing"
    },
    {
      "name": "John Mullaly",
      "institution": "Massachusetts Advocates Standing Strong, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701729",
      "orcid": "missing"
    },
    {
      "name": "Brian Kelly",
      "institution": "Massachusetts Advocates Standing Strong, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700562",
      "orcid": "missing"
    },
    {
      "name": "Deborah Lloyd",
      "institution": "Massachusetts Advocates Standing Strong, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702419",
      "orcid": "missing"
    },
    {
      "name": "Mariah Freark",
      "institution": "Massachusetts Disabled Persons Protection Commission, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701139",
      "orcid": "missing"
    },
    {
      "name": "Nancy A. Alterio",
      "institution": "Massachusetts Disabled Persons Protection Commission, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701890",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "University of California, Irvine - School of Medicine 2020. 368+ Elder and Dependent Adult Abuse Guide for CA Law Enforcement. University of California, Irvine - School of Medicine. Retrieved Jan 19, 2020 from http://www.centeronelderabuse.org/368ElderAbuseCA.asp",
      "doi": ""
    },
    {
      "text": "AAIDD 2020. American Association of Intellectual and Developmental Disabilities. AAIDD. Retrieved Feb 27, 2020 from https://www.aaidd.org/intellectual-disability/definition",
      "doi": ""
    },
    {
      "text": "Florida Department of Children and Families 2020. Abuse Hotline - Florida Department of Children and Families. Florida Department of Children and Families. Retrieved Feb 15, 2020 from https://www.myflfamilies.com/service-programs/abuse-hotline/",
      "doi": ""
    },
    {
      "text": "Zahra Ashktorab and Jessica Vitak. 2016. Designing Cyberbullying Mitigation and Prevention Solutions through Participatory Design With Teenagers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI’16). Association for Computing Machinery, New York, NY, USA, 3895–3905. https://doi.org/10.1145/2858036.2858548",
      "doi": "10.1145/2858036.2858548"
    },
    {
      "text": "N.J. Baladerian. 1991. Sexual abuse of people with developmental disabilitiess. Sexuality and Disability 9 (1991), 323–335.",
      "doi": ""
    },
    {
      "text": "Rosanna Bellini, Angelika Strohmayer, Ebtisam Alabdulqader, Alex A. Ahmed, Katta Spiel, Shaowen Bardzell, and Madeline Balaam. 2018. Feminist HCI: Taking Stock, Moving Forward, and Engaging Community. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–4. https://doi.org/10.1145/3170427.3185370",
      "doi": "10.1145/3170427.3185370"
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018. Interdependence as a Frame for Assistive Technology Research and Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility(Galway, Ireland) (ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 161–173. https://doi.org/10.1145/3234695.3236348",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Filip Bircanin, Bernd Ploderer, Laurianne Sitbon, Andrew A. Bayor, and Margot Brereton. 2019. Challenges and Opportunities in Using Augmentative and Alternative Communication (AAC) Technologies: Design Considerations for Adults with Severe Disabilities. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction (Fremantle, WA, Australia) (OZCHI ’19). Association for Computing Machinery, New York, NY, USA, 184–196. https://doi.org/10.1145/3369457.3369473",
      "doi": "10.1145/3369457.3369473"
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and Its Consequences for Online Harassment: Design Insights from HeartMob. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 24 (Dec. 2017), 19 pages. https://doi.org/10.1145/3134659",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Stacy M. Branham, Ali Abdolrahmani, William Easley, Morgan Scheuerman, Erick Ronquillo, and Amy Hurst. 2017. “Is Someone There? Do They Have a Gun” : How Visual Information about Others Can Improve Personal Safety Management for Blind Individuals. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(Baltimore, Maryland, USA) (ASSETS’17). Association for Computing Machinery, New York, NY, USA, 260–269. https://doi.org/10.1145/3132525.3132534",
      "doi": "10.1145/3132525.3132534"
    },
    {
      "text": "bsafe 2020. bSafe. bsafe. Retrieved Feb 27, 2020 from https://getbsafe.com/",
      "doi": ""
    },
    {
      "text": "Erin Buehler, William Easley, Amy Poole, and Amy Hurst. 2016. Accessibility Barriers to Online Education for Young Adults with Intellectual Disabilities. In Proceedings of the 13th Web for All Conference(Montreal, Canada) (W4A ’16). Association for Computing Machinery, New York, NY, USA, Article 27, 10 pages. https://doi.org/10.1145/2899475.2899481",
      "doi": "10.1145/2899475.2899481"
    },
    {
      "text": "Rosanna Yuen-Yan Chan, Xue Bai, Xi Chen, Shuang Jia, and Xiao-hong Xu. 2016. IBeacon and HCI in Special Education: Micro-Location Based Augmentative and Alternative Communication for Children with Intellectual Disabilities. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 1533–1539. https://doi.org/10.1145/2851581.2892375",
      "doi": "10.1145/2851581.2892375"
    },
    {
      "text": "R. Chatterjee, P. Doerfler, H. Orgad, S. Havron, J. Palmer, D. Freed, K. Levy, N. Dell, D. McCoy, and T. Ristenpart. 2018. The Spyware Used in Intimate Partner Violence. In 2018 IEEE Symposium on Security and Privacy (SP). IEEE, New York, NY, USA, 441–458. https://doi.org/10.1109/SP.2018.00061",
      "doi": ""
    },
    {
      "text": "Despoina Chatzakou, Nicolas Kourtellis, Jeremy Blackburn, Emiliano De Cristofaro, Gianluca Stringhini, and Athena Vakali. 2017. Measuring #GamerGate: A Tale of Hate, Sexism, and Bullying. In Proceedings of the 26th International Conference on World Wide Web Companion (Perth, Australia) (WWW’17 Companion). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 1285–1290. https://doi.org/10.1145/3041021.3053890",
      "doi": ""
    },
    {
      "text": "Ming Chung Chen, Long Sheng Li, and Chien Chuan Ko. 2013. Are AAC Apps Accessible for People with Complex Communication Disabilities?. In Proceedings of the 7th International Convention on Rehabilitation Engineering and Assistive Technology (Gyeonggi-do, South Korea) (i-CREATe ’13). Singapore Therapeutic, Assistive and Rehabilitative Technologies (START) Centre, Midview City, SGP, Article 5, 4 pages.",
      "doi": "10.5555/2567429.2567435"
    },
    {
      "text": "Circle of 6 2020. circle of 6. Circle of 6. Retrieved Feb 27, 2020 from https://www.circleof6app.com/",
      "doi": ""
    },
    {
      "text": "Vagner Figueredo de Santana, Rodrigo Laiola Guimarães, and Andrea Britto Mattos. 2016. Identifying Challenges and Opportunities in Computer-Based Vocational Training for Low-Income Communities of People with Intellectual Disabilities. In Proceedings of the 13th Web for All Conference (Montreal, Canada) (W4A ’16). Association for Computing Machinery, New York, NY, USA, Article 2, 8 pages. https://doi.org/10.1145/2899475.2899480",
      "doi": "10.1145/2899475.2899480"
    },
    {
      "text": "Jill P. Dimond, Michaelanne Dye, Daphne Larose, and Amy S. Bruckman. 2013. Hollaback! The Role of Storytelling Online in a Social Movement Organization. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 477–490. https://doi.org/10.1145/2441776.2441831",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Jill P. Dimond, Casey Fiesler, and Amy S. Bruckman. 2011. Domestic violence and information communication technologies. Interacting with Computers 23, 5 (2011), 413 – 421. https://doi.org/10.1016/j.intcom.2011.04.006 Feminism and HCI: New Perspectives.",
      "doi": "10.1016/j.intcom.2011.04.006"
    },
    {
      "text": "Diana Freed, Sam Havron, Emily Tseng, Andrea Gallardo, Rahul Chatterjee, Thomas Ristenpart, and Nicola Dell. 2019. ”Is My Phone Hacked?” Analyzing Clinical Computer Security Interventions with Survivors of Intimate Partner Violence. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 202 (Nov. 2019), 24 pages. https://doi.org/10.1145/3359304",
      "doi": "10.1145/3359304"
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. “A Stalker’s Paradise”: How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI’18). Association for Computing Machinery, New York, NY, USA, Article 667, 13 pages. https://doi.org/10.1145/3173574.3174241",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Elizabeth Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2017. Digital Technologies and Intimate Partner Violence: A Qualitative Analysis with Multiple Stakeholders. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 46 (Dec. 2017), 22 pages. https://doi.org/10.1145/3134681",
      "doi": "10.1145/3134681"
    },
    {
      "text": "Georgia Department of Aging Services 2020. Georgia Abuse, Abuse, Neglect, and Exploitation App. Georgia Department of Aging Services. Retrieved Jan 19, 2020 from http://aging.dhs.georgia.gov/sites/aging.georgia.gov/files/GANE%20App%20overview.pdf",
      "doi": ""
    },
    {
      "text": "Ryan Colin Gibson, Matt-Mouley Bouamrane, and Mark Dunlop. 2018. Mobile Support for Adults with Mild Learning Disabilities during Clinical Consultations. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 48, 8 pages. https://doi.org/10.1145/3229434.3229469",
      "doi": "10.1145/3229434.3229469"
    },
    {
      "text": "Ryan Colin Gibson, Matt-Mouley Bouamrane, and Mark Dunlop. 2019. Experts views on the use of mobile devices to support patients with mild learning disabilities during clinical consultations. Studies in Health Technology and Informatics 264 (August 2019), 1199–1203. 10.3233/SHTI190416",
      "doi": ""
    },
    {
      "text": "Ryan Colin Gibson, Mark D. Dunlop, Matt-Mouley Bouamrane, and Revathy Nayar. 2020. Designing Clinical AAC Tablet Applications with Adults Who Have Mild Intellectual Disabilities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376159",
      "doi": "10.1145/3313831.3376159"
    },
    {
      "text": "Susan Herring, Kirk Job-Sluder, Rebecca Scheckler, and Sasha Barab. 2002. Searching for Safety Online: Managing ”Trolling” in a Feminist Forum. The Information Society 18, 5 (2002), 371–384. https://doi.org/10.1080/01972240290108186",
      "doi": ""
    },
    {
      "text": "Andrea Hollomotz. 2018. Successful interviews with people with intellectual disability. Qualitative Research 18, 2 (2018), 153–170.",
      "doi": ""
    },
    {
      "text": "Karen Hughes, Mark A Bellis, Lisa Jones, Sara Wood, Geoff Bates, Lindsay Eckley, Ellie McCoy, Christopher Mikton, Tom Shakespeare, and Alana Officer. 2012. Prevalence and risk of violence against adults with disabilities: a systematic review and meta-analysis of observational studies. The Lancet 379, 9826 (2012), 1621 – 1629. https://doi.org/10.1016/S0140-6736(11)61851-5",
      "doi": ""
    },
    {
      "text": "Thomas Huijbregts and James R. Wallace. 2015. TalkingTiles: Supporting Personalization and Customization in an AAC App for Individuals with Aphasia. In Proceedings of the 2015 International Conference on Interactive Tabletops and Surfaces (Madeira, Portugal) (ITS ’15). Association for Computing Machinery, New York, NY, USA, 63–72. https://doi.org/10.1145/2817721.2817723",
      "doi": "10.1145/2817721.2817723"
    },
    {
      "text": "Apple Inc. 2020. Use Emergency SOS on your iPhone. Apple Inc. Retrieved March 17, 2020 from https://support.apple.com/en-us/HT208076",
      "doi": ""
    },
    {
      "text": "Mike Just, Hasmeet Chandok, Raghav Sampangi, Kirstie Hawkey, Alette Willis, JeyaBalaji Samuthiravelu, Dilpreet Gill, and Michael Altair. 2019. Personal Safety App Effectiveness. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, Article LBW2415, 6 pages. https://doi.org/10.1145/3290607.3312781",
      "doi": ""
    },
    {
      "text": "Tep Wireless 2020. kitestring. Tep Wireless. Retrieved Feb 27, 2020 from https://www.kitestring.io/",
      "doi": ""
    },
    {
      "text": "Sheena Lewis and Dan A. Lewis. 2012. Examining Technology That Supports Community Policing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI’12). Association for Computing Machinery, New York, NY, USA, 1371–1380. https://doi.org/10.1145/2207676.2208595",
      "doi": "10.1145/2207676.2208595"
    },
    {
      "text": "Life360 2020. life360. Life360. Retrieved Feb 27, 2020 from https://www.life360.com/",
      "doi": ""
    },
    {
      "text": "The 191st General Court of the Commonwealth of Massachusetts 2020. The 191st General Court of the Commonwealth of Massachusetts: General Laws Part I, Title II, Chapter 19C. The 191st General Court of the Commonwealth of Massachusetts. Retrieved Feb 27, 2020 from https://doi.org/10.1145/3025453.3025875",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Kathleen O’Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F. Churchill, and Sunny Consolvo. 2017. Stories from Survivors: Privacy & Security Practices When Coping with Intimate Partner Abuse. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI’17). Association for Computing Machinery, New York, NY, USA, 2189–2201. https://doi.org/10.1145/3025453.3025875",
      "doi": "10.1145/3025453.3025875"
    },
    {
      "text": "Orla Thèrése McCarthy, Brian Caulfield, and Margaret O’Mahony. 2016. How transport users perceive personal safety apps. Transportation Research Part F: Traffic Psychology and Behaviour 43 (2016), 166 – 182. https://doi.org/10.1016/j.trf.2016.10.005",
      "doi": ""
    },
    {
      "text": "John T Morris, Michael L Jones, and W Mark Sweatman. 2016. Wireless Technology Use by People with Disabilities: A National Survey. Technical Report. California State University, Northridge.",
      "doi": ""
    },
    {
      "text": "M.A. Nosek, C.C. Foley, R.B. Hughes, and C. A. Howland. 2001. Vulnerabilities for Abuse Among Women with Disabilities. Sexuality and Disability 19 (2001), 177–189.",
      "doi": ""
    },
    {
      "text": "NPR 2018. The Sexual Assault Epidemic No One Talks About. NPR. Retrieved Jan 19, 2020 from https://www.npr.org/2018/01/08/570224090/the-sexual-assault-epidemic-no-one-talks-about",
      "doi": ""
    },
    {
      "text": "Kathleen O’Leary, Arpita Bhattacharya, Sean A. Munson, Jacob O. Wobbrock, and Wanda Pratt. 2017. Design Opportunities for Mental Health Peer Support Technologies. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(Portland, Oregon, USA) (CSCW’17). Association for Computing Machinery, New York, NY, USA, 1470–1484. https://doi.org/10.1145/2998181.2998349",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "Bailey Poland. 2016. Haters: Harassment, Abuse, and Violence Online. Potomac Books Inc., Dulles, VA, USA.",
      "doi": ""
    },
    {
      "text": "RAINN 2020. Rape, Abuse & Incest National Network: State Law Generator. RAINN. Retrieved Feb 27, 2020 from https://apps.rainn.org/policy/",
      "doi": ""
    },
    {
      "text": "Safelet 2020. Safelet. Safelet. Retrieved Feb 27, 2020 from https://safelet.com/us/",
      "doi": ""
    },
    {
      "text": "Samsung 2020. Samsung SOS - Smart Phone Emergency Message guide. Samsung. Retrieved March 17, 2020 from https://www.samsung.com/nz/support/mobile-devices/samsung-sos-smart-phone-emergency-message-guide/",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Stacy M. Branham, and Foad Hamidi. 2018. Safe Spaces and Safe Places: Unpacking Technology-Mediated Experiences of Safety and Harm with Transgender People. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 155 (Nov. 2018), 27 pages. https://doi.org/10.1145/3274424",
      "doi": "10.1145/3274424"
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Donghoon Shin, Jaeyoon Song, Seokwoo Song, Jisoo Park, Joonhwan Lee, and Soojin Jun. 2020. TalkingBoogie: Collaborative Mobile AAC System for Non-Verbal Children with Developmental Disabilities and Their Caregivers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376154",
      "doi": "10.1145/3313831.3376154"
    },
    {
      "text": "Jeff Sigafoos, Mark F O’Reilly, Giulio E Lancioni, and Dean Sutherland. 2014. Augmentative and alternative communication for individuals with autism spectrum disorder and intellectual disability. Current Developmental Disorders Reports 1, 2 (2014), 51–57.",
      "doi": ""
    },
    {
      "text": "Vivek K. Singh, Marie L. Radford, Qianjia Huang, and Susan Furrer. 2017. “They Basically like Destroyed the School One Day”: On Newer App Features and Cyberbullying in Schools. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW’17). Association for Computing Machinery, New York, NY, USA, 1210–1216. https://doi.org/10.1145/2998181.2998279",
      "doi": "10.1145/2998181.2998279"
    },
    {
      "text": "SirenGPS 2020. SirenGPS. SirenGPS. Retrieved Feb 27, 2020 from https://www.sirengps.com/",
      "doi": ""
    },
    {
      "text": "Laurianne Sitbon, Andrew Bayor, Filip Bircanin, Stewart Koplick, and Margot Brereton. 2018. An Exploration of How People with Intellectual Disability Engage with Online Information Retrieval. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188599",
      "doi": "10.1145/3170427.3188599"
    },
    {
      "text": "Laurianne Sitbon, Maria Hoogstrate, Julie Yule, Stewart Koplick, Filip Bircanin, and Margot Brereton. 2018. A Non-Clinical Approach to Describing Participants with Intellectual Disability. In Proceedings of the 30th Australian Conference on Computer-Human Interaction (Melbourne, Australia) (OzCHI ’18). Association for Computing Machinery, New York, NY, USA, 128–132. https://doi.org/10.1145/3292147.3292206",
      "doi": "10.1145/3292147.3292206"
    },
    {
      "text": "Kiley Sobel, Alexander Fiannaca, Jon Campbell, Harish Kulkarni, Ann Paradiso, Ed Cutrell, and Meredith Ringel Morris. 2017. Exploring the Design Space of AAC Awareness Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 2890–2903. https://doi.org/10.1145/3025453.3025610",
      "doi": "10.1145/3025453.3025610"
    },
    {
      "text": "South Dakota Department of Human Services 2020. South Dakota, Adult Protective Services, Department of Social Services. South Dakota Department of Human Services. Retrieved Feb 15, 2020 from https://dhs.sd.gov/ltss/adultprotective.aspx",
      "doi": ""
    },
    {
      "text": "Texas Department of Family and Protective Services 2020. Texas Abuse Hotline Website. Texas Department of Family and Protective Services. https://www.txabusehotline.org/",
      "doi": ""
    },
    {
      "text": "Stephanie Valencia, Amy Pavel, Jared Santa Maria, Seunga (Gloria) Yu, Jeffrey P. Bigham, and Henny Admoni. 2020. Conversational Agency in Augmentative and Alternative Communication. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376376",
      "doi": "10.1145/3313831.3376376"
    },
    {
      "text": "D Valenti-Hein and L D Schwartz. 1995. Sexual Abuse Interview for those With Developmental Disabilities. National Criminal Justice Reference Service (NCJRS), Washington D.C.",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying Women’s Experiences With and Strategies for Mitigating Negative Effects of Online Harassment. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW’17). Association for Computing Machinery, New York, NY, USA, 1231–1245. https://doi.org/10.1145/2998181.2998337",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "WearSafe 2020. WearSafe: Feel Safe Again. WearSafe. Retrieved Feb 27, 2020 from https://wearsafe.com/",
      "doi": ""
    },
    {
      "text": "Wisconsin Department of Health Services 2020. Wisconsin Adults-at-Risk (Ages 18 to 59) Help Lines. Wisconsin Department of Health Services. Retrieved Feb 15, 2020 from https://www.dhs.wisconsin.gov/aps/aar-agencies.htm",
      "doi": ""
    },
    {
      "text": "Delanie Woodlock. 2017. The Abuse of Technology in Domestic Violence and Stalking. Violence Against Women 23, 5 (2017), 584–602. https://doi.org/10.1177/1077801216646277",
      "doi": ""
    },
    {
      "text": "Hui Zheng and Vivian Genaro Motti. 2018. Assisting Students with Intellectual and Developmental Disabilities in Inclusive Education with Smartwatches. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173924",
      "doi": "10.1145/3173574.3173924"
    }
  ]
}