{
  "doi": "10.1145/3411764.3445325",
  "title": "MetaMap: Supporting Visual Metaphor Ideation through Multi-dimensional Example-based Exploration",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Visual metaphors, which are widely used in graphic design, can deliver messages in creative ways by fusing different objects. The keys to creating visual metaphors are diverse exploration and creative combinations, which is challenging with conventional methods like image searching. To streamline this ideation process, we propose to use a mind-map-like structure to recommend and assist users to explore materials. We present MetaMap, a supporting tool which inspires visual metaphor ideation through multi-dimensional example-based exploration. To facilitate the divergence and convergence of the ideation process, MetaMap provides 1) sample images based on keyword association and color filtering; 2) example-based exploration in semantics, color, and shape dimensions; and 3) thinking path tracking and idea recording. We conduct a within-subject study with 24 design enthusiasts by taking a Pinterest-like interface as the baseline. Our evaluation results suggest that MetaMap provides an engaging ideation process and helps participants create diverse and creative ideas.",
  "authors": [
    {
      "name": "Youwen Kang",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701594",
      "orcid": "missing"
    },
    {
      "name": "Zhida Sun",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659090601",
      "orcid": "0000-0003-4689-986X"
    },
    {
      "name": "Sitong Wang",
      "institution": "Columbia University, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659547611",
      "orcid": "missing"
    },
    {
      "name": "Zeyu Huang",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700955",
      "orcid": "0000-0001-8199-071X"
    },
    {
      "name": "Ziming Wu",
      "institution": "Hong Kong University of Science and Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659161463",
      "orcid": "missing"
    },
    {
      "name": "Xiaojuan Ma",
      "institution": "Hong Kong University of Science and Technology, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484654594",
      "orcid": "0000-0002-9847-7784"
    }
  ],
  "references": [
    {
      "text": "Virgil C. Aldrich. 1968. Visual Metaphor. Journal of Aesthetic Education 2, 1 (1968), 73–86. http://www.jstor.org/stable/3331241",
      "doi": ""
    },
    {
      "text": "Suyun Sandra Bae, Oh-Hyun Kwon, Senthil Chandrasegaran, and Kwan-Liu Ma. 2020. Spinneret: Aiding Creative Ideation through Non-Obvious Concept Associations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376746",
      "doi": "10.1145/3313831.3376746"
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining what individual SUS scores mean: Adding an adjective rating scale. Journal of usability studies 4, 3 (2009), 114–123.",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Nathalie Bonnardel and Evelyne Marmèche. 2005. Towards supporting evocation processes in creative design: A cognitive approach. International Journal of Human-Computer Studies 63, 4 (2005), 422 – 435. https://doi.org/10.1016/j.ijhcs.2005.04.006 Computer support for creativity.",
      "doi": "10.1016/j.ijhcs.2005.04.006"
    },
    {
      "text": "John Brooke. 1996. SUS: a “quick and dirty” usability scale. CRC press, Florida, USA, 189.",
      "doi": ""
    },
    {
      "text": "David C Brown. 2008. Guiding computational design creativity research.",
      "doi": ""
    },
    {
      "text": "Noel Carroll. 1994. Visual Metaphor. Springer Netherlands, Dordrecht, 189–218. https://doi.org/10.1007/978-94-015-8315-2_6",
      "doi": ""
    },
    {
      "text": "Noël Carroll. 2001. Visual Metaphor. Cambridge University Press, Cambridge, UK, 347–368. https://doi.org/10.1017/CBO9780511605970.023",
      "doi": ""
    },
    {
      "text": "Andrew Cattle and Xiaojuan Ma. 2017. Predicting Word Association Strengths. In Proceedings of the 2017 Conference on Empirical Methods in Natural Language Processing. Association for Computational Linguistics, Copenhagen, Denmark, 1283–1288. https://doi.org/10.18653/v1/D17-1132",
      "doi": ""
    },
    {
      "text": "Joel Chan, Pao Siangliulue, Denisa Qori McDonald, Ruixue Liu, Reza Moradinezhad, Safa Aman, Erin T. Solovey, Krzysztof Z. Gajos, and Steven P. Dow. 2017. Semantically Far Inspirations Considered Harmful? Accounting for Cognitive States in Collaborative Ideation. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition (Singapore, Singapore) (C&C ’17). Association for Computing Machinery, New York, NY, USA, 93–105. https://doi.org/10.1145/3059454.3059455",
      "doi": "10.1145/3059454.3059455"
    },
    {
      "text": "Lydia B. Chilton, Savvas Petridis, and Maneesh Agrawala. 2019. VisiBlends: A Flexible Workflow for Visual Blends. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300402",
      "doi": "10.1145/3290605.3300402"
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1990. Flow: The Psychology of Optimal Experience. Vol. 1990. Harper & Row, New York, USA.",
      "doi": ""
    },
    {
      "text": "Marcel Danesi. 1990. Thinking is seeing: Visual metaphors and the nature of abstract thought. Semiotica 80, 3-4 (1990), 221–238. https://doi.org/10.1515/semi.1990.80.3-4.221",
      "doi": ""
    },
    {
      "text": "Simon De Deyne, Danielle J Navarro, Amy Perfors, Marc Brysbaert, and Gert Storms. 2019. The “Small World of Words” English word association norms for over 12,000 cue words. Behavior research methods 51, 3 (2019), 987–1006.",
      "doi": ""
    },
    {
      "text": "Claudia Eckert and Martin Stacey. 2000. Sources of Inspiration: A Language of Design. Design Studies 21 (09 2000). https://doi.org/10.1016/S0142-694X(00)00022-3",
      "doi": ""
    },
    {
      "text": "Hermine Feinstein. 1985. Art as Visual Metaphor. Art Education 38, 4 (1985), 26–29. http://www.jstor.org/stable/3192822",
      "doi": ""
    },
    {
      "text": "Jonas Frich, Lindsay MacDonald Vermeulen, Christian Remy, Michael Mose Biskjaer, and Peter Dalsgaard. 2019. Mapping the Landscape of Creativity Support Tools in HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–18. https://doi.org/10.1145/3290605.3300619",
      "doi": "10.1145/3290605.3300619"
    },
    {
      "text": "Milene Gonçalves, Carlos Cardoso, and Petra Badke-Schaub. 2014. What inspires designers? Preferences on inspirational approaches during idea generation. Design Studies 35, 1 (2014), 29 – 53. https://doi.org/10.1016/j.destud.2013.09.001",
      "doi": ""
    },
    {
      "text": "Nancy C Goodwin. 1987. Functionality and usability. Commun. ACM 30, 3 (1987), 229–233.",
      "doi": "10.1145/214748.214758"
    },
    {
      "text": "H. Gough. 1976. Studying creativity by means of word association test.The Journal of applied psychology 61 3 (1976), 348–53.",
      "doi": ""
    },
    {
      "text": "Tom Hewett, Mary Czerwinski, Michael Terry, Jay Nunamaker, Linda Candy, Bill Kules, and Elisabeth Sylvan. 2005. Creativity support tool evaluation methods and metrics. , 10–24 pages.",
      "doi": ""
    },
    {
      "text": "Forrest Huang, John F. Canny, and Jeffrey Nichols. 2019. Swire: Sketch-Based User Interface Retrieval. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3290605.3300334",
      "doi": "10.1145/3290605.3300334"
    },
    {
      "text": "Ali Jahanian, Shaiyan Keshvari, S. V. N. Vishwanathan, and Jan P. Allebach. 2017. Colors – Messengers of Concepts: Visual Design Mining for Learning Color Semantics. ACM Trans. Comput.-Hum. Interact. 24, 1, Article 2 (Jan. 2017), 39 pages. https://doi.org/10.1145/3009924",
      "doi": "10.1145/3009924"
    },
    {
      "text": "David G. Jansson and Steven M. Smith. 1991. Design fixation. Design Studies 12, 1 (1991), 3 – 11. https://doi.org/10.1016/0142-694X(91)90003-F",
      "doi": ""
    },
    {
      "text": "EunJin Kim and Hyeon-Jeong Suk. 2017. Thoughts and Tools for Crafting Colors: Implications from Designers’ Behavior. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 321–331. https://doi.org/10.1145/3064663.3064769",
      "doi": "10.1145/3064663.3064769"
    },
    {
      "text": "Janin Koch, Andrés Lucero, Lena Hegemann, and Antti Oulasvirta. 2019. May AI? Design Ideation with Cooperative Contextual Bandits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300863",
      "doi": "10.1145/3290605.3300863"
    },
    {
      "text": "Ranjitha Kumar, Jerry O. Talton, Salman Ahmad, and Scott R. Klemmer. 2011. Bricolage: Example-Based Retargeting for Web Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2197–2206. https://doi.org/10.1145/1978942.1979262",
      "doi": "10.1145/1978942.1979262"
    },
    {
      "text": "Mackenzie Leake, Hijung Valentina Shin, Joy O. Kim, and Maneesh Agrawala. 2020. Generating Audio-Visual Slideshows from Text Articles Using Word Concreteness. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3313831.3376519",
      "doi": "10.1145/3313831.3376519"
    },
    {
      "text": "Jiunde Lee. 2007. The Effects of Visual Metaphor and Cognitive Style for Mental Modeling in a Hypermedia-Based Environment. Interact. Comput. 19, 5–6 (Dec. 2007), 614–629. https://doi.org/10.1016/j.intcom.2007.05.005",
      "doi": "10.1016/j.intcom.2007.05.005"
    },
    {
      "text": "Ting Liu, Kit Cho, G. Aaron Broadwell, Samira Shaikh, Tomek Strzalkowski, John Lien, Sarah Taylor, Laurie Feldman, Boris Yamrom, Nick Webb, Umit Boz, Ignacio Cases, and Ching-sheng Lin. 2014. Automatic Expansion of the MRC Psycholinguistic Database Imageability Ratings. In Proceedings of the Ninth International Conference on Language Resources and Evaluation (LREC’14). European Language Resources Association (ELRA), Reykjavik, Iceland, 2800–2805. http://www.lrec-conf.org/proceedings/lrec2014/pdf/178_Paper.pdf",
      "doi": ""
    },
    {
      "text": "Nick Logler, Daisy Yoo, and Batya Friedman. 2018. Metaphor Cards: A How-to-Guide for Making and Using a Generative Metaphorical Design Toolkit. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 1373–1386. https://doi.org/10.1145/3196709.3196811",
      "doi": "10.1145/3196709.3196811"
    },
    {
      "text": "Lucero, AA (Andrés). 2009. Co-designing interactive spaces for and with designers:supporting mood-board making. https://doi.org/10.6100/IR641288",
      "doi": ""
    },
    {
      "text": "Xiaojuan Ma. 2013. Evocation: analyzing and propagating a semantic link based on free word association. Language Resources and Evaluation 47, 3 (01 Sep 2013), 819–837. https://doi.org/10.1007/s10579-013-9219-2",
      "doi": ""
    },
    {
      "text": "Thomas Merten and Ines Fischer. 1999. Creativity, personality and word association responses: associative behaviour in forty supposedly creative persons. Personality and Individual Differences 27, 5 (1999), 933 – 942. https://doi.org/10.1016/S0191-8869(99)00042-2",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 2002. The Design of Everyday Things. Basic Books, Inc., USA.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Heather O’Brien. 2016. Theoretical Perspectives on User Engagement. Springer International Publishing, Cham, 1–26. https://doi.org/10.1007/978-3-319-27446-1_1",
      "doi": ""
    },
    {
      "text": "Matti Perttula and Pekka Sipilä. 2007. The idea exposure paradigm in design idea generation. Journal of Engineering Design 18, 1 (2007), 93–102. https://doi.org/10.1080/09544820600679679 arXiv:https://doi.org/10.1080/09544820600679679",
      "doi": ""
    },
    {
      "text": "Savvas Petridis and Lydia B. Chilton. 2019. Human Errors in Interpreting Visual Metaphor. In Proceedings of the 2019 on Creativity and Cognition (San Diego, CA, USA) (C&C ’19). Association for Computing Machinery, New York, NY, USA, 187–197. https://doi.org/10.1145/3325480.3325503",
      "doi": "10.1145/3325480.3325503"
    },
    {
      "text": "Barbara J Phillips and Edward F McQuarrie. 2004. Beyond visual metaphor: A new typology of visual rhetoric in advertising. Marketing theory 4, 1-2 (2004), 113–136.",
      "doi": ""
    },
    {
      "text": "Elisabeth El Refaie. 2003. Understanding visual metaphor: the example of newspaper cartoons. Visual Communication 2, 1 (2003), 75–95. https://doi.org/10.1177/1470357203002001755 arXiv:https://doi.org/10.1177/1470357203002001755",
      "doi": ""
    },
    {
      "text": "A. Reid and Ian Solomonides. 2007. Design students’ experience of engagement and creativity. Art, Design and Communication in Higher Education 6 (2007), 25–39.",
      "doi": ""
    },
    {
      "text": "John T. E. Richardson. 1975. Concreteness and Imageability. Quarterly Journal of Experimental Psychology 27, 2(1975), 235–249. https://doi.org/10.1080/14640747508400483 arXiv:https://doi.org/10.1080/14640747508400483",
      "doi": ""
    },
    {
      "text": "Daniel Ritchie, Ankita Arvind Kejriwal, and Scott R. Klemmer. 2011. D.Tour: Style-Based Exploration of Design Example Galleries. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 165–174. https://doi.org/10.1145/2047196.2047216",
      "doi": "10.1145/2047196.2047216"
    },
    {
      "text": "Sam H. Ross, Ecenaz Jen Ozmen, Maria V. Kogan, and Lydia B. Chilton. 2020. WordBlender: Principles and Tools for Generating Word Blends. In Proceedings of the 25th International Conference on Intelligent User Interfaces (Cagliari, Italy) (IUI ’20). Association for Computing Machinery, New York, NY, USA, 38–42. https://doi.org/10.1145/3377325.3377527",
      "doi": "10.1145/3377325.3377527"
    },
    {
      "text": "Albert Rothenberg. 1973. Word Association and Creativity. Psychological Reports 33, 1 (1973), 3–12. https://doi.org/10.2466/pr0.1973.33.1.3 arXiv:https://doi.org/10.2466/pr0.1973.33.1.3PMID: 4728480.",
      "doi": ""
    },
    {
      "text": "Yang Shi, Yang Wang, Ye Qi, John Chen, Xiaoyao Xu, and Kwan-Liu Ma. 2017. IdeaWall: Improving Creative Collaboration through Combinatorial Visual Stimuli. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 594–603. https://doi.org/10.1145/2998181.2998208",
      "doi": "10.1145/2998181.2998208"
    },
    {
      "text": "Ben Shneiderman. 2007. Creativity Support Tools: Accelerating Discovery and Innovation. Commun. ACM 50, 12 (Dec. 2007), 20–32. https://doi.org/10.1145/1323688.1323689",
      "doi": "10.1145/1323688.1323689"
    },
    {
      "text": "Pao Siangliulue, Kenneth C. Arnold, Krzysztof Z. Gajos, and Steven P. Dow. 2015. Toward Collaborative Ideation at Scale: Leveraging Ideas from Others to Generate More Creative and Diverse Ideas. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 937–945. https://doi.org/10.1145/2675133.2675239",
      "doi": "10.1145/2675133.2675239"
    },
    {
      "text": "Pao Siangliulue, Joel Chan, Krzysztof Z. Gajos, and Steven P. Dow. 2015. Providing Timely Examples Improves the Quantity and Quality of Generated Ideas. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition (Glasgow, United Kingdom) (C&C ’15). Association for Computing Machinery, New York, NY, USA, 83–92. https://doi.org/10.1145/2757226.2757230",
      "doi": "10.1145/2757226.2757230"
    },
    {
      "text": "R. Smith. 2007. An Overview of the Tesseract OCR Engine. In Proceedings of the Ninth International Conference on Document Analysis and Recognition - Volume 02(ICDAR ’07). IEEE Computer Society, USA, 629–633.",
      "doi": ""
    },
    {
      "text": "Lisanne Weelden, Alfons Maes, Joost Schilperoord, and Marc Swerts. 2012. How Object Shape Affects Visual Metaphor Processing. Experimental psychology 59 (07 2012), 1–8. https://doi.org/10.1027/1618-3169/a000165",
      "doi": ""
    },
    {
      "text": "T Wiegers, Y Song, JSM Vergeest, 2010. Shape Ideation Through Shape Metaphors. In DS 60: Proceedings of DESIGN 2010, the 11th International Design Conference. The Design Society, Dubrovnik, Croatia, 481–490.",
      "doi": ""
    },
    {
      "text": "Merryl J. Wilkenfeld and Thomas B. Ward. 2001. Similarity and Emergence in Conceptual Combination. Journal of Memory and Language 45, 1 (2001), 21 – 38. https://doi.org/10.1006/jmla.2000.2772",
      "doi": ""
    },
    {
      "text": "Ziming Wu, Zhida Sun, Taewook Kim, Manuele Reani, Caroline Jay, and Xiaojuan Ma. 2018. Mediating Color Filter Exploration with Color Theme Semantics Derived from Social Curation Data. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 187 (Nov. 2018), 24 pages. https://doi.org/10.1145/3274456",
      "doi": "10.1145/3274456"
    },
    {
      "text": "Nanxuan Zhao, Nam Wook Kim, Laura Mariah Herman, Hanspeter Pfister, Rynson W.H. Lau, Jose Echevarria, and Zoya Bylinskii. 2020. ICONATE: Automatic Compound Icon Generation and Ideation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376618",
      "doi": "10.1145/3313831.3376618"
    }
  ]
}