{
  "doi": "10.1145/3411764.3445697",
  "title": "Radi-Eye: Hands-Free Radial Interfaces for 3D Interaction using Gaze-Activated Head-Crossing",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "Eye gaze and head movement are attractive for hands-free 3D interaction in head-mounted displays, but existing interfaces afford only limited control. Radi-Eye is a novel pop-up radial interface designed to maximise expressiveness with input from only the eyes and head. Radi-Eye provides widgets for discrete and continuous input and scales to support larger feature sets. Widgets can be selected with Look & Cross, using gaze for pre-selection followed by head-crossing as trigger and for manipulation. The technique leverages natural eye-head coordination where eye and head move at an offset unless explicitly brought into alignment, enabling interaction without risk of unintended input. We explore Radi-Eye in three augmented and virtual reality applications, and evaluate the effect of radial interface scale and orientation on performance with Look & Cross. The results show that Radi-Eye provides users with fast and accurate input while opening up a new design space for hands-free fluid interaction.",
  "authors": [
    {
      "name": "Ludwig Sidenmark",
      "institution": "Lancaster University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659431013",
      "orcid": "0000-0002-7965-0107"
    },
    {
      "name": "Dominic Potts",
      "institution": "School of Computing and Communication Lancaster University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659439284",
      "orcid": "missing"
    },
    {
      "name": "Bill Bapisch",
      "institution": "Ludwig-Maximilians-Universität, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700683",
      "orcid": "missing"
    },
    {
      "name": "Hans Gellersen",
      "institution": "Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616827",
      "orcid": "0000-0003-2233-2121"
    }
  ],
  "references": [
    {
      "text": "Johnny Accot and Shumin Zhai. 2002. More than Dotting the i’s — Foundations for Crossing-Based Interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Minneapolis, Minnesota, USA) (CHI ’02). Association for Computing Machinery, New York, NY, USA, 73–80. https://doi.org/10.1145/503376.503390",
      "doi": "10.1145/503376.503390"
    },
    {
      "text": "Georg Apitz and François Guimbretière. 2004. CrossY: A Crossing-Based Drawing Application. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (Santa Fe, NM, USA) (UIST ’04). Association for Computing Machinery, New York, NY, USA, 3–12. https://doi.org/10.1145/1029632.1029635",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Georg Apitz, François Guimbretière, and Shumin Zhai. 2008. Foundations for Designing and Evaluating User Interfaces Based on the Crossing Paradigm. ACM Trans. Comput.-Hum. Interact. 17, 2, Article 9 (May 2008), 42 pages. https://doi.org/10.1145/1746259.1746263",
      "doi": ""
    },
    {
      "text": "Gilles Bailly, Eric Lecolinet, and Laurence Nigay. 2016. Visual Menu Techniques. ACM Comput. Surv. 49, 4, Article 60 (Dec. 2016), 41 pages. https://doi.org/10.1145/3002171",
      "doi": "10.1145/3002171"
    },
    {
      "text": "Richard Bates and Howell Istance. 2003. Why are Eye Mice Unpopular? A Detailed Comparison of Head and Eye Controlled Assistive Technology Pointing Devices. Universal Access in the Information Society 2, 3 (Oct. 2003), 280–290. https://doi.org/10.1007/s10209-003-0053-y",
      "doi": "10.1007/s10209-003-0053-y"
    },
    {
      "text": "Hrvoje Benko, Andrew D. Wilson, and Patrick Baudisch. 2006. Precise Selection Techniques for Multi-Touch Screens. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 1263–1272. https://doi.org/10.1145/1124772.1124963",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Jonas Blattgerste, Patrick Renner, and Thies Pfeiffer. 2018. Advantages of Eye-gaze over Head-gaze-based Selection in Virtual and Augmented Reality Under Varying Field of Views. In Proceedings of the Workshop on Communication by Gaze Interaction (Warsaw, Poland) (COGAIN ’18). ACM, New York, NY, USA, Article 1, 9 pages. https://doi.org/10.1145/3206343.3206349",
      "doi": "10.1145/3206343.3206349"
    },
    {
      "text": "J. Callahan, D. Hopkins, M. Weiser, and B. Shneiderman. 1988. An Empirical Comparison of Pie vs. Linear Menus. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Washington, D.C., USA) (CHI ’88). ACM, New York, NY, USA, 95–100. https://doi.org/10.1145/57167.57182",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "Debaleena Chattopadhyay and Davide Bolchini. 2014. Touchless Circular Menus: Toward an Intuitive UI for Touchless Interactions with Large Displays. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (Como, Italy) (AVI ’14). Association for Computing Machinery, New York, NY, USA, 33–40. https://doi.org/10.1145/2598153.2598181",
      "doi": "10.1145/2598153.2598181"
    },
    {
      "text": "K. Das and C. W. Borst. 2010. An evaluation of menu properties and pointing techniques in a projection-based VR environment. In 2010 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 47–50. https://doi.org/10.1109/3DUI.2010.5444721",
      "doi": "10.1109/3DUI.2010.5444721"
    },
    {
      "text": "Matthew M. Davis, Joseph L. Gabbard, Doug A. Bowman, and Dennis Gracanin. 2016. Depth-based 3D gesture multi-level radial menu for virtual object manipulation. In 2016 IEEE Virtual Reality (VR). IEEE, 169–170. https://doi.org/10.1109/VR.2016.7504707",
      "doi": ""
    },
    {
      "text": "Edward G. Freedman. 2008. Coordination of the Eyes and Head During Visual Orienting. Experimental Brain Research 190, 4 (Oct. 2008), 369–387. https://doi.org/10.1007/s00221-008-1504-8",
      "doi": ""
    },
    {
      "text": "S. Gebhardt, S. Pick, F. Leithold, B. Hentschel, and T. Kuhlen. 2013. Extended Pie Menus for Immersive Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 19, 4 (April 2013), 644–651. https://doi.org/10.1109/TVCG.2013.31",
      "doi": "10.1109/TVCG.2013.31"
    },
    {
      "text": "D. Gerber and D. Bechmann. 2005. The spin menu: a menu system for virtual environments. In IEEE Proceedings. VR 2005. Virtual Reality, 2005.IEEE, 271–272. https://doi.org/10.1109/VR.2005.1492790",
      "doi": ""
    },
    {
      "text": "Don Hopkins. 1991. The Design and Implementation of Pie Menus. Dr. Dobb’s J. 16, 12 (Dec. 1991), 16–26.",
      "doi": ""
    },
    {
      "text": "Anke Huckauf and Mario H. Urbina. 2008. Gazing with pEYEs: Towards a Universal Input for Various Applications. In Proceedings of the 2008 Symposium on Eye Tracking Research & Applications (Savannah, Georgia) (ETRA ’08). ACM, New York, NY, USA, 51–54. https://doi.org/10.1145/1344471.1344483",
      "doi": "10.1145/1344471.1344483"
    },
    {
      "text": "Aulikki Hyrskykari, Howell Istance, and Stephen Vickers. 2012. Gaze Gestures or Dwell-based Interaction?. In Proceedings of the Symposium on Eye Tracking Research and Applications (Santa Barbara, California) (ETRA ’12). ACM, New York, NY, USA, 229–232. https://doi.org/10.1145/2168556.2168602",
      "doi": "10.1145/2168556.2168602"
    },
    {
      "text": "Robert J. K. Jacob. 1990. What You Look at is What You Get: Eye Movement-based Interaction Techniques. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seattle, Washington, USA) (CHI ’90). ACM, New York, NY, USA, 11–18. https://doi.org/10.1145/97243.97246",
      "doi": "10.1145/97243.97246"
    },
    {
      "text": "Shahram Jalaliniya, Diako Mardanbegi, and Thomas Pederson. 2015. MAGIC Pointing for Eyewear Computers. In Proceedings of the 2015 ACM International Symposium on Wearable Computers (Osaka, Japan) (ISWC ’15). Association for Computing Machinery, New York, NY, USA, 155–158. https://doi.org/10.1145/2802083.2802094",
      "doi": "10.1145/2802083.2802094"
    },
    {
      "text": "Mikko Kytö, Barrett Ens, Thammathip Piumsomboon, Gun A. Lee, and Mark Billinghurst. 2018. Pinpointing: Precise Head- and Eye-Based Target Selection for Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 81, 14 pages. https://doi.org/10.1145/3173574.3173655",
      "doi": "10.1145/3173574.3173655"
    },
    {
      "text": "Michael Land and Benjamin Tatler. 2012. Looking and Acting: Vision and Eye Movements in Natural Behaviour. Oxford University Press, United Kingdom. https://doi.org/10.1093/acprof:oso/9780198570943.001.0001",
      "doi": ""
    },
    {
      "text": "Zhen Li, Michelle Annett, Ken Hinckley, Karan Singh, and Daniel Wigdor. 2019. HoloDoc: Enabling Mixed Reality Workspaces That Harness Physical and Digital Content. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 687, 14 pages. https://doi.org/10.1145/3290605.3300917",
      "doi": "10.1145/3290605.3300917"
    },
    {
      "text": "Yuexing Luo and Daniel Vogel. 2015. Pin-and-Cross: A Unimanual Multitouch Technique Combining Static Touches with Crossing Selection. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology (Charlotte, NC, USA) (UIST ’15). Association for Computing Machinery, New York, NY, USA, 323–332. https://doi.org/10.1145/2807442.2807444",
      "doi": "10.1145/2807442.2807444"
    },
    {
      "text": "Diako Mardanbegi, , Benedikt Mayer, Ken Pfeuffer, Shahram Jalaliniya, Hans Gellersen, and Alexander Perzl. 2019. EyeSeeThrough: Unifying Tool Selection and Application in Virtual Environments. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 474–483. https://doi.org/10.1109/VR.2019.8797988",
      "doi": ""
    },
    {
      "text": "Diako Mardanbegi, Tobias Langlotz, and Hans Gellersen. 2019. Resolving Target Ambiguity in 3D Gaze Interaction through VOR Depth Estimation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 612, 12 pages. https://doi.org/10.1145/3290605.3300842",
      "doi": "10.1145/3290605.3300842"
    },
    {
      "text": "Pallavi Mohan, Wooi Boon Goh, Chi-Wing Fu, and Sai-Kit Yeung. 2018. DualGaze: Addressing the Midas Touch Problem in Gaze Mediated VR Interaction. In 2018 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). IEEE, 79–84. https://doi.org/10.1109/ISMAR-Adjunct.2018.00039",
      "doi": ""
    },
    {
      "text": "Florian Müller, Joshua McManus, Sebastian Günther, Martin Schmitz, Max Mühlhäuser, and Markus Funk. 2019. Mind the Tap: Assessing Foot-Taps for Interacting with Head-Mounted Displays. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 477, 13 pages. https://doi.org/10.1145/3290605.3300707",
      "doi": "10.1145/3290605.3300707"
    },
    {
      "text": "Ken Pfeuffer, Matthias J. Geiger, Sarah Prange, Lukas Mecke, Daniel Buschek, and Florian Alt. 2019. Behavioural Biometrics in VR: Identifying People from Body Motion and Relations in Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300340",
      "doi": "10.1145/3290605.3300340"
    },
    {
      "text": "T. Piumsomboon, G. Lee, R. W. Lindeman, and M. Billinghurst. 2017. Exploring natural eye-gaze-based interaction for immersive virtual reality. In 2017 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 36–39. https://doi.org/10.1109/3DUI.2017.7893315",
      "doi": ""
    },
    {
      "text": "Majid Pourmemar and Charalambos Poullis. 2019. Visualizing and Interacting with Hierarchical Menus in Immersive Augmented Reality. In The 17th International Conference on Virtual-Reality Continuum and Its Applications in Industry (Brisbane, QLD, Australia) (VRCAI ’19). Association for Computing Machinery, New York, NY, USA, Article 30, 9 pages. https://doi.org/10.1145/3359997.3365693",
      "doi": ""
    },
    {
      "text": "Yuan Yuan Qian and Robert J. Teather. 2017. The Eyes Don’t Have It: An Empirical Comparison of Head-Based and Eye-Based Selection in Virtual Reality. In Proceedings of the 5th Symposium on Spatial User Interaction (Brighton, United Kingdom) (SUI ’17). Association for Computing Machinery, New York, NY, USA, 91–98. https://doi.org/10.1145/3131277.3132182",
      "doi": "10.1145/3131277.3132182"
    },
    {
      "text": "Krystian Samp and Stefan Decker. 2010. Supporting Menu Design with Radial Layouts. In Proceedings of the International Conference on Advanced Visual Interfaces (Roma, Italy) (AVI ’10). Association for Computing Machinery, New York, NY, USA, 155–162. https://doi.org/10.1145/1842993.1843021",
      "doi": "10.1145/1842993.1843021"
    },
    {
      "text": "A. Santos, T. Zarraonandia, P. Díaz, and I. Aedo. 2017. A Comparative Study of Menus in Virtual Reality Environments. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (Brighton, United Kingdom) (ISS ’17). Association for Computing Machinery, New York, NY, USA, 294–299. https://doi.org/10.1145/3132272.3132277",
      "doi": ""
    },
    {
      "text": "Sayan Sarcar, Prateek Panwar, and Tuhin Chakraborty. 2013. EyeK: An Efficient Dwell-Free Eye Gaze-Based Text Entry System. In Proceedings of the 11th Asia Pacific Conference on Computer Human Interaction (Bangalore, India) (APCHI ’13). Association for Computing Machinery, New York, NY, USA, 215–220. https://doi.org/10.1145/2525194.2525288",
      "doi": "10.1145/2525194.2525288"
    },
    {
      "text": "Ludwig Sidenmark, Christopher Clarke, Xuesong Zhang, Jenny Phu, and Hans Gellersen. 2020. Outline Pursuits: Gaze-Assisted Selection of Occluded Objects in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376438",
      "doi": "10.1145/3313831.3376438"
    },
    {
      "text": "Ludwig Sidenmark and Hans Gellersen. 2019. Eye, Head and Torso Coordination During Gaze Shifts in Virtual Reality. ACM Trans. Comput.-Hum. Interact. 27, 1, Article 4 (Dec. 2019), 40 pages. https://doi.org/10.1145/3361218",
      "doi": "10.1145/3361218"
    },
    {
      "text": "Ludwig Sidenmark and Hans Gellersen. 2019. Eye&Head: Synergetic Eye and Head Movement for Gaze Pointing and Selection. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). ACM, New York, NY, USA, 1161–1174. https://doi.org/10.1145/3332165.3347921",
      "doi": "10.1145/3332165.3347921"
    },
    {
      "text": "Ludwig Sidenmark and Anders Lundström. 2019. Gaze Behaviour on Interacted Objects During Hand Interaction in Virtual Reality for Eye Tracking Calibration. In Proceedings of the 11th ACM Symposium on Eye Tracking Research & Applications (Denver, Colorado) (ETRA ’19). ACM, New York, NY, USA, Article 6, 9 pages. https://doi.org/10.1145/3314111.3319815",
      "doi": "10.1145/3314111.3319815"
    },
    {
      "text": "Ludwig Sidenmark, Diako Mardanbegi, Argenis Ramirez Gomez, Christopher Clarke, and Hans Gellersen. 2020. BimodalGaze: Seamlessly Refined Pointing with Gaze and Filtered Gestural Head Movement. In Proceedings of the 12th ACM Symposium on Eye Tracking Research & Applications(ETRA ’20). ACM, New York, NY, USA, 9. https://doi.org/10.1145/3379155.3391312",
      "doi": "10.1145/3379155.3391312"
    },
    {
      "text": "John S. Stahl. 1999. Amplitude of human head movements associated with horizontal saccades. Experimental Brain Research 126, 1 (apr 1999), 41–54. https://doi.org/10.1007/s002210050715",
      "doi": ""
    },
    {
      "text": "Ahmed N. Sulaiman and Patrick Olivier. 2008. Attribute Gates. In Proceedings of the 21st Annual ACM Symposium on User Interface Software and Technology (Monterey, CA, USA) (UIST ’08). Association for Computing Machinery, New York, NY, USA, 57–66. https://doi.org/10.1145/1449715.1449726",
      "doi": ""
    },
    {
      "text": "Vildan Tanriverdi and Robert J. K. Jacob. 2000. Interacting with Eye Movements in Virtual Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI ’00). ACM, New York, NY, USA, 265–272. https://doi.org/10.1145/332040.332443",
      "doi": "10.1145/332040.332443"
    },
    {
      "text": "Huawei Tu, Susu Huang, Jiabin Yuan, Xiangshi Ren, and Feng Tian. 2019. Crossing-Based Selection with Virtual Reality Head-Mounted Displays. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 618, 14 pages. https://doi.org/10.1145/3290605.3300848",
      "doi": "10.1145/3290605.3300848"
    },
    {
      "text": "Mario H. Urbina, Maike Lorenz, and Anke Huckauf. 2010. Pies with EYEs: The Limits of Hierarchical Pie Menus in Gaze Control. In Proceedings of the 2010 Symposium on Eye-Tracking Research & Applications (Austin, Texas) (ETRA ’10). ACM, New York, NY, USA, 93–96. https://doi.org/10.1145/1743666.1743689",
      "doi": "10.1145/1743666.1743689"
    },
    {
      "text": "Jacob O. Wobbrock and Krzysztof Z. Gajos. 2008. Goal Crossing with Mice and Trackballs for People with Motor Impairments: Performance, Submovements, and Design Directions. ACM Trans. Access. Comput. 1, 1, Article 4 (May 2008), 37 pages. https://doi.org/10.1145/1361203.1361207",
      "doi": "10.1145/1361203.1361207"
    },
    {
      "text": "Wenge Xu, Hai-Ning Liang, Yuxuan Zhao, Difeng Yu, and Diego Monteiro. 2019. DMove: Directional Motion-based Interaction for Augmented Reality Head-Mounted Displays. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 444, 14 pages. https://doi.org/10.1145/3290605.3300674",
      "doi": "10.1145/3290605.3300674"
    },
    {
      "text": "Wenge Xu, Hai-Ning Liang, Yuxuan Zhao, Tianyu Zhang, Difeng Yu, and Diego Monteiro. 2019. RingText: Dwell-free and hands-free Text Entry for Mobile Head-Mounted Displays using Head Motions. IEEE Transactions on Visualization and Computer Graphics 25, 5 (May 2019), 1991–2001. https://doi.org/10.1109/TVCG.2019.2898736",
      "doi": ""
    },
    {
      "text": "Yukang Yan, Yingtian Shi, Chun Yu, and Yuanchun Shi. 2020. HeadCross: Exploring Head-Based Crossing Selection on Head-Mounted Displays. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 1, Article 35 (March 2020), 22 pages. https://doi.org/10.1145/3380983",
      "doi": "10.1145/3380983"
    }
  ]
}