{
  "doi": "10.1145/3411764.3445198",
  "title": "What Do Hackathons Do? Understanding Participation in Hackathons Through Program Theory Analysis",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [
    "Best Paper"
  ],
  "abstract": "Hackathons are increasingly embraced across diverse sectors as a way of democratizing the design of technology. Several attempts have been made to redefine the format and desired end goal of hackathons in recent years thereby warranting closer methodological scrutiny. In this paper, we apply program theory to analyze the processes and effects of 16 hackathon case studies through published research literature. Building upon existing research on hackathons, our work offers a critical perspective examining the methodological validity of hackathons and exemplifies how specific processes for organizing hackathons are modified for different purposes. Our main contribution is a program theory analysis of hackathon formats that provides an exploration and juxtaposition of 16 case studies in terms of causal relations between the input, process and the effects of hackathons. Our cataloguing of examples can serve as an inspirational planning resource for future organizers of hackathons.",
  "tags": [
    "hackathons",
    "participatory design",
    "program theory",
    "research methods"
  ],
  "authors": [
    {
      "name": "Jeanette Falk",
      "institution": "Aarhus University, Denmark",
      "img": "/do/10.1145/contrib-99659212034/rel-imgonly/profile_copy.jpg",
      "acmid": "99659212034",
      "orcid": "missing"
    },
    {
      "name": "Gopinaath Kannabiran",
      "institution": "Computer Science Department IT Univserity of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81456639284/rel-imgonly/gk.png",
      "acmid": "81456639284",
      "orcid": "missing"
    },
    {
      "name": "Nicolai Brodersen Hansen",
      "institution": "Department of Computer Science, Aalborg University Aalborg, Denmark",
      "img": "/do/10.1145/contrib-81549506756/rel-imgonly/11160006_10152828250436344_5373531664018953693_n.jpg",
      "acmid": "81549506756",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Seyram Avle, Silvia Lindtner, and Kaiton Williams. 2017. How methods make designers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 472–483.",
      "doi": "10.1145/3025453.3025864"
    },
    {
      "text": "Eevi E. Beck. 2002. P for Political: Participation is Not Enough. Scandanavian Journal of Information Systems 14 (2002), 5–13.",
      "doi": ""
    },
    {
      "text": "Leonard Bickman. 1987. The functions of program theory. New directions for program evaluation 1987, 33 (1987), 5–18.",
      "doi": ""
    },
    {
      "text": "Nataly Birbeck, Shaun Lawson, Kellie Morrissey, Tim Rapley, and Patrick Olivier. 2017. Self Harmony: rethinking hackathons to design and critique digital technologies for those affected by self-harm. In proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 146–157.",
      "doi": "10.1145/3025453.3025931"
    },
    {
      "text": "Susanne Bødker and Morten Kyng. 2018. Participatory design that matters—Facing the big issues. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 1(2018), 1–31.",
      "doi": "10.1145/3152421"
    },
    {
      "text": "Claus Bossen, Christian Dindler, and Ole Sejer Iversen. 2016. Evaluation in participatory design: a literature survey. In Proceedings of the 14th Participatory Design Conference: Full papers-Volume 1. Association for Computing Machinery, New York, NY, USA, 151–160.",
      "doi": "10.1145/2940299.2940303"
    },
    {
      "text": "Claus Bossen, Christian Dindler, and Ole Sejer Iversen. 2018. Program theory for participatory design. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial-Volume 2. Association for Computing Machinery, New York, NY, USA, 1–4.",
      "doi": "10.1145/3210604.3210638"
    },
    {
      "text": "Mark Brough. 2013. Chapter 4 - Toward Cultural Epidemiology: Beyond Epistemological Hegemony. In When Culture Impacts Health, Cathy Banwell, Stanley Ulijaszek, and Jane Dixon (Eds.). Academic Press, San Diego, 33 – 42. https://doi.org/10.1016/B978-0-12-415921-1.00004-X",
      "doi": ""
    },
    {
      "text": "Tina Chan, Josephine McMurray, AnneMarie Levy, Heidi Sveistrup, and James Wallace. 2020. Post-Hackathon Learning Circles: Supporting Lean Startup Development. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–8.",
      "doi": "10.1145/3334480.3375216"
    },
    {
      "text": "Quintin Cutts, Matthew Barr, Mireilla Bikanga Ada, Peter Donaldson, Steve Draper, Jack Parkinson, Jeremy Singer, and Lovisa Sundin. 2019. Experience report: thinkathon-countering an’i got it working’mentality with pencil-and-paper exercises. ACM Inroads 10, 4 (2019), 66–73.",
      "doi": "10.1145/3368563"
    },
    {
      "text": "Amalia De Götzen, Luca Simeone, Joanna Saad-Sulonen, Begüm Becermen, Nicola Morelli, 2020. The hackathon format: an analysis of its possible interpretations under a service design perspective. DS 101: Proceedings of NordDesign 2020, Lyngby, Denmark, 12th-14th August 2020 DS 101(2020), 1–12.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Melissa Gregg, and Thomas Lodato. 2014. Building belonging. interactions 21, 4 (2014), 58–61.",
      "doi": ""
    },
    {
      "text": "Kathleen M. Eisenhardt. 1989. Building Theories from Case Study Research. The Academy of Management Review 14, 4 (1989), 532–550. http://www.jstor.org/stable/258557",
      "doi": ""
    },
    {
      "text": "Jeanette Falk Olesen and Kim Halskov. 2020. 10 Years of Research With and On Hackathons. In Proceedings of the 2020 ACM on Designing Interactive Systems Conference. Association for Computing Machinery, New York, NY, USA, 1073–1088.",
      "doi": "10.1145/3357236.3395543"
    },
    {
      "text": "Sarah Fox, Rachel Rose Ulgado, and Daniela Rosner. 2015. Hacking Culture, Not Devices: Access and Recognition in Feminist Hackerspaces. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work and Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 56–68. https://doi.org/10.1145/2675133.2675223",
      "doi": "10.1145/2675133.2675223"
    },
    {
      "text": "Frank J Frey and Michael Luks. 2016. The innovation-driven hackathon: one means for accelerating innovation. In Proceedings of the 21st European Conference on Pattern Languages of Programs. Association for Computing Machinery, New York, NY, USA, 1–11.",
      "doi": "10.1145/3011784.3011794"
    },
    {
      "text": "TW Frick and CM Reigeluth. 1999. Formative research: A methodology for creating and improving design theories. Instructional-design theories and models: A new paradigm of instructional theory 2(1999), 633–652.",
      "doi": ""
    },
    {
      "text": "Kiev Gama. 2017. Preliminary findings on software engineering practices in civic hackathons. In 2017 IEEE/ACM 4th International Workshop on CrowdSourcing in Software Engineering (CSI-SE). IEEE, IEEE Press, Piscataway, NJ, USA, 14–20.",
      "doi": "10.1109/CSI-SE.2017.5"
    },
    {
      "text": "Kiev Gama. 2019. Developing course projects in a hack day: an experience report. In Proceedings of the 2019 ACM Conference on Innovation and Technology in Computer Science Education. Association for Computing Machinery, New York, NY, USA, 388–394.",
      "doi": "10.1145/3304221.3319777"
    },
    {
      "text": "Kiev Gama, Victoria Rautenbach, Cameron Green, Breno Alencar Gonçalves, Serena Coetzee, Nicolene Fourie, and Nishanth Sastry. 2019. Mapathons and Hackathons to Crowdsource the Generation and Usage of Geographic Data. In Proceedings of the International Conference on Game Jams, Hackathons and Game Creation Events 2019. Association for Computing Machinery, New York, NY, USA, 1–5.",
      "doi": "10.1145/3316287.3316293"
    },
    {
      "text": "Amanda L Griffith. 2010. Persistence of women and minorities in STEM field majors: Is it the school that matters?Economics of Education Review 29, 6 (2010), 911–922.",
      "doi": ""
    },
    {
      "text": "Nicolai Brodersen Hansen, Christian Dindler, Kim Halskov, Ole Sejer Iversen, Claus Bossen, Ditte Amund Basballe, and Ben Schouten. 2019. How participatory design works: mechanisms and effects. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction. Association for Computing Machinery, New York, NY, USA, 30–41.",
      "doi": "10.1145/3369457.3369460"
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 3(2012), 1–18.",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Alexis Hope, Catherine D’Ignazio, Josephine Hoy, Rebecca Michelson, Jennifer Roberts, Kate Krontiris, and Ethan Zuckerman. 2019. Hackathons as participatory design: iterating feminist utopias. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3290605.3300291"
    },
    {
      "text": "Lilly Irani. 2015. Hackathons and the making of entrepreneurial citizenship. Science, Technology, & Human Values 40, 5 (2015), 799–824.",
      "doi": ""
    },
    {
      "text": "Arafeh Karimi, Peter Worthy, Paul McInnes, Marie Bodén, Ben Matthews, and Stephen Viller. 2017. The community garden hack: Participatory experiments in facilitating primary school teacher’s appropriation of technology. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. Association for Computing Machinery, New York, NY, USA, 143–151.",
      "doi": "10.1145/3152771.3152787"
    },
    {
      "text": "Samia Khan and Robert VanWynsberghe. 2008. Cultivating the Under-Mined: Cross-Case Analysis as Knowledge Mobilization. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research 9, 1(2008). https://doi.org/10.17169/fqs-9.1.334",
      "doi": ""
    },
    {
      "text": "Christoph Kollwitz and Barbara Dinter. 2019. What the Hack?–Towards a Taxonomy of Hackathons. In International Conference on Business Process Management. Springer, Springer International Publishing, Cham, 354–369.",
      "doi": "10.1007/978-3-030-26619-6_23"
    },
    {
      "text": "Marco Konopacki, Debora Albu, and Fabro Steibel. 2019. MUDAMOS: a civil society initiative on collaborative lawmaking in Brazil. In Proceedings of the 12th International Conference on Theory and Practice of Electronic Governance. Association for Computing Machinery, New York, NY, USA, 175–180.",
      "doi": "10.1145/3326365.3326388"
    },
    {
      "text": "Wiesław Kopeć, Bartłomiej Balcerzak, Radosław Nielek, Grzegorz Kowalik, Adam Wierzbicki, and Fabio Casati. 2018. Older adults and hackathons: a qualitative study. Empirical Software Engineering 23, 4 (2018), 1895–1930.",
      "doi": "10.1007/s10664-017-9565-6"
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Ian Li, Jon Froehlich, Jakob E Larsen, Catherine Grevet, and Ernesto Ramirez. 2013. Personal informatics in the wild: hacking habits for health & happiness. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3179–3182.",
      "doi": ""
    },
    {
      "text": "Jaya Narain, Ishwarya Ananthabhotla, Samuel Mendez, Cameron Taylor, Hosea Siu, Lora Brugnaro, and Adriana Mallozzi. 2020. ATHack: Co-Design and Education in Assistive Technology Development. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–7.",
      "doi": ""
    },
    {
      "text": "National Center for Women and Information Technology 2013. National Center for Women and Information Technology. Top 10 Ways to Increase Girls’ Participation in Computing Competitions. National Center for Women and Information Technology. Retrieved September 16, 2020 from http://www.ncwit.org/resources/top-10-waysincrease-girls-participation-computing-competitions/top-10-ways-increase-girls",
      "doi": ""
    },
    {
      "text": "Alexander Nolte, Linda Bailey Hayden, and James D. Herbsleb. 2020. How to Support Newcomers in Scientific Hackathons - An Action Research Study on Expert Mentoring. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 025 (May 2020), 23 pages. https://doi.org/10.1145/3392830",
      "doi": "10.1145/3392830"
    },
    {
      "text": "Alexander Nolte, Ei Pa Pa Pe-Than, Abasi amefon Obot Affia, Chalalai Chaihirunkarn, Anna Filippova, Arun Kalyanasundaram, Maria Angelica Medina Angarita, Erik Trainer, and James D. Herbsleb. 2020. How to organize a hackathon – A planning kit. arxiv:2008.08025 [cs.CY]",
      "doi": ""
    },
    {
      "text": "Open Source Hardware Association 2020. Open Source Hardware Association. Open Source Hardware Association. Retrieved September 14, 2020 from https://www.oshwa.org/definition/",
      "doi": ""
    },
    {
      "text": "Ei Pa Pa Pe-Than, Alexander Nolte, Anna Filippova, Christian Bird, Steve Scallen, and James D Herbsleb. 2019. Designing corporate hackathons with a purpose: the future of software development. IEEE Software 36, 1 (2019), 15–22.",
      "doi": "10.1109/MS.2018.290110547"
    },
    {
      "text": "Jari Porras, Jayden Khakurel, Jouni Ikonen, Ari Happonen, Antti Knutas, Antti Herala, and Olaf Drögehorn. 2018. Hackathons in software engineering education: lessons learned from a decade of events. In Proceedings of the 2nd International Workshop on Software Engineering Education for Millennials. Association for Computing Machinery, New York, NY, USA, 40–47.",
      "doi": "10.1145/3194779.3194783"
    },
    {
      "text": "Emily Porter, Chris Bopp, Elizabeth Gerber, and Amy Voida. 2017. Reappropriating hackathons: the production work of the CHI4Good day of service. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 810–814.",
      "doi": "10.1145/3025453.3025637"
    },
    {
      "text": "Gabriela T Richard, Yasmin B Kafai, Barrie Adleberg, and Orkan Telhan. 2015. StitchFest: Diversifying a College Hackathon to broaden participation and perceptions in computing. In Proceedings of the 46th ACM technical symposium on computer science education. Association for Computing Machinery, New York, NY, USA, 114–119.",
      "doi": "10.1145/2676723.2677310"
    },
    {
      "text": "Patricia J. Rogers, Anthony Petrosino, Tracy A. Huebner, and Timothy A. Hacsi. 2000. Program theory evaluation: Practice, promise, and problems. New Directions for Evaluation 2000, 87 (2000), 5–13. https://doi.org/10.1002/ev.1177",
      "doi": ""
    },
    {
      "text": "Myrian Raquel Noguera Salinas, Maria Claudia Figueiredo Pereira Emer, and Adolfo Gustavo Serra Seca Neto. 2019. Short datathon for the interdisciplinary development of data analysis and visualization skills. In 2019 IEEE/ACM 12th International Workshop on Cooperative and Human Aspects of Software Engineering (CHASE). IEEE Press, Piscataway, NJ, USA, 95–98.",
      "doi": "10.1109/CHASE.2019.00031"
    },
    {
      "text": "Geertje Slingerland, Stephan Lukosch, Mariëlle den Hengst, Caroline Nevejan, and Frances Brazier. 2020. Together We Can Make It Work! Toward a Design Framework for Inclusive and Participatory City-Making of Playable Cities. Frontiers in Computer Science 2 (2020), 51. https://doi.org/10.3389/fcomp.2020.600654",
      "doi": ""
    },
    {
      "text": "Karen Tanenbaum, Theresa Jean Tanenbaum, Amanda M. Williams, Matt Ratto, Gabriel Resch, and Antonio Gamba Bari. 2014. Critical Making Hackathon: Situated Hacking, Surveillance and Big Data Proposal. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 17–20. https://doi.org/10.1145/2559206.2560476",
      "doi": ""
    },
    {
      "text": "Nick Taylor and Loraine Clarke. 2018. Everybody’s hacking: participation and the mainstreaming of hackathons. In CHI 2018. Association for Computing Machinery, Association for Computing Machinery, New York, NY, USA, 1–2.",
      "doi": "10.1145/3173574.3173746"
    },
    {
      "text": "Nick Taylor, Loraine Clarke, and Katerina Gorkovenko. 2017. Community Inventor Days: Scaffolding Grassroots Innovation with Maker Events. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 1201–1212. https://doi.org/10.1145/3064663.3064723",
      "doi": "10.1145/3064663.3064723"
    },
    {
      "text": "Nick Taylor, Loraine Clarke, Martin Skelly, and Sara Nevay. 2018. Strategies for engaging communities in creating physical civic technologies. In CHI 2018. Association for Computing Machinery, Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3174081"
    },
    {
      "text": "Andrea K Thomer, Michael B Twidale, Jinlong Guo, and Matthew J Yoder. 2016. Co-designing scientific software: Hackathons for participatory interface design. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3219–3226.",
      "doi": "10.1145/2851581.2892549"
    },
    {
      "text": "Erik H Trainer, Arun Kalyanasundaram, Chalalai Chaihirunkarn, and James D Herbsleb. 2016. How to hackathon: Socio-technical tradeoffs in brief, intensive collocation. In proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. Association for Computing Machinery, New York, NY, USA, 1118–1130.",
      "doi": "10.1145/2818048.2819946"
    },
    {
      "text": "Jeremy Warner and Philip J Guo. 2017. Hack. edu: Examining how college hackathons are perceived by student attendees and non-attendees. In Proceedings of the 2017 ACM Conference on International Computing Education Research. Association for Computing Machinery, New York, NY, USA, 254–262.",
      "doi": ""
    },
    {
      "text": "Helena Webb, Jason RC Nurse, Louise Bezuidenhout, and Marina Jirotka. 2019. Lab Hackathons to Overcome Laboratory Equipment Shortages in Africa: Opportunities and Challenges. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–8.",
      "doi": "10.1145/3290607.3299063"
    },
    {
      "text": "Robert K. Yin. 2014. Case study research: design and methods. Sage Publication, Thousand Oaks, CA, USA.",
      "doi": ""
    }
  ]
}