{
  "doi": "10.1145/3411764.3445115",
  "title": "Optimal Action-based or User Prediction-based Haptic Guidance: Can You Do Even Better?",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "The recently advanced robotics technology enables robots to assist users in their daily lives. Haptic guidance (HG) improves users’ task performance through physical interaction between robots and users. It can be classified into optimal action-based HG (OAHG), which assists users with an optimal action, and user prediction-based HG (UPHG), which assists users with their next predicted action. This study aims to understand the difference between OAHG and UPHG and propose a combined HG (CombHG) that achieves optimal performance by complementing each HG type, which has important implications for HG design. We propose implementation methods for each HG type using deep learning-based approaches. A user study (n=20) in a haptic task environment indicated that UPHG induces better subjective evaluations, such as naturalness and comfort, than OAHG. In addition, the CombHG that we proposed further decreases the disagreement between the user intention and HG, without reducing the objective and subjective scores.",
  "tags": [
    "User adaptation",
    "Physical human–robot interaction (pHRI)",
    "Haptic guidance",
    "Deep learning"
  ],
  "authors": [
    {
      "name": "Hee-Seung Moon",
      "institution": "Yonsei University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588221",
      "orcid": "0000-0003-0882-2335"
    },
    {
      "name": "Jiwon Seo",
      "institution": "Yonsei University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659587841",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "David A Abbink and Mark Mulder. 2010. Neuromuscular analysis as a guideline in designing shared control. Advances in Haptics (2010), 499–516.",
      "doi": ""
    },
    {
      "text": "David A Abbink, Mark Mulder, and Erwin R Boer. 2012. Haptic shared control: smoothly shifting control authority?Cognition, Technology & Work 14, 1 (2012), 19–28.",
      "doi": "10.1007/s10111-011-0192-5"
    },
    {
      "text": "Trapit Bansal, Jakub Pachocki, Szymon Sidor, Ilya Sutskever, and Igor Mordatch. 2018. Emergent complexity via multi-agent competition. In Proceedings of the Sixth International Conference on Learning Representations (ICLR).",
      "doi": ""
    },
    {
      "text": "Alessandro Bettini, Samuel Lang, Allison Okamura, and Gregory Hager. 2002. Vision assisted control for manipulation using virtual fixtures: Experiments at macro and micro scales. In 2002 IEEE International Conference on Robotics and Automation (ICRA). 3354–3361.",
      "doi": ""
    },
    {
      "text": "Jérémy Bluteau, Sabine Coquillart, Yohan Payan, and Edouard Gentaz. 2008. Haptic guidance improves the visuo-manual tracking of trajectories. PLoS One 3, 3 (2008), e1775.",
      "doi": ""
    },
    {
      "text": "Rolf Boink, Marinus M Van Paassen, Mark Mulder, and David A Abbink. 2014. Understanding and reducing conflicts between driver and haptic shared control. In 2014 IEEE International Conference on Systems, Man, and Cybernetics (SMC). 1510–1515.",
      "doi": ""
    },
    {
      "text": "Alexander Broad, Ian Abraham, Todd Murphey, and Brenna Argall. 2020. Data-driven Koopman operators for model-based shared control of human–machine systems. The International Journal of Robotics Research 39, 9 (2020), 1178–1195.",
      "doi": "10.1177/0278364920921935"
    },
    {
      "text": "Chia-Yu Chen, Yen-Yu Chen, Yi-Ju Chung, and Neng-Hao Yu. 2016. Motion guidance sleeve: Guiding the forearm rotation through external artificial muscles. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). 3272–3276.",
      "doi": "10.1145/2858036.2858275"
    },
    {
      "text": "Laura Marchal Crespo and David J Reinkensmeyer. 2008. Haptic guidance can enhance motor learning of a steering task. Journal of Motor Behavior 40, 6 (2008), 545–557.",
      "doi": ""
    },
    {
      "text": "Arnold W de Jonge, Jeroen GW Wildenbeest, Henri Boessenkool, and David A Abbink. 2015. The effect of trial-by-trial adaptation on conflicts in haptic shared control for free-air teleoperation tasks. IEEE Transactions on Haptics 9, 1 (2015), 111–120.",
      "doi": "10.1109/TOH.2015.2477302"
    },
    {
      "text": "Jack Tigh Dennerlein, David B Martin, and Christopher Hasser. 2000. Force-feedback improves performance for steering and combined steering-targeting tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’00). 423–429.",
      "doi": "10.1145/332040.332469"
    },
    {
      "text": "Patrizia Di Campli San Vito, Gözel Shakeri, Stephen Brewster, Frank Pollick, Edward Brown, Lee Skrypchuk, and Alexandros Mouzakitis. 2019. Haptic navigation cues on the steering wheel. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). 1–11.",
      "doi": "10.1145/3290605.3300440"
    },
    {
      "text": "Anca D Dragan and Siddhartha S Srinivasa. 2013. A policy-blending formalism for shared control. The International Journal of Robotics Research 32, 7 (2013), 790–805.",
      "doi": "10.1177/0278364913490324"
    },
    {
      "text": "Chelsea Finn, Pieter Abbeel, and Sergey Levine. 2017. Model-agnostic meta-learning for fast adaptation of deep networks. In Proceedings of the 34th International Conference on Machine Learning (ICML). 1126–1135.",
      "doi": ""
    },
    {
      "text": "Benjamin AC Forsyth and Karon E MacLean. 2005. Predictive haptic guidance: Intelligent user assistance for the control of dynamic tasks. IEEE Transactions on Visualization and Computer Graphics 12, 1(2005), 103–113.",
      "doi": "10.1109/TVCG.2006.11"
    },
    {
      "text": "Takashi Goto, Swagata Das, Yuichi Kurita, and Kai Kunze. 2018. Artificial motion guidance: an intuitive device based on Pneumatic Gel Muscle (PGM). In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings(UIST ’18 Adjunct). 182–184.",
      "doi": "10.1145/3266037.3271644"
    },
    {
      "text": "Jordi Grau-Moya, Eduard Hez, Giovanni Pezzulo, and Daniel A Braun. 2013. The effect of model uncertainty on cooperation in sensorimotor interactions. Journal of The Royal Society Interface 10, 87 (2013), 20130554.",
      "doi": ""
    },
    {
      "text": "Tuomas Haarnoja, Aurick Zhou, Pieter Abbeel, and Sergey Levine. 2018. Soft actor-critic: Off-policy maximum entropy deep reinforcement learning with a stochastic actor. In Proceedings of the 35th International Conference on Machine Learning (ICML). 1861–1870.",
      "doi": ""
    },
    {
      "text": "JR Medina Hernández, Tamara Lorenz, and Sandra Hirche. 2015. Synthesizing anticipatory haptic assistance considering human behavior uncertainty. IEEE Transactions on Robotics 31, 1 (2015), 180–190.",
      "doi": "10.1109/TRO.2014.2387571"
    },
    {
      "text": "Minsik Hong and Jerzy W Rozenblit. 2016. A haptic guidance system for computer-assisted surgical training using virtual fixtures. In 2016 IEEE International Conference on Systems, Man, and Cybernetics (SMC). 2230–2235.",
      "doi": "10.1109/SMC.2016.7844570"
    },
    {
      "text": "Amin Hosseini, Florian Richthammer, and Markus Lienkamp. 2016. Predictive haptic feedback for safe lateral control of teleoperated road vehicles in urban areas. In 2016 IEEE 83rd Vehicular Technology Conference (VTC Spring). 1–7.",
      "doi": ""
    },
    {
      "text": "Ioanna Iacovides, Anna L Cox, and Thomas Knoll. 2014. Learning the game: breakdowns, breakthroughs and player strategies. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’14). 2215–2220.",
      "doi": ""
    },
    {
      "text": "Akira Kanazawa, Jun Kinugawa, and Kazuhiro Kosuge. 2019. Adaptive motion planning for a collaborative robot based on prediction uncertainty to enhance human safety and work efficiency. IEEE Transactions on Robotics 35, 4 (2019), 817–832.",
      "doi": "10.1109/TRO.2019.2911800"
    },
    {
      "text": "Alex Kendall and Yarin Gal. 2017. What uncertainties do we need in bayesian deep learning for computer vision?. In Proceedings of the 31st Conference on Neural Information Processing Systems (NIPS). 5574–5584.",
      "doi": ""
    },
    {
      "text": "Soheil Kianzad, Yuxiang Huang, Robert Xiao, and Karon E MacLean. 2020. Phasking on paper: Accessing a continuum of physically assisted sketching. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). 1–12.",
      "doi": "10.1145/3313831.3376134"
    },
    {
      "text": "Ravi Kuber, Wai Yu, and Graham McAllister. 2007. Towards developing assistive haptic feedback for visually impaired internet users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). 1525–1534.",
      "doi": "10.1145/1240624.1240854"
    },
    {
      "text": "Roel J Kuiper, Dennis JF Heck, Irene A Kuling, and David A Abbink. 2016. Evaluation of haptic and visual cues for repulsive or attractive guidance in nonholonomic steering tasks. IEEE Transactions on Human-Machine Systems 46, 5 (2016), 672–683.",
      "doi": ""
    },
    {
      "text": "Thanh Mung Lam, Harmen Wigert Boschloo, Max Mulder, and Marinus M Van Paassen. 2009. Artificial force field for haptic feedback in UAV teleoperation. IEEE Transactions on Systems, Man, and Cybernetics-Part A: Systems and Humans 39, 6 (2009), 1316–1330.",
      "doi": "10.1109/TSMCA.2009.2028239"
    },
    {
      "text": "Robert W Lindeman, John L Sibert, Erick Mendez-Mendez, Sachin Patil, and Daniel Phifer. 2005. Effectiveness of directional vibrotactile cuing on a building-clearing task. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’05). 271–280.",
      "doi": "10.1145/1054972.1055010"
    },
    {
      "text": "Franck Mars, Mathieu Deroo, and Jean-Michel Hoc. 2014. Analysis of human-machine cooperation when driving with different degrees of haptic shared control. IEEE Transactions on Haptics 7, 3 (2014), 324–333.",
      "doi": ""
    },
    {
      "text": "Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Andrei A Rusu, Joel Veness, Marc G Bellemare, Alex Graves, Martin Riedmiller, Andreas K Fidjeland, and Georg Ostrovski. 2015. Human-level control through deep reinforcement learning. Nature 518, 7540 (2015), 529.",
      "doi": ""
    },
    {
      "text": "Hee-Seung Moon and Jiwon Seo. 2019. Prediction of human trajectory following a haptic robotic guide using recurrent neural networks. In 2019 IEEE World Haptics Conference (WHC). 157–162.",
      "doi": ""
    },
    {
      "text": "Hee-Seung Moon and Jiwon Seo. 2020. Dynamic difficulty adjustment via fast user adaptation. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology(UIST ’20 Adjunct). 13–15.",
      "doi": "10.1145/3379350.3418578"
    },
    {
      "text": "Hee-Seung Moon and Jiwon Seo. 2020. Sample-efficient training of robotic guide using human path prediction network. (2020). arXiv:2008.05054",
      "doi": ""
    },
    {
      "text": "Mark Mulder, David A Abbink, and Erwin R Boer. 2008. The effect of haptic guidance on curve negotiation behavior of young, experienced drivers. In 2008 IEEE International Conference on Systems, Man and Cybernetics (SMC). 804–809.",
      "doi": ""
    },
    {
      "text": "Mark Mulder, David A Abbink, and Erwin R Boer. 2012. Sharing control with haptics: Seamless driver support from manual to automatic control. Human Factors 54, 5 (2012), 786–798.",
      "doi": ""
    },
    {
      "text": "Carolina Passenberg, Antonia Glaser, and Angelika Peer. 2013. Exploring the design space of haptic assistants: The assistance policy module. IEEE Transactions on Haptics 6, 4 (2013), 440–452.",
      "doi": "10.1109/TOH.2013.34"
    },
    {
      "text": "Carlos Jesús Pérez-del Pulgar, Jan Smisek, Victor F Munoz, and André Schiele. 2016. Using learning from demonstration to generate real-time guidance for haptic shared control. In 2016 IEEE International Conference on Systems, Man, and Cybernetics (SMC). 3205–3210.",
      "doi": "10.1109/SMC.2016.7844727"
    },
    {
      "text": "Johannes Pfau, Jan David Smeddinck, Ioannis Bikas, and Rainer Malaka. 2020. Bot or not? User perceptions of player substitution with deep player behavior models. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). 1–10.",
      "doi": "10.1145/3313831.3376223"
    },
    {
      "text": "Susanne Poeller, Max V Birk, Nicola Baumann, and Regan L Mandryk. 2018. Let me be implicit: Using motive disposition theory to predict and explain behaviour in digital games. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). 1–15.",
      "doi": "10.1145/3173574.3173764"
    },
    {
      "text": "Maura Power, Hedyeh Rafii-Tari, Christos Bergeles, Valentina Vitiello, and Guang-Zhong Yang. 2015. A cooperative control framework for haptic guidance of bimanual surgical tasks based on learning from demonstration. In 2015 IEEE International Conference on Robotics and Automation (ICRA). 5330–5337.",
      "doi": ""
    },
    {
      "text": "Louis B Rosenberg. 1993. Virtual fixtures: Perceptual tools for telerobotic manipulation. In Proceedings of IEEE Virtual Reality Annual International Symposium. 76–82.",
      "doi": "10.1109/VRAIS.1993.380795"
    },
    {
      "text": "Edward Schmerling, Karen Leung, Wolf Vollprecht, and Marco Pavone. 2018. Multimodal probabilistic model-based planning for human-robot interaction. In 2018 IEEE International Conference on Robotics and Automation (ICRA). 1–9.",
      "doi": "10.1109/ICRA.2018.8460766"
    },
    {
      "text": "John Schulman, Sergey Levine, Pieter Abbeel, Michael Jordan, and Philipp Moritz. 2015. Trust region policy optimization. In Proceedings of the 32nd International Conference on Machine Learning (ICML). 1889–1897.",
      "doi": ""
    },
    {
      "text": "John Schulman, Filip Wolski, Prafulla Dhariwal, Alec Radford, and Oleg Klimov. 2017. Proximal policy optimization algorithms. (2017). arXiv:1707.06347",
      "doi": ""
    },
    {
      "text": "Dexter RR Scobee, Vicenc Rubies Royo, Claire J Tomlin, and S Shankar Sastry. 2018. Haptic assistance via inverse reinforcement learning. In 2018 IEEE International Conference on Systems, Man, and Cybernetics (SMC). 1510–1517.",
      "doi": "10.1109/SMC.2018.00262"
    },
    {
      "text": "Mario Selvaggio, P Robuffo Giordano, F Ficuciellol, and Bruno Siciliano. 2019. Passive task-prioritized shared-control teleoperation with haptic guidance. In 2019 International Conference on Robotics and Automation (ICRA). 430–436.",
      "doi": "10.1109/ICRA.2019.8794197"
    },
    {
      "text": "David Silver, Julian Schrittwieser, Karen Simonyan, Ioannis Antonoglou, Aja Huang, Arthur Guez, Thomas Hubert, Lucas Baker, Matthew Lai, and Adrian Bolton. 2017. Mastering the game of go without human knowledge. Nature 550, 7676 (2017), 354–359.",
      "doi": ""
    },
    {
      "text": "Jan Smisek, Emmanuel Sunil, Marinus M van Paassen, David A Abbink, and Max Mulder. 2016. Neuromuscular-system-based tuning of a haptic shared control interface for UAV teleoperation. IEEE Transactions on Human-Machine Systems 47, 4 (2016), 449–461.",
      "doi": ""
    },
    {
      "text": "Shintaro Tada, Kohei Sonoda, and Takahiro Wada. 2016. Simultaneous achievement of workload reduction and skill enhancement in backward parking by haptic guidance. IEEE Transactions on Intelligent Vehicles 1, 4 (2016), 292–301.",
      "doi": ""
    },
    {
      "text": "Akiko Teranishi, Timothy Mulumba, Georgios Karafotias, Jihad Mohamad Alja’Am, and Mohamad Eid. 2017. Effects of full/partial haptic guidance on handwriting skills development. In 2017 IEEE World Haptics Conference (WHC). 113–118.",
      "doi": ""
    },
    {
      "text": "Zheng Wang, Zhanhong Yan, and Kimihiko Nakano. 2019. Comfort-oriented haptic guidance steering via deep reinforcement learning for individualized lane keeping assist. In 2019 IEEE International Conference on Systems, Man and Cybernetics (SMC). 4283–4289.",
      "doi": "10.1109/SMC.2019.8914219"
    },
    {
      "text": "Zheng Wang, Rencheng Zheng, Tsutomu Kaizuka, Keisuke Shimono, and Kimihiko Nakano. 2017. The effect of a haptic guidance steering system on fatigue-related driver behavior. IEEE Transactions on Human-Machine Systems 47, 5 (2017), 741–748.",
      "doi": ""
    },
    {
      "text": "Dongbo Xiao and Roger Hubbold. 1998. Navigation guided by artificial force fields. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’98). 179–186.",
      "doi": "10.1145/274644.274671"
    },
    {
      "text": "Ehsan Zahedi, Javad Dargahi, Michael Kia, and Mehrdad Zadeh. 2017. Gesture-based adaptive haptic guidance: A comparison of discriminative and generative modeling approaches. IEEE Robotics and Automation Letters 2, 2 (2017), 1015–1022.",
      "doi": ""
    }
  ]
}