{
  "doi": "10.1145/3411764.3445091",
  "title": "Online Transgender Health Information Seeking: Facilitators, Barriers, and Future Directions",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Transgender people face difficulties accessing healthcare from providers, and thus often turn to online sources to seek health information. However, online platforms may not properly support trans health information seeking, and health information found online may be limited in accuracy. To examine how online platforms can best support trans health information seeking, we conducted online focus groups with trans people (n = 26) about their experiences with online health information and their needs and desires for online health information seeking platforms. We found that trans people face both facilitators and barriers to finding accurate, actionable information online. Facilitators include online community discovery, group privacy features, and the dual synchronous and asynchronous nature of online content. Barriers include platform censorship, misinformation, hate speech, and lack of tools to flag inaccurate content. We provide recommendations for how platforms can support trans health information seeking by ensuring that medical information is accurate, accessible, easy to locate, and relevant to a diverse set of trans identities and experiences.",
  "authors": [
    {
      "name": "Laima Augustaitis",
      "institution": "University of Michigan School of Information, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700872",
      "orcid": "missing"
    },
    {
      "name": "Leland A. Merrill",
      "institution": "Center for Sexuality & Health Disparities University of Michigan School of Nursing, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702068",
      "orcid": "missing"
    },
    {
      "name": "Kristi E Gamarel",
      "institution": "Health Behavior & Health Education University of Michigan School of Public Health, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702228",
      "orcid": "missing"
    },
    {
      "name": "Oliver L. Haimson",
      "institution": "University of Michigan, United States",
      "img": "/do/10.1145/contrib-87958760357/rel-imgonly/haimson.jpg",
      "acmid": "87958760357",
      "orcid": "0000-0001-6552-4540"
    }
  ],
  "references": [
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT Parents and Social Media: Advocacy, Privacy, and Disclosure During Shifting Social Movements. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 610–622. https://doi.org/10.1145/2858036.2858342",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, Austin, Texas, USA, 1125. https://doi.org/10.1145/2207676.2208560",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Judith Bradford, Sari L. Reisner, Julie A. Honnold, and Jessica Xavier. 2012. Experiences of Transgender-Related Discrimination and Implications for Health: Results From the Virginia Transgender Health Initiative Study. American Journal of Public Health 103, 10 (Nov. 2012), 1820–1829. https://doi.org/10.2105/AJPH.2012.300796Publisher: American Public Health Association.",
      "doi": ""
    },
    {
      "text": "Lauren Bussey and Elizabeth Sillence. 2017. (How) do People Negotiate Online Information into their Decision Making with Healthcare Professionals?. In Proceedings of the 2017 International Conference on Digital Health(DH ’17). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/3079452.3079495",
      "doi": "10.1145/3079452.3079495"
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer Visibility: Supporting LGBT+ Selective Visibility on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 250:1–250:12. https://doi.org/10.1145/3173574.3173824",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis. SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Yu Chi, Daqing He, Shuguang Han, and Jie Jiang. 2018. What Sources to Rely on: Laypeople’s Source Selection in Online Health Information Seeking. In Proceedings of the 2018 Conference on Human Information Interaction & Retrieval(CHIIR ’18). Association for Computing Machinery, New York, NY, USA, 233–236. https://doi.org/10.1145/3176349.3176881",
      "doi": "10.1145/3176349.3176881"
    },
    {
      "text": "Sabrina Cipolletta, Riccardo Votadoro, and Elena Faccio. 2017. Online support for transgender people: an analysis of forums and social networks. Health & Social Care in the Community 25, 5 (Sept. 2017), 1542–1551. https://doi.org/10.1111/hsc.12448",
      "doi": ""
    },
    {
      "text": "Kaitlin L. Costello. 2016. Impact of patient-provider communication on online health information behaviors in chronic illness. Proceedings of the Association for Information Science and Technology 53, 1 (2016), 1–10. https://doi.org/10.1002/pra2.2016.14505301060_eprint: https://asistdl.onlinelibrary.wiley.com/doi/pdf/10.1002/pra2.2016.14505301060.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Meredith Ringel Morris, and Ryen W. White. 2014. Seeking and sharing health information online: comparing search engines and social media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 1365–1376. https://doi.org/10.1145/2556288.2557214",
      "doi": "10.1145/2556288.2557214"
    },
    {
      "text": "Madeline B. Deutsch. 2016. Evaluation of Patient-Oriented, Internet-Based Information on Gender-Affirming Hormone Treatments. LGBT Health 3, 3 (June 2016), 200–207. https://doi.org/10.1089/lgbt.2015.0116",
      "doi": ""
    },
    {
      "text": "Michael Ann Devito, Ashley Marie Walker, and Jeremy Birnholtz. 2018. “Too Gay for Facebook”: Presenting LGBTQ+ Identity Throughout the Personal Social Media Ecosystem. Proceedings of the ACM Human Computer Interaction (PACM) 2, CSCW(2018), 23.",
      "doi": "10.1145/3274313"
    },
    {
      "text": "Aubri A. Drake and Arlene Bielefield. 2017. Equitable access: Information seeking behavior, information needs, and necessary library accommodations for transgender patrons. Library & Information Science Research 39, 3 (July 2017), 160–168. https://doi.org/10.1016/j.lisr.2017.06.002",
      "doi": ""
    },
    {
      "text": "Brianna Dym, Jed R. Brubaker, Casey Fiesler, and Bryan Semaan. 2019. ”Coming Out Okay”: Community Narratives for LGBTQ Identity Recovery Work. Proc. ACM Hum.-Comput. Interact. 3, CSCW (Nov. 2019), 154:1–154:28. https://doi.org/10.1145/3359256",
      "doi": "10.1145/3359256"
    },
    {
      "text": "Pelle Ehn, Elisabet M. Nilsson, and Richard Topgaard. 2014. Making Futures. https://mitpress.mit.edu/books/making-futures",
      "doi": ""
    },
    {
      "text": "Sheena Erete, Aarti Israni, and Tawanna Dillahunt. 2018. An intersectional approach to designing in the margins. Interactions 25, 3 (April 2018), 66–69. https://doi.org/10.1145/3194349",
      "doi": "10.1145/3194349"
    },
    {
      "text": "Yolanda N. Evans, Samantha J. Gridley, Julia Crouch, Alicia Wang, Megan A. Moreno, Kym Ahrens, and David J. Breland. 2017. Understanding Online Resource Use by Transgender Youth and Caregivers: A Qualitative Study. Transgender Health 2, 1 (Aug. 2017), 129–139. https://doi.org/10.1089/trgh.2017.0011",
      "doi": ""
    },
    {
      "text": "Susannah Fox. 2014. The social life of health information. https://www.pewresearch.org/fact-tank/2014/01/15/the-social-life-of-health-information/",
      "doi": ""
    },
    {
      "text": "Spencer Garrison. 2018. On the Limits of “Trans Enough”: Authenticating Trans Identity Narratives. Gender & Society 32, 5 (Oct. 2018), 613–637. https://doi.org/10.1177/0891243218780299",
      "doi": ""
    },
    {
      "text": "Cally Gatehouse, Matthew Wood, Jo Briggs, James Pickles, and Shaun Lawson. 2018. Troubling Vulnerability: Designing with LGBT Young People’s Ambivalence Towards Hate Crime Reporting. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 109:1–109:13. https://doi.org/10.1145/3173574.3173683",
      "doi": "10.1145/3173574.3173683"
    },
    {
      "text": "Amira Ghenai, Mark D. Smucker, and Charles L.A. Clarke. 2020. A Think-Aloud Study to Understand Factors Affecting Online Health Search. In Proceedings of the 2020 Conference on Human Information Interaction and Retrieval(CHIIR ’20). Association for Computing Machinery, New York, NY, USA, 273–282. https://doi.org/10.1145/3343413.3377961",
      "doi": "10.1145/3343413.3377961"
    },
    {
      "text": "Oliver L. Haimson. 2018. Social Media as Social Transition Machinery. Proc. ACM Hum.-Comput. Interact. 2, CSCW (Nov. 2018), 63:1–63:27. https://doi.org/10.1145/3274332",
      "doi": "10.1145/3274332"
    },
    {
      "text": "Oliver L. Haimson, Anne E. Bowser, Edward F. Melcer, and Elizabeth F. Churchill. 2015. Online Inspiration and Exploration for Identity Reinvention. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 3809–3818. https://doi.org/10.1145/2702123.2702270",
      "doi": "10.1145/2702123.2702270"
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). ACM, New York, NY, USA, 1176–1190. https://doi.org/10.1145/2675133.2675152",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2016. Digital Footprints and Changing Networks During Online Identity Transitions. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 2895–2907. https://doi.org/10.1145/2858036.2858136",
      "doi": "10.1145/2858036.2858136"
    },
    {
      "text": "Oliver L Haimson, Justin Buss, Zu Weinger, Denny L Starks, Dykee Gorrell, and Briar Sweetbriar Baron. 2020. Trans Time: Safety, Privacy, and Content Warnings on a Transgender-Specific Social Media Site. Proc. ACM Hum.-Comput. Interact. 4, CSCW (2020), 27.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Avery Dame-Griff, Elias Capello, and Zahari Richter. 2019. Tumblr was a trans technology: the meaning, importance, history, and future of trans technologies. Feminist Media Studies (Oct. 2019), 1–17. https://doi.org/10.1080/14680777.2019.1678505",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson and Anna Lauren Hoffmann. 2016. Constructing and enforcing ”authentic” identity online: Facebook, real names, and non-normative identities. First Monday 21, 6 (June 2016). https://doi.org/10.5210/fm.v21i6.6791",
      "doi": ""
    },
    {
      "text": "Foad Hamidi, Morgan Klaus Scheuerman, and Stacy M. Branham. 2018. Gender Recognition or Gender Reductionism?: The Social Implications of Embedded Gender Recognition Systems. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 8:1–8:13. https://doi.org/10.1145/3173574.3173582",
      "doi": "10.1145/3173574.3173582"
    },
    {
      "text": "Benjamin Hanckel, Son Vivienne, Paul Byron, Brady Robards, and Brendan Churchill. 2019. ‘That’s not necessarily for them’: LGBTIQ+ young people, social media platform affordances and identity curation. Media, Culture & Society (May 2019), 0163443719846612. https://doi.org/10.1177/0163443719846612",
      "doi": ""
    },
    {
      "text": "Derek L Hansen, Holly A Derry, Paul J Resnick, and Caroline R Richardson. 2003. Adolescents Searching for Health Information on the Internet: An Observational Study. Journal of Medical Internet Research 5, 4 (Oct. 2003), e25. https://doi.org/10.2196/jmir.5.4.e25",
      "doi": ""
    },
    {
      "text": "Jean Hardy and Silvia Lindtner. 2017. Constructing a Desiring User: Discourse, Rurality, and Design in Location-Based Social Networks. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). ACM, New York, NY, USA, 13–25. https://doi.org/10.1145/2998181.2998347",
      "doi": "10.1145/2998181.2998347"
    },
    {
      "text": "Jean Hardy and Stefani Vargas. 2019. Participatory Design and the Future of Rural LGBTQ Communities. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion - DIS ’19 Companion. ACM Press, San Diego, CA, USA, 195–199. https://doi.org/10.1145/3301019.3323894",
      "doi": "10.1145/3301019.3323894"
    },
    {
      "text": "Blake Hawkins and Jack Giesking. 2017. Seeking ways to our transgender bodies, by ourselves: Rationalizing transgender-specific health information behaviors. Proceedings of the Association for Information Science and Technology 54, 1 (Jan. 2017), 702–704. https://doi.org/10.1002/pra2.2017.14505401122",
      "doi": ""
    },
    {
      "text": "Blake W. Hawkins and Oliver Haimson. 2018. Building an Online Community of Care: Tumblr Use by Transgender Individuals. In Proceedings of the 4th Conference on Gender & IT(GenderIT ’18). ACM, New York, NY, USA, 75–77. https://doi.org/10.1145/3196839.3196853",
      "doi": ""
    },
    {
      "text": "Katrina L. Hinson. 2017. Framing illness through Facebook enabled online support groups. Communication Design Quarterly 4, 2b (March 2017), 22–31. https://doi.org/10.1145/3068755.3068758",
      "doi": "10.1145/3068755.3068758"
    },
    {
      "text": "Laura Horak. 2014. Trans on YouTube Intimacy, Visibility, Temporality. TSQ: Transgender Studies Quarterly 1, 4 (Nov. 2014), 572–585. https://doi.org/10.1215/23289252-2815255",
      "doi": ""
    },
    {
      "text": "Maia Jacobs, Galina Gheihman, Krzysztof Z. Gajos, and Anoopum S. Gupta. 2019. ”I think we know more than our doctors”: How Primary Caregivers Manage Care Teams with Limited Disease-related Expertise. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 159:1–159:22. https://doi.org/10.1145/3359261",
      "doi": "10.1145/3359261"
    },
    {
      "text": "Kim D. Jaffee, Deirdre A. Shires, and Daphna Stroumsa. 2016. Discrimination and Delayed Health Care Among Transgender Women and Men: Implications for Improving Medical Education and Health Care Delivery. Medical Care 54, 11 (Nov. 2016), 1010–1016. https://doi.org/10.1097/MLR.0000000000000583",
      "doi": ""
    },
    {
      "text": "Sandy E. James, Jody L. Herman, Susan Rankin, Mara Keisling, Lisa Mottet, and Ma’ayan Anafi. 2016. The Report of the 2015 U.S. Transgender Survey. Technical Report. National Center for Transgender Equality, Washington, DC. http://www.transequality.org/sites/default/files/docs/USTS-Full-Report-FINAL.PDF",
      "doi": ""
    },
    {
      "text": "Grace J. Johnson and Paul J. Ambrose. 2006. Neo-tribes: the power and potential of online communities in health care. Commun. ACM 49, 1 (Jan. 2006), 107–113. https://doi.org/10.1145/1107458.1107463",
      "doi": "10.1145/1107458.1107463"
    },
    {
      "text": "Amir Karami, Frank Webb, and Vanessa L. Kitzie. 2018. Characterizing Transgender Health Issues in Twitter. In Proceedings of the Association for Information Science and Technology. http://arxiv.org/abs/1808.06022 arXiv:1808.06022.",
      "doi": ""
    },
    {
      "text": "Os Keyes. 2018. The Misgendering Machines: Trans/HCI Implications of Automatic Gender Recognition. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 88. https://doi.org/10.1145/3274357",
      "doi": "10.1145/3274357"
    },
    {
      "text": "Roderick Lamar Lee and Lynette M. Kvasny. 2014. Understanding the role of social media in online health: A global perspective on online social support. First Monday (2014). https://doi.org/10.5210/fm.v19i1.4048",
      "doi": ""
    },
    {
      "text": "Ada Lerner, Helen Yuxun He, Anna Kawakami, Silvia Catherine Zeamer, and Roberto Hoyle. 2020. Privacy and Activism in the Transgender Community. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–13. https://doi.org/10.1145/3313831.3376339",
      "doi": "10.1145/3313831.3376339"
    },
    {
      "text": "Calvin A. Liang, Katie Albertson, Florence Williams, David Inwards-Breland, Sean A. Munson, Julie A. Kientz, and Kym Ahrens. 2020. Designing an online sex education resource for gender-diverse youth. In Proceedings of the Interaction Design and Children Conference(IDC ’20). Association for Computing Machinery, London, United Kingdom, 108–120. https://doi.org/10.1145/3392063.3394404",
      "doi": "10.1145/3392063.3394404"
    },
    {
      "text": "Yuting Liao. 2019. Sharing Personal Health Information on Social Media: Balancing Self-presentation and Privacy. In Proceedings of the 10th International Conference on Social Media and Society(SMSociety ’19). Association for Computing Machinery, New York, NY, USA, 194–204. https://doi.org/10.1145/3328529.3328560",
      "doi": "10.1145/3328529.3328560"
    },
    {
      "text": "Haley MacLeod, Kim Oakes, Danika Geisler, Kay Connelly, and Katie Siek. 2015. Rare World: Towards Technology for Rare Diseases. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15. ACM Press, Seoul, Republic of Korea, 1145–1154. https://doi.org/10.1145/2702123.2702494",
      "doi": "10.1145/2702123.2702494"
    },
    {
      "text": "Joshua C. Magee, Louisa Bigelow, Samantha DeHaan, and Brian S. Mustanski. 2012. Sexual Health Information Seeking Online A Mixed-Methods Study Among Lesbian, Gay, Bisexual, and Transgender Young People. Health Education & Behavior 39, 3 (June 2012), 276–289. https://doi.org/10.1177/1090198111401384",
      "doi": ""
    },
    {
      "text": "Kimberly J. Mitchell, Michele L. Ybarra, Josephine D. Korchmaros, and Joseph G. Kosciw. 2014. Accessing sexual health information online: use, motivations and consequences for youth with different sexual orientations. Health Education Research 29, 1 (Feb. 2014), 147–157. https://doi.org/10.1093/her/cyt071Publisher: Oxford Academic.",
      "doi": ""
    },
    {
      "text": "Viviane Namaste. 2000. Invisible Lives: The Erasure of Transsexual and Transgendered People. University of Chicago Press. Google-Books-ID: Pq5jwRVbvY8C.",
      "doi": ""
    },
    {
      "text": "Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It’s not that i don’t have problems, i’m just not putting them on facebook: challenges and opportunities in using online social networks for health. In Proceedings of the ACM 2011 conference on Computer supported cooperative work(CSCW ’11). ACM, New York, NY, USA, 341–350. https://doi.org/10.1145/1958824.1958876",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela D. R. Smith, Alexandra To, and Kentaro Toyama. 2020. Critical Race Theory for HCI. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems. 16.",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Hyun Jung Oh, Carolyn Lauckner, Jan Boehmer, Ryan Fewins-Bliss, and Kang Li. 2013. Facebooking for health: An examination into the solicitation and effects of health-related social support on social networking sites. Computers in Human Behavior 29, 5 (Sept. 2013), 2072–2080. https://doi.org/10.1016/j.chb.2013.04.017",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2021. Constitution. https://www.who.int/about/who-we-are/constitution",
      "doi": ""
    },
    {
      "text": "Sherry Pagoto, Molly E. Waring, and Ran Xu. 2019. A Call for a Public Health Agenda for Social Media Research. Journal of Medical Internet Research 21, 12 (2019), e16661. https://doi.org/10.2196/16661Company: Journal of Medical Internet Research Distributor: Journal of Medical Internet Research Institution: Journal of Medical Internet Research Label: Journal of Medical Internet Research Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Aira Maria Pohjanen and Terttu Anna Maarit Kortelainen. 2015. Transgender information behaviour. Journal of Documentation 72, 1 (Dec. 2015), 172–190. https://doi.org/10.1108/JD-04-2015-0043",
      "doi": ""
    },
    {
      "text": "Tonia Poteat, Danielle German, and Deanna Kerrigan. 2013. Managing uncertainty: A grounded theory of stigma in transgender health care encounters. Social Science & Medicine 84 (May 2013), 22–29. https://doi.org/10.1016/j.socscimed.2013.02.019",
      "doi": ""
    },
    {
      "text": "Jay Prosser. 1998. Second Skins: The Body Narratives of Transsexuality. Columbia University Press.",
      "doi": ""
    },
    {
      "text": "Sari L. Reisner, Renee K. Randazzo, Jaclyn M. White Hughto, Sarah Peitzmeier, L. Zachary DuBois, Dana J. Pardee, Elliot Marrow, Sarah McLean, and Jennifer Potter. 2018. Sensitive Health Topics With Underserved Patient Populations: Methodological Considerations for Online Focus Group Discussions. Qualitative Health Research 28, 10 (Aug. 2018), 1658–1673. https://doi.org/10.1177/1049732317705355",
      "doi": ""
    },
    {
      "text": "Koustuv Saha, Sang Chan Kim, Manikanta D. Reddy, Albert J. Carter, Eva Sharma, Oliver L. Haimson, and Munmun De Choudhury. 2019. The Language of LGBTQ+ Minority Stress Experiences on Social Media. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 89:1–89:22. https://doi.org/10.1145/3361108",
      "doi": "10.1145/3361108"
    },
    {
      "text": "Morgan Klaus Scheuerman, Stacy M. Branham, and Foad Hamidi. 2018. Safe Spaces and Safe Places: Unpacking Technology-Mediated Experiences of Safety and Harm with Transgender People. Proc. ACM Hum.-Comput. Interact. 2, CSCW (Nov. 2018), 155:1–155:27. https://doi.org/10.1145/3274424",
      "doi": "10.1145/3274424"
    },
    {
      "text": "Morgan Klaus Scheuerman, Jacob M. Paul, and Jed R. Brubaker. 2019. How Computers See Gender: An Evaluation of Gender Classification in Commercial Facial Analysis and Image Labeling Services. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 33. https://dl.acm.org/doi/abs/10.1145/3359246",
      "doi": "10.1145/3359246"
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. Proceedings of CHI (2017). https://pdfs.semanticscholar.org/27b4/9a706d907c5d6858068ba97bbe873fcf687f.pdf",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Kristie L. Seelman, Matthew J.P. Colón-Diaz, Rebecca H. LeCroix, Marik Xavier-Brier, and Leonardo Kattari. 2017. Transgender Noninclusive Healthcare and Delaying Care Because of Fear: Connections to General Health and Mental Health Among Transgender Adults. Transgender Health 2, 1 (Feb. 2017), 17–28. https://doi.org/10.1089/trgh.2016.0024",
      "doi": ""
    },
    {
      "text": "Ellen Selkie, Victoria Adkins, Ellie Masters, Anita Bajpai, and Daniel Shumer. 2019. Transgender Adolescents’ Uses of Social Media for Social Support. Journal of Adolescent Health (Nov. 2019). https://doi.org/10.1016/j.jadohealth.2019.08.011",
      "doi": ""
    },
    {
      "text": "Laura Silver and Christine Huang. 2019. Social activities, information seeking on subjects like health and education top the list of mobile activities. https://www.pewresearch.org/internet/2019/08/22/social-activities-information-seeking-on-subjects-like-health-and-education-top-the-list-of-mobile-activities/",
      "doi": ""
    },
    {
      "text": "Denny L. Starks, Tawanna Dillahunt, and Oliver L. Haimson. 2019. Designing Technology to Support Safety for Transgender Women & Non-Binary People of Color. In Companion Publication of the 2019 Designing Interactive Systems Conference(DIS ’19 Companion). ACM, New York, NY, USA, 289–294. https://doi.org/10.1145/3301019.3323898event-place: San Diego, CA, USA.",
      "doi": "10.1145/3301019.3323898"
    },
    {
      "text": "Allucquère Rosanne (Sandy) Stone. 1987. The Empire Strikes Back: A Posttranssexual Manifesto. http://sandystone.com/empire-strikes-back.pdf",
      "doi": ""
    },
    {
      "text": "Yalin Sun and Yan Zhang. 2016. Individual Differences and Online Health Information Source Selection. In Proceedings of the 2016 ACM on Conference on Human Information Interaction and Retrieval(CHIIR ’16). Association for Computing Machinery, New York, NY, USA, 321–324. https://doi.org/10.1145/2854946.2854989",
      "doi": "10.1145/2854946.2854989"
    },
    {
      "text": "Ashley Marie Walker and Michael Ann DeVito. 2020. ”’More gay’ fits in better”: Intracommunity Power Dynamics and Harms in Online LGBTQ+ Spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–15. https://doi.org/10.1145/3313831.3376497",
      "doi": "10.1145/3313831.3376497"
    },
    {
      "text": "Andrea L. Wirtz, Erin E. Cooney, Aeysha Chaudhry, Sari L. Reisner, and American Cohort To Study HIV Acquisition Among Transgender Women (LITE). 2019. Computer-Mediated Communication to Facilitate Synchronous Online Focus Group Discussions: Feasibility Study for Qualitative HIV Research Among Transgender Women Across the United States. Journal of Medical Internet Research 21, 3 (2019), e12569. https://doi.org/10.2196/12569Company: Journal of Medical Internet Research Distributor: Journal of Medical Internet Research Institution: Journal of Medical Internet Research Label: Journal of Medical Internet Research Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    }
  ]
}