{
  "doi": "10.1145/3411764.3445220",
  "title": "ShrinCage: 4D Printing Accessories that Self-Adapt",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "3D printing technology makes Do-It-Yourself and reforming everyday objects a reality. However, designing and fabricating attachments that can seamlessly adapt existing objects to extended functionality is a laborious process, which requires accurate measuring, modeling, manufacturing, and assembly. This paper presents ShrinCage, a 4D printing system that allows novices to easily create shrinkable adaptations to fit and fasten existing objects. Specifically, the design tool presented in this work aid in the design of attachment that adapts to irregular morphologies, which accommodates the variations in measurements and fabrication, subsequently simplifying the modeling and assembly processes. We further conduct mechanical tests and user studies to evaluate the availability and feasibility of this method. Numerous application examples created by ShrinCage prove that it can be adopted by aesthetic modification, assistive technology, repair, upcycling, and augmented 3D printing.",
  "tags": [
    "Shape-changing interfaces",
    "3D printing",
    "Do-It-Yourself",
    "4D printing",
    "Self-adaptation",
    "Design tool"
  ],
  "authors": [
    {
      "name": "Lingyun Sun",
      "institution": "International Design Institute of Zhejiang University and Zhejiang Key Laboratory of Design and Intelligence and Digital Creativity, Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659025067",
      "orcid": "0000-0002-5561-0493"
    },
    {
      "name": "Yue Yang",
      "institution": "Zhejiang University, China",
      "img": "/do/10.1145/contrib-99659527017/rel-imgonly/___.jpeg",
      "acmid": "99659527017",
      "orcid": "0000-0002-1771-8057"
    },
    {
      "name": "Yu Chen",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528259",
      "orcid": "missing"
    },
    {
      "name": "Jiaji Li",
      "institution": "Zhejiang University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529777",
      "orcid": "0000-0002-8864-2061"
    },
    {
      "name": "Danli Luo",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588096",
      "orcid": "0000-0001-6459-2859"
    },
    {
      "name": "Haolin Liu",
      "institution": "Mechanical Engineering Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659588952",
      "orcid": "missing"
    },
    {
      "name": "Lining Yao",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261439",
      "orcid": "0000-0002-8842-2317"
    },
    {
      "name": "Ye Tao",
      "institution": "Zhejiang University City College, China",
      "img": "/do/10.1145/contrib-87258822957/rel-imgonly/tao_2015.jpg",
      "acmid": "87258822957",
      "orcid": "0000-0002-9152-7793"
    },
    {
      "name": "Guanyun Wang",
      "institution": "Zhejiang University, China",
      "img": "/do/10.1145/contrib-87258679957/rel-imgonly/20201100____v6.jpg",
      "acmid": "87258679957",
      "orcid": "0000-0002-7904-1504"
    }
  ],
  "references": [
    {
      "text": "Yoh Akiyama, Homei Miyashita. 2016. Fitter: A system for easily printing objects that fit real objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, 129-131. DOI: https://doi.org/10.1145/2984751.2985730.",
      "doi": "10.1145/2984751.2985730"
    },
    {
      "text": "Byoungkwon An, Ye Tao, Jianzhe Gu, Tingyu Cheng, Xiang'Anthony' Chen, Xiaoxiao Zhang, Wei Zhao, Youngwook Do, Shigeo Takahashi, Hsiang-Yun Wu, Teng Zhang, Lining Yao. 2018. Thermorph: Democratizing 4D Printing of Self-Folding Materials and Interfaces. In Proceedings of the 36th Annual ACM Conference on Human Factors in Computing Systems (CHI 2018), 260. DOI: https://doi.org/10.1145/3173574.3173834.",
      "doi": "10.1145/3173574.3173834"
    },
    {
      "text": "Marc Behl, Andreas Lendlein. 2011. Shape‐memory polymers. Kirk‐Othmer Encyclopedia of Chemical Technology, 1-16. DOI: https://doi.org/10.1002/0471238961.1908011612051404.a01.pub2.",
      "doi": ""
    },
    {
      "text": "Ben Bridgens, Mark Powell, Graham Farmer, Claire Walsh, Eleanor Reed, Mohammad Royapoor, Peter Gosling, Jean Hall, Oliver Heidrich. 2018. Creative upcycling: Reconnecting people, materials and place through making. Journal of Cleaner Production 189, 145-154. DOI: https://doi.org/10.1016/j.jclepro.2018.03.317.",
      "doi": ""
    },
    {
      "text": "'Anthony' Xiang Chen, Stelian Coros, Scott E Hudson. 2018. Medley: A Library of Embeddables to Explore Rich Material Properties for 3D Printed Objects. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 162. DOI: https://doi.org/10.1145/3173574.3173736.",
      "doi": "10.1145/3173574.3173736"
    },
    {
      "text": "'Anthony' Xiang Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, Scott E Hudson. 2016. Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, 29-39. DOI: https://doi.org/10.1145/2984511.2984512.",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Xiang “Anthony” Chen, Ye Tao, Guanyun Wang, Runchang Kang, Tovi Grossman, Stelian Coros, Scott E. Hudson. 2018. Forte: User-Driven Generative Design. In Proceedings of the 36th Annual ACM Conference on Human Factors in Computing Systems (CHI 2018), Paper 496. DOI: https://doi.org/10.1145/3173574.3174070.",
      "doi": ""
    },
    {
      "text": "Xiang'Anthony' Chen, Stelian Coros, Jennifer Mankoff, Scott E Hudson. 2015. Encore: 3D printed augmentation of everyday objects with printed-over, affixed and interlocked attachments. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, 73-82. DOI: https://doi.org/10.1145/2807442.2807498.",
      "doi": "10.1145/2807442.2807498"
    },
    {
      "text": "Claudia Daudén Roquet, Jeeeun Kim, Tom Yeh. 2016. 3D Folded PrintGami: transforming passive 3D printed objects to interactive by inserted paper origami circuits. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems, 187-191. DOI: https://doi.org/10.1145/2901790.2901891.",
      "doi": "10.1145/2901790.2901891"
    },
    {
      "text": "Jack Forman, Mustafa Doga Dogan, Hamilton Forsythe, Hiroshi Ishii. 2020. DefeXtiles: 3D Printing Quasi-Woven Fabric via Under-Extrusion. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology, 1222-1233. DOI: https://doi.org/10.1145/3379337.3415876.",
      "doi": "10.1145/3379337.3415876"
    },
    {
      "text": "Sascha Friesike, Christoph M Flath, Marco Wirth, Frédéric Thiesse. 2019. Creativity and productivity in product design for additive manufacturing: Mechanisms and platform outcomes of remixing. Journal of Operations Management 65, 735-752. DOI: https://doi.org/10.1016/j.jom.2018.10.004.",
      "doi": "10.1016/j.jom.2018.10.004"
    },
    {
      "text": "Jan W Gooch. 2010. Encyclopedic dictionary of polymers. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Daniel Groeger, Elena Chong Loo, Jürgen Steimle. 2016. Hotflex: Post-print customization of 3d prints using embedded state change. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 420-432. DOI: https://doi.org/10.1145/2858036.2858191.",
      "doi": "10.1145/2858036.2858191"
    },
    {
      "text": "Jianzhe Gu, David E Breen, Jenny Hu, Lifeng Zhu, Ye Tao, Tyson Van de Zande, Guanyun Wang, Yongjie Jessica Zhang, Lining Yao. 2019. Geodesy: Self-rising 2.5 D Tiles by Printing along 2D Geodesic Closed Path. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 37. DOI: https://doi.org/10.1145/3290605.3300267.",
      "doi": "10.1145/3290605.3300267"
    },
    {
      "text": "Anhong Guo, Jeeeun Kim, Xiang'Anthony' Chen, Tom Yeh, Scott E Hudson, Jennifer Mankoff, Jeffrey P Bigham. 2017. Facade: Auto-generating tactile interfaces to appliances. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 5826-5838. DOI: https://doi.org/10.1145/3025453.3025845.",
      "doi": "10.1145/3025453.3025845"
    },
    {
      "text": "Megan Hofmann, Gabriella Hann, Scott E Hudson, Jennifer Mankoff. 2018. Greater than the sum of its PARTs: Expressing and reusing design intent in 3D models. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 1-12. DOI: https://doi.org/10.1145/3173574.3173875.",
      "doi": "10.1145/3173574.3173875"
    },
    {
      "text": "Megan Hofmann, Kristin Williams, Toni Kaplan, Stephanie Valencia, Gabriella Hann, Scott E Hudson, Jennifer Mankoff, Patrick Carrington. 2019. \" Occupational Therapy is Making\" Clinical Rapid Prototyping and Digital Fabrication. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1-13. DOI: https://doi.org/10.1145/3290605.3300544.",
      "doi": "10.1145/3290605.3300544"
    },
    {
      "text": "Nathaniel Hudson, Celena Alcock, Parmit K Chilana. 2016. Understanding newcomers to 3D printing: Motivations, workflows, and barriers of casual makers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, 384-396. DOI: https://doi.org/10.1145/2858036.2858266.",
      "doi": "10.1145/2858036.2858266"
    },
    {
      "text": "Scott E Hudson. 2014. Printing teddy bears: a technique for 3D printing of soft interactive objects. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14, 459-468. DOI: https://doi.org/10.1145/2556288.2557338.",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Amy Hurst, Shaun Kane. 2013. Making\" making\" accessible. In Proceedings of the 12th international conference on interaction design and children, 635-638. DOI: https://doi.org/10.1145/2485760.2485883.",
      "doi": "10.1145/2485760.2485883"
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, Patrick Baudisch. 2016. Metamaterial mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology, 529-539. DOI: https://doi.org/10.1145/2984511.2984540.",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Alexandra Ion, Robert Kovacs, Oliver S Schneider, Pedro Lopes, Patrick Baudisch. 2018. Metamaterial Textures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 336. DOI: https://doi.org/10.1145/3173574.3173910.",
      "doi": ""
    },
    {
      "text": "Jeeeun Kim, Anhong Guo, Tom Yeh, Scott E. Hudson, Jennifer Mankoff. 2017. Understanding Uncertainty in Measurement and Accommodating its Impact in 3D Modeling and Printing. In Proceedings of the 2017 Conference on Designing Interactive Systems, 1067–1078. DOI: https://doi.org/10.1145/3064663.3064690.",
      "doi": "10.1145/3064663.3064690"
    },
    {
      "text": "Yuki Koyama, Shinjiro Sueda, Emma Steinhardt, Takeo Igarashi, Ariel Shamir, Wojciech Matusik. 2015. AutoConnect: computational design of 3D-printable connectors. ACM Transactions on Graphics (TOG) 34, 1-11. DOI: https://doi.org/10.1145/2816795.2818060.",
      "doi": "10.1145/2816795.2818060"
    },
    {
      "text": "Gierad Laput, Xiang'Anthony' Chen, Chris Harrison. 2015. 3D printed hair: Fused deposition modeling of soft strands, fibers, and bristles. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, 593-597. DOI: https://doi.org/10.1145/2807442.2807484.",
      "doi": "10.1145/2807442.2807484"
    },
    {
      "text": "Joanne Lo, Eric Paulos. 2014. ShrinkyCircuits: sketching, shrinking, and formgiving for electronic circuits. In Proceedings of the 27th annual ACM symposium on User interface software and technology, 291-299. DOI: https://doi.org/10.1145/2642918.2647421.",
      "doi": "10.1145/2642918.2647421"
    },
    {
      "text": "Shiran Magrisso, Moran Mizrahi, Amit Zoran. 2018. Digital Joinery For Hybrid Carpentry. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 167. DOI: https://doi.org/10.1145/3173574.3173741.",
      "doi": "10.1145/3173574.3173741"
    },
    {
      "text": "Stefanie Mueller, Sangha Im, Serafima Gurevich, Alexander Teibrich, Lisa Pfisterer, Guimbreti, Fran re, Patrick Baudisch. 2014. WirePrint: 3D printed previews for fast prototyping. In Proceedings of the 27th annual ACM Symposium on User Interface Software and Technology, 273-280. DOI: https://doi.org/10.1145/2642918.2647359.",
      "doi": "10.1145/2642918.2647359"
    },
    {
      "text": "Stefanie Mueller, Tobias Mohr, Kerstin Guenther, Johannes Frohnhofen, Patrick Baudisch. 2014. faBrickation: fast 3D printing of functional objects by integrating construction kit building blocks. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14, 3827-3834. DOI: https://doi.org/10.1145/2556288.2557005.",
      "doi": "10.1145/2556288.2557005"
    },
    {
      "text": "Martin Nisser, Junyi Zhu, Tianye Chen, Katarina Bulovic, Parinya Punpongsanon, Stefanie Mueller. 2019. Sequential Support: 3D Printing Dissolvable Support Material for Time-Dependent Mechanisms. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction, 669-676. DOI: https://doi.org/10.1145/3294109.3295630.",
      "doi": "10.1145/3294109.3295630"
    },
    {
      "text": "Simon Olberding, Sergio Soto Ortega, Klaus Hildebrandt, Jürgen Steimle. 2015. Foldio: Digital fabrication of interactive and shape-changing objects with foldable printed electronics. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST ’15, 223-232. DOI: https://doi.org/10.1145/2807442.2807494.",
      "doi": "10.1145/2807442.2807494"
    },
    {
      "text": "Jifei Ou, Gershon Dublon, Chin-Yi Cheng, Felix Heibeck, Karl Willis, Hiroshi Ishii. 2016. Cilllia: 3D printed micro-pillar structures for surface texture, actuation and sensing. In Proceedings of the CHI 2016, 5753-5764. DOI: https://doi.org/10.1145/2858036.2858257.",
      "doi": "10.1145/2858036.2858257"
    },
    {
      "text": "Huaishu Peng, Jimmy Briggs, Cheng-Yao Wang, Kevin Guo, Joseph Kider, Stefanie Mueller, Patrick Baudisch, François Guimbretière. 2018. RoMA: Interactive Fabrication with Augmented Reality and a Robotic 3D Printer. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 579. DOI: https://doi.org/10.1145/3173574.3174153.",
      "doi": "10.1145/3173574.3174153"
    },
    {
      "text": "Huaishu Peng, Jennifer Mankoff, Scott E Hudson, James McCann. 2015. A layered fabric 3D printer for soft interactive objects. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, 1789-1798. DOI: https://doi.org/10.1145/2702123.2702327.",
      "doi": "10.1145/2702123.2702327"
    },
    {
      "text": "Huaishu Peng, Amit Zoran, François V Guimbretière. 2015. D-Coil: A Hands-on Approach to Digital 3D Models Design. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, 1807-1815. DOI: https://doi.org/10.1145/2702123.2702381.",
      "doi": "10.1145/2702123.2702381"
    },
    {
      "text": "Parinya Punpongsanon, Xin Wen, David S Kim, Stefanie Mueller. 2018. ColorMod: Recoloring 3D Printed Objects using Photochromic Inks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 213. DOI: https://doi.org/10.1145/3173574.3173787.",
      "doi": "10.1145/3173574.3173787"
    },
    {
      "text": "Michael L Rivera, Melissa Moukperian, Daniel Ashbrook, Jennifer Mankoff, Scott E Hudson. 2017. Stretching the bounds of 3D printing with embedded textiles. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 497-508. DOI: https://doi.org/10.1145/3025453.3025460.",
      "doi": "10.1145/3025453.3025460"
    },
    {
      "text": "Martin Schmitz, Jürgen Steimle, Jochen Huber, Niloofar Dezfuli, Max Mühlhäuser. 2017. Flexibles: deformation-aware 3D printed tangibles for capacitive touchscreens. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 1001-1014. DOI: https://doi.org/10.1145/3025453.3025663.",
      "doi": "10.1145/3025453.3025663"
    },
    {
      "text": "Lingyun Sun, Yue Yang, Yu Chen, Jiaji Li, Guanyun Wang, Ye Tao, Lining Yao. 2020. ShrinkyKit: 3D Printing Shrinkable Adaptations for Everyday Objects. In Proceedings of the Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, 1-7. DOI: https://doi.org/10.1145/3334480.3383034.",
      "doi": "10.1145/3334480.3383034"
    },
    {
      "text": "Saiganesh Swaminathan, Kadri Bugra Ozutemiz, Carmel Majidi, Scott E Hudson. 2019. FiberWire: Embedding Electronic Function into 3D Printed Mechanically Strong, Lightweight Carbon Fiber Composite Objects. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1-11. DOI: https://doi.org/10.1145/3290605.3300797.",
      "doi": "10.1145/3290605.3300797"
    },
    {
      "text": "Haruki Takahashi, Jeeeun Kim. 2019. 3D pen+ 3D printer: Exploring the role of humans and fabrication machines in creative making. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1-12. DOI: https://doi.org/10.1145/3290605.3300525.",
      "doi": "10.1145/3290605.3300525"
    },
    {
      "text": "Ye Tao, Youngwook Do, Humphrey Yang, Yi-Chin Lee, Guanyun Wang, Catherine Mondoa, Jianxun Cui, Wen Wang, Lining Yao. 2019. Morphlour: Personalized Flour-based Morphing Food Induced by Dehydration or Hydration Method. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology, 329–340. DOI: https://doi.org/10.1145/3332165.3347949.",
      "doi": "10.1145/3332165.3347949"
    },
    {
      "text": "Cesar Torres, Tim Campbell, Neil Kumar, Eric Paulos. 2015. HapticPrint: Designing feel aesthetics for digital fabrication. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology, 583-591. DOI: https://doi.org/10.1145/2807442.2807492.",
      "doi": "10.1145/2807442.2807492"
    },
    {
      "text": "Guanyun Wang, Tingyu Cheng, Youngwook Do, Humphrey Yang, Ye Tao, Jianzhe Gu, Byoungkwon An, Lining Yao. 2018. Printed Paper Actuator: A Low-cost Reversible Actuation and Sensing Method for Shape Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, 569. DOI: https://doi.org/10.1145/3173574.3174143.",
      "doi": "10.1145/3173574.3174143"
    },
    {
      "text": "Guanyun Wang, Yang Humphrey, Zeyu Yan, Nurcan Gecer Ulu, Ye Tao, Jianzhe Gu, Levent Burak Kara, Lining Yao. 2018. 4DMesh: 4D Printing Self-Folding Non-Developable Mesh Surfaces. In Proceedings of the 2018 ACM Symposium on User Interface Software and Technology (UIST’18). DOI: https://doi.org/10.1145/3242587.3242625.",
      "doi": ""
    },
    {
      "text": "Guanyun Wang, Ye Tao, Ozguc Bertug Capunaman, Humphrey Yang, Lining Yao. 2019. A-line: 4D Printing Morphing Linear Composite Structures. In Proceedings of the 37th Annual ACM Conference on Human Factors in Computing Systems (CHI 2019), 426. DOI: https://doi.org/10.1145/3290605.3300656.",
      "doi": "10.1145/3290605.3300656"
    },
    {
      "text": "Wen Wang, Lining Yao, Teng Zhang, Chin-Yi Cheng, Daniel Levine, Hiroshi Ishii. 2017. Transformative Appetite: Shape-Changing Food Transforms from 2D to 3D by Water Interaction through Cooking. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 6123-6132. DOI: https://doi.org/10.1145/3025453.3026019.",
      "doi": "10.1145/3025453.3026019"
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, Hans W Gellersen. 2014. MixFab: a mixed-reality environment for personal fabrication. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3855-3864. DOI: https://doi.org/10.1145/2556288.2557090.",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Karl Willis, Eric Brockmeyer, Scott Hudson, Ivan Poupyrev. 2012. Printed optics: 3D printing of embedded optical elements for interactive devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology, 589-598. DOI: https://doi.org/10.1145/2380116.2380190.",
      "doi": "10.1145/2380116.2380190"
    },
    {
      "text": "Junichi Yamaoka, Mustafa Doga Dogan, Katarina Bulovic, Kazuya Saito, Yoshihiro Kawahara, Yasuaki Kakehi, Stefanie Mueller. 2019. FoldTronics: Creating 3D Objects with Integrated Electronics Using Foldable Honeycomb Structures. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, 1-14. DOI: https://doi.org/10.1145/3290605.3300858.",
      "doi": "10.1145/3290605.3300858"
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, Hiroshi Ishii. 2015. bioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), 1-10. DOI: https://doi.org/10.1145/2702123.2702611.",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Clement Zheng, Jeeeun Kim, Daniel Leithinger, Mark D Gross, Ellen Yi-Luen Do. 2019. Mechamagnets: Designing and fabricating haptic and functional physical inputs with embedded magnets. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction, 325-334. DOI: https://doi.org/10.1145/3294109.3295622.",
      "doi": "10.1145/3294109.3295622"
    },
    {
      "text": "Amit Zoran. 2013. Hybrid Basketry: Interweaving Digital Practice within Contemporary Craft. Leonardo 46, 324-331. DOI: https://doi.org/10.1145/2503649.2503651.",
      "doi": ""
    }
  ]
}