{
  "doi": "10.1145/3411764.3445507",
  "title": "Ask Me or Tell Me? Enhancing the Effectiveness of Crowdsourced Design Feedback",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Crowdsourced design feedback systems are emerging resources for getting large amounts of feedback in a short period of time. Traditionally, the feedback comes in the form of a declarative statement, which often contains positive or negative sentiment. Prior research has shown that overly negative or positive sentiment can strongly influence the perceived usefulness and acceptance of feedback and, subsequently, lead to ineffective design revisions. To enhance the effectiveness of crowdsourced design feedback, we investigate a new approach for mitigating the effects of negative or positive feedback by combining open-ended and thought-provoking questions with declarative feedback statements. We conducted two user studies to assess the effects of question-based feedback on the sentiment and quality of design revisions in the context of graphic design. We found that crowdsourced question-based feedback contains more neutral sentiment than statement-based feedback. Moreover, we provide evidence that presenting feedback as questions followed by statements leads to better design revisions than question- or statement-based feedback alone.",
  "tags": [
    "sentiment",
    "crowdsourced design feedback",
    "feedback framing",
    "questioning"
  ],
  "authors": [
    {
      "name": "Fritz Lekschas",
      "institution": "School of Engineering Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702424",
      "orcid": "missing"
    },
    {
      "name": "Spyridon Ampanavos",
      "institution": "Graduate School of Design Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701664",
      "orcid": "missing"
    },
    {
      "name": "Pao Siangliulue",
      "institution": "B12, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658689063",
      "orcid": "missing"
    },
    {
      "name": "Hanspeter Pfister",
      "institution": "Visual Computing Group Harvard University, United States",
      "img": "/do/10.1145/contrib-81100199891/rel-imgonly/hans-web.jpg",
      "acmid": "81100199891",
      "orcid": "0000-0002-3620-2582"
    },
    {
      "name": "Krzysztof Z. Gajos",
      "institution": "School of Engineering and Applied Sciences Harvard University, United States",
      "img": "/do/10.1145/contrib-81100593751/rel-imgonly/81100593751.jpg",
      "acmid": "81100593751",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Roy F Baumeister, Ellen Bratslavsky, Catrin Finkenauer, and Kathleen D Vohs. 2001. Bad is stronger than good. Review of general psychology 5, 4 (2001), 323–370.",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer, Vera Khovanskaya, Mark Matthews, Lindsay Reynolds, Victoria Schwanda Sosik, and Geri Gay. 2014. Reviewing reflection: on the use of reflection in interactive system design. In Proceedings of the 2014 conference on Designing interactive systems(DIS ’14). ACM, New York, NY, USA, 93–102.",
      "doi": "10.1145/2598510.2598598"
    },
    {
      "text": "Inneke Berghmans, Nathalie Druine, Filip Dochy, and Katrien Struyven. 2012. A facilitative versus directive approach in training clinical skills? Investigating students’ clinical performance and perceptions. Perspectives on medical education 1, 3 (2012), 104–118.",
      "doi": ""
    },
    {
      "text": "Caroline Brandt. 2008. Integrating feedback and reflection in teacher preparation. ELT journal 62, 1 (2008), 37–46.",
      "doi": ""
    },
    {
      "text": "Paul Cairns, Pratyush Pandab, and Christopher Power. 2014. The influence of emotion on number entry errors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, New York, NY, USA, 2293–2296.",
      "doi": "10.1145/2556288.2557065"
    },
    {
      "text": "Douglas Carnine, Candy Stevens, Jean Clements, and Edward J Kameenui. 1982. Effects of Facultative Questions and Practice on Intermediate Students’ Understanding of Character Motives. Journal of Reading Behavior 14, 2 (1982), 179–190.",
      "doi": ""
    },
    {
      "text": "Kristine L Chambers and Joan N Vickers. 2006. Effects of bandwidth feedback and questioning on the performance of competitive swimmers. The Sport Psychologist 20, 2 (2006), 184–197.",
      "doi": ""
    },
    {
      "text": "Angelo V Ciardiello. 1998. Did you ask a good question today? Alternative cognitive and metacognitive strategies. Journal of Adolescent & Adult Literacy 42, 3 (1998), 210–219.",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1988. Statistical Power Analysis for the Behavioral Sciences (3 ed.). Lawrence Erlbaum Associates, Hillsdale, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Adam Connor and Aaron Irizarry. 2015. Discussing Design: Improving Communication and Collaboration Through Critique. O’Reilly, Sebastopol, CA, USA.",
      "doi": ""
    },
    {
      "text": "Corel. 2020. Gravit Designer. https://designer.io. Accessed: 2020-02-16.",
      "doi": ""
    },
    {
      "text": "Patrick A Crain and Brian P Bailey. 2017. Share Once or Share Often?: Exploring How Designers Approach Iteration in a Large Online Community. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition(C&C ’17). ACM, New York, NY, USA, 80–92.",
      "doi": "10.1145/3059454.3059476"
    },
    {
      "text": "Deanna Dannels, Amy Housley Gaffney, and Kelly Norris Martin. 2008. Beyond Content, Deeper than Delivery: What Critique Feedback Reveals about Communication Expectations in Design Education.International Journal for the Scholarship of teaching and Learning 2, 2(2008), n2.",
      "doi": ""
    },
    {
      "text": "Deanna P Dannels and Kelly Norris Martin. 2008. Critiquing critiques: A genre analysis of feedback across novice to expert design studios. Journal of Business and Technical Communication 22, 2(2008), 135–159.",
      "doi": ""
    },
    {
      "text": "Steven Dow, Julie Fortuna, Dan Schwartz, Beth Altringer, Daniel Schwartz, and Scott Klemmer. 2011. Prototyping Dynamics: Sharing Multiple Designs Improves Exploration, Group Rapport, and Results. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). ACM, New York, NY, USA, 2807–2816.",
      "doi": "10.1145/1978942.1979359"
    },
    {
      "text": "Eureka Foong, Darren Gergle, and Elizabeth M Gerber. 2017. Novice and Expert Sensemaking of Crowdsourced Design Feedback. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–18.",
      "doi": "10.1145/3134680"
    },
    {
      "text": "Google. 2020. Google Drawings. https://docs.google.com/drawings. Accessed: 2020-02-16.",
      "doi": ""
    },
    {
      "text": "Michael D Greenberg, Matthew W Easterday, and Elizabeth M Gerber. 2015. Critiki: A scaffolded approach to gathering design feedback from paid crowdworkers. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition(C&C ’15). ACM, New York, NY, USA, 235–244.",
      "doi": "10.1145/2757226.2757249"
    },
    {
      "text": "Thomas Grill. 2017. Python implementation of Krippendorff’s alpha. https://github.com/grrrr/krippendorff-alpha/. Accessed: 2020-02-16.",
      "doi": ""
    },
    {
      "text": "John Hattie and Helen Timperley. 2007. The power of feedback. Review of Educational Research 77, 1 (2007), 81–112.",
      "doi": ""
    },
    {
      "text": "Catherine M Hicks, Vineet Pandey, C Ailie Fraser, and Scott Klemmer. 2016. Framing feedback: Choosing review environment features that support high quality peer assessment. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 458–469.",
      "doi": "10.1145/2858036.2858195"
    },
    {
      "text": "Clayton J Hutto and Eric Gilbert. 2014. VADER: A Parsimonious Rule-Based Model for Sentiment Analysis of Social Media Text. In Eighth International AAAI Conference on Weblogs and Social Media(ICWSM ’14). AAAI, Menlo Park, CA, USA.",
      "doi": ""
    },
    {
      "text": "Hyeonsu B Kang, Gabriel Amoako, Neil Sengupta, and Steven P Dow. 2018. Paragon: An Online Gallery for Enhancing Design Feedback with Visual Examples. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3174180"
    },
    {
      "text": "Alison King. 1990. Enhancing peer interaction and learning in the classroom through reciprocal questioning. American Educational Research Journal 27, 4 (1990), 664–687.",
      "doi": ""
    },
    {
      "text": "Alison King. 1992. Facilitating elaborative learning through guided student-generated questioning. Educational psychologist 27, 1 (1992), 111–126.",
      "doi": ""
    },
    {
      "text": "Alison King. 1995. Inquiring minds really do want to know: Using questioning to teach critical thinking. Teaching of Psychology 22, 1 (1995), 13–17.",
      "doi": ""
    },
    {
      "text": "Cyril H Knoblauch and Lil Brannon. 1984. Rhetorical Traditions and the Teaching of Writing. Boynton/Cook Publishers, Upper Montclair, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Markus Krause, Tom Garncarz, JiaoJiao Song, Elizabeth M Gerber, Brian P Bailey, and Steven P Dow. 2017. Critique Style Guide: Improving Crowdsourced Design Feedback with a Natural Language Model. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 4627–4639.",
      "doi": "10.1145/3025453.3025883"
    },
    {
      "text": "Kurt Luther, Amy Pavel, Wei Wu, Jari-lee Tolentino, Maneesh Agrawala, Björn Hartmann, and Steven P Dow. 2014. CrowdCrit: crowdsourcing and aggregating visual design critique. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing(CSCW ’14). ACM, New York, NY, USA, 21–24.",
      "doi": "10.1145/2556420.2556788"
    },
    {
      "text": "Kurt Luther, Jari-Lee Tolentino, Wei Wu, Amy Pavel, Brian P Bailey, Maneesh Agrawala, Björn Hartmann, and Steven P Dow. 2015. Structuring, aggregating, and evaluating crowdsourced design critique. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). ACM, New York, NY, USA, 473–485.",
      "doi": "10.1145/2675133.2675283"
    },
    {
      "text": "Jennifer Marlow and Laura Dabbish. 2014. From rookie to all-star: professional development in a graphic design social networking site. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(CSCW ’14). ACM, New York, NY, USA, 922–933.",
      "doi": "10.1145/2531602.2531651"
    },
    {
      "text": "Tricia J Ngoon, C Ailie Fraser, Ariel S Weingarten, Mira Dontcheva, and Scott Klemmer. 2018. Interactive Guidance Techniques for Improving Creative Feedback. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 55.",
      "doi": "10.1145/3173574.3173629"
    },
    {
      "text": "Thi Thao Duyen T Nguyen, Thomas Garncarz, Felicia Ng, Laura A Dabbish, and Steven P Dow. 2017. Fruitful Feedback: Positive affective language and source anonymity improve critique reception and work outcomes. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). ACM, New York, NY, USA, 1024–1034.",
      "doi": "10.1145/2998181.2998319"
    },
    {
      "text": "Myle Ott. 2020. Unique Turker. https://uniqueturker.myleott.com. Accessed: 2020-02-16.",
      "doi": ""
    },
    {
      "text": "David A Robb, Stefano Padilla, Britta Kalkreuter, and Mike J Chantler. 2015. Crowdsourced feedback with imagery rather than text: Would designers use it?. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 1355–1364.",
      "doi": "10.1145/2702123.2702470"
    },
    {
      "text": "D Royce Sadler. 1989. Formative assessment and the design of instructional systems. Instructional Science 18, 2 (1989), 119–144.",
      "doi": ""
    },
    {
      "text": "Joan Sargeant, Karen Mann, Douglas Sinclair, Cees Van der Vleuten, and Job Metsemakers. 2008. Understanding the influence of emotions and reflection upon multi-source feedback acceptance and use. Advances in Health Sciences Education 13, 3 (2008), 275–288.",
      "doi": ""
    },
    {
      "text": "Joan M Sargeant, Karen V Mann, Cees P Van der Vleuten, and Job F Metsemakers. 2009. Reflection: a link between receiving and using assessment feedback. Advances in Health Sciences Education 14, 3 (2009), 399–410.",
      "doi": ""
    },
    {
      "text": "Donald A Schön. 1984. The Reflective Practitioner: How professionals think in action. Vol. 5126. Basic Books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Donald A Schön. 1985. The design studio: An exploration of its traditions and potentials. RIBA Publications for RIBA Building Industry Trust, London, UK. 99 pages.",
      "doi": ""
    },
    {
      "text": "Pao Siangliulue, Kenneth C Arnold, Krzysztof Z Gajos, and Steven P Dow. 2015. Toward collaborative ideation at scale: Leveraging ideas from others to generate more creative and diverse ideas. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). ACM, New York, NY, USA, 937–945.",
      "doi": "10.1145/2675133.2675239"
    },
    {
      "text": "Pao Siangliulue, Joel Chan, Krzysztof Z Gajos, and Steven P Dow. 2015. Providing timely examples improves the quantity and quality of generated ideas. In Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition(C&C ’15). ACM, ACM, New York, NY, USA, 83–92.",
      "doi": "10.1145/2757226.2757230"
    },
    {
      "text": "Toyin Tofade, Jamie Elsner, and Stuart T Haines. 2013. Best practice strategies for effective use of questions as a teaching tool. American journal of pharmaceutical education 77, 7 (2013), 155.",
      "doi": ""
    },
    {
      "text": "Maryam Tohidi, William Buxton, Ronald Baecker, and Abigail Sellen. 2006. Getting the right design and the design right. In Proceedings of the SIGCHI conference on Human Factors in computing systems(CHI ’06). ACM, New York, NY, USA, 1243–1252.",
      "doi": "10.1145/1124772.1124960"
    },
    {
      "text": "Belkis Uluoğlu. 2000. Design knowledge communicated in studio critiques. Design Studies 21, 1 (2000), 33–58.",
      "doi": ""
    },
    {
      "text": "Wesley Willett, Jeffrey Heer, and Maneesh Agrawala. 2012. Strategies for crowdsourcing social data analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). ACM, New York, NY, USA, 227–236.",
      "doi": "10.1145/2207676.2207709"
    },
    {
      "text": "Jacob O Wobbrock, Leah Findlater, Darren Gergle, and James J Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI conference on human factors in computing systems(CHI ’11). ACM, New York, NY, USA, 143–146.",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Y Wayne Wu and Brian P Bailey. 2017. Bitter Sweet or Sweet Bitter? How Valence Order and Source Identity Influence Feedback Acceptance. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition(C&C ’17). ACM, New York, NY, USA, 137–147.",
      "doi": "10.1145/3059454.3059458"
    },
    {
      "text": "Y Wayne Wu and Brian P Bailey. 2018. Soften the Pain, Increase the Gain: Enhancing Users’ Resilience to Negative Valence Feedback. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–20.",
      "doi": "10.1145/3274455"
    },
    {
      "text": "Anbang Xu and Brian Bailey. 2012. What do you think? A case study of benefit, expectation, and interaction in a large online critique community. In Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work(CHI ’12). ACM, New York, NY, USA, 295–304.",
      "doi": "10.1145/2145204.2145252"
    },
    {
      "text": "Anbang Xu, Shih-Wen Huang, and Brian Bailey. 2014. Voyant: generating structured feedback on visual designs using a crowd of non-experts. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(CSCW ’14). ACM, New York, NY, USA, 1433–1444.",
      "doi": "10.1145/2531602.2531604"
    },
    {
      "text": "Anbang Xu, Huaming Rao, Steven P Dow, and Brian P Bailey. 2015. A classroom study of using crowd feedback in the iterative design process. In Proceedings of the 18th ACM conference on computer supported cooperative work & social computing(CSCW ’15). ACM, New York, NY, USA, 1637–1648.",
      "doi": "10.1145/2675133.2675140"
    },
    {
      "text": "Yu-Chun Yen, Steven P Dow, Elizabeth Gerber, and Brian P Bailey. 2016. Social network, web forum, or task market? Comparing different crowd genres for design feedback exchange. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems(DIS ’16). ACM, New York, NY, USA, 773–784.",
      "doi": "10.1145/2901790.2901820"
    },
    {
      "text": "Yu-Chun Grace Yen, Steven P Dow, Elizabeth Gerber, and Brian P Bailey. 2017. Listen to Others, Listen to Yourself: Combining Feedback Review and Reflection to Improve Iterative Design. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition(C&C ’17). ACM, New York, NY, USA, 158–170.",
      "doi": "10.1145/3059454.3059468"
    },
    {
      "text": "Alvin Yuan, Kurt Luther, Markus Krause, Sophie Isabel Vennix, Steven P Dow, and Bjorn Hartmann. 2016. Almost an expert: The effects of rubrics and expertise on perceived value of crowdsourced design critiques. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing(CSCW ’16). ACM, New York, NY, USA, 1005–1017.",
      "doi": "10.1145/2818048.2819953"
    }
  ]
}