{
  "doi": "10.1145/3411764.3445472",
  "title": "A Human-AI Collaborative Approach for Clinical Decision Making on Rehabilitation Assessment",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Advances in artificial intelligence (AI) have made it increasingly applicable to supplement expert’s decision-making in the form of a decision support system on various tasks. For instance, an AI-based system can provide therapists quantitative analysis on patient’s status to improve practices of rehabilitation assessment. However, there is limited knowledge on the potential of these systems. In this paper, we present the development and evaluation of an interactive AI-based system that supports collaborative decision making with therapists for rehabilitation assessment. This system automatically identifies salient features of assessment to generate patient-specific analysis for therapists, and tunes with their feedback. In two evaluations with therapists, we found that our system supports therapists significantly higher agreement on assessment (0.71 average F1-score) than a traditional system without analysis (0.66 average F1-score, p < 0.05). After tuning with therapist’s feedback, our system significantly improves its performance from 0.8377 to 0.9116 average F1-scores (p < 0.01). This work discusses the potential of a human-AI collaborative system to support more accurate decision making while learning from each other’s strengths.",
  "authors": [
    {
      "name": "Min Hun Lee",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659248737",
      "orcid": "missing"
    },
    {
      "name": "Daniel P. Siewiorek",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452606879",
      "orcid": "missing"
    },
    {
      "name": "Asim Smailagic",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100393914",
      "orcid": "missing"
    },
    {
      "name": "Alexandre Bernardino",
      "institution": "Institute for Systems and Robotics, Instituto Superior Tecnico, University of Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384595963",
      "orcid": "missing"
    },
    {
      "name": "Sergi Bermúdez i Badia",
      "institution": "Universidade da Madeira / Madeira-ITI, NOVA-LINCS, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316487800",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Saleema Amershi, Maya Cakmak, William Bradley Knox, and Todd Kulesza. 2014. Power to the people: The role of humans in interactive machine learning. AI Magazine 35, 4 (2014), 105–120.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, 2019. Guidelines for human-AI interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 3.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Mirza Mansoor Baig, Hamid GholamHosseini, Aasia A Moqeem, Farhaan Mirza, and Maria Lindén. 2017. A systematic review of wearable patient monitoring systems–current challenges and opportunities for clinical adoption. Journal of medical systems 41, 7 (2017), 115.",
      "doi": "10.1007/s10916-017-0760-1"
    },
    {
      "text": "Tadas Baltrušaitis, Chaitanya Ahuja, and Louis-Philippe Morency. 2019. Multimodal machine learning: A survey and taxonomy. IEEE Transactions on Pattern Analysis and Machine Intelligence 41, 2(2019), 423–443.",
      "doi": "10.1109/TPAMI.2018.2798607"
    },
    {
      "text": "Michael L Barnett, Dhruv Boddupalli, Shantanu Nundy, and David W Bates. 2019. Comparative accuracy of diagnosis by collective intelligence of multiple physicians vs individual physicians. JAMA network open 2, 3 (2019), e190096–e190096.",
      "doi": ""
    },
    {
      "text": "Mark T Bayley, Amanda Hurdowar, Carol L Richards, Nicol Korner-Bitensky, Sharon Wood-Dauphinee, Janice J Eng, Marilyn McKay-Lyons, Edward Harrison, Robert Teasell, Margaret Harrison, 2012. Barriers to implementation of stroke rehabilitation evidence: findings from a multi-site pilot project. Disability and rehabilitation 34, 19 (2012), 1633–1638.",
      "doi": ""
    },
    {
      "text": "Emma Beede, Elizabeth Baylor, Fred Hersch, Anna Iurchenko, Lauren Wilcox, Paisan Ruamviboonsuk, and Laura M Vardoulakis. 2020. A Human-Centered Evaluation of a Deep Learning System Deployed in Clinics for the Detection of Diabetic Retinopathy. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376718"
    },
    {
      "text": "Or Biran and Courtenay Cotton. 2017. Explanation and justification in machine learning: A survey. In IJCAI-17 workshop on explainable AI (XAI), Vol. 8. 1.",
      "doi": ""
    },
    {
      "text": "Tiffani J Bright, Anthony Wong, Ravi Dhurjati, Erin Bristow, Lori Bastian, Remy R Coeytaux, Gregory Samsa, Vic Hasselblad, John W Williams, Michael D Musty, 2012. Effect of clinical decision-support systems: a systematic review. Annals of internal medicine 157, 1 (2012), 29–43.",
      "doi": ""
    },
    {
      "text": "Federico Cabitza, Raffaele Rasoini, and Gian Franco Gensini. 2017. Unintended consequences of machine learning in medicine. Jama 318, 6 (2017), 517–518.",
      "doi": ""
    },
    {
      "text": "Carrie J Cai, Emily Reif, Narayan Hegde, Jason Hipp, Been Kim, Daniel Smilkov, Martin Wattenberg, Fernanda Viegas, Greg S Corrado, Martin C Stumpe, 2019. Human-centered tools for coping with imperfect algorithms during medical decision-making. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 4.",
      "doi": "10.1145/3290605.3300234"
    },
    {
      "text": "Carrie J Cai, Samantha Winter, David Steiner, Lauren Wilcox, and Michael Terry. 2019. ” Hello AI”: Uncovering the Onboarding Needs of Medical Practitioners for Human-AI Collaborative Decision-Making. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359206"
    },
    {
      "text": "Wendy J Coster. 2008. Embracing ambiguity: Facing the challenge of measurement. American Journal of Occupational Therapy 62, 6 (2008), 743–752.",
      "doi": ""
    },
    {
      "text": "Yaron Denekamp. 2007. Clinical decision support systems for addressing information needs of physicians.The Israel Medical Association journal: IMAJ 9, 11 (2007), 771–776.",
      "doi": ""
    },
    {
      "text": "Finale Doshi-Velez and Been Kim. 2017. Towards a rigorous science of interpretable machine learning. arXiv preprint arXiv:1702.08608(2017).",
      "doi": ""
    },
    {
      "text": "Mengnan Du, Ninghao Liu, and Xia Hu. 2018. Techniques for interpretable machine learning. arXiv preprint arXiv:1808.00033(2018).",
      "doi": ""
    },
    {
      "text": "Valery L Feigin, Bo Norrving, and George A Mensah. 2017. Global burden of stroke. Circulation research 120, 3 (2017), 439–448.",
      "doi": ""
    },
    {
      "text": "Early Treatment Diabetic Retinopathy Study Research Group 1987. Treatment techniques and clinical guidelines for photocoagulation of diabetic macular edema: Early Treatment Diabetic Retinopathy Study report number 2. Ophthalmology 94, 7 (1987), 761–774.",
      "doi": ""
    },
    {
      "text": "Yu Guan and Thomas Plötz. 2017. Ensembles of Deep LSTM Learners for Activity Recognition Using Wearables. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 2, Article 11 (June 2017), 28 pages. https://doi.org/10.1145/3090076",
      "doi": "10.1145/3090076"
    },
    {
      "text": "Isabelle Guyon, Jason Weston, Stephen Barnhill, and Vladimir Vapnik. 2002. Gene selection for cancer classification using support vector machines. Machine learning 46, 1-3 (2002), 389–422.",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Andreas Holzinger. 2016. Interactive machine learning for health informatics: when do we need the human-in-the-loop?Brain Informatics 3, 2 (2016), 119–131.",
      "doi": ""
    },
    {
      "text": "Joseph Jankovic. 2008. Parkinson’s disease: clinical features and diagnosis. Journal of neurology, neurosurgery & psychiatry 79, 4(2008), 368–376.",
      "doi": ""
    },
    {
      "text": "Mark Jones, Karen Grimmer, Ian Edwards, Joy Higgs, and Franziska Trede. 2006. Challenges in applying best evidence to physiotherapy. Internet Journal of Allied Health Sciences and Practice 4, 3(2006), 11.",
      "doi": ""
    },
    {
      "text": "Ashish Kapoor, Bongshin Lee, Desney Tan, and Eric Horvitz. 2010. Interactive optimization for steering machine classification. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1343–1352.",
      "doi": "10.1145/1753326.1753529"
    },
    {
      "text": "Danielle Leah Kehl and Samuel Ari Kessler. 2017. Algorithms in the criminal justice system: Assessing the use of risk assessments in sentencing. (2017).",
      "doi": ""
    },
    {
      "text": "Saif Khairat, David Marc, William Crosby, and Ali Al Sanousi. 2018. Reasons for physicians not adopting clinical decision support systems: critical analysis. JMIR medical informatics 6, 2 (2018), e24.",
      "doi": ""
    },
    {
      "text": "Been Kim, Julie A Shah, and Finale Doshi-Velez. 2015. Mind the gap: A generative approach to interpretable feature selection and extraction. In Advances in Neural Information Processing Systems. 2260–2268.",
      "doi": ""
    },
    {
      "text": "René F Kizilcec. 2016. How much information?: Effects of transparency on trust in an algorithmic interface. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 2390–2395.",
      "doi": "10.1145/2858036.2858402"
    },
    {
      "text": "Peter Knapp and Jenny Hewison. 1999. Disagreement in patient and carer assessment of functional abilities after stroke. Stroke 30, 5 (1999), 934–938.",
      "doi": ""
    },
    {
      "text": "Jonathan Krause, Varun Gulshan, Ehsan Rahimy, Peter Karth, Kasumi Widner, Greg S Corrado, Lily Peng, and Dale R Webster. 2018. Grader variability and the importance of reference standards for evaluating machine learning models for diabetic retinopathy. Ophthalmology 125, 8 (2018), 1264–1272.",
      "doi": ""
    },
    {
      "text": "Todd Kulesza, Margaret Burnett, Weng-Keen Wong, and Simone Stumpf. 2015. Principles of explanatory debugging to personalize interactive machine learning. In Proceedings of the 20th international conference on intelligent user interfaces. 126–137.",
      "doi": "10.1145/2678025.2701399"
    },
    {
      "text": "Todd Kulesza, Simone Stumpf, Weng-Keen Wong, Margaret M Burnett, Stephen Perona, Andrew Ko, and Ian Oberst. 2011. Why-oriented end-user debugging of naive Bayes text classification. ACM Transactions on Interactive Intelligent Systems (TiiS) 1, 1(2011), 2.",
      "doi": "10.1145/2030365.2030367"
    },
    {
      "text": "Min Hun Lee, Daniel P Siewiorek, Asim Smailagic, Alexandre Bernadino, 2019. Learning to assess the quality of stroke rehabilitation exercises. In Proceedings of the 24th International Conference on Intelligent User Interfaces. ACM, 218–228.",
      "doi": "10.1145/3301275.3302273"
    },
    {
      "text": "Min Hun Lee, Daniel P Siewiorek, Asim Smailagic, Alexandre Bernardino, and Sergi Bermúdez i Badia. 2020. Co-Design and Evaluation of an Intelligent Decision Support System for Stroke Rehabilitation Assessment. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–27.",
      "doi": "10.1145/3415227"
    },
    {
      "text": "Min Hun Lee, Daniel P Siewiorek, Asim Smailagic, Alexandre Bernardino, and Sergi Bermúdez i Badia. 2020. An exploratory study on techniques for quantitative assessment of stroke rehabilitation exercises. In Proceedings of the 28th ACM Conference on User Modeling, Adaptation and Personalization. 303–307.",
      "doi": "10.1145/3340631.3394872"
    },
    {
      "text": "Min Hun Lee, Daniel P Siewiorek, Asim Smailagic, Alexandre Bernardino, and Sergi Bermúdez i Badia. 2020. Interactive hybrid approach to combine machine and human intelligence for personalized rehabilitation assessment. In Proceedings of the ACM Conference on Health, Inference, and Learning. 160–169.",
      "doi": "10.1145/3368555.3384452"
    },
    {
      "text": "Timothy P Lillicrap, Jonathan J Hunt, Alexander Pritzel, Nicolas Heess, Tom Erez, Yuval Tassa, David Silver, and Daan Wierstra. 2015. Continuous control with deep reinforcement learning. arXiv preprint arXiv:1509.02971(2015).",
      "doi": ""
    },
    {
      "text": "Andrew F Long, Rosie Kneafsey, and Julia Ryan. 2003. Rehabilitation practice: challenges to effective team working. International journal of nursing studies 40, 6 (2003), 663–673.",
      "doi": ""
    },
    {
      "text": "Brent Mittelstadt, Chris Russell, and Sandra Wachter. 2019. Explaining explanations in AI. In Proceedings of the conference on fairness, accountability, and transparency. 279–288.",
      "doi": "10.1145/3287560.3287574"
    },
    {
      "text": "Volodymyr Mnih, Koray Kavukcuoglu, David Silver, Andrei A Rusu, Joel Veness, Marc G Bellemare, Alex Graves, Martin Riedmiller, Andreas K Fidjeland, Georg Ostrovski, 2015. Human-level control through deep reinforcement learning. Nature 518, 7540 (2015), 529.",
      "doi": ""
    },
    {
      "text": "Gail Mountain, Steven Wilson, Christopher Eccleston, Susan Mawson, Jackie Hammerton, Tricia Ware, Huiru Zheng, Richard Davies, Norman Black, Nigel Harris, 2010. Developing and testing a telerehabilitation system for people following stroke: issues of usability. Journal of Engineering Design 21, 2-3 (2010), 223–236.",
      "doi": ""
    },
    {
      "text": "Margit Alt Murphy, Carin Willén, and Katharina S Sunnerhagen. 2011. Kinematic variables quantifying upper-extremity performance after stroke during reaching and drinking from a glass. Neurorehabilitation and neural repair 25, 1 (2011), 71–80.",
      "doi": ""
    },
    {
      "text": "Mark A Musen, Blackford Middleton, and Robert A Greenes. 2014. Clinical decision-support systems. In Biomedical informatics. Springer, 643–674.",
      "doi": ""
    },
    {
      "text": "Susan B O’Sullivan, Thomas J Schmitz, and George Fulk. 2019. Physical rehabilitation. FA Davis.",
      "doi": ""
    },
    {
      "text": "Madhuri Panwar, Dwaipayan Biswas, Harsh Bajaj, Michael Jöbges, Ruth Turk, Koushik Maharatna, and Amit Acharyya. 2019. Rehab-Net: Deep Learning Framework for Arm Movement Classification Using Wearable Sensors for Stroke Rehabilitation. IEEE Transactions on Biomedical Engineering 66, 11 (2019), 3026–3037.",
      "doi": ""
    },
    {
      "text": "Adam Paszke, Sam Gross, Soumith Chintala, Gregory Chanan, Edward Yang, Zachary DeVito, Zeming Lin, Alban Desmaison, Luca Antiga, and Adam Lerer. 2017. Automatic differentiation in PyTorch. (2017).",
      "doi": ""
    },
    {
      "text": "Fabian Pedregosa, Gaël Varoquaux, Alexandre Gramfort, Vincent Michel, Bertrand Thirion, Olivier Grisel, Mathieu Blondel, Peter Prettenhofer, Ron Weiss, Vincent Dubourg, 2011. Scikit-learn: Machine learning in Python. Journal of machine learning research 12, Oct (2011), 2825–2830.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "Liangying Peng, Ling Chen, Zhenan Ye, and Yi Zhang. 2018. Aroma: A deep multi-task learning based simple and complex human activity recognition method using wearable sensors. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 2 (2018), 1–16.",
      "doi": "10.1145/3214277"
    },
    {
      "text": "Samuele Lo Piano. 2020. Ethical principles in machine learning and artificial intelligence: cases from the field and possible ways forward. Humanities and Social Sciences Communications 7, 1(2020), 1–7.",
      "doi": ""
    },
    {
      "text": "Brandon Rohrer, Susan Fasoli, Hermano Igo Krebs, Richard Hughes, Bruce Volpe, Walter R Frontera, Joel Stein, and Neville Hogan. 2002. Movement smoothness changes during stroke recovery. Journal of Neuroscience 22, 18 (2002), 8297–8304.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2020. Bridging the gap between ethics and practice: Guidelines for reliable, safe, and trustworthy Human-Centered AI systems. ACM Transactions on Interactive Intelligent Systems (TiiS) 10, 4(2020), 1–31.",
      "doi": "10.1145/3419764"
    },
    {
      "text": "Katherine J Sullivan, Julie K Tilson, Steven Y Cen, Dorian K Rose, Julie Hershberg, Anita Correa, Joann Gallichio, Molly McLeod, Craig Moore, Samuel S Wu, 2011. Fugl-Meyer assessment of sensorimotor function after stroke: standardized training procedure for clinical practice and clinical trials. Stroke 42, 2 (2011), 427–432.",
      "doi": ""
    },
    {
      "text": "Jiliang Tang, Salem Alelyani, and Huan Liu. 2014. Feature selection for classification: A review. Data classification: Algorithms and applications (2014), 37.",
      "doi": ""
    },
    {
      "text": "Eric J Topol. 2019. High-performance medicine: the convergence of human and artificial intelligence. Nature medicine 25, 1 (2019), 44–56.",
      "doi": ""
    },
    {
      "text": "Philipp Tschandl, Christoph Rinner, Zoe Apalla, Giuseppe Argenziano, Noel Codella, Allan Halpern, Monika Janda, Aimilios Lallas, Caterina Longo, Josep Malvehy, 2020. Human–computer collaboration for skin cancer recognition. Nature Medicine 26, 8 (2020), 1229–1234.",
      "doi": ""
    },
    {
      "text": "Hado Van Hasselt, Arthur Guez, and David Silver. 2016. Deep reinforcement learning with double q-learning. In Thirtieth AAAI conference on artificial intelligence.",
      "doi": ""
    },
    {
      "text": "M Mitchell Waldrop. 2015. Autonomous vehicles: No drivers required. Nature News 518, 7537 (2015), 20.",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Justin D Weisz, Michael Muller, Parikshit Ram, Werner Geyer, Casey Dugan, Yla Tausczik, Horst Samulowitz, and Alexander Gray. 2019. Human-AI Collaboration in Data Science: Exploring Data Scientists’ Perceptions of Automated AI. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359313"
    },
    {
      "text": "Elizabeth C Ward, Clare L Burns, Deborah G Theodoros, and Trevor G Russell. 2014. Impact of dysphagia severity on clinical decision making via telerehabilitation. Telemedicine and e-Health 20, 4 (2014), 296–303.",
      "doi": ""
    },
    {
      "text": "David S Watson, Jenny Krutzinna, Ian N Bruce, Christopher EM Griffiths, Iain B McInnes, Michael R Barnes, and Luciano Floridi. 2019. Clinical applications of machine learning algorithms: beyond the black box. Bmj 364(2019).",
      "doi": ""
    },
    {
      "text": "David Webster and Ozkan Celik. 2014. Systematic review of Kinect applications in elderly care and stroke rehabilitation. Journal of neuroengineering and rehabilitation 11, 1(2014), 108.",
      "doi": ""
    },
    {
      "text": "Ching-yi Wu, Catherine A Trombly, Keh-chung Lin, and Linda Tickle-Degnen. 2000. A kinematic study of contextual effects on reaching performance in persons with and without stroke: influences of object availability. Archives of Physical Medicine and Rehabilitation 81, 1(2000), 95–101.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, and John Zimmerman. 2019. Unremarkable AI: Fitting Intelligent Decision Support into Critical, Clinical Decision-Making Processes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 238.",
      "doi": "10.1145/3290605.3300468"
    }
  ]
}