{
  "doi": "10.1145/3411764.3445342",
  "title": "ArticuLev: An Integrated Self-Assembly Pipeline for Articulated Multi-Bead Levitation Primitives",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Acoustic levitation is gaining popularity as an approach to create physicalized mid-air content by levitating different types of levitation primitives. Such primitives can be independent particles or particles that are physically connected via threads or pieces of cloth to form shapes in mid-air. However, initialization (i.e., placement of such primitives in their mid-air target locations) currently relies on either manual placement or specialized ad-hoc implementations, which limits their practical usage. We present ArticuLev, an integrated pipeline that deals with the identification, assembly and mid-air placement of levitated shape primitives. We designed ArticuLev with the physical properties of commonly used levitation primitives in mind. It enables experiences that seamlessly combine different primitives into meaningful structures (including fully articulated animated shapes) and supports various levitation display approaches (e.g., particles moving at high speed). In this paper, we describe our pipeline and demonstrate it with heterogeneous combinations of levitation primitives.",
  "tags": [],
  "authors": [
    {
      "name": "Andreas Rene Fender",
      "institution": "Department of Computer Science, ETH Zürich, Zürich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959192157",
      "orcid": "0000-0002-5903-0736"
    },
    {
      "name": "Diego Martinez Plasencia",
      "institution": "Department of Computer Science, University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81548363756/rel-imgonly/diego-bw-e1492896584298-thegem-person.jpg",
      "acmid": "81548363756",
      "orcid": "0000-0002-5815-8236"
    },
    {
      "name": "Sriram Subramanian",
      "institution": "Department of Computer Science, University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81100277483/rel-imgonly/sri_portrait_copy.jpg",
      "acmid": "81100277483",
      "orcid": "0000-0002-5266-8366"
    }
  ],
  "references": [
    {
      "text": "Myroslav Bachynskyi, Viktorija Paneva, and Jörg Müller. 2018. LeviCursor: Dexterous Interaction with a Levitating Object. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces (Tokyo, Japan) (ISS ’18). Association for Computing Machinery, New York, NY, USA, 253–262. https://doi.org/10.1145/3279778.3279802",
      "doi": "10.1145/3279778.3279802"
    },
    {
      "text": "Johann Berthelot and Nicolas Bonod. 2019. Free-space micro-graphics with electrically driven levitated light scatterers. Opt. Lett. 44, 6 (Mar 2019), 1476–1479. https://doi.org/10.1364/OL.44.001476",
      "doi": ""
    },
    {
      "text": "EH Brandt. 1989. Levitation in physics. Science 243, 4889 (1989), 349–355.",
      "doi": ""
    },
    {
      "text": "Elan Dubrofsky. 2009. Homography estimation. Diplomová práce. Vancouver: Univerzita Britské Kolumbie (2009).",
      "doi": ""
    },
    {
      "text": "Andreas Fender and Jörg Müller. 2018. Velt: A Framework for Multi RGB-D Camera Systems. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces (Tokyo, Japan) (ISS ’18). Association for Computing Machinery, New York, NY, USA, 73–83. https://doi.org/10.1145/3279778.3279794",
      "doi": "10.1145/3279778.3279794"
    },
    {
      "text": "Euan Freeman, Asier Marzo, Praxitelis B. Kourtelos, Julie R. Williamson, and Stephen Brewster. 2019. Enhancing Physical Objects with Actuated Levitating Particles. In Proceedings of the 8th ACM International Symposium on Pervasive Displays (Palermo, Italy) (PerDis ’19). Association for Computing Machinery, New York, NY, USA, Article 2, 7 pages. https://doi.org/10.1145/3321335.3324939",
      "doi": "10.1145/3321335.3324939"
    },
    {
      "text": "Euan Freeman, Julie Williamson, Sriram Subramanian, and Stephen Brewster. 2018. Point-and-Shake: Selecting from Levitating Object Displays. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 18, 10 pages. https://doi.org/10.1145/3173574.3173592",
      "doi": "10.1145/3173574.3173592"
    },
    {
      "text": "T. Fushimi, A. Marzo, B. W. Drinkwater, and T. Hill. 2019. Acoustophoretic volumetric displays using a fast-moving levitated particle. Applied Physics Letters 115 (2019), 064101.",
      "doi": ""
    },
    {
      "text": "Ryuji Hirayama, Diego Martinez Plasencia, Nobuyuki Masuda, and Sriram Subramanian. 2019. A volumetric display for visual, tactile and audio presentation using acoustic trapping. Nature 575, 7782 (2019), 320–323.",
      "doi": ""
    },
    {
      "text": "Jinha Lee, Rehmi Post, and Hiroshi Ishii. 2011. ZeroN: Mid-Air Tangible Interaction Enabled by Computer Controlled Magnetic Levitation. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 327–336. https://doi.org/10.1145/2047196.2047239",
      "doi": "10.1145/2047196.2047239"
    },
    {
      "text": "Diego Martinez-Plasencia, Ryuji Hirayama, Roberto Montano-Murillo, and Sriram Subramanian. 2020. GS-PAT: High-Speed Multi-Point Sound-Fields for Phased Arrays of Transducers. ACM SIGGRAPH (2020). (To appear).",
      "doi": ""
    },
    {
      "text": "Asier Marzo. 2016. GauntLev: A Wearable to Manipulate Free-Floating Objects. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3277–3281. https://doi.org/10.1145/2858036.2858370",
      "doi": "10.1145/2858036.2858370"
    },
    {
      "text": "A. Marzo, T. Corkett, and B. W. Drinkwater. 2018. Ultraino: An Open Phased-Array System for Narrowband Airborne Ultrasound Transmission. IEEE Transactions on Ultrasonics, Ferroelectrics, and Frequency Control 65, 1 (2018), 102–111.",
      "doi": ""
    },
    {
      "text": "Asier Marzo and Bruce W Drinkwater. 2019. Holographic acoustic tweezers. Proceedings of the National Academy of Sciences 116, 1 (2019), 84–89.",
      "doi": ""
    },
    {
      "text": "Asier Marzo, Sue Ann Seah, Bruce W Drinkwater, Deepak Ranjan Sahoo, Benjamin Long, and Sriram Subramanian. 2015. Holographic acoustic elements for manipulation of levitated objects. Nature communications 6(2015), 8661.",
      "doi": ""
    },
    {
      "text": "G. Memoli, M. Caleap, Michihiro Asakawa, D. R. Sahoo, B. Drinkwater, and Sriram Subramanian. 2017. Metamaterial bricks and quantization of meta-surfaces. Nature Communications 8(2017).",
      "doi": ""
    },
    {
      "text": "Rafael Morales, Asier Marzo, Sriram Subramanian, and Diego Martínez. 2019. LeviProps: Animating Levitated Optimized Fabric Structures Using Holographic Acoustic Tweezers. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 651–661. https://doi.org/10.1145/3332165.3347882",
      "doi": "10.1145/3332165.3347882"
    },
    {
      "text": "NaturalPoint. 2020. Camera SDK. https://optitrack.com/products/camera-sdk/ (Accessed: 02/01/2020).",
      "doi": ""
    },
    {
      "text": "NaturalPoint. 2020. OptiTrack. https://optitrack.com/ (Accessed: 02/01/2020).",
      "doi": ""
    },
    {
      "text": "Mohd Adili Norasikin, Diego Martinez, Spyros Polychronopoulos, Gianluca Memoli, Yutaka Tokuda, and Sriram Subramanian. 2018. SoundBender: Dynamic Acoustic Control Behind Obstacles. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 247–259. https://doi.org/10.1145/3242587.3242590",
      "doi": "10.1145/3242587.3242590"
    },
    {
      "text": "Yoichi Ochiai, Takayuki Hoshi, and Jun Rekimoto. 2014. Pixie Dust: Graphics Generated by Levitated and Animated Objects in Computational Acoustic-Potential Field. ACM Trans. Graph. 33, 4, Article 85 (July 2014), 13 pages. https://doi.org/10.1145/2601097.2601118",
      "doi": "10.1145/2601097.2601118"
    },
    {
      "text": "Themis Omirou, Asier Marzo, Sue Ann Seah, and Sriram Subramanian. 2015. LeviPath: Modular Acoustic Levitation for 3D Path Visualisations. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 309–312. https://doi.org/10.1145/2702123.2702333",
      "doi": "10.1145/2702123.2702333"
    },
    {
      "text": "T. Omirou, A. M. Perez, S. Subramanian, and A. Roudaut. 2016. Floating charts: Data plotting using free-floating acoustically levitated representations. In 2016 IEEE Symposium on 3D User Interfaces (3DUI). 187–190. https://doi.org/10.1109/3DUI.2016.7460051",
      "doi": ""
    },
    {
      "text": "Viktorija Paneva, Myroslav Bachynskyi, and Jörg Müller. 2020. Levitation Simulator: Prototyping Ultrasonic Levitation Interfaces in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376409",
      "doi": "10.1145/3313831.3376409"
    },
    {
      "text": "ALGLIB Project. 2020. . https://www.alglib.net/ (Accessed: 23/06/2020).",
      "doi": ""
    },
    {
      "text": "Maxime Reynal, Euan Freeman, and Stephen Brewster. 2020. Avoiding Collisions When Interacting with Levitating Particle Displays. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3334480.3382965",
      "doi": "10.1145/3334480.3382965"
    },
    {
      "text": "Deepak Ranjan Sahoo, Takuto Nakamura, Asier Marzo, Themis Omirou, Michihiro Asakawa, and Sriram Subramanian. 2016. JOLED: A Mid-Air Display Based on Electrostatic Rotation of Levitated Janus Objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 437–448. https://doi.org/10.1145/2984511.2984549",
      "doi": "10.1145/2984511.2984549"
    },
    {
      "text": "D. Smalley, E. Nygaard, K. Squire, J. V. Wagoner, J. Rasmussen, S. Gneiting, K. Qaderi, J. Goodsell, W. Rogers, M. Lindsey, K. Costner, A. Monk, M. Pearson, B. Haymore, and J. Peatross. 2018. A photophoretic-trap volumetric display. Nature 553(2018), 486–490.",
      "doi": ""
    },
    {
      "text": "Olga Sorkine. 2009. Least-squares rigid motion using svd. Technical notes 120, 3 (2009), 52.",
      "doi": ""
    },
    {
      "text": "Carsten Steger. 1998. Evaluation of subpixel line and edge detection precision and accuracy. International Archives of Photogrammetry and Remote Sensing 32 (1998), 256–264.",
      "doi": ""
    },
    {
      "text": "W Le Conte Stevens. 1899. A Text-Book of Physics–Sound.",
      "doi": ""
    },
    {
      "text": "Ultraleap. 2020. Ultraleap STRATOS. https://www.ultraleap.com/product/stratos-explore/ (Accessed: 04/01/2021).",
      "doi": ""
    }
  ]
}