{
  "doi": "10.1145/3411764.3445400",
  "title": "Collecting and Characterizing Natural Language Utterances for Specifying Data Visualizations",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2021,
  "badges": [],
  "abstract": "Natural language interfaces (NLIs) for data visualization are becoming increasingly popular both in academic research and in commercial software. Yet, there is a lack of empirical understanding of how people specify visualizations through natural language. We conducted an online study (N = 102), showing participants a series of visualizations and asking them to provide utterances they would pose to generate the displayed charts. From the responses, we curated a dataset of 893 utterances and characterized the utterances according to (1) their phrasing (e.g., commands, queries, questions) and (2) the information they contained (e.g., chart types, data aggregations). To help guide future research and development, we contribute this utterance dataset and discuss its applications toward the creation and benchmarking of NLIs for visualization.",
  "authors": [
    {
      "name": "Arjun Srinivasan",
      "institution": "Tableau Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196818",
      "orcid": "0000-0001-8901-1256"
    },
    {
      "name": "Nikhila Nyapathy",
      "institution": "Georgia Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480621",
      "orcid": "missing"
    },
    {
      "name": "Bongshin Lee",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593205",
      "orcid": "0000-0002-4217-627X"
    },
    {
      "name": "Steven M. Drucker",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100090466",
      "orcid": "0000-0002-5022-9343"
    },
    {
      "name": "John Stasko",
      "institution": "School of Interactive Computing Georgia Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81100573160/rel-imgonly/stasko-06oct-small.jpg",
      "acmid": "81100573160",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ken Acquah. 2020. Examples using GPT-3 to create data visualizations.https://twitter.com/aquariusacquah/status/1285415144017797126.",
      "doi": ""
    },
    {
      "text": "Robert Amar, James Eagan, and John Stasko. 2005. Low-level components of analytic activity in information visualization. In IEEE Symposium on Information Visualization. IEEE, Piscataway, NJ, USA, 111–117.",
      "doi": ""
    },
    {
      "text": "Stanislaw Antol, Aishwarya Agrawal, Jiasen Lu, Margaret Mitchell, Dhruv Batra, C Lawrence Zitnick, and Devi Parikh. 2015. VQA: Visual question answering. In Proceedings of the IEEE International Conference on Computer Vision (ICCV). IEEE, Piscataway, NJ, USA, 2425–2433.",
      "doi": "10.1109/ICCV.2015.279"
    },
    {
      "text": "Leilani Battle, Peitong Duan, Zachery Miranda, Dana Mukusheva, Remco Chang, and Michael Stonebraker. 2018. Beagle: Automated extraction and interpretation of visualizations from the web. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 594:1–594:8.",
      "doi": "10.1145/3173574.3174168"
    },
    {
      "text": "Jonathan Berant, Andrew Chou, Roy Frostig, and Percy Liang. 2013. Semantic parsing on freebase from question-answer pairs. In Proceedings of the Conference on Empirical Methods in Natural Language Processing (EMNLP). ACL, Westfield, NJ, USA, 1533–1544.",
      "doi": ""
    },
    {
      "text": "Tom B Brown, Benjamin Mann, Nick Ryder, Melanie Subbiah, Jared Kaplan, Prafulla Dhariwal, Arvind Neelakantan, Pranav Shyam, Girish Sastry, Amanda Askell, 2020. Language models are few-shot learners. arxiv:2005.14165 [cs.CL]",
      "doi": ""
    },
    {
      "text": "Weiwei Cui, Xiaoyu Zhang, Yun Wang, He Huang, Bei Chen, Lei Fang, Haidong Zhang, Jian-Guan Lou, and Dongmei Zhang. 2019. Text-to-viz: Automatic generation of infographics from proportion-related natural language statements. IEEE Transactions on Visualization and Computer Graphics 26, 1(2019), 906–916.",
      "doi": ""
    },
    {
      "text": "Abhishek Das, Satwik Kottur, Khushi Gupta, Avi Singh, Deshraj Yadav, José MF Moura, Devi Parikh, and Dhruv Batra. 2017. Visual dialog. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR). IEEE, Piscataway, NJ, USA, 326–335.",
      "doi": ""
    },
    {
      "text": "Siwei Fu, Kai Xiong, Xiaodong Ge, Siliang Tang, Wei Chen, and Yingcai Wu. 2020. Quda: Natural Language Queries for Visual Data Analytics. arxiv:2005.03257v2 [cs.CL]",
      "doi": ""
    },
    {
      "text": "Tong Gao, Mira Dontcheva, Eytan Adar, Zhicheng Liu, and Karrie G Karahalios. 2015. Datatone: Managing ambiguity in natural language interfaces for data visualization. In Proceedings of the ACM Symposium on User Interface Software & Technology (UIST). ACM, New York, NY, USA, 489–500.",
      "doi": "10.1145/2807442.2807478"
    },
    {
      "text": "Lars Grammel, Melanie Tory, and Margaret-Anne Storey. 2010. How information visualization novices construct visualizations. IEEE Transactions on Visualization and Computer Graphics 16, 6(2010), 943–952.",
      "doi": "10.1109/TVCG.2010.164"
    },
    {
      "text": "Enamul Hoque, Vidya Setlur, Melanie Tory, and Isaac Dykeman. 2017. Applying pragmatics principles for interaction with visual analytics. IEEE Transactions on Visualization and Computer Graphics 24, 1(2017), 309–318.",
      "doi": ""
    },
    {
      "text": "Dae Hyun Kim, Enamul Hoque, and Maneesh Agrawala. 2020. Answering Questions about Charts and Generating Visual Explanations. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 340:1–340:13.",
      "doi": "10.1145/3313831.3376467"
    },
    {
      "text": "Chufan Lai, Zhixian Lin, Ruike Jiang, Yun Han, Can Liu, and Xiaoru Yuan. 2020. Automatic Annotation Synchronizing with Textual Description for Visualization. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 316:1–316:13.",
      "doi": "10.1145/3313831.3376443"
    },
    {
      "text": "Ronald Metoyer, Bongshin Lee, Nathalie Henry Riche, and Mary Czerwinski. 2012. Understanding the verbal language and structure of end-user descriptions of data visualizations. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 1659–1662.",
      "doi": "10.1145/2207676.2208292"
    },
    {
      "text": "Microsoft. 2020. Microsoft Power BI Q&A. https://docs.microsoft.com/en-us/power-bi/consumer/end-user-q-and-a.",
      "doi": ""
    },
    {
      "text": "Dominik Moritz, Chenglong Wang, Greg L Nelson, Halden Lin, Adam M Smith, Bill Howe, and Jeffrey Heer. 2018. Formalizing visualization design knowledge as constraints: Actionable and extensible models in draco. IEEE Transactions on Visualization and Computer Graphics 25, 1(2018), 438–448.",
      "doi": "10.1109/TVCG.2018.2865240"
    },
    {
      "text": "Arpit Narechania, Arjun Srinivasan, and John Stasko. 2021. NL4DV: A Toolkit for Generating Analytic Specifications for Data Visualization from Natural Language Queries. IEEE Transactions on Visualization and Computer Graphics 27, 1(2021), 10 pages.",
      "doi": ""
    },
    {
      "text": "Fabian Pedregosa, Gaël Varoquaux, Alexandre Gramfort, Vincent Michel, Bertrand Thirion, Olivier Grisel, Mathieu Blondel, Peter Prettenhofer, Ron Weiss, Vincent Dubourg, 2011. Scikit-learn: Machine learning in Python. The Journal of Machine Learning Research 12 (2011), 2825–2830.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "Arvind Satyanarayan, Dominik Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2016. Vega-lite: A grammar of interactive graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1(2016), 341–350.",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Vidya Setlur, Sarah E Battersby, Melanie Tory, Rich Gossweiler, and Angel X Chang. 2016. Eviza: A natural language interface for visual analysis. In Proceedings of the ACM Symposium on User Interface Software & Technology (UIST). ACM, New York, NY, USA, 365–377.",
      "doi": "10.1145/2984511.2984588"
    },
    {
      "text": "Vidya Setlur, Melanie Tory, and Alex Djalali. 2019. Inferencing underspecified natural language utterances in visual analysis. In Proceedings of ACM Conference on Intelligent User Interfaces (IUI). ACM, New York, NY, USA, 40–51.",
      "doi": "10.1145/3301275.3302270"
    },
    {
      "text": "Arjun Srinivasan, Bongshin Lee, Nathalie Henry Riche, Steven M Drucker, and Ken Hinckley. 2020. InChorus: Designing Consistent Multimodal Interactions for Data Visualization on Tablet Devices. In Proceedings of the ACM Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 653:1–653:13.",
      "doi": "10.1145/3313831.3376782"
    },
    {
      "text": "Arjun Srinivasan, Bongshin Lee, and John T. Stasko. 2020. Interweaving Multimodal Interaction with Flexible Unit Visualizations for Data Exploration. IEEE Transactions on Visualization and Computer Graphics 27 (2020), 15 pages. https://doi.org/10.1109/TVCG.2020.2978050",
      "doi": ""
    },
    {
      "text": "Arjun Srinivasan and John Stasko. 2017. Orko: Facilitating multimodal interaction for visual exploration and analysis of networks. IEEE Transactions on Visualization and Computer Graphics 24, 1(2017), 511–521.",
      "doi": ""
    },
    {
      "text": "Yiwen Sun, Jason Leigh, Andrew Johnson, and Sangyoon Lee. 2010. Articulate: A semi-automated model for translating natural language queries into meaningful visualizations. In International Symposium on Smart Graphics. Springer, Berlin, Heidelberg, 184–195.",
      "doi": ""
    },
    {
      "text": "Tableau. 2020. Tableau Ask Data. https://www.tableau.com/products/new-features/ask-data.",
      "doi": ""
    },
    {
      "text": "Melanie Tory and Vidya Setlur. 2019. Do what I mean, not what I say! Design considerations for supporting intent and context in analytical conversation. In Proceedings of the IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, Piscataway, NJ, USA, 93–103.",
      "doi": ""
    },
    {
      "text": "Kanit Wongsuphasawat, Dominik Moritz, Anushka Anand, Jock Mackinlay, Bill Howe, and Jeffrey Heer. 2016. Towards a general-purpose query language for visualization recommendation. In Proceedings of the HILDA Workshop. ACM, New York, NY, USA, 1–6.",
      "doi": "10.1145/2939502.2939506"
    },
    {
      "text": "Bowen Yu and Cláudio T Silva. 2019. Flowsense: A natural language interface for visual data exploration within a dataflow system. IEEE Transactions on Visualization and Computer Graphics 26, 1(2019), 1–11.",
      "doi": ""
    },
    {
      "text": "Tao Yu, Rui Zhang, He Yang Er, Suyi Li, Eric Xue, Bo Pang, Xi Victoria Lin, Yi Chern Tan, Tianze Shi, Zihan Li, 2019. Cosql: A conversational text-to-sql challenge towards cross-domain natural language interfaces to databases. arxiv:1909.05378 [cs.CL]",
      "doi": ""
    },
    {
      "text": "Tao Yu, Rui Zhang, Kai Yang, Michihiro Yasunaga, Dongxu Wang, Zifan Li, James Ma, Irene Li, Qingning Yao, Shanelle Roman, 2019. Spider: A large-scale human-labeled dataset for complex and cross-domain semantic parsing and text-to-sql task. arxiv:1809.08887 [cs.CL]",
      "doi": ""
    },
    {
      "text": "Victor Zhong, Caiming Xiong, and Richard Socher. 2017. Seq2SQL: Generating Structured Queries from Natural Language using Reinforcement Learning. arxiv:1709.00103 [cs.CL]",
      "doi": ""
    }
  ]
}