{
  "doi": "10.1145/3411764.3445378",
  "title": "“Disadvantaged in the American-dominated Internet”: Sex, Work, and Technology",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "How do people in a precarious profession leverage technology to grow their business and improve their quality of life? Sex workers sit at the intersection of multiple marginalized identities and make up a sizeable workforce: the United Nations estimates that at least 42 million sex workers are conducting business across the globe. Yet, little research has examined how well technology fulfills sex workers’ business needs in the face of unique social, political, legal, and safety constraints.  We present interviews with 29 sex workers in Germany and Switzerland where such work is legal, offering a first HCI perspective on this population’s use of technology. While our participants demonstrate savvy navigation of online spaces, sex workers encounter frustrating barriers due to an American-dominated internet that enforces puritan values globally. Our findings raise concerns about digital discrimination against sex workers and suggest concrete directions for the design of more inclusive technology.",
  "tags": [
    "sex",
    "sex work",
    "marginalized population",
    "work",
    "harassment",
    "digital workplace",
    "technology",
    "qualitative",
    "interview",
    "discrimination"
  ],
  "authors": [
    {
      "name": "Catherine Barwulor",
      "institution": "School of Computing Clemson University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321226",
      "orcid": "missing"
    },
    {
      "name": "Allison McDonald",
      "institution": "Computer Science & Engineering University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659296796",
      "orcid": "0000-0001-7477-6782"
    },
    {
      "name": "Eszter Hargittai",
      "institution": "University of Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100365282",
      "orcid": "missing"
    },
    {
      "name": "Elissa M. Redmiles",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-87258829257/rel-imgonly/2017headshot.jpg",
      "acmid": "87258829257",
      "orcid": "0000-0003-3930-8128"
    }
  ],
  "references": [
    {
      "text": "Kendra Albert, Emily Armbruster, Elizabeth Brundige, Elizabeth Denning, Kimberly Kim, Lorelei Lee, Lindsey Ruff, Korica Simon, and Yueyu Yang. 2020. FOSTA in Legal Context. Available at SSRN: https://ssrn.com/abstract=3663898.",
      "doi": ""
    },
    {
      "text": "Ali Alkhatib, Michael S. Bernstein, and Margaret Levi. 2017. Examining Crowd Work and Gig Work Through The Historical Lens of Piecework. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4599–4616. https://doi.org/10.1145/3025453.3025974",
      "doi": "10.1145/3025453.3025974"
    },
    {
      "text": "Sean T Allen, Katherine HA Footer, Noya Galai, Ju Nyeong Park, Bradley Silberzahn, and Susan G Sherman. 2019. Implementing targeted sampling: lessons learned from recruiting female sex workers in Baltimore, MD. Journal of Urban Health 96, 3 (2019), 442–451.",
      "doi": ""
    },
    {
      "text": "Payal Arora. 2019. Decolonizing Privacy Studies. Television and New Media 20, 4 (2019), 366–378. https://doi.org/10.1177/1527476418806092",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2011. Pleasure is Your Birthright: Digitally Enabled Designer Sex Toys as a Case of Third-Wave HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 257–266. https://doi.org/10.1145/1978942.1978979",
      "doi": "10.1145/1978942.1978979"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a Feminist HCI Methodology: Social Science, Feminism, and HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 675–684. https://doi.org/10.1145/1978942.1979041",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Genevieve Bell, Mark Blythe, and Phoebe Sengers. 2005. Making by Making Strange: Defamiliarization and the Design of Domestic Technologies. ACM Trans. Comput.-Hum. Interact. 12, 2 (June 2005), 149–173. https://doi.org/10.1145/1067860.1067862",
      "doi": "10.1145/1067860.1067862"
    },
    {
      "text": "Jeremy Birnholtz, Colin Fitzpatrick, Mark Handel, and Jed R. Brubaker. 2014. Identity, Identification and Identifiability: The Language of Self-Presentation on a Location-Based Mobile Dating App. In Proceedings of the 16th International Conference on Human-Computer Interaction with Mobile Devices & Services (Toronto, ON, Canada) (MobileHCI ’14). Association for Computing Machinery, New York, NY, USA, 3–12. https://doi.org/10.1145/2628363.2628406",
      "doi": "10.1145/2628363.2628406"
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and its consequences for online harassment: Design insights from heartmob. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–19.",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Claus Bossen and Martin Foss. 2016. The Collaborative Work of Hospital Porters: Accountability, Visibility and Configurations of Work. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 965–979. https://doi.org/10.1145/2818048.2820002",
      "doi": "10.1145/2818048.2820002"
    },
    {
      "text": "Robin Brewer, Meredith Ringel Morris, and Anne Marie Piper. 2016. ”Why Would Anybody Do This?”: Understanding Older Adults’ Motivations and Challenges in Crowd Work. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2246–2257. https://doi.org/10.1145/2858036.2858198",
      "doi": "10.1145/2858036.2858198"
    },
    {
      "text": "Tammy Castle and Jenifer Lee. 2008. Ordering sex in cyberspace: A content analysis of escort websites. International Journal of Cultural Studies 11, 1 (2008), 107–121. https://doi.org/10.1177/1367877907086395",
      "doi": ""
    },
    {
      "text": "Scott Cunningham and Todd D. Kendall. 2011. Prostitution 2.0: The changing face of sex work. Journal of Urban Economics 69, 3 (2011), 273–287. https://doi.org/10.1016/j.jue.2010.12.001",
      "doi": ""
    },
    {
      "text": "Avery P. Dame-Griff. 2020. Trans Cultures Online. In The International Encyclopedia of Gender, Media, and Communication. Wiley, Hoboken, NJ, USA, 1–6. https://doi.org/10.1002/9781119429128.iegmc041",
      "doi": ""
    },
    {
      "text": "Colin Fitzpatrick and Jeremy Birnholtz. 2018. “I Shut the Door”: Interactions, tensions, and negotiations from a location-based social app. New Media and Society 20, 7 (2018), 2469–2488. https://doi.org/10.1177/1461444817725064",
      "doi": ""
    },
    {
      "text": "Assembly Four. Accessed 2020-09-16. Empowering sex workers through technology.https://assemblyfour.com.",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. “A Stalker’s Paradise”: How Intimate Partner Abusers Exploit Technology. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174241",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Christine Geeng, Jevan Hutson, and Franziska Roesner. 2020. Usable Sexurity: Studying People’s Concerns and Strategies When Sexting. In Sixteenth Symposium on Usable Privacy and Security (SOUPS 2020). USENIX Association, Berkeley, CA, USA, 127–144. https://www.usenix.org/conference/soups2020/presentation/geeng",
      "doi": ""
    },
    {
      "text": "Jennifer L. Gibbs, Nicole B. Ellison, and Chih Hui Lai. 2011. First comes love, then comes google: An investigation of uncertainty reduction strategies and self-disclosure in online dating. Communication Research 38, 1 (2011), 70–100. https://doi.org/10.1177/0093650210377091",
      "doi": ""
    },
    {
      "text": "Krista J. Gile, Isabelle S. Beaudry, Mark S. Handcock, and Miles Q. Ott. 2018. Methods for Inference from Respondent-Driven Sampling Data. Annual Review of Statistics and Its Application 5 (2018), 65–93. https://doi.org/10.1146/annurev-statistics-031017-100704",
      "doi": ""
    },
    {
      "text": "Tarleton Gillespie. 2018. Custodians of the Internet: Platforms, content moderation, and the hidden decisions that shape social media. Yale University Press, New Haven & London.",
      "doi": ""
    },
    {
      "text": "Alison L. Grittner and Christine A. Walsh. 2020. The Role of Social Stigma in the Lives of Female-Identified Sex Workers: A Scoping Review. Sexuality and Culture 24, 5 (2020), 1653–1682. https://doi.org/10.1007/s12119-020-09707-7",
      "doi": ""
    },
    {
      "text": "Tamy Guberek, Allison McDonald, Sylvia Simioni, Abraham H. Mhaidli, Kentaro Toyama, and Florian Schaub. 2018. Keeping a Low Profile? Technology, Risk and Privacy among Undocumented Immigrants. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3173574.3173688",
      "doi": "10.1145/3173574.3173688"
    },
    {
      "text": "Hacking//Hustling. n.d.. Online Platforms and Sex Worker Discrimination. https://hackinghustling.org/online-platforms-sex-worker-discrimination/. (Accessed on 01/11/2021).",
      "doi": ""
    },
    {
      "text": "Margaret C Harrell and Melissa A Bradley. 2009. Data collection methods. Semi-structured interviews and focus groups. Technical Report. Rand National Defense Research Inst santa monica ca.",
      "doi": ""
    },
    {
      "text": "Andrew Gary Darwin Holmes. 2020. Researcher Positionality–A Consideration of Its Influence and Place in Qualitative Research–A New Researcher Guide.Shanlax International Journal of Education 8, 4 (2020), 1–10.",
      "doi": ""
    },
    {
      "text": "Julie Hui, Kentaro Toyama, Joyojeet Pal, and Tawanna Dillahunt. 2018. Making a Living My Way: Necessity-driven Entrepreneurship in Resource-Constrained Communities. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–24.",
      "doi": "10.1145/3274340"
    },
    {
      "text": "Sandy E. James, Jody L Herman, Susan Rankin, Mara Keisling, LIsa Mottet, and Ma’ayan Anafi. 2016. The Report of the 2015 U.S. Transgender Survey. Technical Report. National Center for Transgender Equality. 302 pages. http://www.transequality.org/sites/default/files/docs/USTS-Full-Report-FINAL.PDF",
      "doi": ""
    },
    {
      "text": "Lisa Grazina Johnston, Keith Sabin, Mai Thu Hien, and Pham Thi Huong. 2006. Assessment of respondent driven sampling for recruiting female sex workers in two Vietnamese cities: reaching the unseen sex worker. Journal of Urban Health 83, 1 (2006), 16–28.",
      "doi": ""
    },
    {
      "text": "Angela Jones. 2015. Sex Work in a Digital Era. Sociology Compass 9, 7 (2015), 558–570. https://doi.org/10.1111/soc4.12282",
      "doi": ""
    },
    {
      "text": "Angela Jones. 2020. Camming. NYU Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Gopinaath Kannabiran, Alex A. Ahmed, Matthew Wood, Madeline Balaam, Theresa Jean Tanenbaum, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Design for Sexual Wellbeing in HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3170427.3170639",
      "doi": ""
    },
    {
      "text": "Gopinaath Kannabiran, Jeffrey Bardzell, and Shaowen Bardzell. 2011. How HCI Talks about Sexuality: Discursive Strategies, Blind Spots, and Opportunities for Future Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 695–704. https://doi.org/10.1145/1978942.1979043",
      "doi": "10.1145/1978942.1979043"
    },
    {
      "text": "Keiko Katsuragawa, Qi Shu, and Edward Lank. 2019. PledgeWork: Online Volunteering through Crowdwork. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300541",
      "doi": "10.1145/3290605.3300541"
    },
    {
      "text": "Aniket Kittur, Jeffrey V. Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease, and John Horton. 2013. The Future of Crowd Work. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1301–1318. https://doi.org/10.1145/2441776.2441923",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Ada Lerner, Helen Yuxun He, Anna Kawakami, Silvia Catherine Zeamer, and Roberto Hoyle. 2020. Privacy and Activism in the Transgender Community. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376339",
      "doi": "10.1145/3313831.3376339"
    },
    {
      "text": "Dana Lone Hill. 2015. Facebook don’t believe in Indian names. Last Real Indians. https://lastrealindians.com/news/2015/2/6/feb-6-2015-facebook-dont-believe-in-indian-names-by-dana-lone-hill.",
      "doi": ""
    },
    {
      "text": "Gus Lubin. 2012. There Are 42 Million Prostitutes In The World, And Here’s Where They Live. Business Insider. https://www.businessinsider.com/there-are-42-million-prostitutes-in-the-world-and-heres-where-they-live-2012-1.",
      "doi": ""
    },
    {
      "text": "Alice E. Marwick and danah boyd. 2011. I tweet honestly, I tweet passionately: Twitter users, context collapse, and the imagined audience. New Media & Society 13, 1 (2011), 114–133. https://doi.org/10.1177/1461444810365313",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and inter-rater reliability in qualitative research: Norms and guidelines for CSCW and HCI practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "M Giovanna Merli, James Moody, Jeffrey Smith, Jing Li, Sharon Weir, and Xiangsheng Chen. 2015. Challenges to recruiting population representative samples of female sex workers in China using Respondent Driven Sampling. Social Science & Medicine 125 (2015), 79–93.",
      "doi": ""
    },
    {
      "text": "Lil Miss Hot Mess. 2015. Selfies and side-eye: Drag queens take on facebook. Studies in Gender and Sexuality 16, 2 (2015), 144–146. https://doi.org/10.1080/15240657.2015.1038202",
      "doi": ""
    },
    {
      "text": "Stefania Milan and Emiliano Treré. 2019. Big Data from the South(s): Beyond Data Universalism. Television and New Media 20, 4 (2019), 319–335. https://doi.org/10.1177/1527476419837739",
      "doi": ""
    },
    {
      "text": "Matthew B Miles, A Michael Huberman, and Johnny Saldaña. 2014. Qualitative data analysis: A methods sourcebook. 3rd.",
      "doi": ""
    },
    {
      "text": "Monero. Accessed 2020-09-16. What is Monero?https://web.getmonero.org/get-started/what-is-monero/.",
      "doi": ""
    },
    {
      "text": "Jessica D. Moorman and Kristen Harrison. 2016. Gender, Race, and Risk: Intersectional Risk Management in the Sale of Sex Online. Journal of Sex Research 53, 7 (2016), 816–824. https://doi.org/10.1080/00224499.2015.1065950",
      "doi": ""
    },
    {
      "text": "Livia J. Müller, Klaus Opwis, and Elisa D. Mekler. 2018. “In a good way weird”: Exploring positive experiences with technology-mediated pornography. Conference on Human Factors in Computing Systems - Proceedings 2018-April (2018), 1–6. https://doi.org/10.1145/3170427.3188527",
      "doi": "10.1145/3170427.3188527"
    },
    {
      "text": "Michael J Muller and Sandra Kogan. 2010. Grounded theory method in HCI and CSCW. Technical Report. IBM Center for Social Software. 1–46 pages.",
      "doi": ""
    },
    {
      "text": "Satoshi Nakamoto. 2008. Bitcoin: A Peer-to-Peer Electronic Cash System. https://bitcoin.org/bitcoin.pdf.",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of Oppression. NYU Press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Tyler Pace, Katie O’Donnell, Natalie DeWitt, Shaowen Bardzell, and Jeffrey Bardzell. 2013. From Organizational to Community Creativity: Paragon Leadership & Creativity Stories at Etsy. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1023–1034. https://doi.org/10.1145/2441776.2441892",
      "doi": "10.1145/2441776.2441892"
    },
    {
      "text": "Jane Pitcher and Marjan Wijers. 2014. The impact of different regulatory models on the labour conditions, safety and welfare of indoor-based sex workers. Criminology and Criminal Justice 14, 5 (2014), 549–564. https://doi.org/10.1177/1748895814531967",
      "doi": ""
    },
    {
      "text": "L. Platt, P. Grenfell, R. Meiksin, J. Elmes, S. G. Sherman, T. Sanders, P. Mwangi, and A. L. Crago. 2018. Associations between sex work laws and sex workers’ health: A systematic review and meta-analysis of quantitative and qualitative studies. PLoS Med 15, 12 (12 2018), e1002680.",
      "doi": ""
    },
    {
      "text": "Elissa M. Redmiles. 2020. Behind the Red Lights: Methods for Investigating the Digital Security and Privacy Experiences of Sex Workers. In Research Exposed: How Empirical Social Science Gets Done in the Digital Age, Eszter Hargittai (Ed.). Columbia University Press, Columbia, Chapter 5, 101–122.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Julie Weber, and Edward Cutrell. 2011. Designing a Phone Broadcasting System for Urban Sex Workers in India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 267–276. https://doi.org/10.1145/1978942.1978980",
      "doi": "10.1145/1978942.1978980"
    },
    {
      "text": "Teela Sanders, Laura Connelly, and Laura Jarvis King. 2016. On Our Own Terms: The Working Conditions of Internet-Based Sex Workers in the UK. Sociological Research Online 21, 4 (2016), 133–146. https://doi.org/10.5153/sro.4152",
      "doi": ""
    },
    {
      "text": "Teela Sanders, Jane Scoular, Rosie Campbell, Jane Pitcher, and Stewart Cunningham. 2018. Internet Sex Work: Beyond the Gaze. Palgrave Macmillan, London, UK.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Stacy M. Branham, and Foad Hamidi. 2018. Safe Spaces and Safe Places. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (nov 2018), 1–27. https://doi.org/10.1145/3274424",
      "doi": "10.1145/3274424"
    },
    {
      "text": "Simon Schutz. 2019. Cash Is Still King For Many In Germany. https://www.npr.org/2019/06/09/728323278/for-many-germans-cash-is-still-king. (Accessed on 01/11/2021).",
      "doi": ""
    },
    {
      "text": "Frances M. Shaver. 2005. Sex Work Research. Journal of Interpersonal Violence 20, 3 (mar 2005), 296–319. https://doi.org/10.1177/0886260504274340",
      "doi": ""
    },
    {
      "text": "Sebastian Shehadi and Miriam Partington. 2020. Coronavirus: Offline sex workers forced to start again online. BBC. https://www.bbc.com/news/technology-52183773.",
      "doi": ""
    },
    {
      "text": "Zahra Stardust. 2018. Safe for Work: Feminist Porn, Corporate Regulation and Community Standards. In Orienting Feminism: Media, Activism and Cultural Representation, Catherine Daleand Rosemary Overell (Eds.). Springer International Publishing, Cham, 155–179. https://doi.org/10.1007/978-3-319-70660-3_9",
      "doi": ""
    },
    {
      "text": "Anselm L Strauss and Juliet M Corbin (Eds.). 1997. Grounded theory in practice.Sage Publications, Inc, Thousand Oaks, CA, US. viii, 280–viii, 280 pages.",
      "doi": ""
    },
    {
      "text": "Angelika Strohmayer, Jenn Clamen, and Mary Laing. 2019. Technologies for Social Justice: Lessons from Sex Workers on the Front Lines. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–14. https://doi.org/10.1145/3290605.3300882",
      "doi": "10.1145/3290605.3300882"
    },
    {
      "text": "Angelika Strohmayer, Mary Laing, and Rob Comber. 2017. Technologies and social justice outcomes in sex work charities: Fighting stigma, saving lives. Conference on Human Factors in Computing Systems - Proceedings 2017-May (2017), 3352–3364. https://doi.org/10.1145/3025453.3025615",
      "doi": "10.1145/3025453.3025615"
    },
    {
      "text": "Switter. Accessed 2020-09-16. A sex work-friendly social space.https://switter.at/about/more.",
      "doi": ""
    },
    {
      "text": "TAMPEP. 2009. Sex Work Migration Health. A report on the intersections of legislations and policies regarding sex work, migration and health in Europe. Technical Report. TAMPEP International Foundation.",
      "doi": ""
    },
    {
      "text": "Beyond the Gaze. 2018. Practice Guidance for Working With Online Sex Workers. https://www.beyond-the-gaze.com/wp-content/uploads/2018/11/BtGpracticeguidancewedversionfinal.pdf.",
      "doi": ""
    },
    {
      "text": "Erin Tichenor. 2020. ’I’ve Never Been So Exploited’: The consequences of FOSTA-SESTA in Aotearoa New Zealand. Anti-Trafficking Review 14 (2020), 99–115. https://doi.org/10.14197/atr.201220147",
      "doi": ""
    },
    {
      "text": "Tryst. Accessed 2020-09-16. About. https://tryst.link/about.",
      "doi": ""
    },
    {
      "text": "United Nations. 2015. Sex workers: Population size estimate [Data File]. http://data.un.org/Search.aspx?q=Sex+workers%3A+Population+size+estimate. (Accessed on 01/12/2021).",
      "doi": ""
    },
    {
      "text": "Mark Warner, Andreas Gutmann, M. Angela Sasse, and Ann Blandford. 2018. Privacy Unraveling Around Explicit HIV Status Disclosure Fields in the Online Geosocial Hookup App Grindr. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (nov 2018), 1–22. https://doi.org/10.1145/3274450",
      "doi": "10.1145/3274450"
    },
    {
      "text": "Amanda M. Williams and Lilly Irani. 2010. There’s Methodology in the Madness: Toward Critical HCI Ethnography. In CHI ’10 Extended Abstracts on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI EA ’10). Association for Computing Machinery, New York, NY, USA, 2725–2734. https://doi.org/10.1145/1753846.1753857",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, Heather Lipford, and David Wilson. 2012. Fighting for My Space: Coping Mechanisms for Sns Boundary Regulation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 609–618. https://doi.org/10.1145/2207676.2207761",
      "doi": "10.1145/2207676.2207761"
    },
    {
      "text": "Matthew Wood, Gavin Wood, and Madeline Balaam. 2017. ”They’re Just Tixel Pits, Man”: Disputing the ’Reality’ of Virtual Reality Pornography through the Story Completion Method. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5439–5451. https://doi.org/10.1145/3025453.3025762",
      "doi": "10.1145/3025453.3025762"
    },
    {
      "text": "Zcash. Accessed 2020-09-16. The Basics. https://z.cash/the-basics/.",
      "doi": ""
    }
  ]
}