{
  "doi": "10.1145/3411764.3445101",
  "title": "Exploring and Promoting Diagnostic Transparency and Explainability in Online Symptom Checkers",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "Online symptom checkers (OSC) are widely used intelligent systems in health contexts such as primary care, remote healthcare, and epidemic control. OSCs use algorithms such as machine learning to facilitate self-diagnosis and triage based on symptoms input by healthcare consumers. However, intelligent systems’ lack of transparency and comprehensibility could lead to unintended consequences such as misleading users, especially in high-stakes areas such as healthcare. In this paper, we attempt to enhance diagnostic transparency by augmenting OSCs with explanations. We first conducted an interview study (N=25) to specify user needs for explanations from users of existing OSCs. Then, we designed a COVID-19 OSC that was enhanced with three types of explanations. Our lab-controlled user study (N=20) found that explanations can significantly improve user experience in multiple aspects. We discuss how explanations are interwoven into conversation flow and present implications for future OSC designs.",
  "tags": [
    "Symptom Checker",
    "Explanation",
    "Transparency",
    "Health",
    "COVID-19"
  ],
  "authors": [
    {
      "name": "Chun-Hua Tsai",
      "institution": "College of Information Sciences and Technology Pennsylvania State University, United States",
      "img": "/do/10.1145/contrib-89758853357/rel-imgonly/20220902_is_t_headshot_31.jpg",
      "acmid": "89758853357",
      "orcid": "missing"
    },
    {
      "name": "Yue You",
      "institution": "College of Information Sciences and Technology Pennsylvania State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701469",
      "orcid": "missing"
    },
    {
      "name": "Xinning Gui",
      "institution": "College of Information Sciences and Technology Pennsylvania State University, United States",
      "img": "/do/10.1145/contrib-99658649184/rel-imgonly/with_melon_2.jpeg",
      "acmid": "99658649184",
      "orcid": "0000-0002-9436-7940"
    },
    {
      "name": "Yubo Kou",
      "institution": "College of Information Sciences and Technology Pennsylvania State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020443",
      "orcid": "0000-0002-4255-3725"
    },
    {
      "name": "John M. Carroll",
      "institution": "College of Information Sciences and Technology Pennsylvania State University, United States",
      "img": "/do/10.1145/contrib-81350576124/rel-imgonly/image001.jpg",
      "acmid": "81350576124",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Stephanie Aboueid, Rebecca H Liu, Binyam Negussie Desta, Ashok Chaurasia, and Shanil Ebrahim. 2019. The use of artificially intelligent Self-Diagnosing digital platforms by the general public: Scoping review. JMIR medical informatics 7, 2 (2019), e13445.",
      "doi": ""
    },
    {
      "text": "Andrew Anderson, Jonathan Dodge, Amrita Sadarangani, Zoe Juozapaitis, Evan Newman, Jed Irvine, Souti Chattopadhyay, Matthew Olson, Alan Fern, and Margaret Burnett. 2020. Mental Models of Mere Mortals with Explanations of Reinforcement Learning. ACM Transactions on Interactive Intelligent Systems (TiiS) 10, 2(2020), 1–37.",
      "doi": "10.1145/3366485"
    },
    {
      "text": "AC Berry, BD Cash, B Wang, MS Mulekar, AB Van Haneghan, K Yuquimpo, A Swaney, MC Marshall, and WK Green. 2019. Online symptom checker diagnostic and triage accuracy for HIV and hepatitis C. Epidemiology & Infection 147 (2019).",
      "doi": ""
    },
    {
      "text": "Andrew C Berry, Brooks D Cash, Madhuri S Mulekar, Bin Wang, Anne Melvin, and Bruce B Berry. 2017. Symptom checkers vs. doctors, the ultimate test: a prospective study of patients presenting with abdominal pain. Gastroenterology 152, 5 (2017), S852–S853.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Susan E Brennan. 1990. Conversation as direct manipulation: An iconoclastic view. The art of human-computer interface design(1990), 393–404.",
      "doi": ""
    },
    {
      "text": "CDC. 2020. Coronavirus Self-Checker. https://www.cdc.gov/coronavirus/2019-ncov/symptoms-testing/coronavirus-self-checker.html",
      "doi": ""
    },
    {
      "text": "Duncan Chambers, Anna J Cantrell, Maxine Johnson, Louise Preston, Susan K Baxter, Andrew Booth, and Janette Turner. 2019. Digital and online symptom checkers and health assessment/triage services for urgent health problems: systematic review. BMJ open 9, 8 (2019), e027743.",
      "doi": ""
    },
    {
      "text": "Christina Cheng and Matthew Dunn. 2015. Health literacy and the Internet: a study on the readability of Australian online health information. Australian and New Zealand journal of public health 39, 4 (2015), 309–314.",
      "doi": ""
    },
    {
      "text": "J Copestake. 2018. Babylon claims its chatbot beats GPs at medical exam. BBC News 2018 Jun 27. https://www.bbc.com/news/technology-44635134",
      "doi": ""
    },
    {
      "text": "Benjamin Marshall Davies, Colin Fraser Munro, and Mark RN Kotter. 2019. A novel insight into the challenges of diagnosing degenerative cervical myelopathy using web-based symptom Checkers. Journal of medical Internet research 21, 1 (2019), e10868.",
      "doi": ""
    },
    {
      "text": "David DeVault, Ron Artstein, Grace Benn, Teresa Dey, Ed Fast, Alesia Gainer, Kallirroi Georgila, Jon Gratch, Arno Hartholt, Margaux Lhommet, 2014. SimSensei Kiosk: A virtual human interviewer for healthcare decision support. In Proceedings of the 2014 international conference on Autonomous agents and multi-agent systems. 1061–1068.",
      "doi": ""
    },
    {
      "text": "Cecilia di Sciascio, Peter Brusilovsky, and Eduardo Veas. 2018. A study on user-controllable social exploratory search. In 23rd International Conference on Intelligent User Interfaces. ACM, 353–364.",
      "doi": "10.1145/3172944.3172986"
    },
    {
      "text": "Vicente Dominguez, Pablo Messina, Ivania Donoso-Guzmán, and Denis Parra. 2019. The effect of explanations and algorithmic accuracy on visual recommender systems of artistic images. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 408–416.",
      "doi": "10.1145/3301275.3302274"
    },
    {
      "text": "Upol Ehsan, Pradyumna Tambwekar, Larry Chan, Brent Harrison, and Mark O Riedl. 2019. Automated rationale generation: a technique for explainable AI and its effects on human perceptions. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 263–274.",
      "doi": "10.1145/3301275.3302316"
    },
    {
      "text": "Hamish Fraser, Enrico Coiera, and David Wong. 2018. Safety of patient-facing digital symptom checkers. The Lancet 392, 10161 (2018), 2263–2264.",
      "doi": ""
    },
    {
      "text": "Gerhard Friedrich and Markus Zanker. 2011. A taxonomy for generating explanations in recommender systems. AI Magazine 32, 3 (2011), 90–98.",
      "doi": ""
    },
    {
      "text": "Fatih Gedikli, Dietmar Jannach, and Mouzhi Ge. 2014. How should I explain? A comparison of different explanation types for recommender systems. International Journal of Human-Computer Studies 72, 4 (2014), 367–382.",
      "doi": "10.1016/j.ijhcs.2013.12.007"
    },
    {
      "text": "Joe Greek. 2017. Artificial Intelligence: Clever Computers and Smart Machines. The Rosen Publishing Group, Inc.",
      "doi": ""
    },
    {
      "text": "Julio Guerra-Hollstein, Jordan Barria-Pineda, Christian D Schunn, Susan Bull, and Peter Brusilovsky. 2017. Fine-Grained Open Learner Models: Complexity Versus Support. In Proceedings of the 25th Conference on User Modeling, Adaptation and Personalization. ACM, 41–49.",
      "doi": "10.1145/3079628.3079682"
    },
    {
      "text": "David Gunning. 2017. Explainable artificial intelligence (xai). Defense Advanced Research Projects Agency (DARPA), nd Web 2 (2017).",
      "doi": ""
    },
    {
      "text": "Kristen Hanich, Yilan Jiang, and Pooja Kamble. 2019. Virtual Care and Remote Monitoring: Connected Health at Home. https://www.bbc.com/news/technology-44635134",
      "doi": ""
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Ada Health. 2020. About the Ada COVID-19 assessment and screener. https://ada.com/covid-19-screener/",
      "doi": ""
    },
    {
      "text": "Sutter Health. 2019. Sutter Health Teams Up With Ada Health to Improve Patient Care with On-Demand Healthcare Guidance. http://www.mobilehealthtimes.com/sutter-health-teams-up-with-ada-health-to-improve-patient-care-by-delivering-on-demand-healthcare-guidance/",
      "doi": ""
    },
    {
      "text": "Mathijs P Hendriks, Xander AAM Verbeek, Thijs van Vegchel, Maurice JC van der Sangen, Luc JA Strobbe, Jos WS Merkus, Harmien M Zonderland, Carolien H Smorenburg, Agnes Jager, and Sabine Siesling. 2019. Transformation of the National Breast Cancer guideline into data-driven clinical decision trees. JCO clinical cancer informatics 3 (2019), 1–14.",
      "doi": ""
    },
    {
      "text": "Jonathan L Herlocker, Joseph A Konstan, and John Riedl. 2000. Explaining collaborative filtering recommendations. In Proceedings of the 2000 ACM conference on Computer supported cooperative work. ACM, 241–250.",
      "doi": "10.1145/358916.358995"
    },
    {
      "text": "Denis J Hilton. 1990. Conversational processes and causal explanation.Psychological Bulletin 107, 1 (1990), 65.",
      "doi": ""
    },
    {
      "text": "Andreas Holzinger, Chris Biemann, Constantinos S Pattichis, and Douglas B Kell. 2017. What do we need to build explainable AI systems for the medical domain?(2017). arXiv:1712.09923",
      "doi": ""
    },
    {
      "text": "M Shamim Hossain, Ghulam Muhammad, and Nadra Guizani. 2020. Explainable AI and mass surveillance system-based healthcare framework to combat COVID-I9 like pandemics. IEEE Network 34, 4 (2020), 126–132.",
      "doi": ""
    },
    {
      "text": "Dietmar Jannach, Sidra Naveed, and Michael Jugovac. 2016. User control in recommender systems: Overview and interaction challenges. In International Conference on Electronic Commerce and Web Technologies. Springer, 21–33.",
      "doi": ""
    },
    {
      "text": "Timothy J Judson, Anobel Y Odisho, Aaron B Neinstein, Jessica Chao, Aimee Williams, Christopher Miller, Tim Moriarty, Nathaniel Gleason, Gina Intinarelli, and Ralph Gonzales. 2020. Rapid design and implementation of an integrated patient self-triage and self-scheduling tool for COVID-19. Journal of the American Medical Informatics Association 27, 6(2020), 860–866.",
      "doi": ""
    },
    {
      "text": "Annemarie Jutel and Deborah Lupton. 2015. Digitizing diagnosis: a review of mobile applications in the diagnostic process. Diagnosis 2, 2 (2015), 89–96.",
      "doi": ""
    },
    {
      "text": "Cheng-Kai Kao and David M Liebovitz. 2017. Consumer mobile health apps: current state, barriers, and future directions. PM&R 9, 5 (2017), S106–S115.",
      "doi": ""
    },
    {
      "text": "Boris Kment. 2006. Counterfactuals and explanation. Mind 115, 458 (2006), 261–310.",
      "doi": ""
    },
    {
      "text": "Bart P Knijnenburg, Svetlin Bostandjiev, John O’Donovan, and Alfred Kobsa. 2012. Inspectability and control in social recommenders. In Proceedings of the sixth ACM conference on Recommender systems. ACM, 43–50.",
      "doi": "10.1145/2365952.2365966"
    },
    {
      "text": "Bart P Knijnenburg and Martijn C Willemsen. 2015. Evaluating recommender systems with user experiments. In Recommender Systems Handbook. Springer, 309–352.",
      "doi": ""
    },
    {
      "text": "Bart P Knijnenburg, Martijn C Willemsen, Zeno Gantner, Hakan Soncu, and Chris Newell. 2012. Explaining the user experience of recommender systems. User Modeling and User-Adapted Interaction 22, 4-5 (2012), 441–504.",
      "doi": "10.1007/s11257-011-9118-4"
    },
    {
      "text": "Pigi Kouki, James Schaffer, Jay Pujara, John O’Donovan, and Lise Getoor. 2017. User preferences for hybrid explanations. In Proceedings of the Eleventh ACM Conference on Recommender Systems. 84–88.",
      "doi": "10.1145/3109859.3109915"
    },
    {
      "text": "Pigi Kouki, James Schaffer, Jay Pujara, John O’Donovan, and Lise Getoor. 2019. Personalized explanations for hybrid recommender systems. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 379–390.",
      "doi": "10.1145/3301275.3302306"
    },
    {
      "text": "Q Vera Liao, Daniel Gruen, and Sarah Miller. 2020. Questioning the AI: Informing Design Practices for Explainable AI User Experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376590"
    },
    {
      "text": "Q Vera Liao, Muhammed Mas-ud Hussain, Praveen Chandar, Matthew Davis, Yasaman Khazaeni, Marco Patricio Crasso, Dakuo Wang, Michael Muller, N Sadat Shami, and Werner Geyer. 2018. All Work and No Play?. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173577"
    },
    {
      "text": "Ewa Luger and Abigail Sellen. 2016. ” Like Having a Really Bad PA” The Gulf between User Expectation and Experience of Conversational Agents. In Proceedings of the 2016 CHI conference on human factors in computing systems. 5286–5297.",
      "doi": "10.1145/2858036.2858288"
    },
    {
      "text": "Deborah Lupton and Annemarie Jutel. 2015. ‘It’s like having a physician in your pocket!’A critical analysis of self-diagnosis smartphone apps. Social Science & Medicine 133 (2015), 128–135.",
      "doi": ""
    },
    {
      "text": "Martijn Millecamp, Nyi Nyi Htun, Cristina Conati, and Katrien Verbert. 2019. To Explain or not to Explain: the Effects of Personal Characteristics when Explaining Music Recommendations. In Proceedings of the 2019 Conference on Intelligent User Interface. ACM, 1–12.",
      "doi": "10.1145/3301275.3302313"
    },
    {
      "text": "Michael L Millenson, Jessica L Baldwin, Lorri Zipperer, and Hardeep Singh. 2018. Beyond Dr. Google: the evidence on consumer-facing digital tools for diagnosis. Diagnosis 5, 3 (2018), 95–105.",
      "doi": ""
    },
    {
      "text": "Tim Miller. 2019. Explanation in artificial intelligence: Insights from the social sciences. Artificial Intelligence 267 (2019), 1–38.",
      "doi": ""
    },
    {
      "text": "Biswajit Mohanty, Abrar Chughtai, and Fethi Rabhi. 2019. Use of Mobile Apps for epidemic surveillance and response–availability and gaps.Global Biosecurity 1, 2 (2019).",
      "doi": ""
    },
    {
      "text": "University of Iowa Hospitals & Clinics. 2020. Check Your COVID-19 Risk Online. https://uihc.org/check-your-covid-19-risk-online",
      "doi": ""
    },
    {
      "text": "Alexis Papadimitriou, Panagiotis Symeonidis, and Yannis Manolopoulos. 2012. A generalized taxonomy of explanations styles for traditional and social recommender systems. Data Mining and Knowledge Discovery 24, 3 (2012), 555–583.",
      "doi": "10.1007/s10618-011-0215-0"
    },
    {
      "text": "Denis Parra and Peter Brusilovsky. 2015. User-controllable personalization: A case study with SetFusion. International Journal of Human-Computer Studies 78 (2015), 43–67.",
      "doi": "10.1016/j.ijhcs.2015.01.007"
    },
    {
      "text": "Urja Pawar, Donna O’Shea, Susan Rea, and Ruairi O’Reilly. 2020. Explainable ai in healthcare. In 2020 International Conference on Cyber Situational Awareness, Data Analytics and Assessment (CyberSA). IEEE, 1–2.",
      "doi": ""
    },
    {
      "text": "Lucy Powley, Graham McIlroy, Gwenda Simons, and Karim Raza. 2016. Are online symptoms checkers useful for patients with inflammatory arthritis?BMC musculoskeletal disorders 17, 1 (2016), 362.",
      "doi": ""
    },
    {
      "text": "Pearl Pu and Li Chen. 2007. Trust-inspiring explanation interfaces for recommender systems. Knowledge-Based Systems 20, 6 (2007), 542–556.",
      "doi": "10.1016/j.knosys.2007.04.004"
    },
    {
      "text": "Pearl Pu, Li Chen, and Rong Hu. 2011. A user-centric evaluation framework for recommender systems. In Proceedings of the fifth ACM conference on Recommender systems. ACM, 157–164.",
      "doi": "10.1145/2043932.2043962"
    },
    {
      "text": "Emilee Rader, Kelley Cotter, and Janghee Cho. 2018. Explanations as mechanisms for supporting algorithmic transparency. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–13.",
      "doi": "10.1145/3173574.3173677"
    },
    {
      "text": "Mireia Ribera and Agata Lapedriza. 2019. Can we do better explanations? A proposal of user-centered explainable AI.. In IUI Workshops.",
      "doi": ""
    },
    {
      "text": "David-Hillel Ruben. 2015. Explaining explanation. Routledge.",
      "doi": ""
    },
    {
      "text": "Bahae Samhan. 2019. Self-Diagnosis Mobile Applications A Technology Trust Perspective. (2019).",
      "doi": ""
    },
    {
      "text": "Briane Paul V Samson and Yasuyuki Sumi. 2020. Are Two Heads Better than One? Exploring Two-Party Conversations for Car Navigation Voice Guidance. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": ""
    },
    {
      "text": "Jessica Schroeder, Chelsey Wilkes, Kael Rowan, Arturo Toledo, Ann Paradiso, Mary Czerwinski, Gloria Mark, and Marsha M Linehan. 2018. Pocket skills: A conversational mobile web app to support dialectical behavioral therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3173574.3173972"
    },
    {
      "text": "Hannah L Semigran, Jeffrey A Linder, Courtney Gidengil, and Ateev Mehrotra. 2015. Evaluation of symptom checkers for self diagnosis and triage: audit study. bmj 351(2015), h3480.",
      "doi": ""
    },
    {
      "text": "Ameneh Shamekhi, Q Vera Liao, Dakuo Wang, Rachel KE Bellamy, and Thomas Erickson. 2018. Face Value? Exploring the effects of embodiment for a group facilitation agent. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173965"
    },
    {
      "text": "Amit Sharma and Dan Cosley. 2013. Do social explanations work?: studying and modeling the effects of social explanations in recommender systems. In Proceedings of the 22nd international conference on World Wide Web. ACM, 1133–1144.",
      "doi": "10.1145/2488388.2488487"
    },
    {
      "text": "Carl Shen, Michael Nguyen, Alexander Gregor, Gloria Isaza, and Anne Beattie. 2019. Accuracy of a popular online symptom checker for ophthalmic diagnoses. JAMA ophthalmology 137, 6 (2019), 690–692.",
      "doi": ""
    },
    {
      "text": "Vilma Shu. 2020. Penn State Go: COVID-19 symptom checker part of new faculty/staff experience. https://news.psu.edu/story/627659/2020/08/05/administration/penn-state-go-covid-19-symptom-checker-part-new-facultystaff",
      "doi": ""
    },
    {
      "text": "Kacper Sokol and Peter A Flach. 2018. Glass-Box: Explaining AI Decisions With Counterfactual Statements Through Conversation With a Voice-enabled Virtual Assistant.. In IJCAI. 5868–5870.",
      "doi": ""
    },
    {
      "text": "Lee Sproull, Mani Subramani, Sara Kiesler, Janet H Walker, and Keith Waters. 1996. When the interface is a face. Human-computer interaction 11, 2 (1996), 97–124.",
      "doi": ""
    },
    {
      "text": "Nava Tintarev and Judith Masthoff. 2012. Evaluating the effectiveness of explanations for recommender systems. User Modeling and User-Adapted Interaction 22, 4-5 (1 Oct. 2012), 399–439.",
      "doi": "10.1007/s11257-011-9117-5"
    },
    {
      "text": "Nava Tintarev and Judith Masthoff. 2015. Explaining recommendations: Design and evaluation. In Recommender systems handbook. Springer, 353–382.",
      "doi": ""
    },
    {
      "text": "David Traum. 2017. Computational approaches to dialogue. The Routledge Handbook of Language and Dialogue. Taylor & Francis (2017), 143–161.",
      "doi": ""
    },
    {
      "text": "Chun-Hua Tsai. 2020. Controllability and explainability in a hybrid social recommender system. Ph.D. Dissertation. University of Pittsburgh.",
      "doi": ""
    },
    {
      "text": "Chun-Hua Tsai and Peter Brusilovsky. 2018. Beyond the Ranked List: User-Driven Exploration and Diversification of Social Recommendation. In 23rd International Conference on Intelligent User Interfaces. ACM, 239–250.",
      "doi": "10.1145/3172944.3172959"
    },
    {
      "text": "Chun-Hua Tsai and Peter Brusilovsky. 2019. Explaining recommendations in an interactive hybrid social recommender. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 391–396.",
      "doi": "10.1145/3301275.3302318"
    },
    {
      "text": "Chun-Hua Tsai and Peter Brusilovsky. 2020. The Effects of Controllability and Explainability in a Social Recommender System. User Modeling and User-Adapted Interaction(2020).",
      "doi": ""
    },
    {
      "text": "Florida State University. 2020. Stay Healthy Training & Daily Wellness Check Application. https://news.fsu.edu/news/2020/08/12/stay-healthy-training-daily-wellness-check-application/",
      "doi": ""
    },
    {
      "text": "Quinnipiac University. 2020. University introduces QU Symptom Checker app to keep campus community safe. https://www.qu.edu/today/qu-symptom-checker.html",
      "doi": ""
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, and Brian Y Lim. 2019. Designing theory-driven user-centric explainable AI. In Proceedings of the 2019 CHI conference on human factors in computing systems. 1–15.",
      "doi": "10.1145/3290605.3300831"
    },
    {
      "text": "David S Watson, Jenny Krutzinna, Ian N Bruce, Christopher EM Griffiths, Iain B McInnes, Michael R Barnes, and Luciano Floridi. 2019. Clinical applications of machine learning algorithms: beyond the black box. Bmj 364(2019).",
      "doi": ""
    },
    {
      "text": "Martin Wiesner and Daniel Pfeifer. 2014. Health recommender systems: concepts, requirements, technical basics and challenges. International journal of environmental research and public health 11, 3(2014), 2580–2607.",
      "doi": ""
    },
    {
      "text": "Aaron N Winn, Melek Somai, Nicole Fergestrom, and Bradley H Crotty. 2019. Association of Use of Online Symptom Checkers With Patients’ Plans for Seeking Care. JAMA Network Open 2, 12 (2019), e1918561–e1918561.",
      "doi": ""
    },
    {
      "text": "Jennifer Wisdom and John W Creswell. 2013. Mixed methods: integrating quantitative and qualitative data collection and analysis while studying patient-centered medical home models. Rockville: Agency for Healthcare Research and Quality (2013).",
      "doi": ""
    },
    {
      "text": "Ziang Xiao, Michelle X Zhou, and Wat-Tat Fu. 2019. Who should be my teammates: Using a conversational agent to understand individuals and help teaming. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 437–447.",
      "doi": "10.1145/3301275.3302264"
    },
    {
      "text": "Ziang Xiao, Michelle X Zhou, Q Vera Liao, Gloria Mark, Changyan Chi, Wenxi Chen, and Huahai Yang. 2020. Tell Me About Yourself: Using an AI-Powered Chatbot to Conduct Conversational Surveys with Open-ended Questions. ACM Transactions on Computer-Human Interaction (TOCHI) 27, 3(2020), 1–37.",
      "doi": "10.1145/3381804"
    },
    {
      "text": "Yue You and Xinning Gui. 2020. Self-Diagnosis through AI-enabled Chatbot-based Symptom Checkers: User Experiences and Design Considerations. In AMIA Annual Symposium Proceedings, Vol. 2020. American Medical Informatics Association.",
      "doi": ""
    }
  ]
}