{
  "doi": "10.1145/3411764.3445680",
  "title": "Older Adults’ Think-Aloud Verbalizations and Speech Features for Identifying User Experience Problems",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Subtle patterns in users’ think-aloud (TA) verbalizations and speech features are shown to be telltale signs of User Experience (UX) problems. However, such patterns were uncovered among young adults. Whether such patterns apply for older adults remains unknown. We conducted TA usability testing with older adults using physical and digital products. We analyzed their verbalizations, extracted speech features, identified UX problems, and uncovered the patterns that indicate UX problems. Our results show that when older adults encounter problems, their verbalizations tend to include observations (remarks), negations, question words and words with negative sentiments; and their voices tend to include high loudness, high pitch and high speech rate. We compare these subtle patterns with those of young adults uncovered in recent studies and discuss the implications of these patterns for the design of Human-AI collaborative UX analysis tools to better pinpoint UX problems.",
  "authors": [
    {
      "name": "Mingming Fan",
      "institution": "School of Information, Rochester Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81482645714/rel-imgonly/official-photo-rit-mingming-fan.jpg",
      "acmid": "81482645714",
      "orcid": "0000-0002-0356-4712"
    },
    {
      "name": "Qiwen Zhao",
      "institution": "School of Information, Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701741",
      "orcid": "missing"
    },
    {
      "name": "Vinita Tibdewal",
      "institution": "School of Information, Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659528190",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Obead Alhadreti and Pam Mayhew. 2017. To intervene or not to intervene: an investigation of three think-aloud protocols in usability testing. Journal of Usability Studies 12, 3 (2017), 111–132.",
      "doi": "10.5555/3190862.3190865"
    },
    {
      "text": "Obead Alhadreti and Pam Mayhew. 2018. Rethinking thinking aloud: A comparison of three think-aloud protocols. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173618"
    },
    {
      "text": "Morten Sieker Andreasen, Henrik Villemann Nielsen, Simon Ormholt Schrøder, and Jan Stage. 2007. What happened to remote usability testing? An empirical study of three methods. In Proceedings of the SIGCHI conference on Human factors in computing systems. 1405–1414.",
      "doi": "10.1145/1240624.1240838"
    },
    {
      "text": "Paul Boersma and David Weenink. [n.d.]. Praat: doing Phonetics by Computer. http://www.fon.hum.uva.nl/praat/.",
      "doi": ""
    },
    {
      "text": "Ted Boren and Judith Ramey. 2000. Thinking aloud: Reconciling theory and practice. IEEE transactions on professional communication 43, 3(2000), 261–278.",
      "doi": ""
    },
    {
      "text": "Robin Brewer, Meredith Ringel Morris, and Anne Marie Piper. 2016. ”Why Would Anybody Do This?”: Understanding Older Adults’ Motivations and Challenges in Crowd Work. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2246–2257. https://doi.org/10.1145/2858036.2858198",
      "doi": "10.1145/2858036.2858198"
    },
    {
      "text": "Anders Bruun, Peter Gull, Lene Hofmeister, and Jan Stage. 2009. Let your users do the testing: a comparison of three remote asynchronous usability testing methods. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1619–1628.",
      "doi": "10.1145/1518701.1518948"
    },
    {
      "text": "Kapil Chalil Madathil and Joel S Greenstein. 2011. Synchronous remote usability testing: a new approach facilitated by virtual worlds. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2225–2234.",
      "doi": "10.1145/1978942.1979267"
    },
    {
      "text": "Jane Chung, Shomir Chaudhuri, Thai Le, Nai-Ching Chi, Hilaire J Thompson, and George Demiris. 2015. The use of think-aloud to evaluate a navigation structure for a multimedia health and wellness application for older adults and their caregivers. Educational gerontology 41, 12 (2015), 916–929.",
      "doi": ""
    },
    {
      "text": "Lynne Cooke. 2010. Assessing concurrent think-aloud protocol as a usability test method: A technical communication approach. IEEE Transactions on Professional Communication 53, 3(2010), 202–215.",
      "doi": ""
    },
    {
      "text": "Fergus IM Craik and Timothy A Salthouse. 2011. The handbook of aging and cognition. Psychology press.",
      "doi": ""
    },
    {
      "text": "Joseph S Dumas, Joseph S Dumas, and Janice Redish. 1999. A practical guide to usability testing. Intellect books.",
      "doi": ""
    },
    {
      "text": "F Ci Eisler. 1986. Cycle linguistics: Experiments in spontaneous speech.",
      "doi": ""
    },
    {
      "text": "Sanne Elling, Leo Lentz, and Menno De Jong. 2012. Combining concurrent think-aloud protocols and eye-tracking observations: An analysis of verbalizations and silences. IEEE transactions on professional communication 55, 3(2012), 206–220.",
      "doi": ""
    },
    {
      "text": "K Anders Ericsson and Herbert A Simon. 1984. Protocol analysis: Verbal reports as data.the MIT Press.",
      "doi": ""
    },
    {
      "text": "Mingming Fan, Yue Li, and Khai N Truong. 2020. Automatic Detection of Usability Problem Encounters in Think-aloud Sessions. ACM Transactions on Interactive Intelligent Systems (TiiS) 10, 2(2020), 1–24. https://doi.org/10.1145/3385732",
      "doi": "10.1145/3385732"
    },
    {
      "text": "Mingming Fan, Jinglan Lin, Christina Chung, and Khai N. Truong. 2019. Concurrent think-aloud verbalizations and usability problems. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 5, Article 28 (2019), 35 pages. https://doi.org/10.1145/3325281",
      "doi": "10.1145/3325281"
    },
    {
      "text": "Mingming Fan, Serina Shi, and Khai N Truong. 2020. Practices and Challenges of Using Think-Aloud Protocols in Industry: An International Survey.Journal of Usability Studies 15, 2 (2020), 85–102.",
      "doi": "10.5555/3532708.3532711"
    },
    {
      "text": "Mingming Fan, Ke Wu, Jian Zhao, Yue Li, Winter Wei, and Khai N Truong. 2020. VisTA: Integrating Machine Intelligence with Visualization to Support the Investigation of Think-Aloud Sessions. IEEE Transactions on Visualization and Computer Graphics (TVCG) 26, 1(2020), 343–352. https://doi.org/10.1109/TVCG.2019.2934797",
      "doi": ""
    },
    {
      "text": "Asbjørn Følstad, Effie Law, and Kasper Hornbæk. 2012. Analysis in practical usability evaluation: a survey study. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2127–2136.",
      "doi": "10.1145/2207676.2208365"
    },
    {
      "text": "Julián Grigera, Alejandra Garrido, José Matías Rivero, and Gustavo Rossi. 2017. Automatic detection of usability smells in web applications. International Journal of Human-Computer Studies 97 (2017), 129–148.",
      "doi": ""
    },
    {
      "text": "Nielsen Norman Group. [n.d.]. Demonstrate Thinking Aloud by Showing Users a Video. https://www.nngroup.com/articles/thinking-aloud-demo-video/.",
      "doi": ""
    },
    {
      "text": "Christian Herbst. 2019. A Python library for voice analysis. https://homepage.univie.ac.at/christian.herbst/python/namespacepraat_util.html.",
      "doi": ""
    },
    {
      "text": "Morten Hertzum, Pia Borlund, and Kristina B Kristoffersen. 2015. What do thinking-aloud participants say? A comparison of moderated and unmoderated usability sessions. International Journal of Human-Computer Interaction 31, 9(2015), 557–570.",
      "doi": ""
    },
    {
      "text": "Morten Hertzum and Niels Ebbe Jacobsen. 2001. The evaluator effect: A chilling fact about usability evaluation methods. International Journal of Human-Computer Interaction 13, 4(2001), 421–443.",
      "doi": ""
    },
    {
      "text": "Masahiro Hori, Yasunori Kihara, and Takashi Kato. 2011. Investigation of indirect oral operation method for think aloud usability testing. In International Conference on Human Centered Design. Springer, 38–46.",
      "doi": ""
    },
    {
      "text": "Man Huang, Derek Hansen, and Bo Xie. 2012. Older adults’ online health information seeking behavior. In Proceedings of the 2012 iConference. 338–345.",
      "doi": "10.1145/2132176.2132220"
    },
    {
      "text": "Petri Laukka, Clas Linnman, Fredrik Åhs, Anna Pissiota, Örjan Frans, Vanda Faria, Åsa Michelgård, Lieuwe Appel, Mats Fredrikson, and Tomas Furmark. 2008. In a nervous voice: Acoustic analysis and perception of anxiety in social phobics’ speech. Journal of Nonverbal Behavior 32, 4 (2008), 195.",
      "doi": ""
    },
    {
      "text": "Clayton Lewis. 1982. Using the’thinking-aloud’method in cognitive interface design. Research Report RC9265, IBM TJ Watson Research Center (1982).",
      "doi": ""
    },
    {
      "text": "Carolyn A Lin, Patricia J Neafsey, and Zoe Strickler. 2009. Usability testing by older adults of a computer-mediated health communication program. Journal of Health Communication 14, 2 (2009), 102–118.",
      "doi": ""
    },
    {
      "text": "Edward Loper and Steven Bird. 2002. NLTK: the natural language toolkit. arXiv preprint cs/0205028(2002).",
      "doi": ""
    },
    {
      "text": "Tana M Luger, Thomas K Houston, and Jerry Suls. 2014. Older adult experience of online diagnosis: results from a scenario-based think-aloud protocol. Journal of medical Internet research 16, 1 (2014), e16.",
      "doi": ""
    },
    {
      "text": "Sharon McDonald, Helen M Edwards, and Tingting Zhao. 2012. Exploring think-alouds in usability testing: An international survey. IEEE Transactions on Professional Communication 55, 1(2012), 2–19.",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1994. Usability engineering. Elsevier.",
      "doi": "10.5555/529793"
    },
    {
      "text": "Erica Olmsted-Hawala and Jennifer Romano Bergstrom. 2012. Think-aloud protocols: Does age make a difference. Proceedings of Society for Technical Communication (STC) Summit, Chicago, IL (2012).",
      "doi": ""
    },
    {
      "text": "Erica Olmsted-Hawala and Temika Holland. 2015. Age-Related Differences in a Usability Study Measuring Accuracy, Efficiency, and User Satisfaction in Using Smartphones for Census Enumeration: Fiction or Reality?. In International Conference on Human Aspects of IT for the Aged Population. Springer, 475–483.",
      "doi": "10.1007/978-3-319-20892-3_46"
    },
    {
      "text": "Alex Pentland. 2010. Honest signals: how they shape our world. MIT press.",
      "doi": "10.5555/1450928"
    },
    {
      "text": "Jeffrey Rubin and Dana Chisnell. 2008. Handbook of usability testing: how to plan, design and conduct effective tests. John Wiley & Sons.",
      "doi": "10.5555/1386686"
    },
    {
      "text": "Timothy Salthouse. 2000. A theory of cognitive aging. Elsevier.",
      "doi": ""
    },
    {
      "text": "Siegfried Ludwig Sporer and Barbara Schwandt. 2006. Paraverbal indicators of deception: A meta-analytic synthesis. Applied Cognitive Psychology: The Official Journal of the Society for Applied Research in Memory and Cognition 20, 4 (2006), 421–446.",
      "doi": ""
    },
    {
      "text": "Mr. Tappy. [n.d.]. Mr. Tappy - Mobile UX research made easy.https://www.mrtappy.com/.",
      "doi": ""
    },
    {
      "text": "Tom Tullis, Stan Fleischman, Michelle McNulty, Carrie Cianchette, and Margaret Bergel. 2002. An empirical comparison of lab and remote usability testing of web sites. In Usability Professionals Association Conference.",
      "doi": ""
    },
    {
      "text": "Tingting Zhao and Sharon McDonald. 2010. Keep talking: an analysis of participant utterances gathered using two concurrent think-aloud methods. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries. 581–590.",
      "doi": "10.1145/1868914.1868979"
    },
    {
      "text": "Tingting Zhao, Sharon McDonald, and Helen M Edwards. 2014. The impact of two different think-aloud instructions in a usability test: a case of just following orders?Behaviour & Information Technology 33, 2 (2014), 163–183.",
      "doi": ""
    }
  ]
}