{
  "doi": "10.1145/3411764.3445208",
  "title": "Available Anytime Anywhere: Investigating Mobile Volunteer Responders for Out of Hospital Cardiac Arrest",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Out of hospital cardiac arrest is a life-threatening event that requires immediate resuscitation actions. Therefore, digital volunteer responder initiatives integrate nearby users who can be activated anytime, anywhere through mobile technologies to assist in administering first aid. While research has found that such initiatives increases the chances of surviving, we know little about how responders use the digital services, and how they organize themselves before, during, and after responding. We conducted interviews with volunteer responders (N=16) to address how they perceive these initiatives and in particular how they negotiate availability temporally (anytime) and spatially (anywhere) for such life-threatening events. Our findings show that our responders exhibited strong perceptions of how and why one should volunteer. Also, the temporal aspect of being available anytime integrates several dimensions, while being available anywhere is highly related to safety, community and group roles. Finally, we discuss implications for design of volunteer responder initiatives.",
  "tags": [
    "mobile",
    "availability",
    "volunteer",
    "health",
    "cardiac"
  ],
  "authors": [
    {
      "name": "Maria Kjærup",
      "institution": "Human-Centred Computing Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260330",
      "orcid": "missing"
    },
    {
      "name": "Mette Elsborg",
      "institution": "Computer Science Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659676622",
      "orcid": "missing"
    },
    {
      "name": "Mikael B. Skov",
      "institution": "Department of Computer Science Aalborg University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502723616",
      "orcid": "0000-0003-4488-5683"
    },
    {
      "name": "Anders Bruun",
      "institution": "Computer Science, Aalborg University, Denmark",
      "img": "/do/10.1145/contrib-81416608058/rel-imgonly/anders.jpg",
      "acmid": "81416608058",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "American Heart Association. 2019. American Heart Association Annual Report: 2018-2019. Technical Report. http://www.heart.org/idc/groups/heart-public/@wcm/@cmc/documents/downloadable/ucm_490853.pdf",
      "doi": ""
    },
    {
      "text": "Linn Andelius, Carolina Malta Hansen, Freddy K. Lippert, Lena Karlsson, Christian Torp-Pedersen, Annette Kjær Ersbøll, Lars Køber, Helle Collatz Christensen, Stig Nikolaj Blomberg, Gunnar H. Gislason, and Fredrik Folke. 2020. Smartphone Activation of Citizen Responders to Facilitate Defibrillation in Out-of-Hospital Cardiac Arrest. Journal of the American College of Cardiology 76, 1 (jul 2020), 43–53. https://doi.org/10.1016/j.jacc.2020.04.073",
      "doi": ""
    },
    {
      "text": "Jakob E. Bardram, Mads Frost, Károly Szántó, Maria Faurholt-Jepsen, Maj Vinberg, and Lars Vedel Kessing. 2013. Designing Mobile Health Technology for Bipolar Disorder: A Field Trial of the MONARCA System. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13. ACM Press, New York, New York, USA, 2627. https://doi.org/10.1145/2470654.2481364",
      "doi": "10.1145/2470654.2481364"
    },
    {
      "text": "Steven C. Brooks, Graydon Simmons, Heather Worthington, Bentley J. Bobrow, and Laurie J. Morrison. 2016. The PulsePoint Respond mobile device application to crowdsource basic life support for patients with out-of-hospital cardiac arrest: Challenges for optimal implementation. Resuscitation 98 (jan 2016), 20–26. https://doi.org/10.1016/j.resuscitation.2015.09.392",
      "doi": ""
    },
    {
      "text": "Maria Luce Caputo, Sandro Muschietti, Roman Burkart, Claudio Benvenuti, Giulio Conte, François Regoli, Romano Mauri, Catherine Klersy, Tiziano Moccetti, and Angelo Auricchio. 2017. Lay Persons Alerted by Mobile Application System Initiate Earlier Cardio-Pulmonary Resuscitation: A Comparison with SMS-based System Notification. Resuscitation 114 (may 2017), 73–78. https://doi.org/10.1016/j.resuscitation.2017.03.003",
      "doi": ""
    },
    {
      "text": "Marta E. Cecchinato, Anna L. Cox, and Jon Bird. 2017. Always On(line)? User Experience of Smartwatches and their Role within Multi-Device Ecologies. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, Vol. 2017-May. ACM, New York, NY, USA, 3557–3568. https://doi.org/10.1145/3025453.3025538",
      "doi": "10.1145/3025453.3025538"
    },
    {
      "text": "Victoria Clarke, Virginia Braun, and Nikki Hayfield. 2015. Thematic analysis. Qualitative psychology: A practical guide to research methods (2015), 222–248.",
      "doi": ""
    },
    {
      "text": "Pooja M. Desai, Elliot G. Mitchell, Maria L. Hwang, Matthew E. Levine, David J. Albers, and Lena Mamykina. 2019. Personal Health Oracle: Explorations of Personalized Predictions in Diabetes Self-Management. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–13. https://doi.org/10.1145/3290605.3300600",
      "doi": "10.1145/3290605.3300600"
    },
    {
      "text": "Virginia Dickson-Swift, Erica L James, Sandra Kippen, and Pranee Liamputtong. 2009. Researching sensitive topics: Qualitative research as emotion work. Qualitative research 9, 1 (2009), 61–79.",
      "doi": ""
    },
    {
      "text": "Xianghua Ding, Yunan Chen, Zhaofei Ding, and Yiwen Xu. 2019. Boundary Negotiation for Patient-Provider Communication via WeChat in China. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (nov 2019), 1–24. https://doi.org/10.1145/3359259",
      "doi": "10.1145/3359259"
    },
    {
      "text": "Pin Sym Foong, Shengdong Zhao, Felicia Tan, and Joseph Jay Williams. 2018. Harvesting Caregiving Knowledge: Design Considerations for Integrating Volunteer Input in Dementia Care. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18, Vol. 2018-April. ACM Press, New York, New York, USA, 1–12. https://doi.org/10.1145/3173574.3173653",
      "doi": "10.1145/3173574.3173653"
    },
    {
      "text": "Andrés Lucero. 2018. Living Without a Mobile Phone: An Autoethnography. In Proceedings of the Designing Interactive Systems Conference 2018 - DIS ’18. ACM Press, New York, New York, USA, 765–776. https://doi.org/10.1145/3196709.3196731",
      "doi": "10.1145/3196709.3196731"
    },
    {
      "text": "Gloria Mark, Stephen Voida, and Armand Cardello. 2012. ”A pace not Dictated by Electrons”: An Empirical Study of Work Without Email. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, New York, New York, USA, 555. https://doi.org/10.1145/2207676.2207754",
      "doi": "10.1145/2207676.2207754"
    },
    {
      "text": "Melissa Mazmanian and Ingrid Erickson. 2014. The Product of Availability: Understanding the Economic Underpinnings of Constant Connectivity. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI ’14. ACM Press, New York, New York, USA, 763–772. https://doi.org/10.1145/2556288.2557381",
      "doi": "10.1145/2556288.2557381"
    },
    {
      "text": "Andrew D. Miller, Sonali R. Mishra, Logan Kendall, Shefali Haldar, Ari H. Pollack, and Wanda Pratt. 2016. Partners in Care: Design Considerations for Caregivers and Patients During a Hospital Stay. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work and Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 756–769. https://doi.org/10.1145/2818048.2819983",
      "doi": "10.1145/2818048.2819983"
    },
    {
      "text": "Sonali R. Mishra, Predrag Klasnja, John MacDuffie Woodburn, Eric B. Hekler, Larsson Omberg, Michael Kellen, and Lara Mangravite. 2019. Supporting Coping with Parkinson’s Disease Through Self Tracking. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–16. https://doi.org/10.1145/3290605.3300337",
      "doi": "10.1145/3290605.3300337"
    },
    {
      "text": "Thea Palsgaard Møller, Carolina Malta Hansen, Martin Fjordholt, Birgitte Dahl Pedersen, Doris Østergaard, and Freddy K. Lippert. 2014. Debriefing Bystanders of Out-of-Hospital Cardiac Arrest is Valuable. Resuscitation 85, 11 (nov 2014), 1504–1511. https://doi.org/10.1016/j.resuscitation.2014.08.006",
      "doi": ""
    },
    {
      "text": "Occupational Safety and Health Administration U.S. Department of Labor. 2017. Cardiac Arrest and Automated External Defibrillators (AEDs). https://www.osha.gov/dts/tib/tib_data/tib20011217.html",
      "doi": ""
    },
    {
      "text": "Erick Oduor, Carolyn Pang, Charles Wachira, Rachel K.E. Bellamy, Timothy Nyota, Sekou L. Remy, Aisha Walcott-Bryant, Wycliffe Omwanda, and Julius Mbeya. 2019. Exploring Rural Community Practices in HIV Management for the Design of Technology for Hypertensive Patients Living with HIV. DIS 2019 - Proceedings of the 2019 ACM Designing Interactive Systems Conference (2019), 1595–1606. https://doi.org/10.1145/3322276.3322348",
      "doi": ""
    },
    {
      "text": "Erick Oduor, Carolyn Pang, Charles Wachira, Rachel K. E. Bellamy, Timothy Nyota, Sekou L. Remy, Aisha Walcott-Bryant, Wycliffe Omwanda, and Julius Mbeya. 2019. Exploring Rural Community Practices in HIV Management for the Design of Technology for Hypertensive Patients Living with HIV. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, New York, NY, USA, 1595–1606. https://doi.org/10.1145/3322276.3322348",
      "doi": "10.1145/3322276.3322348"
    },
    {
      "text": "Kerem Ozcan, Dawn Jorgenson, Christian Richard, and Gary Hsieh. 2017. Designing for Targeted Responder Models: Exploring Barriers to Respond. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, New York, NY, USA, 916–924. https://doi.org/10.1145/2998181.2998334",
      "doi": "10.1145/2998181.2998334"
    },
    {
      "text": "Martin Pielot and Luz Rello. 2017. Productive, Anxious, Lonely - 24 Hours Without Push Notifications. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services. ACM, New York, NY, USA, 1–11. https://doi.org/10.1145/3098279.3098526",
      "doi": "10.1145/3098279.3098526"
    },
    {
      "text": "Rebecca A. Kuehl;Jenn Anderson. 2015. Designing Public Communication about Doulas: Analyzing Presence and Absence in Promoting a Volunteer Doula Program. Communication Design Quarterly(2015). http://delivery-acm-org.ez54.periodicos.capes.gov.br/10.1145/2830000/2826979/p75-kuehl.pdf?ip=200.130.19.182&id=2826979&acc=ACTIVE SERVICE&key=344E943C9DC262BB.0F5B8E3859CA5567.4D4702B0C3E38B35.4D4702B0C3E38B35&__acm__=1537233884_04e53bab82a3fe35b",
      "doi": ""
    },
    {
      "text": "Mattias Ringh, Mårten Rosenqvist, Jacob Hollenberg, Martin Jonsson, David Fredman, Per Nordberg, Hans Järnbert-Pettersson, Ingela Hasselqvist-Ax, Gabriel Riva, and Leif Svensson. 2015. Mobile-phone dispatch of laypersons for CPR in out-of-hospital cardiac arrest. New England Journal of Medicine 372, 24 (2015), 2316–2325.",
      "doi": ""
    },
    {
      "text": "Ana-Maria Salai and Lynne Baillie. 2019. A Wee Bit More Interaction: Designing and Evaluating an Overactive Bladder App. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–14. https://doi.org/10.1145/3290605.3300933",
      "doi": "10.1145/3290605.3300933"
    },
    {
      "text": "Laura Sarkisian, Hans Mickley, Henrik Schakow, Oke Gerke, Gitte Jørgensen, Mogens Lytken Larsen, and Finn Lund Henriksen. 2020. Global Positioning System Alerted Volunteer First Responders Arrive Before Emergency Medical Services in More than Four out of Five Emergency Calls. Resuscitation 152 (jul 2020), 170–176. https://doi.org/10.1016/j.resuscitation.2019.12.010",
      "doi": ""
    },
    {
      "text": "Jessica Schroeder, Chelsey Wilkes, Kael Rowan, Arturo Toledo, Ann Paradiso, Mary Czerwinski, Gloria Mark, and Marsha M. Linehan. 2018. Pocket Skills: A Conversational Mobile Web App to Support Dialectial Behavioral Therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, New York, New York, USA, 1–15. https://doi.org/10.1145/3173574.3173972",
      "doi": "10.1145/3173574.3173972"
    },
    {
      "text": "Mikael B. Skov, Pauline G Johansen, Charlotte S Skov, and Astrid Lauberg. 2015. No News is Good News: Remote Monitoring of Implantable Cardioverter-Defibrillator Patients. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15, Vol. 1. ACM Press, New York, New York, USA, 827–836. https://doi.org/10.1145/2702123.2702192",
      "doi": "10.1145/2702123.2702192"
    },
    {
      "text": "Charlotte Tang, Yunan Chen, Bryan C. Semaan, and Jahmeilah A. Roberson. 2015. Restructuring Human Infrastructure: The Impact of EHR Deployment in a Volunteer-Dependent Clinic. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing - CSCW ’15. ACM Press, New York, New York, USA, 649–661. https://doi.org/10.1145/2675133.2675277",
      "doi": "10.1145/2675133.2675277"
    },
    {
      "text": "Jenny Waycott, Greg Wadley, Stefan Schutt, Arthur Stabolidis, and Reeva Lederman. 2015. The Challenge of Technology Research in Sensitive Settings: Case Studies in ’Sensitive HCI’. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction on - OzCHI ’15. ACM Press, New York, New York, USA, 240–249. https://doi.org/10.1145/2838739.2838773",
      "doi": "10.1145/2838739.2838773"
    },
    {
      "text": "Mads Wissenberg, Freddy K. Lippert, Fredrik Folke, Peter Weeke, Carolina Malta Hansen, Erika Frischknecht Christensen, Henning Jans, Poul Anders Hansen, Torsten Lang-Jensen, Jonas Bjerring Olesen, Jesper Lindhardsen, Emil L. Fosbol, Søren L. Nielsen, Gunnar H. Gislason, Lars Kober, and Christian Torp-Pedersen. 2013. Association of National Initiatives to Improve Cardiac Arrest Management With Rates of Bystander Intervention and Patient Survival After Out-of-Hospital Cardiac Arrest. JAMA 310, 13 (oct 2013), 1377. https://doi.org/10.1001/jama.2013.278483",
      "doi": ""
    },
    {
      "text": "Jolande A. Zijlstra, Stefanie G. Beesems, Rob J. De Haan, and Rudolph W. Koster. 2015. Psychological Impact on Dispatched Local Lay Rescuers Performing Bystander Cardiopulmonary Resuscitation. Resuscitation 92 (jul 2015), 115–121. https://doi.org/10.1016/j.resuscitation.2015.04.028",
      "doi": ""
    },
    {
      "text": "Jolande A. Zijlstra, Remy Stieglis, Frank Riedijk, Martin Smeekes, Wim E. van der Worp, and Rudolph W. Koster. 2014. Local Lay Rescuers with AEDs, Alerted by Text Messages, Contribute to Early Defibrillation in a Dutch Out-of-Hospital Cardiac Arrest Dispatch System. Resuscitation 85, 11 (nov 2014), 1444–1449. https://doi.org/10.1016/j.resuscitation.2014.07.020",
      "doi": ""
    }
  ]
}