{
  "doi": "10.1145/3411764.3445749",
  "title": "EvalMe: Exploring the Value of New Technologies for In Situ Evaluation of Learning Experiences",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Tangible interfaces have much potential for engendering shared interaction and reflection, as well as for promoting playful experiences. How can their properties be capitalised on to enable students to reflect on their learning, both individually and together, throughout learning sessions? This Research through Design paper describes our development of EvalMe, a flexible, tangible tool aimed at being playful, enjoyable to use and enabling children to reflect on their learning, both in the moment and after a learning session has ended. We discuss the insights gained through the process of designing EvalMe, co-defining its functionality with two groups of collaborators and deploying it in two workshop settings. Through this process, we map key contextual considerations for the design of technologies for in situ evaluation of learning experiences. Finally, we discuss how tangible evaluation technologies deployed throughout a learning session, can positively contribute to students’ reflection about their learning.",
  "authors": [
    {
      "name": "Susan Lechelt",
      "institution": "Design Informatics University of Edinburgh, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659481006",
      "orcid": "missing"
    },
    {
      "name": "Frederik Brudy",
      "institution": "Autodesk Research, Canada",
      "img": "/do/10.1145/contrib-81502796016/rel-imgonly/photo-square-medium.jpg",
      "acmid": "81502796016",
      "orcid": "missing"
    },
    {
      "name": "Nicolai Marquardt",
      "institution": "UCL Interaction Centre University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81324491951/rel-imgonly/portraitnic3.jpg",
      "acmid": "81324491951",
      "orcid": "0000-0002-5473-2448"
    },
    {
      "name": "Yvonne Rogers",
      "institution": "UCL Interaction Centre University College London, United Kingdom",
      "img": "/do/10.1145/contrib-81100173923/rel-imgonly/yvonne.jpg",
      "acmid": "81100173923",
      "orcid": "0000-0001-7612-0234"
    }
  ],
  "references": [
    {
      "text": "Alissa N. Antle and Alyssa F. Wise. 2013. Getting down to details: Using theories of cognition and learning to inform tangible user interface design. Interact. Comput. 25, 1 (2013), 1–20.",
      "doi": ""
    },
    {
      "text": "Ester Baauw and Panos Markopoulous. 2004. A comparison of think-aloud and post-task interview for usability testing with children. In Proceedings of the 2004 conference on Interaction design and children: building a community (IDC ’04), Association for Computing Machinery, New York, NY, USA, 115–116. DOI: https://doi.org/10.1145/1017833.1017848",
      "doi": "10.1145/1017833.1017848"
    },
    {
      "text": "Gerald Bergtrom. 2006. Clicker Sets as Learning Objects. Interdiscip. J. E-Learn. Learn. Objects 2, 1 (January 2006), 105–110.",
      "doi": ""
    },
    {
      "text": "David Boud, Rosemary Keogh, and David Walker. 2013. Reflection: Turning experience into learning. Routledge.",
      "doi": ""
    },
    {
      "text": "Karen Brennan and Mitchel Resnick. 2012. New frameworks for studying and assessing the development of computational thinking. In Proceedings of the 2012 annual meeting of the American educational research association, Vancouver, Canada, 25.",
      "doi": ""
    },
    {
      "text": "Harry Brignull and Yvonne Rogers. 2003. Enticing people to interact with large public displays in public spaces. In Proceedings of INTERACT, Brighton, UK, 17–24.",
      "doi": ""
    },
    {
      "text": "Jane E. Caldwell. 2007. Clickers in the large classroom: Current research and best-practice tips. CBE—Life Sci. Educ. 6, 1 (2007), 9–20.",
      "doi": ""
    },
    {
      "text": "M. Chi. 1997. Why is self explaining an effective domain general learning activity. Adv. Instr. Psychol. Lawrence Erlbaum Assoc. (1997).",
      "doi": ""
    },
    {
      "text": "Abigail C. Durrant, John Vines, Jayne Wallace, and Joyce S. R. Yee. 2017. Research Through Design: Twenty-First Century Makers and Materialities. Des. Issues 33, 3 (July 2017), 3–10. DOI: https://doi.org/10.1162/DESI_a_00447",
      "doi": ""
    },
    {
      "text": "Rowanne Fleck and Geraldine Fitzpatrick. 2010. Reflecting on reflection: framing a design landscape. In Proceedings of the 22nd Conference of the Computer-Human Interaction Special Interest Group of Australia on Computer-Human Interaction, 216–223.",
      "doi": "10.1145/1952222.1952269"
    },
    {
      "text": "Sarah Gallacher, Connie Golsteijn, Yvonne Rogers, Licia Capra, and Sophie Eustace. 2016. SmallTalk: Using Tangible Interactions to Gather Feedback from Children. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’16), Association for Computing Machinery, New York, NY, USA, 253–261. DOI: https://doi.org/10.1145/2839462.2839481",
      "doi": "10.1145/2839462.2839481"
    },
    {
      "text": "Andrew Garbett, David Chatting, Gerard Wilkinson, Clement Lee, and Ahmed Kharrufa. 2018. ThinkActive: Designing for Pseudonymous Activity Tracking in the Classroom. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–13. DOI: https://doi.org/10.1145/3173574.3173581",
      "doi": "10.1145/3173574.3173581"
    },
    {
      "text": "William Gaver. 2002. Designing for homo ludens. I3 Mag. 12, June (2002), 2–6.",
      "doi": ""
    },
    {
      "text": "Connie Golsteijn, Sarah Gallacher, Lisa Koeman, Lorna Wall, Sami Andberg, Yvonne Rogers, and Licia Capra. 2015. VoxBox: A Tangible Machine that Gathers Opinions from the Public at Events. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI ’15), Association for Computing Machinery, New York, NY, USA, 201–208. DOI: https://doi.org/10.1145/2677199.2680588",
      "doi": "10.1145/2677199.2680588"
    },
    {
      "text": "Charlene Jennett, Ioanna Iacovides, Anna L. Cox, Anastasia Vikhanova, Emily Weigold, Layla Mostaghimi, Geraint Jones, James Jenkins, Sarah Gallacher, and Yvonne Rogers. 2016. Squeezy Green Balls: Promoting Environmental Awareness through Playful Interactions. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (CHI PLAY ’16), Association for Computing Machinery, New York, NY, USA, 389–400. DOI: https://doi.org/10.1145/2967934.2968102",
      "doi": "10.1145/2967934.2968102"
    },
    {
      "text": "Robin H. Kay and Ann LeSage. 2009. Examining the benefits and challenges of using audience response systems: A review of the literature. Comput. Educ. 53, 3 (November 2009), 819–827. DOI: https://doi.org/10.1016/j.compedu.2009.05.001",
      "doi": "10.1016/j.compedu.2009.05.001"
    },
    {
      "text": "Hyeonjin Kim and Michael J. Hannafin. 2008. Grounded design of web-enhanced case-based activity. Educ. Technol. Res. Dev. 56, 2 (2008), 161.",
      "doi": ""
    },
    {
      "text": "Külli Kori, Margus Pedaste, Äli Leijen, and Mario Mäeots. 2014. Supporting reflection in technology-enhanced learning. Educ. Res. Rev. 11, (2014), 45–55.",
      "doi": ""
    },
    {
      "text": "Victor R. Lee and Joel Drake. 2013. Quantified recess: design of an activity for elementary students involving analyses of their own movement data. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC ’13), Association for Computing Machinery, New York, NY, USA, 273–276. DOI: https://doi.org/10.1145/2485760.2485822",
      "doi": ""
    },
    {
      "text": "Äli Leijen, Ineke Lam, Liesbeth Wildschut, P. Robert-Jan Simons, and Wilfried Admiraal. 2009. Streaming video to enhance students’ reflection in dance education. Comput. Educ. 52, 1 (2009), 169–176.",
      "doi": "10.1016/j.compedu.2008.07.010"
    },
    {
      "text": "Linda J. Collins. 2007. Livening up the classroom: Using audience response systems to promote active learning. Med. Ref. Serv. Q. 26, 1 (January 2007), 81–88. DOI: https://doi.org/10.1300/J115v26n01_08",
      "doi": ""
    },
    {
      "text": "Panos Markopoulos, Janet C. Read, Stuart MacFarlane, and Johanna Hoysniemi. 2008. Evaluating children's interactive products: principles and practices for interaction designers. Elsevier.",
      "doi": ""
    },
    {
      "text": "Paul Marshall. 2007. Do tangible interfaces enhance learning? In Proceedings of the 1st international conference on Tangible and embedded interaction, 163–170.",
      "doi": "10.1145/1226969.1227004"
    },
    {
      "text": "S. McLoone, S. O'Keeffe, R. Villing, and C. Brennan. 2014. Evaluation of a Smartphone-based Student Response System for Providing High Quality Real-time Responses in a Distributed Classroom. (January 2014), 210–215. DOI: https://doi.org/10.1049/cp.2014.0687",
      "doi": ""
    },
    {
      "text": "D. Metcalf, M. Milrad, D. Cheek, S. Raasch, and A. Hamilton. 2008. My Sports Pulse: Increasing Student Interest in STEM Disciplines through Sports Themes, Games and Mobile Technologies. In Fifth IEEE International Conference on Wireless, Mobile, and Ubiquitous Technology in Education (wmute 2008), 23–30. DOI: https://doi.org/10.1109/WMUTE.2008.38",
      "doi": ""
    },
    {
      "text": "Pantelis M. Papadopoulos, Stavros N. Demetriadis, Ioannis G. Stamelos, and Ioannis A. Tsoukalas. 2011. The value of writing-to-learn when using question prompts to support web-based learning in ill-structured domains. Educ. Technol. Res. Dev. 59, 1 (2011), 71–90.",
      "doi": ""
    },
    {
      "text": "Sara Price, Taciana Pontual Falcão, Jennifer G. Sheridan, and George Roussos. 2009. The effect of representation location on interaction in a tangible learning environment. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction, 85–92.",
      "doi": "10.1145/1517664.1517689"
    },
    {
      "text": "Yvonne Rogers and Henk Muller. 2006. A framework for designing sensor-based interactions to promote exploration and reflection in play. Int. J. Hum.-Comput. Stud. 64, 1 (2006), 1–14.",
      "doi": "10.1016/j.ijhcs.2005.05.004"
    },
    {
      "text": "Yvonne Rogers and Sara Price. 2006. Using ubiquitous computing to extend and enhance learning experiences. (2006).",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers, Sara Price, Cliff Randell, Danae Stanton Fraser, Mark Weal, and Geraldine Fitzpatrick. 2005. Ubi-learning integrates indoor and outdoor experiences. Commun. ACM 48, 1 (January 2005), 55–59. DOI: https://doi.org/10.1145/1039539.1039570",
      "doi": "10.1145/1039539.1039570"
    },
    {
      "text": "Lev Vygotsky. 1978. Interaction Between Learning and Development. Read. Dev. Child. (1978), 34–40.",
      "doi": ""
    },
    {
      "text": "T. Wu, T. Yang, G. Hwang, and H. Chu. 2008. Conducting Situated Learning in a Context-Aware Ubiquitous Learning Environment. In Fifth IEEE International Conference on Wireless, Mobile, and Ubiquitous Technology in Education (wmute 2008), 82–86. DOI: https://doi.org/10.1109/WMUTE.2008.9",
      "doi": "10.1109/WMUTE.2008.9"
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2014. Research Through Design in HCI. In Ways of Knowing in HCI, Judith S. Olson and Wendy A. Kellogg (eds.). Springer, New York, NY, 167–189. DOI: https://doi.org/10.1007/978-1-4939-0378-8_8",
      "doi": ""
    }
  ]
}