{
  "doi": "10.1145/3411764.3445107",
  "title": "What Can HCI Learn from Sexual Consent?: A Feminist Process of Embodied Consent for Interactions with Emerging Technologies",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Sexual consent has undergone a transformation toward an “enthusiastic” feminist model that emphasizes consent as an ongoing and voluntary process of negotiation and affirmation. This paper considers how such a model can advance understandings of consent in HCI research and design in relation to embodied interactions with emerging technologies that also occur outside of sexual interactions. We apply the popular “FRIES” model of sexual consent (Freely given, Reversible, Informed, Enthusiastic and Specific) to three areas of embodied interaction: 1) bodily-play interactions, 2) persuasive interactions with smart technologies, and 3) intimate interactions with anthropomorphized devices. Based on erotic play practices, we contribute a “TEASE” process guideline (Traffic lights, Establish ongoing dialogue, Aftercare, Safewords, and Explicate soft/hard limits) to advance consensual practice in HCI and develop implementation scenarios.",
  "tags": [
    "Embodied interactions",
    "Feminist HCI",
    "Consent"
  ],
  "authors": [
    {
      "name": "Yolande Strengers",
      "institution": "Emerging Technologies Research Lab, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414621385",
      "orcid": "missing"
    },
    {
      "name": "Jathan Sadowski",
      "institution": "Emerging Technologies Research Lab, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701906",
      "orcid": "missing"
    },
    {
      "name": "Zhuying Li",
      "institution": "Exertion Games Lab, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659209998",
      "orcid": "missing"
    },
    {
      "name": "Anna Shimshak",
      "institution": "XYX Lab, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701517",
      "orcid": "missing"
    },
    {
      "name": "Florian 'Floyd' Mueller",
      "institution": "Exertion Games Lab, Monash University, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100260236",
      "orcid": "0000-0001-6472-3476"
    }
  ],
  "references": [
    {
      "text": "Julio Abascal and Luis Azevedo. 2007. Fundamentals of Inclusive Hci Design. In Proceedings of Universal Access in Human-Computer Interaction. Springer, Berlin, Heidelberg. http://dx.doi.org/10.1007/978-3-540-73279-2_1",
      "doi": ""
    },
    {
      "text": "Michelle J Anderson. 2005. Negotiating Sex. Southern California Law Review 78, 6, 1401-1438.",
      "doi": ""
    },
    {
      "text": "Edward Anstead, Martin Flintham and Steve Benford. 2014. Studying Marathonlive: Consent for in-the-Wild Research. In Proceedings of 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication. Association for Computing Machinery, Seattle, Washington, USA, 665–670. http://dx.doi.org/10.1145/2638728.2641678",
      "doi": "10.1145/2638728.2641678"
    },
    {
      "text": "Shaowen Bardzell. Year. Feminist Hci: Taking Stock and Outlining an Agenda for Design. In Proceedings of 28th ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, 1301-1310.",
      "doi": ""
    },
    {
      "text": "Laura Bates. 2016. Everyday Sexism: The Project That Inspired a Worldwide Movement. Simon & Schuster, UK.",
      "doi": ""
    },
    {
      "text": "Jr Batya Friedman; Peter H. Kahn. 2003. Human Values, Ethics, and Design. In The Human-Computer Interaction Handbook: Fundamentals, Evolving Technologies and Emerging Applications, Andrew Sears; Julie A. Jacko Ed. Lawrence Erlbaum 1177-1201.",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Bob Anderson, Rachel Jacobs, Mike Golembewski, Marina Jirotka, Bernd Carsten Stahl, Job Timmermans, Gabriella Giannachi, Matt Adams, Ju Row Farr, Nick Tandavanitj and Kirsty Jennings. 2015. The Ethical Implications of Hci's Turn to the Cultural. ACM Transactions on Computer-Human Interaction 22. http://dx.doi.org/10.1145/2775107",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall and Tom Rodden. 2012. Uncomfortable Interactions. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems. ACM, Austin, Texas, USA, 2005–2014. http://dx.doi.org/10.1145/2207676.2208347",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall and Tom Rodden. 2013. Uncomfortable User Experience. Communications of the ACM 56, 66-73. http://dx.doi.org/10.1145/2500889",
      "doi": "10.1145/2500468.2500889"
    },
    {
      "text": "Steve Benford, Kristina Höök, Joseph Marshall, Florian Mueller and Dag Svanes. 2018. Body-Centric Computing (Dagstuhl Reports 17392). In Dagstuhl Reports, Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik, 7, 9.",
      "doi": ""
    },
    {
      "text": "Daniel Berdichevsky and Erik Neuenschwander. 1999. Toward an Ethics of Persuasive Technology. Communications of the ACM 42. http://dx.doi.org/10.1145/301353.301410",
      "doi": ""
    },
    {
      "text": "Hilary Bergen. 2016. ‘I'd Blush If I Could’: Digital Assistants, Disembodied Cyborgs and the Problem of Gender. Word and Text, A Journal of Literary Studies and Linguistics, 1, 95-113.",
      "doi": ""
    },
    {
      "text": "Kean Birch. 2016. Market Vs. Contract? The Implications of Con- Tractual Theories of Corporate Governance to the Analysis of Neoliberalism. Ephemera: Theory & Politics in Organizations 16, 107–133.",
      "doi": ""
    },
    {
      "text": "Jenny M Bivona, Joseph W Critelli and Michael J Clark. 2012. Women's Rape Fantasies: An Empirical Evaluation of the Major Explanations. Archives of sexual behavior 41, 5, 1107-1119.",
      "doi": ""
    },
    {
      "text": "Rainer Böhme and Stefan Köpsell. 2010. Trained to Accept? A Field Experiment on Consent Dialogs. In Proceedings of CHI '10. ACM. http://dx.doi.org/10.1145/1753326.1753689",
      "doi": ""
    },
    {
      "text": "James Brown, Kathrin Gerling, Patrick Dickinson and Ben Kirman. 2015. Dead Fun: Uncomfortable Interactions in a Virtual Reality Game for Coffins. In Proceedings of 2015 Annual Symposium on Computer-Human Interaction in Play http://dx.doi.org/10.1145/2793107.2810307",
      "doi": "10.1145/2793107.2810307"
    },
    {
      "text": "Judith Butler. 1990. Gender Trouble: Feminism and Its Subervsion of Identify. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Richard Byrne, Joe Marshall and Florian Mueller. 2016. Balance Ninja: Towards the Design of Digital Vertigo Games Via Galvanic Vestibular Stimulation. In Proceedings of 2016 Annual Symposium on Computer-Human Interaction in Play Association for Computing Machinery, Austin, Texas, USA. http://dx.doi.org/10.1145/2967934.2968080",
      "doi": "10.1145/2967934.2968080"
    },
    {
      "text": "Hyojin Chin, Lebogang Wame Molefi and Mun Yong Yi. 2020. Empathy Is All You Need: How a Conversational Agent Should Respond to Verbal Abuse. In Proceedings of 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery. http://dx.doi.org/10.1145/3313831.3376461",
      "doi": ""
    },
    {
      "text": "Amanda Cercas Curry and Verena Rieser. 2018. #Metoo Alexa: How Conversational Systems Respond to Sexual Harassment. In Proceedings of Second ACL Workshop on Ethics in Natural Language Processing. New Orleans, Louisiana, USA.",
      "doi": ""
    },
    {
      "text": "John Danaher. 2017. Robotic Rape and Robotic Child Sexual Abuse: Should They Be Criminalised? Criminal law and philosophy 11, 1, 71-95.",
      "doi": ""
    },
    {
      "text": "Kate Devlin. 2018. Turned On: Science, Sex and Robots. Bloomsbury Publishing, London, UK.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. Where the Action Is: The Foundations of Embodied Interaction. The MIT Press, Cambridge, Massachusetts.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Cara R Dunkley and Lori A Brotto. 2019. The Role of Consent in the Context of BDSM. Sexual Abuse 32, 6, 657-678.",
      "doi": ""
    },
    {
      "text": "Sarah I. Endress, Elisa D. Mekler and Klaus Opwis. 2016. \"It's Like I Would Die as Well\": Gratifications of Fearful Game Experience. In Proceedings of 2016 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts Association for Computing Machinery, Austin, Texas, USA. http://dx.doi.org/10.1145/2968120.2987716",
      "doi": ""
    },
    {
      "text": "Alexandra Fanghanel. 2020. Asking for It: BDSM Sexual Practice and the Trouble of Consent. Sexualities 23, 3, 269-286.",
      "doi": ""
    },
    {
      "text": "B. J. Fogg. 2002. Persuasive Technology: Using Computers to Change What We Think and Do. Ubiquity December (Article 5). http://dx.doi.org/10.1145/764008.763957",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, Amy S. Bruckman, Cosmin Munteanu, Melissa Densmore and Jenny Waycott. 2017. Research Ethics in Hci: A Town Hall Meeting. In Proceedings of 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems Association for Computing Machinery, Denver, Colorado, USA. http://dx.doi.org/10.1145/3027063.3051135",
      "doi": "10.1145/3027063.3051135"
    },
    {
      "text": "Batya Friedman, Edward Felten and Lynette I. Millett. 2000. Informed Consent Online: A Conceptual Model and Design Principles. http://ftp.cs.washington.edu/tr/2000/12/UW-CSE-00-12-02.pdf",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Daniel C. Howe and Edward Felten. Year. Informed Consent in the Mozilla Browser: Implementing Value-Sensitive Design. In Proceedings of 35th Annual Hawaii International Conference on System Sciences. IEEE. http://dx.doi.org/10.1109/HICSS.2002.994366",
      "doi": ""
    },
    {
      "text": "Batya Friedman, Peyina Lin and Jessica K. Miller. 2005. Informed Consent by Design. In Security and Usability, Lorrie Faith Cranor and Simson Garfinkel Eds. O'Reilly, 503-530.",
      "doi": ""
    },
    {
      "text": "Jaclyn Friedman and Jessica Valenti. 2008. Yes Means Yes!: Visions of Female Sexual Power and a World without Rape. Seal, Berkeley, California.",
      "doi": ""
    },
    {
      "text": "Richard Gomer, M. C. schraefel and Enrico Gerding. 2014. Consenting Agents: Semi-Autonomous Interactions for Ubiquitous Consent. In Proceedings of 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication. Association for Computing Machinery, Seattle, Washington, USA. http://dx.doi.org/10.1145/2638728.2641682",
      "doi": ""
    },
    {
      "text": "Sandra Burri Gram-Hansen. 2010. Persuasive Everyware – Possibilities and Limitations In Proceedings of World Multi-conference on Systemics, Cybernetics and Informatics. Orlando, Florida, USA.",
      "doi": ""
    },
    {
      "text": "Anton Gustafsson and Magnus Gyllenswärd. Year. The Power-Aware Cord: Energy Awareness through Ambient Information Display. In Proceedings of CHI 2005 Conference on Human Factors in Computing Systems. ACM, 1423-1426.",
      "doi": ""
    },
    {
      "text": "Sinziana M Gutiu. 2016. The Roboticization of Consent. In Robot Law, Edward Elgar Publishing, London, UK.",
      "doi": ""
    },
    {
      "text": "Helen Halbert and Lisa P. Nathan. 2015. Designing for Discomfort: Supporting Critical Reflection through Interactive Tools. In Proceedings of 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. Association for Computing Machinery. http://dx.doi.org/10.1145/2675133.2675162",
      "doi": ""
    },
    {
      "text": "Jaap Ham, Cees Midden and Femke Beute. 2009. Can Ambient Persuasive Technology Persuade Unconsciously? Using Subliminal Feedback to Influence Energy Consumption Ratings of Household Appliances. In Proceedings of 4th International Conference on Persuasive Technology Association for Computing Machinery, Aalborg, Denmark. http://dx.doi.org/10.1145/1541948.1541988",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Deborah Tatar and Phoebe Sengers. Year. The Three Paradigms of Hci. In Proceedings of Alt Chi. Session at the SIGCHI Conference on Human Factors in Computing Sytems. 1-21.",
      "doi": ""
    },
    {
      "text": "Rex Hartson and Pardha Pyla. 2019. The Ux Book (Second Edition). Elsevier, Amsterdam, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Jeff Hearn and Viv Burr. 2008. Introducing the Erotics of Wounding: Sex, Violence and the Body. In Sex, Violence and the Body, Springer, New York, USA, 1-14.",
      "doi": ""
    },
    {
      "text": "Joseph Henrich, Steven J Heine and Ara Norenzayan. 2010. The Weirdest People in the World? Behavioral and brain sciences 33, 2-3, 61-83.",
      "doi": ""
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Luke Hutton and Tristan Henderson. 2017. Beyond the Eula: Improving Consent for Data Mining. In Transparent Data Mining for Big and Small Data. Studies in Big Data, Tania Cerquitelli Eds. Springer, New York, USA.",
      "doi": ""
    },
    {
      "text": "Naomi Jacobs. 2019. Two Ethical Concerns About the Use of Persuasive Technology for Vulnerable People. Bioethics 34, 5, 519-526. https://doi.org/10.1111/bioe.12683",
      "doi": ""
    },
    {
      "text": "Eva Jozifkova. 2013. Consensual Sadomasochistic Sex (BDSM): The Roots, the Risks, and the Distinctions between BDSM and Violence. Current psychiatry reports 15, 9, 392.",
      "doi": ""
    },
    {
      "text": "Gopinaath Kannabiran, Alex A. Ahmed, Matthew Wood, Madeline Balaam, Joshua G. Tanenbaum, Shaowen Bardzell and Jeffrey Bardzell. 2018. Design for Sexual Wellbeing in Hci. In Proceedings of 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC, Canada, Paper W09. http://dx.doi.org/10.1145/3170427.3170639",
      "doi": "10.1145/3170427.3170639"
    },
    {
      "text": "Gopinaath Kannabiran, Jeffrey Bardzell and Shaowen Bardzell. 2011. How Hci Talks About Sexuality: Discursive Strategies, Blind Spots, and Opportunities for Future Research. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems. ACM, Vancouver, Canada, 695–704. http://dx.doi.org/10.1145/1978942.1979043",
      "doi": "10.1145/1978942.1979043"
    },
    {
      "text": "Pasi Karppinen and Harri Oinas-Kukkonen. 2013. Three Approaches to Ethical Considerations in the Design of Behavior Change Support Systems. In Proceedings of International Conference on Persuasive Technology. Springer, Berlin, Heidelberg. http://dx.doi.org/10.1007/978-3-642-37157-8_12",
      "doi": "10.1007/978-3-642-37157-8_12"
    },
    {
      "text": "Janne Lahtiranta, Sami Hyrynsalmi, Jani Koskinen and 2017. The False Prometheus: Customer Choice, Smart Devices, and Trust. In Proceedings of SIGCAS Computers and Society. Association for Computing Machinery. http://dx.doi.org/10.1145/3144592.3144601",
      "doi": "10.1145/3144592.3144601"
    },
    {
      "text": "Mary Graw Leary. 2016. Affirmatively Replacing Rape Culture with Consent Culture. Texas Tech Law Review 49, 1-57.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Sara Kiesler and Jodi Forlizzi. 2010. Receptionist or Information Kiosk: How Do People Talk with a Robot? In Proceedings of 2010 ACM conference on computer supported cooperative work Association for Computing Machinery, Savannah, Georgia, USA. http://dx.doi.org/10.1145/1718918.1718927",
      "doi": "10.1145/1718918.1718927"
    },
    {
      "text": "Una Lee and Dann Toliver. 2017. Building Consentful Tech. 2017. https://www.communitysolutionsva.org/files/Building_Consentful_Tech_zine.pdf",
      "doi": ""
    },
    {
      "text": "Zhuying Li, Felix Brandmueller, Stefan Greuter and Florian Mueller. 2018. The Guts Game: Designing Playful Experiences for Ingestible Devices. In Proceedings of 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Montreal QC, Canada, Paper VS12. http://dx.doi.org/10.1145/3170427.3186604",
      "doi": "10.1145/3170427.3186604"
    },
    {
      "text": "Zhuying Li, Felix Brandmueller, Florian Mueller and Stefan Greuter. 2017. Ingestible Games: Swallowing a Digital Sensor to Play a Game. In Proceedings of Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, Amsterdam, The Netherlands, 511–518. http://dx.doi.org/10.1145/3130859.3131312",
      "doi": "10.1145/3130859.3131312"
    },
    {
      "text": "Zhuying Li, Weikang Chen, Yan Wang, Ti Hoang, Wei Wang, Mario Boot, Stefan Greuter and Florian Mueller. 2018. Heatcraft: Playing with Ingestible Sensors Via Localised Sensations. In Proceedings of 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, Melbourne, Australia, 521–530. http://dx.doi.org/10.1145/3270316.3271514",
      "doi": "10.1145/3270316.3271514"
    },
    {
      "text": "Zhuying Li, Rakesh Patibanda, Felix Brandmueller, Wei Wang, Kyle Berean, Stefan Greuter and Florian Mueller. 2018. The Guts Game: Towards Designing Ingestible Games. In Proceedings of 2018 Annual Symposium on Computer-Human Interaction in Play. ACM, Melbourne, Australia, 271–283. http://dx.doi.org/10.1145/3242671.3242681",
      "doi": "10.1145/3242671.3242681"
    },
    {
      "text": "Zhuying Li, Jacob Sheahan, Yan Wang, Stefan Greuter and Florian Mueller. 2019. Insideout: Playing with Real-Time Video Images of the Gastrointestinal Tract Via Imaging Capsules. In Proceedings of Annual Symposium on Computer-Human Interaction in Play. Work in Progress. Association for Computing Machinery, Barcelona, Spain, 501–509. http://dx.doi.org/10.1145/3341215.3356291",
      "doi": "10.1145/3341215.3356291"
    },
    {
      "text": "Zhuying Li, Yan Wang, Stefan Greuter and Florian Mueller. 2020. Ingestible Sensors as Design Material for Bodily Play. In Proceedings of 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Honolulu, Hawaii, USA, 1–8. http://dx.doi.org/10.1145/3334480.3382975",
      "doi": ""
    },
    {
      "text": "Zhuying Li, Yan Wang, Jacob Sheahan, Beisi Jiang, Stefan Greuter and Florian Mueller. 2020. Insideout: Towards an Understanding of Designing Playful Experiences with Imaging Capsules. In Proceedings of 2020 ACM Designing Interactive Systems Conference. Association for Computing Machinery, Eindhoven, The Netherlands, 601–613. http://dx.doi.org/10.1145/3357236.3395484",
      "doi": "10.1145/3357236.3395484"
    },
    {
      "text": "Andrés Lucero and Juha Arrasvuori. 2010. Plex Cards: A Source of Inspiration When Designing for Playfulness. In Proceedings of 3rd International Conference on Fun and Games. Association for Computing Machinery, Leuven, Belgium, 28–37. http://dx.doi.org/10.1145/1823818.1823821",
      "doi": "10.1145/1823818.1823821"
    },
    {
      "text": "Ewa Luger, Stuart Moran and Tom Rodden. Year. Consent for All: Revealing the Hidden Complexity of Terms and Conditions. . In Proceedings of 2013 SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, 2687–2696. http://dx.doi.org/10.1145/2470654.2481371",
      "doi": ""
    },
    {
      "text": "Ewa Luger and Tom Rodden. 2013. An Informed View on Consent for Ubicomp. In Proceedings of 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing. Association for Computing Machinery, Zurich, Switzerland. http://dx.doi.org/10.1145/2493432.2493446",
      "doi": "10.1145/2493432.2493446"
    },
    {
      "text": "Sophia Maalsen and Jathan Sadowski. 2019. The Smart Home on Fire: Amplifying and Accelerating Domestic Surveillance. Surveillance & Society 17, 1/2, 118-124.",
      "doi": ""
    },
    {
      "text": "Saskia Maan, Bo Merkus, Jaap Ham and Cees Midden. 2011. Making It Not Too Obvious: The Effect of Ambient Light Feedback on Space Heating Energy Consumption. Energy Efficiency 4, 175-183. http://dx.doi.org/10.1007/s12053-010-9102-6",
      "doi": ""
    },
    {
      "text": "Joe Marshall, Florian Mueller, Steve Benford and Sebastiaan Pijnappel. 2016. Expanding Exertion Gaming. International Journal of Human-Computer Studies 90, 1-13. http://dx.doi.org/10.1016/j.ijhcs.2016.02.003",
      "doi": "10.1016/j.ijhcs.2016.02.003"
    },
    {
      "text": "Rod McCall and Lynne Baillie. 2017. Ethics, Privacy and Trust in Serious Games. In Handbook of Digital Games and Entertainment Technologies, Ryohei Nakatsu Eds. Springer, Singapore.",
      "doi": ""
    },
    {
      "text": "Liz McFall. 2019. Personalizing Solidarity? The Role of Self-Tracking in Health Insurance Pricing. Economy and society 48, 1, 52-76.",
      "doi": ""
    },
    {
      "text": "Stuart Moran, Ewa Luger and Tom Rodden. 2014. An Emerging Tool Kit for Attaining Informed Consent in Ubicomp. In Proceedings of 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication. Association for Computing Machinery, Seattle, Washington, USA. http://dx.doi.org/10.1145/2638728.2641677",
      "doi": "10.1145/2638728.2641677"
    },
    {
      "text": "Florian Mueller, Josh Andres, Joe Marshall, Dag Svanæs, m. c. schraefel, Kathrin Gerling, Jakob Tholander, Anna Lisa Martin-Niedecken, Elena Márquez Segura, Elise van den Hoven, Nicholas Graham, Kristina Höök and Corina Sas. 2018. Body-Centric Computing: Results from a Weeklong Dagstuhl Seminar in a German Castle. interactions 25, 4, 34–39. http://dx.doi.org/10.1145/3215854",
      "doi": ""
    },
    {
      "text": "Florian Mueller, Richard Byrne, Josh Andres and Rakesh Patibanda. Year. Experiencing the Body as Play. In Proceedings of 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, 1-13.",
      "doi": ""
    },
    {
      "text": "Florian Mueller, Tuomas Kari, Zhuying Li, Yan Wang, Yash Dhanpal Mehta, Josh Andres, Jonathan Marquez and Rakesh Patibanda. 2020. Towards Designing Bodily Integrated Play. In Proceedings of Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction. Association for Computing Machinery, Sydney, Australia, 207–218. http://dx.doi.org/10.1145/3374920.3374931",
      "doi": "10.1145/3374920.3374931"
    },
    {
      "text": "Florian Mueller, Zhuying Li, Richard Byrne, Yash Dhanpal Mehta, Peter Arnold and Tuomas Kari. 2019. A 2nd Person Social Perspective on Bodily Play. In Proceedings of 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Glasgow, Scotland, UK, Paper 638. http://dx.doi.org/10.1145/3290605.3300868",
      "doi": "10.1145/3290605.3300868"
    },
    {
      "text": "Florian Mueller, Pedro Lopes, Paul Strohmeier, Wendy Ju, Caitlyn Seim, Martin Weigel, Suranga Nanayakkara, Marianna Obrist, Zhuying Li, Joseph Delfa, Jun Nishida, Elizabeth M. Gerber, Dag Svanaes, Jonathan Grudin, Stefan Greuter, Kai Kunze, Thomas Erickson, Steven Greenspan, Masahiko Inami, Joe Marshall, Harald Reiterer, Katrin Wolf, Jochen Meyer, Thecla Schiphorst, Dakuo Wang and Pattie Maes. 2020. Next Steps for Human-Computer Integration. In Proceedings of 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Honolulu, Hawaii, USA, 1–15. http://dx.doi.org/10.1145/3313831.3376242",
      "doi": ""
    },
    {
      "text": "Florian Mueller, Louise Matjeka, Yan Wang, Josh Andres, Zhuying Li, Jonathan Marquez, Bob Jarvis, Sebastiaan Pijnappel, Rakesh Patibanda and Rohit Ashok Khot. 2020. \"Erfahrung & Erlebnis\": Understanding the Bodily Play Experience through German Lexicon. In Proceedings of Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction. Association for Computing Machinery, Sydney, Australia, 337–347. http://dx.doi.org/10.1145/3374920.3374926",
      "doi": "10.1145/3374920.3374926"
    },
    {
      "text": "Florian Mueller and Matthew Muirhead. 2014. Understanding the Design of a Flying Jogging Companion. In Proceedings of Adjunct publication of the 27th annual ACM symposium on User interface software and technology. Work in Progress. Association for Computing Machinery, Honolulu, Hawaii, USA, 81–82. http://dx.doi.org/10.1145/2658779.2658786",
      "doi": "10.1145/2658779.2658786"
    },
    {
      "text": "Florian Mueller and Matthew Muirhead. Year. Jogging with a Quadcopter. In Proceedings of 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, 2023–2032. http://dx.doi.org/10.1145/2702123.2702472",
      "doi": ""
    },
    {
      "text": "Florian Mueller and Damon Young. 2018. 10 Lenses to Design Sports-Hci. Foundations and Trends® in Human–Computer Interaction 12, 3, 172-237.",
      "doi": ""
    },
    {
      "text": "Josef Nguyen and Bonnie Ruberg. 2020. Challenges of Designing Consent: Consent Mechanics in Video Games as Models for Interactive User Agency. In Proceedings of 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Honolulu, Hawaii, USA, 1–13. http://dx.doi.org/10.1145/3313831.3376827",
      "doi": "10.1145/3313831.3376827"
    },
    {
      "text": "Stina Nylander, Jakob Tholander, Florian Mueller and Joseph Marshall. 2015. Hci and Sports. interactions 22, 2, 30–31. http://dx.doi.org/10.1145/2729712",
      "doi": ""
    },
    {
      "text": "Planned Parenthood. 2020. Sexual Consent. Retrieved 3 September, 2020 from https://www.plannedparenthood.org/learn/relationships/sexual-consent",
      "doi": ""
    },
    {
      "text": "Simon Parkin, Trupti Patel, Isabel Lopez-Neira and Leonie Tanczer. 2019. Usability Analysis of Shared Device Ecosystem Security: Informing Support for Survivors of Iot-Facilitated Tech-Abuse. In Proceedings of New Security Paradigms Workshop. Association for Computing Machinery, San Carlos, Costa Rica, 1–15. http://dx.doi.org/10.1145/3368860.3368861",
      "doi": "10.1145/3368860.3368861"
    },
    {
      "text": "Anco Peeters and Pim Haselager. 2019. Designing Virtuous Sex Robots. International Journal of Social Robotics, 1-12.",
      "doi": ""
    },
    {
      "text": "Alison Phipps, Jessica Ringrose, Emma Renold and Carolyn Jackson. 2018. Rape Culture, Lad Culture and Everyday Sexism: Researching, Conceptualizing and Politicizing New Mediations of Gender and Sexual Violence. Journal of Gender Studies 27, 1, 1-8.",
      "doi": ""
    },
    {
      "text": "James Pierce and Eric Paulos. 2010. Materializing Energy. In Proceedings of 8th ACM Conference on Designing Interactive Systems. ACM, Aarhus, Denmark, 113-122. http://dx.doi.org/10.1145/1858171.1858193",
      "doi": "10.1145/1858171.1858193"
    },
    {
      "text": "Sebastiaan Pijnappel and Florian Mueller. 2013. 4 Design Themes for Skateboarding. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Paris, France, 1271–1274. http://dx.doi.org/10.1145/2470654.2466165",
      "doi": "10.1145/2470654.2466165"
    },
    {
      "text": "Sebastiaan Pijnappel and Florian Mueller. 2014. Designing Interactive Technology for Skateboarding. In Proceedings of 8th International Conference on Tangible, Embedded and Embodied Interaction. Association for Computing Machinery, Munich, Germany, 141–148. http://dx.doi.org/10.1145/2540930.2540950",
      "doi": "10.1145/2540930.2540950"
    },
    {
      "text": "Stephen Purpura, Victoria Schwanda, Kaiton Williams, William Stubler and Phoebe Sengers. 2011. Fit4life: The Design of a Persuasive Technology Promoting Healthy Behavior and Ideal Weight. In Proceedings of SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Vancouver, Canada, 423–432. http://dx.doi.org/10.1145/1978942.1979003",
      "doi": "10.1145/1978942.1979003"
    },
    {
      "text": "Kathleen Richardson. 2016. The Asymmetrical 'Relationship': Parallels between Prostitution and the Development of Sex Robots. SIGCAS Comput. Soc. 45, 3, 290–293. http://dx.doi.org/10.1145/2874239.2874281",
      "doi": "10.1145/2874239.2874281"
    },
    {
      "text": "Kathleen Richardson. 2018. Sex Robots: The End of Love. Polity Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers. 2011. Interaction Design Gone Wild: Striving for Wild Theory. interactions 18, 4, 58–62. http://dx.doi.org/10.1145/1978822.1978834",
      "doi": ""
    },
    {
      "text": "Daniele Rotolo, Diana Hicks and Ben R Martin. 2015. What Is an Emerging Technology? Research policy 44, 10, 1827-1843.",
      "doi": ""
    },
    {
      "text": "Jathan Sadowski. 2019. When Data Is Capital: Datafication, Accumulation, and Extraction. Big Data & Society 6, 1. http://dx.doi.org/10.1177/2053951718820549",
      "doi": ""
    },
    {
      "text": "Jathan Sadowski. 2020. Too Smart: How Digital Capitalism Is Extracting Data, Controlling Our Lives, and Taking over the World. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Rahime Belen Saglam and Jason R. C. Nurse. 2020. Is Your Chatbot Gdpr Compliant? Open Issues in Agent Design. In Proceedings of 2nd Conference on Conversational User Interfaces. Association for Computing Machinery, Bilbao, Spain. http://dx.doi.org/10.1145/3405755.3406131",
      "doi": ""
    },
    {
      "text": "Supraja Sankaran, Chao Zhang, Mathias Funk, Henk Aarts and Panos Markopoulos. 2020. Do I Have a Say? Using Conversational Agents to Re-Imagine Human-Machine Autonomy. In Proceedings of 2nd Conference on Conversational User Interfaces Association for Computing Machinery, Bilbao, Spain. http://dx.doi.org/10.1145/3405755.3406135",
      "doi": "10.1145/3405755.3406135"
    },
    {
      "text": "Brandy L. Simula. 2019. A “Different Economy of Bodies and Pleasures”?: Differentiating and Evaluating Sex and Sexual BDSM Experiences. Journal of Homosexuality 66, 2, 209-237. http://dx.doi.org/10.1080/00918369.2017.1398017",
      "doi": ""
    },
    {
      "text": "Marie Louise Juul Søndergaard. 2017. Intimate Design: Designing Intimacy as a Critical-Feminist Practice. In Proceedings of 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, Denver, Colorado, USA, 320–325. http://dx.doi.org/10.1145/3027063.3027138",
      "doi": ""
    },
    {
      "text": "Marie Louise Juul Søndergaard and Lone Koefoed Hansen. 2018. Intimate Futures: Staying with the Trouble of Digital Personal Assistants through Design Fiction. In Proceedings of 2018 Designing Interactive Systems Conference. Association for Computing Machinery, Hong Kong, China, 869–880. http://dx.doi.org/10.1145/3196709.3196766",
      "doi": "10.1145/3196709.3196766"
    },
    {
      "text": "Andreas Spahn. 2012. And Lead Us (Not) into Persuasion…? Persuasive Technology and the Ethics of Communication. Science and Engineering Ethics 16, 633–650. http://dx.doi.org/10.1007/s11948-011-9278-y",
      "doi": ""
    },
    {
      "text": "Robert Sparrow. 2017. Robots, Rape, and Representation. International Journal of Social Robotics 9, 4, 465-477.",
      "doi": ""
    },
    {
      "text": "Bernt Spiegel. 2010. The Upper Half of the Motorcycle: On the Unity of Rider and Machine. Whitehorse Press, Winwick, Cambridgeshire, UK.",
      "doi": ""
    },
    {
      "text": "Yolande Strengers. Year. Designing Eco-Feedback Systems for Everyday Life. In Proceedings of 2011 annual conference on Human factors in computing systems. Association for Computing Machinery, 1979252, 2135-2144. http://dx.doi.org/10.1145/1978942.1979252",
      "doi": ""
    },
    {
      "text": "Yolande Strengers and Jenny Kennedy. 2020. The Smart Wife: Why Siri, Alexa and Other Smart Home Devices Need a Feminist Reboot. The MIT Press, Canbridge, Massachusetts",
      "doi": ""
    },
    {
      "text": "Yolande Strengers, Jenny Kennedy, Paula Arcari, Larissa Nicholls and Melissa Gregg. 2019. Protection, Productivity and Pleasure in the Smart Home: Emerging Expectations and Gendered Insights from Australian Early Adopters. In Proceedings of 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Glasgow, Scotland, UK, Paper 645. http://dx.doi.org/10.1145/3290605.3300875",
      "doi": "10.1145/3290605.3300875"
    },
    {
      "text": "Norman Makoto Su, Amanda Lazar, Jeffrey Bardzell and Shaowen Bardzell. 2019. Of Dolls and Men: Anticipating Sexual Intimacy with Robots. ACM Transactions for Computer-Human Interaction 26, 3, Article 13. http://dx.doi.org/10.1145/3301422",
      "doi": "10.1145/3301422"
    },
    {
      "text": "Leonie Tanczer, Madeline Carr, Irina Brass, Ine Steenmans and Jason J Blackstock. 2017. Iot and Its Implications for Informed Consent. PETRAS IoT Hub, STEaPP: London.",
      "doi": ""
    },
    {
      "text": "Richard H Thaler and Cass T Sunstein. 2008. Nudge: Improving Decisions About Health, Wealth, and Happiness. Yale University Press, New Haven, USA.",
      "doi": ""
    },
    {
      "text": "Jelte Timmer, Linda Kool and Rinie van Est. 2015. Ethical Challenges in Emerging Applications of Persuasive Technology. In Proceedings of International Conference on Persuasive Technology. Springer, Chicago, USA. http://dx.doi.org/10.1007/978-3-319-20306-5_18",
      "doi": ""
    },
    {
      "text": "Emma L Turley and Trevor Butt. 2015. BDSM—Bondage and Discipline; Dominance and Submission; Sadism and Masochism. In The Palgrave Handbook of the Psychology of Sexuality and Gender, Christina Richards and Meg-John Barker Eds. Springer, London, UK, 24-41.",
      "doi": ""
    },
    {
      "text": "Annika Waern. 2016. The Ethics of Unaware Participation in Public Interventions. In Proceedings of 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, San Jose, California, USA. http://dx.doi.org/10.1145/2858036.2858188",
      "doi": "10.1145/2858036.2858188"
    },
    {
      "text": "Mark West, Rebecca Kraut and Han Ei Chew. 2019. I'd Blush If I Could: Closing Gender Divides in Digital Skills through Education, UNESCO and EQUALS Skills Coalition. https://en.unesco.org/Id-blush-if-I-could",
      "doi": ""
    },
    {
      "text": "DJ Williams, Jeremy N Thomas, Emily E Prior and M Candace Christensen. 2014. From “SSC” and “RACK” to the “4Cs”: Introducing a New Framework for Negotiating BDSM Participation. Electronic Journal of Human Sexuality 17, 5, 1-10.",
      "doi": ""
    },
    {
      "text": "Matthew Wood, Gavin Wood and Madeline Balaam. 2015. Talk About Sex: Designing Games to Facilitate Healthy Discussions around Sex. In Proceedings of 2015 Annual Symposium on Computer-Human Interaction in Play. Association for Computing Machinery, London, UK, 795–798. http://dx.doi.org/10.1145/2793107.2810270",
      "doi": "10.1145/2793107.2810270"
    },
    {
      "text": "Eyal Zamir. 2014. Contract Law and Theory – Three Views of the Cathedral. University of Chicago Law Review 81, 2077–2123.",
      "doi": ""
    },
    {
      "text": "Shoshana Zuboff. 2019. The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power: Barack Obama's Books of 2019. Profile Books, London, UK.",
      "doi": ""
    }
  ]
}