{
  "doi": "10.1145/3411764.3445492",
  "title": "Feels like Team Spirit: Biometric and Strategic Interdependence in Asymmetric Multiplayer VR Games",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Virtual reality (VR) multiplayer games increasingly use asymmetry (e.g., differences in a person’s capability or the user interface) and resulting interdependence between players to create engagement even when one player has no access to a head-mounted display (HMD). Previous work shows this enhances player experience (PX). Until now, it remains unclear whether and how an asymmetric game design with interdependences creates comparably enjoyable PX for both an HMD and a non-HMD player. In this work, we designed and implemented an asymmetric VR game (different in its user interface) with two types of interdependence: strategic (difference in game information/player capability) and biometric (difference in player’s biometric influence). Our mixed-methods user study (N=30) shows that asymmetries positively impact PX for both player roles, that interdependence strongly affects players’ perception of agency, and that biometric feedback—while subjective—is a valuable game mechanic.",
  "authors": [
    {
      "name": "Sukran Karaosmanoglu",
      "institution": "Human-Computer Interaction, Universität Hamburg, Hamburg, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659466914",
      "orcid": "0000-0002-9624-4258"
    },
    {
      "name": "Katja Rogers",
      "institution": "HCI Games Group, Games Institute, and Stratford School of Interaction Design and Business, University of Waterloo, Waterloo, Canada",
      "img": "/do/10.1145/contrib-83458799557/rel-imgonly/img_0821-bw.png",
      "acmid": "83458799557",
      "orcid": "missing"
    },
    {
      "name": "Dennis Wolf",
      "institution": "Institute of Media Informatics, Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658733790",
      "orcid": "missing"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Institute of Media Informatics, Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    },
    {
      "name": "Frank Steinicke",
      "institution": "Human-Computer Interaction, Universität Hamburg, Hamburg, Germany",
      "img": "/do/10.1145/contrib-81313483772/rel-imgonly/steinicke-sit2-sm.jpg",
      "acmid": "81313483772",
      "orcid": "0000-0001-9879-7414"
    },
    {
      "name": "Lennart E. Nacke",
      "institution": "HCI Games Group, Games Institute, and Stratford School of Interaction Design and Business, University of Waterloo, Waterloo, Canada",
      "img": "/do/10.1145/contrib-81392605076/rel-imgonly/len-acm.png",
      "acmid": "81392605076",
      "orcid": "0000-0003-4290-8829"
    }
  ],
  "references": [
    {
      "text": "Mike Ambinder. 2011. Biofeedback in gameplay: How valve measures physiology to enhance gaming experience. In Game Developers Conference, Vol. 22. Game Developers Conference, San Francisco,USA, 27–33.",
      "doi": ""
    },
    {
      "text": "Ambinder, Mike. 2020. Brain-Computer Interfaces: One Possible Future for How We Play. https://www.youtube.com/watch?v=Qhj3C1H5JWo Game Developers Conference, San Francisco, USA.",
      "doi": ""
    },
    {
      "text": "Martin Bauer, Timo Heiber, Gerd Kortuem, and Zary Segall. 1998. A Collaborative Wearable System with Remote Sensing. In Proceedings of the 2Nd IEEE International Symposium on Wearable Computers(ISWC ’98). IEEE Computer Society, Washington, DC, USA, 10–. https://doi.org/10.1109/ISWC.1998.729524",
      "doi": "10.5555/857199.858014"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable Interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 2005–2014. https://doi.org/10.1145/2207676.2208347",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Roni Berger. 2015. Now I see it, now I don’t: Researcher’s position and reflexivity in qualitative research. Qualitative research 15, 2 (2015), 219–234. https://doi.org/10.1177/1468794112468475",
      "doi": ""
    },
    {
      "text": "Frank Biocca and Ben Delaney. 1995. Immersive Virtual Reality Technology. L. Erlbaum Associates Inc., USA, 57–124.",
      "doi": ""
    },
    {
      "text": "Daniel Boland and Mark McGill. 2015. Lost in the rift: engaging with mixed reality. XRDS: Crossroads, The ACM Magazine for Students 22, 1 (2015), 40–45. https://doi.org/10.1145/2810046",
      "doi": "10.1145/2810046"
    },
    {
      "text": "Julia Ayumi Bopp, Elisa D. Mekler, and Klaus Opwis. 2016. Negative Emotion, Positive Experience? Emotionally Moving Moments in Digital Games. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2996–3006. https://doi.org/10.1145/2858036.2858227",
      "doi": "10.1145/2858036.2858227"
    },
    {
      "text": "Stéphane Bouchard, François Bernier, Éric Boivin, Brian Morin, and Geneviève Robillard. 2012. Using biofeedback while immersed in a stressful videogame increases the effectiveness of stress management skills in soldiers. PloS one 7, 4 (2012), e36169. https://doi.org/10.1371/journal.pone.0036169",
      "doi": ""
    },
    {
      "text": "Margaret M Bradley and Peter J Lang. 1994. Measuring emotion: the self-assessment manikin and the semantic differential. Journal of behavior therapy and experimental psychiatry 25, 1(1994), 49–59. https://doi.org/10.1016/0005-7916(94)90063-9",
      "doi": "10.1016/0005-7916%2894%2990063-9"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. To saturate or not to saturate? Questioning data saturation as a useful concept for thematic analysis and sample-size rationales. Qualitative Research in Sport, Exercise and Health 0, 0 (Dec. 2019), 1–16. https://doi.org/10.1080/2159676x.2019.1704846",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2020. One size fits all? What counts as quality practice in (reflexive) thematic analysis?Qualitative Research in Psychology 0, 0 (2020), 1–25. https://doi.org/10.1080/14780887.2020.1769238",
      "doi": ""
    },
    {
      "text": "Liwei Chan and Kouta Minamizawa. 2017. FrontFace: Facilitating Communication Between HMD Users and Outsiders Using Front-facing-screen HMDs. In Proceedings of the 19th International Conference on Human-Computer Interaction with Mobile Devices and Services (Vienna, Austria) (MobileHCI ’17). ACM, New York, NY, USA, Article 22, 5 pages. https://doi.org/10.1145/3098279.3098548",
      "doi": "10.1145/3098279.3098548"
    },
    {
      "text": "Hao Chen, Arindam Dey, Mark Billinghurst, and Robert W. Lindeman. 2017. Exploring the Design Space for Multi-sensory Heart Rate Feedback in Immersive Virtual Reality. In Proceedings of the 29th Australian Conference on Computer-Human Interaction (Brisbane, Queensland, Australia) (OZCHI ’17). ACM, New York, NY, USA, 108–116. https://doi.org/10.1145/3152771.3152783",
      "doi": "10.1145/3152771.3152783"
    },
    {
      "text": "Lung-Pan Cheng, Patrick Lühne, Pedro Lopes, Christoph Sterz, and Patrick Baudisch. 2014. Haptic Turk: A Motion Platform Based on People. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3463–3472. https://doi.org/10.1145/2556288.2557101",
      "doi": "10.1145/2556288.2557101"
    },
    {
      "text": "Valve Corporation. 2018. SteamVR v1.2.3. Microsoft Windows. https://github.com/ValveSoftware/steamvr_unity_plugin/releases/download/1.2.3/SteamVR.Plugin.unitypackage",
      "doi": ""
    },
    {
      "text": "John W Creswell and Vicki L Plano Clark. 2017. Designing and conducting mixed methods research. Sage publications, Thousand Oaks, California, United States.",
      "doi": ""
    },
    {
      "text": "Edward L Deci and Richard M Ryan. 2011. Self-determination theory. Handbook of theories of social psychology 1 (2011), 416–433.",
      "doi": ""
    },
    {
      "text": "Andrew Dekker and Erik Champion. 2007. Please Biofeed the Zombies: Enhancing the Gameplay and Display of a Horror Game Using Biofeedback. In DiGRA’07-Proceedings of the 2007 DiGRA International Conference: Situated Play, Vol. 39. Springer, Tokyo, Japan, 43–52. https://doi.org/10.25917/5d1443e8af4a0",
      "doi": ""
    },
    {
      "text": "Arindam Dey, Hao Chen, Mark Billinghurst, and Robert W. Lindeman. 2018. Effects of Manipulating Physiological Feedback in Immersive Virtual Environments. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play (Melbourne, VIC, Australia) (CHI PLAY ’18). ACM, New York, NY, USA, 101–111. https://doi.org/10.1145/3242671.3242676",
      "doi": "10.1145/3242671.3242676"
    },
    {
      "text": "Arindam Dey, Thammathip Piumsomboon, Youngho Lee, and Mark Billinghurst. 2017. Effects of Sharing Physiological States of Players in a Collaborative Virtual Reality Gameplay. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 4045–4056. https://doi.org/10.1145/3025453.3026028",
      "doi": "10.1145/3025453.3026028"
    },
    {
      "text": "Anders Drachen, Lennart E. Nacke, Georgios Yannakakis, and Anja Lee Pedersen. 2010. Correlation between Heart Rate, Electrodermal Activity and Player Experience in First-Person Shooter Games. In Proceedings of the 5th ACM SIGGRAPH Symposium on Video Games (Los Angeles, California) (Sandbox ’10). Association for Computing Machinery, New York, NY, USA, 49–54. https://doi.org/10.1145/1836135.1836143",
      "doi": "10.1145/1836135.1836143"
    },
    {
      "text": "Inger Ekman, Guillaume Chanel, Simo Järvelä, J.Matias Kivikangas, Mikko Salminen, and Niklas Ravaja. 2012. Social Interaction in Games: Measuring Physiological Linkage and Social Presence. Simulation & Gaming 43, 3 (2012), 321–338. https://doi.org/10.1177/1046878111422121 arXiv:https://doi.org/10.1177/1046878111422121",
      "doi": "10.1177/1046878111422121"
    },
    {
      "text": "Empatica. 2016. Empatica E4 wristband. https://www.empatica.com/en-int/research/e4/",
      "doi": ""
    },
    {
      "text": "Flying Mollusk. 2015. Nevermind. Game [Windows]. https://store.steampowered.com/app/342260/Nevermind/ Flying Mollusk, Los Angeles, CA, United States.",
      "doi": ""
    },
    {
      "text": "ForeignVR. 2016. Ruckus Ridge VR Party. Game [VR]. https://store.steampowered.com/app/443800/Ruckus_Ridge_VR_Party/ ForeignVR, Palo Alto, USA.",
      "doi": ""
    },
    {
      "text": "Theston E. Fox. 2019. VRTK - Virtual Reality Toolkit. https://www.vrtk.io/",
      "doi": ""
    },
    {
      "text": "Taichi Furukawa, Daisuke Yamamoto, Moe Sugawa, Roshan Peiris, and Kouta Minamizawa. 2019. TeleSight: Enabling Asymmetric Collaboration in VR between HMD User and Non-HMD Users. In ACM SIGGRAPH 2019 Emerging Technologies. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3305367.3335040",
      "doi": "10.1145/3305367.3335040"
    },
    {
      "text": "EA Games. 2002. BattleField 1942. Game [PC]. https://www.ea.com/games/battlefield/battlefield-1942",
      "doi": ""
    },
    {
      "text": "S2 Games. 2003. Savage: The Battle for Newerth. Game [PC]. https://www.newerth.com/",
      "doi": ""
    },
    {
      "text": "Steel Crate Games. 2015. Keep Talking And Nobody Explodes. Game [VR, PC]. Steel Crate Games, Ottawa, Canada. https://keeptalkinggame.com/.",
      "doi": ""
    },
    {
      "text": "Kiel Gilleade, Alan Dix, and Jen Allanson. 2005. Affective videogames and modes of affective gaming: assist me, challenge me, emote me. DiGRA 2005: Changing Views–Worlds in Play. 8 (2005), 547–554.",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Julian Frommel, and Enrico Rukzio. 2017. ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4021–4033. https://doi.org/10.1145/3025453.3025683",
      "doi": "10.1145/3025453.3025683"
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Harpreet Sareen, and Enrico Rukzio. 2018. FaceDisplay: Towards Asymmetric Multi-User Interaction for Nomadic Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 54, 13 pages. https://doi.org/10.1145/3173574.3173628",
      "doi": "10.1145/3173574.3173628"
    },
    {
      "text": "John Harris and Mark Hancock. 2019. To Asymmetry and Beyond! Improving Social Connectedness by Increasing Designed Interdependence in Cooperative Play. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300239",
      "doi": "10.1145/3290605.3300239"
    },
    {
      "text": "John Harris, Mark Hancock, and Stacey Scott. 2014. ”beam Me ’round, Scotty!”: Exploring the Effect of Interdependence in Asymmetric Cooperative Games. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-Human Interaction in Play (Toronto, Ontario, Canada) (CHI PLAY ’14). Association for Computing Machinery, New York, NY, USA, 417–418. https://doi.org/10.1145/2658537.2661311",
      "doi": "10.1145/2658537.2661311"
    },
    {
      "text": "John Harris, Mark Hancock, and Stacey D. Scott. 2016. Leveraging Asymmetries in Multiplayer Games: Investigating Design Elements of Interdependent Play. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play (Austin, Texas, USA) (CHI PLAY ’16). Association for Computing Machinery, New York, NY, USA, 350–361. https://doi.org/10.1145/2967934.2968113",
      "doi": "10.1145/2967934.2968113"
    },
    {
      "text": "Samory Houzangbe, Olivier Christmann, Geoffrey Gorisse, and Simon Richir. 2018. Fear as a Biofeedback Game Mechanic in Virtual Reality: Effects on Engagement and Perceived Usability. In Proceedings of the 13th International Conference on the Foundations of Digital Games (Malmö, Sweden) (FDG ’18). Association for Computing Machinery, New York, NY, USA, Article 12, 6 pages. https://doi.org/10.1145/3235765.3235787",
      "doi": "10.1145/3235765.3235787"
    },
    {
      "text": "Samory Houzangbe, Olivier Christmann, Geoffrey Gorisse, and Simon Richir. 2020. Effects of voluntary heart rate control on user engagement and agency in a virtual reality game. Virtual Reality 24(2020), 665–681. https://doi.org/10.1007/s10055-020-00429-7",
      "doi": ""
    },
    {
      "text": "HTC and Valve Corporation. 2016. HTC Vive. https://www.htcvive.com",
      "doi": ""
    },
    {
      "text": "Akira Ishii, Masaya Tsuruta, Ippei Suzuki, Shuta Nakamae, Junichi Suzuki, and Yoichi Ochiai. 2019. Let Your World Open: CAVE-based Visualization Methods of Public Virtual Reality Towards a Shareable VR Experience. In Proceedings of the 10th Augmented Human International Conference 2019 (Reims, France) (AH2019). ACM, New York, NY, USA, Article 33, 8 pages. https://doi.org/10.1145/3311823.3311860",
      "doi": "10.1145/3311823.3311860"
    },
    {
      "text": "Charlene Jennett, Anna L Cox, Paul Cairns, Samira Dhoparee, Andrew Epps, Tim Tijs, and Alison Walton. 2008. Measuring and defining the experience of immersion in games. International journal of human-computer studies 66, 9 (2008), 641–661. https://doi.org/10.1016/j.ijhcs.2008.04.004",
      "doi": "10.1016/j.ijhcs.2008.04.004"
    },
    {
      "text": "Kisung Jeong, Jinmo Kim, Mingyu Kim, Jiwon Lee, and Chanhun Kim. 2020. Asymmetric interface: user interface of asymmetric virtual reality for new presence and experience. Symmetry 12, 1 (2020), 53. https://doi.org/10.3390/sym12010053",
      "doi": ""
    },
    {
      "text": "Calestous Juma. 2016. Innovation and its enemies: Why people resist new technologies. Oxford University Press, Oxford, England.",
      "doi": ""
    },
    {
      "text": "Agneya A Kerure and Jason Freeman. 2018. Audio Source Localization as an Input to Virtual Reality Environments. In Audio Engineering Society Convention 144. Audio Engineering Society, Audio Engineering Society, New York, NY, USA. http://www.aes.org/e-lib/browse.cfm?elib=19415",
      "doi": ""
    },
    {
      "text": "Andrey Krekhov, Daniel Preuß, Sebastian Cmentowski, and Jens Krüger. 2020. Silhouette Games: An Interactive One-Way Mirror Approach to Watching Players in VR. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Virtual Event, Canada) (CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 561–571. https://doi.org/10.1145/3410404.3414247",
      "doi": "10.1145/3410404.3414247"
    },
    {
      "text": "Kai Kuikkaniemi, Toni Laitinen, Marko Turpeinen, Timo Saari, Ilkka Kosunen, and Niklas Ravaja. 2010. The Influence of Implicit and Explicit Biofeedback in First-Person Shooter Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 859–868. https://doi.org/10.1145/1753326.1753453",
      "doi": "10.1145/1753326.1753453"
    },
    {
      "text": "Chen-Lin C. Kulik and James A. Kulik. 1991. Effectiveness of computer-based instruction: An updated analysis. Computers in Human Behavior 7, 1 (1991), 75 – 94. https://doi.org/10.1016/0747-5632(91)90030-5",
      "doi": ""
    },
    {
      "text": "Jiwon Lee, Mingyu Kim, and Jinmo Kim. 2020. RoleVR: Multi-experience in immersive virtual reality between co-located HMD and non-HMD users. Multimedia Tools and Applications 79, 1-2 (2020), 979–1005. https://doi.org/10.1007/s11042-019-08220-w",
      "doi": ""
    },
    {
      "text": "Stefan Liszio, Katharina Emmerich, and Maic Masuch. 2017. The Influence of Social Entities in Virtual Reality Games on Player Experience and Immersion. In Proceedings of the 12th International Conference on the Foundations of Digital Games (Hyannis, Massachusetts) (FDG ’17). Association for Computing Machinery, New York, NY, USA, Article 35, 10 pages. https://doi.org/10.1145/3102071.3102086",
      "doi": "10.1145/3102071.3102086"
    },
    {
      "text": "Adam Lobel, Marientina Gotsis, Erin Reynolds, Michael Annetta, Rutger C.M.E. Engels, and Isabela Granic. 2016. Designing and Utilizing Biofeedback Games for Emotion Regulation: The Case of Nevermind. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). ACM, New York, NY, USA, 1945–1951. https://doi.org/10.1145/2851581.2892521",
      "doi": "10.1145/2851581.2892521"
    },
    {
      "text": "Christian Mai, Sarah Aragon Bartsch, and Lea Rieger. 2018. Evaluating Shared Surfaces for Co-Located Mixed-Presence Collaboration. In Proceedings of the 17th International Conference on Mobile and Ubiquitous Multimedia(Cairo, Egypt) (MUM 2018). ACM, New York, NY, USA, 1–5. https://doi.org/10.1145/3282894.3282910",
      "doi": "10.1145/3282894.3282910"
    },
    {
      "text": "Regan Mandryk, Margaret Atkins, and Kori Inkpen. 2006. A continuous and objective evaluation of emotional experience with interactive play environments, In Proceedings of the SIGCHI conference on Human Factors in computing systems. Conference on Human Factors in Computing Systems - Proceedings 2, 1027–1036. https://doi.org/10.1145/1124772.1124926",
      "doi": "10.1145/1124772.1124926"
    },
    {
      "text": "Regan L. Mandryk. 2008. Physiological measures for game evaluation. Isbister K. Schaffer N., (Eds). Morgan Kaufmann, San Francisco, USA, Chapter 14, 207–235.",
      "doi": ""
    },
    {
      "text": "Regan L. Mandryk and Stella M. Atkins. 2007. A fuzzy physiological approach for continuously modeling emotion during interaction with play technologies. International journal of human-computer studies 65, 4 (2007), 329–347. https://doi.org/10.1016/j.ijhcs.2006.11.011",
      "doi": "10.1016/j.ijhcs.2006.11.011"
    },
    {
      "text": "Regan L. Mandryk, Shane Dielschneider, Michael R. Kalyn, Christopher P. Bertram, Michael Gaetz, Andre Doucette, Brett A. Taylor, Alison Pritchard Orr, and Kathy Keiver. 2013. Games as Neurofeedback Training for Children with FASD. In Proceedings of the 12th International Conference on Interaction Design and Children (New York, New York, USA) (IDC ’13). Association for Computing Machinery, New York, NY, USA, 165–172. https://doi.org/10.1145/2485760.2485762",
      "doi": "10.1145/2485760.2485762"
    },
    {
      "text": "Regan L. Mandryk, Kori M. Inkpen, and Thomas W. Calvert. 2006. Using psychophysiological techniques to measure user experience with entertainment technologies. Behaviour & information technology 25, 2 (2006), 141–158. https://doi.org/10.1080/01449290500331156",
      "doi": ""
    },
    {
      "text": "Regan L. Mandryk and Lennart E. Nacke. 2016. Biometrics in a Data Driven World: Trends, Technologies, and Challenges (1st ed.). Taylor & Francis/CRC Press, USA, Chapter Biometrics in Gaming and Entertainment Technologies, 191–224. https://doi.org/10.1201/9781315317083-7",
      "doi": ""
    },
    {
      "text": "Fares Moustafa and Anthony Steed. 2018. A Longitudinal Study of Small Group Interaction in Social Virtual Reality. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology (Tokyo, Japan) (VRST ’18). Association for Computing Machinery, New York, NY, USA, Article 22, 10 pages. https://doi.org/10.1145/3281505.3281527",
      "doi": "10.1145/3281505.3281527"
    },
    {
      "text": "Janet Horowitz Murray. 2017. Hamlet on the holodeck: The future of narrative in cyberspace. MIT press, London, England.",
      "doi": "10.5555/572887"
    },
    {
      "text": "Joschka Mütterlein and Thomas Hess. 2017. Immersion, presence, interactivity: towards a joint understanding of factors influencing virtual reality acceptance and use. Twenty-third Americas Conference on Information Systems 1 (2017), 117–127.",
      "doi": ""
    },
    {
      "text": "Lennart E. Nacke, Michael Kalyn, Calvin Lough, and Regan L. Mandryk. 2011. Biofeedback Game Design: Using Direct and Indirect Physiological Control to Enhance Game Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 103–112. https://doi.org/10.1145/1978942.1978958",
      "doi": "10.1145/1978942.1978958"
    },
    {
      "text": "Jeff Nagy and Fred Turner. 2019. The Selling of Virtual Reality: Novelty and Continuity in the Cultural Integration of Technology. Communication, Culture and Critique 12, 4 (Nov. 2019), 535–552. https://doi.org/10.1093/ccc/tcz038",
      "doi": ""
    },
    {
      "text": "Benjamin John Newton, Zuzana Rothlingova, Robin Gutteridge, Karen LeMarchand, and Jon Howard Raphael. 2012. No room for reflexivity? Critical reflections following a systematic review of qualitative research. Journal of Health Psychology 17, 6 (2012), 866–885. https://doi.org/10.1177/1359105311427615",
      "doi": ""
    },
    {
      "text": "Kimihiro Noguchi, Yulia R Gel, Edgar Brunner, and Frank Konietschke. 2012. nparLD: an R software package for the nonparametric analysis of longitudinal data in factorial experiments. Journal of Statistical Software 50, 12 (2012). https://doi.org/10.18637/jss.v050.i12",
      "doi": ""
    },
    {
      "text": "Pedro A Nogueira, Vasco Torres, Rui Rodrigues, Eugénio Oliveira, and Lennart E Nacke. 2016. Vanishing scares: biofeedback modulation of affective player experiences in a procedural horror game. Journal on Multimodal User Interfaces 10, 1 (2016), 31–62. https://doi.org/10.1007/s12193-015-0208-1",
      "doi": ""
    },
    {
      "text": "Odd Raven Studios. 2019. Carly and the Reaperman—Escape from the Underworld. Game [HTC Vive, Windows]. Odd Raven Studios, Stockholm, Sweden.",
      "doi": ""
    },
    {
      "text": "Team Panoptes. 2019. Panoptic. Game [VR, PC]. https://panopticgame.com/ Team Panoptes, Brussels, Belgium.",
      "doi": ""
    },
    {
      "text": "Rakesh Patibanda, Florian ’Floyd’ Mueller, Matevz Leskovsek, and Jonathan Duckworth. 2017. Life Tree: Understanding the Design of Breathing Exercise Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Amsterdam, The Netherlands) (CHI PLAY ’17). Association for Computing Machinery, New York, NY, USA, 19–31. https://doi.org/10.1145/3116595.3116621",
      "doi": "10.1145/3116595.3116621"
    },
    {
      "text": "J. Porter, K. Kohm, and A. Robb. 2020. Lingering Effects Associated with Virtual Reality: An Analysis Based on Consumer Discussions Over Time. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, Atlanta, GA, USA, 806–807. https://doi.org/10.1109/VRW50115.2020.00254",
      "doi": ""
    },
    {
      "text": "John Porter and Andrew Robb. 2019. An Analysis of Longitudinal Trends in Consumer Thoughts on Presence and Simulator Sickness in VR Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 277–285. https://doi.org/10.1145/3311350.3347159",
      "doi": "10.1145/3311350.3347159"
    },
    {
      "text": "Red Meat Games. 2018. Bring to Light. Game [VR],[PC]. https://store.steampowered.com/app/636720/Bring_to_Light/ Red Meat Games, Halifax, NS, Canada.",
      "doi": ""
    },
    {
      "text": "Resolution Games. 2019. Acron: Attack of the Squirrels. Game [Oculus Quest, iOS / Android]. https://www.resolutiongames.com/acron Resolution Games, Stockholm, Sweden.",
      "doi": ""
    },
    {
      "text": "Katja Rogers, Jana Funke, Julian Frommel, Sven Stamm, and Michael Weber. 2019. Exploring Interaction Fidelity in Virtual Reality: Object Manipulation and Whole-Body Movements. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300644",
      "doi": "10.1145/3290605.3300644"
    },
    {
      "text": "Katja Rogers, Giovanni Ribeiro, Rina R. Wehbe, Michael Weber, and Lennart E. Nacke. 2018. Vanishing Importance: Studying Immersive Effects of Game Audio Perception on Player Experiences in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173902",
      "doi": "10.1145/3173574.3173902"
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being.American psychologist 55, 1 (2000), 68. https://doi.org/10.1037110003-066X.55.1.68",
      "doi": ""
    },
    {
      "text": "Pejman Sajjadi, Edgar Omar Cebolledo Gutierrez, Sandra Trullemans, and Olga De Troyer. 2014. Maze Commander: A Collaborative Asynchronous Game Using the Oculus Rift & the Sifteo Cubes. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-Human Interaction in Play (Toronto, Ontario, Canada) (CHI PLAY ’14). Association for Computing Machinery, New York, NY, USA, 227–236. https://doi.org/10.1145/2658537.2658690",
      "doi": "10.1145/2658537.2658690"
    },
    {
      "text": "Corina Sas and Rohit Chopra. 2015. MeditAid: a wearable adaptive neurofeedback-based system for training mindfulness state. Personal and Ubiquitous Computing 19, 7 (2015), 1169–1182. https://doi.org/10.1007/s00779-015-0870-z",
      "doi": "10.1007/s00779-015-0870-z"
    },
    {
      "text": "Jeff Sinclair, Philip Hingston, and Martin Masek. 2007. Considerations for the Design of Exergames. In Proceedings of the 5th International Conference on Computer Graphics and Interactive Techniques in Australia and Southeast Asia (Perth, Australia) (GRAPHITE ’07). Association for Computing Machinery, New York, NY, USA, 289–295. https://doi.org/10.1145/1321261.1321313",
      "doi": "10.1145/1321261.1321313"
    },
    {
      "text": "Jeff Sinclair, Philip Hingston, and Martin Masek. 2009. Exergame Development Using the Dual Flow Model. In Proceedings of the Sixth Australasian Conference on Interactive Entertainment (Sydney, Australia) (IE ’09). Association for Computing Machinery, New York, NY, USA, Article 11, 7 pages. https://doi.org/10.1145/1746050.1746061",
      "doi": "10.1145/1746050.1746061"
    },
    {
      "text": "Mel Slater, Martin Usoh, and Anthony Steed. 1994. Depth of presence in virtual environments. Presence: Teleoperators & Virtual Environments 3, 2(1994), 130–144. https://doi.org/10.1162/pres.1994.3.2.130",
      "doi": "10.1162/pres.1994.3.2.130"
    },
    {
      "text": "Michael Smilovitch and Richard Lachman. 2019. BirdQuestVR: A Cross-Platform Asymmetric Communication Game. In Extended Abstracts of the Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts (Barcelona, Spain) (CHI PLAY ’19 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 307–313. https://doi.org/10.1145/3341215.3358246",
      "doi": ""
    },
    {
      "text": "Misha Sra, Xuhai Xu, and Pattie Maes. 2018. BreathVR: Leveraging Breathing as a Directly Controlled Interface for Virtual Reality Games. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173914",
      "doi": ""
    },
    {
      "text": "Aaron Stafford, Wayne Piekarski, and Bruce Thomas. 2006. Implementation of God-like Interaction Techniques for Supporting Collaboration Between Outdoor AR and Indoor Tabletop Users. In Proceedings of the 5th IEEE and ACM International Symposium on Mixed and Augmented Reality(ISMAR ’06). IEEE Computer Society, Washington, DC, USA, 165–172. https://doi.org/10.1109/ISMAR.2006.297809",
      "doi": "10.1109/ISMAR.2006.297809"
    },
    {
      "text": "Aaron Stafford, Bruce H. Thomas, and Wayne Piekarski. 2008. Efficiency of Techniques for Mixed-space Collaborative Navigation. In Proceedings of the 7th IEEE/ACM International Symposium on Mixed and Augmented Reality(ISMAR ’08). IEEE Computer Society, Washington, DC, USA, 181–182. https://doi.org/10.1109/ISMAR.2008.4637356",
      "doi": "10.1109/ISMAR.2008.4637356"
    },
    {
      "text": "Frank Steinicke. 2016. Being Really Virtual: Immersive Natives and the Future of Virtual Reality (1st ed.). Springer Publishing Company, Incorporated, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Team Future LLC. 2016. Black Hat Cooperative. Game [VR, PC]. https://store.steampowered.com/app/503100/Black_Hat_Cooperative/ Team Future LLC, Bangor, ME, USA.",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2019. Unity Real-Time Development Platform. https://unity3d.com/get-unity/download/archive",
      "doi": ""
    },
    {
      "text": "Valve. 2009. Left 4 Dead 2. Game [PC]. Valve Corporation, Bellevue, Washington, United States.",
      "doi": ""
    },
    {
      "text": "Valve. 2010. Alien Swarm. Game [PC]. Valve Corporation, Bellevue, Washington, United States.",
      "doi": ""
    },
    {
      "text": "Amy Voida and Saul Greenberg. 2009. Wii All Play: The Console Game As a Computational Meeting Place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). ACM, New York, NY, USA, 1559–1568. https://doi.org/10.1145/1518701.1518940",
      "doi": "10.1145/1518701.1518940"
    },
    {
      "text": "Wouter Walmink, Danielle Wilde, and Florian ’Floyd’ Mueller. 2014. Displaying Heart Rate Data on a Bicycle Helmet to Support Social Exertion Experiences. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction (Munich, Germany) (TEI ’14). Association for Computing Machinery, New York, NY, USA, 97–104. https://doi.org/10.1145/2540930.2540970",
      "doi": "10.1145/2540930.2540970"
    },
    {
      "text": "Jacob O Wobbrock and Matthew Kay. 2016. Nonparametric statistics in human–computer interaction. In Modern statistical methods for HCI. Springer, New York, NY, USA, 135–170.",
      "doi": ""
    },
    {
      "text": "Keng-Ta Yang, Chiu-Hsuan Wang, and Liwei Chan. 2018. ShareSpace: Facilitating Shared Use of the Physical Space by Both VR Head-Mounted Display and External Users. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). ACM, New York, NY, USA, 499–509. https://doi.org/10.1145/3242587.3242630",
      "doi": "10.1145/3242587.3242630"
    },
    {
      "text": "Zhuoming Zhou, Elena Márquez Segura, Jared Duval, Michael John, and Katherine Isbister. 2019. Astaire: A Collaborative Mixed Reality Dance Game for Collocated Players. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 5–18. https://doi.org/10.1145/3311350.3347152",
      "doi": "10.1145/3311350.3347152"
    }
  ]
}