{
  "doi": "10.1145/3411764.3445257",
  "title": "The Role of Working Memory in Program Tracing",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Program tracing, or mentally simulating a program on concrete inputs, is an important part of general program comprehension. Programs involve many kinds of virtual state that must be held in memory, such as variable/value pairs and a call stack. In this work, we examine the influence of short-term working memory (WM) on a person’s ability to remember program state during tracing. We first confirm that previous findings in cognitive psychology transfer to the programming domain: people can keep about 7 variable/value pairs in WM, and people will accidentally swap associations between variables due to WM load. We use a restricted focus viewing interface to further analyze the strategies people use to trace through programs, and the relationship of tracing strategy to WM. Given a straight-line program, we find half of our participants traced a program from the top-down line-by-line (linearly), and the other half start at the bottom and trace upward based on data dependencies (on-demand). Participants with an on-demand strategy made more WM errors while tracing straight-line code than with a linear strategy, but the two strategies contained an equal number of WM errors when tracing code with functions. We conclude with the implications of these findings for the design of programming tools: first, programs should be analyzed to identify and refactor human-memory-intensive sections of code. Second, programming environments should interactively visualize variable metadata to reduce WM load in accordance with a person’s tracing strategy. Third, tools for program comprehension should enable externalizing program state while tracing.",
  "tags": [
    "Program tracing",
    "working memory",
    "program comprehension",
    "restricted focus viewing"
  ],
  "authors": [
    {
      "name": "Will Crichton",
      "institution": "Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659288947",
      "orcid": "missing"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    },
    {
      "name": "Pat Hanrahan",
      "institution": "Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482576",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "John R Anderson and Robin Jeffries. 1985. Novice LISP errors: Undetected losses of information from working memory. Human–Computer Interaction 1, 2 (1985), 107–131.",
      "doi": ""
    },
    {
      "text": "Paul Ayres and John Sweller. 1990. Locus of difficulty in multistage mathematics problems. The American Journal of Psychology 103, 2 (1990), 167–193.",
      "doi": ""
    },
    {
      "text": "Paul L Ayres. 2001. Systematic mathematical errors and cognitive load. Contemporary Educational Psychology 26, 2 (2001), 227–248.",
      "doi": ""
    },
    {
      "text": "Alan Baddeley. 2010. Working memory. Current biology 20, 4 (2010), R136–R140.",
      "doi": ""
    },
    {
      "text": "Andrew Bragdon, Robert Zeleznik, Steven P Reiss, Suman Karumuri, William Cheung, Joshua Kaplan, Christopher Coleman, Ferdi Adeputra, and Joseph J LaViola Jr. 2010. Code bubbles: a working set-based interface for code understanding and maintenance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Atlanta, GA, 2503–2512.",
      "doi": "10.1145/1753326.1753706"
    },
    {
      "text": "Teresa Busjahn, Roman Bednarik, Andrew Begel, Martha Crosby, James H Paterson, Carsten Schulte, Bonita Sharif, and Sascha Tamm. 2015. Eye movements in code reading: Relaxing the linear order. In 2015 IEEE 23rd International Conference on Program Comprehension. IEEE, IEEE, Florence, Italy, 255–265.",
      "doi": "10.1109/ICPC.2015.36"
    },
    {
      "text": "Jamie ID Campbell and Neil Charness. 1990. Age-related declines in working-memory skills: Evidence from a complex calculation task.Developmental Psychology 26, 6 (1990), 879.",
      "doi": ""
    },
    {
      "text": "Patrick Cousot and Radhia Cousot. 1977. Abstract interpretation: a unified lattice model for static analysis of programs by construction or approximation of fixpoints. In Proceedings of the 4th ACM SIGACT-SIGPLAN symposium on Principles of programming languages. ACM, Los Angeles, CA, 238–252.",
      "doi": "10.1145/512950.512973"
    },
    {
      "text": "Nelson Cowan. 2001. The magical number 4 in short-term memory: A reconsideration of mental storage capacity. Behavioral and brain sciences 24, 1 (2001), 87–114.",
      "doi": ""
    },
    {
      "text": "Leonardo de Moura, Soonho Kong, Jeremy Avigad, Floris Van Doorn, and Jakob von Raumer. 2015. The Lean theorem prover (system description). In International Conference on Automated Deduction. Springer, CADE, Berlin, Germany, 378–388.",
      "doi": ""
    },
    {
      "text": "Diana DeStefano and Jo-Anne LeFevre. 2004. The role of working memory in mental arithmetic. European Journal of Cognitive Psychology 16, 3 (2004), 353–386.",
      "doi": ""
    },
    {
      "text": "Françoise Détienne and Elliot Soloway. 1990. An empirically-derived control structure for the process of program understanding. International Journal of Man-Machine Studies 33, 3 (1990), 323–342.",
      "doi": "10.1016/S0020-7373%2805%2980122-1"
    },
    {
      "text": "Robert Bruce Findler. 2020. DrRacket: The Racket Programming Environment. https://docs.racket-lang.org/drracket/",
      "doi": ""
    },
    {
      "text": "Ansgar J FÜrst and Graham J Hitch. 2000. Separate roles for executive and phonological components of working memory in mental arithmetic. Memory & cognition 28, 5 (2000), 774–782.",
      "doi": ""
    },
    {
      "text": "Google. 2020. Google C++ Style Guide. https://google.github.io/styleguide/cppguide.html",
      "doi": ""
    },
    {
      "text": "Thomas RG Green. 1989. Cognitive dimensions of notations. People and computers V 5, 1 (1989), 443–460.",
      "doi": ""
    },
    {
      "text": "Graham J Hitch. 1978. The role of short-term working memory in mental arithmetic. Cognitive Psychology 10, 3 (1978), 302–323.",
      "doi": ""
    },
    {
      "text": "Edwin Hutchins. 1995. Cognition in the Wild. MIT press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Anthony R Jansen, Alan F Blackwell, and Kim Marriott. 2003. A tool for tracking visual attention: The restricted focus viewer. Behavior research methods, instruments, & computers 35, 1 (2003), 57–69.",
      "doi": ""
    },
    {
      "text": "Stanley Letovsky. 1987. Cognitive processes in program comprehension. Journal of Systems and software 7, 4 (1987), 325–339.",
      "doi": "10.1016/0164-1212%2887%2990032-X"
    },
    {
      "text": "Raymond Lister, Colin Fidge, and Donna Teague. 2009. Further evidence of a relationship between explaining, tracing and writing skills in introductory programming. Acm sigcse bulletin 41, 3 (2009), 161–165.",
      "doi": ""
    },
    {
      "text": "Mike Lopez, Jacqueline Whalley, Phil Robbins, and Raymond Lister. 2008. Relationships between reading, tracing and writing skills in introductory programming. In Proceedings of the fourth international workshop on computing education research. ACM, Sydney, Australia, 101–112.",
      "doi": "10.1145/1404520.1404531"
    },
    {
      "text": "George A Miller. 1956. The magical number seven, plus or minus two: Some limits on our capacity for processing information.Psychological review 63, 2 (1956), 81.",
      "doi": ""
    },
    {
      "text": "Neil Morris and Dylan M Jones. 1990. Memory updating in working memory: The role of the central executive. British journal of psychology 81, 2 (1990), 111–121.",
      "doi": ""
    },
    {
      "text": "Peter A Nobel and Richard M Shiffrin. 2001. Retrieval processes in recognition and cued recall.Journal of Experimental Psychology: Learning, Memory, and Cognition 27, 2(2001), 384.",
      "doi": ""
    },
    {
      "text": "Klaus Oberauer, Stephan Lewandowsky, Edward Awh, Gordon DA Brown, Andrew Conway, Nelson Cowan, Christopher Donkin, Simon Farrell, Graham J Hitch, Mark J Hurlstone, 2018. Benchmarks for models of short-term and working memory.Psychological Bulletin 144, 9 (2018), 885.",
      "doi": ""
    },
    {
      "text": "Norman Peitek, Janet Siegmund, and Sven Apel. 2020. What Drives the Reading Order of Programmers? An Eye Tracking Study. In Proceedings of the 28th International Conference on Program Comprehension. IEEE/ACM, Seoul, South Korea, 342–353.",
      "doi": "10.1145/3387904.3389279"
    },
    {
      "text": "Martin J Pickering and Simon Garrod. 2007. Do people use language production to make predictions during comprehension?Trends in cognitive sciences 11, 3 (2007), 105–110.",
      "doi": ""
    },
    {
      "text": "Juha Sorva. 2007. Notional machines and introductory programming education. Trans. Comput. Educ 13, 2 (2007), 1–31.",
      "doi": ""
    },
    {
      "text": "Sara Steegen, Francis Tuerlinckx, Andrew Gelman, and Wolf Vanpaemel. 2016. Increasing transparency through a multiverse analysis. Perspectives on Psychological Science 11, 5 (2016), 702–712.",
      "doi": ""
    },
    {
      "text": "Nash Unsworth. 2009. Examining variation in working memory capacity and retrieval in cued recall. Memory 17, 4 (2009), 386–396.",
      "doi": ""
    },
    {
      "text": "Vesa Vainio and Jorma Sajaniemi. 2007. Factors in novice programmers’ poor tracing skills. ACM SIGCSE Bulletin 39, 3 (2007), 236–240.",
      "doi": "10.1145/1269900.1268853"
    },
    {
      "text": "Anneliese Von Mayrhauser and A Marie Vans. 1995. Program comprehension during software maintenance and evolution. Computer 28, 8 (1995), 44–55.",
      "doi": "10.1109/2.402076"
    },
    {
      "text": "Margaret Wilson and Günther Knoblich. 2005. The case for motor involvement in perceiving conspecifics.Psychological bulletin 131, 3 (2005), 460.",
      "doi": ""
    },
    {
      "text": "Jiajie Zhang and Donald A Norman. 1995. A representational analysis of numeration systems. Cognition 57, 3 (1995), 271–295.",
      "doi": ""
    }
  ]
}