{
  "doi": "10.1145/3411764.3445780",
  "title": "KnitUI: Fabricating Interactive and Sensing Textiles with Machine Knitting",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "With the recent interest in wearable electronics and smart garments, digital fabrication of sensing and interactive textiles is in increasing demand. Recently, advances in digital machine knitting offer opportunities for the programmable, rapid fabrication of soft, breathable textiles. In this paper, we present KnitUI, a novel, accessible machine-knitted user interface based on resistive pressure sensing. Employing conductive yarns and various machine knitting techniques, we computationally design and automatically fabricate the double-layered resistive sensing structures as well as the coupled conductive connection traces with minimal manual post-processing. We present an interactive design interface for users to customize KnitUI’s colors, sizes, positions, and shapes. After investigating design parameters for the optimized sensing and interactive performance, we demonstrate KnitUI as a portable, deformable, washable, and customizable interactive and sensing platform. It obtains diverse applications, including wearable user interfaces, tactile sensing wearables, and artificial robot skin.",
  "authors": [
    {
      "name": "Yiyue Luo",
      "institution": "MIT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702542",
      "orcid": "missing"
    },
    {
      "name": "Kui Wu",
      "institution": "CSAIL MIT, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659642015",
      "orcid": "missing"
    },
    {
      "name": "Tomás Palacios",
      "institution": "Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659429134",
      "orcid": "missing"
    },
    {
      "name": "Wojciech Matusik",
      "institution": "CSAIL MIT, United States",
      "img": "/do/10.1145/contrib-81100458116/rel-imgonly/wojciech_matusik_001.jpg",
      "acmid": "81100458116",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Roland Aigner, Andreas Pointner, Thomas Preindl, Patrick Parzer, and Michael Haller. 2020. Embroidered Resistive Pressure Sensors: A Novel Approach for Textile Interfaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376305"
    },
    {
      "text": "Lea Albaugh, Scott Hudson, and Lining Yao. 2019. Digital Fabrication of Soft Actuated Objects by Machine Knitting. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). ACM, New York, NY, USA, Article VS01, 1 pages.",
      "doi": "10.1145/3290607.3313270"
    },
    {
      "text": "Ozgur Atalay, Asli Atalay, Joshua Gafford, and Conor Walsh. 2018. A highly sensitive capacitive-based soft pressure sensor based on a conductive fabric and a microporous dielectric layer. Advanced Materials Technologies 3, 1 (2018), 1700237.",
      "doi": ""
    },
    {
      "text": "Shaojie Bai, J. Zico Kolter, and Vladlen Koltun. 2018. An Empirical Evaluation of Generic Convolutional and Recurrent Networks for Sequence Modeling. arXiv:1803.01271 (2018).",
      "doi": ""
    },
    {
      "text": "Tommaso D’Alessio. 1999. Measurement errors in the scanning of piezoresistive sensors arrays. Sensors and Actuators A: Physical 72, 1 (1999), 71–76.",
      "doi": ""
    },
    {
      "text": "Jun Gong, Yu Wu, Lei Yan, Teddy Seyed, and Xing-Dong Yang. 2019. Tessutivo: Contextual Interactions on Interactive Fabrics with Inductive Sensing. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 29–41.",
      "doi": "10.1145/3332165.3347897"
    },
    {
      "text": "Jun Gong, Xin Yang, Teddy Seyed, Josh Urban Davis, and Xing-Dong Yang. 2018. Indutivo: Contact-Based, Object-Driven Interactions with Inductive Sensing. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 321–333.",
      "doi": "10.1145/3242587.3242662"
    },
    {
      "text": "Nur Al-huda Hamdan, Jeffrey R. Blum, Florian Heller, Ravi Kanth Kosuru, and Jan Borchers. 2016. Grabbing at an Angle: Menu Selection for Fabric Interfaces. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (Heidelberg, Germany) (ISWC ’16). Association for Computing Machinery, New York, NY, USA, 1–7.",
      "doi": "10.1145/2971763.2971786"
    },
    {
      "text": "Nur Al-huda Hamdan, Simon Voelker, and Jan Borchers. 2018. Sketch & Stitch: Interactive Embroidery for E-Textiles(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Min-Woo Han and Sung-Hoon Ahn. 2017. Blooming Knit Flowers: Loop-Linked Soft Morphing Structures for Soft Robotics. Advanced Materials 29, 13 (2017), 1606580.",
      "doi": ""
    },
    {
      "text": "Christian Harito, Listya Utari, Budi Riza Putra, Brian Yuliarto, Setyo Purwanto, Syed ZJ Zaidi, Dmitry V Bavykin, Frank Marken, and Frank C Walsh. 2020. The Development of Wearable Polymer-Based Sensors: Perspectives. Journal of The Electrochemical Society 167, 3 (2020), 037566.",
      "doi": ""
    },
    {
      "text": "Gerard J Hayes, Ying Liu, Jan Genzer, Gianluca Lazzi, and Michael D Dickey. 2014. Self-folding origami microstrip antennas. IEEE Transactions on Antennas and Propagation 62, 10(2014), 5416–5419.",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Lea Albaugh, Ticha Sethapakadi, Jessica Hodgins, Scott E. Hudson, James McCann, and Jennifer Mankoff. 2019. KnitPicking Textures: Programming and Modifying Complex Knitted Textures for Machine and Hand Knitting. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 5–16.",
      "doi": "10.1145/3332165.3347886"
    },
    {
      "text": "Cedric Honnet, Hannah Perner-Wilson, Marc Teyssier, Bruno Fruchard, Jürgen Steimle, Ana C. Baptista, and Paul Strohmeier. 2020. PolySense: Augmenting Textiles with Electrical Functionality Using In-Situ Polymerization. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376841"
    },
    {
      "text": "Alexandre Kaspar, Liane Makatura, and Wojciech Matusik. 2019. Knitting Skeletons: A Computer-Aided Design Tool for Shaping and Patterning of Knitted Garments. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 53–65.",
      "doi": "10.1145/3332165.3347879"
    },
    {
      "text": "Konstantin Klamka, Raimund Dachselt, and Jürgen Steimle. 2020. Rapid Iron-On User Interfaces: Hands-on Fabrication of Interactive Textile Prototypes. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376220"
    },
    {
      "text": "Pin-Sung Ku, Qijia Shao, Te-Yen Wu, Jun Gong, Ziyan Zhu, Xia Zhou, and Xing-Dong Yang. 2020. ThreadSense: Locating Touch on an Extremely Thin Interactive Thread. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376779"
    },
    {
      "text": "Joanne Leong, Patrick Parzer, Florian Perteneder, Teo Babic, Christian Rendl, Anita Vogl, Hubert Egger, Alex Olwal, and Michael Haller. 2016. ProCover: Sensory Augmentation of Prosthetic Limbs Using Smart Textile Covers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 335–346.",
      "doi": "10.1145/2984511.2984572"
    },
    {
      "text": "Jenny Lin, Vidya Narayanan, and James McCann. 2018. Efficient Transfer Planning for Flat Knitting. In Proceedings of the 2Nd ACM Symposium on Computational Fabrication (Cambridge, Massachusetts) (SCF ’18). ACM, New York, NY, USA, Article 1, 7 pages.",
      "doi": "10.1145/3213512.3213515"
    },
    {
      "text": "Takuya Maekawa, Yasue Kishino, Yutaka Yanagisawa, and Yasushi Sakurai. 2012. Recognizing handheld electrical device usage with hand-worn coil of wire. In International Conference on Pervasive Computing. Springer, 234–252.",
      "doi": "10.1007/978-3-642-31205-2_15"
    },
    {
      "text": "James McCann. 2017. The “Knitout” (.k) File Format. [Online]. Available from: https://textiles-lab.github.io/knitout/knitout.html.",
      "doi": ""
    },
    {
      "text": "James McCann, Lea Albaugh, Vidya Narayanan, April Grow, Wojciech Matusik, Jennifer Mankoff, and Jessica Hodgins. 2016. A Compiler for 3D Machine Knitting. ACM Trans. Graph. 35, 4, Article 49 (July 2016), 11 pages.",
      "doi": "10.1145/2897824.2925940"
    },
    {
      "text": "J. Meyer, B. Arnrich, J. Schumm, and G. Troster. 2010. Design and Modeling of a Textile Pressure Sensor for Sitting Posture Classification. IEEE Sensors Journal 10, 8 (Aug 2010), 1391–1398.",
      "doi": ""
    },
    {
      "text": "Vidya Narayanan, Lea Albaugh, Jessica Hodgins, Stelian Coros, and James Mccann. 2018. Automatic Machine Knitting of 3D Meshes. ACM Trans. Graph. 37, 3, Article 35 (Aug. 2018), 15 pages.",
      "doi": "10.1145/3186265"
    },
    {
      "text": "Vidya Narayanan, Kui Wu, Cem Yuksel, and James McCann. 2019. Visual knitting machine programming. ACM Transactions on Graphics (TOG) 38, 4 (2019), 1–13.",
      "doi": "10.1145/3306346.3322995"
    },
    {
      "text": "Maggie Orth, Joshua R Smith, E Rehmi Post, JA Strickon, and Emily B Cooper. 1998. Musical jacket. In ACM SIGGRAPH 98 Electronic art and animation catalog. 38.",
      "doi": ""
    },
    {
      "text": "Jifei Ou, Daniel Oran, Don Derek Haddad, Joseph Paradiso, and Hiroshi Ishii. 2019. SensorKnit: Architecting textile sensors with machine knitting. 3D Printing and Additive Manufacturing 6, 1 (2019), 1–11.",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Florian Perteneder, Kathrin Probst, Christian Rendl, Joanne Leong, Sarah Schuetz, Anita Vogl, Reinhard Schwoediauer, Martin Kaltenbrunner, Siegfried Bauer, and et al.2018. RESi: A Highly Flexible, Pressure-Sensitive, Imperceptible Textile Interface Based on Resistive Yarns. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 745–756.",
      "doi": ""
    },
    {
      "text": "Patrick Parzer, Adwait Sharma, Anita Vogl, Jürgen Steimle, Alex Olwal, and Michael Haller. 2017. SmartSleeve: Real-Time Sensing of Surface and Deformation Gestures on Flexible, Interactive Textiles, Using a Hybrid Gesture Detection Pipeline. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology(Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 565–577.",
      "doi": "10.1145/3126594.3126652"
    },
    {
      "text": "Andreas Pointner, Thomas Preindl, Sara Mlakar, Roland Aigner, and Michael Haller. 2020. Knitted RESi: A Highly Flexible, Force-Sensitive Knitted Textile Based on Resistive Yarns. In ACM SIGGRAPH 2020 Emerging Technologies (Virtual Event, USA) (SIGGRAPH ’20). Association for Computing Machinery, New York, NY, USA, Article 21, 2 pages.",
      "doi": "10.1145/3388534.3407292"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4216–4227.",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "M. Rofouei, W. Xu, and M. Sarrafzadeh. 2010. Computing with uncertainty in a smart textile surface for object recognition. In 2010 IEEE Conference on Multisensor Fusion and Integration. 174–179.",
      "doi": ""
    },
    {
      "text": "Stefan Schneegass and Alexandra Voit. 2016. GestureSleeve: Using Touch Sensitive Fabrics for Gestural Input on the Forearm for Controlling Smartwatches. In Proceedings of the 2016 ACM International Symposium on Wearable Computers (Heidelberg, Germany) (ISWC ’16). Association for Computing Machinery, New York, NY, USA, 108–115.",
      "doi": "10.1145/2971763.2971797"
    },
    {
      "text": "Maximilian Sergio, Nicolo Manaresi, Marco Tartagni, Roberto Guerrieri, and Roberto Canegallo. 2002. A textile based capacitive pressure sensor. In SENSORS, 2002 IEEE, Vol. 2. IEEE, 1625–1630.",
      "doi": ""
    },
    {
      "text": "Shima Seiki. 2011. SDS-ONE Apex3. [Online]. Available from: http://www.shimaseiki.com/product/design/sdsone_apex/flat/.",
      "doi": ""
    },
    {
      "text": "Matteo Stoppa and Alessandro Chiolerio. 2014. Wearable electronics and smart textiles: a critical review. sensors 14, 7 (2014), 11957–11992.",
      "doi": ""
    },
    {
      "text": "Zhenhua Tang, Shuhai Jia, Si Shi, Fei Wang, and Bo Li. 2018. Coaxial carbon nanotube/polymer fibers as wearable piezoresistive sensors. Sensors and Actuators A: Physical 284 (2018), 85–95.",
      "doi": ""
    },
    {
      "text": "Jenny Underwood. 2009. The design of 3D shape knitted preforms. Ph.D. Dissertation. Fashion and Textiles, RMIT University.",
      "doi": ""
    },
    {
      "text": "Richard Vallett, Denisa Qori McDonald, Genevieve Dion, Youngmoo Kim, and Ali Shokoufandeh. 2020. Toward Accurate Sensing with Knitted Fabric: Applications and Technical Considerations. Proc. ACM Hum.-Comput. Interact. 4, EICS, Article 79 (June 2020), 26 pages.",
      "doi": "10.1145/3394981"
    },
    {
      "text": "Richard Vallett, Ryan Young, Chelsea Knittel, Youngmoo Kim, and Genevieve Dion. 2016. Development of a Carbon Fiber Knitted Capacitive Touch Sensor. MRS Advances 1, 38 (2016), 2641–2651. https://doi.org/10.1557/adv.2016.498",
      "doi": ""
    },
    {
      "text": "Nicolas Villar, Daniel Cletheroe, Greg Saul, Christian Holz, Tim Regan, Oscar Salandin, Misha Sra, Hui-Shyong Yeo, William Field, and Haiyan Zhang. 2018. Project Zanzibar: A Portable and Flexible Tangible Interaction Platform. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 515, 13 pages.",
      "doi": "10.1145/3173574.3174089"
    },
    {
      "text": "Edward J Wang, Tien-Jui Lee, Alex Mariakakis, Mayank Goel, Sidhant Gupta, and Shwetak N Patel. 2015. Magnifisense: Inferring device interaction using wrist-worn passive magneto-inductive sensors. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 15–26.",
      "doi": "10.1145/2750858.2804271"
    },
    {
      "text": "Mark Weiser. 1999. The Computer for the 21st Century. SIGMOBILE Mob. Comput. Commun. Rev. 3, 3 (July 1999), 3–11.",
      "doi": "10.1145/329124.329126"
    },
    {
      "text": "Irmandy Wicaksono, Carson I Tucker, Tao Sun, Cesar A Guerrero, Clare Liu, Wesley M Woo, Eric J Pence, and Canan Dagdeviren. 2020. A tailored, electronic textile conformable suit for large-scale spatiotemporal physiological sensing in vivo. npj Flexible Electronics 4, 1 (2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Kui Wu, Xifeng Gao, Zachary Ferguson, Daniele Panozzo, and Cem Yuksel. 2018. Stitch Meshing. ACM Trans. Graph. (Proceedings of SIGGRAPH 2018) 37, 4, Article 130 (jul 2018), 14 pages.",
      "doi": ""
    },
    {
      "text": "Kui Wu, Hannah Swan, and Cem Yuksel. 2019. Knittable Stitch Meshes. ACM Trans. Graph. 38, 1, Article 10 (Jan. 2019), 13 pages.",
      "doi": "10.1145/3292481"
    },
    {
      "text": "W. Xu, M. Huang, N. Amini, L. He, and M. Sarrafzadeh. 2013. eCushion: A Textile Pressure Sensor Array Design and Calibration for Sitting Posture Analysis. IEEE Sensors Journal 13, 10 (Oct 2013), 3926–3934.",
      "doi": ""
    },
    {
      "text": "Cem Yuksel, Jonathan M. Kaldor, Doug L. James, and Steve Marschner. 2012. Stitch Meshes for Modeling Knitted Clothing with Yarn-level Detail. ACM Trans. Graph. (Proceedings of SIGGRAPH 2012) 31, 3, Article 37 (2012), 12 pages.",
      "doi": ""
    }
  ]
}