{
  "doi": "10.1145/3411764.3445135",
  "title": "Community Based Robot Design for Classrooms with Mixed Visual Abilities Children",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Visually impaired children (VI) face challenges in collaborative learning in classrooms. Robots have the potential to support inclusive classroom experiences by leveraging their physicality, bespoke social behaviors, sensors, and multimodal feedback. However, the design of social robots for mixed-visual abilities classrooms remains mostly unexplored. This paper presents a four-month-long community-based design process where we engaged with a school community. We provide insights into the barriers experienced by children and how social robots can address them. We also report on a participatory design activity with mixed-visual abilities children, highlighting the expected roles, attitudes, and physical characteristics of robots. Findings contextualize social robots within inclusive classroom settings as a holistic solution that can interact anywhere when needed and suggest a broader view of inclusion beyond disability. These include children’s personality traits, technology access, and mastery of school subjects. We finish by providing reflections on the community-based design process.",
  "authors": [
    {
      "name": "Isabel Neto",
      "institution": "INESC-ID University of Lisbon, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659542051",
      "orcid": "0000-0003-2515-0446"
    },
    {
      "name": "Hugo Nicolau",
      "institution": "ITI/LARSyS, Instituto Superior Técnico, Universidade de Lisboa Lisbon, Portugal",
      "img": "/do/10.1145/contrib-81416594384/rel-imgonly/me_small.png",
      "acmid": "81416594384",
      "orcid": "0000-0002-8176-7638"
    },
    {
      "name": "Ana Paiva",
      "institution": "INESC-ID, Instituto Superior Técnico, Universidade de Lisboa, Radcliffe, Portugal and Institute for Advanced Study, Harvard UniversityInstitute for Advanced Study, Harvard UniversityInstitute for Advanced Study, Harvard University, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436595004",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Muneeb Imtiaz Ahmad, Omar Mubin, and Joanne Orlando. 2017. Adaptive social robot for sustaining social engagement during long-term children–robot interaction. International Journal of Human–Computer Interaction 33, 12(2017), 943–962.",
      "doi": ""
    },
    {
      "text": "Dragan Ahmetovic, Cole Gleason, Chengxiong Ruan, Kris Kitani, Hironobu Takagi, and Chieko Asakawa. 2016. NavCog: A Navigational Cognitive Assistant for the Blind. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services(Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 90–99. https://doi.org/10.1145/2935334.2935361",
      "doi": "10.1145/2935334.2935361"
    },
    {
      "text": "Patricia Alves-Oliveira. 2020. Boosting Children’s Creativity through Creative Interactions with Social Robots. Ph.D. Dissertation. University Institute of Lisbon, School of Social Sciences and Humanities, Lisbon, Portugal. https://repositorio.iscte-iul.pt/handle/10071/20620",
      "doi": ""
    },
    {
      "text": "Patrícia Alves-Oliveira, Patrícia Arriaga, Ana Paiva, and Guy Hoffman. 2017. YOLO, a Robot for Creativity: A Co-Design Study with Children. In Proceedings of the 2017 Conference on Interaction Design and Children (Stanford, California, USA) (IDC ’17). Association for Computing Machinery, New York, NY, USA, 423–429. https://doi.org/10.1145/3078072.3084304",
      "doi": "10.1145/3078072.3084304"
    },
    {
      "text": "Anki. 2016. Cozmo robot. https://www.digitaldreamlabs.com/pages/cozmo",
      "doi": ""
    },
    {
      "text": "Tamarah M Ashton. 2002. Assistive technology. Journal of Special Education Technology 18, 1 (2002), 39–43.",
      "doi": ""
    },
    {
      "text": "Thibault Asselborn, Arzu Guneysu, Khalil Mrini, Elmira Yadollahi, Ayberk Ozgur, Wafa Johal, and Pierre Dillenbourg. 2018. Bringing Letters to Life: Handwriting with Haptic-Enabled Tangible Robots. In Proceedings of the 17th ACM Conference on Interaction Design and Children (Trondheim, Norway) (IDC ’18). Association for Computing Machinery, New York, NY, USA, 219–230. https://doi.org/10.1145/3202185.3202747",
      "doi": "10.1145/3202185.3202747"
    },
    {
      "text": "S. Azenkot, C. Feng, and M. Cakmak. 2016. Enabling building service robots to guide blind people a participatory design approach. In 2016 11th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, Association for Computing Machinery, New York, NY, USA, 3–10. https://doi.org/10.1109/HRI.2016.7451727",
      "doi": ""
    },
    {
      "text": "Kim Baraka, Patrícia Alves-Oliveira, and Tiago Ribeiro. 2020. An extended framework for characterizing social robots. In Human-Robot Interaction. Springer, Springer, Cham, 21–64.",
      "doi": ""
    },
    {
      "text": "Sandra Bardot, Marcos Serrano, Bernard Oriola, and Christophe Jouffrais. 2017. Identifying How Visually Impaired People Explore Raised-Line Diagrams to Improve the Design of Touch Interfaces. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 550–555. https://doi.org/10.1145/3025453.3025582",
      "doi": "10.1145/3025453.3025582"
    },
    {
      "text": "Renata Pitta Barros, Aquiles Medeiros Filgueira Burlamaqui, Samuel Oliveira de Azevedo, Sarah Thomaz de Lima Sa, Luiz Marcos Garcia Goncalves, Akynara Aglae R S da Silva, 2017. Cardbot-assistive technology for visually impaired in educational robotics: Experiments and results. IEEE Latin America Transactions 15, 3 (2017), 517–527.",
      "doi": ""
    },
    {
      "text": "Tony Belpaeme, James Kennedy, Aditi Ramachandran, Brian Scassellati, and Fumihide Tanaka. 2018. Social robots for education: A review. Science robotics 3, 21 (2018).",
      "doi": ""
    },
    {
      "text": "Mayara Bonani, Raquel Oliveira, Filipa Correia, André Rodrigues, Tiago Guerreiro, and Ana Paiva. 2018. What My Eyes Can’t See, A Robot Can Show Me: Exploring the Collaboration Between Blind People and Robots. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (Galway, Ireland) (ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 15–27. https://doi.org/10.1145/3234695.3239330",
      "doi": "10.1145/3234695.3239330"
    },
    {
      "text": "Emily C Bouck. 2016. A national snapshot of assistive technology for students with disabilities. Journal of Special Education Technology 31, 1 (2016), 4–13.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2014. What can “thematic analysis” offer health and wellbeing researchers?International journal of qualitative studies on health and well-being 9 (2014).",
      "doi": ""
    },
    {
      "text": "David J Brown and Michael J Proulx. 2016. Audio–vision substitution for blind individuals: Addressing human information processing capacity limitations. IEEE Journal of Selected Topics in Signal Processing 10, 5(2016), 924–931.",
      "doi": ""
    },
    {
      "text": "Emeline Brule, Gilles Bailly, Anke Brock, Frederic Valentin, Grégoire Denis, and Christophe Jouffrais. 2016. MapSense: Multi-Sensory Interactive Maps for Children Living with Visual Impairments. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 445–457. https://doi.org/10.1145/2858036.2858375",
      "doi": "10.1145/2858036.2858375"
    },
    {
      "text": "Colin Burns, Eric Dishman, William Verplank, and Bud Lassiter. 1994. Actors, hairdos & videotape—informance design. In Conference companion on Human factors in computing systems. ACM, New York, NY, USA, 119–120.",
      "doi": "10.1145/259963.260102"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory: A practical guide through qualitative analysis. Sage Publications, London, England.",
      "doi": ""
    },
    {
      "text": "Paul T Costa Jr and Robert R McCrae. 2008. The Revised NEO Personality Inventory (NEO-PI-R).Sage Publications, Inc, Los Angeles, CA.",
      "doi": ""
    },
    {
      "text": "Clare Cullen and Oussama Metatla. 2019. Co-Designing Inclusive Multisensory Story Mapping with Children with Mixed Visual Abilities. In Proceedings of the 18th ACM International Conference on Interaction Design and Children (Boise, ID, USA) (IDC ’19). Association for Computing Machinery, New York, NY, USA, 361–373. https://doi.org/10.1145/3311927.3323146",
      "doi": "10.1145/3311927.3323146"
    },
    {
      "text": "Luigi F Cuturi, Elena Aggius-Vella, Claudio Campus, Alberto Parmiggiani, and Monica Gori. 2016. From science to technology: Orientation and mobility in blind children and adults. Neuroscience & Biobehavioral Reviews 71 (2016), 240–251.",
      "doi": ""
    },
    {
      "text": "Kerstin Dautenhahn. 2003. Roles and functions of robots in human society: implications from research in autism therapy. Robotica 21, 4 (2003), 443.",
      "doi": "10.1017/S0263574703004922"
    },
    {
      "text": "Gareth Davies. 2019. Support for pupils with special educational needs and disabilities in England: report by the Comptroller and Auditor General. National Audit Office 1, 1 (2019), 1–60.",
      "doi": ""
    },
    {
      "text": "Maria Chiara Di Lieto, Emanuela Castro, Chiara Pecini, Emanuela Inguaggiato, Francesca Cecchi, Paolo Dario, Giovanni Cioni, and Giuseppina Sgandurra. 2019. Improving Executive Functions at School in Children With Special Needs by Educational Robotics. Frontiers in Psychology 10 (2019).",
      "doi": ""
    },
    {
      "text": "Julie Ducasse, Anke M Brock, and Christophe Jouffrais. 2018. Accessible interactive maps for visually impaired users. In Mobility of visually impaired people. Springer, Cham, 537–584.",
      "doi": ""
    },
    {
      "text": "Efthymia Efthymiou and Alison Kington. 2017. The development of inclusive learning relationships in mainstream settings: A multimodal perspective. Cogent Education 4, 1 (2017), 1304015.",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 1999. Basic emotions. Handbook of cognition and emotion 98, 45-60 (1999), 16.",
      "doi": ""
    },
    {
      "text": "Paul Ekman and Daniel Cordaro. 2011. What is meant by calling emotions basic. Emotion review 3, 4 (2011), 364–370.",
      "doi": ""
    },
    {
      "text": "Terrence Fong, Illah Nourbakhsh, and Kerstin Dautenhahn. 2003. A survey of socially interactive robots. Robotics and autonomous systems 42, 3-4 (2003), 143–166.",
      "doi": ""
    },
    {
      "text": "Dario Galati, Renato Miceli, and Barbara Sini. 2001. Judging and coding facial expression of emotions in congenitally blind children. International Journal of Behavioral Development 25, 3(2001), 268–278. https://doi.org/10.1080/01650250042000393",
      "doi": ""
    },
    {
      "text": "Patrick GUNKEL. 1998. Positive and negative traits. http://ideonomy.mit.edu/essays/traits.html",
      "doi": ""
    },
    {
      "text": "Patrick GUNKEL. 2013. 638 Primary Personality Traits. Ideonomy: The Science of Ideas 1, 1 (2013).",
      "doi": ""
    },
    {
      "text": "Deanna Hood, Séverin Lemaignan, and Pierre Dillenbourg. 2015. When children teach a robot to write: An autonomous teachable humanoid which uses simulated handwriting. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. Association for Computing Machinery, New York, NY, USA, 83–90.",
      "doi": "10.1145/2696454.2696479"
    },
    {
      "text": "Seray B Ibrahim, Asimina Vasalou, and Michael Clarke. 2020. Can design documentaries disrupt design for disability?. In Proceedings of the Interaction Design and Children Conference. Association for Computing Machinery, New York, NY, USA, 96–107.",
      "doi": "10.1145/3392063.3394403"
    },
    {
      "text": "iRobot. 2000. Roomba robot. https://www.irobot.com/roomba/i-series",
      "doi": ""
    },
    {
      "text": "Frank Jamet, Olivier Masson, Baptiste Jacquet, Jean-Louis Stilgenbauer, and Jean Baratgin. 2018. Learning by teaching with humanoid robot: a new powerful experimental tool to improve children’s learning ability. Journal of Robotics 2018(2018).",
      "doi": ""
    },
    {
      "text": "Wafa Johal. 2020. Research Trends in Social Robots for Learning. Current Robotics Reports June 2020 (2020), 1–9.",
      "doi": ""
    },
    {
      "text": "Hatice Köse, Pınar Uluer, Neziha Akalın, Rabia Yorgancı, Ahmet Özkul, and Gökhan Ince. 2015. The effect of embodiment in sign language tutoring with assistive humanoid robots. International Journal of Social Robotics 7, 4 (2015), 537–548.",
      "doi": ""
    },
    {
      "text": "Aditi Kulkarni, Allan Wang, Lynn Urbina, Aaron Steinfeld, and Bernardine Dias. 2016. Robotic assistance in indoor navigation for people who are blind. In 2016 11th ACM/IEEE International Conference on Human-Robot Interaction (HRI). IEEE, Association for Computing Machinery, New York, NY, USA, 461–462.",
      "doi": ""
    },
    {
      "text": "Innvo Labs. 2006. Pleo robot. https://www.pleoworld.com/pleo_rb/eng/products.php?c1id=1",
      "doi": ""
    },
    {
      "text": "Hee Rin Lee, Selma Šabanović, Wan-Ling Chang, Shinichi Nagata, Jennifer Piatt, Casey Bennett, and David Hakken. 2017. Steps toward participatory design of social robots: mutual learning with older adults with depression. In Proceedings of the 2017 ACM/IEEE international conference on human-robot interaction. Association for Computing Machinery, New York, NY, USA, 244–253.",
      "doi": "10.1145/2909824.3020237"
    },
    {
      "text": "Lego. 2013. Mindstorms robot. https://www.lego.com/en-gb/themes/mindstorms",
      "doi": ""
    },
    {
      "text": "Alexandru Litoiu and Brian Scassellati. 2015. Robotic coaching of complex physical skills. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction Extended Abstracts. Association for Computing Machinery, New York, NY, USA, 211–212.",
      "doi": "10.1145/2701973.2702726"
    },
    {
      "text": "Anne-Marie Mann, Uta Hinrichs, Janet C Read, and Aaron Quigley. 2016. Facilitator, functionary, friend or foe? Studying the role of iPads within learning activities across a school year. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1833–1845.",
      "doi": ""
    },
    {
      "text": "Laura Martinez, Virginia B Falvello, Hillel Aviezer, and Alexander Todorov. 2016. Contributions of facial expressions and body language to the rapid perception of dynamic emotions. Cognition and Emotion 30, 5 (2016), 939–952.",
      "doi": ""
    },
    {
      "text": "Samantha McDonald, Joshua Dutterer, Ali Abdolrahmani, Shaun K Kane, and Amy Hurst. 2014. Tactile aids for visually impaired graphical design education. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. Association for Computing Machinery, New York, NY, USA, 275–276.",
      "doi": "10.1145/2661334.2661392"
    },
    {
      "text": "Oussama Metatla. 2017. Uncovering challenges and opportunities of including children with visual impairments in mainstream schools. Electronic Visualisation and the Arts (EVA 2017) 1 (2017), 1–6.",
      "doi": ""
    },
    {
      "text": "Oussama Metatla, Sandra Bardot, Clare Cullen, Marcos Serrano, and Christophe Jouffrais. 2020. Robots for Inclusive Play: Co-designing an Educational Game With Visually Impaired and sighted Children. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3313831.3376270"
    },
    {
      "text": "Oussama Metatla, Nick Bryan-Kinns, Tony Stockman, and Fiore Martin. 2015. Designing with and for people living with visual impairments: audio-tactile mock-ups, audio diaries and participatory prototyping. CoDesign 11, 1 (2015), 35–48.",
      "doi": ""
    },
    {
      "text": "Oussama Metatla and Clare Cullen. 2018. “Bursting the Assistance Bubble” Designing Inclusive Technology with Children with Mixed Visual Abilities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3173574.3173920"
    },
    {
      "text": "Oussama Metatla, Alison Oldfield, Taimur Ahmed, Antonis Vafeas, and Sunny Miglani. 2019. Voice user interfaces in schools: Co-designing for inclusion with visually-impaired and sighted pupils. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3290605.3300608"
    },
    {
      "text": "Oussama Metatla, Janet C Read, and Matthew Horton. 2020. Enabling children to design for others with expanded proxy design. In Proceedings of the Interaction Design and Children Conference. Association for Computing Machinery, New York, NY, USA, 184–197.",
      "doi": "10.1145/3392063.3394431"
    },
    {
      "text": "Oussama Metatla, Marcos Serrano, Christophe Jouffrais, Anja Thieme, Shaun Kane, Stacy Branham, Émeline Brulé, and Cynthia L Bennett. 2018. Inclusive education technologies: Emerging opportunities for people with visual impairments. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–8.",
      "doi": "10.1145/3170427.3170633"
    },
    {
      "text": "Oussama Metatla, Anja Thieme, Emeline Brulé, Cynthia Bennett, Marcos Serrano, and Christophe Jouffrais. 2018. Toward classroom experiences inclusive of students with disabilities. interactions 26, 1 (2018), 40–45.",
      "doi": ""
    },
    {
      "text": "Lauren R Milne, Cynthia L Bennett, Richard E Ladner, and Shiri Azenkot. 2014. BraillePlay: educational smartphone games for blind children. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. Association for Computing Machinery, New York, NY, USA, 137–144.",
      "doi": "10.1145/2661334.2661377"
    },
    {
      "text": "Miguel Neiva. 2010. Color Identification System for colorblind people. Retrieved June 7, 2006 from http://www.coloradd.net/",
      "doi": ""
    },
    {
      "text": "Isabel Neto, Wafa Johal, Marta Couto, Hugo Nicolau, Ana Paiva, and Arzu Guneysu. 2020. Using tabletop robots to promote inclusive classroom experiences. In Proceedings of the Interaction Design and Children Conference. Association for Computing Machinery, New York, NY, USA, 281–292.",
      "doi": "10.1145/3392063.3394439"
    },
    {
      "text": "A. T. Noman, M. A. M. Chowdhury, H. Rashid, S. M. S. R. Faisal, I. U. Ahmed, and S. M. T. Reza. 2017. Design and implementation of microcontroller based assistive robot for person with blind autism and visual impairment. In 2017 20th International Conference of Computer and Information Technology (ICCIT). IEEE, Los Alamitos, CA, 1–5. https://doi.org/10.1109/ICCITECHN.2017.8281806",
      "doi": ""
    },
    {
      "text": "Mohammad Obaid, Asım Evren Yantaç, Wolmet Barendregt, Güncel Kırlangıç, and Tilbe Göksun. 2016. Robo2Box: a toolkit to elicit children’s design requirements for classroom robots. In International Conference on Social Robotics. Springer, Springer, Cham, 600–610.",
      "doi": ""
    },
    {
      "text": "Ayberk Özgür, Séverin Lemaignan, Wafa Johal, Maria Beltran, Manon Briod, Léa Pereyre, Francesco Mondada, and Pierre Dillenbourg. 2017. Cellulo: Versatile handheld robots for education. In 2017 12th ACM/IEEE International Conference on Human-Robot Interaction (HRI. IEEE, Association for Computing Machinery, New York, NY, USA, 119–127.",
      "doi": ""
    },
    {
      "text": "Beryl Plimmer, Andrew Crossan, Stephen A Brewster, and Rachel Blagojevic. 2008. Multimodal collaborative handwriting training for visually-impaired people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 393–402.",
      "doi": "10.1145/1357054.1357119"
    },
    {
      "text": "S Prasanna, N Priyadharshini, and M Arul Pugazhendhi. 2017. Textile robot for matching and pick up clothes based on color recognition. Asian Journal of Applied Science and Technology (AJAST) 1, 3(2017), 62–65.",
      "doi": ""
    },
    {
      "text": "Peter Reid and Beryl Plimmer. 2008. A Collaborative Multimodal Handwriting Training Environment for Visually Impaired Students. In Proceedings of the 20th Australasian Conference on Computer-Human Interaction: Designing for Habitus and Habitat (Cairns, Australia) (OZCHI ’08). Association for Computing Machinery, New York, NY, USA, 195–202. https://doi.org/10.1145/1517744.1517808",
      "doi": "10.1145/1517744.1517808"
    },
    {
      "text": "Philips research. 2007. iCat robot. https://www.technologyreview.com/2007/07/26/224540/an-emotional-cat-robot/",
      "doi": ""
    },
    {
      "text": "Wyca robotics. 2015. Keylo robot. https://www.wyca-robotics.com/",
      "doi": ""
    },
    {
      "text": "Kasper Rodil, Matthias Rehm, and Antonia Lina Krummheuer. 2018. Co-Designing Social Robots with Cognitively Impaired Citizens. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (Oslo, Norway) (NordiCHI ’18). Association for Computing Machinery, New York, NY, USA, 686–690. https://doi.org/10.1145/3240167.3240253",
      "doi": "10.1145/3240167.3240253"
    },
    {
      "text": "Joao Roe. 2008. Social inclusion: meeting the socio-emotional needs of children with vision needs. British Journal of Visual Impairment 26, 2 (2008), 147–158.",
      "doi": ""
    },
    {
      "text": "Nuzhah Gooda Sahib, Tony Stockman, Anastasios Tombros, and Oussama Metatla. 2013. Participatory design with blind users: a scenario-based approach. In IFIP Conference on Human-Computer Interaction. Springer, Springer, Cham, 685–701.",
      "doi": ""
    },
    {
      "text": "Brian Scassellati, Laura Boccanfuso, Chien-Ming Huang, Marilena Mademtzi, Meiying Qin, Nicole Salomons, Pamela Ventola, and Frederick Shic. 2018. Improving social skills in children with ASD using a long-term, in-home social robot. Science Robotics 3, 21 (2018).",
      "doi": ""
    },
    {
      "text": "Dennis Schleicher, Peter Jones, and Oksana Kachur. 2010. Bodystorming as embodied designing. Interactions 17, 6 (2010), 47–51.",
      "doi": "10.1145/1865245.1865256"
    },
    {
      "text": "Softbankrobotics. 2006. Nao robot. https://www.softbankrobotics.com/emea/en/nao",
      "doi": ""
    },
    {
      "text": "Sphero. 2013. Sphero robot. https://sphero.com/",
      "doi": ""
    },
    {
      "text": "Xiang Zhi Tan and Aaron Steinfeld. 2017. Using Robot Manipulation to Assist Navigation by People Who Are Blind or Low Vision. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (Vienna, Austria) (HRI ’17). Association for Computing Machinery, New York, NY, USA, 379–380. https://doi.org/10.1145/3029798.3034808",
      "doi": "10.1145/3029798.3034808"
    },
    {
      "text": "Anja Thieme, Cecily Morrison, Nicolas Villar, Martin Grayson, and Siân Lindley. 2017. Enabling Collaboration in Learning Computer Programing Inclusive of Children with Vision Impairments. In Proceedings of the 2017 Conference on Designing Interactive Systems (Edinburgh, United Kingdom) (DIS ’17). Association for Computing Machinery, New York, NY, USA, 739–752. https://doi.org/10.1145/3064663.3064689",
      "doi": "10.1145/3064663.3064689"
    },
    {
      "text": "Make Wonder. 2013. Dash robot. https://www.makewonder.com/",
      "doi": ""
    },
    {
      "text": "Sarah Woods. 2006. Exploring the design space of robots: Children’s perspectives. Interacting with Computers 18, 6 (2006), 1390–1418.",
      "doi": "10.1016/j.intcom.2006.05.001"
    },
    {
      "text": "Anon Ymous, Katta Spiel, Os Keyes, Rua M Williams, Judith Good, Eva Hornecker, and Cynthia L Bennett. 2020. ” I am just terrified of my future”—Epistemic Violence in Disability Related Technology Research. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–16.",
      "doi": ""
    }
  ]
}