{
  "doi": "10.1145/3411764.3445691",
  "title": "“It did not give me an option to decline”: A Longitudinal Analysis of the User Experience of Security and Privacy in Smart Home Products",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "Smart home products aren’t living up to their promise. They claim to transform the way we live, providing convenience, energy efficiency, and safety. However, the reality is significantly less profound and often frustrating. This is particularly apparent in security and privacy experiences: powerlessness, confusion, and annoyance have all been reported.  In order to reduce frustration and help fulfill the promise of smart homes, we need to explore the experience of security and privacy in situ. We analyze an ethnographic study observing six UK households over six months to present a longitudinal view of security and privacy user experiences in smart products. We find inconsistencies in managing security and privacy, e.g., contrasting the ease of granting and difficulty of withholding consent. We identify security and privacy issues in repurposing smart home devices – using devices outside of their initial intended purposes. We conclude with recommendations for design in smart home devices.",
  "tags": [
    "longitudinal study",
    "user experience",
    "smart home",
    "security",
    "qualitative study",
    "privacy"
  ],
  "authors": [
    {
      "name": "George Chalhoub",
      "institution": "Department of Computer Science University of Oxford, United Kingdom",
      "img": "/do/10.1145/contrib-99659526426/rel-imgonly/profile-new.jpg",
      "acmid": "99659526426",
      "orcid": "missing"
    },
    {
      "name": "Martin J Kraemer",
      "institution": "Department of Computer Science University of Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260450",
      "orcid": "missing"
    },
    {
      "name": "Norbert Nthala",
      "institution": "Media and Information Michigan State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320381",
      "orcid": "missing"
    },
    {
      "name": "Ivan Flechais",
      "institution": "Department of Computer Science University of Oxford, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280391",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Noura Abdi, Kopo M. Ramokapane, and Jose M. Such. 2019. More than Smart Speakers: Security and Privacy Perceptions of Smart Home Personal Assistants. In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019).",
      "doi": ""
    },
    {
      "text": "Muhammad Raisul Alam, Mamun Bin Ibne Reaz, and Mohd Alauddin Mohd Ali. 2012. A Review of Smart Homes—Past, Present, and Future. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews) 42, 6 (Nov. 2012), 1190–1203. https://doi.org/10.1109/TSMCC.2012.2189204",
      "doi": "10.1109/TSMCC.2012.2189204"
    },
    {
      "text": "Alaa Althubaiti. 2016. Information bias in health research: definition, pitfalls, and adjustment methods. Journal of Multidisciplinary Healthcare 9 (May 2016), 211–217. https://doi.org/10.2147/JMDH.S104807",
      "doi": ""
    },
    {
      "text": "Noah Apthorpe, Dillon Reisman, and Nick Feamster. 2017. A smart home is no castle: Privacy vulnerabilities of encrypted iot traffic. arXiv preprint arXiv:1705.06805(2017).",
      "doi": ""
    },
    {
      "text": "Noah Apthorpe, Yan Shvartzshnaider, Arunesh Mathur, Dillon Reisman, and Nick Feamster. 2018. Discovering smart home internet of things privacy norms using contextual integrity. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 2 (2018), 59.",
      "doi": "10.1145/3214262"
    },
    {
      "text": "Gaurav Bansal, Fatemeh ‘Mariam’ Zahedi, and David Gefen. 2015. The role of privacy assurance mechanisms in building trust and the moderating role of privacy concern. European Journal of Information Systems 24, 6 (2015), 624–644.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Yesterday’s tomorrows: notes on ubiquitous computing’s dominant vision. Personal and Ubiquitous Computing 11, 2 (Feb. 2007), 133–143. https://doi.org/10.1007/s00779-006-0071-x",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Victoria Bellotti and Abigail Sellen. 1993. Design for privacy in ubiquitous computing environments. In Proceedings of the third conference on European Conference on Computer-Supported Cooperative Work(ECSCW’93). Kluwer Academic Publishers, Milan, Italy, 77–92.",
      "doi": ""
    },
    {
      "text": "Asa Blomquist and Mattias Arvola. 2002. Personas in action: ethnography in an interaction design team. In Proceedings of the second Nordic conference on Human-computer interaction. 197–200.",
      "doi": "10.1145/572020.572044"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis. In APA handbook of research methods in psychology, Vol 2: Research designs: Quantitative, qualitative, neuropsychological, and biological. American Psychological Association, Washington, DC, US, 57–71. https://doi.org/10.1037/13620-004",
      "doi": ""
    },
    {
      "text": "A.J. Bernheim Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home automation in the wild: challenges and opportunities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, Vancouver, BC, Canada, 2115–2124. https://doi.org/10.1145/1978942.1979249",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Marta Cecchinato and Daniel Harrison. 2017. Degrees of Agency in Owners and Users of Home IoT Devices. In CHI’17 workshop: Making Home: Asserting Agency in the Age of IoT. Association for Computing Machinery (ACM).",
      "doi": ""
    },
    {
      "text": "George Chalhoub, Ivan Flechais, Norbert Nthala, and Ruba Abu-Salma. 2020. Innovation Inaction or In Action? The Role of User Experience in the Security and Privacy Design of Smart Home Cameras. In Sixteenth Symposium on Usable Privacy and Security (${$SOUPS$}$ 2020). 185–204.",
      "doi": ""
    },
    {
      "text": "Bradley Chambers. 2020. HomeKit Weekly: Apple should allow selective access to HomeKit devices for Family Sharing. https://9to5mac.com/2020/01/24/homekit-family-sharing/",
      "doi": ""
    },
    {
      "text": "Charlton, Alistair. 2018. Sharing your smart home with others is a minefield of inconvenience. https://www.gearbrain.com/sharing-smart-home-devices-2608366363.html",
      "doi": ""
    },
    {
      "text": "Marshini Chetty, Richard Banks, Richard Harper, Tim Regan, Abigail Sellen, Christos Gkantsidis, Thomas Karagiannis, and Peter Key. 2010. Who’s hogging the bandwidth: the consequences of revealing the invisible in the home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). Association for Computing Machinery, Atlanta, Georgia, USA, 659–668. https://doi.org/10.1145/1753326.1753423",
      "doi": "10.1145/1753326.1753423"
    },
    {
      "text": "Marshini Chetty, Ja-Young Sung, and Rebecca E. Grinter. 2007. How Smart Homes Learn: The Evolution of the Networked Home and Household. In UbiComp 2007: Ubiquitous Computing(Lecture Notes in Computer Science), John Krumm, Gregory D. Abowd, Aruna Seneviratne, and Thomas Strang (Eds.). Springer, Berlin, Heidelberg, 127–144. https://doi.org/10.1007/978-3-540-74853-3_8",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, and Julie A. Kientz. 2011. Living in a glass house: a survey of private moments in the home. In Proceedings of the 13th international conference on Ubiquitous computing(UbiComp ’11). Association for Computing Machinery, Beijing, China, 41–44. https://doi.org/10.1145/2030112.2030118",
      "doi": "10.1145/2030112.2030118"
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Jaeyeon Jung, Beverly Harrison, Shwetak N. Patel, and Julie A. Kientz. 2012. Investigating receptiveness to sensing and inference in the home using sensor proxies. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing(UbiComp ’12). Association for Computing Machinery, Pittsburgh, Pennsylvania, 61–70. https://doi.org/10.1145/2370216.2370226",
      "doi": "10.1145/2370216.2370226"
    },
    {
      "text": "K. L. Courtney. 2008. Privacy and Senior Willingness to Adopt Smart Home Information Technology in Residential Care Facilities. Methods of Information in Medicine 47, 1 (2008), 76–81. https://doi.org/10.3414/ME9104 Publisher: Schattauer GmbH.",
      "doi": ""
    },
    {
      "text": "L. Cranor, T. Rabin, V. Shmatikov, S. Vadhan, and D. Weitzner. 2015. Towards a Privacy Research Roadmap for the Computing Community: A white paper prepared for the computing community consortium committee of the computing research association. (2015).",
      "doi": ""
    },
    {
      "text": "John W. Creswell and J. David Creswell. 2017. Research design: Qualitative, quantitative, and mixed methods approaches. Sage publications.",
      "doi": ""
    },
    {
      "text": "Ry Crist. 2015. Multiple users, multiple systems, multiple devices: Is this the smart home from hell?https://www.cnet.com/news/multiple-users-multiple-systems-multiple-devices-is-this-the-smart-home-from-hell/",
      "doi": ""
    },
    {
      "text": "Alexei Czeskis, Ivayla Dermendjieva, Hussein Yapit, Alan Borning, Batya Friedman, Brian Gill, and Tadayoshi Kohno. 2010. Parenting from the pocket: value tensions and technical directions for secure and private parent-teen mobile safety. In Proceedings of the Sixth Symposium on Usable Privacy and Security(SOUPS ’10). Association for Computing Machinery, Redmond, Washington, USA, 1–15. https://doi.org/10.1145/1837110.1837130",
      "doi": "10.1145/1837110.1837130"
    },
    {
      "text": "Angela Dale, Sara Arber, and Michael Procter. 1988. Doing secondary analysis. Unwin Hyman.",
      "doi": ""
    },
    {
      "text": "Anupam Das, Joseph Bonneau, Matthew Caesar, Nikita Borisov, and XiaoFeng Wang. 2014. The tangled web of password reuse.. In NDSS, Vol. 14. 23–26.",
      "doi": ""
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Charles Yiu, John Zimmerman, and Anind K. Dey. 2006. Principles of Smart Home Control. In UbiComp 2006: Ubiquitous Computing(Lecture Notes in Computer Science), Paul Dourish and Adrian Friday (Eds.). Springer, Berlin, Heidelberg, 19–34. https://doi.org/10.1007/11853565_2",
      "doi": ""
    },
    {
      "text": "George Demiris and Brian K. Hensel. 2008. Technologies for an aging society: a systematic review of “smart home” applications. Yearb Med Inform 3(2008), 33–40.",
      "doi": ""
    },
    {
      "text": "ISO DIS. 2010. 9241-210: 2010. Ergonomics of human system interaction-Part 210: Human-centred design for interactive systems (formerly known as 13407). International Standardization Organization (ISO). Switzerland (2010).",
      "doi": ""
    },
    {
      "text": "Daniel M. Doolan and Erika S. Froelicher. 2009. Using an existing data set to answer new research questions: a methodological review. Research and Theory for Nursing Practice 23, 3 (2009), 203–215. https://doi.org/10.1891/1541-6577.23.3.203",
      "doi": ""
    },
    {
      "text": "Paul Dourish, Rebecca E. Grinter, Jessica Delgado De La Flor, and Melissa Joseph. 2004. Security in the wild: user strategies for managing security as an everyday, practical problem. Personal and Ubiquitous Computing 8, 6 (2004), 391–401.",
      "doi": ""
    },
    {
      "text": "Stuart E. Dreyfus and Hubert L. Dreyfus. 1980. A five-stage model of the mental activities involved in directed skill acquisition. Technical Report. California Univ Berkeley Operations Research Center.",
      "doi": ""
    },
    {
      "text": "Chris Duckett. 2018. Google needs to break up its all-or-nothing approach to permissions. https://www.zdnet.com/article/google-needs-to-break-up-its-all-or-nothing-approach-to-permissions/",
      "doi": ""
    },
    {
      "text": "Serge Egelman, Raghudeep Kannavara, and Richard Chow. 2015. Is This Thing On? Crowdsourcing Privacy Indicators for Ubiquitous Sensing Platforms. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, Seoul, Republic of Korea, 1669–1678. https://doi.org/10.1145/2702123.2702251",
      "doi": ""
    },
    {
      "text": "Pardis Emami-Naeini, Henry Dixon, Yuvraj Agarwal, and Lorrie Faith Cranor. 2019. Exploring How Privacy and Security Factor into IoT Device Purchase Behavior. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300764",
      "doi": "10.1145/3290605.3300764"
    },
    {
      "text": "Christine Geeng and Franziska Roesner. 2019. Who’s In Control?: Interactions In Multi-User Smart Homes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 268.",
      "doi": "10.1145/3290605.3300498"
    },
    {
      "text": "Esther Goernemann and Sarah Spiekermann. 2020. Moments of Truth with Conversational Agents: An Exploratory Quest for the Relevant Experiences of Alexa Users. ECIS 2020 Research Papers (June 2020). https://aisel.aisnet.org/ecis2020_rp/169",
      "doi": ""
    },
    {
      "text": "Rebecca E. Grinter, W. Keith Edwards, Marshini Chetty, Erika S. Poole, Ja-Young Sung, Jeonghwa Yang, Andy Crabtree, Peter Tolmie, Tom Rodden, and Chris Greenhalgh. 2009. The ins and outs of home networking: The case for useful and usable domestic networking. ACM Transactions on Computer-Human Interaction (TOCHI) 16, 2(2009), 8.",
      "doi": "10.1145/1534903.1534905"
    },
    {
      "text": "Rebecca E. Grinter, W. Keith Edwards, Mark W. Newman, and Nicolas Ducheneaut. 2005. The Work to Make a Home Network Work. In ECSCW 2005, Hans Gellersen, Kjeld Schmidt, Michel Beaudouin-Lafon, and Wendy Mackay (Eds.). Springer Netherlands, Dordrecht, 469–488. https://doi.org/10.1007/1-4020-4023-7_24",
      "doi": "10.5555/1242029.1242053"
    },
    {
      "text": "Manu Gupta, Stephen S. Intille, and Kent Larson. 2009. Adding GPS-Control to Traditional Thermostats: An Exploration of Potential Energy Savings and Design Challenges. In Pervasive Computing(Lecture Notes in Computer Science), Hideyuki Tokuda, Michael Beigl, Adrian Friday, A. J. Bernheim Brush, and Yoshito Tobe (Eds.). Springer, Berlin, Heidelberg, 95–114. https://doi.org/10.1007/978-3-642-01516-8_8",
      "doi": ""
    },
    {
      "text": "Weijia He, Maximilian Golla, Roshni Padhi, Jordan Ofek, Markus Dürmuth, Earlence Fernandes, and Blase Ur. 2018. Rethinking access control and authentication for the home internet of things (IoT). In 27th ${$USENIX$}$ Security Symposium (${$USENIX$}$ Security 18). 255–272.",
      "doi": ""
    },
    {
      "text": "Pamela S. Hinds, Ralph J. Vogel, and Laura Clarke-Steffen. 2016. The Possibilities and Pitfalls of Doing a Secondary Analysis of a Qualitative Data Set:. Qualitative Health Research (July 2016). https://doi.org/10.1177/104973239700700306 Publisher: Sage PublicationsSage CA: Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Jason I. Hong and James A. Landay. 2004. An architecture for privacy-sensitive ubiquitous computing. In Proceedings of the 2nd international conference on Mobile systems, applications, and services(MobiSys ’04). Association for Computing Machinery, Boston, MA, USA, 177–189. https://doi.org/10.1145/990064.990087",
      "doi": ""
    },
    {
      "text": "Roberto Hoyle, Robert Templeman, Steven Armes, Denise Anthony, David Crandall, and Apu Kapadia. 2014. Privacy behaviors of lifeloggers using wearable cameras. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’14). Association for Computing Machinery, Seattle, Washington, 571–582. https://doi.org/10.1145/2632048.2632079",
      "doi": "10.1145/2632048.2632079"
    },
    {
      "text": "Information Commissioner’s Office. 2020. When is consent appropriate?https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/consent/when-is-consent-appropriate/",
      "doi": ""
    },
    {
      "text": "S.S. Intille. 2002. Designing a home of the future. IEEE Pervasive Computing 1, 2 (April 2002), 76–82. https://doi.org/10.1109/MPRV.2002.1012340",
      "doi": "10.1109/MPRV.2002.1012340"
    },
    {
      "text": "Timo Jakobi, Corinna Ogonowski, Nico Castelli, Gunnar Stevens, and Volker Wulf. 2017. The Catch(es) with Smart Home: Experiences of a Living Lab Field Study. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, Denver, Colorado, USA, 1620–1633. https://doi.org/10.1145/3025453.3025799",
      "doi": "10.1145/3025453.3025799"
    },
    {
      "text": "Timo Jakobi, Gunnar Stevens, Nico Castelli, Corinna Ogonowski, Florian Schaub, Nils Vindice, Dave Randall, Peter Tolmie, and Volker Wulf. 2018. Evolving Needs in IoT Control and Accountability: A Longitudinal Study on Smart Home Intelligibility. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (Dec. 2018), 171:1–171:28. https://doi.org/10.1145/3287049",
      "doi": "10.1145/3287049"
    },
    {
      "text": "Melissa P. Johnston. 2017. Secondary data analysis: A method of which the time has come. Qualitative and quantitative methods in libraries 3, 3 (2017), 619–626.",
      "doi": ""
    },
    {
      "text": "Meg Leta Jones. 2015. Privacy Without Screens & the Internet of Other People’s Things. SSRN Scholarly Paper ID 2614066. Social Science Research Network, Rochester, NY. https://papers.ssrn.com/abstract=2614066",
      "doi": ""
    },
    {
      "text": "Cory D. Kidd, Robert Orr, Gregory D. Abowd, Christopher G. Atkeson, Irfan A. Essa, Blair MacIntyre, Elizabeth Mynatt, Thad E. Starner, and Wendy Newstetter. 1999. The Aware Home: A Living Laboratory for Ubiquitous Computing Research. In Cooperative Buildings. Integrating Information, Organizations, and Architecture(Lecture Notes in Computer Science), Norbert A. Streitz, Jane Siegel, Volker Hartkopf, and Shin’ichi Konomi (Eds.). Springer, Berlin, Heidelberg, 191–198. https://doi.org/10.1007/10705432_17",
      "doi": ""
    },
    {
      "text": "Tiiu Koskela and Kaisa Väänänen-Vainio-Mattila. 2004. Evolution towards smart home environments: empirical evaluation of three user interfaces. Personal and Ubiquitous Computing 8, 3 (July 2004), 234–240. https://doi.org/10.1007/s00779-004-0283-x",
      "doi": "10.1007/s00779-004-0283-x"
    },
    {
      "text": "Robert V. Labaree. 2009. Research Guides: Organizing Your Social Sciences Research Paper: 5. The Literature Review. (2009).",
      "doi": ""
    },
    {
      "text": "Roxanne Leitão. 2019. Anticipating Smart Home Security and Privacy Threats with Survivors of Intimate Partner Abuse. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). Association for Computing Machinery, New York, NY, USA, 527–539. https://doi.org/10.1145/3322276.3322366",
      "doi": "10.1145/3322276.3322366"
    },
    {
      "text": "Brian Y. Lim, Anind K. Dey, and Daniel Avrahami. 2009. Why and why not explanations improve the intelligibility of context-aware intelligent systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’09). Association for Computing Machinery, Boston, MA, USA, 2119–2128. https://doi.org/10.1145/1518701.1519023",
      "doi": "10.1145/1518701.1519023"
    },
    {
      "text": "Nathan Malkin, Joe Deatrick, Allen Tong, Primal Wijesekera, Serge Egelman, and David Wagner. 2019. Privacy Attitudes of Smart Speaker Users. Proceedings on Privacy Enhancing Technologies 2019, 4(2019), 250–271.",
      "doi": ""
    },
    {
      "text": "Shrirang Mare, Logan Girvin, Franziska Roesner, and Tadayoshi Kohno. 2019. Consumer Smart Homes: Where We Are and Where We Need to Go. In Proceedings of the 20th International Workshop on Mobile Computing Systems and Applications(HotMobile ’19). Association for Computing Machinery, Santa Cruz, CA, USA, 117–122. https://doi.org/10.1145/3301293.3302371",
      "doi": "10.1145/3301293.3302371"
    },
    {
      "text": "Michelle L. Mazurek, J. P. Arsenault, Joanna Bresee, Nitin Gupta, Iulia Ion, Christina Johns, Daniel Lee, Yuan Liang, Jenny Olsen, Brandon Salmon, Richard Shay, Kami Vaniea, Lujo Bauer, Lorrie Faith Cranor, Gregory R. Ganger, and Michael K. Reiter. 2010. Access Control for Home Data Sharing: Attitudes, Needs and Practices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). Association for Computing Machinery, Atlanta, Georgia, USA, 645–654. https://doi.org/10.1145/1753326.1753421",
      "doi": "10.1145/1753326.1753421"
    },
    {
      "text": "Michelle L. Mazurek, Peter F. Klemperer, Richard Shay, Hassan Takabi, Lujo Bauer, and Lorrie Faith Cranor. 2011. Exploring reactive access control. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, Vancouver, BC, Canada, 2085–2094. https://doi.org/10.1145/1978942.1979245",
      "doi": "10.1145/1978942.1979245"
    },
    {
      "text": "Mary L. McHugh. 2012. Interrater reliability: the kappa statistic. Biochemia medica: Biochemia medica 22, 3 (2012), 276–282. Publisher: Medicinska naklada.",
      "doi": ""
    },
    {
      "text": "Sarah Mennicken and Elaine M. Huang. 2012. Hacking the Natural Habitat: An In-the-Wild Study of Smart Homes, Their Development, and the People Who Live in Them. In Pervasive Computing(Lecture Notes in Computer Science), Judy Kay, Paul Lukowicz, Hideyuki Tokuda, Patrick Olivier, and Antonio Krüger(Eds.). Springer, Berlin, Heidelberg, 143–160. https://doi.org/10.1007/978-3-642-31205-2_10",
      "doi": ""
    },
    {
      "text": "Pardis Emami Naeini, Sruti Bhagavatula, Hana Habib, Martin Degeling, Lujo Bauer, Lorrie Faith Cranor, and Norman Sadeh. 2017. Privacy expectations and preferences in an IoT world. In Thirteenth Symposium on Usable Privacy and Security (${$SOUPS$}$ 2017). 399–412.",
      "doi": ""
    },
    {
      "text": "David H. Nguyen, Alfred Kobsa, and Gillian R. Hayes. 2008. An empirical investigation of concerns of everyday tracking and recording technologies. In Proceedings of the 10th international conference on Ubiquitous computing. Association for Computing Machinery, New York, NY, USA, 182–191. https://doi.org/10.1145/1409635.1409661",
      "doi": "10.1145/1409635.1409661"
    },
    {
      "text": "Norbert Nthala and Ivan Flechais. 2018. Informal support networks: an investigation into home data security practices. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). 63–82.",
      "doi": ""
    },
    {
      "text": "Norbert Nthala and Emilee Rader. 2020. Towards a Conceptual Model for Provoking Privacy Speculation. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3334480.3382815",
      "doi": "10.1145/3334480.3382815"
    },
    {
      "text": "Antti Oulasvirta, Aurora Pihlajamaa, Jukka Perkiö, Debarshi Ray, Taneli Vähäkangas, Tero Hasu, Niklas Vainio, and Petri Myllymäki. 2012. Long-term effects of ubiquitous surveillance in the home. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing(UbiComp ’12). Association for Computing Machinery, Pittsburgh, Pennsylvania, 41–50. https://doi.org/10.1145/2370216.2370224",
      "doi": "10.1145/2370216.2370224"
    },
    {
      "text": "Leysia Palen and Paul Dourish. 2003. Unpacking ”privacy” for a networked world. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’03). Association for Computing Machinery, Ft. Lauderdale, Florida, USA, 129–136. https://doi.org/10.1145/642611.642635",
      "doi": "10.1145/642611.642635"
    },
    {
      "text": "Erika Shehan Poole, Marshini Chetty, Rebecca E. Grinter, and W. Keith Edwards. 2008. More than meets the eye: transforming the user experience of home network management. In Proceedings of the 7th ACM conference on Designing interactive systems(DIS ’08). Association for Computing Machinery, Cape Town, South Africa, 455–464. https://doi.org/10.1145/1394445.1394494",
      "doi": "10.1145/1394445.1394494"
    },
    {
      "text": "Dave Randall. 2003. Living Inside a Smart Home: A Case Study. In Inside the Smart Home, Richard Harper (Ed.). Springer, London, 227–246. https://doi.org/10.1007/1-85233-854-7_12",
      "doi": ""
    },
    {
      "text": "John P. Robinson, Phillip R. Shaver, and Lawrence S. Wrightsman. 2013. Measures of personality and social psychological attitudes: Measures of social psychological attitudes. Vol. 1. Academic Press.",
      "doi": ""
    },
    {
      "text": "Eyal Ronen and Adi Shamir. 2016. Extended Functionality Attacks on IoT Devices: The Case of Smart Lights. In 2016 IEEE European Symposium on Security and Privacy (EuroS P). 3–12. https://doi.org/10.1109/EuroSP.2016.13",
      "doi": ""
    },
    {
      "text": "Erika Shehan and W. Keith Edwards. 2007. Home networking and HCI: what hath god wrought?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). Association for Computing Machinery, San Jose, California, USA, 547–556. https://doi.org/10.1145/1240624.1240712",
      "doi": "10.1145/1240624.1240712"
    },
    {
      "text": "Dale Smith. 2020. Fix 3 common Google Home music glitches before they happen. https://www.cnet.com/how-to/fix-3-common-google-home-music-glitches-before-they-happen/",
      "doi": ""
    },
    {
      "text": "Daniel J. Solove. 2008. Understanding privacy. (2008).",
      "doi": ""
    },
    {
      "text": "Ashkan Soltani. 2019. Abusability testing: Considering the ways your technology might be used for harm. In Enigma 2019 (Enigma 2019).",
      "doi": ""
    },
    {
      "text": "David W. Stewart, David W. Stewart, and Michael A. Kamins. 1993. Secondary research: Information sources and methods. Vol. 4. Sage.",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Suter. 2000. Focus groups in ethnography of communication: Expanding topics of inquiry beyond participant observation. The Qualitative Report 5, 1 (2000), 1–14.",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, Chris Greenhalgh, and Steve Benford. 2007. Making the home network at home: Digital housekeeping. In ECSCW 2007, Liam J. Bannon, Ina Wagner, Carl Gutwin, Richard H. R. Harper, and Kjeld Schmidt (Eds.). Springer, London, 331–350. https://doi.org/10.1007/978-1-84800-031-5_18",
      "doi": ""
    },
    {
      "text": "Daphne Townsend, Frank Knoefel, and Rafik Goubran. 2011. Privacy versus autonomy: A tradeoff model for smart home monitoring technologies. In 2011 Annual International Conference of the IEEE Engineering in Medicine and Biology Society. 4749–4752. https://doi.org/10.1109/IEMBS.2011.6091176 ISSN: 1558-4615.",
      "doi": ""
    },
    {
      "text": "Alexander Tsesis. 2014. The right to erasure: Privacy, data brokers, and the indefinite retention of data. Wake Forest L. Rev. 49(2014), 433. Publisher: HeinOnline.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Jaeyeon Jung, and Stuart Schechter. 2013. The current state of access control for smart devices in homes. In Workshop on Home Usable Privacy and Security (HUPS), Vol. 29. HUPS 2014, 209–218.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Jaeyeon Jung, and Stuart Schechter. 2014. Intruders versus intrusiveness: teens’ and parents’ perspectives on home-entryway surveillance. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 129–139.",
      "doi": "10.1145/2632048.2632107"
    },
    {
      "text": "Mojtaba Vaismoradi, Hannele Turunen, and Terese Bondas. 2013. Content analysis and thematic analysis: Implications for conducting a qualitative descriptive study. Nursing & Health Sciences 15, 3 (2013), 398–405. https://doi.org/10.1111/nhs.12048 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/nhs.12048.",
      "doi": ""
    },
    {
      "text": "Rick Wash and Emilee Rader. 2015. Too much knowledge? security beliefs and protective behaviors among united states internet users. In Eleventh Symposium On Usable Privacy and Security (${$SOUPS$}$ 2015). 309–325.",
      "doi": ""
    },
    {
      "text": "Meredydd Williams, Jason RC Nurse, and Sadie Creese. 2017. Privacy is the boring bit: user perceptions and behaviour in the Internet-of-Things. In 2017 15th Annual Conference on Privacy, Security and Trust (PST). IEEE, 181–18109.",
      "doi": ""
    },
    {
      "text": "Charlie Wilson, Tom Hargreaves, and Richard Hauxwell-Baldwin. 2015. Smart homes and their users: a systematic analysis and key challenges. Personal and Ubiquitous Computing 19, 2 (2015), 463–476.",
      "doi": "10.1007/s00779-014-0813-0"
    },
    {
      "text": "Charlie Wilson, Tom Hargreaves, and Richard Hauxwell-Baldwin. 2017. Benefits and risks of smart home technologies. Energy Policy 103(2017), 72–83.",
      "doi": ""
    },
    {
      "text": "Jong-bum Woo and Youn-kyung Lim. 2015. User experience in do-it-yourself-style smart homes. In Proceedings of the 2015 ACM international joint conference on pervasive and ubiquitous computing. ACM, 779–790.",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Sally Augustin, and Brooke Foucault. 2007. Sabbath day home automation: ”it’s like mixing technology and religion”. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). Association for Computing Machinery, San Jose, California, USA, 527–536. https://doi.org/10.1145/1240624.1240710",
      "doi": "10.1145/1240624.1240710"
    },
    {
      "text": "Rayoung Yang and Mark W. Newman. 2013. Learning from a learning thermostat: lessons for intelligent systems for the home. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing(UbiComp ’13). Association for Computing Machinery, Zurich, Switzerland, 93–102. https://doi.org/10.1145/2493432.2493489",
      "doi": "10.1145/2493432.2493489"
    },
    {
      "text": "Robert K. Yin. 2015. Qualitative research from start to finish. Guilford publications.",
      "doi": ""
    },
    {
      "text": "Eric Zeng, Shrirang Mare, and Franziska Roesner. 2017. End user security and privacy concerns with smart homes. In Thirteenth Symposium on Usable Privacy and Security (SOUPS 2017). 65–80.",
      "doi": ""
    },
    {
      "text": "Eric Zeng and Franziska Roesner. 2019. Understanding and improving security and privacy in multi-user smart homes: a design exploration and in-home user study. In 28th USENIX Security Symposium (USENIX Security 19). 159–176.",
      "doi": ""
    },
    {
      "text": "Serena Zheng, Noah Apthorpe, Marshini Chetty, and Nick Feamster. 2018. User perceptions of smart home IoT privacy. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 200.",
      "doi": "10.1145/3274469"
    }
  ]
}