{
  "doi": "10.1145/3411764.3445098",
  "title": "A Design Space Exploration of Worlds in Miniature",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Worlds-in-Miniature (WiMs) are interactive worlds within a world and combine the advantages of an input space, a cartographic map, and an overview+detail interface. They have been used across the extended virtuality spectrum for a variety of applications. Building on an analysis of examples of WiMs from the research literature we contribute a design space for WiMs based on seven design dimensions. Further, we expand upon existing definitions of WiMs to provide a definition that applies across the extended reality spectrum. We identify the design dimensions of size-scope-scale, abstraction, geometry, reference frame, links, multiples, and virtuality. Using our framework we describe existing Worlds-in-Miniature from the research literature and reveal unexplored research areas. Finally, we generate new examples of WiMs using our framework to fill some of these gaps. With our findings, we identify opportunities that can guide future research into WiMs.",
  "tags": [
    "Meta-Analysis/Literature Survey",
    "Virtual/Augmented Reality"
  ],
  "authors": [
    {
      "name": "Kurtis Danyluk",
      "institution": "University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260628",
      "orcid": "missing"
    },
    {
      "name": "Barrett Ens",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81488672423/rel-imgonly/hci_holiday_lunch_2013_5.jpg",
      "acmid": "81488672423",
      "orcid": "0000-0001-6695-4809"
    },
    {
      "name": "Bernhard Jenny",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597718",
      "orcid": "0000-0001-6101-6100"
    },
    {
      "name": "Wesley Willett",
      "institution": "University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350572817",
      "orcid": "0000-0002-6793-3062"
    }
  ],
  "references": [
    {
      "text": "C. Andújar, P. Vázquez, and M. Fairén. 2004. Way-Finder: guided tours through complex walkthrough models. Computer Graphics Forum 23, 3 (2004), 499–508. https://doi.org/10.1111/j.1467-8659.2004.00781.x _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1467-8659.2004.00781.x.",
      "doi": ""
    },
    {
      "text": "Michel Beaudouin-Lafon. 2004. Designing interaction, not interfaces. In Proceedings of the working conference on Advanced visual interfaces(AVI ’04). Association for Computing Machinery, New York, NY, USA, 15–22. https://doi.org/10.1145/989863.989865",
      "doi": "10.1145/989863.989865"
    },
    {
      "text": "Benjamin B. Bederson. 2000. Fisheye Menus. Association for Computing Machinery, San Diego, CA, USA. 217–225 pages.",
      "doi": ""
    },
    {
      "text": "Blaine Bell, Tobias Höllerer, and Steven Feiner. 2002. An annotated situation-awareness aid for augmented reality. In Proceedings of the 15th annual ACM symposium on User interface software and technology - UIST ’02. ACM Press, New York, New York, USA, 213–216. https://doi.org/10.1145/571985.572017",
      "doi": "10.1145/571985.572017"
    },
    {
      "text": "Andrew Bluff and Andrew Johnston. 2019. Don’t Panic: Recursive Interactions in a Miniature Metaworld. In The 17th International Conference on Virtual-Reality Continuum and its Applications in Industry. ACM, Brisbane QLD Australia, 1–9. https://doi.org/10.1145/3359997.3365682",
      "doi": "10.1145/3359997.3365682"
    },
    {
      "text": "Andrea Bonsch, Sebastian Freitag, and Torsten W. Kuhlen. 2016. Automatic generation of world in miniatures for realistic architectural immersive virtual environments. In 2016 IEEE Virtual Reality (VR). IEEE, Greenville, SC, USA, 155–156. https://doi.org/10.1109/VR.2016.7504700 ISSN: 2375-5334.",
      "doi": ""
    },
    {
      "text": "Gerd Bruder, Frank Steinicke, and Klaus H. Hinrichs. 2009. Arch-Explore: A natural user interface for immersive architectural walkthroughs. In 2009 IEEE Symposium on 3D User Interfaces. IEEE, Lafayette, Louisiana, US, 75–82. https://doi.org/10.1109/3DUI.2009.4811208",
      "doi": "10.1109/3DUI.2009.4811208"
    },
    {
      "text": "Xiang ’Anthony’ Chen, Nicolai Marquardt, Anthony Tang, Sebastian Boring, and Saul Greenberg. 2012. Extending a mobile device’s interaction space through body-centric interaction. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services(MobileHCI ’12). Association for Computing Machinery, New York, NY, USA, 151–160. https://doi.org/10.1145/2371574.2371599",
      "doi": "10.1145/2371574.2371599"
    },
    {
      "text": "L. Chittaro, V.K. Gatla, and S. Venkataraman. 2005. The Interactive 3D BreakAway Map: a navigation and examination aid for multi-floor 3D worlds. In 2005 International Conference on Cyberworlds (CW’05). IEEE, Singapore, Singapore, 8 pp.–66. https://doi.org/10.1109/CW.2005.88",
      "doi": "10.1109/CW.2005.88"
    },
    {
      "text": "Andy Cockburn, Amy Karlson, and Benjamin B. Bederson. 2008. A review of overview+detail, zooming, and focus+context interfaces. Comput. Surveys 41, 1 (Dec. 2008), 1–31. https://doi.org/10.1145/1456650.1456652",
      "doi": "10.1145/1456650.1456652"
    },
    {
      "text": "Dane Coffey, Nicholas Malbraaten, Trung Le, Iman Borazjani, Fotis Sotiropoulos, and Daniel F. Keefe. 2011. Slice WIM: a multi-surface, multi-touch interface for overview+detail exploration of volume datasets in virtual reality. In Symposium on Interactive 3D Graphics and Games(I3D ’11). Association for Computing Machinery, New York, NY, USA, 191–198. https://doi.org/10.1145/1944745.1944777",
      "doi": "10.1145/1944745.1944777"
    },
    {
      "text": "Dane Coffey, Nicholas Malbraaten, Trung Bao Le, Iman Borazjani, Fotis Sotiropoulos, Arthur G. Erdman, and Daniel F. Keefe. 2011. Interactive Slice WIM: Navigating and Interrogating Volume Data Sets Using a Multisurface, Multitouch VR Interface. IEEE Transactions on Visualization and Computer Graphics 18, 10 (Oct. 2011), 1614–1626. https://doi.org/10.1109/TVCG.2011.283",
      "doi": ""
    },
    {
      "text": "Kody R. Dillman, Terrance Tin Hoi Mok, Anthony Tang, Lora Oehlberg, and Alex Mitchell. 2018. A Visual Interaction Cue Framework from Video Game Environments for Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173714",
      "doi": "10.1145/3173574.3173714"
    },
    {
      "text": "T Todd Elvins, David R Nadeau, Rina Schul, and David Kirsh. 1998. Worldlets: 3D thumbnails for 3D browsing. In Proceedings of the SIGCHI Conference on Human Factors in Computing systems. Association for Computing Machinery, Los Angeles, CA, USA, 163–170.",
      "doi": "10.1145/274644.274669"
    },
    {
      "text": "Stef van den Elzen and Jarke J. van Wijk. 2013. Small Multiples, Large Singles: A New Approach for Visual Data Exploration. Computer Graphics Forum 32, 3pt2 (2013), 191–200. https://doi.org/10.1111/cgf.12106 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.12106.",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Juan David Hincapié-Ramos, and Pourang Irani. 2014. Ethereal planes: a design framework for 2D information space in 3D mixed reality environments. In Proceedings of the 2nd ACM symposium on Spatial user interaction(SUI ’14). Association for Computing Machinery, New York, NY, USA, 2–12. https://doi.org/10.1145/2659766.2659769",
      "doi": "10.1145/2659766.2659769"
    },
    {
      "text": "Shinji Fukatsu, Yoshifumi Kitamura, Toshihiro Masaki, and Fumio Kishino. 1998. Intuitive Control of Bird’s Eye Overview Images for Navigation in an Enormous Virtual Environment. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology(VRST ’98). ACM, New York, NY, USA, 67–76. https://doi.org/10.1145/293701.293710",
      "doi": "10.1145/293701.293710"
    },
    {
      "text": "Nicolás F. Gazcón, Juan M. Trippel Nagel, Ernesto A. Bjerg, and Silvia M. Castro. 2018. Fieldwork in Geosciences assisted by ARGeo: A mobile Augmented Reality system. Computers & Geosciences 121 (Dec. 2018), 30–38. https://doi.org/10.1016/j.cageo.2018.09.004",
      "doi": ""
    },
    {
      "text": "Floraine Grabler, Maneesh Agrawala, Robert W. Sumner, and Mark Pauly. 2008. Automatic generation of tourist maps. ACM Transactions on Graphics 27, 3 (Aug. 2008), 1–11. https://doi.org/10.1145/1360612.1360699",
      "doi": "10.1145/1360612.1360699"
    },
    {
      "text": "Carmen Hull and Wesley Willett. 2017. Building with Data: Architectural Models as Inspiration for Data Physicalization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 1217–1264. https://doi.org/10.1145/3025453.3025850",
      "doi": "10.1145/3025453.3025850"
    },
    {
      "text": "Tobias Höllerer, Steven Feiner, Drexel Hallaway, Blaine Bell, Marco Lanzagorta, Dennis Brown, Simon Julier, Yohan Baillot, and Lawrence Rosenblum. 2001. User interface management techniques for collaborative mobile augmented reality. Computers & Graphics 25, 5 (Oct. 2001), 799–810. https://doi.org/10.1016/S0097-8493(01)00122-4",
      "doi": ""
    },
    {
      "text": "M. Kalkusch, T. Lidy, N. Knapp, G. Reitmayr, H. Kaufmann, and D. Schmalstieg. 2002. Structured visual markers for indoor pathfinding. In The First IEEE International Workshop Agumented Reality Toolkit,. IEEE, Darmstadt, Germany, Germany, 8 pp.–. https://doi.org/10.1109/ART.2002.1107018",
      "doi": ""
    },
    {
      "text": "Dominik P. Käser, Evan Parker, Adam Glazier, Mike Podwal, Matt Seegmiller, Chun-Po Wang, Per Karlsson, Nadav Ashkenazi, Joanna Kim, Andre Le, Matthias Bühlmann, and Joshua Moshier. 2017. The Making of Google Earth VR. In ACM SIGGRAPH 2017 Talks (Los Angeles, California) (SIGGRAPH ’17). Association for Computing Machinery, New York, NY, USA, Article 63, 2 pages. https://doi.org/10.1145/3084363.3085094",
      "doi": ""
    },
    {
      "text": "Joseph J. LaViola, Daniel Acevedo Feliz, Daniel F. Keefe, and Robert C. Zeleznik. 2001. Hands-free multi-scale navigation in virtual environments. In Proceedings of the 2001 symposium on Interactive 3D graphics(I3D ’01). Association for Computing Machinery, New York, NY, USA, 9–15. https://doi.org/10.1145/364338.364339",
      "doi": "10.1145/364338.364339"
    },
    {
      "text": "Nico Li, Wesley Willett, Ehud Sharlin, and Mario Costa Sousa. 2017. Visibility perception and dynamic viewsheds for topographic maps and models. In Proceedings of the 5th Symposium on Spatial User Interaction - SUI ’17. ACM Press, Brighton, United Kingdom, United Kingdom, 39–47. https://doi.org/10.1145/3131277.3132178",
      "doi": "10.1145/3131277.3132178"
    },
    {
      "text": "Yinggang Li, Chi-wing Fu, and Andrew Hanson. 2006. Scalable WIM: Effective Exploration in Large-scale Astrophysical Environments. IEEE Transactions on Visualization and Computer Graphics 12, 5 (Sept. 2006), 1005–1012. https://doi.org/10.1109/TVCG.2006.176 Conference Name: IEEE Transactions on Visualization and Computer Graphics.",
      "doi": "10.1109/TVCG.2006.176"
    },
    {
      "text": "Steve Manson. 2017. Mapping, Society, and Technology. University of Minnesota Libraries Publishing, Minneapolis ,Minnesota, USA. https://open.umn.edu/opentextbooks/textbooks/mapping-society-and-technology",
      "doi": ""
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. A Taxonomy of Mixed Reality Visual Displays. IEICE Trans. Information Systems vol. E77-D, no. 12 (1994), 1321–1329.",
      "doi": ""
    },
    {
      "text": "Alessandro Mulloni, Hartmut Seichter, and Dieter Schmalstieg. 2012. Indoor navigation with mixed reality world-in-miniature views and sparse localization on mobile devices. In Proceedings of the International Working Conference on Advanced Visual Interfaces(AVI ’12). Association for Computing Machinery, New York, NY, USA, 212–215. https://doi.org/10.1145/2254556.2254595",
      "doi": "10.1145/2254556.2254595"
    },
    {
      "text": "Jung Who Nam, Krista McCullough, Joshua Tveite, Maria Molina Espinosa, Charles H. Perry, Barry T. Wilson, and Daniel F. Keefe. 2019. Worlds-in-Wedges: Combining Worlds-in-Miniature and Portals to Support Comparative Immersive Visualization of Forestry Data. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, Osaka, Japan, 747–755. https://doi.org/10.1109/VR.2019.8797871 ISSN: 2642-5254.",
      "doi": ""
    },
    {
      "text": "Christopher Niederauer, Mike Houston, Maneesh Agrawala, and Greg Humphreys. 2003. Non-invasive interactive visualization of dynamic architectural environments. In Proceedings of the 2003 symposium on Interactive 3D graphics(I3D ’03). Association for Computing Machinery, New York, NY, USA, 55–58. https://doi.org/10.1145/641480.641493",
      "doi": "10.1145/641480.641493"
    },
    {
      "text": "Sebastian Pasewaldt, Amir Semmo, Matthias Trapp, and Jürgen Döllner. 2014. Multi-perspective 3D panoramas. International Journal of Geographical Information Science 28, 10(2014), 2030–2051. https://doi.org/10.1080/13658816.2014.922686 Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/13658816.2014.922686.",
      "doi": "10.1080/13658816.2014.922686"
    },
    {
      "text": "Sebastian Pasewaldt, Matthias Trapp, and Jürgen Döllner. 2011. Multiscale visualization of 3D geovirtual environments using view-dependent multi-perspective views. Journal of WSCG 19(2011), 111–118. http://dspace5.zcu.cz/handle/11025/1245 Accepted: 2013-02-13T13:26:25Z Publisher: Václav Skala - UNION Agency.",
      "doi": ""
    },
    {
      "text": "Randy Pausch, Tommy Burnette, Dan Brockway, and Michael E Weiblen. 1995. Navigation and Locomotion in Virtual Worlds via Flight into Hand-held Miniatures. In Proceedings of the 22Nd Annual Conference on Computer Graphics and Interactive Techniques(SIGGRAPH ’95). ACM, 399–400. https://doi.org/10.1145/218380.218495",
      "doi": "10.1145/218380.218495"
    },
    {
      "text": "C. Plaisant, D. Carr, and B. Shneiderman. 1995. Image-browser taxonomy and guidelines for designers. IEEE Software 12, 2 (March 1995), 21–32. https://doi.org/10.1109/52.368260 Conference Name: IEEE Software.",
      "doi": "10.1109/52.368260"
    },
    {
      "text": "M. E. Portman, A. Natapov, and D. Fisher-Gewirtzman. 2015. To go where no man has gone before: Virtual reality in architecture, landscape architecture and environmental planning. Computers, Environment and Urban Systems 54 (Nov. 2015), 376–384. https://doi.org/10.1016/j.compenvurbsys.2015.05.001",
      "doi": ""
    },
    {
      "text": "Blaine A. Price, Ronald M. Baecker, and Ian S. Small. 1993. A Principled Taxonomy of Software Visualization. Journal of Visual Languages & Computing 4, 3 (Sept. 1993), 211–266. https://doi.org/10.1006/jvlc.1993.1015",
      "doi": ""
    },
    {
      "text": "Tom Ritchey. 1998. General morphological analysis. In 16th euro conference on operational analysis, Vol. 41.",
      "doi": ""
    },
    {
      "text": "Jonathan C Roberts. 2007. State of the art: Coordinated & multiple views in exploratory visualization. In Fifth International Conference on Coordinated and Multiple Views in Exploratory Visualization (CMV 2007). IEEE, 61–71. https://doi.org/10.1109/CMV.2007.20",
      "doi": "10.1109/CMV.2007.20"
    },
    {
      "text": "Dong Woo Seo, Hyun Kim, Jae Sung Kim, and Jae Yeol Lee. 2016. Hybrid reality-based user experience and evaluation of a context-aware smart home. Computers in Industry 76 (Feb. 2016), 11–23. https://doi.org/10.1016/j.compind.2015.11.003",
      "doi": ""
    },
    {
      "text": "K Stuart Shea and Robert B McMaster. 1989. Cartographic generalization in a digital environment: When and how to generalize. In Proceedings Auto-Carto 9. Citeseer.",
      "doi": ""
    },
    {
      "text": "Seung Youb Ssin, James A. Walsh, Ross T. Smith, Andrew Cunningham, and Bruce H. Thomas. 2019. GeoGate: Correlating Geo-Temporal Datasets Using an Augmented Reality Space-Time Cube and Tangible Interactions. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 210–219. https://doi.org/10.1109/VR.2019.8797812 ISSN: 2642-5254.",
      "doi": ""
    },
    {
      "text": "Aaron Stafford, Wayne Piekarski, and Bruce H. Thomas. 2006. Implementation of god-like interaction techniques for supporting collaboration between outdoor AR and indoor tabletop users. In 2006 IEEE/ACM International Symposium on Mixed and Augmented Reality. IEEE, 165–172. https://doi.org/10.1109/ISMAR.2006.297809",
      "doi": "10.1109/ISMAR.2006.297809"
    },
    {
      "text": "Richard Stoakley, Matthew J Conway, and Randy Pausch. 1995. Virtual Reality on a WIM: Interactive Worlds in Miniature. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’95). ACM Press/Addison-Wesley Publishing Co., New York, NY, USA, 265–272. https://doi.org/10.1145/223904.223938",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Markus Tatzgern, Raphael Grasset, Eduardo Veas, Denis Kalkofen, Hartmut Seichter, and Dieter Schmalstieg. 2015. Exploring real world points of interest: Design and evaluation of object-centric exploration techniques for augmented reality. Pervasive and Mobile Computing 18 (April 2015), 55–70. https://doi.org/10.1016/j.pmcj.2014.08.010",
      "doi": ""
    },
    {
      "text": "Drey Tobias. 2018. Data Visualisation using Augmented Reality with a Focus set on Head Mounted Displays and Collaborative Tasks. International Symposium on NDT in Aerospace 10 (2018), 1–9.",
      "doi": ""
    },
    {
      "text": "Ramón Trueba, Carlos Andujar, and Ferran Argelaguet. 2009. Complexity and Occlusion Management for the World-in-Miniature Metaphor. In Smart Graphics, Andreas Butz, Brian Fisher, Marc Christie, Antonio Krüger, Patrick Olivier, and Roberto Therón (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 155–166.",
      "doi": ""
    },
    {
      "text": "Eduardo Veas, Raphael Grasset, Ernst Kruijff, and Dieter Schmalstieg. 2012. Extended Overview Techniques for Outdoor Augmented Reality. IEEE Transactions on Visualization and Computer Graphics 18, 4 (April 2012), 565–572. https://doi.org/10.1109/TVCG.2012.44 Conference Name: IEEE Transactions on Visualization and Computer Graphics.",
      "doi": "10.1109/TVCG.2012.44"
    },
    {
      "text": "C A Wingrave, Y Haciahmetoglu, and D A Bowman. 2006. Overcoming World in Miniature Limitations by a Scaled and Scrolling WIM. In 3D User Interfaces, 2006. 3DUI 2006. IEEE Symposium on, Vol. 2006. IEEE, 11–16.",
      "doi": ""
    }
  ]
}