{
  "doi": "10.1145/3411764.3445690",
  "title": "AccessibleCircuits: Adaptive Add-On Circuit Components for People with Blindness or Low Vision",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "In this paper, we propose the designs for low cost and 3D-printable add-on components to adapt existing breadboards, circuit components and electronics tools for blind or low vision (BLV) users. Through an initial user study, we identified several barriers to entry for beginners with BLV in electronics and circuit prototyping. These barriers guided the design and development of our add-on components. We focused on developing adaptations that provide additional information about the specific component pins and breadboard holes, modify tools to make them easier to use for users with BLV, and expand non-visual feedback (e.g., audio, tactile) for tasks that require vision. Through a second user study, we demonstrated that our adaptations can effectively overcome the accessibility barriers in breadboard circuit prototyping for users with BLV.",
  "tags": [
    "Accessibility",
    "Education Tools",
    "Circuit Prototyping",
    "Tangible User Interfaces",
    "Universal Design"
  ],
  "authors": [
    {
      "name": "Ruei-Che Chang",
      "institution": "Computer Science Dartmouth College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475234",
      "orcid": "0000-0001-7545-4136"
    },
    {
      "name": "Wen-Ping Wang",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659512739",
      "orcid": "missing"
    },
    {
      "name": "Chi-Huan Chiang",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659314508",
      "orcid": "missing"
    },
    {
      "name": "Te-Yen Wu",
      "institution": "Computer Science Dartmouth College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658755390",
      "orcid": "missing"
    },
    {
      "name": "Zheer Xu",
      "institution": "Department of Computer Science Dartmouth College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260507",
      "orcid": "missing"
    },
    {
      "name": "Justin Luo",
      "institution": "Department of Computer Science Dartmouth College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701460",
      "orcid": "missing"
    },
    {
      "name": "Bing-Yu Chen",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-81100108039/rel-imgonly/rchen.jpg",
      "acmid": "81100108039",
      "orcid": "0000-0003-0169-7682"
    },
    {
      "name": "Xing-Dong Yang",
      "institution": "Department of Computer Science Dartmouth College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311481651",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2017. Digilent Electronics Explorer. https://store.digilentinc.com/electronics-explorer-all-in-one-usb-oscilloscope-multimeter-workstation/",
      "doi": ""
    },
    {
      "text": "2019. Fritzing Project. https://fritzing.org/projects/",
      "doi": ""
    },
    {
      "text": "2020. Arduino. http://arduino.cc.",
      "doi": ""
    },
    {
      "text": "2020. Smith-Kettlewell Technical File. https://www.ski.org/smith-kettlewell-technical-file",
      "doi": ""
    },
    {
      "text": "2020. Web Content Accessibility Guidelines. https://www.w3.org/WAI/fundamentals/accessibility-principles/",
      "doi": ""
    },
    {
      "text": "Sep 2020. Marburg Large Braille Font Standard. https://www.pharmabraille.com/pharmaceutical-braille/marburg-medium-font-standard/",
      "doi": ""
    },
    {
      "text": "Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2017. Trigger-Action-Circuits: Leveraging Generative Design to Enable Novices to Design and Build Circuitry. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 331–342. https://doi.org/10.1145/3126594.3126637",
      "doi": "10.1145/3126594.3126637"
    },
    {
      "text": "Gabriella Anton and Uri Wilensky. 2019. One Size Fits All: Designing for Socialization in Physical Computing. In Proceedings of the 50th ACM Technical Symposium on Computer Science Education (Minneapolis, MN, USA) (SIGCSE ’19). Association for Computing Machinery, New York, NY, USA, 825–831. https://doi.org/10.1145/3287324.3287423",
      "doi": "10.1145/3287324.3287423"
    },
    {
      "text": "Jeffrey P. Bigham, Maxwell B. Aller, Jeremy T. Brudvik, Jessica O. Leung, Lindsay A. Yazzolino, and Richard E. Ladner. 2008. Inspiring Blind High School Students to Pursue Computer Science with Instant Messaging Chatbots. In Proceedings of the 39th SIGCSE Technical Symposium on Computer Science Education (Portland, OR, USA) (SIGCSE ’08). Association for Computing Machinery, New York, NY, USA, 449–453. https://doi.org/10.1145/1352135.1352287",
      "doi": "10.1145/1352135.1352287"
    },
    {
      "text": "Tracey Booth, Simone Stumpf, Jon Bird, and Sara Jones. 2016. Crossed Wires: Investigating the Problems of End-User Developers in a Physical Computing Task. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3485–3497. https://doi.org/10.1145/2858036.2858533",
      "doi": "10.1145/2858036.2858533"
    },
    {
      "text": "Zaira Cattaneo and Tomaso Vecchi.2011. Blind vision: the neuroscience of visual impairment.",
      "doi": ""
    },
    {
      "text": "Xiang ’Anthony’ Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E. Hudson. 2016. Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 29–39. https://doi.org/10.1145/2984511.2984512",
      "doi": "10.1145/2984511.2984512"
    },
    {
      "text": "Josh Urban Davis, Te-Yen Wu, Bo Shi, Hanyi Lu, Athina Panotopoulou, Emily Whiting, and Xing-Dong Yang. 2020. TangibleCircuits: An Interactive 3D Printed Circuit Education Tool for People with Visual Impairments. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376513",
      "doi": "10.1145/3313831.3376513"
    },
    {
      "text": "Kayla DesPortes, Aditya Anupam, Neeti Pathak, and Betsy DiSalvo. 2016. BitBlox: A Redesign of the Breadboard. In Proceedings of the The 15th International Conference on Interaction Design and Children (Manchester, United Kingdom) (IDC ’16). Association for Computing Machinery, New York, NY, USA, 255–261. https://doi.org/10.1145/2930674.2930708",
      "doi": "10.1145/2930674.2930708"
    },
    {
      "text": "Daniel Drew, Julie L. Newcomb, William McGrath, Filip Maksimovic, David Mellis, and Björn Hartmann. 2016. The Toastboard: Ubiquitous Instrumentation and Automated Checking of Breadboarded Circuits. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 677–686. https://doi.org/10.1145/2984511.2984566",
      "doi": "10.1145/2984511.2984566"
    },
    {
      "text": "Adam Fourney and Michael Terry. 2012. PICL: Portable in-Circuit Learner. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 569–578. https://doi.org/10.1145/2380116.2380188",
      "doi": "10.1145/2380116.2380188"
    },
    {
      "text": "Saul Greenberg and Chester Fitchett. 2001. Phidgets: Easy Development of Physical Interfaces through Physical Widgets. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology(Orlando, Florida) (UIST ’01). Association for Computing Machinery, New York, NY, USA, 209–218. https://doi.org/10.1145/502348.502388",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Björn Hartmann, Leith Abdulla, Manas Mittal, and Scott R. Klemmer. 2007. Authoring Sensor-Based Interactions by Demonstration with Direct Manipulation and Pattern Recognition. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 145–154. https://doi.org/10.1145/1240624.1240646",
      "doi": "10.1145/1240624.1240646"
    },
    {
      "text": "Björn Hartmann, Scott R. Klemmer, Michael Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective Physical Prototyping through Integrated Design, Test, and Analysis. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology(Montreux, Switzerland) (UIST ’06). Association for Computing Machinery, New York, NY, USA, 299–308. https://doi.org/10.1145/1166253.1166300",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "Steve Hodges, James Scott, Sue Sentance, Colin Miller, Nicolas Villar, Scarlet Schwiderski-Grosche, Kerry Hammil, and Steven Johnston. 2013. ..NET Gadgeteer: A New Platform for K-12 Computer Science Education. In Proceeding of the 44th ACM Technical Symposium on Computer Science Education (Denver, Colorado, USA) (SIGCSE ’13). Association for Computing Machinery, New York, NY, USA, 391–396. https://doi.org/10.1145/2445196.2445315",
      "doi": "10.1145/2445196.2445315"
    },
    {
      "text": "S. Hodges, S. Sentance, J. Finney, and T. Ball. 2020. Physical Computing: A Key Element of Modern Computer Science Education. Computer 53, 4 (April 2020), 20–30. https://doi.org/10.1109/MC.2019.2935058",
      "doi": ""
    },
    {
      "text": "Steve Hodges, Nicolas Villar, Nicholas Chen, Tushar Chugh, Jie Qi, Diana Nowacka, and Yoshihiro Kawahara. 2014. Circuit Stickers: Peel-and-Stick Construction of Interactive Electronic Prototypes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1743–1746. https://doi.org/10.1145/2556288.2557150",
      "doi": "10.1145/2556288.2557150"
    },
    {
      "text": "Michael S. Horn, R. Jordan Crouser, and Marina U. Bers. 2012. Tangible Interaction and Learning: The Case for a Hybrid Approach. Personal Ubiquitous Comput. 16, 4 (April 2012), 379–389. https://doi.org/10.1007/s00779-011-0404-2",
      "doi": "10.1007/s00779-011-0404-2"
    },
    {
      "text": "Michael S. Horn and Robert J. K. Jacob. 2007. Designing Tangible Programming Languages for Classroom Use. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (Baton Rouge, Louisiana) (TEI ’07). Association for Computing Machinery, New York, NY, USA, 159–162. https://doi.org/10.1145/1226969.1227003",
      "doi": ""
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data Engagement Through Physical Ambient Visualizations in the Home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1608–1619. https://doi.org/10.1145/2858036.2858059",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Karen H. Jin, Kathleen Haynie, and Gavin Kearns. 2016. Teaching Elementary Students Programming in a Physical Computing Classroom. In Proceedings of the 17th Annual Conference on Information Technology Education (Boston, Massachusetts, USA) (SIGITE ’16). Association for Computing Machinery, New York, NY, USA, 85–90. https://doi.org/10.1145/2978192.2978238",
      "doi": "10.1145/2978192.2978238"
    },
    {
      "text": "Yasmin B. Kafai, Eunkyoung Lee, Kristin Searle, Deborah Fields, Eliot Kaplan, and Debora Lui. 2014. A Crafts-Oriented Approach to Computing in High School: Introducing Computational Concepts, Practices, and Perspectives with Electronic Textiles. ACM Trans. Comput. Educ. 14, 1, Article 1 (March 2014), 20 pages. https://doi.org/10.1145/2576874",
      "doi": "10.1145/2576874"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S. Cook, Cheng Zhang, and Gregory D. Abowd. 2013. Instant Inkjet Circuits: Lab-Based Inkjet Printing to Support Rapid Prototyping of UbiComp Devices. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Zurich, Switzerland) (UbiComp ’13). Association for Computing Machinery, New York, NY, USA, 363–372. https://doi.org/10.1145/2493432.2493486",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Majeed Kazemitabaar, Jason McPeak, Alexander Jiao, Liang He, Thomas Outing, and Jon E. Froehlich. 2017. MakerWear: A Tangible Approach to Interactive Wearable Creation for Children. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 133–145. https://doi.org/10.1145/3025453.3025887",
      "doi": "10.1145/3025453.3025887"
    },
    {
      "text": "Winnie W.Y. Lau, Grace Ngai, Stephen C.F. Chan, and Joey C.Y. Cheung. 2009. Learning Programming through Fashion and Design: A Pilot Summer Course in Wearable Computing for Middle School Students. SIGCSE Bull. 41, 1 (March 2009), 504–508. https://doi.org/10.1145/1539024.1509041",
      "doi": "10.1145/1539024.1509041"
    },
    {
      "text": "Jingyi Li, Son Kim, Joshua A. Miele, Maneesh Agrawala, and Sean Follmer. 2019. Editing Spatial Layouts through Tactile Templates for People with Visual Impairments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300436",
      "doi": "10.1145/3290605.3300436"
    },
    {
      "text": "Joanne Lo, Cesar Torres, Isabel Yang, Jasper O’Leary, Danny Kaufman, Wilmot Li, Mira Dontcheva, and Eric Paulos. 2016. Aesthetic Electronics: Designing, Sketching, and Fabricating Circuits through Digital Exploration. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 665–676. https://doi.org/10.1145/2984511.2984579",
      "doi": "10.1145/2984511.2984579"
    },
    {
      "text": "Jo-Yu Lo, Da-Yuan Huang, Tzu-Sheng Kuo, Chen-Kuo Sun, Jun Gong, Teddy Seyed, Xing-Dong Yang, and Bing-Yu Chen. 2019. AutoFritz: Autocomplete for Prototyping Virtual Breadboard Circuits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300633",
      "doi": "10.1145/3290605.3300633"
    },
    {
      "text": "Meethu Malu, Pramod Chundury, and Leah Findlater. 2018. Exploring Accessible Smartwatch Interactions for People with Upper Body Motor Impairments. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174062",
      "doi": "10.1145/3173574.3174062"
    },
    {
      "text": "Muhanad Manshad, Enrico Pontelli, and Shakir Manshad. 2012. Trackable Interactive Multimodal Manipulatives: Towards a Tangible User Environment for the Blind. 664–671. https://doi.org/10.1007/978-3-642-31534-3_97",
      "doi": ""
    },
    {
      "text": "Paul Marshall. 2007. Do Tangible Interfaces Enhance Learning?. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (Baton Rouge, Louisiana) (TEI ’07). Association for Computing Machinery, New York, NY, USA, 163–170. https://doi.org/10.1145/1226969.1227004",
      "doi": "10.1145/1226969.1227004"
    },
    {
      "text": "Will McGrath, Daniel Drew, Jeremy Warner, Majeed Kazemitabaar, Mitchell Karchemsky, David Mellis, and Björn Hartmann. 2017. BifröSt: Visualizing and Checking Behavior of Embedded Systems across Hardware and Software. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 299–310. https://doi.org/10.1145/3126594.3126658",
      "doi": "10.1145/3126594.3126658"
    },
    {
      "text": "David A. Mellis, Leah Buechley, Mitchel Resnick, and Björn Hartmann. 2016. Engaging Amateurs in the Design, Fabrication, and Assembly of Electronic Devices. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (Brisbane, QLD, Australia) (DIS ’16). Association for Computing Machinery, New York, NY, USA, 1270–1281. https://doi.org/10.1145/2901790.2901833",
      "doi": "10.1145/2901790.2901833"
    },
    {
      "text": "Kylie Peppler. 2013. STEAM-powered computing education: Using E-textiles to integrate the arts and STEM. IEEE Computer 46 (09 2013), 38–43. https://doi.org/10.1109/MC.2013.257",
      "doi": ""
    },
    {
      "text": "Mareen Przybylla and Ralf ROMEIKE. 2014. Physical Computing and its Scope – Towards a Constructionist Computer Science Curriculum with Physical Computing. Informatics in Education 13 (09 2014), 241–254. https://doi.org/10.15388/infedu.2014.05",
      "doi": ""
    },
    {
      "text": "Kanjun Qiu, Leah Buechley, Edward Baafi, and Wendy Dubow. 2013. A Curriculum for Teaching Computer Science through Computational Textiles. In Proceedings of the 12th International Conference on Interaction Design and Children (New York, New York, USA) (IDC ’13). Association for Computing Machinery, New York, NY, USA, 20–27. https://doi.org/10.1145/2485760.2485787",
      "doi": "10.1145/2485760.2485787"
    },
    {
      "text": "Lauren Race, Chancey Fleet, Joshua A. Miele, Tom Igoe, and Amy Hurst. 2019. Designing Tactile Schematics: Improving Electronic Circuit Accessibility. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, PA, USA) (ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 581–583. https://doi.org/10.1145/3308561.3354610",
      "doi": "10.1145/3308561.3354610"
    },
    {
      "text": "Lauren Race, Claire Kearney-Volpe, Chancey Fleet, Joshua A. Miele, Tom Igoe, and Amy Hurst. 2020. Designing Educational Materials for a Blind Arduino Workshop. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–7. https://doi.org/10.1145/3334480.3383055",
      "doi": "10.1145/3334480.3383055"
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. RetroFab: A Design Tool for Retrofitting Physical Interfaces Using Actuators, Sensors and 3D Printing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 409–419. https://doi.org/10.1145/2858036.2858485",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Raf Ramakers, Kashyap Todi, and Kris Luyten. 2015. PaperPulse: An Integrated Approach for Embedding Electronics in Paper Designs. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2457–2466. https://doi.org/10.1145/2702123.2702487",
      "doi": "10.1145/2702123.2702487"
    },
    {
      "text": "Hrishikesh V. Rao and Sile O’Modhrain. 2020. 2Across: A Comparison of Audio-Tactile and Screen-Reader Based Representations of a Crossword Puzzle. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376207",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, F. Martin, Randy Sargent, and B. Silverman. 1996. Programmable Bricks: Toys to think with. IBM Systems Journal 35 (02 1996), 443 – 452. https://doi.org/10.1147/sj.353.0443",
      "doi": ""
    },
    {
      "text": "M. A. Rubio, R. Romero-Zaliz, C. Mañoso, and A. P. de Madrid. 2014. Enhancing an introductory programming course with physical computing modules. In 2014 IEEE Frontiers in Education Conference (FIE) Proceedings. 1–8. https://doi.org/10.1109/FIE.2014.7044153",
      "doi": ""
    },
    {
      "text": "Jaime Sánchez and Fernando Aguayo. 2005. Blind Learners Programming through Audio. In CHI ’05 Extended Abstracts on Human Factors in Computing Systems (Portland, OR, USA) (CHI EA ’05). Association for Computing Machinery, New York, NY, USA, 1769–1772. https://doi.org/10.1145/1056808.1057018",
      "doi": "10.1145/1056808.1057018"
    },
    {
      "text": "Sandra Schulz and Niels Pinkwart. 2015. Physical Computing in STEM Education. 134–135. https://doi.org/10.1145/2818314.2818327",
      "doi": ""
    },
    {
      "text": "Lei Shi, Holly Lawson, Zhuohao Zhang, and Shiri Azenkot. 2019. Designing Interactive 3D Printed Models with Teachers of the Visually Impaired. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300427",
      "doi": "10.1145/3290605.3300427"
    },
    {
      "text": "Lei Shi, Idan Zelzer, Catherine Feng, and Shiri Azenkot. 2016. Tickers and Talker: An Accessible Labeling Toolkit for 3D Printed Models. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 4896–4907. https://doi.org/10.1145/2858036.2858507",
      "doi": "10.1145/2858036.2858507"
    },
    {
      "text": "Lei Shi, Yuhang Zhao, and Shiri Azenkot. 2017. Designing Interactions for 3D Printed Models with Blind People. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility(Baltimore, Maryland, USA) (ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 200–209. https://doi.org/10.1145/3132525.3132549",
      "doi": "10.1145/3132525.3132549"
    },
    {
      "text": "Lei Shi, Yuhang Zhao, and Shiri Azenkot. 2017. Markit and Talkit: A Low-Barrier Toolkit to Augment 3D Printed Models with Audio Annotations. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 493–506. https://doi.org/10.1145/3126594.3126650",
      "doi": "10.1145/3126594.3126650"
    },
    {
      "text": "Ann C. Smith, Joan M. Francioni, and Sam D. Matzek. 2000. A Java Programming Tool for Students with Visual Disabilities. In Proceedings of the Fourth International ACM Conference on Assistive Technologies (Arlington, Virginia, USA) (Assets ’00). Association for Computing Machinery, New York, NY, USA, 142–148. https://doi.org/10.1145/354324.354356",
      "doi": "10.1145/354324.354356"
    },
    {
      "text": "Andreas M. Stefik, Christopher Hundhausen, and Derrick Smith. 2011. On the Design of an Educational Infrastructure for the Blind and Visually Impaired in Computer Science. In Proceedings of the 42nd ACM Technical Symposium on Computer Science Education (Dallas, TX, USA) (SIGCSE ’11). Association for Computing Machinery, New York, NY, USA, 571–576. https://doi.org/10.1145/1953163.1953323",
      "doi": "10.1145/1953163.1953323"
    },
    {
      "text": "Evan Strasnick, Maneesh Agrawala, and Sean Follmer. 2017. Scanalog: Interactive Design and Debugging of Analog Circuits with Programmable Hardware. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 321–330. https://doi.org/10.1145/3126594.3126618",
      "doi": "10.1145/3126594.3126618"
    },
    {
      "text": "Wee Lum Tan, Sven Venema, and Ruben Gonzalez. 2017. Using Arduino to Teach Programming to First-Year Computer Science Students.",
      "doi": ""
    },
    {
      "text": "Nicolas Villar, James Scott, Steve Hodges, Kerry Hammil, and Colin Miller. 2012. .NET Gadgeteer: A Platform for Custom Devices. , 216–233 pages.",
      "doi": ""
    },
    {
      "text": "Chiuan Wang, Hsuan-Ming Yeh, Bryan Wang, Te-Yen Wu, Hsin-Ruey Tsai, Rong-Hao Liang, Yi-Ping Hung, and Mike Y. Chen. 2016. CircuitStack: Supporting Rapid Prototyping and Evolution of Electronic Circuits. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology(Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 687–695. https://doi.org/10.1145/2984511.2984527",
      "doi": "10.1145/2984511.2984527"
    },
    {
      "text": "Te-Yen Wu, Jun Gong, Teddy Seyed, and Xing-Dong Yang. 2019. Proxino: Enabling Prototyping of Virtual Circuits with Physical Proxies. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 121–132. https://doi.org/10.1145/3332165.3347938",
      "doi": "10.1145/3332165.3347938"
    },
    {
      "text": "Te-Yen Wu, Hao-Ping Shen, Yu-Chian Wu, Yu-An Chen, Pin-Sung Ku, Ming-Wei Hsu, Jun-You Liu, Yu-Chih Lin, and Mike Y. Chen. 2017. CurrentViz: Sensing and Visualizing Electric Current Flows of Breadboarded Circuits. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 343–349. https://doi.org/10.1145/3126594.3126646",
      "doi": "10.1145/3126594.3126646"
    },
    {
      "text": "Te-Yen Wu, Bryan Wang, Jiun-Yu Lee, Hao-Ping Shen, Yu-Chian Wu, Yu-An Chen, Pin-Sung Ku, Ming-Wei Hsu, Yu-Chih Lin, and Mike Y. Chen. 2017. CircuitSense: Automatic Sensing of Physical Circuits and Generation of Virtual Circuits to Support Software Tools.. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 311–319. https://doi.org/10.1145/3126594.3126634",
      "doi": "10.1145/3126594.3126634"
    },
    {
      "text": "Xiaoyi Zhang, Tracy Tran, Yuqian Sun, Ian Culhane, Shobhit Jain, James Fogarty, and Jennifer Mankoff. 2018. Interactiles: 3D Printed Tactile Interfaces to Enhance Mobile Touchscreen Accessibility. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (Galway, Ireland) (ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 131–142. https://doi.org/10.1145/3234695.3236349",
      "doi": "10.1145/3234695.3236349"
    },
    {
      "text": "Junyi Zhu, Lotta-Gili Blumberg, Yunyi Zhu, Martin Nisser, Ethan Levi Carlson, Xin Wen, Kevin Shum, Jessica Ayeley Quaye, and Stefanie Mueller. 2020. CurveBoards: Integrating Breadboards into Physical Objects to Prototype Function in the Context of Form. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376617",
      "doi": "10.1145/3313831.3376617"
    },
    {
      "text": "Junyi Zhu, Yunyi Zhu, Jiaming Cui, Leon Cheng, Jackson Snowden, Mark Chounlakone, Michael Wessely, and Stefanie Mueller. 2020. MorphSensor: A 3D Electronic Design Tool for Reforming Sensor Modules. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology(Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 541–553. https://doi.org/10.1145/3379337.3415898",
      "doi": "10.1145/3379337.3415898"
    }
  ]
}