{
  "doi": "10.1145/3411764.3445756",
  "title": "Surfacing the Voices of People with Dementia: Strategies for Effective Inclusion of Proxy Stakeholders in Qualitative Research",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Best practices for conducting HCI research on dementia care increasingly involve multiple stakeholders and incorporate diverse viewpoints. When done effectively, involving proxy stakeholders such as family members and professionals can help bring forward the voices of people with dementia. However, concrete practical guidance for navigating the challenges of integrating different perspectives is lacking. We critically reflect on our own recent qualitative fieldwork involving participants with dementia, family caregivers, and facilitators at a local social program for people with dementia, re-examining our interview transcripts and observation notes through content analysis. We illustrate practical approaches to prioritizing participants’ voices through concrete excerpts that demonstrate strategies for better managing dynamics, intervening effectively, and engaging all stakeholders in the research process. Our reflections and proposed guidelines can benefit HCI researchers and practitioners working with vulnerable populations. We hope this work will spur further discussion and critique to strengthen and improve research practices in this domain.",
  "tags": [
    "stakeholder",
    "proxy",
    "reflections on practice",
    "dementia"
  ],
  "authors": [
    {
      "name": "Jiamin Dai",
      "institution": "School of Information Studies McGill University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659506110",
      "orcid": "missing"
    },
    {
      "name": "Karyn Moffatt",
      "institution": "School of Information Studies McGill University, Canada",
      "img": "/do/10.1145/contrib-81100235288/rel-imgonly/karyn.jpg",
      "acmid": "81100235288",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Meghan Allen, Rock Leung, Joanna McGrenere, and Barbara Purves. 2008. Involving domain experts in assistive technology research. Universal Access in the Information Society 7, 3 (Jan. 2008), 145–154. https://doi.org/10.1007/s10209-008-0112-5",
      "doi": "10.1007/s10209-008-0112-5"
    },
    {
      "text": "Alzheimer’sAssociation. 2020. 2020 Alzheimer’s disease facts and figures. Alzheimer’s & Dementia 16, 3 (Mar. 2020), 391–460. https://doi.org/10.1002/alz.12068",
      "doi": ""
    },
    {
      "text": "Ernesto Arias, Hal Eden, Gerhard Fischer, Andrew Gorman, and Eric Scharff. 2000. Transcending the individual human mind—creating shared understanding through collaborative design. ACM Transactions on Computer-Human Interaction (TOCHI) 7, 1 (Mar. 2000), 84–113. https://doi.org/10.1145/344949.345015",
      "doi": "10.1145/344949.345015"
    },
    {
      "text": "Arlene Astell, Norman Alm, Gary Gowans, Maggie Ellis, Richard Dye, and Phillip Vaughan. 2009. Involving older people with dementia and their carers in designing computer based support systems: some methodological considerations. Universal Access in the Information Society 8, 1 (May 2009), 49–58. https://doi.org/10.1007/s10209-008-0129-9",
      "doi": "10.1007/s10209-008-0129-9"
    },
    {
      "text": "Ruth Bartlett. 2012. Modifying the Diary Interview Method to Research the Lives of People With Dementia. Qualitative Health Research 22, 12 (2012), 1717–1726. https://doi.org/10.1177/1049732312462240",
      "doi": ""
    },
    {
      "text": "Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1125–1134. https://doi.org/10.1145/2207676.2208560",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Tula Brannelly and Ruth Bartlett. 2020. Using Walking Interviews to Enhance Research Relations with People with Dementia: Methodological Insights From an Empirical Study Conducted in England. Ethics and Social Welfare 14, 4 (2020), 432–442. https://doi.org/10.1080/17496535.2020.1839115",
      "doi": ""
    },
    {
      "text": "Tone Bratteteig and Ina Wagner. 2012. Disentangling power and decision-making in participatory design. In Proceedings of the 12th Participatory Design Conference: Research Papers - Volume 1. ACM, 41–50. https://doi.org/10.1145/2347635.2347642",
      "doi": "10.1145/2347635.2347642"
    },
    {
      "text": "Margot Brereton, Laurianne Sitbon, Muhammad Haziq Lim Abdullah, Mark Vanderberg, and Stewart Koplick. 2015. Design after design to bridge between people living with cognitive or sensory impairments, their friends and proxies. CoDesign 11, 1 (Mar. 2015), 4–20. https://doi.org/10.1080/15710882.2015.1009471",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Victor Ngo, and Sun Young Park. 2013. Caring for caregivers: designing for integrality. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 91–102. https://doi.org/10.1145/2441776.2441789",
      "doi": "10.1145/2441776.2441789"
    },
    {
      "text": "Raymundo Cornejo, Robin Brewer, Caroline Edasis, and Anne Marie Piper. 2016. Vulnerability, Sharing, and Privacy: Analyzing Art Therapy for Older Adults with Dementia. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1572–1583. https://doi.org/10.1145/2818048.2819960",
      "doi": "10.1145/2818048.2819960"
    },
    {
      "text": "John W. Creswell and Dana L. Miller. 2000. Determining Validity in Qualitative Inquiry. Theory Into Practice 39, 3 (2000), 124–130. https://doi.org/10.1207/s15430421tip3903_2",
      "doi": ""
    },
    {
      "text": "Masashi Crete-Nishihata, Ronald M. Baecker, Michael Massimi, Deborah Ptak, Rachelle Campigotto, Liam D. Kaufman, Adam M. Brickman, Gary R. Turner, Joshua R. Steinerman, and Sandra E. Black. 2012. Reconstructing the Past: Personal Memory Technologies Are Not Just Personal and Not Just for Memory. Human–Computer Interaction 27, 1-2 (Apr. 2012), 92–123. https://doi.org/10.1080/07370024.2012.656062",
      "doi": ""
    },
    {
      "text": "Jiamin Dai and Karyn Moffatt. 2020. Making Space for Social Sharing: Insights from a Community-Based Social Group for People with Dementia. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, 1–13. https://doi.org/10.1145/3313831.3376133",
      "doi": "10.1145/3313831.3376133"
    },
    {
      "text": "Jiamin Dai and Karyn Moffatt. 2020. Using proxies in supporting the voice of people with dementia in HCI research. In CHI’20 Workshop, Rethinking Notions of ’Giving Voice’ in Design. 1–4.",
      "doi": ""
    },
    {
      "text": "Janet Davis and Lisa P. Nathan. 2013. Value Sensitive Design: Applications, Adaptations, and Critiques. In Handbook of Ethics, Values, and Technological Design: Sources, Theory, Values and Application Domains, Jeroen van den Hoven, Pieter E. Vermaas, and Ibo van de Poel(Eds.). Springer Netherlands, Dordrecht, 1–26. https://doi.org/10.1007/978-94-007-6994-6_3-1",
      "doi": ""
    },
    {
      "text": "Melissa Densmore, Casey Fiesler, Cosmin Munteanu, Michael Muller, Janet C. Read, Katie Shilton, and Özge Subaşı. 2020. Research Ethics Roundtable. In Conference Companion Publication of the 2020 on Computer Supported Cooperative Work and Social Computing. ACM, 195–198. https://doi.org/10.1145/3406865.3419015",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing Tensions in Autobiographical Design in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, 753–764. https://doi.org/10.1145/3196709.3196781",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "Emma Dixon and Amanda Lazar. 2020. Approach Matters: Linking Practitioner Approaches to Technology Design for People with Dementia. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, 1–15. https://doi.org/10.1145/3313831.3376432",
      "doi": "10.1145/3313831.3376432"
    },
    {
      "text": "Emma Dixon and Amanda Lazar. 2020. The Role of Sensory Changes in Everyday Technology use by People with Mild to Moderate Dementia. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. ACM, Article 41. https://doi.org/10.1145/3373625.3417000",
      "doi": "10.1145/3373625.3417000"
    },
    {
      "text": "Paul Dourish. 2006. Implications for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 541–550. https://doi.org/10.1145/1124772.1124855",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Robert Ferguson, Emily Crist, and Karyn Moffatt. 2016. A Framework for Negotiating Ethics in Sensitive Settings: Hospice as a Case Study. Interacting with Computers 29, 1 (2016), 10–26. https://doi.org/10.1093/iwc/iww018",
      "doi": ""
    },
    {
      "text": "Sarah Foley, Nadia Pantidi, and John McCarthy. 2019. Care and Design: An Ethnography of Mutual Recognition in the Context of Advanced Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 1–15. https://doi.org/10.1145/3290605.3300840",
      "doi": "10.1145/3290605.3300840"
    },
    {
      "text": "Sarah Foley, Daniel Welsh, Nadia Pantidi, Kellie Morrissey, Tom Nappey, and John McCarthy. 2019. Printer Pals: Experience-Centered Design to Support Agency for People with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 1–13. https://doi.org/10.1145/3290605.3300634",
      "doi": "10.1145/3290605.3300634"
    },
    {
      "text": "Julia Galliers, Stephanie Wilson, Abi Roper, Naomi Cocks, Jane Marshall, Sam Muscroft, and Tim Pring. 2012. Words are not enough: empowering people with aphasia in the design process. In Proceedings of the 12th Participatory Design Conference: Research Papers - Volume 1. ACM, 51–60. https://doi.org/10.1145/2347635.2347643",
      "doi": "10.1145/2347635.2347643"
    },
    {
      "text": "Foad Hamidi, Melanie Baljko, and Isabel Gómez. 2017. Using Participatory Design with Proxies with Children with Limited Communication. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 250–259. https://doi.org/10.1145/3132525.3132527",
      "doi": "10.1145/3132525.3132527"
    },
    {
      "text": "James Hodge, Madeline Balaam, Sandra Hastings, and Kellie Morrissey. 2018. Exploring the Design of Tailored Virtual Reality Experiences for People with Dementia. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 1–13. https://doi.org/10.1145/3173574.3174088",
      "doi": "10.1145/3173574.3174088"
    },
    {
      "text": "James Hodge, Sarah Foley, Rens Brankaert, Gail Kenning, Amanda Lazar, Jennifer Boger, and Kellie Morrissey. 2020. Relational, Flexible, Everyday: Learning from Ethics in Dementia Research. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, 1–16. https://doi.org/10.1145/3313831.3376627",
      "doi": "10.1145/3313831.3376627"
    },
    {
      "text": "James Hodge, Kyle Montague, Sandra Hastings, and Kellie Morrissey. 2019. Exploring Media Capture of Meaningful Experiences to Support Families Living with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 3300653, 1–14. https://doi.org/10.1145/3290605.3300653",
      "doi": "10.1145/3290605.3300653"
    },
    {
      "text": "Megan Hofmann, Devva Kasnitz, Jennifer Mankoff, and Cynthia L Bennett. 2020. Living Disability Theory: Reflections on Access, Research, and Design. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. ACM, Article 4. https://doi.org/10.1145/3373625.3416996",
      "doi": "10.1145/3373625.3416996"
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Saskia Bakker, Gail Kenning, Inge Bongers, and Berry Eggen. 2020. The Role of Everyday Sounds in Advanced Dementia Care. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, 1–14. https://doi.org/10.1145/3313831.3376577",
      "doi": "10.1145/3313831.3376577"
    },
    {
      "text": "Maarten Houben, Rens Brankaert, and Eveline Wouters. 2020. Stakeholder Perspectives on Design Interventions in Dementia Care. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference. ACM, 43–47. https://doi.org/10.1145/3393914.3395868",
      "doi": ""
    },
    {
      "text": "Dorothy Howard and Lilly Irani. 2019. Ways of Knowing When Research Subjects Care. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 1–16. https://doi.org/10.1145/3290605.3300327",
      "doi": "10.1145/3290605.3300327"
    },
    {
      "text": "Hsiu-Fang Hsieh and Sarah E. Shannon. 2005. Three Approaches to Qualitative Content Analysis. Qualitative Health Research 15, 9 (Nov. 2005), 1277–1288. https://doi.org/10.1177/1049732305276687",
      "doi": ""
    },
    {
      "text": "Dhruv Jain, Audrey Desjardins, Leah Findlater, and Jon E. Froehlich. 2019. Autoethnography of a Hard of Hearing Traveler. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 236–248. https://doi.org/10.1145/3308561.3353800",
      "doi": "10.1145/3308561.3353800"
    },
    {
      "text": "Dhruv Jain, Venkatesh Potluri, and Ather Sharif. 2020. Navigating Graduate School with a Disability. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. ACM, Article 8. https://doi.org/10.1145/3373625.3416986",
      "doi": "10.1145/3373625.3416986"
    },
    {
      "text": "Jazette Johnson, Rebecca W. Black, and Gillian R. Hayes. 2020. Roles in the Discussion: An Analysis of Social Support in an Online Forum for People with Dementia. Proc. ACM Hum.-Comput. Interact. 4, CSCW2 (2020), Article 127. https://doi.org/10.1145/3415198",
      "doi": "10.1145/3415198"
    },
    {
      "text": "Rose Johnson, Yvonne Rogers, Janet van der Linden, and Nadia Bianchi-Berthouze. 2012. Being in the thick of in-the-wild studies: the challenges and insights of researcher participation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1135–1144. https://doi.org/10.1145/2207676.2208561",
      "doi": "10.1145/2207676.2208561"
    },
    {
      "text": "Pia Kontos and Wendy Martin. 2013. Embodiment and dementia: Exploring critical narratives of selfhood, surveillance, and dementia care. Dementia 12, 3 (2013), 288–302. https://doi.org/10.1177/1471301213479787",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, George Demiris, and Hilaire J. Thompson. 2016. Evaluation of a multifunctional technology system in a memory care unit: Opportunities for innovation in dementia care. Informatics for Health and Social Care 41, 4 (Jan. 2016), 373–386. https://doi.org/10.3109/17538157.2015.1064428",
      "doi": ""
    },
    {
      "text": "Amanda Lazar and Emma E. Dixon. 2019. Safe Enough to Share: Setting the Dementia Agenda Online. Proc. ACM Hum.-Comput. Interact. 3, CSCW (Nov. 2019), 1–23. https://doi.org/10.1145/3359187",
      "doi": "10.1145/3359187"
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. A Critical Lens on Dementia and Design in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2175–2188. https://doi.org/10.1145/3025453.3025522",
      "doi": "10.1145/3025453.3025522"
    },
    {
      "text": "Amanda Lazar, Jessica L. Feuston, Caroline Edasis, and Anne Marie Piper. 2018. Making as Expression: Informing Design with People with Complex Communication Needs through Art Therapy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 1–16. https://doi.org/10.1145/3173574.3173925",
      "doi": "10.1145/3173574.3173925"
    },
    {
      "text": "Amanda Lazar, Hilaire J. Thompson, and George Demiris. 2016. Design Recommendations for Recreational Systems Involving Older Adults Living With Dementia. Journal of Applied Gerontology (Apr. 2016), 1–25. https://doi.org/10.1177/0733464816643880",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction (2nd ed.). Morgan Kaufmann Publishers, an imprint of Elsevier, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Stephen Lindsay, Katie Brittain, Daniel Jackson, Cassim Ladha, Karim Ladha, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 521–530. https://doi.org/10.1145/2207676.2207749",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Galina Madjaroff and Helena Mentis. 2017. Narratives of Older Adults with Mild Cognitive Impairment and Their Caregivers. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 140–149. https://doi.org/10.1145/3132525.3132554",
      "doi": "10.1145/3132525.3132554"
    },
    {
      "text": "Deborah J. Mayhew and Todd J. Follansbee. 2012. User Experience Requirements Analysis within the Usability Engineering Lifecycle. In Human Computer Interaction Handbook: Fundamentals, Evolving Technologies, and Emerging Applications(3rd ed.), Julie A. Jacko (Ed.). CRC Press, Boca Raton, 945–954.",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proc. ACM Hum.-Comput. Interact. 3, CSCW (2019), Article 72. https://doi.org/10.1145/3359174",
      "doi": "10.1145/3359174"
    },
    {
      "text": "Helena M. Mentis, Galina Madjaroff, and Aaron K. Massey. 2019. Upside and Downside Risk in Online Security for Older Adults with Mild Cognitive Impairment. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 1–13. https://doi.org/10.1145/3290605.3300573",
      "doi": "10.1145/3290605.3300573"
    },
    {
      "text": "David L. Morgan, Jutta Ataie, Paula Carder, and Kim Hoffman. 2013. Introducing Dyadic Interviews as a Method for Collecting Qualitative Data. Qualitative Health Research 23, 9 (Aug. 2013), 1276–1284. https://doi.org/10.1177/1049732313501889",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Amy Bruckman, Michael Muller, Christopher Frauenberger, Casey Fiesler, Robert E. Kraut, Katie Shilton, and Jenny Waycott. 2019. SIGCHI Research Ethics Town Hall. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Paper panel05. https://doi.org/10.1145/3290607.3311742",
      "doi": ""
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O’Donnell, and John Vines. 2015. Situational Ethics: Re-thinking Approaches to Formal Ethics Requirements for Human-Computer Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 105–114. https://doi.org/10.1145/2702123.2702481",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "Timothy Neate, Aikaterini Bourazeri, Abi Roper, Simone Stumpf, and Stephanie Wilson. 2019. Co-Created Personas: Engaging and Empowering Users with Diverse Needs Within the Design Process. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 1–12. https://doi.org/10.1145/3290605.3300880",
      "doi": "10.1145/3290605.3300880"
    },
    {
      "text": "Mary Beth Riedner, Karen Maki, and Miriam Lytle. 2018. Becoming a dementia-friendly library. In The Relevant Library: Essays on Adapting to Changing Needs, Carol Smallwood Vera Gubnitskaia (Ed.). McFarland, Jefferson, NC, 187–194.",
      "doi": ""
    },
    {
      "text": "Jennifer A. Rode. 2011. Reflexivity in digital anthropology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 123–132. https://doi.org/10.1145/1978942.1978961",
      "doi": "10.1145/1978942.1978961"
    },
    {
      "text": "Marén Schorch, Lin Wan, David William Randall, and Volker Wulf. 2016. Designing for Those who are Overlooked: Insider Perspectives on Care Practices and Cooperative Work of Elderly Informal Caregivers. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 787–799. https://doi.org/10.1145/2818048.2819999",
      "doi": "10.1145/2818048.2819999"
    },
    {
      "text": "Kate Stephens, Matthew Butler, Leona M Holloway, Cagatay Goncu, and Kim Marriott. 2020. Smooth Sailing? Autoethnography of Recreational Travel by a Blind Person. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility. ACM, Article 26. https://doi.org/10.1145/3373625.3417011",
      "doi": "10.1145/3373625.3417011"
    },
    {
      "text": "Suziah Sulaiman, Siti Nur Syazana Mat Saei, Foong Oi Mean, and Halabi Hasbullah. 2010. Understanding domain expert’s perspectives and expectations in assistive technology. In 2010 International Symposium on Information Technology, Vol. 3. 1164–1167. https://doi.org/10.1109/ITSIM.2010.5561491",
      "doi": ""
    },
    {
      "text": "John C. Thomas and John T. Richards. 2012. Achieving Psychological Simplicity: Measures and Methods to Reduce Cognitive Complexity. In Human Computer Interaction Handbook: Fundamentals, Evolving Technologies, and Emerging Applications(3rd ed.), Julie A. Jacko (Ed.). CRC Press, Boca Raton, 491–514.",
      "doi": ""
    },
    {
      "text": "David Unbehaun, Konstantin Aal, Daryoush Daniel Vaziri, Peter David Tolmie, Rainer Wieching, David Randall, and Volker Wulf. 2020. Social Technology Appropriation in Dementia: Investigating the Role of Caregivers in Engaging People with Dementia with a Videogame-based Training System. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, 1–15. https://doi.org/10.1145/3313831.3376648",
      "doi": "10.1145/3313831.3376648"
    },
    {
      "text": "John Vines, Peter C. Wright, David Silver, Maggie Winchcombe, and Patrick Olivier. 2015. Authenticity, Relatability and Collaborative Approaches to Sharing Knowledge about Assistive Living Technology. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 82–94. https://doi.org/10.1145/2675133.2675222",
      "doi": "10.1145/2675133.2675222"
    },
    {
      "text": "Jayne Wallace, Anja Thieme, Gavin Wood, Guy Schofield, and Patrick Olivier. 2012. Enabling self, intimacy and a sense of home in dementia: an enquiry into design in a hospital setting. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2629–2638. https://doi.org/10.1145/2207676.2208654",
      "doi": "10.1145/2207676.2208654"
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2617–2626. https://doi.org/10.1145/2470654.2481363",
      "doi": ""
    },
    {
      "text": "Cara Wilson, Roisin McNaney, Abi Roper, Tara Capel, Laura Scheepmaker, Margot Brereton, Stephanie Wilson, David Philip Green, and Jayne Wallace. 2020. Rethinking Notions of ’Giving Voice’ in Design. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, 1–8. https://doi.org/10.1145/3334480.3375171",
      "doi": ""
    }
  ]
}