{
  "doi": "10.1145/3411764.3445408",
  "title": "“Turning the Invisible Visible”: Transdisciplinary Bioart Explorations in Human-DNA Interaction",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Hybrid interactive systems that combine living and digital components can engage, educate, and inform users, and are of growing interest in the HCI community. Advances in synthetic biology are transforming what is possible to do with these living media interfaces (LMIs). Bioart is a practice in which artists, often using synthetic biology methods, work with living organisms to creatively explore the human relationship with nonhuman organisms. We present results from an interview study with expert bioartists as well as our hands-on experience in a bioart project where we created poetry-infused wine by encoding and inserting a Persian Sufi poem into the DNA sequence of living yeast cells. We find that engaging in bioart practice generates transdisciplinary fluency with implications for access and activism and our understanding of the qualities of living media. We further explore the qualitative aspects of interacting directly with DNA and implications for sustainable futures.",
  "tags": [
    "synthetic biology",
    "DIYbio",
    "bioart",
    "transgenic art",
    "Living organisms",
    "biotechnology",
    "community science"
  ],
  "authors": [
    {
      "name": "Foad Hamidi",
      "institution": "Information Systems Department University of Maryland, Baltimore County, United States",
      "img": "/do/10.1145/contrib-81456613170/rel-imgonly/screenshot2018-05-11at3.45.49pm.png",
      "acmid": "81456613170",
      "orcid": "0000-0003-1991-6062"
    },
    {
      "name": "Lydia Stamato",
      "institution": "Information Systems University of Maryland, Baltimore Country, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701882",
      "orcid": "missing"
    },
    {
      "name": "Lisa Scheifele",
      "institution": "Loyola University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702183",
      "orcid": "missing"
    },
    {
      "name": "Rian Ciela Visscher Hammond",
      "institution": "Unaffiliated Artist/Researcher, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700677",
      "orcid": "missing"
    },
    {
      "name": "S. Nisa Asgarali-Hoffman",
      "institution": "Department of Information Systems University of Maryland, Baltimore County, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701134",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sarah J, Adkins, Rachel K. Rock, and J. Jeffrey Morris. 2018. Interdisciplinary STEM education reform: dishing out art in a microbiology laboratory. FEMS Microbiology Letters, 1-8.",
      "doi": ""
    },
    {
      "text": "American Society for Microbiology. Agar Art Contest. 2020. Retrieved September 11, 2020 from https://asm.org/Events/ASM-Agar-Art-Contest/Home.",
      "doi": ""
    },
    {
      "text": "Mirela Alistar and Margherita Pevere. 2020. Semina Aeternitatis: Using Bacteria for Tangible Interaction with Data. Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (CHI EA '20). Association for Computing Machinery, New York, NY, USA, 1–13. DOI: https://doi.org/10.1145/3334480.3381817.",
      "doi": ""
    },
    {
      "text": "Ars Electonica Festival. https://ars.electronica.art/news/en/ Accessed on September 11, 2020.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, and Sarah Ng. 2017. Supporting Cultures of Making: Technology, Policy, Visions, and Myths. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). Association for Computing Machinery, New York, NY, USA, 6523–6535. DOI: https://doi.org/10.1145/3025453.3025975.",
      "doi": "10.1145/3025453.3025975"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). Association for Computing Machinery, New York, NY, USA, 675–684. DOI: https://doi.org/10.1145/1978942.1979041.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Erich Berger, Kasperi Mäki-Reinikka, Kira O'Reilly, and Helena Sederholm. 2020. Art as we don't know it. Helsinki: Aalto Books.",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '07). Association for Computing Machinery, New York, NY, USA, 503–512. DOI: https://doi.org/10.1145/1240624.1240705.",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Eli Blevis and Erik Stolterman. 2009. Transcending disciplinary boundaries in interaction design. interactions 16, 5 (September-October 2009), 48–51. DOI: https://doi.org/10.1145/1572626.1572636.",
      "doi": ""
    },
    {
      "text": "Eli Blevis and Erik Stolterman. 2009. The Confluence of Interaction Design & Design: from Disciplinary to Transdisciplinary Perspectives. Undisciplined! Design Research Society Conference 2008, Sheffield Hallam University, Sheffield, UK.",
      "doi": ""
    },
    {
      "text": "Eli Blevis, Kenny Chow, Ilpo Koskinen, Sharon Poggenpohl, and Christine Tsin. 2014. Billions of interaction designers. interactions 21, 6 (November-December 2014), 34–41. DOI: https://doi.org/10.1145/2674931.",
      "doi": ""
    },
    {
      "text": "Eli Blevis, Ilpo K. Koskinen, Kun-Pyo Lee, Susanne Bødker, Lin-Lin Chen, Youn-kyung Lim, Huaxin Wei, and Ron Wakkary. 2015. Transdisciplinary Interaction Design in Design Education. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '15). Association for Computing Machinery, New York, NY, USA, 833–838. DOI: https://doi.org/10.1145/2702613.2724726.",
      "doi": "10.1145/2702613.2724726"
    },
    {
      "text": "Joachim Boldt, J. 2018. Machine metaphors and ethics in synthetic biology. Life Sciences, Society and Policy, 1-13.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology, 3(2), 77-101.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2020 One size fits all? What counts as quality practice in (reflexive) thematic analysis? Qualitative research in psychology. 1-25.",
      "doi": ""
    },
    {
      "text": "Urie Bronfenbrenner. 1979. The Ecology of Human Development. Harvard university press.",
      "doi": ""
    },
    {
      "text": "Oran Catts and Ionat Zur. 2008. The ethics of experiential engagement with the manipulation of life. In: da Costa B, Philip K (eds) Tactical biopolitics. Art, activism, and technoscience. The MIT Press, Cambridge,125–142.",
      "doi": ""
    },
    {
      "text": "Stuart Card. 2012. Information Visualization. In The human-computer interaction handbook (3rd ed.). Julie A. Jacko (Ed.). CRC Press, 515-547.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin, and Anslem Strauss. 2014. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage publications.",
      "doi": ""
    },
    {
      "text": "Joe Davis. 2011. Bacterial Radio. Ars Electonica. Retrieved September 11, 2020 from http://www.biofaction.com/synth-ethic/?p=44.",
      "doi": ""
    },
    {
      "text": "Heather Davis, Elaine Gan, and Terike Haapoja. 2020. Illuminting Multiplicity: Against the Unbearable Whiteness of Bioart, in Berger, E., Mäki-Reinikka, E., O'Reilly, K., & Helena, S. (eds). Art as we don't know it. Helsinki: Aalto Books.",
      "doi": ""
    },
    {
      "text": "Marta De Menezes. 2000. Nature? https://martademenezes.com/portfolio/projects/ Accessed on September 11, 2020.",
      "doi": ""
    },
    {
      "text": "Marta de Menezes. 2015. Biology as a new media for art: An art research endeavour. Technoetic Arts a Journal of Speculative Research, 13, 115–123.",
      "doi": ""
    },
    {
      "text": "Dick Davis. 2004. On not translating Hafez. New England Review (1990-) 25 (1/2), 310-318.",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). Association for Computing Machinery, New York, NY, USA, 1975–1984. DOI: https://doi.org/10.1145/1753326.1753625.",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Editors of the Encyclopedia Britannica. 2019. Morse Code. https://www.britannica.com/topic/Morse-Code. Accessed on September 11, 2020.",
      "doi": ""
    },
    {
      "text": "Carola Engler and Sylvestre Marillonnet. 2014. Golden gate cloning. DNA cloning and assembly methods. Humana Press, 119-131.",
      "doi": ""
    },
    {
      "text": "Owen Noel Newton Fernando, Adrian David Cheok, Tim Merritt, Roshan Lalintha Peiris, Charith Lasantha Fernando, Nimesha Ranasinghe, Inosha Wickrama, Kasun Karunanayaka, Chua Tong Wei, and Christopher Aldo Tandar. 2009. Babbage cabbage: Biological empathetic media. VRIC Laval Virtual Proceedings, 363-366.",
      "doi": ""
    },
    {
      "text": "Global Community Bio Fellows. 2020. Retrieved January 11, 2021 from https://www.biosummit.org/fellows/.",
      "doi": ""
    },
    {
      "text": "Gilad Gome, Julian Waksberg, Andrey Grishko, Iddo Yehoshua Wald, and Oren Zuckerman. 2019. OpenLH: Open Liquid-Handling System for Creative Experimentation with Biology. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '19). Association for Computing Machinery, New York, NY, USA, 55–64. DOI: https://doi.org/10.1145/3294109.3295619.",
      "doi": "10.1145/3294109.3295619"
    },
    {
      "text": "Camilla Groth, Margherita Pevere, Kirsi Niinimäki, & Pirjo Kääriäinen. 2020. Conditions for experiential knowledge exchange in collaborative research across the sciences and creative practice, CoDesign, 16:4, 328-344. https://doi.org/10.1080/15710882.2020.1821713.",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin. 2012. Introduction: A Moving Target: The Evolution of Human–Computer Interaction. In The human-computer interaction handbook (3rd ed.). Julie A. Jacko (Ed.). CRC Press, xxvii-lxi.",
      "doi": ""
    },
    {
      "text": "Hackteria.org. 2020. Retrieved January 11, 2021 from https://www.hackteria.org/.",
      "doi": ""
    },
    {
      "text": "Foad Hamidi and Melanie Baljko. 2017. Engaging children using a digital living media system. Proceedings of the Conference on Designing Interactive Systems (DIS’17), 711-723.",
      "doi": "10.1145/3064663.3064708"
    },
    {
      "text": "Hafez. 1974. The Dīvān. Translated by H. Wilberforce Clarke. London: Octagon Press. ISBN 0-900860-18-9.",
      "doi": ""
    },
    {
      "text": "Michael J. Harsch, Soon A. Lee, Matthew R. Goddard, and Richard C. Gardner. 2009. Optimized fermentation of grape juice by laboratory strains of Saccharomyces cerevisiae, FEMS Yeast Research, 10 (1), 72–82.",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk and Antti Oulasvirta. 2017. What Is Interaction? In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI '17). Association for Computing Machinery, New York, NY, USA, 5040–5052. DOI: https://doi.org/10.1145/3025453.3025765.",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "David Holstius, John Kembel, Amy Hurst, Peng-Hui Wan, and Jodi Forlizzi. 2004. Infotropism: living and robotic plants as interactive displays. In Proceedings of the 5th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '04). Association for Computing Machinery, New York, NY, USA, 215–221. DOI: https://doi.org/10.1145/1013115.1013145.",
      "doi": "10.1145/1013115.1013145"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10). Association for Computing Machinery, New York, NY, USA, 1311–1320. DOI: https://doi.org/10.1145/1753326.1753522.",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Eduardo Kac. 2008. The Natural History of the Engima. Retrieved September 11, 2020 from https://www.ekac.org/nat.hist.enig.html.",
      "doi": ""
    },
    {
      "text": "Eduardo Kac. 1999. Genesis. Retrieved September 11, 2020 from http://www.ekac.org/geninfo.html.",
      "doi": ""
    },
    {
      "text": "Eduardo Kac. 1999. Genesis, O.K. Center for Contemporary Art, Linz, 45-55.",
      "doi": ""
    },
    {
      "text": "Eduardo Kac. 2007. Signs of life: bio art and beyond, Cambridge, MA: MIT Press.",
      "doi": ""
    },
    {
      "text": "Yasmin B. Kafai and Justice T. Walker. (accepted). Twenty things to make with biology. Constructionism.",
      "doi": ""
    },
    {
      "text": "Bran Knowles, Oliver Bates, and Maria Håkansson. 2018. This Changes Sustainable HCI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Paper 471, 1–12. DOI: https://doi.org/10.1145/3173574.3174045.",
      "doi": "10.1145/3173574.3174045"
    },
    {
      "text": "Stacey Kuznetsov, Alex S. Taylor, Tim Regan, Nicolas Villar, and Eric Paulos. 2012. At the seams: DIYbio and opportunities for HCI. In Proceedings of the Designing Interactive Systems Conference (DIS '12). Association for Computing Machinery, New York, NY, USA, 258–267. DOI: https://doi.org/10.1145/2317956.2317997.",
      "doi": "10.1145/2317956.2317997"
    },
    {
      "text": "Stacey Kuznetsov, Carrie Doonan, Nathan Wilson, Swarna Mohan, Scott E. Hudson, and Eric Paulos. 2015. DIYbio Things: Open Source Biology Tools as Platforms for Hybrid Knowledge Production and Scientific Participation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 4065–4068. DOI: https://doi.org/10.1145/2702123.2702235.",
      "doi": "10.1145/2702123.2702235"
    },
    {
      "text": "Stacey Kuznetsov, Cassandra Barrett, Piyum Fernando, and Kat Fowler. 2018. Antibiotic-Responsive Bioart: Exploring DIYbio as a Design Studio Practice. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI '18). Association for Computing Machinery, New York, NY, USA, Paper 463, 1–14. DOI: https://doi.org/10.1145/3173574.3174037.",
      "doi": "10.1145/3173574.3174037"
    },
    {
      "text": "Seung Ah Lee, Engin Bumbacher, Alice M. Chung, Nate Cira, Byron Walker, Ji Young Park, Barry Starr, Paulo Blikstein, and Ingmar H. Riedel-Kruse. 2015. Trap it! A Playful Human-Biology Interaction for a Museum Installation. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 2593–2602. DOI: https://doi.org/10.1145/2702123.2702220.",
      "doi": ""
    },
    {
      "text": "Michael E. Lee, William C. DeLoache, Bernardo Cervantes, and John E. Lee. 2015. A highly characterized yeast toolkit for modular, multipart assembly. ACS synthetic biology, 4(9), 975-986.",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Garnet D. Hertz, and Paul Dourish. 2014, April. Emerging sites of HCI innovation: hackerspaces, hardware startups & incubators. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 439-448.",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "cindy lin kaiying, Silvia Lindtner, and Stefanie Wuschitz. 2019. Hacking Difference in Indonesia: The Ambivalences of Designing for Alternative Futures. Proceedings of the 2019 on Designing Interactive Systems Conference (DIS’19), 1571-1582.",
      "doi": ""
    },
    {
      "text": "Parvin Loloi. 2004. Hafiz, master of Persian poetry: A critical bibliography. Tauris.",
      "doi": ""
    },
    {
      "text": "Boris Magrini. 2014. Hackteria: An Example of Neomodern Activism. In Red Art: New Utopias in Data Capitalism. Lanfranco Aceti, Susanne Jaschko, Julian Stallabrass & Bill Balaskas (Eds.). Leonardo Electronic Almanac Book, 20(1): 58-71.",
      "doi": ""
    },
    {
      "text": "Lev Manovich. 2003. New Media from Borges to HTML. In The New Media Reader, MIT Press: Cambridge, MA, 13-25.",
      "doi": ""
    },
    {
      "text": "Timothy Merritt, Foad Hamidi, Mirela Alistar, and Marta de Menezes. 2020. Living Media Interfaces: A Multi-Perspective Analysis of Biological Materials for Interaction. Digital Creativity, 30(1), 1-21.",
      "doi": ""
    },
    {
      "text": "Julie Meisami. 2000. Shams al-Din Muhammad Hafiz. Encyclopedia of Literary Translation into English. London/Chicago: Routledge, 600-602.",
      "doi": ""
    },
    {
      "text": "Robert Mitchell. 2010. Bioart and the Vitality of Media. Seattle: University of Washington Press.",
      "doi": ""
    },
    {
      "text": "Museum of Modern Art (MOMA). Retrieved September 11, 2020 from https://www.moma.org/.",
      "doi": ""
    },
    {
      "text": "William Myers. 2012. Bio design. Museum of Modern Art.",
      "doi": ""
    },
    {
      "text": "William Myers. 2015. Bio Art: Altered Realities. Thames and Hudson.",
      "doi": ""
    },
    {
      "text": "Seyyed Hossein Nasr. 1992. Oral transmission and the book in Islamic education: The spoken and the written word. Journal of Islamic Studies, 3(1), 1-14.",
      "doi": ""
    },
    {
      "text": "Basarab Nicolescu, B. 2010. Methodology of transdisciplinarity. Transdisciplinary Journal of Engineering and Science, 1: 17-32.",
      "doi": ""
    },
    {
      "text": "Basarab Nicolescu and Atila Ertas. 2013. Editorial. In Transdisciplinary Theory and Practice. Basarab Nicolescu and Atila Ertas (eds.) TheATLAS.",
      "doi": ""
    },
    {
      "text": "Jeni Paay, Bridgette Engeler, Mark Taylor, Kirsten Day, Margot Brereton, and Yvonne Rogers. 2019. Wine and User Experience Design. In Proceedings of the 31st Australian Conference on Human-Computer-Interaction (OZCHI'19). Association for Computing Machinery, New York, NY, USA, 4–7. DOI: https://doi.org/10.1145/3369457.3369548.",
      "doi": "10.1145/3369457.3369548"
    },
    {
      "text": "Nasrollah Pourjavady. 2012. Love and the metaphors of wine and drunkenness in Persian Sufi poetry. In Metaphor and imagery in Persian poetry, Brill Press, 125-136.",
      "doi": ""
    },
    {
      "text": "Ali Saeidi and Tim Unwin. 2004. Persian wine tradition and symbolism: Evidence from the medieval poetry of Hafiz. Journal of Wine Research, 15(2), 97-114.",
      "doi": ""
    },
    {
      "text": "Omid Safi. 2020. Fake Hafez: How a supreme Persian poet of love was erased. Al-Jazeera News. Retrieved September 11, 2020 from https://www.aljazeera.com/indepth/opinion/fake-hafez-supreme-persian-poet-love-erased-200601073431603.html.",
      "doi": ""
    },
    {
      "text": "Edwin Sayes. 2014. Actor-Network Theory and Methodology: Just What Does it Mean to Say that Nonhumans Have Agency? Social Studies of Science, 44(1), 134-149.",
      "doi": ""
    },
    {
      "text": "Asghar Seyed-Gohrab. 2014. The Rose and the Wine: Dispute as a Literary Device in Classical Persian Literature. Iranian Studies 47 (1), 69-85.",
      "doi": ""
    },
    {
      "text": "Petra Schwille. 2011. Bottom-up synthetic biology: engineering in a tinkerer's world. Science, 333(6047), 1252-1254.",
      "doi": ""
    },
    {
      "text": "Orkan Telhan. 2016. Design. bio: Biology at the design studio. O'Reilly Biocoder 11, 33-43.",
      "doi": ""
    },
    {
      "text": "Justice Toshiba Walker, Mia Shaw, and Debora Lui. 2018. Biohacking food: A case study of science inquiry and design reflections about a synthetic biology high school workshop. Proceedings of the 2018 International Society of the Learning Sciences, 1559-1560.",
      "doi": ""
    },
    {
      "text": "Mark Weiser. 1991. The computer for the 21st century. Scientific American, 265(3), 94-104.",
      "doi": ""
    },
    {
      "text": "Nora S. Vaage. 2016. What Ethics for Bioart? NanoEthics, 10(1), 87–104. https://doi.org/10.1007/s11569-016-0253-6.",
      "doi": ""
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. BioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). Association for Computing Machinery, New York, NY, USA, 1–10. DOI: https://doi.org/10.1145/2702123.2702611.",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Ali K. Yetisen, Joe Davis, Ahmet F. Coskun, George M. Church, and Seok Hyun Yun. 2015. Bioart. Trends in Biotechnology, 724-734.",
      "doi": ""
    },
    {
      "text": "Karolina Zyniewicz. 2018. The Last Supper. Retrieved January 6, 2021 from http://karolinazyniewicz.com/gallery-category/living-projects/#the-last-supper.",
      "doi": ""
    }
  ]
}