{
  "doi": "10.1145/3411764.3445385",
  "title": "Designing AI for Trust and Collaboration in Time-Constrained Medical Decisions: A Sociotechnical Lens",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Major depressive disorder is a debilitating disease affecting 264 million people worldwide. While many antidepressant medications are available, few clinical guidelines support choosing among them. Decision support tools (DSTs) embodying machine learning models may help improve the treatment selection process, but often fail in clinical practice due to poor system integration.  We use an iterative, co-design process to investigate clinicians’ perceptions of using DSTs in antidepressant treatment decisions. We identify ways in which DSTs need to engage with the healthcare sociotechnical system, including clinical processes, patient preferences, resource constraints, and domain knowledge. Our results suggest that clinical DSTs should be designed as multi-user systems that support patient-provider collaboration and offer on-demand explanations that address discrepancies between predictions and current standards of care. Through this work, we demonstrate how current trends in explainable AI may be inappropriate for clinical environments and consider paths towards designing these tools for real-world medical systems.",
  "tags": [
    "decision support tools",
    "major depressive disorder",
    "healthcare"
  ],
  "authors": [
    {
      "name": "Maia Jacobs",
      "institution": "Computer Science and Preventive Medicine Northwestern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660778197",
      "orcid": "0000-0001-8500-0277"
    },
    {
      "name": "Jeffrey He",
      "institution": "School of Engineering and Applied Sciences Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700692",
      "orcid": "missing"
    },
    {
      "name": "Melanie F. Pradier",
      "institution": "Center for Research on Computation and Society Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701278",
      "orcid": "missing"
    },
    {
      "name": "Barbara Lam",
      "institution": "Department of Medicine Beth Israel Deaconess Medical Center, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700564",
      "orcid": "missing"
    },
    {
      "name": "Andrew C. Ahn",
      "institution": "Harvard Medical School, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700965",
      "orcid": "missing"
    },
    {
      "name": "Thomas H. McCoy",
      "institution": "Center for Quantitative Health Massachusetts General Hospital, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701816",
      "orcid": "missing"
    },
    {
      "name": "Roy H. Perlis",
      "institution": "Center for Quantitative Health Massachusetts General Hospital, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701887",
      "orcid": "missing"
    },
    {
      "name": "Finale Doshi-Velez",
      "institution": "SEAS Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435611644",
      "orcid": "missing"
    },
    {
      "name": "Krzysztof Z. Gajos",
      "institution": "School of Engineering and Applied Sciences Harvard University, United States",
      "img": "/do/10.1145/contrib-81100593751/rel-imgonly/81100593751.jpg",
      "acmid": "81100593751",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bryant AD, Fletcher GS, and TH Payne. 2014. Drug interaction alert override rates in the Meaningful Use era. Appl Clin Inf 5(2014), 802–813.",
      "doi": ""
    },
    {
      "text": "Alex Albright. 2019. If You Give a Judge a Risk Score: Evidence from Kentucky Bail Decisions. The John M. Olin Center for Law, Economics, and Business Fellows’ Discussion Paper Series (2019), 1–44.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Gagan Bansal, Besmira Nushi, Ece Kamar, Walter S. Lasecki, Daniel S. Weld, and Eric Horvitz. 2019. Beyond Accuracy: The Role of Mental Models in Human-AI Team Performance. Proceedings of the AAAI Conference on Human Computation and Crowdsourcing 7, 1(2019), 2–11.",
      "doi": ""
    },
    {
      "text": "Emma Beede, Elizabeth Baylor, Fred Hersch, Anna Iurchenko, Lauren Wilcox, Dr. Paisan Raumviboonsuk, and Laura Vardoulakis. 2020. A Human-Centered Evaluation of a Deep Learning System Deployed in Clinics for the Detection of Diabetic Retinopathy. In CHI Conference on Human Factors in Computing Systems (CHI ’20). 1–12.",
      "doi": "10.1145/3313831.3376718"
    },
    {
      "text": "Marc Berg. 1999. Patient care information systems and health care work: a sociotechnical approach. International Journal of Medical Informatics (1999), 87–101. https://doi.org/10.1016/S1386-5056(99)00011-8",
      "doi": ""
    },
    {
      "text": "Marc Berg, J. Aarts, and J. Van der Lei. 2003. ICT in Health Care: Sociotechnical Approaches. Methods of Information in Medicine 42, 4 (2003), 297–301. https://doi.org/10.1267/METH03040297",
      "doi": ""
    },
    {
      "text": "Zana Buçinca, Phoebe Lin, Krzysztof Z. Gajos, and Elena L. Glassman. 2020. Proxy tasks and subjective measures can be misleading in evaluating explainable AI systems. In ACM Proceedings ofthe 25th Conference on Intelligent User Interfaces. 454–464. https://doi.org/10.1145/3377325.3377498 arxiv:2001.08298",
      "doi": "10.1145/3377325.3377498"
    },
    {
      "text": "Adrian Bussone, Simone Stumpf, and Dympna O’Sullivan. 2015. The role of explanations on trust and reliance in clinical decision support systems. Proceedings - 2015 IEEE International Conference on Healthcare Informatics, ICHI 2015 (2015), 160–169. https://doi.org/10.1109/ICHI.2015.26",
      "doi": "10.1109/ICHI.2015.26"
    },
    {
      "text": "Carrie J Cai, Emily Reif, Narayan Hegde, Jason Hipp, Been Kim, Daniel Smilkov, Martin Wattenberg, Fernanda Viegas, Greg S Corrado, Martin C Stumpe, Michael Terry, Carri J Cai, and Nara yan Heg. 2019. Tools for Coping with Imperfect Algorithms During Medical Decision-Making. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3290605.3300234",
      "doi": "10.1145/3290605.3300234"
    },
    {
      "text": "Delesha M. Carpenter, Lorie L. Geryk, Annie T. Chen, Rebekah H. Nagler, Nathan F. Dieckmann, and Paul K.J. Han. 2016. Conflicting health information: a critical research need. Health Expectations 19, 6 (2016), 1173–1182. https://doi.org/10.1111/hex.12438",
      "doi": ""
    },
    {
      "text": "Cathy Charles, Amiram Gafni, and Tim Whelan. 1997. Shared decision-making in the medical encounter: What does it mean? (Or it takes, at least two to tango). Social Science and Medicine 44, 5 (1997), 681–692. https://doi.org/10.1016/S0277-9536(96)00221-3",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Linda Liska Belgrave. 2012. Qualitative interviewing and grounded theory analysis. The SAGE Handbook of Interview Research: The Complexity of the Craft (2012), 347–366. https://doi.org/10.4135/9781452218403.n25",
      "doi": ""
    },
    {
      "text": "Srikant Devaraj, Sushil K. Sharma, Dyan J. Fausto, Sara Viernes, and Hadi Kharrazi. 2014. Barriers and Facilitators to Clinical Decision Support Systems Adoption: A Systematic Review. Journal of Business Administration Research 3, 2 (2014). https://doi.org/10.5430/jbar.v3n2p36",
      "doi": ""
    },
    {
      "text": "Jonathan Dodge, Q. Vera Liao, Yunfeng Zhang, Rachel K.E. Bellamy, and Casey Dugan. 2019. Explaining models: An empirical study of how explanations impact fairness judgment. In International Conference on Intelligent User Interfaces. 275–285. https://doi.org/10.1145/3301275.3302310",
      "doi": "10.1145/3301275.3302310"
    },
    {
      "text": "Upol Ehsan and Mark O. Riedl. 2020. Human-centered Explainable AI: Towards a Reflective Sociotechnical Approach. arXiv preprint arXiv:2002.01092.(2020). arxiv:2002.01092http://arxiv.org/abs/2002.01092",
      "doi": ""
    },
    {
      "text": "Satu Elo and Helvi Kyngäs. 2008. The qualitative content analysis process. Journal of Advanced Nursing 62, 1 (2008), 107–115. https://doi.org/10.1111/j.1365-2648.2007.04569.x",
      "doi": ""
    },
    {
      "text": "Maurizio Fava and Kenneth S. Kendler. 2000. Major Depressive Disorder. Neuron 28(2000), 335–341. https://doi.org/10.1016/B978-012373947-6.00245-2",
      "doi": ""
    },
    {
      "text": "Paolo Fusar-Poli, Ziad Hijazi, Daniel Stahl, and Ewout W. Steyerberg. 2018. The Science of Prognosis in Psychiatry: A Review. JAMA Psychiatry 75, 12 (2018), 1280–1288. https://doi.org/10.1001/jamapsychiatry.2018.2530",
      "doi": ""
    },
    {
      "text": "Ben Green and Yiling Chen. 2019. The principles and limits of algorithm-in-the-loop decision making. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019). https://doi.org/10.1145/3359152",
      "doi": "10.1145/3359152"
    },
    {
      "text": "Riccardo Guidotti, Anna Monreale, and Salvatore Ruggieri. 2018. A Survey of Methods for Explaining Black Box Models. Comput. Surveys 51, 5 (2018).",
      "doi": "10.1145/3236009"
    },
    {
      "text": "Jianxing He, Sally L. Baxter, Jie Xu, Jiming Xu, Xingtao Zhou, and Kang Zhang. 2019. The practical implementation of artificial intelligence technologies in medicine. Nature Medicine 25, 1 (2019), 30–36. https://doi.org/10.1038/s41591-018-0307-0",
      "doi": ""
    },
    {
      "text": "Judith H. Hibbard and Jessica Greene. 2013. What the evidence shows about patient activation: Better health outcomes and care experiences; fewer data on costs. Health Affairs 32, 2 (2013), 207–214. https://doi.org/10.1377/hlthaff.2012.1061",
      "doi": ""
    },
    {
      "text": "Fred Hohman, Andrew Head, Rich Caruana, Robert DeLine, and Steven M. Drucker. 2019. Gamut: A Design Probe to Understand How Data Scientists Understand Machine Learning Models. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19 (2019), 1–13. https://doi.org/10.1145/3290605.3300809",
      "doi": "10.1145/3290605.3300809"
    },
    {
      "text": "Michael C Hughes, Gabriel Hope, Leah Weiner, Thomas H Mccoy, Roy H Perlis, Erik Sudderth, and Finale Doshi-velez. 2018. Semi-Supervised Prediction-Constrained Topic Models. In Proceedings of the 21st International Conference on Artificial Intelligence and Statistics (AISTATS), Vol. 84.",
      "doi": ""
    },
    {
      "text": "Michael C. Hughes, Melanie F. Pradier, Andrew Slavin Ross, Thomas H. McCoy, Roy H. Perlis, and Finale Doshi-Velez. 2020. Assessment of a Prediction Model for Antidepressant Treatment Stability Using Supervised Topic Models. JAMA Network Open 3, 5 (2020), e205308. https://doi.org/10.1001/jamanetworkopen.2020.5308",
      "doi": ""
    },
    {
      "text": "Catherine Hutton and Jane Gunn. 2007. Do longer consultations improve the management of psychological problems in general practice? A systematic literature review. BMC Health Services Research 7 (2007). https://doi.org/10.1186/1472-6963-7-71",
      "doi": ""
    },
    {
      "text": "Greg Irving, Ana Luisa Neves, Hajira Dambha-Miller, Ai Oishi, Hiroko Tagashira, Anistasiya Verho, and John Holden. 2017. International variations in primary care physician consultation time: A systematic review of 67 countries. BMJ Open 7, 10 (2017), 1–15. https://doi.org/10.1136/bmjopen-2017-017902",
      "doi": ""
    },
    {
      "text": "Maia Jacobs, Melanie F. Pradier, Thomas H. McCoy Jr, Roy H. Perlis, Finale Doshi-Velez, and Krzysztof Z. Gajos. 2021. How machine learning recommendations influence clinician treatment selections: the example of antidepressant selection. Translational Psychiatry(2021), (in press).",
      "doi": ""
    },
    {
      "text": "Aditya V. Karhade, Paul T. Ogink, Quirina C.B.S. Thio, Thomas D. Cha, William B. Gormley, Stuart H. Hershman, Timothy R. Smith, Jianren Mao, Andrew J. Schoenfeld, Christopher M. Bono, and Joseph H. Schwab. 2019. Development of machine learning algorithms for prediction of prolonged opioid prescription after surgery for lumbar disc herniation. Spine Journal 19, 11 (2019), 1764–1771. https://doi.org/10.1016/j.spinee.2019.06.002",
      "doi": ""
    },
    {
      "text": "Sidney H. Kennedy, Raymond W. Lam, Roger S. McIntyre, S. Valérie Tourjman, Venkat Bhat, Pierre Blier, Mehrul Hasnain, Fabrice Jollant, Anthony J. Levitt, Glenda M. MacQueen, Shane J. McInerney, Diane McIntosh, Roumen V. Milev, Daniel J. Müller, Sagar V. Parikh, Norma L. Pearson, Arun V. Ravindran, and Rudolf Uher. 2016. Canadian Network for Mood and Anxiety Treatments (CANMAT) 2016 clinical guidelines for the management of adults with major depressive disorder: Section 3. Pharmacological Treatments. Canadian Journal of Psychiatry 61, 9 (2016), 540–560. https://doi.org/10.1177/0706743716659417",
      "doi": ""
    },
    {
      "text": "Ronald C. Kessler, P. Berglund, O. Demler, R. Jin, D. Koretz, K. R. Merikangas, A. J. Rush, E. E. Walters, A. Wang, Barry Rovner, and Robin Casten. 2003. The epidemiology of major depressive disorder. Evidence-Based Eye Care 4, 4 (2003), 186–187. https://doi.org/10.1097/00132578-200310000-00002",
      "doi": ""
    },
    {
      "text": "Saif Khairat, David Marc, William Crosby, and Ali Al Sanousi. 2018. Reasons for physicians not adopting clinical decision support systems: Critical analysis. Journal of Medical Internet Research 20, 4 (2018). https://doi.org/10.2196/medinform.8912",
      "doi": ""
    },
    {
      "text": "Israa Khaleel, Barbara C. Wimmer, Gregory M. Peterson, Syed Tabish Razi Zaidi, Erin Roehrer, Elizabeth Cummings, and Kenneth Lee. 2020. Health information overload among health consumers: A scoping review. Patient Education and Counseling 103, 1 (2020), 15–32. https://doi.org/10.1016/j.pec.2019.08.008",
      "doi": ""
    },
    {
      "text": "Gilad J. Kuperman, Anne Bobb, Thomas H. Payne, Anthony J. Avery, Tejal K. Gandhi, Gerard Burns, David C. Classen, and David W. Bates. 2007. Medication-related Clinical Decision Support in Computerized Provider Order Entry Systems: A Review. Journal of the American Medical Informatics Association 14, 1(2007), 29–40. https://doi.org/10.1197/jamia.M2170",
      "doi": ""
    },
    {
      "text": "Yuhan Luo, Peiyi Liu, and Eun Kyoung Choe. 2019. Co-Designing Food Trackers with Dietitians. (2019), 1–13. https://doi.org/10.1145/3290605.3300822",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Ben Jelen, Annu Prabhakar, Lora Oehlberg, Katie Siek, and Kay Connelly. 2017. A Guide to Using Asynchronous Remote Communities (ARC) for Researching Distributed Populations. EAI Endorsed Transactions on Pervasive Health and Technology 3, 11(2017), 152898. https://doi.org/10.4108/eai.18-7-2017.152898",
      "doi": ""
    },
    {
      "text": "Glenda MacQueen, Pasqualina Santaguida, Homa Keshavarz, Natalia Jaworska, Mitchell Levine, Joseph Beyene, and Parminder Raina. 2017. Systematic review of clinical practice guidelines for failed antidepressant treatment response in major depressive disorder, dysthymia, and subthreshold depression in adults. The Canadian Journal of Psychiatry 62, 1 (2017), 11–23.",
      "doi": ""
    },
    {
      "text": "Gregory Makoul and Marla L. Clayman. 2006. An integrative model of shared decision making in medical encounters. Patient Education and Counseling 60, 3 (2006), 301–312. https://doi.org/10.1016/j.pec.2005.06.010",
      "doi": ""
    },
    {
      "text": "Andreas Menke. 2018. Precision pharmacotherapy: psychiatry’s future direction in preventing, diagnosing, and treating mental disorders. Pharmacogenomics and Personalized Medicine(2018), 11–211. https://doi.org/10.2147/PGPM.S146110",
      "doi": ""
    },
    {
      "text": "B Middleton, D F Sittig, and A Wright. 2016. Clinical Decision Support: a 25 Year Retrospective and a 25 Year Vision. IMIA Yearbook of medical informatics(2016), 103–116. https://doi.org/10.15265/IYS-2016-s034",
      "doi": ""
    },
    {
      "text": "Tim Miller. 2019. Explanation in artificial intelligence: Insights from the social sciences. Artificial Intelligence 267 (2019), 1–38. https://doi.org/10.1016/j.artint.2018.07.007 arxiv:1706.07269",
      "doi": ""
    },
    {
      "text": "Karen C. Nanji, Sarah P. Slight, Diane L. Seger, Insook Cho, Julie M. Fiskio, Lisa M. Redden, Lynn A. Volk, and David W. Bates. 2014. Overrides of medication-related clinical decision support alerts in outpatients. Journal of the American Medical Informatics Association 21, 3(2014), 487–491. https://doi.org/10.1136/amiajnl-2013-001813",
      "doi": ""
    },
    {
      "text": "Renee Noortman, Britta F. Schulte, Paul Marshall, Saskia Bakker, and Anna L. Cox. 2019. Hawkeye – Deploying a design fiction probe. Conference on Human Factors in Computing Systems - Proceedings (2019), 1–14. https://doi.org/10.1145/3290605.3300652",
      "doi": "10.1145/3290605.3300652"
    },
    {
      "text": "Ziad Obermeyer, Brian Powers, Christine Vogeli, and Sendhil Mullainathan. 2019. Dissecting racial bias in an algorithm used to manage the health of populations. Science 366, 6464 (2019), 447–453. https://doi.org/10.1126/science.aax2342",
      "doi": ""
    },
    {
      "text": "Changhoon Oh, Jungwoo Song, Jinhan Choi, Seonghyeon Kim, Sungwoo Lee, and Bongwon Suh. 2018. I Lead, You Help but Only with Enough Details: Understanding User Experience of Co-Creation with Artificial Intelligence. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (2018), 649:1—-649:13. https://doi.org/10.1145/3173574.3174223",
      "doi": "10.1145/3173574.3174223"
    },
    {
      "text": "Jerome A. Osheroff, Jonathan M. Teich, Blackford Middleton, Elaine B. Steen, Adam Wright, and Don E. Detmer. 2007. A Roadmap for National Action on Clinical Decision Support. Journal of the American Medical Informatics Association 14, 2(2007), 141–145. https://doi.org/10.1197/jamia.M2334",
      "doi": ""
    },
    {
      "text": "Roy H Perlis. 2016. Abandoning personalization to get to precision in the pharmacotherapy of depression. World Psychiatry 15, October (2016), 228–235.",
      "doi": ""
    },
    {
      "text": "Melanie F. Pradier, Thomas H. McCoy, Michael Hughes, Roy H. Perlis, and Finale Doshi-Velez. 2020. Predicting treatment dropout after antidepressant initiation. Translational Psychiatry 10, 1 (2020). https://doi.org/10.1038/s41398-020-0716-y",
      "doi": ""
    },
    {
      "text": "Melanie F. Pradier, Javier Zazo, Sonali Parbhoo, Roy H. Perlis, Maurizio Zazzi, and Finale Doshi-Velez. 2021. Preferential Mixture-of-Experts: Interpretable Models that Rely on Human Expertise As Much As Possible. In AMIA 2021 Virtual Informatics Summit.",
      "doi": ""
    },
    {
      "text": "Wanda Pratt, Madhu C Reddy, David W McDonald, Peter Tarczy-Hornoch, and John H Gennari. 2004. Incorporating ideas from computer-supported cooperative work.Journal of biomedical informatics 37, 2 (apr 2004), 128–37. https://doi.org/10.1016/j.jbi.2004.04.001",
      "doi": ""
    },
    {
      "text": "Cynthia Rudin. 2019. Stop explaining black box machine learning models for high stakes decisions and use interpretable models instead. Nature Machine Intelligence 1, 5 (2019), 206–215. https://doi.org/10.1038/s42256-019-0048-x arxiv:1811.10154",
      "doi": ""
    },
    {
      "text": "A. Rush. 2006. Acute and Longer-Term Outcomes in Depressed Outpatients Requiring One or Several Treatment Steps: A STAR*D Report. American Journal of Psychiatry 163, 11 (2006), 1905. https://doi.org/10.1176/appi.ajp.163.11.1905",
      "doi": ""
    },
    {
      "text": "Devansh Saxena, Karla Badillo-Urquiola, Pamela J. Wisniewski, and Shion Guha. 2020. A Human-Centered Review of the Algorithms used within the U.S. Child Welfare System. In CHI ’20. arxiv:arXiv:2003.03541v1",
      "doi": ""
    },
    {
      "text": "Kumiko O. Schnock, Julia E. Snyder, Theresa E. Fuller, Megan Duckworth, Maxwell Grant, Catherine Yoon, Stuart Lipsitz, Anuj K. Dalal, David W. Bates, and Patricia C. Dykes. 2019. Acute care patient portal intervention: Portal use and patient activation. Journal of Medical Internet Research 21, 7 (2019), 1–11. https://doi.org/10.2196/13336",
      "doi": ""
    },
    {
      "text": "Andrew D. Selbst, Danah Boyd, Sorelle A. Friedler, Suresh Venkatasubramanian, and Janet Vertesi. 2019. Fairness and abstraction in sociotechnical systems. Proceedings of the 2019 Conference on Fairness, Accountability, and Transparency (2019), 59–68. https://doi.org/10.1145/3287560.3287598",
      "doi": "10.1145/3287560.3287598"
    },
    {
      "text": "Adrian B.R. Shatte, Delyse M. Hutchinson, and Samantha J. Teague. 2019. Machine learning in mental health: A scoping review of methods and applications. Psychological Medicine 49, 9 (2019), 1426–1448. https://doi.org/10.1017/S0033291719000151",
      "doi": ""
    },
    {
      "text": "Gregory E. Simon and Roy H. Perlis. 2010. Personalized medicine for depression: Can we match patients with treatments?American Journal of Psychiatry 167, 12 (2010), 1445–1455. https://doi.org/10.1176/appi.ajp.2010.09111680",
      "doi": ""
    },
    {
      "text": "Amy Sitapi, Hyeoneui Kim, Barbara Berkovich, Rebecca Marmor, Siddharth Singh, Robert El-Kareh, Brian Clay, and Lucila Ohno-Machado. 2016. Integrated Precision Medicine: The Role of Electronic Health Records in Delivering Personalized Treatment. Physiology & behavior 176, 1 (2016), 100–106. https://doi.org/10.1016/j.gde.2016.03.011",
      "doi": ""
    },
    {
      "text": "Dean F. Sittig, Adam Wright, Jerome A. Osheroff, Blackford Middleton, Jonathan M. Teich, Joan S. Ash, Emily Campbell, and David W. Bates. 2008. Grand challenges in clinical decision support. Journal of Biomedical Informatics 41, 2 (2008), 387–392. https://doi.org/10.1016/j.jbi.2007.09.003",
      "doi": "10.1016/j.jbi.2007.09.003"
    },
    {
      "text": "Michael Solomon, Stephen L. Wagner, and James Goes. 2012. Effects of a Web-based intervention for adults with chronic conditions on patient activation: online randomized controlled trial.Journal of medical Internet research 14, 1 (2012), 1–13. https://doi.org/10.2196/jmir.1924",
      "doi": ""
    },
    {
      "text": "Megan Stevenson. 2018. Assessing risk assessment in action. Minnesota Law Review 103, 1 (2018), 303–384. https://doi.org/10.2139/ssrn.3016088",
      "doi": ""
    },
    {
      "text": "Stephen Thielke, Steven Vannoy, and Jürgen Unützer. 2007. Integrating Mental Health and Primary Care. Prim Care Clin Office Pract(2007), 571–592.",
      "doi": ""
    },
    {
      "text": "Sana Tonekaboni, Shalmali Joshi, Melissa D McCradden, and Anna Goldenberg. 2019. What Clinicians Want: Contextualizing Explainable Machine Learning for Clinical End Use. Ml (2019), 1–19. arxiv:1905.05134http://arxiv.org/abs/1905.05134",
      "doi": ""
    },
    {
      "text": "Madhukar H. Trivedi and Ella J. Daly. 2008. Treatment strategies to improve and sustain remission in major depressive disorder. Dialogues in Clinical Neuroscience 10, 4 (2008), 377–384.",
      "doi": ""
    },
    {
      "text": "Stijn Van de Velde, Annemie Heselmans, Nicolas Delvaux, Linn Brandt, Luis Marco-Ruiz, David Spitaels, Hanne Cloetens, Tiina Kortteisto, Pavel Roshanov, Ilkka Kunnamo, Bert Aertgeerts, Per Olav Vandvik, and Signe Flottorp. 2018. A systematic review of trials evaluating success factors of interventions with computerised clinical decision support. Implementation Science 13, 1 (2018), 1–11. https://doi.org/10.1186/s13012-018-0790-1",
      "doi": ""
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, Brian Y Lim, and United States. 2019. Designing Theory-Driven User-Centric Explainable AI. In CHI Conference on Human Factors in Computing Systems (CHI ’19). 1–15.",
      "doi": ""
    },
    {
      "text": "Jenna Wiens, Suchi Saria, Mark Sendak, Marzyeh Ghassemi, Vincent X. Liu, Finale Doshi-Velez, Kenneth Jung, Katherine Heller, David Kale, Mohammed Saeed, Pilar N. Ossorio, Sonoo Thadaney-Israni, and Anna Goldenberg. 2019. Do no harm: a roadmap for responsible machine learning for health care. Nature Medicine 25, September (2019). https://doi.org/10.1038/s41591-019-0548-6",
      "doi": ""
    },
    {
      "text": "Nicole J. Wolf and Derek R. Hopko. 2008. Psychosocial and pharmacological interventions for depressed adults in primary care: A critical review. Clinical Psychology Review 28, 1 (2008), 131–161. https://doi.org/10.1016/j.cpr.2007.04.004",
      "doi": ""
    },
    {
      "text": "Yao Xie, Melody Chen, David Kao, Ge Gao, and Xiang ’Anthony’ Chen. 2020. CheXplain: Enabling Physicians to Explore and Understand Data-Driven, AI-Enabled Medical Imaging Analysis. In CHI 2020. 1–13. https://doi.org/10.1145/3313831.3376807 arxiv:2001.05149",
      "doi": ""
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, and John Zimmerman. 2019. Unremarkable AI: Fiting intelligent decision support into critical, clinical decision-making processes. Conference on Human Factors in Computing Systems - Proceedings (2019), 1–11. https://doi.org/10.1145/3290605.3300468 arxiv:1904.09612",
      "doi": "10.1145/3290605.3300468"
    },
    {
      "text": "Q Yang, J Zimmerman, and A Steinfeld. 2015. Review of Medical Decision Support Tools: Emerging Opportunity for Interaction Design. IASDR 2015 InterplaySeptember (2015), 1–16. https://doi.org/10.13140/RG.2.1.1441.3284",
      "doi": ""
    },
    {
      "text": "Ming Yin, Jennifer Wortman Vaughan, and Hanna Wallach. 2019. Understanding the Effect of Accuracy on Trust in Machine Learning Models. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (2019), 1–12. https://doi.org/10.1145/3290605.3300509",
      "doi": "10.1145/3290605.3300509"
    }
  ]
}