{
  "doi": "10.1145/3411764.3445414",
  "title": "Diagramming Working Field Theories for Design in the HCI Classroom",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "HCI has historically provided little support for moving from fieldwork insights or theories to design outcomes. Having witnessed many students struggle and then justify their designs with a form of marketing hype, we developed a supporting approach of “field theories”. A field theory is a working theory about salient interactions in a particular domain and sensitizing concepts in order to frame design investigations. It is presented visually in a field theory diagram to support succinct communication and critique. Studying use of design prototypes that have been informed by a field theory helps to reflect upon and refine the theory. In this paper we present examples from our HCI classes and reflections based on interviews with students. We discuss how field theories offer an orientation in the spirit of a ‘bricoleur’ who harnesses elements of theory and practice to produce deeper understandings and more fitting outcomes for the task at hand.",
  "authors": [
    {
      "name": "Bernd Ploderer",
      "institution": "School of Computer Science, Queensland University of Technology (QUT), Brisbane, Australia",
      "img": "/do/10.1145/contrib-81311485528/rel-imgonly/bp2017-167a8820portrait.jpg",
      "acmid": "81311485528",
      "orcid": "missing"
    },
    {
      "name": "Jennyfer Lawrence Taylor",
      "institution": "School of Computing, Australian National University, Canberra, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701136",
      "orcid": "missing"
    },
    {
      "name": "Diego Muñoz",
      "institution": "Centre for Design Innovation, Swinburne University of Technology, Melbourne, Australia",
      "img": "/do/10.1145/contrib-86158689157/rel-imgonly/profile_photo.jpg",
      "acmid": "86158689157",
      "orcid": "missing"
    },
    {
      "name": "Filip Bircanin",
      "institution": "School of Computer Science, Queensland University of Technology (QUT), Brisbane, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659118776",
      "orcid": "missing"
    },
    {
      "name": "Margot Brereton",
      "institution": "School of Computer Science, Queensland University of Technology (QUT), Brisbane, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100017862",
      "orcid": "0000-0002-0982-3404"
    }
  ],
  "references": [
    {
      "text": "Robert J. Anderson, 1994. Representations and Requirements: The Value of Ethnography in System Design. Human–Computer Interaction 9, 2, 151-182. http://dx.doi.org/10.1207/s15327051hci0902_1",
      "doi": ""
    },
    {
      "text": "Rudolf Arnheim, 1997. Visual thinking. Univ of California Press, Berkeley.",
      "doi": ""
    },
    {
      "text": "Hugh Beyer and Karen Holtzblatt, 1998. Contextual Design: Defining Customer-centered Systems. Morgan Kaufmann, Waltham, MA.",
      "doi": "10.5555/286067"
    },
    {
      "text": "John B Biggs and Catherine Tang, 2011. Teaching for quality learning at university: What the student does. Open University Press, Berkshire, UK.",
      "doi": ""
    },
    {
      "text": "Linda Birt, Suzanne Scott, Debbie Cavers, Christine Campbell, and Fiona Walter, 2016. Member Checking:A Tool to Enhance Trustworthiness or Merely a Nod to Validation? Qualitative Health Research 26, 13, 1802-1811. http://dx.doi.org/10.1177/1049732316654870",
      "doi": ""
    },
    {
      "text": "Jeanette Blomberg, Mark Burrel, and Greg Guest, 2003. An ethnographic approach to design. In The Human-Computer Interaction Handbook, Julie A. Jacko and Andrew Sears Eds. Lawrence Erlbaum Associates, Mahwah, NJ, 964-986.",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish, 2007. How HCI interprets the probes. In CHI 2007, ACM, New York, 1077-1086. http://dx.doi.org/10.1145/1240624.1240789",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Glenn A. Bowen, 2006. Grounded theory and sensitizing concepts. International Journal of Qualitative Methods 5, 3, 1-9.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke, 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2, 77-101.",
      "doi": ""
    },
    {
      "text": "Bill Buxton, 2007. Sketching user experiences: getting the design right and the right design. Morgan Kaufmann, San Francisco.",
      "doi": "10.5555/1526229"
    },
    {
      "text": "Kathy Charmaz, 2007. Constructing grounded theory: A practical guide through qualitative analysis. Sage, Los Angeles, CA.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss, 1985. Managing chronic illness at home: three lines of work. Qualitative Sociology 8, 3, 224-247. http://dx.doi.org/10.1007/BF00989485",
      "doi": ""
    },
    {
      "text": "Alma Leora Culén, Jorun Børsting, and William Gaver, 2020. Strategies for Annotating Portfolios: Mapping Designs for New Domains. In Proceedings of the 2020 ACM on Designing Interactive Systems Conference, ACM, New York, 1633–1645. http://dx.doi.org/10.1145/3357236.3395490",
      "doi": "10.1145/3357236.3395490"
    },
    {
      "text": "Peter Dalsgaard and Christian Dindler, 2014. Between theory and practice: bridging concepts in HCI research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, New York, 1635–1644. http://dx.doi.org/10.1145/2556288.2557342",
      "doi": "10.1145/2556288.2557342"
    },
    {
      "text": "Norman K. Denzin and Yvonna S. Lincoln, 1994. Handbook of qualitative research. Sage Publications, Thousand Oaks.",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Cayla Key, 2020. Parallels, Tangents, and Loops: Reflections on the “Through” Part of RtD. In Proceedings of the 2020 ACM Designing Interactive Systems Conference, ACM, New York, 2133–2147. http://dx.doi.org/10.1145/3357236.3395586",
      "doi": "10.1145/3357236.3395586"
    },
    {
      "text": "Robert M. Emerson, R. I. Fretz, L. L. Shaw, and I. Thompson, 1996. Writing ethnographic fieldnotes. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Daniel Fallman, 2003. Design-oriented human-computer interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, New York, 225–232. http://dx.doi.org/10.1145/642611.642652",
      "doi": "10.1145/642611.642652"
    },
    {
      "text": "Brian J Fogg, 2009. A behavior model for persuasive design. In Persuasive 2009 ACM, 40.",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger, 2019. Entanglement HCI The Next Wave? ACM Transactions on Computer-Human Interaction (TOCHI) 27, 1, Article 2. http://dx.doi.org/10.1145/3364998",
      "doi": ""
    },
    {
      "text": "Batya Friedman and David G Hendry, 2019. Value sensitive design: Shaping technology with moral imagination. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "William Gaver, 2006. Learning from experience. CHI 2006 Workshop on Theory and Methods for Experience-Centered Design.",
      "doi": ""
    },
    {
      "text": "William Gaver, 2012. What should we expect from research through design? In Conference on Human Factors in Computing Systems (CHI ’12), ACM, New York, 937-946. http://dx.doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "William Gaver, A. Dunne, and E. Pacenti, 1999. Cultural probes. interactions 6, 1, 21-29.",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi, 2019. Histories and Futures of Research through Design: From Prototypes to Connected Things. International Journal of Design 13, 3, 139-155.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg, Sheelagh Carpendale, Nicolai Marquardt, and Bill Buxton, 2011. Sketching user experiences: The workbook. Morgan Kaufmann, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Megan Grocki, 2014. How to Create a Customer Journey Map UX Mastery. https://uxmastery.com/how-to-create-a-customer-journey-map/",
      "doi": ""
    },
    {
      "text": "Christine A. Halverson, 2002. Activity Theory and Distributed Cognition: Or What Does CSCW Need to DO with Theories? Computer Supported Cooperative Work (CSCW) 11, 1, 243-267. http://dx.doi.org/10.1023/a:1015298005381",
      "doi": "10.1023/A%3A1015298005381"
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers, 2007. The three paradigms of HCI. alt. chi.",
      "doi": ""
    },
    {
      "text": "Kristina Höök and Jonas Löwgren, 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 3, 1-18. http://dx.doi.org/10.1145/2362364.2362371",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Claude Levi-Strauss, 1966. The Savage Mind. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Wendy E. Mackay, Anne V. Ratzer, and Paul Janecek, 2000. Video artifacts for design: bridging the Gap between abstraction and detail. In Proceedings of the 3rd conference on Designing Interactive Systems, ACM, New York, 72–82. http://dx.doi.org/10.1145/347642.347666",
      "doi": "10.1145/347642.347666"
    },
    {
      "text": "John Mccarthy and Peter Wright, 2004. Technology as experience. MIT Press, Cambridge.",
      "doi": "10.5555/1044942"
    },
    {
      "text": "David R. Millen, 2000. Rapid ethnography: time deepening strategies for HCI field research. In Proceedings of the 3rd conference on Designing Interactive Systems, ACM, New York, 280–286. http://dx.doi.org/10.1145/347642.347763",
      "doi": "10.1145/347642.347763"
    },
    {
      "text": "Andrew Monk and Steve Howard, 1998. The rich picture: a tool for reasoning about work context. interactions 5, 2, 21-30. http://dx.doi.org/10.1145/274430.274434",
      "doi": ""
    },
    {
      "text": "William Lawrence Neuman, 2006. Social research methods: Qualitative and quantitative approaches. Allyn and Bacon, Boston, MA.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman, 2013. The Design of Everyday Things. Basic Books, New York.",
      "doi": "10.5555/2187809"
    },
    {
      "text": "Vanessa Oguamanam, Taneisha Lee, Tom Mcklin, Zane Cochran, Gregory Abowd, and Betsy Disalvo, 2020. Cultural Clash: Exploring How Studio-Based Pedagogy Impacts Learning for Students in HCI Classrooms. In Proceedings of the 2020 ACM on Designing Interactive Systems Conference, ACM, New York, 1131–1142. http://dx.doi.org/10.1145/3357236.3395544",
      "doi": "10.1145/3357236.3395544"
    },
    {
      "text": "John Pruitt and Jonathan Grudin, 2003. Personas: practice and theory. In Conference on Designing for User Experiences (DUX '03), ACM, New York, 1-15. http://dx.doi.org/10.1145/997078.997089",
      "doi": "10.1145/997078.997089"
    },
    {
      "text": "Toni Robertson and Lian Loke, 2009. Designing situations. In Proceedings of the Annual Conference of the Australian Computer-Human Interaction (OZCHI ’09), ACM, New York, 1-8. http://dx.doi.org/10.1145/1738826.1738828",
      "doi": "10.1145/1738826.1738828"
    },
    {
      "text": "Elizabeth B-N Sanders and Pieter Jan Stappers, 2012. Convivial toolbox: Generative research for the front end of design. BIS, Amsterdam.",
      "doi": ""
    },
    {
      "text": "Elizabeth B. N. Sanders and Pieter Jan Stappers, 2014. Probes, toolkits and prototypes: three approaches to making in codesigning. CoDesign 10, 1, 5-14. http://dx.doi.org/10.1080/15710882.2014.888183",
      "doi": ""
    },
    {
      "text": "Donald A Schön, 1984. The reflective practitioner: How professionals think in action. Basic books, New York.",
      "doi": ""
    },
    {
      "text": "Donald A Schön, 1990. The design process. In Varieties of thinking: essays from Harvard's Philosophy of Education Research Center, V. A. Howard Ed. Routledge, New York, 111-141.",
      "doi": ""
    },
    {
      "text": "Donald A Schön, 1992. Designing as reflective conversation with the materials of a design situation. Knowledge-based systems 5, 1, 3-14. http://dx.doi.org/10.1016/0950-7051(92)90020-G",
      "doi": ""
    },
    {
      "text": "Helen Sharp, Yvonne Rogers, and Jennifer Preece, 2019. Interaction Design: Beyond Human-Computer Interaction. Wiley & Sons, Chichester, UK.",
      "doi": ""
    },
    {
      "text": "Jesper Simonsen and Toni Robertson, 2013. Routledge international handbook of participatory design. Routledge, New York.",
      "doi": ""
    },
    {
      "text": "Alessandro Soro, Margot Brereton, Jennyfer Lawrence Taylor, Anita Lee Hong, and Paul Roe, 2016. Cross-Cultural Dialogical Probes. In AfriCHI'16: Proceedings of the First African Conference on Human Computer Interaction, ACM, New York, 114-125. http://dx.doi.org/10.1145/2998581.2998591",
      "doi": "10.1145/2998581.2998591"
    },
    {
      "text": "Alessandro Soro, Jennyfer Lawrence Taylor, and Margot Brereton, 2019. Designing the Past. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems, ACM, New York, Paper alt10. http://dx.doi.org/10.1145/3290607.3310424",
      "doi": ""
    },
    {
      "text": "Jennyfer Lawrence Taylor, 2020. Ngana Wubulku Junkurr-Jiku Balkaway-Ka: The intergenerational co-design of a tangible technology to keep active use of the Kuku Yalanji Aboriginal language strong. PhD thesis. Queensland University of Technology, Brisbane, Australia. http://dx.doi.org/10.5204/thesis.eprints.206447",
      "doi": ""
    },
    {
      "text": "Edward R Tufte, 1983. The visual display of quantitative information. Graphics Press, Cheshire, Conn.",
      "doi": "10.5555/33404"
    },
    {
      "text": "Edward R. Tufte, 1997. Visual explanations: images and quantities, evidence and narrative. Graphics Press, Cheshire, Conn.",
      "doi": "10.5555/248468"
    },
    {
      "text": "Mihaela Vorvoreanu, Colin M. Gray, Paul Parsons, and Nancy Rasche, 2017. Advancing UX Education: A Model for Integrated Studio Pedagogy. In Conference on Human Factors in Computing Systems (CHI ‘17), ACM, New York, 1441–1446. http://dx.doi.org/10.1145/3025453.3025726",
      "doi": "10.1145/3025453.3025726"
    },
    {
      "text": "Lauren Wilcox, Betsy Disalvo, Dick Henneman, and Qiaosi Wang, 2019. Design in the HCI Classroom: Setting a Research Agenda. In Designing Interactive Systems Conference (DIS ’19), ACM, New York, 871–883. http://dx.doi.org/10.1145/3322276.3322381",
      "doi": "10.1145/3322276.3322381"
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi, 2014. Research through design in HCI. In Ways of Knowing in HCI, Judith S Olson and Wendy A Kellogg Eds. Springer, New York, 167-189.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson, 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, New York, 493–502. http://dx.doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}