{
  "doi": "10.1145/3411764.3445673",
  "title": "The Development and Validation of the Technology-Supported Reflection Inventory",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2021,
  "badges": [],
  "abstract": "Reflection is an often addressed design goal in Human-Computer Interaction (HCI) research. An increasing number of artefacts for reflection have been developed in recent years. However, evaluating if and how an interactive technology helps a user reflect is still complex. This makes it difficult to compare artefacts (or prototypes) for reflection, impeding future design efforts. To address this issue, we developed the Technology-Supported Reflection Inventory (TSRI), which is a scale that evaluates how effectively a system supports reflection. We first created a list of possible scale items based on past work in defining reflection. The items were then reviewed by experts. Next, we performed exploratory factor analysis to reduce the scale to its final length of nine items. Subsequently, we confirmed test-retest validity of our instrument, as well as its construct validity. The TSRI enables researchers and practitioners to compare prototypes designed to support reflection.",
  "authors": [
    {
      "name": "Marit Bentvelzen",
      "institution": "Utrecht University, Netherlands",
      "img": "/do/10.1145/contrib-99659680773/rel-imgonly/foto_uu_marit.jpg",
      "acmid": "99659680773",
      "orcid": "0000-0002-0146-8444"
    },
    {
      "name": "Jasmin Niess",
      "institution": "University of Bremen, Germany",
      "img": "/do/10.1145/contrib-99659260376/rel-imgonly/niessj.jpg",
      "acmid": "99659260376",
      "orcid": "0000-0003-3529-0653"
    },
    {
      "name": "Mikołaj P. Woźniak",
      "institution": "Institute of Applied Computer Science Lodz University of Technology, Poland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659462945",
      "orcid": "0000-0001-6404-5169"
    },
    {
      "name": "Paweł W. Woźniak",
      "institution": "Utrecht University, Netherlands",
      "img": "/do/10.1145/contrib-87958813957/rel-imgonly/pawel_cropped.jpg",
      "acmid": "87958813957",
      "orcid": "0000-0003-3670-1813"
    }
  ],
  "references": [
    {
      "text": "Riku Arakawa and Hiromu Yakura. 2020. INWARD: A Computer-Supported Tool for Video-Reflection Improves Efficiency and Effectiveness in Executive Coaching. (2020), 1–13. https://doi.org/10.1145/3313831.3376703",
      "doi": "10.1145/3313831.3376703"
    },
    {
      "text": "Leo C. Aukes, Jelle Geertsma, Janke Cohen-Schotanus, Rein P. Zwierstra, and Joris P.J. Slaets. 2007. The development of a scale to measure personal reflection in medical practice and education. Medical Teacher 29, 2-3 (2007), 177–182. https://doi.org/10.1080/01421590701299272",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Paul Marshall, and Anna L Cox. 2020. Trackly : A Customisable and Pictorial Self-Tracking App to Support Agency in Multiple Sclerosis Self-Care. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2020), 1–15.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer, Sherri Jean Katz, Jill E. Freeman, Phil Adams, Amy L. Gonzales, John Pollak, Daniela Retelny, Jeff Niederdeppe, Christine M. Olson, and Geri K. Gay. 2012. Prescriptive persuasion and open-ended social awareness: Expanding the design space of mobile health. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW (2012), 475–484. https://doi.org/10.1145/2145204.2145279",
      "doi": "10.1145/2145204.2145279"
    },
    {
      "text": "Eric P.S. Baumer, Vera Khovanskaya, Mark Matthews, Lindsay Reynolds, Victoria Schwanda Sosik, and Geri Gay. 2014. Reviewing reflection: On the use of reflection in interactive system design. Proceedings of the Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques, DIS(2014), 93–102. https://doi.org/10.1145/2598510.2598598",
      "doi": "10.1145/2598510.2598598"
    },
    {
      "text": "Eric P S Baumer. 2015. Reflective Informatics: Conceptual Dimensions for Designing Technologies of Reflection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 585–594. https://doi.org/10.1145/2702123.2702234",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Godfred O. Boateng, Torsten B. Neilands, Edward A. Frongillo, Hugo R. Melgar-Quiñonez, and Sera L. Young. 2018. Best Practices for Developing and Validating Scales for Health, Social, and Behavioral Research: A Primer. Frontiers in Public Health 6 (2018). https://doi.org/10.3389/fpubh.2018.00149",
      "doi": ""
    },
    {
      "text": "Andrew John Clayphan, Roberto Martinez-Maldonado, and Judy Kay. 2017. A student-facing dashboard for supporting sensemaking about the brainstorm process at a multi-surface space. ACM International Conference Proceeding Series (2017), 49–58. https://doi.org/10.1145/3152771.3152777",
      "doi": "10.1145/3152771.3152777"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A lived informatics model of personal informatics. UbiComp 2015 - Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(2015), 731–742. https://doi.org/10.1145/2750858.2804250",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Rowanne Fleck and Geraldine Fitzpatrick. 2010. Reflecting on reflection: Framing a design landscape. ACM International Conference Proceeding Series (2010), 216–223. https://doi.org/10.1145/1952222.1952269",
      "doi": "10.1145/1952222.1952269"
    },
    {
      "text": "Anthony M Grant, John Franklin, and Peter Langford. 2002. The Self-Reflection and Insight Scale: A new measure of private self-consciousness. Social Behavior and Personality 30, 8 (2002), 821–836. https://doi.org/10.2224/sbp.2002.30.8.821",
      "doi": ""
    },
    {
      "text": "Stephen N Haynes, David Richard, and Edward S Kubany. 1995. Content validity in psychological assessment: A functional approach to concepts and methods.Psychological assessment 7, 3 (1995), 238.",
      "doi": ""
    },
    {
      "text": "Ellen Isaacs, Artie Konrad, Alan Walendowski, Thomas Lennig, Victoria Hollis, and Steve Whittaker. 2013. Echoes from the past: How technology mediated reflection improves well-being. Conference on Human Factors in Computing Systems - Proceedings (2013), 1071–1080. https://doi.org/10.1145/2470654.2466137",
      "doi": "10.1145/2470654.2466137"
    },
    {
      "text": "Terry K. Koo and Mae Y. Li. 2016. A Guideline of Selecting and Reporting Intraclass Correlation Coefficients for Reliability Research. Journal of Chiropractic Medicine 15, 2 (2016), 155 – 163. https://doi.org/10.1016/j.jcm.2016.02.012",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A Stage-Based Model of Personal Informatics Systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). Association for Computing Machinery, New York, NY, USA, 557–566. https://doi.org/10.1145/1753326.1753409",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Nicola Marsden. 2013. Attitudes towards Online Communication: An Exploratory Factor Analysis. In Proceedings of the 2013 Annual Conference on Computers and People Research(SIGMIS-CPR ’13). Association for Computing Machinery, New York, NY, USA, 147–152. https://doi.org/10.1145/2487294.2487326",
      "doi": "10.1145/2487294.2487326"
    },
    {
      "text": "Kenya Mejia and Svetlana Yarosh. 2017. A Nine-Item Questionnaire for Measuring the Social Disfordance of Mediated Social Touch Technologies. Proc. ACM Hum.-Comput. Interact. 1, CSCW (12 2017). https://doi.org/10.1145/3134712",
      "doi": "10.1145/3134712"
    },
    {
      "text": "Ine Mols, Elise Van Den Hoven, and Berry Eggen. 2016. Informing design for reflection: An overview of current everyday practices. ACM International Conference Proceeding Series 23-27-Octo (2016). https://doi.org/10.1145/2971485.2971494",
      "doi": "10.1145/2971485.2971494"
    },
    {
      "text": "Ine Mols, Elise Van Den Hoven, and Berry Eggen. 2020. Everyday life reflection: Exploring media interaction with balance, cogito & dott. TEI 2020 - Proceedings of the 14th International Conference on Tangible, Embedded, and Embodied Interaction(2020), 67–79. https://doi.org/10.1145/3374920.3374928",
      "doi": "10.1145/3374920.3374928"
    },
    {
      "text": "Jennifer Moon. 1999. Reflection in learning & professional development. RoutledgeFalmer, New York, NY, USA. 229 pages. https://doi.org/10.4324/9780203822296",
      "doi": ""
    },
    {
      "text": "Jasmin Niess and Paweł W. Woźniak. 2018. Supporting meaningful personal fitness: The tracker goal Evolution Model. Conference on Human Factors in Computing Systems - Proceedings 2018-April (2018), 1–12. https://doi.org/10.1145/3173574.3173745",
      "doi": "10.1145/3173574.3173745"
    },
    {
      "text": "Pablo Ortiz and D. Fox Harrell. 2018. Enabling critical self-reflection through roleplay with chimeria:Grayscale. CHI PLAY 2018 - Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play(2018), 365–380. https://doi.org/10.1145/3242671.3242687",
      "doi": ""
    },
    {
      "text": "Verónica Rivera-Pelayo, Angela Fessl, Lars Müller, and Viktoria Pammer. 2017. Introducing Mood Self-Tracking at Work. ACM Transactions on Computer-Human Interaction 24, 1(2017), 1–28. https://doi.org/10.1145/3014058",
      "doi": "10.1145/3014058"
    },
    {
      "text": "Donald A. Schön. 1983. The Reflective Practitioner. https://doi.org/10.1542/peds.2005-0209",
      "doi": ""
    },
    {
      "text": "Petr Slovak, Chris Frauenberger, and Geraldine Fitzpatrick. 2017. Reflective practicum: A framework of sensitising concepts to design for transformative reflection. Conference on Human Factors in Computing Systems - Proceedings 2017-May (2017), 2696–2707. https://doi.org/10.1145/3025453.3025516",
      "doi": "10.1145/3025453.3025516"
    },
    {
      "text": "Hyewon Suh, Nina Shahriaree, Eric B. Hekler, and Julie A. Kientz. 2016. Developing and Validating the User Burden Scale: A Tool for Assessing User Burden in Computing Systems. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3988–3999. https://doi.org/10.1145/2858036.2858448",
      "doi": "10.1145/2858036.2858448"
    },
    {
      "text": "Anja Thieme, Rob Comber, Julia Miebach, Jack Weeden, Nicole Krämer, Shaun Lawson, and Patrick Olivier. 2012. ”we’ve bin watching you” - Designing for reflection and social persuasion to promote sustainable lifestyles. Conference on Human Factors in Computing Systems - Proceedings (2012), 2337–2346. https://doi.org/10.1145/2207676.2208394",
      "doi": "10.1145/2207676.2208394"
    },
    {
      "text": "Gustavo F Tondello, Rina R Wehbe, Lisa Diamond, Marc Busch, Andrzej Marczewski, and Lennart E Nacke. 2016. The Gamification User Types Hexad Scale. In Proceedings of the 2016 Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’16). Association for Computing Machinery, New York, NY, USA, 229–243. https://doi.org/10.1145/2967934.2968082",
      "doi": "10.1145/2967934.2968082"
    },
    {
      "text": "Nina Valkanova, Sergi Jorda, Martin Tomitsch, and Andrew Vande Moere. 2013. Reveal-It! The Impact of a Social Visualization Projection on Public Awareness and Discourse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 3461–3470. https://doi.org/10.1145/2470654.2466476",
      "doi": "10.1145/2470654.2466476"
    },
    {
      "text": "Andrew M Webb, Rhema Linder, Andruid Kerne, Nic Lupfer, Yin Qu, Bryant Poffenberger, and Colton Revia. 2013. Promoting Reflection and Interpretation in Education: Curating Rich Bookmarks as Information Composition. In Proceedings of the 9th ACM Conference on Creativity & Cognition(C&C ’13). Association for Computing Machinery, New York, NY, USA, 53–62. https://doi.org/10.1145/2466627.2466636",
      "doi": "10.1145/2466627.2466636"
    },
    {
      "text": "Svetlana Yarosh, Panos Markopoulos, and Gregory D. Abowd. 2014. Towards a Questionnaire for Measuring Affective Benefits and Costs of Communication Technologies. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 84–96. https://doi.org/10.1145/2531602.2531634",
      "doi": "10.1145/2531602.2531634"
    }
  ]
}