{
  "doi": "10.1145/3411764.3445526",
  "title": "AutoDS: Towards Human-Centered Automation of Data Science",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Data science (DS) projects often follow a lifecycle that consists of laborious tasks for data scientists and domain experts (e.g., data exploration, model training, etc.). Only till recently, machine learning(ML) researchers have developed promising automation techniques to aid data workers in these tasks. This paper introduces AutoDS, an automated machine learning (AutoML) system that aims to leverage the latest ML automation techniques to support data science projects. Data workers only need to upload their dataset, then the system can automatically suggest ML configurations, preprocess data, select algorithm, and train the model. These suggestions are presented to the user via a web-based graphical user interface and a notebook-based programming user interface. Our goal is to offer a systematic investigation of user interaction and perceptions of using an AutoDS system in solving a data science task. We studied AutoDS with 30 professional data scientists, where one group used AutoDS, and the other did not, to complete a data science project. As expected, AutoDS improves productivity; Yet surprisingly, we find that the models produced by the AutoDS group have higher quality and less errors, but lower human confidence scores. We reflect on the findings by presenting design implications for incorporating automation techniques into human work in the data science lifecycle.",
  "authors": [
    {
      "name": "Dakuo Wang",
      "institution": "IBM Research, United States",
      "img": "/do/10.1145/contrib-99658707626/rel-imgonly/dakuo_wang.jpg",
      "acmid": "99658707626",
      "orcid": "0000-0001-9371-9441"
    },
    {
      "name": "Josh Andres",
      "institution": "IBM Research Australia, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658744130",
      "orcid": "missing"
    },
    {
      "name": "Justin D. Weisz",
      "institution": "IBM Research AI, United States",
      "img": "/do/10.1145/contrib-81311482644/rel-imgonly/jweisz-20-sm.jpg",
      "acmid": "81311482644",
      "orcid": "missing"
    },
    {
      "name": "Erick Oduor",
      "institution": "IBM Research Africa, Kenya",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548358456",
      "orcid": "missing"
    },
    {
      "name": "Casey Dugan",
      "institution": "IBM Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81340488769",
      "orcid": "0000-0002-1508-2091"
    }
  ],
  "references": [
    {
      "text": "Saleema Amershi, Maya Cakmak, William Bradley Knox, and Todd Kulesza. 2014. Power to the people: The role of humans in interactive machine learning. AI Magazine 35, 4 (2014), 105–120.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, 2019. Guidelines for human-AI interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 3.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Stuart Armstrong and Kaj Sotala. 2015. How we’re predicting AI–or failing to. In Beyond artificial intelligence. Springer, 11–29.",
      "doi": ""
    },
    {
      "text": "David Bayles and Ted Orland. 2001. Art & fear: Observations on the perils (and rewards) of artmaking. Image Continuum Press.",
      "doi": ""
    },
    {
      "text": "Catherine L Blake and Christopher J Merz. 1998. UCI repository of machine learning databases, 1998.",
      "doi": ""
    },
    {
      "text": "Murray Campbell, A Joseph Hoane Jr, and Feng-hsiung Hsu. 2002. Deep blue. Artificial intelligence 134, 1-2 (2002), 57–83.",
      "doi": ""
    },
    {
      "text": "Houston Claure, Yifang Chen, Jignesh Modi, Malte Jung, and Stefanos Nikolaidis. 2019. Reinforcement Learning with Fairness Constraints for Resource Distribution in Human-Robot Teams. arXiv preprint arXiv:1907.00313(2019).",
      "doi": ""
    },
    {
      "text": "Justin Cranshaw, Emad Elwany, Todd Newman, Rafal Kocielnik, Bowen Yu, Sandeep Soni, Jaime Teevan, and Andrés Monroy-Hernández. 2017. Calendar. help: Designing a workflow-based scheduling agent with humans in the loop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 2382–2393.",
      "doi": "10.1145/3025453.3025780"
    },
    {
      "text": "Tommy Dang, Fang Jin, 2018. Predict saturated thickness using tensorboard visualization. In Proceedings of the Workshop on Visualisation in Environmental Sciences. Eurographics Association, 35–39.",
      "doi": ""
    },
    {
      "text": "DataRobot. [n.d.]. Automated Machine Learning for Predictive Modeling. Retrieved 3-April-2019 from https://www.datarobot.com/",
      "doi": ""
    },
    {
      "text": "David Donoho. 2017. 50 years of data science. Journal of Computational and Graphical Statistics 26, 4(2017), 745–766.",
      "doi": ""
    },
    {
      "text": "Paul Dourish and Victoria Bellotti. 1992. Awareness and coordination in shared workspaces.. In CSCW, Vol. 92. 107–114.",
      "doi": ""
    },
    {
      "text": "Jaimie et al. Drozdal. 2020. Exploring Information Needs for Establishing Trust in Automated Data Science Systems. In IUI’20. ACM, in press.",
      "doi": ""
    },
    {
      "text": "EpistasisLab. [n.d.]. tpot. Retrieved 3-April-2019 from https://github.com/EpistasisLab/tpot",
      "doi": ""
    },
    {
      "text": "Thomas Erickson and Wendy A Kellogg. 2000. Social translucence: an approach to designing systems that support social processes. ACM transactions on computer-human interaction (TOCHI) 7, 1(2000), 59–83.",
      "doi": ""
    },
    {
      "text": "Matthias Feurer, Aaron Klein, Katharina Eggensperger, Jost Springenberg, Manuel Blum, and Frank Hutter. 2015. Efficient and robust automated machine learning. In Advances in Neural Information Processing Systems. 2962–2970.",
      "doi": ""
    },
    {
      "text": "Darren Gergle and Desney S Tan. 2014. Experimental research in HCI. In Ways of Knowing in HCI. Springer, 191–227.",
      "doi": ""
    },
    {
      "text": "Yolanda Gil, James Honaker, Shikhar Gupta, Yibo Ma, Vito D’Orazio, Daniel Garijo, Shruti Gadewar, Qifan Yang, and Neda Jahanshad. 2019. Towards human-guided machine learning. In Proceedings of the 24th International Conference on Intelligent User Interfaces. ACM, 614–624.",
      "doi": "10.1145/3301275.3302324"
    },
    {
      "text": "Google. [n.d.]. Cloud AutoML. Retrieved 3-April-2019 from https://cloud.google.com/automl/",
      "doi": ""
    },
    {
      "text": "Google. [n.d.]. Colaboratory. Retrieved 3-April-2019 from https://colab.research.google.com",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin. 2009. AI and HCI: Two fields divided by a common focus. Ai Magazine 30, 4 (2009), 48–48.",
      "doi": ""
    },
    {
      "text": "Philip J Guo, Sean Kandel, Joseph M Hellerstein, and Jeffrey Heer. 2011. Proactive wrangling: mixed-initiative end-user programming of data transformation scripts. In Proceedings of the 24th annual ACM symposium on User interface software and technology. ACM, 65–74.",
      "doi": "10.1145/2047196.2047205"
    },
    {
      "text": "H2O. [n.d.]. H2O. Retrieved 3-April-2019 from https://h2o.ai",
      "doi": ""
    },
    {
      "text": "Yihui He, Ji Lin, Zhijian Liu, Hanrui Wang, Li-Jia Li, and Song Han. 2018. Amc: Automl for model compression and acceleration on mobile devices. In Proceedings of the European Conference on Computer Vision (ECCV). 784–800.",
      "doi": "10.1007/978-3-030-01234-2_48"
    },
    {
      "text": "Jeffrey Heer and Ben Shneiderman. 2012. Interactive dynamics for visual analysis. Queue 10, 2 (2012), 30.",
      "doi": "10.1145/2133416.2146416"
    },
    {
      "text": "Jeffrey Heer, Fernanda B Viégas, and Martin Wattenberg. 2007. Voyagers and voyeurs: supporting asynchronous collaborative information visualization. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 1029–1038.",
      "doi": "10.1145/1240624.1240781"
    },
    {
      "text": "Robert R Hoffman, Shane T Mueller, Gary Klein, and Jordan Litman. 2018. Metrics for explainable AI: Challenges and prospects. arXiv preprint arXiv:1812.04608(2018).",
      "doi": ""
    },
    {
      "text": "Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 159–166.",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Youyang Hou and Dakuo Wang. 2017. Hacking with NPOs: collaborative analytics and broker roles in civic data hackathons. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 53.",
      "doi": "10.1145/3134688"
    },
    {
      "text": "Project Jupyter. [n.d.]. Jupyter Notebook. Retrieved 3-April-2019 from https://jupyter.org",
      "doi": ""
    },
    {
      "text": "Project Jupyter. [n.d.]. JupyterLab. https://www.github.com/jupyterlab/jupyterlab",
      "doi": ""
    },
    {
      "text": "Kaggle. 2017. The State of Data Science & Machine Learning. https://www.kaggle.com/kaggle/kaggle-survey-2017",
      "doi": ""
    },
    {
      "text": "Kaggle. 2018. Kaggle Data Science Survey 2018. Retrieved 17-September-2019 from https://www.kaggle.com/sudhirnl7/data-science-survey-2018/",
      "doi": ""
    },
    {
      "text": "Sean Kandel, Andreas Paepcke, Joseph Hellerstein, and Jeffrey Heer. 2011. Wrangler: Interactive visual specification of data transformation scripts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3363–3372.",
      "doi": "10.1145/1978942.1979444"
    },
    {
      "text": "James Max Kanter and Kalyan Veeramachaneni. 2015. Deep feature synthesis: Towards automating data science endeavors. In 2015 IEEE International Conference on Data Science and Advanced Analytics (DSAA). IEEE, 1–10.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Shwetak N Patel, and Julie A Kientz. 2015. How good is 85%? A survey tool to connect classifier evaluation to acceptability of accuracy. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 347–356.",
      "doi": ""
    },
    {
      "text": "Mary Beth Kery, Marissa Radensky, Mahima Arya, Bonnie E John, and Brad A Myers. 2018. The story in the notebook: Exploratory data science using a literate programming tool. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 174.",
      "doi": "10.1145/3173574.3173748"
    },
    {
      "text": "Udayan Khurana, Deepak Turaga, Horst Samulowitz, and Srinivasan Parthasrathy. 2016. Cognito: Automated feature engineering for supervised learning. In 2016 IEEE 16th International Conference on Data Mining Workshops (ICDMW). IEEE, 1304–1307.",
      "doi": ""
    },
    {
      "text": "Peter Krensky, Pieter den Harner, Erick Brethenoux, Jim Hare, Svetlana Sicular, and Shubhangi Vashisth. 2020. Magic Quadrant for data science and machine-learning platforms. Gartner, Inc (2020).",
      "doi": ""
    },
    {
      "text": "Hoang Thanh Lam, Johann-Michael Thiebaut, Mathieu Sinn, Bei Chen, Tiep Mai, and Oznur Alkan. 2017. One button machine for automating feature engineering in relational databases. arXiv preprint arXiv:1706.00327(2017).",
      "doi": ""
    },
    {
      "text": "Doris Jung-Lin Lee, Stephen Macke, Doris Xin, Angela Lee, Silu Huang, and Aditya Parameswaran. 2019. A Human-in-the-loop Perspective on AutoML: Milestones and the Road Ahead. Data Engineering (2019), 58.",
      "doi": ""
    },
    {
      "text": "Fei-Fei Li. 2018. How to Make A.I. That’s Good for People. The New York Times (7 March 2018). Retrieved 3-April-2019 from https://www.nytimes.com/2018/03/07/opinion/artificial-intelligence-human.html",
      "doi": ""
    },
    {
      "text": "Sijia Liu, Parikshit Ram, Deepak Vijaykeerthy, Djallel Bouneffouf, Gregory Bramble, Horst Samulowitz, Dakuo Wang, Andrew Conn, and Alexander G Gray. 2020. An ADMM Based Framework for AutoML Pipeline Configuration.. In AAAI. 4892–4899.",
      "doi": ""
    },
    {
      "text": "Yaoli Mao, Dakuo Wang, Michael Muller, Kush Varshney, Ioana Baldini, Casey Dugan, and Aleksandra Mojsilovic. 2020. How Data Scientists Work Together With Domain Experts in Scientific Collaborations. In Proceedings of the 2020 ACM conference on GROUP. ACM.",
      "doi": ""
    },
    {
      "text": "John Markoff. 2011. Computer wins on jeopardy!: trivial, it is not. New York Times 16(2011).",
      "doi": ""
    },
    {
      "text": "John H McDonald. 2009. Handbook of biological statistics. Vol. 2. sparky house publishing Baltimore, MD.",
      "doi": ""
    },
    {
      "text": "Jeremy Miles and Mark Shevlin. 2001. Applying regression and correlation: A guide for students and researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Michael Muller, Ingrid Lange, Dakuo Wang, David Piorkowski, Jason Tsay, Q. Vera Liao, Casey Dugan, and Thomas Erickson. 2019. How Data Science Workers Work with Data: Discovery, Capture, Curation, Design, Creation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, UK) (CHI ’19). ACM, New York, NY, USA, Forthcoming.",
      "doi": "10.1145/3290605.3300356"
    },
    {
      "text": "Clifford Nass, Jonathan Steuer, and Ellen R Tauber. 1994. Computers are social actors. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 72–78.",
      "doi": "10.1145/191666.191703"
    },
    {
      "text": "Randal S Olson and Jason H Moore. 2016. TPOT: A tree-based pipeline optimization tool for automating machine learning. In Workshop on Automatic Machine Learning. 66–74.",
      "doi": ""
    },
    {
      "text": "Fabian Pedregosa, Gaël Varoquaux, Alexandre Gramfort, Vincent Michel, Bertrand Thirion, Olivier Grisel, Mathieu Blondel, Peter Prettenhofer, Ron Weiss, Vincent Dubourg, 2011. Scikit-learn: Machine learning in Python. Journal of machine learning research 12, Oct (2011), 2825–2830.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "David Piorkowski, Soya Park, April Yi Wang, Dakuo Wang, Michael Muller, and Felix Portnoy. 2021. How AI Developers Overcome Communication Challenges in a Multidisciplinary Team: A Case Study. In Proceedings of the CSCW 2021.",
      "doi": "10.1145/3449205"
    },
    {
      "text": "Tye Rattenbury, Joseph M Hellerstein, Jeffrey Heer, Sean Kandel, and Connor Carreras. 2017. Principles of data wrangling: Practical techniques for data preparation. ” O’Reilly Media, Inc.”.",
      "doi": ""
    },
    {
      "text": "Quentin Roy, Futian Zhang, and Daniel Vogel. 2019. Automation accuracy is good, but high controllability may be better. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3290605.3300750"
    },
    {
      "text": "Armand Ruiz. 2017. The 80/20 data science dilemma. InfoWorld (2017).",
      "doi": ""
    },
    {
      "text": "Katharine Schwab. 2018. Google’s Rules For Designers Working With AI. https://www.fastcompany.com/90132700/googles-rules-for-designing-ai-that-isnt-evil",
      "doi": ""
    },
    {
      "text": "Ameneh Shamekhi, Q Vera Liao, Dakuo Wang, Rachel KE Bellamy, and Thomas Erickson. 2018. Face Value? Exploring the effects of embodiment for a group facilitation agent. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 391.",
      "doi": "10.1145/3173574.3173965"
    },
    {
      "text": "Ben Shneiderman and Pattie Maes. 1997. Direct manipulation vs. interface agents. interactions 4, 6 (1997), 42–61.",
      "doi": ""
    },
    {
      "text": "Matt Simon. 2018. Forget the Robot Singularity Apocalypse. Let’s Talk About the Multiplicity. https://www.wired.com/story/forget-the-robot-singularity-apocalypse-lets-talk-about-the-multiplicity/",
      "doi": ""
    },
    {
      "text": "Jennifer Sukis. 2019. AI Design & Practices Guidelines. https://medium.com/design-ibm/ai-design-guidelines-e06f7e92d864",
      "doi": ""
    },
    {
      "text": "Charles Sutton, Timothy Hobson, James Geddes, and Rich Caruana. 2018. Data diff: Interpretable, executable summaries of changes in distributions for data wrangling. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. ACM, 2279–2288.",
      "doi": "10.1145/3219819.3220057"
    },
    {
      "text": "Haodan Tan, Dakuo Wang, and Selma Sabanovic. 2018. Projecting Life Onto Robots: The Effects of Cultural Factors and Design Type on Multi-Level Evaluations of Robot Anthropomorphism. In 2018 27th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 129–136.",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Q. Vera Liao, Yunfeng Zhang, Udayan Khurana, Horst Samulowitz, Soya Park, Michael Muller, and Lisa Amini. 2021. How Much Automation Does a Data Scientist Want?. In pre-print.",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Liuping Wang, Zhan Zhang, Ding Wang, Haiyi Zhu, Yvonne Gao, Xiangmin Fan, and Feng Tian. 2021. Brilliant AI Doctor in Rural China: Tensions and Challenges in AI-Powered CDSS Deployment. In Proceedings of the CHI 2021.",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Justin D. Weisz, Michael Muller, Parikshit Ram, Werner Geyer, Casey Dugan, Yla Tausczik, Horst Samulowitz, and Alexander Gray. 2019. Human-AI Collaboration in Data Science: Exploring Data Scientists’ Perceptions of Automated AI. To appear in Computer Supported Cooperative Work (CSCW) (2019).",
      "doi": ""
    },
    {
      "text": "Fei-Yue Wang, Jun Jason Zhang, Xinhu Zheng, Xiao Wang, Yong Yuan, Xiaoxiao Dai, Jie Zhang, and Liuqing Yang. 2016. Where does AlphaGo go: From church-turing thesis to AlphaGo thesis and beyond. IEEE/CAA Journal of Automatica Sinica 3, 2 (2016), 113–120.",
      "doi": ""
    },
    {
      "text": "Qianwen Wang, Yao Ming, Zhihua Jin, Qiaomu Shen, Dongyu Liu, Micah J Smith, Kalyan Veeramachaneni, and Huamin Qu. 2019. Atmseer: Increasing transparency and controllability in automated machine learning. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 681.",
      "doi": "10.1145/3290605.3300911"
    },
    {
      "text": "Daniel Karl I Weidele, Justin D Weisz, Erick Oduor, Michael Muller, Josh Andres, Alexander Gray, and Dakuo Wang. 2020. AutoAIViz: opening the blackbox of automated artificial intelligence with conditional parallel coordinates. In Proceedings of the 25th International Conference on Intelligent User Interfaces. 308–312.",
      "doi": "10.1145/3377325.3377538"
    },
    {
      "text": "Ying Xu, Dakuo Wang, Penelope Collins, Hyelim Lee, and Mark Warschauer. [n.d.]. Same benefits, different communication patterns: Comparing Children’s reading with a conversational agent vs. a human partner. Computers & Education 161 ([n. d.]), 104059.",
      "doi": ""
    },
    {
      "text": "Amy X Zhang, Michael Muller, and Dakuo Wang. 2020. How do data science workers collaborate? roles, workflows, and tools. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–23.",
      "doi": "10.1145/3392826"
    },
    {
      "text": "Marc-André Zöller and Marco F Huber. 2019. Survey on Automated Machine Learning. arXiv preprint arXiv:1904.12054(2019).",
      "doi": ""
    }
  ]
}