{
  "doi": "10.1145/3411764.3445243",
  "title": "Large Scale Analysis of Multitasking Behavior During Remote Meetings",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Virtual meetings are critical for remote work because of the need for synchronous collaboration in the absence of in-person interactions. In-meeting multitasking is closely linked to people’s productivity and wellbeing. However, we currently have limited understanding of multitasking in remote meetings and its potential impact. In this paper, we present what we believe is the most comprehensive study of remote meeting multitasking behavior through an analysis of a large-scale telemetry dataset collected from February to May 2020 of U.S. Microsoft employees and a 715-person diary study. Our results demonstrate that intrinsic meeting characteristics such as size, length, time, and type, significantly correlate with the extent to which people multitask, and multitasking can lead to both positive and negative outcomes. Our findings suggest important best-practice guidelines for remote meetings (e.g., avoid important meetings in the morning) and design implications for productivity tools (e.g., support positive remote multitasking).",
  "tags": [
    "meeting",
    "Multitasking",
    "remote work",
    "collaboration"
  ],
  "authors": [
    {
      "name": "Hancheng Cao",
      "institution": "Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659254782",
      "orcid": "0000-0001-7231-1076"
    },
    {
      "name": "Chia-Jung Lee",
      "institution": "Microsoft, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659345865",
      "orcid": "missing"
    },
    {
      "name": "Shamsi Iqbal",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Mary Czerwinski",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81100280834/rel-imgonly/marycz.jpg",
      "acmid": "81100280834",
      "orcid": "0000-0003-0881-401X"
    },
    {
      "name": "Priscilla N Y Wong",
      "institution": "UCL Interaction Centre, United Kingdom",
      "img": "/do/10.1145/contrib-99659210505/rel-imgonly/me.jpg",
      "acmid": "99659210505",
      "orcid": "missing"
    },
    {
      "name": "Sean Rintel",
      "institution": "Microsoft, United States",
      "img": "/do/10.1145/contrib-81556330456/rel-imgonly/sr-apr2015-100x100.jpg",
      "acmid": "81556330456",
      "orcid": "missing"
    },
    {
      "name": "Brent Hecht",
      "institution": "Microsoft, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350577456",
      "orcid": "missing"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft, United States",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    },
    {
      "name": "Longqi Yang",
      "institution": "Microsoft, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658743067",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adam D’Angelo. [n.d.]. Remote First at Quora. https://www.quora.com/q/quora/Remote-First-at-Quora",
      "doi": ""
    },
    {
      "text": "Rachel F. Adler and Raquel Benbunan-Fich. 2013. Self-Interruptions in Discretionary Multitasking. Comput. Hum. Behav. 29, 4 (July 2013), 1441–1449. https://doi.org/10.1016/j.chb.2013.01.040",
      "doi": ""
    },
    {
      "text": "Tammy D Allen, Timothy D Golden, and Kristen M Shockley. 2015. How effective is telecommuting? Assessing the status of our scientific findings. Psychological Science in the Public Interest 16, 2 (2015), 40–68.",
      "doi": ""
    },
    {
      "text": "Erik Altmann and J. Trafton. 2004. Task Interruption: Resumption Lag and the Role of Cues. Proceedings of the 26th Annual Conference of the Cognitive Science Society (07 2004).",
      "doi": ""
    },
    {
      "text": "B. Bailey and J. Konstan. 2006. On the need for attention-aware systems: Measuring effects of interruption on task performance, error rate, and affective state. Comput. Hum. Behav. 22(2006), 685–708.",
      "doi": ""
    },
    {
      "text": "Louise Barkhuus. 2005. ”Bring Your Own Laptop Unless You Want to Follow the Lecture”: Alternative Communication in the Classroom. In Proceedings of the 2005 International ACM SIGGROUP Conference on Supporting Group Work (Sanibel Island, Florida, USA) (GROUP ’05). Association for Computing Machinery, New York, NY, USA, 140–143. https://doi.org/10.1145/1099203.1099230",
      "doi": "10.1145/1099203.1099230"
    },
    {
      "text": "Nicholas Bloom, James Liang, John Roberts, and Zhichun Jenny Ying. 2015. Does working from home work? Evidence from a Chinese experiment. The Quarterly Journal of Economics 130, 1 (2015), 165–218.",
      "doi": ""
    },
    {
      "text": "Maria Brandimonte, Gilles O Einstein, and Mark A McDaniel. 1996. Prospective memory : theory and applications. Mahwah, N.J. : L. Erlbaum.",
      "doi": ""
    },
    {
      "text": "Erik Brynjolfsson, John J Horton, Adam Ozimek, Daniel Rock, Garima Sharma, and Hong-Yi TuYe. 2020. Covid-19 and remote work: An early look at US data. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Hancheng Cao, Zhilong Chen, Mengjie Cheng, Shuling Zhao, Tao Wang, and Yong Li. 2020. You Recommend, I Buy: How and Why People Engage in Instant Messaging Based Social Commerce. arXiv preprint arXiv:2011.00191(2020).",
      "doi": ""
    },
    {
      "text": "Hancheng Cao, Zhilong Chen, Fengli Xu, Tao Wang, Yujian Xu, Lianglun Zhang, and Yong Li. 2020. When Your Friends Become Sellers: An Empirical Study of Social Commerce Site Beidian. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 14. 83–94.",
      "doi": ""
    },
    {
      "text": "Hancheng Cao, Vivian Yang, Victor Chen, Yu Jin Lee, Lydia Stone, N’godjigui Junior Diarrassouba, Mark E. Whiting, and Michael S. Bernstein. 2020. My Team Will Go On: Differentiating High and Low Viability Teams through Team Interaction. Proc. ACM Hum.-Comput. Interact. 4, CSCW3, Article 230 (2020), 27 pages. https://doi.org/10.1145/3432929",
      "doi": ""
    },
    {
      "text": "Zhilong Chen, Hancheng Cao, Yuting Deng, Xuan Gao, Jinghua Piao, Fengli Xu, Yu Zhang, and Yong Li. 2020. A Large-Scale Mixed-Methods Analysis of Live Streaming Based Remote Education Experience in Chinese Colleges During the COVID-19 Pandemic. arXiv preprint arXiv:2010.01662(2020).",
      "doi": ""
    },
    {
      "text": "Zhilong Chen, Hancheng Cao, Fengli Xu, Mengjie Cheng, Tao Wang, and Yong Li. 2020. Understanding the Role of Intermediaries in Online Social E-commerce: An Exploratory Study of Beidian. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–24.",
      "doi": "10.1145/3415185"
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of qualitative research: Techniques and procedures for developing grounded theory. Sage publications.",
      "doi": ""
    },
    {
      "text": "Juliet M Corbin and Anselm Strauss. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative sociology 13, 1 (1990), 3–21.",
      "doi": ""
    },
    {
      "text": "Edward Cutrell, Mary Czerwinski, and Eric Horvitz. 2000. Notification, Disruption, and Memory: Effects of Messaging Interruptions on Memory and Performance. (12 2000).",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proceedings of the SIGCHI conference on Human factors in computing systems. 175–182.",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Laura Dabbish and Robert Kraut. 2003. Coordinating Communication: Awareness Displays and Interruption. 786–787. https://doi.org/10.1145/765891.765991",
      "doi": ""
    },
    {
      "text": "Laura Dabbish, Gloria Mark, and Víctor M. González. 2011. Why Do i Keep Interrupting Myself? Environment, Habit and Self-Interruption. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 3127–3130. https://doi.org/10.1145/1978942.1979405",
      "doi": "10.1145/1978942.1979405"
    },
    {
      "text": "Maitraye Das, John Tang, Kathryn E. Ringland, and Anne Marie Piper. 2021. Towards Accessible Remote Work: Understanding the Practices of Neurodivergent Professionals in Working from Home. Proceedings of the ACM on Human-Computer Interaction (CSCW 2021) (Oct. 2021).",
      "doi": ""
    },
    {
      "text": "Evan DeFilippis, Stephen Michael Impink, Madison Singell, Jeffrey T Polzer, and Raffaella Sadun. 2020. Collaborating during coronavirus: The impact of COVID-19 on the nature of work. NBER Working Paperw27612(2020).",
      "doi": ""
    },
    {
      "text": "Sante Delle-Vergini. 2018. Missing in Action: Implications for the management of employees working from home in the Philippines’ BPO industry. (2018).",
      "doi": ""
    },
    {
      "text": "Jonathan I Dingel and Brent Neiman. 2020. How many jobs can be done at home?Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Susan Dumais, Robin Jeffries, Daniel M Russell, Diane Tang, and Jaime Teevan. 2014. Understanding user behavior through log data and analysis. In Ways of Knowing in HCI. Springer, 349–372.",
      "doi": ""
    },
    {
      "text": "Elias Eriksson and Arpine Petrosian. 2020. Remote Work-Transitioning to Remote Work in Times of Crisis.",
      "doi": ""
    },
    {
      "text": "Victor M González and Gloria Mark. 2004. ” Constant, constant, multi-tasking craziness” managing multiple working spheres. In Proceedings of the SIGCHI conference on Human factors in computing systems. 113–120.",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Victor M. González and Gloria Mark. 2004. ”Constant, Constant, Multi-Tasking Craziness”: Managing Multiple Working Spheres. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vienna, Austria) (CHI ’04). Association for Computing Machinery, New York, NY, USA, 113–120. https://doi.org/10.1145/985692.985707",
      "doi": ""
    },
    {
      "text": "Helen Ai He and Elaine M Huang. 2014. A qualitative study of workplace intercultural communication tensions in dyadic face-to-face and computer-mediated interactions. In Proceedings of the 2014 conference on Designing interactive systems. 415–424.",
      "doi": "10.1145/2598510.2598594"
    },
    {
      "text": "H. Hembrooke and G. Gay. 2003. The laptop and the lecture: The effects of multitasking in learning environments. Journal of Computing in Higher Education 15 (2003), 46–64.",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal, Jonathan Grudin, and Eric Horvitz. 2011. Peripheral Computing during Presentations: Perspectives on Costs and Preferences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 891–894. https://doi.org/10.1145/1978942.1979073",
      "doi": "10.1145/1978942.1979073"
    },
    {
      "text": "Shamsi T Iqbal and Eric Horvitz. 2007. Disruption and recovery of computing tasks: field study, analysis, and directions. In Proceedings of the SIGCHI conference on Human factors in computing systems. 677–686.",
      "doi": "10.1145/1240624.1240730"
    },
    {
      "text": "Jon M Jachimowicz, Julia Lee Cunningham, Bradley R Staats, Francesca Gino, and Jochen I Menges. 2020. Between home and work: commuting as an opportunity for role transitions. Organization Science(2020).",
      "doi": ""
    },
    {
      "text": "Jennifer Christie. [n.d.]. Keeping our employees and partners safe during #coronavirus. https://blog.twitter.com/en_us/topics/company/2020/keeping-our-employees-and-partners-safe-during-coronavirus.html",
      "doi": ""
    },
    {
      "text": "Amy K Karlson, Shamsi T Iqbal, Brian Meyers, Gonzalo Ramos, Kathy Lee, and John C Tang. 2010. Mobile taskflow in context: a screenshot study of smartphone usage. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2009–2018.",
      "doi": "10.1145/1753326.1753631"
    },
    {
      "text": "Anastasia Kuzminykh and Sean Rintel. 2020. Low Engagement As a Deliberate Practice of Remote Participants in Video Meetings. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3334480.3383080"
    },
    {
      "text": "Katharina Lix, Amir Goldberg, Sameer Srivastava, and Melissa A Valentine. 2020. Timing Differences: Discursive Diversity and Team Performance. SocArXiv. June 12(2020).",
      "doi": ""
    },
    {
      "text": "Kevin P Madore, Anna M Khazenzon, Cameron W Backes, Jiefeng Jiang, Melina R Uncapher, Anthony M Norcia, and Anthony D Wagner. 2020. Memory failure predicted by attention lapsing and media multitasking. Nature 587, 7832 (2020), 87–91.",
      "doi": ""
    },
    {
      "text": "Paul P. Maglio and Christopher S. Campbell. 2000. Tradeoffs in Displaying Peripheral Information. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI ’00). Association for Computing Machinery, New York, NY, USA, 241–248. https://doi.org/10.1145/332040.332438",
      "doi": "10.1145/332040.332438"
    },
    {
      "text": "Gloria Mark, Victor M. Gonzalez, and Justin Harris. 2005. No Task Left behind? Examining the Nature of Fragmented Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Portland, Oregon, USA) (CHI ’05). Association for Computing Machinery, New York, NY, USA, 321–330. https://doi.org/10.1145/1054972.1055017",
      "doi": "10.1145/1054972.1055017"
    },
    {
      "text": "Gloria Mark, Shamsi Iqbal, and Mary Czerwinski. 2017. How blocking distractions affects workplace focus and productivity. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers. 928–934.",
      "doi": "10.1145/3123024.3124558"
    },
    {
      "text": "Gloria Mark, Shamsi T Iqbal, Mary Czerwinski, and Paul Johns. 2014. Bored mondays and focused afternoons: the rhythm of attention and online activity in the workplace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3025–3034.",
      "doi": "10.1145/2556288.2557204"
    },
    {
      "text": "Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, Paul Johns, and Akane Sano. 2016. Neurotics Can’t Focus: An ",
      "doi": "10.1145/2858036.2858202"
    },
    {
      "text": "Gloria Mark, Yiran Wang, and Melissa Niiya. 2014. Stress and Multitasking in Everyday College Life: An Empirical Study of Online Activity. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 41–50. https://doi.org/10.1145/2556288.2557361",
      "doi": "10.1145/2556288.2557361"
    },
    {
      "text": "Jennifer Marlow, Eveline van Everdingen, and Daniel Avrahami. 2016. Taking Notes or Playing Games? Understanding Multitasking in Video Communication. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work and Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1726–1737. https://doi.org/10.1145/2818048.2819975",
      "doi": "10.1145/2818048.2819975"
    },
    {
      "text": "Daniel McDuff, Eunice Jun, Kael Rowan, and Mary Czerwinski. 2019. Longitudinal Observational Evidence of the Impact of Emotion Regulation Strategies on Affective Expression. IEEE Transactions on Affective Computing(2019).",
      "doi": ""
    },
    {
      "text": "Christopher A. Monk, Deborah A. Boehm-Davis, and J. Gregory Trafton. 2002. The Attentional Costs of Interrupting Task Performance at Various Stages. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 46, 22 (2002), 1824–1828. https://doi.org/10.1177/154193120204602210 arXiv:https://doi.org/10.1177/154193120204602210",
      "doi": ""
    },
    {
      "text": "Stephen L Morgan and Christopher Winship. 2015. Counterfactuals and causal inference. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Brid O’Conaill and David Frohlich. 1995. Timespace in the Workplace: Dealing with Interruptions. Conference on Human Factors in Computing Systems - Proceedings 2, 262–263. https://doi.org/10.1145/223355.223665",
      "doi": "10.1145/223355.223665"
    },
    {
      "text": "Gary M Olson and Judith S Olson. 2000. Distance matters. Human–computer interaction 15, 2-3 (2000), 139–178.",
      "doi": ""
    },
    {
      "text": "Sanghoo Park, Sangmi Kim, and Seungmi Han. 2014. Analysis of multitasking in the context of using multiple mobile devices: a qualitative research. In Proceedings of HCI Korea. 404–411.",
      "doi": "10.5555/2729485.2729543"
    },
    {
      "text": "Andrew K Przybylski and Netta Weinstein. 2013. Can you connect with me now? How the presence of mobile communication technology influences face-to-face conversation quality. Journal of Social and Personal Relationships 30, 3(2013), 237–246.",
      "doi": ""
    },
    {
      "text": "Daniela Retelny, Sébastien Robaszkiewicz, Alexandra To, Walter S Lasecki, Jay Patel, Negar Rahmati, Tulsee Doshi, Melissa Valentine, and Michael S Bernstein. 2014. Expert crowdsourcing with flash teams. In Proceedings of the 27th annual ACM symposium on User interface software and technology. 75–85.",
      "doi": "10.1145/2642918.2647409"
    },
    {
      "text": "Charles Rich and Candace Sidner. 1999. COLLAGEN: A collaboration manager for software interface agents. User Modeling and User-Adapted Interaction 8 (03 1999). https://doi.org/10.1023/A:1008204020038",
      "doi": ""
    },
    {
      "text": "John Rieman. 1993. The diary study: a workplace-oriented research tool to guide laboratory efforts. In Proceedings of the INTERACT’93 and CHI’93 conference on Human factors in computing systems. 321–326.",
      "doi": "10.1145/169059.169255"
    },
    {
      "text": "Sean Rintel, Priscilla Wong, Advait Sarkar, and Abigail Sellen. 2020. Methodology and Participation for 2020 Diary Study of Microsoft Employees Experiences in Remote Meetings During COVID-19. Technical Report 2020-10-FOW-SIM1. Microsoft. https://www.microsoft.com/en-us/research/publication/methodology-and-participation-for-2020-diary-study-of-microsoft-employees-experiences-in-remote-meetings-during-covid-19/",
      "doi": ""
    },
    {
      "text": "Joshua S. Rubinstein, David Meyer, and Jeffrey E. Evans. 2001. Executive Control of Cognitive Processes in Task Switching. 27 (Sept 2001), 763–97. https://doi.org/10.1037/0096-1523.27.4.763",
      "doi": ""
    },
    {
      "text": "Skipper Seabold and Josef Perktold. 2010. statsmodels: Econometric and statistical modeling with python. In 9th Python in Science Conference.",
      "doi": ""
    },
    {
      "text": "Abigail Sellen and Richard Harper. 1997. Paper as an analytic resource for the design of new technologies. In Proceedings of the ACM SIGCHI Conference on Human factors in computing systems. 319–326.",
      "doi": "10.1145/258549.258780"
    },
    {
      "text": "Cheri Speier, Joseph S. Valacich, and Iris Vessey. 1999. The Influence of Task Interruption on Individual Decision Making: An Information Overload Perspective. Decision Sciences 30, 2 (1999), 337–360. https://doi.org/10.1111/j.1540-5915.1999.tb01613.x arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1540-5915.1999.tb01613.x",
      "doi": ""
    },
    {
      "text": "Jonathan B Spira and Joshua B Feintuch. 2005. The cost of not paying attention: How interruptions impact knowledge worker productivity. Report from Basex (2005).",
      "doi": ""
    },
    {
      "text": "Minhyang (Mia) Suh, Frank Bentley, and Danielle Lottridge. 2018. ”It’s Kind of Boring Looking at Just the Face”: How Teens Multitask During Mobile Videochat. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 167 (Nov. 2018), 23 pages. https://doi.org/10.1145/3274436",
      "doi": ""
    },
    {
      "text": "Melissa A Valentine, Daniela Retelny, Alexandra To, Negar Rahmati, Tulsee Doshi, and Michael S Bernstein. 2017. Flash organizations: Crowdsourcing complex work by structuring crowds as organizations. In Proceedings of the 2017 CHI conference on human factors in computing systems. 3523–3537.",
      "doi": "10.1145/3025453.3025811"
    },
    {
      "text": "Mark E Whiting, Allie Blaising, Chloe Barreau, Laura Fiuza, Nik Marda, Melissa Valentine, and Michael S Bernstein. 2019. Did It Have To End This Way? Understanding the Consistency of Team Fracture. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": ""
    },
    {
      "text": "Christopher D. Wickens. 2008. Multiple Resources and Mental Workload. Human Factors 50, 3 (2008), 449–455. https://doi.org/10.1518/001872008X288394 arXiv:https://doi.org/10.1518/001872008X288394",
      "doi": ""
    },
    {
      "text": "Alex C Williams, Harmanpreet Kaur, Gloria Mark, Anne Loomis Thompson, Shamsi T Iqbal, and Jaime Teevan. 2018. Supporting workplace detachment and reattachment with conversational intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173662"
    },
    {
      "text": "Longqi Yang, Sonia Jaffe, David Holtz, Siddharth Suri, Shilpi Sinha, Jeffrey Weston, Connor Joyce, Neha Shah, Kevin Sherman, CJ Lee, 2020. How Work From Home Affects Collaboration: A Large-Scale Study of Information Workers in a Natural Experiment During COVID-19. arXiv preprint arXiv:2007.15584(2020).",
      "doi": ""
    },
    {
      "text": "Fred Zijlstra, Robert Roe, Anna Leonora, and Irene Krediet. 1999. Temporal Factors in Mental Work: Effects of Interrupted Activities. Journal of Occupational and Organizational Psychology 72 (06 1999), 163–186. https://doi.org/10.1348/096317999166581",
      "doi": ""
    }
  ]
}