{
  "doi": "10.1145/3411764.3445554",
  "title": "Providing Adaptive Feedback in Concept Mapping to Improve Reading Comprehension",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "Previous research has demonstrated the benefits of applying comparative strategies while learning from informational texts, where students identify key concepts and then attempt to establish relationships between those concepts. Concept mapping is one activity that can prompt students to use comparative strategies, but not all students benefit from this activity without support. This work presents an intelligent tutoring system for concept mapping that facilitates the development of comparative strategies through diagnostic feedback that responds to the quality of students’ concept mapping process and map correctness. The novelty of the system lies in the combination of outcome-based feedback methods typical in concept mapping with adaptive process-based evaluation. In a lab study with 46 college students, we evaluate the effect of this combined adaptive support compared to solely process-based support and no support. Results suggested that the combined feedback approach showed promise at improving students’ use of comparative strategies and learning outcomes.",
  "tags": [
    "concept mapping",
    "reading comprehension",
    "comparative strategies",
    "intelligent learning environments"
  ],
  "authors": [
    {
      "name": "Shang Wang",
      "institution": "School of Computing, Informatics, and Decision Systems Engineering Arizona State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365736",
      "orcid": "missing"
    },
    {
      "name": "Erin Walker",
      "institution": "University of Pittsburgh, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316491129",
      "orcid": "0000-0002-0976-9065"
    }
  ],
  "references": [
    {
      "text": "Lynne Anderson-Inman, Leslie Ditson, and Mary T Ditson. 1998. Computer-based concept mapping: Promoting meaningful learning in science for students with disabilities. Information Technology and Disabilities 5, 1/2 (1998).",
      "doi": ""
    },
    {
      "text": "Lynne Anderson-Inman and Leigh Zeitz. 1993. Computer-based concept mapping: Active studying for active learners. The Computer Teacher.(August/September)(1993).",
      "doi": ""
    },
    {
      "text": "Alberto J Cañas, Greg Hill, Roger Carff, Niranjan Suri, James Lott, Gloria Gómez, Thomas C Eskridge, Mario Arroyo, and Rodrigo Carvajal. 2004. CmapTools: A knowledge modeling and sharing environment. (2004).",
      "doi": ""
    },
    {
      "text": "Mary J Carnot, Bruce Dunn, Alberto J Cañas, P Graham, and Jason Muldoon. 2001. Concept maps vs. web pages for information searching and browsing.",
      "doi": ""
    },
    {
      "text": "Kuo-En Chang, Yao-Ting Sung, and Sung-Fang Chen. 2001. Learning through computer-based concept mapping with scaffolding aid. Journal of computer assisted learning 17, 1 (2001), 21–33.",
      "doi": ""
    },
    {
      "text": "Weichao Chen, Carla Allen, and David Jonassen. 2018. Deeper learning in collaborative concept mapping: A mixed methods study of conflict resolution. Computers in Human Behavior 87 (2018), 424–435.",
      "doi": "10.1016/j.chb.2018.01.007"
    },
    {
      "text": "Pasana Chularut and Teresa K DeBacker. 2004. The influence of concept mapping on achievement, self-regulation, and self-efficacy in students of English as a second language. Contemporary Educational Psychology 29, 3 (2004), 248–263.",
      "doi": ""
    },
    {
      "text": "Martin Davies. 2011. Concept mapping, mind mapping and argument mapping: what are the differences and do they matter?Higher education 62, 3 (2011), 279–301.",
      "doi": ""
    },
    {
      "text": "Taricani Ellen M. and Clariana Roy B.2006. A Technique for Automatically Scoring Open-Ended Concept Maps. In Educational Technology Research and Development. JSTOR, 65–82.",
      "doi": ""
    },
    {
      "text": "Emily R Fyfe, Marci S DeCaro, and Bethany Rittle-Johnson. 2015. When feedback is cognitively-demanding: the importance of working memory capacity. Instructional Science 43, 1 (2015), 73–91.",
      "doi": ""
    },
    {
      "text": "John Hattie and Helen Timperley. 2007. The power of feedback. Review of educational research 77, 1 (2007), 81–112.",
      "doi": ""
    },
    {
      "text": "Elske Heeren and Piet AM Kommers. 1992. Flexibility of expressiveness: A critical factor in the design of concept mapping tools for learning. In Cognitive tools for learning. Springer, 85–101.",
      "doi": ""
    },
    {
      "text": "Tsukasa Hirashima, Kazuya Yamasaki, Hiroyuki Fukuda, and Hideo Funaoi. 2011. Kit-build concept map for automatic diagnosis. In International conference on artificial intelligence in education. Springer, 466–468.",
      "doi": ""
    },
    {
      "text": "Veronica W Ho, Peter G Harris, Rakesh K Kumar, and Gary M Velan. 2018. Knowledge maps: a tool for online assessment with automated feedback. Medical education online 23, 1 (2018), 1457394.",
      "doi": ""
    },
    {
      "text": "Phillip B Horton, Andrew A McConney, Michael Gallo, Amanda L Woods, Gary J Senn, and Denis Hamelin. 1993. An investigation of the effectiveness of concept mapping as an instructional tool.Science Education (1993).",
      "doi": ""
    },
    {
      "text": "Gwo-Jen Hwang, Po-Han Wu, and Hui-Ru Ke. 2011. An interactive concept map approach to supporting mobile learning activities for natural science courses. Computers & education 57, 4 (2011), 2272–2280.",
      "doi": ""
    },
    {
      "text": "Ian M Kinchin. 2001. If concept mapping is so helpful to learning biology, why aren’t we all doing it?International Journal of Science Education 23, 12 (2001), 1257–1269.",
      "doi": ""
    },
    {
      "text": "Kenneth R Koedinger, Albert Corbett, 2006. Cognitive tutors: Technology bringing learning sciences to the classroom. na.",
      "doi": ""
    },
    {
      "text": "Rebecca Lippmann Kung and Cedric Linder. 2007. Metacognitive activity in the physics student laboratory: Is increased metacognition necessarily better?Metacognition and Learning 2, 1 (2007), 41–56.",
      "doi": ""
    },
    {
      "text": "Krittaya Leelawong and Gautam Biswas. 2008. Designing learning by teaching agents: The Betty’s Brain system. International Journal of Artificial Intelligence in Education 18, 3(2008), 181–208.",
      "doi": "10.5555/1454278.1454280"
    },
    {
      "text": "Kyu Yon Lim, Hyeon Woo Lee, and Barbara Grabowski. 2009. Does concept-mapping strategy work for everyone? The levels of generativity and learners’ self-regulated learning skills. British Journal of Educational Technology 40, 4 (2009), 606–618.",
      "doi": ""
    },
    {
      "text": "Ching Liu, Juho Kim, and Hao-Chuan Wang. 2018. ConceptScape: Collaborative concept mapping for video learning. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173961"
    },
    {
      "text": "Romans Lukasenko, Alla Anohina-Naumeca, Marks Vilkelis, and Janis Grundspenkis. 2010. Feedback in the concept map based intelligent knowledge assessment system. Applied Computer Systems 41, 1 (2010), 17–26.",
      "doi": ""
    },
    {
      "text": "Collin F Lynch, Kevin D Ashley, Vincent Aleven, and Niels Pinkwart. 2006. Defining ill-defined domains; a literature survey. In Intelligent Tutoring Systems (ITS 2006): Workshop on Intelligent Tutoring Systems for Ill-Defined Domains.",
      "doi": ""
    },
    {
      "text": "W Todd Maddox, F Gregory Ashby, and Corey J Bohil. 2003. Delayed feedback effects on rule-based and information-integration category learning.Journal of experimental psychology: learning, memory, and cognition 29, 4(2003), 650.",
      "doi": ""
    },
    {
      "text": "G Miller and Scott Spoolman. 2010. Environmental science. Cengage Learning.",
      "doi": ""
    },
    {
      "text": "John C Nesbit and Olusola O Adesope. 2006. Learning with concept and knowledge maps: A meta-analysis. Review of educational research 76, 3 (2006), 413–448.",
      "doi": ""
    },
    {
      "text": "Joseph D Novak and Alberto J Cañas. 2008. The theory underlying concept maps and how to construct and use them. (2008).",
      "doi": ""
    },
    {
      "text": "Bertram Opitz, Nicola K Ferdinand, and Axel Mecklinger. 2011. Timing matters: the impact of immediate and delayed feedback on artificial language learning. Frontiers in human neuroscience 5 (2011), 8.",
      "doi": ""
    },
    {
      "text": "Hector R Ponce and Richard E Mayer. 2014. Qualitatively different cognitive processing during online reading primed by different study activities. Computers in human behavior 30 (2014), 121–130.",
      "doi": ""
    },
    {
      "text": "Sadhana Puntambekar and Agni Stylianou. 2005. Designing navigation support in hypertext systems based on navigation patterns. Instructional science 33, 5-6 (2005), 451–481.",
      "doi": ""
    },
    {
      "text": "Lia Sadita, Pedro Gabriel Fonteles Furtado, Tsukasa Hirashima, and Yusuke Hayashi. 2020. Analysis of The Similarity of Individual Knowledge and The Comprehension of Partner’s Representation during Collaborative Concept Mapping with Reciprocal Kit Build Approach. IEICE TRANSACTIONS on Information and Systems 103, 7 (2020), 1722–1731.",
      "doi": ""
    },
    {
      "text": "Kouta Sugihara, Takuya Osada, Shinsuke Nakata, Hideo Funaoi, and Tsukasa Hirashima. 2012. Experimental evaluation of kit-build concept map for science classes in an elementary school. Proc. ICCE2012 (2012), 17–24.",
      "doi": ""
    },
    {
      "text": "Shang Wang, Deniz Sonmez Unal, and Erin Walker. 2019. MindDot: Supporting Effective Cognitive Behaviors in Concept Map-Based Learning Environments. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300258"
    },
    {
      "text": "Shang Wang, Erin Walker, and Ruth Wylie. 2017. What matters in concept mapping? Maps learners create or how they create them. In International Conference on Artificial Intelligence in Education. Springer, 406–417.",
      "doi": ""
    },
    {
      "text": "Noreen M Webb, Jonathan D Troper, and Randy Fall. 1995. Constructive activity and learning in collaborative small groups.Journal of educational psychology 87, 3 (1995), 406.",
      "doi": ""
    },
    {
      "text": "Po-Han Wu, Gwo-Jen Hwang, Marcelo Milrad, Hui-Ru Ke, and Yueh-Min Huang. 2012. An innovative concept map approach for improving students’ learning performance with an instant feedback mechanism. British Journal of Educational Technology 43, 2 (2012), 217–232.",
      "doi": ""
    },
    {
      "text": "Romain Zeiliger, Thérèse Reggers, and Robert Peeters. 1996. Concept-map based navigation in educational hypermedia: a case study. In Proceedings of ED-MEDIA, Vol. 96.",
      "doi": ""
    }
  ]
}