{
  "doi": "10.1145/3411764.3445147",
  "title": "Preserving Agency During Electrical Muscle Stimulation Training Speeds up Reaction Time Directly After Removing EMS",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-9",
  "year": 2021,
  "badges": [],
  "abstract": "Abstract: Force feedback devices, such as motor-based exoskeletons or wearables based on electrical muscle stimulation (EMS), have the unique potential to accelerate users’ own reaction time (RT). However, this speedup has only been explored while the device is attached to the user. In fact, very little is known regarding whether this faster reaction time still occurs after the user removes the device from their bodies–this is precisely what we investigated by means of a simple reaction time (RT) experiment, in which participants were asked to tap as soon as they saw an LED flashing. Participants experienced this in three EMS conditions: (1) fast-EMS, the electrical impulses were synced with the LED; (2) agency-EMS, the electrical impulse was delivered 40ms faster than the participant’s own RT, which prior work has shown to preserve one’s sense of agency over this movement; and, (3) late-EMS: the impulse was delivered after the participant’s own RT. Our results revealed that the participants’ RT was significantly reduced by approximately 8ms (up to 20ms) only after training with the agency-EMS condition. This finding suggests that the prioritizing agency during EMS training is key to motor-adaptation, i.e., it enables a faster motor response even after the user has removed the EMS device from their body.",
  "tags": [
    "reaction time",
    "agency",
    "electrical muscle stimulation"
  ],
  "authors": [
    {
      "name": "Shunichi Kasahara",
      "institution": "Sony CSL, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556774656",
      "orcid": "0000-0002-4353-7620"
    },
    {
      "name": "Kazuma Takada",
      "institution": "Meiji University, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700966",
      "orcid": "missing"
    },
    {
      "name": "Jun Nishida",
      "institution": "University of Chicago, United States",
      "img": "/do/10.1145/contrib-99658698158/rel-imgonly/as_sq_1024_crop.jpg",
      "acmid": "99658698158",
      "orcid": "0000-0003-3081-1587"
    },
    {
      "name": "Kazuhisa Shibata",
      "institution": "RIKEN CBS, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700505",
      "orcid": "missing"
    },
    {
      "name": "Shinsuke Shimojo",
      "institution": "California Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701964",
      "orcid": "missing"
    },
    {
      "name": "Pedro Lopes",
      "institution": "University of Chicago, United States",
      "img": "/do/10.1145/contrib-81557182156/rel-imgonly/_pedrolopes_uchicago.jpg",
      "acmid": "81557182156",
      "orcid": "0000-0001-6527-7084"
    }
  ],
  "references": [
    {
      "text": "Soichi Ando, Noriyuki Kida, and Shingo Oda. 2002. Practice effects on reaction time for peripheral and central visual fields. Perceptual and Motor Skills 95, 3 Pt 1 (Dec. 2002), 747–751. https://doi.org/10.2466/pms.2002.95.3.747",
      "doi": ""
    },
    {
      "text": "Soichi Ando, Noriyuki Kida, and Shingo Oda. 2004. Retention of Practice Effects on Simple Reaction Time for Peripheral and Central Visual Fields. Perceptual and Motor Skills 98, 3 (June 2004), 897–900. https://doi.org/10.2466/pms.98.3.897-900",
      "doi": ""
    },
    {
      "text": "VL Bender and GH McGlynn. 1976. The effect of various levels of strenuous to exhaustive exercise on reaction time. European journal of applied physiology and occupational physiology 35, 2(1976), 95–101.",
      "doi": ""
    },
    {
      "text": "Anthony N. Carlsen, Romeo Chua, J. Timothy Inglis, David J. Sanderson, and Ian M. Franks. 2004. Prepared movements are elicited early by startle. Journal of Motor Behavior 36, 3 (Sept. 2004), 253–264. https://doi.org/10.3200/JMBR.36.3.253-264",
      "doi": ""
    },
    {
      "text": "R. W. Christina, M. G. Fischman, and M. J. Vercruyssen. 1982. Simple reaction time as a function of response complexity: memory drum theory revisited. Journal of Motor Behavior 14, 4 (Dec. 1982), 301–321. https://doi.org/10.1080/00222895.1982.10735282",
      "doi": ""
    },
    {
      "text": "Jörn Diedrichsen, Olivier White, Darren Newman, and Níall Lally. 2010. Use-Dependent and Error-Based Learning of Motor Behaviors. Journal of Neuroscience 30, 15 (April 2010), 5159–5166. https://doi.org/10.1523/JNEUROSCI.5406-09.2010",
      "doi": ""
    },
    {
      "text": "M Domjan. 2010. The principles of learning and behavior, 6th edn Belmont. CA: Thomson Wadsworth.[Google Scholar](2010).",
      "doi": ""
    },
    {
      "text": "Ayaka Ebisu, Satoshi Hashizume, Kenta Suzuki, Akira Ishii, Mose Sakashita, and Yoichi Ochiai. 2016. Stimulated Percussions: Techniques for Controlling Human As Percussive Musical Instrument by Using Electrical Muscle Stimulation(SA ’16). ACM, New York, NY, USA, Article 37, 2 pages. https://doi.org/10.1145/3005274.3005324",
      "doi": "10.1145/3005274.3005324"
    },
    {
      "text": "Farzam Farbiz, Zhou Hao Yu, Corey Manders, and Waqas Ahmad. 2007. An Electrical Muscle Stimulation Haptic Feedback for Mixed Reality Tennis Game(SIGGRAPH ’07). ACM, New York, NY, USA, Article 140. https://doi.org/10.1145/1280720.1280873",
      "doi": ""
    },
    {
      "text": "M. G. Fischman. 1984. Programming time as a function of number of movement parts and changes in movement direction. Journal of Motor Behavior 16, 4 (Dec. 1984), 405–423. https://doi.org/10.1080/00222895.1984.10735329",
      "doi": ""
    },
    {
      "text": "P. M. Fitts. 1954. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology 47, 6 (June 1954), 381–391.",
      "doi": ""
    },
    {
      "text": "P. M. Fitts. 1966. Cognitive aspects of information processing. 3. Set for speed versus accuracy. Journal of Experimental Psychology 71, 6 (June 1966), 849–857. https://doi.org/10.1037/h0023232",
      "doi": ""
    },
    {
      "text": "P. M. Fitts and C. M. Seeger. 1953. S-R compatibility: spatial characteristics of stimulus and response codes. Journal of Experimental Psychology 46, 3 (Sept. 1953), 199–210. https://doi.org/10.1037/h0062827",
      "doi": ""
    },
    {
      "text": "Takashi Goto, Swagata Das, Katrin Wolf, Pedro Lopes, Yuichi Kurita, and Kai Kunze. 2020. Accelerating Skill Acquisition of Two-Handed Drumming Using Pneumatic Artificial Muscles(AHs ’20). Association for Computing Machinery, New York, NY, USA, Article 12, 9 pages. https://doi.org/10.1145/3384657.3384780",
      "doi": ""
    },
    {
      "text": "Franklin M. Henry and Donald E. Rogers. 1960. Increased Response Latency for Complicated Movements and A Memory Drum Theory of Neuromotor Reaction. Research Quarterly. American Association for Health, Physical Education and Recreation 31, 3 (Oct. 1960), 448–458. https://doi.org/10.1080/10671188.1960.10762052",
      "doi": ""
    },
    {
      "text": "Pilwon Heo, Gwang Min Gu, Soo-jin Lee, Kyehan Rhee, and Jung Kim. 2012. Current hand exoskeleton technologies for rehabilitation and assistive engineering. International Journal of Precision Engineering and Manufacturing 13, 5 (May 2012), 807–824. https://doi.org/10.1007/s12541-012-0107-2",
      "doi": ""
    },
    {
      "text": "W. E. Hick. 1952. On the Rate of Gain of Information. Quarterly Journal of Experimental Psychology 4, 1 (March 1952), 11–26. https://doi.org/10.1080/17470215208416600",
      "doi": ""
    },
    {
      "text": "Ray Hyman. 1953. Stimulus information as a determinant of reaction time. Journal of Experimental Psychology 45, 3 (1953), 188–196. https://doi.org/10.1037/h0056940",
      "doi": ""
    },
    {
      "text": "Shunichi Kasahara, Jun Nishida, and Pedro Lopes. 2019. Preemptive Action: Accelerating Human Reaction using Electrical Muscle Stimulation Without Compromising Agency. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–15. https://doi.org/10.1145/3290605.3300873",
      "doi": "10.1145/3290605.3300873"
    },
    {
      "text": "J. Kaswan and S. Young. 1965. EFFECT OF STIMULUS VARIABLES ON CHOICE REACTION TIMES AND THRESHOLDS. Journal of Experimental Psychology 69 (May 1965), 511–514. https://doi.org/10.1037/h0021742",
      "doi": ""
    },
    {
      "text": "John W Krakauer and Pietro Mazzoni. 2011. Human sensorimotor learning: adaptation, skill, and beyond. Current opinion in neurobiology 21, 4 (2011), 636–644.",
      "doi": ""
    },
    {
      "text": "Sheldon J Lachman. 1997. Learning is a process: Toward an improved definition of learning. The Journal of psychology 131, 5 (1997), 477–480.",
      "doi": ""
    },
    {
      "text": "Pedro Lopes and Patrick Baudisch. 2013. Muscle-propelled Force Feedback: Bringing Force Feedback to Mobile Devices(CHI ’13). ACM, New York, NY, USA, 2577–2580. https://doi.org/10.1145/2470654.2481355",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, and Patrick Baudisch. 2015. Impacto: Simulating Physical Impact by Combining Tactile Stimulation with Electrical Muscle Stimulation(UIST ’15). ACM, New York, NY, USA, 11–19. https://doi.org/10.1145/2807442.2807443",
      "doi": "10.1145/2807442.2807443"
    },
    {
      "text": "Pedro Lopes, Alexandra Ion, Willi Mueller, Daniel Hoffmann, Patrik Jonell, and Patrick Baudisch. 2015. Proprioceptive Interaction(CHI ’15). ACM, New York, NY, USA, 939–948. https://doi.org/10.1145/2702123.2702461",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++: Allowing Objects to Communicate Dynamic Use(CHI ’15). ACM, New York, NY, USA, 2515–2524. https://doi.org/10.1145/2702123.2702128",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation(CHI ’17). ACM, New York, NY, USA, 1471–1482. https://doi.org/10.1145/3025453.3025600",
      "doi": ""
    },
    {
      "text": "Terry McMorris, Mark Tallon, Craig Williams, John Sproule, Steve Draper, Jon Swain, Julia Potter, and Neville Clayton. 2003. Incremental exercise, plasma concentrations of catecholamines, reaction time, and motor time during performance of a noncompatible choice response time task. Perceptual and motor skills 97, 2 (2003), 590–604.",
      "doi": ""
    },
    {
      "text": "Jun Nishida, Shunichi Kasahara, and Kenji Suzuki. 2017. Wired Muscle: Generating Faster Kinesthetic Reaction by Inter-personally Connecting Muscles(SIGGRAPH ’17). ACM, New York, NY, USA, Article 26, 2 pages. https://doi.org/10.1145/3084822.3084844",
      "doi": "10.1145/3084822.3084844"
    },
    {
      "text": "Jun Nishida and Kenji Suzuki. 2017. bioSync: A Paired Wearable Device for Blending Kinesthetic Experience. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 3316–3327. https://doi.org/10.1145/3025453.3025829",
      "doi": "10.1145/3025453.3025829"
    },
    {
      "text": "Max Pfeiffer, Tim Dünte, Stefan Schneegass, Florian Alt, and Michael Rohs. 2015. Cruise Control for Pedestrians: Controlling Walking Direction Using Electrical Muscle Stimulation(CHI ’15). ACM, New York, NY, USA, 2505–2514. https://doi.org/10.1145/2702123.2702190",
      "doi": ""
    },
    {
      "text": "Roger Ratcliff. 2002. A diffusion model account of response time and accuracy in a brightness discrimination task: fitting real data and failing to fit fake but plausible data. Psychonomic Bulletin & Review 9, 2 (June 2002), 278–291.",
      "doi": ""
    },
    {
      "text": "B. A. Reddi and R. H. Carpenter. 2000. The influence of urgency on decision time. Nature Neuroscience 3, 8 (Aug. 2000), 827–830. https://doi.org/10.1038/77739",
      "doi": ""
    },
    {
      "text": "Alan W Salmoni, Richard A Schmidt, and Charles B Walter. 1984. Knowledge of results and motor learning: a review and critical reappraisal.Psychological bulletin 95, 3 (1984), 355.",
      "doi": ""
    },
    {
      "text": "MHD Yamen Saraiji, Tomoya Sasaki, Reo Matsumura, Kouta Minamizawa, and Masahiko Inami. 2018. Fusion: Full Body Surrogacy for Collaborative Communication(SIGGRAPH ’18). ACM, New York, NY, USA, Article 7, 2 pages. https://doi.org/10.1145/3214907.3214912",
      "doi": ""
    },
    {
      "text": "Richard A Schmidt, Douglas E Young, Stephan Swinnen, and Diane C Shapiro. 1989. Summary knowledge of results for skill acquisition: Support for the guidance hypothesis.Journal of Experimental Psychology: Learning, Memory, and Cognition 15, 2(1989), 352.",
      "doi": ""
    },
    {
      "text": "Jonathon PR Scott, Lars R McNaughton, and Remco CJ Polman. 2006. Effects of sleep deprivation and exercise on cognitive, motor performance and mood. Physiology & behavior 87, 2 (2006), 396–408.",
      "doi": ""
    },
    {
      "text": "J. R. Simon and A. P. Rudell. 1967. Auditory S-R compatibility: the effect of an irrelevant cue on information processing. The Journal of Applied Psychology 51, 3 (June 1967), 300–304.",
      "doi": ""
    },
    {
      "text": "J. RICHARD SIMON and JAMES D. WOLF. 1963. Choice Reaction Time as a Function of Angular Stimulus-Response Correspondence and Age. Ergonomics 6, 1 (Jan. 1963), 99–105. https://doi.org/10.1080/00140136308930679",
      "doi": ""
    },
    {
      "text": "P. Strojnik, A. Kralj, and I. Ursic. 1979. Programmed Six-Channel Electrical Stimulator for Complex Stimulation of Leg Muscles During Walking. IEEE Transactions on Biomedical Engineering BME-26, 2 (Feb 1979), 112–116. https://doi.org/10.1109/TBME.1979.326520",
      "doi": ""
    },
    {
      "text": "Nobuhiro Takahashi, Hayato Takahashi, and Hideki Koike. 2019. Soft Exoskeleton Glove Enabling Force Feedback for Human-Like Finger Posture Control with 20 Degrees of Freedom. In 2019 IEEE World Haptics Conference (WHC). IEEE, Tokyo, Japan, 217–222. https://doi.org/10.1109/WHC.2019.8816142",
      "doi": ""
    },
    {
      "text": "Emi Tamaki, Takashi Miyaki, and Jun Rekimoto. 2011. PossessedHand: Techniques for Controlling Human Hands Using Electrical Muscles Stimuli(CHI ’11). ACM, New York, NY, USA, 543–552. https://doi.org/10.1145/1978942.1979018",
      "doi": ""
    },
    {
      "text": "Y. Taniguchi. 1999. Effect of practice in bilateral and unilateral reaction-time tasks. Perceptual and Motor Skills 88, 1 (Feb. 1999), 99–109. https://doi.org/10.2466/pms.1999.88.1.99",
      "doi": ""
    },
    {
      "text": "J. Valls-Solé, J. C. Rothwell, F. Goulart, G. Cossu, and E. Muñoz. 1999. Patterned ballistic movements triggered by a startle in healthy humans. The Journal of Physiology 516 (Pt 3) (May 1999), 931–938. https://doi.org/10.1111/j.1469-7793.1999.0931u.x",
      "doi": ""
    },
    {
      "text": "Frederik Wiehr, Felix Kosmalla, Florian Daiber, and Antonio Krüger. 2017. FootStriker: An EMS-Based Foot Strike Assistant for Running(UbiComp ’17). Association for Computing Machinery, New York, NY, USA, 317–320. https://doi.org/10.1145/3123024.3123191",
      "doi": "10.1145/3123024.3123191"
    },
    {
      "text": "Yasuhisa Hasegawa, Yasuyuki Mikami, Kosuke Watanabe, and Yoshiyuki Sankai. 2008. Five-fingered assistive hand with mechanical compliance of human finger. In 2008 IEEE International Conference on Robotics and Automation. 718–724. https://doi.org/10.1109/ROBOT.2008.4543290",
      "doi": ""
    }
  ]
}