{
  "doi": "10.1145/3411764.3445241",
  "title": "Data Epics: Embarking on Literary Journeys of Home Internet of Things Data",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "In this paper, we use fiction as a method to complicate the commonplace narratives of data as intangible and objective, in the particular context of Internet of Things (IoT) in the home. We, a team of two design researchers, partnered with a fiction writer and a single IoT enthusiast, Susan, to create The Data Epics: four short stories based on Susan's monthly home IoT data logs. The Data Epics revealed new imaginaries for data, showing new world-views and lively data, but also surfaced data's entanglement in meshes and hierarchies, and concerns about control and power. Our work also examines the labor of tending to and interpreting data and a particular interest in anomalies. We conclude with discussions of how data imaginaries from fiction might be imperfect, but are uniquely generative, offering a path to get closer to IoT data by trying things on and zooming in and slowing down.",
  "authors": [
    {
      "name": "Audrey Desjardins",
      "institution": "School of Art + Art History + Design University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484656227",
      "orcid": "0000-0002-1980-1292"
    },
    {
      "name": "Heidi R. Biggs",
      "institution": "College of Information Sciences and Technology Penn State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441708",
      "orcid": "0000-0001-9208-7921"
    }
  ],
  "references": [
    {
      "text": "Kristina Andersen. 2013. Making Magic Machines. In 10th European Academy of Design Conference - Crafting the Future, Gothenbug, Sweden, 1–11. DOI: https://doi.org/10.2307/j.ctvg8p3md.12.",
      "doi": ""
    },
    {
      "text": "Luigi Atzori, Antonio Iera, and Giacomo Morabito. 2010. The Internet of Things: A survey. Computer Networks 54, 15 (October 2010), 2787–2805. DOI: https://doi.org/10.1016/j.comnet.2010.05.010.",
      "doi": "10.1016/j.comnet.2010.05.010"
    },
    {
      "text": "Jeffrey Bardzell and Shaowen Bardzell. 2014. “a great and troubling beauty”: Cognitive speculation and ubiquitous computing. Personal and Ubiquitous Computing 18, 4 (2014), 779–794. DOI: https://doi.org/10.1007/s00779-013-0677-8.",
      "doi": "10.1007/s00779-013-0677-8"
    },
    {
      "text": "Genevieve Bell and Paul Dourish. 2007. Yesterday's Tomorrows: Notes on Ubiquitous Computing's Dominant Vision. Personal Ubiquitous Comput. 11, 2 (January 2007), 133–143. DOI: https://doi.org/10.1007/s00779-006-0071-x.",
      "doi": "10.1007/s00779-006-0071-x"
    },
    {
      "text": "Julian Bleecker. 2009. Design Fiction: A Short Essay on Design, Science, Fact and Fiction. Near Future Laboratory March (2009), 49. DOI: https://doi.org/10.1145/1516016.1516021.",
      "doi": ""
    },
    {
      "text": "Åsa Blomquist and Mattias Arvola. 2002. Personas in action: Ethnography in an interaction design team. ACM International Conference Proceeding Series 31, (2002), 197–200. DOI: https://doi.org/10.1145/572020.572044.",
      "doi": "10.1145/572020.572044"
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-solutionist strategies: Seriously silly design fiction. In Proceedings of the 2016 CHI Conference (CHI ’16), 4968–4978. DOI: https://doi.org/10.1145/2858036.2858482.",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Mark Blythe, Enrique Encinas, Jofish Kaye, Miriam Lueck Avery, Rob McCabe, and Kristina Andersen. 2018. Imaginary Design Workbooks. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18 (2018), 1–12. DOI: https://doi.org/10.1145/3173574.3173807.",
      "doi": "10.1145/3173574.3173807"
    },
    {
      "text": "Nico Castelli, Corinna Ogonowski, Timo Jakobi, Martin Stein, Gunnar Stevens, and Volker Wulf. 2017. What Happened in my Home? An End-User Development Approach for Smart Home Data Visualization. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), Association for Computing Machinery, New York, NY, USA, 853–866. DOI: https://doi.org/10.1145/3025453.3025485.",
      "doi": "10.1145/3025453.3025485"
    },
    {
      "text": "David Chatting, Gerard Wilkinson, Kevin Marshall, Audrey Desjardins, David Green, David Kirk, and Andy Boucher. 2017. Making Home: Asserting Agency in the Age of IoT. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’17), ACM, New York, NY, USA, 526–533. DOI: https://doi.org/10.1145/3027063.3027081.",
      "doi": "10.1145/3027063.3027081"
    },
    {
      "text": "Marshini Chetty, David Tran, and Rebecca E. Grinter. 2008. Getting to Green: Understanding Resource Consumption in the Home. In Proceedings of the 10th International Conference on Ubiquitous Computing (UbiComp ’08), ACM, New York, NY, USA, 242–251. DOI: https://doi.org/10.1145/1409635.1409668.",
      "doi": ""
    },
    {
      "text": "Andy Crabtree, Tom Lodge, James Colley, Chris Greenhalgh, Kevin Glover, Hamed Haddadi, Yousef Amar, Richard Mortier, Qi Li, John Moore, Liang Wang, Poonam Yadav, Jianxin Zhao, Anthony Brown, Lachlan Urquhart, and Derek McAuley. 2018. Building accountability into the Internet of Things: the IoT Databox model. J Reliable Intell Environ 4, 1 (April 2018), 39–55. DOI: https://doi.org/10.1007/s40860-018-0054-5.",
      "doi": ""
    },
    {
      "text": "Kate Crawford, Jessa Lingel, and Tero Karppi. 2015. Our metrics, ourselves: A hundred years of self-tracking from the weight scale to the wrist wearable device. European Journal of Cultural Studies 18, 4–5 (August 2015), 479–496. DOI: https://doi.org/10.1177/1367549415584857.",
      "doi": ""
    },
    {
      "text": "Dries De Roeck, Karin Slegers, Johan Criel, Marc Godon, Laurence Claeys, Katriina Kilpi, and An Jacobs. 2012. I Would DiYSE for It!: A Manifesto for Do-it-yourself Internet-of-things Creation. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI ’12), ACM, New York, NY, USA, 170–179. DOI: https://doi.org/10.1145/2399016.2399044.",
      "doi": "10.1145/2399016.2399044"
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing Tensions in Autobiographical Design in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS ’18), ACM, New York, NY, USA, 753–764. DOI: https://doi.org/10.1145/3196709.3196781.",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "Audrey Desjardins, Heidi R. Biggs, Cayla Key, and Jeremy E. Viny. 2020. IoT Data in the Home: Observing Entanglements and Drawing New Encounters. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, Honolulu, HI, USA, 1–13. DOI: https://doi.org/10.1145/3313831.3376342.",
      "doi": "10.1145/3313831.3376342"
    },
    {
      "text": "Audrey Desjardins, Cayla Key, Heidi Biggs, and Kelsey Ashenbeck. 2019. Bespoke Booklets: A Method for Situated Co-Speculation. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), ACM, 697–709.",
      "doi": "10.1145/3322276.3322311"
    },
    {
      "text": "Audrey Desjardins and Timea Tihanyi. 2019. ListeningCups: A Case of Data Tactility and Data Stories. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), ACM, New York, NY, USA, 147–160. DOI: https://doi.org/10.1145/3322276.3323694.",
      "doi": "10.1145/3322276.3323694"
    },
    {
      "text": "Laura Devendorf, Katya Arquilla, Sandra Wirtanen, Allison Anderson, and Steven Frost. 2020. Craftspeople as Technical Collaborators: Lessons Learned through an Experimental Weaving Residency. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–13. DOI: https://doi.org/10.1145/3313831.3376820.",
      "doi": "10.1145/3313831.3376820"
    },
    {
      "text": "Kristin N. Dew and Daniela K. Rosner. 2018. Lessons from the Woodshop: Cultivating Design with Living Materials. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–12. DOI: https://doi.org/10.1145/3173574.3174159.",
      "doi": "10.1145/3173574.3174159"
    },
    {
      "text": "Catherine D'Ignazio and Lauren F. Klein. 2020. Data Feminism. MIT Press.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2017. The Stuff of Bits: An Essay on the Materialities of Information. MIT Press.",
      "doi": "10.5555/3159007"
    },
    {
      "text": "Anthony Dunne and Fiona Raby. 2013. Speculative Everything: Design, Fiction, and Social Dreaming. MIT Press, Cambridge, Massachusetts.",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Carolyn Ellis, Tony E. Adams, and Arthur P. Bochner. 2010. Autoethnography: An Overview. Forum Qualitative Sozialforschung / Forum: Qualitative Social Research 12, 1 (November 2010). Retrieved October 31, 2014 from http://www.qualitative-research.net/index.php/fqs/article/view/1589.",
      "doi": ""
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C. Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S. Kirk. 2017. On Speculative Enactments. Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17) (2017), 5386–5399. DOI: https://doi.org/10.1145/3025453.3025503.",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp ’15), ACM, New York, NY, USA, 731–742. DOI: https://doi.org/10.1145/2750858.2804250.",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Joel E. Fischer, Andy Crabtree, Tom Rodden, James A. Colley, Enrico Costanza, Michael O. Jewell, and Sarvapali D. Ramchurn. 2016. “Just whack it on until it gets hot”: Working with IoT Data in the Home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), Association for Computing Machinery, New York, NY, USA, 5933–5944. DOI: https://doi.org/10.1145/2858036.2858518.",
      "doi": ""
    },
    {
      "text": "Ester Fritsch, Irina Shklovski, and Rachel Douglas-Jones. 2018. Calling for a Revolution: An Analysis of IoT Manifestos. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), ACM, New York, NY, USA, 302:1–302:13. DOI: https://doi.org/10.1145/3173574.3173876.",
      "doi": "10.1145/3173574.3173876"
    },
    {
      "text": "Carolina Fuentes, Martin Porcheron, Joel E. Fischer, Enrico Costanza, Obaid Malilk, and Sarvapali D. Ramchurn. 2019. Tracking the Consumption of Home Essentials. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–13. DOI: https://doi.org/10.1145/3290605.3300869.",
      "doi": ""
    },
    {
      "text": "William Gaver, Phoebe Sengers, Tobie Kerridge, Joseph Kaye, and John Bowers. 2007. Enhancing Ubiquitous Computing with User Interpretation: Field Testing the Home Health Horoscope. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’07), ACM, New York, NY, USA, 537–546. DOI: https://doi.org/10.1145/1240624.1240711.",
      "doi": "10.1145/1240624.1240711"
    },
    {
      "text": "William W. Gaver, John Bowers, Kirsten Boehner, Andy Boucher, David W.T. Cameron, Mark Hauenstein, Nadine Jarvis, and Sarah Pennington. 2013. Indoor weather stations: investigating a ludic approach to environmental HCI through batch prototyping. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), ACM, New York, NY, USA, 3451–3460. DOI: https://doi.org/10.1145/2470654.2466474.",
      "doi": "10.1145/2470654.2466474"
    },
    {
      "text": "Kentaro Go, John Carroll, and Virginia Tech. 2004. Scenario-based task analysis. The Handbook of Task Analysis for Human-computer Interaction (January 2004).",
      "doi": ""
    },
    {
      "text": "Byung-Chul Han. 2018. Saving beauty (English edition. ed.). Polity Press, Cambridge, UK ; Malden, MA.",
      "doi": ""
    },
    {
      "text": "Yasamin Heshmat, Carman Neustaedter, and Brendan DeBrincat. 2017. The Autobiographical Design and Long Term Usage of an Always-On Video Recording System for the Home. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS ’17), ACM, New York, NY, USA, 675–687. DOI: https://doi.org/10.1145/3064663.3064759.",
      "doi": "10.1145/3064663.3064759"
    },
    {
      "text": "Sun-ha Hong. 2020. Technologies of Speculation: The Limits of Knowledge in a Data-Driven Society. NYU Press.",
      "doi": ""
    },
    {
      "text": "Dorothy Howard and Lilly Irani. 2019. Ways of Knowing When Research Subjects Care. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), Association for Computing Machinery, New York, NY, USA, 1–16. DOI: https://doi.org/10.1145/3290605.3300327.",
      "doi": "10.1145/3290605.3300327"
    },
    {
      "text": "Karin Kappel and Thomas Grechenig. 2009. “Show-me”: Water Consumption at a Glance to Promote Water Conservation in the Shower. In Proceedings of the 4th International Conference on Persuasive Technology (Persuasive ’09), ACM, New York, NY, USA, 26:1–26:6. DOI: https://doi.org/10.1145/1541948.1541984.",
      "doi": "10.1145/1541948.1541984"
    },
    {
      "text": "David Kirby. 2010. The future is now: Diegetic prototypes and the role of popular films in generating real-world technological development. Social Studies of Science 40, 1 (2010), 41–70. DOI: https://doi.org/10.1177/0306312709338325.",
      "doi": ""
    },
    {
      "text": "Rob Kitchin. 2014. Big Data, new epistemologies and paradigm shifts. Big Data & Society 1, 1 (April 2014), 2053951714528481. DOI: https://doi.org/10.1177/2053951714528481.",
      "doi": ""
    },
    {
      "text": "Rob Kitchin and Tracey Lauriault. 2014. Towards Critical Data Studies: Charting and Unpacking Data Assemblages and Their Work. Social Science Research Network, Rochester, NY. Retrieved September 6, 2019 from https://papers.ssrn.com/abstract=2474112.",
      "doi": ""
    },
    {
      "text": "Sandjar Kozubaev, Chris Elsden, Noura Howell, Marie Louise Juul Søndergaard, Nick Merrill, Britta Schulte, and Richmond Y. Wong. 2020. Expanding Modes of Reflection in Design Futuring. (2020), 1–15. DOI: https://doi.org/10.1145/3313831.3376526.",
      "doi": "10.1145/3313831.3376526"
    },
    {
      "text": "Albrecht Kurze, Andreas Bischof, Sören Totzauer, Michael Storz, Maximilian Eibl, Margot Brereton, and Arne Berger. 2020. Guess the Data: Data Work to Understand How People Make Sense of and Use Simple Sensor Data from Homes. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, Honolulu, HI, USA, 1–12. DOI: https://doi.org/10.1145/3313831.3376273.",
      "doi": "10.1145/3313831.3376273"
    },
    {
      "text": "Yanni Alexander Loukissas. 2019. All Data Are Local: Thinking Critically in a Data-Driven Society. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Andrés Lucero, Audrey Desjardins, Carman Neustaedter, Kristina Höök, Marc Hassenzahl, and Marta E. Cecchinato. 2019. A Sample of One: First-Person Research Methods in HCI. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion (DIS ’19 Companion), ACM, New York, NY, USA, 385–388. DOI: https://doi.org/10.1145/3301019.3319996.",
      "doi": "10.1145/3301019.3319996"
    },
    {
      "text": "Giorgia Lupi and Stefanie Posavec. 2016. Dear Data. Princeton Architectural Press, New York.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2016. Digital companion species and eating data: Implications for theorising digital data–human assemblages. Big Data & Society 3, 1 (June 2016), 2053951715619947. DOI: https://doi.org/10.1177/2053951715619947.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2017. Feeling your data: Touch and making sense of personal digital data. New Media & Society 19, 10 (October 2017), 1599–1614. DOI: https://doi.org/10.1177/1461444817717515.",
      "doi": ""
    },
    {
      "text": "Aaron Marcus. 2013. The history of the future: Sci-Fi Movies and HCI. Interactions 20, 4 (2013), 64–67. DOI: https://doi.org/10.1017/S0040557404000250.",
      "doi": "10.1145/2486227.2486240"
    },
    {
      "text": "Daniele Miorandi, Sabrina Sicari, Francesco De Pellegrini, and Imrich Chlamtac. 2012. Internet of things: Vision, applications and research challenges. Ad Hoc Networks 10, 7 (September 2012), 1497–1516. DOI: https://doi.org/10.1016/j.adhoc.2012.02.016.",
      "doi": "10.1016/j.adhoc.2012.02.016"
    },
    {
      "text": "Jimmy Moore, Pascal Goffin, Miriah Meyer, Philip Lundrigan, Neal Patwari, Katherine Sward, and Jason Wiese. 2018. Managing In-home Environments Through Sensing, Annotating, and Visualizing Air Quality Data. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3 (September 2018), 128:1–128:28. DOI: https://doi.org/10.1145/3264938.",
      "doi": "10.1145/3264938"
    },
    {
      "text": "Omar Mubin, Mark Billinghurst, Mohammad Obaid, Philipp Jordan, Patricia Alves-Oliveria, Thommy Eriksson, Wolmet Barendregt, Daniel Sjolle, Morten Fjeld, and Simeon Simoff. 2016. Towards an Agenda for Sci-Fi Inspired HCI Research. Proceedings of the 13th International Conference on Advances in Computer Entertainment Technology - ACE2016 (2016), 1–6. DOI: https://doi.org/10.1145/3001773.3001786.",
      "doi": "10.1145/3001773.3001786"
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical Design in HCI Research: Designing and Learning Through Use-it-yourself. In Proceedings of the Designing Interactive Systems Conference (DIS ’12), ACM, New York, NY, USA, 514–523. DOI: https://doi.org/10.1145/2317956.2318034.",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "James Pierce and Carl DiSalvo. 2018. Addressing Network Anxieties with Alternative Design Metaphors. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), Association for Computing Machinery, New York, NY, USA, 1–13. DOI: https://doi.org/10.1145/3173574.3174123.",
      "doi": "10.1145/3173574.3174123"
    },
    {
      "text": "María Teresa Rodríguez, Sérgio Nunes, and Tiago Devezas. 2015. Telling Stories with Data Visualization. In Proceedings of the 2015 Workshop on Narrative & Hypertext (NHT ’15), ACM, New York, NY, USA, 7–11. DOI: https://doi.org/10.1145/2804565.2804567.",
      "doi": "10.1145/2804565.2804567"
    },
    {
      "text": "Mario Romero, Zachary Pousman, and Michael Mateas. 2008. Alien Presence in the Home: The Design of Tableau Machine. Personal Ubiquitous Comput. 12, 5 (June 2008), 373–382. DOI: https://doi.org/10.1007/s00779-007-0190-z.",
      "doi": "10.1007/s00779-007-0190-z"
    },
    {
      "text": "Daniela K. Rosner. 2018. Critical Fabulations: Reworking the Methods and Margins of Design. MIT Press.",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner, Samantha Shorey, Brock R. Craft, and Helen Remick. 2018. Making Core Memory: Design Inquiry into Gendered Legacies of Engineering and Craftwork. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), ACM, New York, NY, USA, 531:1–531:13. DOI: https://doi.org/10.1145/3173574.3174105.",
      "doi": "10.1145/3173574.3174105"
    },
    {
      "text": "E. Segel and J. Heer. 2010. Narrative Visualization: Telling Stories with Data. IEEE Transactions on Visualization and Computer Graphics 16, 6 (November 2010), 1139–1148. DOI: https://doi.org/10.1109/TVCG.2010.179.",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "Bruce Sterling. 2009. Design Fiction. Interactions 16, 3 (2009), 20. DOI: https://doi.org/10.1145/1516016.1516021.",
      "doi": "10.1145/1516016.1516021"
    },
    {
      "text": "Bruce M. Tharp and Stephanie Tharp. 2018. Discursive design: critical, speculative, and alternative things. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Peter Tolmie, Andy Crabtree, Tom Rodden, James Colley, and Ewa Luger. 2016. “This has to be the cats”: Personal Data Legibility in Networked Sensing Systems. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (CSCW ’16), Association for Computing Machinery, New York, NY, USA, 491–502. DOI: https://doi.org/10.1145/2818048.2819992.",
      "doi": "10.1145/2818048.2819992"
    },
    {
      "text": "Joris Toonders. 2014. Data Is the New Oil of the Digital Economy. Wired. Retrieved September 13, 2020 from https://www.wired.com/insights/2014/07/data-new-oil-digital-economy/.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Melwyn Pak Yong Ho, Stephen Brawner, Jiyun Lee, Sarah Mennicken, Noah Picard, Diane Schulze, and Michael L. Littman. 2016. Trigger-Action Programming in the Wild: An Analysis of 200,000 IFTTT Recipes. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), ACM, New York, NY, USA, 3227–3231. DOI: https://doi.org/10.1145/2858036.2858556.",
      "doi": "10.1145/2858036.2858556"
    },
    {
      "text": "Ron Wakkary, William Odom, Sabrina Hauser, Garnet Hertz, and Henry Lin. 2015. Material Speculation: Actual Artifacts for Critical Inquiry. Aarhus Series on Human Centered Computing 1, 1 (2015), 12. DOI: https://doi.org/10.7146/aahcc.v1i1.21299.",
      "doi": "10.7146/aahcc.v1i1.21299"
    },
    {
      "text": "Jayne Wallace, Jon Rogers, Michael Shorter, Pete Thomas, Martin Skelly, and Richard Cook. 2018. The SelfReflector: Design, IoT and the High Street. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), ACM, New York, NY, USA, 423:1–423:12. DOI: https://doi.org/10.1145/3173574.3173997.",
      "doi": "10.1145/3173574.3173997"
    },
    {
      "text": "Gary Wolf. 2009. Know Thyself: Tracking Every Facet of Life, from Sleep to Mood to Pain, 24/7/365. Wired. Retrieved August 20, 2019 from https://www.wired.com/2009/06/lbnp-knowthyself/.",
      "doi": ""
    },
    {
      "text": "Richmond Y. Wong, Vera Khovanskaya, Sarah E. Fox, Nick Merrill, and Phoebe Sengers. 2020. Infrastructural Speculations: Tactics for Designing and Interrogating Lifeworlds. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–15. DOI: https://doi.org/10.1145/3313831.3376515.",
      "doi": "10.1145/3313831.3376515"
    },
    {
      "text": "Richmond Y. Wong, Ellen Van Wyk, and James Pierce. 2017. Real-Fictional Entanglements: Using Science Fiction and Design Fiction to Interrogate Sensing Technologies. In Proceedings of the 2017 Conference on Designing Interactive Systems (DIS ’17), ACM, New York, NY, USA, 567–579. DOI: https://doi.org/10.1145/3064663.3064682.",
      "doi": "10.1145/3064663.3064682"
    },
    {
      "text": "Jong-bum Woo and Youn-kyung Lim. 2015. User Experience in Do-it-yourself-style Smart Homes. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp ’15), ACM, New York, NY, USA, 779–790. DOI: https://doi.org/10.1145/2750858.2806063",
      "doi": "10.1145/2750858.2806063"
    },
    {
      "text": "2020 Right to erasure. Retrieved September 16, 2020 from https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/individual-rights/right-to-erasure.",
      "doi": ""
    },
    {
      "text": "Green Paper: Fostering the Advancement of the Internet of Things | National Telecommunications and Information Administration. Retrieved July 29, 2019 from https://www.ntia.doc.gov/other-publication/2017/green-paper-fostering-advancement-internet-things.",
      "doi": ""
    }
  ]
}