{
  "doi": "10.1145/3411764.3445065",
  "title": "Money Whispers: Informality, International Politics, and Immigration in Transnational Finance",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "While the growth of financial technologies (FinTech) is making the flow of money faster, easier, and more secure, such technologies are often unable to serve many countries due to the global political environment. Despite its severe impact, this issue has remained understudied in the HCI literature. We address this gap by presenting our findings from a three-month-long ethnography with the Iranian community in Toronto, Canada. We present their struggles in transferring money to and from their home country - a process that entails financial loss, fear, uncertainty, and privacy breaches. We also outline the informal workarounds that allow this community to circumvent these challenges, along with the associated hassles. This paper contributes to broadening the scope of FinTech in the HCI literature by connecting it with the politics surrounding transnational transactions. We discuss the design implications of our findings and their contribution to the broader interests of HCI in mobilities and social justice.",
  "authors": [
    {
      "name": "Yasaman Rohanifar",
      "institution": "Computer Science University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441833",
      "orcid": "missing"
    },
    {
      "name": "Priyank Chandra",
      "institution": "Faculty of Information University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658714851",
      "orcid": "0000-0003-4024-8871"
    },
    {
      "name": "M Ataur Rahman",
      "institution": "Backbase, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701308",
      "orcid": "missing"
    },
    {
      "name": "Syed Ishtiaque Ahmed",
      "institution": "Computer Science University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502686136",
      "orcid": "0000-0003-2452-0687"
    }
  ],
  "references": [
    {
      "text": "2019. Azimo. https://azimo.com/en",
      "doi": ""
    },
    {
      "text": "2019. Transferwise. https://transferwise.com",
      "doi": ""
    },
    {
      "text": "2019. XE: Convert USD/IRR. United States Dollar to Iran Rial. https://www.xe.com/currencyconverter/convert/?Amount=1&From=USD&To=IRR",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Shion Guha, Md Rashidujjaman Rifat, Faysal Hossain Shezan, and Nicola Dell. 2016. Privacy in repair: An analysis of the privacy challenges surrounding broken digital artifacts in bangladesh. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. 1–10.",
      "doi": "10.1145/2909609.2909661"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Jay Chen, and Nicola Dell. 2017. Digital privacy challenges with shared mobile phone use in bangladesh. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–20.",
      "doi": "10.1145/3134652"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Shion Guha, Md Rashidujjaman Rifat, and Nicola Dell. 2017. Privacy, security, and surveillance in the Global South: A study of biometric mobile SIM registration in Bangladesh. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 906–918.",
      "doi": "10.1145/3025453.3025961"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Irtaza Haider, Jay Chen, and Nicola Dell. 2019. ” Everyone Has Some Personal Stuff” Designing to Support Digital Privacy with Shared Mobile Phone Use in Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300410"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, and Md Rashidujjaman Rifat. 2015. Learning to fix: knowledge, collaboration and mobile phone repair in Dhaka, Bangladesh. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. 1–10.",
      "doi": "10.1145/2737856.2738018"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Nusrat Jahan Mim, and Steven J Jackson. 2015. Residual mobilities: infrastructural displacement and post-colonial computing in Bangladesh. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 437–446.",
      "doi": "10.1145/2702123.2702573"
    },
    {
      "text": "Asam Almohamed and Dhaval Vyas. 2016. Vulnerability of Displacement: Challenges for Integrating Refugees and Asylum Seekers in Host Communities. In Proceedings of the 28th Australian Conference on Computer-Human Interaction (Launceston, Tasmania, Australia) (OzCHI ’16). ACM, New York, NY, USA, 125–134. https://doi.org/10.1145/3010915.3010948",
      "doi": "10.1145/3010915.3010948"
    },
    {
      "text": "Morgan G Ames, Silvia Lindtner, Shaowen Bardzell, Jeffrey Bardzell, Lilly Nguyen, Syed Ishtiaque Ahmed, Nusrat Jahan, Steven J Jackson, and Paul Dourish. 2018. Making or making do? Challenging the mythologies of making and hacking. Technical Report.",
      "doi": ""
    },
    {
      "text": "William L Anthes and Bruce W Most. 2000. Frozen in the headlights: The dynamics of women and money. Journal of Financial Planning 13, 9 (2000), 130.",
      "doi": ""
    },
    {
      "text": "Peyman Asadzade. 2019. Faith or Ideology? Religiosity, Political Islam, and Anti-Americanism in Iran. Journal of Global Security Studies(2019).",
      "doi": ""
    },
    {
      "text": "Pierre Bachas, Paul Gertler, Sean Higgins, and Enrique Seira. 2018. Digital financial services go a long way: Transaction costs and financial inclusion. In AEA Papers and Proceedings, Vol. 108. 444–48.",
      "doi": ""
    },
    {
      "text": "Roger Ballard. 2006. Hawala: criminal haven or vital financial network?(2006).",
      "doi": ""
    },
    {
      "text": "Christina Bannier, Tobias Meyll, Florian Röder, and Andreas Walter. 2019. The gender gap in ‘Bitcoin literacy’. Journal of Behavioral and Experimental Finance 22 (2019), 129–134.",
      "doi": ""
    },
    {
      "text": "BBC. 2019. US-Iran relations: A brief history. https://www.bbc.com/news/world-middle-east-24316661",
      "doi": ""
    },
    {
      "text": "Benedetta Berti. 2008. The economics of counterterrorism: Devising a normative regulatory framework for the hawala system. MIT International Review(2008), 14–21.",
      "doi": ""
    },
    {
      "text": "Joshua E Blumenstock, Michael Callen, Tarek Ghani, and Lucas Koepke. 2015. Promises and pitfalls of mobile money in Afghanistan: evidence from a randomized control trial. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. ACM, 15.",
      "doi": "10.1145/2737856.2738031"
    },
    {
      "text": "Charles B Bowers. 2008. Hawala, Money Laundering, and Terrorism Finance: Mirco-Lending as an End to Illicit Remittance. Denv. J. Int’l L. & Pol’y 37 (2008), 379.",
      "doi": ""
    },
    {
      "text": "Geoffrey C Bowker and Susan Leigh Star. 2000. Sorting things out: Classification and its consequences. MIT press.",
      "doi": "10.5555/380681"
    },
    {
      "text": "Alice V. Brown and Jaz Hee-jeong Choi. 2018. Refugee and the Post-trauma Journeys in the Fuzzy Front End of Co-creative Practices. In Proceedings of the 15th Participatory Design Conference: Full Papers - Volume 1(Hasselt and Genk, Belgium) (PDC ’18). ACM, New York, NY, USA, Article 15, 11 pages. https://doi.org/10.1145/3210586.3210598",
      "doi": ""
    },
    {
      "text": "Deana Brown, Victoria Ayo, and Rebecca E. Grinter. 2014. Reflection Through Design: Immigrant Women’s Self-reflection on Managing Health and Wellness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 1605–1614. https://doi.org/10.1145/2556288.2557119",
      "doi": "10.1145/2556288.2557119"
    },
    {
      "text": "Monica Caraway, Daniel A. Epstein, and Sean A. Munson. 2017. Friends Don’T Need Receipts: The Curious Case of Social Awareness Streams in the Mobile Payment App Venmo. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 28 (Dec. 2017), 17 pages. https://doi.org/10.1145/3134663",
      "doi": "10.1145/3134663"
    },
    {
      "text": "Sam Castle, Fahad Pervaiz, Galen Weld, Franziska Roesner, and Richard Anderson. 2016. Let’s Talk Money: Evaluating the Security Challenges of Mobile Money in the Developing World. In Proceedings of the 7th Annual Symposium on Computing for Development. ACM, 4.",
      "doi": "10.1145/3001913.3001919"
    },
    {
      "text": "Miguel Angel Centeno and Alejandro Portes. 2006. The informal economy in the shadow of the state. Out of the shadows: Political action and the informal economy in Latin America (2006), 23–48.",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2019. International migrants by country. Retrieved March 20, 2019 from https://www.pewresearch.org/global/interactives/international-migrants-by-country/",
      "doi": ""
    },
    {
      "text": "Pew Research Center. 2019. Remittances from abroad are major economic assets for some developing countries. Retrieved December 22, 2019 from https://www.pewresearch.org/fact-tank/2018/01/29/remittances-from-abroad-are-major-economic-assets-for-some-developing-countries/",
      "doi": ""
    },
    {
      "text": "Priyank Chandra. 2017. Informality and invisibility: Traditional technologies as tools for collaboration in an informal market. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 4765–4775.",
      "doi": "10.1145/3025453.3025643"
    },
    {
      "text": "Priyank Chandra, Syed Ishtiaque Ahmed, and Joyojeet Pal. 2017. Market practices and the bazaar: Technology consumption in ICT markets in the global south. In Proceedings of the 2017 CHI conference on human factors in computing systems. ACM, 4741–4752.",
      "doi": "10.1145/3025453.3025970"
    },
    {
      "text": "Priyank Chandra and Joyojeet Pal. 2019. Rumors and Collective Sensemaking: Managing Ambiguity in an Informal Marketplace. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 333.",
      "doi": "10.1145/3290605.3300563"
    },
    {
      "text": "Haiyang Chen and Ronald P Volpe. 1998. An analysis of personal financial literacy among college students. Financial services review 7, 2 (1998), 107–128.",
      "doi": ""
    },
    {
      "text": "Haiyang Chen and Ronald P Volpe. 2002. Gender differences in personal financial literacy among college students. Financial services review 11, 3 (2002), 289–307.",
      "doi": ""
    },
    {
      "text": "Marie Chêne. 2008. Hawala remittance system and money laundering. U4 Expert Answer. Anti-Corruption Resource Centre, Norway (2008).",
      "doi": ""
    },
    {
      "text": "Chron. 2013. What Country Doesn’t Work With PayPal?Retrieved September 18, 2019 from https://smallbusiness.chron.com/country-doesnt-work-paypal-66099.html",
      "doi": ""
    },
    {
      "text": "Sandra Colavecchia. 2009. Moneywork: Caregiving and the management of family finances. Family Patterns, Gender Relations(2009), 417–27.",
      "doi": ""
    },
    {
      "text": "Lizzie Coles-Kemp and Rikke Bjerg Jensen. 2019. Accessing a New Land: Designing for a Social Conceptualisation of Access. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 181, 12 pages. https://doi.org/10.1145/3290605.3300411",
      "doi": "10.1145/3290605.3300411"
    },
    {
      "text": "Daryl Collins, Jonathan Morduch, Stuart Rutherford, and Orlanda Ruthven. 2010. Portfolios of the poor: how the world’s poor live on $2 a day. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Jun Dai and Miklos A Vasarhelyi. 2017. Toward blockchain-based accounting and assurance. Journal of Information Systems 31, 3 (2017), 5–21.",
      "doi": ""
    },
    {
      "text": "Saeed Kamali Dehghan. 2018. Iranian rial hits all-time low as citizens scramble for US dollars. https://www.theguardian.com/world/2018/apr/11/iranian-rial-all-time-low-us-dollars-tehran",
      "doi": ""
    },
    {
      "text": "Ana Maria Bustamante Duarte, Nina Brendel, Auriol Degbelo, and Christian Kray. 2018. Participatory Design and Participatory Research: An HCI Case Study with Young Forced Migrants. ACM Trans. Comput.-Hum. Interact. 25, 1, Article 3 (Feb. 2018), 39 pages. https://doi.org/10.1145/3145472",
      "doi": ""
    },
    {
      "text": "Chris Elsden, Arthi Manohar, Jo Briggs, Mike Harding, Chris Speed, and John Vines. 2018. Making Sense of Blockchain Applications: A Typology for HCI. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 458, 14 pages. https://doi.org/10.1145/3173574.3174032",
      "doi": "10.1145/3173574.3174032"
    },
    {
      "text": "Euronews. 2018. Foreign Exchange Market Fluctuations: U.S. dollar passed 19,000 and Euro passed 22,000 Tomans. http://tiny.cc/EuroNewsDollar",
      "doi": ""
    },
    {
      "text": "Peter Evans. 2000. Fighting marginalization with transnational networks: Counter-hegemonic globalization. Contemporary sociology 29, 1 (2000), 230.",
      "doi": ""
    },
    {
      "text": "Karen E. Fisher, Ann Peterson Bishop, Lassana Magassa, and Phil Fawcett. 2014. Action!: Codesigning Interactive Technology with Immigrant Teens. In Proceedings of the 2014 Conference on Interaction Design and Children (Aarhus, Denmark) (IDC ’14). ACM, New York, NY, USA, 345–348. https://doi.org/10.1145/2593968.2610488",
      "doi": "10.1145/2593968.2610488"
    },
    {
      "text": "Karen E Fisher, Reem Talhouk, Katya Yefimova, Dalya Al-Shahrabi, Eiad Yafi, Sam Ewald, and Rob Comber. 2017. Za’atari refugee cookbook: relevance, challenges and design considerations. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 2576–2583.",
      "doi": "10.1145/3027063.3053235"
    },
    {
      "text": "Raquel Fonseca, Kathleen J Mullen, Gema Zamarro, and Julie Zissimopoulos. 2012. What explains the gender gap in financial literacy? The role of household decision making. Journal of Consumer Affairs 46, 1 (2012), 90–106.",
      "doi": ""
    },
    {
      "text": "Organisation for Economic Co-operationand Development | IOM | UNHCR. 2019. 2019 International Migration and Displacement Trends and Policies Report to the G20. Technical Report. Organisation for Economic Co-operation and Development.",
      "doi": ""
    },
    {
      "text": "International Organization for Migration (IOM) | UN Migration. 2019. Global Migration Trends. Retrieved September 10, 2019 from https://www.iom.int/global-migration-trends",
      "doi": ""
    },
    {
      "text": "Ishita Ghosh. 2016. Contextualizing Intermediated Use in the Developing World: Findings from India & Ghana. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 355–359.",
      "doi": "10.1145/2858036.2858594"
    },
    {
      "text": "Barney Glaser and Anselm Strauss. 1967. Grounded theory: The discovery of grounded theory. Sociology the journal of the British sociological association 12, 1(1967), 27–49.",
      "doi": ""
    },
    {
      "text": "Steve Graham and Simon Marvin. 2002. Splintering urbanism: networked infrastructures, technological mobilities and the urban condition. Routledge.",
      "doi": ""
    },
    {
      "text": "Itai Grinberg. 2012. The battle over taxing offshore accounts. UCLA L. Rev. 60(2012), 304.",
      "doi": ""
    },
    {
      "text": "Junius Gunaratne, Jeremy Burke, and Oded Nov. 2017. Empowering Investors with Social Annotation When Saving for Retirement. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(Portland, Oregon, USA) (CSCW ’17). ACM, New York, NY, USA, 1066–1081. https://doi.org/10.1145/2998181.2998253",
      "doi": "10.1145/2998181.2998253"
    },
    {
      "text": "Junius Gunaratne and Oded Nov. 2015. Informing and Improving Retirement Saving Performance Using Behavioral Economics Theory-driven User Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 917–920. https://doi.org/10.1145/2702123.2702408",
      "doi": "10.1145/2702123.2702408"
    },
    {
      "text": "SM Taiabul Haque, MD Romael Haque, Swapnil Nandy, Priyank Chandra, Mahdi Nasrullah Al-Ameen, Shion Guha, and Syed Ishtiaque Ahmed. 2020. Privacy Vulnerabilities in Public Digital Service Centers in Dhaka, Bangladesh. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–12.",
      "doi": "10.1145/3392561.3394642"
    },
    {
      "text": "SM Taiabul Haque, Pratyasha Saha, Muhammad Sajidur Rahman, and Syed Ishtiaque Ahmed. 2019. Of Ulti,’hajano’, and” Matachetar otanetak datam” Exploring Local Practices of Exchanging Confidential and Sensitive Information in Urban Bangladesh. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": ""
    },
    {
      "text": "Keith Hart. 2008. Between bureaucracy and the people: a political history of informality. Number 2008: 27. DIIS Working paper.",
      "doi": ""
    },
    {
      "text": "Adam Hayes. 2019. Point of Sale (POS). https://www.investopedia.com/terms/p/point-of-sale.asp",
      "doi": ""
    },
    {
      "text": "Gina Higginbottom, Jennifer J Pillay, and Nana Y Boadu. 2013. Guidance on performing focused ethnographies with an emphasis on healthcare research. The Qualitative Report 18, 9 (2013), 1–6.",
      "doi": ""
    },
    {
      "text": "The White House. 2018. Remarks by President Trump on the Joint Comprehensive Plan of Action. https://www.whitehouse.gov/briefings-statements/remarks-president-trump-joint-comprehensive-plan-action/",
      "doi": ""
    },
    {
      "text": "Joey Chiao-Yin Hsiao and Tawanna R. Dillahunt. 2018. Technology to Support Immigrant Access to Social Capital and Adaptation to a New Country. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 70 (Nov. 2018), 21 pages. https://doi.org/10.1145/3274339",
      "doi": ""
    },
    {
      "text": "Nick Hughes and Susie Lonie. 2007. M-PESA: mobile money for the “unbanked” turning cellphones into 24-hour tellers in Kenya. Innovations: technology, governance, globalization 2, 1-2(2007), 63–81.",
      "doi": ""
    },
    {
      "text": "Faheem Hussain, Abdullah Hasan Safir, Dina Sabie, Zulkarin Jahangir, and Syed Ishtiaque Ahmed. 2020. Infrastructuring hope: Solidarity, leadership, negotiation, and ict among the rohingya refugees in bangladesh. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–12.",
      "doi": "10.1145/3392561.3394640"
    },
    {
      "text": "Samia Ibtasam, Hamid Mehmood, Lubna Razaq, Jennifer Webster, Sarah Yu, and Richard Anderson. 2017. An exploration of smartphone based mobile money applications in Pakistan. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development. ACM, 1.",
      "doi": "10.1145/3136560.3136571"
    },
    {
      "text": "Investment Migration Insider. 2019. Investment Migration Insider Data Center - Investment Migration Insider. Retrieved September 19, 2019 from https://www.imidaily.com/data/",
      "doi": ""
    },
    {
      "text": "The National Interest. 2013. How the Shah Entangled America. https://nationalinterest.org/commentary/how-the-shah-entangled-america-8821",
      "doi": ""
    },
    {
      "text": "IRNA. 2019. Migration of Iranians back to Telegram. https://www.irna.ir/news/3679505/%D8%A8%D8%A7%D8%B2%DA%AF%D8%B4%D8%AA-%D9%85%D8%B1%D8%AF%D9%85-%D8%A8%D9%87-%D8%AA%D9%84%DA%AF%D8%B1%D8%A7%D9%85",
      "doi": ""
    },
    {
      "text": "Karim Jabbar and Pernille Bjørn. 2017. Growing the Blockchain Information Infrastructure. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 6487–6498. https://doi.org/10.1145/3025453.3025959",
      "doi": "10.1145/3025453.3025959"
    },
    {
      "text": "Steven J Jackson, Syed Ishtiaque Ahmed, and Md Rashidujjaman Rifat. 2014. Learning, innovation, and sustainability among mobile phone repairers in Dhaka, Bangladesh. In Proceedings of the 2014 conference on Designing interactive systems. 905–914.",
      "doi": "10.1145/2598510.2598576"
    },
    {
      "text": "Patrick M Jost and Harjit Singh Sandhu. 2000. The hawala alternative remittance system and its role in money laundering.",
      "doi": ""
    },
    {
      "text": "Julia Kagan. 2019. Bank Draft. https://www.investopedia.com/terms/b/bank_draft.asp",
      "doi": ""
    },
    {
      "text": "Joseph Jofish Kaye, Mary McCuistion, Rebecca Gulotta, and David A. Shamma. 2014. Money Talks: Tracking Personal Finances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 521–530. https://doi.org/10.1145/2556288.2556975",
      "doi": "10.1145/2556288.2556975"
    },
    {
      "text": "Leyla Khodabakhshi. 2018. Why ordinary Iranians are turning to internet backdoors to beat censorship. https://www.bbc.com/news/blogs-trending-42612546",
      "doi": ""
    },
    {
      "text": "R King and K Dovey. 2013. Active interstices. Urban Interstices: The Aesthetics and the Politics of the In-between (2013), 183–203.",
      "doi": ""
    },
    {
      "text": "Jani Kinnunen, Kati Alha, and Janne Paavilainen. 2016. Creating Play Money for Free-to-play and Gambling Games. In Proceedings of the 20th International Academic Mindtrek Conference (Tampere, Finland) (AcademicMindtrek ’16). ACM, New York, NY, USA, 385–392. https://doi.org/10.1145/2994310.2994336",
      "doi": "10.1145/2994310.2994336"
    },
    {
      "text": "Michel S Laguerre. 1994. Informality and Urban Politics. In The Informal City. Springer, 75–101.",
      "doi": ""
    },
    {
      "text": "Yvonne Lai and Michaela Hynie. 2010. Communlty engagement and well-belng of lmmlgrants: The role of knowledge. Immigrant Mental Health La santé mentale des immigrants 93 (2010).",
      "doi": ""
    },
    {
      "text": "Brian Larkin. 2013. The politics and poetics of infrastructure. Annual review of anthropology 42 (2013), 327–343.",
      "doi": ""
    },
    {
      "text": "Lawrence Lessig. 2009. Code: And other laws of cyberspace.",
      "doi": ""
    },
    {
      "text": "Makayla Lewis and Mark Perry. 2019. Follow the Money: Managing Personal Finance Digitally. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 390, 14 pages. https://doi.org/10.1145/3290605.3300620",
      "doi": "10.1145/3290605.3300620"
    },
    {
      "text": "Annamaria Lusardi and Olivia S Mitchell. 2014. The economic importance of financial literacy: Theory and evidence. Journal of economic literature 52, 1 (2014), 5–44.",
      "doi": ""
    },
    {
      "text": "Jens M Manzke. 1998. Adaptation of a cash dispenser to the needs of blind and visually impaired people. In Proceedings of the third international ACM conference on Assistive technologies. ACM, 116–123.",
      "doi": "10.1145/274497.274518"
    },
    {
      "text": "Doreen Massey. 2013. Space, place and gender. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Gordon Mathews, Gustavo Lins Ribeiro, and Carlos Alba Vega. 2012. Globalization from below: The world’s other economy. Routledge.",
      "doi": ""
    },
    {
      "text": "Bill Maurer. 2015. How would you like to pay?: how technology is changing the future of money. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Chase McCain. 2015. The History of US-Iran Relations and its Effect on the JCPOA Negotiations. (2015).",
      "doi": ""
    },
    {
      "text": "Rob McCusker. 2005. Underground banking: legitimate remittance network or money laundering system?Trends & Issues in Crime & Criminal Justice300 (2005).",
      "doi": ""
    },
    {
      "text": "Indrani Medhi, S.N. Nagasena Gautama, and Kentaro Toyama. 2009. A Comparison of Mobile Money-transfer UIs for Non-literate and Semi-literate Users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). ACM, New York, NY, USA, 1741–1750. https://doi.org/10.1145/1518701.1518970",
      "doi": "10.1145/1518701.1518970"
    },
    {
      "text": "Apurv Mehra, Srihari Muralidhar, Sambhav Satija, Anupama Dhareshwar, and Jacki O’Neill. 2018. Prayana: Intermediated Financial Management in Resource-Constrained Settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 389, 13 pages. https://doi.org/10.1145/3173574.3173963",
      "doi": "10.1145/3173574.3173963"
    },
    {
      "text": "MigrationDataPortal. 2019. Global Migration Data Portal. Retrieved September 10, 2019 from https://migrationdataportal.org/?i=stock_abs_&t=2019",
      "doi": ""
    },
    {
      "text": "Nusrat Jahan Mim. 2020. Religion at the Margins: Resistance to Secular Humanitarianism at the Rohingya Refugee Camps in Bangladesh. Religions 11, 8 (2020), 423.",
      "doi": ""
    },
    {
      "text": "Barbara Misztal. 2002. Informality: Social theory and contemporary practice. Routledge.",
      "doi": ""
    },
    {
      "text": "Maziar Motamedi. 2019. ’Billions’ are stuffed under mattresses in Iran. https://www.aljazeera.com/indepth/features/billions-stuffed-mattresses-iran-190501201552620.html",
      "doi": ""
    },
    {
      "text": "The United Nations. 2019. Refugees | United Nations. https://www.un.org/en/sections/issues-depth/refugees/",
      "doi": ""
    },
    {
      "text": "United Nations. 2017. International Migration Report. Technical Report. United Nations.",
      "doi": ""
    },
    {
      "text": "Ali Ndiwalana, Olga Morawczynski, and Oliver Popov. 2010. Mobile money use in Uganda: A preliminary study. M4D 2010 121(2010).",
      "doi": ""
    },
    {
      "text": "CBC News. 2007. Royal Bank clarifies U.S. dollar account policy. https://www.cbc.ca/news/canada/royal-bank-clarifies-u-s-dollar-account-policy-1.668822",
      "doi": ""
    },
    {
      "text": "CBC News. 2012. Iranian-Canadians fume as TD closes accounts. https://www.cbc.ca/news/canada/toronto/iranian-canadians-fume-as-td-closes-accounts-1.1268468",
      "doi": ""
    },
    {
      "text": "Tejarat News. 2019. A 981 percent increase in rate of dollar since 10 years ago, what happened to dollar?https://tejaratnews.com/%D9%82%DB%8C%D9%85%D8%AA-%D8%AF%D9%84%D8%A7%D8%B1-%D8%AF%D8%B1-10-%D8%B3%D8%A7%D9%84-%D8%A7%D8%AE%DB%8C%D8%B1",
      "doi": ""
    },
    {
      "text": "Sarah Nikkhah, Andrew D Miller, and Alyson L Young. 2018. Telegram as An Immigration Management Tool. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 345–348.",
      "doi": "10.1145/3272973.3274093"
    },
    {
      "text": "OECD. 2019. International student mobility. Retrieved September 19, 2019 from https://doi.org/10.1787/4bcf6fc3-en",
      "doi": ""
    },
    {
      "text": "Government of Canada. 2018. What you can bring home to Canada. https://travel.gc.ca/returning/customs/what-you-can-bring-home-to-canada",
      "doi": ""
    },
    {
      "text": "Government of Canada. 2019. Proceeds of Crime (Money Laundering) and Terrorist Financing Act. https://laws-lois.justice.gc.ca/pdf/p-24.501.pdf.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Priyank Chandra, Vaishnav Kameswaran, Aakanksha Parameshwar, Sneha Joshi, and Aditya Johri. 2018. Digital Payment and Its Discontents: Street Shops and the Indian Government’s Push for Cashless Transactions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 229, 13 pages. https://doi.org/10.1145/3173574.3173803",
      "doi": "10.1145/3173574.3173803"
    },
    {
      "text": "Nikos Passas. 2005. Formalizing the informal? Problems in the national and international regulation of Hawala. Regulatory frameworks for Hawala and other remittance systems (2005), 7–16.",
      "doi": ""
    },
    {
      "text": "PayPal. 2019. PayPal Global - All countries and markets - PayPal. Retrieved September 18, 2019 from https://www.paypal.com/ca/webapps/mpp/country-worldwide",
      "doi": ""
    },
    {
      "text": "Tzu-Chin Martina Peng, Suzanne Bartholomae, Jonathan J Fox, and Garrett Cravener. 2007. The impact of personal finance education delivered in high school and college courses. Journal of family and economic issues 28, 2 (2007), 265–284.",
      "doi": ""
    },
    {
      "text": "Migration Data Portal. 2018. International students | Migration data portal. Retrieved September 19, 2019 from https://migrationdataportal.org/themes/international-students#key-trends",
      "doi": ""
    },
    {
      "text": "Migration Data Portal. 2019. Labour migration data | Migration data portal. Retrieved September 19, 2019 from https://migrationdataportal.org/themes/labour-migration",
      "doi": ""
    },
    {
      "text": "Alejandro Portes. 2000. Globalization from below: the rise of transnational communities. The ends of globalization: bringing society back in (2000), 253–70.",
      "doi": ""
    },
    {
      "text": "Maryam Razavy. 2005. Hawala: An underground haven for terrorists or social phenomenon?Crime, Law and Social Change 44, 3 (2005), 277–299.",
      "doi": ""
    },
    {
      "text": "Mohammad Rashidujjaman Rifat, Hasan Mahmud Prottoy, and Syed Ishtiaque Ahmed. 2019. The Breaking Hand: Skills, Care, and Sufferings of the Hands of an Electronic Waste Worker in Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300253"
    },
    {
      "text": "Ananya Roy. 2009. Why India cannot plan its cities: Informality, insurgence and the idiom of urbanization. Planning theory 8, 1 (2009), 76–87.",
      "doi": ""
    },
    {
      "text": "Dina Sabie and Syed Ishtiaque Ahmed. 2019. Moving into a Technology Land: Exploring the Challenges for the Refugees in Canada in Accessing Its Computerized Infrastructures. In Proceedings of the 2Nd ACM SIGCAS Conference on Computing and Sustainable Societies (Accra, Ghana) (COMPASS ’19). ACM, New York, NY, USA, 218–233. https://doi.org/10.1145/3314344.3332481",
      "doi": "10.1145/3314344.3332481"
    },
    {
      "text": "Dina Sabie, Samar Sabie, and Syed Ishtiaque Ahmed. 2020. Memory through Design: Supporting Cultural Identity for Immigrants through a Paper-Based Home Drafting Tool. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376636"
    },
    {
      "text": "Dina Sabie, Samar Sabie, Cansu E Dedeoglu, Yasaman Rohanifar, Fatma Hashim, Steve Easterbrook, and Syed Ishtiaque Ahmed. 2019. Exile Within Borders: Understanding the Limits of the Internally Displaced People (IDPs) in Iraq. In Proceedings of the Fifth Workshop on Computing within Limits. 1–16.",
      "doi": "10.1145/3338103.3338104"
    },
    {
      "text": "Corina Sas and Irni Eliana Khairuddin. 2015. Exploring trust in Bitcoin technology: a framework for HCI research. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. ACM, 338–342.",
      "doi": "10.1145/2838739.2838821"
    },
    {
      "text": "Corina Sas and Irni Eliana Khairuddin. 2017. Design for trust: An exploration of the challenges and opportunities of bitcoin users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6499–6510.",
      "doi": "10.1145/3025453.3025886"
    },
    {
      "text": "Saskia Sassen. 1990. The mobility of labor and capital: A study in international investment and labor flow. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Saskia Sassen. 1997. Informalization in advanced market economies. Vol. 20. Development Policies Department, International Labour Office.",
      "doi": ""
    },
    {
      "text": "Bala Shanmugam. 2005. Hawala and money laundering: a Malaysian perspective. Journal of Money Laundering Control 8, 1 (2005), 37–47.",
      "doi": ""
    },
    {
      "text": "Irina Shklovski, Janet Vertesi, and Silvia Lindtner. 2014. Introduction to this special issue on transnational HCI. Human–Computer Interaction 29, 1 (2014), 1–21.",
      "doi": ""
    },
    {
      "text": "Prem Sikka. 2003. The role of offshore financial centres in globalization. In Accounting Forum, Vol. 27. 365–399.",
      "doi": ""
    },
    {
      "text": "Sudheesh Singanamalla, Venkatesh Potluri, Colin Scott, and Indrani Medhi-Thies. 2019. PocketATM: Understanding and Improving ATM Accessibility in India. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development (Ahmedabad, India) (ICTD ’19). ACM, New York, NY, USA, Article 14, 11 pages. https://doi.org/10.1145/3287098.3287106",
      "doi": "10.1145/3287098.3287106"
    },
    {
      "text": "Supriya Singh. 2013. Globalization and money: a global South perspective. Rowman & Littlefield.",
      "doi": ""
    },
    {
      "text": "Erica Paula Sioson and Chul Ju Kim. 2019. Closing the Gender Gap in Financial Inclusion through Fintech. (2019).",
      "doi": ""
    },
    {
      "text": "Janet Stocks, Capitolina Diaz-Martinez, and Björn Halleröd. 2007. Modern couples sharing money, sharing life. Springer.",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 2002. Practice-based design of information systems: Notes from the hyperdeveloped world. The information society 18, 2 (2002), 139–144.",
      "doi": ""
    },
    {
      "text": "Reem Talhouk, Syed Ishtiaque Ahmed, Volker Wulf, Clara Crivellaro, Vasilis Vlachokyriakos, and Patrick Olivier. 2016. Refugees and HCI SIG: The role of HCI in responding to the refugee crisis. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1073–1076.",
      "doi": "10.1145/2851581.2886427"
    },
    {
      "text": "Reem Talhouk, Sandra Mesmar, Anja Thieme, Madeline Balaam, Patrick Olivier, Chaza Akik, and Hala Ghattas. 2016. Syrian refugees and digital health in Lebanon: Opportunities for improving antenatal health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 331–342.",
      "doi": "10.1145/2858036.2858331"
    },
    {
      "text": "Adam Tarock. 1999. Iran-western Europe relations on the Mend. British Journal of Middle Eastern Studies 26, 1 (1999), 41–61.",
      "doi": ""
    },
    {
      "text": "U.S. DEPARTMENT OF THE TREASURY. 2019. Treasury Sanctions Iran’s Central Bank and National Development Fund. https://home.treasury.gov/news/press-releases/sm780",
      "doi": ""
    },
    {
      "text": "UNHCR. 2019. UNHCR - Figures at a Glance. Retrieved September 10, 2019 from https://www.unhcr.org/figures-at-a-glance.html",
      "doi": ""
    },
    {
      "text": "John Urry. 2016. Mobilities: new perspectives on transport and society. Routledge.",
      "doi": ""
    },
    {
      "text": "Ann Varley. 2013. Postcolonialising informality?Environment and Planning D: Society and Space 31, 1 (2013), 4–22.",
      "doi": ""
    },
    {
      "text": "Dhaval Vyas, Stephen Snow, Paul Roe, and Margot Brereton. 2016. Social organization of household finance: Understanding artful financial systems in the home. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 1777–1789.",
      "doi": "10.1145/2818048.2819937"
    },
    {
      "text": "Mark Weiser. 1993. Some computer science issues in ubiquitous computing. Commun. ACM 36, 7 (1993), 75–84.",
      "doi": "10.1145/159544.159617"
    },
    {
      "text": "WesternUnion. 2019. Agent and Money Transfer Locations | Western Union. https://www.westernunion.com/om/en/find-locations.html",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019. Iran hostage crisis. Retrieved September 19, 2019 from https://en.wikipedia.org/wiki/Iran_hostage_crisis",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019. Iranian Revolution. Retrieved September 19, 2019 from https://en.wikipedia.org/wiki/Iranian_Revolution",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019. Iran–Iraq War. Retrieved September 19, 2019 from https://en.wikipedia.org/wiki/Iran%E2%80%93Iraq_War",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2019. Sanctions against Iran. Retrieved September 19, 2019 from https://en.wikipedia.org/wiki/Sanctions_against_Iran",
      "doi": ""
    },
    {
      "text": "Amanda Williams, Silvia Lindtner, Ken Anderson, and Paul Dourish. 2014. Multisited design: An analytical lens for Transnational HCI. Human–Computer Interaction 29, 1 (2014), 78–108.",
      "doi": ""
    },
    {
      "text": "Sarah Yu and Samia Ibtasam. 2018. A Qualitative Exploration of Mobile Money in Ghana. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, 21.",
      "doi": "10.1145/3209811.3209863"
    }
  ]
}