{
  "doi": "10.1145/3411764.3445283",
  "title": "AdapTutAR: An Adaptive Tutoring System for Machine Tasks in Augmented Reality",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Modern manufacturing processes are in a state of flux, as they adapt to increasing demand for flexible and self-configuring production. This poses challenges for training workers to rapidly master new machine operations and processes, i.e. machine tasks. Conventional in-person training is effective but requires time and effort of experts for each worker trained and not scalable. Recorded tutorials, such as video-based or augmented reality (AR), permit more efficient scaling. However, unlike in-person tutoring, existing recorded tutorials lack the ability to adapt to workers’ diverse experiences and learning behaviors. We present AdapTutAR, an adaptive task tutoring system that enables experts to record machine task tutorials via embodied demonstration and train learners with different AR tutoring contents adapting to each user’s characteristics. The adaptation is achieved by continually monitoring learners’ tutorial-following status and adjusting the tutoring content on-the-fly and in-situ. The results of our user study evaluation have demonstrated that our adaptive system is more effective and preferable than the non-adaptive one.",
  "tags": [
    "user state recognition",
    "adaptation",
    "training/learning",
    "manufacturing"
  ],
  "authors": [
    {
      "name": "Gaoping Huang",
      "institution": "Electrical & Computer Engineering Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659184538",
      "orcid": "missing"
    },
    {
      "name": "Xun Qian",
      "institution": "School of Mechanical Engineering Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659475205",
      "orcid": "0000-0003-1976-7992"
    },
    {
      "name": "Tianyi Wang",
      "institution": "School of Mechanical Engineering Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261679",
      "orcid": "0000-0001-9382-6466"
    },
    {
      "name": "Fagun Patel",
      "institution": "C-Design Lab Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702361",
      "orcid": "missing"
    },
    {
      "name": "Maitreya Sreeram",
      "institution": "Industrial Engineering Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702139",
      "orcid": "missing"
    },
    {
      "name": "Yuanzhi Cao",
      "institution": "Mechanical Engineering Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659162820",
      "orcid": "missing"
    },
    {
      "name": "Karthik Ramani",
      "institution": "School of Mechanical Engineering Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331502255",
      "orcid": "0000-0001-8639-5135"
    },
    {
      "name": "Alexander J. Quinn",
      "institution": "Electrical & Computer Engineering Purdue University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526997",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2020. Oculus. https://www.oculus.com/.",
      "doi": ""
    },
    {
      "text": "Andrea F. Abate, Vincenzo Loia, Michele Nappi, Stefano Ricciardi, and Enrico Boccola. 2008. ASSYST: Avatar baSed SYStem mainTenance. 2008 IEEE Radar Conference, RADAR 20081 (2008). https://doi.org/10.1109/RADAR.2008.4720962",
      "doi": ""
    },
    {
      "text": "M. Beyyoudh, M. K. Idrissi, and S. Bennani. 2018. A new approach of designing an intelligent tutoring system based on adaptive workflows and pedagogical games. In 2018 17th International Conference on Information Technology Based Higher Education and Training (ITHET). 1–7. https://doi.org/10.1109/ITHET.2018.8424619",
      "doi": ""
    },
    {
      "text": "Andrew Thomas Bimba, Norisma Idris, Ahmed Al-Hunaiyyan, Rohana Binti Mahmud, and Nor Liyana Bt Mohd Shuib. 2017. Adaptive feedback in computer-based learning environments: a review. Adaptive Behavior 25, 5 (2017), 217–234. https://doi.org/10.1177/1059712317727590",
      "doi": "10.1177/1059712317727590"
    },
    {
      "text": "Peter Brusilovsky and Hoah-Der Su. 2002. Adaptive Visualization Component of a Distributed Web-Based Adaptive Educational System. In Intelligent Tutoring Systems, Stefano A. Cerri, Guy Gouardères, and Fàbio Paraguaçu (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 229–238.",
      "doi": ""
    },
    {
      "text": "Alisa Burova, John Mäkelä, Jaakko Hakulinen, Tuuli Keskinen, Hanna Heinonen, Sanni Siltanen, and Markku Turunen. 2020. Utilizing VR and Gaze Tracking to Develop AR Solutions for Industrial Maintenance. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376405"
    },
    {
      "text": "Yuanzhi Cao, Xun Qian, Tianyi Wang, Rachel Lee, Ke Huo, and Karthik Ramani. [n.d.]. An Exploratory Study of Augmented Reality Presence for Tutoring Machine Tasks. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA, 2020-04-21) (CHI ’20). Association for Computing Machinery, 1–13. https://doi.org/10.1145/3313831.3376688",
      "doi": "10.1145/3313831.3376688"
    },
    {
      "text": "Jean-Rémy CHARDONNET, Guillaume Fromentin, and José OUTEIRO. 2017. Augmented reality as an aid for the use of machine tools. In 15th Management and Innovative Technologies (MIT) Conference. Sinaia, Romania, 1–4. https://hal.archives-ouvertes.fr/hal-01598613",
      "doi": ""
    },
    {
      "text": "Pei-Yu Chi, Sally Ahn, Amanda Ren, Mira Dontcheva, Wilmot Li, and Björn Hartmann. 2012. MixT: automatic generation of step-by-step mixed media tutorials. In Proceedings of the 25th annual ACM symposium on User interface software and technology. 93–102.",
      "doi": "10.1145/2380116.2380130"
    },
    {
      "text": "Albert T. Corbett, Kenneth R. Koedinger, and John R. Anderson. 1997. Chapter 37 - Intelligent Tutoring Systems. In Handbook of Human-Computer Interaction (Second Edition) (second edition ed.), Marting G. Helander, Thomas K. Landauer, and Prasad V. Prabhu (Eds.). North-Holland, Amsterdam, 849 – 874. https://doi.org/10.1016/B978-044481862-1.50103-5",
      "doi": ""
    },
    {
      "text": "F. De Crescenzio, M. Fantini, F. Persiani, L. Di Stefano, P. Azzari, and S. Salti. 2011. Augmented Reality for Aircraft Maintenance Training and Operations Support. IEEE Computer Graphics and Applications 31, 1 (2011), 96–101.",
      "doi": "10.1109/MCG.2011.4"
    },
    {
      "text": "Paula J. Durlach. 2019. Fundamentals, Flavors, and Foibles of Adaptive Instructional Systems. In Adaptive Instructional Systems, Robert A. Sottilare and Jessica Schwarz (Eds.). Springer International Publishing, Cham, 76–95.",
      "doi": ""
    },
    {
      "text": "Pavel Dvorak, Radovan Josth, and Elisabetta Delponte. 2017. Object State Recognition for Automatic AR-Based Maintenance Guidance. In 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). 1244–1250. https://doi.org/10.1109/CVPRW.2017.164ISSN: 2160-7516.",
      "doi": ""
    },
    {
      "text": "Andreas Fender, Philipp Herholz, Marc Alexa, and Jörg Müller. 2018. OptiSpace: Automated Placement of Interactive 3D Projection Mapping Content. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 269, 11 pages. https://doi.org/10.1145/3173574.3173843",
      "doi": "10.1145/3173574.3173843"
    },
    {
      "text": "Andreas Fender, David Lindlbauer, Philipp Herholz, Marc Alexa, and Jörg Müller. 2017. HeatSpace: Automatic Placement of Displays by Empirical Analysis of User Behavior. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 611–621. https://doi.org/10.1145/3126594.3126621",
      "doi": "10.1145/3126594.3126621"
    },
    {
      "text": "Christoph Froschl. 2005. User modeling and user profiling in adaptive e-learning systems. Graz, Austria: Master Thesis(2005).",
      "doi": ""
    },
    {
      "text": "Markus Funk. 2016. Augmented reality at the workplace : a context-aware assistive system using in-situ projection. http://dx.doi.org/10.18419/opus-8997",
      "doi": ""
    },
    {
      "text": "Benjamin Goldberg, Keith Brawner, and Robert Sottilare. 2012. Use of Evidence-based Strategies to Enhance the Extensibility of Adaptive Tutoring Technologies. Proceedings of the Interservice /Industry Training, Simulation, and Education Conference (I/ITSEC)12288 (2012), 1–12. http://ntsa.metapress.com/index/QHM8976477503684.pdf",
      "doi": ""
    },
    {
      "text": "Dominic Gorecky, Mathias Schmitt, Matthias Loskyll, and Detlef Zühlke. 2014. Human-machine-interaction in the industry 4.0 era. In 2014 12th IEEE international conference on industrial informatics (INDIN). IEEE, 289–294.",
      "doi": ""
    },
    {
      "text": "Michihiko Goto, Yuko Uematsu, Hideo Saito, Shuji Senda, and Akihiko Iketani. 2010. Task support system by displaying instructional video onto AR workspace. In 2010 IEEE International Symposium on Mixed and Augmented Reality. IEEE, 83–90.",
      "doi": ""
    },
    {
      "text": "Fernando Gutierrez and John Atkinson. 2011. Adaptive feedback selection for intelligent tutoring systems. Expert Systems with Applications 38, 5 (2011), 6146 – 6152. https://doi.org/10.1016/j.eswa.2010.11.058",
      "doi": "10.1016/j.eswa.2010.11.058"
    },
    {
      "text": "Ping-Hsuan Han, Yang-Sheng Chen, Yilun Zhong, Han-Lei Wang, and Yi-Ping Hung. 2017. My Tai-Chi Coaches: An Augmented-Learning Tool for Practicing Tai-Chi Chuan. In Proceedings of the 8th Augmented Human International Conference (Silicon Valley, California, USA) (AH ’17). Association for Computing Machinery, New York, NY, USA, Article 25, 4 pages. https://doi.org/10.1145/3041164.3041194",
      "doi": "10.1145/3041164.3041194"
    },
    {
      "text": "Zhen-Yu He and Lian-Wen Jin. 2008. Activity recognition from acceleration data using AR model representation and SVM. In 2008 international conference on machine learning and cybernetics, Vol. 4. IEEE, 2245–2250.",
      "doi": ""
    },
    {
      "text": "S. J. Henderson and S. Feiner. 2009. Evaluating the benefits of augmented reality for task localization in maintenance of an armored personnel carrier turret. In 2009 8th IEEE International Symposium on Mixed and Augmented Reality. 135–144.",
      "doi": ""
    },
    {
      "text": "S. J. Henderson and S. K. Feiner. 2011. Augmented reality in the psychomotor phase of a procedural task. In 2011 10th IEEE International Symposium on Mixed and Augmented Reality. 191–200. https://doi.org/10.1109/ISMAR.2011.6092386",
      "doi": "10.1109/ISMAR.2011.6092386"
    },
    {
      "text": "Bradley Herbert, Barrett Ens, Amali Weerasinghe, Mark Billinghurst, and Grant Wigley. 2018. Design considerations for combining augmented reality with intelligent tutors. Computers and Graphics (Pergamon) 77 (2018), 166–182. https://doi.org/10.1016/j.cag.2018.09.017",
      "doi": ""
    },
    {
      "text": "Jean-Michel Hoc. 2001. Towards a Cognitive Approach to Human-Machine Cooperation in Dynamic Situations. International Journal of Human-Computer Studies 54, 4 (2001), 509–540. https://doi.org/10.1006/ijhc.2000.0454",
      "doi": "10.1006/ijhc.2000.0454"
    },
    {
      "text": "Lars-Erik Janlert. 2014. The Ubiquitous Button. Interactions 21, 3 (May 2014), 26–33. https://doi.org/10.1145/2592234",
      "doi": "10.1145/2592234"
    },
    {
      "text": "Karen Kear, Frances Chetwynd, Judith Williams, and Helen Donelan. 2012. Web conferencing for synchronous online tutorials: Perspectives of tutors using a new medium. Computers & Education 58, 3 (2012), 953–963.",
      "doi": "10.1016/j.compedu.2011.10.015"
    },
    {
      "text": "Seungwon Kim, Gun Lee, Weidong Huang, Hayun Kim, Woontack Woo, and Mark Billinghurst. 2019. Evaluating the Combination of Visual Communication Cues for HMD-Based Mixed Reality Remote Collaboration. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300403",
      "doi": "10.1145/3290605.3300403"
    },
    {
      "text": "A. Kotranza, D. Scott Lind, C. M. Pugh, and B. Lok. 2009. Real-time in-situ visual feedback of task performance in mixed environments for learning joint psychomotor-cognitive tasks. In 2009 8th IEEE International Symposium on Mixed and Augmented Reality. 125–134. https://doi.org/10.1109/ISMAR.2009.5336485",
      "doi": "10.1109/ISMAR.2009.5336485"
    },
    {
      "text": "Wallace S. Lages and Doug A. Bowman. 2019. Walking with Adaptive Augmented Reality Workspaces: Design and Usage Patterns. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 356–366. https://doi.org/10.1145/3301275.3302278",
      "doi": "10.1145/3301275.3302278"
    },
    {
      "text": "Michael Laielli, James Smith, Giscard Biamby, Trevor Darrell, and Bjoern Hartmann. [n.d.]. LabelAR: A Spatial Guidance Interface for Fast Computer Vision Image Collection. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA, 2019-10-17) (UIST ’19). Association for Computing Machinery, 987–998. https://doi.org/10.1145/3332165.3347927",
      "doi": "10.1145/3332165.3347927"
    },
    {
      "text": "Shaun W. Lawson and John R. G. Pretlove. 1998. Augmented reality for underground pipe inspection and maintenance. In Telemanipulator and Telepresence Technologies V, Matthew R. Stein (Ed.), Vol. 3524. International Society for Optics and Photonics, SPIE, 98 – 104. https://doi.org/10.1117/12.333673",
      "doi": ""
    },
    {
      "text": "Jung Lee and O Park. 2008. Adaptive instructional systems. Handbook of research on educational communications and technology (2008), 469–484.",
      "doi": ""
    },
    {
      "text": "David Lindlbauer, Anna Maria Feit, and Otmar Hilliges. 2019. Context-Aware Online Adaptation of Mixed Reality Interfaces. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 147–160. https://doi.org/10.1145/3332165.3347945",
      "doi": "10.1145/3332165.3347945"
    },
    {
      "text": "Matthias Loskyll, Ines Heck, Jochen Schlick, and Michael Schwarz. 2012. Context-based orchestration for control of resource-efficient manufacturing processes. Future Internet 4, 3 (2012), 737–761.",
      "doi": ""
    },
    {
      "text": "Danielle L. Lusk, Amber D. Evans, Thomas R. Jeffrey, Keith R. Palmer, Chris S. Wikstrom, and Peter E. Doolittle. 2009. Multimedia learning and individual differences: Mediating the effects of working memory capacity with segmentation. British Journal of Educational Technology 40, 4 (2009), 636–651. https://doi.org/10.1111/j.1467-8535.2008.00848.x",
      "doi": ""
    },
    {
      "text": "Stephen Maloney, Michael Storr, Sophie Paynter, Prue Morgan, and Dragan Ilic. 2013. Investigating the efficacy of practical skill teaching: a pilot-study comparing three educational methods. Advances in Health Sciences Education 18, 1 (2013), 71–80.",
      "doi": ""
    },
    {
      "text": "Paula Martiskainen, Mikko Järvinen, Jukka-Pekka Skön, Jarkko Tiirikainen, Mikko Kolehmainen, and Jaakko Mononen. 2009. Cow behaviour pattern recognition using a three-dimensional accelerometer and support vector machines. Applied animal behaviour science 119, 1-2 (2009), 32–38.",
      "doi": ""
    },
    {
      "text": "Michael A Orey and Wayne A Nelson. 1993. Development principles for intelligent tutoring systems: Integrating cognitive theory into the development of computer-based instruction. Educational Technology Research and Development 41, 1(1993), 59–72. https://doi.org/10.1007/BF02297092",
      "doi": ""
    },
    {
      "text": "Philo Tan Chua, R. Crivella, B. Daly, Ning Hu, R. Schaaf, D. Ventura, T. Camill, J. Hodgins, and R. Pausch. 2003. Training for physical tasks in virtual environments: Tai Chi. In IEEE Virtual Reality, 2003. Proceedings.87–94.",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Gun A. Lee, Jonathon D. Hart, Barrett Ens, Robert W. Lindeman, Bruce H. Thomas, and Mark Billinghurst. 2018. Mini-Me: An Adaptive Avatar for Mixed Reality Remote Collaboration. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 46, 13 pages. https://doi.org/10.1145/3173574.3173620",
      "doi": "10.1145/3173574.3173620"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A. Lee, Andrew Irlitti, Barrett Ens, Bruce H. Thomas, and Mark Billinghurst. 2019. On the Shoulder of the Giant: A Multi-Scale Mixed Reality Collaboration with 360 Video Sharing and Tangible Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 228, 17 pages. https://doi.org/10.1145/3290605.3300458",
      "doi": "10.1145/3290605.3300458"
    },
    {
      "text": "Shaoqing Ren, Kaiming He, Ross Girshick, and Jian Sun. [n.d.]. Faster R-CNN: Towards Real-Time Object Detection with Region Proposal Networks. In Advances in Neural Information Processing Systems 28, C. Cortes, N. D. Lawrence, D. D. Lee, M. Sugiyama, and R. Garnett (Eds.). Curran Associates, Inc., 91–99. http://papers.nips.cc/paper/5638-faster-r-cnn-towards-real-time-object-detection-with-region-proposal-networks.pdf",
      "doi": ""
    },
    {
      "text": "Alejandro Reyes, Osslan Vergara, Erasmo Bojórquez, Vianey Sánchez, and Manuel Nandayapa. 2016. A mobile augmented reality system to support machinery operations in scholar environments: A MAR SYSTEM TO SUPPORT MACHINERY OPERATIONS IN SCHOLAR ENVIRONMENTS. Computer Applications in Engineering Education (10 2016). https://doi.org/10.1002/cae.21772",
      "doi": ""
    },
    {
      "text": "D. Rodenburg, P. Hungler, S. A. Etemad, D. Howes, A. Szulewski, and J. Mclellan. 2018. Dynamically adaptive simulation based on expertise and cognitive load. In 2018 IEEE Games, Entertainment, Media Conference (GEM). 1–6.",
      "doi": ""
    },
    {
      "text": "Mark Sandler, Andrew Howard, Menglong Zhu, Andrey Zhmoginov, and Liang-Chieh Chen. 2018. MobileNetV2: Inverted Residuals and Linear Bottlenecks. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR).",
      "doi": ""
    },
    {
      "text": "Eldon Schoop, Michelle Nguyen, Daniel Lim, Valkyrie Savage, Sean Follmer, and Björn Hartmann. 2016. Drill Sergeant: Supporting physical construction projects through an ecosystem of augmented tools. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1607–1614.",
      "doi": "10.1145/2851581.2892429"
    },
    {
      "text": "Marieke H.S.B. Smits, Jo Boon, Dominique M.A. Sluijsmans, and Tamara van Gog. 2008. Content and timing of feedback in a web-based learning environment: effects on learning as a function of prior knowledge. Interactive Learning Environments 16, 2 (2008), 183–193. https://doi.org/10.1080/10494820701365952",
      "doi": ""
    },
    {
      "text": "Robert Sottilare and Keith Brawner. [n.d.]. Component Interaction within the Generalized Intelligent Framework for Tutoring (GIFT) as a Model for Adaptive Instructional System Standards Toward Standardization through Design Goals. ([n. d.]), 55–62.",
      "doi": ""
    },
    {
      "text": "Robert A. Sottilare, Benjamin Goldberg, Charles Ragusa, and Michael Hoffman. 2013. Characterizing an Adaptive Tutoring Learning Effect Chain for Individual and Team Tutoring. 13033 (2013), 1–13.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2007. Human Machine Reconfigurations Plans and Situated Actions (2 ed.). Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Alyssa Tanaka, Jeffrey Craighead, Glenn Taylor, and Robert Sottilare. 2019. Adaptive Learning Technology for AR Training: Possibilities and Challenges. In Adaptive Instructional Systems, Robert A. Sottilare and Jessica Schwarz (Eds.). Springer International Publishing, Cham, 142–150.",
      "doi": ""
    },
    {
      "text": "Markus Tatzgern, Valeria Orso, Denis Kalkofen, Giulio Jacucci, Luciano Gamberini, and Dieter Schmalstieg. 2016. Adaptive information density for augmented reality displays. Proceedings - IEEE Virtual Reality 2016-July, 83 – 92. http://dx.doi.org/10.1109/VR.2016.7504691 Adaptive information;Browser interfaces;Hier-archical clustering;Level of detail;Search tasks;Semantic attribute;User interaction;Visual clutter;.",
      "doi": ""
    },
    {
      "text": "Andrea L. Thomaz and Cynthia Breazeal. 2008. Teachable robots: Understanding human teaching behavior to build more effective robot learners. Artificial Intelligence 172, 6-7 (2008), 716–737. https://doi.org/10.1016/j.artint.2007.09.009",
      "doi": "10.1016/j.artint.2007.09.009"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Fraser Anderson, George Fitzmaurice, Bjoern Hartmann, and Tovi Grossman. 2019. Loki: Facilitating Remote Instruction of Physical Tasks Using Bi-Directional Mixed-Reality Telepresence. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 161–174. https://doi.org/10.1145/3332165.3347872",
      "doi": "10.1145/3332165.3347872"
    },
    {
      "text": "Balasaravanan Thoravi Kumaravel, Cuong Nguyen, Stephen DiVerdi, and Björn Hartmann. 2019. TutoriVR: A Video-Based Tutorial System for Design Applications in Virtual Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300514"
    },
    {
      "text": "Unity. 2019. Unity Real-Time Development Platform. Retrieved September 1, 2019 from https://unity.com/.",
      "doi": ""
    },
    {
      "text": "Kurt VanLehn. 2011. The relative effectiveness of human tutoring, intelligent tutoring systems, and other tutoring systems. Educational Psychologist 46, 4 (2011), 197–221. https://doi.org/10.1080/00461520.2011.611369",
      "doi": ""
    },
    {
      "text": "Anne Wegerich and Matthias Rötting. 2011. A Context-Aware Adaptation System for Spatial Augmented Reality. In Digital Human Modeling, Vincent G. Duffy (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 417–425.",
      "doi": ""
    },
    {
      "text": "Giles Westerfield, Antonija Mitrovic, and Mark Billinghurst. 2015. Intelligent Augmented Reality Training for Motherboard Assembly. International Journal of Artificial Intelligence in Education 25, 1(2015), 157–172. https://doi.org/10.1007/s40593-014-0032-x",
      "doi": ""
    },
    {
      "text": "Frederik Winther, Linoj Ravindran, Kasper Paabøl Svendsen, and Tiare Feuchtner. 2020. Design and Evaluation of a VR Training Simulation for Pump Maintenance Based on a Use Case at Grundfos. In IEEE VR 2020. IEEE.",
      "doi": ""
    },
    {
      "text": "Li Da Xu, Eric L Xu, and Ling Li. 2018. Industry 4.0: state of the art and future trends. International Journal of Production Research 56, 8 (2018), 2941–2962.",
      "doi": ""
    },
    {
      "text": "M. Yamashita and S. Sakane. 2001. Adaptive annotation using a human-robot interface system PARTNER. In Proceedings 2001 ICRA. IEEE International Conference on Robotics and Automation (Cat. No.01CH37164), Vol. 3. 2661–2667 vol.3.",
      "doi": ""
    },
    {
      "text": "S. Yonemoto. 2013. Seamless Annotation Display for Augmented Reality. In 2013 International Conference on Cyberworlds. 387–387.",
      "doi": ""
    },
    {
      "text": "J. Zhu, S.K. Ong, and A.Y.C. Nee. 2015. A context-aware augmented reality assisted maintenance system. International Journal of Computer Integrated Manufacturing 28, 2(2015), 213–225. https://doi.org/10.1080/0951192X.2013.874589",
      "doi": "10.1080/0951192X.2013.874589"
    },
    {
      "text": "Z. Zhu, V. Branzoi, M. Wolverton, G. Murray, N. Vitovitch, L. Yarnall, G. Acharya, S. Samarasekera, and R. Kumar. 2014. AR-mentor: Augmented reality based mentoring system. In 2014 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). 17–22.",
      "doi": ""
    }
  ]
}