{
  "doi": "10.1145/3411764.3445551",
  "title": "Documented: Embedding Information onto and Retrieving Information from 3D Printed Objects",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "Documentation for DIY tasks serve as codified project knowledge and help makers reach new understandings and appreciations for the artifact. Engaging in reflective processes using the documentation can be challenging when it comes to physical objects as the documentation and the artifact exist separately. We hypothesize that spatially associating the documentation information with the artifact can provide richer contextualization to reflect upon the artifact and design process. We implemented and evaluated Documented, a web application that helps makers associate documentation to 3D printed objects. Information can be embedded using printed tags spatially placed on the model and accessed using mobile AR. Our study highlights the different strategies participants had for organizing, embedding, and retrieving information. Informed by our results, we discuss how the coupling of the documentation and the artifact can support reflection and identify potential barriers that need further investigation.",
  "authors": [
    {
      "name": "Omid Ettehadi",
      "institution": "Digital Futures Graduate Studies OCAD University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659503219",
      "orcid": "missing"
    },
    {
      "name": "Fraser Anderson",
      "institution": "Autodesk Research, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81456623584",
      "orcid": "0000-0003-3486-8943"
    },
    {
      "name": "Adam Tindale",
      "institution": "Digital Futures OCAD University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100283541",
      "orcid": "missing"
    },
    {
      "name": "Sowmya Somanath",
      "institution": "Computer Science University of Victoria, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490691992",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jad Al Rabbaa, Alexis Morris, and Sowmya Somanath. 2019. MRsive: An Augmented Reality Tool for Enhancing Wayfinding and Engagement with Art in Museums. In HCI International 2019 - Posters (2019) (Communications in Computer and Information Science), Constantine Stephanidis(Ed.). Springer International Publishing, Orlando, FL, USA, 535–542. https://doi.org/10.1007/978-3-030-23525-3_73",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Cindy Lin Kaiying, Silvia Lindtner, and Austin Toombs. 2017. HCI’s Making Agendas.Found. Trends Hum. Comput. Interact. 11, 3 (2017), 126–200.",
      "doi": "10.1561/1100000066"
    },
    {
      "text": "Peter Dalsgaard and Kim Halskov. 2012. Reflective design documentation. In Proceedings of the Designing Interactive Systems Conference (2012-06-11) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 428–437. https://doi.org/10.1145/2317956.2318020",
      "doi": "10.1145/2317956.2318020"
    },
    {
      "text": "Audrey Desjardins and Timea Tihanyi. 2019. ListeningCups: A Case of Data Tactility and Data Stories. In Proceedings of the 2019 on Designing Interactive Systems Conference (2019-06-18) (DIS ’19). Association for Computing Machinery, San Diego, CA, USA, 147–160. https://doi.org/10.1145/3322276.3323694",
      "doi": "10.1145/3322276.3323694"
    },
    {
      "text": "Tinkercad | Create 3D digital designs with online CAD. 2020. Tinkercad. Tinkercad. https://www.tinkercad.com/",
      "doi": ""
    },
    {
      "text": "Dale Dougherty. 2016. Free to Make: How the Maker Movement is Changing Our Schools, Our Jobs, and Our Minds. North Atlantic Books, Berkeley, CA, USA.",
      "doi": ""
    },
    {
      "text": "Garnetz Hertz. 2014. Critical Making. Concept Lab. http://www.conceptlab.com/criticalmaking/",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible Bits: Towards Seamless Interfaces Between People, Bits and Atoms. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (1997) (CHI ’97). ACM, New York, NY, USA, 234–241. https://doi.org/10.1145/258549.258715 event-place: Atlanta, Georgia, USA.",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Yvonne Jansen, Pierre Dragicevic, Petra Isenberg, Jason Alexander, Abhijit Karnik, Johan Kildal, Sriram Subramanian, and Kasper Hornbæk. 2015. Opportunities and Challenges for Data Physicalization. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015-04-18) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3227–3236. https://doi.org/10.1145/2702123.2702180",
      "doi": "10.1145/2702123.2702180"
    },
    {
      "text": "Clarissa Kleveno. 2019. Make A Secret Light Up LED Ring. Make:Community. https://makezine.com/projects/make-a-secret-light-up-led-ring/",
      "doi": ""
    },
    {
      "text": "Boriana Koleva, Steve Benford, Kher Ng, and Tom Rodden. 2003. A Framework for Tangible User Interfaces. In Physical Interaction (PI03) Workshop on Real World User Interfaces (2003-01-01). Association for Computing Machinery, Udine, Italy, 46–50.",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Rise of the Expert Amateur: DIY Projects, Communities, and Cultures. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries (2010) (NordiCHI ’10). ACM, New York, NY, USA, 295–304. https://doi.org/10.1145/1868914.1868950 event-place: Reykjavik, Iceland.",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Moon-Hwan Lee, Oosung Son, and Tek-Jin Nam. 2016. Patina-inspired Personalization: Personalizing Products with Traces of Daily Use. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (2016-06-04) (DIS ’16). Association for Computing Machinery, Brisbane, QLD, Australia, 251–263. https://doi.org/10.1145/2901790.2901812",
      "doi": "10.1145/2901790.2901812"
    },
    {
      "text": "Noah Litvin. 2020. Artifact Analysis. Parsons Transdisciplinary Design program. http://dlrtoolkit.github.io/artifact-analysis/",
      "doi": ""
    },
    {
      "text": "Teachable Machine. 2020. Teachable Machine. Google. https://teachablemachine.withgoogle.com/",
      "doi": ""
    },
    {
      "text": "Jennifer A. Moon. 2013. Reflection in Learning and Professional Development: Theory and Practice. Routledge, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Claire O’Malley and Danae Stanton Fraser. 2004. Literature Review in Learning with Tangible Technologies. NESTA futurelab report 12 (2004). https://telearn.archives-ouvertes.fr/hal-00190328",
      "doi": ""
    },
    {
      "text": "If Price, Fides Matzdorf, Louise Smith, and Helen Agahi. 2003. The impact of facilities on student choice of university. Facilities 21, 10 (2003), 212–222. https://doi.org/10.1108/02632770310493580 Publisher: MCB UP Ltd.",
      "doi": ""
    },
    {
      "text": "Make: Projects. 2020. Make: Projects. Make: Projects. https://makeprojects.com/home",
      "doi": ""
    },
    {
      "text": "Travis Rich. 2013. Encoding Data into Physical Objects with Digitally Fabricated Textures. https://www.media.mit.edu/publications/encoding-data-into-physical-objects-with-digitally-fabricated-textures/",
      "doi": ""
    },
    {
      "text": "Daniela K. Rosner and Kimiko Ryokai. 2008. Spyn: Augmenting Knitting to Support Storytelling and Reflection. In Proceedings of the 10th International Conference on Ubiquitous Computing (2008) (UbiComp ’08). ACM, New York, NY, USA, 340–349. https://doi.org/10.1145/1409635.1409682 event-place: Seoul, Korea.",
      "doi": ""
    },
    {
      "text": "Adam Savage. 2018. Adam Savage’s One Day Builds: Overengineered Bottle Opener!https://www.youtube.com/watch?v=MxLOoriXkMc",
      "doi": ""
    },
    {
      "text": "Becky Stern. 2020. Silver RFID Ring. Instructables. https://www.instructables.com/id/Silver-RFID-Ring/Library Catalog: www.instructables.com.",
      "doi": ""
    },
    {
      "text": "Simon Stusak. 2016. Exploring the potential of physical visualizations. https://edoc.ub.uni-muenchen.de/20190/",
      "doi": ""
    },
    {
      "text": "Cristen Torrey, Elizabeth F. Churchill, and David W. McDonald. 2009. Learning how: the search for craft knowledge on the internet. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2009-04-04) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1371–1380. https://doi.org/10.1145/1518701.1518908",
      "doi": "10.1145/1518701.1518908"
    },
    {
      "text": "Cristen Torrey, David W. McDonald, Bill N. Schilit, and Sara Bly. 2007. How-To pages: Informal systems of expertise sharing. In ECSCW 2007 (2007), Liam J. Bannon, Ina Wagner, Carl Gutwin, Richard H. R. Harper, and Kjeld Schmidt (Eds.). Springer, London, 391–410. https://doi.org/10.1007/978-1-84800-031-5_21",
      "doi": ""
    },
    {
      "text": "Tiffany Tseng. 2016. Build in Progress: Building Process-Oriented. Makeology: Makerspaces as Learning Environments (Volume 1) 1 (2016), 237.",
      "doi": ""
    },
    {
      "text": "Tiffeny Tseng. 2020. Spin Turntable System. http://buildinprogress.media.mit.edu/projects/2330/steps.",
      "doi": ""
    },
    {
      "text": "Tiffany Tseng and Geoff Tsai. 2015. Process Products: Capturing Design Iteration with Digital Fabrication. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (2015) (TEI ’15). ACM, New York, NY, USA, 631–636. https://doi.org/10.1145/2677199.2687891 event-place: Stanford, California, USA.",
      "doi": "10.1145/2677199.2687891"
    },
    {
      "text": "Terri Turner and Daniel Gray Wilson. 2009. Reflections on Documentation: A Discussion With Thought Leaders From Reggio Emilia. Theory Into Practice 49, 1 (2009), 5–13. https://doi.org/10.1080/00405840903435493 Publisher: Routledge _eprint: https://doi.org/10.1080/00405840903435493.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary, Markus Lorenz Schilling, Matthew A Dalton, Sabrina Hauser, Audrey Desjardins, Xiao Zhang, and Henry WJ Lin. 2015. Tutorial authorship and hybrid designers: The joy (and frustration) of DIY tutorials. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 609–618.",
      "doi": "10.1145/2702123.2702550"
    },
    {
      "text": "Eric Wilhelm. 2013. Instructables. interactions 20, 1 (2013), 84–87.",
      "doi": ""
    },
    {
      "text": "Hsin-Kai Wu, Silvia Wen-Yu Lee, Hsin-Yi Chang, and Jyh-Chong Liang. 2013. Current status, opportunities and challenges of augmented reality in education. Computers & Education 62 (2013), 41–49. https://doi.org/10.1016/j.compedu.2012.10.024",
      "doi": ""
    }
  ]
}