{
  "doi": "10.1145/3411764.3445732",
  "title": "Appliancizer: Transforming Web Pages into Electronic Devices",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Prototyping electronic devices that meet today’s consumer standards is a time-consuming task that requires multi-domain expertise. Consumers expect electronic devices to have visually appealing interfaces with both tactile and screen-based interfaces. Appliancizer, our interactive computational design tool, exploits the similarities between graphical and tangible interfaces, allowing web pages to be rapidly transformed into physical electronic devices. Using a novel technique we call essential interface mapping, our tool converts graphical user interface elements (e.g., an HTML button) into tangible interface components (e.g., a physical button) without changing the application source code. Appliancizer automatically generates the PCB and low-level code from web-based prototypes and HTML mock-ups. This makes the prototyping of mixed graphical-tangible interactions as easy as modifying a web page and allows designers to leverage the well-developed ecosystem of web technologies. We demonstrate how our technique simplifies and accelerates prototyping by developing two devices with Appliancizer.",
  "authors": [
    {
      "name": "Jorge Garza",
      "institution": "Computer Science and Engineering University of California, San Diego, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659439930",
      "orcid": "missing"
    },
    {
      "name": "Devon J. Merrill",
      "institution": "Computer Science and Engineering University of California, San Diego, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659352022",
      "orcid": "missing"
    },
    {
      "name": "Steven Swanson",
      "institution": "Computer Science and Engineering University of California, San Diego, United States",
      "img": "/do/10.1145/contrib-81100070924/rel-imgonly/stevenswanson.jpg",
      "acmid": "81100070924",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2017. Trigger-Action-Circuits: Leveraging Generative Design to Enable Novices to Design and Build Circuitry. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 331–342.",
      "doi": "10.1145/3126594.3126637"
    },
    {
      "text": "Arduino. 2020. Arduino Reference. https://www.arduino.cc/reference/en/",
      "doi": ""
    },
    {
      "text": "Jonathan Bachrach, David Biancolin, Austin Buchan, Duncan W Haldane, and Richard Lin. 2016. Jitpcb. In 2016 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, 2230–2236.",
      "doi": ""
    },
    {
      "text": "Rafael Ballagas, Meredith Ringel, Maureen Stone, and Jan Borchers. 2003. iStuff: a physical user interface toolkit for ubiquitous computing environments. In Proceedings of the SIGCHI conference on Human factors in computing systems. 537–544.",
      "doi": "10.1145/642611.642705"
    },
    {
      "text": "Hernando Barragán. 2004. Wiring: Prototyping physical interaction design. Interaction Design Institute, Ivrea, Italy(2004).",
      "doi": ""
    },
    {
      "text": "Ayah Bdeir. 2009. Electronics As Material: LittleBits. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction (Cambridge, United Kingdom) (TEI ’09). ACM, New York, NY, USA, 397–400. https://doi.org/10.1145/1517664.1517743",
      "doi": "10.1145/1517664.1517743"
    },
    {
      "text": "Jean-Pierre Charras. 2012. ” Kicad: GPL PCB Suite”.",
      "doi": ""
    },
    {
      "text": "CodePen. 2020. Build, Test, and Discover Front-end Code - Nest Thermostat Control. https://codepen.io/dalhundal/pen/KpabZB",
      "doi": ""
    },
    {
      "text": "Adrien Coyette and Jean Vanderdonckt. 2010. Prototyping Digital, Physical, and Mixed User Interfaces by Sketching. In Workshop on User Interface eXtensible Markup Language UsiXML, France, Paris.",
      "doi": ""
    },
    {
      "text": "Flavia C Delicato, Paulo F Pires, Thais Batista, Everton Cavalcante, Bruno Costa, and Thomaz Barros. 2013. Towards an IoT ecosystem. In Proceedings of the First International Workshop on Software Engineering for Systems-of-Systems. 25–28.",
      "doi": "10.1145/2489850.2489855"
    },
    {
      "text": "EAGLE. 2020. PCB Design Software - Autodesk. https://www.autodesk.com/products/eagle/overview",
      "doi": ""
    },
    {
      "text": "EETimes. Apr. 2017. 2017 Embedded Markets Study: Integrating IoT and Advanced Technology Designs, Application Development Processing Enviroments. https://m.eet.com/media/1246048/2017-embedded-market-study.pdf.",
      "doi": ""
    },
    {
      "text": "Jorge Garza, Devon J Merrill, and Steven Swanson. 2019. Amalgam: Hardware Hacking for Web Developers with Style (Sheets). In International Conference on Web Engineering. Springer, 315–330.",
      "doi": ""
    },
    {
      "text": "Julien Gascon-Samson, Kumseok Jung, Shivanshu Goyal, Armin Rezaiean-Asel, and Karthik Pattabiraman. 2018. Thingsmigrate: Platform-independent migration of stateful javascript iot applications. In 32nd European Conference on Object-Oriented Programming (ECOOP 2018). Schloss Dagstuhl-Leibniz-Zentrum fuer Informatik.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg and Chester Fitchett. 2001. Phidgets: Easy Development of Physical Interfaces Through Physical Widgets. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology(Orlando, Florida) (UIST ’01). ACM, New York, NY, USA, 209–218. https://doi.org/10.1145/502348.502388",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Grove. 2020. Grove modules - Seeed Studio. https://www.seeedstudio.com/category/Grove-c-1003.html",
      "doi": ""
    },
    {
      "text": "Gaoyang Guan, Wei Dong, Yi Gao, Kaibo Fu, and Zhihao Cheng. 2017. TinyLink: A Holistic System for Rapid Development of IoT Applications. In Proceedings of the 23rd Annual International Conference on Mobile Computing and Networking. ACM, 383–395.",
      "doi": "10.1145/3117811.3117825"
    },
    {
      "text": "Bjoern Hartmann, Scott R Klemmer, Michael Bernstein, and Nirav Mehta. 2005. d. tools: Visually prototyping physical UIs through statecharts. In in Extended Abstracts of UIST 2005. Citeseer.",
      "doi": ""
    },
    {
      "text": "Utkarshani Jaimini and Mayur Dhaniwala. 2016. JavaScript empowered Internet of things. In 2016 3rd International Conference on Computing for Sustainable Global Development (INDIACom). IEEE, 2373–2377.",
      "doi": ""
    },
    {
      "text": "JLCPCB. 2020. Low Cost PCB Prototype & PCB Fabrication. https://jlcpcb.com/",
      "doi": ""
    },
    {
      "text": "Jun Kato and Masataka Goto. 2017. F3. js: A parametric design tool for physical computing devices for both interaction designers and end-users. In Proceedings of the 2017 Conference on Designing Interactive Systems. 1099–1110.",
      "doi": "10.1145/3064663.3064681"
    },
    {
      "text": "Majeed Kazemitabaar, Jason McPeak, Alexander Jiao, Liang He, Thomas Outing, and Jon E. Froehlich. 2017. MakerWear: A Tangible Approach to Interactive Wearable Creation for Children. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 133–145. https://doi.org/10.1145/3025453.3025887",
      "doi": "10.1145/3025453.3025887"
    },
    {
      "text": "Mannu Lambrichts, Jose Maria Tijerina, and Raf Ramakers. 2020. SoftMod: A Soft Modular Plug-and-Play Kit for Prototyping Electronic Systems. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction. 287–298.",
      "doi": "10.1145/3374920.3374950"
    },
    {
      "text": "Richard Lin, Rohit Ramesh, Antonio Iannopollo, Alberto Sangiovanni Vincentelli, Prabal Dutta, Elad Alon, and Björn Hartmann. 2019. Beyond Schematic Capture: Meaningful Abstractions for Better Electronics Design Tools. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300513"
    },
    {
      "text": "Victor Matos. 2009. Android Environment Emulator. Cleveland State University 20, 11 (2009).",
      "doi": ""
    },
    {
      "text": "David A Mellis and Leah Buechley. 2014. Do-it-yourself cellphones: an investigation into the possibilities and limits of high-tech diy. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1723–1732.",
      "doi": "10.1145/2556288.2557309"
    },
    {
      "text": "David A Mellis, Leah Buechley, Mitchel Resnick, and Björn Hartmann. 2016. Engaging amateurs in the design, fabrication, and assembly of electronic devices. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, 1270–1281.",
      "doi": "10.1145/2901790.2901833"
    },
    {
      "text": "Devon J Merrill, Jorge Garza, and Steven Swanson. 2019. Echidna: mixed-domain computational implementation via decision trees. In Proceedings of the ACM Symposium on Computational Fabrication. 1–12.",
      "doi": "10.1145/3328939.3329004"
    },
    {
      "text": "Multisim. 2020. Live Online Circuit Simulator. https://www.multisim.com/",
      "doi": ""
    },
    {
      "text": "Zainalabedin Navabi. 1997. VHDL: Analysis and modeling of digital systems. McGraw-Hill, Inc.",
      "doi": ""
    },
    {
      "text": "Mozilla Developer Network. 2013. Firefox OS, 2013.",
      "doi": ""
    },
    {
      "text": "[32] P. Li and J. Bachrach, ”The Stanza Language”.2015. http://www.stanzalang.org",
      "doi": ""
    },
    {
      "text": "Raspberry Pi. 2015. Teach, Learn, and Make with Raspberry Pi. https://www.raspberrypi.org/",
      "doi": ""
    },
    {
      "text": "Proteus. 2020. PCB Design and Circuit Simulator Software. https://www.labcenter.com/",
      "doi": ""
    },
    {
      "text": "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice. 2016. Retrofab: A design tool for retrofitting physical interfaces using actuators, sensors and 3d printing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 409–419.",
      "doi": "10.1145/2858036.2858485"
    },
    {
      "text": "Rohit Ramesh, Richard Lin, Antonio Iannopollo, Alberto Sangiovanni-Vincentelli, Björn Hartmann, and Prabal Dutta. 2017. Turning coders into makers: the promise of embedded design generation. In Proceedings of the 1st Annual ACM Symposium on Computational Fabrication. ACM, 4.",
      "doi": "10.1145/3083157.3083159"
    },
    {
      "text": "Valkyrie Savage, Sean Follmer, Jingyi Li, and Björn Hartmann. 2015. Makers’ Marks: Physical markup for designing and fabricating functional objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. 103–108.",
      "doi": "10.1145/2807442.2807508"
    },
    {
      "text": "Sunil Saxena and HV Kwon. 2012. Tizen architecture. In Tizen Developer Conference, San Francisco, California.",
      "doi": ""
    },
    {
      "text": "Swoop. 2015. A Python Library for Eagle PCB Design Files. https://github.com/NVSL/Swoop/",
      "doi": ""
    },
    {
      "text": "Nest Learning Thermostat. 2011. v1. 0 [Product Brochure]. Nest Labs, plus publication date addendum(2011). https://nest.com/",
      "doi": ""
    },
    {
      "text": "Donald Thomas and Philip Moorby. 2008. The Verilog® Hardware Description Language. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "[42] TinkerCad Circuits.2020. https://www.tinkercad.com/learn/circuits",
      "doi": ""
    },
    {
      "text": "Blase Ur, Elyse McManus, Melwyn Pak Yong Ho, and Michael L. Littman. 2014. Practical Trigger-action Programming in the Smart Home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 803–812. https://doi.org/10.1145/2556288.2557420",
      "doi": "10.1145/2556288.2557420"
    },
    {
      "text": "Nicolas Villar, James Scott, Steve Hodges, Kerry Hammil, and Colin Miller. 2012. . NET gadgeteer: a platform for custom devices. In International Conference on Pervasive Computing. Springer, 216–233.",
      "doi": "10.1007/978-3-642-31205-2_14"
    },
    {
      "text": "Webcomponents. 2020. Specifications. https://www.webcomponents.org/specs",
      "doi": ""
    },
    {
      "text": "[46] YouTube Player API Reference for iframe Embeds - Google Developers.2020. https://developers.google.com/youtube/iframe_api_reference",
      "doi": ""
    }
  ]
}