{
  "doi": "10.1145/3411764.3445433",
  "title": "Can Online Juries Make Consistent, Repeatable Decisions?",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "A jury of one’s peers is a prominent way to adjudicate disputes and is increasingly used in participatory governance online. The fairness of this approach rests on the assumption that juries are consistent: that the same jury would hand down similar judgments to similar cases. However, prior literature suggests that social influence would instead cause early interactions to cascade into different judgments for similar cases. In this paper, we report an online experiment that changes participants’ pseudonyms as they appear to collaborators, temporarily masking a jury’s awareness that they have deliberated together before. This technique allows us to measure consistency by reconvening the same jury on similar cases. Counter to expectation, juries are equally consistent as individuals, a result that is “good for democracy.” But this consistency arises in part due to group polarization, as consensus develops by hardening initial majority opinions. Furthermore, we find that aggregating groups’ perspectives without deliberation erodes consistency.",
  "authors": [
    {
      "name": "Xinlan Emily Hu",
      "institution": "Computer Science Stanford University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702048",
      "orcid": "missing"
    },
    {
      "name": "Mark E Whiting",
      "institution": "Computer Science Stanford, United States",
      "img": "/do/10.1145/contrib-99659079274/rel-imgonly/99659079274.jpeg",
      "acmid": "99659079274",
      "orcid": "missing"
    },
    {
      "name": "Michael S. Bernstein",
      "institution": "Computer Science Stanford University, United States",
      "img": "/do/10.1145/contrib-81405591691/rel-imgonly/msb-casbs-headshot-small.jpeg",
      "acmid": "81405591691",
      "orcid": "0000-0001-8020-9434"
    }
  ],
  "references": [
    {
      "text": "Tanja Aitamurto and Helene E Landemore. 2015. Five Design Principles for Crowdsourced Policymaking: Assessing the Case of Crowdsourced Off-Road Traffic Law in Finland. Journal of Social Media for Organizations 2, 1 (2015), 1–19.",
      "doi": ""
    },
    {
      "text": "Ali Alkhatib and Michael S Bernstein. 2019. Street-Level Algorithms: A Theory at the Gaps Between Policy and Decisions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300760"
    },
    {
      "text": "Jennifer Nancy Lee Allen, Antonio Alonso Arechar, Gordon Pennycook, and David Rand. 2020. Scaling up Fact-Checking Using the Wisdom of Crowds. (2020). Unpublished preprint.",
      "doi": ""
    },
    {
      "text": "Albert W Alschuler and Andrew G Deiss. 1994. A Brief History of the Criminal Jury in the United States. The University of Chicago Law Review 61, 3 (1994), 867–928.",
      "doi": ""
    },
    {
      "text": "Julia Angwin and Hannes Grassegger. 2017. Facebook’s Secret Censorship Rules Protect White Men From Hate Speech But Not Black Children. Retrieved September 3, 2020 from https://www.propublica.org/article/facebook-hate-speech-censorship-internal-documents-algorithms",
      "doi": ""
    },
    {
      "text": "Solomon E Asch. 1951. Effects of Group Pressure Upon the Modification and Distortion of Judgments. Organizational Influence Processes(1951), 295–303.",
      "doi": ""
    },
    {
      "text": "Federico Ast. 2017. Kleros, a Protocol for a Decentralized Justice System. Retrieved October 31, 2019 from https://medium.com/kleros/kleros-a-decentralized-justice-protocol-for-the-internet-38d596a6300d",
      "doi": ""
    },
    {
      "text": "Bence Bago, David G Rand, and Gordon Pennycook. 2020. Fake news, Fast and Slow: Deliberation Reduces Belief in False (But Not True) News Headlines. Journal of Experimental Psychology: General(2020).",
      "doi": ""
    },
    {
      "text": "Joshua Becker, Abdullah Almaatouq, and Emőke-Ágnes Horvát. 2020. Network Structures of Collective Intelligence: The Contingent Benefits of Group Discussion. (2020). Working Paper.",
      "doi": ""
    },
    {
      "text": "Douglas L Bessette, Robyn S Wilson, and Joseph L Arvai. 2019. Do People Disagree with Themselves? Exploring the Internal Consistency of Complex, Unfamiliar, and Risky decisions. Journal of Risk Research(2019), 1–13.",
      "doi": ""
    },
    {
      "text": "Laura W Black, Howard T Welser, Dan Cosley, and Jocelyn M DeGroot. 2011. Self-Governance Through Group Discussion in Wikipedia: Measuring Deliberation in Online Groups. Small Group Research 42, 5 (2011), 595–634.",
      "doi": ""
    },
    {
      "text": "John Bone, John Hey, and John Suckling. 1999. Are Groups More (or Less) Consistent than Individuals?Journal of Risk and Uncertainty 18, 1 (1999), 63–81.",
      "doi": ""
    },
    {
      "text": "Keith Burghardt, William Rand, and Michelle Girvan. 2019. Inferring Models of Opinion Dynamics from Aggregated Jury Data. PLOS One 14, 7 (2019). https://doi.org/10.1371/journal.pone.0218312",
      "doi": ""
    },
    {
      "text": "Moira Burke and Robert Kraut. 2008. Mopping Up: Modeling Wikipedia Promotion Decisions. In Proceedings of the 2008 ACM conference on Computer Supported Cooperative Work. 27–36.",
      "doi": "10.1145/1460563.1460571"
    },
    {
      "text": "Hancheng Cao, Vivian Yang, Victor Chen, Yu Jin Lee, Lydia Stone, Mark E Whiting, and Michael S Bernstein. 2020. My Team Will Go On: Differentiating High and Low Viability Teams through Team Interaction. Proceedings of the ACM on Human-Computer Interaction 5 (2020).",
      "doi": ""
    },
    {
      "text": "Jonathan P Chang, Caleb Chiam, Liye Fu, Andrew Z Wang, Justine Zhang, and Cristian Danescu-Niculescu-Mizil. 2020. ConvoKit: A Toolkit for the Analysis of Conversations. Proceedings of SIGDIAL(2020).",
      "doi": ""
    },
    {
      "text": "Kaiping Chen. 2020. How Deliberative Designs Empower Citizens’ Voices: A Case Study on Ghana’s Deliberative Poll on Agriculture and the Environment. Public Understanding of Science(2020), 0963662520966742.",
      "doi": ""
    },
    {
      "text": "Kevin M Clermont and Theodore Eisenberg. 1991. Trial by Jury or Judge: Transcending Empiricism. Cornell L. Rev. 77(1991), 1124.",
      "doi": ""
    },
    {
      "text": "Edward Cohen, Mukund Venkateswaran, Nivedita Sankar, and Chris Callison-Burch. 2020. Turkish Judge: A Peer Evaluation Framework for Crowd Work Appeals. (2020).",
      "doi": ""
    },
    {
      "text": "Phil F Culverhouse, Robert Williams, Beatriz Reguera, Vincent Herry, and Sonsoles González-Gil. 2003. Do Experts Make Mistakes? A Comparison of Human and Machine Identification of Dinoflagellates. Marine Ecology Progress Series 247 (2003), 17–25.",
      "doi": ""
    },
    {
      "text": "Lee J Curley, Jennifer Murray, Rory MacLean, and Phyllis Laybourn. 2017. Are Consistent Juror Decisions Related to Fast and Frugal Decision Making? Investigating the Relationship Between Juror Consistency, Decision Speed and Cue Utilisation. Medicine, Science and the Law 57, 4 (2017), 211–219.",
      "doi": ""
    },
    {
      "text": "Shai Danziger, Jonathan Levav, and Liora Avnaim-Pesso. 2011. Extraneous Factors in Judicial Decisions. Proceedings of the National Academy of Sciences 108, 17(2011), 6889–6892.",
      "doi": ""
    },
    {
      "text": "Dennis J Devine, Laura D Clayton, Benjamin B Dunford, Rasmy Seying, and Jennifer Pryce. 2001. Jury Decision Making: 45 Years of Empirical Research on Deliberating Groups. Psychology, Public Policy, and Law 7, 3 (2001), 622.",
      "doi": ""
    },
    {
      "text": "Shari Seidman Diamond, Michael J Saks, and Stephan Landsman. 1998. Juror Judgments About Liability and Damages: Sources of Variability and Ways to Increase Consistency. DePaul L. Rev. 48(1998), 301.",
      "doi": ""
    },
    {
      "text": "Facebook. 2020. Oversight Board Bylaws. Retrieved September 3, 2020 from https://about.fb.com/wp-content/uploads/2020/01/Bylaws_v6.pdf",
      "doi": ""
    },
    {
      "text": "Jenny Fan and Amy X Zhang. 2020. Digital Juries: A Civics-Oriented Approach to Platform Governance. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376293"
    },
    {
      "text": "James Fishkin. 2013. Reviving Deliberative Democracy. J. Attali & al., La Démocratie enrayée (2013), 181–200.",
      "doi": ""
    },
    {
      "text": "James Fishkin, Nikhil Garg, Lodewijk Gelauff, Ashish Goel, Kamesh Munagala, Sukolsak Sakshuwong, Alice Siu, and Sravya Yandamuri. 2018. Deliberative Democracy with the Online Deliberation Platform. In The 7th AAAI Conference on Human Computation and Crowdsourcing (HCOMP 2019). HCOMP.",
      "doi": ""
    },
    {
      "text": "Joshua T Gyory, Jonathan Cagan, and Kenneth Kotovsky. 2019. Are You Better Off Alone? Mitigating the Underperformance of Engineering Teams During Conceptual Design Through Adaptive Process Management. Research in Engineering Design 30, 1 (2019), 85–102.",
      "doi": ""
    },
    {
      "text": "J Richard Hackman and Nancy Katz. 2010. Group Behavior and Performance.(2010).",
      "doi": ""
    },
    {
      "text": "Reid Hastie, Steven Penrod, and Nancy Pennington. 1983. Inside the Jury. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Kokil Jaidka, Alvin Zhou, Yphtach Lelkes, Jana Egelhofer, and Sophie Lecheler. 2020. Beyond Anonymity: Network Affordances, under Deindividuation, Improve Social Media Discussion Quality. (2020). Unpublished preprint.",
      "doi": ""
    },
    {
      "text": "Mahmood Jasim, Pooya Khaloo, Somin Wadhwa, Amy X Zhang, Ali Sarvghad, and Narges Mahyar. 2020. CommunityClick: Capturing and Reporting Community Feedback from Town Halls to Improve Inclusivity. Proceedings of the 2020 ACM Conference on Computer Supported Cooperative Work and Social Computing(2020).",
      "doi": ""
    },
    {
      "text": "Malte F Jung, Nikolas Martelaro, and Pamela J Hinds. 2015. Using Robots to Moderate Team Conflict: the Case of Repairing Violations. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction. 229–236.",
      "doi": "10.1145/2696454.2696460"
    },
    {
      "text": "Soomin Kim, Jinsu Eun, Changhoon Oh, Bongwon Suh, and Joonhwan Lee. 2020. Bot in the Bunch: Facilitating Group Chat Discussion by Improving Efficiency and Participation with a Chatbot. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376785"
    },
    {
      "text": "Yubo Kou and Bonnie Nardi. 2013. Regulating Anti-Social Behavior on the Internet: The Example of League of Legends. (2013).",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee and Su Baykal. 2017. Algorithmic Mediation in Group Decisions: Fairness Perceptions of Algorithmically Mediated vs. Discussion-Based Social Division. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing, 1035–1048.",
      "doi": "10.1145/2998181.2998230"
    },
    {
      "text": "Kristina Lerman, Xiaoran Yan, and Xin-Zeng Wu. 2016. The ”Majority Illusion” in Social Networks. PloS One 11, 2 (2016), e0147617.",
      "doi": ""
    },
    {
      "text": "Robert J MacCoun. 1987. Getting Inside the Black Box: Toward a Better Understanding of Civil Jury Behavior. Rand Corporation.",
      "doi": ""
    },
    {
      "text": "Robert J MacCoun and Tom R Tyler. 1988. The Basis of Citizen’s Perceptions of the Criminal Jury. Law and Human Behavior 12, 3 (1988), 333–352.",
      "doi": ""
    },
    {
      "text": "Nancy S Marder. 2005. The Jury Process. Foundation Press.",
      "doi": ""
    },
    {
      "text": "Nancy S Marder. 2006. Cyberjuries: A New Role as Online Mock Juries. U. Tol. L. Rev. 38(2006), 239.",
      "doi": ""
    },
    {
      "text": "Serge Moscovici and Claude Faucheux. 1972. Social Influence, Conformity Bias, and the Study of Active Minorities. In Advances in Experimental Social Psychology. Vol. 6. Elsevier, 149–202.",
      "doi": ""
    },
    {
      "text": "Elisabeth Noelle-Neumann. 1974. The Spiral of Silence a Theory of Public Opinion. Journal of Communication 24, 2 (1974), 43–51.",
      "doi": ""
    },
    {
      "text": "Beth S Noveck. 2004. Unchat: Democratic Solution for a Wired World. Democracy Online: The Prospects for Political Renewal Through the Internet (2004), 21–34.",
      "doi": ""
    },
    {
      "text": "Vincent E Owhoso, William F Messier, Jr, and John G Lynch, Jr. 2002. Error Detection by Industry-Specialized Teams During Sequential Audit Review. Journal of Accounting Research 40, 3 (2002), 883–900.",
      "doi": ""
    },
    {
      "text": "John W Payne, John William Payne, James R Bettman, and Eric J Johnson. 1993. The Adaptive Decision Maker. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Marshall Scott Poole, Michael Holmes, Richard Watson, and Gerardine DeSanctis. 1993. Group Decision Support Systems and Group Communication: A Comparison of Decision Making in Computer-Supported and Nonsupported Groups. Communication Research 20, 2 (1993), 176–213.",
      "doi": ""
    },
    {
      "text": "Robert T Roper. 1980. Jury Size and Verdict Consistency: ”A Line Has to be Drawn Somewhere”?Law and Society Review(1980), 977–995.",
      "doi": ""
    },
    {
      "text": "Niloufar Salehi and Michael S Bernstein. 2018. Hive: Collective Design Through Network Rotation. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–26.",
      "doi": "10.1145/3274420"
    },
    {
      "text": "Niloufar Salehi, Lilly C Irani, Michael S Bernstein, Ali Alkhatib, Eva Ogbe, and Kristy Milland. 2015. We are Dynamo: Overcoming Stalling and Friction in Collective Action for Crowd Workers. In CHI ’15: Proceedings of the 33rd annual ACM Conference on Human factors in computing systems. 1621–1630.",
      "doi": "10.1145/2702123.2702508"
    },
    {
      "text": "Jeffrey A Segal. 1986. Supreme Court Justices as Human Decision Makers: An Individual-Level Analysis of the Search and Seizure cases. The Journal of Politics 48, 4 (1986), 938–955.",
      "doi": ""
    },
    {
      "text": "Nihar B Shah, Behzad Tabibian, Krikamol Muandet, Isabelle Guyon, and Ulrike Von Luxburg. 2018. Design and Analysis of the NIPS 2016 Review Process. The Journal of Machine Learning Research 19, 1 (2018), 1913–1946.",
      "doi": "10.5555/3291125.3309611"
    },
    {
      "text": "Jae-Young Son, Apoorva Bhandari, and Oriel FeldmanHall. 2019. Crowdsourcing Punishment: Individuals Reference Group Preferences to Inform Their Own Punitive Decisions. Scientific Reports 9, 1 (2019), 1–15.",
      "doi": ""
    },
    {
      "text": "Garold Stasser and William Titus. 1985. Pooling of Unshared Information in Group Decision Making: Biased Information Sampling During Discussion.Journal of Personality and Social Psychology 48, 6(1985), 1467.",
      "doi": ""
    },
    {
      "text": "Cass R Sunstein. 1999. The Law of Group Polarization. University of Chicago Law School, John M. Olin Law & Economics Working Paper91(1999).",
      "doi": ""
    },
    {
      "text": "Cass R Sunstein. 2000. Deliberative Trouble? Why Groups Go to Extremes. The Yale Law Journal 100, 71 (2000), 71–119.",
      "doi": ""
    },
    {
      "text": "Cass R Sunstein and Reid Hastie. 2014. Making Dumb Groups Smarter. Harvard Business Review 92, 12 (2014), 90–98.",
      "doi": ""
    },
    {
      "text": "James Surowiecki. 2005. The Wisdom of Crowds. Anchor.",
      "doi": ""
    },
    {
      "text": "Ahmed E Taha. 2004. How Panels Affect Judges: Evidence from United States District Courts. U. Rich. L. Rev. 39(2004), 1235.",
      "doi": ""
    },
    {
      "text": "Linda Thorne, Dawn W. Massey, and Joanne Jones. 2004. An Investigation of Social Influence: Explaining the Effect of Group Discussion on Consensus in Auditors’ Ethical Reasoning.Business Ethics Quarterly 14, 3 (2004), 525–551. https://doi.org/10.5840/beq200414321",
      "doi": ""
    },
    {
      "text": "Nina Totenberg. 2019. Supreme Court Sees 2 Similar Death Penalty Questions Very Differently. (2019). https://www.npr.org/2019/03/30/708238203/supreme-court-sees-2-similar-death-penalty-questions-very-differently",
      "doi": ""
    },
    {
      "text": "Mark E Whiting, Allie Blaising, Chloe Barreau, Laura Fiuza, Nik Marda, Melissa Valentine, and Michael S Bernstein. 2019. Did It Have To End This Way? Understanding the Consistency of Team Fracture. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": ""
    },
    {
      "text": "Mark E Whiting, Irena Gao, Michelle Xing, Junior Diarrassouba N’Godjigui, Tonya Nguyen, and Michael S Bernstein. 2020. Parallel Worlds: Repeated Initializations of the Same Team To Improve Team Viability. Proceedings of the ACM on Human-Computer Interaction 4 (2020).",
      "doi": "10.1145/3392877"
    },
    {
      "text": "Mark E Whiting, Grant Hugh, and Michael S Bernstein. 2019. Fair Work: Crowd Work Minimum Wage with One Line of Code. In Proceedings of the AAAI Conference on Human Computation and Crowdsourcing, Vol. 7. 197–206.",
      "doi": ""
    },
    {
      "text": "Anita Williams Woolley, Christopher F Chabris, Alex Pentland, Nada Hashmi, and Thomas W Malone. 2010. Evidence for a Collective Intelligence Factor in the Performance of Human Groups. Science 330, 6004 (2010), 686–688.",
      "doi": ""
    },
    {
      "text": "Amy X Zhang, Grant Hugh, and Michael S Bernstein. 2020. PolicyKit: Building Governance in Online Communities. UIST ’20: Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (2020).",
      "doi": "10.1145/3379337.3415858"
    },
    {
      "text": "Sharon Zhou, Melissa Valentine, and Michael S Bernstein. 2018. In Search of the Dream Team: Temporally Constrained Multi-Armed Bandits for Identifying Effective Team Structures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173682"
    }
  ]
}