{
  "doi": "10.1145/3411764.3445130",
  "title": "AI in Global Health: The View from the Front Lines",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-21",
  "year": 2021,
  "badges": [],
  "abstract": "There has been growing interest in the application of AI for Social Good, motivated by scarce and unequal resources globally. We focus on the case of AI in frontline health, a Social Good domain that is increasingly a topic of significant attention. We offer a thematic discourse analysis of scientific and grey literature to identify prominent applications of AI in frontline health, motivations driving this work, stakeholders involved, and levels of engagement with the local context. We then uncover design considerations for these systems, drawing from data from three years of ethnographic fieldwork with women frontline health workers and women from marginalized communities in Delhi (India). Finally, we outline an agenda for AI systems that target Social Good, drawing from literature on HCI4D, post-development critique, and transnational feminist theory. Our paper thus offers a critical and ethnographic perspective to inform the design of AI systems that target social impact.",
  "authors": [
    {
      "name": "Azra Ismail",
      "institution": "Georgia Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320224",
      "orcid": "0000-0002-7570-9474"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "NITI Aayog. 2018. National Health Stack - Strategy and approach. https://niti.gov.in/writereaddata/files/document_publication/NHS-Strategy-and-Approach-Document-for-consultation.pdf",
      "doi": ""
    },
    {
      "text": "NITI Aayog. 2018. National Strategy for Artificial Intelligence. Technical Report. Aayog, NITI.",
      "doi": ""
    },
    {
      "text": "Rediet Abebe, Solon Barocas, Jon Kleinberg, Karen Levy, Manish Raghavan, and David G Robinson. 2020. Roles for computing in social change. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency. ACM, New York, NY, USA, 252–260.",
      "doi": "10.1145/3351095.3372871"
    },
    {
      "text": "Rediet Abebe and Kira Goldner. 2018. Mechanism design for social good. AI Matters 4, 3 (2018), 27–34.",
      "doi": "10.1145/3284751.3284761"
    },
    {
      "text": "Michael D Abràmoff, Philip T Lavin, Michele Birch, Nilay Shah, and James C Folk. 2018. Pivotal trial of an autonomous AI-based diagnostic system for detection of diabetic retinopathy in primary care offices. NPJ digital medicine 1, 1 (2018), 1–8.",
      "doi": ""
    },
    {
      "text": "Bipin Kumar Acharya, Wei Chen, Zengliang Ruan, Gobind Prasad Pant, Yin Yang, Lalan Prasad Shah, Chunxiang Cao, Zhiwei Xu, Meghnath Dhimal, and Hualiang Lin. 2019. Mapping Environmental Suitability of Scrub Typhus in Nepal Using MaxEnt and Random Forest Models. International Journal of Environmental Research and Public Health 16, 23(2019), 4845.",
      "doi": ""
    },
    {
      "text": "Ada. 2019. World’s first AI health guidance app in Swahili. https://ada.com/press/191119-worlds-first-ai-health-guidance-app-in-swahili/",
      "doi": ""
    },
    {
      "text": "Daniel Adedayo Adeyinka, Babayemi Oluwaseun Olakunde, and Nazeem Muhajarine. 2019. Evidence of health inequity in child survival: spatial and Bayesian network analyses of stillbirth rates in 194 countries. Scientific reports 9, 1 (2019), 1–11.",
      "doi": ""
    },
    {
      "text": "Fábio S Aguiar, Rodrigo C Torres, João VF Pinto, Afrânio L Kritski, José M Seixas, and Fernanda CQ Mello. 2016. Development of two artificial neural network models to support the diagnosis of pulmonary tuberculosis in hospitalized patients in Rio de Janeiro, Brazil. Medical & biological engineering & computing 54, 11(2016), 1751–1759.",
      "doi": ""
    },
    {
      "text": "Syed Ishtiaque Ahmed, Nova Ahmed, Faheem Hussain, and Neha Kumar. 2016. Computing beyond gender-imposed limits. In Proceedings of the Second Workshop on Computing Within Limits. ACM, New York, NY, USA, 1–7.",
      "doi": "10.1145/2926676.2926681"
    },
    {
      "text": "Wadhwani AI. 2019. Wadhwani AI - Maternal, Newborn, and Child Health. https://www.wadhwaniai.org/work/maternal-newborn-child-health/",
      "doi": ""
    },
    {
      "text": "Mahmood Akhtar, Moritz UG Kraemer, and Lauren M Gardner. 2019. A dynamic neural network model for predicting risk of Zika in real time. BMC medicine 17, 1 (2019), 171.",
      "doi": ""
    },
    {
      "text": "Hassane Alami, Lysanne Rivard, Pascale Lehoux, Steven J Hoffman, Stéphanie Bernadette Mafalda Cadeddu, Mathilde Savoldelli, Mamane Abdoulaye Samri, Mohamed Ali Ag Ahmed, Richard Fleet, and Jean-Paul Fortin. 2020. Artificial intelligence in health care: laying the Foundation for Responsible, sustainable, and inclusive innovation in low-and middle-income countries. Globalization and Health 16, 1 (2020), 1–6.",
      "doi": ""
    },
    {
      "text": "Shoayee Alotaibi, Rashid Mehmood, Iyad Katib, Omer Rana, and Aiiad Albeshri. 2020. Sehaa: A big data analytics tool for healthcare symptoms and diseases detection using Twitter, Apache Spark, and Machine Learning. Applied Sciences 10, 4 (2020), 1398.",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N Bennett, Kori Inkpen, 2019. Guidelines for human-AI interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 3.",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "S. Anbu and B. Sarmah. 2017. Machine learning approach for predicting womens health risk. In 2017 4th International Conference on Advanced Computing and Communication Systems (ICACCS). IEEE.",
      "doi": ""
    },
    {
      "text": "Urvashi Aneja, Vikrom Mathur, and Abishek Reddy. 2018. AI for All: 10 Social Conundrums for India. https://tandemresearch.org/assets/AI_Lab1_Final-Report_TR_compressed.pdf",
      "doi": ""
    },
    {
      "text": "Lasse F Wolff Anthony, Benjamin Kanding, and Raghavendra Selvan. 2020. Carbontracker: Tracking and predicting the carbon footprint of training deep learning models. (2020). arXiv:2007.03051",
      "doi": ""
    },
    {
      "text": "Lilian N Araujo, Jônatas T Belotti, Thiago Antonini Alves, Yara de Souza Tadano, and Hugo Siqueira. 2020. Ensemble method based on Artificial Neural Networks to estimate air pollution health risks. Environmental Modelling & Software 123 (2020), 104567.",
      "doi": "10.1016/j.envsoft.2019.104567"
    },
    {
      "text": "Payal Arora. 2019. The next billion users: Digital life beyond the West. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Neda Atanasoski and Kalindi Vora. 2019. Surrogate Humanity: Race, Robots, and the Politics of Technological Futures. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Alejandro Baldominos, Hasan Oğul, and Ricardo Colomo-Palacios. 2019. Infection Diagnosis using Biomedical Signals in Small Data Scenarios. In 2019 IEEE 32nd International Symposium on Computer-Based Medical Systems (CBMS). IEEE, 38–43.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Emma Beede, Elizabeth Baylor, Fred Hersch, Anna Iurchenko, Lauren Wilcox, Paisan Ruamviboonsuk, and Laura M Vardoulakis. 2020. A Human-Centered Evaluation of a Deep Learning System Deployed in Clinics for the Detection of Diabetic Retinopathy. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376718"
    },
    {
      "text": "Valentina Bellemo, Zhan W Lim, Gilbert Lim, Quang D Nguyen, Yuchen Xie, Michelle YT Yip, Haslina Hamzah, Jinyi Ho, Xin Q Lee, Wynne Hsu, 2019. Artificial intelligence using deep learning to screen for referable and vision-threatening diabetic retinopathy in Africa: a clinical validation study. The Lancet Digital Health 1, 1 (2019), e35–e44.",
      "doi": ""
    },
    {
      "text": "Ruha Benjamin. 2019. Race after technology: Abolitionist tools for the new jim code. Social Forces (2019).",
      "doi": ""
    },
    {
      "text": "Kaustav Bera, Kurt A Schalper, David L Rimm, Vamsidhar Velcheti, and Anant Madabhushi. 2019. Artificial intelligence in digital pathology—new tools for diagnosis and precision oncology. Nature reviews Clinical oncology 16, 11 (2019), 703–715.",
      "doi": ""
    },
    {
      "text": "Nilanjana Bhowmick and Saumya Khandelwal. 2020. Millions of women volunteers form India’s frontline COVID response. https://www.nationalgeographic.com/history/2020/06/millions-women-volunteers-form-india-frontline-covid-19-response/",
      "doi": ""
    },
    {
      "text": "Abderrahim Bourouis, Ali Zerdazi, Mohammed Feham, and Abdelhamid Bouchachia. 2013. M-health: skin disease analysis system using Smartphone’s camera. Procedia Computer Science 19 (2013), 1116–1120.",
      "doi": ""
    },
    {
      "text": "Lisa Bowleg. 2020. We’re not all in this together: On COVID-19, intersectionality, and structural inequality. American journal of public health 110, 7 (2020), 917.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Benedetta Brevini. 2020. Black boxes, not green: Mythologizing artificial intelligence and omitting the environment. Big Data & Society 7, 2 (2020), 2053951720935141.",
      "doi": ""
    },
    {
      "text": "A ‘Simply Brilliant’ Innovation. 2018. Mobile Phones for Maternal Health in Rural Bihar. Economic & Political Weekly 53, 11 (2018), 51.",
      "doi": ""
    },
    {
      "text": "Waylon Brunette, Samuel Sudar, Mitchell Sundt, Clarice Larson, Jeffrey Beorse, and Richard Anderson. 2017. Open Data Kit 2.0: A Services-Based Application Framework for Disconnected Data Management. In Proceedings of the 15th Annual International Conference on Mobile Systems, Applications, and Services(MobiSys ’17). ACM, New York, NY, USA, 440–452. event-place: Niagara Falls, New York, USA.",
      "doi": "10.1145/3081333.3081365"
    },
    {
      "text": "Joanna J Bryson. 2019. The past decade and future of AI’s impact on society.",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Conference on fairness, accountability and transparency. 77–91.",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2012. Invisible users: Youth in the Internet cafés of urban Ghana. Mit Press.",
      "doi": ""
    },
    {
      "text": "Jenna Burrell and Kentaro Toyama. 2009. What constitutes good ICTD research?Information Technologies & International Development 5, 3(2009), pp–82.",
      "doi": ""
    },
    {
      "text": "Massimo Buscema, Masoud Asadi-Zeydabadi, Weldon Lodwick, Alphonse Nde Nembot, Alvin Bronstein, and Francis Newman. 2020. Analysis of the Ebola Outbreak in 2014 and 2018 in West Africa and Congo by Using Artificial Adaptive Systems. Applied Artificial Intelligence 34, 8 (2020), 597–617.",
      "doi": ""
    },
    {
      "text": "Declan Butler. 2017. AI summit aims to help world’s poorest. Nature News 546, 7657 (2017), 196.",
      "doi": ""
    },
    {
      "text": "Carrie J Cai, Samantha Winter, David Steiner, Lauren Wilcox, and Michael Terry. 2019. ” Hello AI”: Uncovering the Onboarding Needs of Medical Practitioners for Human-AI Collaborative Decision-Making. Proceedings of the ACM on Human-computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359206"
    },
    {
      "text": "Catherine Campbell and Kerry Scott. 2012. Community health and social mobilization. The handbook of global health communication(2012), 177–193.",
      "doi": ""
    },
    {
      "text": "Sema Candemir, Sameer Antani, Stefan Jaeger, Renee Browning, and George R Thoma. 2015. Lung boundary detection in pediatric chest X-rays. In Medical Imaging 2015: PACS and Imaging Informatics: Next Generation and Innovations, Vol. 9418. International Society for Optics and Photonics, 94180Q.",
      "doi": ""
    },
    {
      "text": "Yu Cao, Chang Liu, Benyuan Liu, Maria J Brunette, Ning Zhang, Tong Sun, Peifeng Zhang, Jesus Peinado, Epifanio Sanchez Garavito, Leonid Lecca Garcia, 2016. Improving tuberculosis diagnostics using deep learning and mobile health technologies among resource-poor and marginalized communities. In 2016 IEEE first international conference on connected health: applications, systems and engineering technologies (CHASE). IEEE, 274–281.",
      "doi": ""
    },
    {
      "text": "Sara Chamberlain. 2016. An overview of Kilkari – A maternal and child health service in India. https://www.gsma.com/mobilefordevelopment/programme/mhealth/an-overview-of-kilkari-a-maternal-and-child-health-service-in-india/",
      "doi": ""
    },
    {
      "text": "Cary Champlin, David Bell, and Celina Schocken. 2017. AI medicine comes to Africa’s rural clinics. IEEE Spectrum 54, 5 (2017), 42–48.",
      "doi": "10.1109/MSPEC.2017.7906899"
    },
    {
      "text": "HC Stephen Chan, Hanbin Shan, Thamani Dahoun, Horst Vogel, and Shuguang Yuan. 2019. Advancing drug discovery via artificial intelligence. Trends in pharmacological sciences 40, 8 (2019), 592–604.",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Eric P. S. Baumer, and Munmun De Choudhury. 2019. Who is the ”Human” in Human-Centered Machine Learning: The Case of Predicting Mental Health from Social Media. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 147 (Nov. 2019), 32 pages. https://doi.org/10.1145/3359249",
      "doi": "10.1145/3359249"
    },
    {
      "text": "Subhash Chandir, Danya Arif Siddiqi, Owais Ahmed Hussain, Tahira Niazi, Mubarak Taighoon Shah, Vijay Kumar Dharma, Ali Habib, and Aamir Javed Khan. 2018. Using predictive analytics to identify children at high risk of defaulting from a routine immunization program: feasibility study. JMIR public health and surveillance 4, 3 (2018), e63.",
      "doi": ""
    },
    {
      "text": "Jianqian Chao, Jiangyi Gu, Hua Zhang, Huanghui Chen, and Zhenchun Wu. 2018. The Impact of the National Essential Medicines Policy on Rational Drug Use in Primary Care Institutions in Jiangsu Province of China.Iranian journal of public health 47, 1 (2018), 24–32.",
      "doi": ""
    },
    {
      "text": "Lauren E Charles-Smith, Tera L Reynolds, Mark A Cameron, Mike Conway, Eric HY Lau, Jennifer M Olsen, Julie A Pavlin, Mika Shigematsu, Laura C Streichert, Katie J Suda, 2015. Using social media for actionable disease surveillance and outbreak management: a systematic literature review. PloS one 10, 10 (2015), e0139701.",
      "doi": ""
    },
    {
      "text": "Bidisha Chaudhuri. 2020. Distant, opaque and seamful: seeing the state through the workings of Aadhaar in India. Information Technology for Development(2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Irene Y Chen, Shalmali Joshi, and Marzyeh Ghassemi. 2020. Treating health disparities with artificial intelligence. Nature Medicine 26, 1 (2020), 16–17.",
      "doi": ""
    },
    {
      "text": "Sasank Chilamkurthy, Rohit Ghosh, Swetha Tanamala, Mustafa Biviji, Norbert G Campeau, Vasantha Kumar Venugopal, Vidur Mahajan, Pooja Rao, and Prashant Warier. 2018. Deep learning algorithms for detection of critical findings in head CT scans: a retrospective study. The Lancet 392, 10162 (2018), 2388–2396.",
      "doi": ""
    },
    {
      "text": "Davide Cirillo, Silvina Catuara-Solarz, Czuee Morey, Emre Guney, Laia Subirats, Simona Mellino, Annalisa Gigante, Alfonso Valencia, María José Rementeria, Antonella Santuccione Chadha, and Nikolaos Mavridis. 2020. Sex and gender differences and biases in artificial intelligence for biomedicine and healthcare. NPJ Digital Medicine 3, 1 (2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Leonardo Clemente, Fred Lu, and Mauricio Santillana. 2019. Improved real-time influenza surveillance: using internet search data in eight Latin American countries. JMIR public health and surveillance 5, 2 (2019), e12214.",
      "doi": ""
    },
    {
      "text": "Special Correspondent. 2019. Anganwadi, ASHA workers protest in support of demands. https://www.thehindu.com/news/national/karnataka/anganwadi-asha-workers-protest-in-support-of-demands/article28363975.ece",
      "doi": ""
    },
    {
      "text": "Kate Crawford, Roel Dobbe, Theodora Dryer, Genevieve Fried, Ben Green, Elizabeth Kaziunas, Amba Kak, Varoon Mathur, Erin McElroy, Andrea Nill Sánchez, 2019. AI now 2019 report. New York, NY: AI Now Institute(2019).",
      "doi": ""
    },
    {
      "text": "Andrew Cross, Rashmi Rodrigues, George D’Souza, and William Thies. 2014. 99DOTS: using mobile phones to monitor adherence to tuberculosis medications. In Washington, Global mHealth Forum.",
      "doi": ""
    },
    {
      "text": "Éric Dagiral and Khetrimayum Monish Singh. 2020. Governance and Accountable Citizenship Through Identification Infrastructures: Database Politics of Copernicus (France) and National Register of Citizens (India). Science, Technology and Society(2020), 0971721820912895.",
      "doi": ""
    },
    {
      "text": "Ali Darwish, Yasser Rahhal, and Assef Jafar. 2020. A comparative study on predicting influenza outbreaks using different feature spaces: application of influenza-like illness data from Early Warning Alert and Response System in Syria. BMC research notes 13, 1 (2020), 1–8.",
      "doi": ""
    },
    {
      "text": "Maria De-Arteaga, Amanda Coston, and William Herlands. 2018. Proceedings of NeurIPS 2018 Workshop on Machine Learning for the Developing World: Achieving Sustainable Impact. (2018). arXiv:1812.10398",
      "doi": ""
    },
    {
      "text": "Haile T Debas, Ramanan Laxminarayan, and Stephen E Straus. 2006. Complementary and alternative medicine. Disease control priorities in developing countries 2 (2006).",
      "doi": ""
    },
    {
      "text": "Nicola Dell and Neha Kumar. 2016. The ins and outs of HCI for development. In Proceedings of the 2016 CHI conference on human factors in computing systems. ACM, New York, NY, USA, 2220–2232.",
      "doi": "10.1145/2858036.2858081"
    },
    {
      "text": "Federico Demaria and Ashish Kothari. 2017. The Post-Development Dictionary agenda: paths to the pluriverse. Third World Quarterly 38, 12 (2017), 2588–2599.",
      "doi": ""
    },
    {
      "text": "Suruchi Deodhar, Jiangzhuo Chen, Mandy Wilson, Keith Bisset, Chris Barrett, and Madhav Marathe. 2015. EpiCaster: An integrated web application for situation assessment and forecasting of global epidemics. In Proceedings of the 6th ACM Conference on Bioinformatics, Computational Biology and Health Informatics. 156–165.",
      "doi": "10.1145/2808719.2808735"
    },
    {
      "text": "Brian DeRenzi, Nicola Dell, Jeremy Wacksman, Scott Lee, and Neal Lesh. 2017. Supporting Community Health Workers in India through Voice-and Web-Based Feedback. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2770–2781.",
      "doi": "10.1145/3025453.3025514"
    },
    {
      "text": "Thomas Desautels, Jacob Calvert, Jana Hoffman, Qingqing Mao, Melissa Jay, Grant Fletcher, Chris Barton, Uli Chettipally, Yaniv Kerem, and Ritankar Das. 2017. Using transfer learning for improved mortality prediction in a data-scarce hospital setting. Biomedical informatics insights 9 (2017), 1178222617712994.",
      "doi": ""
    },
    {
      "text": "Michael A Devito, Ashley Marie Walker, Jeremy Birnholtz, Kathryn Ringland, Kathryn Macapagal, Ashley Kraus, Sean Munson, Calvin Liang, and Herman Saksono. 2019. Social Technologies for Digital Wellbeing Among Marginalized Communities. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. ACM, New York, NY, USA, 449–454.",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio and Lauren F Klein. 2020. Data feminism. MIT Press.",
      "doi": ""
    },
    {
      "text": "Fangyu Ding, Jingying Fu, Dong Jiang, Mengmeng Hao, and Gang Lin. 2018. Mapping the spatial distribution of Aedes aegypti and Aedes albopictus. Acta tropica 178(2018), 155–162.",
      "doi": ""
    },
    {
      "text": "Leslie L Dodson, S Revi Sterling, and John K Bennett. 2012. Considering failure: eight years of ITID research. In Proceedings of the fifth international conference on information and communication technologies and development. ACM, New York, NY, USA, 56–64.",
      "doi": "10.1145/2160673.2160681"
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social justice-oriented interaction design: Outlining key design strategies and commitments. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, New York, NY, USA, 656–671.",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Yichun Duan, Guopeng Zhou, Yuanxing Zhang, Zhaoqian Lan, Chunhua Chi, and Wei Yan. 2018. Neural Network Based Clinical Treatment Decision Support System for Co-existing Medical Conditions. In 2018 IEEE Third International Conference on Data Science in Cyberspace (DSC). IEEE, 131–138.",
      "doi": ""
    },
    {
      "text": "Michaelanne Dye, David Nemer, Neha Kumar, and Amy S Bruckman. 2019. If it Rains, Ask Grandma to Disconnect the Nano: Maintenance & Care in Havana’s StreetNet. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": "10.1145/3359289"
    },
    {
      "text": "Michaelanne Dye, David Nemer, Josiah Mangiameli, Amy S Bruckman, and Neha Kumar. 2018. El Paquete Semanal: The Week’s Internet in Havana. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3174213"
    },
    {
      "text": "Arturo Escobar. 2011. Encountering development: The making and unmaking of the Third World. Vol. 1. Princeton University Press.",
      "doi": ""
    },
    {
      "text": "Arturo Escobar. 2018. Designs for the pluriverse: Radical interdependence, autonomy, and the making of worlds. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Virginia Eubanks. 2018. Automating inequality: How high-tech tools profile, police, and punish the poor. St. Martin’s Press.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Orlando Fals-Borda. 1987. The application of participatory action-research in Latin America. International sociology 2, 4 (1987), 329–347.",
      "doi": ""
    },
    {
      "text": "Myra Marx Ferree and Aili Mari Tripp. 2006. Global feminism: Transnational women’s activism, organizing, and human rights. NYU Press.",
      "doi": ""
    },
    {
      "text": "U.S. Agency for International Development. 2019. Artificial Intelligence in Global Health: Defining a Collective Path Forward. https://www.usaid.gov/cii/ai-in-global-health",
      "doi": ""
    },
    {
      "text": "AI for Social Good. 2019. Joint Workshop on AI for Social Good at NeurIPS 2019. https://aiforsocialgood.github.io/neurips2019/",
      "doi": ""
    },
    {
      "text": "Michel Foucault. 1972. The archaeology of knowledge (AMS Smith, Trans.). New York: Pantheon (1972).",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Jill Dimond, Lilly Irani, Tad Hirsch, Michael Muller, and Shaowen Bardzell. 2017. Social Justice and Design: Power and Oppression in Collaborative Systems. In Companion of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17 Companion). ACM, New York, NY, USA, 117–122. event-place: Portland, Oregon, USA.",
      "doi": "10.1145/3022198.3022201"
    },
    {
      "text": "Jacquelline Fuller. 2019. Here are the grantees of the Google AI Impact Challenge. https://www.blog.google/outreach-initiatives/google-org/ai-impact-challenge-grantees/",
      "doi": ""
    },
    {
      "text": "Rikin Gandhi, Rajesh Veeraraghavan, and Kentaro Toyama. 2016. Digital green. Harnessing the power of collective learning: Feedback, accountability and constituent voice in rural development(2016), 16–30.",
      "doi": ""
    },
    {
      "text": "Rikin Gandhi, Rajesh Veeraraghavan, Kentaro Toyama, and Vanaja Ramprasad. 2007. Digital green: Participatory video for agricultural extension. In 2007 International conference on information and communication technologies and development. IEEE, 1–10.",
      "doi": ""
    },
    {
      "text": "Paul A Gastanaduy, Emily Banerjee, Chas DeBolt, Pamela Bravo-Alcántara, Samia A Samad, Desiree Pastor, Paul A Rota, Manisha Patel, Natasha S Crowcroft, and David N Durrheim. 2018. Public health responses during measles outbreaks in elimination settings: Strategies and challenges. Human vaccines & immunotherapeutics 14, 9 (2018), 2222–2238.",
      "doi": ""
    },
    {
      "text": "George Gatuha and Tao Jiang. 2016. Android based naive Bayes probabilistic detection model for breast cancer and mobile cloud computing: design and implementation. In International Journal of Engineering Research in Africa, Vol. 21. Trans Tech Publ, 197–208.",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2014. An introduction to discourse analysis: Theory and method. Routledge.",
      "doi": ""
    },
    {
      "text": "Nouby M Ghazaly, Muhammad A Abdel-Fattah, and AA Abd El-Aziz. 2020. Novel Coronavirus Forecasting Model using Nonlinear Autoregressive Artificial Neural Network. Journal of advanced science(2020).",
      "doi": ""
    },
    {
      "text": "Sayantan Ghosh. 2020. Ahead of Delhi polls, AAP government and BJP-run MCD provide contrasting case studies in governance, Firstpost. https://www.firstpost.com/politics/ahead-of-delhi-polls-aap-government-and-bjp-run-mcd-provide-contrasting-case-studies-in-governance-7907751.html",
      "doi": ""
    },
    {
      "text": "Anand Giridharadas. 2018. Winners take all: The elite charade of changing the world. Knopf.",
      "doi": ""
    },
    {
      "text": "Mayank Goel, Elliot Saba, Maia Stiber, Eric Whitmire, Josh Fromm, Eric C Larson, Gaetano Borriello, and Shwetak N Patel. 2016. Spirocall: Measuring lung function over a phone call. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 5675–5685.",
      "doi": "10.1145/2858036.2858401"
    },
    {
      "text": "Leo A Goodman. 1961. Snowball sampling. The annals of mathematical statistics(1961), 148–170.",
      "doi": ""
    },
    {
      "text": "Mary L Gray and Siddharth Suri. 2019. Ghost Work: How to Stop Silicon Valley from Building a New Global Underclass. Eamon Dolan Books.",
      "doi": ""
    },
    {
      "text": "Pi Guo, Tao Liu, Qin Zhang, Li Wang, Jianpeng Xiao, Qingying Zhang, Ganfeng Luo, Zhihao Li, Jianfeng He, Yonghui Zhang, and Wenjun Ma. 2017. Developing a dengue forecast model using machine learning: A case study in China. PLoS neglected tropical diseases 11, 10 (2017), e0005973.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated knowledges: The science question in feminism and the privilege of partial perspective. Feminist studies 14, 3 (1988), 575–599.",
      "doi": ""
    },
    {
      "text": "Carl Hartung, Adam Lerer, Yaw Anokwa, Clint Tseng, Waylon Brunette, and Gaetano Borriello. 2010. Open data kit: tools to build information services for developing regions. In Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/2369220.2369236"
    },
    {
      "text": "Gillian R Hayes. 2011. The relationship of action research to human-computer interaction. ACM Transactions on Computer-Human Interaction (TOCHI) 18, 3(2011), 1–20.",
      "doi": "10.1145/1993060.1993065"
    },
    {
      "text": "The Lancet Public Health. 2019. Next generation public health: towards precision and fairness. The Lancet Public health 4, 5 (2019), e209.",
      "doi": ""
    },
    {
      "text": "Anna Lauren Hoffmann and Iris Marion Young. 2020. Terms of Inclusion: Data, Discourse, Violence. New Media & Society (August 2020). Forthcoming.",
      "doi": ""
    },
    {
      "text": "Isaac Holeman and Dianna Kane. 2020. Human-centered design for global health equity. Information Technology for Development 26, 3 (2020), 477–505.",
      "doi": ""
    },
    {
      "text": "Ahmed Hosny and Hugo JWL Aerts. 2019. Artificial intelligence for global health. Science 366, 6468 (2019), 955–956.",
      "doi": ""
    },
    {
      "text": "Tanja AJ Houweling, David van Klaveren, Sushmita Das, Kishwar Azad, Prasanta Tripathy, Dharma Manandhar, Melissa Neuman, Erik de Jonge, Jasper V Been, Ewout Steyerberg, 2019. A prediction model for neonatal mortality in low-and middle-income countries: an analysis of data from population surveillance sites in India, Nepal and Bangladesh. International journal of epidemiology 48, 1 (2019), 186–198.",
      "doi": ""
    },
    {
      "text": "Shigao Huang, Jie Yang, Simon Fong, and Qi Zhao. 2020. Artificial intelligence in cancer diagnosis and prognosis: Opportunities and challenges. Cancer Letters 471(2020), 61–71.",
      "doi": ""
    },
    {
      "text": "Sangheum Hwang, Hyo-Eun Kim, Jihoon Jeong, and Hee-Jin Kim. 2016. A novel approach for tuberculosis screening based on deep convolutional neural networks. In Medical imaging 2016: computer-aided diagnosis, Vol. 9785. International Society for Optics and Photonics, 97852W.",
      "doi": ""
    },
    {
      "text": "IBM. 2020. iKure + IBM, Delivering healthcare beyond boundaries. https://www.ibm.com/thought-leadership/in-en/smart/ikure/",
      "doi": ""
    },
    {
      "text": "Merajul Islam, Jahanur Rahman, Dulal Chandra Roy, 2020. Automated detection and classification of diabetes disease based on Bangladesh demography and health survey data, 2011 using machine learning approach. Diabetes & Metabolic Syndrome: Clinical Research & Reviews (2020).",
      "doi": ""
    },
    {
      "text": "Azra Ismail, Naveena Karusala, and Neha Kumar. 2018. Bridging Disconnected Knowledges for Community Health. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 75.",
      "doi": "10.1145/3274344"
    },
    {
      "text": "Azra Ismail and Neha Kumar. 2018. Engaging Solidarity in Data Collection Practices for Community Health. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 76.",
      "doi": "10.1145/3274345"
    },
    {
      "text": "Azra Ismail and Neha Kumar. 2019. Empowerment on the Margins: The Online Experiences of Community Health Workers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 99.",
      "doi": "10.1145/3290605.3300329"
    },
    {
      "text": "ITU. 2020. AI for Good Global Summit. https://aiforgood.itu.int/",
      "doi": ""
    },
    {
      "text": "Siddhartha Jain and Nimmi Rangaswamy. 2020. Good Digital Identity: The Case of Aadhaar in India. In Proceedings of the 3rd ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, New York, NY, USA, 345–346.",
      "doi": "10.1145/3378393.3402290"
    },
    {
      "text": "LS Jayashree, R Lakshmi Devi, Nikolaos Papandrianos, and Elpiniki I Papageorgiou. 2018. Application of fuzzy cognitive map for geospatial dengue outbreak risk prediction of tropical regions of Southern India. Intelligent Decision Technologies 12, 2 (2018), 231–250.",
      "doi": "10.3233/IDT-180330"
    },
    {
      "text": "Chunyan Ji, Xueli Xiao, Sunitha Basodi, and Yi Pan. 2019. Deep Learning for Asphyxiated Infant Cry Classification Based on Acoustic Features and Weighted Prosodic Features. In 2019 International Conference on Internet of Things (iThings) and IEEE Green Computing and Communications (GreenCom) and IEEE Cyber, Physical and Social Computing (CPSCom) and IEEE Smart Data (SmartData). IEEE, 1233–1240.",
      "doi": ""
    },
    {
      "text": "Anirudha Joshi, Mandar Rane, Debjani Roy, Nagraj Emmadi, Padma Srinivasan, N. Kumarasamy, Sanjay Pujari, Davidson Solomon, Rashmi Rodrigues, D.G. Saple, Kamalika Sen, Els Veldeman, and Romain Rutten. 2014. Supporting Treatment of People Living with HIV / AIDS in Resource Limited Settings with IVRs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 1595–1604. https://doi.org/10.1145/2556288.2557236",
      "doi": "10.1145/2556288.2557236"
    },
    {
      "text": "Eiko Kai, Ashir Ahmed, Sozo Inoue, Atsushi Taniguchi, Yasunobu Nohara, Naoki Nakashima, and Masaru Kitsuregawa. 2014. Evolving health consultancy by predictive caravan health sensing in developing countries. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct Publication. ACM, New York, NY, USA, 1225–1232.",
      "doi": "10.1145/2638728.2638816"
    },
    {
      "text": "Amba Kak. 2020. ” The Global South is everywhere, but also always somewhere” National Policy Narratives and AI Justice. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society. 307–312.",
      "doi": "10.1145/3375627.3375859"
    },
    {
      "text": "Siva Teja Kakileti, Himanshu J Madhu, Geetha Manjunath, Leonard Wee, Andre Dekker, and Sudhakar Sampangi. 2020. Personalized Risk Prediction for Breast Cancer Pre-screening using Artificial Intelligence and Thermal Radiomics. Artificial Intelligence in Medicine(2020), 101854.",
      "doi": ""
    },
    {
      "text": "Pratyusha Kalluri. 2020. Don’t ask if artificial intelligence is good or fair, ask how it shifts power.Nature 583, 7815 (2020), 169–169.",
      "doi": ""
    },
    {
      "text": "Shivaram Kalyanakrishnan, Rahul Alex Panicker, Sarayu Natarajan, and Shreya Rao. 2018. Opportunities and Challenges for Artificial Intelligence in India. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society (New Orleans, LA, USA) (AIES ’18). ACM, New York, NY, USA, 164–170. https://doi.org/10.1145/3278721.3278738",
      "doi": "10.1145/3278721.3278738"
    },
    {
      "text": "Naveena Karusala, Isaac Holeman, and Richard Anderson. 2019. Engaging Identity, Assets, and Constraints in Designing for Resilience. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359315"
    },
    {
      "text": "Jasmeet Kaur, Asra Sakeen Wani, and Pushpendra Singh. 2019. Engagement of Pregnant Women and Mothers over WhatsApp: Challenges and Opportunities Involved. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. ACM, New York, NY, USA, 236–240.",
      "doi": "10.1145/3311957.3359481"
    },
    {
      "text": "Sirina Keesara, Andrea Jonas, and Kevin Schulman. 2020. Covid-19 and health care’s digital revolution. New England Journal of Medicine 382, 23 (2020), e82.",
      "doi": ""
    },
    {
      "text": "Os Keyes. 2018. The misgendering machines: Trans/HCI implications of automatic gender recognition. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 88.",
      "doi": "10.1145/3274357"
    },
    {
      "text": "Jackson A Killian, Bryan Wilder, Amit Sharma, Vinod Choudhary, Bistra Dilkina, and Milind Tambe. 2019. Learning to prescribe interventions for tuberculosis patients using digital adherence data. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. ACM, New York, NY, USA, 2430–2438.",
      "doi": "10.1145/3292500.3330777"
    },
    {
      "text": "Dani Kiyasseh, Girmaw Abebe Tadesse, Nhan Le Nguyen Thanh, Tan Le Van, Louise Thwaites, Tingting Zhu, and David Clifton. 2020. PlethAugment: GAN-Based PPG Augmentation for Medical Diagnosis in Low-Resource Settings. IEEE Journal of Biomedical and Health Informatics (2020).",
      "doi": ""
    },
    {
      "text": "Phani Krishna Kondeti, Kumar Ravi, Srinivasa Rao Mutheneni, Madhusudhan Rao Kadiri, Sriram Kumaraswamy, Ravi Vadlamani, and Suryanaryana Murty Upadhyayula. 2019. Applications of machine learning techniques to predict filariasis using socio-economic factors. Epidemiology & Infection 147 (2019).",
      "doi": ""
    },
    {
      "text": "Sandhya Krishnan and Neeraj Hatekar. 2017. Rise of the new middle class in India and its changing structure. Economic and Political Weekly 52, 22 (2017), 40–48.",
      "doi": ""
    },
    {
      "text": "Neha Kumar. 2014. Facebook for self-empowerment? A study of Facebook adoption in urban India. New media & society 16, 7 (2014), 1122–1137.",
      "doi": ""
    },
    {
      "text": "Neha Kumar. 2015. The gender-technology divide or perceptions of non-use?First Monday 20, 11 (2015).",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J Anderson. 2015. Mobile phones for maternal health in rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 427–436.",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Neha Kumar, Naveena Karusala, Azra Ismail, Marisol Wong-Villacres, and Aditya Vishwanath. 2019. Engaging Feminist Solidarity for Comparative Research, Design, and Practice. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–24.",
      "doi": "10.1145/3359269"
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, and Richard Anderson. 2015. Projecting Health: Community-led Video Education for Maternal Health. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development (Singapore, Singapore) (ICTD ’15). ACM, New York, NY, USA, Article 17, 10 pages. https://doi.org/10.1145/2737856.2738023",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Rajesh Kumar T and Abinaya .K. 2020. An AI Based Chat-Bot for Providing Health Services. Test Engineering and Management 83 (03 2020), 3721–3726.",
      "doi": ""
    },
    {
      "text": "Samuel Lalmuanawma, Jamal Hussain, and Lalrinfela Chhakchhuak. 2020. Applications of machine learning and artificial intelligence for Covid-19 (SARS-CoV-2) pandemic: A review. Chaos, Solitons & Fractals(2020), 110059.",
      "doi": ""
    },
    {
      "text": "Emily LaRosa and David Danks. 2018. Impacts on trust of healthcare AI. In Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society. 210–215.",
      "doi": "10.1145/3278721.3278771"
    },
    {
      "text": "Kai-Fu Lee. 2018. AI superpowers: China, Silicon Valley, and the new world order. Houghton Mifflin Harcourt.",
      "doi": ""
    },
    {
      "text": "Siew Hwa Lee, Ulugbek B Nurmatov, Bright I Nwaru, Mome Mukherjee, Liz Grant, and Claudia Pagliari. 2016. Effectiveness of mHealth interventions for maternal, newborn and child health in low–and middle–income countries: Systematic review and meta–analysis. Journal of global health 6, 1 (2016).",
      "doi": ""
    },
    {
      "text": "Chang Liu, Yu Cao, Marlon Alcantara, Benyuan Liu, Maria Brunette, Jesus Peinado, and Walter Curioso. 2017. TX-CNN: Detecting tuberculosis in chest X-ray images using convolutional neural network. In 2017 IEEE International Conference on Image Processing (ICIP). IEEE, 2314–2318.",
      "doi": "10.1109/ICIP.2017.8296695"
    },
    {
      "text": "Logistimo. 2019. Logistimo | Advanced Technologies - Artificial intelligence and optimisation algorithms powering the supply chain and logistics platform. https://www.logistimo.com/advanced-technologies",
      "doi": ""
    },
    {
      "text": "Fernando López-Martínez, Edward Rolando Núñez-Valdez, Jaime Lorduy Gomez, and Vicente García-Díaz. 2019. A neural network approach to predict early neonatal sepsis. Computers & Electrical Engineering 76 (2019), 379–388.",
      "doi": "10.1016/j.compeleceng.2019.04.015"
    },
    {
      "text": "Federica Lucivero. 2020. Big data, big waste? A reflection on the environmental sustainability of big data initiatives. Science and engineering ethics 26, 2 (2020), 1009–1030.",
      "doi": ""
    },
    {
      "text": "macro eyes. 2020. CHAIN - macro-eyes Health. https://www.macro-eyes.com/chain",
      "doi": ""
    },
    {
      "text": "Michael A Madaio, Luke Stark, Jennifer Wortman Vaughan, and Hanna Wallach. 2020. Co-Designing Checklists to Understand Organizational Challenges and Opportunities around Fairness in AI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376445"
    },
    {
      "text": "Charru Malhotra, Vinod Kotwal, and Aniket Basu. 2019. Designing National Health Stack for Public Health: Role of ICT-Based Knowledge Management System. In 2019 ITU Kaleidoscope: ICT for Health: Networks, Standards and Innovation (ITU K). IEEE, 1–8.",
      "doi": ""
    },
    {
      "text": "Sanya Mansoor and Billy Perrigo. 2019. Inside the Anti-Citizenship Act Protests Rocking India. https://time.com/5752186/india-protests-citizenship-act/",
      "doi": ""
    },
    {
      "text": "Megh Marathe, Jacki O’Neill, Paromita Pain, and William Thies. 2015. Revisiting CGNet Swara and its impact in rural India. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. ACM, New York, NY, USA, 1–10.",
      "doi": "10.1145/2737856.2738026"
    },
    {
      "text": "Milena Soriano Marcolino, João Antonio Queiroz Oliveira, Marcelo D’Agostino, Antonio Luiz Ribeiro, Maria Beatriz Moreira Alkmim, and David Novillo-Ortiz. 2018. The impact of mHealth interventions: systematic review of systematic reviews. JMIR mHealth and uHealth 6, 1 (2018), e23.",
      "doi": ""
    },
    {
      "text": "George E Marcus. 1995. Ethnography in/of the world system: The emergence of multi-sited ethnography. Annual review of anthropology 24, 1 (1995), 95–117.",
      "doi": ""
    },
    {
      "text": "Muthoni Masinde. 2020. Africa’s Malaria Epidemic Predictor: Application of Machine Learning on Malaria Incidence and Climate Data. In Proceedings of the 2020 the 4th International Conference on Compute and Data Analysis. 29–37.",
      "doi": "10.1145/3388142.3388158"
    },
    {
      "text": "Becky McCall. 2020. COVID-19 and artificial intelligence: protecting health-care workers and curbing the spread. The Lancet Digital Health 2, 4 (2020), e166–e167.",
      "doi": ""
    },
    {
      "text": "Jaime Melendez, Clara I Sánchez, Rick HHM Philipsen, Pragnya Maduskar, Rodney Dawson, Grant Theron, Keertan Dheda, and Bram Van Ginneken. 2016. An automated tuberculosis screening strategy combining X-ray-based computer-aided detection and clinical information. Scientific reports 6(2016), 25265.",
      "doi": ""
    },
    {
      "text": "Syeda Shaizadi Meraj, Razali Yaakob, Azreen Azman, Siti Nuralain Mohd Rum, Azree Shahrel, and Ahmad Nazri. 2019. Artificial Intelligence in Diagnosing Tuberculosis: A Review. Int. Journal on Advanced Sci., Eng. and Inform. Technology 9, 1(2019), 81–91.",
      "doi": ""
    },
    {
      "text": "Sharan B Merriam. 2002. Qualitative research in practice: Examples for discussion and analysis. Jossey-Bass Inc Pub.",
      "doi": ""
    },
    {
      "text": "National Rural Health Mission. 2017. Guidelines for Community Processes. http://bit.ly/2hfEGVU [Online; accessed 19-September-2017].",
      "doi": ""
    },
    {
      "text": "Gairika Mitra. 2020. How Is Telemedicine Acting As A Disruptor In The Health Tech Space?https://www.expresscomputer.in/interviews/how-is-telemedicine-acting-as-a-disruptor-in-the-health-tech-space/53860/",
      "doi": ""
    },
    {
      "text": "ML4D. 2020. Machine Learning for Development (ML4D) 2020. https://sites.google.com/view/ml4d/home",
      "doi": ""
    },
    {
      "text": "Leila Moftakhar, SEIF Mozhgan, and Marziyeh Sadat Safe. 2020. Exponentially Increasing Trend of Infected Patients with COVID-19 in Iran: A Comparison of Neural Network and ARIMA Forecasting Models. Iranian Journal of Public Health 49 (2020), 92–100.",
      "doi": ""
    },
    {
      "text": "Shakir Mohamed, Marie-Therese Png, and William Isaac. 2020. Decolonial AI: Decolonial Theory as Sociotechnical Foresight in Artificial Intelligence. Philosophy & Technology(2020), 1–26.",
      "doi": ""
    },
    {
      "text": "Suhad Hadi Mohammed, Mohanad Mohsin Ahmed, Ali Mousa Al-Mousawi, Adeboye Azeez, 2018. Seasonal behavior and forecasting trends of tuberculosis incidence in Holy Kerbala, Iraq. Int J Mycobacteriol 7, 4 (2018), 361–367.",
      "doi": ""
    },
    {
      "text": "Chandra Talpade Mohanty. 1988. Under Western eyes: Feminist scholarship and colonial discourses. Feminist review30(1988), 61–88.",
      "doi": ""
    },
    {
      "text": "Chandra Talpade Mohanty. 2003. “Under Western eyes” revisited: feminist solidarity through anticapitalist struggles. Signs: Journal of Women in culture and Society 28, 2 (2003), 499–535.",
      "doi": ""
    },
    {
      "text": "Aparna Moitra, Vishnupriya Das, Gram Vaani, Archna Kumar, and Aaditeshwar Seth. 2016. Design lessons from creating a mobile-based community media platform in Rural India. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development. ACM, New York, NY, USA, 1–11.",
      "doi": "10.1145/2909609.2909670"
    },
    {
      "text": "Maletsabisa Molapo, Melissa Densmore, and Brian DeRenzi. 2017. Video Consumption Patterns for First Time Smartphone Users: Community Health Workers in Lesotho. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 6159–6170.",
      "doi": "10.1145/3025453.3025616"
    },
    {
      "text": "Katie Moon and Deborah Blackman. 2014. A guide to understanding social science research for natural scientists. Conservation Biology 28, 5 (2014), 1167–1177.",
      "doi": ""
    },
    {
      "text": "Mário WL Moreira, Joel JPC Rodrigues, Francisco HC Carvalho, Naveen Chilamkurti, Jalal Al-Muhtadi, and Victor Denisov. 2019. Biomedical data analytics in mobile-health environments for high-risk pregnancy outcome prediction. Journal of Ambient Intelligence and Humanized Computing 10, 10(2019), 4121–4134.",
      "doi": ""
    },
    {
      "text": "Yongqing Nan and Yanyan Gao. 2018. A machine learning method to monitor China’s AIDS epidemics with data from Baidu trends. PloS one 13, 7 (2018), e0199697.",
      "doi": ""
    },
    {
      "text": "Meena Natarajan and Tapan Parikh. 2013. Understanding Barriers to Information Access and Disclosure for HIV+ Women. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1 (Cape Town, South Africa) (ICTD ’13). ACM, New York, NY, USA, 143–152. https://doi.org/10.1145/2516604.2516627",
      "doi": "10.1145/2516604.2516627"
    },
    {
      "text": "BBC News. 2018. Aadhaar: ‘Leak’ in world’s biggest database worries Indians. https://www.bbc.com/news/world-asia-india-42575443",
      "doi": ""
    },
    {
      "text": "Siddharth Nishtala, Harshavardhan Kamarthi, Divy Thakkar, Dhyanesh Narayanan, Anirudh Grama, Ramesh Padmanabhan, Neha Madhiwalla, Suresh Chaudhary, Balaraman Ravindra, and Milind Tambe. 2020. Missed calls, Automated Calls and Health Support: Using AI to improve maternal health outcomes by increasing program engagement. (2020). arXiv:2006.07590",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of oppression: How search engines reinforce racism. nyu Press.",
      "doi": ""
    },
    {
      "text": "Erick Oduor, Timothy Nyota, Charles Wachira, Sam Osebe, Sekou L. Remy, and Aisha Walcott. 2018. Medication Management Companion (MMC) for a Rural Kenyan Community. In Companion of the 2018 ACM Conference on Computer Supported Cooperative Work and Social Computing(Jersey City, NJ, USA) (CSCW ’18). ACM, New York, NY, USA, 145–148. https://doi.org/10.1145/3272973.3274041",
      "doi": "10.1145/3272973.3274041"
    },
    {
      "text": "Fabian Okeke, Lucas Nene, Anne Muthee, Stephen Odindo, Dianna Kane, Isaac Holeman, and Nicola Dell. 2019. Opportunities and challenges in connecting care recipients to the community health feedback loop. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. ACM, ACM, New York, NY, USA, 13.",
      "doi": "10.1145/3287098.3287111"
    },
    {
      "text": "Olugbenga Oluwagbemi and Abdulwahab Jatto. 2019. Implementation of a TCM-based computational health informatics diagnostic tool for Sub-Saharan African students. Informatics in Medicine Unlocked 14 (2019), 43–58.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal. 2017. The fallacy of good: marginalized populations as design motivation. interactions 24, 5 (2017), 65–67.",
      "doi": "10.1145/3121393"
    },
    {
      "text": "Joyojeet Pal, Anjuli Dasika, Ahmad Hasan, Jackie Wolf, Nick Reid, Vaishnav Kameswaran, Purva Yardi, Allyson Mackay, Abram Wagner, Bhramar Mukherjee, 2017. Changing data practices for community health workers: Introducing digital data collection in West Bengal, India. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development. ACM, ACM, New York, NY, USA, 17.",
      "doi": "10.1145/3136560.3136582"
    },
    {
      "text": "Ankur Pandey, Inshita Mutreja, Saru Brar, and Pushpendra Singh. 2020. Exploring Automated Q&A Support System for Maternal and Child Health in Rural India. In Proceedings of the 3rd ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, New York, NY, USA, 349–350.",
      "doi": "10.1145/3378393.3402281"
    },
    {
      "text": "Tapan Parikh. 2019. Much AI About Nothing. Medium. https://medium.com/@tap2k/much-ai-about-nothing-7939db48aecf",
      "doi": ""
    },
    {
      "text": "Sun Young Park, Pei-Yi Kuo, Andrea Barbarin, Elizabeth Kaziunas, Astrid Chow, Karandeep Singh, Lauren Wilcox, and Walter S Lasecki. 2019. Identifying Challenges and Opportunities in Human-AI Collaboration in Healthcare. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing. ACM, New York, NY, USA, 506–510.",
      "doi": ""
    },
    {
      "text": "Nassim Parvin and Anne Pollock. 2020. Unintended by Design: On the Political Uses of “Unintended Consequences”. Engaging Science, Technology, and Society 6 (2020), 320–327.",
      "doi": ""
    },
    {
      "text": "Robert H Paul, Kyu S Cho, Andrew C Belden, Claude A Mellins, Kathleen M Malee, Reuben N Robbins, Lauren E Salminen, Stephen J Kerr, Badri Adhikari, Paola M Garcia-Egan, 2020. Machine-learning classification of neurocognitive performance in children with perinatal HIV initiating de novo antiretroviral therapy. Aids 34, 5 (2020), 737–748.",
      "doi": ""
    },
    {
      "text": "Sachin R Pendse, Faisal M Lalani, Munmun De Choudhury, Amit Sharma, and Neha Kumar. 2020. ” Like Shock Absorbers”: Understanding the Human Infrastructures of Technology-Mediated Mental Health Support. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376465"
    },
    {
      "text": "Trevor Perrier, Nicola Dell, Brian DeRenzi, Richard Anderson, John Kinuthia, Jennifer Unger, and Grace John-Stewart. 2015. Engaging Pregnant Women in Kenya with a Hybrid Computer-Human SMS Communication System. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 1429–1438.",
      "doi": "10.1145/2702123.2702124"
    },
    {
      "text": "Trevor Perrier, Elizabeth K Harrington, Keshet Ronen, Daniel Matemo, John Kinuthia, Grace John-Stewart, Richard Anderson, and Jennifer A Unger. 2018. Male partner engagement in family planning SMS conversations at Kenyan health clinics. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. ACM, New York, NY, USA, 3.",
      "doi": "10.1145/3209811.3209857"
    },
    {
      "text": "Paz Peña and Joana Varon. 2019. Decolonising AI: A transfeminist approach to data and social justice. https://www.codingrights.org/decolonising-ai-a-transfeminist-approach-to-data-and-social-justice/",
      "doi": ""
    },
    {
      "text": "Qure.ai. 2020. Qure.ai bags industry’s first 4-in-1 FDA clearance for medical imaging AI. https://qure.ai/news/2020/06/30/qure-dot-ai-bags-industrys-first-4-in-1-fda-clearance-for-medical-imaging-ai.html",
      "doi": ""
    },
    {
      "text": "Vivek Raghavan, Sanjay Jain, and Pramod Varma. 2019. India stack—digital infrastructure as public good. Commun. ACM 62, 11 (2019), 76–81.",
      "doi": "10.1145/3355625"
    },
    {
      "text": "Md Moshiur Rahman, Ruhul Amin, Md Nazmul Khan Liton, and Nahid Hossain. 2019. Disha: An Implementation of Machine Learning Based Bangla Healthcare Chatbot. In 2019 22nd International Conference on Computer and Information Technology (ICCIT). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Md Z Rahman, Leonid Roytman, Abdelhamid Kadik, and Dilara A Rosy. 2014. Environmental data analysis and remote sensing for early detection of dengue and malaria. In Sensing Technologies for Global Health, Military Medicine, and Environmental Monitoring IV, Vol. 9112. International Society for Optics and Photonics, 91121C.",
      "doi": ""
    },
    {
      "text": "Divya Ramachandran, John Canny, Prabhu Dutta Das, and Edward Cutrell. 2010. Mobile-izing health workers in rural India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 1889–1898.",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Nimmi Rangaswamy and Melissa Densmore. 2013. Understanding Jugaad: ICTD and the Tensions of Appropriation, Innovation and Utility. In Proceedings of the Sixth International Conference on Information and Communications Technologies and Development: Notes - Volume 2(ICTD ’13). ACM, New York, NY, USA, 120–123. event-place: Cape Town, South Africa.",
      "doi": "10.1145/2517899.2517938"
    },
    {
      "text": "Jawad Rasheed, Akhtar Jamil, Alaa Ali Hameed, Usman Aftab, Javaria Aftab, Syed Attique Shah, and Dirk Draheim. 2020. A survey on artificial intelligence approaches in supporting frontline workers and decision makers for COVID-19 pandemic. Chaos, Solitons & Fractals(2020), 110337.",
      "doi": ""
    },
    {
      "text": "IBM Research. 2018. IBM Science for Social Good. https://www.research.ibm.com/science-for-social-good/",
      "doi": ""
    },
    {
      "text": "Microsoft Research. 2019. MSR India Center for Societal impact through Cloud and Artificial Intelligence (SCAI). https://www.microsoft.com/en-us/research/theme/scai/",
      "doi": ""
    },
    {
      "text": "Katelyn J. Rittenhouse, Bellington Vwalika, Alexander Keil, Jennifer Winston, Marie Stoner, Joan T. Price, Monica Kapasa, Mulaya Mubambe, Vanilla Banda, Whyson Muunga, and Jeffrey S. A. Stringer. 2019. Improving preterm newborn identification in low-resource settings with machine learning. PLOS ONE 14, 2 (Feb. 2019), e0198919. https://doi.org/10.1371/journal.pone.0198919",
      "doi": ""
    },
    {
      "text": "Eugenia Arrieta Rodríguez, Francisco Edna Estrada, William Caicedo Torres, and Juan Carlos Martínez Santos. 2016. Early prediction of severe maternal morbidity using machine learning techniques. In Ibero-American Conference on Artificial Intelligence. Springer, 259–270.",
      "doi": ""
    },
    {
      "text": "Srirupa Roy. 2014. Being the change: The Aam Aadmi Party and the politics of the extraordinary in Indian democracy. Economic and Political Weekly(2014), 45–54.",
      "doi": ""
    },
    {
      "text": "Shalini Rudra, Aakshi Kalra, Abhishek Kumar, and William Joe. 2017. Utilization of alternative systems of medicine as health care services in India: evidence on AYUSH care from NSS 2014. PloS one 12, 5 (2017), e0176916.",
      "doi": ""
    },
    {
      "text": "Wolfgang Sachs. 1997. Development dictionary, The: A guide to knowledge as power. Orient Blackswan.",
      "doi": ""
    },
    {
      "text": "Mazrura Sahani and Zainudin Mohd Ali. 2017. Feature selection algorithms for Malaysian dengue outbreak detection model. Sains Malaysiana 46, 2 (2017), 255–265.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan. 2019. The Remarkable Illusions of Technology for Social Good. Interactions 26, 3 (April 2019), 64–66. https://doi.org/10.1145/3319378",
      "doi": "10.1145/3319378"
    },
    {
      "text": "Nithya Sambasivan, Amna Batool, Nova Ahmed, Tara Matthews, Kurt Thomas, Laura Sanely Gaytán-Lugo, David Nemer, Elie Bursztein, Elizabeth Churchill, and Sunny Consolvo. 2019. ” They Don’t Leave Us Alone Anywhere We Go”: Gender and Digital Abuse in South Asia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 2.",
      "doi": "10.1145/3290605.3300232"
    },
    {
      "text": "Nithya Sambasivan and Jess Holbrook. 2019. Toward responsible AI for the next billion users.interactions 26, 1 (2019), 68–71.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan and Thomas Smyth. 2010. The Human Infrastructure of ICTD. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development(London, United Kingdom) (ICTD ’10). ACM, New York, NY, USA, Article 40, 9 pages.",
      "doi": "10.1145/2369220.2369258"
    },
    {
      "text": "Ari Schlesinger, W Keith Edwards, and Rebecca E Grinter. 2017. Intersectional HCI: Engaging identity through gender, race, and class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 5412–5427.",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Kaushik Kunal Singh and Sachin Saagar Singh. 2019. An Artificial Intelligence based mobile solution for early detection of valvular heart diseases. In 2019 IEEE International Conference on Electronics, Computing and Communication Technologies (CONECCT). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Namrata Singh, Pradeep Singh, and Deepika Bhagat. 2019. A rule extraction approach from support vector machines for diagnosing hypertension among diabetics. Expert Systems with Applications 130 (2019), 188–205.",
      "doi": "10.1016/j.eswa.2019.04.029"
    },
    {
      "text": "Ranjit Singh and Steven J. Jackson. 2017. From Margins to Seams: Imbrication, Inclusion, and Torque in the Aadhaar Identification Project. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 4776–4824. https://doi.org/10.1145/3025453.3025910",
      "doi": "10.1145/3025453.3025910"
    },
    {
      "text": "Tanupriya Singh. 2018. India’s ASHA community health workers protest for wage hike and better working conditions. https://peoplesdispatch.org/2018/12/17/indias-asha-community-health-workers-protest-for-wage-hike-and-better-working-conditions/",
      "doi": ""
    },
    {
      "text": "Thomas N Smyth, Satish Kumar, Indrani Medhi, and Kentaro Toyama. 2010. Where there’s a will there’s a way: mobile media sharing in urban india. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 753–762.",
      "doi": "10.1145/1753326.1753436"
    },
    {
      "text": "Arjun Soin. 2020. Blog: Delhi’s Mohalla Clinics - The Big Data Opportunity. https://www.ndtv.com/blog/delhis-mohalla-clinics-the-big-data-opportunity-2160026",
      "doi": ""
    },
    {
      "text": "Dr. James Somauroo. 2019. Ada Health Launches World’s First AI-Powered Health App In Swahili. https://www.forbes.com/sites/jamessomauroo/2019/12/02/ada-health-launches-worlds-first-ai-powered-health-app-in-swahili/",
      "doi": ""
    },
    {
      "text": "Alcinês da Silva Sousa Júnior, Vera Regina da Cunha Menezes Palácios, Claúdia do Socorro Miranda, Rodrigo Junior Farias da Costa, Clistenes Pamplona Catete, Eugenia Janis Chagasteles, Alba Lucia Ribeiro Raithy Pereira, and Nelson Veiga Gonçalves. 2017. Space-temporal analysis of Chagas disease and its environmental and demographic risk factors in the municipality of Barcarena, Pará, Brazil. Revista Brasileira de Epidemiologia 20 (2017), 742–755.",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Christopher Frauenberger, Os Keyes, and Geraldine Fitzpatrick. 2019. Agency of autistic children in technology research—A critical literature review. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 6(2019), 1–40.",
      "doi": "10.1145/3344919"
    },
    {
      "text": "Janaki Srinivasan and Jenna Burrell. 2013. Revisiting the Fishers of Kerala, India. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1 (Cape Town, South Africa) (ICTD ’13). ACM, New York, NY, USA, 56–66. https://doi.org/10.1145/2516604.2516618",
      "doi": ""
    },
    {
      "text": "Emma Strubell, Ananya Ganesh, and Andrew McCallum. 2019. Energy and policy considerations for deep learning in NLP. (2019). arXiv:1906.02243",
      "doi": ""
    },
    {
      "text": "BK Subramanian, S Kaulgud, V R Joshi, Girish Godbole, and Madhavi Bahulikar. 2018. Comparative study to determine the reliability and accuracy of the fetal lite electronic fetal monitor when compared with conventional cardiotocography. In 2018 10th International Conference on Communication Systems & Networks (COMSNETS). IEEE, 671–676.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1995. Making work visible. Commun. ACM 38, 9 (1995), 56–64.",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Mariarosaria Taddeo and Luciano Floridi. 2018. How AI can be a force for good. Science 361, 6404 (2018), 751–752.",
      "doi": ""
    },
    {
      "text": "Alex Taylor, Daniela Rosner, and Mikael Wiberg. 2020. AI Activism. Interactions 28, 1 (Dec. 2020), 5. https://doi.org/10.1145/3442368",
      "doi": ""
    },
    {
      "text": "Linnet Taylor. 2017. What is data justice? The case for connecting digital rights and freedoms globally. Big Data & Society 4, 2 (2017), 2053951717736335.",
      "doi": ""
    },
    {
      "text": "Facebook Technology. 2019. Using AI to help increase blood donations. https://tech.fb.com/using-ai-to-help-increase-blood-donations/",
      "doi": ""
    },
    {
      "text": "Kenneth Thomsen, Lars Iversen, Therese Louise Titlestad, and Ole Winther. 2020. Systematic review of machine learning for diagnosis and prognosis in dermatology. Journal of Dermatological Treatment 31, 5 (2020), 496–510.",
      "doi": ""
    },
    {
      "text": "Daniel Shu Wei Ting, Lawrence Carin, Victor Dzau, and Tien Y Wong. 2020. Digital technology and COVID-19. Nature medicine 26, 4 (2020), 459–461.",
      "doi": ""
    },
    {
      "text": "Sunita Tiwari, Sushil Kumar, and Kalpna Guleria. 2020. Outbreak Trends of Coronavirus Disease–2019 in India: A Prediction. Disaster medicine and public health preparedness (2020), 1–6.",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2015. Geek heresy: Rescuing social change from the cult of technology. PublicAffairs.",
      "doi": ""
    },
    {
      "text": "Raju Vaishya, Mohd Javaid, Ibrahim Haleem Khan, and Abid Haleem. 2020. Artificial Intelligence (AI) applications for COVID-19 pandemic. Diabetes & Metabolic Syndrome: Clinical Research & Reviews (2020).",
      "doi": ""
    },
    {
      "text": "Camilo E Valderrama, Faezeh Marzbanrad, Lisa Stroux, Boris Martinez, Rachel Hall-Clifford, Chengyu Liu, Nasim Katebi, Peter Rohloff, and Gari D Clifford. 2018. Improving the quality of point of care diagnostics with real-time machine learning in low literacy LMIC settings. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. 1–11.",
      "doi": "10.1145/3209811.3209815"
    },
    {
      "text": "Thomas LA van den Heuvel, Hezkiel Petros, Stefano Santini, Chris L de Korte, and Bram van Ginneken. 2019. Automated fetal head detection and circumference estimation from free-hand ultrasound sweeps using deep learning in resource-limited countries. Ultrasound in medicine & biology 45, 3 (2019), 773–785.",
      "doi": ""
    },
    {
      "text": "Effy Vayena, Alessandro Blasimme, and I Glenn Cohen. 2018. Machine learning in medicine: Addressing ethical challenges. PLoS medicine 15, 11 (2018), e1002689.",
      "doi": ""
    },
    {
      "text": "Edward Velasco, Tumacha Agheneza, Kerstin Denecke, Goeran Kirchner, and Tim Eckmanns. 2014. Social media and internet-based data in global systems for public health surveillance: a systematic review. The Milbank Quarterly 92, 1 (2014), 7–33.",
      "doi": ""
    },
    {
      "text": "Ricardo Vinuesa, Hossein Azizpour, Iolanda Leite, Madeline Balaam, Virginia Dignum, Sami Domisch, Anna Felländer, Simone Daniela Langhans, Max Tegmark, and Francesco Fuso Nerini. 2020. The role of artificial intelligence in achieving the Sustainable Development Goals. Nature communications 11, 1 (2020), 1–10.",
      "doi": ""
    },
    {
      "text": "Brian Wahl, Aline Cossy-Gantner, Stefan Germann, and Nina R Schwalbe. 2018. Artificial intelligence (AI) and global health: how can AI contribute to health in resource-poor settings?BMJ global health 3, 4 (2018), e000798.",
      "doi": ""
    },
    {
      "text": "Paul Wallace. 2015. India’s 2014 Elections: A Modi-led BJP Sweep. SAGE Publications India.",
      "doi": ""
    },
    {
      "text": "Yongming Wang and Junzhong Gu. 2014. Comparative study among three different artificial neural networks to infectious diarrhea forecasting. In 2014 IEEE International Conference on Bioinformatics and Biomedicine (BIBM). IEEE, 40–46.",
      "doi": ""
    },
    {
      "text": "Wudi Wei, Junjun Jiang, Hao Liang, Lian Gao, Bingyu Liang, Jiegang Huang, Ning Zang, Yanyan Liao, Jun Yu, Jingzhen Lai, 2016. Application of a combined model with autoregressive integrated moving average (ARIMA) and generalized regression neural network (GRNN) in forecasting hepatitis incidence in Heng County, China. PloS one 11, 6 (2016), e0156768.",
      "doi": ""
    },
    {
      "text": "Nicole Wetsman. 2019. Artificial intelligence aims to improve cancer screenings in Kenya. Nature Medicine 25, 11 (Nov. 2019), 1630–1631. https://doi.org/10.1038/s41591-019-0629-6",
      "doi": ""
    },
    {
      "text": "Caroline Whidden, Kassoum Kayentao, Jenny X Liu, Scott Lee, Youssouf Keita, Djoumé Diakité, Alexander Keita, Samba Diarra, Jacqueline Edwards, Amanda Yembrick, 2018. Improving Community Health Worker performance by using a personalised feedback dashboard for supervision: a randomised controlled trial. Journal of global health 8, 2 (2018).",
      "doi": ""
    },
    {
      "text": "Zack Whittaker. 2019. Indian state government leaks thousands of Aadhaar numbers. https://techcrunch.com/2019/01/31/aadhaar-data-leak/?guccounter=1",
      "doi": ""
    },
    {
      "text": "Haoran Xie, Hui-Chun Chu, Gwo-Jen Hwang, and Chun-Chieh Wang. 2019. Trends and development in technology-enhanced adaptive/personalized learning: A systematic review of journal publications from 2007 to 2017. Computers & Education 140 (2019), 103599.",
      "doi": "10.1016/j.compedu.2019.103599"
    },
    {
      "text": "Deepika Yadav, Anushka Bhandari, and Pushpendra Singh. 2019. LEAP: Scaffolding Collaborative Learning of Community Health Workers in India. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27.",
      "doi": "10.1145/3359271"
    },
    {
      "text": "Deepika Yadav, Prerna Malik, Kirti Dabas, and Pushpendra Singh. 2019. Feedpal: Understanding Opportunities for Chatbots in Breastfeeding Education of Women in India. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 170.",
      "doi": "10.1145/3359272"
    },
    {
      "text": "Deepika Yadav, Pushpendra Singh, Kyle Montague, Vijay Kumar, Deepak Sood, Madeline Balaam, Drishti Sharma, Mona Duggal, Tom Bartindale, Delvin Varghese, and Patrick Olivier. 2017. Sangoshthi: Empowering Community Health Workers Through Peer Learning in Rural India. In Proceedings of the 26th International Conference on World Wide Web (Perth, Australia) (WWW ’17). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 499–508.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Aaron Steinfeld, and John Zimmerman. 2019. Unremarkable ai: Fitting intelligent decision support into critical, clinical decision-making processes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300468"
    },
    {
      "text": "Zifeng Yang, Zhiqi Zeng, Ke Wang, Sook-San Wong, Wenhua Liang, Mark Zanin, Peng Liu, Xudong Cao, Zhongqiang Gao, Zhitong Mai, 2020. Modified SEIR and AI prediction of the epidemics trend of COVID-19 in China under public health interventions. Journal of Thoracic Disease 12, 3 (2020), 165.",
      "doi": ""
    },
    {
      "text": "Fenghua Yu, Mitchell Thayer, Ehsan Qasemi, Kaixi Zhu, and Amir Assadi. 2017. Deep Learning Features in Atmospheric Chemistry: Prediction of Cancer Morbidity Due to Air Pollution. In 2017 International Conference on Computational Science and Computational Intelligence (CSCI). IEEE, 1764–1766.",
      "doi": ""
    },
    {
      "text": "Nira Yuval-Davis. 2006. Intersectionality and feminist politics. European journal of women’s studies 13, 3 (2006), 193–209.",
      "doi": ""
    },
    {
      "text": "Yan Zhang, Jun Wu, Chen Xu, and Ming Zhou. 2019. Intelligent Service System Design of Food Therapy Experience into Chronic Disease. In International Conference on Human-Computer Interaction. Springer, 382–392.",
      "doi": "10.1007/978-3-030-23538-3_30"
    },
    {
      "text": "Shoshana Zuboff. 2019. The age of surveillance capitalism: The fight for a human future at the new frontier of power. Profile Books.",
      "doi": ""
    }
  ]
}