{
  "doi": "10.1145/3411764.3445532",
  "title": "Scene-Aware Behavior Synthesis for Virtual Pets in Mixed Reality",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Virtual pets are an alternative to real pets, providing a substitute for people with allergies or preparing people for adopting a real pet. Recent advancements in mixed reality pave the way for virtual pets to provide a more natural and seamless experience for users. However, one key challenge is embedding environmental awareness into the virtual pet (e.g., identifying the food bowl’s location) so that they can behave naturally in the real world.  We propose a novel approach to synthesize virtual pet behaviors by considering scene semantics, enabling a virtual pet to behave naturally in mixed reality. Given a scene captured from the real world, our approach synthesizes a sequence of pet behaviors (e.g., resting after eating). Then, we assign each behavior in the sequence to a location in the real scene. We conducted user studies to evaluate our approach, which showed the efficacy of our approach in synthesizing natural virtual pet behaviors.",
  "tags": [
    "Scene Semantics",
    "Virtual Pets",
    "Behavior Synthesis"
  ],
  "authors": [
    {
      "name": "Wei Liang",
      "institution": "School of Computer Science Beijing Institute of Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459335757",
      "orcid": "missing"
    },
    {
      "name": "Xinzhe Yu",
      "institution": "Beijing Institute of Technology, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700992",
      "orcid": "missing"
    },
    {
      "name": "Rawan Alghofaili",
      "institution": "George Mason University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365325",
      "orcid": "missing"
    },
    {
      "name": "Yining Lang",
      "institution": "Alibaba Group, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659585343",
      "orcid": "missing"
    },
    {
      "name": "Lap-Fai Yu",
      "institution": "Computer Science George Mason University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81487650310",
      "orcid": "0000-0002-2656-5654"
    }
  ],
  "references": [
    {
      "text": "Sun Joo Ahn, Kyle Johnsen, Tom Robertson, James Moore, Scott Brown, Amanda Marable, and Aryabrata Basu. 2015. Using virtual pets to promote physical activity in children: An application of the youth physical activity promotion model. Journal of health communication 20, 7 (2015), 807–815.",
      "doi": ""
    },
    {
      "text": "Eric Lewin Altschuler. 1999. Pet-facilitated therapy for posttraumatic stress disorder. Annals of Clinical Psychiatry 11, 1 (1999), 29–30.",
      "doi": ""
    },
    {
      "text": "Shir Amir, Anna Zamansky, and Dirk van der Linden. 2017. K9-Blyzer: Towards video-based automatic analysis of canine behavior. In Proceedings of the Fourth International Conference on Animal-Computer Interaction. 1–5.",
      "doi": "10.1145/3152130.3152142"
    },
    {
      "text": "Ling Bao and Stephen S Intille. 2004. Activity recognition from user-annotated acceleration data. In International conference on pervasive computing. Springer, 1–17.",
      "doi": ""
    },
    {
      "text": "Andrea Beetz, Kerstin Uvnäs-Moberg, Henri Julius, and Kurt Kotrschal. 2012. Psychosocial and psychophysiological effects of human-animal interactions: the possible role of oxytocin. Frontiers in psychology 3 (2012), 234.",
      "doi": ""
    },
    {
      "text": "Linda P Case 2003. The cat: its behavior, nutrition & health.Iowa State Press.",
      "doi": ""
    },
    {
      "text": "Zhi-Hong Chen, Calvin Liao, Tzu-Chao Chien, and Tak-Wai Chan. 2011. Animal companions: Fostering children’s effort-making by nurturing virtual pets. British Journal of Educational Technology 42, 1 (2011), 166–180.",
      "doi": ""
    },
    {
      "text": "Thomas Chesney and Shaun Lawson. 2007. The illusion of love: Does a virtual pet provide the same companionship as a real one?Interaction Studies 8, 2 (2007), 337–342.",
      "doi": ""
    },
    {
      "text": "Junyoung Chung, Caglar Gulcehre, KyungHyun Cho, and Yoshua Bengio. 2014. Empirical evaluation of gated recurrent neural networks on sequence modeling. (2014). arxiv:1412.3555",
      "doi": ""
    },
    {
      "text": "Shi-Gang Cui, Hui Wang, and Li Yang. 2012. A simulation study of A-star algorithm for robot path planning. In 16th international conference on mechatronics technology. 506–510.",
      "doi": ""
    },
    {
      "text": "Hayley Cutt, Billie Giles-Corti, Matthew Knuiman, Anna Timperio, and Fiona Bull. 2008. Understanding dog owners’ increased levels of physical activity: results from RESIDE. American journal of public health 98, 1 (2008), 66–69.",
      "doi": ""
    },
    {
      "text": "Ruta Desai, Fraser Anderson, Justin Matejka, Stelian Coros, James McCann, George Fitzmaurice, and Tovi Grossman. 2019. Geppetto: Enabling Semantic Design of Expressive Robot Behaviors. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300599"
    },
    {
      "text": "Rodrigo Dias and Carlos Martinho. 2011. Adapting content presentation and control to player personality in videogames. In Proceedings of the 8th International Conference on Advances in Computer Entertainment Technology. 1–8.",
      "doi": "10.1145/2071423.2071446"
    },
    {
      "text": "Tawanna Dillahunt, Geof Becker, Jennifer Mankoff, and Robert Kraut. 2008. Motivating environmentally sustainable behavior changes with a virtual polar bear. In Pervasive 2008 Workshop Proceedings, Vol. 8. 58–62.",
      "doi": ""
    },
    {
      "text": "Eric Dybsand. 2001. A Generic Fuzzy State. Game Programming Gems 2(2001), 337.",
      "doi": ""
    },
    {
      "text": "ENIX. 2017. DragonQuest XI. https://dragonquest.square-enix-games.com/tact/en-us/..",
      "doi": ""
    },
    {
      "text": "Dumitru Erhan, Christian Szegedy, Alexander Toshev, and Dragomir Anguelov. 2014. Scalable object detection using deep neural networks. In Proceedings of the IEEE conference on computer vision and pattern recognition. 2147–2154.",
      "doi": "10.1109/CVPR.2014.276"
    },
    {
      "text": "Mark Everingham, Luc Van Gool, Christopher KI Williams, John Winn, and Andrew Zisserman. 2010. The pascal visual object classes (voc) challenge. International journal of computer vision 88, 2 (2010), 303–338.",
      "doi": "10.1007/s11263-009-0275-4"
    },
    {
      "text": "Iram Fatima, Muhammad Fahim, Young-Koo Lee, and Sungyoung Lee. 2013. A unified framework for activity recognition-based behavior analysis and action prediction in smart homes. Sensors 13, 2 (2013), 2682–2699.",
      "doi": ""
    },
    {
      "text": "Michael Georgeff, Barney Pell, Martha Pollack, Milind Tambe, and Michael Wooldridge. 1998. The belief-desire-intention model of agency. In International workshop on agent theories, architectures, and languages. Springer, 1–10.",
      "doi": ""
    },
    {
      "text": "Andrew Gilbey, June McNicholas, and Glyn M Collis. 2007. A longitudinal test of the belief that companion animal ownership can help reduce loneliness. Anthrozoös 20, 4 (2007), 345–353.",
      "doi": ""
    },
    {
      "text": "Ross Girshick. 2015. Fast r-cnn. In Proceedings of the IEEE international conference on computer vision. 1440–1448.",
      "doi": "10.1109/ICCV.2015.169"
    },
    {
      "text": "Alex Graves. 2013. Generating sequences with recurrent neural networks. (2013). arxiv:1308.0850",
      "doi": ""
    },
    {
      "text": "Juho Hamari, David J Shernoff, Elizabeth Rowe, Brianno Coller, Jodi Asbell-Clarke, and Teon Edwards. 2016. Challenging games help students learn: An empirical study on engagement, flow and immersion in game-based learning. Computers in human behavior 54 (2016), 170–179.",
      "doi": ""
    },
    {
      "text": "Peter E Hart, Nils J Nilsson, and Bertram Raphael. 1968. A formal basis for the heuristic determination of minimum cost paths. IEEE transactions on Systems Science and Cybernetics 4, 2(1968), 100–107.",
      "doi": ""
    },
    {
      "text": "Kaiming He, Georgia Gkioxari, Piotr Dollár, and Ross Girshick. 2017. Mask r-cnn. In Proceedings of the IEEE international conference on computer vision. 2961–2969.",
      "doi": ""
    },
    {
      "text": "Sepp Hochreiter and Jürgen Schmidhuber. 1997. Long short-term memory. Neural computation 9, 8 (1997), 1735–1780.",
      "doi": "10.1162/neco.1997.9.8.1735"
    },
    {
      "text": "Daniel Holden, Jun Saito, and Taku Komura. 2016. A deep learning framework for character motion synthesis and editing. ACM Transactions on Graphics (TOG) 35, 4 (2016), 138.",
      "doi": "10.1145/2897824.2925975"
    },
    {
      "text": "Youichi Horry, Ken-Ichi Anjyo, and Kiyoshi Arai. 1997. Tour into the picture: using a spidery mesh interface to make animation from a single image. (1997).",
      "doi": ""
    },
    {
      "text": "Kyle Johnsen, Sun Joo Ahn, James Moore, Scott Brown, Thomas P Robertson, Amanda Marable, and Aryabrata Basu. 2014. Mixed reality virtual pets to reduce childhood obesity. IEEE transactions on visualization and computer graphics 20, 4(2014), 523–530.",
      "doi": "10.1109/TVCG.2014.33"
    },
    {
      "text": "Malte F Jung. 2017. Affective grounding in human-robot interaction. In 2017 12th ACM/IEEE International Conference on Human-Robot Interaction (HRI. IEEE, 263–273.",
      "doi": "10.1145/2909824.3020224"
    },
    {
      "text": "Andrej Karpathy, Armand Joulin, and Li F Fei-Fei. 2014. Deep fragment embeddings for bidirectional image sentence mapping. In Advances in neural information processing systems. 1889–1897.",
      "doi": ""
    },
    {
      "text": "David W Kritt. 2000. Loving a virtual pet: Steps toward the technological erosion of emotion. The Journal of American Culture 23, 4 (2000), 81.",
      "doi": ""
    },
    {
      "text": "Vining Lang, Wei Liang, and Lap-Fai Yu. 2019. Virtual agent positioning driven by scene semantics in mixed reality. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 767–775.",
      "doi": ""
    },
    {
      "text": "Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and evaluation of a user experience questionnaire. In Symposium of the Austrian HCI and usability engineering group. Springer, 63–76.",
      "doi": "10.1007/978-3-540-89350-9_6"
    },
    {
      "text": "Ana Lilia Laureano-Cruces and Arturo Rodriguez-Garcia. 2012. Design and implementation of an educational virtual pet using the OCC theory. Journal of Ambient Intelligence and Humanized Computing 3, 1 (2012), 61–71.",
      "doi": ""
    },
    {
      "text": "S Lawson and Thomas Chesney. 2007. The impact of owner age on companionship with virtual pets. Eighth International Conference on Information Visualisation (2007).",
      "doi": ""
    },
    {
      "text": "Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C Lawrence Zitnick. 2014. Microsoft coco: Common objects in context. In European conference on computer vision. Springer, 740–755.",
      "doi": ""
    },
    {
      "text": "Li Liu, Wanli Ouyang, Xiaogang Wang, Paul Fieguth, Jie Chen, Xinwang Liu, and Matti Pietikäinen. 2018. Deep learning for generic object detection: A survey. (2018). arxiv:1809.02165",
      "doi": ""
    },
    {
      "text": "Christopher D Manning, Mihai Surdeanu, John Bauer, Jenny Rose Finkel, Steven Bethard, and David McClosky. 2014. The Stanford CoreNLP natural language processing toolkit. In Proceedings of 52nd annual meeting of the association for computational linguistics: system demonstrations. 55–60.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2015. HoloPet. https://www.windowscentral.com/microsoft-registers-holopet-trademark-augmented-reality-kittens-all.",
      "doi": ""
    },
    {
      "text": "[42] Neopets.2003. http://neopets.com..",
      "doi": ""
    },
    {
      "text": "NeuroHive. 2019. Pets ARound - Virtual Friend. https://appadvice.com/app/pets-around-virtual-friend/1441956434.",
      "doi": ""
    },
    {
      "text": "Nahal Norouzi, Kangsoo Kim, Myungho Lee, Ryan Schubert, Austin Erickson, Jeremy Bailenson, Gerd Bruder, and Greg Welch. 2019. Walking your virtual dog: Analysis of awareness and proxemics with simulated support animals in augmented reality. In 2019 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 157–168.",
      "doi": ""
    },
    {
      "text": "Nuria Oliver, Ashutosh Garg, and Eric Horvitz. 2004. Layered representations for learning and inferring office activity from multiple sensory channels. Computer Vision and Image Understanding 96, 2 (2004), 163–180.",
      "doi": "10.1016/j.cviu.2004.02.004"
    },
    {
      "text": "Fco Javier Ordóñez, José Antonio Iglesias, Paula De Toledo, Agapito Ledezma, and Araceli Sanchis. 2013. Online activity recognition using evolving classifiers. Expert Systems with Applications 40, 4 (2013), 1248–1255.",
      "doi": "10.1016/j.eswa.2012.08.066"
    },
    {
      "text": "Heather L O’Brien, Paul Cairns, and Mark Hall. 2018. A practical approach to measuring user engagement with the refined user engagement scale (UES) and new UES short form. International Journal of Human-Computer Studies 112 (2018), 28–39.",
      "doi": ""
    },
    {
      "text": "Xue Bin Peng, Pieter Abbeel, Sergey Levine, and Michiel van de Panne. 2018. Deepmimic: Example-guided deep reinforcement learning of physics-based character skills. ACM Transactions on Graphics (TOG) 37, 4 (2018), 143.",
      "doi": "10.1145/3197517.3201311"
    },
    {
      "text": "Patricia Pons and Javier Jaen. 2016. Towards the Creation of Interspecies Digital Games: An Observational Study on Cats’ Interest in Interactive Technologies. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1737–1743.",
      "doi": "10.1145/2851581.2892381"
    },
    {
      "text": "Patricia Pons, Javier Jaen, and Alejandro Catala. 2017. Assessing machine learning classifiers for the detection of animals’ behavior using depth-based tracking. Expert Systems with Applications 86 (2017), 235–246.",
      "doi": ""
    },
    {
      "text": "Thomas S Ray. 2001. Aesthetically evolved virtual pets. Leonardo 34, 4 (2001), 313–316.",
      "doi": ""
    },
    {
      "text": "Shaoqing Ren, Kaiming He, Ross Girshick, and Jian Sun. 2015. Faster r-cnn: Towards real-time object detection with region proposal networks. In Advances in neural information processing systems. 91–99.",
      "doi": ""
    },
    {
      "text": "Olga Russakovsky, Jia Deng, Hao Su, Jonathan Krause, Sanjeev Satheesh, Sean Ma, Zhiheng Huang, Andrej Karpathy, Aditya Khosla, Michael Bernstein, 2015. Imagenet large scale visual recognition challenge. International journal of computer vision 115, 3 (2015), 211–252.",
      "doi": "10.1007/s11263-015-0816-y"
    },
    {
      "text": "Sana-malik. 2014. Cat Location Dataset. Github.",
      "doi": ""
    },
    {
      "text": "Pierre Sermanet, David Eigen, Xiang Zhang, Michaël Mathieu, Rob Fergus, and Yann LeCun. 2013. Overfeat: Integrated recognition, localization and detection using convolutional networks. (2013). arxiv:1312.6229",
      "doi": ""
    },
    {
      "text": "Sichao Song and Seiji Yamada. 2017. Expressing emotions through color, sound, and vibration with an appearance-constrained social robot. In 2017 12th ACM/IEEE International Conference on Human-Robot Interaction (HRI. IEEE, 2–11.",
      "doi": "10.1145/2909824.3020239"
    },
    {
      "text": "Playrock Studios. 2018. Wildlife AR. https://play.google.com/store/apps/dev?id=8981397870093114957.",
      "doi": ""
    },
    {
      "text": "Ilya Sutskever, James Martens, and Geoffrey E Hinton. 2011. Generating text with recurrent neural networks. In Proceedings of the 28th International Conference on Machine Learning (ICML-11). 1017–1024.",
      "doi": "10.5555/3104482.3104610"
    },
    {
      "text": "Christian Szegedy, Alexander Toshev, and Dumitru Erhan. 2013. Deep neural networks for object detection. In Advances in neural information processing systems. 2553–2561.",
      "doi": ""
    },
    {
      "text": "Tim Van Kasteren, Athanasios Noulas, Gwenn Englebienne, and Ben Kröse. 2008. Accurate activity recognition in a home setting. In Proceedings of the 10th international conference on Ubiquitous computing. ACM, 1–9.",
      "doi": "10.1145/1409635.1409637"
    },
    {
      "text": "Ferdinand Wagner, Ruedi Schmuki, Thomas Wagner, and Peter Wolstenholme. 2006. Modeling software with finite state machines: a practical approach. CRC Press.",
      "doi": ""
    },
    {
      "text": "Hao Wang and Jing Liu. 2009. Mobile phone based health care technology. Recent Patents on Biomedical Engineering 2, 1 (2009), 15–21.",
      "doi": ""
    },
    {
      "text": "SHI Xingjian, Zhourong Chen, Hao Wang, Dit-Yan Yeung, Wai-Kin Wong, and Wang-chun Woo. 2015. Convolutional LSTM network: A machine learning approach for precipitation nowcasting. In Advances in neural information processing systems. 802–810.",
      "doi": ""
    },
    {
      "text": "Chloe Shu-Hua Yeh. 2015. Exploring the effects of videogame play on creativity performance and emotional responses. Computers in Human Behavior 53 (2015), 396–407.",
      "doi": "10.1016/j.chb.2015.07.024"
    },
    {
      "text": "Xin Zhang, Yee-Hong Yang, Zhiguang Han, Hui Wang, and Chao Gao. 2013. Object class detection: A survey. ACM Computing Surveys (CSUR) 46, 1 (2013), 10.",
      "doi": "10.1145/2522968.2522978"
    }
  ]
}