{
  "doi": "10.1145/3411764.3445176",
  "title": "Does Interaction Improve Bayesian Reasoning with Visualization?",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Interaction enables users to navigate large amounts of data effectively, supports cognitive processing, and increases data representation methods. However, there have been few attempts to empirically demonstrate whether adding interaction to a static visualization improves its function beyond popular beliefs. In this paper, we address this gap. We use a classic Bayesian reasoning task as a testbed for evaluating whether allowing users to interact with a static visualization can improve their reasoning. Through two crowdsourced studies, we show that adding interaction to a static Bayesian reasoning visualization does not improve participants’ accuracy on a Bayesian reasoning task. In some cases, it can significantly detract from it. Moreover, we demonstrate that underlying visualization design modulates performance and that people with high versus low spatial ability respond differently to different interaction techniques and underlying base visualizations. Our work suggests that interaction is not as unambiguously good as we often believe; a well designed static visualization can be as, if not more, effective than an interactive one.",
  "authors": [
    {
      "name": "Ab Mosca",
      "institution": "Computer Science Tufts University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701567",
      "orcid": "missing"
    },
    {
      "name": "Alvitta Ottley",
      "institution": "Department of Computer Science and Engineering Washington University in St. Louis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550272556",
      "orcid": "0000-0002-9485-276X"
    },
    {
      "name": "Remco Chang",
      "institution": "Computer Science Tufts University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319489175",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Peter Babington. 1967. Semiology of graphics: diagrams, networks, maps.University of Wisconsin Press, Madison, WI, USA. Originally in French: Semiologie Graphique.",
      "doi": ""
    },
    {
      "text": "Katharina Böcherer-Linder and Andreas Eichler. 2019. How to Improve Performance in Bayesian Inference Tasks: A Comparison of Five Visualizations. Frontiers in Psychology 10 (2019), 267. https://doi.org/10.3389/fpsyg.2019.00267",
      "doi": ""
    },
    {
      "text": "Jeremy Boy, Francoise Detienne, and Jean-Daniel Fekete. 2015. Storytelling in Information Visualizations: Does It Engage Users to Explore Data?. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1449–1458. https://doi.org/10.1145/2702123.2702452",
      "doi": "10.1145/2702123.2702452"
    },
    {
      "text": "Gary L. Brase. 2009. Pictorial representations in statistical reasoning. Applied Cognitive Psychology 23, 3 (2009), 369–381. https://doi.org/10.1002/acp.1460",
      "doi": ""
    },
    {
      "text": "E. T. Brown, J. Liu, C. E. Brodley, and R. Chang. 2012. Dis-function: Learning distance functions interactively. In 2012 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, Seattle, WA, 83–92. https://doi.org/10.1109/VAST.2012.6400486",
      "doi": "10.1109/VAST.2012.6400486"
    },
    {
      "text": "S. Carpendale, N. Riche, P. Isenberg, and B. Lee. 2012. Beyond Mouse and Keyboard: Expanding Design Considerations for Information Visualization Interactions. IEEE Transactions on Visualization & Computer Graphics 18, 12 (dec 2012), 2689–2698. https://doi.org/10.1109/TVCG.2012.204",
      "doi": ""
    },
    {
      "text": "W. G. Cole. 1989. Understanding Bayesian Reasoning via Graphical Displays. SIGCHI Bull. 20, SI (March 1989), 381–386. https://doi.org/10.1145/67450.67522",
      "doi": ""
    },
    {
      "text": "William G Cole and Janet E Davidson. 1989. Graphic Representation Can Lead To Fast and Accurate Bayesian Reasoning., 227–231 pages.",
      "doi": ""
    },
    {
      "text": "S. Coren and J.S. Girgus. 1980. Principles of perceptual organization and spatial distortion: The gestalt illusions. Journal of Experimental Psychology: Human Perception and Performance 6(3) (1980), 404 – 412. https://doi.org/10.1037/0096-1523.6.3.404",
      "doi": ""
    },
    {
      "text": "E. Dimara and C. Perin. 2020. What is Interaction for Data Visualization?IEEE Transactions on Visualization and Computer Graphics 26, 1 (Jan 2020), 119–129. https://doi.org/10.1109/TVCG.2019.2934283",
      "doi": ""
    },
    {
      "text": "David M Eddy. 1982. Probabilistic reasoning in clinical medicine: Problems and opportunities.",
      "doi": ""
    },
    {
      "text": "R.B. Ekstrom, J.W. French, H. H. Harman, and D. Dermen. 1976. Manual for kit of factor-referenced cognitive tests.",
      "doi": ""
    },
    {
      "text": "A. Endert, P. Fiaux, and C. North. 2012. Semantic Interaction for Sensemaking: Inferring Analytical Reasoning for Model Steering. IEEE Transactions on Visualization and Computer Graphics 18, 12(2012), 2879–2888.",
      "doi": "10.1109/TVCG.2012.260"
    },
    {
      "text": "Chris Evans and Nicola J Gibbons. 2007. The interactivity effect in multimedia learning. Computers & Education 49, 4 (2007), 1147–1160.",
      "doi": "10.1016/j.compedu.2006.01.008"
    },
    {
      "text": "Hendrik Friederichs, Sandra Ligges, and Anne Weissenstein. 2014. Using Tree Diagrams without Numerical Values in Addition to Relative Numbers Improves Students’ Numeracy Skills: A Randomized Study in Medical Education. Medical Decision Making 34, 2 (2014), 253–257. https://doi.org/10.1177/0272989X13504499PMID: 24085290.",
      "doi": ""
    },
    {
      "text": "Rocio Garcia-Retamero and Ulrich Hoffrage. 2013. Visual representation of statistical information improves diagnostic inferences in doctors and their patients. Social Science & Medicine 83 (2013), 27–33.",
      "doi": ""
    },
    {
      "text": "Gerd Gigerenzer and Ulrich Hoffrage. 1995. How to Improve Bayesian Reasoning Without Instruction: Frequency Formats.",
      "doi": ""
    },
    {
      "text": "Pascal Goffin, Petra Isenberg, Tanja Blascheck, and Wesley Willett. 2020. Interaction Techniques for Visual Exploration Using Embedded Word-Scale Visualizations. https://doi.org/10.1145/3313831.3376842",
      "doi": ""
    },
    {
      "text": "Paul Han, William Klein, Bill Killam, Tom Lehman, and Holly Massett. 2011. Representing randomness in the communication of individualized cancer risk estimates: Effects on cancer risk perceptions, worry, and subjective uncertainty about risk. Patient education and counseling 86 (03 2011), 106–13. https://doi.org/10.1016/j.pec.2011.01.033",
      "doi": ""
    },
    {
      "text": "S. G. Hart. 2006. NASA-Task Load Index (NASA-TLX); 20 years later.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Ben Shneiderman. 2012. Interactive Dynamics for Visual Analysis. Queue 10, 2 (Feb. 2012), 30?55. https://doi.org/10.1145/2133416.2146416",
      "doi": "10.1145/2133416.2146416"
    },
    {
      "text": "Vince Kellen, Susy Chan, and Xiaowen Fang. 2007. Facilitating Conditional Probability Problems with Visuals. In Human-Computer Interaction. Interaction Platforms and Techniques, Julie A. Jacko (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 63–71.",
      "doi": ""
    },
    {
      "text": "Azam Khan, Simon Breslav, Michael Glueck, and Kasper Hornbæk. 2015. Benefits of visualization in the Mammography Problem. International Journal of Human-Computer Studies 83 (2015), 94 – 113. https://doi.org/10.1016/j.ijhcs.2015.07.001",
      "doi": "10.1016/j.ijhcs.2015.07.001"
    },
    {
      "text": "Azam Khan, Simon Breslav, and Kasper Hornbæk. 2018. Interactive Instruction in Bayesian Inference. Human - Computer Interaction 33, 3 (2018), 207–233. https://doi.org/10.1080/07370024.2016.1203264",
      "doi": ""
    },
    {
      "text": "H. Lam. 2008. A Framework of Interaction Costs in Information Visualization. IEEE Transactions on Visualization and Computer Graphics 14, 6 (Nov 2008), 1149–1156. https://doi.org/10.1109/TVCG.2008.109",
      "doi": "10.1109/TVCG.2008.109"
    },
    {
      "text": "B. Lee, P. Isenberg, N. H. Riche, and S. Carpendale. 2012. Beyond Mouse and Keyboard: Expanding Design Considerations for Information Visualization Interactions. IEEE Transactions on Visualization and Computer Graphics 18, 12(2012), 2689–2698.",
      "doi": "10.1109/TVCG.2012.204"
    },
    {
      "text": "Z. Liu and J. Stasko. 2010. Mental Models, Visual Reasoning and Interaction in Information Visualization: A Top-down Perspective. IEEE Transactions on Visualization and Computer Graphics 16, 6 (Nov 2010), 999–1008. https://doi.org/10.1109/TVCG.2010.177",
      "doi": "10.1109/TVCG.2010.177"
    },
    {
      "text": "Richard Mayer, Julie Heiser, and Steve Lonn. 2001. Cognitive Constraints on Multimedia Learning: When Presenting More Material Results in Less Understanding. Journal of Educational Psychology 93 (03 2001), 187–198. https://doi.org/10.1037/0022-0663.93.1.187",
      "doi": ""
    },
    {
      "text": "Luana Micallef, Pierre Dragicevic, and Jean-Daniel Fekete. 2012. Assessing the Effect of Visualizations on Bayesian Reasoning Through Crowdsourcing. Visualization and Computer Graphics, IEEE Transactions on 18 (12 2012), 2536–2545. https://doi.org/10.1109/TVCG.2012.199",
      "doi": ""
    },
    {
      "text": "Alvitta Ottley, Aleksandra Kaszowska, R. Jordan Crouser, and Evan M. Peck. 2019. The Curious Case of Combining Text and Visualization. https://doi.org/10.2312/evs.20191181",
      "doi": ""
    },
    {
      "text": "Alvitta Ottley, Blossom Metevier, Paul Han, and Remco Chang. 2012. Visually Communicating Bayesian Statistics to Laypersons.",
      "doi": ""
    },
    {
      "text": "A. Ottley, E. M. Peck, L. T. Harrison, D. Afergan, C. Ziemkiewicz, H. A. Taylor, P. K. J. Han, and R. Chang. 2016. Improving Bayesian Reasoning: The Effects of Phrasing, Visualization, and Spatial Ability. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan 2016), 529–538. https://doi.org/10.1109/TVCG.2015.2467758",
      "doi": "10.1109/TVCG.2015.2467758"
    },
    {
      "text": "William A Pike, John Stasko, Remco Chang, and Theresa A O’connell. 2009. The science of interaction. Information visualization 8, 4 (2009), 263–274.",
      "doi": "10.1057/ivs.2009.22"
    },
    {
      "text": "M. Pohl, M. Smuc, and E. Mayr. 2012. The User Puzzle–Explaining the Interaction with Visual Analytics Systems. IEEE Transactions on Visualization and Computer Graphics 18, 12 (Dec 2012), 2908–2916. https://doi.org/10.1109/TVCG.2012.273",
      "doi": "10.1109/TVCG.2012.273"
    },
    {
      "text": "Eric Ragan, Alex Endert, Doug Bowman, and Francis Quek. 2012. How Spatial Layout, Interactivity, and Persistent Visibility Affect Learning with Large Displays. https://doi.org/10.1145/2254556.2254576",
      "doi": ""
    },
    {
      "text": "Peter Sedlmeier and Gerd Gigerenzer. 2001. Teaching Bayesian reasoning in less than two hours. Journal of experimental psychology. General 130 (10 2001), 380–400. https://doi.org/10.1037//0096-3445.130.3.380",
      "doi": ""
    },
    {
      "text": "B. Shneiderman. 1996. The eyes have it: a task by data type taxonomy for information visualizations. , 336-343 pages.",
      "doi": ""
    },
    {
      "text": "David Spiegelhalter, Mike Pearson, and Ian Short. 2011. Visualizing Uncertainty About the Future. Science 333, 6048 (2011), 1393–1400. https://doi.org/10.1126/science.1191181",
      "doi": ""
    },
    {
      "text": "Sabine Theis, Christina Bröhl, Matthias Wille, Peter Rasche, Alexander Mertens, Emma Beauxis-Aussalet, Lynda Hardman, and Christopher M. Schlick. 2016. Ergonomic Considerations for the Design and the Evaluation of Uncertain Data Visualizations. In Human Interface and the Management of Information: Information, Design and Interaction, Sakae Yamamoto (Ed.). Springer International Publishing, Cham, 191–202.",
      "doi": ""
    },
    {
      "text": "Lyndal J Trevena, Brian J Zikmund-Fisher, Adrian Edwards, Wolfgang Gaissmaier, Mirta Galesic, Paul KJ Han, John King, Margaret L Lawson, Suzanne K Linder, Isaac Lipkus, 2013. Presenting quantitative information about decision outcomes: a risk communication primer for patient decision aid developers. BMC medical informatics and decision making 13, 2 (2013), 1–15.",
      "doi": ""
    },
    {
      "text": "Jennifer Tsai, Sarah Miller, and Alex Kirlik. 2011. Interactive Visualizations to Improve Bayesian Reasoning. Proceedings of the Human Factors and Ergonomics Society Annual Meeting 55, 1(2011), 385–389. https://doi.org/10.1177/1071181311551079",
      "doi": ""
    },
    {
      "text": "J. J. van Wijk. 2005. The value of visualization. , 79-86 pages. https://doi.org/10.1109/VISUAL.2005.1532781",
      "doi": ""
    },
    {
      "text": "Pei-Yu Wang, Brandon K Vaughn, and Min Liu. 2011. The impact of animation interactivity on novices’ learning of introductory statistics. Computers & Education 56, 1 (2011), 300–311.",
      "doi": "10.1016/j.compedu.2010.07.011"
    },
    {
      "text": "Michael Wybrow, Niklas Elmqvist, Jean-Daniel Fekete, Tatiana Von Landesberger, Jarke Van Wijk, and Björn Zimmer. 2014. Interaction in the Visualization of Multivariate Networks. , XV, 237 pages. https://hal.inria.fr/hal-00974335",
      "doi": ""
    },
    {
      "text": "Ji Yi, Youn Kang, John Stasko, and Julie Jacko. 2007. Toward a Deeper Understanding of the Role of Interaction in Information Visualization. Visualization and Computer Graphics, IEEE Transactions on 13 (12 2007), 1224 – 1231. https://doi.org/10.1109/TVCG.2007.70515",
      "doi": ""
    },
    {
      "text": "Qiyu Zhi, Alvitta Ottley, and Ronald Metoyer. 2019. Linking and Layout: Exploring the Integration of Text and Visualization in Storytelling. , 675–685 pages.",
      "doi": ""
    }
  ]
}