{
  "doi": "10.1145/3411764.3445194",
  "title": "Teachers’ Perceptions around Digital Games for Children in Low-resource Schools for the Blind",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "Most children who are blind live in low-resource settings and attend schools that have poor technical infrastructure, overburdened teachers, and outdated curriculum. Our work explores the role digital games can play to develop digital skills of such children in the early grades. Recognizing the critical role of teachers in introducing children to technology, we conducted a mixed-methods study to examine which attributes of digital games teachers find useful for children and what challenges they perceive in integrating digital games in schools for the blind. Our findings indicate that teachers prefer games that align well with curriculum objectives, promote learning, improve soft skills, and increase engagement with computers. Despite being overburdened and lacking technological support, teachers expressed strong enthusiasm to integrate these games in school curriculum and schedule. We conclude by discussing design implications for designers of accessible games in low-resource settings.",
  "tags": [
    "India",
    "Accessibility.",
    "Visual Impairment",
    "Children",
    "Digital Games",
    "Teachers"
  ],
  "authors": [
    {
      "name": "Gesu India",
      "institution": "Microsoft Research, India",
      "img": "/do/10.1145/contrib-99659476508/rel-imgonly/99659476508.jpg",
      "acmid": "99659476508",
      "orcid": "missing"
    },
    {
      "name": "Vidhya Y",
      "institution": "Vision Empower, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659321268",
      "orcid": "missing"
    },
    {
      "name": "Aishwarya O",
      "institution": "Vision Empower Trust, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700599",
      "orcid": "missing"
    },
    {
      "name": "Nirmalendu Diwakar",
      "institution": "Microsoft Research, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701404",
      "orcid": "missing"
    },
    {
      "name": "Mohit Jain",
      "institution": "Microsoft Research, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659887025",
      "orcid": "0000-0002-7106-164X"
    },
    {
      "name": "Aditya Vashistha",
      "institution": "Cornell University, United States",
      "img": "/do/10.1145/contrib-81474703745/rel-imgonly/aditya-vashistha_2_orig.jpg",
      "acmid": "81474703745",
      "orcid": "0000-0001-5693-3326"
    },
    {
      "name": "Manohar Swaminathan",
      "institution": "Microsoft Research, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659076401",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2004. Home - EnableIndia.org. https://www.enableindia.org/",
      "doi": ""
    },
    {
      "text": "2010. Snehadeep Trust. https://www.snehadeep.org/",
      "doi": ""
    },
    {
      "text": "2019. Vision Empower: Empowering children with visual impairment through inclusive education. http://visionempowertrust.in/",
      "doi": ""
    },
    {
      "text": "2020. National Education Policy 2020. https://www.education.gov.in/sites/upload_files/mhrd/files/NEP_Final_English_0.pdf.",
      "doi": ""
    },
    {
      "text": "NITI Aayog. 2018. National Strategy for Artificial Intelligence. Retrieved Dec 1, 2019 from https://www.niti.gov.in/writereaddata/files/document_publication/NationalStrategy-for-AI-Discussion-Paper.pdf",
      "doi": ""
    },
    {
      "text": "Hamed Al-Awidi and Fayiz Aldhafeeri. 2017. Teachers’ Readiness to Implement Digital Curriculum in Kiwaiti Schools. Journal of Information Technology Education 16, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Richard Anderson, Chad Robertson, Esha Nabi, Urvashi Sahni, and Tanuja Setia. 2012. Facilitated video instruction in low resource schools. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development(ICTD ’12). Association for Computing Machinery, New York, NY, USA, 2–12. https://doi.org/10.1145/2160673.2160675",
      "doi": "10.1145/2160673.2160675"
    },
    {
      "text": "Dominique Archambault, Roland Ossmann, Thomas Gaudy, and Klaus Miesenberger. 2007. Computer games and visually impaired people. Upgrade 8, 2 (2007), 43–53.",
      "doi": ""
    },
    {
      "text": "Jaime Carvalho, Tiago Guerreiro, Luis Duarte, and Luis Carriço. 2012. Audio-based puzzle gaming for blind people. In Proceedings of the Mobile Accessibility Workshop at MobileHCI (MOBACC).",
      "doi": ""
    },
    {
      "text": "Beryl Charlton, Randy Lee Williams, and TF McLaughlin. 2005. Educational Games: A Technique to Accelerate the Acquisition of Reading Skills of Children with Learning Disabilities.International Journal of Special Education 20, 2 (2005), 66–72.",
      "doi": ""
    },
    {
      "text": "Malolan Chetlur, Ashay Tamhane, Vinay Kumar Reddy, Bikram Sengupta, Mohit Jain, Pongsakorn Sukjunnimit, and Ramrao Wagh. 2014. EduPaL: Enabling Blended Learning in Resource Constrained Environments. In Proceedings of the Fifth ACM Symposium on Computing for Development (San Jose, California, USA) (ACM DEV-5 ’14). Association for Computing Machinery, New York, NY, USA, 73–82. https://doi.org/10.1145/2674377.2674388",
      "doi": "10.1145/2674377.2674388"
    },
    {
      "text": "Padma Chirumamilla and Joyojeet Pal. 2013. Play and power: a ludic design proposal for ICTD. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers-Volume 1. 25–33.",
      "doi": "10.1145/2516604.2516628"
    },
    {
      "text": "Erin C Connors, Lindsay A Yazzolino, Jaime Sánchez, and Lotfi B Merabet. 2013. Development of an audio-based virtual gaming environment to assist with navigation skills in the blind. JoVE (Journal of Visualized Experiments)73 (2013), e50272. https://www.jove.com/t/50272/development-an-audio-based-virtual-gaming-environment-to-assist-with",
      "doi": ""
    },
    {
      "text": "HT Correspondent. 2017. Number of blind to come down by 4M as India set to change blindness definition. Retrieved Dec 1, 2019 from https://bit.ly/3aXHKB7",
      "doi": ""
    },
    {
      "text": "ACM India Council. 2017. CSpathshala: Bringing Computational Thinking to Schools. Retrieved Dec 1, 2019 from https://india.acm.org/education/cspathshala",
      "doi": ""
    },
    {
      "text": "Konstantinos Drossos, Nikolaos Zormpas, George Giannakopoulos, and Andreas Floros. 2015. Accessible Games for Blind Children, Empowered by Binaural Sound. In Proceedings of the 8th ACM International Conference on PErvasive Technologies Related to Assistive Environments (Corfu, Greece) (PETRA ’15). Association for Computing Machinery, New York, NY, USA, Article 5, 8 pages. https://doi.org/10.1145/2769493.2769546",
      "doi": "10.1145/2769493.2769546"
    },
    {
      "text": "Yoram Eshet. 2004. Digital literacy: A conceptual framework for survival skills in the digital era. Journal of educational multimedia and hypermedia 13, 1(2004), 93–106.",
      "doi": ""
    },
    {
      "text": "India Brand Equity Foundation. 2015. Science and Technology - IBEF. Retrieved Dec 1, 2019 from https://www.ibef.org/download/Science-Technology-March-2015.pdf",
      "doi": ""
    },
    {
      "text": "Microsoft Garage. 2018. EarHockey: our newest Garage project infuses inclusive design into the arcade classic. https://aka.ms/EarHockeyBlog.",
      "doi": ""
    },
    {
      "text": "BG Glaser. [n.d.]. Theoretical Sensitivity: Advances in the Methodology of Grounded Theory. 1978, Mill Valley, Calif.",
      "doi": ""
    },
    {
      "text": "Dimitris Grammenos, Anthony Savidis, and Constantine Stephanidis. 2005. UA-Chess: A universally accessible board game. In Proceedings of the 3rd International Conference on Universal Access in Human-Computer Interaction, Las Vegas, Nevada (July 2005).",
      "doi": ""
    },
    {
      "text": "Begoña Gros. 2007. Digital Games in Education. Journal of Research on Technology in Education 40, 1 (2007), 23–38. https://doi.org/10.1080/15391523.2007.10782494",
      "doi": ""
    },
    {
      "text": "Begoña Gros. 2007. Digital games in education: The design of games-based learning environments. Journal of research on technology in education 40, 1 (2007), 23–38.",
      "doi": ""
    },
    {
      "text": "Aakar Gupta, Praveen Shekhar, Navkar Samdaria, Mohit Jain, and Joyojeet Pal. 2010. Disha: Multiple mice in narrative content-based computer aided learning for children. In Proceedings of the Interaction design for International Development (IDID). BCS, 1–8.",
      "doi": ""
    },
    {
      "text": "René Gutschmidt, Maria Schiewe, Francis Zinke, and Helmut Jürgensen. 2010. Haptic emulation of games: haptic Sudoku for the blind. In Proceedings of the 3rd International Conference on PErvasive Technologies Related to Assistive Environments. 1–8.",
      "doi": "10.1145/1839294.1839297"
    },
    {
      "text": "Hsiu-Fang Hsieh and Sarah E Shannon. 2005. Three approaches to qualitative content analysis. Qualitative health research 15, 9 (2005), 1277–1288.",
      "doi": ""
    },
    {
      "text": "Johan Huizinga. 1950. Homo Ludens: A Study of the Play-Element in Culture. Beacon press.",
      "doi": ""
    },
    {
      "text": "David Hutchful, Akhil Matur, Edward Cutrell, and Apurva Joshi. 2010. Cloze: an authoring tool for teachers with low computer proficiency. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development(ICTD ’10). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2369220.2369239",
      "doi": "10.1145/2369220.2369239"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology probes: inspiring design for and with families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’03). Association for Computing Machinery, Ft. Lauderdale, Florida, USA, 17–24. https://doi.org/10.1145/642611.642616",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Gesu India, Geetha Ramakrishna, Jyoti Bisht, and Manohar Swaminathan. 2019. Computational Thinking as Play: Experiences of Children Who Are Blind or Low Vision in India. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, PA, USA) (ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 519–522. https://doi.org/10.1145/3308561.3354608",
      "doi": "10.1145/3308561.3354608"
    },
    {
      "text": "Mohit Jain, Jeremy Birnholtz, Edward Cutrell, and Ravin Balakrishnan. 2011. Exploring Display Techniques for Mobile Collaborative Learning in Developing Regions. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (Stockholm, Sweden) (MobileHCI ’11). Association for Computing Machinery, New York, NY, USA, 81–90. https://doi.org/10.1145/2037373.2037388",
      "doi": "10.1145/2037373.2037388"
    },
    {
      "text": "Mohit Jain, Rohun Tripathi, Ishita Bhansali, and Pratyush Kumar. 2019. Automatic Generation and Evaluation of Usable and Secure Audio ReCAPTCHA. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, PA, USA) (ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 355–366. https://doi.org/10.1145/3308561.3353777",
      "doi": "10.1145/3308561.3353777"
    },
    {
      "text": "Matthew Kam, Aishvarya Agarwal, Anuj Kumar, Siddhartha Lal, Akhil Mathur, Anuj Tewari, and John Canny. 2008. Designing E-Learning Games for Rural Children in India: A Format for Balancing Learning with Fun. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (Cape Town, South Africa) (DIS ’08). Association for Computing Machinery, New York, NY, USA, 58–67. https://doi.org/10.1145/1394445.1394452",
      "doi": "10.1145/1394445.1394452"
    },
    {
      "text": "Matthew Kam, Akhil Mathur, Anuj Kumar, and John Canny. 2009. Designing Digital Games for Rural Children: A Study of Traditional Village Games in India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 31–40. https://doi.org/10.1145/1518701.1518707",
      "doi": "10.1145/1518701.1518707"
    },
    {
      "text": "Vaishnav Kameswaran, Jatin Gupta, Joyojeet Pal, Sile O’Modhrain, Tiffany C. Veinot, Robin Brewer, Aakanksha Parameshwar, Vidhya Y, and Jacki O’Neill. 2018. ’We can go anywhere’: Understanding Independence through a Case Study of Ride-hailing Use by People with Visual Impairments in metropolitan India. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 85:1–85:24. https://doi.org/10.1145/3274354",
      "doi": "10.1145/3274354"
    },
    {
      "text": "Vaishnav Kameswaran and Srihari Hulikal Muralidhar. 2019. Cash, Digital Payments and Accessibility: A Case Study from Metropolitan India. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 97:1–97:23. https://doi.org/10.1145/3359199",
      "doi": "10.1145/3359199"
    },
    {
      "text": "Robert F Kenny and Rudy McDaniel. 2011. The role teachers’ expectations and value assessments of video games play in their adopting and integrating them into their classrooms. British Journal of Educational Technology 42, 2 (2011), 197–213.",
      "doi": ""
    },
    {
      "text": "Joy Kim and Jonathan Ricaurte. 2011. TapBeats: Accessible and Mobile Casual Gaming. In The Proceedings of the 13th International ACM SIGACCESS Conference on Computers and Accessibility (Dundee, Scotland, UK) (ASSETS ’11). Association for Computing Machinery, New York, NY, USA, 285–286. https://doi.org/10.1145/2049536.2049609",
      "doi": "10.1145/2049536.2049609"
    },
    {
      "text": "Chien-Yu Lin, Hua-Chen Chai, Jui-ying Wang, Chien-Jung Chen, Yu-Hung Liu, Ching-Wen Chen, Cheng-Wei Lin, and Yu-Mei Huang. 2016. Augmented reality in educational activities for children with disabilities. Displays 42(2016), 51–54.",
      "doi": ""
    },
    {
      "text": "Charlotte Magnusson, Annika Waern, Kirsten Rassmus Gröhn, Åse Bjernryd, Helen Bernhardsson, Ann Jakobsson, Johan Salo, Magnus Wallon, and Per-Olof Hedvall. 2011. Navigating the world and learning to like it: mobility training through a pervasive game. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services. 285–294.",
      "doi": "10.1145/2037373.2037416"
    },
    {
      "text": "Thomas W. Malone. 1980. What Makes Things Fun to Learn? Heuristics for Designing Instructional Computer Games. In Proceedings of the 3rd ACM SIGSMALL Symposium and the First SIGPC Symposium on Small Systems (Palo Alto, California, USA) (SIGSMALL ’80). Association for Computing Machinery, New York, NY, USA, 162–169. https://doi.org/10.1145/800088.802839",
      "doi": "10.1145/800088.802839"
    },
    {
      "text": "Carmel Markey, Des Power, and George Booker. 2003. Using structured games to teach early fraction concepts to students who are deaf or hard of hearing. American Annals of the Deaf 148, 3 (2003), 251–258.",
      "doi": ""
    },
    {
      "text": "Allan Martin. 2009. Digital literacy for the third age: Sustaining identity in an uncertain world. eLearning Papers 12(2009), 1–15.",
      "doi": ""
    },
    {
      "text": "Ted McCarthy, Joyojeet Pal, Tanvi Marballi, and Edward Cutrell. 2012. An analysis of screen reader use in India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development(ICTD ’12). Association for Computing Machinery, Atlanta, Georgia, USA, 149–158. https://doi.org/10.1145/2160673.2160694",
      "doi": "10.1145/2160673.2160694"
    },
    {
      "text": "Daniel Miller, Aaron Parecki, and Sarah A. Douglas. 2007. Finger Dance: A Sound Game for Blind People. In Proceedings of the 9th International ACM SIGACCESS Conference on Computers and Accessibility (Tempe, Arizona, USA) (Assets ’07). Association for Computing Machinery, New York, NY, USA, 253–254. https://doi.org/10.1145/1296843.1296898",
      "doi": "10.1145/1296843.1296898"
    },
    {
      "text": "Hannelore Montrieux, Ruben Vanderlinde, Cédric Courtois, Tammy Schellens, and Lieven De Marez. 2014. A qualitative study about the implementation of tablet computers in secondary education: The teachers’ role in this process. Procedia-Social and Behavioral Sciences 112 (2014), 481–488.",
      "doi": ""
    },
    {
      "text": "Cecily Morrison, Nicolas Villar, Anja Thieme, Oscar Salandin, Daniel Cletheroe, Greg Saul, Darren Edge, Martin Grayson, and Haiyan Zhang. 2019. Torino: A tangible programming language inclusive of children with visual disabilities. Human-Computer Interaction (January 2019). https://www.microsoft.com/en-us/research/publication/torino-a-tangible-programming-language-inclusive_of-children-with-visual-disabilities/",
      "doi": ""
    },
    {
      "text": "NASSCOM. 2017. Jobs and Skills: The Imperative to reinvent and disrupt. Retrieved Dec 1, 2019 from https://www.nasscom.in/sites/default/files/Jobs_and_Skills.pdf",
      "doi": ""
    },
    {
      "text": "Hugo Nicolau, Kyle Montague, Tiago Guerreiro, André Rodrigues, and Vicki L. Hanson. 2015. Typing Performance of Blind Users: An Analysis of Touch Behaviors, Learning Effect, and In-Situ Usage. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (Lisbon, Portugal) (ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 273–280. https://doi.org/10.1145/2700648.2809861",
      "doi": "10.1145/2700648.2809861"
    },
    {
      "text": "David O’Brien and Cassandra Scharber. 2008. Digital literacies go to school: Potholes and possibilities. Journal of Adolescent & Adult Literacy 52, 1 (2008), 66–68.",
      "doi": ""
    },
    {
      "text": "Margaret R. Olson and Cheryl J. Craig. 2001. Opportunities and challenges in the development of teachers’ knowledge: the development of narrative authority through knowledge communities. Teaching and Teacher Education 17, 6 (Aug. 2001), 667–684. https://doi.org/10.1016/S0742-051X(01)00023-3",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal, Priyank Chandra, Terence O’Neill, Maura Youngman, Jasmine Jones, Ji Hye Song, William Strayer, and Ludmila Ferrari. 2016. An Accessibility Infrastructure for the Global South. In Proceedings of the Eighth International Conference on Information and Communication Technologies and Development(ICTD ’16). Association for Computing Machinery, Ann Arbor, MI, USA, 1–11. https://doi.org/10.1145/2909609.2909666",
      "doi": "10.1145/2909609.2909666"
    },
    {
      "text": "Joyojeet Pal, Yeswanth Gogineni, Kunjan Sanghavi, Vrutti Vyas, Kiran Bartakke, Ted McCarthy, Anjali Vartak, Avinash Vutukuri, and Vivek Veeraiah. 2012. Local-language digital information in India: challenges and opportunities for screen readers. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development(ICTD ’12). Association for Computing Machinery, Atlanta, Georgia, USA, 318–325. https://doi.org/10.1145/2160673.2160712",
      "doi": "10.1145/2160673.2160712"
    },
    {
      "text": "Joyojeet Pal and Meera Lakshmanan. 2012. Assistive technology and the employment of people with vision impairments in India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development(ICTD ’12). Association for Computing Machinery, Atlanta, Georgia, USA, 307–317. https://doi.org/10.1145/2160673.2160711",
      "doi": "10.1145/2160673.2160711"
    },
    {
      "text": "Joyojeet Pal, Meera Lakshmanan, and Kentaro Toyama. 2009. “My child will be respected”: Parental perspectives on computers and education in Rural India. Information Systems Frontiers 11, 2 (2009), 129–144.",
      "doi": "10.1007/s10796-009-9172-1"
    },
    {
      "text": "Joyojeet Pal, Anandhi Viswanathan, Priyank Chandra, Anisha Nazareth, Vaishnav Kameswaran, Hariharan Subramonyam, Aditya Johri, Mark S. Ackerman, and Sile O’Modhrain. 2017. Agency in Assistive Technology Adoption: Visual Impairment and Smartphone Use in Bangalore. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, Denver, Colorado, USA, 5929–5940. https://doi.org/10.1145/3025453.3025895",
      "doi": "10.1145/3025453.3025895"
    },
    {
      "text": "Saurabh Panjwani, Aakar Gupta, Navkar Samdaria, Ed Cutrell, and Kentaro Toyama. 2010. Collage: A Presentation Tool for School Teachers. In ICTD 2010. IEEE. https://www.microsoft.com/en-us/research/publication/collage-a-presentation-tool-for-school-teachers/",
      "doi": ""
    },
    {
      "text": "Udai Singh Pawar, Joyojeet Pal, Rahul Gupta, and Kentaro Toyama. 2007. Multiple Mice for Retention Tasks in Disadvantaged Schools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). Association for Computing Machinery, New York, NY, USA, 1581–1590. https://doi.org/10.1145/1240624.1240864",
      "doi": "10.1145/1240624.1240864"
    },
    {
      "text": "Gillian Puttick, Brian Drayton, and Joan Karp. 2015. Digital curriculum in the classroom: Authority, control, and teacher role.International Journal of Emerging Technologies in Learning 10, 6(2015).",
      "doi": ""
    },
    {
      "text": "Jugnoo Rahi, S Sripathi, C Gilbert, and Allen Foster. 1995. Childhood blindness in India: Causes in 1318 blind school students in nine states. Eye (London, England) 9 (Pt 5) (02 1995), 545–50. https://doi.org/10.1038/eye.1995.137",
      "doi": ""
    },
    {
      "text": "André Rodrigues, Kyle Montague, Hugo Nicolau, and Tiago Guerreiro. 2015. Getting Smartphones to Talkback: Understanding the Smartphone Adoption Process of Blind Users. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (Lisbon, Portugal) (ASSETS ’15). Association for Computing Machinery, New York, NY, USA, 23–32. https://doi.org/10.1145/2700648.2809842",
      "doi": "10.1145/2700648.2809842"
    },
    {
      "text": "Patrick Roth, Lori Stefano Petrucci, André Assimacopoulos, and Thierry Pun. 2000. From dots to shapes: an auditory haptic game platform for teaching geometry to blind pupils. (2000).",
      "doi": ""
    },
    {
      "text": "Elisa Rubegni and Monica Landoni. 2013. Modelling the Role of Teachers in Introducing Portable Technology to the School Curriculum. In Proceedings of the 31st European Conference on Cognitive Ergonomics (Toulouse, France) (ECCE ’13). Association for Computing Machinery, New York, NY, USA, Article 13, 8 pages. https://doi.org/10.1145/2501907.2501944",
      "doi": "10.1145/2501907.2501944"
    },
    {
      "text": "Jaime Sánchez and Miguel Elías. 2009. Science learning in blind children through audio-based games. In Engineering the User Interface. Springer, 1–16.",
      "doi": ""
    },
    {
      "text": "Jaime Sánchez, Mauricio Saenz, and Jose Miguel Garrido. 2010. Usability of a multimodal video game to improve navigation skills for blind children. ACM Transactions on Accessible Computing (TACCESS) 3, 2 (2010), 1–29.",
      "doi": "10.1145/1857920.1857924"
    },
    {
      "text": "Maria Saridaki, Dimitris Gouscos, and Michael G Meimaris. 2009. Digital games-based learning for students with intellectual disability. In Games-Based Learning Advancements for Multi-Sensory Human Computer Interfaces: Techniques and Effective Practices. IGI Global, 304–325.",
      "doi": ""
    },
    {
      "text": "Bernd Schulz. 2008. The importance of soft skills: Education beyond academic knowledge. Journal of Language and Communication 2 (01 2008). https://doi.org/10.1016/0006-3207(93)90452-7",
      "doi": ""
    },
    {
      "text": "Elizabeth S Simpson. 2009. Video games as learning environments for students with learning disabilities. Children Youth and Environments 19, 1 (2009), 306–319.",
      "doi": ""
    },
    {
      "text": "Sudheesh Singanamalla, Venkatesh Potluri, Colin Scott, and Indrani Medhi-Thies. 2019. PocketATM: understanding and improving ATM accessibility in India. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development(ICTD ’19). Association for Computing Machinery, Ahmedabad, India, 1–11. https://doi.org/10.1145/3287098.3287106",
      "doi": "10.1145/3287098.3287106"
    },
    {
      "text": "Calle Sjöström. 2001. Using haptics in computer interfaces for blind people. In CHI’01 extended abstracts on Human Factors in Computing Systems. 245–246.",
      "doi": ""
    },
    {
      "text": "Louise Starkey. 2011. Evaluating learning in the 21st century: a digital age learning matrix. Technology, Pedagogy and Education 20, 1 (2011), 19–39. https://doi.org/10.1080/1475939X.2011.554021",
      "doi": ""
    },
    {
      "text": "Manohar Swaminathan and Joyojeet Pal. 2020. Ludic Design for Accessibility in the Global South. In ”Assistive Technology and the Developing World”, Editors: Michael Stein and Jonathan Lazar. Oxford university Press. Preprint at. https://www.microsoft.com/en-us/research/publication/ludic-design-for-accessibility/",
      "doi": ""
    },
    {
      "text": "Manohar Swaminathan, Sujeath Pareddy, Tanuja Sunil Sawant, and Shubi Agarwal. 2018. Video Gaming for the Vision Impaired. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility (Galway, Ireland) (ASSETS ’18). Association for Computing Machinery, New York, NY, USA, 465–467. https://doi.org/10.1145/3234695.3241025",
      "doi": "10.1145/3234695.3241025"
    },
    {
      "text": "David Thompson, Tim Bell, Peter Andreae, and Anthony Robins. 2013. The Role of Teachers in Implementing Curriculum Changes. In Proceeding of the 44th ACM Technical Symposium on Computer Science Education (Denver, Colorado, USA) (SIGCSE ’13). Association for Computing Machinery, New York, NY, USA, 245–250. https://doi.org/10.1145/2445196.2445272",
      "doi": "10.1145/2445196.2445272"
    },
    {
      "text": "Kentaro Toyama. 2011. Technology as amplifier in international development. In Proceedings of the 2011 iConference(iConference ’11). Association for Computing Machinery, New York, NY, USA, 75–82. https://doi.org/10.1145/1940761.1940772",
      "doi": "10.1145/1940761.1940772"
    },
    {
      "text": "Elba del Carmen Valderrama Bahamondez, Christian Winkler, and Albrecht Schmidt. 2011. Utilizing multimedia capabilities of mobile phones to support teaching in schools in rural panama. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 935–944. https://doi.org/10.1145/1978942.1979081",
      "doi": "10.1145/1978942.1979081"
    },
    {
      "text": "Rama Adithya Varanasi, René F. Kizilcec, and Nicola Dell. 2019. How Teachers in India Reconfigure their Work Practices around a Teacher-Oriented Technology Intervention. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 220:1–220:21. https://doi.org/10.1145/3359322",
      "doi": "10.1145/3359322"
    },
    {
      "text": "Rama Adithya Varanasi, Aditya Vashistha, Tapan Parikh, and Nicola Dell. 2020. Challenges and Issues Integrating Smartphones into Teacher Support Programs in India. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development(ICTD2020). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3392561.3394638",
      "doi": "10.1145/3392561.3394638"
    },
    {
      "text": "Aditya Vashistha and Richard Anderson. 2016. Technology use and non-use by low-income blind people in India. ACM SIGACCESS Accessibility and Computing116 (Dec. 2016), 10–21. https://doi.org/10.1145/3023851.3023853",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Erin Brady, William Thies, and Edward Cutrell. 2014. Educational Content Creation and Sharing by Low-Income Visually Impaired People in India. In Proceedings of the Fifth ACM Symposium on Computing for Development(ACM DEV-5 ’14). Association for Computing Machinery, San Jose, California, USA, 63–72. https://doi.org/10.1145/2674377.2674385",
      "doi": "10.1145/2674377.2674385"
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Nicola Dell, and Richard Anderson. 2015. Social Media Platforms for Low-Income Blind People in India. In Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility(ASSETS ’15). Association for Computing Machinery, Lisbon, Portugal, 259–272. https://doi.org/10.1145/2700648.2809858",
      "doi": "10.1145/2700648.2809858"
    },
    {
      "text": "Aditya Vashistha, Pooja Sethi, and Richard Anderson. 2018. BSpeak: An Accessible Voice-based Crowdsourcing Marketplace for Low-Income Blind People. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, Montreal QC, Canada, 1–13. https://doi.org/10.1145/3173574.3173631",
      "doi": "10.1145/3173574.3173631"
    },
    {
      "text": "Aditya Vishwanath, Arkadeep Kumar, and Neha Kumar. 2016. Learning about Teaching in Low-Resource Indian Contexts. In Proceedings of the Third (2016) ACM Conference on Learning @ Scale(L@S ’16). Association for Computing Machinery, New York, NY, USA, 305–308. https://doi.org/10.1145/2876034.2893440",
      "doi": "10.1145/2876034.2893440"
    },
    {
      "text": "Matt Wilkerson, Amanda Koenig, and James Daniel. 2010. Does a sonar system make a blind maze navigation computer game more” fun”?. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility. 309–310.",
      "doi": "10.1145/1878803.1878886"
    }
  ]
}