{
  "doi": "10.1145/3411764.3445494",
  "title": "Exploring Asymmetric Roles in Mixed-Ability Gaming",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "The landscape of digital games is segregated by player ability. For example, sighted players have a multitude of highly visual games at their disposal, while blind players may choose from a variety of audio games. Attempts at improving cross-ability access to any of those are often limited in the experience they provide, or disregard multiplayer experiences. We explore ability-based asymmetric roles as a design approach to create engaging and challenging mixed-ability play. Our team designed and developed two collaborative testbed games exploring asymmetric interdependent roles. In a remote study with 13 mixed-visual-ability pairs we assessed how roles affected perceptions of engagement, competence, and autonomy, using a mixed-methods approach. The games provided an engaging and challenging experience, in which differences in visual ability were not limiting. Our results underline how experiences unequal by design can give rise to an equitable joint experience.",
  "authors": [
    {
      "name": "David Gonçalves",
      "institution": "LASIGE, Faculdade de Ciências, Universidade de Lisboa, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659513473",
      "orcid": "0000-0001-6223-4011"
    },
    {
      "name": "André Rodrigues",
      "institution": "LASIGE, Faculdade de Ciências, Universidade de Lisboa, Portugal",
      "img": "/do/10.1145/contrib-99658688286/rel-imgonly/picture1.jpg",
      "acmid": "99658688286",
      "orcid": "0000-0002-0810-4619"
    },
    {
      "name": "Mike L. Richardson",
      "institution": "Department of Psychology, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526518",
      "orcid": "missing"
    },
    {
      "name": "Alexandra A. de Sousa",
      "institution": "Centre for Health and Cognition, Bath Spa University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700877",
      "orcid": "missing"
    },
    {
      "name": "Michael J. Proulx",
      "institution": "Department of Psychology, University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490649352",
      "orcid": "0000-0003-4066-3645"
    },
    {
      "name": "Tiago Guerreiro",
      "institution": "LASIGE, Faculdade de Ciências, Universidade de Lisboa, Portugal",
      "img": "/do/10.1145/contrib-81350573788/rel-imgonly/aa.jpg",
      "acmid": "81350573788",
      "orcid": "0000-0002-0333-5792"
    }
  ],
  "references": [
    {
      "text": "Ronny Andrade, Melissa J. Rogerson, Jenny Waycott, Steven Baker, and Frank Vetere. 2019. Playing Blind: Revealing the World of Gamers with Visual Impairment. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 116:1–116:14. https://doi.org/10.1145/3290605.3300346 event-place: Glasgow, Scotland Uk.",
      "doi": "10.1145/3290605.3300346"
    },
    {
      "text": "Ronny Andrade, Melissa J. Rogerson, Jenny Waycott, Steven Baker, and Frank Vetere. 2020. Introducing the Gamer Information-Control Framework: Enabling Access to Digital Games for People with Visual Impairment. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376211",
      "doi": "10.1145/3313831.3376211"
    },
    {
      "text": "Dominique Archambault, Roland Ossmann, Thomas Gaudy, and Klaus Miesenberger. 2007. Computer games and visually impaired people. Upgrade (Jan. 2007).",
      "doi": ""
    },
    {
      "text": "Matthew Atkinson, Sabahattin Gucukoglu, Colin Machin, and Adrian Lawrence. 2006. Making the mainstream accessible: Redefining the game. (07 2006). https://doi.org/10.1145/1183316.1183321",
      "doi": "10.1145/1183316.1183321"
    },
    {
      "text": "Ahmad Azadvar and Alessandro Canossa. 2018. UPEQ: ubisoft perceived experience questionnaire: a self-determination evaluation tool for video games. 1–7. https://doi.org/10.1145/3235765.3235780",
      "doi": ""
    },
    {
      "text": "Cynthia L. Bennett, Erin Brady, and Stacy M. Branham. 2018. Interdependence As a Frame for Assistive Technology Research and Design. In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’18). ACM, New York, NY, USA, 161–173. https://doi.org/10.1145/3234695.3236348 event-place: Galway, Ireland.",
      "doi": "10.1145/3234695.3236348"
    },
    {
      "text": "Brian Bors. 2015. The current state of game accessibility guidelines. https://www.game-accessibility.com/documentation/accessibility-guidelines/ Library Catalog: www.game-accessibility.com.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa arXiv:https://www.tandfonline.com/doi/pdf/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Bas Brederode, Panos Markopoulos, Mathieu Gielen, Arnold Vermeeren, Huib Ridder, and Opoulos. 2005. pOwerball: the design of a novel mixed-reality game for children with mixed abilities. (06 2005). https://doi.org/10.1145/1109540.1109545",
      "doi": "10.1145/1109540.1109545"
    },
    {
      "text": "Devin Coldewey. 2019. An Xbox controller with a built-in Braille display is Microsoft’s latest gaming accessibility play | TechCrunch. https://techcrunch.com/2019/05/06/an-xbox-controller-with-a-built-in-braille-display-is-microsofts-latest-gaming-accessibility-play/",
      "doi": ""
    },
    {
      "text": "Extra Credits. 2015. Asymmetric Play - Can One Game Cater to Many Playstyles?https://www.youtube.com/watch?v=SQhxtfKH1f8",
      "doi": ""
    },
    {
      "text": "Tayfun Esenkaya, Vanessa Lloyd-Esenkaya, Eamonn O’Neill, and Michael Proulx. 2020. Multisensory inclusive design with sensory substitution. Cognitive Research: Principles and Implications 5 (12 2020). https://doi.org/10.1186/s41235-020-00240-7",
      "doi": ""
    },
    {
      "text": "Eelke Folmer, Bei Yuan, Dave Carr, and Manjari Sapre. 2009. TextSL: A command-based virtual world interface for the visually impaired. 59–66. https://doi.org/10.1145/1639642.1639654",
      "doi": ""
    },
    {
      "text": "Tracy Fullerton. 2008. Game Design Workshop. A Playcentric Approach to Creating Innovative Games. https://doi.org/10.1201/b22309",
      "doi": ""
    },
    {
      "text": "Kathrin Gerling and Laura Buttrick. 2014. Last Tank Rolling: Exploring Shared Motion-based Play to Empower Persons Using Wheelchairs. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-human Interaction in Play(CHI PLAY ’14). ACM, New York, NY, USA, 415–416. https://doi.org/10.1145/2658537.2661303 event-place: Toronto, Ontario, Canada.",
      "doi": "10.1145/2658537.2661303"
    },
    {
      "text": "David Gonçalves, André Rodrigues, and Tiago Guerreiro. 2020. Playing With Others: Depicting Multiplayer Gaming Experiences of People With Visual Impairments. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (Virtual Event, Greece) (ASSETS ’20). Association for Computing Machinery, New York, NY, USA, Article 22, 12 pages. https://doi.org/10.1145/3373625.3418304",
      "doi": "10.1145/3373625.3418304"
    },
    {
      "text": "A. Grabski, T. Toni, T. Zigrand, R. Weller, and G. Zachmann. 2016. Kinaptic - Techniques and insights for creating competitive accessible 3D games for sighted and visually impaired users. In 2016 IEEE Haptics Symposium (HAPTICS). 325–331. https://doi.org/10.1109/HAPTICS.2016.7463198",
      "doi": ""
    },
    {
      "text": "Roland Graf, Pallavi Benawri, Amy E. Whitesall, Dashiell Carichner, Zixuan Li, Michael Nebeling, and Hun Seok Kim. 2019. IGYM: An Interactive Floor Projection System for Inclusive Exergame Environments. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 31–43. https://doi.org/10.1145/3311350.3347161",
      "doi": "10.1145/3311350.3347161"
    },
    {
      "text": "Dimitris Grammenos. 2005. UA-Chess: A universally accessible board game. HCI: Exploring New Interaction Environments(2005). https://www.academia.edu/23004693/UA-Chess_A_universally_accessible_board_game",
      "doi": ""
    },
    {
      "text": "Dimitris Grammenos. 2008. Game over: learning by dying. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). Association for Computing Machinery, 1443–1452. https://doi.org/10.1145/1357054.1357281",
      "doi": "10.1145/1357054.1357281"
    },
    {
      "text": "Dimitris Grammenos, Anthony Savidis, Yannis Georgalis, and Constantine Stephanidis. 2006. Access Invaders: Developing a Universally Accessible Action Game. In Computers Helping People with Special Needs(Lecture Notes in Computer Science), Klaus Miesenberger, Joachim Klaus, Wolfgang L. Zagler, and Arthur I. Karshmer (Eds.). Springer Berlin Heidelberg, 388–395.",
      "doi": ""
    },
    {
      "text": "Dimitris Grammenos, Anthony Savidis, and Constantine Stephanidis. 2009. Designing Universally Accessible Games. Comput. Entertain. 7, 1, Article 8 (Feb. 2009), 29 pages. https://doi.org/10.1145/1486508.1486516",
      "doi": ""
    },
    {
      "text": "Ian Hamilton, Barrie Ellis, Gareth Ford-Williams, Lynsey Graham, Dimitris Grammenos, Headstrong Games, Ed Lee, Jake Manion, and Thomas Westin. 2012. Game accessibility guidelines | A straightforward reference for inclusive game design. http://gameaccessibilityguidelines.com/",
      "doi": ""
    },
    {
      "text": "John Harris and Mark Hancock. 2019. To Asymmetry and Beyond!: Improving Social Connectedness by Increasing Designed Interdependence in Cooperative Play. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 9:1–9:12. https://doi.org/10.1145/3290605.3300239 event-place: Glasgow, Scotland Uk.",
      "doi": "10.1145/3290605.3300239"
    },
    {
      "text": "Brenda Hazard. 2008. Separate But Equal? A Comparison of Content on Library Web Pages and Their Text Versions. Journal of Web Librarianship 2 (09 2008), 417–428. https://doi.org/10.1080/19322900802191801",
      "doi": ""
    },
    {
      "text": "Kieran Hicks, Kathrin Gerling, Patrick Dickinson, and Vero Vanden Abeele. 2019. Juicy Game Design: Understanding the Impact of Visual Embellishments on Player Experience. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’19). ACM, New York, NY, USA, 185–197. https://doi.org/10.1145/3311350.3347171 event-place: Barcelona, Spain.",
      "doi": "10.1145/3311350.3347171"
    },
    {
      "text": "David Hobbs, Martin Henschke, Brett Wilkinson, and Karen Reynolds. 2012. Game on! Accessible gaming for children with disabilities.",
      "doi": ""
    },
    {
      "text": "Catherine Holloway. 2019. Disability Interaction (DIX): A Manifesto. Interactions 26, 2 (Feb. 2019), 44–49. https://doi.org/10.1145/3310322",
      "doi": "10.1145/3310322"
    },
    {
      "text": "Robin Hunicke, Marc Leblanc, and Robert Zubek. 2004. MDA: A Formal Approach to Game Design and Game Research. AAAI Workshop - Technical Report 1 (01 2004).",
      "doi": ""
    },
    {
      "text": "id Software. 1996. Quake. Game [MS-DOS, AmigaOS, Classic Mac OS, RISC OS, Sega Saturn, Nintendo 64, Linux, Microsoft Windows]. GT Interactive.",
      "doi": ""
    },
    {
      "text": "Luca Imbriani, Ilaria Mariani, and Maresa Bertolo. 2018. WaTa Fight! How situated multiplayer competitive gaming can facilitate the inclusion of low vision and blind players. G|A|M|E Games as Art, Media, Entertainment 1, 7(2018). https://www.gamejournal.it/?p=3467",
      "doi": ""
    },
    {
      "text": "Imran Khaliq and Isabelle Dela Torre. 2019. A Study on Accessibility in Games for the Visually Impaired. In Proceedings of the 5th EAI International Conference on Smart Objects and Technologies for Social Good(Valencia, Spain) (GoodTechs ’19). Association for Computing Machinery, New York, NY, USA, 142–148. https://doi.org/10.1145/3342428.3342682",
      "doi": "10.1145/3342428.3342682"
    },
    {
      "text": "Alexis Kirke. 2018. When the Soundtrack Is the Game: From Audio-Games to Gaming the Music. Springer International Publishing, Cham, 65–83. https://doi.org/10.1007/978-3-319-72272-6_7",
      "doi": ""
    },
    {
      "text": "Logic Artists. 2015. Clandestine. Game [Microsoft Windows]. Copenhagen, Denmark, Logic Artists.",
      "doi": ""
    },
    {
      "text": "Deborah Marks. 1997. Models of disability. Disability and Rehabilitation 19, 3 (1997), 85–91. https://doi.org/10.3109/09638289709166831 arXiv:https://doi.org/10.3109/09638289709166831PMID: 9134350.",
      "doi": ""
    },
    {
      "text": "T. D. Mascio, R. Gennari, A. Melonio, and Pierpaolo Vittorini. 2013. Designing games for deaf children: first guidelines. International Journal of Technology Enhanced Learning 5 (2013), 223–239.",
      "doi": "10.1504/IJTEL.2013.059493"
    },
    {
      "text": "M. Matsuo, T. Miura, M. Sakajiri, J. Onishi, and T. Ono. 2016. ShadowRine: Accessible game for blind users, and accessible action RPG for visually impaired gamers. In 2016 IEEE International Conference on Systems, Man, and Cybernetics (SMC). 002826–002827. https://doi.org/10.1109/SMC.2016.7844667",
      "doi": "10.1109/SMC.2016.7844667"
    },
    {
      "text": "Klaus Miesenberger, Roland Ossmann, Dominique Archambault, Gig Searle, and Andreas Holzinger. 2008. More Than Just a Game: Accessibility in Computer Games. In HCI and Usability for Education and Work(Lecture Notes in Computer Science), Andreas Holzinger (Ed.). Springer, 247–260. https://doi.org/10.1007/978-3-540-89350-9_18",
      "doi": "10.1007/978-3-540-89350-9_18"
    },
    {
      "text": "Tony Morelli, John Foley, Luis Columna, Lauren Lieberman, and Eelke Folmer. 2010. VI-Tennis: A Vibrotactile/Audio Exergame for Players Who Are Visually Impaired. In Proceedings of the Fifth International Conference on the Foundations of Digital Games(FDG ’10). ACM, New York, NY, USA, 147–154. https://doi.org/10.1145/1822348.1822368 event-place: Monterey, California.",
      "doi": "10.1145/1822348.1822368"
    },
    {
      "text": "Tony Morelli, John Foley, and eelke folmer. 2010. VI-bowling: A tactile spatial exergame for individuals with visual impairments. ASSETS’10 - Proceedings of the 12th International ACM SIGACCESS Conference on Computers and Accessibility, 179–186. https://doi.org/10.1145/1878803.1878836",
      "doi": ""
    },
    {
      "text": "Naughty Dog. 2020. The Last of Us Part II. Game [PlayStation 4]. San Mateo, California, United States, Sony Interactive Entertainment.",
      "doi": ""
    },
    {
      "text": "Peter Ohring. 2008. Web-Based Multi-Player Games to Encourage Flexibility and Social Interaction in High-Functioning Children with Autism Spectrum Disorder. In Proceedings of the 7th International Conference on Interaction Design and Children (Chicago, Illinois) (IDC ’08). Association for Computing Machinery, New York, NY, USA, 171–172. https://doi.org/10.1145/1463689.1463750",
      "doi": "10.1145/1463689.1463750"
    },
    {
      "text": "Roland Ossmann, Klaus Miesenberger, and Dominique Archambault. 2008. A Computer Game Designed for All. In Proceedings of the 11th International Conference on Computers Helping People with Special Needs(ICCHP ’08). Springer-Verlag, Berlin, Heidelberg, 585–592. https://doi.org/10.1007/978-3-540-70540-6_83 event-place: linz, Austria.",
      "doi": "10.1007/978-3-540-70540-6_83"
    },
    {
      "text": "Grow Pixel. 2016. Blackbox. Game [iOS]. Grow Pixel.",
      "doi": ""
    },
    {
      "text": "John R. Porter and Julie A. Kientz. 2013. An Empirical Study of Issues and Barriers to Mainstream Video Game Accessibility. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility(ASSETS ’13). ACM, New York, NY, USA, 3:1–3:8. https://doi.org/10.1145/2513383.2513444 event-place: Bellevue, Washington.",
      "doi": "10.1145/2513383.2513444"
    },
    {
      "text": "Mikel Reparaz. 2020. Learning to Design Games for Blind Players. https://news.ubisoft.com/en-us/article/4hE1D1MBWWssYuY7LaMmaS/learning-to-design-games-for-blind-players",
      "doi": ""
    },
    {
      "text": "Alexis Sepchat, Nicolas Monmarché, Mohamed Slimane, and Dominique Archambault. 2006. Semi Automatic Generator of Tactile Video Games for Visually Impaired Children. 372–379. https://doi.org/10.1007/11788713_56",
      "doi": ""
    },
    {
      "text": "Brian Smith and Shree Nayar. 2018. The RAD: Making Racing Games Equivalently Accessible to People Who Are Blind. 1–12. https://doi.org/10.1145/3173574.3174090",
      "doi": ""
    },
    {
      "text": "Digital Phablet Staff. 2020. Blind People Will Be Able To Play The Last of Us Part 2. https://www.digitalphablet.com/blind-people-play-the-last-of-us-part-2/",
      "doi": ""
    },
    {
      "text": "Constantine Stephanidis. 2001. User Interfaces for All: New perspectives into Human-Computer Interaction. 3–17.",
      "doi": ""
    },
    {
      "text": "Jaime Sánchez, Mauricio Sáenz, and Jose Garrido-Miranda. 2010. Usability of a Multimodal Video Game to Improve Navigation Skills for Blind Children. TACCESS 3 (11 2010), 7. https://doi.org/10.1145/1857920.1857924",
      "doi": ""
    },
    {
      "text": "Thekla, Inc.2016. The Witness. Game [Microsoft Windows, PlayStation 4, Xbox One, Nvidia Shield, macOS, iOS]. San Francisco, CA, United States, Thekla, Inc.",
      "doi": ""
    },
    {
      "text": "Shari Trewin, Vicki L. Hanson, Mark R. Laff, and Anna Cavender. 2008. PowerUp: An Accessible Virtual World. In Proceedings of the 10th International ACM SIGACCESS Conference on Computers and Accessibility(Assets ’08). ACM, New York, NY, USA, 177–184. https://doi.org/10.1145/1414471.1414504 event-place: Halifax, Nova Scotia, Canada.",
      "doi": "10.1145/1414471.1414504"
    },
    {
      "text": "Shari Trewin, Mark Laff, Anna Cavender, and Vicki Hanson. 2008. Accessibility in virtual worlds. Conference on Human Factors in Computing Systems - Proceedings, 2727–2732. https://doi.org/10.1145/1358628.1358752",
      "doi": "10.1145/1358628.1358752"
    },
    {
      "text": "Michael Urbanek and Florian Güldenpfennig. 2019. Celebrating 20 Years of Computer-based Audio Gaming. 90–97. https://doi.org/10.1145/3356590.3356605",
      "doi": ""
    },
    {
      "text": "Michael Urbanek and Florian Güldenpfennig. 2019. Unpacking the Audio Game Experience: Lessons Learned from Game Veterans. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’19). ACM, New York, NY, USA, 253–264. https://doi.org/10.1145/3311350.3347182 event-place: Barcelona, Spain.",
      "doi": "10.1145/3311350.3347182"
    },
    {
      "text": "Vertigo Gaming Inc.2012. Cook, Serve, Delicious!Game [Microsoft Windows, macOS, iOS, Android]. Texas, United States, Vertigo Gaming Inc.",
      "doi": ""
    },
    {
      "text": "T. Westin. 2004. Game accessibility case study: Terraformers – a real-time 3d graphic game. In In Proc. of the The Fifth International Conference on Disability, Virtual Reality and Associated Technologies. 95–100.",
      "doi": ""
    },
    {
      "text": "Gareth White, Geraldine Fitzpatrick, and Graham McAllister. 2008. Toward accessible 3D virtual environments for the blind and visually impaired. https://doi.org/10.1145/1413634.1413663",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-Based Design: Concept, Principles and Examples. ACM Trans. Access. Comput. 3, 3 (April 2011), 9:1–9:27. https://doi.org/10.1145/1952383.1952384",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Bei Yuan and Eelke Folmer. 2008. Blind Hero: Enabling Guitar Hero for the Visually Impaired. ASSETS’08: The 10th International ACM SIGACCESS Conference on Computers and Accessibility, 169–176. https://doi.org/10.1145/1414471.1414503",
      "doi": ""
    },
    {
      "text": "Bei Yuan, Eelke Folmer, and Frederick C. Harris, Jr.2011. Game Accessibility: A Survey. Univers. Access Inf. Soc. 10, 1 (March 2011), 81–100. https://doi.org/10.1007/s10209-010-0189-5",
      "doi": "10.1007/s10209-010-0189-5"
    }
  ]
}