{
  "doi": "10.1145/3411764.3445745",
  "title": "Lanterns: Configuring a Digital Resource to Inspire Preschool Children's Free Play Outdoors",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Previous HCI research has highlighted opportunities for digital technologies to support outdoor play amongst children. However, the tendency has been to focus on older children and forms of play that are structured and rule-based. We report on a Research-through-Design (RtD) inquiry, grounded in an Embodied Interactional approach, that investigated configurations of off-the-shelf Internet of Things (IoT) tool-kits to inspire new forms of free play outdoors for preschool children. We designed the Lanterns, a tangible interactive resource that is made using household materials and guided by a template, and which explores new possibilities to inspire social play and embodied interaction outdoors. Based on observations of the Lanterns being used by preschool children and Early Years Practitioners outdoors, we identify qualities of free play promoted by the Lanterns outdoors, such as enchantment, improvisation, anticipation and choice. We discuss our findings by defining three sensitising concepts to support future design research in this space: Choosing the Way; Improvising through Movement; Anticipating a Response.",
  "tags": [
    "outdoor play",
    "tool-kits",
    "children",
    "pervasive play",
    "iot",
    "free play",
    "preschool",
    "interaction design",
    "tangibles"
  ],
  "authors": [
    {
      "name": "Thomas Dylan",
      "institution": "Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659258037",
      "orcid": "missing"
    },
    {
      "name": "Abigail Durrant",
      "institution": "Open Lab, School of Computing Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488179",
      "orcid": "0000-0003-4752-5376"
    },
    {
      "name": "Sena Çerçi",
      "institution": "Northumbria University, United Kingdom",
      "img": "/do/10.1145/contrib-99659442174/rel-imgonly/sc.jpg",
      "acmid": "99659442174",
      "orcid": "missing"
    },
    {
      "name": "Shaun Lawson",
      "institution": "Northumbria University, United Kingdom",
      "img": "/do/10.1145/contrib-81100192206/rel-imgonly/shaun.jpg",
      "acmid": "81100192206",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "University of Edinburgh, Edinburgh, UK",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    }
  ],
  "references": [
    {
      "text": "Alissa N. Antle, Milena Droumeva, and Greg Corness. 2008. Playing with the sound maker: do embodied metaphors help children learn? In Proceedings of the 7th International Conference on Interaction Design and Children, IDC 2008, 178–185. https://doi.org/10.1145/1463689.1463754",
      "doi": "10.1145/1463689.1463754"
    },
    {
      "text": "Jon Back, Caspar Heeffer, Susan Paget, Andreas Rau, Eva Lotta Sallnäs Pysander, and Annika Waern. 2016. Designing for children's outdoor play. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS’16), 28–38. https://doi.org/10.1145/2901790.2901875",
      "doi": "10.1145/2901790.2901875"
    },
    {
      "text": "Jon Back, Elena Márquez Segura, and Annika Waern. 2017. Designing for transformative play. ACM Transactions on Computer-Human Interaction 24, 3. https://doi.org/10.1145/3057921",
      "doi": "10.1145/3057921"
    },
    {
      "text": "Jon Back, Laia Turmo Vidal, Annika Waern, Susan Paget, and Eva Lotta Sallnäs Pysander. 2018. Playing close to home: Interaction and emerging play in outdoor play installations. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18). https://doi.org/10.1145/3173574.3173730",
      "doi": "10.1145/3173574.3173730"
    },
    {
      "text": "Steve Benford, Gabriella Giannachi, Boriana Koleva, and Tom Rodden. 2009. From interaction to trajectories: Designing coherent journeys through user experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’09), 709–718. https://doi.org/10.1145/1518701.1518812",
      "doi": "10.1145/1518701.1518812"
    },
    {
      "text": "Gabriela Bento and Gisela Dias. 2017. The importance of outdoor play for young children's healthy development. Porto Biomedical Journal 2, 5: 157–160. https://doi.org/10.1016/j.pbj.2017.03.003",
      "doi": ""
    },
    {
      "text": "Glenn A. Bowen. 2006. Grounded Theory and Sensitizing Concepts. International Journal of Qualitative Methods 5, 3: 12–23. https://doi.org/10.1177/160940690600500304",
      "doi": ""
    },
    {
      "text": "Liz Brooker, Mindy Blaise, and Susan Edwards. 2014. The SAGE handbook of play and learning in early childhood. Sage Publications Ltd, London. https://doi.org/10.4135/9781473907850",
      "doi": ""
    },
    {
      "text": "Marion Buchenau and Jane Fulton Suri. 2000. Experience Prototyping. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS ’00), 424–433. https://doi.org/10.1145/347642.347802",
      "doi": "10.1145/347642.347802"
    },
    {
      "text": "Hillary L. Burdette and Robert C. Whitaker. 2005. Resurrecting Free Play in Young Children. Archives of Pediatrics & Adolescent Medicine 159, 1: 46. https://doi.org/10.1001/archpedi.159.1.46",
      "doi": ""
    },
    {
      "text": "Guy Claxton and Margaret Carr. 2004. A framework for teaching learning: the dynamics of disposition. Early Years 24, 1: 87–97. https://doi.org/10.1080/09575140320001790898",
      "doi": ""
    },
    {
      "text": "Tina Cook and Else Hess. 2001. A Report on Events, Play, Toys, Adults and Children in the Classroom in a Reception Class. Newcastle.",
      "doi": ""
    },
    {
      "text": "Norman K. Denzin and Herbert Blumer. 2018. What Is Wrong with Social Theory? In Sociological Methods. https://doi.org/10.4324/9781315129945-8",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2001. Where the Action is: The Foundations of Embodied Interaction. MIT Press, Cambridge, MA, USA.",
      "doi": "10.5555/513034"
    },
    {
      "text": "Thomas Dylan, Gavin Wood, Abigail C. Durrant, John Vines, Pablo E. Torres, Philip I.N. Ulrich, Mutlu Cukurova, Amanda Carr, Sena Çerçi, and Shaun Lawson. 2020. Designing IoT Resources to Support Outdoor Play for Children. In Conference on Human Factors in Computing Systems - Proceedings, 1–12. https://doi.org/10.1145/3313831.3376302",
      "doi": "10.1145/3313831.3376302"
    },
    {
      "text": "Ralph J Erickson. 1985. Play contributes to the full emotional development of the child. Education 105, 3: 261–263.",
      "doi": ""
    },
    {
      "text": "Daniel Fallman. 2008. The Interaction Design Research Triangle of Design Practice, Design Studies, and Design Exploration. Design Issues 24, 3: 4–18. https://doi.org/10.1162/desi.2008.24.3.4",
      "doi": ""
    },
    {
      "text": "Frost J. 2006. The Dissolution of Children's Outdoor Play. Retrieved from http://www.balticstreetadventureplay.co.uk/sites/default/files/content-files/joefrostthedissolutionofchildrensoutdoorplaycausesconseques.pdf",
      "doi": ""
    },
    {
      "text": "William Gaver. 2009. Designing for homo ludens, still. In (Re)searching the Digital Bauhaus, Thomas Binder, Jonas Löwgren and Lone Malmborg (eds.). Springer, London.",
      "doi": ""
    },
    {
      "text": "William Gaver. 2012. What should we expect from research through design? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’12). https://doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "Kenneth R. Ginsburg. 2008. The importance of play in promoting healthy child development and maintaining strong parent-child bonds. Nascer e Crescer.",
      "doi": ""
    },
    {
      "text": "Trina Hinkley, Megan Teychenne, Katherine L. Downing, Kylie Ball, Jo Salmon, and Kylie D. Hesketh. 2014. Early childhood physical activity, sedentary behaviors and psychosocial well-being: A systematic review. Preventive Medicine. https://doi.org/10.1016/j.ypmed.2014.02.007",
      "doi": ""
    },
    {
      "text": "Tom Hitron, Andrey Grishko, Idan David, Iddo Yehoshua Wald, Oren Zuckerman, Netta Ofer, and Hadas Erel. 2018. Digital Outdoor play: Benefits and risks from an interaction design perspective. In In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), 1–13. https://doi.org/10.1145/3173574.3173858",
      "doi": "10.1145/3173574.3173858"
    },
    {
      "text": "Jiwoo Hong, HyeonBeom Yi, Jaehoon Pyun, and Woohun Lee. 2020. SoundWear: Effect of Non-Speech Sound Augmentation on the Outdoor Play Experience of Children. In Proceedings of the 2020 ACM Designing Interactive Systems Conference, 2201–2213. https://doi.org/10.1145/3357236.3395541",
      "doi": "10.1145/3357236.3395541"
    },
    {
      "text": "Kenji Iguchi and Masa Inakage. 2006. Morel: Remotely launchable outdoor playthings. In International Conference on Advances in Computer Entertainment Technology 2006. https://doi.org/10.1145/1178823.1178866",
      "doi": "10.1145/1178823.1178866"
    },
    {
      "text": "Bran Knowles, Sophie Beck, Joe Finney, James Devine, and Joseph Lindley. 2019. A Scenario-Based Methodology for Exploring Risks: Children and Programmable IoT. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), 751–761. https://doi.org/10.1145/3322276.3322315",
      "doi": "10.1145/3322276.3322315"
    },
    {
      "text": "Ilpo Koskinen, John Zimmerman, Thomas Binder, Johan Redstrom, and Stephan Wensveen. 2011. Design research through practice: From the lab, field, and showroom. Elsevier.",
      "doi": "10.5555/2132674"
    },
    {
      "text": "Mark de Graaf and Ben Schouten Linda de Valk, Pepijn Rijnbout, Tilde Bekker, Berry Eggen. 2012. Designing for playful experiences in open-ended intelligent play environments. In ADIS International Conference Games and Entertainment Technologies, 3–10.",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The design space of body games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), 3365–3374. https://doi.org/10.1145/2470654.2466461",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Trisha Maynard and Jane Waters. 2007. Learning in the outdoor environment: a missed opportunity? Early Years 27, 3: 255–265. https://doi.org/10.1080/09575140701594400",
      "doi": ""
    },
    {
      "text": "Trisha Maynard and Jane Waters. 2014. Exploring outdoor play in the early years. In T Maynard and J Waters (eds.). Open University Press, Maidenhead, 16–28.",
      "doi": ""
    },
    {
      "text": "Sandra McClintic and Karen Petty. 2015. Exploring Early Childhood Teachers’ Beliefs and Practices About Preschool Outdoor Play: A Qualitative Study. Journal of Early Childhood Teacher Education 36, 1: 24–43. https://doi.org/10.1080/10901027.2014.997844",
      "doi": ""
    },
    {
      "text": "George Herbert Mead. 1934. Mind,self and society. University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Maria Montessori. 1967. The Discovery of the Child. Fides Publishers, Inc.",
      "doi": ""
    },
    {
      "text": "Janet Moyles. 2005. The Excellence of Play (second edition). Buckingham: Open University Press.",
      "doi": ""
    },
    {
      "text": "Lisa Op't Hof, Jente De Pee, Janienke Sturm, Tilde Bekker, and Jos Verbeek. 2010. Prolonged play with the ColorFlares: How does open-ended play behavior change over time? Proceedings of the 3rd International Conference on Fun and Games (Fun and Games ’10), 99–106. https://doi.org/10.1145/1823818.1823829",
      "doi": "10.1145/1823818.1823829"
    },
    {
      "text": "Mildred Parten. 1932. Social participation among pre-school children. Journal of Abnormal and Social Psychology 27, 3. https://doi.org/10.1037/h0074524",
      "doi": ""
    },
    {
      "text": "Jean Piaget. 1952. The Origins of Intelligence in Children. University Press, New York, New York, USA.",
      "doi": ""
    },
    {
      "text": "Mitchel Resnick, Fred Martin, Robert Berg, Rick Borovoy, Vanessa Colella, Kwin Kramer, and Brian Silverman. 1998. Digital manipulatives. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’98), 281–287. https://doi.org/10.1145/274644.274684",
      "doi": "10.1145/274644.274684"
    },
    {
      "text": "Joan Santer, Carol Griffiths, Deborah L Goodall, National Children's Bureau, and Play England. 2007. Free play in early childhood: A literature review. Retrieved from http://www.playengland.org.uk/media/120426/free-play-in-early-childhood.pdf",
      "doi": ""
    },
    {
      "text": "Susanne Seitinger, Elisabeth Sylvan, Oren Zuckerman, Marko Popovic, and Orit Zuckerman. 2006. A new playground experience: Going digital? In Conference on Human Factors in Computing Systems - Proceedings, 303–308. https://doi.org/10.1145/1125451.1125520",
      "doi": "10.1145/1125451.1125520"
    },
    {
      "text": "Jack P Shonkoff and Deborah A Phillips. 2000. From Neurons to Neighborhoods. National Academies Press, Washington (DC). https://doi.org/10.17226/9824",
      "doi": ""
    },
    {
      "text": "Dorothy Singer, Jerome Singer, Heidi D'Agnostino, and Raeka DeLong. 2009. Children's Pastimes and Play in Sixteen Nations: Is Free-Play Declining? American Journal of Play 1, 3: 283–312.",
      "doi": ""
    },
    {
      "text": "Iris Soute, Susanne Lagerström, and Panos Markopoulos. 2013. Rapid prototyping of outdoor games for children in an iterative design process. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC ’13). https://doi.org/10.1145/2485760.2485779",
      "doi": "10.1145/2485760.2485779"
    },
    {
      "text": "Iris Soute, Panos Markopoulos, and Remco Magielse. 2010. Head Up Games: Combining the best of both worlds by merging traditional and digital play. In Personal and Ubiquitous Computing, 435–444. https://doi.org/10.1007/s00779-009-0265-0",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Jonas Löwgren, and Kristina Höök. 2014. Evocative balance: Designing for interactional empowerment. International Journal of Design 8, 1: 43–57.",
      "doi": ""
    },
    {
      "text": "Pieter Stappers and Elisa Giaccardi. 2017. Research through design. In The encyclopedia of human-computer interaction 2. Retrieved from https://www.interaction-design.org/literature/book/the-encyclopedia-of-human-computer-interaction-2nd-ed/research-through-design",
      "doi": ""
    },
    {
      "text": "Janienke Sturm, Tilde Bekker, Bas Groenendaal, Rik Wesselink, and Berry Eggen. 2008. Key issues for the successful design of an intelligent, interactive playground. In Proceedings of the 7th International Conference on Interaction Design and Children, IDC 2008, 258–265. https://doi.org/10.1145/1463689.1463764",
      "doi": "10.1145/1463689.1463764"
    },
    {
      "text": "Daniel Tetteroo, Dennis Reidsma, Betsy Van Dijk, and Anton Nijholt. 2012. Design of an interactive playground based on traditional children's play. In Lecture Notes of the Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering, 129–138. https://doi.org/10.1007/978-3-642-30214-5_15",
      "doi": ""
    },
    {
      "text": "Gordon Tiemstra, Renée Van Den Berg, Tilde Bekker, and Mark De Graaf. 2011. Guidelines to design interactive open-ended play installations for children placed in a free play environment. In Proceedings of DiGRA 2011 Conference: Think Design Play.",
      "doi": ""
    },
    {
      "text": "Linda de Valk, Tilde Bekker, and Berry Eggen. 2013. Leaving room for improvisation: towards a design approach for open-ended play. In Proceedings of the 12th International Conference on Interaction Design and Children, 92–101. https://doi.org/10.1145/2485760.2485771",
      "doi": "10.1145/2485760.2485771"
    },
    {
      "text": "Linda De Valk, Pepijn Rijnbout, Tilde Bekker, Berry Eggen, Mark De Graaf, and Ben Schouten. 2012. Open-Ended Intelligent Play Environments. In IADIS International Conference Game and Entertainment Technologies, 3–10.",
      "doi": ""
    },
    {
      "text": "Linda de Valk, Pepijn Rijnbout, Mark de Graaf, Tilde Bekker, Ben Schouten, and Berry Eggen. 2013. GlowSteps – A Decentralized Interactive Play Environment for Open-Ended Play. In Advances in Computer Entertainment, 528–531.",
      "doi": ""
    },
    {
      "text": "Annika Waern, Jon Back, Paulina Rajkowska, Jocelyn Spence, Karin B Johansson, and Anders Sundnes Løvlie. 2020. Sensitizing Scenarios: Sensitizing Designer Teams to Theory. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1–13.",
      "doi": "10.1145/3313831.3376620"
    },
    {
      "text": "Jayne Wallace, Joyce S R Yee, and Abigail Durrant. 2014. Reflections on a Synergistic Format for Disseminating Research through Design. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’14), 781–792. https://doi.org/10.1145/2559206.2578865",
      "doi": ""
    },
    {
      "text": "Jan White. 2011. Capturing the difference: the special nature of the outdoors. In Outdoor provision in the early years. Sage Publications Ltd, 45–56.",
      "doi": ""
    },
    {
      "text": "Luke Wolfenden, Jannah Jones, Ben Parmenter, Lubna Abdul Razak, John Wiggers, Philip J Morgan, Meghan Finch, Rachel Sutherland, Christophe Lecathelinais, Tara Clinton-McHarg, Karen Gillham, and Sze Lin Yoong. 2019. Efficacy of a free-play intervention to increase physical activity during childcare: a randomized controlled trial. Health education research 34, 1: 84–97. https://doi.org/10.1093/her/cyy041",
      "doi": ""
    },
    {
      "text": "Gavin Wood, Thomas Dylan, Abigail Durrant, Pablo E Torres, Philip Ulrich, Amanda Carr, Mutlu Cukurova, Denise Downey, Phil McGrath, Madeline Balaam, and 2019. Designing for Digital Playing Out. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19). https://doi.org/10.1145/3290605.3300909",
      "doi": "10.1145/3290605.3300909"
    },
    {
      "text": "John Zimmerman, Erik Stolterman, and Jodi Forlizzi. 2010. An analysis and critique of research through design: Towards a formalization of a research approach. Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS’10), 310–319. https://doi.org/10.1145/1858171.1858228",
      "doi": "10.1145/1858171.1858228"
    },
    {
      "text": "BBC - Make It Digital - The BBC micro:bit. Retrieved September 17, 2020 from https://www.bbc.co.uk/programmes/articles/4hVG2Br1W1LKCmw8nSm9WnQ/the-bbc-micro-bit",
      "doi": ""
    },
    {
      "text": "BBC micro:bit in school | micro:bit. Retrieved September 17, 2020 from https://microbit.org/get-started/bbc-microbit-in-school/",
      "doi": ""
    }
  ]
}