{
  "doi": "10.1145/3411764.3445596",
  "title": "Digital Transformations of Classrooms in Virtual Reality",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-10",
  "year": 2021,
  "badges": [],
  "abstract": "With rapid developments in consumer-level head-mounted displays and computer graphics, immersive VR has the potential to take online and remote learning closer to real-world settings. However, the effects of such digital transformations on learners, particularly for VR, have not been evaluated in depth. This work investigates the interaction-related effects of sitting positions of learners, visualization styles of peer-learners and teachers, and hand-raising behaviors of virtual peer-learners on learners in an immersive VR classroom, using eye tracking data. Our results indicate that learners sitting in the back of the virtual classroom may have difficulties extracting information. Additionally, we find indications that learners engage with lectures more efficiently if virtual avatars are visualized with realistic styles. Lastly, we find different eye movement behaviors towards different performance levels of virtual peer-learners, which should be investigated further. Our findings present an important baseline for design decisions for VR classrooms.",
  "tags": [
    "immersive virtual reality",
    "perception",
    "eye tracking",
    "education",
    "avatars"
  ],
  "authors": [
    {
      "name": "Hong Gao",
      "institution": "University of Tübingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659531188",
      "orcid": "missing"
    },
    {
      "name": "Efe Bozkir",
      "institution": "University of Tübingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659431236",
      "orcid": "missing"
    },
    {
      "name": "Lisa Hasenbein",
      "institution": "University of Tübingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701269",
      "orcid": "missing"
    },
    {
      "name": "Jens-Uwe Hahn",
      "institution": "Hochschule der Medien Stuttgart, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701454",
      "orcid": "missing"
    },
    {
      "name": "Richard Göllner",
      "institution": "University of Tübingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659215157",
      "orcid": "missing"
    },
    {
      "name": "Enkelejda Kasneci",
      "institution": "University of Tübingen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87658774757",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ioannis Agtzidis, Mikhail Startsev, and Michael Dorr. 2019. 360-Degree Video Gaze Behaviour: A Ground-Truth Data Set and a Classification Algorithm for Eye Movements. In Proceedings of the 27th ACM International Conference on Multimedia (Nice, France). ACM, New York, NY, USA, 1007–1015. https://doi.org/10.1145/3343031.3350947",
      "doi": "10.1145/3343031.3350947"
    },
    {
      "text": "Wadee Alhalabi. 2016. Virtual reality systems enhance students’ achievements in engineering education. Behaviour & Information Technology 35 (07 2016), 1–7. https://doi.org/10.1080/0144929X.2016.1212931",
      "doi": "10.1080/0144929X.2016.1212931"
    },
    {
      "text": "Tobias Appel, Christian Scharinger, Peter Gerjets, and Enkelejda Kasneci. 2018. Cross-subject workload classification using pupil-related measures. In Proceedings of the 2018 ACM Symposium on Eye Tracking Research & Applications (Warsaw, Poland). ACM, New York, NY, USA, Article 4, 8 pages. https://doi.org/10.1145/3204493.3204531",
      "doi": "10.1145/3204493.3204531"
    },
    {
      "text": "Tobias Appel, Natalia Sevcenko, Franz Wortha, Katerina Tsarava, Korbinian Moeller, Manuel Ninaus, Enkelejda Kasneci, and Peter Gerjets. 2019. Predicting Cognitive Load in an Emergency Simulation Based on Behavioral and Physiological Measures. In 2019 International Conference on Multimodal Interaction (Suzhou, China). ACM, New York, NY, USA, 154–163. https://doi.org/10.1145/3340555.3353735",
      "doi": "10.1145/3340555.3353735"
    },
    {
      "text": "Jeremy N. Bailenson, Eyal Aharoni, Andrew C. Beall, Rosanna E. Guadagno, Aleksandar Dimov, and Jim Blascovich. 2004. Comparing behavioral and self-report measures of embodied agents’ social presence in immersive virtual environments. In Proceedings of the 7th Annual International Workshop on Presence. The International Society for Presence Research, Valencia, Spain, 216–223.",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson, Andrew C. Beall, and Jim Blascovich. 2002. Gaze and task performance in shared virtual environments. The Journal of Visualization and Computer Animation 13, 5 (2002), 313–320. https://doi.org/10.1002/vis.297",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson, Nick Yee, Jim Blascovich, Andrew C. Beall, Nicole Lundblad, and Michael Jin. 2008. The Use of Immersive Virtual Reality in the Learning Sciences: Digital Transformations of Teachers, Students, and Social Context. Journal of the Learning Sciences 17 (2008), 102–141. https://doi.org/10.1080/10508400701793141",
      "doi": ""
    },
    {
      "text": "Jackson Beatty. 1982. Task-evoked pupillary responses, processing load, and the structure of processing resources. Psychological Bulletin 91, 2 (1982), 276–292. https://doi.org/10.1037/0033-2909.91.2.276",
      "doi": ""
    },
    {
      "text": "Friederike Blume, Richard Göllner, Korbinian Moeller, Thomas Dresler, Ann-Christine Ehlis, and Caterina Gawrilow. 2019. Do students learn better when seated close to the teacher? A virtual classroom study considering individual levels of inattention and hyperactivity-impulsivity. Learning and Instruction 61 (2019), 138–147. https://doi.org/10.1016/j.learninstruc.2018.10.004",
      "doi": ""
    },
    {
      "text": "Ricardo Böheim, Tim Urdan, Maximilian Knogler, and Tina Seidel. 2020. Student hand-raising as an indicator of behavioral engagement and its role in classroom learning. Contemporary Educational Psychology 62 (2020), 101894. https://doi.org/10.1016/j.cedpsych.2020.101894",
      "doi": ""
    },
    {
      "text": "Efe Bozkir, David Geisler, and Enkelejda Kasneci. 2019. Assessment of Driver Attention during a Safety Critical Situation in VR to Generate VR-Based Training. In ACM Symposium on Applied Perception 2019(Barcelona, Spain). ACM, New York, NY, USA, Article 23, 5 pages. https://doi.org/10.1145/3343036.3343138",
      "doi": "10.1145/3343036.3343138"
    },
    {
      "text": "Efe Bozkir, David Geisler, and Enkelejda Kasneci. 2019. Person Independent, Privacy Preserving, and Real Time Assessment of Cognitive Load using Eye Tracking in a Virtual Reality Setup. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR) (Osaka, Japan). IEEE, New York, NY, USA, 1834–1837. https://doi.org/10.1109/VR.2019.8797758",
      "doi": ""
    },
    {
      "text": "Andrea Casu, Lucio Davide Spano, Fabio Sorrentino, and Riccardo Scateni. 2015. RiftArt: Bringing Masterpieces in the Classroom through Immersive Virtual Reality. In Smart Tools and Apps for Graphics - Eurographics Italian Chapter Conference (Verona, Italy). The Eurographics Association, Geneva, Switzerland, 77–84. https://doi.org/10.2312/stag.20151294",
      "doi": ""
    },
    {
      "text": "Kun Hung Cheng and Chin Chung Tsai. 2019. A case study of immersive virtual field trips in an elementary classroom: Students’ learning experience and teacher-student interaction behaviors. Computers & Education 140 (2019), 103600. https://doi.org/10.1016/j.compedu.2019.103600",
      "doi": "10.1016/j.compedu.2019.103600"
    },
    {
      "text": "Kuei-Pin Chien, Cheng-Yue Tsai, Hsiu-Ling Chen, Wen-Hua Chang, and Sufen Chen. 2015. Learning differences and eye fixation patterns in virtual and physical science laboratories. Computers & Education 82 (2015), 191–201. https://doi.org/10.1016/j.compedu.2014.11.023",
      "doi": "10.1016/j.compedu.2014.11.023"
    },
    {
      "text": "Joseph T. Coyne, Cyrus Foroughi, and Ciara Sibley. 2017. Pupil Diameter and Performance in a Supervisory Control Task: A Measure of Effort or Individual Differences?Proceedings of the Human Factors and Ergonomics Society Annual Meeting 61, 1(2017), 865–869. https://doi.org/10.1177/1541931213601689",
      "doi": ""
    },
    {
      "text": "Unai Díaz-Orueta, Cristina García-López, Nerea Crespo-Eguílaz, Rocío Sánchez-Carpintero, Gema Climent, and Juan Narbona. 2014. AULA virtual reality test as an attention measure: Convergent validity with Conners’ Continuous Performance Test. Child Neuropsychology 20(2014), 328–342. https://doi.org/10.1080/09297049.2013.792332",
      "doi": ""
    },
    {
      "text": "Laura Freina and Michela Ott. 2015. A literature review on immersive virtual reality in education: State of the art and perspectives. In Proceedings of the 11th International Scientific Conference eLearning and Software for Education (Bucharest, Romania). Carol I NDU Publishing House, Romania, 133–141. https://doi.org/10.12753/2066-026X-15-020",
      "doi": ""
    },
    {
      "text": "Joseph H. Goldberg and Xerxes P. Kotval. 1999. Computer interface evaluation using eye movements: methods and constructs. International Journal of Industrial Ergonomics 24, 6(1999), 631–645. https://doi.org/10.1016/S0169-8141(98)00068-7",
      "doi": "10.1016/s0169-8141%2898%2900068-7"
    },
    {
      "text": "Joseph H. Goldberg, Mark J. Stimson, Marion Lewenstein, Neil Scott, and Anna M. Wichansky. 2002. Eye Tracking in Web Search Tasks: Design Implications. In Proceedings of the 2002 Symposium on Eye Tracking Research & Applications (New Orleans, LA, USA). ACM, New York, NY, USA, 51–58. https://doi.org/10.1145/507072.507082",
      "doi": "10.1145/507072.507082"
    },
    {
      "text": "Patricia Goldberg, Ömer Sümer, Kathleen Stürmer, Wolfgang Wagner, Richard Göllner, Peter Gerjets, Enkelejda Kasneci, and Ulrich Trautwein. 2019. Attentive or Not? Toward a Machine Learning Approach to Assessing Students’ Visible Engagement in Classroom Instruction. Educational Psychology Review 31, 4 (2019), 1–23. https://doi.org/10.1007/s10648-019-09514-z",
      "doi": ""
    },
    {
      "text": "Sandra Helsel. 1992. Virtual Reality and Education. Educational Technology 32, 5 (1992), 38–42.",
      "doi": "10.5555/134958.134965"
    },
    {
      "text": "Jan Herrington, Thomas C Reeves, and Ron Oliver. 2007. Immersive learning technologies: Realism and online authentic learning. Journal of Computing in Higher Education 19, 1 (2007), 80–99. https://doi.org/10.1007/BF03033421",
      "doi": ""
    },
    {
      "text": "Christian Hirt, Marcel Eckard, and Andreas Kunz. 2020. Stress generation and non-intrusive measurement in virtual environments using eye tracking. Journal of Ambient Intelligence and Humanized Computing 11, 1 (2020), 1–13. https://doi.org/10.1007/s12652-020-01845-y",
      "doi": ""
    },
    {
      "text": "Kenneth Holmqvist, Marcus Nyström, Richard Andersson, Richard Dewhurst, Jarodzka Halszka, and Joost van de Weijer. 2011. Eye Tracking : A Comprehensive Guide to Methods and Measures. Oxford University Press, United Kingdom.",
      "doi": ""
    },
    {
      "text": "Kate S. Hone and Ghada R. El Said. 2016. Exploring the factors affecting MOOC retention: A survey study. Computers & Education 98 (2016), 157–168. https://doi.org/10.1016/j.compedu.2016.03.016",
      "doi": "10.1016/j.compedu.2016.03.016"
    },
    {
      "text": "Zhiming Hu, Sheng Li, Congyi Zhang, Kangrui Yi, Guoping Wang, and Dinesh Manocha. 2020. DGaze: CNN-Based Gaze Prediction in Dynamic Scenes. IEEE Transactions on Visualization and Computer Graphics 26, 5(2020), 1902–1911. https://doi.org/10.1109/TVCG.2020.2973473",
      "doi": ""
    },
    {
      "text": "Halszka Jarodzka, Kenneth Holmqvist, and Hans Gruber. 2017. Eye tracking in Educational Science: Theoretical frameworks and research agendas. Journal of Eye Movement Research 10, 1 (2017). https://doi.org/10.16910/jemr.10.1.3",
      "doi": ""
    },
    {
      "text": "Dongsik Jo, Ki-Hong Kim, and Gerard Jounghyun Kim. 2016. Effects of Avatar and Background Representation Forms to Co-Presence in Mixed Reality (MR) Tele-Conference Systems. In SIGGRAPH ASIA 2016 Virtual Reality Meets Physical Reality: Modelling and Simulating Virtual Humans and Environments (Macau). ACM, New York, NY, USA, Article 12, 4 pages. https://doi.org/10.1145/2992138.2992146",
      "doi": "10.1145/2992138.2992146"
    },
    {
      "text": "Marcel A. Just and Patricia A. Carpenter. 1976. Eye fixations and cognitive processes. Cognitive Psychology 8, 4 (1976), 441–480. https://doi.org/10.1016/0010-0285(76)90015-3",
      "doi": ""
    },
    {
      "text": "Tuomas Kantonen, Charles Woodward, and Neil Katz. 2010. Mixed reality in virtual world teleconferencing. In 2010 IEEE Virtual Reality Conference (VR)(Waltham, MA, USA). IEEE, New York, NY, USA, 179–182. https://doi.org/10.1109/VR.2010.5444792",
      "doi": "10.1109/VR.2010.5444792"
    },
    {
      "text": "Muhammad Sikandar Lal Khan, Haibo Li, and Shafiq Ur Réhman. 2016. Tele-Immersion: Virtual Reality Based Collaboration. In International Conference on Human-Computer Interaction (Toronto, Canada). Springer, Cham, 352–357. https://doi.org/10.1007/978-3-319-40548-3_59",
      "doi": ""
    },
    {
      "text": "Richard Lamb and Elisabeth A. Etopio. 2020. Virtual Reality: A Tool for Preservice Science Teachers to Put Theory into Practice. Journal of Science Education and Technology 29, 4 (2020), 573–585. https://doi.org/10.1007/s10956-020-09837-5",
      "doi": ""
    },
    {
      "text": "Gongjin Lan, Ziyun Luo, and Qi Hao. 2016. Development of a virtual reality teleconference system using distributed depth sensors. In 2016 2nd IEEE International Conference on Computer and Communications (ICCC)(Chengdu, China). IEEE, New York, NY, USA, 975–978. https://doi.org/10.1109/CompComm.2016.7924850",
      "doi": ""
    },
    {
      "text": "Yining Lang, Liang Wei, Fang Xu, Yibiao Zhao, and Lap-Fai Yu. 2018. Synthesizing Personalized Training Programs for Improving Driving Habits via Virtual Reality. In 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR) (Reutlingen, Germany). IEEE, New York, NY, USA, 297–304. https://doi.org/10.1109/VR.2018.8448290",
      "doi": ""
    },
    {
      "text": "Meng-Yun Liao, Ching-Ying Sung, Hao-Chuan Wang, and Wen-Chieh Lin. 2019. Virtual Classmates: Embodying Historical Learners’ Messages as Learning Companions in a VR Classroom through Comment Mapping. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR) (Osaka, Japan). IEEE, New York, NY, USA, 163–171. https://doi.org/10.1109/VR.2019.8797708",
      "doi": ""
    },
    {
      "text": "Matthew Lombard, Theresa Bolmarcich, and Lisa Weinstein. 2009. Measuring Presence: The Temple Presence Inventory. In Proceedings of the 12th Annual International Workshop on Presence. The International Society for Presence Research, Los Angeles, CA, USA, 1–15.",
      "doi": ""
    },
    {
      "text": "Aman Mangalmurti, William Kistler, Barrington Quarrie, Wendy Sharp, Susan Persky, and Philip Shaw. 2020. Using virtual reality to define the mechanisms linking symptoms with cognitive deficits in attention deficit hyperactivity disorder. Scientific Reports 10 (12 2020). https://doi.org/10.1038/s41598-019-56936-4",
      "doi": ""
    },
    {
      "text": "Ronald B. Marks, Stanley D. Sibley, and J. Ben Arbaugh. 2005. A Structural Equation Model of Predictors for Effective Online Learning. Journal of Management Education 29, 4 (2005), 531–563. https://doi.org/10.1177/1052562904271199",
      "doi": ""
    },
    {
      "text": "Sebastiaan Mathôt, Jasper Fabius, Elle Van Heusden, and Stefan Van der Stigchel. 2018. Safe and sensible preprocessing and baseline correction of pupil-size data. Behavior Research Methods 50, 1 (2018), 94–106. https://doi.org/10.3758/s13428-017-1007-2",
      "doi": ""
    },
    {
      "text": "Richard E. Mayer. 2010. Unique contributions of eye-tracking research to the study of learning with graphics. Learning and Instruction 20, 2 (2010), 167–171. https://doi.org/10.1016/j.learninstruc.2009.02.012",
      "doi": ""
    },
    {
      "text": "Christian Moro, Zane Štromberga, Athanasios Raikos, and Allan Stirling. 2017. The effectiveness of virtual and augmented reality in health sciences and medical anatomy. Anatomical Sciences Education 10, 6 (2017), 549–559. https://doi.org/10.1002/ase.1696",
      "doi": ""
    },
    {
      "text": "Shivsevak Negi and Ritayan Mitra. 2020. Fixation duration and the learning process: an eye tracking study with subtitled videos. Journal of Eye Movement Research 13, 6 (2020). https://doi.org/10.16910/jemr.13.6.1",
      "doi": ""
    },
    {
      "text": "Pierre Nolin, Annie Stipanicic, Mylène Henry, Yves Lachapelle, Dany Lussier-Desrochers, Albert S. Rizzo, and Philippe Allain. 2016. ClinicaVR: Classroom-CPT: A virtual reality tool for assessing attention and inhibition in children and adolescents. Computers in Human Behavior 59 (2016), 327–333. https://doi.org/10.1016/j.chb.2016.02.023",
      "doi": "10.1016/j.chb.2016.02.023"
    },
    {
      "text": "Elena Olmos-Raya, Janaina Ferreira-Cavalcanti, Manuel Contero, M Concepción Castellanos, Irene Alice Chicchi Giglioli, and Mariano Alcañiz. 2018. Mobile virtual reality as an educational platform: A pilot study on the impact of immersion and positive emotion induction in the learning process. EURASIA Journal of Mathematics, Science and Technology Education 14, 6(2018), 2045–2057. https://doi.org/10.29333/ejmste/85874",
      "doi": ""
    },
    {
      "text": "Jason Orlosky, Yuta Itoh, Maud Ranchet, Kiyoshi Kiyokawa, John Morgan, and Hannes Devos. 2017. Emulation of Physician Tasks in Eye-Tracked Virtual Reality for Remote Diagnosis of Neurodegenerative Disease. IEEE Transactions on Visualization and Computer Graphics 23, 4(2017), 1302–1311. https://doi.org/10.1109/TVCG.2017.2657018",
      "doi": "10.1109/TVCG.2017.2657018"
    },
    {
      "text": "Marc Pomplun, Tyler Garaas, and Marisa Carrasco. 2013. The effects of task difficulty on visual search strategy in virtual 3D displays. Journal of vision 13(2013). https://doi.org/10.1167/13.3.24",
      "doi": ""
    },
    {
      "text": "Joseph Psotka. 1995. Immersive training systems: Virtual reality and education and training. Instructional science 23, 5-6 (1995), 405–431. https://doi.org/10.1007/BF00896880",
      "doi": ""
    },
    {
      "text": "Natasha Anne Rappa, Susan Ledger, Timothy Teo, Kok Wai Wong, Brad Power, and Bruce Hilliard. 2019. The use of eye tracking technology to explore learning and performance within virtual reality and mixed reality settings: a scoping review. Interactive Learning Environments 0, 0 (2019), 1–13. https://doi.org/10.1080/10494820.2019.1702560",
      "doi": ""
    },
    {
      "text": "Ananda Bibek Ray and Suman Deb. 2016. Smartphone Based Virtual Reality Systems in Classroom Teaching — A Study on the Effects of Learning Outcome. In 2016 IEEE Eighth International Conference on Technology for Education (T4E) (Mumbai, India). IEEE, New York, NY, USA, 68–71. https://doi.org/10.1109/T4E.2016.022",
      "doi": ""
    },
    {
      "text": "Albert A. Rizzo, Todd Bowerly, J. Galen Buckwalter, Dean Klimchuk, Roman Mitura, and Thomas D. Parsons. 2006. A Virtual Reality Scenario for All Seasons: The Virtual Classroom. CNS Spectrums 11, 1 (2006), 35–44. https://doi.org/10.1017/S1092852900024196",
      "doi": ""
    },
    {
      "text": "Dario D. Salvucci and Joseph H. Goldberg. 2000. Identifying Fixations and Saccades in Eye-Tracking Protocols. In Proceedings of the 2000 Symposium on Eye Tracking Research & Applications (Palm Beach Gardens, FL, USA). ACM, New York, NY, USA, 71–78. https://doi.org/10.1145/355017.355028",
      "doi": ""
    },
    {
      "text": "Abraham Savitzky and Marcel J. E. Golay. 1964. Smoothing and Differentiation of Data by Simplified Least Squares Procedures. Analytical Chemistry 36(1964), 1627–1639. https://doi.org/10.1021/ac60214a047",
      "doi": "10.1021/ac60214a047arXiv%3A"
    },
    {
      "text": "Thomas Schubert, Frank Friedmann, and Holger Regenbrecht. 2001. The Experience of Presence: Factor Analytic Insights. Presence 10, 3 (2001), 266–281. https://doi.org/10.1162/105474601300343603",
      "doi": "10.1162/105474601300343603"
    },
    {
      "text": "Seung-hun Seo, Eunjoo Kim, Peter Mundy, Jiwoong Heo, and Kwanguk Kim. 2019. Joint Attention Virtual Classroom: A Preliminary Study. Psychiatry Investigation 16 (2019), 292–299. https://doi.org/10.30773/pi.2019.02.08",
      "doi": ""
    },
    {
      "text": "Sharad Sharma, Ruth Agada, and Jeff Ruffin. 2013. Virtual reality classroom as an constructivist approach. In 2013 Proceedings of IEEE Southeastcon (Jacksonville, FL, USA). IEEE, New York, NY, USA, 1–5. https://doi.org/10.1109/SECON.2013.6567441",
      "doi": ""
    },
    {
      "text": "Richard J. Shavelson, Judith J. Hubner, and George C. Stanton. 1976. Self-Concept: Validation of Construct Interpretations. Review of Educational Research 46, 3 (1976), 407–441. https://doi.org/10.3102/00346543046003407",
      "doi": ""
    },
    {
      "text": "Adalberto L. Simeone, Marco Speicher, Andreea Molnar, Adriana Wilde, and Florian Daiber. 2019. LIVE: The Human Role in Learning in Immersive Virtual Environments. In Symposium on Spatial User Interaction (New Orleans, LA, USA). ACM, New York, NY, USA, Article 5, 11 pages. https://doi.org/10.1145/3357251.3357590",
      "doi": ""
    },
    {
      "text": "Ömer Sümer, Patricia Goldberg, Kathleen Stürmer, Tina Seidel, Peter Gerjets, Ulrich Trautwein, and Enkelejda Kasneci. 2018. Teachers’ Perception in the Classroom. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition (CVPR) Workshops (Salt Lake City, UT, USA). IEEE, New York, NY, USA, 2315–2324.",
      "doi": ""
    },
    {
      "text": "David Weintrop, Elham Beheshti, Michael Horn, Orton Kai, Kemi Jona, Laura Trouille, and Uri Wilensky. 2016. Defining Computational Thinking for Mathematics and Science Classrooms. Journal of Science Education and Technology 25 (2016), 127–147. https://doi.org/10.1007/s10956-015-9581-5",
      "doi": ""
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, Canada). ACM, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Christine Youngblut. 1998. Educational uses of virtual reality technology. Technical Report. Institute for Defense Analyses, Alexandria, VA, USA.",
      "doi": ""
    }
  ]
}