{
  "doi": "10.1145/3411764.3445059",
  "title": "Queuing for Waste: Sociotechnical Interactions within a Food Sharing Community",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "This paper investigates the practices of organising face-to-face events of a volunteer-run food-sharing community in Denmark. The ethnographic fieldwork draws attention to the core values underlying the ways sharing events are organised, and how - through the work of volunteers - surplus food is transformed from a commodity to a gift. The findings illustrate the community’s activist agenda of food waste reduction, along with the volunteers’ concerns and practical labour of running events and organising the flow of attendees through various queuing mechanisms. The paper contributes to the area of Food and HCI by: i) outlining the role of queuing in organising activism and ii) reflecting on the role that values, such as collective care and commons, can play in structuring queuing at face-to-face events.",
  "authors": [
    {
      "name": "Katie Berns",
      "institution": "Stockholm University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659589112",
      "orcid": "0000-0001-9406-8898"
    },
    {
      "name": "Chiara Rossitto",
      "institution": "Department of Computers and Systems Science Stockholm University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350605248",
      "orcid": "0000-0001-5819-8302"
    },
    {
      "name": "Jakob Tholander",
      "institution": "Stockholm University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100187595",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jessica Aschemann-Witzel, Ilona De Hooge, Pegah Amani, Tino Bech-Larsen, and Marije Oostindjer. 2015. Consumer-related food waste: Causes and potential for action. Sustainability 7, 6 (2015), 6457–6477. Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the implication is not to design (technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). Association for Computing Machinery, New York, NY, USA, 2271–2274. https://doi.org/10.1145/1978942.1979275",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Russell Belk. 2007. Why not share rather than own?The Annals of the American Academy of Political and Social Science 611, 1(2007), 126–140.",
      "doi": ""
    },
    {
      "text": "Genevieve Bell and Joseph Kaye. 2002. Designing technology for domestic spaces: A Kitchen Manifesto. Gastronomica: The Journal of Critical Food Studies 2, 2 (2002), 46–62.",
      "doi": ""
    },
    {
      "text": "Katie Berns and Chiara Rossitto. 2019. From Commodities to Gifts: Redistributing Surplus Food Locally. In Ethnographies of Collaborative Economies, Edinburgh, Scotland, 25 October, 2019. Ethnographies of Collaborative Economies, Edinburgh, Scotland, 11.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis. In APA handbook of research methods in psychology. Vol. Vol. 2. American Psychological Association, 750 First Street NE, Washington, 57–71. Publisher: American Psychological Association.",
      "doi": ""
    },
    {
      "text": "Barry Brown, Alexandra Weilenmann, Donald McMillan, and Airi Lampinen. 2016. Five Provocations for Ethical HCI Research. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 852–863. https://doi.org/10.1145/2858036.2858313",
      "doi": "10.1145/2858036.2858313"
    },
    {
      "text": "Susanne Bødker, Henrik Korsgaard, Peter Lyle, and Joanna Saad-Sulonen. 2016. Happenstance, Strategies and Tactics: Intrinsic Design in a Volunteer-based Community. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction(NordiCHI ’16). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2971485.2971564",
      "doi": "10.1145/2971485.2971564"
    },
    {
      "text": "Susanne Bødker, Henrik Korsgaard, and Joanna Saad-Sulonen. 2016. ’A Farmer, a Place and at least 20 Members’: The Development of Artifact Ecologies in Volunteer-based Communities. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing(CSCW ’16). Association for Computing Machinery, New York, NY, USA, 1142–1156. https://doi.org/10.1145/2818048.2820029",
      "doi": "10.1145/2818048.2820029"
    },
    {
      "text": "Bruno M. Chies. 2017. Turning Food ‘waste’ into a Commons. In Practicing the Commons. Self-Governance, Cooperation and Institutional Change. XVI Biennal IASC-Conference. https://www. iasc2017. org/wp-content/uploads/2017/07/chies. pdf. Digital Library on the Commons, Utrecht, 17.",
      "doi": ""
    },
    {
      "text": "Winyu Chinthammit, Henry Been-Lirn Duh, and Jun Rekimoto. 2014. HCI in food product innovation. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 1111–1114. https://doi.org/10.1145/2559206.2559213",
      "doi": ""
    },
    {
      "text": "Jaz Hee-jeong Choi and Eli Blevis. 2010. HCI and sustainable food culture: a design framework for engagement. In Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries(NordiCHI ’10). Association for Computing Machinery, New York, NY, USA, 112–117. https://doi.org/10.1145/1868914.1868931",
      "doi": "10.1145/1868914.1868931"
    },
    {
      "text": "Jaz Hee-jeong Choi, Conor Linehan, Rob Comber, and John McCarthy. 2012. Food for thought: designing for critical reflection on food practices. In Proceedings of the Designing Interactive Systems Conference(DIS ’12). Association for Computing Machinery, New York, NY, USA, 793–794. https://doi.org/10.1145/2317956.2318077",
      "doi": "10.1145/2317956.2318077"
    },
    {
      "text": "A. Ciaghi and A. Villafiorita. 2016. Beyond food sharing: Supporting food waste reduction with ICTs. In 2016 IEEE International Smart Cities Conference (ISC2). IEEE, Trento, Italy, 1–6. https://doi.org/10.1109/ISC2.2016.7580874",
      "doi": ""
    },
    {
      "text": "Adrian K. Clear, Kirstie O’neill, Adrian Friday, and Mike Hazas. 2016. Bearing an Open “Pandora’s Box” HCI for Reconciling Everyday Food and Sustainability. ACM Transactions on Computer-Human Interaction (TOCHI) 23, 5(2016), 1–25. Publisher: ACM New York, NY, USA.",
      "doi": "10.1145/2970817"
    },
    {
      "text": "Rob Comber, Eva Ganglbauer, Jaz Hee-jeong Choi, Jettie Hoonhout, Yvonne Rogers, Kenton O’Hara, and Julie Maitland. 2012. Food and interaction design: designing for food in everyday life. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’12). Association for Computing Machinery, New York, NY, USA, 2767–2770. https://doi.org/10.1145/2212776.2212716",
      "doi": ""
    },
    {
      "text": "Rob Comber, Jettie Hoonhout, Aart van Halteren, Paula Moynihan, and Patrick Olivier. 2013. Food practices as situated action: exploring and designing for everyday food practices with households. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 2457–2466. https://doi.org/10.1145/2470654.2481340",
      "doi": "10.1145/2470654.2481340"
    },
    {
      "text": "Foodsharing Copenhagen. 2020. Foodsharingcph.org. https://foodsharingcph.org/ Library Catalog: foodsharingcph.org.",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2018. Design Justice: Towards an Intersectional Feminist Framework for Design Theory and Practice. SSRN Scholarly Paper ID 3189696. Social Science Research Network, Rochester, NY. https://papers.ssrn.com/abstract=3189696",
      "doi": ""
    },
    {
      "text": "Anna Davies. 2019. Urban Food Sharing: Rules, Tools and Networks. Policy Press, Ireland. Google-Books-ID: 0p2RDwAAQBAJ.",
      "doi": ""
    },
    {
      "text": "Anna R. Davies. 2014. Co-creating sustainable eating futures: Technology, ICT and citizen consumer ambivalence. Futures 62(2014), 181–193.",
      "doi": ""
    },
    {
      "text": "Anna R. Davies and Robert Legg. 2018. Fare sharing: interrogating the nexus of ICT, urban food sharing, and sustainability. Food, Culture & Society 21, 2 (2018), 233–254.",
      "doi": ""
    },
    {
      "text": "Foodsharing Deutschland. 2020. Lebensmittel teilen, statt wegwerfen - foodsharing Deutschland. https://foodsharing.de Library Catalog: foodsharing.de.",
      "doi": ""
    },
    {
      "text": "Lynn Dombrowski, Jed R. Brubaker, Sen H. Hirano, Melissa Mazmanian, and Gillian R. Hayes. 2013. It takes a network to get dinner: designing location-based systems to address local food needs. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing(UbiComp ’13). Association for Computing Machinery, New York, NY, USA, 519–528. https://doi.org/10.1145/2493432.2493493",
      "doi": "10.1145/2493432.2493493"
    },
    {
      "text": "Teppo Eskelinen, Tuuli Hirvilammi, and Juhana Venäläinen. 2020. Introduction: Community economies and social transformation with, within and beyond the welfare state. MAYFLYBOOKS EPHEMERA, Finland. Publisher: MayFly.",
      "doi": ""
    },
    {
      "text": "FareShare. 2020. Fighting hunger, tackling food waste in the UK. https://fareshare.org.uk/ Library Catalog: fareshare.org.uk.",
      "doi": ""
    },
    {
      "text": "FoodCloud. 2020. Feeding Kindness. https://food.cloud/",
      "doi": ""
    },
    {
      "text": "Francesca Forno and Paolo R. Graziano. 2014. Sustainable community movement organisations. Journal of Consumer Culture 14, 2 (2014), 139–157. Publisher: Sage Publications Sage UK: London, England.",
      "doi": ""
    },
    {
      "text": "Koen Frenken and Juliet Schor. 2017. Putting the sharing economy into perspective. Environmental Innovation and Societal Transitions 23 (June 2017), 3–10. https://doi.org/10.1016/j.eist.2017.01.003",
      "doi": ""
    },
    {
      "text": "Dicte Frost. 2019. Intermediate Sharing Realities: European Ecovillages. In Ethnographies of Collaborative Economies, Edinburgh, Scotland, 25 October, 2019. Ethnographies of Collaborative Economies, Edinburgh, Scotland, 16.",
      "doi": ""
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, and Rob Comber. 2013. Negotiating food waste: Using a practice lens to inform design. ACM Transactions on Computer-Human Interaction 20, 2 (May 2013), 11:1–11:25. https://doi.org/10.1145/2463579.2463582",
      "doi": "10.1145/2463579.2463582"
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, and Georg Molzer. 2012. Creating visibility: understanding the design space for food waste. In Proceedings of the 11th International Conference on Mobile and Ubiquitous Multimedia(MUM ’12). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2406367.2406369",
      "doi": "10.1145/2406367.2406369"
    },
    {
      "text": "Eva Ganglbauer, Geraldine Fitzpatrick, Özge Subasi, and Florian Güldenpfennig. 2014. Think globally, act locally: a case study of a free food sharing community and social networking. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(CSCW ’14). Association for Computing Machinery, New York, NY, USA, 911–921. https://doi.org/10.1145/2531602.2531664",
      "doi": "10.1145/2531602.2531664"
    },
    {
      "text": "Kayleigh Garthwaite. 2016. Stigma, shame and’people like us’: an ethnographic study of foodbank use in the UK. Journal of Poverty and Social Justice 24, 3 (2016), 277–289.",
      "doi": ""
    },
    {
      "text": "Gibson-Graham, Stephen Healy, and Jenny Cameron. 2016. Commoning as a postcapitalist politics 1. Routledge, 2 Park Square, Milton Park, Abingdon, Oxon OX14 4RN. https://doi.org/10.4324/9781315673172-12 Pages: 192-212 Publication Title: Releasing the Commons.",
      "doi": ""
    },
    {
      "text": "Julie Katherine Gibson-Graham. 1997. The end of capitalism (as we knew it): A feminist critique of political economy. Capital & Class 21, 2 (1997), 186–188. Publisher: SAGE Publications Sage UK: London, England.",
      "doi": ""
    },
    {
      "text": "J. K. Gibson-Graham, Jenny Cameron, and Stephen Healy. 2013. Take Back the Economy: An Ethical Guide for Transforming Our Communities. University of Minnesota Press, University of Minnesota Press 111 Third Avenue South, Suite 290 Minneapolis, MN 55401-2520. https://www.jstor.org/stable/10.5749/j.ctt32bcgj",
      "doi": ""
    },
    {
      "text": "Too Good To Go. 2020. Waste Warriors fighting food waste together. https://toogoodtogo.com/en-us Library Catalog: toogoodtogo.com.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1956. Embarrassment and Social Organization. Amer. J. Sociology 62, 3 (1956), 264–271. https://www.jstor.org/stable/2772920 Publisher: University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Catherine Grevet, Anthony Tang, and Elizabeth Mynatt. 2012. Eating alone, together: new forms of commensality. In Proceedings of the 17th ACM international conference on Supporting group work(GROUP ’12). Association for Computing Machinery, New York, NY, USA, 103–106. https://doi.org/10.1145/2389176.2389192",
      "doi": "10.1145/2389176.2389192"
    },
    {
      "text": "Mary Griffin, Jeffery Sobal, and Thomas A. Lyson. 2009. An analysis of a community food waste stream. Agriculture and Human Values 26, 1-2 (2009), 67–81. Publisher: Springer.",
      "doi": ""
    },
    {
      "text": "Andrea Grimes and Richard Harper. 2008. Celebratory technology: new directions for food research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’08). Association for Computing Machinery, New York, NY, USA, 467–476. https://doi.org/10.1145/1357054.1357130",
      "doi": "10.1145/1357054.1357130"
    },
    {
      "text": "Jenny Gustavsson, Christel Cederberg, and Ulf Sonesson. 2011. Global food losses and food waste: extent, causes and prevention ; study conducted for the International Congress Save Food! at Interpack 2011, [16 - 17 May], Düsseldorf, Germany. Food and Agriculture Organization of the United Nations, Rome.",
      "doi": ""
    },
    {
      "text": "Isa Hardemo. 2006. On the practice of queuing and new forms of interaction. PhD Thesis. Blekinge Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Garrett Hardin. 1998. Extensions of “The tragedy of the commons”. Science 280, 5364 (1998), 682–683. Publisher: American Association for the Advancement of Science.",
      "doi": ""
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Rob Comber. 2018. Connected seeds and sensors: co-designing internet of things for sustainable smart cities with urban food-growing communities. In Proceedings of the 15th Participatory Design Conference: Short Papers, Situated Actions, Workshops and Tutorial - Volume 2(PDC ’18). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/3210604.3210620",
      "doi": "10.1145/3210604.3210620"
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Rob Comber. 2019. The Right to the Sustainable Smart City. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300517",
      "doi": "10.1145/3290605.3300517"
    },
    {
      "text": "Sara Heitlinger, Nick Bryan-Kinns, and Janis Jefferies. 2013. Sustainable HCI for grassroots urban food-growing communities. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration(OzCHI ’13). Association for Computing Machinery, New York, NY, USA, 255–264. https://doi.org/10.1145/2541016.2541023",
      "doi": "10.1145/2541016.2541023"
    },
    {
      "text": "Tapio Ikkala and Airi Lampinen. 2015. Monetizing Network Hospitality: Hospitality and Sociability in the Context of Airbnb. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1033–1044. https://doi.org/10.1145/2675133.2675274",
      "doi": "10.1145/2675133.2675274"
    },
    {
      "text": "Blomberg J, Burrel M, and Guest G. 2003. ”An Ethnographic Approach to Design.” In The Human Computer Interaction Handbook - Fundamentals, Evolving Technologies, and Emerging Applications.L. Erlbaum (Ed): Lawrence Erlbaum., 365 Broadway Hillsdale, NJUnited States.",
      "doi": ""
    },
    {
      "text": "Karma. 2020. Save food from being wasted. https://karma.life/ Library Catalog: karma.life.",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov, William Odom, Vicki Moulder, Carl DiSalvo, Tad Hirsch, Ron Wakkary, and Eric Paulos. 2011. HCI, politics and the city: engaging with urban grassroots movements for reflection and action. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 2409–2412. https://doi.org/10.1145/1979742.1979568",
      "doi": ""
    },
    {
      "text": "Airi Lampinen and Coye Cheshire. 2016. Hosting via Airbnb: Motivations and Financial Assurances in Monetized Network Hospitality. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, New York, NY, USA, 1669–1680. https://doi.org/10.1145/2858036.2858092",
      "doi": "10.1145/2858036.2858092"
    },
    {
      "text": "Airi Lampinen, Moira McGregor, Rob Comber, and Barry Brown. 2018. Member-Owned Alternatives: Exploring Participatory Forms of Organising with Cooperatives. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–19. Publisher: ACM New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Airi M I Lampinen. 2014. Account sharing in the context of networked hospitality exchange. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing(CSCW ’14). Association for Computing Machinery, New York, NY, USA, 499–504. https://doi.org/10.1145/2531602.2531665",
      "doi": "10.1145/2531602.2531665"
    },
    {
      "text": "Cheryl Lans. 2016. Worldwide Opportunities on Organic Farms (WWOOF) as part of the existing care economy in Canada. Geoforum 75(2016), 16–19. Publisher: Elsevier.",
      "doi": ""
    },
    {
      "text": "E. Laurier, A. Whyte, and K. Buckner. 2001. An ethnography of a neighbourhood café: informality, table arrangements and background noise. Journal of Mundane Behaviour 2, 2 (June 2001), 195–232. http://mundanebehavior.org/issues/v2n2/laurier.htm Number: 2.",
      "doi": ""
    },
    {
      "text": "Christopher A. Le Dantec. 2016. Designing Publics(1st ed.). The MIT Press, 1 Rogers Street in Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Tania Lewis. 2018. Digital food: from paddock to platform. Communication Research and Practice 4, 3 (2018), 212–228. Publisher: Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Ann Light. 2019. Talking about Collaborative Economies: Platforms, Trust and Ethnographic Methods–Keynote Talk. In Ethnographies of Collaborative Economies, Edinburgh, Scotland, 25 October, 2019. Ethnographies of Collaborative Economies, Edinburgh, Scotland, 8.",
      "doi": ""
    },
    {
      "text": "Eric Livingston. 1987. Making sense of ethnomethodology. Routledge & Kegan Paul, London ; New York.",
      "doi": ""
    },
    {
      "text": "Antipode Foundation Ltd. 2019. Community Economy: Community Economies Collective. In Keywords in Radical Geography: Antipode at 50. John Wiley & Sons, Ltd, New York, NY, USA. https://doi.org/10.1002/9781119558071.ch10 Section: 10 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/9781119558071.ch10.",
      "doi": ""
    },
    {
      "text": "Paul Luff and Christian Heath. 1998. Mobility in collaboration. In Proceedings of the 1998 ACM conference on Computer supported cooperative work(CSCW ’98). Association for Computing Machinery, New York, NY, USA, 305–314. https://doi.org/10.1145/289444.289505",
      "doi": "10.1145/289444.289505"
    },
    {
      "text": "Ezio Manzini and Rachel Coad. 2015. Design, When Everybody Designs: An Introduction to Design for Social Innovation. The MIT Press, Cambridge, Massachusetts, United States. https://www.jstor.org/stable/j.ctt17kk7sv",
      "doi": ""
    },
    {
      "text": "Sanna Marttila, Andrea Botero, and Joanna Saad-Sulonen. 2014. Towards commons design in participatory design. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts - Volume 2(PDC ’14). Association for Computing Machinery, New York, NY, USA, 9–12. https://doi.org/10.1145/2662155.2662187",
      "doi": "10.1145/2662155.2662187"
    },
    {
      "text": "John McCarthy and Peter Wright. 2015. Taking [a] part: the politics and aesthetics of participation in experience-centered design. MIT Press, Cambridge, Massachusetts, United States.",
      "doi": "10.5555/2742697"
    },
    {
      "text": "Duncan McLaren and Julian Agyeman. 2015. Sharing Cities: A Case for Truly Smart and Sustainable Cities. The MIT Press, Cambridge, Massachusetts, United States. https://mitpress.universitypressscholarship.com/view/10.7551/mitpress/9780262029728.001.0001/upso-9780262029728 Publication Title: Sharing Cities.",
      "doi": ""
    },
    {
      "text": "Ethan Miller. 2013. Community economy: Ontology, ethics, and politics for radically democratic economic organizing. Rethinking Marxism 25, 4 (2013), 518–533. Publisher: Taylor & Francis.",
      "doi": ""
    },
    {
      "text": "Oona Morrow. 2020. Gleaning: transactions at the nexus of food, commons and waste. In Chapters. Edward Elgar Publishing, Cheltenham, United Kingdom, 206–213. https://ideas.repec.org/h/elg/eechap/18372_22.html",
      "doi": ""
    },
    {
      "text": "Christina Neumayer and Celina Raffl. 2008. Facebook for global protest: The potential and limits of social software for grassroots activism. In Proceedings of the 5th Prato Community Informatics & Development Informatics Conference, Vol. 5. Community Informatics & Development Informatics Conference, Monash Centre, Prato, Italy, 10.",
      "doi": ""
    },
    {
      "text": "Daniel Normark. 2006. Tending to mobility: intensities of staying at the petrol station. Environment and Planning A 38, 2 (2006), 241–252. Publisher: SAGE Publications Sage UK: London, England.",
      "doi": ""
    },
    {
      "text": "Maria Normark and Jakob Tholander. 2014. Performativity in sustainable interaction: the case of seasonal grocery shopping in ecofriends. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 271–280. https://doi.org/10.1145/2556288.2557318",
      "doi": "10.1145/2556288.2557318"
    },
    {
      "text": "Juliet Norton, Nico Herbig, Lynn Dombrowski, Ankita Raturi, Bonnie Nardi, Sebastian Prost, Samantha McDonald, Daniel Pargman, Oliver Bates, Maria Normark, and Bill Tomlinson. 2017. A grand challenge for HCI: food + sustainability. interactions 24, 6 (Oct. 2017), 50–55. https://doi.org/10.1145/3137095",
      "doi": "10.1145/3137095"
    },
    {
      "text": "OLIO. 2020. Share more. Waste less.https://olioex.com/",
      "doi": ""
    },
    {
      "text": "Elinor Ostrom. 1990. Governing the Commons: The Evolution of Institutions for Collective Action. Cambridge University Press, Cambridge. https://doi.org/10.1017/CBO9780511807763",
      "doi": ""
    },
    {
      "text": "Semih Otles, Stella Despoudi, Camelia Bucatariu, and Canan Kartal. 2015. Chapter 1 - Food waste management, valorization, and sustainability in the food industry. In Food Waste Recovery, Charis M. Galanakis (Ed.). Academic Press, San Diego, 3–23. https://doi.org/10.1016/B978-0-12-800351-0.00001-8",
      "doi": ""
    },
    {
      "text": "Julian Parfitt, Mark Barthel, and Sarah Macnaughton. 2010. Food waste within food supply chains: quantification and potential for change to 2050. Philosophical transactions of the royal society B: biological sciences 365, 1554 (2010), 3065–3081. Publisher: The Royal Society.",
      "doi": ""
    },
    {
      "text": "Nassim Parvin and Anne Pollock. 2020. Unintended by Design: On the Political Uses of “Unintended Consequences”. Engaging Science, Technology, and Society 6 (2020), 320–327.",
      "doi": ""
    },
    {
      "text": "Joanna Penn, Journalist’s Resource June 3, and 2016. 2016. Uber, Airbnb and consequences of the sharing economy: Research roundup. https://journalistsresource.org/studies/economics/business/airbnb-lyft-uber-bike-share-sharing-economy-research-roundup/ Library Catalog: journalistsresource.org Section: Business.",
      "doi": ""
    },
    {
      "text": "Sebastian Prost, Clara Crivellaro, Andy Haddon, and Rob Comber. 2018. Food Democracy in the Making: Designing with Local Food Networks. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173907",
      "doi": "10.1145/3173574.3173907"
    },
    {
      "text": "Sebastian Prost, Vasilis Vlachokyriakos, Jane Midgley, Graeme Heron, Kahina Meziant, and Clara Crivellaro. 2019. Infrastructuring Food Democracy: The Formation of a Local Food Hub in the Context of Socio-Economic Deprivation. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–27. Publisher: ACM New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Kingsley Purdam, Elisabeth A. Garratt, and Aneez Esmail. 2016. Hungry? Food insecurity, social stigma and embarrassment in the UK. Sociology 50, 6 (2016), 1072–1088.",
      "doi": ""
    },
    {
      "text": "Ankita Raturi, Juliet Norton, Bill Tomlinson, Eli Blevis, and Lynn Dombrowski. 2017. Designing Sustainable Food Systems. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’17). Association for Computing Machinery, Denver, Colorado, USA, 609–616. https://doi.org/10.1145/3027063.3027075",
      "doi": "10.1145/3027063.3027075"
    },
    {
      "text": "John Restakis. 2010. Humanizing the Economy: Co-operatives in the Age of Capital. New Society Publishers, Gabriola Island, BC Canada, V0R 1X0. Google-Books-ID: m2CdGO_CCe8C.",
      "doi": ""
    },
    {
      "text": "Gerda Roelvink, Katherine Gibson, and Julie Graham. 2009. A postcapitalist politics of dwelling: ecological humanities and community economies in conversation. Australian Humanities Review 46 (May 2009), 14. https://openresearch-repository.anu.edu.au/handle/10440/939 Accepted: 2009-10-18T23:07:15Z Last Modified: 2020-05-19 Publisher: ANU ePress.",
      "doi": ""
    },
    {
      "text": "Chiara Rossitto, Cristian Bogdan, and Kerstin Severinson-Eklundh. 2014. Understanding constellations of technologies in use in a collaborative nomadic setting. Computer Supported Cooperative Work (CSCW) 23, 2 (2014), 137–161.",
      "doi": ""
    },
    {
      "text": "Chiara Rossitto and Airi Lampinen. 2018. Co-creating the Workplace: Participatory efforts to enable individual work at the Hoffice. Computer Supported Cooperative Work (CSCW) 27, 3-6 (2018), 947–982. Publisher: Springer.",
      "doi": "10.1007/s10606-018-9319-z"
    },
    {
      "text": "Michael J. Sandel. 2000. What money can’t buy: the moral limits of markets. Tanner Lectures on Human Values 21 (2000), 87–122. Publisher: University of Utah Press.",
      "doi": ""
    },
    {
      "text": "Juliet Schor. 2016. Debating the sharing economy. Journal of Self-Governance and Management Economics 4, 3 (2016), 7–22. Publisher: Addleton Academic Publishers.",
      "doi": ""
    },
    {
      "text": "Jocelyn Spence. 2019. Inalienability: Understanding Digital Gifts. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300887",
      "doi": "10.1145/3290605.3300887"
    },
    {
      "text": "Elwys De Stefani and Lorenza Mondada. 2018. Encounters in Public Space: How Acquainted Versus Unacquainted Persons Establish Social and Spatial Arrangements. Research on Language and Social Interaction 51, 3 (July 2018), 248–270. https://doi.org/10.1080/08351813.2018.1485230 Publisher: Routledge _eprint: https://doi.org/10.1080/08351813.2018.1485230.",
      "doi": ""
    },
    {
      "text": "Will Steffen, Katherine Richardson, Johan Rockström, Sarah E. Cornell, Ingo Fetzer, Elena M. Bennett, Reinette Biggs, Stephen R. Carpenter, Wim De Vries, and Cynthia A. De Wit. 2015. Planetary boundaries: Guiding human development on a changing planet. Science 347, 6223 (2015), 1259855.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1995. Making work visible. Commun. ACM 38, 9 (1995), 56–64. Publisher: ACM New York, NY, USA.",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Arun Sundararajan. 2016. The Sharing Economy: The End of Employment and the Rise of Crowd-Based Capitalism. The MIT Press, Cambridge, Massachusetts, United States. https://www.jstor.org/stable/j.ctt1c2cqh3",
      "doi": "10.5555/3002839"
    },
    {
      "text": "Åsa Svenfelt and Jorge Luis Zapico. 2016. Sustainable food systems with ICT. In Smart and Sustainable. Atlantis Press, Amsterdam, the Netherlands, 194–201. https://doi.org/10.2991/ict4s-16.2016.23 ISSN: 2352-538X.",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor and Richard Harper. 2002. Age-old practices in the ’new world’: a study of gift-giving between teenage mobile phone users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’02). Association for Computing Machinery, New York, NY, USA, 439–446. https://doi.org/10.1145/503376.503455",
      "doi": ""
    },
    {
      "text": "Maurizio Teli. 2015. Computing and the common: hints of a new utopia in participatory design. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives(CA ’15). Aarhus University Press, Aarhus N, 17–20. https://doi.org/10.7146/aahcc.v1i1.21318",
      "doi": "10.7146/aahcc.v1i1.21318"
    },
    {
      "text": "Maurizio Teli, Angela Di Fiore, and Vincenzo D’Andrea. 2016. Computing and the common: an empirical case of participatory design today. In Proceedings of the 14th Participatory Design Conference: Full papers - Volume 1(PDC ’16). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2940299.2940312",
      "doi": "10.1145/2940299.2940312"
    },
    {
      "text": "Jakob Tholander, Anna Ståhl, Mattias Jacobsson, Lisen Schultz, Sara Borgström, Maria Normark, and Elsa Kosmack-Vaara. 2012. But i don’t trust my friends: ecofriends – an application for reflective grocery shopping. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services(MobileHCI ’12). Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/2371574.2371596",
      "doi": "10.1145/2371574.2371596"
    },
    {
      "text": "Anna Lowenhaupt Tsing. 2015. The Mushroom at the End of the World: On the Possibility of Life in Capitalist Ruins. Princeton University Press, Princeton, New Jersey, United States. Google-Books-ID: tLlKCAAAQBAJ.",
      "doi": ""
    },
    {
      "text": "José Luis Vivero-Pol. 2017. Food as commons or commodity? Exploring the links between normative valuations and agency in food transition. Sustainability 9, 3 (2017), 442. Publisher: Multidisciplinary Digital Publishing Institute.",
      "doi": ""
    },
    {
      "text": "Dhaval Vyas, Stephen Snow, and Miranda Mallett. 2015. More than just Food: Field Visits to an Emergency Relief Centre. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction(OzCHI ’15). Association for Computing Machinery, New York, NY, USA, 662–666. https://doi.org/10.1145/2838739.2838787",
      "doi": "10.1145/2838739.2838787"
    }
  ]
}