{
  "doi": "10.1145/3411764.3445277",
  "title": "The Burden of Survival: How Doctoral Students in Computing Bridge the Chasm of Inaccessibility",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Despite efforts to support students with disabilities in higher education, few continue to pursue doctoral degrees in computing. We conducted an interview study with 12 blind and low vision, and 7 deaf and hard of hearing current and former doctoral students in computing to understand how graduate students adjust to inaccessibility and ineffective accommodations. We asked participants how they worked around inaccessibility, managed ineffective accommodations, and advocated for tools and services. Employing a lens of ableism in our analysis, we found that participants’ extra effort to address accessibility gaps gave rise to a burden of survival, which they sustained to meet expectations of graduate-level productivity. We recommend equitable solutions that acknowledge taken-for-granted workarounds and that actively address inaccessibility in the graduate school context.",
  "tags": [
    "Ableism",
    "Higher Education",
    "Accessibility",
    "Computing Education Research"
  ],
  "authors": [
    {
      "name": "Kristen Shinohara",
      "institution": "School of Information Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81319501668",
      "orcid": "0000-0002-1157-6369"
    },
    {
      "name": "Mick McQuaid",
      "institution": "School of Information Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100103872",
      "orcid": "missing"
    },
    {
      "name": "Nayeri Jacobo",
      "institution": "School of Information Rochester Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659494191",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aira. 2019. Aira. https://aira.io/",
      "doi": ""
    },
    {
      "text": "Computing Research Association. 2016. The Taulbee Survey. Technical Report. Computing Research Association. https://cra.org/resources/taulbee-survey/",
      "doi": ""
    },
    {
      "text": "Catherine M. Baker. 2017. Increasing Access to Computer Science for Blind Students. SIGACCESS Access. Comput.117 (Feb. 2017), 19–22. https://doi.org/10.1145/3051519.3051523",
      "doi": ""
    },
    {
      "text": "Catherine M. Baker, Lauren R. Milne, and Richard E. Ladner. 2015. StructJumper: A Tool to Help Blind Programmers Navigate and Understand the Structure of Code. In Proceedings of the ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’15). ACM, New York, NY, 3043–3052.",
      "doi": "10.1145/2702123.2702589"
    },
    {
      "text": "Lucy Barnard-Brak, DeAnn Lechtenberger, and William Y Lan. 2010. Accommodation Strategies of College Students with Disabilities. The Qualitative Report 15, 2 (March 2010), 411–429. https://www.proquest.com/docview/195564288",
      "doi": ""
    },
    {
      "text": "Brianna Blaser and Richard E Ladner. 2020. Why is Data on Disability so Hard to Collect and Understand?. In 2020 Research on Equity and Sustained Participation in Engineering, Computing, and Technology (RESPECT), Vol. 1. IEEE, Portland, OR, USA, 1–8.",
      "doi": ""
    },
    {
      "text": "Julian Brinkley, Brianna Posadas, Julia Woodward, and Juan E. Gilbert. 2017. Opinions and Preferences of Blind and Low Vision Consumers Regarding Self-Driving Vehicles: Results of Focus Group Discussions. In Proc. ASSETS ’17. ACM, New York, NY, 290–299.",
      "doi": "10.1145/3132525.3132532"
    },
    {
      "text": "Nicole Brown and Jennifer Leigh. 2018. Ableism in academia: where are the disabled and ill academics?Disability & Society 33, 6 (July 2018), 985–989. https://doi.org/10.1080/09687599.2018.1455627Publisher: Routledge.",
      "doi": ""
    },
    {
      "text": "Sheryl Burgstahler, E. Moore, and L. Crawford. 2016. 2016 Report of the AccessSTEM/AccessComputing/DO-IT Longitudinal Transition Study (ALTS). University of Washington, Seattle, WA. https://www.washington.edu/doit/about/evidence-based-practices/indicators-participant-success",
      "doi": ""
    },
    {
      "text": "Henry Claypool, Amitai Bin-Nun, and Jeffrey Gerlach. 2017. The Ruderman White Paper on Self-Driving Cars: The Impact on People with Disabilities. White Paper. Ruderman Family Foundation. 35 pages. https://rudermanfoundation.org/wp-content/uploads/2017/08/Self-Driving-Cars-The-Impact-on-People-with-Disabilities_FINAL.pdf",
      "doi": ""
    },
    {
      "text": "US Congress. 2011. IDEA Act. https://sites.ed.gov/idea/",
      "doi": ""
    },
    {
      "text": "Hazel Denhart. 2008. Deconstructing Barriers: Perceptions of Students Labeled With Learning Disabilities in Higher Education. Journal of Learning Disabilities 41, 6 (Dec. 2008), 483–97. https://doi.org/10.1177/0022219408321151Place: Austin Publisher: SAGE PUBLICATIONS, INC.",
      "doi": ""
    },
    {
      "text": "Jay Timothy Dolmage. 2017. Academic Ableism: Disability and Higher Education. University of Michigan Press, Ann Arbor. https://doi.org/10.3998/mpub.9708722",
      "doi": ""
    },
    {
      "text": "Be My Eyes. 2020. Be My Eyes. https://www.bemyeyes.com/",
      "doi": ""
    },
    {
      "text": "Catherine S. Fichten, Jennison V. Asuncion, Maria Barile, Vittoria Ferraro, and Joan Wolforth. 2009. Accessibility of e-Learning and Computer and Information Technologies for Students with Visual Impairments in Postsecondary Education. Journal of Visual Impairment & Blindness 103, 9 (Sept. 2009), 543–557. https://doi.org/10.1177/0145482X0910300905",
      "doi": ""
    },
    {
      "text": "Joan M. Francioni and Ann C. Smith. 2002. Computer science accessibility for students with visual disabilities. In Proceedings of the 33rd SIGCSE technical symposium on Computer science education. ACM, Cincinnati, Kentucky, 91–95.",
      "doi": ""
    },
    {
      "text": "Jennifer R. Frey and Carrie M. Gillispie. 2018. The Accessibility Needs of Students with Disabilities: Special Considerations for Instruction and Assessment. In Handbook of Accessible Instruction and Testing Practices: Issues, Innovations, and Applications, Stephen N. Elliott, Ryan J. Kettler, Peter A. Beddow, and Alexander Kurz (Eds.). Springer International Publishing, Cham, Switzerland, 93–105. https://doi.org/10.1007/978-3-319-71126-3_6",
      "doi": ""
    },
    {
      "text": "Barney G Glaser and Anselm L Strauss. 1967. The discovery of grounded theory: strategies for qualitative research. Aldine Publishing, Chicago.",
      "doi": ""
    },
    {
      "text": "Sarah Holloway. 2001. The Experience of Higher Education from the Perspective of Disabled Students. Disability & Society 16, 4 (June 2001), 597–615. https://doi.org/10.1080/09687590120059568Publisher: Routledge.",
      "doi": ""
    },
    {
      "text": "Emily J. Hutcheon and Gregor Wolbring. 2012. Voices of “disabled” post secondary students: Examining higher education “disability” policy using an ableism lens. Journal of Diversity in Higher Education 5, 1 (March 2012), 39–49. https://doi.org/10.1037/a0027002",
      "doi": ""
    },
    {
      "text": "Dhruv Jain, Venkatesh Potluri, and Ather Sharif. 2020. Navigating Graduate School with a Disability: A Trio-Ethnography. In Proceedings of the 2020 ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’20). Association for Computing Machinery, New York, NY, 17 pages.",
      "doi": ""
    },
    {
      "text": "Deborah Rock Kendrick. 2017. Disability Services at Institutions of Higher Education. Ph.D. Dissertation. University of Washington. https://www.proquest.com/docview/1972443236 Dissertation/Thesis.",
      "doi": ""
    },
    {
      "text": "Ezekiel W. Kimball, Ryan S. Wells, Benjamin J. Ostiguy, Catherine A. Manly, and Alexandra A. Lauterbach. 2016. Students with Disabilities in Higher Education: A Review of the Literature and an Agenda for Future Research. In Higher Education: Handbook of Theory and Research, Michael B. Paulsen (Ed.). Springer International Publishing, Cham, Switzerland, 91–156. https://doi.org/10.1007/978-3-319-26829-3_3",
      "doi": ""
    },
    {
      "text": "Simi Linton. 1998. Claiming Disability: Knowledge and Identity. New York University Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Michael Lyman, Mark E. Beecher, Derek Griner, Michael Brooks, John Call, and Aaron Jackson. 2016. What Keeps Students with Disabilities from Using Accommodations in Postsecondary Education? A Qualitative Review.Journal of Postsecondary Education and Disability 29, 2(2016), 123–140.",
      "doi": ""
    },
    {
      "text": "Joseph W. Madaus. 2011. The History of Disability Services in higher education.New Directions for Higher Education 2011, 154 (2011), 5–15. http://search.ebscohost.com/login.aspx?direct=true&db=afh&AN=61807808&site=ehost-live",
      "doi": ""
    },
    {
      "text": "Jennifer Mankoff, Anne Ross, Cynthia L. Bennett, Katta Spiel, Megan Hofmann, and Jennifer Rode. 2020. 2019 Access SIGCHI Report. http://www.sigaccess.org/newsletter/2020-01/accessibility_report.html",
      "doi": ""
    },
    {
      "text": "National Science Foundation. 2019. Special Report NSF 19-304. National Center for Science and Engineering Statistics. National Science Foundation, Alexandria, VA. https://www.nsf.gov/statistics/wmpd",
      "doi": ""
    },
    {
      "text": "National Federation of the Blind. 2020. National Federation of the Blind in Computer Science. http://www.nfbnet.org/mailman/listinfo/nfbcs_nfbnet.org",
      "doi": ""
    },
    {
      "text": "Carol Padden, Tom Humphries, and EBSCO Publishing (Firm). 2006. Inside deaf culture (1st harvard university press pbk. ed.). Harvard University Press, London;Cambridge, Mass;.",
      "doi": ""
    },
    {
      "text": "Michael Quinn Patton. 2014. Qualitative research & evaluation methods: Integrating theory and practice. Sage publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Julie E Preece, Norman L Roberts, Mark E Beecher, Phillip D Rash, David A Shwalb, and Edward A Martinelli. 2007. Academic Advisors and Students with Disabilities: A National Survey of Advisors’ Experiences and Needs. NACADA Journal 27, 1 (2007), 57–72.",
      "doi": ""
    },
    {
      "text": "Roland Reznik. 2016. Disability Advocates See Opportunity in Self Driving Cars. http://kdsmartchair.com/blogs/news/110637830-disability-advocates-see-opportunity-in-self-driving-cars",
      "doi": ""
    },
    {
      "text": "Joseph P. Shapiro. 1994. No Pity. Three Rivers Press, New York, NY.",
      "doi": ""
    },
    {
      "text": "Kristen Shinohara, Michael McQuaid, and Nayeri Jacobo. 2020. Access Differential and Inequitable Access: Inaccessibility for Doctoral Students in Computing. In Proceedings of the 22nd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’20. Association for Computing Machinery, Virtual, 12 pages pages.",
      "doi": "10.1145/3373625.3416989"
    },
    {
      "text": "Anselm L. Strauss and Juliet M. Corbin. 1998. Basics of qualitative research. Sage Publications, Thousand Oaks, CA.",
      "doi": ""
    },
    {
      "text": "Mahadeo A. Sukhai and Chelsea E. Mohler. 2016. Creating a Culture of Accessibility in the Sciences. Elsevier Science & Technology, San Diego, CA.",
      "doi": ""
    },
    {
      "text": "Anon Ymous, Katta Spiel, Os Keyes, Rua M. Williams, Judith Good, Eva Hornecker, and Cynthia L. Bennett. 2020. “I am just terrified of my future” Epistemic Violence in Disability Related Technology Research. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, Honolulu, HI, USA, 1–16. https://doi-org.ezproxy.rit.edu/10.1145/3334480.3381828 Type: 10.1145/3334480.3381828.",
      "doi": ""
    }
  ]
}