{
  "doi": "10.1145/3411764.3445450",
  "title": "Remote Learners, Home Makers: How Digital Fabrication Was Taught Online During a Pandemic",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Digital fabrication courses that relied on physical makerspaces were severely disrupted by COVID-19. As universities shut down in Spring 2020, instructors developed new models for digital fabrication at a distance. Through interviews with faculty and students and examination of course materials, we recount the experiences of eight remote digital fabrication courses. We found that learning with hobbyist equipment and online social networks could emulate using industrial equipment in shared workshops. Furthermore, at-home digital fabrication offered unique learning opportunities including more iteration, machine tuning, and maintenance. These opportunities depended on new forms of labor and varied based on student living situations. Our findings have implications for remote and in-person digital fabrication instruction. They indicate how access to tools was important, but not as critical as providing opportunities for iteration; they show how remote fabrication exacerbated student inequities; and they suggest strategies for evaluating trade-offs in remote fabrication models with respect to learning objectives.",
  "tags": [
    "Digital Fabrication",
    "Remote Learning",
    "Pandemic"
  ],
  "authors": [
    {
      "name": "Gabrielle Benabdallah",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659201432",
      "orcid": "0000-0002-0667-1425"
    },
    {
      "name": "Sam Bourgault",
      "institution": "Media Arts and Technology University of California, Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701248",
      "orcid": "0000-0001-7085-8326"
    },
    {
      "name": "Nadya Peek",
      "institution": "University of Washington and MIT, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384605843",
      "orcid": "0000-0001-9405-0399"
    },
    {
      "name": "Jennifer Jacobs",
      "institution": "Media Arts and Technology University of California Santa Barbara, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556713956",
      "orcid": "0000-0001-8666-8527"
    }
  ],
  "references": [
    {
      "text": "Celena Alcock, Nathaniel Hudson, and Parmit K. Chilana. 2016. Barriers to Using, Customizing, and Printing 3D Designs on Thingiverse. In Proceedings of the 19th International Conference on Supporting Group Work (Sanibel Island, Florida, USA) (GROUP ’16). Association for Computing Machinery, New York, NY, USA, 195–199. https://doi.org/10.1145/2957276.2957301",
      "doi": "10.1145/2957276.2957301"
    },
    {
      "text": "Morgan G. Ames, Jeffrey Bardzell, Shaowen Bardzell, Silvia Lindtner, David A. Mellis, and Daniela K. Rosner. 2014. Making Cultures: Empowerment, Participation, and Democracy - or Not?. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI EA ’14). Association for Computing Machinery, New York, NY, USA, 1087–1092. https://doi.org/10.1145/2559206.2579405",
      "doi": "10.1145/2559206.2579405"
    },
    {
      "text": "Paulo Blikstein. 2013. Digital fabrication and ‘making’in education: The democratization of invention. In FabLabs: Of machines, makers and inventors. Vol. 4. Bielefeld: Transcript Publishers, 1–21.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597.",
      "doi": ""
    },
    {
      "text": "Fabio Campos, Tatiana Soster, and Paulo Blikstein. 2019. Sorry, I Was in Teacher Mode Today: Pivotal Tensions and Contradictory Discourses in Real-World Implementations of School Makerspaces. In Proceedings of FabLearn 2019(New York, NY, USA) (FL2019). Association for Computing Machinery, New York, NY, USA, 96–103. https://doi.org/10.1145/3311890.3311903",
      "doi": "10.1145/3311890.3311903"
    },
    {
      "text": "James Coleman and Shannon Cole. 2017. By Any Means Necessary: Digitally Fabricating Architecture at Scale. Proceedings of the 37th Annual Conference of the Association for Computer Aided Design in Architecture (ACADIA)(2017).",
      "doi": ""
    },
    {
      "text": "D. Dougherty, A. Conrad, and T. O’Reilly. 2016. Free to Make: How the Maker Movement is Changing Our Schools, Our Jobs, and Our Minds. North Atlantic Books.",
      "doi": ""
    },
    {
      "text": "Mike Eisenberg and Ann Eisenberg. 1998. Middle tech: blurring the division between high and low tech in education. In The design of children’s technology. Morgan Kaufmann, 244–273.",
      "doi": ""
    },
    {
      "text": "Eva Eriksson, Ole Sejer Iversen, Gökçe Elif Baykal, Maarten Van Mechelen, Rachel Smith, Marie-Louise Wagner, Bjarke Vognstrup Fog, Clemens Klokmose, Bronwyn Cumbo, Arthur Hjorth, Line Have Musaeus, Marianne Graves Petersen, and Niels Olof Bouvin. 2019. Widening the Scope of FabLearn Research: Integrating Computational Thinking, Design and Making. In Proceedings of the FabLearn Europe 2019 Conference (Oulu, Finland) (FabLearn Europe ’19). Association for Computing Machinery, New York, NY, USA, Article 15, 9 pages. https://doi.org/10.1145/3335055.3335070",
      "doi": "10.1145/3335055.3335070"
    },
    {
      "text": "Philipp Eversmann. 2017. Digital Fabrication in Education-Strategies and Concepts for Large-Scale Projects. Proceedings of the 35th eCAADe Conference 1, 333–342.",
      "doi": ""
    },
    {
      "text": "FabLearn. 2020. The Annual FabLearn Conference. https://fablearn.org/, accessed Aug 2020.",
      "doi": ""
    },
    {
      "text": "Institute for Computational Design and Construction Stuttgart. 2020. Computational Construction Laboratory. https://www.icd.uni-stuttgart.de/research/research-infrastructure/, accessed Aug 2020.",
      "doi": ""
    },
    {
      "text": "Michelle Gantt and Bonnie A. Nardi. 1992. Gardeners and Gurus: Patterns of Cooperation among CAD Users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). Association for Computing Machinery, New York, NY, USA, 107–117. https://doi.org/10.1145/142750.142767",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial Mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 529–539. https://doi.org/10.1145/2984511.2984540",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Jennifer Jacobs, Sumit Gogia, Radomír Mundefinedch, and Joel R. Brandt. 2017. Supporting Expressive Procedural Art Creation through Direct Manipulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6330–6341. https://doi.org/10.1145/3025453.3025927",
      "doi": "10.1145/3025453.3025927"
    },
    {
      "text": "Jennifer Jacobs and Nadya Peek. 2020. Learning remotely, making locally: Remote digital fabrication instruction during a pandemic. Interactions (2020). http://interactions.acm.org/blog/view/learning-remotely-making-locally-remote-digital-fabrication-instruction-dur.",
      "doi": ""
    },
    {
      "text": "Benjamin Lafreniere, Tovi Grossman, Fraser Anderson, Justin Matejka, Heather Kerrick, Danil Nagy, Lauren Vasey, Evan Atherton, Nicholas Beirne, Marcelo H. Coelho, Nicholas Cote, Steven Li, Andy Nogueira, Long Nguyen, Tobias Schwinn, James Stoddart, David Thomasson, Ray Wang, Thomas White, David Benjamin, Maurice Conti, Achim Menges, and George Fitzmaurice. 2016. Crowdsourced Fabrication. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 15–28. https://doi.org/10.1145/2984511.2984553",
      "doi": "10.1145/2984511.2984553"
    },
    {
      "text": "John S. Lamancusa. 2006. The Reincarnation of the Engineering “Shop”(International Design Engineering Technical Conferences and Computers and Information in Engineering Conference, Vol. Volume 4c: 3rd Symposium on International Design and Design Education). 849–857. https://doi.org/10.1115/DETC2006-99723 arXiv:https://asmedigitalcollection.asme.org/IDETC-CIE/proceedings-pdf/IDETC-CIE2006/42584c/849/2652532/849_1.pdf",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Garnet D. Hertz, and Paul Dourish. 2014. Emerging Sites of HCI Innovation: Hackerspaces, Hardware Startups & Incubators. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 439–448. https://doi.org/10.1145/2556288.2557132",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "Lee Martin. 2015. The promise of the maker movement for education. Journal of Pre-College Engineering Education Research (J-PEER) 5, 1(2015), 4.",
      "doi": ""
    },
    {
      "text": "S.L. Martinez and G.S. Stager. 2016. Invent to Learn: Making, Tinkering, and Engineering in the Classroom. Constructing Modern Knowledge Press. https://books.google.com/books?id=4C5evgAACAAJ",
      "doi": ""
    },
    {
      "text": "DF Moore and JA Williams. 2004. Laser prototyping of MEMS structures and SiN cantilevers: experience teaching a practical undergraduate course. IEE Proceedings-Science, Measurement and Technology 151, 2(2004), 54–59.",
      "doi": ""
    },
    {
      "text": "Dean Nieusma and James W Malazita. 2016. ’Making’ a Bridge: Critical Making as Synthesized Engineering/Humanistic Inquiry. Proceedings of the 2016 American Society for Engineering Education (2016).",
      "doi": ""
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 639–648. https://doi.org/10.1145/2702123.2702175",
      "doi": "10.1145/2702123.2702175"
    },
    {
      "text": "Princeton University School of Architecture. 2020. Embodied Computation Lab. https://soa.princeton.edu/content/embodied-computation-lab, accessed Aug 2020.",
      "doi": ""
    },
    {
      "text": "Taubman College University of Michigan. 2020. Digital Fabrication Lab. https://taubmancollege.umich.edu/labs-workshops/digital-fabrication-lab/, accessed Aug 2020.",
      "doi": ""
    },
    {
      "text": "International Symposium on Academic Makerspaces. 2020. The Annual International Symposium on Academic Makerspaces. https://isam2020.hemi-makers.org/, accessed Aug 2020.",
      "doi": ""
    },
    {
      "text": "David Roedl, Shaowen Bardzell, and Jeffrey Bardzell. 2015. Sustainable Making? Balancing Optimism and Criticism in HCI Discourse. ACM Trans. Comput.-Hum. Interact. 22, 3, Article 15 (June 2015), 27 pages. https://doi.org/10.1145/2699742",
      "doi": "10.1145/2699742"
    },
    {
      "text": "Leah F Rosenbaum and Björn Hartmann. 2017. Where be dragons? Charting the known (and not so known) areas of research on academic makerspaces. In International Symposium on Academic Makerspaces (ISAM).",
      "doi": ""
    },
    {
      "text": "Ryan Schmidt and Matt Ratto. 2013. Design-to-Fabricate: Maker Hardware Requires Maker Software. IEEE Computer Graphics and Applications 33, 6 (Nov. 2013), 26–34. https://doi.org/10.1109/MCG.2013.90 Conference Name: IEEE Computer Graphics and Applications.",
      "doi": ""
    },
    {
      "text": "John T. Sherrill. 2017. Gender, Technology, and Narratives in DIY Instructions. In Proceedings of the 35th ACM International Conference on the Design of Communication (Halifax, Nova Scotia, Canada) (SIGDOC ’17). Association for Computing Machinery, New York, NY, USA, Article 9, 8 pages. https://doi.org/10.1145/3121113.3121214",
      "doi": "10.1145/3121113.3121214"
    },
    {
      "text": "Rundong Tian, Sarah Sterman, Ethan Chiou, Jeremy Warner, and Eric Paulos. 2018. MatchSticks: Woodworking through Improvisational Digital Fabrication. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173723",
      "doi": "10.1145/3173574.3173723"
    },
    {
      "text": "JF Walker, DF Moore, and JT Whitney. 1996. Focused ion beam processing for microscale fabrication. Microelectronic engineering 30, 1-4 (1996), 517–522.",
      "doi": ""
    },
    {
      "text": "Guanyun Wang, Humphrey Yang, Zeyu Yan, Nurcan Gecer Ulu, Ye Tao, Jianzhe Gu, Levent Burak Kara, and Lining Yao. 2018. 4DMesh: 4D Printing Morphing Non-Developable Mesh Surfaces. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 623–635. https://doi.org/10.1145/3242587.3242625",
      "doi": "10.1145/3242587.3242625"
    },
    {
      "text": "Richard Whalen. 2013. Augmenting a First-year Design Course with an Undergraduate Student Ad-ministered SolidWorks Module. Proceedings of the 120th Annual Conference of the American Society of Engineering Education 23(2013).",
      "doi": ""
    },
    {
      "text": "Vincent Wilczynski, Aubrey Wigner, Micah Lande, and Shawn Jordan. 2017. The Value of Higher Education Academic Makerspaces for Accreditation and Beyond. Planning for Higher Education 46, 1 (2017), 32–40.",
      "doi": ""
    },
    {
      "text": "Nur Yildirim, James McCann, and John Zimmerman. 2020. Digital Fabrication Tools at Work: Probing Professionals’ Current Needs and Desired Futures. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376621",
      "doi": "10.1145/3313831.3376621"
    }
  ]
}