{
  "doi": "10.1145/3411764.3445313",
  "title": "“That courage to encourage”: Participation and Aspirations in Chat-based Peer Support for Youth Living with HIV",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [
    "Best Paper"
  ],
  "abstract": "We present a qualitative study of a six-month pilot of WhatsApp-based facilitated peer support groups, serving youth living with human immunodeficiency virus (HIV) in an informal settlement in Nairobi, Kenya. Popular chat apps are increasingly being leveraged to make a combination of patient-provider communication and peer support more accessible beyond formal healthcare settings. However, how these interventions are experienced in Global South contexts with phone sharing and intermittent data access is understudied. The context of stigmatized illnesses like HIV further complicates privacy concerns. We draw on chat records and interviews with youth and the facilitator to describe their experience of the intervention. We find that despite tensions in group dynamics, intermittent participation, and contingencies around privacy, youth were motivated by newfound aspirations and community to manage their health. We use our findings to discuss implications for the design of chat-based peer interventions, negotiation of privacy in mobile health applications, and the role of aspirations in health interventions.",
  "authors": [
    {
      "name": "Naveena Karusala",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163160",
      "orcid": "0000-0003-0355-3041"
    },
    {
      "name": "David Odhiambo Seeh",
      "institution": "Kenyatta National Hospital, Kenya",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702162",
      "orcid": "missing"
    },
    {
      "name": "Cyrus Mugo",
      "institution": "Kenyatta National Hospital, Kenya",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700521",
      "orcid": "missing"
    },
    {
      "name": "Brandon Guthrie",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700646",
      "orcid": "missing"
    },
    {
      "name": "Megan A Moreno",
      "institution": "University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701686",
      "orcid": "missing"
    },
    {
      "name": "Grace John-Stewart",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658705132",
      "orcid": "missing"
    },
    {
      "name": "Irene Inwani",
      "institution": "Kenyatta National Hospital, Kenya",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702028",
      "orcid": "missing"
    },
    {
      "name": "Richard Anderson",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81371591530",
      "orcid": "0000-0002-7283-7219"
    },
    {
      "name": "Keshet Ronen",
      "institution": "University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659278091",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Norah Abokhodair and Sarah Vieweg. 2016. Privacy & social media in the context of the Arab Gulf. In Proceedings of the 2016 ACM conference on designing interactive systems. 672–683.",
      "doi": "10.1145/2901790.2901873"
    },
    {
      "text": "Peter Abwao. 2017. Improving HIV care for teens in Kenya with virtual friendships. https://www.path.org/articles/improving-hiv-care-for-teens-in-kenya-with-virtual-friendships/",
      "doi": ""
    },
    {
      "text": "Phil Adams, Eric PS Baumer, and Geri Gay. 2014. Staccato Social Support in Mobile Health Applications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 653–662. https://doi.org/10.1145/2556288.2557297",
      "doi": "10.1145/2556288.2557297"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Jay Chen, and Nicola Dell. 2017. Digital privacy challenges with shared mobile phone use in bangladesh. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–20.",
      "doi": "10.1145/3134652"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Md Romael Haque, Irtaza Haider, Jay Chen, and Nicola Dell. 2019. ”Everyone Has Some Personal Stuff” Designing to Support Digital Privacy with Shared Mobile Phone Use in Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300410"
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity. In Proceedings of the 2016 CHI conference on human factors in computing systems. 3906–3918.",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Eman Asiri, Mohamed Khalifa, Syed-Abdul Shabir, Md Nassif Hossain, Usman Iqbal, and Mowafa Househ. 2017. Sharing sensitive health information through social media in the Arab world. International Journal for Quality in Health Care 29, 1 (2017), 68–74.",
      "doi": ""
    },
    {
      "text": "Avert. 2019. Ringa Nathi: Digital Support Groups for Young People Living with HIV. https://www.avert.org/ringa-nathi-digital-support-groups-young-people-living-hiv",
      "doi": ""
    },
    {
      "text": "Giulia Barbareschi, Catherine Holloway, Katherine Arnold, Grace Magomere, Wycliffe Ambeyi Wetende, Gabriel Ngare, and Joyce Olenja. 2020. The Social Network: How People with Visual Impairment use Mobile Phones in Kibera, Kenya. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376658"
    },
    {
      "text": "Ade Sun Basorun, L Moodley, S Moraje, and M Nielsen. 2012. Understanding the African digital consumer.",
      "doi": ""
    },
    {
      "text": "Robert Beaglehole, JoAnne Epping-Jordan, Vikram Patel, Mickey Chopra, Shah Ebrahim, Michael Kidd, and Andy Haines. 2008. Improving the prevention and management of chronic disease in low-income and middle-income countries: a priority for primary health care. The Lancet 372, 9642 (2008), 940–949.",
      "doi": ""
    },
    {
      "text": "Jean Joel R Bigna, Jean Jacques N Noubiap, Charles Kouanfack, Claudia S Plottel, and Sinata Koulla-Shiro. 2014. Effect of mobile phone reminders on follow-up medical care of children exposed to or infected with HIV in Cameroon (MORE CARE): a multicentre, single-blind, factorial, randomised controlled trial. The Lancet Infectious Diseases 14, 7 (2014), 600–608.",
      "doi": ""
    },
    {
      "text": "Karin Boczek and Lars Koppers. 2020. What’s New about Whatsapp for News? A Mixed-Method Study on News Outlets’ Strategies for Using WhatsApp. Digital Journalism 8, 1 (2020), 126–144.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Jenna Burrell. 2010. Evaluating Shared Access: social equality and the circulation of mobile phones in rural Uganda. Journal of computer-mediated communication 15, 2 (2010), 230–250.",
      "doi": ""
    },
    {
      "text": "Jessica A Bushar, Jodie Fishman, Danielle Garfinkel, and Amy Pirretti. 2019. Enrolling underserved women in mHealth programs: results from Text4baby outreach campaigns. Health promotion practice 20, 2 (2019), 292–299.",
      "doi": ""
    },
    {
      "text": "A Bussone, B Kasadha, S Stumpf, A Durrant, S Tariq, J Gibbs, K Lloyd, and J Bird. 2020. Trust, Identity, Privacy, and Security Considerations For Designing a Peer Data Sharing Platform Between People Living With HIV. Proceedings of the ACM on Human-Computer Interaction (2020).",
      "doi": "10.1145/3415244"
    },
    {
      "text": "Vikram Kamath Cannanure, Justin Souvenir Niweteto, Yves Thierry Adji, Akpe Y Hermann, Kaja K Jasinska, Timothy X Brown, and Amy Ogan. 2020. I’m fine where I am, but I want to do more: Exploring Teacher Aspirations in Rural Côte d’Ivoire. In Proceedings of the 3rd ACM SIGCAS Conference on Computing and Sustainable Societies. 1–12.",
      "doi": "10.1145/3378393.3403653"
    },
    {
      "text": "Liang Chen, Yu Guo, and Jingyuan Shi. 2019. Social support seeking on social media among Chinese gay men living with HIV/AIDS: the role of perceived threat. Telemedicine and e-Health 25, 7 (2019), 655–659.",
      "doi": ""
    },
    {
      "text": "Liang Chen and Jingyuan Shi. 2015. Social support exchanges in a social media community for people living with HIV/AIDS in China. AIDS care 27, 6 (2015), 693–696.",
      "doi": ""
    },
    {
      "text": "Yee Tak Derek Cheung, Ching Han Helen Chan, Chi-Keung Jonah Lai, Wai Fung Vivian Chan, Man Ping Wang, Ho Cheung William Li, Sophia Siu Chee Chan, and Tai-Hing Lam. 2015. Using WhatsApp and Facebook online social groups for smoking relapse prevention for recent quitters: a pilot pragmatic cluster randomized controlled trial. Journal of medical Internet research 17, 10 (2015), e238.",
      "doi": ""
    },
    {
      "text": "Arul Chib, Holley Wilkin, Leow Xue Ling, Bas Hoefman, and Hajo Van Biejma. 2012. You have an important message! Evaluating the effectiveness of a text message HIV/AIDS campaign in Northwest Uganda. Journal of health communication 17, sup1 (2012), 146–157.",
      "doi": ""
    },
    {
      "text": "Clara K Chow, Julie Redfern, Graham S Hillis, Jay Thakkar, Karla Santo, Maree L Hackett, Stephen Jan, Nicholas Graves, Laura de Keizer, Tony Barry, 2015. Effect of lifestyle-focused text messaging on risk factor modification in patients with coronary heart disease: a randomized clinical trial. Jama 314, 12 (2015), 1255–1263.",
      "doi": ""
    },
    {
      "text": "Haley Cooper, Susan Reif, Sara Shilling, and Elena Wilson. 2020. Social media support group: Implementation and evaluation. AIDS care (2020), 1–5.",
      "doi": ""
    },
    {
      "text": "Christopher Damulira, Miriam N Mukasa, William Byansi, Proscovia Nabunya, Apollo Kivumbi, Phionah Namatovu, Flavia Namuwonge, Daji Dvalishvili, Ozge Sensoy Bahar, and Fred M Ssewamala. 2019. Examining the relationship of social support and family cohesion on ART adherence among HIV-positive adolescents in southern Uganda: baseline findings. Vulnerable children and youth studies 14, 2 (2019), 181–190.",
      "doi": ""
    },
    {
      "text": "Dorothy E Dow, Elizabeth L Turner, Aisa M Shayo, Blandina Mmbaga, Coleen K Cunningham, and Karen O’Donnell. 2016. Evaluating mental health difficulties and associated outcomes among HIV-positive adolescents in Tanzania. AIDS care 28, 7 (2016), 825–833.",
      "doi": ""
    },
    {
      "text": "Alison L Drake, Jennifer A Unger, Keshet Ronen, Daniel Matemo, Trevor Perrier, Brian DeRenzi, Barbra A Richardson, John Kinuthia, and Grace John-Stewart. 2017. Evaluation of mHealth strategies to optimize adherence and efficacy of Option B+ prevention of mother-to-child HIV transmission: Rationale, design and methods of a 3-armed randomized controlled trial. Contemporary clinical trials 57 (2017), 44–50.",
      "doi": ""
    },
    {
      "text": "Lisa Dulli, Kathleen Ridgeway, Catherine Packer, Kate R Murray, Tolulope Mumuni, Kate F Plourde, Mario Chen, Adesola Olumide, Oladosu Ojengbede, and Donna R McCarraher. 2020. A Social Media–Based Support Group for Youth Living With HIV in Nigeria (SMART Connections): Randomized Controlled Trial. Journal of Medical Internet Research 22, 6 (2020), e18343.",
      "doi": ""
    },
    {
      "text": "Lisa Dulli, Kathleen Ridgeway, Catherine Packer, Kate F Plourde, Tolulope Mumuni, Tosin Idaboh, Adesola Olumide, Oladosu Ojengbede, and Donna R McCarraher. 2018. An online support group intervention for adolescents living with HIV in Nigeria: a pre-post test study. JMIR public health and surveillance 4, 4 (2018), e12397.",
      "doi": ""
    },
    {
      "text": "Tabor E Flickinger, Claire DeBolt, Ava Lena Waldman, George Reynolds, Wendy F Cohn, Mary Catherine Beach, Karen Ingersoll, and Rebecca Dillingham. 2017. Social support in a virtual community: analysis of a clinic-affiliated online support group for persons living with HIV/AIDS. AIDS and Behavior 21, 11 (2017), 3087–3099.",
      "doi": ""
    },
    {
      "text": "Victoria L Franklin, Annalu Waller, Claudia Pagliari, and Stephen A Greene. 2006. A randomized controlled trial of Sweet Talk, a text-messaging system to support young people with diabetes. Diabetic medicine 23, 12 (2006), 1332–1338.",
      "doi": ""
    },
    {
      "text": "Anna Gaysynsky, Kathryn Romansky-Poulin, and Stephen Arpadi. 2015. “My YAP Family”: analysis of a Facebook group for young adults living with HIV. AIDS and Behavior 19, 6 (2015), 947–962.",
      "doi": ""
    },
    {
      "text": "Nathan Georgette, Mark J Siedner, Carter R Petty, Brian C Zanoni, Stephen Carpenter, and Jessica E Haberer. 2017. Impact of a clinical program using weekly Short Message Service (SMS) on antiretroviral therapy adherence support in South Africa: a retrospective cohort study. BMC Medical Informatics and Decision Making 17, 1 (2017), 18.",
      "doi": ""
    },
    {
      "text": "Andrea Grimes, Martin Bednar, Jay David Bolter, and Rebecca E. Grinter. 2008. EatWell: Sharing Nutrition-Related Memories in a Low-Income Community. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (San Diego, CA, USA) (CSCW ’08). Association for Computing Machinery, New York, NY, USA, 87–96. https://doi.org/10.1145/1460563.1460579",
      "doi": "10.1145/1460563.1460579"
    },
    {
      "text": "Xinning Gui, Yu Chen, Yubo Kou, Katie Pine, and Yunan Chen. 2017. Investigating Support Seeking from Peers for Pregnancy in Online Health Communities. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–19.",
      "doi": "10.1145/3134685"
    },
    {
      "text": "Jessica E Haberer, Angella Musiimenta, Esther C Atukunda, Nicholas Musinguzi, Monique A Wyatt, Norma C Ware, and David R Bangsberg. 2016. Short message service (SMS) reminders and real-time adherence monitoring improve antiretroviral therapy adherence in rural Uganda. AIDS (London, England) 30, 8 (2016), 1295.",
      "doi": ""
    },
    {
      "text": "Brian J Hall, Ka-Lon Sou, Rachel Beanland, Mellanye Lacky, Lai Sze Tso, Qingyan Ma, Meg Doherty, and Joseph D Tucker. 2017. Barriers and facilitators to interventions improving retention in HIV care: a qualitative evidence meta-synthesis. AIDS and Behavior 21, 6 (2017), 1755–1767.",
      "doi": ""
    },
    {
      "text": "Jin Han, Xianyun Tian, Guang Yu, and Fang He. 2016. Disclosure pattern of self-labeled people living with HIV/AIDS on Chinese social networking site: an exploratory study. Cyberpsychology, Behavior, and Social Networking 19, 8(2016), 516–523.",
      "doi": ""
    },
    {
      "text": "Xi Han, Bei Li, Jiabin Qu, and Qinghua Zhu. 2018. Weibo friends with benefits for people live with HIV/AIDS? The implications of Weibo use for enacted social support, perceived social support and health outcomes. Social science & medicine 211 (2018), 157–163.",
      "doi": ""
    },
    {
      "text": "David A Hanauer, Katherine Wentzell, Nikki Laffel, and Lori M Laffel. 2009. Computerized Automated Reminder Diabetes System (CARDS): e-mail and SMS cell phone text messaging reminders to support diabetes management. Diabetes technology & therapeutics 11, 2 (2009), 99–106.",
      "doi": ""
    },
    {
      "text": "SM Taiabul Haque, Pratyasha Saha, Muhammad Sajidur Rahman, and Syed Ishtiaque Ahmed. 2019. Of Ulti, ’hajano’, and ”Matachetar otanetak datam” Exploring Local Practices of Exchanging Confidential and Sensitive Information in Urban Bangladesh. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–22.",
      "doi": ""
    },
    {
      "text": "Eric Harwit. 2017. WeChat: Social and political development of China’s dominant messaging app. Chinese Journal of Communication 10, 3 (2017), 312–327.",
      "doi": ""
    },
    {
      "text": "Kiersten Hay, L Kwardem, A Welbourn, A Namiba, S Tariq, Lynne Coventry, R Dhairyawan, and Abigail Durrant. 2020. “Support for the supporters”: a qualitative study of the use of WhatsApp by and for mentor mothers with HIV in the UK. AIDS care 32, sup2 (2020), 127–135.",
      "doi": ""
    },
    {
      "text": "Kirk D Henny, Aisha L Wilkes, Christina M McDonald, Damian J Denson, and Mary Spink Neumann. 2018. A rapid review of eHealth interventions addressing the continuum of HIV care (2007–2017). AIDS and Behavior 22, 1 (2018), 43–63.",
      "doi": ""
    },
    {
      "text": "Ruth Henwood, Gabriela Patten, Whitney Barnett, Bella Hwang, Carol Metcalf, Damian Hacking, and Lynne Wilkinson. 2016. Acceptability and use of a virtual support group for HIV-positive youth in Khayelitsha, Cape Town using the MXit social networking platform. AIDS care 28, 7 (2016), 898–903.",
      "doi": ""
    },
    {
      "text": "ZF Hu, CX Wan, Lu Xu, and Ying Huang. 2015. The effectiveness of wechat-based transitional care in patients with ankylosing spondylitis. Chin J Nurs 50, 2 (2015), 175–178.",
      "doi": ""
    },
    {
      "text": "Jina Huh. 2015. Clinical Questions in Online Health Communities: The Case of ”See Your Doctor” Threads. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work |& Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1488–1499. https://doi.org/10.1145/2675133.2675259",
      "doi": "10.1145/2675133.2675259"
    },
    {
      "text": "Jina Huh, Rupa Patel, and Wanda Pratt. 2012. Tackling Dilemmas in Supporting ’the Whole Person’ in Online Patient Communities(CHI ’12). Association for Computing Machinery, New York, NY, USA, 923–926. https://doi.org/10.1145/2207676.2208535",
      "doi": ""
    },
    {
      "text": "Jina Huh and Wanda Pratt. 2014. Weaving Clinical Expertise in Online Health Communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1355–1364. https://doi.org/10.1145/2556288.2557293",
      "doi": "10.1145/2556288.2557293"
    },
    {
      "text": "Olena Ivanova, Sammy Wambua, Jefferson Mwaisaka, Thomas Bossier, Mary Thiongo, Kristien Michielsen, and Peter Gichangi. 2019. Evaluation of the ELIMIKA Pilot Project: Improving ART adherence among HIV positive youth using an eHealth Intervention in Mombasa, Kenya. African journal of reproductive health 23, 1 (2019), 100–110.",
      "doi": ""
    },
    {
      "text": "Anirudha Joshi, Mandar Rane, Debjani Roy, Nagraj Emmadi, Padma Srinivasan, N Kumarasamy, Sanjay Pujari, Davidson Solomon, Rashmi Rodrigues, DG Saple, 2014. Supporting treatment of people living with HIV/AIDS in resource limited settings with IVRs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1595–1604.",
      "doi": "10.1145/2556288.2557236"
    },
    {
      "text": "Maged N Kamel Boulos, Dean M Giustini, and Steve Wheeler. 2016. Instagram and WhatsApp in health and healthcare: an overview. Future Internet 8, 3 (2016), 37.",
      "doi": ""
    },
    {
      "text": "Jasmeet Kaur, Asra Sakeen Wani, and Pushpendra Singh. 2019. Engagement of Pregnant Women and Mothers over WhatsApp: Challenges and Opportunities Involved. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (Austin, TX, USA) (CSCW ’19). Association for Computing Machinery, New York, NY, USA, 236–240. https://doi.org/10.1145/3311957.3359481",
      "doi": "10.1145/3311957.3359481"
    },
    {
      "text": "Natasja Kingod, Bryan Cleal, Ayo Wahlberg, and Gitte R Husted. 2017. Online peer-to-peer communities in the daily lives of people with chronic illness: a qualitative systematic review. Qualitative Health Research 27, 1 (2017), 89–99.",
      "doi": ""
    },
    {
      "text": "Lynn Kirabo, Elizabeth J Carter, and Aaron Steinfeld. 2020. ” You are asking me to pay for my legs” Exploring the Experiences, Perceptions, and Aspirations of Informal Public Transportation Users in Kampala and Kigali. In Proceedings of the 3rd ACM SIGCAS Conference on Computing and Sustainable Societies. 136–147.",
      "doi": "10.1145/3378393.3402269"
    },
    {
      "text": "Risa Kitagawa. 2015. Texting and sexual health: experimental evidence from an information intervention in Kenya. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. 1–10.",
      "doi": "10.1145/2737856.2738032"
    },
    {
      "text": "Richelle C Kosse, Marcel L Bouvy, Svetlana V Belitser, Tjalling W De Vries, Piet S Van Der Wal, and Ellen S Koster. 2019. Effective Engagement of Adolescent Asthma Patients With Mobile Health–Supporting Medication Adherence. JMIR mHealth and uHealth 7, 3 (2019), e12411.",
      "doi": ""
    },
    {
      "text": "Neha Kumar. 2014. Facebook for self-empowerment? A study of Facebook adoption in urban India. New media & society 16, 7 (2014), 1122–1137.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J Anderson. 2015. Mobile phones for maternal health in rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 427–436.",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Neha Kumar, Azra Ismail, Samyukta Sherugar, and Rajesh Chandwani. 2019. Restoration Work: Responding to Everyday Challenges of HIV Outreach. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": "10.1145/3359156"
    },
    {
      "text": "Neha Kumar, Trevor Perrier, Michelle Desmond, Kiersten Israel-Ballard, Vikrant Kumar, Sudip Mahapatra, Anil Mishra, Shreya Agarwal, Rikin Gandhi, Pallavi Lal, 2015. Projecting health: community-led video education for maternal health. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. 1–10.",
      "doi": "10.1145/2737856.2738023"
    },
    {
      "text": "Neha Kumar, Marisol Wong-Villacres, Naveena Karusala, Aditya Vishwanath, Arkadeep Kumar, and Azra Ismail. 2019. Aspirations-based design. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. 1–11.",
      "doi": "10.1145/3287098.3287117"
    },
    {
      "text": "Amanda Lazar and Emma E Dixon. 2019. Safe enough to share: Setting the dementia agenda online. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359187"
    },
    {
      "text": "Reeva Lederman, John Gleeson, Greg Wadley, Simon D’alfonso, Simon Rice, Olga Santesteban-Echarri, and Mario Alvarez-Jimenez. 2019. Support for carers of young people with mental illness: Design and trial of a technology-mediated therapy. ACM Transactions on Computer-Human Interaction (TOCHI) 26, 1(2019), 1–33.",
      "doi": "10.1145/3301421"
    },
    {
      "text": "Amnesty E LeFevre, Pierre Dane, Charles J Copley, Cara Pienaar, Annie Neo Parsons, Matt Engelhard, David Woods, Marcha Bekker, Peter Benjamin, Yogan Pillay, 2018. Unpacking the performance of a mobile health information messaging program for mothers (MomConnect) in South Africa: evidence on program reach and messaging exposure. BMJ global health 3, Suppl 2 (2018), e000583.",
      "doi": ""
    },
    {
      "text": "Richard T Lester, Paul Ritvo, Edward J Mills, Antony Kariri, Sarah Karanja, Michael H Chung, William Jack, James Habyarimana, Mohsen Sadatsafavi, Mehdi Najafzadeh, 2010. Effects of a mobile phone short message service on antiretroviral treatment adherence in Kenya (WelTel Kenya1): a randomised trial. The Lancet 376, 9755 (2010), 1838–1845.",
      "doi": ""
    },
    {
      "text": "Guo Li, Xiaomu Zhou, Tun Lu, Jiang Yang, and Ning Gu. 2016. SunForum: Understanding Depression in a Chinese Online Community. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 515–526.",
      "doi": "10.1145/2818048.2819994"
    },
    {
      "text": "Wei Li, Le Qiang Han, Yan Jun Guo, and Jing Sun. 2016. Using WeChat official accounts to improve malaria health literacy among Chinese expatriates in Niger: an intervention study. Malaria journal 15, 1 (2016), 567.",
      "doi": ""
    },
    {
      "text": "Nicole M Lockwood, Kathryn Lypen, Firas Shalabi, Manasi Kumar, Elizabeth Ngugi, and Gary W Harper. 2019. ‘Know that You are not Alone.’Influences of Social Support on Youth Newly Diagnosed with HIV in Kibera, Kenya: A Qualitative Study Informing Intervention Development. International journal of environmental research and public health 16, 5(2019), 775.",
      "doi": ""
    },
    {
      "text": "Elisa Longinetti, Vinoth Manoharan, Hala Ayoub, Pamela J Surkan, and Ziad El-Khatib. 2017. Utilization of social media and web forums by HIV patients-A cross-sectional study on adherence and reported anxiety level. Preventive medicine reports 6 (2017), 137–143.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Drashko Nakikj, and Noemie Elhadad. 2015. Collective Sensemaking in Online Health Forums. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3217–3226. https://doi.org/10.1145/2702123.2702566",
      "doi": "10.1145/2702123.2702566"
    },
    {
      "text": "Michael Massimi. 2013. Exploring remembrance and social support behavior in an online bereavement support group. In Proceedings of the 2013 conference on Computer supported cooperative work. 1169–1180.",
      "doi": "10.1145/2441776.2441908"
    },
    {
      "text": "Michael Massimi, Jackie L. Bender, Holly O. Witteman, and Osman H. Ahmed. 2014. Life Transitions and Online Health Communities: Reflecting on Adoption, Use, and Disengagement. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work |& Social Computing (Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 1491–1501. https://doi.org/10.1145/2531602.2531622",
      "doi": "10.1145/2531602.2531622"
    },
    {
      "text": "Arunesh Mathur, Brent Schlotfeldt, and Marshini Chetty. 2015. A mixed-methods study of mobile users’ data usage practices in South Africa. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 1209–1220.",
      "doi": "10.1145/2750858.2804292"
    },
    {
      "text": "Jonathan E Mayer and Paul Fontelo. 2017. Meta-analysis on the effect of text message reminders for HIV-related compliance. AIDS care 29, 4 (2017), 409–417.",
      "doi": ""
    },
    {
      "text": "Lawrence Mbuagbaw, Lehana Thabane, and Pierre Ongolo-Zogo. 2013. Opening communication channels with people living with HIV using mobile phone text messaging: insights from the CAMPS trial. BMC research notes 6, 1 (2013), 1–5.",
      "doi": ""
    },
    {
      "text": "Moira McGregor, Nicola J Bidwell, Vidya Sarangapani, Jonathan Appavoo, and Jacki O’Neill. 2019. Talking about Chat at Work in the Global South: An Ethnographic Study of Chat Use in India and Kenya. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300463"
    },
    {
      "text": "Indrani Medhi-Thies, Pedro Ferreira, Nakull Gupta, Jacki O’Neill, and Edward Cutrell. 2015. KrishiPustak: a social networking system for low-literate farmers. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 1670–1681.",
      "doi": "10.1145/2675133.2675224"
    },
    {
      "text": "Apurv Mehra, Srihari Muralidhar, Sambhav Satija, Anupama Dhareshwar, and Jacki O’Neill. 2018. Prayana: Intermediated financial management in resource-constrained settings. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173963"
    },
    {
      "text": "Jamison Merrill, Rebecca Hershow, Katherine Gannett, and Chris Barkley. 2013. Pretesting an mHealth intervention for at-risk adolescent girls in Soweto, South Africa: Studying the additive effects of SMSs on improving sexual reproductive health & rights outcomes. In Proceedings of the Sixth International Conference on Information and Communications Technologies and Development: Notes-Volume 2. 96–99.",
      "doi": "10.1145/2517899.2517933"
    },
    {
      "text": "Aslam Modak and Mambo G Mupepi. 2017. Dancing with WhatsApp: Small businesses pirouetting with social media. In CONFERENCE PROCEEDINGS BY TRACK. 51.",
      "doi": ""
    },
    {
      "text": "Maletsabisa Molapo and Gary Marsden. 2013. Health education in rural communities with locally produced and locally relevant multimedia content. In Proceedings of the 3rd ACM Symposium on Computing for Development. 1–2.",
      "doi": "10.1145/2442882.2442913"
    },
    {
      "text": "Mauricio Moura and Melissa R Michelson. 2017. WhatsApp in Brazil: mobilising voters through door-to-door and personal messages. Internet Policy Review 6, 4 (2017), 1–18.",
      "doi": ""
    },
    {
      "text": "Massy Mutumba, Victor Musiime, James M Lepkwoski, Gary W Harper, Rachel C Snow, Ken Resnicow, and Jose A Bauermeister. 2016. Examining the relationship between psychological distress and adherence to anti-retroviral therapy among Ugandan adolescents living with HIV. AIDS care 28, 7 (2016), 807–815.",
      "doi": ""
    },
    {
      "text": "Drashko Nakikj and Lena Mamykina. 2017. A Park or A Highway: Overcoming Tensions in Designing for Socio-Emotional and Informational Needs in Online Health Communities. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1304–1319. https://doi.org/10.1145/2998181.2998339",
      "doi": "10.1145/2998181.2998339"
    },
    {
      "text": "Khushnood Naqshbandi, David N Milne, Ben Davies, Sophie Potter, Rafael A Calvo, and Simon Hoermann. 2016. Helping young people going through tough times: Perspectives for a peer-to-peer chat support system. In Proceedings of the 28th Australian conference on computer-human interaction. 640–642.",
      "doi": "10.1145/3010915.3011848"
    },
    {
      "text": "Mustafa Naseem, Fouzia Younas, and Maryam Mustafa. 2020. Designing Digital Safe Spaces for Peer Support and Connectivity in Patriarchal Contexts. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–24.",
      "doi": "10.1145/3415217"
    },
    {
      "text": "Meena Natarajan and Tapan Parikh. 2013. Understanding barriers to information access and disclosure for HIV+ women. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers-Volume 1. 143–152.",
      "doi": "10.1145/2516604.2516627"
    },
    {
      "text": "Mark W. Newman, Debra Lauterbach, Sean A. Munson, Paul Resnick, and Margaret E. Morris. 2011. It’s Not That i Don’t Have Problems, i’m Just Not Putting Them on Facebook: Challenges and Opportunities in Using Online Social Networks for Health. In Proceedings of the ACM 2011 Conference on Computer Supported Cooperative Work (Hangzhou, China) (CSCW ’11). Association for Computing Machinery, New York, NY, USA, 341–350. https://doi.org/10.1145/1958824.1958876",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "Thomas A Odeny, Elizabeth A Bukusi, Craig R Cohen, Krista Yuhas, Carol S Camlin, and R Scott McClelland. 2014. Texting improves testing: a randomized trial of two-way SMS to increase postpartum prevention of mother-to-child transmission retention and infant HIV testing. AIDS (London, England) 28, 15 (2014), 2307.",
      "doi": ""
    },
    {
      "text": "Erick Oduor, Carman Neustaedter, Tejinder K Judge, Kate Hennessy, Carolyn Pang, and Serena Hillman. 2014. How technology supports family communication in rural, suburban, and urban Kenya. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2705–2714.",
      "doi": "10.1145/2556288.2557277"
    },
    {
      "text": "Kathleen O’Leary, Stephen M Schueller, Jacob O Wobbrock, and Wanda Pratt. 2018. “Suddenly, we got to become therapists for each other” Designing Peer Support Chats for Mental Health. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "Maureen Onditi. 2016. WhatsApp in Kenya: real time messaging about HIV. https://www.keycorrespondents.org/whatsapp-in-kenya-real-time-messaging-about-hiv/",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal. 2008. Computers and the promise of development: aspiration, neoliberalism and ”technolity” in India’s ICTD enterprise. A paper presented at confronting the Challenge of Technology for Development: Experiences from the BRICS(2008), 29–30.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal. 2015. Banalities turned viral: Narendra Modi and the political tweet. Television & New Media 16, 4 (2015), 378–387.",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal and Meera Lakshmanan. 2012. Assistive technology and the employment of people with vision impairments in India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development. 307–317.",
      "doi": "10.1145/2160673.2160711"
    },
    {
      "text": "Joyojeet Pal, Meera Lakshmanan, and Kentaro Toyama. 2007. “My Child will be Respected”: Parental perspectives on computers in rural India. In 2007 International Conference on Information and Communication Technologies and Development. IEEE, 1–9.",
      "doi": ""
    },
    {
      "text": "Andrea Parker, Vasudhara Kantroo, Hee Rin Lee, Miguel Osornio, Mansi Sharma, and Rebecca Grinter. 2012. Health Promotion as Activism: Building Community Capacity to Effect Social Change. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). Association for Computing Machinery, New York, NY, USA, 99–108. https://doi.org/10.1145/2207676.2207692",
      "doi": "10.1145/2207676.2207692"
    },
    {
      "text": "Sachin R Pendse, Naveena Karusala, Divya Siddarth, Pattie Gonsalves, Seema Mehrotra, John A Naslund, Mamta Sood, Neha Kumar, and Amit Sharma. 2019. Mental health in the global south: challenges and opportunities in HCI for development. In Proceedings of the 2nd ACM SIGCAS Conference on Computing and Sustainable Societies. 22–36.",
      "doi": "10.1145/3314344.3332483"
    },
    {
      "text": "Trevor Perrier, Nicola Dell, Brian DeRenzi, Richard Anderson, John Kinuthia, Jennifer Unger, and Grace John-Stewart. 2015. Engaging pregnant women in Kenya with a hybrid computer-human SMS communication system. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1429–1438.",
      "doi": "10.1145/2702123.2702124"
    },
    {
      "text": "Trevor Perrier, Elizabeth K Harrington, Keshet Ronen, Daniel Matemo, John Kinuthia, Grace John-Stewart, Richard Anderson, and Jennifer A Unger. 2018. Male partner engagement in family planning SMS conversations at Kenyan health clinics. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies. 1–11.",
      "doi": "10.1145/3209811.3209857"
    },
    {
      "text": "Gina Porter, Kate Hampshire, Albert Abane, Alister Munthali, Elsbeth Robson, Andisiwe Bango, Ariane de Lannoy, Nwabisa Gunguluza, Augustine Tanle, Samuel Owusu, 2015. Intergenerational relations and the power of the cell phone: Perspectives on young people’s phone usage in sub-Saharan Africa. Geoforum 64(2015), 37–46.",
      "doi": ""
    },
    {
      "text": "Sheri D Pruitt and JoAnne E Epping-Jordan. 2005. Preparing the 21st century global healthcare workforce. Bmj 330, 7492 (2005), 637–639.",
      "doi": ""
    },
    {
      "text": "Pranav Ramkrishnan, Aditya Vashistha, Edward Cutrell, and William Thies. 2013. DocTalk: extending doctors’ visits with personalized voice messages. In Proceedings of the 3rd ACM Symposium on Computing for Development. 1–2.",
      "doi": "10.1145/2442882.2442928"
    },
    {
      "text": "Isha Ray and Renee Kuriyan. 2010. Towards aspiration as a development indicator: the case of information and communication technologies. In Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development. 1–5.",
      "doi": "10.1145/2369220.2369256"
    },
    {
      "text": "Afsaneh Razi, Karla Badillo-Urquiola, and Pamela J Wisniewski. 2020. Let’s Talk about Sext: How Adolescents Seek Support and Advice about Their Online Sexual Experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376400"
    },
    {
      "text": "Keshet Ronen, Jennifer A Unger, Alison L Drake, Trevor Perrier, Pamela Akinyi, Lusi Osborn, Daniel Matemo, Gabrielle O’Malley, John Kinuthia, and Grace John-Stewart. 2018. SMS messaging to improve ART adherence: perspectives of pregnant HIV-infected women in Kenya on HIV-related message content. AIDS care 30, 4 (2018), 500–505.",
      "doi": ""
    },
    {
      "text": "Sabirat Rubya and Svetlana Yarosh. 2017. Interpretations of online anonymity in Alcoholics Anonymous and Narcotics Anonymous. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–22.",
      "doi": "10.1145/3134726"
    },
    {
      "text": "Sabirat Rubya and Svetlana Yarosh. 2017. Video-Mediated Peer Support in an Online Community for Recovery from Substance Use Disorders. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1454–1469. https://doi.org/10.1145/2998181.2998246",
      "doi": "10.1145/2998181.2998246"
    },
    {
      "text": "Nithya Sambasivan, Garen Checkley, Amna Batool, Nova Ahmed, David Nemer, Laura Sanely Gaytán-Lugo, Tara Matthews, Sunny Consolvo, and Elizabeth Churchill. 2018. ”Privacy is not for me, it’s for those rich women”: Performative Privacy Practices on Mobile Phones by Women in South Asia. In Fourteenth Symposium on Usable Privacy and Security ({SOUPS} 2018). 127–142.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated technology use in developing communities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2583–2592.",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Nithya Sambasivan, Paul Lee, Greg Hecht, Paul M Aoki, Maria-Ines Carrera, Jenny Chen, David Pablo Cohn, Pete Kruskall, Everett Wetchler, Michael Youssefmir, 2013. Chale, how much it cost to browse? results from a mobile data price transparency trial in Ghana. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers-Volume 1. 13–23.",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan and Thomas Smyth. 2010. The human infrastructure of ICTD. In Proceedings of the 4th ACM/IEEE international conference on information and communication technologies and development. 1–9.",
      "doi": "10.1145/2369220.2369258"
    },
    {
      "text": "Nithya Sambasivan, Julie Weber, and Edward Cutrell. 2011. Designing a phone broadcasting system for urban sex workers in India. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 267–276.",
      "doi": "10.1145/1978942.1978980"
    },
    {
      "text": "Eva Sharma and Munmun De Choudhury. 2018. Mental Health Support and Its Relationship to Linguistic Accommodation in Online Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174215",
      "doi": "10.1145/3173574.3174215"
    },
    {
      "text": "Jingyuan Shi, Xiaohui Wang, Tai-Quan Peng, and Liang Chen. 2017. Understanding interactions in virtual HIV communities: a social network analysis approach. AIDS care 29, 2 (2017), 239–243.",
      "doi": ""
    },
    {
      "text": "Ross J Simpson. 2006. Challenges for improving medication adherence. Jama 296, 21 (2006), 2614–2616.",
      "doi": ""
    },
    {
      "text": "Aneesha Singh, Jo Gibbs, and Ann Blandford. 2019. Emotion and Experience in Negotiating HIV-Related Digital Resources: ”It’s not just a runny nose!”. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300829"
    },
    {
      "text": "Piya Sorcar, Benjamin Strauber, Prashant Loyalka, Neha Kumar, and Shelley Goldman. 2017. Sidestepping the elephant in the classroom: Using culturally localized technology to teach around taboos. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 2792–2804.",
      "doi": "10.1145/3025453.3025958"
    },
    {
      "text": "Konstanze Spohrer, Garth Stahl, and Tamsin Bowers-Brown. 2018. Constituting neoliberal subjects?‘Aspiration’as technology of government in UK policy discourse. Journal of Education Policy 33, 3 (2018), 327–342.",
      "doi": ""
    },
    {
      "text": "Natalie St Clair-Sullivan, Chanda Mwamba, Jennifer Whetham, Carolyn Bolton Moore, Mary Darking, and Jaime Vera. 2019. Barriers to HIV care and adherence for young people living with HIV in Zambia and mHealth. Mhealth 5(2019).",
      "doi": ""
    },
    {
      "text": "Si Sun, Xiaomu Zhou, Joshua C Denny, Trent S Rosenbloom, and Hua Xu. 2013. Messaging to your doctors: understanding patient-provider communications via a portal system. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1739–1748.",
      "doi": "10.1145/2470654.2466230"
    },
    {
      "text": "Tamara Taggart, Mary Elisabeth Grewe, Donaldson F Conserve, Catherine Gliwa, and Malika Roman Isler. 2015. Social media and HIV: a systematic review of uses of social media in HIV communication. Journal of medical Internet research 17, 11 (2015), e248.",
      "doi": ""
    },
    {
      "text": "Kim Thomas. 2018. Wanted: a WhatsApp alternative for clinicians. Bmj 360(2018).",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2017. Design, needs, and aspirations in international development. In International Conference on Social Implications of Computers in Developing Countries. Springer, 24–32.",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2018. From needs to aspirations in information technology for development. Information Technology for Development 24, 1 (2018), 15–36.",
      "doi": ""
    },
    {
      "text": "Kentaro Toyama. 2020. Designing for aspirations. Interactions 27, 3 (2020), 61–63.",
      "doi": "10.1145/3394059"
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Neha Kumar, and Pushpendra Singh. 2018. Learning from and withMenstrupedia: Towards Menstrual Health Education in India. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 174 (Nov. 2018), 20 pages. https://doi.org/10.1145/3274443",
      "doi": "10.1145/3274443"
    },
    {
      "text": "Jennifer D Uhrig, Megan A Lewis, Carla M Bann, Jennie L Harris, Robert D Furberg, Curtis M Coomes, and Lisa M Kuhns. 2012. Addressing HIV knowledge, risk reduction, social support, and patient involvement using SMS: results of a proof-of-concept study. Journal of health communication 17, sup1 (2012), 128–145.",
      "doi": ""
    },
    {
      "text": "Aditya Vashistha, Neha Kumar, Anil Mishra, and Richard Anderson. 2017. Examining localization approaches for community health. In Proceedings of the 2017 Conference on Designing Interactive Systems. 357–368.",
      "doi": "10.1145/3064663.3064754"
    },
    {
      "text": "Tatiana A. Vlahovic, Yi-Chia Wang, Robert E. Kraut, and John M. Levine. 2014. Support Matching and Satisfaction in an Online Breast Cancer Support Community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1625–1634. https://doi.org/10.1145/2556288.2557108",
      "doi": "10.1145/2556288.2557108"
    },
    {
      "text": "Ashley Marie Walker and Michael A DeVito. 2020. ”’More gay’ fits in better”: Intracommunity Power Dynamics and Harms in Online LGBTQ+ Spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3313831.3376497"
    },
    {
      "text": "Ding Wang, Santosh D Kale, and Jacki O’Neill. 2020. Please call the specialism: Using WeChat to support patient care in China. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376274"
    },
    {
      "text": "Xiaohui Wang, Jingyuan Shi, Liang Chen, and Tai-Quan Peng. 2016. An examination of users’ influence in online HIV/AIDS communities. Cyberpsychology, Behavior, and Social Networking 19, 5(2016), 314–320.",
      "doi": ""
    },
    {
      "text": "Mark Warner, Andreas Gutmann, M Angela Sasse, and Ann Blandford. 2018. Privacy unraveling around explicit HIV status disclosure fields in the online geosocial hookup app Grindr. Proceedings of the ACM on human-computer interaction 2, CSCW(2018), 1–22.",
      "doi": "10.1145/3274450"
    },
    {
      "text": "Mark Warner, Juan F Maestre, Jo Gibbs, Chia-Fang Chung, and Ann Blandford. 2019. Signal appropriation of explicit HIV status disclosure fields in sex-social apps used by gay and bisexual men. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300922"
    },
    {
      "text": "Amy Wesolowski, Nathan Eagle, Abdisalan M Noor, Robert W Snow, and Caroline O Buckee. 2012. Heterogeneous mobile phone ownership and usage patterns in Kenya. PloS one 7, 4 (2012), e35319.",
      "doi": ""
    },
    {
      "text": "WhatsApp. [n.d.]. How to reply to a message. https://faq.whatsapp.com/general/chats/how-to-reply-to-a-message",
      "doi": ""
    },
    {
      "text": "WhatsApp. [n.d.]. How to star or unstar a message. https://faq.whatsapp.com/android/chats/how-to-star-or-unstar-a-message",
      "doi": ""
    },
    {
      "text": "Susan Wyche and Jennifer Olson. 2018. Gender, Mobile, and Mobile Internet| Kenyan Women’s Rural Realities, Mobile Internet Access, and “Africa Rising”. Information Technologies & International Development 14 (2018), 15.",
      "doi": ""
    },
    {
      "text": "Susan Wyche, Nightingale Simiyu, and Martha E Othieno. 2019. Understanding women’s mobile phone use in rural Kenya: An affordance-based approach. Mobile Media & Communication 7, 1 (2019), 94–110.",
      "doi": ""
    },
    {
      "text": "Susan P Wyche, Sarita Yardi Schoenebeck, and Andrea Forte. 2013. ”Facebook is a luxury” an exploratory study of social media use in rural Kenya. In Proceedings of the 2013 conference on Computer supported cooperative work. 33–44.",
      "doi": "10.1145/2441776.2441783"
    },
    {
      "text": "Susan P Wyche, Thomas N Smyth, Marshini Chetty, Paul M Aoki, and Rebecca E Grinter. 2010. Deliberate interactions: characterizing technology use in Nairobi, Kenya. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2593–2602.",
      "doi": "10.1145/1753326.1753719"
    },
    {
      "text": "Deepika Yadav, Prerna Malik, Kirti Dabas, and Pushpendra Singh. 2019. Feedpal: Understanding opportunities for chatbots in breastfeeding education of women in india. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–30.",
      "doi": "10.1145/3359272"
    },
    {
      "text": "Diyi Yang, Zheng Yao, Joseph Seering, and Robert Kraut. 2019. The Channel Matters: Self-Disclosure, Reciprocity and Social Support in Online Cancer Support Groups. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300261",
      "doi": "10.1145/3290605.3300261"
    },
    {
      "text": "Fouzia Younas, Mustafa Naseem, and Maryam Mustafa. 2020. Patriarchy and Social Media: Women Only Facebook Groups as Safe Spaces for Support Seeking in Pakistan. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–11.",
      "doi": "10.1145/3392561.3394639"
    },
    {
      "text": "Bingjie Yu, Leon Watts, and Katta Spiel. 2019. Caring About Dissent: Online Community Moderation and Norm Evolution. In Volunteer Work: Mapping the Future of Moderation Research-A CSCW’19 Workshop.",
      "doi": ""
    },
    {
      "text": "Tae-Jung Yun and Rosa I Arriaga. 2013. A text message a day keeps the pulmonologist away. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1769–1778.",
      "doi": "10.1145/2470654.2466233"
    },
    {
      "text": "Amy X Zhang and Justin Cranshaw. 2018. Making sense of group chat through collaborative tagging and summarization. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–27.",
      "doi": "10.1145/3274465"
    },
    {
      "text": "Xiaomu Zhou, Si Sun, and Jiang Yang. 2014. Sweet Home: understanding diabetes management via a chinese online community. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3997–4006.",
      "doi": "10.1145/2556288.2557344"
    },
    {
      "text": "Yi Yvonne Zhou, Terhilda Garrido, Homer L Chin, Andrew M Wiesenthal, and Louise L Liang. 2007. Patient access to an electronic health record with secure messaging: impact on primary care utilization. Am J Manag Care 13, 7 (2007), 418–424.",
      "doi": ""
    }
  ]
}