{
  "doi": "10.1145/3411764.3445685",
  "title": "Poros: Configurable Proxies for Distant Interactions in VR",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "A compelling property of virtual reality is that it allows users to interact with objects as they would in the real world. However, such interactions are limited to space within reach. We present Poros, a system that allows users to rearrange space. After marking a portion of space, the distant marked space is mirrored in a nearby proxy. Thereby, users can arrange what is within their reachable space, making it easy to interact with multiple distant spaces as well as nearby objects. Proxies themselves become part of the scene and can be moved, rotated, scaled, or anchored to other objects. Furthermore, they can be used in a set of higher-level interactions such as alignment and action duplication. We show how Poros enables a variety of tasks and applications and also validate its effectiveness through an expert evaluation.",
  "authors": [
    {
      "name": "Henning Pohl",
      "institution": "University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81484643749/rel-imgonly/photo.jpg",
      "acmid": "81484643749",
      "orcid": "missing"
    },
    {
      "name": "Klemen Lilija",
      "institution": "University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022087",
      "orcid": "missing"
    },
    {
      "name": "Jess McIntosh",
      "institution": "University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-99658763879/rel-imgonly/me.png",
      "acmid": "99658763879",
      "orcid": "missing"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    }
  ],
  "references": [
    {
      "text": "Parastoo Abtahi, Mar Gonzalez-Franco, Eyal Ofek, and Anthony Steed. 2019. I’m a Giant: Walking in Large Virtual Environments at High Speed Gains. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300752",
      "doi": "10.1145/3290605.3300752"
    },
    {
      "text": "Ferran Argelaguet and Carlos Andujar. 2013. A survey of 3D object selection techniques for virtual environments. Computers & Graphics 37, 3 (2013), 121–136. https://doi.org/10.1016/j.cag.2012.12.003",
      "doi": "10.1016/j.cag.2012.12.003"
    },
    {
      "text": "Hrvoje Benko and Steven Feiner. 2007. Balloon selection: A multi-finger technique for accurate low-fatigue 3d selection. In 2007 IEEE symposium on 3D user interfaces. IEEE.",
      "doi": ""
    },
    {
      "text": "Andrew Bluff. 2019. Don’t Panic: Recursive Interactions in a Miniature Metaworld. In The 17th International Conference on Virtual-Reality Continuum and Its Applications in Industry(Brisbane, QLD, Australia) (VRCAI ’19). Association for Computing Machinery, New York, NY, USA, Article 33, 9 pages. https://doi.org/10.1145/3359997.3365682",
      "doi": "10.1145/3359997.3365682"
    },
    {
      "text": "Doug A. Bowman and Larry F. Hodges. 1997. An Evaluation of Techniques for Grabbing and Manipulating Remote Objects in Immersive Virtual Environments. In Proceedings of the 1997 Symposium on Interactive 3D Graphics (Providence, Rhode Island, USA) (I3D ’97). ACM, New York, NY, USA, 35–ff.https://doi.org/10.1145/253284.253301",
      "doi": "10.1145/253284.253301"
    },
    {
      "text": "Doug A. Bowman, David Koller, and Larry F. Hodges. 1997. Travel in Immersive Virtual Environments: An Evaluation of Viewpoint Motion Control Techniques. In Proceedings of the 1997 Virtual Reality Annual International Symposium (VRAIS ’97)(VRAIS ’97). IEEE Computer Society, USA, 45.",
      "doi": ""
    },
    {
      "text": "Doug A. Bowman, Ernst Kruijff, Joseph J. LaViola, and Ivan Poupyrev. 2001. An Introduction to 3-D User Interface Design. Presence: Teleoperators and Virtual Environments 10, 1(2001), 96–108. https://doi.org/10.1162/105474601750182342",
      "doi": "10.1162/105474601750182342"
    },
    {
      "text": "Han Joo Chae, Jeong-in Hwang, and Jinwook Seo. 2018. Wall-based Space Manipulation Technique for Efficient Placement of Distant Objects in Augmented Reality. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). ACM, New York, NY, USA, 45–52. https://doi.org/10.1145/3242587.3242631",
      "doi": "10.1145/3242587.3242631"
    },
    {
      "text": "Niklas Elmqvist. 2005. BalloonProbe: Reducing Occlusion in 3D Using Interactive Space Distortion. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (Monterey, CA, USA) (VRST ’05). Association for Computing Machinery, New York, NY, USA, 134–137. https://doi.org/10.1145/1101616.1101643",
      "doi": "10.1145/1101616.1101643"
    },
    {
      "text": "Andrew Forsberg, Kenneth Herndon, and Robert Zeleznik. 1996. Aperture based selection for immersive virtual environments. In ACM Symposium on User Interface Software and Technology. Citeseer, 95–96.",
      "doi": "10.1145/237091.237105"
    },
    {
      "text": "Wolfgang Kabsch. 1976. A solution for the best rotation to relate two sets of vectors. Acta Crystallographica Section A 32, 5 (Sep 1976), 922–923. https://doi.org/10.1107/S0567739476001873",
      "doi": ""
    },
    {
      "text": "Azam Khan, George Fitzmaurice, Don Almeida, Nicolas Burtnyk, and Gordon Kurtenbach. 2004. A Remote Control Interface for Large Displays. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (Santa Fe, NM, USA) (UIST ’04). Association for Computing Machinery, New York, NY, USA, 127–136. https://doi.org/10.1145/1029632.1029655",
      "doi": "10.1145/1029632.1029655"
    },
    {
      "text": "Ioannis Kotziampasis, Nathan Sidwell, and Alan Chalmers. 2003. Portals: Increasing Visibility in Virtual Worlds. In Proceedings of the 19th Spring Conference on Computer Graphics (Budmerice, Slovakia) (SCCG ’03). Association for Computing Machinery, New York, NY, USA, 257–261. https://doi.org/10.1145/984952.984995",
      "doi": "10.1145/984952.984995"
    },
    {
      "text": "André Kunert, Alexander Kulik, Stephan Beck, and Bernd Froehlich. 2014. Photoportals: Shared References in Space and Time. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 1388–1399. https://doi.org/10.1145/2531602.2531727",
      "doi": "10.1145/2531602.2531727"
    },
    {
      "text": "Bum chul Kwon, Waqas Javed, Niklas Elmqvist, and Ji Soo Yi. 2011. Direct Manipulation through Surrogate Objects. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 627–636. https://doi.org/10.1145/1978942.1979033",
      "doi": "10.1145/1978942.1979033"
    },
    {
      "text": "H. Lee, S. Noh, and W. Woo. 2017. TunnelSlice: Freehand Subspace Acquisition Using an Egocentric Tunnel for Wearable Augmented Reality. IEEE Transactions on Human-Machine Systems 47, 1 (Feb 2017), 128–139. https://doi.org/10.1109/THMS.2016.2611821",
      "doi": ""
    },
    {
      "text": "Klemen Lilija, Henning Pohl, Sebastian Boring, and Kasper Hornbæk. 2019. Augmented Reality Views for Occluded Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 446, 12 pages. https://doi.org/10.1145/3290605.3300676",
      "doi": "10.1145/3290605.3300676"
    },
    {
      "text": "James Liu, Hirav Parekh, Majed Al-Zayer, and Eelke Folmer. 2018. Increasing Walking in VR Using Redirected Teleportation. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 521–529. https://doi.org/10.1145/3242587.3242601",
      "doi": "10.1145/3242587.3242601"
    },
    {
      "text": "Daniel Mendes, Daniel Medeiros, Eduardo Cordeiro, Maurício Sousa, Alfredo Ferreira, and Joaquim Jorge. 2017. PRECIOUS! Out-of-reach selection using iterative refinement in VR. In 2017 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 237–238.",
      "doi": ""
    },
    {
      "text": "Mark R. Mine, Frederick P. Brooks, and Carlo H. Sequin. 1997. Moving Objects in Space: Exploiting Proprioception in Virtual-Environment Interaction. In Proceedings of the 24th Annual Conference on Computer Graphics and Interactive Techniques(SIGGRAPH ’97). ACM Press/Addison-Wesley Publishing Co., USA, 19–26. https://doi.org/10.1145/258734.258747",
      "doi": "10.1145/258734.258747"
    },
    {
      "text": "Roberto A. Montano Murillo, Sriram Subramanian, and Diego Martinez Plasencia. 2017. Erg-O: Ergonomic Optimization of Immersive Virtual Environments. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 759–771. https://doi.org/10.1145/3126594.3126605",
      "doi": "10.1145/3126594.3126605"
    },
    {
      "text": "Alex Olwal and Steven Feiner. 2003. The Flexible Pointer: An Interaction Technique for Selection in Augmented and Virtual Reality. In Proc. UIST’03. 81–82.",
      "doi": ""
    },
    {
      "text": "Randy Pausch, Tommy Burnette, Dan Brockway, and Michael E. Weiblen. 1995. Navigation and Locomotion in Virtual Worlds via Flight into Hand-Held Miniatures. In Proceedings of the 22nd Annual Conference on Computer Graphics and Interactive Techniques(SIGGRAPH ’95). Association for Computing Machinery, New York, NY, USA, 399–400. https://doi.org/10.1145/218380.218495",
      "doi": "10.1145/218380.218495"
    },
    {
      "text": "Randy Pausch, Dennis Proffitt, and George Williams. 1997. Quantifying Immersion in Virtual Reality. In Proceedings of the 24th Annual Conference on Computer Graphics and Interactive Techniques(SIGGRAPH ’97). ACM Press/Addison-Wesley Publishing Co., USA, 13–18. https://doi.org/10.1145/258734.258744",
      "doi": "10.1145/258734.258744"
    },
    {
      "text": "Ken Perlin and David Fox. 1993. Pad: An Alternative Approach to the Computer Interface. In Proceedings of the 20th Annual Conference on Computer Graphics and Interactive Techniques (Anaheim, CA) (SIGGRAPH ’93). Association for Computing Machinery, New York, NY, USA, 57–64. https://doi.org/10.1145/166117.166125",
      "doi": "10.1145/166117.166125"
    },
    {
      "text": "Ken Pfeuffer, Benedikt Mayer, Diako Mardanbegi, and Hans Gellersen. 2017. Gaze + Pinch Interaction in Virtual Reality. In Proceedings of the 5th Symposium on Spatial User Interaction (Brighton, United Kingdom) (SUI ’17). Association for Computing Machinery, New York, NY, USA, 99–108. https://doi.org/10.1145/3131277.3132180",
      "doi": "10.1145/3131277.3132180"
    },
    {
      "text": "Jeffrey S. Pierce, Andrew S. Forsberg, Matthew J. Conway, Seung Hong, Robert C. Zeleznik, and Mark R. Mine. 1997. Image plane interaction techniques in 3D immersive environments. In Proceedings of the 1997 symposium on Interactive 3D graphics. ACM, 39–ff.",
      "doi": "10.1145/253284.253303"
    },
    {
      "text": "J. S. Pierce and R. Pausch. 2004. Navigation with place representations and visible landmarks. In IEEE Virtual Reality 2004. 173–288. https://doi.org/10.1109/VR.2004.1310071",
      "doi": ""
    },
    {
      "text": "Jeffrey S. Pierce, Brian C. Stearns, and Randy Pausch. 1999. Voodoo Dolls: Seamless Interaction at Multiple Scales in Virtual Environments. In Proceedings of the 1999 Symposium on Interactive 3D Graphics (Atlanta, Georgia, USA) (I3D ’99). Association for Computing Machinery, New York, NY, USA, 141–145. https://doi.org/10.1145/300523.300540",
      "doi": "10.1145/300523.300540"
    },
    {
      "text": "Thammathip Piumsomboon, Gun A. Lee, Andrew Irlitti, Barrett Ens, Bruce H. Thomas, and Mark Billinghurst. 2019. On the Shoulder of the Giant: A Multi-Scale Mixed Reality Collaboration with 360 Video Sharing and Tangible Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3290605.3300458",
      "doi": "10.1145/3290605.3300458"
    },
    {
      "text": "Ivan Poupyrev, Mark Billinghurst, Suzanne Weghorst, and Tadao Ichikawa. 1996. The go-go interaction technique: non-linear mapping for direct manipulation in VR. In ACM Symposium on User Interface Software and Technology. Citeseer, 79–80.",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "Christian Sandor, Arindam Dey, Andrew Cunningham, Sebastien Barbier, Ulrich Eck, Donald Urquhart, Michael R. Marner, Graeme Jarvis, and Sang Rhee. 2010. Egocentric space-distorting visualizations for rapid environment exploration in mobile mixed reality. In 2010 IEEE Virtual Reality Conference (VR). 47–50. https://doi.org/10.1109/VR.2010.5444815",
      "doi": "10.1109/VR.2010.5444815"
    },
    {
      "text": "Frank Steinicke, Timo Ropinski, and Klaus Hinrichs. 2006. Object selection in virtual environments using an improved virtual pointer metaphor. In Computer Vision and Graphics. Springer, 320–326.",
      "doi": ""
    },
    {
      "text": "Richard Stoakley, Matthew J. Conway, and Randy Pausch. 1995. Virtual reality on a WIM: interactive worlds in miniature. In CHI, Vol. 95. 265–272.",
      "doi": ""
    },
    {
      "text": "Stanislav L. Stoev and Dieter Schmalstieg. 2002. Application and Taxonomy of Through-the-Lens Techniques. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (Hong Kong, China) (VRST ’02). Association for Computing Machinery, New York, NY, USA, 57–64. https://doi.org/10.1145/585740.585751",
      "doi": "10.1145/585740.585751"
    },
    {
      "text": "R. Trueba, C. Andujar, and F. Argelaguet. 2009. Multi-Scale Manipulation in Indoor Scenes with the World in Miniature Metaphor. In Proceedings of the 15th Joint Virtual Reality Eurographics Conference on Virtual Environments(Lyon, France) (JVRC’09). Eurographics Association, Goslar, DEU, 93–100.",
      "doi": ""
    },
    {
      "text": "Hans Peter Wyss, Roland Blach, and Matthias Bues. 2006. iSith-Intersection-based spatial interaction for two hands. In 3D User Interfaces (3DUI’06). IEEE, 59–61.",
      "doi": ""
    },
    {
      "text": "Haijun Xia, Sebastian Herscher, Ken Perlin, and Daniel Wigdor. 2018. Spacetime: Enabling Fluid Individual and Collaborative Editing in Virtual Reality. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 853–866. https://doi.org/10.1145/3242587.3242597",
      "doi": "10.1145/3242587.3242597"
    },
    {
      "text": "Yuhang Zhao, Edward Cutrell, Christian Holz, Meredith Ringel Morris, Eyal Ofek, and Andrew D. Wilson. 2019. SeeingVR: A Set of Tools to Make Virtual Reality More Accessible to People with Low Vision. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 111, 14 pages. https://doi.org/10.1145/3290605.3300341",
      "doi": "10.1145/3290605.3300341"
    }
  ]
}