{
  "doi": "10.1145/3411764.3445219",
  "title": "AI as Social Glue: Uncovering the Roles of Deep Generative AI during Social Music Composition",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Recent advances in deep generative neural networks have made it possible for artificial intelligence to actively collaborate with human beings in co-creating novel content (e.g. music, art). While substantial research focuses on (individual) human-AI collaborations, comparatively less research examines how AI can play a role in human-human collaborations during co-creation. In a qualitative lab study, we observed 30 participants (15 pairs) compose a musical phrase in pairs, both with and without AI. Our findings reveal that AI may play important roles in influencing human social dynamics during creativity, including: 1) implicitly seeding a common ground at the start of collaboration, 2) acting as a psychological safety net in creative risk-taking, 3) providing a force for group progress, 4) mitigating interpersonal stalling and friction, and 5) altering users’ collaborative and creative roles. This work contributes to the future of generative AI in social creativity by providing implications for how AI could enrich, impede, or alter creative social dynamics in the years to come.",
  "authors": [
    {
      "name": "Minhyang (Mia) Suh",
      "institution": "Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706667",
      "orcid": "missing"
    },
    {
      "name": "Emily Youngblom",
      "institution": "Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701123",
      "orcid": "missing"
    },
    {
      "name": "Michael Terry",
      "institution": "Google Research, Brain Team, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100295906",
      "orcid": "0000-0003-1941-939X"
    },
    {
      "name": "Carrie J Cai",
      "institution": "Google, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659349280",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nuha Albadi, Maram Kurdi, and Shivakant Mishra. 2019. Hateful People or Hateful Bots? Detection and Characterization of Bots Spreading Religious Hatred in Arabic Social Media. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–25.",
      "doi": ""
    },
    {
      "text": "Cecilia R. Aragon and Alison Williams. 2011. Collaborative Creativity: A Complex Systems Model with Distributed Affect. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 1875–1884. https://doi.org/10.1145/1978942.1979214",
      "doi": ""
    },
    {
      "text": "Zahra Ashktorab, Mohit Jain, Q. Vera Liao, and Justin D. Weisz. 2019. Resilient Chatbots: Repair Strategy Preferences for Conversational Breakdowns. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300484",
      "doi": "10.1145/3290605.3300484"
    },
    {
      "text": "Markus Baer and Michael Frese. 2003. Innovation is not enough: Climates for initiative and psychological safety, process innovations, and firm performance. Journal of Organizational Behavior: The International Journal of Industrial, Occupational and Organizational Psychology and Behavior 24, 1(2003), 45–68.",
      "doi": ""
    },
    {
      "text": "Jared S. Bauer, Aubury L. Jellenek, and Julie A. Kientz. 2018. Reflektor: An Exploration of Collaborative Music Playlist Creation for Social Context. In Proceedings of the 2018 ACM Conference on Supporting Groupwork (Sanibel Island, Florida, USA) (GROUP ’18). Association for Computing Machinery, New York, NY, USA, 27–38. https://doi.org/10.1145/3148330.3148331",
      "doi": "10.1145/3148330.3148331"
    },
    {
      "text": "Erin Beneteau, Ashley Boone, Yuxing Wu, Julie A Kientz, Jason Yip, and Alexis Hiniker. 2020. Parenting with Alexa: Exploring the Introduction of Smart Speakers on Family Dynamics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376344"
    },
    {
      "text": "Steve Benford, Peter Tolmie, Ahmed Y. Ahmed, Andy Crabtree, and Tom Rodden. 2012. Supporting Traditional Music-Making: Designing for Situated Discretion. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’12). Association for Computing Machinery, New York, NY, USA, 127–136. https://doi.org/10.1145/2145204.2145227",
      "doi": "10.1145/2145204.2145227"
    },
    {
      "text": "Tina Blaine and Tim Perkis. 2000. The Jam-O-Drum Interactive Music System: A Study in Interaction Design. In Proceedings of the 3rd Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (New York City, New York, USA) (DIS ’00). Association for Computing Machinery, New York, NY, USA, 165–173. https://doi.org/10.1145/347642.347705",
      "doi": "10.1145/347642.347705"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic Analysis. In APA handbook of research methods in psychology), D. L. Long A. T. Panter D. Rindskopf & K. J. Sher H. Cooper, P. M. Camic (Ed.). American Psychological Association, 51–74.",
      "doi": ""
    },
    {
      "text": "Alex Calderwood, Katy Ilonka Gero, and Lydia B. Chilton. 2020. How Novellists use Generative Language Models: An Exploratory User Study. In IUI Workshops.",
      "doi": ""
    },
    {
      "text": "Lydia B Chilton, Savvas Petridis, and Maneesh Agrawala. 2019. VisiBlends: A flexible workflow for visual blends. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300402"
    },
    {
      "text": "Elizabeth Clark, Anne Spencer Ross, Chenhao Tan, Yangfeng Ji, and Noah A Smith. 2018. Creative writing with a machine in the loop: Case studies on slogans and stories. In 23rd International Conference on Intelligent User Interfaces. 329–340.",
      "doi": "10.1145/3172944.3172983"
    },
    {
      "text": "Herbert H Clark and SE Brennan. 1991. Grounding in communication. LB Resnick, RM Levine, SD Teasley, eds. Perspectives on Socially Shared Cognition(1991).",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors. 2020. Dixit (card game). Retrieved September 8, 2020 from https://en.wikipedia.org/w/index.php?title=Dixit_(card_game)&oldid=908027531",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors. 2020. Emily Howell. Retrieved September 17, 2020 from https://en.wikipedia.org/wiki/Emily_Howell",
      "doi": ""
    },
    {
      "text": "David Cope. 2005. Computer models of musical creativity. MIT Press Cambridge.",
      "doi": ""
    },
    {
      "text": "D. M. Cunningham, S. J. & Nichols. 2009. Exploring social music behaviour: An investigation of music selection at parties. In Proceeding of 10th International Society for Music Information Retrieval Conference. 747–752.",
      "doi": ""
    },
    {
      "text": "Nicholas Davis, Chih-PIn Hsiao, Kunwar Yashraj Singh, Lisa Li, and Brian Magerko. 2016. Empirically studying participatory sense-making in abstract drawing with a co-creative cognitive agent. In Proceedings of the 21st International Conference on Intelligent User Interfaces. 196–207.",
      "doi": "10.1145/2856767.2856795"
    },
    {
      "text": "Amy Edmondson. 1999. Psychological safety and learning behavior in work teams. Administrative science quarterly 44, 2 (1999), 350–383.",
      "doi": ""
    },
    {
      "text": "Judith E Fan, Monica Dinculescu, and David Ha. 2019. collabdraw: an environment for collaborative sketching with an artificial agent. In Proceedings of the 2019 on Creativity and Cognition. 556–561.",
      "doi": "10.1145/3325480.3326578"
    },
    {
      "text": "Robin Fencott and Nick Bryan-Kinns. 2010. Hey Man, You’re Invading my Personal Space! Privacy and Awareness in Collaborative Music.. In NIME. Citeseer, 198–203.",
      "doi": ""
    },
    {
      "text": "Rebecca Anne Fiebrink. 2011. Real-time human interaction with supervised learning algorithms for music composition and performance. Citeseer.",
      "doi": ""
    },
    {
      "text": "Gerhard Fischer and Frank Shipman. 2013. Collaborative design rationale and social creativity in cultures of participation. In Creativity and Rationale. Springer, 423–447.",
      "doi": ""
    },
    {
      "text": "Jonas Frich, Michael Mose Biskjaer, and Peter Dalsgaard. 2018. Twenty Years of Creativity Research in Human-Computer Interaction: Current State and Future Directions. In Proceedings of the 2018 Designing Interactive Systems Conference. 1235–1257.",
      "doi": "10.1145/3196709.3196732"
    },
    {
      "text": "Marco Furini, Silvia Mirri, Manuela Montangero, and Catia Prandi. 2020. On the Usage of Smart Speakers During the Covid-19 Coronavirus Lockdown. In Proceedings of the 6th EAI International Conference on Smart Objects and Technologies for Social Good. 187–192.",
      "doi": "10.1145/3411170.3411260"
    },
    {
      "text": "Katy Ilonka Gero and Lydia B Chilton. 2019. Metaphoria: An Algorithmic Companion for Metaphor Creation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300526"
    },
    {
      "text": "Wooi Boon Goh, Lijia Yang, and Kian Leong Ong. 2016. MuSeeCol: A See-through Multi-Touch Surface for Face-to-Face Musical Collaboration. In Proceedings of the 13th International Conference on Advances in Computer Entertainment Technology (Osaka, Japan) (ACE ’16). Association for Computing Machinery, New York, NY, USA, Article 15, 6 pages. https://doi.org/10.1145/3001773.3001788",
      "doi": "10.1145/3001773.3001788"
    },
    {
      "text": "Matthew Guzdial, Nicholas Liao, Jonathan Chen, Shao-Yu Chen, Shukan Shah, Vishwa Shah, Joshua Reno, Gillian Smith, and Mark O Riedl. 2019. Friend, collaborator, student, manager: How design of an ai-driven game level editor affects creators. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300854"
    },
    {
      "text": "Gaëtan Hadjeres, François Pachet, and Frank Nielsen. 2017. Deepbach: a steerable model for bach chorales generation. In International Conference on Machine Learning. PMLR, 1362–1371.",
      "doi": ""
    },
    {
      "text": "Jeffrey T Hancock, Mor Naaman, and Karen Levy. 2020. AI-Mediated Communication: Definition, Research Agenda, and Ethical Considerations. Journal of Computer-Mediated Communication 25, 1 (2020), 89–100.",
      "doi": ""
    },
    {
      "text": "Michael T Hopkins. 2015. Collaborative composing in high school string chamber music ensembles. Journal of Research in Music Education 62, 4 (2015), 405–424.",
      "doi": ""
    },
    {
      "text": "Cheng-Zhi Anna Huang, Tim Cooijmans, Adam Roberts, Aaron Courville, and Douglas Eck. 2019. Counterpoint by convolution. In Proceedings of the 18th International Society for Music Information Retrieval Conference, ISMIR 2017.",
      "doi": ""
    },
    {
      "text": "Cheng-Zhi Anna Huang, David Duvenaud, and Krzysztof Z Gajos. 2016. Chordripple: Recommending chords to help novice composers go beyond the ordinary. In Proceedings of the 21st International Conference on Intelligent User Interfaces. 241–250.",
      "doi": "10.1145/2856767.2856792"
    },
    {
      "text": "Cheng-Zhi Anna Huang, Curtis Hawthorne, Adam Roberts, Monica Dinculescu, James Wexler, Leon Hong, and Jacob Howcroft. 2019. The bach doodle: Approachable music composition with machine learning at scale. arXiv preprint arXiv:1907.06637(2019).",
      "doi": ""
    },
    {
      "text": "Cheng-Zhi Anna Huang, Ashish Vaswani, Jakob Uszkoreit, Ian Simon, Curtis Hawthorne, Noam Shazeer, Andrew M Dai, Matthew D Hoffman, Monica Dinculescu, and Douglas Eck. 2018. Music transformer: Generating music with long-term structure. In International Conference on Learning Representations.",
      "doi": ""
    },
    {
      "text": "Koops Hendrik Vincent Huang, Cheng-Zhi Anna, Ed Newton-Rex, Monica Dinculescu, and Carrie J. Cai. 2020. AI Song Contest: Human-AI Co-creation in Songwriting. (2020).",
      "doi": ""
    },
    {
      "text": "Mikhail Jacob and Brian Magerko. 2015. Interaction-based Authoring for Scalable Co-creative Agents.. In ICCC. 236–243.",
      "doi": ""
    },
    {
      "text": "Mikhail Jacob and Brian Magerko. 2018. Creative arcs in improvised human-computer embodied performances. In Proceedings of the 13th International Conference on the Foundations of Digital Games. 1–6.",
      "doi": "10.1145/3235765.3235827"
    },
    {
      "text": "Irving L Janis. 2008. Groupthink. IEEE Engineering Management Review 36, 1 (2008), 36.",
      "doi": ""
    },
    {
      "text": "Sergi Jordà, Günter Geiger, Marcos Alonso, and Martin Kaltenbrunner. 2007. The ReacTable: Exploring the Synergy between Live Music Performance and Tabletop Tangible Interfaces. In Proceedings of the 1st International Conference on Tangible and Embedded Interaction (Baton Rouge, Louisiana) (TEI ’07). Association for Computing Machinery, New York, NY, USA, 139–146. https://doi.org/10.1145/1226969.1226998",
      "doi": "10.1145/1226969.1226998"
    },
    {
      "text": "Malte F. Jung, Nikolas Martelaro, and Pamela J. Hinds. 2015. Using Robots to Moderate Team Conflict: The Case of Repairing Violations. In Proceedings of the Tenth Annual ACM/IEEE International Conference on Human-Robot Interaction(Portland, Oregon, USA) (HRI ’15). Association for Computing Machinery, New York, NY, USA, 229–236. https://doi.org/10.1145/2696454.2696460",
      "doi": "10.1145/2696454.2696460"
    },
    {
      "text": "Pegah Karimi, Mary Lou Maher, Nicholas Davis, and Kazjon Grace. 2019. Deep Learning in a Computational Model for Conceptual Shifts in a Co-Creative Design System. arXiv preprint arXiv:1906.10188(2019).",
      "doi": ""
    },
    {
      "text": "Pegah Karimi, Jeba Rezwana, Safat Siddiqui, Mary Lou Maher, and Nasrin Dehbozorgi. 2020. Creative sketching partner: an analysis of human-AI co-creativity. In Proceedings of the 25th International Conference on Intelligent User Interfaces. 221–230.",
      "doi": "10.1145/3377325.3377522"
    },
    {
      "text": "Charles Kiene and Benjamin Mako Hill. 2020. Who Uses Bots? A Statistical Analysis of Bot Usage in Moderation Teams. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3334480.3382960"
    },
    {
      "text": "Michael Klug and James P Bagrow. 2016. Understanding the group dynamics and success of teams. Royal Society open science 3, 4 (2016), 160007.",
      "doi": ""
    },
    {
      "text": "Janin Koch, Andrés Lucero, Lena Hegemann, and Antti Oulasvirta. 2019. May AI? Design ideation with cooperative contextual bandits. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300863"
    },
    {
      "text": "Max Kreminski, Melanie Dickinson, Michael Mateas, and Noah Wardrip-Fruin. 2020. Why Are We Like This?: The AI Architecture of a Co-Creative Storytelling Game. In Proceedings of the Fifteenth International Conference on the Foundations of Digital Games.",
      "doi": "10.1145/3402942.3402953"
    },
    {
      "text": "Kenneth Lee. 2004. Principles of Metadesign: Processes and Levels of Co-Creation in the New Design Space. Ph.D. Dissertation. University of Plymouth, Plymouth, UK. Advisor(s) Giaccardi, Elisa. CAiiA-STAR.",
      "doi": ""
    },
    {
      "text": "Yi-Chieh Lee, Naomi Yamashita, and Yun Huang. 2020. Designing a Chatbot as a Mediator for Promoting Deep Self-Disclosure to a Real Mental Health Professional. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–27.",
      "doi": "10.1145/3392836"
    },
    {
      "text": "Zhuying Li, Yan Wang, Wei Wang, Stefan Greuter, and Florian’Floyd’ Mueller. 2020. Empowering a Creative City: Engage Citizens in Creating Street Art through Human-AI Collaboration. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3334480.3382976"
    },
    {
      "text": "Yuyu Lin, Jiahao Guo, Yang Chen, Cheng Yao, and Fangtian Ying. 2020. It Is Your Turn: Collaborative Ideation With a Co-Creative Robot through Sketch. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376258"
    },
    {
      "text": "Duri Long, Mikhail Jacob, and Brian Magerko. 2019. Designing co-creative ai for public spaces. In Proceedings of the 2019 on Creativity and Cognition. 271–284.",
      "doi": "10.1145/3325480.3325504"
    },
    {
      "text": "Duri Long, Lucas Liu, Swar Gujrania, Cassandra Naomi, and Brian Magerko. 2020. Visualizing Improvisation in LuminAI, an AI Partner for Co-Creative Dance. In Proceedings of the 7th International Conference on Movement and Computing. 1–2.",
      "doi": "10.1145/3401956.3404258"
    },
    {
      "text": "Ryan Louie, Andy Coenen, Cheng Zhi Huang, Michael Terry, and Carrie J. Cai. 2020. Novice-AI Music Co-Creation via AI-Steering Tools for Deep Generative Models. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376739",
      "doi": "10.1145/3313831.3376739"
    },
    {
      "text": "Kai Lukoff, Taoxi Li, Yuan Zhuang, and Brian Y Lim. 2018. TableChat: mobile food journaling to facilitate family support for healthy eating. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–28.",
      "doi": "10.1145/3274383"
    },
    {
      "text": "Michal Luria, Joseph Seering, Jodi Forlizzi, and John Zimmerman. 2020. Designing Chatbots as Community-Owned Agents. In Proceedings of the 2nd Conference on Conversational User Interfaces. 1–3.",
      "doi": "10.1145/3405755.3406134"
    },
    {
      "text": "Mao Mao, Alan F. Blackwell, Johanna M. Lukate, and David A. Good. 2016. Supporting Retirement Socially and Musically by Technology: An Ethnographic Study of Local Community Musicians. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (San Jose, California, USA) (CHI EA ’16). Association for Computing Machinery, New York, NY, USA, 2886–2892. https://doi.org/10.1145/2851581.2892285",
      "doi": "10.1145/2851581.2892285"
    },
    {
      "text": "Evandro Manara Miletto, Luciano Vargas Flores, Marcelo Soares Pimenta, Jerome Rutily, and Leonardo Santagada. 2007. Interfaces for Musical Activities and Interfaces for Musicians Are Not the Same: The Case for Codes, a Web-Based Environment for Cooperative Music Prototyping. In Proceedings of the 9th International Conference on Multimodal Interfaces (Nagoya, Aichi, Japan) (ICMI ’07). Association for Computing Machinery, New York, NY, USA, 201–207. https://doi.org/10.1145/1322192.1322228",
      "doi": "10.1145/1322192.1322228"
    },
    {
      "text": "Changhoon Oh, Jungwoo Song, Jinhan Choi, Seonghyeon Kim, Sungwoo Lee, and Bongwon Suh. 2018. I lead, you help but only with enough details: Understanding user experience of co-creation with artificial intelligence. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174223"
    },
    {
      "text": "Alex Osborn. 2012. Applied imagination-principles and procedures of creative writing. Read Books Ltd.",
      "doi": ""
    },
    {
      "text": "Sunjeong Park and Youn-kyung Lim. 2020. Investigating User Expectations on the Roles of Family-Shared AI Speakers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376450",
      "doi": "10.1145/3313831.3376450"
    },
    {
      "text": "Paul B Paulus and Bernard A Nijstad. 2003. Group creativity: Innovation through collaboration. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Maria B Rasmussen, Martin G Tolsgaard, Peter Dieckmann, Doris Østergaard, Jonathan White, Pernille Plenge, and Charlotte V Ringsted. 2020. Social ties influence teamwork when managing clinical emergencies. BMC medical education 20, 1 (2020), 1–7.",
      "doi": ""
    },
    {
      "text": "Adam Roberts, Curtis Hawthorne, and Ian Simon. 2018. Magenta. js: A javascript api for augmenting creativity with deep learning. (2018).",
      "doi": ""
    },
    {
      "text": "Aleksandra Sarcevic, Ivan Marsic, and Randall S. Burd. 2020. Challenges for AI Approaches to Activity Recognition in Teamwork. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": ""
    },
    {
      "text": "Frederick Seddon. 2006. Collaborative computer-mediated music composition in cyberspace. British Journal of Music Education 23, 3 (2006), 273–283.",
      "doi": ""
    },
    {
      "text": "Isabella Seeber, Eva Bittner, Robert O Briggs, Triparna de Vreede, Gert-Jan De Vreede, Aaron Elkins, Ronald Maier, Alexander B Merz, Sarah Oeste-Reiß, Nils Randrup, 2020. Machines as teammates: A research agenda on AI in team collaboration. Information & management 57, 2 (2020), 103174.",
      "doi": ""
    },
    {
      "text": "Joseph Seering, Juan Pablo Flores, Saiph Savage, and Jessica Hammer. 2018. The social roles of bots: evaluating impact of bots on discussions in online communities. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–29.",
      "doi": "10.1145/3274426"
    },
    {
      "text": "Yang Shi, Nan Cao, Xiaojuan Ma, Siji Chen, and Pei Liu. 2020. EmoG: Supporting the Sketching of Emotional Expressions for Storyboarding. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376520"
    },
    {
      "text": "Enno Siemsen, Aleda V Roth, Sridhar Balasubramanian, and Gopesh Anand. 2009. The influence of psychological safety and confidence in knowledge on employee knowledge sharing. Manufacturing & Service Operations Management 11, 3(2009), 429–447.",
      "doi": "10.1287/msom.1080.0233"
    },
    {
      "text": "Ian Simon, Dan Morris, and Sumit Basu. 2008. MySong: automatic accompaniment generation for vocal melodies. In Proceedings of the SIGCHI conference on human factors in computing systems. 725–734.",
      "doi": "10.1145/1357054.1357169"
    },
    {
      "text": "Renee Tynan. 2005. The effects of threat sensitivity and face giving on dyadic psychological safety and upward communication 1. Journal of Applied Social Psychology 35, 2 (2005), 223–247.",
      "doi": ""
    },
    {
      "text": "Dakuo Wang, Elizabeth Churchill, Pattie Maes, Xiangmin Fan, Ben Shneiderman, Yuanchun Shi, and Qianying Wang. 2020. From Human-Human Collaboration to Human-AI Collaboration: Designing AI Systems That Can Work Together with People. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3334480.3381069"
    },
    {
      "text": "Mairieli Wessel, Bruno Mendes De Souza, Igor Steinmacher, Igor S Wiese, Ivanilton Polato, Ana Paula Chaves, and Marco A Gerosa. 2018. The power of bots: Characterizing and understanding bots in oss projects. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–19.",
      "doi": "10.1145/3274451"
    },
    {
      "text": "Christine Wolf and Jeanette Blomberg. 2019. Evaluating the promise of human-algorithm collaborations in everyday work practices. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–23.",
      "doi": "10.1145/3359245"
    },
    {
      "text": "Deepika Yadav, Prerna Malik, Kirti Dabas, and Pushpendra Singh. 2019. Feedpal: Understanding opportunities for chatbots in breastfeeding education of women in india. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–30.",
      "doi": "10.1145/3359272"
    },
    {
      "text": "Lei Zheng, Christopher M Albano, Neev M Vora, Feng Mai, and Jeffrey V Nickerson. 2019. The roles bots play in Wikipedia. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–20.",
      "doi": "10.1145/3359317"
    }
  ]
}