{
  "doi": "10.1145/3411764.3445698",
  "title": "MirrorBlender: Supporting Hybrid Meetings with a Malleable Video-Conferencing System",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "In hybrid meetings, multiple co-located participants communicate with remote participants through video. But video communication inhibits non-verbal cues, and this often causes remote participants to feel excluded. To address this issue, we built MirrorBlender: a What-You-See-Is-What-I-See video-conferencing system for blending, repositioning, and resizing mirrors. Mirrors here denote shared video feeds of people and screens. In a qualitative study of MirrorBlender with three hybrid meeting sessions, we found that the shared control of mirrors supported users in negotiating a blended interpersonal space. Moreover, it enabled diverse acts of inclusion of remote participants. In particular, remote participants brought attention to themselves by manipulating the position, scale, and translucency of their camera and screen feeds. Participants also embodied and leveraged their mirror images for deictic gestures and playful interactions. Based on these findings, we discuss new opportunities for supporting video-mediated collaboration.",
  "tags": [
    "video conferencing",
    "Hybrid meetings",
    "shareable dynamic media",
    "inclusive meetings",
    "blended interaction spaces"
  ],
  "authors": [
    {
      "name": "Jens Emil Grønbæk",
      "institution": "Computer Science, Aarhus University, Denmark",
      "img": "/do/10.1145/contrib-99659020791/rel-imgonly/jens_emil_72dpi_sh.png",
      "acmid": "99659020791",
      "orcid": "0000-0002-9566-7195"
    },
    {
      "name": "Banu Saatçi",
      "institution": "Digital Design and Information Studies, Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701484",
      "orcid": "missing"
    },
    {
      "name": "Carla F. Griggio",
      "institution": "Digital Design and Information Studies, Aarhus University, Denmark",
      "img": "/do/10.1145/contrib-81500663869/rel-imgonly/griggio-1.png",
      "acmid": "81500663869",
      "orcid": "missing"
    },
    {
      "name": "Clemens Nylandsted Klokmose",
      "institution": "Digital Design and Information Studies, Aarhus University, Denmark",
      "img": "/do/10.1145/contrib-81350594070/rel-imgonly/clemensikon.jpg",
      "acmid": "81350594070",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ignacio Avellino, Cédric Fleury, and Michel Beaudouin-Lafon. 2015. Accuracy of Deictic Gestures to Support Telepresence on Wall-Sized Displays. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2393–2396. https://doi.org/10.1145/2702123.2702448",
      "doi": "10.1145/2702123.2702448"
    },
    {
      "text": "Ignacio Avellino, Cédric Fleury, Wendy E. Mackay, and Michel Beaudouin-Lafon. 2017. CamRay: Camera Arrays Support Remote Collaboration on Wall-Sized Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6718–6729. https://doi.org/10.1145/3025453.3025604",
      "doi": "10.1145/3025453.3025604"
    },
    {
      "text": "Mathilde M. Bekker, Judith S. Olson, and Gary M. Olson. 1995. Analysis of Gestures in Face-to-Face Design Teams Provides Guidance for How to Use Groupware in Design. In Proceedings of the 1st Conference on Designing Interactive Systems: Processes, Practices, Methods, & Techniques (Ann Arbor, Michigan, USA) (DIS ’95). Association for Computing Machinery, New York, NY, USA, 157–166. https://doi.org/10.1145/225434.225452",
      "doi": "10.1145/225434.225452"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gail Reynard, Chris Brown, and Boriana Koleva. 1998. Understanding and constructing shared spaces with mixed-reality boundaries. ACM Transactions on computer-human interaction (TOCHI) 5, 3(1998), 185–223.",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst and Hirokazu Kato. 1999. Real World Teleconferencing. In CHI ’99 Extended Abstracts on Human Factors in Computing Systems (Pittsburgh, Pennsylvania) (CHI EA ’99). Association for Computing Machinery, New York, NY, USA, 194–195. https://doi.org/10.1145/632716.632838",
      "doi": "10.1145/632716.632838"
    },
    {
      "text": "Sara A. Bly, Steve R. Harrison, and Susan Irwin. 1993. Media Spaces: Bringing People Together in a Video, Audio, and Computing Environment. Commun. ACM 36, 1 (Jan. 1993), 28–46. https://doi.org/10.1145/151233.151235",
      "doi": "10.1145/151233.151235"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Barrett Ens, Joel Lanir, Anthony Tang, Scott Bateman, Gun Lee, Thammathip Piumsomboon, and Mark Billinghurst. 2019. Revisiting collaboration through mixed reality: The evolution of groupware. International Journal of Human-Computer Studies 131 (2019), 81–98.",
      "doi": "10.1016/j.ijhcs.2019.05.011"
    },
    {
      "text": "Rachel Franklin. 2017. Facebook spaces: A new way to connect with friends in vr. https://about.fb.com/news/2017/04/facebook-spaces/.",
      "doi": ""
    },
    {
      "text": "Susan R. Fussell, Leslie D. Setlock, Jie Yang, Jiazhi Ou, Elizabeth Mauer, and Adam D. I. Kramer. 2004. Gestures over Video Streams to Support Remote Collaboration on Physical Tasks. Hum.-Comput. Interact. 19, 3 (Sept. 2004), 273–309. https://doi.org/10.1207/s15327051hci1903_3",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Saul Greenberg, Carl Gutwin, and Mark Roseman. 1996. Semantic telepointers for groupware. In Proceedings Sixth Australian Conference on Computer-Human Interaction. IEEE, 54–61.",
      "doi": ""
    },
    {
      "text": "Simon N. B. Gunkel, Hans M. Stokking, Martin J. Prins, Nanda van der Stap, Frank B. ter Haar, and Omar A. Niamut. 2018. Virtual Reality Conferencing: Multi-User Immersive VR Experiences on the Web. In Proceedings of the 9th ACM Multimedia Systems Conference (Amsterdam, Netherlands) (MMSys ’18). Association for Computing Machinery, New York, NY, USA, 498–501. https://doi.org/10.1145/3204949.3208115",
      "doi": "10.1145/3204949.3208115"
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-Place-Ing Space: The Roles of Place and Space in Collaborative Systems. In Proceedings of the 1996 ACM Conference on Computer Supported Cooperative Work (Boston, Massachusetts, USA) (CSCW ’96). Association for Computing Machinery, New York, NY, USA, 67–76. https://doi.org/10.1145/240080.240193",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Christian Heath and Paul Luff. 1992. Media space and communicative asymmetries: Preliminary observations of video-mediated interaction. Human–Computer Interaction 7, 3 (1992), 315–346.",
      "doi": ""
    },
    {
      "text": "Christian Heath and Paul Luff. 1993. Disembodied conduct: Interactional asymmetries in video-mediated communication. Technology in working order: Studies of work, interaction, and technology (1993), 35–54.",
      "doi": ""
    },
    {
      "text": "Jim Hollan and Scott Stornetta. 1992. Beyond Being There. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Monterey, California, USA) (CHI ’92). Association for Computing Machinery, New York, NY, USA, 119–125. https://doi.org/10.1145/142750.142769",
      "doi": "10.1145/142750.142769"
    },
    {
      "text": "Hiroshi Ishii, Minoru Kobayashi, and Jonathan Grudin. 1993. Integration of Interpersonal Space and Shared Workspace: ClearBoard Design and Experiments. ACM Trans. Inf. Syst. 11, 4 (Oct. 1993), 349–375. https://doi.org/10.1145/159764.159762",
      "doi": "10.1145/159764.159762"
    },
    {
      "text": "Demetrios Karis, Daniel Wildman, and Amir Mané. 2016. Improving Remote Collaboration With Video Conferencing and Video Portals. Human–Computer Interaction 31, 1 (2016), 1–58. https://doi.org/10.1080/07370024.2014.921506",
      "doi": ""
    },
    {
      "text": "David Kirk, Tom Rodden, and Danaë Stanton Fraser. 2007. Turn it this way: grounding collaborative action with remote gestures. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 1039–1048.",
      "doi": "10.1145/1240624.1240782"
    },
    {
      "text": "David Kirk and Danae Stanton Fraser. 2006. Comparing remote gesture technologies for supporting collaborative physical tasks. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 1191–1200.",
      "doi": "10.1145/1124772.1124951"
    },
    {
      "text": "Clemens N. Klokmose, James R. Eagan, Siemen Baader, Wendy Mackay, and Michel Beaudouin-Lafon. 2015. ",
      "doi": "10.1145/2807442.2807446"
    },
    {
      "text": "Peter Gall Krogh, Marianne Graves Petersen, Kenton O’Hara, and Jens Emil Grønbæk. 2017. Sensitizing Concepts for Socio-Spatial Literacy in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6449–6460. https://doi.org/10.1145/3025453.3025756",
      "doi": "10.1145/3025453.3025756"
    },
    {
      "text": "Anastasia Kuzminykh and Sean Rintel. 2020. Classification of Functional Attention in Video Meetings. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376546"
    },
    {
      "text": "Anastasia Kuzminykh and Sean Rintel. 2020. Low Engagement As a Deliberate Practice of Remote Participants in Video Meetings. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–9.",
      "doi": "10.1145/3334480.3383080"
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR: An Emerging Design Framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300794",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Osamu Morikawa and Takanori Maesako. 1998. HyperMirror: Toward Pleasant-to-Use Video Mediated Communication System. In Proceedings of the 1998 ACM Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’98). Association for Computing Machinery, New York, NY, USA, 149–158. https://doi.org/10.1145/289444.289489",
      "doi": "10.1145/289444.289489"
    },
    {
      "text": "Thomas Neumayr, Hans-Christian Jetter, Mirjam Augstein, Judith Friedl, and Thomas Luger. 2018. Domino: A descriptive framework for hybrid collaboration and coupling styles in partially distributed teams. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–24.",
      "doi": "10.1145/3274397"
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L. Davidson, Sameh Khamis, Mingsong Dou, Vladimir Tankovich, Charles Loop, Qin Cai, Philip A. Chou, Sarah Mennicken, Julien Valentin, Vivek Pradeep, Shenlong Wang, Sing Bing Kang, Pushmeet Kohli, Yuliya Lutchyn, Cem Keskin, and Shahram Izadi. 2016. Holoportation: Virtual 3D Teleportation in Real-Time. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 741–754. https://doi.org/10.1145/2984511.2984517",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Kenton O’hara, Jesper Kjeldskov, and Jeni Paay. 2011. Blended Interaction Spaces for Distributed Team Collaboration. ACM Trans. Comput.-Hum. Interact. 18, 1, Article 3 (May 2011), 28 pages. https://doi.org/10.1145/1959022.1959025",
      "doi": "10.1145/1959022.1959025"
    },
    {
      "text": "Roman Rädle, Midas Nouwens, Kristian Antonsen, James R. Eagan, and Clemens N. Klokmose. 2017. Codestrates: Literate Computing with Webstrates. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 715–725. https://doi.org/10.1145/3126594.3126642",
      "doi": "10.1145/3126594.3126642"
    },
    {
      "text": "Banu Saatçi, Kaya Akyüz, Sean Rintel, and Clemens Nylandsted Klokmose. 2020. (Re)Configuring Hybrid Meetings: Moving from User-Centered Design to Meeting-Centered Design. Computer Supported Cooperative Work (CSCW) 29, 6 (Nov 2020), 769–794. https://doi.org/10.1007/s10606-020-09385-x",
      "doi": "10.1007/s10606-020-09385-x"
    },
    {
      "text": "Banu Saatçi, Roman Rädle, Sean Rintel, Kenton O’Hara, and Clemens Nylandsted Klokmose. 2019. Hybrid Meetings in the Modern Workplace: Stories of Success and Failure. In International Conference on Collaboration and Technology. Springer, 45–61.",
      "doi": ""
    },
    {
      "text": "Stacey D Scott, M Sheelagh T Carpendale, and Kori M Inkpen. 2004. Territoriality in collaborative tabletop workspaces. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. 294–303.",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Sofia Seinfeld, Tiare Feuchtner, Antonella Maselli, and Jörg Müller. 2020. User Representations in Human-Computer Interaction. Human–Computer Interaction 0, 0 (2020), 1–39. https://doi.org/10.1080/07370024.2020.1724790",
      "doi": ""
    },
    {
      "text": "Jared Spataro. 2020. The future of work—the good, the challenging & the unknown. https://www.microsoft.com/en-us/microsoft-365/blog/2020/07/08/future-work-good-challenging-unknown/. (Accessed on 14/08/2020).",
      "doi": ""
    },
    {
      "text": "M. Stefik, D. G. Bobrow, G. Foster, S. Lanning, and D. Tatar. 1987. WYSIWIS Revised: Early Experiences with Multiuser Interfaces. ACM Trans. Inf. Syst. 5, 2 (April 1987), 147–167. https://doi.org/10.1145/27636.28056",
      "doi": "10.1145/27636.28056"
    },
    {
      "text": "Anthony Tang, Michael Boyle, and Saul Greenberg. 2003. Display and presence disparity in Mixed Presence Groupware. (2003).",
      "doi": ""
    },
    {
      "text": "Aiden Wickey and Leila Alem. 2007. Analysis of Hand Gestures in Remote Collaboration: Some Design Recommendations. In Proceedings of the 19th Australasian Conference on Computer-Human Interaction: Entertaining User Interfaces (Adelaide, Australia) (OZCHI ’07). Association for Computing Machinery, New York, NY, USA, 87–93. https://doi.org/10.1145/1324892.1324909",
      "doi": "10.1145/1324892.1324909"
    },
    {
      "text": "Nelson Wong and Carl Gutwin. 2014. Support for Deictic Pointing in CVEs: Still Fragmented after All These Years’. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing (Baltimore, Maryland, USA) (CSCW ’14). Association for Computing Machinery, New York, NY, USA, 1377–1387. https://doi.org/10.1145/2531602.2531691",
      "doi": "10.1145/2531602.2531691"
    },
    {
      "text": "Nicole Yankelovich, Nigel Simpson, Jonathan Kaplan, and Joe Provino. 2007. Porta-person: telepresence for the connected conference room. In CHI’07 extended abstracts on Human factors in computing systems. 2789–2794.",
      "doi": ""
    },
    {
      "text": "Nicole Yankelovich, William Walker, Patricia Roberts, Mike Wessler, Jonathan Kaplan, and Joe Provino. 2004. Meeting central: making distributed meetings more effective. In Proceedings of the 2004 ACM conference on Computer supported cooperative work. 419–428.",
      "doi": "10.1145/1031607.1031678"
    }
  ]
}