{
  "doi": "10.1145/3411764.3445154",
  "title": "‘Unmochon’: A Tool to Combat Online Sexual Harassment over Facebook Messenger",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2021,
  "badges": [],
  "abstract": "Women in the global south often seek justice to their online harassment through unveiling the harassers and the screenshots of their sent harassment texts and visual contents before the relevant authorities. Nevertheless, such evidence is often challenged for their authenticity. Our survey (n=91) and interview (n=43) with Bangladeshi online gender harassment victims revealed the depth of the problem, and we set design goals to collect evidence from Facebook Messenger with ensured authenticity. Building on the ‘shame-based model’ of gender justice [12], we designed ‘Unmochon’, a tool that captures authentic evidence and shares with victims’ intended group. Our user-study (n=48) revealed that diminishing authenticity problem may still leave the victim and online gender justice entangled with mob-sentiment, hegemonic legal consciousness, and several privacy aspects. Our findings open up a new discussion on how HCI-design should address online gender justice in such a complex social setting.",
  "authors": [
    {
      "name": "Sharifa Sultana",
      "institution": "Information Science Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261900",
      "orcid": "0000-0003-2906-7391"
    },
    {
      "name": "Mitrasree Deb",
      "institution": "CSE BUET, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701467",
      "orcid": "missing"
    },
    {
      "name": "Ananya Bhattacharjee",
      "institution": "Computer Science and Engineering Bangladesh University of Engineering and Technology, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659333367",
      "orcid": "0000-0002-9116-3766"
    },
    {
      "name": "Shaid Hasan",
      "institution": "Electrical and Electronic Engineering BUET, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659337508",
      "orcid": "missing"
    },
    {
      "name": "S.M.Raihanul Alam",
      "institution": "CSE BUET, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659524468",
      "orcid": "missing"
    },
    {
      "name": "Trishna Chakraborty",
      "institution": "CSE BUET, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700757",
      "orcid": "missing"
    },
    {
      "name": "Prianka Roy",
      "institution": "Department of Computer Science University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701128",
      "orcid": "missing"
    },
    {
      "name": "Samira Fairuz Ahmed",
      "institution": "AGenCy Lab, Department of Computer Science and Engineering Independent University Bangladesh, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701774",
      "orcid": "missing"
    },
    {
      "name": "Aparna Moitra",
      "institution": "Dept of Computer Science University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659029982",
      "orcid": "missing"
    },
    {
      "name": "M Ashraful Amin",
      "institution": "AGenCy Lab, Department of Computer Science and Engineering Independent University Bangladesh, Bangladesh",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659041353",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Rediet Abebe and Kira Goldner. 2018. Mechanism design for social good. AI Matters 4, 3 (2018), 27–34.",
      "doi": "10.1145/3284751.3284761"
    },
    {
      "text": "Nova Ahmed, Sadd Azmeen Ur Rahman, Rahat Jahangir Rony, Tanvir Mushfique, and Vikram Mehta. 2016. Protibadinext: Sensor support to handle sexual harassment. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct. 918–921.",
      "doi": "10.1145/2968219.2979133"
    },
    {
      "text": "Syed Ishtiaque Ahmed, Steven J Jackson, Nova Ahmed, Hasan Shahid Ferdous, Md Rashidujjaman Rifat, ASM Rizvi, Shamir Ahmed, and Rifat Sabbir Mansur. 2014. Protibadi: A platform for fighting sexual harassment in urban Bangladesh. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 2695–2704.",
      "doi": "10.1145/2556288.2557376"
    },
    {
      "text": "Saad Ahmed Akash, Md Al-Zihad, Tamal Adhikary, Md Abdur Razzaque, and Arifa Sharmin. 2016. Hearme: A smart mobile application for mitigating women harassment. In 2016 IEEE International WIE Conference on Electrical and Computer Engineering (WIECON-ECE). IEEE, 87–90.",
      "doi": ""
    },
    {
      "text": "Mohammed Eunus Ali, Shabnam Basera Rishta, Lazima Ansari, Tanzima Hashem, and Ahamad Imtiaz Khan. 2015. SafeStreet: empowering women against street harassment using a privacy-aware location based application. In Proceedings of the Seventh International Conference on Information and Communication Technologies and Development. ACM, 24.",
      "doi": "10.1145/2737856.2737870"
    },
    {
      "text": "Nazanin Andalibi, Oliver L Haimson, Munmun De Choudhury, and Andrea Forte. 2016. Understanding social media disclosures of sexual abuse through the lenses of support seeking and anonymity. In Proceedings of the 2016 CHI conference on human factors in computing systems. 3906–3918.",
      "doi": "10.1145/2858036.2858096"
    },
    {
      "text": "Zahra Ashktorab and Jessica Vitak. 2016. Designing cyberbullying mitigation and prevention solutions through participatory design with teenagers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 3895–3905.",
      "doi": "10.1145/2858036.2858548"
    },
    {
      "text": "UN Women – Asia-Pacific. 2020. Facts and Figures. https://asiapacific.unwomen.org/en/focus-areas/end-violence-against-women/evaw-facts-and-figures.",
      "doi": ""
    },
    {
      "text": "Jamie Bartlett, Richard Norrie, Sofia Patel, Rebekka Rumpel, and Simon Wibberley. 2014. Misogyny on twitter. Demos (2014), 1–18.",
      "doi": ""
    },
    {
      "text": "Russell Beale, Nicola Bidwell, Eli Blevis, Stephen Brewster, Anxo Cereijo Roibas, Keith Cheverst, Andrew Deardon, Jussi Impio, Amit A Navavati, Abigal Sellen, Yvonne Rogers, and Lucia Terrenghi. 2009. UBICOMP 2009 Workshop CFP: Globicomp - Taking Ubicomp Beyond Developed Worlds from Julie Kientz on 2009-02-04 (www-multimodal@w3.org from February 2009). https://lists.w3.org/Archives/Public/www-multimodal/2009Feb/0000.html.",
      "doi": ""
    },
    {
      "text": "Reuben Binns, Michael Veale, Max Van Kleek, and Nigel Shadbolt. 2017. Like trainer, like bot? Inheritance of bias in algorithmic content moderation. In International conference on social informatics. Springer, 405–415.",
      "doi": ""
    },
    {
      "text": "Lindsay Blackwell, Jill Dimond, Sarita Schoenebeck, and Cliff Lampe. 2017. Classification and its consequences for online harassment: Design insights from heartmob. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–19.",
      "doi": "10.1145/3134659"
    },
    {
      "text": "Lindsay Blackwell, Mark Handel, Sarah T Roberts, Amy Bruckman, and Kimberly Voll. 2018. Understanding” Bad Actors” Online. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–7.",
      "doi": "10.1145/3170427.3170610"
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage.",
      "doi": ""
    },
    {
      "text": "John Braithwaite. 2000. Shame and criminal justice. Canadian Journal of Criminology 42, 3 (2000), 281–298.",
      "doi": ""
    },
    {
      "text": "Tarana Burke. 2006. me too. Movement. https://metoomvmt.org/.",
      "doi": ""
    },
    {
      "text": "Tarana Burke. 2018. Why We Need to Acknowledge the True Founder of the #MeToo Movement. https://www.blackburncenter.org/post/2018/02/06/why-we-need-to-acknowledge-the-true-founder-of-the-metoo-movement-tarana-burke.",
      "doi": ""
    },
    {
      "text": "Daniela Busse, Eli Blevis, Richard Beckwith, Shaowen Bardzell, Phoebe Sengers, Bill Tomlinson, Lisa Nathan, and Samuel Mann. 2012. Social sustainability: an HCI agenda. In CHI’12 Extended Abstracts on Human Factors in Computing Systems. 1151–1154.",
      "doi": ""
    },
    {
      "text": "Eshwar Chandrasekharan, Mattia Samory, Anirudh Srinivasan, and Eric Gilbert. 2017. The bag of communities: Identifying abusive behavior online with preexisting internet data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3175–3187.",
      "doi": "10.1145/3025453.3026018"
    },
    {
      "text": "Rhitu Chatterjee. 2018. A New Survey Finds 81 Percent Of Women Have Experienced Sexual Harassment. https://www.npr.org/sections/thetwo-way/2018/02/21/587671849/a-new-survey-finds-eighty-percent-of-women-have-experienced-sexual-harassment.",
      "doi": ""
    },
    {
      "text": "Donna Coker. 2002. Transformative justice: Anti-subordination processes in cases of domestic violence. (2002).",
      "doi": ""
    },
    {
      "text": "Erin Daly. 2001. Transformative justice: Charting a path to reconciliation. Int’l Legal Persp. 12(2001), 73.",
      "doi": ""
    },
    {
      "text": "Priyashree Dasgupta. 2018. #MeToo In India: 75 Professors, 30 Institutes, What Happened To Raya Sarkar’s List Of Sexual Harassers?https://www.huffingtonpost.in/2018/10/25/metoo-in-india-75-professors-30-institutes-what-happened-to-raya-sarkar-s-list-of-sexual-harassers_a_23571422/.",
      "doi": ""
    },
    {
      "text": "Damayanti Datta, Shweta Punj, and Chinki Sinha. 2018. #MeToo hits home - Cover Story News. https://www.indiatoday.in/magazine/cover-story/story/20181022-metoo-hits-home-1360419-2018-10-12.",
      "doi": ""
    },
    {
      "text": "DhakaTribuneDeskReport. 2019. 70% of women facing cyber harassment are 15-25 years in age. https://www.dhakatribune.com/bangladesh/dhaka/2019/09/24/70-of-women-facing-cyber-harassment-are-15-25-years-in-age.",
      "doi": ""
    },
    {
      "text": "Jill P Dimond, Michaelanne Dye, Daphne LaRose, and Amy S Bruckman. 2013. Hollaback!: the role of storytelling online in a social movement organization. In Proceedings of the 2013 conference on Computer supported cooperative work. ACM, 477–490.",
      "doi": "10.1145/2441776.2441831"
    },
    {
      "text": "Carl DiSalvo. 2012. Adversarial design. The MIT Press.",
      "doi": "10.5555/2341007"
    },
    {
      "text": "Hande Eslen-Ziya. 2013. Social media and Turkish feminism: New resources for social activism. Feminist Media Studies 13, 5 (2013), 860–870.",
      "doi": ""
    },
    {
      "text": "Deepa Fadnis. 2017. Feminist activists protest tax on sanitary pads: attempts to normalize conversations about menstruation in India using hashtag activism. Feminist Media Studies 17, 6 (2017), 1111–1114.",
      "doi": ""
    },
    {
      "text": "Maria Angela Ferrario, Will Simm, Peter Newman, Stephen Forshaw, and Jon Whittle. 2014. Software engineering for’social good’: integrating action research, participatory design, and agile development. In Companion Proceedings of the 36th International Conference on Software Engineering. 520–523.",
      "doi": "10.1145/2591062.2591121"
    },
    {
      "text": "Jerry Finn. 2004. A survey of online harassment at a university campus. Journal of Interpersonal violence 19, 4 (2004), 468–483.",
      "doi": ""
    },
    {
      "text": "Brian J Fogg. 2009. A behavior model for persuasive design. In Proceedings of the 4th international Conference on Persuasive Technology. 1–7.",
      "doi": "10.1145/1541948.1541999"
    },
    {
      "text": "Jesse Fox and Wai Yen Tang. 2017. Women’s experiences with general and sexual harassment in online video games: Rumination, organizational responsiveness, withdrawal, and coping strategies. New Media & Society 19, 8 (2017), 1290–1307.",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Mariam Asad, Katherine Lo, Jill P Dimond, Lynn S Dombrowski, and Shaowen Bardzell. 2016. Exploring social justice, design, and HCI. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 3293–3300.",
      "doi": "10.1145/2851581.2856465"
    },
    {
      "text": "Radhika Gajjala. 2018. When an Indian whisper network went digital. Communication Culture & Critique 11, 3 (2018), 489–493.",
      "doi": ""
    },
    {
      "text": "Javier Galbally, Sébastien Marcel, and Julian Fierrez. 2013. Image quality assessment for fake biometric detection: Application to iris, fingerprint, and face recognition. IEEE transactions on image processing 23, 2 (2013), 710–724.",
      "doi": ""
    },
    {
      "text": "Björn Gambäck and Utpal Kumar Sikdar. 2017. Using convolutional neural networks to classify hate-speech. In Proceedings of the first workshop on abusive language online. 85–90.",
      "doi": ""
    },
    {
      "text": "Paul Gready and Simon Robins. 2014. From transitional to transformative justice: A new agenda for practice. International Journal of Transitional Justice 8, 3 (2014), 339–361.",
      "doi": ""
    },
    {
      "text": "Cristela Guerra. 2017. Where did ’Me Too’ come from? Activist Tarana Burke, long before hashtags. https://www.bostonglobe.com/lifestyle/2017/10/17/alyssa-milano-credits-activist-tarana-burke-with-founding-metoo-movement-years-ago/o2Jv29v6ljObkKPTPB9KGP/story.html",
      "doi": ""
    },
    {
      "text": "Aditi Gupta, Hemank Lamba, Ponnurangam Kumaraguru, and Anupam Joshi. 2013. Faking sandy: characterizing and identifying fake images on twitter during hurricane sandy. In Proceedings of the 22nd international conference on World Wide Web. 729–736.",
      "doi": "10.1145/2487788.2488033"
    },
    {
      "text": "Margaret Hagan, Nan Zhang, and Joseph’Jofish’ Kaye. 2012. Safe mathare: a mobile system for women’s safe commutes in the slums. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services companion. 47–52.",
      "doi": "10.1145/2371664.2371675"
    },
    {
      "text": "Randi Lee Harper. 2016. Putting out the Twitter trashfire. Art+ Marketing.(13 February 2016). Retrieved September 8 (2016), 2017.",
      "doi": ""
    },
    {
      "text": "Jasmin Hasanović. 2015. Ochlocracy in the practices of civil society: a threat for democracy?Studia Juridica et Politica Jaurinenisis 2, 2 (2015), 56–66.",
      "doi": ""
    },
    {
      "text": "N. Hassan, M.K. Mandal, M. Bhuiyan, A. Moitra, and S.I. Ahmed. 2019. Nonparticipation of bangladeshi women in #MeToo movement. In ACM International Conference Proceeding Series. https://doi.org/10.1145/3287098.3287125",
      "doi": "10.1145/3287098.3287125"
    },
    {
      "text": "Naeemul Hassan, Manash Kumar Mandal, Mansurul Bhuiyan, Aparna Moitra, and Syed Ishtiaque Ahmed. 2019. Nonparticipation of Bangladeshi Women in# MeToo Movement. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. 1–5.",
      "doi": "10.1145/3287098.3287125"
    },
    {
      "text": "Eric B Hekler, Jennifer C Taylor, Steven P Dow, Michèle Morris, Faren J Grant, Sayali S Phatak, Don Norman, mc schraefel, and Dana M Lewis. 2019. Exploring, Defining, & Advancing Community-Driven Design for Social Impact. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion. 373–376.",
      "doi": "10.1145/3301019.3319998"
    },
    {
      "text": "Eleanor Tiplady Higgs. 2015. # JusticeforLiz: Power and Privilege in Digital Transnational Women’s Rights Activism. Feminist Media Studies 15, 2 (2015), 344–347.",
      "doi": ""
    },
    {
      "text": "Hossein Hosseini, Sreeram Kannan, Baosen Zhang, and Radha Poovendran. 2017. Deceiving google’s perspective api built for detecting toxic comments. arXiv preprint arXiv:1702.08138(2017).",
      "doi": ""
    },
    {
      "text": "Chih-Chung Hsu, Yi-Xiu Zhuang, and Chia-Yen Lee. 2020. Deep fake image detection based on pairwise learning. Applied Sciences 10, 1 (2020), 370.",
      "doi": ""
    },
    {
      "text": "Minyoung Huh, Andrew Liu, Andrew Owens, and Alexei A Efros. 2018. Fighting fake news: Image splice detection via learned self-consistency. In Proceedings of the European Conference on Computer Vision (ECCV). 101–117.",
      "doi": "10.1007/978-3-030-01252-6_7"
    },
    {
      "text": "Shampa Iftakhar. 2020. # MeToo in Bangladesh: Can You Change?Journal of International Women’s Studies 21, 2 (2020), 126–142.",
      "doi": ""
    },
    {
      "text": "Nadia Ilahi. 2009. Gendered contestations: An analysis of street harassment in Cairo and its implications for women’s access to public spaces. Surfacing: An Interdisciplinary Journal for Gender in the Global South 2 (2009), 56–69.",
      "doi": ""
    },
    {
      "text": "Justin Jager, Diane L Putnick, and Marc H Bornstein. 2017. II. More than just convenient: The scientific merits of homogeneous convenience samples. Monographs of the Society for Research in Child Development 82, 2(2017), 13–30.",
      "doi": ""
    },
    {
      "text": "Syeda Gulshan Ferdous Jana. [n.d.]. 7. Bangladesh: Social media, extremism and freedom of expression. TRANSNATIONAL OTHERING GLOBAL DIVERSITIES([n. d.]), 103.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Sucheta Ghoshal, Amy Bruckman, and Eric Gilbert. 2018. Online harassment and content moderation: The case of blocklists. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 2(2018), 1–33.",
      "doi": "10.1145/3185593"
    },
    {
      "text": "Natasha Kabir. 2018. Cyber Crime a New Form of Violence Against Women: From the Case Study of Bangladesh. Available at SSRN 3153467(2018).",
      "doi": ""
    },
    {
      "text": "Yoshiro Kamitake. 2007. From democracy to ochlocracy. Hitotsubashi journal of economics(2007), 83–93.",
      "doi": ""
    },
    {
      "text": "Semanur Karaman. 2017. Women support each other in the face of harassment online, but policy reform is needed | LSE Women, Peace and Security blog. https://blogs.lse.ac.uk/wps/2017/11/29/women-support-each-other-in-the-face-of-harassment-online-but-policy-reform-is-needed/.",
      "doi": ""
    },
    {
      "text": "Naveena Karusala, Apoorva Bhalla, and Neha Kumar. 2019. Privacy, Patriarchy, and Participation on Social Media. In Proceedings of the 2019 on Designing Interactive Systems Conference. 511–526.",
      "doi": "10.1145/3322276.3322355"
    },
    {
      "text": "Naveena Karusala and Neha Kumar. 2017. Women’s Safety in Public Spaces: Examining the Efficacy of Panic Buttons in New Delhi. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3340–3351.",
      "doi": "10.1145/3025453.3025532"
    },
    {
      "text": "George Kennedy, Andrew McCollough, Edward Dixon, Alexei Bastidas, John Ryan, Chris Loo, and Saurav Sahay. 2017. Technology solutions to combat online harassment. In Proceedings of the first workshop on abusive language online. 73–77.",
      "doi": ""
    },
    {
      "text": "Hasam Khalid and Simon S Woo. 2020. OC-FakeDect: Classifying Deepfakes Using One-Class Variational Autoencoder. In Proceedings of the IEEE/CVF Conference on Computer Vision and Pattern Recognition Workshops. 656–657.",
      "doi": ""
    },
    {
      "text": "Vivian Krauchek and Gillian Ranson. 1999. Playing by the rules of the game: women’s experiences and perceptions of sexual harassment in sport. Canadian Review of Sociology/Revue canadienne de sociologie 36, 4(1999), 585–600.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J Anderson. 2015. Mobile phones for maternal health in rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 427–436.",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "N. Kumar, N. Karusala, A. Ismail, M. Wong-Villacres, and A. Vishwanath. 2019. Engaging Feminist Solidarity for Comparative Research, Design, and Practice. In Proceedings of the ACM on Human-Computer Interaction CSCW. ACM, 167.",
      "doi": ""
    },
    {
      "text": "Amanda Lenhart, Michele Ybarra, Kathryn Zickuhr, and Myeshia Price-Feeney. 2016. Online harassment, digital abuse, and cyberstalking in America. Data and Society Research Institute.",
      "doi": ""
    },
    {
      "text": "Amy Lyndon, Jennifer Bonds-Raacke, and Alyssa D Cratty. 2011. College students’ Facebook stalking of ex-partners. Cyberpsychology, Behavior, and Social Networking 14, 12(2011), 711–716.",
      "doi": ""
    },
    {
      "text": "Kaitlin Mahar, Amy X Zhang, and David Karger. 2018. Squadbox: A tool to combat email harassment using friendsourced moderation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3174160"
    },
    {
      "text": "Saba Mahmood. 2001. Feminist theory, embodiment, and the docile agent: Some reflections on the Egyptian Islamic revival. Cultural anthropology 16, 2 (2001), 202–236.",
      "doi": ""
    },
    {
      "text": "C Mallapur and A Alphonso. 2018. #MeTooIndia: 54% rise in sexual harassment reported at workplaces between 2014-17. https://www.indiaspend.com/metooindia-54-rise-in-sexual-harassment-reported-at-workplaces-between-2014-17/",
      "doi": ""
    },
    {
      "text": "Claudia Manzi, Sharon Coen, Camillo Regalia, Ana Maria Yévenes, Cristina Giuliani, and Vivian L Vignoles. 2018. Being in the Social: A cross-cultural and cross-generational study on identity processes related to Facebook use. Computers in Human Behavior 80 (2018), 81–87.",
      "doi": "10.1016/j.chb.2017.10.046"
    },
    {
      "text": "Francesco Marra, Diego Gragnaniello, Davide Cozzolino, and Luisa Verdoliva. 2018. Detection of gan-generated fake images over social networks. In 2018 IEEE Conference on Multimedia Information Processing and Retrieval (MIPR). IEEE, 384–389.",
      "doi": ""
    },
    {
      "text": "Robert Meyer and Michel Cukier. 2006. Assessing the attack threat due to IRC channels. In International Conference on Dependable Systems and Networks (DSN’06). IEEE, 467–472.",
      "doi": "10.1109/DSN.2006.12"
    },
    {
      "text": "Alyssa Milano. 2017. How We Can Help Women Come Forward. Time (oct 2017).",
      "doi": ""
    },
    {
      "text": "Durba Mitra. 2012. Critical perspectives on SlutWalks in India. Feminist studies 38, 1 (2012), 254–261.",
      "doi": ""
    },
    {
      "text": "Aparna Moitra, Naeemul Hassan, Manash Kumar Mandal, Mansurul Bhuiyan, and Syed Ishtiaque Ahmed. 2020. Understanding the Challenges for Bangladeshi Women to Participate in# MeToo Movement. Proceedings of the ACM on Human-Computer Interaction 4, GROUP(2020), 1–25.",
      "doi": "10.1145/3375195"
    },
    {
      "text": "Ruth Morris. 2000. Stories of transformative justice. Canadian Scholars’ Press.",
      "doi": ""
    },
    {
      "text": "Maryam Mustafa, Amna Batool, Beenish Fatima, Fareeda Nawaz, Kentaro Toyama, and Agha Ali Raza. 2020. Patriarchy, Maternal Health and Spiritual Healing: Designing Maternal Health Interventions in Pakistan. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376294"
    },
    {
      "text": "Thanh Thi Nguyen, Cuong M Nguyen, Dung Tien Nguyen, Duc Thanh Nguyen, and Saeid Nahavandi. 2019. Deep learning for deepfakes creation and detection. arXiv preprint arXiv:1909.11573(2019).",
      "doi": ""
    },
    {
      "text": "Fayika Farhat Nova, MD Rashidujjaman Rifat, Pratyasha Saha, Syed Ishtiaque Ahmed, and Shion Guha. 2019. Online sexual harassment over anonymous social media in Bangladesh. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development. 1–12.",
      "doi": "10.1145/3287098.3287107"
    },
    {
      "text": "observers. 2017. Fake images spark flare-up of violence in West Bengal. https://observers.france24.com/en/20170713-fake-images-causes-flare-violence-west-bengal.",
      "doi": ""
    },
    {
      "text": "Rogers TE Orock. 2014. Crime, in/security and mob justice: The micropolitics of sovereignty in Cameroon. Social Dynamics 40, 2 (2014), 408–428.",
      "doi": ""
    },
    {
      "text": "Ji Ho Park and Pascale Fung. 2017. One-step and two-step classification for abusive language detection on twitter. arXiv preprint arXiv:1706.01206(2017).",
      "doi": ""
    },
    {
      "text": "Nimmi Rangaswamy and Nithya Sambasivan. 2011. Cutting Chai, Jugaad, and Here Pheri: towards UbiComp for a global community. Personal and Ubiquitous Computing 15, 6 (2011), 553–564.",
      "doi": "10.1007/s00779-010-0349-x"
    },
    {
      "text": "Elissa M Redmiles, Jessica Bodford, and Lindsay Blackwell. 2019. “I just want to feel safe”: A Diary Study of Safety Perceptions on Social Media. In Proceedings of the International AAAI Conference on Web and Social Media, Vol. 13. 405–416.",
      "doi": ""
    },
    {
      "text": "Johan Redström. 2006. Persuasive design: Fringes and foundations. In International Conference on Persuasive Technology. Springer, 112–122.",
      "doi": ""
    },
    {
      "text": "Rebecca S Robinson. 2016. Pink Hijab Day: Mediation of the Hijab as a Symbol of Protest. International Journal of Communication 10 (2016), 20.",
      "doi": ""
    },
    {
      "text": "Jennifer D Rubin, Lindsay Blackwell, and Terri D Conley. 2020. Fragile Masculinity: Men, Gender, and Online Harassment. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376645"
    },
    {
      "text": "Vijay Shankar. 2015. Announcing Facebook lite. Facebook Newsroom (2015).",
      "doi": ""
    },
    {
      "text": "Ditilekha Sharma. 2018. What Is Missing In the #MeToo Movement?Economic and Political Weekly 53, 49 (2018). https://www.epw.in/engage/article/what-is-missing-metoo-movement-limitation-law-justice",
      "doi": ""
    },
    {
      "text": "Tamara Shepherd, Alison Harvey, Tim Jordan, Sam Srauy, and Kate Miltner. 2015. Histories of hating. Social Media+ Society 1, 2 (2015), 2056305115603997.",
      "doi": ""
    },
    {
      "text": "Emily Shugerman. 2017. Me Too: Why are women sharing stories of sexual assault and how did it start?",
      "doi": ""
    },
    {
      "text": "Abu Siddique. 2013. Implication of ‘innocent’ people irks Ramu arson victims. https://www.dhakatribune.com/uncategorized/2013/05/21/implication-of-innocent-people-irks-ramu-arson-victims.",
      "doi": ""
    },
    {
      "text": "Sharon G Smith, Xinjian Zhang, Kathleen C Basile, Melissa T Merrick, Jing Wang, Marcie-jo Kresnow, and Jieru Chen. 2018. The national intimate partner and sexual violence survey: 2015 data brief–updated release. (2018).",
      "doi": ""
    },
    {
      "text": "Navya R Sogi, Priya Chatterjee, U Nethra, and V Suma. 2018. SMARISA: a raspberry pi based smart ring for women safety using IoT. In 2018 International Conference on Inventive Research in Computing Applications (ICIRCA). IEEE, 451–454.",
      "doi": ""
    },
    {
      "text": "WHOA Comparison Statistics. 2013. Working to Halt Online Abuse. http://www.haltabuse.org/resources/stats/index.shtml.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1990. Open coding. Basics of qualitative research: Grounded theory procedures and techniques 2, 1990 (1990), 101–121.",
      "doi": ""
    },
    {
      "text": "Sharifa Sultana and Syed Ishtiaque Ahmed. 2019. Witchcraft and HCI: Morality, Modernity, and Postcolonial Computing in Rural Bangladesh. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 356.",
      "doi": "10.1145/3290605.3300586"
    },
    {
      "text": "Sharifa Sultana, François Guimbretière, Phoebe Sengers, and Nicola Dell. 2018. Design within a Patriarchal Society: Opportunities and Challenges in Designing for Rural Women in Bangladesh. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 536.",
      "doi": "10.1145/3173574.3174110"
    },
    {
      "text": "Aditya Vashistha, Abhinav Garg, Richard Anderson, and Agha Ali Raza. 2019. Threats, abuses, flirting, and blackmail: Gender inequity in social media voice forums. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300302"
    },
    {
      "text": "Luisa Verdoliva. 2020. Media forensics and deepfakes: an overview. arXiv preprint arXiv:2001.06564(2020).",
      "doi": ""
    },
    {
      "text": "Kalpana Viswanath and Ashish Basu. 2015. SafetiPin: an innovative mobile app to collect data on women’s safety in Indian cities. Gender & Development 23, 1 (2015), 45–60.",
      "doi": ""
    },
    {
      "text": "Jessica Vitak, Kalyani Chadha, Linda Steiner, and Zahra Ashktorab. 2017. Identifying women’s experiences with and strategies for mitigating negative effects of online harassment. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 1231–1245.",
      "doi": "10.1145/2998181.2998337"
    },
    {
      "text": "Rakesh Vuppu. 2020. Images from Bangladesh falsely shared as ‘Rohingyas attacking Hindus and Hindu temples in West Bengal’. https://factly.in/images-from-bangladesh-falsely-shared-as-rohingyas-attacking-hindus-and-hindu-temples-in-west-bengal/.",
      "doi": ""
    },
    {
      "text": "Charlie Warzel. 2016. A Honeypot for Assholes: Inside Twitters 10-Year Failure to Stop Harassment. BuzzFeed News (2016).",
      "doi": ""
    },
    {
      "text": "Charlie Warzel. 2017. Twitter is still dismissing harassment reports and frustrating victims. Buzzfeed.(17 July 2017). Retrieved September 8 (2017), 2017.",
      "doi": ""
    },
    {
      "text": "Beverly M Weber. 2016. Kübra Gümüşay, Muslim digital feminism and the politics of visuality in Germany. Feminist Media Studies 16, 1 (2016), 101–116.",
      "doi": ""
    },
    {
      "text": "Sherri Williams. 2015. Digital defense: Black feminists resist violence with hashtag activism. Feminist media studies 15, 2 (2015), 341–344.",
      "doi": ""
    },
    {
      "text": "Sherri Williams. 2016. # SayHerName: using digital activism to document violence against black women. Feminist media studies 16, 5 (2016), 922–925.",
      "doi": ""
    },
    {
      "text": "Yohanes Sigit Purnomo WP, Theresia Devi Indriasari, Kusworo Anindito, Yoshua Andrean, and Jaka Galih Prasetyo. 2019. CrimeID: Towards Crime Prevention and Community Safety in Indonesia using Mobile and Web Technology. International Journal of Interactive Mobile Technologies (iJIM) 13, 09(2019), 52–65.",
      "doi": ""
    },
    {
      "text": "Ellery Wulczyn, Nithum Thain, and Lucas Dixon. 2017. Ex machina: Personal attacks seen at scale. In Proceedings of the 26th International Conference on World Wide Web. 1391–1399.",
      "doi": "10.1145/3038912.3052591"
    },
    {
      "text": "Susan Wyche. 2017. Exploring women’s everyday mobile phone experiences in Nairobi, Kenya. Interacting with Computers 29, 3 (2017), 391–402.",
      "doi": ""
    },
    {
      "text": "Susan P Wyche, Sarita Yardi Schoenebeck, and Andrea Forte. 2013. “Facebook is a luxury” an exploratory study of social media use in rural Kenya. In Proceedings of the 2013 conference on Computer supported cooperative work. 33–44.",
      "doi": "10.1145/2441776.2441783"
    },
    {
      "text": "Fouzia Younas, Mustafa Naseem, and Maryam Mustafa. 2020. Patriarchy and Social Media: Women Only Facebook Groups as Safe Spaces for Support Seeking in Pakistan. In Proceedings of the 2020 International Conference on Information and Communication Technologies and Development. 1–11.",
      "doi": "10.1145/3392561.3394639"
    },
    {
      "text": "Chelsea Young. 2014. HarassMap: using crowdsourced data to map sexual harassment in Egypt. Technology Innovation Management Review 4, 3 (2014), 7.",
      "doi": ""
    },
    {
      "text": "Lilei Zheng, Ying Zhang, and Vrizlynn LL Thing. 2019. A survey on image tampering and its detection in real-world photos. Journal of Visual Communication and Image Representation 58 (2019), 380–399.",
      "doi": ""
    }
  ]
}