{
  "doi": "10.1145/3411764.3445054",
  "title": "Vibrosight++: City-Scale Sensing Using Existing Retroreflective Signs and Markers",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Today’s smart cities use thousands of physical sensors distributed across the urban landscape to support decision making in areas such as infrastructure monitoring, public health, and resource management. These weather-hardened devices require power and connectivity, and often cost thousands just to install, let alone maintain. In this paper, we show how long-range laser vibrometry can be used for low-cost, city-scale sensing. Although typically limited to just a few meters of sensing range, the use of retroreflective markers can boost this to 1km or more. Fortuitously, cities already make extensive use of retroreflective materials for street signs, construction barriers, road studs, license plates, and many other markings. We describe how our prototype system can co-opt these existing markers at very long ranges and use them as unpowered accelerometers for use in a wide variety of sensing applications.",
  "tags": [
    "Ubiquitous Computing",
    "Laser Vibrometry",
    "Smart City",
    "Internet-of-Things",
    "Sensing"
  ],
  "authors": [
    {
      "name": "Yang Zhang",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81548025596/rel-imgonly/yang.jpg",
      "acmid": "81548025596",
      "orcid": "0000-0003-2472-6968"
    },
    {
      "name": "Sven Mayer",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99658696530/rel-imgonly/p_mayersven.jpg",
      "acmid": "99658696530",
      "orcid": "0000-0001-5462-8782"
    },
    {
      "name": "Jesse T. Gonzalez",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-99659701919/rel-imgonly/20180209_003910__1___1_.jpg",
      "acmid": "99659701919",
      "orcid": "missing"
    },
    {
      "name": "Chris Harrison",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81350573130/rel-imgonly/pastedgraphic-11.png",
      "acmid": "81350573130",
      "orcid": "0000-0001-5312-3619"
    }
  ],
  "references": [
    {
      "text": "American National Standards Institute. 2014. ANSI Z136.1 - Safe Use of Lasers. https://www.lia.org/resources/laser-safety-information/laser-safety-standards/ansi-z136-standards/z136-1 Retrieved January 10, 2021.",
      "doi": ""
    },
    {
      "text": "Array of Things. 2020. Project Information. https://arrayofthings.github.io Retrieved January 10, 2021.",
      "doi": ""
    },
    {
      "text": "Kridsakron Auynirundronkool, Nengcheng Chen, Caihua Peng, Chao Yang, Jianya Gong, and Chaowalit Silapathong. 2012. Flood detection and mapping of the Thailand Central plain using RADARSAT and MODIS under a sensor web environment. International Journal of Applied Earth Observation and Geoinformation 14, 1(2012), 245 – 255. https://doi.org/10.1016/j.jag.2011.09.017",
      "doi": ""
    },
    {
      "text": "Yuequan Bao, James L Beck, and Hui Li. 2011. Compressive sampling for accelerometer signals in structural health monitoring. Structural Health Monitoring 10, 3 (2011), 235–246. https://doi.org/10.1177/1475921710373287",
      "doi": ""
    },
    {
      "text": "Johan Barthélemy, Nicolas Verstaevel, Hugh Forehead, and Pascal Perez. 2019. Edge-Computing Video Analytics for Real-Time Traffic Monitoring in a Smart City. Sensors 19, 9 (May 2019), 2048. https://doi.org/10.3390/s19092048",
      "doi": ""
    },
    {
      "text": "Juan P Bello, Claudio Silva, Oded Nov, R Luke DuBois, Anish Arora, Justin Salamon, Charles Mydlarz, and Harish Doraiswamy. 2019. Sonyc: A system for monitoring, analyzing, and mitigating urban noise pollution. Commun. ACM 62, 2 (2019), 68–77.",
      "doi": "10.1145/3224204"
    },
    {
      "text": "Austin Lyons Bischoff and Darcy M Bullock. 2002. Sign retroreflectivity study. Joint Transportation Research Program (01 2002). https://doi.org/10.5703/1288284313313",
      "doi": ""
    },
    {
      "text": "Jillian Carr and Jennifer L Doleac. 2016. The geography, incidence, and underreporting of gun violence: new evidence using ShotSpotter data. Incidence, and Underreporting of Gun Violence: New Evidence Using Shotspotter (2016). https://doi.org/10.2139/ssrn.2770506",
      "doi": ""
    },
    {
      "text": "Paolo Castellinim, Milena Martarelli, and Enrico Primo Tomasini. 2006. Laser Doppler Vibrometry: Development of advanced solutions answering to technology’s needs. Mechanical Systems and Signal Processing 20, 6 (2006), 1265 – 1285. https://doi.org/10.1016/j.ymssp.2005.11.015Special Issue: Laser Doppler Vibrometry.",
      "doi": ""
    },
    {
      "text": "Yiheng Chen and Dawei Han. 2018. Water quality monitoring in smart city: A pilot project. Automation in Construction 89 (2018), 307 – 316. https://doi.org/10.1016/j.autcon.2018.02.008",
      "doi": ""
    },
    {
      "text": "Emilio Chuvieco. 2016. Fundamentals of satellite remote sensing: An environmental approach. CRC press.",
      "doi": ""
    },
    {
      "text": "Dominick M. Ciruzzi and Steven P. Loheide II. 2019. Monitoring Tree Sway as an Indicator of Water Stress. Geophysical Research Letters 46, 21 (2019), 12021–12029. https://doi.org/10.1029/2019GL084122",
      "doi": ""
    },
    {
      "text": "Code of Federal Regulations. 2011. Title 49 §393.11 - Lamps and reflective devices. https://www.govinfo.gov/app/details/CFR-2011-title49-vol5/CFR-2011-title49-vol5-sec393-11 Retrieved January 10, 2021.",
      "doi": ""
    },
    {
      "text": "Cristina Cristalli, Nicola Paone, and R. M. Rodríguez. 2006. Mechanical fault detection of electric motors by laser vibrometer and accelerometer measurements. Mechanical Systems and Signal Processing 20, 6 (2006), 1350 – 1361. https://doi.org/10.1016/j.ymssp.2005.11.013Special Issue: Laser Doppler Vibrometry.",
      "doi": ""
    },
    {
      "text": "Amr S El-Wakeel, Jin Li, Muhammed T Rahman, Aboelmagd Noureldin, and Hossam S Hassanein. 2017. Monitoring road surface anomalies towards dynamic road mapping for future smart cities. In IEEE Global Conference on Signal and Information Processing(GlobalSIP ’17). IEEE, 828–832. https://doi.org/10.1109/GlobalSIP.2017.8309076",
      "doi": ""
    },
    {
      "text": "William Emery and Adriano Camps. 2017. Introduction to satellite remote sensing: atmosphere, ocean, land and cryosphere applications. Elsevier.",
      "doi": ""
    },
    {
      "text": "Jennifer Gabrys. 2014. Programming Environments: Environmentality and Citizen Sensing in the Smart City. Environment and Planning D: Society and Space 32, 1 (2014), 30–48. https://doi.org/10.1068/d16812",
      "doi": ""
    },
    {
      "text": "Guido Giuliani, Simone Bozzi-Pietra, and Silvano Donati. 2002. Self-mixing laser diode vibrometer. Measurement Science and Technology 14, 1 (nov 2002), 24–32. https://doi.org/10.1088/0957-0233/14/1/304",
      "doi": ""
    },
    {
      "text": "Earl E. Gossard. 1988. Measuring Drop-Size Distributions in Clouds with a Clear-Air-Sensing Doppler Radar. Journal of Atmospheric and Oceanic Technology 5, 5 (oct 1988), 640 – 649. https://doi.org/10.1175/1520-0426(1988)005<0640:MDSDIC>2.0.CO;2",
      "doi": ""
    },
    {
      "text": "Daniel Granlund and Robert Brännström. 2012. Smart City: The smart sewerage. In 37th Annual IEEE Conference on Local Computer Networks - Workshops(LCNW ’12). IEEE, 856–859. https://doi.org/10.1109/LCNW.2012.6424074",
      "doi": ""
    },
    {
      "text": "Hadi Habibzadeh, Zhou Qin, Tolga Soyata, and Burak Kantarci. 2017. Large-Scale Distributed Dedicated- and Non-Dedicated Smart City Sensing Systems. IEEE Sensors Journal 17, 23 (2017), 7649–7658. https://doi.org/10.1109/JSEN.2017.2725638",
      "doi": ""
    },
    {
      "text": "Gerhard Hancke, Bruno Silva, and Gerhard Hancke, Jr.2012. The Role of Advanced Sensing in Smart Cities. Sensors 13, 1 (Dec 2012), 393–425. https://doi.org/10.3390/s130100393",
      "doi": ""
    },
    {
      "text": "Roy Henderson and Karl Schulmeister. 2003. Laser safety. CRC Press.",
      "doi": ""
    },
    {
      "text": "Zhiwen Hu, Zixuan Bai, Yuzhe Yang, Zijie Zheng, Kaigui Bian, and Lingyang Song. 2019. UAV Aided Aerial-Ground IoT for Air Quality Sensing in Smart City: Architecture, Technologies, and Implementation. IEEE Network 33, 2 (2019), 14–22. https://doi.org/10.1109/MNET.2019.1800214",
      "doi": ""
    },
    {
      "text": "Sukun Kim, Shamim Pakzad, David Culler, James Demmel, Gregory Fenves, Steve Glaser, and Martin Turon. 2006. Wireless Sensor Networks for Structural Health Monitoring. In Proceedings of the 4th International Conference on Embedded Networked Sensor Systems (Boulder, Colorado, USA) (SenSys ’06). Association for Computing Machinery, New York, NY, USA, 427–428. https://doi.org/10.1145/1182807.1182889",
      "doi": "10.1145/1182807.1182889"
    },
    {
      "text": "Gierad Laput, Walter S. Lasecki, Jason Wiese, Robert Xiao, Jeffrey P. Bigham, and Chris Harrison. 2015. Zensors: Adaptive, Rapidly Deployable, Human-Intelligent Sensor Feeds. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1935–1944. https://doi.org/10.1145/2702123.2702416",
      "doi": "10.1145/2702123.2702416"
    },
    {
      "text": "Gierad Laput, Robert Xiao, and Chris Harrison. 2016. ViBand: High-Fidelity Bio-Acoustic Sensing Using Commodity Smartwatch Accelerometers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 321–333. https://doi.org/10.1145/2984511.2984582",
      "doi": "10.1145/2984511.2984582"
    },
    {
      "text": "Gierad Laput, Yang Zhang, and Chris Harrison. 2017. Synthetic Sensors: Towards General-Purpose Sensing. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3986–3999. https://doi.org/10.1145/3025453.3025773",
      "doi": "10.1145/3025453.3025773"
    },
    {
      "text": "Fabio Leccese, Marco Cagnetti, and Daniele Trinca. 2014. A Smart City Application: A Fully Controlled Street Lighting Isle Based on Raspberry-Pi Card, a ZigBee Sensor Network and WiMAX. Sensors 14, 12 (Dec 2014), 24408–24424. https://doi.org/10.3390/s141224408",
      "doi": ""
    },
    {
      "text": "W. H. Leong, Wiesław Jerzy Staszewski, B. C. Lee, and Fabrizio Scarpa. 2005. Structural health monitoring using scanning laser vibrometry: III. Lamb waves for fatigue crack detection. Smart Materials and Structures 14, 6 (oct 2005), 1387–1395. https://doi.org/10.1088/0964-1726/14/6/031",
      "doi": ""
    },
    {
      "text": "Zhong-Xian Li, Xiao-Ming Yang, and Zongjin Li. 2006. Application of Cement-Based Piezoelectric Sensors for Monitoring Traffic Flows. Journal of Transportation Engineering 132, 7 (2006), 565–573. https://doi.org/10.1061/(ASCE)0733-947X(2006)132:7(565)",
      "doi": ""
    },
    {
      "text": "Shunlin Liang and Jindi Wang. 2019. Advanced remote sensing: terrestrial information extraction and applications. Academic Press.",
      "doi": ""
    },
    {
      "text": "Shi-Wei Lo, Jyh-Horng Wu, Fang-Pang Lin, and Ching-Han Hsu. 2015. Visual Sensing for Urban Flood Monitoring. Sensors 15, 8 (Aug 2015), 20006–20029. https://doi.org/10.3390/s150820006",
      "doi": ""
    },
    {
      "text": "Jon Derek Loftis, David Forrest, Sridhar Katragadda, Kyle Spencer, Tammie Organski, Cuong Nguyen, and Sokwoo Rhee. 2018. StormSense: A New Integrated Network of IoT Water Level Sensors in the Smart Cities of Hampton Roads, VA. Marine Technology Society Journal 52, 2 (2018), 56–67. https://doi.org/10.4031/MTSJ.52.2.7",
      "doi": ""
    },
    {
      "text": "Xianghong Ma, Lawrence Bergman, and Alexander Vakakis. 2001. Identification of Bolted Joints Through Laser Vibrometry. Journal of Sound and Vibration 246, 3 (2001), 441 – 460. https://doi.org/10.1006/jsvi.2001.3573",
      "doi": ""
    },
    {
      "text": "Mousumi Majumder, Tarun Kumar Gangopadhyay, Ashim Kumar Chakraborty, Kamal Dasgupta, and Dipak Kumar Bhattacharya. 2008. Fibre Bragg gratings in structural health monitoring—Present status and applications. Sensors and Actuators A: Physical 147, 1 (2008), 150 – 164. https://doi.org/10.1016/j.sna.2008.04.008",
      "doi": ""
    },
    {
      "text": "MetroCount Inc.2020. Metrocount. https://metrocount.com Retrieved January 10, 2021.",
      "doi": ""
    },
    {
      "text": "Saraju P Mohanty, Uma Choppali, and Elias Kougianos. 2016. Everything you wanted to know about smart cities: The Internet of things is the backbone. IEEE Consumer Electronics Magazine 5, 3 (2016), 60–70. https://doi.org/10.1109/MCE.2016.2556879",
      "doi": ""
    },
    {
      "text": "Wongi Na and Jongdae Baek. 2018. A Review of the Piezoelectric Electromechanical Impedance Based Structural Health Monitoring Technique for Engineering Structures. Sensors 18, 5 (Apr 2018), 1307. https://doi.org/10.3390/s18051307",
      "doi": ""
    },
    {
      "text": "Christophe Ishimwe Ngabo and Omar El Beqqali. 2018. 3D tilt sensing by using accelerometer-based wireless sensor networks: Real case study: Application in the smart cities. In International Conference on Intelligent Systems and Computer Vision(ISACV ’18). IEEE, 1–8. https://doi.org/10.1109/ISACV.2018.8354013",
      "doi": ""
    },
    {
      "text": "Charith Perera, Arkady Zaslavsky, Peter Christen, and Dimitrios Georgakopoulos. 2014. Sensing as a service model for smart cities supported by Internet of Things. Transactions on Emerging Telecommunications Technologies 25, 1(2014), 81–93. https://doi.org/10.1002/ett.2704",
      "doi": "10.1002/ett.2704"
    },
    {
      "text": "Polytec Inc.2020. Product Information. https://www.polytec.com/us/vibrometry/products/single-point-vibrometers/vibrogo/ Retrieved January 10, 2021.",
      "doi": ""
    },
    {
      "text": "Mark Potosnak, Pinaki Banerjee, Rajesh Sankaran, Veerabhadra Kotamarthi, Robert Jacob, Peter Beckman, and Charlie Catlett. 2018. Array of Things: Characterizing low-cost air quality sensors for a city-wide instrument. Earth and Space Science Open Archive(2018), 1. https://doi.org/10.1002/essoar.10500209.1",
      "doi": ""
    },
    {
      "text": "Manaswi Saha, Michael Saugstad, Hanuma Teja Maddali, Aileen Zeng, Ryan Holland, Steven Bower, Aditya Dash, Sage Chen, Anthony Li, Kotaro Hara, and Jon Froehlich. 2019. Project Sidewalk: A Web-Based Crowdsourcing Tool for Collecting Sidewalk Accessibility Data At Scale. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland UK) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300292",
      "doi": "10.1145/3290605.3300292"
    },
    {
      "text": "Nobuhiro Shimoi, C. Cuadra, Madokoroa Hirokazu, and Masahiro Saijo. 2012. Simple smart piezoelectric bolt sensor for structural monitoring of bridges. Int. J. Instrumentation Science 1, 5 (2012), 78–83. https://doi.org/10.5923/j.instrument.20120105.03",
      "doi": ""
    },
    {
      "text": "Robert L Showen, Robert B Calhoun, and Jason W Dunham. 2009. Acoustic location of gunshots using combined angle of arrival and time of arrival measurements. US Patent 7,474,589.",
      "doi": ""
    },
    {
      "text": "Wei Sun, Tuochao Chen, Jiayi Zheng, Zhenyu Lei, Lucy Wang, Benjamin Steeper, Peng He, Matthew Dressa, Feng Tian, and Cheng Zhang. 2020. VibroSense: Recognizing Home Activities by Deep Learning Subtle Vibrations on an Interior Surface of a House from a Single Point Using Laser Doppler Vibrometry. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 3, Article 96 (Sept. 2020), 28 pages. https://doi.org/10.1145/3411828",
      "doi": ""
    },
    {
      "text": "Saiganesh Swaminathan, Jonathon Fagert, Michael Rivera, Andrew Cao, Gierad Laput, Hae Young Noh, and Scott E. Hudson. 2020. OptiStructures: Fabrication of Room-Scale Interactive Structures with Embedded Fiber Bragg Grating Optical Sensors and Displays. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 2, Article 50 (June 2020), 21 pages. https://doi.org/10.1145/3397310",
      "doi": "10.1145/3397310"
    },
    {
      "text": "Francisco Sánchez-Rosario, David Sánchez-Rodríguez, Jesús B Alonso-Hernández, Carlos M Travieso-González, Itziar Alonso-González, Carlos Ley-Bosch, Carlos Ramírez-Casañas, and Miguel A Quintana-Suárez. 2015. A low consumption real time environmental monitoring system for smart cities based on ZigBee wireless sensor network. In International Wireless Communications and Mobile Computing Conference(IWCMC ’15). IEEE, 702–707. https://doi.org/10.1109/IWCMC.2015.7289169",
      "doi": ""
    },
    {
      "text": "The Free Encyclopedia Wikipedia. 2020. Street furniture. https://en.wikipedia.org/w/index.php?title=Street_furniture&oldid=985712859 Retrieved January 10, 2021.",
      "doi": ""
    },
    {
      "text": "Deepak Vasisht, Zerina Kapetanovic, Jongho Won, Xinxin Jin, Ranveer Chandra, Sudipta Sinha, Ashish Kapoor, Madhusudhan Sudarshan, and Sean Stratman. 2017. FarmBeats: An IoT Platform for Data-Driven Agriculture. In 14th USENIX Symposium on Networked Systems Design and Implementation (NSDI 17). USENIX Association, Boston, MA, 515–529. https://www.usenix.org/conference/nsdi17/technical-sessions/presentation/vasisht",
      "doi": "10.5555/3154630.3154673"
    },
    {
      "text": "Meisong Wang, Charith Perera, Prem Prakash Jayaraman, Miranda Zhang, Peter Strazdins, R. K. Shyamsundar, and Rajiv Ranjan. 2016. City Data Fusion: Sensor Data Fusion in the Internet of Things. International Journal of Distributed Systems and Technologies (IJDST) 7, 1(2016), 15–36. https://doi.org/10.4018/IJDST.2016010102",
      "doi": "10.4018/IJDST.2016010102"
    },
    {
      "text": "World Sensing. 2020. Traffic Flow Monitoring. https://www.worldsensing.com/ Retrieved January 10, 2021.",
      "doi": ""
    },
    {
      "text": "Andrea Zanella, Nicola Bui, Angelo Castellani, Lorenzo Vangelista, and Michele Zorzi. 2014. Internet of Things for Smart Cities. IEEE Internet of Things Journal 1, 1 (2014), 22–32. https://doi.org/10.1109/JIOT.2014.2306328",
      "doi": ""
    },
    {
      "text": "Zensors Inc.2020. Zensors. https://www.zensors.com Retrieved January 10, 2021.",
      "doi": ""
    },
    {
      "text": "Guifu Zhang, Richard J Doviak, Dusan S Zrnic, Jerry Crain, David Staiman, and Yasser Al-Rashid. 2009. Phased Array Radar Polarimetry for Weather Sensing: A Theoretical Formulation for Bias Corrections. IEEE Transactions on Geoscience and Remote Sensing 47, 11 (2009), 3679–3689. https://doi.org/10.1109/TGRS.2009.2029332",
      "doi": ""
    },
    {
      "text": "Yang Zhang, Gierad Laput, and Chris Harrison. 2018. Vibrosight: Long-Range Vibrometry for Smart Environment Sensing. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 225–236. https://doi.org/10.1145/3242587.3242608",
      "doi": "10.1145/3242587.3242608"
    }
  ]
}