{
  "doi": "10.1145/3411764.3445262",
  "title": "GuideBand: Intuitive 3D Multilevel Force Guidance on a Wristband in Virtual Reality",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "For haptic guidance, vibrotactile feedback is a commonly-used mechanism, but requires users to interpret its complicated patterns especially in 3D guidance, which is not intuitive and increases their mental effort. Furthermore, for haptic guidance in virtual reality (VR), not only guidance performance but also realism should be considered. Since vibrotactile feedback interferes with and reduces VR realism, it may not be proper for VR haptic guidance. Therefore, we propose a wearable device, GuideBand, to provide intuitive 3D multilevel force guidance upon the forearm, which reproduces an effect that the forearm is pulled and guided by a virtual guider or telepresent person in VR. GuideBand uses three motors to pull a wristband at different force levels in 3D space. Such feedback usually requires much larger and heavier robotic arms or exoskeletons. We conducted a just-noticeable difference study to understand users’ force level distinguishability. Based on the results, we performed a study to verify that compared with state-of-the-art vibrotactile guidance, GuideBand is more intuitive, needs a lower level of mental effort, and achieves similar guidance performance. We further conducted a VR experience study to observe how users combine and complement visual and force guidance, and prove that GuideBand enhances realism in VR guidance.",
  "tags": [
    "Haptic feedback",
    "force feedback",
    "force guidance",
    "motion guidance",
    "virtual reality",
    "wearable device."
  ],
  "authors": [
    {
      "name": "Hsin-Ruey Tsai",
      "institution": "National Chengchi University, Taiwan",
      "img": "/do/10.1145/contrib-99658729330/rel-imgonly/new.png",
      "acmid": "99658729330",
      "orcid": "0000-0003-4764-0139"
    },
    {
      "name": "Yuan-Chia Chang",
      "institution": "Kyoto University, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659130331",
      "orcid": "missing"
    },
    {
      "name": "Tzu-Yun Wei",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659587572",
      "orcid": "missing"
    },
    {
      "name": "Chih-An Tsao",
      "institution": "National Taiwan University, Taiwan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701747",
      "orcid": "0000-0002-8951-2736"
    },
    {
      "name": "Xander Chin-yuan Koo",
      "institution": "Pomona College, United States",
      "img": "/do/10.1145/contrib-99659700572/rel-imgonly/claremontgroove_claremont-zachfineberg-0154_copy.jpg",
      "acmid": "99659700572",
      "orcid": "missing"
    },
    {
      "name": "Hao-Chuan Wang",
      "institution": "UC Davis, United States",
      "img": "/do/10.1145/contrib-81553656356/rel-imgonly/14188307_10154380982350185_145248478587239185_o.jpg",
      "acmid": "81553656356",
      "orcid": "missing"
    },
    {
      "name": "Bing-Yu Chen",
      "institution": "National Taiwan University, Taiwan",
      "img": "/do/10.1145/contrib-81100108039/rel-imgonly/rchen.jpg",
      "acmid": "81100108039",
      "orcid": "0000-0003-0169-7682"
    }
  ],
  "references": [
    {
      "text": "2020. EXOS Wrist DK2, Retrieved December 15. https://exiii.jp/wrist-dk2/",
      "doi": ""
    },
    {
      "text": "2021. feelSpace navibelt, Retrieved January 6. https://www.feelspace.de/",
      "doi": ""
    },
    {
      "text": "Marco Aggravi, Florent Pausé, Paolo Robuffo Giordano, and Claudio Pacchierotti. 2018. Design and evaluation of a wearable haptic device for skin stretch, pressure, and vibrotactile stimuli. IEEE Robotics and Automation Letters 3, 3 (2018), 2166–2173.",
      "doi": ""
    },
    {
      "text": "Marco Aggravi, Gionata Salvietti, and Domenico Prattichizzo. 2016. Haptic wrist guidance using vibrations for Human-Robot teams. In 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN). IEEE, 113–118.",
      "doi": "10.1109/ROMAN.2016.7745098"
    },
    {
      "text": "Nathaniel Agharese, Tyler Cloyd, Laura H Blumenschein, Michael Raitor, Elliot W Hawkes, Heather Culbertson, and Allison M Okamura. 2018. HapWRAP: Soft growing wearable haptic device. In 2018 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 1–5.",
      "doi": ""
    },
    {
      "text": "Tomohiro Amemiya, Hideyuki Ando, and Taro Maeda. 2008. Lead-me interface for a pulling sensation from hand-held devices. ACM Transactions on Applied Perception (TAP) 5, 3 (2008), 1–17.",
      "doi": "10.1145/1402236.1402239"
    },
    {
      "text": "Matthias Berning, Florian Braun, Till Riedel, and Michael Beigl. 2015. ProximityHat: a head-worn system for subtle sensory augmentation with tactile stimulation. In Proceedings of the 2015 ACM International Symposium on Wearable Computers. ACM, 31–38.",
      "doi": "10.1145/2802083.2802088"
    },
    {
      "text": "Jérémy Bluteau, Sabine Coquillart, Yohan Payan, and Edouard Gentaz. 2008. Haptic guidance improves the visuo-manual tracking of trajectories. PLoS One 3, 3 (2008), e1775.",
      "doi": ""
    },
    {
      "text": "Simona Casini, Matteo Morvidoni, Matteo Bianchi, Manuel Catalano, Giorgio Grioli, and Antonio Bicchi. 2015. Design and realization of the cuff-clenching upper-limb force feedback wearable device for distributed mechano-tactile stimulation of normal and tangential skin forces. In 2015 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS). IEEE, 1186–1193.",
      "doi": ""
    },
    {
      "text": "Hong-Yu Chang, Wen-Jie Tseng, Chia-En Tsai, Hsin-Yu Chen, Roshan Lalintha Peiris, and Liwei Chan. 2018. FacePush: experiencing pressure forces on face with HMDs. In SIGGRAPH Asia 2018 Emerging Technologies. 1–2.",
      "doi": ""
    },
    {
      "text": "Yuan-Chia Chang, Hao-Chuan Wang, Hung-kuo Chu, Shung-Ying Lin, and Shuo-Ping Wang. 2017. AlphaRead: Support unambiguous referencing in remote collaboration with readable object annotation. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 2246–2259.",
      "doi": "10.1145/2998181.2998258"
    },
    {
      "text": "Chia-Yu Chen, Yen-Yu Chen, Yi-Ju Chung, and Neng-Hao Yu. 2016. Motion guidance sleeve: Guiding the forearm rotation through external artificial muscles. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 3272–3276.",
      "doi": "10.1145/2858036.2858275"
    },
    {
      "text": "Francesco Chinello, Claudio Pacchierotti, Joao Bimbo, Nikos G Tsagarakis, and Domenico Prattichizzo. 2017. Design and evaluation of a wearable skin stretch device for haptic guidance. IEEE Robotics and Automation Letters 3, 1 (2017), 524–531.",
      "doi": ""
    },
    {
      "text": "Francesco Chinello, Claudio Pacchierotti, Nikos G Tsagarakis, and Domenico Prattichizzo. 2016. Design of a wearable skin stretch cutaneous device for the upper limb. In 2016 IEEE Haptics Symposium (HAPTICS). IEEE, 14–20.",
      "doi": ""
    },
    {
      "text": "Inrak Choi, Eyal Ofek, Hrvoje Benko, Mike Sinclair, and Christian Holz. 2018. CLAW: A Multifunctional Handheld Haptic Controller for Grasping, Touching, and Triggering in Virtual Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, Article 654, 13 pages. https://doi.org/10.1145/3173574.3174228",
      "doi": "10.1145/3173574.3174228"
    },
    {
      "text": "Heather Culbertson, Julie M. Walker, Michael Raitor, and Allison M. Okamura. 2017. WAVES: A Wearable Asymmetric Vibration Excitation System for Presenting Three-Dimensional Translation and Rotation Cues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 4972–4982. https://doi.org/10.1145/3025453.3025741",
      "doi": "10.1145/3025453.3025741"
    },
    {
      "text": "Artem Dementyev, Hsin-Liu Kao, Inrak Choi, Deborah Ajilo, Maggie Xu, Joseph A Paradiso, Chris Schmandt, and Sean Follmer. 2016. Rovables: Miniature on-body robots as mobile wearables. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 111–120.",
      "doi": "10.1145/2984511.2984531"
    },
    {
      "text": "Antonio Frisoli, Caterina Procopio, Carmelo Chisari, Ilaria Creatini, Luca Bonfiglio, Massimo Bergamasco, Bruno Rossi, and Maria Chiara Carboncini. 2012. Positive effects of robotic exoskeleton training of upper limb reaching movements after stroke. Journal of neuroengineering and rehabilitation 9, 1(2012), 36.",
      "doi": ""
    },
    {
      "text": "Igor Gaponov, Dmitry Popov, Seung Jun Lee, and Jee-Hwan Ryu. 2017. Auxilio: A portable cable-driven exosuit for upper extremity assistance. International Journal of Control, Automation and Systems 15, 1(2017), 73–84.",
      "doi": ""
    },
    {
      "text": "Nadia Garcia-Hernandez and Vicente Parra-Vega. 2009. Active and efficient motor skill learning method used in a haptic teleoperated system. In RO-MAN 2009-The 18th IEEE International Symposium on Robot and Human Interactive Communication. IEEE, 915–920.",
      "doi": ""
    },
    {
      "text": "Ashley L Guinan, Nicholas C Hornbaker, Markus N Montandon, Andrew J Doxon, and William R Provancher. 2013. Back-to-back skin stretch feedback for communicating five degree-of-freedom direction cues. In 2013 World Haptics Conference (WHC). IEEE, 13–18.",
      "doi": ""
    },
    {
      "text": "Sebastian Günther, Florian Müller, Markus Funk, Jan Kirchner, Niloofar Dezfuli, and Max Mühlhäuser. 2018. TactileGlove: Assistive Spatial Guidance in 3D Space through Vibrotactile Navigation. In Proceedings of the 11th PErvasive Technologies Related to Assistive Environments Conference. ACM, 273–280.",
      "doi": "10.1145/3197768.3197785"
    },
    {
      "text": "Aakar Gupta, Antony Albert Raj Irudayaraj, and Ravin Balakrishnan. 2017. HapticClench: Investigating Squeeze Sensations using Memory Alloys. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 109–117.",
      "doi": "10.1145/3126594.3126598"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Kazuyuki Henmi and Tsuneo Yoshikawa. 1998. Virtual lesson and its application to virtual calligraphy system. In Proceedings. 1998 IEEE International Conference on Robotics and Automation (Cat. No. 98CH36146), Vol. 2. IEEE, 1275–1280.",
      "doi": ""
    },
    {
      "text": "Seongkook Heo, Christina Chung, Geehyuk Lee, and Daniel Wigdor. 2018. Thor’s Hammer: An Ungrounded Force Feedback Device Utilizing Propeller-Induced Propulsive Force. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 525.",
      "doi": "10.1145/3173574.3174099"
    },
    {
      "text": "Jonggi Hong, Alisha Pradhan, Jon E Froehlich, and Leah Findlater. 2017. Evaluating Wrist-Based Haptic Feedback for Non-Visual Target Finding and Path Tracing on a 2D Surface. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility. ACM, 210–219.",
      "doi": "10.1145/3132525.3132538"
    },
    {
      "text": "Yeon Sub Jin, Han Yong Chun, Eun Tai Kim, and Sungchul Kang. 2014. VT-ware: A wearable tactile device for upper extremity motion guidance. In The 23rd IEEE International Symposium on Robot and Human Interactive Communication. IEEE, 335–340.",
      "doi": ""
    },
    {
      "text": "Oliver Beren Kaul and Michael Rohs. 2017. Haptichead: A spherical vibrotactile grid around the head for 3D guidance in virtual and augmented reality. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3729–3740.",
      "doi": "10.1145/3025453.3025684"
    },
    {
      "text": "Oguz Kayhan, A Kemal Nennioglu, and Evren Samur. 2018. A skin stretch tactor for sensory substitution of wrist proprioception. In 2018 IEEE Haptics Symposium (HAPTICS). IEEE, 26–31.",
      "doi": ""
    },
    {
      "text": "JJ-W Lin, Henry Been-Lirn Duh, Donald E Parker, Habib Abi-Rached, and Thomas A Furness. 2002. Effects of field of view on presence, enjoyment, memory, and simulator sickness in a virtual environment. In Proceedings ieee virtual reality 2002. IEEE, 164–171.",
      "doi": ""
    },
    {
      "text": "Chang Liu, Chi Zhu, Hongbo Liang, Masataka Yoshioka, Yoshitaka Murata, and Yongchuan Yu. 2016. Development of a light wearable exoskeleton for upper extremity augmentation. In 2016 23rd International Conference on Mechatronics and Machine Vision in Practice (M2VIP). IEEE, 1–6.",
      "doi": ""
    },
    {
      "text": "Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++ Allowing Objects to Communicate Dynamic Use. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2515–2524.",
      "doi": "10.1145/2702123.2702128"
    },
    {
      "text": "Pedro Lopes, Sijing You, Lung-Pan Cheng, Sebastian Marwecki, and Patrick Baudisch. 2017. Providing Haptics to Walls & Heavy Objects in Virtual Reality by Means of Electrical Muscle Stimulation. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1471–1482.",
      "doi": "10.1145/3025453.3025600"
    },
    {
      "text": "Alexander Marquardt, Jens Maiero, Ernst Kruijff, Christina Trepkowski, Andrea Schwandt, André Hinkenjann, Johannes Schöning, and Wolfgang Stuerzlinger. 2018. Tactile Hand Motion and Pose Guidance for 3D Interaction. In Proceedings of the 24th ACM Symposium on Virtual Reality Software and Technology (Tokyo, Japan) (VRST ’18). ACM, New York, NY, USA, Article 3, 10 pages. https://doi.org/10.1145/3281505.3281526",
      "doi": "10.1145/3281505.3281526"
    },
    {
      "text": "Cuong Nguyen, Stephen DiVerdi, Aaron Hertzmann, and Feng Liu. 2017. CollaVR: collaborative in-headset review for VR video. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. ACM, 267–277.",
      "doi": "10.1145/3126594.3126659"
    },
    {
      "text": "Sumner L Norman, Andrew J Doxon, Brian T Gleeson, and William R Provancher. 2014. Planar hand motion guidance using fingertip skin-stretch feedback. IEEE transactions on haptics 7, 2 (2014), 121–130.",
      "doi": "10.1109/TOH.2013.2296306"
    },
    {
      "text": "Christopher J Nycz, Michael A Delph, and Gregory S Fischer. 2015. Modeling and design of a tendon actuated soft robotic exoskeleton for hemiparetic upper limb rehabilitation. In 2015 37th Annual International Conference of the IEEE Engineering in Medicine and Biology Society (EMBC). IEEE, 3889–3892.",
      "doi": ""
    },
    {
      "text": "Evan Pezent, Simone Fani, Joshua Bradley, Matteo Bianchi, and Marcia K O’Malley. 2018. Separating haptic guidance from task dynamics: A practical solution via cutaneous devices. In 2018 IEEE Haptics Symposium (HAPTICS). IEEE, 20–25.",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Gun A Lee, Jonathon D Hart, Barrett Ens, Robert W Lindeman, Bruce H Thomas, and Mark Billinghurst. 2018. Mini-me: An adaptive avatar for mixed reality remote collaboration. In Proceedings of the 2018 CHI conference on human factors in computing systems. ACM, 46.",
      "doi": "10.1145/3173574.3173620"
    },
    {
      "text": "Henning Pohl, Peter Brandes, Hung Ngo Quang, and Michael Rohs. 2017. Squeezeback: pneumatic compression for notifications. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 5318–5330.",
      "doi": "10.1145/3025453.3025526"
    },
    {
      "text": "Emanuele Ruffaldi, Alessandro Filippeschi, Antonio Frisoli, Oscar Sandoval, Carlo Alberto Avizzano, and Massimo Bergamasco. 2009. Vibrotactile perception assessment for a rowing training system. In World Haptics 2009-Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 350–355.",
      "doi": "10.1109/WHC.2009.4810849"
    },
    {
      "text": "MHD Yamen Saraiji, Tomoya Sasaki, Kai Kunze, Kouta Minamizawa, and Masahiko Inami. 2018. MetaArms: Body remapping using feet-controlled artificial arms. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 65–74.",
      "doi": "10.1145/3242587.3242665"
    },
    {
      "text": "MHD Yamen Saraiji, Tomoya Sasaki, Reo Matsumura, Kouta Minamizawa, and Masahiko Inami. 2018. Fusion: full body surrogacy for collaborative communication. In ACM SIGGRAPH 2018 Emerging Technologies. 1–2.",
      "doi": "10.1145/3214907.3214912"
    },
    {
      "text": "Maximilian Schirmer, Johannes Hartmann, Sven Bertel, and Florian Echtler. 2015. Shoe Me the Way: A Shoe-Based Tactile Interface for Eyes-Free Urban Navigation. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (Copenhagen, Denmark) (MobileHCI ’15). ACM, New York, NY, USA, 327–336. https://doi.org/10.1145/2785830.2785832",
      "doi": "10.1145/2785830.2785832"
    },
    {
      "text": "Ke Shi, Aiguo Song, Ye Li, and Changcheng Wu. 2018. Cable-driven Wearable Upper Limb Rehabilitation Robot. In 2018 IEEE International Conference on Robotics and Biomimetics (ROBIO). IEEE, 2434–2438.",
      "doi": ""
    },
    {
      "text": "Rajinder Sodhi, Hrvoje Benko, and Andrew Wilson. 2012. LightGuide: Projected Visualizations for Hand Movement Guidance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). ACM, New York, NY, USA, 179–188. https://doi.org/10.1145/2207676.2207702",
      "doi": "10.1145/2207676.2207702"
    },
    {
      "text": "Maurício Sousa, João Vieira, Daniel Medeiros, Artur Arsenio, and Joaquim Jorge. 2016. SleeveAR: Augmented Reality for Rehabilitation Using Realtime Feedback. In Proceedings of the 21st International Conference on Intelligent User Interfaces (Sonoma, California, USA) (IUI ’16). ACM, New York, NY, USA, 175–185. https://doi.org/10.1145/2856767.2856773",
      "doi": "10.1145/2856767.2856773"
    },
    {
      "text": "Daniel Spelmezan, Mareike Jacobs, Anke Hilgers, and Jan Borchers. 2009. Tactile Motion Instructions for Physical Activities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). ACM, New York, NY, USA, 2243–2252. https://doi.org/10.1145/1518701.1519044",
      "doi": "10.1145/1518701.1519044"
    },
    {
      "text": "Adam J Spiers, Janet van der Linden, Sarah Wiseman, and Maria Oshodi. 2018. Testing a shape-changing haptic navigation device with vision-impaired and sighted audiences in an immersive theater setting. IEEE Transactions on Human-Machine Systems 48, 6 (2018), 614–625.",
      "doi": ""
    },
    {
      "text": "Andrew A Stanley and Katherine J Kuchenbecker. 2012. Evaluation of tactile feedback methods for wrist rotation guidance. IEEE Transactions on Haptics 5, 3 (2012), 240–251.",
      "doi": "10.1109/TOH.2012.33"
    },
    {
      "text": "J Ridley Stroop. 1935. Studies of interference in serial verbal reactions.Journal of experimental psychology 18, 6 (1935), 643.",
      "doi": ""
    },
    {
      "text": "Emi Tamaki, Takashi Miyaki, and Jun Rekimoto. 2011. PossessedHand: Techniques for Controlling Human Hands Using Electrical Muscles Stimuli. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 543–552. https://doi.org/10.1145/1978942.1979018",
      "doi": "10.1145/1978942.1979018"
    },
    {
      "text": "Anthony Tang, Omid Fakourfar, Carman Neustaedter, and Scott Bateman. 2017. Collaboration in 360° videochat: Challenges and opportunities. Technical Report. University of Calgary.",
      "doi": ""
    },
    {
      "text": "Richard Tang, Xing-Dong Yang, Scott Bateman, Joaquim Jorge, and Anthony Tang. 2015. Physio@ Home: Exploring visual guidance and feedback techniques for physiotherapy exercises. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 4123–4132.",
      "doi": "10.1145/2702123.2702401"
    },
    {
      "text": "Hsin-Ruey Tsai, , and Bing-Yu Chen. 2019. ElastImpact: 2.5D Multilevel Instant Impact Using Elasticity on Head-Mounted Displays. In Proceedings of the 32nd Annual Symposium on User Interface Software and Technology. ACM.",
      "doi": "10.1145/3332165.3347931"
    },
    {
      "text": "Hsin-Ruey Tsai, Ching-Wen Hung, Tzu-Chun Wu, and Bing-Yu Chen. 2020. ElastOscillation: 3D Multilevel Force Feedback for Damped Oscillation on VR Controllers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376408"
    },
    {
      "text": "Hsin-Ruey Tsai, Jun Rekimoto, and Bing-Yu Chen. 2019. ElasticVR: Providing Multilevel Continuously-Changing Resistive Force and Instant Impact Using Elasticity for VR. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM.",
      "doi": "10.1145/3290605.3300450"
    },
    {
      "text": "Dzmitry Tsetserukou, Katsunari Sato, and Susumu Tachi. 2010. ExoInterfaces: novel exosceleton haptic interfaces for virtual reality, augmented sport and rehabilitation. In Proceedings of the 1st Augmented Human International Conference. ACM, 1.",
      "doi": "10.1145/1785455.1785456"
    },
    {
      "text": "Julie M Walker, Nabil Zemiti, Philippe Poignet, and Allison M Okamura. 2019. Holdable haptic device for 4-dof motion guidance. In 2019 IEEE World Haptics Conference (WHC). IEEE, 109–114.",
      "doi": ""
    },
    {
      "text": "Chi Wang, Da-Yuan Huang, Shuo-wen Hsu, Chu-En Hou, Yeu-Luen Chiu, Ruei-Che Chang, Jo-Yu Lo, and Bing-Yu Chen. 2019. Masque: Exploring Lateral Skin Stretch Feedback on the Face with Head-Mounted Displays. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 439–451.",
      "doi": "10.1145/3332165.3347898"
    },
    {
      "text": "Bernhard Weber, Simon Schätzle, Thomas Hulin, Carsten Preusche, and Barbara Deml. 2011. Evaluation of a vibrotactile feedback device for spatial guidance. In 2011 IEEE World Haptics Conference. IEEE, 349–354.",
      "doi": ""
    },
    {
      "text": "Kyle N Winfree, Jamie Gewirtz, Thomas Mather, Jonathan Fiene, and Katherine J Kuchenbecker. 2009. A high fidelity ungrounded torque feedback device: The iTorqU 2.0. In World Haptics 2009-Third Joint EuroHaptics conference and Symposium on Haptic Interfaces for Virtual Environment and Teleoperator Systems. IEEE, 261–266.",
      "doi": "10.1109/WHC.2009.4810866"
    },
    {
      "text": "Yuhang Zhao, Cynthia L Bennett, Hrvoje Benko, Edward Cutrell, Christian Holz, Meredith Ringel Morris, and Mike Sinclair. 2018. Enabling People with Visual Impairments to Navigate Virtual Reality with a Haptic and Auditory Cane Simulation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 116.",
      "doi": "10.1145/3173574.3173690"
    }
  ]
}