{
  "doi": "10.1145/3411764.3445437",
  "title": "Virtual Camera Layout Generation using a Reference Video",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "We propose a method that generates a virtual camera layout of a 3D animation scene by following the cinematic intention of a reference video. From a reference video, cinematic features such as the start frame, end frame, framing, camera movement, and the visual features of the subjects are extracted automatically. The extracted information is used to generate the virtual camera layout, which resembles the camera layout of the reference video. Our method handles stylized as well as human characters with body proportions different from those of humans. We demonstrate the effectiveness of our approach with various reference videos and 3D animation scenes. The user evaluation results show that the generated layouts are comparable to layouts created by the artist, allowing us to assert that our method can provide effective assistance to both novice and professional users when positioning a virtual camera.",
  "authors": [
    {
      "name": "Jung Eun Yoo",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "84459438457",
      "orcid": "missing"
    },
    {
      "name": "Kwanggyoon Seo",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659636943",
      "orcid": "missing"
    },
    {
      "name": "Sanghun Park",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659007646",
      "orcid": "missing"
    },
    {
      "name": "Jaedong Kim",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701640",
      "orcid": "missing"
    },
    {
      "name": "Dawon Lee",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701007",
      "orcid": "missing"
    },
    {
      "name": "Junyong Noh",
      "institution": "KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607730",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Daniel Arijon. 1991. Grammar of the film language. Silman-James Press.",
      "doi": ""
    },
    {
      "text": "Amirsaman Ashtari, Stefan Stevšić, Tobias Nägeli, Jean-Charles Bazin, and Otmar Hilliges. 2020. Capturing Subjective First-Person View Shots with Drones for Automated Cinematography. ACM Transactions on Graphics (Proceedings of ACM SIGGRAPH) 39, 5, Article 159 (Aug. 2020), 14 pages. https://doi.org/10.1145/3378673",
      "doi": ""
    },
    {
      "text": "William Bares, Scott McDermott, Christina Boudreaux, and Somying Thainimit. 2000. Virtual 3D camera composition from frame constraints. In Proceedings of the eighth ACM international conference on Multimedia. ACM, 177–186.",
      "doi": "10.1145/354384.354463"
    },
    {
      "text": "Sergio Benini, Luca Canini, and Riccardo Leonardi. 2010. Estimating cinematographic scene depth in movie shots. In 2010 IEEE International Conference on Multimedia and Expo. IEEE, 855–860.",
      "doi": ""
    },
    {
      "text": "Subhabrata Bhattacharya, Ramin Mehran, Rahul Sukthankar, and Mubarak Shah. 2014. Classification of cinematographic shots using lie algebra and its application to complex event recognition. IEEE Transactions on Multimedia 16, 3 (2014), 686–696.",
      "doi": "10.1109/TMM.2014.2300833"
    },
    {
      "text": "Ludovic Burg, Christophe Lino, and Marc Christie. 2020. Real-time Anticipation of Occlusion for Automated Camera Control in Toric Space. In Computer Graphics Forum. Wiley Online Library.",
      "doi": ""
    },
    {
      "text": "Luca Canini, Sergio Benini, and Riccardo Leonardi. 2013. Classifying cinematographic shot types. Multimedia tools and applications 62, 1 (2013), 51–73.",
      "doi": ""
    },
    {
      "text": "Liang-Chieh Chen, Yukun Zhu, George Papandreou, Florian Schroff, and Hartwig Adam. 2018. Encoder-Decoder with Atrous Separable Convolution for Semantic Image Segmentation. In ECCV.",
      "doi": ""
    },
    {
      "text": "Marc Christie, Patrick Olivier, and Jean-Marie Normand. 2008. Camera control in computer graphics. In Computer Graphics Forum, Vol. 27. Wiley Online Library, 2197–2218.",
      "doi": ""
    },
    {
      "text": "François-Xavier Derue, Mohamed Dahmane, Marc Lalonde, and Samuel Foucher. 2017. Exploiting Semantic Segmentation for Robust Camera Motion Classification. In International Conference Image Analysis and Recognition. Springer, 173–181.",
      "doi": ""
    },
    {
      "text": "David K Elson and Mark Riedl. 2007. A lightweight intelligent virtual cinematography system for machinima production. (2007).",
      "doi": ""
    },
    {
      "text": "Quentin Galvane, Marc Christie, Chrsitophe Lino, and Rémi Ronfard. 2015. Camera-on-rails: automated computation of constrained camera paths. In Proceedings of the 8th ACM SIGGRAPH Conference on Motion in Games. ACM, 151–157.",
      "doi": "10.1145/2822013.2822025"
    },
    {
      "text": "Quentin Galvane, Christophe Lino, Marc Christie, Julien Fleureau, Fabien Servant, Fran ois-louis Tariolle, and Philippe Guillotel. 2018. Directing cinematographic drones. ACM Transactions on Graphics (TOG) 37, 3 (2018), 1–18.",
      "doi": "10.1145/3181975"
    },
    {
      "text": "Quentin Galvane, Rémi Ronfard, Christophe Lino, and Marc Christie. 2015. Continuity editing for 3D animation. In Twenty-Ninth AAAI Conference on Artificial Intelligence.",
      "doi": "10.5555/2887007.2887112"
    },
    {
      "text": "Christoph Gebhardt, Benjamin Hepp, Tobias Naegeli, Stefan Stevsic, and Otmar Hilliges. 2016. Airways: Optimization-based Planning of Quadrotor Trajectories according to High-Level User Goals. In SIGCHI Conference on Human Factors in Computing Systems (San Jose, CA) (CHI ’16). ACM, New York, NY, USA.",
      "doi": "10.1145/2858036.2858353"
    },
    {
      "text": "Christoph Gebhardt, Stefan Stevsic, and Otmar Hilliges. 2018. Optimizing for Aesthetically Pleasing Quadrotor Camera Motion. ACM Transactions on Graphics (Proceedings of ACM SIGGRAPH) 37, 4, Article 90 (2018), 11 pages.",
      "doi": ""
    },
    {
      "text": "Muhammad Abul Hasan, Min Xu, Xiangjian He, and Changsheng Xu. 2014. CAMHID: Camera motion histogram descriptor and its application to cinematographic shot classification. IEEE Transactions on Circuits and Systems for Video Technology 24, 10(2014), 1682–1695.",
      "doi": ""
    },
    {
      "text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition. 770–778.",
      "doi": ""
    },
    {
      "text": "Chong Huang, Fei Gao, Jie Pan, Zhenyu Yang, Weihao Qiu, Peng Chen, Xin Yang, Shaojie Shen, and Kwang-Ting Tim Cheng. 2018. Act: An autonomous drone cinematography system for action scenes. In 2018 IEEE International Conference on Robotics and Automation (ICRA). IEEE, 7039–7046.",
      "doi": ""
    },
    {
      "text": "Chong Huang, Chuan-En Lin, Zhenyu Yang, Yan Kong, Peng Chen, Xin Yang, and Kwang-Ting Cheng. 2019. Learning to film from professional human motion videos. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 4244–4253.",
      "doi": ""
    },
    {
      "text": "Chong Huang, Zhenyu Yang, Yan Kong, Peng Chen, Xin Yang, and Kwang-Ting Tim Cheng. 2019. Learning to Capture a Film-Look Video with a Camera Drone. In 2019 International Conference on Robotics and Automation (ICRA). IEEE, 1871–1877.",
      "doi": "10.1109/ICRA.2019.8793915"
    },
    {
      "text": "Hongda Jiang, Bin Wang, Xi Wang, Marc Christie, and Baoquan Chen. 2020. Example-Driven Virtual Cinematography by Learning Camera Behaviors. ACM Trans. Graph. 39, 4, Article 45 (July 2020), 14 pages. https://doi.org/10.1145/3386569.3392427",
      "doi": "10.1145/3386569.3392427"
    },
    {
      "text": "Mackenzie Leake, Abe Davis, Anh Truong, and Maneesh Agrawala. 2017. Computational video editing for dialogue-driven scenes.ACM Trans. Graph. 36, 4 (2017), 130–1.",
      "doi": "10.1145/3072959.3073653"
    },
    {
      "text": "Christophe Lino and Marc Christie. 2012. Efficient composition for virtual camera control. In Proceedings of the ACM SIGGRAPH/Eurographics Symposium on Computer Animation. Eurographics Association, 65–70.",
      "doi": ""
    },
    {
      "text": "Christophe Lino and Marc Christie. 2015. Intuitive and efficient camera control with the toric space. ACM Transactions on Graphics (TOG) 34, 4 (2015), 82.",
      "doi": "10.1145/2766965"
    },
    {
      "text": "Amaury Louarn, Marc Christie, and Fabrice Lamarche. 2018. Automated staging for virtual cinematography. In Proceedings of the 11th Annual International Conference on Motion, Interaction, and Games. ACM, 4.",
      "doi": "10.1145/3274247.3274500"
    },
    {
      "text": "Tobias Nägeli, Lukas Meier, Alexander Domahidi, Javier Alonso-Mora, and Otmar Hilliges. 2017. Real-time Planning for Automated Multi-View Drone Cinematography. ACM Transactions on Graphics (Proceedings of ACM SIGGRAPH).",
      "doi": ""
    },
    {
      "text": "Roberto Ranon and Tommaso Urli. 2014. Improving the efficiency of viewpoint composition. IEEE Transactions on Visualization and Computer Graphics 20, 5(2014), 795–807.",
      "doi": "10.1109/TVCG.2013.2297932"
    },
    {
      "text": "Anyi Rao, Jiaze Wang, Linning Xu, Xuekun Jiang, Qingqiu Huang, Bolei Zhou, and Dahua Lin. 2020. A Unified Framework for Shot Type Classification Based on Subject Centric Lens. In The European Conference on Computer Vision (ECCV).",
      "doi": ""
    },
    {
      "text": "Grégory Rogez, Philippe Weinzaepfel, and Cordelia Schmid. 2019. LCR-Net++: Multi-person 2D and 3D Pose Detection in Natural Images. IEEE Transactions on Pattern Analysis and Machine Intelligence (2019).",
      "doi": ""
    },
    {
      "text": "Remi Ronfard, Vineet Gandhi, and Laurent Boiron. 2015. The prose storyboard language: A tool for annotating and directing movies. (2015). arXiv:1508.07593",
      "doi": ""
    },
    {
      "text": "Nataniel Ruiz, Eunji Chong, and James M. Rehg. 2018. Fine-Grained Head Pose Estimation Without Keypoints. In The IEEE Conference on Computer Vision and Pattern Recognition (CVPR) Workshops.",
      "doi": ""
    },
    {
      "text": "Mattia Savardi, Alberto Signoroni, Pierangelo Migliorati, and Sergio Benini. 2018. Shot Scale Analysis in Movies by Convolutional Neural Networks. In 2018 25th IEEE International Conference on Image Processing (ICIP). IEEE, 2620–2624.",
      "doi": ""
    },
    {
      "text": "Alan F Smeaton, Paul Over, and Wessel Kraaij. 2006. Evaluation campaigns and TRECVid. In Proceedings of the 8th ACM international workshop on Multimedia information retrieval. ACM, 321–330.",
      "doi": "10.1145/1178677.1178722"
    },
    {
      "text": "Hui-Yin Wu, Francesca Palù, Roberto Ranon, and Marc Christie. 2018. Thinking Like a Director: Film Editing Patterns for Virtual Cinematographic Storytelling. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) 14, 4 (2018), 81.",
      "doi": ""
    },
    {
      "text": "Chi Zhang and Weiqiang Wang. 2012. A robust and efficient shot boundary detection approach based on fisher criterion. In Proceedings of the 20th ACM international conference on Multimedia. ACM, 701–704.",
      "doi": "10.1145/2393347.2396291"
    }
  ]
}