{
  "doi": "10.1145/3411764.3445480",
  "title": "A Taxonomy of Vulnerable Road Users for HCI Based On A Systematic Literature Review",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Recent automotive research often focuses on automated driving, including the interaction between automated vehicles (AVs) and so-called “vulnerable road users” (VRUs). While road safety statistics and traffic psychology at least define VRUs as pedestrians, cyclists, and motorcyclists, many publications on human-vehicle interaction use the term without even defining it. The actual target group remains unclear. Since each group already poses a broad spectrum of research challenges, a one-fits-all solution seems unrealistic and inappropriate, and a much clearer differentiation is required. To foster clarity and comprehensibility, we propose a literature-based taxonomy providing a structured separation of (vulnerable) road users, designed to particularly (but not exclusively) support research on the communication between VRUs and AVs. It consists of two conceptual hierarchies and will help practitioners and researchers by providing a uniform and comparable set of terms needed for the design, implementation, and description of HCI applications.",
  "tags": [
    "eHMIs",
    "vulnerable road users",
    "external communication",
    "taxonomy",
    "Automated vehicles"
  ],
  "authors": [
    {
      "name": "Kai Holländer",
      "institution": "LMU Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659332546",
      "orcid": "missing"
    },
    {
      "name": "Mark Colley",
      "institution": "Institute of Media Informatics Ulm University, Germany",
      "img": "/do/10.1145/contrib-99659260328/rel-imgonly/img_6166.jpg",
      "acmid": "99659260328",
      "orcid": "0000-0001-5207-5029"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "University of Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    },
    {
      "name": "Andreas Butz",
      "institution": "LMU Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100266654",
      "orcid": "0000-0002-9007-9888"
    }
  ],
  "references": [
    {
      "text": "Claudia Ackermann, Matthias Beggiato, Luka-Franziska Bluhm, Alexandra Löw, and Josef F Krems. 2019. Deceleration parameters and their applicability as informal communication signal between pedestrians and automated vehicles. Transportation research part F: traffic psychology and behaviour 62 (2019), 757–768.",
      "doi": ""
    },
    {
      "text": "Claudia Ackermann, Matthias Beggiato, Sarah Schubert, and Josef F Krems. 2019. An experimental study to investigate design and assessment criteria: What is important for communication between pedestrians and automated vehicles?Applied ergonomics 75(2019), 272–282.",
      "doi": ""
    },
    {
      "text": "Sander Ackermans, Debargha Dey, Peter Ruijten, Raymond H Cuijpers, and Bastian Pfleging. 2020. The Effects of Explicit Intention Communication, Conspicuous Sensors, and Pedestrian Attitude in Interactions with Automated Vehicles. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376197"
    },
    {
      "text": "National Highway Traffic Safety Administration. 2020. Crash Report Sampling System. https://www.nhtsa.gov/crash-data-systems/crash-report-sampling-system. [Online; accessed 24-MARCH-2020].",
      "doi": ""
    },
    {
      "text": "National Highway Traffic Safety Administration. 2020. Fatality Analysis Reporting System (FARS). https://www.nhtsa.gov/research-data/fatality-analysis-reporting-system-fars. [Online; accessed 24-MARCH-2020].",
      "doi": ""
    },
    {
      "text": "National Highway Traffic Safety Administration. 2020. Fatality and Injury Reporting System Tool (FIRST). https://cdan.nhtsa.gov/query. [Online; accessed 24-MARCH-2020].",
      "doi": ""
    },
    {
      "text": "National Highway Traffic Safety Administration. 2020. NASS General Estimates System. https://www.nhtsa.gov/national-automotive-sampling-system-nass/nass-general-estimates-system. [Online; accessed 24-MARCH-2020].",
      "doi": ""
    },
    {
      "text": "T Allen, S Newstead, MG Lenné, R McClure, P Hillard, M Symmons, and L Day. 2017. Contributing factors to motorcycle injury crashes in Victoria, Australia. Transportation research part F: traffic psychology and behaviour 45 (2017), 157–168.",
      "doi": ""
    },
    {
      "text": "Rolla Almodfer, Zhixiang Fang Shengwu Xiong, and Senwen Zheng” Xiangzhen Kong. 2016. Quantitative analysis of lane-based pedestrian-vehicle conflict at a non-signalized marked crosswalk. Transportation Research Part F: Traffic Psychology and Behaviour 42 (2016), 468 – 478.",
      "doi": ""
    },
    {
      "text": "Rushdi Alsaleh and Tarek Sayed. 2020. Modeling pedestrian-cyclist interactions in shared space using inverse reinforcement learning. Transportation research part F: traffic psychology and behaviour 70 (2020), 37–57.",
      "doi": ""
    },
    {
      "text": "Paulo Rui Anciaes and Peter Jones. 2018. Estimating preferences for different types of pedestrian crossing facilities. Transportation research part F: traffic psychology and behaviour 52 (2018), 222–237.",
      "doi": ""
    },
    {
      "text": "Dago Antov, Aurélie Banet, Cécile Barbier, Thierry Bellet, Yaw Bimpeh, Ankatrien Boulanger, Christian Brandstätter, Virpi Britschgi, Michael Brosnan, Ilona Buttler, 2012. European road users’ risk perception and mobility: the SARTRE 4 survey. IFSTTAR, European Commission on Road Safety.",
      "doi": ""
    },
    {
      "text": "Virpi Anttila and Juha Luoma. 2005. Surrogate in-vehicle information systems and driver behaviour in an urban environment: A field study on the effects of visual and cognitive load. Transportation research part F: traffic psychology and behaviour 8, 2(2005), 13.",
      "doi": ""
    },
    {
      "text": "Ashratuz Zavin Asha, Christopher Smith, Lora Oehlberg, Sowmya Somanath, and Ehud Sharlin. 2020. Views from the Wheelchair: Understanding Interaction between Autonomous Vehicle and Pedestrians with Reduced Mobility. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–8.",
      "doi": "10.1145/3334480.3383041"
    },
    {
      "text": "Marek Bachmann, Michel Morold, and Klaus David. 2020. On the Required Movement Recognition Accuracy in Cooperative VRU Collision Avoidance Systems. IEEE Transactions on Intelligent Transportation Systems 1, 2020(2020), 10.",
      "doi": ""
    },
    {
      "text": "Pavlo Bazilinskyy, Dimitra Dodou, and Joost De Winter. 2019. Survey on eHMI concepts: The effect of text, color, and perspective. Transportation research part F: traffic psychology and behaviour 67 (2019), 175–194.",
      "doi": ""
    },
    {
      "text": "Matthias Beggiato, Claudia Witzlack, and Josef F. Krems. 2017. Gap Acceptance and Time-To-Arrival Estimates as Basis for Informal Communication between Pedestrians and Vehicles. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(Oldenburg, Germany) (AutomotiveUI ’17). Association for Computing Machinery, New York, NY, USA, 50–57. https://doi.org/10.1145/3122986.3122995",
      "doi": "10.1145/3122986.3122995"
    },
    {
      "text": "Klaus Bengler, Michael Rettenmaier, Nicole Fritz, and Alexander Feierle. 2020. From HMI to HMIs: Towards an HMI Framework for Automated Driving. Information 11, 2 (2020), 61.",
      "doi": ""
    },
    {
      "text": "Klaus Bengler, Markus Zimmermann, Dino Bortot, Martin Kienle, and Daniel Damböck. 2012. Interaction principles for cooperative human-machine systems. it-Information Technology Methoden und innovative Anwendungen der Informatik und Informationstechnik 54, 4 (2012), 157–164.",
      "doi": ""
    },
    {
      "text": "Inger Marie Bernhoft and Gitte Carstensen. 2008. Preferences and behaviour of pedestrians and cyclists by age and gender. Transportation Research Part F: Traffic Psychology and Behaviour 11, 2(2008), 83–95.",
      "doi": ""
    },
    {
      "text": "Federica Biassoni, Manuela Bina, Federica Confalonieri, and Rita Ciceri. 2018. Visual exploration of pedestrian crossings by adults and children: Comparison of strategies. Transportation research part F: traffic psychology and behaviour 56 (2018), 227–235.",
      "doi": ""
    },
    {
      "text": "Cem Bila, Fikret Sivrikaya, Manzoor A Khan, and Sahin Albayrak. 2016. Vehicles of the future: A survey of research on safety issues. IEEE Transactions on Intelligent Transportation Systems 18, 5(2016), 1046–1065.",
      "doi": "10.1109/TITS.2016.2600300"
    },
    {
      "text": "Marc-Philipp Böckle, Anna Pernestål Brenden, Maria Klingegård, Azra Habibovic, and Martijn Bout. 2017. SAV2P: Exploring the Impact of an Interface for Shared Automated Vehicles on Pedestrians’ Experience. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications Adjunct(Oldenburg, Germany) (AutomotiveUI ’17). Association for Computing Machinery, New York, NY, USA, 136–140. https://doi.org/10.1145/3131726.3131765",
      "doi": "10.1145/3131726.3131765"
    },
    {
      "text": "Paulo Vinicius Koerich Borges, Robert Zlot, and Ashley Tews. 2013. Integrating off-board cameras and vehicle on-board localization for pedestrian safety. IEEE Transactions on Intelligent Transportation Systems 14, 2(2013), 720–730.",
      "doi": "10.1109/TITS.2012.2235431"
    },
    {
      "text": "Gustav Bösehans and Gustavo Martineli Massola. 2018. Commuter cyclists’ risk perceptions and behaviour in the city of São Paulo. Transportation Research Part F: Traffic Psychology and Behaviour 58 (2018), 414–430.",
      "doi": ""
    },
    {
      "text": "Rupert RA Bourne, Seth R Flaxman, Tasanee Braithwaite, Maria V Cicinelli, Aditi Das, Jost B Jonas, Jill Keeffe, John H Kempen, Janet Leasher, Hans Limburg, 2017. Magnitude, temporal trends, and projections of the global prevalence of blindness and distance and near vision impairment: a systematic review and meta-analysis. The Lancet Global Health 5, 9 (2017), e888–e897.",
      "doi": ""
    },
    {
      "text": "Kris Brijs, Tom Brijs, Socheata Sann, Tú Anh Trinh, Geert Wets, and Robert AC Ruiter. 2014. Psychological determinants of motorcycle helmet use among young adults in Cambodia. Transportation research part F: traffic psychology and behaviour 26 (2014), 273–290.",
      "doi": ""
    },
    {
      "text": "Alberto Broggi, Pietro Cerri, Stefano Ghidoni, Paolo Grisleri, and Ho Gi Jung. 2009. A new approach to urban pedestrian detection for automatic braking. IEEE Transactions on intelligent transportation systems 10, 4(2009), 594–605.",
      "doi": "10.1109/TITS.2009.2032770"
    },
    {
      "text": "Victor Cantillo, Julian Arellana, and Manuel Rolong. 2015. Modelling pedestrian crossing behaviour in urban roads: A latent variable approach. Transportation research part F: traffic psychology and behaviour 32 (2015), 56–67.",
      "doi": ""
    },
    {
      "text": "Magnus Carlsson, Gordon B Dahl, Björn Öckert, and Dan-Olof Rooth. 2015. The effect of schooling on cognitive skills. Review of Economics and Statistics 97, 3 (2015), 533–547.",
      "doi": ""
    },
    {
      "text": "Viola Cavallo, Aurélie Dommes, Nguyen-Thong Dang, and Fabrice Vienne. 2019. A street-crossing simulator for studying and training pedestrians. Transportation research part F: traffic psychology and behaviour 61 (2019), 217–228.",
      "doi": ""
    },
    {
      "text": "Sandra Céspedes, Juan Salamanca, Alexis Yáñez, and Daniel Vinasco. 2018. Group cycling meets technology: A cooperative cycling cyber-physical system. IEEE Transactions on Intelligent Transportation Systems 20, 8(2018), 3178–3188.",
      "doi": ""
    },
    {
      "text": "Chia-Ming Chang, Koki Toda, Takeo Igarashi, Masahiro Miyata, and Yasuhiro Kobayashi. 2018. A Video-Based Study Comparing Communication Modalities between an Autonomous Car and a Pedestrian. In Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Toronto, ON, Canada) (AutomotiveUI ’18). Association for Computing Machinery, New York, NY, USA, 104–109. https://doi.org/10.1145/3239092.3265950",
      "doi": "10.1145/3239092.3265950"
    },
    {
      "text": "Chia-Ming Chang, Koki Toda, Daisuke Sakamoto, and Takeo Igarashi. 2017. Eyes on a Car: An Interface Design for Communication between an Autonomous Car and a Pedestrian. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(Oldenburg, Germany) (AutomotiveUI ’17). Association for Computing Machinery, New York, NY, USA, 65–73. https://doi.org/10.1145/3122986.3122989",
      "doi": "10.1145/3122986.3122989"
    },
    {
      "text": "Fangrong Chang, Pengpeng Xu, Hanchu Zhou, Jaeyoung Lee, and Helai Huang. 2019. Identifying motorcycle high-risk traffic scenarios through interactive analysis of driver behavior and traffic characteristics. Transportation research part F: traffic psychology and behaviour 62 (2019), 844–854.",
      "doi": ""
    },
    {
      "text": "Lei Chen and Cristofer Englund. 2015. Cooperative intersection management: A survey. IEEE Transactions on Intelligent Transportation Systems 17, 2(2015), 570–586.",
      "doi": "10.1109/TITS.2015.2471812"
    },
    {
      "text": "Wenxiang Chen, Xiangling Zhuang, Zixin Cui, and Guojie Ma. 2019. Drivers’ recognition of pedestrian road-crossing intentions: Performance and process. Transportation research part F: traffic psychology and behaviour 64 (2019), 552–564.",
      "doi": ""
    },
    {
      "text": "Michael Clamann, Miles Aubert, and Mary L Cummings. 2017. Evaluation of vehicle-to-pedestrian communication displays for autonomous vehicles. Technical Report. The National Academies of Sciences, Engineering, and Medicine.",
      "doi": ""
    },
    {
      "text": "Mark Colley, Stefanos Can Mytilineos, Marcel Walch, Jan Gugenheimer, and Enrico Rukzio. 2020. Evaluating Highly Automated Trucks as Signaling Lights. In Proceedings of the 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3409120.3410647",
      "doi": "10.1145/3409120.3410647"
    },
    {
      "text": "Mark Colley and Rukzio Rukzio. 2020. A Design Space for External Communication of Autonomous Vehicles. In Proceedings of the 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(AutomotiveUI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3409120.3410646",
      "doi": "10.1145/3409120.3410646"
    },
    {
      "text": "Mark Colley and Rukzio Rukzio. 2020. Towards a Design Space for External Communication of Autonomous Vehicles. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, Hawaii USA) (CHI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3334480.3382844",
      "doi": "10.1145/3334480.3382844"
    },
    {
      "text": "Mark Colley, Marcel Walch, Jan Gugenheimer, Ali Askari, and Rukzio Rukzio. 2020. Towards Inclusive External Communication of Autonomous Vehicles for Pedestrians with Vision Impairments. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, Hawaii USA) (CHI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3313831.3376472 Accepted.",
      "doi": "10.1145/3313831.3376472"
    },
    {
      "text": "Mark Colley, Marcel Walch, Jan Gugenheimer, and Enrico Rukzio. 2019. Including people with impairments from the start: external communication of autonomous vehicles. In Proceedings of the 11th international conference on automotive user interfaces and interactive vehicular applications: adjunct proceedings. Association for Computing Machinery, New York, NY, USA, 307–314.",
      "doi": "10.1145/3349263.3351521"
    },
    {
      "text": "Mark Colley, Marcel Walch, and Rukzio Rukzio. 2020. Unveiling the Lack of Scalability in Research on External Communication of Autonomous Vehicles. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, Hawaii USA) (CHI ’20). ACM, Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3334480.3382865",
      "doi": "10.1145/3334480.3382865"
    },
    {
      "text": "BR Connell, M Jones, R Mace, J Mueller, A Mullick, E Ostroff, J Sanford, E Steinfeld, M Story, and G Vanderheiden. 1997. The principles of universal design, Version 2.0, Raleigh, NC.",
      "doi": ""
    },
    {
      "text": "Aymery Constant and Emmanuel Lagarde. 2010. Protecting vulnerable road users from injury. PLoS medicine 7, 3 (2010).",
      "doi": ""
    },
    {
      "text": "Bryant J Cratty. 1979. Perceptual and motor development in infants and children.",
      "doi": ""
    },
    {
      "text": "Mioara Cristea and Alexandra Gheorghiu. 2016. Attitude, perceived behavioral control, and intention to adopt risky behaviors. Transportation research part F: traffic psychology and behaviour 43 (2016), 157–165.",
      "doi": ""
    },
    {
      "text": "David Crundall, Aaron Howard, and Angela Young. 2017. Perceptual training to increase drivers’ ability to spot motorcycles at T-junctions. Transportation research part F: traffic psychology and behaviour 48 (2017), 1–12.",
      "doi": ""
    },
    {
      "text": "Mercy Dada, Mark Zuidgeest, and Stephane Hess. 2019. Modelling pedestrian crossing choice on Cape Town’s freeways: Caught between a rock and a hard place?Transportation research part F: traffic psychology and behaviour 60 (2019), 245–261.",
      "doi": ""
    },
    {
      "text": "Marco De Angelis, Víctor Marín Puchades, Federico Fraboni, Luca Pietrantoni, and Gabriele Prati. 2017. Negative attitudes towards cyclists influence the acceptance of an in-vehicle cyclist detection system. Transportation Research Part F: Traffic Psychology and Behaviour 49 (2017), 244–256.",
      "doi": ""
    },
    {
      "text": "Tim De Ceunynck, Stijn Daniels, Bert Vanderspikken, Kris Brijs, Elke Hermans, Tom Brijs, and Geert Wets. 2016. Is there a spillover effect of a right turn on red permission for bicyclists?Transportation research part F: traffic psychology and behaviour 36 (2016), 35–45.",
      "doi": ""
    },
    {
      "text": "Koen De Clercq, Andre Dietrich, Juan Pablo Núñez Velasco, Joost De Winter, and Riender Happee. 2019. External human-machine interfaces on automated vehicles: effects on pedestrian crossing decisions. Human factors 61, 8 (2019), 1353–1370.",
      "doi": ""
    },
    {
      "text": "Dick de Waard, Alina Prey, Alena K Mohr, and Frank Westerhuis. 2020. Differences in cycling performance of Dutch and non-Dutch students in the Netherlands. Transportation research part F: traffic psychology and behaviour 68 (2020), 285–292.",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Daniel W. Carruth, Muztaba Fuad, Laura M. Stanley, and Darren Frey. 2020. Comparison of Child and Adult Pedestrian Perspectives of External Features on Autonomous Vehicles Using Virtual Reality Experiment. In Advances in Human Factors of Transportation, Neville Stanton(Ed.). Springer International Publishing, Cham, 145–156.",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, Lesley J Strawderman, and Daniel W Carruth. 2018. Investigating pedestrian suggestions for external features on fully autonomous vehicles: A virtual reality experiment. Transportation research part F: traffic psychology and behaviour 59 (2018), 135–149.",
      "doi": ""
    },
    {
      "text": "Shuchisnigdha Deb, B. Warner, S. Poudel, and S. Bhandari. 2016. Identification of external design preferences in autonomous vehicles. In Proc. IIE Res. Conf.Institute of Industrial Engineers, Peachtree Corners, GA, USA, 69–44.",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Azra Habibovic, Bastian Pfleging, Marieke Martens, and Jacques Terken. 2020. Color and Animation Preferences for a Light Band EHMI in Interactions Between Automated Vehicles and Pedestrians. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376325",
      "doi": "10.1145/3313831.3376325"
    },
    {
      "text": "Debargha Dey, Kai Holländer, Melanie Berger, Berry Eggen, Marieke Martens, Bastian Pfleging, and Jacques Terken. 2020. Distance-Dependent EHMIs for the Interaction Between Automated Vehicles and Pedestrians. In 12th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Virtual Event, DC, USA) (AutomotiveUI ’20). Association for Computing Machinery, New York, NY, USA, 192–204. https://doi.org/10.1145/3409120.3410642",
      "doi": "10.1145/3409120.3410642"
    },
    {
      "text": "Debargha Dey, Marieke Martens, Berry Eggen, and Jacques Terken. 2019. Pedestrian road-crossing willingness as a function of vehicle automation, external appearance, and driving behaviour. Transportation research part F: traffic psychology and behaviour 65 (2019), 191–205.",
      "doi": ""
    },
    {
      "text": "Debargha Dey, Marieke Martens, Chao Wang, Felix Ros, and Jacques Terken. 2018. Interface concepts for intent communication from autonomous vehicles to vulnerable road users. In Adjunct Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, New York, NY, USA, 82–86.",
      "doi": "10.1145/3239092.3265946"
    },
    {
      "text": "Debargha Dey, Francesco Walker, Marieke Martens, and Jacques Terken. 2019. Gaze Patterns in Pedestrian Interaction with Vehicles: Towards Effective Design of External Human-Machine Interfaces for Automated Vehicles. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 369–378. https://doi.org/10.1145/3342197.3344523",
      "doi": "10.1145/3342197.3344523"
    },
    {
      "text": "Leandro L Di Stasi, D Contreras, A Cándido, JJ Cañas, and A Catena. 2011. Behavioral and eye-movement measures to track improvements in driving skills of vulnerable road users: First-time motorcycle riders. Transportation research part F: traffic psychology and behaviour 14, 1(2011), 26–35.",
      "doi": ""
    },
    {
      "text": "Aurélie Dommes and Viola Cavallo. 2012. Can simulator-based training improve street-crossing safety for elderly pedestrians?Transportation research part F: traffic psychology and behaviour 15, 2(2012), 206–218.",
      "doi": ""
    },
    {
      "text": "Chunjiao Dong, Asad J Khattak, David Clarke, and Kun Xie. 2018. Exploring injury severity correlates of vulnerable roadway users involved crashes. Connected and Automated Vehicles and Safety of Vulnerable Road Users: A Systems Approach 26, 3 (2018), 32.",
      "doi": ""
    },
    {
      "text": "Ronan Doorley, Vikram Pakrashi, Eoin Byrne, Samuel Comerford, Bidisha Ghosh, and John A Groeger. 2015. Analysis of heart rate variability amongst cyclists under perceived variations of risk exposure. Transportation research part F: traffic psychology and behaviour 28 (2015), 40–54.",
      "doi": ""
    },
    {
      "text": "Igor Doric, Anna-Katharina Frison, Philipp Wintersberger, Andreas Riener, Sebastian Wittmann, Matheus Zimmermann, and Thomas Brandmeier. 2016. A Novel Approach for Researching Crossing Behavior and Risk Acceptance: The Pedestrian Simulator. In Adjunct Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Ann Arbor, MI, USA) (AutomotiveUI ’16 Adjunct). Association for Computing Machinery, New York, NY, USA, 39–44. https://doi.org/10.1145/3004323.3004324",
      "doi": "10.1145/3004323.3004324"
    },
    {
      "text": "Igor Doric, Andreas Reitberger, Sebastian Wittmann, Robert Harrison, and Thomas Brandmeier. 2016. A novel approach for the test of active pedestrian safety systems. IEEE Transactions on Intelligent Transportation Systems 18, 5(2016), 1299–1312.",
      "doi": "10.1109/TITS.2016.2606439"
    },
    {
      "text": "Marco Dozza and Andre Fernandez. 2013. Understanding bicycle dynamics and cyclist behavior from naturalistic field data (November 2012). IEEE Transactions on intelligent transportation systems 15, 1(2013), 376–384.",
      "doi": "10.1109/TITS.2013.2279687"
    },
    {
      "text": "Marco Dozza, Giulio Francesco Bianchi Piccinini, and Julia Werneke. 2016. Using naturalistic data to assess e-cyclist behavior. Transportation research part F: traffic psychology and behaviour 41 (2016), 217–226.",
      "doi": ""
    },
    {
      "text": "Addison Duvall. 2020. 5 Problems With ‘Universal’ Design. https://www.hongkiat.com/blog/universal-design-problems/.",
      "doi": ""
    },
    {
      "text": "Stefan Eisses. 2011. ITS AP3-4 Final Report - Safety and comfort of the Vulnerable Road User. Technical Report. European Commission of Mobility and Transport.",
      "doi": ""
    },
    {
      "text": "Elke-Henriette Erdei, Jochen Steinmann, and Carmen Hagemeister. 2020. Comparing perception of signals in different modalities during the cycling task: A field study. Transportation Research Part F: Traffic Psychology and Behaviour 73 (2020), 259–270.",
      "doi": ""
    },
    {
      "text": "Mahsa Esmaeilikia, Igor Radun, Raphael Grzebieta, and Jake Olivier. 2019. Bicycle helmets and risky behaviour: A systematic review. Transportation research part F: traffic psychology and behaviour 60 (2019), 299–310.",
      "doi": ""
    },
    {
      "text": "Jorge E Espinosa, Sergio A Velastín, and John W Branch. 2020. Detection of Motorcycles in Urban Traffic Using Video Analysis: A Review. IEEE Transactions on Intelligent Transportation Systems 2020, 1(2020), 1–16.",
      "doi": ""
    },
    {
      "text": "Chloé Eyssartier, Sébastien Meineri, and Nicolas Gueguen. 2017. Motorcyclists’ intention to exceed the speed limit on a 90 km/h road: Effect of the type of motorcycles. Transportation research part F: traffic psychology and behaviour 45 (2017), 183–193.",
      "doi": ""
    },
    {
      "text": "Daniel J Fagnant and Kara Kockelman. 2015. Preparing a nation for autonomous vehicles: opportunities, barriers and policy recommendations. Transportation Research Part A: Policy and Practice 77 (2015), 167–181.",
      "doi": ""
    },
    {
      "text": "Zhijie Fang and Antonio M López. 2019. Intention Recognition of Pedestrians and Cyclists by 2D Pose Estimation. IEEE Transactions on Intelligent Transportation Systems 2019, 1(2019), 1–11.",
      "doi": ""
    },
    {
      "text": "Haneen Farah, Giulio Bianchi Piccinini, Makoto Itoh, and Marco Dozza. 2019. Modelling overtaking strategy and lateral distance in car-to-cyclist overtaking on rural roads: A driving simulator experiment. Transportation research part F: traffic psychology and behaviour 63 (2019), 226–239.",
      "doi": ""
    },
    {
      "text": "Di Feng, Christian Haase-Schütz, Lars Rosenbaum, Heinz Hertlein, Claudius Glaeser, Fabian Timm, Werner Wiesbeck, and Klaus Dietmayer. 2020. Deep multi-modal object detection and semantic segmentation for autonomous driving: Datasets, methods, and challenges. IEEE Transactions on Intelligent Transportation Systems 2020, 1(2020), 1–20.",
      "doi": ""
    },
    {
      "text": "Kayla Fleskes and David S Hurwitz. 2019. Influence of bicyclist presence on driver performance during automated vehicle take-over requests. Transportation research part F: traffic psychology and behaviour 64 (2019), 495–508.",
      "doi": ""
    },
    {
      "text": "Evelyn Florentine, Mark Adam Ang, Scott Drew Pendleton, Hans Andersen, and Marcelo H. Ang. 2016. Pedestrian Notification Methods in Autonomous Vehicles for Multi-Class Mobility-on-Demand Service. In Proceedings of the Fourth International Conference on Human Agent Interaction (Biopolis, Singapore) (HAI ’16). Association for Computing Machinery, New York, NY, USA, 387–392. https://doi.org/10.1145/2974804.2974833",
      "doi": "10.1145/2974804.2974833"
    },
    {
      "text": "Carlos Flores, Pierre Merdrignac, Raoul de Charette, Francisco Navas, Vicente Milanés, and Fawzi Nashashibi. 2018. A cooperative car-following/emergency braking system with prediction-based pedestrian avoidance capabilities. IEEE Transactions on Intelligent Transportation Systems 20, 5(2018), 1837–1846.",
      "doi": ""
    },
    {
      "text": "Jonathan Flower and John Parkin. 2019. Understanding attitudes to priorities at side road junctions. Transportation research part F: traffic psychology and behaviour 62 (2019), 246–257.",
      "doi": ""
    },
    {
      "text": "Tanja Fuest, Lenja Sorokin, Hanna Bellem, and Klaus Bengler. 2018. Taxonomy of Traffic Situations for the Interaction between Automated Vehicles and Human Road Users. In Advances in Human Aspects of Transportation, Neville A Stanton (Ed.). Springer International Publishing, Cham, 708–719.",
      "doi": ""
    },
    {
      "text": "Fiona Fylan, Mark King, Dean Brough, Alex A Black, Neil King, Laura A Bentley, and Joanne M Wood. 2020. Increasing conspicuity on night-time roads: perspectives from cyclists and runners. Transportation research part F: traffic psychology and behaviour 68 (2020), 161–170.",
      "doi": ""
    },
    {
      "text": "Tarak Gandhi and Mohan Manubhai Trivedi. 2007. Pedestrian protection systems: Issues, survey, and challenges. IEEE Transactions on intelligent Transportation systems 8, 3(2007), 413–430.",
      "doi": "10.1109/TITS.2007.903444"
    },
    {
      "text": "Billy Gannon, Lisa Rosta, Maria Reeve, Melissa K Hyde, and Ioni Lewis. 2014. Does it matter whether friends, parents, or peers drink walk? Identifying which normative influences predict young pedestrian’s decisions to walk while intoxicated. Transportation research part F: traffic psychology and behaviour 22 (2014), 12–24.",
      "doi": ""
    },
    {
      "text": "Ming Gao, Lisheng Jin, Yuying Jiang, and Baicang Guo. 2019. Manifold Siamese Network: A Novel Visual Tracking ConvNet for Autonomous Vehicles. IEEE Transactions on Intelligent Transportation Systems 21, 4(2019), 1612–1623.",
      "doi": ""
    },
    {
      "text": "Eva Geurts, Mieke Haesen, Paul Dendale, Kris Luyten, and Karin Coninx. 2016. Back on Bike: The BoB Mobile Cycling App for Secondary Prevention in Cardiac Patients. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 135–146. https://doi.org/10.1145/2935334.2935377",
      "doi": "10.1145/2935334.2935377"
    },
    {
      "text": "Haniyeh Ghomi, Morteza Bagheri, Liping Fu, and Luis F Miranda-Moreno. 2016. Analyzing injury severity factors at highway railway grade crossing accidents involving vulnerable road users: A comparative study. Traffic injury prevention 17, 8 (2016), 833–841.",
      "doi": ""
    },
    {
      "text": "Samuel Gidel, Paul Checchin, Christophe Blanc, Thierry Chateau, and Laurent Trassoudaine. 2010. Pedestrian detection and tracking in an urban environment using a multilayer laser scanner. IEEE Transactions on Intelligent Transportation Systems 11, 3(2010), 579–588.",
      "doi": "10.1109/TITS.2010.2045122"
    },
    {
      "text": "Shane Gilroy, Edward Jones, and Martin Glavin. 2019. Overcoming Occlusion in the Automotive Environment-A Review. IEEE Transactions on Intelligent Transportation Systems 2019, 1(2019), 1–13.",
      "doi": ""
    },
    {
      "text": "Charles Goldenbeld, Divera Twisk, and Saskia de Craen. 2004. Short and long term effects of moped rider training: a field experiment. Transportation research part F: traffic psychology and behaviour 7, 1(2004), 1–16.",
      "doi": ""
    },
    {
      "text": "Michael Goldhammer, Sebastian Köhler, Stefan Zernetsch, Konrad Doll, Bernhard Sick, and Klaus Dietmayer. 2019. Intentions of Vulnerable Road Users–Detection and Forecasting by Means of Machine Learning. IEEE Transactions on Intelligent Transportation Systems 21, 7(2019), 3035–3045.",
      "doi": "10.1109/TITS.2019.2923319"
    },
    {
      "text": "Andrea Gorrini, Luca Crociani, Giuseppe Vizzari, and Stefania Bandini. 2018. Observation results on pedestrian-vehicle interactions at non-signalized intersections towards simulation. Transportation research part F: traffic psychology and behaviour 59 (2018), 269–285.",
      "doi": ""
    },
    {
      "text": "Daniel Greene, Juan Liu, Jim Reich, Yukio Hirokawa, Akio Shinagawa, Hayuru Ito, and Tatsuo Mikami. 2011. An efficient computational architecture for a collision early-warning system for vehicles, pedestrians, and bicyclists. IEEE Transactions on intelligent transportation systems 12, 4(2011), 942–953.",
      "doi": "10.1109/TITS.2010.2097594"
    },
    {
      "text": "Uwe Gruenefeld, Sebastian Weiß, Andreas Löcken, Isabella Virgilio, Andrew L. Kun, and Susanne Boll. 2019. VRoad: Gesture-Based Interaction between Pedestrians and Automated Vehicles in Virtual Reality. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: Adjunct Proceedings (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 399–404. https://doi.org/10.1145/3349263.3351511",
      "doi": "10.1145/3349263.3351511"
    },
    {
      "text": "Henry P Gunson, Vanessa Beanland, and Paul M Salmon. 2019. Road-related anger in motorcyclists versus car drivers. Transportation research part F: traffic psychology and behaviour 62 (2019), 327–338.",
      "doi": ""
    },
    {
      "text": "David T Hakes. 2012. The development of metalinguistic abilities in children. Vol. 9. Springer Science & Business Media, Berlin, Germany.",
      "doi": ""
    },
    {
      "text": "A Shalom Hakkert and Victoria Gitelman. 2014. Thinking about the history of road safety research: Past achievements and future challenges. Transportation research part F: traffic psychology and behaviour 25 (2014), 137–149.",
      "doi": ""
    },
    {
      "text": "B. Han, Y. Wang, Z. Yang, and X. Gao. 2020. Small-Scale Pedestrian Detection Based on Deep Neural Network. IEEE Transactions on Intelligent Transportation Systems 21, 7(2020), 3046–3055.",
      "doi": "10.1109/TITS.2019.2923752"
    },
    {
      "text": "Vicki L. Hanson, Anna Cavender, and Shari Trewin. 2015. Writing about Accessibility. Interactions 22, 6 (Oct. 2015), 62–65. https://doi.org/10.1145/2828432",
      "doi": "10.1145/2828432"
    },
    {
      "text": "Razi Hasan, Oscar Oviedo-Trespalacios, and Madzlan Napiah. 2020. An intercept study of footbridge users and non-users in Malaysia. Transportation Research Part F: Traffic Psychology and Behaviour 73 (2020), 66–79.",
      "doi": ""
    },
    {
      "text": "Yu Hasegawa, Charitha Dias, Miho Iryo-Asano, and Hiroaki Nishiuchi. 2018. Modeling pedestrians’ subjective danger perception toward personal mobility vehicles. Transportation research part F: traffic psychology and behaviour 56 (2018), 256–267.",
      "doi": ""
    },
    {
      "text": "Juliane Haupt, Nicole van Nes, and Ralf Risser. 2015. Look where you have to go! A field study comparing looking behaviour at urban intersections using a navigation system or a printed route instruction. Transportation research part F: traffic psychology and behaviour 34 (2015), 122–140.",
      "doi": ""
    },
    {
      "text": "Magnus Hjälmdahl and András Várhelyi. 2004. Speed regulation by in-car active accelerator pedal: Effects on driver behaviour. Transportation Research Part F: Traffic Psychology and Behaviour 7, 2(2004), 77–94.",
      "doi": ""
    },
    {
      "text": "ATG Hoekstra, DAM Twisk, and MP Hagenzieker. 2018. Do road user roles serve as social identities? Differences between self-described cyclists and car drivers. Transportation research part F: traffic psychology and behaviour 59 (2018), 365–377.",
      "doi": ""
    },
    {
      "text": "Kai Holländer. 2018. Applying the User-Centered Design Process to External Car Displays. In Mensch und Computer 2018 - Workshopband, Raimund Dachselt and Gerhard Weber (Eds.). Gesellschaft für Informatik e.V., Bonn, 5.",
      "doi": ""
    },
    {
      "text": "Kai Holländer. 2019. A Pedestrian Perspective on Autonomous Vehicles. In Proceedings of the 24th International Conference on Intelligent User Interfaces: Companion (Marina del Ray, California) (IUI ’19). ACM, New York, NY, USA, 149–150. https://doi.org/10.1145/3308557.3308725",
      "doi": "10.1145/3308557.3308725"
    },
    {
      "text": "Kai Holländer, Krueger Andy, and Andreas Butz. 2020. Save the Smombies: App-Assisted Street Crossing. In Proceedings of the 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services (Oldenburg, Germany) (MobileHCI 2020). ACM, New York, NY, USA, 11 pages. https://doi.org/10.1145/3379503.3403547",
      "doi": "10.1145/3379503.3403547"
    },
    {
      "text": "Kai Holländer, Ashley Colley, Christian Mai, Jonna Häkkilä, Florian Alt, and Bastian Pfleging. 2019. Investigating the Influence of External Car Displays on Pedestrians’ Crossing Behavior in Virtual Reality. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI 2019). ACM, New York, NY, USA, 11 pages. https://doi.org/10.1145/3338286.3340138",
      "doi": "10.1145/3338286.3340138"
    },
    {
      "text": "Kai Holländer, Philipp Wintersberger, and Andreas Butz. 2019. Overtrust in External Cues of Automated Vehicles: An Experimental Investigation. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 211–221. https://doi.org/10.1145/3342197.3344528",
      "doi": "10.1145/3342197.3344528"
    },
    {
      "text": "Ming Hou, Karthik Mahadevan, Sowmya Somanath, Ehud Sharlin, and Lora Oehlberg. 2020. Autonomous Vehicle-Cyclist Interaction: Peril and Promise. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3313831.3376884"
    },
    {
      "text": "Anja Katharina Huemer. 2018. Motivating and deterring factors for two common traffic-rule violations of cyclists in Germany. Transportation research part F: traffic psychology and behaviour 54 (2018), 223–235.",
      "doi": ""
    },
    {
      "text": "Anja Katharina Huemer, Michael Oehl, and Stefan Brandenburg. 2018. Influences on anger in German urban cyclists. Transportation research part F: traffic psychology and behaviour 58 (2018), 969–979.",
      "doi": ""
    },
    {
      "text": "Ahmed Hussein, Fernando Garcia, Jose Maria Armingol, and Cristina Olaverri-Monreal. 2016. P2V and V2P communication for pedestrian warning on the basis of autonomous vehicles. In 2016 IEEE 19th International Conference on Intelligent Transportation Systems (ITSC). IEEE, IEEE, New York, NY, USA, 2034–2039.",
      "doi": "10.1109/ITSC.2016.7795885"
    },
    {
      "text": "Véronique Huth, Elisabeth Füssl, and Ralf Risser. 2014. Motorcycle riders’ perceptions, attitudes and strategies: Findings from a focus group study. Transportation Research Part F: Traffic Psychology and Behaviour 25 (2014), 74–85.",
      "doi": ""
    },
    {
      "text": "Patrick Jachyra, Michael Atkinson, and Glen Bandiera. 2015. Urban cyclists’ perspectives on post-collision behaviour change: A qualitative study. Transportation research part F: traffic psychology and behaviour 31 (2015), 133–145.",
      "doi": ""
    },
    {
      "text": "Shubham Jain, Carlo Borgiattino, Yanzhi Ren, Marco Gruteser, Yingying Chen, and Carla Fabiana Chiasserini. 2015. LookUp: Enabling Pedestrian Safety Services via Shoe Sensing. In Proceedings of the 13th Annual International Conference on Mobile Systems, Applications, and Services(Florence, Italy) (MobiSys ’15). Association for Computing Machinery, New York, NY, USA, 257–271. https://doi.org/10.1145/2742647.2742669",
      "doi": "10.1145/2742647.2742669"
    },
    {
      "text": "Hisham Jashami, Douglas Cobb, David S Hurwitz, Edward McCormack, Anne Goodchild, and Manali Sheth. 2020. The Impact of Commercial Parking Utilization on Cyclist Behavior in Urban Environments. Transportation Research Part F: Traffic Psychology and Behaviour 74 (2020), 67–80.",
      "doi": ""
    },
    {
      "text": "Yanbo Jia and David Cebon. 2018. Measuring the Motion of Vulnerable Road Users Relative to Moving HGVs. IEEE Transactions on Intelligent Transportation Systems 20, 4(2018), 1404–1415.",
      "doi": ""
    },
    {
      "text": "Xiaobei Jiang, Wuhong Wang, and Klaus Bengler. 2014. Intercultural analyses of time-to-collision in vehicle–pedestrian conflict on an urban midblock crosswalk. Ieee transactions on intelligent transportation systems 16, 2(2014), 1048–1053.",
      "doi": ""
    },
    {
      "text": "Ho Gi Jung, Byung Moon Kwak, Jeong Soo Shim, Pal Joo Yoon, and Jaihie Kim. 2008. Precrash dipping nose (PCDN) needs pedestrian recognition. IEEE Transactions on intelligent transportation systems 9, 4(2008), 678–687.",
      "doi": "10.1109/TITS.2008.2006789"
    },
    {
      "text": "Semyon Kalantarov, Raziel Riemer, and Tal Oron-Gilad. 2018. Pedestrians’ road crossing decisions and body parts’ movements. Transportation research part F: traffic psychology and behaviour 53 (2018), 155–171.",
      "doi": ""
    },
    {
      "text": "Jan-Erik Källhammer, Kip Smith, and Panagiotis Matsangas. 2017. Modeling ratings of in-vehicle alerts to pedestrian by leveraging field operational tests data in a controlled laboratory study. Transportation research part F: traffic psychology and behaviour 46 (2017), 413–425.",
      "doi": ""
    },
    {
      "text": "Ioannis Kaparias, Michael GH Bell, Ashkan Miri, Carol Chan, and Bill Mount. 2012. Analysing the perceptions of pedestrians and drivers to shared space. Transportation research part F: traffic psychology and behaviour 15, 3(2012), 297–310.",
      "doi": ""
    },
    {
      "text": "Sigal Kaplan, Kira Hyldekær Janstrup, and Carlo Giacomo Prato. 2017. Investigating the reasons behind the intention to report cycling crashes to the police and hospitals in Denmark. Transportation research part F: traffic psychology and behaviour 44 (2017), 159–167.",
      "doi": ""
    },
    {
      "text": "Juela Kazazi, Susann Winkler, and Mark Vollrath. 2016. The influence of attention allocation and age on intersection accidents. Transportation research part F: traffic psychology and behaviour 43 (2016), 1–14.",
      "doi": ""
    },
    {
      "text": "Christoph G Keller, Thao Dang, Hans Fritz, Armin Joos, Clemens Rabe, and Dariu M Gavrila. 2011. Active pedestrian safety by automatic braking and evasive steering. IEEE Transactions on Intelligent Transportation Systems 12, 4(2011), 1292–1304.",
      "doi": "10.1109/TITS.2011.2158424"
    },
    {
      "text": "Christoph G Keller and Dariu M Gavrila. 2013. Will the pedestrian cross? a study on pedestrian path prediction. IEEE Transactions on Intelligent Transportation Systems 15, 2(2013), 494–506.",
      "doi": ""
    },
    {
      "text": "Helen Keyes, Faye Green, Chelsey Compton, and Matt Staton. 2019. Short-term cognitive conspicuity training does not improve driver detection of motorcycles at road junctions: a reply to Crundall, Howard, and Young (2017). Transportation research part F: traffic psychology and behaviour 67 (2019), 57–65.",
      "doi": ""
    },
    {
      "text": "Shinya Kitayama, Toshiyuki Kondou, Hirokazu Ohyabu, Masaaki Hirose, Haneda Narihiro, and Ryuta Maeda. 2017. Display System for Vehicle to Pedestrian Communication. Technical Report. SAE Technical Paper.",
      "doi": ""
    },
    {
      "text": "Lewis Kraus. 2016. 2015 Disability Statistics Annual Report. A Publication of the Rehabilitation Research and Training Center on Disability Statistics and Demographics.",
      "doi": ""
    },
    {
      "text": "Andrew Krok. 2020. Tesla trails Waymo, Cruise and others in self-driving strategy, study claims. https://www.cnet.com/roadshow/news/self-driving-study-navigant-research-tesla-waymo-cruise/. [Online; accessed 24-MARCH-2020].",
      "doi": ""
    },
    {
      "text": "An-Magritt Kummeneje and Torbjørn Rundmo. 2020. Attitudes, risk perception and risk-taking behaviour among regular cyclists in Norway. Transportation research part F: traffic psychology and behaviour 69 (2020), 135–150.",
      "doi": ""
    },
    {
      "text": "A. L. Kun, S. Boll, and A. Schmidt. 2016. Shifting Gears: User Interfaces in the Age of Autonomous Driving. IEEE Pervasive Computing 15, 1 (2016), 32–38.",
      "doi": "10.1109/MPRV.2016.14"
    },
    {
      "text": "Philippe Lacherez, Joanne M Wood, Ralph P Marszalek, and Mark J King. 2013. Visibility-related characteristics of crashes involving bicyclists and motor vehicles–Responses from an online questionnaire study. Transportation research part F: traffic psychology and behaviour 20 (2013), 52–58.",
      "doi": ""
    },
    {
      "text": "Alex Lafont, Joceline Roge, Daniel Ndiaye, and Jean-Michel Boucheix. 2018. Driver’s emotional state and detection of vulnerable road users: Towards a better understanding of how emotions affect drivers’ perception using cardiac and ocular metrics. Transportation research part F: traffic psychology and behaviour 55 (2018), 141–152.",
      "doi": ""
    },
    {
      "text": "Jacob S Lamb, Guy H Walker, Vincent Fisher, Adam Hulme, Paul M Salmon, and Neville A Stanton. 2020. Should we pass on minimum passing distance laws for cyclists? Comparing a tactical enforcement option and minimum passing distance laws using signal detection theory. Transportation research part F: traffic psychology and behaviour 70 (2020), 275–289.",
      "doi": ""
    },
    {
      "text": "David R Large, Hyungil Kim, Coleman Merenda, Samantha Leong, Catherine Harvey, Gary Burnett, and Joseph Gabbard. 2019. Investigating the effect of urgency and modality of pedestrian alert warnings on driver acceptance and performance. Transportation research part F: traffic psychology and behaviour 60 (2019), 11–24.",
      "doi": ""
    },
    {
      "text": "Esko Lehtonen, Ville Havia, Anna Kovanen, Miika Leminen, and Emma Saure. 2016. Evaluating bicyclists’ risk perception using video clips: Comparison of frequent and infrequent city cyclists. Transportation research part F: traffic psychology and behaviour 41 (2016), 195–203.",
      "doi": ""
    },
    {
      "text": "Xiaofei Li, Lingxi Li, Fabian Flohr, Jianqiang Wang, Hui Xiong, Morys Bernhard, Shuyue Pan, Dariu M Gavrila, and Keqiang Li. 2016. A unified framework for concurrent pedestrian and cyclist detection. IEEE transactions on intelligent transportation systems 18, 2(2016), 269–281.",
      "doi": ""
    },
    {
      "text": "Yeti Li, Murat Dikmen, Thana G. Hussein, Yahui Wang, and Catherine Burns. 2018. To Cross or Not to Cross: Urgency-Based External Warning Displays on Autonomous Vehicles to Improve Pedestrian Crossing Safety. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Toronto, ON, Canada) (AutomotiveUI ’18). Association for Computing Machinery, New York, NY, USA, 188–197. https://doi.org/10.1145/3239060.3239082",
      "doi": "10.1145/3239060.3239082"
    },
    {
      "text": "Ji Hyoun Lim, Omer Tsimhoni, and Yili Liu. 2010. Investigation of driver performance with night vision and pedestrian detection systems—Part I: Empirical study on visual clutter and glance behavior. IEEE Transactions on Intelligent Transportation Systems 11, 3(2010), 670–677.",
      "doi": "10.1109/TITS.2010.2049843"
    },
    {
      "text": "Chao Liu, Ryo Fujishiro, Lauren Christopher, and Jiangyu Zheng. 2016. Vehicle–bicyclist dynamic position extracted from naturalistic driving videos. IEEE transactions on intelligent transportation systems 18, 4(2016), 734–742.",
      "doi": ""
    },
    {
      "text": "Google LLC. 2020. Google Scholar’s top HCI venues and publications. https://scholar.google.com/citations?view_op=top_venues&hl=de&vq=eng_humancomputerinteraction (Accessed: April 2020).",
      "doi": ""
    },
    {
      "text": "David Fernández Llorca, MA Sotelo, Ignacio Parra, José Eugenio Naranjo, Miguel Gavilán, and Sergio Alvarez. 2009. An experimental study on pitch compensation in pedestrian-protection systems for collision avoidance and mitigation. IEEE Transactions on Intelligent Transportation Systems 10, 3(2009), 469–474.",
      "doi": "10.1109/TITS.2009.2018958"
    },
    {
      "text": "Andreas Löcken, Carmen Golling, and Andreas Riener. 2019. How Should Automated Vehicles Interact with Pedestrians? A Comparative Analysis of Interaction Concepts in Virtual Reality. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 262–274. https://doi.org/10.1145/3342197.3344544",
      "doi": "10.1145/3342197.3344544"
    },
    {
      "text": "Andreas Löcken, Carmen Golling, and Andreas Riener. 2019. How Should Automated Vehicles Interact with Pedestrians? A Comparative Analysis of Interaction Concepts in Virtual Reality. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 262–274. https://doi.org/10.1145/3342197.3344544",
      "doi": "10.1145/3342197.3344544"
    },
    {
      "text": "Victor Malmsten Lundgren, Azra Habibovic, Jonas Andersson, Tobias Lagström, Maria Nilsson, Anna Sirkka, Johan Fagerlönn, Rikard Fredriksson, Claes Edgren, Stas Krupenia, and Dennis Saluäär. 2017. Will There Be New Communication Needs When Introducing Automated Vehicles to the Urban Context?In Advances in Human Aspects of Transportation, Neville A. Stanton, Steven Landry, Giuseppe Di Bucchianico, and Andrea Vallicelli (Eds.). Springer International Publishing, Cham, 485–497.",
      "doi": ""
    },
    {
      "text": "Ruth Madigan, Sina Nordhoff, Charles Fox, Roja Ezzati Amini, Tyron Louw, Marc Wilbrink, Anna Schieben, and Natasha Merat. 2019. Understanding interactions between Automated Road Transport Systems and other road users: A video analysis. Transportation research part F: traffic psychology and behaviour 66 (2019), 196–213.",
      "doi": ""
    },
    {
      "text": "Tanja Kidholm Osmann Madsen and Harry Lahrmann. 2017. Comparison of five bicycle facility designs in signalized intersections using traffic conflict studies. Transportation research part F: traffic psychology and behaviour 46 (2017), 438–450.",
      "doi": ""
    },
    {
      "text": "Karthik Mahadevan, Elaheh Sanoubari, Sowmya Somanath, James E. Young, and Ehud Sharlin. 2019. AV-Pedestrian Interaction Design Using a Pedestrian Mixed Traffic Simulator. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 475–486. https://doi.org/10.1145/3322276.3322328",
      "doi": "10.1145/3322276.3322328"
    },
    {
      "text": "Karthik Mahadevan, Sowmya Somanath, and Ehud Sharlin. 2018. Communicating Awareness and Intent in Autonomous Vehicle-Pedestrian Interaction. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174003",
      "doi": "10.1145/3173574.3174003"
    },
    {
      "text": "Haridimos Markogiannakis, Elias Sanidas, Evangelos Messaris, Dimitrios Koutentakis, Kalliopi Alpantaki, Alexandros Kafetzakis, and Dimitrios Tsiftsis. 2006. Motor vehicle trauma: analysis of injury profiles by road-user category. Emergency medicine journal 23, 1 (2006), 27–31.",
      "doi": ""
    },
    {
      "text": "Milecia Matthews, Girish Chowdhary, and Emily Kieson. 2017. Intent communication between autonomous vehicles and pedestrians.",
      "doi": ""
    },
    {
      "text": "Andrii Matviienko, Swamy Ananthanarayan, Shadan Sadeghian Borojeni, Yannick Feld, Wilko Heuten, and Susanne Boll. 2018. Augmenting Bicycles and Helmets with Multimodal Warnings for Children. In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services (Barcelona, Spain) (MobileHCI ’18). Association for Computing Machinery, New York, NY, USA, Article 15, 13 pages. https://doi.org/10.1145/3229434.3229479",
      "doi": "10.1145/3229434.3229479"
    },
    {
      "text": "Anat Meir, Yisrael Parmet, and Tal Oron-Gilad. 2013. Towards understanding child-pedestrians’ hazard perception abilities in a mixed reality dynamic environment. Transportation research part F: traffic psychology and behaviour 20 (2013), 90–107.",
      "doi": ""
    },
    {
      "text": "Pierre Merdrignac, Oyunchimeg Shagdar, and Fawzi Nashashibi. 2016. Fusion of perception and v2p communication systems for the safety of vulnerable road users. IEEE Transactions on Intelligent Transportation Systems 18, 7(2016), 1740–1751.",
      "doi": "10.1109/TITS.2016.2627014"
    },
    {
      "text": "Sunniva Meyer, Fridulv Sagberg, and Renata Torquato. 2014. Traffic hazard perception among children. Transportation research part F: traffic psychology and behaviour 26 (2014), 190–198.",
      "doi": ""
    },
    {
      "text": "Jasmine Mian and Jeff K Caird. 2018. The effects of speed and orientation on recognition judgments of retro-reflectively clothed pedestrians at night. Transportation research part F: traffic psychology and behaviour 56 (2018), 185–199.",
      "doi": ""
    },
    {
      "text": "Karl A Miller, Ashleigh J Filtness, Anna Anund, Sally E Maynard, and Fran Pilkington-Cheney. 2020. Contributory factors to sleepiness amongst London bus drivers. Transportation Research Part F: Traffic Psychology and Behaviour 73 (2020), 415–424.",
      "doi": ""
    },
    {
      "text": "Nicole Mirnig, Nicole Perterer, Gerald Stollnberger, and Manfred Tscheligi. 2017. Three strategies for autonomous car-to-pedestrian communication: A survival guide. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, New York, NY, USA, 209–210.",
      "doi": "10.1145/3029798.3038402"
    },
    {
      "text": "Nicole Mirnig, Nicole Perterer, Gerald Stollnberger, and Manfred Tscheligi. 2017. Three Strategies for Autonomous Car-to-Pedestrian Communication: A Survival Guide. In Proceedings of the Companion of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (Vienna, Austria) (HRI ’17). Association for Computing Machinery, New York, NY, USA, 209–210. https://doi.org/10.1145/3029798.3038402",
      "doi": "10.1145/3029798.3038402"
    },
    {
      "text": "Mohamed Gomaa Mohamed, Nicolas Saunier, Luis F Miranda-Moreno, and Satish V Ukkusuri. 2013. A clustering regression approach: A comprehensive injury severity analysis of pedestrian–vehicle crashes in New York, US and Montreal, Canada. Safety science 54(2013), 27–37.",
      "doi": ""
    },
    {
      "text": "David Moher, Alessandro Liberati, Jennifer Tetzlaff, and Douglas G Altman. 2009. Preferred reporting items for systematic reviews and meta-analyses: the PRISMA statement. Annals of internal medicine 151, 4 (2009), 264–269.",
      "doi": ""
    },
    {
      "text": "Dylan Moore, Rebecca Currano, David Sirkin, Azra Habibovic, Victor Malmsten Lundgren, Debargha Dey, and Kai Holländer. 2019. Wizards of WoZ: using controlled and field studies to evaluate AV-pedestrian interactions. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications: Adjunct Proceedings. Association for Computing Machinery, New York, NY, USA, 45–49.",
      "doi": ""
    },
    {
      "text": "Carlyn Muir, Steve O’Hern, Jennie Oxley, Anna Devlin, Sjaan Koppel, and Judith L Charlton. 2017. Parental role in children’s road safety experiences. Transportation research part F: traffic psychology and behaviour 46 (2017), 195–204.",
      "doi": ""
    },
    {
      "text": "Sami Mynttinen, Marita Koivukoski, Kari Hakuli, and Esko Keskinen. 2011. Finnish novice drivers’ competences–Successful driving test candidates 2000–2009 evaluated by driving examiners. Transportation research part F: traffic psychology and behaviour 14, 1(2011), 66–75.",
      "doi": ""
    },
    {
      "text": "H Naci, Dan Chisholm, and Timothy D Baker. 2009. Distribution of road traffic deaths by road user group: a global comparison. Injury prevention 15, 1 (2009), 55–59.",
      "doi": ""
    },
    {
      "text": "Rebecca B Naumann, Ann M Dellinger, Eduard Zaloshnja, Bruce A Lawrence, and Ted R Miller. 2010. Incidence and total lifetime costs of motor vehicle–related fatal and nonfatal injury by road user type, United States, 2005. Traffic injury prevention 11, 4 (2010), 353–360.",
      "doi": ""
    },
    {
      "text": "Alan F. Newell and Peter Gregor. 2000. “User Sensitive Inclusive Design”— in Search of a New Paradigm. In Proceedings on the 2000 Conference on Universal Usability (Arlington, Virginia, USA) (CUU ’00). Association for Computing Machinery, New York, NY, USA, 39–44. https://doi.org/10.1145/355460.355470",
      "doi": "10.1145/355460.355470"
    },
    {
      "text": "Trung Thanh Nguyen, Kai Holländer, Marius Hoggenmueller, Callum Parker, and Martin Tomitsch. 2019. Designing for Projection-Based Communication between Autonomous Vehicles and Pedestrians. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 284–294. https://doi.org/10.1145/3342197.3344543",
      "doi": "10.1145/3342197.3344543"
    },
    {
      "text": "Trond Nordfjærn and Özlem Şimşekoğlu. 2013. The role of cultural factors and attitudes for pedestrian behaviour in an urban Turkish sample. Transportation Research Part F: Traffic Psychology and Behaviour 21 (2013), 181–193.",
      "doi": ""
    },
    {
      "text": "The Urban Mobility Observatory. 2015. VRU Definition by ELTIS. https://www.eltis.org/de/node/45078 (Accessed: April 2020).",
      "doi": ""
    },
    {
      "text": "Michael Oehl, Stefan Brandenburg, and Anja Katharina Huemer. 2019. Cyclists’ anger experiences in traffic: the cycling anger scale. Transportation research part F: traffic psychology and behaviour 62 (2019), 564–574.",
      "doi": ""
    },
    {
      "text": "Government of Ireland. 2005. Disability Act 2005.",
      "doi": ""
    },
    {
      "text": "Steve O’Hern, Amanda N Stephens, Kristie L Young, and Sjaan Koppel. 2019. What makes cyclists angry? The relationships between trait anger, interest in cycling and self-reported comfort levels. Transportation research part F: traffic psychology and behaviour 62 (2019), 672–680.",
      "doi": ""
    },
    {
      "text": "E. Ohn-Bar and M. M. Trivedi. 2016. Looking at Humans in the Age of Self-Driving and Highly Automated Vehicles. IEEE Transactions on Intelligent Vehicles 1, 1 (2016), 90–104.",
      "doi": ""
    },
    {
      "text": "Risto Ojala, Jari Vepsäläinen, Jussi Hanhirova, Vesa Hirvisalo, and Kari Tammi. 2019. Novel Convolutional Neural Network-Based Roadside Unit for Accurate Pedestrian Localisation. IEEE Transactions on Intelligent Transportation Systems 21, 9(2019), 3756–3765.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2018. Blindness and vision impairment. https://www.who.int/news-room/fact-sheets/detail/blindness-and-visual-impairment. [Online; accessed 24-MARCH-2020].",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2019. Deafness and hearing loss. https://www.who.int/news-room/fact-sheets/detail/deafness-and-hearing-loss. [Online; accessed 24-MARCH-2020].",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2019. Global Status Report on Road Safety 2018. World Health Organization, Geneva, Switzerland.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2019. Protecting vulnerable road users. https://www.who.int/china/activities/protecting-vulnerable-road-users. [Online; accessed 24-MARCH-2020].",
      "doi": ""
    },
    {
      "text": "Rachel Osborne, Tim Horberry, and Kristie L Young. 2020. Pedestrian distraction from Smartphones: An end-user perspective on current and future countermeasures. Transportation Research Part F: Traffic Psychology and Behaviour 73 (2020), 348–361.",
      "doi": ""
    },
    {
      "text": "Fedy Ouni and Mounir Belloumi. 2018. Spatio-temporal pattern of vulnerable road user’s collisions hot spots and related risk factors for injury severity in Tunisia. Transportation research part F: traffic psychology and behaviour 56 (2018), 477–495.",
      "doi": ""
    },
    {
      "text": "Oscar Oviedo-Trespalacios and Bridie Scott-Parker. 2017. Footbridge usage in high-traffic flow highways: The intersection of safety and security in pedestrian decision-making. Transportation research part F: traffic psychology and behaviour 49 (2017), 177–187.",
      "doi": ""
    },
    {
      "text": "Ana Rodríguez Palmeiro, Sander van der Kint, Luuk Vissers, Haneen Farah, Joost CF de Winter, and Marjan Hagenzieker. 2018. Interaction between pedestrians and automated vehicles: A Wizard of Oz experiment. Transportation research part F: traffic psychology and behaviour 58 (2018), 1005–1020.",
      "doi": ""
    },
    {
      "text": "E Parliament 2010. Directive 2010/40/EU of the European Parliament and of the Council of 7 July 2010 on the framework for the deployment of Intelligent Transport Systems in the field of road transport and for interfaces with other modes of transport Text with EEA relevance. , 13 pages.",
      "doi": ""
    },
    {
      "text": "Tibor Petzoldt, Katja Schleinitz, Sarah Heilmann, and Tina Gehlert. 2017. Traffic conflicts and their contextual factors when riding conventional vs. electric bicycles. Transportation research part F: traffic psychology and behaviour 46 (2017), 477–490.",
      "doi": ""
    },
    {
      "text": "RG Poulos, J Hatfield, C Rissel, LK Flack, R Grzebieta, and AS McIntosh. 2019. Cyclists’ self-reported experiences of, and attributions about, perceived aggressive behaviour while sharing roads and paths in New South Wales, Australia. Transportation research part F: traffic psychology and behaviour 64 (2019), 14–24.",
      "doi": ""
    },
    {
      "text": "Gabriele Prati, Víctor Marín Puchades, Marco De Angelis, Luca Pietrantoni, Federico Fraboni, Nicolò Decarli, Anna Guerra, and Davide Dardari. 2018. Evaluation of user behavior and acceptance of an on-bike system. Transportation research part F: traffic psychology and behaviour 58 (2018), 145–155.",
      "doi": ""
    },
    {
      "text": "HarperCollins Publishers. 2008. Definition of ’road user’. https://www.collinsdictionary.com/dictionary/english/road-user (Accessed: April 2020).",
      "doi": ""
    },
    {
      "text": "Solmaz Razmi Rad, Gonçalo Homem de Almeida Correia, and Marjan Hagenzieker. 2020. Pedestrians’ road crossing behaviour in front of automated vehicles: Results from a pedestrian simulation experiment using agent-based modelling. Transportation research part F: traffic psychology and behaviour 69 (2020), 101–119.",
      "doi": ""
    },
    {
      "text": "Md Mahmudur Rahman, Shuchisnigdha Deb, Lesley Strawderman, Reuben Burch, and Brian Smith. 2019. How the older population perceives self-driving vehicles. Transportation research part F: traffic psychology and behaviour 65 (2019), 242–257.",
      "doi": ""
    },
    {
      "text": "Amir Rasouli and John K Tsotsos. 2019. Autonomous vehicles that interact with pedestrians: A survey of theory and practice. IEEE Transactions on Intelligent Transportation Systems 21, 3(2019), 900–918.",
      "doi": ""
    },
    {
      "text": "Michael Rettenmaier, Moritz Pietsch, Jonas Schmidtler, and Klaus Bengler. 2019. Passing through the Bottleneck-The Potential of External Human-Machine Interfaces. In 2019 IEEE Intelligent Vehicles Symposium (IV). IEEE, IEEE, New York, NY, USA, 1687–1692.",
      "doi": ""
    },
    {
      "text": "Madlen Ringhand and Mark Vollrath. 2019. Effect of complex traffic situations on route choice behaviour and driver stress in residential areas. Transportation research part F: traffic psychology and behaviour 60 (2019), 274–287.",
      "doi": ""
    },
    {
      "text": "Christina Rödel, Susanne Stadler, Alexander Meschtscherjakov, and Manfred Tscheligi. 2014. Towards Autonomous Cars: The Effect of Autonomy Levels on Acceptance and User Experience. In Proceedings of the 6th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Seattle, WA, USA) (AutomotiveUI ’14). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/2667317.2667330",
      "doi": "10.1145/2667317.2667330"
    },
    {
      "text": "Joceline Rogé, Daniel Ndiaye, and Fabrice Vienne. 2014. Useful visual field training: a way to improve elderly car drivers’ ability to detect vulnerable road users. Transportation research part F: traffic psychology and behaviour 26 (2014), 246–257.",
      "doi": ""
    },
    {
      "text": "Tova Rosenbloom and Avihu Pereg. 2012. A within-subject design of comparison of waiting time of pedestrians before crossing three successive road crossings. Transportation research part F: traffic psychology and behaviour 15, 6(2012), 625–634.",
      "doi": ""
    },
    {
      "text": "Alexandros Rouchitsas and Håkan Alm. 2019. External Human–Machine Interfaces for Autonomous Vehicle-to-Pedestrian Communication: A Review of Empirical Work. Frontiers in Psychology 10 (2019), 2757. https://doi.org/10.3389/fpsyg.2019.02757",
      "doi": ""
    },
    {
      "text": "Alyssa Ryan, Elizabeth Casola, Cole Fitzpatrick, and Michael Knodler Jr. 2019. Flashing yellow arrows for right turn applications: A driving simulator study and static evaluation analysis. Transportation research part F: traffic psychology and behaviour 66 (2019), 324–338.",
      "doi": ""
    },
    {
      "text": "SAE. 2019. SAE J3016 Levels of Driving Automation. https://www.sae.org/news/2019/01/sae-updates-j3016-automated-driving-graphic",
      "doi": ""
    },
    {
      "text": "Khaled Saleh, Mohammed Hossny, and Saeid Nahavandi. 2020. Contextual recurrent predictive model for long-term intent prediction of vulnerable road users. IEEE Transactions on Intelligent Transportation Systems 21, 8(2020), 3398–3408.",
      "doi": ""
    },
    {
      "text": "Sarah Schmidt and Berthold Faerber. 2009. Pedestrians at the kerb–Recognising the action intentions of humans. Transportation research part F: traffic psychology and behaviour 12, 4(2009), 300–310.",
      "doi": ""
    },
    {
      "text": "Sonja Schneider and Klaus Bengler. 2020. Virtually the same? Analysing pedestrian behaviour by means of virtual reality. Transportation research part F: traffic psychology and behaviour 68 (2020), 231–256.",
      "doi": ""
    },
    {
      "text": "Ronald Schroeter, Andry Rakotonirainy, and Marcus Foth. 2012. The Social Car: New Interactive Vehicular Applications Derived from Social Media and Urban Informatics. In Proceedings of the 4th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(Portsmouth, New Hampshire) (AutomotiveUI ’12). Association for Computing Machinery, New York, NY, USA, 107–110. https://doi.org/10.1145/2390256.2390273",
      "doi": "10.1145/2390256.2390273"
    },
    {
      "text": "Mohamed Seedat, Sarah MacKenzie, and Dinesh Mohan. 2006. The phenomenology of being a female pedestrian in an African and an Asian city: A qualitative investigation. Transportation research part F: traffic psychology and behaviour 9, 2(2006), 139–153.",
      "doi": ""
    },
    {
      "text": "SIGACCESS. 2020. The International ACM SIGACCESS Conference on Computers and Accessibility. https://www.sigaccess.org/assets/ (Accessed: April 2020).",
      "doi": ""
    },
    {
      "text": "Marin Sikkenk and Jacques Terken. 2015. Rules of Conduct for Autonomous Vehicles. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(Nottingham, United Kingdom) (AutomotiveUI ’15). Association for Computing Machinery, New York, NY, USA, 19–22. https://doi.org/10.1145/2799250.2799270",
      "doi": "10.1145/2799250.2799270"
    },
    {
      "text": "V.P Sisiopiku and D Akin. 2003. Pedestrian behaviors at and perceptions towards various pedestrian facilities: an examination based on observation and survey data. Transportation Research Part F: Traffic Psychology and Behaviour 6, 4(2003), 249 – 274.",
      "doi": ""
    },
    {
      "text": "Christopher Smith, Sowmya Somanath, Ehud Sharlin, and Yoshifumi Kitamura. 2020. Exploring Interactions between Rogue Autonomous Vehicles and People. In Companion of the 2020 ACM/IEEE International Conference on Human-Robot Interaction (Cambridge, United Kingdom) (HRI ’20). Association for Computing Machinery, New York, NY, USA, 453–455. https://doi.org/10.1145/3371382.3378316",
      "doi": "10.1145/3371382.3378316"
    },
    {
      "text": "I So. 1964. Cognitive development in children: Piaget development and learning. JOURNAL, OF RESEARCH IN SCIENCE TEACHING 2 (1964), 176–186.",
      "doi": ""
    },
    {
      "text": "Anae Sobhani and Bilal Farooq. 2018. Impact of smartphone distraction on pedestrians’ crossing behaviour: An application of head-mounted immersive virtual reality. Transportation research part F: traffic psychology and behaviour 58 (2018), 228–241.",
      "doi": ""
    },
    {
      "text": "Ye Eun Song, Christian Lehsing, Tanja Fuest, and Klaus Bengler. 2018. External HMIs and Their Effect on the Interaction Between Pedestrians and Automated Vehicles. In Intelligent Human Systems Integration, Waldemar Karwowski and Tareq Ahram (Eds.). Springer International Publishing, Cham, 13–18.",
      "doi": ""
    },
    {
      "text": "Lenja Sorokin, Ronee Chadowitz, and Nina Kauffmann. 2019. A Change of Perspective: Designing the Automated Vehicle as a New Social Actor in a Public Space. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3299044",
      "doi": "10.1145/3290607.3299044"
    },
    {
      "text": "Agnieszka Stelling-Kończak, Marjan Hagenzieker, Jacques JF Commandeur, Martijn JH Agterberg, and Bert van Wee. 2016. Auditory localisation of conventional and electric cars: Laboratory results and implications for cycling safety. Transportation research part F: traffic psychology and behaviour 41 (2016), 227–242.",
      "doi": ""
    },
    {
      "text": "A Stelling-Konczak, WP Vlakveld, P Van Gent, JJF Commandeur, B Van Wee, and M Hagenzieker. 2018. A study in real traffic examining glance behaviour of teenage cyclists when listening to music: results and ethical considerations. Transportation research part F: traffic psychology and behaviour 55 (2018), 47–57.",
      "doi": ""
    },
    {
      "text": "Jason Thompson, Jasper S Wijnands, Giovanni Savino, Brendan Lawrence, and Mark Stevenson. 2017. Estimating the safety benefit of separated cycling infrastructure adjusted for behavioral adaptation among drivers; an application of agent-based modelling. Transportation research part F: traffic psychology and behaviour 49 (2017), 18–28.",
      "doi": ""
    },
    {
      "text": "Birgitta Thorslund and Anders Lindström. 2020. Cyclist strategies and behaviour at intersections. Conscious and un-conscious strategies regarding positioning. Transportation research part F: traffic psychology and behaviour 70 (2020), 149–162.",
      "doi": ""
    },
    {
      "text": "Katrien Torfs and Uta Meesmann. 2019. How do vulnerable road users look at road safety? International comparison based on ESRA data from 25 countries. Transportation research part F: traffic psychology and behaviour 63 (2019), 144–152.",
      "doi": ""
    },
    {
      "text": "Dayna Touron, William Hoyer, and John Cerella. 2005. Cognitive Skill Learning: Age-Related Differences in Strategy Shifts and Speed of Component Operations.Psychology and aging 19 (01 2005), 565–80. https://doi.org/10.1037/0882-7974.19.4.565",
      "doi": ""
    },
    {
      "text": "Dwi Phalita Upahita, Yiik Diew Wong, and Kit Meng Lum. 2018. Effect of driving experience and driving inactivity on young driver’s hazard mitigation skills. Transportation research part F: traffic psychology and behaviour 59 (2018), 286–297.",
      "doi": ""
    },
    {
      "text": "Sergio A Useche, Luis Montoro, Jaime Sanmartin, and Francisco Alonso. 2019. Healthy but risky: A descriptive study on cyclists’ encouraging and discouraging factors for using bicycles, habits and safety outcomes. Transportation research part F: traffic psychology and behaviour 62 (2019), 587–598.",
      "doi": ""
    },
    {
      "text": "T Bedirhan Üstün, Somnath Chatterji, Jerome Bickenbach, Nenad Kostanjsek, and Margie Schneider. 2003. The International Classification of Functioning, Disability and Health: a new tool for understanding disability and health. Disability and rehabilitation 25, 11-12 (2003), 565–571.",
      "doi": ""
    },
    {
      "text": "J Uttley, YM Lee, R Madigan, and N Merat. 2020. Road user interactions in a shared space setting: Priority and communication in a UK car park. Transportation Research Part F: Traffic Psychology and Behaviour 72 (2020), 32–46.",
      "doi": ""
    },
    {
      "text": "A Richard A van der Horst, Martijn C Thierry, Jasper M Vet, and AKM Fazlur Rahman. 2017. An evaluation of speed management measures in Bangladesh based upon alternative accident recording, speed measurements, and DOCTOR traffic conflict observations. Transportation research part F: traffic psychology and behaviour 46 (2017), 390–403.",
      "doi": ""
    },
    {
      "text": "Wouter van Haperen, Stijn Daniels, Tim De Ceunynck, Nicolas Saunier, Tom Brijs, and Geert Wets. 2018. Yielding behavior and traffic conflicts at cyclist crossing facilities on channelized right-turn lanes. Transportation research part F: traffic psychology and behaviour 55 (2018), 272–281.",
      "doi": ""
    },
    {
      "text": "Pieter Vansteenkiste, Linus Zeuwts, Mariëtte van Maarseveen, Greet Cardon, Geert Savelsbergh, and Matthieu Lenoir. 2017. The implications of low quality bicycle paths on the gaze behaviour of young learner cyclists. Transportation Research Part F: Traffic Psychology and Behaviour 48 (2017), 52–60.",
      "doi": ""
    },
    {
      "text": "J Pablo Nuñez Velasco, Haneen Farah, Bart van Arem, and Marjan P Hagenzieker. 2019. Studying pedestrians’ crossing behavior when interacting with automated vehicles using virtual reality. Transportation research part F: traffic psychology and behaviour 66 (2019), 1–14.",
      "doi": ""
    },
    {
      "text": "Mônica Soares Velloso and Maria Alice Prudêncio Jacques. 2012. On-the-spot study of pedestrian crashes on Brazilian Federal District rural highways crossing urban areas. Transportation research part F: traffic psychology and behaviour 15, 5(2012), 588–599.",
      "doi": ""
    },
    {
      "text": "Valeria Vignali, Margherita Pazzini, Navid Ghasemi, Claudio Lantieri, Andrea Simone, and Giulio Dondi. 2020. The safety and conspicuity of pedestrian crossing at roundabouts: the effect of median refuge island and zebra markings. Transportation research part F: traffic psychology and behaviour 68 (2020), 94–104.",
      "doi": ""
    },
    {
      "text": "Willem Vlakveld, Sander van der Kint, and Marjan P Hagenzieker. 2020. Cyclists’ intentions to yield for automated cars at intersections when they have right of way: Results of an experiment using high-quality video animations. Transportation research part F: traffic psychology and behaviour 71 (2020), 288–307.",
      "doi": ""
    },
    {
      "text": "Benjamin Völz, Holger Mielenz, Igor Gilitschenski, Roland Siegwart, and Juan Nieto. 2018. Inferring pedestrian motions at urban crosswalks. IEEE Transactions on Intelligent Transportation Systems 20, 2(2018), 544–555.",
      "doi": ""
    },
    {
      "text": "Tamara von Sawitzky, Philipp Wintersberger, Andreas Löcken, Anna-Katharina Frison, and Andreas Riener. 2020. Augmentation Concepts with HUDs for Cyclists to Improve Road Safety in Shared Spaces. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems(Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3383022",
      "doi": "10.1145/3334480.3383022"
    },
    {
      "text": "Tamara von Sawitzky, Philipp Wintersberger, Andreas Löcken, Anna-Katharina Frison, and Andreas Riener. 2020. Augmentation Concepts with HUDs for Cyclists to Improve Road Safety in Shared Spaces. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–9.",
      "doi": "10.1145/3334480.3383022"
    },
    {
      "text": "Marcel Walch, Mark Colley, and Michael Weber. 2019. CooperationCaptcha: On-The-Fly Object Labeling for Highly Automated Vehicles. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3313022",
      "doi": "10.1145/3290607.3313022"
    },
    {
      "text": "Marcel Walch, Kristin Mühl, Martin Baumann, and Michael Weber. 2018. Click or Hold: Usability Evaluation of Maneuver Approval Techniques in Highly Automated Driving. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Association for Computing Machinery, New York, NY, USA, LBW090.",
      "doi": "10.1145/3170427.3188614"
    },
    {
      "text": "Marcel Walch, Marcel Woide, Kristin Mühl, Martin Baumann, and Michael Weber. 2019. Cooperative Overtaking: Overcoming Automated Vehicles’ Obstructed Sensor Range via Driver Help. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 144–155. https://doi.org/10.1145/3342197.3344531",
      "doi": "10.1145/3342197.3344531"
    },
    {
      "text": "Francesco Walker, Debargha Dey, Marieke Martens, Bastian Pfleging, Berry Eggen, and Jacques Terken. 2019. Feeling-of-Safety Slider: Measuring Pedestrian Willingness to Cross Roads in Field Interactions with Vehicles. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3312880",
      "doi": "10.1145/3290607.3312880"
    },
    {
      "text": "Ian Walker and Mark Brosnan. 2007. Drivers’ gaze fixations during judgements about a bicyclist’s intentions. Transportation research part F: traffic psychology and behaviour 10, 2(2007), 90–98.",
      "doi": ""
    },
    {
      "text": "Minjuan Wang, Sus Lundgren Lyckvi, and Fang Chen. 2016. Same, Same but Different: How Design Requirements for an Auditory Advisory Traffic Information System Differ Between Sweden and China. In Proceedings of the 8th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Ann Arbor, MI, USA) (Automotive’UI 16). Association for Computing Machinery, New York, NY, USA, 75–82. https://doi.org/10.1145/3003715.3005450",
      "doi": "10.1145/3003715.3005450"
    },
    {
      "text": "Fred Wegman, Letty Aarts, and Charlotte Bax. 2008. Advancing sustainable safety: National road safety outlook for The Netherlands for 2005–2020. Safety Science 46, 2 (2008), 323–343.",
      "doi": ""
    },
    {
      "text": "Gesa Wiegand, Christian Mai, Kai Holländer, and Heinrich Hussmann. 2019. InCarAR: A Design Space Towards 3D Augmented Reality Applications in Vehicles. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3342197.3344539",
      "doi": "10.1145/3342197.3344539"
    },
    {
      "text": "Michele A Williams, Caroline Galbraith, Shaun K Kane, and Amy Hurst. 2014. Just let the cane hit it: how the blind and sighted see navigation differently. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility. ACM, Association for Computing Machinery, New York, NY, USA, 217–224.",
      "doi": "10.1145/2661334.2661380"
    },
    {
      "text": "Jacob O Wobbrock, Shaun K Kane, Krzysztof Z Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-based design: Concept, principles and examples. ACM Transactions on Accessible Computing (TACCESS) 3, 3 (2011), 9.",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Jing Xu, Juan Liu, Weina Qu, Yan Ge, Xianghong Sun, and Kan Zhang. 2018. Comparison of pedestrian behaviors between drivers and non-drivers in Chinese sample. Transportation research part F: traffic psychology and behaviour 58 (2018), 1053–1060.",
      "doi": ""
    },
    {
      "text": "Xuecai Xu, Xiangjian Luo, Changxi Ma, and Daiquan Xiao. 2020. Spatial-temporal analysis of pedestrian injury severity with geographically and temporally weighted regression model in Hong Kong. Transportation research part F: traffic psychology and behaviour 69 (2020), 286–300.",
      "doi": ""
    },
    {
      "text": "Xiaobao Yang, Mohamed Abdel-Aty, Mei Huan, Bin Jia, and Yichuan Peng. 2016. The effects of traffic wardens on the red-light infringement behavior of vulnerable road users. Transportation research part F: traffic psychology and behaviour 37 (2016), 52–63.",
      "doi": ""
    },
    {
      "text": "Roya Bastani Zadeh, Mehdi Ghatee, and Hamid Reza Eftekhari. 2017. Three-phases smartphone-based warning system to protect vulnerable road users under fuzzy conditions. IEEE Transactions on Intelligent Transportation Systems 19, 7(2017), 2086–2098.",
      "doi": ""
    },
    {
      "text": "Jingyi Zhang, Erik Vinkhuyzen, and Melissa Cefkin. 2018. Evaluation of an Autonomous Vehicle External Communication System Concept: A Survey Study. In Advances in Human Aspects of Transportation, Neville A Stanton (Ed.). Springer International Publishing, Cham, 650–661.",
      "doi": ""
    },
    {
      "text": "Xi Zhang, Hao Chen, Wenyan Yang, Wenqiang Jin, and Wangwang Zhu. 2020. Pedestrian Path Prediction for Autonomous Driving at Un-Signalized Crosswalk Using W/CDM and MSFM. IEEE Transactions on Intelligent Transportation Systems 2020, 1(2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Xiangling Zhuang and Changxu Wu. 2012. The safety margin and perceived safety of pedestrians at unmarked roadway. Transportation research part F: traffic psychology and behaviour 15, 2(2012), 119–131.",
      "doi": ""
    },
    {
      "text": "Raphael Zimmermann and Reto Wettach. 2017. First Step into Visceral Interaction with Autonomous Vehicles. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Oldenburg, Germany) (AutomotiveUI ’17). Association for Computing Machinery, New York, NY, USA, 58–64. https://doi.org/10.1145/3122986.3122988",
      "doi": "10.1145/3122986.3122988"
    }
  ]
}