{
  "doi": "10.1145/3411764.3445360",
  "title": "Picturing It!: The Effect of Image Styles on User Perceptions of Personas",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "Though photographs of real people are typically used to portray personas, there is little research into the potential advantages or disadvantages of using such images, relative to other image styles. We conducted an experiment with 149 participants, testing the effects of six different image styles on user perceptions and personality traits that are attributed to personas by the participants. Results show that perceptions of clarity, completeness, consistency, credibility, and empathy for a persona increase with picture realism. Personas with more realistic pictures are also perceived as more agreeable, open, and emotionally stable, with higher confidence in these assessments. We also find evidence of the uncanny valley effect, with realistic cartoon personas experiencing a decrease in the user perception scores.",
  "tags": [
    "anthropomorphism",
    "Persona design",
    "realism",
    "pictures"
  ],
  "authors": [
    {
      "name": "Joni Salminen",
      "institution": "Qatar Computing Research Institute Hamad Bin Khalifa University, Qatar",
      "img": "/do/10.1145/contrib-99659234129/rel-imgonly/badoo5.png",
      "acmid": "99659234129",
      "orcid": "missing"
    },
    {
      "name": "Soon-Gyo Jung",
      "institution": "Qatar Computing Research Institute Hamad Bin Khalifa University, Qatar",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659160132",
      "orcid": "missing"
    },
    {
      "name": "João M. Santos",
      "institution": "Instituto Universitário de Lisboa (ISCTE-IUL), Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659434945",
      "orcid": "missing"
    },
    {
      "name": "Ahmed Mohamed Sayed Kamel",
      "institution": "Department of Clinical Pharmacy Cairo University, Egypt",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702238",
      "orcid": "missing"
    },
    {
      "name": "Bernard J. Jansen",
      "institution": "Qatar Computing Research Institute Hamad Bin Khalifa University, Qatar",
      "img": "/do/10.1145/contrib-81100141790/rel-imgonly/jimjansen.jpg",
      "acmid": "81100141790",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jennie Ablanedo, Elaine Fairchild, Tami Griffith, and Christopher Rodeheffer. 2018. Is This Person Real? Avatar Stylization and Its Influence on Human Perception in a Counseling Training Environment. In International Conference on Virtual, Augmented and Mixed Reality, Springer, 279–289.",
      "doi": ""
    },
    {
      "text": "Nicoletta Adamo, Hazar N. Dib, and Nicholas J. Villani. 2019. Animated Agents’ Facial Emotions: Does the Agent Design Make a Difference? In International Conference on Augmented Reality, Virtual Reality and Computer Graphics, Springer, 10–25.",
      "doi": ""
    },
    {
      "text": "Nicoletta Adamo-Villani, Jason Lestina, and Saikiran Anasingaraju. 2015. Does Character's Visual Style Affect Viewer's Perception of Signing Avatars? In Second International Conference on E-Learning, E-Education, and Online Training, Springer, 1–8.",
      "doi": ""
    },
    {
      "text": "Tamara Adlin and John Pruitt. 2010. The Essential Persona Lifecycle: Your Guide to Building and Using Personas (1st ed.). Morgan Kaufmann Publishers Inc., San Francisco, CA, USA.",
      "doi": ""
    },
    {
      "text": "Basant Agarwal. 2014. Personality detection from text: A Review. International Journal of Computer System 1, 1 (2014).",
      "doi": ""
    },
    {
      "text": "Jisun An, Haewoon Kwak, Soon-gyo Jung, Joni Salminen, and Bernard J. Jansen. 2018. Customer segmentation using online platforms: isolating behavioral and demographic segments for persona creation via aggregated user data. Soc. Netw. Anal. Min. 8, 1 (December 2018), 54. DOI: https://doi.org/10.1007/s13278-018-0531-0",
      "doi": ""
    },
    {
      "text": "Jisun An, Haewoon Kwak, Joni Salminen, Soon-gyo Jung, and Bernard J. Jansen. 2018. Imaginary People Representing Real Numbers: Generating Personas from Online Social Media Data. ACM Transactions on the Web (TWEB) 12, 4 (2018), Article No. 27. DOI: https://doi.org/10.1145/3265986",
      "doi": "10.1145/3265986"
    },
    {
      "text": "John R. Anderson, Daniel Bothell, Michael D. Byrne, Scott Douglass, Christian Lebiere, and Yulin Qin. 2004. An integrated theory of the mind. Psychological review 111, 4 (2004), 1036.",
      "doi": ""
    },
    {
      "text": "Elisabeth André, Thomas Rist, and Jochen Müller. 1998. WebPersona: a lifelike presentation agent for the World-Wide Web. Knowledge-Based Systems 11, 1 (September 1998), 25–36. DOI: https://doi.org/10.1016/S0950-7051(98)00057-4",
      "doi": "10.1016/S0950-7051%2898%2900057-4"
    },
    {
      "text": "Farshid Anvari and Deborah Richards. 2016. A Method to Identify Talented Aspiring Designers in Use of Personas with Personality. In Evaluation of Novel Approaches to Software Engineering, Leszek A. Maciaszek and Joaquim Filipe (eds.). Springer International Publishing, Cham, 40–61. DOI: https://doi.org/10.1007/978-3-319-30243-0_3",
      "doi": ""
    },
    {
      "text": "Farshid Anvari, Deborah Richards, Michael Hitchens, and Muhammad Ali Babar. 2015. Effectiveness of Persona with Personality Traits on Conceptual Design. In Proceedings of the 37th International Conference on Software Engineering - Volume 2 (ICSE ’15), IEEE Press, Piscataway, NJ, USA, 263–272. Retrieved July 11, 2018 from http://dl.acm.org/citation.cfm?id=2819009.2819048",
      "doi": ""
    },
    {
      "text": "Farshid Anvari, Deborah Richards, Michael Hitchens, Muhammad Ali Babar, Hien Minh Thi Tran, and Peter Busch. 2017. An empirical investigation of the influence of persona with personality traits on conceptual design. Journal of Systems and Software 134, (December 2017), 324–339. DOI: https://doi.org/10.1016/j.jss.2017.09.020",
      "doi": "10.1016/j.jss.2017.09.020"
    },
    {
      "text": "Farshid Anvari and Hien Minh Tri Tran. 2013. Persona ontology for user centred design professionals. In The ICIME 4th International Conference on Information Management and Evaluation, Ho Chi Minh City, Vietnam, 35–44.",
      "doi": ""
    },
    {
      "text": "M. Aoyama. 2005. Persona-and-scenario based requirements engineering for software embedded in digital consumer products. In Proceedings of the 13th IEEE International Conference on Requirements Engineering (RE’05), Washington, DC, USA, 85–94. DOI: https://doi.org/10.1109/RE.2005.50",
      "doi": "10.1109/RE.2005.50"
    },
    {
      "text": "Theo Araujo. 2018. Living up to the chatbot hype: The influence of anthropomorphic design cues and communicative agency framing on conversational agent and company perceptions. Computers in Human Behavior 85, (August 2018), 183–189. DOI: https://doi.org/10.1016/j.chb.2018.03.051",
      "doi": ""
    },
    {
      "text": "David Bamman, Brendan O'Connor, and Noah A Smith. 2013. Learning Latent Personas of Film Characters. In Proceedings of the 51st Annual Meeting of the Association for Computational Linguistics, Sofia, Bulgaria, 10.",
      "doi": ""
    },
    {
      "text": "Bjorn Bengtsson, Judee K. Burgoon, Carl Cederberg, Joseph Bonito, and Magnus Lundeberg. 1999. The impact of anthropomorphic interfaces on influence understanding, and credibility. In Proceedings of the 32nd Annual Hawaii International Conference on Systems Sciences. 1999. HICSS-32. Abstracts and CD-ROM of Full Papers, IEEE, 15-pp.",
      "doi": ""
    },
    {
      "text": "Aline W. de Borst and Beatrice de Gelder. 2015. Is it the real deal? Perception of virtual characters versus humans: an affective cognitive neuroscience perspective. Frontiers in psychology 6, (2015), 576.",
      "doi": ""
    },
    {
      "text": "Daniel G. Cabrero. 2014. Participatory design of persona artefacts for user eXperience in non-WEIRD cultures. In Proceedings of the 13th Participatory Design Conference: Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts-Volume 2, 247–250.",
      "doi": "10.1145/2662155.2662246"
    },
    {
      "text": "Daniel G. Cabrero, Heike Winschiers-Theophilus, and José Abdelnour-Nocera. 2016. A Critique of Personas As Representations of “the Other” in Cross-Cultural Technology Design. In Proceedings of the First African Conference on Human Computer Interaction (AfriCHI’16), ACM, Nairobi, Kenya, 149–154. DOI: https://doi.org/10.1145/2998581.2998595",
      "doi": "10.1145/2998581.2998595"
    },
    {
      "text": "Daniel G. Cabrero, Heike Winschiers-Theophilus, Jose Abdelnour-Nocera, and Gereon Koch Kapuire. 2016. A hermeneutic inquiry into user-created personas in different Namibian locales. In Proceedings of the 14th Participatory Design Conference: Full papers-Volume 1, 101–110.",
      "doi": "10.1145/2940299.2940310"
    },
    {
      "text": "Daniel G. Cabrero, Heike Winschiers-Theophilus, and Hedvig Mendonca. 2015. User-created personas–a micro-cultural lens into informal settlement's youth life. In IFIP Working Conference on Human Work Interaction Design, Springer, 57–70.",
      "doi": ""
    },
    {
      "text": "Yen-ning Chang, Youn-kyung Lim, and Erik Stolterman. 2008. Personas: From Theory to Practices. In Proceedings of the 5th Nordic Conference on Human-computer Interaction: Building Bridges (NordiCHI ’08), ACM, New York, NY, USA, 439–442. DOI: https://doi.org/10.1145/1463160.1463214",
      "doi": ""
    },
    {
      "text": "Alan Cooper. 1999. The Inmates Are Running the Asylum: Why High Tech Products Drive Us Crazy and How to Restore the Sanity (1 edition ed.). Sams - Pearson Education, Indianapolis, IN.",
      "doi": ""
    },
    {
      "text": "Ewart J. De Visser, Samuel S. Monfort, Ryan McKendrick, Melissa AB Smith, Patrick E. McKnight, Frank Krueger, and Raja Parasuraman. 2016. Almost human: Anthropomorphism increases trust resilience in cognitive agents. Journal of Experimental Psychology: Applied 22, 3 (2016), 331.",
      "doi": ""
    },
    {
      "text": "Lan Du and Ziqi Wang. 2018. Research on the Annual Reading Report of Academic Libraries Based on Personas. Open Journal of Social Sciences 6, 10 (October 2018), 95–105. DOI: https://doi.org/10.4236/jss.2018.610009",
      "doi": ""
    },
    {
      "text": "Brian R. Duffy. 2003. Anthropomorphism and the social robot. Robotics and autonomous systems 42, 3–4 (2003), 177–190.",
      "doi": ""
    },
    {
      "text": "Autumn Edwards, Chad Edwards, Patric R. Spence, Christina Harris, and Andrew Gambino. 2016. Robots in the classroom: Differences in students’ perceptions of credibility and learning between “teacher as robot” and “robot as teacher.” Computers in Human Behavior 65, (December 2016), 627–634. DOI: https://doi.org/10.1016/j.chb.2016.06.005",
      "doi": "10.1016/j.chb.2016.06.005"
    },
    {
      "text": "Andy Fields. 2005. Discovering statistics using SPSS. Beverly Hills: Sage Publications 541, (2005).",
      "doi": "10.5555/1036774"
    },
    {
      "text": "Robert J. Fisher. 1993. Social desirability bias and the validity of indirect questioning. Journal of Consumer Research 20, 2 (1993), 303–315. DOI: https://doi.org/10.1086/209351",
      "doi": ""
    },
    {
      "text": "Denae Ford, Thomas Zimmermann, Christian Bird, and Nachiappan Nagappan. 2017. Characterizing Software Engineering Work with Personas Based on Knowledge Worker Actions. In Proceedings of the 11th ACM/IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM ’17), IEEE Press, Piscataway, NJ, USA, 394–403. DOI: https://doi.org/10.1109/ESEM.2017.54",
      "doi": "10.1109/ESEM.2017.54"
    },
    {
      "text": "Eun Go and S. Shyam Sundar. 2019. Humanizing Chatbots: The effects of visual, identity and conversational cues on humanness perceptions. Computers in Human Behavior (January 2019). DOI: https://doi.org/10.1016/j.chb.2019.01.020",
      "doi": ""
    },
    {
      "text": "Samuel D. Gosling, Peter J. Rentfrow, and William B. Swann. 2003. A very brief measure of the Big-Five personality domains. Journal of Research in personality 37, 6 (2003), 504–528.",
      "doi": ""
    },
    {
      "text": "Jonathan Grudin. 2006. Why Personas Work: The Psychological Evidence. In The Persona Lifecycle, John Pruitt and Tamara Adlin (eds.). Elsevier, 642–663. DOI: https://doi.org/10.1016/B978-012566251-2/50013-7",
      "doi": ""
    },
    {
      "text": "Frank Y. Guo, Sanjay Shamdasani, and Bruce Randall. 2011. Creating Effective Personas for Product Design: Insights from a Case Study. In Internationalization, Design and Global Development (Lecture Notes in Computer Science), Springer, Berlin, Heidelberg, 37–46. DOI: https://doi.org/10.1007/978-3-642-21660-2_5",
      "doi": ""
    },
    {
      "text": "Penny Hagen and David Gravina. 2006. Sharing through Artefacts: client-user centred design. The object of interaction: the role of artefacts in interaction design (2006), 13.",
      "doi": ""
    },
    {
      "text": "Joseph F Hair, William C Black, Barry J Babin, and Rolph E Anderson. 2014. Multivariate data analysis. Pearson Education Limited, Essex.",
      "doi": ""
    },
    {
      "text": "Jillian G. Hamilton. 2009. Identifying with an avatar: a multidisciplinary perspective. In Proceedings of the Cumulus Conference: 38o South: Hemispheric Shifts Across Learning, Teaching and Research, Swinburne University of Technology and and RMIT University.",
      "doi": ""
    },
    {
      "text": "Charles G. Hill, Maren Haag, Alannah Oleson, Chris Mendez, Nicola Marsden, Anita Sarma, and Margaret Burnett. 2017. Gender-Inclusiveness Personas vs. Stereotyping: Can We Have it Both Ways? In Proceedings of the 2017 CHI Conference, ACM Press, Denver, Colorado, USA, 6658–6671. DOI: https://doi.org/10.1145/3025453.3025609",
      "doi": "10.1145/3025453.3025609"
    },
    {
      "text": "Richard J. Holden, Anand Kulanthaivel, Saptarshi Purkayastha, Kathryn M. Goggins, and Sunil Kripalani. 2017. Know thy eHealth user: Development of biopsychosocial personas from a study of older adults with heart failure. International Journal of Medical Informatics 108, (December 2017), 158–167. DOI: https://doi.org/10.1016/j.ijmedinf.2017.10.006",
      "doi": ""
    },
    {
      "text": "Thomas Holz, Mauro Dragone, and Gregory MP O'Hare. 2009. Where robots and virtual agents meet. International Journal of Social Robotics 1, 1 (2009), 83–93.",
      "doi": ""
    },
    {
      "text": "Plinio Thomaz Aquino Junior and Lucia Vilela Leite Filgueiras. 2005. User modeling with personas. In Proceedings of the 2005 Latin American conference on Human-Computer Interaction, ACM, 277–282.",
      "doi": "10.1145/1111360.1111388"
    },
    {
      "text": "Justin Larner. 2014. Value-led personas: a methodology to promote sustainable user-centered design? Working paper (2014). Retrieved from https://eprints.lancs.ac.uk/id/eprint/76219/",
      "doi": ""
    },
    {
      "text": "Susan Laschinger, Jennifer Medves, Cheryl Pulling, Dr Robert McGraw, Brett Waytuck, Margaret B. Harrison, and Kasey Gambeta. 2008. Effectiveness of simulation on health profession students’ knowledge, skills, confidence and satisfaction. International Journal of Evidence-Based Healthcare 6, 3 (2008), 278–302.",
      "doi": ""
    },
    {
      "text": "Makayla M. Lewis and Lizzie Coles-Kemp. 2014. Who says personas can't dance?: the use of comic strips to design information security personas. In Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems - CHI EA ’14, ACM Press, Toronto, Ontario, Canada, 2485–2490. DOI: https://doi.org/10.1145/2559206.2581323",
      "doi": ""
    },
    {
      "text": "Frank Long. 2009. Real or imaginary: The effectiveness of using personas in product design. In Proceedings of the Irish Ergonomics Society Annual Conference, Irish Ergonomics Society Dublin.",
      "doi": ""
    },
    {
      "text": "Yuhan Luo, Peiyi Liu, and Eun Kyoung Choe. 2019. Co-Designing Food Trackers with Dietitians: Identifying Design Opportunities for Food Tracker Customization. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM Press, Glasgow, Scotland Uk, 1–13. DOI: https://doi.org/10.1145/3290605.3300822",
      "doi": "10.1145/3290605.3300822"
    },
    {
      "text": "Jaio Ma and Cindy LeRouge. 2007. Introducing User Profiles and Personas into Information Systems Development. AMCIS 2007 Proceedings (December 2007). Retrieved from http://aisel.aisnet.org/amcis2007/237",
      "doi": ""
    },
    {
      "text": "Maness, J. M., Miaskiewicz, T., and Sumner, T. 2008. Using personas to understand the needs and goals of institutional repository users. D-Lib Magazine 14, 9/10 (2008), 1082–9873.",
      "doi": ""
    },
    {
      "text": "Nicola Marsden and Maren Haag. 2016. Stereotypes and Politics: Reflections on Personas. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), ACM, San Jose, USA, 4017–4031. DOI: https://doi.org/10.1145/2858036.2858151",
      "doi": "10.1145/2858036.2858151"
    },
    {
      "text": "Tara Matthews, Tejinder Judge, and Steve Whittaker. 2012. How Do Designers and User Experience Professionals Actually Perceive and Use Personas? In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’12), ACM, Austin, Texas, USA, 1219–1228. DOI: https://doi.org/10.1145/2207676.2208573",
      "doi": "10.1145/2207676.2208573"
    },
    {
      "text": "Scott McCloud and A. D. Manning. 1998. Understanding comics: The invisible art. IEEE Transactions on Professional Communications 41, 1 (1998), 66–69.",
      "doi": ""
    },
    {
      "text": "Rachel McDonnell, Sophie Jörg, Joanna McHugh, Fiona Newell, and Carol O'Sullivan. 2008. Evaluating the emotional content of human motions on real and virtual characters. In Proceedings of the 5th symposium on Applied perception in graphics and visualization, 67–74.",
      "doi": "10.1145/1394281.1394294"
    },
    {
      "text": "Keith A McNeil, Isadore Newman, and Francis J Kelly. 1996. Testing research hypotheses with the general linear model. SIU Press.",
      "doi": ""
    },
    {
      "text": "Paul Milgram, Haruo Takemura, Akira Utsumi, and Fumio Kishino. 1995. Augmented reality: A class of displays on the reality-virtuality continuum. In Telemanipulator and telepresence technologies, International Society for Optics and Photonics, 282–292.",
      "doi": ""
    },
    {
      "text": "Masahiro Mori. 1970. Bukimi no tani [the uncanny valley]. Energy 7, (1970), 33–35.",
      "doi": ""
    },
    {
      "text": "Lene Nielsen. 2002. From User to Character: An Investigation into User-descriptions in Scenarios. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS ’02), ACM, London, England, 99–104. DOI: https://doi.org/10.1145/778712.778729",
      "doi": "10.1145/778712.778729"
    },
    {
      "text": "Lene Nielsen. 2004. Engaging personas and narrative scenarios. PhD Thesis. Samfundslitteratur, Copenhagen, Denmark. Retrieved from http://personas.dk/wp-content/samlet-udgave-til-load.pdf",
      "doi": ""
    },
    {
      "text": "Lene Nielsen. 2010. Personas in Cross-Cultural Projects. In Human Work Interaction Design: Usability in Social, Cultural and Organizational Contexts, Dinesh Katre, Rikke Orngreen, Pradeep Yammiyavar and Torkil Clemmensen (eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 76–82. DOI: https://doi.org/10.1007/978-3-642-11762-6_7",
      "doi": ""
    },
    {
      "text": "Lene Nielsen. 2019. Going Global—International Personas. In Personas - User Focused Design, Lene Nielsen (ed.). Springer, London, 123–133. DOI: https://doi.org/10.1007/978-1-4471-7427-1_7",
      "doi": ""
    },
    {
      "text": "Lene Nielsen. 2019. Personas - User Focused Design (2nd ed. 2019 edition ed.). Springer, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Lene Nielsen, Kira Storgaard Hansen, Jan Stage, and Jane Billestrup. 2015. A Template for Design Personas: Analysis of 47 Persona Descriptions from Danish Industries and Organizations. International Journal of Sociotechnology and Knowledge Development 7, 1 (January 2015), 45–61. DOI: https://doi.org/10.4018/ijskd.2015010104",
      "doi": "10.4018/ijskd.2015010104"
    },
    {
      "text": "Lene Nielsen and Kira Storgaard Hansen. 2014. Personas is applicable: a study on the use of personas in Denmark. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Toronto, Ontario, Canada, 1665–1674.",
      "doi": "10.1145/2556288.2557080"
    },
    {
      "text": "James E. Nieters, Subbarao Ivaturi, and Iftikhar Ahmed. 2007. Making personas memorable. In CHI ’07 extended abstracts on Human factors in computing systems - CHI ’07, ACM Press, San Jose, CA, USA, 1817. DOI: https://doi.org/10.1145/1240866.1240905",
      "doi": "10.1145/1240866.1240905"
    },
    {
      "text": "Kristine L. Nowak and Frank Biocca. 2003. The effect of the agency and anthropomorphism on users’ sense of telepresence, copresence, and social presence in virtual environments. Presence: Teleoperators & Virtual Environments 12, 5 (2003), 481–494.",
      "doi": "10.1162/105474603322761289"
    },
    {
      "text": "Helmut Prendinger and Mitsuru Ishizuka. 2004. Introducing the cast for social computing: Life-like characters. In Life-Like Characters. Springer, 3–16.",
      "doi": ""
    },
    {
      "text": "Joni Salminen, Kathleen Guan, Lene Nielsen, Soon-gyo Jung, Shammur Absar Chowdhury, and Bernard J. Jansen. 2020. A Template for Data-Driven Personas: Analyzing 31 Quantitatively Oriented Persona Profiles. In In the Proceedings of the 22nd International Conference on Human-Computer Interaction (HCII’20), Copenhagen, Denmark.",
      "doi": ""
    },
    {
      "text": "Joni Salminen, Soon-gyo Jung, João M. Santos, and Bernard J. Jansen. 2019. Does a Smile Matter if the Person Is Not Real?: The Effect of a Smile and Stock Photos on Persona Perceptions. International Journal of Human–Computer Interaction 0, 0 (September 2019), 1–23. DOI: https://doi.org/10.1080/10447318.2019.1664068",
      "doi": "10.1145/3290607.3312955"
    },
    {
      "text": "Joni Salminen, Ying-Hsang Liu, Sercan Sengun, João M. Santos, Soon-gyo Jung, and Bernard J. Jansen. 2020. The Effect of Numerical and Textual Information on Visual Engagement and Perceptions of AI-Driven Persona Interfaces. In IUI ’20: Proceedings of the 25th International Conference on Intelligent User Interfaces, ACM, Cagliary, Italy, 357–368. DOI: https://doi.org/10.1145/3377325.3377492",
      "doi": "10.1145/3377325.3377492"
    },
    {
      "text": "Joni Salminen, Lene Nielsen, Soon-gyo Jung, Jisun An, Haewoon Kwak, and Bernard J Jansen. 2018. “Is More Better?”: Impact of Multiple Photos on Perception of Persona Profiles. In Proceedings of ACM CHI Conference on Human Factors in Computing Systems (CHI2018), ACM, Montréal, Canada. DOI: https://doi.org/10.1145/3173574.3173891",
      "doi": "10.1145/3173574.3173891"
    },
    {
      "text": "Joni Salminen, Joao M. Santos, Soon-gyo Jung, Motahhare Eslami, and Bernard J. Jansen. 2019. Persona Transparency: Analyzing the Impact of Explanations on Perceptions of Data-Driven Personas. International Journal of Human–Computer Interaction 0, 0 (November 2019), 1–13. DOI: https://doi.org/10.1080/10447318.2019.1688946",
      "doi": "10.1145/3290607.3312955"
    },
    {
      "text": "Joni Salminen, Joao M. Santos, Haewoon Kwak, Jisun An, Soon-gyo Jung, and Bernard J. Jansen. 2020. Persona Perception Scale: Development and Exploratory Validation of an Instrument for Evaluating Individuals’ Perceptions of Personas. International Journal of Human-Computer Studies 141, (April 2020), 102437. DOI: https://doi.org/10.1016/j.ijhcs.2020.102437",
      "doi": ""
    },
    {
      "text": "Thiago Freitas dos Santos, Danilo Gouveia de Castro, Andrey Araujo Masiero, and Plinio Thomaz Aquino Junior. 2014. Behavioral persona for human-robot interaction: a study based on pet robot. In International Conference on Human-Computer Interaction, Springer, 687–696.",
      "doi": ""
    },
    {
      "text": "Sercan Şengün. 2014. A semiotic reading of digital avatars and their role of uncertainty reduction in digital communication. Journal of Media Critiques 1, Special (2014), 149–162.",
      "doi": ""
    },
    {
      "text": "Sercan Sengün. 2015. Why do I fall for the elf, when i am no orc myself? The ımplıcatıons of vırtual avatars ın dıgıtal communıcatıon. Comunicação e Sociedade 27, (2015), 181–193.",
      "doi": ""
    },
    {
      "text": "Michal Shmueli-Scheuer, Tommy Sandbank, David Konopnicki, and Ora Peled Nakash. 2018. Exploring the universe of egregious conversations in chatbots. In Proceedings of the 23rd International Conference on Intelligent User Interfaces Companion, ACM, 16.",
      "doi": "10.1145/3180308.3180324"
    },
    {
      "text": "Gavin Sim, Abhishek Shrivastava, Matthew Horton, Simran Agarwal, Pampana Sai Haasini, Chandini Sushma Kondeti, and Lorna McKnight. 2019. Child-Generated Personas to Aid Design Across Cultures. In Human-Computer Interaction – INTERACT 2019 (Lecture Notes in Computer Science), Springer International Publishing, Cham, 112–131. DOI: https://doi.org/10.1007/978-3-030-29387-1_7",
      "doi": ""
    },
    {
      "text": "Martin N. Stienen, Felix Scholtes, Robin Samuel, Alexander Weil, Astrid Weyerbrock, and Werner Surbeck. 2018. Different but similar: personality traits of​ surgeons and internists—results of a cross-sectional observational study. BMJ open 8, 7 (2018), e021310.",
      "doi": ""
    },
    {
      "text": "Phil Turner and Susan Turner. 2011. Is stereotyping inevitable when designing with personas? Design studies 32, 1 (2011), 30–44.",
      "doi": ""
    },
    {
      "text": "UK Government. LPC welcomes acceptance of its 2019 minimum wage rate recommendations. GOV.UK. Retrieved August 12, 2020 from https://www.gov.uk/government/news/lpc-welcomes-acceptance-of-its-2019-minimum-wage-rate-recommendations",
      "doi": ""
    },
    {
      "text": "UX Stack Exchange. 2014. Gender neutral photos for users who don't yet have a profile picture. User Experience Stack Exchange. Retrieved August 12, 2020 from https://ux.stackexchange.com/questions/58102/gender-neutral-photos-for-users-who-dont-yet-have-a-profile-picture",
      "doi": ""
    },
    {
      "text": "L. Wang, L. Li, H. Cai, L. Xu, B. Xu, and L. Jiang. 2018. Analysis of Regional Group Health Persona Based on Image Recognition. In 2018 Sixth International Conference on Enterprise Systems (ES), 166–171. DOI: https://doi.org/10.1109/ES.2018.00033",
      "doi": ""
    },
    {
      "text": "Robert B. Welch, Theodore T. Blackmon, Andrew Liu, Barbara A. Mellers, and Lawrence W. Stark. 1996. The effects of pictorial realism, delay of visual feedback, and observer interactivity on the subjective sense of presence. Presence: Teleoperators & Virtual Environments 5, 3 (1996), 263–273.",
      "doi": "10.1162/pres.1996.5.3.263"
    },
    {
      "text": "WikiMili. 2020. Collective intelligence. Retrieved from https://wikimili.com/en/Collective_intelligence",
      "doi": ""
    },
    {
      "text": "Michelle X. Zhou, Wenxi Chen, Ziang Xiao, Huahai Yang, Tracy Chi, and Ransom Williams. 2019. Getting virtually personal: chatbots who actively listen to you and infer your personality. In Proceedings of the 24th International Conference on Intelligent User Interfaces: Companion, ACM, 123–124.",
      "doi": ""
    }
  ]
}