{
  "doi": "10.1145/3411764.3445366",
  "title": "The Effects of System Interpretation Errors on Learning New Input Mechanisms",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Input mechanisms can produce noisy signals that computers must interpret, and this interpretation can misconstrue the user’s intention. Researchers have studied how interpretation errors can affect users’ task performance, but little is known about how these errors affect learning, and whether they help or hinder the transition to expertise. Previous findings suggest that increasing the user’s attention can facilitate learning, so frequent interpretation errors may increase attention and learning; alternatively, however, interpretation errors may negatively interfere with skill development. To explore these potentially important effects, we conducted studies where participants learned commands with various rates of artificially injected interpretation errors. Our results showed that higher rates of interpretation error led to worse memory retention, higher completion times, higher occurrences of user error (beyond those injected by the system), and greater perceived effort. These findings indicate that when input mechanisms must interpret the user’s input, interpretation errors cause problems for user learning.",
  "authors": [
    {
      "name": "Kevin C. Lam",
      "institution": "University of Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702564",
      "orcid": "missing"
    },
    {
      "name": "Carl Gutwin",
      "institution": "University of Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100275704",
      "orcid": "0000-0003-4470-9495"
    },
    {
      "name": "Madison Klarkowski",
      "institution": "University of Saskatchewan, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658771903",
      "orcid": "missing"
    },
    {
      "name": "Andy Cockburn",
      "institution": "University of Canterbury, New Zealand",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100607754",
      "orcid": "0000-0003-1074-4268"
    }
  ],
  "references": [
    {
      "text": "Fabio Aloise, Francesca Schettini, Pietro Aricò, Serenella Salinari, Christoph Guger, Johanna Rinsma, Marco Aiello, Donatella Mattia, and Febo Cincotti. 2011. Asynchronous P300-based brain-computer interface to control a virtual environment: initial tests on end users. Clinical EEG and neuroscience 42, 4 (2011), 219–224.",
      "doi": ""
    },
    {
      "text": "Michael C. Anderson and James H. Neely. 1996. Interference and Inhibition in Memory Retrieval. In Memory. Elsevier, 237–313. https://doi.org/10.1016/b978-012102570-0/50010-0",
      "doi": ""
    },
    {
      "text": "Caroline Appert and Shumin Zhai. 2009. Using strokes as command shortcuts. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press. https://doi.org/10.1145/1518701.1519052",
      "doi": "10.1145/1518701.1519052"
    },
    {
      "text": "Gilles Bailly, Eric Lecolinet, and Yves Guiard. 2010. Finger-count & radial-stroke shortcuts. In Proceedings of the 28th international conference on Human factors in computing systems - CHI '10. ACM Press. https://doi.org/10.1145/1753326.1753414",
      "doi": "10.1145/1753326.1753414"
    },
    {
      "text": "Olivier Bau and Wendy E. Mackay. 2008. OctoPocus. In Proceedings of the 21st annual ACM symposium on User interface software and technology - UIST '08. ACM Press. https://doi.org/10.1145/1449715.1449724",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti, Maribeth Back, W. Keith Edwards, Rebecca E. Grinter, Austin Henderson, and Cristina Lopes. 2002. Making sense of sensing systems. In Proceedings of the SIGCHI conference on Human factors in computing systems Changing our world, changing ourselves - CHI '02. ACM Press. https://doi.org/10.1145/503376.503450",
      "doi": "10.1145/503376.503450"
    },
    {
      "text": "Géry Casiez, Nicolas Roussel, and Daniel Vogel. 2012. 1€ filter: a simple speed-based low-pass filter for noisy input in interactive systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2527–2530.",
      "doi": "10.1145/2207676.2208639"
    },
    {
      "text": "Steven J Castellucci and I Scott MacKenzie. 2008. Graffiti vs. unistrokes: an empirical comparison. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 305–308.",
      "doi": "10.1145/1357054.1357106"
    },
    {
      "text": "Andy Cockburn, Carl Gutwin, Joey Scarr, and Sylvain Malacria. 2015. Supporting Novice to Expert Transitions in User Interfaces. Comput. Surveys 47, 2 (Jan. 2015), 1–36. https://doi.org/10.1145/2659796",
      "doi": ""
    },
    {
      "text": "Andy Cockburn, Per Ola Kristensson, Jason Alexander, and Shumin Zhai. 2007. Hard lessons. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '07. ACM Press. https://doi.org/10.1145/1240624.1240863",
      "doi": "10.1145/1240624.1240863"
    },
    {
      "text": "Jacob Cohen. 1973. Eta-squared and partial eta-squared in communication science. Human Communication Research 28, 56 (1973), 473–490.",
      "doi": ""
    },
    {
      "text": "Fergus I.M. Craik and Robert S. Lockhart. 1972. Levels of processing: A framework for memory research. Journal of Verbal Learning and Verbal Behavior 11, 6 (Dec. 1972), 671–684. https://doi.org/10.1016/s0022-5371(72)80001-x",
      "doi": ""
    },
    {
      "text": "Brian D. Ehret. 2002. Learning where to look. In Proceedings of the SIGCHI conference on Human factors in computing systems Changing our world, changing ourselves - CHI '02. ACM Press. https://doi.org/10.1145/503376.503414",
      "doi": "10.1145/503376.503414"
    },
    {
      "text": "Paul M Fitts and Michael I Posner. 1967. Human performance.(1967).",
      "doi": ""
    },
    {
      "text": "James Fogarty, Scott E. Hudson, Christopher G. Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C. Lee, and Jie Yang. 2005. Predicting human interruptibility with sensors. ACM Transactions on Computer-Human Interaction 12, 1 (March 2005), 119–146. https://doi.org/10.1145/1057237.1057243",
      "doi": "10.1145/1057237"
    },
    {
      "text": "Ella Gabitov, Arnaud Boutin, Basile Pinsard, Nitzan Censor, Stuart M. Fogel, GeneviÃšve Albouy, Bradley R. King, Julie Carrier, Leonardo G. Cohen, Avi Karni, and Julien Doyon. 2019. Susceptibility of consolidated procedural memory to interference is independent of its active task-based retrieval. PloS one 14, 1 (2019), e0210876.",
      "doi": ""
    },
    {
      "text": "Carl Gutwin, Andy Cockburn, Joey Scarr, Sylvain Malacria, and Scott C. Olson. 2014. Faster command selection on tablets with FastTap. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems - CHI '14. ACM Press. https://doi.org/10.1145/2556288.2557136",
      "doi": "10.1145/2556288.2557136"
    },
    {
      "text": "Chris Harrison, Desney Tan, and Dan Morris. 2010. Skinput: appropriating the body as an input surface. In Proceedings of the SIGCHI conference on human factors in computing systems. 453–462.",
      "doi": "10.1145/1753326.1753394"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Advances in Psychology. Elsevier, 139–183. https://doi.org/10.1016/s0166-4115(08)62386-9",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI conference on human factors in computing systems. 203–212.",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Ken Hinckley, Patrick Baudisch, Gonzalo Ramos, and Francois Guimbretiere. 2005. Design and analysis of delimiters for selection-action pen gesture phrases in scriboli. In Proceedings of the SIGCHI conference on Human factors in computing systems - CHI '05. ACM Press. https://doi.org/10.1145/1054972.1055035",
      "doi": "10.1145/1054972.1055035"
    },
    {
      "text": "J Honeybourne, M Hill, and H Moors. 2000. Physical education and sport. Stanly Thones, (2000).",
      "doi": ""
    },
    {
      "text": "Toshiki Iso and Kenichi Yamazaki. 2006. Gait analyzer based on a cell phone with a single three-axis accelerometer. In Proceedings of the 8th conference on Human-computer interaction with mobile devices and services - MobileHCI '06. ACM Press. https://doi.org/10.1145/1152215.1152244",
      "doi": "10.1145/1152215.1152244"
    },
    {
      "text": "Robert JK Jacob. 1996. Human-computer interaction: input devices. ACM Computing Surveys (CSUR) 28, 1 (1996), 177–179.",
      "doi": "10.1145/234313.234387"
    },
    {
      "text": "Daniel R. Kimball, Elizabeth L. Bjork, Robert A. Bjork, and Troy A. Smith. 2008. Part-list cuing and the dynamics of false recall. Psychonomic Bulletin & Review 15, 2 (2008), 296–301.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Ed H Chi, and Bongwon Suh. 2008. Crowdsourcing user studies with Mechanical Turk. In Proceedings of the SIGCHI conference on human factors in computing systems. 453–456.",
      "doi": "10.1145/1357054.1357127"
    },
    {
      "text": "Per-Ola Kristensson and Shumin Zhai. 2004. SHARK 2. In Proceedings of the 17th annual ACM symposium on User interface software and technology - UIST '04. ACM Press. https://doi.org/10.1145/1029632.1029640",
      "doi": "10.1145/1029632.1029640"
    },
    {
      "text": "Gordon P Kurtenbach, Abigail J Sellen, and William AS Buxton. 1993. An empirical evaluation of some articulatory and cognitive aspects of marking menus. Human-Computer Interaction 8, 1 (1993), 1–23.",
      "doi": "10.1207/s15327051hci0801_1"
    },
    {
      "text": "Edmund C Lalor, Simon P Kelly, Ciarán Finucane, Robert Burke, Ray Smith, Richard B Reilly, and Gary Mcdarby. 2005. Steady-state VEP-based brain-computer interface control in an immersive 3D gaming environment. EURASIP Journal on Advances in Signal Processing 2005, 19(2005), 706906.",
      "doi": "10.1155/ASP.2005.3156"
    },
    {
      "text": "Thomas K Landauer. 1978. Optimum rehearsal patterns and name learning. Practical aspects of memory(1978).",
      "doi": ""
    },
    {
      "text": "Jinyi Long, Yuanqing Li, Hongtao Wang, Tianyou Yu, Jiahui Pan, and Feng Li. 2012. A Hybrid Brain Computer Interface to Control the Direction and Speed of a Simulated or Real Wheelchair. IEEE Transactions on Neural Systems and Rehabilitation Engineering 20, 5 (Sept. 2012), 720–729. https://doi.org/10.1109/tnsre.2012.2197221",
      "doi": ""
    },
    {
      "text": "Wei Lu, Zheng Tong, and Jinghui Chu. 2016. Dynamic Hand Gesture Recognition With Leap Motion Controller. IEEE Signal Processing Letters 23, 9 (Sept. 2016), 1188–1192. https://doi.org/10.1109/lsp.2016.2590470",
      "doi": ""
    },
    {
      "text": "Michelle A McSweeney. 2018. The pragmatics of text messaging: making meaning in messages. Routledge.",
      "doi": ""
    },
    {
      "text": "Kazuya Murao, Hayami Tobise, Tsutomu Terada, Toshiki Iso, Masahiko Tsukamoto, and Tsutomu Horikoshi. 2015. Mobile phone user authentication with grip gestures using pressure sensors. International Journal of Pervasive Computing and Communications 11, 3 (Sept. 2015), 288–301. https://doi.org/10.1108/ijpcc-03-2015-0017",
      "doi": ""
    },
    {
      "text": "Brad A Myers. 2007. A user acceptance equation for intelligent assistants. In AAAI 2007 Spring Symposium on Interaction Challenges for Intelligent Assistants.",
      "doi": ""
    },
    {
      "text": "Allen Newell and Paul S Rosenbloom. 1981. Mechanisms of skill acquisition and the law of practice. Cognitive skills and their acquisition 1, 1981 (1981), 1–55.",
      "doi": ""
    },
    {
      "text": "Harold Pashler, Nicholas J. Cepeda, John T. Wixted, and Doug Rohrer. 2005. When Does Feedback Facilitate Learning of Words?Journal of Experimental Psychology: Learning, Memory, and Cognition 31, 1(2005), 3–8. https://doi.org/10.1037/0278-7393.31.1.3",
      "doi": ""
    },
    {
      "text": "Mary A. Pyc and Katherine A. Rawson. 2009. Testing the retrieval effort hypothesis: Does greater difficulty correctly recalling information lead to higher levels of memory?Journal of Memory and Language 60, 4 (May 2009), 437–447. https://doi.org/10.1016/j.jml.2009.01.004",
      "doi": ""
    },
    {
      "text": "Joey Scarr, Andy Cockburn, Carl Gutwin, and Andrea Bunt. 2012. Improving command selection with CommandMaps. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI '12. ACM Press. https://doi.org/10.1145/2207676.2207713",
      "doi": "10.1145/2207676.2207713"
    },
    {
      "text": "Joey Scarr, Andy Cockburn, Carl Gutwin, and Philip Quinn. 2011. Dips and ceilings. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11. ACM Press. https://doi.org/10.1145/1978942.1979348",
      "doi": "10.1145/1978942.1979348"
    },
    {
      "text": "Richard A. Schmidt and Robert A. Bjork. 1992. New Conceptualizations of Practice: Common Principles in Three Paradigms Suggest New Concepts for Training. Psychological Science 3, 4 (July 1992), 207–218. https://doi.org/10.1111/j.1467-9280.1992.tb00029.x",
      "doi": ""
    },
    {
      "text": "Jeffrey Stylos, Brad A. Myers, and Andrew Faulring. 2004. Citrine. In Proceedings of the 17th annual ACM symposium on User interface software and technology - UIST '04. ACM Press. https://doi.org/10.1145/1029632.1029665",
      "doi": ""
    },
    {
      "text": "Saiwen Wang, Jie Song, Jaime Lien, Ivan Poupyrev, and Otmar Hilliges. 2016. Interacting with Soli. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM. https://doi.org/10.1145/2984511.2984565",
      "doi": "10.1145/2984511.2984565"
    },
    {
      "text": "Zhengjie Wang, Yushan Hou, Kangkang Jiang, Wenwen Dou, Chengming Zhang, Zehua Huang, and Yinjing Guo. 2019. Hand Gesture Recognition Based on Active Ultrasonic Sensing of Smartphone: A Survey. IEEE Access 7(2019), 111897–111922. https://doi.org/10.1109/access.2019.2933987",
      "doi": ""
    },
    {
      "text": "Andrew Wilson. 2009. Sensor- and Recognition-Based Input for Interaction. In Human Factors and Ergonomics. CRC Press, 153–175. https://doi.org/10.1201/b10368-13",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Stephen A Brewster, and Martin Halvey. 2011. Augmenting Tactile Interaction with Pressure-Based Input. (2011).",
      "doi": ""
    },
    {
      "text": "Carolee J Winstein and Richard A Schmidt. 1990. Reduced frequency of knowledge of results enhances motor skill learning.Journal of Experimental Psychology: Learning, Memory, and Cognition 16, 4(1990), 677.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Edward Cutrell, Susumu Harada, and I Scott MacKenzie. 2008. An error model for pointing based on Fitts’ law. In Proceedings of the SIGCHI conference on human factors in computing systems. 1613–1622.",
      "doi": "10.1145/1357054.1357306"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI '11. ACM Press. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Jacob O Wobbrock, Andrew D Wilson, and Yang Li. 2007. Gestures without libraries, toolkits or training: a $1 recognizer for user interface prototypes. In Proceedings of the 20th annual ACM symposium on User interface software and technology. 159–168.",
      "doi": "10.1145/1294211.1294238"
    },
    {
      "text": "Shumin Zhai. 2012. Foundational Issues in Touch-Surface Stroke Gesture Design — An Integrative Review. Foundations and Trends® in Human–Computer Interaction 5, 2 (2012), 97–205. https://doi.org/10.1561/1100000012",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Anthony Tomasic, Isaac Simmons, Ian Hargraves, Ken Mohnkern, Jason Cornwell, and Robert Martin McGuire. 2007. Vio. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI '07. ACM Press. https://doi.org/10.1145/1240624.1240843",
      "doi": ""
    }
  ]
}