{
  "doi": "10.1145/3411764.3445654",
  "title": "Visualizing Examples of Deep Neural Networks at Scale",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Many programmers want to use deep learning due to its superior accuracy in many challenging domains. Yet our formative study with ten programmers indicated that, when constructing their own deep neural networks (DNNs), they often had a difficult time choosing appropriate model structures and hyperparameter values. This paper presents ExampleNet—a novel interactive visualization system for exploring common and uncommon design choices in a large collection of open-source DNN projects. ExampleNet provides a holistic view of the distribution over model structures and hyperparameter settings in the corpus of DNNs, so users can easily filter the corpus down to projects tackling similar tasks and compare design choices made by others. We evaluated ExampleNet in a within-subjects study with sixteen participants. Compared with the control condition (i.e., online search), participants using ExampleNet were able to inspect more online examples, make more data-driven design decisions, and make fewer design mistakes.",
  "tags": [
    "Visualization",
    "deep neural networks",
    "code examples"
  ],
  "authors": [
    {
      "name": "Litao Yan",
      "institution": "IACS Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700579",
      "orcid": "missing"
    },
    {
      "name": "Elena L. Glassman",
      "institution": "SEAS Harvard University, United States",
      "img": "/do/10.1145/contrib-82658918057/rel-imgonly/glassman_200x300.jpg",
      "acmid": "82658918057",
      "orcid": "0000-0001-5178-3496"
    },
    {
      "name": "Tianyi Zhang",
      "institution": "Computer Science Harvard University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658654086",
      "orcid": "0000-0002-5468-9347"
    }
  ],
  "references": [
    {
      "text": "Saleema Amershi, Andrew Begel, Christian Bird, Robert DeLine, Harald Gall, Ece Kamar, Nachiappan Nagappan, Besmira Nushi, and Thomas Zimmermann. 2019. Software engineering for machine learning: A case study. In 2019 IEEE/ACM 41st International Conference on Software Engineering: Software Engineering in Practice (ICSE-SEIP). IEEE, 291–300.",
      "doi": "10.1109/ICSE-SEIP.2019.00042"
    },
    {
      "text": "Keith Andrews, Martin Wohlfahrt, and Gerhard Wurzinger. 2009. Visual graph comparison. In 2009 13th International Conference Information Visualisation. IEEE, 62–67.",
      "doi": "10.1109/IV.2009.108"
    },
    {
      "text": "Joel Brandt, Philip J Guo, Joel Lewenstein, Mira Dontcheva, and Scott R Klemmer. 2009. Two studies of opportunistic programming: interleaving web foraging, learning, and writing code. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1589–1598.",
      "doi": "10.1145/1518701.1518944"
    },
    {
      "text": "Carrie J Cai and Philip J Guo. 2019. Software Developers Learning Machine Learning: Motivations, Hurdles, and Desires. In 2019 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC). IEEE, 25–34.",
      "doi": ""
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX design innovation: Challenges for working with machine learning as a design material. In Proceedings of the 2017 chi conference on human factors in computing systems. 278–288.",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "Elena L Glassman, Tianyi Zhang, Björn Hartmann, and Miryung Kim. 2018. Visualizing API usage examples at scale. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3174154"
    },
    {
      "text": "Sandra G Hart and Lowell E Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of empirical and theoretical research. In Advances in psychology. Vol. 52. Elsevier, 139–183.",
      "doi": ""
    },
    {
      "text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition. 770–778.",
      "doi": "10.1109/CVPR.2016.90"
    },
    {
      "text": "Xin He, Kaiyong Zhao, and Xiaowen Chu. 2019. AutoML: A Survey of the State-of-the-Art. arXiv preprint arXiv:1908.00709(2019).",
      "doi": ""
    },
    {
      "text": "Andrew Head, Elena L Glassman, Björn Hartmann, and Marti A Hearst. 2018. Interactive extraction of examples from existing code. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173659"
    },
    {
      "text": "Enamul Hoque and Maneesh Agrawala. 2019. Searching the Visual Style and Structure of D3 Visualizations. IEEE Transactions on Visualization and Computer Graphics 26, 1(2019), 1236–1245.",
      "doi": ""
    },
    {
      "text": "Nicholas Kong, Tovi Grossman, Björn Hartmann, Maneesh Agrawala, and George Fitzmaurice. 2012. Delta: a tool for representing and comparing workflows. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1027–1036.",
      "doi": "10.1145/2207676.2208549"
    },
    {
      "text": "Ranjitha Kumar, Arvind Satyanarayan, Cesar Torres, Maxine Lim, Salman Ahmad, Scott R Klemmer, and Jerry O Talton. 2013. Webzeitgeist: design mining the web. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3083–3092.",
      "doi": "10.1145/2470654.2466420"
    },
    {
      "text": "Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R Klemmer. 2010. Designing with interactive example galleries. In Proceedings of the SIGCHI conference on human factors in computing systems. 2257–2266.",
      "doi": "10.1145/1753326.1753667"
    },
    {
      "text": "Howard Lune and Bruce L Berg. 2016. Qualitative research methods for the social sciences. Pearson Higher Ed.",
      "doi": ""
    },
    {
      "text": "Ference Marton. 2014. Necessary conditions of learning. Routledge.",
      "doi": ""
    },
    {
      "text": "Kayur Patel, James Fogarty, James A Landay, and Beverly Harrison. 2008. Investigating statistical machine learning as a tool for software development. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 667–676.",
      "doi": "10.1145/1357054.1357160"
    },
    {
      "text": "William R Pearson. 1991. Searching protein sequence libraries: comparison of the sensitivity and selectivity of the Smith-Waterman and FASTA algorithms. Genomics 11, 3 (1991), 635–650.",
      "doi": ""
    },
    {
      "text": "Nils Reimers and Iryna Gurevych. 2017. Optimal hyperparameters for deep lstm-networks for sequence labeling tasks. arXiv preprint arXiv:1707.06799(2017).",
      "doi": ""
    },
    {
      "text": "Caitlin Sadowski, Kathryn T Stolee, and Sebastian Elbaum. 2015. How developers search for code: a case study. In Proceedings of the 2015 10th Joint Meeting on Foundations of Software Engineering. ACM, 191–201.",
      "doi": "10.1145/2786805.2786855"
    },
    {
      "text": "Connie Schardt, Martha B Adams, Thomas Owens, Sheri Keitz, and Paul Fontelo. 2007. Utilization of the PICO framework to improve searching PubMed for clinical questions. BMC medical informatics and decision making 7, 1 (2007), 16.",
      "doi": ""
    },
    {
      "text": "Susan Elliott Sim, Medha Umarji, Sukanya Ratanotayanon, and Cristina V Lopes. 2011. How well do search engines support code retrieval on the web?ACM Transactions on Software Engineering and Methodology (TOSEM) 21, 1(2011), 4.",
      "doi": ""
    },
    {
      "text": "Daniel Smilkov, Shan Carter, D Sculley, Fernanda B Viégas, and Martin Wattenberg. 2017. Direct-manipulation visualization of deep networks. arXiv preprint arXiv:1708.03788(2017).",
      "doi": ""
    },
    {
      "text": "SONY. 2019. Neural Network Console. https://dl.sony.com.",
      "doi": ""
    },
    {
      "text": "Nitish Srivastava, Geoffrey Hinton, Alex Krizhevsky, Ilya Sutskever, and Ruslan Salakhutdinov. 2014. Dropout: A Simple Way to Prevent Neural Networks from Overfitting. Journal of Machine Learning Research 15, 56 (2014), 1929–1958. http://jmlr.org/papers/v15/srivastava14a.html",
      "doi": "10.5555/2627435.2670313"
    },
    {
      "text": "Hendrik Strobelt, Sebastian Gehrmann, Hanspeter Pfister, and Alexander M Rush. 2017. Lstmvis: A tool for visual analysis of hidden state dynamics in recurrent neural networks. IEEE transactions on visualization and computer graphics 24, 1(2017), 667–676.",
      "doi": ""
    },
    {
      "text": "Kanit Wongsuphasawat, Daniel Smilkov, James Wexler, Jimbo Wilson, Dandelion Mane, Doug Fritz, Dilip Krishnan, Fernanda B Viégas, and Martin Wattenberg. 2017. Visualizing dataflow graphs of deep learning models in tensorflow. IEEE transactions on visualization and computer graphics 24, 1(2017), 1–12.",
      "doi": ""
    },
    {
      "text": "Yuhao Wu, Shaowei Wang, Cor-Paul Bezemer, and Katsuro Inoue. 2018. How Do Developers Utilize Source Code from Stack Overflow?Empirical Software Engineering(2018), 1–37.",
      "doi": ""
    },
    {
      "text": "Qian Yang, Alex Scuito, John Zimmerman, Jodi Forlizzi, and Aaron Steinfeld. 2018. Investigating how experienced UX designers effectively work with machine learning. In Proceedings of the 2018 Designing Interactive Systems Conference. 585–596.",
      "doi": "10.1145/3196709.3196730"
    },
    {
      "text": "Qian Yang, Jina Suh, Nan-Chen Chen, and Gonzalo Ramos. 2018. Grounding interactive machine learning tool design in how non-experts actually build models. In Proceedings of the 2018 Designing Interactive Systems Conference. 573–584.",
      "doi": "10.1145/3196709.3196729"
    },
    {
      "text": "Kaichao You, Mingsheng Long, Jianmin Wang, and Michael I Jordan. 2019. How Does Learning Rate Decay Help Modern Neural Networks?(2019).",
      "doi": ""
    },
    {
      "text": "Tianyi Zhang, Björn Hartmann, Miryung Kim, and Elena L Glassman. 2020. Enabling Data-Driven API Design with Community Usage Data: A Need-Finding Study. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376382"
    }
  ]
}