{
  "doi": "10.1145/3411764.3445247",
  "title": "Understanding the Role of Technology to Support Breastfeeding",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Breastfeeding brings benefits for newborns and parents, but can be a challenging process. In this paper, we leverage a mixed-methods approach that builds on the Integrated Behavioural Model (IBM) to explore parents’ perspectives toward breastfeeding along with their lived experiences, and examine the role of technology in this setting. Results of twelve semi-structured interviews and 175 online survey responses suggest generally positive attitudes toward breastfeeding and good theoretical knowledge. This is combined with a complex lived experience of breastfeeding where main challenges are situated in practical, emotional, and environmental/societal aspects, which are currently not sufficiently recognised by technology that seeks to support breastfeeding. Building upon our findings, we present points for reflection for the design of technology to support breastfeeding, focusing on the importance of drawing from the lived experience of parents, and ensuring that technology not only casts breastfeeding as an individual but also as a collective effort.",
  "tags": [
    "Integrated Behavioral Model",
    "Breastfeeding"
  ],
  "authors": [
    {
      "name": "Kymeng Tang",
      "institution": "Department of Computer Science, e-Media Research Lab KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659319525",
      "orcid": "0000-0002-8221-2677"
    },
    {
      "name": "Kathrin Gerling",
      "institution": "Department of Computer Science, e-Media Research Lab KU Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657431",
      "orcid": "0000-0002-8449-6124"
    },
    {
      "name": "Luc Geurts",
      "institution": "Department of Computer Science, e-Media Research Lab KU Leuven, Belgium",
      "img": "/do/10.1145/contrib-81479650302/rel-imgonly/photo.jpg",
      "acmid": "81479650302",
      "orcid": "0000-0002-9608-9147"
    },
    {
      "name": "Katta Spiel",
      "institution": "Human-Computer Interaction Group TU Wien, Austria",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758673057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jennifer Abbass-Dick, Michele Brolly, Joanne Huizinga, Amber Newport, Fangli Xie, Stephanie George, and Elisabeth Sterken. 2018. Designing an eHealth Breastfeeding Resource With Indigenous Families Using a Participatory Design. Journal of Transcultural Nursing: Official Journal of the Transcultural Nursing Society 29, 5 (2018), 480–488. https://doi.org/10.1177/1043659617731818",
      "doi": ""
    },
    {
      "text": "Indu B. Ahluwalia, Brian Morrow, and Jason Hsia. 2005. Why do women stop breastfeeding? Findings from the Pregnancy Risk Assessment and Monitoring System. Pediatrics 116, 6 (Dec 2005), 1408–1412. https://doi.org/10.1542/peds.2005-0013",
      "doi": ""
    },
    {
      "text": "Icek Ajzen. 1985. From Intentions to Actions: A Theory of Planned Behavior. Springer Berlin Heidelberg, Berlin, Heidelberg, 11–39. https://doi.org/10.1007/978-3-642-69746-3_2",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173732",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Samir Arora, Cheryl McJunkin, Julie Wehrer, and Phyllis Kuhn. 2000. Major factors influencing breastfeeding rates: Mother’s perception of father’s attitude and milk supply. Pediatrics 106, 5 (Nov 2000), E67. https://doi.org/10.1542/peds.106.5.e67",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1709–1718. https://doi.org/10.1145/2702123.2702328",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Albert Bandura. 1986. Social foundations of thought and action: A social cognitive theory. Prentice-Hall, Inc, Englewood Cliffs, NJ, US.",
      "doi": ""
    },
    {
      "text": "Ingrid Blixt, Lena B. Mårtensson, and Anette C. Ekström. 2014. Process-oriented training in breastfeeding for health professionals decreases women’s experiences of breastfeeding challenges. International Breastfeeding Journal 9 (2014), 15. https://doi.org/10.1186/1746-4358-9-15",
      "doi": ""
    },
    {
      "text": "Rosemary Blyth, Debra K. Creedy, Cindy-Lee Dennis, Wendy Moyle, Jan Pratt, and Susan M. De Vries. 2002. Effect of maternal confidence on breastfeeding duration: an application of breastfeeding self-efficacy theory. Birth (Berkeley, Calif.) 29, 4 (Dec 2002), 278–284.",
      "doi": ""
    },
    {
      "text": "Kelly Bonyata. 2020. Kellymom-Parenting Breastfeeding. https://kellymom.com/.",
      "doi": ""
    },
    {
      "text": "Richard E. Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development.Sage Publications, Inc, Thousand Oaks, CA, US. xvi, 184 pages.",
      "doi": ""
    },
    {
      "text": "Kate Boyer. 2011. “The way to break the taboo is to do the taboo thing” breastfeeding in public and citizen-activism in the UK. Health & Place 17, 2 (Mar 2011), 430–437. https://doi.org/10.1016/j.healthplace.2010.06.013",
      "doi": ""
    },
    {
      "text": "Robert E. Braun, Tavis Glassman, Jiunn-Jye Sheu, Joseph Dake, Tim Jordan, and Faith Yingling. 2014. Using the Integrated Behavioral Model to Predict High-Risk Drinking among College Students. Journal of Alcohol and Drug Education 58, 2 (Aug 2014), 46–63.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis. American Psychological Association, Washington, DC, US, 57–71. https://doi.org/10.1037/13620-004",
      "doi": ""
    },
    {
      "text": "P. Chaovalit and S. Pongnumkul. 2017. Moommae: A location-aware mobile information system for breastfeeding mothers in Thailand (invited paper). In 2017 10th International Conference on Ubi-media Computing and Workshops (Ubi-Media). IEEE, Pattaya, Thailand, 1–5. https://doi.org/10.1109/UMEDIA.2017.8074104",
      "doi": ""
    },
    {
      "text": "Erika Chin, Adrienne Porter Felt, Vyas Sekar, and David Wagner. 2012. Measuring User Confidence in Smartphone Security and Privacy. In Proceedings of the Eighth Symposium on Usable Privacy and Security (Washington, D.C.) (SOUPS ’12). Association for Computing Machinery, New York, NY, USA, Article 1, 16 pages. https://doi.org/10.1145/2335356.2335358",
      "doi": "10.1145/2335356.2335358"
    },
    {
      "text": "Barry H. Cohen. 2008. Explaining Psychological Statistics. John Wiley & Sons, Hoboken, New Jersey.",
      "doi": ""
    },
    {
      "text": "D. R. dela Cruz and D. M. M. Mendoza. 2017. Milktrack: Design and development of mobile application and logistics system in empowering breastfeeding practice in the Philippines. In TENCON 2017 - 2017 IEEE Region 10 Conference. IEEE, Penang, Malaysia, 2242–2246. https://doi.org/10.1109/TENCON.2017.8228234",
      "doi": ""
    },
    {
      "text": "Jill Demirci, Virginia Kotzias, Debra L. Bogen, Kristin N. Ray, and Lori Uscher-Pines. 2019. Telelactation via Mobile App: Perspectives of Rural Mothers, Their Care Providers, and Lactation Consultants. Telemedicine Journal and E-Health: The Official Journal of the American Telemedicine Association 25, 9 (Sep 2019), 853–858. https://doi.org/10.1089/tmj.2018.0113",
      "doi": ""
    },
    {
      "text": "Jill R. Demirci, Brian Suffoletto, Jack Doman, Melissa Glasser, Judy C. Chang, Susan M. Sereika, and Debra L. Bogen. 2020. The Development and Evaluation of a Text Message Program to Prevent Perceived Insufficient Milk Among First-Time Mothers: Retrospective Analysis of a Randomized Controlled Trial. JMIR mHealth and uHealth 8, 4 (2020), e17328. https://doi.org/10.2196/17328",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio, Alexis Hope, Becky Michelson, Robyn Churchill, and Ethan Zuckerman. 2016. A Feminist HCI Approach to Designing Postpartum Technologies: ”When I First Saw a Breast Pump I Was Wondering If It Was a Joke”. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2612–2622. https://doi.org/10.1145/2858036.2858460",
      "doi": "10.1145/2858036.2858460"
    },
    {
      "text": "Susan M. Donath, Lisa Helen Amir, and ALSPAC Study Team. 2003. Relationship between prenatal infant feeding intention and initiation and duration of breastfeeding: a cohort study. Acta Paediatrica (Oslo, Norway: 1992) 92, 3 (2003), 352–356.",
      "doi": ""
    },
    {
      "text": "Olive Jean Dunn. 1961. Multiple Comparisons among Means. J. Amer. Statist. Assoc. 56, 293 (Mar 1961), 52–64. https://doi.org/10.1080/01621459.1961.10482090",
      "doi": ""
    },
    {
      "text": "Roger A. Edwards, Timothy Bickmore, Lucia Jenkins, Mary Foley, and Justin Manjourides. 2013. Use of an interactive computer agent to support breastfeeding. Maternal and Child Health Journal 17, 10 (Dec 2013), 1961–1968. https://doi.org/10.1007/s10995-013-1222-0",
      "doi": ""
    },
    {
      "text": "Morten W. Fagerland. 2012. t-tests, non-parametric tests, and large studies—a paradox of statistical practice?BMC Medical Research Methodology 12, 1 (Jun 2012), 78. https://doi.org/10.1186/1471-2288-12-78",
      "doi": ""
    },
    {
      "text": "Martin Fishbein. 1979. A theory of reasoned action: Some applications and implications. Nebraska Symposium on Motivation 27 (1979), 65–116.",
      "doi": ""
    },
    {
      "text": "William A. Fisher, Jeffrey D. Fisher, and Jennifer Harman. 2003. The Information-Motivation-Behavioral Skills Model: A General Social Psychological Approach to Understanding and Promoting Health Behavior. John Wiley & Sons, Ltd, Malden, Massachusetts, Chapter 4, 82–106. https://doi.org/10.1002/9780470753552.ch4arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/9780470753552.ch4",
      "doi": ""
    },
    {
      "text": "Carol A. Friesen, Laura J. Hormuth, Devan Petersen, and Tina Babbitt. 2015. Using Videoconferencing Technology to Provide Breastfeeding Support to Low-Income Women: Connecting Hospital-Based Lactation Consultants with Clients Receiving Care at a Community Health Center. Journal of Human Lactation: Official Journal of International Lactation Consultant Association 31, 4 (Nov 2015), 595–599. https://doi.org/10.1177/0890334415601088",
      "doi": ""
    },
    {
      "text": "Lisa Gatti. 2008. Maternal perceptions of insufficient milk supply in breastfeeding. Journal of Nursing Scholarship: An Official Publication of Sigma Theta Tau International Honor Society of Nursing 40, 4 (2008), 355–363. https://doi.org/10.1111/j.1547-5069.2008.00234.x",
      "doi": ""
    },
    {
      "text": "Nicola Geoghegan-Morphet, Doris Yuen, Esther Rai, Michelle Angelini, Melissa Christmas, and Orlando da Silva. 2014. Development and implementation of a novel online breastfeeding support resource: the Maternal Virtual Infant Nutrition Support Clinic. Breastfeeding Medicine: The Official Journal of the Academy of Breastfeeding Medicine 9, 10 (Dec 2014), 520–523. https://doi.org/10.1089/bfm.2014.0051",
      "doi": ""
    },
    {
      "text": "Kathrin Gerling, Kieran Hicks, Laura Buttrick, Chris Headleand, Ben Williams, Jason Hall, Kymeng Tang, Luc Geurts, and Wei Chen. 2018. Potential and Limitations of Playful Technology to Support Infant Feeding. In Proceedings of the 2018 Annual Symposium on Computer-Human Interaction in Play Companion Extended Abstracts(CHI PLAY ’18 Extended Abstracts). ACM, New York, NY, USA, 431–437. https://doi.org/10.1145/3270316.3271519",
      "doi": "10.1145/3270316.3271519"
    },
    {
      "text": "Lorna Gibson and Vicki L. Hanson. 2013. Digital Motherhood: How Does Technology Help New Mothers?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 313–322. https://doi.org/10.1145/2470654.2470700",
      "doi": "10.1145/2470654.2470700"
    },
    {
      "text": "Jane S. Grassley, Kelley C. Connor, and Laura Bond. 2017. Game-based online antenatal breastfeeding education: A pilot. Applied nursing research: ANR 33 (2017), 93–95. https://doi.org/10.1016/j.apnr.2016.10.011",
      "doi": ""
    },
    {
      "text": "Xinning Gui, Yu Chen, Yubo Kou, Katie Pine, and Yunan Chen. 2017. Investigating Support Seeking from Peers for Pregnancy in Online Health Communities. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 50 (Dec. 2017), 19 pages. https://doi.org/10.1145/3134685",
      "doi": "10.1145/3134685"
    },
    {
      "text": "Ashish Joshi, Douglas M. Puricelli Perin, Chioma Amadi, and Kate Trout. 2015. Evaluating the usability of an interactive, bi-lingual, touchscreen-enabled breastfeeding educational programme: application of Nielson’s heuristics. Journal of Innovation in Health Informatics 22, 2 (Mar 2015), 265–274. https://doi.org/10.14236/jhi.v22i2.71",
      "doi": ""
    },
    {
      "text": "Danuta Kasprzyk and Daniel E. Montaño. 2007. Application of an Integrated Behavioral Model to Understand HIV Prevention Behavior of High-Risk Men in Rural Zimbabwe. Taylor & Francis, New York, 149–169. https://doi.org/10.4324/9780203937082-17",
      "doi": ""
    },
    {
      "text": "Christa M. Kelleher. 2006. The physical challenges of early breastfeeding. Social Science & Medicine 63, 10 (Nov 2006), 2727–2738. https://doi.org/10.1016/j.socscimed.2006.06.027",
      "doi": ""
    },
    {
      "text": "Jacqueline C. Kent, Elizabeth Ashton, Catherine M. Hardwick, Marnie K. Rowan, Elisa S. Chia, Kyle A. Fairclough, Lalitha L. Menon, Courtney Scott, Georgia Mather-McCaw, and Katherine Navarro. 2015. Nipple Pain in Breastfeeding Mothers: Incidence, Causes and Treatments. International Journal of Environmental Research and Public Health 12, 10 (Oct 2015), 12247–12263. https://doi.org/10.3390/ijerph121012247",
      "doi": ""
    },
    {
      "text": "Julia H. Kim, Barbara H. Fiese, and Sharon M. Donovan. 2017. Breastfeeding is Natural but Not the Cultural Norm: A Mixed-Methods Study of First-Time Breastfeeding, African American Mothers Participating in WIC. Journal of Nutrition Education and Behavior 49, 7, Supplement 2 (Jul 2017), S151–S161.e1. https://doi.org/10.1016/j.jneb.2017.04.003",
      "doi": ""
    },
    {
      "text": "William H. Kruskal and W. Allen Wallis. 1952. Use of Ranks in One-Criterion Variance Analysis. J. Amer. Statist. Assoc. 47, 260 (1952), 583–621. https://doi.org/10.2307/2280779",
      "doi": ""
    },
    {
      "text": "José Labarère, Nathalie Gelbert-Baudino, Laurent Laborde, Domitille Arragain, Camille Schelstraete, and Patrice François. 2011. CD-ROM-based program for breastfeeding mothers. Maternal & Child Nutrition 7, 3 (Jul 2011), 263–272. https://doi.org/10.1111/j.1740-8709.2009.00235.x",
      "doi": ""
    },
    {
      "text": "Gabriel M. Leung, Tai Hing Lam, and Lai Ming Ho. 2002. Breast-feeding and its relation to smoking and mode of delivery. Obstetrics and Gynecology 99, 5 Pt 1 (May 2002), 785–794. https://doi.org/10.1016/s0029-7844(02)01940-3",
      "doi": ""
    },
    {
      "text": "M. Kay Libbus and Linda S. Kolostov. 1994. Perceptions of Breastfeeding and Infant Feeding Choice in a Group of Low-income Mid-Missouri Women. Journal of Human Lactation 10, 1 (Mar 1994), 17–23. https://doi.org/10.1177/089033449401000123",
      "doi": ""
    },
    {
      "text": "Liam Mason, Kathrin Gerling, Patrick Dickinson, and Antonella De Angeli. 2019. Design Goals for Playful Technology to Support Physical Activity Among Wheelchair Users. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300262",
      "doi": "10.1145/3290605.3300262"
    },
    {
      "text": "Deborah McCarter-Spaulding and Margaret H. Kearney. 2001. Parenting self-efficacy and perception of insufficient breast milk. Journal of obstetric, gynecologic, and neonatal nursing: JOGNN 30, 5 (Oct 2001), 515–522. https://doi.org/10.1111/j.1552-6909.2001.tb01571.x",
      "doi": ""
    },
    {
      "text": "Shahla Meedya, Kathleen Fahy, and Ashley Kable. 2010. Factors that positively influence breastfeeding duration to 6 months: a literature review. Women and Birth: Journal of the Australian College of Midwives 23, 4 (Dec 2010), 135–145. https://doi.org/10.1016/j.wombi.2010.02.002",
      "doi": ""
    },
    {
      "text": "Amal K. Mitra, Amal J. Khoury, Agnes W. Hinton, and Cathy Carothers. 2004. Predictors of breastfeeding intention among low-income women. Maternal and Child Health Journal 8, 2 (Jun 2004), 65–70.",
      "doi": ""
    },
    {
      "text": "Daniel Montaño and Kasprzyk Danuta. 1992. Health Behavior and Health Education: Theory, Research, and Practice. Annals of Internal Medicine 116, 4 (Feb 1992), 350. https://doi.org/10.7326/0003-4819-116-4-350_1",
      "doi": ""
    },
    {
      "text": "Candace Mulready-Ward and Martine Hackett. 2014. Perception and Attitudes: Breastfeeding in Public in New York City. Journal of Human Lactation 30, 2 (May 2014), 195–200. https://doi.org/10.1177/0890334414524988",
      "doi": ""
    },
    {
      "text": "Nighp. 2015. Nighp-Baby Tracker. http://www.nighp.com/babytracker/.",
      "doi": ""
    },
    {
      "text": "Gary Ong, Mabel Yap, Foo Ling Li, and Tai Bee Choo. 2005. Impact of working status on breastfeeding in Singapore: evidence from the National Breastfeeding Survey 2001. European Journal of Public Health 15, 4 (Aug 2005), 424–430. https://doi.org/10.1093/eurpub/cki030",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2017. WHO | Tracking progress for breastfeeding policies and programmes: Global breastfeeding scorecard 2017. http://www.who.int/nutrition/publications/infantfeeding/global-bf-scorecard-2017/en/",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2019. WHO | Breastfeeding. https://www.who.int/health-topics/breastfeeding",
      "doi": ""
    },
    {
      "text": "Keiko Otsuka, Cindy-Lee Dennis, Hisae Tatsuoka, and Masamine Jimba. 2008. The relationship between breastfeeding self-efficacy and perceived insufficient milk among Japanese mothers. Journal of obstetric, gynecologic, and neonatal nursing: JOGNN 37, 5 (Oct 2008), 546–555. https://doi.org/10.1111/j.1552-6909.2008.00277.x",
      "doi": ""
    },
    {
      "text": "Rachel Pain, Cathy Bailey, and Graham Mowl. 2001. Infant feeding in North East England: contested spaces of reproduction. Area 33, 3 (Sep 2001), 261–272. https://doi.org/10.1111/1475-4762.00030",
      "doi": ""
    },
    {
      "text": "James O. Prochaska and Wayne F. Velicer. 1997. The Transtheoretical Model of Health Behavior Change. American Journal of Health Promotion 12, 1 (Sep 1997), 38–48. https://doi.org/10.4278/0890-1171-12.1.38",
      "doi": ""
    },
    {
      "text": "Enrica Riva, Giuseppe Banderali, Carlo Agostoni, Marco Silano, Giovanni Radaelli, and Marcello Giovannini. 1999. Factors associated with initiation and duration of breastfeeding in Italy. Acta Paediatrica 88, 4 (1999), 411–415. https://doi.org/10.1111/j.1651-2227.1999.tb01132.x",
      "doi": ""
    },
    {
      "text": "Wilaiporn Rojjanasrirat, Eve-Lynn Nelson, and Karen A. Wambach. 2012. A pilot study of home-based videoconferencing for breastfeeding support. Journal of Human Lactation: Official Journal of International Lactation Consultant Association 28, 4 (Nov 2012), 464–467. https://doi.org/10.1177/0890334412449071",
      "doi": ""
    },
    {
      "text": "Nigel C Rollins, Nita Bhandari, Nemat Hajeebhoy, Susan Horton, Chessa K Lutter, Jose C Martines, Ellen G Piwoz, Linda M Richter, and Cesar G Victora. 2016. Why invest, and what it will take to improve breastfeeding practices?The Lancet 387, 10017 (Jan 2016), 491–504. https://doi.org/10.1016/S0140-6736(15)01044-2",
      "doi": ""
    },
    {
      "text": "Irwin M. Rosenstock, Victor J. Strecher, and Marshall H. Becker. 1988. Social learning theory and the Health Belief Model. Health Education Quarterly 15, 2 (1988), 175–183.",
      "doi": ""
    },
    {
      "text": "Richard M. Ryan and Edward L. Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being. American Psychologist 55, 1 (2000), 68–78. https://doi.org/10.1037/0003-066X.55.1.68",
      "doi": ""
    },
    {
      "text": "Stephanie Sayres and Lisa Visentin. 2018. Breastfeeding: uncovering barriers and offering solutions. Current Opinion in Pediatrics 30, 4 (2018), 591–596. https://doi.org/10.1097/MOP.0000000000000647",
      "doi": ""
    },
    {
      "text": "Jane A. Scott, Maeran C. Landers, Robert M. Hughes, and Colin W. Binns. 2001. Factors associated with breastfeeding at discharge and duration of breastfeeding. Journal of Paediatrics and Child Health 37, 3 (Jun 2001), 254–261. https://doi.org/10.1046/j.1440-1754.2001.00646.x",
      "doi": ""
    },
    {
      "text": "Kymeng Tang, Kathrin Gerling, Wei Chen, and Luc Geurts. 2019. Information and Communication Systems to Tackle Barriers to Breastfeeding: Systematic Search and Review. Journal of Medical Internet Research 21, 9 (2019), e13947. https://doi.org/10.2196/13947",
      "doi": ""
    },
    {
      "text": "Chih-Jau Wang, Pimwadee Chaovalit, and Suporn Pongnumkul. 2018. A Breastfeed-Promoting Mobile App Intervention: Usability and Usefulness Study. JMIR mHealth and uHealth 6, 1 (2018), e27. https://doi.org/10.2196/mhealth.8337",
      "doi": ""
    },
    {
      "text": "Chelsea-Joy Wardle, Mitchell Green, Christine Wanjiru Mburu, and Melissa Densmore. 2018. Exploring Co-Design with Breastfeeding Mothers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174056",
      "doi": "10.1145/3173574.3174056"
    },
    {
      "text": "Becky K. White, Roslyn C. Giglia, Jane A. Scott, and Sharyn K. Burns. 2018. How New and Expecting Fathers Engage With an App-Based Online Forum: Qualitative Analysis. JMIR mHealth and uHealth 6, 6 (Jun 2018), e144. https://doi.org/10.2196/mhealth.9999",
      "doi": ""
    },
    {
      "text": "Iain Williamson, Dawn Leeming, Steven Lyttle, and Sally Johnson. 2012. ‘It should be the most natural thing in the world’: exploring first-time mothers’ breastfeeding difficulties in the UK using audio-diaries and interviews. Maternal & Child Nutrition 8, 4 (2012), 434–447. https://doi.org/10.1111/j.1740-8709.2011.00328.x",
      "doi": ""
    },
    {
      "text": "Deepika Yadav, Prerna Malik, Kirti Dabas, and Pushpendra Singh. 2019. Feedpal: Understanding Opportunities for Chatbots in Breastfeeding Education of Women in India. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov 2019), 170:1–170:30. https://doi.org/10.1145/3359272",
      "doi": "10.1145/3359272"
    },
    {
      "text": "Moleen Zunza, Mark F Cotton, Lawrence Mbuagbaw, Richard Lester, and Lehana Thabane. 2017. Interactive weekly mobile phone text messaging plus motivational interviewing in promotion of breastfeeding among women living with HIV in South Africa: study protocol for a randomized controlled trial.Trials 18, 1 (Jul 2017), 331. https://doi.org/10.1186/s13063-017-2079-0",
      "doi": ""
    }
  ]
}