{
  "doi": "10.1145/3411764.3445170",
  "title": "Extended Reality (XR) Remote Research: a Survey of Drawbacks and Opportunities",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Extended Reality (XR) technology - such as virtual and augmented reality - is now widely used in Human Computer Interaction (HCI), social science and psychology experimentation. However, these experiments are predominantly deployed in-lab with a co-present researcher. Remote experiments, without co-present researchers, have not flourished, despite the success of remote approaches for non-XR investigations. This paper summarises findings from a 30-item survey of 46 XR researchers to understand perceived limitations and benefits of remote XR experimentation. Our thematic analysis identifies concerns common with non-XR remote research, such as participant recruitment, as well as XR-specific issues, including safety and hardware variability. We identify potential positive affordances of XR technology, including leveraging data collection functionalities builtin to HMDs (e.g. hand, gaze tracking) and the portability and reproducibility of an experimental setting. We suggest that XR technology could be conceptualised as an interactive technology and a capable data-collection device suited for remote experimentation.",
  "authors": [
    {
      "name": "Jack Ratcliffe",
      "institution": "Queen Mary University of London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659586412",
      "orcid": "missing"
    },
    {
      "name": "Francesco Soave",
      "institution": "Queen Mary University of London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659326798",
      "orcid": "missing"
    },
    {
      "name": "Nick Bryan-Kinns",
      "institution": "Media and Arts Technology Centre Queen Mary University of London, United Kingdom",
      "img": "/do/10.1145/contrib-81100483855/rel-imgonly/webimagenbk.jpg",
      "acmid": "81100483855",
      "orcid": "0000-0002-1382-2914"
    },
    {
      "name": "Laurissa Tokarchuk",
      "institution": "EECS Queen Mary University of London, United Kingdom",
      "img": "/do/10.1145/contrib-81392602941/rel-imgonly/shapeimage_6.png",
      "acmid": "81392602941",
      "orcid": "missing"
    },
    {
      "name": "Ildar Farkhatdinov",
      "institution": "Queen Mary University of London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384595382",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Judith Amores, Robert Richer, Nan Zhao, Pattie Maes, and Bjoern M Eskofier. 2018. Promoting relaxation using virtual reality, olfactory interfaces and wearable EEG. In 2018 IEEE 15th international conference on wearable and implantable body sensor networks (BSN). IEEE, IEEE, Las Vegas, 98–101.",
      "doi": ""
    },
    {
      "text": "Elliot Aronson. 1969. The theory of cognitive dissonance: A current perspective. Advances in experimental social psychology 4, 1 (1969), 34.",
      "doi": ""
    },
    {
      "text": "Frederik Aust, Birk Diedenhofen, Sebastian Ullrich, and Jochen Musch. 2013. Seriousness checks are useful to improve data validity in online research. Behavior research methods 45, 2 (2013), 527–535.",
      "doi": ""
    },
    {
      "text": "Jakki Bailey, Jeremy N Bailenson, Andrea Stevenson Won, June Flora, and K Carrie Armel. 2012. Presence and memory: immersive virtual reality effects on cued recall. In Proceedings of the International Society for Presence Research Annual Conference. Citeseer, International Society for Presence Research Annual Conference, Philadelphia, Pennsylvania, USA, 24–26.",
      "doi": ""
    },
    {
      "text": "Domna Banakou, Parasuram D Hanumanthu, and Mel Slater. 2016. Virtual embodiment of white people in a black virtual body leads to a sustained reduction in their implicit racial bias. Frontiers in human neuroscience 10 (2016), 601.",
      "doi": ""
    },
    {
      "text": "Jim Blascovich. 2002. Social influence within immersive virtual environments. In The social life of avatars. Springer, California, USA, 127–145.",
      "doi": "10.5555/505799.505807"
    },
    {
      "text": "Jim Blascovich, Jack Loomis, Andrew C Beall, Kimberly R Swinth, Crystal L Hoyt, and Jeremy N Bailenson. 2002. Immersive virtual environment technology as a methodological tool for social psychology. Psychological inquiry 13, 2 (2002), 103–124.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Jack Brookes, Matthew Warburton, Mshari Alghadier, Mark Mon-Williams, and Faisal Mushtaq. 2019. Studying human behavior with virtual reality: The Unity Experiment Framework. Behavior research methods 1, 52 (2019), 1–9.",
      "doi": ""
    },
    {
      "text": "Tom Buchanan. 2000. Potential of the Internet for personality research. In Psychological experiments on the Internet. Elsevier, Wir 8AL United Kingdom, 121–140.",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2016. Amazon’s Mechanical Turk: A new source of inexpensive, yet high-quality data?Perspectives on Psychological Science 1, 6 (2016), 3–5.",
      "doi": ""
    },
    {
      "text": "Michael D Buhrmester, Sanaz Talaifar, and Samuel D Gosling. 2018. An evaluation of Amazon’s Mechanical Turk, its rapid rise, and its effective use. Perspectives on Psychological Science 13, 2 (2018), 149–154.",
      "doi": ""
    },
    {
      "text": "Krista Casler, Lydia Bickel, and Elizabeth Hackett. 2013. Separate but equal? A comparison of participants and data gathered via Amazon’s MTurk, social media, and face-to-face behavioral testing. Computers in human behavior 29, 6 (2013), 2156–2160.",
      "doi": "10.1016/j.chb.2013.05.009"
    },
    {
      "text": "Woong Choi, Liang Li, Satoru Satoh, and Kozaburo Hachimura. 2016. Multisensory integration in the virtual hand illusion with active movement. BioMed research international 2016 (2016), 9.",
      "doi": ""
    },
    {
      "text": "Richard E Clark and Terrance G Craig. 1992. Research and theory on multi-media learning effects. In Interactive multimedia learning environments. Springer, University of Southern California USA, 19–30.",
      "doi": ""
    },
    {
      "text": "Lauri Connelly, Yicheng Jia, Maria L Toro, Mary Ellen Stoykov, Robert V Kenyon, and Derek G Kamper. 2010. A pneumatic glove and immersive virtual reality environment for hand rehabilitative training after stroke. IEEE Transactions on Neural Systems and Rehabilitation Engineering 18, 5(2010), 551–559.",
      "doi": ""
    },
    {
      "text": "S. A. Creasy, R. J. Rogers, K. K. Davis, B. B. Gibbs, E. E. Kershaw, and J. M. Jakicic. 2017. Effects of supervised and unsupervised physical activity programmes for weight loss. Obesity Science & Practice 3, 2 (2017), 143–152. https://doi.org/10.1002/osp4.107",
      "doi": ""
    },
    {
      "text": "Darragh Egan, Sean Brennan, John Barrett, Yuansong Qiao, Christian Timmerer, and Niall Murray. 2016. An evaluation of Heart Rate and ElectroDermal Activity as an objective QoE evaluation method for immersive virtual reality environments. In 2016 Eighth International Conference on Quality of Multimedia Experience (QoMEX). IEEE, IEEE, Lisbon, Portugal, 1–6.",
      "doi": ""
    },
    {
      "text": "Donald P Ely and Barbara B Minor. 1994. Educational Media and Technology Yearbook, 1994. Volume 20.ERIC, 6633, Englewood, CO.",
      "doi": ""
    },
    {
      "text": "Daniel Freeman, Polly Haselton, Jason Freeman, Bernhard Spanlang, Sameer Kishore, Emily Albery, Megan Denne, Poppy Brown, Mel Slater, and Alecia Nickless. 2018. Automated psychological therapy using immersive virtual reality for treatment of fear of heights: a single-blind, parallel-group, randomised controlled trial. The Lancet Psychiatry 5, 8 (2018), 625–632.",
      "doi": ""
    },
    {
      "text": "Joseph K Goodman, Cynthia E Cryder, and Amar Cheema. 2013. Data collection in a flat world: The strengths and weaknesses of Mechanical Turk samples. Journal of Behavioral Decision Making 26, 3 (2013), 213–224.",
      "doi": ""
    },
    {
      "text": "Samuel D Gosling, Simine Vazire, Sanjay Srivastava, and Oliver P John. 2004. Should we trust web-based studies? A comparative analysis of six preconceptions about internet questionnaires.American psychologist 59, 2 (2004), 93.",
      "doi": ""
    },
    {
      "text": "Diane Gromala, Xin Tong, Amber Choo, Mehdi Karamnejad, and Chris D Shaw. 2015. The virtual meditative walk: virtual reality therapy for chronic pain management. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 521–524.",
      "doi": "10.1145/2702123.2702344"
    },
    {
      "text": "Azriel Grysman. 2015. Collecting narrative data on Amazon’s Mechanical Turk. Applied Cognitive Psychology 29, 4 (2015), 573–583.",
      "doi": ""
    },
    {
      "text": "Joseph Henrich, Steven J Heine, and Ara Norenzayan. 2010. Most people are not WEIRD. Nature 466, 7302 (2010), 29–29.",
      "doi": ""
    },
    {
      "text": "M. Hertzum, Pia Borlund, and K. B. Kristoffersen. 2015. What Do Thinking-Aloud Participants Say? A Comparison of Moderated and Unmoderated Usability Sessions. International Journal of Human-Computer Interaction 31 (2015), 557 – 570.",
      "doi": ""
    },
    {
      "text": "Hunter G Hoffman, Azucena Garcia-Palacios, Veronica Kapa, Jennifer Beecher, and Sam R Sharar. 2003. Immersive virtual reality for reducing experimental ischemic pain. International Journal of Human-Computer Interaction 15, 3(2003), 469–486.",
      "doi": ""
    },
    {
      "text": "Crystal L Hoyt, Jim Blascovich, and Kimberly R Swinth. 2003. Social inhibition in immersive virtual environments. Presence: Teleoperators & Virtual Environments 12, 2(2003), 183–195.",
      "doi": "10.1162/105474603321640932"
    },
    {
      "text": "Bernd Huber and Krzysztof Z Gajos. 2020. Conducting online virtual environment experiments with uncompensated, unsupervised samples. Plos one 15, 1 (2020), e0227629.",
      "doi": ""
    },
    {
      "text": "Naomi Josman, Eli Somer, Ayelet Reisberg, Patrice L Weiss, Azucena Garcia-Palacios, and Hunter Hoffman. 2006. BusWorld: designing a virtual environment for post-traumatic stress disorder in Israel: a protocol. Cyberpsychology & Behavior 9, 2 (2006), 241–244.",
      "doi": ""
    },
    {
      "text": "Roland Kehl and Luc Van Gool. 2004. Real-time pointing gesture recognition for an immersive environment. In Sixth IEEE International Conference on Automatic Face and Gesture Recognition, 2004. Proceedings.IEEE, IEEE, Seoul, South Korea, 577–582.",
      "doi": ""
    },
    {
      "text": "Pyry Kettunen and J. Oksanen. 2018. Effects of Unsupervised Participation over the Internet on a Usability Study about Map Animation. In New Directions in Geovisual Analytics: Visualization, Computation, and Evaluation. Lipics, 02430 Finland, 7:1–7:7.",
      "doi": ""
    },
    {
      "text": "Florian Keusch. 2015. Why do people participate in Web surveys? Applying survey participation theory to Internet survey data collection. Management review quarterly 65, 3 (2015), 183–216.",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Ilias Bergstrom, and Mel Slater. 2013. Drumming in immersive virtual reality: the body shapes the way we play. IEEE transactions on visualization and computer graphics 19, 4(2013), 597–605.",
      "doi": ""
    },
    {
      "text": "Konstantina Kilteni, Raphaela Groten, and Mel Slater. 2012. The sense of embodiment in virtual reality. Presence: Teleoperators and Virtual Environments 21, 4(2012), 373–387.",
      "doi": "10.1162/PRES_a_00124"
    },
    {
      "text": "Panagiotis Kourtesis, Danai Korre, Simona Collina, Leonidas AA Doumas, and Sarah E MacPherson. 2020. Guidelines for the development of immersive virtual reality software for cognitive neuroscience and neuropsychology: the development of virtual reality everyday assessment lab (VR-EAL), a neuropsychological test battery in immersive virtual reality. Frontiers in Computer Science 1 (2020), 12.",
      "doi": ""
    },
    {
      "text": "John H Krantz and Reeshad Dalal. 2000. Validity of Web-based psychological research. In Psychological experiments on the Internet. Elsevier, Indiana 47243, 35–60.",
      "doi": ""
    },
    {
      "text": "A. Lacroix, R. Kressig, T. Muehlbauer, Y. Gschwind, B. Pfenninger, O. Bruegger, and U. Granacher. 2015. Effects of a Supervised versus an Unsupervised Combined Balance and Strength Training Program on Balance and Muscle Power in Healthy Older Adults: A Randomized Controlled Trial. Gerontology 62(2015), 275 – 288.",
      "doi": ""
    },
    {
      "text": "Barbara L. Ludlow. 2015. Virtual Reality: Emerging Applications and Future Directions. Rural Special Education Quarterly 34, 3 (2015), 3–10. https://doi.org/10.1177/875687051503400302",
      "doi": ""
    },
    {
      "text": "Xiao Ma, Megan Cackett, Leslie Park, Eric Chien, and Mor Naaman. 2018. Web-based VR experiments powered by the crowd. In Proceedings of the 2018 World Wide Web Conference. International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 33–43.",
      "doi": "10.1145/3178876.3186034"
    },
    {
      "text": "Guido Makransky, Thomas S Terkildsen, and Richard E Mayer. 2019. Adding immersive virtual reality to a science lab simulation causes more presence but less learning. Learning and Instruction 60 (2019), 225–236.",
      "doi": ""
    },
    {
      "text": "Winter Mason and Siddharth Suri. 2012. Conducting behavioral research on Amazon’s Mechanical Turk. Behavior research methods 44, 1 (2012), 1–23.",
      "doi": ""
    },
    {
      "text": "Youngme Moon. 1998. The effects of distance in local versus remote human-computer interaction. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM Press/Addison-Wesley Publishing Co., USA, 103–108.",
      "doi": "10.1145/274644.274660"
    },
    {
      "text": "Masahiro Mori, Karl F MacDorman, and Norri Kageki. 2012. The uncanny valley [from the field]. IEEE Robotics & Automation Magazine 19, 2 (2012), 98–100.",
      "doi": ""
    },
    {
      "text": "Jason D Moss and Eric R Muth. 2011. Characteristics of head-mounted displays and their effects on simulator sickness. Human factors 53, 3 (2011), 308–319.",
      "doi": ""
    },
    {
      "text": "Aske Mottelson and Kasper Hornbæk. 2017. Virtual reality studies outside the laboratory. In Proceedings of the 23rd acm symposium on virtual reality software and technology. Association for Computing Machinery, New York, NY, USA, 1–10.",
      "doi": "10.1145/3139131.3139141"
    },
    {
      "text": "Xueni Pan and Antonia F de C Hamilton. 2018. Why and how to use virtual reality to study human social interaction: The challenges of exploring a new research landscape. British Journal of Psychology 109, 3 (2018), 395–417.",
      "doi": ""
    },
    {
      "text": "Gabriele Paolacci and Jesse Chandler. 2014. Inside the Turk: Understanding Mechanical Turk as a participant pool. Current Directions in Psychological Science 23, 3 (2014), 184–188.",
      "doi": ""
    },
    {
      "text": "Gabriele Paolacci, Jesse Chandler, and Panagiotis G Ipeirotis. 2010. Running experiments on amazon mechanical turk. Judgment and Decision making 5, 5 (2010), 411–419.",
      "doi": ""
    },
    {
      "text": "Eyal Peer, Laura Brandimarte, Sonam Samat, and Alessandro Acquisti. 2017. Beyond the Turk: Alternative platforms for crowdsourcing behavioral research. Journal of Experimental Social Psychology 70 (2017), 153–163.",
      "doi": ""
    },
    {
      "text": "Eyal Peer, Joachim Vosgerau, and Alessandro Acquisti. 2014. Reputation as a sufficient condition for data quality on Amazon Mechanical Turk. Behavior research methods 46, 4 (2014), 1023–1031.",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Gun Lee, Robert W Lindeman, and Mark Billinghurst. 2017. Exploring natural eye-gaze-based interaction for immersive virtual reality. In 2017 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, IEEE, Los Angeles, CA, USA, 36–39.",
      "doi": ""
    },
    {
      "text": "Jennifer Preece. 2016. Citizen science: New research challenges for human–computer interaction. International Journal of Human-Computer Interaction 32, 8(2016), 585–612.",
      "doi": ""
    },
    {
      "text": "Jaziar Radianti, Tim A Majchrzak, Jennifer Fromm, and Isabell Wohlgenannt. 2020. A systematic review of immersive virtual reality applications for higher education: Design elements, lessons learned, and research agenda. Computers & Education 147 (2020), 103778.",
      "doi": "10.1016/j.compedu.2019.103778"
    },
    {
      "text": "Jack Ratcliffe and Laurissa Tokarchuk. 2020. Evidence for embodied cognition in immersive virtual environments using a second language learning environment. In 2020 IEEE Conference on Games (CoG). IEEE, IEEE, London, UK, 1–8.",
      "doi": ""
    },
    {
      "text": "Jack Ratcliffe and Laurissa Tokarchuk. 2020. Presence, Embodied Interaction and Motivation: Distinct Learning Phenomena in an Immersive Virtual Environment. In Proceedings of the 28th ACM International Conference on Multimedia. IEEE, London, UK, 1–8.",
      "doi": "10.1145/3394171.3413520"
    },
    {
      "text": "Ulf-Dietrich Reips. 2000. The Web experiment method: Advantages, disadvantages, and solutions. In Psychological experiments on the Internet. Elsevier, CH-8032 Zurich Switzerland, 89–117.",
      "doi": ""
    },
    {
      "text": "Yvonne Rogers and Paul Marshall. 2017. Research in the Wild. Synthesis Lectures on Human-Centered Informatics 10, 3(2017), i–97.",
      "doi": ""
    },
    {
      "text": "Robert S. Ryan, Mara Wilde, and Samantha Crist. 2013. Compared to a small, supervised lab experiment, a large, unsupervised web-based experiment on a previously unknown effect has benefits that outweigh its potential costs. Computers in Human Behavior 29, 4 (2013), 1295 – 1301. https://doi.org/10.1016/j.chb.2013.01.024",
      "doi": "10.1016/j.chb.2013.01.024"
    },
    {
      "text": "David Saffo, Caglar Yildirim, Sara Di Bartolomeo, and Cody Dunne. 2020. Crowdsourcing Virtual Reality Experiments using VRChat. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–8.",
      "doi": "10.1145/3334480.3382829"
    },
    {
      "text": "Ferran Argelaguet Sanz, Anne-Hélène Olivier, Gerd Bruder, Julien Pettré, and Anatole Lécuyer. 2015. Virtual proxemics: Locomotion in the presence of obstacles in large immersive projection environments. In 2015 IEEE Virtual Reality (VR). IEEE, IEEE, Arles, France, 75–80.",
      "doi": ""
    },
    {
      "text": "Valentin Schwind, Pascal Knierim, Nico Haas, and Niels Henze. 2019. Using presence questionnaires in virtual reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12.",
      "doi": "10.1145/3290605.3300590"
    },
    {
      "text": "Kathryn Y Segovia and Jeremy N Bailenson. 2009. Virtually true: Children’s acquisition of false memories in virtual reality. Media Psychology 12, 4 (2009), 371–393.",
      "doi": ""
    },
    {
      "text": "C Senior, Mary L Phillips, J Barnes, and AS David. 1999. An investigation into the perception of dominance from schematic faces: A study using the World-Wide Web. Behavior Research Methods, Instruments, & Computers 31, 2 (1999), 341–346.",
      "doi": ""
    },
    {
      "text": "Francesco Soave, Nick Bryan-Kinns, and Ildar Farkhatdinov. 2020. A Preliminary Study on Full-Body Haptic Stimulation on Modulating Self-motion Perception in Virtual Reality. In Augmented Reality, Virtual Reality, and Computer Graphics, Lucio Tommaso De Paolis and Patrick Bourdot (Eds.). Springer International Publishing, Cham, 461–469.",
      "doi": ""
    },
    {
      "text": "Jon Sprouse. 2011. A validation of Amazon Mechanical Turk for the collection of acceptability judgments in linguistic theory. Behavior research methods 43, 1 (2011), 155–167.",
      "doi": ""
    },
    {
      "text": "A. Steed, S. Frlston, M. M. Lopez, J. Drummond, Y. Pan, and D. Swapp. 2016. An ‘In the Wild’ Experiment on Presence and Embodiment using Consumer Virtual Reality Equipment. IEEE Transactions on Visualization and Computer Graphics 22, 4(2016), 1406–1414.",
      "doi": "10.1109/TVCG.2016.2518135"
    },
    {
      "text": "Anthony Steed, Francisco Ortega, Adam Williams, Ernst Kruijff, Wolfgang Stuerzlinger, Anil Ufuk Batmaz, Andrea Won, Evan Suma Rosenberg, Adalberto Simeone, Aleshia Hayes, and et al.2020. Interactions. https://interactions.acm.org/blog/view/evaluating-immersive-experiences-during-covid-19-and-beyond#Ref2",
      "doi": ""
    },
    {
      "text": "Anthony Steed, Ye Pan, Fiona Zisch, and William Steptoe. 2016. The impact of a self-avatar on cognitive load in immersive virtual reality. In 2016 IEEE Virtual Reality (VR). IEEE, IEEE, Greenville, SC, 67–76.",
      "doi": ""
    },
    {
      "text": "Steven E Stern and Jon E Faber. 1997. The lost e-mail method: Milgram’s lost-letter technique in the age of the Internet. Behavior Research Methods, Instruments, & Computers 29, 2 (1997), 260–263.",
      "doi": ""
    },
    {
      "text": "Ayoung Suh and Jane Prophet. 2018. The state of immersive technology research: A literature analysis. Computers in Human Behavior 86 (2018), 77–90.",
      "doi": ""
    },
    {
      "text": "John Sweller. 2010. Cognitive load theory: Recent theoretical advances.Cognitive Load Theory: Recent Theoretical Advances 1, 2 (2010), 29–47.",
      "doi": ""
    },
    {
      "text": "H Tankovska. 2020. AR/VR headset shipments worldwide 2020-2025. https://www.statista.com/statistics/653390/worldwide-virtual-and-augmented-reality-headset-shipments/",
      "doi": ""
    },
    {
      "text": "Tom Tullis, Stan Fleischman, Michelle McNulty, Carrie Cianchette, and Margaret Bergel. 2002. An empirical comparison of lab and remote usability testing of web sites. In Usability Professionals Association Conference. Usability Professionals Association Conference, Orlando, FL, 8.",
      "doi": ""
    },
    {
      "text": "David Waller, Eric Bachmann, Eric Hodgson, and Andrew C Beall. 2007. The HIVE: A huge immersive virtual environment for research in spatial cognition. Behavior Research Methods 39, 4 (2007), 835–843.",
      "doi": ""
    },
    {
      "text": "Vivek R Warriar, John R Woodward, and Laurissa Tokarchuk. 2019. Modelling Player Preferences in AR Mobile Games. In 2019 IEEE Conference on Games (CoG). IEEE, IEEE, London UK, 1–8.",
      "doi": ""
    },
    {
      "text": "Raphael P Weibel, Jascha Grübel, Hantao Zhao, Tyler Thrash, Dario Meloni, Christoph Hölscher, and Victor R Schinazi. 2018. Virtual reality experiments with physiological measures. JoVE (Journal of Visualized Experiments) 1, 138 (2018), e58318.",
      "doi": ""
    },
    {
      "text": "Christopher J Wilson and Alessandro Soranzo. 2015. The use of virtual reality in psychology: a case study in visual perception. Computational and mathematical methods in medicine 2015 (2015), 7.",
      "doi": ""
    },
    {
      "text": "Ye Yuan and Anthony Steed. 2010. Is the rubber hand illusion induced by immersive virtual reality?. In 2010 IEEE Virtual Reality Conference (VR). IEEE, IEEE, Waltham, MA, USA, 95–102.",
      "doi": "10.1109/VR.2010.5444807"
    },
    {
      "text": "Leshao Zhang and Patrick GT Healey. 2018. Human, Chameleon or Nodding Dog?. In Proceedings of the 20th ACM International Conference on Multimodal Interaction. Association for Computing Machinery, New York, NY, USA, 428–436.",
      "doi": "10.1145/3242969.3242998"
    }
  ]
}