{
  "doi": "10.1145/3411764.3445330",
  "title": "Investigating the Impact of Real-World Environments on the Perception of 2D Visualizations in Augmented Reality",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "In this work we report on two comprehensive user studies investigating the perception of Augmented Reality (AR) visualizations influenced by real-world backgrounds. Since AR is an emerging technology, it is important to also consider productive use cases, which is why we chose an exemplary and challenging industry 4.0 environment. Our basic perceptual research focuses on both the visual complexity of backgrounds as well as the influence of a secondary task. In contrast to our expectation, data of our 34 study participants indicate that the background has far less influence on the perception of AR visualizations. Moreover, we observed a mismatch between measured and subjectively reported performance. We discuss the importance of the background and recommendations for visual real-world augmentations. Overall, our results suggest that AR can be used in many visually challenging environments without losing the ability to productively work with the visualizations shown.",
  "authors": [
    {
      "name": "Marc Satkowski",
      "institution": "Interactive Media Lab Dresden, Technische Universität Dresden, Germany",
      "img": "/do/10.1145/contrib-99659700414/rel-imgonly/2.jpg",
      "acmid": "99659700414",
      "orcid": "0000-0002-1952-8302"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "Interactive Media Lab Dresden, Centre for Tactile Internet with Human-in-the-Loop (CeTI) and Cluster of Excellence Physics of Life, Technische Universität Dresden, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    }
  ],
  "references": [
    {
      "text": "Andrea Albarelli, Augusto Celentano, Luca Cosmo, and Renato Marchi. 2015. On the Interplay between Data Overlay and Real-World Context using See-through Displays. In Proceedings of the 11th Biannual Conference on Italian SIGCHI Chapter - CHItaly 2015. ACM Press, New York, New York, USA, 58–65. https://doi.org/10.1145/2808435.2808455",
      "doi": "10.1145/2808435.2808455"
    },
    {
      "text": "Markus Aleksy and Johannes Schmitt. 2018. Utilizing Augmented Reality and Wearables in Industrial Applications. In Advances in Intelligent Systems and Computing. Vol. 612. Springer, Cham, 147–155. https://doi.org/10.1007/978-3-319-61542-4_13",
      "doi": ""
    },
    {
      "text": "Robert Amar, James Eagan, and John Stasko. 2005. Low-level components of analytic activity in information visualization. In IEEE Symposium on Information Visualization, 2005. INFOVIS 2005.IEEE, 111–117. https://doi.org/10.1109/INFVIS.2005.1532136",
      "doi": ""
    },
    {
      "text": "Ronald Azuma and Chris Furmanski. 2003. Evaluating label placement for augmented reality view management. In The Second IEEE and ACM International Symposium on Mixed and Augmented Reality. IEEE Comput. Soc, 66–75. https://doi.org/10.1109/ISMAR.2003.1240689",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst, Adrian Clark, and Gun Lee. 2015. A Survey of Augmented Reality. Foundations and Trends® in Human–Computer Interaction 8, 2-3(2015), 73–272. https://doi.org/10.1561/1100000049",
      "doi": ""
    },
    {
      "text": "Wolfgang Büschel, Georg Eckert, and Raimund Dachselt. 2020. Challenges in Collaborative Immersive Visualization. 4th Workshop on Immersive Analytics: Envisioning Future Productivity for Immersive Analytics(2020).",
      "doi": ""
    },
    {
      "text": "Wolfgang Büschel, Annett Mitschick, and Raimund Dachselt. 2018. Here and Now : Reality-Based Information Retrieval. Proceedings of the 2018 Conference on Human Information Interaction & RetrievalMay 2015(2018), 171–180. https://doi.org/10.1145/3176349.3176384",
      "doi": "10.1145/3176349.3176384"
    },
    {
      "text": "Wolfgang Büschel, Stefan Vogt, and Raimund Dachselt. 2019. Augmented reality graph visualizations. IEEE Computer Graphics and Applications 39, 3 (2019), 29–40. https://doi.org/10.1109/MCG.2019.2897927",
      "doi": "10.1109/MCG.2019.2897927"
    },
    {
      "text": "Simon Butscher, Sebastian Hubenschmid, Jens Müller, Johannes Fuchs, and Harald Reiterer. 2018. Clusters, Trends, and Outliers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, New York, 1–12. https://doi.org/10.1145/3173574.3173664",
      "doi": "10.1145/3173574.3173664"
    },
    {
      "text": "Maxime Cordeil, Andrew Cunningham, Benjamin Bach, Christophe Hurter, Bruce H. Thomas, Kim Marriott, and Tim Dwyer. 2019. IATK: An Immersive Analytics Toolkit. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 200–209. https://doi.org/10.1109/VR.2019.8797978",
      "doi": ""
    },
    {
      "text": "Maxime Cordeil, Andrew Cunningham, Tim Dwyer, Bruce H Thomas, and Kim Marriott. 2017. ImAxes: Immersive Axes As Embodied Affordances for Interactive Multivariate Data Visualisation. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. 71–83. https://doi.org/10.1145/3126594.3126613",
      "doi": "10.1145/3126594.3126613"
    },
    {
      "text": "Juan David Hincapié-Ramos, Levko Ivanchuk, Srikanth Kirshnamachari Sridharan, and Pourang Irani. 2014. SmartColor: Real-time color correction and contrast for optical see-through head-mounted displays. In ISMAR 2014 - IEEE International Symposium on Mixed and Augmented Reality - Science and Technology 2014, Proceedings. IEEE, 187–194. https://doi.org/10.1109/ISMAR.2014.6948426",
      "doi": ""
    },
    {
      "text": "Luís Fernando de Souza Cardoso, Flávia Cristina Martins Queiroz Mariano, and Ezequiel Roberto Zorzal. 2020. A survey of industrial augmented reality. Computers & Industrial Engineering 139 (2020), 106159. https://doi.org/10.1016/j.cie.2019.106159",
      "doi": "10.1016/j.cie.2019.106159"
    },
    {
      "text": "Saverio Debernardis, Michele Fiorentino, Michele Gattullo, Giuseppe Monno, and Antonio Emmanuele Uva. 2014. Text Readability in Head-Worn Displays: Color and Style Optimization in Video versus Optical See-Through Devices. IEEE Transactions on Visualization and Computer Graphics 20, 1(2014), 125–139. https://doi.org/10.1109/TVCG.2013.86",
      "doi": "10.1109/TVCG.2013.86"
    },
    {
      "text": "Arturo Deza, Emre Akbas, and Miguel P Eckstein. 2016. Piranhas Toolkit: Peripheral Architectures for Natural, Hybrid and Artificial Systems. https://github.com/ArturoDeza/Piranhas",
      "doi": ""
    },
    {
      "text": "Neven A.M. Elsayed, Christian Sandor, and Hamid Laga. 2013. Visual Analytics in Augmented Reality. In 2013 IEEE International Symposium on Mixed and Augmented Reality, ISMAR 2013. IEEE, 1–4. https://doi.org/10.1109/ISMAR.2013.6671817",
      "doi": ""
    },
    {
      "text": "A Erickson, K Kim, G Bruder, and G Welch. 2020. A Review of Visual Perception Research in Optical See-Through Augmented Reality. ICAT-EGVE (2020), 1–9. https://sreal.ucf.edu/wp-content/uploads/2020/10/DarkModeSurvey_ICAT_EGVE_2020-2.pdf",
      "doi": ""
    },
    {
      "text": "A Field, J Miles, and Z Field. 2012. Discovering statistics using R. Sage Publications Ltd.",
      "doi": "10.5555/1036774"
    },
    {
      "text": "Michele Fiorentino, Saverio Debernardis, Antonio E. Uva, and Giuseppe Monno. 2013. Augmented Reality Text Style Readability with See-Through Head-Mounted Displays in Industrial Context. Presence: Teleoperators and Virtual Environments 22, 2(2013), 171–190. https://doi.org/10.1162/PRES_a_00146",
      "doi": "10.1162/PRES_a_00146"
    },
    {
      "text": "Adrien Fonnet and Yannick Prie. 2019. Survey of Immersive Analytics. IEEE Transactions on Visualization and Computer Graphics (2019), 1–22. https://doi.org/10.1109/tvcg.2019.2929033",
      "doi": ""
    },
    {
      "text": "Emanuele Frontoni, Jelena Loncarski, Roberto Pierdicca, Michele Bernardini, and Michele Sasso. 2018. Cyber Physical Systems for Industry 4.0: Towards Real Time Virtual Reality in Smart Manufacturing. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics). Vol. 10851 LNCS. Springer, Cham, 422–434. https://doi.org/10.1007/978-3-319-95282-6_31",
      "doi": ""
    },
    {
      "text": "Chris Furmanski, Ronald Azuma, and Mike Daily. 2002. Augmented-reality visualizations guided by cognition: perceptual heuristics for combining visible and obscured information. In Proceedings. International Symposium on Mixed and Augmented Reality. IEEE, 215–320. https://doi.org/10.1109/ISMAR.2002.1115091",
      "doi": ""
    },
    {
      "text": "Joseph L. Gabbard and J. Edward Swan. 2008. Usability engineering for augmented reality: Employing user-based studies to inform design. In IEEE Transactions on Visualization and Computer Graphics, Vol. 14. 513–525. https://doi.org/10.1109/TVCG.2008.24",
      "doi": ""
    },
    {
      "text": "Michele Gattullo, Antonio E. Uva, Michele Fiorentino, and Joseph L. Gabbard. 2015. Legibility in Industrial AR: Text Style, Color Coding, and Illuminance. IEEE Computer Graphics and Applications 35, 2 (2015), 52–61. https://doi.org/10.1109/MCG.2015.36",
      "doi": "10.1109/MCG.2015.36"
    },
    {
      "text": "Michele Gattullo, Antonio Emmanuele Uva, Michele Fiorentino, and Giuseppe Monno. 2015. Effect of Text Outline and Contrast Polarity on AR Text Readability in Industrial Lighting. IEEE Transactions on Visualization and Computer Graphics 21, 5(2015), 638–651. https://doi.org/10.1109/TVCG.2014.2385056",
      "doi": "10.1109/TVCG.2014.2385056"
    },
    {
      "text": "Melinda S. Jensen, Richard Yao, Whitney N. Street, and Daniel J. Simons. 2011. Change blindness and inattentional blindness. Wiley Interdisciplinary Reviews: Cognitive Science 2, 5 (2011), 529–546. https://doi.org/10.1002/wcs.130",
      "doi": ""
    },
    {
      "text": "Kangsoo Kim, Mark Billinghurst, Gerd Bruder, Henry Been Lirn Duh, and Gregory F. Welch. 2018. Revisiting trends in augmented reality research: A review of the 2nd Decade of ISMAR (2008-2017). IEEE Transactions on Visualization and Computer Graphics 24, 11(2018), 2947–2962. https://doi.org/10.1109/TVCG.2018.2868591",
      "doi": ""
    },
    {
      "text": "Chris D. Kounavis, Anna E. Kasimati, and Efpraxia D. Zamani. 2012. Enhancing the tourism experience through mobile augmented reality: Challenges and prospects. International Journal of Engineering Business Management 4, 1 (2012), 1–6. https://doi.org/10.5772/51644",
      "doi": ""
    },
    {
      "text": "Ernst Kruijff, Jason Orlosky, Naohiro Kishishita, Christina Trepkowski, and Kiyoshi Kiyokawa. 2018. The Influence of Label Design on Search Performance and Noticeability in Wide Field of View Augmented Reality Displays. , 2821–2837 pages. https://doi.org/10.1109/TVCG.2018.2854737",
      "doi": ""
    },
    {
      "text": "Ernst Kruijff, J. Edward Swan, and Steven Feiner. 2010. Perceptual Issues in Augmented Reality Revisited. In 9th IEEE International Symposium on Mixed and Augmented Reality 2010: Science and Technology, ISMAR 2010 - Proceedings. IEEE, 3–12. https://doi.org/10.1109/ISMAR.2010.5643530",
      "doi": ""
    },
    {
      "text": "Alex Leykin and Mihran Tuceryan. 2004. Automatic determination of text readability over textured backgrounds for augmented reality systems. In ISMAR 2004: Proceedings of the Third IEEE and ACM International Symposium on Mixed and Augmented Reality. IEEE, 224–230. https://doi.org/10.1109/ISMAR.2004.22",
      "doi": "10.1109/ISMAR.2004.22"
    },
    {
      "text": "Chao Liu, Sheng Cao, Wayne Tse, and Xun Xu. 2017. Augmented Reality-assisted Intelligent Window for Cyber-Physical Machine Tools. Journal of Manufacturing Systems 44 (2017), 280–286. https://doi.org/10.1016/j.jmsy.2017.04.008",
      "doi": ""
    },
    {
      "text": "Mark A. Livingston, Joseph L. Gabbard, J Edward Swan Ii, Ciara M. Sibley, and Jane H. Barrow. 2013. Basic Perception in Head-Worn Augmented Reality Displays. In Human Factors in Augmented reality environments. Springer, New York, 35–65. https://doi.org/10.1007/978-I-461",
      "doi": ""
    },
    {
      "text": "Weiquan Lu, Henry Been Lirn Duh, Steven Feiner, and Qi Zhao. 2014. Attributes of Subtle Cues for Facilitating Visual Search in Augmented Reality. IEEE Transactions on Visualization and Computer Graphics 20, 3(2014), 404–412. https://doi.org/10.1109/TVCG.2013.241",
      "doi": "10.1109/TVCG.2013.241"
    },
    {
      "text": "Weiquan Lu, Dan Feng, Steven Feiner, Qi Zhao, and Henry Been-Lirn Duh. 2014. Evaluating subtle cueing in head-worn displays. In Proceedings of the Second International Symposium of Chinese CHI on - Chinese CHI ’14. ACM Press, New York, 5–10. https://doi.org/10.1145/2592235.2592237",
      "doi": "10.1145/2592235.2592237"
    },
    {
      "text": "Jacob Boesen Madsen, Markus Tatzqern, Claus B. Madsen, Dieter Schmalstieg, and Denis Kalkofen. 2016. Temporal Coherence Strategies for Augmented Reality Labeling. IEEE Transactions on Visualization and Computer Graphics 22, 4(2016), 1415–1423. https://doi.org/10.1109/TVCG.2016.2518318",
      "doi": "10.1109/TVCG.2016.2518318"
    },
    {
      "text": "Kim Marriott, Falk Schreiber, Tim Dwyer, Karsten Klein, Nathalie Henry Riche, Takayuki Itoh, Wolfgang Stuerzlinger, and Bruce H. Thomas. 2018. Immersive Analytics. Lecture Notes in Computer Science, Vol. 11190. Springer International Publishing, Cham. https://doi.org/10.1007/978-3-030-01388-2",
      "doi": ""
    },
    {
      "text": "Eleni Michailidou, Simon Harper, and Sean Bechhofer. 2008. Visual complexity and aesthetic perception of web pages. In SIGDOC 2008 - Proceedings of the 26th ACM International Conference on Design of Communication. 215–223. https://doi.org/10.1145/1456536.1456581",
      "doi": "10.1145/1456536.1456581"
    },
    {
      "text": "Thomas Moser, Markus Hohlagschwandtner, Gerhard Kormann-Hainzl, Sabine Pölzlbauer, and Josef Wolfartsberger. 2019. Mixed Reality Applications in Industry: Challenges and Research Areas. In Lecture Notes in Business Information Processing, Vol. 338. Springer, Cham, 95–105. https://doi.org/10.1007/978-3-030-05767-1_7",
      "doi": ""
    },
    {
      "text": "Sandra Murphy, Nick Fraenkel, and Polly Dalton. 2013. Perceptual load does not modulate auditory distractor processing. Cognition 129, 2 (nov 2013), 345–355. https://doi.org/10.1016/j.cognition.2013.07.014",
      "doi": ""
    },
    {
      "text": "Aude Oliva, Michael L Mack, Mochan Shrestha, and Angela Peeper. 2004. Identifying the perceptual dimensions of visual complexity of scenes. In Proc. of the 26th Annual Meeting of the Cognitive Science Society. 1041–1046. https://escholarship.org/uc/item/17s4h6w8",
      "doi": ""
    },
    {
      "text": "Volker Paelke and Carsten Röcker. 2015. User Interfaces for Cyber-Physical Systems: Challenges and Possible Approaches. In DUXU 2015, Vol. 9186. Springer, Cham, 75–85. https://doi.org/10.1007/978-3-319-20886-2_8",
      "doi": ""
    },
    {
      "text": "Stephen D. Peterson, Magnus Axholt, and Stephen R. Ellis. 2008. Label segregation by remapping stereoscopic depth in far-field augmented reality. In Proceedings - 7th IEEE International Symposium on Mixed and Augmented Reality 2008, ISMAR 2008. IEEE, 143–152. https://doi.org/10.1109/ISMAR.2008.4637341",
      "doi": "10.1109/ISMAR.2008.4637341"
    },
    {
      "text": "Giulia Pugnaghi, Daniel Memmert, and Carina Kreitz. 2020. Loads of unconscious processing: The role of perceptual load in processing unattended stimuli during inattentional blindness. Attention, Perception, and Psychophysics 82, 5 (jul 2020), 2641–2651. https://doi.org/10.3758/s13414-020-01982-8",
      "doi": ""
    },
    {
      "text": "Patrick Reipschlager, Tamara Flemisch, and Raimund Dachselt. 2020. Personal Augmented Reality for Information Visualization on Large Interactive Displays. IEEE Transactions on Visualization and Computer Graphics (2020), 1–1. https://doi.org/10.1109/TVCG.2020.3030460 arxiv:2009.03237 [cs.HC]",
      "doi": ""
    },
    {
      "text": "Ruth Rosenholtz, Yuanzhen Li, and Lisa Nakano. 2007. Measuring visual clutter. Journal of Vision 7, 2 (2007). https://doi.org/10.1167/7.2.17",
      "doi": ""
    },
    {
      "text": "Bahador Saket, Alex Endert, and Cagatay Demiralp. 2019. Task-Based Effectiveness of Basic Visualizations. IEEE Transactions on Visualization and Computer Graphics 25, 7(2019), 2505–2512. https://doi.org/10.1109/TVCG.2018.2829750 arxiv:1709.08546",
      "doi": ""
    },
    {
      "text": "Dieter Schmalstieg and Tobias Hollerer. 2016. Augmented Reality: Principles and Practice. Addison-Wesley Professional. 13–18;239–270; pages.",
      "doi": "10.1145/2897826.2927365"
    },
    {
      "text": "Ronell Sicat, Jiabao Li, Junyoung Choi, Maxime Cordeil, Won-Ki Jeong, Benjamin Bach, and Hanspeter Pfister. 2019. DXR: A Toolkit for Building Immersive Data Visualizations. IEEE Transactions on Visualization and Computer Graphics 25, 1(2019), 715–725. https://doi.org/10.1109/TVCG.2018.2865152",
      "doi": "10.1109/TVCG.2018.2865152"
    },
    {
      "text": "Richard Skarbez, Nicholas F. Polys, J. Todd Ogle, Chris North, and Doug A. Bowman. 2019. Immersive Analytics: Theory and Research Agenda. Frontiers in Robotics and AI 6 (2019), 82. https://doi.org/10.3389/frobt.2019.00082",
      "doi": ""
    },
    {
      "text": "Hanas Subakti and Jehn-Ruey Jiang. 2018. Indoor Augmented Reality Using Deep Learning for Industry 4.0 Smart Factories. In 2018 IEEE 42nd Annual Computer Software and Applications Conference (COMPSAC). IEEE, 63–68. https://doi.org/10.1109/COMPSAC.2018.10204",
      "doi": ""
    },
    {
      "text": "Ronald van den Berg, Frans W. Cornelissen, and Jos B.T.M. Roerdink. 2009. A crowding model of visual clutter. Journal of Vision 9, 4 (apr 2009), 24–24. https://doi.org/10.1167/9.4.24",
      "doi": ""
    },
    {
      "text": "X. Wang, S. K. Ong, and A. Y.C. Nee. 2016. A comprehensive survey of augmented reality assembly research. Advances in Manufacturing 4, 1 (2016), 1–22. https://doi.org/10.1007/s40436-015-0131-4",
      "doi": ""
    },
    {
      "text": "Xiyao Wang, David Rousseau, Lonni Besançon, Mickael Sereno, Mehdi Ammi, and Tobias Isenberg. 2020. Towards an Understanding of Augmented Reality Extensions for Existing 3D Data Analysis Tools. In ACM CHI 2020. https://doi.org/10.1145/3313831.3376657",
      "doi": "10.1145/3313831.3376657"
    },
    {
      "text": "Matt Whitlock, Stephen Smart, and Danielle Albers Szafir. 2020. Graphical Perception for Immersive Analytics. IEEE Conference on Virtual Reality and 3D User Interfaces (VR) (2020), 616–625. https://cmci.colorado.edu/visualab/3DPerception/3DPerception.pdf",
      "doi": ""
    },
    {
      "text": "Wesley Willett, Yvonne Jansen, and Pierre Dragicevic. 2017. Embedded Data Representations. IEEE Transactions on Visualization and Computer Graphics 23, 1(2017), 461–470. https://doi.org/10.1109/TVCG.2016.2598608",
      "doi": "10.1109/TVCG.2016.2598608"
    },
    {
      "text": "Hsin-Kai Wu, Silvia Wen-Yu Lee, Hsin-Yi Chang, and Jyh-Chong Liang. 2013. Current status, opportunities and challenges of augmented reality in education. Computers & Education 62 (2013), 41–49. https://doi.org/10.1016/j.compedu.2012.10.024 arxiv:1204.1594",
      "doi": "10.5555/2753873.2753932"
    }
  ]
}