{
  "doi": "10.1145/3411764.3445387",
  "title": "Toggles, Dollar Signs, and Triangles: How to (In)Effectively Convey Privacy Choices with Icons and Link Texts",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-25",
  "year": 2021,
  "badges": [],
  "abstract": "Increasingly, icons are being proposed to concisely convey privacy-related information and choices to users. However, complex privacy concepts can be difficult to communicate. We investigate which icons effectively signal the presence of privacy choices. In a series of user studies, we designed and evaluated icons and accompanying textual descriptions (link texts) conveying choice, opting-out, and sale of personal information — the latter an opt-out mandated by the California Consumer Privacy Act (CCPA). We identified icon-link text pairings that conveyed the presence of privacy choices without creating misconceptions, with a blue stylized toggle icon paired with “Privacy Options” performing best. The two CCPA-mandated link texts (“Do Not Sell My Personal Information” and “Do Not Sell My Info”) accurately communicated the presence of do-not-sell opt-outs with most icons. Our results provide insights for the design of privacy choice indicators and highlight the necessity of incorporating user testing into policy making.",
  "authors": [
    {
      "name": "Hana Habib",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019881",
      "orcid": "0000-0003-3743-7858"
    },
    {
      "name": "Yixin Zou",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260611",
      "orcid": "missing"
    },
    {
      "name": "Yaxing Yao",
      "institution": "School of Computer Science Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659131392",
      "orcid": "missing"
    },
    {
      "name": "Alessandro Acquisti",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496675247",
      "orcid": "missing"
    },
    {
      "name": "Lorrie Cranor",
      "institution": "Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81100472223/rel-imgonly/lorrie-december2012-small.jpg",
      "acmid": "81100472223",
      "orcid": "0000-0003-2125-0124"
    },
    {
      "name": "Joel Reidenberg",
      "institution": "Fordham University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81546458856",
      "orcid": "missing"
    },
    {
      "name": "Norman Sadeh",
      "institution": "Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81100339054/rel-imgonly/n.sadeh.png",
      "acmid": "81100339054",
      "orcid": "missing"
    },
    {
      "name": "Florian Schaub",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548024188",
      "orcid": "0000-0003-1039-7155"
    }
  ],
  "references": [
    {
      "text": "Terence S Andre, H Rex Hartson, Steven M Belz, and Faith A McCreary. 2001. The User Action Framework: A Reliable Foundation for Usability Engineering Support Tools. International Journal of Human-Computer Studies 54, 1 (2001), 107–136. https://doi.org/10.1006/ijhc.2000.0441",
      "doi": "10.1006/ijhc.2000.0441"
    },
    {
      "text": "Annie I Antón, Julia Brande Earp, Qingfeng He, William Stufflebeam, Davide Bolchini, and Carlos Jensen. 2004. Financial Privacy Policies and the Need for Standardization. IEEE Security & privacy 2, 2 (2004), 36–45.",
      "doi": "10.1109/MSECP.2004.1281243"
    },
    {
      "text": "Apple Inc.2021. App privacy details on the App Store. https://developer.apple.com/app-store/app-privacy-details/.",
      "doi": ""
    },
    {
      "text": "Richard A Armstrong. 2014. When to Use the Bonferroni Correction. Ophthalmic and Physiological Optics 34, 5 (2014), 502–508. https://doi.org/10.1111/opo.12131",
      "doi": ""
    },
    {
      "text": "Babich, Nick. 2016. UX Design: Checkbox and Toggle in Forms. https://uxplanet.org/checkbox-and-toggle-in-forms-f0de6086ac41.",
      "doi": ""
    },
    {
      "text": "Rebecca Balebako, Richard Shay, and Lorrie Faith Cranor. 2014. Is Your Inseam a Biometric? A Case Study on the Role of Usability Studies in Developing Public Policy. In Workshop on Usable Security (USEC). Internet Society. https://doi.org/10.14722/usec.2014.23039",
      "doi": ""
    },
    {
      "text": "Vinayshekhar Bannihatti Kumar, Roger Iyengar, Namita Nisal, Yuanyuan Feng, Hana Habib, Peter Story, Sushain Cherivirala, Margaret Hagan, Lorrie Faith Cranor, Shomir Wilson, Florian Schaub, and Norman Sadeh. 2020. Finding a Choice in a Haystack: Automatic Extraction of Opt-Out Statements from Privacy Policy Text. In The Web Conference. ACM, 1943–1954. https://doi.org/10.1145/3366423.3380262",
      "doi": "10.1145/3366423.3380262"
    },
    {
      "text": "Nata M Barbosa, Joon S Park, Yaxing Yao, and Yang Wang. 2019. “What If?” Predicting Individual Users’ Smart Home Privacy Preferences and Their Changes. Proceedings on Privacy Enhancing Technologies (PoPETs) 2019, 4(2019), 211–231. https://doi.org/10.2478/popets-2019-0066",
      "doi": ""
    },
    {
      "text": "Paola Benassi. 1999. TRUSTe: An Online Privacy Seal Program. Commun. ACM 42, 2 (1999), 56–59. https://doi.org/10.1145/293411.293461",
      "doi": "10.1145/293411.293461"
    },
    {
      "text": "Adam J Berinsky, Gregory A Huber, and Gabriel S Lenz. 2012. Evaluating Online Labor Markets for Experimental Research: Amazon.com’s Mechanical Turk. Political Analysis 20, 3 (2012), 351–368. https://doi.org/10.1093/pan/mpr057",
      "doi": ""
    },
    {
      "text": "Jaspreet Bhatia, Travis D Breaux, Joel R Reidenberg, and Thomas B Norton. 2016. A Theory of Vagueness and Privacy Risk Perception. In Proceedings of the International Requirements Engineering Conference (RE). IEEE, 26–35. https://doi.org/10.1109/RE.2016.20",
      "doi": ""
    },
    {
      "text": "Daniel Bühler, Fabian Hemmert, and Jörn Hurtienne. 2020. Universal and Intuitive? Scientific Guidelines for Icon Design. In Conference on Mensch und Computer (MuC). ACM, 91–103. https://doi.org/10.1145/3404983.3405518",
      "doi": ""
    },
    {
      "text": "Michael Buhrmester, Tracy Kwang, and Samuel D Gosling. 2016. Amazon’s Mechanical Turk: A New Source of Inexpensive, Yet High-Quality Data?Methodological Issues and Strategies in Clinical Research (2016), 133–139. https://doi.org/10.1037/14805-009",
      "doi": ""
    },
    {
      "text": "Simon Byers, Lorrie Faith Cranor, Dave Kormann, and Patrick McDaniel. 2004. Searching for Privacy: Design and Implementation of a P3P-Enabled Search Engine. Privacy Enhancing Technologies (PET)(2004), 314–328. https://doi.org/10.1007/11423409_20",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 2013. Statistical Power Analysis for the Behavioral Sciences. Academic press.",
      "doi": ""
    },
    {
      "text": "Jessica Colnago, Yuanyuan Feng, Tharangini Palanivel, Sarah Pearman, Megan Ung, Alessandro Acquisti, Lorrie Faith Cranor, and Norman Sadeh. 2020. Informing the Design of a Personalized Privacy Assistant for the Internet of Things. In Conference on Human Factors in Computing Systems (CHI). ACM, Article 262, 13 pages. https://doi.org/10.1145/3313831.3376389",
      "doi": "10.1145/3313831.3376389"
    },
    {
      "text": "Claudia Coulton and Julian Chow. 1993. Interaction Effects in Multiple Regression. Journal of Social Service Research 16, 1-2 (1993), 179–199. https://doi.org/10.1300/J079v16n01_09",
      "doi": ""
    },
    {
      "text": "Lorrie Faith Cranor. 2012. Necessary But Not Sufficient: Standardized Mechanisms for Privacy Notice and Choice. Journal on on Telecomm. & High Tech. Law 10 (2012), 273.",
      "doi": ""
    },
    {
      "text": "Lorrie Faith Cranor, Hana Habib, Yaxing Yao, Yixin Zou, Alessandro Acquisti, Joel Reidenberg, Norman Sadeh, and Florian Schaub. 2020. CCPA Opt-Out Icon Testing – Phase 2. Technical Report. Office of the California Attorney General. https://www.oag.ca.gov/sites/all/files/agweb/pdfs/privacy/dns-icon-study-report-052822020.pdf.",
      "doi": ""
    },
    {
      "text": "Anupam Das, Martin Degeling, Daniel Smullen, and Norman Sadeh. 2018. Personalized Privacy Assistants for the Internet of Things: Providing Users with Notice and Choice. IEEE Pervasive Computing 17, 3 (2018), 35–46. https://doi.org/10.1109/MPRV.2018.03367733",
      "doi": "10.1109/MPRV.2018.03367733"
    },
    {
      "text": "Wendy Davis. 2016. Ad Industry Launches Campaign Promoting AdChoices Icon. https://www.mediapost.com/publications/article/270904/ad-industry-launches-campaign-promoting-adchoices.html.",
      "doi": ""
    },
    {
      "text": "Martin Degeling, Christine Utz, Christopher Lentzsch, Henry Hosseini, Florian Schaub, and Thorsten Holz. 2018. We Value Your Privacy...Now Take Some Cookies: Measuring the GDPR’s Impact on Web Privacy. In Network and Distributed Systems Security Symposium (NDSS). Internet Society. https://doi.org/10.14722/ndss.2019.23378",
      "doi": ""
    },
    {
      "text": "Jayati Dev, Emilee Rader, and Sameer Patil. 2020. Why Johnny Can’t Unsubscribe: Barriers to Stopping Unwanted Email. In Conference on Human Factors in Computing Systems (CHI). ACM, Article 38, 12 pages. https://doi.org/10.1145/3313831.3376165",
      "doi": ""
    },
    {
      "text": "Digital Advertising Alliance. 2009. Self-Regulatory Principles for Online Behavioral Advertising. http://digitaladvertisingalliance.org/principles.",
      "doi": ""
    },
    {
      "text": "Digital Advertising Alliance. 2012. Campaign Informs Consumers About Interest-Based Advertising And Encourages Them to Take Control of Their Online Privacy. https://digitaladvertisingalliance.org/press-release/digital-advertising-alliance-daa-announces-%E2%80%98your-adchoices%E2%80%99-consumer-education.",
      "doi": ""
    },
    {
      "text": "Digital Advertising Alliance. 2020. DAA Participating Companies & Organizations. https://youradchoices.com/participating.",
      "doi": ""
    },
    {
      "text": "Disconnect, Inc.2014. Disconnect Privacy Icons. https://github.com/disconnectme/privacy-icons.",
      "doi": ""
    },
    {
      "text": "Serge Egelman, Raghudeep Kannavara, and Richard Chow. 2015. Is This Thing On? Crowdsourcing Privacy Indicators for Ubiquitous Sensing Platforms. In Conference on Human Factors in Computing Systems (CHI). ACM, 1669–1678. https://doi.org/10.1145/2702123.2702251",
      "doi": "10.1145/2702123.2702251"
    },
    {
      "text": "Serge Egelman, Janice Tsai, Lorrie Faith Cranor, and Alessandro Acquisti. 2009. Timing is Everything? The Effects of Timing and Placement of Online Privacy Indicators. In Conference on Human Factors in Computing Systems (CHI). ACM, 319–328. https://doi.org/10.1145/1518701.1518752",
      "doi": "10.1145/1518701.1518752"
    },
    {
      "text": "Pardis Emami-Naeini, Yuvraj Agarwal, Lorrie Faith Cranor, and Hanan Hibshi. 2020. Ask the Experts: What Should Be on an IoT Privacy and Security Label?. In Symposium on Security and Privacy (S&P). IEEE, 771–788. https://doi.org/10.1109/sp40000.2020.00043",
      "doi": ""
    },
    {
      "text": "Pardis Emami-Naeini, Henry Dixon, Yuvraj Agarwal, and Lorrie Faith Cranor. 2019. Exploring How Privacy and Security Factor into IoT Device Purchase Behavior. In Conference on Human Factors in Computing Systems (CHI). ACM, Article 534, 12 pages. https://doi.org/10.1145/3290605.3300764",
      "doi": "10.1145/3290605.3300764"
    },
    {
      "text": "Samson Esayas, Tobias Mahler, and Kevin McGillivray. 2016. Is a Picture Worth a Thousand Terms? Visualising Contract Terms and Data Protection Requirements for Cloud Computing Users. In International Conference on Web Engineering (ICWE). Springer, 39–56. https://doi.org/10.1007/978-3-319-46963-8_4",
      "doi": ""
    },
    {
      "text": "European Parliament. 2016. Regulation (EU) 2016/679 of the European Parliament and of the Council. https://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32016R0679.",
      "doi": ""
    },
    {
      "text": "Benjamin Fabian, Tatiana Ermakova, and Tino Lentz. 2017. Large-Scale Readability Analysis of Privacy Policies. In International Conference on Web Intelligence (WI). ACM, 18–25. https://doi.org/10.1145/3106426.3106427",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2009. CAN-SPAM Act: A Compliance Guide for Business. https://www.ftc.gov/tips-advice/business-center/guidance/can-spam-act-compliance-guide-business.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2017. Children’s Online Privacy Protection Rule: A Six-Step Compliance Plan for Your Business. https://www.ftc.gov/tips-advice/business-center/guidance/childrens-online-privacy-protection-rule-six-step-compliance.",
      "doi": ""
    },
    {
      "text": "Adrienne Porter Felt, Robert W Reeder, Alex Ainslie, Helen Harris, Max Walker, Christopher Thompson, Mustafa Embre Acer, Elisabeth Morant, and Sunny Consolvo. 2016. Rethinking Connection Security Indicators. In Symposium on Usable Privacy and Security (SOUPS). USENIX, 1–14. https://www.usenix.org/system/files/conference/soups2016/soups2016-paper-porter-felt.pdf.",
      "doi": ""
    },
    {
      "text": "Simone Fischer-Hübner, Erik Wästlund, and Harald Zwingelberg. 2010. UI Prototypes: Policy Administration and Presentation–Version 1. (2010). http://primelife.ercim.eu/images/stories/deliverables/d4.3.1-ui_prototypes-policy_administration_and_presentation_v1.pdf.",
      "doi": ""
    },
    {
      "text": "Kim Flaherty. 2018. Top 10 Design Mistakes in the Unsubscribe Experience. https://www.nngroup.com/articles/unsubscribe-mistakes/.",
      "doi": ""
    },
    {
      "text": "Joseph L Fleiss, Bruce Levin, and Myunghee Cho Paik. 2013. Statistical Methods for Rates and Proportions. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Batya Friedman, David Hurley, Daniel C Howe, Edward Felten, and Helen Nissenbaum. 2002. Users’ Conceptions of Web Security: A Comparative Study. In Conference on Human Factors in Computing Systems (CHI): Extended Abstracts. ACM, 746–747. https://doi.org/10.1145/506443.506577",
      "doi": ""
    },
    {
      "text": "Stacia Garlach and Daniel Suthers. 2018. I’m Supposed to See That? AdChoices Usability in the Mobile Environment. In Hawaii International Conference on System Sciences (HICSS). Article 3779, 10 pages. https://doi.org/10.24251/hicss.2018.476",
      "doi": ""
    },
    {
      "text": "Loretta Garrison, Manoj Hastak, Jeanne M Hogarth, Susan Kleimann, and Alan S Levy. 2012. Designing Evidence-based Disclosures: A Case Study of Financial Privacy Notices. Journal of Consumer Affairs 46, 2 (2012), 204–234. https://doi.org/10.1111/j.1745-6606.2012.01226.x",
      "doi": ""
    },
    {
      "text": "Ghostery. 2017. Ghostery: Online Privacy Made Easy. https://www.ghostery.com.",
      "doi": ""
    },
    {
      "text": "Julia Gideon, Lorrie Faith Cranor, Serge Egelman, and Alessandro Acquisti. 2006. Power Strips, Prophylactics, and Privacy, Oh My!. In Symposium on Usable privacy and security (SOUPS). ACM, 133–144. https://doi.org/10.1145/1143120.1143137",
      "doi": "10.1145/1143120.1143137"
    },
    {
      "text": "Global Privacy Enforcement Network. 2017. User Controls Over Personal information. http://www.astrid-online.it/static/upload/2017/2017-gpen-sweep---international-report1.pdf.",
      "doi": ""
    },
    {
      "text": "Hana Habib, Sarah Pearman, Jiamin Wang, Yixin Zou, Alessandro Acquisti, Lorrie Faith Cranor, Norman Sadeh, and Florian Schaub. 2020. “It’s a Scavenger Hunt”: Usability of Websites’ Opt-Out and Data Deletion Choices. In Conference on Human Factors in Computing Systems (CHI). ACM, Article 384, 12 pages. https://doi.org/10.1145/3313831.3376511",
      "doi": ""
    },
    {
      "text": "Hana Habib, Yixin Zou, Aditi Jannu, Neha Sridhar, Chelse Swoopes, Alessandro Acquisti, Lorrie Faith Cranor, Norman Sadeh, and Florian Schaub. 2019. An Empirical Analysis of Data Deletion and Opt-out Choices on 150 Websites. In Symposium on Usable Privacy and Security (SOUPS). USENIX, 387–406. https://www.usenix.org/system/files/soups2019-habib.pdf.",
      "doi": ""
    },
    {
      "text": "Hamza Harkous, Kassem Fawaz, Rémi Lebret, Florian Schaub, Kang G. Shin, and Karl Aberer. 2018. Polisis: Automated Analysis and Presentation of Privacy Policies Using Deep Learning. In USENIX Security Symposium. 531–548. https://www.usenix.org/system/files/conference/usenixsecurity18/sec18-harkous.pdf",
      "doi": ""
    },
    {
      "text": "Leif-Erik Holtz, Katharina Nocun, and Marit Hansen. 2010. Towards Displaying Privacy Information with Icons. In Privacy and Identity Management for Life. Springer, 338–348. https://doi.org/10.1007/978-3-642-20769-3_27",
      "doi": ""
    },
    {
      "text": "William K Horton. 1994. The Icon Book: Visual Symbols for Computer Systems and Documentation. John Wiley & Sons, Inc.",
      "doi": ""
    },
    {
      "text": "Connor Huff and Dustin Tingley. 2015. “Who Are These People?” Evaluating the Demographic Characteristics and Political Preferences of MTurk Survey Respondents. Research & Politics 2, 3 (2015). https://doi.org/10.1177/2053168015604648",
      "doi": ""
    },
    {
      "text": "IAB Europe. 2011. IAB EU Framework for Online Behavioural Advertising. https://www.edaa.eu/wp-content/uploads/2012/10/2013-11-11-IAB-Europe-OBA-Framework_.pdf.",
      "doi": ""
    },
    {
      "text": "IAB Europe. 2019. GDPR Transparency and Consent Framework. https://iabtechlab.com/standards/gdpr-transparency-and-consent-framework/.",
      "doi": ""
    },
    {
      "text": "Renato Iannella and Adam Finden. 2010. Privacy Awareness: Icons and Expression for Social Networks. In International Workshop for Technical, Economic and Legal Aspects of Business Models for Virtual Goods. Article 1, 15 pages. http://virtualgoods.org/2010/VirtualGoodsBook2010_13.pdf.",
      "doi": ""
    },
    {
      "text": "Information Commissioner’s Office. 2019. Guide to the General Data Protection Regulation (GDPR). https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/.",
      "doi": ""
    },
    {
      "text": "Information Commissioner’s Office. 2019. What is valid consent?https://ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/consent/what-is-valid-consent/.",
      "doi": ""
    },
    {
      "text": "Sarah J Isherwood, Siné JP McDougall, and Martin B Curry. 2007. Icon Identification in Context: The Changing Role of Icon Characteristics with User Experience. Human Factors 49, 3 (2007), 465–476. https://doi.org/10.1518/001872007X200102",
      "doi": ""
    },
    {
      "text": "Carlos Jensen and Colin Potts. 2004. Privacy Policies as Decision-Making Tools: An Evaluation of Online Privacy Notices. In Conference on Human Factors in Computing Systems (CHI). ACM, 471–478. https://doi.org/10.1145/985692.985752",
      "doi": "10.1145/985692.985752"
    },
    {
      "text": "Penny Jones and Jerry Powell. 1999. Gary Anderson Has Been Found!Resource Recycling 18(1999), 25–27. https://discardstudies.com/wp-content/uploads/2012/07/garyandersonfound.pdf.",
      "doi": ""
    },
    {
      "text": "Michiel de Jong, Jan-Christoph Borchardt, Hugo Roy, Ian McGowan, Jimm Stout, Suzanne Azmayesh, Christopher Talib, Vincent Tunru, Madeline O’Leary, and Evan Mullen. 2020. Terms of Service; Didn’t Read. https://tosdr.org/en/frontpage.",
      "doi": ""
    },
    {
      "text": "Saraschandra Karanam, Janhavi Viswanathan, Anand Theertha, Bipin Indurkhya, and Herre Van Oostendorp. 2010. Impact of Placing Icons Next to Hyperlinks on Information-Retrieval Tasks on the Web. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 32. eScholarship, 2834–2839. https://escholarship.org/content/qt27w0n9kc/qt27w0n9kc.pdf.",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Joanna Bresee, Lorrie Faith Cranor, and Robert W Reeder. 2009. A “Nutrition Label” for Privacy. In Symposium on Usable Privacy and Security (SOUPS). Article 4, 12 pages. https://doi.org/10.1145/1572532.1572538",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Lucian Cesca, Joanna Bresee, and Lorrie Faith Cranor. 2010. Standardizing Privacy Notices: An Online Study of the Nutrition Label Approach. In Conference on Human factors in Computing Systems (CHI). ACM, 1573–1582. https://doi.org/10.1145/1753326.1753561",
      "doi": "10.1145/1753326.1753561"
    },
    {
      "text": "Patrick Gage Kelley, Lorrie Faith Cranor, and Norman Sadeh. 2013. Privacy as Part of the App Decision-Making Process. In Conference on Human Factors in Computing Systems (CHI). ACM, 3393–3402. https://doi.org/10.1145/2470654.2466466",
      "doi": "10.1145/2470654.2466466"
    },
    {
      "text": "Jennifer King. 2020. CCPA Comments, Round Two: The Battle of the Do-Not-Sell Button. https://cyberlaw.stanford.edu/blog/2020/02/ccpa-comments-round-two-battle-do-not-sell-button.",
      "doi": ""
    },
    {
      "text": "Saranga Komanduri, Richard Shay, Greg Norcie, and Blase Ur. 2011. AdChoices? Compliance with Online Behavioral Advertising Notice and Choice Requirements. ISJLP 7(2011), 603.",
      "doi": ""
    },
    {
      "text": "Stefan Korff and Rainer Böhme. 2014. Too Much Choice: End-user Privacy Decisions in the Context of Choice Proliferation. In Symposium On Usable Privacy and Security (SOUPS). USENIX, 69–87. https://www.usenix.org/system/files/soups14-paper-korff.pdf.",
      "doi": ""
    },
    {
      "text": "Lauren I Labrecque, Ereni Markos, and Aron Darmody. 2019. Addressing Online Behavioral Advertising and Privacy Implications: A Comparison of Passive Versus Active Learning Approaches. Journal of Marketing Education(2019), 1–16. https://doi.org/10.1177/0273475319828788",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research Methods in Human-Computer Interaction. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Pedro Giovanni Leon, Justin Cranshaw, Lorrie Faith Cranor, Jim Graves, Manoj Hastak, Blase Ur, and Guzi Xu. 2012. What Do Online Behavioral Advertising Privacy Disclosures Communicate to Users?. In Workshop on Privacy in the Electronic Society (WPES). ACM, 19–30. https://doi.org/10.1145/2381966.2381970",
      "doi": "10.1145/2381966.2381970"
    },
    {
      "text": "Eric Lin, Saul Greenberg, Eileah Trotter, David Ma, and John Aycock. 2011. Does Domain Highlighting Help People Identify Phishing Sites?. In Conference on Human Factors in Computing Systems (CHI). ACM, 2075–2084. https://doi.org/10.1145/1978942.1979244",
      "doi": "10.1145/1978942.1979244"
    },
    {
      "text": "Bin Liu, Mads Schaarup Andersen, Florian Schaub, Hazim Almuhimedi, Shikun Aerin Zhang, Norman Sadeh, Yuvraj Agarwal, and Alessandro Acquisti. 2016. Follow My Recommendations: A Personalized Privacy Assistant for Mobile App Permissions. In Symposium on Usable Privacy and Security (SOUPS). USENIX, 27–41. https://www.usenix.org/system/files/conference/soups2016/soups2016-paper-liu.pdf.",
      "doi": ""
    },
    {
      "text": "Dominique Machuletz and Rainer Böhme. 2020. Multiple Purposes, Multiple Problems: A User Study of Consent Dialogs after GDPR. Proceedings on Privacy Enhancing Technologies (PoPETs) 2020, 2(2020), 481–498. https://doi.org/10.2478/popets-2020-0037",
      "doi": ""
    },
    {
      "text": "Maureen Mahoney. 2020. California Consumer Privacy Act: Are Consumers’ Digital Rights Protected?Technical Report. Consumer Reports. https://advocacy.consumerreports.org/wp-content/uploads/2020/09/CR_CCPA-Are-Consumers-Digital-Rights-Protected_092020_vf.pdf.",
      "doi": ""
    },
    {
      "text": "Manfredo Massironi. 2001. The Psychology of Graphic Images: Seeing, Drawing, Communicating. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Aleecia M McDonald and Lorrie Faith Cranor. 2008. The Cost of Reading Privacy Policies. I/S: A Journal of Law and Policy for the Information Society 4 (2008), 543.",
      "doi": ""
    },
    {
      "text": "Aleecia M McDonald and Lorrie Faith Cranor. 2010. Americans’ Attitudes about Internet Behavioral Advertising Practices. In Workshop on Privacy in the Electronic Society (WPES). ACM, 63–72. https://doi.org/10.1145/1866919.1866929",
      "doi": ""
    },
    {
      "text": "Aleecia M Mcdonald, Robert W Reeder, Patrick Gage Kelley, and Lorrie Faith Cranor. 2009. A Comparative Study of Online Privacy Policies and Formats. Proceedings on Privacy Enhancing Technologies (PoPETs) (2009), 37–55. https://doi.org/10.1007/978-3-642-03168-7_3",
      "doi": "10.1007/978-3-642-03168-7_3"
    },
    {
      "text": "George R Milne and Mary J Culnan. 2004. Strategies for Reducing Online Privacy Risks: Why Consumers Read (Or Don’t Read) Online Privacy Notices. Journal of Interactive Marketing 18, 3 (2004), 15–29.",
      "doi": ""
    },
    {
      "text": "Mozilla. 2020. Privacy Icons. https://wiki.mozilla.org/Privacy_Icons.",
      "doi": ""
    },
    {
      "text": "Network Advertising Initiative. 2018. NAI Code of Conduct. https://www.networkadvertising.org/sites/default/files/nai_code2018.pdf.",
      "doi": ""
    },
    {
      "text": "Don Norman. 2013. The Design of Everyday Things. Basic books.",
      "doi": ""
    },
    {
      "text": "Midas Nouwens, Ilaria Liccardi, Michael Veale, David Karger, and Lalana Kagal. 2020. Dark Patterns after the GDPR: Scraping Consent Pop-Ups and Demonstrating Their Influence. In Conference on Human Factors in Computing Systems (CHI). ACM, Article 194, 13 pages. https://doi.org/10.1145/3313831.3376321",
      "doi": "10.1145/3313831.3376321"
    },
    {
      "text": "Maggie Oates, Yama Ahmadullah, Abigail Marsh, Chelse Swoopes, Shikun Zhang, Rebecca Balebako, and Lorrie Faith Cranor. 2018. Turtles, Locks, and Bathrooms: Understanding Mental Models of Privacy through Illustration. Proceedings on Privacy Enhancing Technologies (PoPETs) 2018, 4(2018), 5–32. https://doi.org/10.1515/popets-2018-0029",
      "doi": ""
    },
    {
      "text": "Jonathan A Obar and Anne Oeldorf-Hirsch. 2020. The Biggest Lie on the Internet: Ignoring the Privacy Policies and Terms of Service Policies of Social Networking Services. Information, Communication & Society 23, 1 (2020), 128–147. https://doi.org/10.1080/1369118X.2018.1486870",
      "doi": ""
    },
    {
      "text": "Sean O’Connor, Ryan Nurwono, and Eleanor Birrell. 2020. (Un)clear and (In)conspicuous: The right to opt-out of sale under CCPA. arXiv preprint:2009.07884(2020).",
      "doi": ""
    },
    {
      "text": "Office of the California Attorney General. 2019. California Consumer Privacy Act (CCPA): Proposed Text of Regulations. https://www.oag.ca.gov/sites/all/files/agweb/pdfs/privacy/ccpa-proposed-regs.pdf.",
      "doi": ""
    },
    {
      "text": "Office of the California Attorney General. 2019. The California Privacy Rights and Enforcement Act of 2020. https://oag.ca.gov/system/files/initiatives/pdfs/19-0017%20%28Consumer%20Privacy%20%29.pdf.",
      "doi": ""
    },
    {
      "text": "Office of the California Attorney General. 2020. California Consumer Privacy Act (CCPA): Final Text of Proposed Regulations. https://oag.ca.gov/sites/all/files/agweb/pdfs/privacy/oal-sub-final-text-of-regs.pdf.",
      "doi": ""
    },
    {
      "text": "Office of the California Attorney General. 2020. California Consumer Privacy Act (CCPA): First Set of Modified Regulations. https://oag.ca.gov/sites/all/files/agweb/pdfs/privacy/ccpa-text-of-mod-clean-020720.pdf.",
      "doi": ""
    },
    {
      "text": "Office of the California Attorney General. 2020. California Consumer Privacy Act (CCPA): Fourth Set of Modified Regulations. https://oag.ca.gov/sites/all/files/agweb/pdfs/privacy/ccpa-prop-mods-text-of-regs-4th.pdf.",
      "doi": ""
    },
    {
      "text": "Office of the California Attorney General. 2021. California Consumer Privacy Act (CCPA) Current Rulemaking Activities. https://oag.ca.gov/privacy/ccpa/regs.",
      "doi": ""
    },
    {
      "text": "Online Trust Alliance. 2018. Email Marketing & Unsubscribe Audit. https://www.internetsociety.org/wp-content/uploads/2019/04/2018-email-unsubscribe-report.pdf.",
      "doi": ""
    },
    {
      "text": "Stefania Passera. 2015. Beyond the Wall of Text: How Information Design Can Make Contracts User-Friendly. In International Conference of Design, User Experience, and Usability (DUXU). Springer, 341–352. https://doi.org/10.1007/978-3-319-20898-5_33",
      "doi": ""
    },
    {
      "text": "Peter Peduzzi, John Concato, Elizabeth Kemper, Theodore R Holford, and Alvan R Feinstein. 1996. A Simulation Study of the Number of Events per Variable in Logistic Regression Analysis. Journal of Clinical Epidemiology 49, 12 (1996), 1373–1379. https://doi.org/10.1016/S0895-4356(96)00236-3",
      "doi": ""
    },
    {
      "text": "Rebecca S Portnoff, Linda N Lee, Serge Egelman, Pratyush Mishra, Derek Leung, and David Wagner. 2015. Somebody’s Watching me? Assessing the Effectiveness of Webcam Indicator Lights. In Conference on Human Factors in Computing Systems (CHI). ACM, 1649–1658. https://doi.org/10.1145/2702123.2702164",
      "doi": "10.1145/2702123.2702164"
    },
    {
      "text": "PrivacyGrade.org. 2020. PrivacyGrade.org. http://privacygrade.org/home.",
      "doi": ""
    },
    {
      "text": "Elissa M Redmiles, Sean Kross, and Michelle L Mazurek. 2019. How Well Do My Results Generalize? Comparing Security and Privacy Survey Results from MTurk, Web, and Telephone Samples. In Symposium on Security and Privacy (S&P). IEEE, 1326–1343. https://doi.org/10.1109/SP.2019.00014",
      "doi": ""
    },
    {
      "text": "Joel R Reidenberg, Travis Breaux, Lorrie Faith Cranor, Brian French, Amanda Grannis, James T Graves, Fei Liu, Aleecia McDonald, Thomas B Norton, and Rohan Ramanath. 2015. Disagreeable Privacy Policies: Mismatches Between Meaning and Users’ Understanding. Berkeley Technology Law Journal 30 (2015), 39. https://doi.org/10.15779/Z384K33",
      "doi": ""
    },
    {
      "text": "Joel R Reidenberg, N Cameron Russell, Vlad Herta, William Sierra-Rocafort, and Thomas B Norton. 2018. Trustworthy Privacy Indicators: Grades, Labels, Certifications, and Dashboards. Washington University Law Review 96, Article 1409(2018).",
      "doi": ""
    },
    {
      "text": "Arianna Rossi and Monica Palmirani. 2019. DaPIS: a Data Protection Icon Set to Improve Information Transparency under the GDPR. Knowledge of the Law in the Big Data Age 252 (2019), 181–195.",
      "doi": ""
    },
    {
      "text": "Jeffrey N Rouder, Christopher R Engelhardt, Simon McCabe, and Richard D Morey. 2016. Model Comparison in ANOVA. Psychonomic Bulletin & Review 23, 6 (2016), 1779–1786. https://doi.org/10.3758/s13423-016-1026-5",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2015. The Coding Manual for Qualitative Researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, Adam L. Durity, and Lorrie Faith Cranor. 2015. A Design Space for Effective Privacy Notices. In Symposium On Usable Privacy and Security (SOUPS). USENIX, Article 1, 17 pages. https://www.usenix.org/system/files/conference/soups2015/soups15-paper-schaub.pdf.",
      "doi": ""
    },
    {
      "text": "Florian Schaub and Lorrie Faith Cranor. 2020. Usable and Useful Privacy Interfaces. In An Introduction to Privacy for Technology Professionals, Travis Breaux (Ed.). IAPP, 176–299.",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Aditya Marella, Pranshu Kalvani, Blase Ur, Chao Pan, Emily Forney, and Lorrie Faith Cranor. 2017. Watching Them Watching Me: Browser Extensions’ Impact on User Privacy Awareness and Concern. In Workshop on Usable Security and Privacy (USEC). Internet Society. https://doi.org/10.14722/usec.2016.23017",
      "doi": ""
    },
    {
      "text": "Stuart E Schechter, Rachna Dhamija, Andy Ozment, and Ian Fischer. 2007. The Emperor’s New Security Indicators. In Symposium on Security and Privacy (S&P). IEEE, 51–65. https://doi.org/10.1109/SP.2007.35",
      "doi": ""
    },
    {
      "text": "Kristina L Schmid, Susan E Rivers, Amy E Latimer, and Peter Salovey. 2008. Targeting or Tailoring? Maximizing Resources to Create Effective Health Communications. Marketing Health Services 28, 1 (2008), 32.",
      "doi": ""
    },
    {
      "text": "Johanna M Silvennoinen, Tuomo Kujala, and Jussi PP Jokinen. 2017. Semantic Distance as A Critical Factor in Icon Design for In-Car Infotainment Systems. Applied Ergonomics 65(2017), 369–381. https://doi.org/10.1016/j.apergo.2017.07.014",
      "doi": ""
    },
    {
      "text": "Stanford Legal Design Lab. 2020. Icons for legal help. https://betterinternet.law.stanford.edu/design-guide/icons-for-legal-help/.",
      "doi": ""
    },
    {
      "text": "The Digital Advertising Alliance. 2020. License the Privacy Rights Icon. https://digitaladvertisingalliance.org/license-pricon.",
      "doi": ""
    },
    {
      "text": "The Digital Advertising Alliance. 2020. Your AdChoices. https://youradchoices.com/.",
      "doi": ""
    },
    {
      "text": "The Federal Trade Commission. 2012. Protecting Consumer Privacy in an Era of Rapid Change: A Proposed Framework for Businesses and Policymakers. https://www.ftc.gov/sites/default/files/documents/reports/federal-trade-commission-report-protecting-consumer-privacy-era-rapid-change-recommendations/120326privacyreport.pdf.",
      "doi": ""
    },
    {
      "text": "The Federal Trade Commission. 2013. .com Disclosures: How to Make Effective Disclosures in Digital Advertising. https://www.ftc.gov/sites/default/files/attachments/press-releases/ftc-staff-revises-online-advertising-disclosure-guidelines/130312dotcomdisclosures.pdf.",
      "doi": ""
    },
    {
      "text": "TrustArc. 2013. EDAA rolls out pan-European consumer education campaign on OBA. https://trustarc.com/blog/2013/06/13/edaa-rolls-out-pan-european-consumer-education-campaign-on-oba/.",
      "doi": ""
    },
    {
      "text": "Janice Y Tsai, Serge Egelman, Lorrie Faith Cranor, and Alessandro Acquisti. 2011. The Effect of Online Privacy Information on Purchasing Behavior: An Experimental Study. Information Systems Research 22, 2 (2011), 254–268. https://doi.org/10.1287/isre.1090.0260",
      "doi": "10.1287/isre.1090.0260"
    },
    {
      "text": "Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Smart, Useful, Scary, Creepy: Perceptions of Online Behavioral Advertising. In Symposium on Usable Privacy and Security (SOUPS). ACM, Article 4, 15 pages. https://doi.org/10.1145/2335356.2335362",
      "doi": ""
    },
    {
      "text": "Christine Utz, Martin Degeling, Sascha Fahl, Florian Schaub, and Thorsten Holz. 2019. (Un)informed Consent: Studying GDPR Consent Notices in the Field. In Conference on Computer and Communications Security (CCS). ACM, 973–990. https://doi.org/10.1145/3319535.3354212",
      "doi": "10.1145/3319535.3354212"
    },
    {
      "text": "Ari Ezra Waldman. 2018. Privacy, Notice, and Design. Stanford Technology Law Review 21 (2018), 74.",
      "doi": ""
    },
    {
      "text": "Logan Warberg, Alessandro Acquisti, and Douglas Sicker. 2019. Can Privacy Nudges be Tailored to Individuals’ Decision Making and Personality Traits?. In Workshop on Privacy in the Electronic Society (WPES). ACM, 175–197. https://doi.org/10.1145/3338498.3358656",
      "doi": "10.1145/3338498.3358656"
    },
    {
      "text": "Susan Wiedenbeck. 1999. The Use of Icons and Labels in an End User Application Program: an Empirical Study of Learning and Retention. Behaviour & Information Technology 18, 2 (1999), 68–82. https://doi.org/10.1080/014492999119129",
      "doi": ""
    },
    {
      "text": "Shomir Wilson, Florian Schaub, Frederick Liu, Kanthashree Mysore Sathyendra, Daniel Smullen, Sebastian Zimmeck, Rohan Ramanath, Peter Story, Fei Liu, Norman Sadeh, and Noah A Smith. 2018. Analyzing Privacy Policies at Scale: From Crowdsourcing to Automated Annotations. ACM Transactions on the Web (TWEB) 13, Article 1 (2018). https://doi.org/10.1145/3230665",
      "doi": ""
    }
  ]
}