{
  "doi": "10.1145/3411764.3445515",
  "title": "Streaming VR Games to the Broad Audience: A Comparison of the First-Person and Third-Person Perspectives",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "The spectatorship experience for virtual reality (VR) games differs strongly from its non-VR precursor. When watching non-VR games on platforms such as Twitch, spectators just see what the player sees, as the physical interaction is mostly unimportant for the overall impression. In VR, the immersive full-body interaction is a crucial part of the player experience. Hence, content creators, such as streamers, often rely on green screens or similar solutions to offer a mixed-reality third-person view to disclose their full-body actions. Our work compares the most popular realizations of the first-person and the third-person perspective in an online survey (N = 217) with three different VR games. Contrary to the current trend to stream in third-person, our key result is that most viewers prefer the first-person version, which they attribute mostly to the better focus on in-game actions and higher involvement. Based on the study insights, we provide design recommendations for both perspectives.",
  "tags": [
    "streaming",
    "first-person",
    "games",
    "third-person",
    "virtual reality",
    "spectator",
    "perspective"
  ],
  "authors": [
    {
      "name": "Katharina Emmerich",
      "institution": "COVIDAG University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81551044556",
      "orcid": "0000-0002-3198-6373"
    },
    {
      "name": "Andrey Krekhov",
      "institution": "COVIDAG University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658760231",
      "orcid": "missing"
    },
    {
      "name": "Sebastian Cmentowski",
      "institution": "COVIDAG University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659210449",
      "orcid": "0000-0003-4555-6187"
    },
    {
      "name": "Jens Krueger",
      "institution": "COVIDAG University of Duisburg-Essen, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660595431",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Amazon.com, Inc.2020. Twitch. Website. Retrieved April 16, 2020 from https://twitch.tv/.",
      "doi": ""
    },
    {
      "text": "Beat Games. 2019. Beat Saber. VR Game [Windows]. Beat Games, Prague, Czech Republic. Last played February 2020.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Christian Carlsson and Alex Pelling. 2015. Designing Spectator Interfaces for Competitive Video Games. Ph.D. Dissertation. Master’s thesis, Report.",
      "doi": ""
    },
    {
      "text": "Meeyoung Cha, Haewoon Kwak, Pablo Rodriguez, Yong-Yeol Ahn, and Sue Moon. 2007. I Tube, You Tube, Everybody Tubes: Analyzing the World’s Largest User Generated Content Video System. In Proceedings of the 7th ACM SIGCOMM Conference on Internet Measurement (San Diego, California, USA) (IMC ’07). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/1298306.1298309",
      "doi": "10.1145/1298306.1298309"
    },
    {
      "text": "Gifford Cheung and Jeff Huang. 2011. Starcraft from the Stands: Understanding the Game Spectator. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 763–772. https://doi.org/10.1145/1978942.1979053",
      "doi": "10.1145/1978942.1979053"
    },
    {
      "text": "Sebastian Cmentowski, Andrey Krekhov, and Jens Krüger. 2019. Outstanding: A Multi-Perspective Travel Approach for Virtual Reality Games. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Barcelona, Spain) (CHI PLAY ’19). Association for Computing Machinery, New York, NY, USA, 287–299. https://doi.org/10.1145/3311350.3347183",
      "doi": "10.1145/3311350.3347183"
    },
    {
      "text": "Dan Cryan. 2014. eSports video: A cross platform growth story. Technical Report. Technical report, IHS Tech.",
      "doi": ""
    },
    {
      "text": "Alena Denisova and Paul Cairns. 2015. First Person vs. Third Person Perspective in Digital Games: Do Player Preferences Affect Immersion?. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 145–148. https://doi.org/10.1145/2702123.2702256",
      "doi": "10.1145/2702123.2702256"
    },
    {
      "text": "John Downs, Frank Vetere, Steve Howard, Steve Loughnan, and Wally Smith. 2014. Audience Experience in Social Videogaming: Effects of Turn Expectation and Game Physicality. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3473–3482. https://doi.org/10.1145/2556288.2556965",
      "doi": "10.1145/2556288.2556965"
    },
    {
      "text": "Steven Drucker, Li-wei He, Michael Cohen, Curtis Wong, and Anoop Gupta. 2003. Spectator Games: A New Entertainment Modality For Networked Multiplayer Games. Technical Report MSR-TR-2003-105. Microsoft Research. https://www.microsoft.com/en-us/research/publication/spectator-games-a-new-entertainment-modality-for-networked-multiplayer-games/",
      "doi": ""
    },
    {
      "text": "Katharina Emmerich. 2019. Investigating the Social Player Experience: Social Effects in Digital Games. Ph.D. Dissertation. University of Duisburg-Essen, Duisburg, Germany.",
      "doi": ""
    },
    {
      "text": "Jonathan Frome and Aaron Smuts. 2004. Helpless spectators: Generating suspense in videogames and film. TEXT technology 13(2004), 13–34.",
      "doi": ""
    },
    {
      "text": "René Glas. 2015. Vicarious play: Engaging the viewer in Let’s Play videos. Empedocles: European Journal for the Philosophy of Communication 5, 1-2(2015), 81–86.",
      "doi": ""
    },
    {
      "text": "Geoffrey Gorisse, Olivier Christmann, Etienne Armand Amato, and Simon Richir. 2017. First-and Third-Person Perspectives in immersive Virtual environments: Presence and Performance analysis of embodied Users. Frontiers in Robotics and AI 4 (2017), 33.",
      "doi": ""
    },
    {
      "text": "Jan Gugenheimer, Evgeny Stemasov, Julian Frommel, and Enrico Rukzio. 2017. ShareVR: Enabling Co-Located Experiences for Virtual Reality between HMD and Non-HMD Users. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 4021–4033. https://doi.org/10.1145/3025453.3025683",
      "doi": "10.1145/3025453.3025683"
    },
    {
      "text": "Juho Hamari and Max Sjöblom. 2017. What is eSports and why do people watch it?Internet research 27, 2 (2017), 34.",
      "doi": ""
    },
    {
      "text": "William A. Hamilton, Oliver Garretson, and Andruid Kerne. 2014. Streaming on Twitch: Fostering Participatory Communities of Play within Live Mixed Media. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1315–1324. https://doi.org/10.1145/2556288.2557048",
      "doi": "10.1145/2556288.2557048"
    },
    {
      "text": "Jeremy Hartmann, Christian Holz, Eyal Ofek, and Andrew D. Wilson. 2019. RealityCheck: Blending Virtual Environments with Situated Physical Reality. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 347, 12 pages. https://doi.org/10.1145/3290605.3300577",
      "doi": "10.1145/3290605.3300577"
    },
    {
      "text": "Brett Jones, Rajinder Sodhi, Michael Murdock, Ravish Mehra, Hrvoje Benko, Andrew Wilson, Eyal Ofek, Blair MacIntyre, Nikunj Raghuvanshi, and Lior Shapira. 2014. RoomAlive: Magical Experiences Enabled by Scalable, Adaptive Projector-Camera Units. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 637–644. https://doi.org/10.1145/2642918.2647383",
      "doi": "10.1145/2642918.2647383"
    },
    {
      "text": "Dennis L. Kappen, Pejman Mirza-Babaei, Jens Johannsmeier, Daniel Buckstein, James Robb, and Lennart E. Nacke. 2014. Engaged by Boos and Cheers: The Effect of Co-Located Game Audiences on Social Player Experience. In Proceedings of the First ACM SIGCHI Annual Symposium on Computer-Human Interaction in Play (Toronto, Ontario, Canada) (CHI PLAY ’14). Association for Computing Machinery, New York, NY, USA, 151–160. https://doi.org/10.1145/2658537.2658687",
      "doi": "10.1145/2658537.2658687"
    },
    {
      "text": "Elihu Katz, Jay G Blumler, and Michael Gurevitch. 1973. Uses and gratifications research. The public opinion quarterly 37, 4 (1973), 509–523.",
      "doi": ""
    },
    {
      "text": "Elihu Katz, Hadassah Haas, and Michael Gurevitch. 1973. On the use of the mass media for important things. American sociological review 38, 2 (1973), 164–181.",
      "doi": ""
    },
    {
      "text": "Mehdi Kaytoue, Arlei Silva, Loïc Cerf, Wagner Meira, and Chedy Raïssi. 2012. Watch Me Playing, i Am a Professional: A First Study on Video Game Live Streaming. In Proceedings of the 21st International Conference on World Wide Web (Lyon, France) (WWW ’12 Companion). Association for Computing Machinery, New York, NY, USA, 1181–1188. https://doi.org/10.1145/2187980.2188259",
      "doi": "10.1145/2187980.2188259"
    },
    {
      "text": "Andrey Krekhov, Daniel Preuß, Sebastian Cmentowski, and Jens Krüger. 2020. Silhouette Games: An Interactive One-Way Mirror Approach to Watching Players in VR. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play (Virtual Event, Canada) (CHI PLAY ’20). Association for Computing Machinery, New York, NY, USA, 561–571. https://doi.org/10.1145/3410404.3414247",
      "doi": "10.1145/3410404.3414247"
    },
    {
      "text": "Donghun Lee and Linda J Schoenstedt. 2011. Comparison of eSports and traditional sports consumption motives.ICHPER-SD Journal Of Research 6, 2 (2011), 39–44.",
      "doi": ""
    },
    {
      "text": "LIV Inc. 2019. LIV. Software [Windows]. LIV Inc, Prague, Czech Republic. Last used February 2020.",
      "doi": ""
    },
    {
      "text": "Bernhard Maurer, Ilhan Aslan, Martin Wuchse, Katja Neureiter, and Manfred Tscheligi. 2015. Gaze-Based Onlooker Integration: Exploring the In-Between of Active Player and Passive Spectator in Co-Located Gaming. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom) (CHI PLAY ’15). Association for Computing Machinery, New York, NY, USA, 163–173. https://doi.org/10.1145/2793107.2793126",
      "doi": "10.1145/2793107.2793126"
    },
    {
      "text": "Karine Pires and Gwendal Simon. 2015. YouTube Live and Twitch: A Tour of User-Generated Live Streaming Systems. In Proceedings of the 6th ACM Multimedia Systems Conference (Portland, Oregon) (MMSys ’15). Association for Computing Machinery, New York, NY, USA, 225–230. https://doi.org/10.1145/2713168.2713195",
      "doi": "10.1145/2713168.2713195"
    },
    {
      "text": "Jana Rambusch, Anna-Sofia Alklind Taylor, and Tarja Susi. 2017. A pre-study on spectatorship in eSports. In Spectating Play 13th Annual Game Research Lab Spring Seminar, Tampere, Finland, April 24-25, 2017. DiVA, Sweden, 9.",
      "doi": ""
    },
    {
      "text": "Raptor Lab. 2019. Stand Out: VR Battle Royale. VR Game [Windows]. Raptor Lab, Lyon, France. Last played February 2020.",
      "doi": ""
    },
    {
      "text": "Stuart Reeves, Steve Benford, Claire O’Malley, and Mike Fraser. 2005. Designing the Spectator Experience. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Portland, Oregon, USA) (CHI ’05). Association for Computing Machinery, New York, NY, USA, 741–750. https://doi.org/10.1145/1054972.1055074",
      "doi": "10.1145/1054972.1055074"
    },
    {
      "text": "Alan M Rubin. 2009. Uses-and-gratifications perspective on media effects. In Media effects. Routledge, New York, NY, USA, 181–200.",
      "doi": ""
    },
    {
      "text": "Thomas E Ruggiero. 2000. Uses and gratifications theory in the 21st century. Mass communication & society 3, 1 (2000), 3–37.",
      "doi": ""
    },
    {
      "text": "Richard M Ryan and Edward L Deci. 2000. Self-determination theory and the facilitation of intrinsic motivation, social development, and well-being.American psychologist 55, 1 (2000), 68.",
      "doi": ""
    },
    {
      "text": "Patrick Salamin, Daniel Thalmann, and Frédéric Vexo. 2006. The Benefits of Third-Person Perspective in Virtual and Augmented Reality?. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (Limassol, Cyprus) (VRST ’06). Association for Computing Machinery, New York, NY, USA, 27–30. https://doi.org/10.1145/1180495.1180502",
      "doi": "10.1145/1180495.1180502"
    },
    {
      "text": "Sanzaru Games. 2019. Asgard’s Wrath. VR Game [Oculus]. Oculus Studios, Menlo Park, California, US. Last played March 2020.",
      "doi": ""
    },
    {
      "text": "Andrew Shaw. 2014. E-Sport spectator motivation. Master thesis.George Mason University, Fairfax, Virginia, USA.",
      "doi": ""
    },
    {
      "text": "Max Sjöblom and Juho Hamari. 2017. Why do people watch others play video games? An empirical study on the motivations of Twitch users. Computers in Human Behavior 75 (2017), 985–996.",
      "doi": "10.1016/j.chb.2016.10.019"
    },
    {
      "text": "Mel Slater, Bernhard Spanlang, Maria V Sanchez-Vives, and Olaf Blanke. 2010. First person experience of body transfer in virtual reality. PloS one 5, 5 (2010), 1–9.",
      "doi": ""
    },
    {
      "text": "Thomas Smith, Marianna Obrist, and Peter Wright. 2013. Live-Streaming Changes the (Video) Game. In Proceedings of the 11th European Conference on Interactive TV and Video (Como, Italy) (EuroITV ’13). Association for Computing Machinery, New York, NY, USA, 131–138. https://doi.org/10.1145/2465958.2465971",
      "doi": "10.1145/2465958.2465971"
    },
    {
      "text": "Superhot Team. 2017. Superhot VR. VR Game [Windows]. Superhot Team, Lodz, Poland. Last played February 2020.",
      "doi": ""
    },
    {
      "text": "Nicholas Taylor. 2016. Play to the camera: Video ethnography, spectatorship, and e-sports. Convergence 22, 2 (2016), 115–130.",
      "doi": ""
    },
    {
      "text": "Burak S. Tekin and Stuart Reeves. 2017. Ways of Spectating: Unravelling Spectator Participation in Kinect Play. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1558–1570. https://doi.org/10.1145/3025453.3025813",
      "doi": ""
    },
    {
      "text": "Valve. 2016. Virtual Reality - SteamVR featuring the HTC Vive. YouTube Video. Accessed April 18, 2020 from https://www.youtube.com/watch?v=qYfNzhLXYGc.",
      "doi": ""
    },
    {
      "text": "Valve. 2020. Half-Life: Alyx. VR Game [Windows]. Valve, Bellevue, Washington, US. Last played April 2020.",
      "doi": ""
    },
    {
      "text": "Valve. 2020. Steam. Website. Retrieved April 20, 2020 from https://store.steampowered.com/.",
      "doi": ""
    },
    {
      "text": "Amy Voida and Saul Greenberg. 2009. Wii All Play: The Console Game as a Computational Meeting Place. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1559–1568. https://doi.org/10.1145/1518701.1518940",
      "doi": "10.1145/1518701.1518940"
    },
    {
      "text": "Gerald A Voorhees, Joshua Call, and Katie Whitlock. 2012. Guns, grenades, and grunts: First-person shooter games. Bloomsbury Publishing USA, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Rina R. Wehbe and Lennart E. Nacke. 2015. Towards Understanding the Importance of Co-Located Gameplay. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom) (CHI PLAY ’15). Association for Computing Machinery, New York, NY, USA, 733–738. https://doi.org/10.1145/2793107.2810312",
      "doi": "10.1145/2793107.2810312"
    },
    {
      "text": "Thomas Weiss. 2011. Fulfilling the Needs of eSports Consumers: A Uses and Gratifications Perspective. Bled eConference 30(2011), 572–580.",
      "doi": ""
    },
    {
      "text": "Thomas Weiss and Sabrina Schiele. 2013. Virtual worlds in competitive contexts: Analyzing eSports consumer needs. Electronic Markets 23, 4 (2013), 307–316.",
      "doi": ""
    },
    {
      "text": "Finn Welsford-Ackroyd, Andrew Chalmers, Rafael Anjos, Daniel Medeiros, Hyejin Kim, and Taehyun Rhee. 2020. Asymmetric Interaction between HMD Wearers and Spectators with a Large Display. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, New York, NY, USA, 670–671. https://doi.org/10.1109/VRW50115.2020.00186",
      "doi": ""
    },
    {
      "text": "YouTube, LLC. 2020. YouTube. Website. Retrieved April 16, 2020 from https://youtube.com/.",
      "doi": ""
    }
  ]
}