{
  "doi": "10.1145/3411764.3445337",
  "title": "Communicating with Motion: A Design Space for Animated Visual Narratives in Data Videos",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Data videos are a genre of narrative visualization that communicates stories by combining data visualization and motion graphics. While data videos are increasingly gaining popularity, few systematic reviews or structured analyses exist for their design. In this work, we introduce a design space for animated visual narratives in data videos. The design space combines a dimension for animation techniques that are frequently used to facilitate data communication with one for visual narrative strategies served by such animation techniques to support story presentation. We derived our design space from the analysis of 82 high-quality data videos collected from online sources. We conducted a workshop with 20 participants to evaluate the effectiveness of our design space. Qualitative and quantitative feedback suggested that our design space is inspirational and useful for designing and creating data videos.",
  "tags": [
    "Data Videos",
    "Animation",
    "Visual Narratives",
    "Narrative Visualization"
  ],
  "authors": [
    {
      "name": "Yang Shi",
      "institution": "Intelligent Big Data Visualization Lab Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556666156",
      "orcid": "missing"
    },
    {
      "name": "Xingyu Lan",
      "institution": "Intelligent Big Data Visualization Lab Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700963",
      "orcid": "missing"
    },
    {
      "name": "Jingwen Li",
      "institution": "Intelligent Big Data Visualization Lab Tongji University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702660",
      "orcid": "missing"
    },
    {
      "name": "Zhaorui Li",
      "institution": "Intelligent Big Data Visualization Lab, Tongji University, China, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700937",
      "orcid": "missing"
    },
    {
      "name": "Nan Cao",
      "institution": "Intelligent Big Data Visualization Lab Tongji College of Design and Innovation, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81320488328",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Christophe Hurter, and Pourang Irani. 2015. Understanding Data Videos: Looking at Narrative Visualization through the Cinematography Lens. In Proceedings of the 2015 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1459–1468.",
      "doi": "10.1145/2702123.2702431"
    },
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Jason Leboe-McGowan, and Pourang Irani. 2018. Hooked on Data Videos: Assessing the Effect of Animation and Pictographs on Viewer Engagement. In Proceedings of the 2018 International Conference on Advanced Visual Interfaces. ACM, New York, NY, USA, 21:1–21:9.",
      "doi": "10.1145/3206505.3206552"
    },
    {
      "text": "Fereshteh Amini, Nathalie Henry Riche, Bongshin Lee, Andres Monroy-Hernandez, and Pourang Irani. 2016. Authoring Data-Driven Videos with DataClips. IEEE Transactions on Visualization and Computer Graphics 23, 1(2016), 501–510.",
      "doi": "10.1109/TVCG.2016.2598647"
    },
    {
      "text": "Benjamin Bach, Moritz Stefaner, Jeremy Boy, Steven Drucker, Lyn Bartram, Jo Wood, Paolo Ciuccarelli, Yuri Engelhardt, Ulrike Koeppen, and Barbara Tversky. 2018. Narrative Design Patterns for Data-Driven Storytelling. In Data-Driven Storytelling. AK Peters/CRC Press, Boca Raton, London, New York, 107–134.",
      "doi": ""
    },
    {
      "text": "Benjamin Bach, Zezhong Wang, Matteo Farinella, Dave Murray-Rust, and Nathalie Henry Riche. 2018. Design Patterns for Data Comics. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 38:1–38:12.",
      "doi": "10.1145/3173574.3173612"
    },
    {
      "text": "Ronald M Baecker and Ian Small. 1990. Animation at the Interface. In The Art of Human-Computer Interface Design. Addison-Wesley, Boston, MA, USA, 251–267.",
      "doi": ""
    },
    {
      "text": "Mieke Bal and Christine Van Boheemen. 2009. Narratology: Introduction to the Theory of Narrative. University of Toronto Press, Less UK/Europe, India, Japan.",
      "doi": ""
    },
    {
      "text": "Lyn Bartram, Jeremy Boy, Paolo Ciuccarelli, Steven Drucker, Yuri Engelhardt, Ulrike Koeppen, Moritz Stefaner, Barbara Tversky, and Jo Wood. 2016. NAPA Cards. http://napa-cards.net/#info. Accessed:2020.",
      "doi": ""
    },
    {
      "text": "BBC. 2010. Hans Rosling’s 200 Countries, 200 Years, 4 Minutes - The Joy of Stats - BBC Four. https://www.youtube.com/watch?v=jbkSRLYSojo. Accessed:2020.",
      "doi": ""
    },
    {
      "text": "Liz Blazer. 2019. Animated Storytelling. Peachpit Press, San Francisco, CA, USA.",
      "doi": ""
    },
    {
      "text": "Bloomberg. 2016. Electric Cars Could Wreak Havoc on Oil Markets Within a Decade. https://www.youtube.com/watch?v=jwHN6QQWv2g&list=WL&index=124. Accessed:2020.",
      "doi": ""
    },
    {
      "text": "David Bordwell. 2013. Narration in the Fiction Film. University of California Press, Oakland, CA, USA.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using Thematic Analysis in Psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Amira Chalbi, Jacob Ritchie, Deokgun Park, Jungu Choi, Nicolas Roussel, Niklas Elmqvist, and Fanny Chevalier. 2019. Common Fate for Animated Transitions in Visualization. IEEE Transactions on Visualization and Computer Graphics 26, 1(2019), 386–396.",
      "doi": ""
    },
    {
      "text": "Fanny Chevalier, Pierre Dragicevic, and Steven Franconeri. 2014. The Not-so-Staggering Effect of Staggered Animated Transitions on Visual Tracking. IEEE Transactions on Visualization and Computer Graphics 20, 12(2014), 2241–2250.",
      "doi": ""
    },
    {
      "text": "Fanny Chevalier, Nathalie Henry Riche, Catherine Plaisant, Amira Chalbi, and Christophe Hurter. 2016. Animations 25 Years Later: New Roles and Opportunities. In Proceedings of the 2016 International Working Conference on Advanced Visual Interfaces. ACM, New York, NY, USA, 280–287.",
      "doi": "10.1145/2909132.2909255"
    },
    {
      "text": "Fanny Chevalier, Romain Vuillemot, and Guia Gali. 2013. Using Concrete Scales: A Practical Framework for Effective Visual Depiction of Complex Measures. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2426–2435.",
      "doi": "10.1109/TVCG.2013.210"
    },
    {
      "text": "Pierre Dragicevic, Anastasia Bezerianos, Waqas Javed, Niklas Elmqvist, and Jean-Daniel Fekete. 2013. Temporal Distortion for Animated Transitions. In Proceedings of the 2013 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2009–2018.",
      "doi": ""
    },
    {
      "text": "Danyel Fisher. 2010. Animation for Visualization: Opportunities and Drawbacks. In Beautiful Visualization. Vol. 19. O’Reilly Media, MA, China, CA, EMEA, Japan, 329–352.",
      "doi": ""
    },
    {
      "text": "Tong Ge, Yue Zhao, Bongshin Lee, Donghao Ren, Baoquan Chen, and Yunhai Wang. 2020. Canis: A High-Level Language for Data-Driven Chart Animations. Computer Graphics Forum 39, 3 (2020), 607–671.",
      "doi": ""
    },
    {
      "text": "Michael Gleicher, Danielle Albers, Rick Walker, Ilir Jusufi, Charles D Hansen, and Jonathan C Roberts. 2011. Visual Comparison for Information Visualization. Information Visualization 10, 4 (2011), 289–309.",
      "doi": "10.1177/1473871611416549"
    },
    {
      "text": "Steve Haroz, Robert Kosara, and Steven L Franconeri. 2015. Isotype Visualization: Working Memory, Performance, and Engagement with Pictographs. In Proceedings of the 2015 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1191–1200.",
      "doi": "10.1145/2702123.2702275"
    },
    {
      "text": "Chris Harrison, Gary Hsieh, Karl DD Willis, Jodi Forlizzi, and Scott E Hudson. 2011. Kineticons: Using Iconographic Motion in Graphical Userinterface Design. In Proceedings of the 2011 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1999–2008.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and George Robertson. 2007. Animated Transitions in Statistical Data Graphics. IEEE Transactions on Visualization and Computer Graphics 13, 6(2007), 1240–1247.",
      "doi": "10.1109/TVCG.2007.70539"
    },
    {
      "text": "Jessica Hullman and Nick Diakopoulos. 2011. Visualization Rhetoric: Framing Effects in Narrative Visualization. IEEE Transactions on Visualization and Computer Graphics 17, 12(2011), 2231–2240.",
      "doi": "10.1109/tvcg.2011.255"
    },
    {
      "text": "Jessica Hullman, Steven Drucker, Nathalie Henry Riche, Bongshin Lee, Danyel Fisher, and Eytan Adar. 2013. A Deeper Understanding of Sequence in Narrative Visualization. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2406–2415.",
      "doi": "10.1109/TVCG.2013.119"
    },
    {
      "text": "Samuel Huron, Romain Vuillemot, and Jean-Daniel Fekete. 2013. Visual Sedimentation. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2446–2455.",
      "doi": "10.1109/TVCG.2013.227"
    },
    {
      "text": "IDEO. 2003. Method Cards. https://www.ideo.com/post/method-cards. Accessed:2020.",
      "doi": ""
    },
    {
      "text": "Christopher Ingraham. 2017. Remembering Hans Rosling, The Visualization Pioneer Who Made Data Dance. https://www.washingtonpost.com/news/wonk/wp/2017/02/08/remembering-hans-rosling-the-visualization-pioneer-who-made-data-dance/. Accessed:2020.",
      "doi": ""
    },
    {
      "text": "Wilmot Li John R Thompson, Zhicheng Liuand John Stasko. 2020. Understanding the Design Space and Authoring Paradigms for Animated Data Graphics. Computer Graphics Forum 39, 3 (2020), 207–218.",
      "doi": ""
    },
    {
      "text": "Cole Nussbaumer Knaflic. 2015. Storytelling with Data: A Data Visualization Guide for Business Professionals. Wiley, Hoboken, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Ha-Kyung Kong, Wenjie Zhu, Zhicheng Liu, and Karrie Karahalios. 2019. Understanding Visual Cues in Visualizations Accompanied by Audio Narrations. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 50:1–50:13.",
      "doi": "10.1145/3290605.3300280"
    },
    {
      "text": "Bongshin Lee, Nathalie Henry Riche, Petra Isenberg, and Sheelagh Carpendale. 2015. More Than Telling a Story: Transforming Data into Visually Shared Stories. IEEE Transactions on Visualization and Computer Graphics 35, 5(2015), 84–90.",
      "doi": "10.1109/MCG.2015.99"
    },
    {
      "text": "Scott McCloud. 2011. Making Comics. Harper Collins, New York, London, Toronto, Sydney.",
      "doi": ""
    },
    {
      "text": "Sean McKenna, N Henry Riche, Bongshin Lee, Jeremy Boy, and Miriah Meyer. 2017. Visual Narrative Flow: Exploring Factors Shaping Data Visualization Story Reading Experiences. Computer Graphics Forum 36, 3 (2017), 377–387.",
      "doi": "10.1111/cgf.13195"
    },
    {
      "text": "Tamara Munzner. 2014. Visualization Analysis and Design. CRC press, Boca Raton, London, New York.",
      "doi": ""
    },
    {
      "text": "Politzane. 2012. Wealth Inequality in America. https://www.youtube.com/watch?v=QPKKQnijnsM. Accessed:2020.",
      "doi": ""
    },
    {
      "text": "Brian Richardson. 2001. Denarration in Fiction: Erasing the Story in Beckett and Others. Narrative 9, 2 (2001), 168–175.",
      "doi": ""
    },
    {
      "text": "George Robertson, Roland Fernandez, Danyel Fisher, Bongshin Lee, and John Stasko. 2008. Effectiveness of Animation in Trend Visualization. IEEE Transactions on Visualization and Computer Graphics 14, 6(2008), 1325–1332.",
      "doi": "10.1109/TVCG.2008.125"
    },
    {
      "text": "Hugo Romat, Caroline Appert, Benjamin Bach, Nathalie Henry-Riche, and Emmanuel Pietriga. 2018. Animated edge textures in node-link diagrams: a design space and initial evaluation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 187:1–187:13.",
      "doi": "10.1145/3173574.3173761"
    },
    {
      "text": "Edward Segel and Jeffrey Heer. 2010. Narrative Visualization: Telling Stories with Data. IEEE Transactions on Visualization and Computer Graphics 16, 6(2010), 1139–1148.",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "Danqing Shi, Xinyue Xu, Fuling Sun, Yang Shi, and Nan Cao. 2020. Calliope: Automatic Visual Data Story Generation from a Spreadsheet. IEEE Transactions on Visualization and Computer Graphics Preprint (2020), 1–11.",
      "doi": ""
    },
    {
      "text": "Yang Shi, Chris Bryan, Sridatt Bhamidipati, Ying Zhao, Yaoxue Zhang, and Kwan-Liu Ma. 2018. MeetingVis: Visual narratives to assist in recalling meeting context and content. IEEE Transactions on Visualization and Computer Graphics 24, 6(2018), 1918–1929.",
      "doi": ""
    },
    {
      "text": "Ralph S. Singleton, James A Conrad, and Janna Wong Healy. 1986. Filmmaker’s Dictionary. Lone Eagle, Los Angeles, CA, USA.",
      "doi": ""
    },
    {
      "text": "Charles D. Stolper, Bongshin Lee, Nathalie Henry Riche, and John Stasko. 2016. Emerging and Recurring Data-Driven Storytelling Techniques: Analysis of a Curated Collection of Recent Stories. Technical Report MSR-TR-2016-14. Microsoft.",
      "doi": ""
    },
    {
      "text": "The New York Times. 2012. One Race, Every Medalist Ever. http://archive.nytimes.com/www.nytimes.com/interactive/2012/08/05/sports/olympics/the-100-meter-dash-one-race-every-medalist-ever.html. Accessed:2020.",
      "doi": ""
    },
    {
      "text": "Jennifer Van Sijll. 2005. Cinematic Storytelling: The 100 Most Powerful Film Conventions Every Filmmaker Must Know. Michael Wiese Productions, Studio, CA, USA.",
      "doi": ""
    },
    {
      "text": "Yun Wang, Zhida Sun, Haidong Zhang, Weiwei Cui, Ke Xu, Xiaojuan Ma, and Dongmei Zhang. 2019. DataShot: Automatic Generation of Fact Sheets from Tabular Data. IEEE Transactions on Visualization and Computer Graphics 26, 1(2019), 895–905.",
      "doi": ""
    },
    {
      "text": "Robyn R. Warhol. 2007. Neonarrative; or, How to Render the Unnarratable in Realist Fiction and Contemporary Film. Wiley Online Library, Hoboken, NJ, USA, 220–231.",
      "doi": ""
    },
    {
      "text": "[50] 200 Countries, 200 Years, 4 Minutes. 2010. BBC. https://www.youtube.com/watch?v=jbkSRLYSojo.",
      "doi": ""
    },
    {
      "text": "[51] 99% v 1%: The Data Behind the Occupy Movement. 2011. The Guardian. https://www.youtube.com/watch?v=DxvVZe2fnvI",
      "doi": ""
    },
    {
      "text": "[52] A Brief History of America and Cuba. 2016. Vox. https://www.youtube.com/watch?v=chYBlArm9Ao.",
      "doi": ""
    },
    {
      "text": "[53] AdReaction 2014 - Marketing in the Multiscreen World. 2014. Kantar Millward Brown. https://www.youtube.com/watch?v=1GyIoYOLEQ8.",
      "doi": ""
    },
    {
      "text": "[54] Baseball’s Mike Trout is a God of War. 2018. FiveThirtyEight. https://www.youtube.com/watch?v=0mnm7rqH-L0",
      "doi": ""
    },
    {
      "text": "[55] Because the World Needs to Know. 2008. 350.org. https://www.youtube.com/watch?v=s5kg1oOq9tY.",
      "doi": ""
    },
    {
      "text": "[56] China: The Largest Migration in History. 2012. The Economist. https://www.youtube.com/watch?v=KNXg-kYk-LU",
      "doi": ""
    },
    {
      "text": "[57] Corruption is Legal in America. 2015. RepresentUS. https://www.youtube.com/watch?v=5tu32CCA_Ig",
      "doi": ""
    },
    {
      "text": "[58] Does the American Economy Do Better Under the Democrats or Republicans? 2014. The Economist. https://www.youtube.com/watch?v=CtKC2_xiAps",
      "doi": ""
    },
    {
      "text": "[59] Does this Line Predict America’s Next Recession? 2019. The Economist. https://www.youtube.com/watch?v=oW4hfaiXKG8",
      "doi": ""
    },
    {
      "text": "[60] Donald Trump’s $20 Trillion Problem. 2017. Visual Capitalist. https://www.youtube.com/watch?v=tgpfswDHA_Y",
      "doi": ""
    },
    {
      "text": "[61] Drug Use: 20 Things You Might Not Know. 2012. The Guardian. https://www.youtube.com/watch?v=dHyDviIkHB4&t=25s",
      "doi": ""
    },
    {
      "text": "[62] Earthquake Magnitude Power Comparison. 2017. Reigarw Comparisons. https://www.youtube.com/watch?v=DWFxIgv3Jc0",
      "doi": ""
    },
    {
      "text": "[63] Electric Cars Could Wreak Havoc on Oil Markets Within a Decade. 2016. Bloomberg Quicktake. https://www.youtube.com/watch?v=jwHN6QQWv2g&list=WL&index=124",
      "doi": ""
    },
    {
      "text": "[64] GE Capital Mid-Market. 2014. AccessGE EMEA. https://www.youtube.com/watch?v=GJuK26FG4E4",
      "doi": ""
    },
    {
      "text": "[65] Giving Birth in Your 20s VS Your 30s. 2019. Science Insider. https://www.youtube.com/watch?v=gY5CLjmfhvo",
      "doi": ""
    },
    {
      "text": "[66] Global Air Traffic. 2012. RightColors. https://www.youtube.com/watch?v=OsPlhwA-ick",
      "doi": ""
    },
    {
      "text": "[67] Global Wealth Report 2012 - What Will The Future Bring. 2012. Credit Suisse. https://www.youtube.com/watch?v=WX-tEWNL_e0",
      "doi": ""
    },
    {
      "text": "[68] Has Migration Gone too Far? 2018. Suisse Group Research. https://www.youtube.com/watch?v=xt-e8JQZmqw",
      "doi": ""
    },
    {
      "text": "[69] Heart Disease Facts PSA. 2014. Digital Splash Media. http://digitalsplashmedia.com/2014/04/heart-disease-facts-psa-video",
      "doi": ""
    },
    {
      "text": "[70] History of Telangana and Andhra Pradesh. 2014. The Economist. https://www.youtube.com/watch?v=TTH8FjsmraE",
      "doi": ""
    },
    {
      "text": "[71] How Advertising Spending has Changed in America. 2014. The Economist. https://www.youtube.com/watch?v=QQM4BfS0G_Y",
      "doi": ""
    },
    {
      "text": "[72] How America Became a Superpower. 2016. Vox. https://www.youtube.com/watch?v=BShvYeyMm_Y&list=WL&index=7",
      "doi": ""
    },
    {
      "text": "[73] How Powerful is Your Passport? 2018. The Economist. https://www.youtube.com/watch?v=P4jibdbwKm4",
      "doi": ""
    },
    {
      "text": "[74] How Tax Breaks Help the Rich. 2018. Vox. https://www.youtube.com/watch?v=k1vE_LVBx4s&list=WL&index=8",
      "doi": ""
    },
    {
      "text": "[75] How to Break the Two-Party Hold on American Politics. 2017. Vox. https://www.youtube.com/watch?v=Nd-9op64t2M",
      "doi": ""
    },
    {
      "text": "[76] How to Spot a Misleading Graph. 2017. TED-Ed. https://www.youtube.com/watch?v=E91bGT9BjYk",
      "doi": ""
    },
    {
      "text": "[77] If the World Were 100 People. 2016. GOOD Magazine. https://www.youtube.com/watch?v=QFrqTFRy-LU",
      "doi": ""
    },
    {
      "text": "[78] Inequality: How Wealth is Distributed in the UK. 2013. The Guardian. https://www.theguardian.com/commentisfree/video/2013/oct/08/inequality-how-wealth-distributed-uk-animated-video",
      "doi": ""
    },
    {
      "text": "[79] International Migration. 2011. Edeos - Digital Education GmbH. https://www.youtube.com/watch?v=lOZmqIwqur4",
      "doi": ""
    },
    {
      "text": "[80] iPad Animated Infographic - Past/Present/New Generation. 2012. RightColors. https://www.youtube.com/watch?v=fXi1YTKEcY0",
      "doi": ""
    },
    {
      "text": "[81] Is America Racist? 2016. PragerU. https://www.youtube.com/watch?v=ThRb9x-RieI&list=WL&index=2",
      "doi": ""
    },
    {
      "text": "[82] Japan’s Debt Problem Visualized. 2013. Addogram. https://www.youtube.com/watch?v=Njp8bKpi-vg&list=TL6ZgCranjlWeMXo0NT2dQ_6SF0WOMEzbM",
      "doi": ""
    },
    {
      "text": "[83] Live Chart: Global Smartphone Shipments. 2014. The Economist. https://www.youtube.com/watch?v=ph8F320Bljc",
      "doi": ""
    },
    {
      "text": "[84] Number of Deaths in the WW2 per Country. 2018. MetaBallStudios. https://www.youtube.com/watch?v=7cgRwDkP6vk",
      "doi": ""
    },
    {
      "text": "[85] One Race, Every Medalist Ever. 2012. The New York Times. http://archive.nytimes.com/www.nytimes.com/interactive/2012/08/05/sports/olympics/the-100-meter-dash-one-race-every-medalist-ever.html",
      "doi": ""
    },
    {
      "text": "[86] Overpopulation - The Human Explosion Explained. 2016. Kurzgesagt – In a Nutshell. https://www.youtube.com/watch?v=QsBT5EQt348",
      "doi": ""
    },
    {
      "text": "[87] Overweight World - Obesity Facts and Statistics. 2015. The Infographics Show. https://www.youtube.com/watch?v=IkoC3HZwe7Q&list=WL&index=64",
      "doi": ""
    },
    {
      "text": "[88] People and Their Cars. 2014. Visually. https://visual.ly/community/videographic/transportation/people-and-their-cars-americas-love-affair-automobile",
      "doi": ""
    },
    {
      "text": "[89] Racing Against History. 2012. The New York Times. http://archive.nytimes.com/www.nytimes.com/interactive/2012/08/01/sports/olympics/racing-against-history.html.",
      "doi": ""
    },
    {
      "text": "[90] Road to Recovery. 2010. BarackObamadotcom. https://www.youtube.com/watch?v=jWmUnU7HS-I",
      "doi": ""
    },
    {
      "text": "[91] Shocking Amounts of Sugar People Eat Around the World. 2014. BuzzFeed. https://www.buzzfeed.com/brandensueper/shocking-amounts-of-sugar-people-eat-around-the-world#3h2hzr6",
      "doi": ""
    },
    {
      "text": "[92] Show Me Something. 2014. Shutterstock Blog. http://www.shutterstock.com/blog/an-infographic-exploration-of-online-video",
      "doi": ""
    },
    {
      "text": "[93] Sidestepping Russia’s Gas Monopoly. 2009. The Economist. https://www.youtube.com/watch?v=qaEQQyYkYY8",
      "doi": ""
    },
    {
      "text": "[94] Skivers V Strivers: The Benefits Debate Explained. 2013. The Guardian. https://www.youtube.com/watch?v=ZoEhd-QnhtU",
      "doi": ""
    },
    {
      "text": "[95] Taylor Swift vs Regular Girl - How Do They Compare? 2015. The Infographics Show. https://www.youtube.com/watch?v=0MuXnH-rAEE",
      "doi": ""
    },
    {
      "text": "[96] The Bad Map We See Every Presidential Election. 2016. Vox. https://www.youtube.com/watch?v=hlQE4IGFc5A",
      "doi": ""
    },
    {
      "text": "[97] The Benefits of International Trade. 2018. PolicyEd. https://www.youtube.com/watch?v=lFUG307RI4I",
      "doi": ""
    },
    {
      "text": "[98] The Fallen of World War II. 2015. Neil Halloran. http://www.fallen.io/ww2/",
      "doi": ""
    },
    {
      "text": "[99] The Forest of Advocacy. 2012. FlowingData. https://flowingdata.com/2012/09/14/animated-political-contributions/",
      "doi": ""
    },
    {
      "text": "[100] The Marathon Route’s Evolving Neighborhoods. 2011. The New York Times. https://archive.nytimes.com/www.nytimes.com/interactive/2011/11/05/nyregion/the-evolving-neighborhoods-along-the-marathon.html",
      "doi": ""
    },
    {
      "text": "[101] The Mind-Boggling Numbers Behind the Super Bowl. 2016. NFL. https://www.youtube.com/watch?v=BhBX9r4gJzY",
      "doi": ""
    },
    {
      "text": "[102] The Numbers Game: Do The Rich Get All The Gains? 2019. PolicyEd. https://www.youtube.com/watch?v=GcdqGUWj2oo&list=WL&index=19",
      "doi": ""
    },
    {
      "text": "[103] The Numbers Game: The Paradox of Household Income. 2018. PolicyEd. https://www.youtube.com/watch?v=1DU2IT8rl6c&list=WL&index=2",
      "doi": ""
    },
    {
      "text": "[104] The Problem with America’s College Entrance Exam. 2019. Vox. https://www.youtube.com/watch?v=WjVVwMGJ9S8&list=WL&index=3",
      "doi": ""
    },
    {
      "text": "[105] The Snowden Files: Facts and Figures. 2013. The Guardian. https://www.theguardian.com/world/video/2013/dec/02/the-snowden-files-guide-surveillance-industry-video",
      "doi": ""
    },
    {
      "text": "[106] The Status of Aid. 2010. Designer Vimeo Channel. http://vimeo.com/10852417",
      "doi": ""
    },
    {
      "text": "[107] The Swing State of Swing States. 2012. The New York Times. https://www.nytimes.com/video/us/politics/100000001883681/the-swing-state-of-swing-states.html",
      "doi": ""
    },
    {
      "text": "[108] The True Cost of the iPhone. 2019. PolyMatter. https://www.youtube.com/watch?v=5kZRY5xlP6Y&list=WL&index=80",
      "doi": ""
    },
    {
      "text": "[109] The UK Election Explained. 2017. Financial Times. https://www.youtube.com/watch?v=KgLNdnQoElo",
      "doi": ""
    },
    {
      "text": "[110] The United States (USA) vs The World - Who Would Win? Military/Army Comparison. 2018. The Infographics Show. https://www.youtube.com/watch?v=1y1e_ASbSIE",
      "doi": ""
    },
    {
      "text": "[111] The World’s Largest 10 Economies in 2030. 2019. Visual Capitalist. https://www.youtube.com/watch?v=L5v9jt4__ho&list=UUc3e9XOO_neg3mnb9yDTklg&index=4",
      "doi": ""
    },
    {
      "text": "[112] This Incredible Animation Shows How Deep The Ocean Really is. 2017. Tech Insider. https://www.youtube.com/watch?v=UwVNkfCov1k",
      "doi": ""
    },
    {
      "text": "[113] Time History of Atmospheric Carbon Dioxide. 2014. ClimateState. http://climatestate.com/2014/07/12/time-history-of-atmospheric-carbon-dioxide/",
      "doi": ""
    },
    {
      "text": "[114] Time: The History & Future of Everything. Remastered. 2018. Kurzgesagt – In a Nutshell. https://www.youtube.com/watch?v=5TbUxGZtwGI",
      "doi": ""
    },
    {
      "text": "[115] Top Growers in 2014. 2014. The Economist. https://www.youtube.com/watch?v=00OgaJzZhOs",
      "doi": ""
    },
    {
      "text": "[116] Trade Justice - Why World Trade Rules Need to Change. 2008. Trade Aid. https://www.youtube.com/watch?v=ldZwGDXTsmk",
      "doi": ""
    },
    {
      "text": "[117] Ukrainian Web - Revolution. 2012. PlusOne. https://www.youtube.com/watch?v=2NpVNWwW2ZU",
      "doi": ""
    },
    {
      "text": "[118] Urbanisation and the Rise of the Megacity. 2017. The Economist. https://www.youtube.com/watch?v=JDS_BqDeZ4k",
      "doi": ""
    },
    {
      "text": "[119] US Energy Outlook 2030: America’s Energy Future - 2013 Report. 2013. BP. https://www.youtube.com/watch?v=PN6Nq_hpUck",
      "doi": ""
    },
    {
      "text": "[120] Visualizing the Structure of the World Economy and Population in One Chart. 2015. World Bank. https://www.youtube.com/watch?v=CRfc85AIH3c",
      "doi": ""
    },
    {
      "text": "[121] Waiting for Superman - Official Movie Trailer. 2010. Movietrailers2020. https://www.youtube.com/watch?v=5O_our5oKI8",
      "doi": ""
    },
    {
      "text": "[122] Was Karl Marx Right? 2018. The Economist. https://www.youtube.com/watch?v=TMmDebW_OBI",
      "doi": ""
    },
    {
      "text": "[123] Wealth Inequality in America. 2012. Politzane. https://www.youtube.com/watch?v=QPKKQnijnsM",
      "doi": ""
    },
    {
      "text": "[124] What Bill Gates is Afraid of. 2015. Vox. https://www.youtube.com/watch?v=9AEMKudv5p0&list=WL&index=2",
      "doi": ""
    },
    {
      "text": "[125] What Does One Trillion Dollars Look Like? 2009. VizWorld. https://vizworld.com/2009/07/one-trillion-dollars-visualized-from-mint/#sthash.qpuiOrsU.dpbs",
      "doi": ""
    },
    {
      "text": "[126] What If Only 100 People Existed on Earth? 2017. RealLifeLore. https://www.youtube.com/watch?v=UbffuGZHeR0",
      "doi": ""
    },
    {
      "text": "[127] What is the True UK Cost of the Afghanistan War? 2011. Countfire. https://www.counterfire.org/articles/video/14656-what-is-the-true-cost-of-the-afghanistan-war-narrated-by-tony-benn-music-by-brian-eno",
      "doi": ""
    },
    {
      "text": "[128] What People Miss About the Gender Wage Gap. 2016. Vox. https://www.youtube.com/watch?v=13XU4fMlN3w&list=WL&index=2",
      "doi": ""
    },
    {
      "text": "[129] Why are Some People Left-handed? 2015. TED-Ed. https://www.youtube.com/watch?v=TGLYcYCm2FM",
      "doi": ""
    },
    {
      "text": "[130] Why are Women Paid Less than Men? 2017. The Economist. https://www.youtube.com/watch?v=mpE8ttCEd-w",
      "doi": ""
    },
    {
      "text": "[131] Why France Produces the Most World Cup Players. 2018. Vox. https://www.youtube.com/watch?v=P55XYp2KD2Y&list=WL&index=3",
      "doi": ""
    }
  ]
}