{
  "doi": "10.1145/3411764.3445309",
  "title": "Covert Embodied Choice: Decision-Making and the Limits of Privacy Under Biometric Surveillance",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Algorithms engineered to leverage rich behavioral and biometric data to predict individual attributes and actions continue to permeate public and private life. A fundamental risk may emerge from misconceptions about the sensitivity of such data, as well as the agency of individuals to protect their privacy when fine-grained (and possibly involuntary) behavior is tracked. In this work, we examine how individuals adjust their behavior when incentivized to avoid the algorithmic prediction of their intent. We present results from a virtual reality task in which gaze, movement, and other physiological signals are tracked. Participants are asked to decide which card to select without an algorithmic adversary anticipating their choice. We find that while participants use a variety of strategies, data collected remains highly predictive of choice (80% accuracy). Additionally, a significant portion of participants became more predictable despite efforts to obfuscate, possibly indicating mistaken priors about the dynamics of algorithmic prediction.",
  "authors": [
    {
      "name": "Jeremy Raboff Gordon",
      "institution": "School of Information University of California, Berkeley, United States",
      "img": "/do/10.1145/contrib-99659367072/rel-imgonly/_mg_987601_ok_square_smile.jpg",
      "acmid": "99659367072",
      "orcid": "missing"
    },
    {
      "name": "Max T. Curran",
      "institution": "School of Information University of California, Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659200395",
      "orcid": "missing"
    },
    {
      "name": "John Chuang",
      "institution": "School of Information UC Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100637202",
      "orcid": "missing"
    },
    {
      "name": "Coye Cheshire",
      "institution": "UC Berkeley, United States",
      "img": "/do/10.1145/contrib-81456639306/rel-imgonly/coyecheshire_1.jpg",
      "acmid": "81456639306",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Imtiaz Ahmad, Rosta Farzan, Apu Kapadia, and Adam J Lee. 2020. Tangible privacy: Towards user-centric sensor designs for bystander privacy. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 1–28.",
      "doi": "10.1145/3415187"
    },
    {
      "text": "Claudio A Ardagna, Marco Cremonini, Sabrina De Capitani di Vimercati, and Pierangela Samarati. 2009. An obfuscation-based approach for protecting location privacy. IEEE Transactions on Dependable and Secure Computing 8, 1 (2009), 13–27.",
      "doi": "10.1109/TDSC.2009.25"
    },
    {
      "text": "Jeremy Bailenson. 2018. Protecting Nonverbal Data Tracked in Virtual Reality. JAMA Pediatrics 172, 10 (Oct. 2018), 905. https://doi.org/10.1001/jamapediatrics.2018.1909",
      "doi": ""
    },
    {
      "text": "Kirstie Ball. 2010. Workplace surveillance: An overview. Labor History 51, 1 (2010), 87–106.",
      "doi": ""
    },
    {
      "text": "Rhenan Bartels and Tiago Peçanha. 2020. HRV: a Pythonic package for Heart Rate Variability Analysis. Journal of Open Source Software 5, 51 (2020), 1867.",
      "doi": ""
    },
    {
      "text": "Sian L. Beilock and Lauren E. Holt. 2007. Embodied Preference Judgments: Can Likeability Be Driven by the Motor System?Psychological Science 18, 1 (Jan. 2007), 51–57. https://doi.org/10.1111/j.1467-9280.2007.01848.x",
      "doi": ""
    },
    {
      "text": "Clint Boulton. 2013. Snackmaker modernizes the impulse buy with sensors, analytics. CIO Journal 11(2013).",
      "doi": ""
    },
    {
      "text": "Joseph Bullington. 2005. ’Affective’computing and emotion recognition systems: the future of biometric surveillance?. In Proceedings of the 2nd annual conference on Information security curriculum development. 95–99.",
      "doi": "10.1145/1107622.1107644"
    },
    {
      "text": "David Chaum. 2004. Secret-ballot receipts: True voter-verifiable elections. IEEE security & privacy 2, 1 (2004), 38–47.",
      "doi": ""
    },
    {
      "text": "Tamara Denning, Zakariya Dehlawi, and Tadayoshi Kohno. 2014. In situ with bystanders of augmented reality glasses: Perspectives on recording and privacy-mediating technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2377–2386.",
      "doi": "10.1145/2556288.2557352"
    },
    {
      "text": "Facebook. 2020. Announcing Project Aria: A Research Project on the Future of Wearable AR. https://about.fb.com/news/2020/09/announcing-project-aria-a-research-project-on-the-future-of-wearable-ar/.",
      "doi": ""
    },
    {
      "text": "Karl Friston, Rick A. Adams, Laurent Perrinet, and Michael Breakspear. 2012. Perceptions as Hypotheses: Saccades as Experiments. Frontiers in Psychology 3, MAY (2012), 1–20. https://doi.org/10.3389/fpsyg.2012.00151arxiv:NIHMS150003",
      "doi": ""
    },
    {
      "text": "Natalie Gagliordi. [n.d.]. Amazon Intros Alexa for Residential, Eyes Property Management Firms. https://www.zdnet.com/article/amazon-intros-alexa-for-residential-eyes-property-management-firms/.",
      "doi": ""
    },
    {
      "text": "Flavie Halais. [n.d.]. Is Your Data Being Collected? These Signs Will Tell You Where. Wired ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Ian Hamilton. 2018. Privacy Summit At Stanford Will Draft VR ’Bill Of Rights’.",
      "doi": ""
    },
    {
      "text": "Alicia Juarrero. 2000. Dynamics in action: Intentional behavior as a complex system. Emergence 2, 2 (2000), 24–57.",
      "doi": ""
    },
    {
      "text": "Malcolm Kirkup and Marylyn Carrigan. 2000. Video surveillance research in retailing: ethical issues. International Journal of Retail & Distribution Management (2000).",
      "doi": ""
    },
    {
      "text": "Nathan F. Lepora and Giovanni Pezzulo. 2015. Embodied Choice: How Action Influences Perceptual Decision Making. PLOS Computational Biology 11, 4 (April 2015), e1004110. https://doi.org/10.1371/journal.pcbi.1004110",
      "doi": ""
    },
    {
      "text": "Dongheng Li, David Winfield, and Derrick J Parkhurst. 2005. Starburst: A hybrid algorithm for video-based eye tracking combining feature-based and model-based approaches. In 2005 IEEE Computer Society Conference on Computer Vision and Pattern Recognition (CVPR’05)-Workshops. IEEE, IEEE, San Diego, California, USA, 79–79.",
      "doi": ""
    },
    {
      "text": "Daniel J. Liebling and Sören Preibusch. 2014. Privacy Considerations for a Pervasive Eye Tracking World. Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing Adjunct Publication - UbiComp ’14 Adjunct (2014), 1169–1177. https://doi.org/10.1145/2638728.2641688",
      "doi": ""
    },
    {
      "text": "Mirca Madianou. 2019. The biometric assemblage: Surveillance, experimentation, profit, and the measuring of refugee bodies. Television & New Media 20, 6 (2019), 581–599.",
      "doi": ""
    },
    {
      "text": "Avi Marciano. 2019. Reframing biometric surveillance: from a means of inspection to a form of control. Ethics and Information Technology 21, 2 (2019), 127–136.",
      "doi": "10.1007/s10676-018-9493-1"
    },
    {
      "text": "Nick Merrill, John Chuang, and Coye Cheshire. 2019. Sensing is Believing: What People Think Biosensors Can Reveal About Thoughts and Feelings. In Proceedings of the 2019 on Designing Interactive Systems Conference. 413–420.",
      "doi": "10.1145/3322276.3322286"
    },
    {
      "text": "Betsy Morris. 2016. Virtual-Reality Startup Strivr Raises $5 Million in Initial Funding Round. Wall Street Journal (Dec. 2016).",
      "doi": ""
    },
    {
      "text": "Lucas Hermann Negri and Christophe Vestri. 2017. lucashn/peakutils: v1.1.0. https://doi.org/10.5281/zenodo.887917",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2009. Privacy in context: Technology, policy, and the integrity of social life. Stanford University Press.",
      "doi": "10.5555/1822585"
    },
    {
      "text": "Anjul Patney, Marco Salvi, Joohwan Kim, Anton Kaplanyan, Chris Wyman, Nir Benty, David Luebke, and Aaron Lefohn. 2016. Towards foveated rendering for gaze-tracked virtual reality. ACM Transactions on Graphics (TOG) 35, 6 (2016), 179.",
      "doi": "10.1145/2980179.2980246"
    },
    {
      "text": "F. Pedregosa, G. Varoquaux, A. Gramfort, V. Michel, B. Thirion, O. Grisel, M. Blondel, P. Prettenhofer, R. Weiss, V. Dubourg, J. Vanderplas, A. Passos, D. Cournapeau, M. Brucher, M. Perrot, and E. Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12 (2011), 2825–2830.",
      "doi": "10.5555/1953048.2078195"
    },
    {
      "text": "James Pierce. 2019. Smart home security cameras and shifting lines of creepiness: A design-led inquiry. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300275"
    },
    {
      "text": "Thammathip Piumsomboon, Gun Lee, Robert W Lindeman, and Mark Billinghurst. 2017. Exploring natural eye-gaze-based interaction for immersive virtual reality. In 2017 IEEE Symposium on 3D User Interfaces (3DUI). IEEE, 36–39.",
      "doi": ""
    },
    {
      "text": "Inioluwa Deborah Raji, Timnit Gebru, Margaret Mitchell, Joy Buolamwini, Joonseok Lee, and Emily Denton. 2020. Saving face: Investigating the ethical concerns of facial recognition auditing. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society. 145–151.",
      "doi": "10.1145/3375627.3375820"
    },
    {
      "text": "Amnon Rapoport and David V Budescu. 1992. Generation of random series in two-person strictly competitive games.Journal of Experimental Psychology: General 121, 3 (1992), 352.",
      "doi": ""
    },
    {
      "text": "Franziska Roesner, Tadayoshi Kohno, and David Molnar. 2014. Security and privacy for augmented reality systems. Commun. ACM 57, 4 (2014), 88–96.",
      "doi": "10.1145/2580723.2580730"
    },
    {
      "text": "Elaine Sedenberg, Richmond Wong, and John Chuang. 2017. A window into the soul: Biosensing in public. (2017). arXiv:1702.04235",
      "doi": ""
    },
    {
      "text": "Anil K Seth. 2014. The cybernetic Bayesian brain. Open MIND. Frankfurt am Main: MIND Group.",
      "doi": ""
    },
    {
      "text": "Vincent Toubiana, Lakshminarayanan Subramanian, and Helen Nissenbaum. 2011. TrackMeNot: Enhancing the privacy of Web Search. arXiv e-prints (Sept. 2011). https://doi.org/10.1016/S0370-2693(96)01648-6arxiv:1109.4677 [cs.CR]",
      "doi": ""
    },
    {
      "text": "Roel Vertegaal and Jeffrey S Shell. 2008. Attentive user interfaces: the surveillance and sousveillance of gaze-aware objects. Social Science Information 47, 3 (2008), 275–298.",
      "doi": ""
    },
    {
      "text": "Shoshana Zuboff. 2015. Big other: surveillance capitalism and the prospects of an information civilization. Journal of Information Technology 30, 1 (2015), 75–89.",
      "doi": ""
    }
  ]
}