{
  "doi": "10.1145/3411764.3445662",
  "title": "Avoiding Reactions Outside the Home: Challenges, Strategies, and Opportunities to Enhance Dining Out Experiences of People with Food Hypersensitivities",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "People with food hypersensitivities experience adverse reactions when eating certain foods and thus need to adapt their diet. When dining out, the challenge is greater as people entrust the care of their allergy, intolerance, or celiac disease, in the hands of staff who might not have enough knowledge to appropriately care for them. This interview study explored how people with food hypersensitivities avoid reactions while eating out, to inspire future digital technology design. Our findings show the social and emotional impact of food hypersensitivities and how people practically cope by investigating restaurants’ safety precautions, correcting orders, or even educating restaurants’ staff. We discuss our findings against the experiences of other people living with chronic conditions and offer design opportunities for digital technologies to enhance dining out experiences of people with food hypersensitivities.",
  "tags": [
    "self-care",
    "food allergies",
    "avoiding reactions",
    "dining out",
    "qualitative research",
    "Food hypersensitivities",
    "health",
    "food intolerance"
  ],
  "authors": [
    {
      "name": "Francisco Nunes",
      "institution": "Human-Centred Design, Fraunhofer Portugal AICOS, Portugal",
      "img": "/do/10.1145/contrib-81467650576/rel-imgonly/profilecopy.jpg",
      "acmid": "81467650576",
      "orcid": "missing"
    },
    {
      "name": "João Almeida",
      "institution": "Human-Centred Design, Fraunhofer Portugal AICOS, Portugal",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702466",
      "orcid": "missing"
    },
    {
      "name": "Chia-Fang Chung",
      "institution": "Informatics, Indiana University Bloomington, United States",
      "img": "/do/10.1145/contrib-99658635207/rel-imgonly/christinachung.jpg",
      "acmid": "99658635207",
      "orcid": "missing"
    },
    {
      "name": "Nervo Verdezoto",
      "institution": "School of Computer Science and Informatics, Cardiff University, United Kingdom",
      "img": "/do/10.1145/contrib-81486655045/rel-imgonly/81486655045.png",
      "acmid": "81486655045",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sharmini Abdullah, Mohamed Elshaikh, Muhammad Bazli Mahmood, Norshahrizan Nordin, Syed Zulkarnain Syed Idrus, Rozilawati Mahadi, and Umie Naiemah Saraih. 2018. Food Code Breaker (FCB)–Developing the Multi-Lingual Food Code Translation Android Application Using Multi–Options Code Reader System. JPhCS 1019, 1 (2018), 012013.",
      "doi": ""
    },
    {
      "text": "Aline R Ajala, Adriano G Cruz, Jose AF Faria, Eduardo HM Walter, Daniel Granato, Anderson S Sant, 2010. Food allergens: Knowledge and practices of food handlers in restaurants. Food Control 21, 10 (Oct. 2010), 1318–1321. https://doi.org/10.1016/j.foodcont.2010.04.002",
      "doi": ""
    },
    {
      "text": "Sara Altamirano, Gudrun Thorsteinsdottir, and Verónica Burriel. 2020. Mobile Application for Celiac Disease Patients’ Wellness and Support. In Wireless Mobile Communication and Healthcare, Gregory M.P. O’Hare, Michael J. O’Grady, John O’Donoghue, and Patrick Henn (Eds.). Springer International Publishing, Cham, 18–35.",
      "doi": ""
    },
    {
      "text": "Favina Aluvathingal, Nervo Verdezoto, and Francisco Nunes. 2018. Exploring Challenges and Opportunities to Support People with Food Allergies to Find Safe Places for Eating Out. In Proceedings of the 32nd International BCS Human Computer Interaction Conference (Belfast, United Kingdom) (HCI ’18). BCS Learning & Development Ltd., Swindon, GBR, Article 151, 5 pages. https://doi.org/10.14236/ewic/HCI2018.151",
      "doi": "10.14236/ewic/HCI2018.151"
    },
    {
      "text": "Natalie J Avery, Rosemary M King, Susan Knight, and Jonathan O’B Hourihane. 2003. Assessment of quality of life in children with peanut allergy. Pediatric Allergy and Immunology 14, 5 (Oct. 2003), 378–382. https://doi.org/10.1034/j.1399-3038.2003.00072.x",
      "doi": ""
    },
    {
      "text": "Samuel Bailey, Tiffany Billmeier Kindratt, Helen Smith, and David Reading. 2014. Food allergy training event for restaurant staff; a pilot evaluation. Clinical and translational allergy 4, 1 (2014), 26. https://doi.org/10.1186/2045-7022-4-26",
      "doi": ""
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1709–1718. https://doi.org/10.1145/2702123.2702328",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Stinne Aaløkke Ballegaard, Thomas Riisgaard Hansen, and Morten Kyng. 2008. Healthcare in Everyday Life: Designing Healthcare Services for Daily Life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1807–1816. https://doi.org/10.1145/1357054.1357336",
      "doi": "10.1145/1357054.1357336"
    },
    {
      "text": "Julie Barlow, Chris Wright, Janice Sheasby, Andy Turner, and Jenny Hainsworth. 2002. Self-management approaches for people with chronic conditions: A review. Patient Education and Counseling 48, 2 (2002), 177 – 187. https://doi.org/10.1016/S0738-3991(02)00032-0",
      "doi": ""
    },
    {
      "text": "Julie Barnett, Fiona M Begen, M Hazel Gowland, and Jane S Lucas. 2018. Comparing the eating out experiences of consumers seeking to avoid different food allergens. BMC public health 18, 1 (2018), 1263. https://doi.org/10.1186/s12889-018-6117-y",
      "doi": ""
    },
    {
      "text": "Julie Barnett, Konstantina Vasileiou, M Hazel Gowland, Monique M Raats, and Jane S Lucas. 2013. Beyond labelling: what strategies do nut allergic individuals employ to make food choices? A qualitative study. PloS one 8, 1 (2013), e55293. https://doi.org/10.1371/journal.pone.0055293",
      "doi": ""
    },
    {
      "text": "Fiona M Begen, Julie Barnett, Miriam Barber, Ros Payne, M Hazel Gowland, and Jane S Lucas. 2018. Parents’ and caregivers’ experiences and behaviours when eating out with children with a food hypersensitivity. BMC public health 18, 1 (2018), 38. https://doi.org/10.1186/s12889-017-4594-z",
      "doi": ""
    },
    {
      "text": "Fiona M Begen, Julie Barnett, Ros Payne, M Hazel Gowland, Audrey DunnGalvin, and Jane S Lucas. 2018. Eating out with a food allergy in the UK: change in the eating out practices of consumers with food allergy following introduction of allergen information legislation. Clinical & Experimental Allergy 48, 3 (2018), 317–324. https://doi.org/10.1111/cea.13072",
      "doi": ""
    },
    {
      "text": "Fiona M Begen, Julie Barnett, Ros Payne, Debbie Roy, M Hazel Gowland, and Jane S Lucas. 2016. Consumer preferences for written and oral information about allergens when eating out. PloS one 11, 5 (May 2016), e0156073. https://doi.org/10.1371/journal.pone.0156073",
      "doi": ""
    },
    {
      "text": "Mary E Bollinger, Lynnda M Dahlquist, Kim Mudd, Claire Sonntag, Lindsay Dillinger, and Kristine McKenna. 2006. The impact of food allergy on the daily activities of children and their families. Annals of Allergy, Asthma & Immunology 96, 3 (March 2006), 415–421. https://doi.org/10.1016/S1081-1206(10)60908-8",
      "doi": ""
    },
    {
      "text": "Joshua A Boyce, Amal Assa’ad, A Wesley Burks, Stacie M Jones, Hugh A Sampson, Robert A Wood, Marshall Plaut, Susan F Cooper, Matthew J Fenton, S Hasan Arshad, 2011. Guidelines for the diagnosis and management of food allergy in the United States: summary of the NIAID-sponsored expert panel report. Journal of the American Academy of Dermatology 64, 1(2011), 175–192. https://doi.org/10.1016/j.jaci.2010.10.008",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2012. Thematic analysis.In APA handbook of research methods in psychology, Vol 2: Research designs: Quantitative, qualitative, neuropsychological, and biological.American Psychological Association, Washington, DC, US, 57–71. https://doi.org/10.1037/13620-004",
      "doi": ""
    },
    {
      "text": "Jill Brierly, Catherine Strohbehn, Sam Beattie, and Diane Nelson. 2008. Food Allergy Alert—What Restaurant Managers Need to Know to Train Staff. Technical Report. Iowa State University Extension and Outreach. 4 pages. https://lib.dr.iastate.edu/extension_families_pubs/54",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing Grounded Theory: A Practical Guide Through Qualitative Analysis. Sage Publications Ltd, Thousand Oaks, California.",
      "doi": ""
    },
    {
      "text": "Rok Son Choung and Nicholas J Talley. 2006. Food Allergy and Intolerance in IBS.Gastroenterology & hepatology 2, 10 (2006), 756–760.",
      "doi": ""
    },
    {
      "text": "Antonella Cianferoni and Jonathan M Spergel. 2009. Food allergy: review, classification and diagnosis. Allergology International 58, 4 (2009), 457–466. https://doi.org/10.2332/allergolint.09-RAI-0138",
      "doi": ""
    },
    {
      "text": "Egbert Clevers, Hans Törnblom, Magnus Simrén, Jan Tack, and Lukas Van Oudenhove. 2019. Relations between food intake, psychological distress, and gastrointestinal symptoms: A diary study. United European gastroenterology journal 7, 7 (2019), 965–973. https://doi.org/10.1177/2050640619839859",
      "doi": ""
    },
    {
      "text": "Benjamin L Cohen, Sally Noone, Anne Muñoz-Furlong, and Scott H Sicherer. 2004. Development of a questionnaire to measure quality of life in families with a child with food allergy. Journal of Allergy and Clinical Immunology 114, 5 (Nov. 2004), 1159–1163. https://doi.org/10.1016/j.jaci.2004.08.007",
      "doi": ""
    },
    {
      "text": "Ahmet F Coskun, Justin Wong, Delaram Khodadadi, Richie Nagi, Andrew Tey, and Aydogan Ozcan. 2013. A personalized food allergen testing platform on a cellphone. Lab on a Chip 13, 4 (2013), 636–640.",
      "doi": ""
    },
    {
      "text": "Council of European Union. 2011. Regulation (EU) No 1169/2011. https://eur-lex.europa.eu/eli/reg/2011/1169/2018-01-01",
      "doi": ""
    },
    {
      "text": "Sheila E Crowe. 2019. Food allergy vs food intolerance in patients with irritable bowel syndrome. Gastroenterology & hepatology 15, 1 (2019), 38.",
      "doi": ""
    },
    {
      "text": "Andrew J Cummings, Rebecca C Knibb, RM King, and JS Lucas. 2010. The psychosocial impact of food allergy and food hypersensitivity in children, adolescents and their families: a review. Allergy 65, 8 (July 2010), 933–945. https://doi.org/10.1111/j.1398-9995.2010.02342.x",
      "doi": ""
    },
    {
      "text": "A Justine Dowd, Cassandra B Warbeck, Karen TY Tang, Tak Fung, and S Nicole Culos-Reed. 2020. MyHealthyGut: Findings from a pilot randomized controlled trial on adherence to a gluten-free diet and quality of life among adults with celiac disease or gluten intolerance. Digital Health 6(2020), 2055207620903627.",
      "doi": ""
    },
    {
      "text": "Audrey DunnGalvin, Katharina Blumchen, Frans Timmermans, Lynne Regent, Sabine Schnadt, Marcia Podestà, Angel Sánchez, Pascale Couratier, Mary Feeney, Betina Hjorth, 2020. APPEAL-1: A multiple-country European survey assessing the psychosocial impact of peanut allergy. Allergy 75, 11 (2020), 2899–2908.",
      "doi": ""
    },
    {
      "text": "Motohiro Ebisawa. 2011. Food-induced Anaphylaxis and Food Associated Exercise-induced Anaphylaxis. James J, M, Burks AW, Eigenmann PA, eds. Food Allergy 1 (2011), 113–126.",
      "doi": ""
    },
    {
      "text": "Amy Fedewa and Satish SC Rao. 2014. Dietary fructose intolerance, fructan intolerance and FODMAPs. Current gastroenterology reports 16, 1 (2014), 370. https://doi.org/10.1007/s11894-013-0370-0",
      "doi": ""
    },
    {
      "text": "Charles Feng and Jea-Hyoun Kim. 2019. Beyond avoidance: the psychosocial impact of food allergies. Clinical reviews in allergy & immunology 57, 1 (2019), 74–82.",
      "doi": ""
    },
    {
      "text": "Terence J Furlong, Jennifer DeSimonea, and Scott H Sicherer. 2001. Peanut and tree nut allergic reactions in restaurants and other food establishments. Journal of Allergy and Clinical Immunology 108, 5 (Nov. 2001), 867–870. https://doi.org/10.1067/mai.2001.119157",
      "doi": ""
    },
    {
      "text": "Simon Goisser, Heike Mempel, and Vera Bitsch. 2019. Potential Applications of Food-Scanners in Fruit and Vegetable Supply Chains and Possible Consequences for the German Market. In Proceedings in Food System Dynamics. International Journal on Food System Dynamics, Bonn, Germany, 173–181. https://doi.org/10.18461/pfsd.2019.1917",
      "doi": ""
    },
    {
      "text": "Nicole J Goossens, Bertine MJ Flokstra-de Blok, Gerbrich N van der Meulen, Marianne H Arnlind, Ricardo Asero, Laura Barreales, Peter Burney, Imnaculada Cerecedo, Michael Clausen, Monteserrat Fernandéz-Rivas, 2014. Health-related quality of life in food-allergic adults from eight European countries. Annals of Allergy, Asthma & Immunology 113, 1 (2014), 63–68. https://doi.org/10.1016/j.anai.2014.04.004",
      "doi": ""
    },
    {
      "text": "Kristina Grifantini. 2016. Knowing what you eat: Researchers are looking for ways to help people cope with food allergies. IEEE pulse 7, 5 (2016), 31–34. https://doi.org/10.1109/MPUL.2016.2592239",
      "doi": ""
    },
    {
      "text": "R Gupta, A Sheikh, DP Strachan, and HRi Anderson. 2004. Burden of allergic disease in the UK: secondary analyses of national databases. Clinical & Experimental Allergy 34, 4 (April 2004), 520–526. https://doi.org/10.1111/j.1365-2222.2004.1935.x",
      "doi": ""
    },
    {
      "text": "Ruchi S Gupta, Jennifer S Kim, Julia A Barnathan, Laura B Amsden, Lakshmi S Tummala, and Jane L Holl. 2008. Food allergy knowledge, attitudes and beliefs: focus groups of parents, physicians and the general public. BMC pediatrics 8, 1 (2008), 36. https://doi.org/10.1186/1471-2431-8-36",
      "doi": ""
    },
    {
      "text": "Ruchi S Gupta, Elizabeth E Springston, Manoj R Warrier, Bridget Smith, Rajesh Kumar, Jacqueline Pongracic, and Jane L Holl. 2011. The prevalence, severity, and distribution of childhood food allergy in the United States. Pediatrics 128, 1 (2011), e9–e17.",
      "doi": ""
    },
    {
      "text": "healthline. 2018. Anaphylactic Shock: Symptoms, Causes, and Treatment. Retrieved September 14, 2018 from https://www.healthline.com/health/anaphylactic-shock",
      "doi": ""
    },
    {
      "text": "Monique M. Hennink, Bonnie N. Kaiser, and Vincent C. Marconi. 2017. Code Saturation Versus Meaning Saturation: How Many Interviews Are Enough?Qualitative Health Research 27, 4 (2017), 591–608. https://doi.org/10.1177/1049732316665344",
      "doi": ""
    },
    {
      "text": "Karen Henricksen and Stephen Viller. 2012. Design of Software to Support Families with Food-allergic and Food-intolerant Children. In Proceedings of the 24th Australian Computer-Human Interaction Conference (Melbourne, Australia) (OzCHI ’12). ACM, New York, NY, USA, 194–203. https://doi.org/10.1145/2414536.2414571",
      "doi": "10.1145/2414536.2414571"
    },
    {
      "text": "Luis U Hernandez-Munoz, Sandra I Woolley, David Luyt, Gary Stiefel, Kerrie Kirk, Nick Makwana, Cathryn Melchior, Tom C Dawson, Gabriel Wong, Tim Collins, 2017. Evaluation of AllergiSense smartphone tools for adrenaline injection training. IEEE journal of biomedical and health informatics 21, 1(2017), 272–282. https://doi.org/10.1109/JBHI.2015.2497717",
      "doi": ""
    },
    {
      "text": "Paris (Pei-Ting) Hsu, Jingshu Zhao, Kehan Liao, Tianyi Liu, and Chen Wang. 2017. AllergyBot: A Chatbot Technology Intervention for Young Adults with Food Allergies Dining Out. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI EA ’17). ACM, New York, NY, USA, 74–79. https://doi.org/10.1145/3027063.3049270",
      "doi": "10.1145/3027063.3049270"
    },
    {
      "text": "Pat Hurst. 2018. Student with dairy allergy ’died from eating chicken burger marinated in buttermilk’. https://www.independent.co.uk/news/uk/home-news/shahida-shahid-inquest-dairy-allergy-buttermilk-chicken-burger-death-manchester-almost-famous-restaurant-a8149646.html",
      "doi": ""
    },
    {
      "text": "Kristen D. Jackson, LaJeana D. Howie, and Lara J. Akinbami. 2013. Trends in allergic conditions among children: United States, 1997-2011.Technical Report 121. National Center for Health Statistics. 1–8 pages.",
      "doi": ""
    },
    {
      "text": "SGO Johansson, JO’B Hourihane, Jr Bousquet, C Bruijnzeel-Koomen, S Dreborg, T Haahtela, ML Kowalski, N Mygind, J Ring, Paul Van Cauwenberge, 2001. A revised nomenclature for allergy: an EAACI position statement from the EAACI nomenclature task force. Allergy 56, 9 (2001), 813–824. https://doi.org/10.1111/j.1398-9995.2001.00002.x-i1",
      "doi": ""
    },
    {
      "text": "S Kapoor, G Roberts, Y Bynoe, M Gaughan, P Habibi, and G Lack. 2004. Influence of a multidisciplinary paediatric allergy clinic on parental knowledge and rate of subsequent allergic reactions. Allergy 59, 2 (2004), 185–191. https://doi.org/10.1046/j.1398-9995.2003.00365.x",
      "doi": ""
    },
    {
      "text": "Ravi Karkar, Jessica Schroeder, Daniel A. Epstein, Laura R. Pina, Jeffrey Scofield, James Fogarty, Julie A. Kientz, Sean A. Munson, Roger Vilardaga, and Jasmine Zia. 2017. TummyTrials: A Feasibility Study of Using Self-Experimentation to Detect Individualized Food Triggers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 6850–6863. https://doi.org/10.1145/3025453.3025480",
      "doi": "10.1145/3025453.3025480"
    },
    {
      "text": "Ravi Karkar, Jasmine Zia, Roger Vilardaga, Sonali R Mishra, James Fogarty, Sean A Munson, and Julie A Kientz. 2016. A framework for self-experimentation in personalized health. Journal of the American Medical Informatics Association 23, 3(2016), 440–448. https://doi.org/10.1093/jamia/ocv150",
      "doi": ""
    },
    {
      "text": "Lars Lange. 2014. Quality of life in the setting of anaphylaxis and food allergy. Allergo journal international 23, 7 (Nov. 2014), 252–260. https://doi.org/10.1007/s40629-014-0029-x",
      "doi": ""
    },
    {
      "text": "J Leftwich, J Barnett, K Muncer, R Shepherd, MM Raats, M Hazel Gowland, and JS Lucas. 2011. The challenges for nut-allergic consumers of eating out. Clinical & Experimental Allergy 41, 2 (2011), 243–249. https://doi.org/10.1111/j.1365-2222.2010.03649.x",
      "doi": ""
    },
    {
      "text": "Jay A Lieberman and Scott H Sicherer. 2011. Quality of life in food allergy. Current opinion in allergy and clinical immunology 11, 3 (June 2011), 236–242. https://doi.org/10.1097/ACI.0b013e3283464cf0",
      "doi": ""
    },
    {
      "text": "Leslie S. Liu, Jina Huh, Tina Neogi, Kori Inkpen, and Wanda Pratt. 2013. Health Vlogger-Viewer Interaction in Chronic Illness Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 49–58. https://doi.org/10.1145/2470654.2470663",
      "doi": "10.1145/2470654.2470663"
    },
    {
      "text": "John Lofland, David A. Snow, Leon Anderson, and Lyn H. Lofland. 2005. Analyzing Social Settings: A Guide to Qualitative Observation and Analysis (4th ed.). Wadsworth Publishing, Belmont, CA, USA.",
      "doi": ""
    },
    {
      "text": "MCE Lomer. 2015. The aetiology, diagnosis, mechanisms and clinical evidence for food intolerance. Alimentary pharmacology & therapeutics 41, 3 (2015), 262–275. https://doi.org/10.1111/apt.13041",
      "doi": ""
    },
    {
      "text": "Carlos Lozoya-Ibáñez, Sara Morgado-Nunes, Alexandra Rodrigues, Cláudia Lobo, and Luis Taborda-Barata. 2016. Prevalence and clinical features of adverse food reactions in Portuguese adults. Allergy, Asthma & Clinical Immunology 12, 1 (Aug. 2016), 36. https://doi.org/10.1186/s13223-016-0139-8",
      "doi": ""
    },
    {
      "text": "Heather MacKenzie, Graham Roberts, Darren Van Laar, and Taraneh Dean. 2010. Teenagers’ experiences of living with food hypersensitivity: a qualitative study. Pediatric Allergy and Immunology 21, 4p1 (June 2010), 595–602. https://doi.org/10.1111/j.1399-3038.2009.00938.x",
      "doi": ""
    },
    {
      "text": "Evelina Maines, Annunziata Di Palma, and Alberto Burlina. 2018. Food triggers and inherited metabolic disorders: a challenge to the pediatrician. Italian journal of pediatrics 44, 1 (2018), 18. https://doi.org/10.1186/s13052-018-0456-2",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth D. Mynatt, and David R. Kaufman. 2006. Investigating Health Management Practices of Individuals with Diabetes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 927–936. https://doi.org/10.1145/1124772.1124910",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "Deena Mandell, Ruth Curtis, Milton Gold, and Susan Hardie. 2005. Anaphylaxis: how do you live with it?Health & social work 30, 4 (Nov. 2005), 325–335. https://doi.org/10.1093/hsw/30.4.325",
      "doi": ""
    },
    {
      "text": "Pasquale Mansueto, Alberto D’Alcamo, Aurelio Seidita, and Antonio Carroccio. 2015. Food allergy in irritable bowel syndrome: The case of non-celiac wheat sensitivity. World Journal of Gastroenterology: WJG 21, 23 (2015), 7089. https://doi.org/10.3748/wjg.v21.i23.7089",
      "doi": ""
    },
    {
      "text": "Vicki L McWilliam, Jennifer J Koplin, Michael J Field, Mari Sasaki, Shyamali C Dharmage, Mimi LK Tang, Susan M Sawyer, Rachel L Peters, Katrina J Allen, 2018. Self-reported adverse food reactions and anaphylaxis in the SchoolNuts study: a population-based study of adolescents. Journal of Allergy and Clinical Immunology 141, 3 (2018), 982–990.",
      "doi": ""
    },
    {
      "text": "A Muraro, I Agache, A Clark, A Sheikh, G Roberts, CA Akdis, LM Borrego, J Higgs, J O’B Hourihane, P Jorgensen, 2014. EAACI food allergy and anaphylaxis guidelines: managing patients with food allergy in the community. Allergy 69, 8 (June 2014), 1046–1057. https://doi.org/10.1111/all.12441",
      "doi": ""
    },
    {
      "text": "NHS. 2019. Coeliac disease. https://www.nhs.uk/conditions/coeliac-disease/",
      "doi": ""
    },
    {
      "text": "NHS. 2019. Food Allergy. https://www.nhs.uk/conditions/food-allergy/",
      "doi": ""
    },
    {
      "text": "NHS. 2019. Food intolerance. https://www.nhs.uk/conditions/food-intolerance/",
      "doi": ""
    },
    {
      "text": "NHS. 2019. Loneliness in older people. https://www.nhs.uk/conditions/stress-anxiety-depression/loneliness-in-older-people/",
      "doi": ""
    },
    {
      "text": "Francisco Nunes and Geraldine Fitzpatrick. 2018. Understanding the Mundane Nature of Self-Care: Ethnographic Accounts of People Living with Parkinson’s. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3173574.3173976",
      "doi": "10.1145/3173574.3173976"
    },
    {
      "text": "Francisco Nunes, Nervo Verdezoto, Geraldine Fitzpatrick, Morten Kyng, Erik Grönvall, and Cristiano Storni. 2015. Self-Care Technologies in HCI: Trends, Tensions, and Opportunities. ACM Trans. Comput.-Hum. Interact. 22, 6, Article 33 (Dec. 2015), 45 pages. https://doi.org/10.1145/2803173",
      "doi": "10.1145/2803173"
    },
    {
      "text": "Aisling Ann O’Kane, Abdinasir Aliomar, Rebecca Zheng, Britta Schulte, and Gianluca Trombetta. 2019. Social, Cultural and Systematic Frustrations Motivating the Formation of a DIY Hearing Loss Hacking Community. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300531",
      "doi": "10.1145/3290605.3300531"
    },
    {
      "text": "Aisling Ann O’Kane, Yvonne Rogers, and Ann E. Blandford. 2015. Concealing or Revealing Mobile Medical Devices? Designing for Onstage and Offstage Presentation. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1689–1698. https://doi.org/10.1145/2702123.2702453",
      "doi": "10.1145/2702123.2702453"
    },
    {
      "text": "Tom Owen, George Buchanan, and Harold Thimbleby. 2012. Understanding User Requirements in Take-Home Diabetes Management Technologies. In Proceedings of the 26th Annual BCS Interaction Specialist Group Conference on People and Computers (Birmingham, United Kingdom) (BCS-HCI ’12). BCS Learning & Development Ltd., Swindon, GBR, 268–273.",
      "doi": "10.5555/2377916.2377950"
    },
    {
      "text": "Aisling Ann O’Kane, Sun Young Park, Helena Mentis, Ann Blandford, and Yunan Chen. 2016. Turning to peers: integrating understanding of the self, the condition, and others’ experiences in making sense of complex chronic conditions. Computer Supported Cooperative Work (CSCW) 25, 6 (2016), 477–501.",
      "doi": "10.1007/s10606-016-9260-y"
    },
    {
      "text": "Parlamento Português. 2009. Código do Trabalho Lei n.º 7/2009 [Work law n.º 7/2009]. Issue 30/2009, Série I de 2009-02-12. https://dre.pt/web/guest/legislacao-consolidada/-/lc/view?cid=75194475",
      "doi": ""
    },
    {
      "text": "Parlamento Português. 2016. Decreto-Lei n.º 26/2016 [Decree-Law n.º 26/2016]. Issue 111/2016, Série I de 2016-06-09. https://data.dre.pt/eli/dec-lei/26/2016/06/09/p/dre/pt/html",
      "doi": ""
    },
    {
      "text": "MQ Patton. 2001. Qualitative research and evaluation methods (3: e uppl.).",
      "doi": ""
    },
    {
      "text": "Ruby Pawankar, Giorgio W Canonica, Stephen T Holgate, and Richard F Lockey. 2012. Allergic diseases and asthma: a major global health concern. Current opinion in allergy and clinical immunology 12, 1 (Feb. 2012), 39–41. https://doi.org/10.1097/ACI.0b013e32834ec13b",
      "doi": ""
    },
    {
      "text": "Rana Lori Peniamina, Philip Bremer, Tamlin S Conner, and Miranda Mirosa. 2014. Understanding the needs of food-allergic adults. Qualitative health research 24, 7 (2014), 933–945. https://doi.org/10.1177/1049732314539733",
      "doi": ""
    },
    {
      "text": "Carla M Perissinotto, Irena Stijacic Cenzer, and Kenneth E Covinsky. 2012. Loneliness in older persons: a predictor of functional decline and death. Archives of internal medicine 172, 14 (July 2012), 1078–1083. https://doi.org/10.1001/archinternmed.2012.1993",
      "doi": ""
    },
    {
      "text": "Emma Pitchforth, Simon Weaver, Janet Willars, Emilia Wawrzkowicz, David Luyt, and Mary Dixon-Woods. 2011. A qualitative study of families of a child with a nut allergy. Chronic illness 7, 4 (2011), 255–266. https://doi.org/10.1177/1742395311411591",
      "doi": ""
    },
    {
      "text": "Jeannette Pols. 2014. Knowing Patients: Turning Patient Knowledge into Science. Science, Technology & Human Values 39, 1 (2014), 73–97. https://doi.org/10.1177/0162243913504306",
      "doi": ""
    },
    {
      "text": "Jenny Preece. 1999. Empathic communities: balancing emotional and factual communication. Interacting with Computers 12, 1 (1999), 63 – 77. https://doi.org/10.1016/S0953-5438(98)00056-3",
      "doi": ""
    },
    {
      "text": "Taylor J Radke, Laura G Brown, E Rickamer Hoover, Brenda V Faw, David Reimann, Melissa R Wong, David Nicholas, Jonathan Barkley, and Danny Ripley. 2016. Food allergy knowledge and attitudes of restaurant managers and staff: an EHS-Net study. Journal of food protection 79, 9 (Feb. 2016), 1588–1598. https://doi.org/10.4315/0362-028X.JFP-16-085",
      "doi": ""
    },
    {
      "text": "Food Allergy Research and Education. 2020. Restaurants. https://www.foodallergy.org/resources/restaurants",
      "doi": ""
    },
    {
      "text": "Margaret A Sampson, Anne Muñoz-Furlong, and Scott H Sicherer. 2006. Risk-taking and coping strategies of adolescents and young adults with food allergy. Journal of Allergy and Clinical Immunology 117, 6 (June 2006), 1440–1445. https://doi.org/10.1016/j.jaci.2006.03.009",
      "doi": ""
    },
    {
      "text": "Graham Scambler and Anthony Hopkins. 1986. Being epileptic: coming to terms with stigma. Sociology of health & illness 8, 1 (1986), 26–43. https://doi.org/10.1111/1467-9566.ep11346455",
      "doi": ""
    },
    {
      "text": "Jessica Schroeder, Chia-Fang Chung, Daniel A. Epstein, Ravi Karkar, Adele Parsons, Natalia Murinova, James Fogarty, and Sean A. Munson. 2018. Examining Self-Tracking by People with Migraine: Goals, Needs, and Opportunities in a Chronic Health Condition. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 135–148. https://doi.org/10.1145/3196709.3196738",
      "doi": "10.1145/3196709.3196738"
    },
    {
      "text": "Ashika Sharma, Tracy Prematta, and Tracy Fausnight. 2012. A pediatric food allergy support group can improve parent and physician communication: results of a parent survey.Journal of allergy 2012(2012), 168053. https://doi.org/10.1155/2012/168053",
      "doi": ""
    },
    {
      "text": "Scott H Sicherer, Anne Muñoz-Furlong, James H Godbold, and Hugh A Sampson. 2010. US prevalence of self-reported peanut, tree nut, and sesame allergy: 11-year follow-up. Journal of Allergy and Clinical Immunology 125, 6 (2010), 1322–1326. https://doi.org/10.1016/j.jaci.2010.03.029",
      "doi": ""
    },
    {
      "text": "Prashant Singh, Ananya Arora, Tor A Strand, Daniel A Leffler, Carlo Catassi, Peter H Green, Ciaran P Kelly, Vineet Ahuja, and Govind K Makharia. 2018. Global prevalence of celiac disease: systematic review and meta-analysis. Clinical Gastroenterology and Hepatology 16, 6 (2018), 823–836. https://doi.org/10.1016/j.cgh.2017.06.037",
      "doi": ""
    },
    {
      "text": "Cristiano Storni. 2011. Complexity in an Uncertain and Cosmopolitan World. Rethinking Personal Health Technology in Diabetes with the Tag-it-Yourself. PsychNology Journal 9, 2 (2011), 165–185.",
      "doi": ""
    },
    {
      "text": "Food Allergy & Anaphylaxis Connection Team. 2017. government relations: statewide restaurant legislation. https://www.foodallergyawareness.org/government-relations/statewide-restaurant-legislation/#:~:text=Under the new laws, restaurants,party has a food allergy",
      "doi": ""
    },
    {
      "text": "Caroline Tuck and Jacqueline Barrett. 2017. Re-challenging FODMAPs: the low FODMAP diet phase two. Journal of gastroenterology and hepatology 32 (2017), 11–15. https://doi.org/10.1111/jgh.13687",
      "doi": ""
    },
    {
      "text": "Turismo de Portugal, I.P. 2020. Mediterranean Diet. https://www.visitportugal.com/en/node/199728",
      "doi": ""
    },
    {
      "text": "Fenna Van Nes, Tineke Abma, Hans Jonsson, and Dorly Deeg. 2010. Language differences in qualitative research: is meaning lost in translation?European journal of ageing 7, 4 (2010), 313–316. https://doi.org/10.1007/s10433-010-0168-y",
      "doi": ""
    },
    {
      "text": "WebMD. 2020. Lactase: Uses, Side Effects, Interactions, Dosage, and Warning. https://www.webmd.com/vitamins/ai/ingredientmono-540/lactase",
      "doi": ""
    },
    {
      "text": "Han Wen, Eunhye Park, Chen-Wei Tao, Bongsug Chae, Xiaoye Li, and Junehee Kwon. 2020. Exploring user-generated content related to dining experiences of consumers with food allergies. International Journal of Hospitality Management 85 (2020), 102357. https://doi.org/10.1016/j.ijhm.2019.102357",
      "doi": ""
    },
    {
      "text": "Paul Wicks, Michael Massagli, Jeana Frost, Catherine Brownstein, Sally Okun, Timothy Vaughan, Richard Bradley, and James Heywood. 2010. Sharing health data for better outcomes on PatientsLikeMe. Journal of medical Internet research 12, 2 (2010), e19. https://doi.org/10.2196/jmir.1549",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2020. Portuguese cuisine. https://en.wikipedia.org/w/index.php?title=Portuguese_cuisine&oldid=996821480",
      "doi": ""
    },
    {
      "text": "Kids with food allergies. 2014. What is a Food Allergy? There Are Different Types of Allergic Reactions to Foods. Retrieved January 3, 2018 from http://www.kidswithfoodallergies.org/page/what-is-a-food-allergy.aspx",
      "doi": ""
    },
    {
      "text": "Xueyin Zhao, Xiaochen Xu, Xiuyan Li, Xi He, Yang Yang, and Shankuan Zhu. 2020. Emerging trends of technology-based dietary assessment: a perspective study. European Journal of Clinical Nutrition (Oct. 2020), 6. https://doi.org/10.1038/s41430-020-00779-0",
      "doi": ""
    },
    {
      "text": "Yurdagül Zopf, Eckhart G Hahn, Martin Raithel, Hanns-Wolf Baenkler, and Andrea Silbermann. 2009. The differential diagnosis of food intolerance. Deutsches Ärzteblatt International 106, 21 (2009), 359. https://doi.org/10.3238/arztebl.2009.0359",
      "doi": ""
    }
  ]
}