{
  "doi": "10.1145/3411764.3445585",
  "title": "When the Tab Comes Due:Challenges in the Cost Structure of Browser Tab Usage",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Tabs have become integral to browsing the Web yet have changed little since their introduction nearly 20 years ago. In contrast, the internet has gone through dramatic changes, with users increasingly moving from navigating to websites to exploring information across many sources to support online sensemaking. This paper investigates how tabs today are overloaded with a diverse set of functionalities and issues users face when managing them. We interviewed ten information workers asking about their tab management strategies and walk through each open tab on their work computers four times over two weeks. We uncovered competing pressures pushing for keeping tabs open (ranging from interaction to emotional costs) versus pushing for closing them (such as limited attention and resources). We then surveyed 103 participants to estimate the frequencies of these pressures at scale. Finally, we developed design implications for future browser interfaces that can better support managing these pressures.",
  "authors": [
    {
      "name": "Joseph Chee Chang",
      "institution": "Carnegie Mellon University HCII and LTI, United States",
      "img": "/do/10.1145/contrib-99659020706/rel-imgonly/me.jpeg",
      "acmid": "99659020706",
      "orcid": "0000-0002-0798-4351"
    },
    {
      "name": "Nathan Hahn",
      "institution": "Human Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020675",
      "orcid": "missing"
    },
    {
      "name": "Yongsung Kim",
      "institution": "Human-Computer Interaction Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701800",
      "orcid": "missing"
    },
    {
      "name": "Julina Coupland",
      "institution": "Human-Computer Interaction Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444595349",
      "orcid": "missing"
    },
    {
      "name": "Bradley Breneisen",
      "institution": "Human Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701603",
      "orcid": "missing"
    },
    {
      "name": "Hannah S Kim",
      "institution": "Human-Computer Interaction Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701372",
      "orcid": "missing"
    },
    {
      "name": "John Hwong",
      "institution": "Human-Computer Interaction Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701898",
      "orcid": "missing"
    },
    {
      "name": "Aniket Kittur",
      "institution": "Human-Computer Interaction Institute, United States",
      "img": "/do/10.1145/contrib-81350583094/rel-imgonly/kittur_photo.jpg",
      "acmid": "81350583094",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "alan d baddeley and graham hitch. 1974. working memory. psychology of learning and motivation 8 (1974), 47–89.",
      "doi": ""
    },
    {
      "text": "jeremy birnholtz, graham dixon, and jeffrey hancock. 2012. distance, ambiguity and appropriation: structures affording impression management in a collocated organization. computers in human behavior 28, 3 (2012), 1028–1035.",
      "doi": ""
    },
    {
      "text": "Richard E Boyatzis. 1998. Transforming qualitative information: Thematic analysis and code development. sage publications, inc, Thousand Oaks, California, United States.",
      "doi": ""
    },
    {
      "text": "Andrew Bragdon, Robert Zeleznik, Steven P Reiss, Suman Karumuri, William Cheung, Joshua Kaplan, Christopher Coleman, Ferdi Adeputra, and Joseph J LaViola Jr. 2010. Code bubbles: a working set-based interface for code understanding and maintenance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2503–2512.",
      "doi": "10.1145/1753326.1753706"
    },
    {
      "text": "Stuart K Card, George G Robertson, and William York. 1996. The WebBook and the Web Forager: an information workspace for the World-Wide Web. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, New York, NY, USA, 111–ff.",
      "doi": "10.1145/238386.238446"
    },
    {
      "text": "lara d catledge and james e pitkow. 1995. characterizing browsing strategies in the world-wide web. computer networks and isdn systems 27, 6 (1995), 1065–1073.",
      "doi": ""
    },
    {
      "text": "Joseph Chee Chang, Nathan Hahn, and Aniket Kittur. 2016. Supporting Mobile Sensemaking Through Intentionally Uncertain Highlighting. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). ACM, New York, NY, USA, 61–68. https://doi.org/10.1145/2984511.2984538",
      "doi": "10.1145/2984511.2984538"
    },
    {
      "text": "Joseph Chee Chang, Nathan Hahn, and Aniket Kittur. 2020. Mesh: Scaffolding Comparison Tables for Online Decision Making. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20). Association for Computing Machinery, New York, NY, USA, 391–405. https://doi.org/10.1145/3379337.3415865",
      "doi": "10.1145/3379337.3415865"
    },
    {
      "text": "Joseph Chee Chang, Nathan Hahn, Adam Perer, and Aniket Kittur. 2019. SearchLens: Composing and capturing complex user interests for exploratory search. In Proceedings of the 24th International Conference on Intelligent User Interfaces. ACM, New York, NY, USA, 498–509.",
      "doi": "10.1145/3301275.3302321"
    },
    {
      "text": "Joseph Chee Chang, Aniket Kittur, and Nathan Hahn. 2016. Alloy: Clustering with Crowds and Computation. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (Santa Clara, California, USA) (CHI ’16). ACM, New York, NY, USA, 3180–3191. https://doi.org/10.1145/2858036.2858411",
      "doi": "10.1145/2858036.2858411"
    },
    {
      "text": "Gerardo Chowell and Kenji Mizumoto. 2020. The COVID-19 pandemic in the USA: what might we expect?The Lancet 395, 10230 (2020), 1093–1094.",
      "doi": ""
    },
    {
      "text": "Shelia R Cotten and Sipi S Gupta. 2004. Characteristics of online and offline health information seekers and factors that discriminate between them. Social science & medicine 59, 9 (2004), 1795–1806.",
      "doi": ""
    },
    {
      "text": "Robert DeLine and Kael Rowan. 2010. Code canvas: zooming towards better development environments. In Proceedings of the 32nd ACM/IEEE International Conference on Software Engineering-Volume 2. ACM, New York, NY, USA, 207–210.",
      "doi": "10.1145/1810295.1810331"
    },
    {
      "text": "Jacob Devlin, Ming-Wei Chang, Kenton Lee, and Kristina Toutanova. 2019. BERT: Pre-training of Deep Bidirectional Transformers for Language Understanding. In Proceedings of the 2019 Conference of the North American Chapter of the Association for Computational Linguistics: Human Language Technologies, Volume 1 (Long and Short Papers). Association for Computational Linguistics, Stroudsburg, Pennsylvania, United States, 4171–4186.",
      "doi": ""
    },
    {
      "text": "Patrick Dubroy and Ravin Balakrishnan. 2010. A Study of Tabbed Browsing Among Mozilla Firefox Users. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). ACM, New York, NY, USA, 673–682. https://doi.org/10.1145/1753326.1753426",
      "doi": "10.1145/1753326.1753426"
    },
    {
      "text": "Chrome Extension. 2017. TabSuspender. https://chrome.google.com/webstore/ detail/ tab-suspender/ fiabciakcmgepblmdkmemdbbkilneeeh. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "Chrome Extension. 2017. TheGreatSuspender. https://chrome.google.com/ webstore/detail/the-great-suspender/klbibkeccnjlkjkiokjodocebajanakg. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "Chrome Extension. 2017. vTabs. https://chrome.google.com/webstore/detail/vtabs/ okpnlgbgcfchbicbhjmmhldhkbkfilce. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "Chrome Extension. 2020. OneTab. https://chrome.google.com/webstore/detail/ onetab/chphlpgkkbolifaimnlloiipkdnihall. Accessed: 2020-09-10.",
      "doi": ""
    },
    {
      "text": "Chrome Extension. 2020. Workona. http://workona.com/. Accessed: 2020-09-15.",
      "doi": ""
    },
    {
      "text": "Chrome Extension. 2021. Save to Pocket. https://chrome.google.com/webstore/ detail/save-to-pocket/niloccemoadcdkdjlinkgdfekeahmflj. Accessed: 2021-01-07.",
      "doi": ""
    },
    {
      "text": "Chrome Extension. 2021. Search All Tabs. https://chrome.google.com/webstore/ detail/search-all-tabs/ndfnfhnlgoocpbbjjjfmiojdfcgcfomn. Accessed: 2021-01-08.",
      "doi": ""
    },
    {
      "text": "Chrome Extension. 2021. SessionBuddy. https://chrome.google.com/webstore/ detail/ session-buddy/edacconmaakjimmfgnblocblbcdcpbko. Accessed: 2021-01-07.",
      "doi": ""
    },
    {
      "text": "Chrome Extension. 2021. Toby. https://chrome.google.com/webstore/detail/ toby-for-chrome/hddnkoipeenegfoeaoibdmnaalmgkpip. Accessed: 2021-01-07.",
      "doi": ""
    },
    {
      "text": "Firefox Extension. 2017. Firefox Extension: Tree Style Tabs. https://addons.mozilla.org/en-US/firefox/addon/tree-style-tab/?src=search. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "James Fogarty, Scott E Hudson, Christopher G Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C Lee, and Jie Yang. 2005. Predicting human interruptibility with sensors. ACM Transactions on Computer-Human Interaction (TOCHI) 12, 1(2005), 119–146.",
      "doi": "10.1145/1057237.1057243"
    },
    {
      "text": "Susannah Fox, Lee Rainie, J Horrigan, A Lenhart, T Spooner, M Burke, O Lewis, and C Carter. 2000. The online health care revolution: How the Web helps Americans take better care of themselves. Pew Internet and American live project: Online life report. Retrieved July 21, 2005.",
      "doi": ""
    },
    {
      "text": "Life Hacker. 2012. Master Your Browsers Tabs with These Tricks and Extensions. http://lifehacker.com/5883299/master-your-browsers-tabs-with-these-tricks-and-extensions. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "Life Hacker. 2013. It’s Okay to Open More Than Nine Browser Tabs; Here’s How to Easily Manage Them. http://lifehacker.com/5985462/its-okay-to-open-more-than-nine-browser-tabs-you-just-need-to-manage-them-properly. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "Life Hacker. 2013. Why You Should Never Have More Than Nine Browser Tabs Open. http://lifehacker.com/5984149/why-you-should-never-have-more-than-nine-browser-tabs-open. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "Nathan Hahn, Joseph Chang, Ji Eun Kim, and Aniket Kittur. 2016. The Knowledge Accelerator: Big Picture Thinking in Small Pieces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (Santa Clara, California, USA) (CHI ’16). ACM, New York, NY, USA, 2258–2270. https://doi.org/10.1145/2858036.2858364",
      "doi": "10.1145/2858036.2858364"
    },
    {
      "text": "nathan hahn, joseph chee chang, and aniket kittur. 2018. bento browser: complex mobile search without tabs. In proceedings of the 2018 chi conference on human factors in computing systems. ACM, New York, NY, USA, 1–12.",
      "doi": ""
    },
    {
      "text": "Nathan Hahn, Shamsi T. Iqbal, and Jaime Teevan. 2019. Casual Microtasking. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI '19. ACM Press, New York, NY, USA, 9. https://doi.org/10.1145/3290605.3300249",
      "doi": ""
    },
    {
      "text": "Austin Z Henley and Scott D Fleming. 2014. The Patchworks code editor: Toward faster navigation with less code arranging and fewer navigation mistakes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2511–2520.",
      "doi": "10.1145/2556288.2557073"
    },
    {
      "text": "E Tory Higgins. 1989. Self-discrepancy theory: What patterns of self-beliefs cause people to suffer?In Advances in experimental social psychology. Vol. 22. Elsevier, Amsterdam, Netherlands, 93–136.",
      "doi": ""
    },
    {
      "text": "Eric Horvitz and Johnson Apacible. 2003. Learning and Reasoning about Interruption. In Proceedings of the 5th International Conference on Multimodal Interfaces (Vancouver, British Columbia, Canada) (ICMI ’03). Association for Computing Machinery, New York, NY, USA, 20–27. https://doi.org/10.1145/958432.958440",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "jeff huang, thomas lin, and ryen w white. 2012. no search result left behind: branching behavior with browser tabs. In proceedings of the fifth acm international conference on web search and data mining. acm, acm, new york, ny, usa, 203–212.",
      "doi": ""
    },
    {
      "text": "jeff huang and ryen w white. 2010. parallel browsing behavior on the web. In proceedings of the 21st acm conference on hypertext and hypermedia. acm, acm, new york, ny, usa, 13–18.",
      "doi": ""
    },
    {
      "text": "Doist Inc.2021. Todoist. https://todoist.com. Accessed: 2021-01-07.",
      "doi": ""
    },
    {
      "text": "rosie jones and kristina lisa klinkner. 2008. beyond the session timeout: automatic hierarchical segmentation of search topics in query logs. In proceedings of the 17th acm conference on information and knowledge management. acm, acm, new york, ny, usa, 699–708.",
      "doi": ""
    },
    {
      "text": "aniket kittur, ed h chi, and bongwon suh. 2008. crowdsourcing user studies with mechanical turk. In proceedings of the sigchi conference on human factors in computing systems. acm, new york, ny, usa, 453–456.",
      "doi": ""
    },
    {
      "text": "Aniket Kittur, Andrew M Peters, Abdigani Diriye, Trupti Telang, and Michael R Bove. 2013. Costs and benefits of structured information foraging. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, ACM, New York, NY, USA, 2989–2998.",
      "doi": "10.1145/2470654.2481415"
    },
    {
      "text": "Weize Kong, Michael Bendersky, Marc Najork, Brandon Vargo, and Mike Colagrosso. 2020. Learning to Cluster Documents into Workspaces Using Large Scale Activity Logs. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining (Virtual Event, CA, USA) (KDD ’20). Association for Computing Machinery, New York, NY, USA, 2416–2424. https://doi.org/10.1145/3394486.3403291",
      "doi": "10.1145/3394486.3403291"
    },
    {
      "text": "Minchu Kulkarni, Kshitij Kapoor, Deva Surya Vivek Madala, Sanchit Bansal, and Sudheendra Hangal. 2019. Compartmentalizing web browsing with Sailboat. In Proceedings of the 10th Indian Conference on Human-Computer Interaction. ACM, New York, NY, USA, 1–8.",
      "doi": "10.1145/3364183.3364187"
    },
    {
      "text": "mark w lansdale. 1988. the psychology of personal information management. applied ergonomics 19, 1 (1988), 55–66.",
      "doi": ""
    },
    {
      "text": "Michael Xieyang Liu, Jane Hsieh, Nathan Hahn, Angelina Zhou, Emily Deng, Shaun Burley, Cynthia Taylor, Aniket Kittur, and Brad A Myers. 2019. Unakite: Scaffolding Developers’ Decision-Making Using the Web. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 67–80.",
      "doi": "10.1145/3332165.3347908"
    },
    {
      "text": "Gary Marchionini. 2006. Exploratory search: from finding to understanding. Commun. ACM 49, 4 (2006), 41–46.",
      "doi": "10.1145/1121949.1121979"
    },
    {
      "text": "Pablo N. Mendes, Max Jakob, Andrés García-Silva, and Christian Bizer. 2011. DBpedia Spotlight: Shedding Light on the Web of Documents. In Proceedings of the 7th International Conference on Semantic Systems (Graz, Austria) (I-Semantics ’11). Association for Computing Machinery, New York, NY, USA, 1–8. https://doi.org/10.1145/2063518.2063519",
      "doi": "10.1145/2063518.2063519"
    },
    {
      "text": "dan morris, meredith ringel morris, and gina venolia. 2008. searchbar: a search-centric web history for task resumption and information re-finding. In proceedings of the sigchi conference on human factors in computing systems. acm, acm, new york, ny, usa, 1207–1216.",
      "doi": ""
    },
    {
      "text": "Hacker News. 2018. Open tabs are cognitive spaces (rybakov.com). https://news.ycombinator.com/?id=16671957. Accessed: 2020-09-13.",
      "doi": ""
    },
    {
      "text": "Alon Orlitsky and Ananda Theertha Suresh. 2015. Competitive Distribution Estimation: Why is Good-Turing Good. In Advances in Neural Information Processing Systems, C. Cortes, N. Lawrence, D. Lee, M. Sugiyama, and R. Garnett (Eds.), Vol. 28. Curran Associates, Inc., 57 Morehouse Ln, Red Hook, NY 12571, United States, 2143–2151. https://proceedings.neurips.cc/paper/2015/file/d759175de8ea5b1d9a2660e45554894f-Paper.pdf",
      "doi": ""
    },
    {
      "text": "Jeffrey Pennington, Richard Socher, and Christopher D Manning. 2014. Glove: Global vectors for word representation. In Proceedings of the 2014 conference on empirical methods in natural language processing (EMNLP). Association for Computational Linguistics, Stroudsburg, Pennsylvania, United States, 1532–1543.",
      "doi": ""
    },
    {
      "text": "David J Piorkowski, Scott D Fleming, Irwin Kwan, Margaret M Burnett, Christopher Scaffidi, Rachel KE Bellamy, and Joshua Jordahl. 2013. The whats and hows of programmers’ foraging diets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 3063–3072.",
      "doi": "10.1145/2470654.2466418"
    },
    {
      "text": "Peter Pirolli and Stuart Card. 1999. Information foraging.Psychological review 106, 4 (1999), 643.",
      "doi": ""
    },
    {
      "text": "The Open Directory Project. 1998-2017. DMOZ: The Open Directory Project. https://www.dmoz.org/. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "Pradeep Racherla and Wesley Friske. 2012. Perceived ‘usefulness’ of online consumer reviews: An exploratory investigation across three services categories. Electronic Commerce Research and Applications 11, 6(2012), 548–559.",
      "doi": "10.1016/j.elerap.2012.06.003"
    },
    {
      "text": "Reddit. 2013. I have a serious problem with browser tab hoarding. https://www.reddit.com/r/declutter/comments/1jpw13/ i_have_a_serious_problem_with_browser_tab_hoarding/. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "Reddit. 2016. I’m a digital hoarder. I opened chrome to find all my tabs gone. I feel relieved.https://www.reddit.com/r/declutter/comments/4qkomc/ im_a_digital_hoarder_i_opened_chrome_to_find_all/. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "George Robertson, Mary Czerwinski, Kevin Larson, Daniel C Robbins, David Thiel, and Maarten Van Dantzich. 1998. Data mountain: using spatial memory for document management. In Proceedings of the 11th annual ACM symposium on User interface software and technology. ACM, New York, NY, USA, 153–162.",
      "doi": "10.1145/288392.288596"
    },
    {
      "text": "Barry Schwartz. 2004. The paradox of choice.",
      "doi": ""
    },
    {
      "text": "Barry Schwartz, Andrew Ward, John Monterosso, Sonja Lyubomirsky, Katherine White, and Darrin R Lehman. 2002. Maximizing versus satisficing: happiness is a matter of choice.Journal of personality and social psychology 83, 5(2002), 1178.",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of qualitative research: Techniques and procedures for developing grounded theory .sage publications, inc, Thousand Oaks, California, United States.",
      "doi": ""
    },
    {
      "text": "Bin Tan and Fuchun Peng. 2008. unsupervised query segmentation using generative language models and wikipedia. In Proceedings of the 17th international conference on World Wide Web. ACM, New York, NY, USA, 347–356.",
      "doi": "10.1145/1367497.1367545"
    },
    {
      "text": "linda tauscher and saul greenberg. 1997. how people revisit web pages: empirical findings and implications for the design of history systems. international journal of human-computer studies 47, 1 (1997), 97–137.",
      "doi": ""
    },
    {
      "text": "Vivaldi Technologies. 2020. Vivaldi Browser. https://vivaldi.com/. Accessed: 2020-09-10.",
      "doi": ""
    },
    {
      "text": "Jaime Teevan, Eytan Adar, Rosie Jones, and Michael AS Potts. 2007. Information re-retrieval: repeat queries in Yahoo’s logs. In Proceedings of the 30th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, New York, NY, USA, 151–158.",
      "doi": "10.1145/1277741.1277770"
    },
    {
      "text": "Jaime Teevan, Christine Alvarado, Mark S Ackerman, and David R Karger. 2004. The perfect search engine is not enough: a study of orienteering behavior in directed search. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, New York, NY, USA, 415–422.",
      "doi": "10.1145/985692.985745"
    },
    {
      "text": "amos tversky and daniel kahneman. 1991. loss aversion in riskless choice: a reference-dependent model. the quarterly journal of economics 106, 4 (1991), 1039–1061.",
      "doi": ""
    },
    {
      "text": "Chrome Product Updates. 2020. Keep tabs on your tabs in Google Chrome. https://blog.google/products/chrome/manage-tabs-with-google-chrome/. Accessed: 2020-09-15.",
      "doi": ""
    },
    {
      "text": "Frank Van Ham and Adam Perer. 2009. “Search, show context, expand on demand”: Supporting large graph exploration with degree-of-interest. IEEE Transactions on Visualization and Computer Graphics 15, 6(2009), 953–960.",
      "doi": "10.1109/TVCG.2009.108"
    },
    {
      "text": "Francesco Vitale, Izabelle Janzen, and Joanna McGrenere. 2018. Hoarding and Minimalism: Tendencies in Digital Data Preservation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174161",
      "doi": "10.1145/3173574.3174161"
    },
    {
      "text": "W3C, W3Counter. 2017. Web Browser Usage Trends. https://www.w3counter.com/trends. Accessed: 2017-09-10.",
      "doi": ""
    },
    {
      "text": "harald weinreich, hartmut obendorf, eelco herder, and matthias mayer. 2006. off the beaten tracks: exploring three aspects of web navigation. In proceedings of the 15th international conference on world wide web. acm, ACM, New York, NY, USA, 133–142.",
      "doi": ""
    },
    {
      "text": "harald weinreich, hartmut obendorf, eelco herder, and matthias mayer. 2008. not quite the average: an empirical study of web use. acm transactions on the web (tweb) 2, 1 (2008), 5.",
      "doi": ""
    },
    {
      "text": "Mozilla Wiki. 2020. Firefox Containers. https://wiki.mozilla.org/Security/ Contextual_Identity_Project/Containers. Accessed: 2021-01-08.",
      "doi": ""
    },
    {
      "text": "Alex C. Williams, Gloria Mark, Kristy Milland, Edward Lank, and Edith Law. 2019. The Perpetual Work Life of Crowdworkers: How Tooling Practices Increase Fragmentation in Crowdwork. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 24 (Nov. 2019), 28 pages. https://doi.org/10.1145/3359126",
      "doi": "10.1145/3359126"
    },
    {
      "text": "max l wilson 2008. improving exploratory search interfaces: adding value or information overload?. In Second Workshop on Human-Computer Interaction and Information Retrieval. Microsoft Research, Redmond, WA, USA, 81–84.",
      "doi": ""
    }
  ]
}