{
  "doi": "10.1145/3411764.3446863",
  "title": "The Effects of Warmth and Competence Perceptions on Users' Choice of an AI System",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "People increasingly rely on Artificial Intelligence (AI) based systems to aid decision-making in various domains and often face a choice between alternative systems. We explored the effects of users' perception of AI systems' warmth (perceived intent) and competence (perceived ability) on their choices. In a series of studies, we manipulated AI systems' warmth and competence levels. We show that, similar to the judgments of other people, there is often primacy for warmth over competence. Specifically, when faced with a choice between a high-competence system and a high-warmth system, more participants preferred the high-warmth system. Moreover, the precedence of warmth persisted even when the high-warmth system was overtly deficient in its competence compared to an alternative high competence-low warmth system. The current research proposes that it may be vital for AI systems designers to consider and communicate the system's warmth characteristics to its potential users.",
  "tags": [
    "Competence",
    "Warmth",
    "Artificial intelligence"
  ],
  "authors": [
    {
      "name": "Zohar Gilad",
      "institution": "IE&M Technion - Israel Institute of Technology, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702070",
      "orcid": "missing"
    },
    {
      "name": "Ofra Amir",
      "institution": "IE&M Technion - Israel Institute of Technology, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502722610",
      "orcid": "missing"
    },
    {
      "name": "Liat Levontin",
      "institution": "IE&M Technion - Israel Institute of Technology, Israel",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702184",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jennifer Aaker, Kathleen D. Vohs, and Cassie Mogilner. 2010. Nonprofits Are Seen as Warm and For-Profits as Competent: Firm Stereotypes Matter. J. Consum. Res. 37, 2 (August 2010), 224–237. DOI: https://doi.org/10.1086/651566",
      "doi": ""
    },
    {
      "text": "Alper Alan, Enrico Costanza, Joel Fischer, Sarvapali D. Ramchurn, Tom Rodden, and Nicholas R. Jennings. 2014. A Field Study of Human-Agent Interaction for Electricity Tariff Switching. In Proceedings of the 13th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2014), Paris, France, 965–972.",
      "doi": ""
    },
    {
      "text": "Claire E. Ashton-James, Tymour Forouzanfar, and Daniel Costa. 2019. The contribution of patientsʼ presurgery perceptions of surgeon attributes to the experience of trust and pain during third molar surgery. PAIN Reports 4, 3 (May 2019), e754. DOI: https://doi.org/10.1097/PR9.0000000000000754",
      "doi": ""
    },
    {
      "text": "Kirsten Bergmann, Friederike Eyssel, and Stefan Kopp. 2012. A Second Chance to Make a First Impression? How Appearance and Nonverbal Behavior Affect Perceived Warmth and Competence of Virtual Agents over Time. In Intelligent Virtual Agents, Springer, Berlin, Heidelberg, 126–138. DOI: https://doi.org/10.1007/978-3-642-33197-8_13",
      "doi": ""
    },
    {
      "text": "Anol Bhattacherjee. 2002. Individual Trust in Online Firms: Scale Development and Initial Test. J. Manag. Inf. Syst. 19, 1 (July 2002), 211–241. DOI: https://doi.org/10.1080/07421222.2002.11045715",
      "doi": ""
    },
    {
      "text": "Beatrice Biancardi, Chen Wang, Maurizio Mancini, Angelo Cafaro, Guillaume Chanel, and Catherine Pelachaud. 2019. A Computational Model for Managing Impressions of an Embodied Conversational Agent in Real-Time. In 2019 8th International Conference on Affective Computing and Intelligent Interaction (ACII), IEEE, 1–7. DOI: https://doi.org/10.1109/ACII.2019.8925495",
      "doi": ""
    },
    {
      "text": "Noah Castelo, Maarten W. Bos, and Donald R. Lehmann. 2019. Task-Dependent Algorithm Aversion. J. Mark. Res. 56, 5 (2019), 809–825. DOI: https://doi.org/10.1177/0022243719851788",
      "doi": ""
    },
    {
      "text": "Sam Corbett-Davies and Sharad Goel. 2018. The Measure and Mismeasure of Fairness: A Critical Review of Fair Machine Learning. (July 2018). Retrieved from http://arxiv.org/abs/1808.00023",
      "doi": ""
    },
    {
      "text": "Virginie Demeure, Radosław Niewiadomski, and Catherine Pelachaud. 2011. How Is Believability of a Virtual Agent Related to Warmth, Competence, Personification, and Embodiment? Presence Teleoperators Virtual Environ. 20, 5 (October 2011), 431–448. DOI: https://doi.org/10.1162/PRES_a_00065",
      "doi": "10.1162/PRES_a_00065"
    },
    {
      "text": "Berkeley J. Dietvorst, Joseph P. Simmons, and Cade Massey. 2015. Algorithm Aversion: People Erroneously Avoid Algorithms after Seeing Them Err. J. Exp. Psychol. Gen. 144, 1 (2015), 114–126. DOI: https://doi.org/10.1037/xge0000033",
      "doi": ""
    },
    {
      "text": "Finale Doshi-Velez and Been Kim. 2017. Towards A Rigorous Science of Interpretable Machine Learning. (February 2017). Retrieved from http://arxiv.org/abs/1702.08608",
      "doi": ""
    },
    {
      "text": "David Dubois, Derek D. Rucker, and Adam D. Galinsky. 2016. Dynamics of Communicator and Audience Power: The Persuasiveness of Competence versus Warmth. J. Consum. Res. 43, 1 (June 2016), 68–85. DOI: https://doi.org/10.1093/jcr/ucw006",
      "doi": ""
    },
    {
      "text": "Susan T. Fiske, Amy J. C. Cuddy, Peter Glick, and Jun Xu. 2002. A Model of (Often Mixed) Stereotype Content: Competence and Warmth Respectively Follow From Perceived Status and Competition. J. Pers. Soc. Psychol. 82, 6 (June 2002), 878–902. DOI: https://doi.org/10.1037/0022-3514.82.6.878",
      "doi": ""
    },
    {
      "text": "Susan T. Fiske, Amy J.C. Cuddy, and Peter Glick. 2007. Universal dimensions of social cognition: warmth and competence. Trends Cogn. Sci. 11, 2 (February 2007), 77–83. DOI: https://doi.org/10.1016/j.tics.2006.11.005",
      "doi": ""
    },
    {
      "text": "Sorelle A. Friedler, Carlos Scheidegger, Suresh Venkatasubramanian, Sonam Choudhary, Evan P. Hamilton, and Derek Roth. 2019. A comparative study of fairness-enhancing interventions in machine learning. In Proceedings of the Conference on Fairness, Accountability, and Transparency, ACM Press, New York, New York, USA, 329–338. DOI: https://doi.org/10.1145/3287560.3287589",
      "doi": "10.1145/3287560.3287589"
    },
    {
      "text": "Ella Glikson and Anita Williams Woolley. 2020. Human Trust in Artificial Intelligence: Review of Empirical Research. Acad. Manag. Ann. 14, 2 (July 2020), 627–660. DOI: https://doi.org/10.5465/annals.2018.0057",
      "doi": ""
    },
    {
      "text": "David Gunning. 2017. Explainable Artificial Intelligence (XAI). Def. Adv. Res. Proj. Agency (DARPA), nd Web 2, (2017), 2.",
      "doi": ""
    },
    {
      "text": "Kevin Anthony Hoff and Masooda Bashir. 2015. Trust in Automation: Integrating Empirical Evidence on Factors That Influence Trust. Hum. Factors J. Hum. Factors Ergon. Soc. 57, 3 (May 2015), 407–434. DOI: https://doi.org/10.1177/0018720814547570",
      "doi": ""
    },
    {
      "text": "Charles M. Judd, Laurie James-Hawkins, Vincent Yzerbyt, and Yoshihisa Kashima. 2005. Fundamental Dimensions of Social Judgment: Understanding the Relations Between Judgments of Competence and Warmth. J. Pers. Soc. Psychol. 89, 6 (2005), 899–913. DOI: https://doi.org/10.1037/0022-3514.89.6.899",
      "doi": ""
    },
    {
      "text": "Nicolas Kervyn, Vincent Y. Yzerbyt, Charles M. Judd, and Ana Nunes. 2009. A Question of Compensation: The Social Life of the Fundamental Dimensions of Social Perception. J. Pers. Soc. Psychol. 96, 4 (2009), 828–842. DOI: https://doi.org/10.1037/a0013320",
      "doi": ""
    },
    {
      "text": "Pranav Khadpe, Ranjay Krishna, Li Fei-Fei, Jeffrey T. Hancock, and Michael S. Bernstein. 2020. Conceptual Metaphors Impact Perceptions of Human-AI Collaboration. In Proceedings of the ACM on Human-Computer Interaction, 26 pages. DOI: https://doi.org/10.1145/3415234",
      "doi": ""
    },
    {
      "text": "Seo Young Kim, Bernd H. Schmitt, and Nadia M. Thalmann. 2019. Eliza in the uncanny valley: anthropomorphizing consumer robots increases their perceived warmth but decreases liking. Mark. Lett. 30, 1 (March 2019), 1–12. DOI: https://doi.org/10.1007/s11002-019-09485-9",
      "doi": ""
    },
    {
      "text": "Jon Kleinberg, Jens Ludwig, Sendhil Mullainathan, and Ashesh Rambachan. 2018. Algorithmic Fairness. AEA Pap. Proc. 108, (May 2018), 22–27. DOI: https://doi.org/10.1257/pandp.20181018",
      "doi": ""
    },
    {
      "text": "Philipp Kulms and Stefan Kopp. 2018. A Social Cognition Perspective on Human–Computer Trust: The Effect of Perceived Warmth and Competence on Trust in Decision-Making With Computers. Front. Digit. Humanit. 5, June (2018), 1–11. DOI: https://doi.org/10.3389/fdigh.2018.00014",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Sara Kielser, Jodi Forlizzi, Siddhartha Srinivasa, and Paul Rybski. 2010. Gracefully Mitigating Breakdowns in Robotic Services. In Proceeding of the 5th ACM/IEEE International Conference on Human-Robot Interaction (HRI), ACM Press, New York, New York, USA, 203–210. DOI: https://doi.org/10.1145/1734454.1734544",
      "doi": "10.5555/1734454.1734544"
    },
    {
      "text": "Michal Luria, Rebecca Zheng, Bennett Huffman, Shuangni Huang, John Zimmerman, and Jodi Forlizzi. 2020. Social Boundaries for Personal Agents in the Interpersonal Space of the Home. Conf. Hum. Factors Comput. Syst. - Proc. (2020), 1–12. DOI: https://doi.org/10.1145/3313831.3376311",
      "doi": ""
    },
    {
      "text": "Clifford Nass and Youngme Moon. 2000. Machines and Mindlessness: Social Responses to Computers. J. Soc. Issues 56, 1 (January 2000), 81–103. DOI: https://doi.org/10.1111/0022-4537.00153",
      "doi": ""
    },
    {
      "text": "Truong-Huy D Nguyen, Elin Carstensdottir, Nhi Ngo, Magy Seif El-Nasr, Matt Gray, Derek Isaacowitz, and David Desteno. 2015. Modeling Warmth and Competence in Virtual Characters. In International Conference on Intelligent Virtual Agents, Springer International Publishing, Cham, 167–180.",
      "doi": ""
    },
    {
      "text": "Richard E. Nisbett and Timothy D. Wilson. 1977. The Halo Effect: Evidence for Unconscious Alteration of Judgments. J. Pers. Soc. Psychol. 35, 4 (1977), 250–256. DOI: https://doi.org/10.1037/0022-3514.35.4.250",
      "doi": ""
    },
    {
      "text": "Raquel Oliveira, Patricia Arriaga, Filipa Correia, and Ana Paiva. 2019. The Stereotype Content Model Applied to Human-Robot Interactions in Groups. In 2019 14th ACM/IEEE International Conference on Human-Robot Interaction (HRI), IEEE, 123–132. DOI: https://doi.org/10.1109/HRI.2019.8673171",
      "doi": ""
    },
    {
      "text": "Rifca Peters, Joost Broekens, and Mark A. Neerincx. 2017. Robots Educate in Style: The Effect of Context and Non-verbal Behaviour on Children's Perceptions of Warmth and Competence. In 2017 26th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN), IEEE, 449–455. DOI: https://doi.org/10.1109/ROMAN.2017.8172341",
      "doi": ""
    },
    {
      "text": "Pooja Prajod, Mohammed Al Owayyed, Tim Rietveld, Jaap Jan Van Der Steeg, and Joost Broekens. 2019. The Effect of Virtual Agent Warmth on Human-Agent Negotiation. In Proceedings of the 18th International Conference on Autonomous Agents and Multiagent Systems (AAMAS 2019), Montreal, Canada, 71–76.",
      "doi": "10.5555/3306127.3331676"
    },
    {
      "text": "Seymour Rosenberg, Carnot Nelson, and P. S. Vivekananthan. 1968. A Multidimensional Approach to the Structure of Personality Impressions. J. Pers. Soc. Psychol. 9, 4 (August 1968), 283–294. DOI: https://doi.org/10.1037/h0026086",
      "doi": ""
    },
    {
      "text": "Andrew Steain, Christopher John Stanton, and Catherine J. Stevens. 2019. The black sheep effect: The case of the deviant ingroup robot. PLoS One 14, 10 (October 2019), e0222975. DOI: https://doi.org/10.1371/journal.pone.0222975",
      "doi": ""
    },
    {
      "text": "Adam Waytz and Michael I. Norton. 2014. Botsourcing and outsourcing: Robot, British, Chinese, and German workers are for thinking—not feeling—jobs. Emotion 14, 2 (2014), 434–444. DOI: https://doi.org/10.1037/a0036054",
      "doi": ""
    },
    {
      "text": "W. Neil Widmeyer and John W. Loy. 1988. When You're Hot, You're Hot! Warm-Cold Effects in First Impressions of Persons and Teaching Effectiveness. J. Educ. Psychol. 80, 1 (1988), 118–121. DOI: https://doi.org/10.1037/0022-0663.80.1.118",
      "doi": ""
    },
    {
      "text": "Bogdan Wojciszke, Roza Bazinska, and Marcin Jaworski. 1998. On the Dominance of Moral Categories in Impression Formation. Personal. Soc. Psychol. Bull. 24, 12 (December 1998), 1251–1263. DOI: https://doi.org/10.1177/01461672982412001",
      "doi": ""
    },
    {
      "text": "Eva Yiwei Wu, Emily Pedersen, and Niloufar Salehi. 2019. Agent, Gatekeeper, Drug Dealer. Proc. ACM Human-Computer Interact. 3, CSCW (November 2019), 1–27. DOI: https://doi.org/10.1145/3359321",
      "doi": ""
    },
    {
      "text": "Ming Yin, Jennifer Wortman Vaughan, and Hanna Wallach. 2019. Understanding the Effect of Accuracy on Trust in Machine Learning Models. In CHI Conference on Human Factors in Computing Systems Proceedings (CHI 2019), ACM Press, Glasgow, Scotland, 1–12. DOI: https://doi.org/10.1145/3290605.3300509",
      "doi": ""
    },
    {
      "text": "Vincent Yzerbyt, Valérie Provost, and Olivier Corneille. 2005. Not Competent but Warm... Really? Compensatory Stereotypes in the French-speaking World. Gr. Process. Intergr. Relations 8, 3 (July 2005), 291–308. DOI: https://doi.org/10.1177/1368430205053944",
      "doi": ""
    },
    {
      "text": "Vincent Y. Yzerbyt, Nicolas Kervyn, and Charles M. Judd. 2008. Compensation Versus Halo: The Unique Relations Between the Fundamental Dimensions of Social Judgment. Personal. Soc. Psychol. Bull. 34, 8 (August 2008), 1110–1123. DOI: https://doi.org/10.1177/0146167208318602",
      "doi": ""
    }
  ]
}