{
  "doi": "10.1145/3411764.3445333",
  "title": "“They See You’re a Girl if You Pick a Pink Robot with a Skirt”: A Qualitative Study of How Children Conceptualize Data Processing and Digital Privacy Risks",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-34",
  "year": 2021,
  "badges": [],
  "abstract": "As children become frequent digital technology users, concerns about their digital privacy are increasing. To better understand how young children conceptualize data processing and digital privacy risks, we interviewed 26 children, 4 to 10 years old, from families with higher educational attainment recruited in a college town. Our child participants construed apps’ and services’ data collection and storage practices in terms of their benefits, both to themselves and for user safety, and characterized both data tracking and privacy violations as interpersonal rather than considering automated processes or companies as privacy threats. We identify four factors shaping these mental models and privacy risk perceptions: (1) surface-level visual cues, (2) past digital interactions involving data collection, (3) age and cognitive development, and (4) privacy-related experiences in non-digital contexts. We discuss our findings’ design, educational, and public policy implications toward better supporting children in identifying and reasoning about digital privacy risks.",
  "authors": [
    {
      "name": "Kaiwen Sun",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/do/10.1145/contrib-99659366862/rel-imgonly/kaiwenprofile.jpg",
      "acmid": "99659366862",
      "orcid": "missing"
    },
    {
      "name": "Carlo Sugatan",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701306",
      "orcid": "missing"
    },
    {
      "name": "Tanisha Afnan",
      "institution": "School of Information University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702327",
      "orcid": "missing"
    },
    {
      "name": "Hayley Simon",
      "institution": "Department of Psychology, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700867",
      "orcid": "missing"
    },
    {
      "name": "Susan A. Gelman",
      "institution": "Department of Psychology, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701915",
      "orcid": "missing"
    },
    {
      "name": "Jenny Radesky",
      "institution": "Department of Pediatrics, University of Michigan Medical School, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260362",
      "orcid": "missing"
    },
    {
      "name": "Florian Schaub",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548024188",
      "orcid": "0000-0003-1039-7155"
    }
  ],
  "references": [
    {
      "text": "Council Directive 95/46/EC. 2016. Regulation (EU) 2016/679 of the European Parliament and of the Council of 27 April 2016 on the protection of natural persons with regard to the processing of personal data and on the free movement of such data, and repealing Directive 95/46/EC. https://eur-lex.europa.eu/eli/reg/2016/679/2016-05-04",
      "doi": ""
    },
    {
      "text": "Amelia Acker and Leanne Bowler. 2017. What is Your Data Silhouette? Raising Teen Awareness of Their Data Traces in Social Media. In Proceedings of the 8th International Conference on Social Media I& Society (Toronto, ON, Canada). Association for Computing Machinery, New York, NY, USA, Article 26, 5 pages. https://doi.org/10.1145/3097286.3097312",
      "doi": ""
    },
    {
      "text": "Amelia Acker and Leanne Bowler. 2018. Youth data literacy: teen perspectives on data created with social media and mobile devices. In Proceedings of the 51st Hawaii International Conference on System Sciences. HICSS, Hawaii, USA.",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, 2017. Nudges for privacy and security: Understanding and assisting users’ choices online. ACM Computing Surveys (CSUR) 50, 3 (2017), 1–41.",
      "doi": "10.1145/3054926"
    },
    {
      "text": "Alessandro Acquisti, Laura Brandimarte, and George Loewenstein. 2015. Privacy and human behavior in the age of information. Science 347, 6221 (2015), 509–514.",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti and Christina Fong. 2020. An experiment in hiring discrimination via online social networks. Management Science 66, 3 (2020), 1005–1024.",
      "doi": ""
    },
    {
      "text": "Susie Alegre. 2020. Data Daemons: Protecting the Child’s Right to Dream. https://freedomreport.5rightsfoundation.com/data-daemons-protecting-the-childs-right-to-dream-2",
      "doi": ""
    },
    {
      "text": "Amelia Alias. 2018. Children’s understanding of online data privacy: a study on Scottish Primary 6 and Primary 7 pupils. Ph.D. Dissertation. University of Edinburgh.",
      "doi": ""
    },
    {
      "text": "Hazim Almuhimedi, Florian Schaub, Norman Sadeh, Idris Adjerid, Alessandro Acquisti, Joshua Gluck, Lorrie Faith Cranor, and Yuvraj Agarwal. 2015. Your Location Has Been Shared 5,398 Times! A Field Study on Mobile App Privacy Nudging. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 787–796. https://doi.org/10.1145/2702123.2702210",
      "doi": "10.1145/2702123.2702210"
    },
    {
      "text": "Tawfiq Ammari, Priya Kumar, Cliff Lampe, and Sarita Schoenebeck. 2015. Managing Children’s Online Identities: How Parents Decide What to Disclose about Their Children Online. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1895–1904. https://doi.org/10.1145/2702123.2702325",
      "doi": "10.1145/2702123.2702325"
    },
    {
      "text": "AppleInc. 2020. Families at Apple.com. https://www.apple.com/families/",
      "doi": ""
    },
    {
      "text": "Thomas Armstrong. 2010. Neurodiversity: Discovering the extraordinary gifts of autism, ADHD, dyslexia, and other brain differences. ReadHowYouWant. com, USA.",
      "doi": ""
    },
    {
      "text": "Cristina M Atance. 2008. Future thinking in young children. Current Directions in Psychological Science 17, 4 (2008), 295–298.",
      "doi": ""
    },
    {
      "text": "Brooke Auxier, Monica Anderson, Andrew Perrin, and Erica Turner. 2020. Parenting Children in the Age of Screens: Parental views about YouTube. https://www.pewresearch.org/internet/2020/07/28/parental-views-about-youtube/",
      "doi": ""
    },
    {
      "text": "Brooke Auxier, Lee Rainie, Monica Anderson, Andrew Perrin, Madhu Kumar, and Erica Turner. 2019. Americans and privacy: Concerned, confused and feeling lack of control over their personal information. Pew Research Center: Internet, Science & Tech (blog). November 15 (2019), 2019.",
      "doi": ""
    },
    {
      "text": "Rebecca Balebako, Jaeyeon Jung, Wei Lu, Lorrie Faith Cranor, and Carolyn Nguyen. 2013. ”Little Brothers Watching You”: Raising Awareness of Data Leaks on Smartphones. In Proceedings of the Ninth Symposium on Usable Privacy and Security (Newcastle, United Kingdom) (SOUPS ’13). Association for Computing Machinery, New York, NY, USA, Article 12, 11 pages. https://doi.org/10.1145/2501604.2501616",
      "doi": "10.1145/2501604.2501616"
    },
    {
      "text": "Rebecca Balebako, Florian Schaub, Idris Adjerid, Alessandro Acquisti, and Lorrie Cranor. 2015. The Impact of Timing on the Salience of Smartphone App Privacy Notices. In Association for Computing Machinery (Denver, Colorado, USA) (SPSM ’15). Association for Computing Machinery, New York, NY, USA, 63–74. https://doi.org/10.1145/2808117.2808119",
      "doi": ""
    },
    {
      "text": "Carol Margaret Barron. 2014. ’I had no credit to ring you back’: Children’s strategies of negotiation and resistance to parental surveillance via mobile phones. Surveillance & Society 12, 3 (2014), 401–413.",
      "doi": ""
    },
    {
      "text": "Andrew Besmer and Heather Richter Lipford. 2010. Users’ (Mis)Conceptions of Social Applications. In Proceedings of Graphics Interface 2010 (Ottawa, Ontario, Canada) (GI ’10). Canadian Information Processing Society, CAN, 63–70.",
      "doi": "10.5555/1839214.1839226"
    },
    {
      "text": "Leanne Bowler, Amelia Acker, Wei Jeng, and Yu Chi. 2017. “It lives all around us”: Aspects of data literacy in teen’s lives. Proceedings of the Association for Information Science and Technology 54, 1 (2017), 27–35.",
      "doi": ""
    },
    {
      "text": "Alex Bowyer, Kyle Montague, Stuart Wheater, Ruth McGovern, Raghu Lingam, and Madeline Balaam. 2018. Understanding the Family Perspective on the Storage, Sharing and Handling of Family Civic Data. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173710",
      "doi": "10.1145/3173574.3173710"
    },
    {
      "text": "Danah Boyd. 2014. It’s complicated: The social lives of networked teens. Yale University Press, USA.",
      "doi": "10.5555/2584525"
    },
    {
      "text": "Danah Boyd, Eszter Hargittai, Jason Schultz, and John Palfrey. 2011. Why Parents Help Their Children Lie to Facebook About Age: Unintended Consequences of the ‘Children’s Online Privacy Protection Act.”’. First Monday 16 (10 2011). https://doi.org/10.5210/fm.v16i11.3850",
      "doi": ""
    },
    {
      "text": "danah boyd and Alice Marwick. 2011. Social Privacy in Networked Publics: Teens’ Attitudes, Practices, and Strategies. A Decade in Internet Time: Symposium on the Internet and Society 2011 Edi (09 2011), 29.",
      "doi": ""
    },
    {
      "text": "S Carey. 2009. Oxford series in cognitive development: Vol. 3. The origin of concepts. New York, NY, US: Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Fred H Cate. 2010. The limits of notice and choice. IEEE Security & Privacy 8, 2 (2010), 59–62.",
      "doi": "10.1109/MSP.2010.84"
    },
    {
      "text": "Sangmi Chai, Sharmistha Bagchi-Sen, Claudia Morrell, Raghav Rao, and Shambhu Upadhyaya. 2009. Internet and Online Information Privacy: An Exploratory Study of Preteens and Early Teens. Professional Communication, IEEE Transactions on 52 (07 2009), 167 – 182. https://doi.org/10.1109/TPC.2009.2017985",
      "doi": ""
    },
    {
      "text": "Stéphane Chaudron, ME Beutel, Veronica Donoso Navarrete, M Dreier, Ben Fletcher-Watson, AS Heikkilä, V Kontríková, RV Korkeamäki, S Livingstone, J Marsh, 2015. Young Children (0-8) and digital technology: A qualitative exploratory study across seven countries. JRC; ISPRA, Italy, Europe.",
      "doi": ""
    },
    {
      "text": "Stephane Chaudron, Rosanna Di Gioia, and Mônica Gemo. 2018. Young children (0-8) and digital technology, a qualitative study across Europe. JRC Science for Policy Report EUR 29070 EN (2018), 1–266.",
      "doi": ""
    },
    {
      "text": "Yu Chi, Wei Jeng, Amelia Acker, and Leanne Bowler. 2018. Affective, Behavioral, and Cognitive Aspects of Teen Perspectives on Personal Data in Social Media: A Model of Youth Data Literacy. In International Conference on Information. Springer, USA, 442–452. https://doi.org/10.1007/978-3-319-78105-1_49",
      "doi": ""
    },
    {
      "text": "Lorrie Faith Cranor, Adam L. Durity, Abigail Marsh, and Blase Ur. 2014. Parents’ and Teens’ Perspectives on Privacy in a Technology-Filled World. In Proceedings of the Tenth USENIX Conference on Usable Privacy and Security (Menlo Park, CA) (SOUPS ’14). USENIX Association, USA, 19–35.",
      "doi": ""
    },
    {
      "text": "Sauvik Das, Joanne Lo, Laura Dabbish, and Jason I. Hong. 2018. Breaking! A Typology of Security and Privacy News and How It’s Shared. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173575",
      "doi": "10.1145/3173574.3173575"
    },
    {
      "text": "Yang Feng and Wenjing Xie. 2014. Teens’ concern for privacy when using social networking sites: An analysis of socialization agents and relationships with privacy-protecting behaviors. Computers in Human Behavior 33 (2014), 153–162.",
      "doi": "10.1016/j.chb.2014.01.009"
    },
    {
      "text": "FTC. 2013. Children’s Online Privacy Protection Rule. https://www.ftc.gov/enforcement/rules/rulemaking-regulatory-reform-proceedings/childrens-online-privacy-protection-rule",
      "doi": ""
    },
    {
      "text": "FTC. 2020. FTC Gives Final Approval to Settlement with Stalking Apps Developer. https://www.ftc.gov/news-events/press-releases/2020/03/ftc-gives-final-approval-settlement-stalking-apps-developer",
      "doi": ""
    },
    {
      "text": "GDPR. 2008-08-13. REGULATION (EC) No 765/2008 OF THE EUROPEAN PARLIAMENT AND OF THE COUNCIL of 9 July 2008 setting out the requirements for accreditation and market surveillance relating to the marketing of products and repealing Regulation (EEC) No 339/93. OJ L 218(2008-08-13), 30–47.",
      "doi": ""
    },
    {
      "text": "Susan A Gelman, Megan Martinez, Natalie S Davidson, and Nicholaus S Noles. 2018. Developing digital privacy: Children’s moral judgments concerning mobile GPS devices. Child development 89, 1 (2018), 17–26.",
      "doi": ""
    },
    {
      "text": "Dedre Gentner. 1983. Structure-mapping: A theoretical framework for analogy. Cognitive science 7, 2 (1983), 155–170.",
      "doi": ""
    },
    {
      "text": "Dedre Gentner and Christian Hoyos. 2017. Analogy and abstraction. Topics in cognitive science 9, 3 (2017), 672–693.",
      "doi": ""
    },
    {
      "text": "Arup Kumar Ghosh, Karla Badillo-Urquiola, Shion Guha, Joseph J. LaViola Jr, and Pamela J. Wisniewski. 2018. Safety vs. Surveillance: What Children Have to Say about Mobile Apps for Parental Control. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173698",
      "doi": "10.1145/3173574.3173698"
    },
    {
      "text": "Arup Kumar Ghosh, Karla Badillo-Urquiola, Mary Beth Rosson, Heng Xu, John M. Carroll, and Pamela J. Wisniewski. 2018. A Matter of Control or Safety? Examining Parental Use of Technical Monitoring Apps on Teens’ Mobile Devices. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173768",
      "doi": "10.1145/3173574.3173768"
    },
    {
      "text": "JJ Gibson. 1979. The ecological approach to visual perception. Boston, MA, US.",
      "doi": ""
    },
    {
      "text": "James J Gibson. 1977. The theory of affordances. Perceiving, Acting and Knowing.",
      "doi": ""
    },
    {
      "text": "Joshua Gluck, Florian Schaub, Amy Friedman, Hana Habib, Norman Sadeh, Lorrie Faith Cranor, and Yuvraj Agarwal. 2016. How short is too short? Implications of length and framing on the effectiveness of privacy notices. In Twelfth Symposium on Usable Privacy and Security ({SOUPS} 2016). Twelfth Symposium on Usable Privacy and Security ({SOUPS} 2016), USA, 321–340.",
      "doi": ""
    },
    {
      "text": "Google. 2019. Be Internet Awesome. https://beinternetawesome.withgoogle.com/en_us/. Accessed: 2020-08-10.",
      "doi": ""
    },
    {
      "text": "Alison Gopnik, Laura Schulz, and Laura Elizabeth Schulz. 2007. Causal learning: Psychology, philosophy, and computation. Oxford University Press, UK.",
      "doi": ""
    },
    {
      "text": "Usha Goswami. 1992. Analogical reasoning in children. Psychology Press, USA.",
      "doi": ""
    },
    {
      "text": "Carie Green. 2011. A place of my own: Exploring preschool children’s special places in the home environment. Children Youth and Environments 21, 2 (2011), 118–144.",
      "doi": ""
    },
    {
      "text": "Tamy Guberek, Allison McDonald, Sylvia Simioni, Abraham H. Mhaidli, Kentaro Toyama, and Florian Schaub. 2018. Keeping a Low Profile? Technology, Risk and Privacy among Undocumented Immigrants. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3173574.3173688",
      "doi": "10.1145/3173574.3173688"
    },
    {
      "text": "Rex Hartson. 2003. Cognitive, physical, sensory, and functional affordances in interaction design. Behaviour & information technology 22, 5 (2003), 315–338.",
      "doi": ""
    },
    {
      "text": "David A Hayes and Robert J Tierney. 1982. Developing readers’ knowledge through analogy. Reading Research Quarterly 17 (1982), 256–280.",
      "doi": ""
    },
    {
      "text": "Anne K Hickling and Henry M Wellman. 2001. The emergence of children’s causal explanations and theories: Evidence from everyday conversation.Developmental psychology 37, 5 (2001), 668.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Kiley Sobel, Ray Hong, Hyewon Suh, India Irish, and Julie Kientz. 2016. Hidden Symbols: How Informal Symbolism in Digital Interfaces Disrupts Usability for Preschoolers. International Journal of Human-Computer Studies 90 (03 2016). https://doi.org/10.1016/j.ijhcs.2016.03.006",
      "doi": ""
    },
    {
      "text": "Donell Holloway, Lelia Green, and Sonia Livingstone. 2013. Zero to eight: Young children and their internet use. London School of Economics and EU Kids Online January 2013 Edition (2013), 10–13.",
      "doi": ""
    },
    {
      "text": "Karen Holtzblatt, Jessamyn Burns Wendell, and Shelley Wood. 2004. Rapid contextual design: a how-to guide to key techniques for user-centered design. Elsevier, USA.",
      "doi": ""
    },
    {
      "text": "Keith J Holyoak, Keith James Holyoak, and Paul Thagard. 1996. Mental leaps: Analogy in creative thought. MIT press, USA.",
      "doi": ""
    },
    {
      "text": "Carlos Jensen and Colin Potts. 2004. Privacy Policies as Decision-Making Tools: An Evaluation of Online Privacy Notices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vienna, Austria) (CHI ’04). Association for Computing Machinery, New York, NY, USA, 471–478. https://doi.org/10.1145/985692.985752",
      "doi": "10.1145/985692.985752"
    },
    {
      "text": "Haiyan Jia, Pamela J. Wisniewski, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2015. Risk-Taking as a Learning Process for Shaping Teen’s Online Information Privacy Behaviors. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 583–599. https://doi.org/10.1145/2675133.2675287",
      "doi": "10.1145/2675133.2675287"
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, Nathaniel Fruchter, and Sara Kiesler. 2015. ”My Data Just Goes Everywhere”: User Mental Models of the Internet and Implications for Privacy and Security. In Eleventh Symposium On Usable Privacy and Security ({SOUPS} 2015) (Ottawa, Canada) (SOUPS ’15). USENIX Association, USA, 39–52.",
      "doi": ""
    },
    {
      "text": "Deborah Kelemen. 1999. Beliefs about purpose: On the origins of teleological thought.Oxford University Press, UK.",
      "doi": ""
    },
    {
      "text": "Deborah Kelemen. 1999. The scope of teleological thinking in preschool children. Cognition 70, 3 (1999), 241–272.",
      "doi": ""
    },
    {
      "text": "Deborah Kelemen, Maureen A Callanan, Krista Casler, and Deanne R Pérez-Granados. 2005. Why things happen: teleological explanation in parent-child conversations.Developmental Psychology 41, 1 (2005), 251.",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Lorrie Faith Cranor, and Norman Sadeh. 2013. Privacy as Part of the App Decision-Making Process. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 3393–3402. https://doi.org/10.1145/2470654.2466466",
      "doi": "10.1145/2470654.2466466"
    },
    {
      "text": "Angelina KewalRamani, Jijun Zhang, Xiaolei Wang, Amy Rathbun, Lisa Corcoran, Melissa Diliberti, and Jizhi Zhang. 2018. Student Access to Digital Learning Resources outside of the Classroom. National Center for Education Statistics NCES 2017-098 (2018), 238.",
      "doi": ""
    },
    {
      "text": "Priya Kumar, Shalmali Milind Naik, Utkarsha Ramesh Devkar, Marshini Chetty, Tamara L Clegg, and Jessica Vitak. 2017. ’No Telling Passcodes Out Because They’re Private’ Understanding Children’s Mental Models of Privacy and Security Online. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–21.",
      "doi": "10.1145/3134699"
    },
    {
      "text": "Rebecca Lane and Jenny Radesky. 2019. Digital Media and Autism Spectrum Disorders: Review of Evidence, Theoretical Concerns, and Opportunities for Intervention. Journal of Developmental & Behavioral Pediatrics 40, 5(2019), 364–368.",
      "doi": ""
    },
    {
      "text": "Robert S Laufer and Maxine Wolfe. 1977. Privacy as a concept and a social issue: A multidimensional developmental theory. Journal of social Issues 33, 3 (1977), 22–42.",
      "doi": ""
    },
    {
      "text": "Jialiu Lin, Shahriyar Amini, Jason I. Hong, Norman Sadeh, Janne Lindqvist, and Joy Zhang. 2012. Expectation and Purpose: Understanding Users’ Mental Models of Mobile App Privacy through Crowdsourcing. In UbiComp’12 - Proceedings of the 2012 ACM Conference on Ubiquitous Computing (Pittsburgh, Pennsylvania) (UbiComp ’12). Association for Computing Machinery, New York, NY, USA, 501–510. https://doi.org/10.1145/2370216.2370290",
      "doi": "10.1145/2370216.2370290"
    },
    {
      "text": "Sonia Livingstone. 2014. Developing social media literacy: How children learn to interpret risky opportunities on social network sites. Communications 39, 3 (2014), 283–303.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone. 2020. It’s none of their business!” Children’s understanding of privacy in the platform society. https://freedomreport.5rightsfoundation.com/its-none-of-their-business-childrens-understanding-of-privacy-in-the-platform-society#",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone and Magdalena Bober. 2004. UK children go online: Surveying the experiences of young people and their parents. London School of Economics and Political Science 2004 Edition (2004), 45.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Julia Davidson, Joanne Bryce, Saqba Batool, Ciaran Haughton, and Anulekha Nandi. 2017. Children’s online activities, risks and safety: a literature review by the UKCCIS evidence group. UK Council for Internet Safety Oct 2017 Edition (2017), 110.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Leslie Haddon, Anke Görzig, and Kjartan Ólafsson. 2010. Risks and safety on the internet: the perspective of European children: key findings from the EU Kids Online survey of 9-16 year olds and their parents in 25 countries. EU Kids Online 2013 Edition (2010), 2–171.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Tink Palmer, 2012. Identifying vulnerable children online and what strategies can help them. UK Safer Internet Centre 2012 Edition (2012), 2–60.",
      "doi": ""
    },
    {
      "text": "Sonia Livingstone, Mariya Stoilova, and Rishita Nandagiri. 2019. Children’s data and privacy online: growing up in a digital age: an evidence review. London School of Economics and Political Science 2019 Edition (2019), 2–57.",
      "doi": ""
    },
    {
      "text": "May O Lwin, Andrea JS Stanaland, and Anthony D Miyazaki. 2008. Protecting children’s privacy online: How parental mediation strategies affect website safeguard effectiveness. Journal of Retailing 84, 2 (2008), 205–217.",
      "doi": ""
    },
    {
      "text": "Mary Madden. 2017. Privacy, security, and digital inequality.",
      "doi": ""
    },
    {
      "text": "Mary Madden, Sandra Cortesi, Urs Gasser, Amanda Lenhart, and Maeve Duggan. 2012. Parents, Teens, and Online Privacy.Pew internet & American life project. https://www.pewresearch.org/internet/2012/11/20/parents-teens-and-online-privacy/",
      "doi": ""
    },
    {
      "text": "Mary Madden, Amanda Lenhart, Sandra Cortesi, and Urs Gasser. 2013. Teens and mobile apps privacy. Pew Internet and American Life Project. https://www.pewresearch.org/internet/2013/08/22/teens-and-mobile-apps-privacy/",
      "doi": ""
    },
    {
      "text": "Naresh K Malhotra, Sung S Kim, and James Agarwal. 2004. Internet users’ information privacy concerns (IUIPC): The construct, the scale, and a causal model. Information systems research 15, 4 (2004), 336–355.",
      "doi": ""
    },
    {
      "text": "Abigail Marsh. 2018. An Examination of Parenting Strategies for Children’s Online Safety. Ph.D. Dissertation. Carnegie Mellon University.",
      "doi": ""
    },
    {
      "text": "Kirsten Martin. 2018. The penalty for privacy violations: How privacy violations impact trust online. Journal of Business Research 82 (2018), 103–116.",
      "doi": ""
    },
    {
      "text": "Aleecia M McDonald and Lorrie Faith Cranor. 2008. The cost of reading privacy policies. Isjlp 4(2008), 543.",
      "doi": ""
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys That Listen: A Study of Parents, Children, and Internet-Connected Toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5197–5207. https://doi.org/10.1145/3025453.3025735",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "Marisa Meyer, Victoria Adkins, Nalingna Yuan, Heidi M Weeks, Yung-Ju Chang, and Jenny Radesky. 2019. Advertising in young children’s apps: A content analysis. Journal of Developmental & Behavioral Pediatrics 40, 1(2019), 32–39.",
      "doi": ""
    },
    {
      "text": "G. R. Milne, M. Culnan, and Henry Greene. 2006. A Longitudinal Assessment of Online Privacy Notice Readability. Journal of Public Policy & Marketing 25 (2006), 238 – 249.",
      "doi": ""
    },
    {
      "text": "Kathryn C Montgomery, Jeff Chester, and Tijana Milosevic. 2017. Children’s privacy in the big data era: Research opportunities. Pediatrics 140, Supplement 2 (2017), S117–S121.",
      "doi": ""
    },
    {
      "text": "Don Norman. 2013. The design of everyday things: Revised and expanded edition. Basic books, USA.",
      "doi": ""
    },
    {
      "text": "Donald A Norman. 1999. Affordance, conventions, and design. interactions 6, 3 (1999), 38–43.",
      "doi": ""
    },
    {
      "text": "Maggie Oates, Yama Ahmadullah, Abigail Marsh, Chelse Swoopes, Shikun Zhang, Rebecca Balebako, and Lorrie Faith Cranor. 2018. Turtles, locks, and bathrooms: Understanding mental models of privacy through illustration. Proceedings on Privacy Enhancing Technologies 2018, 4(2018), 5–32.",
      "doi": ""
    },
    {
      "text": "American Academy of Pediatrics. 2020. Media and Children Communication Toolkit. https://www.aap.org/en-us/advocacy-and-policy/aap-health-initiatives/Pages/Media-and-Children.aspx",
      "doi": ""
    },
    {
      "text": "Jean Piaget. 1955. The construction of reality in the child. Journal of Consulting Psychology 19, 1 (1955), 77.",
      "doi": ""
    },
    {
      "text": "Emilee Rader, Samantha Hautea, and Anjali Munasinghe. 2020. ”I Have a Narrow Thought Process”: Constraints on Explanations Connecting Inferences and Self-Perceptions. In Sixteenth Symposium on Usable Privacy and Security (SOUPS 2020). USENIX Association, USA, 457–488. https://www.usenix.org/conference/soups2020/presentation/rader",
      "doi": ""
    },
    {
      "text": "Jenny Radesky, Yolanda Linda Reid Chassiakos, Nusheen Ameenuddin, Dipesh Navsaria, 2020. Digital Advertising to Children. Pediatrics 146, 1 (2020), 1–8.",
      "doi": ""
    },
    {
      "text": "Jenny S Radesky, Jayna Schumacher, and Barry Zuckerman. 2015. Mobile and interactive media use by young children: the good, the bad, and the unknown. Pediatrics 135, 1 (2015), 1–3.",
      "doi": ""
    },
    {
      "text": "Jenny S Radesky, Heidi M Weeks, Rosa Ball, Alexandria Schaller, Samantha Yeo, Joke Durnez, Matthew Tamayo-Rios, Mollie Epstein, Heather Kirkorian, Sarah Coyne, 2020. Young children’s use of smartphones and tablets. Pediatrics 146(2020), 1–10.",
      "doi": ""
    },
    {
      "text": "Ashwini Rao, Florian Schaub, Norman Sadeh, Alessandro Acquisti, and Ruogu Kang. 2016. Expecting the Unexpected: Understanding Mismatched Privacy Expectations Online. In Proceedings of the Twelfth USENIX Conference on Usable Privacy and Security (Denver, CO, USA) (SOUPS ’16). USENIX Association, USA, 77–96.",
      "doi": ""
    },
    {
      "text": "General Assembly resolution 44/25. 1989. Article 14 of the UN Convention on the Rights of the Child 1989.https://ohchr.org/EN/ProfessionalInterest/Pages/CRC.aspx",
      "doi": ""
    },
    {
      "text": "Irwin Reyes, Primal Wijesekera, Joel Reardon, Amit Elazari Bar On, Abbas Razaghpanah, Narseo Vallina-Rodriguez, and Serge Egelman. 2018. “Won’t somebody think of the children?” examining COPPA compliance at scale. Proceedings on Privacy Enhancing Technologies 2018, 3(2018), 63–83.",
      "doi": ""
    },
    {
      "text": "David E Rumelhart and Donald A Norman. 1981. Analogical processes in learning. Technical Report. California Univ., San Diego. Center for Human Information Processing. 335–359 pages.",
      "doi": ""
    },
    {
      "text": "Norman Sadeh, Alessandro Acquisti, Travis D Breaux, Lorrie Faith Cranor, Aleecia M McDonald, Joel R Reidenberg, Noah A Smith, Fei Liu, N Cameron Russell, Florian Schaub, 2013. The usable privacy policy project. Technical Report. Carnegie Mellon University School of Computer Science.",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2015. The coding manual for qualitative researchers. Sage, USA.",
      "doi": ""
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, and Lorrie Faith Cranor. 2017. Designing Effective Privacy Notices and Controls. IEEE Internet Computing 21, 3 (May 2017), 70–77. https://doi.org/10.1109/MIC.2017.75",
      "doi": "10.1109/MIC.2017.75"
    },
    {
      "text": "Florian Schaub, Rebecca Balebako, Adam L. Durity, and Lorrie Faith Cranor. 2015. A Design Space for Effective Privacy Notices. In Proceedings of the Eleventh USENIX Conference on Usable Privacy and Security (Ottawa, Canada) (SOUPS ’15). USENIX Association, USA, 1–17.",
      "doi": "10.5555/3235866.3235868"
    },
    {
      "text": "Florian Schaub and Lorrie Faith Cranor. 2020. Usable and Useful Privacy Interfaces. In An Introduction to Privacy for Technology Professionals, Travis Breaux (Ed.). IAPP, USA, 176–299.",
      "doi": ""
    },
    {
      "text": "Neil Selwyn and Luci Pangrazio. 2018. Doing data differently? Developing personal data tactics and strategies amongst young mobile media users. Big Data & Society 5, 1 (2018), 2053951718765021.",
      "doi": ""
    },
    {
      "text": "Wonsun Shin, Jisu Huh, and Ronald J Faber. 2012. Tweens’ online privacy risks and the role of parental mediation. Journal of Broadcasting & Electronic Media 56, 4 (2012), 632–649.",
      "doi": ""
    },
    {
      "text": "Benjamin Shmueli and Ayelet Blecher-Prigat. 2010. Privacy for children. Colum. Hum. Rts. L. Rev. 42 (2010), 759.",
      "doi": ""
    },
    {
      "text": "Robert Siegler and W. Martha Alibali. 2020. Children’s Thinking. Pearson, USA.",
      "doi": ""
    },
    {
      "text": "Daniel J Solove. 2012. Introduction: Privacy self-management and the consent dilemma. Harv. L. Rev. 126(2012), 1880.",
      "doi": ""
    },
    {
      "text": "Maja Sonne Damkjaer. 2018. Sharenting = Good Parenting? Four Parental Approaches to Sharenting on Facebook. Nordicom, USA, 209–218.",
      "doi": ""
    },
    {
      "text": "Elizabeth S Spelke and Katherine D Kinzler. 2007. Core knowledge. Developmental science 10, 1 (2007), 89–96.",
      "doi": ""
    },
    {
      "text": "Amanda Third, Delphine Bellerose, Juliano DD Oliveira, Girish Lala, and Georgina Theakstone. 2017. Young and Online: Children’s perspectives on life in the digital age. Sydney, Australia: Western Sydney University 2017 Edition (2017), 1–92.",
      "doi": ""
    },
    {
      "text": "Patti M Valkenburg, Marina Krcmar, Allerd L Peeters, and Nies M Marseille. 1999. Developing a scale to assess three styles of television mediation:“Instructive mediation,”“restrictive mediation,” and “social coviewing”. Journal of broadcasting & electronic media 43, 1 (1999), 52–66.",
      "doi": ""
    },
    {
      "text": "Patti M Valkenburg, Jessica Taylor Piotrowski, Jo Hermanns, and Rebecca De Leeuw. 2013. Developing and validating the perceived parental media mediation scale: A self-determination perspective. Human Communication Research 39, 4 (2013), 445–469.",
      "doi": ""
    },
    {
      "text": "Simone Van der Hof. 2016. I agree, or do I: a rights-based analysis of the law on children’s consent in the digital world. Wis. Int’l LJ 34(2016), 409.",
      "doi": ""
    },
    {
      "text": "Alexander JAM Van Deursen, Ellen J Helsper, and Rebecca Eynon. 2016. Development and validation of the Internet Skills Scale (ISS). Information, Communication & Society 19, 6 (2016), 804–823.",
      "doi": ""
    },
    {
      "text": "Na Wang, Heng Xu, and Jens Grossklags. 2011. Third-Party Apps on Facebook: Privacy and the Illusion of Control. In Proceedings of the 5th ACM Symposium on Computer Human Interaction for Management of Information Technology (Cambridge, Massachusetts) (CHIMIT ’11). Association for Computing Machinery, New York, NY, USA, Article 4, 10 pages. https://doi.org/10.1145/2076444.2076448",
      "doi": "10.1145/2076444.2076448"
    },
    {
      "text": "Henry M. Wellman and Susan A. Gelman. 1988. Children’s understanding of the nonobvious. Advances in the psychology of human intelligence 4 (1988), 99–135.",
      "doi": ""
    },
    {
      "text": "Henry M Wellman and Susan A Gelman. 1992. Cognitive development: Foundational theories of core domains. Annual review of psychology 43, 1 (1992), 337–375.",
      "doi": ""
    },
    {
      "text": "Pamela Wisniewski, Haiyan Jia, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2015. ”Preventative” vs. ”Reactive”: How Parental Mediation Influences Teens’ Social Media Privacy Behaviors. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 302–316. https://doi.org/10.1145/2675133.2675293",
      "doi": "10.1145/2675133.2675293"
    },
    {
      "text": "Pamela Wisniewski, Haiyan Jia, Heng Xu, Mary Beth Rosson, and John M. Carroll. 2015. ”Preventative” vs. ”Reactive”: How Parental Mediation Influences Teens’ Social Media Privacy Behaviors. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 302–316. https://doi.org/10.1145/2675133.2675293",
      "doi": "10.1145/2675133.2675293"
    },
    {
      "text": "Pamela Wisniewski, Heng Xu, Mary Beth Rosson, Daniel F. Perkins, and John M. Carroll. 2016. Dear Diary: Teens Reflect on Their Weekly Online Risk Experiences. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3919–3930. https://doi.org/10.1145/2858036.2858317",
      "doi": "10.1145/2858036.2858317"
    },
    {
      "text": "Jason C. Yip, Kiley Sobel, Xin Gao, Allison Marie Hishikawa, Alexis Lim, Laura Meng, Romaine Flor Ofiana, Justin Park, and Alexis Hiniker. 2019. Laughing is Scary, but Farting is Cute: A Conceptual Model of Children’s Perspectives of Creepy Technologies. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3290605.3300303",
      "doi": "10.1145/3290605.3300303"
    },
    {
      "text": "Seounmi Youn. 2005. Teenagers’ perceptions of online privacy and coping behaviors: a risk–benefit appraisal approach. Journal of Broadcasting & Electronic Media 49, 1 (2005), 86–110.",
      "doi": ""
    },
    {
      "text": "Eric Zeng and Franziska Roesner. 2019. Understanding and Improving Security and Privacy in Multi-User Smart Homes: A Design Exploration and in-Home User Study. In Proceedings of the 28th USENIX Conference on Security Symposium (Santa Clara, CA, USA) (SEC’19). USENIX Association, USA, 159–176.",
      "doi": ""
    },
    {
      "text": "Leah Zhang-Kennedy, Christine Mekhail, Yomna Abdelaziz, and Sonia Chiasson. 2016. From Nosy Little Brothers to Stranger-Danger: Children and Parents’ Perception of Mobile Threats. In Proceedings of the The 15th International Conference on Interaction Design and Children (Manchester, United Kingdom) (IDC ’16). Association for Computing Machinery, New York, NY, USA, 388–399. https://doi.org/10.1145/2930674.2930716",
      "doi": "10.1145/2930674.2930716"
    },
    {
      "text": "Fangwei Zhao, Serge Egelman, Heidi M Weeks, Niko Kaciroti, Alison L Miller, and Jenny S Radesky. 2020. Data collection practices of mobile applications played by preschool-aged children. JAMA pediatrics 174(2020), e203345–e203345.",
      "doi": ""
    },
    {
      "text": "Jun Zhao, Ge Wang, Carys Dally, Petr Slovak, Julian Edbrooke-Childs, Max Van Kleek, and Nigel Shadbolt. 2019. ‘I Make up a Silly Name’: Understanding Children’s Perception of Privacy Risks Online. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300336",
      "doi": "10.1145/3290605.3300336"
    },
    {
      "text": "Shoshana Zuboff. 2019. The Age of Surveillance Capitalism: The Fight for a Human Future at the New Frontier of Power: Barack Obama’s Books of 2019. Profile Books, USA.",
      "doi": ""
    }
  ]
}