{
  "doi": "10.1145/3411764.3445455",
  "title": "Latte: Use-Case and Assistive-Service Driven Automated Accessibility Testing Framework for Android",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "For 15% of the world population with disabilities, accessibility is arguably the most critical software quality attribute. The ever-growing reliance of users with disability on mobile apps further underscores the need for accessible software in this domain. Existing automated accessibility assessment techniques primarily aim to detect violations of predefined guidelines, thereby produce a massive amount of accessibility warnings that often overlook the way software is actually used by users with disability. This paper presents a novel, high-fidelity form of accessibility testing for Android apps, called Latte, that automatically reuses tests written to evaluate an app’s functional correctness to assess its accessibility as well. Latte first extracts the use case corresponding to each test, and then executes each use case in the way disabled users would, i.e., using assistive services. Our empirical evaluation on real-world Android apps demonstrates Latte’s effectiveness in detecting substantially more useful defects than prior techniques.",
  "tags": [
    "Automated Testing",
    "Accessibility",
    "Mobile Application"
  ],
  "authors": [
    {
      "name": "Navid Salehnamadi",
      "institution": "University of California, Irvine, United States",
      "img": "/do/10.1145/contrib-99659539077/rel-imgonly/profile_stand_new.jpg",
      "acmid": "99659539077",
      "orcid": "0000-0001-7009-2420"
    },
    {
      "name": "Abdulaziz Alshayban",
      "institution": "University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659538775",
      "orcid": "0000-0002-1806-7065"
    },
    {
      "name": "Jun-Wei Lin",
      "institution": "University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416603242",
      "orcid": "missing"
    },
    {
      "name": "Iftekhar Ahmed",
      "institution": "Informatics University Of California, Irvine, United States",
      "img": "/do/10.1145/contrib-99658635503/rel-imgonly/99658635503.jpg",
      "acmid": "99658635503",
      "orcid": "0000-0001-8221-5352"
    },
    {
      "name": "Stacy Branham",
      "institution": "Informatics University of California, Irvine, United States",
      "img": "/do/10.1145/contrib-81442598659/rel-imgonly/stacy_branham-0320_crop.jpg",
      "acmid": "81442598659",
      "orcid": "missing"
    },
    {
      "name": "Sam Malek",
      "institution": "University of California Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100267865",
      "orcid": "0000-0001-6152-7402"
    }
  ],
  "references": [
    {
      "text": "Abdulaziz Alshayban, Iftekhar Ahmed, and Sam Malek. 2020. Accessibility issues in Android apps: state of affairs, sentiments, and ways forward. In 2020 IEEE/ACM 42nd International Conference on Software Engineering. ICSE, Virtual, 1323–1334.",
      "doi": "10.1145/3377811.3380392"
    },
    {
      "text": "Android. 2020. About Switch Access for Android. https://support.google.com/accessibility/android/answer/6122836?hl=en.",
      "doi": ""
    },
    {
      "text": "Android. 2020. Accessibility Scanner - Apps on Google Play. https://play.google.com/store/apps/details?id=com.google.android.apps.accessibility.auditor&hl=en_US.",
      "doi": ""
    },
    {
      "text": "Android. 2020. AccessibilityService in Android. Google. Retrieved September 15, 2020 from https://developer.android.com/guide/topics/ui/accessibility/service",
      "doi": ""
    },
    {
      "text": "Android. 2020. Android accessibility overview. Google. Retrieved August 20, 2020 from https://support.google.com/accessibility/android/answer/6006564",
      "doi": ""
    },
    {
      "text": "Android. 2020. Android Debug Bridge. Google. Retrieved September 15, 2020 from https://developer.android.com/studio/command-line/adb",
      "doi": ""
    },
    {
      "text": "Android. 2020. Android Studio. Google. Retrieved August 27, 2020 from https://developer.android.com/studio",
      "doi": ""
    },
    {
      "text": "Android. 2020. Espresso : Android Developers. Google. Retrieved August 20, 2020 from https://developer.android.com/training/testing/espresso",
      "doi": ""
    },
    {
      "text": "Android. 2020. Improve your code with lint checks. Google. Retrieved August 20, 2020 from https://developer.android.com/studio/write/lint?hl=en",
      "doi": ""
    },
    {
      "text": "Android. 2020. TalkBack and SwitchAccess source code by Google. Google. Retrieved September 15, 2020 from https://github.com/google/talkback",
      "doi": ""
    },
    {
      "text": "Appium. 2020. Mobile App Automation Made Awesome. http://appium.io/.",
      "doi": ""
    },
    {
      "text": "Apple. 2020. Apple Accessibility - iPhone. https://www.apple.com/accessibility/iphone/.",
      "doi": ""
    },
    {
      "text": "Apple. 2020. Apple Accessibility Scanner. https://developer.apple.com/library/archive/documentation/Accessibility/Conceptual/AccessibilityMacOSX/OSXAXTestingApps.html.",
      "doi": ""
    },
    {
      "text": "Giorgio Brajnik. 2004. Comparing accessibility evaluation tools: a method for tool effectiveness. Universal access in the information society 3, 3-4 (2004), 252–263.",
      "doi": ""
    },
    {
      "text": "Jieshan Chen, Chunyang Chen, Zhenchang Xing, Xiwei Xu, Liming Zhu, and Guoqiang Li. 2020. Unblind Your Apps: Predicting Natural-Language Labels for Mobile GUI Components by Deep Learning. In 2020 IEEE/ACM 42nd International Conference on Software Engineering. ICSE, Virtual, 322–334.",
      "doi": "10.1145/3377811.3380327"
    },
    {
      "text": "Marcelo Medeiros Eler, José Miguel Rojas, Yan Ge, and Gordon Fraser. 2018. Automated accessibility testing of mobile apps. In 2018 IEEE 11th International Conference on Software Testing, Verification and Validation. ICST, Västerås, Sweden, 116–126.",
      "doi": ""
    },
    {
      "text": "Google. 2020. Get started on android with talkback - android accessibility help.https://support.google.com/accessibility/android/answer/6283677?hl=en.",
      "doi": ""
    },
    {
      "text": "Wish Inc.2020. Geek - Smarter Shopping. https://play.google.com/store/apps/details?id=com.contextlogic.geek&hl=en_US.",
      "doi": ""
    },
    {
      "text": "Opinion Matters. 2020. Mobile App Backlog Is Directly Damaging Revenue in the Enterprise. BizReport. Retrieved September 15, 2020 from http://www.bizreport.com/whitepapers/mobile_app_backlog_is_directly.html",
      "doi": ""
    },
    {
      "text": "Helen Petrie and Omar Kheir. 2007. The relationship between accessibility and usability of websites. In Proceedings of the SIGCHI conference on Human factors in computing systems. CHI, San Jose, California, USA, 397–406.",
      "doi": "10.1145/1240624.1240688"
    },
    {
      "text": "Christopher Power, André Freire, Helen Petrie, and David Swallow. 2012. Guidelines are only half of the story: accessibility problems encountered by blind users on the web. In Proceedings of the SIGCHI conference on human factors in computing systems. CHI, Texas, USA, 433–442.",
      "doi": "10.1145/2207676.2207736"
    },
    {
      "text": "Robolectric. 2019. robolectric/robolectric. https://github.com/robolectric/robolectric",
      "doi": ""
    },
    {
      "text": "Anne Spencer Ross, Xiaoyi Zhang, James Fogarty, and Jacob O Wobbrock. 2017. Epidemiology as a framework for large-scale mobile application accessibility assessment. In Proceedings of the 19th international ACM SIGACCESS conference on computers and accessibility. ASSETS, Baltimore, MD, USA, 2–11.",
      "doi": "10.1145/3132525.3132547"
    },
    {
      "text": "Navid Salehnamadi, Abdulaziz Alshayban, Jun-Wei Lin, Iftekhar Ahmed, Stacy Branham, and Sam Malek. 2020. Latte companion website. https://github.com/seal-hub/Latte.",
      "doi": ""
    },
    {
      "text": "Camila Silva, Marcelo Medeiros Eler, and Gordon Fraser. 2018. A survey on the tool support for the automatic evaluation of mobile accessibility. In Proceedings of the 8th International Conference on Software Development and Technologies for Enhancing Accessibility and Fighting Info-exclusion. DSAI, Thessaloniki, Greece, 286–293.",
      "doi": "10.1145/3218585.3218673"
    },
    {
      "text": "W3. 2020. Web Content Accessibility Guidelines (WCAG) Overview. World Wide Web Consortium. Retrieved August 20, 2020 from https://www.w3.org/WAI/standards-guidelines/wcag/",
      "doi": ""
    },
    {
      "text": "WHO. 2011. World report on disability. World Health Organization. Retrieved August 20, 2020 from https://www.who.int/disabilities/world_report/2011/report/en/",
      "doi": ""
    },
    {
      "text": "Xiaoyi Zhang, Anne Spencer Ross, and James Fogarty. 2018. Robust Annotation of Mobile Application Interfaces in Methods for Accessibility Repair and Enhancement. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. UIST, Berlin, Germany, 609–621.",
      "doi": "10.1145/3242587.3242616"
    }
  ]
}