{
  "doi": "10.1145/3411764.3445324",
  "title": "Communication Skills Training Intervention Based on Automated Recognition of Nonverbal Signals",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "There have been promising studies that show a potential of providing social signal feedback to improve communication skills. However, these studies have primarily focused on unimodal methods of feedback. In addition to this, studies do not assess whether skills are maintained after a given time. With a sample size of 22 this paper investigates whether multimodal social signal feedback is an effective method of improving communication in the context of media interviews. A pre-post experimental evaluation of media skills training intervention is presented which compares standard feedback with augmented feedback based on automated recognition of multimodal social signals. Results revealed significantly different training effects between the two conditions. However, the initial experiment study failed to show significant differences in human judgement of performance. A 6-month follow-up study revealed human judgement ratings were higher for the experiment group. This study suggests that augmented selective multimodal social signal feedback is an effective method for communication skills training.",
  "tags": [
    "Media interviews",
    "Social Signals",
    "Off-the-shelf emotion recognition technology",
    "Communication skills training"
  ],
  "authors": [
    {
      "name": "Monica Pereira",
      "institution": "Department of Psychology London Metropolitan University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659333496",
      "orcid": "missing"
    },
    {
      "name": "Kate Hone",
      "institution": "Department of Computer Science Brunel University London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100214709",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jans Aasman, Gijsbertus Mulder, and Lambertus J.M. M Mulder. 1987. Operator effort and the measurement of heart-rate variability. Human Factors 29, 2: 161–170.",
      "doi": "10.1177/001872088702900204"
    },
    {
      "text": "Reginald B. Adams and Kestutis Kveraga. 2015. Social Vision: Functional Forecasting and the Integration of Compound Social Cues. Review of Philosophy and Psychology 6, 4: 591–610.",
      "doi": ""
    },
    {
      "text": "Mohammad Rafayet Ali and Ehsan Hoque. 2017. Social skills training with virtual assistant and real-time feedback. 325–329.",
      "doi": ""
    },
    {
      "text": "P. Allen and K. Bennett. 2007. SPSS for the Health and Behavioural Sciences. Cengage Learning Australia.",
      "doi": ""
    },
    {
      "text": "Knut Aspegren. 1999. BEME Guide No. 2: Teaching and learning communication skills in medicine - A review with quality grading of articles. Medical Teacher 21, 6: 564–570.",
      "doi": ""
    },
    {
      "text": "Roghayeh Barmaki. 2016. Improving social communication skills using kinesics feedback. Conference on Human Factors in Computing Systems - Proceedings 07-12-May-: 86–91.",
      "doi": "10.1145/2851581.2890378"
    },
    {
      "text": "Tobias Baur, Gregor Mehlmann, Ionut Damian, 2015. Context-Aware Automated Analysis and Annotation of Social Human–Agent Interactions. ACM Transactions on Interactive Intelligent Systems (TiiS) 5, 2: 11.",
      "doi": ""
    },
    {
      "text": "Paul Boersma and Vincent van Heuven. 2001. Speak and unSpeak with Praat. Glot International 5, 9–10: 341–347.",
      "doi": ""
    },
    {
      "text": "Willem Paul Brinkman, Joost Broekens, Dirk Heylen, 2015. Torwards a Socially Adaptive Virtual Agent. International Conference on Intelligent Virtual Agents, 3–16.",
      "doi": ""
    },
    {
      "text": "Andrew J. Calder and Andrew W. Young. 2005. Understanding the recognition of facial identity and facial expression. Nature Reviews Neuroscience 6, 8: 641–651.",
      "doi": ""
    },
    {
      "text": "Rafael Calvo, Sidney D'Mello, Jonathan Gratch, 2015. Expressing Emotion Through Posture and Gesture. In The Oxford Handbook of Affective Computing. 3–10.",
      "doi": ""
    },
    {
      "text": "N. V. Chawla, K. W. Bowyer, L. O. Hall, and W. P. Kegelmeyer. 2002. SMOTE: Synthetic Minority Over-sampling Technique. Journal of Artificial Intelligence Research 16: 321–357.",
      "doi": "10.5555/1622407.1622416"
    },
    {
      "text": "Mathieu Chollet, Pranav Ghate, and Stefan Scherer. 2018. A generic platform for training social skills with adaptative virtual agents. Proceedings of the International Joint Conference on Autonomous Agents and Multiagent Systems, AAMAS.",
      "doi": ""
    },
    {
      "text": "Mathieu Chollet, Torsten Wörtwein, Louis-Philippe Morency, Ari Shapiro, and Stefan Scherer. 2016. Exploring feedback strategies to improve public speaking. September 2016: 1143–1154.",
      "doi": ""
    },
    {
      "text": "Marco Cristani, R Raghavendra, Alessio Del Bue, and Vittorio Murino. 2013. Human behavior analysis in video surveillance: A Social Signal Processing perspective. Special issue: Behaviours in video 100: 86–97.",
      "doi": ""
    },
    {
      "text": "Ionut Damian, Tobias Baur, Birgit Lugrin, Patrick Gebhard, Gregor Mehlmann, and Elisabeth André. 2015. Games are better than books: In-situ comparison of an interactive job interview game with conventional training. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 9112: 84–94.",
      "doi": ""
    },
    {
      "text": "Ionut Damian, Michael Dietz, and Elisabeth André. 2018. The SSJ Framework: Augmenting Social Interactions Using Mobile Signal Processing and Live Feedback. Frontiers in ICT 5: 13.",
      "doi": ""
    },
    {
      "text": "Ionut Damian, Chiew Seng (Sean) Tan, Tobias Baur, Johannes Schöning, Kris Luyten, and Elisabeth André. 2015. Augmenting Social Interactions: Realtime Behavioural Feedback Using Social Signal Processing Techniques. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems: 565–574.",
      "doi": ""
    },
    {
      "text": "A. C. Daniels. 1989. Performance Management. Performance Management Publications, Atlanta, GA.",
      "doi": ""
    },
    {
      "text": "Paul Ekman. 2003. Sixteen enjoyable emotions. Emotion Researcher 18, 2: 6–7.",
      "doi": ""
    },
    {
      "text": "Andy Field. 2013. Discovering statistics using IBM SPSS statistics. Sage Publications.",
      "doi": "10.5555/2502692"
    },
    {
      "text": "Scott T. Frein, Samantha L. Jones, and Jennifer E. Gerow. 2013. When it comes to Facebook there may be more to bad memory than just multitasking. Computers in Human Behavior 29, 6: 2179–2182.",
      "doi": "10.1016/j.chb.2013.04.031"
    },
    {
      "text": "Sakiko Fukui, Keiko Ogawa, and Naoshi Fukui. 2010. Communication skills training on how to break bad news for Japanese nurses in oncology: Effects of training on nurses’ confidence and perceived effectiveness. Journal of Cancer Education 25, 1: 116–119.",
      "doi": ""
    },
    {
      "text": "Ruth Garner, Mark G. Gillingham, and C. Stephen White. 1989. Effects of &quot;Seductive Details&quot; on Macroprocessing and Microprocessing in Adults and Children. Cognition and Instruction 6, 1: 41–57.",
      "doi": ""
    },
    {
      "text": "Young Han and Joseph Nunes. 2010. Read the Signal But Don't Mention It: How Consumption Embarrasses the Signaler. Advances in Consumer Research 37: 81–84.",
      "doi": ""
    },
    {
      "text": "Yuval Hart, Efrat Czerniak, Orit Karnieli-Miller, 2016. Automated video analysis of non-verbal communication in a medical setting. Frontiers in Psychology 7, AUG: 1130.",
      "doi": ""
    },
    {
      "text": "Minoru Hashimoto, Misaki Yamano, and Tatsuya Usui. 2009. Effects of emotional synchronization in human-robot KANSEI communications. Proceedings - IEEE International Workshop on Robot and Human Interactive Communication: 52–57.",
      "doi": ""
    },
    {
      "text": "R. Glen Hass and Donna Eisenstadt. 1990. The effects of self-focused attention on perspective-taking and anxiety. Anxiety Research 2, 3: 165–176.",
      "doi": ""
    },
    {
      "text": "Benjamin C. Holding, Tina Sundelin, Mats Lekander, and John Axelsson. 2019. Sleep deprivation and its effects on communication during individual and collaborative tasks. Scientific Reports 9, 1: 3131.",
      "doi": ""
    },
    {
      "text": "Me Hoque, Matthieu Courgeon, and Jc Martin. 2013. Mach: My Automated Conversation coacH. Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp ’13), 697–706.",
      "doi": "10.1145/2493432.2493502"
    },
    {
      "text": "Mohammed Hoque and Rosalind W Picard. Automated Coach to Practice Conversations. .",
      "doi": ""
    },
    {
      "text": "Hazaël Jones and Nicolas Sabouret. 2013. TARDIS - A simulation platform with an affective virtual recruiter for job interviews. .",
      "doi": ""
    },
    {
      "text": "Johanna K. Kaakinen, Ugo Ballenghein, Geoffrey Tissier, and Thierry Baccino. 2018. Fluctuation in cognitive engagement during reading: Evidence From Concurrent Recordings of Postural and Eye Movements. Journal of Experimental Psychology: Learning Memory and Cognition 44, 10: 1671–1677.",
      "doi": ""
    },
    {
      "text": "Douglas M Klieger and Kimberly K Siejak. 1997. Disgust as the source of false positive effects in the measurement of ophidiophobia. Journal of Psychology: Interdisciplinary and Applied 131, 4: 371–382.",
      "doi": ""
    },
    {
      "text": "L. Konopka, J. Duffecy, and K. Hur. 2010. Technology assisted PTSD screening (TAPS) for the Vietnam Veterans of America (VVA) study. Pilot Study Abstract, The Chicago School of Professional Psychology, Northwestern University, and The University of Illinois at Chicago.",
      "doi": ""
    },
    {
      "text": "Francisco Lacerda. 2009. LVA-technology-The illusion of “lie detection.” Proceedings, FONETIK 2009: 220–226.",
      "doi": ""
    },
    {
      "text": "Francisco Lacerda. 2012. Money Talks: The Power of Voice: A critical review of Mayew and Ventachalam's The Power of Voice: Managerial Affective States and Future Firm Performance. PERILUS: 1–10.",
      "doi": ""
    },
    {
      "text": "G Littlewort, M S Bartlett, and K Lee. 2008. Verbal and Nonverbal Features of Human-Human and Human-Machine Interaction. Springer Verlag.",
      "doi": ""
    },
    {
      "text": "Chunfeng Liu, Karen M Scott, Renee L Lim, Silas Taylor, and Rafael A Calvo. 2016. EQClinic: a platform for learning communication skills in clinical consultations. Medical Education Online 21: 1–7.",
      "doi": ""
    },
    {
      "text": "Markus Muehlhan, Michael Marxen, Julia Landsiedel, Hagen Malberg, and Sebastian Zaunseder. 2014. The effect of body posture on cognitive performance: a question of sleep quality. Frontiers in Human Neuroscience 8: 171.",
      "doi": ""
    },
    {
      "text": "Skanda Muralidhar. 2017. On Job Training: Automated Interpersonal Behavior Assessment & Real-Time Feedback. .",
      "doi": ""
    },
    {
      "text": "Iftekhar Naim, Md. Iftekhar Tanveer, Daniel Gildea, 2016. Automated analysis and prediction of job interview performance. IEEE Transactions on Affective Computing: 1–14.",
      "doi": ""
    },
    {
      "text": "Laurent Son Nguyen and Daniel Gatica-Perez. 2015. I Would Hire You in a Minute. Proceedings of the 2015 ACM on International Conference on Multimodal Interaction - ICMI ’15, 51–58.",
      "doi": "10.1145/2818346.2820760"
    },
    {
      "text": "S.Gopal Krishna Patro and Kishore Kumar Sahu. 2015. Normalization: A Preprocessing Stage. IARJSET: 20–22.",
      "doi": ""
    },
    {
      "text": "Alex Pentland and Tracy Heibeck. 2010. Honest signals: how they shape our world. MIT press, Cambridge, Massachusetts.",
      "doi": "10.5555/1450928"
    },
    {
      "text": "Monica Pereira. 2018. Media Skills Training Intervention Based on Automated Recognition of Human Emotion and Non-Verbal Behaviour. 1: 1.",
      "doi": ""
    },
    {
      "text": "Monica Pereira, Federico Colecchia, and Kate Hone. 2018. User Centred Design of Social Signals Feedback for Communication Skills Training. Proceedings of British HCI, 2018: 1–5.",
      "doi": ""
    },
    {
      "text": "Namita Mediratta Rana el Kaliouby, Evan Kodra, Pankaj Jha. 2014. Does Facial Coding Generalize Across Cultures? A Spotlight on Asia. .",
      "doi": ""
    },
    {
      "text": "Ognjen Rudovic, Mihalis A. Nicolaou, and Vladimir Pavlovic. 2017. Machine learning methods for social signal processing. Social Signal Processing: 234–254.",
      "doi": ""
    },
    {
      "text": "Christopher A. Sanchez and Jennifer Wiley. 2006. An examination of the seductive details effect in terms of working memory capacity. Memory and Cognition 34, 2: 344–355.",
      "doi": ""
    },
    {
      "text": "Emanuel Schmider, Matthias Ziegler, Erik Danay, Luzi Beyer, and Markus Bühner. 2010. Is It Really Robust?: Reinvestigating the robustness of ANOVA against violations of the normal distribution assumption. Methodology 6, 4: 147–151.",
      "doi": ""
    },
    {
      "text": "Jan Schneider, Dirk Borner, Peter Van Rosmalen, and Marcus Specht. 2016. Can You Help Me with My Pitch? Studying a Tool for Real-Time Automated Feedback. IEEE Transactions on Learning Technologies 9, 4: 318–327.",
      "doi": "10.1109/TLT.2016.2627043"
    },
    {
      "text": "Jan Schneider, Dirk Börner, Peter van Rosmalen, and Marcus Specht. 2015. Presentation Trainer, your Public Speaking Multimodal Coach. ICMI ’15: Proceedings of the 2015 ACM on International Conference on Multimodal Interaction: 539–546.",
      "doi": "10.1145/2818346.2830603"
    },
    {
      "text": "Jan Schneider, Dirk Börner, Peter van Rosmalen, and Marcus Specht. 2016. Enhancing public speaking skills - An evaluation of the presentation trainer in the wild. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), Springer, Cham, 263–276.",
      "doi": ""
    },
    {
      "text": "By Jamie Shotton, Toby Sharp, Alex Kipman, 2011. Real-Time Human Pose Recognition in Parts from Single Depth Images. .",
      "doi": ""
    },
    {
      "text": "Brian H Spitzberg and Thomas W Adams. 2007. CSRS, the Conversational Skills Rating Scale: An Instructional Assessment of Interpersonal Competence. NCA, National Communication Association.",
      "doi": ""
    },
    {
      "text": "Jan Van den Stock, Ruthger Righart, and Beatrice de Gelder. 2007. Body Expressions Influence Recognition of Emotions in the Face and Voice. Emotion 7, 3: 487–494.",
      "doi": ""
    },
    {
      "text": "B. G. Tabacknick, L. S. Fidell, and J. B. Ullman. 2007. Using Multivariate Statistics. Pearson, Boston, MA.",
      "doi": ""
    },
    {
      "text": "Hiroki Tanaka, Sakriani Sakti, Graham Neubig, Hideki Negoro, Hidemi Iwasaka, and Satoshi Nakamura. 2016. Automated social skills training with audiovisual information. Proceedings of the Annual International Conference of the IEEE Engineering in Medicine and Biology Society, EMBS, IEEE, 2262–2265.",
      "doi": ""
    },
    {
      "text": "Hiroki Tanaka, Sakriani Sakti, Graham Neubig, Tomoki Toda, and Satoshi Nakamura. 2015. NOCOA+: Multimodal computer-based training for social and communication skills. IEICE Transactions on Information and Systems E98D, 8: 1536–1544.",
      "doi": ""
    },
    {
      "text": "Robert Taylor. 2015. Media Interview Techniques: A complete guide ot media training. Kogan Page, London.",
      "doi": ""
    },
    {
      "text": "Tatsuya Usui, Kazuomi Kume, Misaki Yamano, and Minoru Hashimoto. 2008. A robotic KANSEI communication system based on emotional synchronization. 2008 IEEE/RSJ International Conference on Intelligent Robots and Systems, IROS, IEEE, 3344–3349.",
      "doi": ""
    },
    {
      "text": "Alessandro Vinciarelli, Maja Pantic, and H Bourlard. 2008. Social signals, their function, and automatic analysis: a survey. Proceedings of the 10th international conference on Multimodal interfaces (ICMI ’08): 61–68.",
      "doi": "10.1145/1452392.1452405"
    },
    {
      "text": "Alessandro Vinciarelli, Maja Pantic, and Hervé Bourlard. 2009. Social signal processing: Survey of an emerging domain. Image and Vision Computing 27, 12: 1743–1759.",
      "doi": "10.1016/j.imavis.2008.11.007"
    },
    {
      "text": "Alessandro Vinciarelli, Hugues Salamin, and Maja Pantic. 2009. Social signal processing: Understanding social interactions through nonverbal behavior analysis. Computer Vision and Pattern Recognition Workshops, 2009. CVPR Workshops 2009. IEEE Computer Society Conference on, IEEE, 42–49.",
      "doi": ""
    },
    {
      "text": "Robert A. Wicklund. 1979. The Influence of Self-Awareness on Human Behavior: The person who becomes self-aware is more likely to act consistently, be faithful to societal norms, and give accurate reports about himself. American Scientists 67, 2: 187–193.",
      "doi": ""
    },
    {
      "text": "World Health Organization and WHO. 2005. Effective media communication during public health emergencies - A WHO Handbook. World Health July.",
      "doi": ""
    },
    {
      "text": "Zhihong Zeng, Maja Pantic, Glenn I. Roisman, and Thomas S. Huang. 2009. A survey of affect recognition methods: Audio, visual, and spontaneous expressions. IEEE Transactions on Pattern Analysis and Machine Intelligence 31, 1: 39–58.",
      "doi": ""
    },
    {
      "text": "Yanxia Zhang, FX Palo Alto Laboratory, Usa Jeffrey Olenick, 2018. TeamSense: Assessing Personal Affect and Group Cohesion in Small Teams through Dyadic Interaction and Behavior Analysis with Wearable Sensors. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol 2, 150: 150.",
      "doi": ""
    },
    {
      "text": "Ru Zhao, Vivian Li, Hugo Barbosa, Gourab Ghoshal, and Mohammed Ehsan Hoque. 2017. Semi-Automated 8 Collaborative Online Training Module for Improving Communication Skills. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 1, 2: 1–20.",
      "doi": "10.1145/3132027"
    }
  ]
}