{
  "doi": "10.1145/3411764.3445476",
  "title": "Augmented Reality and Older Adults: A Comparison of Prompting Types",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Older adults can benefit from technologies that help them to complete everyday tasks. However, they are an often-under-represented population in augmented reality (AR) research. We present the results of a study in which people aged 50 years or older were asked to perform actions by interpreting visual AR prompts in a lab setting. Our results show that users were less successful at completing actions when using ARROW and HIGHLIGHT augmentations than when using ghosted OBJECT or GHOSTHAND augmentations. We found that user confidence in performing actions varied according to action and augmentation type. Users preferred combined AUDIO+TEXT prompts (our control condition) overall, but the GHOSTHAND was the most preferred visual prompt. We discuss reasons for these differences and provide insight for developers of AR content for older adults. Our work provides the first comparative study of AR with older adults in a non-industrial context.",
  "tags": [
    "older adults",
    "task prompting",
    "augmented reality",
    "prompting tools"
  ],
  "authors": [
    {
      "name": "Thomas J. Williams",
      "institution": "University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700880",
      "orcid": "missing"
    },
    {
      "name": "Simon L. Jones",
      "institution": "Dept. of Computer Science University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416593569",
      "orcid": "missing"
    },
    {
      "name": "Christof Lutteroth",
      "institution": "Computer Science University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100238140",
      "orcid": "0000-0003-0634-7569"
    },
    {
      "name": "Elies Dekoninck",
      "institution": "University of Bath, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81435611175",
      "orcid": "missing"
    },
    {
      "name": "Hazel C Boyd",
      "institution": "Designability, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701527",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alzheimer’s Research UK. 2019. A Walk Through Dementia. https://www.awalkthroughdementia.org/",
      "doi": ""
    },
    {
      "text": "Alzheimer’s Society. 2017. What is dementia? Factsheet 400LP. https://www.alzheimers.org.uk/sites/default/files/migrate/downloads/what_is_dementia.pdf",
      "doi": ""
    },
    {
      "text": "Robert Ball and Juan Pablo Hourcade. 2011. Rethinking Reading for Age From Paper and Computers. International Journal of Human-Computer Interaction 27, 11 (Nov 2011), 1066–1082. https://doi.org/10.1080/10447318.2011.555319",
      "doi": ""
    },
    {
      "text": "Cornelia Beck, Patricia Heacock, Carla Gene Rapp, and Susan O. Mercer. 1993. Assisting cognitively impaired elders with activities of daily living. American Journal of Alzheimer’s Care and Related Disorders & Research 8, 6 (Nov 1993), 11–20. https://doi.org/10.1177/153331759300800602",
      "doi": ""
    },
    {
      "text": "Paul Bliese. 2006. Multilevel Modeling in R (2.2)–A Brief Introduction to R, the multilevel package and the nlme package.",
      "doi": ""
    },
    {
      "text": "Leonardo Bonanni, Chia-Hsun Lee, and Ted Selker. 2005. CounterIntelligence: Augmented Reality Kitchen. In CHI 2005. ACM Press, Portland, Oregon, USA, 1–7.",
      "doi": ""
    },
    {
      "text": "Emily C Bouck, Rajiv Satsangi, Whitney Bartlett, and Pei-Lin Weng. 2012. Promoting Independence through Assistive Technology: Evaluating Audio Recorders to Support Grocery Shopping. Education and Training in Autism and Developmental Disabilities 47, 4 (Dec 2012), 462–473. http://www.jstor.org/stable/23879639",
      "doi": ""
    },
    {
      "text": "Hazel C Boyd, Nina M Evans, Roger D Orpwood, and Nigel D Harris. 2017. Using simple technology to prompt multistep tasks in the home for people with dementia: An exploratory study comparing prompting formats. Dementia 16, 4 (May 2017), 424–442. https://doi.org/10.1177/1471301215602417",
      "doi": ""
    },
    {
      "text": "Yao-Jen Chang, Ya-Shu Kang, and Po-Chiao Huang. 2013. An augmented reality (AR)-based vocational task prompting system for people with cognitive impairments. Research in Developmental Disabilities 34, 10 (Oct 2013), 3049–3056. https://doi.org/10.1016/j.ridd.2013.06.026",
      "doi": ""
    },
    {
      "text": "Avital Cnaan, Nan M Laird, and Peter Slasor. 1997. Using the general linear mixed model to analyse unbalanced repeated measures and longitudinal data. Statistics in medicine 16, 20 (1997), 2349–2380.",
      "doi": ""
    },
    {
      "text": "Lizbeth Escobedo, Mónica Tentori, Eduardo Quintana, Jesus Favela, and Daniel Garcia-Rosas. 2014. Using augmented reality to help children with autism stay focused. IEEE Pervasive Computing 13, 1 (2014), 38–46. https://doi.org/10.1109/MPRV.2014.19",
      "doi": "10.1109/MPRV.2014.19"
    },
    {
      "text": "Stephen Fickas, McKay Sohlberg, and Pei Fang Hung. 2008. Route-following assistance for travelers with cognitive impairments: A comparison of four prompt modes. International Journal of Human Computer Studies 66, 12 (Dec 2008), 876–888. https://doi.org/10.1016/j.ijhcs.2008.07.006",
      "doi": "10.1016/j.ijhcs.2008.07.006"
    },
    {
      "text": "Nirit Gavish, Teresa Gutiérrez, Sabine Webel, Jorge Rodríguez, Matteo Peveri, Uli Bockholt, and Franco Tecchia. 2015. Evaluating virtual reality and augmented reality training for industrial maintenance and assembly tasks. Interactive Learning Environments 23, 6 (Nov 2015), 778–798. https://doi.org/10.1080/10494820.2013.815221",
      "doi": ""
    },
    {
      "text": "Jens Grubert, Tobias Langlotz, Stefanie Zollmann, and Holger Regenbrecht. 2017. Towards Pervasive Augmented Reality: Context-Awareness in Augmented Reality. IEEE Transactions on Visualization and Computer Graphics 23, 6 (Jun 2017), 1706–1724. https://doi.org/10.1109/TVCG.2016.2543720",
      "doi": "10.1109/TVCG.2016.2543720"
    },
    {
      "text": "Steven J. Henderson and Steven Feiner. 2009. Evaluating the benefits of augmented reality for task localization in maintenance of an armored personnel carrier turret. In Science and Technology Proceedings - IEEE 2009 International Symposium on Mixed and Augmented Reality, ISMAR 2009. IEEE, Orlando, FL, USA, 135–144. https://doi.org/10.1109/ISMAR.2009.5336486",
      "doi": ""
    },
    {
      "text": "Ann Horgas and Gregory Abowd. 2004. The Impact of Technology on Living Environments for Older Adults. In National Research Council (US) Steering Committee for the Workshop on Technology for Adaptive Aging, RW Pew and SB Van Hemel (Eds.). National Academies Press (US), Washington (DC), Chapter 9, 230–251. https://www.ncbi.nlm.nih.gov/books/NBK97336/",
      "doi": ""
    },
    {
      "text": "Felicia Huppert. 2003. Designing for older users. In Inclusive Design: Design for the Whole Population, John Clarkson, Simeon Keates, Roger Coleman, and Cherie Lebbon (Eds.). Springer London, London, Chapter 1, 30–49. https://doi.org/10.1007/978-1-4471-0001-0_2",
      "doi": ""
    },
    {
      "text": "Sei Ikeda, Zeeshan Asghar, Jaakko Hyry, Petri Pulli, Antti Pitkanen, and Hirokazu Kato. 2011. Remote Assistance Using Visual Prompts for Demented Elderly in Cooking. In Proceedings of the 4th International Symposium on Applied Sciences in Biomedical and Communication Technologies(ISABEL ’11). Association for Computing Machinery, New York, NY, USA, 1–5. https://doi.org/10.1145/2093698.2093744",
      "doi": "10.1145/2093698.2093744"
    },
    {
      "text": "Matthew Jamieson, Breda Cullen, Marilyn McGee-Lennon, Stephen Brewster, and Jonathan J. Evans. 2014. The efficacy of cognitive prosthetic technology for people with memory impairments: A systematic review and meta-analysis. Neuropsychological Rehabilitation 24, 3-4 (Jul 2014), 419–444. https://doi.org/10.1080/09602011.2013.825632",
      "doi": ""
    },
    {
      "text": "SeungJun Kim and Anind K Dey. 2009. Simulated Augmented Reality Windshield Display as a Cognitive Mapping Aid for Elder Driver Navigation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’09). Association for Computing Machinery, New York, NY, USA, 133–142. https://doi.org/10.1145/1518701.1518724",
      "doi": "10.1145/1518701.1518724"
    },
    {
      "text": "Pascal Knierim, Paweł W. Woźniak, Yomna Abdelrahman, and Albrecht Schmidt. 2019. Exploring the potential of augmented reality in domestic environments. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services, MobileHCI 2019, Vol. 19. Association for Computing Machinery, Inc, Taipei, Taiwan, 1–12. https://doi.org/10.1145/3338286.3340142",
      "doi": "10.1145/3338286.3340142"
    },
    {
      "text": "I. Jui Lee, Chien Hsu Chen, and Kuo Ping Chang. 2016. Augmented reality technology combined with three-dimensional holography to train the mental rotation ability of older adults. Computers in Human Behavior 65 (Dec 2016), 488–500. https://doi.org/10.1016/j.chb.2016.09.014",
      "doi": ""
    },
    {
      "text": "Li Na Lee, Mi Jeong Kim, and Won Ju Hwang. 2019. Potential of Augmented Reality and Virtual Reality Technologies to Promote Wellbeing in Older Adults. Applied Sciences 9, 17 (Aug 2019), 3556. https://doi.org/10.3390/app9173556",
      "doi": ""
    },
    {
      "text": "Dixon Lo, Dan Lockton, and Stacie Rohrbach. 2018. Experiential Augmentation: Uncovering the Meaning of Qualitative Visualizations when Applied to Augmented Objects. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, New York, New York, USA, 1–8. https://doi.org/10.1145/3173574.3174064",
      "doi": "10.1145/3173574.3174064"
    },
    {
      "text": "Michael Lo Bianco, Sonja Pedell, and Gianni Renda. 2016. Augmented reality and home modifications: A tool to empower older adults in fall prevention. In Proceedings of the 28th Australian Computer-Human Interaction Conference, OzCHI 2016. Association for Computing Machinery, Inc, Launceston Tasmania Australia, 499–507. https://doi.org/10.1145/3010915.3010929",
      "doi": "10.1145/3010915.3010929"
    },
    {
      "text": "Atieh Mahroo, Luca Greci, and Marco Sacco. 2019. HoloHome: An Augmented Reality Framework to Manage the Smart Home. In 6th International Conference on Augmented Reality, Virtual Reality and Computer Graphics (AVR 2019), Vol. 11614 LNCS. Springer Verlag, Santa Maria al Bagno, Italy, 137–145. https://doi.org/10.1007/978-3-030-25999-0_12",
      "doi": ""
    },
    {
      "text": "Jorge Martín-Gutiérrez and Irene Inés Santos Pérez. 2011. Augmented reality approach to domestic maintenance tasks. In HCI 2011: HCI International 2011 – Posters’ Extended Abstracts, Vol. 174 CCIS PART 2. Springer, Berlin, Heidelberg, Orlando, FL, USA, 125–129. https://doi.org/10.1007/978-3-642-22095-1_26",
      "doi": ""
    },
    {
      "text": "Martina Merten. 2007. Erweiterte Realität: Verschmelzung zweier Welten. Deutsches Ärzteblatt 104, 13 (2007), A840. https://www.aerzteblatt.de/archiv/55014/Erweiterte-Realitaet-Verschmelzung-zweier-Welten",
      "doi": ""
    },
    {
      "text": "Alex Mihailidis, Jennifer Boger, Marcelle Canido, and Jesse Hoey. 2007. The use of an intelligent prompting system for people with dementia. interactions 14, 4 (Jul 2007), 34. https://doi.org/10.1145/1273961.1273982",
      "doi": ""
    },
    {
      "text": "Alex Mihailidis, Jennifer N Boger, Tammy Craig, and Jesse Hoey. 2008. The COACH prompting system to assist older adults with dementia through handwashing: An efficacy study. BMC Geriatrics 8, 1 (Dec 2008), 28. https://doi.org/10.1186/1471-2318-8-28",
      "doi": ""
    },
    {
      "text": "Lars Müller, Ilhan Aslan, and Lucas Krüßen. 2013. GuideMe: A mobile augmented reality system to display user manuals for home appliances. In 10th International Conference on Advances in Computer Entertainment Technology (ACE 2013), Vol. 8253 LNCS. Springer, Cham, Boekelo, The Netherlands, 152–167. https://doi.org/10.1007/978-3-319-03161-3_11",
      "doi": ""
    },
    {
      "text": "R. Orpwood, J. Chadd, D. Howcroft, A. Sixsmith, J. Torrington, G. Gibson, and G. Chalfont. 2010. Designing technology to improve quality of life for people with dementia: user-led approaches. Universal Access in the Information Society 9, 3 (Aug 2010), 249–259. https://doi.org/10.1007/s10209-009-0172-1",
      "doi": "10.1007/s10209-009-0172-1"
    },
    {
      "text": "George Papagiannakis, Sebastien Schertenleib, Brian O’Kennedy, Marlene Arevalo-Poizat, Nadia Magnenat-Thalmann, Andrew Stoddart, and Daniel Thalmann. 2005. Mixing virtual and real scenes in the site of ancient Pompeii. Computer Animation and Virtual Worlds 16, 1 (Feb 2005), 11–24. https://doi.org/10.1002/cav.53",
      "doi": ""
    },
    {
      "text": "Jon Peddie. 2017. Introduction. In Augmented Reality. Springer International Publishing, Cham, 1–28. https://doi.org/10.1007/978-3-319-54502-8_1",
      "doi": ""
    },
    {
      "text": "Jon Peddie. 2017. Software Tools and Technologies. In Augmented Reality. Springer International Publishing, Cham, 165–182. https://doi.org/10.1007/978-3-319-54502-8_7",
      "doi": ""
    },
    {
      "text": "James L Peugh. 2010. A practical guide to multilevel modeling. Journal of school psychology 48, 1 (2010), 85–112.",
      "doi": ""
    },
    {
      "text": "K S Purdy, P A McMullen, and M Freedman. 2002. Changes to the object recognition system in patients with dementia of the Alzheimer’s type.Brain and cognition 49, 2 (2002), 213–216.",
      "doi": ""
    },
    {
      "text": "Rafael Radkowski, Jordan Herrema, and James Oliver. 2015. Augmented Reality-Based Manual Assembly Support With Visual Features for Different Degrees of Difficulty. International Journal of Human-Computer Interaction 31, 5 (May 2015), 337–349. https://doi.org/10.1080/10447318.2014.994194",
      "doi": ""
    },
    {
      "text": "Patrick Renner. 2018. Prompting Techniques for Guidance and Action Assistance Using Augmented-Reality Smart-Glasses. In 25th IEEE Conference on Virtual Reality and 3D User Interfaces, VR 2018 - Proceedings. Institute of Electrical and Electronics Engineers Inc., Reutlingen, Germany, 820–822. https://doi.org/10.1109/VR.2018.8446292",
      "doi": ""
    },
    {
      "text": "Nina Rohrbach, Philipp Gulde, Alan Robert Armstrong, Linda Hartig, Anas Abdelrazeq, Stefan Schröder, Johanne Neuse, Timo Grimmer, Janine Diehl-Schmid, and Joachim Hermsdörfer. 2019. An augmented reality approach for ADL support in Alzheimer’s disease: a crossover trial. Journal of NeuroEngineering and Rehabilitation 16, 1 (Dec 2019), 66. https://doi.org/10.1186/s12984-019-0530-z",
      "doi": ""
    },
    {
      "text": "Jennifer Rusted and Linda Sheppard. 2002. Action-based memory in Alzheimer’s disease: A longitudinal look at tea making. Neurocase 8, 1-2 (2002), 111–126. https://doi.org/10.1093/neucas/8.1.111",
      "doi": ""
    },
    {
      "text": "Giuseppe Scavo, Fridolin Wild, and Peter Scott. 2015. The GhostHands UX: telementoring with hands-on augmented reality instruction. In Workshop Proceedings of the 11th International Conference on Intelligent Environments, D. Preuveneers (Ed.)(Ed.). IOS Press, Prague, Czech Republic, 236–243. https://doi.org/10.3233/978-1-61499-530-2-236",
      "doi": ""
    },
    {
      "text": "Myrna F. Schwartz, Edward S. Reed, Michael Montgomery, Carolyn Palmer, and Nathaniel H. Mayer. 1991. The quantitative description of action disorganisation after brain damage: A case study. Cognitive Neuropsychology 8, 5 (Sep 1991), 381–414. https://doi.org/10.1080/02643299108253379",
      "doi": ""
    },
    {
      "text": "Scope AR. 2018. Scope AR Brings the Next-Generation of Augmented Reality to the Enterprise with New AR Platform that Delivers Both Real-time Remote Assistance and AR Smart Instructions. https://www.prnewswire.com/news-releases/scope-ar-brings-the-next-generation-of-augmented-reality-to-the-enterprise-with-new-ar-platform-that-delivers-both-real-time-remote-assistance-and-ar-smart-instructions-300657204.html",
      "doi": ""
    },
    {
      "text": "Adriana M. Seelye, Maureen Schmitter-Edgecombe, Diane J. Cook, and Aaron Crandall. 2013. Naturalistic assessment of everyday activities and prompting technologies in mild cognitive impairment. Journal of the International Neuropsychological Society 19, 4(2013), 442–452. https://doi.org/10.1017/S135561771200149X",
      "doi": ""
    },
    {
      "text": "Adriana M. Seelye, Maureen Schmitter-Edgecombe, Barnan Das, and Diane J. Cook. 2012. Application of cognitive rehabilitation theory to the development of smart prompting technologies. , 29–44 pages. https://doi.org/10.1109/RBME.2012.2196691",
      "doi": ""
    },
    {
      "text": "Samuel Silva, Daniela Braga, and António Teixeira. 2014. AgeCI: HCI and Age Diversity. In Universal Access in Human-Computer Interaction. Aging and Assistive Environments. UAHCI 2014., Constantine Stephanidis and Margherita Antona (Eds.), Vol. 8515 LNCS. Springer International Publishing, Cham, 179–190. https://doi.org/10.1007/978-3-319-07446-7_18",
      "doi": "10.1007/978-3-319-07446-7_18"
    },
    {
      "text": "Hugo Simão and Tiago Guerreiro. 2019. MATY: Designing An Assistive Robot for People with Alzheimer’s. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems(CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3313016",
      "doi": "10.1145/3290607.3313016"
    },
    {
      "text": "Daniel Sonntag. 2015. Kognit: Intelligent Cognitive Enhancement Technology by Cognitive Models and Mixed Reality for Dementia Patients. https://www.aaai.org/ocs/index.php/FSS/FSS15/paper/view/11702/11476",
      "doi": ""
    },
    {
      "text": "Katherine M Tsui and Holly A Yanco. 2010. Prompting Devices: A Survey of Memory Aids for Task Sequencing. In Proc. of Quality of Life Technologies (QoLT) Intl. Symp.: Intelligent Systems for Better Living, held in conjunction with RESNA. Las Vegas, 1–7. http://robotics.cs.uml.edu/fileadmin/content/publications/2010/2010-06-qolt-ktsui-hyanco.pdfhttps://api.semanticscholar.org/CorpusID:15663680",
      "doi": ""
    },
    {
      "text": "Toni Van Laarhoven, Erika Kraus, Keri Karpman, Rosemary Nizzi, and Joe Valentino. 2010. A Comparison of Picture and Video Prompts to Teach Daily Living Skills to Individuals With Autism. Focus on Autism and Other Developmental Disabilities 25, 4 (Dec 2010), 195–208. https://doi.org/10.1177/1088357610380412",
      "doi": ""
    },
    {
      "text": "Alla Vovk, Ameera Patel, and Dennis Chan. 2019. Augmented Reality for Early Alzheimer’s Disease Diagnosis. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland, UK, 1–6. https://doi.org/10.1145/3290607.3313007",
      "doi": ""
    },
    {
      "text": "X. Wang, S. K. Ong, and A. Y.C. C Nee. 2016. A comprehensive survey of augmented reality assembly research. Advances in Manufacturing 4, 1 (Mar 2016), 1–22. https://doi.org/10.1007/s40436-015-0131-4",
      "doi": ""
    },
    {
      "text": "Maximilian Weiss, Katrin Angerbauer, Alexandra Voit, Magdalena Schwarzl, Michael Sedlmair, and Sven Mayer. 2020. Revisited: Comparison of Empirical Methods to Evaluate Visualizations Supporting Crafting and Assembly Purposes. IEEE Transactions on Visualization and Computer Graphics Early Access (Oct 2020), 1–1. https://doi.org/10.1109/tvcg.2020.3030400",
      "doi": ""
    },
    {
      "text": "Joseph P. Wherton and Andrew F. Monk. 2010. Problems people with dementia have with kitchen tasks: The challenge for pervasive computing. Interacting with Computers 22, 4 (Jul 2010), 253–266. https://doi.org/10.1016/j.intcom.2010.03.004",
      "doi": "10.1016/j.intcom.2010.03.004"
    },
    {
      "text": "Dennis Wolf, Daniel Besserer, Karolina Sejunaite, Anja Schuler, Matthias Riepe, and Enrico Rukzio. 2019. cARe: An Augmented Reality Support System for Geriatric Inpatients with Mild Cognitive Impairment. In Proceedings of the 18th International Conference on Mobile and Ubiquitous Multimedia (MUM ’19). Association for Computing Machinery, Pisa Italy, 11. https://doi.org/10.1145/3365610.3365612",
      "doi": "10.1145/3365610.3365612"
    }
  ]
}