{
  "doi": "10.1145/3411764.3445493",
  "title": "Crowdsourcing Design Guidance for Contextual Adaptation of Text Content in Augmented Reality",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Augmented Reality (AR) can deliver engaging user experiences that seamlessly meld virtual content with the physical environment. However, building such experiences is challenging due to the developer’s inability to assess how uncontrolled deployment contexts may influence the user experience. To address this issue, we demonstrate a method for rapidly conducting AR experiments and real-world data collection in the user’s own physical environment using a privacy-conscious mobile web application. The approach leverages the large number of distinct user contexts accessible through crowdsourcing to efficiently source diverse context and perceptual preference data. The insights gathered through this method complement emerging design guidance and sample-limited lab-based studies. The utility of the method is illustrated by re-examining the design challenge of adapting AR text content to the user’s environment. Finally, we demonstrate how gathered design insight can be operationalized to provide adaptive text content functionality in an AR headset.",
  "tags": [
    "Crowdsourcing",
    "Privacy",
    "Augmented Reality"
  ],
  "authors": [
    {
      "name": "John J. Dudley",
      "institution": "Department of Engineering University of Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659277381",
      "orcid": "missing"
    },
    {
      "name": "Jason T. Jacques",
      "institution": "Department of Engineering University of Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658722807",
      "orcid": "missing"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "Department of Engineering University of Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    }
  ],
  "references": [
    {
      "text": "Matthew J. C. Crump, John V. McDonnell, and Todd M. Gureckis. 2013. Evaluating Amazon’s Mechanical Turk as a Tool for Experimental Behavioral Research. PLOS ONE 8, 3 (March 2013), e57410. https://doi.org/10.1371/journal.pone.0057410",
      "doi": ""
    },
    {
      "text": "Florian Daniel, Pavel Kucherbaev, Cinzia Cappiello, Boualem Benatallah, and Mohammad Allahbakhsh. 2018. Quality Control in Crowdsourcing: A Survey of Quality Attributes, Assessment Techniques, and Assurance Actions. ACM Computing Surveys (CSUR) 51, 1 (April 2018), 7. https://doi.org/10.1145/3148148",
      "doi": "10.1145/3148148"
    },
    {
      "text": "Saverio Debernardis, Michele Fiorentino, Michele Gattullo, Giuseppe Monno, and Antonio Emmanuele Uva. 2014. Text Readability in Head-Worn Displays: Color and Style Optimization in Video versus Optical See-Through Devices. IEEE Transactions on Visualization and Computer Graphics 20, 1 (Jan. 2014), 125–139. https://doi.org/10.1109/TVCG.2013.86",
      "doi": "10.1109/TVCG.2013.86"
    },
    {
      "text": "John J. Dudley, Jason T. Jacques, and Per Ola Kristensson. 2019. Crowdsourcing Interface Feature Design with Bayesian Optimization. In Proceedings of the 2019 Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 252:1–252:12. https://doi.org/10.1145/3290605.3300482",
      "doi": "10.1145/3290605.3300482"
    },
    {
      "text": "Joseph L. Gabbard and J. Edward Swan II. 2008. Usability Engineering for Augmented Reality: Employing User-Based Studies to Inform Design. IEEE Transactions on Visualization and Computer Graphics 14, 3 (May 2008), 513–525. https://doi.org/10.1109/TVCG.2008.24",
      "doi": "10.1109/TVCG.2008.24"
    },
    {
      "text": "Joseph L. Gabbard, J. Edward Swan II, and Deborah Hix. 2006. The effects of text drawing styles, background textures, and natural lighting on text legibility in outdoor augmented reality. Presence: Teleoperators and Virtual Environments 15, 1 (Feb. 2006), 16–32. https://doi.org/10.1162/pres.2006.15.1.16",
      "doi": "10.1162/pres.2006.15.1.16"
    },
    {
      "text": "Joseph L. Gabbard, J. Edward Swan II, Deborah Hix, Robert S. Schulman, John Lucas, and Divya Gupta. 2005. An empirical user-based study of text drawing styles and outdoor background textures for augmented reality. In IEEE Proceedings. VR 2005. Virtual Reality, 2005.11–18. https://doi.org/10.1109/VR.2005.1492748",
      "doi": ""
    },
    {
      "text": "Ujwal Gadiraju, Ricardo Kawase, Stefan Dietze, and Gianluca Demartini. 2015. Understanding Malicious Behavior in Crowdsourcing Platforms: The Case of Online Surveys. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 1631–1640. https://doi.org/10.1145/2702123.2702443",
      "doi": "10.1145/2702123.2702443"
    },
    {
      "text": "Raphaël Grasset, Tobias Langlotz, Denis Kalkofen, Markus Tatzgern, and Dieter Schmalstieg. 2012. Image-driven view management for augmented reality browsers. In 2012 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). 177–186. https://doi.org/10.1109/ISMAR.2012.6402555",
      "doi": "10.1109/ISMAR.2012.6402555"
    },
    {
      "text": "David Hasler and Sabine E. Suesstrunk. 2003. Measuring colorfulness in natural images. In Human Vision and Electronic Imaging VIII, Vol. 5007. International Society for Optics and Photonics, 87–95. https://doi.org/10.1117/12.477378",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing Graphical Perception: Using Mechanical Turk to Assess Visualization Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). ACM, New York, NY, USA, 203–212. https://doi.org/10.1145/1753326.1753357",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Jason T. Jacques and Per Ola Kristensson. 2013. Crowdsourcing a HIT: Measuring Workers’ Pre-Task Interactions on Microtask Markets. In First AAAI Conference on Human Computation and Crowdsourcing.",
      "doi": ""
    },
    {
      "text": "Ernst Kruijff, Jason Orlosky, Naohiro Kishishita, Christina Trepkowski, and Kiyoshi Kiyokawa. 2018. The Influence of Label Design on Search Performance and Noticeability in Wide Field of View Augmented Reality Displays. IEEE Transactions on Visualization and Computer Graphics (2018), 1–1. https://doi.org/10.1109/TVCG.2018.2854737",
      "doi": ""
    },
    {
      "text": "Walter S. Lasecki, Mitchell Gordon, Winnie Leung, Ellen Lim, Jeffrey P. Bigham, and Steven P. Dow. 2015. Exploring Privacy and Accuracy Trade-Offs in Crowdsourced Behavioral Video Coding. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, New York, NY, USA, 1945–1954. https://doi.org/10.1145/2702123.2702605 Seoul, Republic of Korea.",
      "doi": "10.1145/2702123.2702605"
    },
    {
      "text": "Walter S. Lasecki, Young Chol Song, Henry Kautz, and Jeffrey P. Bigham. 2013. Real-Time Crowd Labeling for Deployable Activity Recognition. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work(CSCW ’13). Association for Computing Machinery, New York, NY, USA, 1203–1212. https://doi.org/10.1145/2441776.2441912 San Antonio, Texas, USA.",
      "doi": "10.1145/2441776.2441912"
    },
    {
      "text": "Alex Leykin and Mihran Tuceryan. 2004. Automatic determination of text readability over textured backgrounds for augmented reality systems. In Third IEEE and ACM International Symposium on Mixed and Augmented Reality. 224–230. https://doi.org/10.1109/ISMAR.2004.22",
      "doi": "10.1109/ISMAR.2004.22"
    },
    {
      "text": "David Lindlbauer, Anna Maria Feit, and Otmar Hilliges. 2019. Context-Aware Online Adaptation of Mixed Reality Interfaces. In Proceedings of the 32Nd Annual ACM Symposium on User Interface Software and Technology(UIST ’19). ACM, New York, NY, USA, 147–160. https://doi.org/10.1145/3332165.3347945 New Orleans, LA, USA.",
      "doi": "10.1145/3332165.3347945"
    },
    {
      "text": "Xiao Ma, Megan Cackett, Leslie Park, Eric Chien, and Mor Naaman. 2018. Web-Based VR Experiments Powered by the Crowd. In Proceedings of the 2018 World Wide Web Conference(WWW ’18). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 33–43. https://doi.org/10.1145/3178876.3186034",
      "doi": "10.1145/3178876.3186034"
    },
    {
      "text": "Jacob Boesen Madsen, Markus Tatzqern, Claus B. Madsen, Dieter Schmalstieg, and Denis Kalkofen. 2016. Temporal Coherence Strategies for Augmented Reality Labeling. IEEE Transactions on Visualization and Computer Graphics 22, 4 (April 2016), 1415–1423. https://doi.org/10.1109/TVCG.2016.2518318",
      "doi": "10.1109/TVCG.2016.2518318"
    },
    {
      "text": "Vito Modesto Manghisi, Michele Gattullo, Michele Fiorentino, Antonio Emmanuele Uva, Francescomaria Marino, Vitoantonio Bevilacqua, and Giuseppe Monno. 2017. Predicting Text Legibility over Textured Digital Backgrounds for a Monocular Optical See-Through Display. Presence: Teleoperators and Virtual Environments 26, 1(2017), 1–15.",
      "doi": "10.5555/3211567.3211569"
    },
    {
      "text": "Tara McAllister Byun, Peter F. Halpin, and Daniel Szeredi. 2015. Online crowdsourcing for efficient rating of speech: A validation study. Journal of Communication Disorders 53 (Jan. 2015), 70–83. https://doi.org/10.1016/j.jcomdis.2014.11.003",
      "doi": ""
    },
    {
      "text": "Daniel McDuff, Rana El Kaliouby, and Rosalind W. Picard. 2012. Crowdsourcing Facial Responses to Online Videos. IEEE Transactions on Affective Computing 3, 4 (2012), 456–468. https://doi.org/10.1109/T-AFFC.2012.19",
      "doi": "10.1109/T-AFFC.2012.19"
    },
    {
      "text": "Jason Orlosky, Kiyoshi Kiyokawa, and Haruo Takemura. 2013. Dynamic Text Management for See-through Wearable and Heads-up Display Systems. In Proceedings of the 2013 International Conference on Intelligent User Interfaces(IUI ’13). ACM, New York, NY, USA, 363–370. https://doi.org/10.1145/2449396.2449443 Santa Monica, California, USA.",
      "doi": "10.1145/2449396.2449443"
    },
    {
      "text": "Jason Orlosky, Kiyoshi Kiyokawa, and Haruo Takemura. 2014. Managing Mobile Text in Head Mounted Displays: Studies on Visual Preference and Text Placement. SIGMOBILE Mob. Comput. Commun. Rev. 18, 2 (June 2014), 20–31. https://doi.org/10.1145/2636242.2636246",
      "doi": "10.1145/2636242.2636246"
    },
    {
      "text": "Janne Paavilainen, Hannu Korhonen, Kati Alha, Jaakko Stenros, Elina Koskinen, and Frans Mayra. 2017. The PokéMon GO Experience: A Location-Based Augmented Reality Mobile Game Goes Mainstream. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 2493–2498. https://doi.org/10.1145/3025453.3025871",
      "doi": "10.1145/3025453.3025871"
    },
    {
      "text": "Chris Ridpath and Wendy Chisholm. 2000. Techniques For Accessibility Evaluation And Repair Tools. https://www.w3.org/TR/AERT",
      "doi": ""
    },
    {
      "text": "George Stockman and Linda G. Shapiro. 2001. Computer Vision (1sted.). Prentice Hall PTR, Upper Saddle River, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Chek Tien Tan, Hemanta Sapkota, and Daniel Rosser. 2014. BeFaced: A Casual Game to Crowdsource Facial Expressions in the Wild. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’14). ACM, New York, NY, USA, 491–494. https://doi.org/10.1145/2559206.2574773",
      "doi": ""
    },
    {
      "text": "Kohei Tanaka, Yasue Kishino, Masakazu Miyamae, Tsutomu Terada, and Shojiro Nishio. 2007. An Information Layout Method for an Optical See-through HMD Considering the Background. In 2007 11th IEEE International Symposium on Wearable Computers. 109–110. https://doi.org/10.1109/ISWC.2007.4373791 ISSN: 2376-8541.",
      "doi": "10.1109/ISWC.2007.4373791"
    },
    {
      "text": "Kohei Tanaka, Yasue Kishino, Masakazu Miyamae, Tsutomu Terada, and Shojiro Nishio. 2008. An Information Layout Method for an Optical See-through Head Mounted Display Focusing on the Viewability. In Proceedings of the 7th IEEE/ACM International Symposium on Mixed and Augmented Reality(ISMAR ’08). IEEE Computer Society, Washington, DC, USA, 139–142. https://doi.org/10.1109/ISMAR.2008.4637340",
      "doi": ""
    },
    {
      "text": "Markus Tatzgern, Valeria Orso, Denis Kalkofen, Giulio Jacucci, Luciano Gamberini, and Dieter Schmalstieg. 2016. Adaptive information density for augmented reality displays. In 2016 IEEE Virtual Reality (VR). 83–92. https://doi.org/10.1109/VR.2016.7504691 ISSN: 2375-5334.",
      "doi": ""
    },
    {
      "text": "Jason Wither, Stephen DiVerdi, and Tobias Höllerer. 2009. Annotation in outdoor augmented reality. Computers & Graphics 33, 6 (2009), 679 – 689. https://doi.org/10.1016/j.cag.2009.06.001",
      "doi": "10.1016/j.cag.2009.06.001"
    }
  ]
}