{
  "doi": "10.1145/3411764.3445359",
  "title": "What Happens After Death? Using a Design Workbook to Understand User Expectations for Preparing their Data",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Digital data has become a key part of everyday life: people manage increasingly large and disparate collections of photos, documents, media, etc. But what happens after death? How can users select and prepare what data to leave behind before their eventual death? To explore how to support users, we first ran an ideation workshop to generate design ideas; then, we created a design workbook with 12 speculative concepts that explore diverging approaches and perspectives. We elicited reactions to the concepts from 20 participants (18-81, varied occupations). We found that participants anticipated different types of motivation at different life stages, wished for tools to feel personal and intimate, and preferred individual control on their post-death self-representation. They also found comprehensive data replicas creepy and saw smart assistants as potential aides for suggesting meaningful data. Based on the results, we discuss key directions for designing more personalized and respectful death-preparation tools.",
  "authors": [
    {
      "name": "Janet X. Chen",
      "institution": "University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659547753",
      "orcid": "missing"
    },
    {
      "name": "Francesco Vitale",
      "institution": "University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163097",
      "orcid": "missing"
    },
    {
      "name": "Joanna McGrenere",
      "institution": "Computer Science University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232506",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Richard Banfield, C. Todd Lombardo, and Trace Wax. 2016. Design sprint: a practical guidebook for building great digital products. O’Reilly Media, Inc, Sebastopol, CA.",
      "doi": ""
    },
    {
      "text": "Richard Banks, David Kirk, and Abigail Sellen. 2012. A design perspective on three technology heirlooms. HUMAN–COMPUTER INTERACTION 27 (2012), 63–91. https://doi.org/10.1080/07370024.2012.656042",
      "doi": ""
    },
    {
      "text": "John A. Bargh, Katelyn Y. A. McKenna, and Grainne M. Fitzsimons. 2002. Can you see the real me? Activation and expression of the ”true self” on the internet. Journal of Social Issues 58, 1 (Jan. 2002), 33–48. https://doi.org/10.1111/1540-4560.00247",
      "doi": ""
    },
    {
      "text": "Russell W. Belk. 1988. Possessions and the Extended Self. Journal of Consumer Research 15, 2 (Sept. 1988), 139. https://doi.org/10.1086/209154",
      "doi": ""
    },
    {
      "text": "Ofer Bergman and Steve Whittaker. 2016. The science of managing our digital stuff. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Leslie Berlin. 2019. Opinion | I Needed to Save My Mother’s Memories. I Hacked Her Phone. (Published 2019). https://www.nytimes.com/2019/06/10/opinion/hacking-phone-privacy.html",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Enrique Encinas, Jofish Kaye, Miriam Lueck Avery, Rob McCabe, and Kristina Andersen. 2018. Imaginary design workbooks: constructive criticism and practical provocation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–12. https://doi.org/10.1145/3173574.3173807",
      "doi": "10.1145/3173574.3173807"
    },
    {
      "text": "Pauline Boss and Donna Carnes. 2012. The myth of closure. Family Process 51, 4 (Dec. 2012), 456–469. https://doi.org/10.1111/famp.12005",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (Jan 2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (Aug. 2019), 589–597. https://doi.org/10.1080/2159676X.2019.1628806",
      "doi": "10.1080/2159676X.2019.1628806"
    },
    {
      "text": "Jed R. Brubaker and Vanessa Callison-Burch. 2016. Legacy contact: designing and implementing post-mortem stewardship at facebook. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 2908–2919. https://doi.org/10.1145/2858036.2858254",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker and Gillian R. Hayes. 2011. ”We will never forget you [online]”: an empirical investigation of post-mortem myspace comments. In Proceedings of the ACM 2011 conference on Computer supported cooperative work - CSCW ’11. ACM Press, Hangzhou, China, 123. https://doi.org/10.1145/1958824.1958843",
      "doi": ""
    },
    {
      "text": "Jed R. Brubaker, Gillian R. Hayes, and Paul Dourish. 2013. Beyond the Grave: Facebook as a Site for the Expansion of Death and Mourning. The Information Society 29, 3 (May 2013), 152–163. https://doi.org/10.1080/01972243.2013.777300",
      "doi": "10.1080/01972243.2013.777300"
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory. Sage Publications, London ; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi and Eugene Halton. 1981. The meaning of things: domestic symbols and the self. Cambridge University Press, Cambridge [Eng.] ; New York.",
      "doi": ""
    },
    {
      "text": "Amber L. Cushing. 2013. “It’s stuff that speaks to me”: Exploring the characteristics of digital possessions. Journal of the American Society for Information Science and Technology 64, 8 (Aug. 2013), 1723–1734. https://doi.org/10.1002/asi.22864",
      "doi": ""
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Anind K. Dey, and John Zimmerman. 2007. Rapidly exploring application design through speed dating. In Proceedings of the 9th international conference on Ubiquitous computing(UbiComp ’07). Springer-Verlag, Innsbruck, Austria, 429–446.",
      "doi": "10.5555/1771592.1771617"
    },
    {
      "text": "Audrey Desjardins, Heidi R. Biggs, Cayla Key, and Jeremy E. Viny. 2020. IoT data in the home: observing entanglements and drawing new encounters. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–13. https://doi.org/10.1145/3313831.3376342",
      "doi": "10.1145/3313831.3376342"
    },
    {
      "text": "Jesse David Dinneen, Charles-Antoine Julien, and Ilja Frissen. 2019. The scale and structure of personal file collections. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, Glasgow Scotland UK, 1–12. https://doi.org/10.1145/3290605.3300557",
      "doi": "10.1145/3290605.3300557"
    },
    {
      "text": "David Frohlich and Rachel Murphy. 2000. The memory box. Personal Technologies 4, 4 (Dec. 2000), 238–240. https://doi.org/10.1007/BF02391566",
      "doi": ""
    },
    {
      "text": "William Gaver. 2011. Making spaces: how design workbooks work. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11. ACM Press, Vancouver, BC, Canada, 1551. https://doi.org/10.1145/1978942.1979169",
      "doi": "10.1145/1978942.1979169"
    },
    {
      "text": "Connie Golsteijn, Elise van den Hoven, David Frohlich, and Abigail Sellen. 2012. Towards a more cherishable digital object. In Proceedings of the Designing Interactive Systems Conference on - DIS ’12. ACM Press, Newcastle Upon Tyne, United Kingdom, 655. https://doi.org/10.1145/2317956.2318054",
      "doi": "10.1145/2317956.2318054"
    },
    {
      "text": "Jane Gruning and Siân Lindley. 2016. Things we own together: sharing possessions at home. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 1176–1186. https://doi.org/10.1145/2858036.2858154",
      "doi": "10.1145/2858036.2858154"
    },
    {
      "text": "Rebecca Gulotta, David B. Gerritsen, Aisling Kelliher, and Jodi Forlizzi. 2016. Engaging with Death Online: An Analysis of Systems that Support Legacy-Making, Bereavement, and Remembrance. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. ACM, Brisbane QLD Australia, 736–748. https://doi.org/10.1145/2901790.2901802",
      "doi": "10.1145/2901790.2901802"
    },
    {
      "text": "Rebecca Gulotta, William Odom, Haakon Faste, and Jodi Forlizzi. 2014. Legacy in the age of the internet: reflections on how interactive systems shape how we are remembered. In Proceedings of the 2014 conference on Designing interactive systems. ACM, Vancouver BC Canada, 975–984. https://doi.org/10.1145/2598510.2598579",
      "doi": "10.1145/2598510.2598579"
    },
    {
      "text": "Rebecca Gulotta, William Odom, Jodi Forlizzi, and Haakon Faste. 2013. Digital artifacts as legacy: exploring the lifespan and value of digital data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Paris France, 1813–1822. https://doi.org/10.1145/2470654.2466240",
      "doi": "10.1145/2470654.2466240"
    },
    {
      "text": "Rebecca Gulotta, Alex Sciuto, Aisling Kelliher, and Jodi Forlizzi. 2015. Curatorial Agents: How Systems Shape Our Understanding of Personal and Familial Digital Information. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 3453–3462. https://doi.org/10.1145/2702123.2702297",
      "doi": "10.1145/2702123.2702297"
    },
    {
      "text": "Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems the CHI is the limit - CHI ’99. ACM Press, Pittsburgh, Pennsylvania, United States, 159–166. https://doi.org/10.1145/302979.303030",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Elizabeth G. Hunter and Graham D. Rowles. 2005. Leaving a legacy: Toward a typology. Journal of Aging Studies 19, 3 (Sept. 2005), 327–347. https://doi.org/10.1016/j.jaging.2004.08.002",
      "doi": ""
    },
    {
      "text": "Jasmine Jones and Mark S. Ackerman. 2016. Curating an infinite basement: understanding how people manage collections of sentimental artifacts. In Proceedings of the 19th International Conference on Supporting Group Work. ACM, Sanibel Island Florida USA, 87–97. https://doi.org/10.1145/2957276.2957316",
      "doi": "10.1145/2957276.2957316"
    },
    {
      "text": "William Jones, Victoria Bellotti, Robert Capra, Jesse David Dinneen, Gloria Mark, Catherine Marshall, Karyn Moffatt, Jaime Teevan, and Maximus Van Kleek. 2016. For richer, for poorer, in sickness or in health... : the long-term management of personal information. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, San Jose California USA, 3508–3515. https://doi.org/10.1145/2851581.2856481",
      "doi": "10.1145/2851581.2856481"
    },
    {
      "text": "Joseph ’Jofish’ Kaye, Janet Vertesi, Shari Avery, Allan Dafoe, Shay David, Lisa Onaga, Ivan Rosero, and Trevor Pinch. 2006. To have and to hold: exploring the personal archive. In Proceedings of the SIGCHI conference on Human Factors in computing systems - CHI ’06. ACM Press, Montréal, Québec, Canada, 275. https://doi.org/10.1145/1124772.1124814",
      "doi": "10.1145/1124772.1124814"
    },
    {
      "text": "David S. Kirk, Shahram Izadi, Abigail Sellen, Stuart Taylor, Richard Banks, and Otmar Hilliges. 2010. Opening up the family archive. In Proceedings of the 2010 ACM conference on Computer supported cooperative work - CSCW ’10. ACM Press, Savannah, Georgia, USA, 261. https://doi.org/10.1145/1718918.1718968",
      "doi": "10.1145/1718918.1718968"
    },
    {
      "text": "Sampada Marathe and S. Shyam Sundar. 2011. What drives customization?: control or identity?. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11. ACM Press, Vancouver, BC, Canada, 781. https://doi.org/10.1145/1978942.1979056",
      "doi": "10.1145/1978942.1979056"
    },
    {
      "text": "Catherine C. Marshall. 2008. Rethinking personal digital archiving, part 2: implications for services, applications, and institutions. https://doi.org/10.1045/march2008-marshall-pt2",
      "doi": ""
    },
    {
      "text": "Catherine C. Marshall, Sara A. Bly, and Francoise Brun-Cottan. 2007. The Long Term Fate of Our Digital Belongings: Toward a Service Model for Personal Archives. CoRR abs/0704.3653(2007), 25–30. http://arxiv.org/abs/0704.3653",
      "doi": ""
    },
    {
      "text": "Hiroaki Masaki, Kengo Shibata, Shui Hoshino, Takahiro Ishihama, Nagayuki Saito, and Koji Yatani. 2020. Exploring nudge designs to help adolescent sns users avoid privacy and safety threats. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–11. https://doi.org/10.1145/3313831.3376666",
      "doi": "10.1145/3313831.3376666"
    },
    {
      "text": "Michael Massimi and Ronald M. Baecker. 2010. A death in the family: opportunities for designing technologies for the bereaved. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, Atlanta, Georgia, USA, 1821. https://doi.org/10.1145/1753326.1753600",
      "doi": "10.1145/1753326.1753600"
    },
    {
      "text": "Michael Massimi and Ronald M. Baecker. 2011. Dealing with death in design: developing systems for the bereaved. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11. ACM Press, Vancouver, BC, Canada, 1001. https://doi.org/10.1145/1978942.1979092",
      "doi": "10.1145/1978942.1979092"
    },
    {
      "text": "Tal Morse and Michael D. Birnhack. 2019. Digital remains: the users’ perspectives. , 107-126 pages. https://doi.org/10.2139/ssrn.3397533",
      "doi": ""
    },
    {
      "text": "William Odom, Richard Banks, David Kirk, Richard Harper, Siân Lindley, and Abigail Sellen. 2012. Technology heirlooms?: considerations for passing down and inheriting digital materials. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, Austin, Texas, USA, 337. https://doi.org/10.1145/2207676.2207723",
      "doi": "10.1145/2207676.2207723"
    },
    {
      "text": "William Odom, Richard Harper, Abigail Sellen, David Kirk, and Richard Banks. 2010. Passing on & putting to rest: understanding bereavement in the context of interactive technologies. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, Atlanta, Georgia, USA, 1831. https://doi.org/10.1145/1753326.1753601",
      "doi": "10.1145/1753326.1753601"
    },
    {
      "text": "William Odom, James Pierce, Erik Stolterman, and Eli Blevis. 2009. Understanding why we preserve some things and discard others in the context of interaction design. In Proceedings of the 27th international conference on Human factors in computing systems - CHI 09. ACM Press, Boston, MA, USA, 1053. https://doi.org/10.1145/1518701.1518862",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "William Odom, Abi Sellen, Richard Harper, and Eno Thereska. 2012. Lost in translation: understanding the possession of digital things in the cloud. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, Austin, Texas, USA, 781. https://doi.org/10.1145/2207676.2207789",
      "doi": "10.1145/2207676.2207789"
    },
    {
      "text": "William T. Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, Toronto Ontario Canada, 1961–1970. https://doi.org/10.1145/2556288.2557178",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Daniela Petrelli, Steve Whittaker, and Jens Brockmeier. 2008. AutoTypography: what can physical mementos tell us about digital memories?. In Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI ’08. ACM Press, Florence, Italy, 53. https://doi.org/10.1145/1357054.1357065",
      "doi": ""
    },
    {
      "text": "Joachim Pfister. 2017. ”This will cause a lot of work.”: Coping with Transferring Files and Passwords as Part of a Personal Digital Legacy. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, Portland Oregon USA, 1123–1138. https://doi.org/10.1145/2998181.2998262",
      "doi": "10.1145/2998181.2998262"
    },
    {
      "text": "Stacey Pitsillides. 2019. Digital legacy: Designing with things. Death Studies 43, 7 (Aug. 2019), 426–434. https://doi.org/10.1080/07481187.2018.1541939",
      "doi": ""
    },
    {
      "text": "Corina Sas and Alina Coman. 2016. Designing personal grief rituals: An analysis of symbolic objects and actions. Death Studies 40, 9 (Oct. 2016), 558–569. https://doi.org/10.1080/07481187.2016.1188868",
      "doi": ""
    },
    {
      "text": "Corina Sas, Miriam Schreiter, Monika Büscher, Fiorenza Gamba, and Alina Coman. 2019. Futures of digital death: Past, present and charting emerging research agenda. Death Studies 43, 7 (Aug. 2019), 407–413. https://doi.org/10.1080/07481187.2019.1647643",
      "doi": ""
    },
    {
      "text": "Corina Sas, Steve Whittaker, and John Zimmerman. 2016. Design for rituals of letting go: an embodiment perspective on disposal practices informed by grief therapy. ACM Transactions on Computer-Human Interaction 23, 4 (Sept. 2016), 1–37. https://doi.org/10.1145/2926714",
      "doi": "10.1145/2926714"
    },
    {
      "text": "Catrin Sohrabi, Zaid Alsafi, Niamh O’Neill, Mehdi Khan, Ahmed Kerwan, Ahmed Al-Jabir, Christos Iosifidis, and Riaz Agha. 2020. World Health Organization declares global emergency: A review of the 2019 novel coronavirus (COVID-19). International Journal of Surgery (London, England) 76 (April 2020), 71–76. https://doi.org/10.1016/j.ijsu.2020.02.034",
      "doi": ""
    },
    {
      "text": "Sheldon S. Tobin. 1996. Cherished possessions: The meaning of things. Generations: Journal of the American Society on Aging 20, 3 (1996), 46–48. https://www.jstor.org/stable/44877948",
      "doi": ""
    },
    {
      "text": "Andreas Tuerk. 2013. Plan your digital afterlife with Inactive Account Manager. https://publicpolicy.googleblog.com/2013/04/plan-your-digital-afterlife-with.html",
      "doi": ""
    },
    {
      "text": "Daisuke Uriu and Naohito Okude. 2010. ThanatoFenestra: photographic family altar supporting a ritual to pray for the deceased. In Proceedings of the 8th ACM Conference on Designing Interactive Systems - DIS ’10. ACM Press, Aarhus, Denmark, 422. https://doi.org/10.1145/1858171.1858253",
      "doi": "10.1145/1858171.1858253"
    },
    {
      "text": "Janet Vertesi, Jofish Kaye, Samantha N. Jarosewski, Vera D. Khovanskaya, and Jenna Song. 2016. Data Narratives: Uncovering tensions in personal data management. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, San Francisco California USA, 478–490. https://doi.org/10.1145/2818048.2820017",
      "doi": "10.1145/2818048.2820017"
    },
    {
      "text": "Francesco Vitale, Janet Chen, William Odom, and Joanna McGrenere. 2020. Data dashboard: exploring centralization and customization in personal data curation. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, Eindhoven Netherlands, 311–326. https://doi.org/10.1145/3357236.3395457",
      "doi": "10.1145/3357236.3395457"
    },
    {
      "text": "Francesco Vitale, Izabelle Janzen, and Joanna McGrenere. 2018. Hoarding and minimalism: tendencies in digital data preservation. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, Montreal QC Canada, 1–12. https://doi.org/10.1145/3173574.3174161",
      "doi": "10.1145/3173574.3174161"
    },
    {
      "text": "Francesco Vitale, William Odom, and Joanna McGrenere. 2019. Keeping and discarding personal data: exploring a design space. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, San Diego CA USA, 1463–1477. https://doi.org/10.1145/3322276.3322300",
      "doi": "10.1145/3322276.3322300"
    },
    {
      "text": "Jayne Wallace, Will Odom, Kyle Montague, Nantia Koulidou, Corina Sas, Kellie Morrissey, and Patrick Olivier. 2020. Hci at end of life & beyond. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–8. https://doi.org/10.1145/3334480.3375143",
      "doi": "10.1145/3334480.3375143"
    },
    {
      "text": "Rebecca D. Watkins, Abigail Sellen, and Siân E. Lindley. 2015. Digital collections and digital collecting practices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 3423–3432. https://doi.org/10.1145/2702123.2702380",
      "doi": "10.1145/2702123.2702380"
    },
    {
      "text": "Markus Weinmann, Christoph Schneider, and Jan vom Brocke. 2016. Digital nudging. Business & Information Systems Engineering 58, 6 (Dec. 2016), 433–436. https://doi.org/10.1007/s12599-016-0453-1",
      "doi": ""
    },
    {
      "text": "Steve Whittaker. 2011. Personal information management: From information consumption to curation. Annual Review of Information Science and Technology 45, 1(2011), 1–62. https://doi.org/10.1002/aris.2011.1440450108",
      "doi": "10.5555/2766865.2766873"
    },
    {
      "text": "Richmond Y. Wong, Deirdre K. Mulligan, Ellen Van Wyk, James Pierce, and John Chuang. 2017. Eliciting values reflections by engaging privacy futures using design workbooks. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (Dec. 2017), 1–26. https://doi.org/10.1145/3134746",
      "doi": "10.1145/3134746"
    },
    {
      "text": "Sijia Xiao, Danaë Metaxa, Joon Sung Park, Karrie Karahalios, and Niloufar Salehi. 2020. Random, messy, funny, raw: finstas as intimate reconfigurations of social media. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–13. https://doi.org/10.1145/3313831.3376424",
      "doi": "10.1145/3313831.3376424"
    },
    {
      "text": "John Zimmerman and Jodi Forlizzi. 2017. Speed dating: providing a menu of possible futures. She Ji: The Journal of Design, Economics, and Innovation 3, 1 (2017), 30–50. https://doi.org/10.1016/j.sheji.2017.08.003",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’07. ACM Press, San Jose, California, USA, 493–502. https://doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}