{
  "doi": "10.1145/3411764.3445459",
  "title": "What Makes a “Bad” Ad? User Perceptions of Problematic Online Advertising",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-24",
  "year": 2021,
  "badges": [],
  "abstract": "Online display advertising on websites is widely disliked by users, with many turning to ad blockers to avoid “bad” ads. Recent evidence suggests that today’s ads contain potentially problematic content, in addition to well-studied concerns about the privacy and intrusiveness of ads. However, we lack knowledge of which types of ad content users consider problematic and detrimental to their browsing experience. Our work bridges this gap: first, we create a taxonomy of 15 positive and negative user reactions to online advertising from a survey of 60 participants. Second, we characterize classes of online ad content that users dislike or find problematic, using a dataset of 500 ads crawled from popular websites, labeled by 1000 participants using our taxonomy. Among our findings, we report that users consider a substantial amount of ads on the web today to be clickbait, untrustworthy, or distasteful, including ads for software downloads, listicles, and health & supplements.",
  "authors": [
    {
      "name": "Eric Zeng",
      "institution": "Paul G. Allen School of Computer Science & Engineering University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659281318",
      "orcid": "missing"
    },
    {
      "name": "Tadayoshi Kohno",
      "institution": "Paul G. Allen School of Computer Science & Engineering University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100058677",
      "orcid": "0000-0002-4899-226X"
    },
    {
      "name": "Franziska Roesner",
      "institution": "Paul G. Allen School of Computer Science & Engineering University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81467642436",
      "orcid": "0000-0001-8735-4810"
    }
  ],
  "references": [
    {
      "text": "AARP. 2019. Dietary Supplement Scams. https://www.aarp.org/money/scams-fraud/info-2019/supplements.html.",
      "doi": ""
    },
    {
      "text": "AlgoAware. 2019. An overview of the Programmatic Advertising Ecosystem: Opportunities and Challenges. https://platformobservatory.eu/app/uploads/2019/10/An-overview-of-the-Programmatic-Advertising-Ecosystem-Opportunities-and-Challenges.pdf. Observatory on the Online Platform Economy.",
      "doi": ""
    },
    {
      "text": "Muhammad Ali, Piotr Sapiezynski, Miranda Bogen, Aleksandra Korolova, Alan Mislove, and Aaron Rieke. 2019. Discrimination through Optimization: How Facebook’s Ad Delivery Can Lead to Biased Outcomes. Proceedings of the ACM on Human-Computer Interaction 3, CSCW, Article 199 (Nov. 2019), 30 pages. https://doi.org/10.1145/3359301",
      "doi": ""
    },
    {
      "text": "Michelle A. Amazeen and Bartosz W. Wojdynski. 2019. Reducing Native Advertising Deception: Revisiting the Antecedents and Consequences of Persuasion Knowledge in Digital News Contexts. Mass Communication and Society 22, 2 (2019), 222–247.",
      "doi": ""
    },
    {
      "text": "Mimi An. 2016. Why People Block Ads (And What It Means for Marketers and Advertisers. https://web.archive.org/web/20200831221906/https://www.upa.it/static/upload/why/why-people-block-ads/why-people-block-ads.pdf. HubSpot Research.",
      "doi": ""
    },
    {
      "text": "Athanasios Andreou, Giridhari Venkatadri, Oana Goga, Krishna P. Gummadi, Patrick Loiseau, and Alan Mislove. 2018. Investigating Ad Transparency Mechanisms in Social Media: A Case Study of Facebooks Explanations. In 25th Annual Network and Distributed System Security Symposium, NDSS 2018, San Diego, California, USA, February 18-21, 2018. The Internet Society, Reston, VA, 15 pages. http://wp.internetsociety.org/ndss/wp-content/uploads/sites/25/2018/02/ndss2018_10-1_Andreou_paper.pdf",
      "doi": ""
    },
    {
      "text": "Anocha Aribarg and Eric M. Schwartz. 2020. Native Advertising in Online News: Trade-Offs Among Clicks, Brand Recognition, and Website Trustworthiness. Journal of Marketing Research 57, 1 (2020), 20–34. https://doi.org/10.1177/0022243719879711",
      "doi": ""
    },
    {
      "text": "Samantha Baker. 2019. How GOP-linked PR firms use Google’s ad platform to harvest email addresses. Engadget. https://www.engadget.com/2019-11-11-google-political-ads-polls-email-collection.html.",
      "doi": ""
    },
    {
      "text": "Muhammad Ahmad Bashir, Sajjad Arshad, William Robertson, and Christo Wilson. 2016. Tracing Information Flows Between Ad Exchanges Using Retargeted Ads. In 25th USENIX Security Symposium (USENIX Security 16). USENIX Association, Austin, TX, 481–496. https://www.usenix.org/conference/usenixsecurity16/technical-sessions/presentation/bashir",
      "doi": ""
    },
    {
      "text": "Andrew Blustein. 2020. Publishers May Lower Their Standards on Ad Quality in Search of Revenue. https://www.adweek.com/programmatic/publishers-may-lower-their-standards-on-ad-quality-in-search-of-revenue/. Adweek.",
      "doi": ""
    },
    {
      "text": "Christoph Bösch, Benjamin Erb, Frank Kargl, Henning Kopp, and Stefan Pfattheicher. 2016. Tales from the Dark Side: Privacy Dark Strategies and Privacy Dark Patterns. Proceedings on Privacy Enhancing Technologies 2016, 4 (July 2016), 237–254.",
      "doi": ""
    },
    {
      "text": "Giorgio Brajnik and Silvia Gabrielli. 2010. A Review of Online Advertising Effects on the User Experience. International Journal of Human–Computer Interaction 26, 10(2010), 971–997.",
      "doi": ""
    },
    {
      "text": "Joshua A. Braun and Jessica L. Eklund. 2019. Fake News, Real Money: Ad Tech Platforms, Profit-Driven Hoaxes, and the Business of Journalism. Digital Journalism 7, 1 (2019), 1–21. https://doi.org/10.1080/21670811.2018.1556314",
      "doi": ""
    },
    {
      "text": "Kathryn A. Braun and Elizabeth F. Loftus. 1998. Advertising’s misinformation effect. Applied Cognitive Psychology 12, 6 (1998), 569–591.",
      "doi": ""
    },
    {
      "text": "Harry Brignull. 2019. Dark Patterns. https://www.darkpatterns.org/.",
      "doi": ""
    },
    {
      "text": "Moira Burke, Anthony Hornof, Erik Nilsen, and Nicholas Gorman. 2005. High-Cost Banner Blindness: Ads Increase Perceived Workload, Hinder Visual Search, and Are Forgotten. ACM Trans. Comput.-Hum. Interact. 12, 4 (Dec. 2005), 423–445. https://doi.org/10.1145/1121112.1121116",
      "doi": "10.1145/1121112.1121116"
    },
    {
      "text": "Moira Burke, Anthony Hornof, Erik Nilsen, and Nicholas Gorman. 2005. High-Cost Banner Blindness: Ads Increase Perceived Workload, Hinder Visual Search, and Are Forgotten. ACM Transactions on Compututer-Human Interaction 12, 4 (Dec. 2005), 423–445.",
      "doi": "10.1145/1121112.1121116"
    },
    {
      "text": "Colin Campbell and Pamela E. Grimm. 2019. The Challenges Native Advertising Poses: Exploring Potential Federal Trade Commission Responses and Identifying Research Needs. Journal of Public Policy & Marketing 38, 1 (2019), 110–123.",
      "doi": ""
    },
    {
      "text": "Margaret C. Campbell. 1995. When Attention-Getting Advertising Tactics Elicit Consumer Inferences of Manipulative Intent: The Importance of Balancing Benefits and Investments. Journal of Consumer Psychology 4, 3 (1995), 225–254.",
      "doi": ""
    },
    {
      "text": "Federal Trade Comission. 2015. Native Advertising: A Guide for Businesses. https://www.ftc.gov/tips-advice/business-center/guidance/native-advertising-guide-businesses.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2015. Commission Enforcement Policy Statement on Deceptively Formatted Advertisements. https://www.ftc.gov/public-statements/2015/12/commission-enforcement-policy-statement-deceptively-formatted.",
      "doi": ""
    },
    {
      "text": "Henriette Cramer. 2015. Effects of Ad Quality & Content-Relevance on Perceived Content Quality. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2231–2234. https://doi.org/10.1145/2702123.2702360",
      "doi": "10.1145/2702123.2702360"
    },
    {
      "text": "Peter R. Darke and Robin J. B. Ritchie. 2007. The Defensive Consumer: Advertising Deception, Defensive Processing, and Distrust. Journal of Marketing Research 44, 1 (2007), 114–127.",
      "doi": ""
    },
    {
      "text": "Paresh Dave and Christopher Bing. 2019. Russian disinformation on YouTube draws ads, lacks warning labels: researchers. https://www.reuters.com/article/us-alphabet-google-youtube-russia/russian-disinformation-on-youtube-draws-ads-lacks-warning-labels-researchers-idUSKCN1T80JP.",
      "doi": ""
    },
    {
      "text": "Easylist Filter List Project. 2020. Easylist. https://easylist.to.",
      "doi": ""
    },
    {
      "text": "L. Edelson, T. Lauinger, and D. McCoy. 2020. A Security Analysis of the Facebook Ad Library. In 2020 IEEE Symposium on Security and Privacy (SP). IEEE, New York, NY, 661–678. https://doi.org/10.1109/SP40000.2020.00084",
      "doi": ""
    },
    {
      "text": "Steven M. Edwards, Hairong Li, and Joo-Hyun Lee. 2002. Forced Exposure and Psychological Reactance: Antecedents and Consequences of the Perceived Intrusiveness of Pop-Up Ads. Journal of Advertising 31, 3 (2002), 83–95.",
      "doi": ""
    },
    {
      "text": "Steven Englehardt and Arvind Narayanan. 2016. Online Tracking: A 1-Million-Site Measurement and Analysis. In Proceedings of the 2016 ACM SIGSAC Conference on Computer and Communications Security (Vienna, Austria) (CCS ’16). Association for Computing Machinery, New York, NY, USA, 1388–1401. https://doi.org/10.1145/2976749.2978313",
      "doi": "10.1145/2976749.2978313"
    },
    {
      "text": "Motahhare Eslami, Sneha R. Krishna Kumaran, Christian Sandvig, and Karrie Karahalios. 2018. Communicating Algorithmic Process in Online Behavioral Advertising. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174006",
      "doi": "10.1145/3173574.3174006"
    },
    {
      "text": "Irfan Faizullabhoy and Aleksandra Korolova. 2018. Facebook’s Advertising Platform: New Attack Vectors and the Need for Interventions. In Workshop on Consumer Protection (ConPro). IEEE, New York, NY, 6 pages.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2013. Blurred Lines: Advertising or Content? An FTC Workshop on Native Advertising. https://www.ftc.gov/system/files/documents/public_events/171321/final_transcript_1.pdf.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2013. .com Disclosures: How to Make Effective Disclosures in Digital Advertising. https://www.ftc.gov/system/files/documents/plain-language/bus41-dot-com-disclosures-information-about-online-advertising.pdf.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2017. An Exploration of Consumers’ Advertising Recognition in the Contexts of Search Engines and Native Advertising. https://www.ftc.gov/reports/blurred-lines-exploration-consumers-advertising-recognition-contexts-search-engines-native.",
      "doi": ""
    },
    {
      "text": "Federal Trade Commission. 2019. The Truth Behind Weight Loss Ads. https://www.consumer.ftc.gov/articles/truth-behind-weight-loss-ads.",
      "doi": ""
    },
    {
      "text": "Stacia Garlach and Daniel Suthers. 2018. ’I’m supposed to see that?’AdChoices Usability in the Mobile Environment. In Proceedings of the 51st Hawaii International Conference on System Sciences. University of Hawaii at Manoa, Honolulu, HI, 10 pages. https://doi.org/10.24251/HICSS.2018.476",
      "doi": ""
    },
    {
      "text": "Global Disinformation Index. 2019. Cutting the Funding of Disinformation: The Ad-Tech Solution. https://disinformationindex.org/wp-content/uploads/2019/05/GDI_Report_Screen_AW2.pdf.",
      "doi": ""
    },
    {
      "text": "Global Disinformation Index. 2019. The Quarter Billion Dollar Question: How is Disinformation Gaming Ad Tech?https://disinformationindex.org/wp-content/uploads/2019/09/GDI_Ad-tech_Report_Screen_AW16.pdf.",
      "doi": ""
    },
    {
      "text": "Daniel G. Goldstein, R. Preston McAfee, and Siddharth Suri. 2013. The Cost of Annoying Ads. In Proceedings of the 22nd International Conference on World Wide Web (Rio de Janeiro, Brazil) (WWW ’13). Association for Computing Machinery, New York, NY, USA, 459–470. https://doi.org/10.1145/2488388.2488429",
      "doi": "10.1145/2488388.2488429"
    },
    {
      "text": "Gustavo Gomez-Mejia. 2020. “Fail, Clickbait, Cringe, Cancel, Woke”: Vernacular Criticisms of Digital Advertising in Social Media Platforms. In HCII 2020: Social Computing and Social Media. Participation, User Experience, Consumer Experience, and Applications of Social Computing. Springer International Publishing, Cham, CH, 309–324.",
      "doi": ""
    },
    {
      "text": "Google. 2020. About responsive display ads. https://support.google.com/google-ads/answer/6363750?hl=en.",
      "doi": ""
    },
    {
      "text": "Google. 2020. Google Ads policies. https://support.google.com/adspolicy/answer/6008942.",
      "doi": ""
    },
    {
      "text": "Google. 2020. Puppeteer. https://developers.google.com/web/tools/puppeteer/.",
      "doi": ""
    },
    {
      "text": "Colin M. Gray, Yubo Kou, Bryan Battles, Joseph Hoggatt, and Austin L. Toombs. 2018. The Dark (Patterns) Side of UX Design. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174108",
      "doi": "10.1145/3173574.3174108"
    },
    {
      "text": "Lynn Hasher, David Goldstein, and Thomas Toppino. 1977. Frequency and the conference of referential validity. Journal of Verbal Learning and Verbal Behavior 16, 1 (1977), 107–112.",
      "doi": ""
    },
    {
      "text": "Weiyin Hong, James Y.L. Thong, and Kar Yan Tam. 2007. How do Web users respond to non-banner-ads animation? The effects of task type and user experience. Journal of the American Society for Information Science and Technology 58, 10 (2007), 1467–1482. https://doi.org/10.1002/asi.20624",
      "doi": "10.5555/1285300.1285310"
    },
    {
      "text": "Michael C Hughes and Erik B Sudderth. 2014. bnpy: Reliable and scalable variational inference for bayesian nonparametric models. In Proceedings of the NIPS Probabilistic Programming Workshop, Montreal, QC, Canada. MIT Press, Cambridge, MA, 8–13.",
      "doi": ""
    },
    {
      "text": "David A. Hyman, David J. Franklyn, Calla Yee, and Mohammad Rahmati. 2017. Going Native: Can Consumers Recognize Native Advertising? Does it Matter?19 Yale J.L. & Tech. 77.",
      "doi": ""
    },
    {
      "text": "Gita Venkataramani Johar. 1995. Consumer Involvement and Deception from Implied Advertising Claims. Journal of Marketing Research 32, 3 (1995), 267–279.",
      "doi": ""
    },
    {
      "text": "Gita Venkataramani Johar. 1996. Intended and Unintended Effects of Corrective Advertising on Beliefs and Evaluations: An Exploratory Analysis. Journal of Consumer Psychology 5, 3 (1996), 209–230.",
      "doi": ""
    },
    {
      "text": "Gita Venkataramani Johar. 2016. Mistaken Inferences from Advertising Conversations: A Modest Research Agenda. Journal of Advertising 45, 3 (2016), 318–325.",
      "doi": ""
    },
    {
      "text": "Gita Venkataramani Johar and Anne L. Roggeveen. 2007. Changing False Beliefs from Repeated Advertising: The Role of Claim-Refutation Alignment. Journal of Consumer Psychology 17, 2 (2007), 118–127.",
      "doi": ""
    },
    {
      "text": "Joshua Gillin. 2017. The more outrageous, the better: How clickbait ads make money for fake news sites. https://www.politifact.com/punditfact/article/2017/oct/04/more-outrageous-better-how-clickbait-ads-make-mone/.",
      "doi": ""
    },
    {
      "text": "A-Reum Jung and Jun Heo. 2019. Ad Disclosure vs. Ad Recognition: How Persuasion Knowledge Influences Native Advertising Evaluation. Journal of Interactive Advertising 19, 1 (2019), 1–14.",
      "doi": ""
    },
    {
      "text": "Dan Keating, Kevin Schaul, and Leslie Shapiro. 2017. The Facebook ads Russians targeted at different groups. The Washington Post. https://www.washingtonpost.com/graphics/2017/business/russian-ads-facebook-targeting/.",
      "doi": ""
    },
    {
      "text": "Young Mie Kim. 2018. Voter Suppression Has Gone Digital. Brennan Center for Justice. https://www.brennancenter.org/our-work/analysis-opinion/voter-suppression-has-gone-digital.",
      "doi": ""
    },
    {
      "text": "Young Mie Kim, Jordan Hsu, David Neiman, Colin Kou, Levi Bankston, Soo Yun Kim, Richard Heinrich, Robyn Baragwanath, and Garvesh Raskutti. 2018. The Stealth Media? Groups and Targets behind Divisive Issue Campaigns on Facebook. Political Communication 35, 4 (2018), 515–541.",
      "doi": ""
    },
    {
      "text": "Sara Kingsley, Clara Wang, Alex Mikhalenko, Proteeti Sinha, and Chinmay Kulkarni. 2020. Auditing Digital Platforms for Discrimination in Economic Opportunity Advertising. arxiv:2008.09656 [cs.CY]",
      "doi": ""
    },
    {
      "text": "S. Kullback and R. A. Leibler. 1951. On Information and Sufficiency. Ann. Math. Statist. 22, 1 (03 1951), 79–86. https://doi.org/10.1214/aoms/1177729694",
      "doi": ""
    },
    {
      "text": "Joe Lazauskas. 2016. Fixing Native Ads: What Consumers Want From Publishers, Brands, Facebook, and the FTC. Contently. https://the-content-strategist-13.docs.contently.com/v/fixing-sponsored-content-what-consumers-want-from-brands-publishers-and-the-ftc.",
      "doi": ""
    },
    {
      "text": "Victor Le Pochat, Tom Van Goethem, Samaneh Tajalizadehkhoob, Maciej Korczyński, and Wouter Joosen. 2019. Tranco: A Research-Oriented Top Sites Ranking Hardened Against Manipulation. In 26th Network and Distributed System Security Symposium (NDSS). The Internet Society, Reston, VA, 15 pages.",
      "doi": ""
    },
    {
      "text": "Mathias Lécuyer, Guillaume Ducoffe, Francis Lan, Andrei Papancea, Theofilos Petsios, Riley Spahn, Augustin Chaintreau, and Roxana Geambasu. 2014. XRay: Enhancing the Web’s Transparency with Differential Correlation. In 23rd USENIX Security Symposium (USENIX Security 14). USENIX Association, San Diego, CA, 49–64. https://www.usenix.org/conference/usenixsecurity14/technical-sessions/presentation/lecuyer",
      "doi": ""
    },
    {
      "text": "Mathias Lecuyer, Riley Spahn, Yannis Spiliopolous, Augustin Chaintreau, Roxana Geambasu, and Daniel Hsu. 2015. Sunlight: Fine-Grained Targeting Detection at Scale with Statistical Confidence. In Proceedings of the 22nd ACM SIGSAC Conference on Computer and Communications Security (Denver, Colorado, USA) (CCS ’15). Association for Computing Machinery, New York, NY, USA, 554–566. https://doi.org/10.1145/2810103.2813614",
      "doi": "10.1145/2810103.2813614"
    },
    {
      "text": "Dami Lee. 2020. The FTC is cracking down on influencer marketing on YouTube, Instagram, and TikTok. https://www.theverge.com/2020/2/12/21135183/ftc-influencer-ad-sponsored-tiktok-youtube-instagram-review. The Verge.",
      "doi": ""
    },
    {
      "text": "Adam Lerner, Anna Kornfeld Simpson, Tadayoshi Kohno, and Franziska Roesner. 2016. Internet Jones and the Raiders of the Lost Trackers: An Archaeological Study of Web Tracking from 1996 to 2016. In 25th USENIX Security Symposium (USENIX Security 16). USENIX Association, Austin, TX, 997–1013. https://www.usenix.org/conference/usenixsecurity16/technical-sessions/presentation/lerner",
      "doi": "10.5555/3241094.3241172"
    },
    {
      "text": "Zhou Li, Kehuan Zhang, Yinglian Xie, Fang Yu, and XiaoFeng Wang. 2012. Knowing Your Enemy: Understanding and Detecting Malicious Web Advertising. In Proceedings of the 2012 ACM Conference on Computer and Communications Security (Raleigh, North Carolina, USA) (CCS ’12). Association for Computing Machinery, New York, NY, USA, 674–686. https://doi.org/10.1145/2382196.2382267",
      "doi": "10.1145/2382196.2382267"
    },
    {
      "text": "Ad Lightning. 2020. The 2020 State of Ad Quality Report. Obtained at https://blog.adlightning.com/the-2020-state-of-ad-quality-report.",
      "doi": ""
    },
    {
      "text": "Tong Liu, Akash Venkatachalam, Pratik Sanjay Bongale, and Christopher Homan. 2019. Learning to Predict Population-Level Label Distributions. In Companion Proceedings of The 2019 World Wide Web Conference (San Francisco, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 1111–1120. https://doi.org/10.1145/3308560.3317082",
      "doi": "10.1145/3308560.3317082"
    },
    {
      "text": "John Mahoney. 2015. A Complete Taxonomy of Internet Chum. The Awl. https://www.theawl.com/2015/06/a-complete-taxonomy-of-internet-chum/.",
      "doi": ""
    },
    {
      "text": "Matthew Malloy, Mark McNamara, Aaron Cahn, and Paul Barford. 2016. Ad Blockers: Global Prevalence and Impact. In Proceedings of the 2016 Internet Measurement Conference (Santa Monica, California, USA) (IMC ’16). Association for Computing Machinery, New York, NY, USA, 119–125. https://doi.org/10.1145/2987443.2987460",
      "doi": "10.1145/2987443.2987460"
    },
    {
      "text": "Arunesh Mathur, Gunes Acar, Michael J. Friedman, Elena Lucherini, Jonathan Mayer, Marshini Chetty, and Arvind Narayanan. 2019. Dark Patterns at Scale: Findings from a Crawl of 11K Shopping Websites. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 81 (Nov. 2019), 32 pages. https://doi.org/10.1145/3359183",
      "doi": "10.1145/3359183"
    },
    {
      "text": "Arunesh Mathur, Arvind Narayanan, and Marshini Chetty. 2018. Endorsements on Social Media: An Empirical Study of Affiliate Marketing Disclosures on YouTube and Pinterest. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 119 (Nov. 2018), 26 pages. https://doi.org/10.1145/3274388",
      "doi": "10.1145/3274388"
    },
    {
      "text": "Cristina Miranda. 2017. Can you trust that ad for a dietary supplement?Federal Trade Commission. https://www.consumer.ftc.gov/blog/2017/11/can-you-trust-ad-dietary-supplement.",
      "doi": ""
    },
    {
      "text": "John Murphy. 2020. SSPs aren’t created equally: Insights into which SSPs drove the most problematic impressions in Q2, 2020. https://www.confiant.com/resources/blog/ssp-performance-q4-2019. Confiant.",
      "doi": ""
    },
    {
      "text": "Terry Nelms, Roberto Perdisci, Manos Antonakakis, and Mustaque Ahamad. 2016. Towards Measuring and Mitigating Social Engineering Software Download Attacks. In 25th USENIX Security Symposium (USENIX Security 16). USENIX Association, Austin, TX, 773–789. https://www.usenix.org/conference/usenixsecurity16/technical-sessions/presentation/nelms",
      "doi": ""
    },
    {
      "text": "Casey Newton. 2014. You might also like this story about weaponized clickbait. The Verge. https://www.theverge.com/2014/4/22/5639892/how-weaponized-clickbait-took-over-the-web.",
      "doi": ""
    },
    {
      "text": "N. Nikiforakis, A. Kapravelos, W. Joosen, C. Kruegel, F. Piessens, and G. Vigna. 2013. Cookieless Monster: Exploring the Ecosystem of Web-Based Device Fingerprinting. In 2013 IEEE Symposium on Security and Privacy. IEEE, New York, NY, 541–555. https://doi.org/10.1109/SP.2013.43",
      "doi": ""
    },
    {
      "text": "Midas Nouwens, Ilaria Liccardi, Michael Veale, David Karger, and Lalana Kagal. 2020. Dark Patterns after the GDPR: Scraping Consent Pop-Ups and Demonstrating Their Influence. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376321",
      "doi": "10.1145/3313831.3376321"
    },
    {
      "text": "Abby Ohlheiser. 2016. This is how Facebook’s fake-news writers make money. Washington Post. https://www.washingtonpost.com/news/the-intersect/wp/2016/11/18/this-is-how-the-internets-fake-news-writers-make-money/.",
      "doi": ""
    },
    {
      "text": "Michel Tuan Pham and Gita Venkataramani Johar. 1997. Contingent Processes of Source Identification. Journal of Consumer Research 24, 3 (1997), 249–265.",
      "doi": ""
    },
    {
      "text": "Angelisa C. Plane, Elissa M. Redmiles, Michelle L. Mazurek, and Michael Carl Tschantz. 2017. Exploring User Perceptions of Discrimination in Online Targeted Advertising. In 26th USENIX Security Symposium (USENIX Security 17). USENIX Association, Vancouver, BC, 935–951. https://www.usenix.org/conference/usenixsecurity17/technical-sessions/presentation/plane",
      "doi": ""
    },
    {
      "text": "Enric Pujol, Oliver Hohlfeld, and Anja Feldmann. 2015. Annoyed Users: Ads and Ad-Block Usage in the Wild. In Proceedings of the 2015 Internet Measurement Conference (Tokyo, Japan) (IMC ’15). Association for Computing Machinery, New York, NY, USA, 93–106. https://doi.org/10.1145/2815675.2815705",
      "doi": "10.1145/2815675.2815705"
    },
    {
      "text": "Vaibhav Rastogi, Rui Shao, Yan Chen, Xiang Pan, Shihong Zou, and Ryan Riley. 2016. Are these Ads Safe: Detecting Hidden Attacks through the Mobile App-Web Interfaces. In NDSS. The Internet Society, Reston, VA, 15 pages.",
      "doi": ""
    },
    {
      "text": "Filipe N. Ribeiro, Koustuv Saha, Mahmoudreza Babaei, Lucas Henrique, Johnnatan Messias, Fabricio Benevenuto, Oana Goga, Krishna P. Gummadi, and Elissa M. Redmiles. 2019. On Microtargeting Socially Divisive Ads: A Case Study of Russia-Linked Ad Campaigns on Facebook. In Proceedings of the Conference on Fairness, Accountability, and Transparency (Atlanta, GA, USA) (FAT* ’19). Association for Computing Machinery, New York, NY, USA, 140–149. https://doi.org/10.1145/3287560.3287580",
      "doi": "10.1145/3287560.3287580"
    },
    {
      "text": "Franziska Roesner, Tadayoshi Kohno, and David Wetherall. 2012. Detecting and Defending against Third-Party Tracking on the Web. In Proceedings of the 9th USENIX Conference on Networked Systems Design and Implementation (San Jose, CA) (NSDI’12). USENIX Association, USA, 12.",
      "doi": "10.5555/2228298.2228315"
    },
    {
      "text": "Anne L. Roggeveen and Gita Venkataramani Johar. 2002. Perceived Source Variability Versus Familiarity: Testing Competing Explanations for the Truth Effect. Journal of Consumer Psychology 12, 2 (2002), 81–91.",
      "doi": ""
    },
    {
      "text": "Christian Rohrer and John Boyd. 2004. The Rise of Intrusive Online Advertising and the Response of User Experience Research at Yahoo!. In CHI ’04 Extended Abstracts on Human Factors in Computing Systems (Vienna, Austria) (CHI EA ’04). Association for Computing Machinery, New York, NY, USA, 1085–1086. https://doi.org/10.1145/985921.985992",
      "doi": ""
    },
    {
      "text": "Matthew Rosenberg. 2019. Ad Tool Facebook Built to Fight Disinformation Doesn’t Work as Advertised. https://www.nytimes.com/2019/07/25/technology/facebook-ad-library.html.",
      "doi": ""
    },
    {
      "text": "Rahul Roy-Chowdhury. 2017. Improving advertising on the web. https://blog.chromium.org/2017/06/improving-advertising-on-web.html. Chromium Blog.",
      "doi": ""
    },
    {
      "text": "Navdeep S. Sahni and Harikesh Nair. 2018. Sponsorship Disclosure and Consumer Deception: Experimental Evidence from Native Advertising in Mobile Search. https://ssrn.com/abstract=2737035.",
      "doi": ""
    },
    {
      "text": "Sapna Maheshwari and John Herrman. 2016. Publishers Are Rethinking Those ‘Around the Web’ Ads. https://www.nytimes.com/2016/10/31/business/media/publishers-rethink-outbrain-taboola-ads.html.",
      "doi": ""
    },
    {
      "text": "Sergio Serra. 2019. Ad Quality: The Other Side Of The Fence. https://www.inmobi.com/blog/2019/05/10/ad-quality-the-other-side-of-the-fence. Inmobi.",
      "doi": ""
    },
    {
      "text": "Alex Shellhammer. 2016. The need for mobile speed. https://web.archive.org/web/20200723132931/https://www.blog.google/products/admanager/the-need-for-mobile-speed/. Google Official Blog.",
      "doi": ""
    },
    {
      "text": "Michael Swart, Ylana Lopez, Arunesh Mathur, and Marshini Chetty. 2020. Is This An Ad?: Automatically Disclosing Online Endorsements On YouTube With AdIntuition. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376178",
      "doi": "10.1145/3313831.3376178"
    },
    {
      "text": "James Temperton. 2017. We need to talk about the internet’s fake ads problem. Wired. https://www.wired.co.uk/article/fake-news-outbrain-taboola-hillary-clinton.",
      "doi": ""
    },
    {
      "text": "Kaitlyn Tiffany. 2019. A mysterious gut doctor is begging Americans to throw out “this vegetable” now. But, like, which?Vox. https://www.vox.com/the-goods/2019/5/8/18537279/chum-box-weird-sponsored-links-gut-doctor.",
      "doi": ""
    },
    {
      "text": "Blase Ur, Pedro Giovanni Leon, Lorrie Faith Cranor, Richard Shay, and Yang Wang. 2012. Smart, Useful, Scary, Creepy: Perceptions of Online Behavioral Advertising. In Proceedings of the Eighth Symposium on Usable Privacy and Security (Washington, D.C.) (SOUPS ’12). Association for Computing Machinery, New York, NY, USA, Article 4, 15 pages. https://doi.org/10.1145/2335356.2335362",
      "doi": "10.1145/2335356.2335362"
    },
    {
      "text": "G. Venkatadri, A. Andreou, Y. Liu, A. Mislove, K. P. Gummadi, P. Loiseau, and O. Goga. 2018. Privacy Risks with Facebook’s PII-Based Targeting: Auditing a Data Broker’s Advertising Interface. In 2018 IEEE Symposium on Security and Privacy (SP). IEEE, New York, NY, 89–107. https://doi.org/10.1109/SP.2018.00014",
      "doi": ""
    },
    {
      "text": "Paul Vines, Franziska Roesner, and Tadayoshi Kohno. 2017. Exploring ADINT: Using Ad Targeting for Surveillance on a Budget - or - How Alice Can Buy Ads to Track Bob. In Proceedings of the 2017 on Workshop on Privacy in the Electronic Society (Dallas, Texas, USA) (WPES ’17). Association for Computing Machinery, New York, NY, USA, 153–164. https://doi.org/10.1145/3139550.3139567",
      "doi": "10.1145/3139550.3139567"
    },
    {
      "text": "Tharindu Cyril Weerasooriya, Tong Liu, and Christopher M. Homan. 2020. Neighborhood-based Pooling for Population-level Label Distribution Learning. arxiv:2003.07406 [cs.LG]",
      "doi": ""
    },
    {
      "text": "Miranda Wei, Madison Stamos, Sophie Veys, Nathan Reitinger, Justin Goodman, Margot Herman, Dorota Filipczuk, Ben Weinshel, Michelle L. Mazurek, and Blase Ur. 2020. What Twitter Knows: Characterizing Ad Targeting Practices, User Perceptions, and Ad Explanations Through Users’ Own Twitter Data. In 29th USENIX Security Symposium (USENIX Security 20). USENIX Association, Austin, TX, 145–162. https://www.usenix.org/conference/usenixsecurity20/presentation/wei",
      "doi": ""
    },
    {
      "text": "Ben Weinshel, Miranda Wei, Mainack Mondal, Euirim Choi, Shawn Shan, Claire Dolin, Michelle L. Mazurek, and Blase Ur. 2019. Oh, the Places You’ve Been! User Reactions to Longitudinal Transparency About Third-Party Web Tracking and Inferencing. In Proceedings of the 2019 ACM SIGSAC Conference on Computer and Communications Security (London, United Kingdom) (CCS ’19). Association for Computing Machinery, New York, NY, USA, 149–166. https://doi.org/10.1145/3319535.3363200",
      "doi": "10.1145/3319535.3363200"
    },
    {
      "text": "Bartosz W. Wojdynski. 2016. The Deceptiveness of Sponsored News Articles: How Readers Recognize and Perceive Native Advertising. American Behavioral Scientist 60, 12 (2016), 1475–1491.",
      "doi": ""
    },
    {
      "text": "Bartosz W. Wojdynski and Nathaniel J. Evans. 2016. Going Native: Effects of Disclosure Position and Language on the Recognition and Evaluation of Online Native Advertising. Journal of Advertising 45, 2 (2016), 157–168.",
      "doi": ""
    },
    {
      "text": "Xinyu Xing, Wei Meng, Byoungyoung Lee, Udi Weinsberg, Anmol Sheth, Roberto Perdisci, and Wenke Lee. 2015. Understanding Malvertising Through Ad-Injecting Browser Extensions. In Proceedings of the 24th International Conference on World Wide Web (Florence, Italy) (WWW ’15). International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, CHE, 1286–1295. https://doi.org/10.1145/2736277.2741630",
      "doi": ""
    },
    {
      "text": "Apostolis Zarras, Alexandros Kapravelos, Gianluca Stringhini, Thorsten Holz, Christopher Kruegel, and Giovanni Vigna. 2014. The Dark Alleys of Madison Avenue: Understanding Malicious Advertisements. In Proceedings of the 2014 Conference on Internet Measurement Conference (Vancouver, BC, Canada) (IMC ’14). Association for Computing Machinery, New York, NY, USA, 373–380. https://doi.org/10.1145/2663716.2663719",
      "doi": "10.1145/2663716.2663719"
    },
    {
      "text": "Eric Zeng, Tadayoshi Kohno, and Franziska Roesner. 2020. Bad News: Clickbait and Deceptive Ads on News and Misinformation Websites. In Workshop on Technology and Consumer Protection (ConPro). IEEE, New York, NY, 11 pages.",
      "doi": ""
    },
    {
      "text": "Wei Zha and H. Denis Wu. 2014. The Impact of Online Disruptive Ads on Users’ Comprehension, Evaluation of Site Credibility, and Sentiment of Intrusiveness. American Communication Journal 16 (2014), 15–28. Issue 2.",
      "doi": ""
    },
    {
      "text": "Paolo Zialcita. 2019. FTC Issues Rules for Disclosure of Ads by Social Media Influencers. https://www.npr.org/2019/11/05/776488326/ftc-issues-rules-for-disclosure-of-ads-by-social-media-influencers. NPR.",
      "doi": ""
    }
  ]
}