{
  "doi": "10.1145/3411764.3445212",
  "title": "Understanding Everyday Experiences of Reminiscence for People with Blindness: Practices, Tensions and Probing New Design Possibilities",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "There is growing attention in the HCI community on how technology could be designed to support experiences of reminiscence on past life experiences. Yet, this research has largely overlooked people with blindness. We present a study that aims to understand everyday experiences of reminiscence for people with blindness. We conducted a qualitative study with 9 participants with blindness to understand their personal routines, wishes and desires, and challenges and tensions regarding the experience of reminiscence. Findings are interpreted to discuss new possibilities that offer starting points for future design initiatives and openings for collaboration aimed at creating technology to better support the practices of capturing, sharing, and reflecting on significant memories of the past.",
  "tags": [
    "Interaction Design",
    "Digital Memories",
    "People with Blindness",
    "Reminiscence"
  ],
  "authors": [
    {
      "name": "MinYoung Yoo",
      "institution": "School of Interactive Arts and Technology Simon Fraser University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659547336",
      "orcid": "0000-0001-9717-9382"
    },
    {
      "name": "William Odom",
      "institution": "School of Interactive Arts and Technology Simon Fraser University, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350582655",
      "orcid": "0000-0002-2824-9292"
    },
    {
      "name": "Arne Berger",
      "institution": "Computer Science and Languages Anhalt University of Applied Sciences, Germany",
      "img": "/do/10.1145/contrib-81442594089/rel-imgonly/bildschirmfoto_2022-11-04_um_09.59.58.png",
      "acmid": "81442594089",
      "orcid": "0000-0002-6398-839X"
    }
  ],
  "references": [
    {
      "text": "Avila, M. 2015. DroneNavigator: Using Drones for Navigating Visually Impaired Persons. Proceedings of the 17th International ACM SIGACCESS Conference on Computers & Accessibility (New York, NY, USA, 2015), 327–328.",
      "doi": "10.1145/2700648.2811362"
    },
    {
      "text": "Belk, R. 2010. Possessions and Self. Wiley International Encyclopedia of Marketing. American Cancer Society.",
      "doi": ""
    },
    {
      "text": "Bennett, C.L. 2019. Biographical Prototypes: Reimagining Recognition and Disability in Design. Proceedings of the 2019 on Designing Interactive Systems Conference (New York, NY, USA, Jun. 2019), 35–47.",
      "doi": "10.1145/3322276.3322376"
    },
    {
      "text": "Bennett, C.L. 2018. How Teens with Visual Impairments Take, Edit, and Share Photos on Social Media. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18 (Montreal QC, Canada, 2018), 1–12.",
      "doi": "10.1145/3173574.3173650"
    },
    {
      "text": "Bennett, C.L. and Rosner, D.K. 2019. The Promise of Empathy: Design, Disability, and Knowing the “Other.” Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19 (Glasgow, Scotland Uk, 2019), 1–13.",
      "doi": ""
    },
    {
      "text": "Borodin, Y. 2010. More Than Meets the Eye: A Survey of Screen-reader Browsing Strategies. Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A) (New York, NY, USA, 2010), 13:1-13:10.",
      "doi": "10.1145/1805986.1806005"
    },
    {
      "text": "Bowen, S. and Petrelli, D. 2011. Remembering today tomorrow: Exploring the human-centred design of digital mementos. International Journal of Human-Computer Studies. 69, 5 (May 2011), 324–337. DOI: https://doi.org/10.1016/j.ijhcs.2010.12.005.",
      "doi": "10.1016/j.ijhcs.2010.12.005"
    },
    {
      "text": "Buzzi, M.C. 2010. Accessing Google Docs via Screen Reader. Computers Helping People with Special Needs (Berlin, Heidelberg, 2010), 92–99.",
      "doi": ""
    },
    {
      "text": "Casey, E.S. 2009. Remembering: A phenomenological study. Indiana University Press.",
      "doi": ""
    },
    {
      "text": "Chen, A.Y.S. 2019. Chronoscope: Designing Temporally Diverse Interactions with Personal Digital Photo Collections. Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19 (San Diego, CA, USA, 2019), 799–812.",
      "doi": "10.1145/3322276.3322301"
    },
    {
      "text": "Chumkamon, S. 2008. A blind navigation system using RFID for indoor environments. 2008 5th International Conference on Electrical Engineering/Electronics, Computer, Telecommunications and Information Technology (May 2008), 765–768.",
      "doi": ""
    },
    {
      "text": "Cosley, D. 2012. Experiences With Designing Tools for Everyday Reminiscing. Human–Computer Interaction. 27, 1–2 (Apr. 2012), 175–198. DOI: https://doi.org/10.1080/07370024.2012.656047.",
      "doi": ""
    },
    {
      "text": "Costanza-Chock, S. 2020. Design Justice: Community-Led Practices to Build the Worlds We Need. MIT Press.",
      "doi": "10.7551/mitpress/12255.001.0001"
    },
    {
      "text": "Creswell, J.W. 2007. Five qualitative approaches to inquiry. Qualitative Inquiry and Research Design: Choosing Among Five Approaches. 53–80.",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. and Rochberg-Halton, E. 1981. The Meaning of Things: Domestic Symbols and the Self. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Desjardins, A. and Tihanyi, T. 2019. ListeningCups: A Case of Data Tactility and Data Stories. Proceedings of the 2019 on Designing Interactive Systems Conference (New York, NY, USA, Jun. 2019), 147–160.",
      "doi": "10.1145/3322276.3323694"
    },
    {
      "text": "Dib, L. 2010. Sonic souvenirs: exploring the paradoxes of recorded sound for family remembering. Proceedings of the 2010 ACM conference on Computer supported cooperative work - CSCW ’10 (Savannah, Georgia, USA, 2010), 391.",
      "doi": "10.1145/1718918.1718985"
    },
    {
      "text": "Dong, T. 2014. “If these walls could talk”: designing with memories of places. Proceedings of the 2014 conference on Designing interactive systems (New York, NY, USA, Jun. 2014), 63–72.",
      "doi": "10.1145/2598510.2598605"
    },
    {
      "text": "Duel, T. 2018. Supporting Audiography: Design of a System for Sentimental Sound Recording, Classification and Playback. HCI International 2018 – Posters’ Extended Abstracts (Cham, 2018), 24–31.",
      "doi": ""
    },
    {
      "text": "Elsden, C. 2016. A Quantified Past: Toward Design for Remembering With Personal Informatics. Human–Computer Interaction. 31, 6 (Nov. 2016), 518–557. DOI: https://doi.org/10.1080/07370024.2015.1093422.",
      "doi": "10.1080/07370024.2015.1093422"
    },
    {
      "text": "Elsden, C. 2016. Fitter, happier, more productive: what to ask of a data-driven life. interactions. 23, 5 (2016), 45–45.",
      "doi": ""
    },
    {
      "text": "Evans, G. and Blenkhorn, P. 2008. Screen Readers and Screen Magnifiers. Assistive Technology for Visually Impaired and Blind People. M.A. Hersh and M.A. Johnson, eds. Springer London. 449–495.",
      "doi": ""
    },
    {
      "text": "Faria, J. 2010. Electronic white cane for blind people navigation assistance. 2010 World Automation Congress (Sep. 2010), 1–7.",
      "doi": ""
    },
    {
      "text": "Filipe, V. 2012. Blind Navigation Support System based on Microsoft Kinect. Procedia Computer Science. 14, (Jan. 2012), 94–101. DOI: https://doi.org/10.1016/j.procs.2012.10.011.",
      "doi": ""
    },
    {
      "text": "Friske, M. 2020. Entangling the Roles of Maker and Interpreter in Interpersonal Data Narratives: Explorations in Yarn and Sound. Proceedings of the 2020 ACM Designing Interactive Systems Conference (New York, NY, USA, Jul. 2020), 297–310.",
      "doi": "10.1145/3357236.3395442"
    },
    {
      "text": "Frohlich, D. and Murphy, R. 2000. The Memory Box. Personal Technologies. 4, 4 (Dec. 2000), 238–240. DOI: https://doi.org/10.1007/BF02391566.",
      "doi": ""
    },
    {
      "text": "Frohlich, D.M. 2004. Audiophotography: Bringing Photos to Life with Sounds. Springer Science & Business Media.",
      "doi": "10.5555/1210132"
    },
    {
      "text": "Gaver, W. 2011. The Photostroller: Supporting Diverse Care Home Residents in Engaging with the World. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2011), 1757–1766.",
      "doi": "10.1145/1978942.1979198"
    },
    {
      "text": "Glaser, B.G. and Strauss, A.L. 2017. Discovery of Grounded Theory: Strategies for Qualitative Research. Routledge.",
      "doi": ""
    },
    {
      "text": "Hamraie, A. 2017. Building Access: Universal Design and the Politics of Disability. U of Minnesota Press.",
      "doi": ""
    },
    {
      "text": "Hauser, S. 2014. Understanding guide dog team interactions: design opportunities to support work and play. Proceedings of the 2014 conference on Designing interactive systems (New York, NY, USA, Jun. 2014), 295–304.",
      "doi": "10.1145/2598510.2598531"
    },
    {
      "text": "Herron, D. 2016. Digital Possessions After a Romantic Break Up. Proceedings of the 9th Nordic Conference on Human-Computer Interaction - NordiCHI ’16 (Gothenburg, Sweden, 2016), 1–10.",
      "doi": "10.1145/2971485.2971539"
    },
    {
      "text": "Hersh, M.A. and Johnson, M.A. 2008. Assistive Technology for Daily Living. Assistive Technology for Visually Impaired and Blind People. M.A. Hersh and M.A. Johnson, eds. Springer London. 615–657.",
      "doi": ""
    },
    {
      "text": "Heshmat, Y. 2020. FamilyStories: Asynchronous Audio Storytelling for Family Members Across Time Zones. Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu HI USA, Apr. 2020), 1–14.",
      "doi": "10.1145/3313831.3376486"
    },
    {
      "text": "Hsieh, P.-C. 2011. SoundCapsule: The study of reminiscence triggered by utilizing sound media and technology. Proceedings of the 4th World Conference on Design Research (2011), 10.",
      "doi": ""
    },
    {
      "text": "James, W. 1890. The Principles of Psychology. Henry Holt and Company.",
      "doi": ""
    },
    {
      "text": "Jayaratne, K. 2016. The Memory Tree: Using Sound to Support Reminiscence. (2016), 6.",
      "doi": ""
    },
    {
      "text": "Jones, J. 2017. KidKeeper: Design for Capturing Audio Mementos of Everyday Life for Parents of Young Children. Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (New York, NY, USA, Feb. 2017), 1864–1875.",
      "doi": "10.1145/2998181.2998348"
    },
    {
      "text": "José, J. 2011. The SmartVision local navigation aid for blind and visually impaired persons. International Journal of Digital Content Technology and its Applications. 5, 5 (May 2011), 362–375. DOI: https://doi.org/10.4156/jdcta.vol5.issue5.40.",
      "doi": ""
    },
    {
      "text": "Kirk, D.S. and Sellen, A. 2010. On human remains: Values and practice in the home archiving of cherished objects. ACM Transactions on Computer-Human Interaction (TOCHI). 17, 3 (2010), 10.",
      "doi": "10.1145/1806923.1806924"
    },
    {
      "text": "Lefeuvre, K. 2016. Loaded Dice: Exploring the Design Space of Connected Devices with Blind and Visually Impaired People. Proceedings of the 9th Nordic Conference on Human-Computer Interaction (New York, NY, USA, 2016), 31:1-31:10.",
      "doi": "10.1145/2971485.2971524"
    },
    {
      "text": "Lottridge, D. 2009. Sharing empty moments: design for remote couples. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2009), 2329–2338.",
      "doi": "10.1145/1518701.1519058"
    },
    {
      "text": "Maberley, D. a. L. 2006. The prevalence of low vision and blindness in Canada. Eye. 20, 3 (Mar. 2006), 341–346. DOI: https://doi.org/10.1038/sj.eye.6701879.",
      "doi": ""
    },
    {
      "text": "Mankoff, J. 2010. Disability studies as a source of critical inquiry for the field of assistive technology. Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility - ASSETS ’10 (Orlando, Florida, USA, 2010), 3.",
      "doi": "10.1145/1878803.1878807"
    },
    {
      "text": "Martin, H. and Gaver, B. 2000. Beyond the snapshot from speculation to prototypes in audiophotography. Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques (New York, NY, USA, Aug. 2000), 55–65.",
      "doi": "10.1145/347642.347663"
    },
    {
      "text": "McAdams, D.P. 2003. Identity and the Life Story. Autobiographical Memory and the Construction of A Narrative Self: Developmental and Cultural Perspectives. Psychology Press. 187–207.",
      "doi": ""
    },
    {
      "text": "McGookin, D. 2019. Reveal: Investigating Proactive Location-Based Reminiscing with Personal Digital Photo Repositories. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, May 2019), 1–14.",
      "doi": "10.1145/3290605.3300665"
    },
    {
      "text": "Metatla, O. 2015. Designing with and for people living with visual impairments: audio-tactile mock-ups, audio diaries and participatory prototyping. CoDesign. 11, 1 (Jan. 2015), 35–48. DOI: https://doi.org/10.1080/15710882.2015.1007877.",
      "doi": ""
    },
    {
      "text": "Miles, M.B. and Huberman, A.M. 1994. Qualitative Data Analysis: An Expanded Sourcebook. SAGE.",
      "doi": ""
    },
    {
      "text": "Mosher, M. 2017. If These Walls Could Speak: Tangible Memories. (2017), 4.",
      "doi": ""
    },
    {
      "text": "Neumüller, M. and Reichinger, A. From Stereoscopy to Tactile Photography. 5.",
      "doi": ""
    },
    {
      "text": "Niemantsverdriet, K. and Versteeg, M. 2016. Interactive Jewellery as Memory Cue: Designing a Sound Locket for Individual Reminiscence. Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI ’16 (Eindhoven, Netherlands, 2016), 532–538.",
      "doi": ""
    },
    {
      "text": "Nissen, B. 2014. Volvelles, Domes and Wristbands: Embedding Digital Fabrication Within a Visitor's Trajectory of Engagement. (2014), 11.",
      "doi": ""
    },
    {
      "text": "Nissen, B. and Bowers, J. 2015. Data-Things: Digital Fabrication Situated within Participatory Data Translation Activities. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15 (Seoul, Republic of Korea, 2015), 2467–2476.",
      "doi": ""
    },
    {
      "text": "Odom, W. 2020. Exploring the Reflective Potentialities of Personal Data with Different Temporal Modalities: A Field Study of Olo Radio. Proceedings of the 2020 ACM on Designing Interactive Systems Conference (Eindhoven, Netherlands, Jul. 2020), 283–295.",
      "doi": "10.1145/3357236.3395438"
    },
    {
      "text": "Odom, W. 2019. Investigating Slowness As a Frame to Design Longer-Term Experiences with Personal Data: A Field Study of Olly. Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2019), 34:1-34:16.",
      "doi": "10.1145/3290605.3300264"
    },
    {
      "text": "Odom, W. 2012. Photobox: On the Design of a Slow Technology. Proceedings of the Designing Interactive Systems Conference (New York, NY, USA, 2012), 665–668.",
      "doi": "10.1145/2317956.2318055"
    },
    {
      "text": "Odom, W. 2014. Placelessness, spacelessness, and formlessness: experiential qualities of virtual possessions. Proceedings of the 2014 conference on Designing interactive systems - DIS ’14 (Vancouver, BC, Canada, 2014), 985–994.",
      "doi": "10.1145/2598510.2598577"
    },
    {
      "text": "Odom, W. 2012. Technology heirlooms?: considerations for passing down and inheriting digital materials. Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12 (Austin, Texas, USA, 2012), 337.",
      "doi": "10.1145/2207676.2207723"
    },
    {
      "text": "Odom, W. 2015. Understanding long-term interactions with a slow technology: An investigation of experiences with FutureMe. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (2015), 575–584.",
      "doi": "10.1145/2702123.2702221"
    },
    {
      "text": "Odom, W. and Duel, T. 2018. On the Design of OLO Radio: Investigating Metadata as a Design Material. Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18 (Montreal QC, Canada, 2018), 1–9.",
      "doi": ""
    },
    {
      "text": "Odom, W.T. 2014. Designing for Slowness, Anticipation and Re-visitation: A Long Term Field Study of the Photobox. Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (New York, NY, USA, 2014), 1961–1970.",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Odom, W.T. 2014. Designing for Slowness, Anticipation and Re-visitation: A Long Term Field Study of the Photobox. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New York, NY, USA, 2014), 1961–1970.",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "Oleksik, G. 2008. Sonic interventions: understanding and extending the domestic soundscape. Proceeding of the twenty-sixth annual CHI conference on Human factors in computing systems - CHI ’08 (Florence, Italy, 2008), 1419.",
      "doi": ""
    },
    {
      "text": "Oleksik, G. and Brown, L.M. 2008. Sonic gems: exploring the potential of audio recording as a form of sentimental memory capture. Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction - Volume 1 (Swindon, GBR, Sep. 2008), 163–172.",
      "doi": ""
    },
    {
      "text": "Peesapati, S.T. 2010. Pensieve: supporting everyday reminiscence. Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10 (Atlanta, Georgia, USA, 2010), 2027.",
      "doi": "10.1145/1753326.1753635"
    },
    {
      "text": "Peesapati, S.T. 2010. Triggering memories with online maps. Proceedings of the 73rd ASIS&T Annual Meeting on Navigating Streams in an Information Ecosystem - Volume 47 (USA, Oct. 2010), 1–4.",
      "doi": ""
    },
    {
      "text": "Petrelli, D. 2008. AutoTopography: what can physical mementos tell us about digital memories? Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (2008), 53–62.",
      "doi": "10.1145/1357054.1357065"
    },
    {
      "text": "Petrelli, D. 2010. FM radio: family interplay with sonic mementos. Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10 (Atlanta, Georgia, USA, 2010), 2371.",
      "doi": "10.1145/1753326.1753683"
    },
    {
      "text": "Petrelli, D. 2017. Tangible data souvenirs as a bridge between a physical museum visit and online digital experience. Personal and Ubiquitous Computing. 21, 2 (Apr. 2017), 281–295. DOI: https://doi.org/10.1007/s00779-016-0993-x.",
      "doi": "10.1007/s00779-016-0993-x"
    },
    {
      "text": "Pierce, J. and Paulos, E. 2013. Electric materialities and interactive technology. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2013), 119–128.",
      "doi": "10.1145/2470654.2470672"
    },
    {
      "text": "Procyk, J. and Neustaedter, C. 2014. GEMS: the design and evaluation of a location-based storytelling game. Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing (New York, NY, USA, Feb. 2014), 1156–1166.",
      "doi": ""
    },
    {
      "text": "Race, L. 2019. Designing Tactile Schematics: Improving Electronic Circuit Accessibility. The 21st International ACM SIGACCESS Conference on Computers and Accessibility (New York, NY, USA, Oct. 2019), 581–583.",
      "doi": "10.1145/3308561.3354610"
    },
    {
      "text": "Saha, A. and Piper, A.M. 2020. Understanding Audio Production Practices of People with Vision Impairments. ASSETS ’20: The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (2020), 13.",
      "doi": "10.1145/3373625.3416993"
    },
    {
      "text": "Screen Readers | American Foundation for the Blind: https://www.afb.org/blindness-and-low-vision/using-technology/assistive-technology-products/screen-readers. Accessed: 2019-12-17.",
      "doi": ""
    },
    {
      "text": "Selby, M. 2017. Experiential manufacturing: designing meaningful relationships between people, data and things. University of Nottingham.",
      "doi": ""
    },
    {
      "text": "Shoval, S. 1998. Auditory guidance with the Navbelt-a computerized travel aid for the blind. IEEE Transactions on Systems, Man, and Cybernetics, Part C (Applications and Reviews). 28, 3 (Aug. 1998), 459–467. DOI: https://doi.org/10.1109/5326.704589.",
      "doi": "10.1109/5326.704589"
    },
    {
      "text": "Silverman, A.M. 2015. The Perils of Playing Blind: Problems with Blindness Simulation and a Better Way to Teach about Blindness. The Journal of Blindness Innovation and Research. 5, 2 (2015).",
      "doi": ""
    },
    {
      "text": "Siu, A.F. 2019. shapeCAD: An Accessible 3D Modelling Workflow for the Blind and Visually-Impaired Via 2.5D Shape Displays. The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh PA USA, Oct. 2019), 342–354.",
      "doi": "10.1145/3308561.3353782"
    },
    {
      "text": "Spiel, K. 2020. Nothing About Us Without Us: Investigating the Role of Critical Disability Studies in HCI. Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2020), 1–8.",
      "doi": ""
    },
    {
      "text": "The Ohio State University and Karbowski, C. 2020. See3D: 3D Printing for People Who Are Blind. Journal of Science Education for Students with Disabilities. 23, 1 (Feb. 2020). DOI: https://doi.org/10.14448/jsesd.12.0006.",
      "doi": ""
    },
    {
      "text": "Thomas, L. 2018. A life story in three parts: the use of triptychs to make sense of personal digital data. Personal and Ubiquitous Computing. 22, 4 (Aug. 2018), 691–705. DOI: https://doi.org/10.1007/s00779-018-1110-0.",
      "doi": "10.1007/s00779-018-1110-0"
    },
    {
      "text": "Thomas, L. and Briggs, P. 2016. Reminiscence through the Lens of Social Media. Frontiers in Psychology. 7, (2016). DOI: https://doi.org/10.3389/fpsyg.2016.00870.",
      "doi": ""
    },
    {
      "text": "Tsai, W.-C. 2014. The reflexive printer: toward making sense of perceived drawbacks in technology-mediated reminiscence. Proceedings of the 2014 conference on Designing interactive systems (New York, NY, USA, Jun. 2014), 995–1004.",
      "doi": "10.1145/2598510.2598589"
    },
    {
      "text": "Tsai, W.-C. and Chen, A.Y.S. CrescendoMessage: Interacting with Slow Messaging. 18.",
      "doi": ""
    },
    {
      "text": "Ulrich, I. and Borenstein, J. 2001. The GuideCane-applying mobile robot technologies to assist the visually impaired. IEEE Transactions on Systems, Man, and Cybernetics - Part A: Systems and Humans. 31, 2 (Mar. 2001), 131–136. DOI: https://doi.org/10.1109/3468.911370.",
      "doi": "10.1109/3468.911370"
    },
    {
      "text": "Uriu, D. 2018. SenseCenser: an Interactive Device for Sensing Incense Smoke & Supporting Memorialization Rituals in Japan. Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility - DIS ’18 (Hong Kong, China, 2018), 315–318.",
      "doi": "10.1145/3197391.3205394"
    },
    {
      "text": "Van Kleek, M. and OHara, K. 2014. The Future of Social Is Personal: The Potential of the Personal Data Store. Social Collective Intelligence. Springer. 125–158.",
      "doi": ""
    },
    {
      "text": "Vitale, F. 2019. Keeping and Discarding Personal Data: Exploring a Design Space. Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA, Jun. 2019), 1463–1477.",
      "doi": "10.1145/3322276.3322300"
    },
    {
      "text": "Webster, J.D. and McCall, M.E. 1999. Reminiscence Functions Across Adulthood: A Replication and Extension. Journal of Adult Development. 6, 1 (Jan. 1999), 73–85. DOI: https://doi.org/10.1023/A:1021628525902.",
      "doi": ""
    },
    {
      "text": "White, J. 2020. Exploring Location Histories as a Design Material for Reflection with Memory Compass & Memory Tracer. Companion Publication of the 2020 ACM Designing Interactive Systems Conference (New York, NY, USA, Jul. 2020), 221–226.",
      "doi": "10.1145/3393914.3395878"
    },
    {
      "text": "Williamson, J. and Brown, L.M. 2008. Flutter: directed random browsing of photo collections with a tangible interface. Proceedings of the 7th ACM conference on Designing interactive systems - DIS ’08 (Cape Town, South Africa, 2008), 147–155.",
      "doi": ""
    },
    {
      "text": "Ymous, A. 2020. “I am just terrified of my future”—Epistemic Violence in Disability Related Technology Research. Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (New York, NY, USA, Apr. 2020), 1–16.",
      "doi": ""
    }
  ]
}