{
  "doi": "10.1145/3411764.3445338",
  "title": "Voicemoji: Emoji Entry Using Voice for Visually Impaired People",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2021,
  "badges": [],
  "abstract": "Keyboard-based emoji entry can be challenging for people with visual impairments: users have to sequentially navigate emoji lists using screen readers to find their desired emojis, which is a slow and tedious process. In this work, we explore the design and benefits of emoji entry with speech input, a popular text entry method among people with visual impairments. After conducting interviews to understand blind or low vision (BLV) users’ current emoji input experiences, we developed Voicemoji, which (1) outputs relevant emojis in response to voice commands, and (2) provides context-sensitive emoji suggestions through speech output. We also conducted a multi-stage evaluation study with six BLV participants from the United States and six BLV participants from China, finding that Voicemoji significantly reduced entry time by 91.2% and was preferred by all participants over the Apple iOS keyboard. Based on our findings, we present Voicemoji as a feasible solution for voice-based emoji entry.",
  "authors": [
    {
      "name": "Mingrui Ray Zhang",
      "institution": "The Information School University of Washington, United States",
      "img": "/do/10.1145/contrib-99659529048/rel-imgonly/f.png",
      "acmid": "99659529048",
      "orcid": "missing"
    },
    {
      "name": "Ruolin Wang",
      "institution": "HCI Research UCLA, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659537458",
      "orcid": "missing"
    },
    {
      "name": "Xuhai Xu",
      "institution": "Information School University of Washington, United States",
      "img": "/do/10.1145/contrib-99659534445/rel-imgonly/orson-uw-talk-head-small.png",
      "acmid": "99659534445",
      "orcid": "0000-0001-5930-3899"
    },
    {
      "name": "Qisheng Li",
      "institution": "Paul G. Allen School of Computer Science & Engineering University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659134609",
      "orcid": "missing"
    },
    {
      "name": "Ather Sharif",
      "institution": "Paul G. Allen School of Computer Science and Engineering University of Washington, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659645474",
      "orcid": "missing"
    },
    {
      "name": "Jacob O. Wobbrock",
      "institution": "The Information School University of Washington, United States",
      "img": "/do/10.1145/contrib-81100086173/rel-imgonly/wobbrock.jpg",
      "acmid": "81100086173",
      "orcid": "0000-0003-3675-5491"
    }
  ],
  "references": [
    {
      "text": "Kim Albarella. 2018. The Secret Language of Emoji. https://staysafeonline.org/blog/secret-language-emoji/",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "Shiri Azenkot and Nicole B. Lee. 2013. Exploring the Use of Speech Input by Blind People on Mobile Devices. In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility(Bellevue, Washington) (ASSETS ’13). Association for Computing Machinery, New York, NY, USA, Article 11, 8 pages. https://doi.org/10.1145/2513383.2513440",
      "doi": "10.1145/2513383.2513440"
    },
    {
      "text": "Francesco Barbieri and Jose Camacho-Collados. 2018. How Gender and Skin Tone Modifiers Affect Emoji Semantics in Twitter. In Proceedings of the Seventh Joint Conference on Lexical and Computational Semantics. Association for Computational Linguistics, New Orleans, Louisiana, 101–106.",
      "doi": ""
    },
    {
      "text": "Nicole Bleuel. 2016. Promoting gender equality through emoji. https://blog.google/products/android/promoting-gender-equality-through-emoji/",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS: a quick and dirty usability scale. Usability evaluation in industry 1 (1996), 189.",
      "doi": ""
    },
    {
      "text": "Charlotte Buff. 2017. Proposal for Fully Gender-Inclusive Emoji.",
      "doi": ""
    },
    {
      "text": "Jeremy Burge. 2017. 5 Billion Emojis Sent Daily on Messenger. https://blog.emojipedia.org/5-billion-emojis-sent-daily-on-messenger/",
      "doi": ""
    },
    {
      "text": "Jeremy Burge. 2020. On Families and Equality. https://blog.emojipedia.org/on-families-and-equality/",
      "doi": ""
    },
    {
      "text": "Zhenpeng Chen, Xuan Lu, Sheng Shen, Wei Ai, Xuanzhe Liu, and Qiaozhu Mei. 2017. Through a Gender Lens: An Empirical Study of Emoji Usage over Large-Scale Android Users.",
      "doi": ""
    },
    {
      "text": "Yuri Choi, Kyung Hoon Hyun, and Ji-Hyun Lee. 2020. Image-Based Tactile Emojis: Improved Interpretation of Message Intention and Subtle Nuance for Visually Impaired Individuals. Human–Computer Interaction 35, 1 (2020), 40–69.",
      "doi": ""
    },
    {
      "text": "Neil Cohn, Jan Engelen, and Joost Schilperoord. 2019. The grammar of emoji? Constraints on communicative pictorial sequencing.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2014. Basics of qualitative research: Techniques and procedures for developing grounded theory.",
      "doi": ""
    },
    {
      "text": "Sam Cox. 2019. World Emoji Day: making emojis more accessible. https://wearesocial.com/uk/blog/2019/07/world-emoji-day-making-emojis-more-accessible",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, Paloma de Juan, and Joel Tetreault. 2016. Sender-Intended Functions of Emojis in US Messaging. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 504–509.",
      "doi": "10.1145/2935334.2935370"
    },
    {
      "text": "Mark Davis and Peter Edberg. 2020. Unicode Emoji. https://unicode.org/reports/tr51/",
      "doi": ""
    },
    {
      "text": "Jan Derboven, Jonathan Huyghe, and Dirk De Grooff. 2014. Designing Voice Interaction for People with Physical and Speech Impairments. In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational (Helsinki, Finland) (NordiCHI ’14). Association for Computing Machinery, New York, NY, USA, 217–226.",
      "doi": "10.1145/2639189.2639252"
    },
    {
      "text": "Emojipedia. 2020. Emoji Version 13.0 List. https://emojipedia.org/emoji-13.0/",
      "doi": ""
    },
    {
      "text": "Bjarke Felbo, Alan Mislove, Anders Søgaard, Iyad Rahwan, and Sune Lehmann. 2017. Using millions of emoji occurrences to learn any-domain representations for detecting sentiment, emotion and sarcasm.",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Amy Pavel, Xingyu Liu, Patrick Carrington, Lydia B. Chilton, and Jeffrey P. Bigham. 2019. Making Memes Accessible. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, PA, USA) (ASSETS ’19). Association for Computing Machinery, New York, NY, USA, 367–376. https://doi.org/10.1145/3308561.3353792",
      "doi": "10.1145/3308561.3353792"
    },
    {
      "text": "Cole Gleason, Amy Pavel, Emma McCamey, Christina Low, Patrick Carrington, Kris M. Kitani, and Jeffrey P. Bigham. 2020. Twitter A11y: A Browser Extension to Make Twitter Images Accessible. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376728",
      "doi": "10.1145/3313831.3376728"
    },
    {
      "text": "Alec Go, Richa Bhayani, and Lei Huang. 2009. Twitter sentiment classification using distant supervision.",
      "doi": ""
    },
    {
      "text": "Susumu Harada, Jacob O. Wobbrock, and James A. Landay. 2007. Voicedraw: A Hands-Free Voice-Driven Drawing Application for People with Motor Impairments. In Proceedings of the 9th International ACM SIGACCESS Conference on Computers and Accessibility (Tempe, Arizona, USA) (Assets ’07). Association for Computing Machinery, New York, NY, USA, 27–34.",
      "doi": "10.1145/1296843.1296850"
    },
    {
      "text": "Susumu Harada, Jacob O. Wobbrock, Jonathan Malkin, Jeff A. Bilmes, and James A. Landay. 2009. Longitudinal Study of People Learning to Use Continuous Voice-Based Cursor Control. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 347–356.",
      "doi": "10.1145/1518701.1518757"
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. Advances in Psychology 52 (1988), 139 – 183.",
      "doi": "10.1016/s0166-4115%2808%2962386-9"
    },
    {
      "text": "A. G. Hauptmann. 1989. Speech and Gestures for Graphic Image Manipulation. SIGCHI Bull. 20, SI (March 1989), 241–245.",
      "doi": ""
    },
    {
      "text": "Susan C. Herring and Ashley R. Dainas. 2020. Gender and Age Influences on Interpretation of Emoji Functions. Trans. Soc. Comput. 3, 2, Article 10 (April 2020), 26 pages. https://doi.org/10.1145/3375629",
      "doi": ""
    },
    {
      "text": "Jiaxiong Hu, Qianyao Xu, Limin Paul Fu, and Yingqing Xu. 2019. Emojilization: An Automated Method For Speech to Emoji-Labeled Text. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI EA ’19). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3290607.3313071",
      "doi": "10.1145/3290607.3313071"
    },
    {
      "text": "Albert H. Huang, David C. Yen, and Xiaoni Zhang. 2008. Exploring the Potential Effects of Emoticons. Inf. Manage. 45, 7 (Nov. 2008), 466–473.",
      "doi": "10.1016/j.im.2008.07.001"
    },
    {
      "text": "Takeo Igarashi and John F. Hughes. 2001. Voice as Sound: Using Non-Verbal Voice Input for Interactive Control. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (Orlando, Florida) (UIST ’01). Association for Computing Machinery, New York, NY, USA, 155–156.",
      "doi": "10.1145/502348.502372"
    },
    {
      "text": "Apple Inc.2020. iOS Dictation. https://support.apple.com/en-us/HT208343",
      "doi": ""
    },
    {
      "text": "Minal Jain, Sarita Seshagiri, and Simran Chopra. 2016. How Do I Communicate My Emotions on SNS and IMs?. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 767–774.",
      "doi": "10.1145/2957265.2961862"
    },
    {
      "text": "Shao kang Lo. 2008. The Nonverbal Communication Functions of Emoticons in Computer-Mediated Communication. Cyberpsychology & behavior : the impact of the Internet, multimedia and virtual reality on behavior and society 11 5 (2008), 595–7.",
      "doi": ""
    },
    {
      "text": "Ryan Kelly and Leon Watts. 2015. Characterising the inventive appropriation of emoji as relationally meaningful in mediated close personal relationships. Experiences of Technology Appropriation: Unanticipated Users, Usage, Circumstances, and Design ; Conference date: 20-09-2015 Through 20-09-2015.",
      "doi": ""
    },
    {
      "text": "Sujay Khandekar, Joseph Higg, Yuanzhe Bian, Chae Won Ryu, Jerry O. Talton Iii, and Ranjitha Kumar. 2019. Opico: A Study of Emoji-First Communication In A Mobile Social App. In Companion Proceedings of The 2019 World Wide Web Conference (San Francisco, USA) (WWW ’19). Association for Computing Machinery, New York, NY, USA, 450–458. https://doi.org/10.1145/3308560.3316547",
      "doi": ""
    },
    {
      "text": "Joon-Gyum Kim, Taesik Gong, Evey Huang, Juho Kim, Sung-Ju Lee, Bogoan Kim, JaeYeon Park, Woojeong Kim, Kyungsik Han, and JeongGil Ko. 2019. Bringing Context into Emoji Recommendations (Poster). In Proceedings of the 17th Annual International Conference on Mobile Systems, Applications, and Services(Seoul, Republic of Korea) (MobiSys ’19). Association for Computing Machinery, New York, NY, USA, 514–515. https://doi.org/10.1145/3307334.3328601",
      "doi": "10.1145/3307334.3328601"
    },
    {
      "text": "Eckhard Limpert, Werner A. Stahel, and Markus Abbt. 2001. Log-normal Distributionsacross the Sciences: Keys and Clues. BioScience 51, 5 (05 2001), 341–352. https://doi.org/10.1641/0006-3568(2001)051[0341:LNDATS]2.0.CO;2 arXiv:https://academic.oup.com/bioscience/article-pdf/51/5/341/26891292/51-5-341.pdf",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Cynthia L. Bennett, Meredith Ringel Morris, and Edward Cutrell. 2017. Understanding Blind People’s Experiences with Computer-Generated Captions of Social Media Images. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 5988–5999. https://doi.org/10.1145/3025453.3025814",
      "doi": "10.1145/3025453.3025814"
    },
    {
      "text": "Charles E. McCulloch and John M. Neuhaus. 2005. Generalized Linear Mixed Models. American Cancer Society, New York, Chapter 1, 1. https://doi.org/10.1002/0470011815.b2a10021",
      "doi": ""
    },
    {
      "text": "Nora McDonald, Sarita Schoenebeck, and Andrea Forte. 2019. Reliability and Inter-Rater Reliability in Qualitative Research: Norms and Guidelines for CSCW and HCI Practice. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 72 (Nov. 2019), 23 pages.",
      "doi": "10.1145/3359174"
    },
    {
      "text": "MDN contributors. 2020. MDN Web Docs - ARIA. https://developer.mozilla.org/en-US/docs/Web/Accessibility/ARIA",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. “With Most of It Being Pictures Now, I Rarely Use It”: Understanding Twitter’s Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5506–5516. https://doi.org/10.1145/2858036.2858116",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Martez E. Mott, Radu-Daniel Vatavu, Shaun K. Kane, and Jacob O. Wobbrock. 2016. Smart Touch: Improving Touch Accuracy for People with Motor Impairments with Template Matching. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1934–1946. https://doi.org/10.1145/2858036.2858390",
      "doi": "10.1145/2858036.2858390"
    },
    {
      "text": "Pandu Nayak. 2019. Understanding searches better than ever before. https://blog.google/products/search/search-language-understanding-bert/",
      "doi": ""
    },
    {
      "text": "Daniel S. Park, William Chan, Yu Zhang, Chung-Cheng Chiu, Barret Zoph, Ekin D. Cubuk, and Quoc V. Le. 2019. SpecAugment: A Simple Data Augmentation Method for Automatic Speech Recognition. In INTERSPEECH. IEEE, Austria, 10.",
      "doi": ""
    },
    {
      "text": "Henning Pohl, Christian Domin, and Michael Rohs. 2017. Beyond Just Text: Semantic Emoji Similarity Modeling to Support Expressive Communication . ACM Trans. Comput.-Hum. Interact. 24, 1, Article 6 (March 2017), 42 pages.",
      "doi": "10.1145/3039685"
    },
    {
      "text": "K R Prajwal, C V Jawahar, and Ponnurangam Kumaraguru. 2019. Towards Increased Accessibility of Meme Images with the Help of Rich Face Emotion Captions. In Proceedings of the 27th ACM International Conference on Multimedia (Nice, France) (MM ’19). Association for Computing Machinery, New York, NY, USA, 202–210. https://doi.org/10.1145/3343031.3350939",
      "doi": "10.1145/3343031.3350939"
    },
    {
      "text": "David Rodrigues, Diniz Lopes, Marília Prada, Dominic Thompson, and Margarida V. Garrido. 2017. A frown emoji can be worth a thousand words: Perceptions of emoji use in text messages exchanged between romantic partners. Telematics and Informatics 34, 8 (2017), 1532 – 1543.",
      "doi": "10.1016/j.tele.2017.07.001"
    },
    {
      "text": "Sherry Ruan, Jacob O. Wobbrock, Kenny Liou, Andrew Ng, and James A. Landay. 2018. Comparing Speech and Keyboard Text Entry for Short Messages in Two Languages on Touchscreen Phones. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 4, Article 159 (Jan. 2018), 23 pages.",
      "doi": "10.1145/3161187"
    },
    {
      "text": "RAYMOND SCUPIN. 1997. The KJ Method: A Technique for Analyzing Data Derived from Japanese Ethnology. Human Organization 56, 2 (1997), 233–237.",
      "doi": ""
    },
    {
      "text": "Ashley Sheridan. 2019. Emoji and Accessibility. http://www.ashleysheridan.co.uk/blog/Emoji+and+Accessibility",
      "doi": ""
    },
    {
      "text": "Xavier Snelgrove. 2016. Teaching Robots to Feel: Emoji & Deep Learning. https://getdango.com/emoji-and-deep-learning/",
      "doi": ""
    },
    {
      "text": "SwiftKey. 2015. SwiftKey Emoji Report. https://www.scribd.com/doc/262594751/SwiftKey-Emoji-Report",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell and David R. Flatla. 2016. Oh That’s What You Meant! Reducing Emoji Misunderstanding. In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (Florence, Italy) (MobileHCI ’16). Association for Computing Machinery, New York, NY, USA, 859–866.",
      "doi": ""
    },
    {
      "text": "Garreth W. Tigwell, Benjamin M. Gorman, and Rachel Menzies. 2020. Emoji Accessibility for Visually Impaired People. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376267"
    },
    {
      "text": "Tornadoweb. 2020. Tornado Web Server. https://www.tornadoweb.org/en/stable/",
      "doi": ""
    },
    {
      "text": "Veroniiiica. 2018. How Do People with Vision Impairments . . . Use Emoji?https://www.perkinselearning.org/technology/blog/how-do-people-vision-impairments-use-emoji",
      "doi": ""
    },
    {
      "text": "Keith Vertanen and Per Ola Kristensson. 2011. A Versatile Dataset for Text Entry Evaluations Based on Genuine Mobile Emails. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (Stockholm, Sweden) (MobileHCI ’11). Association for Computing Machinery, New York, NY, USA, 295–298. https://doi.org/10.1145/2037373.2037418",
      "doi": "10.1145/2037373.2037418"
    },
    {
      "text": "Joseph B. Walther and Kyle P. D’Addario. 2001. The Impacts of Emoticons on Message Interpretation in Computer-Mediated Communication. Social Science Computer Review 19 (2001), 324–347.",
      "doi": ""
    },
    {
      "text": "Ruolin Wang, Chun Yu, Xing-Dong Yang, Weijie He, and Yuanchun Shi. 2019. EarTouch: Facilitating Smartphone Use for Visually Impaired People in Mobile and Public Scenarios. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300254",
      "doi": "10.1145/3290605.3300254"
    },
    {
      "text": "Léonie Watson. 2016. Accessible emoji. https://tink.uk/accessible-emoji/",
      "doi": ""
    },
    {
      "text": "WHIRLSCAPE INC. 2016. Dango - Your Emoji Assistant. https://getdango.com",
      "doi": ""
    },
    {
      "text": "Sanjaya Wijeratne, Lakshika Balasuriya, Amit Sheth, and Derek Doran. 2017. A Semantics-Based Measure of Emoji Similarity. In Proceedings of the International Conference on Web Intelligence (Leipzig, Germany) (WI ’17). Association for Computing Machinery, New York, NY, USA, 646–653.",
      "doi": "10.1145/3106426.3106490"
    },
    {
      "text": "Wikipedia. 2020. Gboard - a virtual keyboard app developed by Google. https://en.wikipedia.org/wiki/Gboard",
      "doi": ""
    },
    {
      "text": "Sarah Wiseman and Sandy J. J. Gould. 2018. Repurposing Emoji for Personalised Communication: Why means “I Love You”. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–10.",
      "doi": "10.1145/3173574.3173726"
    },
    {
      "text": "Jacob O. Wobbrock. 2019. Situationally Aware Mobile Devices for Overcoming Situational Impairments. In Proceedings of the ACM SIGCHI Symposium on Engineering Interactive Computing Systems (Valencia, Spain) (EICS ’19). Association for Computing Machinery, New York, NY, USA, Article 1, 18 pages. https://doi.org/10.1145/3319499.3330292",
      "doi": "10.1145/3319499.3330292"
    },
    {
      "text": "Jacob O. Wobbrock, Leah Findlater, Darren Gergle, and James J. Higgins. 2011. The Aligned Rank Transform for Nonparametric Factorial Analyses Using Only Anova Procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 143–146. https://doi.org/10.1145/1978942.1978963",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Jacob O. Wobbrock, Krzysztof Z. Gajos, Shaun K. Kane, and Gregg C. Vanderheiden. 2018. Ability-Based Design. Commun. ACM 61, 6 (May 2018), 62–71.",
      "doi": "10.1145/3148051"
    },
    {
      "text": "Jacob O. Wobbrock, Shaun K. Kane, Krzysztof Z. Gajos, Susumu Harada, and Jon Froehlich. 2011. Ability-Based Design: Concept, Principles and Examples. ACM Trans. Access. Comput. 3, 3, Article 9 (April 2011), 27 pages. https://doi.org/10.1145/1952383.1952384",
      "doi": "10.1145/1952383.1952384"
    },
    {
      "text": "Rui Zhou, Jasmine Hentschel, and Neha Kumar. 2017. Goodbye Text, Hello Emoji: Mobile Communication on WeChat in China. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 748–759. https://doi.org/10.1145/3025453.3025800",
      "doi": "10.1145/3025453.3025800"
    }
  ]
}