{
  "doi": "10.1145/3411764.3445211",
  "title": "Viral Visualizations: How Coronavirus Skeptics Use Orthodox Data Practices to Promote Unorthodox Science Online",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2021,
  "badges": [],
  "abstract": "Controversial understandings of the coronavirus pandemic have turned data visualizations into a battleground. Defying public health officials, coronavirus skeptics on US social media spent much of 2020 creating data visualizations showing that the government’s pandemic response was excessive and that the crisis was over. This paper investigates how pandemic visualizations circulated on social media, and shows that people who mistrust the scientific establishment often deploy the same rhetorics of data-driven decision-making used by experts, but to advocate for radical policy changes. Using a quantitative analysis of how visualizations spread on Twitter and an ethnographic approach to analyzing conversations about COVID data on Facebook, we document an epistemological gap that leads pro- and anti-mask groups to draw drastically different inferences from similar data. Ultimately, we argue that the deployment of COVID data visualizations reflect a deeper sociopolitical rift regarding the place of science in public life.",
  "authors": [
    {
      "name": "Crystal Lee",
      "institution": "HASTS/CSAIL Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702320",
      "orcid": "missing"
    },
    {
      "name": "Tanya Yang",
      "institution": "Electrical Engineering and Computer Science Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702206",
      "orcid": "missing"
    },
    {
      "name": "Gabrielle D Inchoco",
      "institution": "Computer Science Wellesley College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702519",
      "orcid": "missing"
    },
    {
      "name": "Graham M. Jones",
      "institution": "Anthropology Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700503",
      "orcid": "missing"
    },
    {
      "name": "Arvind Satyanarayan",
      "institution": "CSAIL MIT, United States",
      "img": "/do/10.1145/contrib-81500663321/rel-imgonly/arvind-satyanarayan.jpg",
      "acmid": "81500663321",
      "orcid": "0000-0001-5564-635X"
    }
  ],
  "references": [
    {
      "text": "Eytan Adar and Elsie Lee. 2020. Communicative Visualizations as a Learning Problem. IEEE Transactions on Visualization and Computer Graphics (2020), 1–11. https://doi.org/10.1109/TVCG.2020.3030375",
      "doi": ""
    },
    {
      "text": "Laura M. Ahearn. 2004. Literacy, Power, and Agency: Love Letters and Development in Nepal. Language and Education 18, 4 (Sept. 2004), 305–316. https://doi.org/10.1080/09500780408666883",
      "doi": ""
    },
    {
      "text": "Alexandra P. Alberda. 2020. COVID-19 Data Literacy is for Everyone. https://medium.com/nightingale/covid-19-data-literacy-is-for-everyone-46120b58cec9",
      "doi": ""
    },
    {
      "text": "Basak Alper, Nathalie Henry Riche, Fanny Chevalier, Jeremy Boy, and Metin Sezgin. 2017. Visualization Literacy at Elementary School. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 5485–5497. https://doi.org/10.1145/3025453.3025877",
      "doi": "10.1145/3025453.3025877"
    },
    {
      "text": "Anti-Eviction Mapping Project. 2019. (Dis)location Black Exodus. http://archive.org/details/dislocationblackexodus",
      "doi": ""
    },
    {
      "text": "Ahmer Arif, Leo Graiden Stewart, and Kate Starbird. 2018. Acting the Part: Examining Information Operations Within #BlackLivesMatter Discourse. Proceedings of the ACM on Human-Computer Interaction 2, CSCW (Nov. 2018), 1–27. https://doi.org/10.1145/3274289",
      "doi": "10.1145/3274289"
    },
    {
      "text": "Association for Computing Machinery. 2020. ACM Conference on Fairness, Accountability, and Transparency (ACM FAccT). https://facctconference.org/",
      "doi": ""
    },
    {
      "text": "Christopher A. Bail, Lisa P. Argyle, Taylor W. Brown, John P. Bumpus, Haohan Chen, M. B. Fallin Hunzaker, Jaemin Lee, Marcus Mann, Friedolin Merhout, and Alexander Volfovsky. 2018. Exposure to opposing views on social media can increase political polarization. Proceedings of the National Academy of Sciences 115, 37 (Sept. 2018), 9216–9221. https://doi.org/10.1073/pnas.1804840115Publisher: National Academy of Sciences Section: Social Sciences.",
      "doi": ""
    },
    {
      "text": "Nancy K. Baym. 2013. Data not seen: The uses and shortcomings of social media metrics. First Monday 18, 10 (Oct. 2013). https://doi.org/10.5210/fm.v18i10.4873",
      "doi": ""
    },
    {
      "text": "Manon Berriche and Sacha Altay. 2020. Internet users engage more with phatic posts than with health misinformation on Facebook. Palgrave Communications 6, 1 (April 2020), 1–9. https://doi.org/10.1057/s41599-020-0452-1Number: 1 Publisher: Palgrave.",
      "doi": ""
    },
    {
      "text": "James S. Bielo. 2019. “Particles-to-People…Molecules-to-Man”: Creationist Poetics in Public Debates. Journal of Linguistic Anthropology 29, 1 (2019), 4–26. https://doi.org/10.1111/jola.12205_eprint: https://anthrosource.onlinelibrary.wiley.com/doi/pdf/10.1111/jola.12205.",
      "doi": ""
    },
    {
      "text": "Vincent D. Blondel, Jean-Loup Guillaume, Renaud Lambiotte, and Etienne Lefebvre. 2008. Fast unfolding of communities in large networks. Journal of Statistical Mechanics: Theory and Experiment 2008, 10 (Oct. 2008), P10008. https://doi.org/10.1088/1742-5468/2008/10/P10008Publisher: IOP Publishing.",
      "doi": ""
    },
    {
      "text": "Emily Bowe, Erin Simmons, and Shannon Mattern. 2020. Learning from lines: Critical COVID data visualizations and the quarantine quotidian. Big Data & Society (July 2020). https://doi.org/10.1177/2053951720939236Publisher: SAGE PublicationsSage UK: London, England.",
      "doi": ""
    },
    {
      "text": "Geoffrey C Bowker and Susan Leigh Star. 2000. Sorting Things Out: Classification and Its Consequences. MIT Press, Cambridge, MA.",
      "doi": "10.5555/380681"
    },
    {
      "text": "Jeremy Boy, Ronald A. Rensink, Enrico Bertini, and Jean-Daniel Fekete. 2014. A Principled Way of Assessing Visualization Literacy. IEEE Transactions on Visualization and Computer Graphics 20, 12 (Dec. 2014), 1963–1972. https://doi.org/10.1109/TVCG.2014.2346984",
      "doi": ""
    },
    {
      "text": "danah boyd. 2018. You Think You Want Media Literacy… Do You?https://points.datasociety.net/you-think-you-want-media-literacy-do-you-7cad6af18ec2",
      "doi": ""
    },
    {
      "text": "David Buckingham. 2017. Fake news: is media literacy the answer?https://davidbuckingham.net/2017/01/12/fake-news-is-media-literacy-the-answer/",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender Shades: Intersectional Accuracy Disparities in Commercial Gender Classification. Proceedings of Machine Learning Research 81 (2018), 1–15.",
      "doi": ""
    },
    {
      "text": "Jean Burgess and Ariadna Matamoros-Fernández. 2016. Mapping sociocultural controversies across digital media platforms: one week of #gamergate on Twitter, YouTube, and Tumblr. Communication Research and Practice 2, 1 (Jan. 2016), 79–96. https://doi.org/10.1080/22041451.2016.1155338",
      "doi": ""
    },
    {
      "text": "Katy Börner, Andreas Bueckle, and Michael Ginda. 2019. Data visualization literacy: Definitions, conceptual frameworks, exercises, and assessments. Proceedings of the National Academy of Sciences 116, 6 (Feb. 2019), 1857–1864. https://doi.org/10.1073/pnas.1807180116Publisher: National Academy of Sciences Section: Colloquium Paper.",
      "doi": ""
    },
    {
      "text": "Katy Börner, Adam Maltese, Russell Nelson Balliet, and Joe Heimlich. 2016. Investigating aspects of data visualization literacy using 20 information visualizations and 273 science museum visitors. Information Visualization 15, 3 (July 2016), 198–213. https://doi.org/10.1177/1473871615594652Publisher: SAGE Publications.",
      "doi": "10.1177/1473871615594652"
    },
    {
      "text": "André Calero Valdez, Martina Ziefle, and Michael Sedlmair. 2018. Studying Biases in Visualization Research: Framework and Methods. In Cognitive Biases in Visualizations, Geoffrey Ellis(Ed.). Springer International Publishing, Cham, 13–27. https://doi.org/10.1007/978-3-319-95831-6_2",
      "doi": ""
    },
    {
      "text": "Alexander Campolo. 2020. Flattening the Curve; Visualization and Pandemic Knowledge. https://sifk.uchicago.edu/news/flattening-the-curve-visualization-and-pandemic-knowledge/",
      "doi": ""
    },
    {
      "text": "Joe Carroll. 2020. Texas Governor Says Positive-Rate Surge Under Investigation. Bloomberg (Aug. 2020). https://www.bloomberg.com/news/articles/2020-08-13/texas-governor-says-positivity-rate-surge-under-investigation",
      "doi": ""
    },
    {
      "text": "CDC. 2020. Coronavirus Disease 2019 (COVID-19). https://www.cdc.gov/coronavirus/2019-ncov/prevent-getting-sick/cloth-face-cover-guidance.html",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2006. Constructing grounded theory. Sage Publications, London ; Thousand Oaks, Calif.",
      "doi": ""
    },
    {
      "text": "Tinggui Chen, Qianqian Li, Peihua Fu, Jianjun Yang, Chonghuan Xu, Guodong Cong, and Gongfa Li. 2020. Public Opinion Polarization by Individual Revenue from the Social Preference Theory. International Journal of Environmental Research and Public Health 17, 3 (Feb. 2020). https://doi.org/10.3390/ijerph17030946",
      "doi": ""
    },
    {
      "text": "Angèle Christin. 2016. From daguerreotypes to algorithms: machines, expertise, and three forms of objectivity. ACM SIGCAS Computers and Society 46, 1 (March 2016), 27–32. https://doi.org/10.1145/2908216.2908220",
      "doi": "10.1145/2908216.2908220"
    },
    {
      "text": "Derek K. Chu, Elie A. Akl, Stephanie Duda, Karla Solo, Sally Yaacoub, Holger J. Schünemann, Derek K. Chu, Elie A. Akl, Amena El-harakeh, Antonio Bognanni, Tamara Lotfi, Mark Loeb, Anisa Hajizadeh, Anna Bak, Ariel Izcovich, Carlos A. Cuello-Garcia, Chen Chen, David J. Harris, Ewa Borowiack, Fatimah Chamseddine, Finn Schünemann, Gian Paolo Morgano, Giovanna E. U. Muti Schünemann, Guang Chen, Hong Zhao, Ignacio Neumann, Jeffrey Chan, Joanne Khabsa, Layal Hneiny, Leila Harrison, Maureen Smith, Nesrine Rizk, Paolo Giorgi Rossi, Pierre AbiHanna, Rayane El-khoury, Rosa Stalteri, Tejan Baldeh, Thomas Piggott, Yuan Zhang, Zahra Saad, Assem Khamis, Marge Reinap, Stephanie Duda, Karla Solo, Sally Yaacoub, and Holger J. Schünemann. 2020. Physical distancing, face masks, and eye protection to prevent person-to-person transmission of SARS-CoV-2 and COVID-19: a systematic review and meta-analysis. The Lancet 395, 10242 (June 2020), 1973–1987. https://doi.org/10.1016/S0140-6736(20)31142-9Publisher: Elsevier.",
      "doi": ""
    },
    {
      "text": "E. Gabriella Coleman. 2014. Hacker, Hoaxer, Whistleblower, Spy: The Many Faces of Anonymous. Verso, London; New York.",
      "doi": ""
    },
    {
      "text": "Michael Correll. 2019. Ethical Dimensions of Visualization Research. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300418",
      "doi": "10.1145/3290605.3300418"
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design Justice: Towards an Intersectional Feminist Framework for Design Theory and Practice. MIT Press, Cambridge, MA. https://papers.ssrn.com/abstract=3189696",
      "doi": ""
    },
    {
      "text": "CrowdTangle Team. 2020. CrowdTangle. https://apps.crowdtangle.com/crystalcovidvis/lists/pages",
      "doi": ""
    },
    {
      "text": "Data for Black Lives. 2020. Data for Black Lives COVID-19 Movement Pulse Check April 2020. Technical Report.",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio and Lauren F. Klein. 2020. Data Feminism. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Documenting the Now. 2016. Twarc. https://github.com/DocNow/twarc",
      "doi": ""
    },
    {
      "text": "John Downey and Natalie Fenton. 2003. New Media, Counter Publicity and the Public Sphere. New Media & Society 5, 2 (June 2003), 185–202. https://doi.org/10.1177/1461444803005002003Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Joseph Dumit and Regula Valérie Burri. 2008. Social studies of scientific imaging and visualization. In The Handbook of Science and Technology Studies, Edward J. Hackett, Olga Amsterdamska, Judy Wajcman, and Michael Lynch (Eds.). MIT Press, Cambridge, MA, 297–317.",
      "doi": ""
    },
    {
      "text": "Omri Elisha. 2011. Moral Ambition: Mobilization and Social Outreach in Evangelical Megachurches. Number 12 in Anthropology of Christianity. University of California Press, Berkeley, CA. OCLC: ocn695683676.",
      "doi": ""
    },
    {
      "text": "Robert M. Emerson, Rachel I. Fretz, and Linda L. Shaw. 2011. Writing ethnographic fieldnotes(2nd ed ed.). The University of Chicago Press, Chicago.",
      "doi": ""
    },
    {
      "text": "Anthony Fauci. 2020. Dr. Anthony Fauci: “Science is Truth”. https://www.hhs.gov/podcasts/learning-curve/learning-curve-05-dr-anthony-fauci-science-is-truth.html Last Modified: 2020-06-17T12:32-04:00.",
      "doi": ""
    },
    {
      "text": "Frank Fischer. 2019. Knowledge politics and post-truth in climate denial: on the social construction of alternative facts. Critical Policy Studies 13, 2 (April 2019), 133–152. https://doi.org/10.1080/19460171.2019.1602067",
      "doi": ""
    },
    {
      "text": "Kirstin Fontichiaro and Jo Angela Oehrli. 2016. Why Data Literacy Matters. Knowledge Quest 44, 5 (2016), 21–27. https://eric.ed.gov/?id=EJ1099487 Publisher: American Association of School Librarians.",
      "doi": ""
    },
    {
      "text": "Jason Forrest. 2020. How John Burn-Murdoch’s Influential Dataviz Helped the World Understand Coronavirus. https://medium.com/nightingale/how-john-burn-murdochs-influential-dataviz-helped-the-world-understand-coronavirus-6cb4a09795ae",
      "doi": ""
    },
    {
      "text": "Clifford Geertz. 1998. Deep Hanging Out. New York Review of Books (Oct. 1998). https://www.nybooks.com/articles/1998/10/22/deep-hanging-out/ Section: Ideas.",
      "doi": ""
    },
    {
      "text": "Lisa Gitelman (Ed.). 2013. ”Raw Data” Is an Oxymoron. MIT Press, Cambridge, MA.",
      "doi": ""
    },
    {
      "text": "Andrew M. Guess, Michael Lerner, Benjamin Lyons, Jacob M. Montgomery, Brendan Nyhan, Jason Reifler, and Neelanjan Sircar. 2020. A digital media literacy intervention increases discernment between mainstream and false news in the United States and India. Proceedings of the National Academy of Sciences 117, 27 (July 2020), 15536–15545. https://doi.org/10.1073/pnas.1920498117ISBN: 9781920498115 Publisher: National Academy of Sciences Section: Social Sciences.",
      "doi": ""
    },
    {
      "text": "Susan Hanson. 1992. Geography and Feminism: Worlds in Collision?Annals of the Association of American Geographers 82, 4(1992), 569–586. https://doi.org/10.1111/j.1467-8306.1992.tb01718.x_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/j.1467-8306.1992.tb01718.x.",
      "doi": ""
    },
    {
      "text": "Donna Haraway. 1988. Situated Knowledges: The Science Question in Feminism and the Privilege of Partial Perspective. Feminist Studies 14, 3 (1988), 575. https://doi.org/10.2307/3178066",
      "doi": ""
    },
    {
      "text": "J B Harley. 1989. Deconstructing the map. Cartographica: The International Journal for Geographic Information and Geovisualization 26, 2 (June 1989), 1–20. https://doi.org/10.3138/E635-7827-1757-9T53Publisher: University of Toronto Press.",
      "doi": ""
    },
    {
      "text": "Renee Hobbs (Ed.). 2016. Exploring the Roots of Digital and Media Literacy through Personal Narrative. Temple University Press. https://doi.org/10.2307/j.ctvrf898z",
      "doi": ""
    },
    {
      "text": "Arlie Russell Hochschild. 2016. Strangers in Their Own Land: Anger and Mourning on the American Right. New Press, New York.",
      "doi": ""
    },
    {
      "text": "Richard Hofstadter. 1966. Anti-Intellectualism in American Life (1st edition ed.). Vintage, New York.",
      "doi": ""
    },
    {
      "text": "Jessica Hullman. 2020. Why Authors Don’t Visualize Uncertainty. IEEE Transactions on Visualization and Computer Graphics 26, 1 (Jan. 2020), 130–139. https://doi.org/10.1109/TVCG.2019.2934287",
      "doi": ""
    },
    {
      "text": "Jessica Hullman and Nicholas Diakopoulos. 2011. Visualization Rhetoric: Framing Effects in Narrative Visualization. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2231–2240. https://doi.org/10.1109/TVCG.2011.255",
      "doi": "10.1109/TVCG.2011.255"
    },
    {
      "text": "Jessica Hullman, Xiaoli Qiao, Michael Correll, Alex Kale, and Matthew Kay. 2019. In Pursuit of Error: A Survey of Uncertainty Visualization Evaluation. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan. 2019), 903–913. https://doi.org/10.1109/TVCG.2018.2864889",
      "doi": "10.1109/TVCG.2018.2864889"
    },
    {
      "text": "Meghan Kelly. 2019. Mapping Syrian Refugee Border Crossings: A Feminist Approach. Cartographic Perspectives93 (Nov. 2019), 34–64–34–64. https://doi.org/10.14714/CP93.1406Number: 93.",
      "doi": ""
    },
    {
      "text": "Scott F. Kiesling, Umashanthi Pavalanathan, Jim Fitzpatrick, Xiaochuang Han, and Jacob Eisenstein. 2018. Interactional Stancetaking in Online Forums. Computational Linguistics 44, 4 (Dec. 2018), 683–718. https://doi.org/10.1162/coli_a_00334",
      "doi": "10.1162/coli_a_00334"
    },
    {
      "text": "Rob Kitchin, Martin Dodge, and Chris Perkins. 2011. Introductory Essay: Power and Politics of Mapping. In The Map Reader. John Wiley & Sons, Ltd, 387–394. https://doi.org/10.1002/9780470979587.ch50Section: 5.1 _eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1002/9780470979587.ch50.",
      "doi": ""
    },
    {
      "text": "Robert Kosara. 2016. An Empire Built On Sand: Reexamining What We Think We Know About Visualization. In Proceedings of the Beyond Time and Errors on Novel Evaluation Methods for Visualization - BELIV ’16. ACM Press, Baltimore, MD, USA, 162–168. https://doi.org/10.1145/2993901.2993909",
      "doi": "10.1145/2993901.2993909"
    },
    {
      "text": "Robert Kozinets. 2019. Integrating: Combining Telescopic and Microscopic Understandings. In Netnography: The Essential Guide to Qualitative Social Media Research (3 ed.). SAGE Publications, London.",
      "doi": ""
    },
    {
      "text": "Mei-Po Kwan. 2002. Feminist Visualization: Re-envisioning GIS as a Method in Feminist Geographic Research. Annals of the Association of American Geographers 92, 4 (Dec. 2002), 645–661. https://doi.org/10.1111/1467-8306.00309",
      "doi": ""
    },
    {
      "text": "Jean Lave and Etienne Wenger. 1991. Situated Learning: Legitimate Peripheral Participation. Cambridge University Press, Cambridge, UK. Google-Books-ID: CAVIOrW3vYAC.",
      "doi": ""
    },
    {
      "text": "Sukwon Lee, Sung-Hee Kim, Ya-Hsin Hung, Heidi Lam, Youn-Ah Kang, and Ji Soo Yi. 2016. How do People Make Sense of Unfamiliar Visualizations?: A Grounded Model of Novice’s Information Visualization Sensemaking. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan. 2016), 499–508. https://doi.org/10.1109/TVCG.2015.2467195Conference Name: IEEE Transactions on Visualization and Computer Graphics.",
      "doi": "10.1109/TVCG.2015.2467195"
    },
    {
      "text": "Sukwon Lee, Sung-Hee Kim, and Bum Chul Kwon. 2017. VLAT: Development of a Visualization Literacy Assessment Test. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 551–560. https://doi.org/10.1109/TVCG.2016.2598920",
      "doi": "10.1109/TVCG.2016.2598920"
    },
    {
      "text": "R. Lengler. 2006. Identifying the Competencies of ’Visual Literacy’ - a Prerequisite for Knowledge Visualization. In Tenth International Conference on Information Visualisation (IV’06). Tenth International Conference on Information Visualisation (IV’06), 232–236. https://doi.org/10.1109/IV.2006.60ISSN: 2375-0138.",
      "doi": ""
    },
    {
      "text": "Zenobia Lloyd. 2020. Q&A: Michael Levitt on why there shouldn’t be a lockdown, how he’s been tracking coronavirus. The Stanford Daily (Aug. 2020). https://www.stanforddaily.com/2020/08/02/qa-michael-levitt-on-why-there-shouldnt-be-a-lockdown-how-hes-been-tracking-coronavirus/",
      "doi": ""
    },
    {
      "text": "Adam Maltese, Dubravka Svetina, and Joseph Harsh. 2015. Research and Teaching: Data Visualization Literacy: Investigating Data Interpretation Along the Novice-Expert Continuum. Journal of College Science Teaching 045, 01 (2015). https://doi.org/10.2505/4/jcst15_045_01_84",
      "doi": ""
    },
    {
      "text": "Annette N. Markham. 2013. Fieldwork in Social Media. Qualitative Communication Research 2, 4 (Dec. 2013), 434–446. https://doi.org/10.1525/qcr.2013.2.4.434",
      "doi": ""
    },
    {
      "text": "Ed Mazza. 2020. Top Trump DHS Official Asks Twitter To Help Him Find Coronavirus Outbreak Map. Huffington Post (Feb. 2020). https://www.huffpost.com/entry/ken-cuccinelli-coronavirus-map_n_5e54dd40c5b66729cf618d35 Section: Politics.",
      "doi": ""
    },
    {
      "text": "Leland McInnes, John Healy, and James Melville. 2018. UMAP: Uniform Manifold Approximation and Projection for Dimension Reduction. (Dec. 2018). http://arxiv.org/abs/1802.03426",
      "doi": ""
    },
    {
      "text": "Sara L. McLafferty. 1995. Counting for Women. The Professional Geographer 47, 4 (Nov. 1995), 436–442. https://doi.org/10.1111/j.0033-0124.1995.436_j.x",
      "doi": ""
    },
    {
      "text": "Miriah Meyer and Jason Dykes. 2019. Criteria for Rigor in Visualization Design Study. IEEE Transactions on Visualization and Computer Graphics (2019), 1–1. https://doi.org/10.1109/TVCG.2019.2934539",
      "doi": ""
    },
    {
      "text": "Bruce L. Miller. 2020. Science Denial and COVID Conspiracy Theories: Potential Neurological Mechanisms and Possible Responses. Journal of the American Medical Association 324, 22 (Dec. 2020), 2255. https://doi.org/10.1001/jama.2020.21332",
      "doi": ""
    },
    {
      "text": "David Moats and Erik Borra. 2018. Quali-quantitative methods beyond networks: Studying information diffusion on Twitter with the Modulation Sequencer. Big Data & Society 5, 1 (June 2018), 205395171877213. https://doi.org/10.1177/2053951718772137",
      "doi": ""
    },
    {
      "text": "Erik Mueggler. 2011. The Paper Road: Archive and Experience in the Botanical Exploration of West China and Tibet. University of California Press, Berkeley, CA.",
      "doi": ""
    },
    {
      "text": "Safiya Umoja Noble. 2018. Algorithms of Oppression: How Search Engines Reinforce Racism (1 edition ed.). NYU Press, New York.",
      "doi": ""
    },
    {
      "text": "Mimi Onuoha. 2016. The Library of Missing Datasets. http://mimionuoha.com/the-library-of-missing-datasets",
      "doi": ""
    },
    {
      "text": "Naomi Oreskes and Erik M. Conway. 2010. Merchants of Doubt: How a Handful of Scientists Obscured the Truth on Issues from Tobacco Smoke to Global Warming. Bloomsbury Press, New York, NY. OCLC: 461631066.",
      "doi": ""
    },
    {
      "text": "Deokgun Park, Steven M. Drucker, Roland Fernandez, and Niklas Elmqvist. 2018. Atom: A Grammar for Unit Visualizations. IEEE Transactions on Visualization and Computer Graphics 24, 12 (Dec. 2018), 3032–3043. https://doi.org/10.1109/TVCG.2017.2785807",
      "doi": ""
    },
    {
      "text": "Paul Parsons. 2018. Promoting Representational Fluency for Cognitive Bias Mitigation in Information Visualization. In Cognitive Biases in Visualizations, Geoffrey Ellis(Ed.). Springer International Publishing, Cham, 137–147. https://doi.org/10.1007/978-3-319-95831-6_10",
      "doi": ""
    },
    {
      "text": "Evan M. Peck, Sofia E. Ayuso, and Omar El-Etr. 2019. Data is Personal: Attitudes and Perceptions of Data Visualization in Rural Pennsylvania. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300474",
      "doi": "10.1145/3290605.3300474"
    },
    {
      "text": "Jorge Poco and Jeffrey Heer. 2017. Reverse‐Engineering Visualizations: Recovering Visual Encodings from Chart Images. Computer Graphics Forum 36, 3 (June 2017), 353–363. https://doi.org/10.1111/cgf.13193",
      "doi": "10.1111/cgf.13193"
    },
    {
      "text": "Theodore M. Porter. 1995. Trust in Numbers: The Pursuit of Objectivity in Science and Public Life. Princeton University Press, Princeton, NJ.",
      "doi": ""
    },
    {
      "text": "John Postill and Sarah Pink. 2012. Social Media Ethnography: The Digital Researcher in a Messy Web. Media International Australia 145, 1 (Nov. 2012), 123–134. https://doi.org/10.1177/1329878X1214500114Publisher: SAGE Publications Ltd.",
      "doi": ""
    },
    {
      "text": "Robert N Proctor. 2011. Golden Holocaust: Origins of the Cigarette Catastrophe and the Case for Abolition. University of California Press, Berkeley, CA.",
      "doi": ""
    },
    {
      "text": "Puripant Ruchikachorn and Klaus Mueller. 2015. Learning Visualizations by Analogy: Promoting Visual Literacy through Visualization Morphing. IEEE Transactions on Visualization and Computer Graphics 21, 9 (Sept. 2015), 1028–1044. https://doi.org/10.1109/TVCG.2015.2413786Conference Name: IEEE Transactions on Visualization and Computer Graphics.",
      "doi": "10.1109/TVCG.2015.2413786"
    },
    {
      "text": "Manolis Savva, Nicholas Kong, Arti Chhajta, Li Fei-Fei, Maneesh Agrawala, and Jeffrey Heer. 2011. ReVision: automated classification, analysis and redesign of chart images. In Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST ’11. ACM Press, Santa Barbara, California, USA, 393. https://doi.org/10.1145/2047196.2047247",
      "doi": "10.1145/2047196.2047247"
    },
    {
      "text": "Dietram A. Scheufele and Nicole M. Krause. 2019. Science audiences, misinformation, and fake news. Proceedings of the National Academy of Sciences 116, 16 (April 2019), 7662–7669. https://doi.org/10.1073/pnas.1805871115Publisher: National Academy of Sciences Section: Colloquium Paper.",
      "doi": ""
    },
    {
      "text": "E Segel and J Heer. 2010. Narrative Visualization: Telling Stories with Data. IEEE Transactions on Visualization and Computer Graphics 16, 6 (Nov. 2010), 1139–1148. https://doi.org/10.1109/TVCG.2010.179",
      "doi": "10.1109/TVCG.2010.179"
    },
    {
      "text": "Ben Shneiderman. 2020. Data Visualization’s Breakthrough Moment in the COVID-19 Crisis. https://medium.com/nightingale/data-visualizations-breakthrough-moment-in-the-covid-19-crisis-ce46627c7db5",
      "doi": ""
    },
    {
      "text": "Mario Luis Small. 2009. ‘How many cases do I need?’: On science and the logic of case selection in field-based research. Ethnography 10, 1 (March 2009), 5–38. https://doi.org/10.1177/1466138108099586Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Wonyoung So and Fábio Duarte. 2020. Cartographers of North Korea: Who are they and what are the technical, political, and social issues involved in mapping North Korea. Geoforum 110 (March 2020), 147–156. https://doi.org/10.1016/j.geoforum.2020.02.008",
      "doi": ""
    },
    {
      "text": "Kate Starbird, Ahmer Arif, and Tom Wilson. 2019. Disinformation as Collaborative Work: Surfacing the Participatory Nature of Strategic Information Operations. Proceedings of the ACM on Human-Computer Interaction 3, CSCW (Nov. 2019), 127:1–127:26. https://doi.org/10.1145/3359229",
      "doi": "10.1145/3359229"
    },
    {
      "text": "Christina Stoiber, Florian Grassinger, Margit Pohl, Holger Stitz, Marc Streit, and Wolfgang Aigner. 2019. Visualization Onboarding: Learning How to Read and Use Visualizations. preprint. Open Science Framework. https://doi.org/10.31219/osf.io/c38ab",
      "doi": ""
    },
    {
      "text": "Yuzuru Tanahashi, Nick Leaf, and Kwan-Liu Ma. 2016. A Study On Designing Effective Introductory Materials for Information Visualization. Computer Graphics Forum 35, 7 (2016), 117–126. https://doi.org/10.1111/cgf.13009_eprint: https://onlinelibrary.wiley.com/doi/pdf/10.1111/cgf.13009.",
      "doi": "10.5555/3151666.3151679"
    },
    {
      "text": "Emma Teng. 2004. Taiwan’s Imagined Geography: Chinese Colonial Travel Writing and Pictures, 1683-1895. Harvard Univ Asia Center. Google-Books-ID: ufetNF9d7Y4C.",
      "doi": ""
    },
    {
      "text": "Francesca Tripodi. [n.d.]. Searching for Alternative Facts. Technical Report. Data & Society Research Institute. 64 pages.",
      "doi": ""
    },
    {
      "text": "Zeynep Tufekci. 2020. Opinion | On Masks and Clinical Trials, Rand Paul’s Tweeting Is Just Plain Wrong. The New York Times (Nov. 2020). https://www.nytimes.com/2020/11/06/opinion/sunday/coronavirus-masks.html",
      "doi": ""
    },
    {
      "text": "Zeynep Tufekci. 2020. Opinion | Why Telling People They Don’t Need Masks Backfired. The New York Times (March 2020). https://www.nytimes.com/2020/03/17/opinion/coronavirus-face-masks.html",
      "doi": ""
    },
    {
      "text": "Fernanda B. Viegas and Martin Wattenberg. 2006. Communication-minded visualization: A call to action [Technical forum]. IBM Systems Journal 45, 4 (2006), 801–812. https://doi.org/10.1147/sj.454.0801Conference Name: IBM Systems Journal.",
      "doi": "10.1147/sj.454.0801"
    },
    {
      "text": "Etienne Wenger. 1998. Communities of Practice: Learning, Meaning, and Identity. Cambridge University Press, Cambridge, UK; New York. OCLC: 318240189.",
      "doi": ""
    },
    {
      "text": "Angela Xiao Wu and Harsh Taneja. 2020. Platform enclosure of human behavior and its measurement: Using behavioral trace data against platform episteme. New Media & Society (July 2020), 146144482093354. https://doi.org/10.1177/1461444820933547",
      "doi": ""
    },
    {
      "text": "Sarita Yardi and danah boyd. 2010. Dynamic Debates: An Analysis of Group Polarization Over Time on Twitter. Bulletin of Science, Technology & Society 30, 5 (Oct. 2010), 316–327. https://doi.org/10.1177/0270467610380011Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Vincent Yi-Fong Su, Yung-Feng Yen, Kuang-Yao Yang, Wei-Juin Su, Kun-Ta Chou, Yuh-Min Chen, and Diahn-Warng Perng. 2020. Masks and medical care: Two keys to Taiwan’s success in preventing COVID-19 spread. Travel Medicine and Infectious Disease (June 2020), 101780. https://doi.org/10.1016/j.tmaid.2020.101780",
      "doi": ""
    },
    {
      "text": "Yixuan Zhang, Yifan Sun, Sumit Barua, Enrico Bertini, and Andrea G. Parker. 2020. Mapping the Landscape of COVID-19 Crisis Visualizations. Preprint. Open Science Framework. https://doi.org/10.31219/osf.io/kd3y9",
      "doi": ""
    }
  ]
}