{
  "doi": "10.1145/3411764.3445537",
  "title": "vMirror: Enhancing the Interaction with Occluded or Distant Objects in VR with Virtual Mirrors",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "Interacting with out of reach or occluded VR objects can be cumbersome. Although users can change their position and orientation, such as via teleporting, to help observe and select, doing so frequently may cause loss of spatial orientation or motion sickness. We present vMirror, an interactive widget leveraging reflection of mirrors to observe and select distant or occluded objects. We first designed interaction techniques for placing mirrors and interacting with objects through mirrors. We then conducted a formative study to explore a semi-automated mirror placement method with manual adjustments. Next, we conducted a target-selection experiment to measure the effect of the mirror’s orientation on users’ performance. Results showed that vMirror can be as efficient as direct target selection for most mirror orientations. We further compared vMirror with teleport technique in a virtual treasure hunt game and measured participants’ task performance and subjective experiences. Finally, we discuss vMirorr user experience and present future directions.",
  "tags": [
    "vMirror",
    "Virtual mirror",
    "occlusion",
    "out of reach",
    "DOF",
    "raycasting",
    "target selection",
    "VR",
    "Virtual Reality"
  ],
  "authors": [
    {
      "name": "Nianlong Li",
      "institution": "Institute of Software, Chinese Academy of Sciences, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261321",
      "orcid": "missing"
    },
    {
      "name": "Zhengquan Zhang",
      "institution": "Department of Industrial Design Xi'an Jiaotong University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701642",
      "orcid": "missing"
    },
    {
      "name": "Can Liu",
      "institution": "School of Creative Media City University of Hong Kong, Hong Kong",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502698675",
      "orcid": "missing"
    },
    {
      "name": "Zengyao Yang",
      "institution": "Department of Industrial Design Xi'an Jiaotong University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700805",
      "orcid": "missing"
    },
    {
      "name": "Yinan Fu",
      "institution": "Department of Software Engineering Xiamen University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700801",
      "orcid": "missing"
    },
    {
      "name": "Feng Tian",
      "institution": "Institute of software, Chinese Academy of Sciences, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100106876",
      "orcid": "0000-0002-6598-419X"
    },
    {
      "name": "Teng Han",
      "institution": "Institute of Software, Chinese Academy of Sciences, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488652855",
      "orcid": "missing"
    },
    {
      "name": "Mingming Fan",
      "institution": "School of Information Rochester Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81482645714/rel-imgonly/official-photo-rit-mingming-fan.jpg",
      "acmid": "81482645714",
      "orcid": "0000-0002-0356-4712"
    }
  ],
  "references": [
    {
      "text": "Johnny Accot and Shumin Zhai. 2001. Scale effects in steering law tasks. In Proceedings of the SIGCHI conference on Human factors in computing systems. 1–8.",
      "doi": "10.1145/365024.365027"
    },
    {
      "text": "Ferran Argelaguet and Carlos Andujar. 2013. A survey of 3D object selection techniques for virtual environments. Computers & Graphics 37, 3 (2013), 121–136.",
      "doi": "10.1016/j.cag.2012.12.003"
    },
    {
      "text": "Marc Baloup, Thomas Pietrzak, and Géry Casiez. 2019. RayCursor: A 3D pointing facilitation technique based on raycasting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300331"
    },
    {
      "text": "Aaron Bangor, Philip T Kortum, and James T Miller. 2008. An empirical evaluation of the system usability scale. Intl. Journal of Human–Computer Interaction 24, 6(2008), 574–594.",
      "doi": ""
    },
    {
      "text": "Hrvoje Benko, Andrew D Wilson, and Patrick Baudisch. 2006. Precise selection techniques for multi-touch screens. In Proceedings of the SIGCHI conference on Human Factors in computing systems. 1263–1272.",
      "doi": "10.1145/1124772.1124963"
    },
    {
      "text": "Christoph Bichlmeier, Sandro Michael Heining, Marco Feuerstein, and Nassir Navab. 2009. The virtual mirror: a new interaction paradigm for augmented reality environments. IEEE Transactions on Medical Imaging 28, 9 (2009), 1498–1510.",
      "doi": ""
    },
    {
      "text": "Géry Casiez, Nicolas Roussel, and Daniel Vogel. 2012. 1€ filter: a simple speed-based low-pass filter for noisy input in interactive systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2527–2530.",
      "doi": "10.1145/2207676.2208639"
    },
    {
      "text": "Gerwin De Haan, Michal Koutek, and Frits H Post. 2005. IntenSelect: Using Dynamic Object Rating for Assisting 3D Object Selection.. In Ipt/egve. Citeseer, 201–209.",
      "doi": ""
    },
    {
      "text": "Niklas Elmqvist. 2005. BalloonProbe: Reducing occlusion in 3D using interactive space distortion. In Proceedings of the ACM symposium on Virtual reality software and technology. 134–137.",
      "doi": "10.1145/1101616.1101643"
    },
    {
      "text": "Niklas Elmqvist and M Eduard Tudoreanu. 2007. Occlusion Management in Immersive and Desktop 3D Virtual Environments: Theory and Evaluation.IJVR 6, 2 (2007), 21–32.",
      "doi": ""
    },
    {
      "text": "Andrew Forsberg, Kenneth Herndon, and Robert Zeleznik. 1996. Aperture based selection for immersive virtual environments. In Proceedings of the 9th annual ACM symposium on User interface software and technology. 95–96.",
      "doi": "10.1145/237091.237105"
    },
    {
      "text": "Scott Frees, G Drew Kessler, and Edwin Kay. 2007. PRISM interaction for enhancing control in immersive virtual environments. ACM Transactions on Computer-Human Interaction (TOCHI) 14, 1(2007), 2–es.",
      "doi": "10.1145/1229855.1229857"
    },
    {
      "text": "Sebastian Freitag, Dominik Rausch, and Torsten Kuhlen. 2014. Reorientation in virtual environments using interactive portals. In 2014 IEEE symposium on 3D user interfaces (3DUI). IEEE, 119–122.",
      "doi": ""
    },
    {
      "text": "Tovi Grossman and Ravin Balakrishnan. 2006. The design and evaluation of selection techniques for 3D volumetric displays. In Proceedings of the 19th annual ACM symposium on User interface software and technology. 3–12.",
      "doi": "10.1145/1166253.1166257"
    },
    {
      "text": "Wansu Ha, Myung Geol Choi, and Kang Hoon Lee. 2020. Automatic Control of Virtual Mirrors for Precise 3D Manipulation in VR. IEEE Access 8(2020), 156274–156284.",
      "doi": ""
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203–220.",
      "doi": ""
    },
    {
      "text": "Werner A König, Jens Gerken, Stefan Dierdorf, and Harald Reiterer. 2009. Adaptive pointing–design and evaluation of a precision enhancing technique for absolute pointing devices. In IFIP Conference on Human-Computer Interaction. Springer, 658–671.",
      "doi": "10.1007/978-3-642-03655-2_73"
    },
    {
      "text": "Regis Kopper, Doug A Bowman, Mara G Silva, and Ryan P McMahan. 2010. A human motor behavior model for distal pointing tasks. International journal of human-computer studies 68, 10 (2010), 603–615.",
      "doi": "10.1016/j.ijhcs.2010.05.001"
    },
    {
      "text": "André Kunert, Alexander Kulik, Stephan Beck, and Bernd Froehlich. 2014. Photoportals: shared references in space and time. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 1388–1399.",
      "doi": "10.1145/2531602.2531727"
    },
    {
      "text": "Nianlong Li, Teng Han, Feng Tian, Jin Huang, Minghui Sun, Pourang Irani, and Jason Alexander. 2020. Get a Grip: Evaluating Grip Gestures for VR Input using a Lightweight Pen. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376698"
    },
    {
      "text": "Yung-Ta Lin, Yi-Chi Liao, Shan-Yuan Teng, Yi-Ju Chung, Liwei Chan, and Bing-Yu Chen. 2017. Outside-in: visualizing out-of-sight regions-of-interest in a 360 video using spatial picture-in-picture previews. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. 255–265.",
      "doi": "10.1145/3126594.3126656"
    },
    {
      "text": "Robert W Lindeman, John L Sibert, and James K Hahn. 1999. Hand-held windows: towards effective 2D interaction in immersive virtual environments. In Proceedings IEEE Virtual Reality (Cat. No. 99CB36316). IEEE, 205–212.",
      "doi": ""
    },
    {
      "text": "David Lindlbauer and Andy D Wilson. 2018. Remixed reality: manipulating space and time in augmented reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3173574.3173703"
    },
    {
      "text": "Fabrice Matulic, Riku Arakawa, Brian Vogel, and Daniel Vogel. 2020. PenSight: Enhanced Interaction with a Pen-Top Camera. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376147"
    },
    {
      "text": "Mark R Mine. 1995. Virtual environment interaction techniques. UNC Chapel Hill CS Dept(1995).",
      "doi": ""
    },
    {
      "text": "Diederick C Niehorster, Li Li, and Markus Lappe. 2017. The Accuracy and Precision of Position and Orientation Tracking in the HTC Vive Virtual Reality System for Scientific Research. i-Perception 8, 3 (2017), 204166951770820.",
      "doi": ""
    },
    {
      "text": "Ko Nishino and Shree K Nayar. 2006. Corneal imaging system: Environment from eyes. International Journal of Computer Vision 70, 1 (2006), 23–40.",
      "doi": "10.1007/s11263-006-6274-9"
    },
    {
      "text": "Jeffrey S Pierce, Andrew S Forsberg, Matthew J Conway, Seung Hong, Robert C Zeleznik, and Mark R Mine. 1997. Image plane interaction techniques in 3D immersive environments. In Proceedings of the 1997 symposium on Interactive 3D graphics. 39–ff.",
      "doi": "10.1145/253284.253303"
    },
    {
      "text": "Ivan Poupyrev, Mark Billinghurst, Suzanne Weghorst, and Tadao Ichikawa. 1996. The go-go interaction technique: non-linear mapping for direct manipulation in VR. In Proceedings of the 9th annual ACM symposium on User interface software and technology. 79–80.",
      "doi": "10.1145/237091.237102"
    },
    {
      "text": "Daniel Schneider and Jens Grubert. 2017. Towards Around-Device Interaction using Corneal Imaging. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces. 287–293.",
      "doi": "10.1145/3132272.3134127"
    },
    {
      "text": "Ludwig Sidenmark, Christopher Clarke, Xuesong Zhang, Jenny Phu, and Hans Gellersen. 2020. Outline Pursuits: Gaze-Assisted Selection of Occluded Objects in Virtual Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376438",
      "doi": "10.1145/3313831.3376438"
    },
    {
      "text": "Richard Stoakley, Matthew J Conway, and Randy Pausch. 1995. Virtual reality on a WIM: interactive worlds in miniature. In Proceedings of the SIGCHI conference on Human factors in computing systems. 265–272.",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Robert J. Teather and Wolfgang Stuerzlinger. 2013. Pointing at 3d Target Projections with One-Eyed and Stereo Cursors. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 159–168. https://doi.org/10.1145/2470654.2470677",
      "doi": ""
    },
    {
      "text": "Huawei Tu, Susu Huang, Jiabin Yuan, Xiangshi Ren, and Feng Tian. 2019. Crossing-based selection with virtual reality head-mounted displays. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300848"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2005. Distant freehand pointing and clicking on very large, high resolution displays. In Proceedings of the 18th annual ACM symposium on User interface software and technology. 33–42.",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Chiu-Hsuan Wang, Chia-En Tsai, Seraphina Yong, and Liwei Chan. 2020. Slice of light: Transparent and integrative transition among realities in a multi-HMD-user environment. In Proceedings of the 33rd Annual ACM Symposium on User Interface Software and Technology. 805–817.",
      "doi": "10.1145/3379337.3415868"
    },
    {
      "text": "Lili Wang, Jian Wu, Xuefeng Yang, and Voicu Popescu. 2019. VR Exploration Assistance through Automatic Occlusion Removal. IEEE transactions on visualization and computer graphics 25, 5(2019), 2083–2092.",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Mark McGill, Matthew Jamieson, Julie R. Williamson, and Stephen A. Brewster. 2018. Object Manipulation in Virtual Reality Under Increasing Levels of Translational Gain. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 99, 13 pages. https://doi.org/10.1145/3173574.3173673",
      "doi": "10.1145/3173574.3173673"
    },
    {
      "text": "Yuko Yanagawa, Kaori Ikematsu, Chihiro Suga, Mana Sasagawa, Yasushi Matoba, and Itiro Siio. 2017. Anamorphicons: An Extended Display Utilizing a Cylindrical Mirror Widget. In Proceedings of the 29th Australian Conference on Computer-Human Interaction. 457–461.",
      "doi": "10.1145/3152771.3156157"
    },
    {
      "text": "Xing-Dong Yang, Khalad Hasan, Neil Bruce, and Pourang Irani. 2013. Surround-see: enabling peripheral vision on smartphones during active use. In Proceedings of the 26th annual ACM symposium on User interface software and technology. 291–300.",
      "doi": "10.1145/2501988.2502049"
    },
    {
      "text": "Chun Yu, Xiaoying Wei, Shubh Vachher, Yue Qin, Chen Liang, Yueting Weng, Yizheng Gu, and Yuanchun Shi. 2019. HandSee: Enabling Full Hand Interaction on Smartphone with Front Camera-based Stereo Vision. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300935"
    }
  ]
}