{
  "doi": "10.1145/3411764.3445612",
  "title": "Touch without Touching: Overcoming Social Distancing in Semi-Intimate Relationships with SansTouch",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Social distancing may force people to restrict social touch practices. Our survey (N=136) highlighted substantial social touch breakdowns during the COVID-19 pandemic for semi-intimate relationships (e.g., friends, colleagues), with handshakes being the most reduced, and frustrations at having to re-establish social touch habits. We then designed SansTouch, a multi-modal hand sleeve used together along with a smartphone to enable mediated hand-to-hand interactions such as handshakes or holding hands. To invoke the mediated touch, users synchronously mimic the hand position as in real life while holding SansTouch. Users can feel the touch sensation in real time without touching. Participants from our observational study (N=12) quickly adopted the hand-to-hand interactions of SansTouch for exchanging greetings face-to-face with colleagues and reported stronger preferences towards using SansTouch as opposed to mid-air gestures (e.g., waving). We discuss design implications, including the trade-offs of multi-modality for touch devices in face-to-face communication.",
  "authors": [
    {
      "name": "Zhuoming Zhang",
      "institution": "LTCI, Télécom Paris, Institut Polytechnique de Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659474059",
      "orcid": "missing"
    },
    {
      "name": "Jessalyn Alvina",
      "institution": "LCTI Télécom Paris, Institut Polytechnique de Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89759013957",
      "orcid": "missing"
    },
    {
      "name": "Robin Héron",
      "institution": "i3, UMR 9217-CNRS Télécom Paris, Institut Polytechnique de Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659084577",
      "orcid": "missing"
    },
    {
      "name": "Stéphane Safin",
      "institution": "i3, CNRS Télécom Paris, Institut Polytechnique de Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81311484620",
      "orcid": "missing"
    },
    {
      "name": "Françoise Détienne",
      "institution": "i3, UMR 9217-CNRS Télécom Paris, Institut Polytechnique de Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100408135",
      "orcid": "missing"
    },
    {
      "name": "Eric Lecolinet",
      "institution": "LTCI, Télécom Paris, Institut Polytechnique de Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100390376",
      "orcid": "0000-0001-8114-1160"
    }
  ],
  "references": [
    {
      "text": "Leonardo Angelini, Maurizio Caon, Denis Lalanne, Omar Abou Khaled, and Elena Mugellini. 2014. Hugginess: Encouraging Interpersonal Touch through Smart Clothes. In Proceedings of the 2014 ACM International Symposium on Wearable Computers: Adjunct Program (Seattle, Washington) (ISWC ’14 Adjunct). Association for Computing Machinery, New York, NY, USA, 155–162. https://doi.org/10.1145/2641248.2641356",
      "doi": "10.1145/2641248.2641356"
    },
    {
      "text": "Sima Asadi, Nicole Bouvier, Anthony S Wexler, and William D Ristenpart. 2020. The coronavirus pandemic and aerosols: Does COVID-19 transmit via expiratory particles?",
      "doi": ""
    },
    {
      "text": "Alexis E. Block and Katherine J. Kuchenbecker. 2018. Softness, Warmth, and Responsiveness Improve Robot Hugs. International Journal of Social Robotics 11, 1 (Oct. 2018), 49–64. https://rdcu.be/baa1k",
      "doi": ""
    },
    {
      "text": "BusinessInsider.fr. 2020. Our ongoing list of how countries are reopening, and which ones remain under lockdown. Retrieved September 2, 2020 from https://www.businessinsider.fr/us/countries-on-lockdown-coronavirus-italy-2020-3",
      "doi": ""
    },
    {
      "text": "Mert Canat, Mustafa Ozan Tezcan, Celalettin Yurdakul, Eran Tiza, Buğra Can Sefercik, Idil Bostan, Oğuz Turan Buruk, Tilbe Göksun, and Oğuzhan Özcan. 2016. Sensation: Measuring the Effects of a Human-to-Human Social Touch Based Controller on the Player Experience. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 3944–3955. https://doi.org/10.1145/2858036.2858418",
      "doi": "10.1145/2858036.2858418"
    },
    {
      "text": "H. H. Clark and Susan E. Brennan. 1991. Grounding in Communication. In Perspectives on Socially Shared Cognition, Lauren Resnick, Levine B., M. John, Stephanie Teasley, and D. (Eds.). American Psychological Association, Washington, DC, 127–149. https://doi.org/10.1037/10096-006",
      "doi": ""
    },
    {
      "text": "Victoria Clarke and Virginia Braun. 2014. Thematic Analysis. Springer New York, New York, NY, 1947–1952. https://doi.org/10.1007/978-1-4614-5583-7_311",
      "doi": ""
    },
    {
      "text": "CNBC.com. 2020. World Health Organization warns: Coronavirus remains ‘extremely dangerous’ and ‘will be with us for a long time’. Retrieved August 17, 2020 from https://www.cnbc.com/2020/04/22/world-health-organzation-warns-coronavirus-will-be-with-us-for-a-long-time.html",
      "doi": ""
    },
    {
      "text": "Ian Darian-Smith and Kenneth O Johnson. 1977. Thermal sensibility and thermoreceptors.Journal of Investigative Dermatology 69, 1 (1977), 146–153.",
      "doi": ""
    },
    {
      "text": "Alexandra Delazio, Ken Nakagaki, Roberta L. Klatzky, Scott E. Hudson, Jill Fain Lehman, and Alanson P. Sample. 2018. Force Jacket: Pneumatically-Actuated Jacket for Embodied Haptic Experiences. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173894",
      "doi": "10.1145/3173574.3173894"
    },
    {
      "text": "C. DiSalvo, F. Gemperle, J. Forlizzi, and E. Montgomery. 2003. The Hug: an exploration of robotic form for intimate communication. In The 12th IEEE International Workshop on Robot and Human Interactive Communication, 2003. Proceedings. ROMAN 2003. IEEE, IEEE Press., New York, 403–408. https://doi.org/10.1109/ROMAN.2003.1251879",
      "doi": ""
    },
    {
      "text": "Beate Ditzen, Inga D Neumann, Guy Bodenmann, Bernadette von Dawans, Rebecca A Turner, Ulrike Ehlert, and Markus Heinrichs. 2007. Effects of different kinds of couple interaction on cortisol and heart rate responses to stress in women. Psychoneuroendocrinology 32, 5 (2007), 565–574. https://doi.org/10.1016/j.psyneuen.2007.03.011",
      "doi": ""
    },
    {
      "text": "Tiffany Field. 2010. Touch for socioemotional and physical well-being: A review. Developmental Review 30, 4 (2010), 367 – 383. https://doi.org/10.1016/j.dr.2011.01.001",
      "doi": ""
    },
    {
      "text": "Kory Floyd. 2014. Relational and health correlates of affection deprivation. Western Journal of Communication 78, 4 (2014), 383–403. https://doi.org/10.1080/10570314.2014.927071",
      "doi": ""
    },
    {
      "text": "Masahiro Furukawa, Hiroyuki Kajimoto, and Susumu Tachi. 2012. KUSUGURI: A Shared Tactile Interface for Bidirectional Tickling. In Proceedings of the 3rd Augmented Human International Conference (Megève, France) (AH ’12). Association for Computing Machinery, New York, NY, USA, Article 9, 8 pages. https://doi.org/10.1145/2160125.2160134",
      "doi": "10.1145/2160125.2160134"
    },
    {
      "text": "Alberto Gallace and Charles Spence. 2010. The science of interpersonal touch: an overview.Neuroscience and biobehavioral reviews 34,2 (2010), 246–259. https://doi.org/10.1016/j.neubiorev.2008.10.004",
      "doi": ""
    },
    {
      "text": "Daniel Gooch and Leon Watts. 2012. YourGloves, Hothands and Hotmits: Devices to Hold Hands at a Distance. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 157–166. https://doi.org/10.1145/2380116.2380138",
      "doi": "10.1145/2380116.2380138"
    },
    {
      "text": "google.com. 2020. Device Orientation and Motion. Retrieved September 10, 2020 from https://developers.google.com/web/fundamentals/native-hardware/device-orientation#when_to_use_device_orientation_events",
      "doi": ""
    },
    {
      "text": "Karen M Grewen, Bobbi J Anderson, Susan S Girdler, and Kathleen C Light. 2003. Warm partner contact is related to lower cardiovascular reactivity. Behavioral medicine 29, 3 (2003), 123–130. https://doi.org/10.1080/08964280309596065",
      "doi": ""
    },
    {
      "text": "Antal Haans and Wijnand IJsselsteijn. 2006. Mediated social touch: a review of current research and future directions. Virtual Reality 9, 2-3 (2006), 149–159. https://doi.org/10.1007/s10055-005-0014-2",
      "doi": "10.5555/3227221.3227398"
    },
    {
      "text": "Sabrina Hauser, Melinda J. Suto, Liisa Holsti, Manon Ranger, and Karon E. MacLean. 2020. Designing and Evaluating Calmer, a Device for Simulating Maternal Skin-to-Skin Holding for Premature Infants. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376539",
      "doi": "10.1145/3313831.3376539"
    },
    {
      "text": "V. Hayward. 2008. A brief taxonomy of tactile illusions and demonstrations that can be done in a hardware store. Brain Research Bulletin 75, 6 (2008), 742–752.",
      "doi": ""
    },
    {
      "text": "Maria Henricson, Anders Ersson, Sylvia Määttä, Kerstin Segesten, and Anna-Lena Berglund. 2008. The outcome of tactile touch on stress parameters in intensive care: a randomized controlled trial. Complementary therapies in clinical practice 14, 4 (2008), 244–254. https://doi.org/10.1016/j.ctcp.2008.03.003",
      "doi": ""
    },
    {
      "text": "Gijs Huisman, Aduen Darriba Frederiks, Betsy Van Dijk, Dirk Hevlen, and Ben Kröse. 2013. The TaSST: Tactile sleeve for social touch. In 2013 World Haptics Conference (WHC). IEEE, IEEE Press., New York, 211–216. https://doi.org/10.1109/WHC.2013.6548410",
      "doi": ""
    },
    {
      "text": "Stanley E Jones and A Elaine Yarbrough. 1985. A naturalistic study of the meanings of touch. Communications Monographs 52, 1 (1985), 19–56. https://doi.org/10.1080/03637758509376094",
      "doi": ""
    },
    {
      "text": "JoyHaptics. 2020. Feel Better With iXu Smart Bear - Remote touch solution for isolated people to feel closeness and touch. Retrieved August 17, 2020 from https://www.joyhaptics.com/",
      "doi": ""
    },
    {
      "text": "Julia Katila, Yumei Gan, and Marjorie Goodwin. 2020. Interaction rituals and ‘social distancing’: New haptic trajectories and touching from a distance in the time of COVID-19. Discourse Studies 22, 4 (06 2020), 418–440. https://doi.org/10.1177/1461445620928213",
      "doi": ""
    },
    {
      "text": "Dimitrios Kontaris, Daniel Harrison, Evgenia-Eleni Patsoule, Susan Zhuang, and Annabel Slade. 2012. Feelybean: Communicating Touch over Distance. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems (Austin, Texas, USA) (CHI EA ’12). Association for Computing Machinery, New York, NY, USA, 1273–1278. https://doi.org/10.1145/2212776.2212439",
      "doi": "10.1145/2212776.2212439"
    },
    {
      "text": "Sarah L Master, Naomi I Eisenberger, Shelley E Taylor, Bruce D Naliboff, David Shirinyan, and Matthew D Lieberman. 2009. A picture’s worth: Partner photographs reduce experimentally induced pain. Psychological Science 20, 11 (2009), 1316–1318. https://doi.org/10.1111/j.1467-9280.2009.02444.x",
      "doi": ""
    },
    {
      "text": "Masahiro Mori, Karl F MacDorman, and Norri Kageki. 2012. The uncanny valley [from the field]. IEEE Robotics & Automation Magazine 19, 2 (2012), 98–100. https://doi.org/10.1109/MRA.2012.2192811",
      "doi": ""
    },
    {
      "text": "Hideyuki Nakanishi, Kazuaki Tanaka, and Yuya Wada. 2014. Remote Handshaking: Touch Enhances Video-Mediated Social Telepresence. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2143–2152. https://doi.org/10.1145/2556288.2557169",
      "doi": "10.1145/2556288.2557169"
    },
    {
      "text": "Shannon O’Brien and Florian ’Floyd’ Mueller. 2006. Holding Hands over a Distance: Technology Probes in an Intimate, Mobile Context. In Proceedings of the 18th Australia Conference on Computer-Human Interaction: Design: Activities, Artefacts and Environments (Sydney, Australia) (OZCHI ’06). Association for Computing Machinery, New York, NY, USA, 293–296. https://doi.org/10.1145/1228175.1228226",
      "doi": "10.1145/1228175.1228226"
    },
    {
      "text": "World Health Organization. 2020. Coronavirus disease (COVID-19) advice for the public. Retrieved September 1, 2020 from https://www.who.int/emergencies/diseases/novel-coronavirus-2019/advice-for-public",
      "doi": ""
    },
    {
      "text": "Claudio Pacchierotti, Stephen Sinclair, Massimiliano Solazzi, Antonio Frisoli, Vincent Hayward, and Domenico Prattichizzo. 2017. Wearable haptic systems for the fingertip and the hand: taxonomy, review, and perspectives. IEEE transactions on haptics 10, 4 (2017), 580–600. https://doi.org/10.1109/TOH.2017.2689006",
      "doi": "10.1109/TOH.2017.2689006"
    },
    {
      "text": "Young-Woo Park, Kyoung-Min Baek, and Tek-Jin Nam. 2013. The Roles of Touch during Phone Conversations: Long-Distance Couples’ Use of POKE in Their Homes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 1679–1688. https://doi.org/10.1145/2470654.2466222",
      "doi": "10.1145/2470654.2466222"
    },
    {
      "text": "Young-Woo Park, Sungjae Hwang, and Tek-Jin Nam. 2011. Poke: Emotional Touch Delivery through an Inflatable Surface over Interpersonal Mobile Communications. In Proceedings of the 24th Annual ACM Symposium Adjunct on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11 Adjunct). Association for Computing Machinery, New York, NY, USA, 61–62. https://doi.org/10.1145/2046396.2046423",
      "doi": "10.1145/2046396.2046423"
    },
    {
      "text": "Young-Woo Park, Chang-Young Lim, and Tek-Jin Nam. 2010. CheekTouch: An Affective Interaction Technique While Speaking on the Mobile Phone. In CHI ’10 Extended Abstracts on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI EA ’10). Association for Computing Machinery, New York, NY, USA, 3241–3246. https://doi.org/10.1145/1753846.1753965",
      "doi": ""
    },
    {
      "text": "Rosalind W Picard and Jennifer Healey. 1997. Affective wearables. Personal Technologies 1, 4 (1997), 231–240. https://doi.org/10.1007/BF01682026",
      "doi": ""
    },
    {
      "text": "M Zia Sadique, W John Edmunds, Richard D Smith, William Jan Meerding, Onno De Zwart, Johannes Brug, and Philippe Beutels. 2007. Precautionary behavior in response to perceived threat of pandemic influenza. Emerging infectious diseases 13, 9 (2007), 1307. https://doi.org/10.3201/eid1309.070372",
      "doi": ""
    },
    {
      "text": "Hooman Aghaebrahimi Samani, Rahul Parsani, Lenis Tejada Rodriguez, Elham Saadatian, Kumudu Harshadeva Dissanayake, and Adrian David Cheok. 2012. Kissenger: Design of a Kiss Transmission Device. In Proceedings of the Designing Interactive Systems Conference (Newcastle Upon Tyne, United Kingdom) (DIS ’12). Association for Computing Machinery, New York, NY, USA, 48–57. https://doi.org/10.1145/2317956.2317965",
      "doi": "10.1145/2317956.2317965"
    },
    {
      "text": "Patrick Saunders-Hastings, James AG Crispo, Lindsey Sikora, and Daniel Krewski. 2017. Effectiveness of personal protective measures in reducing pandemic influenza transmission: A systematic review and meta-analysis. Epidemics 20(2017), 1–20. https://doi.org/10.1016/j.epidem.2017.04.003",
      "doi": ""
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, Yee Loong Ooi, Alissa N. Antle, and Brendan Matkin. 2017. Flex-N-Feel: The Design and Evaluation of Emotive Gloves for Couples to Support Touch Over Distance. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 98–110. https://doi.org/10.1145/2998181.2998247",
      "doi": "10.1145/2998181.2998247"
    },
    {
      "text": "Jordan Tewell, Jon Bird, and George R. Buchanan. 2017. The Heat is On: A Temperature Display for Conveying Affective Feedback. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1756–1767. https://doi.org/10.1145/3025453.3025844",
      "doi": "10.1145/3025453.3025844"
    },
    {
      "text": "Marc Teyssier, Gilles Bailly, Catherine Pelachaud, and Eric Lecolinet. 2018. MobiLimb: Augmenting Mobile Devices with a Robotic Limb. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology (Berlin, Germany) (UIST ’18). Association for Computing Machinery, New York, NY, USA, 53–63. https://doi.org/10.1145/3242587.3242626",
      "doi": "10.1145/3242587.3242626"
    },
    {
      "text": "Marc Teyssier, Gilles Bailly, Catherine Pelachaud, Eric Lecolinet, Andrew Conn, and Anne Roudaut. 2019. Skin-On Interfaces: A Bio-Driven Approach for Artificial Skin Design to Cover Interactive Devices. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 307–322. https://doi.org/10.1145/3332165.3347943",
      "doi": "10.1145/3332165.3347943"
    },
    {
      "text": "Ryusei Uramune, Hiroki Ishizuka, Takefumi Hiraki, Yoshihiro Kawahara, Sei Ikeda, and Osamu Oshiro. 2020. HaPouch: Soft and Wearable Haptic Display Devices Using Liquid-to-Gas Phase Change Actuator. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology (Virtual Event, USA) (UIST ’20 Adjunct). Association for Computing Machinery, New York, NY, USA, 53–55. https://doi.org/10.1145/3379350.3416183",
      "doi": "10.1145/3379350.3416183"
    },
    {
      "text": "Jan BF Van Erp and Alexander Toet. 2015. Social touch in human–computer interaction. Frontiers in digital humanities 2 (2015), 2. https://doi.org/10.1109/WHC.2007.92",
      "doi": ""
    },
    {
      "text": "Rongrong Wang and Francis Quek. 2010. Touch & Talk: Contextualizing Remote Touch for Affective Interaction. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (Cambridge, Massachusetts, USA) (TEI ’10). Association for Computing Machinery, New York, NY, USA, 13–20. https://doi.org/10.1145/1709886.1709891",
      "doi": "10.1145/1709886.1709891"
    },
    {
      "text": "Sheryle J Whitcher and Jeffrey D Fisher. 1979. Multidimensional reaction to therapeutic touch in a hospital setting. Journal of Personality and Social Psychology 37, 1(1979), 87. https://doi.org/10.1037/0022-3514.37.1.87",
      "doi": ""
    },
    {
      "text": "Graham Wilson and Stephen A. Brewster. 2017. Multi-Moji: Combining Thermal, Vibrotactile & Visual Stimuli to Expand the Affective Range of Feedback. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 1743–1755. https://doi.org/10.1145/3025453.3025614",
      "doi": "10.1145/3025453.3025614"
    },
    {
      "text": "Yohei Yamaguchi, Hidekatsu Yanagi, and Yoshinari Takegawa. 2013. Touch-shake: Design and implementation of a physical contact support device for face-to-face communication. In 2013 IEEE 2nd Global Conference on Consumer Electronics (GCCE). IEEE, IEEE Press., New York, 170–174. https://doi.org/10.1109/GCCE.2013.6664789",
      "doi": ""
    },
    {
      "text": "Eric M Young, Amirhossein H Memar, Priyanshu Agarwal, and Nick Colonnese. 2019. Bellowband: A Pneumatic Wristband for Delivering Local Pressure and Vibration. In 2019 IEEE World Haptics Conference (WHC). IEEE, IEEE Press., New York, 55–60. https://doi.org/10.1109/WHC.2019.8816075",
      "doi": ""
    },
    {
      "text": "Zhuoming Zhang, Robin Héron, Eric Lecolinet, Françoise Detienne, and Stéphane Safin. 2019. VisualTouch: Enhancing Affective Touch Communication with Multi-Modality Stimulation. In 2019 International Conference on Multimodal Interaction (Suzhou, China) (ICMI ’19). Association for Computing Machinery, New York, NY, USA, 114–123. https://doi.org/10.1145/3340555.3353733",
      "doi": ""
    },
    {
      "text": "Mengjia Zhu, Amirhossein H. Memar, Aakar Gupta, Majed Samad, Priyanshu Agarwal, Yon Visell, Sean J. Keller, and Nicholas Colonnese. 2020. PneuSleeve: In-Fabric Multimodal Actuation and Sensing in a Soft, Compact, and Expressive Haptic Sleeve. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376333",
      "doi": "10.1145/3313831.3376333"
    }
  ]
}