{
  "doi": "10.1145/3411764.3445374",
  "title": "BackTrack: 2D Back-of-device Interaction Through Front Touchscreen",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-8",
  "year": 2021,
  "badges": [],
  "abstract": "We present BackTrack, a trackpad placed on the back of a smartphone to track fine-grained finger motions. Our system has a small form factor, with all the circuits encapsulated in a thin layer attached to a phone case. It can be used with any off-the-shelf smartphone, requiring no power supply or modification of the operating systems. BackTrack simply extends the finger tracking area of the front screen, without interrupting the use of the front screen. It also provides a switch to prevent unintentional touch on the trackpad. All these features are enabled by a battery-free capacitive circuit, part of which is a transparent, thin-film conductor coated on a thin glass and attached to the front screen. To ensure accurate and robust tracking, the capacitive circuits are carefully designed. Our design is based on a circuit model of capacitive touchscreens, justified through both physics-based finite-element simulation and controlled laboratory experiments. We conduct user studies to evaluate the performance of using BackTrack. We also demonstrate its use in a number of smartphone applications.",
  "authors": [
    {
      "name": "Chang Xiao",
      "institution": "Columbia University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659246380",
      "orcid": "missing"
    },
    {
      "name": "Karl Bayer",
      "institution": "Snap Inc., United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659446666",
      "orcid": "missing"
    },
    {
      "name": "Changxi Zheng",
      "institution": "Columbia University, United States",
      "img": "/do/10.1145/contrib-99658628221/rel-imgonly/zheng500.png",
      "acmid": "99658628221",
      "orcid": "missing"
    },
    {
      "name": "Shree K. Nayar",
      "institution": "Snap Inc., United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702154",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Humza Akhtar and Ramakrishna Kakarala. 2014. A comparative analysis of capacitive touch panel grid designs and interpolation methods. In 2014 IEEE International Conference on Image Processing (ICIP). IEEE, 5796–5800.",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch and Gerry Chu. 2009. Back-of-device interaction allows creating very small touch devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1923–1932.",
      "doi": "10.1145/1518701.1518995"
    },
    {
      "text": "Joanna Bergstrom-Lehtovirta and Antti Oulasvirta. 2014. Modeling the functional area of the thumb on mobile touchscreen surfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1991–2000.",
      "doi": "10.1145/2556288.2557354"
    },
    {
      "text": "Zekun Chang, Heeju Kim, Kunihiro Kato, Kazuya Saito, Tung D Ta, Weiwei Jiang, Koya Narumi, Yoshinobu Miyamoto, and Yoshihiro Kawahara. 2019. Kirigami Keyboard: Inkjet Printable Paper Interface with Kirigami Structure Presenting Kinesthetic Feedback. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–5.",
      "doi": ""
    },
    {
      "text": "Christian Corsten, Bjoern Daehlmann, Simon Voelker, and Jan Borchers. 2017. BackXPress: using back-of-device finger pressure to augment touchscreen input on smartphones. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 4654–4666.",
      "doi": "10.1145/3025453.3025565"
    },
    {
      "text": "Alexander De Luca, Marian Harbach, Emanuel von Zezschwitz, Max-Emanuel Maurer, Bernhard Ewald Slawik, Heinrich Hussmann, and Matthew Smith. 2014. Now you see me, now you don’t: protecting smartphone authentication from shoulder surfers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2937–2946.",
      "doi": "10.1145/2556288.2557097"
    },
    {
      "text": "Alexander De Luca, Emanuel Von Zezschwitz, Ngo Dieu Huong Nguyen, Max-Emanuel Maurer, Elisa Rubegni, Marcello Paolo Scipioni, and Marc Langheinrich. 2013. Back-of-device authentication on smartphones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2389–2398.",
      "doi": "10.1145/2470654.2481330"
    },
    {
      "text": "Alexander De Luca, Emanuel von Zezschwitz, Ngo Dieu Huong Nguyen, Max-Emanuel Maurer, Elisa Rubegni, Marcello Paolo Scipioni, and Marc Langheinrich. 2013. Back-of-Device Authentication on Smartphones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 2389–2398. https://doi.org/10.1145/2470654.2481330",
      "doi": "10.1145/2470654.2481330"
    },
    {
      "text": "Emilio Granell and Luis A Leiva. 2016. Less is more: Efficient back-of-device tap input detection using built-in smartphone sensors. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces. 5–11.",
      "doi": "10.1145/2992154.2992166"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew S Reynolds, and Joshua R Smith. 2017. Finding common ground: A survey of capacitive sensing in human-computer interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3293–3315.",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Hiroyuki Hakoda, Yoshitomo Fukatsu, Buntarou Shizuki, and Jiro Tanaka. 2015. Back-of-Device Interaction based on the Range of Motion of the Index Finger. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. 202–206.",
      "doi": "10.1145/2838739.2838812"
    },
    {
      "text": "Shigeo Hiraoka, Isshin Miyamoto, and Kiyoshi Tomimatsu. 2003. Behind touch, a text input method for mobile phones by the back and tactile sense interface. Information Processing Society of Japan, Interaction 2003 (2003), 131–138.",
      "doi": ""
    },
    {
      "text": "Kaori Ikematsu, Masaaki Fukumoto, and Itiro Siio. 2019. Ohmic-Sticker: Force-to-Motion Type Input Device that Extends Capacitive Touch Surface. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. 1021–1030.",
      "doi": "10.1145/3332165.3347903"
    },
    {
      "text": "Kaori Ikematsu and Itiro Siio. 2018. Ohmic-Touch: Extending Touch Interaction by Indirect Touch Through Resistive Objects. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3173574.3174095"
    },
    {
      "text": "Kunihiro Kato, Kaori Ikematsu, and Yoshihiro Kawahara. 2020. CAPath: 3D-Printed Interfaces with Conductive Points in Grid Layout to Extend Capacitive Touch Inputs. Proceedings of the ACM on Human-Computer Interaction 4, ISS(2020), 1–17.",
      "doi": "10.1145/3427321"
    },
    {
      "text": "Kunihiro Kato and Homei Miyashita. 2015. Extensionsticker: A proposal for a striped pattern sticker to extend touch interfaces and its assessment. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1851–1854.",
      "doi": "10.1145/2702123.2702500"
    },
    {
      "text": "Sven Kratz and Michael Rohs. 2009. HoverFlow: expanding the design space of around-device interaction. In Proceedings of the 11th International Conference on Human-Computer Interaction with Mobile Devices and Services. 1–8.",
      "doi": ""
    },
    {
      "text": "Gierad Laput, Robert Xiao, and Chris Harrison. 2016. Viband: High-fidelity bio-acoustic sensing using commodity smartwatch accelerometers. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. 321–333.",
      "doi": "10.1145/2984511.2984582"
    },
    {
      "text": "Huy Viet Le, Patrick Bader, Thomas Kosch, and Niels Henze. 2016. Investigating screen shifting techniques to improve one-handed smartphone usage. In Proceedings of the 9th Nordic Conference on Human-Computer Interaction. 1–10.",
      "doi": "10.1145/2971485.2971562"
    },
    {
      "text": "Huy Viet Le, Sven Mayer, Patrick Bader, and Niels Henze. 2018. Fingers’ Range and Comfortable Area for One-Handed Smartphone Interaction Beyond the Touchscreen. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173605"
    },
    {
      "text": "Huy Viet Le, Sven Mayer, and Niels Henze. 2018. InfiniTouch: Finger-Aware Interaction on Fully Touch Sensitive Smartphones. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology. 779–792.",
      "doi": "10.1145/3242587.3242605"
    },
    {
      "text": "SK Lee, William Buxton, and KC Smith. 1985. A multi-touch three dimensional touch-sensitive tablet. Acm Sigchi Bulletin 16, 4 (1985), 21–25.",
      "doi": "10.1145/1165385.317461"
    },
    {
      "text": "Luis A Leiva and Alejandro Català. 2014. BoD taps: an improved back-of-device authentication technique on smartphones. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. 63–66.",
      "doi": "10.1145/2628363.2628372"
    },
    {
      "text": "Kevin A Li, Patrick Baudisch, and Ken Hinckley. 2008. Blindsight: eyes-free access to mobile phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1389–1398.",
      "doi": "10.1145/1357054.1357273"
    },
    {
      "text": "Markus Löchtefeld, Christoph Hirtz, and Sven Gehring. 2013. Evaluation of hybrid front-and back-of-device interaction on mobile devices. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia. 1–4.",
      "doi": "10.1145/2541831.2541865"
    },
    {
      "text": "Nobutaka Matsushima, Wataru Yamada, and Hiroyuki Manabe. 2017. Attaching objects to smartphones back side for a modular interface. In Adjunct Publication of the 30th Annual ACM Symposium on User Interface Software and Technology. 51–52.",
      "doi": "10.1145/3131785.3131810"
    },
    {
      "text": "Valkyrie Savage, Xiaohan Zhang, and Björn Hartmann. 2012. Midas: fabricating custom capacitive touch sensors to prototype interactive objects. In Proceedings of the 25th annual ACM symposium on User interface software and technology. 579–588.",
      "doi": "10.1145/2380116.2380189"
    },
    {
      "text": "Masanori Sugimoto and Keiichi Hiroki. 2006. HybridTouch: an intuitive manipulation technique for PDAs using their front and rear surfaces. In Proceedings of the 8th conference on Human-computer interaction with mobile devices and services. 137–140.",
      "doi": "10.1145/1152215.1152243"
    },
    {
      "text": "Ke Sun, Ting Zhao, Wei Wang, and Lei Xie. 2018. Vskin: Sensing touch gestures on surfaces of mobile devices using acoustic signals. In Proceedings of the 24th Annual International Conference on Mobile Computing and Networking. 591–605.",
      "doi": "10.1145/3241539.3241568"
    },
    {
      "text": "Anran Wang and Shyamnath Gollakota. 2019. Millisonic: Pushing the limits of acoustic motion tracking. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–11.",
      "doi": "10.1145/3290605.3300248"
    },
    {
      "text": "Yuntao Wang, Jianyu Zhou, Hanchuan Li, Tengxiang Zhang, Minxuan Gao, Zhuolin Cheng, Chun Yu, Shwetak Patel, and Yuanchun Shi. 2019. Flextouch: Enabling large-scale interaction sensing beyond touchscreens using flexible and conductive materials. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 3 (2019), 1–20.",
      "doi": "10.1145/3359194"
    },
    {
      "text": "Daniel Wigdor, Darren Leigh, Clifton Forlines, Samuel Shipman, John Barnwell, Ravin Balakrishnan, and Chia Shen. 2006. Under the table interaction. In Proceedings of the 19th annual ACM symposium on User interface software and technology. 259–268.",
      "doi": "10.1145/1166253.1166294"
    },
    {
      "text": "Pui Chung Wong, Hongbo Fu, and Kening Zhu. 2016. Back-Mirror: back-of-device one-handed interaction on smartphones. In SIGGRAPH ASIA 2016 Mobile Graphics and Interactive Applications. 1–5.",
      "doi": "10.1145/2999508.2999512"
    },
    {
      "text": "Chang Xiao, Karl Bayer, Changxi Zheng, and Shree K Nayar. 2019. Vidgets: modular mechanical widgets for mobile devices. ACM Transactions on Graphics (TOG) 38, 4 (2019), 1–12.",
      "doi": "10.1145/3306346.3322943"
    },
    {
      "text": "Robert Xiao, Gierad Laput, and Chris Harrison. 2014. Expanding the input expressivity of smartwatches with mechanical pan, twist, tilt and click. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 193–196.",
      "doi": "10.1145/2556288.2557017"
    },
    {
      "text": "Robert Xiao, Greg Lew, James Marsanico, Divya Hariharan, Scott Hudson, and Chris Harrison. 2014. Toffee: enabling ad hoc, around-device interaction with acoustic time-of-arrival correlation. In Proceedings of the 16th international conference on Human-computer interaction with mobile devices & services. 67–76.",
      "doi": "10.1145/2628363.2628383"
    },
    {
      "text": "Xiang Xiao, Teng Han, and Jingtao Wang. 2013. LensGesture: augmenting mobile interactions with back-of-device finger gestures. In Proceedings of the 15th ACM on International conference on multimodal interaction. 287–294.",
      "doi": "10.1145/2522848.2522850"
    },
    {
      "text": "Neng-Hao Yu, Sung-Sheng Tsai, I-Chun Hsiao, Dian-Je Tsai, Meng-Han Lee, Mike Y Chen, and Yi-Ping Hung. 2011. Clip-on gadgets: expanding multi-touch interaction area with unpowered tactile controls. In Proceedings of the 24th annual ACM symposium on User interface software and technology. 367–372.",
      "doi": "10.1145/2047196.2047243"
    },
    {
      "text": "Cheng Zhang, Anhong Guo, Dingtian Zhang, Yang Li, Caleb Southern, Rosa I Arriaga, and Gregory D Abowd. 2016. Beyond the touchscreen: an exploration of extending interactions on commodity smartphones. ACM Transactions on Interactive Intelligent Systems (TiiS) 6, 2(2016), 1–23.",
      "doi": "10.1145/2954003"
    },
    {
      "text": "Cheng Zhang, Junrui Yang, Caleb Southern, Thad E Starner, and Gregory D Abowd. 2016. WatchOut: extending interactions on a smartwatch with inertial sensing. In Proceedings of the 2016 ACM International Symposium on Wearable Computers. 136–143.",
      "doi": "10.1145/2971763.2971775"
    }
  ]
}