{
  "doi": "10.1145/3411764.3445128",
  "title": "Circumspect Users: Older Adults as Critical Adopters and Resistors of Technology",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "While HCI research has often addressed the needs of older adults, they are often framed as being sceptical of digital technologies. We argue that while many older adults are circumspect users of digital technology, they bring rich and critical perspectives on the role of technology in society that are grounded in lived experiences across their life courses. We report on 20 technology life story interviews conducted with retirees over the age of 60. Our analysis shows how experiences of technology across their life courses significantly undermined participants’ sense of competency, independence, resilience, agency and control. Dissonances between what our participants valued and the perceived values of technology have led them to become critical adopters of technology, and resist its intrusion into certain aspects of their lives. We discuss how the critical perspectives of older adults and the value dissonances they experience are valuable for designing future digital technologies.",
  "authors": [
    {
      "name": "Belén Barros Pena",
      "institution": "School of Design Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659547217",
      "orcid": "0000-0003-4035-1860"
    },
    {
      "name": "Rachel E Clarke",
      "institution": "Open Lab Newcastle University, United Kingdom",
      "img": "/do/10.1145/contrib-81501686180/rel-imgonly/people-rachel-clarke-medium.jpg",
      "acmid": "81501686180",
      "orcid": "missing"
    },
    {
      "name": "Lars Erik Holmquist",
      "institution": "School of Design Northumbria University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100144729",
      "orcid": "missing"
    },
    {
      "name": "John Vines",
      "institution": "Northumbria University, United Kingdom",
      "img": "/do/10.1145/contrib-81310491267/rel-imgonly/johnvines002.jpg",
      "acmid": "81310491267",
      "orcid": "0000-0003-4051-3356"
    }
  ],
  "references": [
    {
      "text": "Johri Aditya. 2018. How FLOSS Participation Supports Lifelong Learning and Working: Apprenticeship Across Time and Spatialities. In Proceedings of the 14th International Symposium on Open Collaboration(OpenSym ’18). 1–8. https://doi.org/10.1145/3233391.3233541",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Understanding and Supporting Fathers and Fatherhood on Social Media Sites. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 1905–1914. https://doi.org/10.1145/2702123.2702205",
      "doi": "10.1145/2702123.2702205"
    },
    {
      "text": "Leonardo Angelini, Elena Mugellini, Omar Abou Khaled, Christina Rocke, Sabrina Guye, Simone Porcelli, Alfonso Mastropietro, Giovanna Rizzo, Noemi Boque, Josep M del Bas, Paula Subias, Silvia Orte, and Giuseppe Andreoni. 2019. The NESTORE e-Coach: Accompanying Older Adults through a Personalized Pathway to Wellbeing. In Proceedings of the 12th ACM International Conference on PErvasive Technologies Related to Assistive Environments(Rhodes, Greece) (PETRA ’19). ACM, New York, NY, USA, 620–628. https://doi.org/10.1145/3316782.3322763",
      "doi": "10.1145/3316782.3322763"
    },
    {
      "text": "Robert G. Atkinson. 1998. The Life Story Interview. SAGE Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Robert G. Atkinson. 2007. Handbook of Narrative Enquiry: Mapping a Methodology. SAGE Publications, Inc., Chapter The Life Story Interview as a Bridge in Narrative Inquiry, 224–241.",
      "doi": ""
    },
    {
      "text": "Lyndsey L. Bakewell, Konstantina Vasileiou, Kiel S. Long, Mark Atkinson, Helen Rice, Manuela Barreto, Julie Barnett, Michael Wilson, Shaun Lawson, and John Vines. 2018. Everything We Do, Everything We Press: Data-Driven Remote Performance Management in a Mobile Workplace. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 1885–1894. https://doi.org/10.1145/3173574.3173945",
      "doi": "10.1145/3173574.3173945"
    },
    {
      "text": "Eric P.S. Baumer, Morgan G. Ames, Jenna Burrell, Jed R. Brubaker, and Paul Dourish. 2015. Why study technology non-use?First Monday 20, 11 (2015). https://doi.org/10.5210/fm.v20i11.6310",
      "doi": ""
    },
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the implication is not to design (technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). ACM, New York, NY, USA, 2271–2274. https://doi.org/10.1145/1978942.1979275",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "Vern L. Bengston, Gledn H. Elder, and Norella M. Putney. 2007. Cambridge Handbook of Age & Ageing. Cambridge University Press, Chapter The Lifecourse Perspective on Ageing: Linked Lives, Timing, and History, 493–501.",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Kristina Andersen, Rachel Clarke, and Peter Wright. 2016. Anti-Solutionist Strategies: Seriously Silly Design Fiction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 4968–4978. https://doi.org/10.1145/2858036.2858482",
      "doi": "10.1145/2858036.2858482"
    },
    {
      "text": "Mark Blythe, Andrew Monk, and Jisoo Park. 2002. Technology Biographies: Field Study Techniques For Home Use Product Development. In CHI ’02 Extended Abstracts on Human Factors in Computing Systems (Minneapolis, Minnesota, USA) (CHI EA ’02). ACM, New York, NY, USA, 658–659. https://doi.org/10.1145/506443.506532",
      "doi": ""
    },
    {
      "text": "Mark Blythe, Jamie Steane, Jenny Roe, and Caroline Oliver. 2015. Solutionism, the Game: Design Fictions for Positive Aging. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 3849–3858. https://doi.org/10.1145/2702123.2702491",
      "doi": "10.1145/2702123.2702491"
    },
    {
      "text": "Mark A. Blythe, Andrew F. Monk, and Kevin Doughty. 2005. Socially dependable design: The challenge of ageing populations for HCI. Interacting with Computers 17, 6 (2005), 672–689. https://doi.org/10.1016/j.intcom.2005.09.005",
      "doi": "10.1016/j.intcom.2005.09.005"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Robin Brewer and Anne Marie Piper. 2016. ”Tell It Like It Really Is”: A Case of Online Content Creation and Sharing Among Older Adult Bloggers. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 5529–5542. https://doi.org/10.1145/2858036.2858379",
      "doi": "10.1145/2858036"
    },
    {
      "text": "Robin N. Brewer and Anne Marie Piper. 2017. xPress: Rethinking Design for Aging and Accessibility through a Voice-based Online Blogging Community. Proceedings of the ACM on Human-Computer Interaction 1 (2017). https://doi.org/10.1145/3139354Article No. 26.",
      "doi": ""
    },
    {
      "text": "Lauren Britton, Louise Barkhuus, and Bryan Semaan. 2019. ’Mothers as Candy Wrappers’: Critical Infrastructure Supporting the Transition into Motherhood. Proceedings of the ACM on Human-Computer InteractionDecember (2019). https://doi.org/10.1145/3361113",
      "doi": "10.1145/3361113"
    },
    {
      "text": "Jed R. Brubaker, Gillian R. Hayes, and Paul Dourish. 2013. Beyond the Grave: Facebook as a Site for the Expansion of Death and Mourning. The Information Society 29, 3 (2013), 152–163. https://doi.org/10.1080/01972243.2013.777300",
      "doi": "10.1080/01972243.2013.777300"
    },
    {
      "text": "John M. Carroll, Gregorio Convertino, Umer Farooq, and Mary Beth Rosson. 2012. The firekeepers: aging considered as a resource. Universal Access in the Information Society 11, 1 (2012), 7–15. https://doi.org/10.1007/s10209-011-0229-9",
      "doi": "10.1007/s10209-011-0229-9"
    },
    {
      "text": "Pew Research Center. 2017. Tech Adoption Climbs Among Older Adults. Retrieved September 09, 2019 from https://www.pewinternet.org/wp-content/uploads/sites/9/2017/05/PI_2017.05.17_Older-Americans-Tech_FINAL.pdf.",
      "doi": ""
    },
    {
      "text": "Michael Chan. 2018. Mobile-mediated multimodal communications, relationship quality and subjective well-being: An analysis of smartphone use from a life course perspective. Computers in Human Behaviour 87 (2018), 254–262. https://doi.org/10.1016/j.chb.2018.05.027",
      "doi": ""
    },
    {
      "text": "Noelle Chesley and Britta E. Johnson. 2014. Information and Communication Technology Use and Social Connectedness over the Life Course. Sociology Compass 8, 6 (2014), 589–602. https://doi.org/10.1111/soc4.12170",
      "doi": ""
    },
    {
      "text": "John A. Clausen. 1998. Methods of Life Course Research: Qualitative and Quantitative Approaches. SAGE Publications, Inc., Chapter Life Reviews and Life Stories, 189–212.",
      "doi": ""
    },
    {
      "text": "Michael A. DeVito, Darren Gergle, and Jeremy Birnholtz. 2017. ’Algorithms ruin everything’: #RIPTwitter, Folk Theories, and Resistance to Algorithmic Change in Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 3163–3174. https://doi.org/10.1145/3025453.3025659",
      "doi": "10.1145/3025453.3025659"
    },
    {
      "text": "Martin Diewald and Karl Ulrich Mayer. 2008. The Sociology of the Life Course and Life Span Psychology: Integrated Paradigm or Complementing Pathways?DIW Berlin Discussion Paper No. 772(2008). https://doi.org/10.2139/ssrn.1105277",
      "doi": ""
    },
    {
      "text": "Julie Doyle, Lorcan Walsh, Antonella Sassu, and Teresa McDonagh. 2014. Designing a Wellness Self-Management Tool for Older Adults - Results from a Field Trial of YourWellness. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare (Oldenburg, Germany) (PervasiveHealth ’14). ICST, Brussels, Belgium, 134–141. https://doi.org/10.4108/icst.pervasivehealth.2014.254950",
      "doi": "10.4108/icst.pervasivehealth.2014.254950"
    },
    {
      "text": "Jeannette Durick, Toni Robertson, Margot Brereton, Frank Vetere, and Bjorn Nansen. 2013. Dispelling ageing myths in technology design. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (Adelaide, Australia) (OzCHI ’13). ACM, New York, NY, USA, 467–476. https://doi.org/10.1145/2541016.2541040",
      "doi": "10.1145/2541016.2541040"
    },
    {
      "text": "Abigail Durrant, David Kirk, Diego Trujillo Pisanty, Wendy Moncur, Kathryn Orzech, Tom, Schofield, Chris Elsden, David Chatting, and Andrew Monk. 2017. Transitions in digital personhood: Online activity in early retirement. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 6398–6411. https://doi.org/10.1145/3025453.3025913",
      "doi": "10.1145/3025453.3025913"
    },
    {
      "text": "Gledn H. Elder, Monica Kirkpatrick Johnson, and Robert Crosnoe. 2003. Handbook of the Life Course. Springer, US, Chapter The Emergence and Development of Life Course Theory, 3–19.",
      "doi": ""
    },
    {
      "text": "Pin Sym Foong. 2016. Mobile Communication and the Family - Asian Experiences in Technology Domestication. Dordrecht, Springer, Netherlands, Chapter The Value of the Life Course Perspective in the Design of Mobile Technologies for Older Adults, 165–181.",
      "doi": ""
    },
    {
      "text": "Batya Friedman. 1996. Value-Sensitive Design. interactions 3, 6 (1996), 16–23. https://doi.org/10.1145/242485.242493",
      "doi": ""
    },
    {
      "text": "Chiara Garattini, Joseph Wherton, and David Prendergast. 2012. Linking the lonely: an exploration of a communication technology designed to support social interaction among older adults. Universal Access in the Information Society 11, 2 (2012), 211–222. https://doi.org/10.1007/s10209-011-0235-y",
      "doi": "10.1007/s10209-011-0235-y"
    },
    {
      "text": "Cally Gatehouse, Matthew Wood, Jo Briggs, James Pickles, and Shaun Lawson. 2018. Troubling Vulnerability: Designing with LGBT Young People’s Ambivalence Towards Hate Crime Reporting. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA. https://doi.org/10.1145/3173574.3173683",
      "doi": "10.1145/3173574.3173683"
    },
    {
      "text": "David Graeber. 2013. It is value that brings universes into being. HAU: Journal of Ethnographic Theory 3, 2 (2013), 219–243. https://doi.org/10.14318/hau3.2.012",
      "doi": ""
    },
    {
      "text": "Lorraine Green. 2016. Understanding the Life Course: Sociological and Psychological Perspectives. Polity Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). https://doi.org/10.1145/2675133.2675152",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Ellie Harmon, Matthias Korn, and Amy Voida. 2017. Supporting Everyday Philanthropy: Care Work In Situ and at Scale. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). 1631–1645. https://doi.org/10.1145/2998181.2998330",
      "doi": "10.1145/2998181.2998330"
    },
    {
      "text": "Eulalia Hernandez-Encuentra, Modesta Pousada, and Beni Gomez-Zuniga. 2009. ICT and Older People: Beyond Usability. Educational Gerontology 35, 3 (2009), 226–245. https://doi.org/10.1080/03601270802466934",
      "doi": ""
    },
    {
      "text": "Magdalena Kania-Lundholm and Sandra Torres. 2015. The divide within: Older active ICT users position themselves against different ’Others’. Journal of Aging Studies 35 (2015), 26–36. https://doi.org/10.1016/j.jaging.2015.07.008",
      "doi": ""
    },
    {
      "text": "Stephen Katz. 2003. Technology, Life course and the Post-Industrial Landscape. Gerontechnology 2, 3 (2003), 255–259. https://doi.org/10.4017/gt.2003.02.03.004.00",
      "doi": ""
    },
    {
      "text": "Jofish Kaye, Mary McCuistion, Rebecca Gulotta, and David A. Shamma. 2014. Money Talks: Tracking Personal Finances. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). ACM, New York, NY, USA. https://doi.org/10.1145/2556288.2556975",
      "doi": "10.1145/2556288.2556975"
    },
    {
      "text": "Bran Knowles and Vicki L. Hanson. 2018. Older Adults’ Deployment of ’Distrust’. ACM Transactions on Computer-Human Interaction (TOCHI) 25, 4(2018). https://doi.org/10.1145/3196490",
      "doi": "10.1145/3196490"
    },
    {
      "text": "Bran Knowles and Vicki L. Hanson. 2018. The Wisdom of Older Technology (Non)Users. Commun. ACM 61, 3 (2018), 72–77. https://doi.org/10.1145/3179995",
      "doi": "10.1145/3179995"
    },
    {
      "text": "Bran Knowles, Vicki L. Hanson, Yvonne Rogers, Anne Marie Piper, Jenny Waycott, and Nigel Davies. 2019. HCI and Aging: Beyond Accessibility. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland, UK) (CHI EA ’19). ACM, New York, NY, USA, 1–8. https://doi.org/10.1145/3290607.3299025",
      "doi": "10.1145/3290607.3299025"
    },
    {
      "text": "Sanna-Mari Kuoppamaki, Sakari Taipale, and Terhi-Anna Wilska. 2017. The use of mobile technology for online shopping and entertainment among older adults in Finland. Telematics and Informatics 34, 6 (2017), 110–117. https://doi.org/10.1016/j.tele.2017.01.005",
      "doi": "10.1016/j.tele.2017.01.005"
    },
    {
      "text": "Amanda Lazar, Mark Diaz, Robin Brewer, Chelsea Kim, and Anne Marie Piper. 2017. Going Gray, Failure to Hire, and the Ick Factor: Analyzing How Older Bloggers Talk about Ageism. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). ACM, New York, NY, USA, 655–668. https://doi.org/10.1145/2998181.2998275",
      "doi": "10.1145/2998181.2998275"
    },
    {
      "text": "Tuck Wah Leong and Toni Robertson. 2016. Voicing values: laying foundations for ageing people to participate in design. In Proceedings of the 14th Participatory Design Conference: Full papers (Aarhus, Denmark) (PDC ’16). ACM, New York, NY, USA, 31–40. https://doi.org/10.1145/2940299.2940301",
      "doi": "10.1145/2940299.2940301"
    },
    {
      "text": "Ann Light, Tuck W Leong, and Toni Robertson. 2015. Ageing Well with CSCW. In Proceedings of the 14th European Conference on Computer Supported Cooperative Work (Oslo, Norway) (ECSCW ’15). Springer, Cham, 295–404. https://doi.org/10.1007/978-3-319-20499-4_16",
      "doi": ""
    },
    {
      "text": "Ann Light, Gini Simpson, Lois Weaver, and Patrick G. T. Healey. 2009. Geezers, Turbines, Fantasy Personas: Making the Everyday into the Future. In Proceedings of the seventh ACM conference on Creativity and cognition (Berkeley, California, USA) (C&C ’09). ACM, New York, NY, USA, 39–48. https://doi.org/10.1145/1640233.1640243",
      "doi": ""
    },
    {
      "text": "Karl Ulrich Mayer. 2004. Whose Lives? How History, Societies, and Institutions Define and Shape Life Courses. Research in Human Development 1, 3 (2004), 161–187. https://doi.org/10.1207/s15427617rhd0103_3",
      "doi": ""
    },
    {
      "text": "Karl Ulrich Mayer. 2009. New Directions in Life Course Research. Annual Review of Sociology 35 (2009), 413–433. https://doi.org/10.1146/annurev.soc.34.040507.134619",
      "doi": ""
    },
    {
      "text": "Marilyn R. McGee-Lennon, Maria K. Wolters, and Stephen Brewster. 2011. User-Centred Multimodal Reminders for Assistive Living. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 2105–2114. https://doi.org/10.1145/1978942.1979248",
      "doi": "10.1145/1978942.1979248"
    },
    {
      "text": "Lily Nosraty, Marja Jylha, Taina Raittila, and Kirsi Lumme-Sandt. 2015. Perceptions by the oldest old of successful aging, Vitality 90+ Study. Journal of Aging Studies 32 (2015), 50–58. https://doi.org/10.1016/j.jaging.2015.01.002",
      "doi": ""
    },
    {
      "text": "United Nations Department of Economic and Social Affairs Population Division. 2019. World Population Prospects 2019, custom data acquired via website. https://population.un.org",
      "doi": ""
    },
    {
      "text": "Ofcom. 2010. Ofcom Adult’s Media Literacy Tracker. Retrieved September 09, 2019 from http://static.ofcom.org.uk/static/stats/MLAudit2010Adult.pdf.",
      "doi": ""
    },
    {
      "text": "Ofcom. 2019. Adult’s Media Use and Attitudes Report - Chart Pack. Retrieved September 09, 2019 from https://www.ofcom.org.uk/__data/assets/pdf_file/0031/149872/Adults-media-use-and-attitudes-report-2019-chart-pack.pdf.",
      "doi": ""
    },
    {
      "text": "Ofcom. 2019. Ofcom Nations & Regions Technology Tracker. Retrieved September 09, 2019 from https://www.ofcom.org.uk/__data/assets/pdf_file/0026/143981/technology-tracker-2019-uk-data-tables.pdf.",
      "doi": ""
    },
    {
      "text": "Michelle Pannor Silver. 2014. Socio-economic status over the lifecourse and internet use in older adulthood. Ageing & Society 34(2014), 1019–1034. https://doi.org/10.1017/S0144686X12001420",
      "doi": ""
    },
    {
      "text": "Gary W. Pritchard, Pam Briggs, John Vines, and Patrick Olivier. 2015. How to Drive a London Bus: Measuring Performance in a Mobile and Remote Workplace. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). ACM, New York, NY, USA, 1885–1894. https://doi.org/10.1145/2702123.2702307",
      "doi": "10.1145/2702123.2702307"
    },
    {
      "text": "Anabel Quan-Haase and Isioma Elueze. 2018. Revisiting the Privacy Paradox: Concerns and Protection Strategies in the Social Media Experiences of Older Adults. In Proceedings of the 9th International Conference on Social Media and Society (Copenhagen, Denmark) (SMSociety ’18). ACM, New York, NY, USA, 150–159. https://doi.org/10.1145/3217804.3217907",
      "doi": "10.1145/3217804.3217907"
    },
    {
      "text": "Yvonne Rogers, Jeni Paay, Margot Brereton, Kate Vaisutis, Gary Marsden, and Frank Vetere. 2014. Never Too Old: Engaging Retired People Inventing the Future with MaKey MaKey. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 3913–3922. https://doi.org/10.1145/2556288.2557184",
      "doi": "10.1145/2556288.2557184"
    },
    {
      "text": "Christine Satchell and Paul Dourish. 2009. Beyond the user: use and non-use in HCI. In Proceedings of the 21st Annual Conference of the Australian Computer-Human Interaction Special Interest Group: Design: Open 24/7(OZCHI ’09). ACM, New York, NY, USA, 9–16. https://doi.org/doi.org/10.1145/1738826.1738829",
      "doi": "10.1145/1738826.1738829"
    },
    {
      "text": "Bruce Schneier. 2008. The Future of Ephemeral Conversation. Retrieved September 09, 2019 from https://www.schneier.com/blog/archives/2008/11/the_future_of_e.html.",
      "doi": ""
    },
    {
      "text": "James C. Scott. 1987. Resistance without Protest and without Organization: Peasant Opposition to the Islamic Zakat and the Christian Tithe. Comparative Studies in Society and History 29, 3 (1987), 417–452. https://doi.org/10.1017/S0010417500014663",
      "doi": ""
    },
    {
      "text": "James C. Scott. 1989. Everyday Forms of Resistance. The Copenhagen Journal of Asian Studies 4 (1989), 33–62.",
      "doi": ""
    },
    {
      "text": "Neil Selwyn. 2004. The information aged: A qualitative study of older adults’ use of information and communications technology. Journal of Aging Studies 18, 4 (2004), 369–384. https://doi.org/10.1016/j.jaging.2004.06.008",
      "doi": ""
    },
    {
      "text": "Bryan Semaan, Lauren M. Britton, and Bryan Dosono. 2017. Military Masculinity and the Travails of Transitioning: Disclosure in Social Media. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing(CSCW ’17). 387–403. https://doi.org/10.1145/2998181.2998221",
      "doi": "10.1145/2998181.2998221"
    },
    {
      "text": "Lucy Suchman and Libby Bishop. 2000. Problematizing ’Innovation’ as a Critical Project. Technology Analysis & Strategic Management 12, 3 (2000), 327–333. https://doi.org/10.1080/713698477",
      "doi": ""
    },
    {
      "text": "Tiina Suopajarvi. 2015. Past experiences, current practices and future design. Ethnographic study of aging adults’ everyday ICT practices - And how it could benefit public ubiquitous computing design. Technological Forecasting & Social Change 93 (2015), 112–123. https://doi.org/10.1016/j.techfore.2014.04.006",
      "doi": ""
    },
    {
      "text": "Douglas Thomas. 2002. Hacker Culture. University of Minnesota Press, Minneapolis, MN, USA.",
      "doi": "10.5555/940596"
    },
    {
      "text": "Alexander van Deursen and Ellen Helsper. 2015. A nuanced understanding of Internet use and non-use among the elderly. European Journal of Communication 30, 2 (2015), 171–187. https://doi.org/10.1177/0267323115578059",
      "doi": ""
    },
    {
      "text": "Joan Miquel Verd and Marti Lopez. 2011. The Rewards of a Qualitative Approach to Life-Course Research. The Example of the Effects of Social Protection Policies on Career Paths. Forum: Qualitative Social Research 12, 3 (2011). http://nbn-resolving.de/urn:nbn:de:0114-fqs1103152",
      "doi": ""
    },
    {
      "text": "John Vines, Mark Blythe, Paul Dunphy, and Andrew Monk. 2011. Eighty Something: Banking for the older old. In Proceedings of the 25th BCS Conference on Human-Computer Interaction (Newcastle-upon-Tyne, United Kingdom) (BCS-HCI ’11). BCS Learning & Development Ltd., Swindon, UK, 64–73.",
      "doi": ""
    },
    {
      "text": "John Vines, Mark Blythe, Stephen Lindsay, Paul Dunphy, Andrew Monk, and Patrick Olivier. 2012. Questionable Concepts: Critique as a Resource for Designing with Eighty Somethings. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Austin, Texas, USA) (CHI ’12). ACM, New York, NY, USA, 1169–1178. https://doi.org/10.1145/2207676.2208567",
      "doi": "10.1145/2207676.2208567"
    },
    {
      "text": "John Vines, Gary Pritchard, Peter Wright, Patrick Olivier, and Katie Brittain. 2015. An Age-Old Problem: Examining the Discourses of Ageing in HCI and Strategies for Future Research. ACM Transactions on Computer-Human Interaction (TOCHI) 22, 1(2015). https://doi.org/10.1145/2696867",
      "doi": "10.1145/2696867"
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Lars Kulik, Elizabeth Ozanne, Alan Gruner, and John Downs. 2013. Older Adults as Digital Content Producers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). ACM, New York, NY, USA, 39–48. https://doi.org/10.1145/2470654.2470662",
      "doi": "10.1145/2470654.2470662"
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Amee Morgans, Elizabeth Ozanne, and Lars Kulik. 2016. Not For Me: Older Adults Choosing Not to Participate in a Social Isolation Intervention. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 745–757. https://doi.org/10.1145/2858036.2858458",
      "doi": "10.1145/2858036.2858458"
    },
    {
      "text": "Sally Wyatt. 2005. Non-Users AIso Matter: The Construction of Users and Non-Users of the Internet. In How Users Matter. The Co-Construction of Users and Technology, N. Oudshoornand T. Pinch (Eds.). MIT Press, Cambridge, MA, 67–79.",
      "doi": ""
    }
  ]
}