{
  "doi": "10.1145/3411764.3445316",
  "title": "Keeper: A Synchronous Online Conversation Environment Informed by In-Person Facilitation Practices",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Facilitation, or the craft and use of specific tools, methods, and practices to influence the way groups gather and converse to reach a goal, requires the nuanced craft of a facilitator to guide complex conversations. Online gathering spaces are often designed with neither the facilitator’s knowledge nor the range of tools their methods require, making online facilitation difficult. In this paper, we describe the design and evaluation of Keeper – an online video call extension environment – informed by the widespread, foundational facilitation method of Circle practice. We define three initial facilitator-driven goals of the platform: 1) enable tone setting, 2) ease the practice and smoothness of online conversation, and 3) improve social presence. After a qualitative study with 72 participants, semi-structured interviews with facilitators, and an RCT with 100 participants, we observe improved tone setting and ease of conversation and suggest several ways to further pursue improved online conversation.",
  "authors": [
    {
      "name": "Margaret A. Hughes",
      "institution": "Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659480661",
      "orcid": "missing"
    },
    {
      "name": "Deb Roy",
      "institution": "MIT Media Lab MIT, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100653347",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2020. Circl.es. https://www.circl.es/",
      "doi": ""
    },
    {
      "text": "2020. Depression and Bipolar Support Alliance: Online Support Groups. https://www.dbsalliance.org/support/chapters-and-support-groups/online-support-groups/",
      "doi": ""
    },
    {
      "text": "2020. Designing for purpose in virtual engagements. https://whatisessential.org/resources/designing-purpose-virtual-engagements",
      "doi": ""
    },
    {
      "text": "2020. Designing Online Meetings that Feel (Almost) Real. https://medium.com/agilelab/designing-online-meetings-that-feel-almost-real-b83a8413f2d3",
      "doi": ""
    },
    {
      "text": "2020. Howspace. https://www.howspace.com/",
      "doi": ""
    },
    {
      "text": "2020. Impact Justice. https://impactjustice.org/",
      "doi": ""
    },
    {
      "text": "2020. The Indigenous Origins of Circles and How Non-Natives Learned About Them. http://www.livingjusticepress.org/?SEC=0F6FA816-E094-4B96-8F39-9922F67306E5",
      "doi": ""
    },
    {
      "text": "2020. Let the circle be unbroken: Online restorative circles show social distancing can’t stop connection. https://www.lssnd.org/post/let-the-circle-be-unbroken-online-restorative-circles-show-social-distancing-can-t-stop-connection",
      "doi": ""
    },
    {
      "text": "2020. Living Justice Press. http://www.livingjusticepress.org/",
      "doi": ""
    },
    {
      "text": "2020. Local Voices Network. https://www.lvn.org/",
      "doi": ""
    },
    {
      "text": "2020. Meeting VR Beta. https://www.meetinvr.com/",
      "doi": ""
    },
    {
      "text": "2020. Miro. https://www.miro.com/",
      "doi": ""
    },
    {
      "text": "2020. MIT Behavioral Research Lab. https://brl.mit.edu/",
      "doi": ""
    },
    {
      "text": "2020. Mural. https://www.mural.co/",
      "doi": ""
    },
    {
      "text": "2020. The Online Circle Keeper Tool Kit. https://www.suffolk.edu/-/media/suffolk/documents/cas/centers-institutes/center-for-restorative-justice/circle-keeper-toolkit.pdf?la=en&hash=451C2FF326CD04DB8424A6123381E01958270DA8",
      "doi": ""
    },
    {
      "text": "2020. Restorative Justice for Oakland Youth. http://rjoyoakland.org/",
      "doi": ""
    },
    {
      "text": "2020. Stormz.me. https://stormz.me/en/features",
      "doi": ""
    },
    {
      "text": "2020. Training For Change. https://www.trainingforchange.org/",
      "doi": ""
    },
    {
      "text": "2020. Unity Circles. http://unitycircles.org/",
      "doi": ""
    },
    {
      "text": "Dohyun Ahn, Youngnam Seo, Minkyung Kim, Joung Kwon, Younbo Jung, Jungsun Ahn, and Doohwang Lee. 2014. The Effects of Actual Human Size Display and Stereoscopic Presentation on Users’ Sense of Being Together with and of Psychological Immersion in a Virtual Character. Cyberpsychology, behavior and social networking 17 (03 2014). https://doi.org/10.1089/cyber.2013.0455",
      "doi": ""
    },
    {
      "text": "Neville Alexander. 2002. An ordinary country: Issues in the transition from apartheid to democracy in South Africa. University of Kwazulu Natal Press.",
      "doi": ""
    },
    {
      "text": "Beard F. K. & Walther J. B Anderson, J. F.[n.d.]. Turn-taking and the local management of conversation in a highly simultaneous computer-mediated communication system. Language@Internet 7([n. d.]).",
      "doi": ""
    },
    {
      "text": "Roopa B Ankad, Anita Herur, Shailaja Patil, GV Shashikala, and Surekharani Chinagudi. 2011. Effect of short-term pranayama and meditation on cardiovascular functions in healthy individuals. Heart views: the official journal of the Gulf Heart Association 12, 2(2011), 58.",
      "doi": ""
    },
    {
      "text": "Jana Appel, Astrid von der Pütten, Nicole C Krämer, and Jonathan Gratch. 2012. Does humanity matter? Analyzing the importance of social cues and perceived agency of a computer system for the emergence of social reactions during human-computer interaction. Advances in Human-Computer Interaction 2012 (2012).",
      "doi": ""
    },
    {
      "text": "Gary Bente, Sabine Rüggenberg, Nicole C Krämer, and Felix Eschenburg. 2008. Avatar-mediated networking: Increasing social presence and interpersonal trust in net-based collaborations. Human communication research 34, 2 (2008), 287–318.",
      "doi": ""
    },
    {
      "text": "Jim Blascovich, Andrew Beall, Kimberly Swinth, Crystal Hoyt, and Jeremy Bailenson. 2002. Immersive Virtual Environment Technology as a Methodological Tool for Social Psychology. Psychol. Inq 13 (08 2002).",
      "doi": ""
    },
    {
      "text": "Stéphane Bouchard, François Bernier, Éric Boivin, Brian Morin, and Geneviève Robillard. 2012. Using biofeedback while immersed in a stressful videogame increases the effectiveness of stress management skills in soldiers. PloS one 7, 4 (2012), e36169.",
      "doi": ""
    },
    {
      "text": "Carolyn Boyes-Watson and Kay Pranis. 2015. Circle Forward: Building a Restorative School Community.",
      "doi": ""
    },
    {
      "text": "Richard P Brown and Patricia L Gerbarg. 2005. Sudarshan Kriya Yogic breathing in the treatment of stress, anxiety, and depression: part II—clinical applications and guidelines. Journal of Alternative & Complementary Medicine 11, 4 (2005), 711–717.",
      "doi": ""
    },
    {
      "text": "Dan Calacci, Oren Lederman, David Shrier, and Pentland. 2016. Breakout: An Open Measurement and Intervention Tool for Distributed Peer Learning Group. In In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW ’16).",
      "doi": ""
    },
    {
      "text": "Robert Cavalier, Miso Kim, and Zachary Sam Zaiss. 2009. Deliberative democracy, online discussion, and project PICOLA (Public informed citizen online assembly). Online deliberation: Design, research, and practice/Eds. Davies T., Gangadharan SP Stanford, CA: Center for the study of language and information (2009), 71.",
      "doi": ""
    },
    {
      "text": "Roberts Coates, Mark Umbreit, and Betty Vos. 2003. Restorative justice circles: An exploratory study. Contemporary Justice Review 6, 3 (2003), 265–278. arXiv:https://doi.org/10.1080/1028258032000115985",
      "doi": ""
    },
    {
      "text": "James Cummings and Jeremy Bailenson. 2015. How Immersive Is Enough? A Meta-Analysis of the Effect of Immersive Technology on User Presence. Media Psychology 19 (05 2015), 1–38. https://doi.org/10.1080/15213269.2015.1015740",
      "doi": ""
    },
    {
      "text": "R.H. Daft, R.L.; Lengel. 1986. Organizational information requirements, media richness and structural design. Management Science 32, 5 (1986).",
      "doi": ""
    },
    {
      "text": "Yngve Dahl and Dag Svanæs. 2020. Facilitating Democracy: Concerns from Participatory Design with Asymmetric Stakeholder Relations in Health Care. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376805",
      "doi": "10.1145/3313831.3376805"
    },
    {
      "text": "Charlie DeTar. 2013. Intertwinkles and digital tools for consensus decisionmaking). Ph.D. Dissertation. Advisor(s) Ethan Zuckerman.",
      "doi": ""
    },
    {
      "text": "Judith Donath and Fernanda B. Viégas. 2002. The Chat Circles Series: Explorations in Designing Abstract Graphical Communication Interfaces. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (London, England) (DIS ’02). Association for Computing Machinery, New York, NY, USA, 359–369. https://doi.org/10.1145/778712.778764",
      "doi": "10.1145/778712.778764"
    },
    {
      "text": "M. Donnellan, F. Oswald, B. Baird, and R. Lucas. 2006. The Mini-IPIP Scales: Tiny-yet-Effective Measures of the Big Five Factors of Personality. Psychological Assessment 18 (2006), 192–203. https://doi.org/10.1037/1040-3590.18.2.192",
      "doi": ""
    },
    {
      "text": "Y Earnshaw. 2017. Navigating Turn-Taking and Conversational Repair in an Online Synchronous Course. Online Learning Journa4, Article 21 (2017).",
      "doi": ""
    },
    {
      "text": "Arthur Edwards. 2002. The Moderator As an Emerging Democratic Intermediary: The Role of the Moderator in Internet Discussions About Public Issues. Information Polity 7 (04 2002), 3–20. https://doi.org/10.3233/IP-2002-0002",
      "doi": ""
    },
    {
      "text": "Dmitry Epstein and Gilly Leshed. 2016. The Magic Sauce: Practices of Facilitation in Online Policy Deliberation. Journal of Deliberative Democracy 12 (06 2016), 4. https://doi.org/10.16997/jdd.244",
      "doi": ""
    },
    {
      "text": "W. Fischer. 2018. Local Voices, Better Journalism. (2018). https://medium.com/centerforcooperativemedia/local-voices-better-journalism-b3e1faa0a768",
      "doi": ""
    },
    {
      "text": "Donata Francescato, Rita Porcelli, Minou Mebane, Marcella Cuddetta, Jane Klobas, and Paolo Renzi. 2006. Evaluation of the Efficacy of Collaborative Learning in Face-to-Face and Computer-Supported University Contexts. Comput. Hum. Behav. 22, 2 (March 2006), 163–176. https://doi.org/10.1016/j.chb.2005.03.001",
      "doi": ""
    },
    {
      "text": "Harold Garfinkel. 1967. What is ethnomethodology. Studies in ethnomethodology(1967).",
      "doi": ""
    },
    {
      "text": "Asma Ghandeharioun and Rosalind Picard. 2017. BrightBeat: effortlessly influencing breathing for cultivating calmness and focus. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 1624–1631.",
      "doi": "10.1145/3027063.3053164"
    },
    {
      "text": "Drew Harry and Judith Donath. 2008. Information Spaces – Building Meeting Rooms in Virtual Environments. In CHI ’08 Extended Abstracts on Human Factors in Computing Systems (Florence, Italy) (CHI EA ’08). Association for Computing Machinery, New York, NY, USA, 3741–3746. https://doi.org/10.1145/1358628.1358923",
      "doi": ""
    },
    {
      "text": "Maggie Hughes. 2020. Keeper: Online conversation support scaffolding modeled after ancient and modern social technologies. Master’s thesis. Advisor(s) Deb Roy.",
      "doi": ""
    },
    {
      "text": "Kristina Höök, Anna Ståhl, Martin Jonsson, Johanna Mercurio, Anna Karlsson, and Eva-Carin Johnsson. 2015. Somaesthetic Design. interactions 22 (07 2015). https://doi.org/10.1145/2770888",
      "doi": ""
    },
    {
      "text": "Harri Kaloudis. 2020. A very brief introduction to sociocracy. https://medium.com/@Harri_Kaloudis/a-brief-introduction-to-sociocracy-a0770f220937",
      "doi": ""
    },
    {
      "text": "W. Kandinsky. 1977. Concerning the Spiritual in Art. Dover Publications. https://books.google.com/books?id=mG-VRWgfpuYC",
      "doi": ""
    },
    {
      "text": "Hongki Kim, Kil-Soo Suh, and Un-Kon Lee. 2013. Effects of collaborative online shopping on shopping experience through social and relational perspectives. Information & Management 50, 4 (2013), 169–180.",
      "doi": "10.1016/j.im.2013.02.003"
    },
    {
      "text": "Hinds P. Pentland A. Kim, T.2012. Awareness as an antidote to distance: making distributed groups cooperative and consistent. In In Proceedings of the 2012 ACM conference on Computer supported cooperative work (CSCW ’08).",
      "doi": ""
    },
    {
      "text": "A. Lantz. 201. Meetings in a distributed group of experts: comparing face-to-face, chat and collaborative virtual environments. Behav. Inform. Technol.2, Article 20 (201).",
      "doi": ""
    },
    {
      "text": "B. Lau. 2008. The poetics of sacred light - a comparative study of the luminous environment in the Ronchamp Chapel and the church in the Monastery of La Tourette.(2008).",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Jill T; Hillis Autumn L. Lund, Maggie K; Green. 2019. The Impact of Restorative Justice Practices on Student Achievement, Attendance, and Discipline in a Middle School Setting. Ph.D. Dissertation. Advisor(s) Ethan Zuckerman.",
      "doi": ""
    },
    {
      "text": "Monika Mourya, Aarti Sood Mahajan, Narinder Pal Singh, and Ajay K Jain. 2009. Effect of slow-and fast-breathing exercises on autonomic functions in patients with essential hypertension. The journal of alternative and complementary medicine 15, 7 (2009), 711–717.",
      "doi": ""
    },
    {
      "text": "Matti Nelimarkka. 2019. A Review of Research on Participation in Democratic Decision-Making Presented at SIGCHI Conferences. Toward an Improved Trading Zone Between Political Science and HCI. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 139 (Nov. 2019), 29 pages. https://doi.org/10.1145/3359241",
      "doi": "10.1145/3359241"
    },
    {
      "text": "Matti Nelimarkka, Jean Philippe Rancy, Jennifer Grygiel, and Bryan Semaan. 2019. (Re)Design to Mitigate Political Polarization: Reflecting Habermas’ Ideal Communication Space in the United States of America and Finland. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 141 (Nov. 2019), 25 pages. https://doi.org/10.1145/3359243",
      "doi": "10.1145/3359243"
    },
    {
      "text": "Catherine S. Oh, Jeremy N. Bailenson, and Gregory F. Welch. 2018. A Systematic Review of Social Presence: Definition, Antecedents, and Implications. Frontiers in Robotics and AI 5 (2018), 114. https://doi.org/10.3389/frobt.2018.00114",
      "doi": ""
    },
    {
      "text": "Olson G.M. Meader D.K. Olson, J.S.[n.d.]. What Mix of Video and Audio is Useful for Small Groups Doing Remote Real-Time Design Work?",
      "doi": ""
    },
    {
      "text": "Xueni Pan, Marco Gillies, and Mel Slater. 2008. The impact of avatar blushing on the duration of interaction between a real and virtual person. In Presence 2008: The 11th Annual International Workshop on Presence. 100–106.",
      "doi": ""
    },
    {
      "text": "Taiwoo Park, Uichin Lee, Bupjae Lee, Haechan Lee, Sanghun Son, Seokyoung Song, and Junehwa Song. 2013. ExerSync: Facilitating Interpersonal Synchrony in Social Exergames. In Proceedings of the 2013 Conference on Computer Supported Cooperative Work (San Antonio, Texas, USA) (CSCW ’13). Association for Computing Machinery, New York, NY, USA, 409–422. https://doi.org/10.1145/2441776.2441823",
      "doi": "10.1145/2441776.2441823"
    },
    {
      "text": "P. Parker. 2018. The Art of Gathering: How We Meet and Why It Matters. Penguin LCC US. https://books.google.com/books?id=mo86swEACAAJ",
      "doi": ""
    },
    {
      "text": "Pierre Philippot, Gaëtane Chapelle, and Sylvie Blairy. 2002. Respiratory feedback in the generation of emotion. Cognition and Emotion 16, 5 (2002), 605–627. https://doi.org/10.1080/02699930143000392arXiv:https://doi.org/10.1080/02699930143000392",
      "doi": ""
    },
    {
      "text": "C. Y. Qin, M. Constantinides, L. M. Aiello, and D. Quercia. 2020. HeartBees: Visualizing Crowd Affects. In 2020 IEEE VIS Arts Program (VISAP). 1–8. https://doi.org/10.1109/VISAP51628.2020.00007",
      "doi": ""
    },
    {
      "text": "Roy A. Rodenstein and Judith S. Donath. 2000. Talking in Circles: A Spatially-Grounded Social Environment. In Proceedings of the 2000 ACM Conference on Computer Supported Cooperative Work (Philadelphia, Pennsylvania, USA) (CSCW ’00). Association for Computing Machinery, New York, NY, USA, 349. https://doi.org/10.1145/358916.361977",
      "doi": ""
    },
    {
      "text": "William Bradshaw & David Roseborough. 2005. Restorative Justice Dialogue: The Impact of Mediation and Conferencing on Juvenile Recidivism. Federal Probation 69, 2 (2005). https://heinonline.org/HOL/Page?handle=hein.journals/fedpro69&div=21&g_sent=1&casa_token=4zM4m6WzSxIAAAAA:Oj1LG0-c7jR24LTARuHFOsPwutIZNS9DInMpMFXk9xUsBwz-3fV4F_xC2I1BVeir5nxg&collection=journals#",
      "doi": ""
    },
    {
      "text": "Emanuel A. Schegloff Sacks, Harvey and Gail Jefferson. 1974. A Simplest Systematics for the Organization of Turn-Taking for Conversation. Print. Language4, Article 50 (1974). https://doi.org/10.1145/1057270.1057278",
      "doi": ""
    },
    {
      "text": "Gustanski J. Sanders, M. and M. Lawton. 1974. Effect of ambient illumination on noise level of groups.(1974).",
      "doi": ""
    },
    {
      "text": "T. Schielke. 2013. Light Matters: Louis Kahn and the Power of Shadow.(2013). <http://www.archdaily.com/362554/light-matterslouis-kahn-and-the-power-of-shadow/>",
      "doi": ""
    },
    {
      "text": "Sunaina Soni, Lata N Joshi, and Anjum Datta. 2015. Effect of controlled deep breathing on psychomotor and higher mental functions in normal individuals. Indian J Physiol Pharmacol 59, 1 (2015), 41–47.",
      "doi": ""
    },
    {
      "text": "Maya Soriano. 2020. Witnessing the Unlimited Potential of Children Being Peaceful: Impact of Proactive Restorative Circle Practice on Early Childhood Students in a Montessori Setting. (2020). https://sophia.stkate.edu/maed/356/",
      "doi": ""
    },
    {
      "text": "H. Stuart, Laura Dabbish, Sara Kiesler, Peter Kinnaird, and Ruogu Kang. 2012. Social transparency in networked information exchange: A theoretical framework. Proceedings of the ACM Conference on Computer Supported Cooperative Work, CSCW, 451–460. https://doi.org/10.1145/2145204.2145275",
      "doi": "10.1145/2145204.2145275"
    },
    {
      "text": "Myers J. & Dennen V. Suggs, C.2010. Raise Your Hand If You Wanna Speak: Navigating Turn-taking in a Webex Course. In Proceedings of E-Learn 2010–World Conference on E-Learning in Corporate, Government, Healthcare, and Higher Education (pp. 2212-2219)). Association for the Advancement of Computing in Education, Orlando, Florida, 7.",
      "doi": ""
    },
    {
      "text": "Lindsey Holland Taemie Kim, Agnes Changand Alex Sandy Pentland. 2008. Meeting mediator: enhancing group collaboration using sociometric feedback.. In In Proceedings of the 2008 ACM conference on Computer supported cooperative work (CSCW ’08). AMC, New York, NY. https://doi.org/10.1145/1460563.1460636",
      "doi": ""
    },
    {
      "text": "W. Ben Towne and James D. Herbsleb. 2012. Design Considerations for Online Deliberation Systems. Journal of Information Technology & Politics 9, 1 (2012), 97–115. https://doi.org/10.1080/19331681.2011.637711arXiv:https://doi.org/10.1080/19331681.2011.637711",
      "doi": ""
    },
    {
      "text": "Vos B. Umbreit, M.S. and R.B. Coates. 2006. RESTORATIVE JUSTICE DIALOGUE: Evidence-Based Practice. Center for Restorative Justice & Peacemaking (2006). http://www.antoniocasella.eu/restorative/Umbreit_2006.pdf",
      "doi": ""
    },
    {
      "text": "Joseph B. Walther. 1996. Computer-Mediated Communication: Impersonal, Interpersonal, and Hyperpersonal Interaction. Communication Research 23, 1 (1996), 3–43. https://doi.org/10.1177/009365096023001001",
      "doi": ""
    },
    {
      "text": "Maisha T. Winn. 2018. Justice on Both Sides: Transforming Education Through Restorative Justice (Race and Education). Harvard Education Press, Cambridge.",
      "doi": ""
    }
  ]
}