{
  "doi": "10.1145/3411764.3445226",
  "title": "Exploring Generative Models with Middle School Students",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Applications of generative models such as Generative Adversarial Networks (GANs) have made their way to social media platforms that children frequently interact with. While GANs are associated with ethical implications pertaining to children, such as the generation of Deepfakes, there are negligible efforts to educate middle school children about generative AI. In this work, we present a generative models learning trajectory (LT), educational materials, and interactive activities for young learners with a focus on GANs, creation and application of machine-generated media, and its ethical implications. The activities were deployed in four online workshops with 72 students (grades 5-9). We found that these materials enabled children to gain an understanding of what generative models are, their technical components and potential applications, and benefits and harms, while reflecting on their ethical implications. Learning from our findings, we propose an improved learning trajectory for complex socio-technical systems.",
  "tags": [
    "Artificial Intelligence",
    "Generative Adversarial Networks",
    "AI Education",
    "Generative Machine Learning"
  ],
  "authors": [
    {
      "name": "Safinah Ali",
      "institution": "MIT Media Lab, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659284008",
      "orcid": "missing"
    },
    {
      "name": "Daniella DiPaola",
      "institution": "MIT Media Lab Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659541974",
      "orcid": "missing"
    },
    {
      "name": "Irene Lee",
      "institution": "Scheller Teacher Education Program MIT, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658983632",
      "orcid": "missing"
    },
    {
      "name": "Jenna Hong",
      "institution": "MIT Media Lab Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702158",
      "orcid": "missing"
    },
    {
      "name": "Cynthia Breazeal",
      "institution": "MIT Media Lab Massachusetts Institute of Technology, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100258451",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Deepfake Detection Challenge. https://www.kaggle.com/c/deepfake-detection-challenge",
      "doi": ""
    },
    {
      "text": "2020. Young Teens (12-14 years of age). Center for Disease Control and Prevention(2020). https://www.cdc.gov/ncbddd/childdevelopment/positiveparenting/adolescence.html",
      "doi": ""
    },
    {
      "text": "Safinah Ali, Hae Won Park, and Cynthia Breazeal. 2020. A social robot’s influence on children’s figural creativity during gameplay. International Journal of Child-Computer Interaction (2020), 100234.",
      "doi": ""
    },
    {
      "text": "Safinah Ali, Blakeley H Payne, Randi Williams, Hae Won Park, and Cynthia Breazeal. [n.d.]. Constructionism, Ethics, and Creativity: Developing Primary and Middle School Artificial Intelligence Education.",
      "doi": ""
    },
    {
      "text": "Lorin W Anderson, Benjamin Samuel Bloom, 2001. A taxonomy for learning, teaching, and assessing: A revision of Bloom’s taxonomy of educational objectives. Longman,.",
      "doi": ""
    },
    {
      "text": "Monica Anderson, Jingjing Jiang, 2018. Teens, social media & technology 2018. Pew Research Center 31(2018), 2018.",
      "doi": ""
    },
    {
      "text": "Michael T Battista. 2011. Conceptualizations and issues related to learning progressions, learning trajectories, and levels of sophistication. The Mathematics Enthusiast 8, 3 (2011), 507–570.",
      "doi": ""
    },
    {
      "text": "Tomaz Ribeiro Viana Bisneto, Antonio Oseas de Carvalho Filho, and Deborah Maria Vieira Magalhães. 2020. Generative adversarial network and texture features applied to automatic glaucoma detection. Applied Soft Computing 90 (2020), 106165.",
      "doi": ""
    },
    {
      "text": "Benjamin Samuel Bloom. 1956. Taxonomy of educational objectives: The classification of educational goals. Cognitive domain (1956).",
      "doi": ""
    },
    {
      "text": "Michelle Carney, Barron Webster, Irene Alvarado, Kyle Phillips, Noura Howell, Jordan Griffith, Jonas Jongejan, Amit Pitaru, and Alexander Chen. 2020. Teachable Machine: Approachable Web-Based Tool for Exploring Machine Learning Classification. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": ""
    },
    {
      "text": "Jere Confrey, Alan P Maloney, and Andrew K Corley. 2014. Learning trajectories: A framework for connecting standards with curriculum. ZDM 46, 5 (2014), 719–733.",
      "doi": ""
    },
    {
      "text": "Susanne A Denham, TM Wyatt, Hideko Hamada Bassett, D Echeverria, and SS Knox. 2009. Assessing social-emotional development in children from a longitudinal perspective. Journal of Epidemiology & Community Health 63, Suppl 1 (2009), i37–i52.",
      "doi": ""
    },
    {
      "text": "Carl Doersch. 2016. Tutorial on variational autoencoders. arXiv preprint arXiv:1606.05908(2016).",
      "doi": ""
    },
    {
      "text": "DL Evans, Gary L Gray, Stephen Krause, Jay Martin, Clark Midkiff, Branislav M Notaros, Michael Pavelich, David Rancour, Teri Reed-Rhoads, Paul Steif, 2003. Progress on concept inventory assessment tools. In 33rd Annual Frontiers in Education, 2003. FIE 2003., Vol. 1. IEEE, T4G–1.",
      "doi": ""
    },
    {
      "text": "[15] FaceApp [n.d.].",
      "doi": ""
    },
    {
      "text": "FaceTune [n.d.]. FaceTune. https://www.facetuneapp.com/",
      "doi": ""
    },
    {
      "text": "Diana Franklin, Jen Palmer, Woorin Jang, Elizabeth M Lehman, Jasmine Marckwordt, Randall H Landsberg, Alexandria Muller, and Danielle Harlow. 2020. Exploring Quantum Reversibility with Young Learners. In Proceedings of the 2020 ACM Conference on International Computing Education Research. 147–157.",
      "doi": "10.1145/3372782.3406255"
    },
    {
      "text": "Leon A Gatys, Alexander S Ecker, and Matthias Bethge. 2015. A neural algorithm of artistic style. arXiv preprint arXiv:1508.06576(2015).",
      "doi": ""
    },
    {
      "text": "James Paul Gee. 2003. What video games have to teach us about learning and literacy. Computers in Entertainment (CIE) 1, 1 (2003), 20–20.",
      "doi": "10.1145/950566.950595"
    },
    {
      "text": "James Paul Gee. 2009. Video games, learning, and “content”. In Games: Purpose and potential in education. Springer, 43–53.",
      "doi": ""
    },
    {
      "text": "Ian Goodfellow, Jean Pouget-Abadie, Mehdi Mirza, Bing Xu, David Warde-Farley, Sherjil Ozair, Aaron Courville, and Yoshua Bengio. 2014. Generative adversarial nets. In Advances in neural information processing systems. 2672–2680.",
      "doi": ""
    },
    {
      "text": "Google. 2016. Artists and Machine Learning. https://ami.withgoogle.com/.",
      "doi": ""
    },
    {
      "text": "Google. 2017. Quick, Draw!https://quickdraw.withgoogle.com/.",
      "doi": ""
    },
    {
      "text": "Koeno P Gravemeijer. 1994. Developing realistic Mathematics Education (Ontwikkelen van realistisch reken/wiskundeonderwijs).",
      "doi": ""
    },
    {
      "text": "David Ha and Douglas Eck. 2017. A neural representation of sketch drawings. arXiv preprint arXiv:1704.03477(2017).",
      "doi": ""
    },
    {
      "text": "Ken Kahn and Niall Winters. 2017. Child-friendly programming interfaces to AI cloud services. In European Conference on Technology Enhanced Learning. Springer, 566–570.",
      "doi": ""
    },
    {
      "text": "Neil K. Kaneshiro. 2018. Adolescent development. MedlinePlus (2018). https://medlineplus.gov/ency/article/002003.htm",
      "doi": ""
    },
    {
      "text": "Neil K. Kaneshiro. 2018. School-age children development. MedlinePlus (2018). https://medlineplus.gov/ency/article/002017.htm",
      "doi": ""
    },
    {
      "text": "Tero Karras, Samuli Laine, Miika Aittala, Janne Hellsten, Jaakko Lehtinen, and Timo Aila. 2019. Analyzing and Improving the Image Quality of StyleGAN. arxiv:1912.04958 [cs.CV]",
      "doi": ""
    },
    {
      "text": "Salome Kazeminia, Christoph Baur, Arjan Kuijper, Bram van Ginneken, Nassir Navab, Shadi Albarqouni, and Anirban Mukhopadhyay. 2020. GANs for medical image analysis. Artificial Intelligence in Medicine(2020), 101938.",
      "doi": ""
    },
    {
      "text": "Eric Klopfer, Scot Osterweil, Katie Salen, 2009. Moving learning games forward. Cambridge, MA: The Education Arcade(2009).",
      "doi": ""
    },
    {
      "text": "Lily Kuo. 2018. World’s first AI news anchor unveiled in China. The Guardian 8(2018).",
      "doi": ""
    },
    {
      "text": "MIT Media Lab. 2019. Computer Visions: Generative Machine Learning Tools for Creative Applications. http://visions.media.mit.edu/.",
      "doi": ""
    },
    {
      "text": "Irene Lee, Safinah Ali, Helen Zhang, Daniella DiPaola, and Cynthia Breazeal. 2021. Developing Middle School Students’ AI Literacy. 52nd ACM Technical Symposium on Computer Science Education (SIGCSE ’21) (March 2021). ”In press”.",
      "doi": ""
    },
    {
      "text": "Natasha Lomas. 2020. Deepfake video app Reface is just getting started on shapeshifting selfie culture. https://techcrunch.com/2020/08/17/deepfake-video-app-reface-is-just-getting-started-on-shapeshifting-selfie-culture/?guccounter=1&guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&guce_referrer_sig=AQAAAN1tfqNlH9AaIPEYrK6121tJ7pQV1QMu3prDqVEsaI8DrS67JBiyRNUk 09CUyWaq1hlqQj-XXlvO7gXrwlSMj8H0ACpyfUtJ9kOVsaAK9WeXG4Gpt2d2_Sb9I7o5XfYSStx0CdaVKdcbol0rld_wrTtLom85Eq9M-a6KifbsoE-R",
      "doi": ""
    },
    {
      "text": "Duri Long and Brian Magerko. 2020. What is AI Literacy? Competencies and Design Considerations. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376727"
    },
    {
      "text": "Machine Learning for Artists 2016. Machine Learning for Artists. https://ml4a.github.io/classes/.",
      "doi": ""
    },
    {
      "text": "Yotam Mann. 2016. AI duet. Experiments with Google. See, https://experiments. withgoogle. com/ai/ai-duet (2016).",
      "doi": ""
    },
    {
      "text": "Lívia S Marques, Christiane Gresse von Wangenheim, and Jean CR HAUCK. 2020. Teaching Machine Learning in School: A Systematic Mapping of the State of the Art. Informatics in Education 19, 2 (2020), 283–321.",
      "doi": ""
    },
    {
      "text": "Thanh Thi Nguyen, Cuong M Nguyen, Dung Tien Nguyen, Duc Thanh Nguyen, and Saeid Nahavandi. 2019. Deep learning for deepfakes creation and detection. arXiv preprint arXiv:1909.11573(2019).",
      "doi": ""
    },
    {
      "text": "Aaron van den Oord, Nal Kalchbrenner, and Koray Kavukcuoglu. 2016. Pixel recurrent neural networks. arXiv preprint arXiv:1601.06759(2016).",
      "doi": ""
    },
    {
      "text": "B.H. Payne. 2020. Can my algorithm be my opinion?: An AI + Ethics Curriculum for Middle School Students. Master’s thesis. Massachusetts Institute of Technology, Media Lab, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Prisma [n.d.]. Prisma. prisma-ai.com",
      "doi": ""
    },
    {
      "text": "MIT Architecture Renaud Danhaive. 2019. Creative Machine Learning for Design. https://architecture.mit.edu/subject/spring-2020-4453.",
      "doi": ""
    },
    {
      "text": "Victoria J Rideout and Michael B Robb. 2019. The common sense census: Media use by tweens and teens. Common Sense Media.",
      "doi": ""
    },
    {
      "text": "Julie Sarama, Douglas H Clements, Jeffrey Barrett, Douglas W Van Dine, and Jennifer S McDonel. 2011. Evaluation of a learning trajectory for length in the early years. ZDM 43, 5 (2011), 667.",
      "doi": ""
    },
    {
      "text": "Kevin Schawinski, Ce Zhang, Hantian Zhang, Lucas Fowler, and Gokula Krishnan Santhanam. 2017. Generative adversarial networks recover features in astrophysical images of galaxies beyond the deconvolution limit. Monthly Notices of the Royal Astronomical Society: Letters 467, 1(2017), L110–L114.",
      "doi": ""
    },
    {
      "text": "Martin A Simon. 1995. Reconstructing mathematics pedagogy from a constructivist perspective. Journal for research in mathematics education (1995), 114–145.",
      "doi": ""
    },
    {
      "text": "Shashank Srikant and Varun Aggarwal. 2017. Introducing data science to school kids. In Proceedings of the 2017 ACM SIGCSE Technical Symposium on Computer Science Education. 561–566.",
      "doi": "10.1145/3017680.3017717"
    },
    {
      "text": "John Sweller. 1988. Cognitive load during problem solving: Effects on learning. Cognitive science 12, 2 (1988), 257–285.",
      "doi": ""
    },
    {
      "text": "Kara Swisher. 2019. Does Russia Want More Than Your Old Face?https://www.nytimes.com/2019/07/19/opinion/faceapp-privacy-russian.html",
      "doi": ""
    },
    {
      "text": "Danny Tang 2019. Empowering novices to understand and use machine learning with personalized image classification models, intuitive analysis tools, and MIT App Inventor. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "This Person Does Not Exist 2019. This Person Does Not Exist. https://www.thispersondoesnotexist.com/.",
      "doi": ""
    },
    {
      "text": "Robert Thornberg and Kathy Charmaz. 2014. Grounded theory and theoretical coding. The SAGE handbook of qualitative data analysis 5 (2014), 153–69.",
      "doi": ""
    },
    {
      "text": "TikTok [n.d.]. TikTok. https://tiktok.com",
      "doi": ""
    },
    {
      "text": "David Touretzky, Christina Gardner-McCune, Fred Martin, and Deborah Seehorn. 2019. Envisioning AI for K-12: What should every child know about AI?. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 33. 9795–9799.",
      "doi": "10.1609/aaai.v33i01.33019795"
    },
    {
      "text": "Xiaoyu Wan, Xiaofei Zhou, Zaiqiao Ye, Chase K Mortensen, and Zhen Bai. 2020. SmileyCluster: supporting accessible machine learning in K-12 scientific discovery. In Proceedings of the Interaction Design and Children Conference. 23–35.",
      "doi": "10.1145/3392063.3394440"
    },
    {
      "text": "Langdon Winner. 1980. Do artifacts have politics?Daedalus (1980), 121–136.",
      "doi": ""
    },
    {
      "text": "Zheng Xu, Michael Wilber, Chen Fang, Aaron Hertzmann, and Hailin Jin. 2018. Learning from multi-domain artistic images for arbitrary style transfer. arXiv preprint arXiv:1805.09987(2018).",
      "doi": ""
    }
  ]
}