{
  "doi": "10.1145/3411764.3445560",
  "title": "SpatialProto: Exploring Real-World Motion Captures for Rapid Prototyping of Interactive Mixed Reality",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Spatial computing devices that blend virtual and real worlds have the potential to soon become ubiquitous. Yet, creating experiences for spatial computing is non-trivial and needs skills in programming and 3D content creation, rendering them inaccessible to a wider group of users. We present SpatialProto, an in-situ spatial prototyping system for lowering the barrier to engage in spatial prototyping. With a depth-sensing capable mixed reality headset, SpatialProto lets users record animated objects of the real-world environment (e.g. paper, clay, people, or any other prop), extract only the relevant parts, and directly place and transform these recordings in their physical environment. We describe the design and implementation of SpatialProto, a user study evaluating the system’s prototype with non-expert users (n = 9), and demonstrate applications where multiple captures are fused for compelling augmented reality experiences.",
  "tags": [
    "mixed reality",
    "Spatial prototyping",
    "animation",
    "interaction"
  ],
  "authors": [
    {
      "name": "Leon Müller",
      "institution": "LMU Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701434",
      "orcid": "missing"
    },
    {
      "name": "Ken Pfeuffer",
      "institution": "Bundeswehr University Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549578256",
      "orcid": "0000-0002-5870-1120"
    },
    {
      "name": "Jan Gugenheimer",
      "institution": "Télécom Paris - LTCI Institut and Polytechnique de Paris, Paris, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458801557",
      "orcid": "0000-0002-6466-3845"
    },
    {
      "name": "Bastian Pfleging",
      "institution": "Eindhoven University of Technology, Eindhoven, Netherlands and LMU Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460651934",
      "orcid": "missing"
    },
    {
      "name": "Sarah Prange",
      "institution": "Bundeswehr University Munich, Munich, Germany and LMU Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659232837",
      "orcid": "missing"
    },
    {
      "name": "Florian Alt",
      "institution": "Bundeswehr University Munich, Munich, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    }
  ],
  "references": [
    {
      "text": "Rahul Arora, Rubaiat Habib Kazi, Danny M. Kaufman, Wilmot Li, and Karan Singh. 2019. MagicalHands: Mid-Air Hand Gestures for Animating in VR. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 463–477. https://doi.org/10.1145/3332165.3347942",
      "doi": "10.1145/3332165.3347942"
    },
    {
      "text": "Narges Ashtari, Andrea Bunt, Joanna McGrenere, Michael Nebeling, and Parmit K. Chilana. 2020. Creating Augmented and Virtual Reality Applications: Current Practices, Challenges, and Opportunities. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376722",
      "doi": "10.1145/3313831.3376722"
    },
    {
      "text": "Nora Broy, Stefan Schneegass, Florian Alt, and Albrecht Schmidt. 2014. FrameBox and MirrorBox: Tools and Guidelines to Support Designers in Prototyping Interfaces for 3D Displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 2037–2046. https://doi.org/10.1145/2556288.2557183",
      "doi": "10.1145/2556288.2557183"
    },
    {
      "text": "Yuanzhi Cao, Tianyi Wang, Xun Qian, Pawan S. Rao, Manav Wadhawan, Ke Huo, and Karthik Ramani. 2019. GhostAR: A Time-Space Editor for Embodied Authoring of Human-Robot Collaborative Task with Augmented Reality. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 521–534. https://doi.org/10.1145/3332165.3347902",
      "doi": "10.1145/3332165.3347902"
    },
    {
      "text": "Jiawen Chen, Dennis Bautembach, and Shahram Izadi. 2013. Scalable Real-Time Volumetric Surface Reconstruction. ACM Trans. Graph. 32, 4, Article 113 (July 2013), 16 pages. https://doi.org/10.1145/2461912.2461940",
      "doi": "10.1145/2461912.2461940"
    },
    {
      "text": "Wenzheng Chen, Jun Gao, Huan Ling, Edward Smith, Jaakko Lehtinen, Alec Jacobson, and Sanja Fidler. 2019. Learning to Predict 3D Objects with an Interpolation-based Differentiable Renderer. In Advances In Neural Information Processing Systems. 9609–9619. arxiv:1908.01210 [cs.CV]",
      "doi": ""
    },
    {
      "text": "Epic Games. 2020. Unreal Engine VR Mode, accessed 5 May, 2020. (2020). https://docs.unrealengine.com/en-US/Engine/Editor/VR/index.html",
      "doi": ""
    },
    {
      "text": "Kaiming He, Georgia Gkioxari, Piotr Dollar, and Ross Girshick. 2017. Mask R-CNN. In Proceedings of the IEEE International Conference on Computer Vision (ICCV). IEEE Computer Society, 2980–2988. https://doi.org/10.1109/ICCV.2017.322",
      "doi": ""
    },
    {
      "text": "Robert Held, Ankit Gupta, Brian Curless, and Maneesh Agrawala. 2012. 3D Puppetry: A Kinect-Based Interface for 3D Animation. In Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology (Cambridge, Massachusetts, USA) (UIST ’12). Association for Computing Machinery, New York, NY, USA, 423–434. https://doi.org/10.1145/2380116.2380170",
      "doi": "10.1145/2380116.2380170"
    },
    {
      "text": "Shahram Izadi, David Kim, Otmar Hilliges, David Molyneaux, Richard Newcombe, Pushmeet Kohli, Jamie Shotton, Steve Hodges, Dustin Freeman, Andrew Davison, and Andrew Fitzgibbon. 2011. KinectFusion: Real-Time 3D Reconstruction and Interaction Using a Moving Depth Camera. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 559–568. https://doi.org/10.1145/2047196.2047270",
      "doi": "10.1145/2047196.2047270"
    },
    {
      "text": "Brett Jones, Rajinder Sodhi, Michael Murdock, Ravish Mehra, Hrvoje Benko, Andrew Wilson, Eyal Ofek, Blair MacIntyre, Nikunj Raghuvanshi, and Lior Shapira. 2014. RoomAlive: Magical Experiences Enabled by Scalable, Adaptive Projector-Camera Units. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(Honolulu, Hawaii, USA) (UIST ’14). Association for Computing Machinery, New York, NY, USA, 637–644. https://doi.org/10.1145/2642918.2647383",
      "doi": "10.1145/2642918.2647383"
    },
    {
      "text": "Yuwei Li, Xi Luo, Youyi Zheng, Pengfei Xu, and Hongbo Fu. 2017. SweepCanvas: Sketch-Based 3D Prototyping on an RGB-D Image. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 387–399. https://doi.org/10.1145/3126594.3126611",
      "doi": "10.1145/3126594.3126611"
    },
    {
      "text": "Tsung-Yi Lin, Michael Maire, Serge Belongie, James Hays, Pietro Perona, Deva Ramanan, Piotr Dollár, and C. Lawrence Zitnick. 2014. Microsoft COCO: Common Objects in Context. In Computer Vision – ECCV 2014, David Fleet, Tomas Pajdla, Bernt Schiele, and Tinne Tuytelaars (Eds.). Springer International Publishing, Cham, Germany, 740–755. https://doi.org/10.1007/978-3-319-10602-1_48",
      "doi": ""
    },
    {
      "text": "David Lindlbauer and Andy D. Wilson. 2018. Remixed Reality: Manipulating Space and Time in Augmented Reality. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 129, 13 pages. https://doi.org/10.1145/3173574.3173703",
      "doi": "10.1145/3173574.3173703"
    },
    {
      "text": "Blair MacIntyre, Maribeth Gandy, Steven Dow, and Jay David Bolter. 2004. DART: A Toolkit for Rapid Design Exploration of Augmented Reality Experiences. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology(Santa Fe, NM, USA) (UIST ’04). Association for Computing Machinery, New York, NY, USA, 197–206. https://doi.org/10.1145/1029632.1029669",
      "doi": "10.1145/1029632.1029669"
    },
    {
      "text": "Michael Nebeling, Katy Lewis, Yu-Cheng Chang, Lihan Zhu, Michelle Chung, Piaoyang Wang, and Janet Nebeling. 2020. XRDirector: A Role-Based Collaborative Immersive Authoring System. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376637",
      "doi": "10.1145/3313831.3376637"
    },
    {
      "text": "Michael Nebeling and Katy Madier. 2019. 360proto: Making Interactive Virtual Reality & Augmented Reality Prototypes from Paper. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, Article 596, 13 pages. https://doi.org/10.1145/3290605.3300826",
      "doi": "10.1145/3290605.3300826"
    },
    {
      "text": "Michael Nebeling, Janet Nebeling, Ao Yu, and Rob Rumble. 2018. ProtoAR: Rapid Physical-Digital Prototyping of Mobile Augmented Reality Applications. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). Association for Computing Machinery, New York, NY, USA, Article 353, 12 pages. https://doi.org/10.1145/3173574.3173927",
      "doi": "10.1145/3173574.3173927"
    },
    {
      "text": "M. Nebeling and M. Speicher. 2018. The Trouble with Augmented Reality/Virtual Reality Authoring Tools. In 2018 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). IEEE Computer Society, 333–337. https://doi.org/10.1109/ISMAR-Adjunct.2018.00098",
      "doi": ""
    },
    {
      "text": "Sergio Orts-Escolano, Christoph Rhemann, Sean Fanello, Wayne Chang, Adarsh Kowdle, Yury Degtyarev, David Kim, Philip L. Davidson, Sameh Khamis, Mingsong Dou, Vladimir Tankovich, Charles Loop, Qin Cai, Philip A. Chou, Sarah Mennicken, Julien Valentin, Vivek Pradeep, Shenlong Wang, Sing Bing Kang, Pushmeet Kohli, Yuliya Lutchyn, Cem Keskin, and Shahram Izadi. 2016. Holoportation: Virtual 3D Teleportation in Real-Time. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology (Tokyo, Japan) (UIST ’16). Association for Computing Machinery, New York, NY, USA, 741–754. https://doi.org/10.1145/2984511.2984517",
      "doi": "10.1145/2984511.2984517"
    },
    {
      "text": "Adalberto L. Simeone, Eduardo Velloso, and Hans Gellersen. 2015. Substitutional Reality: Using the Physical Environment to Design Virtual Reality Experiences. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 3307–3316. https://doi.org/10.1145/2702123.2702389",
      "doi": "10.1145/2702123.2702389"
    },
    {
      "text": "Kihoon Son, Hwiwon Chun, Sojin Park, and Kyung Hoon Hyun. 2020. C-Space: An Interactive Prototyping Platform for Collaborative Spatial Design Exploration. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376452",
      "doi": "10.1145/3313831.3376452"
    },
    {
      "text": "Richard Stoakley, Matthew J. Conway, and Randy Pausch. 1995. Virtual Reality on a WIM: Interactive Worlds in Miniature. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’95). ACM Press/Addison-Wesley Publishing Co., USA, 265–272. https://doi.org/10.1145/223904.223938",
      "doi": "10.1145/223904.223938"
    },
    {
      "text": "Unity Technologies. last accessed: 12/01/20. Unity MARS. https://unity.com/products/unity-mars",
      "doi": ""
    },
    {
      "text": "Jackie (Junrui) Yang, Christian Holz, Eyal Ofek, and Andrew D. Wilson. 2019. DreamWalker: Substituting Real-World Walking Experiences with a Virtual Reality. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 1093–1107. https://doi.org/10.1145/3332165.3347875",
      "doi": "10.1145/3332165.3347875"
    },
    {
      "text": "Ya-Ting Yue, Yong-Liang Yang, Gang Ren, and Wenping Wang. 2017. SceneCtrl: Mixed Reality Enhancement via Efficient Scene Editing. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 427–436. https://doi.org/10.1145/3126594.3126601",
      "doi": "10.1145/3126594.3126601"
    }
  ]
}