{
  "doi": "10.1145/3411764.3445308",
  "title": "Soliciting Stakeholders’ Fairness Notions in Child Maltreatment Predictive Systems",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [],
  "abstract": "Recent work in fair machine learning has proposed dozens of technical definitions of algorithmic fairness and methods for enforcing these definitions. However, we still lack an understanding of how to develop machine learning systems with fairness criteria that reflect relevant stakeholders’ nuanced viewpoints in real-world contexts. To address this gap, we propose a framework for eliciting stakeholders’ subjective fairness notions. Combining a user interface that allows stakeholders to examine the data and the algorithm’s predictions with an interview protocol to probe stakeholders’ thoughts while they are interacting with the interface, we can identify stakeholders’ fairness beliefs and principles. We conduct a user study to evaluate our framework in the setting of a child maltreatment predictive system. Our evaluations show that the framework allows stakeholders to comprehensively convey their fairness viewpoints. We also discuss how our results can inform the design of predictive systems.",
  "authors": [
    {
      "name": "Hao-Fei Cheng",
      "institution": "GroupLens Research University of Minnesota, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659156442",
      "orcid": "missing"
    },
    {
      "name": "Logan Stapleton",
      "institution": "University of Minnesota, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700796",
      "orcid": "missing"
    },
    {
      "name": "Ruiqi Wang",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700990",
      "orcid": "missing"
    },
    {
      "name": "Paige Bullock",
      "institution": "Kenyon College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702165",
      "orcid": "missing"
    },
    {
      "name": "Alexandra Chouldechova",
      "institution": "Heinz College Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81553917956",
      "orcid": "0000-0002-2337-9610"
    },
    {
      "name": "Zhiwei Steven Steven Wu",
      "institution": "Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "89758804757",
      "orcid": "missing"
    },
    {
      "name": "Haiyi Zhu",
      "institution": "Human Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81484646857/rel-imgonly/headshot.png",
      "acmid": "81484646857",
      "orcid": "0000-0001-7271-9100"
    }
  ],
  "references": [
    {
      "text": "Alekh Agarwal, Alina Beygelzimer, Miroslav Dudík, John Langford, and Hanna M. Wallach. 2018. A Reductions Approach to Fair Classification. In Proceedings of the 35th International Conference on Machine Learning, ICML 2018, Stockholmsmässan, Stockholm, Sweden, July 10-15, 2018. 60–69. http://proceedings.mlr.press/v80/agarwal18a.html",
      "doi": ""
    },
    {
      "text": "Alekh Agarwal, Miroslav Dudík, and Zhiwei Steven Wu. 2019. Fair Regression: Quantitative Definitions and Reduction-Based Algorithms. In Proceedings of the 36th International Conference on Machine Learning, ICML 2019, 9-15 June 2019, Long Beach, California, USA. 120–129. http://proceedings.mlr.press/v97/agarwal19d.html",
      "doi": ""
    },
    {
      "text": "Yongsu Ahn and Yu-Ru Lin. 2019. Fairsight: Visual analytics for fairness in decision making. IEEE transactions on visualization and computer graphics 26, 1(2019), 1086–1095.",
      "doi": ""
    },
    {
      "text": "E. P. Apfelbaum, K. Pauker, S. R. Sommers, and N. Ambady. 2010. In blind pursuit of racial equality?Psychological Science 21(2010), 1587—1592. https://doi.org/10.1177/0956797610384741",
      "doi": ""
    },
    {
      "text": "Edmond Awad, Sohan Dsouza, Richard Kim, Jonathan Schulz, Joseph Henrich, Azim Shariff, Jean-François Bonnefon, and Iyad Rahwan. 2018. The Moral Machine experiment. Nature (2018), 59–64. Issue 563. https://doi.org/10.1038/s41586-018-0637-6",
      "doi": ""
    },
    {
      "text": "Caroline Balagot, Hector Lemus, Megan Hartrick, Tamera Kohler, and Suzanne P Lindsay. 2019. The homeless Coordinated Entry System: the VI-SPDAT and other predictors of establishing eligibility for services for single homeless adults. Journal of Social Distress and the Homeless 28, 2 (2019), 149–157.",
      "doi": ""
    },
    {
      "text": "Geoffrey Barnes and Jordan M Hyatt. 2012. Classifying adult probationers by forecasting future offending. (2012).",
      "doi": ""
    },
    {
      "text": "Yahav Bechavod, Christopher Jung, and Zhiwei Steven Wu. 2020. Metric-Free Individual Fairness in Online Learning. CoRR abs/2002.05474(2020). https://arxiv.org/abs/2002.05474",
      "doi": ""
    },
    {
      "text": "Rachel KE Bellamy, Kuntal Dey, Michael Hind, Samuel C Hoffman, Stephanie Houde, Kalapriya Kannan, Pranay Lohia, Jacquelyn Martino, Sameep Mehta, A Mojsilović, 2019. AI Fairness 360: An extensible toolkit for detecting and mitigating algorithmic bias. IBM Journal of Research and Development 63, 4/5 (2019), 4–1.",
      "doi": ""
    },
    {
      "text": "Reuben Binns, Max Van Kleek, Michael Veale, Ulrik Lyngs, Jun Zhao, and Nigel Shadbolt. 2018. ’It’s Reducing a Human Being to a Percentage’: Perceptions of Justice in Algorithmic Decisions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 377.",
      "doi": "10.1145/3173574.3173951"
    },
    {
      "text": "Anna Brown, Alexandra Chouldechova, Emily Putnam-Hornstein, Andrew Tobin, and Rhema Vaithianathan. 2019. Toward Algorithmic Accountability in Public Services: A Qualitative Study of Affected Community Perspectives on Algorithmic Decision-making in Child Welfare Services. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019. 41. https://doi.org/10.1145/3290605.3300271",
      "doi": "10.1145/3290605.3300271"
    },
    {
      "text": "Ernest W. Burgess. 1928. Factors determining success or failure on parole. In The workings of the indeterminate-sentence law and parole system in Illinois, A. A. Bruce, A. J. Harno, E. W. Burgess, and J. Landesco(Eds.). Springfield, IL: State Board of Parole, 221–234.",
      "doi": ""
    },
    {
      "text": "Ángel Alexander Cabrera, Will Epperson, Fred Hohman, Minsuk Kahng, Jamie Morgenstern, and Duen Horng Chau. 2019. FairVis: Visual analytics for discovering intersectional bias in machine learning. In 2019 IEEE Conference on Visual Analytics Science and Technology (VAST). IEEE, 46–56.",
      "doi": ""
    },
    {
      "text": "Rich Caruana, Yin Lou, Johannes Gehrke, Paul Koch, Marc Sturm, and Noemie Elhadad. 2015. Intelligible models for healthcare: Predicting pneumonia risk and hospital 30-day readmission. In Proceedings of the 21th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining. ACM, 1721–1730.",
      "doi": "10.1145/2783258.2788613"
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. sage.",
      "doi": ""
    },
    {
      "text": "Alexandra Chouldechova. 2017. Fair prediction with disparate impact: A study of bias in recidivism prediction instruments. Big data 5, 2 (2017), 153–163.",
      "doi": ""
    },
    {
      "text": "Sam Corbett-Davies and Sharad Goel. 2018. The Measure and Mismeasure of Fairness: A Critical Review of Fair Machine Learning. CoRR abs/1808.00023(2018). http://arxiv.org/abs/1808.00023",
      "doi": ""
    },
    {
      "text": "Maria De-Arteaga, Riccardo Fogliato, and Alexandra Chouldechova. 2020. A Case for Humans-in-the-Loop: Decisions in the Presence of Erroneous Algorithmic Scores. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3313831.3376638"
    },
    {
      "text": "Sarah Dean, Mihaela Curmei, and Benjamin Recht. 2020. Designing Recommender Systems with Reachability in Mind. Workshop on Participatory Approaches to Machine Learning (2020), –.",
      "doi": ""
    },
    {
      "text": "Matthew DeMichele, Peter Baumgartner, Michael Wenger, Kelle Barrick, Megan Comfort, and Shilpi Misra. 2018. The public safety assessment: A re-validation and assessment of predictive utility and differential prediction by race and gender in kentucky. Available at SSRN 3168452(2018).",
      "doi": ""
    },
    {
      "text": "Sarah L Desmarais, Samantha A Zottola, Sarah E Duhart Clarke, and Evan M Lowder. 2020. Predictive Validity of Pretrial Risk Assessments: A Systematic Review of the Literature. Criminal Justice and Behavior(2020), 0093854820932959.",
      "doi": ""
    },
    {
      "text": "Alan J Dettlaff. 2014. The evolving understanding of disproportionality and disparities in child welfare. In Handbook of child maltreatment. Springer, 149–168.",
      "doi": ""
    },
    {
      "text": "Jonathan Dodge, Q. Vera Liao, Yunfeng Zhang, Rachel K. E. Bellamy, and Casey Dugan. 2019. Explaining Models: An Empirical Study of How Explanations Impact Fairness Judgment. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). ACM, New York, NY, USA, 275–285. https://doi.org/10.1145/3301275.3302310",
      "doi": "10.1145/3301275.3302310"
    },
    {
      "text": "Cynthia Dwork, Moritz Hardt, Toniann Pitassi, Omer Reingold, and Richard S. Zemel. 2012. Fairness through awareness. In Innovations in Theoretical Computer Science 2012, Cambridge, MA, USA, January 8-10, 2012. 214–226. https://doi.org/10.1145/2090236.2090255",
      "doi": "10.1145/2090236.2090255"
    },
    {
      "text": "Virginia Eubanks. 2018. Automating inequality: How high-tech tools profile, police, and punish the poor. St. Martin’s Press.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Sorelle A Friedler, Carlos Scheidegger, and Suresh Venkatasubramanian. 2016. On the (im) possibility of fairness. (2016). arxiv:1609.07236",
      "doi": ""
    },
    {
      "text": "Jeremy D Goldhaber-Fiebert and Lea Prince. 2019. Impact Evaluation of a Predictive Risk Modeling Tool for Allegheny County’s Child Welfare Office. Pittsburgh: Allegheny County(2019).",
      "doi": ""
    },
    {
      "text": "Nina Grgic-Hlaca, Elissa M. Redmiles, Krishna P. Gummadi, and Adrian Weller. 2018. Human Perceptions of Fairness in Algorithmic Decision Making: A Case Study of Criminal Risk Prediction. In Proceedings of the 2018 World Wide Web Conference(Lyon, France) (WWW ’18). International World Wide Web Conferences Steering Committee, 903–912. https://doi.org/10.1145/3178876.3186138",
      "doi": "10.1145/3178876.3186138"
    },
    {
      "text": "Nina Grgić-Hlača, Muhammad Bilal Zafar, Krishna P. Gummadi, and Adrian Weller. 2018. Beyond distributive fairness in algorithmic decision making: Feature selection for procedurally fair learning. In Proceedings of the 32nd AAAI Conference on Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Moritz Hardt, Eric Price, and Nati Srebro. 2016. Equality of Opportunity in Supervised Learning. In Advances in Neural Information Processing Systems 29: Annual Conference on Neural Information Processing Systems 2016, December 5-10, 2016, Barcelona, Spain. 3315–3323. http://papers.nips.cc/paper/6374-equality-of-opportunity-in-supervised-learning",
      "doi": "10.5555/3157382.3157469"
    },
    {
      "text": "Úrsula Hébert-Johnson, Michael P. Kim, Omer Reingold, and Guy N. Rothblum. 2018. Multicalibration: Calibration for the (Computationally-Identifiable) Masses. In Proceedings of the 35th International Conference on Machine Learning, ICML 2018, Stockholmsmässan, Stockholm, Sweden, July 10-15, 2018. 1944–1953. http://proceedings.mlr.press/v80/hebert-johnson18a.html",
      "doi": ""
    },
    {
      "text": "Kenneth Holstein, Jennifer Wortman Vaughan, Hal Daumé III, Miroslav Dudík, and Hanna M. Wallach. 2019. Improving Fairness in Machine Learning Systems: What Do Industry Practitioners Need?. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, CHI 2019, Glasgow, Scotland, UK, May 04-09, 2019. 600. https://doi.org/10.1145/3290605.3300830",
      "doi": "10.1145/3290605.3300830"
    },
    {
      "text": "Christina Ilvento. 2020. Metric Learning for Individual Fairness. In 1st Symposium on Foundations of Responsible Computing, FORC 2020, June 1-3, 2020, Harvard University, Cambridge, MA, USA (virtual conference)(LIPIcs, Vol. 156), Aaron Roth(Ed.). Schloss Dagstuhl - Leibniz-Zentrum für Informatik, 2:1–2:11. https://doi.org/10.4230/LIPIcs.FORC.2020.2",
      "doi": ""
    },
    {
      "text": "Abby Everett Jaques. 2019. Why the Moral Machine Is a Monster. In University of Miami Law School: We Robot Conference. https://robots.law.miami.edu/2019/wp-content/uploads/2019/03/MoralMachineMonster.pdf",
      "doi": ""
    },
    {
      "text": "Will Johnson. 2004. Effectiveness of California’s child welfare structured decision making (SDM) model: a prospective study of the validity of the California Family Risk Assessment. Madison (Wisconsin, USA): Children’s Research Center (2004).",
      "doi": ""
    },
    {
      "text": "Caroline M Johnston, Simon Blessenohl, and Phebe Vayanos. [n.d.]. Preference Elicitation and Aggregation to Aid with Patient Triage during the COVID-19 Pandemic. Workshop on Participatory Approaches to Machine Learning ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Matthew Joseph, Michael J. Kearns, Jamie H. Morgenstern, and Aaron Roth. 2016. Fairness in Learning: Classic and Contextual Bandits. In Advances in Neural Information Processing Systems 29: Annual Conference on Neural Information Processing Systems 2016, December 5-10, 2016, Barcelona, Spain. 325–333. http://papers.nips.cc/paper/6355-fairness-in-learning-classic-and-contextual-bandits",
      "doi": ""
    },
    {
      "text": "Christopher Jung, Michael J. Kearns, Seth Neel, Aaron Roth, Logan Stapleton, and Zhiwei Steven Wu. 2021. An Algorithmic Framework for Fairness Elicitation. In Foundations of Responsible Computing (FORC). http://arxiv.org/abs/1905.10660",
      "doi": ""
    },
    {
      "text": "Anson Kahng, Min Kyung Lee, Ritesh Noothigattu, Ariel D. Procaccia, and Christos-Alexandros Psomas. 2019. Statistical Foundations of Virtual Democracy. In Proceedings of the 36th International Conference on Machine Learning, ICML 2019, 9-15 June 2019, Long Beach, California, USA. 3173–3182. http://proceedings.mlr.press/v97/kahng19a.html",
      "doi": ""
    },
    {
      "text": "Faisal Kamiran and Toon Calders. 2012. Data preprocessing techniques for classification without discrimination. Knowledge and Information Systems 33, 1 (2012), 1–33.",
      "doi": "10.1007/s10115-011-0463-8"
    },
    {
      "text": "Michael J. Kearns, Seth Neel, Aaron Roth, and Zhiwei Steven Wu. 2018. Preventing Fairness Gerrymandering: Auditing and Learning for Subgroup Fairness. In Proceedings of the 35th International Conference on Machine Learning, ICML 2018, Stockholmsmässan, Stockholm, Sweden, July 10-15, 2018. 2569–2577. http://proceedings.mlr.press/v80/kearns18a.html",
      "doi": ""
    },
    {
      "text": "Danielle Leah Kehl and Samuel Ari Kessler. 2017. Algorithms in the criminal justice system: Assessing the use of risk assessments in sentencing. (2017).",
      "doi": ""
    },
    {
      "text": "Amir E Khandani, Adlar J Kim, and Andrew W Lo. 2010. Consumer credit-risk models via machine-learning algorithms. Journal of Banking & Finance 34, 11 (2010), 2767–2787.",
      "doi": ""
    },
    {
      "text": "Jon Kleinberg, Himabindu Lakkaraju, Jure Leskovec, Jens Ludwig, and Sendhil Mullainathan. 2017. Human decisions and machine predictions. The quarterly journal of economics 133, 1 (2017), 237–293.",
      "doi": ""
    },
    {
      "text": "Jon M. Kleinberg, Sendhil Mullainathan, and Manish Raghavan. 2017. Inherent Trade-Offs in the Fair Determination of Risk Scores. In 8th Innovations in Theoretical Computer Science Conference, ITCS.",
      "doi": ""
    },
    {
      "text": "Felicitas Kraemer, Kees van Overveld, and Martin Peterson. 2011. Is there an ethics of algorithms?Ethics and Information Technology 13 (2011), 251––260.",
      "doi": ""
    },
    {
      "text": "Vivian Lai and Chenhao Tan. 2019. On human predictions with explanations and predictions of machine learning models: A case study on deception detection. In Proceedings of the Conference on Fairness, Accountability, and Transparency. 29–38.",
      "doi": "10.1145/3287560.3287590"
    },
    {
      "text": "Min Kyung Lee. 2018. Understanding perception of algorithmic decisions: Fairness, trust, and emotion in response to algorithmic management. Big Data & Society 5, 1 (2018), 2053951718756684.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee and Su Baykal. 2017. Algorithmic mediation in group decisions: Fairness perceptions of algorithmically mediated vs. discussion-based social division. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. ACM, 1035–1048.",
      "doi": "10.1145/2998181.2998230"
    },
    {
      "text": "Min Kyung Lee, Anuraag Jain, Hea Jin Cha, Shashank Ojha, and Daniel Kusbit. 2019. Procedural justice in algorithmic fairness: Leveraging transparency and outcome control for fair algorithmic mediation. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–26.",
      "doi": "10.1145/3359284"
    },
    {
      "text": "Min Kyung Lee, Ji Tae Kim, and Leah Lizarondo. 2017. A human-centered approach to algorithmic services: Considerations for fair and motivating smart community service management that allocates donations to non-profit organizations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 3365–3376.",
      "doi": "10.1145/3025453.3025884"
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Anson Kahng, Ji Seong Tae, Xinran Yuan, A. D. C. Chan, Ritesh Noothigattu, Daniel See, Siheon Lee, Christos-Alexandros Psomas, and Ariel D. Procaccia. 2018. WeBuildAI : Participatory Framework for Fair and Efficient Algorithmic Governance. In CSCW.",
      "doi": ""
    },
    {
      "text": "David B Marshall and Diana J English. 2000. Neural network modeling of risk assessment in child protective services.Psychological Methods 5, 1 (2000), 102.",
      "doi": ""
    },
    {
      "text": "John Monahan. 2017. Risk assessment in sentencing. Academy for Justice, a Report on Scholarship and Criminal Justice Reform (Erik Luna ed., 2017, Forthcoming)(2017).",
      "doi": ""
    },
    {
      "text": "John Monahan, Anne Metz, and Brandon L Garrett. 2018. Judicial Appraisals of Risk Assessment in Sentencing. (2018).",
      "doi": ""
    },
    {
      "text": "Arvind Narayanan. 2018. Translation tutorial: 21 fairness definitions and their politics. In Proc. Conf. Fairness Accountability Transp., New York, USA.",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1994. Usability engineering. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Dino Pedreshi, Salvatore Ruggieri, and Franco Turini. 2008. Discrimination-aware data mining. In Proceedings of the 14th ACM SIGKDD international conference on knowledge discovery and data mining. ACM, 560—568.",
      "doi": "10.1145/1401890.1401959"
    },
    {
      "text": "Geoff Pleiss, Manish Raghavan, Felix Wu, Jon M. Kleinberg, and Kilian Q. Weinberger. 2017. On Fairness and Calibration. In Advances in Neural Information Processing Systems 30: Annual Conference on Neural Information Processing Systems 2017, 4-9 December 2017, Long Beach, CA, USA. 5684–5693. http://papers.nips.cc/paper/7151-on-fairness-and-calibration",
      "doi": ""
    },
    {
      "text": "Edmond Awad Sohan Dsouza Iyad Rahwan Pradeep Ravikumar Ritesh Noothigattu, Snehalkumar ‘Neil’ S. Gaikwadand Ariel D. Procaccia.2018. A voting-based system for ethical decision making. In Proceedings of the 32nd AAAI Conference on Artificial Intelligence (AAAI).",
      "doi": ""
    },
    {
      "text": "Samantha Robertson and Niloufar Salehi. 2020. What If I Don’t Like Any Of The Choices? The Limits of Preference Elicitation for Participatory Algorithm Design. (2020). arxiv:2007.06718",
      "doi": ""
    },
    {
      "text": "Debjani Saha, Candice Schumann, Duncan C. McElfresh, John P. Dickerson, Michelle L. Mazurek, and Michael Carl Tschantz. 2020. Measuring Non-Expert Comprehension of Machine Learning Fairness Metrics. In Proceedings of the 37th International Conference on Machine Learning, ICML 2020, Vienna, Austria, July 12–18, 2020.",
      "doi": ""
    },
    {
      "text": "Nripsuta Ani Saxena, Karen Huang, Evan DeFilippis, Goran Radanovic, David C. Parkes, and Yang Liu. 2019. How Do Fairness Definitions Fare?: Examining Public Attitudes Towards Algorithmic Definitions of Fairness. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society. ACM, 99—106.",
      "doi": "10.1145/3306618.3314248"
    },
    {
      "text": "Nicholas Scurich and John Monahan. 2016. Evidence-based sentencing: Public openness and opposition to using gender, age, and race as risk factors for recidivism.Law and Human Behavior 40, 1 (2016), 36.",
      "doi": ""
    },
    {
      "text": "Hetan Shah. 2018. Algorithmic accountability. Philosophical Transactions of the Royal Society A: Mathematical, Physical and Engineering Sciences 376, 2128 (2018), 20170362.",
      "doi": ""
    },
    {
      "text": "Vernon C Smith, Adam Lange, and Daniel R Huston. 2012. Predictive modeling to forecast student outcomes and drive effective interventions in online community college courses.Journal of Asynchronous Learning Networks 16, 3 (2012), 51–61.",
      "doi": ""
    },
    {
      "text": "Megha Srivastava, Hoda Heidari, and Andreas Krause. 2019. Mathematical notions vs. human perception of fairness: A descriptive approach to fairness for machine learning. In Proceedings of the 25th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. 2459–2468.",
      "doi": "10.1145/3292500.3330664"
    },
    {
      "text": "Rhema Vaithianathan, Nan Jiang, Tim Maloney, Parma Nand, and Emily Putnam-Hornstein. 2017. Developing Predictive Risk Models to Support Child Maltreatment Hotline Screening Decisions. https://www.alleghenycountyanalytics.us/wp-content/uploads/2017/04/Developing-Predictive-Risk-Models-package-with-cover-1-to-post-1.pdf",
      "doi": ""
    },
    {
      "text": "Michael Veale, Max Van Kleek, and Reuben Binns. 2018. Fairness and accountability design needs for algorithmic support in high-stakes public sector decision-making. In Proceedings of the 2018 chi conference on human factors in computing systems. 1–14.",
      "doi": "10.1145/3173574.3174014"
    },
    {
      "text": "Sahil Verma and Julia Rubin. 2018. Fairness definitions explained. In 2018 IEEE/ACM International Workshop on Software Fairness (FairWare). IEEE, 1–7.",
      "doi": "10.1145/3194770.3194776"
    },
    {
      "text": "AJ Wang. 2018. Procedural Justice and Risk-Assessment Algorithms. (2018).",
      "doi": ""
    },
    {
      "text": "Jiaxuan Wang, Jeeheh Oh, Haozhu Wang, and Jenna Wiens. 2018. Learning credible models. In Proceedings of the 24th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining. 2417–2426.",
      "doi": "10.1145/3219819.3220070"
    },
    {
      "text": "Ruotong Wang, F Maxwell Harper, and Haiyi Zhu. 2020. Factors Influencing Perceived Fairness in Algorithmic Decision-Making: Algorithm Outcomes, Development Procedures, and Individual Differences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376813"
    },
    {
      "text": "James Wexler, Mahima Pushkarna, Tolga Bolukbasi, Martin Wattenberg, Fernanda Viégas, and Jimbo Wilson. 2019. The what-if tool: Interactive probing of machine learning models. IEEE transactions on visualization and computer graphics 26, 1(2019), 56–65.",
      "doi": ""
    },
    {
      "text": "Meredith Whittaker, Kate Crawford, Roel Dobbe, Genevieve Fried, Elizabeth Kaziunas, Varoon Mathur, Sarah Mysers West, Rashida Richardson, Jason Schultz, and Oscar Schwartz. 2018. AI now report 2018. AI Now Institute at New York University.",
      "doi": ""
    },
    {
      "text": "Pak-Hang Wong. 2020. Democratizing Algorithmic Fairness. Philosophy & Technology 33 (2020), 225–244. https://doi.org/10.1145/3290605.3300830",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Sarah E Fox, Steven Rousso-Schindler, and Jeffrey Warshaw. 2018. A qualitative exploration of perceptions of algorithmic fairness. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 656.",
      "doi": "10.1145/3173574.3174230"
    },
    {
      "text": "Bowen Yu, Ye Yuan, Loren Terveen, Zhiwei Steven Wu, Jodi Forlizzi, and Haiyi Zhu. 2020. Keeping Designers in the Loop: Communicating Inherent Algorithmic Trade-offs Across Multiple Objectives. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 1245–1257.",
      "doi": "10.1145/3357236.3395528"
    },
    {
      "text": "Muhammad Bilal Zafar, Isabel Valera, Manuel Gomez-Rodriguez, and Krishna P. Gummadi. 2017. Fairness Beyond Disparate Treatment & Disparate Impact: Learning Classification without Disparate Mistreatment. In Proceedings of the 26th International Conference on World Wide Web, WWW. ACM, 1171–1180.",
      "doi": "10.1145/3038912.3052660"
    },
    {
      "text": "Haiyi Zhu, Bowen Yu, Aaron Halfaker, and Loren Terveen. 2018. Value-sensitive algorithm design: Method, case study, and lessons. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 194.",
      "doi": "10.1145/3274463"
    }
  ]
}