{
  "doi": "10.1145/3411764.3445132",
  "title": "Caring for Intimate Data in Fertility Technologies",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-11",
  "year": 2021,
  "badges": [],
  "abstract": "Fertility tracking applications are technologies that collect sensitive information about their users i.e. reproductive potential. For many, these apps are an affordable solution when trying to conceive or managing their pregnancy. However, intimate data are not only collected but also shared beyond users knowledge or consent. In this paper, we explore the privacy risks that can originate from the mismanagement, misuse, and misappropriation of intimate data, which are entwined in individual life events and in public health issues such as abortion and (in)fertility. We look at differential vulnerabilities to enquire data’s vulnerability and that of ‘data subjects’. We introduce the General Data Protection Regulation (GDPR) and how it addresses fertility data. We evaluate the privacy of 30 top ‘fertility apps’ through their privacy notices and tracking practices. Lastly, we discuss the regulations and fertility data as critical to the future design of tracking technologies and privacy rights.",
  "authors": [
    {
      "name": "Maryam Mehrnezhad",
      "institution": "School of Computing, Newcastle University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702519",
      "orcid": "missing"
    },
    {
      "name": "Teresa Almeida",
      "institution": "Department of Informatics, Umeå University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414620227",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2019. Exodus-Privacy. github.com/Exodus-Privacy(2019).",
      "doi": ""
    },
    {
      "text": "Maternity Action. 2019. Discrimination during maternity leave and on return to work. (2019). https://maternityaction.org.uk/advice/discrimination-during-maternity-leave-and-on-return-to-work/",
      "doi": ""
    },
    {
      "text": "Rajindra Adhikari, Deborah Richards, and Karen Scott. 2014. Security and privacy issues related to the use of mobile health apps. ACIS.",
      "doi": ""
    },
    {
      "text": "Teresa Almeida, Madeline Balaam, and Rob Comber. 2020. Woman-Centered Design through Humanity, Activism, and Inclusion. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 27 (Sept. 2020), 30 pages. https://doi.org/10.1145/3397176",
      "doi": "10.1145/3397176"
    },
    {
      "text": "Priscilla Alvarez. 2019. House Judiciary Committee asks former ORR director to clarify testimony on pregnant minors. CNN (2019). https://edition.cnn.com/2019/03/22/politics/scott-lloyd-pregnant-minors/index.html",
      "doi": ""
    },
    {
      "text": "World Bank. 2019. Fertility rate, total (births per woman). (2019). https://data.worldbank.org/indicator/SP.DYN.TFRT.IN?end=2018&start=2014",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Mandy Behbehani. 2019. Tech boom in fertility apps aids women struggling to get pregnant. San Francisco Chronicle(2019). https://www.sfchronicle.com/style/article/Tech-boom-in-fertility-apps-aids-women-struggling-14261714.php",
      "doi": ""
    },
    {
      "text": "Jerry Beilinson. 2016. Glow Pregnancy App Exposed Women to Privacy Threats, Consumer Reports Finds. Consumer Reports at consumerreports.org/mobile-security-software/glow-pregnancy-app-exposed-women-to-privacy-threats/(2016).",
      "doi": ""
    },
    {
      "text": "Linda Rae Bennett. 2016. Infertility and inequity across the globe. (May 2016). https://doi.org/10.1080/17441730.2016.1176805",
      "doi": ""
    },
    {
      "text": "European Commission. Accessed 2020. European Commission Standards for Medical Devices. https://ec.europa.eu/growth/single-market/european-standards/harmonised-standards/medical-devices_en(Accessed 2020).",
      "doi": ""
    },
    {
      "text": "David Corps. 2020. Births in England and Wales: 2019. 452 (2020). https://www.ons.gov.uk/peoplepopulationandcommunity/birthsdeathsandmarriages/livebirths/bulletins/birthsummarytablesenglandandwales/2019",
      "doi": ""
    },
    {
      "text": "Mayara Costa Figueiredo. 2020. Self-Tracking for Fertility Care: A Holistic Approach. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI EA ’20). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3334480.3375029",
      "doi": ""
    },
    {
      "text": "Mayara Costa Figueiredo, Clara Caldeira, Elizabeth Victoria Eikey, Melissa Mazmanian, and Yunan Chen. 2018. Engaging with Health Data: The Interplay Between Self-Tracking Activities and Emotions in Fertility Struggles. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 40 (Nov. 2018), 20 pages. https://doi.org/10.1145/3274309",
      "doi": "10.1145/3274309"
    },
    {
      "text": "Mayara Costa Figueiredo, Clara Caldeira, Tera L. Reynolds, Sean Victory, Kai Zheng, and Yunan Chen. 2017. Self-Tracking for Fertility Care: Collaborative Support for a Highly Personalized Problem. Proc. ACM Hum.-Comput. Interact. 1, CSCW, Article 36 (Dec. 2017), 21 pages. https://doi.org/10.1145/3134671",
      "doi": "10.1145/3134671"
    },
    {
      "text": "Lydia de la Torre. 2018. A guide to the california consumer privacy act of 2018. Available at SSRN 3275571(2018).",
      "doi": ""
    },
    {
      "text": "Finn Diderichsen, Johan Hallqvist, and Margaret Whitehead. 2019. Differential vulnerability and susceptibility: how to make use of recent development in our understanding of mediation and interaction to tackle health inequalities. International Journal of Epidemiology 48, 1 (2019), 268–274. https://doi.org/10.1093/ije/dyy167",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio and Lauren F. Klein. 2020. Data Feminism. (2020).",
      "doi": ""
    },
    {
      "text": "Sarah Earle, Hannah R Marston, Robin Hadley, and Duncan Banks. 2020. Use of menstruation and fertility app trackers: a scoping review of the evidence. BMJ Sexual & Reproductive Health, Article bmjsrh-2019-200488 (2020). https://doi.org/10.1136/bmjsrh-2019-200488",
      "doi": ""
    },
    {
      "text": "European Data Protection Board (EDPB). 2004. Working Document on Genetic Data. https://ec.europa.eu/justice/article-29/documentation/opinion-recommendation/files/2004/wp91_en.pdf(2004).",
      "doi": ""
    },
    {
      "text": "European Data Protection Board (EDPB). 2012. Opinion 3/2012 on developments in biometric technologies. https://ec.europa.eu/justice/article-29/documentation/opinion-recommendation/files/2012/wp193_en.pdf(2012).",
      "doi": ""
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015. The Myth of the Average User: Improving Privacy and Security Systems through Individualization. In Proceedings of the 2015 New Security Paradigms Workshop (Twente, Netherlands) (NSPW ’15). Association for Computing Machinery, New York, NY, USA, 16–28. https://doi.org/10.1145/2841113.2841115",
      "doi": "10.1145/2841113.2841115"
    },
    {
      "text": "BBC Farsi. 2020. Iranian social media reaction to female Parliament member gives birth to her child (Farsi). BBC at bbc.com/persian/iran-features-5341846 (2020).",
      "doi": ""
    },
    {
      "text": "Sarah Fox and Daniel A. Epstein. 2020. Monitoring Menses: Design-Based Investigations of Menstrual Tracking Applications. Springer Singapore, Singapore, 733–750. https://doi.org/10.1007/978-981-15-0614-7_54",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Noura Howell, Richmond Wong, and Franchesca Spektor. 2019. Vivewell: Speculating Near-Future Menstrual Tracking through Current Data Practices. In Proceedings of the 2019 on Designing Interactive Systems Conference. 541–552.",
      "doi": "10.1145/3322276.3323695"
    },
    {
      "text": "Sarah E. Fox, Amanda Menking, Jordan Eschler, and Uba Backonja. 2020. Multiples Over Models: Interrogating the Past and Collectively Reimagining the Future of Menstrual Sensemaking. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 22 (Sept. 2020), 24 pages. https://doi.org/10.1145/3397178",
      "doi": "10.1145/3397178"
    },
    {
      "text": "Jessica Glenza. 2019. Revealed: women’s fertility app is funded by anti-abortion campaigners. The Guardian (2019). theguardian.com/world/2019/may/30/revealed-womens-fertility-app-is-funded-by-anti-abortion-campaigners",
      "doi": ""
    },
    {
      "text": "UK Government. Accessed 2020. Guidance on Medical devices: EU regulations for MDR and IVDR. https://www.gov.uk/guidance/medical-devices-eu-regulations-for-mdr-and-ivdr(Accessed 2020).",
      "doi": ""
    },
    {
      "text": "Josie Hamper. 2020. ‘Catching ovulation’: Exploring women’s use of fertility tracking apps as a reproductive technology. Body & Society (March 2020). https://doi.org/10.1177/1357034X19898259",
      "doi": ""
    },
    {
      "text": "Drew Harwell. 2019. Is your pregnancy app sharing your intimate data with your boss?The Washington Post (2019).",
      "doi": ""
    },
    {
      "text": "Sarah Homewood, Harvey Bewley, and Laurens Boer. 2019. Ovum: Designing for Fertility Tracking as a Shared and Domestic Experience. In Proceedings of the 2019 on Designing Interactive Systems Conference (San Diego, CA, USA) (DIS ’19). Association for Computing Machinery, New York, NY, USA, 553–565. https://doi.org/10.1145/3322276.3323692",
      "doi": "10.1145/3322276.3323692"
    },
    {
      "text": "Stefan Hutzler, C. Sommer, and P. Richmond. 2016. On the relationship between income, fertility rates and the state of democracy in society. Physica A: Statistical Mechanics and its Applications 452 (March 2016), 9–18. https://doi.org/10.1016/j.physa.2016.02.011",
      "doi": ""
    },
    {
      "text": "Information Commissioner Office (ICO). 2020. How do we comply with the cookie rules?ico.org.uk/for-organisations/guide-to-pecr/guidance-on-the-use-of-cookies-and-similar-technologies/how-do-we-comply-with-the-cookie-rules/ visited Sep 2020. (2020).",
      "doi": ""
    },
    {
      "text": "Information Commissioner Office (ICO). 2020. What is special category data?ico.org.uk/for-organisations/guide-to-data-protection/guide-to-the-general-data-protection-regulation-gdpr/special-category-data/what-is-special-category-data/ visited Sep 2020. (2020).",
      "doi": ""
    },
    {
      "text": "Privacy International. 2019. How Menstruation Apps Are Sharing Your Data. at: https://privacyinternational.org/long-read/3196/no-bodys-business-mine-how-menstruations-apps-are-sharing-your-data(2019).",
      "doi": ""
    },
    {
      "text": "Hill Kulu, Tina Hannemann, Ariane Pailhé, Karel Neels, Sandra Krapf, Amparo González-Ferrer, and Gunnar Andersson. 2017. Fertility by birth order among the descendants of immigrants in selected European countries. Population and Development Review(2017), 31–60.",
      "doi": ""
    },
    {
      "text": "Adi Kuntsman, Esperanza Miyake, and Sam Martin. 2019. Re-thinking Digital Health: Data, Appisation and the (im)possibility of ‘Opting out’. Digital Health 5(2019), 1–16. https://doi.org/10.1177/2055207619880671",
      "doi": ""
    },
    {
      "text": "Karen E. Levy. 2015. Intimate Surveillance. Idaho Law Review 51, 679–693. https://doi.org/10.1080/13691058.2014.920528 PMID: 24917459.",
      "doi": ""
    },
    {
      "text": "Martina Lindorfer, Matthias Neugschwandtner, and Christian Platzer. 2015. Marvin: Efficient and comprehensive mobile app classification through static and dynamic analysis. In 2015 IEEE 39th annual computer software and applications conference, Vol. 2. IEEE, 422–433.",
      "doi": ""
    },
    {
      "text": "Michele Loi and Markus Christen. 2019. Two Concepts of Group Privacy. Philosophy & Technology(2019), 1–18.",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2014. Self-Tracking Modes: Reflexive Self-Monitoring and Data Practices. SSRN (2014). https://doi.org/10.2139/ssrn.2483549",
      "doi": ""
    },
    {
      "text": "Deborah Lupton. 2015. ‘Mastering Your Fertility’: The Digitised Reproductive Citizen. Negotiating Digital Citizenship: Control, Contest and Culture (2015). https://papers.ssrn.com/sol3/papers.cfm?abstract_id=2679402",
      "doi": ""
    },
    {
      "text": "Deborah Lupton and Sarah Pedersen. 2016. An Australian survey of women’s use of pregnancy and parenting apps. Women and Birth 29(2016), 368–375. https://doi.org/10.1016/j.wombi.2016.01.008",
      "doi": ""
    },
    {
      "text": "Catriona Ida Macleod. 2019. Expanding reproductive justice through a supportability reparative justice framework: the case of abortion in South Africa. Culture, Health & Sexuality 21, 1 (May 2019), 46-62. https://doi.org/10.1080/13691058.2018.1447687",
      "doi": ""
    },
    {
      "text": "E. Maeda, F. Nakamura, Y. Kobayashi, J. Boivin, H. Sugimori, K. Murata, and H. Saito. 2016. Effects of fertility education on knowledge, desires and anxiety among the reproductive-aged population: findings from a randomized controlled trial. Human Reproduction 31, 9 (2016), 2051–2060. https://doi.org/10.1093/humrep/dew133",
      "doi": ""
    },
    {
      "text": "Maryam Mehrnezhad. 2020. A Cross-Platform Evaluation of Privacy Notices and Tracking Practices. In 2020 IEEE European Symposium on Security and Privacy Workshops (EuroS&PW). IEEE, 97–106.",
      "doi": ""
    },
    {
      "text": "Maryam Mehrnezhad and Ehsan Toreini. 2019. What Is This Sensor and Does This App Need Access to It?Informatics Special Issue Human Factors in Security and Privacy in IoT (HFSP-IoT)(2019). https://doi.org/10.3390/informatics6010007",
      "doi": ""
    },
    {
      "text": "Amber Milne. 2020. EXPLAINER-How to control women’s sexual health with tech. Reuters Healthcare (April 2020). https://in.reuters.com/article/britain-women-data/explainer-how-to-control-womens-sexual-health-with-tech-idUSL5N2CB5WS",
      "doi": ""
    },
    {
      "text": "Janet Morrissey. 2018. Women Struggling to Get Pregnant Turn to Fertility Apps. (2018). https://www.nytimes.com/2018/08/27/business/women-fertility-apps-pregnancy.html",
      "doi": ""
    },
    {
      "text": "US Department of Health and Human Services. Accessed 2020. The HIPAA Privacy Rule. https://www.hhs.gov/hipaa/for-professionals/privacy/index.html(Accessed 2020).",
      "doi": ""
    },
    {
      "text": "Population Division of the Department of Economic and Social Affairs. 2019. 2019 Revision of World Population Prospects. 452 (2019). https://population.un.org/wpp/",
      "doi": ""
    },
    {
      "text": "Official Journal of the European Union. 2020. Article 4(15) and Recital 35. eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32016R0679&from=EN visited Sep 2020. (2020).",
      "doi": ""
    },
    {
      "text": "Isabelle Oomen and Ronald Leenes. 2008. Privacy risk perceptions and privacy protection strategies. In Policies and research in identity management. Springer, 121–138.",
      "doi": ""
    },
    {
      "text": "World Health Organization. 2020. Sexual and reproductive health: Infertility. World Health Organization(2020). https://www.who.int/reproductivehealth/topics/infertility/keyissues/en/",
      "doi": ""
    },
    {
      "text": "Yong Jin Park. 2015. Do men and women differ in privacy? Gendered privacy and (in) equality in the Internet. Computers in Human Behavior 50 (2015), 252–258.",
      "doi": "10.1016/j.chb.2015.04.011"
    },
    {
      "text": "Dilisha Patel, Ann Blandford, Mark Warner, Jill Shawe, and Judith Stephenson. 2019. “I Feel like Only Half a Man”: Online Forums as a Resource for Finding a “New Normal” for Men Experiencing Fertility Issues. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 82 (Nov. 2019), 20 pages. https://doi.org/10.1145/3359184",
      "doi": "10.1145/3359184"
    },
    {
      "text": "Emmanuel Pernot-Leplay. 2020. China’s Approach on Data Privacy Law: A Third Way Between the US and the EU?Penn State Journal of Law & International Affairs 8, 1 (2020).",
      "doi": ""
    },
    {
      "text": "Sarah F. Peterson and Wing Kay Fok. 2019. Mobile technology for family planning. Current Opinion in Obstetrics and Gynecology 31, 6 (Dec. 2019), 459-463. https://doi.org/10.1097/GCO.0000000000000578",
      "doi": ""
    },
    {
      "text": "James Pierce, Sarah Fox, Nick Merrill, and Richmond Wong. 2018. Differential Vulnerabilities and a Diversity of Tactics: What Toolkits Teach Us about Cybersecurity. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 139 (Nov. 2018), 24 pages. https://doi.org/10.1145/3274408",
      "doi": "10.1145/3274408"
    },
    {
      "text": "Abbas Razaghpanah, Narseo Vallina-Rodriguez, Srikanth Sundaresan, Christian Kreibich, Phillipa Gill, Mark Allman, and Vern Paxson. 2015. Haystack: In situ mobile traffic analysis in user space. (2015). arxiv:1510.01419",
      "doi": ""
    },
    {
      "text": "Tonya Riley. 2020. A popular fertility app shared data without user consent, researchers say. The Washington Post (2020). https://www.washingtonpost.com/technology/2020/08/20/popular-fertility-app-shared-data-without-user-consent-researchers-say/",
      "doi": ""
    },
    {
      "text": "Vanessa Rizk and Dalia Othman. 2016. Quantifying Fertility and Reproduction through Mobile Apps: A Critical Overview. Arrow for change 22, 1 (2016), 13–21.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal Tracking as Lived Informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1163–1172. https://doi.org/10.1145/2556288.2557039",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Celia Rosas. 2019. The Future is Femtech: Privacy and Data Security Issues Surrounding Femtech Applications. Hastings Business Law Journal 15, 2 (2019). https://repository.uchastings.edu/hastings_business_law_journal/vol15/iss2/5",
      "doi": ""
    },
    {
      "text": "Loretta Ross and Rickie Solinger. 2017. Reproductive Justice: An Introduction. (March 2017).",
      "doi": ""
    },
    {
      "text": "Hanna Schneider, Julia Wayrauther, Mariam Hassib, and Andreas Butz. 2019. Communicating Uncertainty in Fertility Prognosis. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300391",
      "doi": "10.1145/3290605.3300391"
    },
    {
      "text": "Rakesh Sharma, Kelly R Biedenharn, Jennifer M Fedor, and Ashok Agarwal. 2013. Lifestyle factors and reproductive health: taking control of your fertility. Reprod Biol Endocrinol. 11, 66 (2013). https://doi.org/10.1186/1477-7827-11-66",
      "doi": ""
    },
    {
      "text": "Laura Shipp and Jorge Blasco. 2020. How private is your period?: A systematic analysis of menstrual app privacy policies. Proceedings on Privacy Enhancing Technologies 4 (2020), 491–510.",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Sternke and Kathleen Abrahamson. 2014. Perceptions of Women with Infertility on Stigma and Disability. Sexuality and Disability 33, 3 (2014). https://doi.org/10.1007/s11195-014-9348-6",
      "doi": ""
    },
    {
      "text": "Frost & Sullivan. 2018. Femtech—Time for a Digital Revolution in the Women’s Health Market. (2018). https://ww2.frost.com/frost-perspectives/femtechtime-digital-revolution-womens-health-market/",
      "doi": ""
    },
    {
      "text": "Didi Surian, Suranga Seneviratne, Aruna Seneviratne, and Sanjay Chawla. 2017. App miscategorization detection: A case study on google play. IEEE Transactions on Knowledge and Data Engineering 29, 8(2017), 1591–1604.",
      "doi": "10.1109/TKDE.2017.2686851"
    },
    {
      "text": "Sara Suárez-Gonzalo. June 2019. Personal data are political. A feminist view on privacy and big data. Recerca, Revista de Pensament I Anàlisi 24, 2 (June 2019), 173-192. https://doi.org/10.6035/Recerca.2019.24.2.9",
      "doi": ""
    },
    {
      "text": "Kerry van der Berch. 2010. Courts’ struggle with infertility: the impact of hall v. Nalco on infertility-related employment discrimination. University of Colorado Law Review 81, 2 (2010), 545–578.",
      "doi": ""
    },
    {
      "text": "Paul Voigt and Axel Von dem Bussche. 2017. The eu general data protection regulation (gdpr). A Practical Guide, 1st Ed., Cham: Springer International Publishing (2017).",
      "doi": "10.5555/3152676"
    },
    {
      "text": "Charlie Warzel. 2019. The Loophole That Turns Your Apps Into Spies. NYT at nytimes.com/2019/09/24/opinion/facebook-google-apps-data.html(2019).",
      "doi": ""
    },
    {
      "text": "Gabriela Weigel, Laurie Sobel, and Alina Salganicoff. 2020. Criminalizing Pregnancy Loss and Jeopardizing Care: The Unintended Consequences of Abortion Restrictions and Fetal Harm Legislation. Women’s Health Issues 30, 3 (2020), 143-146. https://doi.org/10.1016/j.whi.2020.03.005",
      "doi": ""
    }
  ]
}