{
  "doi": "10.1145/3411764.3445595",
  "title": "Let’s Frets! Assisting Guitar Students During Practice via Capacitive Sensing",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Learning a musical instrument requires regular exercise. However, students are often on their own during their practice sessions due to the limited time with their teachers, which increases the likelihood of mislearning playing techniques. To address this issue, we present Let’s Frets - a modular guitar learning system that provides visual indicators and capturing of finger positions on a 3D-printed capacitive guitar fretboard. We based the design of Let’s Frets on requirements collected through in-depth interviews with professional guitarists and teachers. In a user study (N=24), we evaluated the feedback modules of Let’s Frets against fretboard charts. Our results show that visual indicators require the least time to realize new finger positions while a combination of visual indicators and position capturing yielded the highest playing accuracy. We conclude how Let’s Frets enables independent practice sessions that can be translated to other musical instruments.",
  "authors": [
    {
      "name": "Karola Marky",
      "institution": "University of Glasgow, Scotland and Technical University of Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659225101",
      "orcid": "missing"
    },
    {
      "name": "Andreas Weiß",
      "institution": "Music School Schallkultur, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701071",
      "orcid": "missing"
    },
    {
      "name": "Andrii Matviienko",
      "institution": "Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-99658734228/rel-imgonly/andrii_2.jpg",
      "acmid": "99658734228",
      "orcid": "0000-0002-6571-0623"
    },
    {
      "name": "Florian Brandherm",
      "institution": "Technical University of Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658723614",
      "orcid": "missing"
    },
    {
      "name": "Sebastian Wolf",
      "institution": "Technical University of Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659769959",
      "orcid": "missing"
    },
    {
      "name": "Martin Schmitz",
      "institution": "Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-87958634757/rel-imgonly/martin_foto.jpg",
      "acmid": "87958634757",
      "orcid": "0000-0002-7332-3287"
    },
    {
      "name": "Florian Krell",
      "institution": "Technical University of Darmstadt, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659640968",
      "orcid": "missing"
    },
    {
      "name": "Florian Müller",
      "institution": "Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81464642529/rel-imgonly/flo_small.jpg",
      "acmid": "81464642529",
      "orcid": "0000-0002-9621-6214"
    },
    {
      "name": "Max Mühlhäuser",
      "institution": "Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-81100305085/rel-imgonly/max_2669.jpg",
      "acmid": "81100305085",
      "orcid": "0000-0003-4713-5327"
    },
    {
      "name": "Thomas Kosch",
      "institution": "Technical University of Darmstadt, Germany",
      "img": "/do/10.1145/contrib-99658769787/rel-imgonly/profile4s.png",
      "acmid": "99658769787",
      "orcid": "0000-0001-6300-9035"
    }
  ],
  "references": [
    {
      "text": "Jakob Abeßer. 2012. Automatic String Detection for Bass Guitar and Electric Guitar. In Proceedings of the International Symposium on Computer Music Modeling and Retrieval(CMMR 2012). Springer, Cham, Switzerland, 333–352.",
      "doi": ""
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. Journal of Usability Studies 4, 3 (2009), 114–123.",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Ana M. Barbancho, Anssi Klapuri, Lorenzo J. Tardon, and Isabel Barbancho. 2012. Automatic Transcription of Guitar Chords and Fingering From Audio. IEEE Transactions on Audio, Speech, and Language Processing 20, 3(2012), 915–921. https://doi.org/10.1109/TASL.2011.2174227",
      "doi": "10.1109/TASL.2011.2174227"
    },
    {
      "text": "John Brooke. 1996. SUS - A Quick and Dirty Usability Scale. Usability Evaluation in Industry 189, 194 (1996), 4–7.",
      "doi": ""
    },
    {
      "text": "Ozan Cakmakci, François Bérard, and Joëlle Coutaz. 2003. An Augmented Reality based Learning Assistant for Electric Bass Guitar. In Proceedings of the 10th HCI International Conference on Human-Computer Interaction(HCI International 2003). CRC Press Taylor, Boca Raton, FL, USA, 1–2.",
      "doi": ""
    },
    {
      "text": "Hongchan Choi, John Granzow, and Joel Sadler. 2012. The Deckle Project : A Sketch of Three Sensors. In Proceedings of the International Conference on New Interfaces for Musical Expression(NIME). University of Michigan, Ann Arbor, Michigan. https://doi.org/10.5281/zenodo.1178235",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1960. A Coefficient of Agreement for Nominal Scales. Educational and Psychological Measurement 20, 1 (1960), 37–46.",
      "doi": ""
    },
    {
      "text": "David Dalmazzo and Rafael Ramirez. 2017. Air Violin: A Machine Learning Approach to Fingering Gesture Recognition. In Proceedings of the 1st ACM SIGCHI International Workshop on Multimodal Interaction for Education(MIE 2017). ACM, New York, NY, USA, 63–66. https://doi.org/10.1145/3139513.3139526",
      "doi": "10.1145/3139513.3139526"
    },
    {
      "text": "Shantanu Das, Seth Glickman, Fu Yen Hsiao, and Byunghwan Lee. 2017. Music Everywhere – Augmented Reality Piano Improvisation Learning System. In Proceedings of the International Conference on New Interfaces for Musical Expression(NIME). Aalborg University Copenhagen, Copenhagen, Denmark, 511–512. https://doi.org/10.5281/zenodo.1176350",
      "doi": ""
    },
    {
      "text": "LLC. Edge Tech Labs. 2019. FretZealot. http://fretzealot.com/. [Online; accessed: 12-January-2021].",
      "doi": ""
    },
    {
      "text": "Anders Ericsson, Ralf T. Krampe, and Clemens Tesch-Römer. 1993. The Role of Deliberate Practice in the Acquisition of Expert Performance. Psychological Review 100, 3 (1993), 363. https://doi.org/10.1037//0033-295X.100.3.363",
      "doi": ""
    },
    {
      "text": "Tobias Grosshauser and Gerhard Tröster. 2013. Finger Position and Pressure Sensing Techniques for String and Keyboard Instruments. In Proceedings of the International Conference on New Interfaces for Musical Expression(NIME). Graduate School of Culture Technology, KAIST, Daejeon, Republic of Korea, 27–30. https://doi.org/10.5281/zenodo.1178538",
      "doi": ""
    },
    {
      "text": "Eli Harrison. 2010. Challenges Facing Guitar Education. Music Educators Journal 97, 1 (2010), 50–55. https://doi.org/10.1177/0027432109334421",
      "doi": ""
    },
    {
      "text": "Jacob Harrison, Alan Chamberlain, and Andrew P. McPherson. 2019. Accessible Instruments in the Wild: Engaging with a Community of Learning-Disabled Musicians. In Extended Abstracts of the CHI Conference on Human Factors in Computing Systems(CHI EA ’19). ACM, New York, NY, USA, Article LBW0247, 6 pages. https://doi.org/10.1145/3290607.3313037",
      "doi": "10.1145/3290607.3313037"
    },
    {
      "text": "Kevin Huang, Thad Starner, Ellen Do, Gil Weinberg, Daniel Kohlsdorf, Claas Ahlrichs, and Ruediger Leibrandt. 2010. Mobile Music Touch: Mobile Tactile Stimulation for Passive Learning. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). ACM, New York, NY, USA, 791–800. https://doi.org/10.1145/1753326.1753443",
      "doi": "10.1145/1753326.1753443"
    },
    {
      "text": "Incident. 2019. gTar. www.incidentgtar.com. [Online; accessed: 12-January-2021].",
      "doi": ""
    },
    {
      "text": "Rocksmith International. 2019. Rocksmith. https://rocksmith.ubisoft.com/rocksmith/en-us/home/. [Online; accessed: 12-January-2021].",
      "doi": ""
    },
    {
      "text": "Jakob Karolus, Annika Kilian, Thomas Kosch, Albrecht Schmidt, and Paweł W. Wozniak. 2020. Hit the Thumb Jack! Using Electromyography to Augment the Piano Keyboard. In Proceedings of the ACM Designing Interactive Systems Conference(DIS ’20). ACM, New York, NY, USA, 429–440. https://doi.org/10.1145/3357236.3395500",
      "doi": "10.1145/3357236.3395500"
    },
    {
      "text": "Jakob Karolus, Hendrik Schuff, Thomas Kosch, Paweł W. Wozniak, and Albrecht Schmidt. 2018. EMGuitar: Assisting Guitar Playing with Electromyography. In Proceedings of the Designing Interactive Systems Conference(DIS ’18). ACM, New York, NY, USA, 651–655. https://doi.org/10.1145/3196709.3196803",
      "doi": "10.1145/3196709.3196803"
    },
    {
      "text": "Joseph R. Keebler, Travis J. Wiltshire, Dustin C. Smith, and Stephen M. Fiore. 2013. Picking Up STEAM: Educational Implications for Teaching With an Augmented Reality Guitar Learning System. In Proceedings of the International Conference on Virtual, Augmented and Mixed Reality(VAMR). Springer, Cham, Switzerland, 170–178. https://doi.org/10.1007/978-3-642-39420-1_19",
      "doi": ""
    },
    {
      "text": "Chutisant Kerdvibulvech and Hideo Saito. 2007. Real-Time Guitar Chord Estimation by Stereo Cameras for Supporting Guitarists. In Proceedings of the 10th International Workshop on Advanced Image Technology(IWAIT). 256–261.",
      "doi": ""
    },
    {
      "text": "Ralf T. Krampe and Karl A. Ericsson. 1995. Deliberate Practice and Elite Musical Performance. Cambridge University Press, Cambridge, United Kingdom, 84–102. https://doi.org/10.1017/CBO9780511552366.005",
      "doi": ""
    },
    {
      "text": "Markus Löchtefeld, Sven Gehring, Ralf Jung, and Antonio Krüger. 2011. guitAR: Supporting Guitar Learning Through Mobile Projection. In Extended Abstracts of the CHI Human Factors in Computing Systems(CHI EA ’11). ACM, New York, NY, USA, 1447–1452. https://doi.org/10.1145/1979742.1979789",
      "doi": "10.1145/1979742.1979789"
    },
    {
      "text": "Markus Löchtefeld, Sven Gehring, Ralf Jung, and Antonio Krüger. 2011. Using Mobile Projection to Support Guitar Learning. In Proceedings of the International Symposium on Smart Graphics. Springer, Cham, Switzerland, 103–114. https://doi.org/10.1007/978-3-642-22571-0_9",
      "doi": ""
    },
    {
      "text": "Karola Marky, Andreas Weiß, and Thomas Kosch. 2019. Supporting Musical Practice Sessions Through HMD-Based Augmented Reality. In Mensch und Computer 2019-Workshopband. Gesellschaft für Informatik e.V., Bonn, Germany, 1–5.",
      "doi": ""
    },
    {
      "text": "Matthias Mauch and Simon Dixon. 2010. Simultaneous Estimation of Chords and Musical Context From Audio. IEEE Transactions on Audio, Speech, and Language Processing 18, 6(2010), 1280–1289. https://doi.org/10.1109/TASL.2009.2032947",
      "doi": "10.1109/TASL.2009.2032947"
    },
    {
      "text": "Yoichi Motokawa and Hideo Saito. 2006. Support System for Guitar Playing Using Augmented Reality Display. In Proceedings of the IEEE and ACM International Symposium on Mixed and Augmented Reality(ISMAR ’06). IEEE Computer Society, Washington, DC, USA, 243–244. https://doi.org/10.1109/ISMAR.2006.297825",
      "doi": "10.1109/ISMAR.2006.297825"
    },
    {
      "text": "Laurel S. Pardue, Christopher Harte, and Andrew P. McPherson. 2015. A low-cost real-time tracking system for violin. Journal of New Music Research 44, 4 (2015), 305–323.",
      "doi": ""
    },
    {
      "text": "Linsey Raymaekers, Jo Vermeulen, Kris Luyten, and Karin Coninx. 2014. Game of Tones: Learning to Play Songs on a Piano Using Projected Instructions and Games. In Proceedings of the 2014 CHI Human Factors in Computing Systems (Extended Abstracts) (Toronto, Ontario, Canada) (CHI EA ’14). ACM, New York, NY, USA, 411–414. https://doi.org/10.1145/2559206.2574799",
      "doi": "10.1145/2559206.2574799"
    },
    {
      "text": "A. B. M. (Boni) Rietveld. 2013. Dancers’ and Musicians’ Injuries. Clinical Rheumatology 32, 4 (01 Apr 2013), 425–434. https://doi.org/10.1007/s10067-013-2184-8",
      "doi": ""
    },
    {
      "text": "Del Rio-Guerra, Marta Sylvia, Jorge Martin-Gutierrez, Vicente A Lopez-Chao, Rodolfo Flores Parra, and Mario A Ramirez Sosa. 2019. AR Graphic Representation of Musical Notes for Self-Learning on Guitar. Applied Sciences 9, 21 (2019), 4527.",
      "doi": ""
    },
    {
      "text": "Katja Rogers, Amrei Röhlig, Matthias Weing, Jan Gugenheimer, Bastian Könings, Melina Klepsch, Florian Schaub, Enrico Rukzio, Tina Seufert, and Michael Weber. 2014. P.I.A.N.O.: Faster Piano Learning with Interactive Projection. In Proceedings of the International Conference on Interactive Tabletops and Surfaces(ITS ’14). ACM, New York, NY, USA, 149–158. https://doi.org/10.1145/2669485.2669514",
      "doi": "10.1145/2669485.2669514"
    },
    {
      "text": "Valkyrie Savage, Ryan Schmidt, Tovi Grossman, George Fitzmaurice, and Björn Hartmann. 2014. A Series of Tubes: Adding Interactivity to 3D Prints Using Internal Pipes. In Proceedings of the 27th Annual ACM Symposium on User Interface Software and Technology(UIST ’14). ACM, New York, New York, USA, 3–12. https://doi.org/10.1145/2642918.2647374",
      "doi": "10.1145/2642918.2647374"
    },
    {
      "text": "Martin Schmitz, Mohammadreza Khalilbeigi, Matthias Balwierz, Roman Lissermann, Max Mühlhäuser, and Jürgen Steimle. 2015. Capricate: A Fabrication Pipeline to Design and 3D Print Capacitive Touch Sensors for Interactive Objects. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(UIST ’15). ACM, New York, New York, USA, 253–258. https://doi.org/10.1145/2807442.2807503",
      "doi": "10.1145/2807442.2807503"
    },
    {
      "text": "Yejin Shin, Jemin Hwang, Jeonghyeok Park, and Soonuk Seol. 2018. Real-time Recognition of Guitar Performance Using Two Sensor Groups for Interactive Lesson. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’18). ACM, New York, NY, USA, 435–442. https://doi.org/10.1145/3173225.3173235",
      "doi": "10.1145/3173225.3173235"
    },
    {
      "text": "John A. Sloboda, Jane W. Davidson, Michael J.A. Howe, and Derek G. Moore. 1996. The Role of Practice in the Development of Performing Musicians. British Journal of Psychology 87, 2 (1996), 287–309. https://doi.org/10.1111/j.2044-8295.1996.tb02591.x",
      "doi": ""
    },
    {
      "text": "International Organization For Standardization. 1998. ISO 9241-11: Ergonomics of Human System Interaction – Part 11: Guidance on Usability.",
      "doi": ""
    },
    {
      "text": "The Fretlight Guitar Store. 2019. FretLight. https://fretlight.com/. [Online; accessed: 12-January-2021].",
      "doi": ""
    },
    {
      "text": "LLC. Synthesia. 2019. Synthesia – A Fun Way to Learn How to Play the Piano. https://www.synthesiagame.com/. [Online; accessed: 12-January-2021].",
      "doi": ""
    },
    {
      "text": "Yoshinari Takegawa, Tsutomu Terada, and Masahiko Tsukamoto. 2012. A Piano Learning Support System Considering Rhythm. In Proceedings of the International Computer Music Conference(ICMC). The International Computer Music Association, San Francisco, CA, USA, 325–332.",
      "doi": ""
    },
    {
      "text": "Janet van der Linden, Erwin Schoonderwaldt, Jon Bird, and Rose Johnson. 2011. MusicJacket – Combining Motion Capture and Vibrotactile Feedback to Teach Violin Bowing. IEEE Transactions on Instrumentation and Measurement 60, 1 (Jan 2011), 104–113. https://doi.org/10.1109/TIM.2010.2065770",
      "doi": ""
    },
    {
      "text": "Xiao Xiao and Hiroshi Ishii. 2010. MirrorFugue: Communicating Hand Gesture in Remote Piano Collaboration. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’11). ACM, New York, NY, USA, 13–20. https://doi.org/10.1145/1935701.1935705",
      "doi": "10.1145/1935701.1935705"
    },
    {
      "text": "Qi Yang and Georg Essl. 2013. Visual Associations in Augmented Keyboard Performance. In Proceedings of the International Conference on New Interfaces for Musical Expression(NIME). Graduate School of Culture Technology, KAIST, Daejeon, Republic of Korea, 252–255. https://doi.org/10.5281/zenodo.1178694",
      "doi": ""
    },
    {
      "text": "Kazuki Yazawa, Daichi Sakaue, Kohei Nagira, Katsutoshi Itoyama, and Hiroshi G. Okuno. 2013. Audio-Based Guitar Tablature Transcription Using Multipitch Analysis and Playability Constraints. In Proceedings of the IEEE International Conference on Acoustics, Speech and Signal Processing. IEEE, Piscataway, NJ, USA, 196–200.",
      "doi": ""
    }
  ]
}