{
  "doi": "10.1145/3411764.3445651",
  "title": "MIRIA: A Mixed Reality Toolkit for the In-Situ Visualization and Analysis of Spatio-Temporal Interaction Data",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "In this paper, we present MIRIA, a Mixed Reality Interaction Analysis toolkit designed to support the in-situ visual analysis of user interaction in mixed reality and multi-display environments. So far, there are few options to effectively explore and analyze interaction patterns in such novel computing systems. With MIRIA, we address this gap by supporting the analysis of user movement, spatial interaction, and event data by multiple, co-located users directly in the original environment. Based on our own experiences and an analysis of the typical data, tasks, and visualizations used in existing approaches, we identify requirements for our system. We report on the design and prototypical implementation of MIRIA, which is informed by these requirements and offers various visualizations such as 3D movement trajectories, position heatmaps, and scatterplots. To demonstrate the value of MIRIA for real-world analysis tasks, we conducted expert feedback sessions using several use cases with authentic study data.",
  "authors": [
    {
      "name": "Wolfgang Büschel",
      "institution": "Interactive Media Lab, Dresden Technische Universität, Dresden, Germany",
      "img": "/do/10.1145/contrib-81548870956/rel-imgonly/web_color.jpg",
      "acmid": "81548870956",
      "orcid": "missing"
    },
    {
      "name": "Anke Lehmann",
      "institution": "Interactive Media Lab, Dresden Technische Universität, Dresden, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490644467",
      "orcid": "missing"
    },
    {
      "name": "Raimund Dachselt",
      "institution": "Interactive Media Lab Dresden, Cluster of Excellence Physics of Life, Centre for Tactile Internet with Human-in-the-Loop (CeTI), Technische Universität Dresden, Germany",
      "img": "/do/10.1145/contrib-81100509454/rel-imgonly/raimund_dachselt_200x200.jpg",
      "acmid": "81100509454",
      "orcid": "0000-0002-2176-876X"
    }
  ],
  "references": [
    {
      "text": "Shivam Agarwal, Jonas Auda, Stefan Schneegaß, and Fabian Beck. 2020. A Design and Application Space for Visualizing User Sessions of Virtual and Mixed Reality Environments. In Vision, Modeling, and Visualization, Jens Krüger, Matthias Niessner, and Jörg Stückler (Eds.). The Eurographics Association. https://doi.org/10.2312/vmv.20201194",
      "doi": ""
    },
    {
      "text": "Gennady Andrienko, Natalia Andrienko, Peter Bak, Daniel Keim, and Stefan Wrobel. 2013. Visual Analytics of Movement. Springer. https://doi.org/10.1007/978-3-642-37583-5",
      "doi": "10.5555/2541758"
    },
    {
      "text": "Natalia Andrienko, Gennady Andrienko, Jose Manuel Cordero Garcia, and David Scarlatti. 2019. Analysis of Flight Variability: a Systematic Approach. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan 2019), 54–64. https://doi.org/10.1109/TVCG.2018.2864811",
      "doi": "10.1109/TVCG.2018.2864811"
    },
    {
      "text": "Robert Ball and Chris North. 2007. Realizing embodied interaction for visual analytics through large displays. Computers & Graphics 31, 3 (2007), 380 – 400. https://doi.org/10.1016/j.cag.2007.01.029",
      "doi": "10.1016/j.cag.2007.01.029"
    },
    {
      "text": "Andrea Batch, Andrew Cunningham, Maxime Cordeil, Niklas Elmqvist, Tim Dwyer, Bruce H. Thomas, and Kim Marriott. 2020. There Is No Spoon: Evaluating Performance, Space Use, and Presence with Expert Domain Users in Immersive Analytics. IEEE Transactions on Visualization and Computer Graphics 26, 1 (Jan 2020), 536–546. https://doi.org/10.1109/TVCG.2019.2934803",
      "doi": ""
    },
    {
      "text": "Mark Billinghurst, Maxime Cordeil, Anastasia Bezerianos, and Todd Margolis. 2018. Collaborative Immersive Analytics. Springer International Publishing, Cham, 221–257. https://doi.org/10.1007/978-3-030-01388-2_8",
      "doi": ""
    },
    {
      "text": "Katy Börner and Shashikant Penumarthy. 2003. Social Diffusion Patterns in Three-Dimensional Virtual Worlds. Information Visualization 2, 3 (Sept. 2003), 182–198. https://doi.org/10.1057/palgrave.ivs.9500050",
      "doi": ""
    },
    {
      "text": "Frederik Brudy, Suppachai Suwanwatcharachat, Wenyu Zhang, Steven Houben, and Nicolai Marquardt. 2018. EagleView: A Video Analysis Tool for Visualising and Querying Spatial Interactions of People and Devices. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces(ISS ’18). ACM, New York, NY, USA, 61–72. https://doi.org/10.1145/3279778.3279795",
      "doi": "10.1145/3279778.3279795"
    },
    {
      "text": "Bernhard Brüning, Christian Schnier, Karola Pitsch, and Sven Wachsmuth. 2012. Integrating PAMOCAT in the Research Cycle: Linking Motion Capturing and Conversation Analysis. In Proceedings of the 14th ACM International Conference on Multimodal Interaction(ICMI ’12). ACM, New York, NY, USA, 201–208. https://doi.org/10.1145/2388676.2388716",
      "doi": "10.1145/2388676.2388716"
    },
    {
      "text": "Wolfgang Büschel, Jian Chen, Raimund Dachselt, Steven Drucker, Tim Dwyer, Carsten Görg, Tobias Isenberg, Andreas Kerren, Chris North, and Wolfgang Stuerzliner. 2018. Interaction for Immersive Analytics. Lecture Notes in Computer Science, Vol. 11190. Springer International Publishing, Cham, 95–138. https://doi.org/10.1007/978-3-030-01388-2_4",
      "doi": ""
    },
    {
      "text": "Wolfgang Büschel, Annett Mitschick, Thomas Meyer, and Raimund Dachselt. 2019. Investigating Smartphone-Based Pan and Zoom in 3D Data Spaces in Augmented Reality. In Proceedings of the 21st International Conference on Human-Computer Interaction with Mobile Devices and Services (Taipei, Taiwan) (MobileHCI ’19). ACM, New York, NY, USA, Article 2, 13 pages. https://doi.org/10.1145/3338286.3340113",
      "doi": "10.1145/3338286.3340113"
    },
    {
      "text": "Wolfgang Büschel, Patrick Reipschläger, Ricardo Langner, and Raimund Dachselt. 2017. Investigating the Use of Spatial Interaction for 3D Data Visualization on Mobile Devices. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (Brighton, United Kingdom) (ISS ’17). ACM, New York, NY, USA, 62–71. https://doi.org/10.1145/3132272.3134125",
      "doi": "10.1145/3132272.3134125"
    },
    {
      "text": "Wolfgang Büschel, Stefan Vogt, and Raimund Dachselt. 2019. Augmented Reality Graph Visualizations. IEEE Computer Graphics and Applications 39, 3 (2019), 29–40. https://doi.org/10.1109/MCG.2019.2897927",
      "doi": "10.1109/MCG.2019.2897927"
    },
    {
      "text": "Peter W. S. Butcher, Nigel W. John, and Panagiotis D. Ritsos. 2020. VRIA: A Web-based Framework for Creating Immersive Analytics Experiences. IEEE Transactions on Visualization and Computer Graphics (2020), 1–1. https://doi.org/10.1109/TVCG.2020.2965109",
      "doi": ""
    },
    {
      "text": "Simon Butscher, Sebastian Hubenschmid, Jens Müller, Johannes Fuchs, and Harald Reiterer. 2018. Clusters, Trends, and Outliers: How Immersive Technologies Can Facilitate the Collaborative Analysis of Multidimensional Data. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173664",
      "doi": "10.1145/3173574.3173664"
    },
    {
      "text": "Yuanzhi Cao, Tianyi Wang, Xun Qian, Pawan S. Rao, Manav Wadhawan, Ke Huo, and Karthik Ramani. 2019. GhostAR: A Time-space Editor for Embodied Authoring of Human-Robot Collaborative Task with Augmented Reality. In Proceedings of the 32Nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). ACM, New York, NY, USA, 521–534. https://doi.org/10.1145/3332165.3347902",
      "doi": "10.1145/3332165.3347902"
    },
    {
      "text": "Marco Cavallo, Mishal Dholakia, Matous Havlena, Kenneth Ocheltree, and Mark Podlaseck. 2019. Immersive Insights: A Hybrid Analytics System ForCollaborative Exploratory Data Analysis. In 25th ACM Symposium on Virtual Reality Software and Technology (Parramatta, NSW, Australia) (VRST ’19). ACM, New York, NY, USA, Article 9, 12 pages. https://doi.org/10.1145/3359996.3364242",
      "doi": "10.1145/3359996.3364242"
    },
    {
      "text": "Tom Chandler, Maxime Cordeil, Tobias Czauderna, Tim Dwyer, Jaroslaw Glowacki, Cagatay Goncu, Matthias Klapperstueck, Karsten Klein, Falk Schreiber, and Elliot Wilson. 2015. Immersive Analytics. In 2015 big data visual analytics (BDVA 2015) : Hobart, Australia, 22-25 September 2015. IEEE, Piscataway, NJ, 73–80. https://doi.org/10.1109/BDVA.2015.7314296",
      "doi": ""
    },
    {
      "text": "Luca Chittaro, Roberto Ranon, and Lucio Ieronutti. 2006. VU-Flow: A Visualization Tool for Analyzing Navigation in Virtual Environments. IEEE Transactions on Visualization and Computer Graphics 12, 6(2006), 1475–1485. https://doi.org/10.1109/TVCG.2006.109",
      "doi": "10.1109/TVCG.2006.109"
    },
    {
      "text": "Maxime Cordeil, Andrew Cunningham, Benjamin Bach, Christophe Hurter, Bruce H. Thomas, Kim Marriott, and Tim Dwyer. 2019. IATK: An Immersive Analytics Toolkit. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 200–209. https://doi.org/10.1109/VR.2019.8797978",
      "doi": ""
    },
    {
      "text": "Maxime Cordeil, Andrew Cunningham, Tim Dwyer, Bruce H. Thomas, and Kim Marriott. 2017. ImAxes: Immersive Axes as Embodied Affordances for Interactive Multivariate Data Visualisation. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). ACM, New York, NY, USA, 71–83. https://doi.org/10.1145/3126594.3126613",
      "doi": "10.1145/3126594.3126613"
    },
    {
      "text": "Paul Coulton, Will Bamford, Keith Cheverst, and Omer Rashid. 2008. 3D Space-Time Visualization of Player Behaviour in Pervasive Location-Based Games. Int. J. Comput. Games Technol. 2008 (Jan. 2008), 2:1–2:5. https://doi.org/10.1155/2008/192153",
      "doi": "10.1155/2008/192153"
    },
    {
      "text": "Marco Cristani, Loris Bazzani, Giulia Paggetti, Andrea Fossati, Diego Tosato, Alessio Del Bue, Gloria Menegaz, and Vittorio Murino. 2011. Social interaction discovery by statistical analysis of F-formations. In Proceedings of the British Machine Vision Conference. BMVA Press, 23.1–23.12.",
      "doi": ""
    },
    {
      "text": "Philip DeCamp, George Shaw, Rony Kubat, and Deb Roy. 2010. An Immersive System for Browsing and Visualizing Surveillance Video. In Proceedings of the 18th ACM International Conference on Multimedia (Firenze, Italy) (MM ’10). ACM, New York, NY, USA, 371–380. https://doi.org/10.1145/1873951.1874002",
      "doi": "10.1145/1873951.1874002"
    },
    {
      "text": "Anders Drachen and Alessandro Canossa. 2009. Analyzing Spatial User Behavior in Computer Games Using Geographic Information Systems. In Proceedings of the 13th International MindTrek Conference: Everyday Life in the Ubiquitous Era. ACM, 182–189. https://doi.org/10.1145/1621841.1621875",
      "doi": "10.1145/1621841.1621875"
    },
    {
      "text": "Neven ElSayed, Bruce Thomas, Kim Marriott, Julia Piantadosi, and Ross Smith. 2015. Situated Analytics. In 2015 Big Data Visual Analytics (BDVA). IEEE, 1–8. https://doi.org/10.1109/BDVA.2015.7314302",
      "doi": ""
    },
    {
      "text": "Andreas Fender, Philipp Herholz, Marc Alexa, and Jörg Müller. 2018. OptiSpace: Automated Placement of Interactive 3D Projection Mapping Content. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI ’18). ACM, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3173843",
      "doi": "10.1145/3173574.3173843"
    },
    {
      "text": "Andreas Fender, David Lindlbauer, Philipp Herholz, Marc Alexa, and Jörg Müller. 2017. HeatSpace: Automatic Placement of Displays by Empirical Analysis of User Behavior(UIST ’17). ACM, New York, NY, USA, 611–621. https://doi.org/10.1145/3126594.3126621",
      "doi": ""
    },
    {
      "text": "Adrien Fonnet and Yannick Prié. 2019. Survey of Immersive Analytics. IEEE Transactions on Visualization and Computer Graphics (2019), 1–1. https://doi.org/10.1109/TVCG.2019.2929033",
      "doi": ""
    },
    {
      "text": "Adam Fouse, Nadir Weibel, Edwin Hutchins, and James D. Hollan. 2011. ChronoViz: a system for supporting navigation of time-coded data. In Proceedings of the International Conference on Human Factors in Computing Systems, CHI 2011, Extended Abstracts Volume, Vancouver, BC, Canada, May 7-12, 2011. ACM, 299–304. https://doi.org/10.1145/1979742.1979706",
      "doi": "10.1145/1979742.1979706"
    },
    {
      "text": "Bruno Fruchard, Arnaud Prouzeau, Olivier Chapuis, and Eric Lecolinet. 2019. Leveraging Body Interactions to Support Immersive Analytics. In CHI Workshop on Immersive Analytics (Glasgow, United Kingdom). 10 pages. https://hal.archives-ouvertes.fr/hal-02095993",
      "doi": ""
    },
    {
      "text": "Robert Fuhrmann, Anke Lehmann, Annett Mitschick, Ricardo Langner, and Raimund Dachselt. 2020. CoFind: A Browser Plugin for Investigating Co-Located Collaborative Web Search. In Proceedings of the Conference on Mensch Und Computer (Magdeburg, Germany) (MuC ’20). ACM, New York, NY, USA, 425–429. https://doi.org/10.1145/3404983.3410012",
      "doi": "10.1145/3404983.3410012"
    },
    {
      "text": "Vanessa Georges, François Courtemanche, Sylvain Senecal, Thierry Baccino, Marc Fredette, and Pierre-Majorique Leger. 2016. UX Heatmaps: Mapping User Experience on Visual Interfaces. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 4850–4860. https://doi.org/10.1145/2858036.2858271",
      "doi": "10.1145/2858036.2858271"
    },
    {
      "text": "Saul Greenberg, Nicolai Marquardt, Till Ballendat, Rob Diaz-Marino, and Miaosen Wang. 2011. Proxemic Interactions: The New Ubicomp?interactions 18, 1 (Jan. 2011), 42–50. https://doi.org/10.1145/1897239.1897250",
      "doi": "10.1145/1897239.1897250"
    },
    {
      "text": "Yuejun Guo, Qing Xu, Xiu Li, Xiaoxiao Luo, and Mateu Sbert. 2014. A New Scheme for Trajectory Visualization. In 2014 18th International Conference on Information Visualisation. IEEE, 40–45. https://doi.org/10.1109/IV.2014.18",
      "doi": ""
    },
    {
      "text": "François Homps, Yohan Beugin, and Romain Vuillemot. 2020. ReViVD: Exploration and Filtering of Trajectories in an Immersive Environment using 3D Shapes. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 729–737. https://doi.org/10.1109/VR46266.2020.00096",
      "doi": ""
    },
    {
      "text": "Nate Hoobler, Greg Humphreys, and Maneesh Agrawala. 2004. Visualizing Competitive Behaviors in Multi-User Virtual Environments. In Proceedings of the Conference on Visualization ’04(VIS ’04). IEEE, Washington, DC, USA, 163–170. https://doi.org/10.1109/VISUAL.2004.120",
      "doi": "10.1109/VISUAL.2004.120"
    },
    {
      "text": "Christophe Hurter, Nathalie Henry Riche, Steven M. Drucker, Maxime Cordeil, Richard Alligier, and Romain Vuillemot. 2019. FiberClay: Sculpting Three Dimensional Trajectories to Reveal Structural Insights. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan 2019), 704–714. https://doi.org/10.1109/TVCG.2018.2865191",
      "doi": "10.1109/TVCG.2018.2865191"
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2015. Is Moving Improving?: Some Effects of Locomotion in Wall-Display Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 4169–4178. https://doi.org/10.1145/2702123.2702312",
      "doi": ""
    },
    {
      "text": "Mikkel R. Jakobsen and Kasper Hornbæk. 2016. Negotiating for Space?: Collaborative Work Using a Wall Display with Mouse and Touch Input. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 2050–2061. https://doi.org/10.1145/2858036.2858158",
      "doi": ""
    },
    {
      "text": "Raphaël James, Anastasia Bezerianos, Olivier Chapuis, Maxime Cordeil, Tim Dwyer, and Arnaud Prouzeau. 2020. Personal+Context navigation: combining AR and shared displays in Network Path-following. In Proceedings of Graphics Interface(GI ’20). CHCCS/SCDHM, Toronto, Canada. https://hal.archives-ouvertes.fr/hal-02860063",
      "doi": ""
    },
    {
      "text": "Sujin Jang, Niklas Elmqvist, and Karthik Ramani. 2014. GestureAnalyzer: Visual Analytics for Pattern Analysis of Mid-Air Hand Gestures. In Proceedings of the 2nd ACM Symposium on Spatial User Interaction (Honolulu, Hawaii, USA) (SUI ’14). ACM, New York, NY, USA, 30–39. https://doi.org/10.1145/2659766.2659772",
      "doi": "10.1145/2659766.2659772"
    },
    {
      "text": "Franziska Kahlert and Stefan Gumhold. 2020. Partial Matching of Trajectories with Particle Orientation for Exploratory Trajectory Visualization. In Vision, Modeling, and Visualization, Jens Krüger, Matthias Niessner, and Jörg Stückler (Eds.). The Eurographics Association. https://doi.org/10.2312/vmv.20201193",
      "doi": ""
    },
    {
      "text": "Daniel Kepplinger, Günter Wallner, Simone Kriglstein, and Michael Lankes. 2020. See, Feel, Move: Player Behaviour Analysis through Combined Visualization of Gaze, Emotions, and Movement. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376401",
      "doi": "10.1145/3313831.3376401"
    },
    {
      "text": "Ulrike Kister, Patrick Reipschläger, Fabrice Matulic, and Raimund Dachselt. 2015. BodyLenses: Embodied Magic Lenses and Personal Territories for Wall Displays. In Proceedings of the 2015 International Conference on Interactive Tabletops & Surfaces(Madeira, Portugal) (ITS ’15). ACM, New York, NY, USA, 117–126. https://doi.org/10.1145/2817721.2817726",
      "doi": "10.1145/2817721.2817726"
    },
    {
      "text": "Karsten Klein, Björn Sommer, Hieu T. Nim, Andrea Flack, Kamran Safi, Máté Nagy, Stefan P. Feyer, Ying Zhang, Kim Rehberg, Alexej Gluschkow, Michael Quetting, Wolfgang Fiedler, Martin Wikelski, and Falk Schreiber. 2019. Fly with the flock: immersive solutions for animal movement visualization and analytics. Journal of The Royal Society Interface 16, 153 (2019), 20180794. https://doi.org/10.1098/rsif.2018.0794",
      "doi": ""
    },
    {
      "text": "Simon Kloiber, Volker Settgast, Christoph Schinko, Martin Weinzerl, Johannes Fritz, Tobias Schreck, and Reinhold Preiner. 2020. Immersive analysis of user motion in VR applications. The Visual Computer (2020). https://doi.org/10.1007/s00371-020-01942-1",
      "doi": ""
    },
    {
      "text": "Ricardo Langner, Ulrike Kister, and Raimund Dachselt. 2019. Multiple Coordinated Views at Large Displays for Multiple Users: Empirical Findings on User Behavior, Movements, and Distances. IEEE Transactions on Visualization and Computer Graphics 25 (1 2019), 608–618. Issue 1. https://doi.org/10.1109/TVCG.2018.2865235",
      "doi": ""
    },
    {
      "text": "Joel Lanir, Peter Bak, and Tsvi Kuflik. 2014. Visualizing Proximity-Based Spatiotemporal Behavior of Museum Visitors Using Tangram Diagrams. Computer Graphics Forum 33, 3 (2014), 261–270. https://doi.org/10.1111/cgf.12382",
      "doi": ""
    },
    {
      "text": "Klemen Lilija, Henning Pohl, and Kasper Hornbæk. 2020. Who Put That There? Temporal Navigation of Spatial Recordings by Direct Manipulation. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–11. https://doi.org/10.1145/3313831.3376604",
      "doi": "10.1145/3313831.3376604"
    },
    {
      "text": "Can Liu, Olivier Chapuis, Michel Beaudouin-Lafon, Eric Lecolinet, and Wendy E. Mackay. 2014. Effects of Display Size and Navigation Type on a Classification Task. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 4147–4156. https://doi.org/10.1145/2556288.2557020",
      "doi": "10.1145/2556288.2557020"
    },
    {
      "text": "Tahir Mahmood, Willis Fulmer, Neelesh Mungoli, Jian Huang, and Aidong Lu. 2019. Improving Information Sharing and Collaborative Analysis for Remote GeoSpatial Visualization Using Mixed Reality. In 2019 IEEE International Symposium on Mixed and Augmented Reality (ISMAR). IEEE, 236–247. https://doi.org/10.1109/ISMAR.2019.00021",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Frederico Schardong, and Anthony Tang. 2015. EXCITE: EXploring Collaborative Interaction in Tracked Environments. In Human-Computer Interaction – INTERACT 2015, Julio Abascal, Simone Barbosa, Mirko Fetter, Tom Gross, Philippe Palanque, and Marco Winckler (Eds.). Lecture Notes in Computer Science, Vol. 9297. Springer International Publishing, 89–97. https://doi.org/10.1007/978-3-319-22668-2_8",
      "doi": ""
    },
    {
      "text": "Kim Marriott, Falk Schreiber, Tim Dwyer, Karsten Klein, Nathalie Henry Riche, Takayuki Itoh, Wolfgang Stuerzlinger, and Bruce H Thomas. 2018. Immersive Analytics. Vol. 11190. Springer.",
      "doi": ""
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2013. Patina: Dynamic Heatmaps for Visualizing Application Usage. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 3227–3236. https://doi.org/10.1145/2470654.2466442",
      "doi": "10.1145/2470654.2466442"
    },
    {
      "text": "Pejman Mirza-Babaei, Günter Wallner, Graham McAllister, and Lennart E. Nacke. 2014. Unified Visualization of Quantitative and Qualitative Playtesting Data. In Proceedings of the Extended Abstracts of the 32Nd Annual ACM Conference on Human Factors in Computing Systems(CHI EA ’14). ACM, New York, NY, USA, 1363–1368. https://doi.org/10.1145/2559206.2581224",
      "doi": "10.1145/2559206.2581224"
    },
    {
      "text": "Roshanak Zilouchian Moghaddam and Brian Bailey. 2011. VICPAM: A Visualization Tool for Examining Interaction Data in Multiple Display Environments. In Human Interface and the Management of Information. Interacting with Information, Michael J. Smith and Gavriel Salvendy (Eds.). Lecture Notes in Computer Science, Vol. 6771. Springer Berlin Heidelberg, 278–287. https://doi.org/10.1007/978-3-642-21793-7_32",
      "doi": "10.5555/2027916.2027951"
    },
    {
      "text": "Dinara Moura, Magy Seif el-Nasr, and Christopher D. Shaw. 2011. Visualizing and Understanding Players’ Behavior in Video Games: Discovering Patterns and Supporting Aggregation and Comparison. In Proceedings of the 2011 ACM SIGGRAPH Symposium on Video Games(Sandbox ’11). ACM, New York, NY, USA, 11–15. https://doi.org/10.1145/2018556.2018559",
      "doi": "10.1145/2018556.2018559"
    },
    {
      "text": "Michael Nebeling, David Ott, and Moira C. Norrie. 2015. Kinect Analysis: A System for Recording, Analysing and Sharing Multimodal Interaction Elicitation Studies. In Proceedings of the 7th ACM SIGCHI Symposium on Engineering Interactive Computing Systems (Duisburg, Germany) (EICS ’15). ACM, New York, NY, USA, 142–151. https://doi.org/10.1145/2774225.2774846",
      "doi": "10.1145/2774225.2774846"
    },
    {
      "text": "Michael Nebeling, Maximilian Speicher, Xizi Wang, Shwetha Rajaram, Brian D. Hall, Zijian Xie, Alexander R. E. Raistrick, Michelle Aebersold, Edward G. Happ, Jiayin Wang, Yanan Sun, Lotus Zhang, Leah E. Ramsier, and Rhea Kulkarni. 2020. MRAT: The Mixed Reality Analytics Toolkit. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3313831.3376330",
      "doi": "10.1145/3313831.3376330"
    },
    {
      "text": "Charilaos Papadopoulos, Ievgeniia Gutenko, and Arie E. Kaufman. 2016. VEEVVIE: Visual Explorer for Empirical Visualization, VR and Interaction Experiments. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan 2016), 111–120. https://doi.org/10.1109/TVCG.2015.2467954",
      "doi": "10.1109/TVCG.2015.2467954"
    },
    {
      "text": "Thies Pfeiffer. 2012. Measuring and Visualizing Attention in Space with 3D Attention Volumes. In Proceedings of the Symposium on Eye Tracking Research and Applications(ETRA ’12). ACM, New York, NY, USA, 29–36. https://doi.org/10.1145/2168556.2168560",
      "doi": "10.1145/2168556.2168560"
    },
    {
      "text": "Patrick Reipschläger, Tamara Flemisch, and Raimund Dachselt. 2020. Personal Augmented Reality for Information Visualization on Large Interactive Displays. IEEE Transactions on Visualization and Computer Graphics (2020). https://doi.org/10.1109/TVCG.2020.3030460",
      "doi": ""
    },
    {
      "text": "Roeland Scheepens, Niels Willems, Huub van de Wetering, and Jarke J. van Wijk. 2011. Interactive Visualization of Multivariate Trajectory Data with Density Maps. In 2011 IEEE Pacific Visualization Symposium. IEEE, 147–154. https://doi.org/10.1109/PACIFICVIS.2011.5742384",
      "doi": ""
    },
    {
      "text": "Stacey D. Scott, M. Sheelagh T. Carpendale, and Kori M. Inkpen. 2004. Territoriality in Collaborative Tabletop Workspaces. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (Chicago, Illinois, USA) (CSCW ’04). ACM, New York, NY, USA, 294–303. https://doi.org/10.1145/1031607.1031655",
      "doi": "10.1145/1031607.1031655"
    },
    {
      "text": "Ronell Sicat, Jiabao Li, Junyoung Choi, Maxime Cordeil, Won-Ki Jeong, Benjamin Bach, and Hanspeter Pfister. 2019. DXR: A Toolkit for Building Immersive Data Visualizations. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan 2019), 715–725. https://doi.org/10.1109/TVCG.2018.2865152",
      "doi": "10.1109/TVCG.2018.2865152"
    },
    {
      "text": "Richard Skarbez, Nicholas F. Polys, J. Todd Ogle, Chris North, and Doug A. Bowman. 2019. Immersive Analytics: Theory and Research Agenda. Frontiers in Robotics and AI 6 (2019), 82. https://doi.org/10.3389/frobt.2019.00082",
      "doi": ""
    },
    {
      "text": "Nathaniel Smith and Stéfan van der Walt. 2015. A better default colormap for Matplotlib. SciPy2015 (2015). URL: https://www.youtube.com/watch?v=xAoljeRJ3lU.",
      "doi": ""
    },
    {
      "text": "Yuki Sugita, Keita Higuchi, Ryo Yonetani, Rie Kamikubo, and Yoichi Sato. 2018. Browsing Group First-Person Videos with 3D Visualization. In Proceedings of the 2018 ACM International Conference on Interactive Surfaces and Spaces (Tokyo, Japan) (ISS ’18). ACM, New York, NY, USA, 55–60. https://doi.org/10.1145/3279778.3279783",
      "doi": "10.1145/3279778.3279783"
    },
    {
      "text": "Tianchen Sun, Yucong Ye, Issei Fujishiro, and Kwan-Liu Ma. 2019. Collaborative Visual Analysis with Multi-level Information Sharing Using a Wall-Size Display and See-Through HMDs. In 2019 IEEE Pacific Visualization Symposium (PacificVis). IEEE, 11–20. https://doi.org/10.1109/PacificVis.2019.00010",
      "doi": ""
    },
    {
      "text": "Anthony Tang, Michel Pahud, Sheelagh Carpendale, and Bill Buxton. 2010. VisTACO: Visualizing Tabletop Collaboration. In ACM International Conference on Interactive Tabletops and Surfaces(ITS ’10). ACM, New York, NY, USA, 29–38. https://doi.org/10.1145/1936652.1936659",
      "doi": "10.1145/1936652.1936659"
    },
    {
      "text": "Christian Tominski, Heidrun Schumann, Gennady Andrienko, and Natalia Andrienko. 2012. Stacking-Based Visualization of Trajectory Attribute Data. IEEE Transactions on Visualization and Computer Graphics 18, 12 (Dec. 2012), 2565–2574. https://doi.org/10.1109/TVCG.2012.265",
      "doi": "10.1109/TVCG.2012.265"
    },
    {
      "text": "Ulrich von Zadow, Daniel Bösel, Duc Dung Dam, Anke Lehmann, Patrick Reipschläger, and Raimund Dachselt. 2016. Miners: Communication and Awareness in Collaborative Gaming at an Interactive Display Wall. In Proceedings of the 2016 ACM International Conference on Interactive Surfaces and Spaces (Niagara Falls, ON, Canada). ACM, New York, NY, USA, 235–240. http://dx.doi.org/10.1145/2992154.2992174",
      "doi": "10.1145/2992154.2992174"
    },
    {
      "text": "Ulrich von Zadow and Raimund Dachselt. 2017. GIAnT: Visualizing Group Interaction at Large Wall Displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 2639–2647. https://doi.org/10.1145/3025453.3026006",
      "doi": "10.1145/3025453.3026006"
    },
    {
      "text": "Katerina Vrotsou, Halldor Janetzko, Carlo Navarra, Georg Fuchs, David Spretke, Florian Mansmann, Natalia Andrienko, and Gennady Andrienko. 2015. SimpliFly: A Methodology for Simplification and Thematic Enhancement of Trajectories. IEEE Transactions on Visualization and Computer Graphics 21, 1 (Jan. 2015), 107–121. https://doi.org/10.1109/TVCG.2014.2337333",
      "doi": ""
    },
    {
      "text": "Jorge A. Wagner Filho, Carla Freitas, and Luciana Nedel. 2018. VirtualDesk: A Comfortable and Efficient Immersive Information Visualization Approach. Computer Graphics Forum 37, 3 (2018), 415–426. https://doi.org/10.1111/cgf.13430",
      "doi": ""
    },
    {
      "text": "Jorge A. Wagner Filho, Wolfgang Stuerzlinger, and Luciana Nedel. 2020. Evaluating an Immersive Space-Time Cube Geovisualization for Intuitive Trajectory Data Exploration. IEEE Transactions on Visualization and Computer Graphics 26, 1 (Jan 2020), 514–524. https://doi.org/10.1109/TVCG.2019.2934415",
      "doi": ""
    },
    {
      "text": "Günter Wallner, Nour Halabi, and Pejman Mirza-Babaei. 2019. Aggregated Visualization of Playtesting Data. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 363:1–363:12. https://doi.org/10.1145/3290605.3300593",
      "doi": "10.1145/3290605.3300593"
    },
    {
      "text": "Günter Wallner and Simone Kriglstein. 2012. A Spatiotemporal Visualization Approach for the Analysis of Gameplay Data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). ACM, New York, NY, USA, 1115–1124. https://doi.org/10.1145/2207676.2208558",
      "doi": "10.1145/2207676.2208558"
    },
    {
      "text": "Evan Welbourne, Magdalena Balazinska, Gaetano Borriello, and James Fogarty. 2010. Specification and Verification of Complex Location Events with Panoramic. In Proceedings of the 8th International Conference on Pervasive Computing (Helsinki, Finland) (Pervasive’10). Springer-Verlag, Berlin, Heidelberg, 57–75. https://doi.org/10.1007/978-3-642-12654-3_4",
      "doi": "10.1007/978-3-642-12654-3_4"
    },
    {
      "text": "Yingcai Wu, Xiao Xie, Jiachen Wang, Dazhen Deng, Hongye Liang, Hui Zhang, Shoubin Cheng, and Wei Chen. 2019. ForVizor: Visualizing Spatio-Temporal Team Formations in Soccer. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan 2019), 65–75. https://doi.org/10.1109/TVCG.2018.2865041",
      "doi": "10.1109/TVCG.2018.2865041"
    },
    {
      "text": "Yalong Yang, Tim Dwyer, Bernhard Jenny, Kim Marriott, Maxime Cordeil, and Haohui Chen. 2019. Origin-Destination Flow Maps in Immersive Environments. IEEE Transactions on Visualization and Computer Graphics 25, 1 (Jan 2019), 693–703. https://doi.org/10.1109/TVCG.2018.2865192",
      "doi": "10.1109/TVCG.2018.2865192"
    },
    {
      "text": "Massimo Zancanaro, Tsvi Kuflik, Zvi Boger, Dina Goren-Bar, and Dan Goldwasser. 2007. Analyzing Museum Visitors’ Behavior Patterns. In User Modeling 2007(Lecture Notes in Computer Science), Cristina Conati, Kathleen McCoy, and Georgios Paliouras(Eds.). Springer Berlin Heidelberg, 238–246.",
      "doi": ""
    },
    {
      "text": "Fengyuan Zhu and Tovi Grossman. 2020. BISHARE: Exploring Bidirectional Interactions Between Smartphones and Head-Mounted Augmented Reality. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). ACM, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376233",
      "doi": "10.1145/3313831.3376233"
    }
  ]
}