{
  "doi": "10.1145/3411764.3445706",
  "title": "Living with Uncertainty and Stigma: Self-Experimentation and Support-Seeking around Polycystic Ovary Syndrome",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2021,
  "badges": [],
  "abstract": "Polycystic Ovary Syndrome (PCOS) is a condition that causes hormonal imbalance and infertility in women and people with female reproductive organs. PCOS causes different symptoms for different people, with no singular or universal cure. Being a stigmatized and enigmatic condition, it is challenging to discover, diagnose, and manage PCOS. This work aims to inform the design of inclusive health technologies through an understanding of people’s lived experiences and challenges with PCOS. We conducted semi-structured interviews with 10 women diagnosed with PCOS and analyzed a PCOS-specific subreddit forum. We report people’s support-seeking, sense-making, and self-experimentation practices, and find uncertainty and stigma to be key in shaping their unique experiences of the condition. We further identify potential avenues for designing technology to support their diverse needs, such as personalized and contextual tracking, accelerated self-discovery, and co-management, contributing to a growing body of HCI literature on stigmatized topics in women’s health and well-being.",
  "authors": [
    {
      "name": "Shaan Chopra",
      "institution": "College of Information Studies University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320191",
      "orcid": "missing"
    },
    {
      "name": "Rachael Zehrung",
      "institution": "Department of Computer Science University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702025",
      "orcid": "missing"
    },
    {
      "name": "Tamil Arasu Shanmugam",
      "institution": "Institute for Systems Research University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701387",
      "orcid": "missing"
    },
    {
      "name": "Eun Kyoung Choe",
      "institution": "College of Information Studies University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608724",
      "orcid": "0000-0001-5038-8320"
    }
  ],
  "references": [
    {
      "text": "Teresa Almeida, Rob Comber, and Madeline Balaam. 2016. HCI and Intimate Care As an Agenda for Change in Women’s Health. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2599–2611.",
      "doi": "10.1145/2858036.2858187"
    },
    {
      "text": "Teresa Almeida, Rob Comber, Patrick Olivier, and Madeline Balaam. 2014. Intimate Care: Exploring eTextiles for Teaching Female Pelvic Fitness. In Proceedings of the 2014 Companion Publication on Designing Interactive Systems. ACM, New York, NY, USA, 5–8.",
      "doi": "10.1145/2598784.2602768"
    },
    {
      "text": "Teresa Almeida, Rob Comber, Gavin Wood, Dean Saraf, and Madeline Balaam. 2016. On Looking at the Vagina through Labella. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1810–1821.",
      "doi": "10.1145/2858036.2858119"
    },
    {
      "text": "Sarah Alsamarai, Judith M Adams, M. K. Murphy, M. D. Post, Douglas Hayden, Janet E Hall, and Corrine K Welt. 2009. Criteria for polycystic ovarian morphology in polycystic ovary syndrome as a function of age. The Journal of Clinical Endocrinology & Metabolism 94, 12(2009), 4961–4970.",
      "doi": ""
    },
    {
      "text": "Tawfiq Ammari, Sarita Schoenebeck, and Daniel M Romero. 2018. Pseudonymous parents: Comparing parenting roles and identities on the Mommit and Daddit subreddits. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3174063"
    },
    {
      "text": "Nazanin Andalibi. 2019. What Happens After Disclosing Stigmatized Experiences on Identified Social Media: Individual, Dyadic, and Social/Network Outcomes. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article 137, 15 pages.",
      "doi": "10.1145/3290605.3300367"
    },
    {
      "text": "Nazanin Andalibi and Andrea Forte. 2018. Announcing Pregnancy Loss on Facebook: A Decision-Making Framework for Stigmatized Disclosures on Identified Social Network Sites. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article 158, 14 pages.",
      "doi": "10.1145/3173574.3173732"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2015. Depression-Related Imagery on Instagram. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing. Association for Computing Machinery, New York, NY, USA, 231–234.",
      "doi": "10.1145/2685553.2699014"
    },
    {
      "text": "American Diabetes Association. 2020. Statistics About Diabetes. https://www.diabetes.org/resources/statistics/statistics-about-diabetes. Accessed on (2020/09/01).",
      "doi": ""
    },
    {
      "text": "Ava. 2020. Ava. https://www.avawomen.com/. Accessed on (2020/06/09).",
      "doi": ""
    },
    {
      "text": "Amid Ayobi, Paul Marshall, Anna L. Cox, and Yunan Chen. 2017. Quantifying the Body and Caring for the Mind: Self-Tracking in Multiple Sclerosis. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 6889–6901.",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Madeline Balaam, Rob Comber, Ed Jenkins, Selina Sutton, and Andrew Garbett. 2015. FeedFinder: A Location-Mapping Mobile Application for Breastfeeding Women. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1709–1718.",
      "doi": "10.1145/2702123.2702328"
    },
    {
      "text": "Madeline Balaam, Lone Koefoed Hansen, Catherine D’Ignazio, Emma Simpson, Teresa Almeida, Stacey Kuznetsov, Mike Catt, and Marie L. J. Søndergaard. 2017. Hacking Women’s Health. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, New York, NY, USA, 476–483.",
      "doi": ""
    },
    {
      "text": "Jeffrey Bardzell, Shaowen Bardzell, Amanda Lazar, and Norman Makoto Su. 2019. (Re-)Framing Menopause Experiences for HCI and Design. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article 115, 13 pages.",
      "doi": "10.1145/3290605.3300345"
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: Taking Stock and Outlining an Agenda for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Erin K Barthelmess and Rajesh K Naz. 2014. Polycystic ovary syndrome: current status and future perspective. Frontiers in bioscience (Elite edition) 6 (1 January 2014), 104–119.",
      "doi": ""
    },
    {
      "text": "Amna Batool, Samia Razaq, Maham Javaid, Beenish Fatima, and Kentaro Toyama. 2017. Maternal Complications: Nuances in Mobile Interventions for Maternal Health in Urban Pakistan. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development. ACM, New York, NY, USA, Article 3, 12 pages.",
      "doi": "10.1145/3136560.3136573"
    },
    {
      "text": "Lindsay Blackwell, Jean Hardy, Tawfiq Ammari, Tiffany Veinot, Cliff Lampe, and Sarita Schoenebeck. 2016. LGBT Parents and Social Media: Advocacy, Privacy, and Disclosure during Shifting Social Movements. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 610–622.",
      "doi": "10.1145/2858036.2858342"
    },
    {
      "text": "Erik Blair. 2015. A reflexive exploration of two qualitative data coding techniques. Journal of Methods and Measurement in the Social Sciences 6, 1(2015), 14.",
      "doi": ""
    },
    {
      "text": "Nathan Bos, Karrie Karahalios, Marcela Musgrove-Chávez, Erika Shehan Poole, John Charles Thomas, and Sarita Yardi. 2009. Research Ethics in the Facebook Era: Privacy, Anonymity, and Oversight. In CHI ’09 Extended Abstracts on Human Factors in Computing Systems. ACM, New York, NY, USA, 2767–2770.",
      "doi": ""
    },
    {
      "text": "Sarah Buhr. 2019. Period app Clue hopes to find out if you have PCOS. https://techcrunch.com/2019/09/04/period-app-clue-hopes-to-predict-if-you-have-pcos/. Accessed on (2019/09/12).",
      "doi": ""
    },
    {
      "text": "Nadia Campo Woytuk, Linette Nilsson, and Mingxing Liu. 2019. Your Period Rules: Design Implications for Period-Positive Technologies. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article LBW0137, 6 pages.",
      "doi": "10.1145/3290607.3312888"
    },
    {
      "text": "Nadia Campo Woytuk, Marie Louise Juul Søndergaard, Marianela Ciolfi Felice, and Madeline Balaam. 2020. Touching and Being in Touch with the Menstruating Body. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–14.",
      "doi": "10.1145/3313831.3376471"
    },
    {
      "text": "CareTogether. 2020. CareTogether. https://caretogether.com/. Accessed on (2020/06/09).",
      "doi": ""
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer Visibility: Supporting LGBT+ Selective Visibility on Social Media. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–12.",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017. Understanding self-reflection: how people reflect on personal data through visual data exploration. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare. Association for Computing Machinery, New York, NY, USA, 173–182.",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B Lee, Bongshin Lee, Wanda Pratt, and Julie A Kientz. 2014. Understanding quantified-selfers’ practices in collecting and exploring personal data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1143–1152.",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Clue. 2019. Track your period and ovulation with Clue to understand how your body works. https://helloclue.com. Accessed on (2019/09/12).",
      "doi": ""
    },
    {
      "text": "Glow Apps & Community. 2020. Glow. https://glowing.com/apps#glow. Accessed on (2020/06/09).",
      "doi": ""
    },
    {
      "text": "Humanite Corp. 2019. PCOS Guide - Fight PCOS Naturally. https://play.google.com/store/apps/details?id=in.humanite.pcosguide&hl=en_US. Accessed on (2019/09/12).",
      "doi": ""
    },
    {
      "text": "Mayara Costa Figueiredo. 2020. Self-Tracking for Fertility Care: A Holistic Approach. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–9.",
      "doi": ""
    },
    {
      "text": "Cycles. 2020. Cycles. https://cycles.app/. Accessed on (2020/06/09).",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury and Sushovan De. 2014. Mental Health Discourse on reddit: Self-Disclosure, Social Support, and Anonymity. Proceedings of the International AAAI Conference on Web and Social Media 8, 1 (May 2014).",
      "doi": ""
    },
    {
      "text": "Microsoft Design. 2020. Inclusive Design. https://www.microsoft.com/design/inclusive/. Accessed on (2020/09/16).",
      "doi": ""
    },
    {
      "text": "Catherine D’Ignazio, Alexis Hope, Becky Michelson, Robyn Churchill, and Ethan Zuckerman. 2016. A Feminist HCI Approach to Designing Postpartum Technologies: ”When I First Saw a Breast Pump I Was Wondering if It Was a Joke”. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2612–2622.",
      "doi": "10.1145/2858036.2858460"
    },
    {
      "text": "Anna Eaglin and Shaowen Bardzell. 2011. Sex Toys and Designing for Sexual Wellness. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada). ACM, New York, NY, USA, 1837–1842.",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, Nicole B. Lee, Jennifer H. Kang, Elena Agapie, Jessica Schroeder, Laura R. Pina, James Fogarty, Julie A. Kientz, and Sean Munson. 2017. Examining Menstrual Tracking to Inform the Design of Personal Informatics Tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 6876–6888.",
      "doi": "10.1145/3025453.3025635"
    },
    {
      "text": "Indira IVF: Fertility and IVF Center. 2019. Types of PCOS and what kind do you have?https://www.indiraivf.com/types-of-pcos/. Accessed on (2020/06/09).",
      "doi": ""
    },
    {
      "text": "Ashley Fetters. 2018. How Fertility Apps Exclude Fathers. https://www.theatlantic.com/family/archive/2018/08/how-fertility-apps-exclude-fathers/567721/. Accessed on (2020/09/01).",
      "doi": ""
    },
    {
      "text": "Mayara Costa Figueiredo, Clara Caldeira, Elizabeth Victoria Eikey, Melissa Mazmanian, and Yunan Chen. 2018. Engaging with Health Data. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–20.",
      "doi": "10.1145/3274309"
    },
    {
      "text": "Mayara Costa Figueiredo, Clara Caldeira, Tera L. Reynolds, Sean Victory, Kai Zheng, and Yunan Chen. 2017. Self-Tracking for Fertility Care. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (Dec. 2017), 1–21.",
      "doi": "10.1145/3134671"
    },
    {
      "text": "Margaret Flemings, Shanzay Kazmi, Rachel Pak, and Orit Shaer. 2018. Crimson Wave: Shedding Light on Menstrual Health. In Proceedings of the Twelfth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, New York, NY, USA, 343–348.",
      "doi": "10.1145/3173225.3173292"
    },
    {
      "text": "Flo. 2019. Flo. https://flo.health/. Accessed on (2019/09/12).",
      "doi": ""
    },
    {
      "text": "Sarah Fox, Noura Howell, Richmond Wong, and Franchesca Spektor. 2019. Vivewell: Speculating Near-Future Menstrual Tracking Through Current Data Practices. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, New York, NY, USA, 541–552.",
      "doi": "10.1145/3322276.3323695"
    },
    {
      "text": "Sarah E. Fox, Amanda Menking, Jordan Eschler, and Uba Backonja. 2020. Multiples Over Models: Interrogating the Past and Collectively Reimagining the Future of Menstrual Sensemaking. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 22 (Sept. 2020), 24 pages.",
      "doi": "10.1145/3397178"
    },
    {
      "text": "Mark S Frankel and Sanyin Siang. 1999. Ethical and legal aspects of human subjects research on the Internet.",
      "doi": ""
    },
    {
      "text": "Leap Fitness Group. 2019. Period Tracker, Ovulation Calendar & Fertility app. https://play.google.com/store/apps/details?id=periodtracker.pregnancy.ovulationtracker&hl=en_US. Accessed on (2019/09/12).",
      "doi": ""
    },
    {
      "text": "Xinning Gui, Yu Chen, Yubo Kou, Katie Pine, and Yunan Chen. 2017. Investigating support seeking from peers for pregnancy in online health communities. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–19.",
      "doi": "10.1145/3134685"
    },
    {
      "text": "Mark S. Handcock and Krista J. Gile. 2011. On the Concept of Snowball Sampling. arxiv:1108.0301 [stat.AP]",
      "doi": ""
    },
    {
      "text": "Blake W. Hawkins and Oliver Haimson. 2018. Building an Online Community of Care: Tumblr Use by Transgender Individuals. In Proceedings of the 4th Conference on Gender & IT. ACM, New York, NY, USA, 75–77.",
      "doi": ""
    },
    {
      "text": "WEGO Health. 2014. The #PCOS Path – A Journey with Polycystic Ovary Syndrome. https://www.wegohealth.com/2014/12/25/the-pcos-path-a-journey-with-polycystic-ovary-syndrome/. Accessed on (2020/05/24).",
      "doi": ""
    },
    {
      "text": "Sarah Homewood. 2018. Designing for the Changing Body: A Feminist Exploration of Self-Tracking Technologies. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–4.",
      "doi": "10.1145/3170427.3173031"
    },
    {
      "text": "Sarah Homewood. 2019. Inaction As a Design Decision: Reflections on Not Designing Self-Tracking Tools for Menopause. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article alt17, 12 pages.",
      "doi": "10.1145/3290607.3310430"
    },
    {
      "text": "Apollo Cradle & Children’s Hospital. 2020. What is Difference between PCOD vs PCOS?https://bit.ly/32Fy3Fq. Accessed on (2020/08/10).",
      "doi": ""
    },
    {
      "text": "Zhongwei Huang and Eu-Leong Yong. 2016. Ethnic differences: Is there an Asian phenotype for polycystic ovarian syndrome?Best Practice & Research Clinical Obstetrics & Gynaecology 37 (2016), 46–55.",
      "doi": ""
    },
    {
      "text": "Jina Huh and Mark S. Ackerman. 2012. Collaborative Help in Chronic Disease Management: Supporting Individualized Problems. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’12). Association for Computing Machinery, New York, NY, USA, 853–862.",
      "doi": "10.1145/2145204.2145331"
    },
    {
      "text": "Maia Jacobs, Galina Gheihman, Krzysztof Z. Gajos, and Anoopum S. Gupta. 2019. ”I Think We Know More than Our Doctors”: How Primary Caregivers Manage Care Teams with Limited Disease-Related Expertise. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 159 (Nov. 2019), 22 pages.",
      "doi": "10.1145/3359261"
    },
    {
      "text": "Minal Jain and Pradeep Yammiyavar. 2015. Game based learning tool seeking peer support for empowering adolescent girls in rural Assam. In Proceedings of the 14th International Conference on Interaction Design and Children. ACM, New York, NY, USA, 275–278.",
      "doi": "10.1145/2771839.2771895"
    },
    {
      "text": "Gopinaath Kannabiran, Alex A. Ahmed, Matthew Wood, Madeline Balaam, Joshua G. Tanenbaum, Shaowen Bardzell, and Jeffrey Bardzell. 2018. Design for Sexual Wellbeing in HCI. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article W09, 7 pages.",
      "doi": ""
    },
    {
      "text": "Ravi Karkar, James Fogarty, Julie A. Kientz, Sean A. Munson, Roger Vilardaga, and Jasmine Zia. 2015. Opportunities and Challenges for Self-Experimentation in Self-Tracking. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (Osaka, Japan) (UbiComp/ISWC’15 Adjunct). Association for Computing Machinery, New York, NY, USA, 991–996.",
      "doi": ""
    },
    {
      "text": "Ravi Karkar, Jessica Schroeder, Daniel A. Epstein, Laura R. Pina, Jeffrey Scofield, James Fogarty, Julie A. Kientz, Sean A. Munson, Roger Vilardaga, and Jasmine Zia. 2017. TummyTrials: A Feasibility Study of Using Self-Experimentation to Detect Individualized Food Triggers. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 6850–6863.",
      "doi": "10.1145/3025453.3025480"
    },
    {
      "text": "Ravi Karkar, J. Zia, Roger Vilardaga, S. Mishra, J. Fogarty, S. Munson, and J. Kientz. 2016. A framework for self-experimentation in personalized health. Journal of the American Medical Informatics Association : JAMIA 23 3 (2016), 440–8.",
      "doi": ""
    },
    {
      "text": "Jin Ju Kim and Young Min Choi. 2019. Phenotype and genotype of polycystic ovary syndrome in Asia: Ethnic differences. Journal of Obstetrics and Gynaecology Research 45, 12 (Oct. 2019), 2330–2337.",
      "doi": ""
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Bongshin Lee, Eun Kyoung Choe, and Jinwook Seo. 2017. OmniTrack: A Flexible Self-Tracking Approach Leveraging Semi-Automated Tracking. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 67 (Sept. 2017), 28 pages.",
      "doi": "10.1145/3130930"
    },
    {
      "text": "Robert Kowalczyk, Violetta Skrzypulec, Zbigniew Lew-starowicz, Krzysztof Nowosielski, Bartosz Grabski, and Wojciech Merk. 2012. Psychological gender of patients with polycystic ovary syndrome. Acta Obstetricia et Gynecologica Scandinavica 91, 6 (May 2012), 710–714.",
      "doi": ""
    },
    {
      "text": "Neha Kumar and Richard J. Anderson. 2015. Mobile Phones for Maternal Health in Rural India. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 427–436.",
      "doi": "10.1145/2702123.2702258"
    },
    {
      "text": "Neha Kumar, Daniel A. Epstein, Catherine D’Ignazio, Amanda Lazar, Andrea Parker, Muge Haseki, and Anupriya Tuli. 2019. Women’s Health, Wellbeing, & Empowerment. In Conference Companion Publication of the 2019 on Computer Supported Cooperative Work and Social Computing (Austin, TX, USA) (CSCW ’19). Association for Computing Machinery, New York, NY, USA, 116–121.",
      "doi": "10.1145/3311957.3358606"
    },
    {
      "text": "P-M Lam and N Raine-Fenning. 2009. Polycystic ovarian syndrome: a misnomer for an enigmatic disease. Ultrasound in Obstetrics and Gynecology: The Official Journal of the International Society of Ultrasound in Obstetrics and Gynecology 33, 6(2009), 621–627.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Norman Makoto Su, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Parting the Red Sea: Sociotechnical Systems and Lived Experiences of Menopause. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article 480, 16 pages.",
      "doi": "10.1145/3290605.3300710"
    },
    {
      "text": "Mirim Lee, Bon-chang Koo, Hee-seok Jeong, Joongsin Park, Juhee Cho, and Jun-dong Cho. 2015. Understanding Women’s Needs in Menopause for Development of MHealth. In Proceedings of the 2015 Workshop on Pervasive Wireless Healthcare. ACM, New York, NY, USA, 51–56.",
      "doi": "10.1145/2757290.2757295"
    },
    {
      "text": "Guo Li, Xiaomu Zhou, Tun Lu, Jiang Yang, and Ning Gu. 2016. SunForum: Understanding Depression in a Chinese Online Community. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). ACM, New York, NY, USA, 515–526.",
      "doi": "10.1145/2818048.2819994"
    },
    {
      "text": "GP International LLC. 2019. Period Tracker. https://play.google.com/store/apps/details?id=com.period.tracker.lite&hl=en_US. Accessed on (2019/09/12).",
      "doi": ""
    },
    {
      "text": "Yuhan Luo, Peiyi Liu, and Eun Kyoung Choe. 2019. Co-Designing Food Trackers with Dietitians: Identifying Design Opportunities for Food Tracker Customization. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": "10.1145/3290605.3300822"
    },
    {
      "text": "Haley MacLeod, Ben Jelen, Annu Prabhakar, Lora Oehlberg, Katie Siek, and Kay Connelly. 2016. Asynchronous Remote Communities (ARC) for Researching Distributed Populations. In Proceedings of the 10th EAI International Conference on Pervasive Computing Technologies for Healthcare. ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), Brussels, BEL, 1–8.",
      "doi": ""
    },
    {
      "text": "Haley MacLeod, Kim Oakes, Danika Geisler, Kay Connelly, and Katie Siek. 2015. Rare World: Towards Technology for Rare Diseases. In Proceedings of the 33rd Annual ACM Conference on human factors in computing systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1145–1154.",
      "doi": "10.1145/2702123.2702494"
    },
    {
      "text": "Juan F. Maestre, Haley MacLeod, Ciabhan L. Connelly, Julia C. Dunbar, Jordan Beck, Katie A. Siek, and Patrick C. Shih. 2018. Defining Through Expansion: Conducting Asynchronous Remote Communities (ARC) Research with Stigmatized Groups. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3174131"
    },
    {
      "text": "Racheli Magnezi, Yoav S Bergman, and Dafna Grosberg. 2014. Online activity and participation in treatment affects the perceived efficacy of social health networks among patients with chronic illness. Journal of medical Internet research 16, 1 (2014), e12.",
      "doi": ""
    },
    {
      "text": "Mollie McKillop, Lena Mamykina, and Noémie Elhadad. 2018. Designing in the Dark: Eliciting Self-Tracking Dimensions for Understanding Enigmatic Disease. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–15.",
      "doi": "10.1145/3173574.3174139"
    },
    {
      "text": "Jochen Meyer, Judy Kay, Daniel A. Epstein, Parisa Eslambolchilar, and Lie Ming Tang. 2020. A Life of Data: Characteristics and Challenges of Very Long Term Self-Tracking for Health and Wellness. ACM Trans. Comput. Healthcare 1, 2, Article 11 (March 2020), 4 pages.",
      "doi": "10.1145/3373719"
    },
    {
      "text": "Lydia Michie, Madeline Balaam, John McCarthy, Timur Osadchiy, and Kellie Morrissey. 2018. From Her Story, to Our Story: Digital Storytelling as Public Engagement around Abortion Rights Advocacy in Ireland. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–15.",
      "doi": "10.1145/3173574.3173931"
    },
    {
      "text": "Sonali R Mishra, Predrag Klasnja, John MacDuffie Woodburn, Eric B Hekler, Larsson Omberg, Michael Kellen, and Lara Mangravite. 2019. Supporting Coping with Parkinson’s Disease Through Self Tracking. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–16.",
      "doi": "10.1145/3290605.3300337"
    },
    {
      "text": "myPCOSteam. 2019. myPCOSteam. https://www.mypcosteam.com/. Accessed on (2019/09/12).",
      "doi": ""
    },
    {
      "text": "Meena Natarajan and Tapan Parikh. 2013. Understanding Barriers to Information Access and Disclosure for HIV+ Women. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1. ACM, New York, NY, USA, 143–152.",
      "doi": "10.1145/2516604.2516627"
    },
    {
      "text": "Sarah Nettleton, Lisa O’Malley, Ian Watt, and Philip Duffey. 2004. Enigmatic Illness: Narratives of Patients who Live with Medically Unexplained Symptoms. Social Theory & Health 2 (02 2004), 47–66.",
      "doi": ""
    },
    {
      "text": "PR Newswire. 2019. Flo Launches PCOS Health Assistant; Digital Pre-Diagnostic Tool Assists Women in Identifying Women’s Health Disorder. https://www.prnewswire.com/news-releases/flo-launches-pcos-health-assistant-digital-pre-diagnostic-tool-assists-women-in-identifying-womens-health-disorder-300911090.html. Accessed on (2020/09/01).",
      "doi": ""
    },
    {
      "text": "Ernest Yu Ng and Pak Ho. 2008. Polycystic Ovary Syndrome in Asian Women. Seminars in Reproductive Medicine 26, 1 (Jan. 2008), 014–021.",
      "doi": ""
    },
    {
      "text": "Office on Women’s Health in the U.S. Department of Health and Human Services. 2019. Polycystic ovary syndrome. https://www.womenshealth.gov/a-z-topics/polycystic-ovary-syndrome. Accessed on (2019/09/14).",
      "doi": ""
    },
    {
      "text": "Tyler Pace, Shaowen Bardzell, and Jeffrey Bardzell. 2010. The Rogue in the Lovely Black Dress: Intimacy in World of Warcraft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 233–242.",
      "doi": "10.1145/1753326.1753361"
    },
    {
      "text": "PatientsLikeMe. 2020. PatientsLikeMe. https://www.patientslikeme.com/. Accessed on (2020/06/09).",
      "doi": ""
    },
    {
      "text": "Tamara Peyton, Erika Poole, Madhu Reddy, Jennifer Kraschnewski, and Cynthia Chuang. 2014. Information, sharing and support in pregnancy: addressing needs for mHealth design. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, New York, NY, USA, 213–216.",
      "doi": "10.1145/2556420.2556489"
    },
    {
      "text": "Annu Sible Prabhakar, Erik Stolterman, and Selma Šabanović. 2019. Understanding Life Transitions: A Case Study of Support Needs of Low-Income Mothers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article 648, 10 pages.",
      "doi": "10.1145/3290605.3300878"
    },
    {
      "text": "Shikha Prakash. 2018. PCOS: A lifestyle disorder. https://bit.ly/2FLNm6s. Accessed on (2020/09/01).",
      "doi": ""
    },
    {
      "text": "PsychCentral. 2020. PsychCentral. https://psychcentral.com/. Accessed on (2020/06/09).",
      "doi": ""
    },
    {
      "text": "Pallavi Pundir. 2019. Unscrewing Ourselves: What We Talk About When We Talk About PCOS. https://www.vice.com/en_asia/article/zmae5j/social-stigma-polycystic-ovarian-syndrome-pcos. Accessed on (2020/05/24).",
      "doi": ""
    },
    {
      "text": "Sunita J Ramanand, Jaiprakash B Ramanand, Ravi R Ghanghas, Balasaheb B Ghongane, Suyog S Jain, and Milind H Patwardhan. 2013. Clinical characteristics of polycystic ovary syndrome in Indian women. Indian Journal of Endocrinology and Metabolism 17, 1(2013), 138.",
      "doi": ""
    },
    {
      "text": "Hanna Schneider, Julia Wayrauther, Mariam Hassib, and Andreas Butz. 2019. Communicating Uncertainty in Fertility Prognosis. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–11.",
      "doi": "10.1145/3290605.3300391"
    },
    {
      "text": "Jessica Schroeder, Chia-Fang Chung, Daniel A. Epstein, Ravi Karkar, Adele Parsons, Natalia Murinova, James Fogarty, and Sean A. Munson. 2018. Examining Self-Tracking by People with Migraine: Goals, Needs, and Opportunities in a Chronic Health Condition. In Proceedings of the 2018 Designing Interactive Systems Conference. ACM, New York, NY, USA, 135–148.",
      "doi": "10.1145/3196709.3196738"
    },
    {
      "text": "Jessica Schroeder, Ravi Karkar, James Fogarty, Julie A. Kientz, Sean A. Munson, and Matthew Kay. 2018. A Patient-Centered Proposal for Bayesian Analysis of Self-Experiments for Health. Journal of Healthcare Informatics Research 3, 1 (Sept. 2018), 124–155.",
      "doi": ""
    },
    {
      "text": "Eva Sharma and Munmun De Choudhury. 2018. Mental Health Support and Its Relationship to Linguistic Accommodation in Online Communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–13.",
      "doi": "10.1145/3173574.3174215"
    },
    {
      "text": "Swati Sharma and Anindya J. Mishra. 2018. Tabooed disease in alienated bodies: A study of women suffering from Polycystic Ovary Syndrome (PCOS). Clinical Epidemiology and Global Health 6, 3 (Sept. 2018), 130–136.",
      "doi": ""
    },
    {
      "text": "Natasha Singer. 2019. Period-Tracking Apps Say You May Have a Disorder. What if They’re Wrong?https://www.nytimes.com/2019/10/27/technology/personaltech/health-apps-hormonal-disorder-pcos.html. Accessed on (2020/09/01).",
      "doi": ""
    },
    {
      "text": "Piya Sorcar, Benjamin Strauber, Prashant Loyalka, Neha Kumar, and Shelley Goldman. 2017. Sidestepping the Elephant in the Classroom: Using Culturally Localized Technology To Teach Around Taboos. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2792–2804.",
      "doi": "10.1145/3025453.3025958"
    },
    {
      "text": "Sputniko!2010. Menstruation Machine - Takashi’s Take (2010). https://sputniko.com/Menstruation-Machine. Accessed on (2020/07/27).",
      "doi": ""
    },
    {
      "text": "Joely Straseski and Grace Mahony Kroner. 2019. Diagnosing PCOS: What Are the Challenges and How Can We Improve?https://bit.ly/3mwOiMQ. Accessed on (2020/09/01).",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. Thousand Oaks, CA: Sage Publications, Inc.",
      "doi": ""
    },
    {
      "text": "Frederic Stutzman and Woodrow Hartzog. 2012. Boundary Regulation in Social Media. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (Seattle, Washington, USA) (CSCW ’12). Association for Computing Machinery, New York, NY, USA, 769–778.",
      "doi": "10.1145/2145204.2145320"
    },
    {
      "text": "Helena J Teede, Marie L Misso, Michael F Costello, Anuja Dokras, Joop Laven, Lisa Moran, Terhi Piltonen, Robert J Norman, Marianne Andersen, Ricardo Azziz, Adam Balen, Estifanos Baye, Jacqueline Boyle, Leah Brennan, Frank Broekmans, Preeti Dabadghao, Luigi Devoto, Didier Dewailly, Linda Downes, Bart Fauser, Stephen Franks, Rhonda M Garad, Melanie Gibson-Helm, Cheryce Harrison, Roger Hart, Rachel Hawkes, Angelica Hirschberg, Kathleen Hoeger, Femke Hohmann, Samantha Hutchison, Anju Joham, Louise Johnson, Cailin Jordan, Jayashri Kulkarni, Richard S Legro, Rong Li, Marla Lujan, Jaideep Malhotra, Darren Mansfield, Kate Marsh, Veryan McAllister, Edgar Mocanu, Ben W Mol, Ernest Ng, Sharon Oberfield, Sasha Ottey, Alexia Peña, Jie Qiao, Leanne Redman, Raymond Rodgers, Luk Rombauts, Daniela Romualdi, Duru Shah, Jane Speight, Poli Mara Spritzer, Elisabet Stener-Victorin, Nigel Stepto, Juha S Tapanainen, Eliza C Tassone, Shakila Thangaratinam, Mala Thondan, Chii-Ruey Tzeng, Zephne van der Spuy, Eszter Vanky, Maria Vogiatzi, Angela Wan, Chandrika Wijeyaratne, Selma Witchel, Jane Woolcock, and Bulent O Yildiz and. 2018. Recommendations from the international evidence-based guideline for the assessment and management of polycystic ovary syndrome. Human Reproduction 33, 9 (July 2018), 1602–1618.",
      "doi": ""
    },
    {
      "text": "Lisa Thomas, Elizabeth Sillence, Vicky Elsey, Emma Simpson, and Louise Moody. 2019. Technology to Mediate Role Conflict in Motherhood. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article W05, 8 pages.",
      "doi": "10.1145/3290607.3299024"
    },
    {
      "text": "Cassandra Thorpe, Kelly J Arbeau, and Benjamin Budlong. 2019. ‘I drew the parts of my body in proportion to how much PCOS ruined them’: Experiences of polycystic ovary syndrome through drawings. Health Psychology Open 6, 2 (2019), 2055102919896238.",
      "doi": ""
    },
    {
      "text": "Giulia Tomasello. 2019. Future Flora. http://gitomasello.com/future-flora. Accessed on (2020/05/21).",
      "doi": ""
    },
    {
      "text": "Maria Dolores C. Tongco. 2007. Purposive Sampling as a Tool for Informant Selection. Ethnobotany Research and Applications 5 (2007), 147–158.",
      "doi": ""
    },
    {
      "text": "Bonnie Tran and Lee Na Choi. 2018. Menstrual Maze: A Toy Exploring Public Engagement in Menstrual Health Education. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article SDC10, 6 pages.",
      "doi": "10.1145/3170427.3180649"
    },
    {
      "text": "TrialX. 2019. PCOS Tracker by TrialX. https://play.google.com/store/apps/details?id=com.appliedinformatics.android.web2rk.pcostracker42&hl=en_US. Accessed on (2019/09/12).",
      "doi": ""
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Neha Kumar, and Pushpendra Singh. 2018. Learning from and with Menstrupedia: Towards Menstrual Health Education in India. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 174 (Nov. 2018), 20 pages.",
      "doi": "10.1145/3274443"
    },
    {
      "text": "Anupriya Tuli, Shaan Chopra, Pushpendra Singh, and Neha Kumar. 2020. Menstrual (Im)Mobilities and Safe Spaces. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–15.",
      "doi": "10.1145/3313831.3376653"
    },
    {
      "text": "Anupriya Tuli, Shruti Dalvi, Neha Kumar, and Pushpendra Singh. 2019. “It’s a Girl Thing”: Examining Challenges and Opportunities Around Menstrual Health Education in India. ACM Trans. Comput.-Hum. Interact. 26, 5, Article 29 (July 2019), 24 pages.",
      "doi": "10.1145/3325282"
    },
    {
      "text": "Agatha Tutia, Kelda Baljon, Lan Vu, and Daniela K. Rosner. 2019. HCI and Menopause: Designing With and Around the Aging Body. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article CS23, 8 pages.",
      "doi": "10.1145/3290607.3299066"
    },
    {
      "text": "Iñigo Urteaga, Mollie McKillop, and Noémie Elhadad. 2020. Learning endometriosis phenotypes from patient-generated data. NPJ digital medicine 3, 1 (2020), 1–14.",
      "doi": ""
    },
    {
      "text": "Martijn van der Eijk, Marjan J Faber, Johanna WM Aarts, Jan AM Kremer, Marten Munneke, and Bastiaan R Bloem. 2013. Using online health communities to deliver patient-centered care to people with chronic conditions. Journal of medical Internet research 15, 6 (2013), e115.",
      "doi": ""
    },
    {
      "text": "Emily Van der Nagel and Jordan Frith. 2015. Anonymity, pseudonymity, and the agency of online identity: Examining the social practices of r/Gonewild.",
      "doi": ""
    },
    {
      "text": "Maja Van Der Velden and Khaled El Emam. 2013. “Not all my friends need to know”: a qualitative study of teenage patients, privacy, and social media. Journal of the American Medical Informatics Association 20, 1(2013), 16–24.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Chelsea-Joy Wardle, Mitchell Green, Christine Wanjiru Mburu, and Melissa Densmore. 2018. Exploring Co-design with Breastfeeding Mothers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Article 482, 12 pages.",
      "doi": "10.1145/3173574.3174056"
    },
    {
      "text": "Lynda Ware. 2018. Polycystic ovary syndrome: how can it be treated?https://bit.ly/2FDCB6p. Accessed on (2020/09/01).",
      "doi": ""
    },
    {
      "text": "Theresa R Weiss and Sandra Minor Bulmer. 2011. Young women’s experiences living with polycystic ovary syndrome. Journal of obstetric, gynecologic & neonatal nursing 40, 6 (2011), 709–718.",
      "doi": ""
    },
    {
      "text": "Paul Wicks, Michael Massagli, Jeana Frost, Catherine Brownstein, Sally Okun, Timothy Vaughan, Richard Bradley, and James Heywood. 2010. Sharing health data for better outcomes on PatientsLikeMe. Journal of medical Internet research 12, 2 (2010), e19.",
      "doi": ""
    },
    {
      "text": "Sophie Williams, David Sheffield, and Rebecca C Knibb. 2015. ‘Everything’s from the inside out with PCOS’: Exploring women’s experiences of living with polycystic ovary syndrome and co-morbidities through Skype™ interviews. Health psychology open 2, 2 (2015), 2055102915603051.",
      "doi": ""
    },
    {
      "text": "Erin Willis and Marla B Royne. 2017. Online health communities and chronic disease self-management. Health communication 32, 3 (2017), 269–278.",
      "doi": ""
    },
    {
      "text": "Wendy Wolf, Rachel Wattick, Olivia Kinkade, and Melissa Olfert. 2018. Geographical Prevalence of Polycystic Ovary Syndrome as Determined by Region and Race/Ethnicity. International Journal of Environmental Research and Public Health 15, 11 (Nov. 2018), 2589.",
      "doi": ""
    },
    {
      "text": "Alyson L. Young and Andrew D. Miller. 2019. “This Girl is on Fire”: Sensemaking in an Online Health Community for Vulvodynia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13.",
      "doi": ""
    },
    {
      "text": "Haining Zhu, Joanna Colgan, Madhu Reddy, and Eun Kyoung Choe. 2016. Sharing patient-generated data in clinical practices: an interview study, In AMIA Annual Symposium Proceedings. AMIA ... Annual Symposium proceedings. AMIA Symposium 2016, 1303.",
      "doi": ""
    },
    {
      "text": "Jasmine Zia, Jessica Schroeder, Sean Munson, James Fogarty, Linda Nguyen, Pamela Barney, Margaret Heitkemper, and Uri Ladabaum. 2016. Feasibility and Usability Pilot Study of a Novel Irritable Bowel Syndrome Food and Gastrointestinal Symptom Journal Smartphone App. Clinical and translational gastroenterology 7 (03 2016), e147.",
      "doi": ""
    }
  ]
}