{
  "doi": "10.1145/3411764.3445688",
  "title": "MomentMeld: AI-augmented Mobile Photographic Memento towards Mutually Stimulatory Inter-generational Interaction",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "Aging often comes with declining social interaction, a known adversarial factor impacting the life satisfaction of senior population. Such decline appears even in family–a permanent social circle, as their adult children eventually go independent. We present MomentMeld, an AI-powered, cloud-backed mobile application that blends with everyday routine and naturally encourages rich and frequent inter-generational interactions in a family, especially those between the senior generation and their adult children. Firstly, we design a photographic interaction aid called mutually stimulatory memento, which is a cross-generational juxtaposition of semantically related photos to bring natural arousal of context-specific inter-generational empathy and reminiscence. Secondly, we build comprehensive ensemble AI models consisting of various deep neural networks and a runtime system that automates the creation of mutually stimulatory memento on top of the user’s usual photo-taking routines. We deploy MomentMeld in-the-wild with six families for an eight-week period, and discuss the key findings and further implications.",
  "tags": [
    "Inter-generational interaction",
    "artificial intelligence",
    "mutually stimulatory memento",
    "aging",
    "mobile photography",
    "deep neural network",
    "smartphone",
    "semantic similarity"
  ],
  "authors": [
    {
      "name": "Bumsoo Kang",
      "institution": "School of Computing, KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658690166",
      "orcid": "missing"
    },
    {
      "name": "Seungwoo Kang",
      "institution": "School of Computer Science and Engineering, KOREATECH, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474686337",
      "orcid": "missing"
    },
    {
      "name": "Inseok Hwang",
      "institution": "Department of Computer Science and Engineering, POSTECH, Korea, Republic of",
      "img": "/do/10.1145/contrib-81410593113/rel-imgonly/inseok_ibmcampus_casual_720px.jpg",
      "acmid": "81410593113",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2013. United States of Aging Survey 2013 Full Report. https://www.ncoa.org/resources/united-states-of-aging-2013-full-report/.",
      "doi": ""
    },
    {
      "text": "George S Alexopoulos. 2005. Depression in the elderly. The lancet 365, 9475 (2005), 1961–1970.",
      "doi": ""
    },
    {
      "text": "Ron Baecker, Kate Sellen, Sarah Crosskey, Veronique Boscart, and Barbara Barbosa Neves. 2014. Technology to Reduce Social Isolation and Loneliness. In Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility(Rochester, New York, USA) (ASSETS ’14). Association for Computing Machinery, New York, NY, USA, 27–34. https://doi.org/10.1145/2661334.2661375",
      "doi": "10.1145/2661334.2661375"
    },
    {
      "text": "Uddipana Baishya and Carman Neustaedter. 2017. In Your Eyes: Anytime, Anywhere Video and Audio Streaming for Couples. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing. 84–97.",
      "doi": "10.1145/2998181.2998200"
    },
    {
      "text": "Frank R. Bentley, Santosh Basapur, and Sujoy Kumar Chowdhury. 2011. Promoting Intergenerational Communication through Location-Based Asynchronous Video Communication. In Proceedings of the 13th International Conference on Ubiquitous Computing (Beijing, China) (UbiComp ’11). Association for Computing Machinery, New York, NY, USA, 31–40. https://doi.org/10.1145/2030112.2030117",
      "doi": "10.1145/2030112.2030117"
    },
    {
      "text": "Margit Biemans, Betsy van Dijk, Pavan Dadlani, and Aart van Halteren. 2009. Let’s Stay in Touch: Sharing Photos for Restoring Social Connectedness between Rehabilitants, Friends and Family. In Proceedings of the 11th International ACM SIGACCESS Conference on Computers and Accessibility (Pittsburgh, Pennsylvania, USA) (Assets ’09). Association for Computing Machinery, New York, NY, USA, 179–186. https://doi.org/10.1145/1639642.1639674",
      "doi": "10.1145/1639642.1639674"
    },
    {
      "text": "Lucas M Bietti. 2010. Sharing memories, family conversation and interaction. Discourse & Society 21, 5 (2010), 499–523.",
      "doi": ""
    },
    {
      "text": "Léon Bottou. 1998. Online learning and stochastic approximations. On-line learning in neural networks 17, 9 (1998), 142.",
      "doi": ""
    },
    {
      "text": "Elina Bozhenko. 2011. Adult child-parent relationships: On the problem of classification. Procedia-Social and Behavioral Sciences 30 (2011), 1625–1629.",
      "doi": ""
    },
    {
      "text": "Freek Bucx, Frits Van Wel, Trudie Knijn, and Louk Hagendoorn. 2008. Intergenerational contact and the life course status of young adult children. Journal of Marriage and Family 70, 1 (2008), 144–156.",
      "doi": ""
    },
    {
      "text": "Pierre-Luc Carrier, Aaron Courville, Ian J Goodfellow, Medhi Mirza, and Yoshua Bengio. 2013. FER-2013 face database. Universit de Montral(2013).",
      "doi": ""
    },
    {
      "text": "Hye Won Chai and Hey Jung Jun. 2017. Relationship between ties with adult children and life satisfaction among the middle-aged, the young-old, and the oldest-old Korean adults. The International Journal of Aging and Human Development 85, 4(2017), 354–376.",
      "doi": ""
    },
    {
      "text": "Yunan Chen, Jing Wen, and Bo Xie. 2012. ” I communicate with my children in the game”: Mediated Intergenerational Family Relationships through a Social Networking Game. The Journal of Community Informatics 8, 1 (2012).",
      "doi": ""
    },
    {
      "text": "Richard E Clark. 1988. Research on instructional media, 1978-1988. Educational media and technology yearbook 14 (1988), 19–36.",
      "doi": ""
    },
    {
      "text": "Raymundo Cornejo, Mónica Tentori, and Jesús Favela. 2013. Enriching in-person encounters through social media: A study on family connectedness for the elderly. International Journal of Human-Computer Studies 71, 9 (2013), 889–899.",
      "doi": "10.1016/j.ijhcs.2013.04.001"
    },
    {
      "text": "Hao-Shu Fang, Shuqin Xie, Yu-Wing Tai, and Cewu Lu. 2017. Rmpe: Regional multi-person pose estimation. In Proceedings of the IEEE International Conference on Computer Vision. 2334–2343.",
      "doi": ""
    },
    {
      "text": "Norbert Freedman, Wilma Bucci, and Edward Elkowitz. 1982. Depression in a family practice elderly population. Journal of the American Geriatrics Society 30, 6 (1982), 372–377.",
      "doi": ""
    },
    {
      "text": "Sarah Gallacher, Jenny O’Connor, Jon Bird, Yvonne Rogers, Licia Capra, Daniel Harrison, and Paul Marshall. 2015. Mood squeezer: lightening up the workplace through playful and lightweight interactions. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. 891–902.",
      "doi": "10.1145/2675133.2675170"
    },
    {
      "text": "Jeannette Golden, Ronán M Conroy, Irene Bruce, Aisling Denihan, Elaine Greene, Michael Kirby, and Brian A Lawlor. 2009. Loneliness, social support networks, mood and wellbeing in community-dwelling elderly. International Journal of Geriatric Psychiatry: A journal of the psychiatry of late life and allied sciences 24, 7 (2009), 694–700.",
      "doi": ""
    },
    {
      "text": "Connie Golsteijn and Elise van den Hoven. 2013. Facilitating parent-teenager communication through interactive photo cubes. Personal and Ubiquitous Computing 17, 2 (2013), 273–286.",
      "doi": "10.1007/s00779-011-0487-9"
    },
    {
      "text": "Howard Greisdorf and Brian O’Connor. 2002. Modelling what users see when they look at images: a cognitive viewpoint. Journal of documentation 58, 1 (2002), 6–29.",
      "doi": ""
    },
    {
      "text": "William R Hazlewood, Erik Stolterman, and Kay Connelly. 2011. Issues in evaluating ambient displays in the wild: two case studies. In Proceedings of the SIGCHI conference on Human factors in computing systems. 877–886.",
      "doi": "10.1145/1978942.1979071"
    },
    {
      "text": "Kaiming He, Xiangyu Zhang, Shaoqing Ren, and Jian Sun. 2016. Deep residual learning for image recognition. In Proceedings of the IEEE conference on computer vision and pattern recognition. 770–778.",
      "doi": ""
    },
    {
      "text": "Inseok Hwang, Hyukjae Jang, Lama Nachman, and Junehwa Song. 2010. Exploring inter-child behavioral relativity in a shared social environment: a field study in a kindergarten. In Proceedings of the 12th ACM international conference on Ubiquitous computing. 271–280.",
      "doi": "10.1145/1864349.1864373"
    },
    {
      "text": "Inseok Hwang, Hyukjae Jang, Taiwoo Park, Aram Choi, Youngki Lee, Chanyou Hwang, Yanggui Choi, Lama Nachman, and Junehwa Song. 2012. Leveraging children’s behavioral distribution and singularities in new interactive environments: Study in kindergarten field trips. In International Conference on Pervasive Computing. Springer, 39–56.",
      "doi": "10.1007/978-3-642-31205-2_3"
    },
    {
      "text": "Inseok Hwang, Youngki Lee, Chungkuk Yoo, Chulhong Min, Dongsun Yim, and John Kim. 2019. Towards Interpersonal Assistants: Next-Generation Conversational Agents. IEEE Pervasive Computing 18, 2 (2019), 21–31.",
      "doi": "10.1109/MPRV.2019.2922907"
    },
    {
      "text": "Inseok Hwang, Chungkuk Yoo, Chanyou Hwang, Dongsun Yim, Youngki Lee, Chulhong Min, John Kim, and Junehwa Song. 2014. TalkBetter: family-driven mobile intervention care for children with language delay. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 1283–1296.",
      "doi": "10.1145/2531602.2531668"
    },
    {
      "text": "Hyukjae Jang, Sungwon Peter Choe, Inseok Hwang, Chanyou Hwang, Lama Nachman, and Junehwa Song. 2012. RubberBand: augmenting teacher’s awareness of spatially isolated children on kindergarten field trips. In Proceedings of the 2012 ACM conference on ubiquitous computing. 236–239.",
      "doi": "10.1145/2370216.2370254"
    },
    {
      "text": "Eunkyung Jo, Hyeonseok Bang, Myeonghan Ryu, Eun Jee Sung, Sungmook Leem, and Hwajung Hong. 2020. MAMAS: Supporting Parent–Child Mealtime Interactions Using Automated Tracking and Speech Recognition. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–32.",
      "doi": "10.1145/3392876"
    },
    {
      "text": "Marja Jylhä. 2004. Old Age and Loneliness: Cross-sectional and Longitudinal Analyses in the Tampere Longitudinal Study on Aging. Canadian Journal on Aging / La Revue canadienne du vieillissement 23, 2(2004), 157–168. https://doi.org/10.1353/cja.2004.0023",
      "doi": ""
    },
    {
      "text": "Bumsoo Kang, Inseok Hwang, Jinho Lee, Seungchul Lee, Taegyeong Lee, Youngjae Chang, and Min Kyung Lee. 2018. My Being to Your Place, Your Being to My Place: Co-Present Robotic Avatars Create Illusion of Living Together. In Proceedings of the 16th Annual International Conference on Mobile Systems, Applications, and Services (Munich, Germany) (MobiSys ’18). Association for Computing Machinery, New York, NY, USA, 54–67. https://doi.org/10.1145/3210240.3210348",
      "doi": "10.1145/3210240.3210348"
    },
    {
      "text": "Bumsoo Kang, Inseok Hwang, Jinho Lee, Seungchul Lee, Taegyeong Lee, Youngjae Chang, and Min Kyung Lee. 2019. Towards Peripheral Awareness of Remote Family Member’s Context Using Self-mobile Robotic Avatars. In Proceedings of the 17th Annual International Conference on Mobile Systems, Applications, and Services. 677–678.",
      "doi": "10.1145/3307334.3328578"
    },
    {
      "text": "Bumsoo Kang, Chulhong Min, Wonjung Kim, Inseok Hwang, Chunjong Park, Seungchul Lee, Sung-Ju Lee, and Junehwa Song. 2017. Zaturi: We Put Together the 25th Hour for You. Create a Book for Your Baby. In Proceedings of the 2017 ACM Conference on Computer Supported Cooperative Work and Social Computing (Portland, Oregon, USA) (CSCW ’17). Association for Computing Machinery, New York, NY, USA, 1850–1863. https://doi.org/10.1145/2998181.2998186",
      "doi": "10.1145/2998181.2998186"
    },
    {
      "text": "Jeong Kim and John Zimmerman. 2006. Cherish: Smart Digital Photo Frames for Sharing Social Narratives at Home. In CHI ’06 Extended Abstracts on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI EA ’06). Association for Computing Machinery, New York, NY, USA, 953–958. https://doi.org/10.1145/1125451.1125635",
      "doi": "10.1145/1125451.1125635"
    },
    {
      "text": "Wonjung Kim, Seungchul Lee, Seonghoon Kim, Sungbin Jo, Chungkuk Yoo, Inseok Hwang, Seungwoo Kang, and Junehwa Song. 2020. Dyadic Mirror: Everyday Second-person Live-view for Empathetic Reflection upon Parent-child Interaction. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 3 (2020). https://doi.org/10.1145/3411815",
      "doi": "10.1145/3411815"
    },
    {
      "text": "Davis E. King. 2009. Dlib-ml: A Machine Learning Toolkit. Journal of Machine Learning Research 10 (2009), 1755–1758.",
      "doi": "10.5555/1577069.1755843"
    },
    {
      "text": "Rebecca Kleinberger, Alexandra Rieger, Janelle Sands, and Janet Baker. 2019. Supporting Elder Connectedness through Cognitively Sustainable Design Interactions with the Memory Music Box. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (New Orleans, LA, USA) (UIST ’19). Association for Computing Machinery, New York, NY, USA, 355–369. https://doi.org/10.1145/3332165.3347877",
      "doi": "10.1145/3332165.3347877"
    },
    {
      "text": "Mari Laine-Hernandez and Stina Westman. 2006. Image semantics in the description and categorization of journalistic photographs. Proceedings of the American Society for Information Science and Technology 43, 1 (2006), 1–25.",
      "doi": ""
    },
    {
      "text": "Phillippa Lally, Cornelia HM Van Jaarsveld, Henry WW Potts, and Jane Wardle. 2010. How are habits formed: Modelling habit formation in the real world. European journal of social psychology 40, 6 (2010), 998–1009.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Hilaire Thompson, and George Demiris. 2014. A systematic review of the use of technology for reminiscence therapy. Health education & behavior 41, 1_suppl (2014), 51S–61S.",
      "doi": ""
    },
    {
      "text": "Cun Li, Jun Hu, Bart Hengeveld, and Caroline Hummels. 2019. Slots-Memento: Facilitating Intergenerational Memento Storytelling and Preservation for the Elderly. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction (Tempe, Arizona, USA) (TEI ’19). Association for Computing Machinery, New York, NY, USA, 359–366. https://doi.org/10.1145/3294109.3300979",
      "doi": "10.1145/3294109.3300979"
    },
    {
      "text": "Xiaodan Liang, Chunyan Xu, Xiaohui Shen, Jianchao Yang, Si Liu, Jinhui Tang, Liang Lin, and Shuicheng Yan. 2015. Human parsing with contextualized convolutional neural network. In Proceedings of the IEEE international conference on computer vision. 1386–1394.",
      "doi": "10.1109/ICCV.2015.163"
    },
    {
      "text": "Siân E. Lindley, Richard Harper, and Abigail Sellen. 2009. Desiring to Be in Touch in a Changing Communications Landscape: Attitudes of Older Adults. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Boston, MA, USA) (CHI ’09). Association for Computing Machinery, New York, NY, USA, 1693–1702. https://doi.org/10.1145/1518701.1518962",
      "doi": "10.1145/1518701.1518962"
    },
    {
      "text": "Patrick Lucey, Jeffrey F Cohn, Takeo Kanade, Jason Saragih, Zara Ambadar, and Iain Matthews. 2010. The extended cohn-kanade dataset (ck+): A complete dataset for action unit and emotion-specified expression. In 2010 ieee computer society conference on computer vision and pattern recognition-workshops. IEEE, 94–101.",
      "doi": ""
    },
    {
      "text": "Natalie Merrill and Robyn Fivush. 2016. Intergenerational narratives and identity across development. Developmental Review 40(2016), 72–92.",
      "doi": ""
    },
    {
      "text": "Tomas Mikolov, Ilya Sutskever, Kai Chen, Greg S Corrado, and Jeff Dean. 2013. Distributed representations of words and phrases and their compositionality. In Advances in neural information processing systems. 3111–3119.",
      "doi": ""
    },
    {
      "text": "Mark B Mizen. 2004. Scrapbook photo albums are therapeutic for Alzheimer’s patients. Creative Memories (2004), 2–3.",
      "doi": ""
    },
    {
      "text": "Abraham Monk. 1988. Aging, Loneliness, and Communications. American Behavioral Scientist 31, 5 (1988), 532–563. https://doi.org/10.1177/000276488031005004",
      "doi": ""
    },
    {
      "text": "Elizabeth D. Mynatt, Jim Rowan, Sarah Craighill, and Annie Jacobs. 2001. Digital Family Portraits: Supporting Peace of Mind for Extended Family Members. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Seattle, Washington, USA) (CHI ’01). Association for Computing Machinery, New York, NY, USA, 333–340. https://doi.org/10.1145/365024.365126",
      "doi": "10.1145/365024.365126"
    },
    {
      "text": "National Academies of Sciences, Engineering, and Medicine. 2020. Social Isolation and Loneliness in Older Adults: Opportunities for the Health Care System. The National Academies Press, Washington, DC. https://doi.org/10.17226/25663",
      "doi": ""
    },
    {
      "text": "United Nations. 2019. World Population Prospects 2019: Data Booklet. 25 pages. https://doi.org/https://doi.org/10.18356/3e9d869f-en",
      "doi": ""
    },
    {
      "text": "Michael Nunes, Saul Greenberg, and Carman Neustaedter. 2008. Sharing Digital Photographs in the Home through Physical Mementos, Souvenirs, and Keepsakes. In Proceedings of the 7th ACM Conference on Designing Interactive Systems (Cape Town, South Africa) (DIS ’08). Association for Computing Machinery, New York, NY, USA, 250–260. https://doi.org/10.1145/1394445.1394472",
      "doi": "10.1145/1394445.1394472"
    },
    {
      "text": "Daniela Petrelli, Steve Whittaker, and Jens Brockmeier. 2008. AutoTopography: What Can Physical Mementos Tell Us about Digital Memories?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 53–62. https://doi.org/10.1145/1357054.1357065",
      "doi": "10.1145/1357054.1357065"
    },
    {
      "text": "M Kathleen Pichora-Fuller, Paul Mick, and Marilyn Reed. 2015. Hearing, cognition, and healthy aging: Social and public health implications of the links between age-related declines in hearing and cognition. In Seminars in Hearing, Vol. 36. Thieme Medical Publishers, 122.",
      "doi": ""
    },
    {
      "text": "Laura Pina, Kael Rowan, Asta Roseway, Paul Johns, Gillian R Hayes, and Mary Czerwinski. 2014. In situ cues for ADHD parenting strategies using mobile technology. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare. 17–24.",
      "doi": "10.4108/icst.pervasivehealth.2014.254958"
    },
    {
      "text": "Hayes Raffle, Rafael Ballagas, Glenda Revelle, Hiroshi Horii, Sean Follmer, Janet Go, Emily Reardon, Koichi Mori, Joseph Kaye, and Mirjana Spasojevic. 2010. Family Story Play: Reading with Young Children (and Elmo) over a Distance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 1583–1592. https://doi.org/10.1145/1753326.1753563",
      "doi": "10.1145/1753326.1753563"
    },
    {
      "text": "Joseph Redmon and Ali Farhadi. 2018. YOLOv3: An Incremental Improvement. arXiv (2018).",
      "doi": ""
    },
    {
      "text": "Alireza Sahami Shirazi, Niels Henze, Tilman Dingler, Martin Pielot, Dominik Weber, and Albrecht Schmidt. 2014. Large-Scale Assessment of Mobile Notifications. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 3055–3064. https://doi.org/10.1145/2556288.2557189",
      "doi": "10.1145/2556288.2557189"
    },
    {
      "text": "Aric Sigman. 2009. Well connected. Biologist 56, 1 (2009), 14–20.",
      "doi": ""
    },
    {
      "text": "Jolynna Sinanan, Larissa Hjorth, Kana Ohashi, and Fumitoshi Kato. 2018. Mobile media photography and intergenerational families. International Journal of Communication 12, 17 (2018), 4106–4122.",
      "doi": ""
    },
    {
      "text": "Archana Singh and Nishi Misra. 2009. Loneliness, depression and sociability in old age. Industrial psychiatry journal 18, 1 (2009), 51.",
      "doi": ""
    },
    {
      "text": "Seokwoo Song, Seungho Kim, John Kim, Wonjeong Park, and Dongsun Yim. 2016. TalkLIME: mobile system intervention to improve parent-child interaction for children with language delay. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing. 304–315.",
      "doi": "10.1145/2971648.2971650"
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1994. Grounded theory methodology. Handbook of qualitative research 17, 1 (1994), 273–285.",
      "doi": ""
    },
    {
      "text": "Atsudo Sugisawa, Hidehiro Sugisawa, Yomei Nakatani, and Hiroshi Shibata. 1997. Effect of retirement on mental health and social well-being among elderly Japanese. [Nihon koshu eisei zasshi] Japanese journal of public health 44, 2(1997), 123.",
      "doi": ""
    },
    {
      "text": "Maria Vozikaki, Angeliki Papadaki, Manolis Linardakis, and Anastas Philalithis. 2018. Loneliness among older European adults: Results from the survey of health, aging and retirement in Europe. Journal of Public Health 26, 6 (2018), 613–624.",
      "doi": ""
    },
    {
      "text": "Russell Ward, Glenn Deane, and Glenna Spitze. 2014. Life-course changes and parent–adult child contact. Research on aging 36, 5 (2014), 568–602.",
      "doi": ""
    },
    {
      "text": "Jenny Waycott, Frank Vetere, Sonja Pedell, Lars Kulik, Elizabeth Ozanne, Alan Gruner, and John Downs. 2013. Older Adults as Digital Content Producers. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Paris, France) (CHI ’13). Association for Computing Machinery, New York, NY, USA, 39–48. https://doi.org/10.1145/2470654.2470662",
      "doi": "10.1145/2470654.2470662"
    },
    {
      "text": "Tilo Westermann, Sebastian Möller, and Ina Wechsung. 2015. Assessing the Relationship between Technical Affinity, Stress and Notifications on Smartphones. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(Copenhagen, Denmark) (MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 652–659. https://doi.org/10.1145/2786567.2793684",
      "doi": "10.1145/2786567.2793684"
    },
    {
      "text": "Lynn White and John N Edwards. 1990. Emptying the nest and parental well-being: An analysis of national panel data. American sociological review(1990), 235–242.",
      "doi": ""
    },
    {
      "text": "James O Young. 2003. Art and knowledge. Routledge.",
      "doi": ""
    },
    {
      "text": "Chuanxia Zheng, Tat-Jen Cham, and Jianfei Cai. 2019. Pluralistic image completion. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 1438–1447.",
      "doi": ""
    },
    {
      "text": "Bolei Zhou, Hang Zhao, Xavier Puig, Sanja Fidler, Adela Barriuso, and Antonio Torralba. 2017. Scene parsing through ade20k dataset. In Proceedings of the IEEE conference on computer vision and pattern recognition. 633–641.",
      "doi": ""
    }
  ]
}