{
  "doi": "10.1145/3411764.3445766",
  "title": "Gesture Knitter: A Hand Gesture Design Tool for Head-Mounted Mixed Reality Applications",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Hand gestures are a natural and expressive input method enabled by modern mixed reality headsets. However, it remains challenging for developers to create custom gestures for their applications. Conventional strategies to bespoke gesture recognition involve either hand-crafting or data-intensive deep-learning. Neither approach is well suited for rapid prototyping of new interactions. This paper introduces a flexible and efficient alternative approach for constructing hand gestures. We present Gesture Knitter: a design tool for creating custom gesture recognizers with minimal training data. Gesture Knitter allows the specification of gesture primitives that can then be combined to create more complex gestures using a visual declarative script. Designers can build custom recognizers by declaring them from scratch or by providing a demonstration that is automatically decoded into its primitive components. Our developer study shows that Gesture Knitter achieves high recognition accuracy despite minimal training data and delivers an expressive and creative design experience.",
  "tags": [
    "gestures",
    "virtual reality",
    "augmented reality"
  ],
  "authors": [
    {
      "name": "George B. Mo",
      "institution": "Department of Engineering University of Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660779446",
      "orcid": "missing"
    },
    {
      "name": "John J Dudley",
      "institution": "Department of Engineering University of Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659277381",
      "orcid": "missing"
    },
    {
      "name": "Per Ola Kristensson",
      "institution": "Department of Engineering University of Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100362804/rel-imgonly/pokristensson2013small.jpg",
      "acmid": "81100362804",
      "orcid": "0000-0002-7139-871X"
    }
  ],
  "references": [
    {
      "text": "Eric Brochu, Tyson Brochu, and Nando De Freitas. 2010. A Bayesian Interactive Optimization Approach to Procedural Animation Design. Eurographics/ ACM SIGGRAPH Symposium on Computer Animation (2010), 10 pages. https://doi.org/10.2312/SCA/SCA10/103-112 Artwork Size: 10 pages ISBN: 9783905674279 Publisher: The Eurographics Association.",
      "doi": ""
    },
    {
      "text": "Sylvain Calinon. 2016. A tutorial on task-parameterized movement learning and retrieval. Intelligent Service Robotics 9, 1 (Jan. 2016), 1–29. https://doi.org/10.1007/s11370-015-0187-9",
      "doi": "10.1007/s11370-015-0187-9"
    },
    {
      "text": "Sylvain Calinon, Florent Guenter, and Aude Billard. 2007. On Learning, Representing, and Generalizing a Task in a Humanoid Robot. IEEE Transactions on Systems, Man, and Cybernetics, Part B (Cybernetics) 37, 2 (April 2007), 286–298. https://doi.org/10.1109/TSMCB.2006.886952 Conference Name: IEEE Transactions on Systems, Man, and Cybernetics, Part B (Cybernetics).",
      "doi": "10.1109/TSMCB.2006.886952"
    },
    {
      "text": "Baptiste Caramiaux, Nicola Montecchio, Atau Tanaka, and Frédéric Bevilacqua. 2014. Adaptive Gesture Recognition with Variation Estimation for Interactive Systems. ACM Transactions on Interactive Intelligent Systems 4, 4 (Dec. 2014), 18:1–18:34. https://doi.org/10.1145/2643204",
      "doi": ""
    },
    {
      "text": "Qing Chen, Nicolas D. Georganas, and Emil M. Petriu. 2008. Hand Gesture Recognition Using Haar-Like Features and a Stochastic Context-Free Grammar. IEEE Transactions on Instrumentation and Measurement 57, 8 (Aug. 2008), 1562–1571. https://doi.org/10.1109/TIM.2008.922070 Conference Name: IEEE Transactions on Instrumentation and Measurement.",
      "doi": ""
    },
    {
      "text": "John J. Dudley, Jason T. Jacques, and Per Ola Kristensson. 2019. Crowdsourcing Interface Feature Design with Bayesian Optimization. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, Glasgow, UK, 1–12. https://doi.org/10.1145/3290605.3300482",
      "doi": "10.1145/3290605.3300482"
    },
    {
      "text": "John J. Dudley, Hendrik Schuff, and Per Ola Kristensson. 2018. Bare-Handed 3D Drawing in Augmented Reality. In Proceedings of the 2018 Designing Interactive Systems Conference(DIS ’18). Association for Computing Machinery, New York, NY, USA, 241–252. https://doi.org/10.1145/3196709.3196737",
      "doi": "10.1145/3196709.3196737"
    },
    {
      "text": "Stefan Eickeler, Andreas Kosmala, and Gerhard Rigoll. 1998. Hidden Markov model based continuous online gesture recognition. In Proceedings. Fourteenth International Conference on Pattern Recognition (Cat. No.98EX170), Vol. 2. 1206–1208 vol.2. https://doi.org/10.1109/ICPR.1998.711914 ISSN: 1051-4651.",
      "doi": "10.1109/ICPR.1998.711914"
    },
    {
      "text": "Eng-Jon Ong and R. Bowden. 2004. A boosted classifier tree for hand shape detection. In Sixth IEEE International Conference on Automatic Face and Gesture Recognition, 2004. Proceedings.IEEE, Seoul, Korea, 889–894. https://doi.org/10.1109/AFGR.2004.1301646",
      "doi": ""
    },
    {
      "text": "Shai Fine, Yoram Singer, and Naftali Tishby. 1998. The Hierarchical Hidden Markov Model: Analysis and Applications. Machine Learning 32, 1 (July 1998), 41–62. https://doi.org/10.1023/A:1007469218079",
      "doi": "10.1023/A%3A1007469218079"
    },
    {
      "text": "Jules Françoise and Frédéric Bevilacqua. 2018. Motion-Sound Mapping through Interaction: An Approach to User-Centered Design of Auditory Feedback Using Machine Learning. ACM Transactions on Interactive Intelligent Systems 8, 2 (June 2018), 16:1–16:30. https://doi.org/10.1145/3211826",
      "doi": "10.1145/3211826"
    },
    {
      "text": "William T. Freeman and Michal Roth. 1994. Orientation Histograms for Hand Gesture Recognition. In International Workshop on Automatic Face and Gesture Recognition. Zurich, Switzerland, 296–301.",
      "doi": ""
    },
    {
      "text": "Tracy Hammond and Randall Davis. 2005. LADDER, a sketching language for user interface developers. Computers & Graphics 29, 4 (Aug. 2005), 518–532. https://doi.org/10.1016/j.cag.2005.05.005",
      "doi": "10.1016/j.cag.2005.05.005"
    },
    {
      "text": "Sanna Kallio, Juha Kela, and Jani Mantyjarvi. 2003. Online gesture recognition system for mobile interaction. In SMC’03 Conference Proceedings. 2003 IEEE International Conference on Systems, Man and Cybernetics. Conference Theme - System Security and Assurance (Cat. No.03CH37483), Vol. 3. 2070–2076 vol.3. https://doi.org/10.1109/ICSMC.2003.1244189 ISSN: 1062-922X.",
      "doi": ""
    },
    {
      "text": "Jinsheng Kang, Kang Zhong, Shengfeng Qin, Hongan Wang, and David Wright. 2013. Instant 3D design concept generation and visualization by real-time hand gesture recognition. Computers in Industry 64, 7 (Sept. 2013), 785–797. https://doi.org/10.1016/j.compind.2013.04.012",
      "doi": "10.1016/j.compind.2013.04.012"
    },
    {
      "text": "Simon Katan, Mick Grierson, and Rebecca Fiebrink. 2015. Using Interactive Machine Learning to Support Interface Development Through Workshops with Disabled People. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15. ACM Press, Seoul, Republic of Korea, 251–254. https://doi.org/10.1145/2702123.2702474",
      "doi": "10.1145/2702123.2702474"
    },
    {
      "text": "Yuki Koyama, Issei Sato, Daisuke Sakamoto, and Takeo Igarashi. 2017. Sequential line search for efficient visual design optimization by crowds. ACM Transactions on Graphics 36, 4 (July 2017), 1–11. https://doi.org/10.1145/3072959.3073598",
      "doi": "10.1145/3072959.3073598"
    },
    {
      "text": "Dana Kulić, Christian Ott, Dongheui Lee, Junichi Ishikawa, and Yoshihiko Nakamura. 2012. Incremental learning of full body motion primitives and their sequencing through human motion observation. The International Journal of Robotics Research 31, 3 (March 2012), 330–345. https://doi.org/10.1177/0278364911426178 Publisher: SAGE Publications Ltd STM.",
      "doi": "10.1177/0278364911426178"
    },
    {
      "text": "Hyeon-Kyu Lee and J.H. Kim. 1999. An HMM-based threshold model approach for gesture recognition. IEEE Transactions on Pattern Analysis and Machine Intelligence 21, 10 (Oct. 1999), 961–973. https://doi.org/10.1109/34.799904 Conference Name: IEEE Transactions on Pattern Analysis and Machine Intelligence.",
      "doi": "10.1109/34.799904"
    },
    {
      "text": "Yi Li. 2012. Hand gesture recognition using Kinect. In 2012 IEEE International Conference on Computer Science and Automation Engineering. 196–199. https://doi.org/10.1109/ICSESS.2012.6269439 ISSN: 2327-0594.",
      "doi": ""
    },
    {
      "text": "Zhihan Lv, Alaa Halawani, Shengzhong Feng, Shafiq ur Réhman, and Haibo Li. 2015. Touch-less interactive augmented reality game on vision-based wearable device. Personal and Ubiquitous Computing 19, 3-4 (July 2015), 551–567. https://doi.org/10.1007/s00779-015-0844-1",
      "doi": "10.1007/s00779-015-0844-1"
    },
    {
      "text": "Hao Lü, James A. Fogarty, and Yang Li. 2014. Gesture script: recognizing gestures and their structure using rendering scripts and interactively trained parts. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, Toronto, Ontario, Canada, 1685–1694. https://doi.org/10.1145/2556288.2557263",
      "doi": "10.1145/2556288.2557263"
    },
    {
      "text": "Hao Lü and Yang Li. 2012. Gesture coder: a tool for programming multi-touch gestures by demonstration. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, Austin, Texas, USA, 2875. https://doi.org/10.1145/2207676.2208693",
      "doi": ""
    },
    {
      "text": "Mounib Mazouzi, Paula Alavesa, Timo Koskela, and Timo Ojala. 2016. Ghost hunters: ambient light and hand gesture utilization in mobile augmented reality games. In Proceedings of the 15th International Conference on Mobile and Ubiquitous Multimedia - MUM ’16. ACM Press, Rovaniemi, Finland, 365–367. https://doi.org/10.1145/3012709.3017602",
      "doi": "10.1145/3012709.3017602"
    },
    {
      "text": "Byung-Woo Min, Ho-Sub Yoon, Jung Soh, Yun-Mo Yang, and Toshiaki Ejima. 1997. Hand gesture recognition using hidden Markov models. In Computational Cybernetics and Simulation 1997 IEEE International Conference on Systems, Man, and Cybernetics, Vol. 5. 4232–4235 vol.5. https://doi.org/10.1109/ICSMC.1997.637364 ISSN: 1062-922X.",
      "doi": ""
    },
    {
      "text": "Pavlo Molchanov, Shalini Gupta, Kihwan Kim, and Jan Kautz. 2015. Hand gesture recognition with 3D convolutional neural networks. In 2015 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). IEEE, Boston, MA, USA, 1–7. https://doi.org/10.1109/CVPRW.2015.7301342",
      "doi": ""
    },
    {
      "text": "Miguel A. Nacenta, Yemliha Kamber, Yizhou Qiang, and Per Ola Kristensson. 2013. Memorability of Pre-Designed and User-Defined Gesture Sets. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’13). Association for Computing Machinery, New York, NY, USA, 1099–1108. https://doi.org/10.1145/2470654.2466142",
      "doi": "10.1145/2470654.2466142"
    },
    {
      "text": "Pradyumna Narayana, J. Ross Beveridge, and Bruce A. Draper. 2018. Gesture Recognition: Focus on the Hands. In 2018 IEEE/CVF Conference on Computer Vision and Pattern Recognition. 5235–5244. https://doi.org/10.1109/CVPR.2018.00549 ISSN: 2575-7075.",
      "doi": ""
    },
    {
      "text": "Lionel Pigou, Sander Dieleman, Pieter-Jan Kindermans, and Benjamin Schrauwen. 2015. Sign Language Recognition Using Convolutional Neural Networks. In Computer Vision - ECCV 2014 Workshops, Lourdes Agapito, Michael M. Bronstein, and Carsten Rother (Eds.). Vol. 8925. Springer International Publishing, Cham, 572–578. https://doi.org/10.1007/978-3-319-16178-5_40 Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. 2013. User-defined gestures for augmented reality. CHI ’13 Extended Abstracts on Human Factors in Computing Systems (2013), 955–960. https://doi.org/10.1145/2468356.2468527",
      "doi": ""
    },
    {
      "text": "Rafael Radkowski and Christian Stritzke. 2012. Interactive hand gesture-based assembly for augmented reality applications. In Proceedings of the 2012 International Conference on Advances in Computer-Human Interactions. Citeseer, 303–308.",
      "doi": ""
    },
    {
      "text": "Stefan Reifinger, Frank Wallhoff, Markus Ablassmeier, Tony Poitschke, and Gerhard Rigoll. 2007. Static and Dynamic Hand-Gesture Recognition for Augmented Reality Applications. In Human-Computer Interaction. HCI Intelligent Multimodal Interaction Environments, David Hutchison, Takeo Kanade, Josef Kittler, Jon M. Kleinberg, Friedemann Mattern, John C. Mitchell, Moni Naor, Oscar Nierstrasz, C. Pandu Rangan, Bernhard Steffen, Madhu Sudan, Demetri Terzopoulos, Doug Tygar, Moshe Y. Vardi, Gerhard Weikum, and Julie A. Jacko(Eds.). Vol. 4552. Springer Berlin Heidelberg, Berlin, Heidelberg, 728–737. https://doi.org/10.1007/978-3-540-73110-8_79 Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "Zhou Ren, Junsong Yuan, Jingjing Meng, and Zhengyou Zhang. 2013. Robust Part-Based Hand Gesture Recognition Using Kinect Sensor. IEEE Transactions on Multimedia 15, 5 (Aug. 2013), 1110–1120. https://doi.org/10.1109/TMM.2013.2246148",
      "doi": "10.1109/TMM.2013.2246148"
    },
    {
      "text": "Eric Saund, David Fleet, Daniel Larner, and James Mahoney. 2003. Perceptually-supported image editing of text and graphics. In Proceedings of the 16th annual ACM symposium on User interface software and technology(UIST ’03). Association for Computing Machinery, Vancouver, Canada, 183–192. https://doi.org/10.1145/964696.964717",
      "doi": "10.1145/964696.964717"
    },
    {
      "text": "Jacob Schreiber. 2018. Pomegranate: Fast and Flexible Probabilistic Modeling in Python. Journal of Machine Learning Research 18, 164 (2018), 1–6.",
      "doi": "10.5555/3122009.3242021"
    },
    {
      "text": "Suwon Shon, Jounghoon Beh, Cheoljong Yang, David K. Han, and Hanseok Ko. 2011. Motion primitives for designing flexible gesture set in Human-Robot Interface. In 2011 11th International Conference on Control, Automation and Systems. 1501–1504. ISSN: 2093-7121.",
      "doi": ""
    },
    {
      "text": "Helman I. SStern, Juan P. Wachs, and Yael Edan. 2004. Hand gesture vocabulary design: a multicriteria optimization. In 2004 IEEE International Conference on Systems, Man and Cybernetics (IEEE Cat. No.04CH37583), Vol. 1. 19–23 vol.1. https://doi.org/10.1109/ICSMC.2004.1398266 ISSN: 1062-922X.",
      "doi": ""
    },
    {
      "text": "Thad Starner and Alex Pentland. 1995. Real-time American Sign Language recognition from video using hidden Markov models. In Proceedings of International Symposium on Computer Vision - ISCV. 265–270. https://doi.org/10.1109/ISCV.1995.477012",
      "doi": ""
    },
    {
      "text": "Thad Starner, J. Weaver, and Alex Pentland. 1998. Real-time American sign language recognition using desk and wearable computer based video. IEEE Transactions on Pattern Analysis and Machine Intelligence 20, 12 (Dec. 1998), 1371–1375. https://doi.org/10.1109/34.735811 Conference Name: IEEE Transactions on Pattern Analysis and Machine Intelligence.",
      "doi": "10.1109/34.735811"
    },
    {
      "text": "Helman I. Stern, Juan P. Wachs, and Yael Edan. 2006. Human Factors for Design of Hand Gesture Human - Machine Interaction. In 2006 IEEE International Conference on Systems, Man and Cybernetics, Vol. 5. 4052–4056. https://doi.org/10.1109/ICSMC.2006.384767 ISSN: 1062-922X.",
      "doi": ""
    },
    {
      "text": "Helman I. Stern, Juan P. Wachs, and Yael Edan. 2006. Optimal Hand Gesture Vocabulary Design Using Psycho-Physiological and Technical Factors. In 7th International Conference on Automatic Face and Gesture Recognition (FGR06). 257–262. https://doi.org/10.1109/FGR.2006.84",
      "doi": ""
    },
    {
      "text": "Helman I. Stern, Juan P. Wachs, and Yael Edan. 2008. Optimal Consensus Intuitive Hand Gesture Vocabulary Design. In 2008 IEEE International Conference on Semantic Computing. 96–103. https://doi.org/10.1109/ICSC.2008.29",
      "doi": ""
    },
    {
      "text": "Hao Tang, Wei Wang, Dan Xu, Yan Yan, and Nicu Sebe. 2019. GestureGAN for Hand Gesture-to-Gesture Translation in the Wild. arXiv:1808.04859 [cs] (July 2019). arXiv:1808.04859.",
      "doi": ""
    },
    {
      "text": "Joëlle Tilmanne, Alexis Moinet, and Thierry Dutoit. 2012. Stylistic gait synthesis based on hidden Markov models. EURASIP Journal on Advances in Signal Processing 2012, 1 (March 2012), 72. https://doi.org/10.1186/1687-6180-2012-72",
      "doi": ""
    },
    {
      "text": "Youwen Wang, Cheng Yang, Xiaoyu Wu, Shengmiao Xu, and Hui Li. 2012. Kinect Based Dynamic Hand Gesture Recognition Algorithm Research. In 2012 4th International Conference on Intelligent Human-Machine Systems and Cybernetics, Vol. 1. 274–279. https://doi.org/10.1109/IHMSC.2012.76",
      "doi": ""
    },
    {
      "text": "Zahoor Zafrulla, Helene Brashear, Thad Starner, Harley Hamilton, and Peter Presti. 2011. American sign language recognition with the kinect. In Proceedings of the 13th international conference on multimodal interfaces - ICMI ’11. ACM Press, Alicante, Spain, 279. https://doi.org/10.1145/2070481.2070532",
      "doi": "10.1145/2070481.2070532"
    },
    {
      "text": "Chun Zhu and Weihua Sheng. 2009. Online hand gesture recognition using neural network based segmentation. In 2009 IEEE/RSJ International Conference on Intelligent Robots and Systems. 2415–2420. https://doi.org/10.1109/IROS.2009.5354657 ISSN: 2153-0866.",
      "doi": ""
    }
  ]
}