{
  "doi": "10.1145/3411764.3445700",
  "title": "The Design Space of Wearables for Sports and Fitness Practices",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "The growing interest in wearables for sports and fitness calls for design knowledge and conceptualizations that can help shape future designs. Towards that end, we present and discuss a design space of wearables for these practices, based on a survey of previous work. Through a thematic analysis of 47 research publications in the domain, we surface core design decisions concerning wearability, technology design, and wearable use in practice. Building on these, we show how the design space takes into account the goals of introducing technology, that design decisions can be either directly designed, or left open for appropriation by end-users; and the social organization of the practice. We characterize prior work based on the design space elements, which yields trends and opportunities for design. Our contributions can help designers think about key design decisions, exploit trends and explore new areas in the domain of wearables for sports and fitness practices.",
  "authors": [
    {
      "name": "Laia Turmo Vidal",
      "institution": "Dept of Informatics and Media Uppsala University, Sweden",
      "img": "/do/10.1145/contrib-99659019371/rel-imgonly/_mg_8750.jpg",
      "acmid": "99659019371",
      "orcid": "missing"
    },
    {
      "name": "Hui Zhu",
      "institution": "Uppsala University, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659529149",
      "orcid": "missing"
    },
    {
      "name": "Annika Waern",
      "institution": "Uppsala University Dept of Informatics and Media, Sweden",
      "img": "/do/10.1145/contrib-81100020339/rel-imgonly/282023_3annika-waern.jpg",
      "acmid": "81100020339",
      "orcid": "missing"
    },
    {
      "name": "Elena Márquez Segura",
      "institution": "Department of Computer Science and Engineering Universidad Carlos III de Madrid, Spain",
      "img": "/do/10.1145/contrib-99659077589/rel-imgonly/99659077589.jpg",
      "acmid": "99659077589",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Marco Aggravi, Gionata Salvietti, and Domenico Prattichizzo. 2016. Haptic Assistive Bracelets for Blind Skier Guidance. In Proceedings of the 7th Augmented Human International Conference 2016 (AH ’16), 1–4. https://doi.org/10.1145/2875194.2875249",
      "doi": "10.1145/2875194.2875249"
    },
    {
      "text": "B. Zhou, G. Bahle, L. Fürg, M. S. Singh, H. Z. Cruz, and P. Lukowicz. 2017. Trainwear: A real-time assisted training feedback system with fabric wearable sensors. In 2017 IEEE International Conference on Pervasive Computing and Communications Workshops (PerCom Workshops), 85–87. https://doi.org/10.1109/PERCOMW.2017.7917531",
      "doi": ""
    },
    {
      "text": "Marc Bächlin, Kilian Förster, and Gerhard Tröster. 2009. SwimMaster: A Wearable Assistant for Swimmer. In Proceedings of the 11th International Conference on Ubiquitous Computing (UbiComp ’09), 215–224. https://doi.org/10.1145/1620545.1620578",
      "doi": "10.1145/1620545.1620578"
    },
    {
      "text": "Frédéric Bevilacqua, Eric O. Boyer, Jules Françoise, Olivier Houix, Patrick Susini, Agnès Roby-Brami, and Sylvain Hanneton. 2016. Sensori-Motor Learning with Movement Sonification: Perspectives from Recent Interdisciplinary Studies. Frontiers in Neuroscience 10. https://doi.org/10.3389/fnins.2016.00385",
      "doi": ""
    },
    {
      "text": "Agon Bexheti, Anton Fedosov, Jesper Findahl, Marc Langheinrich, and Evangelos Niforatos. 2015. Re-Live the Moment: Visualizing Run Experiences to Motivate Future Exercises. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct (MobileHCI ’15), 986–993. https://doi.org/10.1145/2786567.2794316",
      "doi": "10.1145/2786567.2794316"
    },
    {
      "text": "Dominik Bial, Thorsten Appelmann, Enrico Rukzio, and Albrecht Schmidt. 2012. Improving Cyclists Training with Tactile Feedback on Feet. In Proceedings of the 7th International Conference on Haptic and Audio Interaction Design (HAID’12), 41–50. https://doi.org/10.1007/978-3-642-32796-4_5",
      "doi": "10.1007/978-3-642-32796-4_5"
    },
    {
      "text": "Jacob T. Biehl, Piotr D. Adamczyk, and Brian P. Bailey. 2006. DJogger: A Mobile Dynamic Music Device. In CHI ’06 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’06), 556–561. https://doi.org/10.1145/1125451.1125569",
      "doi": ""
    },
    {
      "text": "Michael Mose Biskjaer, Peter Dalsgaard, and Kim Halskov. 2014. A constraint-based understanding of design spaces. In Proceedings of the 2014 conference on Designing interactive systems (DIS ’14), 453–462. https://doi.org/10.1145/2598510.2598533",
      "doi": "10.1145/2598510.2598533"
    },
    {
      "text": "Gabriele Bleser, Daniel Steffen, Markus Weber, Gustaf Hendeby, Didier Stricker, Laetitia Fradet, Frédéric Marin, Nathalie Ville, and Francois Carré. 2013. A Personalized Exercise Trainer for the Elderly. J. Ambient Intell. Smart Environ. 5, 6: 547–562.",
      "doi": "10.5555/2594719.2594721"
    },
    {
      "text": "Sander Bogers, Carl Megens, and Steven Vos. 2017. Design for Balanced Engagement in Mixed Level Sports Teams. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA ’17), 994–1002. https://doi.org/10.1145/3027063.3053351",
      "doi": "10.1145/3027063.3053351"
    },
    {
      "text": "Boon, M.J.B., Rozendaal, M.C., Stappers, P.J., Storni, C., Leahy, K., McMahon, M., Lloyd, P., and Bohemia, E. 2018. Ambiguity and Open-Endedness in Behavioural Design. In Proceedings of DRS. https://doi.org/10.21606/drs.2018.452",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Carl J. Caspersen, Kenneth E. Powell, and Gregory M. Christenson. 1985. Physical Activity, Exercise, and Physical Fitness: Definitions and Distinctions for Health-Related Research. Public Health Reports (1974-) 100, 2: 126–131.",
      "doi": ""
    },
    {
      "text": "Jr-Jung Chen, Yi-Fang Chung, Chiu-Ping Chang, Chung-Ta King, and Cheng-Hsin Hsu. 2014. A wearable virtual coach for Marathon beginners. In 2014 20th IEEE International Conference on Parallel and Distributed Systems (ICPADS), 915–920. https://doi.org/10.1109/PADSW.2014.7097908",
      "doi": ""
    },
    {
      "text": "Ed H. Chi, Jin Song, and Greg Corbin. 2004. “Killer App” of Wearable Computing: Wireless Force Sensing Body Protectors for Martial Arts. In Proceedings of the 17th Annual ACM Symposium on User Interface Software and Technology (UIST ’04), 277–285. https://doi.org/10.1145/1029632.1029680",
      "doi": "10.1145/1029632.1029680"
    },
    {
      "text": "T. Matthew Ciolek. 1983. The proxemics lexicon: A first approximation. Journal of Nonverbal Behavior 8, 1: 55–79. https://doi.org/10.1007/BF00986330",
      "doi": ""
    },
    {
      "text": "Ashley Colley, Jani Väyrynen, and Jonna Häkkilä. 2015. Skiing in a Blended Virtuality: An In-the-wild Experiment. In Proceedings of the 19th International Academic Mindtrek Conference (AcademicMindTrek ’15), 89–91. https://doi.org/10.1145/2818187.2818288",
      "doi": "10.1145/2818187.2818288"
    },
    {
      "text": "Ashley Colley, PawełW. Woźniak, Francisco Kiss, and Jonna Häkkilä. 2018. Shoe Integrated Displays: A Prototype Sports Shoe Display and Design Space. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (NordiCHI ’18), 39–46. https://doi.org/10.1145/3240167.3240216",
      "doi": "10.1145/3240167.3240216"
    },
    {
      "text": "Damien Connaghan, Sarah Hughes, Gregory May, Philip Kelly, Ciarán Ó. Conaire, Noel E. O'Connor, Donal O'Gorman, Alan F. Smeaton, and Niall Moyna. 2009. A Sensing Platform for Physiological and Contextual Feedback to Tennis Athletes. In Proceedings of the 2009 Sixth International Workshop on Wearable and Implantable Body Sensor Networks (BSN ’09), 224–229. https://doi.org/10.1109/BSN.2009.63",
      "doi": "10.1109/BSN.2009.63"
    },
    {
      "text": "Lynn Coorevits and Tanguy Coenen. 2016. The rise and fall of wearable fitness trackers. In Academy of Management. Retrieved October 7, 2019 from http://hdl.handle.net/1854/LU-8055995",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi. 1990. Flow: The Psychology of Optimal Experience. Harper & Row.",
      "doi": ""
    },
    {
      "text": "Franco Curmi, Maria Angela Ferrario, and Jon Whittle. 2017. Biometric data sharing in the wild: Investigating the effects on online sports spectators. International Journal of Human-Computer Studies 105: 56–67. https://doi.org/10.1016/j.ijhcs.2017.03.008",
      "doi": ""
    },
    {
      "text": "Ella Dagan, Elena Márquez Segura, Ferran Altarriba Bertran, Miguel Flores, Robb Mitchell, and Katherine Isbister. 2019. Design Framework for Social Wearables. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), 1001–1015. https://doi.org/10.1145/3322276.3322291",
      "doi": "10.1145/3322276.3322291"
    },
    {
      "text": "Florian Daiber, Felix Kosmalla, Frederik Wiehr, and Antonio Krüger. 2017. FootStriker: A Wearable EMS-based Foot Strike Assistant for Running. In Proceedings of the 2017 ACM International Conference on Interactive Surfaces and Spaces (ISS ’17), 421–424. https://doi.org/10.1145/3132272.3132288",
      "doi": "10.1145/3132272.3132288"
    },
    {
      "text": "Lucy E. Dunne, Halley Profita, Clint Zeagler, James Clawson, Scott Gilliland, Ellen Yi-Luen Do, and Jim Budd. 2014. The social comfort of wearable technology and gestural interaction. In 2014 36th Annual International Conference of the IEEE Engineering in Medicine and Biology Society, 4159–4162. https://doi.org/10.1109/EMBC.2014.6944540",
      "doi": ""
    },
    {
      "text": "Don Samitha Elvitigala, Denys J.C. Matthies, Löic David, Chamod Weerasinghe, and Suranga Nanayakkara. 2019. GymSoles: Improving Squats and Dead-Lifts by Visualizing the User's Center of Pressure. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 174:1–174:12. https://doi.org/10.1145/3290605.3300404",
      "doi": "10.1145/3290605.3300404"
    },
    {
      "text": "Bryn Evans. 2013. Order on the Court: The Interactional Organization of Basketball Practice Activities. Centre for Culture and Society, University of Western Sydney, Sydney NSW, Australia. Retrieved February 26, 2020 from https://researchdirect.westernsydney.edu.au/islandora/object/uws%3A22187/",
      "doi": ""
    },
    {
      "text": "Bryn Evans. 2017. Sports coaching as action-in-context: using ethnomethodological conversation analysis to understand the coaching process. Qualitative Research in Sport, Exercise and Health 9, 1: 111–132. https://doi.org/10.1080/2159676X.2016.1246473",
      "doi": ""
    },
    {
      "text": "Anton Fedosov, Evangelos Niforatos, Ivan Elhart, Teseo Schneider, Dmitry Anisimov, and Marc Langheinrich. 2016. Design and Evaluation of a Wearable AR System for Sharing Personalized Content on Ski Resort Maps. In Proceedings of the 15th International Conference on Mobile and Ubiquitous Multimedia (MUM ’16), 141–152. https://doi.org/10.1145/3012709.3012721",
      "doi": "10.1145/3012709.3012721"
    },
    {
      "text": "Corinna Feeken, Merlin Wasmann, Wilko Heuten, Dag Ennenga, Heiko Müller, and Susanne Boll. 2016. ClimbingAssist: Direct Vibro-tactile Feedback on Climbing Technique. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp ’16), 57–60. https://doi.org/10.1145/2968219.2971417",
      "doi": "10.1145/2968219.2971417"
    },
    {
      "text": "Danilo Gallo, Shreepriya Shreepriya, and Jutta Willamowski. 2020. RunAhead: Exploring Head Scanning based Navigation for Runners. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–13. https://doi.org/10.1145/3313831.3376828",
      "doi": "10.1145/3313831.3376828"
    },
    {
      "text": "F. Gemperle, C. Kasabach, J. Stivoric, M. Bauer, and R. Martin. 1998. Design for wearability. In Digest of Papers. Second International Symposium on Wearable Computers (Cat. No.98EX215), 116–122. https://doi.org/10.1109/ISWC.1998.729537",
      "doi": ""
    },
    {
      "text": "Çağlar Genç, Yavuz Ali Ekmekçioğlu, Fuat Balci, Hakan Ūrey, and Oguzhan Özcan. 2019. Howel: A Soft Wearable with Dynamic Textile Patterns As an Ambient Display for Cardio Training. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems (CHI EA ’19), LBW1312:1–LBW1312:6. https://doi.org/10.1145/3290607.3312857",
      "doi": "10.1145/3290607.3312857"
    },
    {
      "text": "Çağlar Genç, Merve Erkaya, Fuat Balcı, and Oğuzhan Özcan. 2018. Exploring Dynamic Expressions on Soft Wearables for Physical Exercises. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems (DIS ’18 Companion), 147–152. https://doi.org/10.1145/3197391.3205427",
      "doi": ""
    },
    {
      "text": "James J. Gibson. 2014. The Ecological Approach to Visual Perception: Classic Edition. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Juan Haladjian, Maximilian Reif, and Bernd Brügge. 2017. VIHapp: A Wearable System to Support Blind Skiing. In Proceedings of the 2017 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2017 ACM International Symposium on Wearable Computers (UbiComp ’17), 1033–1037. https://doi.org/10.1145/3123024.3124443",
      "doi": "10.1145/3123024.3124443"
    },
    {
      "text": "Ping-Hsuan Han, Yang-Sheng Chen, Yilun Zhong, Han-Lei Wang, and Yi-Ping Hung. 2017. My Tai-Chi Coaches: An Augmented-learning Tool for Practicing Tai-Chi Chuan. In Proceedings of the 8th Augmented Human International Conference (AH ’17), 25:1–25:4. https://doi.org/10.1145/3041164.3041194",
      "doi": "10.1145/3041164.3041194"
    },
    {
      "text": "Shoichi Hasegawa, Seiichiro Ishijima, Fumihiro Kato, Hironori Mitake, and Makoto Sato. 2012. Realtime Sonification of the Center of Gravity for Skiing. In Proceedings of the 3rd Augmented Human International Conference (AH ’12), 11:1–11:4. https://doi.org/10.1145/2160125.2160136",
      "doi": "10.1145/2160125.2160136"
    },
    {
      "text": "Peter Hassmén, Nathalie Koivula, and Antti Uutela. 2000. Physical Exercise and Psychological Well-Being: A Population Study in Finland. Preventive Medicine 30, 1: 17–25. https://doi.org/10.1006/pmed.1999.0597",
      "doi": ""
    },
    {
      "text": "Lauren Hayes and Jessica Rajko. 2017. Towards an Aesthetics of Touch. In Proceedings of the 4th International Conference on Movement Computing (MOCO ’17), 22:1–22:8. https://doi.org/10.1145/3077981.3078028",
      "doi": "10.1145/3077981.3078028"
    },
    {
      "text": "Kristina Höök. 2018. Designing with the Body: Somaesthetic Interaction Design. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong Concepts: Intermediate-level Knowledge in Interaction Design Research. ACM Trans. Comput.-Hum. Interact. 19, 3: 23:1–23:18. https://doi.org/10.1145/2362364.2362371",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Honorata Jakubowska. 2017. Skill Transmission, Sport and Tacit Knowledge: A Sociological Perspective. Routledge.",
      "doi": ""
    },
    {
      "text": "W. Larry Kenney, Jack H. Wilmore, and David L. Costill. 2019. Physiology of Sport and Exercise. Human Kinetics.",
      "doi": ""
    },
    {
      "text": "Emma M. Kidman, Matthew J.A. D'Souza, and Surya P. N. Singh. 2016. A wearable device with inertial motion tracking and vibro-tactile feedback for aesthetic sport athletes Diving Coach Monitor. In 2016 10th International Conference on Signal Processing and Communication Systems (ICSPCS), 1–6. https://doi.org/10.1109/ICSPCS.2016.7843371",
      "doi": ""
    },
    {
      "text": "Taejung Kim and Weisheng Chiu. 2019. Consumer acceptance of sports wearable technology: the role of technology readiness. International Journal of Sports Marketing and Sponsorship 20, 1: 109–126. https://doi.org/10.1108/IJSMS-06-2017-0050",
      "doi": ""
    },
    {
      "text": "Richard Kirby. 2009. Development of a real‐time performance measurement and feedback system for alpine skiers. Sports Technology 2, 1–2: 43–52. https://doi.org/10.1080/19346182.2009.9648498",
      "doi": ""
    },
    {
      "text": "Francisco Kiss, PawełW. Woźniak, Felix Scheerer, Julia Dominiak, Andrzej Romanowski, and Albrecht Schmidt. 2019. Clairbuoyance: Improving Directional Perception for Swimmers. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (CHI ’19), 237:1–237:12. https://doi.org/10.1145/3290605.3300467",
      "doi": "10.1145/3290605.3300467"
    },
    {
      "text": "Felix Kosmalla, Frederik Wiehr, Florian Daiber, Antonio Krüger, and Markus Löchtefeld. 2016. ClimbAware: Investigating Perception and Acceptance of Wearables in Rock Climbing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (CHI ’16), 1097–1108. https://doi.org/10.1145/2858036.2858562",
      "doi": "10.1145/2858036.2858562"
    },
    {
      "text": "Nils Kräuter, Stefan Lösing, Gernot Bauer, Lisa Schwering, and Matthias Seuter. 2016. Supporting Safety in Cycling Groups Using LED-augmented Gestures. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp ’16), 889–892. https://doi.org/10.1145/2968219.2968573",
      "doi": "10.1145/2968219.2968573"
    },
    {
      "text": "Oscar D. Lara and Miguel A. Labrador. 2013. A Survey on Human Activity Recognition using Wearable Sensors. IEEE Communications Surveys Tutorials 15, 3: 1192–1209. https://doi.org/10.1109/SURV.2012.110112.00192",
      "doi": ""
    },
    {
      "text": "Mark L. Latash and Vladimir Zatsiorsky. 2015. Biomechanics and Motor Control: Defining Central Concepts. Academic Press, London, UK ; San Diego, CA, USA.",
      "doi": ""
    },
    {
      "text": "Jintae Lee and Kum-Yew Lai. 1991. What's in Design Rationale? Human–Computer Interaction: 251–280. https://doi.org/10.1080/07370024.1991.9667169",
      "doi": ""
    },
    {
      "text": "Elena Márquez Segura, Laia Turmo Vidal, Luis Parrilla Bel, and Annika Waern. 2019. Circus, Play and Technology Probes: Training Body Awareness and Control with Children. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), 1223–1236. https://doi.org/10.1145/3322276.3322377",
      "doi": "10.1145/3322276.3322377"
    },
    {
      "text": "Elena Márquez Segura, Annika Waern, Jin Moen, and Carolina Johansson. 2013. The Design Space of Body Games: Technological, Physical, and Social Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’13), 3365–3374. https://doi.org/10.1145/2470654.2466461",
      "doi": "10.1145/2470654.2466461"
    },
    {
      "text": "Paul Marshall, Yvonne Rogers, and Nadia Pantidi. 2011. Using F-formations to analyse spatial patterns of interaction in physical environments. In Proceedings of the ACM 2011 conference on Computer supported cooperative work - CSCW ’11, 445. https://doi.org/10.1145/1958824.1958893",
      "doi": "10.1145/1958824.1958893"
    },
    {
      "text": "Matthew Mauriello, Michael Gubbels, and Jon E. Froehlich. 2014. Social Fabric Fitness: The Design and Evaluation of Wearable E-textile Displays to Support Group Running. In Proceedings of the 32Nd Annual ACM Conference on Human Factors in Computing Systems (CHI ’14), 2833–2842. https://doi.org/10.1145/2556288.2557299",
      "doi": ""
    },
    {
      "text": "Peter Merton McGinnis. 2013. Biomechanics of sport and exercise. Human Kinetics, Champaign, IL.",
      "doi": ""
    },
    {
      "text": "Eleonora Mencarini, Chiara Leonardi, Alessandro Cappelletti, Davide Giovanelli, Antonella De Angeli, and Massimo Zancanaro. 2019. Co-designing wearable devices for sports: The case study of sport climbing. International Journal of Human-Computer Studies 124: 26–43. https://doi.org/10.1016/j.ijhcs.2018.10.005",
      "doi": ""
    },
    {
      "text": "Eleonora Mencarini, Amon Rapp, Lia Tirabeni, and Massimo Zancanaro. 2019. Designing Wearable Systems for Sports: A Review of Trends and Opportunities in Human–Computer Interaction. IEEE Transactions on Human-Machine Systems 49, 4: 314–325. https://doi.org/10.1109/THMS.2019.2919702",
      "doi": ""
    },
    {
      "text": "Christian Meyer and Ulrich V. Wedelstaedt. 2017. Moving Bodies in Interaction - Interacting Bodies in Motion: Intercorporeality, Interkinaesthesia, and Enaction in Sports. John Benjamins Publishing Company.",
      "doi": ""
    },
    {
      "text": "Florian Michahelles and Bernt Schiele. 2005. Sensing and Monitoring Professional Skiers. IEEE Pervasive Computing 4, 3: 40–46. https://doi.org/10.1109/MPRV.2005.66",
      "doi": "10.1109/MPRV.2005.66"
    },
    {
      "text": "Annika Muehlbradt, Varsha Koushik, and Shaun K. Kane. 2017. Goby: A Wearable Swimming Aid for Blind Athletes. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’17), 377–378. https://doi.org/10.1145/3132525.3134822",
      "doi": ""
    },
    {
      "text": "Florian “Floyd” Mueller, Shannon O'Brien, and Alex Thorogood. 2007. Jogging over a Distance: Supporting a “Jogging Together” Experience Although Being Apart. In CHI ’07 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’07), 2579–2584. https://doi.org/10.1145/1240866.1241045",
      "doi": "10.1145/1240866.1241045"
    },
    {
      "text": "Florian Mueller and Damon Young. 2018. 10 Lenses to Design Sports-HCI. Foundations and Trends® Human–Computer Interaction 12, 3: 172–237. https://doi.org/10.1561/1100000076",
      "doi": ""
    },
    {
      "text": "Evangelos Niforatos, Anton Fedosov, Ivan Elhart, and Marc Langheinrich. 2017. Augmenting skiers’ peripheral perception. In Proceedings of the 2017 ACM International Symposium on Wearable Computers (ISWC ’17), 114–121. https://doi.org/10.1145/3123021.3123052",
      "doi": "10.1145/3123021.3123052"
    },
    {
      "text": "Claudia Nunez-Pacheco and Lian Loke. 2014. Crafting the Body-tool: A Body-centred Perspective on Wearable Technology. In Proceedings of the 2014 Conference on Designing Interactive Systems (DIS ’14), 553–566. https://doi.org/10.1145/2598510.2598546",
      "doi": "10.1145/2598510.2598546"
    },
    {
      "text": "Stina Nylander, Jakob Tholander, and Alex Kent. Peripheral interaction for sports – exploring two modalities for real-time feedback. 6.",
      "doi": ""
    },
    {
      "text": "Kim Oakes, Katie A. Siek, and Haley MacLeod. 2015. MuscleMemory: Identifying the Scope of Wearable Technology in High Intensity Exercise Communities. In Proceedings of the 9th International Conference on Pervasive Computing Technologies for Healthcare (PervasiveHealth ’15), 193–200. Retrieved from http://dl.acm.org/citation.cfm?id=2826165.2826193",
      "doi": ""
    },
    {
      "text": "Mitchell Page and Andrew Vande Moere. 2007. Evaluating a Wearable Display Jersey for Augmenting Team Sports Awareness. In Pervasive Computing (Lecture Notes in Computer Science), 91–108. https://doi.org/10.1007/978-3-540-72037-9_6",
      "doi": ""
    },
    {
      "text": "Hyung Kun Park and Woohun Lee. 2016. Motion Echo Snowboard: Enhancing Body Movement Perception in Sport via Visually Augmented Feedback. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems (DIS ’16), 192–203. https://doi.org/10.1145/2901790.2901797",
      "doi": "10.1145/2901790.2901797"
    },
    {
      "text": "Ashutosh Raina, T. G. Lakshmi, and Sahana Murthy. 2017. CoMBaT: Wearable Technology Based Training System for Novice Badminton Players. In 2017 IEEE 17th International Conference on Advanced Learning Technologies (ICALT), 153–157. https://doi.org/10.1109/ICALT.2017.96",
      "doi": ""
    },
    {
      "text": "Amon Rapp and Lia Tirabeni. 2018. Personal Informatics for Sport: Meaning, Body, and Social Relations in Amateur and Elite Athletes. ACM Trans. Comput.-Hum. Interact. 25, 3: 16:1–16:30. https://doi.org/10.1145/3196829",
      "doi": "10.1145/3196829"
    },
    {
      "text": "Johan Redström. 2017. Making Design Theory. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "RTD Conference, Charles Windlin, Anna Ståhl, Pedro Sanches, Vasiliki Tsaknaki, Pavel Karpashevich, Madeline Balaam, and Kristina Höök. 2019. Soma Bits: Mediating technology to orchestrate bodily experiences. Figshare. https://doi.org/10.6084/m9.figshare.7855799.v2",
      "doi": ""
    },
    {
      "text": "Alan W. Salmoni, Richard A. Schmidt, and Charles B. Walter. 1984. Knowledge of results and motor learning: A review and critical reappraisal. Psychological Bulletin 95, 3: 355–386. https://doi.org/10.1037/0033-2909.95.3.355",
      "doi": ""
    },
    {
      "text": "Mary Shaw. 2012. The Role of Design Spaces. IEEE Software 29, 1: 46–50. https://doi.org/10.1109/MS.2011.121",
      "doi": "10.1109/MS.2011.121"
    },
    {
      "text": "Roland Sigrist, Georg Rauter, Robert Riener, and Peter Wolf. 2013. Augmented visual, auditory, haptic, and multimodal feedback in motor learning: A review. Psychonomic Bulletin & Review 20, 1: 21–53. https://doi.org/10.3758/s13423-012-0333-8",
      "doi": ""
    },
    {
      "text": "Gábor Sörös, Florian Daiber, and Tomer Weller. 2013. Cyclo: A Personal Bike Coach Through the Glass. In SIGGRAPH Asia 2013 Symposium on Mobile Graphics and Interactive Applications (SA ’13), 99:1–99:4. https://doi.org/10.1145/2543651.2543660",
      "doi": ""
    },
    {
      "text": "Daniel Spelmezan. 2012. An investigation into the use of tactile instructions in snowboarding. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services - MobileHCI ’12, 417. https://doi.org/10.1145/2371574.2371639",
      "doi": "10.1145/2371574.2371639"
    },
    {
      "text": "Craig D. Stewart, Penny Traitor, and Vicki L. Hanson. 2014. I'D Tap That!: Providing Real Time Feedback on Roller Derby Skills. In CHI ’14 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’14), 2221–2226. https://doi.org/10.1145/2559206.2581310",
      "doi": ""
    },
    {
      "text": "Jelle Stienstra, Kees Overbeeke, and Stephan Wensveen. 2011. Embodying Complexity Through Movement Sonification: Case Study on Empowering the Speed-skater. In Proceedings of the 9th ACM SIGCHI Italian Chapter International Conference on Computer-Human Interaction: Facing Complexity (CHItaly), 39–44. https://doi.org/10.1145/2037296.2037310",
      "doi": "10.1145/2037296.2037310"
    },
    {
      "text": "Erik Stolterman. 2008. The Nature of Design Practice and Implications for Interaction Design Research. International Journal of Design; Taipei 2, 1. Retrieved October 23, 2017 from https://search.proquest.com/docview/921472711/abstract/C4CAC95A44D54330PQ/1",
      "doi": ""
    },
    {
      "text": "Lucy A. Suchman. 2006. Human-Machine Reconfigurations: Plans and Situated Actions. Cambridge University Press, New York, NY, USA.",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Jakob Tholander and Stina Nylander. 2015. Snot, Sweat, Pain, Mud, and Snow: Performance and Experience in the Use of Sports Watches. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI ’15), 2913–2922. https://doi.org/10.1145/2702123.2702482",
      "doi": "10.1145/2702123.2702482"
    },
    {
      "text": "Laia Turmo Vidal, Elena Márquez Segura, Christopher Boyer, and Annika Waern. 2019. Enlightened Yoga: Designing an Augmented Class with Wearable Lights to Support Instruction. In Proceedings of the 2019 on Designing Interactive Systems Conference (DIS ’19), 1017–1031. https://doi.org/10.1145/3322276.3322338",
      "doi": "10.1145/3322276.3322338"
    },
    {
      "text": "Laia Turmo Vidal, Elena Márquez Segura, and Annika Waern. 2018. Movement Correction in Instructed Fitness Training: Design Recommendations and Opportunities. In Proceedings of the 2018 Designing Interactive Systems Conference (DIS ’18), 1041–1054. https://doi.org/10.1145/3196709.3196789",
      "doi": "10.1145/3196709.3196789"
    },
    {
      "text": "Laia Turmo Vidal, Elena Márquez Segura, and Annika Waern. 2018. Sensory Bodystorming for Collocated Physical Training Design. In Proceedings of the 10th Nordic Conference on Human-Computer Interaction (NordiCHI ’18), 247–259. https://doi.org/10.1145/3240167.3240224",
      "doi": "10.1145/3240167.3240224"
    },
    {
      "text": "Laia Turmo Vidal, Hui Zhu, and Abraham Riego-Delgado. 2020. BodyLights: Open-Ended Augmented Feedback to Support Training Towards a Correct Exercise Execution. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), 1–14. https://doi.org/10.1145/3313831.3376268",
      "doi": "10.1145/3313831.3376268"
    },
    {
      "text": "Frederik Mørch Valsted, Christopher V. H. Nielsen, Jacob Qvist Jensen, Tobias Sonne, and Mads Møller Jensen. 2017. Strive: Exploring Assistive Haptic Feedback on the Run. In Proceedings of the 29th Australian Conference on Computer-Human Interaction (OZCHI ’17), 275–284. https://doi.org/10.1145/3152771.3152801",
      "doi": "10.1145/3152771.3152801"
    },
    {
      "text": "Giovanna Varni, Gualtiero Volpe, Roberto Sagoleo, Maurizio Mancini, and Giacomo Lepri. 2013. Interactive Reflexive and Embodied Exploration of Sound Qualities with BeSound. In Proceedings of the 12th International Conference on Interaction Design and Children (IDC ’13), 531–534. https://doi.org/10.1145/2485760.2485858",
      "doi": "10.1145/2485760.2485858"
    },
    {
      "text": "Annika Waern and Jon Back. 2017. Activity As the Ultimate Particular of Interaction Design. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), 3390–3402. https://doi.org/10.1145/3025453.3025990",
      "doi": "10.1145/3025453.3025990"
    },
    {
      "text": "Stephen A. Wallace and Richard W. Hagler. 1979. Knowledge of Performance and the Learning of a Closed Motor Skill. Research Quarterly. American Alliance for Health, Physical Education, Recreation and Dance 50, 2: 265–271. https://doi.org/10.1080/10671315.1979.10615609",
      "doi": ""
    },
    {
      "text": "Darren E. R. Warburton, Crystal Whitney Nicol, and Shannon S. D. Bredin. 2006. Health benefits of physical activity: the evidence. Canadian Medical Association Journal 174, 6: 801–809. https://doi.org/10.1503/cmaj.051351",
      "doi": ""
    },
    {
      "text": "A. Weilenmann and L.E. Holmquist. 1999. Hummingbirds go skiing: using wearable computers to support social interaction. In Digest of Papers. Third International Symposium on Wearable Computers, 191–192. https://doi.org/10.1109/ISWC.1999.806924",
      "doi": ""
    },
    {
      "text": "A. Mark Williams and Nicola J. Hodges. 2004. Skill Acquisition in Sport: Research, Theory and Practice. Routledge.",
      "doi": ""
    },
    {
      "text": "Pawe\\l Woźniak, Kristina Knaving, Staffan Björk, and Morten Fjeld. 2015. RUFUS: Remote Supporter Feedback for Long-Distance Runners. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI ’15), 115–124. https://doi.org/10.1145/2785830.2785893",
      "doi": ""
    },
    {
      "text": "Gabriele Wulf. 2013. Attentional focus and motor learning: a review of 15 years. International Review of Sport and Exercise Psychology 6, 1: 77–104. https://doi.org/10.1080/1750984X.2012.723728",
      "doi": ""
    },
    {
      "text": "George M. Wyburn, Ralph W. Pickford, and R. J. Hirst. 1964. Human Senses And Perception. University Of Toronto Press,.",
      "doi": ""
    },
    {
      "text": "Krystyna Zatoń and Stefan Szczepan. 2014. The Impact of Immediate Verbal Feedback on the Improvement of Swimming Technique. Journal of Human Kinetics 41: 143–154. https://doi.org/10.2478/hukin-2014-0042",
      "doi": ""
    },
    {
      "text": "Clint Zeagler. 2017. Where to wear it: functional, technical, and social considerations in on-body location for wearable technology 20 years of designing for wearability. In Proceedings of the 2017 ACM International Symposium on Wearable Computers (ISWC ’17), 150–157. https://doi.org/10.1145/3123021.3123042",
      "doi": "10.1145/3123021.3123042"
    },
    {
      "text": "Yiran Zhao, Shanu Salunke, Alexander Leavitt, Kevin Curtin, Nghia Huynh, and Clint Zeagler. 2016. E-archery: Prototype Wearable for Analyzing Archery Release. In Proceedings of the 2016 ACM International Joint Conference on Pervasive and Ubiquitous Computing: Adjunct (UbiComp ’16), 908–913. https://doi.org/10.1145/2968219.2968577",
      "doi": "10.1145/2968219.2968577"
    },
    {
      "text": "F. Zwicky. 1967. The Morphological Approach to Discovery, Invention, Research and Construction. In New Methods of Thought and Procedure, 273–297. https://doi.org/10.1007/978-3-642-87617-2_14",
      "doi": ""
    },
    {
      "text": "Fitbit Official Site for Activity Trackers and More. Retrieved September 17, 2018 from https://www.fitbit.com/se/home#",
      "doi": ""
    },
    {
      "text": "Suunto sports watches, dive products, compasses and accessories. Suunto. Retrieved September 17, 2020 from https://www.suunto.com/",
      "doi": ""
    },
    {
      "text": "ACM Digital Library. Retrieved September 12, 2020 from https://dl.acm.org/",
      "doi": ""
    },
    {
      "text": "IEEE Xplore. Retrieved September 12, 2020 from https://ieeexplore.ieee.org/Xplore/home.jsp",
      "doi": ""
    }
  ]
}