{
  "doi": "10.1145/3411764.3445496",
  "title": "KiTT - The Kinaesthetics Transfer Teacher: Design and Evaluation of a Tablet-based System to Promote the Learning of Ergonomic Patient Transfers",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "Nurses frequently transfer patients as part of their daily work. However, manual patient transfers pose a major risk to nurses’ health. Although the Kinaesthetics care conception can help address this issue, existing support to learn the concept is low. We present KiTT, a tablet-based system, to promote the learning of ergonomic patient transfers based on the Kinaesthetics care conception. KiTT supports the training of Kinaesthetics-based patient transfers by two nurses. The nurses are guided by the phases (i) interactive instructions, (ii) training of transfer conduct, and (iii) feedback and reflection. We evaluated KiTT with 26 nursing-care students in a nursing-care school. Our results indicate that KiTT provides a good subjective support for the learning of Kinaesthetics. Our results also suggest that KiTT can promote the ergonomically correct conduct of patient transfers while providing a good user experience adequate to the nursing-school context, and reveal how KiTT can extend existing practices.",
  "tags": [
    "nursing care",
    "kinaesthetics",
    "tablet-based system",
    "learning"
  ],
  "authors": [
    {
      "name": "Maximilian Dürr",
      "institution": "HCI Group University of Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659186059",
      "orcid": "missing"
    },
    {
      "name": "Marcel Borowski",
      "institution": "Department of Computer Science Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260347",
      "orcid": "missing"
    },
    {
      "name": "Carla Gröschel",
      "institution": "HCI Group University of Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260934",
      "orcid": "missing"
    },
    {
      "name": "Ulrike Pfeil",
      "institution": "HCI Group University of Konstanz, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328489771",
      "orcid": "missing"
    },
    {
      "name": "Jens Müller",
      "institution": "HCI Group University of Konstanz, Germany",
      "img": "/do/10.1145/contrib-87958747657/rel-imgonly/mueller.jpg",
      "acmid": "87958747657",
      "orcid": "missing"
    },
    {
      "name": "Harald Reiterer",
      "institution": "HCI Group University of Konstanz, Germany",
      "img": "/do/10.1145/contrib-81100236830/rel-imgonly/reiterer_2021.jpeg",
      "acmid": "81100236830",
      "orcid": "0000-0001-8528-8928"
    }
  ],
  "references": [
    {
      "text": "Fraser Anderson, Tovi Grossman, Justin Matejka, and George Fitzmaurice. 2013. YouMove: Enhancing Movement Training with an Augmented Reality Mirror. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology(UIST ’13). ACM, New York, NY, USA, 311–320. https://doi.org/10.1145/2501988.2502045",
      "doi": "10.1145/2501988.2502045"
    },
    {
      "text": "Apple Inc.2020. Apple ARKit. https://developer.apple.com/augmented-reality/arkit/ (Accessed: 2020-08-26).",
      "doi": ""
    },
    {
      "text": "European Kinaesthetics Association. 2008. Was ist Kinaesthetics? [GERMAN]. https://www.kinaesthetics.net/download/eka/infoblaetter/deutsch/Infoblatt_1_Was_ist_Kinaesthetics.pdf (Accessed: 2020-09-03).",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706qp063oa"
    },
    {
      "text": "Kup-Sze Choi, Xuejian He, Vico Chung-Lim Chiang, and Zhaohong Deng. 2015. A virtual reality based simulator for learning nasogastric tube placement. Computers in Biology and Medicine 57 (2015), 103 – 115. https://doi.org/10.1016/j.compbiomed.2014.12.006",
      "doi": "10.1016/j.compbiomed.2014.12.006"
    },
    {
      "text": "Philo Tan Chua, Rebecca Crivella, Bo Daly, Ning Hu, Russ Schaaf, David Ventura, Todd Camill, Jessica Hodgins, and Randy Pausch. 2003. Training for physical tasks in virtual environments: Tai Chi. In Proceedings - IEEE Virtual Reality. IEEE Computer Society, Los Alamitos, CA, USA, 87–94. https://doi.org/10.1109/VR.2003.1191125",
      "doi": "10.5555/832289.835983"
    },
    {
      "text": "Ina Citron. 2011. Kinästhetik-kommunikatives Bewegungslernen: mit CD-ROM [GERMAN] (3 ed.). Georg Thieme Verlag, Stuttgart. https://www.thieme.de/shop/Pruefungsliteratur/Citron-Kinaesthetik---kommunikatives-Bewegungslernen-9783131518934/p/000000000130014403",
      "doi": ""
    },
    {
      "text": "Microsoft Corporation. 2021. Microsoft Hololens 2. https://www.microsoft.com/de-de/hololens (Accessed: 2021-01-08).",
      "doi": ""
    },
    {
      "text": "Vuzix Corporation. 2021. Vuzix Blade. https://www.vuzix.com/products/blade-smart-glasses (Accessed: 2021-01-08).",
      "doi": ""
    },
    {
      "text": "Dance Reality LLC.2019. Dance Reality. https://www.dancerealityapp.com/ (Accessed: 2020-09-15).",
      "doi": ""
    },
    {
      "text": "Ilana Dubovi, Sharona T Levy, and Efrat Dagan. 2017. Now I know how! The learning process of medication administration among nursing students with non-immersive desktop virtual reality simulation. Computers & Education 113 (2017), 16–27. https://doi.org/10.1016/j.compedu.2017.05.009",
      "doi": ""
    },
    {
      "text": "Maximilian Dürr, Carla Gröschel, Ulrike Pfeil, and Harald Reiterer. 2020. NurseCare: Design and “In-The-Wild” Evaluation of a Mobile System to Promote the Ergonomic Transfer of Patients. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376851",
      "doi": "10.1145/3313831.3376851"
    },
    {
      "text": "Maximilian Dürr, Ulrike Pfeil, Jens Müller, Marcel Borowski, Carla Gröschel, and Harald Reiterer. 2019. Learning Patient Transfers with Technology: A Qualitative Investigation of the Design Space. In Proceedings of Mensch Und Computer 2019(MuC’19). ACM, New York, NY, USA, 79–90. https://doi.org/10.1145/3340764.3340784",
      "doi": "10.1145/3340764.3340784"
    },
    {
      "text": "Inga-Lill Engkvist, Mats Hagberg, Arvid Lindén, and Birgitta Malker. 1992. Over-exertion back accidents among nurses’ aides in Sweden. Safety Science 15, 2 (1992), 97–108. https://doi.org/10.1016/0925-7535(92)90010-W",
      "doi": ""
    },
    {
      "text": "Inga-Lill Engkvist, Ewa Wigaeus Hjelm, Mats Hagberg, Ewa Menckel, and Lena Ekenvall. 2000. Risk Indicators for Reported Over-Exertion Back Injuries among Female Nursing Personnel. Epidemiology 11, 5 (2000), 519–522. https://journals.lww.com/epidem/Fulltext/2000/09000/Risk_Indicators_for_Reported_Over_Exertion_Back.6.aspx",
      "doi": ""
    },
    {
      "text": "Scott A. Engum, Pamela Jeffries, and Lisa Fisher. 2003. Intravenous catheter training system: Computer-based education versus traditional learning methods. American Journal of Surgery 186, 1 (may 2003), 67–74. https://doi.org/10.1016/S0002-9610(03)00109-0",
      "doi": ""
    },
    {
      "text": "Exit Games. 2020. Photon PUN. https://assetstore.unity.com/packages/tools/network/photon-pun-classic-12080 (Accessed: 2020-03-19).",
      "doi": ""
    },
    {
      "text": "Exit Games. 2020. Photon Server. https://www.photonengine.com/server (Accessed: 2020-03-19).",
      "doi": ""
    },
    {
      "text": "Freeletics GmbH. 2020. Freeletics Coach. https://www.freeletics.com/ (Accessed: 2020-09-15).",
      "doi": ""
    },
    {
      "text": "Hans-Werner Freitag and Andreas Schulz. 2018. Datenreport 2018 - Kapitel 3: Bildung [GERMAN]. Technical Report. Statistisches Bundesamt (Destatis), Wiesbaden, WI, Germany. https://www.destatis.de/DE/Service/Statistik-Campus/Datenreport/Downloads/datenreport-2018-kap-3.html",
      "doi": ""
    },
    {
      "text": "Olivier Friard and Marco Gamba. 2016. BORIS: a free, versatile open-source event-logging software for video/audio coding and live observations. Methods in Ecology and Evolution 7, 11 (2016), 1325–1330. https://doi.org/10.1111/2041-210X.12584",
      "doi": ""
    },
    {
      "text": "André Fringer, Martina Huth, and Virpi Hantikainen. 2014. Nurses’ experiences with the implementation of the Kinaesthetics movement competence training into elderly nursing care: a qualitative focus group study. Scandinavian Journal of Caring Sciences 28, 4 (jan 2014), 757–766. https://doi.org/10.1111/scs.12108",
      "doi": ""
    },
    {
      "text": "Frank Hatch and Lenny Maietta. 2003. Kinästhetik: Gesundheitsentwicklung und menschliche Aktivitäten [GERMAN] (2 ed.). Elsevier, Urban & Fischer Verlag, München.",
      "doi": ""
    },
    {
      "text": "Zhifeng Huang, Ayanori Nagata, Masako Kanai-Pak, Jukai Maeda, Yasuko Kitajima, Mitsuhiro Nakamura, Kyoko Aida, Noriaki Kuwahara, Taiki Ogata, and Jun Ota. 2014. Robot Patient for Nursing Self-training in Transferring Patient from Bed to Wheel Chair. In Digital Human Modeling. Applications in Health, Safety, Ergonomics and Risk Management, Vincent G Duffy (Ed.). Springer International Publishing, Cham, 361–368. https://doi.org/10.1007/978-3-319-07725-3_36",
      "doi": ""
    },
    {
      "text": "Zhifeng Huang, Ayanori Nagata, Masako Kanai-Pak, Jukai Maeda, Yasuko Kitajima, Mitsuhiro Nakamura, Kyoko Aida, Noriaki Kuwahara, Taiki Ogata, and Jun Ota. 2014. Self-Help Training System for Nursing Students to Learn Patient Transfer Skills. IEEE Transactions on Learning Technologies 7, 4 (2014), 319–332. https://doi.org/10.1109/TLT.2014.2331252",
      "doi": ""
    },
    {
      "text": "Reallusion Inc.2020. iClone. https://www.reallusion.com/de/iclone/ (Accessed: 2020-07-09).",
      "doi": ""
    },
    {
      "text": "Maietta-Hatch Kinaesthetics. 2020. Kinaesthetics Apps - ‘Kinaesthetics Care’ and ‘MH Kinaesthetics’ [GERMAN]. https://www.kinaesthetics.com/at/apps.html (Accessed: 2020-09-14).",
      "doi": ""
    },
    {
      "text": "Eric Klopfer and Josh Sheldon. 2010. Augmenting your own reality: Student authoring of science-based augmented reality games. New Directions for Youth Development 2010, 128 (2010), 85–94. https://doi.org/10.1002/yd.378",
      "doi": ""
    },
    {
      "text": "Jan Patrick Kopetz, Daniel Wessel, and Nicole Jochems. 2019. User-Centered Development of Smart Glasses Support for Skills Training in Nursing Education. i-com 18, 3 (2019), 287–299. https://doi.org/10.1515/icom-2018-0043",
      "doi": ""
    },
    {
      "text": "Tore J. Larsson and Ulf Björnstig. 1995. Persistent Medical Problems and Permanent Impairment Five Years after Occupational Injury. Scandinavian Journal of Social Medicine 23, 2 (1995), 121–128. https://doi.org/10.1177/140349489502300207",
      "doi": ""
    },
    {
      "text": "Bettina Laugwitz, Theo Held, and Martin Schrepp. 2008. Construction and Evaluation of a User Experience Questionnaire. In HCI and Usability for Education and Work, Andreas Holzinger (Ed.). Springer Berlin Heidelberg, Berlin, Heidelberg, 63–76. https://doi.org/10.1007/978-3-540-89350-9_6",
      "doi": "10.1007/978-3-540-89350-9_6"
    },
    {
      "text": "LimeSurvey GmbH. 2020. Limesurvey. https://www.limesurvey.org (Accessed: 2020-08-31).",
      "doi": ""
    },
    {
      "text": "Logitech. 2020. Logitech C920 HD Pro Webcam. https://www.logitech.com/de-de/product/hd-pro-webcam-c920 (Accessed: 2020-08-18).",
      "doi": ""
    },
    {
      "text": "Jonathan Muckell, Yuchi Young, and Mitch Leventhal. 2017. A Wearable Motion Tracking System to Reduce Direct Care Worker Injuries: An Exploratory Study. In Proceedings of the 2017 International Conference on Digital Health(DH ’17). ACM, New York, NY, USA, 202–206. https://doi.org/10.1145/3079452.3079493",
      "doi": "10.1145/3079452.3079493"
    },
    {
      "text": "Noitom Ltd.2020. Perception Neuron. https://neuronmocap.com/ (Accessed: 2020-07-09).",
      "doi": ""
    },
    {
      "text": "Vern Putz-Anderson, Bruce P. Bernard, Susan E. Burt, Libby L. Cole, Fairfield-Estill Cheryl, Lawrence J. Fine, Katharyn A. Grant, Christopher Gjessing, Lynn Jenkins, Joseph J. Hurrell, Nancy Nelson, Donna Pfirman, Robert Roberts, Diana Stetson, Marie Haring-Sweeney, and Shiro Tanaka. 1997. Musculoskeletal disorders and workplace factors: a critical review of epidemiologic evidence for work-related musculoskeletal disorders of the neck, upper extremity, and low back. National Institute for Occupational Safety and Health, U. S. Department of Health and Human Services, Cincinnati, OH. https://www.cdc.gov/niosh/docs/97-141/default.html",
      "doi": ""
    },
    {
      "text": "Sarah Rampin, Rémi and Steeves, Vicky and DeMott. 2020. Taguette. https://doi.org/10.5281/10.5281/zenodo.4002742",
      "doi": ""
    },
    {
      "text": "Martin Schrepp, Andreas Hinderks, and Jörg Thomaschewski. 2017. Construction of a Benchmark for the User Experience Questionnaire (UEQ). International Journal of Interactive Multimedia and Artificial Intelligence 4, 4 (2017), 40–44. https://doi.org/10.9781/ijimai.2017.445",
      "doi": ""
    },
    {
      "text": "Martin Schrepp, Andreas Hinderks, and Jörg Thomaschewski. 2018. User Experience Questionnaire - Materials. https://www.ueq-online.org/ (Accessed: 2020-11-06).",
      "doi": ""
    },
    {
      "text": "Simon Senecal, Niels A Nijdam, Andreas Aristidou, and Nadia Magnenat-Thalmann. 2020. Salsa dance learning evaluation and motion analysis in gamified virtual reality environment. Multimedia Tools and Applications 79, 33 (2020), 24621–24643. https://doi.org/10.1007/s11042-020-09192-y",
      "doi": "10.1007/s11042-020-09192-y"
    },
    {
      "text": "Ben Shneiderman. 1996. The eyes have it: a task by data type taxonomy for information visualizations. In Proceedings 1996 IEEE Symposium on Visual Languages. IEEE Comput. Soc. Press, Boulder, CO, USA, 336–343. https://doi.org/10.1109/VL.1996.545307",
      "doi": ""
    },
    {
      "text": "Julia Smedley, Peter Egger, Cyrus Cooper, and David Coggon. 1995. Manual handling activities and risk of low back pain in nurses.Occupational and Environmental Medicine 52, 3 (1995), 160–163. https://doi.org/10.1136/oem.52.3.160",
      "doi": ""
    },
    {
      "text": "Tuukka M Takala, Yutaro Hirao, Hiroyuki Morikawa, and Takashi Kawai. 2020. Martial Arts Training in Virtual Reality with Full-body Tracking and Physically Simulated Opponents. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, New York, NY, USA, 858. https://doi.org/10.1109/VRW50115.2020.00282",
      "doi": ""
    },
    {
      "text": "Alison M. Trinkoff, Jane A. Lipscomb, Jeanne Geiger-Brown, and Barbara Brady. 2002. Musculoskeletal problems of the neck, shoulder, and back and functional consequences in nurses. American Journal of Industrial Medicine 41, 3 (2002), 170–178. https://doi.org/10.1002/ajim.10048",
      "doi": ""
    },
    {
      "text": "Unity Technologies. 2020. Unity 3D Platform. https://unity.com/ (Accessed: 2020-08-18).",
      "doi": ""
    },
    {
      "text": "Janet van der Linden, Rose Johnson, Jon Bird, Yvonne Rogers, and Erwin Schoonderwaldt. 2011. Buzzing to Play: Lessons Learned from an in the Wild Study of Real-time Vibrotactile Feedback. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). ACM, New York, NY, USA, 533–542. https://doi.org/10.1145/1978942.1979017",
      "doi": "10.1145/1978942.1979017"
    },
    {
      "text": "Wen Wen, Xiaorui Qiao, Koshiro Yanai, Junki Nakagawa, Junko Yasuda, Atsushi Yamashita, and Hajime Asama. 2017. Skill Evaluation and Education Services for Bed-Care Nursing with Sliding Sheet with Regression Analysis. In Serviceology for Smart Service System, Yuriko Sawatani, James Spohrer, Stephen Kwan, and Takeshi Takenaka (Eds.). Springer Japan, Tokyo, 253–259. https://doi.org/10.1007/978-4-431-56074-6_28",
      "doi": ""
    }
  ]
}