{
  "doi": "10.1145/3411764.3445763",
  "title": "Data Engagement Reconsidered: A Study of Automatic Stress Tracking Technology in Use",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "In today’s fast-paced world, stress has become a growing health concern. While more automatic stress tracking technologies have recently become available on wearable or mobile devices, there is still a limited understanding of how they are actually used in everyday life. This paper presents an empirical study of automatic stress-tracking technologies in use in China, based on semi-structured interviews with 17 users. The study highlights three challenges of stress-tracking data engagement that prevent effective technology usage: the lack of immediate awareness, the lack of pre-required knowledge, and the lack of corresponding communal support. Drawing on the stress-tracking practices uncovered in the study, we bring these issues to the fore, and unpack assumptions embedded in related works on self-tracking and how data engagement is approached. We end by calling for a reconsideration of data engagement as part of self-tracking practices with technologies rather than simply looking at the user interface.",
  "authors": [
    {
      "name": "Xianghua (Sharon) Ding",
      "institution": "School of Computer Science, Fudan University, China",
      "img": "/do/10.1145/contrib-81539424156/rel-imgonly/81539424156.png",
      "acmid": "81539424156",
      "orcid": "0000-0001-8122-6252"
    },
    {
      "name": "Shuhan Wei",
      "institution": "School of Computer Science, Fudan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700680",
      "orcid": "missing"
    },
    {
      "name": "Xinning Gui",
      "institution": "College of Information Sciences and Technology, Pennsylvania State University, United States",
      "img": "/do/10.1145/contrib-99658649184/rel-imgonly/with_melon_2.jpeg",
      "acmid": "99658649184",
      "orcid": "0000-0002-9436-7940"
    },
    {
      "name": "Ning Gu",
      "institution": "School of Computer Science, Fudan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100501434",
      "orcid": "0000-0002-2915-974X"
    },
    {
      "name": "Peng Zhang",
      "institution": "School of Computer Science, Fudan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87358745057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "U Rajendra Acharya, K Paul Joseph, Natarajan Kannathal, Choo Min Lim, and Jasjit S Suri. 2006. Heart rate variability: a review. Medical and biological engineering and computing 44, 12(2006), 1031–1051.",
      "doi": ""
    },
    {
      "text": "Phil Adams, Mashfiqui Rabbi, Tauhidur Rahman, Mark Matthews, Amy Voida, Geri Gay, Tanzeem Choudhury, and Stephen Voida. 2014. Towards personal stress informatics: comparing minimally invasive techniques for measuring daily stress in the wild. In Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare. ICST (Institute for Computer Sciences, Social-Informatics and …, 72–79.",
      "doi": "10.4108/icst.pervasivehealth.2014.254959"
    },
    {
      "text": "Ana C Aguiar, Mariana Kaiseler, Hugo Meinedo, Traian E Abrudan, and Pedro R Almeida. 2013. Speech stress assessment using physiological and psychological measures. In Proceedings of the 2013 ACM conference on Pervasive and ubiquitous computing adjunct publication. ACM, 921–930.",
      "doi": "10.1145/2494091.2497346"
    },
    {
      "text": "David R Bassett, Lindsay P Toth, Samuel R LaMunion, and Scott E Crouter. 2017. Step counting: a review of measurement considerations and health-related applications. Sports Medicine 47, 7 (2017), 1303–1315.",
      "doi": ""
    },
    {
      "text": "Eric PS Baumer. 2015. Reflective informatics: conceptual dimensions for designing technologies of reflection. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 585–594.",
      "doi": "10.1145/2702123.2702234"
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: Presenting statistical patterns between wellbeing data and context in natural language to promote behavior change. ACM Transactions on Computer-Human Interaction (TOCHI) 20, 5(2013), 30.",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Andrey Bogomolov, Bruno Lepri, Michela Ferron, Fabio Pianesi, and Alex Sandy Pentland. 2014. Daily stress recognition from mobile phone data, weather conditions and individual traits. In Proceedings of the 22nd ACM international conference on Multimedia. ACM, 477–486.",
      "doi": "10.1145/2647868.2654933"
    },
    {
      "text": "Rick Bonney, Tina B Phillips, Heidi L Ballard, and Jody W Enck. 2016. Can citizen science enhance public understanding of science?Public Understanding of Science 25, 1 (2016), 2–16.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2019. Reflecting on reflexive thematic analysis. Qualitative Research in Sport, Exercise and Health 11, 4 (2019), 589–597.",
      "doi": ""
    },
    {
      "text": "Gillian Butler. 1993. Definitions of stress.Occasional paper (Royal College of General Practitioners)61 (1993), 1.",
      "doi": ""
    },
    {
      "text": "Clara Caldeira, Yu Chen, Lesley Chan, Vivian Pham, Yunan Chen, and Kai Zheng. 2017. Mobile apps for mood tracking: an analysis of features and user reviews. In AMIA Annual Symposium Proceedings, Vol. 2017. American Medical Informatics Association, 495.",
      "doi": ""
    },
    {
      "text": "Rossana Castaldo, Luis Montesinos, Paolo Melillo, Sebastiano Massaro, and Leandro Pecchia. 2017. To What Extent Can We Shorten HRV Analysis in Wearable Sensing? A Case Study on Mental Stress Detection.In EMBEC & NBC 2017. Springer, 643–646.",
      "doi": ""
    },
    {
      "text": "Tarani Chandola, Eric Brunner, and Michael Marmot. 2006. Chronic stress at work and the metabolic syndrome: prospective study. Bmj 332, 7540 (2006), 521–525.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Saeed Abdullah, Mashfiqui Rabbi, Edison Thomaz, Daniel A Epstein, Felicia Cordeiro, Matthew Kay, Gregory D Abowd, Tanzeem Choudhury, James Fogarty, 2017. Semi-automated tracking: a balanced approach for self-monitoring applications. IEEE Pervasive Computing 16, 1 (2017), 74–84.",
      "doi": "10.1109/mprv.2017.18"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B Lee, Bongshin Lee, Wanda Pratt, and Julie A Kientz. 2014. Understanding quantified-selfers’ practices in collecting and exploring personal data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1143–1152.",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Michael E Clark and Richard Hirschman. 1990. Effects of paced respiration on anxiety reduction in a clinical population. Biofeedback and Self-regulation 15, 3 (1990), 273–284.",
      "doi": ""
    },
    {
      "text": "James Clawson, Jessica A Pater, Andrew D Miller, Elizabeth D Mynatt, and Lena Mamykina. 2015. No longer wearing: investigating the abandonment of personal health-tracking technologies on craigslist. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 647–658.",
      "doi": "10.1145/2750858.2807554"
    },
    {
      "text": "Karen Anne Cochrane. 2019. Reconnecting the Body and the Mind: Technology to Support Mindfulness for Stress. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, DC05.",
      "doi": "10.1145/3290607.3299083"
    },
    {
      "text": "Sheldon Cohen, Denise Janicki-Deverts, and Gregory E Miller. 2007. Psychological stress and disease. Jama 298, 14 (2007), 1685–1687.",
      "doi": ""
    },
    {
      "text": "Allen Elkin. 2013. Stress management for dummies. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Daniel A Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A Munson. 2016. Beyond abandonment to next steps: understanding and designing for life after personal informatics tool use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 1109–1113.",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Daniel A Epstein, Nicole B Lee, Jennifer H Kang, Elena Agapie, Jessica Schroeder, Laura R Pina, James Fogarty, Julie A Kientz, and Sean Munson. 2017. Examining menstrual tracking to inform the design of personal informatics tools. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 6876–6888.",
      "doi": "10.1145/3025453.3025635"
    },
    {
      "text": "Clayton Feustel, Shyamak Aggarwal, Bongshin Lee, and Lauren Wilcox. 2018. People Like Me: Designing for Reflection on Aggregate Cohort Data in Personal Informatics Systems. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 1–21.",
      "doi": "10.1145/3264917"
    },
    {
      "text": "Susan Folkman and Judith Tedlie Moskowitz. 2000. Stress, positive emotion, and coping. Current directions in psychological science 9, 4 (2000), 115–118.",
      "doi": ""
    },
    {
      "text": "Thomas Fritz, Elaine M Huang, Gail C Murphy, and Thomas Zimmermann. 2014. Persuasive technology in the real world: a study of long-term use of activity sensing devices for fitness. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 487–496.",
      "doi": "10.1145/2556288.2557383"
    },
    {
      "text": "Mads Frost, Afsaneh Doryab, Maria Faurholt-Jepsen, Lars Vedel Kessing, and Jakob E Bardram. 2013. Supporting disease insight through data analysis: refinements of the monarca self-assessment system. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. ACM, 133–142.",
      "doi": "10.1145/2493432.2493507"
    },
    {
      "text": "Shreyans Gandhi, Maryam Shojaei Baghini, and Soumyo Mukherji. 2015. Mental stress assessment-a comparison between HRV based and respiration based techniques. In 2015 Computing in Cardiology Conference (CinC). IEEE, 1029–1032.",
      "doi": ""
    },
    {
      "text": "Lisa Graham, Anthony Tang, and Carman Neustaedter. 2016. Help me help you: Shared reflection for personal data. In Proceedings of the 19th International Conference on Supporting Group Work. 99–109.",
      "doi": "10.1145/2957276.2957293"
    },
    {
      "text": "Kirsi Halttu and Harri Oinas-Kukkonen. 2017. Persuading to reflect: role of reflection and insight in persuasive systems design for physical health. Human–Computer Interaction 32, 5-6 (2017), 381–412.",
      "doi": ""
    },
    {
      "text": "Constance Hammen. 2005. Stress and depression. Annu. Rev. Clin. Psychol. 1 (2005), 293–319.",
      "doi": ""
    },
    {
      "text": "Daniel Harrison, Paul Marshall, Nadia Bianchi-Berthouze, and Jon Bird. 2015. Activity tracking: barriers, workarounds and customisation. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 617–621.",
      "doi": "10.1145/2750858.2805832"
    },
    {
      "text": "Javier Hernandez, Pablo Paredes, Asta Roseway, and Mary Czerwinski. 2014. Under pressure: sensing stress of computer users. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 51–60.",
      "doi": "10.1145/2556288.2557165"
    },
    {
      "text": "Karen Hovsepian, Mustafa al’Absi, Emre Ertin, Thomas Kamarck, Motohiro Nakajima, and Santosh Kumar. 2015. cStress: towards a gold standard for continuous stress assessment in the mobile environment. In Proceedings of the 2015 ACM international joint conference on pervasive and ubiquitous computing. ACM, 493–504.",
      "doi": "10.1145/2750858.2807526"
    },
    {
      "text": "Bellabeat Inc. [n.d.]. Bellabeat Leaf. https://www.bellabeat.com/pages/leaf-urban-features",
      "doi": ""
    },
    {
      "text": "Garmin Inc. [n.d.]. Garmin. https://www.garmin.com",
      "doi": ""
    },
    {
      "text": "Healbe Inc. [n.d.]. Healbe GoBe2 smart band. https://healbe.com/",
      "doi": ""
    },
    {
      "text": "Huawei Inc. [n.d.]. Huawei. https://consumer.huawei.com/en/wearables/",
      "doi": ""
    },
    {
      "text": "Samsung Inc. [n.d.]. Samsung Galaxy Watch. https://www.samsung.com/global/galaxy/galaxy-watch/",
      "doi": ""
    },
    {
      "text": "Spire Health Inc. [n.d.]. Spire Stone. https://spirehealth.com/pages/stone",
      "doi": ""
    },
    {
      "text": "Wellbe Inc. [n.d.]. The WellBe Bracelet. https://thewellbe.com/products/the-wellbe-bracelet?variant=17684417799",
      "doi": ""
    },
    {
      "text": "Simon L Jones and Ryan Kelly. 2018. Dealing with information overload in multifaceted personal informatics systems. Human–Computer Interaction 33, 1 (2018), 1–48.",
      "doi": ""
    },
    {
      "text": "Matthew Kay. 2014. Challenges in personal health tracking: the data isn’t enough. XRDS: Crossroads, The ACM Magazine for Students 21, 2 (2014), 32–37.",
      "doi": "10.1145/2678024"
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-tracking for mental wellness: understanding expert perspectives and student experiences. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 629–641.",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Hye-Geum Kim, Eun-Jin Cheon, Dai-Seg Bai, Young Hwan Lee, and Bon-Hoon Koo. 2018. Stress and heart rate variability: A meta-analysis and review of the literature. Psychiatry investigation 15, 3 (2018), 235.",
      "doi": ""
    },
    {
      "text": "Wendy EJ Knight and Nikki S Rickard. 2001. Relaxing music prevents stress-induced increases in subjective anxiety, systolic blood pressure, and heart rate in healthy males and females. Journal of music therapy 38, 4 (2001), 254–272.",
      "doi": ""
    },
    {
      "text": "Kari Kuutti and Liam J Bannon. 2014. The turn to practice in HCI: towards a research agenda. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3543–3552.",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Jean Lave, Etienne Wenger, 1991. Situated learning: Legitimate peripheral participation. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Christian Koehler, Joshua Tanenbaum, and David H Nguyen. 2015. Why we use and abandon smart devices. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 635–646.",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "Richard S Lazarus, Anita DeLongis, Susan Folkman, and Rand Gruen. 1985. Stress and adaptational outcomes: The problem of confounded measures.(1985).",
      "doi": ""
    },
    {
      "text": "Richard S Lazarus and Richard S Lazarus. 1991. Emotion and adaptation. Oxford University Press on Demand.",
      "doi": ""
    },
    {
      "text": "Mark Le Fevre, Jonathan Matheny, and Gregory S Kolt. 2003. Eustress, distress, and interpretation in occupational stress. Journal of managerial psychology 18, 7 (2003), 726–744.",
      "doi": ""
    },
    {
      "text": "Kwangyoung Lee and Hwajung Hong. 2018. MindNavigator: Exploring the Stress and Self-Interventions for Mental Wellness. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 572.",
      "doi": "10.1145/3173574.3174146"
    },
    {
      "text": "Fenghua Li, Peida Xu, Shichun Zheng, Wenfeng Chen, Yang Yan, Suo Lu, and Zhengkui Liu. 2018. Photoplethysmography based psychological stress detection with pulse rate variability feature differences and elastic net. International Journal of Distributed Sensor Networks 14, 9 (2018), 1550147718803298.",
      "doi": ""
    },
    {
      "text": "Ian Li. 2009. Beyond counting steps: Using context to improve monitoring of physical activity. (2009).",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A stage-based model of personal informatics systems. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 557–566.",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Ian Li, Anind K Dey, and Jodi Forlizzi. 2012. Using context to reveal factors that affect physical activity. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 1(2012), 1–21.",
      "doi": "10.1145/2147783.2147790"
    },
    {
      "text": "James J Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B Strub. 2006. Fish’n’Steps: Encouraging physical activity with an interactive computer game. In International conference on ubiquitous computing. Springer, 261–278.",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Wan-Hua Lin, Dan Wu, Chunyue Li, Heye Zhang, and Yuan-Ting Zhang. 2014. Comparison of heart rate variability from PPG with that from ECG. In The International Conference on Health Informatics. Springer, 213–215.",
      "doi": ""
    },
    {
      "text": "Hong Lu, Denise Frauendorfer, Mashfiqui Rabbi, Marianne Schmid Mast, Gokul T Chittaranjan, Andrew T Campbell, Daniel Gatica-Perez, and Tanzeem Choudhury. 2012. Stresssense: Detecting stress in unconstrained acoustic environments using smartphones. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing. ACM, 351–360.",
      "doi": "10.1145/2370216.2370270"
    },
    {
      "text": "Yongqiang Lyu, Xiaomin Luo, Jun Zhou, Chun Yu, Congcong Miao, Tong Wang, Yuanchun Shi, and Ken-ichi Kameyama. 2015. Measuring photoplethysmogram-based stress-induced vascular response index to assess cognitive load and stress. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 857–866.",
      "doi": "10.1145/2702123.2702399"
    },
    {
      "text": "Diana MacLean, Asta Roseway, and Mary Czerwinski. 2013. MoodWings: a wearable biofeedback device for real-time stress intervention. In Proceedings of the 6th international conference on PErvasive Technologies Related to Assistive Environments. ACM, 66.",
      "doi": "10.1145/2504335.2504406"
    },
    {
      "text": "Marek Malik. 1996. Heart rate variability: Standards of measurement, physiological interpretation, and clinical use: Task force of the European Society of Cardiology and the North American Society for Pacing and Electrophysiology. Annals of Noninvasive Electrocardiology 1, 2 (1996), 151–181.",
      "doi": ""
    },
    {
      "text": "Lena Mamykina, Elizabeth D Mynatt, and David R Kaufman. 2006. Investigating health management practices of individuals with diabetes. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 927–936.",
      "doi": "10.1145/1124772.1124910"
    },
    {
      "text": "Karen A Matthews and Brooks B Gump. 2002. Chronic work stress and marital dissolution increase risk of posttrial mortality in men from the Multiple Risk Factor Intervention Trial. Archives of Internal Medicine 162, 3 (2002), 309–315.",
      "doi": ""
    },
    {
      "text": "Mark Matthews, Stephen Voida, Saeed Abdullah, Gavin Doherty, Tanzeem Choudhury, Sangha Im, and Geri Gay. 2015. In situ design for mental illness: Considering the pathology of bipolar disorder in mhealth design. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services. 86–97.",
      "doi": "10.1145/2785830.2785866"
    },
    {
      "text": "Paolo Melillo, Marcello Bracale, and Leandro Pecchia. 2011. Nonlinear Heart Rate Variability features for real-life stress detection. Case study: students under stress due to university examination. Biomedical engineering online 10, 1 (2011), 96.",
      "doi": ""
    },
    {
      "text": "Nermine Munla, Mohamad Khalil, Ahmad Shahin, and Azzam Mourad. 2015. Driver stress level detection using HRV analysis. In 2015 International Conference on Advances in Biomedical Engineering (ICABME). IEEE, 61–64.",
      "doi": ""
    },
    {
      "text": "Pablo Paredes and Matthew Chan. 2011. CalmMeNow: exploratory research and design of stress mitigating mobile interventions. In CHI’11 Extended Abstracts on Human Factors in Computing Systems. ACM, 1699–1704.",
      "doi": ""
    },
    {
      "text": "Misha Patel and Aisling Ann O’Kane. 2015. Contextual influences on the use and non-use of digital technology while exercising at the gym. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 2923–2932.",
      "doi": "10.1145/2702123.2702384"
    },
    {
      "text": "Thomas G. Pickering. 2001. Mental stress as a causal factor in the development of hypertension and cardiovascular disease. Current Hypertension Reports 3, 3 (2001), 249–54.",
      "doi": ""
    },
    {
      "text": "Bernd Ploderer, Wolfgang Reitberger, Harri Oinas-Kukkonen, and Julia van Gemert-Pijnen. 2014. Social interaction and reflection for behaviour change.",
      "doi": ""
    },
    {
      "text": "Sharon Praissman. 2008. Mindfulness-based stress reduction: A literature review and clinician’s guide. Journal of the American Academy of Nurse Practitioners 20, 4(2008), 212–216.",
      "doi": ""
    },
    {
      "text": "Nora Ptakauskaite, Anna L Cox, and Nadia Berthouze. 2018. Knowing what you’re doing or knowing what to do: how stress management apps support reflection and behaviour change. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, LBW599.",
      "doi": "10.1145/3170427.3188648"
    },
    {
      "text": "Amon Rapp and Federica Cena. 2016. Personal informatics for everyday life: How users without prior self-tracking experience engage with personal data. International Journal of Human-Computer Studies 94 (2016), 1–17.",
      "doi": "10.1016/j.ijhcs.2016.05.006"
    },
    {
      "text": "Amon Rapp, Alessandro Marcengo, Luca Buriano, Giancarlo Ruffo, Mirko Lai, and Federica Cena. 2018. Designing a personal informatics system for users without experience in self-tracking: a case study. Behaviour & Information Technology 37, 4 (2018), 335–366.",
      "doi": ""
    },
    {
      "text": "Ruth Ravichandran, Sang-Wha Sien, Shwetak N Patel, Julie A Kientz, and Laura R Pina. 2017. Making sense of sleep sensors: How sleep sensing technologies support and undermine sleep health. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 6864–6875.",
      "doi": "10.1145/3025453.3025557"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1163–1172.",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Annika Rosengren, Steven Hawken, Stephanie Ôunpuu, Karen Sliwa, Mohammad Zubaid, Wael A Almahmeed, Kathleen Ngu Blackett, Chitr Sitthi-amorn, Hiroshi Sato, Salim Yusuf, 2004. Association of psychosocial risk factors with risk of acute myocardial infarction in 11119 cases and 13648 controls from 52 countries (the INTERHEART study): case-control study. The Lancet 364, 9438 (2004), 953–962.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Kristina Höök, Elsa Vaara, Claus Weymann, Markus Bylund, Pedro Ferreira, Nathalie Peira, and Marie Sjölinder. 2010. Mind the body!: designing a mobile stress management application encouraging personal reflection. In Proceedings of the 8th ACM conference on designing interactive systems. ACM, 47–56.",
      "doi": "10.1145/1858171.1858182"
    },
    {
      "text": "Hans Selye. 1965. The stress syndrome. The American Journal of Nursing(1965), 97–99.",
      "doi": ""
    },
    {
      "text": "Moushumi Sharmin, Andrew Raij, David Epstien, Inbal Nahum-Shani, J Gayle Beck, Sudip Vhaduri, Kenzie Preston, and Santosh Kumar. 2015. Visualization of time-series sensor data to inform the design of just-in-time adaptive stress interventions. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 505–516.",
      "doi": "10.1145/2750858.2807537"
    },
    {
      "text": "Petr Slovák, Christopher Frauenberger, and Geraldine Fitzpatrick. 2017. Reflective practicum: A framework of sensitising concepts to design for transformative reflection. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 2696–2707.",
      "doi": "10.1145/3025453.3025516"
    },
    {
      "text": "Andrew Steptoe. 1991. Invited review: The links between stress and illness. Journal of psychosomatic research 35, 6 (1991), 633–644.",
      "doi": ""
    },
    {
      "text": "Feng-Tso Sun, Cynthia Kuo, Heng-Tze Cheng, Senaka Buthpitiya, Patricia Collins, and Martin Griss. 2010. Activity-aware mental stress detection using physiological sensors. In International conference on Mobile computing, applications, and services. Springer, 282–301.",
      "doi": ""
    },
    {
      "text": "Tencent. 2018. 2015 Smart Wearable Devices Market White Paper. https://cloud.tencent.com/developer/article/1154297",
      "doi": ""
    },
    {
      "text": "Jonathan Tudge. 1992. Vygotsky, the zone of proximal development, and peer collaboration: Implications for classroom practice.(1992).",
      "doi": ""
    },
    {
      "text": "Rubén Vicente-Sáez and Clara Martínez-Fuentes. 2018. Open Science now: A systematic literature review for an integrated definition. Journal of business research 88 (2018), 428–436.",
      "doi": ""
    },
    {
      "text": "Elena Vildjiounaite, Johanna Kallio, Vesa Kyllönen, Mikko Nieminen, Ilmari Määttänen, Mikko Lindholm, Jani Mäntyjärvi, and Georgy Gimel’farb. 2018. Unobtrusive stress detection on the basis of smartphone usage data. Personal and Ubiquitous Computing 22, 4 (2018), 671–688.",
      "doi": "10.1007/s00779-017-1108-z"
    },
    {
      "text": "Lisa M Vizer. 2009. Detecting cognitive and physical stress through typing behavior. In CHI’09 Extended Abstracts on Human Factors in Computing Systems. ACM, 3113–3116.",
      "doi": ""
    },
    {
      "text": "Bin Yu, Mathias Funk, Jun Hu, and Loe Feijs. 2017. StressTree: a metaphorical visualization for biofeedback-assisted stress management. In Proceedings of the 2017 conference on designing interactive systems. 333–337.",
      "doi": "10.1145/3064663.3064729"
    },
    {
      "text": "ZDC互联网消费调研中心. [n.d.]. 中国智能手环品牌占有率(Share of Chinese smart bracelet brands). http://top.zol.com.cn/compositor/trend_829.html",
      "doi": ""
    },
    {
      "text": "ZDC互联网消费调研中心. [n.d.]. 中国智能手表品牌占有率(Share of Chinese smartwatch brands). http://top.zol.com.cn/compositor/trend_827.html",
      "doi": ""
    }
  ]
}