{
  "doi": "10.1145/3411764.3445397",
  "title": "#StayHome #WithMe: How Do YouTubers Help with COVID-19 Loneliness?",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Loneliness threatens public mental wellbeing during COVID-19. In response, YouTube creators participated in the #StayHome #WithMe movement (SHWM) and made myriad videos for people experiencing loneliness or boredom at home. User-shared videos generate parasocial attachment and virtual connectedness. However, there is limited knowledge of how creators contributed videos during disasters to provide social provisions as disaster-relief. Grounded on Weiss’s loneliness theory, this work analyzed 1488 SHWM videos to examine video sharing as a pathway to social provisions. Findings suggested that skill and knowledge sharing, entertaining arts, homelife activities, live chatting, and gameplay were the most popular video styles. YouTubers utilized parasocial relationships to form a space for staying away from the disaster. SHWM YouTubers provided friend-like, mentor-like, and family-like provisions through videos in different styles. Family-like provisions led to the highest overall viewer engagement. Based on the findings, design implications for supporting viewers’ mental wellbeing in disasters are discussed.",
  "authors": [
    {
      "name": "Shuo Niu",
      "institution": "Mathematics and Computer Science, Clark University, United States",
      "img": "/do/10.1145/contrib-81548540456/rel-imgonly/photo-r.jpg",
      "acmid": "81548540456",
      "orcid": "0000-0002-8316-4785"
    },
    {
      "name": "Ava Bartolome",
      "institution": "Mathematics and Computer Science, Clark University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702364",
      "orcid": "0000-0002-3867-994X"
    },
    {
      "name": "Cat Mai",
      "institution": "Mathematics and Computer Science, Clark University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701468",
      "orcid": "missing"
    },
    {
      "name": "Nguyen Binh Ha",
      "institution": "Mathematics and Computer Science, Clark University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700887",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Joceline Andersen. 2014. Now You’ve Got the Shiveries: Affect, Intimacy, and the ASMR Whisper Community. Television & New Media 16, 8 (11 2014), 683–700. https://doi.org/10.1177/1527476414556184",
      "doi": ""
    },
    {
      "text": "Laurensia Anjani, Terrance Mok, Anthony Tang, Lora Oehlberg, and Wooi Boon Goh. 2020. Why Do People Watch Others Eat Food? An Empirical Study on the Motivations and Practices of Mukbang Viewers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376567",
      "doi": "10.1145/3313831.3376567"
    },
    {
      "text": "Shrey Bagroy, Ponnurangam Kumaraguru, and Munmun De Choudhury. 2017. A Social Media Based Index of Mental Well-Being in College Campuses. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 1634–1646. https://doi.org/10.1145/3025453.3025909",
      "doi": "10.1145/3025453.3025909"
    },
    {
      "text": "Corey H Basch, Charles E Basch, Kelly V Ruggles, and Rodney Hammond. 2015. Coverage of the Ebola virus disease epidemic on YouTube. Disaster medicine and public health preparedness 9, 5(2015), 531–535. https://doi.org/10.1017/dmp.2015.77",
      "doi": ""
    },
    {
      "text": "Deanne Bird, Megan Ling, and Katharine Haynes. 2012. Flooding Facebook–the use of social media during the queensland and Victorian floods. INTERES 27, 1 (2012), 27.",
      "doi": ""
    },
    {
      "text": "Youmna Borghol, Sebastien Ardon, Niklas Carlsson, Derek Eager, and Anirban Mahanti. 2012. The Untold Story of the Clones: Content-Agnostic Factors That Impact YouTube Video Popularity. In Proceedings of the 18th ACM SIGKDD International Conference on Knowledge Discovery and Data Mining(KDD ’12). Association for Computing Machinery, New York, NY, USA, 1186–1194. https://doi.org/10.1145/2339530.2339717",
      "doi": "10.1145/2339530.2339717"
    },
    {
      "text": "Jean Burgess and Joshua Green. 2018. YouTube: Online video and participatory culture. John Wiley & Sons, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz and Linda Liska Belgrave. 2015. Grounded Theory. https://doi.org/10.1002/9781405165518.wbeosg070.pub2",
      "doi": ""
    },
    {
      "text": "G Chatzopoulou, C Sheng, and M Faloutsos. 2010. A First Step Towards Understanding Popularity in YouTube. In 2010 INFOCOM IEEE Conference on Computer Communications Workshops. IEEE, San Diego, CA, USA, 1–6. https://doi.org/10.1109/INFCOMW.2010.5466701",
      "doi": ""
    },
    {
      "text": "Clement Chau. 2010. YouTube as a participatory culture. New Directions for Youth Development 2010, 128 (2010), 65–74. https://doi.org/10.1002/yd.376",
      "doi": ""
    },
    {
      "text": "Apoorva Chauhan and Amanda L Hughes. 2017. Providing Online Crisis Information: An Analysis of Official Sources during the 2014 Carlton Complex Wildfire. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 3151–3162. https://doi.org/10.1145/3025453.3025627",
      "doi": "10.1145/3025453.3025627"
    },
    {
      "text": "Xianhui Che, Barry Ip, and Ling Lin. 2015. A Survey of Current YouTube Video Characteristics. IEEE MultiMedia 22, 2 (2015), 56–63. https://doi.org/10.1109/MMUL.2015.34",
      "doi": "10.1109/MMUL.2015.34"
    },
    {
      "text": "Chih-Ping Chen. 2014. Forming digital self and parasocial relationships on YouTube. Journal of Consumer Culture 16, 1 (2 2014), 232–254. https://doi.org/10.1177/1469540514521081",
      "doi": ""
    },
    {
      "text": "Carolyn E Cutrona and Daniel W Russell. 1987. The provisions of social relationships and adaptation to stress. Advances in personal relationships 1, 1 (1987), 37–67.",
      "doi": ""
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting depression via social media.Icwsm 13(2013), 1–10.",
      "doi": ""
    },
    {
      "text": "Wendy E Ellis, Tara M Dumas, and Lindsey M Forbes. 2020. Physically isolated but socially connected: Psychological adjustment and stress among adolescents during the initial COVID-19 crisis.Canadian Journal of Behavioural Science / Revue canadienne des sciences du comportement 52, 3 (2020), 177–187. https://doi.org/10.1037/cbs0000215",
      "doi": ""
    },
    {
      "text": "Jordan Eschler, Eleanor R Burgess, Madhu Reddy, and David C Mohr. 2020. Emergent Self-Regulation Practices in Technology and Social Media Use of Individuals Living with Depression. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376773",
      "doi": "10.1145/3313831.3376773"
    },
    {
      "text": "Lauren Fratamico and Deb Roy. 2019. I’m Lonely. Who Should I Talk To?. In Companion Proceedings of The 2019 World Wide Web Conference(WWW ’19). Association for Computing Machinery, New York, NY, USA, 631–634. https://doi.org/10.1145/3308560.3317309",
      "doi": "10.1145/3308560.3317309"
    },
    {
      "text": "Wendi L Gardner, Cynthia L Pickett, and Megan Knowles. 2005. Social snacking and shielding. In The social outcast: Ostracism, social exclusion, rejection, and bullying. Psychology Press New York, NY, New York, NY, 227–242.",
      "doi": ""
    },
    {
      "text": "David C Giles. 2002. Parasocial Interaction: A Review of the Literature and a Model for Future Research. Media Psychology 4, 3 (8 2002), 279–305. https://doi.org/10.1207/S1532785XMEP0403_04",
      "doi": ""
    },
    {
      "text": "Kimberly Glasgow, Jessica Vitak, Yla Tausczik, and Clay Fink. 2016. Grieving in the 21st Century: Social Media’s Role in Facilitating Supportive Exchanges Following Community-Level Traumatic Events. In Proceedings of the 7th 2016 International Conference on Social Media & Society(SMSociety ’16). Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/2930971.2930975",
      "doi": "10.1145/2930971.2930975"
    },
    {
      "text": "Jenny M Groarke, Emma Berry, Lisa Graham-Wisener, Phoebe E McKenna-Plumley, Emily McGlinchey, and Cherie Armour. 2020. Loneliness in the UK during the COVID-19 pandemic: Cross-sectional results from the COVID-19 Psychological Wellbeing Study. PloS one 15, 9 (2020), e0239698. https://doi.org/10.1371/journal.pone.0239698",
      "doi": ""
    },
    {
      "text": "Xinning Gui, Yubo Kou, Kathleen Pine, Elisa Ladaw, Harold Kim, Eli Suzuki-Gill, and Yunan Chen. 2018. Multidimensional Risk Communication: Public Discourse on Risks during an Emerging Epidemic. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173788",
      "doi": "10.1145/3173574.3173788"
    },
    {
      "text": "Tilo Hartmann. 2017. Parasocial interaction, parasocial relationships, and well-being.In The Routledge handbook of media use and well-being: International perspectives on theory and research on positive media effects.Routledge/Taylor & Francis Group, New York, NY, US, 131–144. https://doi.org/10.4324/9781315714752",
      "doi": ""
    },
    {
      "text": "Donald Horton and R Richard Wohl. 1956. Mass Communication and Para-Social Interaction. Psychiatry 19, 3 (8 1956), 215–229. https://doi.org/10.1080/00332747.1956.11023049",
      "doi": ""
    },
    {
      "text": "Mingyi Hou. 2018. Social media celebrity and the institutionalization of YouTube. Convergence 25, 3 (1 2018), 534–553. https://doi.org/10.1177/1354856517750368",
      "doi": ""
    },
    {
      "text": "J Brian Houston, Joshua Hawthorne, Mildred F Perreault, Eun Hae Park, Marlo Goldstein Hode, Michael R Halliwell, Sarah E Turner McGowen, Rachel Davis, Shivani Vaid, Jonathan A McElderry, and Stanford A Griffith. 2015. Social media and disasters: a functional framework for social media use in disaster planning, response, and research. Disasters 39, 1 (2015), 1–22. https://doi.org/10.1111/disa.12092",
      "doi": ""
    },
    {
      "text": "Mu Hu, Mingli Zhang, and Nuan Luo. 2016. Understanding participation on video sharing communities: The role of self-construal and community interactivity. Computers in Human Behavior 62 (2016), 105–115. https://doi.org/10.1016/j.chb.2016.03.077",
      "doi": "10.1016/j.chb.2016.03.077"
    },
    {
      "text": "Mu Hu, Yueyu Zhao, Zitong Liu, Ziyu Li, and Ximin Kong. 2020. Just my imagination: The influence of celebrities’ romantic relationship announcements on romance fans and friendship fans.In Psychology of Popular Media. Educational Publishing Foundation, Hu, Mu: College of Arts and Sciences, Texas A&M University-San Antonio, One University Way, San Antonio, TX, US, 78224, mhu@tamusa.edu, No Pagination Specified–No Pagination Specified. https://doi.org/10.1037/ppm0000324",
      "doi": ""
    },
    {
      "text": "Karin Hugelius, Mervyn Gifford, Per Ortenwall, and Annsofie Adolfsson. 2016. “To silence the deafening silence”: Survivor’s needs and experiences of the impact of disaster radio for their recovery after a natural disaster. International Emergency Nursing 28 (2016), 8–13. https://doi.org/10.1016/j.ienj.2015.11.009",
      "doi": ""
    },
    {
      "text": "Kawaljeet Kaur Kapoor, Kuttimani Tamilmani, Nripendra P. Rana, Pushp Patil, Yogesh K. Dwivedi, and Sridhar Nerur. 2018. Advances in Social Media Research: Past, Present and Future. Information Systems Frontiers 20, 3 (2018), 531–558. https://doi.org/10.1007/s10796-017-9810-y",
      "doi": "10.1007/s10796-017-9810-y"
    },
    {
      "text": "Dhivya Karmegam, Thilagavathi Ramamoorthy, and Bagavandas Mappillairajan. 2020. A Systematic Review of Techniques Employed for Determining Mental Health Using Social Media in Psychological Surveillance During Disasters. Disaster Medicine and Public Health Preparedness 14, 2(2020), 265–272. https://doi.org/10.1017/dmp.2019.40",
      "doi": ""
    },
    {
      "text": "M Laeeq Khan. 2017. Social media engagement: What motivates user participation and consumption on YouTube?Computers in Human Behavior 66 (2017), 236–247. https://doi.org/10.1016/j.chb.2016.09.024",
      "doi": "10.1016/j.chb.2016.09.024"
    },
    {
      "text": "Kate Szer Kurtin, Nina O’Brien, Deya Roy, and Linda Dam. 2018. The Development of Parasocial Interaction Relationships on YouTube. The Journal of Social Media in Society; Vol 7, No 1 (2018): The Journal of Social Media in Society 7 (5 2018), 233–252. https://www.thejsms.org/index.php/TSMRI/article/view/304",
      "doi": ""
    },
    {
      "text": "Janette Lehmann, Mounia Lalmas, Elad Yom-Tov, and Georges Dupret. 2012. Models of User Engagement. In International conference on user modeling, adaptation, and personalization, Judith Masthoff, Bamshad Mobasher, Michel C Desmarais, and Roger Nkambou (Eds.). Springer Berlin Heidelberg, Berlin, Heidelberg, 164–175. https://doi.org/10.1007/978-3-642-31454-4_14",
      "doi": ""
    },
    {
      "text": "Y Saltzman Leia, Cross Hansel Tonya, and S Bordnick Patrick. 2020. Loneliness, Isolation, and Social Support Factors in post-COVID-19 Mental Health. , 55 – 57 pages. https://doi.org/10.1037/tra0000703",
      "doi": ""
    },
    {
      "text": "Bruce R Lindsay. 2011. Social media and disasters: Current uses, future options, and policy considerations. Technical Report. Congressional Research Service.",
      "doi": ""
    },
    {
      "text": "Ivan Wing Chit Mak, Chung Ming Chu, Pey Chyou Pan, Michael Gar Chung Yiu, and Veronica Lee Chan. 2009. Long-term psychiatric morbidities among SARS survivors. General Hospital Psychiatry 31, 4 (2009), 318–326. https://doi.org/10.1016/j.genhosppsych.2009.03.001",
      "doi": ""
    },
    {
      "text": "Alice E Marwick. 2015. You May Know Me from YouTube: (Micro-)Celebrity in Social Media. , 333–350 pages. https://doi.org/10.1002/9781118475089.ch18",
      "doi": ""
    },
    {
      "text": "Saif M Mohammad and Peter D Turney. 2013. Crowdsourcing a Word-Emotion Association Lexicon. Computational Intelligence 29, 3 (2013), 436–465.",
      "doi": ""
    },
    {
      "text": "Juha Munnukka, Devdeep Maity, Hanna Reinikainen, and Vilma Luoma-aho. 2019. “Thanks for watching”. The effectiveness of YouTube vlogendorsements. Computers in Human Behavior 93 (2019), 226–234. https://doi.org/10.1016/j.chb.2018.12.014",
      "doi": "10.1016/j.chb.2018.12.014"
    },
    {
      "text": "Mor Naaman, Jeffrey Boase, and Chih-Hui Lai. 2010. Is It Really about Me? Message Content in Social Awareness Streams. In Proceedings of the 2010 ACM Conference on Computer Supported Cooperative Work(CSCW ’10). Association for Computing Machinery, New York, NY, USA, 189–192. https://doi.org/10.1145/1718918.1718953",
      "doi": "10.1145/1718918.1718953"
    },
    {
      "text": "Kathleen O’Leary, Stephen M Schueller, Jacob O Wobbrock, and Wanda Pratt. 2018. “Suddenly, We Got to Become Therapists for Each Other”: Designing Peer Support Chats for Mental Health. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173905",
      "doi": "10.1145/3173574.3173905"
    },
    {
      "text": "Jacqueline K Owens, Andrea Warner Stidham, and Elizabeth L Owens. 2013. Disaster evacuation for persons with special needs: A content analysis of information on YouTube. Applied Nursing Research 26, 4 (2013), 273–275. https://doi.org/10.1016/j.apnr.2013.10.001",
      "doi": ""
    },
    {
      "text": "Yuval Palgi, Amit Shrira, Lia Ring, Ehud Bodner, Sharon Avidor, Yoav Bergman, Sara Cohen-Fridel, Shoshi Keisari, and Yaakov Hoffman. 2020. The loneliness pandemic: Loneliness and other concomitants of depression, anxiety and their comorbidity during the COVID-19 outbreak. Journal of affective disorders 275 (10 2020), 109–111. https://doi.org/10.1016/j.jad.2020.06.036",
      "doi": ""
    },
    {
      "text": "Sungkyu Park, Inyeop Kim, Sang Won Lee, Jaehyun Yoo, Bumseok Jeong, and Meeyoung Cha. 2015. Manifestation of Depression and Loneliness on Social Networks: A Case Study of Young Adults on Facebook. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’15). Association for Computing Machinery, New York, NY, USA, 557–570. https://doi.org/10.1145/2675133.2675139",
      "doi": "10.1145/2675133.2675139"
    },
    {
      "text": "Andrew Perrin and Monica Anderson. 2019. Share of U.S. adults using social media, including Facebook, is mostly unchanged since 2018. https://www.pewresearch.org/fact-tank/2019/04/10/share-of-u-s-adults-using-social-media-including-facebook-is-mostly-unchanged-since-2018/",
      "doi": ""
    },
    {
      "text": "Jenny Preece and Diane Maloney-Krichmar. 2002. Online Communities: Focusing on Sociability and Usability. In The Human-Computer Interaction Handbook: Fundamentals, Evolving Technologies and Emerging Applications. L. Erlbaum Associates Inc., USA, 596–620.",
      "doi": ""
    },
    {
      "text": "Claire H Procopio and Steven T Procopio. 2007. Do You Know What It Means to Miss New Orleans? Internet Communication, Geographic Community, and Social Capital in Crisis. Journal of Applied Communication Research 35, 1 (2 2007), 67–87. https://doi.org/10.1080/00909880601065722",
      "doi": ""
    },
    {
      "text": "Leslie Rasmussen. 2018. Parasocial Interaction in the Digital Age: An Examination of Relationship Building and the Effectiveness of YouTube Celebrities. The Journal of Social Media in Society 7, 1 (2018), 280–294.",
      "doi": ""
    },
    {
      "text": "Tobias Raun. 2018. Capitalizing intimacy: New subcultural forms of micro-celebrity strategies and affective labour on YouTube. Convergence 24, 1 (1 2018), 99–113. https://doi.org/10.1177/1354856517736983",
      "doi": ""
    },
    {
      "text": "Dana Rotman, Jennifer Golbeck, and Jennifer Preece. 2009. The Community is Where the Rapport is – on Sense and Structure in the Youtube Community. In Proceedings of the Fourth International Conference on Communities and Technologies(C&T ’09). Association for Computing Machinery, New York, NY, USA, 41–50. https://doi.org/10.1145/1556460.1556467",
      "doi": "10.1145/1556460.1556467"
    },
    {
      "text": "Juliet Roudini, Hamid Reza Khankeh, and Evelin Witruk. 2017. Disaster mental health preparedness in the community: A systematic review study. Health Psychology Open 4, 1 (1 2017), 2055102917711307. https://doi.org/10.1177/2055102917711307",
      "doi": ""
    },
    {
      "text": "Dan Russell, Carolyn E Cutrona, Jayne Rose, and Karen Yurko. 1984. Social and emotional loneliness: An examination of Weiss’s typology of loneliness.Journal of Personality and Social Psychology 46, 6(1984), 1313–1321. https://doi.org/10.1037/0022-3514.46.6.1313",
      "doi": ""
    },
    {
      "text": "Irina Shklovski, Leysia Palen, and Jeannette Sutton. 2008. Finding Community through Information and Communication Technology in Disaster Response. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work(CSCW ’08). Association for Computing Machinery, New York, NY, USA, 127–136. https://doi.org/10.1145/1460563.1460584",
      "doi": "10.1145/1460563.1460584"
    },
    {
      "text": "Amber Silver and Lindsay Matthews. 2017. The use of Facebook for information seeking, decision support, and self-organization following a significant disaster. Information, Communication & Society 20, 11 (2017), 1680–1697. https://doi.org/10.1080/1369118X.2016.1253762",
      "doi": ""
    },
    {
      "text": "Robert Soden and Leysia Palen. 2018. Informating Crisis: Expanding Critical Perspectives in Crisis Informatics. Proc. ACM Hum.-Comput. Interact. 2, CSCW (11 2018), 1 – 22. https://doi.org/10.1145/3274431",
      "doi": "10.1145/3274431"
    },
    {
      "text": "Karina Sokolova and Hajer Kefi. 2020. Instagram and YouTube bloggers promote it, why should I buy? How credibility and parasocial interaction influence purchase intentions. Journal of Retailing and Consumer Services 53 (2020), 1 – 9. https://doi.org/10.1016/j.jretconser.2019.01.011",
      "doi": ""
    },
    {
      "text": "José Van Dijck. 2013. The culture of connectivity: A critical history of social media. Oxford University Press, New York, NY. 110 – 132 pages.",
      "doi": ""
    },
    {
      "text": "Philippe Verduyn, David Seungjae Lee, Jiyoung Park, Holly Shablack, Ariana Orvell, Joseph Bayer, Oscar Ybarra, John Jonides, and Ethan Kross. 2015. Passive Facebook usage undermines affective well-being: Experimental and longitudinal evidence., 480–488 pages. https://doi.org/10.1037/xge0000057",
      "doi": ""
    },
    {
      "text": "Sarah Vieweg, Amanda L Hughes, Kate Starbird, and Leysia Palen. 2010. Microblogging during Two Natural Hazards Events: What Twitter May Contribute to Situational Awareness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). Association for Computing Machinery, New York, NY, USA, 1079–1088. https://doi.org/10.1145/1753326.1753486",
      "doi": "10.1145/1753326.1753486"
    },
    {
      "text": "Jessica Vitak, Nicole Ellison, and Charles Steinfield. 2011. The Ties That Bond: Re-Examining the Relationship between Facebook Use and Bonding Social Capital. In 2011 44th Hawaii International Conference on System Sciences. IEEE, Kauai, HI, USA, 1–10. https://doi.org/10.1109/HICSS.2011.435",
      "doi": "10.1109/HICSS.2011.435"
    },
    {
      "text": "Qi Wang, Edward L Fink, and Deborah A Cai. 2008. Loneliness, Gender, and Parasocial Interaction: A Uses and Gratifications Approach. Communication Quarterly 56, 1 (2 2008), 87–109. https://doi.org/10.1080/01463370701839057",
      "doi": ""
    },
    {
      "text": "Robert S Weiss. 1973. Loneliness: The experience of emotional and social isolation.The MIT Press, Cambridge, MA, US. xxii, 236–xxii, 236 pages.",
      "doi": ""
    },
    {
      "text": "Donghee Yvette Wohn, Guo Freeman, and Caitlin McLaughlin. 2018. Explaining Viewers’ Emotional, Instrumental, and Financial Support Provision for Live Streamers. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174048",
      "doi": "10.1145/3173574.3174048"
    },
    {
      "text": "Robert R Wright, Chad Schaeffer, Rhett Mullins, and Austin Evans. 2020. Comparison of Student Health and Well-Being Profiles and Social Media Use.Psi Chi Journal of Psychological Research 25 (2020), 14 – 21. https://doi.org/10.24839/2325-7342.JN25.1.14",
      "doi": ""
    },
    {
      "text": "Yang Yu and Xiao Wang. 2015. World Cup 2014 in the Twitter World: A big data analysis of sentiments in U.S. sports fans’ tweets. Computers in Human Behavior 48 (2015), 392–400. https://doi.org/10.1016/j.chb.2015.01.075",
      "doi": "10.5555/2781900.2782141"
    }
  ]
}