{
  "doi": "10.1145/3411764.3445421",
  "title": "Data@Hand: Fostering Visual Exploration of Personal Data on Smartphones Leveraging Speech and Touch Interaction",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Most mobile health apps employ data visualization to help people view their health and activity data, but these apps provide limited support for visual data exploration. Furthermore, despite its huge potential benefits, mobile visualization research in the personal data context is sparse. This work aims to empower people to easily navigate and compare their personal health data on smartphones by enabling flexible time manipulation with speech. We designed and developed Data@Hand, a mobile app that leverages the synergy of two complementary modalities: speech and touch. Through an exploratory study with 13 long-term Fitbit users, we examined how multimodal interaction helps participants explore their own health data. Participants successfully adopted multimodal interaction (i.e., speech and touch) for convenient and fluid data exploration. Based on the quantitative and qualitative findings, we discuss design implications and opportunities with multimodal interaction for better supporting visual data exploration on mobile devices.",
  "tags": [
    "Personal informatics",
    "data visualization",
    "multimodal interaction",
    "smartphone",
    "speech"
  ],
  "authors": [
    {
      "name": "Young-Ho Kim",
      "institution": "College of Information Studies University of Maryland, United States",
      "img": "/do/10.1145/contrib-99659022154/rel-imgonly/kim_portrait_2021.jpg",
      "acmid": "99659022154",
      "orcid": "0000-0002-2681-2774"
    },
    {
      "name": "Bongshin Lee",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409593205",
      "orcid": "0000-0002-4217-627X"
    },
    {
      "name": "Arjun Srinivasan",
      "institution": "Tableau Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659196818",
      "orcid": "0000-0001-8901-1256"
    },
    {
      "name": "Eun Kyoung Choe",
      "institution": "College of Information Studies University of Maryland, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81416608724",
      "orcid": "0000-0001-5038-8320"
    }
  ],
  "references": [
    {
      "text": "Christopher Ahlberg and Ben Shneiderman. 2003. Visual Information Seeking: Tight Coupling of Dynamic Query Filters with Starfield Displays. In The Craft of Information Visualization. Morgan Kaufmann Publishers Inc., San Francisco, CA, USA, 7–13. https://doi.org/10.1145/191666.191775",
      "doi": ""
    },
    {
      "text": "Majedah Alrehiely, Parisa Eslambolchilar, and Rita Borgo. 2018. A Taxonomy for Visualisations of Personal Physical Activity Data on Self-Tracking Devices and Their Applications. In Proceedings of the 32nd International BCS Human Computer Interaction Conference 32. BCS Learning and Development Ltd., Swindon, UK, 1–15. https://doi.org/10.14236/ewic/HCI2018.17",
      "doi": "10.14236/ewic/HCI2018.17"
    },
    {
      "text": "Apple Inc.2021. Health. Retrieved Jan 05, 2021 from http://www.apple.com/ios/health/",
      "doi": ""
    },
    {
      "text": "Apple Inc.2021. SIRI shortcuts boost health and fitness routines - Apple News Room. Retrieved Jan 05, 2021 from https://www.apple.com/newsroom/2019/03/siri-shortcuts-boost-health-and-fitness-routines/",
      "doi": ""
    },
    {
      "text": "Apple Inc.2021. Speech | Apple Developer. Retrieved Jan 05, 2021 from https://developer.apple.com/documentation/speech",
      "doi": ""
    },
    {
      "text": "Bon Adriel Aseniero, Charles Perin, Wesley Willett, Anthony Tang, and Sheelagh Carpendale. 2020. Activity River: Visualizing Planned and Logged Personal Activities for Reflection. In Proceedings of the 2020 International Conference on Advanced Visual Interfaces(AVI ’20). ACM, New York, NY, USA, 10 pages. https://doi.org/10.1145/3399715.3399921",
      "doi": "10.1145/3399715.3399921"
    },
    {
      "text": "Jillian Aurisano, Abhinav Kumar, Alberto Gonzales, Khairi Reda, Jason Leigh, Barbara Di Eugenio, and Andrew Johnson. 2015. “Show me data”: Observational Study of a Conversational Interface in Visual Data Exploration. In IEEE VIS 2015 (Poster). IEEE, Washington, DC, USA, 2 pages.",
      "doi": ""
    },
    {
      "text": "Jillian Aurisano, Abhinav Kumar, Alberto Gonzalez, Jason Leigh, Barbara Di Eugenio, and Andrew Johnson. 2016. Articulate2: Toward a Conversational Interface for Visual Data Exploration. In IEEE VIS 2016 (Poster). IEEE, Washington, DC, USA, 3–4.",
      "doi": ""
    },
    {
      "text": "Tanja Blascheck, Lonni Besançon, Anastasia Bezerianos, Bongshin Lee, and Petra Isenberg. 2018. Glanceable Visualization: Studies of Data Comparison Performance on Smartwatches. IEEE transactions on visualization and computer graphics 25, 1(2018), 630–640. https://doi.org/10.1109/TVCG.2018.2865142",
      "doi": "10.1109/TVCG.2018.2865142"
    },
    {
      "text": "Kerstin Blumenstein, Christina Niederer, Markus Wagner, Grischa Schmiedl, Alexander Rind, and Wolfgang Aigner. 2016. Evaluating Information Visualization on Mobile Devices. In Proceedings of the Beyond Time and Errors on Novel Evaluation Methods for Visualization - BELIV ’16, Vol. 24-October. ACM Press, New York, New York, USA, 125–132. https://doi.org/10.1145/2993901.2993906",
      "doi": ""
    },
    {
      "text": "Matthew Brehmer, Bongshin Lee, Petra Isenberg, and Eun Kyoung Choe. 2018. Visualizing Ranges Over Time on Mobile Phones: a Task-Based Crowdsourced Evaluation. IEEE Transactions on Visualization and Computer Graphics 25, 1(2018), 619–629. https://doi.org/10.1109/TVCG.2018.2865234",
      "doi": "10.1109/TVCG.2018.2865234"
    },
    {
      "text": "Matthew Brehmer, Bongshin Lee, Petra Isenberg, and Eun Kyoung Choe. 2019. A Comparative Evaluation of Animation and Small Multiples for Trend Visualization on Mobile Phones. IEEE Transactions on Visualization and Computer Graphics 26, 1(2019), 364–374. https://doi.org/10.1109/TVCG.2019.2934397",
      "doi": ""
    },
    {
      "text": "Yang Chen. 2017. Visualizing Large Time-series Data on Very Small Screens. In Proceedings of the Eurographics/IEEE VGTC Conference on Visualization: Short Papers. The Eurographics Association, Goslar, Germany, 37–41. https://doi.org/10.2312/eurovisshort.20171130",
      "doi": "10.2312/eurovisshort.20171130"
    },
    {
      "text": "Eun Kyoung Choe, Raimund Dachselt, Petra Isenberg, and Bongshin Lee. 2019. Mobile Data Visualization (Dagstuhl Seminar 19292). Dagstuhl Reports 9(2019). Issue 7.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, and Seung-won Hwang. 2018. Personal Data Exploration with Speech on Mobile Devices. In MultimodalVis ’18 Workshop at AVI 2018. ACM, New York, NY, USA, 4 pages. https://www.microsoft.com/en-us/research/publication/personal-data-exploration-with-speech-on-mobile-devices/",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A. Kientz. 2015. SleepTight: Low-burden, Self-monitoring Technology for Capturing and Reflecting on Sleep Behaviors. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). ACM, New York, NY, USA, 121–132. https://doi.org/10.1145/2750858.2804266",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, and M.c. Schraefel. 2015. Characterizing Visualization Insights from Quantified Selfers’ Personal Data Presentations. IEEE Computer Graphics and Applications 35, 4 (July 2015), 28–37. https://doi.org/10.1109/MCG.2015.51",
      "doi": "10.1109/MCG.2015.51"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017. Understanding Self-reflection: How People Reflect on Personal Data Through Visual Data Exploration. In Proceedings of the 11th EAI International Conference on Pervasive Computing Technologies for Healthcare (Barcelona, Spain) (PervasiveHealth ’17). ACM, New York, NY, USA, 173–182. https://doi.org/10.1145/3154862.3154881",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Philip R Cohen, Mary Dalrymple, Douglas B Moran, Fernando C N Pereira, and Joseph W Sullivan. 1989. Synergistic Use of Direct Manipulation and Natural Language. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’89). ACM, New York, NY, USA, 227–233. https://doi.org/10.1145/67450.67494",
      "doi": "10.1145/67449.67494"
    },
    {
      "text": "Joëlle Coutaz, Laurence Nigay, Daniel Salber, Ann Blandford, Jon May, and Richard M. Young. 1995. Four Easy Pieces for Assessing the Usability of Multimodal Interaction: The Care Properties. In Proceedings of the IFIP TC13 Interantional Conference on Human-Computer Interaction(INTERACT ’95). Springer US, Boston, MA, 115–120. https://doi.org/10.1007/978-1-5041-2896-4_19",
      "doi": ""
    },
    {
      "text": "Kenneth Cox, Rebecca E. Grinter, Stacie L. Hibino, Lalita Jategaonkar Jagadeesan, and David Mantilla. 2001. A Multi-Modal Natural Language Interface to an Information Visualization Environment. International Journal of Speech Technology 4, 3-4 (2001), 297–314. https://doi.org/10.1023/A:1011368926479",
      "doi": ""
    },
    {
      "text": "Pooja M Desai, Matthew E Levine, David J Albers, and Lena Mamykina. 2018. Pictures Worth a Thousand Words: Reflections on Visualizing Personal Blood Glucose Forecasts for Individuals with Type 2 Diabetes. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174112",
      "doi": "10.1145/3173574.3174112"
    },
    {
      "text": "Kedar Dhamdhere, Kevin S. McCurley, Ralfi Nahmias, Mukund Sundararajan, and Qiqi Yan. 2017. Analyza: Exploring Data with Conversation. In Proceedings of the 22nd International Conference on Intelligent User Interfaces(IUI ’17). ACM Press, New York, New York, USA, 493–504. https://doi.org/10.1145/3025171.3025227",
      "doi": "10.1145/3025171.3025227"
    },
    {
      "text": "Aarthi Easwara Moorthy and Kim-Phuong L. Vu. 2015. Privacy Concerns for Use of Voice Activated Personal Assistant in the Public Space. International Journal of Human-Computer Interaction 31, 4 (April 2015), 307–335. https://doi.org/10.1080/10447318.2014.986642",
      "doi": ""
    },
    {
      "text": "Philipp Eichmann, Darren Edge, Nathan Evans, Bongshin Lee, Matthew Brehmer, and Christopher White. 2020. Orchard: Exploring Multivariate Heterogeneous Networks on Mobile Phones. Computer Graphics Forum 39, 3 (June 2020), 115–126. https://doi.org/10.1111/cgf.13967",
      "doi": ""
    },
    {
      "text": "Daniel Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean Munson. 2014. Taming Data Complexity in Lifelogs: Exploring Visual Cuts of Personal Informatics Data. In Proceedings of the 2014 Conference on Designing Interactive Systems(DIS ’14). ACM, New York, NY, USA, 667–676. https://doi.org/10.1145/2598510.2598558",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Facebook Inc.2021. React Native · A framework for building native apps using React. Retrieved Jan 05, 2021 from https://reactnative.dev/",
      "doi": ""
    },
    {
      "text": "Clayton Feustel, Shyamak Aggarwal, Bongshin Lee, and Lauren Wilcox. 2018. People Like Me: Designing for Reflection on Aggregate Cohort Data in Personal Informatics Systems. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 1–21. https://doi.org/10.1145/3264917",
      "doi": "10.1145/3264917"
    },
    {
      "text": "Fitbit, Inc.2021. Aria Scale. Retrieved Jan 05, 2021 from https://www.fitbit.com/aria",
      "doi": ""
    },
    {
      "text": "Fitbit, Inc.2021. Fitbit. Retrieved Jan 05, 2021 from https://www.fitbit.com",
      "doi": ""
    },
    {
      "text": "Fitbit, Inc.2021. Fitbit Web API. Retrieved Jan 05, 2021 from https://dev.fitbit.com/build/reference/web-api/",
      "doi": ""
    },
    {
      "text": "Tong Gao, Mira Dontcheva, Eytan Adar, Zhicheng Liu, and Karrie G. Karahalios. 2015. DataTone: Managing Ambiguity in Natural Language Interfaces for Data Visualization. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology(UIST ’15). ACM Press, New York, New York, USA, 489–500. https://doi.org/10.1145/2807442.2807478",
      "doi": "10.1145/2807442.2807478"
    },
    {
      "text": "Garmin Ltd.2021. Garmin. Retrieved Jan 05, 2021 from https://garmin.com",
      "doi": ""
    },
    {
      "text": "Marti Hearst and Melanie Tory. 2019. Would You Like A Chart with That? Incorporating Visualizations into Conversational Interfaces. In 2019 IEEE Visualization Conference, VIS 2019. IEEE, Washington, DC, USA, 36–40. https://doi.org/10.1109/VISUAL.2019.8933766",
      "doi": ""
    },
    {
      "text": "Enamul Hoque, Vidya Setlur, Melanie Tory, and Isaac Dykeman. 2017. Applying Pragmatics Principles for Interaction with Visual Analytics. IEEE Transactions on Visualization and Computer Graphics 24, 1(2017), 309–318. https://doi.org/10.1109/TVCG.2017.2744684",
      "doi": ""
    },
    {
      "text": "Huami Inc.2021. Mi Fit. Retrieved Jan 05, 2021 from https://apps.apple.com/us/app/mi-fit/id938688461",
      "doi": ""
    },
    {
      "text": "Dandan Huang, Melanie Tory, Bon Adriel Aseniero, Lyn Bartram, Scott Bateman, Sheelagh Carpendale, Anthony Tang, and Robert Woodbury. 2014. Personal Visualization and Personal Visual Analytics. IEEE Transactions on Visualization and Computer Graphics 21, 3(2014), 420–433. https://doi.org/10.1109/TVCG.2014.2359887",
      "doi": "10.1109/TVCG.2014.2359887"
    },
    {
      "text": "Dandan Huang, Melanie Tory, and Lyn Bartram. 2016. A Field Study of On-Calendar Visualizations. In Proceedings of Graphics Interface 2016 (Victoria, British Columbia, Canada) (GI 2016). Canadian Human-Computer Communications Society / Société canadienne du dialogue humain-machine, Waterloo, Canada, 13–20. https://doi.org/10.20380/GI2016.03",
      "doi": ""
    },
    {
      "text": "Jan-Frederik Kassel and Michael Rohs. 2018. Valletto: A Multimodal Interface for Ubiquitous Visual Analytics. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems(CHI EA ’18). ACM, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188445",
      "doi": "10.1145/3170427.3188445"
    },
    {
      "text": "Jan-Frederik Kassel and Michael Rohs. 2019. Talk to Me Intelligibly: Investigating An Answer Space to Match the User’s Language in Visual Analysis. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). ACM, New York, NY, USA, 1517–1529. https://doi.org/10.1145/3322276.3322282",
      "doi": "10.1145/3322276.3322282"
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A. Kientz. 2012. Lullaby: A Capture & Access System for Understanding the Sleep Environment. In Proceedings of the 2012 ACM Conference on Ubiquitous Computing (Pittsburgh, Pennsylvania) (UbiComp ’12). ACM, New York, NY, USA, 226–234. https://doi.org/10.1145/2370216.2370253",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Matthew Kay, Tara Kola, Jessica R Hullman, and Sean A Munson. 2016. When (ish) is My Bus? User-centered Visualizations of Uncertainty in Everyday, Mobile Predictive Systems. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 5092–5103. https://doi.org/10.1145/2858036.2858558",
      "doi": "10.1145/2858036.2858558"
    },
    {
      "text": "Spencer Kelly. 2019. Compromise. Retrieved Jan 05, 2021 from http://compromise.cool/",
      "doi": ""
    },
    {
      "text": "Yoojung Kim, Bongshin Lee, and Eun Kyoung Choe. 2019. Investigating data accessibility of personal health apps. Journal of the American Medical Informatics Association 26, 5 (May 2019), 412–419. https://doi.org/10.1093/jamia/ocz003",
      "doi": ""
    },
    {
      "text": "Yea-Seul Kim, Mira Dontcheva, Eytan Adar, and Jessica Hullman. 2019. Vocal Shortcuts for Creative Experts. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM Press, New York, New York, USA, 1–14. https://doi.org/10.1145/3290605.3300562",
      "doi": "10.1145/3290605.3300562"
    },
    {
      "text": "Konstantin Klamka, Tom Horak, and Raimund Dachselt. 2020. Watch+Strap: Extending Smartwatches with Interactive StrapDisplays. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). ACM, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376199",
      "doi": "10.1145/3313831.3376199"
    },
    {
      "text": "Abhinav Kumar, Barbara Di Eugenio, Jillian Aurisano, Andrew Johnson, Abeer Alsaiari, Nigel Flowers, Alberto Gonzalez, and Jason Leigh. 2017. Multimodal Coreference Resolution for Exploratory Data Visualization Dialogue: Context-Based Annotation and Gesture Identification. In SEMDIAL 2017 (SaarDial) Workshop on the Semantics and Pragmatics of Dialogue. ISCA, Saarbrücken, Germany, 41–51. https://doi.org/10.21437/SemDial.2017-5",
      "doi": ""
    },
    {
      "text": "Bongshin Lee, Matthew Brehmer, Petra Isenberg, Eun Kyoung Choe, Ricardo Langner, and Raimund Dachselt. 2018. Data Visualization on Mobile Devices. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). ACM, New York, NY, USA, Article W07, 8 pages. https://doi.org/10.1145/3170427.3170631",
      "doi": "10.1145/3170427.3170631"
    },
    {
      "text": "Bongshin Lee, Eun Kyoung Choe, Petra Isenberg, Kim Marriott, John Stasko, and Theresa-Marie Rhyne. 2020. Reaching Broader Audiences With Data Visualization. IEEE Computer Graphics and Applications 40, 2 (March 2020), 82–90. https://doi.org/10.1109/MCG.2020.2968244",
      "doi": "10.1109/MCG.2020.2968244"
    },
    {
      "text": "Bongshin Lee, Arjun Srinivasan, John Stasko, Melanie Tory, and Vidya Setlur. 2018. Multimodal Interaction for Data Visualization. In Proceedings of the 2018 International Conference on Advanced Visual Interfaces (Castiglione della Pescaia, Grosseto, Italy) (AVI ’18). Association for Computing Machinery, New York, NY, USA, Article 11, 3 pages. https://doi.org/10.1145/3206505.3206602",
      "doi": "10.1145/3206505.3206602"
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2011. Understanding My Data, Myself: Supporting Self-reflection with Ubicomp Technologies. In Proceedings of the 13th International Conference on Ubiquitous Computing (Beijing, China) (UbiComp ’11). ACM, New York, NY, USA, 405–414. https://doi.org/10.1145/2030112.2030166",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Jean-claude Martin. 1998. TYCOON: Theoretical Framework and Software Tools for Multimodal Interfaces. In Intelligence and Multimodality in Multimedia Interfaces. AAAI Press, Palo Alto, CA, USA, 1–25.",
      "doi": ""
    },
    {
      "text": "Microsoft. 2021. Cognitive Speech Services | Microsoft Azure. Retrieved Jan 05, 2021 from https://azure.microsoft.com/en-us/services/cognitive-services/speech-services/",
      "doi": ""
    },
    {
      "text": "Microsoft. 2021. TypeScript. Retrieved Jan 05, 2021 from https://www.typescriptlang.org",
      "doi": ""
    },
    {
      "text": "Laura Pina, Sang-Wha Sien, Clarissa Song, Teresa M Ward, James Fogarty, Sean A Munson, and Julie A Kientz. 2020. DreamCatcher: Exploring How Parents and School-Age Children Can Track and Review Sleep Information Together. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–25. https://doi.org/10.1145/3392882",
      "doi": "10.1145/3392882"
    },
    {
      "text": "Irene Ros. 2021. MobileVis. Retrieved Jan 05, 2021 from http://mobilev.is/",
      "doi": ""
    },
    {
      "text": "Sebastian Sadowski. 2021. Mobile InfoVis. Retrieved Jan 05, 2021 from https://mobileinfovis.com",
      "doi": ""
    },
    {
      "text": "Ayshwarya Saktheeswaran, Arjun Srinivasan, and John Stasko. 2020. Touch? Speech? or Touch and Speech? Investigating Multimodal Interaction for Visual Network Exploration and Analysis. IEEE Transactions on Visualization and Computer Graphics 0, 0(2020), 2168–2179. (In press).",
      "doi": ""
    },
    {
      "text": "Samsung. 2021. S Health. Retrieved Jan 05, 2021 from http://shealth.samsung.com",
      "doi": ""
    },
    {
      "text": "Hanna Schneider, Julia Wayrauther, Mariam Hassib, and Andreas Butz. 2019. Communicating Uncertainty in Fertility Prognosis. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1–11. https://doi.org/10.1145/3290605.3300391",
      "doi": "10.1145/3290605.3300391"
    },
    {
      "text": "Michail Schwab, Sicheng Hao, Olga Vitek, James Tompkin, Jeff Huang, and Michelle A Borkin. 2019. Evaluating Pan and Zoom Timelines and Sliders. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). ACM, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300786",
      "doi": "10.1145/3290605.3300786"
    },
    {
      "text": "Vidya Setlur, Sarah E. Battersby, Melanie Tory, Rich Gossweiler, and Angel X. Chang. 2016. Eviza: A Natural Language Interface for Visual Analysis. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 365–377. https://doi.org/10.1145/2984511.2984588",
      "doi": "10.1145/2984511.2984588"
    },
    {
      "text": "Vidya Setlur, Melanie Tory, and Alex Djalali. 2019. Inferencing Underspecified Natural Language Utterances in Visual Analysis. In Proceedings of the 24th International Conference on Intelligent User Interfaces. ACM, New York, NY, USA, 40–51. https://doi.org/10.1145/3301275.3302270",
      "doi": "10.1145/3301275.3302270"
    },
    {
      "text": "Arjun Srinivasan, Bongshin Lee, Nathalie Henry Riche, Steven M. Drucker, and Ken Hinckley. 2020. InChorus: Designing Consistent Multimodal Interactions for Data Visualization on Tablet Devices. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376782",
      "doi": "10.1145/3313831.3376782"
    },
    {
      "text": "Arjun Srinivasan, Bongshin Lee, and John T. Stasko. 2020. Interweaving Multimodal Interaction with Flexible Unit Visualizations for Data Exploration. IEEE Transactions on Visualization and Computer Graphics 0, 0(2020), 15 pages. https://doi.org/10.1109/TVCG.2020.2978050 (Early access).",
      "doi": "10.1109/TVCG.2020.2978050"
    },
    {
      "text": "Arjun Srinivasan and John Stasko. 2017. Natural Language Interfaces for Data Analysis with Visualization: Considering What Has and Could Be Asked. In Proceedings of the Eurographics/IEEE VGTC Conference on Visualization: Short Papers (Barcelona, Spain) (EuroVis ’17). The Eurographics Association, Goslar, Germany, 55–59. https://doi.org/10.2312/eurovisshort.20171133",
      "doi": ""
    },
    {
      "text": "Arjun Srinivasan and John Stasko. 2018. Orko: Facilitating Multimodal Interaction for Visual Exploration and Analysis of Networks. IEEE Transactions on Visualization and Computer Graphics 24, 1 (Jan. 2018), 511–521. https://doi.org/10.1109/TVCG.2017.2745219",
      "doi": ""
    },
    {
      "text": "Poorna Talkad Sukumar, Gonzalo J. Martinez, Ted Grover, Gloria Mark, Sidney K. D’Mello, Nitesh V. Chawla, Stephen M. Mattingly, and Aaron D. Striegel. 2020. Characterizing Exploratory Behaviors on a Personal Visualization Interface Using Interaction Logs. In EuroVis 2020 - Short Papers, Andreas Kerren, Christoph Garth, and G. Elisabeta Marai (Eds.). The Eurographics Association, Goslar, Germany, 1–5. https://doi.org/10.2312/evs.20201052",
      "doi": ""
    },
    {
      "text": "Yiwen Sun, Jason Leigh, Andrew Johnson, and Sangyoon Lee. 2010. Articulate: A Semi-Automated Model for Translating Natural Language Queries into Meaningful Visualizations. In International Symposium on Smart Graphics. Springer-Verlag, Berlin, Heidelberg, 184–195.",
      "doi": ""
    },
    {
      "text": "Wanasit Tanakitrungruang. 2014. Chrono. Retrieved Jan 05, 2021 from https://github.com/wanasit/chrono",
      "doi": ""
    },
    {
      "text": "TeamViewer. 2021. TeamViewer QuickSupport. Retrieved Jan 05, 2021 from https://www.teamviewer.com/en-us/info/quicksupport/",
      "doi": ""
    },
    {
      "text": "Alice Thudt, Dominikus Baur, Samuel Huron, and Sheelagh Carpendale. 2016. Visual Mementos: Reflecting Memories with Personal Data. IEEE Transactions on Visualization and Computer Graphics 22, 1 (Jan. 2016), 369–378. https://doi.org/10.1109/TVCG.2015.2467831",
      "doi": "10.1109/TVCG.2015.2467831"
    },
    {
      "text": "Alice Thudt, Bongshin Lee, Eun Kyoung Choe, and Sheelagh Carpendale. 2017. Expanding Research Methods for a Realistic Understanding of Personal Visualization. IEEE Computer Graphics and Applications 37, 2 (2017), 12–18. https://doi.org/10.1109/MCG.2017.23",
      "doi": "10.1109/MCG.2017.23"
    },
    {
      "text": "Viktoriya Trifonova. 2018. How Device Usage Changed in 2018 and What it Means for 2019. https://blog.globalwebindex.com/trends/device-usage-2019.",
      "doi": ""
    },
    {
      "text": "Matthew Turk. 2014. Multimodal Interaction: A Review. Pattern Recognition Letters 36, 15 (Jan. 2014), 189–195. https://doi.org/10.1016/j.patrec.2013.07.003",
      "doi": ""
    },
    {
      "text": "Andries van Dam. 2001. Post-Wimp User Interfaces: the Human Connection. In Frontiers of Human-Centered Computing, Online Communities and Virtual Environments. Springer London, London, 163–178. https://doi.org/10.1007/978-1-4471-0259-5_11",
      "doi": ""
    },
    {
      "text": "Minh Tue Vo and Alex Waibel. 1993. Multimodal Human-Computer Interaction. In Proceedings of ISSD 1993(ISSD ’93). Waseda University, Shinjuku City, Tokyo, Japan, 1–8.",
      "doi": ""
    },
    {
      "text": "Benjamin Watson and Vidya Setlur. 2015. Emerging Research in Mobile Visualization. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct(Copenhagen, Denmark) (MobileHCI ’15). Association for Computing Machinery, New York, NY, USA, 883–887. https://doi.org/10.1145/2786567.2786571",
      "doi": "10.1145/2786567.2786571"
    },
    {
      "text": "Bowen Yu and Claudio T. Silva. 2020. FlowSense: A Natural Language Interface for Visual Data Exploration within a Dataflow System. IEEE Transactions on Visualization and Computer Graphics 26, 1 (Jan. 2020), 1–11. https://doi.org/10.1109/TVCG.2019.2934668",
      "doi": ""
    },
    {
      "text": "Zoom Video Communications, Inc.2021. Zoom. Retrieved Jan 05, 2021 from https://zoom.us/",
      "doi": ""
    }
  ]
}