{
  "doi": "10.1145/3411764.3445638",
  "title": "Towards More Transactional Voice Assistants: Investigating the Potential for a Multimodal Voice-Activated Indoor Navigation Assistant for Blind and Sighted Travelers",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "Voice assistants (VAs) – like Amazon Alexa or Siri – offer hands-/eyes-free interactions that are beneficial to a range of users, including individuals who are blind, to fulfill tasks that are otherwise difficult or inaccessible. While these interfaces model conversational interactions to achieve simple tasks, there have been recent calls for VAs that model more transactional interactions for a wider range of complex activities. In this study, we explored the extension of VAs’ capabilities in the context of indoor navigation through mixed-ability focus groups with blind and sighted airport travelers. We found high overlap in the difficulties encountered by blind and sighted travelers, as well as shared interest in a voice-activated travel assistant to improve travel experiences. Leveraging user-elicited recommendations, we present interaction design examples that showcase customization of different and multiple modalities, which collectively demonstrate how VAs can more broadly achieve transactional interactions in complex task scenarios.",
  "tags": [
    "Accessibility",
    "Voice Assistants",
    "Blind and Sighted Travelers",
    "Indoor Navigation"
  ],
  "authors": [
    {
      "name": "Ali Abdolrahmani",
      "institution": "Information Systems University of Maryland, Baltimore County, United States",
      "img": "/do/10.1145/contrib-99658646844/rel-imgonly/aliisrcsuitsittingonthestool.jpg",
      "acmid": "99658646844",
      "orcid": "missing"
    },
    {
      "name": "Maya Howes Gupta",
      "institution": "Informatics University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701005",
      "orcid": "missing"
    },
    {
      "name": "Mei-Lian Vader",
      "institution": "Information Systems Department UMBC, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702502",
      "orcid": "missing"
    },
    {
      "name": "Ravi Kuber",
      "institution": "Information Systems UMBC, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100464526",
      "orcid": "missing"
    },
    {
      "name": "Stacy Branham",
      "institution": "Informatics University of California, Irvine, United States",
      "img": "/do/10.1145/contrib-81442598659/rel-imgonly/stacy_branham-0320_crop.jpg",
      "acmid": "81442598659",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abdolrahmani, Ali, Kevin M. Storer, Antony Rishin Mukkath Roy, Ravi Kuber, and Stacy M. Branham. \"Blind Leading the Sighted: Drawing Design Insights from Blind Users towards More Productivity-oriented Voice Interfaces.\" ACM Transactions on Accessible Computing (TACCESS) 12, no. 4 (2020): 1-35.",
      "doi": "10.1145/3368426"
    },
    {
      "text": "Abdolrahmani, Ali, Ravi Kuber, and Amy Hurst. \"An empirical investigation of the situationally-induced impairments experienced by blind mobile device users.\" In Proceedings of the 13th Web for All Conference, pp. 1-8. 2016.",
      "doi": ""
    },
    {
      "text": "Abdolrahmani, Ali, Ravi Kuber, and Stacy M. Branham. \"\" Siri Talks at You\" An Empirical Investigation of Voice-Activated Personal Assistant (VAPA) Usage by Individuals Who Are Blind.\" In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility, pp. 249-258. 2018.",
      "doi": ""
    },
    {
      "text": "Ahmetovic, Dragan, Cole Gleason, Chengxiong Ruan, Kris Kitani, Hironobu Takagi, and Chieko Asakawa. \"NavCog: a navigational cognitive assistant for the blind.\" In Proceedings of the 18th International Conference on Human-Computer Interaction with Mobile Devices and Services, pp. 90-99. 2016.",
      "doi": ""
    },
    {
      "text": "Ahmetovic, Dragan, João Guerreiro, Eshed Ohn-Bar, Kris M. Kitani, and Chieko Asakawa. \"Impact of expertise on interaction preferences for navigation assistance of visually impaired individuals.\" In Proceedings of the 16th Web For All 2019 Personalization-Personalizing the Web, pp. 1-9. 2019.",
      "doi": ""
    },
    {
      "text": "Ahmetovic, Dragan, Uran Oh, Sergio Mascetti, and Chieko Asakawa. \"Turn right: Analysis of rotation errors in turn-by-turn navigation for individuals with visual impairments.\" In Proceedings of the 20th International ACM SIGACCESS Conference on Computers and Accessibility, pp. 333-339. 2018.",
      "doi": ""
    },
    {
      "text": "Aira. Accessed September 8, 2020. https://aira.io/.",
      "doi": ""
    },
    {
      "text": "Albouys-Perrois, Jérémy, Jérémy Laviole, Carine Briant, and Anke M. Brock. \"Towards a multisensory augmented reality map for blind and low vision people: A participatory design approach.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, pp. 1-14. 2018.",
      "doi": ""
    },
    {
      "text": "Amazon Alexa. 2020. Accessed September 8, 2020 from https://www.amazon.com/b?node=17934671011.",
      "doi": ""
    },
    {
      "text": "Americans with Disabilities Act of 1990, Pub. L. No. 101-336, § 2, 104 Stat. 328 1991.",
      "doi": ""
    },
    {
      "text": "Apple Siri. 2020. Accessed September 8, 2020 from https://www.apple.com/siri/.",
      "doi": ""
    },
    {
      "text": "Ariadne GPS. Accessed September 8 2020. http://www.ariadnegps.eu/.",
      "doi": ""
    },
    {
      "text": "Asakawa, Chieko, Hironobu Takagi, Shuichi Ino, and Tohru Ifukube. \"Maximum listening speeds for the blind.\" Georgia Institute of Technology, 2003.",
      "doi": ""
    },
    {
      "text": "Azenkot, Shiri, and Nicole B. Lee. \"Exploring the use of speech input by blind people on mobile devices.\" In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility, pp. 1-8. 2013.",
      "doi": ""
    },
    {
      "text": "Baldauf, Matthias, Raffael Bösch, Christian Frei, Fabian Hautle, and Marc Jenny. \"Exploring requirements and opportunities of conversational user interfaces for the cognitively impaired.\" In Proceedings of the 20th International Conference on human-computer interaction with mobile devices and services adjunct, pp. 119-126. 2018.",
      "doi": ""
    },
    {
      "text": "Be My Eyes - See the world together. Accessed September 8, 2020. https://www.bemyeyes.com/.",
      "doi": ""
    },
    {
      "text": "Bentley, Frank, Chris Luvogt, Max Silverman, Rushani Wirasinghe, Brooke White, and Danielle Lottridge. \"Understanding the long-term use of smart speaker assistants.\" Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, no. 3 (2018): 1-24.",
      "doi": ""
    },
    {
      "text": "BlindSquare. Accessed September 8, 2020. https://www.blindsquare.com/.",
      "doi": ""
    },
    {
      "text": "Bouck, Emily C., Sara Flanagan, Gauri S. Joshi, Waseem Sheikh, and Dave Schleppenbach. \"Speaking math—A voice input, speech output calculator for students with visual impairments.\" Journal of Special Education Technology 26, no. 4 (2011): 1-14.",
      "doi": ""
    },
    {
      "text": "Bousbia-Salah, Mounir, Abdelghani Redjati, Mohamed Fezari, and Maamar Bettayeb. \"An ultrasonic navigation system for blind people.\" In 2007 IEEE International Conference on Signal Processing and Communications, pp. 1003-1006. IEEE, 2007.",
      "doi": ""
    },
    {
      "text": "Brabyn, John A. \"New developments in mobility and orientation aids for the blind.\" IEEE Transactions on Biomedical Engineering 4 (1982): 285-289.",
      "doi": ""
    },
    {
      "text": "Branham, Stacy M., Ali Abdolrahmani, William Easley, Morgan Scheuerman, Erick Ronquillo, and Amy Hurst. \"\" Is Someone There? Do They Have a Gun\" How Visual Information about Others Can Improve Personal Safety Management for Blind Individuals.\" In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, pp. 260-269. 2017.",
      "doi": ""
    },
    {
      "text": "Branham, Stacy M., and Antony Rishin Mukkath Roy. \"Reading between the guidelines: How commercial voice assistant guidelines hinder accessibility for blind users.\" In The 21st International ACM SIGACCESS Conference on Computers and Accessibility, pp. 446-458. 2019.",
      "doi": ""
    },
    {
      "text": "Brewer, Robin N., and Anne Marie Piper. \"xPress: Rethinking design for aging and accessibility through an IVR blogging system.\" Proceedings of the ACM on Human-Computer Interaction 1, no. CSCW (2017): 1-17.",
      "doi": ""
    },
    {
      "text": "Carroll, Clare, Catherine Chiodo, Adena Xin Lin, Meg Nidever, and Jayanth Prathipati. \"Robin: enabling independence for individuals with cognitive disabilities using voice assistive technology.\" In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems, pp. 46-53. 2017.",
      "doi": ""
    },
    {
      "text": "Charmaz, Kathy. Constructing grounded theory: A practical guide through qualitative analysis. sage, 2006.",
      "doi": ""
    },
    {
      "text": "Choi, Dasom, Daehyun Kwak, Minji Cho, and Sangsu Lee. \"\" Nobody Speaks that Fast!\" An Empirical Study of Speech Rate in Conversational Agents for People with Vision Impairments.\" In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pp. 1-13. 2020.",
      "doi": ""
    },
    {
      "text": "Chung, Arlene E., Ashley C. Griffin, Dasha Selezneva, and David Gotz. \"Health and fitness apps for hands-free voice-activated assistants: content analysis.\" JMIR mHealth and uHealth 6, no. 9 (2018): e174.",
      "doi": ""
    },
    {
      "text": "Clark, Leigh, Nadia Pantidi, Orla Cooney, Philip Doyle, Diego Garaialde, Justin Edwards, Brendan Spillane \"What makes a good conversation? challenges in designing truly conversational agents.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, pp. 1-12. 2019.",
      "doi": ""
    },
    {
      "text": "Darling, Nancy C., Gregory L. Goodrich, and J. Kenneth Wiley. \"A preliminary followup study of electronic travel aid users.\" Bulletin of prosthetics research 10, no. 27 (1977): 82.",
      "doi": ""
    },
    {
      "text": "Fallah, Navid, Ilias Apostolopoulos, Kostas Bekris, and Eelke Folmer. \"Indoor human navigation systems: A survey.\" Interacting with Computers 25, no. 1 (2013): 21-33.",
      "doi": ""
    },
    {
      "text": "Fewings, Rodney. \"Wayfinding and airport terminal design.\" The journal of navigation 54, no. 2 (2001): 177-184.",
      "doi": ""
    },
    {
      "text": "Fiannaca, Alexander, Ilias Apostolopoulous, and Eelke Folmer. \"Headlock: a wearable navigation aid that helps blind cane users traverse large open spaces.\" In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility, pp. 19-26. 2014.",
      "doi": ""
    },
    {
      "text": "Flores, German, and Roberto Manduchi. \"Easy return: an app for indoor backtracking assistance.\" In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems, pp. 1-12. 2018.",
      "doi": ""
    },
    {
      "text": "Giudice, Nicholas A., and Gordon E. Legge. \"Blind navigation and the role of technology.\" The engineering handbook of smart technology for aging, disability, and independence 8 (2008): 479-500.",
      "doi": ""
    },
    {
      "text": "GoodMaps. 2020. Accessed September 8, 2020 from https://www.goodmaps.com/.",
      "doi": ""
    },
    {
      "text": "Google Home. 2020. Accessed September 8, 2020 from https://store.google.com/us/product/google_home_speaker.",
      "doi": ""
    },
    {
      "text": "Google Maps. 2020. Accessed December 22, 2020 from https://www.google.com/maps.",
      "doi": ""
    },
    {
      "text": "Guerreiro, João, Daisuke Sato, Dragan Ahmetovic, Eshed Ohn-Bar, Kris M. Kitani, and Chieko Asakawa. \"Virtual navigation for blind people: Transferring route knowledge to the real-World.\" International Journal of Human-Computer Studies 135 (2020): 102369.",
      "doi": "10.1016/j.ijhcs.2019.102369"
    },
    {
      "text": "Guerreiro, João, Dragan Ahmetovic, Daisuke Sato, Kris Kitani, and Chieko Asakawa. \"Airport accessibility and navigation assistance for people with visual impairments.\" In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, pp. 1-14. 2019.",
      "doi": ""
    },
    {
      "text": "Guerreiro, João, Dragan Ahmetovic, Kris M. Kitani, and Chieko Asakawa. \"Virtual navigation for blind people: Building sequential representations of the real-world.\" In Proceedings of the 19th International ACM SIGACCESS Conference on computers and accessibility, pp. 280-289. 2017.",
      "doi": ""
    },
    {
      "text": "Guerreiro, João, Eshed Ohn-Bar, Dragan Ahmetovic, Kris Kitani, and Chieko Asakawa. \"How context and user behavior affect indoor navigation assistance for blind people.\" In Proceedings of the Internet of Accessible Things, pp. 1-4. 2018.",
      "doi": ""
    },
    {
      "text": "Gupta, Maya, Ali Abdolrahmani, Emory Edwards, Mayra Cortez, Andrew Tumang, Yasmin Majali, Marc Lazaga \"Towards More Universal Wayfinding Technologies: Navigation Preferences Across Disabilities.\" In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pp. 1-13. 2020.",
      "doi": ""
    },
    {
      "text": "Harding, Jim. \"A research-based approach for improving the airport wayfinding experience.\" Journal of Airport Management 13, no. 2 (2019): 133-143.",
      "doi": ""
    },
    {
      "text": "Kamikubo, Rie, Naoya Kato, Keita Higuchi, Ryo Yonetani, and Yoichi Sato. \"Support Strategies for Remote Guides in Assisting People with Visual Impairments for Effective Indoor Navigation.\" In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pp. 1-12. 2020.",
      "doi": ""
    },
    {
      "text": "Kane, Shaun K., Chandrika Jayant, Jacob O. Wobbrock, and Richard E. Ladner. \"Freedom to roam: a study of mobile device adoption and accessibility for people with visual and motor disabilities.\" In Proceedings of the 11th international ACM SIGACCESS conference on Computers and accessibility, pp. 115-122. 2009.",
      "doi": ""
    },
    {
      "text": "Lazar, Jonathan, Aaron Allen, Jason Kleinman, and Chris Malarkey. \"What frustrates screen reader users on the web: A study of 100 blind users.\" International Journal of human-computer interaction 22, no. 3 (2007): 247-269.",
      "doi": ""
    },
    {
      "text": "Legge, Gordon E., Chris Downey, Nicholas A. Giudice, and Bosco S. Tjan. Indoor airport wayfinding for blind and visually impaired travelers. No. DOT/FAA/TC-TN16/54. 2016.",
      "doi": ""
    },
    {
      "text": "Lister, Kate, Tim Coughlan, Francisco Iniesto, Nick Freear, and Peter Devine. \"Accessible conversational user interfaces: considerations for design.\" In Proceedings of the 17th International Web for All Conference, pp. 1-11. 2020.",
      "doi": ""
    },
    {
      "text": "Loomis, Jack M., Reginald G. Golledge, Roberta L. Klatzky, Jon M. Speigle, and Jerome Tietz. \"Personal guidance system for the visually impaired.\" In Proceedings of the first annual ACM conference on Assistive technologies, pp. 85-91. 1994.",
      "doi": ""
    },
    {
      "text": "Lopatovska, Irene, Katrina Rink, Ian Knight, Kieran Raines, Kevin Cosenza, Harriet Williams, Perachya Sorsche, David Hirsch, Qi Li, and Adrianna Martinez. \"Talk to me: Exploring user interactions with the Amazon Alexa.\" Journal of Librarianship and Information Science 51, no. 4 (2019): 984-997.",
      "doi": ""
    },
    {
      "text": "Lovato, Silvia B., Anne Marie Piper, and Ellen A. Wartella. \"Hey Google, Do Unicorns Exist? Conversational Agents as a Path to Answers to Children's Questions.\" In Proceedings of the 18th ACM International Conference on Interaction Design and Children, pp. 301-313. 2019.",
      "doi": ""
    },
    {
      "text": "Lovato, Silvia, and Anne Marie Piper. \"\" Siri, is this you?\" Understanding young children's interactions with voice input systems.\" In Proceedings of the 14th International Conference on Interaction Design and Children, pp. 335-338. 2015.",
      "doi": ""
    },
    {
      "text": "Luger, Ewa, and Abigail Sellen. \"\" Like Having a Really Bad PA\" The Gulf between User Expectation and Experience of Conversational Agents.\" In Proceedings of the 2016 CHI conference on human factors in computing systems, pp. 5286-5297. 2016.",
      "doi": ""
    },
    {
      "text": "Maskery, Helen. \"Crossing the digital divide—possibilities for influencing the private-sector business case.\" The Information Society 23, no. 3 (2007): 187-191.",
      "doi": "10.1080/01972240701323614"
    },
    {
      "text": "Murad, Christine, and Cosmin Munteanu. \"Designing Voice Interfaces: Back to the (Curriculum) Basics.\" In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pp. 1-12. 2020.",
      "doi": ""
    },
    {
      "text": "Murad, Christine, Cosmin Munteanu, Leigh Clark, and Benjamin R. Cowan. \"Design guidelines for hands-free speech interaction.\" In Proceedings of the 20th International Conference on Human-Computer Interaction with Mobile Devices and Services Adjunct, pp. 269-276. 2018.",
      "doi": ""
    },
    {
      "text": "Murphy, Emma, Ravi Kuber, Graham McAllister, Philip Strain, and Wai Yu. \"An empirical investigation into the difficulties experienced by visually impaired Internet users.\" Universal Access in the Information Society 7, no. 1-2 (2008): 79-91.",
      "doi": "10.1007/s10209-007-0098-4"
    },
    {
      "text": "Nearby Explorer Online. 2019. Accessed September 8, 2020 from https://apps.apple.com/us/app/nearby-explorer-online/id1095699328.",
      "doi": ""
    },
    {
      "text": "Portet, François, Michel Vacher, Caroline Golanski, Camille Roux, and Brigitte Meillon. \"Design and evaluation of a smart home voice interface for the elderly: acceptability and objection aspects.\" Personal and Ubiquitous Computing 17, no. 1 (2013): 127-144.",
      "doi": "10.1007/s00779-011-0470-5"
    },
    {
      "text": "Ran, Lisa, Sumi Helal, and Steve Moore. \"Drishti: an integrated indoor/outdoor blind navigation system and service.\" In Second IEEE Annual Conference on Pervasive Computing and Communications, 2004. Proceedings of the, pp. 23-30. IEEE, 2004.",
      "doi": ""
    },
    {
      "text": "Reinders, Samuel, Matthew Butler, and Kim Marriott. \"\" Hey Model!\"–Natural User Interactions and Agency in Accessible Interactive 3D Models.\" In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pp. 1-13. 2020.",
      "doi": ""
    },
    {
      "text": "Rituerto, Alejandro, Giovanni Fusco, and James M. Coughlan. \"Towards a sign-based indoor navigation system for people with visual impairments.\" In Proceedings of the 18th International ACM SIGACCESS Conference on Computers and Accessibility, pp. 287-288. 2016.",
      "doi": ""
    },
    {
      "text": "Roy, Antony Rishin Mukkath, Ali Abdolrahmani, Ravi Kuber, and Stacy M. Branham. \"Beyond being human: The (in) accessibility consequences of modeling VAPAs after human-human conversation.\" Interactions 7 (2019): 5.",
      "doi": ""
    },
    {
      "text": "Saha, Manaswi, Alexander J. Fiannaca, Melanie Kneisel, Edward Cutrell, and Meredith Ringel Morris. \"Closing the Gap: Designing for the Last-Few-Meters Wayfinding Problem for People with Visual Impairments.\" In The 21st International ACM SIGACCESS Conference on Computers and Accessibility, pp. 222-235. 2019.",
      "doi": ""
    },
    {
      "text": "Saldaña, Johnny. The coding manual for qualitative researchers. Sage, 2015.",
      "doi": ""
    },
    {
      "text": "Sato, Daisuke, Uran Oh, João Guerreiro, Dragan Ahmetovic, Kakuya Naito, Hironobu Takagi, Kris M. Kitani, and Chieko Asakawa. \"NavCog3 in the wild: Large-scale blind indoor navigation assistant with semantic features.\" ACM Transactions on Accessible Computing (TACCESS) 12, no. 3 (2019): 1-30.",
      "doi": "10.1145/3340319"
    },
    {
      "text": "Sato, Daisuke, Uran Oh, Kakuya Naito, Hironobu Takagi, Kris Kitani, and Chieko Asakawa. \"Navcog3: An evaluation of a smartphone-based blind indoor navigation assistant with semantic features in a large-scale environment.\" In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, pp. 270-279. 2017.",
      "doi": ""
    },
    {
      "text": "Schaffer, Stefan, and Norbert Reithinger. \"Conversation is multimodal: thus conversational user interfaces should be as well.\" In Proceedings of the 1st International Conference on Conversational User Interfaces, pp. 1-3. 2019.",
      "doi": ""
    },
    {
      "text": "Sears, Andrew, and Vicki Hanson. \"Representing users in accessibility research.\" In Proceedings of the SIGCHI conference on Human factors in computing systems, pp. 2235-2238. 2011.",
      "doi": ""
    },
    {
      "text": "Shinohara, Kristen, and Jacob O. Wobbrock. \"In the shadow of misperception: assistive technology use and social interactions.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 705-714. 2011.",
      "doi": ""
    },
    {
      "text": "Shinohara, Kristen. \"Design for social accessibility: incorporating social factors in the design of accessible technologies.\" PhD diss., 2017.",
      "doi": ""
    },
    {
      "text": "Stent, Amanda, Ann Syrdal, and Taniya Mishra. \"On the intelligibility of fast synthesized speech for individuals with early-onset blindness.\" In The proceedings of the 13th international ACM SIGACCESS conference on Computers and accessibility, pp. 211-218. 2011.",
      "doi": ""
    },
    {
      "text": "The A11Y Project. Accessed September 8, 2020. https://www.a11yproject.com/.",
      "doi": ""
    },
    {
      "text": "Trajkova, Milka, and Aqueasha Martin-Hammond. \"\" Alexa is a Toy\": Exploring Older Adults' Reasons for Using, Limiting, and Abandoning Echo.\" In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pp. 1-13. 2020.",
      "doi": ""
    },
    {
      "text": "van der Bie, Joey, Christina Jaschinski, and Somaya Ben Allouch. \"Sidewalk, a wayfinding message syntax for people with a visual impairment.\" In The 21st International ACM SIGACCESS Conference on Computers and Accessibility, pp. 609-611. 2019.",
      "doi": ""
    },
    {
      "text": "Vtyurina, Alexandra, Adam Fourney, Meredith Ringel Morris, Leah Findlater, and Ryen W. White. \"Bridging screen readers and voice assistants for enhanced eyes-free web search.\" In The World Wide Web Conference, pp. 3590-3594. 2019.",
      "doi": ""
    },
    {
      "text": "Vtyurina, Alexandra, Adam Fourney, Meredith Ringel Morris, Leah Findlater, and Ryen W. White. \"VERSE: Bridging screen readers and voice assistants for enhanced eyes-free web search.\" In The 21st International ACM SIGACCESS Conference on Computers and Accessibility, pp. 414-426. 2019.",
      "doi": ""
    },
    {
      "text": "Wang, Jinping, Hyun Yang, Ruosi Shao, Saeed Abdullah, and S. Shyam Sundar. \"Alexa as Coach: Leveraging Smart Speakers to Build Social Agents that Reduce Public Speaking Anxiety.\" In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pp. 1-13. 2020.",
      "doi": ""
    },
    {
      "text": "Waze. 2020. Accessed December 22, 2020 from https://www.waze.com/.",
      "doi": ""
    },
    {
      "text": "Williams, Michele A., Amy Hurst, and Shaun K. Kane. \"\" Pray before you step out\" describing personal and situational blind navigation behaviors.\" In Proceedings of the 15th International ACM SIGACCESS Conference on Computers and Accessibility, pp. 1-8. 2013.",
      "doi": ""
    },
    {
      "text": "Williams, Michele A., Caroline Galbraith, Shaun K. Kane, and Amy Hurst. \"\" just let the cane hit it\" how the blind and sighted see navigation differently.\" In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility, pp. 217-224. 2014.",
      "doi": ""
    },
    {
      "text": "Winkler, Rainer, Sebastian Hobert, Antti Salovaara, Matthias Söllner, and Jan Marco Leimeister. \"Sara, the lecturer: Improving learning in online education with a scaffolding-based conversational agent.\" In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, pp. 1-14. 2020.",
      "doi": ""
    },
    {
      "text": "Wulf, Linda, Markus Garschall, Julia Himmelsbach, and Manfred Tscheligi. \"Hands free-care free: elderly people taking advantage of speech-only interaction.\" In Proceedings of the 8th Nordic Conference on Human-Computer Interaction: Fun, Fast, Foundational, pp. 203-206. 2014.",
      "doi": ""
    },
    {
      "text": "Yu, Christina, Howard Shane, Ralf W. Schlosser, Amanda O'Brien, Anna Allen, Jennifer Abramson, and Suzanne Flynn. \"An exploratory study of speech-language pathologists using the Echo Show™ to deliver visual supports.\" Advances in Neurodevelopmental Disorders 2, no. 3 (2018): 286-292.",
      "doi": ""
    },
    {
      "text": "Zhong, Yu, T. V. Raman, Casey Burkhardt, Fadi Biadsy, and Jeffrey P. Bigham. \"JustSpeak: enabling universal voice control on Android.\" In Proceedings of the 11th Web for All Conference, pp. 1-4. 2014.",
      "doi": ""
    }
  ]
}