{
  "doi": "10.1145/3411764.3445287",
  "title": "Disentangling the Motivational Pathways of Recreational Esports Gamblers: A Laddering Study",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [],
  "abstract": "Whereas past CHI-related work has paid attention to various elements of the esports industry, there exists a scarcity of such research on the increasing convergence between esports and gambling. This study, therefore, aimed to shed light on the emerging phenomenon of esports betting in two ways. First, we theorized about its characteristics according to the 5W1H framework. Second, using semi-structured laddering interviews and Means-End Chain Theory, we assessed the esports betting motivations of young, male and recreational gamblers who interact with monetary and skin betting websites. Our results show that gamblers follow various motivational pathways when using an esports betting platform and construct their motives in relation to platform-specific properties and personal values. As such, we demonstrate that a holistic understanding of esports betting is of utmost importance if we want to explain and investigate its appeal to a worldwide audience.",
  "tags": [
    "Means-End Chain Theory",
    "Design",
    "Values",
    "Gambling",
    "Laddering",
    "Esports",
    "Motivations"
  ],
  "authors": [
    {
      "name": "Maarten Denoo",
      "institution": "Meaningful Interactions Lab, Institute for Media Studies, KU Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701357",
      "orcid": "missing"
    },
    {
      "name": "Niels Bibert",
      "institution": "Meaningful Interactions Lab, Institute for Media Studies, KU Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702427",
      "orcid": "missing"
    },
    {
      "name": "Bieke Zaman",
      "institution": "Meaningful Interactions Lab, Institute for Media Studies, KU Leuven, Leuven, Belgium",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338491942",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kelly L. Adams, Gabriella Devia-Allen, and Maria A. Moore. 2019. What is Esports? In Understanding Esports. An Introduction to the Global Phenomenon (Ed. Ryan Rogers). Lexington Books, London, UK.",
      "doi": ""
    },
    {
      "text": "Guo Freeman and Donghee Y. Wohn. 2017. eSports as An Emerging Research Context at CHI: Diverse Perspectives on Definitions. In CHI '17: Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing, May 06-11, 2017, Denver, Colorado, USA. ACM, New York, NY, 1601-1608. https://doi.org/10.1145/3027063.3053158",
      "doi": "10.1145/3027063.3053158"
    },
    {
      "text": "Jason G. Reitman, Maria J. Anderson-Coto, Minerva Wu, Je S. Lee, and Constance Steinkuehler. 2019. Esports Research: A Literature Review. Games and Culture 15, 1, 32-50. DOI: https://doi.org/10.1177/1555412019840892",
      "doi": ""
    },
    {
      "text": "Justin Bonny, Lisa M. Castaneda, and Tom Swanson. 2016. Using an International Gaming Tournament to Study Individual Differences in MOBA Expertise and Cognitive Skills. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, May 07-12, 2016, San Jose, California, USA. ACM, New York, NY, 3473-3484. https://doi.org/10.1145/2858036.2858190",
      "doi": "10.1145/2858036.2858190"
    },
    {
      "text": "Alex Leavitt, Brian Keegan, and Joshua Clark. 2016. Ping to Win?: Non-Verbal Communication and Team Performance in Competitive Online Multiplayer Games, In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, May 07-12, 2016, San Jose, California, USA. ACM, New York, NY, 4337-4350. https://doi.org/10.1145/2858036.2858132",
      "doi": "10.1145/2858036.2858132"
    },
    {
      "text": "Simone Kriglstein, Günter Wallner, Sven Charleer, Kathrin Gerling, PejmanMirza-Babaei, Steven Shirra, and Manfred Tscheligi. 2020. Be Part Of It: Spectator Experience in Gaming and Esports. In CHI EA '20: Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, April 25-30, 2020, Honolulu, HI, USA. ACM, New York, NY, 1-7. https://doi.org/10.1145/3334480.3375153",
      "doi": ""
    },
    {
      "text": "Ilya Musabirov, Dennis Bulygin, Paul Okopny, and Ksenia Konstantinova. 2018. Event-driven Spectators' Communication in Massive eSports Online Chats, In CHI EA '18: Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems, April, 21-26, 2018, Montreal, QC, Canada. ACM, New York, NY, 1-6. https://doi.org/10.1145/3170427.3188447",
      "doi": "10.1145/3170427.3188447"
    },
    {
      "text": "Hibai Lopez-Gonzalez, and Mark D. Griffiths. 2018. Understanding the convergence of markets in online sports betting. International Review for the Sociology of Sport 53, 7, 807-823. DOI: https://doi.org/10.1177/1012690216680602",
      "doi": ""
    },
    {
      "text": "Nancy Greer, Matthew Rockloff, Matthew Browne, Nerilee Hing, and Daniel L. King. 2019. Esports Betting and Skin Gambling: A Brief History. Journal of Gambling Issues, 43, 1 (Dec. 2019), 128-146. DOI: http://dx.doi.org/10.4309/jgi.2019.43.8",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Faltin Karlsen, Joseph Macey, Torril E. Mortensen, Heather Wardle, and David Zendle. 2020. The Convergence of Gaming and Gambling Research: What Can We Learn from Each Other? In DiGRA'20 - Abstract: Proceedings of the 2020 DiGRA International Conference. 02-06 Jun, 2020, Tampere, Finland. Retrieved from http://eprints.whiterose.ac.uk/156462/",
      "doi": ""
    },
    {
      "text": "Seiie Jang, Eun-Jung Ko, and Woontack Woo. 2005. Unified User-Centric Context: Who, Where, When, What, How and Why. In Proceedings of the First Internaltional Workshop on Personalized Context Modeling and Management for UbiComp Applications, September 11, 2005, Tokyo, Japan. CEUR Workshop Proceedings 149, 26-34. Retrieved from https://www.cmc.is.i.nagoya-u.ac.jp/∼jang/paper/2005-ubipcmm.pdf",
      "doi": ""
    },
    {
      "text": "Bieke Zaman, Kristof Geurden, Rozane De Cock, Bob De Schutter, and Vero Vanden Abeele. 2014. Motivation profiles of online Poker players and the role of interface preferences: A laddering study among amateur and (semi-) professionals. Computers in Human Behavior, 39, 1 (Oct. 2014), 154-164. DOI: https://doi.org/10.1016/j.chb.2014.07.009",
      "doi": "10.1016/j.chb.2014.07.009"
    },
    {
      "text": "Jonathan Gutman. 1982. A Means-End Chain Model Based on Consumer Categorization Processes. Journal of marketing 46, 2, 60-72. DOI: https://doi.org/10.1177/002224298204600207",
      "doi": ""
    },
    {
      "text": "Chris Grove. 2016. eSports and gambling: Where's the action? Retrieved from https://www.greo.ca/Modules/EvidenceCentre/Details/esports-gambling-wheres-the-action",
      "doi": ""
    },
    {
      "text": "Thomas J. Reynolds and Jonathan Gutman. 1988. Laddering theory, method, analysis and interpretation. Journal of Advertising Research, 28, 1 11-31. DOI: 10.4324/9781410600844-9",
      "doi": ""
    },
    {
      "text": "Bieke Zaman. 2011. Laddering method with preschoolers. Understanding preschoolers' user experience with digital media. Ph.D. Dissertation. KU Leuven, Leuven, Belgium. Retrieved from https://lirias.kuleuven.be/1858391?limo=0",
      "doi": ""
    },
    {
      "text": "Brett Abarbanel, Joseph Macey, Juho Hamari, and Rolando Melton. 2020. Gamers Who Gamble: Examining the Relationship Between Esports Spectatorship and Event Wagering. Journal of Emerging Sport Studies, 3, 1, Article 1, 23 pages. Retrieved from https://digitalcommons.library.tru.ca/jess/vol3/iss1/1",
      "doi": ""
    },
    {
      "text": "John George and Brett Sherrick. 2019. Competition Formats in Esports. In Understanding Esports. An Introduction to the Global Phenomenon (Ed. Ryan Rogers). Lexington Books, London, UK.",
      "doi": ""
    },
    {
      "text": "Philip W. S. Newall, Lukasz Walasek, Rebecca Vázquez Kiesel, Elliot A. Ludvig, and Caroline Meyer. 2020. Request-a-bet sports betting products indicate patterns of bettor preference and bookmaker profits. Journal of Behavioral Addictions, Online first. DOI: https://doi.org/10.1556/2006.2020.00054",
      "doi": ""
    },
    {
      "text": "Philip W. S. Newall, Rebecca Cassidy, Lukasz Walasek, Elliot A. Ludvig, and Caroline Meyer. 2020. Who uses custom sports betting products? Addiction Research and Theory, Online First. DOI: https://doi.org/10.1080/16066359.2020.1792887",
      "doi": ""
    },
    {
      "text": "Esportsbets. 2020. Virtual Esports Betting - How Does VIrtual Betting Work for Esports Games? Retrieved from https://www.esportsbets.com/virtual-esports-betting/",
      "doi": ""
    },
    {
      "text": "Unibet. 2017. Betting on esports: Counter-Strike: Global Offensive. Retrieved from https://www.unibet.com/betting/news/betting-on-esports-counter-strike-global-offensive-1.968660",
      "doi": ""
    },
    {
      "text": "Unibet. 2017. Betting on Esports: League of legends. Retrieved from https://www.unibet.com/betting/news/betting-on-esports-league-of-legends-1.968770",
      "doi": ""
    },
    {
      "text": "Unibet Community. 2018. Request a bet. Retrieved from https://www.unibetcommunity.com/t5/Betting-and-Sports/Request-A-Bet/td-p/139366",
      "doi": ""
    },
    {
      "text": "Unibet. 2020. Virtual Sports Betting Guide. Retrieved from https://www.unibet.com/betting/rugby-league%7C1000154363.odds/guides/virtual-sports-betting-guide-1.1427092",
      "doi": ""
    },
    {
      "text": "Unibet. 2020. Unibet Politics Betting. Retrieved from https://www.unibet.eu/betting/sports/filter/politics/1004712871",
      "doi": ""
    },
    {
      "text": "Stewart N. Ethier. 2010. Probability and its Applications, Vol: The Doctrine of Chances. Probablistic Aspects of Gambling (2010 Ed.) Springer, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Killick, and Mark D. Griffiths. 2019. In-Play Sports Betting: a Scoping Study. International Journal of Mental Health and Addiction 14, 1, 1456–1495. DOI: https://doi.org/10.1007/s11469-018-9896-6",
      "doi": ""
    },
    {
      "text": "Daniel L. King, and Paul H. Delfabbro. 2016. Early exposure to digital simulated gambling: A review and conceptual model. Computers in Human Behavior 55, 1 (Feb. 2016), 198-206. DOI: https://doi.org/10.1016/j.chb.2015.09.012",
      "doi": "10.1016/j.chb.2015.09.012"
    },
    {
      "text": "Joseph Macey, and Juho Hamari. 2019. eSports, skins and loot boxes: Participants, practices and problematic behaviour associated with emergent forms of gambling. New Media & Society 21, 1, 20-41. DOI: https://doi.org/10.1177/1461444818786216",
      "doi": ""
    },
    {
      "text": "Unibet. 2020. Deposit limits. Retrieved from https://www.unibetcommunity.com/t5/Help-Support/Does-a-maximum-limit-amount-exist-for-a-bet/td-p/217952",
      "doi": ""
    },
    {
      "text": "Brett L. Abarbanel and Joseph Macey. 2019. VGO, NFT, OMG! Commentary on continued developments in skins wagering. Gaming Law Review 23, 1 (Feb. 2019), 23-25. DOI: https://doi.org/10.1089/glr2.2019.2312",
      "doi": ""
    },
    {
      "text": "Chris Grove. 2016. Understanding skin gambling. Retrieved from http://www.esportsbettingreport.com/wp-content/uploads/2016/07/A-Guide-To-Skin-Gambling.pdf",
      "doi": ""
    },
    {
      "text": "CSGO Empire. 2020. Match Betting. Retrieved from https://csgoempire.com/match-betting",
      "doi": ""
    },
    {
      "text": "VGO Casinos. 2021. Best VGO Gambling Sites 2021 with Free Coins. Retrieved from https://vgocasinos.com/vgo-gambling",
      "doi": ""
    },
    {
      "text": "Bwin Help. 2020. General Information. 2020. Retrieved from https://help.bwin.com/en/general-information/payments/payment-methods",
      "doi": ""
    },
    {
      "text": "European Gaming and Betting Association. 2020. Licences EU Market. Retrieved from https://www.egba.eu/eu-market/licensing/",
      "doi": ""
    },
    {
      "text": "Sally Gainsbury, Brett L. Abarbanel, and Alex Blaszczynski. 2017. Game on: Comparison of demographic profiles, consumption behaviours, and gambling site selection criteria of esports and sports bettors. Gaming Law Review 21, 8, 575-587. DOI: https://doi.org/10.1089/glr2.2017.21813",
      "doi": ""
    },
    {
      "text": "BETTINGSITE.com.au. How to use a VPN when betting from abroad. Retrieved August 30, 2020 from https://bettingsite.com.au/vpn/",
      "doi": ""
    },
    {
      "text": "Joseph Macey, Brett L. Abarbanel, and Juho Hamari. 2020. What predicts esports betting? A study on consumption of video games, esports, gambling and demographic factors. New Media & Society, Online First, 1-25. DOI: https://doi.org/10.1177/1461444820908510",
      "doi": ""
    },
    {
      "text": "Andrew C. Billings and Jue Hou. 2019. The Origins of Esport: A Helf Century History of an “Overnight” Succes. In Understanding Esports. An Introduction to the Global Phenomenon (Ed. Ryan Rogers). Lexington Books, London, UK.",
      "doi": ""
    },
    {
      "text": "Alex M.T. Russell, Nerilee Hing, Matthew Browne, En Li, and Peter Vitartas. 2019. Who Bets on Micro Events (Microbets) in Sports? Journal of Gambling Studies 35, 1, 205-223. DOI: https://doi.org/10.1007/s10899-018-9810-y",
      "doi": ""
    },
    {
      "text": "Gambling Commission. 2017. Virtual currencies, eSports and social casino gaming – position paper. Retrieved from https://www.gamblingcommission.gov.uk/PDF/Virtual-currencies-eSports-and-social-casino-gaming.pdf",
      "doi": ""
    },
    {
      "text": "Superdata Research. 2017. Gambling and digital games in the Netherlands (January 2017). Retrieved from https://www.scribd.com/document/344252413/Superdata-Deliverable-Gambling-Digital-Games-January-2017-002",
      "doi": ""
    },
    {
      "text": "Gambling Commission. 2018. Gambling participation in 2017: behaviour, awareness and attitudes. Retrieved from https://www.gamblingcommission.gov.uk/PDF/survey-data/Gambling-participation-in-2018-behaviour-awareness-and-attitudes.pdf.",
      "doi": ""
    },
    {
      "text": "Joseph Macey, and Juho Hamari. 2018. Investigating relationships between video gaming, spectating esports, and gambling. Computers in Human Behavior 80, 1, 344-353. DOI: https://doi.org/10.1016/j.chb.2017.11.027",
      "doi": "10.1016/j.chb.2017.11.027"
    },
    {
      "text": "Paul Delfabbro, and Daniel L. King. 2020. Gaming-gambling convergence: evaluating evidence for the ‘gateway’ hypothesis. International Gambling Studies, Online First. DOI: https://doi.org/10.1080/14459795.2020.17684300",
      "doi": ""
    },
    {
      "text": "Kevin Sweeney, Mark Tuttle, and Milo D. Berg. 2019. Esports Gambling: Market Structure and Biases. Games and Culture, Online First. DOI: https://doi.org/10.1177/1555412019872389",
      "doi": ""
    },
    {
      "text": "Sally Gainsbury, Brett L. Abarbanel, and Alex Blaszczynski. 2017. Intensity and gambling harms: Exploring breadth of gambling involvement among esports bettors. Gaming Law Review 21, 8, 610-615. DOI: https://doi.org/10.1089/glr2.2017.21812",
      "doi": ""
    },
    {
      "text": "Icek Ajzen, and Martin Fishbein. 2010. Predicting and changing behavior: the reasoned action approach. Psychology press, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Per Binde. 2013. Why people gamble: a model with five motivational dimensions. International Gambling Studies 13(1), 81-97. DOI: https://doi.org/10.1080/14459795.2012.712150",
      "doi": ""
    },
    {
      "text": "Thitapa Shinaprayoon, Nathan T. Carter, and Adam S. Goodie. 2017. The Modified Gambling Motivation Scale: Confirmatory factor analysis and links with problem gambling. Journal of Gambling Issues 37, 1, 108-135. DOI: https://doi.org/10.4309/jgi.2018.37.5",
      "doi": ""
    },
    {
      "text": "Natale Canale, Massimo Santinelloa, and Mark D.Griffiths. 2015. Validation of the reasons for gambling questionnaire (RGQ) in a British population survey. Addictive Behaviors 45, 1 (Jun. 2015), 276–280. DOI: https://doi.org/10.1016/j.addbeh.2015.01.035",
      "doi": ""
    },
    {
      "text": "Denis F. Polit and Cheryl T. Beck (2010). Generalization in quantitative and qualitative research: Myths and strategies. International Journal of Nursing Studies 47, 11 (Nov. 2010), 1451-1458. DOI: https://doi.org/10.1016/j.ijnurstu.2010.06.004",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Oliver L. Haimson, and Danielle Lottridge. 2019. How to do better with gender on surveys: a guide for HCI researchers. Interactions 26, 4 (Jun. 2019), 62-65. DOI: https://doi.org/10.1145/3338283",
      "doi": "10.1145/3338283"
    },
    {
      "text": "Samuel C. Peter, Qian Li, James P. Whelan, and Andrew W. Meyers. 2019. Public Stigma Across Addictive Behaviors: Casino Gambling, eSports Gambling, and Internet Gaming. Journal of Gambling Studies 35, 1 (Mar. 2019), 247-259. DOI: https://doi.org/10.1007/s10899-018-9775-x",
      "doi": ""
    },
    {
      "text": "Klaus G. Grunert and Tino Bech-Larsen. 2005. Explaining choice option attractiveness by beliefs elicited by the laddering method. Journal of Economic Psychology, 26, 2 (Apr. 2005), 223-241. DOI: https://doi.org/10.1016/j.joep.2004.04.002",
      "doi": ""
    },
    {
      "text": "Derek Layder. 1998. Sociological practice: linking theory and social research. Sage, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Shalom H. Schwartz. 2012. An overview of the Schwartz theory of basic values. Online readings in Psychology and Culture 2, 1, Article 11 (December 2012), 20 pages. DOI: http://dx.doi.org/10.9707/2307-0919.1116",
      "doi": ""
    },
    {
      "text": "Belgian Gaming Commission. 2016. Gaming Commission 2016 Annual Report. Retrieved from https://www.gamingcommission.be/opencms/opencms/jhksweb_nl/gamingcommission/RA",
      "doi": ""
    },
    {
      "text": "Vlaamse expertisecentrum Alcohol en andere Drugs (VAD). 2020. E-sports, e-sportsbetting & skin betting : van competitief multiplayer-gamen tot ‘nieuwe’ gokfenomenen? Retrieved from https://www.vad.be/artikels/detail/e-sport-e-sportsbetting–skin-betting-van-competitief-multiplayer-gamen-tot-nieuwe-gokfenomenen",
      "doi": ""
    },
    {
      "text": "Martin Fishbein, Icek Ajzen, and Ron Hinkle. 1980. Predicting and understanding voting in American elections: Effects of external variables. In Understanding attitudes and predicting social behavior. Prentice Hall, Englewood Cliffs, New Jersey, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Gail Jefferson. 2004. Glossary of transcript symbols with an introduction. In Conversation Analysis: Studies from the first generation. John Benjamins Publishing Company, Amsterdam, The Netherlands.",
      "doi": ""
    },
    {
      "text": "Greg Guest, Arwen Bunce, and Laura Johnson. 2006. How Many Interviews Are Enough?: An Experiment with Data Saturation and Variability. Field Methods, 18, 1 (Feb. 2006), 59-82. DOI: https://doi.org/10.1177/1525822X05279903",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology, 3, 2, 77-101. DOI: https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "June Cotte. 1997. Chances, Trances, And Lots Of Slots: Gambling Motives And Consumption Experiences. Journal of Leisure Research 29,4, 380-406. DOI: https://doi.org/10.1080/00222216.1997.11949805",
      "doi": ""
    },
    {
      "text": "Peggy Sue Loroz. 2004. Golden‐age gambling: Psychological benefits and self‐concept dynamics in aging consumers' consumption experiences. Psychology & Marketing, 21, 5 (Mar. 2004), 323-349. DOI: https://doi.org/10.1002/mar.20008",
      "doi": ""
    },
    {
      "text": "Xiang Fang and John C. Mowen. 2009. Examining the trait and functional motive antecedents of four gambling activities: slot machines, skilled card games, sports betting, and promotional games. Journal of Consumer Marketing 26, 2, 121-131. DOI: https://doi.org/10.1108/07363760910940483",
      "doi": ""
    },
    {
      "text": "Rodney J. Paul and Andrew P. Weinbach. 2010. The Determinants of Betting Volume for Sports in North America: Evidence of Sports Betting as Consumption in the NBA and NHL. International Journal of Sport Finance 5, 2 (May 2010), 128-140.",
      "doi": ""
    },
    {
      "text": "Brad R. Humphreys, Rodney J. Paul, and Andrew P. Weinbach. 2013. Consumption benefits and gambling: Evidence from the NCAA basketball betting market. Journal of Economic Psychology 39, 1 (Dec. 2013), 376-386. DOI: https://doi.org/10.1016/j.joep.2013.05.010",
      "doi": ""
    },
    {
      "text": "Brett L. Abarbanel. 2014. Differences in motivational dimensions across gambling frequency, game choice and medium of play in the United Kingdom. International Gambling Studies 14, 3 (Nov. 2014), 472-491. DOI: https://doi.org/10.1080/14459795.2014.966131",
      "doi": ""
    },
    {
      "text": "Matthew Lamont and Nerilee Hing. 2018. Sports Betting Motivations Among Young Men: An Adaptive Theory Analysis. Leisure Sciences 42, 2 (Sep. 2018), 1-20. DOI: https://doi.org/10.1080/01490400.2018.1483852",
      "doi": ""
    },
    {
      "text": "Stina Bengtsson, Karin Fast, André Jansson, and Johan Lindell. 2020. Media and basic desires: An approach to measuring the mediatization of daily human life. Communications, Ahead-of-print. DOI: https://doi.org/10.1515/commun-2019-0122",
      "doi": ""
    },
    {
      "text": "Choong-Ki Lee, Yong-Ki Lee, Bo J. Bernhard, and Yoo-Skik Yoon. 2006. Segmenting casino gamblers by motivation: A cluster analysis of Korean gamblers. Tourism Management 27, 5 (Oct. 2005), 856-866. DOI: https://doi.org/10.1016/j.tourman.2005.05.009",
      "doi": ""
    },
    {
      "text": "Choong-Ki Lee, Bongkoo Lee, Bo J. Bernhard, and Tae K. Lee. 2009. A Comparative Study of Involvement and Motivation among Casino Gamblers. Psychiatry investigation 6, 3 (Jul. 2009), 141-149. DOI: https://doi.org/10.4306/pi.2009.6.3.141",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen. 1994. Enhancing the explanatory power of usability heuristics. In CHI '94: Proceedings of the SIGCHI conference on Human Factors in Computing Systems, April 24-28, 1994, Boston, Massachusetts. ACM, New York, NY, 152-158. https://doi.org/10.1145/191666.191729",
      "doi": "10.1145/191666.191729"
    },
    {
      "text": "usability.gov. 2020. Heuristic Evaluations and Expert Reviews. Retrieved from https://www.usability.gov/how-to-and-tools/methods/heuristic-evaluation.html",
      "doi": ""
    },
    {
      "text": "Unibet Community. 2020. Unibet Community. Retrieved from https://www.unibetcommunity.com/",
      "doi": ""
    },
    {
      "text": "Winfried Schulz. 2004. Reconstructing Mediatization as an Analytical Concept. European Journal of Communication 19, 1 (Mar. 2004), 87-101. DOI: https://doi.org/10.1177/0267323104040696",
      "doi": ""
    },
    {
      "text": "Clayton Neighbors, Ty W. Lostutter, Mary E. Larimer, and Ruby Y. Takushi. 2002. Measuring Gambling Outcomes Among College Students. Journal of Gambling Studies 18, 4 (Winter 2002), 339-360. DOI: https://doi.org/10.1023/A:1021013132430",
      "doi": ""
    },
    {
      "text": "David Zendle, Rachel Meyer, and Harriet Over. 2019. Adolescents and loot boxes: Links with problem gambling and motivations for purchase. Royal Society Open Science 6, 6 (June 2019), 18 pages. DOI: https://doi.org/10.1098/rsos.190049",
      "doi": ""
    }
  ]
}