{
  "doi": "10.1145/3411764.3445258",
  "title": "Your Photo is so Funny that I don’t Mind Violating Your Privacy by Sharing it: Effects of Individual Humor Styles on Online Photo-sharing Behaviors",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "We investigate how people’s ‘humor style’ relates to their online photo-sharing behaviors and reactions to ‘privacy primes’. In an online experiment, we queried 437 participants about their humor style, likelihood to share photo-memes, and history of sharing others’ photos. In two treatment conditions, participants were either primed to imagine themselves as the photo-subjects or to consider the photo-subjects’ privacy before sharing memes. We found that participants who frequently use aggressive and self-deprecating humor were more likely to violate others’ privacy by sharing photos. We also replicated the interventions’ paradoxical effects – increasing sharing likelihood – as reported in earlier work and identified the subgroups that demonstrated this behavior through interaction analyses. When primed to consider the subjects’ privacy, only humor deniers (participants who use humor infrequently) demonstrated increased sharing. In contrast, when imagining themselves as the photo-subjects, humor deniers, unlike other participants, did not increase the sharing of photos.",
  "authors": [
    {
      "name": "Rakibul Hasan",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261148",
      "orcid": "missing"
    },
    {
      "name": "Bennett I. Bertenthal",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701133",
      "orcid": "missing"
    },
    {
      "name": "Kurt Hugenberg",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702115",
      "orcid": "missing"
    },
    {
      "name": "Apu Kapadia",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/do/10.1145/contrib-81100481887/rel-imgonly/apu-medium.jpg",
      "acmid": "81100481887",
      "orcid": "0000-0003-4142-8444"
    }
  ],
  "references": [
    {
      "text": "2016. 10 Internet memes that ruined lives. http://www.craveonline.com/mandatory/1066114-10-internet-memes-that-ruined-lives/",
      "doi": ""
    },
    {
      "text": "2020. Know Your Meme. https://knowyourmeme.com/",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti, Idris Adjerid, Rebecca Balebako, Laura Brandimarte, Lorrie Faith Cranor, Saranga Komanduri, Pedro Giovanni Leon, Norman Sadeh, Florian Schaub, Manya Sleeper, Yang Wang, and Shomir Wilson. 2017. Nudges for Privacy and Security: Understanding and Assisting Users’ Choices Online. ACM Comput. Surv. 50, 3 (8 2017). https://doi.org/10.1145/3054926",
      "doi": ""
    },
    {
      "text": "Alessandro Acquisti and Ralph Gross. 2006. Imagined communities: Awareness, information sharing, and privacy on the Facebook. In Privacy enhancing technologies. Springer, 36–58.",
      "doi": ""
    },
    {
      "text": "Mary Jean Amon, Rakibul Hasan, Kurt Hugenberg, Bennett I Bertenthal, and Apu Kapadia. 2020. Influencing Photo Sharing Decisions on Social Media: A Case of Paradoxical Findings. In the Proceedings of the IEEE Symposium on Security & Privacy (SP ’20). IEEE Computer Society. https://doi.org/10.1109/SP.2020.00006",
      "doi": ""
    },
    {
      "text": "Denise Anthony, Celeste Campos-Castillo, and Christine Horne. 2017. Toward a Sociology of Privacy. Annual Review of Sociology 43, 1 (2017), 249–269. https://doi.org/10.1146/annurev-soc-060116-053643",
      "doi": ""
    },
    {
      "text": "Paritosh Bahirat, Yangyang He, Abhilash Menon, and Bart Knijnenburg. 2018. A Data-Driven Approach to Developing IoT Privacy-Setting Interfaces. In 23rd International Conference on Intelligent User Interfaces(IUI ’18). Association for Computing Machinery, New York, NY, USA, 165–176. https://doi.org/10.1145/3172944.3172982",
      "doi": ""
    },
    {
      "text": "BBC. 2016. ’Can’t hide it forever’: The model who became a meme. http://www.bbc.com/news/world-asia-34568674",
      "doi": ""
    },
    {
      "text": "Andrew Besmer and Heather Richter Lipford. 2010. Moving Beyond Untagging: Photo Privacy in a Tagged World. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’10). ACM, New York, NY, USA, 1563–1572. https://doi.org/10.1145/1753326.1753560",
      "doi": ""
    },
    {
      "text": "Roberta Biolcati and Stefano Passini. 2018. Narcissism and self-esteem: Different motivations for selfie posting behaviors. Cogent Psychology 5, 1 (2018). https://doi.org/10.1080/23311908.2018.1437012",
      "doi": ""
    },
    {
      "text": "danah boyd. 2008. Taken out of context: American teen sociality in networked publics. Ph.D. Dissertation. University of California, Berkeley.",
      "doi": ""
    },
    {
      "text": "danah boyd. 2014. It’s complicated: The social lives of networked teens. Yale University Press.",
      "doi": ""
    },
    {
      "text": "James P Byrnes, David C Miller, and William D Schafer. 1999. Gender differences in risk taking: a meta-analysis.Psychological bulletin 125, 3 (1999), 367.",
      "doi": ""
    },
    {
      "text": "Christopher J Carpenter. 2012. Narcissism on Facebook: Self-promotional and anti-social behavior. Personality and Individual Differences 52, 4 (2012), 482–486. https://doi.org/10.1016/j.paid.2011.11.011",
      "doi": ""
    },
    {
      "text": "Gary Charness and Uri Gneezy. 2012. Strong Evidence for Gender Differences in Risk Taking. Journal of Economic Behavior & Organization 83, 1(2012), 50–58. https://doi.org/10.1016/j.jebo.2011.06.007",
      "doi": ""
    },
    {
      "text": "Hyerim Cho, Josh Smith, and Jin Ha Lee. 2019. Effects of motivation and tool features on online photo-sharing behavior. Proceedings of the Association for Information Science and Technology 56, 1 (2019), 377–380. https://doi.org/10.1002/pra2.59",
      "doi": ""
    },
    {
      "text": "Jacob Cohen. 1988. Statistical power analysis for the social sciences. (1988).",
      "doi": ""
    },
    {
      "text": "Koen A Dijkstra, Joop van der Pligt, Gerben A van Kleef, and José H Kerstholt. 2012. Deliberation versus intuition: Global versus local processing in judgment and choice. Journal of Experimental Social Psychology 48, 5 (2012), 1156–1161. https://doi.org/10.1016/j.jesp.2012.05.001",
      "doi": ""
    },
    {
      "text": "Amanda du Preez and Elanie Lombard. 2014. The role of memes in the construction of Facebook personae. Communicatio 40, 3 (2014), 253–270. https://doi.org/10.1080/02500167.2014.938671",
      "doi": ""
    },
    {
      "text": "Maeve Duggan. 2013. Photo and video sharing grow online. (2013).",
      "doi": ""
    },
    {
      "text": "Thomas Rhys Evans and Gail Steptoe-Warren. 2018. Humor Style Clusters: Exploring Managerial Humor. International Journal of Business Communication 55, 4(2018), 443–454. https://doi.org/10.1177/2329488415612478",
      "doi": ""
    },
    {
      "text": "Facebook. [n.d.]. Photos Privacy. https://www.facebook.com/help/privacy/photos",
      "doi": ""
    },
    {
      "text": "Rossella Falanga, Maria Elvira De Caroli, and Elisabetta Sagone. 2014. Humor Styles, Self-efficacy and Prosocial Tendencies in Middle Adolescents. Procedia - Social and Behavioral Sciences 127 (2014), 214–218. https://doi.org/10.1016/j.sbspro.2014.03.243",
      "doi": ""
    },
    {
      "text": "Ronald S Friedman, Ayelet Fishbach, Jens Förster, and Lioba Werth. 2003. Attentional Priming Effects on Creativity. Creativity Research Journal 15, 2-3 (2003), 277–286. https://doi.org/10.1080/10400419.2003.9651420",
      "doi": ""
    },
    {
      "text": "Graeme Galloway. 2010. Individual differences in personal humor styles: Identification of prominent patterns and their associates. Personality and Individual Differences 48, 5 (2010), 563–567. https://doi.org/10.1016/j.paid.2009.12.007",
      "doi": ""
    },
    {
      "text": "Vaibhav Garg, Kevin Benton, and L. Jean Camp. 2014. The Privacy Paradox: A Facebook Case Study. In Proceedings of the 42nd Research Conference on Communication, Information and Internet Policy. https://doi.org/10.2139/ssrn.2411672",
      "doi": ""
    },
    {
      "text": "Robert Gove. 2015. Using the elbow method to determine the optimal number of clusters for k-means clustering. URL: https://bl. ocks. org/rpgove/0060ff3b656618e9136b 17(2015), 19.",
      "doi": ""
    },
    {
      "text": "Isobel Asher Hamilton. 2019. Instagram has avoided Facebook’s trust problem, beating its parent as app of choice for Generation Z. https://www.businessinsider.com/instagram-is-more-popular-among-generation-z-than-facebook-2019-3",
      "doi": ""
    },
    {
      "text": "William P Hampes. 2010. The Relation Between Humor Styles and Empathy. Europe’s Journal of Psychology 6, 3 (2010), 34–45. https://doi.org/10.5964/ejop.v6i3.207",
      "doi": ""
    },
    {
      "text": "Rakibul Hasan, David Crandall, and Mario Fritz Apu Kapadia. 2020. Automatically Detecting Bystanders in Photos to Reduce Privacy Risks. In 2020 IEEE Symposium on Security and Privacy (SP). IEEE Computer Society, Los Alamitos, CA, USA.",
      "doi": ""
    },
    {
      "text": "Rakibul Hasan, Eman Hassan, Yifang Li, Kelly Caine, David J Crandall, Roberto Hoyle, and Apu Kapadia. 2018. Viewer Experience of Obscuring Scene Elements in Photos to Enhance Privacy. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 47:1–47:13. https://doi.org/10.1145/3173574.3173621",
      "doi": ""
    },
    {
      "text": "Rakibul Hasan, Yifang Li, Eman Hassan, Kelly Caine, David J. Crandall, Roberto Hoyle, and Apu Kapadia. 2019. Can privacy be satisfying? On improving viewer satisfaction for privacy-enhanced photos using aesthetic transforms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, Vol. 14. ACM, 25. https://doi.org/10.1145/3290605.3300597",
      "doi": ""
    },
    {
      "text": "E T Hassan, R Hasan, P Shaffer, D Crandall, and A Kapadia. 2017. Cartooning for Enhanced Privacy in Lifelogging and Streaming Videos. In 2017 IEEE Conference on Computer Vision and Pattern Recognition Workshops (CVPRW). 1333–1342. https://doi.org/10.1109/CVPRW.2017.175",
      "doi": ""
    },
    {
      "text": "Jennifer Hofmann, Tracey Platt, Chloé Lau, and Jorge Torres-Marín. 2020. Gender differences in humor-related traits, humor appreciation, production, comprehension, (neural) responses, use, and correlates: A systematic review. Current Psychology (2020). https://doi.org/10.1007/s12144-020-00724-1",
      "doi": ""
    },
    {
      "text": "Mariea Grubbs Hoy and George Milne. 2010. Gender Differences in Privacy-Related Measures for Young Adult Facebook Users. Journal of Interactive Advertising 10, 2 (2010), 28–45. https://doi.org/10.1080/15252019.2010.10722168",
      "doi": ""
    },
    {
      "text": "Roberto Hoyle, Robert Templeman, Steven Armes, Denise Anthony, David Crandall, and Apu Kapadia. 2014. Privacy Behaviors of Lifeloggers Using Wearable Cameras. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’14). ACM, New York, NY, USA, 571–582. https://doi.org/10.1145/2632048.2632079",
      "doi": ""
    },
    {
      "text": "Daniel Hunt and Eric Langstedt. 2014. The Influence of Personality Factors and Motives on Photographic Communication. The Journal of Social Media in Society 3, 2 (2014). https://www.thejsms.org/tsmri/index.php/TSMRI/article/view/68",
      "doi": ""
    },
    {
      "text": "Daniel S Hunt, Carolyn A Lin, and David J Atkin. 2014. Communicating Social Relationships via the Use of Photo-Messaging. Journal of Broadcasting & Electronic Media 58, 2 (2014), 234–252. https://doi.org/10.1080/08838151.2014.906430",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy Attitudes of Mechanical Turk Workers and the U.S. Public. In 10th Symposium On Usable Privacy and Security (SOUPS 2014). USENIX Association, Menlo Park, CA, 37–49. https://www.usenix.org/conference/soups2014/proceedings/presentation/kang",
      "doi": ""
    },
    {
      "text": "Peter Klemperer, Yuan Liang, Michelle Mazurek, Manya Sleeper, Blase Ur, Lujo Bauer, Lorrie Faith Cranor, Nitin Gupta, and Michael Reiter. 2012. Tag, You Can See It! Using Tags for Access Control in Photo Sharing. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). Association for Computing Machinery, New York, NY, USA, 377–386. https://doi.org/10.1145/2207676.2207728",
      "doi": ""
    },
    {
      "text": "Bart P Knijnenburg. 2013. Simplifying Privacy Decisions: Towards Interactive and Adaptive Solutions.. In Decisions@ RecSys. 40–41.",
      "doi": ""
    },
    {
      "text": "Daniel Lakens. 2013. Calculating and reporting effect sizes to facilitate cumulative science: a practical primer for t-tests and ANOVAs. Frontiers in Psychology 4 (2013), 863. https://doi.org/10.3389/fpsyg.2013.00863",
      "doi": ""
    },
    {
      "text": "Anja K. Leist and Daniela Müller. 2013. Humor Types Show Different Patterns of Self-Regulation, Self-Esteem, and Well-Being. Journal of Happiness Studies 14, 2 (2013), 551–569. https://doi.org/10.1007/s10902-012-9342-6",
      "doi": ""
    },
    {
      "text": "Amanda Lenhart, Kristen Purcell, Aaron Smith, and Kathryn Zickuhr. 2010. Social Media & Mobile Internet Use among Teens and Young Adults. Pew internet & American life project(2010).",
      "doi": ""
    },
    {
      "text": "Bin Liu, Mads Schaarup Andersen, Florian Schaub, Hazim Almuhimedi, Shikun (Aerin) Zhang, Norman Sadeh, Yuvraj Agarwal, and Alessandro Acquisti. 2016. Follow My Recommendations: A Personalized Privacy Assistant for Mobile App Permissions. In Twelfth Symposium on Usable Privacy and Security (SOUPS 2016). USENIX Association, Denver, CO, 27–41. https://www.usenix.org/conference/soups2016/technical-sessions/presentation/liu",
      "doi": ""
    },
    {
      "text": "Di Liu, Randolph G Bias, Matthew Lease, and Rebecca Kuipers. 2012. Crowdsourcing for usability testing. Proceedings of the American Society for Information Science and Technology 49, 1 (2012), 1–10. https://doi.org/10.1002/meet.14504901100",
      "doi": ""
    },
    {
      "text": "Natasha Lomas. 2017. Teens favoring Snapchat and Instagram over Facebook -says e-marketer.",
      "doi": ""
    },
    {
      "text": "Rod A Martin, Jessica M Lastuk, Jennifer Jeffery, Philip A Vernon, and Livia Veselka. 2012. Relationships between the Dark Triad and humor styles: A replication and extension. Personality and Individual Differences 52, 2 (2012), 178–182. https://doi.org/10.1016/j.paid.2011.10.010",
      "doi": ""
    },
    {
      "text": "Rod A Martin, Patricia Puhlik-Doris, Gwen Larsen, Jeanette Gray, and Kelly Weir. 2003. Individual differences in uses of humor and their relation to psychological well-being: Development of the Humor Styles Questionnaire. Journal of Research in Personality 37, 1 (2003), 48–75. https://doi.org/10.1016/S0092-6566(02)00534-2",
      "doi": ""
    },
    {
      "text": "Michael P McCreery and S Kathleen Krach. 2018. How the human is the catalyst: Personality, aggressive fantasy, and proactive-reactive aggression among users of social media. Personality and Individual Differences 133 (2018), 91–95. https://doi.org/10.1016/j.paid.2017.06.037",
      "doi": ""
    },
    {
      "text": "Thelwall Mike and Vis Farida. 2017. Gender and image sharing on Facebook, Twitter, Instagram, Snapchat and WhatsApp in the UK: Hobbying alone or filtering for friends?Aslib Journal of Information Management 69, 6 (1 2017), 702–720. https://doi.org/10.1108/AJIM-04-2017-0098",
      "doi": ""
    },
    {
      "text": "Ian Miller and Gerald Cupchik. 2014. Meme creation and sharing processes: individuals shaping the masses. (2014). arXiv:1406.7579",
      "doi": ""
    },
    {
      "text": "Anca M Miron and Jack W Brehm. 2006. Reactance theory-40 years later. Zeitschrift für Sozialpsychologie 37, 1 (2006), 9–18.",
      "doi": ""
    },
    {
      "text": "G Misra and J M Such. 2017. PACMAN: Personal Agent for Access Control in Social Media. IEEE Internet Computing 21, 6 (2017), 18–26.",
      "doi": ""
    },
    {
      "text": "Kelly Moore and James C McElroy. 2012. The influence of personality on Facebook usage, wall postings, and regret. Computers in Human Behavior 28, 1 (2012), 267–274. https://doi.org/10.1016/j.chb.2011.09.009",
      "doi": ""
    },
    {
      "text": "Carol Moser. 2020. Impulse Buying: Designing for Self-Control with E-commerce. Ph.D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2009. Privacy in context: Technology, policy, and the integrity of social life. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Anne Oeldorf-Hirsch and S Shyam Sundar. 2016. Social and Technological Motivations for Online Photo Sharing. Journal of Broadcasting and Electronic Media 60, 4 (2016), 624–642. https://doi.org/10.1080/08838151.2016.1234478",
      "doi": ""
    },
    {
      "text": "Eileen Y L Ong, Rebecca P Ang, Jim C M Ho, Joylynn C Y Lim, Dion H Goh, Chei Sian Lee, and Alton Y K Chua. 2011. Narcissism, extraversion and adolescents’ self-presentation on Facebook. Personality and Individual Differences 50, 2 (2011), 180–185. https://doi.org/10.1016/j.paid.2010.09.022",
      "doi": ""
    },
    {
      "text": "F Pedregosa, G Varoquaux, A Gramfort, V Michel, B Thirion, O Grisel, M Blondel, P Prettenhofer, R Weiss, V Dubourg, J Vanderplas, A Passos, D Cournapeau, M Brucher, M Perrot, and E Duchesnay. 2011. Scikit-learn: Machine Learning in Python. Journal of Machine Learning Research 12 (2011), 2825–2830.",
      "doi": ""
    },
    {
      "text": "Yu Pu and Jens Grossklags. 2015. Using conjoint analysis to investigate the value of interdependent privacy in social app adoption scenarios. Proceedings of the International Conference on Information Systems (ICIS 2015) (2015).",
      "doi": ""
    },
    {
      "text": "Abdul Qodir, Ahmad Muhammad Diponegoro, and Triantoro Safaria. 2019. Cyberbullying, happiness, and style of humor among perpetrators: is there a relationship?Humanities & Social Sciences Reviews 7, 3 (2019), 200–206.",
      "doi": ""
    },
    {
      "text": "Yasmeen Rashidi, Tousif Ahmed, Felicia Patel, Emily Fath, Apu Kapadia, Christena Nippert-Eng, and Norman Makoto Su. 2018. ”You don’t want to be the next meme”: College Students’ Workarounds to Manage Privacy in the Era of Pervasive Photography. In Fourteenth Symposium on Usable Privacy and Security (SOUPS 2018). USENIX Association, Baltimore, MD, 143–157. https://www.usenix.org/conference/soups2018/presentation/rashidi",
      "doi": ""
    },
    {
      "text": "Yasmeen Rashidi, Apu Kapadia, Christena Nippert-Eng, and Norman Makoto Su. 2020. “It’s easier than causing confrontation”: Sanctioning Strategies to Maintain Social Norms of Content Sharing and Privacy on Social Media. Proceedings of the ACM Journal: Human-Computer Interaction: Computer Supported Cooperative Work and Social Computing (PACM/CSCW ’20) 4, CSCW1 (May 2020), 23:1–23:25. https://doi.org/10.1145/3392827",
      "doi": ""
    },
    {
      "text": "E M Redmiles, S Kross, and M L Mazurek. 2019. How Well Do My Results Generalize? Comparing Security and Privacy Survey Results from MTurk, Web, and Telephone Samples. In 2019 IEEE Symposium on Security and Privacy (SP), Vol. 00. 227–244. https://doi.org/10.1109/SP.2019.00014",
      "doi": ""
    },
    {
      "text": "Carlos Salavera, Pablo Usán, and Laurane Jarie. 2020. Styles of humor and social skills in students. Gender differences. Current Psychology 39, 2 (2020), 571–580. https://doi.org/10.1007/s12144-017-9770-x",
      "doi": ""
    },
    {
      "text": "Kim Bartel Sheehan. 1999. An investigation of gender differences in on-line privacy concerns and resultant behaviors. Journal of Interactive Marketing 13, 4 (1999), 24–38. https://doi.org/10.1002/(SICI)1520-6653(199923)13:4<24::AID-DIR3>3.0.CO;2-O",
      "doi": ""
    },
    {
      "text": "Kim Bartel Sheehan. 2002. Toward a Typology of Internet Users and Online Privacy Concerns. The Information Society 18, 1 (2002), 21–32. https://doi.org/10.1080/01972240252818207",
      "doi": ""
    },
    {
      "text": "Kit Smith. 2019. 53 Incredible Facebook Statistics and Facts. https://www.brandwatch.com/blog/facebook-statistics/",
      "doi": ""
    },
    {
      "text": "Anna Cinzia Squicciarini, Mohamed Shehab, and Federica Paci. 2009. Collective Privacy Management in Social Networks. In Proceedings of the 18th International Conference on World Wide Web(WWW ’09). Association for Computing Machinery, New York, NY, USA, 521–530. https://doi.org/10.1145/1526709.1526780",
      "doi": ""
    },
    {
      "text": "J M Such and N Criado. 2016. Resolving Multi-Party Privacy Conflicts in Social Media. IEEE Transactions on Knowledge and Data Engineering 28, 7(2016), 1851–1863.",
      "doi": ""
    },
    {
      "text": "Jose M Such, Joel Porter, Sören Preibusch, and Adam Joinson. 2017. Photo Privacy Conflicts in Social Media: A Large-scale Empirical Study. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 3821–3832. https://doi.org/10.1145/3025453.3025668",
      "doi": ""
    },
    {
      "text": "Yongjun Sung, Jung-Ah Lee, Eunice Kim, and Sejung Marina Choi. 2016. Why we post selfies: Understanding motivations for posting pictures of oneself. Personality and Individual Differences 97 (2016), 260–265. https://doi.org/10.1016/j.paid.2016.03.032",
      "doi": ""
    },
    {
      "text": "Sigal Tifferet. 2019. Gender differences in privacy tendencies on social network sites: A meta-analysis. Computers in Human Behavior 93 (2019), 1–12. https://doi.org/10.1016/j.chb.2018.11.046",
      "doi": ""
    },
    {
      "text": "Stephanie Trudeau, Sara Sinclair, and Sean W Smith. 2009. The Effects of Introspection on Creating Privacy Policy. In Proceedings of the 8th ACM Workshop on Privacy in the Electronic Society(WPES ’09). ACM, New York, NY, USA, 1–10. https://doi.org/10.1145/1655188.1655190",
      "doi": ""
    },
    {
      "text": "Livia Veselka, Julie Aitken Schermer, Rod A Martin, and Philip A Vernon. 2010. Relations between humor styles and the Dark Triad traits of personality. Personality and Individual Differences 48, 6 (2010), 772–774. https://doi.org/10.1016/j.paid.2010.01.017",
      "doi": ""
    },
    {
      "text": "Melanie Volkamer, Karen Renaud, Benjamin Reinheimer, and Alexandra Kunz. 2017. User experiences of TORPEDO: TOoltip-poweRed Phishing Email DetectiOn. Computers & Security 71 (2017), 100–113. https://doi.org/10.1016/j.cose.2017.02.004",
      "doi": ""
    },
    {
      "text": "Eric B. Weiser. 2015. #Me: Narcissism and its facets as predictors of selfie-posting frequency. Personality and Individual Differences 86 (2015), 477–481. https://doi.org/10.1016/j.paid.2015.07.007",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2020. List of memory biases. https://en.wikipedia.org/wiki/List_of_memory_biases",
      "doi": ""
    },
    {
      "text": "Pamela J Wisniewski, Bart P Knijnenburg, and Heather Richter Lipford. 2017. Making privacy personal: Profiling social network users to inform privacy education and nudging. International Journal of Human-Computer Studies 98 (2017), 95–108. https://doi.org/10.1016/j.ijhcs.2016.09.006",
      "doi": ""
    },
    {
      "text": "Jeremy A Yip and Rod A Martin. 2006. Sense of humor, emotional intelligence, and social competence. Journal of Research in Personality 40, 6 (2006), 1202–1208. https://doi.org/10.1016/j.jrp.2005.08.005",
      "doi": ""
    },
    {
      "text": "Virgil Zeigler-Hill and Avi Besser. 2011. Humor style mediates the association between pathological narcissism and self-esteem. Personality and Individual Differences 50, 8 (2011), 1196–1201. https://doi.org/10.1016/j.paid.2011.02.006",
      "doi": ""
    },
    {
      "text": "Eva-Maria Zeissig, Chantal Lidynia, Luisa Vervier, Andera Gadeib, and Martina Ziefle. 2017. Online Privacy Perceptions of Older Adults. In Human Aspects of IT for the Aged Population. Applications, Services and Contexts, Jia Zhou and Gavriel Salvendy (Eds.). Springer International Publishing, Cham, 181–200.",
      "doi": ""
    },
    {
      "text": "Tomasz Zukowski and Irwin Brown. 2007. Examining the Influence of Demographic Factors on Internet Users’ Information Privacy Concerns. In Proceedings of the 2007 Annual Research Conference of the South African Institute of Computer Scientists and Information Technologists on IT Research in Developing Countries(SAICSIT ’07). Association for Computing Machinery, New York, NY, USA, 197–204. https://doi.org/10.1145/1292491.1292514",
      "doi": ""
    }
  ]
}