{
  "doi": "10.1145/3411764.3445310",
  "title": "Tele-Immersive Improv: Effects of Immersive Visualisations on Rehearsing and Performing Theatre Online",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Performers acutely need but lack tools to remotely rehearse and create live theatre, particularly due to global restrictions on social interactions during the Covid-19 pandemic. No studies, however, have heretofore examined how remote video-collaboration affects performance. This paper presents the findings of a field study with 16 domain experts over six weeks investigating how tele-immersion affects the rehearsal and performance of improvisational theatre. To conduct the study, an original media server was developed for co-locating remote performers into shared virtual 3D environments which were accessed through popular video conferencing software. The results of this qualitative study indicate that tele-immersive environments uniquely provide performers with a strong sense of co- presence, feelings of physical connection, and an increased ability to enter the social-flow states required for improvisational theatre. Based on our observations, we put forward design recommendations for video collaboration tools tailored to the unique demands of live performance.",
  "tags": [
    "creativity",
    "immersive communication",
    "improvisation",
    "mixed reality",
    "tele-presence",
    "presence",
    "tele-immersion"
  ],
  "authors": [
    {
      "name": "Boyd Branch",
      "institution": "Engineering and Digital Arts University of Kent, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702152",
      "orcid": "missing"
    },
    {
      "name": "Christos Efstratiou",
      "institution": "School of Computing University of Kent, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100255587",
      "orcid": "missing"
    },
    {
      "name": "Piotr Mirowski",
      "institution": "Improbotics, London, United Kingdom",
      "img": "/do/10.1145/contrib-81442600763/rel-imgonly/piotrmirowski_robot_01.jpg",
      "acmid": "81442600763",
      "orcid": "0000-0002-8685-0932"
    },
    {
      "name": "Kory W. Mathewson",
      "institution": "Improbotics, Montréal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659439841",
      "orcid": "0000-0002-5688-6221"
    },
    {
      "name": "Paul Allain",
      "institution": "Drama and Theatre University of Kent, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701420",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Paul Allain. 2019. Physical actor training 2.0: new digital horizons. Theatre, Dance and Performance Training 10, 2 (2019), 169–186. https://doi.org/10.1080/19443927.2019.1609074",
      "doi": ""
    },
    {
      "text": "Aruna D. Balakrishnan, Susan R. Fussell, and Sara Kiesler. 2008. Do Visualizations Improve Synchronous Remote Collaboration?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Florence, Italy) (CHI ’08). Association for Computing Machinery, New York, NY, USA, 1227–1236. https://doi.org/10.1145/1357054.1357246",
      "doi": "10.1145/1357054.1357246"
    },
    {
      "text": "A. Bruce, J. Knight, S. Listopad, B. Magerko, and I. R. Nourbakhsh. 2000. Robot improv: using drama to create believable agents. In Proceedings 2000 ICRA, Vol. 4. IEEE, n.a., 4002–4008 vol.4. https://doi.org/10.1109/ROBOT.2000.845355",
      "doi": ""
    },
    {
      "text": "Improv Resource Center. 2017. Montag - IRC Improv Wiki. https://wiki.improvresourcecenter.com/index.php?title=Montage",
      "doi": ""
    },
    {
      "text": "Mihaly Csikszentmihalyi and Mihaly Csikzentmihaly. 1990. Flow: The psychology of optimal experience. Vol. 1990. Harper & Row New York, n.a.",
      "doi": ""
    },
    {
      "text": "Kevin Michael Curry. 1999. Supporting collaborative awareness in tele-immersion. Ph.D. Dissertation. Virginia Tech.",
      "doi": ""
    },
    {
      "text": "Zbigniew Cynkutis, Tyabji Khalid translator, and Paul Allain editor.2014. Acting with Grotowski theatre as a field for experiencing life. https://ebookcentral.proquest.com/lib/kentuk/detail.action?docID=1813124 Link to E-book",
      "doi": ""
    },
    {
      "text": "Steve Dixon and Barry Smith. 2007. Digital performance: a history of new media in theater, dance, performance art, and installation. MIT press, 1 Rogers St Cambridge MA 02142.",
      "doi": ""
    },
    {
      "text": "Louise Emma Douse. 2013. Moving experience: an investigation of embodied knowledge and technology for reading flow in improvisation. Ph.D. Dissertation. University of Bedfordshire.",
      "doi": ""
    },
    {
      "text": "Rae Earnshaw, Richard Guedj, Andries van Dam, and John Vince (Eds.). 2001. Guidelines For Telepresence and Shared Virtual Environments. Springer-Verlag London Ltd., London, 52–64.",
      "doi": ""
    },
    {
      "text": "Arts Council England. 2018. Live-to-Digital in the Arts. Technical Report. Arts Council England. https://www.artscouncil.org.uk/publication/live-digital-arts-report",
      "doi": ""
    },
    {
      "text": "Anthony Frost and Ralph Yarrow. 2015. Improvisation in drama, theatre and performance: History, practice, theory. Macmillan International Higher Education, Level 1 15-19 Claremont Street South Yarra Victoria 3141.",
      "doi": ""
    },
    {
      "text": "Woodrow Barfield Thomas A Furness. 1995. Virtual environments and advanced interface design. Oxford University Press on Demand, Elt Division, Uk And Ireland Sales, Great Clarendon Street, Oxford OX2 6DP.",
      "doi": ""
    },
    {
      "text": "S. Glasenhardt, M. Cicin-Sain, and Z. Capko. 2003. Tele-immersion as a positive alternative of the future. In Proceedings of the 25th International Conference on Information Technology Interfaces, 2003. ITI 2003.ITTI, n.a., 243–248.",
      "doi": ""
    },
    {
      "text": "Barney G Glaser and Anselm L Strauss. 2017. Discovery of grounded theory: Strategies for qualitative research. Routledge, n.a.",
      "doi": ""
    },
    {
      "text": "Tom Gorman, Tiina Syrja, and Mikko Kanninen. 2019/10. Immersive Telepresence: A framework for training and rehearsal in a postdigital age. In n.a.European Association of Distance Teaching Universities (EADTU), n.a., 237–252. https://pureportal.coventry.ac.uk/en/publications/immersive-telepresence-a-framework-for-training-and-rehearsal-in-",
      "doi": ""
    },
    {
      "text": "John Gruzelier, Atsuko Inoue, Roger Smart, Anthony Steed, and Tony Steffert. 2010. Acting performance and flow state enhanced with sensory-motor rhythm neurofeedback comparing ecologically valid immersive VR and training screen scenarios. Neuroscience letters 480, 2 (2010), 112–116.",
      "doi": ""
    },
    {
      "text": "Tilo Hartmann and Jesse Fox. 2020. Entertainment in Virtual Reality and Beyond: The Influence of Embodiment, Co-Location, and Cognitive Distancing on Users’ Entertainment Experience. In The Oxford Handbook of Entertainment Theory. Oxford, UK: Oxford University Press, n.a.",
      "doi": ""
    },
    {
      "text": "Carrie Heeter. 1992. Being there: The subjective experience of presence. Presence: Teleoperators & Virtual Environments 1, 2(1992), 262–271.",
      "doi": "10.5555/2870763.2870771"
    },
    {
      "text": "Ilona Heldal, David Roberts, Lars Bråthe, and Robin Wolff. 2007. Presence, creativity and collaborative work in virtual environments. In International Conference on Human-Computer Interaction. Springer, 802–811.",
      "doi": ""
    },
    {
      "text": "Ilona Heldal, David Roberts, Lars Brathe, and Robin Wolff. 2007. Presence, creativity and collaborative work in virtual environments. In International Conference on Human-Computer Interaction. Springer, 802–811.",
      "doi": ""
    },
    {
      "text": "Susan A. Jackson and Robert C. Eklund. 2002. Assessing Flow in Physical Activity: The Flow State Scale–2 and Dispositional Flow Scale–2. Journal of Sport and Exercise Psychology 24, 2 (2002), 133–150. https://doi.org/10.1123/jsep.24.2.133doi: 10.1123/jsep.24.2.133; 07.",
      "doi": ""
    },
    {
      "text": "Philip N Johnson-Laird. 2002. How jazz musicians improvise. Music Perception 19, 3 (2002).",
      "doi": ""
    },
    {
      "text": "Keith Johnstone. 2012. Impro: Improvisation and the theatre. Routledge.",
      "doi": ""
    },
    {
      "text": "Peter Kauff and Oliver Schreer. 2002. An immersive 3D video-conferencing system using shared virtual team user environments. In Proceedings of the 4th international conference on Collaborative virtual environments. 105–112.",
      "doi": "10.1145/571878.571895"
    },
    {
      "text": "Jason R Keeler, Edward A Roth, Brittany L Neuser, John M Spitsbergen, Daniel James Maxwell Waters, John-Mary Vianney, 2015. The neurochemistry and social flow of singing: bonding and oxytocin. Frontiers in human neuroscience 9 (2015), 518.",
      "doi": ""
    },
    {
      "text": "Iryna Kuksa and Mark Childs. 2014. Making Sense of Space: The design and experience of virtual spaces as a tool for communication. Elsevier.",
      "doi": ""
    },
    {
      "text": "Gregorij Kurillo, Ramanarayan Vasudevan, Edgar Lobaton, and Ruzena Bajcsy. 2008. A framework for collaborative real-time 3D teleimmersion in a geographically distributed environment. In 2008 Tenth IEEE International Symposium on Multimedia. IEEE, 111–118.",
      "doi": "10.1109/ISM.2008.32"
    },
    {
      "text": "Jason Leigh, Thomas A DeFanti, A Johnson, Maxine Brown, and D Sandin. 1997. Global tele-immersion: Better than being there. In Proceedings of ICAT, Vol. 97. 3–5.",
      "doi": ""
    },
    {
      "text": "Helen Lewis. 2020. When Will We Want to Be in a Room Full of Strangers Again?https://global.factiva.com/en/du/article.asp?accessionno=ATLCOM0020200513eg5c0000b",
      "doi": ""
    },
    {
      "text": "Charles J Limb and Allen R Braun. 2008. Neural substrates of spontaneous musical performance: An fMRI study of jazz improvisation. PLoS one 3, 2 (2008), e1679.",
      "doi": ""
    },
    {
      "text": "Brian Magerko, Waleed Manzoul, Mark Riedl, Allan Baumer, Daniel Fuller, Kurt Luther, and Celia Pearce. 2009. An empirical study of cognition and theatrical improvisation. In ACM Creat. & Cog.",
      "doi": ""
    },
    {
      "text": "Kory W Mathewson. 2019. Humour-in-the-loop: Improvised Theatre with Interactive Machine Learning Systems. Ph.D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Steven Melendez and Steven Melendez. 2020. For artists, the show must go on—and Zoom is their venue. https://www.fastcompany.com/90478442/for-artists-the-show-must-go-on-and-zoom-is-their-venue",
      "doi": ""
    },
    {
      "text": "Marvin Minsky. 1980. Telepresence. (1980).",
      "doi": ""
    },
    {
      "text": "Besty Morris. 2020. Why does Zoom exhaust you? Science has an answer. The Wall Street Journal 27 (2020).",
      "doi": ""
    },
    {
      "text": "Cabinet Office. [n.d.]. Staying alert and safe (social distancing). https://www.gov.uk/government/publications/staying-alert-and-safe-social-distancing/staying-alert-and-safe-social-distancing-after-4-july",
      "doi": ""
    },
    {
      "text": "Marcus Painter and Tian Qiu. 2020. Political beliefs affect compliance with covid-19 social distancing orders. Available at SSRN 3569098(2020).",
      "doi": ""
    },
    {
      "text": "Kyoung S. Park, Yong J. Cho, Naveen K. Krishnaprasad, Chris Scharver, Michael J. Lewis, Jason Leigh, and Andrew E. Johnson. 2000. CAVERNsoft G2: A Toolkit for High Performance Tele-Immersive Collaboration. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology (Seoul, Korea) (VRST ’00). Association for Computing Machinery, New York, NY, USA, 8–15. https://doi.org/10.1145/502390.502394",
      "doi": "10.1145/502390.502394"
    },
    {
      "text": "Jeff Pressing. 1984. Cognitive processes in improvisation. In Advances in Psychology. Vol. 19. Elsevier, 345–363.",
      "doi": ""
    },
    {
      "text": "Susanna Rae. 2020. Microsoft-Video fatigue and a late-night host with no audience inspire a new way to help people feel together, remotely.",
      "doi": ""
    },
    {
      "text": "Brent Karpf Reidy, Becky Schutt, Deborah Abramson, and Antoni Durski. 2016. From Live-to-Digital: Understanding the Impact of Digital Developments in Theatre on Audiences, Production and Distribution. Arts Council England 11(2016).",
      "doi": ""
    },
    {
      "text": "Suprateek Sarker, Francis Lau, and Sundeep Sahay. 2000. Using an adapted grounded theory approach for inductive theory building about virtual team development. ACM SIGMIS Database: the DATABASE for Advances in Information Systems 32, 1(2000), 38–56.",
      "doi": "10.1145/506740.506745"
    },
    {
      "text": "Eberhard Scheiffele. 2001. Acting: An altered state of consciousness. Research in Drama Education: The Journal of Applied Theatre and Performance 6, 2(2001), 179–191. https://doi.org/10.1080/13569780120070722doi: 10.1080/13569780120070722.",
      "doi": ""
    },
    {
      "text": "Albert Sidelnik, I-Jui Sung, Wanmin Wu, María Jesús Garzarán, Wen-mei Hwu, Klara Nahrstedt, David Padua, and Sanjay J. Patel. 2009. Optimization of Tele-Immersion Codes. In Proceedings of 2nd Workshop on General Purpose Processing on Graphics Processing Units (Washington, D.C., USA) (GPGPU-2). Association for Computing Machinery, New York, NY, USA, 85–93. https://doi.org/10.1145/1513895.1513906",
      "doi": "10.1145/1513895.1513906"
    },
    {
      "text": "Ravinder Singh and Soumya Awasthi. 2020. Updated Comparative Analysis on Video Conferencing Platforms-Zoom, Google Meet, Microsoft Teams, WebEx Teams and GoToMeetings. Technical Report. EasyChair.",
      "doi": ""
    },
    {
      "text": "Alexis Soloski. 2020. In These Immersive Shows, the Jury Is In (Your Home). https://www.nytimes.com/2020/08/07/theater/immersive-shows-jury-duty-eschaton.html",
      "doi": ""
    },
    {
      "text": "Viola Spolin. 1963. Improvisation for the theater; a handbook of teaching and directing techniques. Evanston, Ill. Northwestern University Press, Evanston, Ill.Includes bibliography.; ID: 01ASU_ALMA21940758080003841.",
      "doi": ""
    },
    {
      "text": "Paul Tanner and Varnali Shah. 2010. Improving Remote Collaboration through Side-by-Side Telepresence. In CHI ’10 Extended Abstracts on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI EA ’10). Association for Computing Machinery, New York, NY, USA, 3493–3498. https://doi.org/10.1145/1753846.1754007",
      "doi": ""
    },
    {
      "text": "Theophilus Teo, Louise Lawrence, Gun A. Lee, Mark Billinghurst, and Matt Adcock. 2019. Mixed Reality Remote Collaboration Combining 360 Video and 3D Reconstruction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300431",
      "doi": "10.1145/3290605.3300431"
    },
    {
      "text": "Coventry University. 2020. IMMERSIVE TELEPRESENCE IN THEATRE. https://telepresenceintheatre.coventry.domains/uncategorized/useful-links/ Accessed: 2020-09-09.",
      "doi": ""
    },
    {
      "text": "Caroline Wake. 2018. Two decades of digital pedagogies in the performing arts: a comparative survey of theatre, performance, and dance. International Journal of Performance Arts and Digital Media 14, 1(2018), 52–69.",
      "doi": ""
    },
    {
      "text": "Andrew M Webb, Chen Wang, Andruid Kerne, and Pablo Cesar. 2016. Distributed liveness: understanding how new technologies transform performance experiences. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 432–437.",
      "doi": "10.1145/2818048.2819974"
    },
    {
      "text": "Zhenyu Yang, Bin Yu, Wanmin Wu, Ross Diankov, and Ruzena Bajscy. 2006. Collaborative Dancing in Tele-Immersive Environment. In Proceedings of the 14th ACM International Conference on Multimedia (Santa Barbara, CA, USA) (MM ’06). Association for Computing Machinery, New York, NY, USA, 723–726. https://doi.org/10.1145/1180639.1180793",
      "doi": "10.1145/1180639.1180793"
    },
    {
      "text": "Zhenyu Yang, Bin Yu, Wanmin Wu, Klara Nahrstedt, Ross Diankov, and Ruzena Bajscy. 2006. A study of collaborative dancing in tele-immersive environments. In Eighth IEEE International Symposium on Multimedia (ISM’06). IEEE, 177–184.",
      "doi": "10.1109/ISM.2006.14"
    },
    {
      "text": "Ruth Zaporah. 1995. Action theater: The improvisation of presence. North Atlantic Books.",
      "doi": ""
    }
  ]
}