{
  "doi": "10.1145/3411764.3445729",
  "title": "Proxemics and Social Interactions in an Instrumented Virtual Reality Workshop",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2021,
  "badges": [],
  "abstract": "Virtual environments (VEs) can create collaborative and social spaces, which are increasingly important in the face of remote work and travel reduction. Recent advances, such as more open and widely available platforms, create new possibilities to observe and analyse interaction in VEs. Using a custom instrumented build of Mozilla Hubs to measure position and orientation, we conducted an academic workshop to facilitate a range of typical workshop activities. We analysed social interactions during a keynote, small group breakouts, and informal networking/hallway conversations. Our mixed-methods approach combined environment logging, observations, and semi-structured interviews. The results demonstrate how small and large spaces influenced group formation, shared attention, and personal space, where smaller rooms facilitated more cohesive groups while larger rooms made small group formation challenging but personal space more flexible. Beyond our findings, we show how the combination of data and insights can fuel collaborative spaces’ design and deliver more effective virtual workshops.",
  "tags": [
    "Virtual Environments",
    "Social Signal Processing",
    "Interviews.",
    "Virtual Meetings"
  ],
  "authors": [
    {
      "name": "Julie Williamson",
      "institution": "School of Computing Science University of Glasgow, United Kingdom",
      "img": "/do/10.1145/contrib-81442606751/rel-imgonly/julie_pic.jpg",
      "acmid": "81442606751",
      "orcid": "missing"
    },
    {
      "name": "Jie Li",
      "institution": "Centrum Wiskunde & Informatica, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260993",
      "orcid": "missing"
    },
    {
      "name": "Vinoba Vinayagamoorthy",
      "institution": "BBC, United Kingdom",
      "img": "/do/10.1145/contrib-81100355462/rel-imgonly/image2017-06-2316-50-25-208.jpg",
      "acmid": "81100355462",
      "orcid": "missing"
    },
    {
      "name": "David A. Shamma",
      "institution": "CWI, Netherlands",
      "img": "/do/10.1145/contrib-81100288295/rel-imgonly/me.jpg",
      "acmid": "81100288295",
      "orcid": "0000-0003-2399-9374"
    },
    {
      "name": "Pablo Cesar",
      "institution": "CWI, Netherlands",
      "img": "/do/10.1145/contrib-81318497573/rel-imgonly/pablo.jpg",
      "acmid": "81318497573",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mark S. Ackerman, Jack Muramatsu, and David W. McDonald. 2010. Social Regulation in an Online Game: Uncovering the Problematics of Code. In Proceedings of the 16th ACM International Conference on Supporting Group Work (Sanibel Island, Florida, USA) (GROUP ’10). Association for Computing Machinery, New York, NY, USA, 173–182. https://doi.org/10.1145/1880071.1880101",
      "doi": "10.1145/1880071.1880101"
    },
    {
      "text": "Michael Argyle. 1988. Bodily Communication. Routledge, Abingdon-on-Thames, England.",
      "doi": ""
    },
    {
      "text": "Michael Argyle and Janet Dean. 1965. Eye-Contact, Distance and Affiliation. Sociometry 28, 3 (1965), 289–304. http://www.jstor.org/stable/2786027",
      "doi": ""
    },
    {
      "text": "Michael Argyle and Peter Trower. 1979. Person to person: ways of communicating. Harper and Row, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson, Jim Blascovich, Andrew C. Beall, and Jack M. Loomis. 2001. Equilibrium Theory Revisited: Mutual Gaze and Personal Space in Virtual Environments. Presence: Teleoper. Virtual Environ. 10, 6 (Dec. 2001), 583–598. https://doi.org/10.1162/105474601753272844",
      "doi": ""
    },
    {
      "text": "Jeremy N. Bailenson, Jim Blascovich, Andrew C. Beall, and Jack M. Loomis. 2003. Interpersonal distance in immersive virtual environments. , 819–833 pages. https://doi.org/10.1177/0146167203029007002",
      "doi": ""
    },
    {
      "text": "John Bowers, James Pycock, and Jon O’Brien. 1996. Talk and Embodiment in Collaborative Virtual Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, British Columbia, Canada) (CHI ’96). Association for Computing Machinery, New York, NY, USA, 58–65. https://doi.org/10.1145/238386.238404",
      "doi": "10.1145/238386.238404"
    },
    {
      "text": "Barry Brown. 2020. Notes on Running an Online Academic Conference or How We Got Zoombombed and Lived to Tell the Tale. Interactions 27, 4 (7 2020), 16–21. https://doi.org/10.1145/3406108",
      "doi": ""
    },
    {
      "text": "Barry Brown and Marek Bell. 2004. CSCW at Play: ’there’ as a Collaborative Virtual Environment. In Proceedings of the 2004 ACM Conference on Computer Supported Cooperative Work (Chicago, Illinois, USA) (CSCW ’04). Association for Computing Machinery, New York, NY, USA, 350–359. https://doi.org/10.1145/1031607.1031666",
      "doi": "10.1145/1031607.1031666"
    },
    {
      "text": "A. Bönsch, S. Radke, H. Overath, L. M. Asché, J. Wendt, T. Vierjahn, U. Habel, and T. W. Kuhlen. 2018. Social VR: How Personal Space is Affected by Virtual Agents’ Emotions. In 2018 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, New York, NY, USA, 199–206. https://doi.org/10.1109/VR.2018.8446480",
      "doi": ""
    },
    {
      "text": "Laura Cabrera-Quiros, D. Tax, and Hayley Hung. 2020. Gestures In-The-Wild: Detecting Conversational Hand Gestures in Crowded Scenes Using a Multimodal Fusion of Bags of Video Trajectories and Body Worn Acceleration. IEEE Transactions on Multimedia 22 (2020), 138–147.",
      "doi": "10.1109/TMM.2019.2922122"
    },
    {
      "text": "Marcus Carter, Fraser Allison, John Downs, and Martin Gibbs. 2015. Player Identity Dissonance and Voice Interaction in Games. In Proceedings of the 2015 Annual Symposium on Computer-Human Interaction in Play (London, United Kingdom) (CHI PLAY ’15). Association for Computing Machinery, New York, NY, USA, 265–269. https://doi.org/10.1145/2793107.2793144",
      "doi": "10.1145/2793107.2793144"
    },
    {
      "text": "Alvin Chin, Bin Xu, Fangxi Yin, Xia Wang, Wei Wang, Xiaoguang Fan, Dezhi Hong, and Ying Wang. 2012. Using Proximity and Homophily to Connect Conference Attendees in a Mobile Social Network. In Proceedings of the 2012 32nd International Conference on Distributed Computing Systems Workshops(ICDCSW ’12). IEEE Computer Society, USA, 79–87. https://doi.org/10.1109/ICDCSW.2012.56",
      "doi": "10.1109/ICDCSW.2012.56"
    },
    {
      "text": "Nicolas Ducheneaut, Nicholas Yee, Eric Nickell, and Robert J. Moore. 2006. ”Alone Together?”: Exploring the Social Dynamics of Massively Multiplayer Online Games. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 407––416. https://doi.org/10.1145/1124772.1124834",
      "doi": "10.1145/1124772.1124834"
    },
    {
      "text": "Thomas Erickson and Wendy A. Kellogg. 2000. Social Translucence: An Approach to Designing Systems That Support Social Processes. ACM Trans. Comput.-Hum. Interact. 7, 1 (March 2000), 59–83. https://doi.org/10.1145/344949.345004",
      "doi": "10.1145/344949.345004"
    },
    {
      "text": "Thomas Erickson, N. Sadat Shami, Wendy A. Kellogg, and David W. Levine. 2011. Synchronous Interaction among Hundreds: An Evaluation of a Conference in an Avatar-Based Virtual Environment. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 503–512. https://doi.org/10.1145/1978942.1979013",
      "doi": "10.1145/1978942.1979013"
    },
    {
      "text": "Doron Friedman, Anthony Steed, and Mel Slater. 2007. Spatial social behavior in second life. Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics) 4722 LNCS (2007), 252–263. https://doi.org/10.1007/978-3-540-74997-4_23",
      "doi": "10.1007/978-3-540-74997-4_23"
    },
    {
      "text": "B. Guo, C. Chen, D. Zhang, Z. Yu, and A. Chin. 2016. Mobile crowd sensing and computing: when participatory sensing meets participatory social media. IEEE Communications Magazine 54, 2 (2016), 131–137.",
      "doi": "10.1109/MCOM.2016.7402272"
    },
    {
      "text": "Edward Hall. 1969. The Hidden Dimension : man’s use of space in public and in private. Anchor Books, Hamburg, Germany. 217 pages.",
      "doi": ""
    },
    {
      "text": "Leslie A. Hayduk. 1983. Personal space: Where we now stand.Psychological Bulletin 94, 2 (1983), 293–335. https://doi.org/10.1037//0033-2909.94.2.293",
      "doi": ""
    },
    {
      "text": "Heiko Hecht, Robin Welsch, Jana Viehoff, and Matthew R. Longo. 2019. The shape of personal space. Acta Psychologica 193, April 2018 (2019), 113–122. https://doi.org/10.1016/j.actpsy.2018.12.009",
      "doi": ""
    },
    {
      "text": "B. Hillier and J. Hanson. 1988. The social logic of space. Cambridge University Press, Cambridge, England.",
      "doi": ""
    },
    {
      "text": "Michael A. Hogg and John C. Turner. 1985. Interpersonal attraction, social identification and psychological group formation. European Journal of Social Psychology 15, 1 (1 1985), 51–66. https://doi.org/10.1002/ejsp.2420150105",
      "doi": ""
    },
    {
      "text": "Hayley Hung and Daniel Gatica-Perez. 2010. Estimating cohesion in small groups using audio-visual nonverbal behavior. IEEE Transactions on Multimedia 12, 6 (10 2010), 563–575. https://doi.org/10.1109/TMM.2010.2055233",
      "doi": "10.1109/TMM.2010.2055233"
    },
    {
      "text": "Dongsik Jo, Ki-Hong Kim, and Gerard Jounghyun Kim. 2017. Effects of Avatar and Background Types on Users’ Co-presence and Trust for Mixed Reality-Based Teleconference Systems. In Proceedings of the International Conference on Computer Animation and Social Agents. Wiley, New York, NY, USA, 27–36.",
      "doi": ""
    },
    {
      "text": "Taemie Kim, Agnes Chang, Lindsey Holland, and Alex Sandy Pentland. 2008. Meeting Mediator: Enhancing Group Collaborationusing Sociometric Feedback. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (San Diego, CA, USA) (CSCW ’08). Association for Computing Machinery, New York, NY, USA, 457–466. https://doi.org/10.1145/1460563.1460636",
      "doi": "10.1145/1460563.1460636"
    },
    {
      "text": "D. A. Le, B. Maclntyre, and J. Outlaw. 2020. Enhancing the Experience of Virtual Conferences in Social Virtual Environments. In 2020 IEEE Conference on Virtual Reality and 3D User Interfaces Abstracts and Workshops (VRW). IEEE, New York, NY, USA, 485–494. https://doi.org/10.1109/VRW50115.2020.00101",
      "doi": ""
    },
    {
      "text": "Jie Li, Yiping Kong, Thomas Röggla, Francesca De Simone, Swamy Ananthanarayan, Huib De Ridder, Abdallah El Ali, and Pablo Cesar. 2019. Measuring and understanding photo sharing experiences in social virtual reality. In Conference on Human Factors in Computing Systems - Proceedings. Association for Computing Machinery, New York, New York, USA, 1–14. https://doi.org/10.1145/3290605.3300897",
      "doi": "10.1145/3290605.3300897"
    },
    {
      "text": "Joan Llobera, Bernhard Spanlang, Giulio Ruffini, and Mel Slater. 2010. Proxemics with Multiple Dynamic Characters in an Immersive Virtual Environment. ACM Trans. Appl. Percept. 8, 1, Article 3 (Nov. 2010), 12 pages. https://doi.org/10.1145/1857893.1857896",
      "doi": "10.1145/1857893.1857896"
    },
    {
      "text": "Joshua McVeigh-Schultz, Anya Kolesnichenko, and Katherine Isbister. 2019. Shaping Pro-Social Interaction in VR: An Emerging Design Framework. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300794",
      "doi": "10.1145/3290605.3300794"
    },
    {
      "text": "Robert Moore, E. Hankinson Gathman, and Nicolas Ducheneaut. 2009. From 3D space to third place: The social life of small virtual spaces. Human Organization 68, 2 (2009), 230–240. https://doi.org/10.17730/humo.68.2.q673k16185u68v15",
      "doi": ""
    },
    {
      "text": "Richard Moss. 2018. The Secret History of Mac Gaming. Unbound, London, UK, Chapter The making of Dark Castle, 121–135. https://www.gamasutra.com/view/news/315720/The_making_of_Dark_Castle_An_excerpt_from_The_Secret_History_of_Mac_Gaming.php.",
      "doi": ""
    },
    {
      "text": "Fares Moustafa and Anthony Steed. 2018. A longitudinal study of small group interaction in social virtual reality. In Proceedings of the ACM Symposium on Virtual Reality Software and Technology, VRST, Vol. 10. Association for Computing Machinery, New York, NY, USA, 1–10. https://doi.org/10.1145/3281505.3281527",
      "doi": "10.1145/3281505.3281527"
    },
    {
      "text": "Carman Neustaedter, Gina Venolia, Jason Procyk, and Daniel Hawkins. 2016. To Beam or Not to Beam: A Study of Remote Telepresence Attendance at an Academic Conference. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing (San Francisco, California, USA) (CSCW ’16). Association for Computing Machinery, New York, NY, USA, 418–431. https://doi.org/10.1145/2818048.2819922",
      "doi": "10.1145/2818048.2819922"
    },
    {
      "text": "Catlin Pidel and Philipp Ackermann. 2020. Collaboration in Virtual and Augmented Reality: A Systematic Overview. In Augmented Reality, Virtual Reality, and Computer Graphics. Springer, Cham, Berlin, Germany, 141–156. https://doi.org/10.1007/978-3-030-58465-8_10",
      "doi": ""
    },
    {
      "text": "T.T. Postmes, R. Spears, and M. Lea. 1999. Social identity, group norms, and ”deindividuation” Lessons from computer-mediated communication for social influence in the group. , 164–183 pages.",
      "doi": ""
    },
    {
      "text": "Tom Postmes, Russell Spears, Khaled Sakhel, and Daphne de Groot. 2001. Social Influence in Computer-Mediated Communication: The Effects of Anonymity on Group Behavior. Personality and Social Psychology Bulletin 27, 10 (10 2001), 1243–1254. https://doi.org/10.1177/01461672012710001",
      "doi": ""
    },
    {
      "text": "Surangika Ranathunga, Stephen Cranefield, and Martin Purvis. 2012. Identifying events taking place in Second Life virtual environments. Applied Artificial Intelligence 26, 1-2 (2012), 137–181. https://doi.org/10.1080/08839514.2012.629559",
      "doi": ""
    },
    {
      "text": "D. Roth, J. Lugrin, D. Galakhov, A. Hofmann, G. Bente, M. E. Latoschik, and A. Fuhrmann. 2016. Avatar realism and social interaction quality in virtual reality. In 2016 IEEE Virtual Reality (VR). IEEE, New York, NY, USA, 277–278. https://doi.org/10.1109/VR.2016.7504761",
      "doi": ""
    },
    {
      "text": "Albert E. Scheflen and Alice Scheflen. 1972. Body Language and the Social Order: Communication As Behavioral Control. Prentice Hall Direct, Des Moines, IA, USA.",
      "doi": ""
    },
    {
      "text": "Ralph Schroeder, Anthony Steed, Ann-Sophie Axelsson, Ilona Heldal, Åsa Abelin, Josef Widestrom, Alexander Nilsson, and Mel Slater. 2001. Collaborating in networked immersive spaces : as good as being there together?Computers & Graphics 25, 5 (2001), 781–788. Collaborating in networked immersive spaces: as good as being there together? xD;TY - JOUR Y2 - Oct ISI:000171668700006 484AU COMPUT GRAPH-UK xD;http://www.equator.ac.uk/var/uploads/Schroeder2001.pdf.",
      "doi": ""
    },
    {
      "text": "S. Shirmohammadi, S. Hu, W. T. Ooi, G. Schiele, and A. Wacker. 2012. Mixing virtual and physical participation: The future of conference attendance?. In 2012 IEEE International Workshop on Haptic Audio Visual Environments and Games (HAVE 2012) Proceedings. IEEE, New York, NY, USA, 150–155. https://doi.org/10.1109/HAVE.2012.6374455",
      "doi": ""
    },
    {
      "text": "Mel Slater, Amela Sadagic, Martin Usoh, and Ralph Schroeder. 2000. Small-Group Behavior in a Virtual and Real Environment: A Comparative Study. Presence 9 (02 2000), 37–51. https://doi.org/10.1162/105474600566600",
      "doi": ""
    },
    {
      "text": "Mel Slater and Maria V. Sanchez-Vives. 2016. Enhancing Our Lives with Immersive Virtual Reality. Frontiers in Robotics and AI 3 (2016), 74. https://doi.org/10.3389/frobt.2016.00074",
      "doi": ""
    },
    {
      "text": "Mel Slater, Martin Usoh, and A. Steed. 1994. Depth of presence in virtual environments. Presence: Teleoperators and virtual environment 3, 2(1994), 130–144. https://doi.org/10.1007/s13398-014-0173-7.2",
      "doi": ""
    },
    {
      "text": "Anthony Steed and Ralph Schroeder. 2015. Collaboration in immersive and non-immersive virtual environments. In Immersed in Media: Telepresence Theory, Measurement and Technology. Springer International Publishing, Berlin, Germany, 263–282. https://doi.org/10.1007/978-3-319-10190-3_11",
      "doi": ""
    },
    {
      "text": "A. Steed, M. Slater, A. Sadagic, A. Bullock, and J. Tromp. 1999. Leadership and collaboration in shared virtual environments. In Proceedings IEEE Virtual Reality (Cat. No. 99CB36316). IEEE, New York, NY, USA, 112–115. https://doi.org/10.1109/VR.1999.756941",
      "doi": "10.5555/554230.835708"
    },
    {
      "text": "Duck Steve. 1998. Human Relationships. SAGE, London, England.",
      "doi": ""
    },
    {
      "text": "Kohske Takahashi, Tobias Meilinger, Katsumi Watanabe, and Heinrich H. Bülthoff. 2013. Psychological influences on distance estimation in a virtual reality environment. Frontiers in Human Neuroscience 7, SEP (2013), 1–7. https://doi.org/10.3389/fnhum.2013.00580",
      "doi": ""
    },
    {
      "text": "Shari M. Trewin, Mark R. Laff, Anna Cavender, and Vicki L. Hanson. 2008. Accessibility in Virtual Worlds. In CHI ’08 Extended Abstracts on Human Factors in Computing Systems (Florence, Italy) (CHI EA ’08). Association for Computing Machinery, New York, NY, USA, 2727–2732. https://doi.org/10.1145/1358628.1358752",
      "doi": ""
    },
    {
      "text": "Greg Wadley, Marcus Carter, and Martin Gibbs. 2015. Voice in virtual worlds: The design, use, and influence of voice chat in online play. Human-Computer Interaction 30, 3-4 (2015), 336–365. https://doi.org/10.1080/07370024.2014.987346",
      "doi": "10.1080/07370024.2014.987346"
    },
    {
      "text": "M. Wessner and H. R. Pfister. 2001. Group formation in computer-supported collaborative learning. In Proceedings of the International ACM SIGGROUP Conference on Supporting Group Work. Association for Computing Machinery (ACM), New York, New York, USA, 24–31. https://doi.org/10.1145/500286.500293",
      "doi": "10.1145/500286.500293"
    },
    {
      "text": "William H. Whyte. 1982. The Social Life of Small Urban Spaces. Project for Public Spaces, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Laurie M. Wilcox, Samuel Elfassy, Cynthia Grelik, and Robert S. Allison. 2006. Personal Space in Virtual Reality. ACM Transactions on Applied Perception 3, 4 (2006), 412–428. https://doi.org/10.1145/1190036.1190041",
      "doi": "10.1145/1190036.1190041"
    },
    {
      "text": "Bob G. Witmer and Michael J. Singer. 1998. Measuring presence in virtual environments: A presence questionnaire. Presence: Teleoperators and Virtual Environments 7, 3(1998), 225–240. https://doi.org/10.1162/105474698565686",
      "doi": "10.1162/105474698565686"
    },
    {
      "text": "Nick Yee, Jeremy N. Bailenson, Mark Urbanek, Francis Chang, and Dan Merget. 2007. The unbearable likeness of being digital: The persistence of nonverbal social norms in online virtual environments. Cyberpsychology and Behavior 10, 1 (2 2007), 115–121. https://doi.org/10.1089/cpb.2006.9984",
      "doi": ""
    }
  ]
}