{
  "doi": "10.1145/3411764.3445152",
  "title": "Quantitative Data Visualisation on Virtual Globes",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Geographic data visualisation on virtual globes is intuitive and widespread, but has not been thoroughly investigated. We explore two main design factors for quantitative data visualisation on virtual globes: i) commonly used primitives (2D bar, 3D bar, circle) and ii) the orientation of these primitives (tangential, normal, billboarded). We evaluate five distinctive visualisation idioms in a user study with 50 participants. The results show that aligning primitives tangentially on the globe’s surface decreases the accuracy of area-proportional circle visualisations, while the orientation does not have a significant effect on the accuracy of length-proportional bar visualisations. We also find that tangential primitives induce higher perceived mental load than other orientations. Guided by these results we design a novel globe visualisation idiom, Geoburst, that combines a virtual globe and a radial bar chart. A preliminary evaluation reports potential benefits and drawbacks of the Geoburst visualisation.",
  "authors": [
    {
      "name": "Kadek Ananta Satriadi",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659644394",
      "orcid": "0000-0002-2230-8677"
    },
    {
      "name": "Barrett Ens",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/do/10.1145/contrib-81488672423/rel-imgonly/hci_holiday_lunch_2013_5.jpg",
      "acmid": "81488672423",
      "orcid": "0000-0001-6695-4809"
    },
    {
      "name": "Tobias Czauderna",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81470653029",
      "orcid": "missing"
    },
    {
      "name": "Maxime Cordeil",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81488668405",
      "orcid": "0000-0002-9732-4874"
    },
    {
      "name": "Bernhard Jenny",
      "institution": "Monash University, Melbourne, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81443597718",
      "orcid": "0000-0001-6101-6100"
    }
  ],
  "references": [
    {
      "text": "Tomas Akenine-Möller, Eric Haines, and Naty Hoffman. 2019. Real-time rendering. CRC Press.",
      "doi": ""
    },
    {
      "text": "Natalia Andrienko and Gennady Andrienko. 2006. Exploratory analysis of spatial and temporal data: a systematic approach. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Christopher R Austin, Barrett Ens, Kadek Ananta Satriadi, and Bernhard Jenny. 2020. Elicitation study investigating hand and foot gesture interaction for immersive maps in augmented reality. Cartography and Geographic Information Science 47, 3 (2020), 214–228.",
      "doi": ""
    },
    {
      "text": "Susanne Bleisch. 2011. Toward appropriate representations of quantitative data in virtual environments. Cartographica: The International Journal for Geographic Information and Geovisualization 46, 4 (2011), 252–261.",
      "doi": ""
    },
    {
      "text": "Susanne Bleisch and Jason Dykes. 2015. Quantitative data graphics in 3D desktop-based virtual environments–an evaluation. International Journal of Digital Earth 8, 8 (2015), 623–639.",
      "doi": ""
    },
    {
      "text": "Susanne Bleisch, Jason Dykes, and Stephan Nebiker. 2008. Evaluating the effectiveness of representing numeric information through abstract graphics in 3D desktop virtual environments. The Cartographic Journal 45, 3 (2008), 216–226.",
      "doi": ""
    },
    {
      "text": "Sergio Cabello, Herman Haverkort, Marc Van Kreveld, and Bettina Speckmann. 2010. Algorithmic aspects of proportional symbol maps. Algorithmica 58, 3 (2010), 543–565.",
      "doi": "10.1007/s00453-009-9281-8"
    },
    {
      "text": "Stuart K Card, George G Robertson, and Jock D Mackinlay. 1991. The information visualizer, an information workspace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 181–186.",
      "doi": "10.1145/108844.108874"
    },
    {
      "text": "Jesse Chandler and Danielle Shapiro. 2016. Conducting clinical research using crowdsourced convenience samples. Annual Review of Clinical Psychology 12 (2016), 53–81.",
      "doi": ""
    },
    {
      "text": "Seán Clarke, Antonio Voce, Pablo Gutiérrez, and Frank Hulley-Jones. 2020. How coronavirus spread across the globe – visualised. https://www.theguardian.com/world/ng-interactive/2020/apr/09/how-coronavirus-spread-across-the-globe-visualised",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. J. Amer. Statist. Assoc. 79, 387 (1984), 531–554.",
      "doi": "10.2307/2288400"
    },
    {
      "text": "William S Cleveland and Robert McGill. 1986. An experiment in graphical perception. International Journal of Man-Machine Studies 25, 5 (1986), 491–500.",
      "doi": "10.1016/S0020-7373%2886%2980019-0"
    },
    {
      "text": "Christopher Collins and Sheelagh Carpendale. 2007. VisLink: Revealing relationships amongst visualizations. IEEE Transactions on Visualization and Computer Graphics 13, 6(2007), 1192–1199.",
      "doi": "10.1109/TVCG.2007.70521"
    },
    {
      "text": "Katherine N Cotter, Paul J Silvia, Marco Bertamini, Letizia Palumbo, and Oshin Vartanian. 2017. Curve appeal: exploring individual differences in preference for curved versus angular objects. i-Perception 8, 2 (2017), 2041669517693023.",
      "doi": ""
    },
    {
      "text": "Kurtis Danyluk, Bernhard Jenny, and Wesley Willett. 2019. Look-from camera control for 3D terrain maps. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3290605.3300594"
    },
    {
      "text": "Alan A. DeLucia and John P. Snyder. 1986. An Innovative World Map Projection. The American Cartographer 13, 2 (1986), 165–167.",
      "doi": ""
    },
    {
      "text": "Borden Dent, J Torguson, and T Hodler. 2008. Thematic map design. McGraw-Hill New York, New York, NY.",
      "doi": ""
    },
    {
      "text": "Steve Dübel, Martin Röhlig, Heidrun Schumann, and Matthias Trapp. 2014. 2D and 3D presentation of spatial data: A systematic review. In 2014 IEEE VIS international workshop on 3DVis (3DVis). IEEE, 11–18.",
      "doi": ""
    },
    {
      "text": "Geoffrey Ellis and Alan Dix. 2007. A taxonomy of clutter reduction for information visualisation. IEEE Transactions on Visualization and Computer Graphics 13, 6(2007), 1216–1223.",
      "doi": "10.1109/TVCG.2007.70535"
    },
    {
      "text": "David Englmeier, Isabel Schönewald, Andreas Butz, and Tobias Höllerer. 2019. Feel the globe: Enhancing the perception of immersive spherical visualizations with tangible proxies. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). IEEE, 1693–1698.",
      "doi": ""
    },
    {
      "text": "James John Flannery. 1971. The relative effectiveness of some common graduated point symbols in the presentation of quantitative data. Cartographica: The International Journal for Geographic Information and Geovisualization 8, 2 (1971), 96–109.",
      "doi": ""
    },
    {
      "text": "Al Gore. 1992. Earth in the Balance: Ecology and the Human Spirit. Houghton Mifflin.",
      "doi": ""
    },
    {
      "text": "Al Gore. 1998. The Digital Earth. Australian Surveyor 43, 2 (1998), 89–91.",
      "doi": ""
    },
    {
      "text": "Christian Haeberling, Hansruedi Bär, and Lorenz Hurni. 2008. Proposed cartographic design principles for 3D maps: a contribution to an extended cartographic theory. Cartographica: The International Journal for Geographic Information and Geovisualization 43, 3 (2008), 175–188.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 203–212.",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Dennis E Hinkle, William Wiersma, and Stephen G Jurs. 2003. Applied statistics for the behavioral sciences. Vol. 663. Houghton Mifflin College Division.",
      "doi": ""
    },
    {
      "text": "Ray A Jarvis. 1973. On the identification of the convex hull of a finite set of points in the plane. Inform. Process. Lett. 2, 1 (1973), 18–21.",
      "doi": ""
    },
    {
      "text": "Waqas Javed and Niklas Elmqvist. 2012. Exploring the design space of composite visualization. In 2012 IEEE Pacific Visualization Symposium. IEEE, 1–8.",
      "doi": "10.1109/PacificVis.2012.6183556"
    },
    {
      "text": "Dye Josh, Butt Craig, Lama Richard, and Stehle Mark. 2020. Silent Skies. https://www.theage.com.au/interactive/2020/coronavirus/silent-skies/index.html",
      "doi": ""
    },
    {
      "text": "Harold W Kuhn. 1955. The Hungarian method for the assignment problem. Naval Research Logistics Quarterly 2, 1–2 (1955), 83–97.",
      "doi": ""
    },
    {
      "text": "Miljenko Lapaine and Nedjeljko Frančula. 1993. Gilbert two-world projection. In Proceedings 16th International Cartographic Conference. 66–82.",
      "doi": ""
    },
    {
      "text": "Fritz Lekschas, Michael Behrisch, Benjamin Bach, Peter Kerpedjiev, Nils Gehlenborg, and Hanspeter Pfister. 2019. Pattern-Driven Navigation in 2D Multiscale Visualizations with Scalable Insets. IEEE Transactions on Visualization and Computer Graphics 26, 1(2019), 611–621.",
      "doi": ""
    },
    {
      "text": "Boren Li, Jianping Wu, Mao Pan, and Jing Huang. 2015. Application of 3D WebGIS and real-time technique in earthquake information publishing and visualization. Earthquake Science 28, 3 (2015), 223–231.",
      "doi": ""
    },
    {
      "text": "Wenwen Li and Sizhe Wang. 2017. PolarGlobe: A web-wide virtual globe system for visualizing multidimensional, time-varying, big climate data. International Journal of Geographical Information Science 31, 8(2017), 1562–1582.",
      "doi": "10.5555/3105150.3105154"
    },
    {
      "text": "Marlon Lückert. 2020. CovidAR - Data Visualization in Augmented Reality. https://devpost.com/software/covidar-data-visualization-in-augmented-reality",
      "doi": ""
    },
    {
      "text": "Jock Mackinlay. 1986. Automating the design of graphical presentations of relational information. ACM Transactions on Graphics 5, 2 (1986), 110–141.",
      "doi": "10.1145/22949.22950"
    },
    {
      "text": "Microsoft. 2015. Globe Map. https://appsource.microsoft.com/en-us/product/power-bi-visuals/WA104380799",
      "doi": ""
    },
    {
      "text": "Tamara Munzner. 2014. Visualization analysis and design. CRC Press.",
      "doi": ""
    },
    {
      "text": "Ong Innovations. 2018. Data Globe. https://www.onginnovations.com/data-globe",
      "doi": ""
    },
    {
      "text": "Stefan Palan and Christian Schitter. 2018. Prolific. ac—A subject pool for online experiments. Journal of Behavioral and Experimental Finance 17 (2018), 22–27.",
      "doi": ""
    },
    {
      "text": "Todd C Patterson. 2007. Google Earth as a (not just) geography education tool. Journal of Geography 106, 4 (2007), 145–152.",
      "doi": ""
    },
    {
      "text": "Eyal Peer, Laura Brandimarte, Sonam Samat, and Alessandro Acquisti. 2017. Beyond the Turk: Alternative platforms for crowdsourcing behavioral research. Journal of Experimental Social Psychology 70 (2017), 153–163.",
      "doi": ""
    },
    {
      "text": "Andrei D Polyanin and Alexander V Manzhirov. 2006. Handbook of mathematics for engineers and scientists. CRC Press.",
      "doi": ""
    },
    {
      "text": "Stanislav Popelka and Jitka Dolezalova. 2016. Differences between 2D map and virtual globe containing point symbol – an eye-tracking study. In Proceedings International Multidisciplinary Scientific GeoConference SGEM 2016. 175–182.",
      "doi": ""
    },
    {
      "text": "Quang Quach and Bernhard Jenny. 2020. Immersive visualization with bar graphics. Cartography and Geographic Information Science 47, 6 (2020), 471–480. https://doi.org/10.1080/15230406.2020.1771771",
      "doi": ""
    },
    {
      "text": "Nicola Raluca. 2018. World population count. https://ralucanicola.github.io/JSAPI_demos/world-population/",
      "doi": ""
    },
    {
      "text": "Robert E Roth. 2013. An empirically-derived taxonomy of interaction primitives for interactive cartography and geovisualization. IEEE Transactions on Visualization and Computer Graphics 19, 12(2013), 2356–2365.",
      "doi": "10.1109/TVCG.2013.130"
    },
    {
      "text": "Kadek A Satriadi, Barrett Ens, Maxime Cordeil, Tobias Czauderna, and Bernhard Jenny. 2020. Maps Around Me: 3D Multiview Layouts in Immersive Spaces. Proc. ACM Hum.-Comput. Interact. 4, ISS, Article 201 (Nov. 2020), 20 pages. https://doi.org/10.1145/3427329",
      "doi": "10.1145/3427329"
    },
    {
      "text": "Kadek A Satriadi, Barrett Ens, Maxime Cordeil, Bernhard Jenny, Tobias Czauderna, and Wesley Willett. 2019. Augmented Reality Map Navigation with Freehand Gestures. In 2019 IEEE Conference on Virtual Reality and 3D User Interfaces (VR). 593–603.",
      "doi": ""
    },
    {
      "text": "Stefan Seipel and Leonor Carvalho. 2012. Solving Combined Geospatial Tasks Using 2D and 3D Bar Charts. In 2012 16th International Conference on Information Visualisation. 157–163.",
      "doi": "10.1109/IV.2012.36"
    },
    {
      "text": "Lei Shi, Idan Zelzer, Catherine Feng, and Shiri Azenkot. 2016. Tickers and talker: An accessible labeling toolkit for 3D printed models. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 4896–4907.",
      "doi": "10.1145/2858036.2858507"
    },
    {
      "text": "Lei Shi, Yuhang Zhao, and Shiri Azenkot. 2017. Markit and Talkit: a low-barrier toolkit to augment 3D printed models with audio annotations. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology. 493–506.",
      "doi": "10.1145/3126594.3126650"
    },
    {
      "text": "Paul J Silvia and Christopher M Barona. 2009. Do people prefer curved objects? Angularity, expertise, and aesthetic preference. Empirical studies of the arts 27, 1 (2009), 25–42.",
      "doi": ""
    },
    {
      "text": "Terry A Slocum, Robert B McMaster, Fritz C Kessler, and Hugh H Howard. 2009. Thematic cartography and visualization. Prentice Hall.",
      "doi": ""
    },
    {
      "text": "Karla Vega, Eric Wernert, Patrick Beard, C Gniady, David Reagan, M Boyles, and Chris Eller. 2014. Visualization on spherical displays: Challenges and opportunities. In Proceedings of the IEEE VIS Arts Program (VISAP). 108–116.",
      "doi": ""
    },
    {
      "text": "Travis Maclean White. 2012. Evaluating the effectiveness of thematic mapping on virtual globes. Ph.D. Dissertation. University of Kansas.",
      "doi": ""
    },
    {
      "text": "Jacob O Wobbrock, Leah Findlater, Darren Gergle, and James J Higgins. 2011. The aligned rank transform for nonparametric factorial analyses using only anova procedures. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 143–146.",
      "doi": "10.1145/1978942.1978963"
    },
    {
      "text": "Huayi Wu, Zhengwei He, and Jianya Gong. 2010. A virtual globe-based 3D visualization and interactive framework for public participation in urban planning processes. Computers, Environment and Urban Systems 34, 4 (2010), 291–298.",
      "doi": ""
    },
    {
      "text": "Yalong Yang, Tim Dwyer, Sarah Goodwin, and Kim Marriott. 2016. Many-to-many geographically-embedded flow visualisation: An evaluation. IEEE Transactions on Visualization and Computer Graphics 23, 1(2016), 411–420.",
      "doi": "10.1109/TVCG.2016.2598885"
    },
    {
      "text": "Yalong Yang, Tim Dwyer, Bernhard Jenny, Kim Marriott, Maxime Cordeil, and Haohui Chen. 2018. Origin-destination flow maps in immersive environments. IEEE Transactions on Visualization and Computer Graphics 25, 1(2018), 693–703.",
      "doi": "10.1109/TVCG.2018.2865192"
    },
    {
      "text": "Yalong Yang, Tim Dwyer, Kimbal Marriott, Bernhard Jenny, and Sarah Goodwin. 2020. Tilt Map: Interactive Transitions Between Choropleth Map, Prism Map and Bar Chart in Immersive Environments. IEEE Transactions on Visualization and Computer Graphics (2020).",
      "doi": "10.1109/tvcg.2020.3004137"
    },
    {
      "text": "Yalong Yang, Bernhard Jenny, Tim Dwyer, Kim Marriott, Haohui Chen, and Maxime Cordeil. 2018. Maps and globes in virtual reality. Computer Graphics Forum 37, 3 (2018), 427–438.",
      "doi": "10.1111/cgf.13431arXiv%3Ahttps%3A"
    }
  ]
}