{
  "doi": "10.1145/3411764.3445185",
  "title": "Scraps: Enabling Mobile Capture, Contextualization, and Use of Document Resources",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "People often capture photos or notes from their phones to integrate later into a document. But current mobile capture tools can make this hard, with the captured information ending up fragmented and decontextualized. This paper explores how to help document authors capture, contextualize, and use document-related information. A survey of 66 information workers reveals that document-focused information capture differs from other types of mobile information capture, and that while people capture a broad range of information types while mobile, most document-related capture comes in the form of photos, notes, and bookmarks. Based on this survey we built Scraps, which consists of two parts: 1) a mobile app that makes it easy for people to capture and add context to information from their phone, and 2) a Word sidebar that helps them later link that information to a document on their desktop. In a field study with 11 information workers, we find that Scraps streamlined the process of capturing and using document-related information, and enabled people to focus on writing over integrating captured information.",
  "authors": [
    {
      "name": "Amanda Swearngin",
      "institution": "Paul G. Allen School of Computer Science & Engineering University of Washington, United States",
      "img": "/do/10.1145/contrib-81488669260/rel-imgonly/avatar.jpg",
      "acmid": "81488669260",
      "orcid": "missing"
    },
    {
      "name": "Shamsi Iqbal",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81343495796",
      "orcid": "0000-0002-9380-8759"
    },
    {
      "name": "Victor Poznanski",
      "institution": "Microsoft Corporation, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701625",
      "orcid": "missing"
    },
    {
      "name": "Mark Encarnación",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659468132",
      "orcid": "missing"
    },
    {
      "name": "Paul N. Bennett",
      "institution": "Microsoft, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100291422",
      "orcid": "missing"
    },
    {
      "name": "Jaime Teevan",
      "institution": "Microsoft, United States",
      "img": "/do/10.1145/contrib-81100167805/rel-imgonly/jaime-teevan-straight.jpg",
      "acmid": "81100167805",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2019. Bing Autosuggest API. https://azure.microsoft.com/en-us/services/cognitive-services/autosuggest/",
      "doi": ""
    },
    {
      "text": "2019. Bing Maps Locations API. https://docs.microsoft.com/en-us/bingmaps/rest-services/locations/index/",
      "doi": ""
    },
    {
      "text": "2019. Bing Web Search API. https://azure.microsoft.com/en-us/services/cognitive-services/bing-web-search-api/",
      "doi": ""
    },
    {
      "text": "2019. Microsoft Graph API. https://docs.microsoft.com/en-us/graph/use-the-api",
      "doi": ""
    },
    {
      "text": "Tal August, Shamsi T. Iqbal, Michael Gamon, and Mark Encarnación. 2020. Characterizing the Mobile Microtask Writing Process. In Proceedings of the 22nd International Conference on Human-Computer Interaction with Mobile Devices and Services(MobileHCI ’20).",
      "doi": "10.1145/3379503.3403541"
    },
    {
      "text": "Sebastian Baltes, Peter Schmitz, and Stephan Diehl. 2014. Linking Sketches and Diagrams to Source Code Artifacts. In Proceedings of the 22Nd ACM SIGSOFT International Symposium on Foundations of Software Engineering (Hong Kong, China) (FSE 2014). ACM, New York, NY, USA, 743–746. https://doi.org/10.1145/2635868.2661672",
      "doi": "10.1145/2635868.2661672"
    },
    {
      "text": "Ofer Bergman, Ruth Beyth-Marom, and Rafi Nachmias. 2006. The Project Fragmentation Problem in Personal Information Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montreal, Quebec, Canada) (CHI ’06). ACM, New York, NY, USA, 271–274. https://doi.org/10.1145/1124772.1124813",
      "doi": "10.1145/1124772.1124813"
    },
    {
      "text": "Michael Bernstein, Max Van Kleek, David Karger, and MC Schraefel. 2008. Information Scraps: How and Why Information Eludes our Personal Information Management Tools. ACM Transactions on Information Systems (TOIS) 26, 4 (2008), 24.",
      "doi": "10.1145/1402256.1402263"
    },
    {
      "text": "Richard Boardman and M. Angela Sasse. 2004. ”Stuff Goes into the Computer and Doesn’t Come out”: A Cross-tool Study of Personal Information Management. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vienna, Austria) (CHI ’04). ACM, New York, NY, USA, 583–590. https://doi.org/10.1145/985692.985766",
      "doi": "10.1145/985692.985766"
    },
    {
      "text": "Olha Bondarenko and Ruud Janssen. 2005. Documents at Hand: Learning from Paper to Improve Digital Technologies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’05). 121–130.",
      "doi": "10.1145/1054972.1054990"
    },
    {
      "text": "Horatiu Bota, Paul N. Bennett, Ahmed Hassan Awadallah, and Susan T. Dumais. 2017. Self-Es: The Role of Emails-to-Self in Personal Information Management. In Proceedings of the 2017 Conference on Conference Human Information Interaction and Retrieval (Oslo, Norway) (CHIIR ’17). ACM, New York, NY, USA, 205–214. https://doi.org/10.1145/3020165.3020189",
      "doi": "10.1145/3020165.3020189"
    },
    {
      "text": "Peter Brandl, Christoph Richter, and Michael Haller. 2010. NiCEBook: Supporting Natural Note Taking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). ACM, New York, NY, USA, 599–608. https://doi.org/10.1145/1753326.1753417",
      "doi": "10.1145/1753326.1753417"
    },
    {
      "text": "Stacy Branham, Gene Golovchinsky, Scott Carter, and Jacob T. Biehl. 2010. Let’s Go from the Whiteboard: Supporting Transitions in Work Through Whiteboard Capture and Reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). ACM, New York, NY, USA, 75–84. https://doi.org/10.1145/1753326.1753338",
      "doi": "10.1145/1753326.1753338"
    },
    {
      "text": "Mendel Broekhuijsen, Elise van den Hoven, and Panos Markopoulos. 2017. From PhotoWork to PhotoUse: Exploring Personal Digital Photo Activities. Behaviour & Information Technology 36, 7 (2017), 754–767. https://doi.org/10.1080/0144929X.2017.1288266",
      "doi": "10.1080/0144929X.2017.1288266"
    },
    {
      "text": "John Brooke. 1996. SUS-A Quick and Dirty Usability Scale. Usability Evaluation in Industry 189, 194 (1996), 4–7.",
      "doi": ""
    },
    {
      "text": "Barry A. T. Brown, Abigail J. Sellen, and Kenton P. O’Hara. 2000. A Diary Study of Information Capture in Working Life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (The Hague, The Netherlands) (CHI ’00). ACM, New York, NY, USA, 438–445. https://doi.org/10.1145/332040.332472",
      "doi": "10.1145/332040.332472"
    },
    {
      "text": "Frederik Brudy, Christian Holz, Roman Rädle, Chi-Jui Wu, Steven Houben, Clemens Nylandsted Klokmose, and Nicolai Marquardt. 2019. Cross-Device Taxonomy: Survey, Opportunities and Challenges of Interactions Spanning Across Multiple Devices. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 562, 28 pages. https://doi.org/10.1145/3290605.3300792",
      "doi": "10.1145/3290605.3300792"
    },
    {
      "text": "Paris Buttfield-Addison, Christopher Lueg, Leonie Ellis, and Jon Manning. 2012. ”Everything Goes into or out of the iPad”: The iPad, Information Scraps and Personal Information Management. In Proceedings of the 24th Australian Computer-Human Interaction Conference (Melbourne, Australia) (OzCHI ’12). ACM, New York, NY, USA, 61–67. https://doi.org/10.1145/2414536.2414546",
      "doi": "10.1145/2414536.2414546"
    },
    {
      "text": "Robert Capra. 2009. A Survey of Personal Information Management Practices. In Proceedings of the American Society for Information Science and Technology (ASIS&T) 2009, PIM Workshop. 2–5.",
      "doi": ""
    },
    {
      "text": "Tsung-Hsiang Chang and Yang Li. 2011. Deep Shot: A Framework for Migrating Tasks Across Devices Using Mobile Phone Cameras. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 2163–2172. https://doi.org/10.1145/1978942.1979257",
      "doi": "10.1145/1978942.1979257"
    },
    {
      "text": "Evernote Corporation. 2020. Best Note Taking App - Organize Your Notes with Evernote. https://evernote.com/",
      "doi": ""
    },
    {
      "text": "Justin Cranshaw, Emad Elwany, Todd Newman, Rafal Kocielnik, Bowen Yu, Sandeep Soni, Jaime Teevan, and Andrés Monroy-Hernández. 2017. Calendar.Help: Designing a Workflow-Based Scheduling Agent with Humans in the Loop. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). ACM, New York, NY, USA, 2382–2393. https://doi.org/10.1145/3025453.3025780",
      "doi": "10.1145/3025453.3025780"
    },
    {
      "text": "Laura Drăgan, Siegfried Handschuh, and Stefan Decker. 2011. The Semantic Desktop at Work: Interlinking Notes. In Proceedings of the 7th International Conference on Semantic Systems (Graz, Austria) (I-Semantics ’11). ACM, New York, NY, USA, 17–24. https://doi.org/10.1145/2063518.2063521",
      "doi": "10.1145/2063518.2063521"
    },
    {
      "text": "Jessica L Feuston and Siân E Lindley. 2018. How Social Dynamics and the Context of Digital Content Impact Workplace Remix. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). 1–13.",
      "doi": "10.1145/3173574.3174171"
    },
    {
      "text": "Aron D Fischel and Kim Halskov. 2018. A survey of the usage of sticky notes. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems. 1–6.",
      "doi": "10.1145/3170427.3188526"
    },
    {
      "text": "Víctor M. González and Gloria Mark. 2004. Constant, Constant, Multi-Tasking Craziness: Managing Multiple Working Spheres. In Proceedings of the 2004 Conference on Human Factors in Computing Systems (Vienna, Austria) (CHI ’04). 113–120. https://doi.org/10.1145/985692.985707",
      "doi": ""
    },
    {
      "text": "Google. 2020. Google Keep. https://keep.google.com",
      "doi": ""
    },
    {
      "text": "Nathan Hahn, Shamsi T. Iqbal, and Jaime Teevan. 2019. Casual Microtasking: Embedding Microtasks in Facebook. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). ACM, New York, NY, USA, Article 19, 9 pages. https://doi.org/10.1145/3290605.3300249",
      "doi": "10.1145/3290605.3300249"
    },
    {
      "text": "Björn Hartmann, Leith Abdulla, Manas Mittal, and Scott R. Klemmer. 2007. Authoring Sensor-based Interactions by Demonstration with Direct Manipulation and Pattern Recognition. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’07). ACM, New York, NY, USA, 145–154. https://doi.org/10.1145/1240624.1240646",
      "doi": "10.1145/1240624.1240646"
    },
    {
      "text": "Apple Inc.2020. Apple Notes. https://www.icloud.com/notes",
      "doi": ""
    },
    {
      "text": "Shamsi T. Iqbal, Jaime Teevan, Dan Liebling, and Anne Loomis Thompson. 2018. Multitasking with Play Write, a Mobile Microproductivity Writing Tool. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology(Berlin, Germany) (UIST ’18). ACM, New York, NY, USA, 411–422. https://doi.org/10.1145/3242587.3242611",
      "doi": "10.1145/3242587.3242611"
    },
    {
      "text": "Amalie Enshelm Jensen, Caroline Møller Jægerfelt, Sanne Francis, Birger Larsen, and Toine Bogers. 2018. I Just Scroll Through My Stuff Until I Find It or Give Up: A Contextual Inquiry of PIM on Private Handheld Devices. In Proceedings of the 2018 Conference on Human Information Interaction & Retrieval (New Brunswick, NJ, USA) (CHIIR ’18). ACM, New York, NY, USA, 140–149. https://doi.org/10.1145/3176349.3176394",
      "doi": "10.1145/3176349.3176394"
    },
    {
      "text": "Tero Jokela, Jarno Ojala, and Thomas Olsson. 2015. A Diary Study on Combining Multiple Information Devices in Everyday Activities and Tasks. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 3903–3912. https://doi.org/10.1145/2702123.2702211",
      "doi": "10.1145/2702123.2702211"
    },
    {
      "text": "William Jones, Kenneth M. Anderson, and Steve Whittaker. 2012. Representing Our Information Structures for Research and for Everyday Use. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems (Austin, Texas, USA) (CHI EA ’12). ACM, New York, NY, USA, 151–160. https://doi.org/10.1145/2212776.2212793",
      "doi": ""
    },
    {
      "text": "William Jones, Robert Capra, Anne Diekema, Jaime Teevan, Manuel Pérez-Quiñones, Jesse David Dinneen, and Bradley Hemminger. 2015. ”For Telling” the Present: Using the Delphi Method to Understand Personal Information Management Practices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). ACM, New York, NY, USA, 3513–3522. https://doi.org/10.1145/2702123.2702523",
      "doi": "10.1145/2702123.2702523"
    },
    {
      "text": "Amy K. Karlson, Shamsi T. Iqbal, Brian Meyers, Gonzalo Ramos, Kathy Lee, and John C. Tang. 2010. Mobile Taskflow in Context: A Screenshot Study of Smartphone Usage. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). ACM, New York, NY, USA, 2009–2018. https://doi.org/10.1145/1753326.1753631",
      "doi": "10.1145/1753326.1753631"
    },
    {
      "text": "Amy J. Ko, Brad A. Myers, Senior Member, Michael J. Coblenz, and Htet Htet Aung. 2006. An Exploratory Study of How Developers Seek, Relate, and Collect Relevant Information during Software Maintenance Tasks. IEEE Transactions on Software Engineering 32 (2006), 971–987.",
      "doi": "10.1109/TSE.2006.116"
    },
    {
      "text": "Min Lin, Wayne G. Lutters, and Tina S. Kim. 2004. Understanding the Micronote Lifecycle: Improving Mobile Support for Informal Note Taking. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vienna, Austria) (CHI ’04). ACM, New York, NY, USA, 687–694. https://doi.org/10.1145/985692.985779",
      "doi": "10.1145/985692.985779"
    },
    {
      "text": "Michael Nebeling, Alexandra To, Anhong Guo, Adrian A. de Freitas, Jaime Teevan, Steven P. Dow, and Jeffrey P. Bigham. 2016. WearWrite: Crowd-Assisted Writing from Smartwatches. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 3834–3846. https://doi.org/10.1145/2858036.2858169",
      "doi": "10.1145/2858036.2858169"
    },
    {
      "text": "Gerard Oleksik, Hans-Christian Jetter, Jens Gerken, Natasa Milic-Frayling, and Rachel Jones. 2013. Towards an Information Architecture for Flexible Reuse of Digital Media. In Proceedings of the 12th International Conference on Mobile and Ubiquitous Multimedia (Luleå, Sweden) (MUM ’13). ACM, New York, NY, USA, Article 12, 10 pages. https://doi.org/10.1145/2541831.2541866",
      "doi": "10.1145/2541831.2541866"
    },
    {
      "text": "Stephanie Santosa and Daniel Wigdor. 2013. A Field Study of Multi-device Workflows in Distributed Workspaces. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing(Zurich, Switzerland) (UbiComp ’13). ACM, New York, NY, USA, 63–72. https://doi.org/10.1145/2493432.2493476",
      "doi": "10.1145/2493432.2493476"
    },
    {
      "text": "Jaime Teevan, Shamsi T. Iqbal, and Curtis von Veh. 2016. Supporting Collaborative Writing with Microtasks. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). ACM, New York, NY, USA, 2657–2668. https://doi.org/10.1145/2858036.2858108",
      "doi": "10.1145/2858036.2858108"
    },
    {
      "text": "Amrita Thakur, Michael Gormish, and Berna Erol. 2011. Mobile Phones and Information Capture in the Workplace. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). ACM, New York, NY, USA, 1513–1518. https://doi.org/10.1145/1979742.1979800",
      "doi": ""
    },
    {
      "text": "Rajan Vaish, Keith Wyngarden, Jingshu Chen, Brandon Cheung, and Michael S. Bernstein. 2014. Twitch Crowdsourcing: Crowd Contributions in Short Bursts of Time. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). ACM, New York, NY, USA, 3645–3654. https://doi.org/10.1145/2556288.2556996",
      "doi": "10.1145/2556288.2556996"
    },
    {
      "text": "Max G. Van Kleek, Wolfe Styke, m.c. schraefel, and David Karger. 2011. Finders/Keepers: A Longitudinal Study of People Managing Information Scraps in a Micro-note Tool. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). ACM, New York, NY, USA, 2907–2916. https://doi.org/10.1145/1978942.1979374",
      "doi": "10.1145/1978942.1979374"
    },
    {
      "text": "Danniel Varona-Marin. 2016. The Lifecycle of a Whiteboard Photo: Post-meeting Usage of Whiteboard Content Captured with Mobile Devices. Master’s thesis. University of Waterloo.",
      "doi": ""
    },
    {
      "text": "Noshccn Fatima Warraich, Irfan Ali, and Shazia Yasmeen. 2018. Keeping Found Things Found: Challenges and Usefulness of Personal Information Management among Academicians. Information and Learning Sciences 119, 12 (2018), 712–720.",
      "doi": ""
    },
    {
      "text": "Steve Whittaker, Ofer Bergman, and Paul Clough. 2010. Easy on That Trigger Dad: A Study of Long Term Family Photo Retrieval. Personal & Ubiquitous Computing 14, 1 (Jan. 2010), 31–43. https://doi.org/10.1007/s00779-009-0218-7",
      "doi": "10.1007/s00779-009-0218-7"
    },
    {
      "text": "Alex C Williams, Harmanpreet Kaur, Shamsi Iqbal, Ryen W White, Jaime Teevan, and Adam Fourney. 2019. Mercury: Empowering Programmers’ Mobile Work Practices with Microproductivity. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology.ACM Press. https://doi. org/10.1145/3332165.3347932",
      "doi": "10.1145/3332165.3347932"
    },
    {
      "text": "Ron Yeh, Chunyuan Liao, Scott Klemmer, François Guimbretière, Brian Lee, Boyko Kakaradov, Jeannie Stamberger, and Andreas Paepcke. 2006. ButterflyNet: A Mobile Capture and Access System for Field Biology Research. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’06). 571–580.",
      "doi": "10.1145/1124772.1124859"
    },
    {
      "text": "Pengyi Zhang and Chang Liu. 2015. Personal Information Management Practices of Chinese College Students on Their Smartphones. In Proceedings of the Third International Symposium of Chinese CHI (Seoul, Republic of Korea) (Chinese CHI ’15). ACM, New York, NY, USA, 47–51. https://doi.org/10.1145/2739999.2740007",
      "doi": "10.1145/2739999.2740007"
    },
    {
      "text": "Xenia Zürn, Mendel Broekhuijsen, Doménique van Gennip, Saskia Bakker, Annemarie Zijlema, and Elise van den Hoven. 2019. Stimulating Photo Curation on Smartphones. In Proceedings of the 2019 Conference on Human Information Interaction and Retrieval (Glasgow, Scotland UK) (CHIIR ’19). ACM, New York, NY, USA, 255–259. https://doi.org/10.1145/3295750.3298947",
      "doi": "10.1145/3295750.3298947"
    }
  ]
}