{
  "doi": "10.1145/3411764.3445358",
  "title": "Improving Viewing Experiences of First-Person Shooter Gameplays with Automatically-Generated Motion Effects",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "In recent times, millions of people enjoy watching video gameplays at an eSports stadium or home. We seek a method that improves gameplay spectator or viewer experiences by presenting multisensory stimuli. Using a motion chair, we provide the motion effects automatically generated from the audiovisual stream to the viewers watching a first-person shooter (FPS) gameplay. The motion effects express the game character’s movement and gunfire action. We describe algorithms for the computation of such motion effects developed using computer vision techniques and deep learning. By a user study, we demonstrate that our method of providing motion effects significantly improves the viewing experiences of FPS gameplay. The contributions of this paper are with the motion synthesis algorithms integrated for FPS games and the empirical evidence for the benefits of experiencing multisensory gameplays.",
  "tags": [
    "viewing experience",
    "motion effect",
    "automatic generation",
    "gameplay",
    "game"
  ],
  "authors": [
    {
      "name": "Gyeore Yun",
      "institution": "Computer Science & Engineering / POSTECH / Haptics and Virtual Reality POSTECH, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367061",
      "orcid": "0000-0002-4332-596X"
    },
    {
      "name": "Hyoseung Lee",
      "institution": "Department of Computer Science and Engineering POSTECH, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659701146",
      "orcid": "missing"
    },
    {
      "name": "Sangyoon Han",
      "institution": "Pohang University of Science and Technology (POSTECH), Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261398",
      "orcid": "0000-0003-1969-0235"
    },
    {
      "name": "Seungmoon Choi",
      "institution": "Computer Science and Engineering / Haptics and Virtual Reality Laboratory Pohang University of Science and Technology (POSTECH), Korea, Republic of",
      "img": "/do/10.1145/contrib-81100480604/rel-imgonly/bio_seungmoonchoi.jpg",
      "acmid": "81100480604",
      "orcid": "0000-0002-5889-1083"
    }
  ],
  "references": [
    {
      "text": "CJ 4DPLEX. 2020. What is 4DX: Motion seat & signature effects. Retrieved Sep. 16, 2020 from https://www.cj4dx.com/aboutus/aboutus.php",
      "doi": ""
    },
    {
      "text": "D. Ablart, C. Velasco, and M. Obrist. 2017. Integrating mid-air haptics into movie experiences. In Proceedings of the 4th ACM International Conference on Interactive Experiences for TV and Online Video. ACM, New York, NY, USA, 77–84.",
      "doi": ""
    },
    {
      "text": "Akshita, H. Alagarai Sampath, I. Bipin, E. Lee, and Y. Bae. 2015. Towards multimodal affective feedback: Interaction between visual and haptic modalities. In Proceedings of the 33rd CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2043–2052.",
      "doi": ""
    },
    {
      "text": "BANDAI NAMCO Amusement. 2020. VR Zone. Retrieved Sep. 15, 2020 from https://vrzone-pic.com/",
      "doi": ""
    },
    {
      "text": "Y. Arslan. 2017. Impulsive sound detection by a novel energy formula and its usage for gunshot recognition. (Jun 2017). arXiv:1706.08759 [cs.SD]",
      "doi": ""
    },
    {
      "text": "F. Aurino, M. Folla, F. Gargiulo, V. Moscato, A. Picariello, and C. Sansone. 2014. One-class SVM based approach for detecting anomalous audio events. In Proceedings of the 6th International Conference on Intelligent Networking and Collaborative Systems. IEEE, New York, NY, USA, 145–151.",
      "doi": ""
    },
    {
      "text": "Blooloop. 2019. Dolby Atmos will immerse guests in sound at new Hollywood Esports MX4D Theatre from MediaMation. Retrieved July 26, 2020 from https://blooloop.com/news/dolby-atmos-hollywood-esports-mx4d-theatre/",
      "doi": ""
    },
    {
      "text": "Blooloop. 2019. MediaMation expands MX4D on five continents. Retrieved July 26, 2020 from https://blooloop.com/news/mediamation-expands-mx4d-five-continents/",
      "doi": ""
    },
    {
      "text": "E. Cakir, T. Heittola, H. Huttunen, and T. Virtanen. 2015. Polyphonic sound event detection using multi label deep neural networks. In Proceedings of the 27th International Joint Conference on Neural Networks. IEEE, New York, NY, USA, 1–7.",
      "doi": ""
    },
    {
      "text": "E. Cakir, G. Parascandolo, T. Heittola, H. Huttunen, and T. Virtanen. 2017. Convolutional recurrent neural networks for polyphonic sound event detection. IEEE/ACM Transactions on Audio, Speech, and Language Processing 25, 6(2017), 1291–1303.",
      "doi": "10.1109/TASLP.2017.2690575"
    },
    {
      "text": "S. Charleer, K. Gerling, F. Gutiérrez, H. Cauwenbergh, B. Luycx, and K. Verbert. 2018. Real-time dashboards to support esports spectating. In Proceedings of the 5th Annual Symposium on Computer-Human Interaction in Play. ACM, New York, NY, USA, 59–71.",
      "doi": ""
    },
    {
      "text": "G. Cheung and J. Huang. 2011. Starcraft from the stands: Understanding the game spectator. In Proceedings of the 30th CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 763–772.",
      "doi": ""
    },
    {
      "text": "CJ. 2019. CGV 4DX surpasses 700 locations worldwide. Retrieved July 26, 2020 from http://english.cj.net/cj_now/view.asp?bs_seq=14331&schBsTp=1&schTxt=",
      "doi": ""
    },
    {
      "text": "Wikipedia contributors. 2020. D-Box Technologies. Retrieved July 26, 2020 from https://en.wikipedia.org/w/index.php?title=Plagiarism&oldid=5139350",
      "doi": ""
    },
    {
      "text": "A. Covaci, L. Zou, I. Tal, G. Muntean, and G. Ghinea. 2018. Is multimedia multisensorial? - A review of mulsemedia systems. Comput. Surveys 51, 5 (2018), 35.",
      "doi": ""
    },
    {
      "text": "F. Danieau, J. Bernon, J. Fleureau, P. Guillotel, N. Mollet, M. Christie, and A. Lécuyer. 2013. H-Studio: An authoring tool for adding haptic and motion effects to audiovisual content. In Proceedings of the 26th ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 83–84.",
      "doi": ""
    },
    {
      "text": "J. Duchi, E. Hazan, and Y. Singer. 2011. Adaptive subgradient methods for online learning and stochastic optimization.Journal of Machine Learning Research 12, 7 (2011), 2121 – 2159.",
      "doi": ""
    },
    {
      "text": "A. Dufaux, L. Besacier, M. Ansorge, and F. Pellandini. 2000. Automatic sound detection and recognition for noisy environment. In Proceedings of the 10th European Signal Processing Conference. IEEE, New York, NY, USA, 1–4.",
      "doi": ""
    },
    {
      "text": "BLIZZARD ENTERTAINMENT. 2020. McCree. Retrieved Sep. 16, 2020 from https://playoverwatch.com/en-us/heroes/mccree/",
      "doi": ""
    },
    {
      "text": "BLIZZARD ENTERTAINMENT. 2020. Overwatch. GAME.",
      "doi": ""
    },
    {
      "text": "M. Feng, A. Dey, and R. W. Lindeman. 2016. An initial exploration of a multi-sensory design space: Tactile support for walking in immersive virtual environments. In Proceedings of the 11th 2016 IEEE Symposium on 3D User Interfaces. IEEE, New York, NY, USA, 95–104.",
      "doi": ""
    },
    {
      "text": "M. Feng, R. W. Lindeman, H. Abdel-Moati, and J. C. Lindeman. 2015. Haptic chairIO: A system to study the effect of wind and floor vibration feedback on spatial orientation in VEs. In Proceedings of the 10th IEEE Symposium on 3D User Interfaces. IEEE, New York, NY, USA, 149–150.",
      "doi": ""
    },
    {
      "text": "G. Freeman and D. Y. Wohn. 2017. eSports as an emerging research context at CHI. In Proceedings of the 36th CHI Conference Extended Abstracts on Human Factors in Computing Systems. IEEE, New York, NY, USA, 1601–1608.",
      "doi": "10.1145/3027063.3053158"
    },
    {
      "text": "L. Gerosa, G. Valenzise, M. Tagliasacchi, F. Antonacci, and A. Sarti. 2007. Scream and gunshot detection in noisy environments. In Proceedings of the 15th European Signal Processing Conference. IEEE, New York, NY, USA, 1216–1220.",
      "doi": ""
    },
    {
      "text": "G. Ghinea, C. Timmerer, W. Lin, and S. R. Gulliver. 2014. Mulsemedia: State of the art, perspectives, and challenges. ACM Transactions on Multimedia Computing Communications, and Applications 11, 1s(2014), 1–23.",
      "doi": "10.1145/2617994"
    },
    {
      "text": "D. Gongora, H. Nagano, M. Konyo, and S. Tadokoro. 2017. Vibrotactile rendering of camera motion for bimanual experience of first-person view videos. In Proceedings of the 7th IEEE World Haptics Conference. IEEE, New York, NY, USA, 454–459.",
      "doi": ""
    },
    {
      "text": "F. E. Guedry. 1974. Vestibular system part 2: Psychophysics, applied aspects and general interpretations. Springer, Berlin, Heidelberg. 3–154 pages.",
      "doi": ""
    },
    {
      "text": "Juho. Hamari and Max Sjöblom. 2017. What is eSports and why do people watch it?Internet Research 27, 2 (2017), 211–232.",
      "doi": ""
    },
    {
      "text": "I. Hwang and S. Choi. 2014. Improved haptic music player with auditory saliency estimation. In Proceedings of the 9th EuroHaptics: International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, Berlin, Heidelberg, 232–240.",
      "doi": ""
    },
    {
      "text": "Y. Ikei, S. Shimabukuro, S. Kato, Y. Okuya, K. Abe, K. Hirota, and T. Amemiya. 2014. Rendering of virtual walking sensation by a passive body motion. In Proceedings of the 9th EuroHaptics: International Conference on Human Haptic Sensing and Touch Enabled Computer Applications. Springer, Berlin, Heidelberg, 150–157.",
      "doi": ""
    },
    {
      "text": "S. Ioffe and C. Szegedy. 2015. Batch normalization: Accelerating deep network training by reducing internal covariate shift. (Feb 2015). arXiv:1502.03167 [cs.LG]",
      "doi": ""
    },
    {
      "text": "A. Israr and I. Poupyrev. 2011. Tactile brush: Drawing on skin with a tactile grid display. In Proceedings of the 30th CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2019–2028.",
      "doi": ""
    },
    {
      "text": "M. Kaytoue, A. Silva, L. Cerf, W. Meira, and C. Raïssi. 2012. Watch me playing, I am a professional: A first study on video game live streaming. In Proceedings of the 21st International Conference on World Wide Web. ACM, New York, NY, USA, 1181–1188.",
      "doi": ""
    },
    {
      "text": "M. Kim, S. Lee, and S. Choi. 2014. Saliency-driven real-time video-to-tactile translation. IEEE Transactions on Haptics 7, 3 (2014), 394–404.",
      "doi": ""
    },
    {
      "text": "S. Kim. 2013. Authoring multisensorial content. Signal Processing: Image Communication 28, 2 (2013), 162 – 167.",
      "doi": "10.1016/j.image.2012.10.011"
    },
    {
      "text": "J. Lee and S. Choi. 2012. Evaluation of vibrotactile pattern design using vibrotactile score. In Proceedings of the 7th IEEE Haptics Symposium. IEEE, New York, NY, USA, 231–238.",
      "doi": ""
    },
    {
      "text": "J. Lee and S. Choi. 2013. Real-time perception-level translation from audio signals to vibrotactile effects. In Proceedings of the 32nd CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2567–2576.",
      "doi": ""
    },
    {
      "text": "J. Lee, B. Han, and S. Choi. 2016. Interactive motion effects design for a moving object in 4D films. In Proceedings of the 22nd ACM Conference on Virtual Reality Software and Technology. ACM, New York, NY, USA, 219–228.",
      "doi": ""
    },
    {
      "text": "J. Lee, B. Han, and S. Choi. 2016. Motion effects synthesis for 4D films. IEEE Transactions on Visualization and Computer Graphics 22, 10(2016), 2300–2314.",
      "doi": "10.1109/TVCG.2015.2507591"
    },
    {
      "text": "J. Lee, J. Ryu, and S. Choi. 2009. Vibrotactile score: A score metaphor for designing vibrotactile patterns. In Proceedings of the 3rd World Haptics Conference. IEEE, New York, NY, USA, 302–307.",
      "doi": ""
    },
    {
      "text": "J. Li, W. Dai, F. Metze, S. Qu, and S. Das. 2017. A comparison of deep learning methods for environmental sound detection. In Proceedings of the 42nd IEEE International Conference on Acoustics, Speech and Signal Processing. IEEE, New York, NY, USA, 126–130.",
      "doi": ""
    },
    {
      "text": "A. Medhekar, V. Chiluka, and A. Patait. 2019. An introduction to the NVIDIA optical flow SDK. Retrieved Sep. 11, 2020 from https://developer.nvidia.com/blog/opencv-optical-flow-algorithms-with-nvidia-turing-gpus/",
      "doi": ""
    },
    {
      "text": "MediaMation. [n.d.]. MX4D esports EFX theaters: The worlds first motion esports 4D theater network. http://mx-4d.com/esports",
      "doi": ""
    },
    {
      "text": "D. Merrill, H. Raffle, and R. Aimi. 2008. The sound of touch: Physical manipulation of digital sound. In Proceedings of the 27th CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 739–742.",
      "doi": ""
    },
    {
      "text": "I. Miranda and A. Lima. 2017. Impulsive sound detection directly in sigma-delta domain. Archives of Acoustics 42, 2 (2017), 255–261.",
      "doi": ""
    },
    {
      "text": "F. F. Mueller, R. Byrne, J. Andres, and R. Patibanda. 2018. Experiencing the body as play. In Proceedings of the 37th CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Paper No. 210, 1–13.",
      "doi": ""
    },
    {
      "text": "M. A. Nahon and L. D. Reid. 1990. Simulator motion-drive algorithms: A designer’s perspective. Journal of Guidance, Control, and Dynamics 13, 2 (1990), 356–362.",
      "doi": ""
    },
    {
      "text": "S. Nanayakkara, E. Taylor, L. Wyse, and S. H. Ong. 2009. An enhanced musical experience for the deaf: Design and evaluation of a music display and a haptic chair. In Proceedings of the 28th CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 337–346.",
      "doi": "10.1145/1518701.1518756"
    },
    {
      "text": "G. Park and S. Choi. 2018. Tactile information transmission by 2D stationary phantom sensations. In Proceedings of the 37th CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Paper No. 258, 1–12.",
      "doi": ""
    },
    {
      "text": "A. Pikrakis, T. Giannakopoulos, and S. Theodoridis. 2008. Gunshot detection in audio streams from movies by means of dynamic programming and Bayesian networks. In Proceedings of the 33rd IEEE International Conference on Acoustics, Speech and Signal Processing. IEEE, New York, NY, USA, 21–24.",
      "doi": ""
    },
    {
      "text": "S. U. Rehman, J. Sun, L. Liu, and H. Li. 2008. Turn your mobile into the ball: Rendering live football game using vibration. IEEE Transactions on Multimedia 10, 6 (2008), 1022–1033.",
      "doi": "10.1109/TMM.2008.2001352"
    },
    {
      "text": "E. Rosten and T. Drummond. 2006. Machine learning for high-speed corner detection. In Proceedings of the 9th European Conference on Computer Vision. Springer, Berlin, Heidelberg, 430–443.",
      "doi": ""
    },
    {
      "text": "O. S. Schneider, A. Israr, and K. E. MacLean. 2015. Tactile animation by direct manipulation of grid displays. In Proceedings of the 28th Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 21–30.",
      "doi": "10.1145/2807442.2807470"
    },
    {
      "text": "O. S. Schneider and K. E. MacLean. 2016. Studying design process and example use with Macaron, a web-based vibrotactile effect editor. In Proceedings of the 9th IEEE Haptics Symposium. IEEE, New York, NY, USA, 52–58.",
      "doi": ""
    },
    {
      "text": "J. Seo, S. Mun, J. Lee, and S. Choi. 2018. Substituting motion effects with vibrotactile effects for 4D experiences. In Proceedings of the 37th CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, Paper No. 428, 1–6.",
      "doi": ""
    },
    {
      "text": "J. Seo, R. H. Osgouei, S. Chung, and S. Choi. 2016. Vibrotactile rendering of gunshot events for 4D films. In Proceedings of the 25th IEEE Haptics Symposium, Vol. 2. IEEE, New York, NY, USA, 384–386.",
      "doi": ""
    },
    {
      "text": "S. Shin, K. Ha, H. Yun, and Y. Nam. 2016. Realistic media authoring tool based on MPEG-V international standard. In Proceedings of the 8th International Conference on Ubiquitous and Future Networks. IEEE, New York, NY, USA, 730–732.",
      "doi": ""
    },
    {
      "text": "S. Shin, B. Yoo, and S. Han. 2014. A framework for automatic creation of motion effects from theatrical motion pictures. Multimedia Systems 20, 3 (2014), 327–346.",
      "doi": "10.1007/s00530-013-0322-4"
    },
    {
      "text": "Y. Sulema. 2016. Mulsemedia vs. multimedia: State of the art and future trends. In Proceedings of the 2016 International Conference on Systems, Signals and Image Processing. IEEE, New York, NY, USA, 1–5.",
      "doi": ""
    },
    {
      "text": "A. Tanaka and A. Parkinson. 2016. Haptic wave: A cross-modal interface for visually impaired audio producers. In Proceedings of the 35th CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 2150–2161.",
      "doi": ""
    },
    {
      "text": "B. S. Tekin and S. Reeves. 2017. Ways of spectating: Unravelling spectator participation in kinect play. In Proceedings of the 36th CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA, 1558–1570.",
      "doi": ""
    },
    {
      "text": "B. Uzkent, B. Barkana, and H. Cevikalp. 2012. Non-speech environmental sound classification using SVMs with a new set of features. International Journal of Innovative Computing, Information and Control 8, 5(2012), 3511–3524.",
      "doi": ""
    },
    {
      "text": "M. Werlberger, W. Trobin, T. Pock, A. Wedel, D. Cremers, and H. Bischof. 2009. Anisotropic Huber-L1 optical flow. In Proceedings of the 23rd British Machine Vision Conference. BMVA Press, Durham, UK, 1–7.",
      "doi": ""
    },
    {
      "text": "Y. Yoo, I. Hwang, and S. Choi. 2014. Consonance of vibrotactile chords. IEEE Transactions on Haptics 7, 1 (2014), 3–13.",
      "doi": "10.1109/TOH.2013.57"
    },
    {
      "text": "K. Yoshida, S. Inoue, Y. Makino, and H. Shinoda. 2017. VibVid: VIBration Estimation from VIDeo by using neural network. In Proceedings of the 27th International Conference on Artificial Reality and Telexistence and 22nd Eurographics Symposium on Virtual Environments. Eurographics Association, Goslar, DEU, 37–44.",
      "doi": ""
    },
    {
      "text": "G. Yun, S. Oh, and S. Choi. 2019. Seamless phantom sensation moving across a wide range of body. In Proceedings of the 8th IEEE World Haptics Conference. IEEE, New York, NY, USA, 616–621.",
      "doi": ""
    },
    {
      "text": "S. Zhao, O. Schneider, R. Klatzky, J. Lehman, and A. Israr. 2014. FeelCraft: Crafting tactile experiences for media using a feel effect library. In Proceedings of the Adjunct Publication of the 27th Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 51–52.",
      "doi": ""
    },
    {
      "text": "K. Łopatka, J. Kotus, and A. Czyżewski. 2016. Detection, classification and localization of acoustic events in the presence of background noise for acoustic surveillance of hazardous situations. Multimedia Tools and Applications 75, 17 (2016), 10407–10439.",
      "doi": "10.1007/s11042-015-3105-4"
    }
  ]
}