{
  "doi": "10.1145/3411764.3445550",
  "title": "The Labor of Fun: Understanding the Social Relationships between Gamers and Paid Gaming Teammates in China",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2021,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Online video games support the development of social relationships through gameplay, however, gamers often cannot cultivate and maintain relationships based on social factors such as personality when using in-game matchmaking services. To address this, teammate matching sites external to games have emerged and enable gamers to offer to play games with others in exchange for payment. The affordances of these services are different from other existing gamer social sites, e.g., live streaming. Interviews were conducted with 16 dedicated users on Bixin, one of China’s largest paid teammate matching sites, to examine user motivations, practices, and perceptions. The interviews found that gamers selected paid teammates on Bixin using different criteria compared to in-game matchmaking services and emphasized the importance of real-life characteristics such as voice. To maintain connections, paid teammates often also extended communication to external communication services such as WeChat. Although most gamers expected to communicate with paid teammates as if they were friends, very few reported building real friendships with their matched counterparts.",
  "tags": [
    "online community",
    "gamers",
    "social relationships",
    "gaming",
    "social media",
    "social networking"
  ],
  "authors": [
    {
      "name": "Chenxinran Shen",
      "institution": "Department of Computer Science University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659699000",
      "orcid": "missing"
    },
    {
      "name": "Zhicong Lu",
      "institution": "Department of Computer Science University of Toronto, Canada",
      "img": "/do/10.1145/contrib-99659162049/rel-imgonly/photo.jpg",
      "acmid": "99659162049",
      "orcid": "0000-0002-7761-6351"
    },
    {
      "name": "Travis Faas",
      "institution": "School of Informatics and Computing Indiana University - Purdue University Indianapolis, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81444600503",
      "orcid": "missing"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "Department of Computer Science University of Toronto, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    }
  ],
  "references": [
    {
      "text": "John A Bargh, Katelyn YA McKenna, and Grainne M Fitzsimons. 2002. Can you see the real me? Activation and expression of the “true self” on the Internet. Journal of social issues 58, 1 (2002), 33–48.",
      "doi": ""
    },
    {
      "text": "Natalya N Bazarova. 2012. Public intimacy: Disclosure interpretation and social judgments on Facebook. Journal of Communication 62, 5 (2012), 815–832.",
      "doi": ""
    },
    {
      "text": "Natalya N Bazarova and Yoon Hyung Choi. 2014. Self-disclosure in social media: Extending the functional approach to disclosure motivations and characteristics on social network sites. Journal of Communication 64, 4 (2014), 635–657.",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti, Alexander Ambard, Daniel Turner, Christina Gossmann, Kamila Demkova, and John M Carroll. 2015. A muddle of models of motivation for using peer-to-peer economy systems. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. 1085–1094.",
      "doi": "10.1145/2702123.2702272"
    },
    {
      "text": "R Bostman and Roo Rogers. 2011. What’s mine is yours. How collaborative consumption is changing the way we live. London: Collins (2011).",
      "doi": ""
    },
    {
      "text": "Danah Boyd. 2014. It’s complicated: The social lives of networked teens. Yale University Press.",
      "doi": "10.5555/2584525"
    },
    {
      "text": "Mark G Chen. 2009. Communication, coordination, and camaraderie in World of Warcraft. Games and Culture 4, 1 (2009), 47–73.",
      "doi": ""
    },
    {
      "text": "Helena Cole and Mark D Griffiths. 2007. Social interactions in massively multiplayer online role-playing gamers. Cyberpsychology & behavior 10, 4 (2007), 575–583.",
      "doi": ""
    },
    {
      "text": "Nancy L Collins and Lynn Carol Miller. 1994. Self-disclosure and liking: a meta-analytic review.Psychological bulletin 116, 3 (1994), 457.",
      "doi": ""
    },
    {
      "text": "Ed Collom. 2007. The motivations, engagement, satisfaction, outcomes, and demographics of time bank participants: survey findings from a US system. international Journal of Community Currency research 11, 1 (2007), 36–83.",
      "doi": ""
    },
    {
      "text": "Ed Collom. 2011. Motivations and differential participation in a community currency system: The dynamics within a local social movement organization 1. In Sociological Forum, Vol. 26. Wiley Online Library, 144–168.",
      "doi": ""
    },
    {
      "text": "Laura A Dabbish. 2008. Jumpstarting relationships with online games: evidence from a laboratory investigation. In Proceedings of the 2008 ACM conference on Computer supported cooperative work. 353–356.",
      "doi": "10.1145/1460563.1460620"
    },
    {
      "text": "You Cheng Shi Dai. 2019. Revealed by a past paid teammate: many gamers use it for sex services. https://www.huxiu.com/article/272017.html",
      "doi": ""
    },
    {
      "text": "Valerian J Derlega, Barbara A Winstead, and Kathryn Greene. 2008. Self-disclosure and starting a close relationship.(2008).",
      "doi": ""
    },
    {
      "text": "Tawanna R. Dillahunt and Amelia R. Malone. 2015. The Promise of the Sharing Economy among Disadvantaged Communities. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 2285–2294. https://doi.org/10.1145/2702123.2702189",
      "doi": "10.1145/2702123.2702189"
    },
    {
      "text": "Tawanna R Dillahunt, Xinyi Wang, Earnest Wheeler, Hao Fei Cheng, Brent Hecht, and Haiyi Zhu. 2017. The sharing economy in computing: A systematic literature review. Proceedings of the ACM on Human-Computer Interaction 1, CSCW(2017), 1–26.",
      "doi": "10.1145/3134673"
    },
    {
      "text": "Judith S Donath. 2007. Social Signals in Supernets. J. of Computer-Mediated Communication 13, 1 (2007).",
      "doi": "10.1111/j.1083-6101.2007.00394.x"
    },
    {
      "text": "Nicole Ellison, Rebecca Heino, and Jennifer Gibbs. 2017. Managing Impressions Online: Self-Presentation Processes in the Online Dating Environment. Journal of Computer-Mediated Communication 11, 2 (07 2017), 415–441. https://doi.org/10.1111/j.1083-6101.2006.00020.xarXiv:https://academic.oup.com/jcmc/article-pdf/11/2/415/22317530/jjcmcom0415.pdf",
      "doi": ""
    },
    {
      "text": "Nicole B Ellison and Jeffrey T Hancock. 2013. Profile as promise: Honest and deceptive signals in online dating. IEEE Security & Privacy 11, 5 (2013), 84–88.",
      "doi": "10.1109/MSP.2013.120"
    },
    {
      "text": "Nielsen Interactive Entertainment. 2005. Video gamers in Europe–2005. Prepared for the Interactive Software Federation of Europe (2005).",
      "doi": ""
    },
    {
      "text": "Lisa Gansky. 2010. The mesh: Why the future of business is sharing. Penguin.",
      "doi": ""
    },
    {
      "text": "Erving Goffman 1978. The presentation of self in everyday life. Harmondsworth London.",
      "doi": ""
    },
    {
      "text": "Jeffrey T Hancock, Jennifer Thom-Santelli, and Thompson Ritchie. 2004. Deception and design: The impact of communication technology on lying behavior. In Proceedings of the SIGCHI conference on Human factors in computing systems. 129–134.",
      "doi": "10.1145/985692.985709"
    },
    {
      "text": "Jeffrey T Hancock and Catalina L Toma. 2009. Putting your best face forward: The accuracy of online dating photographs. Journal of Communication 59, 2 (2009), 367–386.",
      "doi": ""
    },
    {
      "text": "Bernie Hogan. 2010. The presentation of self in the age of social media: Distinguishing performances and exhibitions online. Bulletin of Science, Technology & Society 30, 6 (2010), 377–386.",
      "doi": ""
    },
    {
      "text": "Erin E Hollenbaugh and Marcia K Everett. 2013. The effects of anonymity on self-disclosure in blogs: An application of the online disinhibition effect. Journal of Computer-Mediated Communication 18, 3 (2013), 283–302.",
      "doi": ""
    },
    {
      "text": "Tapio Ikkala and Airi Lampinen. 2015. Monetizing Network Hospitality: Hospitality and Sociability in the Context of Airbnb. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 1033–1044. https://doi.org/10.1145/2675133.2675274",
      "doi": "10.1145/2675133.2675274"
    },
    {
      "text": "Jeroen Jansz and Lonneke Martens. 2005. Gaming at a LAN event: the social context of playing video games. New media & society 7, 3 (2005), 333–355.",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Laura Dabbish, and Katherine Sutton. 2016. Strangers on your phone: Why people use anonymous communication applications. In Proceedings of the 19th ACM conference on computer-supported cooperative work & social computing. 359–370.",
      "doi": "10.1145/2818048.2820081"
    },
    {
      "text": "Christopher Koopman, Matthew Mitchell, and Adam Thierer. 2014. The sharing economy and consumer protection regulation: The case for policy change. J. Bus. Entrepreneurship & L. 8 (2014), 529.",
      "doi": ""
    },
    {
      "text": "Noam Lapidot-Lefler and Azy Barak. 2012. Effects of anonymity, invisibility, and lack of eye-contact on toxic online disinhibition. Computers in human behavior 28, 2 (2012), 434–443.",
      "doi": ""
    },
    {
      "text": "Danielle M Law, Jennifer D Shapka, Shelley Hymel, Brent F Olson, and Terry Waterhouse. 2012. The changing face of bullying: An empirical comparison between traditional and internet bullying and victimization. Computers in Human Behavior 28, 1 (2012), 226–232.",
      "doi": "10.1016/j.chb.2011.09.004"
    },
    {
      "text": "Junfeng Liao, Shuhua Li, and Tiange Chen. 2017. Research on TPB model for participating behavior in sharing economy. In Proceedings of the 2017 International Conference on Management Engineering, Software Engineering and Service Sciences. 306–310.",
      "doi": "10.1145/3034950.3034999"
    },
    {
      "text": "Zhicong Lu, Michelle Annett, and Daniel Wigdor. 2019. Vicariously experiencing it all without going outside: A study of outdoor livestreaming in China. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 1–28.",
      "doi": "10.1145/3359127"
    },
    {
      "text": "Xiao Ma, Nazanin Andalibi, Louise Barkhuus, and Mor Naaman. 2017. ” People Are Either Too Fake or Too Real” Opportunities and Challenges in Tie-Based Anonymity. In Proceedings of the 2017 CHI conference on human factors in computing systems. 1781–1793.",
      "doi": "10.1145/3025453.3025956"
    },
    {
      "text": "Xiao Ma, Jeffery T Hancock, Kenneth Lim Mingjie, and Mor Naaman. 2017. Self-disclosure and perceived trustworthiness of Airbnb host profiles. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 2397–2409.",
      "doi": "10.1145/2998181.2998269"
    },
    {
      "text": "Regan L. Mandryk, M. Stella Atkins, and Kori M. Inkpen. 2006. A Continuous and Objective Evaluation of Emotional Experience with Interactive Play Environments. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Montréal, Québec, Canada) (CHI ’06). Association for Computing Machinery, New York, NY, USA, 1027–1036. https://doi.org/10.1145/1124772.1124926",
      "doi": "10.1145/1124772.1124926"
    },
    {
      "text": "Tony Manninen. 2003. Interaction forms and communicative actions in multiplayer games. Game studies 3, 1 (2003), 2003.",
      "doi": ""
    },
    {
      "text": "Christina Masden and W. Keith Edwards. 2015. Understanding the Role of Community in Online Dating. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 535–544. https://doi.org/10.1145/2702123.2702417",
      "doi": "10.1145/2702123.2702417"
    },
    {
      "text": "Martin Matzner, Friedrich Chasin, and Lydia Todenhöfer. 2015. To share or not to share: Towards understanding the antecedents of participation in IT-enabled sharing services. (2015).",
      "doi": ""
    },
    {
      "text": "Mareike Möhlmann. 2015. Collaborative consumption: determinants of satisfaction and the likelihood of using a sharing economy option again. Journal of Consumer Behaviour 14, 3 (2015), 193–207.",
      "doi": ""
    },
    {
      "text": "Bonnie Nardi and Justin Harris. 2006. Strangers and friends: Collaborative play in World of Warcraft. In Proceedings of the 2006 20th anniversary conference on Computer supported cooperative work. 149–158.",
      "doi": "10.1145/1180875.1180898"
    },
    {
      "text": "Tyler Pace, Shaowen Bardzell, and Jeffrey Bardzell. 2010. The rogue in the lovely black dress: intimacy in world of warcraft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 233–242.",
      "doi": "10.1145/1753326.1753361"
    },
    {
      "text": "Malcolm R Parks and Lynne D Roberts. 1998. Making MOOsic’: The development of personal relationships on line and a comparison to their off-line counterparts. Journal of social and personal relationships 15, 4(1998), 517–537.",
      "doi": ""
    },
    {
      "text": "James W Pennebaker. 1997. Opening up: The healing power of expressing emotions. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Patrick C. Shih, Victoria Bellotti, Kyungsik Han, and John M. Carroll. 2015. Unequal Time for Unequal Value: Implications of Differing Motivations for Participation in Timebanking. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1075–1084. https://doi.org/10.1145/2702123.2702560",
      "doi": "10.1145/2702123.2702560"
    },
    {
      "text": "Michael Spence. 2002. Signaling in retrospect and the informational structure of markets. American Economic Review 92, 3 (2002), 434–459.",
      "doi": ""
    },
    {
      "text": "Emmi Suhonen, Airi Lampinen, Coye Cheshire, and Judd Antin. 2010. Everyday favors: a case study of a local online gift exchange system. In Proceedings of the 16th ACM international conference on Supporting group work. 11–20.",
      "doi": "10.1145/1880071.1880074"
    },
    {
      "text": "John Suler. 2004. The online disinhibition effect. Cyberpsychology & behavior 7, 3 (2004), 321–326.",
      "doi": ""
    },
    {
      "text": "Andrzej Szymkowiak and Elżbieta Żelichowska. 2019. Factors affecting car-sharing and participation in the sharing economy. Annales Universitatis Mariae Curie-Skłodowska, sectio H–Oeconomia 53, 2 (2019), 99–108.",
      "doi": ""
    },
    {
      "text": "Catalina Toma. 2006. An Examination of Deceptive Self-Presentation in Online Dating Profiles. (2006).",
      "doi": ""
    },
    {
      "text": "Iis P Tussyadiah. 2015. An exploratory study on drivers and deterrents of collaborative consumption in travel. In Information and communication technologies in tourism 2015. Springer, 817–830.",
      "doi": ""
    },
    {
      "text": "Iis P Tussyadiah and Juho Pesonen. 2016. Impacts of peer-to-peer accommodation use on travel patterns. Journal of Travel Research 55, 8 (2016), 1022–1040.",
      "doi": ""
    },
    {
      "text": "Suvi Uski and Airi Lampinen. 2016. Social norms and self-presentation on social network sites: Profile work in action. New media & society 18, 3 (2016), 447–464.",
      "doi": ""
    },
    {
      "text": "PB Van de Glind. 2013. The consumer potential of Collaborative Consumption: Identifying the motives of Dutch Collaborative Consumers & Measuring the consumer potential of Collaborative Consumption within the municipality of Amsterdam. Master’s thesis.",
      "doi": ""
    },
    {
      "text": "Yan Xu, Xiang Cao, Abigail Sellen, Ralf Herbrich, and Thore Graepel. 2011. Sociable killers: understanding social relationships in an online first-person shooter game. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. 197–206.",
      "doi": "10.1145/1958824.1958854"
    },
    {
      "text": "Nick Yee, Nicolas Ducheneaut, Les Nelson, and Peter Likarish. 2011. Introverted Elves & Conscientious Gnomes: The Expression of Personality in World of Warcraft. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 753–762. https://doi.org/10.1145/1978942.1979052",
      "doi": "10.1145/1978942.1979052"
    }
  ]
}