{
  "doi": "10.1145/3411764.3445564",
  "title": "Engineering Multifunctional Spacer Fabrics Through Machine Knitting",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2021,
  "badges": [],
  "abstract": "Machine knitting is an increasingly accessible fabrication technology for producing custom soft goods. However, recent machine knitting research has focused on knit shaping, or on adapting hand-knitting patterns. We explore a capability unique to machine knitting: producing multilayer spacer fabrics. These fabrics consist of two face layers connected by a monofilament filler yarn which gives the structure stiffness and volume. We show how to vary knit patterning and yarn parameters in spacer fabrics to produce tactile materials with embedded functionality for forming soft actuated mechanisms and sensors with tunable density, stiffness, material bias, and bristle properties. These soft mechanisms can be rapidly produced on a computationally-controlled v-bed knitting machine and integrated directly into soft objects.",
  "authors": [
    {
      "name": "Lea Albaugh",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022012",
      "orcid": "0000-0001-7396-9507"
    },
    {
      "name": "James McCann",
      "institution": "Robotics Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81331499170/rel-imgonly/portrait.jpg",
      "acmid": "81331499170",
      "orcid": "0000-0002-4231-4142"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    },
    {
      "name": "Lining Yao",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261439",
      "orcid": "0000-0002-8842-2317"
    }
  ],
  "references": [
    {
      "text": "H.A. Abou-Taleb. 2014. Spacer Fabrics for Soft but Strong Knee Braces. Textile Asia 45 (Jan. 2014), 37–42.",
      "doi": ""
    },
    {
      "text": "Lea Albaugh, Scott Hudson, and Lining Yao. 2019. Digital Fabrication of Soft Actuated Objects by Machine Knitting. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, Glasgow, Scotland Uk, 1–13. https://doi.org/10.1145/3290605.3300414",
      "doi": "10.1145/3290605.3300414"
    },
    {
      "text": "M. P. Bendsøe. 1989. Optimal Shape Design as a Material Distribution Problem. Structural Optimization 1, 4 (Dec. 1989), 193–202. https://doi.org/10.1007/BF01650949",
      "doi": ""
    },
    {
      "text": "Zhiyong Chen, Ronghui Wu, Shihui Guo, Xiangyang Liu, Hongbo Fu, Xiaogang Jin, and Minghong Liao. 2020. 3D Upper Body Reconstruction with Sparse Soft Sensors. Soft Robotics 0, 0 (July 2020), soro.2019.0187. https://doi.org/10.1089/soro.2019.0187",
      "doi": ""
    },
    {
      "text": "Inrak Choi, Nick Corson, Lizzie Peiros, Elliot W. Hawkes, Sean Keller, and Sean Follmer. 2018. A Soft, Controllable, High Force Density Linear Brake Utilizing Layer Jamming. IEEE Robotics and Automation Letters 3, 1 (Jan. 2018), 450–457. https://doi.org/10.1109/LRA.2017.2761938",
      "doi": ""
    },
    {
      "text": "Mario de Araújo, Raul Fangueiro, André Catarino, and Hong Hu. 2001. Recent Developments in Weft-Knitting Science and Technology: The Way Ahead in the New Millennium. Revista Romana de Textile–Pielarie 1 (Jan. 2001), 61–66.",
      "doi": ""
    },
    {
      "text": "Hassan M. El-Dessouky and Mohamed N. Saleh. 2018. 3D Woven Composites: From Weaving to Manufacturing. In Recent Developments in the Field of Carbon Fibers, Rita Khanna and Romina Cayumil (Eds.). IntechOpen, Rijeka, Chapter 4, 51–66. https://doi.org/10.5772/intechopen.74311",
      "doi": ""
    },
    {
      "text": "M Glazzard. 2014. Re-Addressing the Role of Knitted Textile Design Knowledge: Auxetic Textiles from a Practice-Led, Designer-Maker Perspective. PhD Thesis. Nottingham Trent University.",
      "doi": ""
    },
    {
      "text": "Antonio Gomes, Andrea Nesbitt, and Roel Vertegaal. 2013. MorePhone: An Actuated Shape Changing Flexible Smartphone. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems(CHI EA ’13). Association for Computing Machinery, Paris, France, 2879–2880. https://doi.org/10.1145/2468356.2479558",
      "doi": ""
    },
    {
      "text": "Jun Gong, Yu Wu, Lei Yan, Teddy Seyed, and Xing-Dong Yang. 2019. Tessutivo: Contextual Interactions on Interactive Fabrics with Inductive Sensing. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(UIST ’19). Association for Computing Machinery, New York, NY, USA, 29–41. https://doi.org/10.1145/3332165.3347897",
      "doi": "10.1145/3332165.3347897"
    },
    {
      "text": "Theodore Gray and Nina Paley. 2015. Quantitative Stretching.",
      "doi": ""
    },
    {
      "text": "Anthony Grbic and George V. Eleftheriades. 2002. Experimental Verification of Backward-Wave Radiation from a Negative Refractive Index Metamaterial. Journal of Applied Physics 92, 10 (Nov. 2002), 5930–5935. https://doi.org/10.1063/1.1513194",
      "doi": ""
    },
    {
      "text": "Tobias Grosse-Puppendahl, Christian Holz, Gabe Cohn, Raphael Wimmer, Oskar Bechtold, Steve Hodges, Matthew S. Reynolds, and Joshua R. Smith. 2017. Finding Common Ground: A Survey of Capacitive Sensing in Human-Computer Interaction. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 3293–3315. https://doi.org/10.1145/3025453.3025808",
      "doi": "10.1145/3025453.3025808"
    },
    {
      "text": "Claire Harvey, Emily Holtzman, Joy Ko, Brooks Hagan, Rundong Wu, Steve Marschner, and David Kessler. 2019. Weaving Objects: Spatial Design and Functionality of 3D-Woven Textiles. Leonardo 52, 4 (Aug. 2019), 381–388. https://doi.org/10.1162/leon_a_01780",
      "doi": ""
    },
    {
      "text": "Megan Hofmann, Lea Albaugh, Ticha Sethapakadi, Jessica Hodgins, Scott E. Hudson, James McCann, and Jennifer Mankoff. 2019. KnitPicking Textures: Programming and Modifying Complex Knitted Textures for Machine and Hand Knitting. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology(UIST ’19). Association for Computing Machinery, New Orleans, LA, USA, 5–16. https://doi.org/10.1145/3332165.3347886",
      "doi": "10.1145/3332165.3347886"
    },
    {
      "text": "D. Holland, E. J. Park, P. Polygerinos, G. J. Bennett, and C. J. Walsh. 2014. Actuators | Soft Robotics Toolkit. https://softroboticstoolkit.com/actuators.",
      "doi": ""
    },
    {
      "text": "Cedric Honnet, Hannah Perner-Wilson, Marc Teyssier, Bruno Fruchard, Jürgen Steimle, Ana C Baptista, and Paul Strohmeier. 2020. PolySense: Augmenting Textiles with Electrical Functionality Using In-Situ Polymerization. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu, HI, USA, 13. https://doi.org/10.1145/3313831.3376841",
      "doi": "10.1145/3313831.3376841"
    },
    {
      "text": "Scott E. Hudson. 2014. Printing Teddy Bears: A Technique for 3D Printing of Soft Interactive Objects. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems - CHI ’14. ACM Press, Toronto, Ontario, Canada, 459–468. https://doi.org/10.1145/2556288.2557338",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Alexandra Ion, Johannes Frohnhofen, Ludwig Wall, Robert Kovacs, Mirela Alistar, Jack Lindsay, Pedro Lopes, Hsiang-Ting Chen, and Patrick Baudisch. 2016. Metamaterial Mechanisms. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, Tokyo Japan, 529–539. https://doi.org/10.1145/2984511.2984540",
      "doi": "10.1145/2984511.2984540"
    },
    {
      "text": "Alexandra Ion, Robert Kovacs, Oliver S. Schneider, Pedro Lopes, and Patrick Baudisch. 2018. Metamaterial Textures. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3173910",
      "doi": ""
    },
    {
      "text": "Alexandra Ion, David Lindlbauer, Philipp Herholz, Marc Alexa, and Patrick Baudisch. 2019. Understanding Metamaterial Mechanisms. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–14. https://doi.org/10.1145/3290605.3300877",
      "doi": "10.1145/3290605.3300877"
    },
    {
      "text": "Alexandra Ion, Ludwig Wall, Robert Kovacs, and Patrick Baudisch. 2017. Digital Mechanical Metamaterials. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 977–988. https://doi.org/10.1145/3025453.3025624",
      "doi": "10.1145/3025453.3025624"
    },
    {
      "text": "Alexandre Kaspar, Liane Makatura, and Wojciech Matusik. 2019. Knitting Skeletons: A Computer-Aided Design Tool for Shaping and Patterning of Knitted Garments. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology. ACM, New Orleans LA USA, 53–65. https://doi.org/10.1145/3332165.3347879",
      "doi": "10.1145/3332165.3347879"
    },
    {
      "text": "Jonathan P. King, Dominik Bauer, Cornelia Schlagenhauf, Kai-Hung Chang, Daniele Moro, Nancy Pollard, and Stelian Coros. 2018. Design. Fabrication, and Evaluation of Tendon-Driven Multi-Fingered Foam Hands. In 2018 IEEE-RAS 18th International Conference on Humanoid Robots (Humanoids). IEEE, Beijing, China, 1–9. https://doi.org/10.1109/HUMANOIDS.2018.8624997",
      "doi": "10.1109/HUMANOIDS.2018.8624997"
    },
    {
      "text": "Kobakant. 2010. Knit Stroke Sensor. https://www.kobakant.at/DIY/?p=4317. (accessed 2020-02-27).",
      "doi": ""
    },
    {
      "text": "Gierad Laput, Xiang ’Anthony’ Chen, and Chris Harrison. 2015. 3D Printed Hair: Fused Deposition Modeling of Soft Strands, Fibers, and Bristles. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology - UIST ’15. ACM Press, Daegu, Kyungpook, Republic of Korea, 593–597. https://doi.org/10.1145/2807442.2807484",
      "doi": "10.1145/2807442.2807484"
    },
    {
      "text": "Min Li, Shaokai Wang, Zuoguang Zhang, and Boming Wu. 2009. Effect of Structure on the Mechanical Behaviors of Three-Dimensional Spacer Fabric Composites. Applied Composite Materials 16, 1 (Feb. 2009), 1–14. https://doi.org/10.1007/s10443-008-9072-4",
      "doi": ""
    },
    {
      "text": "Ruibo Liu, Qijia Shao, Siqi Wang, Christina Ru, Devin Balkcom, and Xia Zhou. 2019. Reconstructing Human Joint Motion with Computational Fabrics. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 1 (March 2019), 19:1–19:26. https://doi.org/10.1145/3314406",
      "doi": "10.1145/3359303"
    },
    {
      "text": "Yanping Liu and Hong Hu. 2010. Sound Absorption Behavior of Knitted Spacer Fabrics. Textile Research Journal 80, 18 (2010), 1949–1957. https://doi.org/10.1177/0040517510373639",
      "doi": ""
    },
    {
      "text": "Yanping Liu and Hong Hu. 2011. Compression Property and Air Permeability of Weft-knitted Spacer Fabrics. The Journal of The Textile Institute 102, 4 (2011), 366–372. https://doi.org/10.1080/00405001003771200",
      "doi": ""
    },
    {
      "text": "James McCann. 2017. The ”Knitout” (.k) File Format v0.5.3. https://textiles-lab.github.io/knitout/knitout.html. (accessed 2018-04-03).",
      "doi": ""
    },
    {
      "text": "James McCann, Lea Albaugh, Vidya Narayanan, April Grow, Wojciech Matusik, Jennifer Mankoff, and Jessica Hodgins. 2016. A Compiler for 3D Machine Knitting. ACM Transactions on Graphics 35, 4 (July 2016), 49:1–49:11. https://doi.org/10.1145/2897824.2925940",
      "doi": "10.1145/2897824.2925940"
    },
    {
      "text": "Gianluca Memoli, Letizia Chisari, Jonathan P. Eccles, Mihai Caleap, Bruce W. Drinkwater, and Sriram Subramanian. 2019. VARI-SOUND: A Varifocal Lens for Sound. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–14. https://doi.org/10.1145/3290605.3300713",
      "doi": "10.1145/3290605.3300713"
    },
    {
      "text": "Acme Mills. 2020. 3d Spacer Fabrics | Acme Mills. https://acmemills.com/brands/3-d-spacer-fabrics.",
      "doi": ""
    },
    {
      "text": "Satoshi Nakamaru, Ryosuke Nakayama, Ryuma Niiyama, and Yasuaki Kakehi. 2017. FoamSense: Design of Three Dimensional Soft Sensors with Porous Materials. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology(UIST ’17). Association for Computing Machinery, Québec City, QC, Canada, 437–447. https://doi.org/10.1145/3126594.3126666",
      "doi": "10.1145/3126594.3126666"
    },
    {
      "text": "Ryosuke Nakayama, Ryo Suzuki, Satoshi Nakamaru, Ryuma Niiyama, Yoshihiro Kawahara, and Yasuaki Kakehi. 2019. MorphIO: Entirely Soft Sensing and Actuation Modules for Programming Shape Changes through Tangible Interaction. In Proceedings of the 2019 on Designing Interactive Systems Conference. ACM, San Diego CA USA, 975–986. https://doi.org/10.1145/3322276.3322337",
      "doi": "10.1145/3322276.3322337"
    },
    {
      "text": "Vidya Narayanan, Lea Albaugh, Jessica Hodgins, Stelian Coros, and James Mccann. 2018. Automatic Machine Knitting of 3D Meshes. ACM Transactions on Graphics 37, 3 (Aug. 2018), 1–15. https://doi.org/10.1145/3186265",
      "doi": "10.1145/3186265"
    },
    {
      "text": "Vidya Narayanan, Kui Wu, Cem Yuksel, and James McCann. 2019. Visual Knitting Machine Programming. ACM Transactions on Graphics 38, 4 (July 2019), 63:1–63:13. https://doi.org/10.1145/3306346.3322995",
      "doi": "10.1145/3306346.3322995"
    },
    {
      "text": "Alex Olwal, Jon Moeller, Greg Priest-Dorman, Thad Starner, and Ben Carroll. 2018. I/O Braid: Scalable Touch-Sensitive Lighted Cords Using Spiraling, Repeating Sensing Textiles and Fiber Optics. In Proceedings of the 31st Annual ACM Symposium on User Interface Software and Technology(UIST ’18). Association for Computing Machinery, Berlin, Germany, 485–497. https://doi.org/10.1145/3242587.3242638",
      "doi": "10.1145/3242587.3242638"
    },
    {
      "text": "Alex Olwal, Thad Starner, and Gowa Mainini. 2020. E-Textile Microinteractions: Augmenting Twist with Flick, Slide and Grasp Gestures for Soft Electronics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–13. https://doi.org/10.1145/3313831.3376236",
      "doi": "10.1145/3313831.3376236"
    },
    {
      "text": "Windell H. Oskay and Lenore M. Edman. 2007. Bristlebot: A Tiny Directional Vibrobot. https://www.evilmadscientist.com/2007/bristlebot-a-tiny-directional-vibrobot/.",
      "doi": ""
    },
    {
      "text": "Jifei Ou, Gershon Dublon, Chin-Yi Cheng, Felix Heibeck, Karl Willis, and Hiroshi Ishii. 2016. Cilllia: 3D Printed Micro-Pillar Structures for Surface Texture, Actuation and Sensing. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). Association for Computing Machinery, San Jose, California, USA, 5753–5764. https://doi.org/10.1145/2858036.2858257",
      "doi": "10.1145/2858036.2858257"
    },
    {
      "text": "Jifei Ou, Daniel Oran, Don Derek Haddad, Joseph Paradiso, and Hiroshi Ishii. 2019. SensorKnit: Architecting Textile Sensors with Machine Knitting. 3D Printing and Additive Manufacturing 6, 1 (2019), 1–11. https://doi.org/10.1089/3dp.2018.0122",
      "doi": ""
    },
    {
      "text": "Jifei Ou, Mélina Skouras, Nikolaos Vlavianos, Felix Heibeck, Chin-Yi Cheng, Jannik Peters, and Hiroshi Ishii. 2016. aeroMorph - Heat-Sealing Inflatable Shape-Change Materials for Interaction Design. In Proceedings of the 29th Annual Symposium on User Interface Software and Technology. ACM, Tokyo Japan, 121–132. https://doi.org/10.1145/2984511.2984520",
      "doi": "10.1145/2984511.2984520"
    },
    {
      "text": "Julian Panetta, Qingnan Zhou, Luigi Malomo, Nico Pietroni, Paolo Cignoni, and Denis Zorin. 2015. Elastic Textures for Additive Fabrication. ACM Transactions on Graphics 34, 4 (July 2015), 135:1–135:12. https://doi.org/10.1145/2766937",
      "doi": "10.1145/2766937"
    },
    {
      "text": "Huaishu Peng, Jennifer Mankoff, Scott E. Hudson, and James McCann. 2015. A Layered Fabric 3D Printer for Soft Interactive Objects. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(CHI ’15). Association for Computing Machinery, Seoul, Republic of Korea, 1789–1798. https://doi.org/10.1145/2702123.2702327",
      "doi": "10.1145/2702123.2702327"
    },
    {
      "text": "Andreas Pointner, Thomas Preindl, Sara Mlakar, Roland Aigner, and Michael Haller. 2020. Knitted RESi: A Highly Flexible, Force-Sensitive Knitted Textile Based on Resistive Yarns. In Special Interest Group on Computer Graphics and Interactive Techniques Conference Emerging Technologies. ACM, Virtual Event USA, 1–2. https://doi.org/10.1145/3388534.3407292",
      "doi": ""
    },
    {
      "text": "Mariana Popescu, Matthias Rippmann, Tom Van Mele, and Philippe Block. 2018. Automated Generation of Knit Patterns for Non-Developable Surfaces. In Humanizing Digital Reality, Klaas De Rycke, Christoph Gengnagel, Olivier Baverel, Jane Burry, Caitlin Mueller, Minh Man Nguyen, Philippe Rahm, and Mette Ramsgaard Thomsen (Eds.). Springer Singapore, Singapore, 271–284. https://doi.org/10.1007/978-981-10-6611-5_24",
      "doi": ""
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 4216–4227. https://doi.org/10.1145/2858036.2858176",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Thomas Preindl, Cedric Honnet, Andreas Pointner, Roland Aigner, Joseph A. Paradiso, and Michael Haller. 2020. Sonoflex: Embroidered Speakers without Permanent Magnets. In UIST’20: 33rdth ACM User Interface Software and Technology Symposium. ACM, Minneapolis, Minnesota, USA, 8.",
      "doi": ""
    },
    {
      "text": "Ahmad Rafsanjani, Yuerou Zhang, Bangyuan Liu, Shmuel M. Rubinstein, and Katia Bertoldi. 2018. Kirigami Skins Make a Simple Soft Actuator Crawl. Science Robotics 3, 15 (Feb. 2018), eaar7555. https://doi.org/10.1126/scirobotics.aar7555",
      "doi": ""
    },
    {
      "text": "Michael L. Rivera and Scott E. Hudson. 2019. Desktop Electrospinning: A Single Extruder 3D Printer for Producing Rigid Plastic and Electrospun Textiles. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300434",
      "doi": "10.1145/3290605.3300434"
    },
    {
      "text": "Andreas Roye and Thomas Gries. 2007. 3-D Textiles for Advanced Cement Based Matrix Reinforcement. Journal of Industrial Textiles 37, 2 (2007), 163–173. https://doi.org/10.1177/1528083707078136",
      "doi": ""
    },
    {
      "text": "Robert T. Spillane and Mike S. Kowalski. 1995. Warp Knitted Textile Spacer Fabric, Method of Producing Same, and Products Produced Therefrom. Patent No. US5385036A, Filed 1993-05-24, Issued 1995-01-31.",
      "doi": ""
    },
    {
      "text": "Ruojia Sun, Ryosuke Onose, Margaret Dunne, Andrea Ling, Amanda Denham, and Hsin-Liu (Cindy) Kao. 2020. Weaving a Second Skin: Exploring Opportunities for Crafting On-Skin Interfaces Through Weaving. In Proceedings of the 2020 ACM Designing Interactive Systems Conference(DIS ’20). Association for Computing Machinery, Eindhoven, Netherlands, 365–377. https://doi.org/10.1145/3357236.3395548",
      "doi": "10.1145/3357236.3395548"
    },
    {
      "text": "James Utama Surjadi, Libo Gao, Huifeng Du, Xiang Li, Xiang Xiong, Nicholas Xuanlai Fang, and Yang Lu. 2019. Mechanical Metamaterials and Their Engineering Applications. Advanced Engineering Materials 21, 3 (2019), 1800864. https://doi.org/10.1002/adem.201800864",
      "doi": ""
    },
    {
      "text": "Lavender Tessmer, Carmel Dunlap, Bjorn Sparrman, Schendy Kernizan, Jared Laucks, and Skylar Tibbits. 2019. Active Textile Tailoring. In ACM SIGGRAPH 2019 Emerging Technologies(SIGGRAPH ’19). Association for Computing Machinery, New York, NY, USA, 2. https://doi.org/10.1145/3305367.3327995",
      "doi": ""
    },
    {
      "text": "Jenny Underwood. 2009. The Design of 3D Shape Knitted Preforms. Ph.D. Dissertation. RMIT University.",
      "doi": ""
    },
    {
      "text": "Guanyun Wang, Tingyu Cheng, Youngwook Do, Humphrey Yang, Ye Tao, Jianzhe Gu, Byoungkwon An, and Lining Yao. 2018. Printed Paper Actuator: A Low-Cost Reversible Actuation and Sensing Method for Shape Changing Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3174143",
      "doi": "10.1145/3173574.3174143"
    },
    {
      "text": "Jinfeng Wang, Hairu Long, Saeid Soltanian, Peyman Servati, and Frank Ko. 2014. Electromechanical Properties of Knitted Wearable Sensors: Part 1 – Theory. Textile Research Journal 84, 1 (Jan. 2014), 3–15. https://doi.org/10.1177/0040517513487789",
      "doi": ""
    },
    {
      "text": "Lijing Wang. 2008. The Use of Spacer Fabrics for Absorbent Medical Applications. Journal of Fiber Bioengineering and Informatics 1, 4(2008), 321–329. https://doi.org/10.3993/jfbi03200910",
      "doi": ""
    },
    {
      "text": "Ting Xu and Henri J. Lezec. 2014. Visible-Frequency Asymmetric Transmission Devices Incorporating a Hyperbolic Metamaterial. Nature Communications 5, 1 (June 2014), 4141. https://doi.org/10.1038/ncomms5141",
      "doi": ""
    },
    {
      "text": "MIAO Xu-hong and Ge Ming-Qiao. 2008. The Compression Behaviour of Warp Knitted Spacer Fabric. Fibres & Textiles in Eastern Europe 16, 1 (2008), 90–92.",
      "doi": ""
    },
    {
      "text": "Lining Yao, Ryuma Niiyama, Jifei Ou, Sean Follmer, Clark Della Silva, and Hiroshi Ishii. 2013. PneUI: Pneumatically Actuated Soft Composite Materials for Shape Changing Interfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology - UIST ’13. ACM Press, St. Andrews, Scotland, United Kingdom, 13–22. https://doi.org/10.1145/2501988.2502037",
      "doi": "10.1145/2501988.2502037"
    },
    {
      "text": "Hechuan Zhang, Zhiyong Chen, Shihui Guo, Juncong Lin, Yating Shi, Xiangyang Liu, and Yong Ma. 2020. Sensock: 3D Foot Reconstruction with Flexible Sensors. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–13. https://doi.org/10.1145/3313831.3376387",
      "doi": "10.1145/3313831.3376387"
    },
    {
      "text": "Mengjia Zhu, Amirhossein H. Memar, Aakar Gupta, Majed Samad, Priyanshu Agarwal, Yon Visell, Sean J. Keller, and Nicholas Colonnese. 2020. PneuSleeve: In-Fabric Multimodal Actuation and Sensing in a Soft, Compact, and Expressive Haptic Sleeve. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–12. https://doi.org/10.1145/3313831.3376333",
      "doi": "10.1145/3313831.3376333"
    }
  ]
}