{
  "doi": "10.1145/3411764.3445295",
  "title": "Sticky Goals: Understanding Goal Commitments for Behavioral Changes in the Wild",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2021,
  "badges": [],
  "abstract": "A commitment device, an attempt to bind oneself for a successful goal achievement, has been used as an effective strategy to promote behavior change. However, little is known about how commitment devices are used in the wild, and what aspects of commitment devices are related to goal achievements. In this paper, we explore a large-scale dataset from stickK, an online behavior change support system that provides both financial and social commitments. We characterize the patterns of behavior change goals (e.g., topics and commitment setting) and then perform a series of multilevel regression analyses on goal achievements. Our results reveal that successful goal achievements are largely dependent on the configuration of financial and social commitment devices, and a mixed commitment setting is considered beneficial. We discuss how our findings could inform the design of effective commitment devices, and how large-scale data can be leveraged to support data-driven goal elicitation and customization.",
  "authors": [
    {
      "name": "Hyunsoo Lee",
      "institution": "Graduate School of Knowledge Service Engineering KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659367228",
      "orcid": "missing"
    },
    {
      "name": "Auk Kim",
      "institution": "Department of Computer Science and Engineering Kangwon National Univeristy, Korea, Republic of",
      "img": "/do/10.1145/contrib-87958893057/rel-imgonly/aukkim.jpg",
      "acmid": "87958893057",
      "orcid": "missing"
    },
    {
      "name": "Hwajung Hong",
      "institution": "Department of Communication Seoul National University, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022414",
      "orcid": "0000-0001-5268-3331"
    },
    {
      "name": "Uichin Lee",
      "institution": "Graduate School of Knowledge Service Engineering KAIST, Korea, Republic of",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81317496784",
      "orcid": "0000-0002-1888-1569"
    }
  ],
  "references": [
    {
      "text": "Elena Agapie, Lucas Colusso, Sean A Munson, and Gary Hsieh. 2016. Plansourcing: Generating behavior change plans with friends and crowds. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. ACM, 119–133.",
      "doi": "10.1145/2818048.2819943"
    },
    {
      "text": "Nabil Alshurafa, Jayalakshmi Jain, Rawan Alharbi, Gleb Iakovlev, Bonnie Spring, and Angela Pfammatter. 2018. Is more always better?: discovering incentivized mHealth intervention engagement related to health behavior trends. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 153.",
      "doi": "10.1145/3287031"
    },
    {
      "text": "Jaithri Ananthapavan, A Peterson, and Gary Sacks. 2018. Paying people to lose weight: the effectiveness of financial incentives provided by health insurers for the prevention and management of overweight and obesity–a systematic review. Obesity reviews 19, 5 (2018), 605–613.",
      "doi": ""
    },
    {
      "text": "Dan Ariely and Klaus Wertenbroch. 2002. Procrastination, deadlines, and performance: Self-control by precommitment. Psychological science 13, 3 (2002), 219–224.",
      "doi": ""
    },
    {
      "text": "Hal R Arkes and Catherine Blumer. 1985. The psychology of sunk cost. Organizational behavior and human decision processes 35, 1 (1985), 124–140.",
      "doi": ""
    },
    {
      "text": "Ian Ayres. 2010. Carrots and sticks: Unlock the power of incentives to get things done. Bantam.",
      "doi": ""
    },
    {
      "text": "Douglas Bates, Reinhold Kliegl, Shravan Vasishth, and Harald Baayen. 2015. Parsimonious mixed models. (2015). arxiv:1506.04967",
      "doi": ""
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joe Marshall, and Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the sigchi conference on human factors in computing systems. 2005–2014.",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Robin Brewer, Meredith Ringel Morris, and Anne Marie Piper. 2016. “Why would anybody do this?”: Older Adults’ Understanding of and Experiences with Crowd Work. Proceedings of CHI 2016(2016).",
      "doi": ""
    },
    {
      "text": "Gharad Bryan, Dean Karlan, and Scott Nelson. 2010. Commitment devices. Annu. Rev. Econ. 2, 1 (2010), 671–698.",
      "doi": ""
    },
    {
      "text": "Kate Cahill and Rafael Perera. 2011. Competitions and incentives for smoking cessation. Cochrane Database of Systematic Reviews4 (2011).",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Andrea Hu, and Munmun De Choudhury. 2018. Norms matter: Contrasting social support around behavior change in online weight loss communities. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3173574.3174240"
    },
    {
      "text": "Gary Charness and Uri Gneezy. 2009. Incentives to exercise. Econometrica 77, 3 (2009), 909–931.",
      "doi": ""
    },
    {
      "text": "Woohyeok Choi, Sangkeun Park, Duyeon Kim, Youn-kyung Lim, and Uichin Lee. 2019. Multi-Stage Receptivity Model for Mobile Just-In-Time Health Intervention. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 2 (2019), 1–26.",
      "doi": "10.1145/3328910"
    },
    {
      "text": "Robert B Cialdini. 2009. Influence: Science and practice. Vol. 4. Pearson education Boston.",
      "doi": ""
    },
    {
      "text": "James Clawson, Jessica A Pater, Andrew D Miller, Elizabeth D Mynatt, and Lena Mamykina. 2015. No longer wearing: investigating the abandonment of personal health-tracking technologies on craigslist. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 647–658.",
      "doi": "10.1145/2750858.2807554"
    },
    {
      "text": "Sunny Consolvo, Katherine Everitt, Ian Smith, and James A Landay. 2006. Design requirements for technologies that encourage physical activity. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 457–466.",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W McDonald, and James A Landay. 2009. Goal-setting considerations for persuasive technologies that encourage physical activity. In Proceedings of the 4th international Conference on Persuasive Technology. ACM, 8.",
      "doi": "10.1145/1541948.1541960"
    },
    {
      "text": "Sunny Consolvo, David W McDonald, and James A Landay. 2009. Theory-driven design strategies for technologies that support behavior change in everyday life. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 405–414.",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Nia Coupe, Sarah Peters, Sarah Rhodes, and Sarah Cotterill. 2019. The effect of commitment-making on weight loss and behaviour change in adults with obesity/overweight; a systematic review. BMC Public Health 19, 1 (2019), 816.",
      "doi": ""
    },
    {
      "text": "Jesse Dallery, Steven Meredith, and Irene M Glenn. 2008. A deposit contract method to deliver abstinence reinforcement for cigarette smoking. Journal of Applied Behavior Analysis 41, 4 (2008), 609–615.",
      "doi": ""
    },
    {
      "text": "Gregory C Elliott. 1986. Self-esteem and self-consistency: A theoretical and empirical link between two primary motivations. Social Psychology Quarterly(1986), 207–218.",
      "doi": ""
    },
    {
      "text": "Encyclopedia.com. 2019. Cognitive Consistency Theories. https://www.encyclopedia.com/social-sciences/encyclopedias-almanacs-transcripts-and-maps/cognitive-consistency-theories.",
      "doi": ""
    },
    {
      "text": "Daniel A Epstein, An Ping, James Fogarty, and Sean A Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 731–742.",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Leonard H Epstein, Rena R Wing, J Kevin Thompson, and William Griffin. 1980. Attendance and fitness in aerobics exercise: The effects of contract and lottery procedures. Behavior Modification 4, 4 (1980), 465–479.",
      "doi": ""
    },
    {
      "text": "Paul A Estabrooks, Candace C Nelson, Stanley Xu, Diane King, Elizabeth A Bayliss, Bridget Gaglio, Paul A Nutting, and Russell E Glasgow. 2005. The frequency and behavioral outcomes of goal choices in the self-management of diabetes. The Diabetes Educator 31, 3 (2005), 391–400.",
      "doi": ""
    },
    {
      "text": "Leon Festinger. 1962. A theory of cognitive dissonance. Vol. 2. Stanford university press.",
      "doi": ""
    },
    {
      "text": "Clayton Feustel, Shyamak Aggarwal, Bongshin Lee, and Lauren Wilcox. 2018. People Like Me: Designing for Reflection on Aggregate Cohort Data in Personal Informatics Systems. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 3 (2018), 107.",
      "doi": "10.1145/3264917"
    },
    {
      "text": "BJ Fogg, Gregory Cueller, and David Danielson. 2007. Motivating, influencing, and persuading users: An introduction to captology. In The human-computer interaction handbook. CRC Press, 159–172.",
      "doi": ""
    },
    {
      "text": "Shane Frederick, George Loewenstein, and Ted O’donoghue. 2002. Time discounting and time preference: A critical review. Journal of economic literature 40, 2 (2002), 351–401.",
      "doi": ""
    },
    {
      "text": "Alisa Frik, Nathan Malkin, Marian Harbach, Eyal Peer, and Serge Egelman. 2019. A Promise Is A Promise: The Effect of Commitment Devices on Computer Security Intentions. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. ACM, 604.",
      "doi": "10.1145/3290605.3300834"
    },
    {
      "text": "David H Furse and David W Stewart. 1982. Monetary incentives versus promised contribution to charity: New evidence on mail survey response. Journal of Marketing Research 19, 3 (1982), 375–380.",
      "doi": ""
    },
    {
      "text": "Xavier Giné, Dean Karlan, and Jonathan Zinman. 2010. Put your money where your butt is: a commitment contract for smoking cessation. American Economic Journal: Applied Economics 2, 4 (2010), 213–35.",
      "doi": ""
    },
    {
      "text": "Stephanie J Hanrahan and Ester Cerin. 2009. Gender, level of participation, and type of sport: Differences in achievement goal orientation and attributional style. Journal of science and medicine in sport 12, 4 (2009), 508–512.",
      "doi": ""
    },
    {
      "text": "James Heyman and Dan Ariely. 2004. Effort for payment: A tale of two markets. Psychological science 15, 11 (2004), 787–793.",
      "doi": ""
    },
    {
      "text": "Alexis Hiniker, Sungsoo Ray Hong, Tadayoshi Kohno, and Julie A Kientz. 2016. MyTime: designing and evaluating an intervention for smartphone non-use. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4746–4757.",
      "doi": "10.1145/2858036.2858403"
    },
    {
      "text": "John R Hollenbeck and Arthur P Brief. 1987. The effects of individual differences and goal origin on goal setting and performance. Organizational Behavior and Human Decision Processes 40, 3 (1987), 392–414.",
      "doi": ""
    },
    {
      "text": "Hwajung Hong, Eric Gilbert, Gregory D Abowd, and Rosa I Arriaga. 2015. In-group questions and out-group answers: crowdsourcing daily living advice for individuals with autism. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 777–786.",
      "doi": "10.1145/2702123.2702402"
    },
    {
      "text": "Tanjim Hossain and John A List. 2012. The behavioralist visits the factory: Increasing productivity using simple framing manipulations. Management Science 58, 12 (2012), 2151–2167.",
      "doi": "10.1287/mnsc.1120.1544"
    },
    {
      "text": "Kevin O Hwang, Allison J Ottenbacher, Angela P Green, M Roseann Cannon-Diehl, Oneka Richardson, Elmer V Bernstam, and Eric J Thomas. 2010. Social support in an Internet weight loss community. International journal of medical informatics 79, 1(2010), 5–13.",
      "doi": ""
    },
    {
      "text": "Kazushi Ikeda and Michael S Bernstein. 2016. Pay it backward: Per-task payments on crowdsourcing platforms reduce productivity. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, 4111–4121.",
      "doi": "10.1145/2858036.2858327"
    },
    {
      "text": "Robert W Jeffery, Jean L Forster, Simone A French, Steven H Kelder, Harry A Lando, Paul G McGovern, David R Jacobs Jr, and Judith E Baxter. 1993. The Healthy Worker Project: a work-site intervention for weight control and smoking cessation.American journal of public health 83, 3 (1993), 395–401.",
      "doi": ""
    },
    {
      "text": "Leslie K John, George Loewenstein, Andrea B Troxel, Laurie Norton, Jennifer E Fassbender, and Kevin G Volpp. 2011. Financial incentives for extended weight loss: a randomized, controlled trial. Journal of general internal medicine 26, 6 (2011), 621–626.",
      "doi": ""
    },
    {
      "text": "Gyuwon Jung, Jio Oh, Youjin Jung, Juho Sun, Ha-Kyung Kong, and Uichin Lee. 2021. “Good Enough!”: Flexible Goal Achievement with Margin-based Outcome Evaluation. In In CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Daniel Kahneman, Jack L Knetsch, and Richard H Thaler. 1991. Anomalies: The endowment effect, loss aversion, and status quo bias. Journal of Economic perspectives 5, 1 (1991), 193–206.",
      "doi": ""
    },
    {
      "text": "Berton H Kaplan, John C Cassel, and Susan Gore. 1977. Social support and health. Medical care 15, 5 (1977), 47–58.",
      "doi": ""
    },
    {
      "text": "Felipe Kast, Stephan Meier, and Dina Pomeranz. 2012. Under-savers anonymous: Evidence on self-help groups and peer pressure as a savings commitment device. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Supreet Kaur, Michael Kremer, and Sendhil Mullainathan. 2015. Self-control at work. Journal of Political Economy 123, 6 (2015), 1227–1277.",
      "doi": ""
    },
    {
      "text": "Elisabeth T Kersten-van Dijk, Joyce HDM Westerink, Femke Beute, and Wijnand A IJsselsteijn. 2017. Personal informatics, self-insight, and behavior change: A critical review of current literature. Human–Computer Interaction 32, 5-6 (2017), 268–296.",
      "doi": "10.1080/07370024.2016.1276456"
    },
    {
      "text": "Inyeop Kim, Hwarang Goh, Nematjon Narziev, Youngtae Noh, and Uichin Lee. 2020. Understanding User Contexts and Coping Strategies for Context-Aware Phone Distraction Management System Design. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 134 (Dec. 2020), 33 pages. https://doi.org/10.1145/3432213",
      "doi": "10.1145/3432213"
    },
    {
      "text": "Inyeop Kim, Uichin Lee, and Narae Cha. 2018. Exploring Context-aware Proactive Blocking for Distraction Management. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers. ACM, 1202–1207.",
      "doi": "10.1145/3267305.3274108"
    },
    {
      "text": "Jaejeung Kim, Hayoung Jung, Minsam Ko, and Uichin Lee. 2019. GoalKeeper: Exploring Interaction Lockout Mechanisms for Regulating Smartphone Use. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 1 (2019), 1–29.",
      "doi": "10.1145/3314403"
    },
    {
      "text": "Rex B Kline. 2015. Principles and practice of structural equation modeling. Guilford publications.",
      "doi": ""
    },
    {
      "text": "Minsam Ko, Seungwoo Choi, Subin Yang, Joonwon Lee, and Uichin Lee. 2015. FamiLync: facilitating participatory parental mediation of adolescents’ smartphone use. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing. ACM, 867–878.",
      "doi": "10.1145/2750858.2804283"
    },
    {
      "text": "Geza Kovacs, Zhengxuan Wu, and Michael S Bernstein. 2018. Rotating online behavior change interventions increases effectiveness but also increases attrition. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–25.",
      "doi": "10.1145/3274364"
    },
    {
      "text": "Nicholas D Lane, Ye Xu, Hong Lu, Shaohan Hu, Tanzeem Choudhury, Andrew T Campbell, and Feng Zhao. 2011. Enabling large-scale human activity inference on smartphones using community similarity networks (csn). In Proceedings of the 13th international conference on Ubiquitous computing. ACM, 355–364.",
      "doi": "10.1145/2030112.2030160"
    },
    {
      "text": "Gary P Latham and Edwin A Locke. 1991. Self-regulation through goal setting. Organizational behavior and human decision processes 50, 2 (1991), 212–247.",
      "doi": ""
    },
    {
      "text": "Hyunsoo Lee, Uichin Lee, and Hwajung Hong. 2019. Commitment devices in online behavior change support systems. In Proceedings of Asian CHI Symposium 2019: Emerging HCI Research Collection. 105–113.",
      "doi": "10.1145/3309700.3338446"
    },
    {
      "text": "Kwangyoung Lee and Hwajung Hong. 2018. MindNavigator: Exploring the Stress and Self-Interventions for Mental Wellness. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, 572.",
      "doi": "10.1145/3173574.3174146"
    },
    {
      "text": "Uichin Lee, Kyungsik Han, Hyunsung Cho, Kyong-Mee Chung, Hwajung Hong, Sung-Ju Lee, Youngtae Noh, Sooyoung Park, and John M. Carroll. 2019. Intelligent positive computing with mobile, wearable, and IoT devices: Literature review and research directions. Ad Hoc Networks 83(2019), 8–24.",
      "doi": ""
    },
    {
      "text": "Ian Li, Anind K Dey, and Jodi Forlizzi. 2011. Understanding my data, myself: supporting self-reflection with ubicomp technologies. In Proceedings of the 13th international conference on Ubiquitous computing. ACM, 405–414.",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "Brian Y Lim, Judy Kay, and Weilong Liu. 2019. How Does a Nation Walk?: Interpreting Large-Scale Step Count Activity with Weekly Streak Patterns. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 3, 2 (2019), 57.",
      "doi": "10.1145/3328928"
    },
    {
      "text": "Edwin A Locke, Karyll N Shaw, Lise M Saari, and Gary P Latham. 1981. Goal setting and task performance: 1969–1980.Psychological bulletin 90, 1 (1981), 125.",
      "doi": ""
    },
    {
      "text": "George Loewenstein, David A Asch, and Kevin G Volpp. 2013. Behavioral economics holds potential to deliver better results for patients, insurers, and employers. Health Affairs 32, 7 (2013), 1244–1250.",
      "doi": ""
    },
    {
      "text": "Charles Fergus Lowe, Pauline J Horne, Katy Tapper, Michael Bowdery, and Christine Egerton. 2004. Effects of a peer modelling and rewards-based intervention to increase fruit and vegetable consumption in children. European journal of clinical nutrition 58, 3 (2004), 510.",
      "doi": ""
    },
    {
      "text": "Jennifer Plebani Lussier, Sarah H Heil, Joan A Mongeon, Gary J Badger, and Stephen T Higgins. 2006. A meta-analysis of voucher-based reinforcement therapy for substance use disorders. Addiction 101, 2 (2006), 192–203.",
      "doi": ""
    },
    {
      "text": "Hannes Matuschek, Reinhold Kliegl, Shravan Vasishth, Harald Baayen, and Douglas Bates. 2017. Balancing Type I error and power in linear mixed models. Journal of Memory and Language 94 (2017), 305–315.",
      "doi": ""
    },
    {
      "text": "Marc S Mitchell and Paul I Oh. 2016. Framing financial incentives to increase physical activity among overweight and obese adults. Annals of internal medicine 165, 8 (2016), 599–600.",
      "doi": ""
    },
    {
      "text": "Tanushree Mitra, Clayton J Hutto, and Eric Gilbert. 2015. Comparing person-and process-centric strategies for obtaining quality data on amazon mechanical turk. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1345–1354.",
      "doi": "10.1145/2702123.2702553"
    },
    {
      "text": "David Mohr, Pim Cuijpers, and Kenneth Lehman. 2011. Supportive accountability: a model for providing human support to enhance adherence to eHealth interventions. Journal of medical Internet research 13, 1 (2011), e30.",
      "doi": ""
    },
    {
      "text": "Sean A Munson and Sunny Consolvo. 2012. Exploring goal-setting, rewards, self-monitoring, and sharing to motivate physical activity. In 2012 6th international conference on pervasive computing technologies for healthcare (PervasiveHealth) and workshops. IEEE, 25–32.",
      "doi": ""
    },
    {
      "text": "Sean A Munson, Erin Krupka, Caroline Richardson, and Paul Resnick. 2015. Effects of public commitments and accountability in a technology-supported physical activity intervention. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 1135–1144.",
      "doi": "10.1145/2702123.2702524"
    },
    {
      "text": "Shinichi Nakagawa and Holger Schielzeth. 2013. A general and simple method for obtaining R2 from generalized linear mixed-effects models. Methods in ecology and evolution 4, 2 (2013), 133–142.",
      "doi": ""
    },
    {
      "text": "Anne Victoria Neale, Steven P Singleton, Mary H Dupuis, and Joseph W Hess. 1990. The use of behavioral contracting to increase exercise activity. American Journal of Health Promotion 4, 6 (1990), 441–447.",
      "doi": ""
    },
    {
      "text": "Mark W Newman, Debra Lauterbach, Sean A Munson, Paul Resnick, and Margaret E Morris. 2011. It’s not that i don’t have problems, i’m just not putting them on facebook: challenges and opportunities in using online social networks for health. In Proceedings of the ACM 2011 conference on Computer supported cooperative work. ACM, 341–350.",
      "doi": "10.1145/1958824.1958876"
    },
    {
      "text": "John C Norcross, Marci S Mrykalo, and Matthew D Blagys. 2002. Auld lang Syne: Success predictors, change processes, and self-reported outcomes of New Year’s resolvers and nonresolvers. Journal of Clinical Psychology 58, 4 (2002), 397–405.",
      "doi": ""
    },
    {
      "text": "Ann A O’Connell and D Betsy McCoach. 2008. Multilevel modeling of educational data. IAP.",
      "doi": ""
    },
    {
      "text": "Ted O’Donoghue and Matthew Rabin. 1999. Doing it now or later. American Economic Review 89, 1 (1999), 103–124.",
      "doi": ""
    },
    {
      "text": "Joonyoung Park, Hyunsoo Lee, Sangkeun Park, Kyong-Mee Chung, and Uichin Lee. 2021. GoldenTime: Exploring System-Driven Timeboxing and Micro-Financial Incentives for Self-Regulated Phone Use. In In CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). ACM, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Virginia Paul-Ebhohimhen and Alison Avenell. 2008. Systematic review of the use of financial incentives in treatments for obesity and overweight. Obesity Reviews 9, 4 (2008), 355–367.",
      "doi": ""
    },
    {
      "text": "Erin S Pearson. 2012. Goal setting as a health behavior change strategy in overweight and obese adults: a systematic literature review examining intervention components. Patient education and counseling 87, 1 (2012), 32–42.",
      "doi": ""
    },
    {
      "text": "Aarathi Prasad, Jacob Sorber, Timothy Stablein, Denise Anthony, and David Kotz. 2012. Understanding sharing preferences and behavior for mHealth devices. In Proceedings of the 2012 ACM workshop on Privacy in the electronic society. 117–128.",
      "doi": "10.1145/2381966.2381983"
    },
    {
      "text": "Todd Rogers, Katherine L Milkman, and Kevin G Volpp. 2014. Commitment devices: using initiatives to change behavior. JaMa 311, 20 (2014), 2065–2066.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1163–1172.",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Heather Royer, Mark Stehr, and Justin Sydnor. 2015. Incentives, commitments, and habit formation in exercise: evidence from a field experiment with workers at a fortune-500 company. American Economic Journal: Applied Economics 7, 3 (2015), 51–84.",
      "doi": ""
    },
    {
      "text": "Alain Samson. 2017. The behavioral economics guide 2017 (with an introduction by Cass Sunstein).",
      "doi": ""
    },
    {
      "text": "Manu Manthri Savani. 2018. The Effects of a Commitment Device on Health Outcomes: Reputational Commitment and Weight Loss in an Online Experiment. International Journal of Applied Behavioral Economics (IJABE) 7, 4(2018), 1–20.",
      "doi": ""
    },
    {
      "text": "Thomas Stachnik, Barbara Brown, William Hinds, Brian Mavis, Bertram Stoffelmayr, Dozier Thornton, and Larry Van Egeren. 1990. Goal setting, social support, and financial incentives in stress management programs: A pilot study of their impact on adherence. American Journal of Health Promotion 5, 1 (1990), 24–29.",
      "doi": ""
    },
    {
      "text": "Katarzyna Stawarz, Anna L Cox, and Ann Blandford. 2015. Beyond self-tracking and reminders: designing smartphone apps that support habit formation. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. ACM, 2653–2662.",
      "doi": "10.1145/2702123.2702230"
    },
    {
      "text": "Peter M Steiner, Thomas D Cook, William R Shadish, and Margaret H Clark. 2010. The importance of covariate selection in controlling for selection bias in observational studies.Psychological methods 15, 3 (2010), 250.",
      "doi": ""
    },
    {
      "text": "Juho Sun, Sangkeun Park, Gyuwon Jung, Yong Jeong, Uichin Lee, Kyong-Mee Chung, Changseok Lee, Heewon Kim, Suhyon Ahn, Ahsan Khandoker, and Leontios Hadjileontiadis. 2020. BeActive: Encouraging Physical Activities with Just-in-Time Health Intervention and Micro Financial Incentives. Association for Computing Machinery, New York, NY, USA, 17–20.",
      "doi": ""
    },
    {
      "text": "Richard H Thaler and Shlomo Benartzi. 2004. Save more tomorrowTM: Using behavioral economics to increase employee saving. Journal of political Economy 112, S1 (2004), S164–S187.",
      "doi": ""
    },
    {
      "text": "Ivo Vlaev, Dominic King, Ara Darzi, and Paul Dolan. 2019. Changing health behaviors using financial incentives: a review from behavioral economics. BMC public health 19, 1 (2019), 1–9.",
      "doi": ""
    },
    {
      "text": "Joanne Wall, Cliona Ni Mhurchu, Tony Blakely, Anthony Rodgers, and Jenny Wilton. 2006. Effectiveness of monetary incentives in modifying dietary behavior: a review of randomized, controlled trials. Nutrition reviews 64, 12 (2006), 518–531.",
      "doi": ""
    },
    {
      "text": "Lucy Yardley, Bonnie J Spring, Heleen Riper, Leanne G Morrison, David H Crane, Kristina Curtis, Gina C Merchant, Felix Naughton, and Ann Blandford. 2016. Understanding and promoting effective engagement with digital behavior change interventions. American journal of preventive medicine 51, 5 (2016), 833–842.",
      "doi": ""
    }
  ]
}