{
  "doi": "10.1145/3411764.3445144",
  "title": "Fostering Equitable Help-Seeking for K-3 Students in Low Income and Rural Contexts",
  "published": "2021-05-07",
  "proctitle": "CHI '21: Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2021,
  "badges": [],
  "abstract": "Adaptive Collaborative Learning Support (ACLS) systems improve collaboration and learning for students over individual work or collaboration with non-adaptive support. However, many ACLS systems are ill-suited for rural contexts where students often need multiple kinds of support to complete tasks, may speak languages unsupported by the system, and require more than pre-assigned tutor-tutee student pairs for more equitable learning. We designed an intervention that fosters more equitable help-seeking by automatically detecting student struggles and prompts them to seek help from specific peers that can help. We conducted a mixed-methods experimental study with 98 K-3 students in a rural village in Tanzania over a one-month period, evaluating how the system affects student interactions, system engagement, and student learning. Our intervention increased student interactions by almost 4 times compared to the control condition, increased domain knowledge interactions, and propelled students to engage in more cognitively challenging activities.",
  "authors": [
    {
      "name": "Judith Odili Uchidiuno",
      "institution": "Human Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659700472",
      "orcid": "missing"
    },
    {
      "name": "Jessica Hammer",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658650866",
      "orcid": "0000-0003-4102-2575"
    },
    {
      "name": "Ken Koedinger",
      "institution": "Human Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/do/10.1145/contrib-81100484653/rel-imgonly/img_3518.jpeg",
      "acmid": "81100484653",
      "orcid": "missing"
    },
    {
      "name": "Amy Ogan",
      "institution": "Human-Computer Interaction Institute Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350583567",
      "orcid": "0000-0003-2671-6149"
    }
  ],
  "references": [
    {
      "text": "Philip C. Abrami*, Catherine Poulsen, and Bette Chambers. 2004. Teacher motivation to implement an educational innovation: Factors differentiating users and non-users of cooperative learning. Educational Psychology 24, 2: 201–216.",
      "doi": ""
    },
    {
      "text": "Enrique Alfonseca, Rosa M. Carro, Estefanía Martín, Alvaro Ortigosa, and Pedro Paredes. 2006. The impact of learning styles on student grouping for collaborative learning: a case study. User Modeling and User-Adapted Interaction 16, 3–4: 377–401.",
      "doi": "10.1007/s11257-006-9012-7"
    },
    {
      "text": "Margarita Azmitia. 1996. Peer interactive minds: Developmental, theoretical, and methodological issues. Interactive minds: Life-span perspectives on the social foundation of cognition: 133–162.",
      "doi": ""
    },
    {
      "text": "Nilufar Baghaei, Antonija Mitrovic, and Warwick Irwin. 2007. Supporting collaborative learning and problem-solving in a constraint-based CSCL environment for UML class diagrams. International Journal of Computer-Supported Collaborative Learning 2, 2–3: 159–190.",
      "doi": ""
    },
    {
      "text": "Stephany Berinstein and Lilian Magalhaes. 2009. A study of the essence of play experience to children living in Zanzibar, Tanzania. Occupational therapy international 16, 2: 89–106.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal, Robin Morris, Stephanie Gottwald, Tinsley Galyean, and Maryanne Wolf. 2016. Mobile devices for early literacy intervention and research with global reach. In Proceedings of the Third (2016) ACM Conference on Learning@ Scale, 11–20.",
      "doi": "10.1145/2876034.2876046"
    },
    {
      "text": "William M. Bukowski, Betsy Hoza, and Michel Boivin. 1994. Measuring friendship quality during pre-and early adolescence: The development and psychometric properties of the Friendship Qualities Scale. Journal of social and Personal Relationships 11, 3: 471–484.",
      "doi": ""
    },
    {
      "text": "Tak-Wai Chan and Chih-Yueh Chou. 1997. Exploring the design of computer supports for reciprocal tutoring.",
      "doi": ""
    },
    {
      "text": "Xinyin Chen, Kenneth H. Rubin, and Dan Li. 1997. Relation between academic achievement and social adjustment: Evidence from Chinese children. Developmental psychology 33, 3: 518.",
      "doi": ""
    },
    {
      "text": "Cosmas Cobbold. 2006. Attracting and retaining rural teachers in Ghana: The premise and promise of a district sponsorship scheme. Journal of Education for Teaching 32, 4: 453–469.",
      "doi": ""
    },
    {
      "text": "B. A. K. Cocroft and Stella Ting-Toomey. 1994. Facework in Japan and the United States. International Journal of Intercultural Relations 18, 4: 469–506.",
      "doi": ""
    },
    {
      "text": "Juliet Corbin and Anselm Strauss. 2008. Basics of qualitative research: Techniques and procedures for developing grounded theory. Thousand Oaks.",
      "doi": ""
    },
    {
      "text": "Don Dansereau and D. W. Johnson. 1994. Cooperative learning. Learning, remembering, believing: Enhancing human performance: 83–111.",
      "doi": ""
    },
    {
      "text": "Andrea DeBruin-Parecki. 2009. Establishing a family literacy program with a focus on interactive reading: The role of research and accountability. Early Childhood Education Journal 36, 5: 385–392.",
      "doi": ""
    },
    {
      "text": "Janice Webb Early. 1999. The impact of peer tutoring on self-esteem and Texas Assessment of Academic Skills mathematics performance of tenth-grade students.",
      "doi": ""
    },
    {
      "text": "B. Egeland, N. Weinfield, M. Hiester, C. Lawrence, S. Pierce, K. Chippendale, and J. Powell. 1995. Teaching tasks administration and scoring manual. University of Minnesota.",
      "doi": ""
    },
    {
      "text": "Ruth Evans. 2012. Sibling caringscapes: Time–space practices of caring within youth-headed households in Tanzania and Uganda. Geoforum 43, 4: 824–835.",
      "doi": ""
    },
    {
      "text": "Charles R. Greenwood. 1996. Research on the practices and behavior of effective teachers at the Juniper Gardens Children's Project: Implications for the education of diverse learners. Research on classroom ecologies: 39–67.",
      "doi": ""
    },
    {
      "text": "Willard W. Hartup. 1992. Having Friends, Making Friends, and Keeping Friends: Relationships as Educational Contexts. ERIC Digest.",
      "doi": ""
    },
    {
      "text": "Danielle Herro, Cassie Quigley, Jessica Andrews, and Girlie Delacruz. 2017. Co-Measure: developing an assessment for student collaboration in STEAM activities. International journal of STEM education 4, 1: 26.",
      "doi": ""
    },
    {
      "text": "John M. Hintze, Robert J. Volpe, and Edward S. Shapiro. 2002. Best practices in the systematic direct observation of student behavior. Best practices in school psychology 4: 993–1006.",
      "doi": ""
    },
    {
      "text": "M. Gail Jones and Glenda Carter. 1994. Verbal and nonverbal behavior of ability-grouped dyads. Journal of Research in Science Teaching 31, 6: 603–619.",
      "doi": ""
    },
    {
      "text": "Alison King, Anne Staffieri, and Anne Adelgais. 1998. Mutual peer tutoring: Effects of structuring tutorial interaction to scaffold peer learning. Journal of Educational Psychology 90, 1: 134.",
      "doi": ""
    },
    {
      "text": "T. Kuleana. 1999. The State of Education in Tanzania: crisis and opportunity. Kuleana Centre, Dar es Salaam.",
      "doi": ""
    },
    {
      "text": "Rohit Kumar, Carolyn Penstein Rosé, Yi-Chia Wang, Mahesh Joshi, and Allen Robinson. 2007. Tutorial dialogue as adaptive collaborative learning support. Frontiers in artificial intelligence and applications 158: 383.",
      "doi": ""
    },
    {
      "text": "Robert A. LeVine, Suzanne Dixon, Sarah LeVine, Amy Richman, Constance H. Keefer, P. Herbert Leiderman, and T. Berry Brazelton. 1996. Child care and culture: Lessons from Africa. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Marlaine E. Lockheed and Adriaan M. Verspoor. 1991. Improving primary education in developing countries. Oxford University Press for World Bank.",
      "doi": ""
    },
    {
      "text": "Gift Masaiti and Pamela Nachona Naluyele. 2011. Strategies to retain and motivate employees in Africa: Examining the case of the ministry of education in Zambia. African Journal of Political Science and International Relations 5, 8: 409–423.",
      "doi": ""
    },
    {
      "text": "Ruth Meena. 2018. Situational analysis of education of girls/women in Tanzania. Utafiti Journal 3, 2.",
      "doi": ""
    },
    {
      "text": "Donald Meichenbaum and Andrew Biemiller. 1998. Nurturing independent learners: Helping students take charge of their learning. ERIC.",
      "doi": ""
    },
    {
      "text": "Laura Menikoff. 1999. The effects of cross-age tutoring upon the decoding skills, attitude toward reading, teacher perceptions of reading improvement, and the self-concept of inner-city at-risk students. City University of New York.",
      "doi": ""
    },
    {
      "text": "Sugata Mitra, Ritu Dangwal, Shiffon Chatterjee, Swati Jha, Ravinder S. Bisht, and Preeti Kapur. 2005. Acquisition of computing literacy on shared public computers: Children and the\" hole in the wall\". Australasian Journal of Educational Technology 21, 3.",
      "doi": ""
    },
    {
      "text": "Amelia K. Moody, Laura M. Justice, and Sonia Q. Cabell. 2010. Electronic versus traditional storybooks: Relative influence on preschool children's engagement and communication. Journal of Early Childhood Literacy 10, 3: 294–313.",
      "doi": ""
    },
    {
      "text": "Emma Msaki. 2006. THE UNITED REPUBLIC OF TANZANIA MINISTRY OF EDUCATION AND VOCATIONAL TRAINING Education Sector Development Programme. Retrieved August 12, 2019 from https://www.academia.edu/7040480/THE_UNITED_REPUBLIC_OF_TANZANIA_MINISTRY_OF_EDUCATION_AND_VOCATIONAL_TRAINING_Education_Sector_Development_Programme",
      "doi": ""
    },
    {
      "text": "Lyabwene Mtahabwa and Nirmala Rao. 2010. Pre-primary education in Tanzania: Observations from urban and rural classrooms. International Journal of Educational Development 30, 3: 227–235.",
      "doi": ""
    },
    {
      "text": "Aidan Mulkeen and Dandan Chen. 2008. Teachers for rural schools: experiences in Lesotho, Malawi, Mozambique, Tanzania, and Uganda. The World Bank.",
      "doi": ""
    },
    {
      "text": "P. G. Nalkur and Achievement Orientations. 2009. Strategies: A Cultural Comparison of Tanzanian Street Children, Former Street Children, and School-Going Children. Journal of Cross-Cultural Psychology 40, 6: 1014.",
      "doi": ""
    },
    {
      "text": "Joe D. Nichols and Raymond B. Miller. 1994. Cooperative learning and student motivation. Contemporary Educational Psychology 19, 2: 167–178.",
      "doi": ""
    },
    {
      "text": "Aannemarie Sullivan Palinscar and Ann L. Brown. 1984. Reciprocal teaching of comprehension-fostering and comprehension-monitoring activities. Cognition and instruction 1, 2: 117–175.",
      "doi": ""
    },
    {
      "text": "Judy M. Parr and Michael AR Townsend. 2002. Environments, processes, and mechanisms in peer learning. International journal of educational research 37, 5: 403–423.",
      "doi": ""
    },
    {
      "text": "Souren Paul, Priya Seetharaman, Imad Samarah, and Peter P. Mykytyn. 2004. Impact of heterogeneity and collaborative conflict management style on the performance of synchronous global virtual teams. Information & Management 41, 3: 303–321.",
      "doi": "10.1016/S0378-7206%2803%2900076-4"
    },
    {
      "text": "Daniel Pauw, Tamara Clegg, June Ahn, Elizabeth Bonsignore, Jason C. Yip, and Judith Uchidiuno. 2015. Navigating connected inquiry learning with ScienceKit. . International Society of the Learning Sciences, Inc.[ISLS].",
      "doi": ""
    },
    {
      "text": "Roy D. Pea. 1993. Practices of distributed intelligence and designs for education. Distributed cognitions: Psychological and educational considerations 11: 47–87.",
      "doi": ""
    },
    {
      "text": "Roy D. Pea. 2004. The social and technological dimensions of scaffolding and related theoretical concepts for learning, education, and human activity. The journal of the learning sciences 13, 3: 423–451.",
      "doi": ""
    },
    {
      "text": "Nancy E. Perry. 1998. Young children's self-regulated learning and contexts that support it. Journal of Educational Psychology 90, 4: 715–729. https://doi.org/10.1037/0022-0663.90.4.715",
      "doi": ""
    },
    {
      "text": "Nguyen Phuong-Mai, Cees Terlouw, and Albert Pilot. 2005. Cooperative learning vs Confucian heritage culture's collectivism: Confrontation to reveal some cultural conflicts and mismatch. Asia Europe Journal 3, 3: 403–419. https://doi.org/10.1007/s10308-005-0008-4",
      "doi": ""
    },
    {
      "text": "Liana Razmerita and Armelle Brun. 2011. Collaborative learning in heterogeneous classes. In The 3rd International Conference on Computer Supported Education, 189194.",
      "doi": ""
    },
    {
      "text": "Amanda J. Rose and Steven R. Asher. 2004. Children's strategies and goals in response to help-giving and help-seeking tasks within a friendship. Child Development 75, 3: 749–763.",
      "doi": ""
    },
    {
      "text": "Carolyn Rosé, Yi-Chia Wang, Yue Cui, Jaime Arguello, Karsten Stegmann, Armin Weinberger, and Frank Fischer. 2008. Analyzing collaborative learning processes automatically: Exploiting the advances of computational linguistics in computer-supported collaborative learning. International journal of computer-supported collaborative learning 3, 3: 237–271.",
      "doi": ""
    },
    {
      "text": "Nikol Rummel, Erin Walker, and Vincent Aleven. 2016. Different futures of adaptive collaborative learning support. International Journal of Artificial Intelligence in Education 26, 2: 784–795.",
      "doi": ""
    },
    {
      "text": "Lawrence Sherman. 2000. SOCIOMETRY IN THE CLASSROOM. Retrieved September 9, 2019 from http://www.users.miamioh.edu/shermalw/sociometryfiles/sociocl.htmlx",
      "doi": ""
    },
    {
      "text": "Georg Siemens. 2005. Connectivism: A learning theory for the digital age. International Journal of Instructional Technology and Distance Learning. Obtained through the Internet: http://www.idtl.org/Journal/Jam_05/article01.htm. [Accessed Sept. 2008].",
      "doi": ""
    },
    {
      "text": "Robert E. Slavin. 1983. When does cooperative learning increase student achievement? Psychological bulletin 94, 3: 429.",
      "doi": ""
    },
    {
      "text": "Rayne A. Sperling, Bruce C. Howard, Lee Ann Miller, and Cheryl Murphy. 2002. Measures of children's knowledge and regulation of cognition. Contemporary educational psychology 27, 1: 51–79.",
      "doi": ""
    },
    {
      "text": "Sandra J. Stone and James F. Christie. 1996. Collaborative literacy learning during sociodramatic play in a multiage (K-2) primary classroom. Journal of Research in Childhood Education 10, 2: 123–133.",
      "doi": ""
    },
    {
      "text": "Sarah Strohkorb, Ethan Fukuto, Natalie Warren, Charles Taylor, Bobby Berry, and Brian Scassellati. 2016. Improving human-human collaboration between children with a social robot. In 2016 25th IEEE International Symposium on Robot and Human Interactive Communication (RO-MAN), 551–556.",
      "doi": "10.1109/ROMAN.2016.7745172"
    },
    {
      "text": "Anna Every Swai. 2013. The Effects of Incentive Initiatives on Teacher Retention in Tanzania: A Case of the Rukwa Region.",
      "doi": ""
    },
    {
      "text": "Peter Taylor and Abigail Mulhall. 2001. Linking learning environments through agricultural experience—enhancing the learning process in rural primary schools. International Journal of Educational Development 21, 2: 135–148.",
      "doi": ""
    },
    {
      "text": "Patricia Azevedo Tedesco. 2003. MArCo: Building an artificial conflict mediator to support group planning interactions. International Journal of Artificial Intelligence in Education 13, 1: 117–155.",
      "doi": "10.5555/1434812.1434820"
    },
    {
      "text": "Stella Ting-Toomey. 1988. Rhetorical sensitivity style in three cultures: France, Japan, and the United States. Central States Speech Journal 39, 1: 28–36. https://doi.org/10.1080/10510978809363232",
      "doi": ""
    },
    {
      "text": "Stella Ting-Toomey. 1988. Intercultural conflict styles: a face-negotiation theory. In Theories in intercultural communication, Y. Kim and W. Gudykunst (eds.). SAGE, Newbury Park, CA, 213–235.",
      "doi": ""
    },
    {
      "text": "A. Tsui. 1996. Reticence and anxiety in second language teaching. In Voices from the language classroom, K. Bailey and D. Nunan (eds.). Cambridge University Press, Cambridge, 145–167.",
      "doi": ""
    },
    {
      "text": "Judith Uchidiuno, Evelyn Yarzebinski, Emily Keebler, Kenneth Koedinger, and Amy Ogan. 2019. Learning from african classroom pedagogy to increase student engagement in education technologies. In Proceedings of the Conference on Computing & Sustainable Societies, 99–110.",
      "doi": "10.1145/3314344.3332501"
    },
    {
      "text": "Judith Uchidiuno, Evelyn Yarzebinski, Michael Madaio, Nupur Maheshwari, Ken Koedinger, and Amy Ogan. 2018. Designing Appropriate Learning Technologies for School vs Home Settings in Tanzanian Rural Villages. In Proceedings of the 1st ACM SIGCAS Conference on Computing and Sustainable Societies, 9.",
      "doi": "10.1145/3209811.3209881"
    },
    {
      "text": "Judith Uchidiuno, Evelyn Yarzebinski, Emilio Vargas-Vite, Ken Koedinger, and Amy Ogan. 2019. The Effectiveness of Publicly vs. Privately Assigned Group Leaders among Learners in Rural Villages in Tanzania.",
      "doi": ""
    },
    {
      "text": "Ema Ushioda. 1996. Learner autonomy 5: The role of motivation. Authentik.",
      "doi": ""
    },
    {
      "text": "Ana Cláudia Vieira, Lamartine Teixeira, Aline Timóteo, Patrícia Tedesco, and Flávia Barros. 2004. Analyzing on-line collaborative dialogues: The oxentchê–chat. In International Conference on Intelligent Tutoring Systems, 315–324.",
      "doi": ""
    },
    {
      "text": "Erin Walker, Nikol Rummel, and Kenneth R. Koedinger. 2014. Adaptive intelligent support to improve peer tutoring in algebra. International Journal of Artificial Intelligence in Education 24, 1: 33–61.",
      "doi": ""
    },
    {
      "text": "Felix Warneken, Jasmin Steinwender, Katharina Hamann, and Michael Tomasello. 2014. Young children's planning in a collaborative problem-solving task. Cognitive Development 31: 48–58.",
      "doi": ""
    },
    {
      "text": "Paula Michele White. 2000. Promoting mathematics achievement, academic efficacy, and cognitive development of at-risk adolescents through deliberate psychological education. University of Houston.",
      "doi": ""
    },
    {
      "text": "David Whitebread, Penny Coltman, Deborah Pino Pasternak, Claire Sangster, Valeska Grau, Sue Bingham, Qais Almeqdad, and Demetra Demetriou. 2009. The development of two observational tools for assessing metacognition and self-regulated learning in young children. Metacognition and learning 4, 1: 63–85.",
      "doi": ""
    },
    {
      "text": "L Xiao. 2006. Bridging the gap between teaching styles and learning styles: a cross-cultural perspective. Teaching English as a Second or Foreign Language 10, 3: 1–15.",
      "doi": ""
    },
    {
      "text": "Barry J. Zimmerman and Dale H. Schunk. 2011. Self-regulated learning and performance. Handbook of self-regulation of learning and performance: 1–12.",
      "doi": ""
    },
    {
      "text": "2013. Teacher Allocation and Absenteeism in East Africa:: KiuFunza:: Twaweza.org. Retrieved August 29, 2019 from https://www.twaweza.org/go/teacher-absenteeism-in-east-africa",
      "doi": ""
    },
    {
      "text": "Rethinking languages of instruction in African schools | Development Education Review. Retrieved August 6, 2020 from https://www.developmenteducationreview.com/issue/issue-4/rethinking-languages-instruction-african-schools",
      "doi": ""
    }
  ]
}