{
  "doi": "10.1145/238386.238387",
  "title": "Self disclosure on computer forms: meta-analysis and implications",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3-10",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Suzanne Weisband",
      "institution": "Department of Management Information Systems, University of Arizona, Tucson, Arizona",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100045723",
      "orcid": "missing"
    },
    {
      "name": "Sara Kiesler",
      "institution": "HCI Institute & Department of Social and Decision Sciences, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100476487/rel-imgonly/kiesler2001.jpg",
      "acmid": "81100476487",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aiello, J. R. (1993). Computer-based work monitoring: Electronic surveillance and its effects. Journal of Applied Social Psychology, 23, 499-507.",
      "doi": ""
    },
    {
      "text": "American Institutes for Research. (1993, July 30). Increasing the safety of the blood supply by screening donors more effectively. Final Report, Vol I. AIR, 3333 K St. Washington, DC 20007.",
      "doi": ""
    },
    {
      "text": "Ball, E., Ling, D. T., Pugh, D., Skelly, T., Stankosky, Thiel, D. (1994). ReActor: A system for real-time, reactive animations. Conference Companion: Demonstrations, CHI '94, Boston, Mass., April 24-28.  ",
      "doi": "10.1145/259963.260011"
    },
    {
      "text": "Bashore, T. R., &amp; Rapp, P. E. Are there alternatives to traditional polygraph procedures? Psychological Bulletin, 113, 3-22.",
      "doi": ""
    },
    {
      "text": "Binik, Y. M., Servan-Schreiber, D., Freiwald, S., &amp; Hall, K. S. (1988). Intelligent computer-based assessment and psychotherapy: An expert system for sexual dysfunction. Journal of Nervous and Mental Disease, 178, 387-400.",
      "doi": ""
    },
    {
      "text": "Booth-Kewely, S., Edwards, J. E., &amp; Rosenfeld, P. (1992). Impression management, social desirability, and computer administration of attitude questionnaires: Does the computer make a difference? Journal of Applied Psychology, 77, 562-566.",
      "doi": ""
    },
    {
      "text": "Catania, J. A., Gibson, D. R., Chitwood, D. D. &amp; Coates. T. J. (1990). Methodological problems in AIDS behavioral research: Influences on measurement error and participation bias in studies of sexual behavior. Psychological Bulletin, 108, 339-362.",
      "doi": ""
    },
    {
      "text": "Connolly, T., Jessup, L. M., &amp; Valacich, J. S. (1990). Effects of anonymity and evaluative tone on idea generation in computer-mediated groups. Management Science, 36, 689-703.  ",
      "doi": "10.5555/3217795.3217799"
    },
    {
      "text": "Crowne, D., &amp; Marlowe, D. (1964). The approval motive. New York: Wiley.",
      "doi": ""
    },
    {
      "text": "Dindia, K. &amp; Allen, M. (1992). Sex differences in self-disclosure: A meta-analysis. Psychological Bulletin, 112, 106-124.",
      "doi": ""
    },
    {
      "text": "Elliott, C. (1994). Research problems in the use of a shallow artificial intelligence model of personality and emotion (pp. 9-15), Proceedings of the Twelfth National Conference on Artificial Intelligence. ",
      "doi": "10.5555/199288.199286"
    },
    {
      "text": "Gaver, W. W. (1986). Auditory icons: Using sound in computer interfaces. Human-Computer Interaction, 2, 167-177.",
      "doi": "10.1207/s15327051hci0202_3"
    },
    {
      "text": "Greist, J. H., Gustafson, D. H., Stauss, F F., Rowse, G. L., Laughren, T. P &amp; Chiles, J. A. (1973). Computer interview for suicide-risk prediction. American Journal of Psychiatry, 130, 1327-1332.",
      "doi": ""
    },
    {
      "text": "Hayes-Roth, B., Sincoff, E., Brownston, L., Huard, R., &amp; Lent, B. (1995). Directed improvisation with animated puppets (pp. 79-80). In Human Factors in Computing Systems: CHI '95 Conference Companion (Proceedings document). May 7-10, Denver.  ",
      "doi": "10.1145/223355.223438"
    },
    {
      "text": "Hedges, L V., &amp; Olkin, I. (1985). Statistical methods for meta-analysis. San Diego: Academic Press",
      "doi": ""
    },
    {
      "text": "Itou, K. S., Hayamizu, S. &amp; Tanaka, H. (1992). Continuous speech recognition by context-dependent phonetic HMM and an efficient algorithm for finding N-best sentence hypotheses. Proceedings of ICASSP. IEEE Press.",
      "doi": ""
    },
    {
      "text": "Johnson, B. (1989). Software for the meta-analytic review of research literatures. Hillsdale, NJ: Erlbaum. (Upgrade documentation, 1993)",
      "doi": ""
    },
    {
      "text": "Kiesler, S., &amp; Sproull, L. S. (1986). Response effects in the electronic survey. Public Opinion Quarterly, 50, 402-413.",
      "doi": ""
    },
    {
      "text": "Kiesler, S. &amp; Sproull, L. (1992). Group decision making and communication technology. Organizational Behavior and Human Decision Processes, 96-123.",
      "doi": ""
    },
    {
      "text": "Kiesler, S., Walsh, J., &amp; Sproull, L. (1992). Computer networks in field research. In F. B. Bryant , J. Edwards, S. Tindale, E. Posavac, L. Heath, E. Henderson, &amp; Y. Suarez-Balcazar, (Eds.), Methodological Issues in Applied Social Research (pp. 239-268). New York: Plenum.",
      "doi": ""
    },
    {
      "text": "Koson, D., Kitchen, M., Kochen, M, &amp; Stodolsky, D. (1970). Psychological testing by computer: Effect on response bias. Educational and Psychological Measurement, 30, 803-810.",
      "doi": ""
    },
    {
      "text": "Locander, W., Sudman, S. &amp; Bradburn, N. (1976). An investigation of interview method, threat and response distortion. Journal of the American Statistical Association, 71, 267-275.",
      "doi": ""
    },
    {
      "text": "Locke, S. E., Kowaloff, H. B., Hoff, R. G., Safran, C., Popovsky, M. A., Cotton, D. J., Finkelstein, D. M., Page, P. L., &amp; Slack, W. V. (1992). Computer-based interview for screening blood donors for risk of HIV infection. The Journal of the American Medical Association, 268, 1301-1305.",
      "doi": ""
    },
    {
      "text": "Mead, A. D. &amp; Drasgow, F. (1993). Equivalence of computerized and paper-and-pencil cognitive ability tsts: A meta-analysis. Psychological Bulletin, 114, 440-458.",
      "doi": ""
    },
    {
      "text": "Nass, C., Moon, Y., Fogg, B. J., Reeves, B., &amp; Dryer, D. C. (1995). Can computer personalities be human personalities? International Journal of Human-Computer Studies, 43(2), 223-239.  ",
      "doi": "10.1006/ijhc.1995.1042"
    },
    {
      "text": "Roese, N. J. &amp; Jamieson, D. W. (1993). Twenty years of bogus pipeline research: A critical review and meta-analysis. Psychological Bulletin, 114, 363-375.",
      "doi": ""
    },
    {
      "text": "Smith, R E. (1963). Examination by computer. Behavioral Science, 8, 76-79.",
      "doi": ""
    },
    {
      "text": "Sproull, L., Walker, J., Subramani, R., Kiesler, S., &amp; Waters, K. (in press). When the interface is a face. Human-Computer Interaction.  ",
      "doi": "10.1207/s15327051hci1102_1"
    },
    {
      "text": "Synodinos, N. E., &amp; Brennan, J. M. (1988). Computer interactive interviewing in survey research. Psychology and Marketing, 5, 117-137.",
      "doi": ""
    },
    {
      "text": "Weisband, S. P. &amp; Reinig, B. A. (1995). Understanding users' perceptions of electronic mail privacy. Communications of the ACM, 38(12), 40-47.  ",
      "doi": "10.1145/219663.219678"
    },
    {
      "text": "Weisband, S. P., Schneider, S. K., &amp; Connolly, T. (1995). Computer-mediated communication and social information: Status salience and status awareness. Academy of Management Journal, 38, 1124-1151.",
      "doi": ""
    },
    {
      "text": "Weizenbaum, J. (1976). Computer power and human reason. San Francisco: Freeman. ",
      "doi": "10.5555/540249"
    },
    {
      "text": "Welch, R. B., Blackmon, T. T., Liu, A., Mellers, B. A., &amp; Stark, L. W. (in press). The effects of pictorial realism, delay of visual feedback, and observer interactivity on the subjective sense of presence. Presence: Teleoperators And Virtual Environments.",
      "doi": ""
    }
  ]
}