{
  "doi": "10.1145/238386.238462",
  "title": "An empirical evaluation of design rationale documents",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "150-156",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "design methodology",
    "reuse",
    "design rationale"
  ],
  "authors": [
    {
      "name": "Laurent Karsenty",
      "institution": "ARAMIIHS, 31 rue des Cosmonautes, Z.I. du Palays, F-31077 Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81316488850",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bannon L.J. and Kuutti K. Shifting Perspectives on Organizational Memory: From Storage to Active Remembering. IEEE Hawaii Inteernational Conference on System Sciences (HICSS'96), January 1996. ",
      "doi": "10.5555/795700.798548"
    },
    {
      "text": "Boose, J.H., Bradshaw, J., and Shema D.B. Knowledge-based Design Rationale Capture: Automating Engineering Trade Studies. In: Green M. (Ed.) Knowledge Aided Design, NY: Academic Press, 1992.",
      "doi": ""
    },
    {
      "text": "Boy, G. Supportability-based design rationale. In Proceedings of the 6th IFAC Symposium on Analysis, Design and Evaluation of Man-Machine Systems, 1995.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. The Nurberg Funnel: Designing minimalist instruction for practical computer skill. Cambridge, MA: MIT Press, 1990. ",
      "doi": "10.5555/80371"
    },
    {
      "text": "Carroll J.M. and Moran T.P. (Eds.) Human-Computer Interaction, Special Issue on Design Rationale, 6(3&amp;4), 1991.",
      "doi": ""
    },
    {
      "text": "Conklin, J.E. and Begeman, M.L. gIBIS: A Hypertext Tool for Exploratory Policy Discussion, ACM Transactions on Office Information Systems, 6,303-331, 1988.  ",
      "doi": "10.1145/58566.59297"
    },
    {
      "text": "Fischer, G., McCall, R. and Morch A.I. Design environments for constructive and argumentative design. In CHI'89, 1989.  ",
      "doi": "10.1145/67449.67501"
    },
    {
      "text": "Herbsleb, J.D., and Kuwana, E. Preserving Knowledge in Design Projects: What Designers Need to Know. INTERCHI'93, 1993.  ",
      "doi": "10.1145/169059.169061"
    },
    {
      "text": "Karsenty, L., and Br~zillon, P. Cooperative problem solving and explanation. Expert Systems with Application, 8(4), 445-462, 1995.",
      "doi": ""
    },
    {
      "text": "Klein, M. Capturing Design Rationale in Concurrent Engineering Teams. IEEE Computer, 26(1), 39-47, 1993.  ",
      "doi": "10.5555/165312.165323"
    },
    {
      "text": "Lee J. and Lai K. What's in Design Rationale?. Human-Computer Interaction, 6(3&amp;4), 251-280, 1991.",
      "doi": ""
    },
    {
      "text": "MacLean, A., Young, R.M., Bellotti, V. and Moran T.P., Questions, options and criteria: Elements of design space analysis, Human-Computer Interaction, 6(3&amp;4), 201-250, 1991.",
      "doi": ""
    },
    {
      "text": "Shum S. &amp; Hammond N., Argumentation-based design rationale: what use at what cost? International Journal of Human-Computer Studies, 40, 603-652, 1994.  ",
      "doi": "10.1006/ijhc.1994.1029"
    },
    {
      "text": "Terveen, L.G., Selfridge, P.G. and Long, M.D. From \"Folklore\" to \"Living Design Memory\". In INTERCHI'93, 1993.  ",
      "doi": "10.1145/169059.169062"
    }
  ]
}