{
  "doi": "10.1145/238386.238538",
  "title": "Exploring the unrealized potential of computer-aided drafting",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "332-339",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "task decomposition",
    "CAD",
    "learning"
  ],
  "authors": [
    {
      "name": "Suresh K. Bhavnani",
      "institution": "Dept. of Architecture, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100435759",
      "orcid": "missing"
    },
    {
      "name": "Bonnie E. John",
      "institution": "Computer Science Department, Psychology, and HCI Institute, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R. Cognitive Psychology and its Implications. W.H.Freeman and Company, New York, 1990.",
      "doi": ""
    },
    {
      "text": "Beakley, G.C., Autore, D.D., and Patterson, T.L. Architectural Drawing and Design. Macmillan Publishing Company, New York, 1984.",
      "doi": ""
    },
    {
      "text": "Bietz, W., Langner, T., Luczak, H., Muller, T. and Springer, J. Evaluation of a compact CAD-course in laboratory experiments, International Journal of Human Computer Interaction, (1990): 2, 2, 111-135.",
      "doi": ""
    },
    {
      "text": "Bhavnani, S.K., Flemming, U., Forsythe, D.E., Garrett, J.H., Shaw, D.S., and Tsai, A. CAD Usage in an Architectural Office: From Observation to Active Assistance, Automation in Construction (in press).",
      "doi": ""
    },
    {
      "text": "Bhavnani, S.K., Garrett, J.H., Flemming, U., and Shaw, D.S. Towards Active Assistance. Bridging the Generations-Proceedings of the International Workshop on the Future Directions of Computer-Aided Engineering, D. Rehak, (Ed.), (1994) 1183-1188. Carnegie Mellon University, Pittsburgh, PA.",
      "doi": ""
    },
    {
      "text": "Bowen W. The Puny Payoff from Office Computers. In T. Forester, (Ed.), Computers in the Human Context, Basil Blackwell, New York, 1989. ",
      "doi": "10.5555/79096.79133"
    },
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. The Psychology of Human-Computer Interaction. Hillsdale, NJ: Lawrence Erlbaum Associates, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Ching, F. Architectural Graphics. Van Nostrand Reinhold Company, New York, 1975.",
      "doi": ""
    },
    {
      "text": "Clement, J. A Conceptual Model Discussed by Galileo and Used Intuitively by Physics Students. In Gentner D., and Stevens D (Eds.), Mental Models. Lawrence Erlbaum Associates, Publishers, Hillsdale, 1983.",
      "doi": ""
    },
    {
      "text": "Crosley, L.M. The Architect's Guide to Computer-Aided Design. John Wiley and Sons, New York, 1988. ",
      "doi": "10.5555/61805"
    },
    {
      "text": "Landauer, T. K. The trouble with computers: Usefulness, usability, and productivity. 1995 Cambridge, Mass: MIT Press. ",
      "doi": "10.5555/200761"
    },
    {
      "text": "Lang, G.T., Eberts, R. E., Gabel, M. G., and Barash, M.M. Extracting and Using Procedural Knowledge in a CAD Task. IEEE Transactions on Engineering Management, (1991) 38, 257-68.",
      "doi": ""
    },
    {
      "text": "Luczak, H., Beitz, W., Springer, J. and Langner, T. Frictions and frustrations in creative-informatory work with computer aided design-CAD-systems. Proceedings of the Fourth International Conference on Human-Computer Interaction, (1991), 175-9.",
      "doi": ""
    },
    {
      "text": "Mitchell, W.J., Liggett, R.S., and Kevan, T. The Art of Computer Graphics Programming. Van Nostrand Reinhold Company, New York, 1987.",
      "doi": ""
    },
    {
      "text": "Majchrzak, A. Effect of CAD on the jobs of drafters and engineers: a quantitative case study, International Journal of Man-Machine Studies, (1990): 32, 3, 245-62.  ",
      "doi": "10.1016/S0020-7373%2808%2980001-6"
    },
    {
      "text": "Obermeyer, T.L. AutoCAD Architectural Lab Manual. McGraw-Hill Book Company, 1987. ",
      "doi": "10.5555/542403"
    },
    {
      "text": "PSMJ CADD application and user survey (Professional Services Management Journal, 1994).",
      "doi": ""
    },
    {
      "text": "Strassmann, P.A. The Business Value of Computers. The Information Economics Press New Canaan, CT, 1990. ",
      "doi": "10.5555/532977"
    },
    {
      "text": "Vosniadou, S., and Brewer, W.F. Mental Models of Earth: A Study of Conceptual Change in Childhood. Cognitive Psychology, (1992), 24, 535-538.",
      "doi": ""
    }
  ]
}