{
  "doi": "10.1145/238386.238533",
  "title": "Differences in movement microstructure of the mouse and the finger-controlled isometric joystick",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "300-307",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "isometric joystick",
    "Fitts' law",
    "pointing devices",
    "mouse",
    "movement microstructure",
    "characteristics of movement",
    "psychomotor models",
    "performance differences"
  ],
  "authors": [
    {
      "name": "Anant Kartik Mithal",
      "institution": "Sunsoft Developer Products, 2550 Garcia Ave MS MPK 16-303, Mountain View, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100024603",
      "orcid": "missing"
    },
    {
      "name": "Sarah A. Douglas",
      "institution": "Department of Computer Science, University of Oregon, Eugene, OR",
      "img": "/do/10.1145/contrib-81330490449/rel-imgonly/sarah_douglas.jpg",
      "acmid": "81330490449",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Boritz, J., Booth, K.S. and Cowan, W.B. Fitts' Law Studies of Directional Mouse Movement. in Graphics Interface '91. 1991. Toronto, Ontario, Canada: Canadian Man-Computer Communications Society p. 216-233.",
      "doi": ""
    },
    {
      "text": "Card, S.K., English, W.K., and Burr, B.J. Evaluation of Mouse, Rate-Controlled Isometric Joystick, Step Keys, and Text Keys for Text Selection on a CRT. Ergonomics, 1978. 21(8): p. 601-613.",
      "doi": ""
    },
    {
      "text": "Douglas, S.A. and Mithal, A.K. The Effect of Reducing Homing Time on the Speed of a Finger-Controlled Isometric Pointing Device. Proc. CHI '94. 1994. Boston: ACM p. 411-416.  ",
      "doi": "10.1145/191666.191805"
    },
    {
      "text": "Douglas, S.A. and Mithal, A.K. Human Performance Evaluation of a Finger-Controlled Pointing Device. 1993, TR 93-11, Dept. of Computer Science, University of Oregon, Eugene, OR 97403-1202.",
      "doi": ""
    },
    {
      "text": "Epps, B.W., Comparison of Six Cursor Control Devices Based on Fitts' Law Models. Proc. of the Annual Meeting of the Human Factors Society, 1986: p. 327-331.",
      "doi": ""
    },
    {
      "text": "Fitts, P.M., The Information Capacity of the Human Motor System in Controlling the Amplitude of Movement. Journal of Experimental Psychology, 1954. 47(6): p. 381-391.",
      "doi": ""
    },
    {
      "text": "Jagacinski, R.J., Repperger, D.W., Moran, M.S., Ward, S.L., and Glass, B., Fitts' Law and the Microstructure of Rapid Discrete Movements. Journal of Experimental Psychology: Human Perception and Performance, 1980. 6(2): p. 309-320.",
      "doi": ""
    },
    {
      "text": "Langolf, G.D., Chaffin, D.B., and Foulke, J.A. An investigation of Fitts' Law using a wide range of movement amplitudes. Journal of Motor Behavior, 1976. 8(2): p. 113-128.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S., Fitts' Law as a Research and Design Tool in Human-Computer Interaction. Human-Computer Interaction, 1992. 7(1): p. 91-139.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I.S., Sellen, A. and Buxton, W. A Comparison of Input Devices in Elemental Pointing and Dragging Tasks. in Human Factors in Computing Systems: Proc. CHI '91. 1991. New Orleans: ACM p. 161-166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "Meyer, D.E., Smith, K.J.E., Kornblum, S., Abrams, R.A., and Wright, C.E., Speed-Accuracy Tradeoffs in Aimed Movements: Toward a Theory of Rapid Voluntary Action. in Attention and Performance XIII. M. Jeanerod, Ed. 1990, Erlbaum: Hillsdale, NJ. p. 173-226.",
      "doi": ""
    },
    {
      "text": "Mithal, A.K., Using Psychomotor Models of Movement in the Analysis and Design of Computer Pointing Devices. Doctoral Dissertation, Computer and Information Science. 1995, University of Oregon: Eugene. p. 176. ",
      "doi": "10.1145/223355.223431"
    },
    {
      "text": "Rutledge, J.D. and T. Selker. Force-to-Motion Functions for Pointing. in Human-Computer Interaction - INTERACT '90. 1990. Amsterdam: North-Holland p. 701 706. ",
      "doi": "10.5555/647402.725310"
    },
    {
      "text": "Stein, R.B. and R.G. Lee, Tremor and Clonus, in Handbook of Physiology: The Nervous System II. 1989. p. 325-342.15. Walker, N., Meyer, D.E., and Smelcer, J.B. Spatial and Temporal Characteristics of Rapid Cursor Positioning Movements with Electromechanical Mice in Human Computer Interaction. Human Factors, 1993. 35(3): p. 431-458.",
      "doi": ""
    }
  ]
}