{
  "doi": "10.1145/238386.238526",
  "title": "Reusable hierarchical command objects",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "260-267",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "toolkits",
    "user interface development environment",
    "command objects",
    "undo",
    "redo",
    "amulet"
  ],
  "authors": [
    {
      "name": "Brad A. Myers",
      "institution": "Human Computer Interaction Institute, School of Computer Science, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100013136/rel-imgonly/brad-myers-120x120.jpg",
      "acmid": "81100013136",
      "orcid": "0000-0002-4769-0219"
    },
    {
      "name": "David S. Kosbie",
      "institution": "Microsoft Corporation, One Microsoft Way, Redmond, WA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100250268",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Thomas Berlage. \"A Selective Undo Mechanism for Graphical User Interfaces Based on Command Objects.\" ACM Transactions on Computer Human Interaction, 1 (Sept. 1994), 269-294.  ",
      "doi": "10.1145/196699.196721"
    },
    {
      "text": "Michael D. Byrne, Scott D. Wood, Piyawadee Sukaviriya, James D. Foley and David E. Kieras. Automating Interface Evaluation. Human Factors in Computing Systems, Proceedings SIGCHI'94, Boston, MA, April, 1994, pp. 232-237.  ",
      "doi": "10.1145/191666.191752"
    },
    {
      "text": "David S. Kosbie and Brad A. Myers. A System-Wide Macro Facility Based on Aggregate Events: A Proposal. In Allen Cypher, Ed., Watch What I Do: Programming by Demonstration, MIT Press, Cambridge, MA, 1993, pp. 433-444. ",
      "doi": "10.5555/168080.168139"
    },
    {
      "text": "David Kosbie. Hierarchical Event Histories in Graphical User Interfaces. Ph.D. Th., Computer Science Department, Carnegie Mellon University, 1996. In progress.",
      "doi": ""
    },
    {
      "text": "David S. Kosbie and Brad A. Myers. Extending Programming By Demonstration With Hierarchical Event Histories. In Brad Blumenthal, Juri Gornostaev and Claus Unger, Ed., Human-Computer Interaction: 4th International Conference EWHCI'94, Lecture Notes in Computer Science, Vol. 876, Springer-Verlag, Berlin, 1994, pp. 128-139. Abstract and Postscript ",
      "doi": "10.5555/646182.682754"
    },
    {
      "text": "Brad A. Myers. \"A New Model for Handling Input.\" ACM Transactions on Information Systems, 8, 3 (July 1990), 289-320.  ",
      "doi": "10.1145/98188.98204"
    },
    {
      "text": "Brad A. Myers, Dario A. Giuse, Roger B. Dannenberg, Brad Vander Zanden, David S. Kosbie, Edward Pervin, Andrew Mickish, and Philippe Marchal. \"Garnet: Comprehensive Support for Graphical, Highly-Interactive User Interfaces.\" IEEE Computer, 23, 11 (Nov. 1990), 71-85.  ",
      "doi": "10.1109/2.60882"
    },
    {
      "text": "Brad A. Myers. \"Demonstrational Interfaces: A Step Beyond Direct Manipulation.\" IEEE Computer, 25, 8 (August 1992), 61-73.  ",
      "doi": "10.1109/2.153286"
    },
    {
      "text": "David L. Parnas. \"Designing Software for Ease of Extension and Constraction.\" IEEE Transactions on Software Engineering, SE-5, 2 (March 1979), 128-138.",
      "doi": "10.1109/TSE.1979.234169"
    },
    {
      "text": "R. Taylor, K. Nies, G. Bolcer, C. MacFarlane, and K. Anderson. \"Chiron-1: A Software Architecture for User Interface Development, Maintenance, and Run-Time Support.\" ACM Transactions on Computer Human Interaction, 2 (June 1995), 105-144.  ",
      "doi": "10.1145/210181.210182"
    },
    {
      "text": "John M. Vlissides and Mark A. Linton. \"Unidraw: A Framework for Building Domain-Specific Graphical Editors.\" ACM Transactions on Information Systems, 8, 3 (July 1990), 204-236.  ",
      "doi": "10.1145/98188.98197"
    },
    {
      "text": "David Wilson. Programming with MacApp. Addison-Wesley Publishing Company, Reading, MA, 1990. ",
      "doi": "10.5555/101160"
    }
  ]
}