{
  "doi": "10.1145/238386.238405",
  "title": "Emacspeak—a speech interface",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "66-71",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "speech interface",
    "direct access",
    "audio formatting",
    "spoken feedback",
    "speech as a first-class I/O medium"
  ],
  "authors": [
    {
      "name": "T. V. Raman",
      "institution": "Cambridge Research Lab., Digital Equipment Corp., Bldg 650, One Kendall Square, Cambridge MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100054172",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "W. Buxton, W. Gaver, and S. Bly. The use of nonspeech audio at the interface. Tutorial Notes, CHI '88., 1988.",
      "doi": ""
    },
    {
      "text": "Meera M. Blattner, Ephraim P. Glinert, and Albert L. Papp. Sonic Enhancements for 2-D Graphic Displays, and Auditory Displays. To be published by Addison-Wesley in the Santa Fe Institute Series. IEEE, 1993.",
      "doi": ""
    },
    {
      "text": "William Gaver. Synthesizing auditory icons. Proceedings of INTERCHI 1993, pages 228-235, April 1993.  ",
      "doi": "10.1145/169059.169184"
    },
    {
      "text": "K. I. Joy, D. A. Sumikawa, M. M. Blattner, and R. M. Greenberg. Guidelines for the syntactic design of audio cues in computer interfaces. Nineteenth Annual Hawaii International Conference on System Sciences, 1986.",
      "doi": ""
    },
    {
      "text": "Elizabeth D. Mynatt and W. Keith Edwards. Mapping GUIs to auditory interfaces. Proceedings ACM UIST92, pages 61-70, 1992.  ",
      "doi": "10.1145/142621.142629"
    },
    {
      "text": "E.D. Mynatt and G. Weber. Nonvisual presentation of graphical user interfaces: Contrasting two approaches. Proceedings of the 1994 ACM Conference on Human Factors in Computing Systems (CHI'94), April 1994.  ",
      "doi": "10.1145/191666.191732"
    },
    {
      "text": "E.D. Mynatt. Auditory Presentation of Graphical User Interfaces. Santa Fe. Addison-Wesley: Reading MA., 1994.",
      "doi": ""
    },
    {
      "text": "T. V. Raman. Audio System for Technical Readings. PhD thesis, Cornell University, May 1994. Url: Hot Link /personal/raman/raman.html. ",
      "doi": "10.5555/221752"
    },
    {
      "text": "D. A. Sumikawa, Blattner M. M., and R. M. Greenberg. Earcons and icons: Their structure and common design principles. Visual Programming Environments, 1990.",
      "doi": ""
    },
    {
      "text": "James Thatcher. Screen reader/2: Access to os/2 and the graphical user interface. Proc. of The First Annual ACM Conference on Assistive Technologies (ASSETS '94), pages 39-47, Nov 1994.  ",
      "doi": "10.1145/191028.191039"
    },
    {
      "text": "E. D. Mynatt W. K. Edwards and K. Stockton. Providing access to graphical user interfaces - not graphical screens. Proc. Of The First Annual ACM Conference on Assistive Technologies (ASSETS '94), pages 47-54, Nov 1994.  ",
      "doi": "10.1145/191028.191041"
    },
    {
      "text": "Nicole Yankelovich, Gina Anne Levow, and Matt Marx. Designing speechacts: Issues in speech user interfaces. In Proceedings of CHI95, Human Factors In Computing Systems, pages 369-376. Sun Micro Systems, May 1995.  ",
      "doi": "10.1145/223904.223952"
    }
  ]
}