{
  "doi": "10.1145/238386.238583",
  "title": "An experimental evaluation of transparent menu usage",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "391-398",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "display design",
    "user interface design",
    "toolglass",
    "evaluation",
    "transparency",
    "interaction technology"
  ],
  "authors": [
    {
      "name": "Beverly L. Harrison",
      "institution": "Dept. of Industrial Engineering and University of Toronto, Toronto, Ontario, Canada, M5S 3G9 and Alias/Wavefront, 110 Richmond Street East, Toronto, Ontario, Canada, M5C 1P1",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100010116",
      "orcid": "missing"
    },
    {
      "name": "Kim J. Vicente",
      "institution": "Dept. of Industrial Engineering, University of Toronto, Toronto, Ontario, Canada, M5S 3G9",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100020575",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bier, E. A., Stone, M. C., Pier, K., Buxton, W., and DeRose, T. D. Toolglass and magic lenses: The see-through interface. Proc. of SIGGRAPH'93. Anaheim, CA, 1993. 73-80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Bier, E. A., Stone, M. C., Fishkin, K., Buxton, W., and Baudel, T. A Taxonomy of See-Through Tools Proc. of CHI'94, Boston, Mass. 1994, 358-364.  ",
      "doi": "10.1145/191666.191786"
    },
    {
      "text": "Foley, J.D., van Dam, A., Feiner, S.K., and Hughes, J.F. Computer Graphics - Principles and Practice (2nd ed), Reading, Mass.: Addison-Wesley, 1992. ",
      "doi": "10.5555/83821"
    },
    {
      "text": "Harrison, B. L., Ishii, H., Vicente, K. J., Buxton, B. Transparent Layered User Interfaces: An Evaluation of a Display Design Space to Enhance Focused and Divided Attention. Proc. of CHI'95, Denver, Colorado. 1995. 317-324.  ",
      "doi": "10.1145/223904.223945"
    },
    {
      "text": "Harrison, B. L., Kurtenbach, G., and Vicente, K. J. An Experimental Evaluation of Transparent User Interface Tools and Information Content. Proc. of UIST'95, November, 1995, 81-90.  ",
      "doi": "10.1145/215585.215669"
    },
    {
      "text": "Ishii, H. and Kobayashi, M. Clearboard: A seamless medium for shared drawing and conversation with eye contact. Proc. of CHI'91, Monterey, CA, 1991. 525-532.  ",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Ishii, H. TeamWorkStation: Toward a Seamless Shared Workspace. Proc.of CSCW'90 L.A., CA, 1990. 13-26  ",
      "doi": "10.1145/99332.99337"
    },
    {
      "text": "Knowlton, K. C. Computer displays optically superimposed on input devices. Bell System Technical Journal, Vol. 56, No. 3, March, 1977. 367-383.",
      "doi": ""
    },
    {
      "text": "Schmandt, C. Spatial input/display correspondance in a stereoscopic computer graphic workstation. Computer Graphics, Vol. 17, No. 3., 1983, 253-259.  ",
      "doi": "10.1145/964967.801156"
    },
    {
      "text": "Stone, M. C., Fishkin, K., and Bier, E. A. The Movable Filter as a User Interface Tool. Proc. of CHI'94, Boston, Mass. 1994. 306-312.  ",
      "doi": "10.1145/191666.191774"
    },
    {
      "text": "Stroop, J. R. Factors affecting speed in serial verbal reactions. Journal of Experimental Psychology, 18, 1935, 643-662.",
      "doi": ""
    },
    {
      "text": "Wickens, C. D., Martin-Emerson, R., and Larish, I. Attentional tunneling and the Head-up Display. Proc. of the 7th Annual Symposium on Aviation Psychology, Ohio State University, Ohio, 1993. 865-870.",
      "doi": ""
    },
    {
      "text": "Zhai, S., Buxton, W., and Milgram, P. The \"silk cursor\": Investigating transparency for 3D target acquisition. Proc. of CHI'94, Boston, MA., 1994. 459-464.  ",
      "doi": "10.1145/191666.191822"
    }
  ]
}