{
  "doi": "10.1145/238386.238436",
  "title": "Pen computing for air traffic control",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "87-94",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "prototyping",
    "pen computing",
    "direct manipulation",
    "mark-based input",
    "gesture recognition",
    "air traffic control",
    "touch-screen"
  ],
  "authors": [
    {
      "name": "Stéphane Chatty",
      "institution": "Centre d'Etudes de la Navigation Aérienne, 7 avenue Edouard Belin, 31055 Toulouse Cedex, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100203820",
      "orcid": "missing"
    },
    {
      "name": "Patrick Lecoanet",
      "institution": "Centre d'Etudes de la Navigation Aérienne, Orly Sud 205, 94542 Orly Aerogares, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100454135",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "T. Baudel and M. Beaudouin-Lafon. Charade: remote control of objects using free-hand gestures. Communications of the ACM, pages 28-35, July 1993.  ",
      "doi": "10.1145/159544.159562"
    },
    {
      "text": "E. Bier, M. Stone, K. Fishkin, W. Buxton, and T. Baudel. A taxonomy of see-through tools. In Proceedings of the ACM CHI, pages 358-364. Addison-Wesley, 1994.  ",
      "doi": "10.1145/191666.191786"
    },
    {
      "text": "J. Callahan, D. Hopkins, M. Weiser, and B. Shneiderman. An empirical comparison of pie vs linear menus. In Proceedings of the ACM CHI, pages 95-100, 1988.  ",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "S. Chatty. Extending a graphical toolkit for two-handed interaction. In Proceedings of the ACM UIST, pages 195-204. Addison-Wesley, Nov. 1994.  ",
      "doi": "10.1145/192426.192500"
    },
    {
      "text": "C. Frankish. Recognition accuracy and user acceptance of pen interfaces. In Proceedings of the ACM CHI, pages 503-510. Addison-Wesley, 1995.  ",
      "doi": "10.1145/223904.223972"
    },
    {
      "text": "C. Garoff-Mercier and M. Chollet. Analyse de l'activit~ des contr~leurs du trafic a~rien : utilisation des vecteurs d'information et des communications. Technical Report R90-07, Centre d'Etudes de la Navigation A~erienne, 1990.",
      "doi": ""
    },
    {
      "text": "D. Goldberg and C. Richardson. Touch-typing with a stylus. In Proceedings of the ACM CHI, pages 80-87, 1993.  ",
      "doi": "10.1145/169059.169093"
    },
    {
      "text": "G. Kurtenbach and T. Baudel. Hypermarks: issuing commands by drawing marks in Hypercard. In CHI'92 Posters and Short Talks, page 64, 1992.  ",
      "doi": "10.1145/1125021.1125081"
    },
    {
      "text": "G. Kurtenbach and W. Buxton. Issues in combining marking and direct manipulation techniques. In Proceedings of the ACM UIST, pages 137-144, 1991.  ",
      "doi": "10.1145/120782.120797"
    },
    {
      "text": "A. Meyer. Pen computing. A technology overview and a vision. SIGCHI Bulletin, 27(3):46-90, 1995.  ",
      "doi": "10.1145/221296.221308"
    },
    {
      "text": "J. K. Ousterhout. Tcl and the Tk toolkit. Addison-Wesley, 1994. ",
      "doi": "10.5555/174724"
    },
    {
      "text": "D. H. Rubine. The automatic recognition of gestures. PhD thesis, Carnegie Mellon University, 1991. ",
      "doi": "10.5555/145726"
    },
    {
      "text": "D. Venolia and F. Neiberg. T-Cube: a fast, self-disclosing pen-based alphabet. In Proceedings of the ACM CHI, pages 265-270, 1994.  ",
      "doi": "10.1145/191666.191761"
    },
    {
      "text": "P. Wellner. Interacting with paper on the Digital Desk. Communications of the ACM, 36(7), July 1993.  ",
      "doi": "10.1145/159544.159630"
    }
  ]
}