{
  "doi": "10.1145/238386.238574",
  "title": "Integrating human factors in customer support systems development using a multi-level organisational approach",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "368-375",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "corporate mandate",
    "standards and guidelines",
    "usability",
    "graphical user interface",
    "systems development life cycle",
    "human factors",
    "resourcing"
  ],
  "authors": [
    {
      "name": "Anne Miller",
      "institution": "Customer Support Platform Usability Team, Information Technology Group, Telstra, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100160680",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Burger, K. (1995). Applying Usability Standards and Guidelines within a Multi-disciplinary Team. Conference Proceedings: Human Factors in Telecommunications, 15th International Symposium on Human Factors in Telecommunications. Melbourne.",
      "doi": ""
    },
    {
      "text": "Billingsley, P. (1995). Starting from scratch: Building a usability program at Union Pacific Railroad. Interactions, Oct '95.  ",
      "doi": "10.1145/225362.225366"
    },
    {
      "text": "Constantine, L. &amp; Lockwood, L. (1994) Essential modelling for user interface design: essential use of cases and use context. OZCHI'94 Tutorials. Melbourne: Computer Human Special Interest Group of the Ergonomics Society of Australia.",
      "doi": ""
    },
    {
      "text": "Ernst &amp; Young International. (1995). Ernst &amp; Young Navigator Systems Series - Version 3.0: Client/Server Analysis using a 4GL/GUI. USA: Ernst &amp; Young International, Ltd.",
      "doi": ""
    },
    {
      "text": "Holtzblatt, K &amp; Jones, S. (1993). Contextual Inquiry: A participatory technique for system design. In Schuler, D &amp; Namioka, A. (Eds), (1993). Participatory design, principles and practice. New Jersey: Lawrence Erlbaum Associates, Inc.",
      "doi": ""
    },
    {
      "text": "Lindgaard, G. (1994). Usability Testing and System Evaluation: A Guide for Designing Useful Computer Systems. London: Chapman &amp; Hall.",
      "doi": ""
    },
    {
      "text": "Lindgaard, G. (1995). Cementing human factors into product design: Moving beyond policies. Conference Proceedings: Human Factors in Telecommunications,15th International Symposium on Human Factors in Telecommunications. Melbourne.",
      "doi": ""
    },
    {
      "text": "Lund, A.M. (1994). The evolution of broad-band work in Ameritech's customer interface systems and human factors department. In M.E. Wiklund (Ed.), (1994) Usability in Practice: How companies develop user-friendly products. Cambridge, Massachusetts: AP Professional. ",
      "doi": "10.5555/180981.180996"
    },
    {
      "text": "Moyal, A. (1984). Clear across Australia: a history of telecommunications. Melbourne: Thomas Nelson Australia",
      "doi": ""
    },
    {
      "text": "Mrazek, D &amp; Rafeld, M. (1992). Integrating human factors on a large scale: Product usability champions. Proceedings CHI'92. p. 565-570.  ",
      "doi": "10.1145/142750.142989"
    },
    {
      "text": "Muller, M. (1993). PICTIVE: Democratizing the dynamics of the design session. In Schuler, D &amp; Namioka, A. (Eds), (1993). Participatory design, principles and practice. New Jersey: Lawrence Erlbaum Associates, Inc.",
      "doi": ""
    },
    {
      "text": "Telstra. (1994). The Overall Systems Architecture: Phase 2 Update. Melbourne: Telstra Australia",
      "doi": ""
    }
  ]
}