{
  "doi": "10.1145/238386.238534",
  "title": "The influence of muscle groups on performance of multiple degree-of-freedom input",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "308-315",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "hand",
    "motor control",
    "input devices",
    "6 DOF input",
    "fingers",
    "homunculus model",
    "3-D interface",
    "muscle group differences",
    "arm"
  ],
  "authors": [
    {
      "name": "Shumin Zhai",
      "institution": "Department of Industrial Engineering and Department of Computer Science, University of Toronto, Toronto, Ontario, Canada, MS4 1A4",
      "img": "/do/10.1145/contrib-81408591988/rel-imgonly/81408591988.jpg",
      "acmid": "81408591988",
      "orcid": "0000-0003-0752-2090"
    },
    {
      "name": "Paul Milgram",
      "institution": "Department of Industrial Engineering, University of Toronto, Toronto, Ontario, Canada, MS4 1A4",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100023721",
      "orcid": "missing"
    },
    {
      "name": "William Buxton",
      "institution": "Department of Computer Science, University of Toronto, Toronto, Ontario, Canada, MS4 1A4",
      "img": "/do/10.1145/contrib-81452616426/rel-imgonly/81452616426.jpg",
      "acmid": "81452616426",
      "orcid": "0000-0002-0170-7097"
    }
  ],
  "references": [
    {
      "text": "Boff, K. R. and Lincoln, J. E. Engineering Data Compendium - Human Perception and Performance. Armstrong Aerospace Medical Research Laboratory, Wright-Patterson Air Force Base, Ohio, 1988.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Mackinlay, J. D., and Robertson, G. G. A morphological analysis of the design space of input devices. ACM Transactions on Information Systems, 9, 2 (1991), 99-122.  ",
      "doi": "10.1145/123078.128726"
    },
    {
      "text": "Digital Image Design Inc. The Cricket, product information. New York, NY., 1993.",
      "doi": ""
    },
    {
      "text": "Fitts, P. M. The information capacity of the human motor system in controlling the amplitude of movement. Journal of Experimental Psychology, 47, (1954), 381-391.",
      "doi": ""
    },
    {
      "text": "Fitzmaurice, G. W., Ishii, H., and Buxton, W. Bricks: Laying the foundation for graspable user interfaces, in Proc. of CHI'95: ACM Conference on Human Factors in Computing Systems (Denver, Colorado, USA, 1995), pp. 442-449.  ",
      "doi": "10.1145/223904.223964"
    },
    {
      "text": "Gibbs, C. B. Controller design: Interactions of controlling limbs, time-lags and gains in positional and velocity systems. Ergonomics, 5, 2 (1962), 385-402.",
      "doi": ""
    },
    {
      "text": "Gibbs, C. B. Comments on 'An investigation into the comparative suitability of forearm, hand and thumb controls in acquisition tasks' by Hammerton and Tickner. Ergonomics, 10, 4 (1967), 431-432.",
      "doi": ""
    },
    {
      "text": "Gibson, J. J. The ecological approach to visual perception. Houghton Mifflin Company, Boston, 1979.",
      "doi": ""
    },
    {
      "text": "Hammerton, M. and Tickner, A. H. An investigation into the comparative suitability of forearm, hand and thumb controls in acquisition tasks. Ergonomics, 9, 2 (1966), 125-130.",
      "doi": ""
    },
    {
      "text": "Hammerton, M. and Tickner, A. H. Reply to Comments by C.B. Gibbs. Ergonomics, 10, 4 (1967), 433.",
      "doi": ""
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J. C., and Kassell, N. F. Passive real-world interface props for neurosurgical visualization, in Proc. of CHI'94: ACM conference on Human Factors in Computing Systems (Boston, 1994), pp. 452-458.  ",
      "doi": "10.1145/191666.191821"
    },
    {
      "text": "Hinckley, K., Pausch, R., Goble, J. C., and Kassell, N. F. A survey of design issues in spatial input, in Proc. of ACM Conference on User Interface Software and Technology (1994), pp. 213-222.  ",
      "doi": "10.1145/192426.192501"
    },
    {
      "text": "Howell, D. C. Statistical Methods for Psychology (Third ed.). PWS-KENT Publishing Company, Boston, 1992.",
      "doi": ""
    },
    {
      "text": "Jacob, R. J. K., Sibert, L. E., McFarlane, D. C., and Mullen, M. P. Integrality and separability of input devices. ACM Transactions on Computer-Human Interaction, 1, 1 (1994), 3-26.  ",
      "doi": "10.1145/174630.174631"
    },
    {
      "text": "Keele, S. W. Motor Control, in K. R. Boff, L. Kaufman, &amp; J. P. Thomas (Eds.), Handbook of Perception and Human Performance. (pp. 30.1-30.60). John Wiley &amp; Sons, New York, 1986.",
      "doi": ""
    },
    {
      "text": "Langolf, G. D., Chaffin, D. B., and Foulke, J. A. An investigation of Fitts' law using a wide range of movement amplitudes. Journal of Motor Behavior, 8, 2 (1976), 113-128.",
      "doi": ""
    },
    {
      "text": "Logitech. 2D/6D Mouse technical reference manual. In Fremont, CA 94555: Logitech Inc., 1991.",
      "doi": ""
    },
    {
      "text": "MacKenzie, C. L. and Iberall, T. The Grasping Hand. North-Holand, Amsterdam, 1994.",
      "doi": ""
    },
    {
      "text": "MacKenzie, I. S., Sellen, A., and Buxton, W. A comparison of input devices in elemental pointing and dragging tasks, in Proc. of CHI'91: ACM Conference on Human Factors in Computing Systems (New Orleans, Lousiana, 1991), pp. 161-166.  ",
      "doi": "10.1145/108844.108868"
    },
    {
      "text": "Polhemus. 3BallTM, product information. Polhemus, Cochester, VT., 1993.",
      "doi": ""
    },
    {
      "text": "Poulton, E. C. Unwanted asymmetrical transfer effects with balanced experimental designs. Psychological Bulletin, 66, 1 (1966), 1-8.",
      "doi": ""
    },
    {
      "text": "Poulton, E. C. Bias in Quantifying Judgements. Lawrence Erlbaum Associates, Hove and London, 1989.",
      "doi": ""
    },
    {
      "text": "Sage, G. H. Introduction to Motor Behavior, A Neuropsychological Approach (2nd ed). Addison-Wesley Publishing Company, 1977.",
      "doi": ""
    },
    {
      "text": "Shepard, R. N. and Metzler, J. Mental rotation of three-dimensional objects. Science, 171, 3972 (1971), 701-703.",
      "doi": ""
    },
    {
      "text": "Ware, C. Using hand position for virtual object placement. The Visual Computer, 6, (1990), 245-253.  ",
      "doi": "10.1007/BF01900747"
    },
    {
      "text": "Ware, C. and Jessom, D. R. Using the bat: a six dimensional mouse for object placement. IEEE Computer Graphics and Applications, 8, 6 (1988), 155-160.  ",
      "doi": "10.1109/38.20319"
    },
    {
      "text": "Zhai, S. Human Performance in Six Degree of Freedom Input Control. Ph.D. Thesis , University of Toronto,1995.",
      "doi": ""
    },
    {
      "text": "Zhai, S. and Milgram, P. Human performance evaluation of manipulation schemes in virtual environments, in Proc. of VRAIS'93: the first IEEE Virtual Reality Annual International Symposium (Seattle, USA, 1993), pp. 155-161.",
      "doi": "10.1109/VRAIS.1993.380784"
    },
    {
      "text": "Zhai, S. and Milgram, P. Input Techniques for HCI in 3D Environments, in Proc. of Conference Companion of CHI'94: ACM conference on Human Factors in Computing Systems (Boston, 1994), pp. 85-86.  ",
      "doi": "10.1145/259963.260059"
    }
  ]
}