{
  "doi": "10.1145/238386.238474",
  "title": "The thin glass line: designing interfaces to algorithms",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "181-188",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "tags": [
    "algorithms",
    "folding nets",
    "polyhedra",
    "human-computer interaction"
  ],
  "authors": [
    {
      "name": "Michael Eisenberg",
      "institution": "Department of Computer Science and Institute of Cognitive Science, Campus Box 430, University of Colorado, Boulder CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81322492935",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brown, M. Exploring Algorithms Using Balsa-II. IEEE Computer, May 1988, pp. 14-36.  ",
      "doi": "10.1109/2.56"
    },
    {
      "text": "Brown, M. H. and Sedgewick, R. Techniques for Algorithm Animation. IEEE Software, Jan. 1985, pp. 28-39.",
      "doi": ""
    },
    {
      "text": "Cormen, T.; Leiserson, C.; and Rivest, R. Introduction to Algorithms. McGraw-Hill, New York, 1990. ",
      "doi": "10.5555/80156"
    },
    {
      "text": "Croft, H.; Falconer, K.; and Guy, R. Unsolved Problems in Geometry. Springer-Verlag, New York, 1991.",
      "doi": ""
    },
    {
      "text": "Cypher, A., ed. Watch What I Do. MIT Press, Cambridge MA, 1993",
      "doi": "10.5555/168080"
    },
    {
      "text": "Dourish, P. Accounting for System Behavior: Representation, Reflection, and Resourceful Action. Proc. of Third Decennial Aarhus Conference, Aarhus Denmark, Aug. 1995, pp. 147-156.",
      "doi": ""
    },
    {
      "text": "Eisenberg, M. Programmable Applications: Interpreter Meets Interface. SIGCHI Bulletin, 27:2, 1995, pp. 68-83.  ",
      "doi": "10.1145/202511.202528"
    },
    {
      "text": "Eisenberg, M. and Nishioka, A. Creating Polyhedral Models by Computer. To appear in Journal of Computers in Mathematics and Science Teaching, 1996. ",
      "doi": "10.5555/271603.271610"
    },
    {
      "text": "Fischer, G. Supporting Learning on Demand with Design Environments. In Proceedings of the International Conference on the Learning Sciences, Charlottesville, VA, 1991, pp. 165-172.",
      "doi": ""
    },
    {
      "text": "Fischer, G., Lemke, A.C., Mastaglio, T. and Morch, A. The Role of Critiquing in Cooperative Problem Solving. ACM Transactions on Information Systems, Vol. 9, No. 2, 1991, pp. 123-151.  ",
      "doi": "10.1145/123078.128727"
    },
    {
      "text": "Foley, J; Van Dam, A.; Feiner, S.; and Hughes, J. Computer Graphics: Principles and Practice. Addison- Wesley, Reading, MA, 1990. ",
      "doi": "10.5555/83821"
    },
    {
      "text": "Malkevitch, J. Milestones in the history of polyhedra. In M. Senechal and G. Fleck (eds.), Shaping Space: A Polyhedral Approach, Birkh~user, Boston, 1988, pp. 80-92.",
      "doi": ""
    },
    {
      "text": "Myers, B.; Smith, D. C.; and Horn, B. Report of the \"End-User Programming\" Working Group. In B. Myers (ed.), Languages for Developing User Interfaces. Jones and Bartlett, Boston, 1992, pp. 343-366. ",
      "doi": "10.5555/131302.131320"
    },
    {
      "text": "Nardi, B. A Small Matter of Programming. MIT Press, Cambridge, MA 1993. ",
      "doi": "10.5555/160165"
    },
    {
      "text": "Schoen, D. A. The Reflective Practitioner: How Professionals Think in Action. Basic Books, New York, 1983.",
      "doi": ""
    },
    {
      "text": "Simon, H. The Sciences of the Artificial. MIT Press, Cambridge, MA, 1981. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "Stasko, J. and Patterson, C. Understanding and Characterizing Software Visualization Systems. 1992 IEEE Workshop on Visual Languages, Seattle, Sept. 1992, pp. 3-10.",
      "doi": ""
    }
  ]
}