{
  "doi": "10.1145/238386.238438",
  "title": "Multimodal interfaces for dynamic interactive maps",
  "published": "1996-04-13",
  "proctitle": "CHI '96: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "95-102",
  "year": 1996,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Sharon Oviatt",
      "institution": "Oregon Graduate Institute of Science & Technology, Portland, OR, USA",
      "img": "/do/10.1145/contrib-81100656112/rel-imgonly/handbookv1.png",
      "acmid": "81100656112",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "1995 GIS World Sourcebook. GIS World, Inc., Fort Collins, Colorado, 1995.",
      "doi": ""
    },
    {
      "text": "J. Carletta, R. Caley, and S. Isard. A collection of self-repairs from the map task corpus. Tech. Rep. 47, Human Communication Research Centre, Edinburgh Univ., Scotland, 1993.",
      "doi": ""
    },
    {
      "text": "A. Chapanis, R. N. Parrish, R. B. Ochsman, and G. D. Weeks. Studies in interactive communication: II. The effects of four communication modes on the linguistic performance of teams during cooperative problem solving. Human Factors, 1977, 19(2):101--125.",
      "doi": ""
    },
    {
      "text": "P. R. Cohen, M. Dalrymple, D. B. Moran, F. C. N. Pereira, J. W. Sullivan, R. A. Gargan, J. L. Schlossberg, and S. W. Tyler. Synergistic use of direct manipulation and natural language. In CHI'89 Conf. Proc., New York, 1989, ACM, Addison Wesley, 227--234.  ",
      "doi": "10.1145/67449.67494"
    },
    {
      "text": "I. Lokuge and S. Ishizaki. Geospace: An interactive visualization system for exploring complex information spaces. In CHI '95 Conf. Proc., New York, 1995, ACM:SIGCHI, 409--414.  ",
      "doi": "10.1145/223904.223959"
    },
    {
      "text": "J. G. Neal and S. C. Shapiro. Intelligent multi-media interface technology. In J. W. Sullivan and S. W. Tyler (eds.), Intelligent User Interfaces, , ACM: Addison Wesley, New York, 1991, chap. 3, 45--68.  ",
      "doi": "10.1145/107215.128690"
    },
    {
      "text": "S. L. Oviatt. Predicting spoken disfluencies during human-computer interaction. In K. Shirai (ed.), Proc. of the International Symposium on Spoken Dialogue: New Directions in Human-Machine Communication, Tokyo, Japan, Nov. 1993, 53-56.",
      "doi": ""
    },
    {
      "text": "S. L. Oviatt. Predicting spoken disfluencies during human-computer interaction. Computer Speech and Language, 1995, 9:19--35.",
      "doi": ""
    },
    {
      "text": "S. L. Oviatt and P. R. Cohen. Discourse structure and performance efficiency in interactive and noninteractive spoken modalities. Computer Speech and Language, 1991, 5(4):297--326.",
      "doi": ""
    },
    {
      "text": "S. L. Oviatt, P. R. Cohen, M. W. Fong, and M. P. Frank. A rapid semi-automatic simulation technique for investigating interactive speech and handwriting. In J. Ohala (ed.), Proc. of the ICSLP, Univ. of Alberta, 1992, vol. 2, 1351--1354.",
      "doi": ""
    },
    {
      "text": "S. L. Oviatt, P. R. Cohen, and M. Q. Wang. Toward interface design for human language technology: Modality and structure as determinants of linguistic complexity. Speech Communication, 1994, 15(3-4), 283-300.  ",
      "doi": "10.1016/0167-6393%2894%2990079-5"
    },
    {
      "text": "S. L. Oviatt and E. Olsen. Integration themes in multimodal human-computer interaction. In Proc. of the ICSLP, Acoust. Soc. of Japan, Yokohama, 1994, 551--554.",
      "doi": ""
    },
    {
      "text": "E. Shriberg. Preliminaries to a Theory of Speech Disfluencies. PhD thesis, Univ. of California, Berkeley, 1994.",
      "doi": ""
    },
    {
      "text": "C. Williamson and B. Schneiderman. The dynamic homefinder: Evaluating dynamic queries in a real estate information exploration system. In SIGIR Conf. Proc., ACM, 1992, 339--346.  ",
      "doi": "10.1145/133160.133216"
    },
    {
      "text": "V. Zue, J. Glass, D. Goddeau, D. Goodine, H. Leung, M. McCandless, M. Phillips, J. Polfroni, Seneff. S., and D. Whitney. Recent progress on the MIT voyager spoken language system. In Proc. of the ICSLP, Acoust. Soc. of Japan, Kobe, 1990, 1317--1320.",
      "doi": ""
    }
  ]
}