{
  "doi": "10.1145/800045.801614",
  "title": "Planning units in text editing behavior",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "217-221",
  "year": 1983,
  "badges": [],
  "abstract": "The organization of text editing behavior can be characterized by graph structures containing goals, subgoals, goal outcomes, and actions. Here we propose a model to represent the goals and plans of text editor users based on goal-fate analysis (Schank & Abelson, 1977). The representation captures relationships between a user's multiple goals and shows how errors can result from badly formed plans. We discuss some data from a psychological experiment which supports the hypothesis that text editing behavior is chunked into distinct plan units. The cognitive components of pause times between keystrokes were revealed by statistically removing the physical time required between keystrokes. Finally, we suggest how a system which builds goal-fate graphs from keystroke input might be useful in providing specific help information that is keyed to a user's intentions.",
  "authors": [
    {
      "name": "Scott P. Robertson",
      "institution": "Cognitive Science Program, Yale University, Box 2158 Yale Station, New Haven, CT",
      "img": "/do/10.1145/contrib-81326492414/rel-imgonly/scottpaulrobertson02_500x700.jpg",
      "acmid": "81326492414",
      "orcid": "missing"
    },
    {
      "name": "John B. Black",
      "institution": "Cognitive Science Program, Yale University, Box 2158 Yale Station, New Haven, CT",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100576470",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Allen, J., &amp; Perrault, C.R. Analyzing intention in utterances. Artificial Intelligence, 1980, 15, 143-178.",
      "doi": ""
    },
    {
      "text": "Anderson, R.C., &amp; Spiro, R.J. Schooling and the acquisition of knowledge. Hillsdale, N.J.: Erlbaum, 1977.",
      "doi": ""
    },
    {
      "text": "Appelt, D.E. Planning Natural-Language Utterances. Proceedings of the National Conference on Artificial Intelligence, 1982, 59-62.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Moran, T.P., &amp; Newell, A. Computer text editing: An information-processing analysis of a routine cognitive skill. Cognitive Psychology, 1980, 12, 32-74.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Moran, T.P., &amp; Newell, A. The psychology of human-computer interaction. Hillsdale, N.J.: Erlbaum, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Carroll, J.M. &amp; Mack, R. Actively learning to use a word processor. In Cooper W. (Ed.), Cognitive aspects of skilled typewriting. New York: Springer-Verlag, 1983.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. &amp; Mack, R. Actively learning to use a word processor: By doing, by thinking, and by knowing. J.C. Thomas &amp; M. Schneider (Eds.), Human factors in computers. in press. ",
      "doi": "10.5555/818.820"
    },
    {
      "text": "Cohen, P., &amp; Perrault, C.R. Elements of a plan based theory of speech acts. Cognitive Science, 1979, 3, 177-212.",
      "doi": ""
    },
    {
      "text": "Ehrlich, K., &amp; Soloway, E. An empirical investigation of the tacit plan knowledge in programming. Technical Report #236, Department of Computer Science, Yale University, 1982.",
      "doi": ""
    },
    {
      "text": "Haberlandt, K. Story grammar and reading time of story constituents. Poetics, 1980, 9, 99-116.",
      "doi": ""
    },
    {
      "text": "Haberlandt, K., Berian, C., &amp; Sandson, J. The episode schema in story processing. Journal of Verbal Learning and Verbal Behavior, 1980, 19, 635-650.",
      "doi": ""
    },
    {
      "text": "Lehnert, W.G. Plot units and narrative summarization. Cognitive Science, 1981, 5, 293-331.",
      "doi": ""
    },
    {
      "text": "McDermott, D. Planning and acting. Cognitive Science, 1978, 2, 71-109.",
      "doi": ""
    },
    {
      "text": "Neves, D.M., &amp; Anderson, J.R. Knowledge compilation: Mechanisms for the automatization of cognitive skills. In J.R. Anderson (Ed.), Cognitive skills and their acquisition, Hillsdale, N.J.: Erlbaum, 1981.",
      "doi": ""
    },
    {
      "text": "Robertson, S.P., Black, J.B., &amp; Johnson, P.N. Intention and topic in conversation. Cognition and Brain Theory, 1981, 4, 303-326.",
      "doi": ""
    },
    {
      "text": "Schank, R.C., &amp; Abelson, R.P. Scripts, plans, goals, and understanding. Hillsdale, N.J.: Erlbaum, 1977.",
      "doi": ""
    },
    {
      "text": "Spiro, R.J., Bruce, B.C., &amp; Brewer, W.F. Theoretical issues in reading comprehension: Perspectives from cognitive psychology, linguistics, artificial intelligence, and education. Hillsdale, N.J.: Erlbaum, 1980.",
      "doi": ""
    },
    {
      "text": "Wilensky, R. Understanding goal-based stories. Technical Report #140, Department of Computer Science, Yale University, 1978.",
      "doi": "10.5555/908954"
    },
    {
      "text": "Wilensky, R. Talking to UNIX in English: An overview of UC. Proceedings of the National Conference on Artificial Intelligence, 1982, 103-106.",
      "doi": ""
    },
    {
      "text": "Winograd, T. Understanding natural language. New York: Academic Press, 1972. ",
      "doi": "10.5555/540414"
    }
  ]
}