{
  "doi": "10.1145/800045.801606",
  "title": "How you tell your computer what you mean: Ostension in interactive systems",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "182-185",
  "year": 1983,
  "badges": [],
  "abstract": "An important part of communication is being able to point to an object without referring to its components or to the area surrounding it. How to do this is the problem of ostension. We observed many ostension errors in novices learning to use a full-screen text editor. Specifically, the novices erroneously tried to use keys that are appropriate for pointing when using a typewriter but incorrect in screen editors (e.g., space bar, backspace key, etc.), they frequently missed the location they intended by one character, they inadvertently pointed to the wrong occurrcnce of a string using a FIND command, they incorrectly specified boundaries by forgetting about “invisible” characters (e.g., formatting characters), and they mistakenly attempted to point to non-typing areas of the screen that were off-limits.",
  "authors": [
    {
      "name": "James A. Galambos",
      "institution": "Yale University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100468768",
      "orcid": "missing"
    },
    {
      "name": "Eloise S. Wikler",
      "institution": "Yale University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332535762",
      "orcid": "missing"
    },
    {
      "name": "John B. Black",
      "institution": "Yale University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100576470",
      "orcid": "missing"
    },
    {
      "name": "Marc M. Sebrechts",
      "institution": "Wesleyan University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100198308",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Black, J.B. and Sebrechts, M.M. Facilitating human-computer communication. Applied Psycholinguistics, 1981, 2, 149-178.",
      "doi": ""
    },
    {
      "text": "Card. S.K., Moran, T.P. and Newell, A. The psychology of human-computer interaction. Hillsdale, NJ: Erlbaum, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Galambos, Sebrechts, M.M., Wikler, E.S. and Black, J.B. A diagrammatic language for instruction of a menu-based word processing system. In S. Williams (Ed.) Humans and machines: The interface through language. Norwood, NJ: Ablex, in press.",
      "doi": ""
    },
    {
      "text": "Halasz, F. and Moran, T.P. Analogy considered harmful. Proceedings of the Human Factors in Computer Systems Conference. Gaithersburg, Maryland, 1982.  ",
      "doi": "10.1145/800049.801816"
    },
    {
      "text": "Norman, D.A. Categorization of action slips. Psychological Review, 1981, 88, 1-15.",
      "doi": ""
    },
    {
      "text": "Quine, W.v.O. Word and Object. Cambridge, Mass: M.I.T. Press, 1960.",
      "doi": ""
    },
    {
      "text": "Sebrechts, M.M., Deck, J.S. and Black, J.B. A diagrammatic approach to computer instruction for the naive user. Behavior Research Methods and Instrumentation, in press.",
      "doi": ""
    },
    {
      "text": "Sebrechts, M.M., Galambos, J.A., Wagner R.K., Black, J.B., Deck, J.G. and Wikler, E.S. The effects of diagrams on learning to use a system. Learning and Using Systems Project Technical Report #2, Yale University, 1983.",
      "doi": ""
    }
  ]
}