{
  "doi": "10.1145/800045.801618",
  "title": "What do novice programmers know about recursion",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "235-239",
  "year": 1983,
  "badges": [],
  "abstract": "Recent research into differences between novice and expert computer programmers has provided evidence that experts know more than novices, and what they know is better organized. The conclusion is only as interesting as it is intuitive. This paper reports an experiment which was designed to determine precisely what novice programmers understand about the behaviour of recursive procedures, and exactly how their understanding differs from an expert's understanding of the process. The results show that different novices understand, or misunderstand, different things. Implications of the findings are discussed with respect to other research into novice and expert programming performance.",
  "authors": [
    {
      "name": "Hank Kahney",
      "institution": "Human Cognition Research Laboratory, The Open University, Milton Keynes, England",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100510069",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adelson, B. Problem solving and the development of abstract categories in programming languages. Memory and Cognition, 1981, 9, 422-433.",
      "doi": ""
    },
    {
      "text": "Collins, A. &amp; Gentner, D. Constructing runnable mental models. Proceedings of the Fourth Annual Conference of the Cognitive Science Society, Ann Arbor, Michigan, 1982.",
      "doi": ""
    },
    {
      "text": "Ehrlich, K. &amp; Soloway, E. An empirical investigation of the tacit plan knowledge in programming. New Haven, Conn.: Technical Report 82-236, Department of Computer Science, Yale University, 1982.",
      "doi": ""
    },
    {
      "text": "Eisenstadt, M. Artificial Intelligence Project. Units 3 and 4 of Cognitive Psychology a third level course. Milton Keynes: Open University Press, 1978.",
      "doi": ""
    },
    {
      "text": "Jeffries, R. A comparison of the debugging behaviour of expert and novice programmers. Paper presented at the AERA annual meeting, March,1982.",
      "doi": ""
    },
    {
      "text": "Kahney, A. An in-depth study of the cognitive behaviour of novice programmers. Technical Report No.5. Human Cognition Research Laboratory, The Open University, Milton Keynes, England, 1982.",
      "doi": ""
    },
    {
      "text": "McKeithen, K.B. Reitman, J.S. Rueter, H.H. &amp; Hirtle, S.C. Knowledge organization and skill differences in computer programmers. Cognitive Psychology, 1981, 13.",
      "doi": ""
    },
    {
      "text": "Norman, D.A. Some observations on mental models. In D. Gentner &amp; A Stevens (Eds.), Mental Models. Hillsdale, N.J.: Lawrence Erlbaum Associates, 1982.",
      "doi": ""
    }
  ]
}