{
  "doi": "10.1145/800045.801607",
  "title": "A qualitative reasoning approach to mathematical and heuristic knowledge integration",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "186-189",
  "year": 1983,
  "badges": [],
  "abstract": "Human problems solvers use heuristic knowledge. Heuristics can be justified in a given problem solving context by reasoning about 'deeper' domain theories. A working computer program, an air traffic control expert system, uses a qualitative reasoning approach to justify heuristically generated plans. The justification is based on mathematical knowledge of aircraft performance which is computationally too complex for use in the normal planning process.",
  "authors": [
    {
      "name": "Stephen E. Cross",
      "institution": "Department of Electrical Engineering, Air Force Institute of Technology, Wright-Patterson AFB, Ohio",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81329488246",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hayes, P. (1979) (The Naive Physics Manifesto, in Expert Systems in the Micro-Electronic Age). D. Michie (Ed.). Edinburgh: Edinburgh University Press.",
      "doi": ""
    },
    {
      "text": "de Kleer, J. (1977) Qualititative and Quantitative Reasoning in Classical Mechanics. Proceedings of the Fifth International Joint Conference on Artificial Intelligence. pp. 229-304.",
      "doi": ""
    },
    {
      "text": "de Kleer, J. (1979) Causal and Teleological Reasoning in Circuit Recognition. Ph.D. Dissertation. Massachusetts Institute of Technology. MIT-AI-TR-529. ",
      "doi": "10.5555/889483"
    },
    {
      "text": "Forbus, K. (1982) Qualitative Process Theory. Massachusetts Institute of Technology. MIT-AI-TR-664. ",
      "doi": "10.5555/889508"
    },
    {
      "text": "Kuipers, B. (1982) Getting the Envisionment Right. Proceedings of the National Conference on Artificial Intelligence. pp. 209-212.",
      "doi": ""
    },
    {
      "text": "McCloskey, M. (1983) Intuitive Physics. Scientific American. Vol. 248. No. 4. April 1983. PP. 122-130.",
      "doi": ""
    },
    {
      "text": "Schank, R. and Abelson, R. (1977) Scripts Plans Goals and Understanding. Lawrence Erlbaum Associates, Inc., Hillsdale, N.J.",
      "doi": ""
    },
    {
      "text": "Rieger, C. (1975) The Commonsense Algorithm as a Basis for Computer Models of Human Memory, Inference, Belief, and Contextual Language Comprehension. University of Maryland. Technical Memo. No. 373.",
      "doi": ""
    },
    {
      "text": "Knox, C., et al. (1980) Preliminary Test Results of a Flight Management Algorithm for Fuel Conservative Descents in a Time Based Metered Traffic Environment. NASA-TM-80194.",
      "doi": ""
    }
  ]
}