{
  "doi": "10.1145/800045.801598",
  "title": "An effective graphics user interface for rules and inference mechanisms",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "139-143",
  "year": 1983,
  "badges": [],
  "abstract": "As the technology of rule-based inference mechanisms matures, knowledge acquisition—the creation, structuring, and verification of rules—becomes increasingly important. The accuracy and completeness of the rules in the knowledge base determine expert system performance, and the cost of acquiring that knowledge base dominates all other hardware and software costs in practical systems. To reduce knowledge acquisition time and error rate, a new interactive graphics interface for rules is being designed and implemented in GE Corporate Research and Development. In the new system, each set of rules is represented as an AND/OR graph and parts of the rule base are displayed on a CRT screen as an AND/OR tree. A user—even an unsophisticated user—can navigate the AND/OR graph, identify nodes to be modified, analyze the behavior of the graph, verify its correctness graphically, and follow the execution of inference engines.",
  "authors": [
    {
      "name": "J. W. Lewis",
      "institution": "Information Systems Laboratory, Corporate Research and Development, General Electric Company",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81545854856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "D.A. Waterman and F. Hayes-Roth, Pattern Directed Inference Systems, Academic Press, 1978. ",
      "doi": "10.5555/578630"
    },
    {
      "text": "W.B. Gevarter, \"An Overview of Expert Systems,\" NBSIR 82-2505, National Bureau of Standards, U.S. Department of Commerce, May 1982.",
      "doi": ""
    },
    {
      "text": "J.W. Lewis and F.S. Lynch, \"GETREE: A Knowledge Management Tool,\" In Proceedings of the Trends and Applications Conference on Automating Intelligent Behavior, IEEE Press, May 1983.",
      "doi": ""
    },
    {
      "text": "D.B. Wheeler, J.S. Hsuan, R.R. Duersch, and G.M. Roe, \"Fault Tree Analysis Using Bit Manipulation,\" IEEE Transactions on Reliability,R-26, 2 (June 1977) 95-99.",
      "doi": ""
    },
    {
      "text": "E.H. Shortliffe, Computer-Based Medical Consultations: MYCIN, Elsevier, 1976.",
      "doi": ""
    },
    {
      "text": "P.P. Bonissone, \"An Expert System for Troubleshooting,\" NAFIP-1, Utah State University, May 1982, Logan, Utah.",
      "doi": ""
    },
    {
      "text": "W.R. Nelson, \"REACTOR: An Expert System for Diagnosis and Treatment of Nuclear Reactor Accidents,\" In Proceedings of AAAI-82, American Association for Artificial Intelligence, August 1982.",
      "doi": ""
    },
    {
      "text": "P.H. Winston, Artificial Intelligence, Addison-Wesley, 1979. ",
      "doi": "10.5555/30424"
    },
    {
      "text": "A. Barr and E.A. Feigenbaum, The Handbook of Artificial Intelligence, William Kaufman, 1981. ",
      "doi": "10.5555/576646"
    },
    {
      "text": "N.J. Nilsson. Principles of Artificial Intelligence, Tioga Publishing Company, Palo Alto, 1980. ",
      "doi": "10.5555/30425"
    },
    {
      "text": "J.W. Lewis, \"TREE: An Interactive Editor for Tree Structures;\" Computers and Graphics1 (1975) 70-73.",
      "doi": ""
    },
    {
      "text": "J.W. Lewis, \"ALBE/LNF: A Language-Based Editor for Language Neutral Form,\" In Proceedings of the Fifth International Conference on Software Engineering, January 1981, IEEE Press. ",
      "doi": "10.5555/800078.802555"
    },
    {
      "text": "N. Meyrowitz and A. Van Dam, \"Interactive Editing Systems,\" Computing Surveys,14, 3 (Sept. 1982) 319-415.  ",
      "doi": "10.1145/356887.356889"
    }
  ]
}