{
  "doi": "10.1145/800045.801619",
  "title": "Beyond numbers: Don't ask “how many” ... ask “why”",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "240-246",
  "year": 1983,
  "badges": [],
  "abstract": "While programmers may differ in their assessment of the comprehensibility of a program, there are nonetheless some clear cut cases of programs that are truly difficult to understand. In this paper, we analyze three programs—two of which are relatively incomprehensible—using Halstead's Volume Metric, Propositional Analysis and Plan Analysis. We argue that only Plan Analysis provides a satisfactory explanation for why the programs in question differ with respect to understandability. Moreover, we suggest that a qualitative analysis, such as provided by Plan Analysis, is the desired type of evaluation: rather than simply providing a numerical ranking for programs, the qualitative analysis can pinpoint the troublesome area in the code and provide prescriptive information for correcting the difficulty.",
  "authors": [
    {
      "name": "Elliot Soloway",
      "institution": "Department of Computer Science, Yale University, Box 2158 Yale Station, New Haven, Connecticut",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332528788",
      "orcid": "missing"
    },
    {
      "name": "Kate Ehrlich",
      "institution": "Department of Computer Science, Yale University, Box 2158 Yale Station, New Haven, Connecticut",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331492075",
      "orcid": "missing"
    },
    {
      "name": "John B. Black",
      "institution": "Department of Psychology, Yale University, Box 11A Yale Station, New Haven, Connecticut",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100576470",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Atwood, M.E., Ramsey, H.R. Cognitive Structure in the Comprehension and Memory of Computer Programs: An Investigation of Computer Program Debugging. Tech. Rept. ARI TR-78-A210, Science Applications, Englewood, Calif., 1978.",
      "doi": ""
    },
    {
      "text": "Bartlett, F.C., Remembering. University Press, Cambridge, 1932.",
      "doi": ""
    },
    {
      "text": "Black, J.B. and Bern, H. \"Causal Coherence and Memory for Events in Narratives.\" Journal of Verbal Learning and Verbal Behavior 20 (1981), 265-275.",
      "doi": ""
    },
    {
      "text": "Black, J.B. Understanding and remembering stories. In J.R. Anderson and S.M. Kosslyn (Eds.) Essays on learning and memory. Hillsdale, NJ: Erlbaum, in press.",
      "doi": ""
    },
    {
      "text": "Bower, G.H., Black, J.B., Turner, T. \"Scripts in Memory for Text.\" Cognitive Psychology 11 (1979), 177-220.",
      "doi": ""
    },
    {
      "text": "Ehrlich, K., Soloway, E. An Empirical Investigation of the Tacit Plan Knowledge in Programming, in Human Factors in Computer Systems, J. Thomas and M.L. Schneider (Eds.), Ablex Inc., in press. ",
      "doi": "10.5555/818.823"
    },
    {
      "text": "Graesser, A. C., Prose comprehension beyond the word. Springer-Verlag, New York, 1981.",
      "doi": ""
    },
    {
      "text": "Halstead, M.M., Elements of Software Science. Elsevier, New York, 1977. ",
      "doi": "10.5555/540137"
    },
    {
      "text": "Johnson, W. L., Soloway, E. PROUST: Knowledge-Based Program Understanding. Tech. Rept. 295, Dept. of Computer Science, Yale University, 1983.",
      "doi": ""
    },
    {
      "text": "Kernighan, B., Plauger, P., The Elements of Style. McGraw Hill Co., New York, 1978. ",
      "doi": "10.5555/578130"
    },
    {
      "text": "Kintsch, W., van Dijk, T.A. \"Toward a Model of Text Comprehension and Production.\" Psychological Review 85 (1978), 363-394.",
      "doi": ""
    },
    {
      "text": "Ledgard, H., Hueras, J., Nagin, P., Pascal with Style: Programming Proverbs. Hayden Book Co., Rochele Park, N.J., 1979.",
      "doi": ""
    },
    {
      "text": "Schank, R.C. and Abelson, R., Scripts, Plans, Goals and Understanding. Lawrence Erlbaum Associates, Hillsdale New Jersey, 1977.",
      "doi": ""
    },
    {
      "text": "Sheppard, S., Borst, M., Love, T. Predicting Software Comprehensibility. Tech. Rept. TR-77-388100-1, General Electric Information systems Programs, Va., 1978.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Ehrlich, K., Bonar, J., Greenspan, J. What Do Novices Know About Programming? In A. Badre, B. Shneiderman, Ed., Directions in Human-Computer Interactions, Ablex, Inc., 1982.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Ehrlich, K., Bonar, J. Tapping Into Tacit Programming Knowledge. Proceedings of the Conference on Human Factors in Computing Systems, NBS, Gaithersburg, Md., 1982.  ",
      "doi": "10.1145/800049.801754"
    },
    {
      "text": "Soloway, E., Ehrlich, K. What Does an Expert Programmer Know? Tech. Rept. 294, Dept. of Computer Science, Yale University, 1983.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Ehrlich, K. What DO Programmers Reuse? Theory and Experiment. Proceedings of the Workshop on Reusability in Programming, ITT, Providence, R.I., 1983.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Ehrlich, K., Bonar, J. Reading a Program Is Like Reading a Story (Well, Almost). Proceedings of the Cognitive Science Society, Rochester, N.Y., in press.",
      "doi": ""
    },
    {
      "text": "Waters, R. A Knowledge Based Program Editor. Proceedings of the Seventh IJCAI Conference, IJCAI, 1981.",
      "doi": ""
    },
    {
      "text": "Wirth, N. \"On the Composition of Well-Structured Programs.\" ACM Computing Surveys 6, 4 (1974).  ",
      "doi": "10.1145/356635.356639"
    }
  ]
}