{
  "doi": "10.1145/800045.801610",
  "title": "Correcting misconceptions: What to say when the user is mistaken",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "197-201",
  "year": 1983,
  "badges": [],
  "abstract": "Because people's knowledge is often partial and/or faulty, it is inevitable that misconceptions will be revealed in the course of a conversation. If recognized, the other person may say something to correct the misconception, and the conversation continues. Just as this is the case when people interact with each other, so must it be when users interact with a computer system. For example, in interacting with an expert system, a user may reveal misconceptions about objects modelled by the system. By failing to correct such misconceptions, the system may not only confirm the original misconception, but may cause the user to develop further misconceptions. It must therefore be up to the system to recognize and respond to misconceptions in an effective way. In this paper the space of possible object misconceptions is characterized according to the kind of incorrect information involved. It has been found that this characterization is often useful in determining how the user arrived at the misconception, and therefore the kind of information to include in the response. Using such a characterization, a system will be able to effectively correct object misconceptions in a domain independent way. Factors which affect the amount of information included in a correction (such as discourse and situational context) are also examined.",
  "authors": [
    {
      "name": "Kathleen F. McCoy",
      "institution": "Department of Computer & Information Science, University of Pennsylvania, Philadelphia, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100228295",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brown, J.S. and Burton, R.R. Diagnostic Models for Procedural Bugs in Basic Mathematical Skills. Cognitive Science 2(2):155-192, 1978.",
      "doi": ""
    },
    {
      "text": "Grosz, B. The Representation and Use of Focus in Dialogue Understanding. Technical Report 151, SRI International, Menlo Park Ca., 1977.",
      "doi": "10.5555/908370"
    },
    {
      "text": "Grosz, B. Focusing and Description in Natural Language Dialogues. In A. Joshi, B. Webber &amp; I. Sag (editor), Elements of Discourse Understanding, pages 85-105. Cambridge University Press, Cambridge, England, 1981.",
      "doi": ""
    },
    {
      "text": "Jefferson, G. Side Sequences. In David Sudnow (editor), Studies in Social Interaction,. Macmillan, New York, 1972.",
      "doi": ""
    },
    {
      "text": "S.J. Kaplan. Cooperative Responses from a Portable Natural Language Query System. Artificial Intelligence 19(2), October, 1982.",
      "doi": ""
    },
    {
      "text": "Malhotra, A. Design Criteria for a Knowledge-Based English Language System for Management. Technical Report TR-146, Project MAC. MIT, 1975.",
      "doi": ""
    },
    {
      "text": "Malhotra, A. &amp; Sheridan, P. Experimental Determination of Design Requirements For a Program Explanation System. Technical Report RC 5831, IBM Research Center, Yorktown Heights, NY, 1976.",
      "doi": ""
    },
    {
      "text": "E. Mays. Failures in Natural Language Systems: Applications to Data Base Query Systems. In Proceedings of the 1980 National Conference on Artificial Intelligence. AAAI, Stanford, Ca., August, 1980.",
      "doi": ""
    },
    {
      "text": "Pollack, M., Hirschberg, J., &amp; Webber, B. User Participation in the Reasoning Processes of Expert Systems. In Proceedings of the 1982 National Conference on Artificial Intelligence. AAAI, Pittsburgh, Pa., August, 1982.",
      "doi": ""
    },
    {
      "text": "Schuster, E. Explaining and Expounding. Technical Report MS-CIS-82-49, University of Pennsylvania, 1982.",
      "doi": ""
    },
    {
      "text": "Sleeman, D. Inferring (Mal) Rules From Pupil's Protocols. In Proceedings of ECAI-82, pages 160-164. ECAI-82, Orsay, France, 1982. ",
      "doi": "10.5555/3732.3733"
    },
    {
      "text": "Stevens, A.L. and Collins, A. Multiple Conceptual Models of a Complex System. In Richard E. Snow, Pat-Anthony Federico and William E. Montague (editor), Aptitude, Learning, and Instruction, pages 177-197. Erlbaum, Hillsdale, N.J., 1980.",
      "doi": ""
    },
    {
      "text": "Stevens, A., Collins, A. and Goldin, S.E. Misconceptions in Student's Understanding. Intl. J. Man-Machine Studies 11:145-156, 1979.",
      "doi": ""
    }
  ]
}