{
  "doi": "10.1145/800045.801596",
  "title": "Enhancing the usability of an Office Information System through direct manipulation",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "130-134",
  "year": 1983,
  "badges": [],
  "abstract": "In Office Information Systems, the primary focus has been to integrate facilities for the communication and management of information. However, the human factors aspects of the design of office systems are equally important considerations if such office systems are to gain widespread acceptance and use. The application of design techniques from Human Factors can help enhance the usability of an office system. In this paper, we describe the user interface of an office system developed by adapting such design techniques.",
  "authors": [
    {
      "name": "Alison Lee",
      "institution": "Computer Systems Research Group, Department of Computer Science, University of Toronto, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100385356",
      "orcid": "missing"
    },
    {
      "name": "F. H. Lochovsky",
      "institution": "Computer Systems Research Group, Department of Computer Science, University of Toronto, Canada",
      "img": "/do/10.1145/contrib-81100048867/rel-imgonly/fred-ptc.jpg",
      "acmid": "81100048867",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "ASHE, G. Good Writing For All Occasions. Coles Publishing Company Limited, Toronto, 1972.",
      "doi": ""
    },
    {
      "text": "COLEMAN, M.L. Text Editing on a Graphic Display Device Using Hand-Drawn Proofreader's Symbols. Pertinent Concepts in Computer Graphics: Proceedings of the 2nd University of Illinois Conference on Computer Graphics. Edited by M. Faiman and J. Nievergelt, 1969.",
      "doi": ""
    },
    {
      "text": "DEJONG, P. The System for Business Automation (SBA): A Unified Application Development System. Proceedings IFIP Congress 1980, pg. 469-474.",
      "doi": ""
    },
    {
      "text": "ECONOMOPOULOS, P. An Image Database Management System. M. Sc. thesis (1982), Department of Computer Science, University of Toronto.",
      "doi": ""
    },
    {
      "text": "ELLIS, C.A. and BERNAL, M. Officetalk-D: An Experimental Office Information System. Proceedings of SIGOA Conference on Office Information Systems, University of Pennsylvania. June 21-23, 1982. pg. 131-140.  ",
      "doi": "10.1145/800210.806489"
    },
    {
      "text": "KORNATOWSKI, J.Z. The MRS User's Manual. CSRG, University of Toronto.",
      "doi": ""
    },
    {
      "text": "LAMPSON, B.W. Bravo Manual, In Alto User's Handbook, Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, California. November 1978, pg. 31-62.",
      "doi": ""
    },
    {
      "text": "LEE, A. A Query and Editing Language for a Message Management System. M. Sc. thesis (1983), Department of Computer Science, University of Toronto.",
      "doi": ""
    },
    {
      "text": "LOCHOVSKY, F.H. Human Factors Issues in Office Information Systems. Proceedings International Congress on Applied Systems Research and Cybernetics, Acapulco, Mexico. Dec. 12-15, 1980.",
      "doi": ""
    },
    {
      "text": "LODDING, K. N. Iconic Interfacing. IEEE Computer Graphics and Applications. March/April, 1983.",
      "doi": ""
    },
    {
      "text": "MEYROWITZ, N. and VAN DAM, A. Interactive Editing Systems. ACM Computing Surveys, September, 1982. Volume 14, No. 3.  ",
      "doi": "10.1145/356887.356889"
    },
    {
      "text": "NEWMAN, W.M. and SPROULL, R.F. Principles of Interactive Computer Graphics (2nd ed.). Computer Science Series, McGraw-Hill Book Co, 1979. ",
      "doi": "10.5555/5532"
    },
    {
      "text": "The Random House Dictionary. (J. Stein, editor), Ballantine Books, New York, 1980.",
      "doi": ""
    },
    {
      "text": "ROWE, L.A. and SHOENS, K.A. A Form Application Development System. Proceedings ACM SIGMOD Conference, 1982.  ",
      "doi": "10.1145/582353.582359"
    },
    {
      "text": "SCELZA, D.A.; MYERS, B.A. and AMBER, B. PERQ Introductory User Manual. Three Rivers Computer Corporation, 1982.",
      "doi": ""
    },
    {
      "text": "SHNEIDERMAN, B. Direct Manipulation: A Step Beyond Programming Languages. University of Maryland, 1983.",
      "doi": ""
    },
    {
      "text": "SMITH, D.C.S.; IRBY, C.; KIMBALL, R.; VERPLANK, B.; and HARLEM, E. Designing the Star User Interface. BYTE, April 1982. Volume 7, Number 4.",
      "doi": ""
    },
    {
      "text": "Sun Microsystems Inc. The Sun Workstation Architecture, 1982.",
      "doi": ""
    },
    {
      "text": "TSICHRITZIS, D.; RABITTI, F.A.; GIBBS, S.; NIERSTRASZ, O.; and HOGG, J. A System for Managing Structured Messages. IEEE Transactions on Communications, January 1982. Volume 30, Number 1.",
      "doi": ""
    },
    {
      "text": "TSICHRITZIS, D. OFS: An Integrated Form Management System. Proceedings Sixth Internation Conference on Very Large Data Bases, 1981. pg. 161-166.",
      "doi": ""
    },
    {
      "text": "TSICHRITZIS, D. Integrating Data Base and Message Systems. Proceedings International Conference on VLDB, Cannes, France. September 1981.",
      "doi": ""
    },
    {
      "text": "TSICHRITZIS, D.C. and LOCHOVSKY, F.H. Office Information Systems: Challenge for the 80's. Proceedings of the IEEE, 1980. Volume 68, Number 9. pg. 1054-1059.",
      "doi": ""
    },
    {
      "text": "WOO, C. A Communication Base Design System for a Message Management System. M. Sc. thesis (1983), Department of Computer Science, University of Toronto.",
      "doi": ""
    },
    {
      "text": "ZLOOF, M. Query By Example. Proceedings NCC, 44. May 1975.",
      "doi": ""
    }
  ]
}