{
  "doi": "10.1145/800045.801591",
  "title": "Application of a model of human decision making for human/computer communication",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "107-111",
  "year": 1983,
  "badges": [],
  "abstract": "When a human and computer perform similar tasks in parallel, it is important that an effective line of communication exist between the two entities. Since overt communication may add to the human's workload, an implicit method of communication is suggested in which the computer has a model of human performance on which to base actions. A two-stage model of human performance is employed in an experimental situation in which both a human and a computer act as decision makers. Results indicate that the implementation of a model significantly improves the human's performance and the overall system performance, without degrading the computer's performance. Research into additional experimental and real-world situations is suggested.",
  "tags": [],
  "authors": [
    {
      "name": "Mark E. Revesman",
      "institution": "Department of Industrial Engineering and Operations Research, Virginia Polytechnic Institute & State University, Blacksburg, Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332523352",
      "orcid": "missing"
    },
    {
      "name": "Joel S. Greenstein",
      "institution": "Department of Industrial Engineering and Operations Research, Virginia Polytechnic Institute & State University, Blacksburg, Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100210715",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Freedy, A., Weisbrod, R., and Weltman, G. Self-optimization of task allocation in shared man/computer control. Proceedings of the IEEE Conference on Decision and Control. San Diego, Calif., December, 1973.",
      "doi": ""
    },
    {
      "text": "Greenstein, J.S. and Revesman, M.E. A MonteCarlo simulation investigating means of human-computer communication for dynamic task allocation. The Proceedings of the IEEE 1981 International Conference on Cybernetics and Society, Atlanta, October, 1981, 488-494.",
      "doi": ""
    },
    {
      "text": "Kleinman, D. L., Baron, S., and Levison, W. H., A control theoretic approach to manned vehicle systems analysis. IEEE Transactions on Automatic Control. AC-16, 6, 1971, 824-832.",
      "doi": ""
    },
    {
      "text": "Pattipati, K. R., Kleinman; D. L., and Ephrath, A. R. A dynamic decision model of human task selection performance. IEEE Transactions on Systems, Man, and Cybernetics, SMC-13, 2, March/April, 1983, 145-166.",
      "doi": ""
    },
    {
      "text": "Revesman, M.E. A model of human decision making for human/computer communication. Doctoral dissertation, Virginia Polytechnic Institute, 1983.",
      "doi": ""
    },
    {
      "text": "Revesman, M. E. and Greenstein, J. S. An empirical validation of a model of human decision making for human-computer communication. Santa Monica, California: Proceedings of the Human Factors Society 27th Annual Meeting, Norfolk, October, 1983.",
      "doi": ""
    },
    {
      "text": "Rouse, W. B. Human-computer interaction in multitask situations. IEEE Transactions on Systems, Man, and Cybernetics, SMC-7, 5, May, 1977, 384-392.",
      "doi": ""
    },
    {
      "text": "Rouse, W. B. Human-computer interaction in the control of dynamic systems. ACM Computing Surveys, Vol. 13, 1, March, 1981, 71-99.  ",
      "doi": "10.1145/356835.356839"
    }
  ]
}