{
  "doi": "10.1145/800045.801573",
  "title": "Soft machines: A philosophy of user-computer interface design",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "19-23",
  "year": 1983,
  "badges": [],
  "abstract": "Machines and computer systems differ in many characteristics that have important consequences for the user. Machines are special-purpose, have forms suggestive of their functions, are operated with controls in obvious one-to-one correspondence with their actions, and the consequences of the actions on visible objects are immediately and readily apparent. By contrast, computer systems are general-purpose, have inscrutable form, are operated symbolically via a keyboard with no obvious correspondence between keys and actions, and typically operate on invisible objects with consequences that are not immediately or readily apparent. The characteristics possessed by machines, but typically absent in computer systems, aid learning, use and transfer among machines. But “hard,” physical machines have limitations: they are inflexible, and their complexity can overwhelm us. We have built in our laboratory “soft machine” interfaces for computer systems to capitalize on the good characteristics of machines and overcome their limitations. A soft machine is implemented using the synergistic combination of real-time computer graphics to display “soft controls,” and a touch screen to make soft controls operable like conventional hard controls.",
  "authors": [
    {
      "name": "Lloyd H. Nakatani",
      "institution": "Bell Laboratories, Murray Hill, New Jersey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81537223556",
      "orcid": "missing"
    },
    {
      "name": "John A. Rohrlich",
      "institution": "Bell Laboratories, Whippany, New Jersey",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047836",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A.F. Albert, \"The Effect of Graphic Input Devices on Performance in a Cursor Positioning Task,\" Proceedings of the Human Factors Society, 1982, pp. 54-58.",
      "doi": ""
    },
    {
      "text": "S. K. Card, W. K. English and B. J. Burr, \"Evaluation of Mouse, Rate-Controlled Isometric Joystick, Step Keys, and Text Keys for Text Selection on a CRT,\" Ergonomics, 21, 1978, pp. 601-613.",
      "doi": ""
    },
    {
      "text": "A. Chapanis, \"Design of Controls,\" in H. P. Van Cott and R. G. Kinkade, Human Engineering Guide to Equipment Design, McGraw-Hill, 1972, pp. 346-379.",
      "doi": ""
    },
    {
      "text": "J. L. Ehardt, \"Apple's Lisa: A Personal Office System,\" The Seybold Report on Office Systems, 6, January 1983.",
      "doi": ""
    },
    {
      "text": "K. C. Knowlton, \"Computer Displays Optically Superimposed on Input Devices,\" Bell System Technical Journal, 56, March 1977, pp. 367-383.",
      "doi": ""
    },
    {
      "text": "B. J. Mirrer, \"An Interactive, Graphical, Touch-Oriented Speech Editor,\" MIT Master's Thesis, 1982.",
      "doi": ""
    },
    {
      "text": "C. Schmandt, \"The Intelligent Ear&mdash;A Graphical Interface to Digital Audio,\" Proceedings of the 1981 International Conference on Cybernetics and Society, 1981, pp. 393-397.",
      "doi": ""
    },
    {
      "text": "P. J. Schuyten, \"Xerox Introduces 'Intelligent Copier,'\" The New York Times, Thursday, September 25, 1980, p. D4.",
      "doi": ""
    },
    {
      "text": "D. C. Smith, C. Irby, R. Kimball and B. Verplank, \"Designing the Star User Interface,\" Byte, April 1982, pp. 242-282.",
      "doi": ""
    }
  ]
}