{
  "doi": "10.1145/800045.801611",
  "title": "The user's perception of the interaction language: A two-level model",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "202-206",
  "year": 1983,
  "badges": [],
  "abstract": "Users perceive consistency and inconsistency in syntax, and family resemblances among syntactic constructions. These factors are not captured in conventional BNF-like grammars. We argue that a generalised form of a two-level grammar is a better model of the user's perceptions, and show how the model relates to current psychological notions of organisation in recall and language learning. The model provides a unified interpretation of many previous results in HCI: we analyse here findings by Reisner (1981) and Barnard et al. (1981). Two preliminary experimental tests supporting the model are described.",
  "tags": [],
  "authors": [
    {
      "name": "Stephen J. Payne",
      "institution": "MRC/SSRC Social and Applied Psychology Unit, Department of Psychology, The University Sheffield, S10 2TN U.K.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100557764",
      "orcid": "missing"
    },
    {
      "name": "Thomas R. G. Green",
      "institution": "MRC/SSRC Social and Applied Psychology Unit, Department of Psychology, The University Sheffield, S10 2TN U.K.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100201414",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barnard, P.J., Hammond, N.V., Morton, J. and Long, J. (1981) Consistency and compatibility in command languages. International Journal of Man-Machine Studies, 15, 87-134.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M., (1980) Learning, usign and designing command paradigms. Report No. RC 8141, IBM Watson Research Center, New York.",
      "doi": ""
    },
    {
      "text": "Clark, E.V. and Hecht, B.V. (1982) Learning to coin agent and instrument nouns. Cognition, 12, 1-24.",
      "doi": ""
    },
    {
      "text": "Cleaveland, J.C. and Uzgalis, R.C., (1977) Grammars for Programming Languages. New York: Elsevier.",
      "doi": ""
    },
    {
      "text": "Gazdar, G. (1982) Phrase structure grammar. In Jacobson, P. &amp; Pullum, G.K. (Eds.) The Nature of Syntactic Representation. Dordrecht: Reidel.",
      "doi": ""
    },
    {
      "text": "Green, T.R.G. (1983) Learning big and little programming languages. In Wilkinson, A.C. (Ed.) Classroom Computers and Cognitive Science. New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Moran, T.P. (1981)The command language grammar. International Journal of Man-Machine Studies, 15, 3-50.",
      "doi": ""
    },
    {
      "text": "Neisser, U. and Weene, P. (1962) Hierarchies in concept attainment. Journal of Experimental Psychology,64, 6, 640-645.",
      "doi": ""
    },
    {
      "text": "Pagan, F.G. (1981) Formal Specifications of Programming Languages: a Panoramic Primer. N.J.: Prentice Hall. ",
      "doi": "10.5555/539558"
    },
    {
      "text": "Reber, A.S., Kassin, S.M., Lewis, S. and Cantor, G. (1980) On the relationship between implicit and explicit modes in the learning of a complex rule structure. Journal of Experimental Psychology: Human Learning and Memory, 6, 5, 492-502.",
      "doi": ""
    },
    {
      "text": "Reisner, P. (1981) Formal grammar and design of an interactive system. IEEE Transactions on Software Engineering, 5, 229-240.",
      "doi": "10.1109/TSE.1981.234520"
    },
    {
      "text": "Rosch, E. and Lloyd, B. (1979) Cognition and Categorisation. Hillsdale, New Jersey: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Rosenberg, J.K. (1982) Evaluating the suggestiveness of command names. Behaviour and Information Technology, 1, 4, 371-400.",
      "doi": ""
    },
    {
      "text": "Treisman, A.M. (1965) Verbal responses and contextual constraints in language. Journal of Verbal Learning and Verbal Behavior, 4, 118-128.",
      "doi": ""
    },
    {
      "text": "Tulving, E. (1962) Subjective organisation in free recall of \"unrelated\" words. Psychological Review, 69, 344-354.",
      "doi": ""
    },
    {
      "text": "Tulving, E. and Donaldson, W. (Eds.) (1972) Organization and Memory. New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Tversky, A. (1977) Features of similarity. Psychological Review, 84, 327-352.",
      "doi": "10.1037/0033-"
    },
    {
      "text": "Tversky, A. (1979) Studies in similarity. In Rosch, E. and Lloyd, B. (Eds.) Cognition and Categorisation. Hillsdale, New Jersey: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "van Wijngaarden, A. (1966) Recursive definition of syntax and semantics. In Steel, T.B. (Ed.) Formal Description Languages for Computer Programming. Amsterdam: North-Holland.",
      "doi": ""
    },
    {
      "text": "Winograd, T. (1983) Language as a Cognitive Process. Volume 1: Syntax. Addison-Wesley. ",
      "doi": "10.5555/1098647"
    }
  ]
}