{
  "doi": "10.1145/800045.801620",
  "title": "Aesthetics and programming",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "247-250",
  "year": 1983,
  "badges": [],
  "abstract": "The paper at hand is based on interviews with a total of eight so-called \"superprogrammers\", software people, who show exceptional performance quantitatively as well as qualitatively. It becomes apparent that these people do not experience programming as a purely rational activity, but that for them it possesses strong intuitive components. Programs are visualized wholistically as three-dimensional structures. In this, aesthetics plays a special part: the structure must please optically, be elegant—then it is functionally acceptable. Logical mistakes manifest themselves as interfering with this aesthetics. The author suggests that in the area of software as well there is something like the absolute beautiful: perfect solutions with a maximum of transparence beyond all rivaling design parameters. He has a feeling that the faculties described in this paper are widespread and may open up a totally new dimension in programming.",
  "tags": [],
  "authors": [
    {
      "name": "Peter Molzberger",
      "institution": "University of the German Armed Forces, Munich",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100624322",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Hamming, R.W.: The Unreasonable Effectiveness of Mathematics. The American Mathematical Monthly. Vol. 87, 1980.",
      "doi": ""
    },
    {
      "text": "Kant, I.: Kritik der reinen Vernunft. K&ohuml;nigsberg 1781.",
      "doi": ""
    },
    {
      "text": "Koestler, A.: The Act of Creation. New York 1966.",
      "doi": ""
    },
    {
      "text": "Molzberger, P.: Und Programmieren ist doch eine Kunst, in: Schelle, H.; Molzberger, P.: Psychologische Aspekte der Software-Entwicklung. Oldenbourg, Munich 1983.",
      "doi": ""
    },
    {
      "text": "Poincar&eacute;, H.: Die mathematische Erfindung. Leipzig 1914, reprinted in: Ulman, G. (ed.): Kreativitatsforschung. K&ohuml;ln 1973.",
      "doi": ""
    }
  ]
}