{
  "doi": "10.1145/800045.801572",
  "title": "Manual dexterity-a user-oriented approach to creating computer documentation.",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "11-18",
  "year": 1983,
  "badges": [],
  "abstract": "This paper will not advocate list of firm recommendations about document design because it is recognised that design decisions will vary with many factors. Instead, the present discussion will emphasize that when making these decisions it is necessary for designers to take account of how readers will use the information provided. In order to help them do this, a simple framework is proposed which outlines the rudiments of how people interact with technical documents. The advantages of this framework will be illustrated by using it to motivate design decisions at two decision levels. At a “macro” level the document designer must make broad decisions about the contents and format of the manual. At a “micro” level the designer must select particular combinations of linguistic, graphic and typographic options which will help readers locate, understand and implement the information given in the manual.",
  "authors": [
    {
      "name": "Patricia Wright",
      "institution": "MRC Applied Psychology Unit, Cambridge, U.K.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100660293",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J.R. (1982) Acquisition of cognitive skill. Psychological Review, 89, 369-406.",
      "doi": ""
    },
    {
      "text": "Baker, L. and Anderson, R.I. (1982) Effects of inconsistency on text processing: evidence for comprehension monitoring. Reading Research Quarterly, 17, 281-294.",
      "doi": ""
    },
    {
      "text": "Barnum, C. (1981) A view from the lectern: What's wrong with technical writing today? Byte, 6, 409-412.",
      "doi": ""
    },
    {
      "text": "Bethke, F.J. (1979) The index as editor. Journal of Technical Writing and Communication,9, 281-286.",
      "doi": ""
    },
    {
      "text": "Bethke, F.J., Dean, W.M., Kaiser, P.H., Ort, E. and Pessin, F.H. (1981) Improving the usability of programming publications. IBM Systems Journal, 20, 306-320.",
      "doi": "10.1147/sj.203.0306"
    },
    {
      "text": "Bransford, J.D. (1979) Human Cognition:Learning, Understanding and Remembering. Belmont, Ca: Wadsworth.",
      "doi": ""
    },
    {
      "text": "Clark, H.H. and Clark, E. (1968) Semantic distinctions and memory for complex sentences. Quarterly Journal of Experimental Psychology, 20, 129-138.",
      "doi": ""
    },
    {
      "text": "Clark, H.H. and Lucy, P. (1975) Understanding what is said from what is meant: a study in conversationally conveyed requests. Journal of Verbal Learning and Verbal Behavior, 14, 56-72.",
      "doi": ""
    },
    {
      "text": "Clark, H.H. and Schunk, D.H. (1980) Polite responses to polite requests. Cognition, 8, 111-143.",
      "doi": ""
    },
    {
      "text": "Coke, E. (1982) Computer aids for writing text. In D.H. Jonassen N.J.: Educational Technology Publications.",
      "doi": ""
    },
    {
      "text": "Coombs, M.J., Gibson, R.and Alty, J.L. (1982) Learning a first computer language: strategies for making sense. International Journal of Man-Machine Studies, 16, 449-486.",
      "doi": ""
    },
    {
      "text": "Dixon, P. (1982) Plans and written directions for complex tasks. Journal of Verbal Learning and Verbal Behavior, 21, 70-84.",
      "doi": ""
    },
    {
      "text": "Duffy, T.M. (1981) Organising and utilising document design options. Information Design Journal, 2, 256-266.",
      "doi": ""
    },
    {
      "text": "Duffy, T., Curran, T.E. and Sass. D. (1983) Document design for technical job tasks: an evaluation. Human Factors, 25, 143-160.",
      "doi": ""
    },
    {
      "text": "Ehrlich, K. and Johnson-Laird, P.N. (1982) Spatial descriptions and referential continuity. Journal of Verbal Learning and Verbal Behavior, 21, 296-306.",
      "doi": ""
    },
    {
      "text": "Felker, D.B. (1980) Instructional Research. In D.B. Felker (ed) Document Design: a review of the relevant research. Washington, D.C.: American Institutes for Research Technical Report 75002-4/80,",
      "doi": ""
    },
    {
      "text": "Felker, D.B., Pickering, F., Charrow, V.D., Holland, V.M. and Redish, J.C. (1981) Guidelines for Document Designers. Document Design Project, American Institutes for Research, Washington, D.C.",
      "doi": ""
    },
    {
      "text": "Flesch, R.F. (1948) A new readability yardstick. Journal of Applied Psychology, 32, 221-233.",
      "doi": ""
    },
    {
      "text": "Frase, L.T. (1981) Writing, text and the reader. In C.H. Frederiksen and J.F. Dominic (eds) Writing: the nature, development and teaching of written communication, volume 2, process development and communication. Hillsdale, N.J.: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Gilliland, J. (1972) Readability. London: Hodder and Stoughton.",
      "doi": ""
    },
    {
      "text": "Glucksberg, S. and McClosky, M. (1981) Decisions about ignorance: knowing that you do not know. Journal of Experimental Psychology: Human Learning and Memory, 7, 311-325.",
      "doi": ""
    },
    {
      "text": "Gould, J.D. (1981) Composing letters with computer-based text editors. Human Factors, 23, 593-606.",
      "doi": ""
    },
    {
      "text": "Gregg, L.W. and Steinberg, E.R. (eds) Cognitive processes in writing. Hillsdale, N.J.:Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Halliday, M.A.K. (1978) Language as Social Semiotic: the social interpretation of language and meaning. London: Edward Arnold.",
      "doi": ""
    },
    {
      "text": "Hammond, N. Jorgensen, A., Maclean, A., Barnard, P. and Long, J. (1983) Design practice and interface usability: evidence from interviews with designers. Proceedings of CHI'83, Boston.  ",
      "doi": "10.1145/800045.801577"
    },
    {
      "text": "Hartley, J. (1978) Designing Instructional Text. London: Kogan Page",
      "doi": ""
    },
    {
      "text": "Hartley, J. (1981) Eighty ways of improving instructional text. IEEE Transactions on Professional Communication, 24, 17-27.",
      "doi": ""
    },
    {
      "text": "Hartley, J. (1982) Information mapping: a critique. Information Design Journal, 3, 51-58.",
      "doi": ""
    },
    {
      "text": "Hayes-Roth, F., Klahr, P. and Mostow, D.J. (1981) Advice taking and knowledge refinement: an iterative view of skill acquisition. In J.R. Anderson (ed) Cognitive Skills and their Acquisition. Hillsdale, N.J.: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Howard, J. (1981) What is good documentation? Byte, 6, 132-150.",
      "doi": ""
    },
    {
      "text": "Kieras, D.E. (1980) Initial mention as a signal to thematic content in technical passages. Memory and Cognition, 8, 345-353.",
      "doi": ""
    },
    {
      "text": "Johnson-Laird, P.N. (1980) Mental models in cognitive science. Cognitive Science,4,71-115.",
      "doi": ""
    },
    {
      "text": "Macdonald-Ross, M. and Waller, R.H. (1976) The transformer. Penrose Annual, 69, 141-152.",
      "doi": ""
    },
    {
      "text": "Mani, K. and Johnson-Laird, P.N. (1982) The mental representation of spatial descriptions. Memory and Cognition, 10, 181-187.",
      "doi": ""
    },
    {
      "text": "Matthews, C., Jacobson, M. and Jones, R. (1982) Common sense, skill and research in forms design. Information Design Journal, 3, 87-95.",
      "doi": ""
    },
    {
      "text": "Miyake, N. and Norman, D.A. (1979) To ask a question one must know enough to know what is not known. Journal of Verbal Learning and Verbal Behavior, 18, 357-364.",
      "doi": ""
    },
    {
      "text": "Morgan, C. (1980) What's wrong with technical writing today? Byte, 5, p6,8,10.",
      "doi": ""
    },
    {
      "text": "Muter, P., Latremouille, S.A., Treurniet, W.C. and Beam, P. (1982) Extended reading of continuous text on television screens. Human Factors, 24, 501-508.",
      "doi": ""
    },
    {
      "text": "Redish, J.C., Felker, D.B. and Rose, A.M. (1981) Evaluating the effects of document Design Principles. Information Design Journal, 2, 236-243.",
      "doi": ""
    },
    {
      "text": "Reynolds, L. (1979) Teletext and Viewdata - a new challenge for the designer. Information Design Journal, 1, 2-14.",
      "doi": ""
    },
    {
      "text": "Rothkopf, E.Z., Fisher, D.G. and Billington, M.J. (1982) Effects of spatial context during acquisition on the recall of attributive information. Journal of Experimental Psychology: Human Memory and Cognition, 8, 126-138.",
      "doi": ""
    },
    {
      "text": "Rummelhart, D.E. and Norman, D.A. (1981) Analogical processes in learning. In J.R. Anderson (ed) Cognitive Skills and their Acquisition. Hillsdale, N.J.: Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Sticht, T.G. (1977) Comprehending reading at work. In M.A. Just and P.A. Carpenter (1977) Cognitive Processes in Comprehension. Hillsdale, N.J.: Lawrence Erlbaum.",
      "doi": ""
    },
    {
      "text": "Twyman, M. (1982) The graphic presentation of language. Information Design Journal, 3, 2-22.",
      "doi": ""
    },
    {
      "text": "Waller, R.H. (1979) Typographic access structures for educational texts. In P.A. Kolers, M.E. Wrolstad and H. Bouma (eds) Processing of Visible Language 1. N.Y.: Plenum Press.",
      "doi": ""
    },
    {
      "text": "Waller, R.H. (1982) Text as diagram: using typography to improve access and understanding. In D.H. Jonassen (ed) The Technology of Text. Englewood Cliffs, N.J.: Educational Technology Publications.",
      "doi": ""
    },
    {
      "text": "Wright, P. (1980) Usability: the criterion for designing written information. In P.A. Kolers, M.E. Wrolstad and H. Bouma (eds) Processing of Visible Language 2. N.Y.: Plenum Press.",
      "doi": ""
    },
    {
      "text": "Wright, P. (1981) Five skills technical writers need. IEEE Transactions on Professional Communication, 24, 10-16.",
      "doi": ""
    },
    {
      "text": "Wright, P. (1983) Is evaluation a myth? Assessing text assessment procedures. In D.Jonassen (ed) The Technology of Text, vol 2. Englewood Cliffs, N.J.:Educational Technology Publications.",
      "doi": ""
    },
    {
      "text": "Wright, P., Creighton, P. and Threlfall, S.M. (1982) Some factors determining when instructions will be read. Ergonomics,25, 225-237.",
      "doi": ""
    },
    {
      "text": "Wright, P. and Reid, F. (1973) Written information:some alternatives to prose for expressing the outcomes of complex contingencies. Journal of Applied Psychology, 57, 160-166.",
      "doi": ""
    },
    {
      "text": "Wright, P. and Threlfall, S.M. (1980) Readers' expectations about format influence the usability of an index. Journal of Research communication Studies, 2, 99-106.",
      "doi": ""
    },
    {
      "text": "Young, R.M. and Hull, A.H. (1982) Cognitive aspects of the selection of viewdata options by casual users. Proceedings of 6th International Conference on Computer Communication. London.",
      "doi": ""
    },
    {
      "text": "Young, R.M. and Hull, A.H. (1983) Categorisation structures in hierarchical menus. Proceedings of 10th International Symposium on Human Factors in Telecommunications. Finland.",
      "doi": ""
    }
  ]
}