{
  "doi": "10.1145/800045.801583",
  "title": "A methodology for objectively evaluating error messages",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "68-71",
  "year": 1983,
  "badges": [],
  "abstract": "Message quality is a critical factor in influencing user acceptance of a program product. Good error messages can reduce the time and cost to create and maintain software, as well as help users learn about the product. We have developed a methodology for conducting controlled usability evaluations of error messages. The Message Test Program is easily modified to adapt to different product situations, and messages can be evaluated even before working code exists. The Message Test Program can be used to test error messages for a batch product, as well as messages for an interactive product. It can also be used for stand-alone messages, for products that offer on-line help, or messages that provide additional information in a reference manual. Message testing enables us to objectively evaluate error messages and provide specific feedback about the difficulties users encounter and how error messages can be improved.",
  "authors": [
    {
      "name": "Barbara S. Isa",
      "institution": "Human Factors Center, International Business Machines Corporation, San Jose, California",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659377109",
      "orcid": "missing"
    },
    {
      "name": "James M. Boyle",
      "institution": "Human Factors Center, International Business Machines Corporation, San Jose, California",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100205555",
      "orcid": "missing"
    },
    {
      "name": "Alan S. Neal",
      "institution": "Human Factors Center, International Business Machines Corporation, San Jose, California",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100230875",
      "orcid": "missing"
    },
    {
      "name": "Roger M. Simons",
      "institution": "Human Factors Center, International Business Machines Corporation, San Jose, California",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332527909",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brown, C. M., Burkleo, H. V., Mangelsdorf, J. E., Olsen, R. A., Williams, A. R. Jr. Human Factors Engineering Standards for Information Processing Systems Sunnyvale, Ca.: Lockheed Missile &amp; Space Company, Inc. June 1981.",
      "doi": ""
    },
    {
      "text": "Dean, M. How to Create Meaningful Messages. Proceedings, Software and Information Usability Symposium IBM Corporation, Kingston, NY: September 1981.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. System Message Design: Guidelines and Experimental Results. In A. Badre &amp; B. Shneiderman (Eds.), Directions in Human-Computer Interaction. Norwood, NJ: Ablex Publishing Co., 1982.",
      "doi": ""
    }
  ]
}