{
  "doi": "10.1145/800045.801626",
  "title": "An experimental evaluation of on-line HELP for non-programmers",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "277-281",
  "year": 1983,
  "badges": [],
  "abstract": "An interactive computer system was made easier to learn for non-programmers by modifying the on-line HELP and error messages of a system designed primarily for programmers. The modifications included supplementing the existing HELP command with a HELP key, making the content of HELP and error messages more concrete, responding to command synonyms, and more. The systems were evaluated in a between-groups experiment in which office workers with no programming experience were asked to perform a typical office task using one of the unfamiliar interactive computer systems. The results of the experiment supported the inclusion of the modifications. Non-programmers using the modified system completed the computer task in less time, with greater accuracy, and with better resulting attitudes than those who used the system designed primarily for programmers.",
  "tags": [],
  "authors": [
    {
      "name": "Celeste S. Magers",
      "institution": "Digital Equipment Corporation, Corporate Research and Architecture, Hudson, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100285564",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cohill, Andrew M. and Robert C. Williges. \"Computer Augmented Retrieval of Help Information for Novice Users,\" Proceedings of the 1982 Human Factors Society Annual Meeting, Seattle WA, October 1982, pp. 79-82.",
      "doi": ""
    },
    {
      "text": "Fenchel, Robert S. and Gerald Estrin. \"Self-Describing Systems Using Integral Help,\" IEEE Transactions on Systems, Man, and Cybernetics, Vol. SMC-12, No. 2, March/April 1982, pp. 162-167.",
      "doi": ""
    },
    {
      "text": "Kolb, David A. \"Management and the Learning Process,\" in David A. Kolb, Irwin M. Rubin, and James M. McIntyre, (eds.) Organizational Psychology: A Book of Readings, 2nd ed. Englewood Cliffs, New Jersey: Prentice-Hall, Inc., 1974, pp. 21-40.",
      "doi": ""
    },
    {
      "text": "Kolb, David A. Learning Style Inventory Technical Manual. Boston: McBer and Company, 1976, 45 pp.",
      "doi": ""
    },
    {
      "text": "Price, Lynne A. \"THUMB: An Interactive Tool for Accessing and Maintaining Text,\" IEEE Transactions on Systems, Man, and Cybernetics, Vol. SMC-12, No. 2, March/April 1982, pp. 155-161.",
      "doi": ""
    },
    {
      "text": "Relles, Nathan. \"The Design and Implementation of User-Oriented Systems,\" Doctoral Dissertation, University of Wisconsin, Madison WI, Department of Computer Science, August 1979, 182 pp. ",
      "doi": "10.5555/909037"
    },
    {
      "text": "Relles, Nathan and Lynne A. Price. \"A User Interface for Online Assistance,\" Proceedings of the Fifth International IEEE Conference on Software Engineering, New York NY, March 1981, pp. 400-408. ",
      "doi": "10.5555/800078.802553"
    },
    {
      "text": "Relles, N., N. K. Sondheimer, and G. P. Ingargiola. \"Recent Advances in User Assistance,\" Human Interaction and the User Interface - ACM SIGSOC Proceedings, Ann Arbor MI, May 20-22, 1981, pp. 1-5.  ",
      "doi": "10.1145/800276.810953"
    },
    {
      "text": "Sondheimer, Norman K. and Nathan Relles. \"Human Factors and User Assistance in Interactive Computing Systems: An Introduction,\" IEEE Transactions on Systems, Man, and Cybernetics, Vol. SMC-12, No. 2, March/April 1982, pp. 102-107.",
      "doi": ""
    }
  ]
}