{
  "doi": "10.1145/800045.801597",
  "title": "An assessment of computer generated space situation map projections",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "135-138",
  "year": 1983,
  "badges": [],
  "abstract": "C3 environments have increasingly incorporated computer controlled maps as decision aids. The design of map displays in space oriented C3 systems has taken on greater importance due to the complex spatial relationships among orbiting objects. The large number of objects orbiting the globe and their great speeds further complicates efforts to quickly and accurately portray their positions graphically. This paper describes an experimental plan aimed at evaluating a new 2D/3D “hybrid” space situation map display. The Hybrid display is created by opening a globe at the south pole and flattening it into a platter. A third dimension is obtained by tilting the platter. It was hypothesized that the Hybrid display would offer an advantage to C3 system operators and analysts dealing with three dimensional problems. The test plan focuses on perceptual parameters and user preference issues concerning conventional and Hybrid display techniques. The results of this study will be examined to direct future work on dynamic displays, and the impact of display design approach on cognitive performance.",
  "tags": [],
  "authors": [
    {
      "name": "Mark D. Phillips",
      "institution": "Computer Technologies Associates",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659423037",
      "orcid": "missing"
    },
    {
      "name": "James E. Allison",
      "institution": "Martin Marietta Denver Aerospace",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100520924",
      "orcid": "missing"
    },
    {
      "name": "Valor S. Dodd",
      "institution": "Martin Marietta Denver Aerospace",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100405965",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, R.H. and Shapiro, N.Z. Design considerations for computer-based interactive map display systems. Santa Monica, CA., Rand Corp, R-2382-ARPA, February 1979.",
      "doi": ""
    },
    {
      "text": "Carter, R.C. Search time with a color display: Analysis of distribution functions. Human Factors, 1982, 24(2), 203-212.",
      "doi": ""
    },
    {
      "text": "Cuff, R.N. On casual users. |International Journal of Man-Machine Studies,# 1980, 12, 163-187.",
      "doi": ""
    },
    {
      "text": "Noyes, L. The position of type on maps: The effect of surrounding material on word recognition time. Human Factors, 1980, 22(3), 353-360.",
      "doi": ""
    },
    {
      "text": "Rogers, S.P. Map interpretation and geographic orientation during Nap-of-the-earth flight. Proceedings of the Human Factors Society 24th Annual Meeting, October, 1980, 414-415.",
      "doi": ""
    },
    {
      "text": "Schechterman, M.D. and Walsh, D.H. Comparison of Operator Aided Optimization with Iterative Manual Optimization in a simulated tactical decision aiding task. Santa Monica, CA., Integrated Sciences Corp., TR-215-6, July, 1980.",
      "doi": ""
    },
    {
      "text": "Silbernagel, B.L. Using realistic sensor target and scene characteristics to develop a target acquisition model. Human Factors, 1982, 24(3), 321-328.",
      "doi": ""
    },
    {
      "text": "Weirwille, W.W. and Williges, R.C. Survey and analysis of operator workload assessment techniques. Blackburg, VA, Systemetrics, S-78-101, September, 1978.",
      "doi": ""
    },
    {
      "text": "Weltman, G. Use of computer generated movie maps to improve map performance. Proceedings of the Human Factors Society 23rd annual Meeting, October 1979, 469-472.",
      "doi": ""
    }
  ]
}