{
  "doi": "10.1145/800045.801580",
  "title": "Evaluation and analysis of users' activity organization",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "54-57",
  "year": 1983,
  "badges": [],
  "abstract": "Our analyses of the activities performed by users of computer systems show complex patterns of interleaved activities. Current human - computer interfaces provide little support for the kinds of problems users encounter when attempting to accomplish several different tasks in a single session. In this paper we develop a framework for discussing the characteristics of activities, in terms of activity structures, and provide a number of conceptual guidelines for developing an interface which supports activity coordination. The concept of a workspace is introduced as a unifying construct for reducing the mental workload when switching tasks, and for supporting contextually-driven interpretations of the users' activity structures.",
  "authors": [
    {
      "name": "Liam Bannon",
      "institution": "Institute for Cognitive Science, University of California, San Diego",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100465973",
      "orcid": "missing"
    },
    {
      "name": "Allen Cypher",
      "institution": "Institute for Cognitive Science, University of California, San Diego",
      "img": "/do/10.1145/contrib-81100562008/rel-imgonly/acypher.jpg",
      "acmid": "81100562008",
      "orcid": "missing"
    },
    {
      "name": "Steven Greenspan",
      "institution": "Institute for Cognitive Science, University of California, San Diego",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332501881",
      "orcid": "missing"
    },
    {
      "name": "Melissa L. Monty",
      "institution": "Institute for Cognitive Science, University of California, San Diego",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100016750",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Huff, K. E., &amp; Lesser, V. R. Knowledge-Based Command Understanding: An Example for the Software Development Environment. Amherst, Massachusetts: Computer and Information Science, University of Massachusetts, Amherst. June 30, 1982. (Technical Report 82-6.)",
      "doi": ""
    },
    {
      "text": "Perlman, G. Two Papers in Cognitive Engineering: The design of an interface to a programming system, and MENUNIX: A menu-based interface to UNIX (User manual). La Jolla, California: Center for Human Information Processing, University of California, San Diego. November, 1981. (Report No. 8105.)",
      "doi": ""
    },
    {
      "text": "Smith, D. C., Irby, C., Kimball, R., &amp; Verplank, B. Designing the Star User Interface. Byte, 1982, 7 (No. 4: April), 242-282.",
      "doi": ""
    },
    {
      "text": "Teitelman, W., &amp; Masinter, L., The Interlisp programming environment. Computer, 1981, 14, (April, No. 4), 25-33.",
      "doi": "10.1109/C-M.1981.220410"
    }
  ]
}