{
  "doi": "10.1145/800045.801576",
  "title": "Formal specifications for modeling and developing human/computer interfaces",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "35-39",
  "year": 1983,
  "badges": [],
  "abstract": "High quality human/computer interfaces have become a major topic of research. This paper describes a new method for modeling, designing, and developing dialogues, a method that has a strong formal basis and allows a uniform syntactic and semantic specification. This formal descriptive technique has the added advantage of being executable, that is, it has widely available translators. The technique chosen here allows a very high level specification of human/computer interaction enabling rapid development and easy modification. This paper describes the nature of the formal specifications written in first order logic using Prolog, and the successful specification and development of a carrier air traffic controller (CATC) dialogue. These experiments demonstrate the utility of Prolog as a high level specification language and point the way to a full dialogue development system that can incorporate a multi-layered concept of human/computer interaction.",
  "tags": [],
  "authors": [
    {
      "name": "John Wilson Roach",
      "institution": "Department of Computer Science, Virginia Polytechnic Institute & State University, Blacksburg, Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100097161",
      "orcid": "missing"
    },
    {
      "name": "M. Nickson",
      "institution": "Department of Computer Science, Virginia Polytechnic Institute & State University, Blacksburg, Virginia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100142971",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "T. Blesser, J. Foley, \"Towards specifying and evaluating the human factors of user-computer interfaces,\" Proceedings of the Conference on Human Factors in Computer Systems, National Bureau of Standards, March 1982.  ",
      "doi": "10.1145/800049.801801"
    },
    {
      "text": "J. Fain, F. Hayes-Roth, H. Sowizral, D. Waterman, \"Programming in ROSIE: An introduction by means of examples,\" Rand Publications No. N-1646-ARPA, Feb. 1982.",
      "doi": ""
    },
    {
      "text": "R. Jacob, \"Using formal specifications in the design of a human-computer interface,\" Communications of the ACM, vol. 26, no. 4, April 1983, 259-264.  ",
      "doi": "10.1145/2163.358093"
    },
    {
      "text": "H. F. Ledgard, A. Singer, \"Formal definition and design,\" COINS Technical Report 78-01, University of Massachusetts, Amherst, 1978.",
      "doi": ""
    },
    {
      "text": "T. Moran, \"The command language grammar, a representation for the user interface of interactive computer systems,\" International Journal of Man-Machine Studies, 1981, 15.",
      "doi": ""
    },
    {
      "text": "A. Newell, \"Production systems: Models of control structures,\" in Visual Information Processing, W. G. Chase, ed., New York: Academic Press, 1973.",
      "doi": ""
    },
    {
      "text": "A. Newell, H. Simon, Human Problem Solving, Englewood Cliffs, NJ: Prentice-Hall, 1972. ",
      "doi": "10.5555/1095704"
    },
    {
      "text": "L. Pereira, Prolog written in C, manual title unavailable, Edinburgh, Scotland.",
      "doi": ""
    },
    {
      "text": "G. Pfaff, H. Kuhlmann, H. Hanusa, \"Constructing user interfaces based on logical input devices,\" Computer, Vol. 15, 11, November 1982.",
      "doi": "10.1109/MC.1982.1653889"
    },
    {
      "text": "P. Reisner, \"Formal grammar and human factors design of an interactive graphics system,\" IEEE Transactions on Software Engineering, SE-7, 1981, 229-240.",
      "doi": "10.1109/TSE.1981.234520"
    },
    {
      "text": "P. Reisner, \"Further developments toward using formal grammar as a design tool,\" Proceedings of the Conference on Human Factors in Computer Systems, National Bureau of Standards, March, 1982.  ",
      "doi": "10.1145/800049.801800"
    },
    {
      "text": "J. Roach, G. Fowler, \"The hc manual: Virginia tech prolog,\" Technical Report, Department of Computer Science, Virginia Polytechnic Institute &amp; State University, 1982.",
      "doi": ""
    },
    {
      "text": "J. Roach, H. Hartson, R. Ehrich, T. Yunten, D. Johnson, \"DMS: A comprehensive system for managing human-computer dialogue,\" Proceedings of the Conference on Human Factors in Computer Systems, National Bureau of Standards, March, 1982.  ",
      "doi": "10.1145/800049.801763"
    },
    {
      "text": "J. Robinson, E. Sibert, \"LOGLISP: an alternative to PROLOG,\" in Machine Intelligence 10, P. Hayes, D. Michie, Y-H. Pao, editors, New York: Halsted Press/John Wiley &amp; Sons, 1982.",
      "doi": ""
    },
    {
      "text": "R. Schank, R. Abelson, Scripts, Plans, Goals, and Understanding, An Inquiry into Human Knowledge Structures, Hillsdale, NJ: Lawrence Erlbaum Associates, 1977.",
      "doi": ""
    },
    {
      "text": "D. Warren, \"Implementing PROLOG,\" DAI Research Reports Nos. 39 and 40, Department of Artificial Intelligence, University of Edinburgh, Edinburgh, Scotland, 1977.",
      "doi": ""
    }
  ]
}