{
  "doi": "10.1145/800045.801605",
  "title": "How interface design determines Who has difficulty learning to use a text editor",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "176-181",
  "year": 1983,
  "badges": [],
  "abstract": "In previous studies two background characteristics of computer novices were consistently correlated with their success in learning to use a line-based computer text editor. Older people and those who scored low on a standard test of Spatial Memory had more difficulty than younger people and those with higher Spatial Memory test scores. In the present study, we observed computer novices as they learned to use a screen-based editor, which presumably reduced spatial memory load. Contrary to expectations, performance using a screen-based editor was again strongly correlated with Spatial Memory test scores. However, the correlation between performance and subjects' age was significantly reduced. Overall, subjects were able to perform the same text editing exercises almost twice as fast using the screen editor compared to subjects in previous experiments using the line editor. These results are discussed in terms of the different cognitive demands placed on users by line and screen text editors.",
  "authors": [
    {
      "name": "Louis M. Gomez",
      "institution": "Bell Laboratories, Murray Hill, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100403758",
      "orcid": "missing"
    },
    {
      "name": "Dennis E. Egan",
      "institution": "Bell Laboratories, Murray Hill, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100209082",
      "orcid": "missing"
    },
    {
      "name": "Evangeline A. Wheeler",
      "institution": "Howard University",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332535065",
      "orcid": "missing"
    },
    {
      "name": "Dhiraj K. Sharma",
      "institution": "Bell Laboratories, Murray Hill, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100235898",
      "orcid": "missing"
    },
    {
      "name": "Aleta M. Gruchacz",
      "institution": "Bell Laboratories, Murray Hill, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100186162",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cerella, J., Poon, L. W. &amp; Williams, D. M. Age and the Complexity Hypothesis. In L. W. Poon (Ed.) Aging in the 1980's. Washington, D. C.: American Psychological Association, 1980.",
      "doi": ""
    },
    {
      "text": "Egan, D. E. &amp; Gomez, L. M. Characteristics of People who can Learn to Use Computer Text Editors: Hints for Future Text Editor Design and Training. Proceedings of the ASIS Annual Meeting, 19, 1982.",
      "doi": ""
    },
    {
      "text": "Egan, D. E., &amp; Gomez, L. M., Components and Correlates of Computer Text Editing. Paper Presented at the AERA Annual Meeting, April, 1983.",
      "doi": ""
    },
    {
      "text": "Ekstrom, R. B., French, J. W. &amp; Harman, H. H. Manual for Kit of Factor-Referenced Cognitive Tests. Princeton. N.J.: Educational Testing Service, August, 1976.",
      "doi": ""
    },
    {
      "text": "Gomez, L. M., Egan, D. E. &amp; Bowers, C. H., Learning to use a Text Editor: Some Learner Characteristics that Predict Success. Manuscript submitted for publication. 1983.",
      "doi": ""
    },
    {
      "text": "Sharma, D. K. &amp; Gruchacz, A. M., The Display Text Editor: A Case Study in the Design and Implementation of Display-Oriented Interactive Human Interfaces. IEEE Transactions on Communications, 1982, Com-30, 111-119.",
      "doi": ""
    },
    {
      "text": "Nelson-Denny Reading Test, Form D. Boston: Houghton Mifflin, 1973.",
      "doi": ""
    },
    {
      "text": "Parker, J. F., Jr. &amp; Fleishman, E. A. Ability Factors and Component Performance Measures as Predictors of Complex Tracking Behavior. Psychological Monographs, 1960, 74, No. 16 (Whole No. 503): 1-36.",
      "doi": ""
    },
    {
      "text": "Roberts, T. L. &amp; Moran, T. P. The Evaluation of Text Editors: Methodology and Empirical Results. Communications of the ACM, 1983, 26, 265-283.  ",
      "doi": "10.1145/2163.2164"
    },
    {
      "text": "Two-Dimensional Space Test. Richardson, Bellows, Henry and Co., Inc., 1963.",
      "doi": ""
    }
  ]
}