{
  "doi": "10.1145/800045.801588",
  "title": "Computing on a shoestring: Initial data entry for service organizations",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "93-97",
  "year": 1983,
  "badges": [],
  "abstract": "This paper addresses the feasibility of computerized record-keeping for low-budget volunteer organizations, and presents results of an experiment designed to determine a fast, reliable, and comfortable data entry technique for enabling non-computer-user to enter large amounts of manually recorded data into a computer file.",
  "tags": [],
  "authors": [
    {
      "name": "Martha R. Horton",
      "institution": "National Institutes of Health, Division of Computer Research and Technology, Laboratory of Applied Studies, Bethesda, Maryland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408595835",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Licklider, J.C.R.; Man-Computer Communication; in Cuadra, C.A., Ed., Annual Review of Information Science and Technology; Vol. 3; 1968; Chicago; Encyclopedia Brittanica; p. 227.",
      "doi": ""
    },
    {
      "text": "Maisel, Herbert; Letter to the Chairman; in Computopics; Vol. XXVI, No. 1, September, 1982; Washington, D.C. Chapter, ACM; p. 7.",
      "doi": ""
    },
    {
      "text": "Eason, K.D., Damodaran, L., and Stewart, T.F.M.; A Survey of Man-Computer Interaction in Commercial Applications, LUTERG Report No. 144; Dept. of Human Services, University of Technology; Loughborough; 1974.",
      "doi": ""
    },
    {
      "text": "Eason, K.D., Stewart, T.F.M., and Damodaran, L.; Interface Problems in Man-Computer Interaction, in Human Choice and Computers; E. Mumford and H. Sackman, Eds.; North-Holland, Amsterdam; 1975.",
      "doi": ""
    },
    {
      "text": "Eason, K.D.; Understanding the Naive Computer User; The Computer Journal, Vol. 19, No. 1, 1976; pp. 3-7.",
      "doi": ""
    },
    {
      "text": "Williges, Beverly H. and Williges, Robert C.; User Considerations in Computer-Based Information Systems; Technical Report CSIE-81-2, prepared for Engineering Psychology Programs, Office of Naval Research, Code 455, Arlington, VA 22217; September, 1981; p. 6.",
      "doi": ""
    },
    {
      "text": "Ibid., p. 8.",
      "doi": ""
    },
    {
      "text": "Ibid., p. 21.",
      "doi": ""
    },
    {
      "text": "Ibid., p. 28.",
      "doi": ""
    },
    {
      "text": "Ibid., p. 30.",
      "doi": ""
    },
    {
      "text": "Miller, Robert B.; Human Ease of Use Criteria and their Tradeoffs; IBM Corporation, Poughkeepsie, New York; April 1971 (Technical Report TR 00.2185).",
      "doi": ""
    },
    {
      "text": "United Way of America; Washington, D.C.; Personal communication; November, 1982.",
      "doi": ""
    },
    {
      "text": "Maguire, Martin; The Development of Dialogue Design Guidelines for a Computer Based Local Information System to Be Used by the General Public; in Proceedings, Human Factors in Computer Systems; March, 1982; Washington, D.C. Chapter, ACM; p. 350.  ",
      "doi": "10.1145/800049.801809"
    }
  ]
}