{
  "doi": "10.1145/800045.801590",
  "title": "A generalized transition network representation for interactive systems",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "103-106",
  "year": 1983,
  "badges": [],
  "abstract": "A general method for describing the behavior of an interactive system is presented which is based on transition networks generalized enough to describe even very complex systems easily, as shown by an example description of a word processor. The key feature is the ability to easily describe hierarchies of modes or states of the system. The representation system is especially valuable as a design tool when used in a simulation of a proposed user interface. In order to characterize the interaction between a user and a system, an explicit and formal representation of the behavior of the system itself is needed. To be of value in the design of user interfaces, the representation should be independent of the actual implementation of the system, but also reflect the structural properties of the system's behavior, such as its hierarchical form, the possible modes, and the consistent patterns of interaction. At the same time, the representation must be easy to define and understand. This paper presents a representation notation with these properties.",
  "authors": [
    {
      "name": "David Kieras",
      "institution": "University of Arizona",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100254452",
      "orcid": "missing"
    },
    {
      "name": "Peter G. Polson",
      "institution": "University of Colorado",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100564360",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Embley, D.W. (1978). Empirical and formal language design applied to a unified control construct for interactive computing. International Journal of Man-Machine Studies, 10, 197-216.",
      "doi": ""
    },
    {
      "text": "Foley, J.D. (1980). The structure of interactive command languages. In R. A. Guedj (Ed.) Methodology of Interaction. North-Holland, 227-234.",
      "doi": ""
    },
    {
      "text": "Foley, J. D. &amp; Wallace, V. L. (1974). The art of natural graphic man-machine conversation. IEEE Transactions on Software Engineering, 62, 462-471.",
      "doi": ""
    },
    {
      "text": "Jacob, R.J.K. (1982). Using formal specifications in the design of a human-computer interface. Proceedings of a Conference on Human Factors in Computer System. Gaithersburg, MD.  ",
      "doi": "10.1145/800049.801802"
    },
    {
      "text": "Kieras, D.E., &amp; Polson, P.G. (1982). An approach to the formal analysis of user complexity. Working Paper No. 2, University of Arizona.",
      "doi": ""
    },
    {
      "text": "Parnas, D. L. (1969). On the use of transition diagrams in the design of a user interface for an interactive computer system. Proceedings of the 24th National ACM Conference, 15, 379-385.  ",
      "doi": "10.1145/800195.805945"
    },
    {
      "text": "Reisner, P. (1981). Formal grammar and human factors design of an interactive graphics system. In IEEE Transactions on Software Engineering, SE-7, 2, 229-240.",
      "doi": ""
    },
    {
      "text": "Reisner, P. (1982). Further developments toward using formal grammar as a design tool. Proceedings of a Conference on Human factors in Computer System. Gaithersburg, MD.  ",
      "doi": "10.1145/800049.801800"
    },
    {
      "text": "Woods, W. A. (1970). Transition network grammars for natural language analysis. Communications of the ACM, 13, 591-606.  ",
      "doi": "10.1145/355598.362773"
    }
  ]
}