{
  "doi": "10.1145/800045.801604",
  "title": "Patterns of experience in text editing",
  "published": "1983-12-12",
  "proctitle": "CHI '83: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "171-175",
  "year": 1983,
  "badges": [],
  "abstract": "What are the effects of experience on text editing behavior? Do users inevitably develop optimal strategies for getting their work done? The answer to such questions are becoming increasingly important, as more and more individuals begin to use word processing equipment routinely. In the best of all possible worlds, experienced users do become experts, able to quickly and accurately choose and execute optimal procedures to accomplish any given goal. Such a state of affairs would make designers of editing systems very happy indeed. But another alternative exists, that at least some proportion of experienced and frequent users stabilize at some nonoptimal level of skill. An initial survey of relevant research is encouraging. So, for example, Card, Moran, and Newell (1980) were able to deduce selection rules from experienced users' editing behavior that predicted 80% of their editing decisions, suggesting that experienced users have fairly well-defined heuristics for carrying out editing tasks. Tyler and Roth (1982) followed up on this work, demonstrating that novices were less likely to demonstrate selection rules than experienced users, preferring instead to rely on a single, sometimes inefficient, strategy. Finally, Folley and Williges (1982) demonstrated that when confronted with the description of a novel editor, users experienced on other systems make use of a greater number of commands in carrying out a paper-and-pencil application of the editor than do complete novices.",
  "tags": [],
  "authors": [
    {
      "name": "Mary Beth Rosson",
      "institution": "Thomas J. Watson Research Center",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496622",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S. K., Moran, T. P., and Newell, A. Computer text editing: An information-processing analysis of a routine cognitive skill. Cognitive Psychology, 1980, 12, 32-74.",
      "doi": ""
    },
    {
      "text": "Carroll, J. M., and Mack, R. Learning to use a word processor: By doing, by thinking, and by knowing. IBM Research Report, March, 1982.",
      "doi": ""
    },
    {
      "text": "Folley, L. and Williges, R. User models of text editing command languages. In Proceedings - Human Factors in Computer Systems, Gaithersburg, MD, March, 1982.  ",
      "doi": "10.1145/800049.801804"
    },
    {
      "text": "Hammer, J. M., and Rouse, W. S. Analysis and modeling of freeform text editing behavior. In Proceedings - 1979 International Confereronce on Cybernetics and Society, Denver, CO, October, 1979.",
      "doi": ""
    },
    {
      "text": "Lewis, C., and Mack, R. Learning to use a text processing system: Evidence from \"Thinking Aloud\" protocols. In Proceedings - Human Factors in Computer Systems, Gaithersburg, MD, March, 1982.  ",
      "doi": "10.1145/800049.801817"
    },
    {
      "text": "Rosson, M. B. Effects of experience on learning, using and evaluating a text-editor. Unpublished manuscript, T. J. Watson Research Center, Yorktown Heights, NY, 1983.",
      "doi": ""
    },
    {
      "text": "Tyler, S. W., Roth, S., and Post, T. The acquisition of text-editing skills. In Proceedings - Human Factors in Computer Systems, Gaithersburg, MD, March, 1982.  ",
      "doi": "10.1145/800049.801803"
    },
    {
      "text": "Whiteside, J., Archer, N., Wixon, D., and Good, M. How people really use text editors. DEC Human Engineering Research Report, January, 1982.",
      "doi": ""
    }
  ]
}