{
  "doi": "10.1145/800049.801792",
  "title": "Some human factors aspects of computers in air traffic control",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "268-274",
  "year": 1982,
  "badges": [],
  "abstract": "This paper reviews some of the human factors issues arising during eight years of systems research into computer-based concepts for air traffic control (ATC), carried out by the Royal Signals and Radar Establishment (RSRE) on behalf of the U.K. Civil Aviation Authority (CAA). The Ergonomics Development Unit (EDU) at Aston has been responsible for the human factors aspects.",
  "authors": [
    {
      "name": "David Whitfield",
      "institution": "University of Aston, Birmingham, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81540276556",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ball R G, Newton R S and Whitfield D. Development of an off-display, high resolution, direct touch input device: the RSRE Touchpad. Displays, l,(4) 1980, 203-207.",
      "doi": ""
    },
    {
      "text": "Bird J M. On the display of three-dimensional air traffic control situations. AP Note 47, 1975, Applied Psychology Department, University of Aston in Birmingham.",
      "doi": ""
    },
    {
      "text": "Bird J M. Further considerations on the display of three-dimensional air traffic control situations. AP Note 59, 1978, Applied Psychology Department, University of Aston in Birmingham.",
      "doi": ""
    },
    {
      "text": "Blake N A. Advanced computer program. EASCON '79 IEEE Electronics and Aerospace Systems Convention, IEEE Pub. 79CH 1476-1 AES, 1979, pp 502-506.",
      "doi": ""
    },
    {
      "text": "Crawley R C, Spurgeon P and Whitfield D. Air Traffic Controller reactions to computer assistance: a methodology for investigating controllers' motivations and satisfactions in the present system as a basis for system design (Vols 1-4) AP Report 94, 1980,# Applied Psychology Department, University of Aston in Birmingham",
      "doi": ""
    },
    {
      "text": "Federal Aviation Administration. Conflict Alert. FAA General Aviation News, October, 6-7, 1977.",
      "doi": ""
    },
    {
      "text": "Hackman J R and Oldham G R. Development of the Job Diagnostic Survey. Journal of Applied Psychology, 60 (2), 1975, 159-170.",
      "doi": ""
    },
    {
      "text": "Hopkin V D. The evaluation of touch displays for air traffic control tasks. \"Displays\": IEE Conference Publication No. 80 1971, (London: IEE)",
      "doi": ""
    },
    {
      "text": "Martin B. Short term conflict alert function in MADAP. International Seminar:\"ATC Automation\", Eurocontrol Institute of Air Navigation Services, Luxembourg, October 1979.",
      "doi": ""
    },
    {
      "text": "Ord G and Whitfield D. Small scale simulations in the development of new concepts for air traffic control. Human Operators and Simulation, 1977, London: Institute of Measurement and Control.",
      "doi": ""
    },
    {
      "text": "Printemps A. The automatic detection of collision risk for the control of air traffic in France. Man and Navigation: International Association of Institutes of Navigation, Congress 10-14 September, 1979. London: Royal Institute of Navigation.",
      "doi": ""
    },
    {
      "text": "Scholten C G H. Elements for a new departure in air traffic control. Philips Research Reports Supplements 1969, No. 2.",
      "doi": ""
    },
    {
      "text": "Sinaiko H W. Indelicate experiments and other unconventional techniques. Bulletin of the British Psychological Society, 1968, 21,178 (Abstract).",
      "doi": ""
    },
    {
      "text": "Stammers R B and Bird J M. Controller evaluation of a touch input air traffic data system: An\"indelicate\"experiment. Human Factors, 22, 1980, 581-589.",
      "doi": ""
    },
    {
      "text": "Whitfield D. A preliminary study of the air traffic controller's \"picture\". Journal of the Canadian Air Traffic Controllers' Association, 1979, 11,(1), 19-22, 25, 28.",
      "doi": ""
    },
    {
      "text": "Whitfield D, Ball R G and Ord G. Some human factors aspects of computer aiding concepts for air traffic controllers. Human Factors, 1980, 22, 569-580.",
      "doi": ""
    },
    {
      "text": "Zellweger A. The myth and reality of automated decision making in air traffic control. Paper presented at the International seminar: ATC Automation 1979, Eurocontrol Institute of Air Navigation Services, Luxembourg 1979.",
      "doi": ""
    }
  ]
}