{
  "doi": "10.1145/800049.801766",
  "title": "Indentation, documentation and programmer comprehension",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "118-120",
  "year": 1982,
  "badges": [],
  "abstract": "Recent investigations into the psychological factors underlying computer programming have focused on the effects of internal documentation and statement indentation on programmer performance [1, 5, 7]. Using memory recall approaches several studies have concentrated on the relationship between logic segments of a program's algorithm and the memory organization of the programmer. Since memory organization appears to be a functional psychological process, it seems reasonable to assume that indentation and documentation function as aids to comprehension rather than as organizers for memory [4]. The purpose of this study was to examine experimentally the relationship between documentation, indentation and the comprehension of computer programs.",
  "tags": [],
  "authors": [
    {
      "name": "Anthony F. Norcio",
      "institution": "University of Maryland, Baltimore County (UMBC), USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100202261",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Love, L. T. Relating Individual Differences in Computer Programming Performance to Human Information Processing Abilities. Ph.D. Thesis, University of Washington, 1977.",
      "doi": ""
    },
    {
      "text": "Norcio, A. F. Memory Organization and Computer Program Logic. Paper presented at the Annual Meeting of the Human Factors Society, Detroit, 1978.",
      "doi": ""
    },
    {
      "text": "Norcio, A. F. The Cloze Procedure: A Methodology for Analyzing Computer Program Comprehension. Paper presented at the Annual ACM Computer Science Conference, Dayton, 1979.",
      "doi": ""
    },
    {
      "text": "Norcio, A. F. Factors Affecting the Comprehension of Computer Programs. Paper presented at the National Computer Conference, New York, 1979.",
      "doi": ""
    },
    {
      "text": "Norcio, A. F. and Kerst, S. M. Documentation and Indentation Effects on Memory Organization of Computer Programs. Paper presented at the Annual Meeting of the American Psychological Association, New York, 1979.",
      "doi": ""
    },
    {
      "text": "Rankin, E. F. An Evaluation of the Cloze Procedure as a Technique for Measuring Reading Comprehension. Ph.D. Thesis, University of Michigan, 1957.",
      "doi": ""
    },
    {
      "text": "Sheiderman, B. Exploratory Experiments into Programmer Behavior, International Journal of Computer and Information Sciences, 1976, 5, 123-143.",
      "doi": ""
    },
    {
      "text": "Sheiderman, B. and Mayer, R. Syntactic/Semantic Interactions in Programmer Behavior: Analysis and Experimental Results. International Journal of Computer and Information Sciences, 1979.",
      "doi": ""
    }
  ]
}