{
  "doi": "10.1145/800049.801796",
  "title": "Designing the Human-Computer Interface",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "288-291",
  "year": 1982,
  "badges": [],
  "abstract": "There is a growing awareness in the academic and industrial computing communities of the need to introduce human factors considerations into the design of computer systems. At the School of Information and Computer Science of the Georgia Institute of Technology, this need is being met through a well-funded graduate research program in the human factors of computer systems as well as the introduction of courses that emphasize usability in designing the human-computer interface. The course detailed in this paper has the title “Human-Computer Interface.”",
  "authors": [
    {
      "name": "Albert N. Badre",
      "institution": "Georgia Institute of Technology, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100605196",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Atwood, M.E., and Ramsey, H.R., \"Cognitive structure in the comprehension and memory of computer programs: An investigation of computer programming debugging,\" ARI Technical Report, TR-78-A210, Science Applications, Englewood, Colorado, August 1978.",
      "doi": ""
    },
    {
      "text": "Badre, A.N., \"Selecting and representing information structures for tactical decision systems,\" ARI Technical Report, (DAHC19-77-G-0022), 1979.",
      "doi": ""
    },
    {
      "text": "Badre, A.N., \"Human Cognitive factors in front-end interaction,\" COMPCON Proceedings, September 1980, Wahington, D.C.",
      "doi": ""
    },
    {
      "text": "Boles, S.J., \"User behavior in an interactive computer system,\" IBM Systems Journal, 13, 1-18, 1974.",
      "doi": ""
    },
    {
      "text": "Brosey, M. and Shneiderman, B., \"Two experiment comparisons of relational and hierarchical database models,\" International Journal of Man-Machine Studies, 10, 625-637, 1978.",
      "doi": ""
    },
    {
      "text": "Codd, E.F., \"Seven steps to rendezvous with the casual user,\" IBM Research Report, RJ 1333, 1974.",
      "doi": ""
    },
    {
      "text": "Fitzgerald, M.L., \"Common Command language for file manipulation and network job execution: An example,\" National Bureau of Standards Special Publication 500-37, August 1978.",
      "doi": ""
    },
    {
      "text": "Gould, J.D., \"Visual factors in the design of computer-controlled CRT displays,\" Human Factors, 10, 359-376, 1968.",
      "doi": ""
    },
    {
      "text": "Grossberg, M., Wiesen, R.A., and Yntema, D.B., \"An experiment on problem solving with delayed computer responses,\" IEEE Transactions on Systems, Man, and Cybernetics, March 1976.",
      "doi": ""
    },
    {
      "text": "Hepler, S.P., \"Continuous Versus Intermittent Display of Information,\" Human Factors, 18, April 1976.",
      "doi": ""
    },
    {
      "text": "Hoag, L.L., \"An overview of research needs in the display systems design area,\" Proceedings of the Human Factors Society, 21st Annual Meeting, 316-317, 1977.",
      "doi": ""
    },
    {
      "text": "Kochen, M. and Badre, A.N., \"On the precision of adjectives that denote fuzzy sets,\" The Journal of Cybernetics, 4, 49-59, 1974.",
      "doi": ""
    },
    {
      "text": "Lachman, R., Lachman, J., and Butterfield, E., Cognitive Psychology and Information Processing: An Introduction, New York: Wiley, 1979.",
      "doi": ""
    },
    {
      "text": "Ledgard, H. and Singer, A., The Case for Human Engineering, COINS Tech. Report 77-11, (DAAG-29-87-G-0216 and MCS76-80854), September, 1977.",
      "doi": ""
    },
    {
      "text": "Martin, E., and Badr, A.N., \"Problem formulation for programmers,\" SIGCSE Computer Science Education ACM Bulletin, 9, 133-148, 1977.  ",
      "doi": "10.1145/382063.803375"
    },
    {
      "text": "Martin, J., Design of Man-Computer Dialogue, Englewood Cliffs, N.J.: Prentice-Hall, 1973. ",
      "doi": "10.5555/574884"
    },
    {
      "text": "Miller, L.A. and Thomas, Jr., J.C., \"Behavioral issues in the use of interactive systems,\" International Journal of Man-Machine Studies, 9, 509-536, 1977.",
      "doi": ""
    },
    {
      "text": "Palme, J., Interactive Software for Humans, Research Institute of National Defense, Stockholm, Sweden, July 1975.",
      "doi": ""
    },
    {
      "text": "Reisner, P., \"Use of psychological experimentation as an aid to development of a query language,\" IEEE Transactions on Software Engineering, SE-3, May 1977.",
      "doi": "10.1109/TSE.1977.231131"
    },
    {
      "text": "Reisner, P., Boyce, R.F. and Chamberlin, D.D., \"Human factors evaluation of two data base query languages - Square and Sequel,\" National Computer Conference, 1975.",
      "doi": ""
    },
    {
      "text": "Rouse, W.B., \"Human-computer interaction in the control of dynamic systems,\" ACM Computing Surveys: The Psychology of Human-Computer Interaction, 13, March 1981.  ",
      "doi": "10.1145/356835.356839"
    },
    {
      "text": "Shneiderman, B., Software Psychology: Human factors in computer and information systems, Winthrop, New York, 1980. ",
      "doi": "10.5555/1097028"
    },
    {
      "text": "Stewart, T.F.M., \"Displays and the software interface,\" Applied Ergonomics, 137-146, September, 1976.",
      "doi": ""
    },
    {
      "text": "Thomas, J.C. and Gould, J.D., \"A psychological study of query by example,\" IBM Research Report, RC 5124, 1974.",
      "doi": ""
    },
    {
      "text": "Thomas, J.C., \"Quantifiers and question-asking,\" IBM Thomas J.Watson Research Center Technical Report RC-5866, Yorktown Heights, N.Y., 1976.",
      "doi": ""
    },
    {
      "text": "Ting, T.C. and Badre, A.N., \"Dynamic model of man-machine interactions: Design and application with an audiographic learning facility,\" The Journal of Man-Machine Studies, 8, 75-88, 1976.",
      "doi": ""
    },
    {
      "text": "Vartabedian, A.G., \"The effects of letter size, case, and generation method on CRT display search time,\" Human Factors, 13, August, 1971.",
      "doi": ""
    },
    {
      "text": "Vartabedian, A.G., \"Legibility of symbols on CRT displays,\" Applied Ergonomics, September, 1971.",
      "doi": ""
    },
    {
      "text": "Williges, B., Williges, R. and Savage, R. \"Models for automated motor skills training,\" Proceedings of the Human Factors Society, 21st Annual Meeting, September, 1977.",
      "doi": ""
    },
    {
      "text": "Winer, B.J., Statistical Principles in Experimental Design, New York: McGraw-Hill, 1962.",
      "doi": ""
    },
    {
      "text": "Wright, P. and Barnard, P., \"'Just fill in this form' - A review for designers,\" Applied Ergonomics, 213-220, 1975.",
      "doi": ""
    },
    {
      "text": "Zloof, M., \"Query-by-example&mdash;Operations on hierarchical data bases,\" National Computer Conference, 1976.",
      "doi": ""
    },
    {
      "text": "Zloof, M., \"Query by Example,\" National Computer Conference, 1975.",
      "doi": ""
    }
  ]
}