{
  "doi": "10.1145/800049.801758",
  "title": "How acceptable are computers to professional persons?",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "74-77",
  "year": 1982,
  "badges": [],
  "abstract": "Although our lives are all touched by computers these days, a great many people seem to be ambivalent about them, either fearing them or exhibiting reluctance about interacting with them. The most relevant study about attitudes towards computers was conducted by Lee [1] in 1963. He found two major orthogonal factors: the computer viewed as a beneficial tool of man, and as a superhuman thinking machine that downgrades man's previously unique significance in the order of things. Not only have computers changed quite dramatically since 1963, they have also become increasingly common. It would seem likely then that attitudes towards computers have also changed and hence need to be re-evaluated in the present decade. In this study, the attitudes of certified public accountants (CPAs), lawyers, pharmacists, and physicians were investigated. Professionals were studied because many marketing and electronics analysts have commented that industry is currently designing computers for professional persons [2]. Computer availability, however, does not necessarily lead to computer acceptability. Therefore, the primary question this study sought to answer was - how acceptable are computers to professional persons?",
  "tags": [],
  "authors": [
    {
      "name": "Elizabeth Zoltan",
      "institution": "John Hopkins University, Baltimore, Maryland, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332538096",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lee, R.S. Social attitudes and the computer revolution. Public Opinion Quarterly, 1970, 34, 53-59.",
      "doi": ""
    },
    {
      "text": "Schuyten, P.J. Home computer: Demand lags. New York Times, 1979, 128, D2.",
      "doi": ""
    }
  ]
}