{
  "doi": "10.1145/800049.801763",
  "title": "DMS: A comprehensive system for managing human-computer dialogue",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "102-105",
  "year": 1982,
  "badges": [],
  "abstract": "As the complexity of human-computer interfaces increases, those who use these interfaces as well as those reponsible for their design have recognized an urgent need for substantive research in the human factors of software development [2], [5]. Because of the magnitude of the task of producing software for individual human-computer interfaces, appropriate tools are needed for defining and improving such interfaces, both in research and production environments. This paper describes the research being carried out to construct DMS (Dialogue Management System), which is a complete system for defining, modifying, executing, and metering human-computer dialogues.",
  "tags": [],
  "authors": [
    {
      "name": "John Roach",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100097161",
      "orcid": "missing"
    },
    {
      "name": "H. Rex Hartson",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100488487",
      "orcid": "missing"
    },
    {
      "name": "Roger W. Ehrich",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100208352",
      "orcid": "missing"
    },
    {
      "name": "Tamer Yunten",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100037099",
      "orcid": "missing"
    },
    {
      "name": "Deborah H. Johnson",
      "institution": "Virginia Polytechnic Institute and State University, Blacksburg, VA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100455702",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barron, John L., \"Dialogue Organization and Structure for Interactive Information Systems,\" Technical Report CSRG-108, Department of Computer Science, University of Toronto (1980).",
      "doi": ""
    },
    {
      "text": "Basili, Victor R., and Reiter, Robert W., Jr. \"An Investigation of Human Factors in Software Development,\" IEEE Computer (December 1979), 21-38.",
      "doi": ""
    },
    {
      "text": "O'Hare, John J., Book Review, in Newsletter of the Technical Group on Computer Systems, Human Factors Society (1980) 4.",
      "doi": ""
    },
    {
      "text": "Ross, D.T., and Schoman, K. E. Jr., \"Structured Analysis for Requirements Definition,\" IEEE Trans. on Software Engineering SE-3, 1 (1977), 6-15.",
      "doi": "10.1109/TSE.1977.229899"
    },
    {
      "text": "Shneiderman, Ben, Software Psychology, Human Factors in Computer and Information Systems Winthrop Publishers, Inc. (1980). ",
      "doi": "10.5555/1097028"
    },
    {
      "text": "Teichroew, D., and Hershey, E. A. III, \"PSL/PSA: A Computer-Aided Technique for Structured Documentation and Analysis of Information Processing Systems,\" IEEE Trans. on Software Engineering SE-3, 1 (1977), 41-48.",
      "doi": "10.1109/TSE.1977.229902"
    },
    {
      "text": "Thomas, J. C., and Carroll, J. M., \"Human Factors in Communication,\" IBM Systems Journal 20,2 (1981), 237-263.",
      "doi": "10.1147/sj.201.0002"
    },
    {
      "text": "VanCott, H. P., and Kinkade, R. G., Human Engineering Guide to Equipment Design U. S. Government Printing Office, Washington, D. C. (1972).",
      "doi": ""
    },
    {
      "text": "Wasserman, Anthony I., \"Information System Design Methodology,\" J. of the Amer. Soc. for Info. Science (January 1980), 5-24.",
      "doi": ""
    },
    {
      "text": "Zisman, M. D., \"Representation, Specification, and Automation of Office Procedures,\" Ph.D. Thesis, Dept. of Decision Science, The Wharton School, University of Pennsylvania (September 1977).",
      "doi": ""
    }
  ]
}