{
  "doi": "10.1145/800049.801771",
  "title": "An ease of use evaluation of an integrated document processing system",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "142-147",
  "year": 1982,
  "badges": [],
  "abstract": "Designers of systems intended to be easy to use have many guidelines available to them in the literature. Most of these recommendations are based on the intuition and experiences of particular designers with particular systems. Very few of them have been evaluated experimentally, so one must be cautious not to attribute more authority to these guidelines than they deserve [6]. This paper summarizes the results of an experimental evaluation of the Etude text processing system [8]. Section 2 provides a brief overview of Etude. Section 3 describes the development of suitable ease of use criteria. Section 4 presents the experimental protocol. Section 5 discusses the results of the evaluation. A complete description of the experiment can be found in [7].",
  "tags": [],
  "authors": [
    {
      "name": "Michael Good",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100090422/rel-imgonly/michael-formal-square2.png",
      "acmid": "81100090422",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bennett, J. L. The user interface in interactive systems. In Annual Review of Information Science and Technology, Vol. 7, C. A. Cuadra, Ed., American Society for Information Science, Washington, 1972, pp. 159-196.",
      "doi": ""
    },
    {
      "text": "Beyer, W. H. (Ed.). The CRC Handbook of Tables for Probability and Statistics. The Chemical Rubber Co., Cleveland, 1966. Confidence intervals for medians in Table VII. 3 on p. 266.",
      "doi": ""
    },
    {
      "text": "Buros, O. K. (Ed.). The Eighth Mental Measurements Yearbook, Vol. 1. The Gryphon Press, Highland Park, N.J., 1978. Entry No. 683, pp. 1088-1096, contains STAI bibliography.",
      "doi": ""
    },
    {
      "text": "Consistent System: Elementary Statistical Analysis. First edition, Renaissance Computing, Inc., 675 Massachusetts Avenue, Cambridge, Mass. 02139, 1980.",
      "doi": ""
    },
    {
      "text": "Gebhardt, F. and Stellmacher, I. Design criteria for documentation retrieval languages. J. American Society for Information Science 29 (1978), 191-199.",
      "doi": ""
    },
    {
      "text": "Good, M. Etude and the folklore of user interface design. SIGPLAN Notices 16 (June 1981), 34-43.  ",
      "doi": "10.1145/872730.806452"
    },
    {
      "text": "Good, M. An ease of use evaluation of an integrated editor and formatter. Tech. Rep. TR-266, MIT Lab. for Computer Science, Nov., 1981. Revised version of MIT M.S. thesis. ",
      "doi": "10.5555/889874"
    },
    {
      "text": "Hammer, M. et al. Etude: an integrated document processing system. 1981 Office Automation Conference Digest, AFIPS, March, 1981, pp. 209-219.",
      "doi": ""
    },
    {
      "text": "Hansen, J. B. Effects of feedback, learner control, and cognitive abilities on state anxiety and performance in a computer-assisted instruction task. J. Educational Psychology 66 (1974), 247-254.",
      "doi": ""
    },
    {
      "text": "Heise, D. R. The semantic differential and attitude research. In Attitude Measurement, G. F. Summers, Ed., Rand McNally, Chicago, 1970, pp. 235-253.",
      "doi": ""
    },
    {
      "text": "IIson, R. An integrated approach to formatted document production. Tech. Rep. TR-253, MIT Lab. for Computer Science, Aug., 1980. MIT M.S. thesis. ",
      "doi": "10.5555/889861"
    },
    {
      "text": "Lucas, R. W. A study of patients' attitudes to computer interrogation. Internat. J. Man-Machine Studies 9 (1977), 69-86.",
      "doi": ""
    },
    {
      "text": "Miller, R. B. Human ease of use criteria and their tradeoffs. Tech. Rep. TR 00.2185, IBM Poughkeepsie Laboratory, April 12, 1971.",
      "doi": ""
    },
    {
      "text": "Niamir, B. A virtual terminal interface for text processing applications. Memo OAM-011, MIT Lab. for Computer Science, Office Automation Group, Dec., 1979.",
      "doi": ""
    },
    {
      "text": "Osgood, C. E., Suci, G. J. and Tannenbaum, P. H. The Measurement of Meaning. University of Illinois Press, 1957.",
      "doi": ""
    },
    {
      "text": "Roberts, T. L. Evaluation of computer text editors. Report SSL-79-9, Xerox PARC, Nov., 1979. Stanford Ph.D. dissertation. ",
      "doi": "10.5555/909448"
    },
    {
      "text": "Snider, J. G. and Osgood, C. E. (Eds.). Semantic Differential Technique. Aldine Publishing Co., Chicago, 1969.",
      "doi": ""
    },
    {
      "text": "Spielberger, C. D. Anxiety as an emotional state. In Anxiety: Current Trends in Theory and Research, Vol. 1, C. D. Spielberger, Ed., Academic Press, New York, 1972, pp. 23-49.",
      "doi": ""
    },
    {
      "text": "Spielberger, C. D., Gorsuch, R. L. and Lushene, R. E. Manual for the State-Trait Anxiety Inventory. Consulting Psychologists Press, 577 College Ave., Palo Alto, Calif. 94306, 1970.",
      "doi": ""
    },
    {
      "text": "Walther, G. H. The on-line user-computer interface: the effects of interface flexibility, experience, and terminal-type on user-satisfaction and performance. Ph.D. Th., U. Texas at Austin, Aug., 1973. NTIS No. AD-777 314. ",
      "doi": "10.5555/906583"
    },
    {
      "text": "Ward, S. A. and Terman, C. J. An approach to personal computing. Digest of Papers, Compcon '80, IEEE, Feb., 1980, pp. 460-465.",
      "doi": ""
    },
    {
      "text": "Wilcoxon, F. and Wilcox, R. A. Some Rapid Approximate Statistical Procedures. American Cyanamid Co., Pearl River, N.Y., 1964.",
      "doi": ""
    }
  ]
}