{
  "doi": "10.1145/800049.801786",
  "title": "Error-correcting strategies and human interaction with computer systems",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "236-238",
  "year": 1982,
  "badges": [],
  "abstract": "Human problem-solving strategies may be classified as error-preventing (no response is chosen until one can be selected with relatively high confidence) or error-correcting (a tentative solution is formulated immediately, subject to revision in the light of subsequent evidence). Recent work in the author's laboratory indicates a strong preference for error-correcting over error-preventing strategies on the part of human problem-solvers. Unfortunately, most contemporary computer languages and programming environments enforce an error-preventing rather than error-correcting strategy. Using Marvin Minsky's concept of a frame, an error-correcting programming strategy may be thought of as obtaining a program frame with all parameters pre-set to their default values, and then revising those values until a script corresponding to a successful solution is arrived at. The present paper defines a frame-based programming environment which can accommodate error-correcting programming strategies, and discusses the application of such environments to different types of programming languages.",
  "authors": [
    {
      "name": "Adam V. Reed",
      "institution": "Bell Laboratories, Holmdel, NJ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100320026",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Reed, A.V., 1973. Speed-accuracy tradeoff in recognition memory. Science, 181: 574-6.",
      "doi": ""
    },
    {
      "text": "Reed, A.V., 1976. List length and the time course of recognition in immediate memory. Memory and Cognition, 4: 16:30.",
      "doi": ""
    },
    {
      "text": "Scholler, W., 1981, dissertation submitted to the Department of Psychology, Graduate Faculty of Political and Social Science in partial fulfillment of the requirements for the degree of Doctor of Philosophy.",
      "doi": ""
    }
  ]
}