{
  "doi": "10.1145/800049.801817",
  "title": "Learning to use a text processing system: Evidence from “thinking aloud” protocols",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "387-392",
  "year": 1982,
  "badges": [],
  "abstract": "There is growing interest in cognitive science in the the mental processes that underly learning and using computer systems (e. g., Bott {1}; Mayer, {2}; Card, Moran & Newell {3}). In this paper we report generalizations about the problems people who are not experienced with computers have learning to use a text-processing system. We are especially interested in unaided self-instruction, because of the practical interest in reducing the role of experienced personel in the training process. We analyze these difficulties in terms of the interaction between the cognitive characteristics of the learner, and the design of self-instruction, and the interface. Finally, we are also interested in implications of these problems for designing better training methods and computer interfaces that are easier to learn.",
  "tags": [],
  "authors": [
    {
      "name": "Clayton Lewis",
      "institution": "IBM T.J. Watson Research Center, Box 218, Yorktown Heights, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100349845",
      "orcid": "missing"
    },
    {
      "name": "Robert Mack",
      "institution": "IBM T.J. Watson Research Center, Box 218, Yorktown Heights, New York, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100498306",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bott, R. A study of complex learning: theory and methodology CHIP Report 82, University of California at San Diego, La Jolla, California, 1979.",
      "doi": ""
    },
    {
      "text": "Card, S., Moran, T. and Newell, A. Computer text-editing: An information-processing analysis of a routine cognitive skill. Cognitive Psychology, 1980, 12, 32-74.",
      "doi": ""
    },
    {
      "text": "Mayer, R. The psychology of how novices learn computer programming. ACM Computing Surveys. 1981,13, 121-141.  ",
      "doi": "10.1145/356835.356841"
    }
  ]
}