{
  "doi": "10.1145/800049.801744",
  "title": "Learning and remembering interactive commands",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "2-7",
  "year": 1982,
  "badges": [],
  "abstract": "There is a rich and expanding folklore concerning the consequences of inappropriate naming of computer commands. The problems are particularly acute for occasional users of interactive systems who may be unfamiliar with the jargon of computing. While “naming” has long been of interest to philosophers, linguists and psychologists [2], there is little systematic research on the psychological processes involved in the understanding and acquisition of the vocabularies of interactive computer systems. Since the names for interactive commands tend to be drawn from the wider vocabulary of natural language, occasional users are faced with the task of understanding, learning and remembering new meanings for the words.",
  "authors": [
    {
      "name": "Phil J. Barnard",
      "institution": "MRC Applied Psychology Unit, Cambridge, England",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100469779",
      "orcid": "missing"
    },
    {
      "name": "Nick V. Hammond",
      "institution": "MRC Applied Psychology Unit, Cambridge, England",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100001026",
      "orcid": "missing"
    },
    {
      "name": "Allan MacLean",
      "institution": "MRC Applied Psychology Unit, Cambridge, England",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100609167",
      "orcid": "missing"
    },
    {
      "name": "John Morton",
      "institution": "MRC Applied Psychology Unit, Cambridge, England",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332516822",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Broadbent, D.E., Cooper, P.F., Fitzgerald, P. and Parks, K.R. The Cognitive Failures Questionnaire (CFQ) and its Correlates. British Journal of Clinical Psychology, 1982, 21 (In Press)",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. Names and naming. An interdisciplinary review. IBM Research Report RC 7370, 1978.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. Learning, using and designing command paradigms. IBM Research Report RC 8141, 1980.",
      "doi": ""
    },
    {
      "text": "Gumenik, W.E. The advantage of specific terms over general terms as cues for sentence recall: Instantiation or retrieval? Memory and Cognition, 1979, 7, 240-244.",
      "doi": ""
    },
    {
      "text": "Hammond, N., Barnard, P., Clark, I., Morton, J. and Long, J. Structure and Content in Interactive Dialogue. Paper presented at APA Montreal, September 1980; and IBM Hursley Human Factors Report HF034, October, 1980.",
      "doi": ""
    },
    {
      "text": "Landauer, T.K., Galotti, K.M. and Hartwell, S. A computer command by any other name: A study of text editing terms. Paper presented at APA Montreal, September 1980.",
      "doi": ""
    },
    {
      "text": "Thios, S.J. Memory for general and specific sentences. Memory and Cognition, 1975, 3, 75-77.",
      "doi": ""
    }
  ]
}