{
  "doi": "10.1145/800049.801816",
  "title": "Analogy considered harmful",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "383-386",
  "year": 1982,
  "badges": [],
  "abstract": "The computer is like a typewriter. The computer is like a filing cabinet. The computer is a personal servant ready to obey your every command.  It is often claimed (e.g., Carroll and Thomas [3], Rumelhart and Norman [7]) that the best way to introduce a new user to a computer system is to draw an analogy between the computer and some situation familiar to the user. Given the analogy, the new user can draw upon his knowledge about the familiar situation in order to reason about the workings of the mysterious new computer system. For example, if the new user wants to understand about how the computer file system works, he need only think about how an office filing cabinet works and then carry over this same way of thinking to the computer file system.",
  "tags": [],
  "authors": [
    {
      "name": "Frank Halasz",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100332524",
      "orcid": "missing"
    },
    {
      "name": "Thomas P. Moran",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81407594532",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "du Boulay, B., O'Shea, T., and Monk, J. The black box inside the glass box: presenting computing concepts to novices. International Journal of Man-Machine Studies, 1981, 14, 237-250.",
      "doi": ""
    },
    {
      "text": "Carbonell, J. G. Metaphor: an inescapable phenomenon in natural language comprehension. Technical Report, Carnegie-Mellon University, Department of Computer Science, May 1981.",
      "doi": ""
    },
    {
      "text": "Carroll, J. M., and Thomas, J. C. Metaphor and the cognitive representation of computing systems. Report RC 8302, IBM Watson Research Center, May 1980.",
      "doi": ""
    },
    {
      "text": "Gentner, D. The structure of analogical models in science. Report 4451, Bolt Beranek and Newman, July 1980.",
      "doi": ""
    },
    {
      "text": "Lakoff, G., and Johnson, M. Metaphors we live by. Chicago: University of Chicago Press, 1980.",
      "doi": ""
    },
    {
      "text": "Moran, T. P. The Command Language Grammar: a representation for the user interface of interactive computer systems. International Journal of Man-Machine Studies, 1981, 15, 3-50.",
      "doi": ""
    },
    {
      "text": "Rumelhart, D. E., and Norman, D. A. Analogical processes in learning. In J. R. Anderson (ed.), Cognitive Skills and Their Acquisition, Hillsdale, N.J.: Erlbaum, 1981, 335-360.",
      "doi": ""
    },
    {
      "text": "Young, R. M. The machine inside the machine: users' models of pocket calculators. International Journal of Man-Machine Studies, 1981, 15, 51-85.",
      "doi": ""
    }
  ]
}