{
  "doi": "10.1145/800049.801754",
  "title": "Tapping into tacit programming knowledge",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "52-57",
  "year": 1982,
  "badges": [],
  "abstract": "The Cognition and Programming Group at Yale University is engaged in two complementary efforts: 1. exploring the programming process empirically, paying special attention to the knowledge and strategies which expert and non-experts employ, and 2. building computer-based environments which aid novices learning to program. In this extended abstract we will focus on the empirical strand of our research program; in particular, we will describe an experimental technique we have just begun to use to more carefully study what it is that expert and novice programmers do—and don't—know. In [19, 20, 22, 18, 7] we describe additional empirical studies, while [21] describes MENO-II, our intelligent programming tutor for Pascal.",
  "tags": [],
  "authors": [
    {
      "name": "Elliot Soloway",
      "institution": "Yale University, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332528788",
      "orcid": "missing"
    },
    {
      "name": "Kate Ehrlich",
      "institution": "Yale University, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81331492075",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey Bonar",
      "institution": "University of Massachusetts, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100062334",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adelson, B. Problem Solving and the Development of Abstract Categories in Programming Languages. Memory and Cognition 9 (1981), 422-433.",
      "doi": ""
    },
    {
      "text": "Atwood, M.E., Ramsey, H.R. Cognitive Structure in the Comprehension and Memory of Computer Programs: An Investigation of Computer Program Debugging. ARI TR-78-A210, Science Applications, Englewood, Calif., 1978.",
      "doi": ""
    },
    {
      "text": "Bower, G.H., Black, J.B., Turner, T. Scripts in Memory for Text. Cognitive Psychology 11 (19793), 177-220.",
      "doi": ""
    },
    {
      "text": "Brown, J.S. and Burton, R.R. Diagnostic Models for Procedural Bugs in Mathematics. Cognitive Science 2 (June 1978), 155-192.",
      "doi": ""
    },
    {
      "text": "Brown, J.S. and VanLehn, K. Repair Theory: A Generative Theory of Bugs in Procedural Skills. Cognitive Science 4, 4 (October 1980), 379-426.",
      "doi": ""
    },
    {
      "text": "Chase, W.C. and Simon, H. Perception in Chess. Cognitive Psychology 4 (1973), 55-81.",
      "doi": ""
    },
    {
      "text": "Clement, J., Lochhead, J., and Soloway, E., Positive Effects of Computer Programming On Students Understanding of Variables and Equations. Proceedings of the National ACM Conference, Proceedings of the National ACM Conference, Nashville, Tenn., 1980.  ",
      "doi": "10.1145/800176.810002"
    },
    {
      "text": "Collins, A. Explicating the Tacit Knowledge in Teaching and Learning. 3889, Bolt Beranek and Newman, Cambridge, Mass., 1978.",
      "doi": ""
    },
    {
      "text": "deGroot, A.D. Thought and Choice in Chess. Mouton and Company, Paris, 1965.",
      "doi": ""
    },
    {
      "text": "Ericsson, A. and Simon, H. Verbal reports as data. Psychological Review 87 (1980), 215-251.",
      "doi": ""
    },
    {
      "text": "Newell, A. and Simon, H. Human Problem Solving. Prentice-Hall, Englewood Cliffs, NJ, 1972. ",
      "doi": "10.5555/1095704"
    },
    {
      "text": "Rich, C. A Library of Plans with Applications to Automated Analysis. 294, MIT AI Lab, 1980.",
      "doi": ""
    },
    {
      "text": "Rich, C. A Formal Representation for Plans in the Programmer's Apprentice. Proceedings of IJCAI-81, International Joint Conference on Artificial Intelligence, Vancouver, B.C., 1981.",
      "doi": ""
    },
    {
      "text": "Schank, R.C. and Abelson, R. Scripts, Plans, Goals and Understanding. Lawrence Erlbaum Associates, Hillsdale New Jersey, 1977.",
      "doi": ""
    },
    {
      "text": "Sebrechts, M.M. and Black, J.B. Software Psychology: A Rich New Domain for Applied Psychology. Applied Psycholinguistics, in press",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Exploratory Experiments in Programmer Behavior. International Journal of Computer and Information Sciences 5,2 (1976), 123-143.",
      "doi": ""
    },
    {
      "text": "Soloway, E. and Woolf, B. Problems, Plans, and Programs. Proceedings of Eleventh ACM Technical Symposium on Computer Science Education, Proceedings of Eleventh ACM Technical Symposium on Computer Science Education, 1979.  ",
      "doi": "10.1145/800140.804605"
    },
    {
      "text": "Soloway, E., Lochhead, J., Clement, J. Does Computer Programming Enhance Problem Solving Ability? Some Positive Evidence on Algebra Word Problems. Proceedings of the Conference on National Goals for Computer Literacy in 1985, NSF/HumRRO, Ed. R. Seidel, in press",
      "doi": ""
    },
    {
      "text": "Soloway, E., Bonar, J. and Ehrlich, K. Cognitive Factors in Programming: An Empirical Study of Looping Constructs. 81-10, Department of Computer Science, University of Massachusetts, 1981.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Bonar, J., Woolf, B., Barth, P., Rubin, E., and Ehrlich, K. Cognition and programming: Why Your Students Write Those Crazy Programs. Proceedings of the National Educational Computing Conference, NECC, No. Denton, Tx., 1981.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Woolf, B., Barth, P., and Rubin, E. MENO-II: Catching Run-Time Errors in Novice's Pascal Programs. Proceedings of IJCAI-81, International Joint Conference on Artificial Intelligence, Vancouver, B.C., 1981.",
      "doi": ""
    },
    {
      "text": "Soloway, E., Ehrlich, K., Bonar, J., Greenspan, J. What Do Novices Know About Programming?. In Directions in Human-Computer Interactions, B. Shneiderman and A. Badre, Eds., Ablex, Inc. in press.",
      "doi": ""
    },
    {
      "text": "Waters, R.C. A Method for Analyzing Loop Programs. IEEE Trans. on Software Engineering SE-5 (May 1979), 237-247.",
      "doi": "10.1109/TSE.1979.234185"
    },
    {
      "text": "Young, R., O'Shea, T. Errors in Children's Subtraction. Cognitive Science, in press",
      "doi": ""
    }
  ]
}