{
  "doi": "10.1145/800049.801812",
  "title": "The intelligent voice-interactive interface",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "363-366",
  "year": 1982,
  "badges": [],
  "abstract": "“Put That There” is a voice and gesture interactive system implemented at the Architecture Machine Group at MIT. It allows a user to build and modify a graphical database on a large format video display. The goal of the research is a simple, conversational interface to sophisticated computer interaction. Natural language and gestures are used, while speech output allows the system to query the user on ambiguous input. This project starts from the assumption that speech recognition hardware will never be 100% accurate, and explores other techniques to increase the usefulness (i.e., the “effective accuracy”) of such a system. These include: redundant input channels, syntactic and semantic analysis, and context-sensitive interpretation. In addition, we argue that recognition errors will be more tolerable if they are evident sooner through feedback and easily corrected by voice.",
  "tags": [],
  "authors": [
    {
      "name": "Christopher Schmandt",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100444749",
      "orcid": "missing"
    },
    {
      "name": "Eric A. Hulteen",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100014122",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bolt, R.A., Put-That-There: Voice and Gesture at the Graphics Interface. Computer Graphics, Proceedings of ACM SIGGRAPH '80, Vol. 14. No. 3, 1980, 262, 270.  ",
      "doi": "10.1145/800250.807503"
    },
    {
      "text": "Kato, Yasuo, Words into action: A commercial system. IEEE Spectrum, June 1980, p 29.",
      "doi": ""
    },
    {
      "text": "Rabb, F.H., Blood, E.B., Steiner, T.O., &amp; Jones, H.R. Magnetic position and orientation tracking system. IEEE Transactions on Aerospace and Electronic Systems. AES-15, No. 5, September 1979, 709-718.",
      "doi": ""
    }
  ]
}