{
  "doi": "10.1145/800049.801777",
  "title": "Communication - Nets for the specification of operator dialogs",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "174-179",
  "year": 1982,
  "badges": [],
  "abstract": "The model of a man - machine - system is the basis of the proposed notation. It consists of the components man and machine. With these (statical) components a (dynamic) process, called man - machine - communication or man - machine - dialog, is realized. The (three) possible dynamic interfaces are described. According to /CAR;69/ an evaluation, decision and control module for the exchange of information belongs to an active bidirectional communication. An operator dialog is such a communication.",
  "authors": [
    {
      "name": "W. K. Epple",
      "institution": "Universitaet Karlsruhe, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659411879",
      "orcid": "missing"
    },
    {
      "name": "Ulrich Rembold",
      "institution": "Universitaet Karlsruhe, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100383722",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "MACK A. ALFORD: A requirements engineering methodology for real-time processing requirements, IEEE Transactions on software engineering, VOL. SE-3, No.1, Jan 77  ",
      "doi": "10.1109/TSE.1977.233838"
    },
    {
      "text": "ROY H.CAMPBELL: Path expressions. A technique for specifying process synchronization. (Thesis), Department of Computer Science; University of Illinois at Urbana -Champaign, Urbana, Illinois, May 77",
      "doi": ""
    },
    {
      "text": "JAIME R. CARBONELL: On Man-Computer Interaction: A model and some Related Issues in IEEE TRANSACTIONS ON SYSTEMS SCIENCE AND CYBERNETICS, Vol. SSC-5, No. 1, JAN 1969",
      "doi": ""
    },
    {
      "text": "G. DENERT: Specification and Design of Dialogue Systems with State Diagrams, in: Proceedings of the International Computing Symposium 1977, Liege, North-Holland Publishing Company.",
      "doi": ""
    },
    {
      "text": "E. DITTMER, H.J. KIERSCH, U. SCHMUDLACH: Systementwicklung Prozesswarte - Schwerpunkt EVU-Warte. KfK - PDV - Bericht 106, Kernforschungszentrum Karlsruhe, 1977.",
      "doi": ""
    },
    {
      "text": "H. KEUTGEN, F.J. STOEVER Rechnergesteuerte Abfuellueberwachung in \"Qualitaet und Zuverlaessigkeit\", 23. Jahrgang 1978, Heft 6.",
      "doi": ""
    }
  ]
}