{
  "doi": "10.1145/800049.801751",
  "title": "The design, simulation, and evaluation of a menu driven user interface",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "36-40",
  "year": 1982,
  "badges": [],
  "abstract": "As the number of system users increases, the degree of formal training of the typical user declines. Techniques such as menu selection, which can best accommodate the novice user, almost necessarily must be included in a strategy for person-computer communication. Yet care must be taken that the experienced or sophisticated user is not encumbered with an interface that involves frustratingly slow entry of commands or procedures. This paper details the process and techniques required to develop and test an interface that would satisfy the needs of a broad spectrum of users. Two design and evaluation iterations are described.",
  "authors": [
    {
      "name": "Ricky E. Savage",
      "institution": "IBM Systems, Rochester, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100570324",
      "orcid": "missing"
    },
    {
      "name": "James K. Habinek",
      "institution": "IBM Systems, Rochester, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100179472",
      "orcid": "missing"
    },
    {
      "name": "Thomas W. Barnhart",
      "institution": "IBM Systems, Rochester, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100422715",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brosey, M. K. and Shneiderman, B. Two experimental comparisons of relational and hierarchical data base models. International Journal of Man-Machine Studies, 1978, 10, 625-637.",
      "doi": ""
    },
    {
      "text": "Dray, S. M., Ogden, W. G., and Vestewig, R. E. Measuring performance with a menu-selection human-computer interface. Proceedings of the 25th Annual Meeting of the Human Factors Society, 1981.",
      "doi": ""
    },
    {
      "text": "Durding, B. M., Becker, C. A., and Gould, J.D. Data organization. Human Factors, 1977, 19, 1, 1-14.",
      "doi": ""
    },
    {
      "text": "Engel, S. E. and Granda, R. E. Guidelines for man/display interfaces. IBM Poughkeepsie Laboratory Technical Report TR00.2720, December 19, 1975.",
      "doi": ""
    },
    {
      "text": "Martin, J. Design of Man-Computer Dialogues. Englewood Cliffs, NJ: Prentice Hall, 1973. ",
      "doi": "10.5555/574884"
    },
    {
      "text": "Peterson, D. E. Screen design guidelines. Small Systems World, February 1979, 19-21, 34-37.",
      "doi": ""
    },
    {
      "text": "Ramsey, H. R. and Atwood, M. E. Human factors in computer systems: a review of the literature. Englewood, CO: Science Application, Inc., Technical Report SAI-79-111-DEN, September, 1979.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Software Psychology. Cambridge, MA: Winthrop Publishers, Inc., 1980.",
      "doi": ""
    }
  ]
}