{
  "doi": "10.1145/800049.801818",
  "title": "A production-system model of human-computer interaction",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "393-399",
  "year": 1982,
  "badges": [],
  "abstract": "This paper presents what we believe to be a novel application of production systems to the modeling of complex human-computer interaction. Within the limits of this paper we will briefly describe a production system and discuss its use to model human-computer interaction. We will also mention some existing research supporting its plausibility as a modeling technique. We describe a relatively complex task requiring human-computer interaction that provided experimental data to test the applicability of production systems to this problem area. The completion of this task by individuals was modeled using a set of psychologically plausible productions. The results of this process indicated that a production system may be a powerful empirical and theoretical technique for studying the human factors associated with computer systems.",
  "authors": [
    {
      "name": "John Durrett",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100035544",
      "orcid": "missing"
    },
    {
      "name": "Theron Stimmel",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100267024",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Ledgard, H. J. Production systems: Or can we do better than BNF? Communications of the ACM. 1974, 17(2), 94-102.  ",
      "doi": "10.1145/360827.360848"
    },
    {
      "text": "Newell, A. Production systems: Models of control processes. In Visual Information Processing, William Chase (Ed.), New York: Academic Press, 1973, 463-526.",
      "doi": ""
    },
    {
      "text": "Schneiderman, B. Perceptual and cognitive issues in the syntactic/semantic behavior. In Symposium Proceedings Human Factors and Computer Science, W. Camm, R. E. Granda (Eds.), Washington, D.C.: 1978.",
      "doi": ""
    },
    {
      "text": "Sternberg, S. Memory scanning: New findings and current controversies. Quarterly Journal of Experimental Psychology, 1975, 27, 1-32.",
      "doi": ""
    }
  ]
}