{
  "doi": "10.1145/800049.801772",
  "title": "An analysis of line numbering strategies in text editors",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "148-151",
  "year": 1982,
  "badges": [],
  "abstract": "Many techniques are employed in numbering lines for text editing. The simplest approach uses a single integer that changes each time a line is added or deleted (1). BASIC, in addition to other systems, uses fixed multi-digit numbers bound to each line. This approach has problems: only a fixed number of lines can be inserted between two consecutive lines of text, otherwise the original text must be renumbered. This negates one advantage of line numbers: the ability to compare different versions of the same document. In order to overcome these disadvantages, two basic schemes have been proposed and implemented. The following grammar defines the two schemes: fractional line numbering (FLN) and hierarchical line numbering (HLN).",
  "authors": [
    {
      "name": "M. L. Schneider",
      "institution": "Sperry Univac, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100156636",
      "orcid": "missing"
    },
    {
      "name": "S. Nudelman",
      "institution": "Sperry Univac, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332519070",
      "orcid": "missing"
    },
    {
      "name": "Kathryn Hirsh-Pasek",
      "institution": "Sperry Univac, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100635107",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "SPERRY UNIVAC 1100 Series Executive System, Volume 3, System Processors, Test Editor Processor.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. \"The Keystroke-Level Model for User Performance Time with Interactive Systems\", (1979) Xerox Report SSL-79-1",
      "doi": ""
    },
    {
      "text": "Devoe, D. B., \"Alternatives to Hand-printing in the Manual Entry of Data\", IEEE Transactions HFE-8 (1967) 21-32",
      "doi": ""
    }
  ]
}