{
  "doi": "10.1145/800049.801802",
  "title": "Using formal specifications in the design of a human-computer interface",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "315-321",
  "year": 1982,
  "badges": [],
  "abstract": "This paper surveys specification techniques that can be applied to human-computer interfaces, provides examples of specifications, and presents some conclusions drawn from the author's experience using the techniques for specifying the user interface of the message system.",
  "tags": [],
  "authors": [
    {
      "name": "Robert J. K. Jacob",
      "institution": "Naval Research Laboratory, Washington, D.C., USA",
      "img": "/do/10.1145/contrib-81100438120/rel-imgonly/portrait.jpg",
      "acmid": "81100438120",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Conway, M.E. Design of a Separable Transition-Diagram Compiler. Comm. ACM, 1963, 6, 396-408.  ",
      "doi": "10.1145/366663.366704"
    },
    {
      "text": "Embley, D.W. Empirical and Formal Language Design Applied to a Unified Control Construct for Interactive Computing. Int. J. Man-Machine Studies, 1978, 6, 197-216.",
      "doi": ""
    },
    {
      "text": "Foley, J.D. and Wallace, V.L. The Art of Graphic Man-Machine Conversation. Proc. IEEE, 1974, 62, 462-471.",
      "doi": ""
    },
    {
      "text": "Hanau, P.R. and Lenorovitz, D.R. Prototyping and Simulation Tools for User/Computer Dialogue Design. Proc. ACM SIGGRAPH, 1980, 62, 462-471.  ",
      "doi": "10.1145/800250.807504"
    },
    {
      "text": "Heitmeyer, C.L. and Wilson, S.H. Military Message Systems: Current Status and Future Directions. IEEE Transactions on Communications, 1980, COM-28, 1645-1654.",
      "doi": ""
    },
    {
      "text": "Heitmeyer, C.L. An Intermediate Command Language (ICL) for the Family of Military Message Systems. Technical Memorandum 7590-450:CH:ch, Naval Research Laboratory, 13 November 1981.",
      "doi": ""
    },
    {
      "text": "Jacob, R.J.K. Survey of Specification Techniques for User Interfaces. Technical Memorandum 7590-303:RJ:rj, Naval Research Laboratory, 21 August 1981.",
      "doi": ""
    },
    {
      "text": "Jacob, R.J.K. Examples of Specifications of User Interfaces. Technical Memorandum 7590-008:RJ:rj, Naval Research Laboratory, 6 January 1982.",
      "doi": ""
    },
    {
      "text": "Johnson, S.C. Language Development Tools on the Unix System. Computer, 1980, 13, 16-21.",
      "doi": ""
    },
    {
      "text": "MUMPS Development Committee. MUMPS Language Standard. New York: American National Standards Institute, 1977.",
      "doi": ""
    },
    {
      "text": "Moran, T.P. The Command Language Grammar: A Representation for the User Interface of Interactive Computer Systems. Int. J. Man-Machine Studies, 1981, 15, 3-50.",
      "doi": ""
    },
    {
      "text": "Parnas, D.L. On the Use of Transition Diagrams in the Design of a User Interface for an Interactive Computer System. Proc. 24th National ACM Conference, 1969, 15, 379-385.  ",
      "doi": "10.1145/800195.805945"
    },
    {
      "text": "Reisner, P. Formal Grammar and Human Factors Design of an Interactive Graphics System. IEEE Transactions on Software Engineering, 1981, SE-7, 229-240.",
      "doi": "10.1109/TSE.1981.234520"
    },
    {
      "text": "Schneiderman, B. Multi-Party Grammars and Related Features for Defining Interactive Systems. IEEE Transactions on Systems, Man, and Cybernetics, 1981, SE-7, 229-240.",
      "doi": ""
    },
    {
      "text": "Singer, A. Formal Methods and Human Factors in the Design of Interactive Languages. Ph.D. dissertation, Computer and Information Science, Univ. Massachusetts, September 1979. ",
      "doi": "10.5555/909113"
    },
    {
      "text": "Wilson, S.H., Kallander, J.W., III, N.M. Thomas, Klitzkie, L.C., and Bunch, J.R. Jr. MME Quick Look Report. Memorandum Report 3992, Naval Research Laboratory, 1979.",
      "doi": ""
    },
    {
      "text": "Woods, W.A. Transition Network Grammars for Natural Language Analysis. Comm. ACM, 1970, 13, 591-606.  ",
      "doi": "10.1145/355598.362773"
    }
  ]
}