{
  "doi": "10.1145/800049.801779",
  "title": "User perceptual mechanisms in the search of computer command menus",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "190-196",
  "year": 1982,
  "badges": [],
  "abstract": "Menu-based command systems, in which a user selects a command from a set of choices displayed to him, have acquired widespread use as a human-computer interface technique. The technique is especially attractive for use with new or untrained users since the user need not recall the command he wishes, but merely recognize it. But menu systems also find application in more sophisticated systems meant for expert users (for example, Teitelman, 1977) where they can be used to reduce the complexity of the options with which the user is presented.",
  "tags": [],
  "authors": [
    {
      "name": "Stuart K. Card",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81406592524/rel-imgonly/card_5x7.jpg",
      "acmid": "81406592524",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anderson, J. R., Cognitive Psychology and its Implications. San Francisco: W.R. Freeman, 1980.",
      "doi": ""
    },
    {
      "text": "Chase W. G. and Simon, H. A. (1973a). Perception in Chess. Cognitive Psychology, 1973, 4, 55-81.",
      "doi": ""
    },
    {
      "text": "Chase, W. G. and Simon, H. A. The mind's eye in chess. In W. G. Chase (ed.) Visual Information Processing, 1973, 215-281, New York: Academic Press.",
      "doi": ""
    },
    {
      "text": "Egan, D. E. and Schwartz, B.J. Chunking in recall of symbolic drawings. Memory and Cognition, 1976, 7, 149-158.",
      "doi": ""
    },
    {
      "text": "Kendall, E. S. and Wodinsky, J. Journal of the Optical Society of America, 1960, 50, 562-568.",
      "doi": ""
    },
    {
      "text": "McKeithen, Katherine B.; Reitman, Judith S.; Reuter, H. H.; and Hirtle, S. C. (1981). Cognitive Psychology 13: 307-325.",
      "doi": ""
    },
    {
      "text": "Reitman, Judith S. Skilled perception in Go: Deducing memory structures from inter-response times. Cognitive Psychology, 1976, 8, 336-356.",
      "doi": ""
    },
    {
      "text": "Teitelman, W. A Display Oriented Programmer's Assistant. Xerox Palo Alto Research Center, Technical Report CSL 77-3, March 8, 1977.",
      "doi": ""
    }
  ]
}