{
  "doi": "10.1145/800049.801798",
  "title": "Applying cognitive psychology to computer systems: A graduate seminar in psychology",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "295-298",
  "year": 1982,
  "badges": [],
  "abstract": "This paper describes a graduate seminar given by the authors at Stanford University in the Department of Psychology in the Spring of 1980. Although the seminar was also listed as a Computer Science course and was attended by students and faculty from Computer Science and other departments, the course was addressed to Ph.D. students in cognitive psychology. The seminar assumed that the students were familiar with modern cognitive psychology, but did not assume that they necessarily had much experience with interactive computing.",
  "authors": [
    {
      "name": "Thomas P. Moran",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81407594532",
      "orcid": "missing"
    },
    {
      "name": "Stuart K. Card",
      "institution": "Xerox Palo Alto Research Center, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81406592524/rel-imgonly/card_5x7.jpg",
      "acmid": "81406592524",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S. K.; Moran, T. P.; and Newell, A., (1982). The Psychology of Human-Computer Interaction. Hillsdale, N.J.: Erlbaum. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Card, S. K.; Moran, T. P.; and Newell, A., (1980). Computer text-editing: an information-processing analysis of a routine cognitive skill. Cognitive Psychology 12, 396-410.",
      "doi": ""
    },
    {
      "text": "Card, S. K.; Moran, T. P.; and Newell, A., (1980). The Keystroke-Level Model for user performance time with interactive systems. Communications of the ACM 23, 396-410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Card, S.; English, W. K.; Burr, B. J., (1978). Evaluation of mouse, rate-controlled isometric joystick, step keys, and text keys for text selection on a CRT. Ergonomics 21, 601-613.",
      "doi": ""
    },
    {
      "text": "Fitts, P. M., and Jones, R. E., (1947). Analysis of factors contributing to 460 \"pilot-error\" experiences in operating aircraft controls. Reprinted in Selected papers on human factors in the design and use of control systems, H. W. Sinaiko, editor. New York: Dover, 1961.",
      "doi": ""
    },
    {
      "text": "Moran, T. P., editor, (1981). The Psychology of the Computer User. Special Issue of Computing Surveys, vol. 13, no. 1, (available from ACM).  ",
      "doi": "10.1145/356835.356836"
    },
    {
      "text": "Moran, T. P., (1981). The Command Language Grammar: a representation for the user interface of interactive computer systems. International Journal of Man-Machine Studies 15, 3-50.",
      "doi": ""
    },
    {
      "text": "Norman, D. A., (1981). Categorization of action slips. Psychological Review 88, 1-15.",
      "doi": ""
    },
    {
      "text": "Roberts, T. R., (1979). Evaluation of computer text editors. Ph.D. dissertation, Stanford University. Also, Report SSL-79-9, Xerox PARC. ",
      "doi": "10.5555/909448"
    },
    {
      "text": "Rumelhart, D. E., and Norman, D. A., (1981). Simulating a skilled typist: a study of skilled cognitive-motor performance. CHIP Report 102, Department of Psychology, University of California, San Diego.",
      "doi": ""
    }
  ]
}