{
  "doi": "10.1145/800049.801762",
  "title": "Controversies in the design of computer-mediated communication systems: A Delphi study",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "89-100",
  "year": 1982,
  "badges": [],
  "abstract": "Computer-mediated communication systems represent a fairly new development in interactive computer systems. This paper will summarize the procedures followed in the Delphi survey, and the results and will then turn to a more detailed treatment of the disagreements that were discovered, presenting the arguments which underlie the disagreements. We will conclude with a brief discussion of the extent to which Delphi approaches may be generally useful design tools for summarizing the “state of the art” and pinpointing research priorities for new types of systems. The purpose of the synthesis of design choices presented in this paper is to familiarize the reader with the range of capabilities and characteristics that currently exist, and to summarize the “collective wisdom” of designers so as to establish design guidelines and options for future systems.",
  "authors": [
    {
      "name": "Murray Turoff",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100066527",
      "orcid": "missing"
    },
    {
      "name": "Starr Roxanne Hiltz",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452617202",
      "orcid": "missing"
    },
    {
      "name": "Elaine B. Kerr",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100007589",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adriansson, L. Group Communication through Computer: Social Psychological Studies of Attitudes to and Experience with the Effects of COM System on the Work Environment, Department of Psychology, University of Gothenburg, Sweden. 1980.",
      "doi": ""
    },
    {
      "text": "Adler, R.P., and Lipinski, H.J. \"HUB: A Computer-Based Communication System\". In Studies of Computer-Mediated Communications Systems: A Synthesis of the Findings. (S.R. Hiltz and E. B. Kerr), Final Report to the National Science Foundation. 1981.",
      "doi": ""
    },
    {
      "text": "Hiltz, S. R. On Line Scientific Communities: A Case Study of the Office of the Future. ABLEX: in press. 1982. ",
      "doi": "10.5555/577726"
    },
    {
      "text": "Hiltz, S.R., Johnson, K., and Turoff, M. The Quality of Group Decision Making in Face-to-Face Vs. Computerized Conferences. Presented at the annual meeting of the American Sociological Association, Toronto, Canada. 1981.",
      "doi": ""
    },
    {
      "text": "Hiltz, R. and Kerr, E.B. Studies of Computer-Mediated Communications Systems: A Synthesis of the Findings. Final Report on a Workshop Sponsored by the Division of Information Science and Technology, National Science Foundation. NTIS PB82 01107061.",
      "doi": ""
    },
    {
      "text": "Hiltz, S. R. and Turoff, M. The Network Nation-Human Communication Via Computer, Addison-Wesley, Reading, Massachusetts. 1978. ",
      "doi": "10.5555/151072"
    },
    {
      "text": "Hiltz, S. R. and Turoff, M. Office Augmentation Systems: The Case for Evolutionary Design. Paper to be presented at the Fifteenth Annual International Conference on System Sciences, Honolulu, Hawaii. 1982.",
      "doi": ""
    },
    {
      "text": "Housman, E.M. \"Online Communication by Computer Conferencing and Electronic Mail\". Presented at the 4Th Online Meeting, London, England.",
      "doi": ""
    },
    {
      "text": "Johansen, R., DeGrasse, R. Jr., and Wilson, T. Group Communications through Computer, Vol. 5, Effects on Working Patterns, Report R-41, Institute for the Future, Menlo Park, California. 1978.",
      "doi": ""
    },
    {
      "text": "Johansen, R., Vallee, J., and Spangler, K. Electronic Meetings: Technological Alternatives and Social Choices, Addison-Wesley, Reading, Massachusetts. 1979. ",
      "doi": "10.5555/578546"
    },
    {
      "text": "Kerr, E.B. and Hiltz, S.R. Computer-Mediated Communication Systems: Status and Evaluation, Academic Press, forthcoming. 1982 ",
      "doi": "10.5555/578051"
    },
    {
      "text": "Landweber, L. \"Theory Net: An Electronic Mail System.\" In Proceedings of the 1979 Annual Conference, ACM. (A. Martin and J. Elshoff, eds.) pp. 29-31, Detroit, Michigan. 1979.  ",
      "doi": "10.1145/800177.810053"
    },
    {
      "text": "Linstone, H.A. and Turoff, M. The Delphi Method: Techniques and Applications, Addison-Wesley, Reading, Massachusetts. 1975.",
      "doi": ""
    },
    {
      "text": "Lipinski, H., Spang, S., and Tydeman, J. \"Supporting Task-Focused Communication.\" In Communicating Information: Proceedings of the 43rd ASIS Annual Meeting (A.R. Benenfeld and E.J. Kazlauskas, eds.), pp. 158-160. Knowledge Industry Publications, White Plains, New York. 1980.",
      "doi": ""
    },
    {
      "text": "Lynch, C.A. \"Practical Electronic Mail through a Centralized Computing Facility.\" In Communicating Information: Proceedings of the 43rd ASIS Annual Meeting (A.R. Benenfeld and E.J. Kazlauskas, eds.), pp.34-37. Knowledge Industry Publications, White Plains, New York. 1980.",
      "doi": ""
    },
    {
      "text": "Neisner, U. MAC and its Users, Project MAC, Memorandum MAC-M-185. 1964.",
      "doi": ""
    },
    {
      "text": "Palme, J., Arnborg, S., Enderin, L., Meyer, C., and Tholerus, T. The COM Teleconferencing System Functional Specification, Swedish National Defense Research Institute, FOA Report C 10164-M6 (H9), Stockholm, Sweden. 1980.",
      "doi": ""
    },
    {
      "text": "Parnes, R., Hench, C., and Zinn, K. \"0rganizing a Computer Based Conference.\" Transnational Association, Vol. 10, pp. 418-422. 1977.",
      "doi": ""
    },
    {
      "text": "Roberts, A. \"MACC's Computer Mail System&mdash;Its Features, Usage Statistics and Costs.\" In Teleconferencing and Interactive Media. (L.A. Parker and C.H. Olgren, eds.), pp. 272-281. Extension Center for Interactive Programs, University of Wisconsin, Madison, Wisconsin. 1980.",
      "doi": ""
    },
    {
      "text": "Seabrook, R.P.C. \"PANALOG: Shaking the Foundations\". Bulletin of the American Society for Information Science, Vol. 4, p.21 1978.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Software Psychology: Human Factors in Computer and Information Systems, Winthrop Computer Systems, Cambridge, Massachusetts. 1980. ",
      "doi": "10.5555/1097028"
    },
    {
      "text": "Tapscott, D. \"Investigating the office of the Future\" Telesis. 1980.",
      "doi": ""
    },
    {
      "text": "Turoff, M. \"The Delphi Conference\". Futurist, Vol. 5, pp. 55-57. 1971.",
      "doi": ""
    },
    {
      "text": "Turoff, M. \"Party Line and 'Discussion' Computerized Conferencing Systems\". In Computer Communication- Impacts and Implications (S. Winkler, ed.), pp.161-170. International Conference on Computer Communication, Washington, D.C. 1972.",
      "doi": ""
    },
    {
      "text": "Vallee, J. Johansen R., Lipinski, H., Spangler, K., and Wilson, T. Group Communication through Computers, Vol. 3, Pragmatics and Dynamics, Report R-35, Institute for the Future, Menlo Park, California. 1975.",
      "doi": ""
    },
    {
      "text": "Vallee, J. Johansen R., Lipinski, H., Spangler, K., and Wilson, T. Group Communication through Computers, Vol. 4, Social, Managerial and Economic Issues, Report R-40, Institute for the Future, Menlo Park, California. 1978.",
      "doi": ""
    },
    {
      "text": "Walker, D.E. Interactive Bibliographic Search: The User/Computer Interface, AFIPS Press, Montvale, New Jersey. 1971.",
      "doi": ""
    },
    {
      "text": "Zinn, K.L. \"Computer Aided Communications: New Directions for Higher Education.\" In proceedings of the 1979 Annual Conference ACM (A. Martin and J. Elshoff, eds.), Detroit, Michigan. 1979.  ",
      "doi": "10.1145/800177.810054"
    }
  ]
}