{
  "doi": "10.1145/800049.801814",
  "title": "Presenting information in sound",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "371-375",
  "year": 1982,
  "badges": [],
  "abstract": "In the past few years, the increase in interactive use of computers has led to an emphasis on human factors and the ways in which digital information can best be presented to users. Computer graphics has been at the forefront of this growth involving vision as an active aid in interpreting data. Bar charts, psuedo-color image processing, and 3-dimensional figures are but a few means of providing the viewer with data information. As the use of computers increases, the need for a variety of alternatives of interacting with computers also increases. Computer-generated sound is one capability not being fully utilized in the computer/human interface. Just as an x-y plot reveals relationships in data, sounds might also reveal relationships in data. This report focuses on the potential for using computer generated sounds to present data information. The first section addresses multivariate data problems which might be aided by sound output. The second describes experiments performed to determine whether listeners can discriminate among data sets based on sound. The final section discusses ongoing work and future directions.",
  "authors": [
    {
      "name": "Sara Bly",
      "institution": "Lawrence Livermore National Laboratory, Livermore, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100274421",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andrews, D.F. \"Plots of High-dimensional Data\", Biometrics, Vol. 28, p. 125, 1972.]]",
      "doi": ""
    },
    {
      "text": "Bly, S.A. \"Sound and Computer Information Presentation\", PhD Dissertation (work in progress), University of California, Davis.]] ",
      "doi": "10.5555/910376"
    },
    {
      "text": "Chernoff, H. \"The Use of Faces to Represent Points in k-Dimensional Space Graphically\", Journal of the American Statistical Association, Vol 361, p. 361, 1973.]]",
      "doi": ""
    },
    {
      "text": "Chowning, J.M. \"The Synthesis of Complex Audio Spectra by Means of Frequency Modulation\", Journal of the Audio Engineering Society, Vol. 21, No. 7, p. 526, 1973.]]",
      "doi": ""
    },
    {
      "text": "Everitt, B.S. Graphical Techniques for Multivariate Data, Heinemann Educational Books, London, 1978.]]",
      "doi": ""
    },
    {
      "text": "Geyer, K.E. and Wilson, K.R. \"Computing With Feeling\", Proc. of the Conference On Computer Graphics, Pattern Recognition, and Data Structure, IEEE Catalog No. 75CH0981-1C, p. 343, 1975.]]",
      "doi": ""
    },
    {
      "text": "Mathews, M.V. The Technology of Computer Music, The M.I.T. Press, Cambridge, Mass. 1969.]] ",
      "doi": "10.5555/1214123"
    },
    {
      "text": "Moorer, J.A. \"Signal Precessing Aspects of Computer Music&mdash;A Survey\", Computer Music Journal, Vol. 1, No. 1, p. 4, 1977.]]",
      "doi": ""
    },
    {
      "text": "Risset, J.C. \"Synthesis of Sounds by Computer and Problems Concerning Timbre\", Music and Technology, Proceeding of the Stockholm Meeting, 1970.]]",
      "doi": ""
    },
    {
      "text": "Rosenstein, M. \"Computer-Generated Pure Tones and Noise and Its Application to Psychoacoustics\", Journal of the Audio Engineering Society, Vol. 21, No. 2, p. 121, 1973.]]",
      "doi": ""
    },
    {
      "text": "Taylor, C.A. The Physics of Musical Sounds American Elsevier Publishing Company, Inc. New York, 1965.]]",
      "doi": ""
    },
    {
      "text": "Tenney, J.C. \"The Physical Correlates of Timbre\", Gravesaner Blatter, Vol. 7, No. 26, p. 106, 1965.]]",
      "doi": ""
    },
    {
      "text": "Yeung, E.S. \"Pattern Recognition by Audio Representation of Multivariate Analytical Data\", Analytical Chemistry Vol. 52, No. 7, p. 1120, 1980.]]",
      "doi": ""
    }
  ]
}