{
  "doi": "10.1145/800049.801785",
  "title": "The subjective nature of programming complexity",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "229-234",
  "year": 1982,
  "badges": [],
  "abstract": "One of the more difficult problems confronting software engineers today is the construction of accurate predictive models of the software development process, [2],[8] and [9]. It has long been recognized that one of the most essential elements of any successful model of this process is a quantification of the complexity of software systems. During the past several years a great deal of work has been performed by researchers such as Halstead [3], McCab [5], and others in an attempt to develop metrics which adequately capture the complexity of software systems. Yet one very important aspect of software development complexity seems to have been overlooked in the rush to develop software complexity metrics, q.e. it's psychological nature. A basic tenet of our research is that the effort to develop a software system is a function of it's 'perceived' complexity; which in turn is dependent upon both the physical nature of the software system being developed and the psychological nature of the individual(s) performing the development. The immediate goal of the research reported on in this paper was to examine this dual dependency. In order to do so we collected data from two sections (same instructor) of a college sophomore - level class on PL/I which consisted of fifty-six students. During this class each student was given six written programming assignments which were relatively simple in scope.",
  "authors": [
    {
      "name": "Daniel G. McNicholl",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100134470",
      "orcid": "missing"
    },
    {
      "name": "Ken Magel",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100592514",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baird,J.C. and Noma, E Fundamentals of Scaling and Psychophysics. John Wiley &amp; Sons, New York, 1978.",
      "doi": ""
    },
    {
      "text": "Faraquhar,J.A. \"A preliminary inquiry into the software estimation process.\" Tech Report AD 712 052, Defense Documentation Center, Alexandria, Va. 1970.",
      "doi": ""
    },
    {
      "text": "Halstead,M.H. Elements of Software Science. Elsevier Computer Science Library, Amsterdam, The Netherlands, 1977. ",
      "doi": "10.5555/540137"
    },
    {
      "text": "Jackson,M.A. Principles of Programming Design. John Wiley &amp; Sons, New York, 1978.",
      "doi": ""
    },
    {
      "text": "McCabe,T.J. \"A complexity measure,\" in IEEE Trans on Software Engineering, Vol SE-2, No.4, pp 308-320, Dec 1976.",
      "doi": "10.1109/TSE.1976.233837"
    },
    {
      "text": "McNicholl,D.G. and Magel,K. \"On the stochastic modeling of individual resource consumption during the programming phase of software development.\" Pending publication, 1982.",
      "doi": ""
    },
    {
      "text": "McNicholl,D.G. and Magel, K. \"On the prediction of resource consumption during the programming phase of software development.\" In preparation, 1982.",
      "doi": ""
    },
    {
      "text": "Tonies,C.C. \"Project management fundamentals in software engineering,\" in Software Engineering. Jensen and Tonies eds, Prentice Hall, englewood Cliffs, N.J. 1979.",
      "doi": ""
    },
    {
      "text": "Zelkowitz,M.V., Shaw,A.C. and Gannon,J.D. Principles of Software Engineering and Design. Prentice Hall, Englewood Cliffs, N.J. 1979. ",
      "doi": "10.5555/578504"
    }
  ]
}