{
  "doi": "10.1145/800049.801776",
  "title": "LAMP: Language for active message protocols",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "169-173",
  "year": 1982,
  "badges": [],
  "abstract": "Among the most prominent aspects of office automation is the concept of electronic mail. Despite the fact that numerous “Office of the Future&\" descriptions seem to focus upon electronic mail as a great opportunity, seldom is it treated as a phenomenon in its own right rather than product. More often it seems to be a technological byproduct, available to counter certain specific business ailments, most notably the inefficiency of transportation of packaged messages. Despite the obvious advantages of E-mail, it is not seen as either essential to office of the future as a concept or as theoretically interesting to researchers. Several commentators, however, have pointed out that messaging may be an alternative form of interpersonal communication (See Bair [l]), without especially treating messaging as a core concept in office automation. This paper proposes to open the debate, not into the technical or behavioral feasibility of E-mail or the other messaging manifestations, nor into the economic benefits of implementation, but rather into the foundations of pre-programmed, non-real-time verbal interaction (printed and oral) as a general phenomenon.",
  "authors": [
    {
      "name": "Paul S. Licker",
      "institution": "University of Calgary, Canada`",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81351595566",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bair, J.H. \"Communication in the Office of the Future: Where the Real Payoff May Be\", Proceedings, Fourth International Conference on Computer Communication (IFIPS), Kyoto, September, 1978, 733-740",
      "doi": ""
    },
    {
      "text": "Bolt, Richard A. \"Spatial Data Management: Interim Report\", Architecture Machine Group, MIT, November, 1977.",
      "doi": ""
    },
    {
      "text": "Edwards, G. \"Organizational Impacts of Office Automation\", Telecommunications Policy 1979, 2, 128-136",
      "doi": ""
    },
    {
      "text": "Henne, Peter \"KOMEX: An Experimental Computer Conference System,\" in Integrated Office Systems&mdash;Burotics, N. Naffah (ed.),# Proceedings of the IFIP TC-6 International Workshop on Integrated Office Systems, Versailles, France, November 6-9, 1979.",
      "doi": ""
    },
    {
      "text": "Hiltz, S.R. \"Communications and Group Decision-Making: Experimental Evidence on the Potential Impart of Computer Conferencing,\" Research Report 2, Computerized Conferencing and Communications Center, New Jersey Institute of Technology, September, 1975.",
      "doi": ""
    },
    {
      "text": "Hiltz, S.R. and Turoff, M. The Network Nation: Human Communication via Computer. Reading Mass.: Addison-Wesley, 1979. ",
      "doi": "10.5555/151072"
    },
    {
      "text": "Johansen, R. Vallee, J. and Spangler, K. Electronic Meetings: Technical Alternatives and Social Choices. Reading, Mass.: Addison-Wesley, 1979. ",
      "doi": "10.5555/578546"
    },
    {
      "text": "Kay, Alan and Adele Goldberg. \"Personal Dynamic Media\", Computer 1977, 10 (3), 31-41.",
      "doi": ""
    },
    {
      "text": "Keen, Peter G.W. and Richard D. Hackathorn. \"Decision Support Systems and Personal Computing\" Working Paper 79-01-03, Wharton School, University of Pennsylvania, 1979.",
      "doi": ""
    },
    {
      "text": "Leduc, N. \"Communicating through Computers: Impact on a Small Business Group\", Telecommunications Policy 1979, 2, 235-244.",
      "doi": ""
    },
    {
      "text": "Mintzberg, Henry. Impediments to the Use of Management Information. for the National Association of Accountants and the Society of Industrial Accountants of Canada, New York and Hamilton (Ont.), 1975.",
      "doi": ""
    },
    {
      "text": "Morgan, H.L. \"Research and Practice in Office Automation.\" Information Processing 1980, S.V. Lavington (Ed.), North-Holland, IFIP, 1980, pp. 783-789.",
      "doi": ""
    },
    {
      "text": "Naffah, N. \"Integrated Office Systems Protocols\", in Integrated Office Systems&mdash;Burotics, N. Naffah (ed.),# Proceedings of the IFIP TC-6 International Workshop on Integrated Office Systems, Versailles, France, November 6-9, 1979.",
      "doi": ""
    },
    {
      "text": "Newman, William. \"Office Models and Office Systems Design\", in Integrated Office Systems&mdash; N. Naffah (ed.),# Proceedings of the IFIP TC-6 International Workshop on Integrated Office Systems, Versailles, France, November 6-9, 1979.",
      "doi": ""
    },
    {
      "text": "Sprague, Ralph H., Jr. \"A Framework for the Development of Decision Support Systems,\" MIS Quarterly 1980 4 (4), 1-26.",
      "doi": ""
    },
    {
      "text": "Uhlig, Ronald, Farber, David J., and Bair, James H. The Office of The Future: Communication and Computers. Amsterdam: Elsevier-North-Holland, 1979.",
      "doi": ""
    }
  ]
}