{
  "doi": "10.1145/800049.801761",
  "title": "A test-bed for user interface designs",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "85-88",
  "year": 1982,
  "badges": [],
  "abstract": "Most presently available interactive computer interfaces treat their users in an unfriendly, uncooperative, and inflexible way, resulting in feelings of frustration and a conseqeuent loss of productivity for the users. These problems have led to attempts (e.g. [6, 8, 12, 13]) to make interfaces appear more friendly and cooperative through the addition of advanced interface features such as spelling correction, on-line help, personalized defaults, etc.. While common-sense suggests such features may be helpful, there is little hard evidence about how helpful they are or whether they are worth the overheads they entail. A primary reason for this lack of information is the practical difficulty of experimentation. Many of these features are time-consuming to implement, are usually implemented without adequate instrumentation, and are implemented in different and difficult to compare ways from system to system (see [10], for example). These problems in evaluation suggest the need for a test-bed interface in which various advanced features could be tried out in a consistent and adequately instrumented way with a variety of application systems. In this paper, we present a detailed rationale and a partially implemented design for a test-bed of this kind.",
  "authors": [
    {
      "name": "Eugene Ball",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100472259",
      "orcid": "missing"
    },
    {
      "name": "Phil Hayes",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384622109",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S.K., Moran, T.P., Newell, A. The Manuscript Editing Task: A Routine Cognitive Skill. Xerox Palo Alto Research Center, Palo Alto, California, 1976.",
      "doi": ""
    },
    {
      "text": "TOPS LISP. Carnegie-Mellon University Computer Science Department, 1978.",
      "doi": ""
    },
    {
      "text": "Glasner, I. D. and Hayes, P.J. Automatic Construction of Explanation Networks for a Cooperative User Interface. Carnegie-Mellon University Computer Science Department, 1981.",
      "doi": ""
    },
    {
      "text": "Hansen, W. J. User Engineering Principles for interactive Systems. Fall Jt. Computer Conf., AFIPS, 1971, pp. 523-532.",
      "doi": "10.1145/1479064.1479159"
    },
    {
      "text": "Hayes, P. J. and Mouradian, G. V. Flexible Parsing. Proc. of 18th Annual Meeting of the Assoc. for Comput. Ling., Philadelphia, June, 1980, pp. 97-103.  ",
      "doi": "10.3115/981436.981467"
    },
    {
      "text": "Lantz, K. A. Uniform Interfaces for Distributed Systems. Ph.D. Th., Computer Science Dept., Univ. of Rochester, 1980. ",
      "doi": "10.5555/909567"
    },
    {
      "text": "Miller, R. B. Response Time in Man-Computer Conversational Transactions. Fall Jt. Computer Conf., AFIPS, 1968, pp. 267-277.",
      "doi": ""
    },
    {
      "text": "RdMail Message Management System. Carnegie-Mellon University Computer Science Department, 1980.",
      "doi": ""
    },
    {
      "text": "Ritchie, D. M. and Thompson, K. \"The UNIX Time-Sharing System.\" Comm. ACM 17, 7 (July 1974), 365-375.  ",
      "doi": "10.1145/361011.361061"
    },
    {
      "text": "Roberts, T. L. Evaluation of Computer Text Editors. Report SSL-79-9, Xerox PARC, November, 1979.",
      "doi": "10.5555/909448"
    },
    {
      "text": "Robertson, G., Newell, A., and Ramakrishna, K. ZOG: A Man-Machine Communication Philosophy. Tech. Rept., Carnegie-Mellon University Computer Science Department, August, 1977.",
      "doi": ""
    },
    {
      "text": "Teitelman, W. INTERLISP Reference Manual. Xerox Palo Alto Research Center, Palo Alto, California, 1975.",
      "doi": ""
    },
    {
      "text": "Teitelman, W. A Display Oriented Programmer's Assistant. Proc. Fifth Int. Jt. Conf. on Artificial Intelligence, MIT, August, 1977, pp. 905-915.",
      "doi": ""
    }
  ]
}