{
  "doi": "10.1145/800049.801765",
  "title": "Toward the design and development of style-independent interactive systems",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "111-116",
  "year": 1982,
  "badges": [],
  "abstract": "The research project in which we are involved seeks to improve the technical climate for experimentation with the human factors of interactive systems by developing tool Kits to aid the experimenter [3,5]. These capabilities are in two general areas: languages and metrics to support the specification of user interfaces [1] and the evaluation of them with respect to ergonomic factors; and tools to facilitate the development of user interfaces at moderate cost and with short lead time. The latter area, which we have called “style-independent interactive systems”, or “abstract interaction handlers”, is taken up in this report.",
  "authors": [
    {
      "name": "Michael B. Feldman",
      "institution": "George Washington University, Washington, DC, USA",
      "img": "/do/10.1145/contrib-81100064781/rel-imgonly/feldman-head-080927.jpg",
      "acmid": "81100064781",
      "orcid": "missing"
    },
    {
      "name": "George T. Rogers",
      "institution": "George Washington University, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524037",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bleser, T., and J.D. Foley, Towards Specifying and Evaluating the Human Factors of User-computer Interfaces, Proc. Conference on Human Factors in Computer Systems, Gaithersburg, Maryland, March 1982.  ",
      "doi": "10.1145/800049.801801"
    },
    {
      "text": "Feldman, M.B., and G.T. Rogers, Design Requirements for Style-Independent Interactive Systems, The George Washington University, Institute for Information Science and Technology Tech. Report GWU-IIST-81-06, Washington, D.C., June 1981.",
      "doi": ""
    },
    {
      "text": "Feldman, M.B., Tools to Facilitate Human-Factors Improvement in Interactive Information Display Systems. Proc. IEEE Fall COMPCON 81, Washington, D.C., Sept. 1981.",
      "doi": ""
    },
    {
      "text": "Foley, J., V. Wallace, and P. Chan, The Human Factors of Interaction Techniques, The George Washington University, Institute for Information Science and Technology Tech. Report GWU-IIST-81-03, Washington, D.C., March 1981.",
      "doi": ""
    },
    {
      "text": "Foley, J.D., Tools for the Designers of User Interfaces, The George Washington University, Institute for Information Science and Technology Technical Report GWU-IIST-81-07, Washington, D.C., March 1981.",
      "doi": ""
    },
    {
      "text": "Foley, J. and P. Wenner, The George Washington University Core System Implementation, proceedings SIGGRAPH '81, published as Computer Graphics 15(3), August 1981, pp. 123-132. Also GWU Tech. Report GWU-IIST-80-12, 1980.  ",
      "doi": "10.1145/800224.806798"
    },
    {
      "text": "Foley, J., and A. Van Dam, Interactive Computer Graphics, Reading, Mass., Addison-Wesley, 1982. ",
      "doi": "10.5555/6684"
    },
    {
      "text": "Holmes, H.H., J. Thomas, and G.T. Rogers. A Clause-Structured Interaction Handler, The George Washington University, Institute for Information Science and Technology Tech. Report GWU-IIST-81-20, in process.",
      "doi": ""
    },
    {
      "text": "Kowalski, R., Algorithm &equil; Logic + Control, Communications of the ACM, Vol. 22, no. 7, July 1979, pp. 424-436.  ",
      "doi": "10.1145/359131.359136"
    },
    {
      "text": "Parnas, D.L., On the Use of Transition Diagrams in the Design of a User Interface for an Interactive Computer System, Proc. ACM National Conference, 1969.  ",
      "doi": "10.1145/800195.805945"
    },
    {
      "text": "Schneider, M.L., Models for the Design of Static Software Systems, Proc. Workshop/Symposium on Human-Computer Interaction, Atlanta, GA, March 1981, p. 65-75.",
      "doi": ""
    }
  ]
}