{
  "doi": "10.1145/800049.801778",
  "title": "Performance-based evaluation of graphic displays for nuclear power plant control rooms",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "182-189",
  "year": 1982,
  "badges": [],
  "abstract": "This paper reports several methodologies for evaluating the perceptual and perceptual/decision making aspects of displays used in the control rooms of nuclear power plants. This NRC funded study focuses upon the Safety Parameter Display System (SPDS) and relates the utility of the display to objective performance and preference measures obtained in experimental conditions. The first condition is a traditional laboratory setting where classical experimental methodologies can be employed. The second condition is an interactive control room simulation where the operator's performance is assessed while he/she operates the simulator. The third condition is a rating scale designed to assess operator preferences and opinions regarding a variety of display formats. The goal of this study is the development of a cost-efficient display evaluation methodology which correlates highly with the operators ability to control a plant.",
  "authors": [
    {
      "name": "Rohn J. Petersen",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332520856",
      "orcid": "missing"
    },
    {
      "name": "William W. Banks",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100462119",
      "orcid": "missing"
    },
    {
      "name": "David I. Gertman",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100618483",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "F.C. Donders, Over de snelheid van psychische processen. Onderzoekingen gedaan in bet Physiologisch Lo boratorium der Utrechtsche Hoogeschool, 1868-1869, Tweede reeks, II, 92-120. Translated by W. C. Koster in W. G. Koster (Ed.), Attention and Performance II, Acta Psychologica, 1969, 30, 412-431.",
      "doi": ""
    },
    {
      "text": "W.K. Estes, \"The Locus of Inferential and Perceptual Processes in Letter Identification,\" Journal of Experimental Psychology: General, 1975, 104, 122-145.",
      "doi": ""
    },
    {
      "text": "D.M. Green and J. A. Swets, Signal Detection Theory and Psychophysics, New York; Wiley, 1966.",
      "doi": ""
    },
    {
      "text": "R.G. Pachella, The Information of Reaction Time in Information-Processing Research, in B. H. Kantowitz (Ed.),Human Information Processing; Tutorials in Performances and Cognition, Hillsdale NJ; Lawrence Erlbaum Associates, 1974.",
      "doi": ""
    },
    {
      "text": "M. I. Posner, Psychobiology of attention. In M. S. Gazzaniga &amp; C. Blakemore (Eds.). Handbook of Psychology, New York; Academic Press, 1975.",
      "doi": ""
    },
    {
      "text": "W.P. Tanner and J. A. Swets, A Decision Making Theory of Visual Detection, Psychological Review, 61, 401-409, 1954.",
      "doi": ""
    }
  ]
}