{
  "doi": "10.1145/800049.801773",
  "title": "Can we expect to improve text editing performance?",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "152-156",
  "year": 1982,
  "badges": [],
  "abstract": "For some time now we have also been interested in studying human factors aspects of computer text editors. We have surveyed the literature [9], and we have conducted several investigations of our own [10] ranging from an application of file-comparison algorithms in editor research [1], through prediction of editing performance [7], to the design and implementation of SIMPLE, our own editing system for beginners [8, 11]. Currently we are concentrating our efforts on gathering data to determine how much time users spend performing various editing activities. We intend to extend the work begun in previous studies, to investigate suboptimal editor performance including errors and nonoptimal means of achieving goals, and to study the broder aspects of editing such as file manipulation and job control that have largely been ignored.",
  "tags": [],
  "authors": [
    {
      "name": "David W. Embley",
      "institution": "University of Nebraska, Lincoln, NE, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452616755",
      "orcid": "missing"
    },
    {
      "name": "George Nagy",
      "institution": "University of Nebraska, Lincoln, NE, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100382260",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anandan, P., Embley, D.W., and Nagy, G. An application of file-comparison algorithms to the study of program editors, International Journal of Man-Machine Studies, Vol. 13, No. 2, August 1980, 201-211.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. The manuscript editing task: a routine cognitive skill, Xerox Research Rep. SSL-76-8, Palo Alto Research Center, Palo Alto, California, December 1976.",
      "doi": ""
    },
    {
      "text": "Card, S.K. Studies in the psychology of computer text editing systems, Ph.D. Thesis, Department of Psychology, Carnegie-Mellon University, Pittsburgh, Pennsylvania; also Xerox Research Rep. SSL-78-1, Palo Alto Research Center, Palo Alto, California, August 1978.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. Computer text editing: an information-processing analysis of a routine cognitive skill, Cognitive Psychology, Vol. 12, 1980a, 32-74.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. The keystroke-level model for user performance time with interactive systems, Communications of the ACM, Vol. 23, No. 7, July 1980b, 396-410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Coombs, M.J. and Alty, J.L. (Eds) Computing Skills and the User Interface. Academic Press, London, 1981. ",
      "doi": "10.5555/578303"
    },
    {
      "text": "Embley, D.W., Lan, M.T., Leinbaugh, D.W., and Nagy, G. A procedure for predicting program editor performance from the user's point of view, International Journal of Man-Machine Studies, Vol. 10, No. 6, November 1978, 639-650.",
      "doi": ""
    },
    {
      "text": "Embley, D.W. and Nagy, G. SIMPLE specifications, Department of Computer Science Rep., University of Nebraska, Lincoln, Nebraska, June 1979.",
      "doi": ""
    },
    {
      "text": "Embley, D.W. and Nagy, G. Behavioral aspects of text editors, Computing Surveys, Vol. 13, No. 1, March 1981a, 33-70.  ",
      "doi": "10.1145/356835.356838"
    },
    {
      "text": "Embley, D.W. and Nagy, G. Empirical and formal methods for the study of computer editors, in Computing Skills and the User Interface, M.J. Coombs and J.L. Alty (eds.), Academic Press, London, 1981b, 465-496.",
      "doi": ""
    },
    {
      "text": "Embley, D.W. and Nagy, G. SIMPLE - a programming environment for beginners, SIGCSE Bulletin, Vol. 13, No. 4, December 1981, 7-12.  ",
      "doi": "10.1145/989306.989308"
    },
    {
      "text": "Hammer, J.M. and Rouse, W.B. Analysis and modeling of freeform text editing behavior, Proceedings of the 1979 International Conference on Cybernetics and Society, Denver, Colorado, October 1979.",
      "doi": ""
    },
    {
      "text": "Hammer, J.M. The human as a constrained optimal text editor, Ph.D. Thesis, Department of Computer Science, University of Illinois, Urbana Illinois; also Coordinated Science Laboratory Rep. T-105, University of Illinois, Urbana, Illinois, June 1981. ",
      "doi": "10.5555/910162"
    },
    {
      "text": "Ledgard, H., Whiteside, J.A., Singer, A., and Seymour, W. The natural language of interactive systems, Communications of the ACM, Vol. 23, No. 10, October 1980, 556-563.  ",
      "doi": "10.1145/359015.359018"
    },
    {
      "text": "Roberts, T.L. Evaluation of computer text editors, Ph.D. Thesis, Department of Computer Science, Stanford University, Stanford, California; also Xerox Research Rep. SSL-79-9, Palo Alto, California, November 1979. ",
      "doi": "10.5555/909448"
    },
    {
      "text": "Shneiderman, B. Software Psychology, Winthrop, Cambridge, Massachusetts, 1980.",
      "doi": ""
    },
    {
      "text": "Weinberg, G.M. The Psychology of Computer Programming, Van Nostrand Reinholt, New York, 1971. ",
      "doi": "10.5555/61465"
    }
  ]
}