{
  "doi": "10.1145/800049.801805",
  "title": "Reducing manual labor: An experimental analysis of learning aids for a text editor",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "332-336",
  "year": 1982,
  "badges": [],
  "abstract": "It is by now a truism to say that computational systems should be designed with ease of use in mind. Indeed, Shneiderman [10] collects together nearly a dozen lists of advice produced by authors in the past decade on how to meet this laudable goal. The advice that is given seems often to be quite good, but it is almost always qualitative in nature, rather vague, and sometimes contradictory. Remarkably little work has been done examining the actual usefulness of carrying out some of the advice, the extent of savings that can be realized by so doing, or the theoretical rationale behind it. In this paper we will present the rationale for investigating two variables that may aid the user, in particular the novice user, and we will describe an extensive experiment designed to examine the actual effects of these two variables. The goals of the work are (1) to understand better the acquisition, representation, and utilization of knowledge by novice or occasional users of computer-based information systems, and (2) to put to the test some ideas derived from current views of memory and attention.",
  "authors": [
    {
      "name": "Donald J. Foss",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100541832",
      "orcid": "missing"
    },
    {
      "name": "Mary Beth Rosson",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335496622",
      "orcid": "missing"
    },
    {
      "name": "Penny L. Smith",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100553730",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S. K., Moran, T. P., &amp; Newell, A. The keystroke-level model for user performance time with interactive systems (SSL-79-1). Palo Alto, California: Xerox Palo Alto Research Center, March, 1979.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T. P., &amp; Newell, A. Computer text-editing: An information-processing analysis of a routine cognitive skill. Cognitive Psychology, 1980, 12, 32-74.",
      "doi": ""
    },
    {
      "text": "Carroll, J. M., &amp; Thomas, J. C. Metaphor and the cognitive representation of computing systems. IBM Research Report RC 8302, Yorktown Heights, N.Y., May, 1980.",
      "doi": ""
    },
    {
      "text": "Embley, D. W., Lan, M. T., Leinbaugh, D. W., &amp; Nagy, G. A procedure for predicting program editor performance from the user's point of view. International Journal of Man-Machine Studies, 1978, 10, 639-650",
      "doi": ""
    },
    {
      "text": "Ledgard, H., Whiteside, J. A., Singer, A., &amp; Seymour, W. The natural language of interactive systems. Communications of the ACM, 1980, 23, 556-563.  ",
      "doi": "10.1145/359015.359018"
    },
    {
      "text": "Mayer, R. E. The psychology of learning computer programming by novices. Computing Surveys, 1981, 13.  ",
      "doi": "10.1145/356835.356841"
    },
    {
      "text": "Reder, L. M., &amp; Anderson, J. R. A partial resolution of the paradox of interference: The role of integrating knowledge. Cognitive Psychology, 1980, 12, 447-472.",
      "doi": ""
    },
    {
      "text": "Reisner, P. Human factors studies of database query languages: A survey and assessment. IBM Research Report RJ3070, San Jose, California, March, 1981.",
      "doi": "10.1145/356835.356837"
    },
    {
      "text": "Roberts, T. L. Evaluation of Computer Text Editors (SSL-79-9). Palo Alto, California: Xerox Palo Alto Research Center, November, 1979.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Software psychology. Cambridge, Mass.: Winthrop, 1980.",
      "doi": ""
    },
    {
      "text": "SOS reference manual: DECsystem 10. Austin, Texas: University of Texas Computation Center, April, 1979.",
      "doi": ""
    }
  ]
}