{
  "doi": "10.1145/800049.801767",
  "title": "An empirical evaluation of software documentation formats",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "121-124",
  "year": 1982,
  "badges": [],
  "abstract": "The success of any software development project depends in part on the quality of the communication among the individuals involved: users, designers, coders and managers. On large systems, a variety of individuals perform various tasks at different points in time. The efficiency and correctness with which later tasks are performed depends critically on the documentation supplied during previous phases of the development cycle. This paper describes a series of three experiments designed to examine the effects of documentation format on the performance of programmers on different software-related tasks.",
  "authors": [
    {
      "name": "Sylvia B. Sheppard",
      "institution": "General Electric Company, Arlington, Virginia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332527177",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Kruesi",
      "institution": "General Electric Company, Arlington, Virginia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100318743",
      "orcid": "missing"
    },
    {
      "name": "John W. Bailey",
      "institution": "General Electric Company, Arlington, Virginia, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659503300",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Blaiwes, A.S. Formats for presenting procedural instructions. Journal of Applied Psychology, 1974, 59, 683-686.",
      "doi": ""
    },
    {
      "text": "Jones, C. A survey of programming design and specification techniques. In Proceedings of the IEEE Conference on Specifications of Reliable Software. New York: Institute of Electrical and Electronics Engineers, 1979.",
      "doi": ""
    },
    {
      "text": "Kammann, R. The comprehensibility of printed instructions and the flowchart alternative. Human Factors, 1975, 17, 183-191.",
      "doi": ""
    },
    {
      "text": "Kirk, R.E. Experimental design procedures for the behavioral sciences. Belmont, CA: Brooks-Cole, 1968.",
      "doi": ""
    },
    {
      "text": "Miller, L.A. Natural language programming: styles, strategies, and contrasts. IBM Systems Journal, 1981, 20, 184-215.",
      "doi": "10.1147/sj.202.0184"
    },
    {
      "text": "Ramsey, H.R., Atwood, M.E., &amp; Van Doren, J.R. A comparative study of flowcharts and program design language for the detailed procedural specification of computer programs. (Tech. Rep. #SAI-78-078-DEN). Denver: Science Applications, Inc. 1978.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B., Mayer, B.R., McKay, D., &amp; Heller, P. Experimental investigations on the utility of detailed flowcharts in programming. Communications of the ACM, 1977, 20, 373-381.  ",
      "doi": "10.1145/359605.359610"
    },
    {
      "text": "Winer, B.J. Statistical principles in experimental design. New York: McGraw-Hill, 1971.",
      "doi": ""
    },
    {
      "text": "Wright, P. &amp; Reid, F. Written information: Some alternatives to prose for expressing the outcomes of complex contingencies. Journal of Applied Psychology, 1973, 57, 160-166.",
      "doi": ""
    }
  ]
}