{
  "doi": "10.1145/800049.801801",
  "title": "Towards specifying and evaluating the human factors of user-computer interfaces",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "309-314",
  "year": 1982,
  "badges": [],
  "abstract": "Despite the current interest in user-computer interfaces, the design of a good interface remains to a great extent an art, with much argument over guidelines and principles for interface design. Pertinent information, scattered throughout the literature of psychology, graphic design. linguistics, hardware design, and under the general umbrella of computer science, is only gradually being gathered into survey publications for application by computer scientists [1,4,12,15]. Our purpose is to design a specification language which will serve as a vehicle for the design of and experimentation with user-computer interfaces. The specification language not only defines the external characteristics of the interface, but can also be analyzed to determine whether the interface meets a set of generally-accepted human factors guidelines. We believe the language is general enough to be used with principles of interface design other than those we have proposed.",
  "authors": [
    {
      "name": "Teresa Bleser",
      "institution": "George Washington University, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100611930",
      "orcid": "missing"
    },
    {
      "name": "James D. Foley",
      "institution": "George Washington University, Washington, DC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100302796",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barmack, J. E., and Sinaiko, H. W., Human Factors problems in computer-generated graphic displays. Washington, D. C.: Institute for Defense Analyses, 1966. (AD-63617C)",
      "doi": ""
    },
    {
      "text": "Bleser, T. W., A formal specification and computer-assisted evaluation of human-computer interfaces. (M.S. thesis) The George Washington University, Institute for Information Science and Technology Technical Report GWU-IIST-82-01. Washington, D.C., March 1981.",
      "doi": ""
    },
    {
      "text": "Card, S., T. Moran and A. Newell, The Keystroke-Level Model for User Performance Time with Interactive Systems. Communications of the ACM 23(7), (July 1980), 396-410.  ",
      "doi": "10.1145/358886.358895"
    },
    {
      "text": "Engel, S. E. and Granda, R. E., Guidelines for man/display interfaces (TR 00.2720). Poughkeepsie, New York: IBM, December 1975",
      "doi": ""
    },
    {
      "text": "Feldman, M.B. and G.T. Rogers, Toward the Design and Development of Style-Independent Interactive Systems. Human Factors Conference, March 1982  ",
      "doi": "10.1145/800049.801765"
    },
    {
      "text": "Foley, J. D. and A. van Dam, Interactive Computer Graphics. Reading, Mass., Addison-Wesley, 1982. ",
      "doi": "10.5555/6684"
    },
    {
      "text": "Foley, J.D., V. Wallace. and P. Chan. The human factors of interaction techniques. The George Washington University, Institute for Information Science and Technology Technical Report GWU-IIST-81-03, Washington, D.C., March 1981",
      "doi": ""
    },
    {
      "text": "Green, M., A Methodology for the Specification of Graphical User Interface. ACM SIGGRAPH'81 Proceedings, p99-108.  ",
      "doi": "10.1145/800224.806795"
    },
    {
      "text": "Hanau, P.R. and D.R. Lenorovitz, Prototyping and Simulation Tools for User/Computer Dialogue Design. ACM SIGGRAPH'80 Proceedings, published as Computer Graphics 14(2), July 1980, p271-278  ",
      "doi": "10.1145/800250.807504"
    },
    {
      "text": "Martin, J., Design of man-computer dialogues. Englewood Cliffs, New Jersey: Prentice-Hall, 1973. ",
      "doi": "10.5555/574884"
    },
    {
      "text": "Moran, T.P. The Command language grammar: A representation for the user interface of interactive computer systems. International Journal of Man-Machine Studies 15 (1981), p3-50.",
      "doi": ""
    },
    {
      "text": "Ramsey, H. R. and Atwood, M. E., Human factors in computer systems: A review of the literature (Tech. Rep, SAI-79-111-DEN). Englewood, Colorado: Science Applications, September 1979.",
      "doi": ""
    },
    {
      "text": "Reisner, P. Formal grammar and human factors design of an interactive graphics system. IEEE Transactions on Software Engineering, vol. SE-7, no. 2 (March 1981) 229-240.",
      "doi": "10.1109/TSE.1981.234520"
    },
    {
      "text": "Shneiderman, B. Multi-Party grammars and related features for defining interactive systems. IEEE Transactions on Systems, Man, and Cybernetics (March 1982).",
      "doi": ""
    },
    {
      "text": "Williges, B.H. and R.C. Williges, User Considerations in Computer-Based Information Systems. Virginia Polytechnic Institute and State University Technical Report CSIE-81-2, Blacksburg, Virginia, September 1981",
      "doi": ""
    }
  ]
}