{
  "doi": "10.1145/800049.801775",
  "title": "Communication and management support in system development environments",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "163-168",
  "year": 1982,
  "badges": [],
  "abstract": "A System Development Support Environment that assists in communication and management tasks of software project members should aid the development of large, evolutionary computer systems. The environment proposed in this paper will include integrated capabilities for project management, system evaluation, documentation/help, and intelligent communication between designers/users, and either the system or other designers. The goal is to have the environment help collect, organize and disseminate information about a project, using a model of the underlying system. The work is based on the idea that people perform “Communication Acts” (ACTs) such as: questioning, griping, planning, requesting or informing, while interacting with a system, and that processing of these ACTs can be automated. A Taxonomy of “simple” ACTs has been created from initial, informal studies of system/user interaction. A knowledge-based synthesis approach is used to create an experimental environment to support a program synthesis (software) project [Phillips-81]. The environment design and framework, which is part of the author's Ph.D. thesis work in progress [Kedzierski-80], is discussed.",
  "tags": [
    "Project management",
    "Artificial intelligence",
    "Knowledge representation",
    "Software engineering",
    "Software psychology",
    "Human-computer interfaces",
    "Programming environments",
    "System development support",
    "Knowledge-based systems"
  ],
  "authors": [
    {
      "name": "Beverly I. Kedzierski",
      "institution": "Kestrel Institure, Palo Alto, CA, USA & University of Southwestern Louisiana, Lafayette, LA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100626046",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Genesereth, M.R., Automated Consultation for Complex Computer Systems, Ph.D. thesis, Harvard University, September 1978.",
      "doi": ""
    },
    {
      "text": "Cordell Green, Richard P. Gabriel, Elaine Kant, Beverly I. Kedzierski, Brian P. McCune, Jorge V. Phillips, Steve T. Tappel, and Stephen J. Westfold, \"Results in knowledge-based Program Synthesis\", IJCAI-79:# Proceedings of the Sixth International Joint Conference on Artificial Intelligence, Volume 1, Computer Science Department, Stanford University, Stanford, California, August 1979, pages 342-344.",
      "doi": ""
    },
    {
      "text": "Hayes, P., Ball, E., and Reddy, R. \"Breaking the Man-Machine Communication Barrier\", IEEE Computer, March 1981.",
      "doi": "10.1109/C-M.1981.220373"
    },
    {
      "text": "Kedzierski B.I., A Structured Paper on Large Project Management, Special Projects in Computer Software, University of Southwestern Louisiana, December 1976.",
      "doi": ""
    },
    {
      "text": "Kedzierski, B. I., \"Codification of Communication Knowledge for Extending Evolutionary System Environments\", Ph.D. thesis proposal, Systems Control Technical Report, SCI-ICS.I.81, April 1980.",
      "doi": ""
    },
    {
      "text": "Kedzierski, B. I., \"Communication Support in a System Development Environment\", Systems Control Technical Report, SCI-ICS.L.81.4, 1981.",
      "doi": ""
    },
    {
      "text": "Keider, Stephen P., \"Why Projects Fail\", Datamation, Dec. 1974, pp. 53-55.",
      "doi": ""
    },
    {
      "text": "Ledbetter, L.E., \"The Software Life Cycle Model: Implications for Program Development Support Systems\", Schlumberger-Doll Research, Schlumberger Technology Corporation, Ridgefield, CT., May 1980.",
      "doi": ""
    },
    {
      "text": "Brian P. McCune, Building Program Models Incrementally from Informal Descriptions, Ph.D. thesis, Memo AIM-333, Report STAN-CS-79-772, Artificial Intelligence Laboratory, Computer Science Department, Stanford University, Stanford, California, Technical Report SCI.ICS.U.79.2, Computer Science Department, Systems Control, Inc., Palo Alto, California, October 1979. ",
      "doi": "10.5555/909446"
    },
    {
      "text": "Moran, Thomas (Ed.) \"The Psychology of Human-Computer Interaction\", ACM Surveys Special Issue, 1981.",
      "doi": ""
    },
    {
      "text": "Phillips, J., Green, C., Towards Self-Described Programming Environments, SCI Tech Report SCI.ICS.L.81.3, June 1980.",
      "doi": ""
    },
    {
      "text": "Phillips, J., Self-Described Program Synthesis Environments: An Application of a Theory of Design to Programming Systems, Ph.D. Thesis, Computer Science and Electrical Engineering Department, Stanford University (forthcoming). ",
      "doi": "10.5555/910889"
    },
    {
      "text": "\"Programming Environments\", IEEE Computer, Vol. 14, No. 4, April, 1981.",
      "doi": ""
    },
    {
      "text": "Rich, C., Shrobe, H. and Waters, R., \"Programmer's Apprentice Project\" - MIT, Outline of Research 1979-80.",
      "doi": ""
    },
    {
      "text": "Sandewall, E., \"Programming in an Interactive Environment: the LISP Experience,\" ACM Computing Surveys, 10,1 (March 1978), 35-72.  ",
      "doi": "10.1145/356715.356719"
    },
    {
      "text": "Searle, J.R., Speech Acts: An Essay in the Philosophy of Language, Cambridge University Press, New York, NY., 1978.",
      "doi": ""
    },
    {
      "text": "Zelkowitz, M.V., \"Perspectives on Software Engineering\", ACM Computing Surveys, June 1978.  ",
      "doi": "10.1145/356725.356731"
    }
  ]
}