{
  "doi": "10.1145/800049.801803",
  "title": "The acquisition of text editing skills",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "324-325",
  "year": 1982,
  "badges": [],
  "abstract": "The study of text editing is a significant undertaking for at least two reasons. Our study sought to examine text editing more extensively in two regards. First, we wanted to discover how the basic task develops into a routine cognitive skill, i.e., how does the novice user differ from the expert and how is that expertise eventually acquired. Second, we wanted to determine possible ways of improving the techniques for training people in the use of text editors, based on knowledge of how text editing skills develop.",
  "tags": [],
  "authors": [
    {
      "name": "Sherman W. Tyler",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659553379",
      "orcid": "missing"
    },
    {
      "name": "Steven Roth",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81538060556",
      "orcid": "missing"
    },
    {
      "name": "Timothy Post",
      "institution": "University of Pittsburgh, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332521771",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Card, S.K. Studies in the psychology of computer text editing systems. Ph.D. dissertation, Dept. of Psychology, Carnegie-Mellon U., Pittsburgh, PA, 1978.",
      "doi": ""
    },
    {
      "text": "Card, S.K., Moran, T.P., and Newell, A. Computer text editing: An information processing analysis of a routine cognitive skill. Cognitive Psychology, 1980, 32-74.",
      "doi": ""
    },
    {
      "text": "Embley, D.W., Lan, M.T., Leinbaugh, D.W., and Nagy, G. A procedure for predicting program editor performance from the user's point of view. International Journal of Man-Machine Studies, 1978, 639-650.",
      "doi": ""
    },
    {
      "text": "Roberts, T.L. Evaluation of computer text editors. Ph.D. dissertation, Dept. of Computer Science, Stanford U., Stanford, CA, 1979. ",
      "doi": "10.5555/909448"
    },
    {
      "text": "Treu, S. Interactive command language design based on required mental work. International Journal of Man-Machine Studies, 1975, 135-149.",
      "doi": ""
    }
  ]
}