{
  "doi": "10.1145/800049.801810",
  "title": "Decision situations, decision processes, and decision functions: Towards a theory-based framework for decision-aid design",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "355-358",
  "year": 1982,
  "badges": [],
  "abstract": "Decision augmentation systems differ qualitatively from current man-computer interactive systems because they involve intelligent, complex, and largely symbiotic man-machine relationships. They thus provide the stimulus for the development of a new branch of human factors, one concerned with the human engineering of relationships between humans and intelligent, quasi-autonomous, computer-based systems. The threefold objective of the research described in this paper has therefore been to identify the human factors problems which such a framework should address, to generate the basic information around which it should be built, and to determine the general structure which it should take.",
  "authors": [
    {
      "name": "W. Zachary",
      "institution": "Analytics Inc, Willow Grove, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659627210",
      "orcid": "missing"
    },
    {
      "name": "R. Wherry",
      "institution": "Analytics Inc, Willow Grove, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100250233",
      "orcid": "missing"
    },
    {
      "name": "F. Glenn",
      "institution": "Analytics Inc, Willow Grove, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100628846",
      "orcid": "missing"
    },
    {
      "name": "J. Hopson",
      "institution": "Naval Air Development Center, Warminster, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100332453",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alter, S. Decision Support Systems: Current Practices and Challenges. Reading, MA: Addison-Wesley, 1980.",
      "doi": ""
    },
    {
      "text": "Bateson, G. Steps to an Ecology of Mind. New York: Ballantine, 1972.",
      "doi": ""
    },
    {
      "text": "Hammond, K.R., Mumpower, J.L., and Smith, T.H. Linking environmental models with models of human judgement: A symmetrical decision aid. IEEE Transactions on Systems, Man and Cybernetics, 1977, SMC-7(5), 358-367.",
      "doi": ""
    },
    {
      "text": "Leal, A. and Pearle, J. An interactive program for conversational elicitation of decision structures. IEEE Transactions on Systems, Man and Cybernetics, 1977, SMC-7(5), 368-376.",
      "doi": ""
    },
    {
      "text": "Madni, A. and Freedy, A. Decision aids for airborne intercept operations in advanced aircrafts. Proceedings of 17th Annual Conference on Manual Control, 1981.",
      "doi": ""
    },
    {
      "text": "Miller, L.W., Kaplan, R.J., and Edwards, W. JUDGE: A value-judgement-based tactical command system. Organizational Behavior and Human Performance, 1967, 2, 329-373.",
      "doi": ""
    },
    {
      "text": "Simon, H. Sciences of the Artificial. Cambridge, MA: MIT Press, 1969. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "Weisbrod, R.L., Davis, K.B., and Freedy, A. Adaptive utility assessment in dynamic processes: An experimental evaluation of decision aiding. IEEE Transactions on Systems, Man and Cybernetics, 1977, SMC-7(5), 377-383.",
      "doi": ""
    }
  ]
}