{
  "doi": "10.1145/800049.801782",
  "title": "A review of human factors research on programming languages and specifications",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "212-218",
  "year": 1982,
  "badges": [],
  "abstract": "This paper presents a partial review of the human factors work on computer programming. It begins by giving an overview of the behavioral science approach to studying programming. Because of space limitations this review will concentrate on cognitive models of programmer problem solving and the experimental research on language characteristics and specification formats. Areas not reviewed include debugging, programming teams, individual differnces, and research methods. The conclusions discuss promising directions for future theory and research.",
  "authors": [
    {
      "name": "Bill Curtis",
      "institution": "ITT Programming Technology Center, Stratford, CT, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332495004",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Atwood, M.E. &amp; Ramsey, H.R. Cognitive structures in the comprehension and memory of computer programs: An investigation of computer program debugging (Tech Rep. TR-78-A21). Alexandria, VA: ARI, 1978).",
      "doi": ""
    },
    {
      "text": "Atwood, M.E., Turner, A.A., Ramsey, H.R., &amp; Hopper, J.N. An exploratory study of the cognitive structures underlying the comprehension of software design problems (Tech Rep. 392). Alexandria, VA: ARI, 1979.",
      "doi": ""
    },
    {
      "text": "Blaiwes, A.S. Formats for presenting procedural instructions. Journal of Applied Psychology, 1974, 59, 683-686.",
      "doi": ""
    },
    {
      "text": "Brooke, J.B. &amp; Duncan, K.D. An experimental study of flowcharts as an aid to identification of procedural faults. Ergonomics, 1980, 23 (4), 387-399.",
      "doi": ""
    },
    {
      "text": "Brooke, J.B. &amp; Duncan, K.D. Experimental studies of flowchart use at different stages of program debugging. Ergonomics, 1980, 23 (11), 1057-1091.",
      "doi": ""
    },
    {
      "text": "Brooks, R. Towards a theory of cognitive processes in computer programming. International Journal of Man-Machine Studies, 1977, 9, 737-751.",
      "doi": ""
    },
    {
      "text": "Brooks, R. Studying programmer behavior experimentally: The problems of proper methodology. Communications of the ACM, 1980, 23 (4), 207-213.  ",
      "doi": "10.1145/358841.358847"
    },
    {
      "text": "Curtis, B. Measurement and experimentation in software engineering. Proceedings of the IEEE, 1980, 68 (9), 1144-1157.",
      "doi": ""
    },
    {
      "text": "Curtis, B. Human Factors in Software Development. Silver Spring, MD: IEEE Computer Society, 1981. ",
      "doi": "10.5555/533148"
    },
    {
      "text": "Dijkstra, E.W. GO TO statement considered harmful. Communications of the ACM, 11 (3), 147-148.  ",
      "doi": "10.1145/362929.362947"
    },
    {
      "text": "Dunsmore, H.E. &amp; Gannon, J.D. Data referencing: An empirical investigation. Computer, 1979, 12 (12), 50-59.",
      "doi": "10.1109/MC.1979.1658576"
    },
    {
      "text": "Fitter, M. &amp; Green, T.R.G. When do diagrams make good computer languages? International Journal of Man-Machine Studies, 1979, 11, 235-261.",
      "doi": ""
    },
    {
      "text": "Gannon, J.D. An experiment for the evaluation of language features. International Journal of Man-Machine Studies, 1976, 8, 61-73.",
      "doi": ""
    },
    {
      "text": "Gannon, J.D. An experimental evaluation of data type conventions. Communications of the ACM, 1977, 20 (8), 584-595.  ",
      "doi": "10.1145/359763.359800"
    },
    {
      "text": "Green, T.R.G. Conditional program statements and their comprehensibility to professional programmers. Journal of Occupational Psychology, 1977, 50, 93-109.",
      "doi": ""
    },
    {
      "text": "Green, T.R.G., Sime, M.E., &amp; Fitter, M.J. The problem the programmer faces. Ergonomics, 1980, 23 (9), 893-907.",
      "doi": ""
    },
    {
      "text": "Halstead, M.H. Elements of Software Science. New York: Elsevier, 1977. ",
      "doi": "10.5555/540137"
    },
    {
      "text": "Kammann, R. The comprehension of printed instructions and the flowchart alternative. Human Factors, 1975, 17 (2), 183-191.",
      "doi": ""
    },
    {
      "text": "Kinstch, W. The Representation of Meaning in Memory, Hillsdale, NJ: Erlbaum, 1974.",
      "doi": ""
    },
    {
      "text": "Lucas, H.C. &amp; Kaplan, R.B. A structured programming experiment. The Computer Journal, 1974, 19 (2), 136-138.",
      "doi": ""
    },
    {
      "text": "Mayer, R.E. Comprehension as affected by the structure of the problem representation. Memory &amp; Cognition, 1976, 4 (3), 249-255.",
      "doi": ""
    },
    {
      "text": "Mayer, R.E. The psychology of how novices learn computer programming. ACM Computing Surveys, 1981, 13 (1), 121-141.  ",
      "doi": "10.1145/356835.356841"
    },
    {
      "text": "McKeithen, K.B., Reitman, J.S., Rueter, H.H., &amp; Hirtle, S.C. Knowledge organization and skill differences in computer programmers. Cognitive Psychology, 1981, 13.",
      "doi": ""
    },
    {
      "text": "Miller, G.A. The magic number seven, plus or minus two. Psychological Review, 1956, 63, 81-97.",
      "doi": ""
    },
    {
      "text": "Miller, L.A. Programming by non-programmers. International Journal of Man-Machine Studies, 1974, 6, 237-260.",
      "doi": ""
    },
    {
      "text": "Miller, L.A. Natural language programming: Styles, strategies, and contrasts. IBM Systems Journal, 1981, 20 (2), 184-215.",
      "doi": "10.1147/sj.202.0184"
    },
    {
      "text": "Moher, T. &amp; Schneider, G.M. Methods for improving controlled experimentation in software engineering. Proceedings of the Fifth International Conference on Software Engineering. Silver Spring, MD: IEEE Computer Society, 1981, 224-233. ",
      "doi": "10.5555/800078.802535"
    },
    {
      "text": "Newell, A. Models of production systems. In W.G. Chase (Ed.), Visual Information Processing. New York: Academic, 1973, 463-526.",
      "doi": ""
    },
    {
      "text": "Newell A. &amp; Simon, H.A. Human Problem Solving. Englewood Cliffs, NJ: Prentice-Hall, 1972. ",
      "doi": "10.5555/1095704"
    },
    {
      "text": "Nichols, J.A. Problem solving strategies and organization of information in computer programming. Dissertation Abstracts International, 1981.",
      "doi": ""
    },
    {
      "text": "Ramsey, H.R., Atwood, M.E., &amp; Van Doren, J.R. Flowcharts vs. program design languages: An experimental comparison. Proceedings of the 22nd Annual Meeting of the Human Factors Society. Santa Monica, CA: Human Factors Society, 1978, 709-713.",
      "doi": ""
    },
    {
      "text": "Shepperd, S.B., Curtis, B., Milliman, P., &amp; Love, T. Modern coding practices and programmer performance. Computer, 1979, 12 (12), 41-49.",
      "doi": "10.1109/MC.1979.1658575"
    },
    {
      "text": "Sheppard, S.B. &amp; Kruesi, E. The effects of the symbology and spatial arrangement of software specifications in a coding task. Trends and Applications 1981: Advances in Software Technology. Silver Spring, MD: IEEE Computer Society, 1981.",
      "doi": ""
    },
    {
      "text": "Sheppard, S.B., Kruesi, E., &amp; Curtis, B. The effects of symbology and spatial arrangement on the comprehension of software specifications. Proceedings of the Fifth International Conference on Software Engineering. Silver Spring, MD: IEEE Computer Society, 1981, 207-214. ",
      "doi": "10.5555/800078.802533"
    },
    {
      "text": "Shneiderman, B. Software Psychology: Human Factors in Computer and Information Systems. Cambridge, MA: Winthrop, 1980. ",
      "doi": "10.5555/1097028"
    },
    {
      "text": "Shneiderman, B. Two experiments on control flow and data structure documentation (unpublished manuscript). College Park, MD: Department of Computer Science, University of Maryland, 1981.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. &amp; Mayer, R. Syntactic/semantic interactions in programmer behavior: A model and experimental results. International Journal of Computer and Information Sciences, 1979, 8 (3), 219-238.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B., Mayer, R., McKay, D., &amp; Heller, P. Experimental investigations of the utility of detailed flowcharts in programming. Communications of the ACM, 1977, 20 (6), 373-381.  ",
      "doi": "10.1145/359605.359610"
    },
    {
      "text": "Sime, M.E., Arblaster, A.T., &amp; Green, T.R.G. Structuring the programmer's task. Journal of Occupational Psychology, 1977, 50, 205-216.",
      "doi": ""
    },
    {
      "text": "Weissman, L. Psychological complexity of computer programs: An experimental methodology. Sigplan Notices, 1974, 9 (6), 25-36.  ",
      "doi": "10.1145/953233.953237"
    },
    {
      "text": "Wright, P. &amp; Reid, F. Written information: Some alternatives to prose for expressing the outcome of complex contingencies. Journal of Applied Psychology, 1973, 57, 160-166.",
      "doi": ""
    }
  ]
}