{
  "doi": "10.1145/800049.801747",
  "title": "Computer commands labelled by users versus imposed commands and the effect of structuring rules on recall",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "17-19",
  "year": 1982,
  "badges": [],
  "abstract": "In the office of the future, computers will be found in the work environment to accomplish many various tasks. Often times, one will find computer command languages built from words of natural language, thereby facilitating the use of these new office automation systems for users inexperienced with computers. The study presented here focuses on very simple languages, without embedded features and where each computer command label corresponds to only one function. Three different approaches have been taken in order to improve the design of such simple languages: evaluation of existing languages (Scapin [1]); study of experimental languages that differ on linguistic or semantic variables (Hammond et al. [2]; Carroll [3]; Scapin [4]); research on the design of languages by the users themselves (Carroll [3]; Bisseret et Scapin [5]).",
  "authors": [
    {
      "name": "Dominique L. Scapin",
      "institution": "missing",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100519367",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Scapin, D.L. Evaluation of an electronic mail language. Proceeding of the ACM International Computing Symposium on System Architecture, 1981, 425-432.",
      "doi": ""
    },
    {
      "text": "Hammond, N., Barnard, P., Clark, I., Morton, J., and Long, J. Structure and content in interactive dialogue. Medical Research Council Report, 1980.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. Learning, using and designing command paradigms. IBM Research Report RC 8141, 1980.",
      "doi": ""
    },
    {
      "text": "Scapin, D.L. Computer commands in restricted natural language: some aspects of memory and experience. Human Factors, 1981, 23 (3), 365-375.",
      "doi": ""
    },
    {
      "text": "Bisseret, A. et Scapin, D.L. Ergonomie du service Agora-Teletel. II. Etude du langage de commande de la messagerie. Technical INRIA Report BUR R06, 1980.",
      "doi": ""
    },
    {
      "text": "Broadbent, D.E. and Broadbent, M.H.P. The allocation of descriptor terms by individuals in a simulated retrieval system. Ergonomics, 1978,21, 343-354.",
      "doi": ""
    },
    {
      "text": "Slamecka, N.J. and Graf, P. The generation effect: Delineation of a phenomenon. Journal of Experimental Psychology: Human Learning and Memory, 1978, 4 (6), 592-604.",
      "doi": ""
    },
    {
      "text": "Jacoby, L.L. On interpreting the effects of repetition: solving a problem versus remembering a solution. Journal of Verbal Learning and Verbal Behavior, 1978, 17 (6), 649-667.",
      "doi": ""
    },
    {
      "text": "Mc Farland, Jr., C.E., Frey, T.J., and Rhodes, D.D. Retrieval of internally versus externally generated words in episodic memory. Journal of Verbal Learning and Verbal Behavior, 1980, 19(2), 210-225.",
      "doi": ""
    },
    {
      "text": "Scapin, D.L. et Lasserre, C. Essai de construction d'un vocabulaire de commande. INRIA Note CA 7909 R3, 1979.",
      "doi": ""
    },
    {
      "text": "Moran, T.P. Introduction to the command language grammar. Xerox Report SSL-78-3, AIP Memo 111, 1978.",
      "doi": ""
    },
    {
      "text": "Morton, J., Barnard, P., J. Hammond, N. V., and Long, J.B. Interacting with a computer: a framework. In E.J. Boutmy and A. Danthine (Eds.), Teleinformatics 79. Amsterdam: North Holland, 1979, 201-208.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. Naming as a mapping between n-dimensional geometries. IBM Research Report, 1980.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M. Towards an integrated study of creative naming. IBM Research Report, 1980.",
      "doi": ""
    }
  ]
}