{
  "doi": "10.1145/800049.801756",
  "title": "Heuristics for designing enjoyable user interfaces: Lessons from computer games",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "63-68",
  "year": 1982,
  "badges": [],
  "abstract": "In this paper, I will discuss two questions: (1) Why are computer games so captivating? and (2) How can the features that make computer games captivating be used to make other user interfaces interesting and enjoyable to use? After briefly summarizing several studies of what makes computer games fun, I will discuss some guidelines for designing enjoyable user interfaces. Even though I will focus primarily on what makes systems enjoyable, I will suggest how some of the same features that make systems enjoyable can also make them easier to learn and to use.",
  "tags": [],
  "authors": [
    {
      "name": "Thomas W. Malone",
      "institution": "MIT Sloan School of Management, USA",
      "img": "/do/10.1145/contrib-81100548740/rel-imgonly/oct2010.jpg",
      "acmid": "81100548740",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Berlyne, D. E., (1965) Structure and direction in thinking. New York: John Wiley &amp; Sons.",
      "doi": ""
    },
    {
      "text": "Bricklin, D., &amp; Frankston, B. (1979). VisiCalc Computer Software Program. Sunnyvale, Calif.: Personal Software, Inc.",
      "doi": ""
    },
    {
      "text": "Carroll, J. M., &amp; Thomas, J. C. (1980). Metaphor and the cognitive representation of computing systems. Yorktown Heights, N.Y.: IBM Watson Research Center technical report no. RC 8302.",
      "doi": ""
    },
    {
      "text": "Dugdale, S. &amp; Kibbey, D. (1975). Fractions curriculum of the PLATO elementary school mathematics project. Computer-based Education Research Laboratory Technical report. University of Illinois, Urbana, Ill.",
      "doi": ""
    },
    {
      "text": "Fischer, G., Burton, R R., &amp; Brown, J. S. (1978). Aspects of a theory of simplification, debugging, and coaching. Proceedings of the Second Annual Conference of the Canadian Society for Computational Studies of Intelligence. Also available as Bolt Beranek and Newman, Inc. Technical report no. 3912 (ICAI Report No. 10), Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Halasz, F., &amp; Moran, T. P. (1982). Analogy considered harmful. Proceedings of the conference on Human Factors in Computer Systems, Gaithersburg, Maryland, March 15-17, 1982.  ",
      "doi": "10.1145/800049.801816"
    },
    {
      "text": "Macdonald, N. H., Frase, L. T., Gingrich, P. S., Keenan, S. A. (1982) The Writer's Workbench: Computer Aids for Text Analysis. IEEE Transactions on Communications, in press (January 1982).",
      "doi": ""
    },
    {
      "text": "Malone, T. W. (1980). What makes things fun to learn? A study of intrinsically motivating computer games. Ph.D. dissertation, Department of Psychology, Stanford University. Also available as technical report no. CIS-7 (SSL-80-11), Xerox Palo Alto Research Center, Palo Alto, Calif.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. (1981a). What makes computer games fun? Byte, 6, 258-277.",
      "doi": ""
    },
    {
      "text": "Malone, T. W. (1981b). Toward a theory of intrinsically motivating instruction. Cognitive Science 5, in press.",
      "doi": ""
    },
    {
      "text": "Piaget, J. (1951). Play, dreams, and imitation in childhood. New York: Norton.",
      "doi": ""
    }
  ]
}