{
  "doi": "10.1145/800049.801791",
  "title": "IBM system/38—an IBM usability experience",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "262-267",
  "year": 1982,
  "badges": [],
  "abstract": "Although advancing technology is making more and more complex systems available to the small-system user, the interface between the user and such systems cannot become correspondingly more complex. Instead, the interface must become easier to use so that more people can take advantage of the richer function. In the small business environment, in particular, it is crucial that new systems be usable by a customer's current staff and not require the addition of new and sophisticated data processing expertise. Personnel costs already comprise 45-50% of most data processing budgets (1). Much of the ease-of-use of smaller systems has been due to their limited function. The user has been able to learn to use the system interfaces because each interface involved only a few functions and the interfaces were few in number. Conversely, very large and complex systems have traditionally been programmed and managed by high powered, highly trained staffs with the resources and the sophistication to cope with complex challenges. Here too, however, the high cost and the limited availability of such people increase the need for ease-of-use breakthroughs(5).",
  "authors": [
    {
      "name": "David E. Peterson",
      "institution": "IBM Corporation, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332520560",
      "orcid": "missing"
    },
    {
      "name": "J Howard Botterill",
      "institution": "IBM Corporation, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100380865",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Crane, J. Trends in DP Budgets. Datamation, 1981, 27, No. 5, 140 ff.",
      "doi": ""
    },
    {
      "text": "Engel, S. E. and Granda, R.E. Guidelines for Man-machine Interfaces. *Poughkeepsie, NY: IBM Technical Report TR 00.270, 1975.",
      "doi": ""
    },
    {
      "text": "Martin, J. Design of Man-computer Dialogues, Englewood Cliffs, NJ: Prentice-Hall, 1973 ",
      "doi": "10.5555/574884"
    },
    {
      "text": "Paterson, D. E. Screen Design Guidelines. Small Systems World, 1979, 6, No. 8, 19 ff.",
      "doi": ""
    },
    {
      "text": "Runyan, L. and Schatz, W. Application Development. Datamation, 1981, 27, No. 3, 165 ff.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. Software Psychology. Cambridge, MA: Winthrop, 1980.",
      "doi": ""
    },
    {
      "text": "IBM System/38 Technical Developments, IBM Systems Library, order number G580-0237,",
      "doi": ""
    },
    {
      "text": "IBM System/38 System Introduction, IBM Systems Library, order number GC21-7728,",
      "doi": ""
    },
    {
      "text": "IBM System/38 Control Program Facility Concepts Manualt, IBM Systems Library, order number GC21-7729,",
      "doi": ""
    },
    {
      "text": "IBM System/38 Control Program Facility Programmer's Guides, IBM Systems Library, order number SC21-7730,",
      "doi": ""
    },
    {
      "text": "IBM System/38 Control Proqram Facility Reference Manual - Control Language, IBM Systems Library, order number SC21-7731,",
      "doi": ""
    },
    {
      "text": "IBM System/38 Control Program Facility Reference Manual - Data Description Specifications, IBM Systems Library, order number SC21-78706,",
      "doi": ""
    }
  ]
}