{
  "doi": "10.1145/800049.801809",
  "title": "The development of dialogue design guidelines for a computer based local information system to be used by the general public",
  "published": "1982-03-15",
  "proctitle": "CHI '82: Proceedings of the 1982 Conference on Human Factors in Computing Systems",
  "pages": "350-354",
  "year": 1982,
  "badges": [],
  "abstract": "A number of trends over the last twenty years have brought the prospect of instant computer power to the ordinary man and woman to near fruition. The arrival of interactive computing coupled with developments in the communications field have enabled man and computer to converse both at high speed and at long distance. Furthermore the decreasing cost of microprocessor hardware has made the acquisition of a computer or remote computer access, affordable by most establishments and many ordinary people. A need exists therefore, to develop usable software interfaces or man-computer dialogues to support this equipment. This abstract reports on an experiment which was carried out as part of a research project /5/ to investigate the use which was made of a computer access system, developed by the author, to provide local information to the public.",
  "tags": [],
  "authors": [
    {
      "name": "Martin Maguire",
      "institution": "Graphics Centre, The University, Leicester, England, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100314036",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Eason, K.D. The potential of computing for the public. Infotech State of the Art Report: The Non Expert User. September 1981.",
      "doi": ""
    },
    {
      "text": "Evans, C.R. What I have learned about computer communication and what computers have taught me about human communication. NATO ASI Conference on Man-Computer Interaction. September 1976.",
      "doi": ""
    },
    {
      "text": "Gaines, B.R. and Facey, P.V. Some experience in interactive system development and application. Proceedings of the IEEE, 1975, 63, 6, 894-911.",
      "doi": ""
    },
    {
      "text": "Innocent, P.R. An experimental approach to man-computer interaction research. MCI Research Group Report No. 15, Dept. of Mathematics, Statistics and Computing, Leicester Polytechnic, England, 1978.",
      "doi": ""
    },
    {
      "text": "Maguire, M.C. A study of the problems of man-computer dialogues for naive users. Author's Ph.D thesis, 1981. ",
      "doi": "10.5555/916357"
    },
    {
      "text": "Martin, J. Design of man-computer dialogues. Prentice-Hall, Englewood Cliffs, N.J. 1973. ",
      "doi": "10.5555/574884"
    },
    {
      "text": "Shneiderman, B. Human factors experiments in designing interactive systems. IEEE Computer, December 1979, 9-19.",
      "doi": "10.1109/MC.1979.1658571"
    }
  ]
}