{
  "doi": "10.1145/97243.97247",
  "title": "Measuring the true cost of command selection: techniques and results",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "19-26",
  "year": 1990,
  "badges": [],
  "abstract": "A technique that measures the impact of command selection on task time and errors is described. Users were timed while performing a drawing task, then while performing the same task with interpolated command selections. The difference between these times, consisting of both the time to select the command and to resume drawing, is the time cost of command selection. Several interface configurations were evaluated with this method including selected combinations of single mouse, two mice, voice and touch. Touch and voice input resulted in faster command selection times (approximately 1 sec) than any of the mouse conditions (approximately 3 sec).",
  "authors": [
    {
      "name": "Richard F. Dillon",
      "institution": "Department of Psychology, Carleton University, Ottawa, Canada K1S 5B6",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100023650",
      "orcid": "missing"
    },
    {
      "name": "Jeff D. Edey",
      "institution": "Department of Psychology, Carleton University, Ottawa, Canada K1S 5B6",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332497031",
      "orcid": "missing"
    },
    {
      "name": "Jo W. Tombaugh",
      "institution": "Department of Psychology, Carleton University, Ottawa, Canada K1S 5B6",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100561272",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Buxton, W. There's more to interaction than meets the eye: Some issues in manual input. In Norman, D.A. and Draper, S.W. (Eds), User centered system design: New perspectives on human computer interaction, Erlbaum, t-Iillsdale, NJ, 1986, pp. 319-337.",
      "doi": ""
    },
    {
      "text": "Buxton, W., and Myers, B.A. A study of two handed input. In Human Factors in Computing Systems. Proceedings of CHI '86, Boston, MA., April 13-17, ACM, New York, 1988, pp. 321-326.  ",
      "doi": "10.1145/22627.22390"
    },
    {
      "text": "Callahan, J,, Hopkins, D., Weiser, M., and Shneiderman, B. An empirical comparison of pie vs. linear menus. In Proceedings of CHI '88, Washington, DC., Mar 15-19, ACM, New York, 1988, pp. 95-100.  ",
      "doi": "10.1145/57167.57182"
    },
    {
      "text": "Card, S. K., Moran, T. P., and Newell, A. The psychology of human-computer interaction. Erlbaum, Hillsdale, NJ, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Potter, R. L., Weldon, L. J., and Shneiderman, B, Improving the accuracy of touch screens: An experimental evaluation of three strategies. In Proceedings of CHI '88, Washington, DC, May 15-19, ACM, New York, 1988, pp. 27-32. f  ",
      "doi": "10.1145/57167.57171"
    },
    {
      "text": "Shneiderman, B. Designing the user interface.\" Strategies for effective human-computer interaction. Addison-Wesley, Reading, MA., 1987. ",
      "doi": "10.5555/6682"
    },
    {
      "text": "Ware, C., and Mikaelian, H.H. An evaluation of an eye tracker as a device for computer input. Proceedings of Human Factors in Computing Systems and Graphics interface, Toronto, Canada, April 5-9, ACM, New York, 1988, pp. 183-188.  ",
      "doi": "10.1145/29933.275627"
    }
  ]
}