{
  "doi": "10.1145/97243.97301",
  "title": "Collaboration awareness in support of collaboration transparency: requirements for the next generation of shared window systems",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "303-311",
  "year": 1990,
  "badges": [],
  "abstract": "Shared window systems enable existing applications to be shared in the context of a real-time teleconference. The development and successful use of several such systems, albeit within limited user communities, testifies to the merits of the basic idea. However, experience to date has suggested a number of areas that have not been adequately addressed, namely: spontaneous interactions, shared workspace management, floor control, and annotation and telepointing. This paper focuses on the ramifications, for the software designer, of various user requirements in these areas. While the recommendations that result are motivated by the desire to enable continued use of collaboration-transparent applications, addressing them involves the development of systems software that is distinctly collaboration-aware.",
  "authors": [
    {
      "name": "J. Chris Lauwers",
      "institution": "Olivetti Research California, 2882 Sand Hill Road, Menlo Park, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100506915",
      "orcid": "missing"
    },
    {
      "name": "Keith A. Lantz",
      "institution": "Olivetti Research California, 2882 Sand Hill Road, Menlo Park, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100425740",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "S.R. Ahuja, J.R. Ensor, D.N. Horn, and S.E. Lucco. The Rapport multimedia conferencing system: A software overview. In Proc. 2ndlEEE Conference on Computer Workstations, pages 52-58. IEEE, March 1988.",
      "doi": ""
    },
    {
      "text": "S.R. Ahuja, J.R. Ensor, and S.E. Lucco. A comparison of application sharing mechanisms in real-time desktop conferencing systems. Technical report, AT&amp;T Bell Labs. Submitted for publication.",
      "doi": ""
    },
    {
      "text": "T. Crowley and H. Forsdick. MMConf: The Diamond multimedia conferencing system. In Proc. Groupware Technology Workshop. IFIP Working Group 8.4, August 1989.",
      "doi": ""
    },
    {
      "text": "S.B. Davidson. optimism and consistency in partitioned distributed database systems. A CM Transactions on Database Systems, 9(3;):456-481, September 1984.  ",
      "doi": "10.1145/1270.1499"
    },
    {
      "text": "Desktop Teleconferencing Group. Dialogo: A replicated shared window system. Technical report, Olivetti Research California, in preparation.",
      "doi": ""
    },
    {
      "text": "C. Egido. Videoconferencing as a technology to support j~oup work: A review of its failure. In Proc. CSCW 88 Conference on Computer-Supported Cooperative Work, pages 13-24. ACM, September 1988.  ",
      "doi": "10.1145/62266.62268"
    },
    {
      "text": "C. Elias, S.J. Gibbs, and G.L. Rein. Design and use of a group editor. In Proc. Working Conference on Engineering for Human-Computer Interaction. IFTP Working Group 2.7, August 1989.",
      "doi": ""
    },
    {
      "text": "D.C. Engelbart. NLS teleconferencing features: The Journal, and shared-screen telephoning. In Proc. Fall COMPCON, pages 173-176. IEEE, September 1975.",
      "doi": ""
    },
    {
      "text": "H.C. Forsdick. Exploration.,: in real-time multimedia corfferencing. In Proc. 2nd International Symposium on Computer Message Systems, pages 299-315. IFIP, September 1985.",
      "doi": ""
    },
    {
      "text": "G. Foster. Collaborative Systems andMulti-User Interfaces. PhD thesis, University of California- Berkeley, 1986. ",
      "doi": "10.5555/913292"
    },
    {
      "text": "JJ. Garcia Luna Aceves, EJ. Craighill, and R. Lang. Floor management and control for multimedia computer conferecning. In Proc. Multimedia '89\" 2nd international Workshop on Multimedia Communications. IEEE Communications Society, April 1989.",
      "doi": ""
    },
    {
      "text": "J. Grudin. Why CSCW applications fail: Problems in the design and evaluation of organizational interfaces. In Proc. CSCW 88 Conference\" on Computer-Supported Cooperative Work, pages 85-93. ACM, September 1988.  ",
      "doi": "10.1145/62266.62273"
    },
    {
      "text": "P. Gust. Personal communication. February 1989.",
      "doi": ""
    },
    {
      "text": "P. Gust. SharedX: X in a distributed group work environment. Presentation at the 2nd Annual X Conference, MaT, january 1988.",
      "doi": ""
    },
    {
      "text": "D.A. Henderson Jr. and S.K. Card. Rooms: The use of multiple virtual workspaces to reduce space contention in a window-based graphical user interface. ACM Transactions on Graphics, 5(13):211-243, July 1986.  ",
      "doi": "10.1145/24054.24056"
    },
    {
      "text": "B. Janssen. Personal communication. February 1988.",
      "doi": ""
    },
    {
      "text": "R. Kraut and C. Egido. Patterns of contact and communication in scientific research collaboration. In Proc. CSCW 88 Conference on Computer-Supported Cooperative Work, pages 1-12. ACM, September 1988.  ",
      "doi": "10.1145/62266.62267"
    },
    {
      "text": "K.A. Lantz. An experiment in integrated multimedia conferencing. In Proc. CSCW 86 Conference on Computer-Supported Cooperative Work, pages 267- 275. MCC Software Technology Program, December 1986. Reprinted in I. Greif (editor), Computer- Supported Cooperative Work: A Book of Readings, pages 533-552. Morgan Kaufmann Publishers, 1988. ",
      "doi": "10.1145/637069.637106"
    },
    {
      "text": "K.A. Lantz, J.C. Lauwers, B. Arons, C. Binding, P. Chen, J. Donahue, T.A. Joseph, R. Koo, A. Romanow, C. Schmandt, and W. Yamamoto. Collaboration technology research at Olivetti Research Center. In Proc, Groupware Technology Workshop. IFIP Working Group 8.4, August 1989.",
      "doi": ""
    },
    {
      "text": "J.C. Lauwers, T. Joseph, K.A. Lantz, and A. Romanow. Replicated architectures for shared window systems: A critique. Technical report, Olivetti Research California. Submitted for publication.",
      "doi": ""
    },
    {
      "text": "J.C. Lauwers and K.A. Lantz. Desktop teleconferencing and existing window systems: A poor match. Technical report, Olivetti Research California, in preparation.",
      "doi": ""
    },
    {
      "text": "S. Piccardi and F. Tisato. Conference Desk: An experiment and model for application sharing. Technical report, Systems Software Laboratory, Direzione Olivetti Ricerca - Milan, January 1989.",
      "doi": ""
    },
    {
      "text": "R.F. Rashid and G.G. Robertson. Accent: A communication oriented network operating system kernel. In Proc. 8th Symposium on Operating Systems Principles, pages 64-75. ACM, December 1981. Proceedings published as Operating Systems Review 15(5).  ",
      "doi": "10.1145/800216.806593"
    },
    {
      "text": "R.W. Root. Design of a multi-media vehicle for social browsing. In Proc. CSCW 88 Conference on Computer-Supported Cooperative Work, pages 25-38. ACM, September 1988.  ",
      "doi": "10.1145/62266.62269"
    },
    {
      "text": "S.K. Sarin and I. Greif. Software for interactive online conferences. In Proc. 2nd Conference on Office Information Systems, pages 46-58. ACM, June 1984.  ",
      "doi": "10.1145/800023.808333"
    },
    {
      "text": "S.K. Sarin and I. Greif. Computer-based real-time conferencing systems. Computer, 18(10):33-45, October 1985. Reprinted in I. Greif (editor), Computer- Supported Cooperative Work: A Book of Readings, pages 397-420. Morgan Kaufmann Publishers, 1988.  ",
      "doi": "10.1109/MC.1985.1662711"
    },
    {
      "text": "M. Stefik, D.G. Bobrow, G. Foster, S. Lanning, and D. Tatar. WYSIWIS revised: Early experiences with multiuser interfaces. ACM Transactions on Office Information Systems, 5(2):147-167, April 1987. Presented at the CSCW'86 Conference on Computer- Supported Cooperative Work, December 1986.  ",
      "doi": "10.1145/27636.28056"
    },
    {
      "text": "M. Stefik, G. Foster, D.G. Bobrow, K. Kahn, S. Lanning, and L. Suchman. Beyond the chalkboard: Computer support for collaboration and problem solving in meetings. Communications of the ACM, 30(1):32-47, January 1987. Reprinted in I. Greif (editor), Computer- Supported Cooperative Work: A Book of Readings, pages 335-366. Morgan Kaufmann Publishers, 1988.  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "M.M. Theimer. Preempiable Remote Execution Facilities for Loosely-coupled Distributed Systems. PhD thesis, Stanford University, 1986. ",
      "doi": "10.5555/913060"
    },
    {
      "text": "M.M. Theimer, K.A. Lantz, and D.R. Cheriton. Preemptable remote execution facilities for the V-System. In Proc. l Oth Symposium on Operating Systems Principles, pages 2-12. ACM, December 1985. Proceedings published as Operating Systems Review 19(5).  ",
      "doi": "10.1145/323627.323629"
    }
  ]
}