{
  "doi": "10.1145/97243.97307",
  "title": "Reflections on participatory design: lessons from the trillium experience",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "353-360",
  "year": 1990,
  "badges": [],
  "abstract": "In recent years system engineers, product designers, and human interface designers have become increasingly interested in developing ways of involving users in the design and evolution of computer-based systems. Some have turned for guidance and inspiration to an approach to systems design pioneered in Scandinavia and often referred to as Participatory Design. In this paper we examine the development of a computer-based design tool, Trillium, which on the surface looked like an example of Participatory Design in that users were directly involved in the development of the technology. Our analysis leads us to conclude, however, that Trillium's development departed in critical ways from our current model of Participatory Design and to suggest that the manner in which users are involved in the development effort plays an important role in the success of the endeavor.",
  "tags": [],
  "authors": [
    {
      "name": "Jeanette L. Blomberg",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100026565",
      "orcid": "missing"
    },
    {
      "name": "Austin Henderson",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA and Fitch RichardsonSmith, 10350 Olentangy River Road, Worthington, OH",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100433710",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bjerknes, G. and Bratteteig, T. Florence in Wonderland: Systems Development with Nurses, In Computers and Democracy, G. Bjerknes, P. Ehn, and M. Knyg (Eds.) Avebury, England, 1987, pp. 279-296.",
      "doi": ""
    },
    {
      "text": "Blomberg, J. L. Social Interaction and Office Communication: Effects on User's Evaluation of New Technologies, In Technology and the Transformation of White Collar Work, R. Kraut (Ed.) Lawrence Erlbaum Associates Pub., Hillsdale, New Jersey, 1987, pp. 195- 210.",
      "doi": ""
    },
    {
      "text": "Blomberg, J. L. The Variable Impact of Computer Technologies on the Organization of Work Activities, In Computer-Supported Cooperative Work: A Book of Reading, i. Greif (Ed.) Morgan Kaufman Pub., San Mateo, California, 1988, pp. 771-782. ",
      "doi": "10.5555/49504.49532"
    },
    {
      "text": "Bodker, S., Ehn, P., Kammersgaard, J., Kyng, M. and Sundblad, Y. A UTOPIAN Experience: On Design of Powerful Computer-based Tools for Skilled Graphic Workers, In Computers and Democracy G. Bjerknes, P. Ehn, and M. Knyg (Eds.). Avebury Pub. England, 1987, pp. 251-278.",
      "doi": ""
    },
    {
      "text": "Ehn, P. and Kyng, M. The Collective Resource Approach to Systems Design, In Computers and Democracy G. Bjerknes, P. Ehn, and M. Knyg (Eds.). Avebury Pub. England, 1987, pp. 17-57.",
      "doi": ""
    },
    {
      "text": "Ehn, P. Work-Oriented Design of Computer Artifacts. Almquist and Wiksell International Pub., Stockholm, Sweden, 1988. ",
      "doi": "10.5555/1102017"
    },
    {
      "text": "Ehn, P. and Kyng, M. Design by Doing, In Design as Action: Experiencing the Future J. Greenbaum and M. Kyng (Eds.). Lawrence Earlbaum Pub., Hillsdale, New Jersey, (forthcoming).",
      "doi": ""
    },
    {
      "text": "Ehn, P., Molleryd, B. and Sjogren, D. Playing in Reality, In Design as Action:~ Experiencing the Future J. Greenbaum and M. Kyng (Eds.). Lawrence Earlbaum Pub., Hillsdale, New Jersey, (forthcoming).",
      "doi": ""
    },
    {
      "text": "Floyd, C. Outline of a Paradigm Change in Software Engineering, In Computers and Democracy G. Bjerknes, P. Ehn, and M. Kyng (Eds.). Avebury Pub. England, 1987, pp. 191-210.",
      "doi": ""
    },
    {
      "text": "Floyd, C., Mehl, W., Reisin, F., Schmidt, G. and Wolf, G. Out of Scandinavia: Alternative Software Design and Development in Scandinavia, 1989, manuscript in possession of the author.",
      "doi": ""
    },
    {
      "text": "Floyd, C., Mehl, W., Reisin, F. and Schmidt, G. STEPS to Software Development with Users, In Proceeding of ESEC 1989: September 11-15, University of Warwick, Coventry, England. ",
      "doi": "10.5555/645382.651653"
    },
    {
      "text": "Henderson, D. A. Trillium: A Knowledge-based Design Environment for Control/Display Interfaces, (videotape presentation), CHI \"83 Human Factors in Computing System~, Boston, Massachusetts, 1983.",
      "doi": ""
    },
    {
      "text": "Henderson, D. A. The Trillium User Interface Design Environment, In Proceedings CHI '86 Human Factors in Computing Systems, M. Mantei and P. Orbeton (Eds.) April 13-17, 1986, pp. 221-227.  ",
      "doi": "10.1145/22627.22375"
    },
    {
      "text": "Kensing, F. Generating Visions: Future Workshops and Metaphorical Design, In Design as Action: Experiencing the Future, J. Greenbaum and M. Kyng (Eds.), Lawrence Earlbaum Pub., Hillsdale, New Jersey, 1989.",
      "doi": ""
    }
  ]
}