{
  "doi": "10.1145/97243.97314",
  "title": "Evaluating hypermedia systems (panel)",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "387-390",
  "year": 1990,
  "badges": [],
  "abstract": "Hypermedia systems provide online access to complex networks of information with the goal of making it easier to find and use information. To validate the utility of their systems, several researchers and system developers have attempted to collect evaluation data on the usability and effectiveness of their systems and the features in their systems. Because of the potential complexity of hypermedia systems and the information structures they may represent, a variety of evaluation measures and methods have been used. These trade off the need for timely feedback in the development of new technology, the difficulty of controlling one or two variables in systems with dozens or hundreds of components, and the goal of gaining an understanding of hypermedia systems.",
  "authors": [
    {
      "name": "Gary Perlman",
      "institution": "The Ohio State University, Department of Computer and Information Science, 2036 Neil Avenue, Columbus, OH",
      "img": "/do/10.1145/contrib-81100008387/rel-imgonly/gary.jpg",
      "acmid": "81100008387",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Campagnoni, IF. R. &amp; Ehrlich, K. (1991)) Information Retrieval Using a Hypertext-Based Help System, ACM Trans. Office Information Systems.  ",
      "doi": "10.1145/65943.65948"
    },
    {
      "text": "Egan, D. E. et al (1989) Behavioral Evaluation and Analysis of a Hypertext Browser, Proceedings of CHI'89.  ",
      "doi": "10.1145/67449.67490"
    },
    {
      "text": "Liebsclaer, P. &amp; Marchionini, G. (1988.)Browse and Analytical Search Strategies in a Full-Text CD-ROM Encyclopedia. School Library Media Quarterly, Summer, 223-233.",
      "doi": ""
    },
    {
      "text": "Marchionini, G. &amp; Slaneiderman, B. (1988) Finding Facts vs. Browsing Knowledge in Hypertext Systems, IEEE Computer.  ",
      "doi": "10.1109/2.222119"
    },
    {
      "text": "Marchionini, G. (1989) \"Evaluating Hyperrnedia-Based Learning.\" Presented at the NATO Advanced Research Workshop on Designing Hypertext / Hypermedia for Learning. Rottenburg, West Germany, July, 1989.",
      "doi": ""
    },
    {
      "text": "Marclaionini, G. (1989) Making the Transition from Print to Electronic Encyclopedias:Adaptation of Mental Models. Int'l Jl. of Man-Machine Studies, 30, 591-618.  ",
      "doi": "10.1016/S0020-7373%2889%2980012-4"
    },
    {
      "text": "Marchionini, G. (1989) Information-Seeking Strategies of Novices Using a Full.Text Electronic Encychgpedia. journal of the American Society for Information Science, 29(3), 165-176.  ",
      "doi": "10.5555/65193.65199"
    },
    {
      "text": "Nielsen, J. (1989a) Usability Engineering at a Discount. In G. Salvendy &amp; M. J. Smith (Eds.) Designing and Using Human-Computer interfaces and Knowledge Based Systems, Amsterdam: Elsevier Science, 394-401. ",
      "doi": "10.5555/92449.92499"
    },
    {
      "text": "Nielsen, J. (198919) The Matters that Really MatterforHypertext Usability. Proc. ACM Hypertext'89, 239-248.  ",
      "doi": "10.1145/74224.74244"
    },
    {
      "text": "Nielsen, J. &amp; Lyngbaek, U. (1989) Two Field Studies of Hypermedia Usability. Proc. Hypertext'2 Conf. 29-30.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. &amp; Molich, R. (1990) Heuristic Evaluation of User Interfaces. Proc. ACM CHI'90.  ",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Perlman, G. (1989)Asynchronous Design/Evaluation Methods for Hypertext TechnoLogy Development. Proceedings of ACM IIypertext'89, 61-81.  ",
      "doi": "10.1145/74224.74230"
    }
  ]
}