{
  "doi": "10.1145/97243.97308",
  "title": "The organizational implementation of an electronic meeting system: an analysis of the innovation process",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "361-368",
  "year": 1990,
  "badges": [],
  "abstract": "Electronic Meeting Systems (EMS) are slowly moving out of university environments into work organizations. They constitute an innovative method of supporting group meetings. This paper reports on the innovation process in one organization that has recently adopted and implemented an EMS. The paper traces the innovation process through four stages: conception of an idea: proposal; decision to adopt; and implementation. Important factors from the innovation literature are considered as explanators of the innovation process involving EMS in this particular organization.",
  "tags": [],
  "authors": [
    {
      "name": "Joey F. George",
      "institution": "Department of Management Information Systems, University of Arizona, Tucson, Arizona",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100355984",
      "orcid": "missing"
    },
    {
      "name": "Joseph S. Valacich",
      "institution": "Department of Management Information Systems, University of Arizona, Tucson, Arizona",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81451600886",
      "orcid": "missing"
    },
    {
      "name": "Jay F. Nunamaker",
      "institution": "Department of Management Information Systems, University of Arizona, Tucson, Arizona",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452618152",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benbasat, i., Goldstein, D.K., and Mead, M. The case research strategy in studies of information systems.\" MIS Quarterly, 11, 3 (September 1987), 369-386.  ",
      "doi": "10.2307/248684"
    },
    {
      "text": "Daft, R.L. A dual-core model of organizational innovation. Academy of Management Journal, 21, 2 (June 1978), 193-210.",
      "doi": ""
    },
    {
      "text": "Dennis, A.R., George, J.F., Jessup, L.M., Nunamaker, J.F., Jr., and Vogel, D.R. Information technology to support electronic meetings. MIS Quarterly, 12, 4 (December 1988), 591-624.  ",
      "doi": "10.5555/58996.59001"
    },
    {
      "text": "Dennis, A.R., Heminger, A.R., Nunamaker, J.F., Jr., and Vogel, D.R. Bringing automated support to large groups: the Burr-Brown experience. Information and Management, in press.  ",
      "doi": "10.1016/0378-7206%2890%2990065-P"
    },
    {
      "text": "DeSanctis, G. and Dickson, G.W. GDSS software: a \"shell\" system in support of a program of research. Proceedings of the Twentieth Annual Hawaii International Conference on System Sciences (Kona-Kailua, Hawaii, January 1987).",
      "doi": ""
    },
    {
      "text": "Downs, G.W., Jr. and Mohr, L.B. Conceptual issues in the study of innovation. Administrative Science Quarterly, 21 (December 1976), 700-714.",
      "doi": ""
    },
    {
      "text": "Fischer, W.A. Scientific and technical information and the performance of R&amp;D groups. TIMS Studies in the Management Sciences, 15 (1980), 67-89.",
      "doi": ""
    },
    {
      "text": "Gallupe, R.B. The Impact of Task Difficulty on the Use of a Group Decision Support System. Unpublished Ph.D. dissertation, University of Minnesota, 1985.",
      "doi": ""
    },
    {
      "text": "Gallupe, R.B., DeSanctis, G., and Dickson, G.W. Computer-based support for group problem finding: an experimental investigation. MIS Quarterly, 12, 2 (June 1988), 277-296.  ",
      "doi": "10.2307/248853"
    },
    {
      "text": "Gibson, D.V. and Ludl, E.J. Exex:utive group decision support systems considered at three levels of analysis. DSS-88 (1988), 26-38.",
      "doi": ""
    },
    {
      "text": "Gutek, B.A. Work group structure and information technology: a structural contingency approach. In intellectual Teamwork: The Social and Technical Bases of Coq~erative Work, J. Galegher, R.E. Kraut, and C. Egido, Eds. Lawrence Erlbaum, inc., Hillsdale, N.J., 1989. ",
      "doi": "10.5555/117848.117851"
    },
    {
      "text": "Huber, G.P~ The nature and design of post-industrial organizations. Management Science, 30, 8 (1984), 928-951.",
      "doi": "10.1287/mnsc.30.8.928"
    },
    {
      "text": "Hymowitz, C. A survival guide to the office meeting. Wall Street Journal (June 21, 1988), 35.",
      "doi": ""
    },
    {
      "text": "Jarvenpaa, S.L., Rao, V.S. and Huber. G.P. Computer support for meetings of groups working on unstructured problems: a field expe~fment. MIS Quarterly, 12, 4 (1988), 645-666.  ",
      "doi": "10.5555/58996.59003"
    },
    {
      "text": "Kimberly, J.R. and Evanisko, M.j. Organizational innovation: the influence of individual, organizational, and contextual factors on ho:;pital adoption of technological and administrative innovations. Academy of Management Journal, 24, 4 (1981), 689-713.",
      "doi": ""
    },
    {
      "text": "Kraemer, K.L. and King, J.L. Computer-based systems for cooperative work. Computing Surveys, 20, 2 (June 1988), 115-146.  ",
      "doi": "10.1145/46157.46158"
    },
    {
      "text": "Leonard-Barton, D. and Deschamps, I. Managerial influence in the implementation of new technology. Management Science, 34, 10 (October, 1988), 1252- 1265.  ",
      "doi": "10.5555/2838379.2838386"
    },
    {
      "text": "Lewis, F.L. Facilitator: A Micro Computer Decision Support Systems for Small Groups. Unpublished Doctoral Dissertation, University of Louisville, 1982.",
      "doi": ""
    },
    {
      "text": "Meyer, A.D. and Goes, J.B. Organizational assimilation of innovations: a multilevel contextual analysis. Academy of Management Journal, 31, 4 (1988), 897- 923.",
      "doi": ""
    },
    {
      "text": "Mosvick, R.K. and Nelson, R.B. We've Got to Start Meeting Like Tlu's. Scott Foresman and Co., New York, 1987.",
      "doi": ""
    },
    {
      "text": "Nunamaker Jr., j.F., Applegate, L.M., and Konsynski, B.R. Facilitating group creativity with GDSS. Journal of Management Information Systems, 3, 4 (Spring 1987), 5-19. ",
      "doi": "10.1080/07421222.1987.11517775"
    },
    {
      "text": "Nunamaker, J.F., Jr., Vogel, D.R., Heminger, A., Martz, B., Grohowski, R., and McGoff, C. Experiences at IBM with group suppport systems: a field study. Decision Support Systems (1989).",
      "doi": ""
    },
    {
      "text": "Steeb, R., and Johnston, S.C. A computer-based interactive system for group decisionmaking. IEEE Transactions on Systems, Man, and Cybernetics, SMC-11, 8 (August 1981), 544-552.",
      "doi": ""
    },
    {
      "text": "Stefik, M., Foster, G., Bobrow, D.G., Khan, K., Lanning, S., and Suchman, L. Beyond the chalkboard: computer support for collaboration and problem solving in meetings. Commun. ACM, 30, 1 (January 1987), 33-47.  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "Thompson, J.D. Organizations in Action. McGraw- Hill, New York, 1967.",
      "doi": ""
    },
    {
      "text": "Turoff, M. and Hiltz, S.R. Computer support for group versus individual decisions. IEEE Transactions on Communications, 30, 1 (January 1982), 82-91.",
      "doi": ""
    },
    {
      "text": "Vogel, D.R. and Nunamaker, J.F., Jr. Health service group use of automated planning support. Administrative Radiology (September, 1988).",
      "doi": ""
    },
    {
      "text": "Yin, R.K. Case Study Research: Design and Methods. Sage Publications, Beverly Hills, CA, 1989.",
      "doi": ""
    },
    {
      "text": "Watson, R., DeSanctis, G. and Poole, M.S. Using a GDSS to facilitate group consensus: some intended and unintended consequences. MIS Quarterly, 12, 3 (1988), 463-478.  ",
      "doi": "10.2307/249214"
    },
    {
      "text": "Zigurs, I, Poole, M.S., and DeSanctis, G.L. A study of influence in computer-mediated group decision making. MIS Quarterly, 12, 4 (December 1988), 625-644.  ",
      "doi": "10.5555/58996.59002"
    },
    {
      "text": "Zmud, R.W. An examination of \"push-pull\" theory applied to process innovation in knowledge work. Management Science, 30, 6 (June 1984), 727-738.",
      "doi": "10.1287/mnsc.30.6.727"
    }
  ]
}