{
  "doi": "10.1145/97243.97245",
  "title": "A gaze-responsive self-disclosing display",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "3-10",
  "year": 1990,
  "badges": [],
  "abstract": "An information display system is described which uses eye-tracking to monitor user looking about its graphics screen. The system analyzes the user's patterns of eye movements and fixations in real-time to make inferences about what item or collection of items shown holds most relative interest for the user. Material thus identified is zoomed-in for a closer look, and described in more detail via synthesized speech.",
  "tags": [],
  "authors": [
    {
      "name": "India Starker",
      "institution": "Cognition Corporation, 755 Middlesex, Turupike, Billerica, Massachusetts",
      "img": "/do/10.1145/contrib-81100183475/rel-imgonly/indiastarker120p.jpg",
      "acmid": "81100183475",
      "orcid": "missing"
    },
    {
      "name": "Richard A. Bolt",
      "institution": "The Media Laboratory, Massachusetts Institute of Technology, Cambridge, Massachusetts",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100653961",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Berlyne, D. E. Curiosity and explanation. Scier~ce, 153 (1966), 25-33.",
      "doi": ""
    },
    {
      "text": "Berlyne, 13. E. The influence of complexity and novelty in visual figures on orienting responses. Journal of Experimental Psychology, 55 (1958}, 289-296.",
      "doi": ""
    },
    {
      "text": "Bolt, R. A. The human interface. Van Nostrand Reinhold, New York, 1984.",
      "doi": ""
    },
    {
      "text": "Bolt, R. A. Gaze-orchestrated dynamic windows. In Proceedings of A CM SIGGRAPH Computer Graphics Conference (Dallas, Texas, August 3- 7). ACM, New York, 1981, pp. 109-119.  ",
      "doi": "10.1145/800224.806796"
    },
    {
      "text": "Chandler, D. L. \"Breaking the shackles of disability.\" Bosto~ Globe newspaper, Boston MA, Technology Section, February 6, 1989, p. 31-32.",
      "doi": ""
    },
    {
      "text": "Elmer-DeWitt, P. Into the wild blue (digital) yonder. TIME, August 1, 1988, 62-3.",
      "doi": ""
    },
    {
      "text": "Jonides, J. Voluntary versus automatic control over the mind's eye's movement. In John Long and Alan Baddeley (Eds.), Attention and Performance IX. Lawrence Erlbaum Associates, Hillsdale, New Jersey, 1981.",
      "doi": ""
    },
    {
      "text": "Just, M. A. and P. A. Carpenter. The role of eye-fixation research in cognitive psychology. Behavior Research Methods and Instrumentation, 8, 2 (1976), 139-143.",
      "doi": ""
    },
    {
      "text": "Kahneman, D. Attention and effort. Prentice- Hall, Englewood Cliffs, New Jersey, 1973.",
      "doi": ""
    },
    {
      "text": "Kleinke, G. L. Gaze and eye contact: a research review. Psychological Bulletin, 100, 1 (1986}, 78-100.",
      "doi": ""
    },
    {
      "text": "Loftus, G. R. and N. H. Macworth. Cognitive determinants of fixation location during picture viewing. Journal of Experimental Psychology, $, 4 (1978), 565-572.",
      "doi": ""
    },
    {
      "text": "McGonkie, G. W., D. Zola, G. S. Wolverton, and D. D. Burns. Eye movement contingent display control in studying reading. Behavior Research Methods ?~ Instrumentation, 10, 2 (1978), 154-166.",
      "doi": ""
    },
    {
      "text": "McGowa~a, J. The eyegaze computer. Occupational Therapy Forum (Atlantic Edition), Vol. III, No. 47, week of November 21, 1988, 1-5.",
      "doi": ""
    },
    {
      "text": "McKeown, K. R. Discourse strategies for generating natural-language text. In Barbara J. Grosz, Karen Speck Jones, and Bonnie Lynn Webber (eds.), Readings in Natural Language Processing. Morgan Kaufmann publishers, Inc., Los Altos, CA, 1986. 479-500. ",
      "doi": "10.5555/21922.24351"
    },
    {
      "text": "Posner, Michael I. Orienting of attention. Quarterly Journal of Experimental Psychology, S~ (1980), 3-25.",
      "doi": ""
    },
    {
      "text": "Rinard, G. A. and E. E. Rugg. Current state of development and testing of an ocular control device. Proceedings of S th Conference on Systems and Devices for the Disabled, Seattle, Washington, June 1977.",
      "doi": ""
    },
    {
      "text": "Rogers, M. \"More than wheelchairs.\" Newsweek magazine, April 24, 1989, p. 66-67.",
      "doi": ""
    },
    {
      "text": "Starker, B. E. I. A Gaze-Directed Graphic~ World with Synthesized Narration. Unpublished master's thesis, Massachusetts Institute of Tech. nology, 1989.",
      "doi": ""
    },
    {
      "text": "Steinman, R. Role of eyemovements in m~inraining a phenomenally clear and stable world. In Richard A. Monty and John W. Senders (Eds.), Eyemovements and psychological processes. Lawrence Erlbaum Associates, Hillsdale, New Jersey, 1976.",
      "doi": ""
    },
    {
      "text": "Tello, E. R. Between man and machine. BYTE, 13, 9 (September, 1988), 288-293. ",
      "doi": "10.5555/47589.47599"
    },
    {
      "text": "Vaughn, J. Control of visual fLxations in visual search. In: Senders, John W., Dennis F. Fisher, and Richard A. Monty (eds.), Eye Movements and the Higher Psychological Functions. Lawrence Erlbaum Associates, Hillsdale, New Jersey, 1978.",
      "doi": ""
    },
    {
      "text": "Ware, G. and H. H. Mikaelian. An evaluation of a~ eye tracker as a device for computer input. In Proceedings of CHI ~ GI '87 Human Factors in Computing Systems (Toronto, Canada, April 5-9, 1987), ACM press, pp. 183-188.  ",
      "doi": "10.1145/29933.275627"
    },
    {
      "text": "Y~rbus, A. L. Eyemovements and vision. Translated by B. Haigh. Plenum Press, New York, 1967.",
      "doi": ""
    }
  ]
}