{
  "doi": "10.1145/97243.97270",
  "title": "Tools for interaction with the creative process of composition",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "167-174",
  "year": 1990,
  "badges": [],
  "abstract": "This paper explores the nature of creative composition particularly as it applies to dance, and describes the development of interactive computer based tools to assist the composer. The hierarchical nature of the composition process calls for an interface which allows the composer the flexibility to move back and forth between alternate views and conceptual levels of abstraction.\nCOMPOSE, an interactive system for the composition of dance has been implemented on Silicon Graphics and Apple workstations. The user visually composes in space and in time using menus of postures and sequences. Paths can be edited and an animation of the dance composition allows the final result to be evaluated.",
  "authors": [
    {
      "name": "T. Schiphorst",
      "institution": "Centre for Systems Science, Simon Fraser University, Burnaby, BC, V5A 1S6, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409594757",
      "orcid": "missing"
    },
    {
      "name": "T. Calvert",
      "institution": "Centre for Systems Science, Simon Fraser University, Burnaby, BC, V5A 1S6, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100552470",
      "orcid": "missing"
    },
    {
      "name": "C. Lee",
      "institution": "Centre for Systems Science, Simon Fraser University, Burnaby, BC, V5A 1S6, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332511392",
      "orcid": "missing"
    },
    {
      "name": "C. Welman",
      "institution": "Centre for Systems Science, Simon Fraser University, Burnaby, BC, V5A 1S6, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414615349",
      "orcid": "missing"
    },
    {
      "name": "S. Gaudet",
      "institution": "Centre for Systems Science, Simon Fraser University, Burnaby, BC, V5A 1S6, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100156998",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akin, O. How Do Architects Design? In A/and Pattern Recognition in Computer Aided Design, ed. Latombe, IFIP, North-Holland, 65-103, 1978.",
      "doi": ""
    },
    {
      "text": "Brightman P., Making dances with algorithms: Towards a theory of choreography, based on the the use of computer programs and Laban concepts, M.A. Thesis, Columbia University, 1984.",
      "doi": ""
    },
    {
      "text": "Bruderlin, A. and Calvert, T.W. Goal-Directed, Dynamic Animation of Human Walking, Computer Graphics (SIGGRAPH 89), vol. 23, (July, 1989), pp. 233-242.  ",
      "doi": "10.1145/74334.74357"
    },
    {
      "text": "Buxton, W., Lamb, M.R., Sherman, D., and Smith, K.C. Towards a Comprehensive User Interface Management System. Computer Graphics 17, 3, 35-42.  ",
      "doi": "10.1145/964967.801130"
    },
    {
      "text": "Calvert, T.W., Welman, C., Gaudet, S., and Lee, C. 1989. Composition of Multiple Figure Sequences for Dance and Animation. New Advances in Computer Graphics (CG International Conf.), pp. 245-255, June 1989.",
      "doi": ""
    },
    {
      "text": "Calvert, T.W., Towards a language for human movement, Computers and the Humanities, 20:2, (1986), pp. 35-43.",
      "doi": ""
    },
    {
      "text": "Calvert, T.W., Chapman, J. and Patla, A., Aspects of the Kinematic Simulation of human movement, IEEE Computer Graphics and Applications, vol. 2, (Nov. 1982), 41- 50.",
      "doi": "10.1109/MCG.1982.1674484"
    },
    {
      "text": "Calvert, T.W., Chapman, J. and Patla, A., The integration of subjective and objective data in animation of human movement, Computer Graphics, 14, (1980),198- 203.  ",
      "doi": "10.1145/965105.807492"
    },
    {
      "text": "Card, S., Moran, T., and Newell, A., The Psychology of Human-Computer Interaction. Lawrence Erlbaum Assoc., Hillsdale, N.J. 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Green, M., Directions for User Interface Systems Research. Computer Graphics 21, 2, (1987), 113-116.  ",
      "doi": "10.1145/24919.24927"
    },
    {
      "text": "Hartson, H.R., and Hix, D., Human-Computer Interface Development: Concepts and Systems. ACM Computing Surveys 21, 1, (1989), 5-92.  ",
      "doi": "10.1145/62029.62031"
    },
    {
      "text": "Havens, W.S. Platypus: A Constraint-Based Reasoning System. Proc. 1989 lnt. Joint Conf. (1989), 5.",
      "doi": ""
    },
    {
      "text": "Lansdown, J., Computer Choreography and Video, in Computing in the Humanities, S. Lusignan and J.S. North (eds), University of Waterloo Press, 1977, pp. 241-252.",
      "doi": ""
    },
    {
      "text": "Lee, C., A New Way to Make Dances, Dance in/au Canada, 55, (Spring 1988), 16-23.",
      "doi": ""
    },
    {
      "text": "Lindhult, M.S. Towards an Intuitive Computer- Aided Design Process. Proc. 1987 Conf. on Planning and Design in Architecture. ASME. (1987), 41-46.",
      "doi": ""
    },
    {
      "text": "Pylyshyn, Z. The design process: lecture notes, Precarn Workshop, 1989.",
      "doi": ""
    },
    {
      "text": "Ridsdale, G. ,Hewitt, S. and Calvert,T., The interactive specification of human animation, in Proc. Graphics interface 86 Conference,, Vancouver, (May, 1986), pp. 121-130 ",
      "doi": "10.5555/16564.16586"
    },
    {
      "text": "Schiphorst, T., Composing Compositional Systems, unpublished paper, Graphics Research Group, Simon Fraser University, 1989",
      "doi": ""
    },
    {
      "text": "Simon, H.A., The Sciences of the Artificial, MIT Press, Cambridge, MA., 1969. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "Tomiyama, T., and Yoshikawa, H. Requirements and principles for intelligent CAD systems. Proc. IFIP WG 5.2 Working Conference. Amsterdam, North-Holland. (1984), 1-28.",
      "doi": ""
    },
    {
      "text": "Truax, B., A communicational approach to computer sound programs, Journal of Music Theory, 20, :2, (1976).",
      "doi": ""
    }
  ]
}