{
  "doi": "10.1145/97243.97253",
  "title": "Adaptive semantic snaping—a technique for semantic feedback at the lexical level",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "65-70",
  "year": 1990,
  "badges": [],
  "abstract": "This paper describes the implementation of semantic snapping — an interaction technique that provides semantic feedback at the lexical level while dragging a graphical object on the screen. Like conventional snapping, or gravity fields, semantic snapping includes a geometric component where objects in close proximity are drawn together or “snap” into position. However, semantic snapping goes further by allowing non-geometric (semantic) properties of objects to place additional constraints on snapping. Semantic snapping also provides more complex lexical feedback which reflects potential semantic consequences of a snap. This paper motivates the use of semantic snapping and describes how this technique has been implemented in a window-based toolkit. This implementation works in an adaptive manner to provide the best interactive response in situations where semantic tests are very time consuming and strain the limits of acceptable performance.",
  "tags": [],
  "authors": [
    {
      "name": "Scott E. Hudson",
      "institution": "Department of Computer Science, University of Arizona, Tucson, AZ",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    }
  ],
  "references": [
    {
      "text": "Bier, E., Stone, C., Snap-Dragging, Computer Graphics, v20, n4, August 1986, pp. 233-240.  ",
      "doi": "10.1145/15886.15912"
    },
    {
      "text": "Bier, E., Skitters and Jacks: Interactive 3D Positioning Tools. Proceedings of the ACM SIGGRAPH Workshop on Interactive 3D Graphics, Chapel Hill, NC, October 1986, pp. 183-196.  ",
      "doi": "10.1145/319120.319135"
    },
    {
      "text": "Bier, E., Snap-Dragging: Interactive Geometric Design in Two and Three Dimensions, University of California, Berkeley, Technical Report UCB/CSD 88/416, April 1988. ",
      "doi": "10.5555/894824"
    },
    {
      "text": "Boming, A., Defining Constrainls Graphically, Proceedings of CHI '86, Boston, April 1986, pp. 137-143.  ",
      "doi": "10.1145/22627.22362"
    },
    {
      "text": "Cardelli, L., Building User Interfaces by Direct Manipulation, Proceedings of the ACM SIGGRAPH Symposium on User Interface Software, Banff, Alberta, Canada, October 1988, pp. 152-166.  ",
      "doi": "10.1145/62402.62428"
    },
    {
      "text": "Fitts, P., The Information Capacity of the Human Motor System in Controlling the Amplitude of Movement, Journal of Experimental Psychology, v 47, June 1954, pp. 381-391.",
      "doi": ""
    },
    {
      "text": "Goldberg, A., Robson, D., Smalltalk-80.\" The Language and its Implementation, Addison- Wesley, Reading, Mass., 1983. ",
      "doi": "10.5555/273"
    },
    {
      "text": "Hudson, S., Graphical Specification of Flexible User Interface Displays, Proceedings of the ACM SIGGRAPH Symposium on User interface Software and Technology, November 1989, pp. 105-114.  ",
      "doi": "10.1145/73660.73673"
    },
    {
      "text": "HutcMns, E., Hollan, J., Norman, D., Direct Manipulation Interfaces, in User Centered Systems Design, D. Norman and S. Draper (ed), Lawrence Erlboum Associates, Hillsdale, New Jersey, 1986, pp. 87-124.",
      "doi": ""
    },
    {
      "text": "Linton, M., Vlissides, J., Calder, R., Composing User Interfaces with InterViews, IEEE Computer, v22, n2, February 19 89, pp. 8-22.  ",
      "doi": "10.1109/2.19829"
    },
    {
      "text": "McCormack, J., Asente, P., An Overview of the X Toolkit, Proceedings of the ACM SIGGRAPH Symposium on User Interface Software, Banff, Alberta, Canada, October 1988, pp. 46-55.  ",
      "doi": "10.1145/62402.62407"
    },
    {
      "text": "Myers, B., Buxton, W., Creating Highly- Interactive Graphical User Interfaces by Demonstration, Computer Graphics, v20, n4, August 1986, pp. 249-258.  ",
      "doi": "10.1145/15886.15914"
    },
    {
      "text": "Myers, B., Vander Zanden, B., Dannenberg, R., Creating Graphical Interactive Application Objects by Demonstration, Proceedings of the A CM SIGGRAPH Symposium on User Interface Software and Technology, November 1989, pp. 95-104.  ",
      "doi": "10.1145/73660.73672"
    },
    {
      "text": "Sheridan, T., Ferrell, W., Remote Manipulative Control With Transmission Delay, IEEE Transactions on Human Factors in Electronics, vHFE-4, nl, September 1963, pp. 25-29.",
      "doi": ""
    }
  ]
}