{
  "doi": "10.1145/97243.97323",
  "title": "Designing casual-user hypertext: the CHI'89 InfoBooth",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "451-458",
  "year": 1990,
  "badges": [],
  "abstract": "An interactive electronic information kiosk was created for the CHI '89 conference. Based on Macintosh® technology, the “InfoBooth” included a custom HyperCard® interface built by a team at Apple Computer.\nThe design was initiated by examining the desires of potential users. Design changes, influenced by the results of informal user testing, were numerous. During the conference, user actions were recorded using an embedded “trace” program to allow for later usage assessment.\nThis paper offers a case study for designers of similar systems. Aspects of the pre-conference design evolution are described. The impact of user testing is discussed and findings from the analysis of the trace data are presented.",
  "authors": [
    {
      "name": "Gitta B. Salomon",
      "institution": "Human Interface Group/ATG, Apple Computer, Inc., 20525 Mariani Blvd., MS 76-3H, Cupertino, California",
      "img": "/do/10.1145/contrib-81408600569/rel-imgonly/gittabiopic.jpg",
      "acmid": "81408600569",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akscyn, R.M., McCracken, D.L. and Yodcr, E.A. KMS: A Distributed Hypermedia Sysmm for Managing Knowledge in Organizations. Comm. of the ACM. 31, 7 (July 1988), 820-835.]]  ",
      "doi": "10.1145/48511.48513"
    },
    {
      "text": "Baucrsfcld, P.F. Multimedia Input at the CHI '89 Photobooth. Confidential Apple Technical Report. October 1989.]]",
      "doi": ""
    },
    {
      "text": "CHI '89 attendee questionnaire. 1989.]]",
      "doi": ""
    },
    {
      "text": "Conklin, J. Hypenext: An Introduction and Survey. IEEE Computer. 20, 9 (Sept. 1987), 17-41.]]  ",
      "doi": "10.1109/MC.1987.1663693"
    },
    {
      "text": "Gould, J.D., Boies, S.J., Levy S., Richards, J.T. and Schoonard, J. The 1984 Olympic Message System: A Test of Behavioral Principles of System Design. Comm. of the ACM. 30, 9 (Sept. 1987), 758-769.]]  ",
      "doi": "10.1145/30401.30402"
    },
    {
      "text": "Gould, J.D. and Lewis, C. Designing for Usability: Key Principles and What Designers Think. Comm. of the ACM. ~, 3 (March 1985), 300-311.]]  ",
      "doi": "10.1145/3166.3170"
    },
    {
      "text": "Hardman, L. Evaluating the Usability of the Glasgow Online Hylx:rtext. Hypermedia. 1, 1 (Spring 1989), 34- 63.]] ",
      "doi": "10.5555/63378.66843"
    },
    {
      "text": "Human Interface Guidelines: The Apple Desktop Interface. Apple Computer, Inc. 1987.]] ",
      "doi": "10.5555/1207530"
    },
    {
      "text": "Husic, F. A Preliminary Investigation of Navigation Patterns in the CHI '89 Kiosk. Confidential Apple Technical Report. October 1989.]]",
      "doi": ""
    },
    {
      "text": "Macintosh~ HyperCard~ User's Guide. Apple Computer, Inc. 1987.]]",
      "doi": ""
    },
    {
      "text": "Kreitman, K. MacWorld Information Kiosk: Visual Metaphors for Accessing information. Videotape pre sented at CHI '88.]]",
      "doi": ""
    },
    {
      "text": "Ledgard, H.F. An Outstanding Example. PC Tech Journal. 5, 7 (July 1987), 193-194.]]",
      "doi": ""
    },
    {
      "text": "Salomon, G., Oren, T., and Kreitman, K. Using Guides to Explore Multimedia Databases in Proc. of the Twenty.Second Annual Hawaii International Conference on System Science. (Kailua-Kona, Hawaii, Jan. 3-6, 1989), IEEE Computer Society Press, vol. 4, pp. 3-11.]]",
      "doi": ""
    }
  ]
}