{
  "doi": "10.1145/97243.97258",
  "title": "Human computer interaction group, University of York, U.K. (lab review)",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "85-86",
  "year": 1990,
  "badges": [],
  "abstract": "Staff in the Departments of Computer Science and Psychology at the University of York have been cooperating in interdisciplinary research since 1983. The mainstream of York's approach is to apply theory developed in these parent disciplines to HCI design. Our goal is to integrate formal and empirical methods. By formal methods we mean mathematical models that are capable of capturing properties of a user interface. By empirical methods we mean the observation and measurement of user behaviour. Integration of these two approaches is achieved by an iterative design process in which formal models are successively refined by testing their predictions against the results of user trials.",
  "authors": [
    {
      "name": "Michael Harrison",
      "institution": "Departments of Computer Science and Psychology, University of York, Heslington York, YO1 5DD, U.K.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100011121",
      "orcid": "missing"
    },
    {
      "name": "Andrew Monk",
      "institution": "Departments of Computer Science and Psychology, University of York, Heslington York, YO1 5DD, U.K.",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100473970",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barnard, P. &amp; Harrison, M. Integrating cognitive and system models in HC/, in People and Computers V, Sutcliffe &amp; Macaulay Ed., Cambridge University Press. (1989) pp. 87-104. ",
      "doi": ""
    },
    {
      "text": "Edwards, A.D.N. Soundtrack: an auditory interface for blind users. Human Computer Interaction 4,1 (1989), 45-66,",
      "doi": "10.1207/s15327051hci0401_2"
    },
    {
      "text": "Hammond, N.V. &amp; Allinson, L. Travels around a learning support environment: rambling, orienteering or touring? Proc. CHI'88 conference on Human Factors in Computing Systems (Washington, 1988) ACM Press pp. 269-273.  ",
      "doi": "10.1145/57167.57212"
    },
    {
      "text": "Harrison, M.D., Roast, C.R. &amp; Wright, P.C. Complementary methods for the design of interactive systems,Designing and using human-computer interfaces and knowledge based systems, Salvendy, &amp; Smith Ed., Elsevier.(1989) pp. 651-658. ",
      "doi": "10.5555/92449.92532"
    },
    {
      "text": "Took, R.K. Surface interaction: a paradigm and model for separating application and interface, Proc. CH1'90 conference proceedings(Seattle, 1990) ACM Press.  ",
      "doi": "10.1145/97243.97249"
    },
    {
      "text": "Wright, P. and Monk, A. F. Evaluation for design. In People and Computers It, Sutcliffe. &amp; Macaulay. Ed., Cambridge University Press. (1989) pp. 345- 358. ",
      "doi": ""
    }
  ]
}