{
  "doi": "10.1145/97243.97313",
  "title": "Interactive systems group—University of Oregon, department of computer and information science (lab review)",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "385-386",
  "year": 1990,
  "badges": [],
  "abstract": "No abstract available.",
  "authors": [
    {
      "name": "Sarah A. Douglas",
      "institution": "Department of Computer and Information Science, University of Oregon, Eugene, Oregon",
      "img": "/do/10.1145/contrib-81330490449/rel-imgonly/sarah_douglas.jpg",
      "acmid": "81330490449",
      "orcid": "missing"
    },
    {
      "name": "Gary W. Meyer",
      "institution": "Department of Computer and Information Science, University of Oregon, Eugene, Oregon",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339516843",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bowden, E., Douglas, S.A. and Stanford, C.A. Testing the Principle of Orthogonality in the Design of Languages. Human-Computer Interaction, 4, 2.  ",
      "doi": "10.1207/s15327051hci0402_1"
    },
    {
      "text": "Douglas, S.A. Tutoring as Interaction. To appear in Peter Goodyear (Ed.), Teaching Knowledge and Intelligent Tutoring, Ablex, 1989.",
      "doi": ""
    },
    {
      "text": "Douglas, S. A. and Liu, Z-Y. Generating Causal Explanation from a Cardio-Vascular Simulation. In Proceedings of the International Joint Conference on Artificial Intelligence, August 1989, Detroit, MI.",
      "doi": ""
    },
    {
      "text": "Meyer, G. W. The Importance of Gun Balancing in Monitor Calibration. To appear in SPIE/SPSE Symposium on Electronic Imaging: Science and Technology, 1990.",
      "doi": ""
    },
    {
      "text": "Meyer, G.W. and Greenberg, D.P.C.olor-Defeetive Vision and Computer Graphics Displays. IEEE Computer Graphics and Applications, 8:28-40, 1988.  ",
      "doi": "10.1109/38.7759"
    },
    {
      "text": "Novick, D.G. Control of Mixed-Initiative Discourse Through Meta-Locutionary Acts: A Computational Model. Technical Report CIS-TR 88-18, Dept. of Computer and Information Science, University of Oregon, Dec. 1988.",
      "doi": ""
    }
  ]
}