{
  "doi": "10.1145/97243.97305",
  "title": "Using critics to empower users",
  "published": "1990-03-01",
  "proctitle": "CHI '90: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "337-347",
  "year": 1990,
  "badges": [],
  "abstract": "We describe the critiquing approach to building knowledge-based interactive systems. Critiquing supports computer users in their problem solving and learning activities. The challenges for the next generation of knowledge-based systems provide a context for the development of this paradigm. We discuss critics from the perspective of overcoming the problems of high-functionality computer systems, of providing a new class of systems to support learning, of extending applications-oriented construction kits to design environments, and of providing an alternative to traditional autonomous expert systems. One of the critiquing systems we have built — JANUS, a critic for architectural design — is used as an example of the key aspects of the critiquing process. We also survey additional critiquing systems developed in our and other research groups.",
  "tags": [],
  "authors": [
    {
      "name": "Gerhard Fischer",
      "institution": "Department of Computer Science and Institute of Cognitive Science, University of Colorado, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409592298",
      "orcid": "missing"
    },
    {
      "name": "Andreas C. Lemke",
      "institution": "Department of Computer Science and Institute of Cognitive Science, University of Colorado, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100048813",
      "orcid": "missing"
    },
    {
      "name": "Thomas Mastaglio",
      "institution": "Department of Computer Science and Institute of Cognitive Science, University of Colorado, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100345803",
      "orcid": "missing"
    },
    {
      "name": "Anders I. Morch",
      "institution": "NYNEX Artificial Intelligence Laboratory, White Plains, NY",
      "img": "/do/10.1145/contrib-81408593399/rel-imgonly/andersm.jpg",
      "acmid": "81408593399",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J.R. Anderson, B J. Reiser. \"The LISP Tutor\". BYTE 10, 4 (April 1985), 159-175. ",
      "doi": "10.5555/3351.3354"
    },
    {
      "text": "R.R. Burton, J.S. Brown. An Investigation of Computer Coaching for informal Learning Activities. In Intelligent Tutoring Systems, D.H. Sleeman, LS. Brown, Eds., Academic Press, London - New York, 1982, ch. 4, pp. 79-98.",
      "doi": ""
    },
    {
      "text": "J.M. ~ll, J. McKendre~. \"Interface Design Issues for Advice-Giving Expert Systems\". Communications of the ACM 30, 1 (January 1987), 14-31.  ",
      "doi": "10.1145/7885.7886"
    },
    {
      "text": "W.J. Clancey. \"Qualitative Student Models\". Annual Review of Computing Science 1 (1986), 381-450. ",
      "doi": "10.5555/17814.17828"
    },
    {
      "text": "M.J. Coombs, J.L. Alty. \"Expert Systems: An Alternative Paradigm\". International Journal of Man-Machine Studies 20 (1984).",
      "doi": ""
    },
    {
      "text": "S. Dews. Developing an ITS in a Corporate Setting. Proce.edingsof the Human Factors Society 33rd Annual Meeting, Volume 2, Human Factor'; Society, 1989, pp. 1339-1342.",
      "doi": ""
    },
    {
      "text": "S.W. Drat~r. The Nature of Expertise in UNIX. Proc.ee~ngs of INTERACT'84, IFIP Conference on Human-Computer Interaction, Amsterdam, September, 1984, pp. 182-186.",
      "doi": ""
    },
    {
      "text": "S. Fickas, P. Nagarajan. \"Critiquing Software Specifications\". IEEE Software 5, 6 (November 1988), 37-47.  ",
      "doi": "10.1109/52.10002"
    },
    {
      "text": "T.W. Fin:in. Providing Help and Advice in Task Oriented Sy.,~tems. Proceedings of the Eighth International Joint Conference on Artificial Intelligence, 1983, pp. 176-178.",
      "doi": ""
    },
    {
      "text": "G. Fischer. A Critic for LISP. Proceedings of the 10th International Joint Conference on A:rtificial Intelligence (Milan, Italy), Los Altos, CA, August, 1987, pp. 177-184.",
      "doi": ""
    },
    {
      "text": "G. Fischer. \"C6mmunications Requirements for Cooperative Problem Solving Systems\". The International Journal of Information Systems Special Issue on Knowledge Engineering (1990). to be published.  ",
      "doi": "10.1016/0306-4379%2890%2990014-G"
    },
    {
      "text": "G. Fischer, A. Girgensohn. End-User Modifiability in Design Environments. Human Factors in Computing Systems, CHI'90 Conference Proceedings (Seattle, WA), ACM, New York, April, 1990.  ",
      "doi": "10.1145/97243.97272"
    },
    {
      "text": "G. Fischer, A.C. Lemke. \"Construction Kits and Design Environments: Steps Toward Human Problem- Domain Communication\". Human-Computer Interaction 3, 3 (1988), 179-222.",
      "doi": ""
    },
    {
      "text": "G. Fischer, A.C. Lemke, T. Schwab. Knowledge- Based Help Systems. Human Factors in Computing Systems, CHI'85 Conference Proceedings (San Francisco, CA), ACM, New York, April, 1985, pp. 161-167.  ",
      "doi": "10.1145/317456.317487"
    },
    {
      "text": "G. Fischer, T. Mastaglio. Computer-Base~ Critics. Proceexlings of the 22rid Annual Hawaii Conference on System Sciences, Vol. Iii: Decision Support and Knowledge Base, d Systems Track, IEEE Computer Society, january, 1989, pp. 427-436.",
      "doi": ""
    },
    {
      "text": "G. Fischer, R. McCall, A. Morch. Design Environments for Constructive and Argumentative Design. Human Factors in Computing Systems, CHI'89 Conference Proceexlings (Austin, TX), ACM, New York, May, 1989, pp. 269-275.  ",
      "doi": "10.1145/67449.67501"
    },
    {
      "text": "G. Fischer, R. McCall, A. Morch. JANUS: Integrating Hypertext With a Knowledge-Based Design. Proceexlings of Hypertext'89, ACM, November, 1989, pp. 105-117.  ",
      "doi": "10.1145/74224.74233"
    },
    {
      "text": "K. Forbus. An Interactive Laboratory for Teaching Control System Concepts. Report 5511, BBN, Cambridge, MA, 1984.",
      "doi": ""
    },
    {
      "text": "M.P. Friedman. WANDAH. A Computerized Writer's Aid. In Applications of Cognitive Psychology, Problem Solving, Education and Computing, Lawrence Erlbaum Associates, Hillsdale, NJ, 1987, Chap. 15, pp. 219-225.",
      "doi": ""
    },
    {
      "text": "R. Glazer, K. Raghavan, L. Schauble. Voltaville: A Discovery Environment to Explore the; Laws of DC Circuits. Proceexlings of the Intematidnal Conference on Intelligent Tutoring Systems (Montreal, Canada), June, 1988, pp. 61-66.",
      "doi": ""
    },
    {
      "text": "R.J. Jones, W.H. Kapple. Kitchen Planning Principles . Equipment - Appliances. Small Homes Council- Building Research Council, University of Illinois, Urbana- Champaign, IL, 1984.",
      "doi": ""
    },
    {
      "text": "V.E. Kelly. The CRITTER System: Automated Critiquing of Digital Circuit Designs. Proce.e.zlings of the 21st Design Automation Conference, 1985, pp. 419-425. ",
      "doi": "10.5555/800033.800832"
    },
    {
      "text": "A. Kobsa, W. Wahlster fed.). User Models in Dialog Systems. Springer-Verlag, New York, 1989. ",
      "doi": "10.5555/79061"
    },
    {
      "text": "C. Langlotz, E. Shortliffe. \"Adapting a Consultation System to Critique User Plans\". International Journal of Man-Machine Studies 19 (1983), 479-496.",
      "doi": ""
    },
    {
      "text": "A.C. Lemke. Design Environments for High- Functionality Computer Systems. Ph.D. Th., Department of Computer Science, University of Colorado, Boulder, CO, July 1989. ",
      "doi": "10.5555/916100"
    },
    {
      "text": "T. Mastaglio. User Modelling in Computer-Based Critics. Proceedings of the 23rd Hawaii International Conference on the System Sciences, IEEE Computer Society, 1990. to be published.",
      "doi": ""
    },
    {
      "text": "F. Mill. A Framework for a Decision Critic and Advisor. Proceedings of the 21st Hawaii International Conference on System Sciences, Vol iii, Kailu-Kona, Hawaii, January 5-8, 1988, Jan, 1988, pp. 381-386. ",
      "doi": "10.5555/52858.52905"
    },
    {
      "text": "P. Miller. Expert Critiquing Systems: Practice.Based Medical Consultation by Computer. Springer-Verlag, New York- Berlin, 1986. ",
      "doi": "10.5555/536195"
    },
    {
      "text": "S. Papert. Mindstorms: Children, Computers and Powerful Ideas. Basic Books, New York, 1980. ",
      "doi": "10.5555/1095592"
    },
    {
      "text": "G.D. Rennels. Lecture Notes in Medical lnformatics. Volume 32: A computational model of reasoning from the clinical literature. Springer Verlag, 1987.",
      "doi": ""
    },
    {
      "text": "J. Schiff, J. Kandler. Decisionlab: A System Designed for User Coaching in Managerial Decision Support. Proceedings of the International Conference on Intelligent Tutoring Systems (}Vlontreal, Canada), June, 1988, pp. 154-161.",
      "doi": ""
    },
    {
      "text": "H.A. Simon. \"Whether Software Engineering Neexls to Be Artificially Intelligent\". IEEE Transactions on Software Engineering SE-12, 7 (July 1986), 726-732. ",
      "doi": "10.5555/9775.9776"
    },
    {
      "text": "R.L. Steele. Cell-Based VLSI Design Advice Using Default Reasoning. ProceeAings of 3rd Annual Rocky Mountain Conference on AI, Rocky Mountain Society for Artificial Intelligence, Denver, CO, 1988, pp. 66-74.",
      "doi": ""
    },
    {
      "text": "MJ. Stef'tk. \"The Next Knowledge Medium\". A/ Magazine 7, 1 (Spring 1986), 34-46. ",
      "doi": "10.5555/7900.7901"
    },
    {
      "text": "E. Wenger. Artificial Intelligence and Tutoring Systems. Morgan Kaufmann Publishers, Los Altos, CA, 1987. ",
      "doi": "10.5555/42185"
    },
    {
      "text": "K. Wipond, M. Jones. Curriculum and Knowledge Representation in a Knowledge-Based System for Curriculum Development. Proceedings of the International Conference on Intelligent Tutoring Systems (Montreal, Canada), June, 1988, pp. 97-102.",
      "doi": ""
    }
  ]
}