{
  "doi": "10.1145/2858036.2858123",
  "title": "Not at Home on the Range: Peer Production and the Urban/Rural Divide",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "13-25",
  "year": 2016,
  "badges": [],
  "abstract": "Wikipedia articles about places, OpenStreetMap features, and other forms of peer-produced content have become critical sources of geographic knowledge for humans and intelligent technologies. In this paper, we explore the effectiveness of the peer production model across the rural/urban divide, a divide that has been shown to be an important factor in many online social systems. We find that in both Wikipedia and OpenStreetMap, peer-produced content about rural areas is of systematically lower quality, is less likely to have been produced by contributors who focus on the local area, and is more likely to have been generated by automated software agents (i.e. \"bots\"). We then codify the systemic challenges inherent to characterizing rural phenomena through peer production and discuss potential solutions.",
  "authors": [
    {
      "name": "Isaac L. Johnson",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658747560",
      "orcid": "missing"
    },
    {
      "name": "Yilun Lin",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020060",
      "orcid": "missing"
    },
    {
      "name": "Toby Jia-Jun Li",
      "institution": "University of Minnesota & Carnegie Mellon University, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659163126",
      "orcid": "missing"
    },
    {
      "name": "Andrew Hall",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020081",
      "orcid": "missing"
    },
    {
      "name": "Aaron Halfaker",
      "institution": "Wikimedia Foundation, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-81430677519/rel-imgonly/81430677519.jpg",
      "acmid": "81430677519",
      "orcid": "missing"
    },
    {
      "name": "Johannes Schöning",
      "institution": "Hasselt University, Hasselt, Belgium",
      "img": "/do/10.1145/contrib-81508685058/rel-imgonly/20160404_5404_dsc_6947_small.jpg",
      "acmid": "81508685058",
      "orcid": "0000-0002-8823-4607"
    },
    {
      "name": "Brent Hecht",
      "institution": "University of Minnesota, Minneapolis, MN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350577456",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sisay F. Adafre and Maarten de Rijke. 2006. Finding Similar Sentences Across Multiple Languages in Wikipedia. 62--69.",
      "doi": ""
    },
    {
      "text": "Luc Anselin. 2005. Exploring Spatial Data with GeoDa: A Workbook. Center for Spatially Integrated Social Science.",
      "doi": ""
    },
    {
      "text": "Judd Antin, Ed H. Chi, James Howison, Sharoda Paul, Aaron Shaw, and Jude Yew. 2011. Apples to Oranges?: Comparing Across Studies of Open Collaboration/Peer Production. Proceedings of the 7th International Symposium on Wikis and Open Collaboration, ACM, 227--228. http://doi.org/10.1145/2038558.2038610  ",
      "doi": "10.1145/2038558.2038610"
    },
    {
      "text": "Gavin Bailey, Bernie Hogan, Mark Graham, and Ahmed Medhat Mohammed. 2012. Interactive Mapping of Wikipedia's Geographies: Visualizing Variation in Participation and Representation. WikiSym '12: 8th International Symposium on Wikis and Open Collaboration.",
      "doi": ""
    },
    {
      "text": "Roger Bivand, Micah Altman, Luc Anselin, et al. 2015. spdep: Spatial Dependence: Weighting Schemes, Statistics and Models. Retrieved September 25, 2015 from https://cran.rproject.org/web/packages/spdep/index.html",
      "doi": ""
    },
    {
      "text": "Philip Bump. 2014. There really are two Americas. An urban one and a rural one. The Washington Post. Retrieved September 23, 2015 from http://www.washingtonpost.com/news/thefix/wp/2014/10/21/there-really-are-two-americas-aurban-one-and-a-rural-one/",
      "doi": ""
    },
    {
      "text": "Jessica L. Collins and Barry Wellman. 2010. Small Town in the Internet Society: Chapleau Is No Longer an Island. American Behavioral Scientist 53, 9: 1344--1366. http://doi.org/10.1177/0002764210361689",
      "doi": ""
    },
    {
      "text": "Melanie Eckle. Quality Assessment of Remote Mapping in OpenStreetMap for Disaster Management Purposes. Retrieved September 24, 2015 from http://iscram2015.uia.no/wpcontent/uploads/2015/05/5--1.pdf",
      "doi": ""
    },
    {
      "text": "Sarah Elwood, Michael F. Goodchild, and Daniel Z. Sui. 2012. Researching Volunteered Geographic Information: Spatial Data, Geographic Research, and New Social Practice. Annals of the Association of American Geographers 102, 3: 571--590. http://doi.org/10.1080/00045608.2011.595657",
      "doi": ""
    },
    {
      "text": "Maike Erdmann, Kotaro Nakayama, Takahiro Hara, and Shojiro Nishio. 2008. An Approach for Extracting Bilingual Terminology from Wikipedia. In Database Systems for Advanced Applications, Jayant R. Haritsa, Ramamohanarao Kotagiri and Vikram Pudi (eds.). Springer Berlin Heidelberg, 380--392. Retrieved May 4, 2014 from http://link.springer.com/chapter/10.1007/978--3--54078568--2_28 ",
      "doi": "10.5555/1802514.1802552"
    },
    {
      "text": "M. Erdmann, K. Nakayama, T. Hara, and S. Nishio. 2008. A bilingual dictionary extracted from the Wikipedia link structure. Database Systems for Advanced Applications, 686--689. ",
      "doi": "10.5555/1802514.1802593"
    },
    {
      "text": "Killian Fox. 2012. OpenStreetMap: \"It's the Wikipedia of maps\". The Guardian. Retrieved May 13, 2015 from http://www.theguardian.com/theobserver/2012/feb/18/ openstreetmap-world-map-radicals",
      "doi": ""
    },
    {
      "text": "Evgeniy Gabrilovich and Shaul Markovitch. 2006. Overcoming the brittleness bottleneck using wikipedia: enhancing text categorization with encyclopedic knowledge. AAAI '06: The Twenty-First National Conference on Artificial Intelligence, AAAI Press, 1301--1306. Retrieved February 16, 2012 from http://dl.acm.org/citation.cfm?id=1597348.1597395 ",
      "doi": "10.5555/1597348.1597395"
    },
    {
      "text": "Evgeniy Gabrilovich and Shaul Markovitch. 2007. Computing Semantic Relatedness using Wikipediabased Explicit Semantic Analysis. IJCAI '07: Twentieth Joint Conference for Artificial Intelligence. ",
      "doi": "10.5555/1625275.1625535"
    },
    {
      "text": "R. Stuart Geiger. 2014. Bots, bespoke, code and the materiality of software platforms. Information, Communication & Society 17, 3: 342--356. http://doi.org/10.1080/1369118X.2013.873069",
      "doi": ""
    },
    {
      "text": "R. Stuart Geiger and Aaron Halfaker. 2013. When the Levee Breaks: Without Bots, What Happens to Wikipedia's Quality Control Processes' Proceedings of the 9th International Symposium on Open Collaboration, ACM, 6:1--6:6. http://doi.org/10.1145/2491055.2491061  ",
      "doi": "10.1145/2491055.2491061"
    },
    {
      "text": "Eric Gilbert, Karrie Karahalios, and Christian Sandvig. 2008. The network in the garden: an empirical analysis of social media in rural life. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1603--1612. http://doi.org/10.1145/1357054.1357304  ",
      "doi": "10.1145/1357054.1357304"
    },
    {
      "text": "Mark Graham, Scott A. Hale, and Monica Stephens. 2011. Geographies of the World's Knowledge. Convoco! Edition, London, England.",
      "doi": ""
    },
    {
      "text": "Mark Graham, Ralph K. Straumann, and Bernie Hogan. 2015. Digital Divisions of Labor and Informational Magnetism: Mapping Participation in Wikipedia. Annals of the Association of American Geographers 0, 0: 1--21. http://doi.org/10.1080/00045608.2015.1072791",
      "doi": ""
    },
    {
      "text": "Mark Graham, Matthew Zook, and Andrew Boulton. 2013. Augmented reality in urban places: contested content and the duplicity of code. Transactions of the Institute of British Geographers 38, 3: 464--479. http://doi.org/10.1111/j.1475--5661.2012.00539.x",
      "doi": ""
    },
    {
      "text": "Shane Greenstein and Feng Zhu. Is Wikipedia Biased? American Economic Review 102, 3: 343--348.",
      "doi": ""
    },
    {
      "text": "Mordechai (Muki) Haklay, Sofia Basiouka, Vyron Antoniou, and Aamer Ather. 2010. How Many Volunteers Does it Take to Map an Area Well? The Validity of Linus? Law to Volunteered Geographic Information. The Cartographic Journal 47, 4: 315--322. http://doi.org/10.1179/000870410X12911304958827",
      "doi": ""
    },
    {
      "text": "Muki Haklay. 2012. Nobody wants to do council estates? -- digital divide, spatial justice and outliers. AAG '12: 2012 Annual Meeting of the Association of American Geographers. Retrieved from http://www.slideshare.net/mukih/nobody-wants-to-docouncil-estates-digital-divide-spatial-justice-andoutliers?ref=http://povesham.wordpress.com/",
      "doi": ""
    },
    {
      "text": "Aaron Halfaker, Aniket Kittur, Robert Kraut, and John Riedl. 2009. A Jury of Your Peers: Quality, Experience and Ownership in Wikipedia. Proceedings of the 5th International Symposium on Wikis and Open Collaboration, ACM, 15:1--15:10. http://doi.org/10.1145/1641309.1641332  ",
      "doi": "10.1145/1641309.1641332"
    },
    {
      "text": "Aaron Halfaker and John Riedl. 2012. Bots and Cyborgs: Wikipedia's Immune System. Computer 45, 79--82.  ",
      "doi": "10.1109/MC.2012.82"
    },
    {
      "text": "Darren Hardy, James Frew, and Michael F. Goodchild. 2012. Volunteered geographic information production as a spatial process. International Journal of Geographical Information Science: 1--22. http://doi.org/10.1080/13658816.2011.629618  ",
      "doi": "10.1080/13658816.2011.629618"
    },
    {
      "text": "Brent Hecht. 2013. The Mining and Application of Diverse Cultural Perspectives in User-Generated Content. ",
      "doi": "10.5555/2519359"
    },
    {
      "text": "Brent Hecht and Darren Gergle. 2009. Measuring SelfFocus Bias in Community-Maintained Knowledge Repositories. Communities and Technologies 2009: 4th International Conference on Communities and Technologies, 11--19.  ",
      "doi": "10.1145/1556460.1556463"
    },
    {
      "text": "Brent Hecht and Darren Gergle. 2010. On The \"Localness\" of User-Generated Content. CSCW '10: 2010 ACM Conference on Computer Supported Cooperative Work, 229--232.  ",
      "doi": "10.1145/1718918.1718962"
    },
    {
      "text": "Brent Hecht and Darren Gergle. 2011. A Beginner's Guide to Geographic Virtual Communities Research. In Handbook of Research on Methods and Techniques for Studying Virtual Communities: Paradigms and Phenomena. IGI Global, 333--347.",
      "doi": ""
    },
    {
      "text": "Brent Hecht and Shashi Shekhar. 2014. Spatial Computing Massive Open Online Course (MOOC). Coursera. Retrieved from https://www.coursera.org/course/spatialcomputing",
      "doi": ""
    },
    {
      "text": "Brent Hecht and Monica Stephens. 2014. A Tale of Cities: Urban Biases in Volunteered Geographic Information. ICWSM '14: Eight International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Nathan Ingraham. 2012. Apple using TomTom and OpenStreetMap data in iOS 6 Maps app. The Verge. Retrieved September 11, 2012 from http://www.theverge.com/2012/6/11/3078987/appletomtom-openstreemap-ios-6-maps-app",
      "doi": ""
    },
    {
      "text": "DD Ingram and SF Franco. 2012. Rural Classification Scheme for Counties. National Center for Health Statistics. Retrieved from http://www.cdc.gov/nchs/data_access/urban_rural.htm #documentation",
      "doi": ""
    },
    {
      "text": "Brian C. Keegan and Jed R. Brubaker. 2015. \"Is\" to \"Was\": Coordination and Commemoration in Posthumous Activity on Wikipedia Biographies. Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 533--546. http://doi.org/10.1145/2675133.2675238  ",
      "doi": "10.1145/2675133.2675238"
    },
    {
      "text": "Aniket Kittur and Robert E. Kraut. 2008. Harnessing the wisdom of crowds in wikipedia: quality through coordination. Proceedings of the 2008 ACM conference on Computer supported cooperative work, ACM, 37--46. http://doi.org/10.1145/1460563.1460572  ",
      "doi": "10.1145/1460563.1460572"
    },
    {
      "text": "Ronald R Kline. 2002. Consumers in the country: technology and social change in rural america. Johns Hopkins Univ Press, Baltimore.",
      "doi": ""
    },
    {
      "text": "S.K. Lam, A. Uduwage, Z. Dong, et al. 2011. WP:Clubhouse? An Exploration of Wikipedia's Gender Imbalance. WikiSym '11: 7th International Symposium on Wikis and Open Collaboration, 1--10.  ",
      "doi": "10.1145/2038558.2038560"
    },
    {
      "text": "Michael D. Lieberman and J. Lin. 2009. You Are Where You Edit: Locating Wikipedia Users Through Edit Histories. ICWSM '09: 3rd Int'l AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Andrew Lih. 2009. The Wikipedia Revolution: How a Bunch of Nobodies Created the World's Greatest Encyclopedia. Hyperion.",
      "doi": ""
    },
    {
      "text": "Linna Li, Michael F. Goodchild, and Bo Xu. 2013. Spatial, temporal, and socioeconomic patterns in the use of Twitter and Flickr. Cartography and Geographic Information Science 40, 2: 61--77. http://doi.org/10.1080/15230406.2013.777139",
      "doi": ""
    },
    {
      "text": "Magnus Manske. 2015. Reasonator - Meta. Retrieved September 25, 2015 from https://meta.wikimedia.org/wiki/Reasonator",
      "doi": ""
    },
    {
      "text": "Afra Mashhadi, Giovanni Quattrone, and Licia Capra. 2013. Putting ubiquitous crowd-sourcing into context. CSCW '13: 2013 ACM Conference on Computer Supported Cooperative Work, 611--622.  ",
      "doi": "10.1145/2441776.2441845"
    },
    {
      "text": "Olena Medelyan, David Milne, Catherine Legg, and Ian H. Witten. 2009. Mining meaning from Wikipedia. International Journal of Human-Computer Studies 67, 9: 716--754. http://doi.org/10.1016/j.ijhcs.2009.05.004  ",
      "doi": "10.1016/j.ijhcs.2009.05.004"
    },
    {
      "text": "Amanda Menking and Ingrid Erickson. 2015. The Heart Work of Wikipedia: Gendered, Emotional Labor in the World's Largest Online Encyclopedia. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 207--210. http://doi.org/10.1145/2702123.2702514  ",
      "doi": "10.1145/2702123.2702514"
    },
    {
      "text": "David Milne and Ian H Witten. 2008. Learning to link with wikipedia. CIKM '08: 17th ACM Conference on Information and Knowledge Management, ACM, 509--518. http://doi.org/10.1145/1458082.1458150  ",
      "doi": "10.1145/1458082.1458150"
    },
    {
      "text": "David Milne and Ian H Witten. 2008. An Effective, Low-Cost Measure of Semantic Relatedness Obtained from Wikipedia Links. WIKIAI '08: First AAAI Workshop on Wikipedia and Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "National Administration of Surveying, Mapping and Geoinformation. 2002. Surveying and Mapping Law of the People's Republic of China. Retrieved September 25, 2015 from http://en.nasg.gov.cn/article/Lawsandregulations/2013 12/20131200005471.shtml",
      "doi": ""
    },
    {
      "text": "Ulrike Pfeil, Panayiotis Zaphiris, and Chee Siang Ang. 2006. Cultural Differences in Collaborative Authoring of Wikipedia. Journal of Computer-Mediated Communication 12, 1: 88--113.",
      "doi": ""
    },
    {
      "text": "Ingmar Poese, Steve Uhlig, Mohamed Ali Kaafar, Benoit Donnet, and Bamba Gueye. 2011. IP geolocation databases: Unreliable? SIGCOMM 41, 2.  ",
      "doi": "10.1145/1971162.1971171"
    },
    {
      "text": "Giovanni Quattrone, Licia Capra, and Pasquale De Meo. 2015. There's No Such Thing as the Perfect Map: Quantifying Bias in Spatial Crowd-sourcing Datasets. CSCW '15.  ",
      "doi": "10.1145/2675133.2675235"
    },
    {
      "text": "Giovanni Quattrone, Afra Mashhadi, Daniele Quercia, C. Smith, and Licia Capra. 2014. Modelling Growth of Urban Crowd-Sourced Information.",
      "doi": ""
    },
    {
      "text": "G. Quattrone, Afra Mashhadi, and Licia Capra. 2014. Mind the Map: The Impact of Culture and Economic Affluence on Crowd- Mapping Behaviours. CSCW '14.  ",
      "doi": "10.1145/2531602.2531713"
    },
    {
      "text": "Eric S. Raymond. 2001. The Cathedral & the Bazaar: Musings on Linux and Open Source by an Accidental Revolutionary. O'Reilly Media, Beijing?; Cambridge, Mass. ",
      "doi": "10.5555/558214"
    },
    {
      "text": "Joseph Reagle and Lauren Rhue. 2011. Gender Bias in Wikipedia and Britannica. International Journal of Communication 5: 1138--1158.",
      "doi": ""
    },
    {
      "text": "Shilad Sen, Toby Jia-Jun Li, WikiBrain Team, and Brent Hecht. 2014. WikiBrain: Democratizing Computation on Wikipedia. Proceedings of The International Symposium on Open Collaboration, ACM, 27:1--27:10. http://doi.org/10.1145/2641580.2641615  ",
      "doi": "10.1145/2641580.2641615"
    },
    {
      "text": "Shilad W. Sen, Heather Ford, David R. Musicant, Mark Graham, Oliver S.B. Keyes, and Brent Hecht. 2015. Barriers to the Localness of Volunteered Geographic Information. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 197--206. http://doi.org/10.1145/2702123.2702170  ",
      "doi": "10.1145/2702123.2702170"
    },
    {
      "text": "C.E. Shannon. 1948. A mathematical theory of communication. Bell System Technical Journal, The 27, 3: 379--423. http://doi.org/10.1002/j.15387305.1948.tb01338.x",
      "doi": ""
    },
    {
      "text": "Terry Sicular, Yue Ximing, Björn Gustafsson, and Li Shi. 2007. The Urban-Rural Income Gap and Inequality in China. Review of Income and Wealth 53, 1: 93--126. http://doi.org/10.1111/j.14754991.2007.00219.x",
      "doi": ""
    },
    {
      "text": "Monica Stephens. 2013. Gender and the GeoWeb: divisions in the production of user-generated cartographic information. GeoJournal: 1--16. http://doi.org/10.1007/s10708-013--9492-z",
      "doi": ""
    },
    {
      "text": "Besiki Stvilia, Michael B. Twidale, Linda C. Smith, and Les Gasser. 2008. Information quality work organization in wikipedia. Journal of the American Society for Information Science and Technology 59, 6: 983--1001. http://doi.org/10.1002/asi.20813  ",
      "doi": "10.5555/1358262.1358274"
    },
    {
      "text": "US Census Bureau. 2010 Census Urban and Rural Classification and Urban Area Criteria. Retrieved September 11, 2013 from http://www.census.gov/geo/reference/ua/urban-rural2010.html",
      "doi": ""
    },
    {
      "text": "Claudia Wagner, David Garcia, Mohsen Jadidi, and Markus Strohmaier. 2015. It's a Man's Wikipedia? Assessing Gender Inequality in an Online Encyclopedia. Ninth International AAAI Conference on Web and Social Media. Retrieved September 21, 2015 from http://www.aaai.org/ocs/index.php/ICWSM/ICWSM15 /paper/view/10585",
      "doi": ""
    },
    {
      "text": "Morten Warncke-Wang, Vlad Ayukaev, Brent Hecht, and Loren Terveen. 2015. The Success and Failure of Quality Improvement Projects in Peer Production Communities.",
      "doi": ""
    },
    {
      "text": "Morten Warncke-Wang, Dan Cosley, and John Riedl. 2013. Tell Me More: An Actionable Quality Model for Wikipedia. Proceedings of the 9th International Symposium on Open Collaboration, ACM, 8:1--8:10. http://doi.org/10.1145/2491055.2491063  ",
      "doi": "10.1145/2491055.2491063"
    },
    {
      "text": "Morten Warncke-Wang, Vivek Ranjan, Loren Terveen, and Brent Hecht. 2015. Misalignment Between Supply and Demand of Quality Content in Peer Production Communities. ICWSM 2015: Ninth International AAAI Conference on Web and Social Media.",
      "doi": ""
    },
    {
      "text": "Richard Weait. 2010. Wolfram Alpha is using OpenStreetMap data. OpenStreetMap Blog. Retrieved from https://blog.openstreetmap.org/2010/06/16/wolframalpha-is-using-openstreetmap-data/",
      "doi": ""
    },
    {
      "text": "Wikimedia Foundation. WikiWomen's Collaborative Meta. Retrieved September 25, 2015 from https://meta.wikimedia.org/wiki/WikiWomen%27s_Co llaborative",
      "doi": ""
    },
    {
      "text": "Benjamin P. Wing and Jason Baldridge. 2011. Simple Supervised Document Geolocation with Geodesic Grids. ACL '11: Proceedings of the 49th Annual Meeting of the Association for Computational Linguistics, 955--964. ",
      "doi": "10.5555/2002472.2002593"
    },
    {
      "text": "Jiang Yang, Meredith Ringel Morris, Jaime Teevan, Lada A. Adamic, and Mark S. Ackerman. 2011. Culture Matters: A Survey Study of Social Q&A Behavior. ICWSM '11: 5th International AAAI Conference on Weblogs and Social Media.",
      "doi": ""
    },
    {
      "text": "Dennis Zielstra, Hartwig H. Hochmair, and Pascal Neis. 2013. Assessing the Effect of Data Imports on the Completeness of OpenStreetMap -- A United States Case Study. Transactions in GIS 17, 3: 315--334. http://doi.org/10.1111/tgis.12037",
      "doi": ""
    },
    {
      "text": "Dennis Zielstra, Hartwig Hochmair, Pascal Neis, and Francesco Tonini. 2014. Areal Delineation of Home Regions from Contribution and Editing Patterns in OpenStreetMap. ISPRS International Journal of GeoInformation 3, 4: 1211--1233. http://doi.org/10.3390/ijgi3041211",
      "doi": ""
    },
    {
      "text": "Dennis Zielstra and Alexander Zipf. 2010. A comparative study of proprietary geodata and volunteered geographic information for Germany. 13th AGILE international conference on geographic information science. Retrieved May 23, 2015 from http://agile2010.dsi.uminho.pt/pen/shortpapers_pdf/14 2_doc.pdf",
      "doi": ""
    },
    {
      "text": "2012. foursquare is joining the OpenStreetMap movement! Say hi to pretty new maps! foursquare blog. Retrieved September 15, 2012 from http://blog.foursquare.com/2012/02/29/foursquare-isjoining-the-openstreetmap-movement-say-hi-to-prettynew-maps/",
      "doi": ""
    },
    {
      "text": "2015. Template:Grading scheme. Wikipedia, the free encyclopedia. Retrieved September 23, 2015 from https://en.wikipedia.org/w/index.php?title=Template:G rading_scheme&oldid=654786473",
      "doi": ""
    },
    {
      "text": "2015. Wikipedia:Pokémon test. Wikipedia, the free encyclopedia. Retrieved September 25, 2015 from https://en.wikipedia.org/w/index.php?title=Wikipedia: Pok%C3%A9mon_test&oldid=677970811",
      "doi": ""
    },
    {
      "text": "USDA Economic Research Service - Population & Migration. Retrieved September 25, 2015 from http://www.ers.usda.gov/topics/rural-economypopulation/population-migration.aspx",
      "doi": ""
    }
  ]
}