{
  "doi": "10.1145/2858036.2858532",
  "title": "Fast, Cheap, and Good: Why Animated GIFs Engage Us",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "575-586",
  "year": 2016,
  "badges": [],
  "abstract": "Animated GIFs have been around since 1987 and recently gained more popularity on social networking sites. Tumblr, a large social networking and micro blogging platform, is a popular venue to share animated GIFs. Tumblr users follow blogs, generating a feed or posts, and choose to \"like' or to \"reblog' favored posts. In this paper, we use these actions as signals to analyze the engagement of over 3.9 million posts, and conclude that animated GIFs are significantly more engaging than other kinds of media. We follow this finding with deeper visual analysis of nearly 100k animated GIFs and pair our results with interviews with 13 Tumblr users to find out what makes animated GIFs engaging. We found that the animation, lack of sound, immediacy of consumption, low bandwidth and minimal time demands, the storytelling capabilities and utility for expressing emotions were significant factors in making GIFs the most engaging content on Tumblr. We also found that engaging GIFs contained faces and had higher motion energy, uniformity, resolution and frame rate. Our findings connect to media theories and have implications in design of effective content dashboards, video summarization tools and ranking algorithms to enhance engagement.",
  "tags": [
    "content analysis",
    "visual analysis",
    "animated GIFs",
    "social media analysis",
    "regression analysis",
    "tumblr"
  ],
  "authors": [
    {
      "name": "Saeideh Bakhshi",
      "institution": "Yahoo Labs, San Fransisco, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557455456",
      "orcid": "missing"
    },
    {
      "name": "David A. Shamma",
      "institution": "Yahoo Labs, San Fransisco, CA, USA",
      "img": "/do/10.1145/contrib-81100288295/rel-imgonly/me.jpg",
      "acmid": "81100288295",
      "orcid": "0000-0003-2399-9374"
    },
    {
      "name": "Lyndon Kennedy",
      "institution": "Yahoo Labs, San Francisco, CA, USA",
      "img": "/do/10.1145/contrib-81335492711/rel-imgonly/photo.jpg",
      "acmid": "81335492711",
      "orcid": "missing"
    },
    {
      "name": "Yale Song",
      "institution": "Yahoo Labs, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81500657518",
      "orcid": "missing"
    },
    {
      "name": "Paloma de Juan",
      "institution": "Yahoo Labs, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021906",
      "orcid": "missing"
    },
    {
      "name": "Joseph 'Jofish' Kaye",
      "institution": "Yahoo labs, Sunnyvale, CA, USA",
      "img": "/do/10.1145/contrib-81100005698/rel-imgonly/jofish-kaye-1.jpg",
      "acmid": "81100005698",
      "orcid": "0000-0001-7440-3900"
    }
  ],
  "references": [
    {
      "text": "Eytan Adar, Lada Adamic, and others. 2005. Tracking information epidemics in blogspace. In Web intelligence, 2005. Proceedings. The 2005 IEEE/WIC/ACM international conference on. IEEE, 207--214.  ",
      "doi": "10.1109/WI.2005.151"
    },
    {
      "text": "Saeideh Bakhshi and Eric Gilbert. 2015. Red, Purple and Pink: The Colors of Diffusion on Pinterest. PloS one 10, 2 (2015), e0117148.",
      "doi": ""
    },
    {
      "text": "Saeideh Bakhshi, David Shamma, Lyndon Kennedy, and Eric Gilbert. 2015. Why We Filter Our Photos and How It Impacts Engagement. In International AAAI Conference on Web and Social Media. AAAI Press, 12--22. http://www.aaai.org/ocs/index.php/ICWSM/ICWSM15/paper/ view/10573/10484",
      "doi": ""
    },
    {
      "text": "Saeideh Bakhshi, David. A Shamma, and Eric Gilbert. 2014. Faces Engage Us: Photos with Faces Attract More Likes and Comments on Instagram. In in Proceedings of the SIGCHI conference on Human Factors in computing systems,.  ",
      "doi": "10.1145/2556288.2557403"
    },
    {
      "text": "Eytan Bakshy, Jake M Hofman, Winter A Mason, and Duncan J Watts. 2011. Everyone's an influencer: quantifying influence on twitter. In Proceedings of the fourth ACM international conference on Web search and data mining. ACM, 65--74.  ",
      "doi": "10.1145/1935826.1935845"
    },
    {
      "text": "Rex Briggs and Nigel Hollis. 1997. Advertising on the web: is there response before click-through? Journal of Advertising research 37 (1997), 33--46.",
      "doi": ""
    },
    {
      "text": "Kelly Burke and Laku Chidambaram. 1999. How much bandwidth is enough? A longitudinal examination of media characteristics and group outcomes. MIS quarterly (1999), 557--579.  ",
      "doi": "10.2307/249489"
    },
    {
      "text": "Adrian Colin Cameron and Pravin K Trivedi. 2009. Microeconometrics using stata. Vol. 5. Stata Press College Station, TX.",
      "doi": ""
    },
    {
      "text": "Peter J Carnevale, Dean G Pruitt, and Steven D Seilheimer. 1981. Looking and competing: Accountability and visual access in integrative bargaining. Journal of Personality and Social Psychology 40, 1 (1981), 111.",
      "doi": ""
    },
    {
      "text": "Pablo Cesar, Dick CA Bulterman, Jack Jansen, David Geerts, Hendrik Knoche, and William Seager. 2009. Fragment, tag, enrich, and send: Enhancing social sharing of video. ACM Transactions on Multimedia Computing, Communications, and Applications (TOMM) 5, 3 (2009), 19.  ",
      "doi": "10.1145/1556134.1556136"
    },
    {
      "text": "Yi Chang, Lei Tang, Yoshiyuki Inagaki, and Yan Liu. 2014. What is Tumblr: A Statistical Overview and Comparison. arXiv preprint arXiv:1403.5206 (2014).",
      "doi": ""
    },
    {
      "text": "Ann G Cropper and SJW Evans. 1968. Ergonomics and computer display design. Computer Bulletin 12, 3 (1968), 94.",
      "doi": ""
    },
    {
      "text": "Richard L Daft and Robert H Lengel. 1986. Organizational information requirements, media richness and structural design. Management science 32, 5 (1986), 554--571.",
      "doi": ""
    },
    {
      "text": "Marco de Sa, Vidhya Navalpakkam, and Elizabeth F. Churchill. 2013. Mobile Advertising: Evaluating the Effects of Animation, User and Content Relevance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 2487--2496.  ",
      "doi": "10.1145/2470654.2481344"
    },
    {
      "text": "Alan R Dennis, Robert M Fuller, and Joseph S Valacich. 2008. Media, tasks, and communication processes: A theory of media synchronicity. MIS quarterly 32, 3 (2008), 575--600. ",
      "doi": "10.5555/2017388.2017395"
    },
    {
      "text": "Alan R Dennis and Susan T Kinney. 1998. Testing media richness theory in the new media: The effects of cues, feedback, and task equivocality. Information systems research 9, 3 (1998), 256--274.  ",
      "doi": "10.1287/isre.9.3.256"
    },
    {
      "text": "Benjamin H Detenber, Robert F Simons, and Gary G Bennett Jr. 1998. Roll 'em!: The effects of picture motion on emotional responses. Journal of Broadcasting & Electronic Media 42, 1 (1998), 113--127.",
      "doi": ""
    },
    {
      "text": "Maha M El-Shinnawy and M Lynne Markus. 1992. Media richness theory and new electronic communication media: A study of voice mail and electronic mail. In ICIS. 91--105. ",
      "doi": "10.5555/147251.148351"
    },
    {
      "text": "Janet Fulk and Brian Boyd. 1991. Emerging theories of communication in organizations. Journal of management 17, 2 (1991), 407--446.",
      "doi": ""
    },
    {
      "text": "Janet Fulk, Joseph Schmitz, and Charles W Steinfield. 1990. A social influence model of technology use. Organizations and communication technology 117 (1990), 140.",
      "doi": ""
    },
    {
      "text": "E. Gilbert, S. Bakhshi, S. Chang, and L. Terveen. 2013. I need to try this?: a statistical overview of pinterest. In Proceedings of the sigchi conference on human factors in computing systems. ACM, 2427--2436.  ",
      "doi": "10.1145/2470654.2481336"
    },
    {
      "text": "Manuel Gomez Rodriguez, Jure Leskovec, and Andreas Krause. 2010. Inferring networks of diffusion and influence. In Proceedings of the 16th ACM SIGKDD international conference on Knowledge discovery and data mining. ACM, 1019--1028.  ",
      "doi": "10.1145/1835804.1835933"
    },
    {
      "text": "Amit Goyal, Francesco Bonchi, and Laks VS Lakshmanan. 2010. Learning influence probabilities in social networks. In Proceedings of the third ACM international conference on Web search and data mining. ACM, 241--250.  ",
      "doi": "10.1145/1718487.1718518"
    },
    {
      "text": "Daniel Gruhl, Ramanathan Guha, David Liben-Nowell, and Andrew Tomkins. 2004. Information diffusion through blogspace. In Proceedings of the 13th international conference on World Wide Web. ACM, 491--501.  ",
      "doi": "10.1145/988672.988739"
    },
    {
      "text": "Caroline Haythornthwaite. 2002. Strong, weak, and latent ties and the impact of new media. The Information Society 18, 5 (2002), 385--401.",
      "doi": ""
    },
    {
      "text": "Serena Hillman, Jason Procyk, and Carman Neustaedter. 2014. Tumblr fandoms, community & culture. In Proceedings of the companion publication of the 17th ACM conference on Computer supported cooperative work & social computing. ACM, 285--288.  ",
      "doi": "10.1145/2556420.2557634"
    },
    {
      "text": "Larissa Hjorth. 2007. Snapshots of almost contact: The rise of camera phone practices and a case study in Seoul, Korea. Continuum: Journal of Media & Cultural Studies 21, 2 (2007), 227--238.",
      "doi": ""
    },
    {
      "text": "N. Hochman and R. Schwartz. 2012. Visualizing Instagram: Tracing Cultural Visual Rhythms. In Proceedings of the workshop on social media visualization (socmedvis) in conjunction with the sixth international AAAI conference on weblogs and social media (ICWSM-12).",
      "doi": ""
    },
    {
      "text": "Weiyin Hong, James YL Thong, and Kar Yan Tam. 2004. Does animation attract online users' attention? The effects of flash on information search performance and perceptions. Information Systems Research 15, 1 (2004), 60--86.  ",
      "doi": "10.1287/isre.1040.0017"
    },
    {
      "text": "Yuheng Hu, Lydia Manikonda, and Subbarao Kambhampati. 2014. What We Instagram: A First Analysis of Instagram Photo Content and User Types. In ICWSM. AAAI.",
      "doi": ""
    },
    {
      "text": "David Kirk, Abigail Sellen, Richard Harper, and Ken Wood. 2007. Understanding videowork. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 61--70.  ",
      "doi": "10.1145/1240624.1240634"
    },
    {
      "text": "David Kirk, Abigail Sellen, Carsten Rother, and Ken Wood. 2006. Understanding photowork. In Proceedings of the SIGCHI conference on Human Factors in computing systems. ACM, 761--770.  ",
      "doi": "10.1145/1124772.1124885"
    },
    {
      "text": "David S Kirk, Abigail Sellen, and Xiang Cao. 2010. Home video communication: mediating 'closeness'. In Proceedings of the 2010 ACM conference on Computer supported cooperative work. ACM, 135--144.  ",
      "doi": "10.1145/1718918.1718945"
    },
    {
      "text": "Jarmo Kuisma, Jaana Simola, Liisa Uusitalo, and Anssi Öörni. 2010. The effects of animation and format on the perception and memory of online advertising. Journal of Interactive Marketing 24, 4 (2010), 269--282.",
      "doi": ""
    },
    {
      "text": "Roy Lachman, Janet L Lachman, and Earl Butterfield. 1979. Cognitive psychology and information processing: An introduction. Lawrence Erlbaum Associates Hillsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Peter J Lang. 1979. A bio-informational theory of emotional imagery. Psychophysiology 16, 6 (1979), 495--512.",
      "doi": ""
    },
    {
      "text": "Brenda Laurel and S Joy Mountford. 1990. The art of human-computer interface design. Addison-Wesley Longman Publishing Co., Inc. ",
      "doi": "10.5555/575201"
    },
    {
      "text": "Allen S Lee. 1994. Electronic mail as a medium for rich communication: An empirical investigation using hermeneutic interpretation. MIS quarterly (1994), 143--157.  ",
      "doi": "10.2307/249762"
    },
    {
      "text": "Kristina Lerman and Rumi Ghosh. 2010. Information Contagion: An Empirical Study of the Spread of News on Digg and Twitter Social Networks. ICWSM 10 (2010), 90--97.",
      "doi": ""
    },
    {
      "text": "Hairong Li and Janice L Bukovac. 1999. Cognitive impact of banner ad characteristics: An experimental study. Journalism & Mass Communication Quarterly 76, 2 (1999), 341--353.",
      "doi": ""
    },
    {
      "text": "Andrew D Miller and W Keith Edwards. 2007. Give and take: a study of consumer photo-sharing culture and practice. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 347--356.  ",
      "doi": "10.1145/1240624.1240682"
    },
    {
      "text": "Byron Reeves and Clifford Nass. 1996. How people treat computers, television, and new media like real people and places. CSLI Publications and Cambridge university press. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "Joel Ross, Robert Simpson, and Bill Tomlinson. 2011. Media richness, interactivity and retargeting to mobile devices: a survey. International Journal of Arts and Technology 4, 4 (2011), 442--459.",
      "doi": ""
    },
    {
      "text": "David A Shamma, Ryan Shaw, Peter L Shafton, and Yiming Liu. 2007. Watch what I watch: using community activity to understand content. In Proceedings of the international workshop on Workshop on multimedia information retrieval. ACM, 275--284.  ",
      "doi": "10.1145/1290082.1290120"
    },
    {
      "text": "Yale Song, Jordi Vallmitjana, Amanda Stent, and Alejandro Jaimes. 2015. TVSum: Summarizing Web Videos Using Titles. In Proceedings of the IEEE Conference on Computer Vision and Pattern Recognition. 5179--5187.",
      "doi": ""
    },
    {
      "text": "Bongwon Suh, Lichan Hong, Peter Pirolli, and Ed H Chi. 2010. Want to be retweeted? large scale analytics on factors impacting retweet in twitter network. In Social Computing (SocialCom), 2010 IEEE Second International Conference on. IEEE, 177--184.  ",
      "doi": "10.1109/SocialCom.2010.33"
    },
    {
      "text": "S Shyam Sundar and Sriram Kalyanaraman. 2004. Arousal, memory, and impression-formation effects of animation speed in web advertising. Journal of Advertising 33, 1 (2004), 7--17.",
      "doi": ""
    },
    {
      "text": "Richard Szeliski. 2010. Computer vision: algorithms and applications. Springer Science & Business Media. ",
      "doi": "10.5555/1941882"
    },
    {
      "text": "Nancy A Van House. 2011. Personal photography, digital technologies and the uses of the visual. Visual Studies 26, 2 (2011), 125--134.",
      "doi": ""
    },
    {
      "text": "Shawnee K Vickery, Cornelia Droge, Theodore P Stank, Thomas J Goldsby, and Robert E Markland. 2004. The performance implications of media richness in a business-to-business service environment: Direct versus indirect effects. Management Science 50, 8 (2004), 1106--1119.  ",
      "doi": "10.1287/mnsc.1040.0248"
    },
    {
      "text": "Joseph B Walther and Kyle P D'Addario. 2001. The impacts of emoticons on message interpretation in computer-mediated communication. Social science computer review 19, 3 (2001), 324--347.",
      "doi": ""
    },
    {
      "text": "Zhou Wang, Hamid R Sheikh, and Alan C Bovik. 2002. No-reference perceptual quality assessment of JPEG compressed images. In Image Processing. 2002. Proceedings. 2002 International Conference on, Vol. 1. IEEE, I--477.",
      "doi": ""
    },
    {
      "text": "Harry F Wolcott. 1994. Transforming qualitative data: Description, analysis, and interpretation. Sage.",
      "doi": ""
    },
    {
      "text": "Susan P Wyche, Thomas N Smyth, Marshini Chetty, Paul M Aoki, and Rebecca E Grinter. 2010. Deliberate interactions: characterizing technology use in Nairobi, Kenya. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2593--2602.  ",
      "doi": "10.1145/1753326.1753719"
    }
  ]
}