{
  "doi": "10.1145/2858036.2858281",
  "title": "xPrint: A Modularized Liquid Printer for Smart Materials Deposition",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "5743-5752",
  "year": 2016,
  "badges": [],
  "abstract": "To meet the increasing requirements of HCI researchers who are looking into using liquid-based materials (e.g., hydrogels) to create novel interfaces, we present a design strategy for HCI researchers to build and customize a liquid-based smart material printing platform with off-the-shelf or easy-to-machine parts. For the hardware, we suggest a magnetic assembly-based modular design. These modularized parts can be easily and precisely reconfigured with off-the-shelf or easy-to-machine parts that can meet different processing requirements such as mechanical mixing, chemical reaction, light activation, and solution vaporization. In addition, xPrint supports an open-source, highly customizable software design and simulation platform, which is applicable for simulating and facilitating smart material constructions. Furthermore, compared to inkjet or pneumatic syringe-based printing systems, xPrint has a large range of printable materials from synthesized polymers to natural micro-organism-living cells with a printing resolution from 10μm up to 5mm (droplet size). In this paper, we will introduce the system design in detail and three use cases to demonstrate the material variability and the customizability for users with different demands (e.g., designers, scientific researchers, or artists).",
  "authors": [
    {
      "name": "Guanyun Wang",
      "institution": "Zhejiang University, Hangzhou, China",
      "img": "/do/10.1145/contrib-87258679957/rel-imgonly/20201100____v6.jpg",
      "acmid": "87258679957",
      "orcid": "0000-0002-7904-1504"
    },
    {
      "name": "Lining Yao",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261439",
      "orcid": "0000-0002-8842-2317"
    },
    {
      "name": "Wen Wang",
      "institution": "Massachusetts Institute of Technology, Cambridge, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640585",
      "orcid": "missing"
    },
    {
      "name": "Jifei Ou",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81498656343",
      "orcid": "missing"
    },
    {
      "name": "Chin-Yi Cheng",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658697564",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    }
  ],
  "references": [
    {
      "text": "Agrawal, H., Umapathi, U., Kovacs, R., Frohnhofen, J., Chen, H.-T., Mueller, S., Baudisch, P. 2015. Protopiper: Physically Sketching Room-Sized Objects at Actual Scale. Proc. of UIST 2015, 427--436.  ",
      "doi": "10.1145/2807442.2807505"
    },
    {
      "text": "Beamish, J.A., Zhu, J., Kottke Marchant, K., Marchant, R.E. 2010. The effects of monoacrylated poly (ethylene glycol) on the properties of poly (ethylene glycol) diacrylate hydrogels used for tissue engineering. Journal of Biomedical Materials Research Part A 92, 441--450.",
      "doi": ""
    },
    {
      "text": "BioBot. Available from: http://www.biobots.io/.",
      "doi": ""
    },
    {
      "text": "Chen, X., Mahadevan, L., Driks, A., Sahin, O. 2014. Bacillus spores as building blocks for stimuliresponsive materials and nanogenerators. Nature nanotechnology 9, 137--141.",
      "doi": ""
    },
    {
      "text": "Fab@home. Available from: http://www.fabathome.org/.",
      "doi": ""
    },
    {
      "text": "Ferris, C.J., Gilmore, K.G., Wallace, G.G. 2013. Biofabrication: an overview of the approaches used for printing of living cells. Applied microbiology and biotechnology 97, 4243--4258.",
      "doi": ""
    },
    {
      "text": "FormLabs. Available from: http://formlabs.com/.",
      "doi": ""
    },
    {
      "text": "Grasshopper. Available from: http://www.grasshopper3d.com/.",
      "doi": ""
    },
    {
      "text": "Hardin, J.O., Ober, T.J., Valentine, A.D., Lewis, J.A. 2015. Microfluidic Printheads for Multimaterial 3D Printing of Viscoelastic Inks. Advanced Materials.",
      "doi": ""
    },
    {
      "text": "Hudson, S.E. 2014. Printing teddy bears: a technique for 3D printing of soft interactive objects. Proc. of CHI 2014, 459--468.  ",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Lo, J., Paulos, E. 2014. ShrinkyCircuits: sketching, shrinking, and formgiving for electronic circuits. Proc. of UIST 2014, 291--299.  ",
      "doi": "10.1145/2642918.2647421"
    },
    {
      "text": "Mironov, V. 2003. Printing technology to produce living tissue. Expert opinion on biological therapy 3, 701.",
      "doi": ""
    },
    {
      "text": "Miruchna, V., Walter, R., Lindlbauer, D., Lehmann, M., von Klitzing, R., Müller, J. 2015. GelTouch: Localized Tactile Feedback Through Thin, Programmable Gel. Proc. of UIST 2015, 3--10.  ",
      "doi": "10.1145/2807442.2807487"
    },
    {
      "text": "ModularScience. Available from: https://www.modularscience.com/.",
      "doi": ""
    },
    {
      "text": "Mogas-Soldevila, L., Duro-Royo, J., Oxman, N. 2014. Water-Based Robotic Fabrication: Large-Scale Additive Manufacturing of Functionally Graded Hydrogel Composites via Multichamber Extrusion. 3D Printing and Additive Manufacturing 1, 141--151.",
      "doi": ""
    },
    {
      "text": "Moyer, I.E. 2014. A gestalt framework for virtual machine control of automated tools. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Murphy, S.V., Atala, A. 2014. 3D bioprinting of tissues and organs. Nature biotechnology 32, 773--785.",
      "doi": ""
    },
    {
      "text": "Muth, J.T., Vogt, D.M., Truby, R.L., Mengüç, Y., Kolesky, D.B., Wood, R.J., Lewis, J.A. 2014. Embedded 3D printing of strain sensors within highly stretchable elastomers. Advanced Materials 26, 63076312.",
      "doi": ""
    },
    {
      "text": "Olberding, S., Wessely, M., Steimle, J. 2014. Printscreen: fabricating highly customizable thin-film touch-displays. Proc. of UIST 2014, 281--290.  ",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Parsa, S., Gupta, M., Loizeau, F., Cheung, K.C. 2010. Effects of surfactant and gentle agitation on inkjet dispensing of living cells. Biofabrication 2, 025003.",
      "doi": ""
    },
    {
      "text": "Peek, N. 2010. Rapid prototyping of green composites.",
      "doi": ""
    },
    {
      "text": "Rasmussen, M.K., Pedersen, E.W., Petersen, M.G., Hornbæk, K. 2012. Shape-changing interfaces: a review of the design space and open research questions. Proc. of CHI 2012, 735--744.  ",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Rutzerveld, C. Edible Growth. 2015; Available from: http://www.chloerutzerveld.com/edible-growth-2014.",
      "doi": ""
    },
    {
      "text": "Shi, J., Alves, N.M., Mano, J.F. 2006. Drug Release of pH/Temperature Responsive Calcium Alginate/Poly (N isopropylacrylamide) Semi IPN Beads. Macromolecular bioscience 6, 358--363.",
      "doi": ""
    },
    {
      "text": "Sitthi-Amorn, P., Ramos, J.E., Wangy, Y., Kwan, J., Lan, J., Wang, W., Matusik, W. 2015. MultiFab: a machine vision assisted platform for multi-material 3D printing. ACM Transactions on Graphics (TOG) 34, 129.  ",
      "doi": "10.1145/2766962"
    },
    {
      "text": "Stratasys. Available from: http://www.stratasys.com/3d-printers/design-series.",
      "doi": ""
    },
    {
      "text": "Sun, L., Huang, W.M., Ding, Z., Zhao, Y., Wang, C.C., Purnawali, H., Tang, C. 2012. Stimulus-responsive shape memory materials: a review. Materials & Design 33, 577--640.",
      "doi": ""
    },
    {
      "text": "Symes, M.D., Kitson, P.J., Yan, J., Richmond, C.J., Cooper, G.J., Bowman, R.W., Vilbrandt, T., Cronin, L. 2012. Integrated 3D-printed reactionware for chemical synthesis and analysis. Nature Chemistry 4, 349--354.",
      "doi": ""
    },
    {
      "text": "Wilson, W.C., Boland, T. 2003. Cell and organ printing 1: protein and cell printers. The Anatomical Record Part A: Discoveries in Molecular, Cellular, and Evolutionary Biology 272, 491--496.",
      "doi": ""
    },
    {
      "text": "Yao, L., Ou, J., Cheng, C.-Y., Steiner, H., Wang, W., Wang, G., Ishii, H. 2015. bioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces. Proc. of CHI 2015, 1--10.  ",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Zentoolworks. Available from: http://www.zentoolworks.com/.",
      "doi": ""
    }
  ]
}