{
  "doi": "10.1145/2858036.2858040",
  "title": "SwiVRChair: A Motorized Swivel Chair to Nudge Users' Orientation for 360 Degree Storytelling in Virtual Reality",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "1996-2000",
  "year": 2016,
  "badges": [],
  "abstract": "We present SwiVRChair, a motorized swivel chair to nudge users' orientation in 360 degree storytelling scenarios. Since rotating a scene in virtual reality (VR) leads to simulator sickness, storytellers currently have no way of controlling users' attention. SwiVRChair allows creators of 360 degree VR movie content to be able to rotate or block users' movement to either show certain content or prevent users from seeing something. To enable this functionality, we modified a regular swivel chair using a 24V DC motor and an electromagnetic clutch. We developed two demo scenarios using both mechanisms (rotate and block) for the Samsung GearVR and conducted a user study (n=16) evaluating the presence, enjoyment and simulator sickness for participants using SwiVRChair compared to self control (Foot Control). Users rated the experience using SwiVRChair to be significantly more immersive and enjoyable whilst having a decrease in simulator sickness.",
  "authors": [
    {
      "name": "Jan Gugenheimer",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "83458801557",
      "orcid": "0000-0002-6466-3845"
    },
    {
      "name": "Dennis Wolf",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658733790",
      "orcid": "missing"
    },
    {
      "name": "Gabriel Haas",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707632",
      "orcid": "missing"
    },
    {
      "name": "Sebastian Krebs",
      "institution": "Ulm University, Ulm, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020967",
      "orcid": "missing"
    },
    {
      "name": "Enrico Rukzio",
      "institution": "Institute of Media Informatics, Ulm University, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100239955",
      "orcid": "0000-0002-4213-2226"
    }
  ],
  "references": [
    {
      "text": "5 Lessons Learned While Making Lost. https://storystudio.oculus.com/en-us/blog/5-lessons-learned-while-making-lost/. Accessed: 2015-09-15.",
      "doi": ""
    },
    {
      "text": "RotoVR. http://www.rotovr.com/. Accessed: 2015-09-17.",
      "doi": ""
    },
    {
      "text": "Samsung Gear VR Innovator Edition FAQ. https://support.oculus.com/hc/en-us/articles/ 204358883-Samsung-Gear-VR-Innovator-Edition-FAQ. Accessed: 2015-09-17.",
      "doi": ""
    },
    {
      "text": "Bimal Aponso, Duc Tran, Jeffery Schroeder, and Steven D Beard. 2008. Rotorcraft Research at the NASA Vertical Motion Simulator. In ANNUAL FORUM PROCEEDINGS-AMERICAN HELICOPTER SOCIETY, Vol. 64. AMERICAN HELICOPTER SOCIETY, INC, 2390.",
      "doi": ""
    },
    {
      "text": "A Berthoz. 2000. The brain's sense of movement: perspectives in cognitive neuroscience. (2000).",
      "doi": ""
    },
    {
      "text": "Fabien Danieau, Julien Fleureau, Philippe Guillotel, Nicolas Mollet, Anatole Lécuyer, and Marc Christie. 2012. HapSeat: Producing Motion Sensation with Multiple Force-feedback Devices Embedded in a Seat. In Proceedings of the 18th ACM Symposium on Virtual Reality Software and Technology (VRST '12). ACM, New York, NY, USA, 69--76. DOI:http://dx.doi.org/10.1145/2407336.2407350  ",
      "doi": "10.1145/2407336.2407350"
    },
    {
      "text": "Laurence R Harris, MR Jenkin, D Zikovitz, Fara Redlick, P Jaekl, UT Jasiobedzka, HL Jenkin, and Robert S Allison. 2002. Simulating self-motion I: Cues for the perception of motion. Virtual Reality 6, 2 (2002), 75--85.",
      "doi": ""
    },
    {
      "text": "Ali Israr and Ivan Poupyrev. 2011. Tactile Brush: Drawing on Skin with a Tactile Grid Display. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 2019--2028. DOI:http://dx.doi.org/10.1145/1978942.1979235  ",
      "doi": "10.1145/1978942.1979235"
    },
    {
      "text": "DH Kim. 1999. Development of method for quantification and analysis of simulator sickness in a driving simulation environment. Doctoral dissertation, Hanyang University, Seoul, South Korea (1999).",
      "doi": ""
    },
    {
      "text": "Hartmut Koenitz. 2010. Towards a Theoretical Framework for Interactive Digital Narrative. In Interactive Storytelling, Ruth Aylett, MeiYii Lim, Sandy Louchart, Paolo Petta, and Mark Riedl (Eds.). Lecture Notes in Computer Science, Vol. 6432. Springer Berlin Heidelberg, 176--185. DOI: http://dx.doi.org/10.1007/978-3-642-16638-9_22 ",
      "doi": "10.5555/1926497.1926525"
    },
    {
      "text": "Eugenia M Kolasinski. 1995. Simulator Sickness in Virtual Environments. Technical Report. DTIC Document.",
      "doi": ""
    },
    {
      "text": "J.J.-W. Lin, H.B.L. Duh, D.E. Parker, H. Abi-Rached, and T.A. Furness. 2002. Effects of field of view on presence, enjoyment, memory, and simulator sickness in a virtual environment. In Virtual Reality, 2002. Proceedings. IEEE. 164--171. DOI:http://dx.doi.org/10.1109/VR.2002.996519 ",
      "doi": "10.5555/580130.835889"
    },
    {
      "text": "Randy Pausch, Jon Snoddy, Robert Taylor, Scott Watson, and Eric Haseltine. 1996. Disney's Aladdin: First Steps Toward Storytelling in Virtual Reality. In Proceedings of the 23rd Annual Conference on Computer Graphics and Interactive Techniques (SIGGRAPH '96). ACM, New York, NY, USA, 193-- 203. DOI:http://dx.doi.org/10.1145/237170.237257  ",
      "doi": "10.1145/237170.237257"
    },
    {
      "text": "Doug Stewart. 1965. A platform with six degrees of freedom. Proceedings of the institution of mechanical engineers 180, 1 (1965), 371--386.",
      "doi": ""
    },
    {
      "text": "Mirjam Vosmeer and Ben Schouten. 2014. Interactive Cinema: Engagement and Interaction. In Interactive Storytelling, Alex Mitchell, Clara Fernndez-Vara, and David Thue (Eds.). Lecture Notes in Computer Science, Vol. 8832. Springer International Publishing, 140--147. DOI: http://dx.doi.org/10.1007/978-3-319-12337-0_14",
      "doi": ""
    }
  ]
}