{
  "doi": "10.1145/2858036.2858245",
  "title": "Linespace: A Sensemaking Platform for the Blind",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "2175-2185",
  "year": 2016,
  "badges": [],
  "abstract": "For visually impaired users, making sense of spatial information is difficult as they have to scan and memorize content before being able to analyze it. Even worse, any update to the displayed content invalidates their spatial memory, which can force them to manually rescan the entire display. Making display contents persist, we argue, is thus the highest priority in designing a sensemaking system for the visually impaired. We present a tactile display system designed with this goal in mind. The foundation of our system is a large tactile display (140x100cm, 23x larger than Hyperbraille), which we achieve by using a 3D printer to print raised lines of filament. The system's software then trades in this space in order to minimize screen updates. Instead of panning and zooming, for example, our system creates additional views, leaving display contents intact and thus supporting users in preserving their spatial memory. We illustrate our system and its design principles at the example of four spatial applications. We evaluated our system with six blind users. Participants responded favorably to the system and expressed, for example, that having multiple views at the same time was helpful. They also judged the increased expressiveness of lines over the more traditional dots as useful for encoding information.",
  "authors": [
    {
      "name": "Saiganesh Swaminathan",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659824278",
      "orcid": "missing"
    },
    {
      "name": "Thijs Roumen",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658700053/rel-imgonly/44627890994_233b53923c_o.jpg",
      "acmid": "99658700053",
      "orcid": "missing"
    },
    {
      "name": "Robert Kovacs",
      "institution": "Hasso-Plattner-Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-99658696163/rel-imgonly/robert_kovacs.jpg",
      "acmid": "99658696163",
      "orcid": "0000-0002-9427-2861"
    },
    {
      "name": "David Stangl",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021079",
      "orcid": "missing"
    },
    {
      "name": "Stefanie Mueller",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81548921556/rel-imgonly/81548921556.jpg",
      "acmid": "81548921556",
      "orcid": "0000-0001-7743-7807"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "3Doodler. http://the3doodler.com",
      "doi": ""
    },
    {
      "text": "Patrick Baudisch, Desney Tan, Maxime Collomb, Dan Robbins, Ken Hinckley, Maneesh Agrawala, Shengdong Zhao, and Gonzalo Ramos. Phosphor: explaining transitions in the user interface using afterglow effects. In Proceedings of the 19th annual ACM symposium on User interface software and technology (UIST '06), 169--178.  ",
      "doi": "10.1145/1166253.1166280"
    },
    {
      "text": "Anke Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2012. Design and user satisfaction of interactive maps for visually impaired people. In Proceedings of the 13th international conference on Computers Helping People with Special Needs (ICCHP'12), 544--551.  ",
      "doi": "10.1007/978-3-642-31534-3_80"
    },
    {
      "text": "Craig Brown and Amy Hurst. VizTouch: automatically generated tactile visualizations of coordinate spaces. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), Stephen N. Spencer (Ed.), 131--138.  ",
      "doi": "10.1145/2148131.2148160"
    },
    {
      "text": "Erin Buehler, Shaun K. Kane, and Amy Hurst.. ABC and 3D: opportunities and obstacles to 3D printing in special education environments. In Proceedings of the 16th international ACM SIGACCESS conference on Computers & accessibility (ASSETS '14), 107--114.  ",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "Chetz Colwell, Helen Petrie, Diana Kornbrot, Andrew Hardwick, and Stephen Furner. 1998. Haptic virtual reality for blind computer users. In Proceedings of the third international ACM conference on Assistive technologies (ASSETS '98), 92--99.  ",
      "doi": "10.1145/274497.274515"
    },
    {
      "text": "Andrew Crossan and Stephen Brewster. Multimodal Trajectory Playback for Teaching Shape Information and Trajectories to Visually Impaired Computer Users. ACM Trans. Access. Comput. 1, 2, Article 12, 2008.  ",
      "doi": "10.1145/1408760.1408766"
    },
    {
      "text": "Polly Edman. Tactile graphics. American Foundation for the Blind, 1992.",
      "doi": ""
    },
    {
      "text": "HyperBraille, http://www.hyperbraille.de",
      "doi": ""
    },
    {
      "text": "C. Goncu, S. Marinai, K. Marriott. Generation of accessible graphics. In Proceedings of 22nd Mediterranean Conference: Control and Automation (MED), 2014, 169--174.",
      "doi": ""
    },
    {
      "text": "Yahoo Japan, Hands-on search. http://sawareru.jp/en/",
      "doi": ""
    },
    {
      "text": "Chandrika Jayant, Matt Renzelmann, Dana Wen, Satria Krisnandi, Richard Ladner, and Dan Comden. 2007. Automated tactile graphics translation: in the field. In Proceedings of the 9th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '07), 75--82.  ",
      "doi": "10.1145/1296843.1296858"
    },
    {
      "text": "Shaun K. Kane and Jeffrey P. Bigham. Tracking @stemxcomet: teaching programming to blind students via 3D printing, crisis management, and twitter. In Proceedings of the 45th ACM technical symposium on Computer science education (SIGCSE '14), 247--252.  ",
      "doi": "10.1145/2538862.2538975"
    },
    {
      "text": "Jeeeun Kim and Tom Yeh. Toward 3D-Printed Movable Tactile Pictures for Children with Visual Impairments. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15), 28152824.  ",
      "doi": "10.1145/2702123.2702144"
    },
    {
      "text": "Martin Kurze. TGuide: a guidance system for tactile image exploration. In Proceedings of the third international ACM conference on Assistive technologies (ASSETS '98), 85--91.  ",
      "doi": "10.1145/274497.274514"
    },
    {
      "text": "Martin Kurze.. TDraw: a computer-based tactile drawing tool for blind people. In Proceedings of the second annual ACM conference on Assistive technologies (ASSETS '96), 131--138.  ",
      "doi": "10.1145/228347.228368"
    },
    {
      "text": "Steven Landau and Lesley Wells. Merging tactile sensory input and audio data by means of the talking tactile tablet. In Proceedings of EuroHaptics '03, 414418.",
      "doi": ""
    },
    {
      "text": "Joshua A. Miele., Steven Landau, and Deborah Gilden. Talking TMAP: Automated generation of audio-tactile maps using Smith-Kettlewell's TMAP software. British Journal of Visual Impairment 24, no. 2 (2006): 93--100.",
      "doi": ""
    },
    {
      "text": "Thomas Pietrzak, Benoît Martin, Isabelle Pecci, Rami Saarinen, Roope Raisamo, and Janne Järvi. 2007. The micole architecture: multimodal support for inclusion of visually impaired children. In Proceedings of the 9th international conference on Multimodal interfaces (ICMI'07), 193--200.  ",
      "doi": "10.1145/1322192.1322227"
    },
    {
      "text": "Beryl Plimmer, Andrew Crossan, Stephen A. Brewster, and Rachel Blagojevic. Multimodal collaborative handwriting training for visually-impaired people. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 393--402.  ",
      "doi": "10.1145/1357054.1357119"
    },
    {
      "text": "Denise Prescher, Gerhard Weber, and Martin Spindler. 2010. A tactile windowing system for blind users. In Proceedings of the 12th international ACM SIGACCESS conference on Computers and accessibility (ASSETS '10), 91--98. h  ",
      "doi": "10.1145/1878803.1878821"
    },
    {
      "text": "PrintrBot. http://printrbot.com/",
      "doi": ""
    },
    {
      "text": "Raised Line Drawing Kits: http://www.maxiaids.com/raised-line-drawing-kit",
      "doi": ""
    },
    {
      "text": "Christophe Ramstein. Combining haptic and braille technologies: design issues and pilot study. In Proceedings of the second annual ACM conference on Assistive technologies (ASSETS '96), 37--44.  ",
      "doi": "10.1145/228347.228355"
    },
    {
      "text": "Saiganesh Swaminathan, Conglei Shi, Yvonne Jansen, Pierre Dragicevic, Lora A. Oehlberg, and Jean-Daniel Fekete. Supporting the design and fabrication of physical visualizations. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 3845--3854.  ",
      "doi": "10.1145/2556288.2557310"
    },
    {
      "text": "Swell-form-graphics: http://www.americanthermoform.com/product/swellform-graphics-ii-machine/",
      "doi": ""
    }
  ]
}