{
  "doi": "10.1145/2858036.2858363",
  "title": "Everyday Food Science as a Design Space for Community Literacy and Habitual Sustainable Practice",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "1786-1797",
  "year": 2016,
  "badges": [],
  "abstract": "Focusing on food as a platform for everyday science, this paper details our fieldwork with practitioners who routinely experiment with preserving, fermenting, brewing, pickling, foraging for, and healing with food. We engage with these at-home science initiatives as community-driven efforts to construct knowledge and envision alternatives to top-down modes of production. Our findings detail the motivations, challenges, and workarounds behind these practices, as well as participants' hybrid lay-professional knowledge, and the iterative mechanisms by which their expertise is scaffolded. Our paper contributes to CHI's amateur/citizen science research by examining how social, digital, and physical materials shape scientific literacy; and to sustainable HCI by presenting habitual practice as an alternative (bottom-up) form of food production and preservation.",
  "authors": [
    {
      "name": "Stacey Kuznetsov",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338489421",
      "orcid": "missing"
    },
    {
      "name": "Christina J. Santana",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019380",
      "orcid": "missing"
    },
    {
      "name": "Elenore Long",
      "institution": "Arizona State University, Tempe, AZ, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021732",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aoki, P. M., Honicky, R. J., Mainwaring, A., Myers, C., Paulos, E., Subramanian, S., Woodruff, A. (2009). A Vehicle for Research: Using Street Sweepers to Explore the Landscape of Environmental Community Action. CHI'09. Boston, MA. 379--384.  ",
      "doi": "10.1145/1518701.1518762"
    },
    {
      "text": "Bardzell, S., Bardzell, J. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. CHI '11, 675--684.  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Bardzell, S. Bardzell, J. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. CHI '11, 675--684.  ",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Belasco, W. J. 201 Appetite for change: How the counterculture took on the food industry. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Blevis, E. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. CHI '07, 503--512.  ",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Brynjarsdottir, H., Håkansson, M., Pierce, J., Baumer, E., DiSalvo, C., Sengers, P. 2012. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. CHI '12, 947--95  ",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Clement, A., McPhail, B., Smith, K. L., Ferenbok, J. 2012. Probing, mocking and prototyping: participatory approaches to identity infrastructuring. PDC'12, 21--30.  ",
      "doi": "10.1145/2347635.2347639"
    },
    {
      "text": "Coburn, J. (2005) Street Science. The MIT Press.",
      "doi": ""
    },
    {
      "text": "Cottman-Fields, M., Brereton, M., Wimmer, J., Roe, P. 2014. Collaborative extension of biodiversity monitoring protocols in the bird watching community. PDC '14, Vol. 2, 111--114.  ",
      "doi": "10.1145/2662155.2662193"
    },
    {
      "text": "DiSalvo, C. (2009). Design and the Construction of Publics. Design Issues (MIT) 25, no. 1.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C. Design, democracy, and agonistic pluralism. Proceedings of the Design Research Society Conference 2010, Montreal, 2010, 6.",
      "doi": ""
    },
    {
      "text": "DiSalvo, C., Louw, M., Coupland, J., Steiner, M. (2009). Local issues, local uses: tools for robotics and sensing in community contexts. In Proce. of C&C '09, 245--254.  ",
      "doi": "10.1145/1640233.1640271"
    },
    {
      "text": "DiSalvo, C., Sengers, P., Brynjarsdóttir, H. 2010. Mapping the landscape of sustainable HCI. CHI '10, 1975--1984.  ",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Dourish, P. 2010. HCI and environmental sustainability: the politics of design and the design of politics. DIS '10, 1--10.  ",
      "doi": "10.1145/1858171.1858173"
    },
    {
      "text": "DuPuis, E. M., & Goodman, D. (2005). Should we go \"home\" to eat?: toward a reflexive politics of localism. Journal of rural studies, 21(3), 359--371.",
      "doi": ""
    },
    {
      "text": "Eisenman, S. B. 2009. BikeNet: A mobile sensing system for cyclist experience mapping. Proceedings of Embedded networked sensor systems. SenSys '0, 87--101.  ",
      "doi": "10.1145/1322263.1322273"
    },
    {
      "text": "Eveleigh, A., Jennett, C., Blandford, A., Brohan, P., Cox, A. L. 2014. Designing for dabblers and deterring drop-outs in citizen science. CHI '14, 2985--2994.  ",
      "doi": "10.1145/2556288.2557262"
    },
    {
      "text": "Ganglbauer, E., Fitzpatrick, G., Güldenpfennig, F. 2015. Why and what did we throw out?: Probing on Reflection through the Food Waste Diary. CHI;15, 1105--1114.  ",
      "doi": "10.1145/2702123.2702284"
    },
    {
      "text": "Gaver, W. W., Bowers, J., Boehner, F., K., Boucher, A., Cameron, D. W. T., Hauenstein, M., Jarvis, N., Pennington, S. 2013. Indoor weather stations: investigating a ludic approach to environmental HCI through batch prototyping. CHI '13, 3451--3460.  ",
      "doi": "10.1145/2470654.2466474"
    },
    {
      "text": "Gross, S., Toombs, A., Wain, J., Walorski, K. 2011. Foodmunity: designing community interactions over food. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11), 1019--1024.  ",
      "doi": "10.1145/1979742.1979504"
    },
    {
      "text": "Honicky, R., Brewer, E. A., Paulos, E., White, R. (2008). N-smarts: networked suite of mobile atmospheric real-time sensors. NSDR '08, 25--30.  ",
      "doi": "10.1145/1397705.1397713"
    },
    {
      "text": "Iacovides, I., Jennett, C., Cornish-Trestrail, C., Cox, A. L. 2013. Do games attract or sustain engagement in citizen science?: a study of volunteer motivations. CHI EA '13, 1101--1106.  ",
      "doi": "10.1145/2468356.2468553"
    },
    {
      "text": "Kalnikaite, V., Rogers, Y., Bird, J., Villar, N., Bachour, N., Payne, S., Todd, P. M., Schöning, J., Krüger, A., Kreitmayer, S. 2011. How to nudge in Situ: designing lambent devices to deliver salient information in supermarkets. UbiComp '11, 11--20.  ",
      "doi": "10.1145/2030112.2030115"
    },
    {
      "text": "Kim, S., Mankoff, J., Paulos, E. 2013. Sensr: evaluating a flexible framework for authoring mobile data-collection tools for citizen science. CSCW '13, 1453--1462.  ",
      "doi": "10.1145/2441776.2441940"
    },
    {
      "text": "Kim, S., Robson, C., Zimmerman, T., Pierce, J., Haber, E. M. 2011. Creek watch: pairing usefulness and usability for successful citizen science. CHI'11, 2125--2134.  ",
      "doi": "10.1145/1978942.1979251"
    },
    {
      "text": "Kusmierczyk, T., Trattner, C., Nørvåg, C. 2015. Temporality in Online Food Recipe Consumption and Production. WWW'15, 55--56.  ",
      "doi": "10.1145/2740908.2742752"
    },
    {
      "text": "Kuznetsov, S., Odom, W., Pierce, J., Paulos, E. 2011. Nurturing natural sensors. UbiComp '11, 227--236.  ",
      "doi": "10.1145/2030112.2030144"
    },
    {
      "text": "Kuznetsov, S., Taylor, A. S., Regan, T., Villar, N., Paulos, E. 2012. At the seams: DIYbio and opportunities for HCI. DIS '12, 258--267.  ",
      "doi": "10.1145/2317956.2317997"
    },
    {
      "text": "LeDantec, C. A., Christensen, J. E., Bailey, M., Farrell, R.G., Ellis, J. B., Davis, C. M., Kellogg, W. A., Edwards, W. K. (2010). \"A Tale of Two Publics: Democratizing Design at the Margins.\" In Proc of. DIS'10  ",
      "doi": "10.1145/1858171.1858174"
    },
    {
      "text": "Lindtner, S., Hertz, G. D., Dourish, P. 2014. Emerging sites of HCI innovation: hackerspaces, hardware startups & incubators. CHI '14, 439--448.  ",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "Lyle, P., Choi, J. H., Foth, M. 2015. Growing food in the city: design ideations for urban residential gardeners. In Proceedings of the 7th International Conference on Communities and Technologies (C&T '15), 89--97.  ",
      "doi": "10.1145/2768545.2768549"
    },
    {
      "text": "Luther, K., Counts, S., Stecher, K. B., Hoff, A., Johns, P. 2009. Pathfinder: an online collaboration environment for citizen scientists. CHI '09, 239--248.  ",
      "doi": "10.1145/1518701.1518741"
    },
    {
      "text": "Massung, E., Coyle, D., Cater, C. F., Jay, M., Preist, C. 2013. Using crowdsourcing to support pro-environmental community activism. CHI '13, 371--380.  ",
      "doi": "10.1145/2470654.2470708"
    },
    {
      "text": "Moran, S., Pantidi, N., Rodden, T., Chamberlain, A., Griffiths, C., Zilli, D., Merrett, G., Rogers, A. 2014. Listening to the forest and its curators: lessons learnt from a bioacoustic smartphone application deployment. CHI '14, 2387--2396.  ",
      "doi": "10.1145/2556288.2557022"
    },
    {
      "text": "Nabhan, G. 2009. Coming home to eat: The pleasures and politics of local food. WW Norton & Company.",
      "doi": ""
    },
    {
      "text": "Odom, W., Banks, R., Durrant, A., Kirk, D., Pierce, J. 2012. Slow technology: critical reflection and future directions. DIS '12, 816--817.  ",
      "doi": "10.1145/2317956.2318088"
    },
    {
      "text": "3Odom, W., Pierce, J., Stolterman, E., Blevis, E. 2009. Understanding why we preserve some things and discard others in the context of interaction design. CHI '09, 1053--1062.  ",
      "doi": "10.1145/1518701.1518862"
    },
    {
      "text": "3Pierce, J., Paulos, E. 2010. Materializing Energy. DIS'10, 113--122.  ",
      "doi": "10.1145/1858171.1858193"
    },
    {
      "text": "3Pierce, J., Paulos, E. 2011. Second-hand interactions: investigating reacquisition and dispossession practices around domestic objects. CHI '11, 2385--2394.  ",
      "doi": "10.1145/1978942.1979291"
    },
    {
      "text": "Pine, K. H., Liboiron, M. 2015. The Politics of Measurement and Action. CHI '15, 3147--3156.  ",
      "doi": "10.1145/2702123.2702298"
    },
    {
      "text": "Rogers, Y., Price, S., Fitzpatrick, G., Fleck, R., Harris, E., Smith, H., Randell, C., Muller, H., O'Malley, C., Stanton, D., Thompson, M., Weal, M. (2004). Ambient wood: designing new forms of digital augmentation for learning outdoors. Interaction design and children: building a community, p. 3--10.  ",
      "doi": "10.1145/1017833.1017834"
    },
    {
      "text": "Rotman, D., Preece, M., Hammock, J., Procita, K., Hansen, D., Parr, C., Lewis, D., Jacobs, D. 2012. Dynamic changes in motivation in collaborative citizen-science projects. In Proc, of CSCW '12, 217--226.  ",
      "doi": "10.1145/2145204.2145238"
    },
    {
      "text": "Ryokai, K., Oehlberg, L., Manoochehri, M., Agogino, A. (2011). GreenHat: exploring the natural environment through experts' perspectives. Proc. CHI'11, 2149--2152.  ",
      "doi": "10.1145/1978942.1979254"
    },
    {
      "text": "Santana, C., Kuznetsov, S., Schmeckpeper, S., Curry, L., Long, E.,, Davis, E., Koerner, H., McQuarrie, K. \"Mindful Persistence: Literacies for Taking up and Sustaining Fermented-Food Projects\". Community Literacy Journal 10.1 (2015)",
      "doi": ""
    },
    {
      "text": "Schneider, B., Strait, M., Muller, L., Elfenbein, S., Shaer, O., Shen, C. 2012. Phylo-Genie: engaging students in collaborative 'tree-thinking' through tabletop techniques. CHI '12, 3071--3080.  ",
      "doi": "10.1145/2207676.2208720"
    },
    {
      "text": "Shaer, O., Kol, G., Strait, M., Fan, C., Grevet, C., Elfenbein, S. 2010. G-nome surfer: a tabletop interface for collaborative exploration of genomic data. CHI '10, 1427--1436.  ",
      "doi": "10.1145/1753326.1753539"
    },
    {
      "text": "Shrinivasan, Y.B., Jain, M., Seetharam, D. P., Choudhary, A., Huang, E. M., Dillahunt, T., Mankoff, J. 2013. Deep conservation in urban India and its implications for the design of conservation technologies. CHI '13, 1969--1978.  ",
      "doi": "10.1145/2470654.2466261"
    },
    {
      "text": "Song, K., Kim, G., Han, I., Lee, J., Park, J. H., Ha, S. 2011. CheMO: mixed object instruments and interactions for tangible chemistry experiments. CHI EA '11, 2305--2310.  ",
      "doi": "10.1145/1979742.1979907"
    },
    {
      "text": "Strengers, Y. A. A. 2011. Designing eco-feedback systems for everyday life. CHI '11, 2135--2144.  ",
      "doi": "10.1145/1978942.1979252"
    },
    {
      "text": "Thieme, A., Comber, R., Miebach, J. Weeden, J, Kraemer, N., Lawson, S., Olivier, P. 2012. \"We've bin watching you\": designing for reflection and social persuasion to promote sustainable lifestyles. CHI '12, 2337--2346.  ",
      "doi": "10.1145/2207676.2208394"
    },
    {
      "text": "Tinati, R., Kleek, M. V., Simperl, E., Luczak-Rösch, M., Simpson, R., Shadbolt, N. 2015. Designing for Citizen Data Analysis: A Cross-Sectional Case Study of a Multi-Domain Citizen Science Platform. CHI '15, 4069--4078.  ",
      "doi": "10.1145/2702123.2702420"
    },
    {
      "text": "Torrey, C., Churchill, E. F., McDonald, D. W. 2009. Learning how: the search for craft knowledge on the internet. CHI'09, 1371--1380.  ",
      "doi": "10.1145/1518701.1518908"
    },
    {
      "text": "United Nations, Department of Economic and Social Affairs. World Population to 2300. U.N. NY, 2004",
      "doi": ""
    },
    {
      "text": "Valdes, C., Ferreirae, M., Feng, T., Wang, H., Tempel, K., Liu, S., Shaer, O. 2012. A collaborative environment for engaging novices in scientific inquiry. ITS '12, 109--118.  ",
      "doi": "10.1145/2396636.2396654"
    },
    {
      "text": "Wakkary, R., Schilling, M. L, Dalton, M. A., Hauser, S., Desjardins, A., Zhang, X., Lin, H. W. J. 2015. Tutorial Authorship and Hybrid Designers: The Joy (and Frustration) of DIY Tutorials. CHI '15, 609--618.  ",
      "doi": "10.1145/2702123.2702550"
    },
    {
      "text": "Willett, W., Aoki, P., Kumar, N., Subramanian, S., Woodruff, A. (2010). Common Sense Community: Scaffolding Mobile Sensing and Analysis for Novice Users. Pervasive'10, 301--318  ",
      "doi": "10.1007/978-3-642-12654-3_18"
    },
    {
      "text": "Yeh, R., Liao, C., Klemmer, S., Guimbretière, F., Lee, B., Kakaradov, B., Stamberger, J., Paepcke, A. 2006. ButterflyNet: a mobile capture and access system for field biology research. CHI '06, 571--580.  ",
      "doi": "10.1145/1124772.1124859"
    }
  ]
}