{
  "doi": "10.1145/2858036.2858113",
  "title": "Destructive Games: Creating Value by Destroying Valuable Physical Objects",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "3970-3974",
  "year": 2016,
  "badges": [],
  "abstract": "While personal fabrication tools, such as laser cutters and milling machines, are intended for construction, we are exploring their use for destruction. We present a series of games that result in valuable physical objects being destroyed objects owned by the players. Interestingly, we found that we can design these games to be desirable to play, despite the loss of the object, by instead producing social value. As part of a user study, twelve students played a destructive game in which a laser cutter cut up their own money bills. Surprisingly, 8 out of 12 participants would play again. They shared their post-game stories with us.",
  "authors": [
    {
      "name": "David Eickhoff",
      "institution": "Hasso Plattner Institute, Potsdam, Germany, Potsdam, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021979",
      "orcid": "missing"
    },
    {
      "name": "Stefanie Mueller",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81548921556/rel-imgonly/81548921556.jpg",
      "acmid": "81548921556",
      "orcid": "0000-0001-7743-7807"
    },
    {
      "name": "Patrick Baudisch",
      "institution": "Hasso Plattner Institute, Potsdam, Germany",
      "img": "/do/10.1145/contrib-81100137268/rel-imgonly/15g9310crop3.jpg",
      "acmid": "81100137268",
      "orcid": "0000-0002-5005-6868"
    }
  ],
  "references": [
    {
      "text": "Eric P.S. Baumer and M. Six Silberman. 2011. When the implication is not to design (technology). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 2271--2274.  ",
      "doi": "10.1145/1978942.1979275"
    },
    {
      "text": "DRM Chair, 2013. http://www.dvice.com/2013--32/heres-chair-destroys-itself",
      "doi": ""
    },
    {
      "text": "Euro Destruction. http://eur-lex.europa.eu/LexUriServ/ LexUriServ.do?uri= CELEX:32010H0191:EU:HTML",
      "doi": ""
    },
    {
      "text": "Tanja Döring, Axel Sylvester, and Albrecht Schmidt. A design space for ephemeral user interfaces. In Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction (TEI '13), 75--82.  ",
      "doi": "10.1145/2460625.2460637"
    },
    {
      "text": "Marco Evaristti. Helena. 2000. www.evaristti.com/marco/Mine_album/Pages/Helena.html",
      "doi": ""
    },
    {
      "text": "Tony Fry. Design futuring: sustainability, ethics, and new practice. Berg. 2009.",
      "doi": ""
    },
    {
      "text": "Zach Gage. Lose/Lose. 2009. www.stfj.net/index2.php?project=art/2009/loselose",
      "doi": ""
    },
    {
      "text": "Ken Goldberg, Eric Paulos, John Canny, Judith Donath, and Mark Pauline. Legal tender. In ACM SIGGRAPH 96 Visual Proceedings: The art and interdisciplinary programs of SIGGRAPH '96 (SIGGRAPH '96), 43--44.  ",
      "doi": "10.1145/253607.253642"
    },
    {
      "text": "Gustav Metzger. Machine, Auto-Creative and AutoDestructive Art. In Proceedings of Journal Ark. 1962.",
      "doi": ""
    },
    {
      "text": "Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive construction: interactive fabrication of functional mechanical devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology (UIST '12), 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "One Single Life. FreshTone Games. 2009. http://www.youtube.com/watch?v=8VQzMjckfAk",
      "doi": ""
    },
    {
      "text": "James Pierce and Eric Paulos. 2014. Counterfunctional things: exploring possibilities in designing digital limitations. In Proceedings of the 2014 conference on Designing interactive systems (DIS '14), USA, 375--384.  ",
      "doi": "10.1145/2598510.2598522"
    },
    {
      "text": "Tilman Reiff, Volker Morawe. PainStation. 2001. http://www.painstation.de",
      "doi": ""
    },
    {
      "text": "Julia Ringler and Holger Reckter. 2012. DESU 100: about the temptation to destroy a robot. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction (TEI '12), 151--152.  ",
      "doi": "10.1145/2148131.2148164"
    },
    {
      "text": "Harvey Sacks. Lectures on Conversation: Volumes I and II. Oxford: Blackwell, 1992.",
      "doi": ""
    },
    {
      "text": "Social Roulette, www.socialroulette.net",
      "doi": ""
    },
    {
      "text": "Nurit Tal-Or. 2010. Bragging in the right context: Impressions formed of self-promoters who create a context for their boasts. Social Influences 5, 1, 2010, 23--39.",
      "doi": ""
    },
    {
      "text": "Katie Salen. Rules of Play: Game Design Fundamentals. The MIT Press. 2003. ",
      "doi": "10.5555/1215723"
    },
    {
      "text": "The Big Deal. Fox, 1963.",
      "doi": ""
    },
    {
      "text": "Trashed TV show. MTV, 1993.",
      "doi": ""
    },
    {
      "text": "José P. Zagal, Staffan Björk, and Chris Lewis. Dark Patterns in the Design of Games. In: Foundations of Digital Games, 2013.",
      "doi": ""
    },
    {
      "text": "John Zimmerman. 2009. Designing for the self: making products that help people become the person they desire to be. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 395404.  ",
      "doi": "10.1145/1518701.1518765"
    }
  ]
}