{
  "doi": "10.1145/2858036.2858116",
  "title": "\"With most of it being pictures now, I rarely use it\": Understanding Twitter's Evolving Accessibility to Blind Users",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "5506-5516",
  "year": 2016,
  "badges": [],
  "abstract": "Social media is an increasingly important part of modern life. We investigate the use of and usability of Twitter by blind users, via a combination of surveys of blind Twitter users, large-scale analysis of tweets from and Twitter profiles of blind and sighted users, and analysis of tweets containing embedded imagery. While Twitter has traditionally been thought of as the most accessible social media platform for blind users, Twitter's increasing integration of image content and users' diverse uses for images have presented emergent accessibility challenges. Our findings illuminate the importance of the ability to use social media for people who are blind, while also highlighting the many challenges such media currently present this user base, including difficulty in creating profiles, in awareness of available features and settings, in controlling revelations of one's disability status, and in dealing with the increasing pervasiveness of image-based content. We propose changes that Twitter and other social platforms should make to promote fuller access to users with visual impairments.",
  "authors": [
    {
      "name": "Meredith Ringel Morris",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81452607037/rel-imgonly/merriesquare.jpg",
      "acmid": "81452607037",
      "orcid": "0000-0003-1436-9223"
    },
    {
      "name": "Annuska Zolyomi",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020320",
      "orcid": "missing"
    },
    {
      "name": "Catherine Yao",
      "institution": "Microsoft Research & Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021670",
      "orcid": "missing"
    },
    {
      "name": "Sina Bahram",
      "institution": "North Carolina State University, Raleigh, NC, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332488893",
      "orcid": "missing"
    },
    {
      "name": "Jeffrey P. Bigham",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81338487593",
      "orcid": "0000-0002-2072-0625"
    },
    {
      "name": "Shaun K. Kane",
      "institution": "University of Colorado Boulder, Boulder, CO, USA",
      "img": "/do/10.1145/contrib-81329489903/rel-imgonly/kane-headshot.jpg",
      "acmid": "81329489903",
      "orcid": "0000-0002-0276-9417"
    }
  ],
  "references": [
    {
      "text": "Ammari, T., Morris, M.R., and Schoenebeck, S.Y. Accessing Social Support and Overcoming Judgment on Social Media among Parents of Children with Special Needs. Proceedings of ICWSM 2014.",
      "doi": ""
    },
    {
      "text": "Be My Eyes. http://bemyeyes.org.",
      "doi": ""
    },
    {
      "text": "Bigham, J.P., Kaminsky, R.S., Ladner, R.E., Danielsson, O.M., and Hempton, G.L. WebInSight: Making Web Images Accessible. Proceedings of ASSETS 2006.  ",
      "doi": "10.1145/1168987.1169018"
    },
    {
      "text": "Bigham, J.P., Jayant, C., Ji, H., Little, G., Miller, A., Miller, R.C., Miller, R., Tatarowicz, A., White, B., White, S., and Yeh, T. VizWiz: Nearly Real-Time Answers to Visual Questions. Proceedings of UIST 2010.  ",
      "doi": "10.1145/1866029.1866080"
    },
    {
      "text": "Brady, E., Zhong, Y., Morris, M.R., and Bigham, J. Investigating the Appropriateness of Social Network Question Asking as a Resource for Blind Users. Proceedings of CSCW 2013.  ",
      "doi": "10.1145/2441776.2441915"
    },
    {
      "text": "Buzzi, M.C., Buzzi, M., and Leporini, B. Web 2.0: Twitter and the blind. Proceedings of CHItaly 2011.  ",
      "doi": "10.1145/2037296.2037333"
    },
    {
      "text": "Chancellor, S., Pater, J., Clear, T., Gilbert, E., and De Choudhury, M. #thyghgapp: Instagram Content Moderation and Lexical Variation in Pro-Eating Disorder Communities. Proceedings of CSCW 2016 (to appear).  ",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Chicken Nugget. https://qcontinuum.net/chicken_nugget/.",
      "doi": ""
    },
    {
      "text": "Cundiff, C. \"Alt Text Bot.\" AT&T NYU Connect Ability Challenge, June 23, 2015. http://connectability.challengepost.com/submissions/37 785-alt text-bot",
      "doi": ""
    },
    {
      "text": "De Choudhury, M., Counts, S., and Horvitz, E. Predicting Postpartum Changes in Emotion and Behavior via Social Media. Proceedings of CHI 2013.  ",
      "doi": "10.1145/2470654.2466447"
    },
    {
      "text": "Dorsey, J. \"search + photos.\" The Official Twitter Blog, June 1, 2011.",
      "doi": ""
    },
    {
      "text": "Duggan, M., Ellison, N., Lampe, C., Lenhart, A., and Madden, M. Social Media Update 2014. Pew Internet and American Life Project, January 9, 2015.",
      "doi": ""
    },
    {
      "text": "EasyChirp. http://easychirp.com.",
      "doi": ""
    },
    {
      "text": "Fang, H., Gupta, S., Iandola, F., Srivastava, R.K., Deng, L., Dollár, P., Gao, J., He, X., Mitchell, M., Platt, J.C., Zitnick, C.L., and Zweig, G. From Captions to Visual Concepts and Back. Proceedings of CVPR 2015.",
      "doi": ""
    },
    {
      "text": "Goodwin, M., Susar, D., Nietzio, A., Snaprud, M., and Jensen, C.S. 2011. Global web accessibility analysis of national government portals and ministry web sites. Journal of Information Technology & Politics, 8(1), 41--67.",
      "doi": ""
    },
    {
      "text": "Hecht, B., Hong, L., Suh, B., and Chi, E.H. Tweets from Justin Bieber's Heart: The Dynamics of the \"Location\" Field in User Profiles. Proceedings of CHI 2011.  ",
      "doi": "10.1145/1978942.1978976"
    },
    {
      "text": "Honan, M. The Rise of the Screenshort. BuzzFeed News. December 19, 2014.",
      "doi": ""
    },
    {
      "text": "Jayant, C., Ji, H., White, S., and Bigham, J.P. Supporting Blind Photography. Proceedings of ASSETS 2011.  ",
      "doi": "10.1145/2049536.2049573"
    },
    {
      "text": "Karpathy, A. and Fei-Fei, L. Deep Visual-Semantic Alignments for Generating Image Descriptions. Proceedings of CVPR 2015.",
      "doi": ""
    },
    {
      "text": "Kosinski, M., Stillwell, D., and Graepel, T. Private traits and attributes are predictable from digital records of human behavior. Proceedings of the National Academy of Sciences, Vol. 110 No. 15, Feb. 12, 2013, pp. 5802--5805.",
      "doi": ""
    },
    {
      "text": "Kuksenok, K., Brooks, M., and Mankoff, J. Accessible Online Content Creation by End Users. Proceedings of CHI 2013.  ",
      "doi": "10.1145/2470654.2470664"
    },
    {
      "text": "Kwak, H., Lee, C., Park, H., and Moon, S. What is Twitter, a social network or a news media? Proceedings of WWW 2010.  ",
      "doi": "10.1145/1772690.1772751"
    },
    {
      "text": "Morris, M.R. Social Networking Site User by Mothers of Young Children. Proceedings of CSCW 2014.  ",
      "doi": "10.1145/2531602.2531603"
    },
    {
      "text": "Shi, Y. E-Government Web Site Accessibility in Australia and China: A Longitudinal Study. Social Science Computer Review, Fall 2006. 24: 378--385.",
      "doi": ""
    },
    {
      "text": "Smith, C. \"Facebook Users are Uploading 350 Million New Photos Each Day.\" Business Insider, Sept. 18, 2013.",
      "doi": ""
    },
    {
      "text": "TheQube. http://theqube.oire.org",
      "doi": ""
    },
    {
      "text": "Tufecki, Z. Big Questions for Social Media Big Data: Representativeness, Validity and Other Methodological Pitfalls. Proceedings of ICWSM 2014.",
      "doi": ""
    },
    {
      "text": "Twitter. \"Twitter Usage/Company Facts.\" https://about.twitter.com/company, retrieved July 27, 2015.",
      "doi": ""
    },
    {
      "text": "Vittinghoff, E. and McCulloch, C.E. Relaxing the Rule of Ten Events per Variable in Logistic and Cox Regression. American Journal of Epidemiology, March 2007, 165(6): 710--8.",
      "doi": ""
    },
    {
      "text": "Von Ahn, L. and Dabbish, L. Labeling Images with a Computer Game. Proceedings of CHI 2004.  ",
      "doi": "10.1145/985692.985733"
    },
    {
      "text": "Voykinska, V., Azenkot, S., Wu, S., and Leshed, G. How Blind People Interact with Visual Content on Social Networking Services. Proceedings of CSCW 2016 (to appear).  ",
      "doi": "10.1145/2818048.2820013"
    },
    {
      "text": "World Health Organization. \"Visual Impairment and Blindness\" factsheet, August 2014. http://www.who.int/mediacentre/factsheets/fs282/en/",
      "doi": ""
    },
    {
      "text": "Williams, O. R.I.P. Blogging, Killed by Screenshorts. The Next Web News. April 14, 2015.",
      "doi": ""
    },
    {
      "text": "Wu, S. and Adamic, L. Visually Impaired Users on an Online Social Network. Proceedings of CHI 2014.  ",
      "doi": "10.1145/2556288.2557415"
    }
  ]
}