{
  "doi": "10.1145/2858036.2858475",
  "title": "Mimetic Machines: Collaborative Interventions in Digital Fabrication with Arc",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "6008-6013",
  "year": 2016,
  "badges": [],
  "abstract": "This paper examines the collaborative process of developing Arc, a computer numerical controlled (CNC) engraving tool for ceramics that offers a new window onto traditional forms of craft. In reflecting on this case and scholarship from the social sciences, we make two contributions. First, we show that fabrication tools may integrate multiple and distinct roles (as copiers, translators and connectors) in their production of form, selectively limiting the agency of the maker and machine. Second, we situate small-scale manufacturing in a wider historical context of \"mimetic machinery\": machines for mechanical reproduction that draw their symbolic power from a material connection with the phenomena represented (in this case, sound and gesture). We end by sharing lessons learned for fabrication research based on this study.",
  "authors": [
    {
      "name": "Hidekazu Saegusa",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658692043",
      "orcid": "missing"
    },
    {
      "name": "Thomas Tran",
      "institution": "University of Washngton, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022259",
      "orcid": "missing"
    },
    {
      "name": "Daniela K. Rosner",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332524398",
      "orcid": "0000-0001-9448-914X"
    }
  ],
  "references": [
    {
      "text": "Morgan G Ames. \"Charismatic Technology.\" Critical Alternatives Aarhus '15.  ",
      "doi": "10.7146/aahcc.v1i1.21199"
    },
    {
      "text": "Karen Barad. Meeting the universe halfway: Quantum physics and the entanglement of matter and meaning. duke university Press, 2007.",
      "doi": ""
    },
    {
      "text": "Walter Benjamin. \"On the mimetic faculty.\" Reflections 334 (1978).",
      "doi": ""
    },
    {
      "text": "Walter Benjamin. 2007 {1968}. Illuminations, ed. H. Arendt, trans. H. Zohn. New York: Schocken Books.",
      "doi": ""
    },
    {
      "text": "Amy Cheatle and Steven J. Jackson. \"Digital Entanglements: Craft, Computation and Collaboration in Fine Art Furniture Production.\" In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing, pp. 958--968. ACM.  ",
      "doi": "10.1145/2675133.2675291"
    },
    {
      "text": "Laura Devendorf and Daniela K. Rosner. \"Reimagining Digital Fabrication as Performance Art.\" In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, pp. 555--566. ACM, 2015.  ",
      "doi": "10.1145/2702613.2732507"
    },
    {
      "text": "Laura Devendorf and Kimiko Ryokai. \"Being the Machine: Reconfiguring Agency and Control in Hybrid Fabrication.\" In CHI, pp. 2477--2486. 2015.  ",
      "doi": "10.1145/2702123.2702547"
    },
    {
      "text": "James George Frazer. The golden bough. NuVision Publications, LLC, 2004.",
      "doi": ""
    },
    {
      "text": "Follmer, Sean, and Hiroshi Ishii. \"KidCAD: digitally remixing toys through tangible tools.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 2401--2410. ACM, 2012.  ",
      "doi": "10.1145/2207676.2208403"
    },
    {
      "text": "Green Eyl design group's Whispering Table. Online at: http://thegreeneyl.com/whispering-table",
      "doi": ""
    },
    {
      "text": "Scott E Hudson. \"Printing teddy bears: a technique for 3D printing of soft interactive objects.\" In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, pp. 459--468. ACM, 2014.  ",
      "doi": "10.1145/2556288.2557338"
    },
    {
      "text": "Steven J. Jackson and Laewoo Kang. \"Breakdown, obsolescence and reuse: HCI and the art of repair.\" In Proceedings of the 32nd annual ACM conference on Human factors in computing systems, pp. 449--458. ACM, 2014.  ",
      "doi": "10.1145/2556288.2557332"
    },
    {
      "text": "Jonathan Keep. Online at: http://www.keep-art.co.uk",
      "doi": ""
    },
    {
      "text": "Faythe Levine and Cortney Heimerl. 2008. Handmade Nation: The Rise of DIY, Art, Craft, and Design. Princeton Architectural Press.",
      "doi": ""
    },
    {
      "text": "Silvia Lindtner, Garnet D. Hertz, and Paul Dourish. \"Emerging sites of HCI innovation: hackerspaces, hardware startups & incubators.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 439--448. ACM, 2014.  ",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "Geoffrey Mann. Online at: http://www.mrmann.co.uk Marvin, Carolyn. When old technologies were new. Oxford University Press, 1997.",
      "doi": ""
    },
    {
      "text": "Rupert Meese, Shakir Ali, Emily-Clare Thorne, Steve D. Benford, Anthony Quinn, Richard Mortier, Boriana N. Koleva, Tony Pridmore, and Sharon L. Baurley. \"From codes to patterns: designing interactive decoration for tableware.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 931--940. ACM, 2013.  ",
      "doi": "10.1145/2470654.2466119"
    },
    {
      "text": "David A. Mellis and Leah Buechley. \"Case studies in the personal fabrication of electronic products.\" In Proceedings of the Designing Interactive Systems Conference, pp. 268--277. ACM, 2012.  ",
      "doi": "10.1145/2317956.2317998"
    },
    {
      "text": "Yuki Mori and Takeo Igarashi. \"Plushie: an interactive design system for plush toys.\" In ACM Transactions on Graphics (TOG), vol. 26, no. 3, p. 45. ACM, 2007.  ",
      "doi": "10.1145/1276377.1276433"
    },
    {
      "text": "Evgeny Morozov. The net delusion: The dark side of Internet freedom. PublicAffairs Store, 2012. ",
      "doi": "10.5555/1964879"
    },
    {
      "text": "The Particules Studio. Online at: http://particulesstudio.com/objets-sans-âge.html",
      "doi": ""
    },
    {
      "text": "Matt Ratto. \"Critical making: conceptual and material studies in technology and social life.\" The Information Society 27, no. 4 (2011): 252--260.  ",
      "doi": "10.1080/01972243.2011.583819"
    },
    {
      "text": "David Roedl, Shaowen Bardzell, and Jeffrey Bardzell. \"Sustainable Making Balancing Optimism and Criticism in HCI Discourse.\" ACM Transactions on Computer-Human Interaction (TOCHI) 22, no. 3 (2015): 15.  ",
      "doi": "10.1145/2699742"
    },
    {
      "text": "Daniela K. Rosner and Kimiko Ryokai. \"Reflections on craft: probing the creative process of everyday knitters.\" In Proceedings of the seventh ACM conference on Creativity and cognition, pp. 195--204. ACM, 2009.  ",
      "doi": "10.1145/1640233.1640264"
    },
    {
      "text": "Greg Saul, Manfred Lau, Jun Mitani, and Takeo Igarashi. \"SketchChair: an all-in-one chair design system for end users.\" In Proceedings of the fifth international conference on Tangible, embedded, and embodied interaction, pp. 73--80. ACM, 2011.  ",
      "doi": "10.1145/1935701.1935717"
    },
    {
      "text": "Joshua G. Tanenbaum, Amanda M. Williams, Audrey Desjardins, and Karen Tanenbaum. \"Democratizing technology: pleasure, utility and expressiveness in DIY and maker practice.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 2603--2612. ACM, 2013.  ",
      "doi": "10.1145/2470654.2481360"
    },
    {
      "text": "Michael T. Taussig, Mimesis and alterity: A particular history of the senses. Psychology Press, 1993.",
      "doi": ""
    },
    {
      "text": "Alex Taylor. \"After interaction.\" interactions 22, no. 5 (2015): 48--53.  ",
      "doi": "10.1145/2809888"
    },
    {
      "text": "Austin Toombs. \"Enacting Care Through Collaboration in Communities of Makers.\" In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing, pp. 81--84. ACM, 2015.  ",
      "doi": "10.1145/2685553.2699326"
    },
    {
      "text": "Jakob Tholander, Maria Normark, and Chiara Rossitto. \"Understanding agency in interaction design materials.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 2499--2508. ACM, 2012.  ",
      "doi": "10.1145/2207676.2208417"
    },
    {
      "text": "Amit Zoran, and Joseph A. Paradiso. \"FreeD: a freehand digital sculpting tool.\" In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, pp. 2613--2616. ACM, 2013.  ",
      "doi": "10.1145/2470654.2481361"
    }
  ]
}