{
  "doi": "10.1145/2858036.2858575",
  "title": "Citizens for Science and Science for Citizens: The View from Participatory Design",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "1822-1826",
  "year": 2016,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "The rise of citizen science as a form of public participation in research has engaged many disciplines and communities. This paper uses the lens of Participatory Design to contrast two different approaches to citizen science: one that puts citizens in the service of science and another that involves them in the production of knowledge. Through an empirical study of a diverse array of projects, we show how participation in citizen science often takes the more limited forms suggested by the former approach. Our analysis highlights the implications of limited participation and demonstrates how the CHI community is uniquely positioned to ameliorate these limitations.",
  "tags": [
    "participatory design",
    "civic science",
    "citizen science",
    "participation",
    "crowd science"
  ],
  "authors": [
    {
      "name": "Danial Qaurooni",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486656956",
      "orcid": "missing"
    },
    {
      "name": "Ali Ghazinejad",
      "institution": "Indiana University, Bloomington, USA",
      "img": "/do/10.1145/contrib-99659019740/rel-imgonly/img_20131121_175230-150x180.jpg",
      "acmid": "99659019740",
      "orcid": "missing"
    },
    {
      "name": "Inna Kouper",
      "institution": "Indiana University, Bloomington, USA",
      "img": "/do/10.1145/contrib-81100281278/rel-imgonly/81100281278.jpg",
      "acmid": "81100281278",
      "orcid": "missing"
    },
    {
      "name": "Hamid Ekbia",
      "institution": "Indiana University, Bloomington, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100155032",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "L. J. Bannon and P. Ehn. 2012. Design matters in participatory design. In Routledge International Handbook of Participatory Design. 37.",
      "doi": ""
    },
    {
      "text": "Eevi E Beck. 2002. P for Political: Participation is Not Enough. Scandinavian Journal of Information Systems 14, 1: 77--92. Retrieved from http://folk.uio.no/eevi/research/pubpapers/Beck2002aSJIS.PforPol.ps",
      "doi": ""
    },
    {
      "text": "R Bonney, H Ballard, R Jordan, and E McCallie. 2009. Public Participation in Scientific Research: Defining the Field and Assessing Its Potential for Informal Science Education. A CAISE Inquiry Group Report. Retrieved May 27, 2014 from http://eric.ed.gov/?id=ED519688",
      "doi": ""
    },
    {
      "text": "Jason Corburn. 2005. Street science: community knowledge and environmental health justice. MIT Press. Retrieved January 7, 2016 from https://books.google.com/books?id=QFJRAAAAM AAJ&pgis=1",
      "doi": ""
    },
    {
      "text": "Andrea Cornwall and Rachel Jewkes. 1995. What is Participatory Research? Social Science & Medicine 41, 12: 1667--1676.",
      "doi": ""
    },
    {
      "text": "Andrea Cornwall. 2008. Unpacking \"Participation\": models, meanings and practices. Community Development Journal 43, 3: 269--283. http://doi.org/10.1093/cdj/bsn010",
      "doi": ""
    },
    {
      "text": "Carl DiSalvo, Illah Nourbakhsh, David Holstius, Ayça Akin, and Marti Louw. 2008. The Neighborhood Networks project: a case study of critical engagement and creative expression through participatory design. Proceedings of the Tenth Anniversary Conference on Participatory Design 2008, 41--50. http://doi.org/10.1145/1795234.1795241 ",
      "doi": "10.5555/1795234.1795241"
    },
    {
      "text": "Alexandra Eveleigh, Charlene Jennett, Ann Blandford, Philip Brohan, and Anna L. Cox. 2014. Designing for dabblers and deterring drop-outs in citizen science. Proceedings of the 32nd annual ACM conference on Human factors in computing systems CHI '14, 2985--2994. http://doi.org/10.1145/2556288.2557262  ",
      "doi": "10.1145/2556288.2557262"
    },
    {
      "text": "Chiara Franzoni and Henry Sauermann. 2014. Crowd science: The organization of scientific research in open collaborative projects. Research Policy 43, 1: 1--20. http://doi.org/10.1016/j.respol.2013.07.005",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The Three Paradigms of HCI. Alt. Chi. Session at the SIGCHI Conference on Human Factors in Computing Systems, 1--18.",
      "doi": ""
    },
    {
      "text": "Alan Irwin. 1995. Citizen Science: A Study of People, Expertise and Sustainable Development. Psychology Press. Retrieved January 7, 2016 from https://books.google.com/books/about/Citizen_Science.html?id=MFiuIsC5hAUC&pgis=1",
      "doi": ""
    },
    {
      "text": "Sheila Jasanoff. 2003. Technologies of humility. Minerva 41, 3: 223--244. http://doi.org/10.1038/450033a",
      "doi": ""
    },
    {
      "text": "Finn Kensing and Jeanette Blomberg. 1998. Participatory Design?: Issues and Concerns. Computer Supported Cooperative Work 7, 1993: 167--185. http://doi.org/10.1023/A:1008689307411  ",
      "doi": "10.1023/A%3A1008689307411"
    },
    {
      "text": "Toni Robertson and Jesper Simonsen. 2012. Routledge International Handbook of Participatory Design. Routleledge, London and New York. ",
      "doi": "10.5555/2378466"
    },
    {
      "text": "Linda See, Alexis Comber, Carl Salk, et al. 2013. Comparing the Quality of Crowdsourced Data Contributed by Expert and Non-Experts. PLoS ONE 8, 7: 1--11. http://doi.org/10.1371/journal.pone.0069958",
      "doi": ""
    },
    {
      "text": "Jennifer Shirk, Heidi Ballard, Andrea Wiggins, et al. 2011. Public Participation in Scientific Research: A Framework for Intentional Design. Ecological Society of America 17, 2. http://doi.org/dx.doi.org/10.5751/ES-04705-170229",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2007. Human-machine reconfigurations: Plans and situated actions. Cambridge University Press. ",
      "doi": "10.5555/1212951"
    },
    {
      "text": "Andrea Wiggins and Kevin Crowston. 2011. From Conservation to Crowdsourcing: A Typology of Citizen Science. 44th Hawaii International Conference on System Sciences, Ieee, 1--10. http://doi.org/10.1109/HICSS.2011.207  ",
      "doi": "10.1109/HICSS.2011.207"
    },
    {
      "text": "Andrea Wiggins. 2011. Crowdsourcing Scientific Work: A Comparative Study of Technologies, Processes, and Outcomes in Citizen Science.",
      "doi": ""
    }
  ]
}