{
  "doi": "10.1145/2858036.2858286",
  "title": "SymmetriSense: Enabling Near-Surface Interactivity on Glossy Surfaces using a Single Commodity Smartphone",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "5126-5137",
  "year": 2016,
  "badges": [],
  "abstract": "Driven to create intuitive computing interfaces throughout our everyday space, various state-of-the-art technologies have been proposed for near-surface localization of a user's finger input such as hover or touch. However, these works require specialized hardware not commonly available, limiting the adoption of such technologies. We present SymmetriSense, a technology enabling near-surface 3-dimensional fingertip localization above arbitrary glossy surfaces using a single commodity camera device such as a smartphone. SymmetriSense addresses the localization challenges in using a single regular camera by a novel technique utilizing the principle of reflection symmetry and the fingertip's natural reflection casted upon surfaces like mirrors, granite countertops, or televisions. SymmetriSense achieves typical accuracies at sub-centimeter levels in our localization tests with dozens of volunteers and remains accurate under various environmental conditions. We hope SymmetriSense provides a technical foundation on which various everyday near-surface interactivity can be designed.",
  "tags": [
    "fingertip localization",
    "computing interfaces",
    "single commodity camera",
    "near-surface input",
    "smartphone"
  ],
  "authors": [
    {
      "name": "Chungkuk Yoo",
      "institution": "KAIST, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486640842",
      "orcid": "missing"
    },
    {
      "name": "Inseok Hwang",
      "institution": "IBM Research - Austin, Austin, TX, USA",
      "img": "/do/10.1145/contrib-81410593113/rel-imgonly/inseok_ibmcampus_casual_720px.jpg",
      "acmid": "81410593113",
      "orcid": "missing"
    },
    {
      "name": "Eric Rozner",
      "institution": "IBM, Austin, TX, USA",
      "img": "/do/10.1145/contrib-81335496683/rel-imgonly/pic.png",
      "acmid": "81335496683",
      "orcid": "missing"
    },
    {
      "name": "Yu Gu",
      "institution": "IBM Watson Health, Austin, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100501480",
      "orcid": "missing"
    },
    {
      "name": "Robert F. Dickerson",
      "institution": "IBM, Austin, TX, USA",
      "img": "/do/10.1145/contrib-81320489054/rel-imgonly/69855826_10115924503109931_7758389547234230272_o.jpg",
      "acmid": "81320489054",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Michelle Annett, Tovi Grossman, Daniel Wigdor, and George Fitzmaurice. Medusa: a proximity-aware multi-touch tabletop. In Proc. UIST 2011. ACM, 337-346.  ",
      "doi": "10.1145/2047196.2047240"
    },
    {
      "text": "Arduino. Retrieved September 24, 2015 from https://www.arduino.cc.",
      "doi": ""
    },
    {
      "text": "Aras Balali Moghaddam, Jeremy Svendsen, Melanie Tory, and Alexandra Branzan Albu. Integrating touch and near touch interactions for information visualizations. In Proc. CHI 2011 Extended Abstracts. ACM, 2347-2352.  ",
      "doi": "10.1145/1979742.1979934"
    },
    {
      "text": "Dominikus Baur, Sebastian Boring, and Steven Feiner. Virtual projection: exploring optical projection as a metaphor for multi-device interaction. In Proc. CHI 2012. ACM, 1693-1702.  ",
      "doi": "10.1145/2207676.2208297"
    },
    {
      "text": "SMART Board. Retrieved December 28, 2015 from http://education.smarttech.com/.",
      "doi": ""
    },
    {
      "text": "Camera calibration with OpenCV. Retrieved December 26, 2015 from http: //docs.opencv.org/2.4/doc/tutorials/calib3d/ camera_calibration/camera_calibration.html.",
      "doi": ""
    },
    {
      "text": "Ke-Yu Chen, Gabe A Cohn, Sidhant Gupta, and Shwetak N Patel. uTouch: sensing touch gestures on unmodified LCDs. In Proc. CHI 2013. ACM, 2581-2584.  ",
      "doi": "10.1145/2470654.2481356"
    },
    {
      "text": "Victor Cheung, Jens Heydekorn, Stacey Scott, and Raimund Dachselt. Revisiting hovering: Interaction guides for interactive surfaces. In Proc. ITS 2012. ACM, 355-358.  ",
      "doi": "10.1145/2396636.2396699"
    },
    {
      "text": "Rita Cucchiara, Costantino Grana, Massimo Piccardi, and Andrea Prati. Detecting moving objects, ghosts, and shadows in video streams. Pattern Analysis and Machine Intelligence, IEEE Transactions on 25, 10 (2003), 1337-1342.  ",
      "doi": "10.1109/TPAMI.2003.1233909"
    },
    {
      "text": "Eduardo Cuervo, Aruna Balasubramanian, Dae-ki Cho, Alec Wolman, Stefan Saroiu, Ranveer Chandra, and Paramvir Bahl. MAUI: making smartphones last longer with code offload. In Proc. MobiSys 2010 (MobiSys '10). ACM, NY, NY, USA, 49-62. DOI: http://dx.doi.org/10.1145/1814433.1814441  ",
      "doi": "10.1145/1814433.1814441"
    },
    {
      "text": "Frederic Devernay and Olivier Faugeras. Straight lines have to be straight. Machine vision and applications 13, 1 (2001), 14-24.  ",
      "doi": "10.1007/PL00013269"
    },
    {
      "text": "Florian Echtler, Andreas Dippon, Marcus Tonnis, and Gudrun Klinker. Inverted FTIR: easy multitouch sensing for fiatscreens. In Proc. ITS 2009. ACM, 29-32.  ",
      "doi": "10.1145/1731903.1731909"
    },
    {
      "text": "Mayank Goel, Brendan Lee, Md Tanvir Islam Aumi, Shwetak Patel, Gaetano Borriello, Stacie Hibino, and Bo Begole. SurfaceLink: using inertial and acoustic sensing to enable multi-device interaction on a surface. In Proc. CHI 2014. ACM, 1387-1396.  ",
      "doi": "10.1145/2556288.2557120"
    },
    {
      "text": "Chris Harrison, Hrvoje Benko, and Andrew D Wilson. OmniTouch: wearable multitouch interaction everywhere. In Proc. UIST 2011. ACM, 441-450.  ",
      "doi": "10.1145/2047196.2047255"
    },
    {
      "text": "Chris Harrison and Scott E Hudson. Scratch input: creating large, inexpensive, unpowered and mobile finger input surfaces. In Proc. UIST 2008. ACM, 205-208.  ",
      "doi": "10.1145/1449715.1449747"
    },
    {
      "text": "Otmar Hilliges, Shahram Izadi, Andrew D Wilson, Steve Hodges, Armando Garcia-Mendoza, and Andreas Butz. Interactions in the air: adding further depth to interactive tabletops. In Proc. UIST 2009. ACM, 139-148.  ",
      "doi": "10.1145/1622176.1622203"
    },
    {
      "text": "Pan Hu, Guobin Shen, Liqun Li, and Donghuan Lu. ViRi: view it right. In Proc. MobiSys 2013. ACM, 277-290.  ",
      "doi": "10.1145/2462456.2464454"
    },
    {
      "text": "David Kim, Shahram Izadi, Jakub Dostal, Christoph Rhemann, Cem Keskin, Christopher Zach, Jamie Shotton, Timothy Large, Steven Bathiche, Matthias Nießner, and others. RetroDepth: 3D silhouette sensing for high-precision input on and above physical surfaces. In Proc. CHI 2014. ACM, 1377-1386.  ",
      "doi": "10.1145/2556288.2557336"
    },
    {
      "text": "Sven Kratz, Patrick Chiu, and Maribeth Back. Pointpose: finger pose estimation for touch input on mobile devices using a depth sensor. In Proc. ITS 2013. ACM, 223-230.  ",
      "doi": "10.1145/2512349.2512824"
    },
    {
      "text": "Shenwei Liu and François Guimbreti'ere. FlexAura: a flexible near-surface range sensor. In Proc. UIST 2012. ACM, 327-330.  ",
      "doi": "10.1145/2380116.2380158"
    },
    {
      "text": "Nicolai Marquardt, Ricardo Jota, Saul Greenberg, and Joaquim A Jorge. The continuous interaction space: interaction techniques unifying touch and gesture on and above a digital surface. In Proc. INTERACT 2011. Springer, 461-476. ",
      "doi": "10.5555/2042182.2042224"
    },
    {
      "text": "Davide A Migliore, Matteo Matteucci, and Matteo Naccari. A revaluation of frame difference in fast and robust motion detection. In Proc. 4th ACM international workshop on Video surveillance and sensor networks, 2006. ACM, 215-218.  ",
      "doi": "10.1145/1178782.1178815"
    },
    {
      "text": "Evan Mills and Nils Borg. Trends in recommended illuminance levels: an international comparison. Journal of the Illuminating Engineering Society 28, 1 (1999), 155-163.",
      "doi": ""
    },
    {
      "text": "Leap Motion. Retrieved September 24, 2015 from https://www.leapmotion.com.",
      "doi": ""
    },
    {
      "text": "Anna Ostberg and Nada Matic. Hover cursor: Improving touchscreen acquisition of small targets with hover-enabled pre-selection. In Proc. CHI 2015 Extended Abstracts. ACM, 1723-1728.  ",
      "doi": "10.1145/2702613.2732903"
    },
    {
      "text": "Son Lam Phung, Abdesselam Bouzerdoum, and Douglas Chai. A novel skin color model in ycbcr color space and its application to human face detection. In Proc. International Conference on Image Processing, 2002, Vol. 1. IEEE, I-289.",
      "doi": ""
    },
    {
      "text": "Rasberry Pi. Retrieved September 24, 2015 from https://www.raspberrypi.org.",
      "doi": ""
    },
    {
      "text": "Jun Rekimoto. SmartSkin: an infrastructure for freehand manipulation on interactive surfaces. In Proc. CHI 2002. ACM, 113-120.  ",
      "doi": "10.1145/503376.503397"
    },
    {
      "text": "Munehiko Sato, Ivan Poupyrev, and Chris Harrison. Touche: enhancing touch interaction on humans, screens, liquids, and everyday objects. In Proc. CHI 2012. ACM, 483-492.  ",
      "doi": "10.1145/2207676.2207743"
    },
    {
      "text": "Toby Sharp, Cem Keskin, Duncan Robertson, Jonathan Taylor, Jamie Shotton, David Kim Christoph Rhemann Ido Leichter, Alon Vinnikov Yichen Wei, Daniel Freedman Pushmeet Kohli Eyal Krupka, Andrew Fitzgibbon, and Shahram Izadi. Accurate, robust, and flexible real-time hand tracking. In Proc. CHI 2015. ACM, 3633-3642.  ",
      "doi": "10.1145/2702123.2702179"
    },
    {
      "text": "Jeongho Shin, Sangjin Kim, Sangkyu Kang, Seong-Won Lee, Joonki Paik, Besma Abidi, and Mongi Abidi. Optical flow-based real-time object tracking using non-prior training active feature model. Real-Time Imaging 11, 3 (2005), 204-218.  ",
      "doi": "10.1016/j.rti.2005.03.006"
    },
    {
      "text": "Jie Song, Gabor Soros, Fabrizio Pece, Sean Ryan Fanello, Shahram Izadi, Cem Keskin, and Otmar Hilliges. In-air gestures around unmodified mobile devices. In Proc. UIST 2014. ACM, 319-329.  ",
      "doi": "10.1145/2642918.2647373"
    },
    {
      "text": "Martin Spindler, Marcel Martsch, and Raimund Dachselt. Going beyond the surface: studying multi-layer interaction above the tabletop. In Proc. CHI 2012. ACM, 1277-1286.  ",
      "doi": "10.1145/2207676.2208583"
    },
    {
      "text": "Yoshiki Takeoka, Takashi Miyaki, and Jun Rekimoto. Z-touch: an infrastructure for 3d gesture interaction in the proximity of tabletop surfaces. In Proc. ITS 2010. ACM, 91-94.  ",
      "doi": "10.1145/1936652.1936668"
    },
    {
      "text": "Robby T Tan and Katsushi Ikeuchi. Separating reflection components of textured surfaces using a single image. Pattern Analysis and Machine Intelligence, IEEE Transactions on 27, 2 (2005), 178-193.  ",
      "doi": "10.1109/TPAMI.2005.36"
    },
    {
      "text": "Sony Floating Touch. Retrieved September 24, 2015 from http://developer.sonymobile.com/ knowledge-base/technologies/floating-touch.",
      "doi": ""
    },
    {
      "text": "Samsung Air View. Retrieved September 24, 2015 from http://www.samsung.com/us/support/answer/ ANS00044011/997407174/.",
      "doi": ""
    },
    {
      "text": "Chat Wacharamanotham, Kashyap Todi, Marty Pye, and Jan Borchers. Understanding finger input above desktop devices. In Proc. CHI 2014. ACM, 1083-1092.  ",
      "doi": "10.1145/2556288.2557151"
    },
    {
      "text": "Andrew D Wilson. PlayAnywhere: a compact interactive tabletop projection-vision system. In Proc. UIST 2005. ACM, 83-92.  ",
      "doi": "10.1145/1095034.1095047"
    },
    {
      "text": "Robert Xiao, Chris Harrison, and Scott E Hudson. WorldKit: rapid and easy creation of ad-hoc interactive applications on everyday surfaces. In Proc. CHI 2013. ACM, 879-888.  ",
      "doi": "10.1145/2470654.2466113"
    },
    {
      "text": "Robert Xiao, Greg Lew, James Marsanico, Divya Hariharan, Scott Hudson, and Chris Harrison. Toffee: enabling ad hoc, around-device interaction with acoustic time-of-arrival correlation. In Proc. MobileHCI 2014. ACM, 67-76.  ",
      "doi": "10.1145/2628363.2628383"
    },
    {
      "text": "Alper Yilmaz, Omar Javed, and Mubarak Shah. Object tracking: A survey. ACM Computing Surveys (CSUR) 38, 4 (2006), 13.  ",
      "doi": "10.1145/1177352.1177355"
    }
  ]
}