{
  "doi": "10.1145/2858036.2858283",
  "title": "HCI Research as Problem-Solving",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "4956-4967",
  "year": 2016,
  "badges": [
    "Best Paper"
  ],
  "abstract": "This essay contributes a meta-scientific account of human-computer interaction (HCI) research as problem-solving. We build on the philosophy of Larry Laudan, who develops problem and solution as the foundational concepts of science. We argue that most HCI research is about three main types of problem: empirical, conceptual, and constructive. We elaborate upon Laudan's concept of problem-solving capacity as a universal criterion for determining the progress of solutions (outcomes): Instead of asking whether research is 'valid' or follows the 'right' approach, it urges us to ask how its solutions advance our capacity to solve important problems in human use of computers. This offers a rich, generative, and 'discipline-free' view of HCI and resolves some existing debates about what HCI is or should be. It may also help unify efforts across nominally disparate traditions in empirical research, theory, design, and engineering.",
  "tags": [
    "scientific progress",
    "Larry Laudan",
    "problem-solving",
    "human-computer interaction",
    "research problem"
  ],
  "authors": [
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Kasper Hornbæk",
      "institution": "University of Copenhagen, Copenhagen, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100047223",
      "orcid": "0000-0001-8742-1198"
    }
  ],
  "references": [
    {
      "text": "Tawfiq Ammari and Sarita Schoenebeck. 2015. Understanding and Supporting Fathers and Fatherhood on Social Media Sites. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1905-1914.  ",
      "doi": "10.1145/2702123.2702205"
    },
    {
      "text": "Jeffrey Bardzell. 2011. Interaction criticism: An introduction to the practice. Interacting with Computers 23, 6: 604-621. http://doi.org/10.1016/j.intcom.2011.07.001  ",
      "doi": "10.1016/j.intcom.2011.07.001"
    },
    {
      "text": "Alan F. Blackwell. 2015. HCI As an Inter-Discipline. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM, 503-516. http://doi.org/10.1145/2702613.2732505  ",
      "doi": "10.1145/2702613.2732505"
    },
    {
      "text": "Florian Block, James Hammerman, Michael Horn, et al. 2015. Fluid Grouping: Quantifying Group Engagement Around Interactive Tabletop Exhibits in the Wild. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 867-876. http://doi.org/10.1145/2702123.2702231  ",
      "doi": "10.1145/2702123.2702231"
    },
    {
      "text": "Susanne Bødker. 2006. When Second Wave HCI Meets Third Wave Challenges. Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles, ACM, 1-8. http://doi.org/10.1145/1182475.1182476  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Richard A Bolt. 1980. \"Put-that-there\": Voice and gesture at the graphics interface. ACM.",
      "doi": ""
    },
    {
      "text": "Jelmer P. Borst, Niels A. Taatgen, and Hedderik van Rijn. 2015. What Makes Interruptions Disruptive?: A ProcessModel Account of the Effects of the Problem State Bottleneck on Task Interruption and Resumption. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2971-2980. http://doi.org/10.1145/2702123.2702156  ",
      "doi": "10.1145/2702123.2702156"
    },
    {
      "text": "Erin Buehler, Stacy Branham, Abdullah Ali, et al. 2015. Sharing is Caring: Assistive Technology Designs on Thingiverse. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 525-534. http://doi.org/10.1145/2702123.2702525  ",
      "doi": "10.1145/2702123.2702525"
    },
    {
      "text": "John M Carroll and Robert L Campbell. 1986. Softening up hard science: reply to newel1 and card. Human-Computer Interaction 2, 3: 227-249.  ",
      "doi": "10.1207/s15327051hci0203_3"
    },
    {
      "text": "Andy Crabtree, Alan Chamberlain, Rebecca E. Grinter, Matt Jones, Tom Rodden, and Yvonne Rogers (eds.). 2013. Introduction to the Special Issue of \"The Turn to The Wild.\" ACM Trans. Comput.-Hum. Interact. 20, 3: 13:1-13:4. http://doi.org/10.1145/2491500.2491501  ",
      "doi": "10.1145/2491500.2491501"
    },
    {
      "text": "Paul Dourish. 2006. Implications for design. Proceedings of the SIGCHI conference on Human Factors in computing systems, ACM, 541-550. Retrieved August 21, 2015 from http://dl.acm.org/citation.cfm?id=1124855  ",
      "doi": "10.1145/1124772.1124855"
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015. Scaling the Security Wall: Developing a Security Behavior Intentions Scale (SeBIS). Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2873-2882. http://doi.org/10.1145/2702123.2702249  ",
      "doi": "10.1145/2702123.2702249"
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, et al. 2015. \"I Always Assumed That I Wasn't Really That Close to {Her}\": Reasoning About Invisible Algorithms in News Feeds. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 153-162. http://doi.org/10.1145/2702123.2702556  ",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "David R. Flatla, Alan R. Andrade, Ross D. Teviotdale, Dylan L. Knowles, and Craig Stewart. 2015. ColourID: Improving Colour Identification for People with Impaired Colour Vision. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3543-3552. http://doi.org/10.1145/2702123.2702578  ",
      "doi": "10.1145/2702123.2702578"
    },
    {
      "text": "Douglas J Gillan and Randolph G Bias. 2001. Usability science. I: foundations. International Journal of HumanComputer Interaction 13, 4: 351-372.",
      "doi": ""
    },
    {
      "text": "Saul Greenberg and Bill Buxton. 2008. Usability evaluation considered harmful (some of the time). Proceedings of the SIGCHI conference on Human factors in computing systems, 111-120. http://dl.acm.org/citation.cfm?id=1357074  ",
      "doi": "10.1145/1357054.1357074"
    },
    {
      "text": "Steve Harrison, Deborah Tatar, and Phoebe Sengers. 2007. The three paradigms of HCI. Alt. Chi. Session at the SIGCHI Conference on Human Factors in Computing Systems San Jose, California, USA, 1-18.",
      "doi": ""
    },
    {
      "text": "Thomas T Hewett, Ronald Baecker, Stuart Card, et al. 1992. ACM SIGCHI curricula for human-computer interaction. ACM.",
      "doi": ""
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2012. Strong concepts: Intermediate-level knowledge in interaction design research. ACM Transactions on Computer-Human Interaction (TOCHI) 19, 3: 23.  ",
      "doi": "10.1145/2362364.2362371"
    },
    {
      "text": "Kasper Hornbæk and Morten Hertzum. 2007. Untangling the usability of fisheye menus. ACM Transactions on Computer-Human Interaction (TOCHI) 14, 2: 6.  ",
      "doi": "10.1145/1275511.1275512"
    },
    {
      "text": "Andrew Howes, Benjamin R Cowan, Christian P Janssen, et al. 2014. Interaction science SIG: overcoming challenges. Proceedings of the extended abstracts of the 32nd annual ACM conference on Human factors in computing systems, ACM, 1127-1130.  ",
      "doi": "10.1145/2559206.2559208"
    },
    {
      "text": "Edwin L. Hutchins, James D. Hollan, and Donald A. Norman. 1985. Direct manipulation interfaces. Human- Computer Interaction 1, 4: 311-338.  ",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. Proceedings of the ACM SIGCHI Conference on Human factors in computing systems, ACM, 234-241.  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "Matthew Kay, Cynthia Matuszek, and Sean A. Munson. 2015. Unequal Representation and Gender Stereotypes in Image Search Results for Occupations. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3819-3828. http://doi.org/10.1145/2702123.2702520  ",
      "doi": "10.1145/2702123.2702520"
    },
    {
      "text": "Vassilis Kostakos. 2015. The Big Hole in HCI Research. interactions 22, 2: 48-51. http://doi.org/10.1145/2729103  ",
      "doi": "10.1145/2729103"
    },
    {
      "text": "Kari Kuutti and Liam J. Bannon. 2014. The Turn to Practice in HCI: Towards a Research Agenda. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3543-3552. http://doi.org/10.1145/2556288.2557111  ",
      "doi": "10.1145/2556288.2557111"
    },
    {
      "text": "Gierad Laput, Eric Brockmeyer, Scott E. Hudson, and Chris Harrison. 2015. Acoustruments: Passive, Acoustically-Driven, Interactive Controls for Handheld Devices. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2161-2170. http://doi.org/10.1145/2702123.2702414  ",
      "doi": "10.1145/2702123.2702414"
    },
    {
      "text": "Larry Laudan. 1978. Progress and its problems: Towards a theory of scientific growth. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Moon-Hwan Lee, Seijin Cha, and Tek-Jin Nam. 2015. Patina Engraver: Visualizing Activity Logs As Patina in Fashionable Trackers. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1173-1182. http://doi.org/10.1145/2702123.2702213  ",
      "doi": "10.1145/2702123.2702213"
    },
    {
      "text": "Gitte Lindgaard. 2014. The usefulness of traditional usability evaluation methods. interactions 21, 6: 80-82.  ",
      "doi": "10.1145/2670736"
    },
    {
      "text": "Pedro Lopes, Patrik Jonell, and Patrick Baudisch. 2015. Affordance++: Allowing Objects to Communicate Dynamic Use. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2515-2524. http://doi.org/10.1145/2702123.2702128  ",
      "doi": "10.1145/2702123.2702128"
    },
    {
      "text": "Martin Weigel, Tong Lu, Gilles Bailly, Antti Oulasvirta, Carmel Majidi, and Jürgen Steimle. 2015. iSkin: Flexible, Stretchable and Visually Customizable On-Body Touch Sensors for Mobile Computing. Proceedings of the 33Nd Annual ACM Conference on Human Factors in Computing Systems.  ",
      "doi": "10.1145/2702123.2702391"
    },
    {
      "text": "Amanda Menking and Ingrid Erickson. 2015. The Heart Work of Wikipedia: Gendered, Emotional Labor in the World's Largest Online Encyclopedia. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 207-210. http://doi.org/10.1145/2702123.2702514  ",
      "doi": "10.1145/2702123.2702514"
    },
    {
      "text": "Evgeny Morozov. 2014. To save everything, click here: The folly of technological solutionism. PublicAffairs.",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Dieter Eberle, and Constantin Schmidt. 2015. BaseLase: An Interactive Focus+Context Laser Floor. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3869- 3878. http://doi.org/10.1145/2702123.2702246  ",
      "doi": "10.1145/2702123.2702246"
    },
    {
      "text": "Allen Newell and Stuart K. Card. 1985. The prospects for psychological science in human-computer interaction. Human-computer interaction 1, 3: 209-242.  ",
      "doi": "10.1207/s15327051hci0103_1"
    },
    {
      "text": "Gary M. Olson and Judith S. Olson. 2000. Distance Matters. Hum.-Comput. Interact. 15, 2: 139-178. http://doi.org/10.1207/S15327051HCI1523_4  ",
      "doi": "10.1207/S15327051HCI1523_4"
    },
    {
      "text": "Gary M. Olson and Judith S. Olson. 2003. Human-computer interaction: Psychological aspects of the human use of computing. Annual review of psychology 54, 1: 491- 516.",
      "doi": ""
    },
    {
      "text": "James Patten, Hiroshi Ishii, Jim Hines, and Gian Pangaro. 2001. Sensetable: a wireless object tracking platform for tangible user interfaces. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 253-260.  ",
      "doi": "10.1145/365024.365112"
    },
    {
      "text": "Stuart Reeves. 2015. Human-computer interaction as science.",
      "doi": ""
    },
    {
      "text": "John Rieman. 1996. A field study of exploratory learning strategies. ACM Transactions on Computer-Human Interaction (TOCHI) 3, 3: 189-218.  ",
      "doi": "10.1145/234526.234527"
    },
    {
      "text": "Yvonne Rogers. 2012. HCI theory: classical, modern, and contemporary. Synthesis Lectures on Human-Centered Informatics 5, 2: 1-129.",
      "doi": "10.5555/3019322"
    },
    {
      "text": "Bryan Semaan, Heather Faucett, Scott P. Robertson, Misa Maruyama, and Sara Douglas. 2015. Designing Political Deliberation Environments to Support Interactions in the Public Sphere. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3167-3176. http://doi.org/10.1145/2702123.2702403  ",
      "doi": "10.1145/2702123.2702403"
    },
    {
      "text": "Will Simm, Maria Angela Ferrario, Adrian Friday, et al. 2015. Tiree Energy Pulse: Exploring Renewable Energy Forecasts on the Edge of the Grid. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1965-1974. http://doi.org/10.1145/2702123.2702285  ",
      "doi": "10.1145/2702123.2702285"
    },
    {
      "text": "R William Soukoreff and I Scott MacKenzie. 2004. Towards a standard for pointing device evaluation, perspectives on 27 years of Fitts' law research in HCI. International journal of human-computer studies 61, 6: 751--789.  ",
      "doi": "10.1016/j.ijhcs.2004.09.001"
    },
    {
      "text": "Aditya Vashistha, Edward Cutrell, Gaetano Borriello, and William Thies. 2015. Sangeet Swara: A CommunityModerated Voice Forum in Rural India. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 417-426. http://doi.org/10.1145/2702123.2702191  ",
      "doi": "10.1145/2702123.2702191"
    },
    {
      "text": "Radu-Daniel Vatavu and Jacob O. Wobbrock. 2015. Formalizing Agreement Analysis for Elicitation Studies: New Measures, Significance Test, and Toolkit. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1325-1334. http://doi.org/10.1145/2702123.2702223  ",
      "doi": "10.1145/2702123.2702223"
    },
    {
      "text": "Keith Vertanen, Haythem Memmi, Justin Emge, Shyam Reyal, and Per Ola Kristensson. 2015. VelociTap: Investigating Fast Mobile Text Entry Using Sentence-Based Decoding of Touchscreen Keyboard Input. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 659-668. http://doi.org/10.1145/2702123.2702135  ",
      "doi": "10.1145/2702123.2702135"
    },
    {
      "text": "Daniel Wigdor, Hao Jiang, Clifton Forlines, Michelle Borkin, and Chia Shen. 2009. WeSpace: the design development and deployment of a walk-up and share multisurface visual collaboration system. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1237-1246.  ",
      "doi": "10.1145/1518701.1518886"
    },
    {
      "text": "Wesley Willett, Bernhard Jenny, Tobias Isenberg, and Pierre Dragicevic. 2015. Lightweight Relief Shearing for Enhanced Terrain Perception on Interactive Maps. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 3563-3572. http://doi.org/10.1145/2702123.2702172  ",
      "doi": "10.1145/2702123.2702172"
    },
    {
      "text": "Pamela Wisniewski, Haiyan Jia, Na Wang, et al. 2015. Resilience Mitigates the Negative Effects of Adolescent Internet Addiction and Online Risk Exposure. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 4029-4038. http://doi.org/10.1145/2702123.2702240  ",
      "doi": "10.1145/2702123.2702240"
    },
    {
      "text": "Shumin Zhai. 2004. Characterizing computer input with Fitts' law parameters--the information and non-information aspects of pointing. International Journal of Human-Computer Studies 61, 6: 791-809.  ",
      "doi": "10.1016/j.ijhcs.2004.09.006"
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM, 493--502. http://dl.acm.org/citation.cfm?id=1240704  ",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}