{
  "doi": "10.1145/2858036.2858234",
  "title": "Social Media Image Analysis for Public Health",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "5543-5547",
  "year": 2016,
  "badges": [],
  "abstract": "Several projects have shown the feasibility to use emph{textual} social media data to track public health concerns, such as temporal influenza patterns or geographical obesity patterns. In this paper, we look at whether geo-tagged emph{images} from Instagram also provide a viable data source. Especially for \"lifestyle\" diseases, such as obesity, drinking or smoking, images of social gatherings could provide information that is not necessarily shared in, say, tweets. In this study, we explore whether (i) tags provided by the users and (ii) annotations obtained via automatic image tagging are indeed valuable for studying public health. We find that both user-provided and machine-generated tags provide information that can be used to infer a county's health statistics. Whereas for most statistics user-provided tags are better features, for predicting excessive drinking machine-generated tags such as \"liquid' and \"glass' yield better models. This hints at the potential of using machine-generated tags to study substance abuse.",
  "authors": [
    {
      "name": "Venkata Rama Kiran Garimella",
      "institution": "Aalto University, Helsinki, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508705496",
      "orcid": "missing"
    },
    {
      "name": "Abdulrahman Alfayad",
      "institution": "Carnegie Mellon University, Doha, Qatar",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020128",
      "orcid": "missing"
    },
    {
      "name": "Ingmar Weber",
      "institution": "Qatar Computing Research Institute, Doha, Qatar",
      "img": "/do/10.1145/contrib-81309503156/rel-imgonly/dr.ingmarweber-copy.jpg",
      "acmid": "81309503156",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sofiane Abbar, Yelena Mejova, and Ingmar Weber. 2015. You Tweet What You Eat: Studying Food Consumption Through Twitter. In CHI. 3197-3206.  ",
      "doi": "10.1145/2702123.2702153"
    },
    {
      "text": "Saeed Abdullah, Elizabeth L Murnane, Jean MR Costa, and Tanzeem Choudhury. 2015. Collective Smile: Measuring Societal Happiness from Geolocated Images. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing. ACM, 361--374.  ",
      "doi": "10.1145/2675133.2675186"
    },
    {
      "text": "Nazanin Andalibi, Pinar Ozturk, and Andrea Forte. 2015. Depression-related Imagery on Instagram. In Proceedings of the 18th ACM Conference Companion on Computer Supported Cooperative Work & Social Computing. ACM, 231--234.  ",
      "doi": "10.1145/2685553.2699014"
    },
    {
      "text": "Sairam Balani and Munmun De Choudhury. 2015. Detecting and Characterizing Mental Health Related Self-Disclosure in Social Media. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 1373--1378.  ",
      "doi": "10.1145/2702613.2732733"
    },
    {
      "text": "Aron Culotta. 2014. Estimating County Health Statistics with Twitter. In CHI. 1335--1344.  ",
      "doi": "10.1145/2556288.2557139"
    },
    {
      "text": "Munmun De Choudhury, Michael Gamon, Scott Counts, and Eric Horvitz. 2013. Predicting Depression via Social Media.. In ICWSM.",
      "doi": ""
    },
    {
      "text": "Mark Dredze. 2012. How Social Media Will Change Public Health. IEEE Intelligent Systems 27, 4 (2012), 81--84.  ",
      "doi": "10.1109/MIS.2012.76"
    },
    {
      "text": "Geoffrey E Hinton, Simon Osindero, and Yee-Whye Teh. 2006. A fast learning algorithm for deep belief nets. Neural computation 18, 7 (2006), 1527--1554.  ",
      "doi": "10.1162/neco.2006.18.7.1527"
    },
    {
      "text": "Andrej Karpathy and Li Fei-Fei. 2015. Deep Visual-Semantic Alignments for Generating Image Descriptions. In CVPR.",
      "doi": ""
    },
    {
      "text": "Yoshiyuki Kawano and Keiji Yanai. 2015. FoodCam: A real-time food recognition system on a smartphone. Multimedia Tools and Applications 74, 14 (2015), 5263--5287.  ",
      "doi": "10.1007/s11042-014-2000-8"
    },
    {
      "text": "Patty Kostkova. 2013. A Roadmap to Integrated Digital Public Health Surveillance: The Vision and the Challenges. In WWW. 687--694.  ",
      "doi": "10.1145/2487788.2488024"
    },
    {
      "text": "Patty Kostkova. 2015. Public Health. In Twitter: A Digital Socioscope, Yelena Mejova, Ingmar Weber, and Michael Macy (Eds.). Cambridge University Press, 111--130.",
      "doi": ""
    },
    {
      "text": "D.J. McIver, J.B. Hawkins, R. Chunara, A.K. Chatterjee, A. Bhandari, T.P. Fitzgerald, S.H. Jain, and J.S. Brownstein. 2015. Characterizing Sleep Issues Using Twitter. 17 (2015), e140.",
      "doi": ""
    },
    {
      "text": "Yelena Mejova, Hamed Haddadi, Anastasios Noulas, and Ingmar Weber. 2015. #FoodPorn: Obesity Patterns in Culinary Interactions. In Digital Health.  ",
      "doi": "10.1145/2750511.2750524"
    },
    {
      "text": "Elizabeth M Morgan, Chareen Snelson, and Patt Elison-Bowers. 2010. Image and video disclosure of substance use on social media websites. Computers in Human Behavior 26, 6 (2010), 1405--1411.  ",
      "doi": "10.1016/j.chb.2010.04.017"
    },
    {
      "text": "Jon Parker, Yifang Wei, Andrew Yates, Ophir Frieder, and Nazli Goharian. 2013. A Framework for Detecting Public Health Trends with Twitter. In ASONAM. 556--563.  ",
      "doi": "10.1145/2492517.2492544"
    },
    {
      "text": "Michael J. Paul and Mark Dredze. 2011. You Are What You Tweet: Analyzing Twitter for Public Health. In ICWSM. 265--272.",
      "doi": ""
    },
    {
      "text": "Michael J. Paul and Mark Dredze. 2014. Discovering Health Topics in Social Media Using Topic Models. PLOS ONE 9 (2014), e103408. Issue 8.",
      "doi": ""
    },
    {
      "text": "J. Pennebaker, J. Francis, and R. Booth. 2007. Linguistic inquiry and word count: LIWC 2001. (2007). http://homepage.psy.utexas.edu/ homepage/faculty/pennebaker/reprints/ liwc2007_operatormanual.pdf.",
      "doi": ""
    },
    {
      "text": "Salimian P.K., Chunara R., and Weitzman E.R. 2014. Averting the perfect storm: addressing youth substance use risk from social media use. Pediatric Annals 43 (2014), e242. Issue 10.",
      "doi": ""
    },
    {
      "text": "Kyle W Prier, Matthew S Smith, Christophe Giraud-Carrier, and Carl L Hanson. 2011. Identifying health-related topics on twitter. In Social computing, behavioral-cultural modeling and prediction. Springer, 18--25. ",
      "doi": "10.5555/1964698.1964702"
    },
    {
      "text": "Adam Sadilek and Henry Kautz. 2013. Modeling the Impact of Lifestyle on Health at Scale. In WSDM. 637--646.  ",
      "doi": "10.1145/2433396.2433476"
    },
    {
      "text": "Abeed Sarker, Rachel E. Ginn, Azadeh Nikfarjam, Karen O'Connor, Karen Smith, Swetha Jayaraman, Tejaswi Upadhaya, and Graciela Gonzalez. 2015. Utilizing social media data for pharmacovigilance: A review. Journal of Biomedical Informatics 54 (2015), 202--212.  ",
      "doi": "10.1016/j.jbi.2015.02.004"
    },
    {
      "text": "Martin Seligman. 2012. Flourish: A Visionary New Understanding of Happiness and Well-being. Atria Books.",
      "doi": ""
    },
    {
      "text": "Kyoko Sudo, Kazuhiko Murasaki, Jun Shimamura, and Yukinobu Taniguchi. 2014. Estimating Nutritional Value from Food Images Based on Semantic Segmentation. In UbiComp. 571--576.  ",
      "doi": "10.1145/2638728.2641336"
    },
    {
      "text": "Morgan Walker, Laura Thornton, Munmun De Choudhury, Jaime Teevan, Cynthia M. Bulik, Cheri A. Levinson, and Stephanie Zerwas. 2015. Facebook Use and Disordered Eating in College-Aged Women. Journal of Adolescent Health 57 (2015), 157--163.",
      "doi": ""
    },
    {
      "text": "Ren Wu, Shengen Yan, Yi Shan, Qingqing Dang, and Gang Sun. 2015. Deep image: Scaling up image recognition. arXiv preprint arXiv:1501.02876 (2015).",
      "doi": ""
    }
  ]
}