{
  "doi": "10.1145/2858036.2858376",
  "title": "Motivating Stroke Rehabilitation Through Music: A Feasibility Study Using Digital Musical Instruments in the Home",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "1781-1785",
  "year": 2016,
  "badges": [],
  "abstract": "Digital approaches to physical rehabilitation are becoming increasingly common and embedding these new technologies within a musical framework may be particularly motivating. The current feasibility study aimed to test if digital musical instruments (DMIs) could aid in the self-management of stroke rehabilitation in the home, focusing on seated forward reach movements of the upper limb. Participants (n=3), all at least 11 months post stroke, participated in 15 researcher-led music making sessions over a 5 week intervention period. The sessions involved them 'drumming' to the beat of self-chosen tunes using bespoke digital drum pads that were synced wirelessly to an iPad App and triggered percussion sounds as feedback. They were encouraged to continue these exercises when the researcher was not present. The results showed significant levels of self-management and significant increases in functional measures with some evidence for transfer into tasks of daily living.",
  "authors": [
    {
      "name": "Pedro Kirk",
      "institution": "Goldsmiths University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658706322",
      "orcid": "missing"
    },
    {
      "name": "Mick Grierson",
      "institution": "Goldsmiths University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484655842",
      "orcid": "missing"
    },
    {
      "name": "Rebeka Bodak",
      "institution": "Goldsmiths, University of London, Aarhus University & The Royal Academy of Music, Aarhus/Aalborg, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020937",
      "orcid": "missing"
    },
    {
      "name": "Nick Ward",
      "institution": "The National Hospital for Neurology and Neurosurgery, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658642803",
      "orcid": "missing"
    },
    {
      "name": "Fran Brander",
      "institution": "The National Hospital for Neurology and Neurosurgery, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021026",
      "orcid": "missing"
    },
    {
      "name": "Kate Kelly",
      "institution": "The National Hospital for Neurology and Neurosurgery, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019908",
      "orcid": "missing"
    },
    {
      "name": "Nicholas Newman",
      "institution": "Hounslow and Richmond Community Health Care NHS Trus, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020040",
      "orcid": "missing"
    },
    {
      "name": "Lauren Stewart",
      "institution": "Goldsmiths, University of London, Aarhus University & The Royal Academy of Music, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020211",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alankus, G., Lazar, A., May, M., and Kelleher, C. Towards Customizable Games for Stroke Rehabilitation. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM (2010), 2113--2122.  ",
      "doi": "10.1145/1753326.1753649"
    },
    {
      "text": "Amengual, J.L., Rojo, N., Veciana de las Heras, M., et al. Sensorimotor Plasticity after Music-Supported Therapy in Chronic Stroke Patients Revealed by Transcranial Magnetic Stimulation. PLoS ONE 8, 4 (2013), e61883.",
      "doi": ""
    },
    {
      "text": "Blood, A.J. and Zatorre, R.J. Intensely pleasurable responses to music correlate with activity in brain regions implicated in reward and emotion. Proceedings of the National Academy of Sciences 98, 20 (2001), 11818--11823.",
      "doi": ""
    },
    {
      "text": "Bradt, J., Magee, W.L., Dileo, C., Wheeler, B.L., and McGilloway, E. Music therapy for acquired brain injury. In Cochrane Database of Systematic Reviews. John Wiley & Sons, Ltd, 2010.",
      "doi": ""
    },
    {
      "text": "Dean, C.M. and Shepherd, R.B. Task-Related Training Improves Performance of Seated Reaching Tasks After Stroke A Randomized Controlled Trial. Stroke 28, 4 (1997), 722--728.",
      "doi": ""
    },
    {
      "text": "Ferreira, C., Guimarães, V., Santos, A., and Sousa, I. Gamification of Stroke Rehabilitation Exercises Using a Smartphone. Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare, ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering) (2014), 282--285.  ",
      "doi": "10.4108/icst.pervasivehealth.2014.255326"
    },
    {
      "text": "Grau-Sánchez, J., Amengual, J.L., Rojo, N., et al. Plasticity in the sensorimotor cortex induced by Music-supported therapy in stroke patients: a TMS study. Frontiers in Human Neuroscience 7, (2013), 494.",
      "doi": ""
    },
    {
      "text": "Hughes, C.M.L., Tommasino, P., Budhota, A., and Campolo, D. Upper Extremity Proprioception in Healthy Aging and Stroke Populations, and the Effects of Therapist- and Robot-Based Rehabilitation Therapies on Proprioceptive Function. Frontiers in Human Neuroscience 9, (2015).",
      "doi": ""
    },
    {
      "text": "Joice, S. Self-management following stroke. Nursing Standard 26, 22 (2012), 39--46.",
      "doi": ""
    },
    {
      "text": "Karageorghis, C. and Priest, D.-L. Music in Sport and Exercise: An Update on Research and Application. The Sport Journal 11, 3 (2008).",
      "doi": ""
    },
    {
      "text": "1Katan, S., Grierson, M., and Fiebrink, R. Using Interactive Machine Learning to Support Interface Development Through Workshops with Disabled People. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM (2015), 251--254.  ",
      "doi": "10.1145/2702123.2702474"
    },
    {
      "text": "Kirk, P. Can Specialised Electronic Musical Instruments Aid Stroke Rehabilitation? Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems, ACM (2015), 127--132.  ",
      "doi": "10.1145/2702613.2726965"
    },
    {
      "text": "Kleim, J.A., Barbay, S., and Nudo, R.J. Functional reorganization of the rat motor cortex following motor skill learning. Journal of Neurophysiology 80, 6 (1998), 3321--3325.",
      "doi": ""
    },
    {
      "text": "Patel, S., Park, H., Bonato, P., Chan, L., Rodgers, M., and others. A review of wearable sensors and systems with application in rehabilitation. J Neuroeng Rehabil 9, 12 (2012), 1--17.",
      "doi": ""
    },
    {
      "text": "Plautz, E.J., Milliken, G.W., and Nudo, R.J. Effects of repetitive motor training on movement representations in adult squirrel monkeys: role of use versus learning. Neurobiology of Learning and Memory 74, 1 (2000), 27--55.",
      "doi": ""
    },
    {
      "text": "Rodriguez-Fornells, A., Rojo, N., Amengual, J.L., Ripollés, P., Altenmüller, E., and Münte, T.F. The involvement of audio-motor coupling in the music-supported therapy applied to stroke patients. Annals of the New York Academy of Sciences 1252, (2012), 282--293.",
      "doi": ""
    },
    {
      "text": "Saka, O., McGuire, A., and Wolfe, C. Cost of stroke in the United Kingdom. Age and Ageing 38, 1 (2008), 27--32.",
      "doi": ""
    },
    {
      "text": "Salazar, A.J., Silva, A.S., Silva, C., et al. Low-Cost Wearable Data Acquisition for Stroke Rehabilitation: A Proof-of-Concept Study on Accelerometry for Functional Task Assessment. Topics in Stroke Rehabilitation 21, 1 (2014), 12--22.",
      "doi": ""
    },
    {
      "text": "Särkämö, T., Tervaniemi, M., Laitinen, S., et al. Music listening enhances cognitive recovery and mood after middle cerebral artery stroke. Brain 131, 3 (2008), 866--876.",
      "doi": ""
    },
    {
      "text": "Schneider, S., Münte, T., Rodriguez-Fornells, A., Sailer, M., and Altenmüller, E. Music-Supported Training is More Efficient than Functional Motor Training for Recovery of Fine Motor Skills in Stroke Patients. Music Perception: An Interdisciplinary Journal 27, 4 (2010), 271--280.",
      "doi": ""
    },
    {
      "text": "2Schneider, S., Schönle, P.W., Altenmüller, E., and Münte, T.F. Using musical instruments to improve motor skill recovery following a stroke. Journal of neurology 254, 10 (2007), 1339--1346.",
      "doi": ""
    },
    {
      "text": "2Yoo, J. The Role of Therapeutic Instrumental Music Performance in Hemiparetic Arm Rehabilitation. Music Therapy Perspectives 27, 1 (2009), 16--24.",
      "doi": ""
    },
    {
      "text": "Stroke | World Heart Federation. 2015. http://www.world-heart-federation.org/cardiovascular-health/stroke/.",
      "doi": ""
    }
  ]
}