{
  "doi": "10.1145/2858036.2858157",
  "title": "Changing Family Practices with Assistive Technology: MOBERO Improves Morning and Bedtime Routines for Children with ADHD",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "152-164",
  "year": 2016,
  "badges": [],
  "abstract": "Families of children with Attention Deficit Hyperactivity Disorder (ADHD) often report morning and bedtime routines to be stressful and frustrating. Through a design process involving domain professionals and families we designed MOBERO, a smartphone-based system that assists families in establishing healthy morning and bedtime routines with the aim to assist the child in becoming independent and lowering the parents' frustration levels. In a two-week intervention with 13 children with ADHD and their families, MOBERO significantly improved children's independence and reduced parents' frustration levels. Additionally, use of MOBERO was associated with a 16.5% reduction in core ADHD symptoms and an 8.3% improvement in the child's sleep habits, both measured by standardized questionnaires. Our study highlights the potential of assistive technologies to change the everyday practices of families of children with ADHD.",
  "authors": [
    {
      "name": "Tobias Sonne",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81558390556",
      "orcid": "missing"
    },
    {
      "name": "Jörg Müller",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81436600078/rel-imgonly/joerg.jpg",
      "acmid": "81436600078",
      "orcid": "missing"
    },
    {
      "name": "Paul Marshall",
      "institution": "University College London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100280485",
      "orcid": "0000-0003-2950-8310"
    },
    {
      "name": "Carsten Obel",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658770575",
      "orcid": "missing"
    },
    {
      "name": "Kaj Grønbæk",
      "institution": "Aarhus University, Aarhus, Denmark",
      "img": "/do/10.1145/contrib-81100095276/rel-imgonly/kaj-web.jpg",
      "acmid": "81100095276",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "A. D. Anastopoulos, G. J. DuPaul, and R. A. Barkley. 1991. Stimulant medication and parent training therapies for attention deficit-hyperactivity disorder. Journal of Learning Disabilities 24, 4: 210--218.",
      "doi": ""
    },
    {
      "text": "Sonia M. Arteaga, Mo Kudeki, Adrienne Woodworth, and Sri Kurniawan. 2010. Mobile System to Motivate Teenagers? Physical Activity. Proceedings of the 9th International Conference on Interaction Design and Children, ACM, 1--10. http://doi.org/10.1145/1810543.1810545  ",
      "doi": "10.1145/1810543.1810545"
    },
    {
      "text": "William J. Barbaresi, Robert C. Colligan, Amy L. Weaver, Robert G. Voigt, Jill M. Killian, and Slavica K. Katusic. 2013. Mortality, ADHD, and Psychosocial Adversity in Adults With Childhood ADHD: A Prospective Study. Pediatrics 131, 4: 637--644. http://doi.org/10.1542/peds.2012--2354",
      "doi": ""
    },
    {
      "text": "Jakob E. Bardram, Mads Frost, Károly Szántó, Maria Faurholt-Jepsen, Maj Vinberg, and Lars Vedel Kessing. 2013. Designing Mobile Health Technology for Bipolar Disorder: A Field Trial of the Monarca System. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 2627--2636. http://doi.org/10.1145/2470654.2481364  ",
      "doi": "10.1145/2470654.2481364"
    },
    {
      "text": "Jared S. Bauer, Sunny Consolvo, Benjamin Greenstein, et al. 2012. ShutEye: Encouraging Awareness of Healthy Sleep Recommendations with a Mobile, Peripheral Display. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1401--1410. http://doi.org/10.1145/2207676.2208600  ",
      "doi": "10.1145/2207676.2208600"
    },
    {
      "text": "Joseph Biederman and Stephen V Faraone. 2005. Attention-deficit hyperactivity disorder. The Lancet 366, 9481: 237--248. http://doi.org/10.1016/S01406736(05)66915--2",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2: 77--101. http://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Tracy G. Cassels. 2013. ADHD, Sleep Problems, and Bed Sharing: Future Considerations. The American Journal of Family Therapy 41, 1: 13--25. http://doi.org/10.1080/01926187.2012.661653",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Nathaniel F. Watson, and Julie A. Kientz. 2011. Opportunities for Computing Technologies to Support Healthy Sleep Behaviors. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3053-- 3062. http://doi.org/10.1145/1978942.1979395  ",
      "doi": "10.1145/1978942.1979395"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A. Kientz. 2015. SleepTight: Low-burden, Self-monitoring Technology for Capturing and Reflecting on Sleep Behaviors. Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 121--132. http://doi.org/10.1145/2750858.2804266  ",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Sunny Consolvo, Predrag Klasnja, David W. McDonald, et al. 2008. Flowers or a Robot Army?: Encouraging Awareness & Activity with Personal, Mobile Displays. Proceedings of the 10th International Conference on Ubiquitous Computing, ACM, 54--63. http://doi.org/10.1145/1409635.1409644  ",
      "doi": "10.1145/1409635.1409644"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, and James A. Landay. 2009. Theory-driven Design Strategies for Technologies That Support Behavior Change in Everyday Life. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 405--414. http://doi.org/10.1145/1518701.1518766  ",
      "doi": "10.1145/1518701.1518766"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, et al. 2008. Activity Sensing in the Wild: A Field Trial of Ubifit Garden. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1797--1806. http://doi.org/10.1145/1357054.1357335  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Samuele Cortese, Stephen V. Faraone, Eric Konofal, and Michel Lecendreux. 2009. Sleep in Children With Attention-Deficit/Hyperactivity Disorder: MetaAnalysis of Subjective and Objective Studies. Journal of the American Academy of Child & Adolescent Psychiatry 48, 9: 894--908. http://doi.org/10.1097/CHI.0b013e3181ac09c9",
      "doi": ""
    },
    {
      "text": "Søren Dalsgaard, Preben Bo Mortensen, Morten Frydenberg, and Per Hove Thomsen. 2013. Long-term criminal outcome of children with attention deficit hyperactivity disorder. Criminal behaviour and mental health: CBMH 23, 2: 86--98. http://doi.org/10.1002/cbm.1860",
      "doi": ""
    },
    {
      "text": "Julia F. Dewald, Anne M. Meijer, Frans J. Oort, Gerard A. Kerkhof, and Susan M. Bögels. 2010. The influence of sleep quality, sleep duration and sleepiness on school performance in children and adolescents: A metaanalytic review. Sleep Medicine Reviews 14, 3: 179--189. http://doi.org/10.1016/j.smrv.2009.10.004",
      "doi": ""
    },
    {
      "text": "Douglas E. Faries, Ilker Yalcin, Donald Harder, and John H. Heiligenstein. 2001. Validation of the ADHD Rating Scale as a clirlician administered and scored instrument. Journal of Attention Disorders 5, 2: 107--115. http://doi.org/10.1177/108705470100500204",
      "doi": ""
    },
    {
      "text": "Michael W. Firmin and Annie Phillips. 2009. A Qualitative Study of Families and Children Possessing Diagnoses of ADHD. Journal of Family Issues 30, 9: 1155--1174. http://doi.org/10.1177/0192513X09333709",
      "doi": ""
    },
    {
      "text": "Goldman LS, Genel M, Bezman RJ, Slanetz PJ, for the Council on Scientific Affairs, and American Medical Association. 1998. DIagnosis and treatment of attention deficit/hyperactivity disorder in children and adolescents. JAMA 279, 14: 1100--1107. http://doi.org/10.1001/jama.279.14.1100",
      "doi": ""
    },
    {
      "text": "V. A. Harpin. 2005. The effect of ADHD on the life of an individual, their family, and community from preschool to adult life. Archives of Disease in Childhood 90 Suppl 1: i2--7. http://doi.org/10.1136/adc.2004.059006",
      "doi": ""
    },
    {
      "text": "Lily Hechtman and Brian Greenfield. 2003. Long-term use of stimulants in children with attention deficit hyperactivity disorder: safety, efficacy, and long-term outcome. Paediatric Drugs 5, 12: 787--794.",
      "doi": ""
    },
    {
      "text": "Inseok Hwang, Chungkuk Yoo, Chanyou Hwang, et al. 2014. TalkBetter: Family-driven Mobile Intervention Care for Children with Language Delay. Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing, ACM, 1283--1296. http://doi.org/10.1145/2531602.2531668  ",
      "doi": "10.1145/2531602.2531668"
    },
    {
      "text": "Mads Møller Jensen, Majken Kirkegaard Rasmussen, and Kaj Grønbæk. 2013. Exploring Opponent Formats. In Entertainment Computing -- ICEC 2013, Junia C. Anacleto, Esteban W. G. Clua, Flavio S. Correa da Silva, Sidney Fels and Hyun S. Yang (eds.). Springer Berlin Heidelberg, 48--60. Retrieved September 22, 2015 from http://link.springer.com/chapter/10.1007/978--3--64241106--9_6",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, et al. 2012. Lullaby: A Capture & Access System for Understanding the Sleep Environment. Proceedings of the 2012 ACM Conference on Ubiquitous Computing, ACM, 226--234. http://doi.org/10.1145/2370216.2370253  ",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Julie A. Kientz, Matthew S. Goodwin, Gillian R. Hayes, and Gregory D. Abowd. 2013. Interactive Technologies for Autism. Synthesis Lectures on Assistive, Rehabilitative, and Health-Preserving Technologies 2, 2: 1--177. http://doi.org/10.2200/S00533ED1V01Y201309ARH00 ",
      "doi": "10.5555/2613712"
    },
    {
      "text": "Hyungsin Kim, Anya Kogan, Chandan Dasgupta, Michael Misha Novitzky, and Ellen Yi-Luen Do. 2011. Grocery Hunter: A Fun Mobile Game for Children to Combat Obesity. Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 317--320. http://doi.org/10.1145/1935701.1935775  ",
      "doi": "10.1145/1935701.1935775"
    },
    {
      "text": "Predrag Klasnja, Sunny Consolvo, and Wanda Pratt. 2011. How to Evaluate Technologies for Health Behavior Change in HCI Research. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3063--3072. http://doi.org/10.1145/1978942.1979396  ",
      "doi": "10.1145/1978942.1979396"
    },
    {
      "text": "Torkel Klingberg, Elisabeth Fernell, Pernille J. Olesen, et al. 2005. Computerized Training of Working Memory in Children With ADHD-A Randomized, Controlled Trial. Journal of the American Academy of Child & Adolescent Psychiatry 44, 2: 177--186. http://doi.org/10.1097/00004583--200502000-00010",
      "doi": ""
    },
    {
      "text": "James J. Lin, Lena Mamykina, Silvia Lindtner, Gregory Delajoux, and Henry B. Strub. 2006. Fish-n-Steps: Encouraging Physical Activity with an Interactive Computer Game. In UbiComp 2006: Ubiquitous Computing, Paul Dourish and Adrian Friday (eds.). Springer Berlin Heidelberg, 261--278. Retrieved April 16, 2014 from http://link.springer.com/chapter/10.1007/11853565_16  ",
      "doi": "10.1007/11853565_16"
    },
    {
      "text": "Salvatore Mannuzza, Rachel G. Klein, and John L. Moulton. 2008. Lifetime criminality among boys with ADHD: a prospective follow-up study into adulthood using official arrest records. Psychiatry research 160, 3: 237--246. http://doi.org/10.1016/j.psychres.2007.11.003",
      "doi": ""
    },
    {
      "text": "Greta M Massetti, Benjamin B Lahey, William E Pelham, et al. 2008. Academic achievement over 8 years among children who met modified criteria for attention deficit/hyperactivity disorder at 4--6 years of age. Journal of abnormal child psychology 36, 3: 399--410. http://doi.org/10.1007/s10802-007--9186--4",
      "doi": ""
    },
    {
      "text": "Robert J. McInerney and Kimberly A. Kerns. 2003. Time Reproduction in Children With ADHD: Motivation Matters. Child Neuropsychology 9, 2: 91--108. http://doi.org/10.1076/chin.9.2.91.14506",
      "doi": ""
    },
    {
      "text": "J. A. Owens, A. Spirito, and M. McGuinn. 2000. The Children's Sleep Habits Questionnaire (CSHQ): psychometric properties of a survey instrument for school-aged children. Sleep 23, 8: 1043--1051.",
      "doi": ""
    },
    {
      "text": "Laura Pina, Kael Rowan, Asta Roseway, Paul Johns, Gillian R. Hayes, and Mary Czerwinski. 2014. In Situ Cues for ADHD Parenting Strategies Using Mobile Technology. Proceedings of the 8th International Conference on Pervasive Computing Technologies for Healthcare, ICST (Institute for Computer Sciences, Social-Informatics and Telecommunications Engineering), 17--24. http://doi.org/10.4108/icst.pervasivehealth.2014.254958  ",
      "doi": "10.4108/icst.pervasivehealth.2014.254958"
    },
    {
      "text": "Guilherme Polanczyk, Maurício Silva de Lima, Bernardo Lessa Horta, Joseph Biederman, and Luis Augusto Rohde. 2007. The worldwide prevalence of ADHD: a systematic review and metaregression analysis. The American Journal of Psychiatry 164, 6: 942--948. http://doi.org/10.1176/ajp.2007.164.6.942",
      "doi": ""
    },
    {
      "text": "Ruth Segal. 1998. The Construction of Family Occupations: A Study of Families with Children Who Have Attention Deficit/Hyperactivity Disorder. Canadian Journal of Occupational Therapy 65, 5: 286--292. http://doi.org/10.1177/000841749806500506",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Ran Gilad-Bachrach, and Geraldine Fitzpatrick. 2015. Designing Social and Emotional Skills Training: The Challenges and Opportunities for Technology Support. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2797--2800. http://doi.org/10.1145/2702123.2702385  ",
      "doi": "10.1145/2702123.2702385"
    },
    {
      "text": "Tobias Sonne and Kaj Grønbæk. 2015. Designing Assistive Technologies for the ADHD Domain. Accepted for publication in Pervasive Computing Paradigms for Mental Health. Springer International Publishing.",
      "doi": ""
    },
    {
      "text": "Tobias Sonne and Mads Møller Jensen. 2014. Race By Hearts. In Entertainment Computing -- ICEC 2014, Yusuf Pisan, Nikitas M. Sgouros and Tim Marsh (eds.). Springer Berlin Heidelberg, 125--132. Retrieved March 24, 2015 from http://link.springer.com/chapter/10.1007/978--3--66245212--7_16",
      "doi": ""
    },
    {
      "text": "Tobias Sonne, Carsten Obel, and Kaj Grønbæk. 2015. Designing Real Time Assistive Technologies: A Study of Children with ADHD. Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction, ACM, 34--38. http://doi.org/10.1145/2838739.2838815  ",
      "doi": "10.1145/2838739.2838815"
    },
    {
      "text": "Katarzyna Stawarz, Anna L. Cox, and Ann Blandford. 2015. Beyond Self-Tracking and Reminders: Designing Smartphone Apps That Support Habit Formation. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2653--2662. http://doi.org/10.1145/2702123.2702230  ",
      "doi": "10.1145/2702123.2702230"
    },
    {
      "text": "Ole Jakob Storebø, Maria Skoog, Pernille Darling Rasmussen, et al. 2014. Attachment Competences in Children With ADHD During the Social-Skills Training and Attachment (SOSTRA) Randomized Clinical Trial. Journal of Attention Disorders: 1087054713520220. http://doi.org/10.1177/1087054713520220",
      "doi": ""
    },
    {
      "text": "Enrico Tanuwidjaja, Derek Huynh, Kirsten Koa, et al. 2014. Chroma: A Wearable Augmented-reality Solution for Color Blindness. Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing, ACM, 799--810. http://doi.org/10.1145/2632048.2632091  ",
      "doi": "10.1145/2632048.2632091"
    },
    {
      "text": "Carolyn Webster-Stratton and M. Jamila. 2010. Parents, teachers, and therapists using child-directed play therapy and coaching skills to promote children's social and emotional competence and build positive relationships. In Play therapy for preschool children. American Psychological Association, Washington, DC, US, 245--273.",
      "doi": ""
    },
    {
      "text": "Peter M. Wehmeier, Alexander Schacht, and Russell A. Barkley. 2010. Social and Emotional Impairment in Children and Adolescents with ADHD and the Impact on Quality of Life. Journal of Adolescent Health 46, 3: 209--217. http://doi.org/10.1016/j.jadohealth.2009.09.009",
      "doi": ""
    },
    {
      "text": "Orad Weisberg, Ayelet GalOz, Ruth Berkowitz, et al. 2014. TangiPlan: Designing an Assistive Technology to Enhance Executive Functioning Among Children with Adhd. Proceedings of the 2014 Conference on Interaction Design and Children, ACM, 293--296. http://doi.org/10.1145/2593968.2610475  ",
      "doi": "10.1145/2593968.2610475"
    },
    {
      "text": "World Health Organization. 1992. The ICD-10 classification of mental and behavioural disorders?: clinical descriptions and diagnostic guidelines. Geneva?: World Health Organization. Retrieved November 22, 2014 from http://apps.who.int//iris/handle/10665/37958",
      "doi": ""
    },
    {
      "text": "Oren Zuckerman, Ayelet Gal-Oz, Neta Tamir, and Daphne Kopelman-Rubin. 2015. Initial Validation of an Assistive Technology to Enhance Executive Functioning Among Children with ADHD. Proceedings of the 14th International Conference on Interaction Design and Children, ACM, 299--302. http://doi.org/10.1145/2771839.2771901  ",
      "doi": "10.1145/2771839.2771901"
    },
    {
      "text": "Mental Health Surveillance Among Children -- United States, 2005--2011. Retrieved May 21, 2015 from http://www.cdc.gov/mmwr/preview/mmwrhtml/su6202a1.htm?viewType=Print&viewClass=Print",
      "doi": ""
    },
    {
      "text": "Validity and clinical feasibility of the ADHD rating scale (ADHD-RS) A Danish Nationwide Multicenter Study - Szomlaiski - 2008 - Acta Pædiatrica - Wiley Online Library. Retrieved September 9, 2015 from http://onlinelibrary.wiley.com/enhanced/doi/10.1111/j.1 651--2227.2008.01025.x/",
      "doi": ""
    }
  ]
}