{
  "doi": "10.1145/2858036.2858444",
  "title": "Age-related Differences in the Content of Search Queries when Reformulating",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "5720-5730",
  "year": 2016,
  "badges": [],
  "abstract": "This study investigated the change in the content of the queries when performing reformulations in relation to age and task difficulty. Results showed that both generalization and specialization strategies were applied significantly more often for difficult tasks compared to simple tasks. Young participants were found to use specialization strategy significantly more often than old participants. Generalization strategy was also used significantly more often by young participants, especially for difficult tasks. Young participants were found to reformulate much longer than old participants. The semantic relevance of queries with the target information was found to be significantly higher for difficult tasks compared to simple tasks. It showed a decreasing trend across reformulations for old participants and remained constant for young participants, indicating that as old participants reformulated, they produced queries that were further away from the target information. Implications of these findings for design of information search systems are discussed.",
  "tags": [
    "task difficulty",
    "information search",
    "reformulation strategies",
    "aging"
  ],
  "authors": [
    {
      "name": "Saraschandra Karanam",
      "institution": "Utrecht University, Utrecht, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482661319",
      "orcid": "missing"
    },
    {
      "name": "Herre van Oostendorp",
      "institution": "Utrecht University, Utrecht, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100577461",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Anne Aula. 2005. User study on older adults use of the Web and search engines. Universal Access in the Information Society 4, 1 (2005), 67-81.  ",
      "doi": "10.1007/s10209-004-0097-7"
    },
    {
      "text": "Pia Borlund and Peter Ingwersen. 1997. The development of a method for the evaluation of interactive information retrieval systems. Journal of documentation 53, 3 (1997), 225-250.",
      "doi": ""
    },
    {
      "text": "Aline Chevalier, Aurélie Dommes, and Jean-Claude Marquié. 2011. Information searching on the web: the cognitive difficulties experienced by older users in modifying unsuccessful information searches. In Engineering Psychology and Cognitive Ergonomics. Springer, 225-232. ",
      "doi": "10.5555/2029174.2029202"
    },
    {
      "text": "Aline Chevalier, Aurélie Dommes, and Jean-Claude Marquié. 2015. Strategy and accuracy during information search on the Web: Effects of age and complexity of the search questions. Computers in Human Behavior 53 (2015), 305-315.  ",
      "doi": "10.1016/j.chb.2015.07.017"
    },
    {
      "text": "Aline Chevalier, Aurélie Dommes, and Daniel Martins. 2013. The effects of ageing and website ergonomic quality on internet information searching. Ageing and Society 33, 06 (2013), 1009-1035.",
      "doi": ""
    },
    {
      "text": "Jessie Chin, Evan Anderson, Chieh-Li Chin, and Wai-Tat Fu. 2015. Age differences in information search: An exploration-exploitation tradeoff model. In Proceedings of the Human Factors and Ergonomic Society (HFES 2015). 85-89.",
      "doi": ""
    },
    {
      "text": "Jessie Chin and Wai-Tat Fu. 2010. Interactive effects of age and interface differences on search strategies and performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 403-412.  ",
      "doi": "10.1145/1753326.1753387"
    },
    {
      "text": "Jessie Chin, Wai-Tat Fu, and Thomas Kannampallil. 2009. Adaptive information search: age-dependent interactions between cognitive profiles and strategies. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1683-1692.  ",
      "doi": "10.1145/1518701.1518961"
    },
    {
      "text": "Jérôme Dinet, Eric Brangier, Gabriel Michel, Robin Vivian, Sophie Battisti, and Rémi Doller. 2007. Older people as information seekers: Exploratory studies about their needs and strategies. In Universal Acess in Human Computer Interaction. Coping with Diversity. Springer, 877-886. ",
      "doi": "10.5555/1766311.1766413"
    },
    {
      "text": "Aurelie Dommes, Aline Chevalier, and Sarah Lia. 2011. The role of cognitive flexibility and vocabulary abilities of younger and older users in searching for information on the web. Applied Cognitive Psychology 25, 5 (2011), 717-726.",
      "doi": ""
    },
    {
      "text": "Susan T Dumais. 2004. Latent semantic analysis. Annual review of information science and technology 38, 1 (2004), 188-230.",
      "doi": ""
    },
    {
      "text": "Jacqueline K Eastman and Rajesh Iyer. 2004. The elderly's uses and attitudes towards the Internet. Journal of Consumer Marketing 21, 3 (2004), 208-220.",
      "doi": ""
    },
    {
      "text": "Wai-Tat Fu and Peter Pirolli. 2007. SNIF-ACT: A cognitive model of user navigation on the World Wide Web. Human-Computer Interaction 22, 4 (2007), 355-412. ",
      "doi": "10.5555/1466607.1466608"
    },
    {
      "text": "John L Horn. 2012. The Theory of Fluid and Crystallized Intelligence in Relation to Concepts of Cognitive Psychology and Aging in. In Aging and cognitive processes. Vol. 8. Springer Science & Business Media, 237-278.",
      "doi": ""
    },
    {
      "text": "John L Horn and Raymond B Cattell. 1967. Age differences in fluid and crystallized intelligence. Acta psychologica 26 (1967), 107-129.",
      "doi": ""
    },
    {
      "text": "Rong Hu, Kun Lu, and Soohyung Joo. 2013. Effects of topic familiarity and search skills on query reformulation behavior. Proceedings of the American Society for Information Science and Technology 50, 1 (2013), 1-9. ",
      "doi": "10.5555/2655780.2655846"
    },
    {
      "text": "Jeff Huang and Efthimis N Efthimiadis. 2009. Analyzing and evaluating query reformulation strategies in web search logs. In Proceedings of the 18th ACM conference on Information and knowledge management. ACM, 77-86.  ",
      "doi": "10.1145/1645953.1645966"
    },
    {
      "text": "Bernard J Jansen, Amanda Spink, and Bhuva Narayan. 2007. Query modifications patterns during web searching. In Information Technology, 2007. ITNG'07. Fourth International Conference on. IEEE, 439-444.  ",
      "doi": "10.1109/ITNG.2007.164"
    },
    {
      "text": "Ion Juvina and Herre van Oostendorp. 2008. Modeling semantic and structural knowledge in Web navigation. Discourse Processes 45, 4--5 (2008), 346-364.",
      "doi": ""
    },
    {
      "text": "Saraschandra Karanam, Herre van Oostendorp, and Bipin Indurkhya. 2012. Evaluating CoLiDeS+ Pic: the role of relevance of pictures in user navigation behaviour. Behaviour & Information Technology 31, 1 (2012), 31-40.",
      "doi": ""
    },
    {
      "text": "Saraschandra Karanam, Herre van Oostendorp, Mylène Sanchiz, Aline Chevalier, Jessie Chin, and Wai Tat Fu. 2015. Modeling and predicting information search behavior. In Proceedings of the 5th International Conference on Web Intelligence, Mining and Semantics. ACM, 7.  ",
      "doi": "10.1145/2797115.2797123"
    },
    {
      "text": "Walter Kintsch. 1998. Comprehension: A paradigm for cognition. Cambridge university press.",
      "doi": ""
    },
    {
      "text": "Thomas K Landauer, Peter W Foltz, and Darrell Laham. 1998. An introduction to latent semantic analysis. Discourse processes 25, 2--3 (1998), 259-284.",
      "doi": ""
    },
    {
      "text": "Chang Liu, Jacek Gwizdka, Jingjing Liu, Tao Xu, and Nicholas J Belkin. 2010. Analysis and evaluation of query reformulations in different task types. Proceedings of the American Society for Information Science and Technology 47, 1 (2010), 1-9. ",
      "doi": "10.5555/1920331.1920356"
    },
    {
      "text": "David Mellor, Lucy Firth, and Kathleen Moore. 2008. Can the Internet Improve the Well-being of the Elderly? Ageing international 32, 1 (2008), 25-42.",
      "doi": ""
    },
    {
      "text": "Tracy L Mitzner, Julie B Boron, Cara Bailey Fausset, Anne E Adams, Neil Charness, Sara J Czaja, Katinka Dijkstra, Arthur D Fisk, Wendy A Rogers, and Joseph Sharit. 2010. Older adults talk technology: Technology usage and attitudes. Computers in human behavior 26, 6 (2010), 1710-1721.  ",
      "doi": "10.1016/j.chb.2010.06.020"
    },
    {
      "text": "Sophie Monchaux, Franck Amadieu, Aline Chevalier, and Claudette Mariné. 2015. Query strategies during information searching: Effects of prior domain knowledge and complexity of the information problems to be solved. Information Processing & Management 51, 5 (2015), 557-569.  ",
      "doi": "10.1016/j.ipm.2015.05.004"
    },
    {
      "text": "Christopher Olston and Ed H Chi. 2003. ScentTrails: Integrating browsing and searching on the Web. ACM Transactions on Computer-Human Interaction (TOCHI) 10, 3 (2003), 177-197.  ",
      "doi": "10.1145/937549.937550"
    },
    {
      "text": "Richard Pak and Margaux M Price. 2008. Designing an information search interface for younger and older adults. Human Factors: The Journal of the Human Factors and Ergonomics Society 50, 4 (2008), 614-628.",
      "doi": ""
    },
    {
      "text": "Ira Puspitasari, Koichi Moriyama, Ken-ichi Fukui, and Masayuki Numao. 2015. Effects of Individual Health Topic Familiarity on Activity Patterns During Health Information Searches. JMIR medical informatics 3, 1 (2015).",
      "doi": ""
    },
    {
      "text": "Tara L Queen, Thomas M Hess, Gilda E Ennis, Keith Dowd, and Daniel Grühn. 2012. Information search and decision making: Effects of age and complexity on strategy use. Psychology and aging 27, 4 (2012), 817.",
      "doi": ""
    },
    {
      "text": "Soo Young Rieh and others. 2006. Analysis of multiple query reformulations on the web: The interactive information retrieval context. Information Processing & Management 42, 3 (2006), 751-768.  ",
      "doi": "10.1016/j.ipm.2005.05.005"
    },
    {
      "text": "Karin Slegers, Martin PJ Van Boxtel, and Jelle Jolles. 2012. Computer use in older adults: determinants and the relationship with cognitive change over a 6year episode. Computers in Human Behavior 28, 1 (2012), 1-10.  ",
      "doi": "10.1016/j.chb.2011.08.003"
    },
    {
      "text": "Esther Strauss, Elisabeth MS Sherman, and Otfried Spreen. 2006. A compendium of neuropsychological tests: Administration, norms, and commentary. Oxford University Press, USA.",
      "doi": ""
    },
    {
      "text": "Jaime Teevan, Eytan Adar, Rosie Jones, and Michael AS Potts. 2007. Information re-retrieval: repeat queries in Yahoo's logs. In Proceedings of the 30th annual international ACM SIGIR conference on Research and development in information retrieval. ACM, 151-158.  ",
      "doi": "10.1145/1277741.1277770"
    },
    {
      "text": "Jing-Jen Wang and Alan S Kaufman. 1993. Changes in fluid and crystallized intelligence across the 20-to 90-year age range on the K-BIT. Journal of Psychoeducational Assessment 11, 1 (1993), 29-37.",
      "doi": ""
    },
    {
      "text": "Robert J Youmans, Brooke Bellows, Christian A Gonzalez, Brittany Sarbone, and Ivonne J Figueroa. 2013. Designing for the wisdom of elders: age related differences in online search strategies. In Universal Access in Human-Computer Interaction. User and Context Diversity. Springer, 240-249.  ",
      "doi": "10.1007/978-3-642-39191-0_27"
    },
    {
      "text": "Panayiotis Zaphiris, Sri Kurniawan, and Mariya Ghiawadwala. 2007. A systematic approach to the development of research-based web design guidelines for older people. Universal Access in the Information Society 6, 1 (2007), 59-75.  ",
      "doi": "10.1007/s10209-006-0054-8"
    }
  ]
}