{
  "doi": "10.1145/2858036.2858043",
  "title": "Virtual Objects as Spatial Cues in Collaborative Mixed Reality Environments: How They Shape Communication Behavior and User Task Load",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "1245-1249",
  "year": 2016,
  "badges": [],
  "abstract": "In collaborative activities, collaborators can use physical objects in their shared environment as spatial cues to guide each other's attention. Collaborative mixed reality environments (MREs) include both, physical and digital objects. To study how virtual objects influence collaboration and whether they are used as spatial cues, we conducted a controlled lab experiment with 16 dyads. Results of our study show that collaborators favored the digital objects as spatial cues over the physical environment and the physical objects: Collaborators used significantly less deictic gestures in favor of more disambiguous verbal references and a decreased subjective workload when virtual objects were present. This suggests adding additional virtual objects as spatial cues to MREs to improve user experience during collaborative mixed reality tasks.",
  "tags": [
    "collaboration",
    "mixed reality",
    "virtual spatial cues"
  ],
  "authors": [
    {
      "name": "Jens Müller",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/do/10.1145/contrib-87958747657/rel-imgonly/mueller.jpg",
      "acmid": "87958747657",
      "orcid": "missing"
    },
    {
      "name": "Roman Rädle",
      "institution": "University of Konstanz & Microsoft Research, Konstanz, Germany",
      "img": "/do/10.1145/contrib-81416608648/rel-imgonly/roman.jpeg",
      "acmid": "81416608648",
      "orcid": "missing"
    },
    {
      "name": "Harald Reiterer",
      "institution": "University of Konstanz, Konstanz, Germany",
      "img": "/do/10.1145/contrib-81100236830/rel-imgonly/reiterer_2021.jpeg",
      "acmid": "81100236830",
      "orcid": "0000-0001-8528-8928"
    }
  ],
  "references": [
    {
      "text": "Steve Benford, Chris Greenhalgh, Gail Reynard, Chris Brown, and Boriana Koleva. 1998. Understanding and Constructing Shared Spaces with Mixed-Reality Boundaries. ACM Transactions on Computer-Human Interaction 5, 3: 185--223. http://doi.org/10.1145/292834.292836  ",
      "doi": "10.1145/292834.292836"
    },
    {
      "text": "Mark Billinghurst, Adrian Clark, and Gun Lee. 2015. A Survey of Augmented Reality. Foundations and Trends® in Human-Computer Interaction 8, 2: 73--272. http://doi.org/10.1561/1100000049  ",
      "doi": "10.1561/1100000049"
    },
    {
      "text": "Mark Billinghurst and Hirokazu Kato. 1999. Collaborative Mixed Reality. Proc. of ISMR '99, Springer, 261--284. Retrieved from http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.107.682&rep=rep1&type=pdf",
      "doi": ""
    },
    {
      "text": "Jeffrey W. Chastine, Kristine Nagel, Ying Zhu, and Luca Yearsovich. 2007. Understanding the design space of referencing in collaborative augmented reality environments. Proc.of CGI '07, 207--214. http://doi.org/10.1145/1268517.1268552  ",
      "doi": "10.1145/1268517.1268552"
    },
    {
      "text": "Susan R Fussell, Robert E Kraut, and Jane Siegel. 2000. Coordination of Communication?: Effects of Shared Visual Context on Collaborative Work. Proc. of CSCW '00, 21--30. http://doi.org/10.1145/358916.358947  ",
      "doi": "10.1145/358916.358947"
    },
    {
      "text": "William W. Gaver. 1992. The Affordances of Media Spaces for Collaboration. Proc. of CSCW '92, 17--24. http://doi.org/10.1145/143457.371596  ",
      "doi": "10.1145/143457.371596"
    },
    {
      "text": "Darren Gergle, Robert E Kraut, and Susan R Fussell. 2013. Using Visual Information for Grounding and Awareness in Collaborative Tasks. Human-Computer Interaction 28, August 2014: 1--39. http://doi.org/10.1080/07370024.2012.678246",
      "doi": ""
    },
    {
      "text": "Kiyoshi Kiyokawa, Mark Billinghurst, Sohan Hayes, Arnab Gupta, Yuki Sannohe, and Hirokazu Kato. 2002. Communication Behaviors of Co-Located Users in Collaborative AR Interfaces. Proc. of ISMAR '02: 135--144. http://doi.org/10.1109/ISMAR.2002.1115083 ",
      "doi": "10.5555/850976.854962"
    },
    {
      "text": "Stpehen C. Levinson. 2003. Space in language and cognition: Exploration in cognitive diversity. Cambridge University Press. http://doi.org/10.1017/CBO9780511613609",
      "doi": ""
    },
    {
      "text": "Gordon D. Logan. 1995. Linguistic and Conceptual Control of Visual Spatial Attention. Cognitive Psychology 28: 103--174. http://doi.org/10.1006/cogp.1995.1004",
      "doi": ""
    },
    {
      "text": "Paul Milgram and Fumio Kishino. 1994. Taxonomy of mixed reality visual displays. IEICE Transactions on Information and Systems, 1321--1329. http://doi.org/10.1.1.102.4646",
      "doi": ""
    },
    {
      "text": "Daniel R. Montello. 2005. Navigation. In The Cambridge handbook of visuospatial thinking, Pritt Shah and Akira Miyake (eds.). 257--294. http://doi.org/10.2277/0521001730",
      "doi": ""
    },
    {
      "text": "Kjeld Schmidt and Carla Simone. 1996. Coordination mechanisms: Towards a conceptual foundation of CSCW systems design. Computer Supported Cooperative Work (CSCW) 5, 2--3: 155--200. http://doi.org/10.1007/BF00133655  ",
      "doi": "10.1007/BF00133655"
    },
    {
      "text": "Norman G. Vinson. 1999. Design Guidelines for Landmarks to Support Navigation in Virtual Environments. Proc. of CHI '99, 278--285. http://doi.org/10.1145/302979.303062  ",
      "doi": "10.1145/302979.303062"
    },
    {
      "text": "2015. Project Tango Tablet Development Kit User Guide. Retrieved January 3, 2016 from https://developers.google.com/projecttango/hardware/tablet#technical_specifications",
      "doi": ""
    },
    {
      "text": "2015. Unity -- Gaming Engine. Retrieved January 3, 2016 from https://unity3d.com/",
      "doi": ""
    }
  ]
}