{
  "doi": "10.1145/2858036.2858496",
  "title": "Shared Language and the Design of Home Healthcare Technology",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "3584-3594",
  "year": 2016,
  "badges": [],
  "abstract": "Words and language are central to most human communication. This paper explores the importance of language for the participatory design of smart home technologies for healthcare. We argue that to effectively involve a broad range of users in the design of new technologies, it is important to actively develop a shared language that is accessible to and owned by all stakeholders, and that facilitates productive dialogues among them. Our discussion is grounded firstly in work with end users, in which problematic language emerged as a key barrier to participation and effective design. Three specific categories of language barriers are identified: jargon, ambiguity, and emotive words. Building on this we undertook a workshop and focus group, respectively involving researchers developing smart health technologies and users, where the focus was on generating a shared language. We discuss this process, including examples that emerged of alternative terminology and specific strategies for creating a shared language.",
  "authors": [
    {
      "name": "Alison Burrows",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658652773",
      "orcid": "missing"
    },
    {
      "name": "Rachael Gooberman-Hill",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658713673",
      "orcid": "missing"
    },
    {
      "name": "David Coyle",
      "institution": "University College Dublin, Dublin, Ireland",
      "img": "/do/10.1145/contrib-81333488106/rel-imgonly/davidcoyle.jpg",
      "acmid": "81333488106",
      "orcid": "0000-0002-5103-0379"
    }
  ],
  "references": [
    {
      "text": "Rikke Aarhus and Stinne A. Ballegaard. 2010. Negotiating boundaries: Managing disease at home. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'10), 1223--1232.  ",
      "doi": "10.1145/1753326.1753509"
    },
    {
      "text": "Gregory D. Abowd, Aaron F. Bobick, Irfan A. Essa, Elizabeth D. Mynatt, and Wendy A. Rogers. 2002. The aware home: A living laboratory for technologies for successful aging. In Proceedings of the AAAI-02 Workshop Automation as Caregiver, 1--7.",
      "doi": ""
    },
    {
      "text": "Fadel Adib, Hongzi Mao, Zachary Kabelac, Dina Katabi, and Robert C. Miller. 2015. Smart Homes that monitor breathing and heart rate. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15), 837--846.  ",
      "doi": "10.1145/2702123.2702200"
    },
    {
      "text": "Peter B. Andersen and Berit Holmqvist. 1992. Language, perspectives, and design. In Design at work, Joan Greenbaum and Morten Kyng (eds.). L. Erlbaum Associates Inc., Hillsdale, NJ, USA, 91--120. ",
      "doi": "10.5555/125470.125444"
    },
    {
      "text": "Stinne A. Ballegaard, Thomas R. Hansen, and Morten Kyng. 2008. Healthcare in everyday life: Designing healthcare services for daily life. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'08), 1807--1816.  ",
      "doi": "10.1145/1357054.1357336"
    },
    {
      "text": "Jonathan Boote, Wendy Baird, and Claire Beecroft. 2010. Public involvement at the design stage of primary health research: A narrative review of case examples. Health policy 95, 1 (April 2010), 10--23.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2, 77--101.",
      "doi": "10.1191/1478088706"
    },
    {
      "text": "Ryan Brotman, Winslow Burleson, Jodi Forlizzi, William Heywood, and Jisoo Lee. 2015. Building change: Constructive design of smart domestic environments for goal achievement. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15), 3083--3092.  ",
      "doi": "10.1145/2702123.2702602"
    },
    {
      "text": "A. J. Brush, Bongshin Lee, Ratul Mahajan, Sharad Agarwal, Stefan Saroiu, and Colin Dixon. 2011. Home automation in the wild: Challenges and opportunities. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'11), 2115--2124.  ",
      "doi": "10.1145/1978942.1979249"
    },
    {
      "text": "Alison Burrows, Rachael Gooberman-Hill, and David Coyle. 2015. Empirically derived user attributes for the design of home healthcare technologies. Personal and Ubiquitous Computing 19, 8 (December 2015), 1233--1245.  ",
      "doi": "10.1007/s00779-015-0889-1"
    },
    {
      "text": "Marie Chan, Daniel Estève, Christophe Escriba, and Eric Campo. 2008. A review of smart homes-Present state and future challenges. Computer Methods and Programs in Biomedicine 91, 1 (July 2008), 55--81.  ",
      "doi": "10.1016/j.cmpb.2008.02.001"
    },
    {
      "text": "Alan Cooper. 1999. The inmates are running the asylum: Why high-tech products drive us crazy and how to restore the sanity. Sams. ",
      "doi": "10.5555/553473"
    },
    {
      "text": "Andy Crabtree, Richard Mortier, Tom Rodden, and Peter Tolmie. 2012. Unremarkable networking: The home network as a part of everyday life. In Proceedings of the Designing Interactive Systems Conference (DIS 2012), 554--563.  ",
      "doi": "10.1145/2317956.2318039"
    },
    {
      "text": "Andy Crabtree and Tom Rodden. 2004. Domestic routines and design for the home. Computer Supported Cooperative Work (CSCW) 13, 2 (April 2004), 191--220.  ",
      "doi": "10.1023/B%3ACOSU.0000045712.26840.a4"
    },
    {
      "text": "Scott Davidoff. 2010. Routine as resource for the design of learning systems. In Proceedings of the 12th ACM International Conference Adjunct Papers on Ubiquitous Computing (UbiComp'10 Adjunct), 457--460.  ",
      "doi": "10.1145/1864431.1864486"
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Charles Yiu, John Zimmerman, and Anind K. Dey. 2006. Principles of smart home control. In UbiComp 2006: Ubiquitous Computing, Paul Dourish and Adrian Friday (eds.). Springer Berlin Heidelberg, 19--34.  ",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Audrey Desjardins, Ron Wakkary, and William Odom. 2015. Investigating genres and perspectives in HCI research on the home. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI'15), 3073--3082.  ",
      "doi": "10.1145/2702123.2702540"
    },
    {
      "text": "Bill Gaver, Tony Dunne, and Elena Pacenti.1999. Design: Cultural probes. interactions 6, 1 (Jan./Feb. 1999), 21--29.  ",
      "doi": "10.1145/291224.291235"
    },
    {
      "text": "Rachael Gooberman-Hill, Jeremy Horwood, and Michael Calnan. 2008. Citizens' juries in planning research priorities: process, engagement and outcome. Health Expectations 11, 3 (September 2008), 272--281.",
      "doi": ""
    },
    {
      "text": "Joy Goodman, Audrey Syme, and Roos Eisma. 2003. Older adults' use of computers: A survey. In Proceedings of the British Computer Society Human-Computer Interaction Conference (BCS-HCI'03).",
      "doi": ""
    },
    {
      "text": "Trisha Greenhalgh. 2009. Patient and public involvement in chronic illness: Beyond the expert patient. BMJ 338, 629--631.",
      "doi": ""
    },
    {
      "text": "Erik Grönvall and Nervo Verdezoto. 2013. Beyond self-monitoring: Understanding non-functional aspects of home-based healthcare technology. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp'13), 587--596.  ",
      "doi": "10.1145/2493432.2493495"
    },
    {
      "text": "Gerald J. Johnson. 1992. Talking about computers: From metaphor to jargon. AI & Society 6, 3, 263--270.",
      "doi": ""
    },
    {
      "text": "Rose Johnson, Yvonne Rogers, Janet van der Linden, and Nadia Bianchi-Berthouze. 2012. Being in the thick of in-the-wild studies: The challenges and insights of researcher participation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), 1135--1144.  ",
      "doi": "10.1145/2207676.2208561"
    },
    {
      "text": "Michelle E. Jordan, Holly J. Lanham, Benjamin F. Crabtree, Paul A. Nutting, William L. Miller, Kurt C. Stange, and Reuben R. McDaniel. 2009. The role of conversation in health care interventions: Enabling sense-making and learning. Implementation Science 4, 15 (March 2009), 1--13.",
      "doi": ""
    },
    {
      "text": "Morten Kyng. 1998. Users and computers: A contextual approach to design of computer artefacts. Scandinavian Journal of Information Systems 10, 1, 744. ",
      "doi": "10.5555/347210.347228"
    },
    {
      "text": "Matthew L. Lee and Anind K. Dey. 2015. Sensor-based observations of daily living for aging in place. Personal and Ubiquitous Computing 19, 1 (January 2015), 27--43.  ",
      "doi": "10.1007/s00779-014-0810-3"
    },
    {
      "text": "Sanna Leppënen and Marika Jokinen. 2003. Daily routines and means of communication in a smart home. In Inside the Smart Home, Richard Harper (ed.). Springer London, 207--225.",
      "doi": ""
    },
    {
      "text": "Brian Y. Lim, Anind K. Dey, and Daniel Avrahami. 2009. Why and why not explanations improve the intelligibility of context-aware intelligent systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'09), 2119--2128.  ",
      "doi": "10.1145/1518701.1519023"
    },
    {
      "text": "Stephen Lindsay, Katie Brittain, Daniel Jackson, Cassim Ladha, Karim Ladha, and Patrick Olivier. 2012. Empathy, participatory design and people with dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'12), 521--530.  ",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Sarah Mennicken, Jo Vermeulen, and Elaine M. Huang. 2014. From today's augmented houses to tomorrow's smart homes: New directions for home automation research. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp'14), 105--115.  ",
      "doi": "10.1145/2632048.2636076"
    },
    {
      "text": "Val Mitchell, Kerstin Leder Mackley, Sarah Pink, Carolina Escobar-Tello, Garrath T. Wilson, and Tracy Bhamra. 2015. Situating digital interventions: Mixed methods for HCI research in the home. Interacting with Computers 27, 1 (January 2015), 3--12.",
      "doi": ""
    },
    {
      "text": "Anne Morris, Joy Goodman, and Helena Brading. 2007. Internet use and non-use: Views of older users. Universal Access in the Information Society 6, 1 (June 2007), 43--57.  ",
      "doi": "10.1007/s10209-006-0057-5"
    },
    {
      "text": "Aisling Ann O'Kane, Yvonne Rogers, and Ann E. Blandford. 2014. Gaining empathy for non-routine mobile device use through autoethnography. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 987--990.  ",
      "doi": "10.1145/2556288.2557179"
    },
    {
      "text": "Sandy Oliver, David G. Armes, and Gill Gyte. 2009. Public involvement in setting a national research agenda. The Patient: Patient-Centered Outcomes Research 2, 3 (September 2009), 179--190.",
      "doi": ""
    },
    {
      "text": "Marianne G. Petersen and Lynne Baillie. 2001. Methodologies for designing future household technologies. In Proceedings of the OIKOS Workshop, 47--49.",
      "doi": ""
    },
    {
      "text": "Jane Fulton Suri. 2001. The next 50 years: Future challenges and opportunities for empathy in our science. Ergonomics 44, 14 (2001), 1278--1289.",
      "doi": ""
    },
    {
      "text": "Joseph Wherton, Paul Sugarhood, Rob Procter, Sue Hinder, and Trisha Greenhalgh. 2015. Co-production in practice: How people with assisted living needs can help design and evolve technologies and services. Implementation Science 10, 1 (May 2015), 75.",
      "doi": ""
    },
    {
      "text": "Peter Wright and John McCarthy. 2008. Empathy and experience in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 637--646.  ",
      "doi": "10.1145/1357054.1357156"
    },
    {
      "text": "Eleanor Wynn and David G. Novick. 1995. Conversational conventions and participation in crossfunctional design teams. In Proceedings of Conference on Organizational Computing Systems (COCS'95), 250--257.  ",
      "doi": "10.1145/224019.224046"
    },
    {
      "text": "Rayoung Yang and Mark W. Newman. 2013. Learning from a learning thermostat: Lessons for intelligent systems for the home. In Proceedings of the 2013 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp'13), 93--102.  ",
      "doi": "10.1145/2493432.2493489"
    },
    {
      "text": "Ni Zhu, Tom Diethe, Massimo Camplani, Lili Tao, Alison Burrows, Niall Twomey, Dritan Kaleshi, Majid Mirmehdi, Peter Flach, and Ian Craddock. 2015. Bridging eHealth and the Internet of Things: The SPHERE project. IEEE Intelligent Systems 30, 4, 3946.",
      "doi": "10.1109/MIS.2015.57"
    }
  ]
}