{
  "doi": "10.1145/2858036.2858476",
  "title": "Designing for Labour: Uber and the On-Demand Mobile Workforce",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "1632-1643",
  "year": 2016,
  "badges": [],
  "abstract": "Apps allowing passengers to hail and pay for taxi service on their phone? such as Uber and Lyft-have affected the livelihood of thousands of workers worldwide. In this paper we draw on interviews with traditional taxi drivers, rideshare drivers and passengers in London and San Francisco to understand how \"ride-sharing\" transforms the taxi business. With Uber, the app not only manages the allocation of work, but is directly involved in \"labour issues\": changing the labour conditions of the work itself. We document how Uber driving demands new skills such as emotional labour, while increasing worker flexibility. We discuss how the design of new technology is also about creating new labour opportunities -- jobs -- and how we might think about our responsibilities in designing these labour relations.",
  "authors": [
    {
      "name": "Mareike Glöss",
      "institution": "Uppsala University, Uppsala, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548422056",
      "orcid": "missing"
    },
    {
      "name": "Moira McGregor",
      "institution": "Mobile Life @ Stockholm University, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81556738156",
      "orcid": "missing"
    },
    {
      "name": "Barry Brown",
      "institution": "Mobile Life @ Stockholm University, Kista, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100013375",
      "orcid": "0000-0002-9710-6607"
    }
  ],
  "references": [
    {
      "text": "Philippe Aigrain. (2012) Sharing: culture and the economy in the internet age. Amsterdam University Press.",
      "doi": ""
    },
    {
      "text": "Donald N Anderson. (2014) \"Not just a taxi\"? Forprofit ridesharing, driver strategies, and VMT. Transportation, 41 (5). 1099--1117.",
      "doi": ""
    },
    {
      "text": "Orley Ashenfelter and David Card. (2010) HANDBOOK OF LABOR ECONOMICS, VOL 4A. Elsevier.",
      "doi": ""
    },
    {
      "text": "Steven Barley and Gideon Kunda. (2001) Bringing work back in. Organisational Science, 12 (1). 76--95.  ",
      "doi": "10.1287/orsc.12.1.76.10122"
    },
    {
      "text": "Ian Beetlestone. (2014) Why London's black cab drivers are protesting over Uber: As taxi drivers, we have to drive through hoops to get licensed -- minicab app Uber should not be given a free ride Guardian.",
      "doi": ""
    },
    {
      "text": "Russell Belk. (2014) You are what you can access: Sharing and collaborative consumption online. Journal of Business Research, 67 (8). 1595--1600.",
      "doi": ""
    },
    {
      "text": "Victoria Bellotti, Alexander Ambard, Daniel Turner, Christina Gossmann, Kamila Demkova and John M. Carroll. (2015) A Muddle of Models of Motivation for Using Peer-to-Peer Economy Systems Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, Seoul, South Korea, 1085--1094.  ",
      "doi": "10.1145/2702123.2702272"
    },
    {
      "text": "Margot Brereton and Sunil Ghelawat. (2010) Designing for participation in local social ridesharing networks: grass roots prototyping of IT systems Proceedings of the 11th Biennial Participatory Design Conference, ACM, Sydney, Australia, 199202.  ",
      "doi": "10.1145/1900441.1900478"
    },
    {
      "text": "Joshua Brustein. (2012) The push to make cab rides smarter The NY Times, NY.",
      "doi": ""
    },
    {
      "text": "Susie Cagle. (2014) The case against sharing. The medium, https://thenib.com/the-case-against-sharing9ea5ba3d216d.",
      "doi": ""
    },
    {
      "text": "Clayton Christensen. (2005) Disruptive Innovation. in Soegaard, M. and Dam, R.F. eds. The Encyclopedia of Human-Computer Interaction, 2nd Ed, The Interaction Design Foundation., Aarhus, Denmark.",
      "doi": ""
    },
    {
      "text": "James Cooper, Ray Mundy and John Nelson. (2010) Taxi!: urban economies and the social and transport impacts of the taxicab. Ashgate Publishing, Ltd.",
      "doi": ""
    },
    {
      "text": "Fred Davis. (1959) The Cabdriver and His Fare: Facets of a Fleeting Relationship. American Journal of Sociology, 65. 158--165.",
      "doi": ""
    },
    {
      "text": "Silvia Elaluf-Calderwood. (2010) Organising SelfReferential Taxi Work with mICT: The case of the London Black Cab Drivers. LAP LAMBERT Academic Publishing.",
      "doi": ""
    },
    {
      "text": "FDIC. (2013) 2013 FDIC National Survey of Unbanked and Underbanked Households.",
      "doi": ""
    },
    {
      "text": "Lisa Fleisher. (2014) Thousands of European Cab Drivers Protest Uber, Taxi Apps: Protesters in London, Madrid, Milan Say the Apps Skirt Regulations Wall Street Journal, NY.",
      "doi": ""
    },
    {
      "text": "Christian Fuchs. (2010) Labor in Informational Capitalism and on the Internet. The Information Society, 26 (3). 179--196.  ",
      "doi": "10.1080/01972241003712215"
    },
    {
      "text": "Diego Gambetta and Heather Hamill. (2005) Streetwise: How Taxi Drivers Establish Customer's Trustworthiness. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Joan Greenbaum. (1996) Back to Labor: Returning to labor process discussions in the study of work. in Proceedings of the 1996 ACM conference on Computer supported cooperative work, ACM, 229237.  ",
      "doi": "10.1145/240080.240259"
    },
    {
      "text": "Alison Griswold. (2014) Increasingly Desperate Lyft Accuses Rival Uber of Dirty Business Tactics Slate.com.",
      "doi": ""
    },
    {
      "text": "Jonathan V Hall and Alan B Krueger. (2015) An Analysis of the Labor Market for Uber's DriverPartners in the USA, Princeton University Industrial Relations Section: Working papers.",
      "doi": ""
    },
    {
      "text": "Dan Hara. (2011) Taxicab Regulations and Taxi Driver Income: Report prepared for the Taxicab Inquiry of Victoria, Australia. Incorporated, H.A.a. ed., Ottawa.",
      "doi": ""
    },
    {
      "text": "John Harvey, David Golightly and Andrew Smith. (2014) HCI as a means to prosociality in the economy. in Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM, 2955--2964.  ",
      "doi": "10.1145/2556288.2557367"
    },
    {
      "text": "Alison Hearn. (2010) Structuring feeling: Web 2.0, online ranking and rating, and the digital \"reputation-economy. Ephemera: Theory and Politics in Organization, 10. 421--438.",
      "doi": ""
    },
    {
      "text": "James J Heckman, Robert J LaLonde and Jeffrey A Smith. (1999) The economics and econometrics of active labor market programs. Handbook of labor economics, 3. 1865--2097.",
      "doi": ""
    },
    {
      "text": "Anthony Hey and Anne Trefethen. (2003) The Data Deluge: An e-Science Perspective. in Hey, G.F.a.T. ed. Grid Computing: Making the Global Infrastructure a reality, John Wiley & Sons Ltd 809--824.",
      "doi": ""
    },
    {
      "text": "Harry Hochheiser and Jonathan Lazar. (2007) HCI and societal issues: A framework for engagement. International Journal of Human Computer Interaction, 23 (3). 339--374.",
      "doi": ""
    },
    {
      "text": "Arlie Russell Hochschild. (2003) The managed heart: Commercialization of human feeling, With a new afterword. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Graham Russell Gao Hodges. (2009) Taxi!: a social history of the NY City cabdriver. JHU Press.",
      "doi": ""
    },
    {
      "text": "Tapio Ikkala and Airi Lampinen. (2015) Monetizing network hospitality: Hospitality and sociability in the context of AirBnB Proceedings of CSCW 2015, ACM Press.  ",
      "doi": "10.1145/2675133.2675274"
    },
    {
      "text": "Lilly Irani. (2015) Difference and Dependence among Digital Workers: The Case of Amazon Mechanical Turk. South Atlantic Quarterly, 114 (1). 225--234.",
      "doi": ""
    },
    {
      "text": "Jofish Kaye, Janet Vertesi, Jennifer Ferreira, Barry Brown and Mark Perry. (2014) # CHImoney: financial interactions, digital cash, capital exchange and mobile money. in CHI'14 Extended Abstracts on Human Factors in Computing Systems, ACM, 111114.  ",
      "doi": "10.1145/2559206.2559221"
    },
    {
      "text": "Aniket Kittur, Jeffrey V. Nickerson, Michael Bernstein, Elizabeth Gerber, Aaron Shaw, John Zimmerman, Matt Lease and John Horton. (2013) The future of crowd work. in Proceedings of the 2013 conference on Computer supported cooperative work (CSCW), ACM, 1301--1318.  ",
      "doi": "10.1145/2441776.2441923"
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky and Laura Dabbish. (2015) Working with Machines: The Impact of Algorithmic and Data-Driven Management on Human Workers. in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1603--1612.  ",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Douglas MacMillan. (2015) Uber touts its employment opportunities The Wall Street Journal, NY.",
      "doi": ""
    },
    {
      "text": "Mark Maguire and Fiona Murphy. (2013) Neoliberalism, securitization and racialization in the Irish taxi industry. European Journal of Cultural Studies. 1367549413508751.",
      "doi": ""
    },
    {
      "text": "Adrian T Moore and Ted Balaker. (2006) Do economists reach a conclusion on taxi de-regulation\" Econ Journal Watch, 3 (1). 109--132.",
      "doi": ""
    },
    {
      "text": "Fabian Muniesa, Yuval Millo and Michel Callon. (2007) An introduction to market devices. The sociological review, 55 (s2). 1--12.",
      "doi": ""
    },
    {
      "text": "Vivi Bach Pedersen and Suzan Lewis. (2012) Flexible friends' Flexible working time arrangements, blurred work-life boundaries and friendship. Work, Employment & Society, 26 (3). 464480.",
      "doi": ""
    },
    {
      "text": "John Pencavel. (1986) Labor supply of men: a survey. Handbook of labor economics, 1 (Part 1). 3102.",
      "doi": ""
    },
    {
      "text": "Gary Pritchard, John Vines, Pam Briggs, Lisa Thomas and Patrick Olivier. (2014) Digitally driven: how location based services impact the work practices of London bus drivers. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 3617--3626.  ",
      "doi": "10.1145/2556288.2557156"
    },
    {
      "text": "Gary W Pritchard, Pam Briggs, John Vines and Patrick Olivier. (2015) How to Drive a London Bus: Measuring Performance in a Mobile and Remote Workplace. in Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 1885--1894.  ",
      "doi": "10.1145/2702123.2702307"
    },
    {
      "text": "Lisa Rayle, Susan Shaheen, Nelson Chan, Danielle Dai and Robert Cervero. (2014) App-Based, OnDemand Ride Services: Comparing Taxi and Ridesourcing Trips and User Characteristics in San Francisco. University of California, Berkeley.",
      "doi": ""
    },
    {
      "text": "Brishen Rogers. (2015) Social Costs of Uber, The. U. Chi. L. Rev. Dialogue, 82. 85.",
      "doi": ""
    },
    {
      "text": "Trebor Scholz (ed.), 2012,^(eds.). Digital labor: The internet as playground and factory. Routledge. ",
      "doi": "10.5555/2432415"
    },
    {
      "text": "Sarah Sharma. (2014) In the meantime: temporality and cultural politics. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Yossi Sheffi. (2014) A Failure to Treat Workers with Respect Could Be Uber's Achilles? Heel. MIT Technology review (September 22, 2014).",
      "doi": ""
    },
    {
      "text": "David K Shipler. (2008) The working poor: Invisible in America. Vintage.",
      "doi": ""
    },
    {
      "text": "Rannie Teodoro, Pinar Ozturk, Mor Naaman, Winter Mason and Janne Lindqvist. (2014) The motivations and experiences of the on-demand mobile workforce. in Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing, ACM, 236--247.  ",
      "doi": "10.1145/2531602.2531680"
    },
    {
      "text": "Uber. (2015) The Driver Roadmap: Where Uber Driver-Partners Have Been, And Where They're Going. A Uber commission report, Benenson Strategy Group.",
      "doi": ""
    },
    {
      "text": "Sudhir Alladi Venkatesh. (2009) Off the Books: The Underground Economy of the Urban Poor. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Sherpa Ventures. (2014) 2014 ODE Report: The Ondemand economy, San Francisco.",
      "doi": ""
    },
    {
      "text": "Ton Wilthagen and Frank Tros. (2004) The concept of \"flexicurity\": a new approach to regulating employment and labour markets. Transfer: European Review of labour and research, 10 (2). 166--186.",
      "doi": ""
    },
    {
      "text": "Matthew Yglesias. (2013) Cities Should Embrace UberX Rather Than Trying to Come Up With Reasons It's Illegal Slate.com.",
      "doi": ""
    }
  ]
}