{
  "doi": "10.1145/2858036.2858440",
  "title": "Generating Personalized Spatial Analogies for Distances and Areas",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "38-48",
  "year": 2016,
  "badges": [],
  "abstract": "Distances and areas frequently appear in text articles. However, people struggle to understand these measurements when they cannot relate them to measurements of locations that they are personally familiar with. We contribute tools for generating personalized spatial analogies: re-expressions that contextualize spatial measurements in terms of locations with similar measurements that are more familiar to the user. Our automated approach takes a user's location and generates a personalized spatial analogy for a target distance or area using landmarks. We present an interactive application that tags distances, areas, and locations in a text article and presents personalized spatial analogies using interactive maps. We find that users who view a personalized spatial analogy map generated by our system rate the helpfulness of the information for understanding a distance or area 1.9 points higher (on a 7 pt scale) than when they see the article with no spatial analogy and 0.7 points higher than when they see generic spatial analogy.",
  "authors": [
    {
      "name": "Yea-Seul Kim",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958696457",
      "orcid": "missing"
    },
    {
      "name": "Jessica Hullman",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484657387",
      "orcid": "0000-0001-6826-3550"
    },
    {
      "name": "Maneesh Agrawala",
      "institution": "Stanford University, Stanford, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100346089",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2015. Leaflet JS. (2015). http://leafletjs.com/",
      "doi": ""
    },
    {
      "text": "2015. NLTK Corpus Reader Documentation. (2015). http://www.nltk.org/_modules/nltk/corpus/reader/lin.html",
      "doi": ""
    },
    {
      "text": "2015. Open Calais. (2015). http://new.opencalais.com/",
      "doi": ""
    },
    {
      "text": "2015. Yelp API. (2015).",
      "doi": ""
    },
    {
      "text": "Susana Bautista, Raquel Hervs, Pablo Gervs, Richard Power, and Ra Williams. 2011. How to Make Numerical Information Accessible: Experimental Identification of Simplification Strategies. (2011).",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec. 2011), 2301--2309. DOI: http://dx.doi.org/10.1109/TVCG.2011.185  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Elizabeth M Brannon. 2006. The representation of numerical magnitude. Current opinion in neurobiology 16, 2 (2006), 222--229.",
      "doi": ""
    },
    {
      "text": "C Brenner and B Elias. 2003. Extracting landmarks for car navigation systems using existing GIS databases and laser scanning. International archives of photogrammetry remote sensing and spatial information sciences 34, 3/W8 (2003), 131--138.",
      "doi": ""
    },
    {
      "text": "Pat Burnett. 1978. Time cognition and urban travel behavior. Geografiska Annaler. Series B. Human Geography (1978), 107--115.",
      "doi": ""
    },
    {
      "text": "David Caduff and Sabine Timpf. 2008. On the assessment of landmark salience for human navigation. Cognitive processing 9, 4 (2008), 249--267.",
      "doi": ""
    },
    {
      "text": "Jamie I. D. Campbell. 2005. Handbook of Mathematical Cognition. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Vira Chankong and Yacov Y Haimes. Multiobjective Decision Making: Theory and Methodology. (1983). http://store.doverpublications.com/0486462897.html",
      "doi": ""
    },
    {
      "text": "X. Cheng and D. Roth. 2013. Relational Inference for Wikification. In EMNLP.",
      "doi": ""
    },
    {
      "text": "Fanny Chevalier, Romain Vuillemot, and Guia Gali. 2013. Using Concrete Scales: A Practical Framework for Effective Visual Depiction of Complex Measures. IEEE TVCG 19, 12 (2013), 2426--2435.  ",
      "doi": "10.1109/TVCG.2013.210"
    },
    {
      "text": "Helen Couclelis, Reginald G Golledge, Nathan Gale, and Waldo Tobler. 1987. Exploring the anchor-point hypothesis of spatial cognition. Journal of Environmental Psychology 7, 2 (1987), 99--122.",
      "doi": ""
    },
    {
      "text": "Stanislas Dehaene, Elizabeth Spelke, and Lisa Feigenson. 2004. Core Systems of Number. Trends in Cognitive Sciences 8, 7 (2004), 307--314.",
      "doi": ""
    },
    {
      "text": "Birgit Elias. 2003. Extracting landmarks with data mining methods. In COSIT. Springer, 375--389.",
      "doi": ""
    },
    {
      "text": "John Eliot. 2002. About spatial intelligence: I. Perceptual and Motor Skills 94, 2 (April 2002), 479--486. DOI: http://dx.doi.org/10.2466/pms.2002.94.2.479",
      "doi": ""
    },
    {
      "text": "Lisa Feigenson, Stanislas Dehaene, and Elizabeth Spelke. 2004. Core systems of number. Trends in cognitive sciences 8, 7 (2004), 307--314.",
      "doi": ""
    },
    {
      "text": "Nathan Gale, Reginald G Golledge, William C Halperin, and Helen Couclelis. 1990. EXPLORING SPATIAL FAMILIARITY. The Professional Geographer 42, 3 (1990), 299--313.",
      "doi": ""
    },
    {
      "text": "Tong Gao, Jessica R Hullman, Eytan Adar, Brent Hecht, and Nicholas Diakopoulos. 2014. NewsViews: an automated pipeline for creating custom geovisualizations for news. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems. ACM, 3005--3014.  ",
      "doi": "10.1145/2556288.2557228"
    },
    {
      "text": "Reginald G. Golledge and Robert J. Stimson. 1996. Spatial Behavior: A Geographic Perspective. The Guilford Press, NY.",
      "doi": ""
    },
    {
      "text": "Google. 2015. Google Maps Javascript API. (2015). https://developers.google.com/maps/documentation/javascript/examples/geocoding-simple",
      "doi": ""
    },
    {
      "text": "Floraine Grabler, Maneesh Agrawala, Robert W Sumner, and Mark Pauly. 2008. Automatic generation of tourist maps. Vol. 27. ACM.",
      "doi": ""
    },
    {
      "text": "Jeffrey L. Griffin and Robert L. Stevenson. 1994. The Effectiveness of Locator Maps in Increasing Reader Understanding of the Geography of Foreign News. Journalism & Mass Communication Quarterly 71, 4 (Dec. 1994), 937--946. DOI: http://dx.doi.org/10.1177/107769909407100417",
      "doi": ""
    },
    {
      "text": "Mordechai (Muki) Haklay and Patrick Weber. 2008. OpenStreetMap: User-Generated Street Maps. IEEE Pervasive Computing 7, 4 (Oct. 2008), 12--18. DOI: http://dx.doi.org/10.1109/MPRV.2008.80  ",
      "doi": "10.1109/MPRV.2008.80"
    },
    {
      "text": "Stefan Hansen, Kai-Florian Richter, and Alexander Klippel. 2006. Landmarks in OpenLSa data structure for cognitive ergonomic route directions. In Geographic information science. Springer, 128--144.  ",
      "doi": "10.1007/11863939_9"
    },
    {
      "text": "Brent Hecht, Samuel H Carton, Mahmood Quaderi, Johannes Schoning, Martin Raubal, Darren Gergle, and Doug Downey. 2012. Explanatory semantic relatedness and explicit spatialization for exploratory search. In Proceedings of the 35th international ACM SIGIR conference on Research and development in information retrieval. ACM, 415--424.  ",
      "doi": "10.1145/2348283.2348341"
    },
    {
      "text": "Sungsoo Ray Hong, Yea-Seul Kim, Jong-Chul Yoon, and Cecilia R Aragon. 2014. Traffigram: distortion for clarification via isochronal cartography. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 907--916.  ",
      "doi": "10.1145/2556288.2557224"
    },
    {
      "text": "Alexander Klippel and Stephan Winter. 2005. Structural salience of landmarks for route directions. In Spatial information theory. Springer, 347--362.  ",
      "doi": "10.1007/11556114_22"
    },
    {
      "text": "Kengo Koiso, Takehisa Mori, Hiroaki Kawagishi, Katsumi Tanaka, and Takahiro Matsumoto. 2000. Infolod and landmark: Spatial presentation of attribute information and computing representative objects for spatial data. International Journal of Cooperative Information Systems 9, 01n02 (2000), 53--75.",
      "doi": ""
    },
    {
      "text": "Manfred Krifka. 2002. For verbosity and precision1. Sounds and systems: studies in structure and change. A festschrift for Theo Vennemann 141 (2002), 439.",
      "doi": ""
    },
    {
      "text": "Michael Luca and GAos Zervas. 2013. Fake it till you make it: Reputation, competition, and Yelp review fraud. Harvard Business School NOM Unit Working Paper 14-006 (2013).",
      "doi": ""
    },
    {
      "text": "Kevin Lynch. 1960. The image of the city. Vol. 11. MIT press.",
      "doi": ""
    },
    {
      "text": "Alejandra Magana, Sean Brophy, and Lynn Bryan. 2012. An Integrated Knowledge Framework to Characterize and Scaffold Size and Scale Cognition (FS2C). Int'l J. of Science Educ. 34, 14 (2012), 2181--2203.",
      "doi": ""
    },
    {
      "text": "Alejandra J Magana. 2014. Learning strategies and multimedia techniques for scaffolding size and scale cognition. Computers & Education 72 (2014), 367--377.",
      "doi": "10.5555/2753879.2754115"
    },
    {
      "text": "Daniel R. Montello. 1997. The Perception and Cognition of Environmental Distance. In Direct Sources of Information, Proc. Int. Conf. on Spatial Information Theory: A Theoretical Basis for GIS. 297--311. ",
      "doi": "10.5555/646126.680913"
    },
    {
      "text": "John Allen Paulos. 1988. Innumeracy: Mathematical Illiteracy and Its Consequences. Macmillan.",
      "doi": ""
    },
    {
      "text": "Martin Raubal and Stephan Winter. 2002a. Enriching wayfinding instructions with local landmarks. Springer.",
      "doi": ""
    },
    {
      "text": "Martin Raubal and Stephan Winter. 2002b. Enriching wayfinding instructions with local landmarks. Springer.",
      "doi": ""
    },
    {
      "text": "Kai-Florian Richter and Alexander Klippel. 2005. A model for context-specific route directions. In Spatial cognition IV. Reasoning, action, interaction. Springer, 58--78.  ",
      "doi": "10.1007/978-3-540-32255-9_4"
    },
    {
      "text": "Bruce M. Ross and Trygg Engen. 1959. Effects of round number preferences in a guessing task. Journal of Experimental Psychology 58, 6 (1959), 462--468. DOI: http://dx.doi.org/10.1037/h0049112",
      "doi": ""
    },
    {
      "text": "Charles Seife. 2010. Proofiness: The Dark Arts of Mathematical Deception (1 ed.). Viking Adult.",
      "doi": ""
    },
    {
      "text": "Taro Tezuka and Katsumi Tanaka. 2005. Landmark extraction: A web mining approach. In Spatial information theory. Springer, 379--396.  ",
      "doi": "10.1007/11556114_24"
    },
    {
      "text": "Taro Tezuka, Yusuke Yokota, Mizuho Iwaihara, and Katsumi Tanaka. 2004. Extraction of cognitively-significant place names and regions from web-based physical proximity co-occurrences. In Web Information Systems-WISE 2004. Springer, 113--124.",
      "doi": ""
    },
    {
      "text": "Barbara Tversky. 2003. Structures of mental spaces how people think about space. Environment and behavior 35, 1 (2003), 66--80.",
      "doi": ""
    },
    {
      "text": "Thaddeus Vincenty. 1975. Direct and inverse solutions of geodesics on the ellipsoid with application of nested equations. Survey review 23, 176 (1975), 88--93.",
      "doi": ""
    },
    {
      "text": "Wikipedia. 2004. API: Main page. (2004). https://www.mediawiki.org/wiki/API:Main_page",
      "doi": ""
    }
  ]
}