{
  "doi": "10.1145/2858036.2858463",
  "title": "\"Don't Whip Me With Your Games\": Investigating \"Bottom-Up\" Gamification",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "2026-2037",
  "year": 2016,
  "badges": [],
  "abstract": "In this paper we investigate \"bottom-up\" gamification, i.e. providing users with the option to gamify an experience on their own. To this end, we review commonly used gamification elements in terms of their suitability for such an approach and present the results of an online questionnaire (N=75) complemented by semi-structured interviews with employees of a manufacturing company (N=8). In a twelve-day-long study (N=20) we investigated the usefulness of a task managing app implementing a \"bottom-up\" gamification concept. With these studies, we derived requirements \"bottom-up\" applications should fulfill. The study results reveal that people want to use such an approach and are open to the creation of their own gamified experience, thus suggesting that \"bottom-up\" can be an alternative to \"top-down\" gamification often used today.",
  "tags": [
    "bottom-up",
    "task management",
    "customization",
    "user-centered design",
    "gamification"
  ],
  "authors": [
    {
      "name": "Pascal Lessel",
      "institution": "DFKI GmbH, Saarbrücken, Germany",
      "img": "/do/10.1145/contrib-81549258456/rel-imgonly/pics.jpg",
      "acmid": "81549258456",
      "orcid": "missing"
    },
    {
      "name": "Maximilian Altmeyer",
      "institution": "DFKI GmbH & Saarland University, Saarbrücken, Germany",
      "img": "/do/10.1145/contrib-87959418257/rel-imgonly/max.jpg",
      "acmid": "87959418257",
      "orcid": "0000-0003-0279-5276"
    },
    {
      "name": "Marc Müller",
      "institution": "DFKI GmbH & Saarland University, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658702066",
      "orcid": "missing"
    },
    {
      "name": "Christian Wolff",
      "institution": "DFKI GmbH & Saarland University, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659531953",
      "orcid": "missing"
    },
    {
      "name": "Antonio Krüger",
      "institution": "DFKI GmbH & Saarland University, Saarbrücken, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548004671",
      "orcid": "0000-0002-8055-8367"
    }
  ],
  "references": [
    {
      "text": "Ernest Adams. 2004. The Designer's Notebook: The Perils of Bottom-Up Game Design. Internet. (18 October 2004). Retrieved January 08, 2016 from http://www.gamasutra.com/view/feature/130563/the_ designers_notebook_the_.php.",
      "doi": ""
    },
    {
      "text": "Frederick E. Allen. 2011. Disneyland Uses 'Electronic Whip' on Employees. Internet. (21 October 2011). Retrieved January 08, 2016 from http://www.forbes.com/sites/frederickallen/2011/10/21/disneyland-uses-electronic-whip-on-employees/.",
      "doi": ""
    },
    {
      "text": "Ashton Anderson, Daniel Huttenlocher, Jon Kleinberg, and Jure Leskovec. 2013. Steering User Behavior with Badges. In Proc. WWW 2013. International World Wide Web Conferences Steering Committee, Republic and Canton of Geneva, Switzerland, 95--106. http://dl.acm.org/citation.cfm?id=2488388.2488398  ",
      "doi": "10.1145/2488388.2488398"
    },
    {
      "text": "Aaron Bangor, Philip Kortum, and James Miller. 2009. Determining What Individual SUS Scores Mean: Adding an Adjective Rating Scale. Journal of Usability Studies 4, 3 (May 2009), 114--123. http://dl.acm.org/citation.cfm?id=2835587.2835589 ",
      "doi": "10.5555/2835587.2835589"
    },
    {
      "text": "Victoria Bellotti, Brinda Dalal, Nathaniel Good, Peter Flynn, Daniel G. Bobrow, and Nicolas Ducheneaut. 2004. What a To-Do: Studies of Task Management Towards the Design of a Personal Task List Manager. In Proc. CHI 2004. ACM, NY, NY, USA, 735--742. DOI: http://dx.doi.org/10.1145/985692.985785  ",
      "doi": "10.1145/985692.985785"
    },
    {
      "text": "Roland Bénabou and Jean Tirole. 2003. Intrinsic and Extrinsic Motivation. The Review of Economic Studies 70, 3 (2003), 489--520. DOI: http://dx.doi.org/10.1111/1467--937X.00253",
      "doi": ""
    },
    {
      "text": "Ian Bogost. 2011. Persuasive Games: Exploitationware. Internet. (3 May 2011). Retrieved January 08, 2016 from http://www.gamasutra.com/view/feature/6366/persuasive_games_exploitationware.php.",
      "doi": ""
    },
    {
      "text": "John Brooke. 1996. SUS: A Quick and Dirty Usability Scale. In Usability Evaluation in Industry, P. W. Jordan, B. Weerdmeester, A. Thomas, and I. L. McClelland (Eds.). Taylor and Francis, London, 189--194.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding. 2014. Eudaimonic Design, or: Six Invitations to Rethink Gamification. In Rethinking Gamification, Sonia Fizek, Mathias Fuchs, Paolo Ruffino, and Niklas Schrape (Eds.). meson press, 305--323. http://ssrn.com/abstract=2466374",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From Game Design Elements to Gamefulness: Defining \"Gamification\". In Proc. MindTrek 2011. ACM, NY, NY, USA, 9--15. DOI: http://dx.doi.org/10.1145/2181037.2181040  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Carsten Eickhoff, Christopher G. Harris, Arjen P. de Vries, and Padmini Srinivasan. 2012. Quality Through Flow and Immersion: Gamifying Crowdsourced Relevance Assessments. In Proc. SIGIR 2012. ACM, NY, NY, USA, 871--880. DOI: http://dx.doi.org/10.1145/2348283.2348400  ",
      "doi": "10.1145/2348283.2348400"
    },
    {
      "text": "Peter Farago. 2011. Mobile Social Gamers: The New Mass-Market Powerhouse. Internet. (22 February 2011). Retrieved January 08, 2016 from http://flurrymobile.tumblr.com/post/113365197530/mobile-social-gamers-the-new-mass-market.",
      "doi": ""
    },
    {
      "text": "Lauren S. Ferro, Steffen P. Walz, and Stefan Greuter. 2013. Towards Personalised, Gamified Systems: An Investigation into Game Design, Personality and Player Typologies. In Proc. IE 2013. ACM, NY, NY, USA, 7:1--7:6. DOI: http://dx.doi.org/10.1145/2513002.2513024  ",
      "doi": "10.1145/2513002.2513024"
    },
    {
      "text": "Peter Gray. 2009. Play Makes Us Human I: A Ludic Theory of Human Nature. Internet. (4 June 2009). Retrieved January 08, 2016 from https://www.psychologytoday.com/blog/freedom-learn/200906/play-makes-us-human-i-ludic-theory-human-nature.",
      "doi": ""
    },
    {
      "text": "Shivashankar Halan, Brent Rossen, Juan Cendan, and Benjamin Lok. 2010. High Score! - Motivation Strategies for User Participation in Virtual Human Development. In Intelligent Virtual Agents, Jan Allbeck, Norman Badler, Timothy Bickmore, Catherine Pelachaud, and Alla Safonova (Eds.). Lecture Notes in Computer Science, Vol. 6356. Springer Berlin Heidelberg, 482--488. DOI: http://dx.doi.org/10.1007/978--3--642--15892--6_52 ",
      "doi": "10.5555/1889075.1889134"
    },
    {
      "text": "Juho Hamari and Jonna Koivisto. 2013. Social Motivations to Use Gamification: An Empirical Study of Gamifying Exercise. In ECIS Completed Research. Paper 105. http://aisel.aisnet.org/ecis2013_cr/105",
      "doi": ""
    },
    {
      "text": "Juho Hamari, Jonna Koivisto, and Harri Sarsa. 2014. Does Gamification Work? -- A Literature Review of Empirical Studies on Gamification. In Proc. HICSS 2014. IEEE Computer Society, Washington, DC, USA, 3025--3034. DOI: http://dx.doi.org/10.1109/HICSS.2014.377  ",
      "doi": "10.1109/HICSS.2014.377"
    },
    {
      "text": "Carrie Heeter, Yu-Hao Lee, Ben Medler, and Brian Magerko. 2011a. Beyond Player Types: Gaming Achievement Goal. In Proc. Sandbox 2011. ACM, NY, NY, USA, 43--48. DOI: http://dx.doi.org/10.1145/2018556.2018565  ",
      "doi": "10.1145/2018556.2018565"
    },
    {
      "text": "Carrie Heeter, Brian Magerko, Ben Medler, and Yu-Hao Lee. 2011b. Impacts of Forced Serious Game Play on Vulnerable Subgroups. International Journal of Gaming and Computer-Mediated Simulations 3, 3 (July 2011), 34--53. DOI: http://dx.doi.org/10.4018/jgcms.2011070103  ",
      "doi": "10.4018/jgcms.2011070103"
    },
    {
      "text": "Chin-Lung Hsu and Hsi-Peng Lu. 2004. Why Do People Play On-line Games? An Extended TAM with Social Influences and Flow Experience. Information and Management 41, 7 (Sept. 2004), 853--868. DOI: http://dx.doi.org/10.1016/j.im.2003.08.014  ",
      "doi": "10.1016/j.im.2003.08.014"
    },
    {
      "text": "Atreyi Kankanhalli, Mahdieh Taher, Huseyin Cavusoglu, and Seung Hyun Kim. 2012. Gamification: A New Paradigm for Online User Engagement. In Proc. ICIS 2012. http://aisel.aisnet.org/icis2012/proceedings/ResearchInProgress/7",
      "doi": ""
    },
    {
      "text": "Dennis L. Kappen, Jens Johannsmeier, and Lennart E. Nacke. 2013. Deconstructing 'Gamified' Task-Management Applications. In Proc. of Gamification 2013. ACM, NY, NY, USA, 139--142. DOI: http://dx.doi.org/10.1145/2583008.2583034  ",
      "doi": "10.1145/2583008.2583034"
    },
    {
      "text": "Lawrence Kitson. 2011. User-Led Does Not Equal User-Centered. Internet. (17 March 2011). Retrieved January 08, 2016 from https://uxmag.com/articles/ user-led-does-not-equal-user-centered.",
      "doi": ""
    },
    {
      "text": "Jonna Koivisto and Juho Hamari. 2014. Demographic Differences in Perceived Benefits from Gamification. Computers in Human Behavior 35 (2014), 179--188. DOI: http://dx.doi.org/10.1016/j.chb.2014.03.007",
      "doi": ""
    },
    {
      "text": "Oliver Korn. 2012. Industrial Playgrounds: How Gamification Helps to Enrich Work for Elderly or Impaired Persons in Production. In Proc. EICS 2012. ACM, NY, NY, USA, 313--316. DOI: http://dx.doi.org/10.1145/2305484.2305539  ",
      "doi": "10.1145/2305484.2305539"
    },
    {
      "text": "Oliver Korn, Markus Funk, Stephan Abele, Thomas Hörz, and Albrecht Schmidt. 2014. Context-Aware Assistive Systems at the Workplace: Analyzing the Effects of Projection and Gamification. In Proc. PETRA 2014. ACM, NY, NY, USA, 38:1--38:8. DOI: http://dx.doi.org/10.1145/2674396.2674406  ",
      "doi": "10.1145/2674396.2674406"
    },
    {
      "text": "Pascal Lessel, Maximilian Altmeyer, and Antonio Krüger. 2015a. Analysis of Recycling Capabilities of Individuals and Crowds to Encourage and Educate People to Separate Their Garbage Playfully. In Proc. CHI 2015. ACM, NY, NY, USA, 1095--1104. DOI: http://dx.doi.org/10.1145/2702123.2702309  ",
      "doi": "10.1145/2702123.2702309"
    },
    {
      "text": "Pascal Lessel, Marc Müller, and Antonio Krüger. 2015b. Towards a Novel Issue Tracking System for \"Industry 4.0\" Environments. In Ext. Abstracts CHI 2015. ACM, NY, NY, USA, 1809--1814. DOI: http://dx.doi.org/10.1145/2702613.2732720  ",
      "doi": "10.1145/2702613.2732720"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A Stage-based Model of Personal Informatics Systems. In Proc. CHI 2010. ACM, NY, NY, USA, 557--566. DOI: http://dx.doi.org/10.1145/1753326.1753409  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Andreas Lieberoth. 2015. Shallow Gamification: Testing Psychological Effects of Framing an Activity as a Game. Games and Culture 10, 3 (2015), 229--248. DOI: http://dx.doi.org/10.1177/1555412014559978",
      "doi": ""
    },
    {
      "text": "Elisa D. Mekler, Florian Brühlmann, Alexandre N. Tuch, and Klaus Opwis. 2015. Towards Understanding the Effects of Individual Gamification Elements on Intrinsic Motivation and Performance. Computers in Human Behavior (2015), 1--10. DOI: http://dx.doi.org/10.1016/j.chb.2015.08.048",
      "doi": ""
    },
    {
      "text": "Ethan R. Mollick and Nancy Rothbard. 2013. Mandatory Fun: Gamification and the Impact of Games at Work. The Wharton School Research Paper Series (2013). DOI: http://dx.doi.org/10.2139/ssrn.2277103",
      "doi": ""
    },
    {
      "text": "Baptiste Monterrat, Michel Desmarais, Élise Lavoué, and Sébastien George. 2015. A Player Model for Adaptive Gamification in Learning Environments. In Artificial Intelligence in Education, Cristina Conati, Neil Heffernan, Antonija Mitrovic, and M. Felisa Verdejo (Eds.). Lecture Notes in Computer Science, Vol. 9112. Springer International Publishing, 297--306. DOI: http://dx.doi.org/10.1007/978--3--319--19773--9_30",
      "doi": ""
    },
    {
      "text": "Scott Nicholson. 2012. A User-Centered Theoretical Framework for Meaningful Gamification. Games+ Learning+ Society 8, 1 (2012).",
      "doi": ""
    },
    {
      "text": "Rita Orji, Julita Vassileva, and Regan L. Mandryk. 2014. Modeling the Efficacy of Persuasive Strategies for Different Gamer Types in Serious Games for Health. User Modeling and User-Adapted Interaction 24, 5 (2014), 453--498. DOI: http://dx.doi.org/10.1007/s11257-014--9149--8  ",
      "doi": "10.1007/s11257-014-9149-8"
    },
    {
      "text": "Chad Richards, Craig W. Thompson, and Nicholas Graham. 2014. Beyond Designing for Motivation: The Importance of Context in Gamification. In Proc. CHI PLAY 2014. ACM, NY, NY, USA, 217--226. DOI: http://dx.doi.org/10.1145/2658537.2658683  ",
      "doi": "10.1145/2658537.2658683"
    },
    {
      "text": "Donald Roy. 1959. \"Banana Time\": Job Satisfaction and Informal Interaction. Human Organization 18, 4 (1959), 158--168. DOI: http://dx.doi.org/10.17730/humo.18.4.07j88hr1p4074605",
      "doi": ""
    },
    {
      "text": "Katie Seaborn and Deborah I. Fels. 2015. Gamification in Theory and Action: A Survey. International Journal of Human-Computer Studies 74 (2015), 14--31. DOI: http://dx.doi.org/10.1016/j.ijhcs.2014.09.006",
      "doi": "10.1016/j.ijhcs.2014.09.006"
    },
    {
      "text": "Erika Noll Webb. 2013. Gamification: When It Works, When It Doesn't. In Design, User Experience, and Usability. Health, Learning, Playing, Cultural, and Cross-Cultural User Experience, Aaron Marcus (Ed.). Lecture Notes in Computer Science, Vol. 8013. Springer Berlin Heidelberg, 608--614. DOI: http://dx.doi.org/10.1007/978--3--642--39241--2_67  ",
      "doi": "10.1007/978-3-642-39241-2_67"
    },
    {
      "text": "Kevin Werbach. 2014. (Re)Defining Gamification: A Process Approach. In Persuasive Technology, Anna Spagnolli, Luca Chittaro, and Luciano Gamberini (Eds.). Lecture Notes in Computer Science, Vol. 8462. Springer International Publishing, 266--272. DOI: http://dx.doi.org/10.1007/978--3--319-07127--5_23",
      "doi": ""
    },
    {
      "text": "Nick Wingfield. 2012. All the World's a Game, and Business Is a Player. Internet. (23 December 2012). Retrieved January 08, 2016 from http://www.nytimes.com/2012/12/24/technology/all-the-worlds-a-game-and-business-is-a-player.html.",
      "doi": ""
    },
    {
      "text": "Oren Zuckerman and Ayelet Gal-Oz. 2014. Deconstructing Gamification: Evaluating the Effectiveness of Continuous Measurement, Virtual Rewards, and Social Comparison for Promoting Physical Activity. Personal Ubiquitous Computing 18, 7 (Oct. 2014), 1705--1719. DOI: http://dx.doi.org/10.1007/s00779-014-0783--2  ",
      "doi": "10.1007/s00779-014-0783-2"
    }
  ]
}