{
  "doi": "10.1145/2858036.2858076",
  "title": "LondonTube: Overcoming Hidden Dependencies in Cloud-Mobile-Web Programming",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "3498-3508",
  "year": 2016,
  "badges": [],
  "abstract": "Many disciplines, including health science, increasingly demand custom applications that synthesize cloud, mobile and web functionality. But creating even simple apps is difficult. Why? In this paper, guided by Cognitive Dimensions, we explore the design space for relevant programming notations and supporting tools, and we pinpoint what we hypothesize to be specific obstacles in the creation of cloud-mobile-web apps. Among these is the prevalence of hidden dependencies within code of apps. Based on this analysis, we propose a new notation called LondonTube aimed at making these hidden dependencies visible, thereby helping health scientists to create apps for themselves. A study showed that LondonTube reduced the time to create a cloud-mobile-web app by a factor of over 20, and it reduced questions about hidden dependencies.",
  "authors": [
    {
      "name": "Christopher Scaffidi",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100575732",
      "orcid": "missing"
    },
    {
      "name": "Andrew Dove",
      "institution": "National Instruments, Austin, TX, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81502743913",
      "orcid": "missing"
    },
    {
      "name": "Tahmid Nabi",
      "institution": "Oregon State University, Corvallis, OR, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658980712",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Abadi, A., Dubinsky, Y., Kirshin, A., Mesika, Y., BenHarrush, I., and Hadad, U. 2013. NitroGen: Rapid development of mobile applications. ACM Conference on Systems, Programming, and Applications: Software for Humanity SPLASH., Companion Publication, 1516.  ",
      "doi": "10.1145/2508075.2514571"
    },
    {
      "text": "Agha, G. 1986. Actors: A Model of Concurrent Computation in Distributed Systems, MIT Press. ",
      "doi": "10.5555/7929"
    },
    {
      "text": "Angelino, E., Yamins, D., and Seltzer, M. 2010. StarFlow: A script-centric data analysis environment. Provenance and Annotation of Data and Processes, 236--250.",
      "doi": ""
    },
    {
      "text": "Burnham, T. 2011. CoffeeScript: Accelerated JavaScript Development, Pragmatic Bookshelf.",
      "doi": ""
    },
    {
      "text": "Ceri, S., Daniel, F., Matera, M., and Facca, F. 2007. Model-driven development of context-aware web applications. ACM Transactions on Internet Technology, 71., Article 2.  ",
      "doi": "10.1145/1189740.1189742"
    },
    {
      "text": "Doglio, F. 2015. Pro REST API Development with Node.js, Apress. ",
      "doi": "10.5555/2802116"
    },
    {
      "text": "Falda, G., Habela, P., Kaczmarski, K., Stencel, K., and Subieta, K. 2008. Executable platform independent models for data intensive applications. International Conference on Computational Science, 301--310.  ",
      "doi": "10.1007/978-3-540-69389-5_35"
    },
    {
      "text": "Gafni, E., Luquette, L., Lancaster, A., Hawkins, J., Jung, J., Souilmi, Y., Wall, D., and Tonellato, P. 2014. COSMOS: Python library for massively parallel workflows. Bioinformatics, 3020., 2956--2958.",
      "doi": ""
    },
    {
      "text": "Garcia-Cerezo, A., et al 2009. Using LEGO robots with LabVIEW for a summer school on mechatronics. IEEE International Conference on Mechatronics, 1--6.",
      "doi": ""
    },
    {
      "text": "Green, T., and Petre, M. 1996. Usability analysis of visual programming environments: A 'cognitive dimensions' framework. Journal of Visual Languages & Computing, 72., 131--174.",
      "doi": ""
    },
    {
      "text": "Hartmann, B., Abdulla, L., Mittal, M., and Scott, K. 2007. Authoring sensor-based interactions by demonstration with direct manipulation and pattern recognition. ACM SIGCHI Conference on Human Factors in Computing Systems, 145--154.  ",
      "doi": "10.1145/1240624.1240646"
    },
    {
      "text": "Kodosky, J., MacCrisken, J., and Rymar, G. 1991. Visual programming using structured data flow. IEEE Workshop on Visual Languages, 34--39.",
      "doi": ""
    },
    {
      "text": "Koo, H. 2005. A meta-language for systems architecting. PhD thesis, Engineering Systems Division, Massachusetts Institute of Technology. ",
      "doi": "10.5555/1087871"
    },
    {
      "text": "Krebs, D., Conrad, A., Hauskrecht, M., and Wang, J. 2011. MARBLS: A visual environment for building clinical alert rules. ACM Symposium on User Interface Software and Technology UIST., Companion Abstracts, 67--68.  ",
      "doi": "10.1145/2046396.2046426"
    },
    {
      "text": "Lathia, N., Rachuri, K., Mascolo, C., and Roussos, G. 2013. Open source smartphone libraries for computational social science. ACM Conference on Pervasive and Ubiquitous Computing, 911--920.  ",
      "doi": "10.1145/2494091.2497345"
    },
    {
      "text": "Lin, J. 1999. A visual language for a sketch-based UI prototyping tool. ACM SIGCHI Conference on Human Factors in Computing Systems, Extended Abstracts, 298--299.  ",
      "doi": "10.1145/632716.632899"
    },
    {
      "text": "Lin, J., Thomsen, M., and Landay, J. 2002. A visual language for sketching large and complex interactive designs. ACM SIGCHI Conference on Human Factors in Computing Systems, 307--314.  ",
      "doi": "10.1145/503376.503431"
    },
    {
      "text": "Linderman, M., Collins, J., Wang, H., and Meng, T. 2008. Merge: A programming model for heterogeneous multi-core systems. ACM SIGOPS Operating Systems Review, 287--296.  ",
      "doi": "10.1145/1353535.1346318"
    },
    {
      "text": "mEMA home, http://mobileema.com/",
      "doi": ""
    },
    {
      "text": "movisensXS home, https://xs.movisens.com/",
      "doi": ""
    },
    {
      "text": "Myers, B., Hudson, S., and Pausch, R. 2000. Past, present, and future of user interface software tools. ACM Transactions on Computer-Human Interaction. 71., 3--28.  ",
      "doi": "10.1145/344949.344959"
    },
    {
      "text": "Node.js runtime system, https://nodejs.org/en/",
      "doi": ""
    },
    {
      "text": "Nguyen, T., and Vanderdonckt, J. 2012. User interface master detail pattern on android. ACM SIGCHI Symposium on Engineering Interactive Computing Systems EICS., 299--304.  ",
      "doi": "10.1145/2305484.2305535"
    },
    {
      "text": "Pruett, M. 2007. Yahoo! Pipes, O'Reilly. ",
      "doi": "10.5555/1407887"
    },
    {
      "text": "Python home, https://www.python.org/",
      "doi": ""
    },
    {
      "text": "Ruby on Rails home, http://rubyonrails.org/",
      "doi": ""
    },
    {
      "text": "Sherry, R., and Lord, S. 1997. LabVIEW as an effective enhancement to an optoelectronics laboratory experiment. Frontiers in Education Conference, 897900.",
      "doi": ""
    },
    {
      "text": "Simpson, K. 2015. You Don't Know JS: Async & Performance, O'Reilly. ",
      "doi": "10.5555/2904420"
    },
    {
      "text": "Swift home, https://developer.apple.com/swift/",
      "doi": ""
    },
    {
      "text": "Tillmann, N., Moskal, M., de Halleux, J., and Fahndrich, M. 2011. TouchDevelop: Programming cloud-connected mobile devices via touchscreen. Proceedings of the 10th SIGPLAN Symposium on New Ideas, New Paradigms, and Reflections on Programming and Software, 49--60.  ",
      "doi": "10.1145/2048237.2048245"
    },
    {
      "text": "Travis, J., and Kring, J. 2006. LabVIEW for Everyone: Graphical Programming Made Easy and Fun, Prentice Hall. ",
      "doi": "10.5555/1207034"
    },
    {
      "text": "Van Kleek, M., Smith, D., Packer, H., Skinner, J., and Shadbolt, N. 2013. Carpe data: Supporting serendipitous data integration in personal information management. ACM SIGCHI Conference on Human Factors in Computing Systems, 2339--2348.  ",
      "doi": "10.1145/2470654.2481324"
    },
    {
      "text": "Wolber, D., Abelson, H., Spertus, E., and Looney, L. 2011. App Inventor: Create Your Own Android Apps, O'Reilly.",
      "doi": ""
    }
  ]
}