{
  "doi": "10.1145/2858036.2858351",
  "title": "Effects of Pedagogical Agent's Personality and Emotional Feedback Strategy on Chinese Students' Learning Experiences and Performance: A Study Based on Virtual Tai Chi Training Studio",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "433-444",
  "year": 2016,
  "badges": [],
  "abstract": "In virtual learning environment, both personality and emotional features of animated pedagogical agents (APAs) may influence learning. To investigate this question, we developed four APAs with two distinct personality types and two sets of gestures expressing distinct emotional feedback. Effects of APAs' personality types and emotional feedback strategies on learning experiences and performance were assessed experimentally using a virtual Tai Chi training system. Fifty six participants completed the experiment. Results showed that positive emotional feedback strategy led to better learning experiences and performance than negative feedback strategy. Moreover, personality type had significant effect on learning. Choleric APAs led to better performance than Phlegmatic APAs. Personality types moderated the effect of emotional feedback on learning satisfaction. Our study demonstrates that APAs with distinct personality types and emotional feedback are important design parameters for virtual learning environments.",
  "authors": [
    {
      "name": "Yulong Bian",
      "institution": "Shandong University & Shandong Normal University, Jinan, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659007132",
      "orcid": "missing"
    },
    {
      "name": "Chenglei Yang",
      "institution": "Shandong University, Jinan, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100356283",
      "orcid": "missing"
    },
    {
      "name": "Dongdong Guan",
      "institution": "Shandong University, Jinan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658660947",
      "orcid": "missing"
    },
    {
      "name": "Sa Xiao",
      "institution": "Shandong University, Jinan, Shandong, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021159",
      "orcid": "missing"
    },
    {
      "name": "Fengqiang Gao",
      "institution": "Shandong Normal University, Jinan, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659006872",
      "orcid": "missing"
    },
    {
      "name": "Chia Shen",
      "institution": "Harvard University, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100343583/rel-imgonly/chiaportraitoriginal.jpg",
      "acmid": "81100343583",
      "orcid": "missing"
    },
    {
      "name": "Xiangxu Meng",
      "institution": "Shandong University, Jinan, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81322501374",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Albright, L., Kenny, D. A., and Malloy, T. E. Consensus in Personality Judgments at Zero Acquaintance. Journal of Personality and Social Psychology 55, (1988), 387--395.",
      "doi": ""
    },
    {
      "text": "Allbeck, J., and Badler, N. Toward Representing Agent Behaviors Modified by Personality and Emotion. Embodied Conversational Agents at AAMAS2, (2002), 15--19.",
      "doi": ""
    },
    {
      "text": "Arellano, B. D., Varona, J., and Perales, F. J. Generation and Visualization of Emotional States in Virtual Characters. Comp. Anim. Virtual Worlds 19, (July, 2008), 259--270. ",
      "doi": "10.5555/1410368.1410372"
    },
    {
      "text": "Atkinson, R. K., Mayer, R. E., and Merrill, M. M. Fostering Social Agency in Multimedia Learning: Examining the Impact of an Animated Agent's Voice. Contemporary Educational Psychology 30, 1(2005), 117--139.",
      "doi": ""
    },
    {
      "text": "Balomenos, T., Raouzaiou, A., Ioannou, S., Drosopoulos, A., Karpouzis, K., and Kollias. S. Emotion Analysis in Man-Machine Interaction Systems,\" Proc. Workshop Machine Learning for Multimodal Interaction, (2004), 318--328.  ",
      "doi": "10.1007/978-3-540-30568-2_27"
    },
    {
      "text": "Baylor, A. L., and Kim, Y. Simulating Instructional Roles through Pedagogical Agents. International Journal of Artificial Intelligence in Education 15, (2005), 95--115. ",
      "doi": "10.5555/1434925.1434927"
    },
    {
      "text": "Beale, R., and Creed, C. Affective Interaction: How Emotional Agents Affect Users. International Journal of Human Computer Studies 67, (2009), 755--776.  ",
      "doi": "10.1016/j.ijhcs.2009.05.001"
    },
    {
      "text": "Borkenau, P., and Liebler, A. Trait Inferences: Sources of Validity at Zero-acquaintance. Journal of Personality and Social Psychology 62, (1992), 645657.",
      "doi": ""
    },
    {
      "text": "Borkenau, P., Mauer, N., Riemann, R., Spinath, F. M., and Angleitner, A. Thin Slices of Behavior as Cues of Personality and Intelligence. Journal of Personality and Social Psychology 86, 4 (2004), 599--614.",
      "doi": ""
    },
    {
      "text": "Burleson, W., and Picard, R. Gender-specific Approaches to Developing Emotionally Intelligent Learning Companions. Intelligent Systems 22, 4 (2007), 62--69.  ",
      "doi": "10.1109/MIS.2007.69"
    },
    {
      "text": "Chee, B. T. T., Taezoon, P., Xu, Q., Ng, J., and Tan, O. Personality of Social Robots Perceived through the Appearance. Work 41, 1 (2012), 272--276.",
      "doi": ""
    },
    {
      "text": "Csikszentmihalyi, M. Flow: The psychology of optimal experience. NY: Harper and Row, 1990.",
      "doi": ""
    },
    {
      "text": "Dekker T. W. G. Personality in Embodied Conversational Agents?: Effects on User Experience, In Proc. of 17th Twente Student Conference on IT (2012).",
      "doi": ""
    },
    {
      "text": "Devine, P. G. Stereotypes and Prejudice: Their Automatic and Controlled Components. Journal of Personality and Social Psychology 56, 2 (1989), 5--18.",
      "doi": ""
    },
    {
      "text": "D'Mello, S., Jackson, T., Craig, S., Morgan, B., Chipman, P., White, H., et al. Auto Tutor Detects and Responds to Learners Affective and Cognitive States. In Proc. of International conference on intelligent tutoring systems (2008).",
      "doi": ""
    },
    {
      "text": "Dunsworth, Q. and Atkinson, R. K. Fostering Multimedia Learning of Science: Exploring the Role of an Animated Agent's Image. Computers and Education 49, 3 (2007), 677--690.  ",
      "doi": "10.1016/j.compedu.2005.11.010"
    },
    {
      "text": "Engeser, S. Advances in Flow Research. S. Engeser, Ed. 2012.",
      "doi": ""
    },
    {
      "text": "Epleya, N. A and Krugerb, J. When What you Type isn't What They Read: The Perseverance of Stereotypes and Expectancies over E-mail. Journal of Experimental Social Psychology 41, 4 (2005), 414--422.",
      "doi": ""
    },
    {
      "text": "Eysenck, H. J. and Eysenck, M. W. Personality and Individual Differences, NY: plenum, 1985.",
      "doi": ""
    },
    {
      "text": "Farabee, D., Nelson, R., and Spence, R. Psychosocial Profiles of Criminal Justice- and Non-Criminal Justice Referred Clients in Treatment. Criminal Justice and Behaviour 20, (1993), 336--346.",
      "doi": ""
    },
    {
      "text": "Fink, B., Neave N., Manning, J. T., and Grammer, K. Facial Symmetry and the 'big-five' Personality Factors. Pers. Individ. Dif. 39, 3(Aug. 2005), 523--529.",
      "doi": ""
    },
    {
      "text": "Forgas J.P., ed, Feeling and Thinking: The Role of Affect in Social Cognition. Cambridge University Press, Cambridge, UK, 2000.",
      "doi": ""
    },
    {
      "text": "Freedman, N. Hands, Words and Mind: On the Structuralization of Body Movements during Discourse and the Capacity for Verbal Representation. Communicative Structures and Psychic Structures: A Psychoanalytic Interpretation of Communication 1, (1977), 109--132.",
      "doi": ""
    },
    {
      "text": "Gelder, B. D. Towards the Neurobiology of Emotional Body Language. Nature Reiview Neuroscience 7, 3 (2006), 242- 249.",
      "doi": ""
    },
    {
      "text": "Glowinski, D., Dael, N., Camurri, a., Volpe, G., Mortillaro, M., and Scherer, K. Toward a Minimal Representation of Affective Gestures. IEEE Transactions on Affective Computing2, 2 (2011), 106--118.  ",
      "doi": "10.1109/T-AFFC.2011.7"
    },
    {
      "text": "Howarth, E., and Zumbo, B. D. An Empirical Investigation of Eysenck's typology. Journal of Research in Personality 23, 3 (1989), 343--353.",
      "doi": ""
    },
    {
      "text": "Isbister, K., and Nass, C. Consistency of Personality in Interactive Characters: Verbal Cues, Non-verbal cues, and User Characteristics. International Journal of Human Computer Studies 53, 2 (2000), 251--267.  ",
      "doi": "10.1006/ijhc.2000.0368"
    },
    {
      "text": "Kenny, D. A., Horner, C., Kashy, D. A., and Chu, L. Consensus at Zero-acquaintance: Replication, Behavioral Cues, and Stability. Journal of Personality and Social Psychology 62, (1992), 88--97.",
      "doi": ""
    },
    {
      "text": "Kim, C. The Role of Affective and Motivational Factors in Designing Personalized Learning Environments. Educational Technology Research and Development, 60, 4 (2012), 563--584.",
      "doi": ""
    },
    {
      "text": "Kim, Y., Baylor, A. L. and Shen, E. Pedagogical Agents as Learning Companions: The Impact of Agent Emotion and Gender. J. Comput. Assist. Learn 23, 3 (2007), 220--234.",
      "doi": ""
    },
    {
      "text": "Kim, Y., and Baylor, A. L. A Social-cognitive Framework for Pedagogical Agents as Learning Companions. Educational Technology Research and Development 5, 4(2006), 569--590.",
      "doi": ""
    },
    {
      "text": "Kim, Y., and Wei, Q. The Impact of Learner Attributes and Learner Choice in an Agent-based Environment. Computers and Education56, 2 (2011), 505--514.  ",
      "doi": "10.1016/j.compedu.2010.09.016"
    },
    {
      "text": "La France, B., Heisel, A. and Beatty, M. Is There Empirical Evidence for a Nonverbal Profile of Extraversion? A Meta Analysis and Critique of the Literature. Comm. Monographs 71, (2004), 28--48.",
      "doi": ""
    },
    {
      "text": "Lee, K.M., et al. Can Robots Manifest Personality?: An Empirical Test of Personality Recognition, Social Responses, and Social Presence in Human-Robot Interaction. Journal of Communication 56, (2006), 754--772.",
      "doi": ""
    },
    {
      "text": "Lin, L., Atkinson, R. K., Christopherson, R. M., Joseph, S. S., and Harrison, C. J. Animated Agents and Learning: Does the Type of Verbal Feedback They Provide Matter? Computers and Education 67, (2013), 239--249.",
      "doi": "10.5555/2753875.2753970"
    },
    {
      "text": "Meijer, M. The Contribution of General Features of Body Movement to the Attribution of Emotions. Journal of Nonverbal Behavior 13, 4 (1989), 247--268.",
      "doi": ""
    },
    {
      "text": "McRorie, M., Sneddon, I., McKeown, G., Bevacqua, E., de Sevin, E., and Pelachaud, C. Evaluation of Four Designed Virtual Agent Personalities. IEEE Transactions on Affective Computing 3, 3 (2012), 311--322.  ",
      "doi": "10.1109/T-AFFC.2011.38"
    },
    {
      "text": "Nass, C. and Lee, K.M. Does computer-generated Speech Manifest Personality? Experimental Test of Recognition, Similarity-attraction, and Consistence attraction. Journal of Exeprimental Psychology: Applied 7, (2001), 171--181.",
      "doi": ""
    },
    {
      "text": "Naumann, L. P., Vazire, S., Rentfrow, P. J., and Gosling, S. D. Personality Judgments based on Physical Appearance. Personality and Social Psychology Bulletin 35, 12 (2009), 1661--1671.",
      "doi": ""
    },
    {
      "text": "Paunonen, S. V, Lefave, S., and Goldberg, H. (n.d.). Facial Features as Personality Cues, Journal of Personality 67, 3 (June 1999), 555--583.",
      "doi": ""
    },
    {
      "text": "Qian, M. Y., Wu, G. C., Zhu, R. C., and Zhang, S. Development of the Revised Eysenck Personality Questionaire Short Scale for Chinese (EPQ-RSC). Acta Psychologica Sinica 32, 3(2000), 317--323.",
      "doi": ""
    },
    {
      "text": "Rázuri, J. G., Larsson, A., Rahmani, R., Sundgren, D., Bonet, I., and Moran, A. Recognition of Emotions by the Emotional Feedback through Behavioral Human Poses. International Journal of Computer Science Issues 12, 1 (2015), 7--17.",
      "doi": ""
    },
    {
      "text": "Read, S. J., and Miller, L. C. Virtual Personalities: A Neural Network Model of Personality. Personality and Social Psychology Review 6, 4 (2002), 357--369.",
      "doi": ""
    },
    {
      "text": "Reeves, B., and Nass, C. I. The Media Equation: How People Treat Computers, Television, and New Media Like Real People and Places. Computers and mathematics with applications 33, 5 (1997), 128.",
      "doi": ""
    },
    {
      "text": "Robison, J., McQuiggan, S., and Lester, J. Developing Empirically Based Student Personality Profiles for Affective Feedback Models. In Proceedings of the tenth international conference on intelligent tutoring systems (2010).  ",
      "doi": "10.1007/978-3-642-13388-6_33"
    },
    {
      "text": "Saggino, A. The Big Three or the Big Five? A Replication Study. Personality and Individual Differences 28, 5(2000), 879--886.",
      "doi": ""
    },
    {
      "text": "Sträfling, N., Fleischer, I., Polzer, C., Leutner, D., and Krämer, N. C. Teaching Learning Strategies with a Pedagogical Agent. Journal of Media Psychology: Theories, Methods, and Applications 22, 2 (2010), 73--83.",
      "doi": ""
    },
    {
      "text": "Shi, B., Hu, Y. G., and Shi, F. A Study on the Appraisal Criteria of University Students' 24-stroke Taiji. Journal of Nanyang Teachers' College (Natural Sciences Edition) 2, 3 (2003), 3--5.",
      "doi": ""
    },
    {
      "text": "Shiffrar, M., and Pinto, J. The Visual Analysis of Bodily Motion, Common mechanisms in perception and action: Attention and Performance, in Prinz, W., Hommel, B. (eds.) Oxford, Oxford University Press (2002), 381--399.",
      "doi": ""
    },
    {
      "text": "Sweetser, P., and Wyeth, P. GameFlow: A Model for Evaluating Player Enjoyment in Games. ACM Computers in Entertainment 3, 3 (2005), 1--24.  ",
      "doi": "10.1145/1077246.1077253"
    },
    {
      "text": "Terzis, V., Moridis, C. N., and Economides, A. a. The Effect of Emotional Feedback on Behavioral Intention to Use Computer Based Assessment. Computers and Education 59, 2 (2012), 710--721.  ",
      "doi": "10.1016/j.compedu.2012.03.003"
    },
    {
      "text": "Tipples, J. Wide Eyes and an Open Mouth Enhance Facial Threat. Cognition and Emotion 21, (2007), 535557.",
      "doi": ""
    },
    {
      "text": "Trevino, L. K., and Webster, J. Flow in Computer Mediated Communication: Electronic Mail and Voice Mail Evaluation and Impacts. Communication Research 19, 5 (1992), 539--573.",
      "doi": ""
    },
    {
      "text": "Wang, N., Johnson, W. L., Mayer, R. E., Rizzo, P., Shaw, E., and Collins, H. The Politeness Effect: Pedagogical Agents and Learning Outcomes. International Journal of Human-Computer Studies 66, 2 (2008), 98--112.  ",
      "doi": "10.1016/j.ijhcs.2007.09.003"
    },
    {
      "text": "Walline, J. High Eye-Q. Science 320, 5879 (2008), 993.",
      "doi": ""
    }
  ]
}