{
  "doi": "10.1145/2858036.2858271",
  "title": "UX Heatmaps: Mapping User Experience on Visual Interfaces",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "4850-4860",
  "year": 2016,
  "badges": [],
  "abstract": "In this paper, we present an off-the-shelf UX evaluation tool which contextualizes users' physiological and behavioral signals while interacting with a system. The proposed tool triangulates users' gaze data with inferred users' cognitive and emotional states to produce user experience (UX) heatmaps, which show where users were looking when they experienced specific cognitive and emotional states. Results show that for a given cognitive state (i.e., cognitive load), the proposed UX heatmap was able to effectively highlight the areas where users experienced different levels of cognitive load on an interface. The proposed tool enables the visual analysis of users' various emotional and cognitive states for specific areas on a given interface, and also to compare users' states across multiple interfaces, which should be useful for both UX researchers and practitioners.",
  "authors": [
    {
      "name": "Vanessa Georges",
      "institution": "HEC Montreal, Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021892",
      "orcid": "missing"
    },
    {
      "name": "François Courtemanche",
      "institution": "HEC Montreal, Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350606164",
      "orcid": "missing"
    },
    {
      "name": "Sylvain Senecal",
      "institution": "HEC Montreal, Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81335497319",
      "orcid": "missing"
    },
    {
      "name": "Thierry Baccino",
      "institution": "Univ. Paris 8, St Denis, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100533666",
      "orcid": "missing"
    },
    {
      "name": "Marc Fredette",
      "institution": "HEC Montreal, Montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86159105557",
      "orcid": "missing"
    },
    {
      "name": "Pierre-Majorique Leger",
      "institution": "HEC montreal, montreal, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81344493946",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benedetto, S., Pedrotti, M., Minin, L., Baccino, T., Re, A. and Montanari, R. 2011. Driver workload and eye blink duration. Transportation Research Part F: Traffic Psychology and Behaviour 14, 3: 199--208.",
      "doi": ""
    },
    {
      "text": "Berlyne, D. Studies in the New Experimental Aesthetics. Hemisphere Publishing, Washington, DC, 1974.",
      "doi": ""
    },
    {
      "text": "Boucsein, W. Electrodermal Activity. Springer, Berlin, 2012.",
      "doi": ""
    },
    {
      "text": "Breslow, L.A., Ratwani, R.M. and Trafton, J.G. 2009. Cognitive Models of the Influence of Color Scale on Data Visualization Tasks. Human Factors: The Journal of the Human Factors and Ergonomics Society 51, 3: 321--338.",
      "doi": ""
    },
    {
      "text": "Cacioppo, J.T., Tassinary, L.T. and Berntson, G. Psychophysiological Science : Interdisciplinary Approaches to Classic Questions About the Mind. in Cacioppo, J.T., Tassinary, L.G. and Bernston, G.G. eds. Handbook of Psychophysiology, Cambride University Press, NY, 2007, 1--18.",
      "doi": ""
    },
    {
      "text": "Calvo, R.A. and D'Mello, S. 2010. Affect Detection: An Interdisciplinary Review of Models, Methods, and Their Applications. Affective Computing, IEEE Transactions on 1, 1: 18--37.  ",
      "doi": "10.1109/T-AFFC.2010.1"
    },
    {
      "text": "Cernea, D., Weber, C., Ebert, A. and Kerren, A., Emotion scents: a method of representing user emotions on gui widgets. in IS&T/SPIE Electronic Imaging, (2013), International Society for Optics and Photonics, 86540F-86540F-86514.",
      "doi": ""
    },
    {
      "text": "Courtemanche, F., Dufresne, A. and LeMoyne, É. Multiresolution Feature Extraction During Psychophysiological Inference: Addressing Signals Asynchronicity. in da Silva, H.P., Holzinger, A., Fairclough, S. and Majoe, D. eds. Physiological Computing Systems, Springer Berlin Heidelberg, 2014, 42--55.",
      "doi": ""
    },
    {
      "text": "de Guinea, A.O., Titah, R. and Léger, P.-M. 2014. Explicit and implicit antecedents of users' behavioral beliefs in information systems: A neuropsychological investigation. Journal of Management Information Systems 30, 4: 179--210.",
      "doi": ""
    },
    {
      "text": "Dufresne, A., Courtemanche, F., PromTep, S. and Sénécal, S., Physiological Measures, Eye Tracking and Task Analysis to Track User Reactions in User Generated Content. in Measuring Behavior, (Eindhoven, Netherlands, 2010), 218--222.",
      "doi": ""
    },
    {
      "text": "Ganglbauer, E., Schrammel, J., Deutsch, S. and Tscheligi, M. Applying Psychophysiological Methods for Measuring User Experience: Possibilities, Challenges and Feasibility User Experience Evaluation Methods in Product Development (UXEM'09) workshop at the 12th IFIP TC13 Conference on Human-Computer Interaction, 2009.",
      "doi": ""
    },
    {
      "text": "Haapalainen, E., Kim, S., Forlizzi, J.F. and Dey, A.K. Psycho-physiological measures for assessing cognitive load Proceedings of the 12th ACM international conference on Ubiquitous computing, ACM, Copenhagen, Denmark, 2010, 301--310.  ",
      "doi": "10.1145/1864349.1864395"
    },
    {
      "text": "Harper, S., Michailidou, E. and Stevens, R. 2009. Toward a definition of visual complexity as an implicit measure of cognitive load. ACM Transactions on Applied Perception (TAP) 6, 2: 10.  ",
      "doi": "10.1145/1498700.1498704"
    },
    {
      "text": "Hassenzahl, M., Diefenbach, S. and Göritz, A. 2010. Needs, affect, and interactive products- Facets of user experience. Interacting with computers 22, 5: 353--362.  ",
      "doi": "10.1016/j.intcom.2010.04.002"
    },
    {
      "text": "Holmqvist, K., Nystrom, M., Andersson, R., Dewhurst, R. and Jarodzka, H. Eye Tracking: A comprehensive guide to methods and measures. Oxford University Press, 2011.",
      "doi": ""
    },
    {
      "text": "Huisman, G., Hout, M.v., Dijk, E.v., Geest, T.v.d. and Heylen, D. LEMtool: measuring emotions in visual interfaces Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, Paris, France, 2013, 351--360.  ",
      "doi": "10.1145/2470654.2470706"
    },
    {
      "text": "Kaasinen, E., Roto, V., Hakulinen, J., Heimonen, T., Jokinen, J.P., Karvonen, H., Keskinen, T., Koskinen, H., Lu, Y. and Saariluoma, P. 2015. Defining user experience goals to guide the design of industrial systems. Behaviour & Information Technology, ahead-of-print: 1--16.  ",
      "doi": "10.1080/0144929X.2015.1035335"
    },
    {
      "text": "King, M.F. and Bruner, G.C. 2000. Social desirability bias: A neglected aspect of validity testing. Psychology and Marketing 17, 2: 79--103.",
      "doi": ""
    },
    {
      "text": "Kivikangas, M., Nacke, L. and Ravaja, N. 2011. Developing a triangulation system for digital game events, observational video, and psychophysiological data to study emotional responses to a virtual character. Entertainment Computing 2, 1: 11--16.",
      "doi": ""
    },
    {
      "text": "Kreibig, S.D. 2010. Autonomic nervous system activity in emotion: A review. Biological Psychology 84, 3: 394--421.",
      "doi": ""
    },
    {
      "text": "Laeng, B., Sirois, S. and Gredebäck, G. 2012. Pupillometry. Perspectives on Psychological Science 7, 1: 18--27.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. and Pernice, K. Eyetracking Web Usability. New Riders, Berkeley, California, 2012. ",
      "doi": "10.5555/1823564"
    },
    {
      "text": "Oliva, A., Mack, M.L., Shrestha, M. and Peeper, A., Identifying the perceptual dimensions of visual complexity of scenes. in 26th Annual Cognitive Science Society, (Austin, TX, 2004).",
      "doi": ""
    },
    {
      "text": "Olkin, I. and Finn, J.D. 1995. Correlations redux. Psychological Bulletin 118, 1: 155.",
      "doi": ""
    },
    {
      "text": "Pantic, M., Nijholt, A., Pentland, A. and Huanag, T.S. 2008. Human-Centred Intelligent HumanComputer Interaction (HCI2): How far are we from attaining it? International Journal of Autonomous and Adaptive Communications Systems 1, 2: 168187.  ",
      "doi": "10.1504/IJAACS.2008.019799"
    },
    {
      "text": "Rayner, K. 1998. Eye movements in reading and information processing: 20 years of research. Psychological Bulletin. 124, 3: 372--422.",
      "doi": ""
    },
    {
      "text": "Robinson, M.D. and Clore, G.L. 2002. Episodic and semantic knowledge in emotional self-report: Evidence for two judgment processes. Journal of Personality and Social Psychology 83, 1: 198--215.",
      "doi": ""
    },
    {
      "text": "Roto, V., Vermeeren, A.P.O.S., Väänänen-VainioMattila, K., Law, E. and Obrist, M., Course notes: User Experience Evaluation Methods - Which Method to Choose? in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, (Paris, France, 2013), ACM. ",
      "doi": "10.5555/2042283.2042427"
    },
    {
      "text": "Shi, Y., Ruiz, N., Taib, R., Choi, E. and Chen, F. Galvanic skin response (GSR) as an index of cognitive load CHI '07 Extended Abstracts on Human Factors in Computing Systems, ACM, San Jose, CA, USA, 2007, 2651--2656.  ",
      "doi": "10.1145/1240866.1241057"
    },
    {
      "text": "Sweller, J. 1988. Cognitive load during problem solving: Effects on learning. Cognitive science 12, 2: 257--285.",
      "doi": ""
    },
    {
      "text": "van den Broek, E., van der Zwaag, M.D., Healey, J.A., Janssen, J.H. and Westerink, J.H.D.M. Prerequisites for Affective Signal Processing (ASP) - Part IV 1st International Workshop on Bioinspired Human-Machine Interfaces and Healthcare Applications - B-Interface 2010, Valencia, Spain, 2010, 59--66.",
      "doi": ""
    },
    {
      "text": "Vermeeren, A.P.O.S., Law, E.L.-C., Roto, V., Obrist, M., Hoonhout, J., V, K., #228 and nenVainio-Mattila. User experience evaluation methods: current state and development needs Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, ACM, Reykjavik, Iceland, 2010, 521530.  ",
      "doi": "10.1145/1868914.1868973"
    },
    {
      "text": "Wang, Q., Yang, S., Liu, M., Cao, Z. and Ma, Q. 2014. An eye-tracking study of website complexity from cognitive load perspective. Decision Support Systems 62: 1--10.",
      "doi": ""
    },
    {
      "text": "Ward, R.D. and Marsden, P.H. 2003. Physiological responses to different WEB page designs. International Journal of Human-Computer Studies 59, 1--2: 199--212.  ",
      "doi": "10.1016/S1071-5819%2803%2900019-3"
    },
    {
      "text": "Wooding, D.S. Fixation maps: quantifying eyemovement traces Proceedings of the 2002 symposium on Eye tracking research & applications, ACM, New Orleans, Louisiana, 2002, 31--36.  ",
      "doi": "10.1145/507072.507078"
    },
    {
      "text": "Zaman, B. and Shrimpton-Smith, T. The FaceReader: measuring instant fun of use Proceedings of the 4th Nordic conference on Human-computer interaction: changing roles, ACM, Oslo, Norway, 2006, 457--460.  ",
      "doi": "10.1145/1182475.1182536"
    },
    {
      "text": "Zhihong, Z., Pantic, M., Roisman, G.I. and Huang, T.S. 2009. A Survey of Affect Recognition Methods: Audio, Visual, and Spontaneous Expressions. IEEE Transactions on Pattern Analysis and Machine Intelligence 31, 1: 39--58.  ",
      "doi": "10.1109/TPAMI.2008.52"
    }
  ]
}