{
  "doi": "10.1145/2858036.2858266",
  "title": "Understanding Newcomers to 3D Printing: Motivations, Workflows, and Barriers of Casual Makers",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "384-396",
  "year": 2016,
  "badges": [],
  "abstract": "Interest in understanding and facilitating 3D digital fabrication is growing in the HCI research community. However, most of our insights about end-user interaction with fabrication are currently based on interactions of professional users, makers, and technology enthusiasts. We present a study of casual makers, users who have no prior experience with fabrication and mainly explore walk-up-and-use 3D printing services at public print centers, such as libraries, universities, and schools. We carried out 32 interviews with casual makers, print center operators, and fabrication experts to understand the motivations, workflows, and barriers in appropriating 3D printing technologies. Our results suggest that casual makers are deeply dependent on print center operators throughout the process from bootstrapping their 3D printing workflow, to seeking help and troubleshooting, to verifying their outputs. However, print center operators are usually not trained domain experts in fabrication and cannot always address the nuanced needs of casual makers. We discuss implications for optimizing 3D design tools and interactions that can better facilitate casual makers' workflows.",
  "tags": [
    "casual makers",
    "3D printing",
    "3D modelling",
    "learning barriers"
  ],
  "authors": [
    {
      "name": "Nathaniel Hudson",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020519",
      "orcid": "missing"
    },
    {
      "name": "Celena Alcock",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020787",
      "orcid": "missing"
    },
    {
      "name": "Parmit K. Chilana",
      "institution": "University of Waterloo, Waterloo, ON, Canada",
      "img": "/do/10.1145/contrib-81416609224/rel-imgonly/parmit2015linkedin.jpg",
      "acmid": "81416609224",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Mark S. Ackerman, Juri Dachtera, Volkmar Pipek, and Volker Wulf. 2013. Sharing knowledge and expertise: The CSCW view of knowledge management. Computer Supported Cooperative Work (CSCW) 22, 4--6: 531--573.  ",
      "doi": "10.1007/s10606-013-9192-8"
    },
    {
      "text": "Chris Anderson. 2014. Makers: The New Industrial Revolution. Crown Business, USA.",
      "doi": ""
    },
    {
      "text": "Shannon Crawford Barniskis. 2014. Makerspaces and Teaching Artists. Teaching Artist Journal 12, 1: 6--14.",
      "doi": ""
    },
    {
      "text": "Paulo Blikstein. 2013. Digital fabrication and \"making\" in education: The democratization of invention. FabLabs: Of machines, makers and inventors: 1--21.",
      "doi": ""
    },
    {
      "text": "Erin Buehler, Stacy Branham, Abdullah Ali, et al. 2015. Sharing is Caring: Assistive Technology Designs on Thingiverse. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 525--534.  ",
      "doi": "10.1145/2702123.2702525"
    },
    {
      "text": "Erin Buehler, Shaun K. Kane, and Amy Hurst. 2014. ABC and 3D: Opportunities and Obstacles to 3D Printing in Special Education Environments. Proceedings of the 16th International ACM SIGACCESS Conference on Computers & Accessibility, ACM, 107--114.  ",
      "doi": "10.1145/2661334.2661365"
    },
    {
      "text": "Parmit K. Chilana, Andrew J. Ko, and Jacob O. Wobbrock. 2012. LemonAid: Selection-based Crowdsourced Contextual Help for Web Applications. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1549--1558.  ",
      "doi": "10.1145/2207676.2208620"
    },
    {
      "text": "Matthew Conway, Steve Audia, Tommy Burnette, Dennis Cosgrove, and Kevin Christiansen. 2000. Alice: lessons learned from building a 3D system for novices. Proceedings of the SIGCHI conference on Human Factors in Computing Systems, ACM, 486--493.  ",
      "doi": "10.1145/332040.332481"
    },
    {
      "text": "David Hinkle. 2014. The QC Co-Lab: Starting a Makerspace in the Midwest. Retrieved September 21, 2015 from http://ir.uiowa.edu/thestudio_talks/12/",
      "doi": ""
    },
    {
      "text": "DALE Dougherty. 2013. The maker mindset. Design, make, play: Growing the next generation of STEM innovators: 7--11. Routledge, NY.",
      "doi": ""
    },
    {
      "text": "Madeline Gannon and Eric Brockmeyer. 2014. Teaching CAD/CAM Workflows to Nascent Designers. Proceedings of the 19th International Conference of the Association of Computer-Aided Architectural Design Research in Asia CAADRIA 2014: 801--810",
      "doi": ""
    },
    {
      "text": "Todd Grimm. 2004. User's Guide to Rapid Prototyping. Society of Manufacturing Engineers.",
      "doi": ""
    },
    {
      "text": "Michael Groenendyk. 2013. A further investigation into 3D printing and 3D scanning at the Dalhousie University Libraries: A year long case study. Canadian Association of Research Libraries.",
      "doi": ""
    },
    {
      "text": "Michael Groenendyk. 2013. A further investigation into 3D printing and 3D scanning at the Dalhousie University Libraries: A year long case study. Canadian Association of Research Libraries. Retrieved August 21, 2015 from http://www.carlabrc.ca/uploads/Publications/2013-04--26%20Michael%20Groenendyk%20ENG.pdf",
      "doi": ""
    },
    {
      "text": "Tovi Grossman, George Fitzmaurice, and Ramtin Attar. 2009. A survey of software learnability: metrics, methodologies and guidelines. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 649--658.  ",
      "doi": "10.1145/1518701.1518803"
    },
    {
      "text": "John Hagel, John Seely Brown, and Duleesha Kulasooriya. 2014. A movement in the making. Deloitte University Press, TX, USA. Retrieved July 13: 2014.",
      "doi": ""
    },
    {
      "text": "Björn Hartmann, Daniel MacDougall, Joel Brandt, and Scott R. Klemmer. 2010. What Would Other Programmers Do: Suggesting Solutions to Error Messages. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 1019--1028.  ",
      "doi": "10.1145/1753326.1753478"
    },
    {
      "text": "Takeo Igarashi, Satoshi Matsuoka, and Hidehiko Tanaka. 1999. Teddy: A Sketching Interface for 3D Freeform Design. Proceedings of the 26th Annual Conference on Computer Graphics and Interactive Techniques, ACM Press/Addison-Wesley Publishing Co., 409--416.  ",
      "doi": "10.1145/311535.311602"
    },
    {
      "text": "Rohit Ashok Khot, Larissa Hjorth, and Florian 'Floyd' Mueller. 2014. Understanding physical activity through 3D printed material artifacts. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM, 3835--3844.  ",
      "doi": "10.1145/2556288.2557144"
    },
    {
      "text": "Vojtěch Krs. 2014. Sculpting in Virtual Reality. Retrieved August 27, 2015 from http://dcgi.felk.cvut.cz/theses/2014/krsvolte",
      "doi": ""
    },
    {
      "text": "Stacey Kuznetsov and Eric Paulos. 2010. Rise of the expert amateur: DIY projects, communities, and cultures. Proceedings of the 6th Nordic Conference on Human-Computer Interaction: Extending Boundaries, ACM, 295--304.  ",
      "doi": "10.1145/1868914.1868950"
    },
    {
      "text": "Harris Kyriakou, Steven Englehardt, and Jeffrey V. Nickerson. 2012. Networks of Innovation in 3D Printing. Social Science Research Network, Rochester, NY. Retrieved June 25, 2015 from http://papers.ssrn.com/abstract=2146080",
      "doi": ""
    },
    {
      "text": "Ghang Lee, Charles M. Eastman, Tarang Taunk, and Chun-Heng Ho. 2010. Usability principles and best practices for the user interface design of complex 3D architectural design and engineering tools. International Journal of Human-Computer Studies 68, 1--2: 90--104.  ",
      "doi": "10.1016/j.ijhcs.2009.10.001"
    },
    {
      "text": "Silvia Lindtner, Garnet D. Hertz, and Paul Dourish. 2014. Emerging Sites of HCI Innovation: Hackerspaces, Hardware Startups & Incubators. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 439--448.  ",
      "doi": "10.1145/2556288.2557132"
    },
    {
      "text": "Thomas Ludwig, Oliver Stickel, Alexander Boden, and Volkmar Pipek. 2014. Towards Sociable Technologies: An Empirical Study on Designing Appropriation Infrastructures for 3D Printing. Proceedings of the Designing Interactive Systems Conference, ACM, 835--844.  ",
      "doi": "10.1145/2598510.2598528"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. 2011. IP-QAT: in-product questions, answers, & tips. Proceedings of the 24th annual ACM symposium on User interface software and technology, ACM, 175--184.  ",
      "doi": "10.1145/2047196.2047218"
    },
    {
      "text": "David A. Mellis and Leah Buechley. 2012. Case Studies in the Personal Fabrication of Electronic Products. Proceedings of the Designing Interactive Systems Conference, ACM, 268--277.  ",
      "doi": "10.1145/2317956.2317998"
    },
    {
      "text": "David Mellis, Sean Follmer, Björn Hartmann, Leah Buechley, and Mark D. Gross. 2013. FAB at CHI: digital fabrication tools, design, and community. CHI'13 Extended Abstracts on Human Factors in Computing Systems, ACM, 3307--3310.  ",
      "doi": "10.1145/2468356.2479673"
    },
    {
      "text": "Andrew Milne, Bernhard Riecke, and Alissa Antle. Exploring Maker Practice: Common Attitudes, Habits and Skills from Vancouver's Maker Community. Studies 19, 21: 23.",
      "doi": ""
    },
    {
      "text": "Jarkko Moilanen, Angela Daly, Ramon Lobato, and Darcy Allen. 2014. Cultures of Sharing in 3D Printing: What Can We Learn from the Licence Choices of Thingiverse Users'. Social Science Research Network, Rochester, NY.",
      "doi": ""
    },
    {
      "text": "Catarina Mota. 2011. The rise of personal fabrication. Proceedings of the 8th ACM conference on Creativity and cognition, ACM, 279--288.  ",
      "doi": "10.1145/2069618.2069665"
    },
    {
      "text": "Stefanie Mueller, Pedro Lopes, and Patrick Baudisch. 2012. Interactive Construction: Interactive Fabrication of Functional Mechanical Devices. Proceedings of the 25th Annual ACM Symposium on User Interface Software and Technology, ACM, 599--606.  ",
      "doi": "10.1145/2380116.2380191"
    },
    {
      "text": "Mike Murphy. With the 3D printer revolution slow to reach the household market, MakerBot regroups. Quartz. Retrieved September 1, 2015 from http://qz.com/401569/makerbot-has-found-its-audienceand-its-not-you-or-me/",
      "doi": ""
    },
    {
      "text": "Jeffrey V. Nickerson. 2015. Collective Design: Remixing and Visibility. In Design Computing and Cognition '14, John S. Gero and Sean Hanna (eds.). Springer International Publishing, 263--276.",
      "doi": ""
    },
    {
      "text": "Bettina Nissen and John Bowers. 2015. Data-Things: Digital Fabrication Situated Within Participatory Data Translation Activities. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 2467--2476.  ",
      "doi": "10.1145/2702123.2702245"
    },
    {
      "text": "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay. 2015. Patterns of Physical Design Remixing in Online Maker Communities. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems, ACM, 639--648.  ",
      "doi": "10.1145/2702123.2702175"
    },
    {
      "text": "Julian Edgerton Orr. 1996. Talking about machines: An ethnography of a modern job. Cornell University Press.",
      "doi": ""
    },
    {
      "text": "Patrick Paczkowski, Julie Dorsey, Holly Rushmeier, and Min H. Kim. 2014. Paper3D: bringing casual 3D modeling to a multi-touch interface. Proceedings of the 27th annual ACM symposium on User interface software and technology, ACM, 23--32.  ",
      "doi": "10.1145/2642918.2647416"
    },
    {
      "text": "Laura Elizabeth Pinto. 2015. Putting the critical back into makerspaces. CCPA Monitor 22, 1: 34--39.",
      "doi": ""
    },
    {
      "text": "Michael Polanyi. 1969. Knowing and being: Essays by Michael Polanyi. Marjorie Green, Ed. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Steven Pryor. 2014. Implementing a 3D Printing Service in an Academic Library. Journal of Library Administration 54, 1: 1--10.",
      "doi": ""
    },
    {
      "text": "Daniela Rosner and Jonathan Bean. 2009. Learning from IKEA Hacking: I'M Not One to Decoupage a Tabletop and Call It a Day. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, ACM, 419--422.  ",
      "doi": "10.1145/1518701.1518768"
    },
    {
      "text": "John Stanislav Sadar and Gyungju Chyon. 2011. 3D Scanning and Printing As a New Medium for Creativity in Product Design. Procedings of the Conference on Creativity and Innovation in Design, ACM, 15--20.  ",
      "doi": "10.1145/2079216.2079218"
    },
    {
      "text": "Vincent F. Scalfani and Josh Sahib. 2013. A model for managing 3D printing services in academic libraries. Issues in Science and Technology Libraries 72.",
      "doi": ""
    },
    {
      "text": "Ryan Schmidt and Matt Ratto. 2013. Design-to-fabricate: Maker hardware requires maker software. Computer Graphics and Applications, IEEE 33, 6: 26--34.  ",
      "doi": "10.5555/2587734.2587850"
    },
    {
      "text": "Kimberly Sheridan, Erica Rosenfeld Halverson, Breanne K Litts, Lisa Brahms, Lynette Jacobs-Piebe, and Trevor Owens. Learning in the Making: A Comparative Case Study of Three Makerspaces - ProQuest. Harvard Educational Review 84, 4.",
      "doi": ""
    },
    {
      "text": "Rita Shewbridge, Amy Hurst, and Shaun K. Kane. 2014. Everyday Making: Identifying Future Uses for 3D Printing in the Home. Proceedings of the 2014 Conference on Designing Interactive Systems, ACM, 815--824.  ",
      "doi": "10.1145/2598510.2598544"
    },
    {
      "text": "Adrian Smith, Sabine Hielscher, Sascha Dickel, Johan Soderberg, and Ellen van Oost. 2013. Grassroots digital fabrication and makerspaces: Reconfiguring, relocating and recalibrating innovation? Science and Technology Policy Research 2013-02.",
      "doi": ""
    },
    {
      "text": "Anselm Leonard Strauss, and Juliet M. Corbin. 1990. Basics of qualitative research. Sage Newbury Park, CA.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1995. Making Work Visible. Communications of the ACM 38, 9: 56--64.  ",
      "doi": "10.1145/223248.223263"
    },
    {
      "text": "Nobuyuki Umetani, Takeo Igarashi, and Niloy J. Mitra. 2012. Guided exploration of physically valid shapes for furniture design. ACM Trans. Graph. 31, 4: 86.  ",
      "doi": "10.1145/2185520.2185582"
    },
    {
      "text": "Tricia Wang and Joseph \"Jofish\" Kaye. 2011. Inventive Leisure Practices: Understanding Hacking Communities As Sites of Sharing and Innovation. CHI '11 Extended Abstracts on Human Factors in Computing Systems, ACM, 263--272.  ",
      "doi": "10.1145/1979742.1979615"
    },
    {
      "text": "Charlie Wapner. 2013. Progress in the Making: 3D Printing Policy Considerations through the Library Lens. OITP Perspectives, 3.",
      "doi": ""
    },
    {
      "text": "Christian Weichel, Manfred Lau, David Kim, Nicolas Villar, and Hans W. Gellersen. 2014. MixFab: a mixed-reality environment for personal fabrication. Proceedings of the 32nd annual ACM conference on Human factors in computing systems, ACM, 3855--3864.  ",
      "doi": "10.1145/2556288.2557090"
    },
    {
      "text": "Julian Weinmann. 2014. Makerspaces in the university community. Retrieved August 21, 2015 from http://web.stanford.edu/group/design_education/wikiu pload/0/0a/Weinmann_Masters_Thesis.pdf",
      "doi": ""
    },
    {
      "text": "Karl D.D. Willis, Cheng Xu, Kuan-Ju Wu, Golan Levin, and Mark D. Gross. 2011. Interactive Fabrication: New Interfaces for Digital Fabrication. Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction, ACM, 69--72.  ",
      "doi": "10.1145/1935701.1935716"
    },
    {
      "text": "The Economist. 2011. The printed world. The Economist. Retrieved September 22, 2015 from http://www.economist.com /node/18114221",
      "doi": ""
    }
  ]
}