{
  "doi": "10.1145/2858036.2858148",
  "title": "Design Opportunities in Three Stages of Relationship Development between Users and Self-Tracking Devices",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "699-703",
  "year": 2016,
  "badges": [],
  "abstract": "Recently, self-tracking devices such as wearable activity trackers have become more available to end users. While these emerging products are imbued with new characteristics in terms of human-computer interaction, it is still unclear how to describe and design for user experience in such devices. In this paper, we present a three-week field study, which aimed to unfold users' experience with wearable activity trackers. Drawing from Knapp's model of interaction stages in interpersonal relationship development, we propose three stages of relationship development between users and self-tracking devices: initiation & experimentation, intensifying & integration, and stagnation & termination. We highlight the challenges in each stage and design opportunities for future self-tracking devices.",
  "authors": [
    {
      "name": "Da-jung Kim",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484643201",
      "orcid": "missing"
    },
    {
      "name": "Yeoreum Lee",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/do/10.1145/contrib-81508690346/rel-imgonly/yeoreumlee_square.jpg",
      "acmid": "81508690346",
      "orcid": "missing"
    },
    {
      "name": "Saeyoung Rho",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020466",
      "orcid": "missing"
    },
    {
      "name": "Youn-kyung Lim",
      "institution": "Korea Advanced Institute of Science and Technology, Daejeon, South Korea",
      "img": "/do/10.1145/contrib-81100398105/rel-imgonly/ykl-e1265351534215-150x150.jpg",
      "acmid": "81100398105",
      "orcid": "0000-0003-3238-9404"
    }
  ],
  "references": [
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. 2013. Health Mashups: presenting statistical patterns between wellbeing data and context in natural language to promote behavior change. ACM Transaction on Computer-Human Interaction 20: 5, Article 30.  ",
      "doi": "10.1145/2503823"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding quantified-selfers' practices in collecting and exploring personal data. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1143--1152.  ",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Sunny Consolvo, David W. McDonald, Tammy Toscos, Mike Y. Chen, Jon Froehlich, Beverly Harrison, Predrag Klasnja, Anthony LaMarca, Louis LeGrand, Ryan Libby, Ian Smith, and James A. Landay. 2008. Activity sensing in the wild: a field trial of ubifit garden. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 1797--1806.  ",
      "doi": "10.1145/1357054.1357335"
    },
    {
      "text": "Brian J. Fogg. 1998. Charismatic Computers: Creating More Likable and Persuasive Interactive Technologies by Leveraging Principles from Social Psychology. Ph.D. Dissertation. Stanford University. ",
      "doi": "10.5555/287026"
    },
    {
      "text": "Thomas Fritz, Elaine M. Huang, Gail C. Murphy, and Thomas Zimmermann. 2014. Persuasive technology in the real world: a study of long-term use of activity sensing devices for fitness. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 487--496.  ",
      "doi": "10.1145/2556288.2557383"
    },
    {
      "text": "Lars Hallnäs and Johan Redström. 2001. Slow Technology -- Designing for Reflection. Personal Ubiquitous Computing 5, 3: 201--212.  ",
      "doi": "10.1007/PL00000019"
    },
    {
      "text": "Mark L. Knapp and Anita L. Vangelisti. 2005. Interpersonal Communication and Human Relationships (5th Edition). Pearson.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Christian Koehler, Joshua Tanenbaum, and David H. Nguyen. 2015. Why we use and abandon smart devices. In Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 635--646.  ",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "Dan Ledger and Daniel McCaffrey. 2014. How the science of human behavior change offers the secret to long-term engagement. Retrieved August 11, 2014 from http://endeavourpartners.net/white-papers/",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Junsung Kim, Jodi Forlizzi, and Sara Kiesler. 2015. Personalization revisited: a reflective approach helps people better personalize health services and motivates them to increase physical activity. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 743--754.  ",
      "doi": "10.1145/2750858.2807552"
    },
    {
      "text": "Yeoreum Lee and Youn-kyung Lim. 2015. Understanding the roles and influences of mediators from multiple social channels for health behavior change. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1070--1079.  ",
      "doi": "10.1145/2675133.2685032"
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2011. Understanding my data, myself: supporting selfreflection with ubicomp technologies. In Proceedings of the 13th international conference on Ubiquitous computing (UbiComp '11), 405--414.  ",
      "doi": "10.1145/2030112.2030166"
    },
    {
      "text": "William T. Odom, Abigail J. Sellen, Richard Banks, David S. Kirk, Tim Regan, Mark Selby, Jodi L. Forlizzi, and John Zimmerman. 2014. Designing for slowness, anticipation and re-visitation: a long term field study of the photobox. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 1961--1970.  ",
      "doi": "10.1145/2556288.2557178"
    },
    {
      "text": "William Odom, John Zimmerman, and Jodi Forlizzi. 2010. Virtual possessions. In Proceedings of the 8th ACM Conference on Designing Interactive Systems (DIS '10), 368--371.  ",
      "doi": "10.1145/1858171.1858240"
    },
    {
      "text": "Byron Reeves and Clifford Nass. 1996. The Media Equation: How People Treat Computers, Television, and New Media Like Real People and Places. Cambridge University Press. ",
      "doi": "10.5555/236605"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1163--1172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Andrew I. Schein, Alexandrin Popescul, Lyle H. Ungar, and David M. Pennock. 2002. Methods and metrics for cold-start recommendations. In Proceedings of the ACM SIGIR conference on Research and development in information retrieval (SIGIR '02), 253--260.  ",
      "doi": "10.1145/564376.564421"
    },
    {
      "text": "Patrick C. Shih, Kyungsik Han, Erika Shehan Poole, Mary Beth Rosson, and John M. Carroll. 2015. Use and Adoption Challenges of Wearable Activity Trackers. In iConference Proceedings 2015.",
      "doi": ""
    },
    {
      "text": "Bruce Sterling. 2005. Shaping Things. MIT Press.",
      "doi": ""
    },
    {
      "text": "John W. Thibaut and Harold H. Kelly. 1959. The Social Psychology of Groups. John Wiley & Sons, Inc.",
      "doi": ""
    },
    {
      "text": "Ana Valencia, Ruth Mugge, Jan Schoormans, and Hendrik Schifferstein. 2015. The design of smart product-service systems (PSSs): An exploration of design characteristics. International Journal of Design 9, 1: 13--28.",
      "doi": ""
    },
    {
      "text": "Ron Wakkary, Audrey Desjardins, and Sabrina Hauser. 2015. Unselfconscious Interaction: A Conceptual Construct. Interacting with Computers, first published online July 17, 2015. doi:10.1093/iwc/iwv018",
      "doi": ""
    }
  ]
}