{
  "doi": "10.1145/2858036.2858580",
  "title": "FingerIO: Using Active Sonar for Fine-Grained Finger Tracking",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "1515-1525",
  "year": 2016,
  "badges": [],
  "abstract": "We present fingerIO, a novel fine-grained finger tracking solution for around-device interaction. FingerIO does not require instrumenting the finger with sensors and works even in the presence of occlusions between the finger and the device. We achieve this by transforming the device into an active sonar system that transmits inaudible sound signals and tracks the echoes of the finger at its microphones. To achieve sub-centimeter level tracking accuracies, we present an innovative approach that use a modulation technique commonly used in wireless communication called Orthogonal Frequency Division Multiplexing (OFDM). Our evaluation shows that fingerIO can achieve 2-D finger tracking with an average accuracy of 8 mm using the in-built microphones and speaker of a Samsung Galaxy S4. It also tracks subtle finger motion around the device, even when the phone is in the pocket. Finally, we prototype a smart watch form-factor fingerIO device and show that it can extend the interaction space to a 0.5×0.25 m2 region on either side of the device and work even when it is fully occluded from the finger.",
  "authors": [
    {
      "name": "Rajalakshmi Nandakumar",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81508688799",
      "orcid": "missing"
    },
    {
      "name": "Vikram Iyer",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-99659021389/rel-imgonly/me.jpg",
      "acmid": "99659021389",
      "orcid": "missing"
    },
    {
      "name": "Desney Tan",
      "institution": "Microsoft Research, Redmond, WA, USA",
      "img": "/do/10.1145/contrib-81100255664/rel-imgonly/desney_tan.jpg",
      "acmid": "81100255664",
      "orcid": "missing"
    },
    {
      "name": "Shyamnath Gollakota",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81336489396/rel-imgonly/81336489396.jpg",
      "acmid": "81336489396",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adafruit. https://www.adafruit.com/products/1063.",
      "doi": ""
    },
    {
      "text": "Apple Watch - Guided Tour: Phone Calls. https://www.youtube.com/watch?v=Zj5KisMVv8.",
      "doi": ""
    },
    {
      "text": "Chirp Microsystems. http://www.chirpmicro.com/technology.html.",
      "doi": ""
    },
    {
      "text": "A MimioTeach Interaction Whiteboard. http://www.mimio.com/en-NA/Products/MimioTeach-Interactive-Whiteboard.aspx.",
      "doi": ""
    },
    {
      "text": "Adib, F., Kabelac, Z., Katabi, D., and Miller, R. C. 3D Tracking via Body Radio Reflections. NSDI 2014, 317--329. ",
      "doi": "10.5555/2616448.2616478"
    },
    {
      "text": "Aumi, M. T. I., Gupta, S., Goel, M., Larson, E., and Patel, S. DopLink: Using the Doppler Effect for Multi-device Interaction. UbiComp 2013, 583--586.  ",
      "doi": "10.1145/2493432.2493515"
    },
    {
      "text": "Boleskei, H. Principles of MIMO-OFDM wireless systems. 2004.",
      "doi": ""
    },
    {
      "text": "Braun, A., Krepp, S., and Kuijper, A. Acoustic Tracking of Hand Activities on Surfaces. WOAR 2015, 1--5.  ",
      "doi": "10.1145/2790044.2790052"
    },
    {
      "text": "Butler, A., Izadi, S., and Hodges, S. SideSight: Multi-\"Touch\" Interaction Around Small Devices. UIST 2008, 201--204.  ",
      "doi": "10.1145/1449715.1449746"
    },
    {
      "text": "Chan, L., Liang, R.-H., Tsai, M.-C., Cheng, K.-Y., Su, C.-H., Chen, M. Y., Cheng, W.-H., and Chen, B.-Y. FingerPad: Private and Subtle Interaction Using Fingertips. UIST 2013, 255--260.  ",
      "doi": "10.1145/2501988.2502016"
    },
    {
      "text": "Chen, K.-Y., Ashbrook, D., Goel, M., Lee, S.-H., and Patel, S. AirLink: Sharing Files Between Multiple Devices Using In-air Gestures. UbiComp 2014, 565--569.  ",
      "doi": "10.1145/2632048.2632090"
    },
    {
      "text": "Chen, K.-Y., Lyons, K., White, S., and Patel, S. uTrack: 3D Input Using Two Magnetic Sensors. UIST 2013, 237--244.  ",
      "doi": "10.1145/2501988.2502035"
    },
    {
      "text": "Goel, M., Lee, B., Islam Aumi, M. T., Patel, S., Borriello, G., Hibino, S., and Begole, B. Surface Link: Using Inertial and Acoustic Sensing to Enable Multi-device Interaction on a Surface. CHI 2014, 1387--1396.  ",
      "doi": "10.1145/2556288.2557120"
    },
    {
      "text": "Google. Project Soli. https://www.youtube.com/watch?v=_Zj5KisMVv8.",
      "doi": ""
    },
    {
      "text": "Gupta, S., Morris, D., Patel, S., and Tan, D. SoundWave: Using the Doppler Effect to Sense Gestures. CHI 2012, 1911--1914.  ",
      "doi": "10.1145/2207676.2208331"
    },
    {
      "text": "Heiskala, J., and Terry, J. OFDM Wireless LANs: A Theoretical and Practical Guide. Sams publishing, 2001. ",
      "doi": "10.5555/582818"
    },
    {
      "text": "Huang, W., Xiong, Y., Li, X.-Y., Lin, H., Mao, X., Yang, P., and Liu, Y. Shake and walk: Acoustic direction finding and fine-grained indoor localization using smartphones. INFOCOM 2014, 370--278.",
      "doi": ""
    },
    {
      "text": "Kellogg, B., Talla, V., and Gollakota, S. Bringing Gesture Recognition to All Devices. NSDI 2014, 303--316. ",
      "doi": "10.5555/2616448.2616477"
    },
    {
      "text": "Khyam, M., Alam, M., Lambert, A., Benson, C., and Pickering, M. High precision multiple ultrasonic transducer positioning using a robust optimization approach. ISSPIT 2013, 192--197.",
      "doi": ""
    },
    {
      "text": "Khyam, M., Alam, M., and Pickering, M. OFDM based low-complexity time of arrival estimation in active sonar. OCEANS 2014, 1--5.",
      "doi": ""
    },
    {
      "text": "Kienzle, W., and Hinckley, K. LightRing: Always-available 2D Input on Any Surface. UIST 2014, 157--160.  ",
      "doi": "10.1145/2642918.2647376"
    },
    {
      "text": "Kim, D., Hilliges, O., Izadi, S., Butler, A. D., Chen, J., Oikonomidis, I., and Olivier, P. Digits: Freehand 3D Interactions Anywhere Using a Wrist-worn Gloveless Sensor. UIST 2012, 167--176.  ",
      "doi": "10.1145/2380116.2380139"
    },
    {
      "text": "Kratz, S., and Rohs, M. HoverFlow: Expanding the Design Space of Around-device Interaction. MobileHCI 2009, 1--8.  ",
      "doi": "10.1145/1613858.1613864"
    },
    {
      "text": "Liu, J., Wang, Y., Kar, G., Chen, Y., Yang, J., and Gruteser, M. Snooping Keystrokes with Mm-level Audio Ranging on a Single Phone. MobiCom 2015, 142--154.  ",
      "doi": "10.1145/2789168.2790122"
    },
    {
      "text": "MacNeish. The Intersections of Two Conic Sections with a Common Focus. The American Mathematical Monthly 28, 6/7, 260--262.",
      "doi": ""
    },
    {
      "text": "Nandakumar, R., Chinatalapudi, K., Padmanaban, V., and Venkatesan, R. Dhwani: Secure Peer-to-Peer Acoustic NFC. Sigcomm 2013 2013.  ",
      "doi": "10.1145/2486001.2486037"
    },
    {
      "text": "Nandakumar, R., Gollakota, S., and Watson, N. Contactless Sleep Apnea Detection on Smartphones. Mobisys 2015, 45--57.  ",
      "doi": "10.1145/2742647.2742674"
    },
    {
      "text": "Ogata, M., Sugiura, Y., Osawa, H., and Imai, M. iRing: Intelligent Ring Using Infrared Reflection. UIST 2012, 131--136.  ",
      "doi": "10.1145/2380116.2380135"
    },
    {
      "text": "Priyantha, N. B., Chakraborty, A., and Balakrishnan, H. The Cricket Location-support System. Mobicom 2000, 32--43.  ",
      "doi": "10.1145/345910.345917"
    },
    {
      "text": "Proakis, J., and Salehi, M. Digital Communications. McGraw-hill, 2007.",
      "doi": ""
    },
    {
      "text": "Przybyla, R., Tang, H.-Y., Guedes, A., Shelton, S., Horsley, D., and Boser, B. 3D Ultrasonic Rangefinder on a Chip. IEEE Journal of Solid-State Circuits 2015, 320--334.",
      "doi": ""
    },
    {
      "text": "Pu, Q., Gupta, S., Gollakota, S., and Patel, S. Whole-home Gesture Recognition Using Wireless Signals. Mobicom 2013, 27--38.  ",
      "doi": "10.1145/2500423.2500436"
    },
    {
      "text": "Reju, V., Khong, A., and Sulaiman, A. Localization of Taps on Solid Surfaces for Human-Computer Touch Interfaces. IEEE Trans. on Multimedia 2013, 1365--1376.  ",
      "doi": "10.1109/TMM.2013.2264656"
    },
    {
      "text": "Saponas, T. S., Harrison, C., and Benko, H. PocketTouch: Through-fabric Capacitive Touch Input. UIST 2011, 303--308.  ",
      "doi": "10.1145/2047196.2047235"
    },
    {
      "text": "Song, J., Soros, G., Pece, F., Fanello, S. R., Izadi, S., Keskin, C., and Hilliges, O. In-air Gestures Around Unmodified Mobile Devices. UIST 2014, 319--329.  ",
      "doi": "10.1145/2642918.2647373"
    },
    {
      "text": "Sun, L., Sen, S., Koutsonikolas, D., and Kim, K.-H. WiDraw: Enabling Hands-free Drawing in the Air on Commodity WiFi Devices. Mobicom 2015, 77--89.  ",
      "doi": "10.1145/2789168.2790129"
    },
    {
      "text": "Sun, Z., Purohit, A., Bose, R., and Zhang, P. Spartacus: Spatially-aware Interaction for Mobile Devices Through Energy-efficient Audio Sensing. MobiSys 2013, 263--276.  ",
      "doi": "10.1145/2462456.2464437"
    },
    {
      "text": "Wang, J., Zhao, K., Zhang, X., and Peng, C. Ubiquitous Keyboard for Small Mobile Devices: Harnessing Multipath Fading for Fine-grained Keystroke Localization. MobiSys 2014, 14--27.  ",
      "doi": "10.1145/2594368.2594384"
    },
    {
      "text": "Xiao, R., Lew, G., Marsanico, J., Hariharan, D., Hudson, S., and Harrison, C. Toffee: Enabling Ad Hoc, Around-device Interaction with Acoustic Time-of-arrival Correlation. MobileHCI 2014, 67--76.  ",
      "doi": "10.1145/2628363.2628383"
    },
    {
      "text": "Yang, X.-D., Grossman, T., Wigdor, D., and Fitzmaurice, G. Magic Finger: Always-available Input Through Finger Instrumentation. UIST 2012, 147--156.  ",
      "doi": "10.1145/2380116.2380137"
    },
    {
      "text": "Yang, X.-D., Hasan, K., Bruce, N., and Irani, P. Surround-see: Enabling Peripheral Vision on Smartphones During Active Use. UIST 2013, 291--300.  ",
      "doi": "10.1145/2501988.2502049"
    },
    {
      "text": "Yun, S., Chen, Y.-C., and Qiu, L. Turning a Mobile Device into a Mouse in the Air. Mobisys 2015, 15--29.  ",
      "doi": "10.1145/2742647.2742662"
    },
    {
      "text": "Zhao, C., Chen, K.-Y., Aumi, M. T. I., Patel, S., and Reynolds, M. S. SideSwipe: Detecting In-air Gestures Around Mobile Devices Using Actual GSM Signal. UIST 2014, 527--534.  ",
      "doi": "10.1145/2642918.2647380"
    }
  ]
}