{
  "doi": "10.1145/2858036.2858556",
  "title": "Trigger-Action Programming in the Wild: An Analysis of 200,000 IFTTT Recipes",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "3227-3231",
  "year": 2016,
  "badges": [],
  "abstract": "While researchers have long investigated end-user programming using a trigger-action (if-then) model, the website IFTTT is among the first instances of this paradigm being used on a large scale. To understand what IFTTT users are creating, we scraped the 224,590 programs shared publicly on IFTTT as of September 2015 and are releasing this dataset to spur future research. We characterize aspects of these programs and the IFTTT ecosystem over time. We find a large number of users are crafting a diverse set of end-user programs---over 100,000 different users have shared programs. These programs represent a very broad array of connections that appear to fill gaps in functionality, yet users often duplicate others' programs.",
  "authors": [
    {
      "name": "Blase Ur",
      "institution": "Carnegie Mellon University, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81496672613/rel-imgonly/blase_headshot_400.jpg",
      "acmid": "81496672613",
      "orcid": "missing"
    },
    {
      "name": "Melwyn Pak Yong Ho",
      "institution": "Brown University, Providence, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959118457",
      "orcid": "missing"
    },
    {
      "name": "Stephen Brawner",
      "institution": "Brown University, Providence, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021843",
      "orcid": "missing"
    },
    {
      "name": "Jiyun Lee",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021401",
      "orcid": "missing"
    },
    {
      "name": "Sarah Mennicken",
      "institution": "University of Zurich, Zurich, Switzerland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460655382",
      "orcid": "missing"
    },
    {
      "name": "Noah Picard",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022345",
      "orcid": "missing"
    },
    {
      "name": "Diane Schulze",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020411",
      "orcid": "missing"
    },
    {
      "name": "Michael L. Littman",
      "institution": "Brown University, Providence, RI, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406601119",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Alexander Tibbets. 2014. Rain Tomorrow-- https://ifttt.com/recipes/ 165139-rain-tomorrow-get-a-notification. (2014).",
      "doi": ""
    },
    {
      "text": "Christopher Bogart, Margaret Burnett, Allen Cypher, and Christopher Scaf--di. 2008. End-User Programming in the Wild: A Field Study of CoScripter Scripts. In Proc. VL/HCC.  ",
      "doi": "10.1109/VLHCC.2008.4639056"
    },
    {
      "text": "Yngve Dahl and Reidar-Martin Svendsen. 2011. End-User Composition Interfaces for Smart Environments: A Preliminary Study of Usability Factors. In Design, User Experience, and Usability. Theory, Methods, Tools and Practice. 118--127.",
      "doi": ""
    },
    {
      "text": "Scott Davidoff, Min Kyung Lee, Charles Yiu, John Zimmerman, and Anind K. Dey. 2006. Principles of smart home control. In Proc. Ubicomp.  ",
      "doi": "10.1007/11853565_2"
    },
    {
      "text": "Anind K. Dey, Timothy Sohn, Sara Streng, and Justin Kodama. 2006. iCAP: Interactive prototyping of context-aware applications. In Proc. Pervasive.  ",
      "doi": "10.1007/11748625_16"
    },
    {
      "text": "Colin Dixon, Ratul Mahajan, Sharad Agarwal, A.J. Brush, Bongshin Lee, Stefan Saroiu, and Paramvir Bahl. 2012. An Operating System for the Home. In Proc. NSDI. ",
      "doi": "10.5555/2228298.2228332"
    },
    {
      "text": "William A. Gale and Geoffrey Sampson. 1995. Good-Turing frequency estimation without tears. Journal of Quantitative Linguistics 2 (1995), 217--237.",
      "doi": ""
    },
    {
      "text": "Manuel García-Herranz, Pablo Haya, and Xavier Alamn. 2010. Towards a Ubiquitous End-User Programming System for Smart Spaces. Journal of Universal Computer Science 16, 12 (2010), 1633--1649.",
      "doi": ""
    },
    {
      "text": "Justin Huang and Maya Cakmak. 2015. Supporting mental model accuracy in trigger-action programming. In Proc. UbiComp.  ",
      "doi": "10.1145/2750858.2805830"
    },
    {
      "text": "Gilly Leshed, Eben M. Haber, Tara Matthews, and Tessa Lau. 2008. CoScripter: Automating & Sharing How-to Knowledge in the Enterprise. In Proc. CHI.  ",
      "doi": "10.1145/1357054.1357323"
    },
    {
      "text": "Wendy E. Mackay. 1990. Patterns of Sharing Customizable Software. In Proc. CSCW.  ",
      "doi": "10.1145/99332.99356"
    },
    {
      "text": "Wendy E. Mackay. 1991. Triggers and Barriers to Customizing Software. In Proc. CHI.  ",
      "doi": "10.1145/108844.108867"
    },
    {
      "text": "Michelle L. Mazurek, J.P. Arsenault, Joanna Bresee, Nitin Gupta, Iulia Ion, Christina Johns, Daniel Lee, Yuan Liang, Jenny Olsen, Brandon Salmon, Richard Shay, Kami Vaniea, Lujo Bauer, Lorrie Faith Cranor, Gregory R. Ganger, and Michael K. Reiter. 2010. Access control for home data sharing: Attitudes, needs and practices. In Proc. CHI.  ",
      "doi": "10.1145/1753326.1753421"
    },
    {
      "text": "Sarah Mennicken and Elaine M. Huang. 2012. Hacking the natural habitat: An in-the-wild study of smart homes, their development, and the people who live in them. In Proc. Pervasive.  ",
      "doi": "10.1007/978-3-642-31205-2_10"
    },
    {
      "text": "Sarah Mennicken, Jo Vermeulen, and Elaine M. Huang. 2014. From Today's Augmented Houses to Tomorrow's Smart Homes: New Directions for Home Automation Research. In Proc. UbiComp.  ",
      "doi": "10.1145/2632048.2636076"
    },
    {
      "text": "Bonnie A. Nardi. 1993. A Small Matter of Programming: Perspectives on End User Computing. MIT Press, Cambridge, MA, USA. ",
      "doi": "10.5555/160165"
    },
    {
      "text": "Mark W. Newman. 2006. Now We--re Cooking: Recipes for End-User Service Composition in the Digital Home. In Position Paper-- CHI 2006 Workshop IT@Home.",
      "doi": ""
    },
    {
      "text": "Mark W. Newman, Ame Elliott, and Trevor F. Smith. 2008. Providing an Integrated User Experience of Networked Media, Devices, and Services through End-User Composition. In Proc. Pervasive.  ",
      "doi": "10.1007/978-3-540-79576-6_13"
    },
    {
      "text": "John F. Pane, Chotirat --Ann-- Ratanamahatana, and Brad A. Myers. 2001. Studying the language and structure in non-programmers-- solutions to programming problems. Int. J. Human-Computer Studies 54, 2 (2001), 237--264.  ",
      "doi": "10.1006/ijhc.2000.0410"
    },
    {
      "text": "Samsung Smart Things. 2016. Compatible products. https: //www.smartthings.com/compatible-products. (2016).",
      "doi": ""
    },
    {
      "text": "SeleniumHQ. 2015. Selenium WebDriver. http://www.seleniumhq.org/. (2015).",
      "doi": ""
    },
    {
      "text": "Manya Sleeper, William Melicher, Hana Habib, Lujo Bauer, Lorrie Faith Cranor, and Michelle Mazurek. 2016. Sharing personal content online: Exploring channel choice and multi-channel behaviors. In Proc. CHI.  ",
      "doi": "10.1145/2858036.2858170"
    },
    {
      "text": "Supermechanical. 2013. Twine. http://supermechanical.com/twine/. (2013).",
      "doi": ""
    },
    {
      "text": "Blase Ur, Jaeyeon Jung, and Stuart Schechter. 2014a. Intruders Versus Intrusiveness: Teens' and Parents' Perspectives on Home-Entryway Surveillance. In Proc. UbiComp.  ",
      "doi": "10.1145/2632048.2632107"
    },
    {
      "text": "Blase Ur, Elyse McManus, Melwyn Pak Yong Ho, and Michael L. Littman. 2014b. Practical Trigger-Action Programming in the Smart Home. In Proc. CHI.  ",
      "doi": "10.1145/2556288.2557420"
    },
    {
      "text": "Marcel Walch, Michael Rietzler, Julia Greim, Florian Schaub, Bj orn Wiedersheim, and Michael Weber. 2013. homeBLOX: making home automation usable. In UbiComp Adjunct Proceedings.  ",
      "doi": "10.1145/2494091.2494182"
    },
    {
      "text": "Wigwag. 2013. Wigwag. http://www.wigwag.com/. (2013).",
      "doi": ""
    },
    {
      "text": "Xuan Zhao, Cliff Lampe, and Nicole Ellison. 2016. Negotiating platforms, people and practices: How people manage content sharing across social media. In Proc. CHI.",
      "doi": ""
    }
  ]
}