{
  "doi": "10.1145/2858036.2858247",
  "title": "COGCAM: Contact-free Measurement of Cognitive Stress During Computer Tasks with a Digital Camera",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "4000-4004",
  "year": 2016,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Contact-free camera-based measurement of cognitive stress opens up new possibilities for human-computer interaction with applications in remote learning, stress monitoring, and optimization of workload for user experience. The autonomic nervous system controls the inter-beat intervals of the heart and breathing patterns, and these signals change under cognitive stress. We built a participant-independent cognitive stress recognition model based on photoplethysmographic signals measured remotely at a distance of 3 meters. We tested the model on naturalistic responses from 10 individuals completing randomized-order computer-based tasks (ball control and card sorting). The system successfully detected increased stress during the tasks, which were consistent with self-report measures. Changes in heart rate variability were more discriminative indicators of cognitive stress than were heart rate and breathing rate.",
  "tags": [
    "heart rate",
    "heart rate variability",
    "breathing rate",
    "remote",
    "photoplethysmography",
    "physiology",
    "camera",
    "cognitive stress"
  ],
  "authors": [
    {
      "name": "Daniel J. McDuff",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81490688111",
      "orcid": "missing"
    },
    {
      "name": "Javier Hernandez",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81490645252/rel-imgonly/img-1.jpg",
      "acmid": "81490645252",
      "orcid": "0000-0001-9504-5217"
    },
    {
      "name": "Sarah Gontarek",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019465",
      "orcid": "missing"
    },
    {
      "name": "Rosalind W. Picard",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100496593",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Barreto, A., Zhai, J., and Adjouadi, M. Non-intrusive physiological monitoring for automated stress detection in human-computer interaction. In Human-Computer Interaction, Springer (2007), 29--38. ",
      "doi": "10.5555/1779576.1779580"
    },
    {
      "text": "Berg, E. A simple objective technique for measuring flexibility in thinking, J GEN PSYCHOL, 39, 1 (1948), 15-22.",
      "doi": ""
    },
    {
      "text": "Bousefsaf, F., Maaoui, C., and Pruski, A., Remote assessment of the heart rate variability to detect mental stress. In Proc. Pervasive Computing Technologies for Healthcare. (2013), 348-351.  ",
      "doi": "10.4108/icst.pervasivehealth.2013.252181"
    },
    {
      "text": "Csikszentmihalyi, M. Flow--The psychology of optimal experience. New York: Harper, (1990).",
      "doi": ""
    },
    {
      "text": "Fox, C., Mueller, S., Gray, H., Raber, J., and Piper, B., Evaluation of a short-form of the berg card sorting test. PloS One, 8, 5 (2013).",
      "doi": ""
    },
    {
      "text": "Garbey, M., Sun, N., Merla, A., and Pavlidis, I., Contact-free measurement of cardiac pulse based on the analysis of thermal imagery. IEEE T BIO-MED ENG, 54, 8 (2007), 1418-1426.",
      "doi": ""
    },
    {
      "text": "Healey, J., Physiological sensing of emotion. in R.A. Calvo, S.K. D'Mello, J. Gratch and A. Kappas (Eds). Handbook of Affective Computing. Oxford University Press, 2014.",
      "doi": ""
    },
    {
      "text": "Hernandez, J. Paredes, P., Roseway, A., and Czerwinski, M. Under pressure: sensing stress of computer users. In Proc of CHI '14.  ",
      "doi": "10.1145/2556288.2557165"
    },
    {
      "text": "Hjortskov, N., Rissen, D., Blangsted, A., Fallentin, N., Lundberg, U., and Søgaard, K., The effect of mental stress on heart rate variability and blood pressure during computer work. EUR J APPL PHYSIOL, vol. 92, no. 1--2, 84-89, 2004.",
      "doi": ""
    },
    {
      "text": "Iqbal, S., and Bailey, B. Investigating the effectiveness of mental workload as a predictor of opportune moments for interruption. In Proc of CHI '05.  ",
      "doi": "10.1145/1056808.1056948"
    },
    {
      "text": "KristalBoneh, E., Raifel, M., Froom, P., and Ribak, J., Heart rate variability in health and disease. SCAND J WORK ENV HEA, (1995), 85-95.",
      "doi": ""
    },
    {
      "text": "Lyu, Y., Luo, X., Zhou, J., Yu, C., Miao, C., Wang, T.,. .. and Kameyama, K. I. Measuring Photoplethysmogram-based Stress-Induced Vascular Response Index to Assess Cognitive Load and Stress. In Proc of CHI '15.  ",
      "doi": "10.1145/2702123.2702399"
    },
    {
      "text": "Matthews, G., Joyner, L., Gilliland, K., Campbell, S., Falconer, S., and Huggins, J., Validation of a comprehensive stress state questionnaire: Towards a state big three, Personality psychology in Europe, 7 (1999), 335-350.",
      "doi": ""
    },
    {
      "text": "McDuff, D., Gontarek, S., and Picard, R. Improvements in remote cardiopulmonary measurement using a five band digital camera. IEEE T BIO-MED ENG, 61, 10 (2014), 2593--2601.",
      "doi": ""
    },
    {
      "text": "McDuff, D., Gontarek, S., Picard, R. W., Remote measurement of cognitive stress via heart rate variability. In IEEE Engineering in Medicine and Biology Society (EMBC), 2014.",
      "doi": ""
    },
    {
      "text": "Moses, Z., Luecken, L., and Eason, J., Measuring taskrelated changes in heart rate variability. In Proc. of the IEEE Engineering in Medicine and Biology Society (2007), 644-647.",
      "doi": ""
    },
    {
      "text": "Mueller, S., Pebl: The psychology experiment building language (version 0.10)",
      "doi": ""
    },
    {
      "text": "Picard, R., Affective computing. MIT press, 2000. ",
      "doi": "10.5555/265013"
    },
    {
      "text": "Poh, M., McDuff, D., and Picard, R. Advancements in noncontact, multiparameter physiological measurements using a webcam. IEEE T BIO-MED ENG, 58, 1 (2011), 7--11.",
      "doi": ""
    },
    {
      "text": "Puri, C., Olson, L., Pavlidis, I., Levine, J., and Starren, J. StressCam: non-contact measurement of users' emotional states through thermal imaging. In Proc of CHI '05.  ",
      "doi": "10.1145/1056808.1057007"
    },
    {
      "text": "Ulyanov, S. and Tuchin, V., Pulse-wave monitoring by means of focused laser beams scattered by skin surface and membranes. In OE/LASE'93: Optics, ElectroOptics, & Laser Applications in Science & Engineering. International Society for Optics and Photonics, (1993), 160-167.",
      "doi": ""
    },
    {
      "text": "Yun, C., Shastri, D., Pavlidis, I. and Deng, Z., O'game, can you feel my frustration?: Improving user's gaming experience via Stresscam. In Proc of CHI '09.  ",
      "doi": "10.1145/1518701.1519036"
    }
  ]
}