{
  "doi": "10.1145/2858036.2858150",
  "title": "TimeFork: Interactive Prediction of Time Series",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "5409-5420",
  "year": 2016,
  "badges": [],
  "abstract": "We present TimeFork, an interactive prediction technique to support users predicting the future of time-series data, such as in financial, scientific, or medical domains. TimeFork combines visual representations of multiple time series with prediction information generated by computational models. Using this method, analysts engage in a back-and-forth dialogue with the computational model by alternating between manually predicting future changes through interaction and letting the model automatically determine the most likely outcomes, to eventually come to a common prediction using the model. This computer-supported prediction approach allows for harnessing the user's knowledge of factors influencing future behavior, as well as sophisticated computational models drawing on past performance. To validate the TimeFork technique, we conducted a user study in a stock market prediction game. We present evidence of improved performance for participants using TimeFork compared to fully manual or fully automatic predictions, and characterize qualitative usage patterns observed during the user study.",
  "authors": [
    {
      "name": "Sriram Karthik Badam",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "86158812657",
      "orcid": "missing"
    },
    {
      "name": "Jieqiong Zhao",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021924",
      "orcid": "missing"
    },
    {
      "name": "Shivalik Sen",
      "institution": "Birla Institute of Technology and Science, Goa, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021032",
      "orcid": "missing"
    },
    {
      "name": "Niklas Elmqvist",
      "institution": "University of Maryland, College Park, MD, USA",
      "img": "/do/10.1145/contrib-81100015408/rel-imgonly/niklas_elmqvist_-_2019.jpg",
      "acmid": "81100015408",
      "orcid": "0000-0001-5805-5301"
    },
    {
      "name": "David Ebert",
      "institution": "Purdue University, West Lafayette, IN, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100113675",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Heather Arthur. 2013. Brain Node.js Library. (2013). https://www.npmjs.com/package/brain, accessed December 2015.",
      "doi": ""
    },
    {
      "text": "Guilherme A. Barreto. 2007. Time series prediction with the self-organizing map: A review. In Perspectives of Neural-Symbolic Integration. Springer, 135-158.",
      "doi": ""
    },
    {
      "text": "Johan Bollen, Huina Mao, and Xiaojun Zeng. 2011. Twitter mood predicts the stock market. Journal of Computational Science 2, 1 (2011), 1-8.",
      "doi": ""
    },
    {
      "text": "John Bollinger. 2001. Bollinger On Bollinger Band. (2001).",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3 : Data-Driven Documents. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2301-2309.  ",
      "doi": "10.1109/TVCG.2011.185"
    },
    {
      "text": "Paolo Buono, Aleks Aris, Catherine Plaisant, Amir Khella, and Ben Shneiderman. 2005. Interactive pattern search in time series. In Proceedings of SPIE Electronic Imaging. 175-186.",
      "doi": ""
    },
    {
      "text": "Paolo Buono, Catherine Plaisant, Adalberto Simeone, Aleks Aris, Ben Shneiderman, Galit Shmueli, and Wolfgang Jank. 2007. Similarity-based forecasting with simultaneous previews: A river plot interface for time series forecasting. In Proceedings of the International Conference on Information Visualization. 191-196.  ",
      "doi": "10.1109/IV.2007.101"
    },
    {
      "text": "Philip K. Chan and Matthew V. Mahoney. 2005. Modeling multiple time series for anomaly detection. In Proceedings of the IEEE International Conference on Data Mining. 90-97.  ",
      "doi": "10.1109/ICDM.2005.101"
    },
    {
      "text": "Bill Chiu, Eamonn Keogh, and Stefano Lonardi. 2003. Probabilistic discovery of time series motifs. In Proceedings of the ACM International Conference on Knowledge Discovery and Data Mining. 493-498.  ",
      "doi": "10.1145/956750.956808"
    },
    {
      "text": "Herbert H Clark. 1973. The language-as-fixed-effect fallacy: A critique of language statistics in psychological research. Journal of verbal learning and verbal behavior 12, 4 (1973), 335-359.",
      "doi": ""
    },
    {
      "text": "Nick Desaulniers. 2013. Historic Node.js Library. (2013). https://www.npmjs.com/package/historic, accessed December 2015.",
      "doi": ""
    },
    {
      "text": "Alex Endert, Patrick Fiaux, and Chris North. 2012. Semantic interaction for visual text analytics. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 473-482.  ",
      "doi": "10.1145/2207676.2207741"
    },
    {
      "text": "Tak-chung Fu. 2011. A review on time series data mining. Engineering Applications of Artificial Intelligence 24, 1 (2011), 164-181.  ",
      "doi": "10.1016/j.engappai.2010.09.007"
    },
    {
      "text": "Tak-chung Fu, Fu-lai Chung, Ka-yan Kwok, and Chak-man Ng. 2008. Stock time series visualization based on data point importance. Engineering Applications of Artificial Intelligence 21, 8 (2008), 1217-1232.  ",
      "doi": "10.1016/j.engappai.2008.01.005"
    },
    {
      "text": "Spence Green, Jeffrey Heer, and Christopher D Manning. 2013. The efficacy of human post-editing for language translation. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 439-448.  ",
      "doi": "10.1145/2470654.2470718"
    },
    {
      "text": "Ming Hao, Halldor Janetzko, Ratnesh Sharma, Umeshwar Dayal, Daniel Keim, and Malu Castellanos. 2009. Poster: visual prediction of time series. In Poster Compendium of the IEEE Symposium on Visual Analytics Science and Technology.",
      "doi": ""
    },
    {
      "text": "Ming C. Hao, Umeshwar Dayal, Daniel A. Keim, and Tobias Schreck. 2007. Multi-resolution techniques for visual exploration of large time-series data. In Proceedings of the Joint Eurographics / IEEE VGTC Conference on Visualization. 27-34.  ",
      "doi": "10.5555/2384179.2384183"
    },
    {
      "text": "Ming C. Hao, Halldor Janetzko, Sebastian Mittelstadt, Water Hill, Umeshwar Dayal, Daniel A. Keim, Manish Marwah, and Ratnesh K. Sharma. 2011. A Visual Analytics Approach for Peak-Preserving Prediction of Large Seasonal Time Series. In Computer Graphics Forum, Vol. 30. 691-700.  ",
      "doi": "10.1111/j.1467-8659.2011.01918.x"
    },
    {
      "text": "Jeffrey Heer, Michael Bostock, and Vadim Ogievetsky. 2010. A tour through the visualization zoo. Communications of the ACM 53, 6 (2010), 59-67.  ",
      "doi": "10.1145/1743546.1743567"
    },
    {
      "text": "Jeffrey Heer, Nicholas Kong, and Maneesh Agrawala. 2009. Sizing the horizon: the effects of chart size and layering on the graphical perception of time series visualizations. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 1303-1312.  ",
      "doi": "10.1145/1518701.1518897"
    },
    {
      "text": "Magnus Lie Hetland and Pål Sætrom. 2005. Evolutionary rule mining in time series databases. Machine Learning 58, 2--3 (2005), 107-125.  ",
      "doi": "10.1007/s10994-005-5823-8"
    },
    {
      "text": "Harry Hochheiser and Ben Shneiderman. 2004. Dynamic query tools for time series data sets: timebox widgets for interactive exploration. Information Visualization 3, 1 (2004), 1-18.  ",
      "doi": "10.1145/993176.993177"
    },
    {
      "text": "Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 159-166.  ",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Eric J. Horvitz. 2007. Reflections on challenges and promises of mixed-initiative interaction. AI Magazine 28, 2 (2007), 3.",
      "doi": ""
    },
    {
      "text": "Waqas Javed, Bryan McDonnel, and Niklas Elmqvist. 2010. Graphical perception of multiple time series. IEEE Transactions on Visualization and Computer Graphics 16, 6 (2010), 927-934.  ",
      "doi": "10.1109/TVCG.2010.162"
    },
    {
      "text": "Young-Seon Jeong, Myong K. Jeong, and Olufemi A. Omitaomu. 2011. Weighted dynamic time warping for time series classification. Pattern Recognition 44, 9 (2011), 2231-2240.  ",
      "doi": "10.1016/j.patcog.2010.09.022"
    },
    {
      "text": "Ashish Kapoor, Bongshin Lee, Desney S. Tan, and Eric Horvitz. 2012. Performance and Preferences: Interactive Refinement of Machine Learning Procedures. In Proceedings of the AAAI Conference on Artificial Intelligence. ",
      "doi": "10.5555/2900929.2900952"
    },
    {
      "text": "Daniel Keim, Florian Mansmann, Jorn Schneidewind, and Hartmut Ziegler. 2006. Challenges in visual data analysis. In Proceedings of the International Conference on Information Visualization. 9-16.  ",
      "doi": "10.1109/IV.2006.31"
    },
    {
      "text": "Teuvo Kohonen. 2001. Self-Organizing Maps. Springer. ",
      "doi": "10.5555/558021"
    },
    {
      "text": "T. Warren Liao. 2005. Clustering of time series data--a survey. Pattern Recognition 38, 11 (2005), 1857-1874.  ",
      "doi": "10.1016/j.patcog.2005.01.025"
    },
    {
      "text": "Jessica Lin, Eamonn Keogh, and Stefano Lonardi. 2005. Visualizing and discovering non-trivial patterns in large time series databases. Information Visualization 4, 2 (2005), 61-82.  ",
      "doi": "10.1057/palgrave.ivs.9500089"
    },
    {
      "text": "Andrew C. Lorenc. 1986. Analysis methods for numerical weather prediction. Royal Meteorological Society, Quarterly Journal 112 (1986), 1177-1194.",
      "doi": ""
    },
    {
      "text": "Junshui Ma and Simon Perkins. 2003. Online novelty detection on temporal sequences. In Proceedings of the ACM International Conference on Knowledge Discovery and Data Mining. 613-618.  ",
      "doi": "10.1145/956750.956828"
    },
    {
      "text": "Abish Malik, Ross Maciejewski, Yun Jang, Whitney Huang, Niklas Elmqvist, and David Ebert. 2012. A Correlative Analysis Process in a Visual Analytics Environment. In Proceedings of the IEEE Conference on Visual Analytics Science and Technology. 33-42.  ",
      "doi": "10.1109/VAST.2012.6400491"
    },
    {
      "text": "Andrew Vande Moere. 2004. Time-varying data visualization using information flocking boids. In Proceedings of the IEEE Symposium on Information Visualization. 97-104.  ",
      "doi": "10.5555/1038262.1038788"
    },
    {
      "text": "Steve Nison. 2001. Japanese candlestick charting techniques: a contemporary guide to the ancient investment techniques of the Far East. Penguin.",
      "doi": ""
    },
    {
      "text": "Ajoy K. Palit and Dobrivoje Popovic. 2006. Computational intelligence in time series forecasting: theory and engineering applications. Springer Science & Business Media. ",
      "doi": "10.5555/1204884"
    },
    {
      "text": "Predictive Analytics for Movie Openings 2013. VAST Mini Challenge 1: Visualize the box office. (2013). http://vacommunity.org/VAST+Challenge+2013, accessed December 2015.",
      "doi": ""
    },
    {
      "text": "Glenn Proctor and Chris Winter. 1998. Information flocking: Data visualisation in virtual worlds using emergent behaviours. In Virtual Worlds. Springer, 168-176.",
      "doi": ""
    },
    {
      "text": "Tobias Schreck, Tatiana Tekusova, Jorn Kohlhammer, and Dieter Fellner. 2007. Trajectory-based visual analysis of large financial time series data. ACM SIGKDD Explorations Newsletter 9, 2 (2007), 30-37.  ",
      "doi": "10.1145/1345448.1345454"
    },
    {
      "text": "Shobhit Seth. 2014. The Best Technical Analysis Trading Software. (2014). http://www.investopedia. com/articles/active-trading/121014/best-technical-analysis-trading-software.asp?header_alt=c, accessed December 2015.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 1996. The eyes have it: A task by data type taxonomy for information visualizations. In Proceedings of the IEEE Symposium on Visual Languages. 336-343. ",
      "doi": "10.5555/832277.834354"
    },
    {
      "text": "Ben Shneiderman and Pattie Maes. 1997. Direct manipulation vs. interface agents: A debate. Interactions 4, 6 (1997), 42-61.  ",
      "doi": "10.1145/267505.267514"
    },
    {
      "text": "K. Srinivas, B. Kavihta Rani, and A. Govrdhan. 2010. Applications of data mining techniques in healthcare and prediction of heart attacks. International Journal on Computer Science and Engineering 2, 02 (2010), 250-255.",
      "doi": ""
    },
    {
      "text": "Yoshiki Tanaka, Kazuhisa Iwamoto, and Kuniaki Uehara. 2005. Discovery of time-series motif from multi-dimensional data based on MDL principle. Machine Learning 58, 2 (2005), 269-300.  ",
      "doi": "10.1007/s10994-005-5829-2"
    },
    {
      "text": "James J. Thomas and Kristin A. Cook. 2005. Illuminating the Path: The Research and Development Agenda for Visual Analytics. IEEE Computer Society.",
      "doi": ""
    },
    {
      "text": "Jarke J. Van Wijk and Edward R. Van Selow. 1999. Cluster and calendar based visualization of time series data. In Proceedings of IEEE Symposium on Information Visualization. 4-9. ",
      "doi": "10.5555/857189.857665"
    },
    {
      "text": "K. R. Venugopal, K. G. Srinivasa, and L. M. Patnaik. 2009. Fuzzy Based Neuro - Genetic Algorithm for Stock Market Prediction. In Soft Computing for Data Mining Applications. 139-166.",
      "doi": ""
    },
    {
      "text": "Marc Weber, Marc Alexa, and Wolfgang Muller. 2001. Visualizing Time-Series on Spirals. In Proceedings of IEEE Symposium on Information Visualization. 7-14. ",
      "doi": "10.5555/580582.857719"
    },
    {
      "text": "Li Wei, Nitin Kumar, Venkata Lolla, Eamonn J. Keogh, Stefano Lonardi, and Chotirat Ratanamahatana. 2005. Assumption-Free Anomaly Detection in Time Series. In Proceedings of the International Conference on Scientific and Statistical Database Management. 237-242. ",
      "doi": "10.5555/1116877.1116907"
    },
    {
      "text": "Michael Zasso. 2014. ML-SOM Node.js Library. (2014). https://www.npmjs.com/package/ml-som, accessed December 2015.",
      "doi": ""
    },
    {
      "text": "Jian Zhao, Fanny Chevalier, and Ravin Balakrishnan. 2011a. KronoMiner: using multi-foci navigation for the visual exploration of time-series data. In Proceedings of the ACM Conference on Human Factors in Computing Systems. 1737-1746.  ",
      "doi": "10.1145/1978942.1979195"
    },
    {
      "text": "Jian Zhao, Fanny Chevalier, Emmanuel Pietriga, and Ravin Balakrishnan. 2011b. Exploratory analysis of time-series with Chrono Lenses. IEEE Transactions on Visualization and Computer Graphics 17, 12 (2011), 2422-2431.  ",
      "doi": "10.1109/TVCG.2011.195"
    }
  ]
}