{
  "doi": "10.1145/2858036.2858397",
  "title": "GenomiX: A Novel Interaction Tool for Self-Exploration of Personal Genomic Data",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "661-672",
  "year": 2016,
  "badges": [],
  "abstract": "The increase in the availability of personal genomic data to lay consumers using online services poses a challenge to HCI researchers: such data are complex and sensitive, involve multiple dimensions of uncertainty, and can have substantial implications for individuals' well-being. Personal genomic data are also unique because unlike other personal data, which constantly change, genomic data are largely stable during a person's lifetime; it is their interpretation and implications that change over time as new medical research exposes relationships between genes and health. In this paper, we present a novel tool for self exploration of personal genomic data. To evaluate the usability and utility of the tool, we conducted the first study of a genome interpretation tool to date, in which users used their own personal genomic data. We conclude by offering design implications for the development of interactive personal genomic reports.",
  "authors": [
    {
      "name": "Orit Shaer",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/do/10.1145/contrib-81100216740/rel-imgonly/orit.jpg",
      "acmid": "81100216740",
      "orcid": "missing"
    },
    {
      "name": "Oded Nov",
      "institution": "New York University, New York City, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81339520089",
      "orcid": "missing"
    },
    {
      "name": "Johanna Okerlund",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658641092",
      "orcid": "missing"
    },
    {
      "name": "Martina Balestra",
      "institution": "New York University, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987027",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth Stowell",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021483",
      "orcid": "missing"
    },
    {
      "name": "Lauren Westendorf",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658984700",
      "orcid": "missing"
    },
    {
      "name": "Christina Pollalis",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020002",
      "orcid": "missing"
    },
    {
      "name": "Jasmine Davis",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658639225",
      "orcid": "missing"
    },
    {
      "name": "Liliana Westort",
      "institution": "Wellesley College, Wellesley, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659019490",
      "orcid": "missing"
    },
    {
      "name": "Madeleine Ball",
      "institution": "PersonalGenomes.org, Brookline, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658987587",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Peter W Airasian, Kathleen A Cruikshank, Richard E Mayer, PR Pintrich, James Raths and Merlin C Wittrock. 2001. A taxonomy for learning, teaching, and assessing: A revision of Bloom's Taxonomy of Educational Objectives. Anderson LW and Krathwohl DR. NY: Addison Wesley Longmann.",
      "doi": ""
    },
    {
      "text": "Madeleine P Ball, Jason R Bobe, Michael F Chou, Tom Clegg, Preston W Estep, Jeantine E Lunshof, Ward Vandewege, A Zaranek and George M Church. 2014. Harvard Personal Genome Project: lessons from participatory public research. Genome Med, 6 (2). 10.",
      "doi": ""
    },
    {
      "text": "Madeleine P Ball, Joseph V Thakuria, Alexander Wait Zaranek, Tom Clegg, Abraham M Rosenbaum, Xiaodi Wu, Misha Angrist, Jong Bhak, Jason Bobe and Matthew J Callow. 2012. A public resource facilitating clinical use of genomes. Proceedings of the National Academy of Sciences, 109 (30). 11920--11927.",
      "doi": ""
    },
    {
      "text": "Florian Block, Michael S Horn, Brenda Caldwell Phillips, Judy Diamond, E Margaret Evans and Chia Shen. 2012. The deeptree exhibit: Visualizing the tree of life to facilitate informal learning. Visualization and Computer Graphics, IEEE Transactions on, 18 (12). 2789--2798.  ",
      "doi": "10.1109/TVCG.2012.272"
    },
    {
      "text": "Carole Cadwalladr. 2013. What happened when I had my genome sequenced The Guardian.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A. Kientz. 2015. SleepTight: low-burden, self-monitoring technology for capturing and reflecting on sleep behaviors. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 121--132.  ",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "George M Church. 2005. The personal genome project. Molecular Systems Biology, 1 (1).",
      "doi": ""
    },
    {
      "text": "Kevin Davies. 2010. The $1,000 genome: the revolution in DNA sequencing and the new era of personalized medicine. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A lived informatics model of personal informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 731--742.  ",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "FDA. 2015. Use of Electronic Informed Consent in Clinical Investigations Questions and Answers Guidance for Industry DRAFT GUIDANCE, HHS/FDA.",
      "doi": ""
    },
    {
      "text": "Miriam Greis, Thorsten Ohler, Niels Henze and Albrecht Schmidt. 2015. Investigating Representation Alternatives for Communicating Uncertainty to Nonexperts. in Human-Computer Interaction-INTERACT 2015, Springer, 256--263.",
      "doi": ""
    },
    {
      "text": "Henning Griethe and Heidrun Schumann. 2006. Visualizing uncertainty for improved decision making. in, (SimVis.",
      "doi": ""
    },
    {
      "text": "National Human Genome Research Institute. 2015. Cost Per Genome.",
      "doi": ""
    },
    {
      "text": "Ohad Inbar. 2007. Graphical representation of statistical information in situations of judgment and decision-making. In Proceedings of 14th European Conference on Cognitive Ergonomics (ECCE '07), 265268.  ",
      "doi": "10.1145/1362550.1362605"
    },
    {
      "text": "Stacey Kuznetsov, Aniket Kittur and Eric Paulos. 2015. Biological Citizen Publics: Personal Genetics as a Site of Public Engagement with Science. in Proceedings of the 2015 ACM SIGCHI Conference on Creativity and Cognition, 303--312.  ",
      "doi": "10.1145/2757226.2757246"
    },
    {
      "text": "Christina R Lachance, Lori AH Erby, Beth M Ford, Vincent C Allen and Kimberly A Kaphingst. 2010. Informational content, literacy demands, and usability of websites offering health-related genetic tests directly to consumers. Genetics in Medicine, 12 (5). 304--312.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Junsung Kim, Jodi Forlizzi, and Sara Kiesler. 2015. Personalization revisited: a reflective approach helps people better personalize health services and motivates them to increase physical activity. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 743--754.  ",
      "doi": "10.1145/2750858.2807552"
    },
    {
      "text": "Ian Li, Anind Dey, Jodi Forlizzi, Kristina Höök and Yevgeniy Medynskiy. 2011. Personal informatics and HCI: design, theory, and social implications. in CHI'11 Extended Abstracts on Human Factors in Computing Systems, 2417--2420.  ",
      "doi": "10.1145/1979742.1979573"
    },
    {
      "text": "Jeantine E Lunshof, Ruth Chadwick, Daniel B Vorhaus and George M Church. 2008. From genetic privacy to open consent. Nature Reviews Genetics, 9 (5). 406--411.",
      "doi": ""
    },
    {
      "text": "Alan M. MacEachren, Anthony Robinson, Susan Hopper, Steven Gardner, Robert Murray, Mark Gahegan, and Elisabeth Hetzler. 2005. Visualizing geospatial information uncertainty: What we know and what we need to know. Cartography and Geographic Information Science, 32 (3). 139--160.",
      "doi": ""
    },
    {
      "text": "Gordon E Moore. 1998. Cramming more components onto integrated circuits. Proceedings of the IEEE, 86 (1). 82--85.",
      "doi": ""
    },
    {
      "text": "Limor Nadav-Greenberg, Susan L Joslyn and Meng U Taing. 2008. The effect of uncertainty visualizations on decision making in weather forecasting. Journal of Cognitive Engineering and Decision Making, 2 (1). 2447.",
      "doi": ""
    },
    {
      "text": "Jenny E Ostergren, Michele C Gornick, Deanna Alexis Carere, Sarah S Kalia, Wendy R Uhlmann, Mack T Ruffin, Joanna L Mountain, Robert C Green, J Scott Roberts and PGen Study Group. 2015. How Well Do Customers of Direct-to-Consumer Personal Genomic Testing Services Comprehend Genetic Test Results? Findings from the Impact of Personal Genomics Study. Public health genomics, 18 (4). 216--224.",
      "doi": ""
    },
    {
      "text": "Personal Genome Project. GET-Evidence. Retrieved September 24, 2015 from http://evidence.pgphms.org/about",
      "doi": ""
    },
    {
      "text": "Personal Genome Project. Personal Genomes. Retrieved September 24, 2015 from http://personalgenomes.org/",
      "doi": ""
    },
    {
      "text": "Everett M Rogers. 2010. Diffusion of innovations. Simon and Schuster.",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14). ACM, NY, NY, USA, 11631172.  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Purvi Saraiya, Chris North and Karen Duca. 2005 An insight-based methodology for evaluating bioinformatics visualizations. Visualization and Computer Graphics, IEEE Transactions on, 11 (4). 443--456.  ",
      "doi": "10.1109/TVCG.2005.53"
    },
    {
      "text": "Bertrand Schneider, Megan Strait, Laurence Muller, Sarah Elfenbein, Orit Shaer and Chia Shen. 2012. Phylo-Genie: engaging students in collaborative 'treethinking' through tabletop techniques. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 3071--3080.  ",
      "doi": "10.1145/2207676.2208720"
    },
    {
      "text": "Orit Shaer, Guy Kol, Megan Strait, Chloe Fan, Catherine Grevet and Sarah Elfenbein. 2010. G-nome surfer: a tabletop interface for collaborative exploration of genomic data. in Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 1427--1436.  ",
      "doi": "10.1145/1753326.1753539"
    },
    {
      "text": "Orit Shaer, Ali Mazalek, Brygg Ullmer and Miriam Konkel. 2013. From big data to insights: opportunities and challenges for TEI in genomics. in Proceedings of the 7th International Conference on Tangible, Embedded and Embodied Interaction, 109--116.  ",
      "doi": "10.1145/2460625.2460642"
    },
    {
      "text": "Orit Shaer, Oded Nov, Johanna Okerlund, Martina Balestra, Elizabeth Stowell, Laura Ascher, Joanna Bi, Claire Schlenker and Madeleine Ball. 2015. Informing the Design of Direct-to-Consumer Interactive Personal Genomics Reports. Journal of medical Internet research, 17 (6).",
      "doi": ""
    },
    {
      "text": "Meredith Skeels, Bongshin Lee, Greg Smith, and George G. Robertson. 2009. Revealing uncertainty for information visualization. Information Visualization, 9 (1). 70--81.  ",
      "doi": "10.1057/ivs.2009.1"
    },
    {
      "text": "Barry N. Taylor and Chris E. Kuyatt. 1994. Guidelines for Evaluating and Expressing the Uncertainty of NIST Measurement Results. DIANE Publishing.",
      "doi": ""
    },
    {
      "text": "Judi Thomson, Elisabeth Hetzler, Alan MacEachren, Mark Gahegan, and Misha Pavel. 2005. Typology for visualizing uncertainty. In Proceedings of the IS&T/SPIE Symposium on Electronic Imaging, Conference on Visualization and Data Analysis (SPIE '05), 146--157.",
      "doi": ""
    },
    {
      "text": "Amos Tversky and Daniel Kahneman. 1974. Science, 185 (4157). 1124--1131.",
      "doi": ""
    }
  ]
}