{
  "doi": "10.1145/2858036.2858482",
  "title": "Anti-Solutionist Strategies: Seriously Silly Design Fiction",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "4968-4978",
  "year": 2016,
  "badges": [],
  "abstract": "Much of the academic and commercial work which seeks to innovate around technology has been dismissed as \"solutionist\" because it solves problems that don't exist or ignores the complexity of personal, political and environmental issues. This paper traces the \"solutionism\" critique to its origins in city planning and highlights the original concern with imaging and representation in the design process. It is increasingly cheap and easy to create compelling and seductive images of concept designs, which sell solutions and presume problems. We consider a range of strategies, which explicitly reject the search for \"solutions\". These include design fiction and critical design but also less well-known techniques, which aim for unuseless, questionable and silly designs. We present two examples of \"magic machine\" workshops where participants are encouraged to reject realistic premises for possible technological interventions and create absurd propositions from lo-fi materials. We argue that such practices may help researchers resist the impulse towards solutionism and suggest that attention to representation during the ideation process is a key strategy for this.",
  "authors": [
    {
      "name": "Mark Blythe",
      "institution": "Northumbria University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100208849",
      "orcid": "missing"
    },
    {
      "name": "Kristina Andersen",
      "institution": "STEIM, Amsterdam, Netherlands",
      "img": "/do/10.1145/contrib-81350575388/rel-imgonly/20151105_dw_rbma_paris_12168.jpg",
      "acmid": "81350575388",
      "orcid": "missing"
    },
    {
      "name": "Rachel Clarke",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/do/10.1145/contrib-81501686180/rel-imgonly/people-rachel-clarke-medium.jpg",
      "acmid": "81501686180",
      "orcid": "missing"
    },
    {
      "name": "Peter Wright",
      "institution": "Newcastle University, Newcastle upon Tyne, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332536218",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Andersen K. Making Magic Machines, 10th European Academy of Design Conference Crafting the Future. 2013.",
      "doi": ""
    },
    {
      "text": "Andersen, K., The Deliberate Cargocult, in Proc. of DIS2014, 2014.  ",
      "doi": "10.1145/2598510.2598596"
    },
    {
      "text": "Andersen, K., Wilde, D., Circles and Props - Making Unknown Technology, interactions, 2012/5/1 p.60--65 ACM 2012  ",
      "doi": "10.1145/2168931.2168944"
    },
    {
      "text": "Barad, K. \"Matter feels, converses, suffers, desires, yearns and remembers. Interview with Karen Barad.\" in New materialism: Interviews and cartographies (2012): 48--70. Open Humanities Press, 2012",
      "doi": ""
    },
    {
      "text": "Bardzell, J., and Bardzell, S. (2013). What is \"critical\" about critical design? Proc. of CHI'2013. ACM:  ",
      "doi": "10.1145/2470654.2466451"
    },
    {
      "text": "Bardzell J., Bardzell S., and Stolterman E., (2014). Reading critical designs: supporting reasoned interpretations of critical design. In Proc. of (CHI '14).  ",
      "doi": "10.1145/2556288.2557137"
    },
    {
      "text": "Bleecker, J.( 2009). \"Design Fiction: A Short Essay on Design, Science, Fact and Fiction\". webedition pdf",
      "doi": ""
    },
    {
      "text": "Blythe M., and Monk A. 2002. Notes towards an ethnography of domestic technology. In Proceedings of the 4th conference on Designing interactive systems: processes, practices, methods, and techniques (DIS '02)  ",
      "doi": "10.1145/778712.778750"
    },
    {
      "text": "Blythe M. (2014) Research through design fiction: narrative in real and imaginary abstracts. In Proc of (CHI '14). ACM, NY, NY, USA, 703--712  ",
      "doi": "10.1145/2556288.2557098"
    },
    {
      "text": "Blythe M., Steane J., Roe J., and Oliver C. 2015. Solutionism, the Game: Design Fictions for Positive Aging. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3849--3858  ",
      "doi": "10.1145/2702123.2702491"
    },
    {
      "text": "Blythe M., Yauner F., Rodgers P., (2015) The Context of Critical Design: Exhibits, Social Media and Auction Houses. The Design Journal. 28 Apr 2015 pp 83--105",
      "doi": ""
    },
    {
      "text": "Boal, A. Games For Actors and Non-Actors. Routledge, London, 1992.",
      "doi": ""
    },
    {
      "text": "Branzi A (2006) No Stop City. Archizoom Associati.Librairie de Architecture et de la Ville.",
      "doi": ""
    },
    {
      "text": "Dewey, J. Art as Experience. NY. Putnam, 1958.",
      "doi": ""
    },
    {
      "text": "DiSalvo,C., Lukens, J., Lodato, T., Jenkins, T. & Kim, T. 2014. Making public things: how HCI design can express matters of concern. In Proc. CHI '14. ACM, NY, NY, USA, 2397--2406  ",
      "doi": "10.1145/2556288.2557359"
    },
    {
      "text": "Dobbins M. (2009) Urban Design and People. John Wiley and Sons",
      "doi": ""
    },
    {
      "text": "Dunne A., and Raby F. (2013). Speculative Everything: Design, Fiction, and Social Dreaming. The MIT Press. ",
      "doi": "10.5555/2613526"
    },
    {
      "text": "Ellison E. Dangerous Visions. SF Masterworks Gollancz",
      "doi": ""
    },
    {
      "text": "Foverskov, M. and Binder, T. Rehearsing the Future: in and out of Scenarios in a Reflective Practicum. In Proc. of the Nordic Design Research Conference (2009).",
      "doi": ""
    },
    {
      "text": "Frank. A. 2010. Letting Stories Breathe: A socio-narratology. University of Chicago Press.",
      "doi": ""
    },
    {
      "text": "Greenfield A. (2013). Agains the Smart City: The City is Here for You to Use. Kindle edition.",
      "doi": ""
    },
    {
      "text": "Greenfield A. (2015) Uber, or: the technics and politics of socially corrosive mobility. https://speedbird.wordpress.com/2015/06/29/uber-or-the-technics-and-politics-of-socially-corrosive-mobility/",
      "doi": ""
    },
    {
      "text": "Hamman, K., Mellem tænderne, Gyldendal, 1992.",
      "doi": ""
    },
    {
      "text": "Hougaard, A. 2015. Architectural drawing as premise for PhD project. In: Proceedings of the 2nd Biennial Research Through Design Conference, 25--27 March 2015, Cambridge, UK, Article 27. DOI: 10.6084/m9.figshare.1328009.",
      "doi": ""
    },
    {
      "text": "Jacobs J.,(1992) The Life and Death of Great American Cities. Vintage Books NY.",
      "doi": ""
    },
    {
      "text": "Kirby D. (2010) The Future is now: Diegetic Prototypes and the Role of Popular Films in Generating Real-World Technological Development. Social Studies of Science. Social Studies of Science February 2010 vol. 40 no. 1 41--70",
      "doi": ""
    },
    {
      "text": "Kirsh, D. 'How Marking in Dance Constitutes Thinking with the Body', in Versus, Quaderni di Studi Semiotici: Bompiani, Milan, Vols 113-15, 2011.",
      "doi": ""
    },
    {
      "text": "Light, A., Simpson, G. and Weaver, L., Healey, P. 2009. \"Geezers,Turbines, Fantasy Personas: Making the Everyday into the Future\" In Proc.(C&C '09). ACM, NY, NY, USA, 39--48.  ",
      "doi": "10.1145/1640233.1640243"
    },
    {
      "text": "Light, A. 2011. \"Democratising Technology: Inspiring Transformation with Design, Performance and Props\", In Proc. CHI '11. ACM, NY, NY, USA, 2239--2242  ",
      "doi": "10.1145/1978942.1979269"
    },
    {
      "text": "Latour B. 2004. \"Why Has Critique Run Out of Steam? From Matters of Fact to Matters of Concern.\" Critical Inquiry 30 (2): 225-248.",
      "doi": ""
    },
    {
      "text": "Morozov E. (2013) To Save Everything Click Here: Technology, Solutionism and the Urge to Fix Problems That Don't Exist. Allen Lane Penguin Books.",
      "doi": ""
    },
    {
      "text": "Prado L (2014) Privilege and Oppression: Towards a Feminist Speculative Design. http://www.drs2014.org/media/654480/0350-file1.pdf Prado de O.",
      "doi": ""
    },
    {
      "text": "Martins, L. & Oliveira, P. (2014) Questioning the \"critical\" in Speculative & Critical Design. Medium. Available at: https://medium.com/designing-the-future/5a355cac2ca4",
      "doi": ""
    },
    {
      "text": "Ormerod T, Ball L, Dix A, and Sas C. 2007. HCI and creative problem-solving at Lancaster. In Proceedings of the 21st British HCI Group Annual Conference on People and Computers: HCI...but not as we know it - Volume ",
      "doi": "10.5555/1531407.1531461"
    },
    {
      "text": "Samson, A., Andersen, K. Tassophonics: Nanotechnology as the Magical Unknown, in Proc. of the HCI International Conference. Springer (2013).",
      "doi": ""
    },
    {
      "text": "Shklovsky, V. (1917). Art as Technique. In Russian Formalist Criticism: Four Essays, 1965. trans. Lee T. Lemon and Marion J. Reis. University of Nebraska Press.",
      "doi": ""
    },
    {
      "text": "Sparke P. (1988) Design in Italy 1870 to the present. Beville Press. NY",
      "doi": ""
    },
    {
      "text": "Sterling B. (2005) Shaping Things. MIT Press. Cambridge Massachusetts",
      "doi": ""
    },
    {
      "text": "Vines J., Blythe M., Lindsay S., Dunphy P., Monk A., and Olivier, P. (2012). Questionable concepts: critique as resource for designing with eighty somethings. In Proc of CHI '12.  ",
      "doi": "10.1145/2207676.2208567"
    },
    {
      "text": "Vonnegut K (1992) Breakfast of Champions. Vintage Classics",
      "doi": ""
    },
    {
      "text": "Wallace, D.F. (1988) E Unibus Plurum. In A Supposedly Fun Thing That I will Never Do Again: Essays and Arguments.",
      "doi": ""
    }
  ]
}