{
  "doi": "10.1145/2858036.2858188",
  "title": "The Ethics of Unaware Participation in Public Interventions",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "803-814",
  "year": 2016,
  "badges": [],
  "abstract": "Interaction design is increasingly merging with designing our everyday environment. Trialing and evaluating such designs in an ecologically valid way often requires that they be installed in public space without clearly communicating their nature as trials. This leads to unaware participation in what, in fact, is an experimental intervention. This article focuses on the ethical considerations that arise from doing, and studying, interventions in public space, including but not restricted to interactive installations. It argues that under certain circumstances, such as when the known risks are low and the intervention presents sufficient support for avoiding involvement, active participation can be considered implicit consent. We revisit some example interventions from literature and press to scrutinize the potential risks and pitfalls associated to unaware participation.",
  "authors": [
    {
      "name": "Annika Waern",
      "institution": "Uppsala University, Uppsala, Sweden",
      "img": "/do/10.1145/contrib-81100020339/rel-imgonly/282023_3annika-waern.jpg",
      "acmid": "81100020339",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AOIR. 2012. Ethical decision-making and Internet research 2.0. Recommendations from the aoir ethics working committee. Retrieved July 21st 2015 from http://aoir.org/reports/ethics2.pdf.",
      "doi": ""
    },
    {
      "text": "APA. 2010. Ethical principles of psychologists and code of conduct. Retrieved July 21st 2015 from http://www.apa.org/ethics/code/principles.pdf",
      "doi": ""
    },
    {
      "text": "ASA. 1999. Code of ethics, and policies and procedures. Retrieved July 21st 2015 from http://www.asanet.org/images/asa/docs/pdf/CodeofEthi cs.pdf",
      "doi": ""
    },
    {
      "text": "Steve Benford, Andy Crabtree, Martin Flintham, Adam Drozd, Rob Anastasi, Mark Paxton, Nick Tandavanitj, Matt Adams, Ju Row-Farr. 2006. Can you see me now? ACM Transactions on Computer-Human Interaction (TOCHI), 13,1. 100--133.  ",
      "doi": "10.1145/1143518.1143522"
    },
    {
      "text": "Steve Benford, Andy Crabtree, Stuart Reeves, Jennifer Sheridan, Alan Dix, Martin Flintham, Adam Drozd. 2006. The frame of the game: blurring the boundary between fiction and reality in mobile experiences. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI'06) 427--436. ACM.  ",
      "doi": "10.1145/1124772.1124836"
    },
    {
      "text": "Steve Benford, Chris Greenhalgh, Gabriella Giannachi, Brendan Walker, Joel Marshall, Tom Rodden. 2012. Uncomfortable interactions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (pp. 2005--2014). ACM.  ",
      "doi": "10.1145/2207676.2208347"
    },
    {
      "text": "Claire Bishop. 2004. Antagonism and relational aesthetics. October 110. October Magazine, Ltd. and Massachusetts Institute of Technology 51--79.",
      "doi": ""
    },
    {
      "text": "Nicolas Bourriaud. 1998. Relational aesthetics. Dijon: Les presses du reel.",
      "doi": ""
    },
    {
      "text": "Harry Brignull and Yvonne Rogers. 2003. Enticing people to interact with large public displays in public spaces. Proceedings of INTERACT. Vol. 3.",
      "doi": ""
    },
    {
      "text": "The British psychological society. 2014. Code of human research ethics. 2014. Retrieved July 21st 2015 from http://www.bps.org.uk/system/files/Public%20files/inf 180_web.pdf",
      "doi": ""
    },
    {
      "text": "Oliver Brown, Petra Gemeinboeck, and Rob Saunders. The machine as autonomous performer. In Interactive Experience in the Digital Age. Springer US, 75--90.",
      "doi": ""
    },
    {
      "text": "Andy Crabtree, Alan Chamberlain, Rebecca Grinter, Matt Jones, Tom Rodden and Yvonne Rogers. 2013. Introduction to the Special Issue of \"The Turn to The Wild\". ACM Transactions of Computer-Human Interaction 20, 3, Article 13.  ",
      "doi": "10.1145/2491500.2491501"
    },
    {
      "text": "Sofia Curman. 2009. Anna Odell spelade sig själv. (eng. Anna Odell played herself) News clip, Dagens Nyheter. Retrieved September 6th from www.dn.se/kultur-noje/konst-form/anna-odell-speladesig-sjalv/",
      "doi": ""
    },
    {
      "text": "Marlene de Laine. 2000. Fieldwork participation & practice: Ethics & dilemmas in qualitative research. SAGE Publications Ltd, U.K.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rhilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: defining gamification. Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments. ACM. 9--15.  ",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Anthony Downey. 2009. An ethics of engagement: Collaborative art practices and the return of the ethnographer. Third Text 23.5: 593--603.",
      "doi": ""
    },
    {
      "text": "Anthony Downey. 2011. Geocentric Conundrums: Aesthetics and Ethics in Contemporary Art; Gemma Lloyd Interviews Anthony Downey. CAC Interviu 1617, 2010/2011: 53--60.",
      "doi": ""
    },
    {
      "text": "Catherine Driscoll and Melissa Gregg. 2010. My profile: The ethics of virtual ethnography. Emotion, Space and Society 3.1: 15--20.",
      "doi": ""
    },
    {
      "text": "David Eberhard. 2009. Överläkaren David Eberhard: Konstfackseleven borde klippa sig och skaffa sig ett jobb. (eng. The art student should get a haircut and a job) Newsmill. Retrieved September 6th from http://www.dn.se/sthlm/overlakaren-david-eberhardkonstfackseleven-borde-klippa-sig-och-skaffa-sig-ettjobb/",
      "doi": ""
    },
    {
      "text": "Ernest Edmonds, Bilda Zafer and Lizzie Muller. 2009. Artist, evaluator and curator: three viewpoints on interactive art, evaluation and audience experience. Digital Creativity 20, 3: 141--151.",
      "doi": ""
    },
    {
      "text": "European Court of Human Rights. 2002. European Convention on Human Rights. Council of Europe, Strasbourg.",
      "doi": ""
    },
    {
      "text": "Dion Hoe-Lian Goh, Rebecca P. Ang, Chei Sian Lee and Alton Y.K. Chua. 2011. Fight or Unite: Investigating Game Genres for Image Tagging. Journal of the American Society for Information Science and Technology 62, 7: 1311--1324.  ",
      "doi": "10.5555/2002147.2002150"
    },
    {
      "text": "Larissa Hjorth and Kristen Sharp. 2014. The art of ethnography: the aesthetics or ethics of participation? Visual Studies 29, 2: 128--135.",
      "doi": ""
    },
    {
      "text": "Giovanni Iachello. 2005. Privacy and proportionality: Adapting legal evaluation techniques to inform design in ubiquitous computing. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2005.  ",
      "doi": "10.1145/1054972.1054986"
    },
    {
      "text": "John Lofland, David A. Snow, Leon Anderson and Lyn H. Lofland. 2006. Analyzing social settings. Belmont, CA: Wadsworth Publishing Company.",
      "doi": ""
    },
    {
      "text": "Heidi A. McKee and James E. Porter. 2009. Playing a good game: Ethical issues in researching MMOGs and virtual worlds. International Journal of Internet Research Ethics, 2,1: 5--37.",
      "doi": ""
    },
    {
      "text": "Andrew Flood Mara, Liza Potts, and Gerianne Bartocci. 2013. The ethics of agile ethnography. Proceedings of the 31st ACM international conference on Design of communication. ACM, 2013.  ",
      "doi": "10.1145/2507065.2507080"
    },
    {
      "text": "McMillan, Donald, Alistair Morrison, and Matthew Chalmers. 2013. Categorised ethical guidelines for large scale mobile HCI. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2013.  ",
      "doi": "10.1145/2470654.2466245"
    },
    {
      "text": "Daniel Michelis and Jörg Müller. 2011. The audience funnel: Observations of gesture based interaction with multiple large displays in a city center. Intl. Journal of Human-Computer Interaction 27,6: 562--579.",
      "doi": ""
    },
    {
      "text": "Markus Montola and Annika Waern. 2006. Ethical and practical look at unaware game participation. In Santorineos, Manthos (ed.) Gaming Realities. A Challenge for Digital Culture. Mediaterra 2006 Festival, October 6.-8, Athens. 185--193.",
      "doi": ""
    },
    {
      "text": "Markus Montola and Annika Waern,. 2006. Participant roles in socially expanded games. In third international workshop on pervasive gaming applications, Pervasive Conference, 7 May 2006, Dublin, Ireland. Retrieved July 21st from https://annikawaern.files.wordpress.com/2015/07/pg_m ontola_roles.pdf",
      "doi": ""
    },
    {
      "text": "Markus Montola, Annika Waern, Jussi Kuittinen, and Jaakko Stenros. 2006. Ethics of Pervasive Gaming. IPerG Deliverable D5.5. Retrieved July 21st 2015 from http://www.pervasive-gaming.org/Deliverables/D5.5Ethics.pdf",
      "doi": ""
    },
    {
      "text": "Markus Montola, Jaakko Stenros and Annika Waern. 2009. Pervasive games: theory and design. Morgan Kaufmann Publishers Inc., 2009. ",
      "doi": "10.5555/1717294"
    },
    {
      "text": "Cosmin Munteanu, Heather Molyneaux, Wendy Moncur, Mario Romero, Susan O'Donnell, and John Vines, J. 2015. Situational Ethics: Re-thinking Approaches to Formal Ethics Requirements for Human-Computer Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM. 105--114.  ",
      "doi": "10.1145/2702123.2702481"
    },
    {
      "text": "Elisabeth Murphy and Robert Dingwall. 2007. Informed consent, anticipatory regulation and ethnographic practice. Social Science & Medicine 65,11: 2223--2234.",
      "doi": ""
    },
    {
      "text": "Anna Odell,. 2009. Unknown, Woman 2009-349701. Exhibition documentation. Retrieved September 6th from http://www.konstfack2009.se/bachelor/bafa/annaodell/",
      "doi": ""
    },
    {
      "text": "Michael Parker. 2007. Ethnography/ethics. Social science & medicine 65,11: 2248--2259.",
      "doi": ""
    },
    {
      "text": "Mark Perry, Steve Beckett, Kenton O'Hara and Sriram Subramanian. 2010. WaveWindow: public, performative gestural interaction. In ACM International Conference on Interactive Tabletops and Surfaces. ACM. 109--112.  ",
      "doi": "10.1145/1936652.1936672"
    },
    {
      "text": "Bernadette Rainey, Elizabeth Wicks and Clare Ovey. 2014. The European convention on human rights. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Jaakko Stenros. 2015. Playfulness, play, and games: A constructionist ludology approach. Ph.D. Thesis, Tampere University. Retrieved July 2015 from http://tampub.uta.fi/handle/10024/96986",
      "doi": ""
    },
    {
      "text": "Jo A. Tacchi, Don Slater and Gregory N. Hearn. 2003. Ethnographic action research: A user's handbook. Retrieved July 21st 2015 from http://eprints.qut.edu.au/4399/1/4399.pdf",
      "doi": ""
    },
    {
      "text": "Steven J. Taylor. 1991. Leaving the field: Research, relationships, and responsibilities. Experiencing fieldwork: An inside view of qualitative research: 238--247.",
      "doi": ""
    },
    {
      "text": "The Fun Theory. 2009. Piano staircase. Video. Retrieved July 23rd 2015 from http://www.thefuntheory.com/piano-staircase",
      "doi": ""
    },
    {
      "text": "Julie R. Williamson and Daniel Sundén. 2015. Deep Cover HCI: A Case for Covert Research in HCI. Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems. ACM.  ",
      "doi": "10.1145/2702613.2732500"
    },
    {
      "text": "Dan Wilson. 2011. Brutally unfair tactics totally OK now: On self-effacing games and unachievements. Journal of Game Studies 11,1.",
      "doi": ""
    },
    {
      "text": "World Medical Association. 2015. WMA Declaration of Helsinki -- Ethical Principles for Medical Research Involving Human Subjects. Retrieved July 21st 2015 from http://www.wma.net/en/30publications/10policies/b3/i ndex.html.",
      "doi": ""
    }
  ]
}