{
  "doi": "10.1145/2858036.2858075",
  "title": "Object-Oriented Drawing",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "4610-4621",
  "year": 2016,
  "badges": [
    "Best Paper"
  ],
  "abstract": "We present Object-Oriented Drawing, which replaces most WIMP UI with Attribute Objects. Attribute Objects embody the attributes of digital content as UI objects that can be manipulated through direct touch gestures. In the paper, the fundamental UI concepts are presented, including Attribute Objects, which may be moved, cloned, linked, and freely associated with drawing objects. Other functionalities, such as attribute-level blending and undo, are also demonstrated. We developed a drawing application based on the presented concepts with simultaneous touch and pen input. An expert assessment of our application shows that direct physical manipulation of Attribute Objects enables a user to quickly perform interactions which were previously tedious, or even impossible, with a coherent and consistent interaction experience throughout the entire interface.",
  "tags": [
    "object-oriented",
    "pen and touch input",
    "attribute object"
  ],
  "authors": [
    {
      "name": "Haijun Xia",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658640651",
      "orcid": "0000-0002-9425-0881"
    },
    {
      "name": "Bruno Araujo",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81310488636/rel-imgonly/brunohead.jpg",
      "acmid": "81310488636",
      "orcid": "missing"
    },
    {
      "name": "Tovi Grossman",
      "institution": "Autodesk Research, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100477897/rel-imgonly/81100477897.jpg",
      "acmid": "81100477897",
      "orcid": "0000-0002-0494-5373"
    },
    {
      "name": "Daniel Wigdor",
      "institution": "University of Toronto, Toronto, ON, Canada",
      "img": "/do/10.1145/contrib-81100606762/rel-imgonly/img_1274.jpg",
      "acmid": "81100606762",
      "orcid": "0000-0003-2008-7070"
    }
  ],
  "references": [
    {
      "text": "Anand Agarawala and Ravin Balakrishnan. Keepin' it real: pushing the desktop metaphor with physics, piles and the pen. CHI '06, 1283--1292.  ",
      "doi": "10.1145/1124772.1124965"
    },
    {
      "text": "Robert St. Amant and Thomas E. Horton. 2002. Characterizing tool use in an interactive drawing environment. SMARTGRAPH '02, 86--93.  ",
      "doi": "10.1145/569005.569018"
    },
    {
      "text": "Georg Apitz and François Guimbretière. CrossY : A Crossing-Based Drawing Application. UIST '04, 3-12.  ",
      "doi": "10.1145/1029632.1029635"
    },
    {
      "text": "Ronald M. Baecker. 1969. Picture-driven animation. AFIPS '69 (Spring), 273--288.  ",
      "doi": "10.1145/1476793.1476838"
    },
    {
      "text": "Olivier Bau and Wendy E Mackay. OctoPocus: A Dynamic Guide for Learning Gesture-Based Command Sets. UIST '08, 37-46.  ",
      "doi": "10.1145/1449715.1449724"
    },
    {
      "text": "Michel Beaudouin-Lafon. Instrumental interaction: an interaction model for designing post-WIMP user interfaces. CHI '00, 446--453.  ",
      "doi": "10.1145/332040.332473"
    },
    {
      "text": "Benjamin B. Bederson, James D. Hollan, Allison Druin, Jason Stewart, David Rogers, and David Proft. Local tools: an alternative to tool palettes. UIST '96, 169--170.  ",
      "doi": "10.1145/237091.237116"
    },
    {
      "text": "Hrvoje Benko and Daniel Wigdor. Imprecision, Inaccuracy, and Frustration: the Tale of Touch Input. In Tabletops - Horizontal Interactive Displays, Springer London, 2010, 249-275.",
      "doi": ""
    },
    {
      "text": "Eric A. Bier, Maureen C. Stone, Ken Pier, William Buxton, and Tony DeRose. Toolglass and magic lenses: the see-through interface. SIGGRAPH '93, 73--80.  ",
      "doi": "10.1145/166117.166126"
    },
    {
      "text": "Florian Block, Daniel Wigdor, and Bc Phillips. FlowBlocks: A multi-touch UI for crowd interaction. UIST '12, 497-507.  ",
      "doi": "10.1145/2380116.2380178"
    },
    {
      "text": "Andrew Bragdon, Robert Zeleznik, Brian Williamson, Timothy Miller, and Joseph J. LaViola, Jr. GestureBar: improving the approachability of gesture-based interfaces. CHI '09, 2269-2278.  ",
      "doi": "10.1145/1518701.1519050"
    },
    {
      "text": "Peter Brandl, Clifton Forlines, Daniel Wigdor, Michael Haller, and Chia Shen. Combining and measuring the benefits of bimanual pen and direct-touch interaction on horizontal interfaces. AVI '08, 154-16  ",
      "doi": "10.1145/1385569.1385595"
    },
    {
      "text": "Bill Buxton. Chunking and phrasing and the design of human-computer dialogues. IFIP '86, 475-480.",
      "doi": ""
    },
    {
      "text": "Xiang Cao, Andrew D. Wilson, Ravin Balakrishnan, Ken Hinckley, and Scott E. Hudson. ShapeTouch: Leveraging contact shape on interactive surfaces. TABLETOP '08, 129-136.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. inFORM: dynamic physical affordances and constraints through shape and object actuation. UIST '13, 417-426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Dustin Freeman, Hrvoje Benko, Meredith Ringel Morris, and Daniel Wigdor. ShadowGuides: Visualisations for In-Situ Learning of Multi-Touch and Whole-Hand Gestures. ITS '09, 165-172.  ",
      "doi": "10.1145/1731903.1731935"
    },
    {
      "text": "Ken Hinckley, Koji Yatani, Michel Pahud, Nicole Coddingotn, Jenny Rodenhouse, Andy Wilson, Hrvoje Benko, and Bill Buxton. Pen + touch = new tools. UIST '10, 27-36.  ",
      "doi": "10.1145/1866029.1866036"
    },
    {
      "text": "Raphaël Hoarau and Stéphane Conversy. Augmenting the scope of interactions with implicit and explicit graphical structures. CHI '12, 1937-1946.  ",
      "doi": "10.1145/2207676.2208337"
    },
    {
      "text": "Robert J.K. Jacob, Audrey Girouard, Leanne M. Hirshfield, Michael S. Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. Reality-based interaction: a framework for post-WIMP interfaces. CHI '08, 201-210.  ",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "Steve Jobs. 2007. Mac World Expo 2007: Keynote.",
      "doi": ""
    },
    {
      "text": "Jeff Johnson, Teresa L. Roberts, William Verplank, David C. Smith, Charles H. Irby, Marian Beard, and Kevin Mackey. The Xerox Star: A retrospective. Computer vol. 22, no. 9 1989, 11--26.  ",
      "doi": "10.1109/2.35211"
    },
    {
      "text": "Rubaiat Habib Kazi, Fanny Chevalier, Tovi Grossman, and George Fitzmaurice. Kitty: Sketching Dynamic and Interactive Illustrations. UIST '14, 395-405.  ",
      "doi": "10.1145/2642918.2647375"
    },
    {
      "text": "Mark J. Kilgard and Jeff Bolz. GPU-accelerated path rendering. ACM Transactions on Graphics 31, 6: 1, 2012.  ",
      "doi": "10.1145/2366145.2366191"
    },
    {
      "text": "Gordon Kurtenbach and William Buxton. User learning and performance with marking menus. CHI '94: 258--264.  ",
      "doi": "10.1145/191666.191759"
    },
    {
      "text": "Justin Matejka, Tovi Grossman, and George Fitzmaurice. Patina: Dynamic Heatmaps for Visualizing Application Usage. CHI '13, 3227-3236.  ",
      "doi": "10.1145/2470654.2466442"
    },
    {
      "text": "P McAvinney. The Sensor Frame-A Gesture-Based Device for the Manipulation of Graphic Objects. 1986.",
      "doi": ""
    },
    {
      "text": "Tomer Moscovich. Contact area interaction with sliding widgets. UIST '09, 13-22.  ",
      "doi": "10.1145/1622176.1622181"
    },
    {
      "text": "Jef Raskin. The Humane Interface: New Directions for Designing Interactive Systems. 2000. ",
      "doi": "10.5555/333103"
    },
    {
      "text": "Abigail Sellen, Gordon Kurtenbach, and William Buxton. The prevention of mode errors through sensory feedback. Human-Computer Interaction 7, 2, 1992, 141-164.  ",
      "doi": "10.1207/s15327051hci0702_1"
    },
    {
      "text": "Ben Shneiderman. The future of interactive systems and the emergence of direct manipulation. Behaviour & Information Technology. 1982.",
      "doi": ""
    },
    {
      "text": "Randall B. Smith. Experiences with the alternate reality kit: an example of the tension between literalism and magic. CHI '87, 61--67.  ",
      "doi": "10.1145/29933.30861"
    },
    {
      "text": "Sven Strothoff, Wolfgang Stuerzlinger, and Klaus Hinrichs. Pins 'n' Touches: An Interface for Tagging and Editing Complex Groups. ITS '15, 191--200.  ",
      "doi": "10.1145/2817721.2817731"
    },
    {
      "text": "Ivan E. Sutherland. Sketchpad a man-machine graphical communication system. SHARE design automation workshop. 1964.  ",
      "doi": "10.1145/800265.810742"
    },
    {
      "text": "Pierre Wellner. The Digital Desk Calculator: Tactile Manipulation on a Desk Top Display. UIST '91, 27-33.  ",
      "doi": "10.1145/120782.120785"
    },
    {
      "text": "Daniel Wigdor, Hrvoje Benko, John Pella, Jarrod Lombardo, and Sarah Williams. Rock & rails: extending multi-touch interactions with shape gestures to enable precise spatial manipulations. CHI '11, 1581-1590.  ",
      "doi": "10.1145/1978942.1979173"
    },
    {
      "text": "Daniel Wigdor and Dennis Wixon. Brave NUI World: Designing Natural User Interfaces for Touch and Gesture. 2011. ",
      "doi": "10.5555/1995309"
    },
    {
      "text": "Andrew D Wilson, Shahram Izadi, Otmar Hilliges, Armando Garcia-Mendoza, and David Kirk. Bringing physics to the surface. UIST '08, 67-76.  ",
      "doi": "10.1145/1449715.1449728"
    },
    {
      "text": "Jacob O. Wobbrock, Meredith Ringel Morris, and Andrew D. Wilson. User-defined gestures for surface computing. CHI '09, 1083-1092.  ",
      "doi": "10.1145/1518701.1518866"
    },
    {
      "text": "Mike Wu and Ravin Balakrishnan. Multi-finger and whole hand gestural interaction techniques for multi-user tabletop displays. UIST '03, 193-202.  ",
      "doi": "10.1145/964696.964718"
    }
  ]
}