{
  "doi": "10.1145/2858036.2858349",
  "title": "Skill Progression in Scratch Revisited",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "1486-1490",
  "year": 2016,
  "badges": [],
  "abstract": "This paper contributes to a growing body of work that attempts to measure informal learning online by revisiting two of the most surprising findings from a 2012 study on skill progression in Scratch by Scaffidi and Chambers: users tend to share decreasingly code-heavy projects over time; and users' projects trend toward using a less diverse range of code concepts. We revisit Scaffidi and Chambers's work in three ways: with a replication of their study using the full population of projects from which they sampled, a simulation study that replicates both their analytic and sampling methodology, and an alternative analysis that addresses several important threats. Our results suggest that the population estimates are opposite in sign to those presented in the original work.",
  "tags": [
    "creativity support tools",
    "online communities",
    "learning",
    "replication",
    "computers and children"
  ],
  "authors": [
    {
      "name": "J. Nathan Matias",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100093273/rel-imgonly/cals-socialmedia-small.png",
      "acmid": "81100093273",
      "orcid": "missing"
    },
    {
      "name": "Sayamindu Dasgupta",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81484641200",
      "orcid": "missing"
    },
    {
      "name": "Benjamin Mako Hill",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81539037856/rel-imgonly/mako_commlead_2014-280px.png",
      "acmid": "81539037856",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kenneth Bollen, John T. Cacioppo, Robert M. Kaplan, Jon A. Krosnick, James L. Olds, and Heather Dean. 2015. Social, Behavioral, and Economic Sciences Perspectives on Robust and Reliable Science. Technical Report. National Science Foundation. http://www.nsf.gov/sbe/AC_Materials/SBE_Robust_and_Reliable_Research_Report.pdf",
      "doi": ""
    },
    {
      "text": "Karen Brennan. 2013. Best of both worlds: Issues of structure and agency in computational creation, in and out of school. Ph.D. Dissertation. Massachusetts Institute of Technology. http://dspace.mit.edu/handle/1721.1/79157 ",
      "doi": "10.5555/2519999"
    },
    {
      "text": "Karen Brennan and Mitchel Resnick. 2012. New frameworks for studying and assessing the development of computational thinking. In Proceedings of the 2012 annual meeting of the American Educational Research Association, Vancouver, Canada. http://scratched.gse.harvard.edu/ct/files/AERA2012.pdf",
      "doi": ""
    },
    {
      "text": "Aniket Dahotre, Yan Zhang, and Christopher Scaffidi. 2010. A Qualitative Study of Animation Programming in the Wild. In Proceedings of the 2010 ACM-IEEE International Symposium on Empirical Software Engineering and Measurement (ESEM '10). ACM, New York, NY, USA, 29:1--29:10. DOI: http://dx.doi.org/10.1145/1852786.1852825  ",
      "doi": "10.1145/1852786.1852825"
    },
    {
      "text": "Sayamindu Dasgupta, William Hale, Andrés Monroy-Hernández, and Benjamin Mako Hill. 2016 (forthcoming). Remixing as a Pathway to Computational Thinking. In Proceedings of the 19th Conference on Computer Supported Cooperative Work & Social Computing (CSCW '16). ACM.  ",
      "doi": "10.1145/2818048.2819984"
    },
    {
      "text": "Kasper Hornbæk, Søren S. Sander, Javier Andres Bargas-Avila, and Jakob Grue Simonsen. 2014. Is Once Enough?: On the Extent and Content of Replications in Human-computer Interaction. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14). ACM, New York, NY, USA, 3523--3532. DOI: http://dx.doi.org/10.1145/2556288.2557004  ",
      "doi": "10.1145/2556288.2557004"
    },
    {
      "text": "John P. A. Ioannidis. 2005. Why Most Published Research Findings Are False. PLoS Med 2, 8 (2005), e124. DOI: http://dx.doi.org/10.1371/journal.pmed.0020124",
      "doi": ""
    },
    {
      "text": "Jay Lemke, Robert Lecusay, Michael Cole, and Vera Michalchik. 2015. Documenting and assessing learning in informal and media-rich environments. MIT Press.",
      "doi": ""
    },
    {
      "text": "John H Maloney, Kylie Peppler, Yasmin Kafai, Mitchel Resnick, and Natalie Rusk. 2008. Programming by choice: urban youth learning programming with Scratch. ACM SIGCSE Bulletin 40, 1 (2008), 367--371. DOI: http://dx.doi.org/10.1145/1352135.1352260  ",
      "doi": "10.1145/1352322.1352260"
    },
    {
      "text": "Andrés Monroy-Hernández. 2007. ScratchR: sharing user-generated programmable media. In Proceedings of the 6th international conference on Interaction design and children (IDC '07). ACM, New York, NY, USA, 167--168. DOI: http://dx.doi.org/10.1145/1297277.1297315  ",
      "doi": "10.1145/1297277.1297315"
    },
    {
      "text": "Kylie A. Peppler and Mark Warschauer. 2011. Uncovering Literacies, Disrupting Stereotypes: Examining the (Dis)Abilities of a Child Learning to Computer Program and Read. International Journal of Learning and Media 3, 3 (2011), 15--41. DOI: http://dx.doi.org/10.1162/IJLM_a_00073",
      "doi": ""
    },
    {
      "text": "Alexander Repenning, David C. Webb, Kyu Han Koh, Hilarie Nickerson, Susan B. Miller, Catharine Brand, Ian Her Many Horses, Ashok Basawapatna, Fred Gluck, Ryan Grover, Kris Gutierrez, and Nadia Repenning. 2015. Scalable Game Design: A Strategy to Bring Systemic Computer Science Education to Schools Through Game Design and Simulation Creation. Trans. Comput. Educ. 15, 2 (April 2015), 11:1--11:31. DOI: http://dx.doi.org/10.1145/2700517  ",
      "doi": "10.1145/2700517"
    },
    {
      "text": "Mitchel Resnick, John Maloney, Andrés Monroy-Hernández, Natalie Rusk, Evelyn Eastmond, Karen Brennan, Amon Millner, Eric Rosenbaum, Jay Silver, Brian Silverman, and Yasmin Kafai. 2009. Scratch: programming for all. Commun. ACM 52, 11 (2009), 60--67. DOI: http://dx.doi.org/10.1145/1592761.1592779  ",
      "doi": "10.1145/1592761.1592779"
    },
    {
      "text": "Christopher Scaffidi and Christopher Chambers. 2012. Skill Progression Demonstrated by Users in the Scratch Animation Environment. International Journal of Human-Computer Interaction 28, 6 (June 2012), 383--398. DOI: http://dx.doi.org/10.1080/10447318.2011.595621",
      "doi": ""
    },
    {
      "text": "Judith D. Singer and John B. Willett. 2003. Applied Longitudinal Data Analysis: Modeling Change and Event Occurrence (1 ed.). Oxford University Press, USA.",
      "doi": ""
    },
    {
      "text": "Max L. Wilson, Wendy Mackay, Ed Chi, Michael Bernstein, Dan Russell, and Harold Thimbleby. 2011. RepliCHI CHI Should Be Replicating and Validating Results More: Discuss. In CHI '11 Extended Abstracts on Human Factors in Computing Systems (CHI EA '11). ACM, New York, NY, USA, 463--466. DOI: http://dx.doi.org/10.1145/1979742.1979491  ",
      "doi": "10.1145/1979742.1979491"
    },
    {
      "text": "Seungwon Yang, Carlotta Domeniconi, Matt Revelle, Mack Sweeney, Ben U. Gelman, Chris Beckley, and Aditya Johri. 2015. Uncovering Trajectories of Informal Learning in Large Online Communities Of Creators. In Proceedings of the Second (2015) ACM Conference on Learning@Scale. ACM, 131--140. DOI: http://dx.doi.org/10.1145/2724660.2724674  ",
      "doi": "10.1145/2724660.2724674"
    }
  ]
}