{
  "doi": "10.1145/2858036.2858057",
  "title": "Investigating Text Legibility on Non-Rectangular Displays",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "498-508",
  "year": 2016,
  "badges": [],
  "abstract": "Emerging technologies allow for the creation of non-rectangular displays with unlimited constraints in shape. However, the introduction of such displays radically deviates from the prevailing tradition of placing content on rectangular screens and raises fundamental design questions. Among these is the foremost question of how to legibly present text. We address this fundamental concern through a multi-part exploration that includes: (1) a focus-group study from which we collected free-form display scenarios and extracted display shape properties; (2) a framework that identifies different mappings of text onto a non-rectangular shape and formulates hypotheses concerning legibility for different display shape properties; and (3) a series of quantitative text legibility studies to assess our hypotheses. Or results agree with and extend upon other findings in the existing literature on text legibility, but they also uncover unique instances in which different rules need to be applied for non-rectangular displays. These results also provide guidelines for the design of visual interfaces.",
  "authors": [
    {
      "name": "Marcos Serrano",
      "institution": "University of Toulouse - IRIT, Toulouse, France",
      "img": "/do/10.1145/contrib-81318491531/rel-imgonly/marcos-2018.jpg",
      "acmid": "81318491531",
      "orcid": "0000-0001-8431-0601"
    },
    {
      "name": "Anne Roudaut",
      "institution": "University of Bristol, Bristol, United Kingdom",
      "img": "/do/10.1145/contrib-81414614562/rel-imgonly/81414614562.png",
      "acmid": "81414614562",
      "orcid": "0000-0003-3082-4564"
    },
    {
      "name": "Pourang Irani",
      "institution": "University of Manitoba, Winnipeg, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100459517",
      "orcid": "0000-0002-7716-9280"
    }
  ],
  "references": [
    {
      "text": "Alexander, J., Lucero, A., and Subramanian, S. 2012. Tilt displays: designing display surfaces with multi-axis tilting and actuation. In MobileHCI '12. ACM, 161--170.  ",
      "doi": "10.1145/2371574.2371600"
    },
    {
      "text": "Bederson, B. 2000. Fisheye menus. In UIST '00. ACM, 217--225.  ",
      "doi": "10.1145/354401.354782"
    },
    {
      "text": "Benko, H, Andrew D. Wilson, and Balakrishnan, R. 2008. Sphere: multi-touch interactions on a spherical display. In UIST '08. ACM, 77--86.  ",
      "doi": "10.1145/1449715.1449729"
    },
    {
      "text": "Bernard, M., Chaparro, B., Mills, M., and Halcomb, C. 2003. Comparing the effects of text size and format on the readibility of computer-displayed Times New Roman and Arial text. IJHCS. 59, 6, 823--835.  ",
      "doi": "10.1016/S1071-5819%2803%2900121-6"
    },
    {
      "text": "Bouma, H. 1980. Visual Reading Processes and the Quality of Text Displays. In Ergonomic Aspects of Visual Display Terminals, Grandjean and Vigliani, 101114.",
      "doi": ""
    },
    {
      "text": "Brockmeyer, E., Poupyrev, I., and Hudson, S. 2013. PAPILLON: designing curved display surfaces with printed optics. In UIST '13. ACM, 457--462.  ",
      "doi": "10.1145/2501988.2502027"
    },
    {
      "text": "Brown, J.A., Fishco, V.V., & Hanna, G. 1993. Nelson Denny Reading Test. Riverside Publishing.",
      "doi": ""
    },
    {
      "text": "Butz, A., Grob, M., and Krüger, A. 2004. TUISTER: a tangible UI for hierarchical structures. In IUI '04. ACM, 223--225.  ",
      "doi": "10.1145/964442.964486"
    },
    {
      "text": "Chevalier, F, Dragicevic, P., Bezerianos, A. and Fekete, J.D. 2010. Using text animated transitions to support navigation in document histories. In CHI '10. ACM, 683--692.  ",
      "doi": "10.1145/1753326.1753427"
    },
    {
      "text": "Darroch, I., Goodman, J. Brewster, S. and Gray, P. The Effect of Age and Font Size on Reading Text on Handheld Computers. In INTERACT 2005.  ",
      "doi": "10.1007/11555261_23"
    },
    {
      "text": "Delaunay, F., Greeff, J., and Belpaeme, T. 2010. A study of a retro-projected robotic face and its effectiveness for gaze reading by humans. In HRI '10. IEEE Press, 39--44. ",
      "doi": "10.5555/1734454.1734471"
    },
    {
      "text": "Dillon, A. Reading from paper vs. screens: A critical review of the empirical literature. Ergonomics, 1992.",
      "doi": ""
    },
    {
      "text": "Dyson, M. 2004. How physical text layout affects reading from screen Behaviour & Information Technology Vol. 23, Iss. 6, 2004.",
      "doi": ""
    },
    {
      "text": "Dyson, M., and Haselgrove, M. 2001. The influence of reading speed and line length on the effectiveness of reading from screen. Int. J. Hum.-Comput. Stud. 54, 4, 585--612.  ",
      "doi": "10.1006/ijhc.2001.0458"
    },
    {
      "text": "Dyson, M., Kipping, G. 1997. The legibility of screen formats: are three columns better then one?, Computers & Graphics, 21, 703--712.",
      "doi": ""
    },
    {
      "text": "Gregory, M. and Poulton, E.C. 1970. Even versus Uneven Right-hand Margins and the Rate of Comprehension in Reading. Ergonomics, Volume 13, Issue 4, pages 427--434.",
      "doi": ""
    },
    {
      "text": "Grossman, T., Wigdor, D., and Balakrishnan, R. 2007. Exploring and reducing the effects of orientation on text readability in volumetric displays. In CHI '07. ACM, 483--492.  ",
      "doi": "10.1145/1240624.1240702"
    },
    {
      "text": "Hansen, W. J. and Haas, C. 1988. Reading and writing with computers: a framework for explaining di!erences in performance. Communications of the ACM, 31, 1080--1089.  ",
      "doi": "10.1145/48529.48532"
    },
    {
      "text": "http://sharp-world.com/igzo/",
      "doi": ""
    },
    {
      "text": "Huey, E. 1898. Preliminary Experiments in the Physiology and Psychology of Reading. The American Journal of Psychology, vol. 9, pp. 575--586.",
      "doi": ""
    },
    {
      "text": "Jankowski, J., Samp, K., Irzynska, I., Jozwowicz, M., and Decker, S. 2010. Integrating Text with Video and 3D Graphics: The Effects of Text Drawing Styles on Text Readability. In CHI '10. ACM, 1321--1330.  ",
      "doi": "10.1145/1753326.1753524"
    },
    {
      "text": "Jones, B., Benko, H., Ofek, E., and Wilson, A. 2013. IllumiRoom: peripheral projected illusions for interactive experiences. In CHI '13. ACM, 869--878.  ",
      "doi": "10.1145/2470654.2466112"
    },
    {
      "text": "Jorna, G.C. and Snyder, H.L. Image Quality Determines Differences in Reading Performance and Perceived Image Quality with CRT and Hard-Copy Displays. Human Factors, 1991. ",
      "doi": "10.1177/001872089103300407"
    },
    {
      "text": "Kolers, P., Duchnicky, R. and Ferguson, D. 1981. Eye movement measurement of readability of CRT displays. Human Factors. 23(5), 517--27.",
      "doi": ""
    },
    {
      "text": "Koppel, M., Bailly, G., Müller, J., and Walter., R 2012. Chained displays: configurations of public displays can be used to influence actor-, audience-, and passer-by behavior. In CHI '12. ACM, 317--326.  ",
      "doi": "10.1145/2207676.2207720"
    },
    {
      "text": "Koriat, A. and Norman, J. 1985. Reading Rotated Words. Journal of Experimental Psychology; Human Perception and Performance, vol. 11, number 4, pp: 490--508..",
      "doi": ""
    },
    {
      "text": "Lavie, T. and Tractinsky, N. Assessing dimensions of perceived visual aesthetics of web sites. IJHCS, 2004.  ",
      "doi": "10.1016/j.ijhcs.2003.09.002"
    },
    {
      "text": "Lyons, K., Nguyen, D., Ashbrook, D., and White, S. 2012. Facet: a multi-segment wrist worn system. In UIST '12. ACM, 123--130.  ",
      "doi": "10.1145/2380116.2380134"
    },
    {
      "text": "Maharik, R., Bessmeltsev, M., Sheffer, A., Shamir, A., and Carr, N. 2011. Digital micrography. In SIGGRAPH '11. ACM, Article 100, 12 pages.  ",
      "doi": "10.1145/1964921.1964995"
    },
    {
      "text": "O'Hara, K. and Sellen, A. 1997. A comparison of reading paper and on-line documents. In CHI '97. ACM, 335--342.  ",
      "doi": "10.1145/258549.258787"
    },
    {
      "text": "Simon Olberding, Michael Wessely, and Jürgen Steimle. 2014. PrintScreen: fabricating highly customizable thinfilm touch-displays. In UIST '14. ACM, 281--290.  ",
      "doi": "10.1145/2642918.2647413"
    },
    {
      "text": "Piolat, A., Roussey, J.-Y. and Thunin,O. 1997. Effects of screen presentation on text reading and revising. IJHCS, 47, 565--589.  ",
      "doi": "10.1006/ijhc.1997.0145"
    },
    {
      "text": "Poupyrev, I., Newton-Dunn, H., and Bau, O. 2006. D20: interaction with multifaceted display devices. In CHI EA '06. ACM, 1241--1246.  ",
      "doi": "10.1145/1125451.1125683"
    },
    {
      "text": "Ramakers, R., Schöning, J., and Luyten, K. 2014. Paddle: highly deformable mobile devices with physical controls. In CHI EA '14. ACM, 191--192.  ",
      "doi": "10.1145/2559206.2579524"
    },
    {
      "text": "Rekimoto, J., Ullmer, B., and Oba, H. 2001. DataTiles: a modular platform for mixed physical and graphical interactions. In CHI '01. ACM, 269--276.  ",
      "doi": "10.1145/365024.365115"
    },
    {
      "text": "Roudaut, A., Karnik, A., Löchtefeld, M., and Subramanian, S. 2013. Morphees: toward high \"shape resolution\" in self-actuated flexible mobile devices. In CHI '13. ACM, 593--602.  ",
      "doi": "10.1145/2470654.2470738"
    },
    {
      "text": "Roudaut, A., Reed, R., Hao, T., and Subramanian, S. 2014. Changibles: analyzing and designing shape changing constructive assembly. In CHI '14. ACM, 2593--2596.  ",
      "doi": "10.1145/2556288.2557006"
    },
    {
      "text": "Schriver, K. 1997. Dynamics in Document Design: Creating Text for Readers. John Wiley & Sons, Inc., NY, NY, USA. ",
      "doi": "10.5555/249331"
    },
    {
      "text": "Spencer, H. 1968. The Visible Word. London: Royal College of Art.",
      "doi": ""
    },
    {
      "text": "Tinker, M. 1972. Effect of angular alignment upon readability of print. Journal of Educational Psychology, vol. 47, pp. 358--363.",
      "doi": ""
    },
    {
      "text": "Tractinsky, N., Shoval-Katz, A., and Ikar, D. What is beautiful is usable. Interacting with Computers, 2000.",
      "doi": ""
    },
    {
      "text": "Wigdor, D. and Balakrishnan, R. 2005. Empirical investigation into the effect of orientation on text readability in tabletop displays. In ECSCW'05. Springer, 205--224. ",
      "doi": "10.5555/1242029.1242040"
    },
    {
      "text": "www.lgdnewsroom.com",
      "doi": ""
    },
    {
      "text": "Zachrison, B. 1965, Studies in the Legibility of Printed Text. Almqvist & Wiksell, 225 pages.",
      "doi": ""
    }
  ]
}