{
  "doi": "10.1145/2858036.2858249",
  "title": "PaperID: A Technique for Drawing Functional Battery-Free Wireless Interfaces on Paper",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "5885-5896",
  "year": 2016,
  "badges": [],
  "abstract": "We describe techniques that allow inexpensive, ultra-thin, battery-free Radio Frequency Identification (RFID) tags to be turned into simple paper input devices. We use sensing and signal processing techniques that determine how a tag is being manipulated by the user via an RFID reader and show how tags may be enhanced with a simple set of conductive traces that can be printed on paper, stencil-traced, or even hand-drawn. These traces modify the behavior of contiguous tags to serve as input devices. Our techniques provide the capability to use off-the-shelf RFID tags to sense touch, cover, overlap of tags by conductive or dielectric (insulating) materials, and tag movement trajectories. Paper prototypes can be made functional in seconds. Due to the rapid deployability and low cost of the tags used, we can create a new class of interactive paper devices that are drawn on demand for simple tasks. These capabilities allow new interactive possibilities for pop-up books and other papercraft objects.",
  "authors": [
    {
      "name": "Hanchuan Li",
      "institution": "Disney Research, Pittsburgh & University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658703500",
      "orcid": "missing"
    },
    {
      "name": "Eric Brockmeyer",
      "institution": "Disney Research, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81549048056",
      "orcid": "missing"
    },
    {
      "name": "Elizabeth J. Carter",
      "institution": "Disney Research, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81466641562",
      "orcid": "missing"
    },
    {
      "name": "Josh Fromm",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659021897",
      "orcid": "missing"
    },
    {
      "name": "Scott E. Hudson",
      "institution": "Disney Research & Carnegie Mellon, Pittsburgh, PA, USA",
      "img": "/do/10.1145/contrib-81328488846/rel-imgonly/scott_hudson_2017.jpg",
      "acmid": "81328488846",
      "orcid": "0000-0002-0948-3251"
    },
    {
      "name": "Shwetak N. Patel",
      "institution": "University of Washington, Seattle, WA, USA",
      "img": "/do/10.1145/contrib-81100490064/rel-imgonly/81100490064.jpg",
      "acmid": "81100490064",
      "orcid": "0000-0002-6300-4389"
    },
    {
      "name": "Alanson Sample",
      "institution": "Disney Research, Pittsburgh, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81387598695",
      "orcid": "0000-0002-8046-0538"
    }
  ],
  "references": [
    {
      "text": "2015. Arduino & Genuino Product Page. (sep 2015). https://www.arduino.cc/en/Main/Products",
      "doi": ""
    },
    {
      "text": "Toshifumi Arai, Dietmar Aust, and Scott E. Hudson. 1997. PaperLink: A Technique for Hyperlinking from Real Paper to Electronic Content. In Proceedings of the ACM SIGCHI Conference on Human Factors in Computing Systems (CHI '97). ACM, NY, NY, USA, 327-334. DOI: http://dx.doi.org/10.1145/258549.258782  ",
      "doi": "10.1145/258549.258782"
    },
    {
      "text": "Parvin Asadzadeh, Lars Kulik, and Egemen Tanin. 2012. Gesture recognition using RFID technology. Personal and Ubiquitous Computing 16, 3 (2012), 225-234. DOI: http://dx.doi.org/10.1007/s00779-011-0395-z  ",
      "doi": "10.1007/s00779-011-0395-z"
    },
    {
      "text": "Daniel Avrahami and Scott E. Hudson. 2002. Forming Interactivity: A Tool for Rapid Prototyping of Physical Interactive Products. In Proceedings of the 4th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '02). ACM, NY, NY, USA, 141-146. DOI: http://dx.doi.org/10.1145/778712.778735  ",
      "doi": "10.1145/778712.778735"
    },
    {
      "text": "Michael Buettner, Richa Prasad, Matthai Philipose, and David Wetherall. 2009. Recognizing Daily Activities with RFID-based Sensors. In Proceedings of the 11th International Conference on Ubiquitous Computing (UbiComp '09). ACM, NY, NY, USA, 51-60. DOI:http://dx.doi.org/10.1145/1620545.1620553  ",
      "doi": "10.1145/1620545.1620553"
    },
    {
      "text": "EPCglobal. EPCTM Radio-frequency identity protocols generation-2 UHF RFID specification for RFID air interface, Version 2.0.",
      "doi": ""
    },
    {
      "text": "K. Fishkin, B. Jiang, M. Philipose, S. Roy, Kenneth P. Fishkin, Bing Jiang, Matthai Philipose, and Sumit Roy. 2004. I Sense a Disturbance in the Force: Unobtrusive Detection of Interactions with RFID-tagged Objects. Springer-Verlag, 268-282. DOI: http://dx.doi.org/10.1007/978--3--540--30119--6_16",
      "doi": ""
    },
    {
      "text": "Saul Greenberg and Chester Fitchett. 2001. Phidgets: Easy Development of Physical Interfaces Through Physical Widgets. In Proceedings of the 14th Annual ACM Symposium on User Interface Software and Technology (UIST '01). ACM, NY, NY, USA, 209-218. DOI: http://dx.doi.org/10.1145/502348.502388  ",
      "doi": "10.1145/502348.502388"
    },
    {
      "text": "Francois Guimbreti'ere. 2003. Paper Augmented Digital Documents. In Proceedings of the 16th Annual ACM Symposium on User Interface Software and Technology (UIST '03). ACM, NY, NY, USA, 51-60. DOI: http://dx.doi.org/10.1145/964696.964702  ",
      "doi": "10.1145/964696.964702"
    },
    {
      "text": "Bjorn Hartmann, Scott R. Klemmer, Michael Bernstein, Leith Abdulla, Brandon Burr, Avi Robinson-Mosher, and Jennifer Gee. 2006. Reflective Physical Prototyping Through Integrated Design, Test, and Analysis. In Proceedings of the 19th Annual ACM Symposium on User Interface Software and Technology (UIST '06). ACM, NY, NY, USA, 299-308. DOI: http://dx.doi.org/10.1145/1166253.1166300  ",
      "doi": "10.1145/1166253.1166300"
    },
    {
      "text": "David Holman, Roel Vertegaal, Mark Altosaar, Nikolaus Troje, and Derek Johns. 2005. Paper Windows: Interaction Techniques for Digital Paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '05). ACM, NY, NY, USA, 591-599. DOI: http://dx.doi.org/10.1145/1054972.1055054  ",
      "doi": "10.1145/1054972.1055054"
    },
    {
      "text": "Yoshihiro Kawahara, Steve Hodges, Benjamin S Cook, Cheng Zhang, and Gregory D Abowd. 2013. Instant inkjet circuits: lab-based inkjet printing to support rapid prototyping of UbiComp devices. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing. ACM, 363-372. DOI: http://dx.doi.org/10.1145/2493432.2493486  ",
      "doi": "10.1145/2493432.2493486"
    },
    {
      "text": "Johnny C. Lee, Daniel Avrahami, Scott E. Hudson, Jodi Forlizzi, Paul H. Dietz, and Darren Leigh. 2004. The Calder Toolkit: Wired and Wireless Components for Rapidly Prototyping Interactive Devices. In Proceedings of the 5th Conference on Designing Interactive Systems: Processes, Practices, Methods, and Techniques (DIS '04). ACM, NY, NY, USA, 167-175. DOI: http://dx.doi.org/10.1145/1013115.1013139  ",
      "doi": "10.1145/1013115.1013139"
    },
    {
      "text": "Hanchuan Li, Can Ye, and Alanson P Sample. 2015. IDSense: A Human Object Interaction Detection System Based on Passive UHF RFID. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2555-2564. DOI: http://dx.doi.org/10.1145/2702123.2702178  ",
      "doi": "10.1145/2702123.2702178"
    },
    {
      "text": "RFID Journal LLC. 2015. How much does an RFID tag cost today? (sep 2015). http://www.rfidjournal.com/faq/show?85",
      "doi": ""
    },
    {
      "text": "Wendy E. Mackay, Guillaume Pothier, Catherine Letondal, Kaare Bøegh, and Hans Erik Sørensen. 2002. The Missing Link: Augmenting Biology Laboratory Notebooks. In Proceedings of the 15th Annual ACM Symposium on User Interface Software and Technology (UIST '02). ACM, NY, NY, USA, 41-50. DOI: http://dx.doi.org/10.1145/571985.571992  ",
      "doi": "10.1145/571985.571992"
    },
    {
      "text": "Allan MacLean, Kathleen Carter, Lennart Lovstrand, and Thomas Moran. 1990. User-tailorable Systems: Pressing the Issues with Buttons. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '90). ACM, NY, NY, USA, 175-182. DOI: http://dx.doi.org/10.1145/97243.97271  ",
      "doi": "10.1145/97243.97271"
    },
    {
      "text": "Nicolai Marquardt, Alex S Taylor, Nicolas Villar, and Saul Greenberg. 2010. Rethinking RFID: awareness and control for interaction with RFID systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 2307-2316. DOI:http://dx.doi.org/10.1145/1753326.1753674  ",
      "doi": "10.1145/1753326.1753674"
    },
    {
      "text": "Siddika Parlak and Ivan Marsic. 2013. Detecting object motion using passive RFID: A trauma resuscitation case study. Instrumentation and Measurement, IEEE Transactions on 62, 9 (2013), 2430-2437. DOI: http://dx.doi.org/10.1109/TIM.2013.2258772",
      "doi": ""
    },
    {
      "text": "Jie Qi and Leah Buechley. 2014. Sketching in circuits: designing and building electronics on paper. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 1713-1722. DOI:http://dx.doi.org/10.1145/2556288.2557391  ",
      "doi": "10.1145/2556288.2557391"
    },
    {
      "text": "Marc Rettig. 1994. Prototyping for Tiny Fingers. Commun. ACM 37, 4 (April 1994), 21-27. DOI: http://dx.doi.org/10.1145/175276.175288  ",
      "doi": "10.1145/175276.175288"
    },
    {
      "text": "A. Rida, Li Yang, R. Vyas, and M.M. Tentzeris. 2009. Conductive Inkjet-Printed Antennas on Flexible Low-Cost Paper-Based Substrates for RFID and WSN Applications. Antennas and Propagation Magazine, IEEE 51, 3 (June 2009), 13-23. DOI: http://dx.doi.org/10.1109/MAP.2009.5251188",
      "doi": ""
    },
    {
      "text": "Alanson Sample, Craig Macomber, Liang-Ting Jiang, and Joshua R Smith. 2012. Optical localization of passive UHF RFID tags with integrated LEDs. In RFID (RFID), 2012 IEEE International Conference on. 116-123. DOI: http://dx.doi.org/10.1109/RFID.2012.6193038",
      "doi": ""
    },
    {
      "text": "A.P. Sample, D.J. Yeager, P.S. Powledge, and J.R. Smith. 2007. Design of a Passively-Powered, Programmable Sensing Platform for UHF RFID Systems. In RFID, 2007. IEEE International Conference on. 149-156. DOI: http://dx.doi.org/10.1109/RFID.2007.346163",
      "doi": ""
    },
    {
      "text": "Jurgen Steimle. 2009. Designing pen-and-paper user interfaces for interaction with documents. In Proceedings of the 3rd International Conference on Tangible and Embedded Interaction. ACM, 197-204. DOI:http://dx.doi.org/10.1145/1517664.1517707  ",
      "doi": "10.1145/1517664.1517707"
    },
    {
      "text": "Alien Technology. 2014. ALN-9713 SIT Inlay. (March 2014). http://www.alientechnology.com/wp-content/uploads/Alien-Technology-Higgs-4-ALN-9713-SIT.pdf",
      "doi": ""
    },
    {
      "text": "Jue Wang, Deepak Vasisht, and Dina Katabi. RF-IDraw: virtual touch screen in the air using RF signals. In Proceedings of the 2014 ACM conference on SIGCOMM. DOI: http://dx.doi.org/10.1145/2740070.2626330  ",
      "doi": "10.1145/2619239.2626330"
    },
    {
      "text": "Li Yang, A. Rida, R. Vyas, and M.M. Tentzeris. 2007. RFID Tag and RF Structures on a Paper Substrate Using Inkjet-Printing Technology. Microwave Theory and Techniques, IEEE Transactions on 55, 12 (Dec 2007), 2894-2901. DOI: http://dx.doi.org/10.1109/TMTT.2007.909886",
      "doi": ""
    }
  ]
}