{
  "doi": "10.1145/2858036.2858081",
  "title": "The Ins and Outs of HCI for Development",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "2220-2232",
  "year": 2016,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "We present an empirical analysis of HCI for development (HCI4D), a growing research area aimed at understanding and designing technologies for under-served, under-resourced, and under-represented populations around the world. We first present findings from our survey of 259 HCI4D publications from the past six years and summarize how this research has evolved, with an overview of the geographies it covers, technologies it targets, and its varied epistemological and methodological underpinnings. We then discuss qualitative findings from interviews we conducted with 11 experienced HCI4D researchers, reflecting on the ground covered so far Including computing and research trends, community-building efforts, and thoughts about 'development' - as well as challenges that lie ahead and suggestions for future growth and diversification. We conclude by summarizing the contributions our paper makes to HCI researchers inside the HCI4D community as well as those outside of it, with the goal of enriching discussions on how HCI can further benefit populations around the world.",
  "tags": [
    "review",
    "literature survey",
    "low-resource",
    "HCI4D",
    "underserved communities",
    "developing world",
    "ICTD"
  ],
  "authors": [
    {
      "name": "Nicola Dell",
      "institution": "Cornell Tech, New York, NY, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486656510",
      "orcid": "0000-0002-6119-705X"
    },
    {
      "name": "Neha Kumar",
      "institution": "Georgia Institute of Technology, Atlanta, GA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460646715",
      "orcid": "0000-0002-7014-5585"
    }
  ],
  "references": [
    {
      "text": "Yaw Anokwa, Thomas N. Smyth, Divya Ramachandran, Jahanzeb Sherwani, Yael Schwartzman, Rowena Luk, Melissa Ho, Neema Moraveji, and Brian DeRenzi. 2009. Stories from the Field: Reflections on HCI4D Experiences. Information Technologies & International Development 5, 4 (2009), pp. 101--116.",
      "doi": ""
    },
    {
      "text": "S Bailur and S Masiero. 2012. The complex position of the intermediary in telecenters and community multimedia centers. Information Technologies and International Development 8, 1 (2012).",
      "doi": ""
    },
    {
      "text": "Mara Balestrini, Jon Bird, Paul Marshall, Alberto Zaro, and Yvonne Rogers. 2014. Understanding Sustained Community Engagement: A Case Study in Heritage Preservation in Rural Argentina. In SIGCHI Conference on Human Factors in Computing Systems (CHI '14). 2675--2684.  ",
      "doi": "10.1145/2556288.2557323"
    },
    {
      "text": "Francois Bar, Chris Coward, Lucas Koepke, Chris Rothschild, Araba Sey, and George Sciadas. 2013. The Impact of Public Access to ICTs: Findings from a Five-year, Eight-country Study. In Information and Communication Technologies and Development (ICTD '13). 34--42.  ",
      "doi": "10.1145/2516604.2516619"
    },
    {
      "text": "Nicola Bidwell. 2014. Moving the centre to design social media in rural Africa. AI & Society (2014), 1--27.  ",
      "doi": "10.1007/s00146-014-0564-5"
    },
    {
      "text": "Nicola J. Bidwell, Masbulele Siya, Gary Marsden, William D. Tucker, M. Tshemese, N. Gaven, S. Ntlangano, Simon Robinson, and Kristen ALI Eglinton. 2008. Walking and the Social Life of Solar Charging in Rural Africa. ACM Trans. Comput.-Hum. Interact. 20, 4 (2008), 22:1--22:33.  ",
      "doi": "10.1145/2493524"
    },
    {
      "text": "Susanne Bødker. 2006. When Second Wave HCI Meets Third Wave Challenges. In Proceedings of the 4th Nordic Conference on Human-computer Interaction: Changing Roles (NordiCHI '06). ACM, New York, NY, USA, 1--8.  ",
      "doi": "10.1145/1182475.1182476"
    },
    {
      "text": "Eric Brewer, Michael Demmer, Bowei Du, Melissa Ho, Matthew Kam, Sergiu Nedevschi, Joyojeet Pal, Rabin Patra, Sonesh Surana, and Kevin Fall. 2005. The case for technology in developing regions. Computer 38, 6 (2005), 25--38.  ",
      "doi": "10.1109/MC.2005.204"
    },
    {
      "text": "Jenna Burrell and Kentaro Toyama. 2009. What Constitutes Good ICTD Research? Information Technologies & International Development 5, 3 (Oct. 2009), pp. 82--94.",
      "doi": ""
    },
    {
      "text": "Ruy Cervantes, Mark Warschauer, Bonnie Nardi, and Nithya Sambasivan. 2011. Infrastructures for Low-cost Laptop Use in Mexican Schools. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 945--954.  ",
      "doi": "10.1145/1978942.1979082"
    },
    {
      "text": "Marshini Chetty and Rebecca E. Grinter. 2007. HCI4D: HCI Challenges in the Global South. In CHI '07 Extended Abstracts on Human Factors in Computing Systems (CHI EA '07). 2327--2332.  ",
      "doi": "10.1145/1240866.1241002"
    },
    {
      "text": "Padma Chirumamilla and Joyojeet Pal. 2013. Play and Power: A Ludic Design Proposal for ICTD. In Information and Communication Technologies and Development (ICTD '13). 25--33.  ",
      "doi": "10.1145/2516604.2516628"
    },
    {
      "text": "Edward Cutrell. 2011. Technology for Emerging Markets at MSR India. In Computer Supported Cooperative Work (CSCW '11). 9--16.  ",
      "doi": "10.1145/1958824.1958827"
    },
    {
      "text": "Rahmad Dawood, Steven J. Jackson, and Jude Yew. 2010. Supporting the Information Needs of Mobile Microentrepreneurs in the Developing World: The Case of Indonesian Food Cart Vendors. In Information and Communication Technologies and Development (ICTD '10). 7:1--7:10.  ",
      "doi": "10.1145/2369220.2369226"
    },
    {
      "text": "Nicola Dell, Jessica Crawford, Nathan Breit, Timoteo Chaluco, Aida Coelho, Joseph McCord, and Gaetano Borriello. 2013. Integrating ODK Scan into the Community Health Worker Supply Chain in Mozambique. In Information and Communication Technologies and Development. 228--237.  ",
      "doi": "10.1145/2516604.2516611"
    },
    {
      "text": "Nicola Dell, Ian Francis, Haynes Sheppard, Raiva Simbi, and Gaetano Borriello. 2014. Field Evaluation of a Camera-Based Mobile Health System in Low-Resource Settings. In Human-computer Interaction with Mobile Devices and Services (MobileHCI '14).  ",
      "doi": "10.1145/2628363.2628366"
    },
    {
      "text": "Nicola Dell, Vidya Vaidyanathan, Indrani Medhi, Edward Cutrell, and William Thies. 2012. \"Yours is Better!\": Participant Response Bias in HCI. In SIGCHI Conference on Human Factors in Computing Systems (CHI '12). 1321--1330.  ",
      "doi": "10.1145/2207676.2208589"
    },
    {
      "text": "Brian DeRenzi, Leah Findlater, Jonathan Payne, Benjamin Birnbaum, Joachim Mangilima, Tapan Parikh, Gaetano Borriello, and Neal Lesh. 2012. Improving Community Health Worker Performance Through Automated SMS. In Information and Communication Technologies and Development (ICTD '12). 25--34.  ",
      "doi": "10.1145/2160673.2160677"
    },
    {
      "text": "Jonathan Donner. 2008. Research Approaches to Mobile Use in the Developing World: A Review of the Literature. The Information Society 24, 3 (2008), 140--159.  ",
      "doi": "10.1080/01972240802019970"
    },
    {
      "text": "Vanessa Frias-Martinez, Jesus Virseda, and Aldo Gomero. 2012. Mobilizing Education: Evaluation of a Mobile Learning Tool in a Low-income School. In Human-computer Interaction with Mobile Devices and Services (MobileHCI '12). 441--450.  ",
      "doi": "10.1145/2371574.2371642"
    },
    {
      "text": "Rikin Gandhi, Rajesh Veeraraghavan, Kentaro Toyama, and Vanaja Ramprasad. 2007. Digital Green: Participatory video for agricultural extension. In Information and Communication Technologies and Development. IEEE, 1--10.",
      "doi": ""
    },
    {
      "text": "Shikoh Gitau and Gary Marsden. 2009. Fair Partnerships - Working with NGOs. In Human-Computer Interaction INTERACT. Springer, 704--707.  ",
      "doi": "10.1007/978-3-642-03655-2_77"
    },
    {
      "text": "Shikoh Gitau, Gary Marsden, and Jonathan Donner. 2010. After Access: Challenges Facing Mobile-only Internet Users in the Developing World. In Human Factors in Computing Systems (CHI '10). 2603--2606.  ",
      "doi": "10.1145/1753326.1753720"
    },
    {
      "text": "Shikoh Gitau, Paul Plantinga, Kathleen Diga, and David Hutchful. 2011. African ICTD Research (or the Lack Thereof). Interactions 18, 4 (2011), 74--77.  ",
      "doi": "10.1145/1978822.1978837"
    },
    {
      "text": "Ricardo Gomez, Luis F. Baron, and Brittany Fiore-Silfvast. 2012. The Changing Field of ICTD: Content Analysis of Research Published in Selected Journals and Conferences, 2000--2010. In Information and Communication Technologies and Development (ICTD '12). 65--74.  ",
      "doi": "10.1145/2160673.2160682"
    },
    {
      "text": "Rebecca Grinter. 2016. Knowing the Oriental. In Critical Theory and Interaction Design, J. Bardzell, S. Bardzell, and M Blythe (Eds.). MIT Press.",
      "doi": ""
    },
    {
      "text": "Carl Hartung, Yaw Anokwa, Waylon Brunette, Adam Lerer, Clint Tseng, and Gaetano Borriello. 2010. Open Data Kit: Building Information Services for Developing Regions. In International Conference on Information and Communication Technologies and Development (ICTD). 10.  ",
      "doi": "10.1145/2369220.2369236"
    },
    {
      "text": "Melissa R. Ho, Thomas N. Smyth, Matthew Kam, and Andy Dearden. 2009. Human-Computer Interaction for Development: The Past, Present, and Future. Information Technologies & International Development 5, 4 (2009).",
      "doi": ""
    },
    {
      "text": "CHI 2016 homepage. 2016. http://chi2016.acm.org/wp/. (2016).",
      "doi": ""
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial computing: a lens on design and development. In Human Factors in Computing Systems (CHI '10). 1311--1320.  ",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Steven J. Jackson, Alex Pompe, and Gabriel Krieshok. 2012a. Repair Worlds: Maintenance, Repair, and ICT for Development in Rural Namibia. In Proceedings of the ACM 2012 Conference on Computer Supported Cooperative Work (CSCW '12). ACM, New York, NY, USA, 107--116.  ",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Steven J. Jackson, Alex Pompe, and Gabriel Krieshok. 2012b. Repair Worlds: Maintenance, Repair, and ICT for Development in Rural Namibia. In Computer Supported Cooperative Work (CSCW '12). 107--116.  ",
      "doi": "10.1145/2145204.2145224"
    },
    {
      "text": "Anirudha Joshi, Mandar Rane, Debjani Roy, Nagraj Emmadi, Padma Srinivasan, N. Kumarasamy, Sanjay Pujari, Davidson Solomon, Rashmi Rodrigues, D.G. Saple, Kamalika Sen, Els Veldeman, and Romain Rutten. 2014. Supporting Treatment of People Living with HIV / AIDS in Resource Limited Settings with IVRs. In Human Factors in Computing Systems (CHI '14). 1595--1604.  ",
      "doi": "10.1145/2556288.2557236"
    },
    {
      "text": "M Kam, A Mathur, A Kumar, and J Canny. 2009. Designing digital games for rural children: a study of traditional village games in India. In SIGCHI Human Factors in Computing Systems. 31--40.  ",
      "doi": "10.1145/1518701.1518707"
    },
    {
      "text": "Beth E. Kolko, Alexis Hope, Waylon Brunette, Karen Saville, Wayne Gerard, Michael Kawooya, and Robert Nathan. 2012. Adapting Collaborative Radiological Practice to Low-resource Environments. In Computer Supported Cooperative Work (CSCW '12). 97--106.  ",
      "doi": "10.1145/2145204.2145223"
    },
    {
      "text": "Beth E. Kolko and Cynthia Putnam. 2009. Computer Games in the Developing World: The Value of Non-instrumental Engagement with ICTs, or Taking Play Seriously. In Information and Communication Technologies and Development (ICTD'09). 46--55. ",
      "doi": "10.5555/1812530.1812536"
    },
    {
      "text": "Neha Kumar and Nimmi Rangaswamy. 2013. The Mobile Media Actor-network in Urban India. In Human Factors in Computing Systems (CHI '13).  ",
      "doi": "10.1145/2470654.2466263"
    },
    {
      "text": "Ilda Ladeira and Edward Cutrell. 2010. Teaching with Storytelling: An Investigation of Narrative Videos for Skills Training. In Information and Communication Technologies and Development (ICTD '10).  ",
      "doi": "10.1145/2369220.2369240"
    },
    {
      "text": "Indrani Medhi, Somani Patnaik, Emma Brunskill, S.N. Nagasena Gautama, William Thies, and Kentaro Toyama. 2011. Designing Mobile Interfaces for Novice and Low-literacy Users. ACM Trans. Comput.-Hum. Interact. 18, 1 (2011), 2:1--2:28.  ",
      "doi": "10.1145/1959022.1959024"
    },
    {
      "text": "Preeti Mudliar, Jonathan Donner, and William Thies. 2012. Emergent Practices Around CGNet Swara, Voice Forum for Citizen Journalism in Rural India. In Proceedings of the Fifth International Conference on Information and Communication Technologies and Development (ICTD '12). ACM, New York, NY, USA, 159--168.  ",
      "doi": "10.1145/2160673.2160695"
    },
    {
      "text": "Anne Oeldorf-Hirsch, Jonathan Donner, and Edward Cutrell. 2012. How Bad is Good Enough?: Exploring Mobile Video Quality Trade-offs for Bandwidth-constrained Consumers. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, New York, NY, USA, 49--58.  ",
      "doi": "10.1145/2399016.2399025"
    },
    {
      "text": "Niranjan Pai, Pradnya Supe, Shailesh Kore, Y. S. Nandanwar, Aparna Hegde, Edward Cutrell, and William Thies. 2013. Using Automated Voice Calls to Improve Adherence to Iron Supplements During Pregnancy: A Pilot Study. In Information and Communication Technologies and Development. 153--163.  ",
      "doi": "10.1145/2516604.2516608"
    },
    {
      "text": "Neil Patel and Sheetal K. Agarwal and Nitendra Rajput and Amit Anil Nanavati and Paresh Dave and Tapan S. Parikh. 2008. Experiences designing a voice interface for rural India. In 2008 IEEE Spoken Language Technology Workshop, SLT, Amitava Das and Srinivas Bangalore (Ed.). IEEE, 21--24.",
      "doi": ""
    },
    {
      "text": "Gaurav Paruthi and William Thies. 2011. Utilizing DVD Players As Low-cost Offline Internet Browsers. In SIGCHI Conference on Human Factors in Computing Systems (CHI '11). 955--958.  ",
      "doi": "10.1145/1978942.1979083"
    },
    {
      "text": "Neil Patel, Deepti Chittamuru, Anupam Jain, Paresh Dave, and Tapan S. Parikh. 2010. Avaaj Otalo: A Field Study of an Interactive Voice Forum for Small Farmers in Rural India. In SIGCHI Conference on Human Factors in Computing Systems (CHI '10). 733--742.  ",
      "doi": "10.1145/1753326.1753434"
    },
    {
      "text": "Somani Patnaik, Emma Brunskill, and William Thies. 2009. Evaluating the Accuracy of Data Collection on Mobile Phones: A Study of Forms, SMS, and Voice. In Information and Communication Technologies and Development (ICTD'09). 74--84. ",
      "doi": "10.5555/1812530.1812539"
    },
    {
      "text": "Rabin Patra, Joyojeet Pal, and Sergiu Nedevschi. 2009. ICTD State of the Union: Where Have We Reached and Where Are We Headed. In Information and Communication Technologies and Development (ICTD'09). 357--366. ",
      "doi": "10.5555/1812530.1812567"
    },
    {
      "text": "D. Ramachandran, J. Canny, P. D Das, and E. Cutrell. 2010. Mobile-izing health workers in rural India. In Human factors in computing systems. 1889--1898.  ",
      "doi": "10.1145/1753326.1753610"
    },
    {
      "text": "Aishwarya Ratan, Kentaro Toyama, Sunandan Chakraborty, Keng Siang Ooi, Mike Koenig, Pushkar V. Chitnis, and Matthew Phiong. 2010. Managing Microfinance with Paper, Pen and Digital Slate. In Proceedings of the 4th ACM/IEEE International Conference on Information and Communication Technologies and Development (ICTD '10). ACM, New York, NY, USA, Article 37, 37:1--37:11 pages.  ",
      "doi": "10.1145/2369220.2369255"
    },
    {
      "text": "Yvonne Rogers and Gary Marsden. 2013. Does He Take Sugar?: Moving Beyond the Rhetoric of Compassion. interactions 20, 4 (July 2013), 48--57. DOI: http://dx.doi.org/10.1145/2486227.2486238  ",
      "doi": "10.1145/2486227.2486238"
    },
    {
      "text": "Daniela K. Rosner and Morgan Ames. 2014. Designing for Repair?: Infrastructures and Materialities of Breakdown. In Computer Supported Cooperative Work & Social Computing (CSCW '14). 319--331.  ",
      "doi": "10.1145/2531602.2531692"
    },
    {
      "text": "Nithya Sambasivan, Ed Cutrell, Kentaro Toyama, and Bonnie Nardi. 2010. Intermediated Technology Use in Developing Communities. In SIGCHI Conference on Human Factors in Computing Systems (CHI '10). 2583--2592.  ",
      "doi": "10.1145/1753326.1753718"
    },
    {
      "text": "Clifford Schmidt, Trina Jean Gorman, Andrew Azaabanye Bayor, and Michael Shayne Gary. 2010. Impact of Low-cost, On-demand, Information Access in a Remote Ghanaian Village. In Information and Communication Technologies and Development (ICTD '10). 43:1--43:10.  ",
      "doi": "10.1145/2369220.2369261"
    },
    {
      "text": "Gursharan Singh, Leah Findlater, Kentaro Toyama, Scott Helmer, Rikin Gandhi, and Ravin Balakrishnan. 2009. Numeric Paper Forms for NGOs. In Information and Communication Technologies and Development. 406--416. ",
      "doi": "10.5555/1812530.1812571"
    },
    {
      "text": "Thomas N. Smyth and Michael L. Best. 2013. Tweet to Trust: Social Media and Elections in West Africa. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development (ICTD '13). ACM, New York, NY, USA, 133--141.  ",
      "doi": "10.1145/2516604.2516617"
    },
    {
      "text": "Janaki Srinivasan. 2010. Looking Beyond 'Information Provision': The Importance of Being a Kiosk Operator in the Sustainable Access in Rural India (SARI) Project, Tamilnadu, India. In Information and Communication Technologies and Development. 44:1--44:9.  ",
      "doi": "10.1145/2369220.2369262"
    },
    {
      "text": "Alex S Taylor. 2011. Out there. In SIGCHI Conference on Human Factors in Computing Systems (CHI '11). 685--694.  ",
      "doi": "10.1145/1978942.1979042"
    },
    {
      "text": "Kentaro Toyama. 2010. Human-Computer Interaction and Global Development. Foundations and Trends in Human-Computer Interaction 4, 1 (2010), 1--79.  ",
      "doi": "10.1561/1100000021"
    },
    {
      "text": "Heather Underwood, S. Revi Sterling, and John K. Bennett. 2013. The PartoPen in Practice: Evaluating the Impact of Digital Pen Technology on Maternal Health in Kenya. In Information and Communication Technologies and Development (ICTD '13). 274--283.  ",
      "doi": "10.1145/2516604.2516613"
    },
    {
      "text": "Elba del Carmen Valderrama Bahamondez, Christian Winkler, and Albrecht Schmidt. 2011. Utilizing Multimedia Capabilities of Mobile Phones to Support Teaching in Schools in Rural Panama. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, New York, NY, USA, 935--944.  ",
      "doi": "10.1145/1978942.1979081"
    },
    {
      "text": "Rajesh Veeraraghavan, Naga Yasodhar, and Kentaro Toyama. 2007. Warana Unwired: Replacing PCs with Mobile Phones in a Rural Sugarcane Cooperative. In Information and Communication Technologies for Development (ICTD '07). 10.",
      "doi": ""
    },
    {
      "text": "Susan P. Wyche, Sarita Yardi Schoenebeck, and Andrea Forte. 2013. \"Facebook is a Luxury\": An Exploratory Study of Social Media Use in Rural Kenya. In Computer Supported Cooperative Work (CSCW '13). 33--44.  ",
      "doi": "10.1145/2441776.2441783"
    }
  ]
}