{
  "doi": "10.1145/2858036.2858149",
  "title": "Make it Simple, or Force Users to Read?: Paraphrased Design Improves Comprehension of End User License Agreements",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "5252-5256",
  "year": 2016,
  "badges": [],
  "abstract": "Users often react negatively towards applications that track their personal information, even though they have consented to such tracking by hitting the \"I Agree\" button on the application's end user license agreement (EULA). This is because most users do not read the EULA carefully. The language and presentation of EULAs are often dull, dense and inaccessible. Researchers have proposed design options for heightening comprehension of EULA content, but the effectiveness of these suggestions is unclear. To address this gap, we conducted an experiment that examined how users' attitudes towards EULAs are affected by paraphrased and forced EULA formats. Paraphrased EULA presentations increased the time spent on reading the EULA. Moreover, they elicited more positive attitudes toward the EULA, which in turn predicted better comprehension. These findings hold implications for design of EULAs by showing that complex content displayed in simple terms across multiple windows can increase reader comprehension.",
  "authors": [
    {
      "name": "T. Franklin Waddell",
      "institution": "Penn State, State College, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958743557",
      "orcid": "missing"
    },
    {
      "name": "Joshua R. Auriemma",
      "institution": "DramaFever, Philadelphia, PA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659022071",
      "orcid": "missing"
    },
    {
      "name": "S. Shyam Sundar",
      "institution": "The Pennsylvania State University, University Park, PA, USA",
      "img": "/do/10.1145/contrib-81456626968/rel-imgonly/shyam.jpeg",
      "acmid": "81456626968",
      "orcid": "0000-0002-5779-8864"
    }
  ],
  "references": [
    {
      "text": "Ben-Shahar, O. The myth of the \"opportunity to read\" in contract law. European Review of Contract Law, 5, 1(2009), 1--28.",
      "doi": ""
    },
    {
      "text": "Bernstein, G. R. The fine print: Redesigning legal contracts for the digital environment. Retrieved from http://typographichub.org/images/uploads/downloads/th e_fine_print.pdf",
      "doi": ""
    },
    {
      "text": "Böhme, & Köspell, S. Trained to accept? A field experiment on consent dialogues. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2010, 2403--2406.  ",
      "doi": "10.1145/1753326.1753689"
    },
    {
      "text": "Good, N. S., Grossklags, J., Mulligan, D. K., & Konstan, J. A. Noticing notice: A large-scale experiment on the timing of software licensing agreements. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2007, 607--616.  ",
      "doi": "10.1145/1240624.1240720"
    },
    {
      "text": "Hayes, A., & Preacher. Statistical mediation analysis with a multicategorical independent variable. British Journal of Mathematical and Statistical Psychology, in press.",
      "doi": ""
    },
    {
      "text": "Kay, M., & Terry, M. Textured agreements: Reenvisioning electronic consent. Proceedings of the Sixth Symposium on Usable Privacy and Security, 2010.  ",
      "doi": "10.1145/1837110.1837127"
    },
    {
      "text": "Masson, M. E. J., & Waldron, M. A. Comprehension of legal contracts by non-experts. Applied Cognitive Psychology, 8, 1(1994), 67--85.",
      "doi": ""
    },
    {
      "text": "Nielsen, J. Designing Web Usability. Berkeley: New Riders 2000.",
      "doi": "10.5555/519216"
    }
  ]
}