{
  "doi": "10.1145/2858036.2858437",
  "title": "Sleep Debt in Student Life: Online Attention Focus, Facebook, and Mood",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "5517-5528",
  "year": 2016,
  "badges": [],
  "abstract": "The amount of sleep college students receive has become a pressing societal concern. While studies show that information technology (IT) use affects sleep, here we examine the converse: how sleep duration might affect IT use. We conducted an in situ study, and logged computer and phone use and collected sleep diaries and daily surveys of 76 college students for seven days, all waking hours. We examined effects of sleep duration and sleep debt. Our results show that with less sleep, people report higher perceived work pressure and productivity. Also, computer focus duration is significantly shorter suggesting higher multitasking. The more sleep debt, the more Facebook use and the higher the negative mood. With less sleep, people may seek out activities requiring less attentional resources such as social media use. Our results have theoretical implications for multitasking: physiological and cognitive reasons could explain more computer activity switches: related to less sleep.",
  "authors": [
    {
      "name": "Gloria Mark",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100279599",
      "orcid": "missing"
    },
    {
      "name": "Yiran Wang",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81554131256",
      "orcid": "missing"
    },
    {
      "name": "Melissa Niiya",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87959136757",
      "orcid": "missing"
    },
    {
      "name": "Stephanie Reich",
      "institution": "University of California, Irvine, Irvine, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658691438",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sue K. Adams, Jennifer F. Daly, and Desireé N. Williford. 2013. Adolescent sleep and cellular phone use: Recent trends and implications for research. Health Services Insights 6: 99--103.",
      "doi": ""
    },
    {
      "text": "Torbjörn Åkerstedt. 1988. Sleepiness as a consequence of shift work. Sleep 11, 1: 17--34.",
      "doi": ""
    },
    {
      "text": "Jared S. Bauer, Sunny Consolvo, Benjamin Greenstein, Jonathan Schooler, Eric Wu, Nathaniel F. Watson, and Julie Kientz. 2010. ShutEye: encouraging awareness of healthy sleep recommendations with a mobile, peripheral display. In Proc. of CHI'10, 1401--1410.  ",
      "doi": "10.1145/2207676.2208600"
    },
    {
      "text": "Virginie Bayon, Damien Leger, Danielle GomezMerino, Marie-Françoise Vecchierini, and Mounir Chennaoui. 2014. Sleep debt and obesity, Annals of Medicine 46, 5: 264--272.",
      "doi": ""
    },
    {
      "text": "Craig M. Becker, Troy Adams, Caroline Orr, and Lyndsay Quilter. 2008. Correlates of quality sleep and academic performance. Health Educator 40, 2: 82--89.",
      "doi": ""
    },
    {
      "text": "Michael H. Bonnet and Donna L. Arand. 1995. We are chronically sleep deprived. Sleep 18, 10: 908-911.",
      "doi": ""
    },
    {
      "text": "Richard R. Bootzin and Mindy Engle-Friedman. 1981. The assessment of insomnia. Behavioral Assessment 3: 107--126.",
      "doi": ""
    },
    {
      "text": "Walter C. Buboltz Jr, Franklin Brown, and Barlow Soper. 2001. Sleep habits and patterns of college students: a preliminary study. J of American College Health 50, 3: 131--135.",
      "doi": ""
    },
    {
      "text": "Christina J. Calamaro, Thornton BA Mason, and Sarah J. Ratcliffe. 2009. Adolescents living the 24/7 lifestyle: effects of caffeine and technology on sleep duration and daytime functioning. Pediatrics 123, 6: e1005-e1010.",
      "doi": ""
    },
    {
      "text": "Center for Disease Control. Unhealthy sleep-related behaviors 12 States, 2009. 2011. Morbidity and mortality weekly report 60, 8: 233--238.",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Sunny Consolvo, Nathaniel F. Watson, and Julie A. Kientz. 2011. Opportunities for computing technologies to support healthy sleep behaviors. In Proc of CHI'11. 3053--3062.  ",
      "doi": "10.1145/1978942.1979395"
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. 2004. A diary study of task switching and interruptions. In Proc of CHI '04, 175--182.  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Bernhard Debatin, Jennette P. Lovejoy, Ann-Kathrin Horn, and Brittany N. Hughes. 2009. Facebook and online privacy: Attitudes, behaviors, and unintended consequences. Journal of Computer-Mediated Communication 15, 1: 83--108.",
      "doi": ""
    },
    {
      "text": "Maeve Duggan, Nicole B. Ellison, Cliff Lampe, Amanda Lenhart, and Mary Madden. 2014. 2014. Social Media Update 2014. Pew Research Center. http://www.pewinternet.org/2015/01/09/social-mediaupdate-2014/. Accessed Sept. 2015.",
      "doi": ""
    },
    {
      "text": "Jeffrey S. Durmer and David F. Dinges. 2005. Neurocognitive consequences of sleep deprivation. Seminars in neurology 25, 1: 117--129.",
      "doi": ""
    },
    {
      "text": "Lloyd J. Edwards, Keith E. Muller, Russell D. Wolfinger, Bahjat F. Qaqish, and Oliver Schabenberger. 2008. An R2 statistic for fixed effects in the linear mixed model. Statistics in medicine 27, 29: 6137--6157.",
      "doi": ""
    },
    {
      "text": "Shirley Fisher. 1980. The microstructure of dual-task interaction: IV. Sleep deprivation and the control of attention. Perception 9, 3: 327--337.",
      "doi": ""
    },
    {
      "text": "J. Friedmann, G. Globus, A. Huntley, D. Mullaney, P. Naitoh, and L. Johnson. 1977. Performance and mood during and after gradual sleep reduction. Psychophysiology 14: 245-50.",
      "doi": ""
    },
    {
      "text": "Victor M. Gonzalez and Gloria Mark. 2004. \"Constant, Constant, Multi-tasking Craziness\": Managing Multiple Working Spheres. In Proc of CHI '04, 113--120.  ",
      "doi": "10.1145/985692.985707"
    },
    {
      "text": "Christopher M. Jung, Joseph M. Ronda, and Charles A. Czeisler. 2011. Comparison of sustained attention assessed by auditory and visual psychomotor vigilance tasks prior to and during sleep deprivation. Journal of sleep research 20, 2: 348--355.",
      "doi": ""
    },
    {
      "text": "Reynol Junco. 2012. The relationship between frequency of Facebook use, participation in Facebook activities, and student engagement. Computers & Education, 58(1), pp.162--171.  ",
      "doi": "10.1016/j.compedu.2011.08.004"
    },
    {
      "text": "Amy K. Karlson, Shamsi T. Iqbal, Brian Meyers, Gonzalo Ramos, Kathy Lee, and John C. Tang. 2010. Mobile task flow in context: A screenshot study of smartphone usage. In Proc of CHI'10, 2009--2018.  ",
      "doi": "10.1145/1753326.1753631"
    },
    {
      "text": "Gerald Krueger. 1989. Sustained work, fatigue, sleep loss and performance: A review of the issues. Work & Stress, 3, 2: 129--141.",
      "doi": ""
    },
    {
      "text": "Shaun Lawson, Sue Jamison-Powell, Andrew Garbett, Conor Linehan, Erica Kucharczyk, Sanne Verbaan, Duncan A. Rowland, and Kevin Morgan. 2013. Validating a mobile phone application for the everyday, unobtrusive, objective measurement of sleep. In Proc. of CHI'13, 2497--2506.  ",
      "doi": "10.1145/2470654.2481345"
    },
    {
      "text": "Uichin Lee, Joonwon Lee, Minsam Ko, Changhun Lee, Yuhwan Kim, Subin Yang, Koji Yatani, Gahgene Gweon, Kyong-Mee Chung, and Junehwa Song. 2014. Hooked on smartphones: an exploratory study on smartphone overuse among college students. In Proc of CHI'14, 2327--2336.  ",
      "doi": "10.1145/2556288.2557366"
    },
    {
      "text": "Julian Lim and David Dinges. 2008. Sleep deprivation and vigilant attention. Annals of the NY Academy of Sciences 1129, 1: 305--322.",
      "doi": ""
    },
    {
      "text": "Ya Liu, Zhenhong Wang, and Wei Lü. 2013. Resilience and affect balance as mediators between trait emotional intelligence and life satisfaction. Personality and Individual Differences 54.7: 850--855.",
      "doi": ""
    },
    {
      "text": "Hannah G. Lund, Brian D. Reider, Annie B. Whiting, and J. Roxanne Prichard. 2010. Sleep patterns and predictors of disturbed sleep in a large population of college students. Journal of Adolescent Health 46, 2: 124--132.",
      "doi": ""
    },
    {
      "text": "Faith S. Luyster, Patrick J. Strollo, Jr., Phyllis C. Zee, and James K. Walsh. 2012. Sleep: A Health Imperative. Sleep 35, 6: 727 -34.",
      "doi": ""
    },
    {
      "text": "Pierre Maquet. 2001. The role of sleep in learning and memory. Science 294, 5544: 1048-1051.",
      "doi": ""
    },
    {
      "text": "Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, and Paul Johns. 2014. Capturing the mood: Facebook and face-to-face encounters in the workplace. In Proc. of ACM Conference on Computer Supported Cooperative Work (CSCW'14), 1082--1094.  ",
      "doi": "10.1145/2531602.2531673"
    },
    {
      "text": "Gloria Mark, Steven Voida, and Armand Cardello. 2012. A pace not dictated by electrons: An empirical study of work without email. In Proc of CHI'12, 555564.  ",
      "doi": "10.1145/2207676.2207754"
    },
    {
      "text": "Gloria Mark, Yiran Wang, and Melissa Niiya. 2014. Stress and multitasking in everyday college life: An empirical study of online activity. In Proc of CHI'14, 41--50.  ",
      "doi": "10.1145/2556288.2557361"
    },
    {
      "text": "Jun-Ki Min, Afsaneh Doryab, Jason Wiese, Shahriyar Amini, John Zimmerman, and Jason I. Hong. 2014. Toss'n'turn: smartphone as sleep and sleep quality detector. In Proc. of CHI'14, 477--486.  ",
      "doi": "10.1145/2556288.2557220"
    },
    {
      "text": "Timothy H. Monk, Daniel J. Buysse, Jaime M. Potts, Jean M. DeGrazia, and David J. Kupfer. 2004. Morningness-eveningness and lifestyle regularity. Chronobiol Int'l 21, 3: 435-443.",
      "doi": ""
    },
    {
      "text": "Timothy H. Monk, Charles Reynolds, David J. Kupfer, Daniel J. Buysse, Patricia A. Coble, Amy J. Hayes, Mary Ann Machen, Susan R. Petrie, and Angela M. Ritenour. 1994. The Pittsburgh sleep diary. Journal of Sleep Research, 3: 111-120.",
      "doi": ""
    },
    {
      "text": "Janet Morahan-Martin and Phyllis Schumacher. 2000. Incidence and correlates of pathological Internet use among college students. Comp in Human Beh 16, 1: 1329.",
      "doi": ""
    },
    {
      "text": "Elizabeth L.,Murnane, Saeed Abdullah, Mark Matthews, Tanzeem Choudhury, and Geri Gay. 2015. Social (media) jet lag: How usage of social technology can modulate and reflect circadian rhythms. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing, 843--854.  ",
      "doi": "10.1145/2750858.2807522"
    },
    {
      "text": "Gwenn Schurgin O'Keeffe and Kathleen ClarkePearson. 2011. The impact of social media on children, adolescents, and families. Pediatrics127,4: 800--804.",
      "doi": ""
    },
    {
      "text": "Eyal Ophir, Clifford Nass, and Anthony D. Wagner. 2009. Cognitive control in media multitaskers. Proceedings of the National Academy of Sciences 106.37: 15583--15587.",
      "doi": ""
    },
    {
      "text": "June J. Pilcher, Douglas R. Ginter, and Brigitte Sadowsky. 1997. Sleep quality versus sleep quantity: relationships between sleep and measures of health, well-being and sleepiness in college students. Journal of psychosomatic research 42, 6: 583--596.",
      "doi": ""
    },
    {
      "text": "June J. Pilcher and Allen J. Huffcutt. 1996. Effects of sleep deprivation on performance: a meta-analysis. Sleep 19: 318-26.",
      "doi": ""
    },
    {
      "text": "June J. Pilcher and Amy Walters. 1997. How sleep deprivation affects psychological variables related to college students' cognitive performance. Journal of American College Health 46, 3: 121--126.",
      "doi": ""
    },
    {
      "text": "Till Roenneberg, Tim Kuehnle, Peter P. Pramstaller, Jan Ricken, Miriam Havel, Angelika Guth, and Martha Merrow. 2004. A marker for the end of adolescence. Current Biology 14, 24: R1038-R1039.",
      "doi": ""
    },
    {
      "text": "Avi Sadeh. 2011. The role and validity of actigraphy in sleep medicine: an update. Sleep medicine reviews 15, 4: 259--267.",
      "doi": ""
    },
    {
      "text": "Johnny Saldaña. 2012. The Coding Manual for Qualitative Researchers. Sage.",
      "doi": ""
    },
    {
      "text": "Kaveri Subrahmanyam, Stephanie M. Reich, Natalia Waechter, and Guadalupe Espinoza. 2008. Online and offline social networks: Use of social networking sites by emerging adults. J of Applied Developmental Psychology, 29, 6: 420--433.",
      "doi": ""
    },
    {
      "text": "S. H. Thompson and Eric Lougheed. 2002. Frazzled by Facebook? An exploratory study of gender differences in social network communication among undergraduate men and women. College Student J 46, 1: 88--99.",
      "doi": ""
    },
    {
      "text": "Mickey T. Trockel, Michael D. Barnes, and Dennis L. Egget. 2000. Health-related variables and academic performance among first-year college students: implications for sleep and other behaviors. J of American college health 49, 3: 125--131.",
      "doi": ""
    },
    {
      "text": "Jan Van den Bulck. 2004. Television viewing, computer game playing, and Internet use and self-reported time to bed and time out of bed in secondary-school children. Sleep 27, 1: 101--104.",
      "doi": ""
    },
    {
      "text": "Hans Van Dongen, Naomi Rogers, and David Dinges. 2003. Sleep debt: theoretical and empirical issues. Sleep and Biological Rhythms, 1, 5--13.",
      "doi": ""
    },
    {
      "text": "Yiran Wang, Melissa Niiya, Gloria Mark, Stephanie Reich, and Mark Warschauer. 2015. Coming of age (digitally): An ecological view of social media use among college students. In Proc of CSCW'15, 571--582.  ",
      "doi": "10.1145/2675133.2675271"
    },
    {
      "text": "David Watson, Lee A. Clark, and Auke Tellegen. 1988. Development and validation of brief measures of positive and negative affect: The PANAS scales. Journal of Personality and Social Psychology 56, 6: 1063--1070.",
      "doi": ""
    },
    {
      "text": "Amy R. Wolfson, Mary A. Carskadon, Christine Acebo, Ronald Seifer, Gahan Fallone, Susan E. Labyak, and Jennifer L. Martin. 2003. Evidence for the validity of a sleep habits survey for adolescents. Sleep, 2: 213--216.",
      "doi": ""
    },
    {
      "text": "Bu Zhong, Marie Hardin, and Tao Sun. 2011. Less effortful thinking leads to more social networking? The associations between the use of social network sites and personality traits. Computers in Human Behavior 27, 3: 1265--1271.  ",
      "doi": "10.1016/j.chb.2011.01.008"
    }
  ]
}