{
  "doi": "10.1145/2858036.2858284",
  "title": "PathSync: Multi-User Gestural Interaction with Touchless Rhythmic Path Mimicry",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "3415-3427",
  "year": 2016,
  "badges": [],
  "abstract": "In this paper, we present PathSync, a novel, distal and multi-user mid-air gestural technique based on the principle of rhythmic path mimicry; by replicating the movement of a screen-represented pattern with their hand, users can intuitively interact with digital objects quickly, and with a high level of accuracy. We present three studies that each contribute (1) improvements to how correlation is calculated in path-mimicry techniques necessary for touchless interaction, (2) a validation of its efficiency in comparison to existing techniques, and (3) a demonstration of its intuitiveness and multi-user capacity 'in the wild'. Our studies consequently demonstrate PathSync's potential as an immediately legitimate alternative to existing techniques, with key advantages for public display and multi-user applications.",
  "authors": [
    {
      "name": "Marcus Carter",
      "institution": "The University of Melbourne, Melbourne, VIC, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81543822756",
      "orcid": "missing"
    },
    {
      "name": "Eduardo Velloso",
      "institution": "Lancaster University, Lancaster, Lancashire, United Kingdom",
      "img": "/do/10.1145/contrib-81488669445/rel-imgonly/profilepic.jpg",
      "acmid": "81488669445",
      "orcid": "0000-0003-4414-2249"
    },
    {
      "name": "John Downs",
      "institution": "The University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81416594194/rel-imgonly/64084_512616073298_217700468_421658_2142474_n.jpg",
      "acmid": "81416594194",
      "orcid": "missing"
    },
    {
      "name": "Abigail Sellen",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    },
    {
      "name": "Kenton O'Hara",
      "institution": "Microsoft Research, Cambridge, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452615958",
      "orcid": "missing"
    },
    {
      "name": "Frank Vetere",
      "institution": "The University of Melbourne, Melbourne, VIC, Australia",
      "img": "/do/10.1145/contrib-81100490463/rel-imgonly/photo-vetereciswebsite.jpeg",
      "acmid": "81100490463",
      "orcid": "0000-0003-3727-9204"
    }
  ],
  "references": [
    {
      "text": "Carmelo Ardito, Paolo Buono, Maria Francesca Costabile, and Giuseppe Desolda. 2015. Interaction with Large Displays: A Survey. ACM Comput. Surv. 47, 3, Article 46 (February 2015), 38 pages. DOI=10.1145/2682623  ",
      "doi": "10.1145/2682623"
    },
    {
      "text": "Ali Bigdelou, Loren Schwarz, and Nassir Navab. 2012. An adaptive solution for intra-operative gesturebased human-machine interaction. In Proceedings of the 2012 ACM international conference on Intelligent User Interfaces (IUI '12), USA, 75--84. DOI=10.1145/2166966.2166981  ",
      "doi": "10.1145/2166966.2166981"
    },
    {
      "text": "Renaud Blanch, Yves Guiard, and Michel BeaudouinLafon. 2004. Semantic pointing: improving target acquisition with control-display ratio adaptation. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04), 519--526. DOI=http://dx.doi.org/10.1145/985692.985758  ",
      "doi": "10.1145/985692.985758"
    },
    {
      "text": "Arthur Theil Cabreira and Faustina Hwang. 2015. An analysis of mid-air gestures used across three platforms. In Proceedings of the 2015 British HCI Conference (British HCI '15), USA, 257--258. DOI=10.1145/2783446.2783599  ",
      "doi": "10.1145/2783446.2783599"
    },
    {
      "text": "Marcus Carter, John Downs, Bjorn Nansen, Mitchell Harrop, and Martin Gibbs. 2014. Paradigms of games research in HCI: a review of 10 years of research at CHI. In Proceedings of the first ACM SIGCHI annual symposium on Computer-human interaction in play (CHI PLAY '14), 27--36. DOI=10.1145/2658537.2658708  ",
      "doi": "10.1145/2658537.2658708"
    },
    {
      "text": "Debaleena Chattopadhyay and Davide Bolchini. 2014. Touchless circular menus: toward an intuitive UI for touchless interactions with large displays. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14), 33--40. DOI=10.1145/2598153.2598181  ",
      "doi": "10.1145/2598153.2598181"
    },
    {
      "text": "John Downs, Frank Vetere, and Wally Smith. 2015. Differentiated Participation in Social Videogaming. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15), 92--100. DOI=http://dx.doi.org/10.1145/2838739.2838777  ",
      "doi": "10.1145/2838739.2838777"
    },
    {
      "text": "Augusto Esteves, Eduardo Velloso, Andreas Bulling and Hans Gellersen. 2015. Orbits: Enabling Gaze Interaction in Smart Watches Using Moving Targets. In Proceedings of the 2015 ACM Conference on Pervasive and Ubiquitous Computing (UbiComp '15).  ",
      "doi": "10.1145/2800835.2800942"
    },
    {
      "text": "Augusto Esteves, Eduardo Velloso, Andreas Bulling and Hans Gellersen. 2015. Orbits: Gaze Interaction for Smart Watches using Smooth Pursuit Eye Movements. In Proceedings of the 28th ACM User Interface Software and Technology Symposium (UIST'15).  ",
      "doi": "10.1145/2807442.2807499"
    },
    {
      "text": "Jean-Daniel Fekete, Niklas Elmqvist, and Yves Guiard. 2009. Motion-pointing: target selection using elliptical motions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 289--298. DOI=10.1145/1518701.1518748  ",
      "doi": "10.1145/1518701.1518748"
    },
    {
      "text": "Lyndsey Fisk, Marcus Carter, Behnaz Rostami Yeganeh, Frank Vetere, and Bernd Ploderer. 2014. Implicit and explicit interactions in video mediated collaboration. In Proceedings of the 26th Australian Computer-Human Interaction Conference on Designing Futures: the Future of Design (OzCHI '14), 250--259. DOI=10.1145/2686612.2686650  ",
      "doi": "10.1145/2686612.2686650"
    },
    {
      "text": "Simon Fothergill, Helena Mentis, Pushmeet Kohli, and Sebastian Nowozin. 2012. Instructing people for training gestural interactive systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12), 1737--1746. DOI=10.1145/2207676.2208303  ",
      "doi": "10.1145/2207676.2208303"
    },
    {
      "text": "Franca Garzotto and Matteo Valoriani. 2013. Touchless gestural interaction with small displays: a case study. In Proceedings of the Biannual Conference of the Italian Chapter of SIGCHI (CHItaly '13), USA,, Article 26, 10 pages. DOI=10.1145/2499149.2499154  ",
      "doi": "10.1145/2499149.2499154"
    },
    {
      "text": "Emilien Ghomi, Guillaume Faure, Stéphane Huot, Olivier Chapuis, and Michel Beaudouin-Lafon. 2012. Using rhythmic patterns as an input method. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12, 1253--1262. DOI=10.1145/2207676.2208579  ",
      "doi": "10.1145/2207676.2208579"
    },
    {
      "text": "Sukeshini A. Grandhi, Gina Joue, and Irene Mittelberg. 2011. Understanding naturalness and intuitiveness in gesture production: insights for touchless gestural interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), USA, 821--824. DOI=10.1145/1978942.1979061  ",
      "doi": "10.1145/1978942.1979061"
    },
    {
      "text": "Darren Guinness, Alvin Jude, G. Michael Poor, and Ashley Dover. 2015. Models for Rested Touchless Gestural Interaction. In Proceedings of the 3rd ACM Symposium on Spatial User Interaction (SUI '15), 3443. DOI=10.1145/2788940.2788948  ",
      "doi": "10.1145/2788940.2788948"
    },
    {
      "text": "John Hardy, Enrico Rukzio, and Nigel Davies. 2011. Real world responses to interactive gesture based public displays. In Proceedings of the 10th International Conference on Mobile and Ubiquitous Multimedia (MUM '11), 33--39. DOI=10.1145/2107596.2107600  ",
      "doi": "10.1145/2107596.2107600"
    },
    {
      "text": "Juan David Hincapié-Ramos, Xiang Guo, and Pourang Irani. 2014. The consumed endurance workbench: a tool to assess arm fatigue during mid-air interactions. In Proceedings of the 2014 companion publication on Designing interactive systems (DIS Companion '14), 109--112. DOI=10.1145/2598784.2602795  ",
      "doi": "10.1145/2598784.2602795"
    },
    {
      "text": "Chien-Ho Janice Lin, Katherine J. Sullivan, Allan D. Wu, Shailesh Kantak, and Carolee J. Winstein. 2007. Effect of task practice order on motor skill learning in adults with Parkinson disease: a pilot study. Physical therapy 87, 9: 1120--1131.",
      "doi": ""
    },
    {
      "text": "Alvin Jude, G. Michael Poor, and Darren Guinness. 2014. Personal space: user defined gesture space for GUI interaction. In CHI '14 Extended Abstracts on Human Factors in Computing Systems (CHI EA '14), USA, 1615--1620. DOI=10.1145/2559206.2581242  ",
      "doi": "10.1145/2559206.2581242"
    },
    {
      "text": "Timothy Lee and Elizabeth Genovese. 1988. Distribution of practice in motor skill acquisition: Learning and performance effects reconsidered. Research Quarterly for Exercise and Sport 59, 4: 277--287.",
      "doi": ""
    },
    {
      "text": "Ville Mäkelä, Tomi Heimonen, and Markku Turunen. 2014. Magnetic Cursor: Improving Target Selection in Freehand Pointing Interfaces. In Proceedings of The International Symposium on Pervasive Displays (PerDis '14), 112 -118, DOI=http://dx.doi.org/10.1145/2611009.2611025  ",
      "doi": "10.1145/2611009.2611025"
    },
    {
      "text": "Alessio Malizia and Andrea Bellucci. 2012. The artificiality of natural user interfaces. Commun. ACM 55, 3 (March 2012), 36--38. DOI=10.1145/2093548.2093563  ",
      "doi": "10.1145/2093548.2093563"
    },
    {
      "text": "Anders Markussen, Mikkel Rønne Jakobsen, and Kasper Hornbæk. 2014. Vulture: a mid-air wordgesture keyboard. In Proceedings of the 32nd annual ACM conference on Human factors in computing systems (CHI '14), 1073--1082. DOI=10.1145/2556288.2556964  ",
      "doi": "10.1145/2556288.2556964"
    },
    {
      "text": "Paul Marshall, Richard Morris, Yvonne Rogers, Stefan Kreitmayer, and Matt Davies. 2011. Rethinking 'multiuser': an in-the-wild study of how groups approach a walk-up-and-use tabletop interface. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11), 3033--3042. DOI=10.1145/1978942.1979392  ",
      "doi": "10.1145/1978942.1979392"
    },
    {
      "text": "Microsoft. Xbox 360 Kinect Gestures. Retrieved September 3, 2015 from http://support.xbox.com/enAU/xbox-360/kinect/body-controller.",
      "doi": ""
    },
    {
      "text": "George Miller. 1956. The magical number seven, plus or minus two: some limits on our capacity for processing information. Psychology Review 63, 2: 81.",
      "doi": ""
    },
    {
      "text": "Calkin S. Montero, Jason Alexander, Mark T. Marshall, and Sriram Subramanian. 2010. Would you do that?: understanding social acceptance of gestural interfaces. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services(MobileHCI '10), 275--278. DOI=10.1145/1851600.1851647  ",
      "doi": "10.1145/1851600.1851647"
    },
    {
      "text": "Tomoya Murata and Jungpil Shin. 2014. Hand Gesture and Character Recognition Based on Kinect Sensor. International Journal of Distributed Sensor Networks, Article ID 278460: 6 pages",
      "doi": ""
    },
    {
      "text": "Matei. Negulescu, Jaime Ruiz and Edward Lank. 2010. Exploring usability and learnability of mode inferencing in pen/tablet interfaces. In Proceedings of the Seventh Sketch-Based Interfaces and Modeling Symposium (SBIM '10), 87--94. ",
      "doi": "10.5555/1923363.1923379"
    },
    {
      "text": "Matei Negulescu, Jaime Ruiz, and Edward Lank. 2012. A recognition safety net: bi-level threshold recognition for mobile motion gestures. In Proceedings of the 14th international conference on Human-computer interaction with mobile devices and services (MobileHCI '12), 147--150. DOI=10.1145/2371574.2371598  ",
      "doi": "10.1145/2371574.2371598"
    },
    {
      "text": "Donald A. Norman and Jakob Nielsen. 2010. Gestural interfaces: a step backward in usability. interactions 17, 5 (September 2010), 46--49. DOI=10.1145/1836216.1836228  ",
      "doi": "10.1145/1836216.1836228"
    },
    {
      "text": "Kenton O'Hara, Richard Harper, Helena Mentis, Abigail Sellen, and Alex Taylor. 2013. On the naturalness of touchless: Putting the \"interaction\" back into NUI. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 5 (April 2013), 25 pages. DOI=10.1145/2442106.2442111  ",
      "doi": "10.1145/2442106.2442111"
    },
    {
      "text": "Kenton O'Hara, Gerardo Gonzalez, Abigail Sellen, Graeme Penney, Andreas Varnavas, Helena Mentis, Antonio Criminisi, Robert Corish, Mark Rouncefield, Neville Dastur, and Tom Carrell. 2014. Touchless interaction in surgery. Commun. ACM 57, 1 (January 2014), 70--77. DOI=10.1145/2541883.2541899  ",
      "doi": "10.1145/2541883.2541899"
    },
    {
      "text": "Thammathip Piumsomboon, Adrian Clark, Mark Billinghurst, and Andy Cockburn. 2013. User-defined gestures for augmented reality. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13), 955--960. DOI=10.1145/2468356.2468527  ",
      "doi": "10.1145/2468356.2468527"
    },
    {
      "text": "Gustavo Rovelo, Donald Degraen, Davy Vanacken, Kris Luyten and Karin Connix. 2015. Gestu-Wan - An Intelligible Mid-Air Gesture Guidance System for Walk-up-and-Use Displays. In Proceedings of the International Conference on Human-Computer Interaction (INTERACT'15), 368--386. DOI= 10.1007/978--3--319--22668--2_28",
      "doi": "10.1007/978-3-319-22668-2_28"
    },
    {
      "text": "Hassan Saidinejad, Mahsa Teimourikia, Sara Comai, and Fabio Salice. 2014. Static hand poses for gestural interaction: a study. In Proceedings of the 2014 International Working Conference on Advanced Visual Interfaces (AVI '14), USA, 379--380. DOI=10.1145/2598153.2600049  ",
      "doi": "10.1145/2598153.2600049"
    },
    {
      "text": "Lawrence Sambrooks and Brett Wilkinson. 2013. Comparison of gestural, touch, and mouse interaction with Fitts' law. In Proceedings of the 25th Australian Computer-Human Interaction Conference: Augmentation, Application, Innovation, Collaboration (OzCHI '13), 119--122. DOI=10.1145/2541016.2541066  ",
      "doi": "10.1145/2541016.2541066"
    },
    {
      "text": "Matthias Schwaller and Denis Lalanne. 2013. Pointing in the air: Measuring the effect of hand selection strategies on performance and effort.\" Human Factors in Computing and Informatics. Springer Berlin Heidelberg: 732--747.",
      "doi": ""
    },
    {
      "text": "Julia Schwarz, Charles Claudius Marais, Tommer Leyvand, Scott E. Hudson, and Jennifer Mankoff. 2014. Combining body pose, gaze, and gesture to determine intention to interact in vision-based interfaces. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3443--3452.  ",
      "doi": "10.1145/2556288.2556989"
    },
    {
      "text": "Ben Shneiderman. 1997. Direct manipulation for comprehensible, predictable and controllable user interfaces. In Proceedings of the 2nd international conference on Intelligent user interfaces (IUI '97), 3339. DOI=10.1145/238218.238281  ",
      "doi": "10.1145/238218.238281"
    },
    {
      "text": "Helman Stern, Juan Wachs and Yael Edan. 2008. Optimal Consensus Intuitive Hand Gesture Vocabulary Design. In 2008 IEEE Int. Conference on Semantic Computing, 96--103. DOI= 10.1109/ICSC.2008.29.  ",
      "doi": "10.1109/ICSC.2008.29"
    },
    {
      "text": "Radu-Daniel Vatavu and Ionut-Alexandru Zaiti. 2014. Leap gestures for TV: insights from an elicitation study. In Proceedings of the 2014 ACM international conference on Interactive experiences for TV and online video (TVX '14), 131--138. DOI=10.1145/2602299.2602316  ",
      "doi": "10.1145/2602299.2602316"
    },
    {
      "text": "Mélodie Vidal, Andreas Bulling, and Hans Gellersen. 2013. Pursuits: spontaneous interaction with displays based on smooth pursuit eye movement and moving targets. In Proceedings of the 2013 ACM international joint conference on Pervasive and ubiquitous computing (UbiComp '13), 439--448. DOI=10.1145/2493432.2493477  ",
      "doi": "10.1145/2493432.2493477"
    },
    {
      "text": "Mélodie Vidal, Andreas Bulling, and Hans Gellersen. 2015. Pursuits: Spontaneous Eye-Based Interaction for Dynamic Interfaces. GetMobile: Mobile Comp. and Comm. 18, 4 (January 2015), 8--10. DOI=10.1145/2721914.2721917  ",
      "doi": "10.1145/2721914.2721917"
    },
    {
      "text": "Mélodie Vidal, Ken Pfeuffer, Andreas Bulling, and Hans W. Gellersen. 2013. Pursuits: eye-based interaction with moving targets. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13), 3147--3150. DOI=10.1145/2468356.2479632  ",
      "doi": "10.1145/2468356.2479632"
    },
    {
      "text": "Daniel Vogel and Ravin Balakrishnan. 2005. Distant freehand pointing and clicking on very large, high resolution displays. In Proceedings of the 18th annual ACM symposium on User interface software and technology (UIST '05), 33--42. DOI=10.1145/1095034.1095041  ",
      "doi": "10.1145/1095034.1095041"
    },
    {
      "text": "Robert Walter, Gilles Bailly, and Jörg Müller. 2013. StrikeAPose: revealing mid-air gestures on public displays. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13), 841850. DOI=10.1145/2470654.2470774  ",
      "doi": "10.1145/2470654.2470774"
    },
    {
      "text": "Daniel Wigdor and Dennis Wixon. 2011. Brave NUI World: Designing Natural User Interfaces for Touch and Gesture. Morgan Kaufman: London. ",
      "doi": "10.5555/1995309"
    },
    {
      "text": "John Williamson and Roderick Murray-Smith. 2004. Pointing without a pointer. In CHI '04 Extended Abstracts on Human Factors in Computing Systems (CHI EA '04), 1407--1410. DOI=10.1145/985921.986076  ",
      "doi": "10.1145/985921.986076"
    },
    {
      "text": "Soojeong Yoo, Callum Parker, Judy Kay, and Martin Tomitsch. 2015. To Dwell or Not to Dwell: An Evaluation of Mid-Air Gestures for Large Information Displays. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction (OzCHI '15), 187--191. DOI=http://dx.doi.org/10.1145/2838739.2838819  ",
      "doi": "10.1145/2838739.2838819"
    },
    {
      "text": "Bruno Zamborlin, Frederic Bevilacqua, Marco Gillies, and Mark D'inverno. 2014. Fluid gesture interaction design: Applications of continuous recognition for the design of modern gestural interfaces. ACM Trans. Interact. Intell. Syst. 3, 4, Article 22 (January 2014), 30 pages.  ",
      "doi": "10.1145/2543921"
    }
  ]
}