{
  "doi": "10.1145/2858036.2858499",
  "title": "Gazed and Confused: Understanding and Designing Shared Gaze for Remote Collaboration",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "2492-2496",
  "year": 2016,
  "badges": [],
  "abstract": "People utilize eye gaze as an important cue for monitoring attention and coordinating awareness. This study investigates how remote pairs make use of a graphical representation of their partner's eye-gaze during a tightly-coupled collaborative task. Our results suggest that reproducing shared gaze in a remote collaboration setting makes pairs more accurate when referring to linguistically complex objects by facilitating the production of efficient forms of deictic references. We discuss how the availability of gaze influences coordination strategies and implications for the design of shared gaze in remote collaboration systems.",
  "authors": [
    {
      "name": "Sarah D'Angelo",
      "institution": "Northwestern Univeristy, Evanston, IL, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658726495",
      "orcid": "missing"
    },
    {
      "name": "Darren Gergle",
      "institution": "Northwestern University, Evanston, IL, USA",
      "img": "/do/10.1145/contrib-81100246470/rel-imgonly/gergle-darren.jpg",
      "acmid": "81100246470",
      "orcid": "0000-0003-4052-0214"
    }
  ],
  "references": [
    {
      "text": "Ellen Gurman Bard, Robin L. Hill, Mary Ellen Foster, and Manabu Arai. 2014. Tuning accessibility of referring expressions in situated dialogue. Language, Cognition and Neuroscience 29, 8: 928--949.",
      "doi": ""
    },
    {
      "text": "Susan E. Brennan, Xin Chen, Christopher A. Dickinson, Mark B. Neider, and Gregory J. Zelinsky. 2008. Coordinating cognition: The costs and benefits of shared gaze during collaborative search. Cognition 106, 3: 1465--1477.",
      "doi": ""
    },
    {
      "text": "Jean Carletta, Robin L. Hill, Craig Nicol, Tim Taylor, Jan Peter De Ruiter, and Ellen Gurman Bard. 2010. Eyetracking for two-person tasks with manipulation of a virtual world. Behavior Research Methods 42, 1: 254--265.",
      "doi": ""
    },
    {
      "text": "Alan T. Clark and Darren Gergle. 2011. Mobile dual eye-tracking methods: challenges and opportunities. Proc. of International Workshop on Dual Eye Tracking.",
      "doi": ""
    },
    {
      "text": "Herbert H. Clark and Susan E. Brennan. 1991. Grounding in communication. Perspectives on socially shared cognition 13, 1991: 127--149.",
      "doi": ""
    },
    {
      "text": "Andrew Duchowski. 2007. Eye tracking methodology: Theory and practice. Springer Science & Business Media. ",
      "doi": "10.5555/1215838"
    },
    {
      "text": "Mica R. Endsley. 1995. Toward a theory of situation awareness in dynamic systems. Human Factors: The Journal of the Human Factors and Ergonomics Society 37, 1: 32--64.",
      "doi": ""
    },
    {
      "text": "Susan R. Fussell, Robert E. Kraut, and Jane Siegel. 2000. Coordination of communication: Effects of shared visual context on collaborative work. Proceedings of the 2000 ACM conference on Computer supported cooperative work, ACM, 21--30.  ",
      "doi": "10.1145/358916.358947"
    },
    {
      "text": "Susan R. Fussell, Leslie D. Setlock, Jie Yang, Jiazhi Ou, Elizabeth Mauer, and Adam DI Kramer. 2004. Gestures over video streams to support remote collaboration on physical tasks. Human-Computer Interaction 19, 3: 273--309.  ",
      "doi": "10.1207/s15327051hci1903_3"
    },
    {
      "text": "Darren Gergle, Robert E. Kraut, and Susan R. Fussell. 2013. Using visual information for grounding and awareness in collaborative tasks. Human-Computer Interaction 28, 1: 1--39.",
      "doi": ""
    },
    {
      "text": "Joy E. Hanna and Susan E. Brennan. 2007. Speakers' eye gaze disambiguates referring expressions early during face-to-face conversation. Journal of Memory and Language 57, 4: 596--615.",
      "doi": ""
    },
    {
      "text": "Patrick Jermann, Darren Gergle, Roman Bednarik, and Susan Brennan. 2012. Duet 2012: dual eye tracking in CSCW. Proceedings of the ACM 2012 conference on Computer Supported Cooperative Work Companion, ACM, 23--24.  ",
      "doi": "10.1145/2141512.2141525"
    },
    {
      "text": "Robert E. Kraut, Susan R. Fussell, and Jane Siegel. 2003. Visual information as a conversational resource in collaborative physical tasks. Human-Computer Interaction 18, 1: 13--49.  ",
      "doi": "10.1207/S15327051HCI1812_2"
    },
    {
      "text": "Robert E. Kraut, Darren Gergle, and Susan R. Fussell. 2002. The use of visual information in shared visual spaces: Informing the development of virtual copresence. Proceedings of the 2002 ACM conference on Computer supported cooperative work, ACM, 31--40.  ",
      "doi": "10.1145/587078.587084"
    },
    {
      "text": "Andrew F. Monk and Caroline Gale. 2002. A look is worth a thousand words: Full gaze awareness in video-mediated conversation. Discourse Processes 33, 3: 257--278.",
      "doi": ""
    },
    {
      "text": "Mark B. Neider, Xin Chen, Christopher A. Dickinson, Susan E. Brennan, and Gregory J. Zelinsky. 2010. Coordinating spatial referencing using shared gaze. Psychonomic bulletin & review 17, 5: 718--724.",
      "doi": ""
    },
    {
      "text": "Jiazhi Ou, Lui Min Oh, Susan R. Fussell, Tal Blum, and Jie Yang. 2008. Predicting visual focus of attention from intention in remote collaborative tasks. Multimedia, IEEE Transactions on 10, 6: 1034--1045.  ",
      "doi": "10.1109/TMM.2008.2001363"
    },
    {
      "text": "Bertrand Schneider and Roy Pea. 2013. Real-time mutual gaze perception enhances collaborative learning and collaboration quality. International Journal of Computer-Supported Collaborative Learning 8, 4: 375--397.",
      "doi": "10.1007/s11412-013-"
    },
    {
      "text": "Roel Vertegaal, Robert Slagter, Gerrit Van der Veer, and Anton Nijholt. 2001. Eye gaze patterns in conversations: there is more to conversational agents than meets the eyes. Proceedings of the SIGCHI conference on Human factors in computing systems, ACM,301--308.  ",
      "doi": "10.1145/365024.365119"
    }
  ]
}