{
  "doi": "10.1145/2858036.2858521",
  "title": "Personality of Interaction: Expressing Brand Personalities Through Interaction Aesthetics",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "3126-3130",
  "year": 2016,
  "badges": [],
  "abstract": "Practicing designers must usually relate to branding in some manner. A designed artifact must support the brand in a constructive way and help establish positive brand experiences, which in turn have strategic value for the brand's institution. While there is obvious application of visual branding knowledge to the visual form of interactive artifacts, interviews with expert practitioners reveal a lack of systematic means to craft an interaction aesthetic to support a brand. Our empirical study relates attributes of interactive experience to that of 'brand personality', a common way of quantifying how a brand should be perceived. We show that particular attributes of interactivity, such as whether an interaction has a continuous rather than discrete flow, are related to particular brand traits. Our empirical results establish a clear commercial significance for deeper, systematic ways of analyzing and critiquing interactive experiences.",
  "tags": [
    "experience",
    "branding",
    "interactivity",
    "design",
    "aesthetics"
  ],
  "authors": [
    {
      "name": "Peter Tolstrup Aagesen",
      "institution": "*****No Affilation****, Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-99659019789/rel-imgonly/profil_03.jpg",
      "acmid": "99659019789",
      "orcid": "missing"
    },
    {
      "name": "Clint Heyer",
      "institution": "Malmö University, Malmö, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350568274",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Aaker, J.L. Dimensions of Brand Personality. J. Marking Research. 34, 3 (1997), 347--356.",
      "doi": ""
    },
    {
      "text": "Al-Shamaileh, O. and Sutcliffe, A. Investigating a multi-faceted view of user experience. Proc. OzCHI (ACM Press, Nov. 2012), 9--18.  ",
      "doi": "10.1145/2414536.2414538"
    },
    {
      "text": "De Angeli, A. et al. Interaction, usability and aesthetics. Proc. DIS (ACM Press, Jun. 2006), 271--280.  ",
      "doi": "10.1145/1142405.1142446"
    },
    {
      "text": "Azoulay, A. and Kapferer, J.-N. Do brand personality scales really measure brand personality? J. Brand Manag. 11, 2 (2003), 143--155.",
      "doi": ""
    },
    {
      "text": "Bolchini, D. et al. Evaluating the Communication Design of Branded Websites: A Value-based Framework. Proc. Design of Comm. (ACM Press, 2009), 73--80.  ",
      "doi": "10.1145/1621995.1622010"
    },
    {
      "text": "Chandon, P. Note on measuring brand awareness, brand image, brand equity and brand value. INSEAD Tech Report MKT19. 2003.",
      "doi": ""
    },
    {
      "text": "Damazio, V. et al. Brands that Touch and anthropology of consumption: towards an understanding of how to design pleasurable products. Proc. DPPI (ACM Press, 2007), 271--281.  ",
      "doi": "10.1145/1314161.1314186"
    },
    {
      "text": "Davis, M. Theoretical Foundations for Experiential Systems Design. Proc. ETP (2003), 45--52.  ",
      "doi": "10.1145/982484.982491"
    },
    {
      "text": "Garrett, J.J. The Elements of User Experience: User-centered design for the web and beyond. New Riders Publishing, 2010. ",
      "doi": "10.5555/1965524"
    },
    {
      "text": "Heath, R. et al. Brand relationships: Strengthened by emotion, weakened by attention. J. Advert. Res. 46, 4 (2006), 410--419.",
      "doi": ""
    },
    {
      "text": "Heller, D. Aesthetics and interaction design: some preliminary thoughts. interactions. 12, 5 (2005), 48--50.  ",
      "doi": "10.1145/1082369.1082400"
    },
    {
      "text": "Jacobs, V. Simplistic slowdown meets techno acceleration. interactions. 16, 6 (2009), 68--71.  ",
      "doi": "10.1145/1620693.1620710"
    },
    {
      "text": "Keller, K.L. and Richey, K. The importance of corporate brand personality traits to a successful 21st century business. J. Brand Manag. 14, 1 (2006), 74--81.",
      "doi": ""
    },
    {
      "text": "Lenz, E. et al. Exploring Relationships Between Interaction Attributes and Experience. Proc. DPPI (2013), 126--135.  ",
      "doi": "10.1145/2513506.2513520"
    },
    {
      "text": "Lim, Y. et al. Interactivity Attributes? : A New Way of Thinking and Describing Interactivity. Proc. CHI (2009), 105--108.  ",
      "doi": "10.1145/1518701.1518719"
    },
    {
      "text": "Löwgren, J. Toward an articulation of interaction aesthetics. New Rev. Hypermedia Multimed. 15, 2 (2009), 129--146.  ",
      "doi": "10.1080/13614560903117822"
    },
    {
      "text": "Marcus, A. Branding 101. interactions. 11, 5 (Sep. 2004), 14--21.  ",
      "doi": "10.1145/1015530.1015539"
    },
    {
      "text": "Percy, L. et al. How to Measure Brand Emotion. Admap.",
      "doi": ""
    },
    {
      "text": "van Riel, C.B.M. and Balmer, J.M.T. Corporate identity: the concept, its measurement and management. Eur. J. Marketing. 31, 5 (1997), 340--355.",
      "doi": ""
    },
    {
      "text": "Robinette, S. and Brand, C. Emotion marketing: The Hallmark way of winning customers for life. McGraw-Hill, 2001.",
      "doi": ""
    },
    {
      "text": "Rondeau, D.B. For mobile applications, branding is experience. Commun. ACM. 48, 7 (2005), 61--66.  ",
      "doi": "10.1145/1070838.1070867"
    },
    {
      "text": "Wheeler, A. Designing Brand Identity: An essential guide for the whole branding team. John Wiley & Sons, 2012.",
      "doi": ""
    },
    {
      "text": "Yang, T. and Bolchini, D. Branded Interactions: Predicting perceived product traits and user image from interface consistency and visual guidance. Interact. Comput. 26, 5 (2014), 465--487.",
      "doi": ""
    }
  ]
}