{
  "doi": "10.1145/2858036.2858304",
  "title": "Haptic Wave: A Cross-Modal Interface for Visually Impaired Audio Producers",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "2150-2161",
  "year": 2016,
  "badges": [
    "Best Paper"
  ],
  "abstract": "We present the Haptic Wave, a device that allows cross-modal mapping of digital audio to the haptic domain, intended for use by audio producers/engineers with visual impairments. We describe a series of participatory design activities adapted to non-sighted users where the act of prototyping facilitates dialog. A series of workshops scoping user needs, and testing a technology mock up and lo-fidelity prototype fed into the design of a final high-spec prototype. The Haptic Wave was tested in the laboratory, then deployed in real world settings in recording studios and audio production facilities. The cross-modal mapping is kinesthetic and allows the direct manipulation of sound without the translation of an existing visual interface. The research gleans insight into working with users with visual impairments, and transforms perspective to think of them as experts in non-visual interfaces for all users.",
  "authors": [
    {
      "name": "Atau Tanaka",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/do/10.1145/contrib-81100132447/rel-imgonly/atau-mocap-cu.jpg",
      "acmid": "81100132447",
      "orcid": "missing"
    },
    {
      "name": "Adam Parkinson",
      "institution": "Goldsmiths, University of London, London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81503671261",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "2010. \"The Courtesy Rules of Blindness\". (2010). Retrieved September 21, 2015 from http://www.blind.net/general-information/the-courtesy-rules-of-blindness.html.",
      "doi": ""
    },
    {
      "text": "Iyad Abu Doush, Enrico Pontelli, Tran Cao Son, Dominic Simon, and Ou Ma. 2010. Multimodal Presentation of Two-Dimensional Charts: An Investigation Using Open Office XML and Microsoft Excel. ACM Trans. Access. Comput. 3, 2, Article 8 (Nov. 2010).  ",
      "doi": "10.1145/1857920.1857925"
    },
    {
      "text": "Douglas Atkinson, Pawel Orzechowski, Bruna Petreca, Nadia Bianchi-Berthouze, Penelope Watkins, Sharon Baurley, Stefano Padilla, and Mike Chantler. 2013. Tactile Perceptions of Digital Textiles: A Design Research Approach. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1669--1678.  ",
      "doi": "10.1145/2470654.2466221"
    },
    {
      "text": "Paul Bach-y Rita and Stephen W Kercel. 2003. Sensory substitution and the human-machine interface. Trends in Cognitive Sciences 7, 12 (2003), 541--546.",
      "doi": ""
    },
    {
      "text": "Jakob Bak, William Verplank, and David Gauthier. 2015. Motors, Music and Motion. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '15). ACM, NY, NY, USA, 367--374.  ",
      "doi": "10.1145/2677199.2680590"
    },
    {
      "text": "Olivier Bau, Ivan Poupyrev, Ali Israr, and Chris Harrison. 2010. TeslaTouch: Electrovibration for Touch Surfaces. In Proceedings of the 23Nd Annual ACM Symposium on User Interface Software and Technology (UIST '10). ACM, NY, NY, USA, 283--292.  ",
      "doi": "10.1145/1866029.1866074"
    },
    {
      "text": "Timothy Beamish, Karon Maclean, and Sidney Fels. 2004. Manipulating Music: Multimodal Interaction for DJs. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04). ACM, NY, NY, USA, 327--334.  ",
      "doi": "10.1145/985692.985734"
    },
    {
      "text": "Stephen Brewster, Joanna Lumsden, Marek Bell, Malcolm Hall, and Stuart Tasker. 2003. Multimodal 'Eyes-free' Interaction Techniques for Wearable Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 473--480.  ",
      "doi": "10.1145/642611.642694"
    },
    {
      "text": "Baptiste Caramiaux, Alessandro Altavilla, Scott G. Pobiner, and Atau Tanaka. 2015. Form Follows Sound: Designing Interactions from Sonic Memories. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 3943--3952.  ",
      "doi": "10.1145/2702123.2702515"
    },
    {
      "text": "William Gaver. 2011. Making Spaces: How Design Workbooks Work. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 1551--1560.  ",
      "doi": "10.1145/1978942.1979169"
    },
    {
      "text": "Edwin L Hutchins, James D Hollan, and Donald A Norman. 1985. Direct manipulation interfaces. Human-Computer Interaction 1, 4 (1985), 311--338.  ",
      "doi": "10.1207/s15327051hci0104_2"
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stephane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Bjorn Eiderback. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '03). ACM, NY, NY, USA, 17--24.  ",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Shaun K. Kane, Jacob O. Wobbrock, and Richard E. Ladner. 2011. Usable Gestures for Blind People: Understanding Preference and Performance. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 413--422.  ",
      "doi": "10.1145/1978942.1979001"
    },
    {
      "text": "Da-jung Kim and Youn-kyung Lim. 2011. Handscope: Enabling Blind People to Experience Statistical Graphics on Websites Through Haptics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '11). ACM, NY, NY, USA, 2039--2042.  ",
      "doi": "10.1145/1978942.1979237"
    },
    {
      "text": "Richard L. Kline and Ephraim P. Glinert. 1995. Improving GUI Accessibility for People with Low Vision. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '95). ACM Press/Addison-Wesley Publishing Co., NY, NY, USA, 114--121.  ",
      "doi": "10.1145/223904.223919"
    },
    {
      "text": "Carl Knappett. 2011. Thinking through material culture: an interdisciplinary perspective. University of Pennsylvania Press.",
      "doi": ""
    },
    {
      "text": "Susan J Lederman and Roberta L Klatzky. 2009. Haptic perception: A tutorial. Attention, Perception, & Psychophysics 71, 7 (2009), 1439--1459.",
      "doi": ""
    },
    {
      "text": "Kevin A. Li, Patrick Baudisch, and Ken Hinckley. 2008. Blindsight: Eyes-free Access to Mobile Phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08). ACM, NY, NY, USA, 1389--1398.  ",
      "doi": "10.1145/1357054.1357273"
    },
    {
      "text": "Muhanad S. Manshad, Enrico Pontelli, and Shakir J. Manshad. 2013. Exploring Tangible Collaborative Distance Learning Environments for the Blind and Visually Impaired. In CHI '13 Extended Abstracts on Human Factors in Computing Systems (CHI EA '13). ACM, NY, NY, USA, 55--60.  ",
      "doi": "10.1145/2468356.2468367"
    },
    {
      "text": "Oussama Metatla, Nick Bryan-Kinns, and Tony Stockman. 2008. Constructing Relational Diagrams in Audio: The Multiple Perspective Hierarchical Approach. In Proceedings of the 10th International ACM SIGACCESS Conference on Computers and Accessibility (Assets '08). ACM, NY, NY, USA, 97--104.  ",
      "doi": "10.1145/1414471.1414491"
    },
    {
      "text": "Sigrid Norris. 2004. Analyzing multimodal interaction: A methodological framework. Routledge.",
      "doi": ""
    },
    {
      "text": "Ian Oakley, Marilyn Rose McGee, Stephen Brewster, and Philip Gray. 2000. Putting the Feel in \"Look and Feel\". In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '00). ACM, NY, NY, USA, 415--422.  ",
      "doi": "10.1145/332040.332467"
    },
    {
      "text": "Zeljko Obrenovic, Julio Abascal, and Dusan Starcevic. 2007. Universal Accessibility As a Multimodal Design Issue. Commun. ACM 50, 5 (May 2007), 83--88.  ",
      "doi": "10.1145/1230819.1241668"
    },
    {
      "text": "Marianna Obrist, Sue Ann Seah, and Sriram Subramanian. 2013. Talking About Tactile Experiences. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '13). ACM, NY, NY, USA, 1659--1668.  ",
      "doi": "10.1145/2470654.2466220"
    },
    {
      "text": "Sile O'Modhrain and Brent Gillespie. 1997. The Moose: A Haptic User Interface for Blind Persons. In Proc. Third WWW6 Conference.",
      "doi": ""
    },
    {
      "text": "Sharon Oviatt. 1999. Ten Myths of Multimodal Interaction. Commun. ACM 42, 11 (Nov. 1999), 74--81.  ",
      "doi": "10.1145/319382.319398"
    },
    {
      "text": "Chung Hyuk Park and Ayanna M. Howard. 2012. Real World Haptic Exploration for Telepresence of the Visually Impaired. In Proceedings of the Seventh Annual ACM/IEEE International Conference on Human-Robot Interaction (HRI '12). ACM, NY, NY, USA, 65--72.  ",
      "doi": "10.1145/2157689.2157701"
    },
    {
      "text": "Adam Parkinson, David Cameron, and Atau Tanaka. 2015. Haptic Wave: Presenting the Multiple Voices, Artefacts and Materials of a Design Research Project. In Proceedings of the 2nd Biennial Research Through Design Conference.",
      "doi": ""
    },
    {
      "text": "Andrew Sears and Vicki L. Hanson. 2012. Representing Users in Accessibility Research. ACM Trans. Access. Comput. 4, 2, Article 7 (March 2012).  ",
      "doi": "10.1145/2141943.2141945"
    },
    {
      "text": "Ben Shneiderman. 1993. 1.1 Direct Manipulation: a Step Beyond Programming Languages. Sparks of innovation in human-computer interaction 17 (1993).",
      "doi": ""
    },
    {
      "text": "Calle Sjostrom. 2002. Non-visual haptic interaction design-guidelines and applications. Lund University.",
      "doi": ""
    },
    {
      "text": "Atau Tanaka, Olivier Bau, and Wendy E. Mackay. 2013. The A20: Interactive Instrument Techniques for Sonic Design Exploration. In Sonic Interaction Design, Karmen Franinovic and Stefania Seran (Eds.). MIT Press, 255--270.",
      "doi": ""
    },
    {
      "text": "Atau Tanaka, Lalya Gaye, and Ranald Richardson. 2010. Co-production and Co-creation: Creative Practice in Social Inclusion. In Cultural Computing, Ryohei Nakatsu; Naoko Tosa; Fazel Naghdy; Kok Wai Wong; Philippe Codognet (Ed.). IFIP Advances in Information and Communication Technology, Vol. 333. Springer, 169--178.",
      "doi": ""
    },
    {
      "text": "Esther Thelen and Linda B Smith. 1996. A dynamic systems approach to the development of cognition and action. MIT Press.",
      "doi": ""
    },
    {
      "text": "Jan BF Van Erp, Ki-Uk Kyung, Sebastian Kassner, Jim Carter, Stephen Brewster, Gerhard Weber, and Ian Andrew. 2010. Setting the standards for haptic and tactile interactions: ISOs work. In Haptics: Generating and Perceiving Tangible Sensations. Springer, 353--358. ",
      "doi": "10.5555/1893760.1893816"
    },
    {
      "text": "Bill Verplank and Francesco Georg. 2011. Can Haptics Make New Music? Fader and Plank Demos. In Proceedings of the 2011 International Conference on New Interfaces for Musical Expression (NIME '11). 539--540.",
      "doi": ""
    },
    {
      "text": "Bill Verplank, Michael Gurevich, and Max Mathews. 2002. The Plank: Designing a Simple Haptic Controller. In Proceedings of the 2002 Conference on New Interfaces for Musical Expression (NIME '02). 1--4. ",
      "doi": "10.5555/1085171.1085180"
    }
  ]
}