{
  "doi": "10.1145/2858036.2858058",
  "title": "Tangible Reels: Construction and Exploration of Tangible Maps by Visually Impaired Users",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "2186-2197",
  "year": 2016,
  "badges": [],
  "abstract": "Maps are essential in everyday life, but inherently inaccessible to visually impaired users. They must be transcribed to non-editable tactile graphics, or rendered on very expensive shape changing displays. To tackle these issues, we developed a tangible tabletop interface that enables visually impaired users to build tangible maps on their own, using a new type of physical icon called Tangible Reels. Tangible Reels are composed of a sucker pad that ensures stability, with a retractable reel that renders digital lines tangible. In order to construct a map, audio instructions guide the user to precisely place Tangible Reels onto the table and create links between them. During subsequent exploration, the device provides the names of the points and lines that the user touches. A pre-study confirmed that Tangible Reels are stable and easy to manipulate, and that visually impaired users can understand maps that are built with them. A follow-up experiment validated that the designed system, including non-visual interactions, enables visually impaired participants to quickly build and explore maps of various complexities.",
  "tags": [
    "interactive graphics",
    "non-visual tangible interfaces"
  ],
  "authors": [
    {
      "name": "Julie Ducasse",
      "institution": "University of Toulouse & CNRS, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658990987",
      "orcid": "missing"
    },
    {
      "name": "Marc J-M Macé",
      "institution": "CNRS - IRIT, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548020667",
      "orcid": "0000-0003-4124-8697"
    },
    {
      "name": "Marcos Serrano",
      "institution": "University of Toulouse & CNRS; IRIT, Toulouse, France",
      "img": "/do/10.1145/contrib-81318491531/rel-imgonly/marcos-2018.jpg",
      "acmid": "81318491531",
      "orcid": "0000-0001-8431-0601"
    },
    {
      "name": "Christophe Jouffrais",
      "institution": "CNRS - IRIT, Toulouse, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377594403",
      "orcid": "0000-0002-0768-1019"
    }
  ],
  "references": [
    {
      "text": "G Blasko, Chandra Narayanaswami, and Steven Feiner. 2006. Prototyping retractable string-based interaction techniques for dual-display mobile devices. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '06): 369--372. http://doi.org/10.1145/1124772.1124827  ",
      "doi": "10.1145/1124772.1124827"
    },
    {
      "text": "Anke M. Brock, Philippe Truillet, Bernard Oriola, Delphine Picard, and Christophe Jouffrais. 2015. Interactivity Improves Usability of Geographic Maps for Visually Impaired People. HumanComputer Interaction 30: 156--194.  ",
      "doi": "10.5555/2692791.2692794"
    },
    {
      "text": "John Brooke. 1996. SUS: A \"quick and dirty\" usability scale. In Usability Evaluation in Industry, P. W. Jordan, B. Thomas, B. A. Weerdmeester and I. L. McClelland (eds.). Taylor & Francis, London, UK, 189--194.",
      "doi": ""
    },
    {
      "text": "Polly Edman. 1992. Tactile graphics. AFB press, NY, USA.",
      "doi": ""
    },
    {
      "text": "Sandra G. Hart and Lowell E. Staveland. 1988. Development of NASA-TLX (Task Load Index): Results of Empirical and Theoretical Research. In Human Mental Workload, Peter A. Hancock and Najmedin Meshkati (eds.). Elsevier, 139--183. http://doi.org/10.1016/S0166--4115(08)62386--9",
      "doi": ""
    },
    {
      "text": "V. Hayward. 2008. A brief taxonomy of tactile illusions and demonstrations that can be done in a hardware store. Brain research bulletin 75, 6: 742--752.",
      "doi": ""
    },
    {
      "text": "M. T Horn. TopCode: Tangible Object Placement Codes. Retrieved from http://hci.cs.tufts.edu/topcodes/",
      "doi": ""
    },
    {
      "text": "CJ Huang, Ellen Yi-luen Do, and D Gross. 2003. MouseHaus Table: a Physical Interface for Urban Design. 16th Annual ACM Symposium on User Interface Software and Technology (UIST): 41--42.",
      "doi": ""
    },
    {
      "text": "Hiroshi Ishii and Brygg Ullmer. 1997. Tangible bits: towards seamless interfaces between people, bits and atoms. Proceedings of the ACM SIGCHI Conference on Human factors in computing systems: 234--241. http://doi.org/10.1145/258549.258715  ",
      "doi": "10.1145/258549.258715"
    },
    {
      "text": "R.D. Jacobson. 1998. Navigating maps with little or no sight: An audio-tactile approach. Proceedings of Content Visualization and Intermedia Representations, 95--102. Retrieved from http://citeseerx.ist.psu.edu/viewdoc/summary?doi= 10.1.1.21.2860",
      "doi": ""
    },
    {
      "text": "Nikolaos Kaklanis, Konstantinos Votis, Panagiotis Moschonas, and Dimitrios Tzovaras. 2011. HapticRiaMaps: Towards Interactive exploration of web world maps for the visually impaired. Proceedings of the International CrossDisciplinary Conference on Web Accessibility W4A '11, ACM Press, 20.  ",
      "doi": "10.1145/1969289.1969316"
    },
    {
      "text": "T. Kaltenbrunner, M., Bovermann, R. Bencina, and E Costanza. 2005. TUIO - A Protocol for TableTop Tangible User Interfaces. Proceedings of the 6th International Workshop on Gesture in HumanComputer Interaction and Simulation (GW 2005).",
      "doi": ""
    },
    {
      "text": "Shaun K. Kane, Meredith Ringel Morris, Annuska Z. Perkins, Daniel Wigdor, Richard E. Ladner, and Jacob O. Wobbrock. 2011. Access Overlays: Improving Non-Visual Access to Large Touch Screens for Blind Users. Proceedings of the 24th annual ACM symposium on User interface software and technology - UIST '11, ACM Press, 273--282. http://doi.org/10.1145/2047196.2047232  ",
      "doi": "10.1145/2047196.2047232"
    },
    {
      "text": "Erik Koch and Hendrik Witt. 2008. Prototyping a chest-worn string-based wearable input device. 2008 International Symposium on a World of Wireless, Mobile and Multimedia Networks: 1--6. http://doi.org/10.1109/WOWMOM.2008.4594882  ",
      "doi": "10.1109/WOWMOM.2008.4594882"
    },
    {
      "text": "Uwe Laufs, Christopher Ruff, and Jan Zibuschka. 2010. MT4j - A Cross-platform Multi-touch Development Framework. ACM EICS 2010, Workshop: Engineering patterns for multi-touch interfaces, ACM, 52--57.",
      "doi": ""
    },
    {
      "text": "AK Lobben. 2005. Identifying the needs of tactile map makers. Proceedings of XXII International Cartographic Conference.",
      "doi": ""
    },
    {
      "text": "Muhanad S Manshad, Enrico Pontelli, and Shakir J. Manshad. 2012. Trackable Interactive Multimodal Manipulatives: Towards a Tangible User Environment for the Blind. Proceedings of ICCHP 2012, Springer Berlin Heidelberg, 664--671. http://doi.org/10.1007/978--3--642--31534--3  ",
      "doi": "10.1007/978-3-642-31534-3_97"
    },
    {
      "text": "David McGookin, Euan Robertson, and Stephen Brewster. 2010. Clutching at Straws: Using Tangible Interaction to Provide Non-Visual Access to Graphs. Proceedings of the 28th international conference on Human factors in computing systems CHI '10, ACM Press, 1715--1724. http://doi.org/10.1145/1753326.1753583  ",
      "doi": "10.1145/1753326.1753583"
    },
    {
      "text": "Joshua A. Miele, Steven Landau, and Deborah Gilden. 2006. Talking TMAP: Automated generation of audio-tactile maps using SmithKettlewell's TMAP software. British Journal of Visual Impairment 24, 2: 93--100. http://doi.org/10.1177/0264619606064436",
      "doi": ""
    },
    {
      "text": "Peter Parente and Gary Bishop. 2003. BATS?: The Blind Audio Tactile Mapping System. Proceedings of ACM South Eastern Conference, ACM Press.",
      "doi": ""
    },
    {
      "text": "Norman Pohl, Steve Hodges, John Helmes, Nicolas Villar, and Tim Paek. 2013. An interactive beltworn badge with a retractable string-based input mechanism. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems CHI '13: 1465. http://doi.org/10.1145/2470654.2466194  ",
      "doi": "10.1145/2470654.2466194"
    },
    {
      "text": "Benjamin Poppinga, Charlotte Magnusson, Martin Pielot, and Kirsten Rassmus-Gröhn. 2011. TouchOver map: Audio-Tactile Exploration of Interactive Maps. Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services MobileHCI '11, ACM Press, 545--550. http://doi.org/10.1145/2037373.2037458  ",
      "doi": "10.1145/2037373.2037458"
    },
    {
      "text": "Bernhard Schmitz and Thomas Ertl. 2012. Interactively Displaying Maps on a Tactile Graphics Display. SKALID 2012-Spatial Knowledge Acquisition with Limited Information Displays (2012), 13--18.",
      "doi": ""
    },
    {
      "text": "Jochen Schneider and Thomas Strothotte. 2000. Constructive exploration of Spatial Information by Blind Users. Proceedings of the fourth international ACM conference on Assistive technologies: 188--192. http://doi.org/10.1145/354324.354375  ",
      "doi": "10.1145/354324.354375"
    },
    {
      "text": "Ehud Sharlin, Benjamin Watson, Yoshifumi Kitamura, et al. 2004. The Tangible Pathfinder Design of a Wayfinding Trainer for the Visually Impaired. Proc. Graphics Interface: 2--3.",
      "doi": ""
    },
    {
      "text": "Mathieu Simonnet, Dan Jacobson, Stephane Vieilledent, and Jacques Tisseau. 2009. SeaTouch: a haptic and auditory maritime environment for non visual cognitive mapping of blind sailors. COSIT 2009, LNCS 5756, Springer-Verlag, 212--226. http://doi.org/10.1007/978--3--642-03832--7_13 ",
      "doi": "10.5555/1789534.1789551"
    },
    {
      "text": "The Braille Authority of North America. 2010. Guidelines and Standards for Tactile Graphics. Retrieved from http://brailleauthority.org/tg/webmanual/index.html",
      "doi": ""
    },
    {
      "text": "J Underkoffler and H Ishii. 1999. Urp: a luminoustangible workbench for urban planning and design. Proceedings of the SIGCHI conference on Human Factors in Computing Systems: 386--383. http://doi.org/10.1145/302979.303114  ",
      "doi": "10.1145/302979.303114"
    },
    {
      "text": "Fernando Vidal-verdú and Moustapha Hafez. 2007. Graphical Tactile Displays for Visually-Impaired People. Neural Systems and Rehabilitation Engineering, IEEE Transactions on 15, 1: 119--130.",
      "doi": ""
    },
    {
      "text": "Zheshen Wang, Baoxin Li, Terri Hedgpeth, and Teresa Haven. 2009. Instant Tactile-Audio Map: Enabling Access to Digital Maps for People with Visual Impairment. Proceeding of the eleventh international ACM SIGACCESS conference on Computers and accessibility - ASSETS '09, ACM Press, 43--50. http://doi.org/10.1145/1639642.1639652  ",
      "doi": "10.1145/1639642.1639652"
    },
    {
      "text": "Limin Zeng and Gerhard Weber. 2011. Accessible Maps for the Visually Impaired. Proc. of IFIP INTERACT 2011 Workshop on ADDW, 54--60.",
      "doi": ""
    },
    {
      "text": "Limin Zeng and Gerhard Weber. 2012. ATMap: Annotated Tactile Maps for the Visually Impaired. COST 2102 International Training School, Cognitive Behavioural Systems, LNCS Volume 7403, 2012, Springer Berlin Heidelberg, 290--298. http://doi.org/10.1007/978--3--642--34584--5  ",
      "doi": "10.1007/978-3-642-34584-5_25"
    },
    {
      "text": "Haixia Zhao, Catherine Plaisant, Ben Shneiderman, and Jonathan Lazar. 2008. Data Sonification for Users with Visual Impairment. ACM Transactions on Computer-Human Interaction 15, 1: 1--28.  ",
      "doi": "10.1145/1352782.1352786"
    }
  ]
}