{
  "doi": "10.1145/2858036.2858104",
  "title": "Materiable: Rendering Dynamic Material Properties in Response to Direct Physical Touch with Shape Changing Interfaces",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "2764-2772",
  "year": 2016,
  "badges": [],
  "abstract": "Shape changing interfaces give physical shapes to digital data so that users can feel and manipulate data with their hands and bodies. However, physical objects in our daily life not only have shape but also various material properties. In this paper, we propose an interaction technique to represent material properties using shape changing interfaces. Specifically, by integrating the multi-modal sensation techniques of haptics, our approach builds a perceptive model for the properties of deformable materials in response to direct manipulation. As a proof-of-concept prototype, we developed preliminary physics algorithms running on pin-based shape displays. The system can create computationally variable properties of deformable materials that are visually and physically perceivable. In our experiments, users identify three deformable material properties (flexibility, elasticity and viscosity) through direct touch interaction with the shape display and its dynamic movements. In this paper, we describe interaction techniques, our implementation, future applications and evaluation on how users differentiate between specific properties of our system. Our research shows that shape changing interfaces can go beyond simply displaying shape allowing for rich embodied interaction and perceptions of rendered materials with the hands and body.",
  "authors": [
    {
      "name": "Ken Nakagaki",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81488670562/rel-imgonly/ken-profile_may2022_square.jpg",
      "acmid": "81488670562",
      "orcid": "0000-0002-1351-6976"
    },
    {
      "name": "Luke Vink",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526625",
      "orcid": "missing"
    },
    {
      "name": "Jared Counts",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701175",
      "orcid": "missing"
    },
    {
      "name": "Daniel Windham",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-99658762290/rel-imgonly/15-01_crop.png",
      "acmid": "99658762290",
      "orcid": "missing"
    },
    {
      "name": "Daniel Leithinger",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81319495312/rel-imgonly/074_7043_medium.jpg",
      "acmid": "81319495312",
      "orcid": "0000-0003-4342-7082"
    },
    {
      "name": "Sean Follmer",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377593653",
      "orcid": "0000-0001-5592-5949"
    },
    {
      "name": "Hiroshi Ishii",
      "institution": "Massachusetts Institute of Technology, Cambridge, MA, USA",
      "img": "/do/10.1145/contrib-81100363076/rel-imgonly/120908-024.jpg",
      "acmid": "81100363076",
      "orcid": "0000-0003-4918-8908"
    }
  ],
  "references": [
    {
      "text": "inForm at Cooper Hewitt. http://tangible.media.mit.edu/project/inform-at-cooper-hewitt/. Accessed: 2016-01--12.",
      "doi": ""
    },
    {
      "text": "Yuki Ban, Takashi Kajinami, Takuji Narumi, Tomohiro Tanikawa, and Michitaka Hirose. 2012. Modifying an identified curved surface shape using pseudo-haptic effect. In Haptics Symposium (HAPTICS), 2012 IEEE. IEEE, 211--216.  ",
      "doi": "10.1007/978-3-642-31401-8_3"
    },
    {
      "text": "Cagatay Basdogan, Suvranu De, Jung Kim, Manivannan Muniyandi, Hyun Kim, Mandayam Srinivasan, and others. 2004. Haptics in minimally invasive surgical simulation and training. Computer Graphics and Applications, IEEE 24, 2 (2004), 56--64.  ",
      "doi": "10.1109/MCG.2004.1274062"
    },
    {
      "text": "Robert Bridson. 2008. Fluid simulation for computer graphics. CRC Press. ",
      "doi": "10.5555/1457699"
    },
    {
      "text": "Robert Bridson, Sebastian Marino, and Ronald Fedkiw. 2003. Simulation of clothing with folds and wrinkles. In Proceedings of the 2003 ACM SIGGRAPH/Eurographics symposium on Computer animation. Eurographics Association, 28--36. ",
      "doi": "10.5555/846276.846281"
    },
    {
      "text": "Herve Delingette. 1998. Toward realistic soft-tissue modeling in medical simulation. Proc. IEEE 86, 3 (1998), 512--523.",
      "doi": ""
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Nadia Cheng, and Hiroshi Ishii. 2012. Jamming user interfaces: programmable particle stiffness and sensing for malleable and shape-changing devices. In Proceedings of the 25th annual ACM symposium on User interface software and technology. ACM, 519--528.  ",
      "doi": "10.1145/2380116.2380181"
    },
    {
      "text": "Sean Follmer, Daniel Leithinger, Alex Olwal, Akimitsu Hogge, and Hiroshi Ishii. 2013. inFORM: dynamic physical affordances and constraints through shape and object actuation.. In UIST, Vol. 13. 417--426.  ",
      "doi": "10.1145/2501988.2502032"
    },
    {
      "text": "Sarah FF Gibson and Brian Mirtich. 1997. A survey of deformable modeling in computer graphics. Technical Report. Citeseer.",
      "doi": ""
    },
    {
      "text": "Geoffrey Irving, Eran Guendelman, Frank Losasso, and Ronald Fedkiw. 2006. Efficient simulation of large bodies of water by coupling two and three dimensional techniques. In ACM Transactions on Graphics (TOG), Vol. 25. ACM, 805--811.  ",
      "doi": "10.1145/1141911.1141959"
    },
    {
      "text": "Hiroshi Ishii, David Lakatos, Leonardo Bonanni, and Jean-Baptiste Labrune. 2012. Radical atoms: beyond tangible bits, toward transformable materials. interactions 19, 1 (2012), 38--51.  ",
      "doi": "10.1145/2065327.2065337"
    },
    {
      "text": "Hiroshi Ishii, Daniel Leithinger, Sean Follmer, Amit Zoran, Philipp Schoessler, and Jared Counts. 2015. TRANSFORM: Embodiment of Radical Atoms at Milano Design Week. In Proceedings of the SIGCHI Conference Extended Abstracts on Human Factors in Computing Systems. ACM, 687--694.  ",
      "doi": "10.1145/2702613.2702969"
    },
    {
      "text": "Anatole Lécuyer, Jean-Marie Burkhardt, and Laurent Etienne. 2004. Feeling bumps and holes without a haptic interface: the perception of pseudo-haptic textures. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 239--246.  ",
      "doi": "10.1145/985692.985723"
    },
    {
      "text": "Anatole Lécuyer, Sabine Coquillart, Abderrahmane Kheddar, Paul Richard, and Philippe Coiffet. 2000. Pseudo-haptic feedback: can isometric input devices simulate force feedback?. In Proceedings of Virtual Reality. IEEE, 83--90. ",
      "doi": "10.5555/832288.835776"
    },
    {
      "text": "Karon E MacLean. 2008. Haptic interaction design for everyday interfaces. Reviews of Human Factors and Ergonomics 4, 1 (2008), 149--194.",
      "doi": ""
    },
    {
      "text": "Thomas H Massie and J Kenneth Salisbury. 1994. The phantom haptic interface: A device for probing virtual objects. In Proceedings of the ASME winter annual meeting, symposium on haptic interfaces for virtual environment and teleoperator systems, Vol. 55. Chicago, IL, 295--300.",
      "doi": ""
    },
    {
      "text": "Matthias Muller, David Charypar, and Markus Gross. 2003. Particle-based fluid simulation for interactive applications. In Proceedings of the 2003 ACM SIGGRAPH/Eurographics symposium on Computer animation. Eurographics Association, 154--159. ",
      "doi": "10.5555/846276.846298"
    },
    {
      "text": "Ken Nakagaki, Sean Follmer, and Hiroshi Ishii. 2015. LineFORM: Actuated Curve Interfaces for Display, Interaction, and Constraint. In Proceedings of the 28th Annual ACM Symposium on User Interface Software & Technology. ACM, 333--339.  ",
      "doi": "10.1145/2807442.2807452"
    },
    {
      "text": "Andrew Nealen, Matthias Muller, Richard Keiser, Eddy Boxerman, and Mark Carlson. 2006. Physically based deformable models in computer graphics. In Computer Graphics Forum, Vol. 25. Wiley Online Library, 809--836.",
      "doi": ""
    },
    {
      "text": "Yoichi Ochiai, Takayuki Hoshi, Jun Rekimoto, and Masaya Takasaki. 2014. Diminished haptics: Towards digital transformation of real world textures. In Haptics: Neuroscience, Devices, Modeling, and Applications. Springer, 409--417.",
      "doi": ""
    },
    {
      "text": "Jifei Ou, Lining Yao, Daniel Tauber, Jurgen Steimle, Ryuma Niiyama, and Hiroshi Ishii. 2014. jamSheets: thin interfaces with tunable stiffness enabled by layer jamming. In Proceedings of the 8th International Conference on Tangible, Embedded and Embodied Interaction. ACM, 65--72.  ",
      "doi": "10.1145/2540930.2540971"
    },
    {
      "text": "Ben Piper, Carlo Ratti, and Hiroshi Ishii. 2002. Illuminating clay: a 3-D tangible interface for landscape analysis. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 355--362.  ",
      "doi": "10.1145/503376.503439"
    },
    {
      "text": "Majken K Rasmussen, Esben W Pedersen, Marianne G Petersen, and Kasper Hornbæk. 2012. Shape-changing interfaces: a review of the design space and open research questions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 735--744.  ",
      "doi": "10.1145/2207676.2207781"
    },
    {
      "text": "Kenneth Salisbury, Francois Conti, and Federico Barbagli. 2004. Haptic rendering: introductory concepts. Computer Graphics and Applications, IEEE 24, 2 (2004), 24--32.  ",
      "doi": "10.1109/MCG.2004.1274058"
    },
    {
      "text": "Christian Schumacher, Bernd Bickel, Jan Rys, Steve Marschner, Chiara Daraio, and Markus Gross. 2015. Microstructures to control elasticity in 3D printing. ACM Transactions on Graphics (TOG) 34, 4 (2015), 136.  ",
      "doi": "10.1145/2766926"
    },
    {
      "text": "Seiya Takei, Ryo Watanabe, Ryuta Okazaki, Taku Hachisu, and Hiroyuki Kajimoto. 2015. Presentation of Softness Using Film-Type Electro-Tactile Display and Pressure Distribution Measurement. In Haptic Interaction. Springer, 91--96.",
      "doi": ""
    },
    {
      "text": "Keita Watanabe and Michiaki Yasumura. 2008. VisualHaptics: Generating haptic sensation using only visual cues. In Proceedings of the 2008 International Conference on Advances in Computer Entertainment Technology. ACM, 405--405.  ",
      "doi": "10.1145/1501750.1501856"
    }
  ]
}