{
  "doi": "10.1145/2858036.2858164",
  "title": "SnapApp: Reducing Authentication Overhead with a Time-Constrained Fast Unlock Option",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "3736-3747",
  "year": 2016,
  "badges": [],
  "abstract": "We present SnapApp, a novel unlock concept for mobile devices that reduces authentication overhead with a time-constrained quick-access option. SnapApp provides two unlock methods at once: While PIN entry enables full access to the device, users can also bypass authentication with a short sliding gesture (\"Snap\"). This grants access for a limited amount of time (e.g. 30 seconds). The device then automatically locks itself upon expiration. Our concept further explores limiting the possible number of Snaps in a row, and configuring blacklists for app use during short access (e.g. to exclude banking apps). We discuss opportunities and challenges of this concept based on a 30-day field study with 18 participants, including data logging and experience sampling methods. Snaps significantly reduced unlock times, and our app was perceived to offer a good tradeoff. Conceptual challenges include, for example, supporting users in configuring their blacklists.",
  "authors": [
    {
      "name": "Daniel Buschek",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/do/10.1145/contrib-82659024557/rel-imgonly/daniel.png",
      "acmid": "82659024557",
      "orcid": "0000-0002-0013-715X"
    },
    {
      "name": "Fabian Hartmann",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81496650042",
      "orcid": "missing"
    },
    {
      "name": "Emanuel von Zezschwitz",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81421599585",
      "orcid": "missing"
    },
    {
      "name": "Alexander De Luca",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81318488374",
      "orcid": "missing"
    },
    {
      "name": "Florian Alt",
      "institution": "University of Munich (LMU), Munich, Bavaria, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436594444",
      "orcid": "0000-0001-8354-2195"
    }
  ],
  "references": [
    {
      "text": "Panagiotis Andriotis, Theo Tryfonas, and George Oikonomou. 2014. Complexity metrics and user strength perceptions of the pattern-lock graphical authentication method. In Human Aspects of Information Security, Privacy, and Trust. Springer, 115--126.  ",
      "doi": "10.1007/978-3-319-07620-1_11"
    },
    {
      "text": "Adam J. Aviv, Katherine Gibson, Evan Mossop, Matt Blaze, and Jonathan M. Smith. 2010. Smudge Attacks on Smartphone Touch Screens. In Proceedings of the 4th USENIX Conference on Offensive Technologies (WOOT'10). USENIX Association, Berkeley, CA, USA, 1--7. ",
      "doi": "10.5555/1925004.1925009"
    },
    {
      "text": "Andrea Bianchi, Ian Oakley, Vassilis Kostakos, and Dong Soo Kwon. 2011. The Phone Lock: Audio and Haptic Shoulder-surfing Resistant PIN Entry Methods for Mobile Devices. In Proceedings of the Fifth International Conference on Tangible, Embedded, and Embodied Interaction (TEI '11). ACM, NY, NY, USA, 197--200.  ",
      "doi": "10.1145/1935701.1935740"
    },
    {
      "text": "Matthias Böhmer, Brent Hecht, Johannes Schöning, Antonio Krüger, and Gernot Bauer. 2011. Falling Asleep with Angry Birds, Facebook and Kindle: A Large Scale Study on Mobile Application Usage. In Proceedings of the 13th International Conference on Human Computer Interaction with Mobile Devices and Services (MobileHCI '11). ACM, NY, NY, USA, 47--56.  ",
      "doi": "10.1145/2037373.2037383"
    },
    {
      "text": "Daniel Buschek, Alexander De Luca, and Florian Alt. 2015. Improving Accuracy, Applicability and Usability of Keystroke Biometrics on Mobile Touchscreen Devices. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1393--1402.  ",
      "doi": "10.1145/2702123.2702252"
    },
    {
      "text": "Mauro Cherubini and Nuria Oliver. 2009. A Re?ned Experience Sampling Method to Capture Mobile User Experience. In Workshop of Mobile User Experience Research part of CHI'2009, Y. Nakhimovsky, D. Eckles, and J. Rigelsberger (Eds.).",
      "doi": ""
    },
    {
      "text": "Alexander De Luca, Alina Hang, Frederik Brudy, Christian Lindner, and Heinrich Hussmann. 2012. Touch Me Once and I Know It's You!: Implicit Authentication Based on Touch Screen Patterns. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '12). ACM, NY, NY, USA, 987--996.  ",
      "doi": "10.1145/2207676.2208544"
    },
    {
      "text": "Serge Egelman, Sakshi Jain, Rebecca S. Portnoff, Kerwell Liao, Sunny Consolvo, and David Wagner. 2014. Are You Ready to Lock?. In Proceedings of the 2014 ACM SIGSAC Conference on Computer and Communications Security (CCS '14). ACM, NY, NY, USA, 750--761.  ",
      "doi": "10.1145/2660267.2660273"
    },
    {
      "text": "Denzil Ferreira, Jorge Goncalves, Vassilis Kostakos, Louise Barkhuus, and Anind K. Dey. 2014. Contextual Experience Sampling of Mobile Application Micro-usage. In Proceedings of the 16th International Conference on Human-computer Interaction with Mobile Devices & Services (MobileHCI '14). ACM, NY, NY, USA, 91--100.  ",
      "doi": "10.1145/2628363.2628367"
    },
    {
      "text": "Arpan Gupta, Markus Miettinen, N. Asokan, and Mate Nagy. 2012. Intuitive security policy configuration in mobile devices using context pro?ling. In 2012 International Conference on Privacy, Security, Risk and Trust (PASSAT) and 2012 International Confernece on Social Computing (SocialCom). IEEE, 471--480.  ",
      "doi": "10.1109/SocialCom-PASSAT.2012.60"
    },
    {
      "text": "Alina Hang, Emanuel von Zezschwitz, Alexander De Luca, and Heinrich Hussmann. 2012. Too Much Information!: User Attitudes Towards Smartphone Sharing. In Proceedings of the 7th Nordic Conference on Human-Computer Interaction: Making Sense Through Design (NordiCHI '12). ACM, NY, NY, USA, 284--287.  ",
      "doi": "10.1145/2399016.2399061"
    },
    {
      "text": "Marian Harbach, Emanuel von Zezschwitz, Andreas Fichtner, Alexander De Luca, and Matthew Smith. 2014. It's a Hard Lock Life: A Field Study of Smartphone (Un) Locking Behavior and Risk Perception. In Symposium on Usable Privacy and Security (SOUPS '14). 213--230.",
      "doi": ""
    },
    {
      "text": "Eiji Hayashi, Sauvik Das, Shahriyar Amini, Jason Hong, and Ian Oakley. 2013. CASA: Context-aware Scalable Authentication. In Proceedings of the Ninth Symposium on Usable Privacy and Security (SOUPS '13). ACM, NY, NY, USA, Article 3, 10 pages.  ",
      "doi": "10.1145/2501604.2501607"
    },
    {
      "text": "Eiji Hayashi, Oriana Riva, Karin Strauss, A. J. Bernheim Brush, and Stuart Schechter. 2012. Goldilocks and the Two Mobile Devices: Going Beyond All-or-nothing Access to a Device's Applications. In Proceedings of the Eighth Symposium on Usable Privacy and Security (SOUPS '12). ACM, NY, NY, USA, Article 2, 11 pages.  ",
      "doi": "10.1145/2335356.2335359"
    },
    {
      "text": "Amy K. Karlson, A.J. Bernheim Brush, and Stuart Schechter. 2009. Can I Borrow Your Phone?: Understanding Concerns when Sharing Mobile Phones. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09). ACM, NY, NY, USA, 1647-1650.  ",
      "doi": "10.1145/1518701.1518953"
    },
    {
      "text": "Taekyoung Kwon and Sarang Na. 2014. TinyLock: Affordable defense against smudge attacks on smartphone pattern lock systems. Computers & Security 42 (2014), 137--150.",
      "doi": ""
    },
    {
      "text": "Nicholas Micallef, Mike Just, Lynne Baillie, Martin Halvey, and Hilmi Günes¸ Kayacik. 2015. Why Aren't Users Using Protection? Investigating the Usability of Smartphone Locking. In Proceedings of the 17th International Conference on Human-Computer Interaction with Mobile Devices and Services (MobileHCI '15). ACM, NY, NY, USA, 284--294.  ",
      "doi": "10.1145/2785830.2785835"
    },
    {
      "text": "Ildar Muslukhov, Yazan Boshmaf, Cynthia Kuo, Jonathan Lester, and Konstantin Beznosov. 2013. Know Your Enemy: The Risk of Unauthorized Access in Smartphones by Insiders. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, NY, NY, USA, 271--280.  ",
      "doi": "10.1145/2493190.2493223"
    },
    {
      "text": "Stefan Schneegass, Frank Steimle, Andreas Bulling, Florian Alt, and Albrecht Schmidt. 2014. SmudgeSafe: Geometric Image Transformations for Smudge-resistant User Authentication. In Proceedings of the 2014 ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '14). ACM, NY, NY, USA, 775--786.  ",
      "doi": "10.1145/2632048.2636090"
    },
    {
      "text": "Julian Seifert, Alexander De Luca, Bettina Conradi, and Heinrich Hussmann. 2010. TreasurePhone: Context-sensitive User Data Protection on Mobile Phones. In Proceedings of the 8th International Conference on Pervasive Computing (Pervasive'10). Springer-Verlag, Berlin, Heidelberg, 130--137.  ",
      "doi": "10.1007/978-3-642-12654-3_8"
    },
    {
      "text": "Tetsuji Takada and Yuki Kokubun. 2013. Extended PIN Authentication Scheme Allowing Multi-Touch Key Input. In Proceedings of International Conference on Advances in Mobile Computing & Multimedia (MoMM '13). ACM, NY, NY, USA, Article 307, 4 pages.  ",
      "doi": "10.1145/2536853.2536944"
    },
    {
      "text": "Sebastian Uellenbeck, Markus Dürmuth, Christopher Wolf, and Thorsten Holz. 2013. Quantifying the Security of Graphical Passwords: The Case of Android Unlock Patterns. In Proceedings of the 2013 ACM SIGSAC Conference on Computer & Communications Security (CCS '13). ACM, NY, NY, USA, 161--172.  ",
      "doi": "10.1145/2508859.2516700"
    },
    {
      "text": "Emanuel von Zezschwitz, Alexander De Luca, Bruno Brunkow, and Heinrich Hussmann. 2015a. SwiPIN: Fast and Secure PIN-Entry on Smartphones. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 1403--1406.  ",
      "doi": "10.1145/2702123.2702212"
    },
    {
      "text": "Emanuel von Zezschwitz, Alexander De Luca, Philipp Janssen, and Heinrich Hussmann. 2015b. Easy to Draw, but Hard to Trace?: On the Observability of Grid-based (Un)Lock Patterns. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (CHI '15). ACM, NY, NY, USA, 2339--2342.  ",
      "doi": "10.1145/2702123.2702202"
    },
    {
      "text": "Emanuel von Zezschwitz, Paul Dunphy, and Alexander De Luca. 2013a. Patterns in the Wild: A Field Study of the Usability of Pattern and Pin-based Authentication on Mobile Devices. In Proceedings of the 15th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI '13). ACM, NY, NY, USA, 261--270.  ",
      "doi": "10.1145/2493190.2493231"
    },
    {
      "text": "Emanuel von Zezschwitz, Anton Koslow, Alexander De Luca, and Heinrich Hussmann. 2013b. Making Graphic-based Authentication Secure Against Smudge Attacks. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI '13). ACM, NY, NY, USA, 277--286.  ",
      "doi": "10.1145/2449396.2449432"
    },
    {
      "text": "Tingxin Yan, David Chu, Deepak Ganesan, Aman Kansal, and Jie Liu. 2012. Fast App Launching for Mobile Devices Using Predictive User Context. In Proceedings of the 10th International Conference on Mobile Systems, Applications, and Services (MobiSys '12). ACM, NY, NY, USA, 113--126.  ",
      "doi": "10.1145/2307636.2307648"
    },
    {
      "text": "Nan Zheng, Kun Bai, Hai Huang, and Haining Wang. 2014. You Are How You Touch: User Verification on Smartphones via Tapping Behaviors. In 2014 IEEE 22nd International Conference on Network Protocols (ICNP). IEEE, 221--232.  ",
      "doi": "10.1109/ICNP.2014.43"
    }
  ]
}