{
  "doi": "10.1145/2858036.2858066",
  "title": "Taking 5: Work-Breaks, Productivity, and Opportunities for Personal Informatics for Knowledge Workers",
  "published": "2016-05-07",
  "proctitle": "CHI '16: Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems",
  "pages": "673-684",
  "year": 2016,
  "badges": [],
  "abstract": "Taking breaks from work is an essential and universal practice. In this paper, we extend current research on productivity in the workplace to consider the break habits of knowledge workers and explore opportunities of break logging for personal informatics. We report on three studies. Through a survey of 147 U.S.-based knowledge workers, we investigate what activities respondents consider to be breaks from work, and offer an understanding of the benefit workers desire when they take breaks. We then present results from a two-week in-situ diary study with 28 participants in the U.S. who logged 800 breaks, offering insights into the effect of work breaks on productivity. We finally explore the space of information visualization of work breaks and productivity in a third study. We conclude with a discussion of implications for break recommendation systems, availability and interuptibility research, and the quantified workplace.",
  "tags": [
    "productivity",
    "visualization",
    "personal informatics",
    "quantified workplace",
    "work breaks",
    "knowledge workers"
  ],
  "authors": [
    {
      "name": "Daniel A. Epstein",
      "institution": "FXPAL & University of Washington, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-83458899257/rel-imgonly/img_3258a_square.jpg",
      "acmid": "83458899257",
      "orcid": "0000-0002-2657-6345"
    },
    {
      "name": "Daniel Avrahami",
      "institution": "FXPAL, Palo Alto, CA, USA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100367734",
      "orcid": "missing"
    },
    {
      "name": "Jacob T. Biehl",
      "institution": "FXPAL, Palo Alto, CA, USA",
      "img": "/do/10.1145/contrib-81100607745/rel-imgonly/me.jpg",
      "acmid": "81100607745",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Daniel Avrahami, James Fogarty, and Scott E Hudson. (2007). Biases in human estimation of interruptibility: effects and implications for practice. Proceedings of ACM Conference on Human Factors in Computing Systems (CHI), 51--60. http://doi.org/dmtchq  ",
      "doi": "10.1145/1240624.1240632"
    },
    {
      "text": "James 'Bo' Begole, Nicholas E. Matsakis, and John C. Tang. (2004). Lilsys: sensing unavailability. Proceedings of the ACM Conference on Computer Supported Collaborative Work (CSCW '04), 511--514. http://doi.org/dfrvwv  ",
      "doi": "10.1145/1031607.1031691"
    },
    {
      "text": "James 'Bo' Begole, John C. Tang, and Rosco Hill. (2003). Rhythm Modeling, Visualizations and Applications. Proceedings of the ACM Symposium on User Interface Software and Technology (UIST '03), 11--20. http://doi.org/b272mz  ",
      "doi": "10.1145/964696.964698"
    },
    {
      "text": "James 'Bo' Begole, John C. Tang, Randall B. Smith, and Nicole Yankelovich. (2002). Work Rhythms: Analyzing Visualizations of Awareness Histories of Distributed Groups. Proceedings of the ACM Conference on Computer Supported Collaborative Work (CSCW '02), 334--343. http://doi.org/d64ctd  ",
      "doi": "10.1145/587078.587125"
    },
    {
      "text": "Frank Bentley, Konrad Tollmar, Peter Stephenson, Laura Levy, Brian Jones, Scott Robertson, Ed Price, Richard Catrambone, and Jeff Wilson. (2013). Health Mashups: Presenting Statistical Patterns between Wellbeing Data and Context in Natural Language to Promote Behavior Change. ACM Transactions on Computer-Human Interaction, 20(5), 1--27. http://doi.org/f23f6c  ",
      "doi": "10.1145/2503823"
    },
    {
      "text": "James Biagioni and John Krumm. (2013). Days of Our Lives: Assessing Day Similarity from Location Traces. Proceedings of the Conference on User Modeling, Adaptation, and Personalization (UMAP '13), 89--101. http://doi.org/bbnc",
      "doi": ""
    },
    {
      "text": "Derek Burkland. (2013). The Effects of Taking a Short Break: Task Difficulty, Need for Recovery and Task Performance. Master's Thesis. Applied Psychology, University of Wisconsin-Stout, Menomonie WI.",
      "doi": ""
    },
    {
      "text": "Dean Cooley and Scott Pedersen. (2013). A Pilot Study of Increasing Nonpurposeful Movement Breaks at Work as a Means of Reducing Prolonged Sitting. Journal of Environmental and Public Health, 2013. http://doi.org/bbnd",
      "doi": ""
    },
    {
      "text": "Mary Czerwinski, Eric Horvitz, and Susan Wilhite. (2004). A Diary Study of Task Switching and Interruptions. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '04), 175--182. http://doi.org/cdksbd  ",
      "doi": "10.1145/985692.985715"
    },
    {
      "text": "Awwad J. Dababneh, Naomi Swanson, and Richard L. Shell. (2001). Impact of added rest breaks on the productivity and well being of workers. Ergonomics, 44(2), 164--174. http://doi.org/dbqwrr",
      "doi": ""
    },
    {
      "text": "Peng Dai, Jeffrey M. Rzeszotarski, Praveen Paritosh, and Ed H. Chi. (2015). And Now for Something Completely Different?: Improving Crowdsourcing Workflows with Micro-Diversions. Proceedings of the ACM Conference on Computer Supported Collaborative Work (CSCW '15), 628--638. http://doi.org/bbnf  ",
      "doi": "10.1145/2675133.2675260"
    },
    {
      "text": "Daniel A. Epstein, Felicia Cordeiro, Elizabeth Bales, James Fogarty, and Sean A. Munson. (2014). Taming Data Complexity in Lifelogs: Exploring Visual Cuts of Personal Informatics Data. Proceedings of the ACM Conference on Designing Interactive Systems (DIS '14), 667--676. http://doi.org/bbng  ",
      "doi": "10.1145/2598510.2598558"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. (2015). A Lived Informatics Model of Personal Informatics. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 731--742. http://doi.org/10.1145/2750858.2804250  ",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "James Fogarty, Scott E. Hudson, Christopher G. Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny C. Lee, and Jie Yang. (2005). Predicting human interruptibility with sensors. ACM Transactions on Computer-Human Interaction, 12(1), 119--146. http://doi.org/fpqwt3  ",
      "doi": "10.1145/1057237.1057243"
    },
    {
      "text": "Robert A. Henning, Eric A. Callaghan, Anna M. Ortega, George V. Kissel, Jason I. Guttman, and Heather A. Braun. (1996). Continuous feedback to promote selfmanagement of rest breaks during computer use. International Journal of Industrial Ergonomics, 18(1), 71--82. http://doi.org/ftbjvm",
      "doi": ""
    },
    {
      "text": "Robert A. Henning, Pierre Jacques, George V. Kissel, Anne B. Sullivan, and Sabina M. Alteras-Webb. (1997). Frequent short rest breaks from computer work: effects on productivity and well-being at two field sites. Ergonomics, 40(1), 78--91. http://doi.org/fhht29",
      "doi": ""
    },
    {
      "text": "Robert A. Henning, Steven L. Sauter, Gavriel Salvendy, and Edward F. Krieg Jr. (1989). Microbreak length, performance, and stress in a data entry task. Ergonomics, 32(7), 855--864. http://doi.org/ct5mdq",
      "doi": ""
    },
    {
      "text": "Eric Horvitz and Johnson Apacible. (2003). Learning and reasoning about interruption. Proceedings of the International Conference on Motimodal Interfaces (ICMI '03), 20--27. http://doi.org/c36njb  ",
      "doi": "10.1145/958432.958440"
    },
    {
      "text": "Eric Horvitz, Paul Koch, and Johnson Apacible. (2004). BusyBody: creating and fielding personalized models of the cost of interruption. Proceedings of the ACM Conference on Computer Supported Cooperative Work (CSCW '04), 507--511. http://doi.org/bxkqq9  ",
      "doi": "10.1145/1031607.1031690"
    },
    {
      "text": "Shamsi T. Iqbal and Brian P. Bailey. (2006). Leveraging characteristics of task structure to predict the cost of interruption. Proceedings of the SIGCHI conference on Human Factors in computing systems (CHI '06), 741. http://doi.org/b2m5n7  ",
      "doi": "10.1145/1124772.1124882"
    },
    {
      "text": "Jing Jin and Laura A. Dabbish. (2009). Self-Interruption on the Computer: A Typology of Discretionary Task Interleaving. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '09), 1799--1808. http://doi.org/cbctks  ",
      "doi": "10.1145/1518701.1518979"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. (2010). A StageBased Model of Personal Informatics Systems. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '10), 557--566. http://doi.org/bh8zsb  ",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Gloria Mark, Daniela Gudith, and Ulrich Klocke. (2008). The Cost of Interrupted Work: More Speed and Stress. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '08), 107--110. http://doi.org/cjftns  ",
      "doi": "10.1145/1357054.1357072"
    },
    {
      "text": "Gloria Mark, Shamsi T. Iqbal, Mary Czerwinski, and Paul Johns. (2014). Bored mondays and focused afternoons: the rhythm of attention and online activity in the workplace. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 3025--3034. http://doi.org/bbnh  ",
      "doi": "10.1145/2556288.2557204"
    },
    {
      "text": "Akhil Mathur, Marc Van Den Broeck, Geert Vanderhulst, Afra Mashhadi, and Fahim Kawsar. (2015). Tiny Habits in the Giant Enterprise: Understanding the Dynamics of a Quantified Workplace. Proceedings of the ACM International Joint Conference on Pervasive and Ubiquitous Computing (UbiComp '15), 577--588. http://doi.org/10.1145/2750858.2807528  ",
      "doi": "10.1145/2750858.2807528"
    },
    {
      "text": "Daniel McFarlane and Kara Latorella. (2002). The Scope and Importance of Human Interruption in Human-Computer Interaction Design. HumanComputer Interaction, 17(1), 1--61. http://doi.org/fv8w62  ",
      "doi": "10.1207/S15327051HCI1701_1"
    },
    {
      "text": "Linda Mclean, Maureen Tingley, Robert N. Scott, and Jeremy Rickards. (2001). Computer terminal work and the benefit of microbreaks. Applied Ergonomics, 32(3), 225--237. http://doi.org/fm59t4",
      "doi": ""
    },
    {
      "text": "Christopher A. Monk, Deborah A. Boehm-Davis, and J. Gregory Trafton. (2002). The Attentional Costs of Interrupting Task Performance at Various Stages. Proceedings of the Human Factors and Ergonomics Society Annual Meeting, 46(22), 1824--1828. http://doi.org/fzbgvk",
      "doi": ""
    },
    {
      "text": "RescueTime. http://www.rescuetime.com/",
      "doi": ""
    },
    {
      "text": "Ann E. Rogers, Wei-Ting Hwang, and Linda D. Scott. (2004). The Effects of Work Breaks on Staff Nurse Performance. The Journal of Nursing Administration, 34(11), 512--519. http://doi.org/dgkfp6",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. (2014). Personal Tracking as Lived Informatics. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '14), 1163--1172. http://doi.org/bbdz  ",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Linda Sarna, Stella Aguinaga Bialous, Marjorie J. Wells, Jenny Kotlerman, Erika Sivarajan Froelicher, and Mary Ellen Wewers. (2009). Do You Need to Smoke to Get a Break?. Smoking Status and Missed Work Breaks Among Staff Nurses. American Journal of Preventive Medicine, 37(2 SUPPL.), S165--S171. http://doi.org/brnxw2",
      "doi": ""
    },
    {
      "text": "Donald A. Schön. (1983). The Reflective Practitioner. Basic Books. http://doi.org/fv2g6n",
      "doi": ""
    },
    {
      "text": "Meredith M. Skeels and Jonathan Grudin. (2009). When Social Networks Cross Boundaries: A Case Study of Workplace Use of Facebook and LinkedIn. Proceedings of the ACM International Conference on Supporting Group Work (GROUP '09), 95--104. http://doi.org/bmdz6r  ",
      "doi": "10.1145/1531674.1531689"
    },
    {
      "text": "Manya Sleeper, Alessandro Acquisti, Lorrie Faith Cranor, Patrick Gage Kelley, Sean A. Munson, and Norman Sadeh. (2015). I Would Like To..., I Shouldn't..., I Wish I...: Exploring Behavior-Change Goals for Social Networking Sites. Proceedings of the ACM Conference on Computer Supported Cooperative Work & Social Computing (CSCW '15), 1058--1069. http://doi.org/bbnj  ",
      "doi": "10.1145/2675133.2675193"
    },
    {
      "text": "Sabine Sonnentag and Charlotte Fritz. (2007). The Recovery Experience Questionnaire: development and validation of a measure for assessing recuperation and unwinding from work. Journal of Occupational Health Psychology, 12(3), 204--221. http://doi.org/dxsctz",
      "doi": ""
    },
    {
      "text": "Naomi G. Swanson and Steven L. Sauter. (1990). The design of rest breaks for video display terminal work: A review of the relavant literature. Journal of Safety Research, 21(4), 166. http://doi.org/bscr6t",
      "doi": ""
    },
    {
      "text": "Wendell C. Taylor, Ross Shegog, Vincent Chen, David M. Rempel, Marybeth Pappas Baun, Cresendo L. Bush, Tomas Green, and Nicole Hare-Everline. (2010). The Booster Break program: Description and feasibility test of a worksite physical activity daily practice. Work, 37(4), 433--443. http://doi.org/bbnk",
      "doi": ""
    },
    {
      "text": "Phillip Tucker, Simon Folkard, and Ian Macdonald. (2003). Rest breaks and accident risk. The Lancet, 361, 2003--2003. http://doi.org/dtg2k8",
      "doi": ""
    },
    {
      "text": "Marc van Veldhoven and S. Broersen. (2003). Measurement quality and validity of the \"need for recovery scale.\" Occupational and Environmental Medicine, 60, i3--i9. http://doi.org/c3v9hk",
      "doi": ""
    },
    {
      "text": "Amy Witkoski and Victoria Vaughan Dickson. (2010). Hospital staff nurses' work hours, meal periods, and rest breaks. A review from an occupational health nurse perspective. American Association of Occupational Health Nurses, 58(11), 489--497. http://doi.org/fbpskm",
      "doi": ""
    },
    {
      "text": "Manuela Zuger and Thomas Fritz. (2015). Interruptibility of Software Developers and its Prediction Using Psycho-Physiological Sensors. Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI '15). http://doi.org/bbnm  ",
      "doi": "10.1145/2702123.2702593"
    }
  ]
}