{
  "doi": "10.1145/169059.169320",
  "title": "Take CoVer: exploiting version support in cooperative systems",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "406-413",
  "year": 1993,
  "badges": [],
  "abstract": "Current CSCW applications support one or more modes of cooperative work. The selection of and transition between these modes is usually placed on the users. At IPSI we built the SEPIA cooperative hypermedia authoring environment supporting a whole range of situations arising during collaborative work and the smooth transitions between them. While early use of the system shows the benefits of supporting smooth transitions between different collaborative modes, it also reveals some deficits regarding parallel work, management of alternative documents, or reuse of document parts. We propose to integrate version support to overcome these limitations. This leads to a versioned data management and an extended user interface enabling concurrent users to select a certain state of their work, to be aware of related changes, and to cooperate with others either asynchronously or synchronously.",
  "authors": [
    {
      "name": "Anja Haake",
      "institution": "Integrated Publication and Information Systems Institute (IPSI), Gesellschaft für Mathematik und Datenverarbeitung (GMD), Dolivostr. 15, D-6100 Darmstadt, F. R. Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244353",
      "orcid": "missing"
    },
    {
      "name": "Jörg M. Haake",
      "institution": "Integrated Publication and Information Systems Institute (IPSI), Gesellschaft für Mathematik und Datenverarbeitung (GMD), Dolivostr. 15, D-6100 Darmstadt, F. R. Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100244503",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Dart S. Concepts in Configuration Management. In Proc. of the 3rd International Workshop ol7 Sofm'are Configuration Management (Trondheim, Norway, June 12-14, 1991), pp. 1-18.  ",
      "doi": "10.1145/111062.111063"
    },
    {
      "text": "Dourish E, Bly S. Portholes: Supporting Awareness in a distributed work group. In Proc. of the CHI' 92 (Monterey, California, May 3-7), pp. 541-547.  ",
      "doi": "10.1145/142750.142982"
    },
    {
      "text": "Ellis C.A., Gibbs S.A., Rein G.L. Groupware: Some issues and experiences. In Communications of the ACM 34, 1 (Jan. 1991), pp. 38-58.  ",
      "doi": "10.1145/99977.99987"
    },
    {
      "text": "Fish R.S., Kraut R.E., Leland M.D.E Quilt: a collaborative tool for cooperative writing. In Conference on Office Automation Systems (Palo Alto, 1988), SIGOIS Bulletin, 9, 2&amp;3, (April &amp; July 1988).  ",
      "doi": "10.1145/45410.45414"
    },
    {
      "text": "Haake A. CoVer: A Contextual Version Server for Hypertext Applications. In Proc. of the 4th ACM Conference on Hypertext (Milano, Italy, Nov. 30 - Dec. 4, 1992), pp. 43-52.  ",
      "doi": "10.1145/168466.168488"
    },
    {
      "text": "Haake J.M., Wilson B. Supporting Collaborative Writing of Hyperdocuments in SEPIA. In Proc. of the ACM 1992 Conference on Computer Supported Cooperative Work (Toronto, Ontario, Nov. 1-4., 1992), pp. I38-146.  ",
      "doi": "10.1145/143457.143472"
    },
    {
      "text": "K~ifer W.A. Framework for Version-based Cooperation Control. in Proc. of the 2nd Int. Symposium on Database Systems for Advanced Applications (DASFAA) (Tokyo, Japan, April 1991). ",
      "doi": "10.5555/646708.702516"
    },
    {
      "text": "Katz R. Towards a Unified Framework for Version Modelling in Engineering Databases. acm computing surveys 22, 4 (Dec. 1990), pp. 375-408.  ",
      "doi": "10.1145/98163.98172"
    },
    {
      "text": "Rodden T.A. Survey of CSCW systems. Interacting with Computers 3, 3 (Dec. 1991), pp. 319-353.",
      "doi": ""
    },
    {
      "text": "Stefik M., Foster G., Bobrow D.G., Kahn K., Lanning S., Suchman L. Beyond the Chalkboard: Computer Support for Collaboration and Problem Solving in Meetings. In Communications of the ACM 30, 1 (Jan. 1987), pp. 32-47.  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "Streitz N.A., Hannemann J., Thtiring M. From ideas and arguments to hyperdocuments: Travelling through activity spaces. In Proc. of the A CM Conference on Hypertext (Pittsburgh,USA, Nov. 5-8, 1989), pp. 343-364.  ",
      "doi": "10.1145/74224.74251"
    },
    {
      "text": "Streitz N.A., Haake J.M., Hannemann J., Lemke A., Schtitt H., Schuler W., Thtiring M. SEPIA: A Cooperative Hypermedia Authoring Environment. In Proc. of the 4th ACM Conference on Hypertext, (Milano, Italy, Nov. 30-Dec. 4, 1992), pp. 11-22.  ",
      "doi": "10.1145/168466.168479"
    },
    {
      "text": "Thtiring M., Haake J. M., Hannemann J. What's ELIZA doing in the Chinese Room D Incoherent Hyperdocuments and how to Avoid them. In Proc. of the 3rd ACM Conference on 14ypertext (San Antonio, Texas, Dec. 15-18, 1991), pp. 161-177.  ",
      "doi": "10.1145/122974.122991"
    },
    {
      "text": "Weber A. Publishing Tools Need Both: State-Oriented and Task-Oriented Version Support. In Proc. of the 15th Annual International Computer Software and Applications Conference (COMPSAC '91) (Tokyo, Japan, Sept. 11-13, 1991), pp. 633-639.",
      "doi": ""
    }
  ]
}