{
  "doi": "10.1145/169059.169435",
  "title": "Computer image retrieval by features: suspect identification",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "494-499",
  "year": 1993,
  "badges": [],
  "abstract": "Correct suspect identification of known offenders by witnesses deteriorates rapidly as more are examined in mugshot albums. Feature approaches, where mugshots are displayed in order of similarity to witnesses' descriptions, attempt to increase identification success by reducing this number. A methodology is proposed for system design and evaluation based on experiments, computer simulations, and four classes of system performance measures: identification performance, retrieval rank, tolerance performance, and feature quality. This was used to develop a system for 640 mugshots of known offenders. In three empirical tests, over 90% of witness searches resulted in suspects retrieved in the first eight mugshots.",
  "tags": [
    "information retrieval",
    "computer image retrieval",
    "feature retrieval"
  ],
  "authors": [
    {
      "name": "Eric Lee",
      "institution": "Management Science, St. Mary's University, Halifax, NS, Canada B3H 3C3",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81406597878",
      "orcid": "missing"
    },
    {
      "name": "Thom Whalen",
      "institution": "Division of Behavioural Research, Communications Research Centre, 3701 Carling Avenue, Ottawa, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100590721",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Davies, G.M., Shepherd, J.W. and Ellis, H.D. Effects of interpolated mugshot exposure on accuracy of eyewitness identification. Journal of Applied Psychology, 64(1979), 232-237.",
      "doi": ""
    },
    {
      "text": "Ellis, H.D. Practical aspects of facial memory. In Eyewitness testimony: Psychological perspectives, G.L. Wells and E.F. Loftus, Eds. Cambridge University Press, New York, 1984.",
      "doi": ""
    },
    {
      "text": "Ellis, H.D., Davies, G.M. and Shepherd, J.W. A critical examination of the Photofit system for recalling faces. Ergonomics, 21(1978), 297-307.",
      "doi": ""
    },
    {
      "text": "Ellis, H.D., Shepherd, J.W., Shepherd, J., Klin, R.H. and Davies, G.M. Identification from a computer-driven retrieval system compared with a traditional mug-shot album: A new tool for police investigations, Ergonomics, 32(1989), 167-177.",
      "doi": ""
    },
    {
      "text": "Goldstein, A.J., Harmon, L.D. and Lesk, A. Identification of human faces. In Proceedings of the IEEE, 59(1971), 748-760.",
      "doi": ""
    },
    {
      "text": "Harmon, L.D. The recognition of faces. Scientific American, 229(1973), 70-82.",
      "doi": ""
    },
    {
      "text": "Laugher),, K.R., Alexander, J.F. and Lane, A.B. Recognition of human faces: Effects of target exposure time, target position, pose position, and type of photograph. Journal of Applied Psychology, 51(1971), 477-483.",
      "doi": ""
    },
    {
      "text": "Laugher),, K.R., Fessler, P.K., Lenorovitz, D.R. and Yorlick, D.A. Time delay and similarity effects in facial recognition. Journal of Applied Psychology, 59(1974), 490-496.",
      "doi": ""
    },
    {
      "text": "Lenorovitz, D.R. and Laughery, K.R. A witnesscomputer interactive system for searching mug files. In Eyewitness testimony, G.Wells and E. Loftus, Eds. Cambridge University Press, New York, 1984.",
      "doi": ""
    },
    {
      "text": "MacGregor, J.N., Lee, E.S. and Whalen, T. The feature matching approach to the computer retrieval of graphics: An enhancement, Information Services and Use, 9(1989), 127-137. ",
      "doi": "10.5555/68909.68911"
    },
    {
      "text": "Poulton, E. C. Unwanted range effects from using within-subject experimental designs. Psychological Bulletin, 80(1973), 113-121.",
      "doi": ""
    }
  ]
}