{
  "doi": "10.1145/169059.169268",
  "title": "One is not enough: multiple views in a media space",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "335-341",
  "year": 1993,
  "badges": [],
  "abstract": "Media spaces support collaboration, but the limited access they provide to remote colleagues' activities can undermine their utility. To address this limitation, we built an experimental system in which four switchable cameras were deployed in each of two remote offices, and observed participants using the system to collaborate on two tasks. The new views allowed increased access to task-related artifacts; indeed, users preferred these views to more typical “face-to-face” ones. However, problems of establishing a joint frame of reference were exacerbated by the additional complexity, leading us to speculate about more effective ways to expand access to remote sites.",
  "tags": [
    "video",
    "media spaces",
    "social interaction",
    "CSCW"
  ],
  "authors": [
    {
      "name": "William W. Gaver",
      "institution": "Rank Xerox, Cambridge EuroPARC, 61 Regent Street, Cambridge CB2 1AB, UK and Industrieel Ontwerpen, Technische Universiteit Delft, Jaffalaan 9, 2628 BX Delft, Nederland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100104022",
      "orcid": "0000-0003-1275-7652"
    },
    {
      "name": "Abigail Sellen",
      "institution": "Rank Xerox, Cambridge EuroPARC, 61 Regent Street, Cambridge CB2 1AB, UK and MRC Applied Psychology Unit, 15 Chaucer Road, Cambridge CB2 2EF, UK",
      "img": "/do/10.1145/contrib-81100309669/rel-imgonly/abigailsellen.jpg",
      "acmid": "81100309669",
      "orcid": "missing"
    },
    {
      "name": "Christian Heath",
      "institution": "Rank Xerox, Cambridge EuroPARC, 61 Regent Street, Cambridge CB2 1AB, UK and Department of Sociology, University of Surrey, Guildford GU2 5XH, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100164455",
      "orcid": "missing"
    },
    {
      "name": "Paul Luff",
      "institution": "Rank Xerox, Cambridge EuroPARC, 61 Regent Street, Cambridge CB2 1AB, UK and Department of Sociology, University of Surrey, Guildford GU2 5XH, UK",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100229533",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Argyle, M. and Cook, M. Gaze and mutual gaze. London: Cambridge University Press, 1976.",
      "doi": ""
    },
    {
      "text": "Bly, S., and Minneman, S. Commune: A shared drawing surface. Proceedings of C01S'90, ACM, New York, 1990, pp. 184 - 192.  ",
      "doi": "10.1145/91474.91514"
    },
    {
      "text": "Dourish, P., and Bellotti, V. Awareness and coordination in shared work spaces. Proceedings of CSCW'92 (Toronto, 1 -4 November, 1992).  ",
      "doi": "10.1145/143457.143468"
    },
    {
      "text": "Fish, R., Kraut, R., Root, R., and Rice, R. Evaluating video as a technology for informal communication. Proceechngs of CHI'92 (Monterey, 3 - 7 May, 1992). ACM, New York, pp. 37 -48.  ",
      "doi": "10.1145/142750.142755"
    },
    {
      "text": "Gaver, W. The affordances of media spaces for collaboration. Proceedings of CSCW'92 (Toronto, 1 - 4 November, 1992).  ",
      "doi": "10.1145/143457.371596"
    },
    {
      "text": "Gaver, W., Moran, T., MacLean, A., LOvstrand, L., Dourish, P., Carter, K., and Buxton, W. Realizing a video environment: EuroPARC's RAVE system. Proceedings of CHr92 (Monterey, California, 3 - 7 May, 1992). ACM, New York, pp. 27 - 35.  ",
      "doi": "10.1145/142750.142754"
    },
    {
      "text": "Gibson, J.J. The ecological approach to visual perception. Houghton Mifflin, New York, 1979.",
      "doi": ""
    },
    {
      "text": "Harrison, S., Minneman, S., and Irwin, S. Graspable implication: A study of 3-D objects in remote collaboration. Xerox PARC technical report, 1992.",
      "doi": ""
    },
    {
      "text": "Heath, C., and Luff, P. Media space and communicative asymmetries: Preliminary observations of video mediated interaction. Human-Computer Interaction, 7 (1992), pp. 99 - 103.",
      "doi": "10.1207/s15327051hci0703_3"
    },
    {
      "text": "Ishii, H., and Kobayashi, M. ClearBoard: A seamless medium for shared drawing and conversation with eye contact. Proceedings of CHI'92 (Monterey, California, 3 - 7 May, 1992). ACM, New York, pp. 525 - 540.  ",
      "doi": "10.1145/142750.142977"
    },
    {
      "text": "Luff, P., Heath, C., and Greatbatch, D. Tasks-ininteraction: Paper and screen baseM documentation in collaborative activity. Proceedings of CSCW'92 (Toronto, 1 -4 November, 1992).  ",
      "doi": "10.1145/143457.143475"
    },
    {
      "text": "Mantei, M., Baecker, R., Sellen, A., Buxton, W., Milligan, T., and Wellman, B. Experiences in the use of a media space. Proceedings of CHI'91 (New Orleans, April 28 - May 2, 1991) ACM, New York, pp. 203 - 208.  ",
      "doi": "10.1145/108844.108888"
    },
    {
      "text": "McGrath, J. Groups: Interaction and performance, Englewood Cliffs, NJ: Prentice-Hall, 1984.",
      "doi": ""
    },
    {
      "text": "Sellen, A. Speech patterns in video-mediated conversations. Proceedings of CHI'92 (Monterey, California, 3 - 7 May, 1992). ACM, New York, pp. 49 - 59.  ",
      "doi": "10.1145/142750.142756"
    },
    {
      "text": "Sellen, A. Statistical measures of speech in technology-mediateM conversations. Technical Report No. EPC-92-125, Rank Xerox EuroPARC, 1992.",
      "doi": ""
    },
    {
      "text": "Short, J., Williams, E., and Christie, B. The social psychology of telecommunications. London: Wiley &amp; Sons, 1976,",
      "doi": ""
    },
    {
      "text": "Smets, G. Designing for telepresence: The interdependence of movement and visual perception implemented. Proceedings of the IFAC Man-Machine Symposium, 1992.",
      "doi": ""
    },
    {
      "text": "Stults, R. Media space. Xerox PARC technical report, 1986.",
      "doi": ""
    },
    {
      "text": "Weber, K., and Minneman, S. The Office Design Project. SIGCHI Video Review, 1988.",
      "doi": ""
    }
  ]
}