{
  "doi": "10.1145/169059.169103",
  "title": "Incremental recognition in gesture-based and syntax-directed diagram editors",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "95-100",
  "year": 1993,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Rui Zhao",
      "institution": "Cadlab, Cooperation University of Paderborn and Siemens Nixdorf Informationssysteme AG, Bahnhofstr. 32, D-W-4790 Paderborn, Germany",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81423595444",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Farahangiz Arefi, Charles E. Hughes, and David A. Workman. Automatically generating visual syntaxdirected editors. Communications of A CM, 33(3):349-360, 1990.  ",
      "doi": "10.1145/77481.77487"
    },
    {
      "text": "Eric J. Golin. A Method for the Specification and Parsing of Visual Languages. PhD thesis, Brown University, 1991. ",
      "doi": "10.5555/864839"
    },
    {
      "text": "D. Harel. Statecharts: A visual formalism for complex systems. Science of Computer Programming, 8:231- 274, 1987.  ",
      "doi": "10.1016/0167-6423%2887%2990035-9"
    },
    {
      "text": "Richard Helm, Kim Marriott, and Martin Odersky. Building visual language parsers. In Proceedings of the Conference on Human Factors in Computing Systems (CttI), pages 105-112, 1991.  ",
      "doi": "10.1145/108844.108860"
    },
    {
      "text": "Ken Kahn. Concurrent constraint programs to parse and animate pictures of concurrent constraint programs. Technical Report SSL-91-16, P91-00143, System Sciences Laboratory, Palo Aim Research Center, 1991.",
      "doi": ""
    },
    {
      "text": "J. Kim. Gesture recognition by feature analysis. IBM Research Report RC12472, \"I'2. Watson Research Center, IBM Corporation, January 1987.",
      "doi": ""
    },
    {
      "text": "Mark A. Linton, Paul R. Calder, John A. Interrante, Steven Tang, and John M. Vlissides. Inter Views Reference Manual, Version 3.1. Stanford University, 1992.",
      "doi": ""
    },
    {
      "text": "James S. Lipscomb. A trainable gesture recognizer. Pattern Recognition, 24(9):895-907, 1991.  ",
      "doi": "10.1016/0031-3203%2891%2990009-T"
    },
    {
      "text": "Lisa Rubin Neal. User modeling for syntax-directed editors. In Human-Computer Interaction - INTER- A CT'87, pages 131-134, 1987.",
      "doi": ""
    },
    {
      "text": "J. Pittman. Recognizing handwritten text. In Proceedings of the Conference on Human Factors in Computing Systems (CHI), pages 271-275. ACM Press, 1991.  ",
      "doi": "10.1145/108844.108914"
    },
    {
      "text": "J.R. Rhyne. Dialogue management for gestural interfaces. IBM Research Report RC-12244, TJ. Watson Research Center, IBM Corporation, 1986.",
      "doi": ""
    },
    {
      "text": "Dean Rubine. Specifying gestures by example. A CM SIGGRA PH'91, Computer Graphics, 25(4), 1991.  ",
      "doi": "10.1145/127719.122753"
    },
    {
      "text": "Kent Wittenburg, Louis Weitzman, and jim Talley. Unification-based grammars and tabular parsing for graphical languages. Technical Report ACT-OODS- 208-91, MCC, June 1991.",
      "doi": ""
    },
    {
      "text": "Rui Zhao. On-line geometry recognition using C++, an object-oriented approach. In Proceedings of the 7th International Conference ~ Ezhibition of Technology of Object-Oriented Languages and Systems, TOOLS 7, pages 371-378, April 1992. ",
      "doi": "10.5555/161213.161254"
    }
  ]
}