{
  "doi": "10.1145/169059.169291",
  "title": "Perceptual vs. hardware performance in advanced acoustic interface design",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "363-366",
  "year": 1993,
  "badges": [],
  "abstract": "This panel brings together experts in the field of non-speech auditory displays with points of view ranging from long-term basic research in human perception to the timely production of useable tools in commercial systems. The panel will examine issues of perceptual validity and engineering performance from several different perspectives representative of current work in the field, and discuss how such issues can or should impact decisions made during technology development. Panelists' perspectives include: levels of analysis in designing and using auditory interfaces (Gaver), an example of what can be learned about implementation requirements for low-level psychophysical studies (Wenzel), designing integrated systems to encompass sonification in a three-dimensional environment (Foster), issues in the study of information transfer in representational acoustic signals (Levkowitz), and the design of a generalized technology platform for acoustic signal presentation (Powell).",
  "authors": [
    {
      "name": "Elizabeth M. Wenzel",
      "institution": "NASA-Ames Research Center, Mail Stop 262-2, Moffett Field, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100548418",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Buxton, W., Gaver, W., &amp; B ly, S. The Use of Non- Speech Audio at the Interface. (Tutorial No. 10). Presented at CHI'89 Human Factors in Computing Systems (Austen, April 30-May 4, 1989), ACM Press.",
      "doi": ""
    },
    {
      "text": "Foster, S.H., Wenzel, E.M., and Taylor, R.M. Realtime synthesis of complex acoustic environments. ASSP (IEEE) Workshop on Applications of Signal Processing to Audio &amp; Acoustics, (New Paltz, NY, October 2- 23, 1991).",
      "doi": ""
    },
    {
      "text": "Gaver, W. W., Smith, R. B., &amp; O'Shea, T. Effective sounds in complex systems: The ARKola simulation, in Proceedings of CHI'91 Human Factors in Computing Systems (New Orleans, April 27-May 2, 1991), ACM Press, pp. 85-90.  ",
      "doi": "10.1145/108844.108857"
    },
    {
      "text": "Smith, S., Bergeron. R. D., &amp; Grinstein, G. G. Stereophonic and surface sound generation for exploratory data analysis, in Proceedings of CHI'90 Human Factors in Computing Systems (Seattle, April 1-5, 1990), ACM Press, pp. 125-132.  ",
      "doi": "10.1145/97243.97264"
    },
    {
      "text": "Wenzel, E. M. Localization in virtual acoustic displays. Presence: Teleoperators and Virtual Environments, 1, 1 (Winter 1992), 80-107. ",
      "doi": "10.5555/2870721.2870728"
    }
  ]
}