{
  "doi": "10.1145/169059.169088",
  "title": "Mental representations of programs by novices and experts",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "74-79",
  "year": 1993,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Vikki Fix",
      "institution": "Computer Science Department, University of South Dakota, Vermillion SD",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100029626",
      "orcid": "missing"
    },
    {
      "name": "Susan Wiedenbeck",
      "institution": "Computer Science Department, University of Nebraska Lincoln, NE",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100387125",
      "orcid": "missing"
    },
    {
      "name": "Jean Scholtz",
      "institution": "Computer Science Department, Portland State University, Portland, OR",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100426546",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adelson, B. When novices surpass experts: The difficulty of a task may increase with expertise. Journal of Experimental Psychology: Learning, Memory and Cognition 10 (1985), 483-495.",
      "doi": ""
    },
    {
      "text": "Boehm-Davis, D. A. Software comprehension. In Handbook of Human-Computer interaction, M. Helander, Ed., NY: North-Holland, 1988, pp. 107- 121.",
      "doi": ""
    },
    {
      "text": "Holt, R. W., Boehm-Davis, D. A., and Schultz, A. C. Mental representations of programs for student and professional programmers. In Empirical Stuch'es of Programmers: Second Workshop, G. M. Oison, S. Sheppard, and E. Soloway, Eds., Norwood, NJ: Ablex, 1987, pp. 33-46. ",
      "doi": "10.5555/54968.54971"
    },
    {
      "text": "Jeffries, R. A comparison of the debugging behavior of novice and expert programmers. Paper presented at the American Educational Research Association Annual meeting, 1982.",
      "doi": ""
    },
    {
      "text": "jeffries, R., Turner, A. A., Poison, P. G., and Atwood, M. E. The processes involved in designing software. In Cognitive Skills and Their Acquisition, J. R. Anderson, Ed., HiUsdale, NJ: Erlbaum, 1981, pp. 255-283.",
      "doi": ""
    },
    {
      "text": "Letovsky, S. Cognitive processes in program comprehension, in Empirical Studies of Programmers, E. Soloway and S. Iyengar, Eds., Norwood, NJ: Ablex, 1986, pp. 58-79. ",
      "doi": "10.5555/21842.28886"
    },
    {
      "text": "Nanja, M. and Cook, C.R. An analysis of the online debugging process. In Empirical Studies of Programmers: Second Workshop, G. M. Olson, S. Sheppard, and E. Soloway, Eds., Norwood, NJ: Ablex, 1987, pp. 172-184. ",
      "doi": "10.5555/54968.54979"
    },
    {
      "text": "Pennington, N. Comprehension strategies in programming. In Empirical Studies of Programmers: Second Workshop, G. M. Olson, S. Sheppard, and E. Soloway, Eds., Norwood, NJ: Ablex, 1987, pp. 100-113. ",
      "doi": "10.5555/54968.54975"
    },
    {
      "text": "Pennington, N. Stimulus structures and mental representations in expert comprehension of computer programs. Cognitive Psychology 19 (1987), 295-341.",
      "doi": ""
    },
    {
      "text": "Soloway, E. and Ehrlieh, K. Empirical studies of programming knowledge. IEEE Transactions on Software Engineering 10 (1984), 595-609.",
      "doi": "10.1109/TSE.1984.5010283"
    },
    {
      "text": "Soloway, E., Pinto, 1. Letovsky, S., Littman, D., and Lampert, R. Designing documentation to compensate for deloealized plans. Communications of the ACM 31 (1988), 1257-1267.  ",
      "doi": "10.1145/50087.50088"
    }
  ]
}