{
  "doi": "10.1145/169059.169229",
  "title": "LogoMedia: a sound-enhanced programming environment for monitoring program behavior",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "301-302",
  "year": 1993,
  "badges": [],
  "abstract": "Even for the programmer, computer software can be a mysterious black box. But what if the programmer were able to give the box a good shake and listen to things rattle inside? Are there tools like the doctor's stethoscope that can help programmers listen to the heartbeat of their software? These are the kinds of questions we decided to explore by building LogoMedia, a sound-enhanced programming environment. LogoMedia supports the ability to associate non-speech audio with program events while the code is being developed. These associations cause subsequent test runs of the program to generate and manipulate sounds which can aid in the comprehension and analysis of the program's behavior.",
  "authors": [
    {
      "name": "Christopher J. DiGiano",
      "institution": "Department of Computer Science, C.B. 430, University of Colorado, Boulder, Colorado and Dynamic Graphics Project, Department of Computer Science, University of Toronto, Toronto, Ontario, Canada M5S 1A4",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100407580",
      "orcid": "missing"
    },
    {
      "name": "Ronald M. Baecker",
      "institution": "Dynamic Graphics Project, Department of Computer Science, University of Toronto, Toronto, Ontario, Canada M5S 1A4",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100448368",
      "orcid": "missing"
    },
    {
      "name": "Russell N. Owen",
      "institution": "Dynamic Graphics Project, Department of Computer Science, University of Toronto, Toronto, Ontario, Canada M5S 1A4",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332519934",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Baecker, R. M., and Buchanan, J. W. (1990). A Programmer's Interface: A Visually Enhanced and Animated Programming Environment. Proceedings of Twenty-Third Annual Hawaii International Conference on Systems Sciences, Hawaii. IEEE Computer Society, 531-540.",
      "doi": ""
    },
    {
      "text": "Brown, M. H., and Hershberger, J. (1992). Color and Sound in Algorithm Animation. IEEE Computer 25 (12): 52-63.  ",
      "doi": "10.1109/2.179117"
    },
    {
      "text": "Francioni, J. M., Jackson, J. A., and Albright, L. (1991). The Sounds of Parallel Programs. Proceedings of the 6th Distributed Memory Computing Conference, 570-577.",
      "doi": ""
    },
    {
      "text": "Price, B. A., Baecker, R. M., and Small, I. S. (1992). A Principled Taxonomy of Software Visualization. Submitted for review.",
      "doi": ""
    }
  ]
}