{
  "doi": "10.1145/169059.169061",
  "title": "Preserving knowledge in design projects: what designers need to know",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "7-14",
  "year": 1993,
  "badges": [],
  "abstract": "",
  "tags": [
    "design tools",
    "user scenarios",
    "design rationale",
    "design methods"
  ],
  "authors": [
    {
      "name": "James D. Herbsleb",
      "institution": "Univ. of Michigan, Ann Arbor",
      "img": "/do/10.1145/contrib-81100340340/rel-imgonly/81100340340.jpg",
      "acmid": "81100340340",
      "orcid": "missing"
    },
    {
      "name": "Eiji Kuwana",
      "institution": "NTT Corp., Tokyo, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332510683",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brooks, F.P., No silver bullet. IEEE Computer, 1987. 20: p. 10-19.  ",
      "doi": "10.1109/MC.1987.1663532"
    },
    {
      "text": "Card, S.K., T.P. Moran, and A. Newell, The psychology of human-computer interaction. 1983, Hillsdale, NJ: Erlbaum. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Conklin, E.J. and K.C.B. Yakemovic, A processoriented approach to design rationale. Human-Computer Interaction, 1991.6: p. 357-391.",
      "doi": ""
    },
    {
      "text": "Curtis, B., H. Krasner, and N. Iscoe, A field study of the software design process for large systems. Communications of the ACM., 1988.31: p. 1268-1287.  ",
      "doi": "10.1145/50087.50089"
    },
    {
      "text": "Davis, A.M., Software requirements: Analysis and specification. 1990, Englewood Cliffs, NJ: Prentice Hall. ",
      "doi": "10.5555/78225"
    },
    {
      "text": "Ghezzi, C., M. Jazayeri, and D. Mandrioli, Fundamentals of software engineering. 1991, Englewood Cliffs, NJ: Prentice Hall. ",
      "doi": "10.5555/102710"
    },
    {
      "text": "Guindon, R., Knowledge exploited by experts during software system design, international Journal of.Man- Machine Studies, 1990. 33: p. 279-304.  ",
      "doi": "10.1016/S0020-7373%2805%2980120-8"
    },
    {
      "text": "IEEE. Guide for software requirements specifications, 1984, Std 830-1984.",
      "doi": ""
    },
    {
      "text": "IEEE Recommended practice for software design descriptions, 1987, Std 1016-1987.",
      "doi": ""
    },
    {
      "text": "Jacobson, I., Object-oriented software engineering. 992, Reading, MA: Addison-Wesley.",
      "doi": ""
    },
    {
      "text": "Karat, J. and J.L. Bennett, Using scenarios in design meetings -- a case study example, in Taking software design seriously, J. Karat, Editor. 1991, Harcourt Brace Jovanovich: Boston. p. 63-94. ",
      "doi": "10.5555/110707.110711"
    },
    {
      "text": "Karat, J. and J.L. Bennett, Working within the design process: Supporting effetive and efficient design, in Designing interaction: Psychology at the human-computer interface, J.M. Carroll, Editor. 1991, Cambridge University Press: New York. p. 269-285. ",
      "doi": "10.5555/120352.120366"
    },
    {
      "text": "Kuwana, Eo and J.D. Herbsleb. Representing knowledge in requirements engineering: An empirical study of what software engineers need to know. in IEEE International Symposium on Requirements Engineering. 1993.",
      "doi": ""
    },
    {
      "text": "Lee, J. SIBYL: A tool for managing group design, in CSCW '90. 1990. Los Angeles:  ",
      "doi": "10.1145/99332.99344"
    },
    {
      "text": "Lee, J. and K.-Y. Lai, What's in design rationale. Human-Computer Interaction, 1991.6: p. 251-280.",
      "doi": ""
    },
    {
      "text": "MacLean, A., et al., Questions, options, and criteria: Elements of design space analysis. Human-Computer Interaction, 1991.6: p. 201-250.",
      "doi": ""
    },
    {
      "text": "Moran, T. and J. Carroll, ed. Design Rationale. in press.",
      "doi": ""
    },
    {
      "text": "Muller, M.J. Retrospective on a year of participatory design using the PICT1VE technique, in CHI \"92. 1992.  ",
      "doi": "10.1145/142750.142898"
    },
    {
      "text": "Nakajo, T. and H. Kume, A case history analysis of software error cause-effect relationships. IEEE Transactions on Software Engineering, 1991.17\" p. 830- 837.  ",
      "doi": "10.1109/32.83917"
    },
    {
      "text": "Potts, C., Supporting software design: Integrating design processes, design methods, and design rationale, in Design Rationale, T. Moran and J, Carroll, Editor. in press,",
      "doi": ""
    },
    {
      "text": "Siochi, A.C., D. Hix, and H.R. Hartson, The UAN: A notation to support user-centered design of direct manipulation interfaces, in Taking software design seriously: Practical techniques for human-computer interaction design, J. Karat, Editor. 1991, Academic Press: Boston. p. 157-194. ",
      "doi": "10.5555/110707.110716"
    },
    {
      "text": "Yourdon, E., Modern structured analysis. 1989, Englewood Cliffs, NJ: Yourdon Press. ",
      "doi": "10.5555/62004"
    }
  ]
}