{
  "doi": "10.1145/169059.169309",
  "title": "Tivoli: an electronic whiteboard for informal workgroup meetings",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "391-398",
  "year": 1993,
  "badges": [],
  "abstract": "This paper describes Tivoli, an electronic whiteboard application designed to support informal workgroup meetings and targeted to run on the Xerox Liveboard, a large screen, pen-based interactive display. Tivoli strives to provide its users with the simplicity, facile use, and easily understood functionality of conventional whiteboards, while at the same time taking advantage of the computational power of the Liveboard to support and augment its users' informal meeting practices. The paper presents the motivations for the design of Tivoli and briefly describes the current version in operation. It then reflects on several issues encountered in designing Tivoli, including the need to reconsider the basic assumptions behind the standard desktop GUI, the use of strokes as the fundamental object in the system, the generalized wipe interface technique, and the use of meta-strokes as gestural commands.",
  "authors": [
    {
      "name": "Elin Rønby Pedersen",
      "institution": "Department of Computer Science, Roskilde University, DK-4000 Roskilde, Denmark and Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659982251",
      "orcid": "missing"
    },
    {
      "name": "Kim McCall",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100517815",
      "orcid": "missing"
    },
    {
      "name": "Thomas P. Moran",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81407594532",
      "orcid": "missing"
    },
    {
      "name": "Frank G. Halasz",
      "institution": "Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100332524",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sara A. Bly. A Use of Drawing Surfaces in Different Collaborative Settings. Proceedings of CSCW 88 Conference on Computer Supported Cooperative Work. Portland, 1988, pp. 250- 256.  ",
      "doi": "10.1145/62266.62286"
    },
    {
      "text": "Sara A. Bly and Scott L. Minneman. Commune: A Shared Drawing Surface. In SIGOIS Bulletin, Massachusetts, 1990, pp. 184-192.  ",
      "doi": "10.1145/91474.91514"
    },
    {
      "text": "Eric A. Bier, Steve Freeman. MMM: A User Interface Architecture for Shared Editors on a Single Screen. Proceedings of the ACM Symposium on User Intelface Sofm,are and Technology, UIST'91, 1991.  ",
      "doi": "10.1145/120782.120791"
    },
    {
      "text": "Tom Brmck, Louis M. Gomez. A Collaborative Medium for the Support of Conversational Props. To appear in Proceedings of CSCW 92 Colff'erence on Computer Supported Cooperative Work. Toronto, 1992.  ",
      "doi": "10.1145/143457.143476"
    },
    {
      "text": "William Buxton. Chunking and phrasing and the design of human-computer dialogues, Proceedzngs of the IFIP World Computer Congress, Dublin, Ireland, 1986, pp. 475-480.",
      "doi": ""
    },
    {
      "text": "Robert Can', Dan Shafer. The Power of the PenPoint. Addison- Wesley, 1991.",
      "doi": ""
    },
    {
      "text": "Scott Elrod, Richard Bruce, David Goldberg, Frank Halasz, William Janssen, David Lee, Kim McCall, Ehn R. Pedersen, Ken Pier, John Tang and Brent Welch. Liveboard: A large interactive display supporting group meetings, presentations and remote collaboration. Proceedings of CHI '92 Conference on Human Factors in Computing Systems, Monterey, CA, 1992.  ",
      "doi": "10.1145/142750.143052"
    },
    {
      "text": "Hiroshi ishii, Minoru Kobayashi, Jonathan Grudin. Integration of Inter-personal space and shared workspace: ClearBoard design and experiments. Proceedings of CSCW 92 Conference on Computer-Supported Cooperative Work, Toronto, 1992, pp. 33-42  ",
      "doi": "10.1145/143457.143459"
    },
    {
      "text": "Fred Lakin, John Wambaugh, Larry Leifer, Dave Cannon, Cecelia Sivard. The Electronic Design Notebook: Performing Medium and Processing Medium. Visual Computer: International Journal of Computer Graphics, 214-226, August 1989.",
      "doi": ""
    },
    {
      "text": "Kim McCall, Thomas Moran, Bill van Melle, Elin Pedersen, Frank Halasz. Design principles for sharing in Tivoli, a whiteboard meeting-support tool. Position paper for the Workshop on Real Time Group Drawing and Writing Tools, CSCW 92 Conference on Computer-Supported Cooperative Work, Toronto. 1992.",
      "doi": ""
    },
    {
      "text": "Mark Stefik, Greg Foster, Danny Bobrow, Ken Kahn, Stan Lanning, Lucy Suchman. Beyond the Chalkboard: Computer support for collaboration and problem solving in meetings. Communications of the ACM, 30(1 ), 1987. Also in Irene Greif, editor, Computer Supported Work: A Book of Readings, Morgan Kaufmann Publishers, 1988, pp. 335-366.  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "John Tang. Listing, Drawing, and Gesturing in Design: A Study of the Use of Shared Workspaces by' Design Teams. Ph.D. Thesis. Stanford University, Department of Mechanical Engineering, 1989.",
      "doi": ""
    },
    {
      "text": "Mark Weiser. The Computer for the 21st Century. Scientific American, Sept. 1991.",
      "doi": ""
    }
  ]
}