{
  "doi": "10.1145/169059.169113",
  "title": "The evolution of an interface for choreographers",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "115-122",
  "year": 1993,
  "badges": [],
  "abstract": "This paper describes the evolution of the interface to Life Forms, a compositional tool for the creation of dance choreography, and highlights some of the important lessons we have learned during a six year design and implementation period. The lessons learned can be grouped into two categories: 1) Process, and 2) Architecture of the Interface. Our goal in developing a tool for choreography has been to provide computer-based creative design support for the conception and development of dance. The evolution was driven by feedback from the choreographers and users who were members of the development team, combined with our knowledge of current thinking on design and composition. Although the interface evolved in a relatively unconstrained way, the resulting system has  many of the features that theoretical discussion in human interface design has projected necessary. The Life Forms interface has evolved incrementally with one major discontinuity where adoption of a new compositional primitive required a completely new version.",
  "authors": [
    {
      "name": "Tom W. Calvert",
      "institution": "School of Computing Science, Simon Fraser University, Burnaby, B.C. Canada V5A 1S6",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100552470",
      "orcid": "missing"
    },
    {
      "name": "Armin Bruderlin",
      "institution": "School of Computing Science, Simon Fraser University, Burnaby, B.C. Canada V5A 1S6",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100008103",
      "orcid": "missing"
    },
    {
      "name": "Sang Mah",
      "institution": "School of Computing Science, Simon Fraser University, Burnaby, B.C. Canada V5A 1S6",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100630550",
      "orcid": "missing"
    },
    {
      "name": "Thecla Schiphorst",
      "institution": "School of Computing Science, Simon Fraser University, Burnaby, B.C. Canada V5A 1S6",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409594757",
      "orcid": "missing"
    },
    {
      "name": "Chris Welman",
      "institution": "School of Computing Science, Simon Fraser University, Burnaby, B.C. Canada V5A 1S6",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81414615349",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Akin, O. How Do Architects Design?, In A/and Pattern Recognition in Computer Aided Design, ed. Latombe, IFIP, North-Holland, 1978, pp. 65-103.",
      "doi": ""
    },
    {
      "text": "Brightman P. Making dances with algorithms: Towards a theory of choreography, based on the use of computer programs and Laban concepts. M.A. Thesis, Columbia University, 1984.",
      "doi": ""
    },
    {
      "text": "Bruderlin, A. and Calvert, T.W. Goal-Directed, Dynamic Animation of Human Walking. Computer Graphics (SIGGRAPH 89), vol. 23, (1989), pp. 233-242.  ",
      "doi": "10.1145/74334.74357"
    },
    {
      "text": "Calvert, T.W., Welman, C., Gaudet, S., Schiphorst, T. and Lee,C. Composition of Multiple Figure Sequences for Dance and Animation. The Visual Computer, vol. 7, 1991, pp. 114-121.  ",
      "doi": "10.1007/BF01901182"
    },
    {
      "text": "Calvert, T.W. Towards a Language for Human Movement. Computers and the Humanities, 20:2, (1986), pp. 35-43.",
      "doi": ""
    },
    {
      "text": "Calvert, T.W., Chapman, J., and Patla, A. Aspects of the Kinematic Simulation of Human Movement. IEEE Computer Graphics and Applications, vol. 2, (November 1982), pp. 41- 50.",
      "doi": "10.1109/MCG.1982.1674484"
    },
    {
      "text": "Card, S., Moran, T., and Newell, A. The Psychology of Human-Computer Interaction. Lawrence Erlbaum Assoc., I-Iillsdale, N.J., 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Chen, M., Mountford, J. and Sellen, A. \"A Study in Interactive 3D Rotation Using 2D Control Devices\". Computer Graphics 22, 4, 1988, pp. 121-129.  ",
      "doi": "10.1145/378456.378497"
    },
    {
      "text": "Hartson, H.R., and Hix, D. Human-Computer interface DeveloPment: Concepts and Systems. ACM Computing Surveys 21, 1, (1989), pp. 5-92.  ",
      "doi": "10.1145/62029.62031"
    },
    {
      "text": "Johansson, G. Perception and Psychology, 14, pp. 201-211, 1973.",
      "doi": ""
    },
    {
      "text": "Strauss, P., and Carey, R. An Object-Oriented 3D Graphics Toolkit. Computer Graphics (SIGGRAPH 92), 26, 2, (July 1992), pp. 341-349.  ",
      "doi": "10.1145/142920.134089"
    },
    {
      "text": "Schiphorst, T., Calvert, T., Lee, C., Welman, C. and Gaudet, S. Tools for Interaction with the Creative Process of Composition, Proc. CHI'90, (Seattle, April 1990), pp. 167-174.  ",
      "doi": "10.1145/97243.97270"
    },
    {
      "text": "Simon, H.A. The Sciences of the Artificial. MIT Press, Cambridge, MA., 1969. ",
      "doi": "10.5555/237774"
    },
    {
      "text": "Welman, C. \"Inverse Kinematics Through Differential Manipulation\". In Proceedings of the Western Computer Graphics Symposium, (1992), pp. 123-128.",
      "doi": ""
    }
  ]
}