{
  "doi": "10.1145/169059.169346",
  "title": "Providing high-level control and expert assistance in the user interface presentation design",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "430-437",
  "year": 1993,
  "badges": [],
  "abstract": "Current user interface builders provide only low-level assistance, because they have knowledge of neither the application, nor the principles by which interface elements are combined effectively. We have developed a framework that unites the knowledge components essential for effective user interface presentation design. The framework consists of an application model (both a data model and a control model), a design process model that supports top-down iterative development, and graphic design knowledge that is used both to place dialog box elements such that their application dependent logical relationships are visually reinforced and to control design symmetry and balance. To demonstrate the framework's viability, we have constructed a tool based on encapsulated design knowledge that establishes high-level style preferences and provides expert assistance for the dialog box presentation design and menu structuring.",
  "tags": [
    "automatic layout",
    "knowledge-based tool",
    "UI design process"
  ],
  "authors": [
    {
      "name": "Won Chul Kim",
      "institution": "Department of Electrical Engineering and Computer Science, The George Washington University, Washington, DC",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81452598728",
      "orcid": "missing"
    },
    {
      "name": "James D. Foley",
      "institution": "Graphics, Visualization and Usability Center, College of Computing, Georgia Institute of Technology, Atlanta, GA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100302796",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Apple Computer, Inc. Human Interface Guidelines: The Apple Desktop interface, Addison-Wesley, Reading, MA 1990.",
      "doi": ""
    },
    {
      "text": "Arens, Y., L. Miller, S. Shapiro, and N. Sondheimer. Automatic Construction of User-Interface Displays,AAA/- 8 Proceedings, St. Paul, MN, August 1988.",
      "doi": ""
    },
    {
      "text": "Cardelli, L. Building User interfaces by Direct Manipulation, in Proceedings of the ACM $IGGRAPH Symposium on User Interface Software, ACM, New York, 1988, pp. 152-166.  ",
      "doi": "10.1145/62402.62428"
    },
    {
      "text": "Conover, T.E. Graphic Communications Today, West Publishing Company, St. Paul, MN 1985.",
      "doi": ""
    },
    {
      "text": "Cossey, G. Prototyper, SmetherBarnes, Portland, OR, 1989.",
      "doi": ""
    },
    {
      "text": "de Baar, D., L Foley, and K. Mullet. Coupling Application Design and User interface Design, in Proceedings of CHI'92-SIGCHI Computer-Human Interaction Conference, ACM, New York, 1992, pp. 259-266.  ",
      "doi": "10.1145/142750.142806"
    },
    {
      "text": "Foley, J., W. Kim, K. Murray, and S. Kovacevic. UIDE- An Intelligent User Interface Design Environment, in Sullivan, J and S. Tyler (eds.),lntelligent Userlnterfaces, Addison-Wesley, Reading, MA, 1991, pp. 339-384.  ",
      "doi": "10.1145/107215.128716"
    },
    {
      "text": "Foley, J., W. Kim, S. Kovaccvic, and K. Murray. Def'ming Interfaces at a High Level of Abstraction, IEEE Software, 6(1), january, 1989, pp. 25-32.  ",
      "doi": "10.1109/52.16899"
    },
    {
      "text": "Galitz, W. Handbook of Screen Format Design, Q.E.D. Information Sciences, Inc., Wellesley, MA, 1981.",
      "doi": ""
    },
    {
      "text": "Hurlburt, Allen. Layout: the design of the printed page, Watson-Guptill Publications, New York, 1977.",
      "doi": ""
    },
    {
      "text": "Inference Corp. ART Reference Manual, Inference Corporation, Los Angeles, CA, 1987.",
      "doi": ""
    },
    {
      "text": "Kim, W. Knowledge-Based Framework for an Automatexl User Interface Presentation Design Tool, Ph.D. Thes/s, Department of Eleclrical Engineering and Computer Science, George Washington University, Washington, D.C., 1993. ",
      "doi": "10.5555/164690"
    },
    {
      "text": "Kim, W., and J. Foley, DON: User Interface Presentation Design Assistant, in Proceedings of the ACM SIGGRAPH Symposium on User Interface Software and Technology, ACM, New York, 1990, pp. 10-20.  ",
      "doi": "10.1145/97924.97926"
    },
    {
      "text": "Kim, W., and J. Rhyne. Knowledge Base Model for Automated User Interface Design, Report GWU-IIST-89- 29, Department of Elecaical Engineering and Computer Science, George Washington University, Washington, D.C., 1989.",
      "doi": ""
    },
    {
      "text": "Linton, M., J. Vlissides, and P. Calder. Composing User Interfaces with InterViews, IEEE Computer, Feb. 1989.  ",
      "doi": "10.1109/2.19829"
    },
    {
      "text": "Marcus, A. Graphic Design for Electronic Documents and User Interfaces, Addison-Wesley, Reading, MA, 1992. ",
      "doi": ""
    },
    {
      "text": "Messinger, E., L. Rowe, and R. Henry. A Divide-and- Conquer Algorithm for the Automatic Layout of Large Directed Graphs,lEEE Transactions of Systems, Man, and Cybernetics, Vol. SMC-21, No. 1, 1991, pp. 1-12.",
      "doi": ""
    },
    {
      "text": "Open Software Foundation. OSFiMotif Style Guide, Revision 1.0, Prentice-Hall, Inc., Englewood Cliffs, NJ, 1990. ",
      "doi": "10.5555/101385"
    },
    {
      "text": "Streveler, D., and A. Wasserman. Quantitative Measures of the Spatial Properties of Screem Designs, inProceedings INTERA CT'87, 2ndlFIP Conference on Human-Computer Interaction, Vol. 1, Elsivier Science Publishers, Amsterdam, 1987, pp. 125-133.",
      "doi": ""
    },
    {
      "text": "Sukaviriya, P., J. Foley, T. Griffith. A Second Generation User Interface Design Environment: The Model and The Runtime Architecture, INTERCHI'93, Conference on Human Factors in Computing Systems, ACM, New York, 1993.  ",
      "doi": "10.1145/169059.169299"
    },
    {
      "text": "Sun Microsystems, Inc. and AT&amp;T. OPEN LOOK GUI Application Style Guidelines, Addison-Wesley, Reading, MA, 1990. ",
      "doi": "10.5555/101383"
    },
    {
      "text": "Sun Microsystems, Inc. Open Windows Developer's Guide 1.1, Reference Manual, Part No. 800-5380-10, Revision A, Mountain View, CA, June 1990.",
      "doi": ""
    },
    {
      "text": "Szczur, M., and P. Miller. Transportable Applications Environment (TAE) PLUS, in Proceedings of OOPSLA'88, Object-Oriented Programming Systems, Languages and Applications Conference, ACM, New York, 1988.  ",
      "doi": "10.1145/62083.62090"
    },
    {
      "text": "Tullis, T. A Computer-Based Tool for Evaluating Alphanumeric Displays, in Proceedings INTERACT87, 2nd IFIP Conference on Human-Computer Interaction, Vol. 2, Elsivier Science Publishers, Amsterdam, 1987, pp. 123-127.",
      "doi": ""
    },
    {
      "text": "Walker II, John. A Node-positioning Algorithms for General Trees, Software-Practice and Experience, Vol. 20(7), 1990, pp. 685-705.  ",
      "doi": "10.1002/spe.4380200705"
    },
    {
      "text": "Wiecha, C, W. Bennett, S. Boies, and J. Gould. Ge~g Highly Interactive User Interfaces, in Proceedings of CHI'89-SIGCHI Computer-Human Interaction Conference, ACM, New York, 1989, pp. 277-282.  ",
      "doi": "10.1145/67449.67502"
    }
  ]
}