{
  "doi": "10.1145/169059.169365",
  "title": "Orienteering in an information landscape: how information seekers get from here to there",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "438-445",
  "year": 1993,
  "badges": [],
  "abstract": "We studied the uses of information search results by regular clients of professional intermediaries. The clients in our study engaged in three different types of searches: (1) monitoring a well-known topic or set of variables over time, (2) following an information-gathering plan suggested by a typical approach to the task at hand, and (3) exploring a topic in an undirected fashion. In most cases, a single search evolved into a series of interconnected searches, usually beginning with a high-level overview. We identified a set of common triggers and stop conditions for further search steps. We also observed a set of common operations that clients used to analyze search results. In some settings, the number of search iterations was reduced by restructuring the work done by  intermediaries. We discuss the implications of the interconnected search pattern, triggers and stop conditions, common analysis techniques, and intermediary roles for the design of information access systems.",
  "tags": [
    "information use",
    "information search",
    "intermediaries",
    "collaborative work"
  ],
  "authors": [
    {
      "name": "Vicki L. O'Day",
      "institution": "Hewlett-Packard Laboratories, 1501 Page Mill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100276680",
      "orcid": "missing"
    },
    {
      "name": "Robin Jeffries",
      "institution": "Hewlett-Packard Laboratories, 1501 Page Mill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332506629",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bates, M., The design of browsing and bert)rpicking techniques for the online search interface. Online Review 13(5)(1989).",
      "doi": ""
    },
    {
      "text": "Belkin, N., ASK for information retrieval: Part 1. Background and theory. Journal of Documentation 38(2) (1982).",
      "doi": ""
    },
    {
      "text": "Belkin, N., ASK for information retrieval: Part 2. Results of a design study. Journal of Documentation 38(3) (1982).",
      "doi": ""
    },
    {
      "text": "Dervin, B. and Nilan, M., Information needs and uses. In: Williams, M., ed. Annual Review of lnformation Science and Technology: Volume 21. (Knowledge Industry Publications, Inc., 1986).",
      "doi": ""
    },
    {
      "text": "Ellis, D., A behavioural approach to information retrieval system design. Journal of Documentation 45(3) (1989).  ",
      "doi": "10.1108/eb026843"
    },
    {
      "text": "Fischer, G. and Nieper-Lemke, H., HELGON: Extending the retrieval by reformulation paradigm. Proceedings CHI '89 (Austin, 30 April-4 May, 1989).  ",
      "doi": "10.1145/67449.67518"
    },
    {
      "text": "Hewins, E., Information need and use studies. In: Williams, M., ed. Annual Review of Information Science and Technology: Volume 25. (Elsevier Science Publishers, 1990).",
      "doi": ""
    },
    {
      "text": "Paepcke, A., An object-oriented view onto public, heterogeneous text databases. Hewlett-Packard Laboratories Technical Report HPL-92-84 (1992).",
      "doi": ""
    },
    {
      "text": "Wiederhold, G., Mediators in the architecture of future information systems. IEEE Computer (March 1992).  ",
      "doi": "10.1109/2.121508"
    },
    {
      "text": "Williams, M., What makes RABBIT run? International Journal of Man-Machine Studies 21 (1984).  ",
      "doi": "10.1016/S0020-7373%2884%2980052-8"
    }
  ]
}