{
  "doi": "10.1145/169059.169441",
  "title": "Empirically-based re-design of a hypertext encyclopedia",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "500-506",
  "year": 1993,
  "badges": [],
  "abstract": "This paper reports on the processes used and guidelines discovered in re-designing the user interface of the hypertext encyclopedia, HyperHolmes. The re-design was based on the outcomes of a previous experiment and was evaluated experimentally. Results showed that the new system resulted in superior performance and somewhat different styles of navigation compared to the old system and to paper. The study provides empirical support for design guidelines relating to tiled windows, navigation tools, graphics and hierarchical navigation.",
  "authors": [
    {
      "name": "Keith Instone",
      "institution": "Department of Computer Science, Bowling Green State University, Bowling Green, Ohio",
      "img": "/do/10.1145/contrib-81100348970/rel-imgonly/keith_instone-150x150.jpg",
      "acmid": "81100348970",
      "orcid": "missing"
    },
    {
      "name": "Barbee Mynatt Teasley",
      "institution": "Department of Computer Science, Bowling Green State University, Bowling Green, Ohio",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81430641733",
      "orcid": "missing"
    },
    {
      "name": "Laura Marie Leventhal",
      "institution": "Department of Computer Science, Bowling Green State University, Bowling Green, Ohio",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100373608",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Begoray, J, A. An introduction to hypermedia issues, systems and application areas. International Journal of Man-Machine Studies, 33, 1990, 121-147.  ",
      "doi": "10.1016/S0020-7373%2805%2980026-4"
    },
    {
      "text": "Bly, S. A., and Rosenberg, J. K. A comparison of tiled and overlapping windows, CHI '86 Proceedings, 1986, 101- 106.  ",
      "doi": "10.1145/22627.22356"
    },
    {
      "text": "Dillon, A. Reading from papers versus screens: A critical review of the empirical literature. Ergonomics, 35 (10), October 1992, 1297-1326.",
      "doi": ""
    },
    {
      "text": "Egan, D. E., Lesk, M. E., Ketchum, R. D., Lochbaum, C. c., Remde, J. R., Littman, M. and Landauer, T. K. Hypertext for the electronic library?: CORE sample results, Hypertext '91 Proceedings (New York: ACM), 1991, 299-312.  ",
      "doi": "10.1145/122974.123002"
    },
    {
      "text": "Egan, D. E., Remde, J. R., Gomez, L. M., Landauer, T. K., Eberhardt, J. and Lochbaum, C. C. Formative designevaluation of SuperBook, A CM Transactions on Information Systems, 7 (1), 1989, 30-57.  ",
      "doi": "10.1145/64789.64790"
    },
    {
      "text": "Hammond, N. and Allinson, L. Extending hypertext for learning: An investigation of access and guidance tools. In Sutcliffe, A. and Macaulay, L. (eds), People and Computers V, Cambridge: Cambridge University Press, 1989, 293- 304. ",
      "doi": "10.5555/92968.93003"
    },
    {
      "text": "Hansen, W. J., and Haas, C. Reading and writing with computers: A framework for explaining differences in performance, Communications of the A CM, 31 (9), September 1988, 1080-1089.  ",
      "doi": "10.1145/48529.48532"
    },
    {
      "text": "Hypertext '87 Proceedings. New York, ACM, 1989.",
      "doi": ""
    },
    {
      "text": "Hypertext '89 Proceedings. New York, ACM, 1989.",
      "doi": ""
    },
    {
      "text": "Hypertext '91 Proceedings. New York, ACM, 1991.",
      "doi": ""
    },
    {
      "text": "Instone, K., Leventhal, L. M., Teasley, B. M., Farhat, J. and Rohhnan, D. S. What do 1 want? and How do I get there?: Performance and navigation in information retrieval tasks with hypertext documents, Proceedings of the East-West International Conference on Human- Computer Interaction (St. Petersburg, Russia, August 4-8, 1992), 85-95.",
      "doi": ""
    },
    {
      "text": "Joel, W. J., White, R. and Tucker, W. Analysis of the effectiveness of graphics in computer aided instruction. In Salvendy, G. and Smith, M. J. (eds), Designing and Using Human-Computer interfaces and Knowledge Based Systems, Amsterdam: Elsevier Science, 1989, 376-383. ",
      "doi": "10.5555/92449.92497"
    },
    {
      "text": "Leventhal, L. M., Teasley, B. M., Instone, K., Rohlman, D. S. and Farhat, J. Sleuthing in HyperHolmes: Using hypertext vs. a book to answer questions, to appear in Behaviour and Information Technology.",
      "doi": ""
    },
    {
      "text": "Leventhal, L. M., Teasley, B. M., Instone, K. and Farhat, J. Age-related differences in the use of hypertext: Experiment and design guideiines. Bowling Green State University, Computer Science Department Technical Report 92-DEC-01, 1992.",
      "doi": ""
    },
    {
      "text": "Marchionini, G. Hypermedia and learning: Freedom and chaos. Educational Technology, 28 (11), November 1988, 8-12. ",
      "doi": "10.5555/60572.60575"
    },
    {
      "text": "Marchionini, G. and Shneiderman, B. Finding facts vs. browsing knowledge in hypertext systems, IEEE Computer, 21 (1), 1988, 70-80.  ",
      "doi": "10.1109/2.222119"
    },
    {
      "text": "Mynatt, B. T., Leventhal, L. M., Instone, K., Farhat, J. and Rohlman, D. S. Hypertext or book: Which is better for answering questions?, CHI '92 Proceedings, 1992, 19-25.  ",
      "doi": "10.1145/142750.142753"
    },
    {
      "text": "Nielsen, j. The matters that really matter for hypertext usability, Hypertext '89 Proceedings (New York: ACM), 1989, 239-248.  ",
      "doi": "10.1145/74224.74244"
    },
    {
      "text": "Nielsen, J. Hypertext and Hypermedia. New York: Academic Press, 1990. ",
      "doi": "10.5555/79094"
    },
    {
      "text": "Petre, M. and Green, T. R. G. Where to draw the line with text: Some claims by logic designers about graphics in notation. In D. Diaper, D. Gilmore, G. Cockton and B. Shackel (eds), Human-Computer InteractionBINTERA CT '90, New York: Elsevier-Science, 1990, 463-468. ",
      "doi": "10.5555/647402.725594"
    },
    {
      "text": "Reisel, J. F., and Shneiderman, B. is bigger better? The effects of display size on program reading. In G. Salvendy (ed), Social, Ergonomic and Stress Aspects of Work with Computers, (New York: Elsevier Science Publishers), 1987, 113-122.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. User interface design and evaluation for an electronic encyclopedia. In G. Salvendy (ed), Cognitive Engineering in the Design of Human-Computer Interaction and Expert Systems, (New York: Elsevier Science Publishers), 1987, 207-223.",
      "doi": ""
    },
    {
      "text": "Shneiderman, B. User interface design for the Hyperties electronic encyclopedia, Hypertext '87 Proceedings (New York: ACM), 1989, 299-312.  ",
      "doi": "10.1145/317426.317441"
    },
    {
      "text": "Simpson, A. and McKnight, C. Navigation in hypertext: Structural cues and mental maps. Hypertext 2 Conference, 1989.",
      "doi": ""
    },
    {
      "text": "Tombaugh, J., Lickorish, A. and Wright, P. Multi-window displays for readers of lengthy texts. International Journal of Man-Machine Studies, 26 (5), 1987, 597-615.  ",
      "doi": "10.1016/S0020-7373%2887%2980073-1"
    },
    {
      "text": "Tracy, J. The Encyclopaedia Sherlockiana. New York: Avenel, 1987.",
      "doi": ""
    },
    {
      "text": "Wright, P. Cognitive overheads and prostheses: Some issues in evaluating hypertexts. Hypertext '91, New York: ACM, 1991, 1-12.  ",
      "doi": "10.1145/122974.122975"
    },
    {
      "text": "Wright, P., Hull, A. and Black, D. Integrating diagrams and text. The Technical Writing Teacher, XVII (3), 1990, 244-254.",
      "doi": ""
    }
  ]
}