{
  "doi": "10.1145/169059.169111",
  "title": "Management of interface design in humanoid",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "107-114",
  "year": 1993,
  "badges": [],
  "abstract": "Today's interface design tools either force designers to handle a tremendous number of design details, or limit their control over design decisions. Neither of these approaches taps the true strengths of either human designers or computers in the design process. This paper presents a human-computer collaborative system that uses a model-based approach for interface design to help designers on decision making, and utilizes the bookkeeping capabilities of computers for regular and tedious tasks. We describe (a) the underlying modeling technique and an execution environment that allows even incompletely-specified designs to be executed for evaluation and testing purposes, and (b) a tool that decomposes high-level design goals into the necessary implementation steps, and helps designers  manage the myriad of details that arise during design.",
  "tags": [
    "design processes",
    "interface-building tools and techniques",
    "interface design representation",
    "development tools and methods",
    "rapid prototyping"
  ],
  "authors": [
    {
      "name": "Ping Luo",
      "institution": "USC/Information Sciences Institute, 4676 Admiralty Way, Marina del Rey, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659403975",
      "orcid": "missing"
    },
    {
      "name": "Pedro Szekely",
      "institution": "USC/Information Sciences Institute, 4676 Admiralty Way, Marina del Rey, CA",
      "img": "/do/10.1145/contrib-81100625746/rel-imgonly/szekely-photo-isi.jpg",
      "acmid": "81100625746",
      "orcid": "missing"
    },
    {
      "name": "Robert Neches",
      "institution": "USC/Information Sciences Institute, 4676 Admiralty Way, Marina del Rey, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327490788",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "P. Aberg and R. Neches. Clarification Dialogs: More Than Just A~ances For User Interfaces. ISI working paper.",
      "doi": ""
    },
    {
      "text": "W. Bennett, S. Boies, J. Gould, S. Greene and C. Wiecha. Transformations on a Dialog Tree: Rule-Based Mapping of Content to Style. in Proceedings of the ACM SIGGRAPH Symposium on User Interface Software and Technology, pp. 67-75, November 1989.  ",
      "doi": "10.1145/73660.73669"
    },
    {
      "text": "J. Conklin and M.L. Begeman. gIBIS: A Hypertext Tool for Exploratory Policy. In Proceedings CSCW'88. September 1988, pp. 140-152.  ",
      "doi": "10.1145/62266.62278"
    },
    {
      "text": "S. Draper and D.A. Norman. Software Engineering for User Interfaces. IEEE Transactions on Software Engineering. pages 252-258. March 1985.  ",
      "doi": "10.1109/TSE.1985.232208"
    },
    {
      "text": "J.D. Foley, W. C. Kim, S. Kovacevic and K. Murray. UIDE: An Intelligent User Interface Design Environment. In J. S. Sullivan and S. W. Tyler, editors, Intelligent User Interfaces. pp. 339-384. ACM Press, 1991.  ",
      "doi": "10.1145/107215.128716"
    },
    {
      "text": "B. Harp, E Aberg, D. Benjamin, R. Neches, E Szekely. DRAMA: An Application of a Logistic Shell. ISI/RR- 91-284. March 1991",
      "doi": ""
    },
    {
      "text": "E J. Hayes, E Szekely and R. Lerner. Design Alternafives for User Interface Management Systems Based on Experience with COUSIN. In Proceedings SIGCHI'85. April 1989, pp. 169-175.  ",
      "doi": "10.1145/317456.317488"
    },
    {
      "text": "A.C. Lemke and G. Fischer. A Cooperative Problem Solving System for User Interface Design. Proceedings of AAA1-90, pp.479-484.",
      "doi": ""
    },
    {
      "text": "B. A. Myers, et. al. Garnet: Comprehensive Support for Graphical, Highly-Interactive User Interfaces. IEEE Computer 23(11), pp. 71-85, November, 1990.  ",
      "doi": "10.1109/2.60882"
    },
    {
      "text": "B.A. Myers. State of the Art in User Interface Software Tools. in H. Rex Hartson and Deborah Hix. Ed., Advances in Human-Computer Interaction, Volume 4, Ablex Publishing, 1992. ",
      "doi": "10.5555/212925.212956"
    },
    {
      "text": "R. Neches, D. Benjamin, J. Granacki, B. Harp, and P. Szekely. Scenarios/Agendas: A Reusable, Customizable Approach to User-System Collaboration in Complex Activities. ISI working paper.",
      "doi": ""
    },
    {
      "text": "R. Neches, J. Foley, P. Szekely, P. Sukaviriya, P. Luo, S. Kovacevic, and S. Hudson. Knowledgeable Development Environments Using Shared Design Models. The 1993 International Workshop on Intelligent User Interfaces (IWIUI'93). January 4-7, 1993.  ",
      "doi": "10.1145/169891.169901"
    },
    {
      "text": "Neuron Data, Inc. 1991. Open Interface Toolkit. 156 University Ave. Palo Alto, CA 94301.",
      "doi": ""
    },
    {
      "text": "NEXT, Inc. 1990. Interface Builder, Palo Alto, CA.",
      "doi": ""
    },
    {
      "text": "D. Olsen. MIKE: The Menu Interaction Kontrol Environment. ACM Transactions on Graphics, vol 17, no 3, pp. 43-50, 1986.  ",
      "doi": "10.1145/27623.28868"
    },
    {
      "text": "G. Singh and M. Green. A High-level User Interface Management System. In Proceedings SIGCHI'89. April 1989, pp. 133-138.  ",
      "doi": "10.1145/67449.67476"
    },
    {
      "text": "W. Swartout and R. Balzer. On the Inevitable Intertwining of Specification and Implementation. CACM 25, 7 (July 1982), pp. 1-9.  ",
      "doi": "10.1145/358557.358572"
    },
    {
      "text": "P. Szekely. Template-based mapping of application data to interactive displays. In Proceedings UIST\" 90. October 1990, pp. 1-9.  ",
      "doi": "10.1145/97924.97925"
    },
    {
      "text": "P. Szekely, P, Luo, and R. Neches. Facilitating the Exploration of Interface Design Alternatives: The HU- MANOID Model of Interface Design. In Proceedings SIGCHI'92. May 1992, pp. 507-515  ",
      "doi": "10.1145/142750.142912"
    },
    {
      "text": "P. Szekely, P. Luo, and R. Neches. Beyond Interface Builders: Model-Based Interface Tools. In Proceedings INTERCHI\" 93. April 1993. ",
      "doi": "10.5555/164632.164954"
    },
    {
      "text": "Y.Y. Wong. Rough and Ready Prototypes: Lessons from Graphic Design. In Poster and Short Talks of CHI'92. May 1992, pp.83-84.  ",
      "doi": "10.1145/1125021.1125094"
    },
    {
      "text": "J. Yen, R. Neches, M. Debellis, P. Szekely, and P. Aberg. BACKBORD: An Implementation of Specification by Reformulation. In J. S. Sullivan and S. W. Tyler, editors, Intelligent User Interfaces. pp. 421-444. ACM Press, 1991.  ",
      "doi": "10.1145/107215.128723"
    }
  ]
}