{
  "doi": "10.1145/169059.169250",
  "title": "Planning for multiple task work: an analysis of a medical reception worksystem",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "314-320",
  "year": 1993,
  "badges": [],
  "abstract": "This paper presents an investigation of interactive worksystem planning in the multiple task work domain of medical reception. In an observational study of a medical reception worksystem, three different types of plan were identified: the task plan, the procedure plan and the activity plan. These three types of plan were required for effective working in the domain of medical reception, because of the many similar concurrent tasks, the frequency of behaviour switching between tasks, the frequency of behaviour switching between tasks and the need for consistency within the worksystem. It is proposed, therefore, that to design effective interactive human-computer worksystems for the domain of medical reception (and possibly for other work domains of a similar nature), the designer must specify the three different types of plan and the relationships between them. The three types of plan in medical reception are discussed in the context of design issues such as the allocation of planning structures.",
  "authors": [
    {
      "name": "Becky Hill",
      "institution": "Ergonomics Unit, University College London, 26 Bedford Way, London, WC1H 0AP",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100454433",
      "orcid": "missing"
    },
    {
      "name": "John Long",
      "institution": "Ergonomics Unit, University College London, 26 Bedford Way, London, WC1H 0AP",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100466738",
      "orcid": "missing"
    },
    {
      "name": "Walter Smith",
      "institution": "Ergonomics Unit, University College London, 26 Bedford Way, London, WC1H 0AP",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100074688",
      "orcid": "missing"
    },
    {
      "name": "Andy Whitefield",
      "institution": "Ergonomics Unit, University College London, 26 Bedford Way, London, WC1H 0AP",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100543244",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jeffcrys, M. and Sachs, H. Rethinking General Practice: Dilemmas in Primary Health Care. London Tavistock,1983.",
      "doi": ""
    },
    {
      "text": "Dowell, J. and Long, J. Towards a conception for an engineering discipline of human factors. Ergonomics, 32, (1989), 1513-1536.",
      "doi": ""
    },
    {
      "text": "Smith, M.W., Hill, B., Long, J.B. and Whitefield, A~D. The Planning and Control of Multiple Task Work: a Study of Secretarial Office Administration. In Proceedings of the Second Interdisciplinary Workshop on Mental Models, Cambridge, (1992a), 74- 83, in press.",
      "doi": ""
    },
    {
      "text": "Smith, M.W., Hill, B., Long, J.B. and Whitefield, A.D. Modelling the Relationship Between Planning, Control, Perception and Execution Bchaviours in Interactive Worksystcms. In D.Diapcr, M.Harrison and A.Monk (Eds) People and Computers VII; Proceedings of HCI '92. Cambridge University Press, 1992b. ",
      "doi": "10.5555/164592.164606"
    },
    {
      "text": "Smith, M.W., Hill, B., Long, J.B. and Whitefield, AX). A Design-Oricnte~ Framework of the Planning and Control of Multiple Task Work. Submitted for publication, 1993.",
      "doi": ""
    }
  ]
}