{
  "doi": "10.1145/169059.169069",
  "title": "Human cognition research laboratory: the Open University (U.K.)",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "51-52",
  "year": 1993,
  "badges": [],
  "abstract": "No abstract available.",
  "authors": [
    {
      "name": "Marc Eisenstadt",
      "institution": "Human Cognition Research Laboratory, The Open University, Milton Keynes, UK, MK7 6AA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100338248",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brayshaw, M. An Architecture for Visualising the Execution of Parallel Logic Programming. Proceedings of the Twelth International Joint Conference on Artificial Intelligence (IJCAI.91). Los Angeles: Morgan Kaufmann, 1991.",
      "doi": ""
    },
    {
      "text": "Brayshaw, M. Program Visualisation and Knowledge Negotiation: some proposals for visual techniques in tutorial dialog as applied to concurrent logic programming languages, in M.T. Elsom-Cook and R. Moyse (Eds.), Knowledge Negotiation. London\" Academic Press, 1992, pp. 303-309.",
      "doi": ""
    },
    {
      "text": "Brayshaw, M. and Eisenstadt, M. A Practical Graphical Tracer for Prolog. International Journal of Man-Machine Studies, 1991, 35 (5), pp. 597-631.",
      "doi": ""
    },
    {
      "text": "Domingue, J. Compressing and Comparing Metric Excecution Spaces. In D. Diaper et. al. (Eds). Human- Computer Interaction-- INTERACT '90. Amsterdam: Elsevier (North-Holland), 1990. ",
      "doi": "10.5555/647402.725444"
    },
    {
      "text": "Domingue, j., B.A. Price, and M. Eisenstadt: Viz: A Framework for Describing and Implementing Software Visualization Systems. In D. Gilmore and R. Winder, (Eds.) User-Centred Requirements for Software Engineering Environments. Berlin: Springer-Verlag (NATO Advanced Science Institute Series F: Computer and Systems Sciences), 1992.",
      "doi": ""
    },
    {
      "text": "Eisenstadt, M. and Brayshaw, M. A fine-grained account of Prolog execution for teaching and debugging. Instructional Science., 19(4/5), 1990, pp.407-436.",
      "doi": ""
    },
    {
      "text": "Eisenstadt, M., Brayshaw, M. and Payne, J. The Transparent Prolog Machine: Visualizing Logic Programs. Dordrecht, The Netherlands: Kluwer, 1991. ",
      "doi": "10.5555/574728"
    },
    {
      "text": "Eisenstadt, M., Domingue, J., Rajan, T., and Motta, E. Visual knowledge engineering. IEEE. Trans. Soft. Eng., 16 (10), 1990, pp. 1164-1177.  ",
      "doi": "10.1109/32.60296"
    },
    {
      "text": "Eisenstadt, M., Keane, M., &amp; Rajan, T. (Eds.) Novice Programming Environments: Explorations in Human- Computer Interaction and Artificial Intelligence. London: Lawrence Erlbaum, 1992.",
      "doi": ""
    },
    {
      "text": "Kiss, G., Variable Coupling of Agents to their Environment: Combining Situated and Symbolic Automata. In: E. Wemer and Y. Demazeau (Eds), Decentralized AI 3. Amsterdam: Elsevier/North Holland, 1992.",
      "doi": "10.1145/152683.152698"
    },
    {
      "text": "Price, B.A., Small, I.S., and Baecker, R. A taxonomy of software visualization. Proc. 25th Hawaii International Conference on System Sciences. New York: IEEE Press, 1992, pp. 597-606.",
      "doi": ""
    }
  ]
}