{
  "doi": "10.1145/169059.169255",
  "title": "The diary study: a workplace-oriented research tool to guide laboratory efforts",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "321-326",
  "year": 1993,
  "badges": [],
  "abstract": "Methods for studying user behavior in HCI can be informally divided into two approaches: experimental psychology in the laboratory and observations in the workplace. The first approach has been faulted for providing results that have little effect on system usability, while the second can often be accused of yielding primarily anecdotal data that do not support general conclusions. This paper describes two similar approaches in another field, the study of animal behavior, and shows how they produce complementary results. To support similar complementary interactions between research approaches in the HCI field, the paper describes the diary study technique, a tool for research in the workplace that achieves a relatively high standard of objectivity. A diary study is reported that focuses on exploratory learning.",
  "authors": [
    {
      "name": "John Rieman",
      "institution": "Department of Computer Science and Institute of Cognitive Science, University of Colorado, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100642568",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Brain, P.F. Ethology and experimental psychology: from confrontation to parmership. In Ethoexperimental Approaches to the Study of Behavior, R.J. Blanchard, P.F. Brain, D.C. Blanchard, and S. Parmigiani, Eds., Kluwer, Dordrecht, The Netherlands, 1989, pp. 19-27.",
      "doi": ""
    },
    {
      "text": "Carroll, J.M., Mack, R.L., Lewis, C.H., Grischkowsky, N.L., and Robertson, S.P. Exploring a word processor. Human Computer Interaction I (1985), 283-307.",
      "doi": "10.1207/s15327051hci0103_3"
    },
    {
      "text": "Ericsson, K. Anders, Tesch-R~imer, C., and Krampe, R.T. The role of practice and motivation in the acquisition of expert-level performance in real life: An empirical evaluation of a theoretical framework. In Encouraging the Development of Exceptional Skills and Talents, M.J.A. Howe, Ed., The British Psychological Society, Leicester, 1990, pp. 109-130.",
      "doi": ""
    },
    {
      "text": "Fantino, E., and Abarca, N. Choice, optimal foraging, and the delay-reduction hypothesis. Behavioral and Brain Sciences 8 (1985), 315-330.",
      "doi": ""
    },
    {
      "text": "Floyd, C., Wolf-Michael, M, Reisin, F.-M., Schmidt, G., and Wolf, G. Out of Scandinavia: Alternative approaches to software design and system development. Human-Computer Interaction 4 (1989), 253-350.",
      "doi": "10.1207/s15327051hci0404_1"
    },
    {
      "text": "Gould, J.D., Boies, S., and Lewis, C. Making usable, useful, productivity-enhancing computer applications. Communications of the ACM 34 (1991), 74-89.  ",
      "doi": "10.1145/99977.99993"
    },
    {
      "text": "Houston, A., Kacelnik, A., and McNamara, J. Some learning rules for acquiring information. In Functional Ontogony, David McFarland, Ed., Pitman, London, 1982, pp. 140-190.",
      "doi": ""
    },
    {
      "text": "Juster, F.T., and Stafford, F.P. (Eds.) Time, Goods and Well-being. Institute for Social Research, The University of Michigan, Ann Arbor, Mich., 1985.",
      "doi": ""
    },
    {
      "text": "Kamil, A.C., and Balda, R.P. Cache recovery and spatial memory in Clark's Nutcrackers. J. Exp. Psych., Animal Behavior Processes 11 (1985), 95-111.",
      "doi": ""
    },
    {
      "text": "Landauer, T.K., Research methods in human computer interaction. In Handbook of Human-Computer Interaction, M. Helander, Ed., Elsevier Science, Amsterdam, 1988, pp. 905-928.",
      "doi": ""
    },
    {
      "text": "Lewis, C. Using thinking aloud protocols to study the \"cognitive interface.\" Research Report RC 9265, IBM Thomas J. Watson Research Center, Yorktown Heights, N.Y., 1982.",
      "doi": ""
    },
    {
      "text": "Miller, D. B. Methodological issues in the ecological study of learning. In Issues in the Ecological Study of Learning, T.D. Johnston and A.T. Pietrewicz, Eds., Lawrence Erlbaum, Hillsdale, N.J., 1985, pp. 73-95.",
      "doi": ""
    },
    {
      "text": "Shrager, J., and Klahr, D. Instructionless learning about a complex device: The paradigm and observations. International Journal of Man-Machine Studies 25 (1986), 153-189.  ",
      "doi": "10.1016/S0020-7373%2886%2980075-X"
    },
    {
      "text": "Suchman, L. A. Plans and Situated Actions. Cambridge, England: Cambridge University Press, 1987.",
      "doi": "10.5555/38407"
    },
    {
      "text": "Tomback, D.F. Foraging strategies of Clark's Nutcracker. Living Bird 16 (1978), 123-161.",
      "doi": ""
    },
    {
      "text": "Vander Wall, S.B. An experimental analysis of cache recovery in Clark's Nutcracker. Animal Behavior 30 (1982), 84-94.",
      "doi": ""
    },
    {
      "text": "Vander Wall, S.B., and Balda, R.P. Coadaptations of the Clark's Nutcracker and the piflion pine for efficient seexl harvest and dispersal. Ecological Monographs 47 (1977), 89-111.",
      "doi": ""
    },
    {
      "text": "Wixon, D., Holtzblatt, K., and Knox, S. Contextual design: An emergent view of system design. In Proceedings of the Conference on Human Factors in Computing Systems (Seattle, Wash., April 1-5, 1990). ACM, New York, 1990, pp. 331-336.  ",
      "doi": "10.1145/97243.97304"
    }
  ]
}