{
  "doi": "10.1145/169059.169133",
  "title": "Embedding computer-based critics in the contexts of design",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "157-164",
  "year": 1993,
  "badges": [],
  "abstract": "Computational critiquing mechanisms provide an effective form of computer-human interaction supporting the process of design. Critics embedded in domain-oriented design environments can take advantage of additional knowledge residing in these environments to provide less intrusive, more relevant critiques. Three classes of embedded critics have been designed, implemented, and studied: Generic critics use domain knowledge to detect problematic situations in the design construction. Specific critics take advantage of additional knowledge in the partial specification to detect inconsistencies between the design construction and the design specification. Interpretive critics are tied to perspective mechanisms that support designers in examining their artifact from different viewpoints.",
  "tags": [
    "interpretive critics",
    "construction",
    "critiquing systems",
    "specification",
    "generic critics",
    "perspectives",
    "specific critics",
    "design environments",
    "domain orientation"
  ],
  "authors": [
    {
      "name": "Gerhard Fischer",
      "institution": "University of Colorado at Boulder, Department of Computer Science, Boulder CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409592298",
      "orcid": "missing"
    },
    {
      "name": "Kumiyo Nakakoji",
      "institution": "University of Colorado at Boulder, Department of Computer Science, Boulder, CO and Software Research Associates, Software Engineering Laboratory, 1-1-1 Hirakawa-cho, Chiyoda-ku, Tokyo 102, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100497202",
      "orcid": "missing"
    },
    {
      "name": "Jonathan Ostwald",
      "institution": "University of Colorado at Boulder, Department of Computer Science, Boulder, CO",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100396216",
      "orcid": "missing"
    },
    {
      "name": "Gerry Stahl",
      "institution": "University of Colorado at Boulder, Department of Computer Science, Boulder, CO",
      "img": "/do/10.1145/contrib-81100377939/rel-imgonly/81100377939.jpg",
      "acmid": "81100377939",
      "orcid": "missing"
    },
    {
      "name": "Tamara Sumner",
      "institution": "University of Colorado at Boulder, Department of Computer Science, Boulder, CO",
      "img": "/do/10.1145/contrib-81339531152/rel-imgonly/aa.jpg",
      "acmid": "81339531152",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R. Burton and J. S. Brown, \"An Investigation of Computer Coaching for Informal Learning Activites,\" in Intelligent Tutoring Systems, D. Sleeman and J. S. Brown, Ed., London, Academic Press, 1982, pp. 79-98.",
      "doi": ""
    },
    {
      "text": "P. Ehn, Work-Oriented Design of Computer Artifacts, arbetslivscentrum, Stockholm, 1989. ",
      "doi": "10.5555/1102017"
    },
    {
      "text": "G. Fischer, \"A Critic for LISP,\" Proceedings of the l Oth International Joint Conference on Artificial Intelligence, Milan, italy, 1987, pp. 177-184.",
      "doi": ""
    },
    {
      "text": "G. Fischer, A. Girgensohn, K. Nakakoji and D. Redmiles, \"Supporting Software Designers with Integrated, Domain-Oriented Design Environments,\" IEEE Transactions on Software Engineering, Special Issue on Knowledge Representation and Reasoning in Software Engineering, Vol. 18, pp. 511-522, 1992.  ",
      "doi": "10.1109/32.142873"
    },
    {
      "text": "G. Fischer, J. Grudin, A. C. Lemke, R. McCall, J. Ostwald, B. N. Reeves and F. Shipman, \"Supporting Indirect, Collaborative Design with Integrated Knowledge-Based Design Environments,\" HCI, Vol. 7 (Special Issue on Computer Supported Cooperative Work), 1992.",
      "doi": ""
    },
    {
      "text": "G. Fischer, A. Lemke, T. Mastaglio and A. Morch, \"Using Critics to Empower Users,\" CHI '90, Seattle, WA, 1990, pp. 337-347.  ",
      "doi": "10.1145/97243.97305"
    },
    {
      "text": "G. Fischer, A. C. Lemke, T. Mastaglio and A. Morch, \"The Role of Critiquing in Cooperative Problem Solving,\" ACM Transactions on Information Systems, Vol. 9, pp. 123-151, 1991.  ",
      "doi": "10.1145/123078.128727"
    },
    {
      "text": "G. Fischer, A. C. Lemke and T. Schwab, \"Knowledge-Based Help Systems,\" Human Factors in Computing Systems, CHI'85 Conference Proceedings (San Francisco, CA), pp. 161-167, 1985.  ",
      "doi": "10.1145/317456.317487"
    },
    {
      "text": "G. Fischer and K. Nakakoji, \"Making Design Objects Relevant to the Task at Hand,\" Proceedings of AAA1- 91, Ninth National Conference on Artificial intelligence, pp. 67-73, 1991.",
      "doi": "10.5555/1865675.1865686"
    },
    {
      "text": "A . Girgensohn, \"End-User Modifiability in Knowledge-Based Design Environments,\" Technical Report CU-CS-595-92, Department of Computer Science, University of Colorado at Boulder, 1992.",
      "doi": ""
    },
    {
      "text": "J. Lave, Cognition in Practice, Cambridge University Press, Cambridge, UK, 1988.",
      "doi": ""
    },
    {
      "text": "A. C. Lemke, \"Design Environments for High- Functionality Computer Systems,\" Unpublished Ph.D. Dissertation, Department of Computer Science, University of Colorado at Boulder, 1989. ",
      "doi": "10.5555/916100"
    },
    {
      "text": "A. C. Lemke, \"Cooperative Problem Solving Systems Must Have Critics,\" Proceedings of the AAA1 Spring Symposium Workshop on Knowledge- Based Human Computer Communication, pp. 73-75, 1990.",
      "doi": ""
    },
    {
      "text": "A. Repenning and T. Sumner, \"Using Agentsheets to Create a Voice Dialog Design Environment,\" Symposium on Applied Computing (SAC \"92), Kansas City, MO., 1992, pp. 1199-1207.  ",
      "doi": "10.1145/130069.130149"
    },
    {
      "text": "H. Rittel and M. Webber, \"Planning Problems are Wicked Problems,\" in Developments in Design Methodology, N. Cross, Ed., John Wiley &amp; Sons, New York, 1984, pp. 135-144.",
      "doi": ""
    },
    {
      "text": "D. A. Schoen, The Reflective Practitioner: How Professionals Think in Action, Basic Books, New York, 1983.",
      "doi": ""
    },
    {
      "text": "B. Silverman, \"Survey of Expert Critiquing Systems: Practical and Theoretical Frontiers,\" CACM, Vol. 35, pp. 106-127, 1992.  ",
      "doi": "10.1145/129852.129861"
    },
    {
      "text": "G. Stahl, \"Toward a Theory of Hermeneutic Software Design,\" Technical Report CU-CS-589-92, Computer Science Department, University of Colorado at Boulder, 1992.",
      "doi": ""
    },
    {
      "text": "G. Stahl, \"Supporting Interpretation in Design,\" Accepted to Journal of Architecture and Planning Research, Special Issue on Computational Representations of Knowledge, Forthcoming in Summer 1993.",
      "doi": ""
    },
    {
      "text": "L. Suchman, Plans and Situated Actions: The Problem of Human-Machine Communication, Cambridge University press, Cambridge, 1987. ",
      "doi": "10.5555/38407"
    },
    {
      "text": "T. Winograd and F. Flores, Understanding Computers and Cognition: A New Foundation for Design, Addison-Wesley, Menlo Park, CA, 1986. ",
      "doi": "10.5555/576359"
    }
  ]
}