{
  "doi": "10.1145/169059.169274",
  "title": "How fluent is your interface?: designing for international users",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "342-347",
  "year": 1993,
  "badges": [],
  "abstract": "To successfully build bridges between worlds, user interface designers must increase their awareness of cross-cultural differences, and make changes to the traditional software development process. Creating fluent interfaces for international markets goes beyond translating text and date, time, and number formats. This paper presents and explains a cross-cultural checklist of issues including text, local formats, images, symbols, colors, flow, and product functionality. Suggestions for an effective international product development cycle are provided. The suggested development cycle incorporates international design feedback and usability testing before the initial product is released.",
  "authors": [
    {
      "name": "Patricia Russo",
      "institution": "Human Interface Engineering, SunSoft Two Elizabeth Drive, Chelmsford, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100638764",
      "orcid": "missing"
    },
    {
      "name": "Stephen Boor",
      "institution": "Analytical Services, The Boston Company, One Cabot Road, Medford, MA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100609924",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cook, B.L. Picture communication in Papua New Guinea. Educational Broadcasting International. 13(2), 1980.",
      "doi": ""
    },
    {
      "text": "Copeland, L. and Griggs, L. Going International. How to Make Friends and Deal Effectively in the Global Marketplace. Plume, New York, 1985.",
      "doi": ""
    },
    {
      "text": "Courtney, A.j. Chinese Population Stereotypes: Color Association. Human Factors, 28(1), 1986.",
      "doi": ""
    },
    {
      "text": "del Galdo0 E. internationalization and Translation: Some Guidelines for the Design of Human-Computer Interfaces. In Jakob Nielsen (F_zl.) Designing User Interfaces for International Use. Elsevier, New York, 1990. ",
      "doi": "10.5555/130347.132705"
    },
    {
      "text": "Fussell, D. and I-Iaaland, A. Communication with pictures in Nepal: results of practical study used in visual education. Educational Broadcasting International. 11(1), 1978.",
      "doi": ""
    },
    {
      "text": "Garland, K. The use of short term feedback in the preparation of technical and instructional illustration, in, Research in Illustration: Conference Proceedings Part II. 1982.",
      "doi": ""
    },
    {
      "text": "Goldsmith E. Research into Illustration: an approach and a review. Cambridge University Press, New York, 1984.",
      "doi": ""
    },
    {
      "text": "Hapgood, E A Journey East - The Making of 1-2-3 Release 2J. Lotus: Computing for Managers and Professionals. 1987.",
      "doi": ""
    },
    {
      "text": "Nielsen, j. Designing for International Use. CHI'90 Human Factors in Computing Systems (Seattle, April 1- 5), ACM Press, pp. 291-294) CHI 1990 Proceedings.  ",
      "doi": "10.1145/97243.97298"
    },
    {
      "text": "Nielsen, J. (Ed.) Designing User Interfaces for International Use. Elsevier, New York, 1990. ",
      "doi": "10.5555/130347"
    },
    {
      "text": "Nielsen, J. Usability Testing of International Interfaces. In Jakob Nielsen (Ed.) Designing User Interfaces for International Use. Elsevier, New York, 1990. ",
      "doi": "10.5555/130347.132707"
    },
    {
      "text": "Sukaviriya, P. and Moran, L. User Interfaces for Asia, In Jakob Nielsen (F_A.) Designing User Interfaces for International Use. Elsevier, New York, 1990. ",
      "doi": "10.5555/130347.132714"
    },
    {
      "text": "Sun Microsystems, Software Internationalization Guide. Internal Document, Mountain View, CA, April 1991.",
      "doi": ""
    },
    {
      "text": "Taylor, D. Global Software. Springer-Verlag, New York, 1992.",
      "doi": ""
    },
    {
      "text": "ThoreU, L.G. and Smith, W.J. Using Computer Color Effectively: An Illustrated Reference. Prentice Hall, New Jersey, 1990. ",
      "doi": "10.5555/77787"
    },
    {
      "text": "1991 Annual Reports, Apple Computer, Digital Equipment Corporation, Hewlett-Packard, IBM, Microsoft Corporation and Sun Microsystems.",
      "doi": ""
    }
  ]
}