{
  "doi": "10.1145/169059.169066",
  "title": "Fish tank virtual reality",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "37-42",
  "year": 1993,
  "badges": [],
  "abstract": "The defining characteristics of what we call “Fish Tank Virtual Reality” are a stereo image of a three dimensional (3D) scene viewed on a monitor using a perspective projection coupled to the head position of the observer. We discuss some of the relative merits of this mode of viewing as compared to head mounted stereo displays. In addition, we report the experimental investigation of the following variables: 1) whether or not the perspective view is coupled to the actual viewpoint of the observer, 2) whether stereopsis is employed. Experiment 1 involved the subjective comparison of pairs of viewing conditions and the results suggest that head coupling may be more important than stereo in yielding a strong impression of three dimensionality. Experiment 2 involved subjects  tracing a path from a leaf of a 3D tree to the correct root (there were two trees intermeshed). The error rates ranged from 22% in the pictorial display, to 1.3% in the head coupled stereo display. The error rates for stereo alone and head coupling alone were 14.7% and 3.2% respectively. We conclude that head coupling is probably more important than stereo in 3D visualization and that head coupling and stereo combined provide an important enhancement to monitor based computer graphics.",
  "authors": [
    {
      "name": "Colin Ware",
      "institution": "Faculty of Computer Science, P.O Box 4400, University of New Brunswick, Canada E3B 5A3",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100446762",
      "orcid": "missing"
    },
    {
      "name": "Kevin Arthur",
      "institution": "Department of Computer Science, 6356 Agricultural Road, University of British Columbia, Vancouver, B.C., Canada V6T 1Z2",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100225341",
      "orcid": "missing"
    },
    {
      "name": "Kellogg S. Booth",
      "institution": "Department of Computer Science, 6356 Agricultural Road, University of British Columbia, Vancouver, B.C., Canada V6T 1Z2",
      "img": "/do/10.1145/contrib-81100170154/rel-imgonly/kelly2014.jpg",
      "acmid": "81100170154",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Deering, M. (1992) High Resolution Virtual Reality. Computer Graphics, 26, 2, 195-202.  ",
      "doi": "10.1145/142920.134039"
    },
    {
      "text": "Fairchild, K.M., Poltrock, E.E. and Furnas, G.W. (1988) SemNet: Three-Dimensional Graphic representations of large knowledge bases. In Cognitive Science and Its Applications for Human- Compbt~,, Interaction. Ed Raymond Guindon, Lawrence Erelbaum, 201-233.",
      "doi": ""
    },
    {
      "text": "Friedman, M., Stamer, T and Pentland, A., (1992) Device Synchronization using and optimal linear filter. 1992 Symposium on Interactive 3D graphics, Special Issue of Computer Graphics, 57- 62.  ",
      "doi": "10.1145/147156.147164"
    },
    {
      "text": "Gibson, J.J. (1979) The Ecological Approach to Visual Perception. Houghton Mifflin: Boston.",
      "doi": ""
    },
    {
      "text": "Howard, I.P. an Heckman, T. (1989) Circular vection as a function of the relative sizes, distances and positions of two competing visual displays. Perception, 18 (5) 657-665.",
      "doi": ""
    },
    {
      "text": "Liang, J., Shaw, C., and Green, M. (1991) On temporal realism in the virtual reality environment. UIST'91 19-25.  ",
      "doi": "10.1145/120782.120784"
    },
    {
      "text": "McKenna, M, (1992) Interactive viewpoint control and three-dimensional operations. 1992 Symposium on Interactive 3D graphics, Special Issue of Computer Graphics, 53-56.  ",
      "doi": "10.1145/147156.147163"
    },
    {
      "text": "Robertson, G.G. Mackinlay, J.D. and Card, S.K. (1991) Cone trees: Animated 3D visualizations of hierarchical information. Proc of CHI'91\" 189-194.  ",
      "doi": "10.1145/108844.108883"
    },
    {
      "text": "Shepard, R.N. and Metzler, J. (1971) Mental rotation of three-dimensional objects. Science, 171, 701-703.",
      "doi": ""
    },
    {
      "text": "Smith, K.U. (1962) Delayed sensory feedback and behavior, W.B. Saunders, Philadelphia.",
      "doi": ""
    },
    {
      "text": "Sollenberger, R.L., and Milgram, P. (1991) A comparative study of rotational and sterex~seopie computer graphics depth cues. PrOngs of the Human Factors Society 35th Annual Meeting, San Fancisco, 1452-1456.",
      "doi": ""
    },
    {
      "text": "Sutherland, I. (1968) A head-mounted three dimensional display. Fall Joint Computer Conference, AFIPS Conference Proceedings, 33, 757-764.",
      "doi": "10.1145/1476589.1476686"
    },
    {
      "text": "WaUach, H. and O'Connell, D.H, (1953) The depth effect. Journal of Experimental Psychology, 45, 205-217.",
      "doi": ""
    },
    {
      "text": "Wanger, L.R. Fewerda, J.A. and Greenberg, D.P. (1992) Perceiving spatial relationships in computer generated images. IEEE Computer Graphics and Applications, 12(3) 44-59.  ",
      "doi": "10.1109/38.135913"
    },
    {
      "text": "Ward, M., Azuma, R., Bennett, R., Gottschalk, S., and Fuchs, H. (1992) A demonstrated optical tracker with scalable work area for head mounted display systems. 1992 Symposium on interactive 3D Graphics, Special Issue of Computer Graphics, 43-52.  ",
      "doi": "10.1145/147156.147162"
    }
  ]
}