{
  "doi": "10.1145/169059.169305",
  "title": "Beyond interface builders: model-based interface tools",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "383-390",
  "year": 1993,
  "badges": [],
  "abstract": "",
  "tags": [
    "UIMS",
    "model-based interface tools",
    "interface builders",
    "design process"
  ],
  "authors": [
    {
      "name": "Pedro Szekely",
      "institution": "USC/Information Sciences Institute, 4676 Admiralty Way, Marina del Rey, CA",
      "img": "/do/10.1145/contrib-81100625746/rel-imgonly/szekely-photo-isi.jpg",
      "acmid": "81100625746",
      "orcid": "missing"
    },
    {
      "name": "Ping Luo",
      "institution": "USC/Information Sciences Institute, 4676 Admiralty Way, Marina del Rey, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659403975",
      "orcid": "missing"
    },
    {
      "name": "Robert Neches",
      "institution": "USC/Information Sciences Institute, 4676 Admiralty Way, Marina del Rey, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81327490788",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "R. Braudes, A Framework for Conceptual Consistency Verification, D.Sc. Dissertation, Dept. of EE&amp;CS, The George Washington University, Washington, DC 20052, 1990. ",
      "doi": "10.5555/99722"
    },
    {
      "text": "J. Foley, W. Kim, S. Kovacevic and K. Murray, UIDE - An Intelligent User Interface Design Environment, in J. Sullivan and S. Tyler (eds.) Architectures for Intelligent User Interfaces: Elements and Prototypes, Addison-Wesley, Reading MA, 1991, pp. 339-384.  ",
      "doi": "10.1145/107215.128716"
    },
    {
      "text": "B. Johnson, TreeViz- Treemap Visualization of Hierarchically Structured Information. In Proceedings CHI'92. May, 1992, pp. 369-370.  ",
      "doi": "10.1145/142750.142833"
    },
    {
      "text": "W. Kim and J. Foley, DON: User Interface Presentation Design Assistant, In Proceedings UIST'90. October, 1990, pp. 10-20.  ",
      "doi": "10.1145/97924.97926"
    },
    {
      "text": "B.A. Myers, B. Vander Zanden and R. B. Dannenberg. Creating Graphical interactive Application Objects by Demonstration. In Proceedings UIST'89. November 1989, pp.95-104.  ",
      "doi": "10.1145/73660.73672"
    },
    {
      "text": "B. A. Myers. A New Model for Handling Input. ACM Transactions on Informations Systems, 8(2). July 1990, pp. 289-320.  ",
      "doi": "10.1145/98188.98204"
    },
    {
      "text": "B.A. Myers. Graphical Techniques In A Spreadsheet For Specifying User Interfaces. In Proceedings CHI'91. April, 1991, pp. 243-256.  ",
      "doi": "10.1145/108844.108903"
    },
    {
      "text": "B.A. Myers, et. al. The Garnet Reference Manuals. Technical Report CMU-CS-90-117-R2, School of Computer Science, Carnegie Mellon University, Pittsburgh, PA 14212. May 1992.",
      "doi": ""
    },
    {
      "text": "Neuron Data, Inc. 1991. Open interface Toolkit. 146 University Ave. Palo Alto, CA 94301.",
      "doi": ""
    },
    {
      "text": "G. Singh, C. H. Kok and T. Y. Ngan. Druid: A System for Demonstrational Rapid User Interface Development. In ProceeAings UIST'90. October 1990, pp. 157-177.  ",
      "doi": "10.1145/97924.97943"
    },
    {
      "text": "P. Sukaviriya and J. Foley, Coupling a 131 Framework with Automatic Generation of Context-Sensitive Animated Help. In Proceedings of UIST '90. October 1990, pp. 142-146.  ",
      "doi": "10.1145/97924.97942"
    },
    {
      "text": "P. Szekely, P. Luo, and R. Neches. Facilitating the Exploration of Interface Design Alternatives: The HUMANOID Model of Interface Design. In Proceedings CHr92. May, 1992, pp. 507-514.  ",
      "doi": "10.1145/142750.142912"
    },
    {
      "text": "M. Vlissides and M. A. Linton. Unidraw: A Framework For Building Domain-Specific Graphical Editors. ACM Transactions on Information Systems 8(3), July 1990. pp. 237-268.  ",
      "doi": "10.1145/98188.98197"
    },
    {
      "text": "C. Wiecha, W. Bennett, S. Boies, J. Gould and S. Greene. ITS: A Tool For Rapidly Developing Interactive Applications. ACM Transactions on Information Systems 8(3), July 1990. pp. 204-236.  ",
      "doi": "10.1145/98188.98194"
    },
    {
      "text": "M. D. Williams. What Makes RABBIT Run? Int. J. Man-Machine Studies, 21, 1984, pp. 333-352.  ",
      "doi": "10.1016/S0020-7373%2884%2980052-8"
    }
  ]
}