{
  "doi": "10.1145/169059.169067",
  "title": "HCI in the school of computer science at Carnegie Mellon University",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "49-50",
  "year": 1993,
  "badges": [],
  "abstract": "People use computers to accomplish tasks. Consequently, understanding human capabilities and tasks is as important to the design of computer systems as understanding computer technologies. The School of Computer Science (SCS) at Carnegie Mellon University (CMU) has become home to an interdisciplinary community that performs research on HCI issues, develops systems using HCI methods of design and evaluation, and trains students in the theory and skills necessary to become HCI professionals.",
  "authors": [
    {
      "name": "Bonnie E. John",
      "institution": "Computer Science and Psychology, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100482886",
      "orcid": "missing"
    },
    {
      "name": "James H. Morris",
      "institution": "Head, Computer Science Department, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332516966",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "ACM SIGCHI Curricula for Human.Computer Interaction, ACM, New York, 1992.",
      "doi": ""
    },
    {
      "text": "Card, S. K., Moran, T. P., &amp; Newell, A. The Psychology of Human-Computer Interaction, Lawrence Erlbaum Associates, Hillsdale, N.J., 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Palay, A. J., Hansen, W. J., Sherman, M., Wadlow, M. G., Neuendorffer, T. P., Stem, Z., Bader, M., &amp; Peters, T. \"I'he Andrew Toolkit - An Overview.\" In proceedings of the USENIX Winter Conference (Dallas, TX, February 9-12) USENIX Assoc., Berkely, CA, 1988. pp. 9-21.",
      "doi": ""
    },
    {
      "text": "Robertson, G., McCracken, D., &amp; Newell, A. \"The ZOG approach to man-machine communication\" International Journal of Man-Machine Studies, 14, 1980, pp. 461-488.",
      "doi": ""
    }
  ]
}