{
  "doi": "10.1145/169059.169299",
  "title": "A second generation user interface design environment: the model and the runtime architecture",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "375-382",
  "year": 1993,
  "badges": [],
  "abstract": "Several obstacles exist in the user interface design process which distract a developer from designing a good user interface. One of the problems is the lack of an application model to keep the designer in perspective with the application. The other problem is having to deal with massive user interface programming to achieve a desired interface and to provide users with correct help information on the interface. In this paper, we discuss an application model which captures information about the application to specifications of a desired interface. The application model is then used to control the dialogues at runtime and can be used by a help component to automatically generate animated and textual help. Specification changes in the application model will automatically result in behavioral changes in the interface.",
  "tags": [
    "application model",
    "automatic help generation",
    "user interface design environment",
    "user interface generation",
    "user interface model"
  ],
  "authors": [
    {
      "name": "Piyawadee Sukaviriya",
      "institution": "Graphics, Visualization and Usability Center, Georgia Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100025749",
      "orcid": "missing"
    },
    {
      "name": "James D. Foley",
      "institution": "Graphics, Visualization and Usability Center, Georgia Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100302796",
      "orcid": "missing"
    },
    {
      "name": "Todd Griffith",
      "institution": "Graphics, Visualization and Usability Center, Georgia Institute of Technology",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332502072",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cardelli, L. Building User Interfaces by Direct Manipulation. In Proceedings of the ACM SIGGRAPH Symposium on User Interface Software and Technology. Banff, Alberta, Canada. October, 1988, 152-166.  ",
      "doi": "10.1145/62402.62428"
    },
    {
      "text": "Cossey, G. Pro to typer. SmetherBarnes, Portland, Oregon, 1989.",
      "doi": ""
    },
    {
      "text": "de Baar, D.; J.D. Foley; and K.E. Mullet. Coupling Application Design and User Interface Design. In Proceedings of Human Factors in Computing Systems, CHI'92. May 1992, 259-266.  ",
      "doi": "10.1145/142750.142806"
    },
    {
      "text": "Foley, J.D.; C. Gibbs; W.C. Kim; and S. Kovacevic. A Knowledge-based User interface Management System. In Proceedings of Human Factors in Computing Systems, CHI'88. May 1988, 67-72.  ",
      "doi": "10.1145/57167.57178"
    },
    {
      "text": "Foley, J.D.; W.C. Kim; S. Kovacevic; and K. Murray. UIDE-An Intelligent User Interface Design Environment. In Architectures for Intelligent Interfaces: Elements and Prototypes. Eds. J. Sullivan and S. Tyler, Reading, MA: Addison-Wesley, 1991.  ",
      "doi": "10.1145/107215.128716"
    },
    {
      "text": "Gieskens, D. and J.D. Foley. Controlling User Interface Objects Through Pre- and Post-conditions. In Proceedings of Human Factors in Computing Systems, CH1'92. May 1992, 189-194.  ",
      "doi": "10.1145/142750.142787"
    },
    {
      "text": "Hayes, P.J.; P. A. Szekeley; and R.A. Lerner. Design Alternatives for User Interface Management Systems Based on Experience with COUSIN. In Proceedings of Human Factors in Computing Systems, CHI'85. April 1985, 169-175.  ",
      "doi": "10.1145/317456.317488"
    },
    {
      "text": "Inference Corporation. ART Reference Manual. Inference Corporation, Los Angeles, CA, 1987.",
      "doi": ""
    },
    {
      "text": "Kim, W.C., and J.D. Foley. DON: User Interface Presentation Design Assistant. In Proceedings of the ACM SIGGRAPH Sympostum on User Interface Software and Technology. October 1990,. 10-20.  ",
      "doi": "10.1145/97924.97926"
    },
    {
      "text": "Kovacevic, S. A Compositional Model of Human- Computer Dialogues. In Multimedia Interface Design. Eds. M.M. Blattner and R.B. Dannenberg, New York, New York: ACM Press, 1992.  ",
      "doi": "10.1145/146022.146102"
    },
    {
      "text": "Linton, M.; J.M. Vlissides; and P.R. Calder. Composing User Interfaces with InterViews. IEEE Computer 22(2): 8-22, February, 1990.  ",
      "doi": "10.1109/2.19829"
    },
    {
      "text": "Myers, B. Creating Interaction Techniques by Demonstrations. IEEE Transactions on Computer Graphics and Applications 7 (September 1987):51-60.",
      "doi": "10.1109/MCG.1987.277079"
    },
    {
      "text": "Myers, B.; D.A. Giuse; R.B. Dannenberg; B.V. Zanden; D.S. Kosbie; E. Pervin; A. Mickish; and P. Marchal. Garnet: Comprehensive Support for Graphical, Highly-Interactive User Interfaces. 1EEE Computer 23(11): 71-85, November, 1990.  ",
      "doi": "10.1109/2.60882"
    },
    {
      "text": "Neches, R.; J.D. Foley; P. Szekeley; P. Sukaviriya; P. Luo; S. Kovacevic; and S. Hudson. Knowledgeable Development Environments Using Shared Design Models. To appear in Proceedings of lntelligent Interfaces Workshop, Orlando, Florida, January 4-7, 1993.  ",
      "doi": "10.1145/169891.169901"
    },
    {
      "text": "Nilsson, N.J. Principles of Artificial Intelligence. Los Angeles, CA: Morgan Kaufmann Publishers, Inc, 1980. ",
      "doi": "10.5555/30425"
    },
    {
      "text": "Olsen, D. MIKE: The Menu Interaction Kontrol Environment. ACM Transactions on Graphics 5,4 (1986): 318-344.  ",
      "doi": "10.1145/27623.28868"
    },
    {
      "text": "Olsen, D. A Programming Language Basis for User Interface Management. In Proceedings of Human Factors in Computing Systems, CHI'89. May 1989, 171-176.  ",
      "doi": "10.1145/67449.67485"
    },
    {
      "text": "Open Software Foundation. OSF/Motif Style Guide. Revision 1.0. Englewood Cliffs, New Jersey: Prentice Hall, Inc., 1990. ",
      "doi": "10.5555/101385"
    },
    {
      "text": "Singh, G. and Green, M. A High-Level User Interface Management System. In Proceedings of Human Factors in Computing Systems, CH1'89. May 1989, 133-138.  ",
      "doi": "10.1145/67449.67476"
    },
    {
      "text": "Sukaviriya, P., and J.D. Foley. Coupling a UI Framework with Automatic Generation of Context- Sensitive Animated Help. In Proceedings of the ACM S1GGRAPH Symposium on User Interface Software and Technology. October 1990,. 152-166.  ",
      "doi": "10.1145/97924.97942"
    },
    {
      "text": "Sukaviriya, P. Automatic Generation of Contextsensitive Animated Help. A Ds.C. Dissertation, George Washington University, 1991. ",
      "doi": "10.5555/145927"
    },
    {
      "text": "Sukaviriya, P. and de Graaff, J. Automatic Generation of Context-sensitive \"Show &amp; Tell\" Help. Technical Report GIT-GVU-92-18. Atlanta, Georgia: Graphics, Visualization, and Usability Center, Georgia Institute of Technology, 1992.",
      "doi": ""
    },
    {
      "text": "Sukaviriya, P. and J.D. Foley. Supporting Adaptive Interfaces in a Knowledge-Based User Interface Environments. To appear in Proceedings of Intelligent Interfaces Workshop, Orlando, Florida, January 4-7, 1993.  ",
      "doi": "10.1145/169891.169922"
    },
    {
      "text": "SunSoft. OpenWindowsTM Developer's Guide 3.0 User's Guide. Sun Microsystems, Inc. Part No:800- 6585-10, Revision A, November 1991.",
      "doi": ""
    },
    {
      "text": "SunSoft. OLIT 3.0.1 Reference Manual. Sun Microsystems, Inc. Part-No: 800-6391-10, Revision A, june 1992.",
      "doi": ""
    },
    {
      "text": "Szekeley, P.; P. Luo; and R. Neches. Facilitating the Exploration of Interface Design Alternatives: the HUMANOID Model of Interface Design. In Proceedings of Human Factors in Computing Systems, CHI'92. May 1992, 507-515.  ",
      "doi": "10.1145/142750.142912"
    }
  ]
}