{
  "doi": "10.1145/169059.169243",
  "title": "Exploring the applications of user-expertise assessment for intelligent interfaces",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "308-313",
  "year": 1993,
  "badges": [],
  "abstract": "An adaptive user interface relies, to a large extent, upon an adequate user model (e.g., a representation of user-expertise). However, building a user model may be a tedious and time consuming task that will render such an interface unattractive to developers. We thus need an effective means of inferring the user model at low cost. In this paper, we describe a technique for automatically inferring a fine-grain model of a user's knowledge state based on a small number of observations. With this approach, the domain of knowledge to be evaluated is represented as a network of nodes (knowledge units—KU) and links (implications) induced from empirical user profiles. The user knowledge state is specified as a set of weights attached to the knowledge units that indicate the likelihood  of mastery. These weights are updated every time a knowledge unit is reassigned a new weight (e.g., by a question-and-answer process). The updating scheme is based on the Dempster-Shafer algorithm. A User Knowledge Assessment Tool (UKAT) that employs this technique has been implemented. By way of simulations we explore an entropy-based method of choosing questions, and compare the results with a random sampling method. The experimental results show that the proposed knowledge assessment and questioning methods are useful and efficient in inferring detailed models of user-expertise, but the entropy-based method can induce a bias in some circumstances.",
  "tags": [
    "evidence aggregation",
    "knowledge spaces",
    "entropy",
    "intelligent interfaces",
    "user-expertise assessment",
    "probabilistic reasoning",
    "adaptive training systems"
  ],
  "authors": [
    {
      "name": "Michel C. Desmarais",
      "institution": "Centre de recherche informatique de Montréal 1801 ave. McGill College, bureau 800, Montréal, Québec, Canada H3A 2N4",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81341489652",
      "orcid": "missing"
    },
    {
      "name": "Jiming Liu",
      "institution": "Centre de recherche informatique de Montréal 1801 ave. McGill College, bureau 800, Montréal, Québec, Canada H3A 2N4",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81408596722",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "F. de Rosis, S. Pizzutilo, A. Russo, D. C. Berry, and E J. Nicolau Molina. Modeling the user knowledge by belief networks. User Modeling and User-Adapted Interaction, 2(4), 1992.",
      "doi": ""
    },
    {
      "text": "Michel C. Desmarais. Architecture etfondements empiriques d'un systdme d'aide assist~e par ordinateur pour r ~dition de texte. PhD thesis, Universit6 de Mont6al, D6partement de psychologie, 1990.",
      "doi": ""
    },
    {
      "text": "Michel C. Desmarais, Luc Giroux, and Serge Larochelle. Fondements m6thodologiques et empiriques d'un syst~me consultant actif pour l'6dition de texte ~ le projet EdCoach. Technologies de l' information et societY, 4(1):61-74,1992.",
      "doi": ""
    },
    {
      "text": "Michel C. Desmarais, Luc Giroux, Serge Larochelle, and Serge Leclerc. Assessing the structure of knowledge in a procedural domain. In Proceedings of the Cognitive Science Society, pages 475-481, 14-17 August, Montr6al 1988.",
      "doi": ""
    },
    {
      "text": "Michel C. Desmarais and Jimming Liu. Experimental results on user knowledge assessment with an evidential reasoning methodology. In International Workshop on intelligent user Interfaces, 1993. To appear.  ",
      "doi": "10.1145/169891.169994"
    },
    {
      "text": "Jean-Claude Falmagne and Jean-Paul Doignon. A class of stochastic procedures for the assessment of knowledge. British Journal of Mathematical and Statistical Psychology, 41\" 1-23, 1988.",
      "doi": ""
    },
    {
      "text": "Jean-Claude Falmagne, Jean-Paul Doignon, Mathieu Koppen, Michael Villano, and Leila Johannesen. Introduction to knowledge spaces: how to build, test and search them. Psychological Review, 97(2):201-224, 1990.",
      "doi": ""
    },
    {
      "text": "I.P. Goldstein. The genetic graph: a representation for the evolution of procedural knowledge. In Sleeman and Brown {15}, pages 51-77.",
      "doi": ""
    },
    {
      "text": "J. Gordon and E. H. Shortliffe. The dempster-shafer theory of evidence. In B. G. Buchanan and E. H. Shortliffe, editors, Rule-Based Expert Systems. Addison-Wesley, Reading, M. A., 1984.",
      "doi": ""
    },
    {
      "text": "A. Kobsa. Modeling the user's conceptual knowledge in BGP-MS, a user modeling shell system. International Journal of Man-Machine Studies, 6:193-208, 1990.  ",
      "doi": "10.1111/j.1467-8640.1990.tb00295.x"
    },
    {
      "text": "Jiming Liu and Michel C. Desmarais. Knowledge assessment based on the dempster-shafer belief propagation theory. Technical Report CRIM-92/09--06, Centre de recherche informatique de Montr6al, 1992.",
      "doi": ""
    },
    {
      "text": "J. Sell Student models: what use are they? In P. Ercoli and R. Lewis, editors, Artificial intelligence tools in education. North-Holland, Amsterdam, 1988.",
      "doi": ""
    },
    {
      "text": "G. Sharer. A Mathematical Theory of Evidence. Princeton University Press, Princeton, N. J., 1976.",
      "doi": ""
    },
    {
      "text": "D. Sleeman. UMFE, a user modeling front end subsystem. International Journal of Man-Machine Studies, 23:71-88,1985.  ",
      "doi": "10.1016/S0020-7373%2885%2980025-0"
    },
    {
      "text": "D. Sleeman andJ.S. Brown, editors.lntelligent Tutoring Systems. Academic Press, London, 1982.",
      "doi": ""
    }
  ]
}