{
  "doi": "10.1145/169059.169197",
  "title": "The MultiG research programme: distributed multimedia applications on Gigabit networks",
  "published": "1993-05-01",
  "proctitle": "CHI '93: Proceedings of the INTERACT '93 and CHI '93 Conference on Human Factors in Computing Systems",
  "pages": "246-247",
  "year": 1993,
  "badges": [],
  "abstract": "No abstract available.",
  "authors": [
    {
      "name": "Björn Pehrson",
      "institution": "Distributed Systems Laboratory, Swedish Institute for Computer Science, S-164 28, STOCKHOLM-KISTA, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100368175",
      "orcid": "missing"
    },
    {
      "name": "Yngve Sundblad",
      "institution": "Interaction and Presentation Laboratory, Numerical Analysis and Computing Science, KTH (Royal Institute of Technology), S-100 44 STOCKHOLM, Sweden",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100040488",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Jan Bogdanski: A Color Helmet Mounted Display, in Proceedings 4th MultiG Workshop, Stockholm, May 1992]]",
      "doi": ""
    },
    {
      "text": "Bj6rn Eiderb~ck, Per H~gglund, Yngve Sundblad: A Distributed Multimedia Interface Builder: User Interface, Constraints, Events and Applications, in Proceedings 2rid MultiG Workshop, Stockholm, June 1991]]",
      "doi": ""
    },
    {
      "text": "Lennart E. Fahl6n, Olov St~hl, Christer Carlsson, Carl Brown: A Space Based Model for User Interaction in Shared Synthetic Environments, in These Proceedings]]",
      "doi": ""
    },
    {
      "text": "Gerald Q. Maguire, BjOrn Pehrson, Jens Zander, W alkstation- The Swedish Electronic Notebook/Walkstation Extension Program, in Proceedings 4th MultiG Workshop, Stockholm, May 1992]]",
      "doi": ""
    },
    {
      "text": "Hans Marmolin, Yngve Sundblad and BjOrn Pehrson: An Analysis of Design and Collaboration in a Distributed Environment, in Proceedings ECSCW'91, Amsterdam, Sept 1991]] ",
      "doi": "10.5555/1241910.1241921"
    },
    {
      "text": "Hans Marmolin: TheKnowledgeNet - An Environment for Distributed Design, in Proc.eedings 2nd MultiG Workshop, Stockhohn, June 1991]]",
      "doi": ""
    },
    {
      "text": "Proceedings from MultiG Workshops 1-5, Stockholm,Nov 1990, June 1991, Dec 1991, May 1992 and Dec 1992]]",
      "doi": ""
    },
    {
      "text": "BjOrn Pehrson, Per Gunningberg, Stephen Pink: Distributed \"M ul ti m edi a Applications on G i gab it Networks,lEEE Network, VoI.6 No. 1, Jan 1992]]",
      "doi": ""
    },
    {
      "text": "Stephen Travis Pope, Lennart Fahl6n: An Aural Perspective Engine tot a Distributed Interactive Virtual Environment, SICS Research Report, Sept 1992]]",
      "doi": ""
    }
  ]
}