{
  "doi": "10.1145/108844.108855",
  "title": "New graphical reasoning models for understanding graphical interfaces",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "71-78",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "George W. Furnas",
      "institution": "Cognitive Science Research, Bellcore, 445 South Street, Morristown, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100649937",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Lindsay, Robert K., \"Images and inference\" Cognition, 29, 1988, 229-250.",
      "doi": ""
    },
    {
      "text": "Whiteside, J., Jones, S., Levy, P. S., and Wixon, D., User performance with command, menu, and iconic interfaces, Human Factors in Computer Systems, Proceedings of CHI' 85, 1985, 185-191.  ",
      "doi": "10.1145/317456.317490"
    },
    {
      "text": "Nielsen, J., Traditional dialogue design applied to modem user interfaces, Communications of the ACM, 33(10), 1990, 109-118.  ",
      "doi": "10.1145/84537.84559"
    },
    {
      "text": "Karat, John Evaluating user interface complexity. Proceedings of the Human Factors Society - 31st Annual Meeting, 1987, 566-570.",
      "doi": ""
    },
    {
      "text": "Guastello, S. J., Traut, M., and Korienek, G., Verbal versus pictorial representation of objects in a humancomputer interface, international Journal of Man- Machine Studies, 31, 1989, 99-120.  ",
      "doi": "10.1016/0020-7373%2889%2990034-5"
    },
    {
      "text": "Card, S. K., Moran, T. P., and Newell, A., The psychology of human computer interaction. Hillsdale, NJ:Erlbaum, 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "Kieras, D. E. and Polson, P. G., An approach to the formal analysis of user complexity, International Journal of Man-Machine Studies, 22, 1985, 365-394.",
      "doi": ""
    },
    {
      "text": "Tennant, N., The withering away of formal semantics, Mind and Language, 1, 1986, 302-318.",
      "doi": ""
    },
    {
      "text": "Barwise, J. and Etchemendy, J., Visual information and valid reasoning, in Visualization in Teaching and Learning Mathematics, S. Cunningham and W. Zimmerman (Eds.), Washington: Mathematical Association of America, in press, 1990. ",
      "doi": "10.5555/115665.115667"
    },
    {
      "text": "Barwise, J. and Etchemendy, J., Information, infons, and inference, in Situation Theory and its Applications, I, R. Cooper, K. Mukai, and J. Perry (Eds.) Chicago:University of Chicago Press, 1990.",
      "doi": ""
    },
    {
      "text": "Gardin, F. and Meltzer, B., Analogical representations of naive physics, Artificial Intelligence, 38, 1989, 139-159.  ",
      "doi": "10.1016/0004-3702%2889%2990055-6"
    },
    {
      "text": "Furnas, G. W., Formal models for imaginal deduction, Proceedings of the Twelfth Annual Conference of the Cognitive Science Society, (July 25-28, 1990, Cambridge, Mass.) Hillsdale, NJ: Lawrence Erlbaum, 662-669.",
      "doi": ""
    },
    {
      "text": "Furnas, G. W., Working paper on theory, methods and examples of imaginal deduction, Bellcore Technical Memorandum, 1991.",
      "doi": ""
    },
    {
      "text": "Siromoney, G., Siromoney, R. and Krithivasan, K., Picture languages with array rewriting rules, Information and Control, 22, 1973, 447-470.",
      "doi": ""
    },
    {
      "text": "Rosenfeld, A., Array and web grammars: an overview. In A. Lindenmayer and G. Rozenberg (Eds.), Automata, Languages, Development, North-Holland, 1976, 517-529.",
      "doi": ""
    },
    {
      "text": "Post, E. L., Formal reductions of the general combinatorial decision problem, American Journal of Mathematics, 65, 1943,197-268.",
      "doi": ""
    },
    {
      "text": "Newell, A., and Simon, H., Human Problem Solving, Englewood Cliffs, NJ: Prentice-Hall, 1972. ",
      "doi": "10.5555/1095704"
    },
    {
      "text": "Waterman, D. A. and Hayes-Roth, F., Pattern- Directed inference Systems, NewYork: Academic Press, 1978. ",
      "doi": "10.5555/578630"
    },
    {
      "text": "Furnas, G. W., \"Graphical Reasoning for Graphical Interfaces\" SIGGRAPH VIDEO #56. Shown in the Formal Video track of CHI'90, Seattle Washington, April 1990. Also shown in the INTERACT'90 video program, Cambridge England, August 1990.",
      "doi": ""
    },
    {
      "text": "Schneiderman, B., The future of interactive systems and the emergence of direct manipulation. Behavior and Information Technology, 1, 1982, 237-256.",
      "doi": ""
    },
    {
      "text": "Hutchins, E., Hollan, J., and Norman, D. A., Direct manipulation interfaces, in D.A. Norman and S. Draper (Eds.), User Centered System Design: New Perspectives on Human-Computer Interaction, Hillsdale, NJ: Lawrence Erlbaum Associates, 1986.",
      "doi": ""
    }
  ]
}