{
  "doi": "10.1145/108844.108850",
  "title": "EAGER: programming repetitive tasks by example",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "33-39",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Allen Cypher",
      "institution": "Advanced Technology Group, Apple Computer, Inc., Cupertino, CA",
      "img": "/do/10.1145/contrib-81100562008/rel-imgonly/acypher.jpg",
      "acmid": "81100562008",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Cypher, A. Detecting Repetitive Actions in a Direct Manipulation Environment. To be submitted to 1991 IEEE Workshop on Visual Languages. Kobe, Japan, October, 1991.",
      "doi": ""
    },
    {
      "text": "Gould, L. and Finzer, W. Programming by Rehearsal. Xerox Palo Alto Research Center Technical Report SCL-84-1, May, 1984.",
      "doi": ""
    },
    {
      "text": "Halbert, D. Programming by Example. Xerox Office Systems Division Technical Report OSD-T8402, De~ember, 1984.",
      "doi": ""
    },
    {
      "text": "Lemer, B. Automated Customization of User Interfaces Carnegie Mellon University School of Computer Science Technical Report CMU-CS-89-178, September, 1989.",
      "doi": ""
    },
    {
      "text": "Lieberman, H. An Example Based Environment for Beginning Programmers. in Artificial Intelligence and Education. Ablex, Norwood, N.J., 1987, pp 135-151. ",
      "doi": "10.5555/55463.55470"
    },
    {
      "text": "Maulsby, D. and Witten, I. Inducing Programs in a Direct-Manipulation Environment. In Proceedings of CHI \"89 (Austin, Apr. 30 - May 4). ACM, New York, 1989, pp 57-62.  ",
      "doi": "10.1145/67449.67463"
    },
    {
      "text": "Myers, B. Creating User Interfaces by Demonstration. Academic Press, San Diego, Calif., 1988. ",
      "doi": "10.5555/43392"
    },
    {
      "text": "Smith, D. Pygmalion: A Computer Program to Model and Stimulate Creative Thought. Birkh~iuser, Basel, 1977.",
      "doi": ""
    }
  ]
}