{
  "doi": "10.1145/108844.108848",
  "title": "Expressive richness: a comparison of speech and text as media for revision",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "21-26",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "tags": [],
  "authors": [
    {
      "name": "Barbara L. Chalfonte",
      "institution": "Bellcore, Morristown, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100234627",
      "orcid": "missing"
    },
    {
      "name": "Robert S. Fish",
      "institution": "Bellcore, Morristown, NJ",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81332498460",
      "orcid": "missing"
    },
    {
      "name": "Robert E. Kraut",
      "institution": "Bellcore, Morristown, NJ",
      "img": "/do/10.1145/contrib-81328489038/rel-imgonly/bob2010-head-vest-edit.jpg",
      "acmid": "81328489038",
      "orcid": "0000-0002-8554-2137"
    }
  ],
  "references": [
    {
      "text": "Bridwell, L.S. Revising strategies in twelfth grade students' transactional writing. Research in the Teaching of English, 14 (1980), 197-222.",
      "doi": ""
    },
    {
      "text": "Butler, J.F. Remedial writers: The teacher's job as corrector of papers. College Compa:i~ion and Communication, 31 (1980), 270-277",
      "doi": ""
    },
    {
      "text": "Chapanis, A., Ochsman, R.B., Parrish, S 5q. ~ Weeks, G.D. Studies in inte~ctive communication\" I. The effects of four communication modes on the behavior of teams during cooperative problem solving. Human Factors, 14 (1972), 487-509.",
      "doi": ""
    },
    {
      "text": "Chapanis, A~, ~a'r~sh, R. N., Ochsman, R.B. ~ Weeks, ~ , Studies in interactive communication\" II. The effects ~',~ four communication mode~', ~:, ,'he l~aguistic performance of teams during cooperative problem solving. Human Factors, 19 (1977),, 101-126.",
      "doi": ""
    },
    {
      "text": "Crowley, S. Components of the composing process. College Composition and Communication, 28 (1977), 166-169.",
      "doi": ""
    },
    {
      "text": "Daft, R.L., Lengel, R.H., ~ Trevino, L. Message equivocality, media selection, and manager performance: implications for information systems. MIS Quarterly, 11 (1987), 355-366.  ",
      "doi": "10.2307/248682"
    },
    {
      "text": "Faigley, L. ~ Witte, S.P. Analyzing revision. College Composition and Communication, 32 (1981), 400-414.",
      "doi": ""
    },
    {
      "text": "Fish, R.S, Kraut, R.E., Leland, M.D.P., ~ Cohen, M. Quilt: A collaborative tool for cooperative writing. In R. B. Allen (Ed.) Proceedings of the Conference on Office Information Systems (Palo Alto, CA). ACM, New York, 1988, pp 30-37.  ",
      "doi": "10.1145/45410.45414"
    },
    {
      "text": "Farallon Computing Inc. MacRecorder Users Manual. Author, Emeryville, CA, 1981.",
      "doi": ""
    },
    {
      "text": "Flower, L. ~ Hayes, J.R. A cognitive process theory of writing. College Composition and Communication, 32 (1981), 365-387.",
      "doi": ""
    },
    {
      "text": "Frase, L.T. Creating intelligent environments for computer use in writing. Contemporary Educational Psychology, 12, (1987), 212-221.",
      "doi": ""
    },
    {
      "text": "Galegher, j. &amp; Kraut, R. (1990). Computermediated communication for intellectual teamwork: A field experiment in group writing. Proceeding, Conference on Computer Supported Cooperative Work. ACM, New York, 1990, pp 65-78.  ",
      "doi": "10.1145/99332.99343"
    },
    {
      "text": "Gould, J.D. An experimental study of writing, dictating, and speaking. In J. Requin (Ed)., Attention and Performance VII. Lawrence Earlbaum, Hillsdale, N.J., 1978.",
      "doi": ""
    },
    {
      "text": "Gould, J.D. ~ Boise, S.J. (1978). How authors think about their writing, dictating, and speaking. Human Factors, 20 (1978), 495-505.",
      "doi": ""
    },
    {
      "text": "Grudin, J Why CSCW applications fail. Proceedings, Conference on Computer Supported Cooperative Work. ACM, New York, 1988  ",
      "doi": "10.1145/62266.62273"
    },
    {
      "text": "Katz, R. ~ Tushman, M. Communication patterns, project performance, and task characteristics: An empirical evaluation in an R&amp;D setting. Organizational Behavior and Human Performance, 23 (1978), 139-162.",
      "doi": ""
    },
    {
      "text": "Kellogg, R.T. Computer ~.~s 'mat writers need. Behavior Research Methods, Instruments, and Computers, 17 (1985), 253-258.",
      "doi": ""
    },
    {
      "text": "Kiesler, S Siegel, J.~ Mc Guire, T. Social psychological aspects of computer-mediated communication. American Psychologist, 39 (1984), 1123-1134.",
      "doi": ""
    },
    {
      "text": "Krauss, R.M. ~ Fussell, S.R. Mutual knowledge and communicative effectiveness. In J. Galegher, R.E. Kraut ~ C. Egido (Eds.), Intellectual teamwork: The social and technological foundations of cooperative work. Lawrence Eflbaum, Hillsdale, NJ, 1990. ",
      "doi": "10.5555/117848.117853"
    },
    {
      "text": "Kraut, R.E., Fish, R.S., Root, R.W., ~ Chalfonte, B.L. Informal communication in organizations: Form, function, and technology. In S. Oskamp ~ S. Spacapan (Eds)., Human Reactions to Technology: The Claremont Symposium on Applied Social Psychology. Sage Publications, Beverly Hills, CA, 1990.",
      "doi": ""
    },
    {
      "text": "Kraut, R.E., Lewis, S.H., ~ Swezey, L. W. Listener responsiveness and the coordination of conversation. Journal of Personality and Social Psychology, 43 (1982), 718-731.",
      "doi": ""
    },
    {
      "text": "Kroll, B.M. Cognitive egocentrism and the problem of audience awareness in written discourse. Research in the Teaching of English, 12 (1978), 269-281.",
      "doi": ""
    },
    {
      "text": "Mead, G. H. Mind, Self and Society. University of Chicago Press, Chicago, 1934.",
      "doi": ""
    },
    {
      "text": "Neuwirth, C.M., Kaufer, D.S., Keim, G., ~ Gillespie, T. The Comments program: Computer support for response to writing. Technical Report CECE-TR-3. Pittsburgh, PA: Carnegie Mellon University Center for Educational Computing in English, 1988.",
      "doi": ""
    },
    {
      "text": "Olson, G. ~ Atkins, D. Supporting collaboration with advanced multimedia electronic mail. in J. Galegher, R.E. Kraut ~ C. Egido (Eels.), Intellectual teamwork: The social and technological foundations of cooperative work. Lawrence Erlbaum, Hillsdale, Nj, 1990. ",
      "doi": "10.5555/117848.117864"
    },
    {
      "text": "Schwartz, M. Two journeys through the writing process. College Composition and Communication, 34 (1983), 188-201.",
      "doi": ""
    },
    {
      "text": "Sommers, N. Revision strategies of student writers and experienced adult writers. College Composition and Communication, 31 (1980),, 378-388.",
      "doi": ""
    },
    {
      "text": "Tushman, M.L. Work characteristics and subunit communication structure\" A contingency analysis. Administrative Science Quarterly, 24 (1979), 82-97.",
      "doi": ""
    },
    {
      "text": "Williams, E. Experimental comparisons of faceto-face and mediated communication: A review. Psychological Bulletin, 84 (1977), 963-976.",
      "doi": ""
    }
  ]
}