{
  "doi": "10.1145/108844.108853",
  "title": "Intertwining query construction and relevance evaluation",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "55-62",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Gerhard Fischer",
      "institution": "Department of Computer Science and Institute of Cognitive Science, University of Colorado, Boulder, Colorado",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81409592298",
      "orcid": "missing"
    },
    {
      "name": "Scott Henninger",
      "institution": "Department of Computer Science and Institute of Cognitive Science, University of Colorado, Boulder, Colorado",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81328488338",
      "orcid": "missing"
    },
    {
      "name": "David Redmiles",
      "institution": "Department of Computer Science and Institute of Cognitive Science, University of Colorado, Boulder, Colorado",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100332258",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "J.R. Anderson. The Architecture of Cognition. Harvard University Press, Cambridge, MA, 1983. ",
      "doi": "10.5555/538901"
    },
    {
      "text": "R.K. Belew. Adaptive Information Retrieval: Machine Learning in Associative Networks. Technical Report 4, Cognitive Science and Machine Intelligence Laboratory, University of Michigan, 1987.",
      "doi": ""
    },
    {
      "text": "N.J. Belkin, W.B. Croft. Retrieval Techniques. Annual Review of Information Science and Technology (ARIST) 22 (1987), 109-145. ",
      "doi": "10.5555/42502.42506"
    },
    {
      "text": "T.J. Biggerstaff, A.J. Perlis (Ed.). Software Reusability, Volume I: Concepts and Models. Addison-Wesley Publishing Company, Reading, MA, 1989. ",
      "doi": "10.1145/73103"
    },
    {
      "text": "D.C. Blair, M.E. Maron. An Evaluation of Retrieval Effectiveness for a Full-Text Document-Retrieval System. Communications of the A CM 28 (March 1985), 289-299.  ",
      "doi": "10.1145/3166.3197"
    },
    {
      "text": "m.T.H. Chi, M. Bassok, M.W. Lewis, P. Reimann, R. Glaser. Self-Explanations: How Students Study and Use Examples in Learning to Solve Problems. Cognitive Science 13, 2 (1989), 145-182.",
      "doi": ""
    },
    {
      "text": "P.R. Cohen, R. Kjeldsen. Information Retrieval by Constrained Spreading Activation in Semantic Networks. Information Processing and Management 23, 4 (1987), 255-268.  ",
      "doi": "10.1016/0306-4573%2887%2990017-3"
    },
    {
      "text": "W.B. Croft, T.J. Lucia, J. Cringean, P. Willett. Retrieving Documents by Plausible Inference: An Experimental Study. Information Processing and Management 25, 6 (1989), 599-614.  ",
      "doi": "10.1016/0306-4573%2889%2990095-2"
    },
    {
      "text": "T.A. van Dijk, W. Kintsch. Strategies of Discourse Comprehension. Academic Press, New York, 1983.",
      "doi": ""
    },
    {
      "text": "G. Fischer. Cognitive View of Reuse and Redesign. IEEE Software, Special Issue oll Reusability 4, 4 (July 1987), 60-72.",
      "doi": "10.1109/MS.1987.231065"
    },
    {
      "text": "G. Fischer. Making Computers more Useful and more Usable. Proceedings of the 2nd International Conference on Human-Computer Interaction (Honolulu, Hawaii), Elsevier Science Publishers, New York, August, 1987, pp. 97-104.",
      "doi": ""
    },
    {
      "text": "G. Fischer. Creativity Enhancing Design Environ- ,ments. Proceedings Of the hTternational Conference Modelling Creativity and Knowledge-Based Creative Design' (Heron Island, Australia), October, 1989, pp. 127-132.",
      "doi": ""
    },
    {
      "text": "G. Fischer, P.W. Foltz, W. Kintsch, It. Nieper-Lemke, C. Stevens. Personal information Systems and Models of Human Memory. Department of Computer Science, University of Colorado, Boulder, CO, 1989.",
      "doi": ""
    },
    {
      "text": "G. Fischer, A. Girgensohn. End-User Modifiability in Design Environments. Iluman Factors in Computing Systems, CHI'90 Conference Proceedings (Seattle, WA), ACM, New York, April, 1990, pp. 183-191.  ",
      "doi": "10.1145/97243.97272"
    },
    {
      "text": "G. Fischer, H. Nieper-Lemke. tlELGON: Extending the Retrieval by Rcformulation Paradigm. Human Factors in Computing Systems, CHI'89 Conference Proceedings (Austin, TX), ACM, New York, May, 1989, pp. 357-362.  ",
      "doi": "10.1145/67449.67518"
    },
    {
      "text": "P.W. Foltz, W. Kintsch. An Empirical Study of Retrieval by Reformulation on tlELGON. In A.A. Turner (Ed.), Mental Models and User-Centered Design, Workshop Report (Breckenridge, CO), Institute of Cognitive Science, University of Colorado (Technical Report 88-9), Boulder, CO, 1988, pp. 9-14.",
      "doi": ""
    },
    {
      "text": "G.W. Furnas, T.K. Landauer, L.M. Gomez, S.T. Dumais. The Vocabulary Problem in Human-System Communication. Communications of the ACM 30, 11 (November 1987), 964-971.  ",
      "doi": "10.1145/32206.32212"
    },
    {
      "text": "S. Henninger. Defining the Roles of Humans and Computers in Cooperative Problem Solving Systems for Information Retrieval. Proceedings of the AAAI Spring Symposium Workshop on Knowledge-Based Human Computer Communication, March, 1990.",
      "doi": ""
    },
    {
      "text": "B.A. Huberman, T. Hogg. Phase Transitions in Artificial Intelligence Systems. Artificial h~telligence, 33 (1987), 155-17}.  ",
      "doi": "10.1016/0004-3702%2887%2990033-6"
    },
    {
      "text": "W. Kintsch. The Role of Knowledge in Discourse Comprehension: A Construction-Integration Model. Psychological Re~'iew 95 (1988), 163-182.",
      "doi": ""
    },
    {
      "text": "G. Lakoff. Women, Fire, and Dangerous Things: What Categories Reveal About the Mind. The University of Chicago Press, Chicago, IL, 1987.",
      "doi": ""
    },
    {
      "text": "J. Lave. Cognition in Practice. Cambridge University Press, Cambridge, UK, 1988.",
      "doi": ""
    },
    {
      "text": "C.H. Lewis, G.M. Olson. Can the Principles of Cognition Lower the Barriers of Programming? in G.M. Olson, E. Soloway, S. Sheppard (Eds.), Empirical Studies of Programmers (Vol. 2), Ablex Publishing Corporation, Lawrence Erlbaum Associates, Norwood, NJ - Hillsdale, NJ, 1987. ",
      "doi": "10.5555/54968.54984"
    },
    {
      "text": "T.P. Moran. Getting into a System: External-Internal Task Mapping Analysis. Human Factors in Computing Systems, CHI 83Conference Proceedings (Boston, MA), ACM, New York, December, 1983, pp. 45-49.  ",
      "doi": "10.1145/800045.801578"
    },
    {
      "text": "M.C. Mozer. Inductive Information Retrieval Using Parallel Distributed Computation. ICS Report 8406, Institute for Cognitive Science, University of California, San Diego, La Jolla, CA, June, 1984.",
      "doi": ""
    },
    {
      "text": "D.A. Norman. The Psychology of Everyday Things. Basic Books, New York, 1988.",
      "doi": ""
    },
    {
      "text": "D.A. Norman, D.G. Bobrow. Descriptions: An Intermediate Stage in Memory Retrieval. Cognitive Psychology 11 (1979), 107-123.",
      "doi": ""
    },
    {
      "text": "P.L. Pirolli, J.R. Anderson. The Role of Learning from Examples in the Acquisition of Recursive Programming Skills. Canadian Journal of Psychology 39, 2 (1985), 240-272.",
      "doi": ""
    },
    {
      "text": "B. Reeves. Finding and Choosing the Right Object in a Large Hardware Store --, An Empirical Study of Cooperative Problem Soh in{~ among Humans. Department of Computer Science, University of Colorado, Boulder, CO, 1990.",
      "doi": ""
    },
    {
      "text": "T.A. Standish. An Essay on Software Reuse. IEEE Transactions on Software Engineering SE-IO, 5 (September 1984), 494-497.",
      "doi": ""
    },
    {
      "text": "M.D. Williams. What Makes RABBIT Run? international Journal of Man-Machine Studies 21 (1984), 333-352.  ",
      "doi": "10.1016/S0020-7373%2884%2980052-8"
    }
  ]
}