{
  "doi": "10.1145/108844.108919",
  "title": "Models for evaluating interaction protocols in speech recognition",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "285-291",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Alexander I. Rudnicky",
      "institution": "School of Computer Science, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100553496/rel-imgonly/img_6400.jpg",
      "acmid": "81100553496",
      "orcid": "missing"
    },
    {
      "name": "Alexander G. Hauptmann",
      "institution": "School of Computer Science, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100535010",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "AINSWORTH, W. Optimization of string length for spoken digit input with error correction. International Journal of Man-Machine Studies 28 (1988), 573-581.  ",
      "doi": "10.1016/S0020-7373%2888%2980061-0"
    },
    {
      "text": "CARD, S. K., MORAN, T. P., AND NEWELL, A. The psychology of human-computer interaction. Erlbaum, Hillsdale, N.J., 1983. ",
      "doi": "10.5555/578027"
    },
    {
      "text": "CUSHMAN, W. H., OJHA) P. S., AND DANIELS, C. M. Usable OCR: What are the minimum performance requirements? In Proceedings of CHI (Seattle, April 1-5 1990), ACM, New York, 1990, pp. 145-151.  ",
      "doi": "10.1145/97243.97267"
    },
    {
      "text": "HAUPTMANN, A. H., AND RUDNICKY, A. I. A comparison of speech versus typed input. In Proceedings of the Third Darpa Speech and Natural Language Workshop (June 1990), Morgan Kaufmann, San Mateo, CA, 1990, p. in press.  ",
      "doi": "10.3115/116580.116652"
    },
    {
      "text": "ISAACSON, D. L., AND MADSEN, R. W. Markov chains, theory and applications. Wiley, New York, 1976.",
      "doi": ""
    },
    {
      "text": "KIERAS, D., AND POLSON, P. G. An approach to the formal analysis of user complexity. International journal of Man-Machine Studies 22 (1985), 365-394.",
      "doi": ""
    },
    {
      "text": "RUDNICKY, A., AND HAUPTMANN, i. Conversational interaction with speech systems. Tech. Rep. CMU-CS-89-203, Carnegie Mellon University School of Computer Science, December 1989.",
      "doi": ""
    },
    {
      "text": "RUDNICKY, A. i., AND HAUPTMANN, A. G. Errors, repetition, and contrastive stress emphasis in speech recognition. Working notes from the AAAI Spoken Language Symposium, March 1989.",
      "doi": ""
    },
    {
      "text": "R,UDNICKY)A. I.)SAKAMOTO, M. H.)AND Po- LIFRONI) J. H. Evaluation of spoken language interaction. In Proceedings of the Second Darpa Speech and Natural Language Workshop (October 1989), Morgan Kaufmann, San Mateo, CA, 1989, pp. 150-159.  ",
      "doi": "10.3115/1075434.1075459"
    }
  ]
}