{
  "doi": "10.1145/108844.108904",
  "title": "Text formatting by demonstration",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "251-256",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Brad A. Myers",
      "institution": "School of Computer Science, Carnegie Mellon University, Pittsburgh, PA",
      "img": "/do/10.1145/contrib-81100013136/rel-imgonly/brad-myers-120x120.jpg",
      "acmid": "81100013136",
      "orcid": "0000-0002-4769-0219"
    }
  ],
  "references": [
    {
      "text": "B. A. Myers. \"Creating Dynamic Interaction Techniques by Demonstration,\" CHI+GI Conference Proceedings. Toronto, Ont. Apr. 5-9, 1987. pp. 271-278.  ",
      "doi": "10.1145/29933.275642"
    },
    {
      "text": "I. E. Sutherland. \"SketchPad: A Man- Machine Graphical Communication System,\" AFIPS Spring Joint Computer Conference. 1963. pp. 329-346.",
      "doi": ""
    },
    {
      "text": "Paul R. Calder and Mark A. Linton. Glyphs: Flyweight Objects for User interfaces. Proceedings of the ACM SIG- GRAPH Symposium on User Interface Software and Technology, Snowbird, Utah, Oct., 1990, pp. 92-101.  ",
      "doi": "10.1145/97924.97935"
    },
    {
      "text": "Daniel C. Halbert. Programming by Example. Ph.D. Th., Computer Science Division, Dept. of EE&amp;CS, University of California, Berkeley, CA, 1984. Also: Xerox Office Systems Division, Systems Development Department, TR OSD-T8402, December, 1984. ",
      "doi": "10.5555/911909"
    },
    {
      "text": "W. J. Hansen. Enhancing documents with embedded programs\" How Ness extends insets in the Andrew ToolKit. Proceedings of 1990 International Conference on Computer Languages, IEEE Computer Society Press (Los Alamitos, CA, 1990), New Orleans, LA, March, 1990, pp. 23-32.",
      "doi": ""
    },
    {
      "text": "R.J. Lipton and R. Sedgewick. NOTECH: Typesetting without Formatting. Princeton University, 1990.",
      "doi": ""
    },
    {
      "text": "David L. Maulsby, Ian H. Witten, and Kenneth A. Kittlitz. Metamouse: Specifying Graphical Procedures by Example. Computer Graphics, Proceedings SIGGRAPH'89, Boston, MA, July, 1989, pp. 127-136.  ",
      "doi": "10.1145/74333.74346"
    },
    {
      "text": "James H. Morris, Mahadev Satyanarayanan, Michael H. Conner, John H. Howard, David S. H. Rosenthal, and F. Donelson Smith. \"Andrew: A Distributed Personal Computing Environment\". Communications of the ACM 29, 3 (March 1986), 184-201.  ",
      "doi": "10.1145/5666.5671"
    },
    {
      "text": "Brad A. Myers. Creating Dynamic Interaction Techniques by Demonstration. Human Factors in Computing Systems, CHI+GI'87, Toronto, Ont., Canada, April, 1987, pp. 271-278.  ",
      "doi": "10.1145/29933.275642"
    },
    {
      "text": "Brad A. Myers. Creating User Interfaces by Demonstration. Academic Press, Boston, 1988. ",
      "doi": "10.5555/43392"
    },
    {
      "text": "Brad A. Myers. Invisible Programming. 1990 IEEE Workshop on Visual Languages, IEEE Computer Society, Chicago, Ill, Oct., 1990, pp. 203-208.",
      "doi": ""
    },
    {
      "text": "Brad A. Myers. Demonstrational Interfaces: A Step Beyond Direct Manipulation. Tech. Rept. CMU- CS-90-162, Carnegie Mellon University Computer Science Department, Aug., 1990.",
      "doi": ""
    },
    {
      "text": "Brad A. Myers, Dario A. Giuse, Roger B. Dannenberg, Brad Vander Zanden, David S. Kosbie, Ed Pervin, Andrew Mickish, and Philippe Marchal. \"Comprehensive Support for Graphical, Highly-Interactive User Interfaces: The Garnet User interface Development Environment\". IEEE Computer 23, 11 (Nov. 1990), 71-85.  ",
      "doi": "10.1109/2.60882"
    },
    {
      "text": "Robert P. Nix. \"Editing by Example\". ACM Transactions on Programming Languages and Systems 7, 4 (Oct. 1985), 600-621.  ",
      "doi": "10.1145/4472.4476"
    },
    {
      "text": "Theo Pavlidis and Christopher J. Van Wyk. An Automatic Beautifier for Drawings and Illustrations. Computer Graphics, Proceedings SIGGRAPH'85, San Francisco, CA, July, 1985, pp. 225-234.  ",
      "doi": "10.1145/325165.325240"
    },
    {
      "text": "Ben Shneiderman. \"Direct Manipulation: A Step Beyond Programming Languages\". IEEE Computer 16, 8 (Aug. 1983), 57-69.",
      "doi": "10.1109/MC.1983.1654471"
    },
    {
      "text": "David Canfield Smith, Charles irby, Ralph Kimball, Bill Verplank, and Erik Harslem. \"Designing the Star User Interface\". Byte 7, 4 (April 1982), 242-282.",
      "doi": ""
    }
  ]
}