{
  "doi": "10.1145/108844.108932",
  "title": "VideoWhiteboard: video shadows to support remote collaboration",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "315-322",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "John C. Tang",
      "institution": "Sun Microsystems, 2550 Garcia Avenue, Mountain View, California and System Sciences Laboratory, Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/do/10.1145/contrib-81405592014/rel-imgonly/johntang_v2_cropped.jpg",
      "acmid": "81405592014",
      "orcid": "0000-0003-0603-3877"
    },
    {
      "name": "Scott Minneman",
      "institution": "System Sciences Laboratory, Xerox Palo Alto Research Center, 3333 Coyote Hill Road, Palo Alto, CA",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100078779",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Krueger, Myron W., Artificial Reality, Reading, MA: Addison-Wesley, 1982.",
      "doi": ""
    },
    {
      "text": "Lauwers, J. Chris and Keith A. Lantz, \"Collaboration Awareness in Support of Collaboration Transparency: Requirements for the Next Generation of Shared Window Systems\", Proc. of the Conference on CompLiter Human Interaction (CHI) 90, (Seattle, WA, April 1990), pp. 303-311.  ",
      "doi": "10.1145/97243.97301"
    },
    {
      "text": "March, Benjamin, Chinese Shadow-figure Plays and their Making, Handbook XI, Detroit: Puppetry imprints, 1938.",
      "doi": ""
    },
    {
      "text": "O'Boyle, Leonard E., Praful H. Shah, and Gabe P. Torok, ~'Have blackboard, needn't travel\", Bell Laboratories Record, (October 1979), pp. 255-258.",
      "doi": ""
    },
    {
      "text": "Olson, Margrethe H. and Sara A. Bly, \"The Portland Experience: A Report on a Distributed Research Group\", International Journal of Man-Machine Systems, Special issue on Computer-Supported Cooperative Work and Groupware, in press.  ",
      "doi": "10.1016/0020-7373%2891%2990042-6"
    },
    {
      "text": "Tang, John C. and Scott L. Minneman, \"VideoDraw: A Video Interface for Collaborative Drawing\", Proc. of the Conference on Computer Human Interaction (CHI) '90, (Seattle, WA, April 1990), pp. 313-320.  ",
      "doi": "10.1145/97243.97302"
    },
    {
      "text": "Tang, John et al., \"Observations on the Use of Shared Drawing Spaces\", videotape, Xerox Corporation, Palo Alto Research Center, 1990.",
      "doi": ""
    },
    {
      "text": "Tatar, Deborah, \"Using Video-Based Observation to Shape the Design of a New Technology\", SIGCHI Bulletin, Vol. 21, No. 2, (October 1989), pp. 108-111.  ",
      "doi": "10.1145/70609.70628"
    }
  ]
}