{
  "doi": "10.1145/108844.108934",
  "title": "Graphical toolkit approach to user interaction description",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "323-328",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "tags": [],
  "authors": [
    {
      "name": "Kosuke Tatsukawa",
      "institution": "C&C Systems Research Laboratories, NEC Corporation, 4-1-1 Miyazaki, Miyamae-ku, Kawasaki, Kanagawa 216, Japan",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81392609881",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "DeSoi, John F., el al. Graphical specification of user interfaces with behavior abstraction. In CHI '89 Proceedings, 1989, 139-144.  ",
      "doi": "10.1145/67449.67477"
    },
    {
      "text": "Green, Mark. The university of alberta user interface management system, in SIGGRAPH '85, 1985, 205-213.  ",
      "doi": "10.1145/325165.325286"
    },
    {
      "text": "Henderson, D. Austin. The trillium user interface design environment. In CHI '86 Proceedings, 1986, 221-227.  ",
      "doi": "10.1145/22627.22375"
    },
    {
      "text": "Hill, Ralph D. Event-Response systems- A technique for specifying multi-Threaded dialogues. In Proceedings of CHI+GI '87, 1987, 241-248.  ",
      "doi": "10.1145/29933.275637"
    },
    {
      "text": "Ingalls, Dan, el al. Fabrik: A visual programming environment. In OOPSLA '88 Conference Proceedings, 1988, 176-190.  ",
      "doi": "10.1145/62083.62100"
    },
    {
      "text": "Jacob, Robert J. K. A specification language for direct-Manipulation user interfaces. A CM Transactions on Graphics, 5, 4, (Oct. 1986), 283-317.  ",
      "doi": "10.1145/27623.27624"
    },
    {
      "text": "Maloney, John H., et al. Constraint technology for user-Interface construction in thingLab II. In OOPSLA 'Sg Conference Proceedings, 1989, 381- 388.  ",
      "doi": "10.1145/74877.74917"
    },
    {
      "text": "Brad A. Myers. Creating user interfaces using programming by example, visual programming, and constraints. A CM Transactions on Programming Languages and Systems, 12, 2, (Apr. 1990), 143- 177.  ",
      "doi": "10.1145/78942.78943"
    },
    {
      "text": "Siochi, Antonio C. and Hartson, H. Rex. Taskoriented representation of asynchronous user interfaces. In CHI '89 Proceedings, 1989, 183-188.  ",
      "doi": "10.1145/67449.67487"
    },
    {
      "text": "Tanaka, Yuzuru. A tool kit system for the synthesis and the management of active media objects. In The Firsl Inlernational Conference on Deductive and Object-Oriented Dalabases, 1989, 76-94.",
      "doi": ""
    }
  ]
}