{
  "doi": "10.1145/108844.108858",
  "title": "CSCW: the convergence of two development contexts",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "91-97",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Jonathan Grudin",
      "institution": "Computer Science Department, Aarhus University, 8000 Aarhus C, Denmark",
      "img": "/do/10.1145/contrib-81100031531/rel-imgonly/jonathan_grudin.jpg",
      "acmid": "81100031531",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Bannon, L., BjCm-Andersen, N. &amp; Due-Thomsen, B., 1988. Computer support for cooperative work: An appraisal and critique. In Bullinger et al. (Eds.), EURINFO'88: Information systems for organizational effectiveness. Amsterdam: North-Holland.",
      "doi": ""
    },
    {
      "text": "Bannon, L. &amp; Schmidt, K., 1990. CSCW, or What's in a name? Manuscript submitted for publication.",
      "doi": ""
    },
    {
      "text": "Bjerknes, G., Ehn, P. &amp; Kyng, M. (Eds.), 1987. Computers and democracy: A Scandinavian challenge. Brookfield, VT: Gower Press.",
      "doi": ""
    },
    {
      "text": "Bc~dker, S., 1991. Through the interface: A human activity approach to user interface design. Hillsdale, NJ: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/532624"
    },
    {
      "text": "Bc~dker, S., Ehn, P., Knudsen, J., Kyng, M. &amp; Madsen, K., 1988. Computer support for cooperative design. Proc. CSCW'88 Conference on Computer- Supported Cooperative Work (Portland, Sept. 26-28).  ",
      "doi": "10.1145/62266.62296"
    },
    {
      "text": "CACM, 1970. Data processing industry assessed by consultant. Communications of the ACM, 13, I1, 704.",
      "doi": ""
    },
    {
      "text": "Ehn, P., 1989. Work oriented design of computer artifacts. Hillsdale, NJ: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/1102017"
    },
    {
      "text": "Ehrlich, S.F., 1987. Strategies for encouraging successful adoption of office communication systems. ACM Transactions on Office Information Systems, 5, 340-357.  ",
      "doi": "10.1145/42196.42198"
    },
    {
      "text": "Ensor, R. (Moderator), 1990. How can we make groupware practical? In Proc. CHI'90 Human Factors in Computing Systems (Seattle, April 1-5), 87-89.  ",
      "doi": "10.1145/97243.97259"
    },
    {
      "text": "Floyd, C., Mehl, W.-M., Reisin, F.-M., Schmidt, G. &amp; Wolf, G., 1989. Out of Scandinavia: Alternative approaches to software design and system development. Human-Computer Interaction, 4, 4, 253-349.",
      "doi": "10.1207/s15327051hci0404_1"
    },
    {
      "text": "Friedman, A.L., 1989. Computer systems development: History, organization and implementation. Chichester, UK: Wiley. ",
      "doi": "10.5555/583461"
    },
    {
      "text": "Greenbaum, J., 1979. In the name of efficiency. Philadelphia: Temple University Press.",
      "doi": ""
    },
    {
      "text": "Greenbaum, J. &amp; Kyng, M. (Eds.), 1991. Design at work: Cooperative design of computer systems. Hillsdale, NJ: Lawrence Erlbaum Associates. ",
      "doi": "10.5555/574738"
    },
    {
      "text": "Grudin, J., 1991a. The development of interactive systems: Bridging the gaps between developers and users. IEEE Computer, in press.  ",
      "doi": "10.1109/2.76263"
    },
    {
      "text": "Grudin, J., 1991b. Obstacles to participatory design in large product development organizations. In Schuler and Namioka, in press.",
      "doi": ""
    },
    {
      "text": "Grudin, J., 1991c. Seven plus one challenges for groupware developers. Rev. of DAIMI PB 323 Aarhus University Computer Science Department.",
      "doi": ""
    },
    {
      "text": "Hellman, R., 1989. Emancipation of and by computer-supported cooperative work. Scandinavian Journal of lnformation Systems, 1,143-161. ",
      "doi": "10.5555/121465.121472"
    },
    {
      "text": "Irons, E.T. and Djorup, F.M., 1972. A CRT editing system. Communications of the ACM, 15, 1, 16- 20.  ",
      "doi": "10.1145/361237.361244"
    },
    {
      "text": "Levy, S., 1985. Hackers. Garden City, NY: Anchor Press/Doubleday.",
      "doi": ""
    },
    {
      "text": "Schuler, D. &amp; Namioka, A. (Eds.), in press. Participatory design. Hillsdale, NJ\" Lawrence Erlbaum Associates.",
      "doi": ""
    },
    {
      "text": "Suchman, L., 1988. Designing with the user. ACM Transactions on Office Information Systems, 6, 173- 183.  ",
      "doi": "10.1145/45941.383895"
    },
    {
      "text": "SCrgaard, P., 1988. A framework for computer supported cooperative work. In J. Kaasb~ll (Ed.), Report of the 11th lnformations Systems Research Seminar in Scandinavia, Department of Informatics, University of Oslo, 620-640.",
      "doi": ""
    }
  ]
}