{
  "doi": "10.1145/108844.108847",
  "title": "Two approaches to casual interaction over computer and video networks",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "13-19",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "authors": [
    {
      "name": "Alan Borning",
      "institution": "Rank Xerox EuroPARC, 61 Regent Street, Cambridge CB2 1AB, United Kingdom",
      "img": "/do/10.1145/contrib-81100164129/rel-imgonly/alan.jpg",
      "acmid": "81100164129",
      "orcid": "missing"
    },
    {
      "name": "Michael Travers",
      "institution": "Rank Xerox EuroPARC, 61 Regent Street, Cambridge CB2 1AB, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660553763",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "D. Applegate, J. Aspnes, T. Freeman, and B. Yee. TinyMUD, 1990. Unpublished computer software.",
      "doi": ""
    },
    {
      "text": "W. Buxton and T. Moran. EuroPARC's Integrated interactive Intermedia Facility (iiiF): Early Experiences. In Proceedings of the IFIP WG8.4 Conference on Multi-user Interfaces and Applications, Heraklion, Crete, Sept. 1990. ",
      "doi": "10.5555/133482.133487"
    },
    {
      "text": "D. A. Henderson and S. K. Card. Rooms: The Use of Multiple Virtual Workspaces to Reduce Space Contention in a Window-Based Graphical User interface. A CM Transactions on Graphics, 5(3):211- 243, 1986.  ",
      "doi": "10.1145/24054.24056"
    },
    {
      "text": "R. Kraut, C. Egido, and J. Galegher. Patterns of Contact and Communication in Scientific Research Collaboration. In Proceedings of the Conference on Computer-Supported Cooperative Work, pages 1-12, Portland, Oregon, Sept. 1988. ACM.  ",
      "doi": "10.1145/62266.62267"
    },
    {
      "text": "W. Mackay. Personal communication, July 1990.",
      "doi": ""
    },
    {
      "text": "A. MacLean, K. Carter, L. Lovstrand, and T. Moran. User-Tailorable Systems: Pressing the Issues with Buttons. In CHI '90 Conference Proceedings, pages 175-182, Seattle, Apr. 1990. ACM.  ",
      "doi": "10.1145/97243.97271"
    },
    {
      "text": "R. W. Root. Design of a Multi-Media Vehicle for Social Browsing. in Proceedings of the Conference on Computer-Supported Cooperative Work, pages 25- 38, Portland, Oregon, sept 1988. ACM.  ",
      "doi": "10.1145/62266.62269"
    },
    {
      "text": "M. Stefik, G. Foster, D. G. Bobrow, K. Kahn, S. Lamming, and L. Suchman. Beyond the Chalkboard: Computer Support for Collaboration and Problem Solving in Meetings. Communications of the A CM, 30(1):32-47, 1987.  ",
      "doi": "10.1145/7885.7887"
    },
    {
      "text": "J. C. Tang and S. L. Minneman. VideoDraw: A Video Interface for Collaborative Drawing. In CHI 90 Proceedings, pages 313-320, 1990.  ",
      "doi": "10.1145/97243.97302"
    }
  ]
}