{
  "doi": "10.1145/108844.108849",
  "title": "Applications: a dimension space for user interface management systems",
  "published": "1991-03-01",
  "proctitle": "CHI '91: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems",
  "pages": "27-32",
  "year": 1991,
  "badges": [],
  "abstract": "",
  "tags": [],
  "authors": [
    {
      "name": "Joëlle Coutaz",
      "institution": "Laboratoire de Génie Informatique (IMAG), BP 53 X, 38041 Grenoble Cedex, France",
      "img": "/do/10.1145/contrib-81100015116/rel-imgonly/81100015116.jpg",
      "acmid": "81100015116",
      "orcid": "missing"
    },
    {
      "name": "Sandrine Balbo",
      "institution": "Laboratoire de Génie Informatique (IMAG), BP 53 X, 38041 Grenoble Cedex, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100128308",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Olsen, D.R. Jr. A Progmmnling Language Basis for User Interface Manageinent. In Proceedings of the Clli'89 Conference (Austin, 30 April-4 May). ACM,1989, pp. 171-176.  ",
      "doi": "10.1145/67449.67485"
    },
    {
      "text": "Brown, M.H., Avrahami, G. and Brooks, K.P. A Two-View Approach to Constructing User interfaces. In Proceedings of SIGGRAPH'89 (Boston, 31 July-4 august). Computer Graphics, 23, 3 (July). ACM, 1989.  ",
      "doi": "10.1145/74334.74347"
    },
    {
      "text": "Foley, J.D. Gibbs, C. Won Chul, K. and Kovacevic, S. A Knowledge-Based User interface Management System. In Proceedings of the CHI'88 Conference (Washington, May 15-19). ACM,New York, 1988, pp. 67-74.  ",
      "doi": "10.1145/57167.57178"
    },
    {
      "text": "Petoud, I. and Pigneur, Y. An Automatic and Visual Approach for User Interface Design. in Engineering for Human-Computer Interaction. G. Cockton Ed., Elsevier Science, 1990, pp. 403-420.",
      "doi": ""
    },
    {
      "text": "Tanner, P. and Buxton, W. : Some Issues in Future User Interface Management Systems (UIMS) Development. In User Interface Management Systems, IFIP Working Group 5.2 Workshop on User Interface Management (Seeheim, Nov. 1983), Pfaff, G.E. (Ed), Springer Verlag,1985.",
      "doi": ""
    },
    {
      "text": "Bass, L. Hardy, E. Hoyt, K. Little, R. and Seacord, R. The Serpent run time architecture and dialogue model. Carnegie Mellon Technical Report, CMU/SEI-88-TR-6, January, 1988.",
      "doi": ""
    },
    {
      "text": "Webster, B.F. The NeXT Book. Addison Wesley, 1989. ",
      "doi": "10.5555/64814"
    },
    {
      "text": "Myers, B. G iuse, D. Danneberg, R.B. Vander Zanden, B. Kosbie, D. Pervin, E. Mickish, A. and Marchal, P.Garnet, Comprehensive Support for Graphical, Highly Interactive User Interfaces. IEEE Computer, 23,11 (Nov. 1990). IEEE Computer Society, November, 1990, pp. 71-85.  ",
      "doi": "10.1109/2.60882"
    },
    {
      "text": "Jacob, R.J.K. A Specification Language fro Direct- Manipulation User Interfaces. ACM Transactions on Graphics, 5, 4 (Oct. 1986). ACM, October, 1986, pp. 283-317.  ",
      "doi": "10.1145/27623.27624"
    },
    {
      "text": "Senay, H. Sukaviriya, P. and Moran L. Planning for Automatic Help Generation. In Engineering for Human-Computer Interaction. G. Cockton Ed., Elsevier Science, 1990, pp. 293-308.",
      "doi": ""
    },
    {
      "text": "Norman, D. A. and Draper, S. W. User Centered System Design. Lawrence Erlbaum Associates, 1986. ",
      "doi": "10.5555/576915"
    },
    {
      "text": "Borning, A.H. Defining Constraints Graphically. In Proceedings of CHI'86 (Boston, April 13-17). ACM, New York,1986, pp. 137-143.  ",
      "doi": "10.1145/22627.22362"
    },
    {
      "text": "Coutaz, J. Interface tlomme-Ordinateur: Conception et Rdalisation. Dunod, 1988.",
      "doi": ""
    },
    {
      "text": "OSF/Motif, Programmer's Reference Manual, Revision 1.0 ; Open Software Foundation, Eleven Cambridge Center, Cambridge, MA 02142, 1989.",
      "doi": ""
    },
    {
      "text": "Coutaz, J. and Nigay, L. Agents and Rules. in AMODEUS D2 Deliverable, BRA 3066 ESPRIT project, 1990.",
      "doi": ""
    }
  ]
}