{
  "doi": "10.1145/3491102.3517534",
  "title": "“It Basically Started Using Me:” An Observational Study of Password Manager Usage",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-23",
  "year": 2022,
  "badges": [],
  "abstract": "There is limited information regarding how users employ password managers in the wild and why they use them in that manner. To address this knowledge gap, we conduct observational interviews with 32 password manager users. Using grounded theory, we identify four theories describing the processes and rationale behind participants’ usage of password managers. We find that many users simultaneously use both a browser-based and a third-party manager, using each as a backup for the other, with this new paradigm having intriguing usability and security implications. Users also eschew generated passwords because these passwords are challenging to enter and remember when the manager is unavailable, necessitating new generators that create easy-to-enter and remember passwords. Additionally, the credential audits provided by most managers overwhelm users, limiting their utility and indicating a need for more proactive and streamlined notification systems. We also discuss mobile usage, adoption and promotion, and other related topics.",
  "tags": [
    "password manager",
    "grounded theory",
    "observational study"
  ],
  "authors": [
    {
      "name": "Sean Oesch",
      "institution": "University of Tennessee, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659657639",
      "orcid": "missing"
    },
    {
      "name": "Scott Ruoti",
      "institution": "Electrical Engineering and Computer Science, University of Tennessee, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81550713256",
      "orcid": "missing"
    },
    {
      "name": "James Simmons",
      "institution": "University of Tennessee, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659657677",
      "orcid": "missing"
    },
    {
      "name": "Anuj Gautam",
      "institution": "University of Tennessee, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659917766",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Nora Alkaldi and Karen Renaud. 2016. Why do people adopt, or reject, smartphone password managers?. In 2016 European Workshop on Usable Security. Internet Society.",
      "doi": ""
    },
    {
      "text": "Nora Alkaldi and Karen Renaud. 2019. Encouraging password manager adoption by meeting adopter self-determination needs. In Proceedings of the 52nd Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Catherine L Anderson and Ritu Agarwal. 2010. Practicing safe computing: A multimethod empirical examination of home computer user security behavioral intentions. MIS quarterly (2010), 613–643.",
      "doi": ""
    },
    {
      "text": "Simone Aonzo, Alessio Merlo, Giulio Tavella, and Yanick Fratantonio. 2018. Phishing attacks on modern android. In Proceedings of the 2018 ACM SIGSAC Conference on Computer and Communications Security. 1788–1801.",
      "doi": "10.1145/3243734.3243778"
    },
    {
      "text": "Salvatore Aurigemma, Thomas Mattson, and Lori Leonard. 2017. So much promise, so little use: What is stopping home end-users from using password manager applications?. In Proceedings of the 52nd Hawaii International Conference on System Sciences.",
      "doi": ""
    },
    {
      "text": "Salvatore Aurigemma, Thomas Mattson, and Lori NK Leonard. 2019. Evaluating the core and full protection motivation theory nomologies for the voluntary adoption of password manager applications. AIS Transactions on Replication Research 5, 1 (2019), 3.",
      "doi": ""
    },
    {
      "text": "Talal Haj Bakry and Tommy Mysk. 2020. Precise Location Information Leaking Through System Pasteboard. https://www.mysk.blog/2020/02/24/precise- location-information-leaking-through-system- pasteboard/. Accessed: 2020-06-13.",
      "doi": ""
    },
    {
      "text": "Joseph Bonneau and Stuart Schechter. 2014. Towards reliable storage of 56-bit secrets in human memory. In 23rd {USENIX} Security Symposium ({USENIX} Security 14). 607–623.",
      "doi": ""
    },
    {
      "text": "Sunil Chaudhary, Tiina Schafeitel-Tähtinen, Marko Helenius, and Eleni Berki. 2019. Usability, security and trust in password managers: A quest for user-centric properties and features. Computer Science Review 33 (2019), 69–90.",
      "doi": "10.1016/j.cosrev.2019.03.002"
    },
    {
      "text": "Mark Ciampa. 2013. A comparison of user preferences for browser password managers. Journal of Applied Security Research 8, 4 (2013), 455–466.",
      "doi": ""
    },
    {
      "text": "Juliet M Corbin and Anselm Strauss. 1990. Grounded theory research: Procedures, canons, and evaluative criteria. Qualitative sociology 13, 1 (1990), 3–21.",
      "doi": ""
    },
    {
      "text": "Serge Egelman and Eyal Peer. 2015. Scaling the security wall: Developing a security behavior intentions scale (sebis). In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 2873–2882.",
      "doi": "10.1145/2702123.2702249"
    },
    {
      "text": "Michael Fagan, Yusuf Albayram, Mohammad Maifi Hasan Khan, and Ross Buck. 2017. An investigation into users’ considerations towards using password managers. Human-centric Computing and Information Sciences 7, 1 (2017), 12.",
      "doi": "10.1186/s13673-017-0093-6"
    },
    {
      "text": "Sascha Fahl, Marian Harbach, Marten Oltrogge, Thomas Muders, and Matthew Smith. 2013. Hey, you, get off of my clipboard. In International Conference on Financial Cryptography and Data Security. Springer, 144–161.",
      "doi": ""
    },
    {
      "text": "Kristen K Greene. 2015. Effects of Password Permutation on Subjective Usability Across Platforms. In International Conference on Human Aspects of Information Security, Privacy, and Trust. Springer, 59–70.",
      "doi": ""
    },
    {
      "text": "Kristen K Greene, Melissa A Gallagher, Brian C Stanton, and Paul Y Lee. 2014. I can’t type that! p@ $$w0rd entry on mobile devices. In International Conference on Human Aspects of Information Security, Privacy, and Trust. Springer, 160–171.",
      "doi": "10.1007/978-3-319-07620-1_15"
    },
    {
      "text": "Greg Guest, Arwen Bunce, and Laura Johnson. 2006. How many interviews are enough? An experiment with data saturation and variability. Field methods 18, 1 (2006), 59–82.",
      "doi": ""
    },
    {
      "text": "N. Huaman, S. Amft, M. Oltrogge, Y. Acar, and S. Fahl. 2021. They Would do Better if They Worked Together: The Case of Interaction Problems Between Password Managers and Websites. In 2021 2021 IEEE Symposium on Security and Privacy (SP). IEEE Computer Society, Los Alamitos, CA, USA, 1626–1640. https://doi.org/10.1109/SP40001.2021.00094",
      "doi": ""
    },
    {
      "text": "Ruogu Kang, Stephanie Brown, Laura Dabbish, and Sara Kiesler. 2014. Privacy attitudes of mechanical turk workers and the us public. In 10th Symposium On Usable Privacy and Security ({SOUPS} 2014). 37–49.",
      "doi": "10.5555/3235838.3235842"
    },
    {
      "text": "Ambarish Karole, Nitesh Saxena, and Nicolas Christin. 2010. A comparative usability evaluation of traditional password managers. In International Conference on Information Security and Cryptology. Springer, 233–251.",
      "doi": ""
    },
    {
      "text": "Zhiwei Li, Warren He, Devdatta Akhawe, and Dawn Song. 2014. The Emperor’s New Password Manager: Security Analysis of Web-based Password Managers.. In USENIX Security Symposium. 465–479.",
      "doi": ""
    },
    {
      "text": "Sanam Ghorbani Lyastani, Michael Schilling, Sascha Fahl, Michael Backes, and Sven Bugiel. 2018. Better managed than memorized? Studying the Impact of Managers on Password Strength and Reuse. In 27th USENIX Security Symposium. 203–220.",
      "doi": ""
    },
    {
      "text": "Raymond Maclean and Jacques Ophoff. 2018. Determining key factors that lead to the adoption of password managers. In 2018 International Conference on Intelligent and Innovative Computing Applications (ICONIC). IEEE, 1–7.",
      "doi": ""
    },
    {
      "text": "Philipp K Masur. 2018. Situational privacy and self-disclosure: Communication processes in online environments. Springer.",
      "doi": ""
    },
    {
      "text": "Sean Oesch, Anuj Gautam, and Scott Ruoti. 2021. The emperor’s new autofill framework: a security analysis of autofill on iOS and Android. In Proceedings of the 37th Annual Computer Security Applications Conference. ACM.",
      "doi": "10.1145/3485832.3485884"
    },
    {
      "text": "Sean Oesch and Scott Ruoti. 2020. That Was Then, This Is Now: A Security Evaluation of Password Generation, Storage, and Autofill in Browser-Based Password Managers. In 29th USENIX Security Symposium (USENIX Security 20). USENIX Association, Boston, MA. https://www.usenix.org/conference/usenixsecurity20/presentation/oesch",
      "doi": ""
    },
    {
      "text": "Sarah Pearman, Jeremy Thomas, Pardis Emami Naeini, Hana Habib, Lujo Bauer, Nicolas Christin, Lorrie Faith Cranor, Serge Egelman, and Alain Forget. 2017. Let’s Go in for a Closer Look: Observing Passwords in Their Natural Habitat. In Proceedings of the 2017 ACM SIGSAC Conference on Computer and Communications Security. ACM, 295–310.",
      "doi": "10.1145/3133956.3133973"
    },
    {
      "text": "Sarah Pearman, Shikun Aerin Zhang, Lujo Bauer, and Nicolas Christin. 2019. Why people (don’t) use password managers effectively. In Fifteenth Symposium on Usable Privacy and Security (SOUPS 2019).",
      "doi": ""
    },
    {
      "text": "Constantinos N Phellas, Alice Bloch, and Clive Seale. 2011. Structured methods: interviews, questionnaires and observation. Researching society and culture 3 (2011), 181–205.",
      "doi": ""
    },
    {
      "text": "Hirak Ray, Flynn Wolf, Ravi Kuber, and Adam J. Aviv. 2021. Why Older Adults (Don’t) Use Password Managers. In 30th USENIX Security Symposium (USENIX Security 21). USENIX Association, 73–90. https://www.usenix.org/conference/usenixsecurity21/presentation/ray",
      "doi": ""
    },
    {
      "text": "Sunyoung Seiler-Hwang, Patricia Arias-Cabarcos, Andrés Marín, Florina Almenares, Daniel Díaz-Sánchez, and Christian Becker. 2019. “I don’t see why I would ever want to use it:” Analyzing the Usability of Popular Smartphone Password Managers. In Proceedings of the 2019 ACM SIGSAC Conference on Computer and Communications Security. 1937–1953.",
      "doi": "10.1145/3319535.3354192"
    },
    {
      "text": "David Silver, Suman Jana, Dan Boneh, Eric Yawei Chen, and Collin Jackson. 2014. Password Managers: Attacks and Defenses.. In USENIX Security Symposium. 449–464.",
      "doi": ""
    },
    {
      "text": "James Simmons, Oumar Diallo, Sean Oesch, and Scott Ruoti. 2021. Systematization of password manager use cases and design paradigms. In Proceedings of the 37th Annual Computer Security Applications Conference. ACM.",
      "doi": ""
    },
    {
      "text": "Elizabeth Stobert and Robert Biddle. 2015. Expert password management. In International Conference on Passwords. Springer, 3–20.",
      "doi": ""
    },
    {
      "text": "Ben Stock and Martin Johns. 2014. Protecting users against XSS-based password manager abuse. In Proceedings of the 9th ACM symposium on Information, computer and communications security. ACM, 183–194.",
      "doi": "10.1145/2590296.2590336"
    },
    {
      "text": "Joshua Tan, Lujo Bauer, Joseph Bonneau, Lorrie Faith Cranor, Jeremy Thomas, and Blase Ur. 2017. Can unicorns help users compare crypto key fingerprints?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 3787–3798.",
      "doi": "10.1145/3025453.3025733"
    }
  ]
}