{
  "doi": "10.1145/3491102.3517437",
  "title": "“Guilty of Talking Too Much”: How Psychotherapists Gamify Therapy",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Traditionally, game designers have driven the development process of psychotherapeutic games with psychotherapists playing a consultant role. In contrast, our study explores psychotherapists independently designing digitally gamified psychotherapy. Our workshop participants consisted of six psychotherapists who created gamified digital therapies with the design prompt of anxiety disorder. We analyze the resulting six prototypes from a game design and psychotherapy perspective. We present insights into strategies for digitally gamifying therapy and identify challenges and opportunities for the future of gamified psychotherapy, grounded in the experiences of psychotherapists designing such therapies. This study also reflects on the use of user-friendly development tools for independently curating gamified digital therapies, especially by non-technical users such as psychotherapists.",
  "tags": [
    "meta-design",
    "anxiety disorder",
    "mental health",
    "games for health",
    "research-through-design",
    "Game design",
    "digital psychotherapy"
  ],
  "authors": [
    {
      "name": "Elina Tochilnikova",
      "institution": "CAMD, Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233973",
      "orcid": "missing"
    },
    {
      "name": "Amrit Patnaik",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660232929",
      "orcid": "missing"
    },
    {
      "name": "Ghada Alsebayel",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660236210",
      "orcid": "missing"
    },
    {
      "name": "Uttkarsh Narayan",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659461494",
      "orcid": "missing"
    },
    {
      "name": "Andrew Coeytaux",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233944",
      "orcid": "missing"
    },
    {
      "name": "Valeria Ramdin",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233856",
      "orcid": "missing"
    },
    {
      "name": "Miso Kim",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526540",
      "orcid": "0000-0002-3058-3388"
    },
    {
      "name": "Casper Harteveld",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81460657992",
      "orcid": "0000-0002-8164-0303"
    }
  ],
  "references": [
    {
      "text": "Annemarie Abbing, Anne Ponstein, Susan van Hooren, Leo de Sonneville, Hanna Swaab, and Erik Baars. 2018. The effectiveness of art therapy for anxiety in adults: A systematic review of randomised and non-randomised controlled trials. PLOS ONE 13, 12 (Dec. 2018), e0208716. https://doi.org/10.1371/journal.pone.0208716 Publisher: Public Library of Science.",
      "doi": ""
    },
    {
      "text": "Anna Amato. 2020. What do students learn about experimental research by designing interactive fiction games?. In The Interdisciplinarity of the Learning Sciences, 14th International Conference of the Learning Sciences (ICLS) 2020, Volume 1 (pp. 553-556), Vol. 1.",
      "doi": ""
    },
    {
      "text": "Gerhard Andersson. 2016. Internet-delivered psychological treatments. Annual Review of Clinical Psychology 12, 1 (2016), 157–179. https://doi.org/10.1146/annurev-clinpsy-021815-093006",
      "doi": ""
    },
    {
      "text": "Joanna J. Arch and Michelle G. Craske. 2009. First-line treatment: A critical appraisal of cognitive behavioral therapy developments and alternatives. The Psychiatric Clinics of North America 32, 3 (Sept. 2009), 525–547. https://doi.org/10.1016/j.psc.2009.05.001",
      "doi": ""
    },
    {
      "text": "Sylvester Arnab, Theodore Lim, Maira B. Carvalho, Francesco Bellotti, Sara de Freitas, Sandy Louchart, Neil Suttie, Riccardo Berta, and Alessandro De Gloria. 2015. Mapping learning and game mechanics for serious games analysis. British Journal of Educational Technology 46, 2 (2015), 391–411. https://doi.org/10.1111/bjet.12113",
      "doi": ""
    },
    {
      "text": "American Psychiatric Association, American Psychiatric Association, 2013. Diagnostic and statistical manual of mental disorders: DSM-5. Arlington, VA (2013).",
      "doi": ""
    },
    {
      "text": "Autumn Backhaus, Zia Agha, Melissa L. Maglione, Andrea Repp, Bridgett Ross, Danielle Zuest, Natalie M. Rice-Thorp, James Lohr, and Steven R. Thorp. 2012. Videoconferencing psychotherapy: A systematic review. Psychological Services 9, 2 (2012), 111–131. https://doi.org/10.1037/a0027924 Place: US Publisher: Educational Publishing Foundation.",
      "doi": ""
    },
    {
      "text": "Imre Dániel Báldy, Nikolaj Hansen, and Thomas Bjørner. 2021. An engaging serious game aiming at awareness of therapy skills associated with social anxiety disorder. Mobile Networks and Applications(2021), 1–12.",
      "doi": ""
    },
    {
      "text": "Borwin Bandelow, Sophie Michaelis, and Dirk Wedekind. 2017. Treatment of anxiety disorders. Dialogues in Clinical Neuroscience 19, 2 (June 2017), 93–107. https://www.ncbi.nlm.nih.gov/pmc/articles/PMC5573566/",
      "doi": ""
    },
    {
      "text": "Jacques P Barber and Nili Solomonov. 2019. Toward a personalized approach to psychotherapy outcome and the study of therapeutic change. World Psychiatry 18, 3 (2019), 291.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the SIGCHI conference on human factors in computing systems. 675–684.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Max V. Birk, Greg Wadley, Vero Vanden Abeele, Regan Mandryk, and John Torous. 2019. Video games for mental health. Interactions 26, 4 (June 2019), 32–36. https://doi.org/10.1145/3328483",
      "doi": "10.1145/3328483"
    },
    {
      "text": "Tara F. Bishop, Matthew J. Press, Salomeh Keyhani, and Harold Alan Pincus. 2014. Acceptance of insurance by psychiatrists and the implications for access to mental health care. JAMA Psychiatry 71, 2 (Feb. 2014), 181. https://doi.org/10.1001/jamapsychiatry.2013.2862",
      "doi": ""
    },
    {
      "text": "Staffan Björk and Jussi Holopainen. 2006. Games and design patterns. The game design reader(2006), 410–437.",
      "doi": ""
    },
    {
      "text": "Johanna Boettcher, Viktor Aström, Daniel Påhlsson, Ola Schenström, Gerhard Andersson, and Per Carlbring. 2014. Internet-based mindfulness treatment for anxiety disorders: A randomized controlled trial. Behavior Therapy 45, 2 (March 2014), 241–253. https://doi.org/10.1016/j.beth.2013.11.003",
      "doi": ""
    },
    {
      "text": "Cristina Botella, Juani Bretón-López, Soledad Quero, Rosa Baños, and Azucena Garcia-Palacios. 2010. Treating cockroach phobia with augmented reality. Behavior therapy 41 (Sept. 2010), 401–13. https://doi.org/10.1016/j.beth.2009.07.002",
      "doi": ""
    },
    {
      "text": "Menna Brown, Noelle O’Neill, Hugo van Woerden, Parisa Eslambolchilar, Matt Jones, and Ann John. 2016. Gamification and adherence to web-based mental health interventions: A systematic review. JMIR mental health 3, 3 (2016), e39.",
      "doi": ""
    },
    {
      "text": "S. J. Brown, D. A. Lieberman, B. A. Germeny, Y. C. Fan, D. M. Wilson, and D. J. Pasta. 1997. Educational video game for juvenile diabetes: Results of a controlled trial. Medical Informatics = Medecine Et Informatique 22, 1 (March 1997), 77–89. https://doi.org/10.3109/14639239709089835",
      "doi": ""
    },
    {
      "text": "Timothy J. Bruce and Sy Atezaz Saeed. 1999. Social anxiety disorder: A common, underrecognized mental disorder. American Family Physician 60, 8 (Nov. 1999), 2311. https://www.aafp.org/afp/1999/1115/p2311.html",
      "doi": ""
    },
    {
      "text": "Oğuz Turan Buruk and Oğuzhan Özcan. 2018. Extracting design guidelines for wearables and movement in tabletop role-playing games via a research through design process. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174087",
      "doi": ""
    },
    {
      "text": "Linda F. Campbell, John C. Norcross, Melba J. T. Vasquez, and Nadine J. Kaslow. 2013. Recognition of psychotherapy effectiveness: The APA resolution. Psychotherapy (Chicago, Ill.) 50, 1 (March 2013), 98–101. https://doi.org/10.1037/a0031817",
      "doi": ""
    },
    {
      "text": "Valerie A. Canady. 2020. FDA approves first video game Rx treatment for children with ADHD. Mental Health Weekly 30, 26 (2020), 1–7. https://doi.org/10.1002/mhw.32423",
      "doi": ""
    },
    {
      "text": "Adolfo J. Cangas, Noelia Navarro, José M. A. Parra, Juan J. Ojeda, Diego Cangas, Jose A. Piedra, and Jose Gallego. 2017. Stigma-stop: A serious game against the stigma toward mental health in educational settings. Frontiers in Psychology 8 (Aug. 2017), 1385. https://doi.org/10.3389/fpsyg.2017.01385",
      "doi": ""
    },
    {
      "text": "Tolga Ceranoglu. 2010. Video games in psychotherapy. Review of General Psychology 14 (June 2010), 141. https://doi.org/10.1037/a0019439",
      "doi": ""
    },
    {
      "text": "Rosanna Chapman, Maria Loades, Gary O’Reilly, David Coyle, Mags Patterson, and Paul Salkovskis. 2016. ‘Pesky gNATs’: Investigating the feasibility of a novel computerized CBT intervention for adolescents with anxiety and/or depression in a tier 3 CAMHS setting. The Cognitive Behaviour Therapist 9 (2016).",
      "doi": ""
    },
    {
      "text": "Cory K. Chen, Nicole Nehrig, Lauren Wash, Jennifer A. Schneider, Sagiv Ashkenazi, Elana Cairo, Angel F. Guyton, and Amy Palfrey. 2020. When distance brings us closer: Leveraging tele-psychotherapy to build deeper connection. Counselling Psychology Quarterly 0, 0 (June 2020), 1–14. https://doi.org/10.1080/09515070.2020.1779031",
      "doi": ""
    },
    {
      "text": "Vanessa Wan Sze Cheng, Tracey Davenport, Daniel Johnson, Kellie Vella, and Ian B. Hickie. 2019. Gamification in apps and technologies for improving mental health and well-being: Systematic review. JMIR mental health 6, 6 (June 2019), e13717. https://doi.org/10.2196/13717",
      "doi": ""
    },
    {
      "text": "Kristen R. Choi, MarySue V. Heilemann, Alex Fauer, and Meredith Mead. 2020. A second pandemic: Mental health spillover from the novel Coronavirus (COVID-19). Journal of the American Psychiatric Nurses Association 26, 4 (Aug. 2020), 340–343. https://doi.org/10.1177/1078390320919803",
      "doi": ""
    },
    {
      "text": "Grant I. Christie, Matthew Shepherd, Sally N. Merry, Sarah Hopkins, Stephen Knightly, and Karolina Stasiak. 2019. Gamifying CBT to deliver emotional health treatment to young people on smartphones. Internet Interventions 18 (Dec. 2019), 100286. https://doi.org/10.1016/j.invent.2019.100286",
      "doi": ""
    },
    {
      "text": "Marie-Laure Cléry-Melin, Fabrice Jollant, and Philip Gorwood. 2019. Reward systems and cognitions in major depressive disorder. CNS spectrums 24, 1 (Feb. 2019), 64–77. https://doi.org/10.1017/S1092852918001335",
      "doi": ""
    },
    {
      "text": "Kyaien O. Conner, Valire Carr Copeland, Nancy K. Grote, Gary Koeske, Daniel Rosen, Charles F. Reynolds, and Charlotte Brown. 2010. Mental health treatment seeking among older adults with depression: The impact of stigma and race. The American Journal of Geriatric Psychiatry 18, 6 (June 2010), 531–543. https://doi.org/10.1097/JGP.0b013e3181cc0366",
      "doi": ""
    },
    {
      "text": "M.F. Costabile, D. Fogli, P. Mussio, and A. Piccinno. 2005. A meta-design approach to end-user development. In 2005 IEEE Symposium on Visual Languages and Human-Centric Computing (VL/HCC’05). 308–310. https://doi.org/10.1109/VLHCC.2005.7 ISSN: 1943-6106.",
      "doi": "10.1109/VLHCC.2005.7"
    },
    {
      "text": "David Coyle and Gavin Doherty. 2009. Clinical evaluations and collaborative design: Developing new technologies for mental healthcare interventions. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2051–2060. https://doi.org/10.1145/1518701.1519013",
      "doi": "10.1145/1518701.1519013"
    },
    {
      "text": "David Coyle, Hidde van der Meulen, Connal Tunney, Patricia Cooney, and Catherine Jackman. 2017. Pesky gNATs: Using games to support mental health interventions for adolescents. ACM. https://researchrepository.ucd.ie/handle/10197/9310",
      "doi": ""
    },
    {
      "text": "Tisha L. Deen, John C. Fortney, and Gary Schroeder. 2013. Patient acceptance of and initiation and engagement in telepsychotherapy in primary care. Psychiatric Services 64, 4 (April 2013), 380–384. https://doi.org/10.1176/appi.ps.201200198 Publisher: American Psychiatric Publishing.",
      "doi": ""
    },
    {
      "text": "Sebastian Deterding, Dan Dixon, Rilla Khaled, and Lennart Nacke. 2011. From game design elements to gamefulness: Defining ”gamification”. In Proceedings of the 15th International Academic MindTrek Conference: Envisioning Future Media Environments(MindTrek ’11). Association for Computing Machinery, New York, NY, USA, 9–15. https://doi.org/10.1145/2181037.2181040",
      "doi": "10.1145/2181037.2181040"
    },
    {
      "text": "Holger Dick, Hal Eden, Gerhard Fischer, and Jason Zietz. 2012. Empowering users to become designers: Using meta-design environments to enable and motivate sustainable energy decisions. In Proceedings of the 12th Participatory Design Conference: Exploratory Papers, Workshop Descriptions, Industry Cases - Volume 2(PDC ’12). Association for Computing Machinery, New York, NY, USA, 49–52. https://doi.org/10.1145/2348144.2348160",
      "doi": "10.1145/2348144.2348160"
    },
    {
      "text": "Christiane Eichenberg and Markus Schott. 2017. Serious games for psychotherapy: A systematic review. Games for Health Journal 6, 3 (June 2017), 127–135. https://doi.org/10.1089/g4h.2016.0068",
      "doi": ""
    },
    {
      "text": "Magy Seif El-Nasr, Anders Drachen, and Alessandro Canossa. 2016. Game analytics. Springer.",
      "doi": ""
    },
    {
      "text": "Nick Errington-Evans. 2012. Acupuncture for anxiety. CNS Neuroscience & Therapeutics 18, 4 (2012), 277–284. https://doi.org/10.1111/j.1755-5949.2011.00254.x",
      "doi": ""
    },
    {
      "text": "Borna Fatehi, Christoffer Holmgård, Sam Snodgrass, and Casper Harteveld. 2019. Gamifying psychological assessment: Insights from gamifying the thematic apperception test. In Proceedings of the 14th International Conference on the Foundations of Digital Games. 1–12.",
      "doi": "10.1145/3337722.3337737"
    },
    {
      "text": "Gerhard Fischer and Elisa Giaccardi. 2006. Meta-design: A framework for the future of end-user development. In End User Development, Henry Lieberman, Fabio Paternò, and Volker Wulf (Eds.). Springer Netherlands, Dordrecht, 427–457. https://doi.org/10.1007/1-4020-5386-X_19",
      "doi": ""
    },
    {
      "text": "G. Fischer, E. Giaccardi, Y. Ye, A. G. Sutcliffe, and N. Mehandjiev. 2004. Meta-design: A manifesto for end-user development. Commun. ACM 47, 9 (Sept. 2004), 33–37. https://doi.org/10.1145/1015864.1015884",
      "doi": "10.1145/1015864.1015884"
    },
    {
      "text": "Gerhard Fischer and Eric Scharff. 2000. Meta-design: Design for designers. In Proceedings of the 3rd conference on Designing interactive systems: processes, practices, methods, and techniques(DIS ’00). Association for Computing Machinery, New York, NY, USA, 396–405. https://doi.org/10.1145/347642.347798",
      "doi": "10.1145/347642.347798"
    },
    {
      "text": "Martin Fitzgerald and Gemma Ratcliffe. 2020. Serious games, gamification, and serious mental illness: A scoping review. Psychiatric Services 71, 2 (Feb. 2020), 170–183. https://doi.org/10.1176/appi.ps.201800567 Publisher: American Psychiatric Publishing.",
      "doi": ""
    },
    {
      "text": "Theresa M Fleming, Lynda Bavin, Karolina Stasiak, Eve Hermansson-Webb, Sally N Merry, Colleen Cheek, Mathijs Lucassen, Ho Ming Lau, Britta Pollmuller, and Sarah Hetrick. 2017. Serious games and gamification for mental health: Current status and promising directions. Frontiers in psychiatry 7 (2017), 215.",
      "doi": ""
    },
    {
      "text": "Elisa Giaccardi and Gerhard Fischer. 2008. Creativity and evolution: A metadesign perspective. Digital Creativity 19, 1 (March 2008), 19–32. https://doi.org/10.1080/14626260701847456",
      "doi": ""
    },
    {
      "text": "Alison J Gray. 2002. Stigma in psychiatry. Journal of the Royal Society of Medicine 95, 2 (Feb. 2002), 72–76. https://doi.org/10.1177/014107680209500205 Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Eric J. Green. 2014. The handbook of Jungian play therapy with children and adolescents. Johns Hopkins University Press, Baltimore, MD, US. Pages: xxiv, 177.",
      "doi": ""
    },
    {
      "text": "Matthew Guzdial, Nicholas Liao, Jonathan Chen, Shao-Yu Chen, Shukan Shah, Vishwa Shah, Joshua Reno, Gillian Smith, and Mark O. Riedl. 2019. Friend, collaborator, student, manager: How design of an AI-driven game level editor affects creators. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300854",
      "doi": "10.1145/3290605.3300854"
    },
    {
      "text": "Jacob Habgood and Mark Overmars. 2006. The game maker’s apprentice: Game development for beginners. Apress.",
      "doi": ""
    },
    {
      "text": "Kami Hanson and Brett E. Shelton. 2008. Design and development of virtual reality: Analysis of challenges faced by educators. Journal of Educational Technology & Society 11, 1 (2008), 118–131. https://www.jstor.org/stable/jeductechsoci.11.1.118 Publisher: International Forum of Educational Technology & Society.",
      "doi": ""
    },
    {
      "text": "Vicki L Hanson. 2009. Age and web access: the next generation. In Proceedings of the 2009 International Cross-Disciplinary Conference on Web Accessibililty (W4A). 7–15.",
      "doi": "10.1145/1535654.1535658"
    },
    {
      "text": "Casper Harteveld. 2011. Triadic game design: Balancing reality, meaning and play. Springer-Verlag, London. https://doi.org/10.1007/978-1-84996-157-8",
      "doi": "10.5555/1972536"
    },
    {
      "text": "Casper Harteveld, Sam Snodgrass, Omid Mohaddesi, Jack Hart, Tyler Corwin, and Guillermo Rodriguez. 2018. The development of a methodology for gamifying surveys. 461–467. https://doi.org/10.1145/3270316.3271544",
      "doi": ""
    },
    {
      "text": "Scarlett R Herring, Chia-Chen Chang, Jesse Krantzler, and Brian P Bailey. 2009. Getting inspired!: Understanding how and why examples are used in creative design practice. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. ACM, 87–96.",
      "doi": "10.1145/1518701.1518717"
    },
    {
      "text": "Scarlett R Herring, Brett R Jones, and Brian P Bailey. 2009. Idea generation techniques among creative professionals. In 2009 42nd Hawaii International Conference on System Sciences. IEEE, 1–10.",
      "doi": "10.1109/HICSS.2009.241"
    },
    {
      "text": "Michel Ed Hersen and William Ed Sledge. 2002. Encyclopedia of psychotherapy, Vol. 2: IZ. Academic Press.",
      "doi": ""
    },
    {
      "text": "Emily A. Holmes, Ella L. James, Thomas Coode-Bate, and Catherine Deeprose. 2009. Can playing the computer game ”Tetris” reduce the build-up of flashbacks for trauma? A proposal from cognitive science. PloS One 4, 1 (2009), e4153. https://doi.org/10.1371/journal.pone.0004153",
      "doi": ""
    },
    {
      "text": "H. Lynn Horne-Moyer, Brian H. Moyer, Drew C. Messer, and Elizabeth S. Messer. 2014. The use of electronic games in therapy: A review with clinical implications. Current Psychiatry Reports 16, 12 (2014), 520. https://doi.org/10.1007/s11920-014-0520-6",
      "doi": ""
    },
    {
      "text": "Hsiu-Fang Hsieh and Sarah E. Shannon. 2005. Three approaches to qualitative content analysis. Qualitative Health Research 15, 9 (Nov. 2005), 1277–1288. https://doi.org/10.1177/1049732305276687 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Jason K Hsu, Richard Thibodeau, Stephanie J Wong, Daniel Zukiwsky, Sara Cecile, and David M Walton. 2011. A “Wii” bit of fun: The effects of adding Nintendo Wii® Bowling to a standard exercise regimen for residents of long-term care with upper extremity dysfunction. Physiotherapy Theory and Practice 27, 3 (April 2011), 185–193. https://doi.org/10.3109/09593985.2010.483267",
      "doi": ""
    },
    {
      "text": "Dilwar Hussain. 2015. Meta-cognition in mindfulness: A conceptual analysis. (Oct. 2015). https://doi.org/10.23668/psycharchives.1972",
      "doi": ""
    },
    {
      "text": "Nithesh Javvaji, Casper Harteveld, and Magy Seif El-Nasr. 2020. Understanding player patterns by combining knowledge-based data abstraction with interactive visualization. In Proceedings of the Annual Symposium on Computer-Human Interaction in Play. 254–266.",
      "doi": "10.1145/3410404.3414257"
    },
    {
      "text": "Yasmin B. Kafai. 2006. Playing and making games for learning: Instructionist and constructionist perspectives for game studies. Games and Culture 1, 1 (Jan. 2006), 36–40. https://doi.org/10.1177/1555412005281767 Publisher: SAGE Publications.",
      "doi": ""
    },
    {
      "text": "Pamela M. Kato. 2010. Video games in health care: Closing the gap. Review of General Psychology 14, 2 (June 2010), 113–121. https://doi.org/10.1037/a0019441 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Alan E. Kazdin and Stacey L. Blase. 2011. Rebooting psychotherapy research and practice to reduce the burden of mental illness. Perspectives on Psychological Science 6, 1 (Jan. 2011), 21–37. https://doi.org/10.1177/1745691610393527 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Fengfeng Ke. 2008. A case study of computer gaming for math: Engaged learning from gameplay?Computers & Education 51, 4 (Dec. 2008), 1609–1620. https://doi.org/10.1016/j.compedu.2008.03.003",
      "doi": ""
    },
    {
      "text": "Jarrod Kelly. 2020. Level up: Using gamification to improve student evaluation and motivation. (Feb. 2020). https://doi.org/10.33774/apsa-2020-0cxhs",
      "doi": ""
    },
    {
      "text": "Sarah J Kertz, J MacLaren Kelly, Kimberly T Stevens, Matthew Schrock, and Sara B Danitz. 2017. A review of free iPhone applications designed to target anxiety and worry. Journal of Technology in Behavioral Science 2, 2 (2017), 61–70.",
      "doi": ""
    },
    {
      "text": "Rilla Khaled and Asimina Vasalou. 2014. Bridging serious games and participatory design. International Journal of Child-Computer Interaction 2, 2 (May 2014), 93–100. https://doi.org/10.1016/j.ijcci.2014.03.001",
      "doi": "10.1016/j.ijcci.2014.03.001"
    },
    {
      "text": "Batul Khodakarami, Farzaneh Soltani, Golalizadeh Golalizadeh, Alireza Soltanian, and Hussein Mohagheghi. 2015. The effect of spiritual counseling on depression, anxiety and stress of pregnant women: A randomized clinical trial. Avicenna Journal of Nursing and Midwifery Care 23, 4 (Dec. 2015), 39–53. http://nmj.umsha.ac.ir/article-1-1429-en.html Publisher: Avicenna Journal of Nursing and Midwifery Care.",
      "doi": ""
    },
    {
      "text": "Scott H. Kollins, Denton J. DeLoss, Elena Cañadas, Jacqueline Lutz, Robert L. Findling, Richard S. E. Keefe, Jeffery N. Epstein, Andrew J. Cutler, and Stephen V. Faraone. 2020. A novel digital intervention for actively reducing severity of paediatric ADHD (STARS-ADHD): A randomised controlled trial. The Lancet. Digital Health 2, 4 (April 2020), e168–e178. https://doi.org/10.1016/S2589-7500(20)30017-0",
      "doi": ""
    },
    {
      "text": "Anton Käll, Sofia Jägholm, Hugo Hesser, Frida Andersson, Aleksi Mathaldi, Beatrice Tiger Norkvist, Roz Shafran, and Gerhard Andersson. 2020. Internet-based cognitive behavior therapy for loneliness: A pilot randomized controlled trial. Behavior Therapy 51, 1 (Jan. 2020), 54–68. https://doi.org/10.1016/j.beth.2019.05.001",
      "doi": ""
    },
    {
      "text": "Robert L Leahy. 2017. Cognitive therapy techniques: A practitioner’s guide. Guilford Publications.",
      "doi": ""
    },
    {
      "text": "Sherman A Lee, Amanda A Mathis, Mary C Jobe, and Emily A Pappalardo. 2020. Clinically significant fear and anxiety of COVID-19: A psychometric examination of the Coronavirus Anxiety Scale. Psychiatry research 290(2020), 113112.",
      "doi": ""
    },
    {
      "text": "Zakkoyya H. Lewis, Maria C. Swartz, and Elizabeth J. Lyons. 2016. What’s the point?: A review of reward systems implemented in gamification interventions. Games for Health Journal 5, 2 (April 2016), 93–99. https://doi.org/10.1089/g4h.2015.0078 Publisher: Mary Ann Liebert, Inc., publishers.",
      "doi": ""
    },
    {
      "text": "Robert C. Lorenz, Tobias Gleich, Jürgen Gallinat, and Simone Kühn. 2015. Video game training and the reward system. Frontiers in Human Neuroscience 9 (2015), 40. https://doi.org/10.3389/fnhum.2015.00040",
      "doi": ""
    },
    {
      "text": "Wolfgang Lutz, Dirk Zimmermann, Viola NLS Müller, Anne-Katharina Deisenhofer, and Julian A Rubel. 2017. Randomized controlled trial to evaluate the effects of personalized prediction and adaptation tools on treatment outcome in outpatient psychotherapy: study protocol. BMC psychiatry 17, 1 (2017), 1–11.",
      "doi": ""
    },
    {
      "text": "Eilidh Macleod and Robin J. S. Sloan. 2017. Recover: Designing a videogame to assist with recovery from PTSD. https://rke.abertay.ac.uk/en/publications/recover-designing-a-videogame-to-assist-with-recovery-from-ptsd",
      "doi": ""
    },
    {
      "text": "Cathy A. Malchiodi. 2006. Expressive therapies. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Cathy A. Malchiodi. 2012. Art therapy and health care. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Nicole Martinez-Martin and Karola Kreitmair. 2018. Ethical issues for direct-to-consumer digital psychotherapy apps: Addressing accountability, data protection, and consent. JMIR mental health 5, 2 (2018), e32.",
      "doi": ""
    },
    {
      "text": "Maria Matsangidou, Boris Otkhmezuri, Chee Siang Ang, Marios Avraamides, Giuseppe Riva, Andrea Gaggioli, Despoina Iosif, and Maria Karekla. 2020. “Now i can see me” designing a multi-user virtual reality remote psychotherapy for body weight and shape concerns. Human–Computer Interaction (Oct. 2020), 1–27. https://doi.org/10.1080/07370024.2020.1788945",
      "doi": ""
    },
    {
      "text": "Annabel McDonald, Jessica A. Eccles, Sanaz Fallahkhair, and Hugo D. Critchley. 2020. Online psychotherapy: Trailblazing digital healthcare. BJPsych Bulletin 44, 2 (April 2020), 60–66. https://doi.org/10.1192/bjb.2019.66 Publisher: Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Sally N. Merry, Karolina Stasiak, Matthew Shepherd, Chris Frampton, Theresa Fleming, and Mathijs F. G. Lucassen. 2012. The effectiveness of SPARX, a computerised self help intervention for adolescents seeking help for depression: Randomised controlled non-inferiority trial. BMJ : British Medical Journal(2012). https://doi.org/10.1136/bmj.e2598",
      "doi": ""
    },
    {
      "text": "Adriana S. Miu, Hoa T. Vo, Jayme M. Palka, Christopher R. Glowacki, and Reed J. Robinson. 2020. Teletherapy with serious mental illness populations during COVID-19: Telehealth conversion and engagement. Counselling Psychology Quarterly 0, 0 (July 2020), 1–18. https://doi.org/10.1080/09515070.2020.1791800",
      "doi": ""
    },
    {
      "text": "Omid Mohaddesi, Yifan Sun, Rana Azghandi, Rozhin Doroudi, Sam Snodgrass, Ozlem Ergun, Jacqueline Griffin, David Kaeli, Stacy Marsella, and Casper Harteveld. 2020. Introducing gamettes: A playful approach for capturing decision-making for informing behavioral models. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376571"
    },
    {
      "text": "David L. Morgan. 1993. Qualitative content analysis: A guide to paths not taken. Qualitative Health Research 3, 1 (Feb. 1993), 112–121. https://doi.org/10.1177/104973239300300107 Publisher: SAGE Publications Inc.",
      "doi": ""
    },
    {
      "text": "Larry D Morries, Paolo Cassano, and Theodore A Henderson. 2015. Treatments for traumatic brain injury with emphasis on transcranial near-infrared laser phototherapy. Neuropsychiatric Disease and Treatment 11 (Aug. 2015), 2159–2175. https://doi.org/10.2147/NDT.S65809",
      "doi": ""
    },
    {
      "text": "Benedikt Morschheuser, Lobna Hassan, Karl Werder, and Juho Hamari. 2018. How to design gamification? A method for engineering gamified software. Information and Software Technology 95 (March 2018), 219–237. https://doi.org/10.1016/j.infsof.2017.10.015",
      "doi": ""
    },
    {
      "text": "Siti Azreena Mubin and Matthew Wee Ann Poh. 2019. A review on gamification design framework: How they incorporated for autism children. In 2019 4th International Conference and Workshops on Recent Advances and Innovations in Engineering (ICRAIE). 1–4. https://doi.org/10.1109/ICRAIE47735.2019.9037765",
      "doi": ""
    },
    {
      "text": "Melinda Mueller and Gene Pekarik. 2000. Treatment duration prediction: Client accuracy and its relationship to dropout, outcome, and satisfaction.Psychotherapy: Theory, Research, Practice, Training 37, 2 (2000), 117.",
      "doi": ""
    },
    {
      "text": "Joanna Nieznaj. 2021. Gamification for the long-term unemployed youth : Digital concept ideas for increasing motivation in the Swedish Welfare System. http://urn.kb.se/resolve?urn=urn:nbn:se:liu:diva-177665",
      "doi": ""
    },
    {
      "text": "Laura Ospina-Pinillos, Tracey Davenport, Antonio Mendoza Diaz, Alvaro Navarro-Mancilla, Elizabeth M. Scott, and Ian B. Hickie. 2019. Using participatory design methodologies to co-design and culturally adapt the spanish version of the mental health eClinic: Qualitative study. Journal of Medical Internet Research 21, 8 (Aug. 2019), e14127. https://doi.org/10.2196/14127 Publisher: JMIR Publications Inc., Toronto, Canada.",
      "doi": ""
    },
    {
      "text": "Sagar V. Parikh, Zindel V. Segal, Sophie Grigoriadis, Arun V. Ravindran, Sidney H. Kennedy, Raymond W. Lam, and Scott B. Patten. 2009. Canadian network for mood and anxiety treatments (CANMAT) clinical guidelines for the management of major depressive disorder in adults. II. Psychotherapy alone or in combination with antidepressant medication. Journal of Affective Disorders 117 (Oct. 2009), S15–S25. https://doi.org/10.1016/j.jad.2009.06.042",
      "doi": ""
    },
    {
      "text": "Lane Pederson and Cortney Sidwell Pederson. 2012. The expanded dialectical behavior therapy skills training manual: Practical DBT for self-help, and individual and group treatment settings. PESI Publishing & Media.",
      "doi": ""
    },
    {
      "text": "Cody Phillips, Madison Klarkowski, Julian Frommel, Carl Gutwin, and Regan L. Mandryk. 2021. Identifying commercial games with therapeutic potential through a content analysis of Steam reviews. Proceedings of the ACM on Human-Computer Interaction 5, CHI PLAY (Oct. 2021), 255:1–255:21. https://doi.org/10.1145/3474682",
      "doi": "10.1145/3474682"
    },
    {
      "text": "Barbara Poletti, Sofia Tagini, Agostino Brugnera, Laura Parolin, Luca Pievani, Roberta Ferrucci, Angelo Compare, and Vincenzo Silani. 2020. Telepsychotherapy: A leaflet for psychotherapists in the age of COVID-19. A review of the evidence. Counselling Psychology Quarterly 0, 0 (May 2020), 1–16. https://doi.org/10.1080/09515070.2020.1769557",
      "doi": ""
    },
    {
      "text": "Octavian Postolache, Filipe Lourenço, J. M. Dias Pereira, and Pedro Girão. 2017. Serious game for physical rehabilitation: Measuring the effectiveness of virtual and real training environments. In 2017 IEEE International Instrumentation and Measurement Technology Conference (I2MTC). 1–6. https://doi.org/10.1109/I2MTC.2017.7969978",
      "doi": ""
    },
    {
      "text": "Brenna N. Renn, Theresa J. Hoeft, Heather Sophia Lee, Amy M. Bauer, and Patricia A. Areán. 2019. Preference for in-person psychotherapy versus digital psychotherapy options for depression: Survey of adults in the U.S. npj Digital Medicine 2, 1 (Feb. 2019), 1–7. https://doi.org/10.1038/s41746-019-0077-1 Publisher: Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Mark Owen Riedl and Vadim Bulitko. 2013. Interactive narrative: An intelligent systems approach. AI Magazine 34, 1 (2013), 67–67. https://doi.org/10.1609/aimag.v34i1.2449 Number: 1.",
      "doi": ""
    },
    {
      "text": "Andrew Rollings and Dave Morris. 1999. Game architecture and design. Paraglyph Pr.",
      "doi": ""
    },
    {
      "text": "Sy Atezaz Saeed, Diana J. Antonacci, and Richard M. Bloch. 2010. Exercise, yoga, and meditation for depressive and anxiety disorders. American Family Physician 81, 8 (April 2010), 981–986. https://www.aafp.org/afp/2010/0415/p981.html",
      "doi": ""
    },
    {
      "text": "Noor Shaker, Julian Togelius, and Mark J. Nelson. 2016. Procedural content generation in games (1st ed. 2016 edition ed.). Springer, New York, NY.",
      "doi": ""
    },
    {
      "text": "Yoav Shoham. 2008. Computer science and game theory. Commun. ACM 51, 8 (Aug. 2008), 74–79. https://doi.org/10.1145/1378704.1378721",
      "doi": "10.1145/1378704.1378721"
    },
    {
      "text": "Leslie Sokol and Marci Fox. 2019. The comprehensive clinician’s guide to cognitive behavioral therapy. Pesi.",
      "doi": ""
    },
    {
      "text": "Norbert Streitz, Panos Markopoulos, and Shin’ichi Konomi. 2020. Distributed, ambient and pervasive interactions: 8th international conference, DAPI 2020, held as part of the 22nd HCI international conference, HCII 2020, Copenhagen, Denmark, July 19-24, 2020, proceedings. Springer Nature.",
      "doi": ""
    },
    {
      "text": "Steven C Sutherland, Casper Harteveld, Gillian Smith, Joseph Schwartz, and Cigdem Talgar. 2015. Exploring digital games as a research and educational platform for replicating experiments. In NEDSI Conference.",
      "doi": ""
    },
    {
      "text": "J Szer. 1983. Video games as physiotherapy. The Medical Journal of Australia 1, 9 (April 1983), 401–402. https://doi.org/10.5694/j.1326-5377.1983.tb136123.x",
      "doi": ""
    },
    {
      "text": "Apphia Jia Qi Tan, Cindy Ching Siang Lee, Patrick Yongxing Lin, Simon Cooper, Lydia Siew Tiang Lau, Wei Ling Chua, and Sok Ying Liaw. 2017. Designing and evaluating the effectiveness of a serious game for safe administration of blood transfusion: A randomized controlled trial. Nurse Education Today 55 (Aug. 2017), 38–44. https://doi.org/10.1016/j.nedt.2017.04.027",
      "doi": ""
    },
    {
      "text": "Katie Salen Tekinbaş and Eric Zimmerman. 2003. Rules of play: Game design fundamentals. MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Elina Tochilnikova. 2020. Towards a general theory of boredom(1st edition ed.). Routledge.",
      "doi": ""
    },
    {
      "text": "Giovanni Maria Troiano, Qinyu Chen, Ángela Vargas Alba, Gregorio Robles, Gillian Smith, Michael Cassidy, Eli Tucker-Raymond, Gillian Puttick, and Casper Harteveld. 2020. Exploring how game genre in student-designed games influences computational thinking development. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–17. https://doi.org/10.1145/3313831.3376755",
      "doi": "10.1145/3313831.3376755"
    },
    {
      "text": "Giovanni M Troiano, Matthew Wood, Mustafa Feyyaz Sonbudak, Riddhi Chandan Padte, and Casper Harteveld. 2021. Are we now post-COVID?: Exploring post-COVID futures through a gamified story completion method. In Designing Interactive Systems Conference 2021(DIS ’21). Association for Computing Machinery, New York, NY, USA, 48–63. https://doi.org/10.1145/3461778.3462069",
      "doi": "10.1145/3461778.3462069"
    },
    {
      "text": "Jack Tsai, Minda Huang, Billy Huang, Kathleen Daniels, Casper Harteveld, and Dan Jackson. 2020. Psychosocial and mental health characteristics of RePresent game users.The journal of the American Academy of Psychiatry and the Law (2020).",
      "doi": ""
    },
    {
      "text": "Veronica Tucci and Nidal Moukaddam. 2017. We are the hollow men: The worldwide epidemic of mental illness, psychiatric and behavioral emergencies, and its impact on patients and providers. Journal of Emergencies, Trauma, and Shock 10, 1 (2017), 4–6. https://doi.org/10.4103/0974-2700.199517",
      "doi": ""
    },
    {
      "text": "Anouk Tuijnman, Isabela Granic, Josh Whitkin, and Rutger C.M.E. Engels. 2017. Developing and testing ScrollQuest: A video game targeting rejection sensitivity in adolescents. In Extended Abstracts Publication of the Annual Symposium on Computer-Human Interaction in Play(CHI PLAY ’17 Extended Abstracts). Association for Computing Machinery, New York, NY, USA, 213–221. https://doi.org/10.1145/3130859.3131302",
      "doi": "10.1145/3130859.3131302"
    },
    {
      "text": "Bhavika Vajawat, Prateek Varshney, and Debanjan Banerjee. 2021. Digital gaming interventions in psychiatry: Evidence, applications and challenges. Psychiatry Research 295(2021), 113585.",
      "doi": ""
    },
    {
      "text": "Jan Van Dijk. 2020. The digital divide. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Christian A. Webb, Isabelle M. Rosso, and Scott L. Rauch. 2017. Internet-based cognitive behavioral therapy for depression: Current progress & future directions. Harvard Review of Psychiatry 25, 3 (2017), 114–122. https://doi.org/10.1097/HRP.0000000000000139",
      "doi": ""
    },
    {
      "text": "Brenda K. Wiederhold, Ian T. Miller, and Mark D. Wiederhold. 2018. Using virtual reality to mobilize health care: Mobile virtual reality technology for attenuation of anxiety and pain. IEEE Consumer Electronics Magazine 7, 1 (Jan. 2018), 106–109. https://doi.org/10.1109/MCE.2017.2715365 Conference Name: IEEE Consumer Electronics Magazine.",
      "doi": ""
    },
    {
      "text": "Lea Winerman. 2017. The cost of treatment. http://www.apa.org/monitor/2017/03/numbers",
      "doi": ""
    },
    {
      "text": "Victoria Wochna Loerzel, John M. Clochesy, and Patricia I. Geddie. 2020. Using serious games to increase prevention and self-management of chemotherapy-induced nausea and vomiting in older adults with cancer. Oncology Nursing Forum 47, 5 (Sept. 2020), 567–576. https://doi.org/10.1188/20.ONF.567-576",
      "doi": ""
    },
    {
      "text": "Michael Wright, Mary Marlino, and Tamara Sumner. 2002. Meta-design of a community digital library. D-Lib Magazine 8, 5 (May 2002). https://doi.org/10.1045/may2002-wright",
      "doi": ""
    },
    {
      "text": "Irvin D. Yalom. 2020. Existential psychotherapy. Hachette UK.",
      "doi": ""
    },
    {
      "text": "Sigal Zilcha-Mano. 2021. Toward personalized psychotherapy: The importance of the trait-like/state-like distinction for understanding therapeutic change.American Psychologist 76, 3 (2021), 516.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research through design as a method for interaction design research in HCI. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 493–502. https://doi.org/10.1145/1240624.1240704",
      "doi": "10.1145/1240624.1240704"
    }
  ]
}