{
  "doi": "10.1145/3491102.3502051",
  "title": "FlexNav: Flexible Navigation and Exploration through Connected Runnable Zones",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "Runners want to actively explore unknown environments without the fear of getting lost. We conducted a survey to better understand runners’ needs and practices in this context. The survey results emphasized the interest in flexible exploration. To address this interest, we designed FlexNav, a system that supports exploratory running through flexible tours that link the best runnable zones in a neighbourhood. FlexNav provides adaptive navigation support enabling runners to follow such tours without continually getting disruptive directions. We tested it with runners to assess its usability. The results confirm the usefulness of the system and the users' preference for flexible tours over fully specified tours with turn-by-turn guidance. Our study highlights the subjective nature of runnable zones and the subtle balance between guidance and exploration.",
  "authors": [
    {
      "name": "Jutta Katharina Willamowski",
      "institution": "UX and Ethnography, Naver Labs Europe, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234628",
      "orcid": "missing"
    },
    {
      "name": "Shreepriya Gonzalez-Jimenez",
      "institution": "UX and Ethnography, Naver Labs Europe, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660021597",
      "orcid": "missing"
    },
    {
      "name": "Christophe Legras",
      "institution": "Naver Labs Europe, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659134005",
      "orcid": "missing"
    },
    {
      "name": "Danilo Gallo",
      "institution": "UX and ethnography, Naver Labs Europe, France",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441870",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Benedikt Loepp and Jürgen Ziegler. Recommending Running Routes: Framework and Demonstrator. ",
      "doi": ""
    },
    {
      "text": "David K. McGookin and Stephen A. Brewster. 2013. Investigating and Supporting Undirected Navigation for Runners. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’13), 1395–1400. https://doi.org/10.1145/2468356.2468605",
      "doi": ""
    },
    {
      "text": "Damien Mercier. 2016. PleasantTourFinder: an application to find the most pleasant tour from a given location. Ecole polytechnique de Louvain, Université catholique de Louvain. Prom. : Schaus, Pierre.",
      "doi": ""
    },
    {
      "text": "Danilo Gallo, Shreepriya Shreepriya, and Jutta Willamowski. 2020. RunAhead: Exploring Head Scanning based Navigation for Runners. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–13. DOI: https://doi.org/10.1145/3313831.3376828 ",
      "doi": "10.1145/3313831.3376828"
    },
    {
      "text": "MapMyRun. Retrieved 7 May 2021 from https://www.mapmyrun.com/app",
      "doi": ""
    },
    {
      "text": "Garmin. Retrieved 7 May 2021 from https://www.garmin.com",
      "doi": ""
    },
    {
      "text": "Strava. Retrieved 7 May 2021 from https://www.strava.com/",
      "doi": ""
    },
    {
      "text": "Schwartz, Mathew. (2020). Evaluating Jogging Routes in Mass Models.",
      "doi": ""
    },
    {
      "text": "Andreas Komninos, Peter Barrie, Vassilios Stefanis, and Athanasios Plessas. 2012. Urban Exploration Using Audio Scents. In Proceedings of the 14th International Conference on Human-computer Interaction with Mobile Devices and Services (MobileHCI ’12), 349–358. https://doi.org/10.1145/2371574.2371629",
      "doi": "10.1145/2371574.2371629"
    },
    {
      "text": "Apple Maps. Retrieved on May 7, 2021, from https://www.apple.com/maps/.",
      "doi": ""
    },
    {
      "text": "Martin Pielot and Susanne Boll. 2010. Tactile Wayfinder: Comparison of Tactile Waypoint Navigation with Commercial Pedestrian Navigation Systems. In Proceedings of the 8th International Conference on Pervasive Computing (Pervasive’10), 76–93. https://doi.org/10.1007/978-3-642-12654-3_5",
      "doi": "10.1007/978-3-642-12654-3_5"
    },
    {
      "text": "Martin Pielot, Benjamin Poppinga, Wilko Heuten, and Susanne Boll. 2011. A Tactile Compass for Eyes-free Pedestrian Navigation. In Proceedings of the 13th IFIP TC 13 International Conference on Human-computer Interaction – Volume Part II (INTERACT’11), 640–656. Retrieved February 7, 2019 from http://dl.acm.org/citation.cfm?id=2042118.2042179",
      "doi": "10.5555/2042118.2042179"
    },
    {
      "text": "Haska Steltenpohl and Anders Bouwer. 2013. Vibrobelt: Tactile Navigation Support for Cyclists. In Proceedings of the 2013 International Conference on Intelligent User Interfaces (IUI ’13), 417–426. https://doi.org/10.1145/2449396.2449450",
      "doi": "10.1145/2449396.2449450"
    },
    {
      "text": "Sofia Michel, Stephane Clinchant, Christophe Legras, and Jutta Willamowski. 2020. System and method for generating pedestrian tours. Retrieved May 7, 2021 from https://patents.google.com/patent/US20200309545A1/en/",
      "doi": ""
    },
    {
      "text": "Suunto 7 smartwatch. Retrieved on May 7, 2021 from https://www.suunto.com/Products/sports-watches/suunto-7/suunto-7-black/#key-features-2",
      "doi": ""
    },
    {
      "text": "Android studio. Retrieved on May 7, 2021 from https://developer.android.com/studio",
      "doi": ""
    },
    {
      "text": "Mapbox Maps SDK for Android. Retrieved on May 7, 2021 from https://docs.mapbox.com/android/maps/guides/",
      "doi": ""
    },
    {
      "text": "Voice RSS Text-to-Speech API. Retrieved on May 7, 2021 from http://www.voicerss.org/api/",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Kathy Charmaz. 2014. Constructing grounded theory. sage.",
      "doi": ""
    },
    {
      "text": "Emily Webber, Gary Burnett, and Jeremy Morley. 2012. Pedestrian navigation with a mobile device: strategy use and environmental learning. In Proceedings of the 26th Annual BCS Interaction Specialist Group Conference on People and Computers (BCS-HCI '12). BCS Learning & Development Ltd., Swindon, GBR, 286–291.",
      "doi": ""
    },
    {
      "text": "Ramos Jr, Nathaniel. 2019. Smartwatch Adoption within the Running Community. Diss. The Florida State University.",
      "doi": ""
    },
    {
      "text": "Simon Robinson, Matt Jones, Parisa Eslambolchilar, Roderick Murray-Smith, and Mads Lindborg. 2010. \"I did it my way\": moving away from the tyranny of turn-by-turn pedestrian navigation. In Proceedings of the 12th international conference on Human computer interaction with mobile devices and services (MobileHCI '10). Association for Computing Machinery, New York, NY, USA, 341–344. DOI:https://doi.org/10.1145/1851600.1851660",
      "doi": "10.1145/1851600.1851660"
    },
    {
      "text": "David Dobbelstein, Philipp Henzler, and Enrico Rukzio. 2016. Unconstrained Pedestrian Navigation based on Vibro-tactile Feedback around the Wristband of a Smartwatch. In Proceedings of the 2016 CHI Conference Extended Abstracts on Human Factors in Computing Systems (CHI EA '16). Association for Computing Machinery, New York, NY, USA, 2439–2445. DOI:https://doi.org/10.1145/2851581.2892292",
      "doi": "10.1145/2851581.2892292"
    },
    {
      "text": "Fabrice Reclus. 2013. Geofencing. In Geopositioning and Mobility (eds A. Nait‐Sidi‐Moh, M. Bakhouya, J. Gaber and M. Wack). https://doi.org/10.1002/9781118743751.ch6",
      "doi": ""
    },
    {
      "text": "Owais Qayyum and Tahreem Sohail. 2016. FenceBook a Geofencing based Advertisements Application Using Android. Advances in Science, Technology and Engineering Systems Journal 1, (October 2016), 27–33. DOI:https://doi.org/10.25046/aj010506",
      "doi": ""
    },
    {
      "text": "James Gilmore. 2019. Securing the kids: Geofencing and child wearables. Convergence: The International Journal of Research into New Media Technologies 26, (October 2019), 135485651988231. DOI:https://doi.org/10.1177/1354856519882317",
      "doi": ""
    },
    {
      "text": "Ernes Pratama, Faiza Renaldi, Fajri Umbara, and Esmeralda Djamal. 2020. Geofencing Technology in Monitoring of Geriatric Patients Suffering from Dementia and Alzheimer. DOI:https://doi.org/10.1109/IC2IE50715.2020.9274637",
      "doi": ""
    },
    {
      "text": "Shreepriya Shreepriya, Christophe Legras, Stéphane Clinchant, and Jutta Willamowski. “Evaluating an Itinerary Recommendation Algorithm for Runners.” In Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, 1–6. CHI EA ’21. New York, NY, USA: Association for Computing Machinery, 2021. https://doi.org/10.1145/3411763.3451707.",
      "doi": "10.1145/3411763.3451707"
    },
    {
      "text": "Janssen M, Walravens R, Thibaut E, Scheerder J, Brombacher A, Vos S. Understanding Different Types of Recreational Runners and How They Use Running-Related Technology. Int J Environ Res Public Health. 2020;17(7):2276. Published 2020 Mar 27. doi:10.3390/ijerph17072276",
      "doi": ""
    },
    {
      "text": "Shashank, Aateka, Nadine Schuurman, Russell Copley, and Scott Lear. “Creation of a Rough Runnability Index Using an Affordance-Based Framework.” Environment and Planning B: Urban Analytics and City Science, March 31, 2021, 239980832110038. https://doi.org/10.1177/23998083211003886.",
      "doi": ""
    },
    {
      "text": "Schuurman, Nadine, Leah Rosenkrantz, and Scott A. Lear. “Environmental Preferences and Concerns of Recreational Road Runners.” International Journal of Environmental Research and Public Health 18, no. 12 (June 10, 2021): 6268. https://doi.org/10.3390/ijerph18126268.",
      "doi": ""
    },
    {
      "text": "Matthias Seuter, Max Pfeiffer, Gernot Bauer, Karen Zentgraf, and Christian Kray. 2017. Running with Technology: Evaluating the Impact of Interacting with Wearable Devices on Running Movement. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 101 (September 2017), 17 pages. DOI:https://doi.org/10.1145/3130966",
      "doi": "10.1145/3130966"
    },
    {
      "text": "Kristina Knaving, Paweł Woźniak, Morten Fjeld, and Staffan Björk. 2015. Flow is Not Enough: Understanding the Needs of Advanced Amateur Runners to Design Motivation Technology. Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 2013–2022. DOI:https://doi.org/10.1145/2702123.2702542",
      "doi": "10.1145/2702123.2702542"
    },
    {
      "text": "Vaittinen, T., McGookin, D. Uncover: supporting city exploration with egocentric visualizations of location-based content. Pers Ubiquit Comput 22, 807–824 (2018). https://doi.org/10.1007/s00779-018-1167-9",
      "doi": ""
    },
    {
      "text": "McCullough, D. & Collins, R. (2018). ‘Are we losing our way?’ Navigational aids, socio-sensory way-finding and the spatial awareness of young adults. Area, 51(3), 479-488.",
      "doi": ""
    }
  ]
}