{
  "doi": "10.1145/3491102.3517739",
  "title": "Computational Rationality as a Theory of Interaction",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "How do people interact with computers? This fundamental question was asked by Card, Moran, and Newell in 1983 with a proposition to frame it as a question about human cognition – in other words, as a matter of how information is processed in the mind. Recently, the question has been reframed as one of adaptation: how do people adapt their interaction to the limits imposed by cognition, device design, and environment? The paper synthesizes advances toward an answer within the theoretical framework of computational rationality. The core assumption is that users act in accordance with what is best for them, given the limits imposed by their cognitive architecture and their experience of the task environment. This theory can be expressed in computational models that explain and predict interaction. The paper reviews the theoretical commitments and emerging applications in HCI, and it concludes by outlining a research agenda for future work.",
  "authors": [
    {
      "name": "Antti Oulasvirta",
      "institution": "Aalto University, Finland",
      "img": "/do/10.1145/contrib-81100333050/rel-imgonly/antti.png",
      "acmid": "81100333050",
      "orcid": "0000-0002-2498-7837"
    },
    {
      "name": "Jussi P. P. Jokinen",
      "institution": "Cognitive Science, University of Jyväskylä, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658689597",
      "orcid": "missing"
    },
    {
      "name": "Andrew Howes",
      "institution": "School of Computer Science, University of Birmingham, United Kingdom",
      "img": "/do/10.1145/contrib-81100489674/rel-imgonly/mypicture.jpg",
      "acmid": "81100489674",
      "orcid": "0000-0003-4251-1127"
    }
  ],
  "references": [
    {
      "text": "Aditya Acharya, Andrew Howes, Chris Baber, and Tom Marshall. 2018. Automation reliability and decision strategy: A sequential decision making model for automation interaction. In Proceedings of the Human Factors and Ergonomics Society Annual Meeting, Vol. 62. SAGE: Los Angeles, CA, 144–148.",
      "doi": ""
    },
    {
      "text": "Sander Ackermans, Debargha Dey, Peter Ruijten, Raymond H. Cuijpers, and Bastian Pfleging. 2020. The effects of explicit intention communication, conspicuous sensors, and pedestrian attitude in interactions with automated vehicles. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3313831.3376197"
    },
    {
      "text": "John R. Anderson. 1990. The adaptive character of thought. Psychology Press.",
      "doi": ""
    },
    {
      "text": "Stuart Armstrong and Sören Mindermann. 2018. Occam’s razor is insufficient to infer the preferences of irrational agents. In Advances in neural information processing systems. 5598–5609.",
      "doi": ""
    },
    {
      "text": "Zahra Ashktorab, Mohit Jain, Q. Vera Liao, and Justin D. Weisz. 2019. Resilient chatbots: Repair strategy preferences for conversational breakdowns. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3290605.3300484"
    },
    {
      "text": "B. Bahrami, K. Olsen, P. E. Latham, A. Roepstorff, G. Rees, and C. D. Frith. 2010. Optimally interacting minds. Science 329, 5995 (2010), 1081–1085.",
      "doi": ""
    },
    {
      "text": "Nikola Banovic, Tovi Grossman, and George Fitzmaurice. 2013. The effect of time-based cost of error in target-directed pointing tasks. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1373–1382.",
      "doi": "10.1145/2470654.2466181"
    },
    {
      "text": "Andrew G. Barto, Satinder Singh, and Nuttapong Chentanez. 2004. Intrinsically motivated learning of hierarchical collections of skills. In Proceedings of the 3rd International Conference on Development and Learning. 112–119.",
      "doi": ""
    },
    {
      "text": "Harold Bekkering, Jos J. Adam, Herman Kingma, A. Huson, and H. T. A. Whiting. 1994. Reaction time latencies of eye and hand movements in single- and dual-task conditions. Experimental Brain Research 97, 3 (1994), 471–476.",
      "doi": ""
    },
    {
      "text": "Richard Bellman. 1966. Dynamic programming. Science 153, 3731 (1966), 34–37.",
      "doi": ""
    },
    {
      "text": "Jens Binder, Andrew Howes, and Alistair Sutcliffe. 2009. The problem of conflicting social spheres: Effects of network structure on experienced tension in social network sites. In Proceedings of the 27th International Conference on Human Factors in Computing Systems. ACM, 965–974.",
      "doi": "10.1145/1518701.1518849"
    },
    {
      "text": "Matthew Botvinick and Ari Weinstein. 2014. Model-based hierarchical reinforcement learning and human action control. Philosophical Transactions of the Royal Society B: Biological Sciences 369, 1655 (2014), 20130480.",
      "doi": ""
    },
    {
      "text": "Michael E. Bratman, David J. Israel, and Martha E. Pollack. 1988. Plans and resource-bounded practical reasoning. Computational Intelligence 4, 3 (1988), 349–355.",
      "doi": ""
    },
    {
      "text": "Duncan P. Brumby, Samantha C. E. Davies, Christian P. Janssen, and Justin J. Grace. 2011. Fast or safe? How performance objectives determine modality output choices while interacting on the move. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 473–482.",
      "doi": "10.1145/1978942.1979009"
    },
    {
      "text": "D. P. Brumby, D. D. Salvucci, and A. Howes. 2007. Dialing while driving? A bounded rational analysis of concurrent multi-task behavior. In Proceedings of the 8th International Conference on Cognitive Modeling. 121–126.",
      "doi": ""
    },
    {
      "text": "Michael D. Byrne. 2001. ACT-R/PM and menu selection: Applying a cognitive architecture to HCI. International Journal of Human–Computer Studies 55, 1 (2001), 41–84.",
      "doi": ""
    },
    {
      "text": "Frederick Callaway, Rangel Antonio, and Griffith Tom. 2020. Fixation patterns in simple choice are consistent with optimal use of cognitive resources.PsyArXiv preprint: https://doi.org/10.31234/osf.io/57v6k (2020).",
      "doi": ""
    },
    {
      "text": "Frederick Callaway, Antonio Rangel, and Thomas L. Griffiths. 2021. Fixation patterns in simple choice reflect optimal information sampling. PLoS Computational Biology 17, 3 (2021), e1008863.",
      "doi": ""
    },
    {
      "text": "S. K. Card, T. P. Moran, and A. Newell. 1983. The psychology of human–computer interaction. Lawrence Erlbaum: Hillsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Daniel R. Cavagnaro, Richard Gonzalez, Jay I. Myung, and Mark A. Pitt. 2013. Optimal decision stimuli for risky choice experiments: An adaptive approach. Management Science 59, 2 (2013), 358–375.",
      "doi": "10.1287/mnsc.1120.1558"
    },
    {
      "text": "Noshaba Cheema, Laura A. Frey-Law, Kourosh Naderi, Jaakko Lehtinen, Philipp Slusallek, and Perttu Hämäläinen. 2020. Predicting mid-air interaction movements and fatigue using deep reinforcement learning. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3313831.3376701"
    },
    {
      "text": "Xiuli Chen, Aditya Acharya, Antti Oulasvirta, and Andrew Howes. 2021. An adaptive model of gaze-based selection. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3411764.3445177"
    },
    {
      "text": "Xiuli Chen, Gilles Bailly, Duncan P. Brumby, Antti Oulasvirta, and Andrew Howes. 2015. The emergence of interactive behaviour: A model of rational menu search. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, 4217–4226.",
      "doi": "10.1145/2702123.2702483"
    },
    {
      "text": "Xiuli Chen, Sandra Dorothee Starke, Chris Baber, and Andrew Howes. 2017. A cognitive model of how people make decisions through interaction with visual displays. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, 1205–1216.",
      "doi": "10.1145/3025453.3025596"
    },
    {
      "text": "Allan Dafoe, Yoram Bachrach, Gillian Hadfield, Eric Horvitz, Kate Larson, and Thore Graepel. 2021. Cooperative AI: machines must learn to find common ground.",
      "doi": ""
    },
    {
      "text": "Jenny L. Davis and Nathan Jurgenson. 2014. Context collapse: Theorizing context collusions and collisions. Information, Communication & Society 17, 4 (2014), 476–485.",
      "doi": ""
    },
    {
      "text": "Nathaniel D. Daw. 2014. Advanced reinforcement learning. Neuroeconomics (2014), 299–320.",
      "doi": ""
    },
    {
      "text": "P. Dayan. 2014. Rationalizable irrationalities of choice. Topics in Cognitive Science(2014).",
      "doi": ""
    },
    {
      "text": "Peter Dayan and Nathaniel D. Daw. 2008. Decision theory, reinforcement learning, and the brain. Cognitive, Affective, & Behavioral Neuroscience 8, 4(2008), 429–453.",
      "doi": ""
    },
    {
      "text": "Edward L. Deci and Richard M. Ryan. 2000. The “what” and “why” of goal pursuits: Human needs and the self-determination of behavior. Psychological Inquiry 11, 4 (2000), 227–268.",
      "doi": ""
    },
    {
      "text": "Bradley B. Doll, Dylan A. Simon, and Nathaniel D. Daw. 2012. The ubiquity of model-based reinforcement learning. Current Opinion in Neurobiology 22, 6 (2012), 1075–1081.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. What we talk about when we talk about context. Personal and ubiquitous computing 8, 1 (2004), 19–30.",
      "doi": "10.1007/s00779-003-0253-8"
    },
    {
      "text": "G. B. Duggan and S. J. Payne. 2009. Text skimming: The process and effectiveness of foraging through text under time pressure. Journal of Experimental Psychology: Applied 15, 3 (2009), 228–242.",
      "doi": ""
    },
    {
      "text": "Dennis E. Egan. 1988. Individual differences in human–computer interaction. In Handbook of human–computer interaction. Elsevier, 543–568.",
      "doi": ""
    },
    {
      "text": "Sascha E. Engelbrecht, Neil E. Berthier, and Laura P. O’Sullivan. 2003. The undershoot bias: Learning to act optimally under uncertainty. Psychological Science 14, 3 (2003), 257–261.",
      "doi": ""
    },
    {
      "text": "Mattias Esbjörnsson, Oskar Juhlin, and Alexandra Weilenmann. 2007. Drivers using mobile phones in traffic: An ethnographic study of interactional adaptation. International Journal of Human–Computer Interaction 22, 1–2(2007), 37–58.",
      "doi": ""
    },
    {
      "text": "Susan T. Fiske and Shelley E. Taylor. 1991. Social cognition. McGraw–Hill.",
      "doi": ""
    },
    {
      "text": "Krzysztof Gajos and Daniel S. Weld. 2004. SUPPLE: Automatically generating user interfaces. In Proceedings of the 9th International Conference on Intelligent User Interfaces. 93–100.",
      "doi": "10.1145/964442.964461"
    },
    {
      "text": "Xianyi Gao, Yulong Yang, Can Liu, Christos Mitropoulos, Janne Lindqvist, and Antti Oulasvirta. 2018. Forgetting of passwords: Ecological theory and data. In Proceedings of the 27th USENIX Security Symposium. USENIX, 221–238.",
      "doi": ""
    },
    {
      "text": "Christoph Gebhardt, Antti Oulasvirta, and Otmar Hilliges. 2021. Hierarchical reinforcement learning explains task interleaving behavior. Computational Brain & Behavior 4 (2021), 284–304.",
      "doi": ""
    },
    {
      "text": "Wilson S. Geisler. 2011. Contributions of ideal observer theory to vision research. Vision Research 51, 7 (2011), 771–781.",
      "doi": ""
    },
    {
      "text": "Samuel J. Gershman and Nathaniel D. Daw. 2017. Reinforcement learning and episodic memory in humans and animals: An integrative framework. Annual Review of Psychology 68 (2017), 101–128.",
      "doi": ""
    },
    {
      "text": "Gerd Gigerenzer. 2018. The bias bias in behavioral economics. Review of Behavioral Economics 5, 3-4 (2018), 303–336.",
      "doi": ""
    },
    {
      "text": "Christian Guckelsberger, Christoph Salge, Jeremy Gow, and Paul Cairns. 2017. Predicting player experience without the player: An exploratory study. In Proceedings of the Annual Symposium on Computer–Human Interaction in Play. 305–315.",
      "doi": "10.1145/3116595.3116631"
    },
    {
      "text": "Michael U. Gutmann and Jukka Corander. 2016. Bayesian optimization for likelihood-free inference of simulator-based statistical models. Journal of Machine Learning Research 17, 125 (2016), 1–47.",
      "doi": ""
    },
    {
      "text": "Dylan Hadfield-Menell, Anca Dragan, Pieter Abbeel, and Stuart Russell. 2016. Cooperative inverse reinforcement learning. arXiv preprint: 1606.03137(2016).",
      "doi": ""
    },
    {
      "text": "Ulrike Hahn. 2014. The Bayesian boom: Good thing or bad?Frontiers in Psychology 5 (2014).",
      "doi": ""
    },
    {
      "text": "U. Hahn and P. A. Warren. 2009. Perceptions of randomness: Why three heads are better than four. Psychological Review 116, 2 (2009), 454–461.",
      "doi": ""
    },
    {
      "text": "Christopher M. Harris. 1995. Does saccadic undershoot minimize saccadic flight-time? A Monte-Carlo study. Vision Research 35, 5 (1995), 691–701.",
      "doi": ""
    },
    {
      "text": "David B. Henson. 1978. Corrective saccades: Effects of altering visual feedback. Vision Research 18, 1 (1978), 63–67.",
      "doi": ""
    },
    {
      "text": "James Hollan, Edwin Hutchins, and David Kirsh. 2000. Distributed cognition: Toward a new foundation for human–computer interaction research. ACM Transactions on Computer–Human Interaction 7, 2(2000), 174–196.",
      "doi": ""
    },
    {
      "text": "Kasper Hornbæk and Antti Oulasvirta. 2017. What is interaction?. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5040–5052.",
      "doi": "10.1145/3025453.3025765"
    },
    {
      "text": "Eric Horvitz. 1999. Principles of mixed-initiative user interfaces. In Proceedings of the SIGCHI conference on Human Factors in Computing Systems. 159–166.",
      "doi": "10.1145/302979.303030"
    },
    {
      "text": "Andrew Howes, Geoffrey B. Duggan, Kiran Kalidindi, Yuan-Chi Tseng, and Richard L. Lewis. 2016. Predicting short-term remembering as boundedly optimal strategy choice. Cognitive Science 40, 5 (2016), 1192–1223.",
      "doi": ""
    },
    {
      "text": "Andrew Howes and Richard L. Lewis. 2018. The role of (bounded) optimization in theory testing and prediction. Behavioral and Brain Sciences 41 (2018).",
      "doi": ""
    },
    {
      "text": "Andrew Howes, Richard L Lewis, and Alonso Vera. 2009. Rational adaptation under task and processing constraints: Implications for testing theories of cognition and action.Psychological review 116, 4 (2009), 717.",
      "doi": ""
    },
    {
      "text": "Andrew Howes, Paul A. Warren, George Farmer, Wael El-Deredy, and Richard L. Lewis. 2016. Why contextual preference reversals maximize expected value.Psychological Review 123, 4 (2016), 368–391.",
      "doi": ""
    },
    {
      "text": "Scott Hudson, James Fogarty, Christopher Atkeson, Daniel Avrahami, Jodi Forlizzi, Sara Kiesler, Johnny Lee, and Jie Yang. 2003. Predicting human interruptibility with sensors: A Wizard of Oz feasibility study. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 257–264.",
      "doi": "10.1145/642611.642657"
    },
    {
      "text": "Jussi Jokinen, Aditya Acharya, Mohammad Uzair, Xinhui Jiang, and Antti Oulasvirta. 2021. Touchscreen typing as optimal supervisory control. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3411764.3445483"
    },
    {
      "text": "Jussi P. P. Jokinen and Tuomo Kujala. 2021. Modelling drivers’ adaptation to assistance systems. In 13th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. 12–19.",
      "doi": ""
    },
    {
      "text": "Jussi P. P. Jokinen, Tuomo Kujala, and Antti Oulasvirta. 2020. Multitasking in driving as optimal adaptation under uncertainty. Human Factors (2020), 0018720820927687.",
      "doi": ""
    },
    {
      "text": "Jussi P. P. Jokinen, Ulpu Remes, Tuomo Kujala, and Jukka Corander. 2021. Bayesian parameter inference for cognitive simulators. In Bayesian methods for interaction design (forthcoming), Nikola Banovic, Per Ola Kirstensson, Antti Oulasvirta, and John H. Williamson (Eds.). Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Jussi P. P. Jokinen, Zhenxin Wang, Sayan Sarcar, Antti Oulasvirta, and Xiangshi Ren. 2020. Adaptive feature guidance: Modelling visual search with graphical layouts. International Journal of Human–Computer Studies 136 (2020), 102376.",
      "doi": "10.1016/j.ijhcs.2019.102376"
    },
    {
      "text": "Keno Juechems, Jan Balaguer, Bernhard Spitzer, and Christopher Summerfield. 2021. Optimal utility and probability functions for agents with finite computational precision. Proceedings of the National Academy of Sciences 118, 2 (2021).",
      "doi": ""
    },
    {
      "text": "Antti Kangasrääsiö, Jussi P. P. Jokinen, Antti Oulasvirta, Andrew Howes, and Samuel Kaski. 2019. Parameter inference for computational cognitive models with Approximate Bayesian Computation. Cognitive Science 43, 6 (2019), e12738.",
      "doi": ""
    },
    {
      "text": "David E. Kieras. 1997. Building cognitive models with the EPIC architecture for human cognition and performance. Electrical Engineering 12 (1997), 48109–48109.",
      "doi": ""
    },
    {
      "text": "David E. Kieras and Anthony J. Hornof. 2014. Towards accurate and practical predictive models of active-vision-based visual search. In Proceedings of the 32nd Annual ACM Conference on Human Factors in Computing Systems. ACM, 3875–3884.",
      "doi": ""
    },
    {
      "text": "David E. Kieras and Anthony J. Hornof. 2014. Towards accurate and practical predictive models of active-vision-based visual search. In CHI ’14: Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 3875–3884.",
      "doi": ""
    },
    {
      "text": "Konrad P. Körding and Daniel M. Wolpert. 2006. Bayesian decision theory in sensorimotor control. Trends in Cognitive Sciences 10, 7 (2006), 319–326.",
      "doi": ""
    },
    {
      "text": "Brenden M. Lake, Ruslan Salakhutdinov, and Joshua B. Tenenbaum. 2015. Human-level concept learning through probabilistic program induction. Science 350, 6266 (2015), 1332–1338.",
      "doi": ""
    },
    {
      "text": "Byungjoo Lee and Hyunwoo Bang. 2015. A mouse with two optical sensors that eliminates coordinate disturbance during skilled strokes. Human–Computer Interaction 30, 2 (2015), 122–155.",
      "doi": ""
    },
    {
      "text": "Katri Leino, Antti Oulasvirta, and Mikko Kurimo. 2019. RL-KLM: Automating keystroke-level modeling with reinforcement learning. In Proceedings of the 24th International Conference on Intelligent User Interfaces. 476–480.",
      "doi": "10.1145/3301275.3302285"
    },
    {
      "text": "Stelios Lelis and Andrew Howes. 2011. Informing decisions: How people use online rating information to make choices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 2285–2294.",
      "doi": "10.1145/1978942.1979278"
    },
    {
      "text": "Richard L. Lewis, Andrew Howes, and Satinder Singh. 2014. Computational rationality: Linking mechanism and behavior through bounded utility maximization. Topics in Cognitive Science 6, 2 (2014), 279–311.",
      "doi": ""
    },
    {
      "text": "Falk Lieder and Thomas L. Griffiths. 2017. Strategy selection as rational metareasoning.Psychological Review 124, 6 (2017), 762–794.",
      "doi": ""
    },
    {
      "text": "Falk Lieder and Thomas L Griffiths. 2019. Resource-rational analysis: understanding human cognition as the optimal use of limited computational resources. Behavioral and Brain Sciences(2019), 1–85.",
      "doi": ""
    },
    {
      "text": "Wendy E. Mackay. 1988. Diversity in the use of electronic mail: A preliminary inquiry. ACM Transactions on Information Systems (TOIS) 6, 4 (1988), 380–397.",
      "doi": "10.1145/58566.58567"
    },
    {
      "text": "I. Scott MacKenzie. 2018. Fitts’ law. Handbook of human–computer interaction 1 (2018), 349–370.",
      "doi": ""
    },
    {
      "text": "Laurence T. Maloney and Pascal Mamassian. 2009. Bayesian decision theory as a model of human visual perception: Testing Bayesian transfer. Visual Neuroscience 26, 1 (2009), 147–155.",
      "doi": ""
    },
    {
      "text": "D. E. Meyer, R. A. Abrams, S. Kornblum, C. E. Wright, and Keith Smith. 1988. Optimality in human motor performance: Ideal control of rapid aimed movements.Psychological Review 95, 3 (1988), 340–370.",
      "doi": ""
    },
    {
      "text": "Thomas M. Moerland, Joost Broekens, and Catholijn M. Jonker. 2018. Emotion in reinforcement learning agents and robots: A survey. Machine Learning 107, 2 (2018), 443–480.",
      "doi": "10.1007/s10994-017-5666-0"
    },
    {
      "text": "Sean A. Munson and Paul Resnick. 2010. Presenting diverse political opinions: How and how much. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 1457–1466.",
      "doi": ""
    },
    {
      "text": "Jiri Najemnik and Wilson S. Geisler. 2008. Eye movement statistics in humans are consistent with an optimal search strategy. Journal of Vision 8, 3 (2008), 4.",
      "doi": ""
    },
    {
      "text": "Donald A. Norman. 1988. The psychology of everyday things.Basic Books.",
      "doi": ""
    },
    {
      "text": "M. Oaksford and N. Chater. 2007. Bayesian rationality: The probabilistic approach to human reasoning. Oxford University Press: Oxford, UK.",
      "doi": ""
    },
    {
      "text": "K. P. O’Hara and S. J. Payne. 1998. The effects of operator implementation cost on planfulness of problem solving and learning.Cognitive Psychology 35, 1 (1998), 34–70. https://doi.org/10.1006/cogp.1997.0676",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Niraj Ramesh Dayama, Morteza Shiripour, Maximilian John, and Andreas Karrenbauer. 2020. Combinatorial optimization of graphical user interface designs. Proc. IEEE 108, 3 (2020), 434–464.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta and Kasper Hornbæk. 2021. Counterfactual thinking: What theories do in design. International Journal of Human–Computer Interaction 38, 1(2021), 78–92.",
      "doi": ""
    },
    {
      "text": "Antti Oulasvirta, Per Ola Kristensson, Xiaojun Bi, and Andrew Howes. 2018. Computational interaction. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Sharon Oviatt, Rebecca Lunsford, and Rachel Coulston. 2005. Individual differences in multimodal integration patterns: What are they and why do they exist?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 241–249.",
      "doi": "10.1145/1054972.1055006"
    },
    {
      "text": "John W. Payne, James R. Bettman, and Eric J. Johnson. 1993. The adaptive decision maker. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Stephen J. Payne and Andrew Howes. 2013. Adaptive interaction: A utility maximization approach to understanding human interaction with technology. Synthesis Lectures on Human-Centered Informatics 6, 1(2013), 1–111.",
      "doi": "10.5555/2534478"
    },
    {
      "text": "S. J. Payne, A. Howes, and W. R. Reader. 2001. Adaptively distributing cognition: A decision-making perspective on human–computer interaction. Behaviour & Information Technology 20, 5 (2001), 339–346.",
      "doi": ""
    },
    {
      "text": "Tomi Peltola, Jussi Jokinen, and Samuel Kaski. 2019. Probabilistic formulation of the Take The Best heuristic. arXiv preprint: 1911.00572(2019).",
      "doi": ""
    },
    {
      "text": "P. Pirolli. 2007. Information foraging theory: Adaptive interaction with information. Vol. 2. Oxford University Press: USA.",
      "doi": ""
    },
    {
      "text": "Peter G. Polson, Clayton Lewis, John Rieman, and Cathleen Wharton. 1992. Cognitive walkthroughs: A method for theory-based evaluation of user interfaces. International Journal of Man–Machine Studies 36, 5 (1992), 741–773.",
      "doi": "10.1016/0020-7373%2892%2990039-N"
    },
    {
      "text": "Philip Quinn and Shumin Zhai. 2016. A cost–benefit study of text entry suggestion interaction. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. 83–88.",
      "doi": "10.1145/2858036.2858305"
    },
    {
      "text": "Dobromir Rahnev and Rachel N. Denison. 2018. Suboptimality in perceptual decision making. Behavioral and Brain Sciences 41 (2018).",
      "doi": ""
    },
    {
      "text": "W. R. Reader and S. J. Payne. 2007. Allocating time across multiple texts: Sampling and satisficing. Human–Computer Interaction 22, 3 (2007), 263–298.",
      "doi": ""
    },
    {
      "text": "Stuart Russell. 2019. Human compatible: Artificial intelligence and the problem of control. Penguin.",
      "doi": ""
    },
    {
      "text": "Stuart Russell and Peter Norvig. 2002. Artificial intelligence: A modern approach.",
      "doi": ""
    },
    {
      "text": "Stuart J. Russell. 1997. Rationality and intelligence. Artificial Intelligence 94, 1–2 (1997), 57–77.",
      "doi": "10.1016/S0004-3702%2897%2900026-X"
    },
    {
      "text": "Stuart J. Russell and Devika Subramanian. 1994. Provably bounded-optimal agents. Journal of Artificial Intelligence Research 2 (1994), 575–609.",
      "doi": "10.5555/1622826.1622844"
    },
    {
      "text": "Dario D. Salvucci. 2001. Predicting the effects of in-car interface use on driver performance: An integrated model approach. International Journal of Human–Computer Studies 55, 1 (2001), 85–107.",
      "doi": "10.1006/ijhc.2001.0472"
    },
    {
      "text": "Sayan Sarcar, Jussi P. P. Jokinen, Antti Oulasvirta, Zhenxin Wang, Chaklam Silpasuwanchai, and Xiangshi Ren. 2018. Ability-based optimization of touchscreen interactions. IEEE Pervasive Computing 17, 1 (2018), 15–26.",
      "doi": "10.1109/mprv.2018.011591058"
    },
    {
      "text": "Albrecht Schmidt. 2000. Implicit human computer interaction through context. Personal Technologies 4, 2 (2000), 191–199.",
      "doi": ""
    },
    {
      "text": "Lael J. Schooler. 2004. How forgetting fosters heuristic inference. In Proceedings of the International Conference on Cognitive Modelling.",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2011. Claiming success, charting the future: Micro-HCI and macro-HCI. Interactions 18, 5 (2011), 10–11.",
      "doi": "10.1145/2008176.2008180"
    },
    {
      "text": "Siti Rohkmah Mohd Shukri and Andrew Howes. 2019. Children adapt drawing actions to their own motor variability and to the motivational context of action. International Journal of Human–Computer Studies 130 (2019), 152–165.",
      "doi": ""
    },
    {
      "text": "Satinder Singh, Richard L. Lewis, and Andrew G. Barto. 2009. Where do rewards come from?. In Proceedings of the 31st Annual Conference of the Cognitive Science Society. Cognitive Science Society, 2601–2606.",
      "doi": ""
    },
    {
      "text": "Mason R. Smith, Richard L. Lewis, Andrew Howes, A. Chu, C. Green, and A. Vera. 2008. More than 8,192 ways to skin a cat: Modeling behavior in multidimensional strategy spaces. In Proceedings of the 30th Annual Conference of the Cognitive Science Society, Bradley C. Love, K. McRae, and Vladimiir M. Sloutsky (Eds.). Cognitive Science Society, Austin, TX, 1441–1446.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 1993. Response to Vera and Simon’s situated action: A symbolic interpretation.Cognitive Science 17, 1 (1993), 71–75.",
      "doi": ""
    },
    {
      "text": "Lucy Suchman. 2003. Writing and reading: A response to comments on plans and situated actions. Journal of the Learning Sciences 12, 2 (2003), 299–306.",
      "doi": ""
    },
    {
      "text": "Lucy A. Suchman. 1987. Plans and situated actions: The problem of human–machine communication. Cambridge University Press.",
      "doi": "10.5555/38407"
    },
    {
      "text": "Richard S. Sutton and Andrew G. Barto. 1998. Reinforcement learning: An introduction. MIT Press, Cambridge, MA.",
      "doi": "10.5555/551283"
    },
    {
      "text": "J. A. Swets, W. P. Tanner, Jr, and T. G. Birdsall. 1961. Decision processes in perception. Psychological Review 68, 5 (1961), 301–340.",
      "doi": ""
    },
    {
      "text": "Kashyap Todi, Jussi Jokinen, Kris Luyten, and Antti Oulasvirta. 2018. Familiarisation: Restructuring layouts with visual learning models. In 23rd International Conference on Intelligent User Interfaces. 547–558.",
      "doi": "10.1145/3172944.3172949"
    },
    {
      "text": "Kashyap Todi, Jussi Jokinen, Kris Luyten, and Antti Oulasvirta. 2019. Individualising graphical layouts with predictive visual search models. ACM Transactions on Interactive Intelligent Systems (TiiS) 10, 1(2019), 1–24.",
      "doi": "10.1145/3241381"
    },
    {
      "text": "Julia Trommershäuser, Laurence T. Maloney, and Michael S. Landy. 2003. Statistical decision theory and the selection of rapid, goal-directed movements.Journal of the Optical Society of America A 20, 7 (2003), 1419–1433.",
      "doi": ""
    },
    {
      "text": "Julia Trommershäuser, Laurence T. Maloney, and Michael S. Landy. 2009. The expected utility of movement. Brain (2009), 95–111.",
      "doi": ""
    },
    {
      "text": "Yuan-Chi Tseng and Andrew Howes. 2015. The adaptation of visual search to utility, ecology and design. International Journal of Human-Computer Studies 80 (2015), 45–55.",
      "doi": "10.1016/j.ijhcs.2015.03.005"
    },
    {
      "text": "Yuan-Chi Tseng and Andrew Howes. 2015. The adaptation of visual search to utility, ecology and design. International Journal of Human–Computer Studies 80 (2015), 45–55.",
      "doi": "10.1016/j.ijhcs.2015.03.005"
    },
    {
      "text": "Mihaela Vorvoreanu, Lingyi Zhang, Yun-Han Huang, Claudia Hilderbrand, Zoe Steine-Hanson, and Margaret Burnett. 2019. From gender biases to gender-inclusive design: An empirical investigation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3290605.3300283"
    },
    {
      "text": "Colin Ware. 2019. Information visualization: Perception for design. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Shumin Zhai, Jing Kong, and Xiangshi Ren. 2004. Speed–accuracy tradeoff in Fitts’ law tasks – on the equivalency of actual and nominal pointing precision. International Journal of Human–Computer Studies 61, 6 (2004), 823–856.",
      "doi": "10.1016/j.ijhcs.2004.09.007"
    },
    {
      "text": "Jiajie Zhang, Vimla L. Patel, Todd R. Johnson, and Edward H. Shortliffe. 2004. A cognitive taxonomy of medical errors. Journal of Biomedical Informatics 37, 3 (2004), 193–204.",
      "doi": "10.1016/j.jbi.2004.04.004"
    },
    {
      "text": "Brian D. Ziebart, Nathan Ratliff, Garratt Gallagher, Christoph Mertz, Kevin Peterson, J. Andrew Bagnell, Martial Hebert, Anind K. Dey, and Siddhartha Srinivasa. 2009. Planning-based prediction for pedestrians. In 2009 IEEE/RSJ International Conference on Intelligent Robots and Systems. IEEE, 3931–3936.",
      "doi": ""
    }
  ]
}