{
  "doi": "10.1145/3491102.3517524",
  "title": "“Brush it Off”: How Women Workers Manage and Cope with Bias and Harassment in Gender-agnostic Gig Platforms",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "Women make up approximately half of the workforce in ride-hailing, food delivery, and home service platforms in North America. While studies have reported that gig workers face bias, harassment, and a gender pay gap, we have limited understanding of women’s perspectives of these issues and their coping mechanisms. We interviewed 20 women gig workers to hear their unique experiences with these challenges. We found that gig platforms are gender-agnostic, meaning they do not acknowledge women’s experiences and the value they bring. By not enforcing anti-harassment policies in design, gig platforms also leave women workers vulnerable to bias and harassment. Due to the lack of support for immediate actions and in fear of losing access to work, women workers “brush off” harassment. In addition, the platforms’ dispatching and recommendation mechanisms do not acknowledge women’s contributions in perceived safety for customers and social support for peer workers.",
  "authors": [
    {
      "name": "Ning F. Ma",
      "institution": "Computer Science, University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261939",
      "orcid": "missing"
    },
    {
      "name": "Veronica A. Rivera",
      "institution": "Computational Media, University of California, Santa Cruz, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659698631",
      "orcid": "missing"
    },
    {
      "name": "Zheng Yao",
      "institution": "Human-Computer Interaction Institute, Carnegie Mellon University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659320296",
      "orcid": "missing"
    },
    {
      "name": "Dongwook Yoon",
      "institution": "Computer Science, University of British Columbia, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659515794",
      "orcid": "0000-0002-7838-8311"
    }
  ],
  "references": [
    {
      "text": "2019. Uber’s emergency button. https://www.uber.com/newsroom/emergencybutton/",
      "doi": ""
    },
    {
      "text": "2020. 26+ game-changing gig ECONOMY STATISTICS. Retrieved September 3, 2021 from https://teamstage.io/gig-economy-statistics/",
      "doi": ""
    },
    {
      "text": "2022. Uber’s community guidelines | following the Law | Uber. https://www.uber.com/us/en/safety/uber-community-guidelines/follow-law/",
      "doi": ""
    },
    {
      "text": "2022. Uber’s community guidelines | respect everyone | uber. https://www.uber.com/us/en/safety/uber-community-guidelines/respect/",
      "doi": ""
    },
    {
      "text": "2022. Uber’s community guidelines | safety | uber. https://www.uber.com/us/en/safety/uber-community-guidelines/keep-safe/",
      "doi": ""
    },
    {
      "text": "Joan Acker. 1990. Hierarchies, jobs, bodies: A theory of gendered organizations. Gender & society 4, 2 (1990), 139–158.",
      "doi": ""
    },
    {
      "text": "Mashael Yousef Almoqbel and Donghee Yvette Wohn. 2019. Individual and Collaborative Behaviors of Rideshare Drivers in Protecting Their Safety. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 217 (Nov. 2019), 21 pages.",
      "doi": "10.1145/3359319"
    },
    {
      "text": "Ira Anjali Anwar, Joyojeet Pal, and Julie Hui. 2021. Watched, but Moving: Platformization of Beauty Work and Its Gendered Mechanisms of Control. Proc. ACM Hum.-Comput. Interact. 4, CSCW3, Article 250 (Jan. 2021), 20 pages. https://doi.org/10.1145/3432949",
      "doi": "10.1145/3432949"
    },
    {
      "text": "Mohammad Amir Anwar and Mark Graham. 2021. Between a rock and a hard place: Freedom, flexibility, precarity and vulnerability in the gig economy in Africa. Competition & Change 25, 2 (2021), 237–258.",
      "doi": ""
    },
    {
      "text": "Dennis Arnold and Joseph R Bongiovi. 2013. Precarious, informalizing, and flexible work: Transforming concepts and understandings. American Behavioral Scientist 57, 3 (2013), 289–308.",
      "doi": ""
    },
    {
      "text": "L Bannon. 2000. Situating workplace studies within the human-computer interaction field. Workplace studies: Recovering work practice and informing system design (2000), 230.",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the SIGCHI conference on human factors in computing systems. 1301–1310.",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Shaowen Bardzell and Jeffrey Bardzell. 2011. Towards a feminist HCI methodology: social science, feminism, and HCI. In Proceedings of the SIGCHI conference on human factors in computing systems. 675–684.",
      "doi": "10.1145/1978942.1979041"
    },
    {
      "text": "Shaowen Bardzell, Jeffrey Bardzell, Jodi Forlizzi, John Zimmerman, and John Antanitis. 2012. Critical design and critical theory: the challenge of designing for provocation. In Proceedings of the Designing Interactive Systems Conference. 288–297.",
      "doi": "10.1145/2317956.2318001"
    },
    {
      "text": "Deepti Bhatnagar and Ujvala Rajadhyaksha. 2001. Attitudes towards work and family roles and their implications for career growth of women: A report from India. Sex Roles 45, 7 (2001), 549–565.",
      "doi": ""
    },
    {
      "text": "Donna Bobbitt-Zeher. 2011. Gender discrimination at work: Connecting gender stereotypes, institutional policies, and gender composition of workplace. Gender & Society 25, 6 (2011), 764–786.",
      "doi": ""
    },
    {
      "text": "James Bohman. 2005. Critical theory. (2005).",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative research in psychology 3, 2 (2006), 77–101.",
      "doi": ""
    },
    {
      "text": "Eliane Léontine Bucher, Peter Kalum Schou, and Matthias Waldkirch. 2021. Pacifying the algorithm–Anticipatory compliance in the face of algorithmic management in the gig economy. Organization 28, 1 (2021), 44–67.",
      "doi": ""
    },
    {
      "text": "Judith Butler. 1988. Performative acts and gender constitution: An essay in phenomenology and feminist theory. Theatre journal 40, 4 (1988), 519–531.",
      "doi": ""
    },
    {
      "text": "Graham Button and Wes Sharrock. 2009. Studies of Work and the Workplace in HCI: Concepts and Techniques. Synthesis Lectures on Human-Centered Informatics 2, 1(2009), 1–96.",
      "doi": "10.5555/1855102"
    },
    {
      "text": "Kathy Charmaz and J Smith. 2003. Grounded theory. Qualitative psychology: A practical guide to research methods 2 (2003), 81–110.",
      "doi": ""
    },
    {
      "text": "Brendan Churchill and Lyn Craig. 2019. Gender in the gig economy: Men and women using digital platforms to secure work in Australia. Journal of Sociology 55, 4 (2019), 741–761. https://doi.org/10.1177/1440783319894060",
      "doi": ""
    },
    {
      "text": "Mitchell Clark. 2021. DoorDash adds in-app safety features, but couriers need more protection. https://www.theverge.com/2021/11/4/22763690/doordash-safety-button-delivery-worker-rights-accountability-adt-911",
      "doi": ""
    },
    {
      "text": "Cody Cook, Rebecca Diamond, Jonathan Hall, John A List, and Paul Oyer. 2018. The gender earnings gap in the gig economy: Evidence from over a million rideshare drivers. Technical Report. National Bureau of Economic Research.",
      "doi": ""
    },
    {
      "text": "Judy Goldberg Dey and Catherine Hill. 2007. Behind the pay gap.ERIC.",
      "doi": ""
    },
    {
      "text": "Susan M Dray, Andrea Peer, Anke M Brock, Anicia Peters, Shaowen Bardzell, Margaret Burnett, Elizabeth Churchill, Erika Poole, and Daniela K Busse. 2013. Exploring the representation of women perspectives in technologies. In CHI’13 Extended Abstracts on Human Factors in Computing Systems. 2447–2454.",
      "doi": ""
    },
    {
      "text": "James Duggan, Ultan Sherman, Ronan Carbery, and Anthony McDonnell. 2020. Algorithmic management and app-work in the gig economy: A research agenda for employment relations and HRM. Human Resource Management Journal 30, 1 (2020), 114–132.",
      "doi": ""
    },
    {
      "text": "James Duggan, Ultan Sherman, Ronan Carbery, and Anthony McDonnell. 2021. Boundaryless careers and algorithmic constraints in the gig economy. The International Journal of Human Resource Management (2021), 1–31.",
      "doi": ""
    },
    {
      "text": "Alice H Eagly and Antonio Mladinic. [n.d.]. Gender stereotypes and attitudes toward women and men. Personality and social psychology bulletin 15, 4 ([n. d.]).",
      "doi": ""
    },
    {
      "text": "Alice H Eagly and Valerie J Steffen. 1984. Gender stereotypes stem from the distribution of women and men into social roles.Journal of personality and social psychology 46, 4(1984), 735.",
      "doi": ""
    },
    {
      "text": "Christy L Erving, Lacee A Satcher, and Yvonne Chen. 2021. Psychologically resilient, but physically vulnerable? Exploring the psychosocial determinants of African American women’s mental and physical health. Sociology of Race and Ethnicity 7, 1 (2021), 116–133.",
      "doi": ""
    },
    {
      "text": "Erica Fletcher. 2021. Gender inequality in the Gig Economy. https://autonomy.work/portfolio/fletcher-gig-economy/",
      "doi": ""
    },
    {
      "text": "Eureka Foong, Nicholas Vincent, Brent Hecht, and Elizabeth M. Gerber. 2018. Women (Still) Ask For Less: Gender Differences in Hourly Rate in an Online Labor Marketplace. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 53 (Nov. 2018), 21 pages. https://doi.org/10.1145/3274322",
      "doi": "10.1145/3274322"
    },
    {
      "text": "Carol Brooks Gardner. 1995. Passing by: Gender and public harassment. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Mark Graham, Isis Hjorth, and Vili Lehdonvirta. 2017. Digital labour and development: impacts of global digital labour platforms and the gig economy on worker livelihoods. Transfer: European review of labour and research 23, 2 (2017), 135–162.",
      "doi": ""
    },
    {
      "text": "Mary L Gray and Siddharth Suri. 2019. Ghost work: How to stop Silicon Valley from building a new global underclass. Eamon Dolan Books.",
      "doi": ""
    },
    {
      "text": "Kathleen Griesbach, Adam Reich, Luke Elliott-Negri, and Ruth Milkman. 2019. Algorithmic control in platform food delivery work. Socius 5(2019), 2378023119870041.",
      "doi": ""
    },
    {
      "text": "Yvonne Guerrier and Amel S Adib. 2000. ‘No, we don’t provide that service’: the harassment of hotel employees by customers. Work, employment and society 14, 4 (2000), 689–705.",
      "doi": ""
    },
    {
      "text": "Anikó Hannák, Claudia Wagner, David Garcia, Alan Mislove, Markus Strohmaier, and Christo Wilson. 2017. Bias in online freelance marketplaces: Evidence from taskrabbit and fiverr. In Proceedings of the 2017 ACM conference on computer supported cooperative work and social computing. 1914–1933.",
      "doi": "10.1145/2998181.2998327"
    },
    {
      "text": "Benjamin V Hanrahan, Ning F Ma, and Chien Wen Yuan. 2018. The roots of bias on Uber. ECSCW (2018).",
      "doi": ""
    },
    {
      "text": "Jason N Houle, Jeremy Staff, Jeylan T Mortimer, Christopher Uggen, and Amy Blackstone. 2011. The impact of sexual harassment on depressive symptoms during the early occupational career. Society and mental health 1, 2 (2011), 89–105.",
      "doi": ""
    },
    {
      "text": "Lisa C Huebner. 2008. It is part of the job: Waitresses and nurses define sexual harassment. Sociological Viewpoints 24 (2008), 75.",
      "doi": ""
    },
    {
      "text": "Abigail Hunt, Emma Samman, Sherry Tapfuma, Grace Mwaura, Rhoda Omenya, Kay Kim, Sara Stevano, and Aida Roumer. 2019. Women in the gig economy: paid work, care and flexibility in Kenya and South Africa.(2019).",
      "doi": ""
    },
    {
      "text": "Lilly C Irani and M Six Silberman. 2013. Turkopticon: Interrupting worker invisibility in amazon mechanical turk. In Proceedings of the SIGCHI conference on human factors in computing systems. 611–620.",
      "doi": "10.1145/2470654.2470742"
    },
    {
      "text": "Mirela Ivanova, Joanna Bronowicka, Eva Kocher, and Anne Degner. 2018. Foodora and Deliveroo: The App as a Boss? Control and autonomy in app-based management - the case of food delivery riders. Working Paper 107. Hans-Böckler-Stiftung, Düsseldorf. https://EconPapers.repec.org/RePEc:zbw:hbsfof:107",
      "doi": ""
    },
    {
      "text": "Mohammad Hossein Jarrahi, Gemma Newlands, Min Kyung Lee, Christine T Wolf, Eliscia Kinder, and Will Sutherland. 2021. Algorithmic management in a work context. Big Data & Society 8, 2 (2021), 20539517211020332.",
      "doi": ""
    },
    {
      "text": "Mohammad Hossein Jarrahi and Will Sutherland. 2019. Algorithmic management and algorithmic competencies: Understanding and appropriating algorithms in gig work. In International Conference on Information. Springer, 578–589.",
      "doi": ""
    },
    {
      "text": "Mohammad Hossein Jarrahi, Will Sutherland, Sarah Beth Nelson, and Steve Sawyer. 2020. Platformic management, boundary resources for gig work, and worker autonomy. Computer supported cooperative work (CSCW) 29, 1 (2020), 153–189.",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Yoni Karpfen, and Judd Antin. 2018. Algorithmic anxiety and coping strategies of Airbnb hosts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173995"
    },
    {
      "text": "Naveena Karusala and Neha Kumar. 2017. Women’s Safety in Public Spaces: Examining the Efficacy of Panic Buttons in New Delhi. Association for Computing Machinery, New York, NY, USA, 3340–3351. https://doi.org/10.1145/3025453.3025532",
      "doi": "10.1145/3025453.3025532"
    },
    {
      "text": "Joseph Kasera, Jacki O’Neill, and Nicola J Bidwell. 2016. Sociality, Tempo & Flow: Learning from Namibian Ridesharing. In Proceedings of the First African Conference on Human Computer Interaction. 36–47.",
      "doi": "10.1145/2998581.2998582"
    },
    {
      "text": "Ria Kasliwal. 2020. Gender and the Gig Economy: A Qualitative Study of Gig Platforms for Women Workers. Observer Research Foundatio, ORF Issue Brief359 (2020).",
      "doi": ""
    },
    {
      "text": "Katherine C Kellogg, Melissa A Valentine, and Angele Christin. 2020. Algorithms at work: The new contested terrain of control. Academy of Management Annals 14, 1 (2020), 366–410.",
      "doi": ""
    },
    {
      "text": "Meshack M Khosa. 1997. Sisters on slippery wheels: women taxi drivers in South Africa. Transformation33(1997).",
      "doi": ""
    },
    {
      "text": "Laura J Kray, Jessica A Kennedy, and Alex B Van Zant. 2014. Not competent enough to know the difference? Gender stereotypes about women’s ease of being misled predict negotiator deception. Organizational Behavior and Human Decision Processes 125, 2(2014), 61–72.",
      "doi": ""
    },
    {
      "text": "John Law. 1992. Notes on the theory of the actor-network: Ordering, strategy, and heterogeneity. Systems practice 5, 4 (1992), 379–393.",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Norman Makoto Su, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Parting the Red Sea: Sociotechnical Systems and Lived Experiences of Menopause. Association for Computing Machinery, New York, NY, USA, 1–16. https://doi.org/10.1145/3290605.3300710",
      "doi": "10.1145/3290605.3300710"
    },
    {
      "text": "Maurizio Lazzarato. 1996. Immaterial labor. Radical thought in Italy: A potential politics 1996 (1996), 133–47.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with machines: The impact of algorithmic and data-driven management on human workers. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1603–1612.",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Rhonda Lenton, Michael D Smith, John Fox, and Norman Morra. 1999. Sexual harassment in public places: Experiences of Canadian women. Canadian Review of Sociology/Revue canadienne de sociologie 36, 4(1999), 517–540.",
      "doi": ""
    },
    {
      "text": "Asaf Levanon, Paula England, and Paul Allison. 2009. Occupational feminization and pay: Assessing causal dynamics using 1950–2000 US census data. Social Forces 88, 2 (2009), 865–891.",
      "doi": ""
    },
    {
      "text": "Ning F Ma and Benjamin V Hanrahan. 2019. Part-Time Ride-Sharing: Recognizing the Context in which Drivers Ride-Share and its Impact on Platform Use. Proceedings of the ACM on Human-Computer Interaction 3, GROUP(2019), 1–17.",
      "doi": "10.1145/3361128"
    },
    {
      "text": "Ning F Ma, Chien Wen Yuan, Moojan Ghafurian, and Benjamin V Hanrahan. 2018. Using stakeholder theory to examine drivers’ Stake in Uber. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173657"
    },
    {
      "text": "Michael Maffie and Allison Elias. 2019. Platform design as a managerial act: Analyzing sexual harassment in the gig economy. LERA For Libraries 23, 2 (2019).",
      "doi": ""
    },
    {
      "text": "David Martin, Benjamin V Hanrahan, Jacki O’Neill, and Neha Gupta. 2014. Being a turker. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. 224–235.",
      "doi": "10.1145/2531602.2531663"
    },
    {
      "text": "Patricia Yancey Martin. 2006. Practising gender at work: Further thoughts on reflexivity. Gender, work & organization 13, 3 (2006), 254–276.",
      "doi": ""
    },
    {
      "text": "Ruth Milkman, Luke Elliott-Negri, Kathleen Griesbach, and Adam Reich. 2021. Gender, Class, and the Gig Economy: The Case of Platform-Based Food Delivery. Critical Sociology 47, 3 (2021), 357–372.",
      "doi": ""
    },
    {
      "text": "Krista Lynn Minnotte and Elizabeth M Legerski. 2019. Sexual harassment in contemporary workplaces: Contextualizing structural vulnerabilities. Sociology Compass 13, 12 (2019), e12755.",
      "doi": ""
    },
    {
      "text": "Anna Offenwanger, Alan John Milligan, Minsuk Chang, Julia Bullard, and Dongwook Yoon. 2021. Diagnosing bias in the gender representation of HCI research participants: how it happens and where we are. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–18.",
      "doi": "10.1145/3411764.3445383"
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela DR Smith, Alexandra To, and Kentaro Toyama. 2020. Critical race theory for HCI. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Caroline Criado Perez and Pushpanjali Jha. 2020. Invisible women: exposing data bias in a world designed for men. (2020).",
      "doi": ""
    },
    {
      "text": "Noopur Raval and Paul Dourish. 2016. Standing out from the crowd: Emotional labor, body labor, and temporal labor in ridesharing. In Proceedings of the 19th ACM Conference on Computer-Supported Cooperative Work & Social Computing. 97–107.",
      "doi": "10.1145/2818048.2820026"
    },
    {
      "text": "Noopur Raval and Joyojeet Pal. 2019. Making a ”Pro”: ’Professionalism’ after Platforms in Beauty-Work. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 175 (Nov. 2019), 17 pages.",
      "doi": "10.1145/3359277"
    },
    {
      "text": "Jana L Raver and Lisa H Nishii. 2010. Once, twice, or three times as harmful? Ethnic harassment, gender harassment, and generalized workplace harassment.Journal of Applied Psychology 95, 2 (2010), 236.",
      "doi": ""
    },
    {
      "text": "Veronica A Rivera and David T Lee. 2021. I Want to, but First I Need to: Understanding Crowdworkers’ Career Goals, Challenges, and Tensions. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–22.",
      "doi": "10.1145/3449224"
    },
    {
      "text": "Alex Rosenblat. 2018. Uberland: How algorithms are rewriting the rules of work. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Alex Rosenblat and Luke Stark. 2016. Algorithmic labor and information asymmetries: A case study of Uber’s drivers. International journal of communication 10 (2016), 27.",
      "doi": ""
    },
    {
      "text": "Niloufar Salehi, Lilly C Irani, Michael S Bernstein, Ali Alkhatib, Eva Ogbe, and Kristy Milland. 2015. We are dynamo: Overcoming stalling and friction in collective action for crowd workers. In Proceedings of the 33rd annual ACM conference on human factors in computing systems. 1621–1630.",
      "doi": "10.1145/2702123.2702508"
    },
    {
      "text": "Sara Salih. 2007. On Judith butler and performativity. Sexualities and communication in everyday life: A reader (2007), 55–68.",
      "doi": ""
    },
    {
      "text": "Juliet B Schor, William Attwood-Charles, Mehmet Cansoy, Isak Ladegaard, and Robert Wengronowitz. 2020. Dependence and precarity in the platform economy. Theory and Society 49, 5 (2020), 833–861.",
      "doi": ""
    },
    {
      "text": "Bhavani Seetharaman, Joyojeet Pal, and Julie Hui. 2021. Delivery Work and the Experience of Social Isolation. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 64 (April 2021), 17 pages. https://doi.org/10.1145/3449138",
      "doi": "10.1145/3449138"
    },
    {
      "text": "Vivek K Singh, Mary Chayko, Raj Inamdar, and Diana Floegel. 2020. Female librarians and male computer programmers? Gender bias in occupational images on digital media platforms. Journal of the Association for Information Science and Technology 71, 11(2020), 1281–1294.",
      "doi": "10.1002/asi.24335"
    },
    {
      "text": "Sally Slocum. 1975. Woman the gatherer: male bias in anthropology. (1975).",
      "doi": ""
    },
    {
      "text": "Nick Srnicek. 2017. Platform capitalism. John Wiley & Sons.",
      "doi": ""
    },
    {
      "text": "Lucy A Suchman. 1987. Plans and situated actions: The problem of human-machine communication. Cambridge university press.",
      "doi": "10.5555/38407"
    },
    {
      "text": "Jacob Thebault-Spieker, Loren G. Terveen, and Brent Hecht. 2015. Avoiding the South Side and the Suburbs: The Geography of Mobile Crowdsourcing Markets. In Proceedings of the 18th ACM Conference on Computer Supported Cooperative Work & Social Computing (Vancouver, BC, Canada) (CSCW ’15). Association for Computing Machinery, New York, NY, USA, 265–275. https://doi.org/10.1145/2675133.2675278",
      "doi": "10.1145/2675133.2675278"
    },
    {
      "text": "Julia Ticona. 2019. Beyond disruption: How tech shapes labor across domestic work & ridehailing. In 31st Annual Meeting. SASE.",
      "doi": ""
    },
    {
      "text": "Julia Ticona and Alexandra Mateescu. 2018. Trusted strangers: Carework platforms’ cultural entrepreneurship in the on-demand economy. New Media & Society 20, 11 (2018), 4384–4404.",
      "doi": ""
    },
    {
      "text": "Steve Viscelli. 2016. The big rig: Trucking and the decline of the American dream. Univ of California Press.",
      "doi": ""
    },
    {
      "text": "Claudia Wagner, David Garcia, Mohsen Jadidi, and Markus Strohmaier. 2015. It’s a man’s Wikipedia? Assessing gender inequality in an online encyclopedia. In Ninth international AAAI conference on web and social media.",
      "doi": ""
    },
    {
      "text": "Beatrice Webb and Beatrice Potter Webb. 1926. My apprenticeship. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Sidney Webb. 1912. The economic theory of a legal minimum wage. Journal of Political Economy 20, 10 (1912), 973–998.",
      "doi": ""
    },
    {
      "text": "David Weil. 2014. The fissured workplace. Harvard University Press.",
      "doi": ""
    },
    {
      "text": "Alex J Wood, Mark Graham, Vili Lehdonvirta, and Isis Hjorth. 2019. Good gig, bad gig: autonomy and algorithmic control in the global gig economy. Work, Employment and Society 33, 1 (2019), 56–75.",
      "doi": ""
    },
    {
      "text": "Zheng Yao, Silas Weden, Lea Emerlyn, Haiyi Zhu, and Robert E. Kraut. 2021. Together But Alone: Atomization and Peer Support among Gig Workers. Proc. ACM Hum.-Comput. Interact. 5, CSCW, Article 391 (Oct. 2021), 29 pages.",
      "doi": "10.1145/3479535"
    },
    {
      "text": "Ming Yin, Siddharth Suri, and Mary L Gray. 2018. Running out of time: The impact and value of flexibility in on-demand crowdwork. In Proceedings of the 2018 CHI conference on human factors in computing systems. 1–11.",
      "doi": "10.1145/3173574.3174004"
    },
    {
      "text": "Chuang-Wen You, Chien Wen Yuan, Nanyi Bi, Min-Wei Hung, Po-Chun Huang, and Hao-Chuan Wang. 2021. Go Gig or Go Home: Enabling Social Sensing to Share Personal Data with Intimate Partner for the Health and Wellbeing of Long-Hour workers. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–16.",
      "doi": "10.1145/3411764.3445278"
    },
    {
      "text": "Elle Ziegler. 2020. Understanding the nature and experience of gig work in Canada. https://fsc-ccf.ca/research/understanding-the-nature-and-experience-of-gig-work-in-canada/",
      "doi": ""
    }
  ]
}