{
  "doi": "10.1145/3491102.3501980",
  "title": "Can’t Touch This: Rethinking Public Technology in a COVID-19 Era",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "What do pedestrian crossings, ATMs, elevators and ticket machines have in common? These are just a few of the ubiquitous yet essential elements of public-space infrastructure that rely on physical buttons or touchscreens; common interactions that, until recently, were considered perfectly safe to perform. This work investigates how we might integrate touchless technologies into public-space infrastructure in order to minimise physical interaction with shared devices in light of the ongoing COVID-19 pandemic. Drawing on an ethnographic exploration into how public utilities are being used, adapted or avoided, we developed and evaluated a suite of technology probes that can be either retrofitted into, or replace, these services. In-situ community deployments of our probes demonstrate strong uptake and provide insight into how hands-free technologies can be adapted and utilised for the public domain; and, in turn, used to inform the future of walk-up-and use public technologies.",
  "tags": [
    "field studies",
    "prototyping/implementation.",
    "Public displays"
  ],
  "authors": [
    {
      "name": "Jennifer Pearson",
      "institution": "Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-81384596881/rel-imgonly/img_4695.jpg",
      "acmid": "81384596881",
      "orcid": "0000-0002-1960-1012"
    },
    {
      "name": "Gavin Bailey",
      "institution": "Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-99659210785/rel-imgonly/gavinbailey.jpg",
      "acmid": "99659210785",
      "orcid": "missing"
    },
    {
      "name": "Simon Robinson",
      "institution": "Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-81371592031/rel-imgonly/profile-small-rect.jpg",
      "acmid": "81371592031",
      "orcid": "0000-0001-9228-006X"
    },
    {
      "name": "Matt Jones",
      "institution": "Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-81328488881/rel-imgonly/forweb.jpg",
      "acmid": "81328488881",
      "orcid": "0000-0001-7657-7373"
    },
    {
      "name": "Tom Owen",
      "institution": "Swansea University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81377591459",
      "orcid": "missing"
    },
    {
      "name": "Chi Zhang",
      "institution": "Swansea University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659526893",
      "orcid": "missing"
    },
    {
      "name": "Thomas Reitmaier",
      "institution": "Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-81442618424/rel-imgonly/thomasreitmaier.jpg",
      "acmid": "81442618424",
      "orcid": "0000-0003-2078-6699"
    },
    {
      "name": "Cameron Steer",
      "institution": "Swansea University, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658707900",
      "orcid": "0000-0001-8497-7932"
    },
    {
      "name": "Anna Carter",
      "institution": "Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-99660233219/rel-imgonly/anna.jpg",
      "acmid": "99660233219",
      "orcid": "missing"
    },
    {
      "name": "Deepak Ranjan Sahoo",
      "institution": "Swansea University, United Kingdom",
      "img": "/do/10.1145/contrib-99658704388/rel-imgonly/dsc_0054_413.jpeg",
      "acmid": "99658704388",
      "orcid": "missing"
    },
    {
      "name": "Dani Kalarikalayil Raju",
      "institution": "Studio Hasi, India",
      "img": "/do/10.1145/contrib-99659124815/rel-imgonly/pic.jpg",
      "acmid": "99659124815",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Christopher Ackad, Andrew Clayphan, Martin Tomitsch, and Judy Kay. 2015. An In-the-Wild Study of Learning Mid-Air Gestures to Browse Hierarchical Information at a Large Interactive Public Display. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 1227–1238. https://doi.org/10.1145/2750858.2807532",
      "doi": "10.1145/2750858.2807532"
    },
    {
      "text": "Alexandre Alapetite. 2008. Speech recognition for the anaesthesia record during crisis scenarios. International Journal of Medical Informatics 77, 7(2008), 448–460. https://doi.org/10.1016/j.ijmedinf.2007.08.007",
      "doi": ""
    },
    {
      "text": "Sebastian Boring, Sven Gehring, Alexander Wiethoff, Anna Magdalena Blöckner, Johannes Schöning, and Andreas Butz. 2011. Multi-User Interaction on Media Facades through Live Video on Mobile Devices. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 2721–2724. https://doi.org/10.1145/1978942.1979342",
      "doi": "10.1145/1978942.1979342"
    },
    {
      "text": "Marta Bortoli, Marco Furini, Silvia Mirri, Manuela Montangero, and Catia Prandi. 2020. Conversational Interfaces for a Smart Campus: A Case Study. In Proceedings of the International Conference on Advanced Visual Interfaces (Salerno, Italy) (AVI ’20). Association for Computing Machinery, New York, NY, USA, Article 51, 5 pages. https://doi.org/10.1145/3399715.3399914",
      "doi": "10.1145/3399715.3399914"
    },
    {
      "text": "Andrew Bragdon, Rob DeLine, Ken Hinckley, and Meredith Ringel Morris. 2011. Code Space: Touch + Air Gesture Hybrid Interactions for Supporting Developer Meetings. In Proceedings of the ACM International Conference on Interactive Tabletops and Surfaces(ITS ’11). Association for Computing Machinery, New York, NY, USA, 212–221. https://doi.org/10.1145/2076354.2076393",
      "doi": "10.1145/2076354.2076393"
    },
    {
      "text": "Ellie Violet Bramley. 2021. Therapists report huge rise in cases of anxiety as England ends Covid rules. https://www.theguardian.com/world/2021/jul/11/therapists-report-huge-rise-in-cases-of-anxiety-as-england-ends-covid-rules.",
      "doi": ""
    },
    {
      "text": "Tom Carter, Sue Ann Seah, Benjamin Long, Bruce Drinkwater, and Sriram Subramanian. 2013. UltraHaptics: Multi-Point Mid-Air Haptic Feedback for Touch Surfaces. In Proceedings of the 26th Annual ACM Symposium on User Interface Software and Technology(UIST ’13). Association for Computing Machinery, New York, NY, USA, 505–514. https://doi.org/10.1145/2501988.2502018",
      "doi": "10.1145/2501988.2502018"
    },
    {
      "text": "Centers for Disease Control and Prevention. 2021. Science Brief: SARS-CoV-2 and Surface (Fomite) Transmission for Indoor Community Environments. https://www.cdc.gov/coronavirus/2019-ncov/more/science-and-research/surface-transmission.html.",
      "doi": ""
    },
    {
      "text": "Alex WH Chin, Julie TS Chu, Mahen RA Perera, Kenrie PY Hui, Hui-Ling Yen, Michael CW Chan, Malik Peiris, and Leo LM Poon. 2020. Stability of SARS-CoV-2 in different environmental conditions. The Lancet Microbe 1, 1 (2020), e10. https://doi.org/10.1016/S2666-5247(20)30003-3",
      "doi": ""
    },
    {
      "text": "Aarthi Easwara Moorthy and Kim-Phuong L Vu. 2015. Privacy Concerns for Use of Voice Activated Personal Assistant in the Public Space. International Journal of Human-Computer Interaction 31, 4(2015), 307–335. https://doi.org/10.1080/10447318.2014.986642",
      "doi": ""
    },
    {
      "text": "Lars C Ebert, Gary Hatch, Garyfalia Ampanozi, Michael J Thali, and Steffen Ross. 2012. You can’t touch this: touch-free navigation through radiological images. Surgical Innovation 19, 3 (2012), 301–307. https://doi.org/10.1177/1553350611425508",
      "doi": ""
    },
    {
      "text": "Marco Furini, Silvia Mirri, Manuela Montangero, and Catia Prandi. 2020. On the Usage of Smart Speakers During the Covid-19 Coronavirus Lockdown. In Proceedings of the 6th EAI International Conference on Smart Objects and Technologies for Social Good (Antwerp, Belgium) (GoodTechs ’20). Association for Computing Machinery, New York, NY, USA, 187–192. https://doi.org/10.1145/3411170.3411260",
      "doi": "10.1145/3411170.3411260"
    },
    {
      "text": "Vito Gentile, Salvatore Sorce, Alessio Malizia, Dario Pirrello, and Antonio Gentile. 2016. Touchless Interfaces For Public Displays: Can We Deliver Interface Designers From Introducing Artificial Push Button Gestures?. In Proceedings of the International Working Conference on Advanced Visual Interfaces(AVI ’16). Association for Computing Machinery, New York, NY, USA, 40–43. https://doi.org/10.1145/2909132.2909282",
      "doi": "10.1145/2909132.2909282"
    },
    {
      "text": "Emanuel Goldman. 2020. Exaggerated risk of transmission of COVID-19 by fomites. The Lancet Infectious Diseases 20, 8 (2020), 892–893. https://doi.org/10.1016/S1473-3099(20)30561-2",
      "doi": ""
    },
    {
      "text": "Connie Golsteijn, Sarah Gallacher, Lisa Koeman, Lorna Wall, Sami Andberg, Yvonne Rogers, and Licia Capra. 2015. VoxBox: A Tangible Machine That Gathers Opinions from the Public at Events. In Proceedings of the Ninth International Conference on Tangible, Embedded, and Embodied Interaction (Stanford, California, USA) (TEI ’15). Association for Computing Machinery, New York, NY, USA, 201–208. https://doi.org/10.1145/2677199.2680588",
      "doi": "10.1145/2677199.2680588"
    },
    {
      "text": "Lukas Grasse, Sylvain J Boutros, and Matthew S Tata. 2021. Speech Interaction to Control a Hands-Free Delivery Robot for High-Risk Health Care Scenarios. Frontiers in Robotics and AI 8, 612750 (2021), 9 pages. https://doi.org/10.3389/frobt.2021.612750",
      "doi": ""
    },
    {
      "text": "David E Harbourt, Andrew D Haddow, Ashley E Piper, Holly Bloomfield, Brian J Kearney, David Fetterer, Kathleen Gibson, and Timothy Minogue. 2020. Modeling the stability of severe acute respiratory syndrome coronavirus 2 (SARS-CoV-2) on skin, currency, and clothing. PLoS neglected tropical diseases 14, 11 (2020), e0008831. https://doi.org/10.1371/journal.pntd.0008831",
      "doi": ""
    },
    {
      "text": "Abigail P. Harvey, Erica R. Fuhrmeister, Molly E. Cantrell, Ana K. Pitol, Jenna M. Swarthout, Julie E. Powers, Maya L. Nadimpalli, Timothy R. Julian, and Amy J. Pickering. 2020. Longitudinal Monitoring of SARS-CoV-2 RNA on High-Touch Surfaces in a Community Setting. Environmental Science & Technology Letters 8, 2 (dec 2020), 168–175. https://doi.org/10.1021/acs.estlett.0c00875",
      "doi": ""
    },
    {
      "text": "Luke Hespanhol and Martin Tomitsch. 2019. Power to the People: Hacking the City with Plug-In Interfaces for Community Engagement. Springer Singapore, Singapore, 25–50. https://doi.org/10.1007/978-981-13-2694-3_2",
      "doi": ""
    },
    {
      "text": "Luke Hespanhol, Martin Tomitsch, Oliver Bown, and Miriama Young. 2014. Using Embodied Audio-Visual Interaction to Promote Social Encounters around Large Media Façades. In Proceedings of the 2014 Conference on Designing Interactive Systems (Vancouver, BC, Canada) (DIS ’14). Association for Computing Machinery, New York, NY, USA, 945–954. https://doi.org/10.1145/2598510.2598568",
      "doi": "10.1145/2598510.2598568"
    },
    {
      "text": "Takayuki Hoshi, Masafumi Takahashi, Takayuki Iwamoto, and Hiroyuki Shinoda. 2010. Noncontact Tactile Display Based on Radiation Pressure of Airborne Ultrasound. IEEE Transactions on Haptics 3, 3 (2010), 155–165. https://doi.org/10.1109/TOH.2010.4",
      "doi": "10.1109/TOH.2010.4"
    },
    {
      "text": "Kaori Ikematsu, Kunihiro Kato, and Yoshihiro Kawahara. 2021. LightTouch Gadgets: Extending Interactions on Capacitive Touchscreens by Converting Light Emission to Touch Inputs. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, Article 509, 11 pages. https://doi.org/10.1145/3411764.3445581",
      "doi": "10.1145/3411764.3445581"
    },
    {
      "text": "Muhammad Zahid Iqbal and Abraham Campbell. 2020. The Emerging Need for Touchless Interaction Technologies. Interactions 27, 4 (July 2020), 51–52. https://doi.org/10.1145/3406100",
      "doi": "10.1145/3406100"
    },
    {
      "text": "Muhammad Zahid Iqbal, Eleni Mangina, and Abraham G Campbell. 2021. Exploring the Real-Time Touchless Hand Interaction and Intelligent Agents in Augmented Reality Learning Applications. In 2021 7th International Conference of the Immersive Learning Research Network (iLRN). IEEE, New York, NY, USA, 1–8. https://doi.org/10.23919/iLRN52045.2021.9459415",
      "doi": ""
    },
    {
      "text": "Shahram Jalaliniya, Jeremiah Smith, Miguel Sousa, Lars Büthe, and Thomas Pederson. 2013. Touch-Less Interaction with Medical Images Using Hand & Foot Gestures. In Proceedings of the 2013 ACM Conference on Pervasive and Ubiquitous Computing Adjunct Publication(UbiComp ’13 Adjunct). Association for Computing Machinery, New York, NY, USA, 1265–1274. https://doi.org/10.1145/2494091.2497332",
      "doi": "10.1145/2494091.2497332"
    },
    {
      "text": "Yu-Sian Jiang, Garrett Warnell, and Peter Stone. 2018. Inferring User Intention Using Gaze in Vehicles. In Proceedings of the 20th ACM International Conference on Multimodal Interaction(ICMI ’18). Association for Computing Machinery, New York, NY, USA, 298–306. https://doi.org/10.1145/3242969.3243018",
      "doi": "10.1145/3242969.3243018"
    },
    {
      "text": "Rose Johnson, Kenton O’Hara, Abigail Sellen, Claire Cousins, and Antonio Criminisi. 2011. Exploring the Potential for Touchless Interaction in Image-Guided Interventional Radiology. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI ’11). Association for Computing Machinery, New York, NY, USA, 3323–3332. https://doi.org/10.1145/1978942.1979436",
      "doi": "10.1145/1978942.1979436"
    },
    {
      "text": "Mohamed Khamis, Florian Alt, and Andreas Bulling. 2015. A Field Study on Spontaneous Gaze-Based Interaction with a Public Display Using Pursuits. In Adjunct Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2015 ACM International Symposium on Wearable Computers (Osaka, Japan) (UbiComp/ISWC’15 Adjunct). Association for Computing Machinery, New York, NY, USA, 863–872. https://doi.org/10.1145/2800835.2804335",
      "doi": "10.1145/2800835.2804335"
    },
    {
      "text": "Mohamed Khamis, Axel Hoesl, Alexander Klimczak, Martin Reiss, Florian Alt, and Andreas Bulling. 2017. EyeScout: Active Eye Tracking for Position and Movement Independent Gaze Interaction with Large Public Displays. In Proceedings of the 30th Annual ACM Symposium on User Interface Software and Technology (Québec City, QC, Canada) (UIST ’17). Association for Computing Machinery, New York, NY, USA, 155–166. https://doi.org/10.1145/3126594.3126630",
      "doi": "10.1145/3126594.3126630"
    },
    {
      "text": "Robert Langreth. 2021. The Five Things to Get Right Before the Next Pandemic. https://www.bloomberg.com/news/features/2021-02-03/steps-needed-to-prevent-the-next-pandemic",
      "doi": ""
    },
    {
      "text": "Dyani Lewis. 2021. COVID-19 rarely spreads through surfaces. So why are we still deep cleaning?Nature 590, 7844 (Jan 2021), 26–28. https://doi.org/10.1038/d41586-021-00251-4",
      "doi": ""
    },
    {
      "text": "Jaime Lien, Nicholas Gillian, M. Emre Karagozler, Patrick Amihood, Carsten Schwesig, Erik Olson, Hakim Raja, and Ivan Poupyrev. 2016. Soli: Ubiquitous Gesture Sensing with Millimeter Wave Radar. ACM Trans. Graph. 35, 4 (July 2016), 19 pages. https://doi.org/10.1145/2897824.2925953",
      "doi": "10.1145/2897824.2925953"
    },
    {
      "text": "Irene Lopatovska and Heyrling Oropeza. 2019. User interactions with “Alexa” in public academic space. Proceedings of the Association for Information Science and Technology 55, 1 (2019), 309–318.",
      "doi": ""
    },
    {
      "text": "Ville Mäkelä, Tomi Heimonen, Matti Luhtala, and Markku Turunen. 2014. Information Wall: Evaluation of a Gesture-Controlled Public Display. In Proceedings of the 13th International Conference on Mobile and Ubiquitous Multimedia(Melbourne, Victoria, Australia) (MUM ’14). Association for Computing Machinery, New York, NY, USA, 228–231. https://doi.org/10.1145/2677972.2677998",
      "doi": "10.1145/2677972.2677998"
    },
    {
      "text": "Agata Manolova. 2014. System for touchless interaction with medical images in surgery using Leap Motion. In 9th International Conference on Communication, Electromagnetic and Medical Applications (CEMA’14). Technical University of Sofia, Sofia, Bulgaria, 5 pages.",
      "doi": ""
    },
    {
      "text": "Nicolai Marquardt, Robert Diaz-Marino, Sebastian Boring, and Saul Greenberg. 2011. The Proximity Toolkit: Prototyping Proxemic Interactions in Ubiquitous Computing Ecologies. In Proceedings of the 24th Annual ACM Symposium on User Interface Software and Technology (Santa Barbara, California, USA) (UIST ’11). Association for Computing Machinery, New York, NY, USA, 315–326. https://doi.org/10.1145/2047196.2047238",
      "doi": "10.1145/2047196.2047238"
    },
    {
      "text": "Ray Massey. 2020. Has Covid-19 sounded the death knell for in-car touchscreens? Jaguar Land Rover’s new contact-free technology helps to prevent the spread of viruses. https://www.thisismoney.co.uk/money/cars/article-8549525/JLRs-new-contactless-touchscreen-tech-prevents-spread-Covid-19.html",
      "doi": ""
    },
    {
      "text": "Amy Maxmen. 2021. Has COVID taught us anything about pandemic preparedness?Nature 596, 7872 (2021), 332–335. https://doi.org/10.1038/d41586-021-02217-y",
      "doi": ""
    },
    {
      "text": "David Meyer. 2021. Survey finds 3 out of 4 Riders SAY MTA cleaning For COVID makes them feel safer. https://nypost.com/2021/01/19/3-out-of-4-riders-say-mta-cleaning-for-covid-makes-them-feel-safer/",
      "doi": ""
    },
    {
      "text": "Jörg Müller, Dieter Eberle, and Konrad Tollmar. 2014. Communiplay: A Field Study of a Public Display Mediaspace. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 1415–1424. https://doi.org/10.1145/2556288.2557001",
      "doi": "10.1145/2556288.2557001"
    },
    {
      "text": "Rajalakshmi Nandakumar, Vikram Iyer, Desney Tan, and Shyamnath Gollakota. 2016. FingerIO: Using Active Sonar for Fine-Grained Finger Tracking. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 1515–1525. https://doi.org/10.1145/2858036.2858580",
      "doi": "10.1145/2858036.2858580"
    },
    {
      "text": "Kenton O’Hara, Gerardo Gonzalez, Abigail Sellen, Graeme Penney, Andreas Varnavas, Helena Mentis, Antonio Criminisi, Robert Corish, Mark Rouncefield, Neville Dastur, and Tom Carrell. 2014. Touchless Interaction in Surgery. Commun. ACM 57, 1 (Jan. 2014), 70–77. https://doi.org/10.1145/2541883.2541899",
      "doi": "10.1145/2541883.2541899"
    },
    {
      "text": "Kenton O’Hara, Richard Harper, Helena Mentis, Abigail Sellen, and Alex Taylor. 2013. On the Naturalness of Touchless: Putting the “Interaction” Back into NUI. ACM Trans. Comput.-Hum. Interact. 20, 1, Article 5 (apr 2013), 25 pages. https://doi.org/10.1145/2442106.2442111",
      "doi": ""
    },
    {
      "text": "Karri Palovuori, Ismo Rakkolainen, and Antti Sand. 2014. Bidirectional Touch Interaction for Immaterial Displays. In Proceedings of the 18th International Academic MindTrek Conference: Media Business, Management, Content & Services (Tampere, Finland) (AcademicMindTrek ’14). Association for Computing Machinery, New York, NY, USA, 74–76. https://doi.org/10.1145/2676467.2676503",
      "doi": "10.1145/2676467.2676503"
    },
    {
      "text": "Jennifer Pearson, Simon Robinson, Thomas Reitmaier, Matt Jones, Shashank Ahire, Anirudha Joshi, Deepak Sahoo, Nimish Maravi, and Bhakti Bhikne. 2019. StreetWise: Smart Speakers vs Human Help in Public Slum Settings. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300326",
      "doi": "10.1145/3290605.3300326"
    },
    {
      "text": "Aristotelis Perrakis, Werner Hohenberger, and Thomas Horbach. 2013. Integrated operation systems and voice recognition in minimally invasive surgery: comparison of two systems. Surgical endoscopy 27, 2 (2013), 575–579.",
      "doi": ""
    },
    {
      "text": "Julie Rico and Stephen Brewster. 2010. Usable Gestures for Mobile Interfaces: Evaluating Social Acceptability. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Atlanta, Georgia, USA) (CHI ’10). Association for Computing Machinery, New York, NY, USA, 887–896. https://doi.org/10.1145/1753326.1753458",
      "doi": "10.1145/1753326.1753458"
    },
    {
      "text": "Simon Robinson, Jennifer Pearson, Shashank Ahire, Rini Ahirwar, Bhakti Bhikne, Nimish Maravi, and Matt Jones. 2018. Revisiting “Hole in the Wall” Computing: Private Smart Speakers and Public Slum Settings. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3174072",
      "doi": ""
    },
    {
      "text": "Marco Roccetti, Gustavo Marfia, and Angelo Semeraro. 2012. Playing into the wild: A gesture-based interface for gaming in public spaces. Journal of Visual Communication and Image Representation 23, 3(2012), 426–440. https://doi.org/10.1016/j.jvcir.2011.12.006",
      "doi": "10.1016/j.jvcir.2011.12.006"
    },
    {
      "text": "Guilherme Cesar Soares Ruppert, Paulo Henrique Junqueira Amorim, Thiago Franco de Moraes, and Jorge Vicente Lopes da Silva. 2011. Touchless gesture user interface for 3D visualization using Kinect platform and open-source frameworks. In Proceedings of the Fifth International Conference on Advanced Research in Virtual and Rapid Prototyping. Taylor & Francis, Oxford, UK, 215–219.",
      "doi": ""
    },
    {
      "text": "Guilherme Cesar Soares Ruppert, Leonardo Oliveira Reis, Paulo Henrique Junqueira Amorim, Thiago Franco de Moraes, and Jorge Vicente Lopes da Silva. 2012. Touchless gesture user interface for interactive image visualization in urological surgery. World journal of urology 30, 5 (2012), 687–691. https://doi.org/10.1007/s00345-012-0879-0",
      "doi": ""
    },
    {
      "text": "Christos Sagonas, Epameinondas Antonakos, Georgios Tzimiropoulos, Stefanos Zafeiriou, and Maja Pantic. 2016. 300 Faces In-The-Wild Challenge. Image Vision Comput. 47, C (March 2016), 3–18. https://doi.org/10.1016/j.imavis.2016.01.002",
      "doi": ""
    },
    {
      "text": "Antti Sand, Ismo Rakkolainen, Poika Isokoski, Jari Kangas, Roope Raisamo, and Karri Palovuori. 2015. Head-Mounted Display with Mid-Air Tactile Feedback. In Proceedings of the 21st ACM Symposium on Virtual Reality Software and Technology (Beijing, China) (VRST ’15). Association for Computing Machinery, New York, NY, USA, 51–58. https://doi.org/10.1145/2821592.2821593",
      "doi": "10.1145/2821592.2821593"
    },
    {
      "text": "Antti Sand, Ismo Rakkolainen, Poika Isokoski, Roope Raisamo, and Karri Palovuori. 2015. Light-weight immaterial particle displays with mid-air tactile feedback. In 2015 IEEE International Symposium on Haptic, Audio and Visual Environments and Games (HAVE). IEEE, New York, NY, USA, 1–5. https://doi.org/10.1109/HAVE.2015.7359448",
      "doi": "10.1109/HAVE.2015.7359448"
    },
    {
      "text": "Ava Scott, Thomas Reitmaier, Matt Jones, and Yvonne Rogers. 2021. Mind the Gap: How Good Are We at Keeping Our Distance?Interactions 28, 4 (June 2021), 44–49. https://doi.org/10.1145/3469123",
      "doi": ""
    },
    {
      "text": "Ingo Siegert. 2020. “Alexa in the wild”–Collecting unconstrained conversations with a modern voice assistant in a public environment. In Proceedings of the 12th Conference on Language Resources and Evaluation (LREC 2020). European Language Resources Association, Paris, France, 615–619.",
      "doi": ""
    },
    {
      "text": "Salvatore Sorce, Vito Gentile, Cristina Enea, Antonio Gentile, Alessio Malizia, and Fabrizio Milazzo. 2017. A Touchless Gestural System for Extended Information Access Within a Campus. In Proceedings of the 2017 ACM SIGUCCS Annual Conference(SIGUCCS ’17). Association for Computing Machinery, New York, NY, USA, 37–43. https://doi.org/10.1145/3123458.3123459",
      "doi": "10.1145/3123458.3123459"
    },
    {
      "text": "Fabius Steinberger, Marcus Foth, and Florian Alt. 2014. Vote With Your Feet: Local Community Polling on Urban Screens. In Proceedings of The International Symposium on Pervasive Displays(PerDis ’14). Association for Computing Machinery, New York, NY, USA, 44–49. https://doi.org/10.1145/2611009.2611015",
      "doi": "10.1145/2611009.2611015"
    },
    {
      "text": "Matt Strickland, Jamie Tremaine, Greg Brigley, and Calvin Law. 2013. Using a depth-sensing infrared camera system to access and manipulate medical imaging from within the sterile operating field. Canadian Journal of Surgery 56, 3 (2013), E1. https://doi.org/10.1503/cjs.035311",
      "doi": ""
    },
    {
      "text": "Ke Sun, Yuntao Wang, Chun Yu, Yukang Yan, Hongyi Wen, and Yuanchun Shi. 2017. Float: One-Handed and Touch-Free Target Selection on Smartwatches. Association for Computing Machinery, New York, NY, USA, 692–704. https://doi.org/10.1145/3025453.3026027",
      "doi": "10.1145/3025453.3026027"
    },
    {
      "text": "Hitomi Tsujita and Jun Rekimoto. 2011. HappinessCounter: Smile-Encouraging Appliance to Increase Positive Mood. In CHI ’11 Extended Abstracts on Human Factors in Computing Systems (Vancouver, BC, Canada) (CHI EA ’11). Association for Computing Machinery, New York, NY, USA, 117–126. https://doi.org/10.1145/1979742.1979608",
      "doi": ""
    },
    {
      "text": "London South Bank University. 2021. The pandemic’s mental toll: new survey finds one in five suffer from Covid-19 Anxiety Syndrome. https://www.lsbu.ac.uk/about-us/news/the-pandemics-mental-toll-new-survey-finds-one-in-five-suffer-from-covid-19-anxiety-syndrome",
      "doi": ""
    },
    {
      "text": "Nina Valkanova, Robert Walter, Andrew Vande Moere, and Jörg Müller. 2014. MyPosition: Sparking Civic Discourse by a Public Interactive Poll Visualization. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’14). Association for Computing Machinery, New York, NY, USA, 1323–1332. https://doi.org/10.1145/2531602.2531639",
      "doi": "10.1145/2531602.2531639"
    },
    {
      "text": "Neeltje Van Doremalen, Trenton Bushmaker, Dylan H Morris, Myndi G Holbrook, Amandine Gamble, Brandi N Williamson, Azaibi Tamin, Jennifer L Harcourt, Natalie J Thornburg, Susan I Gerber, 2020. Aerosol and surface stability of SARS-CoV-2 as compared with SARS-CoV-1. New England Journal of Medicine 382, 16 (2020), 1564–1567. https://doi.org/10.1056/NEJMc2004973",
      "doi": ""
    },
    {
      "text": "Graham Wilson, Thomas Carter, Sriram Subramanian, and Stephen A. Brewster. 2014. Perception of Ultrasonic Haptic Feedback on the Hand: Localisation and Apparent Motion. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (Toronto, Ontario, Canada) (CHI ’14). Association for Computing Machinery, New York, NY, USA, 1133–1142. https://doi.org/10.1145/2556288.2557033",
      "doi": "10.1145/2556288.2557033"
    },
    {
      "text": "World Health Organization. 2020. Cleaning and disinfection of environmental surfaces in the context of COVID-19. https://www.who.int/publications/i/item/cleaning-and-disinfection-of-environmental-surfaces-inthe-context-of-covid-19.",
      "doi": ""
    },
    {
      "text": "Hao Zhang, Yafeng Yin, Lei Xie, and Sanglu Lu. 2020. AirTyping: A Mid-Air Typing Scheme Based on Leap Motion. In Adjunct Proceedings of the 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2020 ACM International Symposium on Wearable Computers(UbiComp-ISWC ’20). Association for Computing Machinery, New York, NY, USA, 168–171. https://doi.org/10.1145/3410530.3414387",
      "doi": ""
    }
  ]
}