{
  "doi": "10.1145/3491102.3517509",
  "title": "“As Uploaders, We Have the Responsibility”: Individualized Professionalization of Bilibili Uploaders",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "The prevalence of social media blurs the boundaries between consumer and producer, work and play, and leads to new social roles, professions, and identities (e.g. blogger, YouTuber, micro-celebrity). However, we still lack a clear understanding of how people come to identify with these new roles and how individual professional development is digitally mediated. This paper presents a study based on Bilibili, a popular Chinese social media platform featuring user-generated videos, and highlights a professionalization process through which individuals consciously distinguish between the roles of uploaders and consumers, develop a shared work ethos around the role of the uploader, and, as uploaders, improve their technical-professional expertise. We conclude by discussing individualized professionalization as a concept that describes the bottom-up and community-based process of professional development for User Generated Content (UGC) taking place in contemporary digital media environments.",
  "tags": [
    "Online Creative Media",
    "User Generated Content (UGC)",
    "Profession",
    "Professionalization"
  ],
  "authors": [
    {
      "name": "Xianghua(Sharon) Ding",
      "institution": "School of Computer Science, University of Glasgow, United Kingdom and School of Computer Science, Fudan University, China",
      "img": "/do/10.1145/contrib-81539424156/rel-imgonly/81539424156.png",
      "acmid": "81539424156",
      "orcid": "0000-0001-8122-6252"
    },
    {
      "name": "Yubo Kou",
      "institution": "College of Information Sciences and Technology, Pennsylvania State University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659020443",
      "orcid": "0000-0002-4255-3725"
    },
    {
      "name": "Yiwen Xu",
      "institution": "Fudan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234300",
      "orcid": "missing"
    },
    {
      "name": "Peng Zhang",
      "institution": "Fudan University, China",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87358745057",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Adiya Abisheva, Venkata Rama Kiran Garimella, David Garcia, and Ingmar Weber. 2014. Who watches (and shares) what on youtube? and when? using twitter to understand youtube viewership. In Proceedings of the 7th ACM international conference on Web search and data mining. Association for Computing Machinery, New York, NY, USA, 593–602.",
      "doi": ""
    },
    {
      "text": "Chadia Abras, Diane Maloney-Krichmar, Jenny Preece, 2004. User-centered design. Bainbridge, W. Encyclopedia of Human-Computer Interaction. Thousand Oaks: Sage Publications 37, 4 (2004), 445–456.",
      "doi": ""
    },
    {
      "text": "Shaosong Ou Alexander Hars. 2002. Working for free? Motivations for participating in open-source projects. International journal of electronic commerce 6, 3 (2002), 25–39.",
      "doi": ""
    },
    {
      "text": "Alice Audrezet, Gwarlann de Kerviler, and Julie Guidry Moulard. 2020. Authenticity under threat: When social media influencers need to go beyond self-presentation. Journal of business research 117 (2020), 557–569.",
      "doi": ""
    },
    {
      "text": "Nancy K Baym. 2015. Connect with your audience! The relational labor of connection. The communication review 18, 1 (2015), 14–22.",
      "doi": ""
    },
    {
      "text": "Bilibili. 2021. Industry Report. https://www.bilibili.com/read/cv9161223.",
      "doi": ""
    },
    {
      "text": "Taylor Brydges and Jenny Sjöholm. 2019. Becoming a personal style blogger: Changing configurations and spatialities of aesthetic labour in the fashion industry. International journal of cultural studies 22, 1 (2019), 119–139.",
      "doi": ""
    },
    {
      "text": "Peter J Burke and Jan E Stets. 2009. Identity theory. Oxford University Press.",
      "doi": ""
    },
    {
      "text": "Liu Chang-de. 2006. De-skilling effects on journalists: ICTs and the labour process of Taiwanese newspaper reporters. Canadian Journal of Communication 31, 3 (2006), 695.",
      "doi": ""
    },
    {
      "text": "Morris L Cogan. 1955. The problem of defining a profession. The Annals of the American Academy of Political and Social Science 297, 1(1955), 105–111.",
      "doi": ""
    },
    {
      "text": "Eric Cook, Stephanie D. Teasley, and Mark S. Ackerman. 2009. Contribution, Commercialization I&; Audience: Understanding Participation in an Online Creative Community. In Proceedings of the ACM 2009 International Conference on Supporting Group Work (Sanibel Island, Florida, USA) (GROUP ’09). Association for Computing Machinery, New York, NY, USA, 41–50. https://doi.org/10.1145/1531674.1531681",
      "doi": "10.1145/1531674.1531681"
    },
    {
      "text": "Charles Horton Cooley. 1902. Looking-glass self. The production of reality: Essays and readings on social interaction 6 (1902), 126–128.",
      "doi": ""
    },
    {
      "text": "Philip Crang. 1994. It’s showtime: on the workplace geographies of display in a restaurant in southeast England. Environment and Planning D: Society and Space 12, 6 (1994), 675–704.",
      "doi": ""
    },
    {
      "text": "Stuart Cunningham and David Craig. 2019. Creator governance in social media entertainment. Social Media+ Society 5, 4 (2019), 2056305119883428.",
      "doi": ""
    },
    {
      "text": "Sanchari Das, Javon Goard, and Dakota Murray. 2017. How celebrities feed tweeples with personal and promotional tweets: celebrity twitter use and audience engagement. In Proceedings of the 8th International Conference on Social Media & Society. Association for Computing Machinery, New York, NY, USA, 1–5.",
      "doi": "10.1145/3097286.3097316"
    },
    {
      "text": "Hilary Davis, Jenny Waycott, and Shou Zhou. 2015. Beyond YouTube: Sharing personal digital stories on a community display. In Proceedings of the Annual Meeting of the Australian Special Interest Group for Computer Human Interaction. Association for Computing Machinery, New York, NY, USA, 579–587.",
      "doi": "10.1145/2838739.2838771"
    },
    {
      "text": "Rebecca Davis. 2020. China’s streamer Bilibili aims to embrace a wider audience without alienating its fans. https://variety.com/2020/digital/features/china-streaming-bilibili-1234617963/",
      "doi": ""
    },
    {
      "text": "Greig De Peuter. 2011. Creative economy and labor precarity: A contested convergence. Journal of communication inquiry 35, 4 (2011), 417–425.",
      "doi": ""
    },
    {
      "text": "Paul H Delfabbro and Anthony H Winefeld. 2000. Predictors of irrational thinking in regular slot machine gamblers. The Journal of psychology 134, 2 (2000), 117–128.",
      "doi": ""
    },
    {
      "text": "Brooke Erin Duffy. 2018. (Not) Getting Paid to Do What You Love: Gender, Social Media, and Aspirational Work. Yale University Press. https://doi.org/10.12987/9780300227666",
      "doi": ""
    },
    {
      "text": "María-José Establés. 2019. Gamers, writers and social media influencers: professionalisation processes among teenagers. Revista Latina de Comunicación Social(2019), 214 – 236.",
      "doi": ""
    },
    {
      "text": "Guo Freeman, Nathan McNeese, Jeffrey Bardzell, and Shaowen Bardzell. 2020. ”Pro-Amateur”-Driven Technological Innovation: Participation and Challenges in Indie Game Development. Proceedings of the ACM on Human-Computer Interaction 4, GROUP(2020), 1–22.",
      "doi": "10.1145/3375184"
    },
    {
      "text": "Eliot Freidson. 2001. Professionalism, the third logic: On the practice of knowledge. University of Chicago press.",
      "doi": ""
    },
    {
      "text": "Tom Funk. 2008. Web 2.0 and Beyond: Understanding the New Online Business Models, Trends, and Technologies: Understanding the New Online Business Models, Trends, and Technologies. ABC-CLIO.",
      "doi": ""
    },
    {
      "text": "Florencia García-Rapp and Carles Roc-Cuberes. 2017. Being an online celebrity: Norms and expectations of YouTube’s beauty community. First Monday 22, 7 (2017).",
      "doi": ""
    },
    {
      "text": "Oren Golan and Deby Babis. 2019. Towards professionalism through social networks: constructing an occupational community via Facebook usage by temporary migrant workers from the Philippines. Information, Communication & Society 22, 9 (2019), 1230–1252. https://doi.org/10.1080/1369118X.2017.1411520 arXiv:https://doi.org/10.1080/1369118X.2017.1411520",
      "doi": ""
    },
    {
      "text": "Stephen Richards Graubard. 1997. The American academic profession. Transaction Publishers.",
      "doi": ""
    },
    {
      "text": "Nicky Gregson and Gillian Rose. 2000. Taking Butler elsewhere: performativities, spatialities and subjectivities. Environment and Planning D: Society and space 18, 4 (2000), 433–452.",
      "doi": ""
    },
    {
      "text": "Mar Guerrero-Pico, Maria-Jose Masanet, and Carlos A Scolari. 2019. Toward a typology of young produsers: Teenagers’transmedia skills, media production, and narrative and aesthetic appreciation. New Media & Society 21, 2 (2019), 336–353.",
      "doi": ""
    },
    {
      "text": "Susan Hanson and Geraldine Pratt. 2003. Gender, work and space. Routledge.",
      "doi": ""
    },
    {
      "text": "Mingyi Hou. 2019. Social media celebrity and the institutionalization of YouTube. Convergence 25, 3 (2019), 534–553.",
      "doi": ""
    },
    {
      "text": "William James. 2007. The principles of psychology. Vol. 1. Cosimo, Inc.",
      "doi": ""
    },
    {
      "text": "Anne Jerslev and Mette Mortensen. 2018. Celebrity in the social media age: Renegotiating the public and the private. In Routledge handbook of celebrity studies. Routledge, 157–174.",
      "doi": ""
    },
    {
      "text": "TJ Johnson. 1984. Professionalism: occupation or ideology. Education for the Professions: Quis custodiet (1984), 17–25.",
      "doi": ""
    },
    {
      "text": "Ana Jorge, Lidia Marôpo, and Thays Nunes. 2018. “I am not being sponsored to say this”: a teen youtuber and her audience negotiate branded content. Observatorio (OBS*) (2018).",
      "doi": ""
    },
    {
      "text": "Susie Khamis, Lawrence Ang, and Raymond Welling. 2017. Self-branding, ‘micro-celebrity’ and the rise of Social Media Influencers. Celebrity Studies 8, 2 (2017), 191–208. https://doi.org/10.1080/19392397.2016.1218292 arXiv:https://doi.org/10.1080/19392397.2016.1218292",
      "doi": ""
    },
    {
      "text": "Jin Kim. 2012. The institutionalization of YouTube: From user-generated content to professionally generated content. Media, culture & society 34, 1 (2012), 53–67.",
      "doi": ""
    },
    {
      "text": "Yubo Kou and Colin M Gray. 2018. Towards professionalization in an online community of emerging occupation: Discourses among UX practitioners. In Proceedings of the 2018 ACM Conference on Supporting Groupwork. ACM New York, NY, USA, 322–334.",
      "doi": "10.1145/3148330.3148352"
    },
    {
      "text": "Yubo Kou and Colin M Gray. 2018. “What do you recommend a complete beginner like me to practice?” Professional Self-Disclosure in an Online Community. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–24.",
      "doi": ""
    },
    {
      "text": "Yubo Kou, Colin M Gray, Austin L Toombs, and Robin S Adams. 2018. Understanding social roles in an online community of volatile practice: A study of user experience practitioners on reddit. ACM Transactions on Social Computing 1, 4 (2018), 1–22.",
      "doi": "10.1145/3283827"
    },
    {
      "text": "Bastian Lange. 2011. Professionalization in space: Social-spatial strategies of culturepreneurs in Berlin. Entrepreneurship and regional development 23, 3-4 (2011), 259–279.",
      "doi": ""
    },
    {
      "text": "Rebecca Lewis. 2020. “This is what the news won’t show you”: YouTube creators and the reactionary politics of micro-celebrity. Television & New Media 21, 2 (2020), 201–217.",
      "doi": ""
    },
    {
      "text": "Qian Li. 2020. 除了个人UP主 B站也开始欢迎MCN入驻了. https://m.ebrun.com/411271.html",
      "doi": ""
    },
    {
      "text": "Simon Lindgren. 2012. “It took me about half an hour, but I did it!” Media circuits and affinity spaces around how-to videos on YouTube. European Journal of Communication 27, 2 (2012), 152–170.",
      "doi": ""
    },
    {
      "text": "Ramon Lobato. 2016. The cultural logic of digital intermediaries: YouTube multichannel networks. Convergence 22, 4 (2016), 348–360.",
      "doi": ""
    },
    {
      "text": "Yin Lu. 2016. Chinese youth add their personal touch to the burgeoning global meme subculture. https://www.globaltimes.cn/content/991384.shtml",
      "doi": ""
    },
    {
      "text": "Renkai Ma and Yubo Kou. 2021. “How advertiser-friendly is my video?”: YouTuber’s Socioeconomic Interactions with Algorithmic Content Moderation. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 1–25.",
      "doi": "10.1145/3479573"
    },
    {
      "text": "Jennifer Marlow and Laura Dabbish. 2014. From rookie to all-star: professional development in a graphic design social networking site. In Proceedings of the 17th ACM conference on Computer supported cooperative work & social computing. Association for Computing Machinery, New York, NY, USA, 922–933.",
      "doi": "10.1145/2531602.2531651"
    },
    {
      "text": "Alice E. Marwick. 2013. Status Update: Celebrity, Publicity, and Branding in the Social Media Age. Yale University Press. https://doi.org/doi:10.12987/9780300199154",
      "doi": ""
    },
    {
      "text": "Linda McDowell. 1997. Women/gender/feminisms: doing feminist geography. Journal of geography in higher education 21, 3 (1997), 381–400.",
      "doi": ""
    },
    {
      "text": "Geraldine Mooney Simmie and Dawn Murphy. 2021. Professionalisation of early childhood education and care practitioners: Working conditions in Ireland. Contemporary Issues in Early Childhood(2021), 14639491211010187.",
      "doi": ""
    },
    {
      "text": "Wilbert Ellis Moore. 1970. The professions: Roles and rules. Russell Sage Foundation.",
      "doi": ""
    },
    {
      "text": "Mark Neal and John Morgan. 2000. The professionalization of everyone? A comparative study of the development of the professions in the United Kingdom and Germany. European sociological review 16, 1 (2000), 9–26.",
      "doi": ""
    },
    {
      "text": "Gunnar Olofsson. 2009. Everyone his/her own profession?(2009).",
      "doi": ""
    },
    {
      "text": "Dimitra Petrakaki, Nick Barber, and Justin Waring. 2012. The possibilities of technology in shaping healthcare professionals:(Re/De-) Professionalisation of pharmacists in England. Social Science & Medicine 75, 2 (2012), 429–437.",
      "doi": ""
    },
    {
      "text": "Tobias Raun. 2018. Capitalizing intimacy: New subcultural forms of micro-celebrity strategies and affective labour on YouTube. Convergence 24, 1 (2018), 99–113.",
      "doi": ""
    },
    {
      "text": "Noopur Raval and Joyojeet Pal. 2019. Making a “Pro”: ’Professionalism’ after Platforms in Beauty-Work. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 175 (Nov. 2019), 17 pages. https://doi.org/10.1145/3359277",
      "doi": "10.1145/3359277"
    },
    {
      "text": "George Ritzer and Nathan Jurgenson. 2010. Production, Consumption, Prosumption: The nature of capitalism in the age of the digital ‘prosumer’. Journal of Consumer Culture 10, 1 (2010), 13–36. https://doi.org/10.1177/1469540509354673 arXiv:https://doi.org/10.1177/1469540509354673",
      "doi": ""
    },
    {
      "text": "Paul Saffo. 2009. Get ready for a new economic era. McKinsey Quarterly 26(2009).",
      "doi": ""
    },
    {
      "text": "Ryan Schram. 2020. The state of the creator economy. Journal of Brand Strategy 9, 2 (2020), 152–162.",
      "doi": ""
    },
    {
      "text": "Theresa M Senft. 2013. Microcelebrity and the branded self. A companion to new media dynamics 11 (2013), 346–354.",
      "doi": ""
    },
    {
      "text": "[62] Dao Yue She.2021. https://space.bilibili.com/99157282",
      "doi": ""
    },
    {
      "text": "Anselm Strauss and Juliet Corbin. 1998. Basics of qualitative research techniques. Citeseer.",
      "doi": ""
    },
    {
      "text": "Yla Tausczik, Rosta Farzan, John Levine, and Robert Kraut. 2018. Effects of collective socialization on newcomers’response to feedback in online communities. ACM Transactions on Social Computing 1, 2 (2018), 1–23.",
      "doi": "10.1145/3191834"
    },
    {
      "text": "T. L. Taylor. 2018. Watch Me Play: Twitch and the Rise of Game Live Streaming. Princeton University Press. http://www.jstor.org/stable/j.ctvc77jqw",
      "doi": ""
    },
    {
      "text": "Tencent. 2020. 陈睿：B站实质是一个社区，70％流量分配给中小UP主. https://new.qq.com/rain/a/20200627A0KVVD",
      "doi": ""
    },
    {
      "text": "[67] Bi Dao THU.2021. https://space.bilibili.com/254463269",
      "doi": ""
    },
    {
      "text": "Etienne Wenger. 1999. Communities of Practice: Learning, Meaning, and Identity. Cambridge University Press.",
      "doi": ""
    },
    {
      "text": "Stanley Wenocur and Michael Reisch. 1983. The social work profession and the ideology of professionalization. J. Soc. & Soc. Welfare 10 (1983), 684.",
      "doi": ""
    },
    {
      "text": "Harold L Wilensky. 1964. The professionalization of everyone?American journal of sociology 70, 2 (1964), 137–158.",
      "doi": ""
    },
    {
      "text": "Xu Xin. 2021. 弹幕破100亿，收购有妖气，B站能否成“中国迪士尼”Live Streaming E-Commerce: Get Onboard Before It’s Too Late!https://pandaily.com/live-streaming-e-commerce-get-onboard-before-its-too-late/",
      "doi": ""
    },
    {
      "text": "Yiyi Yin. 2020. An emergent algorithmic culture: The data-ization of online fandom in China. International Journal of Cultural Studies 23, 4 (2020), 475–492.",
      "doi": ""
    },
    {
      "text": "Yiyi Yin and Anthony Fung. 2017. Youth online cultural participation and Bilibili: An alternative form of democracy in China?In Digital media integration for participatory democracy. IGI Global, 130–154.",
      "doi": ""
    },
    {
      "text": "Elaine Jing Zhao. 2016. Professionalization of Amateur Production in Online Screen Entertainment in China: Hopes, Frustrations and Uncertainties. International Journal of Communication 10 (2016), 19.",
      "doi": ""
    }
  ]
}