{
  "doi": "10.1145/3491102.3502007",
  "title": "Towards Decomposable Interactive Systems: Design of a Backyard-Degradable Wireless Heating Interface",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Sustainability is critical to our planet and thus our designs. Within HCI, there is a tension between the desire to create interactive electronic systems and sustainability. In this paper, we present the design of an interactive system comprising components that are entirely decomposable. We leverage the inherent material properties of natural materials, such as paper, leaf skeletons, and chitosan, along with silver nanowires to create a new system capable of being electrically controlled as a portable heater. This new decomposable system, capable of wirelessly heating to >70°C, is flexible, lightweight, low-cost, and reusable, and it maintains its functionality over long periods of heating and multiple power cycles. We detail its design and present a series of use cases, from enabling a novel resealable packaging system to acting as a catalyst for shape-changing designs and beyond. Finally, we highlight the important decomposable property of the interactive system when it meets end-of-life.",
  "tags": [
    "biodesign",
    "heating",
    "decomposable materials",
    "sustainability",
    "biodegradation"
  ],
  "authors": [
    {
      "name": "Katherine W Song",
      "institution": "Accenture Labs, United States and UC Berkeley, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659702382",
      "orcid": "0000-0001-7580-0035"
    },
    {
      "name": "Aditi Maheshwari",
      "institution": "Accenture Labs, United States",
      "img": "/do/10.1145/contrib-99659700981/rel-imgonly/aditi.jpg",
      "acmid": "99659700981",
      "orcid": "0000-0001-9828-0570"
    },
    {
      "name": "Eric M Gallo",
      "institution": "Accenture Labs, Accenture, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233313",
      "orcid": "0000-0001-9086-3480"
    },
    {
      "name": "Andreea Danielescu",
      "institution": "Accenture Labs, United States",
      "img": "/do/10.1145/contrib-81444607832/rel-imgonly/81444607832.png",
      "acmid": "81444607832",
      "orcid": "0000-0001-7460-2467"
    },
    {
      "name": "Eric Paulos",
      "institution": "UC Berkeley, United States",
      "img": "/do/10.1145/contrib-81100513321/rel-imgonly/ericpaulos.jpg",
      "acmid": "81100513321",
      "orcid": "0000-0002-3121-3354"
    }
  ],
  "references": [
    {
      "text": "Byoungkwon An, Hsiang-Yun Wu, Teng Zhang, Lining Yao, Ye Tao, Jianzhe Gu, Tingyu Cheng, Xiang ’Anthony’ Chen, Xiaoxiao Zhang, Wei Zhao, Youngwook Do, and Shigeo Takahashi. 2018. Thermorph: Democratizing 4D Printing of Self-Folding Materials and Interfaces. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18. ACM Press, Montreal QC, Canada, 1–12. https://doi.org/10.1145/3173574.3173834",
      "doi": "10.1145/3173574.3173834"
    },
    {
      "text": "María R. Ansorena, Norma E. Marcovich, and Mariana Pereda. 2018. Food Biopackaging Based on Chitosan. In Handbook of Ecomaterials, Leticia Myriam Torres Martínez, Oxana Vasilievna Kharissova, and Boris Ildusovich Kharisov (Eds.). Springer International Publishing, Cham, 1–27. https://doi.org/10.1007/978-3-319-48281-1_68-1",
      "doi": ""
    },
    {
      "text": "Walter Benjamin. 1935. The Work of Art in the Age of Mechanical Reproduction, 1936.",
      "doi": ""
    },
    {
      "text": "Eli Blevis. 2007. Sustainable interaction design: invention & disposal, renewal & reuse. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’07. ACM Press, San Jose, California, USA, 503–512. https://doi.org/10.1145/1240624.1240705",
      "doi": "10.1145/1240624.1240705"
    },
    {
      "text": "Hronn Brynjarsdottir, Maria Håkansson, James Pierce, Eric Baumer, Carl DiSalvo, and Phoebe Sengers. 2012. Sustainably unpersuaded: how persuasion narrows our vision of sustainability. In Proceedings of the 2012 ACM annual conference on Human Factors in Computing Systems - CHI ’12. ACM Press, Austin, Texas, USA, 947. https://doi.org/10.1145/2207676.2208539",
      "doi": "10.1145/2207676.2208539"
    },
    {
      "text": "Serena Camere and Elvin Karana. 2018. Fabricating materials from living organisms: An emerging design practice. Journal of Cleaner Production 186 (2018), 570–584. https://doi.org/10.1016/j.jclepro.2018.03.081",
      "doi": ""
    },
    {
      "text": "Mengyu Cao. 2017. Lunhui: Upcycled Creations. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition (Singapore, Singapore) (C&C ’17). Association for Computing Machinery, New York, NY, USA, 269–271. https://doi.org/10.1145/3059454.3078710",
      "doi": "10.1145/3059454.3078710"
    },
    {
      "text": "N. Delaporte, G. Lajoie, S. Collin-Martin, and K. Zaghib. 2020. Toward Low-Cost All-Organic and Biodegradable Li-Ion Batteries. Nature Scientific Reports 10, 1 (Dec. 2020), 3812. https://doi.org/10.1038/s41598-020-60633-y",
      "doi": ""
    },
    {
      "text": "Kristin N. Dew, Samantha Shorey, and Daniela Rosner. 2018. Making within limits: towards salvage fabrication. In Proceedings of the 2018 Workshop on Computing within Limits - LIMITS ’18. ACM Press, Toronto, Ontario, Canada, 1–11. https://doi.org/10.1145/3232617.3232626",
      "doi": "10.1145/3232617.3232626"
    },
    {
      "text": "Carl DiSalvo, Phoebe Sengers, and Hrönn Brynjarsdóttir. 2010. Mapping the landscape of sustainable HCI. In Proceedings of the 28th international conference on Human factors in computing systems - CHI ’10. ACM Press, Atlanta, Georgia, USA, 1975. https://doi.org/10.1145/1753326.1753625",
      "doi": "10.1145/1753326.1753625"
    },
    {
      "text": "Abdallah El Ali, Xingyu Yang, Swamy Ananthanarayan, Thomas Röggla, Jack Jansen, Jess Hartcher-O’Brien, Kaspar Jansen, and Pablo Cesar. 2020. ThermalWear: Exploring Wearable On-chest Thermal Displays to Augment Voice Messages with Affect. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376682",
      "doi": "10.1145/3313831.3376682"
    },
    {
      "text": "Shah Fahad, Haojie Yu, Li Wang, Zain-ul-Abdin, Muhammad Haroon, Raja Summe Ullah, Ahsan Nazir, Kaleem-ur-Rahman Naveed, Tarig Elshaarani, and Amin Khan. 2019. Recent progress in the synthesis of silver nanowires and their role as conducting materials. Journal of Materials Science 54, 2 (Jan. 2019), 997–1035. https://doi.org/10.1007/s10853-018-2994-9",
      "doi": ""
    },
    {
      "text": "David J. Finn, Mustafa Lotya, and Jonathan N. Coleman. 2015. Inkjet Printing of Silver Nanowire Networks. ACS Applied Materials & Interfaces 7, 17 (2015), 9254–9261. https://doi.org/10.1021/acsami.5b01875 arXiv:https://doi.org/10.1021/acsami.5b01875PMID: 25874531.",
      "doi": ""
    },
    {
      "text": "Bruce Fulford. 1986. The Composting Greenhouse at New Alchemy Institute: A Report on Two Years of Operation and Monitoring. Technical Report New Alchemy Institute Research Report No.3. BiioThermal Associates.",
      "doi": ""
    },
    {
      "text": "Gozde Goncu-Berk. 2019. Smart Textiles and Clothing: An Opportunity or A Threat for Sustainability. In Proceedings of the Textile Intersections. Loughborough University, London, UK, 7 pages.",
      "doi": ""
    },
    {
      "text": "Bona Goo, Chae-Hui Hong, and Keun Park. 2020. 4D printing using anisotropic thermal deformation of 3D-printed thermoplastic parts. Materials & Design 188 (March 2020), 108485. https://doi.org/10.1016/j.matdes.2020.108485",
      "doi": ""
    },
    {
      "text": "Daniel Gooch and Leon Watts. 2010. Communicating Social Presence Through Thermal Hugs. In Ubicomp Proceedings of First Workshop on Social Interaction in Spatially Separated Environments (SISSI ’10). ACM, Copenhagen, Denmark, 11.",
      "doi": ""
    },
    {
      "text": "Daniel Gooch and Leon Watts. 2012. It’s neat to feel the heat: how can we hold hands at a distance?. In CHI ’12 Extended Abstracts on Human Factors in Computing Systems. ACM, Austin Texas USA, 1535–1540. https://doi.org/10.1145/2212776.2223668",
      "doi": ""
    },
    {
      "text": "Jianzhe Gu, David E. Breen, Jenny Hu, Lifeng Zhu, Ye Tao, Tyson Van de Zande, Guanyun Wang, Yongjie Jessica Zhang, and Lining Yao. 2019. Geodesy: Self-rising 2.5D Tiles by Printing along 2D Geodesic Closed Path. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–10. https://doi.org/10.1145/3290605.3300267",
      "doi": "10.1145/3290605.3300267"
    },
    {
      "text": "Arnbjörn O. Hanstveit. 1992. Biodegradability of petroleum waxes and beeswax in an adapted CO2 evolution test. Chemosphere 25, 4 (1992), 605–620. https://doi.org/10.1016/0045-6535(92)90291-X",
      "doi": ""
    },
    {
      "text": "K. L. Hooker and G. R. Marzolf. 1987. Differential Decomposition of Leaves in Grassland and Gallery Forest Reaches of Kings Creek. Transactions of the Kansas Academy of Science (1903-) 90, 1/2 (1987), 17–24. http://www.jstor.org/stable/3628107",
      "doi": ""
    },
    {
      "text": "Liangbing Hu, Jang Wook Choi, Yuan Yang, Sangmoo Jeong, Fabio La Mantia, Li-Feng Cui, and Yi Cui. 2009. Highly conductive paper for energy-storage devices. Proceedings of the National Academy of Sciences 106, 51(2009), 21490–21494. https://doi.org/10.1073/pnas.0908858106 arXiv:https://www.pnas.org/content/106/51/21490.full.pdf",
      "doi": ""
    },
    {
      "text": "Jorge Iranzo Bartolomé, Jun Dong Cho, Luis Cavazos Quero, Sunggi Jo, and Gilsang Cho. 2020. Thermal Interaction for Improving Tactile Artwork Depth and Color-Depth Appreciation for Visually Impaired People. Electronics 9, 11 (Nov. 2020), 1939. https://doi.org/10.3390/electronics9111939",
      "doi": ""
    },
    {
      "text": "Jungho Jin, Daewon Lee, Hyeon-Gyun Im, Yun Cheol Han, Eun Gyo Jeong, Marco Rolandi, Kyung Cheol Choi, and Byeong-Soo Bae. 2016. Chitin Nanofiber Transparent Paper for Flexible Green Electronics. Advanced Materials 28, 26 (2016), 5169–5175. https://doi.org/10.1002/adma.201600336 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adma.201600336",
      "doi": ""
    },
    {
      "text": "Martin Jonsson, Anna Ståhl, Johanna Mercurio, Anna Karlsson, Naveen Ramani, and Kristina Höök. 2016. The Aesthetics of Heat: Guiding Awareness with Thermal Stimuli. In Proceedings of the TEI ’16: Tenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Eindhoven Netherlands, 109–117. https://doi.org/10.1145/2839462.2839487",
      "doi": "10.1145/2839462.2839487"
    },
    {
      "text": "Annemarie Joyce. 2020. Thermal Processing of Food 101: An introduction to Pasteurization. Safefood 360. https://safefood360.com/2020/10/thermal-processing-of-food-101-pasteurization-introduction/",
      "doi": ""
    },
    {
      "text": "Hiroki Kaimoto, Junichi Yamaoka, Satoshi Nakamaru, Yoshihiro Kawahara, and Yasuaki Kakehi. 2020. ExpandFab: Fabricating Objects Expanding and Changing Shape with Heat. In Proceedings of the Fourteenth International Conference on Tangible, Embedded, and Embodied Interaction. ACM, Sydney NSW Australia, 153–164. https://doi.org/10.1145/3374920.3374949",
      "doi": "10.1145/3374920.3374949"
    },
    {
      "text": "Hsin-Liu (Cindy) Kao, Miren Bamforth, David Kim, and Chris Schmandt. 2018. Skinmorph: Texture-Tunable on-Skin Interface through Thin, Programmable Gel. In Proceedings of the 2018 ACM International Symposium on Wearable Computers (Singapore, Singapore) (ISWC ’18). Association for Computing Machinery, New York, NY, USA, 196–203. https://doi.org/10.1145/3267242.3267262",
      "doi": "10.1145/3267242.3267262"
    },
    {
      "text": "Elvin Karana, Bahareh Barati, and Elisa Giaccardi. 2020. Living Artefacts: Conceptualizing Livingness as a Material Quality in Everyday Artefacts.International Journal of Design 14, 3 (2020), 17 pages.",
      "doi": ""
    },
    {
      "text": "Elvin Karana, Davine Blauwhoff, Erik-Jan Hultink, and Serena Camere. 2018. When the Material Grows: A Case Study on Designing (with) Mycelium-based Materials. International Journal of Design 12, 2 (2018), 18.",
      "doi": ""
    },
    {
      "text": "Anastasia Koivikko, Vilma Lampinen, Kyriacos Yiannacou, Vipul Sharma, and Veikko Sariola. 2021. Biodegradable, Flexible and Transparent Tactile Pressure Sensor Based on Rubber Leaf Skeletons. IEEE Sensors Journal Early Access (2021), 1–1. https://doi.org/10.1109/JSEN.2021.3078807",
      "doi": ""
    },
    {
      "text": "Katrina Krämer. 2019. Biodegradable batteries could be made from modified proteins. Chemistry World. https://www.chemistryworld.com/news/biodegradable-batteries-could-be-made-from-modified-proteins/3010902.article",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Christian Koehler, Theresa Jean Tanenbaum, and David H. Nguyen. 2015. Why We Use and Abandon Smart Devices. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing (Osaka, Japan) (UbiComp ’15). Association for Computing Machinery, New York, NY, USA, 635–646. https://doi.org/10.1145/2750858.2804288",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "Eldy S. Lazaro Vasquez, Hao-Chuan Wang, and Katia Vega. 2020. Introducing the Sustainable Prototyping Life Cycle for Digital Fabrication to Designers. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. ACM, Eindhoven Netherlands, 1301–1312. https://doi.org/10.1145/3357236.3395510",
      "doi": "10.1145/3357236.3395510"
    },
    {
      "text": "Sunmin Lee and Thecla Schiphorst. 2016. Warmth and Affection: Exploring Thermal Sensation in the Design of Parent-Child Distant Interaction. In Human-Computer Interaction. Novel User Experiences, Masaaki Kurosu (Ed.). Vol. 9733. Springer International Publishing, Cham, 3–14. https://doi.org/10.1007/978-3-319-39513-5_1 Series Title: Lecture Notes in Computer Science.",
      "doi": ""
    },
    {
      "text": "Wonjun Lee and Youn-kyung Lim. 2012. Explorative research on the heat as an expression medium: focused on interpersonal communication. Personal and Ubiquitous Computing 16, 8 (Dec. 2012), 1039–1049. https://doi.org/10.1007/s00779-011-0424-y",
      "doi": "10.1007/s00779-011-0424-y"
    },
    {
      "text": "Steven K. Leist and Jack Zhou. 2016. Current status of 4D printing technology and the potential of light-reactive smart materials as 4D printable materials. Virtual and Physical Prototyping 11, 4 (Oct. 2016), 249–262. https://doi.org/10.1080/17452759.2016.1198630",
      "doi": ""
    },
    {
      "text": "Rongfeng Li, Liu Wang, and Lan Yin. 2018. Materials and Devices for Biodegradable and Soft Biomedical Electronics. Materials 11, 11 (2018), 23 pages. https://doi.org/10.3390/ma11112108",
      "doi": ""
    },
    {
      "text": "Wenhui Li, Qian Liu, Yuniu Zhang, Chang’an Li, Zhenfei He, Wallace C. H. Choy, Paul J. Low, Prashant Sonar, and Aung Ko Ko Kyaw. 2020. Biodegradable Materials and Green Processing for Green Electronics. Advanced Materials 32, 33 (Aug. 2020), 2001591. https://doi.org/10.1002/adma.202001591",
      "doi": ""
    },
    {
      "text": "Weiwei Li, Azat Meredov, and Atif Shamim. 2019. Silver Nanowire based Flexible, Transparent, Wideband Antenna for 5G Band Application. In 2019 IEEE International Symposium on Antennas and Propagation and USNC-URSI Radio Science Meeting. IEEE, Atlanta, GA, USA, 275–276. https://doi.org/10.1109/APUSNCURSINRSM.2019.8888371",
      "doi": ""
    },
    {
      "text": "Po-Chen Lin, Cheng-Tien Hsieh, Xin Liu, Feng-Cheng Chang, Wen-Chang Chen, Jiangsheng Yu, and Chu-Chen Chueh. 2021. Fabricating efficient flexible organic photovoltaics using an eco-friendly cellulose nanofibers/silver nanowires conductive substrate. Chemical Engineering Journal 405 (2021), 126996. https://doi.org/10.1016/j.cej.2020.126996",
      "doi": ""
    },
    {
      "text": "Lanlan Liu, Chaodong He, Jia Li, Jinbao Guo, Dian Yang, and Jie Wei. 2013. Green synthesis of silver nanowires via ultraviolet irradiation catalyzed by phosphomolybdic acid and their antibacterial properties. New Journal of Chemistry 37, 7 (2013), 2179. https://doi.org/10.1039/c3nj00135k",
      "doi": ""
    },
    {
      "text": "Szu-Yu (Cyn) Liu, Jeffrey Bardzell, and Shaowen Bardzell. 2019. Decomposition as Design: Co-Creating (with) Natureculture. In Proceedings of the Thirteenth International Conference on Tangible, Embedded, and Embodied Interaction - TEI ’19. ACM Press, Tempe, Arizona, USA, 605–614. https://doi.org/10.1145/3294109.3295653",
      "doi": ""
    },
    {
      "text": "Jennifer C. Mankoff, Eli Blevis, Alan Borning, Batya Friedman, Susan R. Fussell, Jay Hasbrouck, Allison Woodruff, and Phoebe Sengers. 2007. Environmental sustainability and interaction. In CHI ’07 extended abstracts on Human factors in computing systems - CHI ’07. ACM Press, San Jose, CA, USA, 2121. https://doi.org/10.1145/1240866.1240963",
      "doi": "10.1145/1240866.1240963"
    },
    {
      "text": "MarketsandMarkets. 2021. Wireless Charging Market with COVID-19 Impact by Implementation (Transmitters, Receivers), Technology (Magnetic Resonance, Inductive, Radio Frequency), Application (Consumer Electronics, Healthcare, Automotive), and Region - Global Forecast to 2026. MarketsandMarkets Research. https://www.marketsandmarkets.com/Market-Reports/wireless-charging-market-640.html",
      "doi": ""
    },
    {
      "text": "Teruo Nakashima, Yumiko Nakano, Yuezhen Bin, and Masaru Matsuo. 2005. Biodegradation Characteristics of Chitin and Chitosan Films. Journal of home economics 56 (2005), 889–897.",
      "doi": ""
    },
    {
      "text": "James Pierce and Eric Paulos. 2011. Second-hand interactions: investigating reacquisition and dispossession practices around domestic objects. In Proceedings of the 2011 annual conference on Human factors in computing systems - CHI ’11. ACM Press, Vancouver, BC, Canada, 2385. https://doi.org/10.1145/1978942.1979291",
      "doi": "10.1145/1978942.1979291"
    },
    {
      "text": "Ran Poliakine. 2017. Apple’s support for wireless charging and AR are the latest signs of ‘ubiquitous computing’. TNW. https://thenextweb.com/news/apples-support-for-wireless-charging-and-ar-are-the-latest-signs-of-ubiquitous-computing",
      "doi": ""
    },
    {
      "text": "Keep Australia Beautiful program. 2011. Litter – How Long Does It Take to Breakdown?Western Australia Department of Environment and Conservation. https://www.kabc.wa.gov.au/library/file/Fact sheets/How long Fact sheet KAB.pdf",
      "doi": ""
    },
    {
      "text": "Rinin Parambil Ramachandran and Lutz Sommer. 2018. Printed Inductive Coil Realized using Inkjet Printing on Flexible Substrate for RFID Technology Applications. International Journal of Science Technology and Engineering 4, 9(2018), 5.",
      "doi": ""
    },
    {
      "text": "Omar Rana. 2018. Nature’s Recipe Book. materiom. https://materiom.org/",
      "doi": ""
    },
    {
      "text": "A. Russo, B. Ahn, Jacob J. Adams, E. Duoss, J. Bernhard, and Jennifer A. Lewis. 2011. Pen-on-paper flexible electronics.Advanced Materials 23 30(2011), 3426–30.",
      "doi": ""
    },
    {
      "text": "Jenn Savedge. 2020. How to Make Leaf Skeletons. Treehugger. https://www.treehugger.com/how-make-leaf-skeletons-4868589",
      "doi": ""
    },
    {
      "text": "Energy Saver. 2021. How Energy-Efficient Light Bulbs Compare with Traditional Incandescents. U.S. Department of Energy. https://www.energy.gov/energysaver/save-electricity-and-fuel/lighting-choices-save-you-money/how-energy-efficient-light",
      "doi": ""
    },
    {
      "text": "Dirk Schaefer and Wai M. Cheung. 2018. Smart Packaging: Opportunities and Challenges. Procedia CIRP 72(2018), 1022–1027. https://doi.org/10.1016/j.procir.2018.03.240 51st CIRP Conference on Manufacturing Systems.",
      "doi": ""
    },
    {
      "text": "Vipul Sharma, Harri Ali-Löytty, Anastasia Koivikko, Kyriacos Yiannacou, Kimmo Lahtonen, and Veikko Sariola. 2021. Copper Oxide Microtufts on Natural Fractals for Efficient Water Harvesting. Langmuir 37, 11 (March 2021), 3370–3381. https://doi.org/10.1021/acs.langmuir.0c03497",
      "doi": ""
    },
    {
      "text": "Vipul Sharma, Anastasia Koivikko, Kyriacos Yiannacou, Kimmo Lahtonen, and Veikko Sariola. 2020. Flexible biodegradable transparent heaters based on fractal-like leaf skeletons. npj Flexible Electronics 4, 1 (Dec. 2020), 27. https://doi.org/10.1038/s41528-020-00091-8",
      "doi": ""
    },
    {
      "text": "Ofer Shochet. 2020. Compostable RFID antennas by leveraging nano-copper inks. https://www.copprint.com/wp-content/uploads/2020/08/Copprint-OE_A-presentation-August-6-2020.pdf",
      "doi": ""
    },
    {
      "text": "Katherine W Song and Eric Paulos. 2021. Unmaking: Enabling and Celebrating the Creative Material of Failure, Destruction, Decay, and Deformation. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 429, 12 pages. https://doi.org/10.1145/3411764.3445529",
      "doi": "10.1145/3411764.3445529"
    },
    {
      "text": "Axel Sylvester, Tanja Döring, and Albrecht Schmidt. 2010. Liquids, Smoke, and Soap Bubbles: Reflections on Materials for Ephemeral User Interfaces. In Proceedings of the Fourth International Conference on Tangible, Embedded, and Embodied Interaction (Cambridge, Massachusetts, USA) (TEI ’10). Association for Computing Machinery, New York, NY, USA, 269–270. https://doi.org/10.1145/1709886.1709941",
      "doi": "10.1145/1709886.1709941"
    },
    {
      "text": "Hu Tao, Mark A. Brenckle, Miaomiao Yang, Jingdi Zhang, Mengkun Liu, Sean M. Siebert, Richard D. Averitt, Manu S. Mannoor, Michael C. McAlpine, John A. Rogers, David L. Kaplan, and Fiorenzo G. Omenetto. 2012. Silk-Based Conformal, Adhesive, Edible Food Sensors. Advanced Materials 24, 8 (2012), 1067–1072. https://doi.org/10.1002/adma.201103814 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adma.201103814",
      "doi": ""
    },
    {
      "text": "Jordan Tewell, Jon Bird, and George R. Buchanan. 2017. The Heat is On: A Temperature Display for Conveying Affective Feedback. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 1756–1767. https://doi.org/10.1145/3025453.3025844",
      "doi": "10.1145/3025453.3025844"
    },
    {
      "text": "Jordan Tewell, Jon Bird, and George R. Buchanan. 2017. Heat-Nav: Using Temperature Changes as Navigation Cues. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 1131–1135. https://doi.org/10.1145/3025453.3025965",
      "doi": "10.1145/3025453.3025965"
    },
    {
      "text": "Skylar Tibbits. 2014. 4D Printing: Multi-Material Shape Change. Architectural Design 84, 1 (2014), 116–121. https://doi.org/10.1002/ad.1710 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/ad.1710",
      "doi": ""
    },
    {
      "text": "Daniel Tobjörk and Ronald Österbacka. 2011. Paper Electronics. Advanced Materials 23, 17 (2011), 1935–1961. https://doi.org/10.1002/adma.201004692 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adma.201004692",
      "doi": ""
    },
    {
      "text": "Djadidi Toybou, Caroline Celle, Catherine Aude-Garcia, Thierry Rabilloud, and Jean-Pierre Simonato. 2019. A toxicology-informed, safer by design approach for the fabrication of transparent electrodes based on silver nanowires. Environ. Sci.: Nano 6(2019), 684–694. Issue 2. https://doi.org/10.1039/C8EN00890F",
      "doi": ""
    },
    {
      "text": "Robert Triggs. 2019. Samsung vs Huawei reverse wireless charging test. Android Authority. https://www.androidauthority.com/samsung-vs-huawei-reverse-wireless-charging-968692/",
      "doi": ""
    },
    {
      "text": "Muhammad Umair, Corina Sas, Niaz Chalabianloo, and Cem Ersoy. 2021. Exploring Personalized Vibrotactile and Thermal Patterns for Affect Regulation. In Designing Interactive Systems Conference 2021. ACM, Virtual Event USA, 891–906. https://doi.org/10.1145/3461778.3462042",
      "doi": "10.1145/3461778.3462042"
    },
    {
      "text": "Eldy S. Lazaro Vasquez and Katia Vega. 2019. From plastic to biomaterials: prototyping DIY electronics with mycelium. In Proceedings of the 2019 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2019 ACM International Symposium on Wearable Computers - UbiComp/ISWC ’19. ACM Press, London, United Kingdom, 308–311. https://doi.org/10.1145/3341162.3343808",
      "doi": "10.1145/3341162.3343808"
    },
    {
      "text": "Eldy S. Lazaro Vasquez and Katia Vega. 2019. Myco-accessories: sustainable wearables with biodegradable materials. In Proceedings of the 23rd International Symposium on Wearable Computers - ISWC ’19. ACM Press, London, United Kingdom, 306–311. https://doi.org/10.1145/3341163.3346938",
      "doi": "10.1145/3341163.3346938"
    },
    {
      "text": "Eldy S Lazaro Vasquez, Hao-Chuan Wang, and Katia Vega. 2020. The Environmental Impact of Physical Prototyping: a Five-Year CHI Review. In SelfSustainableCHI 2020. ACM, Honolulu, HI, USA, 8.",
      "doi": ""
    },
    {
      "text": "Marina Vukoje, Snežana Miljanić, Jasna Hrenović, and Mirela Rožić. 2018. Thermochromic ink–paper interactions and their role in biodegradation of UV curable prints. Cellulose 25 (10 2018). https://doi.org/10.1007/s10570-018-1970-5",
      "doi": ""
    },
    {
      "text": "Guanyun Wang, Ye Tao, Ozguc Bertug Capunaman, Humphrey Yang, and Lining Yao. 2019. A-line: 4D Printing Morphing Linear Composite Structures. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, Glasgow, Scotland Uk, 1–12. https://doi.org/10.1145/3290605.3300656",
      "doi": "10.1145/3290605.3300656"
    },
    {
      "text": "Guanyun Wang, Humphrey Yang, Zeyu Yan, Nurcan Gecer Ulu, Ye Tao, Jianzhe Gu, Levent Burak Kara, and Lining Yao. 2018. 4DMesh: 4D Printing Morphing Non-Developable Mesh Surfaces. In The 31st Annual ACM Symposium on User Interface Software and Technology - UIST ’18. ACM Press, Berlin, Germany, 623–635. https://doi.org/10.1145/3242587.3242625",
      "doi": "10.1145/3242587.3242625"
    },
    {
      "text": "Jennifer Weiler, Piyum Fernando, Nipuni Siyambalapitiya, and Stacey Kuznetsov. 2019. Mycelium Artifacts: Exploring Shapeable and Accessible Biofabrication. In Companion Publication of the 2019 on Designing Interactive Systems Conference 2019 Companion - DIS ’19 Companion. ACM Press, San Diego, CA, USA, 69–72. https://doi.org/10.1145/3301019.3325156",
      "doi": "10.1145/3301019.3325156"
    },
    {
      "text": "Christian J. A. M. Willemse, Dirk K. J. Heylen, and Jan B. F. van Erp. 2015. Warmth in affective mediated interaction: Exploring the effects of physical warmth on interpersonal warmth. In 2015 International Conference on Affective Computing and Intelligent Interaction (ACII). IEEE, Xi’an, China, 28–34. https://doi.org/10.1109/ACII.2015.7344547",
      "doi": ""
    },
    {
      "text": "Graham Wilson and Stephen A. Brewster. 2017. Multi-moji: Combining Thermal, Vibrotactile & Visual Stimuli to Expand the Affective Range of Feedback. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. ACM, Denver Colorado USA, 1743–1755. https://doi.org/10.1145/3025453.3025614",
      "doi": "10.1145/3025453.3025614"
    },
    {
      "text": "Graham Wilson, Gavin Davidson, and Stephen A. Brewster. 2015. In the Heat of the Moment: Subjective Interpretations of Thermal Feedback During Interaction. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. ACM, Seoul Republic of Korea, 2063–2072. https://doi.org/10.1145/2702123.2702219",
      "doi": "10.1145/2702123.2702219"
    },
    {
      "text": "Graham Wilson, Dobromir Dobrev, and Stephen A. Brewster. 2016. Hot Under the Collar: Mapping Thermal Feedback to Dimensional Models of Emotion. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. ACM, San Jose California USA, 4838–4849. https://doi.org/10.1145/2858036.2858205",
      "doi": "10.1145/2858036.2858205"
    },
    {
      "text": "Shanel Wu and Laura Devendorf. 2020. Unfabricate: Designing Smart Textiles for Disassembly. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. ACM, Honolulu HI USA, 1–14. https://doi.org/10.1145/3313831.3376227",
      "doi": "10.1145/3313831.3376227"
    },
    {
      "text": "Lining Yao, Jifei Ou, Chin-Yi Cheng, Helene Steiner, Wen Wang, Guanyun Wang, and Hiroshi Ishii. 2015. bioLogic: Natto Cells as Nanoactuators for Shape Changing Interfaces. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems - CHI ’15. ACM Press, Seoul, Republic of Korea, 1–10. https://doi.org/10.1145/2702123.2702611",
      "doi": "10.1145/2702123.2702611"
    },
    {
      "text": "Lan Yin, Huanyu Cheng, Shimin Mao, Richard Haasch, Yuhao Liu, Xu Xie, Suk-Won Hwang, Harshvardhan Jain, Seung-Kyun Kang, Yewang Su, Rui Li, Yonggang Huang, and John A. Rogers. 2014. Dissolvable Metals for Transient Electronics. Advanced Functional Materials 24, 5 (2014), 645–658. https://doi.org/10.1002/adfm.201301847 arXiv:https://onlinelibrary.wiley.com/doi/pdf/10.1002/adfm.201301847",
      "doi": ""
    },
    {
      "text": "Xiaopan Zhang, Tengyang Ye, Xianghao Meng, Zhihui Tian, Lihua Pang, Yaojie Han, Hai Li, Gang Lu, Fei Xiu, Hai-Dong Yu, Juqing Liu, and Wei Huang. 2020. Sustainable and Transparent Fish Gelatin Films for Flexible Electroluminescent Devices. ACS Nano 14, 4 (2020), 3876–3884. https://doi.org/10.1021/acsnano.9b09880 arXiv:https://doi.org/10.1021/acsnano.9b09880PMID: 32186191.",
      "doi": ""
    },
    {
      "text": "Ziyang Zhang, Adie Alwen, Hongming Lyu, Xiangyu Liu, Zhou Li, Zhixin Xie, Yu Xie, Fangyi Guan, Aydin Babakhani, and Qibing Pei. 2019. Stretchable Transparent Wireless Charging Coil Fabricated by Negative Transfer Printing. ACS Applied Materials & Interfaces 11, 43 (2019), 40677–40684. https://doi.org/10.1021/acsami.9b14728 arXiv:https://doi.org/10.1021/acsami.9b14728PMID: 31589402.",
      "doi": ""
    }
  ]
}