{
  "doi": "10.1145/3491102.3517475",
  "title": "Trauma-Informed Computing: Towards Safer Technology Experiences for All",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-20",
  "year": 2022,
  "badges": [],
  "abstract": "Trauma is the physical, emotional, or psychological harm caused by deeply distressing experiences. Research with communities that may experience high rates of trauma has shown that digital technologies can create or exacerbate traumatic experiences. Via three vignettes, we discuss how considering the possible effects of trauma and traumatic stress reactions provides an explanatory lens with new insights into people’s technology experiences. Then, we present a framework—trauma-informed computing—in which we adapt and show how to apply six key principles of trauma-informed approaches to computing: safety, trust, peer support, collaboration, enablement, and intersectionality. Through specific examples, we describe how to apply trauma-informed computing in four areas of computing research and practice: user experience research & design, security & privacy, artificial intelligence & machine learning, and organizational culture in tech companies. We conclude by discussing how adopting trauma-informed computing will lead to benefits for all users, not only those experiencing trauma.",
  "tags": [
    "trauma-informed computing",
    "computer security and privacy",
    "intimate partner violence",
    "trauma",
    "gender-based violence",
    "transgender"
  ],
  "authors": [
    {
      "name": "Janet X. Chen",
      "institution": "Information Science, Cornell University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239004",
      "orcid": "missing"
    },
    {
      "name": "Allison McDonald",
      "institution": "Computer Science & Engineering, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659296796",
      "orcid": "0000-0001-7477-6782"
    },
    {
      "name": "Yixin Zou",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659260611",
      "orcid": "missing"
    },
    {
      "name": "Emily Tseng",
      "institution": "Information Science, Cornell Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659455020",
      "orcid": "missing"
    },
    {
      "name": "Kevin A Roundy",
      "institution": "NortonLifeLock Research Group, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81474699207",
      "orcid": "missing"
    },
    {
      "name": "Acar Tamersoy",
      "institution": "Norton Research Group, NortonLifeLock, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81482658165",
      "orcid": "missing"
    },
    {
      "name": "Florian Schaub",
      "institution": "School of Information, University of Michigan, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81548024188",
      "orcid": "0000-0003-1039-7155"
    },
    {
      "name": "Thomas Ristenpart",
      "institution": "Cornell Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81384601889",
      "orcid": "missing"
    },
    {
      "name": "Nicola Dell",
      "institution": "Jacobs Institute, Cornell Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81486656510",
      "orcid": "0000-0002-6119-705X"
    }
  ],
  "references": [
    {
      "text": "Mike Ananny and Kate Crawford. 2018. Seeing without knowing: Limitations of the transparency ideal and its application to algorithmic accountability. New Media & Society 20, 3 (2018), 973–989. https://doi.org/10.1177/1461444816676645",
      "doi": ""
    },
    {
      "text": "Nazanin Andalibi. 2020. Disclosure, Privacy, and Stigma on Social Media: Examining Non-Disclosure of Distressing Experiences. ACM Transactions on Computer-Human Interaction 27, 3(2020), 18:1–18:43. https://doi.org/10.1145/3386600",
      "doi": "10.1145/3386600"
    },
    {
      "text": "Nazanin Andalibi. 2021. Symbolic Annihilation through Design: Pregnancy Loss in Pregnancy-Related Mobile Apps. New Media & Society 23, 3 (March 2021), 613–631. https://doi.org/10.1177/1461444820984473",
      "doi": ""
    },
    {
      "text": "Laima Augustaitis, Leland A. Merrill, Kristi E. Gamarel, and Oliver L. Haimson. 2021. Online Transgender Health Information Seeking: Facilitators, Barriers, and Future Directions. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 205:1–205:14. https://doi.org/10.1145/3411764.3445091",
      "doi": "10.1145/3411764.3445091"
    },
    {
      "text": "Anna Bahney. 2017. Identity theft nightmares: ’I’ve spent my lifetime building up my credit’. Retrieved August 28, 2021 from https://money.cnn.com/2017/09/29/pf/identity-theft/index.html",
      "doi": ""
    },
    {
      "text": "Jane Bailey, Nicola Henry, and Asher Flynn. 2021. Technology-Facilitated Violence and Abuse: International Perspectives and Experiences. In The Emerald International Handbook of Technology Facilitated Violence and Abuse. Emerald Publishing Limited, Bingley, West Yorkshire, UK, 1–17. https://doi.org/10.1108/978-1-83982-848-520211001",
      "doi": ""
    },
    {
      "text": "Shaowen Bardzell. 2010. Feminist HCI: taking stock and outlining an agenda for design. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 1301–1310. https://doi.org/10.1145/1753326.1753521",
      "doi": "10.1145/1753326.1753521"
    },
    {
      "text": "Catherine Barwulor, Allison McDonald, Eszter Hargittai, and Elissa M. Redmiles. 2021. “Disadvantaged in the American-Dominated Internet”: Sex, Work, and Technology. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 563:1–563:16. https://doi.org/10.1145/3411764.3445378",
      "doi": "10.1145/3411764.3445378"
    },
    {
      "text": "Lujo Bauer, Cristian Bravo-Lillo, Lorrie Cranor, and Elli Fragkaki. 2013. Warning design guidelines. Technical Report. Carnegie Mellon University CyLab. https://www.cylab.cmu.edu/_files/pdfs/tech_reports/CMUCyLab13002.pdf",
      "doi": ""
    },
    {
      "text": "Ruha Benjamin. 2019. Race After Technology: Abolitionist Tools for the New Jim Code. John Wiley & Sons, Medford, MA, USA.",
      "doi": ""
    },
    {
      "text": "Richard Berk. 2012. Criminal justice forecasts of risk: A machine learning approach. Springer Science & Business Media, Berlin, Germany.",
      "doi": ""
    },
    {
      "text": "Thérèse M Craine Bertsch. 2012. The standpoint of homeless single mothers on recurrent episodes of homelessness. Ph.D. Dissertation. Adelphi University School of Social Work. https://www.proquest.com/docview/1318618421",
      "doi": ""
    },
    {
      "text": "Andrea Blanch, Beth Filson, Darby Penney, and Cathy Cave. 2012. Engaging women in trauma-informed peer support: A guidebook. Technical Report. National Center for Trauma-Informed Care. https://nicic.gov/engaging-women-trauma-informed-peer-support-guidebook",
      "doi": ""
    },
    {
      "text": "Danielle Blunt, Emily Coombes, Shanelle Mullin, and Ariel Wolf. 2020. Posting Into the Void: Studying the Impact of Shadowbanning on Sex Workers and Activists. Retrieved September 6, 2021 from https://hackinghustling.org/posting-into-the-void-content-moderation/",
      "doi": ""
    },
    {
      "text": "Christoph Bösch, Benjamin Erb, Frank Kargl, Henning Kopp, and Stefan Pfattheicher. 2016. Tales from the Dark Side: Privacy Dark Strategies and Privacy Dark Patterns. Proceedings on Privacy Enhancing Technologies 2016, 4(2016), 237–254. https://doi.org/10.1515/popets-2016-0038",
      "doi": ""
    },
    {
      "text": "Elizabeth A. Bowen and Nadine Shaanta Murshid. 2016. Trauma-Informed Social Policy: A Conceptual Framework for Policy Analysis and Advocacy. American Journal of Public Health 106, 2 (Feb. 2016), 223–229. https://doi.org/10.2105/AJPH.2015.302970",
      "doi": ""
    },
    {
      "text": "Gillian Brockell. 2018. Dear tech companies, I don’t want to see pregnancy ads after my child was stillborn. Retrieved August 28, 2021 from https://www.seattletimes.com/life/dear-tech-companies-i-dont-want-to-see-pregnancy-ads-after-my-child-was-stillborn/",
      "doi": ""
    },
    {
      "text": "Vivian Barnett Brown, Maxine Harris, and Roger Fallot. 2013. Moving toward Trauma-Informed Practice in Addiction Treatment: A Collaborative Model of Agency Assessment. Journal of Psychoactive Drugs 45, 5 (2013), 386–393. https://doi.org/10.1080/02791072.2013.844381",
      "doi": ""
    },
    {
      "text": "Joy Buolamwini and Timnit Gebru. 2018. Gender shades: Intersectional accuracy disparities in commercial gender classification. In Proceedings of the Conference on Fairness, Accountability and Transparency. PMLR, New York, NY, USA, 81:77–91. http://proceedings.mlr.press/v81/buolamwini18a.html",
      "doi": ""
    },
    {
      "text": "Crosby Burns and Jeff Krehely. 2011. Gay and Transgender People Face High Rates of Workplace Discrimination and Harassment. Retrieved August 28, 2021 from https://cdn.americanprogress.org/wp-content/uploads/issues/2011/06/pdf/workplace_discrimination.pdf",
      "doi": ""
    },
    {
      "text": "Justin Buss, Hayden Le, and Oliver L Haimson. 2021. Transgender identity management across social media platforms. Media, Culture & Society 0, 0 (2021), 1–17. https://doi.org/10.1177/01634437211027106",
      "doi": ""
    },
    {
      "text": "Lisa D Butler, Filomena M Critelli, and Elaine S Rinfrette. 2011. Trauma-informed care and mental health. Directions in Psychiatry 31, 3 (2011), 197–212.",
      "doi": ""
    },
    {
      "text": "Callisto: Tech to Combat Sexual Assault. 2017. Designing trauma-informed and inclusive technology for survivors of sexual assault. Retrieved September 6, 2021 from https://medium.com/@projectcallisto/designing-trauma-informed-and-inclusive-technology-for-survivors-of-sexual-assault-928afb3c579",
      "doi": ""
    },
    {
      "text": "Matthew Carrasco and Andruid Kerne. 2018. Queer visibility: Supporting LGBT+ selective visibility on social media. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 250:1–250:12. https://doi.org/10.1145/3173574.3173824",
      "doi": "10.1145/3173574.3173824"
    },
    {
      "text": "Center for Substance Abuse Treatment. 2014. Trauma-Informed Care in Behavioral Health Services. Substance Abuse and Mental Health Services Administration, Rockville, MD, USA. http://www.ncbi.nlm.nih.gov/books/NBK207201/",
      "doi": ""
    },
    {
      "text": "Chadwick Trauma-Informed Systems Project. 2013. Creating trauma-informed child welfare systems: A guide for administrators. Retrieved August 29, 2021 from http://communitypact.org/wp-content/uploads/2014/04/CTISPTICWAdminGuide-overview.pdf",
      "doi": ""
    },
    {
      "text": "Stevie Chancellor, Jessica Annette Pater, Trustin Clear, Eric Gilbert, and Munmun De Choudhury. 2016. # thyghgapp: Instagram content moderation and lexical variation in pro-eating disorder communities. In Proceedings of the Conference on Computer-Supported Cooperative Work & Social Computing (CSCW). ACM, New York, NY, USA, 1201–1213. https://doi.org/10.1145/2818048.2819963",
      "doi": "10.1145/2818048.2819963"
    },
    {
      "text": "Janet X. Chen, Francesco Vitale, and Joanna McGrenere. 2021. What Happens After Death? Using a Design Workbook to Understand User Expectations for Preparing Their Data. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 169:1–169:13. https://doi.org/10.1145/3411764.3445359",
      "doi": "10.1145/3411764.3445359"
    },
    {
      "text": "Kendra Cherry. September 13, 2020. The Color Psychology of Red. Retrieved August 28, 2021 from https://www.verywellmind.com/the-color-psychology-of-red-2795821",
      "doi": ""
    },
    {
      "text": "Alexander Cho. 2018. Default publicness: Queer youth of color, social media, and being outed by the machine. New Media & Society 20, 9 (2018), 3183–3200. https://doi.org/10.1177/1461444817744784",
      "doi": ""
    },
    {
      "text": "Sabrina Cipolletta, Riccardo Votadoro, and Elena Faccio. 2017. Online support for transgender people: an analysis of forums and social networks. Health & Social Care in the Community 25, 5 (2017), 1542–1551. https://doi.org/10.1111/hsc.12448",
      "doi": ""
    },
    {
      "text": "Patricia Hill Collins. 2002. Black feminist thought: Knowledge, consciousness, and the politics of empowerment. Routledge, Milton Park, Oxfordshire, UK.",
      "doi": ""
    },
    {
      "text": "Patricia Hill Collins and Sirma Bilge. 2020. Intersectionality. John Wiley & Sons, Hoboken, NJ, USA.",
      "doi": ""
    },
    {
      "text": "Committee on Temporary Shelter. 2018. Trauma-informed design. Retrieved September 6, 2021 from https://cotsonline.org/2018/04/27/trauma-informed-design/",
      "doi": ""
    },
    {
      "text": "Sasha Costanza-Chock. 2020. Design justice: Community-led practices to build the worlds we need. The MIT Press, Cambridge, MA, USA.",
      "doi": ""
    },
    {
      "text": "Stephanie S Covington. 2008. Women and addiction: A trauma-informed approach. Journal of psychoactive drugs 40, sup5 (2008), 377–385. https://doi.org/10.1080/02791072.2008.10400665",
      "doi": ""
    },
    {
      "text": "Kimberlé Crenshaw. 1989. Demarginalizing the intersection of race and sex: A black feminist critique of antidiscrimination doctrine, feminist theory and antiracist politics. University of Chicago Legal Forum 1989, 1 (1989), 139–167. https://chicagounbound.uchicago.edu/uclf/vol1989/iss1/8/",
      "doi": ""
    },
    {
      "text": "Kimberle Crenshaw. 1990. Mapping the margins: Intersectionality, identity politics, and violence against women of color. Stanford Law Review 43, 6 (1990), 1241–1299. https://doi.org/10.2307/1229039",
      "doi": ""
    },
    {
      "text": "Darren W Davis. 1997. The direction of race of interviewer effects among African-Americans: Donning the black mask. American Journal of Political Science 41, 1 (1997), 309–322. https://doi.org/10.2307/2111718",
      "doi": ""
    },
    {
      "text": "Avery Decker. 2021. To Build Gentler Technology, Practice Trauma-Informed Design. Retrieved January 5, 2022 from https://medium.com/care-code/to-build-gentler-technology-practice-trauma-informed-design-3b4ad34a9f0b",
      "doi": ""
    },
    {
      "text": "Ashley Deeks. 2019. The judicial demand for explainable artificial intelligence. Columbia Law Review 119, 7 (2019), 1829–1850. https://www.jstor.org/stable/26810851",
      "doi": ""
    },
    {
      "text": "Bessel A. Van der Kolk. 2015. The Body Keeps the Score: Brain, Mind, and Body in the Healing of Trauma. Penguin Books, City of Westminster, London, UK.",
      "doi": ""
    },
    {
      "text": "Megan Rose Dickey. 2019. The future of diversity and inclusion in tech. Retrieved September 6, 2021 from https://techcrunch.com/2019/06/17/the-future-of-diversity-and-inclusion-in-tech/",
      "doi": ""
    },
    {
      "text": "Sarah Dokkedahl, Robin Niels Kok, Siobhan Murphy, Trine Rønde Kristensen, Ditte Bech-Hansen, and Ask Elklit. 2019. The Psychological Subtype of Intimate Partner Violence and Its Effect on Mental Health: Protocol for a Systematic Review and Meta-Analysis. Systematic Reviews 8, 1 (2019), 198. https://doi.org/10.1186/s13643-019-1118-1",
      "doi": ""
    },
    {
      "text": "Lynn Dombrowski, Ellie Harmon, and Sarah Fox. 2016. Social justice-oriented interaction design: Outlining key design strategies and commitments. In Proceedings of the Conference on Designing Interactive Systems (DIS). ACM, New York, NY, USA, 656–671. https://doi.org/10.1145/2901790.2901861",
      "doi": "10.1145/2901790.2901861"
    },
    {
      "text": "Brianna Dym, Jed R. Brubaker, Casey Fiesler, and Bryan Semaan. 2019. “Coming Out Okay”: Community Narratives for LGBTQ Identity Recovery Work. Proceedings of the ACM on Human-Computer Interaction 3, CSCW(2019), 154:1–154:28. https://doi.org/10.1145/3359256",
      "doi": "10.1145/3359256"
    },
    {
      "text": "Denise E. Elliott, Paula Bjelajac, Roger D. Fallot, Laurie S. Markoff, and Beth Glover Reed. 2005. Trauma-Informed or Trauma-Denied: Principles and Implementation of Trauma-Informed Services for Women. Journal of Community Psychology 33, 4 (2005), 461–477. https://doi.org/10.1002/jcop.20063",
      "doi": ""
    },
    {
      "text": "Roberto Encarnación, Cesar Collazos, Habib M. Fardoun, and Daniyal Alghazzawi. 2019. Information Architecture in the Development of Virtual Applications for the Rehabilitation of Patients with PTSD: Case: Defense Avoidance and Schok Mechanisms. In Proceedings of the Workshop on ICTs for Improving Patients Rehabilitation Research Techniques. ACM, New York, NY, USA, 23–34. https://doi.org/10.1145/3364138.3364146",
      "doi": "10.1145/3364138.3364146"
    },
    {
      "text": "Sheena Erete, Yolanda A Rankin, and Jakita O Thomas. 2021. I can’t breathe: Reflections from black women in CSCW and HCI. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 234:1–234:23. https://doi.org/10.1145/3432933",
      "doi": "10.1145/3432933"
    },
    {
      "text": "Virginia Eubanks. 2018. Automating inequality: How high-tech tools profile, police, and punish the poor. St. Martin’s Press, New York, NY, USA.",
      "doi": "10.5555/3208509"
    },
    {
      "text": "Hayley Evans, Udaya Lakshmi, Hue Watson, Azra Ismail, Andrew M. Sherrill, Neha Kumar, and Rosa I. Arriaga. 2020. Understanding the Care Ecologies of Veterans with PTSD. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 43:1–43:15. https://doi.org/10.1145/3313831.3376170",
      "doi": "10.1145/3313831.3376170"
    },
    {
      "text": "Facebook. 2021. What are my ad preferences and how can I adjust them on Facebook?Retrieved August 31, 2021 from https://www.facebook.com/help/247395082112892",
      "doi": ""
    },
    {
      "text": "Roger D. Fallot and Maxine Harris. 2009. Creating cultures of trauma-informed care (CCTIC): A self-assessment and planning protocol. Technical Report. Community Connections, Washington DC, USA. https://www.theannainstitute.org/CCTICSELFASSPP.pdf",
      "doi": ""
    },
    {
      "text": "Casey Fiesler and Nicholas Proferes. 2018. “Participant” Perceptions of Twitter Research Ethics. Social Media + Society 4, 1 (2018), 1–14. https://doi.org/10.1177/2056305118763366",
      "doi": ""
    },
    {
      "text": "Forbrukerrådet. 2018. Deceived by Design: How tech companies use dark patterns to discourage us from exercising our rights to privacy. Technical Report. Norwegian Consumer Council. https://fil.forbrukerradet.no/wp-content/uploads/2018/06/2018-06-27-deceived-by-design-final.pdf.",
      "doi": ""
    },
    {
      "text": "Diana Freed, Jackeline Palmer, Diana Minchala, Karen Levy, Thomas Ristenpart, and Nicola Dell. 2018. “A Stalker’s Paradise”: How Intimate Partner Abusers Exploit Technology. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 667:1––667:13. https://doi.org/10.1145/3173574.3174241",
      "doi": "10.1145/3173574.3174241"
    },
    {
      "text": "Linda Garnets, Gregory M. Herek, and Barrie Levy. 1990. Violence and Victimization of Lesbians and Gay Men: Mental Health Consequences. Journal of Interpersonal Violence 5, 3 (1990), 366–383. https://doi.org/10.1177/088626090005003010",
      "doi": ""
    },
    {
      "text": "Neha Gill. 2019. The Importance Of Trauma-Informed Design. Retrieved September 6, 2021 from https://www.forbes.com/sites/forbesnonprofitcouncil/2019/12/09/the-importance-of-trauma-informed-design",
      "doi": ""
    },
    {
      "text": "David Glodstein, Susan L Glodstein, and James Fornaro. 2010. Fraud Trauma Syndrome: The Victims of the Bernard Madoff Scandal. Journal of Forensic Studies in Accounting & Business 2, 1 (2010), 1–9.",
      "doi": ""
    },
    {
      "text": "Robyn L. Gobin and Jennifer J. Freyd. 2014. The Impact of Betrayal Trauma on the Tendency to Trust. Psychological Trauma: Theory, Research, Practice, and Policy 6, 5(2014), 505–511. https://doi.org/10.1037/a0032452",
      "doi": ""
    },
    {
      "text": "Katelyn Golladay and Kristy Holtfreter. 2017. The consequences of identity theft victimization: An examination of emotional and physical health outcomes. Victims & Offenders 12, 5 (2017), 741–760. https://doi.org/10.1080/15564886.2016.1177766",
      "doi": ""
    },
    {
      "text": "Lauren Goode. 2021. I Called Off My Wedding. The Internet Will Never Forget. Retrieved August 29, 2021 from https://www.wired.com/story/weddings-social-media-apps-photos-memories-miscarriage-problem/",
      "doi": ""
    },
    {
      "text": "Lisa A. Goodman, Leonard Saxe, and Mary Harvey. 1991. Homelessness as psychological trauma: Broadening perspectives. American Psychologist 46, 11 (1991), 1219–1225. https://doi.org/10.1037/0003-066X.46.11.1219",
      "doi": ""
    },
    {
      "text": "Mitchell L Gordon, Kaitlyn Zhou, Kayur Patel, Tatsunori Hashimoto, and Michael S Bernstein. 2021. The disagreement deconvolution: Bringing machine learning performance metrics in line with reality. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 388:1–388:14. https://doi.org/10.1145/3411764.3445423",
      "doi": "10.1145/3411764.3445423"
    },
    {
      "text": "Mary L Gray and Siddharth Suri. 2019. Ghost work: How to stop Silicon Valley from building a new global underclass. Mariner Books, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "Stephanie Greer, Danielle Ramo, Yin-Juei Chang, Michael Fu, Judith Moskowitz, and Jana Haritatos. 2019. Use of the chatbot “vivibot” to deliver positive psychology skills and promote well-being among young people after cancer treatment: randomized controlled feasibility trial. JMIR Mhealth Uhealth 7, 10 (2019), e15018. https://doi.org/10.2196/15018",
      "doi": ""
    },
    {
      "text": "Linda J Griffith and S David Leonard. 1997. Association of colors with warning signal words. International Journal of Industrial Ergonomics 20, 4(1997), 317–325. https://doi.org/10.1016/S0169-8141(96)00062-5",
      "doi": ""
    },
    {
      "text": "Hana Habib, Sarah Pearman, Jiamin Wang, Yixin Zou, Alessandro Acquisti, Lorrie Faith Cranor, Norman Sadeh, and Florian Schaub. 2020. “It’s a scavenger hunt”: Usability of Websites’ Opt-Out and Data Deletion Choices. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 384:1–384:12. https://doi.org/10.1145/3313831.3376511",
      "doi": "10.1145/3313831.3376511"
    },
    {
      "text": "Oliver Haimson, Daniel Delmonaco, Peipei Nie, and Andrea Wegner. 2021. Disproportionate Removals and Differing Content Moderation Experiences for Conservative, Transgender, and Black Social Media Users: Marginalization and Moderation Gray Areas. Proceedings of the ACM on Human-Computer Interaction 5, CSCW2(2021), 466:1–466:35.",
      "doi": "10.1145/3479610"
    },
    {
      "text": "Oliver L. Haimson, Jed R. Brubaker, Lynn Dombrowski, and Gillian R. Hayes. 2015. Disclosure, Stress, and Support During Gender Transition on Facebook. In Proceedings of the Conference on Computer Supported Cooperative Work & Social Computing (CSCW). ACM, New York, NY, USA, 1176–1190. https://doi.org/10.1145/2675133.2675152",
      "doi": "10.1145/2675133.2675152"
    },
    {
      "text": "Oliver L Haimson, Justin Buss, Zu Weinger, Denny L Starks, Dykee Gorrell, and Briar Sweetbriar Baron. 2020. Trans Time: Safety, Privacy, and Content Warnings on a Transgender-Specific Social Media Site. Proceedings of the ACM on Human-Computer Interaction 4, CSCW2(2020), 124:1–124:27. https://doi.org/10.1145/3415195",
      "doi": "10.1145/3415195"
    },
    {
      "text": "Rochelle F. Hanson and Jason Lang. 2016. A Critical Look At Trauma-Informed Care Among Agencies and Systems Serving Maltreated Youth and Their Families. Child Maltreatment 21, 2 (2016), 95–100. https://doi.org/10.1177/1077559516635274",
      "doi": ""
    },
    {
      "text": "Erika Harrell. 2021. Victims of identity theft, 2018. Technical Report. U.S. Department of Justice. https://bjs.ojp.gov/content/pub/pdf/vit18.pdf",
      "doi": ""
    },
    {
      "text": "Maxine Harris and Roger D. Fallot. 2001. Designing Trauma-Informed Addictions Services. New Directions for Mental Health Services 2001, 89 (2001), 57–73. https://doi.org/10.1002/yd.23320018907",
      "doi": ""
    },
    {
      "text": "Steve Harrison, Phoebe Sengers, and Deborah Tatar. 2011. Making epistemological trouble: Third-paradigm HCI as successor science. Interacting with computers 23, 5 (2011), 385–392. https://doi.org/10.1016/j.intcom.2011.03.005",
      "doi": ""
    },
    {
      "text": "Morit Heitzler. 2013. Broken boundaries, invaded territories: The challenges of containment in trauma work. International Body Psychotherapy Journal 12, 1 (2013), 28–41. https://www.ibpj.org/issues/articles/Heitzler%20-%20Broken%20Boundaries%20Invaded%20Territories.pdf",
      "doi": ""
    },
    {
      "text": "Tad Hirsch, Kritzia Merced, Shrikanth Narayanan, Zac E Imel, and David C Atkins. 2017. Designing contestability: Interaction design, machine learning, and mental health. In Proceedings of the Conference on Designing Interactive Systems (DIS). ACM, New York, NY, USA, 95–99. https://doi.org/10.1145/3064663.3064703",
      "doi": "10.1145/3064663.3064703"
    },
    {
      "text": "Esther Howe, Paola Pedrelli, Robert Morris, Maren Nyer, David Mischoulon, and Rosalind Picard. 2017. Feasibility of an Automated System Counselor for Survivors of Sexual Assault. Iproceedings 3, 1 (2017), e8585. https://doi.org/10.2196/iproc.8585",
      "doi": ""
    },
    {
      "text": "Matthew Hutson. 2021. The opacity of artificial intelligence makes it hard to tell when decision-making is biased. IEEE Spectrum 58, 2 (2021), 40–45. https://doi.org/10.1109/MSPEC.2021.9340114",
      "doi": ""
    },
    {
      "text": "Identity Theft Resource Center. 2018. The Aftermath: The Non-Economic Impacts of Identity Theft. Technical Report. Identity Theft Resource Center. https://www.idtheftcenter.org/aftermath2018/",
      "doi": ""
    },
    {
      "text": "Identity Theft Resource Center. 2021. Consumer Aftermath Report: How Identity Crimes Impact Victims, their Families, Friends and Workplaces. Technical Report. Identity Theft Resource Center. https://www.idtheftcenter.org/identity-theft-aftermath-study/",
      "doi": ""
    },
    {
      "text": "Jane Im, Jill Dimond, Melody Berton, Una Lee, Katherine Mustelier, Mark S Ackerman, and Eric Gilbert. 2021. Yes: Affirmative Consent as a Theoretical Framework for Understanding and Imagining Social Platforms. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 403:1–403:18. https://doi.org/10.1145/3411764.3445778",
      "doi": "10.1145/3411764.3445778"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E Grinter. 2010. Postcolonial computing: a lens on design and development. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 1311–1320. https://doi.org/10.1145/1753326.1753522",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Sandy E. James, Jody L Herman, Susan Rankin, Mara Keisling, LIsa Mottet, and Ma’ayan Anafi. 2016. The Report of the 2015 U.S. Transgender Survey. Technical Report. National Center for Transgender Equality. http://www.transequality.org/sites/default/files/docs/USTS-Full-Report-FINAL.PDF",
      "doi": ""
    },
    {
      "text": "Elizabeth K Hopper, Ellen L Bassuk, and Jeffrey Olivet. 2010. Shelter from the storm: Trauma-informed care in homelessness services settings. The Open Health Services and Policy Journal 3, 1 (2010), 80–100. https://doi.org/10.2174/1874924001003010080",
      "doi": ""
    },
    {
      "text": "Gunnur Karakurt, Douglas Smith, and Jason Whiting. 2014. Impact of Intimate Partner Violence on Women’s Mental Health. Journal of Family Violence 29, 7 (2014), 693–702. https://doi.org/10.1007/s10896-014-9633-2",
      "doi": ""
    },
    {
      "text": "Nancy Kassam-Adams, Susan Rzucidlo, Marie Campbell, Grace Good, Erin Bonifacio, Kimberly Slouf, Stephanie Schneider, Christine McKenna, Carol A. Hanson, and Donna Grather. 2015. Nurses’ Views and Current Practice of Trauma-Informed Pediatric Nursing Care. Journal of Pediatric Nursing 30, 3 (2015), 478–484. https://doi.org/10.1016/j.pedn.2014.11.008",
      "doi": ""
    },
    {
      "text": "Os Keyes. 2018. The Misgendering Machines: Trans/HCI Implications of Automatic Gender Recognition. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 88:1–88:22. https://doi.org/10.1145/3274357",
      "doi": "10.1145/3274357"
    },
    {
      "text": "Vanessa Kitzie. 2018. “I pretended to be a boy on the Internet”: Navigating affordances and constraints of social networking sites and search engines for LGBTQ+ identity work. First Monday 23, 7 (2018), 1. https://doi.org/10.5210/fm.v23i7.9264",
      "doi": ""
    },
    {
      "text": "Bran Knowles, Mark Rouncefield, Mike Harding, Nigel Davies, Lynne Blair, James Hannon, John Walden, and Ding Wang. 2015. Models and patterns of trust. In Proceedings of the Conference on Computer Supported Cooperative Work & Social Computing. ACM, New York, NY, USA, 328–338. https://doi.org/10.1145/2675133.2675154",
      "doi": "10.1145/2675133.2675154"
    },
    {
      "text": "Amy J. Ko. 2019. 100 hours of name change labor. Retrieved August 29, 2021 from https://medium.com/bits-and-behavior/100-hours-of-name-change-labor-c652c22a89b9",
      "doi": ""
    },
    {
      "text": "Amy J. Ko. 2020. Taking refuge from the internet. Retrieved August 29, 2021 from https://medium.com/bits-and-behavior/taking-refuge-from-the-internet-9c1c521a5a56",
      "doi": ""
    },
    {
      "text": "Kyriakos N Kotsoglou and Marion Oswald. 2020. The long arm of the algorithm? Automated Facial Recognition as evidence and trigger for police intervention. Forensic Science International: Synergy 2 (2020), 86–89. https://doi.org/10.1016/j.fsisyn.2020.01.002",
      "doi": ""
    },
    {
      "text": "Shanti Kulkarni. 2019. Intersectional trauma-informed intimate partner violence (IPV) services: Narrowing the gap between IPV service delivery and survivor needs. Journal of Family Violence 34, 1 (2019), 55–64. https://doi.org/10.1007/s10896-018-0001-5",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann, San Francisco, CA, USA.",
      "doi": ""
    },
    {
      "text": "Ada Lerner, Helen Yuxun He, Anna Kawakami, Silvia Catherine Zeamer, and Roberto Hoyle. 2020. Privacy and Activism in the Transgender Community. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 212:1–212:13. https://doi.org/10.1145/3313831.3376339",
      "doi": "10.1145/3313831.3376339"
    },
    {
      "text": "Jill Levenson. 2017. Trauma-Informed Social Work Practice. Social Work 62, 2 (April 2017), 105–113. https://doi.org/10.1093/sw/swx001",
      "doi": ""
    },
    {
      "text": "Yuan Li, Adel Yazdanmehr, Jingguo Wang, and H Raghav Rao. 2019. Responding to identity theft: A victimization perspective. Decision Support Systems 121 (2019), 13–24. https://doi.org/10.1016/j.dss.2019.04.002",
      "doi": "10.1016/j.dss.2019.04.002"
    },
    {
      "text": "Calvin A Liang, Sean A Munson, and Julie A Kientz. 2021. Embracing Four Tensions in Human-Computer Interaction Research with Marginalized People. ACM Transactions on Computer-Human Interaction 28, 2(2021), 1–47. https://doi.org/10.1145/3443686",
      "doi": "10.1145/3443686"
    },
    {
      "text": "Ann Light. 2011. HCI as heterodoxy: Technologies of identity and the queering of interaction with computers. Interacting with computers 23, 5 (2011), 430–438. https://doi.org/10.1016/j.intcom.2011.02.002",
      "doi": ""
    },
    {
      "text": "Bingjie Liu and S Shyam Sundar. 2018. Should machines express sympathy and empathy? Experiments with a health advice chatbot. Cyberpsychology, Behavior, and Social Networking 21, 10(2018), 625–636. https://doi.org/10.1089/cyber.2018.0110",
      "doi": ""
    },
    {
      "text": "Emilia L Lombardi, Riki Anne Wilchins, Dana Priesing, and Diana Malouf. 2002. Gender violence: Transgender experiences with violence and discrimination. Journal of Homosexuality 42, 1 (2002), 89–101. https://doi.org/10.1300/J082v42n01_05",
      "doi": ""
    },
    {
      "text": "Steven H Lopez, Randy Hodson, and Vincent J Roscigno. 2009. Power, status, and abuse at work: General and sexual harassment compared. The Sociological Quarterly 50, 1 (2009), 3–27. https://www.jstor.org/stable/40220119",
      "doi": ""
    },
    {
      "text": "Gale M Lucas, Albert Rizzo, Jonathan Gratch, Stefan Scherer, Giota Stratou, Jill Boberg, and Louis-Philippe Morency. 2017. Reporting Mental Health Symptoms: Breaking Down Barriers to Care with Virtual Human Interviewers. Frontiers in Robotics and AI 4 (2017), 51:1–51:9. https://doi.org/10.3389/frobt.2017.00051",
      "doi": ""
    },
    {
      "text": "Meghan L Marsac, Nancy Kassam-Adams, Aimee K Hildenbrand, Elizabeth Nicholls, Flaura K Winston, Stephen S Leff, and Joel Fein. 2016. Implementing a trauma-informed approach in pediatric health care networks. JAMA Pediatrics 170, 1 (2016), 70–77. https://doi.org/10.1001/jamapediatrics.2015.2206",
      "doi": ""
    },
    {
      "text": "Sandra L Martin, Olivia Silber Ashley, LeBretia White, Sarah Axelson, Marc Clark, and Barri Burrus. 2017. Incorporating trauma-informed care into school-based programs. Journal of School Health 87, 12 (2017), 958–967. https://doi.org/10.1111/josh.12568",
      "doi": ""
    },
    {
      "text": "Michael Massimi and Ronald M. Baecker. 2011. Dealing with Death in Design: Developing Systems for the Bereaved. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 1001–1010. https://doi.org/10.1145/1978942.1979092",
      "doi": "10.1145/1978942.1979092"
    },
    {
      "text": "Arunesh Mathur, Josefine Engel, Sonam Sobti, Victoria Chang, and Marshini Chetty. 2016. “They Keep Coming Back Like Zombies”: Improving Software Updating Interfaces. In Symposium on Usable Privacy and Security. USENIX Association, Berkeley, CA, USA, 43–58. https://www.usenix.org/system/files/conference/soups2016/soups2016-paper-mathur.pdf",
      "doi": ""
    },
    {
      "text": "Tara Matthews, Kathleen O’Leary, Anna Turner, Manya Sleeper, Jill Palzkill Woelfer, Martin Shelton, Cori Manthorne, Elizabeth F. Churchill, and Sunny Consolvo. 2017. Stories from Survivors: Privacy & Security Practices when Coping with Intimate Partner Abuse. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 2189–2201. https://doi.org/10.1145/3025453.3025875",
      "doi": "10.1145/3025453.3025875"
    },
    {
      "text": "Frank H. McCourt. 2021. The Internet Is Beyond Repair. It’s Time to Stop Trying to Fix It. Retrieved January 5, 2022 from https://www.barrons.com/articles/big-tech-has-broken-the-internet-dont-fix-it-rebuild-51637318700",
      "doi": ""
    },
    {
      "text": "Allison McDonald, Catherine Barwulor, Michelle L Mazurek, Florian Schaub, and Elissa M Redmiles. 2021. “It’s stressful having all these phones”: Investigating Sex Workers’ Safety Goals, Risks, and Practices Online. In USENIX Security Symposium. USENIX Association, Berkeley, CA, USA, 375–392. https://www.usenix.org/system/files/sec21-mcdonald.pdf",
      "doi": ""
    },
    {
      "text": "Carolyn McKay. 2020. Predicting risk in criminal procedure: actuarial tools, algorithms, AI and judicial decision-making. Current Issues in Criminal Justice 32, 1 (2020), 22–39. https://doi.org/10.1080/10345329.2019.1658694",
      "doi": ""
    },
    {
      "text": "D. Harrison Mcknight and Norman L. Chervany. 1996. The Meanings of Trust. Retrieved August 29, 2021 from http://citeseerx.ist.psu.edu/viewdoc/summary?doi=10.1.1.155.1213",
      "doi": ""
    },
    {
      "text": "Christopher Menschner and Alexandra Maul. 2016. Key ingredients for successful trauma-informed care implementation. Technical Report. Center for Health Care Strategies, Trenton, NJ, USA. https://www.samhsa.gov/sites/default/files/programs_campaigns/childrens_mental_health/atc-whitepaper-040616.pdf",
      "doi": ""
    },
    {
      "text": "Peter Mertin and Philip B. Mohr. 2001. A Follow-Up Study of Posttraumatic Stress Disorder, Anxiety, and Depression in Australian Victims of Domestic Violence. Violence and Victims 16, 6 (2001), 645–54. https://www.proquest.com/docview/808559022/abstract/E7A11D1417BB42BAPQ/1",
      "doi": ""
    },
    {
      "text": "Microsoft. 2016. Microsoft’s AI vision, rooted in research, conversations. Retrieved August 30, 2021 from https://news.microsoft.com/features/microsofts-ai-vision-rooted-in-research-conversations/",
      "doi": ""
    },
    {
      "text": "Niki A. Miller and Lisa M. Najavits. 2012. Creating Trauma-Informed Correctional Care: A Balance of Goals and Environment. European Journal of Psychotraumatology 3, s1 (May 2012), 17246. https://doi.org/10.3402/ejpt.v3i0.17246",
      "doi": ""
    },
    {
      "text": "Jessica Minahan. 2019. Trauma-informed teaching strategies.Retrieved August 29, 2021 from https://www.ascd.org/el/articles/trauma-informed-teaching-strategies",
      "doi": ""
    },
    {
      "text": "Dinesh Mittal, Karen L. Drummond, Dean Blevins, Geoffrey Curran, Patrick Corrigan, and Greer Sullivan. 2013. Stigma Associated with PTSD: Perceptions of Treatment Seeking Combat Veterans. Psychiatric Rehabilitation Journal 36, 2 (2013), 86–92. https://doi.org/10.1037/h0094976",
      "doi": ""
    },
    {
      "text": "Lauren Mizock and Thomas K. Lewis. 2008. Trauma in Transgender Populations: Risk, Resilience, and Clinical Care. Journal of Emotional Abuse 8, 3 (2008), 335–354. https://doi.org/10.1080/10926790802262523",
      "doi": ""
    },
    {
      "text": "Mainack Mondal, Johnnatan Messias, Saptarshi Ghosh, Krishna P Gummadi, and Aniket Kate. 2016. Forgetting in social media: Understanding and controlling longitudinal exposure of socially shared data. In Symposium on Usable Privacy and Security. USENIX Association, Berkeley, CA, USA, 287–299. https://www.usenix.org/system/files/conference/soups2016/soups2016-paper-mondal.pdf",
      "doi": ""
    },
    {
      "text": "Carol Moser, Sarita Y Schoenebeck, and Paul Resnick. 2019. Impulse buying: Design practices and consumer needs. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 242:1–242:15. https://doi.org/10.1145/3290605.3300472",
      "doi": "10.1145/3290605.3300472"
    },
    {
      "text": "Roberto Encarnación Mosquera, Habib M Fardoun, Daniyal Alghazzawi, Cesar Collazos, and Víctor M Ruiz Penichet. 2018. Design guidelines for the implementation of an interactive virtual reality application that supports the rehabilitation of amputees of lower limbs patients with post-traumatic stress disorder (PTSD). In HCI International 2018 – Posters’ Extended Abstracts. Springer, New York, NY, USA, 17–31. https://doi.org/10.1007/978-3-319-92279-9_3",
      "doi": ""
    },
    {
      "text": "Nasim Motalebi and Saeed Abdullah. 2018. Conversational agents to provide couple therapy for patients with PTSD. In Proceedings of the International Conference on Pervasive Computing Technologies for Healthcare. ACM, New York, NY, USA, 347–351. https://doi.org/10.1145/3240925.3240933",
      "doi": "10.1145/3240925.3240933"
    },
    {
      "text": "Deirdre K Mulligan, Daniel Kluttz, and Nitin Kohli. 2019. Shaping our tools: Contestability as a means to promote responsible algorithmic decision making in the professions. Retrieved September 6, 2021 from http://dx.doi.org/10.2139/ssrn.3311894",
      "doi": ""
    },
    {
      "text": "Coral Muskett. 2014. Trauma-Informed Care in Inpatient Mental Health Settings: A Review of the Literature. International Journal of Mental Health Nursing 23, 1 (2014), 51–59. https://doi.org/10.1111/inm.12012",
      "doi": ""
    },
    {
      "text": "National Women’s Law Center. 2018. Out of the Shadows: An Analysis of Sexual Harassment Charges Filed by Working Women. Technical Report. National Women’s Law Center. https://nwlc.org/wp-content/uploads/2018/08/SexualHarassmentReport.pdf.",
      "doi": ""
    },
    {
      "text": "Yuval Neria, Evelyn J. Bromet, Sylvia Sievers, Janet Lavelle, and Laura J. Fochtmann. 2002. Trauma Exposure and Posttraumatic Stress Disorder in Psychosis: Findings from a First-Admission Cohort. Journal of Consulting and Clinical Psychology 70, 1(2002), 246–251. https://doi.org/10.1037/0022-006X.70.1.246",
      "doi": ""
    },
    {
      "text": "Jakob Nielsen and Rolf Molich. 1990. Heuristic Evaluation of User Interfaces. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 249–256. https://doi.org/10.1145/97243.97281",
      "doi": "10.1145/97243.97281"
    },
    {
      "text": "Ihudiya Finda Ogbonnaya-Ogburu, Angela DR Smith, Alexandra To, and Kentaro Toyama. 2020. Critical race theory for HCI. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 265:1–265:16. https://doi.org/10.1145/3313831.3376392",
      "doi": "10.1145/3313831.3376392"
    },
    {
      "text": "Kathleen O’Leary, Arpita Bhattacharya, Sean A Munson, Jacob O Wobbrock, and Wanda Pratt. 2017. Design opportunities for mental health peer support technologies. In Proceedings of the Conference on Computer Supported Cooperative Work & Social Computing. ACM, New York, NY, USA, 1470–1484. https://doi.org/10.1145/2998181.2998349",
      "doi": "10.1145/2998181.2998349"
    },
    {
      "text": "Resmiye Oral, Marizen Ramirez, Carol Coohey, Stephanie Nakada, Amy Walz, Angela Kuntz, Jenna Benoit, and Corinne Peek-Asa. 2016. Adverse Childhood Experiences and Trauma Informed Care: The Future of Health Care. Pediatric Research 79, 1 (2016), 227–233. https://doi.org/10.1038/pr.2015.197",
      "doi": ""
    },
    {
      "text": "World Health Organization and Pan American Health Organization. 2012. Understanding and addressing violence against women: intimate partner violence. Technical Report. World Health Organization. https://apps.who.int/iris/handle/10665/77432",
      "doi": ""
    },
    {
      "text": "Kentrell Owens, Camille Cobb, and Lorrie Cranor. 2021. “You Gotta Watch What You Say”: Surveillance of Communication with Incarcerated People. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 62:1–62:18. https://doi.org/10.1145/3411764.3445055",
      "doi": "10.1145/3411764.3445055"
    },
    {
      "text": "Nirmita Panchal, Rabah Kamal, Cynthia Cox, and Rachel Garfield. 2021. The Implications of COVID-19 for Mental Health and Substance Use. Retrieved September 6, 2021 from https://www.kff.org/coronavirus-covid-19/issue-brief/the-implications-of-covid-19-for-mental-health-and-substance-use/",
      "doi": ""
    },
    {
      "text": "Deuk Hee Park, Hyea Kyeong Kim, Il Young Choi, and Jae Kyeong Kim. 2012. A literature review and classification of recommender systems research. Expert systems with applications 39, 11 (2012), 10059–10072. https://doi.org/10.1016/j.eswa.2012.02.038",
      "doi": ""
    },
    {
      "text": "Sarah M. Peitzmeier, Mannat Malik, Shanna K. Kattari, Elliot Marrow, Rob Stephenson, Madina Agénor, and Sari L. Reisner. 2020. Intimate Partner Violence in Transgender Populations: Systematic Review and Meta-Analysis of Prevalence and Correlates. American Journal of Public Health 110, 9 (2020), e1–e14. https://doi.org/10.2105/AJPH.2020.305774",
      "doi": ""
    },
    {
      "text": "Sarah Perez. 2019. Twitter launches a way to report abusive use of its Lists feature. Retrieved August 29, 2021 from https://techcrunch.com/2019/11/18/twitter-launches-a-way-to-report-abusive-use-of-its-lists-feature/",
      "doi": ""
    },
    {
      "text": "Diana L. Perry and Monica L. Daniels. 2016. Implementing Trauma—Informed Practices in the School Setting: A Pilot Study. School Mental Health: A Multidisciplinary Research and Practice Journal 8, 1(2016), 177–188. https://doi.org/10.1007/s12310-016-9182-3",
      "doi": ""
    },
    {
      "text": "Justin Petelka, Yixin Zou, and Florian Schaub. 2019. Put your warning where your link is: Improving and evaluating email phishing warnings. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 518:1–518:15. https://doi.org/10.1145/3290605.3300748",
      "doi": "10.1145/3290605.3300748"
    },
    {
      "text": "Anthony T. Pinter, Morgan Klaus Scheuerman, and Jed R. Brubaker. 2021. Entering Doors, Evading Traps: Benefits and Risks of Visibility During Transgender Coming Outs. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 272:1–272:27. https://doi.org/10.1145/3434181",
      "doi": "10.1145/3434181"
    },
    {
      "text": "Nicole Leeper Piquero, Mark A Cohen, and Alex R Piquero. 2011. How much is the public willing to pay to be protected from identity theft?Justice Quarterly 28, 3 (2011), 437–459. https://doi.org/10.1080/07418825.2010.511245",
      "doi": ""
    },
    {
      "text": "Thomas Ploug and Søren Holm. 2020. The four dimensions of contestable AI diagnostics-A patient-centric approach to explainable AI. Artificial Intelligence in Medicine 107 (2020), 101901. https://doi.org/10.1016/j.artmed.2020.101901",
      "doi": ""
    },
    {
      "text": "Nicholas Proferes, Naiyan Jones, Sarah Gilbert, Casey Fiesler, and Michael Zimmer. 2021. Studying Reddit: A Systematic Overview of Disciplines, Approaches, Methods, and Ethics. Social Media+ Society 7, 2 (2021), 1–14. https://doi.org/10.1177/20563051211019004",
      "doi": ""
    },
    {
      "text": "Public Health Agency of Canada. 2018. Trauma and Violence-Informed Approaches to Policy and Practice. Retrieved August 29, 2021 from https://www.canada.ca/en/public-health/services/publications/health-risks-safety/trauma-violence-informed-approaches-policy-practice.html",
      "doi": ""
    },
    {
      "text": "Hawra Rabaan. 2021. Exploring Transformative Justice Principles to Inform Survivor-Centered Design for Muslim Women in the United States. In Companion Publication of the Conference on Computer Supported Cooperative Work and Social Computing. ACM, New York, NY, USA, 291–294. https://doi.org/10.1145/3462204.3481797",
      "doi": "10.1145/3462204.3481797"
    },
    {
      "text": "Sheela Raja, Memoona Hasnain, Michelle Hoersch, Stephanie Gove-Yin, and Chelsea Rajagopalan. 2015. Trauma informed care in medicine. Family & community health 38, 3 (2015), 216–226. https://doi.org/10.1097/FCH.0000000000000071",
      "doi": ""
    },
    {
      "text": "Inioluwa Deborah Raji, Timnit Gebru, Margaret Mitchell, Joy Buolamwini, Joonseok Lee, and Emily Denton. 2020. Saving face: Investigating the ethical concerns of facial recognition auditing. In Proceedings of the AAAI/ACM Conference on AI, Ethics, and Society. ACM, New York, NY, USA, 145–151. https://doi.org/10.1145/3375627.3375820",
      "doi": "10.1145/3375627.3375820"
    },
    {
      "text": "Ryan Randa and Bradford W Reyns. 2020. The physical and emotional toll of identity theft victimization: A situational and demographic analysis of the National Crime Victimization Survey. Deviant Behavior 41, 10 (2020), 1290–1304. https://doi.org/10.1080/01639625.2019.1612980",
      "doi": ""
    },
    {
      "text": "Usha Ranji, Brittni Frederiksen, Alina Salganicoff, and Michelle Long. 2021. Women, Work, and Family During COVID-19: Findings from the KFF Women’s Health Survey. Technical Report. Kaiser Family Foundation. https://www.kff.org/womens-health-policy/issue-brief/women-work-and-family-during-covid-19-findings-from-the-kff-womens-health-survey/",
      "doi": ""
    },
    {
      "text": "Yolanda A Rankin and Jakita O Thomas. 2019. Straighten up and fly right: Rethinking intersectionality in HCI research. Interactions 26, 6 (2019), 64–68. https://doi.org/10.1145/3363033",
      "doi": "10.1145/3363033"
    },
    {
      "text": "Elizabeth Reeves. 2015. A Synthesis of the Literature on Trauma-Informed Care. Issues in Mental Health Nursing 36, 9 (Sept. 2015), 698–709. https://doi.org/10.3109/01612840.2015.1025319",
      "doi": ""
    },
    {
      "text": "Carrie W Rishel, Jiyoung K Tabone, Helen P Hartnett, and Kathy F Szafran. 2019. Trauma-Informed Elementary Schools: Evaluation of School-Based Early Intervention for Young Children. Children & Schools 41, 4 (2019), 239–248. https://doi.org/10.1093/cs/cdz017",
      "doi": ""
    },
    {
      "text": "Sarah T Roberts. 2019. Behind the Screen: Content Moderation in the Shadows of Social Media. Yale University Press, New Haven, CT, USA.",
      "doi": ""
    },
    {
      "text": "Heather Rosoff, Jinshu Cui, and Richard John. 2014. Behavioral experiments exploring victims’ response to cyber-based financial fraud and identity theft scenario simulations. In Symposium On Usable Privacy and Security. USENIX Association, Berkeley, CA, USA, 175–186. https://www.usenix.org/system/files/conference/soups2014/soups14-paper-rosoff.pdf",
      "doi": ""
    },
    {
      "text": "Cynthia Rudin. 2019. Stop explaining black box machine learning models for high stakes decisions and use interpretable models instead. Nature Machine Intelligence 1, 5 (2019), 206–215. https://www.nature.com/articles/s42256-019-0048-x",
      "doi": ""
    },
    {
      "text": "Jo Rycroft-Malone, Christopher Burton, Joyce E Wilkinson, Gill Harvey, Brendan McCormack, Richard Baker, Sue Dopson, Ian Graham, Sophie Staniszewska, Carl Thompson, 2015. Collective action for knowledge moblisation: a realist evaluation of the collaborations for leadership in applied Health Research and care. Technical Report. National Institute for Health Research. https://www.ncbi.nlm.nih.gov/books/NBK332950/",
      "doi": ""
    },
    {
      "text": "Christian Sandvig, Kevin Hamilton, Karrie Karahalios, and Cedric Langbort. 2014. Auditing algorithms: Research methods for detecting discrimination on internet platforms. In Data and Discrimination: Converting Critical Concerns into Productive Inquiry. International Communication Association, Seattle, WA, USA, 1–23. https://social.cs.uiuc.edu/papers/pdfs/ICA2014-Sandvig.pdf",
      "doi": ""
    },
    {
      "text": "Brenda K Savage. 2016. Race-of-interviewer effects and survey questions about police violence. Sociological Spectrum 36, 3 (2016), 142–157. https://doi.org/10.1080/02732173.2015.1110508",
      "doi": ""
    },
    {
      "text": "Devansh Saxena, Karla Badillo-Urquiola, Pamela J Wisniewski, and Shion Guha. 2020. A Human-Centered Review of Algorithms used within the US Child Welfare System. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 102:1–102:15. https://doi.org/10.1145/3313831.3376229",
      "doi": ""
    },
    {
      "text": "Scamwatch. 2021. Identity theft: I lost $6028 when scammers stole my identity. Retrieved August 29, 2021 from https://www.scamwatch.gov.au/get-help/real-life-stories/scam-victims-tell-us-their-stories/identity-theft-i-lost-6028-when-scammers-stole-my-identity",
      "doi": ""
    },
    {
      "text": "Florian Schaub and Lorrie Faith Cranor. 2020. Usable and Useful Privacy Interfaces. In An Introduction to Privacy for Technology Professionals, Travis D Breaux (Ed.). International Association of Privacy Professionals, Portsmouth, NH, USA, 176–238. https://iapp.org/media/pdf/certification/IAPP-Intro-to-Privacy-for-Tech-Prof-SAMPLE.pdf.",
      "doi": ""
    },
    {
      "text": "Morgan Klaus Scheuerman, Stacy M. Branham, and Foad Hamidi. 2018. Safe Spaces and Safe Places: Unpacking Technology-Mediated Experiences of Safety and Harm with Transgender People. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 155:1–155:27. https://doi.org/10.1145/3274424",
      "doi": "10.1145/3274424"
    },
    {
      "text": "Dawn Schlecht. 2021. A Step-By-Step Guide To User Experience (UX) Patterns. Retrieved August 29, 2021 from https://careerfoundry.com/en/blog/ux-design/ux-patterns-why-use-them/",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W Keith Edwards, and Rebecca E Grinter. 2017. Intersectional HCI: Engaging identity through gender, race, and class. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Sarita Schoenebeck, Oliver L Haimson, and Lisa Nakamura. 2021. Drawing from justice theories to support targets of online harassment. New Media & Society 23, 5 (2021), 1278–1300. https://doi.org/10.1177/1461444820913122 arXiv:https://doi.org/10.1177/1461444820913122",
      "doi": ""
    },
    {
      "text": "Sarita Schoenebeck, Carol F. Scott, Emma Grace Hurley, Tammy Chang, and Ellen Selkie. 2021. Youth Trust in Social Media Companies and Expectations of Justice: Accountability and Repair After Online Harassment. Proc. ACM Hum.-Comput. Interact. 5, CSCW1, Article 2 (apr 2021), 18 pages. https://doi.org/10.1145/3449076",
      "doi": "10.1145/3449076"
    },
    {
      "text": "Farhana Shahid, Wasifur Rahman, M. Saifur Rahman, Sharmin Akther Purabi, Ayesha Seddiqa, Moin Mostakim, Farhan Feroz, Tanjir Rashid Soron, Fahmida Hossain, Nabila Khan, Anika Binte Islam, Nipi Paul, Ehsan Hoque, and A. B. M. Alim Al Islam. 2020. Leveraging Free-Hand Sketches for Potential Screening of PTSD. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 3 (2020), 94:1–94:22. https://doi.org/10.1145/3411835",
      "doi": "10.1145/3411835"
    },
    {
      "text": "Ruth Shillair, Shelia R Cotten, Hsin-Yi Sandy Tsai, Saleem Alhabash, Robert LaRose, and Nora J Rifon. 2015. Online safety begins with you and me: Convincing Internet users to protect themselves. Computers in Human Behavior 48 (2015), 199–207. https://doi.org/10.1016/j.chb.2015.01.046",
      "doi": "10.1016/j.chb.2015.01.046"
    },
    {
      "text": "Donghee Shin. 2020. User perceptions of algorithmic decisions in the personalized AI system: perceptual evaluation of fairness, accountability, transparency, and explainability. Journal of Broadcasting & Electronic Media 64, 4 (2020), 541–565. https://doi.org/10.1080/08838151.2020.1843357",
      "doi": ""
    },
    {
      "text": "Emrys Shoemaker, Gudrun Svava Kristinsdottir, Tanuj Ahuja, Dina Baslan, Bryan Pon, Paul Currion, Pius Gumisizira, and Nicola Dell. 2019. Identity at the Margins: Examining Refugee Experiences with Digital Identity Systems in Lebanon, Jordan, and Uganda. In Proceedings of the Conference on Computing and Sustainable Societies. ACM, New York, NY, USA, 206–217. https://doi.org/10.1145/3314344.3332486",
      "doi": "10.1145/3314344.3332486"
    },
    {
      "text": "Lucy Simko, Ada Lerner, Samia Ibtasam, Franziska Roesner, and Tadayoshi Kohno. 2018. Computer Security and Privacy for Refugees in the United States. In Symposium on Security and Privacy. IEEE, New York, NY, USA, 409–423. https://doi.org/10.1109/SP.2018.00023",
      "doi": ""
    },
    {
      "text": "Ellen Simpson and Bryan Semaan. 2021. For You, or For”You”? Everyday LGBTQ+ Encounters with TikTok. Proceedings of the ACM on Human-Computer Interaction 4, CSCW3(2021), 252:1–252:34. https://doi.org/10.1145/3432951",
      "doi": ""
    },
    {
      "text": "Julia Slupska and Leonie Maria Tanczer. 2021. Threat Modeling Intimate Partner Violence: Tech Abuse as a Cybersecurity Challenge in the Internet of Things. In The Emerald International Handbook of Technology Facilitated Violence and Abuse, Jane Bailey, Asher Flynn, and Nicola Henry (Eds.). Emerald Publishing Limited, Bingley, West Yorkshire, UK, 663–688. https://doi.org/10.1108/978-1-83982-848-520211049",
      "doi": ""
    },
    {
      "text": "Sharon G Smith, Xinjian Zhang, Kathleen C Basile, Melissa T Merrick, Jing Wang, Marcie-jo Kresnow, and Jieru Chen. 2018. The National Intimate Partner and Sexual Violence Survey : 2015 Data Brief – Updated Release. Technical Report. Centers for Disease Control and Prevention. https://stacks.cdc.gov/view/cdc/60893",
      "doi": ""
    },
    {
      "text": "Katta Spiel, Oliver L Haimson, and Danielle Lottridge. 2019. How to do better with gender on surveys: a guide for HCI researchers. Interactions 26, 4 (2019), 62–65. https://doi.org/10.1145/3338283",
      "doi": "10.1145/3338283"
    },
    {
      "text": "Katta Spiel, Os Keyes, Ashley Marie Walker, Michael A DeVito, Jeremy Birnholtz, Emeline Brulé, Ann Light, Pınar Barlas, Jean Hardy, Alex Ahmed, 2019. Queer(ing) HCI: Moving forward in theory and practice. In Extended Abstracts of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 11:1–11:4. https://doi.org/10.1145/3290607.3311750",
      "doi": "10.1145/3290607.3311750"
    },
    {
      "text": "Miriah Steiger, Timir J Bharucha, Sukrit Venkatagiri, Martin J. Riedl, and Matthew Lease. 2021. The Psychological Well-Being of Content Moderators: The Emotional Labor of Commercial Moderation and Avenues for Improving Support. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 341:1–341:14. https://doi.org/10.1145/3411764.3445092",
      "doi": "10.1145/3411764.3445092"
    },
    {
      "text": "Rock Stevens, Daniel Votipka, Elissa M Redmiles, Colin Ahern, and Michelle L Mazurek. 2019. Applied Digital Threat Modeling: It Works. IEEE Security & Privacy 17, 4 (2019), 35–42. https://doi.org/10.1109/MSEC.2019.2909714",
      "doi": ""
    },
    {
      "text": "Yolande Strengers, Jathan Sadowski, Zhuying Li, Anna Shimshak, and Florian ’Floyd’Mueller. 2021. What Can HCI Learn from Sexual Consent? A Feminist Process of Embodied Consent for Interactions with Emerging Technologies. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 405:1–405:13. https://doi.org/10.1145/3411764.3445107",
      "doi": ""
    },
    {
      "text": "Angelika Strohmayer, Jenn Clamen, and Mary Laing. 2019. Technologies for Social Justice: Lessons from Sex Workers on the Front Lines. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 652:1–652:14. https://doi.org/10.1145/3290605.3300882",
      "doi": "10.1145/3290605.3300882"
    },
    {
      "text": "Chloe Rose Stuart-Ulin. 2018. Microsoft’s politically correct chatbot is even worse than its racist one. Retrieved August 30, 2021 from https://qz.com/1340990/microsofts-politically-correct-chat-bot-is-even-worse-than-its-racist-one/",
      "doi": ""
    },
    {
      "text": "Substance Abuse and Mental Health Services Administration. 2014. SAMHSA’s Concept of Trauma and Guidance for a Trauma-Informed Approach. Retrieved August 28, 2021 from https://ncsacw.samhsa.gov/userfiles/files/SAMHSA_Trauma.pdf",
      "doi": ""
    },
    {
      "text": "Substance Abuse and Mental Health Services Administration. 2016. DSM-IV to DSM-5 Acute Stress Disorder Comparison. Retrieved August 29, 2021 from https://www.ncbi.nlm.nih.gov/books/NBK519704/table/ch3.t30/",
      "doi": ""
    },
    {
      "text": "Joshua Sunshine, Serge Egelman, Hazim Almuhimedi, Neha Atri, Lorrie Faith Cranor, and Crying Wolf. 2009. An Empirical Study of SSL Warning Effectiveness. In Usenix Security Symposium. USENIX Association, Berkeley, CA, USA, 10–14. https://www.usenix.org/legacy/event/sec09/tech/full_papers/sunshine.pdf",
      "doi": ""
    },
    {
      "text": "Latanya Sweeney. 2013. Discrimination in online ad delivery. Commun. ACM 56, 5 (2013), 44–54. https://doi.org/10.1145/2447976.2447990",
      "doi": "10.1145/2447976.2447990"
    },
    {
      "text": "Yoshimitsu Takahashi, Chiyoko Uchida, Koichi Miyaki, Michi Sakai, Takuro Shimbo, and Takeo Nakayama. 2009. Potential benefits and harms of a peer support social network service on the internet for people with depressive tendencies: qualitative content analysis and social network analysis. Journal of medical Internet research 11, 3 (2009), e29. https://doi.org/10.2196/jmir.1142",
      "doi": ""
    },
    {
      "text": "Jonathan Taplin. 2017. Move fast and break things: How Facebook, Google, and Amazon have cornered culture and what it means for all of us. Little, Brown & Company, New York, NY, USA.",
      "doi": ""
    },
    {
      "text": "The Combahee River Collective. 1986. The Combahee River Collective Statement: Black Feminist Organizing in the Seventies and Eighties. Kitchen Table: Women of Color Press, Albany, NY, USA.",
      "doi": ""
    },
    {
      "text": "The National Child Traumatic Stress Network. 2015. Secondary Traumatic Stress: A Fact Sheet for Organizations Employing Community Violence Workers. Retrieved August 28, 2021 from https://www.nctsn.org/sites/default/files/resources//secondary_traumatic_stress_community_violence_workers.pdf",
      "doi": ""
    },
    {
      "text": "K. Thomas, D. Akhawe, M. Bailey, D. Boneh, E. Bursztein, S. Consolvo, N. Dell, Z. Durumeric, P. Kelley, D. Kumar, D. McCoy, S. Meiklejohn, T. Ristenpart, and G. Stringhini. 2021. SoK: Hate, Harassment, and the Changing Landscape of Online Abuse. In Symposium on Security and Privacy. IEEE, New York, NY, USA, 247–267. https://doi.org/10.1109/SP40001.2021.00028",
      "doi": ""
    },
    {
      "text": "Jenifer Tidwell. 2010. Designing interfaces: Patterns for effective interaction design. O’Reilly Media, Inc., Sebastopol, CA, USA.",
      "doi": ""
    },
    {
      "text": "Aaron Tilley. 2021. Slack Backtracks on New Way to Message Over Harassment Concern. Retrieved August 29, 2021 from https://www.wsj.com/articles/slack-backtracks-on-new-way-to-message-over-harassment-concern-11616624282",
      "doi": ""
    },
    {
      "text": "Alexandra To, Wenxia Sweeney, Jessica Hammer, and Geoff Kaufman. 2020. “They Just Don’t Get It”: Towards Social Technologies for Coping with Interpersonal Racism. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 24:1–24:29. https://doi.org/10.1145/3392828",
      "doi": "10.1145/3392828"
    },
    {
      "text": "Emily Tseng, Diana Freed, Kristen Engel, Thomas Ristenpart, and Nicola Dell. 2021. A Digital Safety Dilemma: Analysis of Computer-Mediated Computer Security Interventions for Intimate Partner Violence During COVID-19. In Proceedings of the Conference on Human Factors in Computing Systems (CHI). ACM, New York, NY, USA, 71:1–71:17. https://doi.org/10.1145/3411764.3445589",
      "doi": "10.1145/3411764.3445589"
    },
    {
      "text": "Gordon J Turnbull. 1998. A review of post-traumatic stress disorder. Part I: Historical development and classification. Injury 29, 2 (1998), 87–91. https://doi.org/10.1016/S0020-1383(97)00131-9",
      "doi": ""
    },
    {
      "text": "Laura Van Dernoot Lipsky. 2010. Trauma stewardship: An everyday guide to caring for self while caring for others. Berrett-Koehler Publishers, Oakland, CA, USA.",
      "doi": ""
    },
    {
      "text": "Laura A Voith, Tyrone Hamler, Meredith W Francis, Hyunjune Lee, and Amy Korsch-Williams. 2020. Using a Trauma-Informed, Socially Just Research Framework with Marginalized Populations: Practices and Barriers to Implementation. Social Work Research 44, 3 (2020), 169–181. https://doi.org/10.1093/swr/svaa013",
      "doi": ""
    },
    {
      "text": "Allison Ward-Lasher, Jill Messing, and Jillian Stein-Seroussi. 2017. Implementation of Trauma-Informed Care in a Housing First Program for Survivors of Intimate Partner Violence: A Case Study. Advances in Social Work 18, 1 (2017), 202–216. https://doi.org/10.18060/21313",
      "doi": ""
    },
    {
      "text": "Rick Wash, Emilee Rader, Kami Vaniea, and Michelle Rizor. 2014. Out of the loop: How automated software updates cause unintended security consequences. In Symposium On Usable Privacy and Security. USENIX Association, Berkeley, CA, USA, 89–104. https://www.usenix.org/system/files/soups14-paper-wash.pdf",
      "doi": ""
    },
    {
      "text": "Jamie White. 2014. The Nightmarish Experiences of an Identity Theft Victim. Retrieved August 29, 2021 from https://www.lifelock.com/learn-identity-theft-resources-nightmarish-experiences-identity-theft-victim.html",
      "doi": ""
    },
    {
      "text": "Joshua M. Wilson, Jenny E. Fauci, and Lisa A. Goodman. 2015. Bringing Trauma-Informed Practice to Domestic Violence Programs: A Qualitative Analysis of Current Approaches. American Journal of Orthopsychiatry 85, 6 (2015), 586–599. https://doi.org/10.1037/ort0000098",
      "doi": ""
    },
    {
      "text": "Marty J Wolf, Keith W Miller, and Frances S Grodzinsky. 2017. Why We Should Have Seen That Coming: Comments on Microsoft’s Tay “Experiment,” and Wider Implications. SIGCAS Computers and Society 47, 3 (2017), 54–64. https://doi.org/10.1145/3144592.3144598",
      "doi": "10.1145/3144592.3144598"
    },
    {
      "text": "Rebacca Wong. 2021. Guidelines to Incorporate Trauma-Informed Care Strategies in Qualitative Research. Retrieved September 6, 2021 from https://www.urban.org/urban-wire/guidelines-incorporate-trauma-informed-care-strategies-qualitative-research",
      "doi": ""
    },
    {
      "text": "Yixin Zou, Allison McDonald, Julia Narakornpichit, Nicola Dell, Thomas Ristenpart, Kevin Roundy, Florian Schaub, and Acar Tamersoy. 2021. The Role of Computer Security Customer Support in Helping Survivors of Intimate Partner Violence. In USENIX Security Symposium. USENIX Association, Berkeley, CA, USA, 429–446. https://www.usenix.org/system/files/sec21-zou.pdf",
      "doi": ""
    }
  ]
}