{
  "doi": "10.1145/3491102.3501993",
  "title": "Designing for Everyday Sounds at Home with People with Dementia and their Partners",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-15",
  "year": 2022,
  "badges": [],
  "abstract": "People with dementia and their caregivers aging in place have expressed the need for social, emotional, and recreational interventions at home. Listening to everyday sounds evokes memories and provides conversational cues to support social relations and elicit emotional responses for people with dementia. However, research has yet to explore how these meaningful experiences can be transferred into home settings. This paper presents the insights from our co-design study that involved three people with dementia and their partners in developing an interactive sound player for listening to everyday sounds at home. We report on the motivations of people with dementia and their caregivers to engage in meaningful sound-based activities at home and present the Tumbler as a prototype to foster initiative and agency in exploring familiar everyday sounds. We present design implications of how sound can enrich the everyday experiences of dementia by facilitating social and pleasurable moments at home.",
  "tags": [
    "Design",
    "Informal Caregiver",
    "Everyday Sounds",
    "Dementia",
    "Home"
  ],
  "authors": [
    {
      "name": "Maarten Houben",
      "institution": "Department of Industrial Design, Eindhoven University of Technology, Netherlands and Tranzo, School of Social and Behavioral Sciences, Tilburg University, Netherlands",
      "img": "/do/10.1145/contrib-99659178085/rel-imgonly/nieuwe_foto_reduced_size_trimmed.jpg",
      "acmid": "99659178085",
      "orcid": "0000-0002-6571-1925"
    },
    {
      "name": "Rens Brankaert",
      "institution": "Department of Industrial Design, Eindhoven University of Technology, Netherlands and Institute of Allied Health Professions, Fontys University of Applied Sciences, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659068300",
      "orcid": "missing"
    },
    {
      "name": "Gail Kenning",
      "institution": "University of New South Wales, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261298",
      "orcid": "missing"
    },
    {
      "name": "Inge Bongers",
      "institution": "Tranzo, School of Social and Behavioral Sciences, Tilburg University, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659441971",
      "orcid": "missing"
    },
    {
      "name": "Berry Eggen",
      "institution": "Department of Industrial Design, Eindhoven University of Technology, Netherlands",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100262920",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Sérgio Alves, Filipa Brito, Andreia Cordeiro, Luis Carriço, and Tiago Guerreiro. 2018. Enabling Biographical Cognitive Stimulation for People with Dementia. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems - CHI ’18, ACM Press, New York, New York, USA, 1–6. DOI:https://doi.org/10.1145/3170427.3188693",
      "doi": "10.1145/3170427.3188693"
    },
    {
      "text": "Alzheimer Association. 2019. 2019 Alzheimer's disease facts and figures. Alzheimer's Dement. 15, 3 (March 2019), 321–387. DOI:https://doi.org/10.1016/j.jalz.2019.01.010",
      "doi": ""
    },
    {
      "text": "Arlene J. Astell, Maggie P. Ellis, Norman Alm, Richard Dye, and Gary Gowans. 2010. Stimulating People with Dementia to Reminisce Using Personal and Generic Photographs. Int. J. Comput. Heal. 1, 2 (2010), 177–198. DOI:https://doi.org/10.1504/IJCIH.2010.037461",
      "doi": "10.1504/IJCIH.2010.037461"
    },
    {
      "text": "Arlene Jean Astell. 2006. Technology and personhood in dementia care. Qual. Ageing 7, 1 (2006), 15–25. DOI:https://doi.org/10.1108/14717794200600004",
      "doi": ""
    },
    {
      "text": "Jean-François Augoyard. 2006. Sonic experience: a guide to everyday sounds. McGill-Queen's Press.",
      "doi": ""
    },
    {
      "text": "Hanif Baharin, Stephen Viller, and Sean Rintel. 2015. SonicAIR: Supporting Independent Living with Reciprocal Ambient Audio Awareness. ACM Trans. Comput. Interact. 22, 4 (July 2015). DOI:https://doi.org/10.1145/2754165",
      "doi": "10.1145/2754165"
    },
    {
      "text": "Amee Baird and Séverine Samson. 2009. Memory for Music in Alzheimer's Disease: Unforgettable? Neuropsychol. Rev. 19, 1 (May 2009), 85–101. DOI:https://doi.org/10.1007/s11065-009-9085-2",
      "doi": ""
    },
    {
      "text": "Amee Baird and Séverine Samson. 2015. Music and dementia. In Progress in Brain Research, Eckart Altenmüller, Stanley Finger and François Boller (eds.). Elsevier, 207–235. DOI:https://doi.org/10.1016/bs.pbr.2014.11.028",
      "doi": ""
    },
    {
      "text": "Felicity Anne Baker, Jodie Bloska, Sabine Braat, Anna Bukowska, Imogen Clark, Ming H Hsu, Tone Kvamme, Nicola Lautenschlager, Young-Eun Claire Lee, Agnieszka Smrokowska-Reichmann, Tanara Vieira Sousa, Karette A Stensaeth, Jeanette Tamplin, Thomas Wosch, and Helen Odell-Miller. 2019. HOMESIDE: home-based family caregiver-delivered music and reading interventions for people living with dementia: protocol of a randomised controlled trial. BMJ Open 9, 11 (2019). DOI:https://doi.org/10.1136/bmjopen-2019-031332",
      "doi": ""
    },
    {
      "text": "Jeanette Bell and Tuck Wah Leong. 2019. Collaborative Futures: Co-Designing Research Methods for Younger People Living with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM Press, New York, New York, USA, 1–13. DOI:https://doi.org/10.1145/3290605.3300582",
      "doi": "10.1145/3290605.3300582"
    },
    {
      "text": "Ashok J. Bharucha, Vivek Anand, Jodi Forlizzi, Mary Amanda Dew, Charles F. Reynolds, Scott Stevens, and Howard Wactlar. 2009. Intelligent Assistive Technology Applications to Dementia Care: Current Capabilities, Limitations, and Future Challenges. Am. J. Geriatr. Psychiatry 17, 2 (February 2009), 88–104. DOI:https://doi.org/10.1097/JGP.0b013e318187dde5",
      "doi": ""
    },
    {
      "text": "Alethea Blackler, Li-Hao Chen, Shital Desai, and Arlene Astell. 2020. Intuitive Interaction Framework in User-Product Interaction for People Living with Dementia. In HCI and Design in the Context of Dementia, Rens Brankaert and Gail Kenning (eds.). Springer International Publishing, Cham, 147–169. DOI:https://doi.org/10.1007/978-3-030-32835-1_10",
      "doi": ""
    },
    {
      "text": "Stephanie Blackman, Claudine Matlo, Charisse Bobrovitskiy, Ashley Waldoch, Mei Lan Fang, Piper Jackson, Alex Mihailidis, Louise Nygård, Arlene Astell, and Andrew Sixsmith. 2016. Ambient Assisted Living Technologies for Aging Well: A Scoping Review. J. Intell. Syst. 25, 1 (January 2016), 55. DOI:https://doi.org/10.1515/jisys-2014-0136",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, Janet Vertesi, Phoebe Sengers, and Paul Dourish. 2007. How HCI Interprets the Probes. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1077–1086. DOI:https://doi.org/10.1145/1240624.1240789",
      "doi": "10.1145/1240624.1240789"
    },
    {
      "text": "Rita Maldonado Branco, Joana Quental, and Óscar Ribeiro. 2017. Personalised participation: an approach to involve people with dementia and their families in a participatory design project. CoDesign 13, 2 (2017), 127–143. DOI:https://doi.org/10.1080/15710882.2017.1310903",
      "doi": ""
    },
    {
      "text": "Rens Brankaert. 2016. Design for dementia: a design-driven living lab approach to involve people with dementia and their context. Eindhoven University of Technology, Eindhoven.",
      "doi": ""
    },
    {
      "text": "Rens Brankaert and Sandra Suijkerbuijk. 2019. Outdoor life and technology with dementia. In Using technology in dementia care, Arlene Astell, Sarah Smith and Phil Joddrell (eds.). Jessica Kingsley Publishers, 53–64.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qual. Res. Psychol. 3, 2 (January 2006), 77–101. DOI:https://doi.org/10.1191/1478088706qp063oa",
      "doi": ""
    },
    {
      "text": "Sarah Campbell, David Frohlich, Norman Alm, and Adam Vaughan. 2019. Sentimental Audio Memories: Exploring the Emotion and Meaning of Everyday Sounds. In Dementia Lab 2019. Making Design Work: Engaging with Dementia in Context. D-Lab 2019., Rens Brankaert and Wijnand IJsselsteijn (eds.). Springer, Cham, 73–81. DOI:https://doi.org/10.1007/978-3-030-33540-3_7",
      "doi": ""
    },
    {
      "text": "Romina Carrasco, Felicity A. Baker, Anna A. Bukowska, Imogen N. Clark, Libby M. Flynn, Kate McMahon, Helen Odell-Miller, Karette Stensaeth, Jeanette Tamplin, Tanara Vieira Sousa, Jenny Waycott, and Thomas Wosch. 2020. Empowering Caregivers of People Living with Dementia to Use Music Therapeutically at Home: Design Opportunities. In 32nd Australian Conference on Human-Computer Interaction (OzCHI ’20), Association for Computing Machinery, New York, NY, USA, 198–209. DOI:https://doi.org/10.1145/3441000.3441082",
      "doi": "10.1145/3441000.3441082"
    },
    {
      "text": "Joaquim Cerejeira, Luísa Lagarto, and Elizabeta Mukaetova-Ladinska. 2012. Behavioral and Psychological Symptoms of Dementia. Front. Neurol. 3, (2012), 73. DOI:https://doi.org/10.3389/fneur.2012.00073",
      "doi": ""
    },
    {
      "text": "Helen Chester, Paul Clarkson, Linda Davies, Caroline Sutcliffe, Sue Davies, Alexandra Feast, Jane Hughes, and David Challis. 2018. People with dementia and carer preferences for home support services in early-stage dementia. Aging Ment. Health 22, 2 (2018), 270–279. DOI:https://doi.org/10.1080/13607863.2016.1247424",
      "doi": ""
    },
    {
      "text": "Daphne Sze Ki Cheung, Shuk Kwan Tang, Ken Hok Man Ho, Cindy Jones, Mimi Mun Yee Tse, Rick Yiu Cho Kwan, Kit Ying Chan, and Vico Chung Lim Chiang. 2021. Strategies to engage people with dementia and their informal caregivers in dyadic intervention: A scoping review. Geriatr. Nurs. (Minneap). 42, 2 (2021), 412–420. DOI: https://doi.org/10.1016/j.gerinurse.2021.02.002",
      "doi": ""
    },
    {
      "text": "C.-Y. Chiao, H.-S. Wu, and C.-Y. Hsiao. 2015. Caregiver burden for informal caregivers of patients with dementia: A systematic review. Int. Nurs. Rev. 62, 3 (2015), 340–350. DOI: https://doi.org/10.1111/inr.12194",
      "doi": ""
    },
    {
      "text": "Tim Coughlan, Kerstin Leder Mackley, Michael Brown, Sarah Martindale, Stephan Schlögl, Becky Mallaband, John Arnott, Jettie Hoonhout, Dalila Szostak, Robin Brewer, Erika Poole, Antti Pirhonen, Val Mitchell, Sarah Pink, and Nicolas Hine. 2013. Current issues and future directions in methods for studying technology in the home. PsychNology J. 11, 2 (2013), 159–184.",
      "doi": ""
    },
    {
      "text": "Yngve Dahl and Dag Svanæs. 2020. Facilitating Democracy: Concerns from Participatory Design with Asymmetric Stakeholder Relations in Health Care. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–13. DOI:https://doi.org/10.1145/3313831.3376805",
      "doi": "10.1145/3313831.3376805"
    },
    {
      "text": "Jiamin Dai and Karyn Moffatt. 2021. Surfacing the Voices of People with Dementia: Strategies for Effective Inclusion of Proxy Stakeholders in Qualitative Research. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3411764.3445756",
      "doi": "10.1145/3411764.3445756"
    },
    {
      "text": "Jan Dewing. 2007. Participatory research: A method for process consent with persons who have dementia. Dementia 6, 1 (February 2007), 11–25. DOI:https://doi.org/10.1177/1471301207075625",
      "doi": ""
    },
    {
      "text": "Helen Dilkes, Nigel Frayne, and Virginia Lewis. 2006. Sound in Health project: characterising the sound environment in a palliative care unit and implementing a soundscape intervention. In Proceedings of the West Meets the East in Acoustic Ecology Conference, World Forum for Acoustic Ecology, Hirosaki, Japan, 1–22.",
      "doi": ""
    },
    {
      "text": "Emma Dixon and Amanda Lazar. 2020. The Role of Sensory Changes in Everyday Technology Use by People with Mild to Moderate Dementia. In The 22nd International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’20), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3373625.3417000",
      "doi": "10.1145/3373625.3417000"
    },
    {
      "text": "Tijs Duel, David M. Frohlich, Christian Kroos, Yong Xu, Philip J. B. Jackson, and Mark D. Plumbley. 2018. Supporting Audiography: Design of a System for Sentimental Sound Recording, Classification and Playback. In Communications in Computer and Information Science. Springer, Cham, 24–31. DOI:https://doi.org/10.1007/978-3-319-92270-6_4",
      "doi": ""
    },
    {
      "text": "James Edmeads and Oussama Metatla. 2019. Designing for Reminiscence with People with Dementia. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM Press, New York, New York, USA, 1–6. DOI:https://doi.org/10.1145/3290607.3313059",
      "doi": ""
    },
    {
      "text": "Sarah Foley, Daniel Welsh, Nadia Pantidi, Kellie Morrissey, Tom Nappey, and John McCarthy. 2019. Printer Pals: Experience-Centered Design to Support Agency for People with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM Press, New York, New York, USA, Paper 404, 1-13. DOI:https://doi.org/10.1145/3290605.3300634",
      "doi": "10.1145/3290605.3300634"
    },
    {
      "text": "David M Frohlich, Emily Corrigan-Kavanagh, Sarah Campbell, Theopisti Chrysanthaki, Paula Castro, Isabela Zaine, and Maria da Graça Campos Pimentel. 2020. Assistive Media for Well-being. In HCI and Design in the Context of Dementia, Rens Brankaert and Gail Kenning (eds.). Springer International Publishing, Cham, 189–205. DOI:https://doi.org/10.1007/978-3-030-32835-1_12",
      "doi": ""
    },
    {
      "text": "Julia Anne Garde, Mascha Cécile van der Voort, and Kristina Niedderer. 2018. Design Probes for People with Dementia. In Design as a catalyst for change - DRS International Conference 2018, Limerick, Ireland, 2607–2621. DOI:https://doi.org/10.21606/drs.2018.492",
      "doi": ""
    },
    {
      "text": "Karen Gold. 2014. But does it do any good? Measuring the impact of music therapy on people with advanced dementia: (Innovative practice). Dementia 13, 2 (2014), 258–264. DOI:https://doi.org/10.1177/1471301213494512",
      "doi": ""
    },
    {
      "text": "Connie Golsteijn and Elise van den Hoven. 2013. Facilitating parent-teenager communication through interactive photo cubes. Pers. Ubiquitous Comput. 17, 2 (2013), 273–286.",
      "doi": "10.1007/s00779-011-0487-9"
    },
    {
      "text": "Connie Guan, Anya Bouzida, Ramzy M Oncy-avila, Sanika Moharana, and Laurel D Riek. 2021. Taking an (Embodied) Cue From Community Health: Designing Dementia Caregiver Support Technology to Advance Health Equity. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (CHI ’21), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3411764.3445559",
      "doi": "10.1145/3411764.3445559"
    },
    {
      "text": "Marjolein den Haan, Nicole van Essen, Rens Brankaert, and Yuan Lu. 2021. Your Moments: Co-designing a Personalized Audio Player. In Dementia Lab 2021: Supporting Ability Through Design, Springer International Publishing, Cham, 63–71. DOI:https://doi.org/10.1007/978-3-030-70293-9_5",
      "doi": ""
    },
    {
      "text": "Niels Hendriks, Liesbeth Huybrechts, Karin Slegers, and Andrea Wilkinson. 2018. Valuing implicit decision-making in participatory design: A relational approach in design with people with dementia. Design Studies 59, 58–76. DOI:https://doi.org/10.1016/j.destud.2018.06.001",
      "doi": ""
    },
    {
      "text": "Niels Hendriks, Liesbeth Huybrechts, Andrea Wilkinson, and Karin Slegers. 2014. Challenges in doing participatory design with people with dementia. In Proceedings of the 13th Participatory Design Conference on Short Papers, Industry Cases, Workshop Descriptions, Doctoral Consortium papers, and Keynote abstracts - PDC ’14 - volume 2 (PDC ’14), ACM Press, New York, New York, USA, 33–36. DOI:https://doi.org/10.1145/2662155.2662196",
      "doi": "10.1145/2662155.2662196"
    },
    {
      "text": "Niels Hendriks, Karin Slegers, and Andrea Wilkinson. 2020. Against Dedicated Methods: Relational Expertise in Participatory Design with People with Dementia. In HCI and Design in the Context of Dementia, Rens Brankaert and Gail Kenning (eds.). Springer International Publishing, Cham, 97–109. DOI:https://doi.org/10.1007/978-3-030-32835-1_7",
      "doi": ""
    },
    {
      "text": "Elisabeth T. P. van den Heuvel, Luc P. de Witte, Robbert Sanderman, Lidwien M. Schure, and Betty Meyboom-de Jong. 2002. Non-participation and drop-out in support programs for caregivers of cognitively impaired elderly. In Supporting caregivers of stroke patients: An intervention study, Elisabeth T. P. van den Heuvel (ed.). University of Groningen, Groningen, 99–114.",
      "doi": ""
    },
    {
      "text": "James Hodge, Madeline Balaam, Sandra Hastings, and Kellie Morrissey. 2018. Exploring the Design of Tailored Virtual Reality Experiences for People with Dementia. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems (CHI ’18), ACM Press, New York, New York, USA, Paper 514, 1-13. DOI:https://doi.org/10.1145/3173574.3174088",
      "doi": "10.1145/3173574.3174088"
    },
    {
      "text": "James Hodge, Kyle Montague, Sandra Hastings, and Kellie Morrissey. 2019. Exploring Media Capture of Meaningful Experiences to Support Families Living with Dementia. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM Press, New York, New York, USA, 1–14. DOI:https://doi.org/10.1145/3290605.3300653",
      "doi": "10.1145/3290605.3300653"
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Saskia Bakker, Gail Kenning, Inge Bongers, and Berry Eggen. 2019. Foregrounding Everyday Sounds in Dementia. In Proceedings of the 2019 on Designing Interactive Systems Conference - DIS ’19, ACM Press, New York, NY, USA, 71–83. DOI:https://doi.org/10.1145/3322276.3322287",
      "doi": "10.1145/3322276.3322287"
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Saskia Bakker, Gail Kenning, Inge Bongers, and Berry Eggen. 2020. The Role of Everyday Sounds in Advanced Dementia Care. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, ACM Press, New York, NY, USA, Paper 450, pp. 1–14. DOI:https://doi.org/10.1145/3313831.3376577",
      "doi": "10.1145/3313831.3376577"
    },
    {
      "text": "Maarten Houben, Rens Brankaert, Gail Kenning, Berry Eggen, and Inge Bongers. 2020. The Perspectives of Professional Caregivers on Implementing Audio-Based Technology in Residential Dementia Care. Int. J. Environ. Res. Public Health 17, 17 (2020), 6333. DOI:https://doi.org/10.3390/ijerph17176333",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bo Westerlund, Benjamin B Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, and Björn Eiderbäck. 2003. Technology Probes: Inspiring Design for and with Families. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems (CHI ’03), Association for Computing Machinery, New York, NY, USA, 17–24. DOI:https://doi.org/10.1145/642611.642616",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Gail Kenning. 2018. Reciprocal design: inclusive design approaches for people with late stage dementia. Des. Heal. 2, 1 (January 2018), 142–162. DOI:https://doi.org/10.1080/24735132.2018.1453638",
      "doi": ""
    },
    {
      "text": "Gail Kenning, Alon Ilsar, Rens Brankaert, and Mark Evans. 2019. Improvisation and Reciprocal Design: Soundplay for Dementia. In Dementia Lab 2019. Making Design Work: Engaging with Dementia in Context. D-Lab 2019. Springer, Cham, 82–91. DOI:https://doi.org/10.1007/978-3-030-33540-3_8",
      "doi": ""
    },
    {
      "text": "Josephine Klefeker, Libi Striegl, and Laura Devendorf. 2020. What HCI Can Learn from ASMR: Becoming Enchanted with the Mundane. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–12. DOI:https://doi.org/10.1145/3313831.3376741",
      "doi": "10.1145/3313831.3376741"
    },
    {
      "text": "Rebecca Kleinberger, Alexandra Rieger, Janelle Sands, and Janet Baker. 2019. Supporting Elder Connectedness through Cognitively Sustainable Design Interactions with the Memory Music Box. In Proceedings of the 32nd Annual ACM Symposium on User Interface Software and Technology (UIST ’19), Association for Computing Machinery, New York, NY, USA, 355–369. DOI:https://doi.org/10.1145/3332165.3347877",
      "doi": "10.1145/3332165.3347877"
    },
    {
      "text": "Scott R Klemmer, Anoop K Sinha, Jack Chen, James A Landay, Nadeem Aboobaker, and Annie Wang. 2000. Suede: A Wizard of Oz Prototyping Tool for Speech User Interfaces. In Proceedings of the 13th annual ACM symposium on User interface software and technology - UIST ’00 (UIST ’00), ACM Press, New York, New York, USA, 1–10. DOI:https://doi.org/10.1145/354401.354406",
      "doi": "10.1145/354401.354406"
    },
    {
      "text": "Agnieszka Barbara Kolasinska, Myrte Thoolen, Sebastiaan Peek, Yuan Lu, and Rens Brankaert. 2021. Co-creating Design Opportunities for Social Technology in the Context of Dementia. In Dementia Lab 2021: Supporting Ability Through Design, Springer International Publishing, Cham, 125–141. DOI:https://doi.org/10.1007/978-3-030-70293-9_11",
      "doi": ""
    },
    {
      "text": "Pia C. Kontos. 2004. Ethnographic reflections on selfhood, embodiment and Alzheimer's disease. Ageing Soc. 24, 6 (November 2004), 829–849. DOI:https://doi.org/10.1017/S0144686X04002375",
      "doi": ""
    },
    {
      "text": "L. Koumakis, C. Chatzaki, E. Kazantzaki, E. Maniadi, and M. Tsiknakis. 2019. Dementia Care Frameworks and Assistive Technologies for Their Implementation: A Review. IEEE Rev. Biomed. Eng. 12, (2019), 4–18. DOI:https://doi.org/10.1109/RBME.2019.2892614",
      "doi": ""
    },
    {
      "text": "Amanda Lazar, Caroline Edasis, and Anne Marie Piper. 2017. A Critical Lens on Dementia and Design in HCI. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), ACM Press, New York, New York, USA, 2175–2188. DOI:https://doi.org/10.1145/3025453.3025522",
      "doi": "10.1145/3025453.3025522"
    },
    {
      "text": "Amanda Lazar, Hilaire Thompson, and George Demiris. 2014. A systematic review of the use of technology for reminiscence therapy. Health Educ. Behav. 41, 1 Suppl (October 2014), 51S-61S. DOI:https://doi.org/10.1177/1090198114537067",
      "doi": ""
    },
    {
      "text": "Micheline Lesaffre, Bart Moens, and Frank Desmet. 2017. Monitoring music and movement interaction in people with dementia. In The Routledge Companion to embodied music interaction. Routledge, 294–303.",
      "doi": ""
    },
    {
      "text": "Helle Nystrup Lund, Lars Rye Bertelsen, and Lars Ole Bonde. 2016. Sound and music interventions in psychiatry at Aalborg University Hospital. SoundEffects - An Interdiscip. J. Sound Sound Exp. 6, 1 (November 2016), 48–68. DOI:https://doi.org/10.7146/se.v6i1.24912",
      "doi": ""
    },
    {
      "text": "Stine S Lundgaard, Peter Axel Nielsen, and Jesper Kjeldskov. 2019. Interaction Design for Domestic Sound Zones. In Proceedings of the 14th International Audio Mostly Conference: A Journey in Sound (AM’19), Association for Computing Machinery, New York, NY, USA, 248–251. DOI:https://doi.org/10.1145/3356590.3356630",
      "doi": ""
    },
    {
      "text": "Remco Magielse and Serge Offermans. 2013. Future Lighting Systems. In CHI ’13 Extended Abstracts on Human Factors in Computing Systems (CHI EA ’13), Association for Computing Machinery, New York, NY, USA, 2853–2854. DOI:https://doi.org/10.1145/2468356.2479545",
      "doi": ""
    },
    {
      "text": "Julia M Mayer and Jelena Zach. 2013. Lessons Learned from Participatory Design with and for People with Dementia. In (MobileHCI ’13), ACM, 540–545. DOI:https://doi.org/10.1145/2493190.2494436",
      "doi": ""
    },
    {
      "text": "Justine McGovern. 2011. Couple meaning-making and dementia: challenges to the deficit model. J. Gerontol. Soc. Work 54, 7 (October 2011), 678–690. DOI:https://doi.org/10.1080/01634372.2011.593021",
      "doi": ""
    },
    {
      "text": "May Helen Midtbust, Rigmor Einang Alnes, Eva Gjengedal, and Else Lykkeslet. 2018. Perceived barriers and facilitators in providing palliative care for people with severe dementia: the healthcare professionals’ experiences. BMC Health Serv. Res. 18, 1 (2018), 709. DOI:https://doi.org/10.1186/s12913-018-3515-x",
      "doi": ""
    },
    {
      "text": "Alex Mihailidis, Jennifer N Boger, Tammy Craig, and Jesse Hoey. 2008. The COACH prompting system to assist older adults with dementia through handwashing: An efficacy study. BMC Geriatr. 8, 1 (December 2008), 28. DOI:https://doi.org/10.1186/1471-2318-8-28",
      "doi": ""
    },
    {
      "text": "Eneida Mioshi, Christopher M. Kipps, and John R. Hodges. 2009. Activities of Daily Living in Behavioral Variant Frontotemporal Dementia: Differences in Caregiver and Performance-based Assessments. Alzheimer Dis. Assoc. Disord. 23, 1 (January 2009), 70–76. DOI:https://doi.org/10.1097/WAD.0b013e318182d293",
      "doi": ""
    },
    {
      "text": "Susan L. Mitchell, Joan M. Teno, Dan K. Kiely, Michele L. Shaffer, Richard N. Jones, Holly G. Prigerson, Ladislav Volicer, Jane L. Givens, and Mary Beth Hamel. 2009. The clinical course of advanced dementia. N. Engl. J. Med. 361, 16 (2009), 1529–1538. DOI:https://doi.org/10.1056/NEJMoa0902234",
      "doi": ""
    },
    {
      "text": "Kellie Morrissey, John McCarthy, and Nadia Pantidi. 2017. The Value of Experience-Centred Design Approaches in Dementia Research Contexts. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (CHI ’17), ACM Press, New York, New York, USA, 1326–1338. DOI:https://doi.org/10.1145/3025453.3025527",
      "doi": "10.1145/3025453.3025527"
    },
    {
      "text": "Kellie Morrissey, Gavin Wood, David Green, Nadia Pantidi, and John McCarthy. 2016. ‘I'm a rambler, I'm a gambler, I'm a long way from home’: The Place of Props, Music, and Design in Dementia Care. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems - DIS ’16, ACM Press, New York, New York, USA, 1008–1020. DOI:https://doi.org/10.1145/2901790.2901798",
      "doi": "10.1145/2901790.2901798"
    },
    {
      "text": "Alexander Müller-Rakow and Rahel Flechtner. 2017. Designing Interactive Music Systems with and for People with Dementia. Des. J. 20, sup1 (July 2017), S2207. DOI:https://doi.org/10.1080/14606925.2017.1352736",
      "doi": ""
    },
    {
      "text": "S. Neves, A. Macdonald, M. Poole, and K. Harrison Dening. 2021. Participatory Co-design: Approaches to Enable People Living with Challenging Health Conditions to Participate in Design Research. In Perspectives on Design and Digital Communication II: Research, Innovations and Best Practices, Nuno Martins, Daniel Brandão and Fernando Moreira da Silva (eds.). Springer International Publishing, Cham, 193–216. DOI:https://doi.org/10.1007/978-3-030-75867-7_13",
      "doi": ""
    },
    {
      "text": "Gerard Oleksik and Lorna M. Brown. 2008. Sonic gems: Exploring the potential of audio recording as a form of sentimental memory capture. In Proceedings of the 22nd British HCI Group Annual Conference on People and Computers: Culture, Creativity, Interaction, BCS HCI 2008, British Computer Society, 163–172. DOI:https://doi.org/10.14236/ewic/hci2008.16",
      "doi": ""
    },
    {
      "text": "Gerard Oleksik, David Frohlich, Lorna M. Brown, and Abigail Sellen. 2008. Sonic interventions: Understanding and extending the domestic soundscape. In Conference on Human Factors in Computing Systems - Proceedings, ACM Press, New York, New York, USA, 1419–1428. DOI:https://doi.org/10.1145/1357054.1357277",
      "doi": "10.1145/1357054.1357277"
    },
    {
      "text": "Hanna-Mari Pesonen, Anne M Remes, and Arja Isola. 2011. Ethical aspects of researching subjective experiences in early-stage dementia. Nurs. Ethics 18, 5 (2011), 651–661. DOI:https://doi.org/10.1177/0969733011408046",
      "doi": ""
    },
    {
      "text": "Michelle Putnam, Joseph G Pickard, Carroll Rodriguez, and Erin Shear. 2010. Stakeholder Perspectives on Policies to Support Family Caregivers of Older Adults With Dementia. J. Fam. Soc. Work 13, 2 (March 2010), 173–190. DOI:https://doi.org/10.1080/10522150903487479",
      "doi": ""
    },
    {
      "text": "Alfredo Raglio, Stefania Filippi, Daniele Bellandi, and Marco Stramba-Badiale. 2014. Global music approach to persons with dementia: evidence and practice. Clin. Interv. Aging 9, (2014), 1669–1676. DOI:https://doi.org/10.2147/CIA.S71388",
      "doi": ""
    },
    {
      "text": "Karlijn van Rijen, Tom Cobbenhagen, Rens Janssen, Maria Væver Olsen, Rens Brankaert, Maarten Houben, and Yuan Lu. 2020. RelivRing: Reliving Social Activities for People with Dementia. In Extended Abstracts of the 2020 CHI Conference on Human Factors in Computing Systems, ACM Press, New York, NY, USA, LBW045, 1–8. DOI:https://doi.org/10.1145/3334480.3383033",
      "doi": ""
    },
    {
      "text": "Paul A. Rodgers. 2018. Co-designing with people living with dementia. CoDesign 14, 3 (2018), 188–202. DOI:https://doi.org/10.1080/15710882.2017.1282527",
      "doi": ""
    },
    {
      "text": "Kasper Rodil, Chatrine Elisabeth Larsen, Christoffer Caesar Faelled, Emil Færch Skov, Thomas Gustafsen, Antonia Krummheuer, and Matthias Rehm. 2020. Spending Time: Co-Designing a Personalized Calendar at the Care Center. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society (NordiCHI ’20), Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3419249.3420144",
      "doi": "10.1145/3419249.3420144"
    },
    {
      "text": "Jim Rudd, Ken Stern, and Scott Isensee. 1996. Low vs. High-fidelity Prototyping Debate. interactions 3, 1 (June 1996), 76–85. DOI:https://doi.org/10.1145/223500.223514",
      "doi": ""
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2014. Probes, toolkits and prototypes: three approaches to making in codesigning. CoDesign 10, 1 (2014), 5–14. DOI:https://doi.org/10.1080/15710882.2014.888183",
      "doi": ""
    },
    {
      "text": "Corina Sas, Nigel Davies, Sarah Clinch, Peter Shaw, Mateusz Mikusz, Madeleine Steeds, and Lukas Nohrer. 2020. Supporting Stimulation Needs in Dementia Care through Wall-Sized Displays. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (CHI ’20), Association for Computing Machinery, New York, NY, USA, 1–16. DOI:https://doi.org/10.1145/3313831.3376361",
      "doi": "10.1145/3313831.3376361"
    },
    {
      "text": "Luma Tabbaa, Chee Siang Ang, Vienna Rose, Panote Siriaraya, Inga Stewart, Keith G. Jenkins, and Maria Matsangidou. 2019. Bring the Outside In: Providing Accessible Experiences Through VR for People with Dementia in Locked Psychiatric Hospitals. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19, ACM Press, New York, New York, USA, 1–15. DOI:https://doi.org/10.1145/3290605.3300466",
      "doi": "10.1145/3290605.3300466"
    },
    {
      "text": "Lisanne Teunissen, Tom Luyten, and Luc de Witte. 2017. Reconnecting People with Dementia by Using the Interactive Instrument CRDL. Stud. Health Technol. Inform. 242, (2017), 9–15.",
      "doi": ""
    },
    {
      "text": "Theresa Thoma-Lürken, Michel H C Bleijlevens, Monique A S Lexis, Luc P de Witte, and Jan P H Hamers. 2018. Facilitating aging in place: A qualitative study of practical problems preventing people with dementia from living at home. Geriatr. Nurs. (Minneap). 39, 1 (2018), 29–38. DOI: https://doi.org/10.1016/j.gerinurse.2017.05.003",
      "doi": ""
    },
    {
      "text": "Myrte Thoolen, Rens Brankaert, and Yuan Lu. 2020. AmbientEcho: Exploring Interactive Media Experiences in the Context of Residential Dementia Care. In Proceedings of the 2020 ACM Designing Interactive Systems Conference (DIS ’20), Association for Computing Machinery, New York, NY, USA, 1495–1508. DOI:https://doi.org/10.1145/3357236.3395432",
      "doi": "10.1145/3357236.3395432"
    },
    {
      "text": "Myrte Thoolen, Rens Brankaert, and Yuan Lu. 2020. Designing Sentic: Participatory Design with People Living with Dementia. In HCI and Design in the Context of Dementia, Rens Brankaert and Gail Kenning (eds.). Springer International Publishing, Cham, 269–288. DOI:https://doi.org/10.1007/978-3-030-32835-1_17",
      "doi": ""
    },
    {
      "text": "Peter Tolmie and Andy Crabtree. 2008. Deploying Research Technology in the Home. In Proceedings of the 2008 ACM Conference on Computer Supported Cooperative Work (CSCW ’08), Association for Computing Machinery, New York, NY, USA, 639–648. DOI:https://doi.org/10.1145/1460563.1460662",
      "doi": "10.1145/1460563.1460662"
    },
    {
      "text": "David Unbehaun, Sebastian Taugerbeck, Konstantin Aal, Daryoush Daniel Vaziri, Jasmin Lehmann, Peter Tolmie, Rainer Wieching, and Volker Wulf. 2020. Notes of memories: Fostering social interaction, activity and reminiscence through an interactive music exergame developed for people with dementia and their caregivers. Human–Computer Interact. (June 2020), 1–34. DOI:https://doi.org/10.1080/07370024.2020.1746910",
      "doi": ""
    },
    {
      "text": "Jayne Wallace, Peter C. Wright, John McCarthy, David Philip Green, James Thomas, and Patrick Olivier. 2013. A design-led inquiry into personhood in dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems - CHI ’13, ACM Press, New York, New York, USA, 2617–2626. DOI:https://doi.org/10.1145/2470654.2481363",
      "doi": "10.1145/2470654.2481363"
    },
    {
      "text": "Lin Wan, Claudia Müller, Volker Wulf, and David Randall. 2014. Addressing the subtleties in dementia care: Pre-study & evaluation of a GPS monitoring system. In Conference on Human Factors in Computing Systems - Proceedings, ACM Press, New York, New York, USA, 3987–3996. DOI:https://doi.org/10.1145/2556288.2557307",
      "doi": "10.1145/2556288.2557307"
    },
    {
      "text": "Rik Wesselink, Marike Hettinga, Geke Ludden, and Berry Eggen. 2020. Unforgetting Music: Exploring the role of music in the daily lives of people with dementia living at home. In Proceedings of the 6th International Conference on Design4Health, Lab4Living, Sheffield Hallam University, Amsterdam, 721–728.",
      "doi": ""
    },
    {
      "text": "Marjolein Wintermans, Rens Brankaert, and Yuan Lu. 2017. Together we do not forget: Co-designing with people living with dementia towards a design for social inclusion. Des. Manag. Acad. 2017 (2017).",
      "doi": ""
    },
    {
      "text": "Dennis Wolf, Daniel Besserer, Karolina Sejunaite, Matthias Riepe, and Enrico Rukzio. 2018. CARe: An Augmented Reality Support System for Dementia Patients. In The 31st Annual ACM Symposium on User Interface Software and Technology Adjunct Proceedings (UIST ’18 Adjunct), Association for Computing Machinery, New York, NY, USA, 42–44. DOI:https://doi.org/10.1145/3266037.3266095",
      "doi": ""
    },
    {
      "text": "Tamara Zubatiy, Kayci L Vickers, Niharika Mathur, and Elizabeth D Mynatt. 2021. Empowering Dyads of Older Adults With Mild Cognitive Impairment And Their Care Partners Using Conversational Agents. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA. DOI:https://doi.org/10.1145/3411764.3445124",
      "doi": "10.1145/3411764.3445124"
    },
    {
      "text": "2017. Global action plan on the public health response to dementia 2017- 2025. World Health Organization, Geneva.",
      "doi": ""
    }
  ]
}