{
  "doi": "10.1145/3491102.3517704",
  "title": "XR-OOM: MiXed Reality driving simulation with real cars for research and design",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-13",
  "year": 2022,
  "badges": [],
  "abstract": "High-fidelity driving simulators can act as testbeds for designing in-vehicle interfaces or validating the safety of novel driver assistance features. In this system paper, we develop and validate the safety of a mixed reality driving simulator system that enables us to superimpose virtual objects and events into the view of participants engaging in real-world driving in unmodified vehicles. To this end, we have validated the mixed reality system for basic driver cockpit and low-speed driving tasks, comparing the use of the system with non-headset and with the headset driving conditions, to ensure that participants behave and perform similarly using this system as they would otherwise. This paper outlines the operational procedures and protocols for using such systems for cockpit tasks (like using the parking brake, reading the instrument panel, and turn signaling) as well as basic low-speed driving exercises (such as steering around corners, weaving around obstacles, and stopping at a fixed line) in ways that are safe, effective, and lead to accurate, repeatable data collection about behavioral responses in real-world driving tasks.",
  "authors": [
    {
      "name": "David Goedicke",
      "institution": "Information Science, Cornell Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659261564",
      "orcid": "missing"
    },
    {
      "name": "Alexandra W.D. Bremers",
      "institution": "Information Science, Cornell Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659686517",
      "orcid": "missing"
    },
    {
      "name": "Sam Lee",
      "institution": "Cornell Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238471",
      "orcid": "missing"
    },
    {
      "name": "Fanjun Bu",
      "institution": "Information Science, Cornell Tech, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233897",
      "orcid": "missing"
    },
    {
      "name": "Hiroshi Yasuda",
      "institution": "Toyota Research Institute, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557485556",
      "orcid": "0000-0003-2708-8623"
    },
    {
      "name": "Wendy Ju",
      "institution": "Information Science, Cornell Tech, United States",
      "img": "/do/10.1145/contrib-81100098733/rel-imgonly/wendy_headshot.jpg",
      "acmid": "81100098733",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Talal Al-Shihabi and Ronald R Mourant. 2003. Toward more realistic driving behavior models for autonomous vehicles in driving simulators. Transportation Research Record 1843, 1 (2003), 41–49.",
      "doi": ""
    },
    {
      "text": "R Wade Allen, Theodore J Rosenthal, and Marcia L Cook. 2011. A short history of driving simulation. CRC press, Boca Raton, Chapter 2, 2–1 to 2–16.",
      "doi": ""
    },
    {
      "text": "Ignacio Alvarez, Laura Rumbel, and Robert Adams. 2015. Skyline: a rapid prototyping driving simulator for user experience. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 101–108.",
      "doi": "10.1145/2799250.2799290"
    },
    {
      "text": "Kaarin J. Anstey, Joanne Wood, Stephen Lord, and Janine G. Walker. 2005. Cognitive, sensory and physical factors enabling driving safety in older adults. Clinical Psychology Review 25, 1 (2005), 45 – 65. https://doi.org/10.1016/j.cpr.2004.07.008",
      "doi": ""
    },
    {
      "text": "Sonia Baltodano, Srinath Sibi, Nikolas Martelaro, Nikhil Gowda, and Wendy Ju. 2015. The RRADS Platform: A Real Road Autonomous Driving Simulator. In Proceedings of the 7th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Nottingham, United Kingdom) (AutomotiveUI ’15). Association for Computing Machinery, New York, NY, USA, 281–288. https://doi.org/10.1145/2799250.2799288",
      "doi": "10.1145/2799250.2799288"
    },
    {
      "text": "Alexandra W.D. Bremers, Ali Özgür Yöntem, Kun Li, Daping Chu, Valerian Meijering, and Christian P. Janssen. 2021. Perception of perspective in augmented reality head-up displays. International Journal of Human-Computer Studies 155 (2021), 102693. https://doi.org/10.1016/j.ijhcs.2021.102693",
      "doi": "10.1016/j.ijhcs.2021.102693"
    },
    {
      "text": "Heiner Bubb, Klaus Bengler, Rainer E. Grünen, and Mark Vollrath. 2015. Automobilergonomie. Springer Fachmedien Wiesbaden, Wiesbaden.",
      "doi": ""
    },
    {
      "text": "GE Burnett, A Irune, and A Mowforth. 2007. Driving simulator sickness and validity: How important is it to use real car cabins. Advances in transportation studies 13 (2007), 33–42.",
      "doi": ""
    },
    {
      "text": "Volvo Cars. 2019. Volvo Cars & Varjo – Design and safety development in mixed reality. [YouTube video]. Retrieved January 8, 2022 from https://www.youtube.com/watch?v=tCv0hJGBo_I",
      "doi": ""
    },
    {
      "text": "Mark Claypool and Kajal Claypool. 2006. Latency and Player Actions in Online Games. Commun. ACM 49, 11 (Nov. 2006), 40–45. https://doi.org/10.1145/1167838.1167860",
      "doi": "10.1145/1167838.1167860"
    },
    {
      "text": "State Farm Mutual Automobile Insurance Company. unknown date. Teen driving 101: a step-by-step test of essential driving skills. State Farm Mutual Automobile Insurance Company. Retrieved January 10, 2022 from https://www.statefarm.com/simple-insights/auto-and-vehicles/teen-driving-101-a-stepbystep-test-of-essential-skills",
      "doi": ""
    },
    {
      "text": "Eduardo Cuervo, Krishna Chintalapudi, and Manikanta Kotaru. 2018. Creating the Perfect Illusion: What Will It Take to Create Life-Like Virtual Reality Headsets?. In Proceedings of the 19th International Workshop on Mobile Computing Systems & Applications (Tempe, Arizona, USA) (HotMobile ’18). Association for Computing Machinery, New York, NY, USA, 7–12. https://doi.org/10.1145/3177102.3177115",
      "doi": "10.1145/3177102.3177115"
    },
    {
      "text": "Forward Development. 2017. City Car Driving [PC Game]. Version 1.5. http://www.citycardriving.com/",
      "doi": ""
    },
    {
      "text": "Tilman Dingler, Kai Kunze, and Benjamin Outram. 2018. VR Reading UIs: Assessing Text Parameters for Reading in VR. In Extended Abstracts of the 2018 CHI Conference on Human Factors in Computing Systems (Montreal QC, Canada) (CHI EA ’18). Association for Computing Machinery, New York, NY, USA, 1–6. https://doi.org/10.1145/3170427.3188695",
      "doi": "10.1145/3170427.3188695"
    },
    {
      "text": "Donald L Fisher, Jeff K Caird, Matthew Rizzo, and John D Lee. 2011. Handbook of driving simulation for engineering, medicine and psychology: an overview. Handbook of driving simulation for engineering, medicine, and psychology (2011), 1–1 to 1–14.",
      "doi": ""
    },
    {
      "text": "Frank Flemisch, Matthias Heesen, Tobias Hesse, Johann Kelsch, Anna Schieben, and Johannes Beller. 2012. Towards a dynamic balance between humans and automation: authority, ability, responsibility and control in shared and cooperative control situations. Cognition, Technology & Work 14, 1 (2012), 3–18.",
      "doi": "10.1007/s10111-011-0191-6"
    },
    {
      "text": "G Geiser. 1985. Man-machine communication in motor vehicles.",
      "doi": ""
    },
    {
      "text": "Florin-Timotei Ghiurãu, Mehmet Aydın Baytaş, and Casper Wickman. 2020. ARCAR: On-Road Driving in Mixed Reality by Volvo Cars. In Adjunct Publication of the 33rd Annual ACM Symposium on User Interface Software and Technology. Association for Computing Machinery, 62–64.",
      "doi": "10.1145/3379350.3416186"
    },
    {
      "text": "David Goedicke, Jamy Li, Vanessa Evers, and Wendy Ju. 2018. VR-OOM: Virtual Reality On-ROad Driving SiMulation. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3173739",
      "doi": ""
    },
    {
      "text": "David Goedicke, Jamy Li, Vanessa Evers, and Wendy Ju. 2018. VR-OOM: Virtual Reality On-ROad Driving SiMulation. Association for Computing Machinery, New York, NY, USA, 1–11. https://doi.org/10.1145/3173574.3173739",
      "doi": ""
    },
    {
      "text": "Christian Gold, Lutz Lorenz, Daniel Damböck, and Klaus Bengler. 2013. Partially automated driving as a fallback level of high automation. Tagung Fahrerassistenzsysteme. Der Weg zum automatischen Fahren 28, 29.11(2013), 2013.",
      "doi": ""
    },
    {
      "text": "Lauren Goode. 2019. Get Ready to Hear a Lot More About ’XR’. Retrieved January 8, 2022 from https://www.wired.com/story/what-is-xr/",
      "doi": ""
    },
    {
      "text": "Peter Grant, Bruce Artz, Jeff Greenberg, and Larry Cathey. 2001. Motion characteristics of the VIRTTEX motion system. In Proceedings of the 1st human-centered transportation simulation conference. 4–7.",
      "doi": ""
    },
    {
      "text": "Jeffry Allen Greenberg and Mike Blommer. 2011. Physical fidelity of driving simulators. CRC press, Boca Raton, 7–1 to 7–24.",
      "doi": ""
    },
    {
      "text": "Cameron Grout, William Rogers, Mark Apperley, and Steve Jones. 2015. Reading Text in an Immersive Head-Mounted Display: An Investigation into Displaying Desktop Interfaces in a 3D Virtual Environment. In Proceedings of the 15th New Zealand Conference on Human-Computer Interaction (Hamilton, New Zealand) (CHINZ 2015). Association for Computing Machinery, New York, NY, USA, 9–16. https://doi.org/10.1145/2808047.2808055",
      "doi": "10.1145/2808047.2808055"
    },
    {
      "text": "Peter A Hancock and Thomas B Sheridan. 2011. The future of driving simulation. CRC press, Boca Raton, 4–1 to 4–11.",
      "doi": ""
    },
    {
      "text": "Rebecca L Hartman and Marilyn A Huestis. 2013. Cannabis effects on driving skills. Clinical chemistry 59, 3 (2013), 478–492.",
      "doi": ""
    },
    {
      "text": "Philipp Hock, Johannes Kraus, Franziska Babel, Marcel Walch, Enrico Rukzio, and Martin Baumann. 2018. How to design valid simulator studies for investigating user experience in automated driving: review and hands-on considerations. In Proceedings of the 10th International Conference on Automotive User Interfaces and Interactive Vehicular Applications. Association for Computing Machinery, 105–117.",
      "doi": "10.1145/3239060.3239066"
    },
    {
      "text": "F. Hu, Y. Deng, W. Saad, M. Bennis, and A. H. Aghvami. 2020. Cellular-Connected Wireless Virtual Reality: Requirements, Challenges, and Solutions. IEEE Communications Magazine 58, 5 (2020), 105–111.",
      "doi": "10.1109/MCOM.001.1900511"
    },
    {
      "text": "Karl Iagnemma. 2019. Supervisory control of vehicles. US Patent 10,303,166.",
      "doi": ""
    },
    {
      "text": "Quinate Chioma Ihemedu-Steinke, Stanislava Rangelova, Michael Weber, Rainer Erbach, Gerrit Meixner, and Nicola Marsden. 2017. Simulation sickness related to virtual reality driving simulation. In International Conference on Virtual, Augmented and Mixed Reality. Springer, Springer International Publishing, 521–532.",
      "doi": ""
    },
    {
      "text": "Robert JK Jacob, Audrey Girouard, Leanne M Hirshfield, Michael S Horn, Orit Shaer, Erin Treacy Solovey, and Jamie Zigelbaum. 2008. Reality-based interaction: a framework for post-WIMP interfaces. In Proceedings of the SIGCHI conference on Human factors in computing systems. ACM, 201–210.",
      "doi": "10.1145/1357054.1357089"
    },
    {
      "text": "Robert S Kennedy, Norman E Lane, Kevin S Berbaum, and Michael G Lilienthal. 1993. Simulator sickness questionnaire: An enhanced method for quantifying simulator sickness. The international journal of aviation psychology 3, 3 (1993), 203–220.",
      "doi": ""
    },
    {
      "text": "Dagmar Kern and Albrecht Schmidt. 2009. Design Space for Driver-Based Automotive User Interfaces. In Proceedings of the 1st International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Essen, Germany) (AutomotiveUI ’09). Association for Computing Machinery, New York, NY, USA, 3–10. https://doi.org/10.1145/1620509.1620511",
      "doi": "10.1145/1620509.1620511"
    },
    {
      "text": "Esko Keskinen, Mika Hatakka, Sirkku Laapotti, Ari Katila, and M Peräaho. 2004. Driver behaviour as a hierarchical system. Traffic and Transport Psychology(2004), 9–29.",
      "doi": ""
    },
    {
      "text": "Advanced Realtime Tracking GmbH & Co. KG. 2019. SmartTrack3. Advanced Realtime Tracking GmbH & Co. KG. Retrieved January 8, 2022 from https://ar-tracking.com/products/tracking-systems/smarttrack3/",
      "doi": ""
    },
    {
      "text": "Eunjee Kim and Gwanseob Shin. 2020. User discomfort while using a virtual reality headset as a personal viewing system for text-intensive office tasks. Ergonomics 64, 7 (2020), 1–9.",
      "doi": ""
    },
    {
      "text": "Lars Knaack, Ann-Karolin Lache, Oliver Preikszas, Sascha Reinhold, and Michael Teistler. 2019. Improving Readability of Text in Realistic Virtual Reality Scenarios: Visual Magnification Without Restricting User Interactions. In Proceedings of Mensch Und Computer 2019 (Hamburg, Germany) (MuC’19). Association for Computing Machinery, New York, NY, USA, 749–753. https://doi.org/10.1145/3340764.3344902",
      "doi": "10.1145/3340764.3344902"
    },
    {
      "text": "Kenji Koide, Jun Miura, and Emanuele Menegatti. 2019. A portable three-dimensional LIDAR-based system for long-term and wide-area people behavior measurement. International Journal of Advanced Robotic Systems 16 (02 2019). https://doi.org/10.1177/1729881419841532",
      "doi": ""
    },
    {
      "text": "Ruilin Liu, Daehan Kwak, Srinivas Devarakonda, Kostas Bekris, and Liviu Iftode. 2017. Investigating Remote Driving over the LTE Network. In Proceedings of the 9th International Conference on Automotive User Interfaces and Interactive Vehicular Applications(Oldenburg, Germany) (AutomotiveUI ’17). Association for Computing Machinery, New York, NY, USA, 264–269. https://doi.org/10.1145/3122986.3123008",
      "doi": "10.1145/3122986.3123008"
    },
    {
      "text": "Katerina Mania, Bernard D. Adelstein, Stephen R. Ellis, and Michael I. Hill. 2004. Perceptual Sensitivity to Head Tracking Latency in Virtual Environments with Varying Degrees of Scene Complexity. In Proceedings of the 1st Symposium on Applied Perception in Graphics and Visualization (Los Angeles, California, USA) (APGV ’04). Association for Computing Machinery, New York, NY, USA, 39–47. https://doi.org/10.1145/1012551.1012559",
      "doi": "10.1145/1012551.1012559"
    },
    {
      "text": "A James McKnight and Bert B Adams. 1970. Driver Education Task Analysis. Volume I: Task Descriptions. Final Report (August 1969-July 1970).(1970).",
      "doi": ""
    },
    {
      "text": "Natasha Merat, A Hamish Jamson, Frank CH Lai, Michael Daly, and Oliver MJ Carsten. 2014. Transition to manual: Driver behaviour when resuming control from a highly automated vehicle. Transportation research part F: traffic psychology and behaviour 27 (2014), 274–282.",
      "doi": ""
    },
    {
      "text": "John A. Michon. 1985. A Critical View of Driver Behavior Models: What Do We Know, What Should We Do?Springer US, Boston, MA, 485–524. https://doi.org/10.1007/978-1-4613-2173-6_19",
      "doi": ""
    },
    {
      "text": "Evan Miller, Bee Hanson, Diana Hanson, and Yashar Bahman. 2021. Moving Platform Mode on Low Dynamic Motion Moving Platforms. Microsoft. Retrieved January 8, 2022 from https://docs.microsoft.com/en-us/hololens/hololens2-moving-platform",
      "doi": ""
    },
    {
      "text": "Brian Ka-Jun Mok, David Sirkin, Srinath Sibi, David Bryan Miller, and Wendy Ju. 2015. Understanding driver-automated vehicle interactions through Wizard of Oz design improvisation. In Proceedings of the International Driving Symposium on Human Factors in Driver Assessment, Training and Vehicle Design. 386–392.",
      "doi": ""
    },
    {
      "text": "Takahiko Murano, Takashi Yonekawa, Masami Aga, and Sueharu Nagiri. 2009. Development of high-performance driving simulator. SAE International Journal of Passenger Cars-Mechanical Systems 2, 2009-01-0450(2009), 661–669.",
      "doi": ""
    },
    {
      "text": "Frederik Naujoks, Sebastian Hergeth, Katharina Wiedemann, Nadja Schömig, Yannick Forster, and Andreas Keinath. 2019. Test procedure for evaluating the human–machine interface of vehicles with automated driving systems. Traffic injury prevention 20, sup1 (2019), S146–S151.",
      "doi": ""
    },
    {
      "text": "Stefan Neumeier, Nicolas Gay, Clemens Dannheim, and Christian Facchi. 2018. On the way to autonomous vehicles teleoperated driving. In AmE 2018-Automotive meets Electronics; 9th GMM-Symposium. VDE, VDE, 1–6.",
      "doi": ""
    },
    {
      "text": "Stefan Neumeier, Philipp Wintersberger, Anna-Katharina Frison, Armin Becher, Christian Facchi, and Andreas Riener. 2019. Teleoperation: The Holy Grail to Solve Problems of Automated Driving? Sure, but Latency Matters. In Proceedings of the 11th International Conference on Automotive User Interfaces and Interactive Vehicular Applications (Utrecht, Netherlands) (AutomotiveUI ’19). Association for Computing Machinery, New York, NY, USA, 186–197. https://doi.org/10.1145/3342197.3344534",
      "doi": "10.1145/3342197.3344534"
    },
    {
      "text": "Cynthia Owsley and Gerald McGwin Jr. 1999. Vision impairment and driving. Survey of ophthalmology 43, 6 (1999), 535–550.",
      "doi": ""
    },
    {
      "text": "Lothar Pantel and Lars C. Wolf. 2002. On the Impact of Delay on Real-Time Multiplayer Games. In Proceedings of the 12th International Workshop on Network and Operating Systems Support for Digital Audio and Video (Miami, Florida, USA) (NOSSDAV ’02). Association for Computing Machinery, New York, NY, USA, 23–29. https://doi.org/10.1145/507670.507674",
      "doi": "10.1145/507670.507674"
    },
    {
      "text": "Pablo E Paredes, Stephanie Balters, Kyle Qian, Elizabeth L Murnane, Francisco Ordóñez, Wendy Ju, and James A Landay. 2018. Driving with the fishes: Towards calming and mindful virtual reality experiences for the car. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–21.",
      "doi": "10.1145/3287062"
    },
    {
      "text": "Klaus Petersen. 2021. AR HMD for In-Car applications - LPVIZ (part 1) - LP-RESEARCH. Retrieved January 8, 2022 from https://lp-research.com/ar-hmd-for-in-car-applications/",
      "doi": ""
    },
    {
      "text": "Gill Pratt. 2017. Self-Driving Cars: Road to Deployment. Toyota Research Institute. Retrieved January 8, 2022 from https://energycommerce.house.gov/sites/democrats.energycommerce.house.gov/files/Testimony-Pratt-DCCP-Hrg-Self-Driving-Cars-2017-02-14.pdf",
      "doi": ""
    },
    {
      "text": "Morgan Quigley, Ken Conley, Brian Gerkey, Josh Faust, Tully Foote, Jeremy Leibs, Rob Wheeler, Andrew Y Ng, 2009. ROS: an open-source Robot Operating System. In ICRA workshop on open source software. Kobe, Japan, 5.",
      "doi": ""
    },
    {
      "text": "J. Rasmussen. 1983. Skills, rules, and knowledge; signals, signs, and symbols, and other distinctions in human performance models. IEEE Transactions on Systems, Man, and Cybernetics SMC-13, 3(1983), 257–266.",
      "doi": ""
    },
    {
      "text": "Volvo Cars (Press Release). 2019. Using augmented and virtual reality for the best volvo cars possible. https://group.volvocars.com/news/future-mobility/2019/varjo-collaboration",
      "doi": ""
    },
    {
      "text": "Anna Schieben, Matthias Heesen, Julian Schindler, Johann Kelsch, and Frank Flemisch. 2009. The theater-system technique: Agile designing and testing of system behavior and interaction, applied to highly automated vehicles. In Proceedings of the 1st International Conference on Automotive User Interfaces and Interactive Vehicular Applications. ACM, 43–46.",
      "doi": "10.1145/1620509.1620517"
    },
    {
      "text": "Joseph Smyth, Jonathan Robinson, Rebecca Burridge, Paul Jennings, and Roger Woodman. 2021. Towards the Management and Mitigation of Motion Sickness–An Update to the Field. In Congress of the International Ergonomics Association. Springer, Springer International Publishing, 834–840.",
      "doi": ""
    },
    {
      "text": "Inc. StereoLabs. 2019. Meet ZED 2. StereoLabs, Inc. Retrieved January 8, 2022 from https://www.stereolabs.com/zed-2/",
      "doi": ""
    },
    {
      "text": "M. Tonnis, V. Broy, and G. Klinker. 2006. A Survey of Challenges Related to the Design of 3D User Interfaces for Car Drivers. In 3D User Interfaces (3DUI’06). IEEE Computer Society, 127–134. https://doi.org/10.1109/VR.2006.19",
      "doi": ""
    },
    {
      "text": "Jan BF Van Erp and Pieter Padmos. 2003. Image parameters for driving with indirect viewing systems. Ergonomics 46, 15 (2003), 1471–1499.",
      "doi": ""
    },
    {
      "text": "Volvo. 2019. AWE USA 2019 - Exhibitor, Varjo Technologies. https://www.awexr.com/usa-2019/exhibitor/2722-varjo-technologies",
      "doi": ""
    },
    {
      "text": "Peter Wang, Srinath Sibi, Brian Mok, and Wendy Ju. 2017. Marionette: Enabling On-Road Wizard-of-Oz Autonomous Driving Studies. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction. ACM, 234–243.",
      "doi": "10.1145/2909824.3020256"
    },
    {
      "text": "Yan Yan, Ke Chen, Yu Xie, Yiming Song, and Yonghong Liu. 2018. The effects of weight on comfort of virtual reality devices. In International Conference on Applied Human Factors and Ergonomics. Springer, Springer International Publishing, 239–248.",
      "doi": ""
    },
    {
      "text": "Dohyeon Yeo, Gwangbin Kim, and SeungJun Kim. 2019. MAXIM: Mixed-reality Automotive Driving XIMulation. In 2019 IEEE International Symposium on Mixed and Augmented Reality Adjunct (ISMAR-Adjunct). IEEE, 460–464. https://doi.org/10.1109/ISMAR-Adjunct.2019.00124",
      "doi": ""
    }
  ]
}