{
  "doi": "10.1145/3491102.3502029",
  "title": "Diffraction-in-action: Designerly Explorations of Agential Realism Through Lived Data",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Recent design research has shown an interest in diffraction and agential realism, which promise to offer generative alternatives when designing with data that resist treating data as objective or neutral. We explore engaging diffractively with ‘lived data’ to surface felt and prospective aspects of data as it is entangled in everyday lives of designers. This paper presents five biodata-based case studies demonstrating how design researchers can create knowledge about human bodies and behaviors via strategies that allow them to engage data diffractively. These studies suggest that designers can find insights for designing with data as it is lived by working with it in a slow, open-ended fashion that leaves room for messiness and time for discovering difference. Finally, we discuss the role of ambiguous, open-ended data interpretations to help surface different meanings and entanglements of data in everyday lives.",
  "tags": [
    "material",
    "design",
    "design research",
    "Biodata",
    "collaboration",
    "being-with",
    "empathy",
    "data",
    "bodies",
    "more-than-human"
  ],
  "authors": [
    {
      "name": "Pedro Sanches",
      "institution": "ITI/Larsys, Portugal and Department of Informatics, Umeå University, Sweden",
      "img": "/do/10.1145/contrib-81384620808/rel-imgonly/pedro_cropped.png",
      "acmid": "81384620808",
      "orcid": "0000-0001-5620-6305"
    },
    {
      "name": "Noura Howell",
      "institution": "Digital Media, Georgia Institute of Technology, United States",
      "img": "/do/10.1145/contrib-81554353756/rel-imgonly/img_8543_crop-square_web_smaller.jpg",
      "acmid": "81554353756",
      "orcid": "missing"
    },
    {
      "name": "Vasiliki Tsaknaki",
      "institution": "Digital Design, IT University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-87358710757/rel-imgonly/vasiliki.jpeg",
      "acmid": "87358710757",
      "orcid": "0000-0003-2235-6078"
    },
    {
      "name": "Tom Jenkins",
      "institution": "IxD Lab, IT University of Copenhagen, Denmark",
      "img": "/do/10.1145/contrib-81554259456/rel-imgonly/tomj_big.jpg",
      "acmid": "81554259456",
      "orcid": "0000-0001-6135-410X"
    },
    {
      "name": "Karey Helms",
      "institution": "KTH Royal Institute of Technology, Sweden",
      "img": "/do/10.1145/contrib-99659179575/rel-imgonly/karey_helms_1000x1000.jpg",
      "acmid": "99659179575",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Miquel Alfaras, Vasiliki Tsaknaki, Pedro Sanches, Charles Windlin, Muhammad Umair, Corina Sas, and Kristina Höök. 2020. From Biodata to Somadata. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376684"
    },
    {
      "text": "Ali Alkhatib. 2021. To Live in Their Utopia: Why Algorithmic Systems Create Absurd Outcomes. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–9. https://doi.org/10.1145/3411764.3445740",
      "doi": "10.1145/3411764.3445740"
    },
    {
      "text": "Adriana Alvarado Garcia, Alyson L. Young, and Lynn Dombrowski. 2017. On Making Data Actionable: How Activists Use Imperfect Data to Foster Social Change for Human Rights Violations in Mexico. Proceedings of the ACM on Human-Computer Interaction 1, CSCW (Dec. 2017), 19:1–19:19. https://doi.org/10.1145/3134654",
      "doi": "10.1145/3134654"
    },
    {
      "text": "Saleema Amershi, Maya Cakmak, William Bradley Knox, and Todd Kulesza. 2014. Power to the People: The Role of Humans in Interactive Machine Learning. AI Magazine 35, 4 (Dec. 2014), 105. https://doi.org/10.1609/aimag.v35i4.2513",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2003. Posthumanist Performativity: Toward an Understanding of How Matter Comes to Matter. Signs 28, 3 (2003), 801–831. https://doi.org/10.1086/345321 baradPosthumanistPerformativityUnderstanding2003.",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2007. Meeting the Universe Halfway. In Meeting the Universe Halfway. Duke University Press.",
      "doi": ""
    },
    {
      "text": "Karen Barad. 2014. Diffracting Diffraction: Cutting Together-Apart. Parallax 20, 3 (July 2014), 168–187. https://doi.org/10.1080/13534645.2014.927623",
      "doi": ""
    },
    {
      "text": "Jordi Solsona Belenguer, Marcus Lundén, Jarmo Laaksolhati, and Petra Sundström. 2012. Immaterial Materials: Designing with Radio. In Proceedings of the Sixth International Conference on Tangible, Embedded and Embodied Interaction(TEI ’12). ACM, New York, NY, USA, 205–212. https://doi.org/10.1145/2148131.2148177",
      "doi": "10.1145/2148131.2148177"
    },
    {
      "text": "Jesse Josua Benjamin, Arne Berger, Nick Merrill, and James Pierce. 2021. Machine Learning Uncertainty as a Design Material: A Post-Phenomenological Inquiry. arXiv preprint arXiv:2101.04035(2021). arxiv:2101.04035",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner. 2009. Reflections on representation as response. interactions 16, 6 (Nov. 2009), 28. https://doi.org/10.1145/1620693.1620700",
      "doi": ""
    },
    {
      "text": "Kirsten Boehner, Rogério DePaula, Paul Dourish, and Phoebe Sengers. 2005. Affect: from information to interaction. In Proceedings of the 4th decennial conference on Critical computing: between sense and sensibility (CC’05). ACM Press, 59–68. https://doi.org/10.1145/1094562.1094570",
      "doi": "10.1145/1094562.1094570"
    },
    {
      "text": "Kirsten Boehner, Rogério DePaula, Paul Dourish, and Phoebe Sengers. 2007. How emotion is made and measured. International Journal of Human-Computer Studies 65, 4 (April 2007), 275–291. https://doi.org/10.1016/j.ijhcs.2006.11.016",
      "doi": "10.1016/j.ijhcs.2006.11.016"
    },
    {
      "text": "Sander Bogers, Joep Frens, Janne van Kollenburg, Eva Deckers, and Caroline Hummels. 2016. Connected Baby Bottle: A Design Case Study Towards a Framework for Data-Enabled Design. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems(DIS ’16). ACM, New York, NY, USA, 301–311. https://doi.org/10.1145/2901790.2901855",
      "doi": "10.1145/2901790.2901855"
    },
    {
      "text": "Sander Bogers, Janne van Kollenburg, Joep Frens, and Tom Djajadiningrat. 2016. Data-Enabled-Design: A Situated Exploration of Rich Interactions. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems. Association for Computing Machinery, New York, NY, USA, 45–48.",
      "doi": "10.1145/2908805.2913015"
    },
    {
      "text": "Magnus Boman and Pedro Sanches. 2015. Sensemaking in Intelligent Health Data Analytics. KI-Künstliche Intelligenz 29, 2 (2015), 143–152.",
      "doi": ""
    },
    {
      "text": "Jacky Bourgeois, Songshan Liu, Gerd Kortuem, and Derek Lomas. 2018. Towards a Domain-Specific Design Platform for Wheelchair User Well-Being. In Proceedings of the 2018 ACM International Joint Conference and 2018 International Symposium on Pervasive and Ubiquitous Computing and Wearable Computers(UbiComp ’18). Association for Computing Machinery, New York, NY, USA, 762–765. https://doi.org/10.1145/3267305.3267709",
      "doi": "10.1145/3267305.3267709"
    },
    {
      "text": "John Bowers, Simon Bowen, and Tim Shaw. 2016. Many makings: Entangling publics, participation and things in a complex collaborative context. In Proceedings of the 2016 ACM Conference on Designing Interactive Systems. 1246–1257.",
      "doi": "10.1145/2901790.2901883"
    },
    {
      "text": "Pam Briggs, Claire Hardy, Peter R. Harris, and Elizabeth Sillence. 2014. Patient-Led Perspectives on Ehealth: How Might Hyperpersonal Data Inform Design?. In Proceedings of HCI Korea(HCIK ’15). Hanbit Media, Inc., South Korea, 115–121.",
      "doi": ""
    },
    {
      "text": "Danilo Bzdok, Naomi Altman, and Martin Krzywinski. 2018. Points of Significance: Statistics versus Machine Learning. Nature Publishing Group.",
      "doi": ""
    },
    {
      "text": "Baki Cakici and Pedro Sanches. 2014. Detecting the Visible: The Discursive Construction of Health Threats in a Syndromic Surveillance System Design. Societies 4, 3 (July 2014), 399–413. https://doi.org/10.3390/soc4030399",
      "doi": ""
    },
    {
      "text": "Elizabeth F Churchill. 2020. Reflecting on AI activism. Interactions 28, 1 (2020), 26–27.",
      "doi": "10.1145/3441563"
    },
    {
      "text": "Rob Comber, Airi Lampinen, and Jesse Haapoja. 2019. Towards Post-Interaction Computing: Addressing Immediacy, (Un)Intentionality, Instability and Interaction Effects. In Proceedings of the Halfway to the Future Symposium 2019. ACM, Nottingham United Kingdom, 1–8. https://doi.org/10.1145/3363384.3363477",
      "doi": "10.1145/3363384.3363477"
    },
    {
      "text": "Kelsey Cotton, Pedro Sanches, Vasiliki Tsaknaki, and Pavel Karpashevich. 2021. The Body Electric: A NIME Designed through and with the Somatic Experience of Singing. International Conference on New Interfaces for Musical Expression (2021).",
      "doi": ""
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing Tensions in Autobiographical Design in HCI. In Proceedings of the 2018 Designing Interactive Systems Conference (Hong Kong, China) (DIS ’18). Association for Computing Machinery, New York, NY, USA, 753–764. https://doi.org/10.1145/3196709.3196781",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "Laura Devendorf, Kristina Andersen, and Aisling Kelliher. 2020. Making Design Memoirs: Understanding and Honoring Difficult Experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems(CHI ’20). Association for Computing Machinery, Honolulu, HI, USA, 1–12. https://doi.org/10.1145/3313831.3376345",
      "doi": "10.1145/3313831.3376345"
    },
    {
      "text": "Catherine D’Ignazio and Lauren F. Klein. 2020. Introduction: Why Data Science Needs Feminism. In Data feminism. The MIT Press, Cambridge, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Paul Dourish. 2004. What we talk about when we talk about context. Personal and Ubiquitous Computing 8, 1 (Feb. 2004), 19–30. https://doi.org/10.1007/s00779-003-0253-8",
      "doi": "10.1007/s00779-003-0253-8"
    },
    {
      "text": "Paul Dourish. 2017. The Stuff of Bits: An Essay on the Materialities of Information. MIT Press.",
      "doi": "10.5555/3159007"
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX design innovation: Challenges for working with machine learning as a design material. In Proceedings of the 2017 chi conference on human factors in computing systems. 278–288.",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "Chris Elsden, David Chatting, Abigail C Durrant, Andrew Garbett, Bettina Nissen, John Vines, and David S Kirk. 2017. On speculative enactments. In Proceedings of the 2017 CHI conference on human factors in computing systems. 5386–5399.",
      "doi": "10.1145/3025453.3025503"
    },
    {
      "text": "Chris Elsden, David Kirk, Mark Selby, and Chris Speed. 2015. Beyond Personal Informatics: Designing for Experiences with Data. In Proceedings of the 33rd Annual ACM Conference Extended Abstracts on Human Factors in Computing Systems(CHI EA ’15). Association for Computing Machinery, New York, NY, USA, 2341–2344. https://doi.org/10.1145/2702613.2702632",
      "doi": "10.1145/2702613.2702632"
    },
    {
      "text": "Chris Elsden, Bettina Nissen, Andrew Garbett, David Chatting, David Kirk, and John Vines. 2016. Metadating: Exploring the Romance and Future of Personal Data. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 685–698.",
      "doi": "10.1145/2858036.2858173"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proceedings of the 2015 ACM International Joint Conference on Pervasive and Ubiquitous Computing(UbiComp ’15). ACM, New York, NY, USA, 731–742. https://doi.org/10.1145/2750858.2804250 event-place: Osaka, Japan.",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Sara Eriksson, Kristina Höök, Richard Shusterman, Dag Svanes, Carl Unander-Scharin, and \\AAsa Unander-Scharin. 2020. Ethics in Movement: Shaping and Being Shaped in Human-Drone Interaction. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–14.",
      "doi": "10.1145/3313831.3376678"
    },
    {
      "text": "Sarah Fdili Alaoui. 2019. Making an Interactive Dance Piece: Tensions in Integrating Technology in Art. In Proceedings of the 2019 on Designing Interactive Systems Conference(DIS ’19). Association for Computing Machinery, New York, NY, USA, 1195–1208. https://doi.org/10.1145/3322276.3322289",
      "doi": "10.1145/3322276.3322289"
    },
    {
      "text": "Melanie Feinberg. 2017. A Design Perspective on Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). ACM, New York, NY, USA, 2952–2963. https://doi.org/10.1145/3025453.3025837",
      "doi": "10.1145/3025453.3025837"
    },
    {
      "text": "Melanie Feinberg. 2017. A Design Perspective on Data. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 2952–2963. https://doi.org/10.1145/3025453.3025837",
      "doi": "10.1145/3025453.3025837"
    },
    {
      "text": "Laura Forlano. 2017. Maintaining, repairing and caring for the multiple subject. Continent 6, 1 (2017).",
      "doi": ""
    },
    {
      "text": "Christopher Frauenberger. 2019. Entanglement HCI The Next Wave?ACM Transactions on Computer-Human Interaction 27, 1 (Nov. 2019), 2:1–2:27. https://doi.org/10.1145/3364998",
      "doi": "10.1145/3364998"
    },
    {
      "text": "Mikhaila Friske, Jordan Wirfs-Brock, and Laura Devendorf. 2020. Entangling the Roles of Maker and Interpreter in Interpersonal Data Narratives: Explorations in Yarn and Sound. In Proceedings of the 2020 ACM Designing Interactive Systems Conference. 297–310.",
      "doi": "10.1145/3357236.3395442"
    },
    {
      "text": "William Gaver. 2012. What Should We Expect from Research Through Design?. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’12). ACM, New York, NY, USA, 937–946. https://doi.org/10.1145/2207676.2208538",
      "doi": "10.1145/2207676.2208538"
    },
    {
      "text": "William Gaver, Andy Boucher, Nadine Jarvis, David Cameron, Mark Hauenstein, Sarah Pennington, John Bowers, James Pike, Robin Beitra, and Liliana Ovalle. 2016. The Datacatcher: Batch Deployment and Documentation of 130 Location-Aware, Mobile Devices That Put Sociopolitically-Relevant Big Data in People’s Hands: Polyphonic Interpretation at Scale. Association for Computing Machinery, New York, NY, USA, 1597–1607. https://doi.org/10.1145/2858036.2858472",
      "doi": ""
    },
    {
      "text": "William W. Gaver, Jacob Beaver, and Steve Benford. 2003. Ambiguity As a Resource for Design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’03). ACM, New York, NY, USA, 233–240. https://doi.org/10.1145/642611.642653",
      "doi": "10.1145/642611.642653"
    },
    {
      "text": "Evelien Geerts and Iris van der Tuin. 2016. Diffraction & Reading Diffractively. https://newmaterialism.eu/almanac/d/diffraction.html",
      "doi": ""
    },
    {
      "text": "Lisa Gitelman, Virginia Jackson, Daniel Rosenberg, Travis D. Williams, Kevin R. Brine, Mary Poovey, Matthew Stanley, Ellen Gruber Garvey, Markus Krajewski, Rita Raley, David Ribes, Steven J. Jackson, and Geoffrey C. Bowker. 2013. Data Bite Man: The Work of Sustaining a Long-Term Study. In ”Raw Data” Is an Oxymoron. MIT Press, 147–166. https://ieeexplore.ieee.org/document/6462156 Conference Name: ”Raw Data” Is an Oxymoron.",
      "doi": ""
    },
    {
      "text": "Erving Goffman. 1959. The presentation of self in everyday life. Anchor Books, New York.",
      "doi": ""
    },
    {
      "text": "Carlos A. Gomez-Uribe and Neil Hunt. 2016. The Netflix Recommender System: Algorithms, Business Value, and Innovation. ACM Transactions on Management Information Systems 6, 4 (Dec. 2016), 13:1–13:19. https://doi.org/10.1145/2843948",
      "doi": "10.1145/2843948"
    },
    {
      "text": "Donna Haraway. 1992. The Promises of Monsters: a Regenerative Politics for Inappropriate/d Others. In The Monster Theory Reader, Jeffrey Andrew Weinstock (Ed.). University of Minnesota Press. https://doi.org/10.5749/j.ctvtv937f",
      "doi": ""
    },
    {
      "text": "Donna Jeanne Haraway. 1994. A Game of Cat’s Cradle: Science Studies, Feminist Theory, Cultural Studies. Configurations 2, 1 (1994), 59–71. https://doi.org/10.1353/con.1994.0009 Publisher: Johns Hopkins University Press.",
      "doi": ""
    },
    {
      "text": "Steve Harrison and Paul Dourish. 1996. Re-place-ing space: the roles of place and space in collaborative systems. In Proceedings of the 1996 ACM conference on Computer supported cooperative work(CSCW ’96). Association for Computing Machinery, New York, NY, USA, 67–76. https://doi.org/10.1145/240080.240193",
      "doi": "10.1145/240080.240193"
    },
    {
      "text": "Dick Hebdige. 1979. Subculture: The Meaning of Style. Routledge, London; New York.",
      "doi": ""
    },
    {
      "text": "Päivi Heikkilä, Anita Honka, Sebastian Mach, Franziska Schmalfuß, Eija Kaasinen, and Kaisa Väänänen. 2018. Quantified Factory Worker - Expert Evaluation and Ethical Considerations of Wearable Self-Tracking Devices. In Proceedings of the 22nd International Academic Mindtrek Conference(Mindtrek ’18). Association for Computing Machinery, New York, NY, USA, 202–211. https://doi.org/10.1145/3275116.3275119",
      "doi": "10.1145/3275116.3275119"
    },
    {
      "text": "Karey Helms. 2017. Leaky Objects: Implicit Information, Unintentional Communication. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems. 182–186.",
      "doi": ""
    },
    {
      "text": "Karey Helms. 2019. Do You Have to Pee? A Design Space for Intimate and Somatic Data. In Proceedings of the 2019 on Designing Interactive Systems Conference. 1209–1222.",
      "doi": "10.1145/3322276.3322290"
    },
    {
      "text": "Karey Helms, Barry Brown, Magnus Sahlgren, and Airi Lampinen. 2018. Design Methods to Investigate User Experiences of Artificial Intelligence. In AAAI Spring Symposium Series, March 26–28, 2018. Association for the Advancement of Artificial Intelligence.",
      "doi": ""
    },
    {
      "text": "Cher M Hill. 2017. More-than-reflective practice: Becoming a diffractive practitioner. Teacher Learning and Professional Development 2, 1(2017).",
      "doi": ""
    },
    {
      "text": "Gregory Hollin, Isla Forsyth, Eva Giraud, and Tracey Potts. 2017. (Dis)Entangling Barad: Materialisms and Ethics. Social Studies of Science 47, 6 (Dec. 2017), 918–941. https://doi.org/10.1177/0306312717728344",
      "doi": ""
    },
    {
      "text": "Sarah Homewood, Marika Hedemyr, Maja Fagerberg Ranten, and Susan Kozel. 2021. Tracing Conceptions of the Body in HCI: From User to More-Than-Human. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3411764.3445656",
      "doi": "10.1145/3411764.3445656"
    },
    {
      "text": "Kristina Höök, Caroline Hummels, Katherine Isbister, Patrizia Marti, Elena Márquez Segura, Martin Jonsson, Florian’Floyd’ Mueller, Pedro AN Sanches, Thecla Schiphorst, Anna St\\aahl, 2017. Soma-Based Design Theory. In Proceedings of the 2017 CHI Conference Extended Abstracts on Human Factors in Computing Systems. 550–557.",
      "doi": "10.1145/3027063.3027082"
    },
    {
      "text": "Kristina Höök and Jonas Löwgren. 2021. Characterizing Interaction Design by Its Ideals: A Discipline in Transition. She Ji: The Journal of Design, Economics and Innovation Forthcoming (2021).",
      "doi": ""
    },
    {
      "text": "Noura Howell, John Chuang, Abigail De Kosnik, Greg Niemeyer, and Kimiko Ryokai. 2018. Emotional biosensing: Exploring critical alternatives. Proceedings of the ACM on Human-Computer Interaction 2, CSCW(2018), 1–25.",
      "doi": "10.1145/3274338"
    },
    {
      "text": "Noura Howell, Laura Devendorf, Tomás Alfonso Vega Gálvez, Rundong Tian, and Kimiko Ryokai. 2018. Tensions of Data-Driven Reflection: A Case Study of Real-Time Emotional Biosensing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). ACM, New York, NY, USA, 431:1–431:13. https://doi.org/10.1145/3173574.3174005",
      "doi": "10.1145/3173574.3174005"
    },
    {
      "text": "Noura Howell, Laura Devendorf, Tomás Alfonso Vega Gálvez, Rundong Tian, and Kimiko Ryokai. 2018. Tensions of Data-Driven Reflection: A Case Study of Real-Time Emotional Biosensing. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems(CHI ’18). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3174005",
      "doi": "10.1145/3173574.3174005"
    },
    {
      "text": "Kristina Höök, Martin P. Jonsson, Anna Ståhl, and Johanna Mercurio. 2016. Somaesthetic Appreciation Design. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 3131–3142. https://doi.org/10.1145/2858036.2858583",
      "doi": "10.1145/2858036.2858583"
    },
    {
      "text": "Lilly Irani, Janet Vertesi, Paul Dourish, Kavita Philip, and Rebecca E. Grinter. 2010. Postcolonial Computing: A Lens on Design and Development. Association for Computing Machinery, New York, NY, USA, 1311–1320. https://doi.org/10.1145/1753326.1753522",
      "doi": "10.1145/1753326.1753522"
    },
    {
      "text": "Aditya Johri and Janaki Srinivasan. 2014. The Role of Data in Aligning the ’Unique Identity’ Infrastructure in India. In Proceedings of the 17th ACM Conference on Computer Supported Cooperative Work & Social Computing(CSCW ’14). ACM, New York, NY, USA, 697–709. https://doi.org/10.1145/2531602.2531687",
      "doi": "10.1145/2531602.2531687"
    },
    {
      "text": "Pavel Karpashevich and Kristina Höök. 2021. Deep Touch Therapy. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems.",
      "doi": ""
    },
    {
      "text": "Pavel Karpashevich, Pedro Sanches, Garret Rachael, Luft Yoav, Kelsey Cotton, Vasiliki Tsaknaki, and Kristina Höök. 2022. Touching Our Breathing through Shape-Change: Monster, Organic Other or Twisted Mirror (Forthcoming). ACM Transactions on Computer-Human Interaction (TOCHI) (2022). https://doi.org/10.1145/3490498",
      "doi": ""
    },
    {
      "text": "Elizabeth Kaziunas, Silvia Lindtner, Mark S. Ackerman, and Joyce M. Lee. 2018. Lived Data: Tinkering With Bodies, Code, and Care Work. Human–Computer Interaction 33, 1 (Jan. 2018), 49–92. https://doi.org/10.1080/07370024.2017.1307749 Publisher: Taylor & Francis _eprint: https://doi.org/10.1080/07370024.2017.1307749.",
      "doi": ""
    },
    {
      "text": "Airi Lampinen. 2015. Deceptively Simple: Unpacking the Notion of “Sharing”. Social Media + Society 1, 1 (April 2015), 2056305115578135. https://doi.org/10.1177/2056305115578135",
      "doi": ""
    },
    {
      "text": "Bruno Latour. 1999. Circulating Reference: Sampling the Soil in the Amazon Forest. Pandora’s hope: Essays on the reality of science studies 24 (1999), 36.",
      "doi": ""
    },
    {
      "text": "Lucian Leahu, Phoebe Sengers, and Michael Mateas. 2008. Interactionist AI and the Promise of Ubicomp, or, How to Put Your Box in the World Without Putting the World in Your Box. In Proceedings of the 10th International Conference on Ubiquitous Computing(UbiComp ’08). ACM, New York, NY, USA, 134–143. https://doi.org/10.1145/1409635.1409654",
      "doi": "10.1145/1409635.1409654"
    },
    {
      "text": "E. A. Lee. 2008. Cyber Physical Systems: Design Challenges. In 2008 11th IEEE International Symposium on Object and Component-Oriented Real-Time Distributed Computing (ISORC). 363–369. https://doi.org/10.1109/ISORC.2008.25",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with Machines: The Impact of Algorithmic and Data-Driven Management on Human Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1603–1612.",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Matthew Lee-Smith. 2020. The Data Hungry Home: Humans Harvesting Data for Living Devices. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference(DIS’ 20 Companion). Association for Computing Machinery, New York, NY, USA, 527–535. https://doi.org/10.1145/3393914.3395832",
      "doi": ""
    },
    {
      "text": "Martin Lindvall, Jesper Molin, and Jonas Löwgren. 2018. From Machine Learning to Machine Teaching. Interactions 25, 6 (Oct. 2018), 52–57. https://doi.org/10.1145/3282860",
      "doi": "10.1145/3282860"
    },
    {
      "text": "Deborah Lupton and and Ash Watson. 2021. Towards More-than-Human Digital Data Studies: Developing Research-Creation Methods. Qualitative Research 21, 4 (Aug. 2021), 463–480. https://doi.org/10.1177/1468794120939235",
      "doi": ""
    },
    {
      "text": "Ezio Manzini. 1989. The Material of Invention: Materials and Design. The MIT Press, Cambridge, Mass.",
      "doi": ""
    },
    {
      "text": "Donald McMillan, Arvid Engström, Airi Lampinen, and Barry Brown. 2016. Data and the City. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems(CHI ’16). ACM, New York, NY, USA, 2933–2944. https://doi.org/10.1145/2858036.2858434",
      "doi": "10.1145/2858036.2858434"
    },
    {
      "text": "Michael Muller, Ingrid Lange, Dakuo Wang, David Piorkowski, Jason Tsay, Q. Vera Liao, Casey Dugan, and Thomas Erickson. 2019. How Data Science Workers Work with Data: Discovery, Capture, Curation, Design, Creation. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3290605.3300356"
    },
    {
      "text": "Martin Murer, Mattias Jacobsson, Siri Skillgate, and Petra Sundström. 2014. Taking things apart: reaching common ground and shared material understanding. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. 469–472.",
      "doi": "10.1145/2556288.2557267"
    },
    {
      "text": "Teoma J. Naccarato and John Maccallum. 2017. Critical Appropriations of Biosensors in Artistic Practice. In Proceedings of the 4th International Conference on Movement Computing. 1–7.",
      "doi": ""
    },
    {
      "text": "Troy Nachtigall, Oscar Tomico, Ron Wakkary, and Pauline van Dongen. 2019. Encoding Materials and Data for Iterative Personalization. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems(CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3290605.3300749",
      "doi": "10.1145/3290605.3300749"
    },
    {
      "text": "Mehdi Nourbakhsh, Nigel Morris, Michael Bergin, Francesco Iorio, and Daniele Grandi. 2016. Embedded Sensors and Feedback Loops for Iterative Improvement in Design Synthesis for Additive Manufacturing. In ASME 2016 International Design Engineering Technical Conferences and Computers and Information in Engineering Conference. American Society of Mechanical Engineers Digital Collection. https://doi.org/10.1115/DETC2016-59627",
      "doi": ""
    },
    {
      "text": "Carsten Østerlund, Kevin Crowston, and Corey Jackson. 2020. Building an apparatus: Refractive, reflective, and diffractive readings of trace data. Journal of the Association for Information Systems 21, 1 (2020), 10.",
      "doi": ""
    },
    {
      "text": "Mika Pantzar and Minna Ruckenstein. 2015. The Heart of Everyday Analytics: Emotional, Material and Practical Extensions in Self-Tracking Market. Consumption Markets & Culture 18, 1 (Jan. 2015), 92–109. https://doi.org/10.1080/10253866.2014.899213",
      "doi": ""
    },
    {
      "text": "Markus F. Peschl. 2019. Design and Innovation as Co-Creating and Co-Becoming with the Future. Design Management Journal 14, 1 (2019), 4–14. https://doi.org/10.1111/dmj.12049",
      "doi": ""
    },
    {
      "text": "James Pierce. 2021. In Tension with Progression: Grasping the Frictional Tendencies of Speculative, Critical, and other Alternative Designs. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems(CHI ’21). Association for Computing Machinery, New York, NY, USA, 1–19. https://doi.org/10.1145/3411764.3445406",
      "doi": "10.1145/3411764.3445406"
    },
    {
      "text": "Kathleen H. Pine and Max Liboiron. 2015. The politics of measurement and action. In CHI 2015 - Proceedings of the 33rd Annual CHI Conference on Human Factors in Computing Systems: Crossings. Association for Computing Machinery. https://doi.org/10.1145/2702123.2702298",
      "doi": ""
    },
    {
      "text": "Johan Redström. 2008. RE:Definitions of Use. Design Studies 29, 4 (July 2008), 410–423. https://doi.org/10.1016/j.destud.2008.05.001",
      "doi": ""
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal tracking as lived informatics. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’14). Association for Computing Machinery, New York, NY, USA, 1163–1172. https://doi.org/10.1145/2556288.2557039",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Jennifer Rowley. 2007. The Wisdom Hierarchy: Representations of the DIKW Hierarchy. Journal of Information Science 33, 2 (April 2007), 163–180. https://doi.org/10.1177/0165551506070706",
      "doi": "10.1177/0165551506070706"
    },
    {
      "text": "Kimiko Ryokai, Elena Duran, Dina Bseiso, Noura Howell, and Ji Won Jun. 2017. Celebrating Laughter: Capturing and Sharing Tangible Representations of Laughter. In Proceedings of the 2017 ACM Conference Companion Publication on Designing Interactive Systems(DIS ’17 Companion). Association for Computing Machinery, New York, NY, USA, 202–206. https://doi.org/10.1145/3064857.3079146",
      "doi": "10.1145/3064857.3079146"
    },
    {
      "text": "Magnus Sahlgren, Erik Ylipää, Barry Brown, Karey Helms, Airi Lampinen, Donald McMillan, and Jussi Karlgren. 2018. The Smart Data Layer. In 2018 AAAI Spring Symposium Series.",
      "doi": ""
    },
    {
      "text": "Pedro Sanches, Kristina Höök, Elsa Vaara, Claus Weymann, Markus Bylund, Pedro Ferreira, Nathalie Peira, and Marie Sjölinder. 2010. Mind the Body! Designing a Mobile Stress Management Application Encouraging Personal Reflection. In Proceedings of the 8th ACM Conference on Designing Interactive Systems. 47–56.",
      "doi": "10.1145/1858171.1858182"
    },
    {
      "text": "Pedro Sanches, Kristina Höök, Corina Sas, and Anna St\\a ahl. 2019. Ambiguity As a Resource to Inform Proto-Practices: The Case of Skin Conductance. ACM Trans. Comput.-Hum. Interact. 26, 4 (July 2019), 21:1–21:32. https://doi.org/10.1145/3318143",
      "doi": "10.1145/3318143"
    },
    {
      "text": "Corina Sas, Kristina Höök, Gavin Doherty, Pedro Sanches, Tim Leufkens, and Joyce Westerink. 2020. Mental Wellbeing: Future Agenda Drawing from Design, HCI and Big Data. In Companion Publication of the 2020 ACM Designing Interactive Systems Conference(DIS’ 20 Companion). Association for Computing Machinery, New York, NY, USA, 425–428. https://doi.org/10.1145/3393914.3395920",
      "doi": ""
    },
    {
      "text": "Ari Schlesinger, W. Keith Edwards, and Rebecca E. Grinter. 2017. Intersectional HCI: Engaging Identity through Gender, Race, and Class. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems(CHI ’17). Association for Computing Machinery, New York, NY, USA, 5412–5427. https://doi.org/10.1145/3025453.3025766",
      "doi": "10.1145/3025453.3025766"
    },
    {
      "text": "Donald A. Schön. 1984. The reflective practitioner: how professionals think in action. Basic Books, New York.",
      "doi": ""
    },
    {
      "text": "Cathrine Seidelin, Yvonne Dittrich, and Erik Grönvall. 2020. Foregrounding Data in Co-Design – An Exploration of How Data May Become an Object of Design. International Journal of Human-Computer Studies 143 (Nov. 2020), 102505. https://doi.org/10.1016/j.ijhcs.2020.102505",
      "doi": ""
    },
    {
      "text": "B. Smith and G. Linden. 2017. Two Decades of Recommender Systems at Amazon.Com. IEEE Internet Computing 21, 3 (May 2017), 12–18. https://doi.org/10.1109/MIC.2017.72",
      "doi": "10.1109/MIC.2017.72"
    },
    {
      "text": "Katta Spiel. 2021. The Bodies of TEI: Investigating Norms and Assumptions in the Design of Embodied Interaction. In Proceedings of the Fifteenth International Conference on Tangible, Embedded, and Embodied Interaction(TEI ’21). Association for Computing Machinery, New York, NY, USA, 1–19. https://doi.org/10.1145/3430524.3440651",
      "doi": "10.1145/3430524.3440651"
    },
    {
      "text": "Anna Ståhl, Jonas Löwgren, and Kristina Höök. 2014. Evocative balance: Designing for interactional empowerment. International journal of Design 8, 1 (2014), 43–57.",
      "doi": ""
    },
    {
      "text": "Erik Stolterman. 2008. The Nature of Design Practice and Implications for Interaction Design Research. International Journal of Design 2, 1 (2008).",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Madeline Balaam, Rob Comber, Pedro Sanches, and Kristina Höök. 2022. Making New Worlds - Transformative Becomings with Soma Design (Forthcoming). In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems. https://doi.org/10.1145/3491102.3502018",
      "doi": ""
    },
    {
      "text": "Anna Ståhl, Vasiliki Tsaknaki, and Madeline Balaam. 2021. Validity and Rigour in Soma Design - Sketching with the Soma (Forthcoming). ACM Transactions on Computer-Human Interaction (TOCHI) 28, 6(2021). https://doi.org/10.1145/3470132",
      "doi": "10.1145/3470132"
    },
    {
      "text": "Petra Sundström, Alex Taylor, Katja Grufberg, Niklas Wirström, Jordi Solsona Belenguer, and Marcus Lundén. 2011. Inspirational Bits: Towards a Shared Understanding of the Digital Material. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’11). ACM, New York, NY, USA, 1561–1570. https://doi.org/10.1145/1978942.1979170",
      "doi": "10.1145/1978942.1979170"
    },
    {
      "text": "Vasiliki Tsaknaki, Kelsey Cotton, Pavel Karpashevich, and Pedro Sanches. 2021. “Feeling the Sensor Feeling You”: A Soma Design Exploration on Sensing Non-Habitual Breathing. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3411764.3445628"
    },
    {
      "text": "Vasiliki Tsaknaki, Tom Jenkins, Laurens Boer, Sarah Homewood, Noura Howell, and Pedro Sanches. 2020. Challenges and Opportunities for Designing with Biodata as Material. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society. Number 122. Association for Computing Machinery, New York, NY, USA, 1–3.",
      "doi": "10.1145/3419249.3420063"
    },
    {
      "text": "Anna Vallgårda and Johan Redström. 2007. Computational Composites. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems(CHI ’07). ACM, New York, NY, USA, 513–522. https://doi.org/10.1145/1240624.1240706",
      "doi": "10.1145/1240624.1240706"
    },
    {
      "text": "Peter-Paul Verbeek. 2008. Cyborg intentionality: Rethinking the phenomenology of human–technology relations. Phenomenology and the Cognitive Sciences 7, 3 (2008), 387–395.",
      "doi": ""
    },
    {
      "text": "Athanasios Voulodimos, Nikolaos Doulamis, Anastasios Doulamis, and Eftychios Protopapadakis. 2018. Deep Learning for Computer Vision: A Brief Review. https://www.hindawi.com/journals/cin/2018/7068349/., e7068349 pages. https://doi.org/10.1155/2018/7068349",
      "doi": ""
    },
    {
      "text": "Charles Windlin, Anna Ståhl, Pedro Sanches, Vasiliki Tsaknaki, Pavel Karpashevich, Madeline Balaam, and Kristina Höök. 2019. Soma Bits-Mediating Technology to Orchestrate Bodily Experiences. In RTD 2019-Research through Design Conference 2019, the Science Centre, Delft, on 19th to 22nd March 2019.",
      "doi": ""
    },
    {
      "text": "Annika Wolff, Kortuem Gerd, Daniel Gooch, Elias Giaccardi, and Chris Speed. 2016. Designing with Data: A Designerly Approach to Data and Data Analytics. In Proceedings of the 2016 ACM Conference Companion Publication on Designing Interactive Systems. Association for Computing Machinery, New York, NY, USA, 53–56.",
      "doi": "10.1145/2908805.2913017"
    },
    {
      "text": "Annika Wolff, Ahmed Seffah, Gerd Kortuem, and Janet van der Linden. 2018. Designing for Effective Interactions with Data in the Internet of Things. In Proceedings of the 2018 ACM Conference Companion Publication on Designing Interactive Systems(DIS ’18 Companion). Association for Computing Machinery, New York, NY, USA, 415–418. https://doi.org/10.1145/3197391.3197402",
      "doi": ""
    },
    {
      "text": "Qian Yang. 2018. Machine Learning as a UX Design Material: How Can We Imagine Beyond Automation, Recommenders, and Reminders?Technical Report.",
      "doi": ""
    },
    {
      "text": "John Zimmerman, Jodi Forlizzi, and Shelley Evenson. 2007. Research Through Design as a Method for Interaction Design Research in HCI.",
      "doi": ""
    }
  ]
}