{
  "doi": "10.1145/3491102.3501874",
  "title": "Investigating Perceptual Biases in Icon Arrays",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-12",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Icon arrays are graphical displays in which a subset of identical shapes are filled to convey probabilities. They are widely used for communicating probabilities to the general public. A primary design decision concerning icon arrays is how to fill and arrange these shapes. For example, a designer could fill the shapes from top to bottom or in a random fashion. We investigated the effect of different arrangements in icon arrays on probability perception. We showed participants icon arrays depicting probabilities between 0% and 100% in six different arrangements. Participants were more accurate in estimating probabilities when viewing the top, row, and diagonal arrangements, but they overestimated the proportions with the central arrangement and underestimated the proportions with the edge arrangement. They were biased to either overestimate or underestimate when viewing the random arrangement depending on the objective proportions, following a cyclical pattern consistent with existing findings in the psychophysics literature.",
  "tags": [
    "Visualization of Probabilities",
    "Proportions",
    "Risk Visualization",
    "Icon Arrays",
    "Perception",
    "Bias",
    "Communication",
    "Crowdsourcing"
  ],
  "authors": [
    {
      "name": "Cindy Xiong",
      "institution": "Manning College of Information and Computer Sciences, University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235246",
      "orcid": "missing"
    },
    {
      "name": "Ali Sarvghad",
      "institution": "Manning College of Information and Computer Sciences, University of Massachusetts Amherst, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81557894156",
      "orcid": "missing"
    },
    {
      "name": "Daniel G Goldstein",
      "institution": "Microsoft Research, United States",
      "img": "/do/10.1145/contrib-81485649647/rel-imgonly/dangoldstein_badge1.jpg",
      "acmid": "81485649647",
      "orcid": "missing"
    },
    {
      "name": "Jake M Hofman",
      "institution": "Microsoft Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81436601976",
      "orcid": "missing"
    },
    {
      "name": "Çagatay Demiralp",
      "institution": "Sigma Computing, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100232387",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Kiran Ajani, Elsie Lee, Cindy Xiong, Cole Nussbaumer Knaflic, William Kemper, and Steven Franconeri. 2021. Declutter and Focus: Empirically Evaluating Design Guidelines for Effective Data Communication. IEEE Transactions on Visualization and Computer Graphics (2021).",
      "doi": ""
    },
    {
      "text": "Jüri Allik and Tiia Tuulmets. 1991. Occupancy model of perceived numerosity. Perception & Psychophysics 49, 4 (1991), 303–314.",
      "doi": ""
    },
    {
      "text": "Jessica S Ancker, Yalini Senathirajah, Rita Kukafka, and Justin B Starren. 2006. Design features of graphs in health risk communication: a systematic review. Journal of the American Medical Informatics Association 13, 6(2006), 608–618.",
      "doi": ""
    },
    {
      "text": "Eduardo B Andrade. 2011. Excessive confidence in visually-based estimates. Organizational Behavior and Human Decision Processes 116, 2(2011), 252–261.",
      "doi": ""
    },
    {
      "text": "Dan Ariely. 2001. Seeing sets: Representation by statistical properties. Psychological science 12, 2 (2001), 157–162.",
      "doi": ""
    },
    {
      "text": "Scott Bateman, Regan L Mandryk, Carl Gutwin, Aaron Genest, David McDine, and Christopher Brooks. 2010. Useful junk? The effects of visual embellishment on comprehension and memorability of charts. In Proceedings of the SIGCHI conference on human factors in computing systems. 2573–2582.",
      "doi": "10.1145/1753326.1753716"
    },
    {
      "text": "Ty W Boyer and Susan C Levine. 2015. Prompting children to reason proportionally: Processing discrete units as continuous amounts.Developmental psychology 51, 5 (2015), 615.",
      "doi": ""
    },
    {
      "text": "Jacquelyn Burkell. 2004. What are the chances? Evaluating risk and benefit information in consumer health materials. Journal of the Medical Library association 92, 2 (2004), 200.",
      "doi": ""
    },
    {
      "text": "Alyxander Burns, Cindy Xiong, Steven Franconeri, Alberto Cairo, and Narges Mahyar. 2021. Designing with Pictographs: Envision Topics without Sacrificing Understanding. IEEE Transactions on Visualization and Computer Graphics (2021).",
      "doi": ""
    },
    {
      "text": "David Burr and John Ross. 2008. Response: visual number. Current Biology 18, 18 (2008), R857–R858.",
      "doi": ""
    },
    {
      "text": "Lisa Cantrell, Megumi Kuwabara, and Linda B Smith. 2015. Set size and culture influence children’s attention to number. Journal of Experimental Child Psychology 131 (2015), 19–37.",
      "doi": ""
    },
    {
      "text": "Cristina R Ceja and Cindy Xiong. 2021. Show or Tell? Visual and Verbal Representations Bias Position Recall. arXiv preprint arXiv:2108.08407(2021).",
      "doi": ""
    },
    {
      "text": "Sang Chul Chong and Anne Treisman. 2003. Representation of statistical properties. Vision research 43, 4 (2003), 393–404.",
      "doi": ""
    },
    {
      "text": "William S Cleveland and Robert McGill. 1984. Graphical perception: Theory, experimentation, and application to the development of graphical methods. Journal of the American statistical association 79, 387(1984), 531–554.",
      "doi": ""
    },
    {
      "text": "Stanislas Dehaene. 2011. The number sense: How the mind creates mathematics. OUP USA.",
      "doi": ""
    },
    {
      "text": "Stanislas Dehaene and Jean-Pierre Changeux. 1993. Development of elementary numerical abilities: A neuronal model. Journal of cognitive neuroscience 5, 4 (1993), 390–407.",
      "doi": "10.1162/jocn.1993.5.4.390"
    },
    {
      "text": "Madison A Elliott, Christine Nothelfer, Cindy Xiong, and Danielle Albers Szafir. 2020. A Design Space of Vision Science Methods for Visualization Research. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 1117–1127.",
      "doi": ""
    },
    {
      "text": "Angela Fagerlin, Brian J Zikmund-Fisher, and Peter A Ubel. 2011. Helping patients decide: ten steps to better risk communication. Journal of the National Cancer Institute 103, 19 (2011), 1436–1443.",
      "doi": ""
    },
    {
      "text": "Deb Feldman-Stewart, Nancy Kocovski, Beth A McConnell, Michael D Brundage, and William J Mackillop. 2000. Perception of quantitative information for treatment decisions. Medical Decision Making 20, 2 (2000), 228–238.",
      "doi": ""
    },
    {
      "text": "Michael Fernandes, Logan Walls, Sean Munson, Jessica Hullman, and Matthew Kay. 2018. Uncertainty displays using quantile dotplots or cdfs improve transit decision-making. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3173574.3173718"
    },
    {
      "text": "Steven L Franconeri, Douglas K Bemis, and George Angelo Alvarez. 2009. Number estimation relies on a set of segmented objects. Cognition 113, 1 (2009), 1–13.",
      "doi": ""
    },
    {
      "text": "Christopher D Frith and Uta Frit. 1972. The solitaire illusion: An illusion of numerosity. Perception & Psychophysics 11, 6 (1972), 409–410.",
      "doi": ""
    },
    {
      "text": "Mirta Galesic, Rocio Garcia-Retamero, and Gerd Gigerenzer. 2009. Using icon arrays to communicate medical risks: overcoming low numeracy.Health Psychology 28, 2 (2009), 210.",
      "doi": ""
    },
    {
      "text": "Rocio Garcia-Retamero and Edward T Cokely. 2013. Communicating health risks with visual aids. Current Directions in Psychological Science 22, 5 (2013), 392–399.",
      "doi": ""
    },
    {
      "text": "Titia Gebuis and Bert Reynvoet. 2012. Continuous visual properties explain neural responses to nonsymbolic number. Psychophysiology 49, 11 (2012), 1649–1659.",
      "doi": ""
    },
    {
      "text": "Norman Ginsburg. 1976. Effect of item arrangement on perceived numerosity: Randomness vs regularity. Perceptual and motor skills 43, 2 (1976), 663–668.",
      "doi": ""
    },
    {
      "text": "EJ Goldstein, RM Kahn, ML Alpert, BP Ginsberg, FL Greenway, and DM Citron. 1987. Ciprofloxacin versus cinoxacin in therapy of urinary tract infections. A randomized, double-blind trial.The American journal of medicine 82, 4A (1987), 284–287.",
      "doi": ""
    },
    {
      "text": "Donna Gresh, Léa A Deleris, Luca Gasparini, and Dylan Evans. 2011. Visualizing risk. In Proceedings of IEEE Information Visualization Conference. 1–10.",
      "doi": ""
    },
    {
      "text": "Justin H. Gross. 2016. How to better communicate election forecasts — in one simple chart. https://www.washingtonpost.com/news/monkey-cage/wp/2016/11/29/how-to-better-communicate-election-forecasts-in-one-simple-chart/?noredirect=on",
      "doi": ""
    },
    {
      "text": "Justin Halberda, Sean F Sires, and Lisa Feigenson. 2006. Multiple spatially overlapping sets can be enumerated in parallel. Psychological science 17, 7 (2006), 572–576.",
      "doi": ""
    },
    {
      "text": "Sarah T Hawley, Brian Zikmund-Fisher, Peter Ubel, Aleksandra Jancovic, Todd Lucas, and Angela Fagerlin. 2008. The impact of the format of graphical presentation on health-related knowledge and treatment choices. Patient education and counseling 73, 3 (2008), 448–455.",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Michael Bostock. 2010. Crowdsourcing graphical perception: using mechanical turk to assess visualization design. In Proceedings of the SIGCHI conference on human factors in computing systems. 203–212.",
      "doi": "10.1145/1753326.1753357"
    },
    {
      "text": "Rebecca Hess, Vivianne HM Visschers, and Michael Siegrist. 2011. Risk communication with pictographs: The role of numeracy and graph processing. Judgment and Decision Making 6, 3 (2011), 263.",
      "doi": ""
    },
    {
      "text": "Ulrich Hoffrage, Samuel Lindsey, Ralph Hertwig, and Gerd Gigerenzer. 2000. Communicating statistical information.",
      "doi": ""
    },
    {
      "text": "JG Hollands and Brian P Dyre. 2000. Bias in proportion judgments: the cyclical power model.Psychological review 107, 3 (2000), 500.",
      "doi": ""
    },
    {
      "text": "Nicole Jardine, Brian D Ondov, Niklas Elmqvist, and Steven Franconeri. 2019. The perceptual proxies of visual comparison. IEEE transactions on visualization and computer graphics 26, 1(2019), 1012–1021.",
      "doi": ""
    },
    {
      "text": "Yoonkyung Jeong, Susan C Levine, and Janellen Huttenlocher. 2007. The development of proportional reasoning: Effect of continuous versus discrete quantities. Journal of Cognition and Development 8, 2 (2007), 237–256.",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Tara Kola, Jessica R Hullman, and Sean A Munson. 2016. When (ish) is my bus? user-centered visualizations of uncertainty in everyday, mobile predictive systems. In Proceedings of the 2016 chi conference on human factors in computing systems. 5092–5103.",
      "doi": "10.1145/2858036.2858558"
    },
    {
      "text": "Helen Kennedy, Rosemary Lucy Hill, William Allen, and Andy Kirk. 2016. Engaging with (big) data visualizations: Factors that affect engagement and resulting new definitions of effectiveness. First Monday 21, 11 (2016).",
      "doi": ""
    },
    {
      "text": "Sarah Kliff and Aatish Bhatia. 2022. When They Warn of Rare Disorders, These Prenatal Tests Are Usually Wrong. https://www.nytimes.com/2022/01/01/upshot/pregnancy-birth-genetic-testing.html?smtyp=cur&smid=fb-nytimes&fbclid=IwAR1yOiAgSAB79GLf8CAFWgdmFyLKToMG5-QnJWJp4ct80mIDGroJxvy3EJw",
      "doi": ""
    },
    {
      "text": "Elke Kurz-Milcke, Gerd Gigerenzer, and Laura Martignon. 2008. Transparency in risk communication: graphical and analog tools. In Annals of the New York Academy of Sciences. Blackwell, 18–28.",
      "doi": ""
    },
    {
      "text": "Laura Landro. 2017. How to Get Patients to Take More Control of Their Medical Decisions. https://wellnet.com/broker-resource/news/how-to-get-patients-to-take-more-control-of-their-medical-decisions/",
      "doi": ""
    },
    {
      "text": "Tali Leibovich, Naama Katzin, Maayan Harel, and Avishai Henik. 2017. From “sense of number” to “sense of magnitude”: The role of continuous magnitudes in numerical cognition. Behavioral and Brain Sciences 40 (2017).",
      "doi": ""
    },
    {
      "text": "Caitlyn M McColeman, Lane Harrison, Mi Feng, and Steven Franconeri. 2020. No mark is an island: Precision and category repulsion biases in data reproductions. IEEE Transactions on Visualization and Computer Graphics 27, 2(2020), 1063–1072.",
      "doi": ""
    },
    {
      "text": "Arthur L Miller and Robert A Baker. 1968. The effects of shape, size, heterogeneity, and instructional set on the judgment of visual number. The American Journal of Psychology 81, 1 (1968), 83–91.",
      "doi": ""
    },
    {
      "text": "Clare Milliken. 2020. Understanding Uncertainty. https://magazine.northwestern.edu/exclusives/understanding-uncertainty?commentsstart2772=10",
      "doi": ""
    },
    {
      "text": "Wendy Nelson, Valerie F Reyna, Angela Fagerlin, Isaac Lipkus, and Ellen Peters. 2008. Clinical implications of numeracy: theory and practice. Annals of behavioral medicine 35, 3 (2008), 261–274.",
      "doi": ""
    },
    {
      "text": "Aude Oliva. 2005. Gist of the scene. In Neurobiology of attention. Elsevier, 251–256.",
      "doi": ""
    },
    {
      "text": "Stefania Pighin, Lucia Savadori, Elisa Barilli, Laura Cremonesi, Maurizio Ferrari, and Jean-François Bonnefon. 2011. The 1-in-X effect on the subjective assessment of medical probabilities. Medical Decision Making 31, 5 (2011), 721–729.",
      "doi": ""
    },
    {
      "text": "Xiaoying Pu and Matthew Kay. 2020. A probabilistic grammar of graphics. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376466"
    },
    {
      "text": "I Qualtrics. 2013. Qualtrics. Provo, UT, USA (2013).",
      "doi": ""
    },
    {
      "text": "Valerie F Reyna. 2008. A theory of medical decision making and health: fuzzy trace theory. Medical decision making 28, 6 (2008), 850–865.",
      "doi": ""
    },
    {
      "text": "Emir H Shuford. 1961. Percentage estimation of proportion as a function of element type, exposure time, and task.Journal of Experimental Psychology 61, 5 (1961), 430.",
      "doi": ""
    },
    {
      "text": "Mark Smiciklas. 2012. The power of infographics: Using pictures to communicate and connect with your audiences. Que Publishing.",
      "doi": ""
    },
    {
      "text": "Ian Spence. 1990. Visual psychophysics of simple graphical elements.Journal of Experimental Psychology: Human Perception and Performance 16, 4(1990), 683.",
      "doi": ""
    },
    {
      "text": "David Spiegelhalter, Mike Pearson, and Ian Short. 2011. Visualizing uncertainty about the future. science 333, 6048 (2011), 1393–1400.",
      "doi": ""
    },
    {
      "text": "Jan Stellamanns, Dana Ruetters, Keshav Dahal, Zita Schillmoeller, and Jutta Huebner. 2017. Visualizing risks in cancer communication: a systematic review of computer-supported visual aids. Patient education and counseling 100, 8 (2017), 1421–1431.",
      "doi": ""
    },
    {
      "text": "Stanley S Stevens. 1957. On the psychophysical law.Psychological review 64, 3 (1957), 153.",
      "doi": ""
    },
    {
      "text": "Alan R Tait, Terri Voepel-Lewis, Brian J Zikmund-Fisher, and Angela Fagerlin. 2010. Presenting research risks and benefits to parents: does format matter?Anesthesia and analgesia 111, 3 (2010), 718.",
      "doi": ""
    },
    {
      "text": "Alberto Testolin, Serena Dolfi, Mathijs Rochus, and Marco Zorzi. 2020. Visual sense of number vs. sense of magnitude in humans and machines. Scientific reports 10, 1 (2020), 1–13.",
      "doi": ""
    },
    {
      "text": "Michael Theil. 2002. The role of translations of verbal into numerical probability expressions in risk management: a meta-analysis. Journal of Risk Research 5, 2 (2002), 177–186.",
      "doi": ""
    },
    {
      "text": "Kevin E Tiede, Felicia Ripke, Nicole Degen, and Wolfgang Gaissmaier. 2020. When Does the Incremental Risk Format Aid Informed Medical Decisions? The Role of Learning, Feedback, and Number of Treatment Options. Medical Decision Making 40, 2 (2020), 212–221.",
      "doi": ""
    },
    {
      "text": "Sithi Wangeamsermsuk and Arisara Jiamsanguanwong. 2018. The Comparison of Iconicity Level of Icon Arrays on Risk Perception. Journal of Advances in Information Technology Vol 9, 4 (2018).",
      "doi": ""
    },
    {
      "text": "Evan A Wilhelms and Valerie F Reyna. 2013. Effective ways to communicate risk and benefit. The virtual mentor: VM 15, 1 (2013), 34.",
      "doi": ""
    },
    {
      "text": "Lei Yuan, Steve Haroz, and Steven Franconeri. 2019. Perceptual proxies for extracting averages in data visualizations. Psychonomic bulletin & review 26, 2 (2019), 669–676.",
      "doi": ""
    },
    {
      "text": "Brian J Zikmund-Fisher, Angela Fagerlin, and Peter A Ubel. 2008. Improving understanding of adjuvant therapy options by using simpler risk graphics. Cancer 113, 12 (2008), 3382–3390.",
      "doi": ""
    },
    {
      "text": "Brian J Zikmund-Fisher, Peter A Ubel, Dylan M Smith, Holly A Derry, Jennifer B McClure, Azadeh Stark, Rosemarie K Pitsch, and Angela Fagerlin. 2008. Communicating side effect risks in a tamoxifen prophylaxis decision aid: the debiasing influence of pictographs. Patient education and counseling 73, 2 (2008), 209–214.",
      "doi": ""
    }
  ]
}