{
  "doi": "10.1145/3491102.3517551",
  "title": "Interpretable Directed Diversity: Leveraging Model Explanations for Iterative Crowd Ideation",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-28",
  "year": 2022,
  "badges": [],
  "abstract": "Feedback in creativity support tools can help crowdworkers to improve their ideations. However, current feedback methods require human assessment from facilitators or peers. This is not scalable to large crowds. We propose Interpretable Directed Diversity to automatically predict ideation quality and diversity scores, and provide AI explanations — Attribution, Contrastive Attribution, and Counterfactual Suggestions — to feedback on why ideations were scored (low), and how to get higher scores. These explanations provide multi-faceted feedback as users iteratively improve their ideations. We conducted formative and controlled user studies to understand the usage and usefulness of explanations to improve ideation diversity and quality. Users appreciated that explanation feedback helped focus their efforts and provided directions for improvement. This resulted in explanations improving diversity compared to no feedback or feedback with scores only. Hence, our approach opens opportunities for explainable AI towards scalable and rich feedback for iterative crowd ideation and creativity support tools.",
  "tags": [
    "Explainable AI",
    "Collective Creativity",
    "Crowdsourcing",
    "Diversity"
  ],
  "authors": [
    {
      "name": "Yunlong Wang",
      "institution": "Institute for Health Innovation & Technology (iHealthtech), National University of Singapore, Singapore",
      "img": "/do/10.1145/contrib-99659548282/rel-imgonly/20230403103214.jpg",
      "acmid": "99659548282",
      "orcid": "missing"
    },
    {
      "name": "Priyadarshini Venkatesh",
      "institution": "Department of Brain Sciences, University College London, United Kingdom",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238808",
      "orcid": "missing"
    },
    {
      "name": "Brian Y Lim",
      "institution": "Department of Computer Science, National University of Singapore, Singapore and Institute for Health Innovation & Technology (iHealthtech), National University of Singapore, Singapore",
      "img": "/do/10.1145/contrib-81416601689/rel-imgonly/brian_lim_2015_-_square.jpg",
      "acmid": "81416601689",
      "orcid": "0000-0002-0543-2414"
    }
  ],
  "references": [
    {
      "text": "Ashraf Abdul, Jo Vermeulen, Danding Wang, Brian Y Lim, and Mohan Kankanhalli. 2018. Trends and Trajectories for Explainable, Accountable and Intelligible Systems: An HCI Research Agenda. In CHI 2018. https://doi.org/10.1145/3173574.3174156",
      "doi": ""
    },
    {
      "text": "Leonard Adelman, James Gualtieri, and Suzanne Stanford. 1995. Examining the effect of causal focus on the option generation process: An experiment using protocol analysis. Organizational Behavior and Human Decision Processes (1995). https://doi.org/10.1006/obhd.1995.1005",
      "doi": ""
    },
    {
      "text": "Elena Agapie, Bonnie Chinh, Laura R Pina, Diana Oviedo, Molly C Welsh, Gary Hsieh, and Sean Munson. 2018. Crowdsourcing Exercise Plans Aligned with Expert Guidelines and Everyday Constraints. In CHI 2018. ACM, 324. https://doi.org/10.1145/3173574.3173898",
      "doi": ""
    },
    {
      "text": "Faez Ahmed, Sharath Kumar Ramachandran, Mark Fuge, Samuel Hunter, and Scarlett Miller. 2019. Interpreting idea maps: Pairwise comparisons reveal what makes ideas novel. Journal of Mechanical Design 141, 2 (2019). https://doi.org/10.1115/1.4041856",
      "doi": ""
    },
    {
      "text": "T. Amabile. 1996. Creativity In Context. https://doi.org/10.4324/9780429501234",
      "doi": ""
    },
    {
      "text": "Andrew Anderson, Jonathan Dodge, Amrita Sadarangani, Zoe Juozapaitis, Evan Newman, Jed Irvine, Souti Chattopadhyay, Matthew Olson, Alan Fern, and Margaret Burnett. 2020. Mental Models of Mere Mortals with Explanations of Reinforcement Learning. ACM Transactions on Interactive Intelligent Systems 10, 2 (2020). https://doi.org/10.1145/3366485",
      "doi": "10.1145/3366485"
    },
    {
      "text": "Robert K. Atkinson, Sharon J. Derry, Alexander Renkl, and Donald Wortham. 2000. Learning from examples: Instructional principles from the worked examples research. Review of Educational Research 70, 2 (2000), 181–214. https://doi.org/10.3102/00346543070002181",
      "doi": ""
    },
    {
      "text": "Suyun Sandra Bae, Oh-hyun Kwon, Senthil Chandrasegaran, and Kwan-liu Ma. 2020. Spinneret : Aiding Creative Ideation through Non-Obvious Concept Associations. In CHI 2020. 1–13. https://doi.org/10.1145/3313831.3376746",
      "doi": "10.1145/3313831.3376746"
    },
    {
      "text": "Gagan Bansal, Tongshuang Wu, and Joyce Zhou. 2021. Does the whole exceed its parts? The efect of ai explanations on complementary team performance. Conference on Human Factors in Computing Systems - Proceedings (2021). https://doi.org/10.1145/3411764.3445717 arxiv:2006.14779",
      "doi": "10.1145/3411764.3445717"
    },
    {
      "text": "Baptiste Barbot. 2018. The dynamics of creative ideation: Introducing a new assessment paradigm. Frontiers in Psychology(2018). https://doi.org/10.3389/fpsyg.2018.02529",
      "doi": ""
    },
    {
      "text": "Michael S Bernstein, Greg Little, Robert C Miller, Björn Hartmann, Mark S Ackerman, David R Karger, David Crowell, and Katrina Panovich. 2010. Soylent: A Word Processor with a Crowd Inside. In Proceedings of the 23nd Annual ACM Symposium on User Interface Software and Technology. ACM, New York, NY, USA, 313–322. https://doi.org/10.1145/1866029.1866078",
      "doi": "10.1145/1866029.1866078"
    },
    {
      "text": "Aditya Bharadwaj, Pao Siangliulue, Adam Marcus, and Kurt Luther. 2019. Critter: Augmenting Creative Work with Dynamic Checklists, Automated Quality Assurance, and Contextual Reviewer Feedback. In CHI ’19. 1–12. https://doi.org/10.1145/3290605.3300769",
      "doi": ""
    },
    {
      "text": "Alexander Binder, Sebastian Bach, Gregoire Montavon, Klaus Robert Müller, and Wojciech Samek. 2016. Layer-wise relevance propagation for deep neural network architectures. In Information science and applications (ICISA) 2016, Vol. 376. 913–922. https://doi.org/10.1007/978-981-10-0557-2_87",
      "doi": ""
    },
    {
      "text": "Osvald M Bjelland and Robert Chapman Wood. 2008. An Inside View of IBM’s ’Innovation Jam’. MIT Sloan management review 50, 1 (2008), 32.",
      "doi": ""
    },
    {
      "text": "Margaret A Boden. 1996. Chapter 9 - Creativity. In Artificial Intelligence, Margaret A Boden (Ed.). Academic Press, 267–291. https://doi.org/10.1016/B978-012161964-0/50011-X",
      "doi": ""
    },
    {
      "text": "Margaret A Boden. 2004. The creative mind: Myths and mechanisms. Routledge.",
      "doi": "10.5555/940309"
    },
    {
      "text": "Antoine Bosselut, Hannah Rashkin, Maarten Sap, Chaitanya Malaviya, Asli Celikyilmaz, and Yejin Choi. 2020. CoMET: Commonsense transformers for automatic knowledge graph construction. ACL 2019 - 57th Annual Meeting of the Association for Computational Linguistics, Proceedings of the Conference(2020), 4762–4779. https://doi.org/10.18653/v1/p19-1470 arxiv:1906.05317",
      "doi": ""
    },
    {
      "text": "Carrie J. Cai, Emily Reif, Narayan Hegde, Jason Hipp, Been Kim, Daniel Smilkov, Martin Wattenberg, Fernanda Viegas, Greg S. Corrado, Martin C. Stumpe, and Michael Terry. 2019. Human-centered tools for coping with imperfect algorithms during medical decision-making. In Conference on Human Factors in Computing Systems - Proceedings. 1–14. https://doi.org/10.1145/3290605.3300234 arxiv:1902.02960",
      "doi": "10.1145/3290605.3300234"
    },
    {
      "text": "Paula Phillips Carson and Kerry D. Carson. 1993. Managing Creativity Enhancement Through Goal-Setting and Feeddback. Journal of Creative Behavior 27, 1 (1993), 36–45. https://doi.org/10.1002/j.2162-6057.1993.tb01385.x",
      "doi": ""
    },
    {
      "text": "Daniel Cer, Yinfei Yang, Sheng yi Kong, Nan Hua, Nicole Limtiaco, Rhomni St. John, Noah Constant, Mario Guajardo-Céspedes, Steve Yuan, Chris Tar, Yun Hsuan Sung, Brian Strope, and Ray Kurzweil. 2018. Universal sentence encoder. EMNLP 2018 - Conference on Empirical Methods in Natural Language Processing: System Demonstrations, Proceedings(2018), 169–174. https://doi.org/10.18653/v1/d18-2029 arxiv:arXiv:1803.11175",
      "doi": ""
    },
    {
      "text": "Joel Chan, Pao Siangliulue, Denisa Qori McDonald, Ruixue Liu, Reza Moradinezhad, Safa Aman, Erin T Solovey, Krzysztof Z Gajos, and Steven P Dow. 2017. Semantically far inspirations considered harmful? accounting for cognitive states in collaborative ideation. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition. 93–105. https://doi.org/10.1145/3059454.3059455",
      "doi": "10.1145/3059454.3059455"
    },
    {
      "text": "Jesse Chandler, Cheskie Rosenzweig, Aaron J. Moss, Jonathan Robinson, and Leib Litman. 2019. Online panels in social science research: Expanding sampling methods beyond Mechanical Turk. Behavior Research Methods 51, 5 (oct 2019), 2022–2038. https://doi.org/10.3758/s13428-019-01273-7",
      "doi": ""
    },
    {
      "text": "Robert B. Cialdini, Wilhelmina Wosinska, Daniel W. Barrett, Jonathan Butner, and Malgorzata Gornik-Durose. 1999. Compliance with a request in two cultures: The differential influence of social proof and commitment/consistency on collectivists and individualists. Personality and Social Psychology Bulletin 25, 10 (1999), 1242–1253. https://doi.org/10.1177/0146167299258006",
      "doi": ""
    },
    {
      "text": "Elizabeth Clark, Anne Spencer Ross, Chenhao Tan, Yangfeng Ji, and Noah A. Smith. 2018. Creative writing with a machine in the loop: Case studies on slogans and stories. In International Conference on Intelligent User Interfaces, Proceedings IUI. 329–340. https://doi.org/10.1145/3172944.3172983",
      "doi": "10.1145/3172944.3172983"
    },
    {
      "text": "Sven Coppers, Jan Van Den Bergh, Kris Luyten, Karin Coninx, Iulianna Van Der Lek-Ciudin, Tom Vanallemeersch, and Vincent Vandeghinste. 2018. Intellingo: An intelligible translation environment. In CHI 2018. 1–13. https://doi.org/10.1145/3173574.3174098",
      "doi": "10.1145/3173574.3174098"
    },
    {
      "text": "Samuel Rhys Cox, Yunlong Wang, Ashraf Abdul, Christian Von Der Weth, and Brian Y. Lim. 2021. Directed diversity: Leveraging language embedding distances for collective creativity in crowd ideation. In CHI’21. https://doi.org/10.1145/3411764.3445782",
      "doi": "10.1145/3411764.3445782"
    },
    {
      "text": "Devleena Das and Sonia Chernova. 2020. Leveraging rationales to improve human task performance. In International Conference on Intelligent User Interfaces, Proceedings IUI. 510–518. https://doi.org/10.1145/3377325.3377512 arxiv:2002.04202",
      "doi": "10.1145/3377325.3377512"
    },
    {
      "text": "Roelof A J de Vries, Khiet P Truong, Sigrid Kwint, Constance H C Drossaert, and Vanessa Evers. 2016. Crowd-Designed Motivation: Motivational Messages for Exercise Adherence Based on Behavior Change Theory Roelof. In CHI 2016. ACM, 297–308. https://doi.org/10.1145/2858036.2858229",
      "doi": ""
    },
    {
      "text": "Jacob Devlin, Ming Wei Chang, Kenton Lee, and Kristina Toutanova. 2018. BERT: Pre-training of deep bidirectional transformers for language understanding. arXiv preprint 1810.04805(2018). arxiv:1810.04805",
      "doi": ""
    },
    {
      "text": "Michael R.P. Dougherty, Charles F. Gettys, and Eve E. Ogden. 1999. MINERVA-DM: A memory processes model for judgments of likelihood. Psychological Review(1999). https://doi.org/10.1037/0033-295X.106.1.180",
      "doi": ""
    },
    {
      "text": "Steven Dow, Anand Kulkarni, Scott Klemmer, and Björn Hartmann. 2012. Shepherding the crowd yields better work. In CSCW 2012. ACM, 1013–1022. https://doi.org/10.1145/2145204.2145355",
      "doi": "10.1145/2145204.2145355"
    },
    {
      "text": "Steven P. Dow, Alana Glassco, Jonathan Kass, Melissa Schwarz, Daniel L. Schwartz, and Scott R. Klemmer. 2010. Parallel prototyping leads to better design results, more divergence, and increased self-efficacy. ACM Transactions on Computer-Human Interaction 17, 4(2010). https://doi.org/10.1145/1879831.1879836",
      "doi": "10.1145/1879831.1879836"
    },
    {
      "text": "Steven P. Dow, Kate Heddleston, and Scott R. Klemmer. 2009. The efficacy of prototyping under time constraints. In Proceedings of the 2009 ACM SIGCHI Conference on Creativity and Cognition. 165–174. https://doi.org/10.1145/1640233.1640260",
      "doi": "10.1145/1640233.1640260"
    },
    {
      "text": "Alejandra Duque-Estrada. 2014. Voyant: Generating Structured Feedback on Visual Designs Using a Crowd of Non-Experts. In CSCW 2014. 1433–1444. https://doi.org/10.5377/cultura.v24i74.8893",
      "doi": ""
    },
    {
      "text": "Upol Ehsan, Brent Harrison, Larry Chan, and Mark O. Riedl. 2018. Rationalization: A Neural Machine Translation Approach to Generating Natural Language Explanations. AIES 2018 - Proceedings of the 2018 AAAI/ACM Conference on AI, Ethics, and Society (2018), 81–87. https://doi.org/10.1145/3278721.3278736 arxiv:1702.07826",
      "doi": "10.1145/3278721.3278736"
    },
    {
      "text": "Jonas Frich, Lindsay MacDonald Vermeulen, Christian Remy, Michael Mose Biskjaer, and Peter Dalsgaard. 2019. Mapping the Landscape of Creativity Support Tools in HCI. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems - CHI ’19. ACM Press, New York, New York, USA, 1–18. https://doi.org/10.1145/3290605.3300619",
      "doi": "10.1145/3290605.3300619"
    },
    {
      "text": "Jonas Frich, Michael Mose Biskjaer, and Peter Dalsgaard. 2018. Twenty Years of Creativity Research in Human-Computer Interaction: Current State and Future Directions. In Proceedings of the 2018 Designing Interactive Systems Conference(DIS ’18). Association for Computing Machinery, New York, NY, USA, 1235–1257. https://doi.org/10.1145/3196709.3196732",
      "doi": "10.1145/3196709.3196732"
    },
    {
      "text": "Mahak Gambhir and Vishal Gupta. 2017. Recent automatic text summarization techniques: a survey. Artificial Intelligence Review 47, 1 (2017), 1–66. https://doi.org/10.1007/s10462-016-9475-9",
      "doi": "10.1007/s10462-016-9475-9"
    },
    {
      "text": "Katy Ilonka Gero and Lydia B Chilton. 2019. Metaphoria: An Algorithmic Companion for Metaphor Creation. In CHI ’19. 1–12.",
      "doi": "10.1145/3290605.3300526"
    },
    {
      "text": "Vinod Goel. 2010. Neural basis of thinking: Laboratory problems versus real-world problems. Wiley Interdisciplinary Reviews: Cognitive Science (2010). https://doi.org/10.1002/wcs.71",
      "doi": ""
    },
    {
      "text": "Adam E. Green, David J.M. Kraemer, Jonathan A. Fugelsang, Jeremy R. Gray, and Kevin N. Dunbar. 2012. Neural correlates of creativity in analogical reasoning. Journal of Experimental Psychology: Learning Memory and Cognition (2012). https://doi.org/10.1037/a0025764",
      "doi": ""
    },
    {
      "text": "John Hattie and Helen Timperley. 2007. The power of feedback. Review of Educational Research 77, 1 (2007), 81–112. https://doi.org/10.3102/003465430298487",
      "doi": ""
    },
    {
      "text": "Simo Hosio, Niels van Berkel, Jonas Oppenlaender, and Joorge Goncalves. 2020. Crowdsourcing Personalized Weight Loss Diets. ComputerJanuary(2020), 63–71. https://doi.org/10.1109/MC.2019.2902542",
      "doi": ""
    },
    {
      "text": "Gaoping Huang and Alexander J Quinn. 2017. BlueSky: Crowd-Powered Uniform Sampling of Idea Spaces. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition. Association for Computing Machinery, New York, NY, USA, 119–130. https://doi.org/10.1145/3059454.3059481",
      "doi": "10.1145/3059454.3059481"
    },
    {
      "text": "L. Robin Keller and Joanna L. Ho. 1988. Decision Problem Structuring: Generating Options. IEEE Transactions on Systems, Man and Cybernetics (1988). https://doi.org/10.1109/21.21599",
      "doi": ""
    },
    {
      "text": "Been Kim, Martin Wattenberg, Justin Gilmer, Carrie Cai, James Wexler, Fernanda Viegas, and Rory Sayres. 2018. Interpretability beyond feature attribution: Quantitative Testing with Concept Activation Vectors (TCAV). In 35th International Conference on Machine Learning, ICML 2018, Vol. 6. 4186–4195. arxiv:1711.11279",
      "doi": ""
    },
    {
      "text": "Ana Cristina Bicharra Klein, Mark, and Garcia. 2015. High-speed idea filtering with the bag of lemons. Decision Support Systems 78 (2015), 39–50. https://doi.org/10.1016/j.dss.2015.06.005",
      "doi": "10.1016/j.dss.2015.06.005"
    },
    {
      "text": "Janin Koch, Nicolas Taffin, Michel Beaudouin-Lafon, Markku Laine, Andrés Lucero, and Wendy E. MacKay. 2020. ImageSense: An Intelligent Collaborative Ideation Tool to Support Diverse Human-Computer Partnerships. Proceedings of the ACM on Human-Computer Interaction 4, CSCW1(2020), 1–27. https://doi.org/10.1145/3392850",
      "doi": "10.1145/3392850"
    },
    {
      "text": "Rafal Kocielnik and Gary Hsieh. 2017. Send Me a Different Message: Utilizing Cognitive Space to Create Engaging Message Triggers. In CSCW. 2193–2207. https://doi.org/10.1145/2998181.2998324",
      "doi": ""
    },
    {
      "text": "Brian Y. Lim and Anind K. Dey. 2011. Design of an intelligible mobile context-aware application. Mobile HCI 2011 - 13th International Conference on Human-Computer Interaction with Mobile Devices and Services(2011), 157–166. https://doi.org/10.1145/2037373.2037399",
      "doi": ""
    },
    {
      "text": "Brian Y. Lim and Anind K. Dey. 2013. Evaluating intelligibility usage and usefulness in a context-aware application. In International Conference on Human-Computer Interaction. 92–101. https://doi.org/10.1007/978-3-642-39342-6_11",
      "doi": ""
    },
    {
      "text": "Brian Y Lim, Anind K Dey, and Daniel Avrahami. 2009. Why and Why Not Explanations Improve the Intelligibility of Context-Aware Intelligent Systems. In CHI 2009. 2119–2128. http://www.cs.cmu.edu/$$byl/publications/lim_chi09.pdf",
      "doi": ""
    },
    {
      "text": "Edwin A. Locke and Gary P. Latham. 1990. A theory of goal setting & task performance. Prentice-Hall, Inc.",
      "doi": ""
    },
    {
      "text": "Edwin a Locke and Gary P Latham. 2002. Building a practically useful theory of goal setting and task motivation. A 35-year odyssey.The American psychologist 57, 9 (2002), 705–717. https://doi.org/10.1037/0003-066X.57.9.705",
      "doi": ""
    },
    {
      "text": "Ryan Louie, Andy Coenen, Cheng Zhi Huang, Michael Terry, and Carrie J Cai. 2020. Novice-AI Music Co-Creation via AI-Steering Tools for Deep Generative Models. In CHI 2020. 1–13. https://doi.org/10.1145/3313831.3376739",
      "doi": "10.1145/3313831.3376739"
    },
    {
      "text": "Todd I Lubart. 2001. Models of the creative process: Past, present and future. Creativity research journal 13, 3-4 (2001), 295–308. https://doi.org/10.1207/S15326934CRJ1334_07",
      "doi": ""
    },
    {
      "text": "Scott M Lundberg and Su-In Lee. 2017. A Unified Approach to Interpreting Model Predictions. In 31st Conference on Neural Information Processing Systems (NIPS 2017). 4768–4777. https://doi.org/10.5555/3295222.3295230",
      "doi": "10.5555/3295222.3295230"
    },
    {
      "text": "Kurt Luther, Nathan Hahn, Steven P Dow, and Aniket Kittur. 2015. Crowdlines : Supporting Synthesis of Diverse Information Sources through Crowdsourced Outlines. In The Third AAAI Conference on Human Computation and Crowdsourcing (HCOMP-15). https://ojs.aaai.org/index.php/HCOMP/article/view/13239",
      "doi": ""
    },
    {
      "text": "Joke Meheus. 2000. Analogical Reasoning in Creative Problem Solving Processes: Logico-Philosophical Perspectives. In Metaphor and Analogy in the Sciences. https://doi.org/10.1007/978-94-015-9442-4_2",
      "doi": ""
    },
    {
      "text": "Tim Miller. 2019. Explanation in artificial intelligence : Insights from the social sciences. Artificial Intelligence 267 (2019), 1–38. https://doi.org/10.1016/j.artint.2018.07.007",
      "doi": ""
    },
    {
      "text": "Fabio Del Missier, Mimì Visentini, and Timo Mäntylä. 2015. Option generation in decision making: Ideation beyond memory retrieval. Frontiers in Psychology(2015). https://doi.org/10.3389/fpsyg.2014.01584",
      "doi": ""
    },
    {
      "text": "Bernard A. Nijstad and Wolfgang Stroebe. 2006. How the Group Affects the Mind: A Cognitive Model of Idea Generation in Groups. Personality and Social Psychology Review 10, 3 (aug 2006), 186–213. https://doi.org/10.1207/s15327957pspr1003_1",
      "doi": ""
    },
    {
      "text": "Bernard A. Nijstad, Wolfgang Stroebe, and Hein F.M. Lodewijkx. 2002. Cognitive stimulation and interference in groups: Exposure effects in an idea generation task. Journal of Experimental Social Psychology(2002). https://doi.org/10.1016/S0022-1031(02)00500-0",
      "doi": ""
    },
    {
      "text": "Chris Olah, Alexander Mordvintsev, and Ludwig Schubert. 2017. Feature Visualization. Distill (2017). https://doi.org/10.23915/distill.00007",
      "doi": ""
    },
    {
      "text": "Jonas Oppenlaender and Simo Hosio. 2019. Design Recommendations for Augmenting Creative Tasks with Computational Priming. In Proceedings of the 18th International Conference on Mobile and Ubiquitous Multimedia(MUM ’19). Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3365610.3365621",
      "doi": "10.1145/3365610.3365621"
    },
    {
      "text": "Jonas Oppenlaender and Simo Hosio. 2019. Supporting Creative Work with Crowd Feedback Systems. In DC2S2 ’19:Workshop on Designing Crowd-powered Creativity Support Systems. arxiv:arXiv:2004.09204v1",
      "doi": ""
    },
    {
      "text": "Jonas Oppenlaender and Elina Kuosmanen. 2021. Hardhats and bungaloos: Comparing crowdsourced design feedback with peer design feedback in the classroom. CHI ’21 (2021). https://doi.org/10.1145/3411764.3445380",
      "doi": ""
    },
    {
      "text": "Jonas Oppenlaender, Thanassis Tiropanis, and Simo Hosio. 2020. CrowdUI : Supporting Web Design with the Crowd. Proc. ACM Hum.-Comput. Interact. 4, EICS (2020). https://doi.org/10.1145/3394978",
      "doi": "10.1145/3394978"
    },
    {
      "text": "Zhenhui Peng, Qingyu Guo, Ka Wing Tsang, and Xiaojuan Ma. 2020. Exploring the Effects of Technological Writing Assistance for Support Providers in Online Mental Health Community. In CHI ’20. 1–15. https://doi.org/10.1145/3313831.3376695",
      "doi": ""
    },
    {
      "text": "Fabio Petroni, Tim Rocktäschel, Patrick Lewis, Anton Bakhtin, Yuxiang Wu, Alexander H. Miller, and Sebastian Riedel. 2020. Language models as knowledge bases?EMNLP-IJCNLP 2019 - 2019 Conference on Empirical Methods in Natural Language Processing and 9th International Joint Conference on Natural Language Processing, Proceedings of the Conference(2020), 2463–2473. https://doi.org/10.18653/v1/d19-1250 arxiv:1909.01066",
      "doi": ""
    },
    {
      "text": "Arkalgud Ramaprasad. 1983. On the definition of feedback. Behavioral Science 28, 1 (1983), 4–13. https://doi.org/10.1002/bs.3830280103",
      "doi": ""
    },
    {
      "text": "Marco Tulio Ribeiro, Sameer Singh, and Carlos Guestrin. 2016. “Why Should I Trust You?” Explaining the Predictions of Any Classifier. In Proceedings of the 22nd ACM SIGKDD International Conference on Knowledge Discovery and Data Mining - KDD ’16. ACM Press, New York, New York, USA, 1135–1144. https://doi.org/10.1145/2939672.2939778",
      "doi": "10.1145/2939672.2939778"
    },
    {
      "text": "Matthew Richardson, Amit Prakash, and Eric Brill. 2006. Beyond PageRank: Machine learning for static ranking. In Proceedings of the 15th International Conference on World Wide Web. 707–715. https://doi.org/10.1145/1135777.1135881",
      "doi": "10.1145/1135777.1135881"
    },
    {
      "text": "C. Riedl, I. Blohm, J. M. Leimeister, and H. Krcmar. 2010. Rating scales for collective intelligence in innovation communities: Why quick and easy decision making does not get it right. In Thirty First International Conference on Information Systems. https://papers.ssrn.com/sol3/papers.cfm?abstract_id=1714524",
      "doi": ""
    },
    {
      "text": "Ramprasaath R. Selvaraju, Michael Cogswell, Abhishek Das, Ramakrishna Vedantam, Devi Parikh, and Dhruv Batra. 2020. Grad-CAM: Visual Explanations from Deep Networks via Gradient-Based Localization. International Journal of Computer Vision 128, 2 (2020), 336–359. https://doi.org/10.1007/s11263-019-01228-7 arxiv:1610.02391",
      "doi": "10.1007/s11263-019-01228-7"
    },
    {
      "text": "Pararth Shah, Dilek Hakkani-Tür, Gokhan Tür, Abhinav Rastogi, Ankur Bapna, Neha Nayak, and Larry Heck. 2018. Building a conversational agent overnight with dialogue self-play. arXiv preprint arXiv:1801.04871(2018).",
      "doi": ""
    },
    {
      "text": "Ben Shneiderman. 2007. CREATIVITY SUPPORT TOOLS:Accelerating Discovery and Innovation. Commun. ACM 50, 12 (2007), 20–32. http://dl.acm.org/citation.cfm?id=1323689",
      "doi": "10.1145/1323688.1323689"
    },
    {
      "text": "Pao Siangliulue, Kenneth C Arnold, Krzysztof Z Gajos, and Steven P Dow. 2015. Toward Collaborative Ideation at Scale-Leveraging Ideas from Others to Generate More Creative and Diverse Ideas. In CSCW. https://doi.org/10.1145/2675133.2675239",
      "doi": ""
    },
    {
      "text": "Pao Siangliulue, Joel Chan, Steven P Dow, and Krzysztof Z Gajos. 2016. IdeaHound: Improving Large-scale Collaborative Ideation with Crowd-Powered Real-time Semantic Modeling. In UIST 2016 - Proceedings of the 29th Annual Symposium on User Interface Software and Technology(UIST ’16). ACM, 609–624. https://doi.org/10.1145/2984511.2984578",
      "doi": ""
    },
    {
      "text": "Steven M. Smith. 2010. The Constraining Effects of Initial Ideas. In Group Creativity: Innovation through Collaboration. https://doi.org/10.1093/acprof:oso/9780195147308.003.0002",
      "doi": ""
    },
    {
      "text": "Robert Speer, Joshua Chin, and Catherine Havasi. 2017. Conceptnet 5.5: An open multilingual graph of general knowledge. In AAAI ’17). 4444–4451. https://doi.org/10.5555/3298023.3298212",
      "doi": ""
    },
    {
      "text": "Mukund Sundararajan, Ankur Taly, and Qiqi Yan. 2017. Axiomatic attribution for deep networks. In 34th International Conference on Machine Learning, ICML 2017, Vol. 7. 5109–5118. https://doi.org/10.5555/3305890.3306024",
      "doi": "10.5555/3305890.3306024"
    },
    {
      "text": "Chun Hua Tsai, Yue You, Xinning Gui, Yubo Kou, and John M. Carroll. 2021. Exploring and promoting diagnostic transparency and explainability in online symptom checkers. In CHI ’21. https://doi.org/10.1145/3411764.3445101",
      "doi": ""
    },
    {
      "text": "Joe Tullio, Anind K. Dey, Jason Chalecki, and James Fogarty. 2007. How it works: a field study of non-technical users interacting with an intelligent system. In CHI 2007. 31–40. https://doi.org/10.1145/1240624.1240630",
      "doi": "10.1145/1240624.1240630"
    },
    {
      "text": "Kurt Vanlehn, Randolph M Jones, Michelene T H Chi, Kurt Vanlehn, Randolph M Jones, and Michelene T H Chi. 2016. A Model of the Self-Explanation Effect A Model of the Self-Explanation Effect. Journal of the Learning Sciences 8406, December (2016), 1–59. http://www.tandfonline.com/doi/abs/10.1207/s15327809jls0201_1",
      "doi": ""
    },
    {
      "text": "Ashish Vaswani, Noam Shazeer, Niki Parmar, Jakob Uszkoreit, Llion Jones, Aidan N. Gomez, Lukasz Kaiser, and Illia Polosukhin. 2017. Attention Is All You Need. In NIPS 2017. https://doi.org/10.1109/2943.974352",
      "doi": ""
    },
    {
      "text": "Danding Wang, Qian Yang, Ashraf Abdul, and Brian Y Lim. 2019. Designing Theory-Driven User-Centric Explainable AI. In CHI ’19. https://doi.org/10.1145/3290605.3300831",
      "doi": ""
    },
    {
      "text": "Kai Wang and Jeffrey V. Nickerson. 2017. A literature review on individual creativity support systems. Computers in Human Behavior 74 (2017), 139–151. https://doi.org/10.1016/j.chb.2017.04.035",
      "doi": ""
    },
    {
      "text": "Xinru Wang and Ming Yin. 2021. Are Explanations Helpful? A Comparative Study of the Effects of Explanations in AI-Assisted Decision-Making. In IUI ’21. 318–328. https://doi.org/10.1145/3397481.3450650",
      "doi": ""
    },
    {
      "text": "Jingjing Xu, Xuancheng Ren, Junyang Lin, and Xu Sun. 2018. DP-GAN: Diversity-Promoting Generative Adversarial Network for Generating Informative and Diversified Text. arXiv (2018). arxiv:1802.01345http://arxiv.org/abs/1802.01345",
      "doi": ""
    },
    {
      "text": "Kexin Bella Yang, Tomohiro Nagashima, Junhui Yao, Joseph Jay Williams, Kenneth Holstein, and Vincent Aleven. 2021. Can Crowds Customize Instructional Materials with Minimal Expert Guidance? Exploring Teacher-guided Crowdsourcing for Improving Hints in an AI-based Tutor. Proceedings of the ACM on Human-Computer Interaction 5, CSCW1(2021), 1–24. https://doi.org/10.1145/3449193",
      "doi": ""
    },
    {
      "text": "Yu-Chun Grace Yen, Steven P Dow, Elizabeth Gerber, and Brian P Bailey. 2017. Listen to Others, Listen to Yourself: Combining Feedback Review and Reflection to Improve Iterative Design. In Proceedings of the 2017 ACM SIGCHI Conference on Creativity and Cognition. ACM, New York, NY, USA, 158–170. https://doi.org/10.1145/3059454.3059468",
      "doi": "10.1145/3059454.3059468"
    },
    {
      "text": "Lixiu Yu and Jeffrey V. Nickerson. 2011. Cooks or cobblers?. In CHI 2011. 1393–1402. https://doi.org/10.1145/1978942.1979147",
      "doi": "10.1145/1978942.1979147"
    },
    {
      "text": "Wencan Zhang and Brian Y. Lim. 2022. Towards Relatable Explainable AI with the Perceptual Process. In CHI ’22. Association for Computing Machinery. https://doi.org/10.1145/3491102.3501826 arxiv:2112.14005",
      "doi": ""
    }
  ]
}