{
  "doi": "10.1145/3491102.3502050",
  "title": "“Elinor’s Talking to Me!”:Integrating Conversational AI into Children’s Narrative Science Programming",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-16",
  "year": 2022,
  "badges": [],
  "abstract": "Video programs are important, accessible educational resources for young children, especially those from an under-resourced backgrounds. These programs’ potential can be amplified if children are allowed to socially interact with media characters during their video watching. This paper presents the design and empirical investigation of interactive science-focused videos in which the main character, powered by a conversational agent, engaged in contingent conversation with children by asking children questions and providing responsive feedback. We found that children actively interacted with the media character in the conversational videos and their parents spontaneously provided support in the process. We also found that the children who watched the conversational video performed better in the immediate, episode-specific science assessment compared to their peers who watched the broadcast, non-interactive version of the same episode. Several design implications are discussed for using conversational technologies to better support child active learning and parent involvement in video watching.",
  "authors": [
    {
      "name": "Ying Xu",
      "institution": "University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659365300",
      "orcid": "missing"
    },
    {
      "name": "Valery Vigil",
      "institution": "Digital Learning Lab, University of California Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238264",
      "orcid": "missing"
    },
    {
      "name": "Andres S. Bustamante",
      "institution": "School of Education, University of California Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658664600",
      "orcid": "missing"
    },
    {
      "name": "Mark Warschauer",
      "institution": "University of California, Irvine, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81100356714",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fashina Aladé and Amy I Nathanson. 2016. What preschoolers bring to the show: The relation between viewer characteristics and children’s learning from educational television. Media Psychology 19, 3 (2016), 406–430.",
      "doi": ""
    },
    {
      "text": "Daniel R Anderson and Katherine G Hanson. 2017. Screen media and parent–child interactions. In Media exposure during infancy and early childhood. Springer, 173–194.",
      "doi": ""
    },
    {
      "text": "Paul Baxter, Emily Ashurst, Robin Read, James Kennedy, and Tony Belpaeme. 2017. Robot education peers in a situated primary school study: Personalisation promotes child learning. PloS one 12, 5 (2017), e0178126.",
      "doi": ""
    },
    {
      "text": "Erin Beneteau, Olivia K Richards, Mingrui Zhang, Julie A Kientz, Jason Yip, and Alexis Hiniker. 2019. Communication breakdowns between families and Alexa. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3290605.3300473"
    },
    {
      "text": "James Alex Bonus and Marie-Louise Mares. 2018. When the sun sings science, are children left in the dark? Representations of science in children’s television and their effects on children’s learning. Human Communication Research 44, 4 (2018), 449–472.",
      "doi": ""
    },
    {
      "text": "Cynthia Breazeal, Paul L Harris, David DeSteno, Jacqueline M Kory Westlund, Leah Dickens, and Sooyeon Jeong. 2016. Young children treat robots as informants. Topics in cognitive science 8, 2 (2016), 481–491.",
      "doi": ""
    },
    {
      "text": "Rodger W Bybee. 2014. NGSS and the next generation of science teachers. Journal of science teacher education 25, 2 (2014), 211–221.",
      "doi": ""
    },
    {
      "text": "Sandra L Calvert, Marisa M Putnam, Naomi R Aguiar, Rebecca M Ryan, Charlotte A Wright, Yi Hui Angella Liu, and Evan Barba. 2019. Young Children’s Mathematical Learning From Intelligent Characters. Child Development (2019).",
      "doi": ""
    },
    {
      "text": "Sandra L Calvert, Marisa M Putnam, Naomi R Aguiar, Rebecca M Ryan, Charlotte A Wright, Yi Hui Angella Liu, and Evan Barba. 2020. Young children’s mathematical learning from intelligent characters. Child development 91, 5 (2020), 1491–1508.",
      "doi": ""
    },
    {
      "text": "Sandra L Calvert, Melissa N Richards, A Jordon, and D Romer. 2014. Children’s parasocial relationships. Media and the well-being of children and adolescents (2014), 187–200.",
      "doi": ""
    },
    {
      "text": "Sandra L Calvert, Bonnie L Strong, Eliza L Jacobs, and Emily E Conger. 2007. Interaction and participation for young Hispanic and Caucasian girls’ and boys’ learning of media content. Media Psychology 9, 2 (2007), 431–445.",
      "doi": ""
    },
    {
      "text": "Katja F Cantone. 2007. Code-switching in bilingual children. Vol. 296. Springer.",
      "doi": ""
    },
    {
      "text": "Elizabeth J Carter, Jennifer Hyde, and Jessica K Hodgins. 2017. Investigating the Effects of Interactive Features for Preschool Television Programming. In Proceedings of the 2017 Conference on Interaction Design and Children. 97–106.",
      "doi": "10.1145/3078072.3079717"
    },
    {
      "text": "Justine Cassell and Kimiko Ryokai. 2001. Making space for voice: Technologies to support children’s fantasy and storytelling. Personal and ubiquitous computing 5, 3 (2001), 169–190.",
      "doi": ""
    },
    {
      "text": "Yi Cheng, Kate Yen, Yeqi Chen, Sijin Chen, and Alexis Hiniker. 2018. Why doesn’t it work? voice-driven interfaces and young children’s communication repair strategies. In Proceedings of the 17th ACM Conference on Interaction Design and Children. 337–348.",
      "doi": "10.1145/3202185.3202749"
    },
    {
      "text": "Elaine M Crowder and Denis Newman. 1993. Telling what they know: The role of gesture and language in children’s science explanations. Pragmatics & Cognition 1, 2 (1993), 341–376.",
      "doi": ""
    },
    {
      "text": "Griffin Dietz, Jimmy K Le, Nadin Tamer, Jenny Han, Hyowon Gweon, Elizabeth L Murnane, and James A Landay. 2021. StoryCoder: Teaching Computational Thinking Concepts Through Storytelling in a Voice-Guided App for Children. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–15.",
      "doi": "10.1145/3411764.3445039"
    },
    {
      "text": "Griffin Dietz, Zachary Pease, Brenna McNally, and Elizabeth Foss. 2020. Giggle gauge: a self-report instrument for evaluating children’s engagement with technology. In Proceedings of the Interaction Design and Children Conference. 614–623.",
      "doi": ""
    },
    {
      "text": "Steffi Domagk, Ruth N Schwartz, and Jan L Plass. 2010. Interactivity in multimedia learning: An integrated model. Computers in Human Behavior 26, 5 (2010), 1024–1033.",
      "doi": "10.1016/j.chb.2010.03.003"
    },
    {
      "text": "Rebecca A Dore and Laura Zimmermann. 2020. Coviewing, Scaffolding, and Children’s Media Comprehension. The International encyclopedia of media psychology (2020), 1–8.",
      "doi": ""
    },
    {
      "text": "Stefania Druga, Randi Williams, Hae Won Park, and Cynthia Breazeal. 2018. How smart are the smart toys? children and parents’ agent interaction and intelligence attribution. In Proceedings of the 17th ACM Conference on Interaction Design and Children. 231–240.",
      "doi": "10.1145/3202185.3202741"
    },
    {
      "text": "Kiran Egan. 1993. Narrative and learning: A voyage of implications. Linguistics and education 5, 2 (1993), 119–126.",
      "doi": ""
    },
    {
      "text": "Stacy B Ehrlich, Susan C Levine, and Susan Goldin-Meadow. 2006. The importance of gesture in children’s spatial reasoning.Developmental psychology 42, 6 (2006), 1259.",
      "doi": ""
    },
    {
      "text": "Alison Engel, Kathryn Lucido, and Kyla Cook. 2018. Rethinking narrative: Leveraging storytelling for science learning. Childhood Education 94, 6 (2018), 4–12.",
      "doi": ""
    },
    {
      "text": "Sílvia Fernandes, Jorge Abreu, Pedro Almeida, and Rita Santos. 2018. A Review of Voice User Interfaces for Interactive TV. In Iberoamerican Conference on Applications and Usability of Interactive TV. Springer, 115–128.",
      "doi": ""
    },
    {
      "text": "Natalie Anne Freed. 2012. ” This is the fluffy robot that only speaks french”: language use between preschoolers, their families, and a social robot while sharing virtual toys. Ph.D. Dissertation. Massachusetts Institute of Technology.",
      "doi": ""
    },
    {
      "text": "Andrew Gambino, Jesse Fox, and Rabindra A Ratan. 2020. Building a stronger CASA: Extending the computers are social actors paradigm. Human-Machine Communication 1, 1 (2020), 5.",
      "doi": ""
    },
    {
      "text": "Radhika Garg and Subhasree Sengupta. 2020. Conversational Technologies for In-home Learning: Using Co-Design to Understand Children’s and Parents’ Perspectives. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376631"
    },
    {
      "text": "Radhika Garg and Subhasree Sengupta. 2020. He Is Just Like Me: A Study of the Long-Term Use of Smart Speakers by Parents and Children. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 4, 1 (2020), 1–24.",
      "doi": "10.1145/3381002"
    },
    {
      "text": "Caroline Gaudreau, Yemimah A King, Rebecca A Dore, Hannah Puttre, Deborah Nichols, Kathy Hirsh-Pasek, and Roberta Michnick Golinkoff. 2020. Preschoolers benefit equally from video chat, pseudo-contingent video, and live book reading: implications for storytime during the coronavirus pandemic and beyond. Frontiers in Psychology 11 (2020), 2158.",
      "doi": ""
    },
    {
      "text": "Rochel Gelman and Kimberly Brenneman. 2004. Science learning pathways for young children. Early Childhood Research Quarterly 19, 1 (2004), 150–158.",
      "doi": ""
    },
    {
      "text": "Arthur C Graesser, Mark W Conley, and Andrew Olney. 2012. Intelligent tutoring systems.APA educational psychology handbook, Vol 3: Application to learning and teaching. (2012), 451–473.",
      "doi": ""
    },
    {
      "text": "Arthur C Graesser, Sidney D’Mello, Xiangen Hu, Zhiqiang Cai, Andrew Olney, and Brent Morgan. 2012. AutoTutor. In Applied natural language processing: Identification, investigation and resolution. IGI Global, 169–187.",
      "doi": ""
    },
    {
      "text": "Arthur C Graesser, Haiying Li, and Carol Forsyth. 2014. Learning by communicating in natural language with conversational agents. Current Directions in Psychological Science 23, 5 (2014), 374–380.",
      "doi": ""
    },
    {
      "text": "Arthur C Graesser, Kurt VanLehn, Carolyn P Rosé, Pamela W Jordan, and Derek Harter. 2001. Intelligent tutoring systems with conversational dialogue. AI magazine 22, 4 (2001), 39–39.",
      "doi": "10.5555/567363.567366"
    },
    {
      "text": "Arthur C Graesser, Katja Wiemer-Hastings, Peter Wiemer-Hastings, Roger Kreuz, Tutoring Research Group, 1999. AutoTutor: A simulation of a human tutor. Cognitive Systems Research 1, 1 (1999), 35–51.",
      "doi": "10.1016/S1389-0417%2899%2900005-4"
    },
    {
      "text": "James H Gray, Emily Reardon, and Jennifer A Kotler. 2017. Designing for parasocial relationships and learning: Linear video, interactive media, and artificial intelligence. In Proceedings of the 2017 Conference on Interaction Design and Children. 227–237.",
      "doi": "10.1145/3078072.3079736"
    },
    {
      "text": "Brenna Hassinger-Das, Andres S Bustamante, Kathy Hirsh-Pasek, and Roberta Michnick Golinkoff. 2018. Learning landscapes: Playing the way to learning and engagement in public spaces. Education Sciences 8, 2 (2018), 74.",
      "doi": ""
    },
    {
      "text": "Eduardo Hernández-Campos, Carlos R Jaimez-González, and Betzabet García-Mendoza. 2020. Interactive Mobile Applications to Support the Teaching of Reading and Writing of Spanish for Children in Primary Education.International Journal of Interactive Mobile Technologies 14, 14(2020).",
      "doi": ""
    },
    {
      "text": "Zorah Hilvert-Bruce, James T Neill, Max Sjöblom, and Juho Hamari. 2018. Social motivations of live-streaming viewer engagement on Twitch. Computers in Human Behavior 84 (2018), 58–67.",
      "doi": "10.1016/j.chb.2018.02.013"
    },
    {
      "text": "Kathy Hirsh-Pasek, Jennifer M Zosh, Roberta Michnick Golinkoff, James H Gray, Michael B Robb, and Jordy Kaufman. 2015. Putting education in “educational” apps: Lessons from the science of learning. Psychological Science in the Public Interest 16, 1 (2015), 3–34.",
      "doi": ""
    },
    {
      "text": "Sebastian Hobert and Raphael Meyer von Wolff. 2019. Say hello to your new automated tutor–a structured literature review on pedagogical conversational agents. (2019).",
      "doi": ""
    },
    {
      "text": "Bruce D Homer, Charles Raffaele, and Hamadi Henderson. 2020. Games as Playful Learning: Implications of Developmental Theory for Game-Based Learning. Handbook of Game-Based Learning, edited by Jan L. Plass, Richard E. Mayer, and Bruce D. Homer (2020), 25–52.",
      "doi": ""
    },
    {
      "text": "Alice Ann Howard Gola, Melissa N Richards, Alexis R Lauricella, and Sandra L Calvert. 2013. Building meaningful parasocial relationships between toddlers and media characters to teach early mathematical skills. Media Psychology 16, 4 (2013), 390–411.",
      "doi": ""
    },
    {
      "text": "Pirita Ihamäki and Katriina Heljakka. 2018. The internet of toys, connectedness and character-based play in early education. In Proceedings of the Future Technologies Conference. Springer, 1079–1096.",
      "doi": ""
    },
    {
      "text": "Jens F Jensen. 2008. Interactive television-a brief media history. In European Conference on Interactive Television. Springer, 1–10.",
      "doi": "10.1007/978-3-540-69478-6_1"
    },
    {
      "text": "Gabi Jerzembek and Simon Murphy. 2013. A narrative review of problem-based learning with school-aged children: implementation and outcomes. Educational Review 65, 2 (2013), 206–218.",
      "doi": ""
    },
    {
      "text": "Joan N Kaderavek, Ying Guo, and Laura M Justice. 2014. Validity of the children’s orientation to book reading rating scale. Journal of Research in Reading 37, 2 (2014), 159–178.",
      "doi": ""
    },
    {
      "text": "Robert Kalinowski, Ying Xu, and Katie Salen Tekinbaş. 2021. The ecological context of preschool-aged children’s selection of media content. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems.",
      "doi": "10.1145/3411764.3445429"
    },
    {
      "text": "Connie A Korpan, Gay L Bisanz, Jeffrey Bisanz, Conrad Boehme, and Mervyn A Lynch. 1997. What did you learn outside of school today? Using structured interviews to document home and community activities related to science and technology. Science Education 81, 6 (1997), 651–662.",
      "doi": ""
    },
    {
      "text": "Jacqueline M Kory-Westlund and Cynthia Breazeal. 2019. A long-term study of young children’s rapport, social emulation, and language learning with a peer-like robot playmate in preschool. Frontiers in Robotics and AI 6 (2019), 81.",
      "doi": ""
    },
    {
      "text": "Marina Krcmar and Drew P Cingel. 2019. Do young children really learn best from the use of direct address in children’s television?Media Psychology 22, 1 (2019), 152–171.",
      "doi": ""
    },
    {
      "text": "Alexis R Lauricella, Tiffany A Pempek, Rachel Barr, and Sandra L Calvert. 2010. Contingent computer interactions for young children’s object retrieval success. Journal of Applied Developmental Psychology 31, 5 (2010), 362–369.",
      "doi": ""
    },
    {
      "text": "Michael Sangyeob Lee, Carrie Heeter, and Robert LaRose. 2010. A modern Cinderella story: a comparison of viewer responses to interactive vs linear narrative in solitary and co-viewing settings. New Media & Society 12, 5 (2010), 779–795.",
      "doi": ""
    },
    {
      "text": "Dani Levine, Amy Pace, Rufan Luo, Kathy Hirsh-Pasek, Roberta Michnick Golinkoff, Jill de Villiers, Aquiles Iglesias, and Mary Sweig Wilson. 2020. Evaluating socioeconomic gaps in preschoolers’ vocabulary, syntax and language process skills with the Quick Interactive Language Screener (QUILS). Early Childhood Research Quarterly 50 (2020), 114–128.",
      "doi": ""
    },
    {
      "text": "Maria Luce Lupetti, Yuan Yao, Haipeng Mi, and Claudio Germak. 2017. Design for children’s playful learning with robots. Future Internet 9, 3 (2017), 52.",
      "doi": ""
    },
    {
      "text": "Betsy McCarthy, Linlin Li, Michelle Tiu, and Sara Atienza. 2013. PBS KIDS mathematics transmedia suites in preschool homes. In Proceedings of the 12th International Conference on Interaction Design and Children. 128–136.",
      "doi": "10.1145/2485760.2485777"
    },
    {
      "text": "Scott W McQuiggan, Jonathan P Rowe, Sunyoung Lee, and James C Lester. 2008. Story-based learning: The impact of narrative on learning experiences and outcomes. In International Conference on Intelligent Tutoring Systems. Springer, 530–539.",
      "doi": "10.1007/978-3-540-69132-7_56"
    },
    {
      "text": "Emily McReynolds, Sarah Hubbard, Timothy Lau, Aditya Saraf, Maya Cakmak, and Franziska Roesner. 2017. Toys that listen: A study of parents, children, and internet-connected toys. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems. 5197–5207.",
      "doi": "10.1145/3025453.3025735"
    },
    {
      "text": "Rachel E Meirson. 2020. Choose Your Own Adventure: The Future of Interactive Media. Ph.D. Dissertation. Drexel University.",
      "doi": ""
    },
    {
      "text": "Joseph E Michaelis and Bilge Mutlu. 2019. Supporting interest in science learning with a social robot. In Proceedings of the 18th ACM International Conference on Interaction Design and Children. 71–82.",
      "doi": "10.1145/3311927.3323154"
    },
    {
      "text": "Ivonne Monarca, Franceli L Cibrian, Angel Mendoza, Gillian Hayes, and Monica Tentori. 2020. Why doesn’t the conversational agent understand me? a language analysis of children speech. In Adjunct Proceedings of the 2020 ACM International Joint Conference on Pervasive and Ubiquitous Computing and Proceedings of the 2020 ACM International Symposium on Wearable Computers. 90–93.",
      "doi": ""
    },
    {
      "text": "Roxana Moreno and Richard Mayer. 2007. Interactive multimodal learning environments. Educational psychology review 19, 3 (2007), 309–326.",
      "doi": ""
    },
    {
      "text": "NGSS. 2013. Next Generation Science Standards (NGSS): The Three Dimensions of Science Learning. (2013). https://www.nextgenscience.org/",
      "doi": ""
    },
    {
      "text": "Stamatios Papadakis, Michail Kalogiannakis, and Nicholas Zaranis. 2017. Designing and creating an educational app rubric for preschool teachers. Education and Information Technologies 22, 6 (2017), 3147–3165.",
      "doi": "10.1007/s10639-017-9579-0"
    },
    {
      "text": "Bhargavi Paranjape, Yubin Ge, Zhen Bai, Jessica Hammer, and Justine Cassell. 2018. Towards automatic generation of peer-targeted science talk in curiosity-evoking virtual agent. In Proceedings of the 18th International Conference on Intelligent Virtual Agents. 71–78.",
      "doi": "10.1145/3267851.3267894"
    },
    {
      "text": "Alanna Peebles, James Alex Bonus, and Marie-Louise Mares. 2018. Questions+ answers+ agency: Interactive touchscreens and Children’s learning from a socio-emotional TV story. Computers in Human Behavior 85 (2018), 339–348.",
      "doi": ""
    },
    {
      "text": "Jessica Taylor Piotrowski. 2014. Participatory cues and program familiarity predict young children’s learning from educational television. Media Psychology 17, 3 (2014), 311–331.",
      "doi": ""
    },
    {
      "text": "Melissa N Richards and Sandra L Calvert. 2017. Measuring young US children’s parasocial relationships: Toward the creation of a child self-report survey. Journal of Children and Media 11, 2 (2017), 229–240.",
      "doi": ""
    },
    {
      "text": "Victoria Rideout. 2017. The Common Sense census: Media use by kids age zero to eight. San Francisco, CA: Common Sense Media(2017), 263–283.",
      "doi": ""
    },
    {
      "text": "Victoria Rideout and Michael Robb. 2020. The Common Sense Census: Media use by kids age zero to eight.",
      "doi": ""
    },
    {
      "text": "Sarah Roseberry, Kathy Hirsh-Pasek, and Roberta M Golinkoff. 2014. Skype me! Socially contingent interactions help toddlers learn language. Child development 85, 3 (2014), 956–970.",
      "doi": ""
    },
    {
      "text": "Sherry Ruan, Jiayu He, Rui Ying, Jonathan Burkle, Dunia Hakim, Anna Wang, Yufeng Yin, Lily Zhou, Qianyao Xu, Abdallah AbuHashem, 2020. Supporting children’s math learning with feedback-augmented narrative technology. In Proceedings of the Interaction Design and Children Conference. 567–580.",
      "doi": "10.1145/3392063.3394400"
    },
    {
      "text": "Kimiko Ryokai, Cati Vaucelle, and Justine Cassell. 2003. Virtual peers as partners in storytelling and literacy learning. Journal of computer assisted learning 19, 2 (2003), 195–208.",
      "doi": ""
    },
    {
      "text": "Preeti G Samudra, Rachel M Flynn, and Kevin M Wong. 2019. Coviewing Educational Media: Does Coviewing Help Low-Income Preschoolers Learn Auditory and Audiovisual Vocabulary Associations?AERA Open 5, 2 (2019), 2332858419853238.",
      "doi": ""
    },
    {
      "text": "Masahiro Shiomi, Takayuki Kanda, Iris Howley, Kotaro Hayashi, and Norihiro Hagita. 2015. Can a social robot stimulate science curiosity in classrooms?International Journal of Social Robotics 7, 5 (2015), 641–652.",
      "doi": ""
    },
    {
      "text": "Ian Smith, Fiona Stewart, and Phil Turner. 2004. Winky Dink and you: Determining patterns of narrative for interactive television design. In Proceedings of the second European interactive television conference: Enhancing the experience, Brighton. Citeseer, 1–10.",
      "doi": ""
    },
    {
      "text": "Catherine Snow. 1983. Literacy and language: Relationships during the preschool years. Harvard educational review 53, 2 (1983), 165–189.",
      "doi": ""
    },
    {
      "text": "Gabrielle A Strouse. 2011. Dialogic video: influence of dialogic reading techniques on preschoolers’ learning from video stories. Ph.D. Dissertation.",
      "doi": ""
    },
    {
      "text": "Gabrielle A Strouse, Katherine O’Doherty, and Georgene L Troseth. 2013. Effective coviewing: Preschoolers’ learning from video after a dialogic questioning intervention.Developmental psychology 49, 12 (2013), 2368.",
      "doi": ""
    },
    {
      "text": "Gabrielle A Strouse, Georgene L Troseth, Katherine D O’Doherty, and Megan M Saylor. 2018. Co-viewing supports toddlers’ word learning from contingent and noncontingent video. Journal of experimental child psychology 166 (2018), 310–326.",
      "doi": ""
    },
    {
      "text": "Penelope Sweetser, Daniel Johnson, Anne Ozdowska, and Peta Wyeth. 2012. Active versus passive screen time for young children. Australasian Journal of Early Childhood 37, 4 (2012), 94–98.",
      "doi": ""
    },
    {
      "text": "Georgene L Troseth, Megan M Saylor, and Allison H Archer. 2006. Young children’s use of video as a source of socially relevant information. Child development 77, 3 (2006), 786–799.",
      "doi": ""
    },
    {
      "text": "Sarah Vaala, Anna Ly, and Michael H Levine. 2015. Getting a Read on the App Stores: A Market Scan and Analysis of Children’s Literacy Apps. Full Report.. In Joan Ganz Cooney Center at Sesame Workshop. ERIC.",
      "doi": ""
    },
    {
      "text": "Rianne van den Berghe, Josje Verhagen, Ora Oudgenoeg-Paz, Sanne Van der Ven, and Paul Leseman. 2019. Social robots for language learning: A review. Review of Educational Research 89, 2 (2019), 259–295.",
      "doi": ""
    },
    {
      "text": "Radu-Daniel Vatavu, Pejman Saeghe, Teresa Chambel, Vinoba Vinayagamoorthy, and Marian F Ursu. 2020. Conceptualizing Augmented Reality Television for the Living Room. In ACM International Conference on Interactive Media Experiences. 1–12.",
      "doi": ""
    },
    {
      "text": "Peter Vorderer, Silvia Knobloch, and Holger Schramm. 2001. Does entertainment suffer from interactivity? The impact of watching an interactive TV movie on viewers’ experience of entertainment. Media Psychology 3, 4 (2001), 343–363.",
      "doi": ""
    },
    {
      "text": "Wayne Ward, Ronald Cole, Daniel Bolanos, Cindy Buchenroth-Martin, Edward Svirsky, Sarel Van Vuuren, Timothy Weston, Jing Zheng, and Lee Becker. 2011. My science tutor: A conversational multimedia virtual tutor for elementary school science. ACM Transactions on Speech and Language Processing (TSLP) 7, 4(2011), 1–29.",
      "doi": "10.1145/1998384.1998392"
    },
    {
      "text": "Nicola Whitton. 2018. Playful learning: tools, techniques, and tactics. Research in Learning Technology 26 (2018).",
      "doi": ""
    },
    {
      "text": "Ying Xu, Joseph Aubele, Valery Vigil, Andres S. Bustamante, Young-Suk Kim, and Mark Warschauer. [n.d.]. Dialogue with a conversational agent promotes children’s story comprehension via enhancing engagement. Child Development n/a, n/a ([n. d.]). https://doi.org/10.1111/cdev.13708",
      "doi": ""
    },
    {
      "text": "Ying Xu, Stacy Branham, Xinwei Deng, Penelope Collins, and Mark Warschauer. 2021. Are Current Voice Interfaces Designed to Support Children’s Language Development?. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–12.",
      "doi": "10.1145/3411764.3445271"
    },
    {
      "text": "Ying Xu and Mark Warschauer. 2019. Young children’s reading and learning with conversational agents. In Extended Abstracts of the 2019 CHI Conference on Human Factors in Computing Systems. 1–8.",
      "doi": "10.1145/3290607.3299035"
    },
    {
      "text": "Ying Xu and Mark Warschauer. 2020. Exploring young children’s engagement in joint reading with a conversational agent. In Proceedings of the Interaction Design and Children Conference. 216–228.",
      "doi": "10.1145/3392063.3394417"
    },
    {
      "text": "Ying Xu and Mark Warschauer. 2020. What Are You Talking To?: Understanding Children’s Perceptions of Conversational Agents. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13.",
      "doi": "10.1145/3313831.3376416"
    }
  ]
}