{
  "doi": "10.1145/3491102.3517630",
  "title": "Visualization Accessibility in the Wild: Challenges Faced by Visualization Designers",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-19",
  "year": 2022,
  "badges": [],
  "abstract": "Data visualizations are now widely used across many disciplines. However, many of them are not easily accessible for visually impaired people. In this work, we use three-staged mixed methods to understand the current practice of accessible visualization design for visually impaired people. We analyzed 95 visualizations from various venues to inspect how they are made inaccessible. To understand the rationale and context behind the design choices, we also conducted surveys with 144 practitioners in the U.S. and follow-up interviews with ten selected survey participants. Our findings include the difficulties of handling modern complex and interactive visualizations and the lack of accessibility support from visualization tools in addition to personal and organizational factors making it challenging to perform accessible design practices.",
  "authors": [
    {
      "name": "Shakila Cherise S Joyner",
      "institution": "Computer Science, Boston College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238809",
      "orcid": "missing"
    },
    {
      "name": "Amalia Riegelhuth",
      "institution": "Computer Science, Boston College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660235499",
      "orcid": "missing"
    },
    {
      "name": "Kathleen Garrity",
      "institution": "Computer Science, Boston College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234814",
      "orcid": "missing"
    },
    {
      "name": "Yea-Seul Kim",
      "institution": "Computer Sciences, University of Wisconsin-Madison, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660240335",
      "orcid": "0000-0003-1854-1537"
    },
    {
      "name": "Nam Wook Kim",
      "institution": "Computer Science, Boston College, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658701264",
      "orcid": "0000-0003-4899-6671"
    }
  ],
  "references": [
    {
      "text": "Cengiz Acartürk, Özge Alaçam, and Christopher Habel. 2014. Developing a Verbal Assistance System for Line Graph Comprehension. In Proceedings of the Third International Conference on Design, User Experience, and Usability. User Experience Design for Diverse Interaction Platforms and Environments - Volume 8518. Springer-Verlag, Berlin, Heidelberg, 373–382. https://doi.org/10.1007/978-3-319-07626-3_34",
      "doi": "10.1007/978-3-319-07626-3_34"
    },
    {
      "text": "Patricia Acosta-Vargas, Luis Antonio Salvador-Ullauri, and Sergio Luján-Mora. 2019. A Heuristic Method to Evaluate Web Accessibility for Users With Low Vision. IEEE Access 7(2019), 125634–125648. https://doi.org/10.1109/ACCESS.2019.2939068",
      "doi": ""
    },
    {
      "text": "Internet Archive. [n.d.]. Wayback Machine. https://archive.org/web/. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "H. K. Ault, J. W. Deloge, R. W. Lapp, M. J. Morgan, and J. R. Barnett. 2002. Evaluation of Long Descriptions of Statistical Graphics for Blind and Low Vision Web Users. In Proceedings of the 8th International Conference on Computers Helping People with Special Needs(ICCHP ’02). Springer-Verlag, Berlin, Heidelberg, 517–526. https://doi.org/10.5555/646269.684495",
      "doi": "10.5555/646269.684495"
    },
    {
      "text": "Rakesh Babu, Rahul Singh, and Jai Ganesh. 2010. Understanding blind users’ Web accessibility and usability problems. AIS Transactions on Human-Computer Interaction 2, 3(2010), 73–94. https://doi.org/10.12691/ajis-2-2-2",
      "doi": ""
    },
    {
      "text": "Jeffrey P. Bigham, Anna C. Cavender, Jeremy T. Brudvik, Jacob O. Wobbrock, and Richard E. Ladner. 2007. WebinSitu: A Comparative Analysis of Blind and Sighted Browsing Behavior. In In Proceedings of the 9th International ACM SIGACCESS Conference on Computers and Accessibility (ASSETS ’07. https://doi.org/10.1.1.119.2417",
      "doi": "10.1145/1296843.1296854"
    },
    {
      "text": "Jeffrey P Bigham, Ryan S Kaminsky, Richard E Ladner, Oscar M Danielsson, and Gordon L Hempton. 2006. WebInSight: making web images accessible. In Proceedings of the 8th International ACM SIGACCESS Conference on Computers and Accessibility. 181–188.",
      "doi": "10.1145/1168987.1169018"
    },
    {
      "text": "Jeffrey P. Bigham, Irene Lin, and Saiph Savage. 2017. The Effects of ”Not Knowing What You Don’t Know” on Web Accessibility for Blind Web Users. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility (Baltimore, Maryland, USA) (ASSETS ’17). Association for Computing Machinery, New York, NY, USA, 101–109. https://doi.org/10.1145/3132525.3132533",
      "doi": "10.1145/3132525.3132533"
    },
    {
      "text": "Michelle A Borkin, Zoya Bylinskii, Nam Wook Kim, Constance May Bainbridge, Chelsea S Yeh, Daniel Borkin, Hanspeter Pfister, and Aude Oliva. 2015. Beyond memorability: Visualization recognition and recall. IEEE transactions on visualization and computer graphics 22, 1(2015), 519–528. https://doi.org/10.1109/TVCG.2015.2467732",
      "doi": ""
    },
    {
      "text": "Yevgen Borodin, Jeffrey P. Bigham, Glenn Dausch, and I. V. Ramakrishnan. 2010. More than Meets the Eye: A Survey of Screen-Reader Browsing Strategies. In Proceedings of the 2010 International Cross Disciplinary Conference on Web Accessibility (W4A)(Raleigh, North Carolina) (W4A ’10). Association for Computing Machinery, New York, NY, USA, Article 13, 10 pages. https://doi.org/10.1145/1805986.1806005",
      "doi": "10.1145/1805986.1806005"
    },
    {
      "text": "Rupert RA Bourne, Seth R Flaxman, Tasanee Braithwaite, Maria V Cicinelli, Aditi Das, Jost B Jonas, Jill Keeffe, John H Kempen, Janet Leasher, Hans Limburg, 2017. Magnitude, temporal trends, and projections of the global prevalence of blindness and distance and near vision impairment: a systematic review and meta-analysis. The Lancet Global Health 5, 9 (2017), e888–e897. https://doi.org/10.1016/S2214-109X(17)30293-0",
      "doi": ""
    },
    {
      "text": "Maria Claudia Buzzi, Marina Buzzi, Barbara Leporini, Giulio Mori, and Victor MR Penichet. 2010. Accessing Google docs via screen reader. In International Conference on Computers for Handicapped Persons. Springer, 92–99. https://doi.org/10.1007/978-3-642-14097-6_17",
      "doi": ""
    },
    {
      "text": "Silvia Canelón and Elizabeth Hare. 2021. Revealing Room for Improvement in Accessibility within a Social Media Data Visualization Learning Community. https://doi.org/10.5281/zenodo.4743271 The goal of this talk for csv,conf,v6 was to share our findings after scraping the alternative (alt) text from data visualization tweets shared as part of the TidyTuesday online learning community. Repository: https://github.com/spcanelon/csvConf2021.",
      "doi": ""
    },
    {
      "text": "Ji Young Cho and Eun-Hee Lee. 2014. Reducing confusion about grounded theory and qualitative content analysis: Similarities and differences.Qualitative Report 19, 32 (2014). https://doi.org/10.46743/2160-3715/2014.1028",
      "doi": ""
    },
    {
      "text": "Jinho Choi, Sanghun Jung, Deok Gun Park, Jaegul Choo, and Niklas Elmqvist. 2019. Visualizing for the Non-Visual: Enabling the Visually Impaired to Use Visualization. In Computer Graphics Forum, Vol. 38. Wiley Online Library, 249–260. https://doi.org/10.1111/cgf.13686",
      "doi": ""
    },
    {
      "text": "Stephen H. Choi and Bruce N. Walker. 2010. Digitizer Auditory Graph: Making Graphs Accessible to the Visually Impaired. In CHI ’10 Extended Abstracts on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 3445–3450. https://doi.org/10.1145/1753846.1753999",
      "doi": ""
    },
    {
      "text": "Robert F. Cohen, Arthur Meacham, and Joelle Skaff. 2006. Teaching Graphs to Visually Impaired Students Using an Active Auditory Interface. SIGCSE Bull. 38, 1 (mar 2006), 279–282. https://doi.org/10.1145/1124706.1121428",
      "doi": "10.1145/1124706.1121428"
    },
    {
      "text": "The World Wide Web Consortium. [n.d.]. SVG Accessibility. https://www.w3.org/wiki/SVG_Accessibility. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "Maitraye Das, Darren Gergle, and Anne Marie Piper. 2019. ”It Doesn’t Win You Friends”: Understanding Accessibility in Collaborative Writing for People with Vision Impairments. Proc. ACM Hum.-Comput. Interact. 3, CSCW, Article 191 (nov 2019), 26 pages. https://doi.org/10.1145/3359293",
      "doi": "10.1145/3359293"
    },
    {
      "text": "Deque. [n.d.]. axe™ - The Standard in Accessibility Testing. https://www.deque.com/axe/. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "Christin Engel and Gerhard Weber. 2018. A user study to evaluate tactile charts with blind and visually impaired people. In International Conference on Computers Helping People with Special Needs. Springer, 177–184. https://doi.org/10.1007/978-3-319-94274-2_24",
      "doi": ""
    },
    {
      "text": "Glen Farrelly. 2011. Practitioner Barriers to Diffusion and Implementation of Web Accessibility. Technology and Disability 23 (01 2011), 223–232. https://doi.org/10.3233/TAD-2011-0329",
      "doi": ""
    },
    {
      "text": "Leo Ferres, Gitte Lindgaard, Livia Sumegi, and Bruce Tsuji. 2013. Evaluating a Tool for Improving Accessibility to Charts and Graphs. ACM Trans. Comput.-Hum. Interact. 20, 5, Article 28 (nov 2013), 32 pages. https://doi.org/10.1145/2533682.2533683",
      "doi": "10.1145/2533682.2533683"
    },
    {
      "text": "Sarah L. Fossheim. [n.d.]. How (not) to make accessible data visualizations, illustrated by the US presidential election.https://fossheim.io/writing/posts/accessible-dataviz-us-elections/. Online; accessed 01 December 2022.",
      "doi": ""
    },
    {
      "text": "Information Technology & Innovation Foundation. [n.d.]. Improving Accessibility of Federal Government Websites. https://itif.org/publications/2021/06/03/improving-accessibility-federal-government-websites. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Patrick Carrington, Cameron Cassidy, Meredith Ringel Morris, Kris M. Kitani, and Jeffrey P. Bigham. 2019. “It’s almost like they’re trying to hide it”: How User-Provided Image Descriptions Have Failed to Make Twitter Accessible. In The Web Conference. ACM. https://www.microsoft.com/en-us/research/publication/its-almost-like-theyre-trying-to-hide-it-how-user-provided-image-descriptions-have-failed-to-make-twiter-accessible/",
      "doi": ""
    },
    {
      "text": "Cole Gleason, Amy Pavel, Xingyu Liu, Patrick Carrington, Lydia B Chilton, and Jeffrey P Bigham. 2019. Making memes accessible. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 367–376. https://doi.org/10.1145/3308561.3353792",
      "doi": "10.1145/3308561.3353792"
    },
    {
      "text": "A Jonathan R Godfrey, Paul Murrell, and Volker Sorge. 2018. An accessible interaction model for data visualisation in statistics. In International Conference on Computers Helping People with Special Needs. Springer, 590–597. https://doi.org/10.1007/978-3-319-94277-3_92",
      "doi": ""
    },
    {
      "text": "Cagatay Goncu and Kim Marriott. 2011. GraVVITAS: Generic Multi-Touch Presentation of Accessible Graphics. In Proceedings of the 13th IFIP TC 13 International Conference on Human-Computer Interaction - Volume Part I (Lisbon, Portugal) (INTERACT’11). Springer-Verlag, Berlin, Heidelberg, 30–48. https://doi.org/10.5555/2042053.2042060",
      "doi": ""
    },
    {
      "text": "Cagatay Goncu, Kim Marriott, and John Hurst. 2010. Usability of Accessible Bar Charts. In Proceedings of the 6th International Conference on Diagrammatic Representation and Inference (Portland, OR, USA) (Diagrams’10). Springer-Verlag, Berlin, Heidelberg, 167–181. https://doi.org/10.5555/1884734.1884758",
      "doi": ""
    },
    {
      "text": "Morten Goodwin, Deniz Susar, Annika Nietzio, Mikael Snaprud, and Christian S Jensen. 2011. Global web accessibility analysis of national government portals and ministry web sites. Journal of Information Technology & Politics 8, 1 (2011), 41–67. https://doi.org/10.1080/19331681.2010.508011",
      "doi": ""
    },
    {
      "text": "DatavizA11y group. [n.d.]. Chartability. https://chartability.fizz.studio/. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "DatavizA11y group. [n.d.]. DataViz Accessibility Advocacy and Advisory Group. https://github.com/dataviza11y/Why-We-Exist. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "Darren Guinness, Annika Muehlbradt, Daniel Szafir, and Shaun K Kane. 2019. RoboGraphics: Dynamic Tactile Graphics Powered by Mobile Robots. In The 21st International ACM SIGACCESS Conference on Computers and Accessibility. 318–328. https://doi.org/10.1145/3308561.3353804",
      "doi": "10.1145/3308561.3353804"
    },
    {
      "text": "Stephanie Hackett, Bambang Parmanto, and Xiaoming Zeng. 2003. Accessibility of Internet Websites through Time. In Proceedings of the 6th International ACM SIGACCESS Conference on Computers and Accessibility (Atlanta, GA, USA) (Assets ’04). Association for Computing Machinery, New York, NY, USA, 32–39. https://doi.org/10.1145/1028630.1028638",
      "doi": ""
    },
    {
      "text": "Jeffrey Heer and Ben Shneiderman. 2012. Interactive Dynamics for Visual Analysis. Commun. ACM 55, 4 (apr 2012), 45–54. https://doi.org/10.1145/2133806.2133821",
      "doi": "10.1145/2133806.2133821"
    },
    {
      "text": "Sabine Hennig, Fritz Zobl, and Wolfgang W. Wasserburger. 2017. Accessible Web Maps for Visually Impaired Users: Recommendations and Example Solutions. Cartographic Perspectives (Nov. 2017), 6–27. https://doi.org/10.14714/CP88.1391",
      "doi": ""
    },
    {
      "text": "Highcharts. [n.d.]. Accessibility module. https://www.highcharts.com/docs/accessibility/accessibility-module. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "Web Accessibility Initiative. [n.d.]. Web Accessibility Tutorial: Complex Images. https://www.w3.org/WAI/tutorials/images/complex/. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "C. Jung, S. Mehta, A. Kulkarni, Y. Zhao, and Y. Kim. 2022. Communicating Visualizations without Visuals: Investigation of Visualization Alternative Text for People with Visual Impairments. IEEE Transactions on Visualization & Computer Graphics 28, 01 (jan 2022), 1095–1105. https://doi.org/10.1109/TVCG.2021.3114846",
      "doi": "10.1109/TVCG.2021.3114846"
    },
    {
      "text": "Inhwa Kim and Jasna Kuljis. 2010. Applying Content Analysis to Web-based Content. CIT 18 (01 2010). https://doi.org/10.2498/cit.1001924",
      "doi": ""
    },
    {
      "text": "NW Kim, SC Joyner, A Riegelhuth, and Y Kim. 2021. Accessible visualization: Design space, opportunities, and challenges. In Computer Graphics Forum, Vol. 40. Wiley Online Library, 173–188. https://doi.org/10.1111/cgf.14298",
      "doi": ""
    },
    {
      "text": "Ha-Kyung Kong, Zhicheng Liu, and Karrie Karahalios. 2018. Frames and Slants in Titles of Visualizations on Controversial Topics. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3174012",
      "doi": ""
    },
    {
      "text": "Richard E. Ladner, Melody Y. Ivory, Rajesh Rao, Sheryl Burgstahler, Dan Comden, Sangyun Hahn, Matthew Renzelmann, Satria Krisnandi, Mahalakshmi Ramasamy, Beverly Slabosky, Andrew Martin, Amelia Lacenski, Stuart Olsen, and Dmitri Groce. 2005. Automating Tactile Graphics Translation. In Proceedings of the 7th International ACM SIGACCESS Conference on Computers and Accessibility (Baltimore, MD, USA) (Assets ’05). Association for Computing Machinery, New York, NY, USA, 150–157. https://doi.org/10.1145/1090785.1090814",
      "doi": "10.1145/1090785.1090814"
    },
    {
      "text": "Megan M. Lawrence and Amy K. Lobben. 2011. The Design of Tactile Thematic Symbols. Journal of Visual Impairment & Blindness 105, 10 (2011), 681–691. https://doi.org/10.1177/0145482X1110501014",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Aaron Allen, Jason Kleinman, and Chris Malarkey. 2007. What frustrates screen reader users on the web: A study of 100 blind users. International Journal of human-computer interaction 22, 3(2007), 247–269. https://doi.org/10.1080/10447310709336964",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Suranjan Chakraborty, Dustin Carroll, Robert Weir, Bryan Sizemore, and Haley Henderson. 2013. Development and Evaluation of Two Prototypes for Providing Weather Map Data to Blind Users through Sonification. J. Usability Studies 8, 4 (aug 2013), 93–110. https://doi.org/10.5555/2817919.2817921",
      "doi": ""
    },
    {
      "text": "Bongshin Lee, Eun Kyoung Choe, Petra Isenberg, Kim Marriott, John Stasko, and Theresa-Marie Rhyne. 2020. Reaching Broader Audiences With Data Visualization. IEEE Comput. Graph. Appl. 40, 2 (mar 2020), 82–90. https://doi.org/10.1109/MCG.2020.2968244",
      "doi": "10.1109/MCG.2020.2968244"
    },
    {
      "text": "Kim Marriott, Bongshin Lee, Matthew Butler 0002, Ed Cutrell, Kirsten Ellis, Cagatay Goncu, Marti Hearst, Kathleen McCoy, and Danielle Albers Szafir. 2021. Inclusive data visualization for people with disabilities: a call to action. Interactions 28, 3 (2021), 47–51. https://doi.org/10.1145/3457875",
      "doi": "10.1145/3457875"
    },
    {
      "text": "Microsoft. [n.d.]. Overview of accessibility in Power BI. https://docs.microsoft.com/en-us/power-bi/create-reports/desktop-accessibility-overview. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "George A. Miller. 1956. The magical number seven plus or minus two: some limits on our capacity for processing information.Psychological review 63 2 (1956), 81–97. https://doi.org/10.1037/h0043158",
      "doi": ""
    },
    {
      "text": "Meredith Ringel Morris, Annuska Zolyomi, Catherine Yao, Sina Bahram, Jeffrey P. Bigham, and Shaun K. Kane. 2016. ”With Most of It Being Pictures Now, I Rarely Use It”: Understanding Twitter’s Evolving Accessibility to Blind Users. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 5506–5516. https://doi.org/10.1145/2858036.2858116",
      "doi": "10.1145/2858036.2858116"
    },
    {
      "text": "Prabodh Sakhardande, Anirudha Joshi, Charudatta Jadhav, and Manjiri Joshi. 2019. Comparing User Performance on Parallel-Tone, Parallel-Speech, Serial-Tone and Serial-Speech Auditory Graphs. In IFIP Conference on Human-Computer Interaction. Springer-Verlag, Berlin, Heidelberg, 247–266. https://doi.org/10.1007/978-3-030-29381-9_16",
      "doi": ""
    },
    {
      "text": "Ather Sharif, Sanjana Shivani Chintalapati, Jacob O. Wobbrock, and Katharina Reinecke. 2021. Understanding Screen-Reader Users’ Experiences with Online Data Visualizations. Association for Computing Machinery, New York, NY, USA. https://doi.org/10.1145/3441852.3471202",
      "doi": ""
    },
    {
      "text": "Ather Sharif and Babak Forouraghi. 2018. evoGraphs — A jQuery plugin to create web accessible graphs. In 2018 15th IEEE Annual Consumer Communications Networking Conference (CCNC). 1–4. https://doi.org/10.1109/CCNC.2018.8319239",
      "doi": "10.1109/CCNC.2018.8319239"
    },
    {
      "text": "Alexa F. Siu, Danyang Fan, Gene S-H Kim, Hrishikesh V. Rao, Xavier Vazquez, Sile O’Modhrain, and Sean Follmer. 2021. COVID-19 Highlights the Issues Facing Blind and Visually Impaired People in Accessing Data on the Web. In Proceedings of the 18th International Web for All Conference (Ljubljana, Slovenia) (W4A ’21). Association for Computing Machinery, New York, NY, USA, Article 11, 15 pages. https://doi.org/10.1145/3430263.3452432",
      "doi": "10.1145/3430263.3452432"
    },
    {
      "text": "Abigale Stangl, Meredith Ringel Morris, and Danna Gurari. 2020. ” Person, Shoes, Tree. Is the Person Naked?” What People with Vision Impairments Want in Image Descriptions. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–13. https://doi.org/10.1145/3313831.3376404",
      "doi": "10.1145/3313831.3376404"
    },
    {
      "text": "A. Strauss and J.M. Corbin. 1997. Grounded Theory in Practice. SAGE Publications. https://books.google.com.br/books?id=TtRMolAapBYC",
      "doi": ""
    },
    {
      "text": "Tableau. [n.d.]. Build Accessible Dashboards. https://help.tableau.com/current/pro/desktop/en-us/accessibility_dashboards.htm. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "Mary Frances Theofanos and Janice Redish. 2003. Guidelines for accessible and usable web sites: Observing users who work with screen readers. Interactions 10, 6 (2003), 38–51.",
      "doi": "10.1145/947226.947227"
    },
    {
      "text": "Garreth W. Tigwell, Benjamin M. Gorman, and Rachel Menzies. 2020. Emoji Accessibility for Visually Impaired People. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376267",
      "doi": "10.1145/3313831.3376267"
    },
    {
      "text": "Brianna J. Tomlinson, Jared Batterman, Yee Chieh Chew, Ashley Henry, and Bruce N. Walker. 2016. Exploring Auditory Graphing Software in the Classroom: The Effect of Auditory Graphs on the Classroom Environment. ACM Trans. Access. Comput. 9, 1, Article 3 (nov 2016), 27 pages. https://doi.org/10.1145/2994606",
      "doi": ""
    },
    {
      "text": "Márcio Josué Ramos Torres and Regina Barwaldt. 2019. Approaches for diagrams accessibility for blind people: a systematic review. In 2019 IEEE Frontiers in Education Conference (FIE). IEEE, 1–7. https://doi.org/10.1109/FIE43999.2019.9028522",
      "doi": "10.1109/FIE43999.2019.9028522"
    },
    {
      "text": "vegalite. [n.d.]. Make charts more accessible #4244. https://github.com/vega/vega-lite/issues/4244. Online; accessed 01 December 2022.",
      "doi": ""
    },
    {
      "text": "Markel Vigo and Giorgio Brajnik. 2011. Automatic web accessibility metrics: Where we are and where we can go. Interacting with Computers 23, 2 (2011), 137–155. https://doi.org/10.1016/j.intcom.2011.01.001",
      "doi": "10.1016/j.intcom.2011.01.001"
    },
    {
      "text": "Markel Vigo and Simon Harper. 2013. Coping Tactics Employed by Visually Disabled Users on the Web. Int. J. Hum.-Comput. Stud. 71, 11 (nov 2013), 1013–1025. https://doi.org/10.1016/j.ijhcs.2013.08.002",
      "doi": "10.1016/j.ijhcs.2013.08.002"
    },
    {
      "text": "W3C. [n.d.]. Resources on Alternative Text for Images. https://www.w3.org/WAI/alt/. Online; accessed 23 August 2021.",
      "doi": ""
    },
    {
      "text": "Jakub Wabiński, Albina Mościcka, and Marta Kuźma. 2020. The Information Value of Tactile Maps: A Comparison of Maps Printed with the Use of Different Techniques. The Cartographic Journal 0, 0 (2020), 1–12. https://doi.org/10.1080/00087041.2020.1721765",
      "doi": ""
    },
    {
      "text": "B. N. Walker and L. M. Mauney. 2010. Universal Design of Auditory Graphs: A Comparison of Sonification Mappings for Visually Impaired and Sighted Listeners. ACM Trans. Access. Comput. 2, 3, Article 12 (mar 2010), 16 pages. https://doi.org/10.1145/1714458.1714459",
      "doi": "10.1145/1714458.1714459"
    },
    {
      "text": "Tetsuya Watanabe and Naoki Inaba. 2018. Textures suitable for tactile bar charts on capsule paper. Transactions of the Virtual Reality Society of Japan 23, 1 (2018), 13–20. https://doi.org/10.18974/tvrsj.23.1_13",
      "doi": ""
    },
    {
      "text": "Tetsuya Watanabe and Hikaru Mizukami. 2018. Effectiveness of tactile scatter plots: comparison of non-visual data representations. In International Conference on Computers Helping People with Special Needs. Springer, 628–635. https://doi.org/10.1007/978-3-319-94277-3_97",
      "doi": ""
    },
    {
      "text": "Markus Weninger, Gerald Ortner, Tobias Hahn, Olaf Drümmer, and Klaus Miesenberger. 2015. ASVG- Accessible Scalable Vector Graphics: intention trees to make charts more accessible and usable. Journal of assistive technologies(2015). https://doi.org/10.1108/JAT-10-2015-0027",
      "doi": ""
    },
    {
      "text": "Brian Wentz, Harry Hochheiser, and Jonathan Lazar. 2013. A Survey of Blind Users on the Usability of Email Applications. Univers. Access Inf. Soc. 12, 3 (aug 2013), 327–336. https://doi.org/10.1007/s10209-012-0285-9",
      "doi": "10.1007/s10209-012-0285-9"
    },
    {
      "text": "Yalong Yang, Kim Marriott, Matthew Butler, Cagatay Goncu, and Leona Holloway. 2020. Tactile presentation of network data: Text, matrix or diagram?. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. 1–12. https://doi.org/10.1145/3313831.3376367",
      "doi": "10.1145/3313831.3376367"
    }
  ]
}