{
  "doi": "10.1145/3491102.3517533",
  "title": "”Because AI is 100% right and safe”: User Attitudes and Sources of AI Authority in India",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "Most prior work on human-AI interaction is set in communities that indicate skepticism towards AI, but we know less about contexts where AI is viewed as aspirational. We investigated the perceptions around AI systems by drawing upon 32 interviews and 459 survey respondents in India. Not only do Indian users accept AI decisions (79.2% respondents indicate acceptance), we find a case of AI authority—AI has a legitimized power to influence human actions, without requiring adequate evidence about the capabilities of the system. AI authority manifested into four user attitudes of vulnerability: faith, forgiveness, self-blame, and gratitude, pointing to higher tolerance for system misfires, and introducing potential for irreversible individual and societal harm. We urgently call for calibrating AI authority, reconsidering success metrics and responsible AI approaches and present methodological suggestions for research and deployments in India.",
  "tags": [
    "India",
    "artificial intelligence",
    "algorithmic decision-making",
    "perceptions of AI"
  ],
  "authors": [
    {
      "name": "Shivani Kapania",
      "institution": "Google Research India, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659492417",
      "orcid": "0000-0002-0152-4311"
    },
    {
      "name": "Oliver Siy",
      "institution": "Google Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659527291",
      "orcid": "missing"
    },
    {
      "name": "Gabe Clapper",
      "institution": "Google Research, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238848",
      "orcid": "missing"
    },
    {
      "name": "Azhagu Meena SP",
      "institution": "Google, India",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660234499",
      "orcid": "missing"
    },
    {
      "name": "Nithya Sambasivan",
      "institution": "Google Research India, India",
      "img": "/do/10.1145/contrib-81350582954/rel-imgonly/nithya_coorg.jpg",
      "acmid": "81350582954",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "NITI Aayog. 2018. NationalStrategy-for-AI-Discussion-Paper.pdf. https://indiaai.gov.in/documents/pdf/NationalStrategy-for-AI-Discussion-Paper.pdf. (Accessed on 12/03/2021).",
      "doi": ""
    },
    {
      "text": "NITI Aayog. 2021. Responsible-AI-22022021.pdf. https://www.niti.gov.in/sites/default/files/2021-02/Responsible-AI-22022021.pdf. (Accessed on 12/03/2021).",
      "doi": ""
    },
    {
      "text": "ACLU. 2016. Community Control Over Police Surveillance.",
      "doi": ""
    },
    {
      "text": "Microsoft Aether. 2021. Microsoft HAX Toolkit. https://www.microsoft.com/en-us/haxtoolkit/. (Accessed on 09/08/2021).",
      "doi": ""
    },
    {
      "text": "Saleema Amershi, Dan Weld, Mihaela Vorvoreanu, Adam Fourney, Besmira Nushi, Penny Collisson, Jina Suh, Shamsi Iqbal, Paul N. Bennett, Kori Inkpen, Jaime Teevan, Ruth Kikin-Gil, and Eric Horvitz. 2019. Guidelines for Human-AI Interaction. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3290605.3300233",
      "doi": "10.1145/3290605.3300233"
    },
    {
      "text": "C.W. Anderson. 2018. Apostles of Certainty: Data Journalism and the Politics of Doubt. Oxford University Press, New York, USA. https://books.google.co.in/books?id=53ZoDwAAQBAJ",
      "doi": ""
    },
    {
      "text": "Theo Araujo, Natali Helberger, Sanne Kruikemeier, and Claes H De Vreese. 2020. In AI we trust? Perceptions about automated decision-making by artificial intelligence. AI & SOCIETY 35, 3 (2020), 611–623.",
      "doi": "10.1007/s00146-019-00931-w"
    },
    {
      "text": "Payal Arora. 2016. Bottom of the data pyramid: Big data and the global south. International Journal of Communication 10 (2016), 19.",
      "doi": ""
    },
    {
      "text": "Vijay Arya, Rachel K. E. Bellamy, Pin-Yu Chen, Amit Dhurandhar, Michael Hind, Samuel C. Hoffman, Stephanie Houde, Q. Vera Liao, Ronny Luss, Aleksandra Mojsilovic, Sami Mourad, Pablo Pedemonte, Ramya Raghavendra, John T. Richards, Prasanna Sattigeri, Karthikeyan Shanmugam, Moninder Singh, Kush R. Varshney, Dennis Wei, and Yunfeng Zhang. 2019. One Explanation Does Not Fit All: A Toolkit and Taxonomy of AI Explainability Techniques. CoRR abs/1909.03012(2019), 1–18. arXiv:1909.03012http://arxiv.org/abs/1909.03012",
      "doi": ""
    },
    {
      "text": "Maryam Ashoori and Justin D. Weisz. 2019. In AI We Trust? Factors That Influence Trustworthiness of AI-infused Decision-Making Processes. arXiv:1912.02675http://arxiv.org/abs/1912.02675",
      "doi": ""
    },
    {
      "text": "Brooke Auxier. 2020. How Americans view U.S. tech companies in 2020 | Pew Research Center. https://www.pewresearch.org/fact-tank/2020/10/27/how-americans-see-u-s-tech-companies-as-government-scrutiny-increases/. (Accessed on 09/06/2021).",
      "doi": ""
    },
    {
      "text": "Solon Barocas and Andrew D Selbst. 2016. Big data’s disparate impact. Calif. L. Rev. 104(2016), 671.",
      "doi": ""
    },
    {
      "text": "Reuben Binns, Max Van Kleek, Michael Veale, Ulrik Lyngs, Jun Zhao, and Nigel Shadbolt. 2018. ’It’s Reducing a Human Being to a Percentage’: Perceptions of Justice in Algorithmic Decisions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3173951",
      "doi": "10.1145/3173574.3173951"
    },
    {
      "text": "Lia Bozarth and Joyojeet Pal. 2019. Twitter Discourse as a Lens into Politicians’ Interest in Technology and Development. In Proceedings of the Tenth International Conference on Information and Communication Technologies and Development (Ahmedabad, India) (ICTD ’19). Association for Computing Machinery, New York, NY, USA, Article 33, 5 pages. https://doi.org/10.1145/3287098.3287129",
      "doi": "10.1145/3287098.3287129"
    },
    {
      "text": "James V Bradley. 1958. Complete counterbalancing of immediate sequential effects in a Latin square design. J. Amer. Statist. Assoc. 53, 282 (1958), 525–528.",
      "doi": ""
    },
    {
      "text": "Eric Brewer, Michael Demmer, Bowei Du, Melissa Ho, Matthew Kam, Sergiu Nedevschi, Joyojeet Pal, Rabin Patra, Sonesh Surana, and Kevin Fall. 2005. The case for technology in developing regions. Computer 38, 6 (2005), 25–38.",
      "doi": "10.1109/MC.2005.204"
    },
    {
      "text": "Taina Bucher. 2017. The algorithmic imaginary: exploring the ordinary affects of Facebook algorithms. Information, communication & society 20, 1 (2017), 30–44.",
      "doi": ""
    },
    {
      "text": "Andrea Bunt, Matthew Lount, and Catherine Lauzon. 2012. Are Explanations Always Important? A Study of Deployed, Low-Cost Intelligent Interactive Systems. In Proceedings of the 2012 ACM International Conference on Intelligent User Interfaces (Lisbon, Portugal) (IUI ’12). Association for Computing Machinery, New York, NY, USA, 169–178. https://doi.org/10.1145/2166966.2166996",
      "doi": "10.1145/2166966.2166996"
    },
    {
      "text": "Noah Castelo, Maarten W Bos, and Donald R Lehmann. 2019. Task-dependent algorithm aversion. Journal of Marketing Research 56, 5 (2019), 809–825.",
      "doi": ""
    },
    {
      "text": "Stephen Cave, Kate Coughlan, and Kanta Dihal. 2019. ”Scary Robots”: Examining Public Responses to AI. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (Honolulu, HI, USA) (AIES ’19). Association for Computing Machinery, New York, NY, USA, 331–337. https://doi.org/10.1145/3306618.3314232",
      "doi": "10.1145/3306618.3314232"
    },
    {
      "text": "Stephen Cave, Claire Craig, Kanta Dihal, Sarah Dillon, Jessica Montgomery, Beth Singler, and Lindsay Taylor. 2018. Portrayals and perceptions of AI and why they matter.",
      "doi": ""
    },
    {
      "text": "Shuchih Ernest Chang, Anne Yenching Liu, and Wei Cheng Shen. 2017. User trust in social networking services: A comparison of Facebook and LinkedIn. Computers in Human Behavior 69 (2017), 207–217.",
      "doi": "10.1016/j.chb.2016.12.013"
    },
    {
      "text": "Alexandra Chouldechova. 2017. Fair prediction with disparate impact: A study of bias in recidivism prediction instruments. Big data 5, 2 (2017), 153–163.",
      "doi": ""
    },
    {
      "text": "Jason A Colquitt. 2001. On the dimensionality of organizational justice: a construct validation of a measure.Journal of applied psychology 86, 3 (2001), 386.",
      "doi": ""
    },
    {
      "text": "European Commission. 2021. Regulation Of The European Parliament And Of The Council - Laying Down Harmonised Rules On Artificial Intelligence (Artificial Intelligence Act) And Amending Certain Union Legislative Acts. https://eur-lex.europa.eu/legal-content/EN/TXT/?qid=1623335154975&uri=CELEX%3A52021PC0206. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "Henriette Cramer, V. Evers, Satyan Ramlal, M. Someren, L. Rutledge, N. Stash, Lora Aroyo, and B. Wielinga. 2008. The effects of transparency on trust in and acceptance of a content-based art recommender. User Modeling and User-Adapted Interaction 18 (2008), 455–496.",
      "doi": "10.1007/s11257-008-9051-3"
    },
    {
      "text": "Aman Dalmia, Jerome White, Ankit Chaurasia, Vishal Agarwal, Rajesh Jain, Dhruvin Vora, Balasaheb Dhame, Raghu Dharmaraju, and Rahul Panicker. 2020. Pest Management In Cotton Farms: An AI-System Case Study from the Global South. In Proceedings of the 26th ACM SIGKDD International Conference on Knowledge Discovery & Data Mining (Virtual Event, CA, USA) (KDD ’20). Association for Computing Machinery, New York, NY, USA, 3119–3127. https://doi.org/10.1145/3394486.3403363",
      "doi": "10.1145/3394486.3403363"
    },
    {
      "text": "Roy G d’Andrade. 1995. The development of cognitive anthropology. Cambridge University Press, Cambridge, UK.",
      "doi": ""
    },
    {
      "text": "Maartje de Graaf, Somaya Ben Allouch, and Jan van Dijk. 2017. Why Do They Refuse to Use My Robot? Reasons for Non-Use Derived from a Long-Term Home Study. In Proceedings of the 2017 ACM/IEEE International Conference on Human-Robot Interaction (Vienna, Austria) (HRI ’17). Association for Computing Machinery, New York, NY, USA, 224–233. https://doi.org/10.1145/2909824.3020236",
      "doi": "10.1145/2909824.3020236"
    },
    {
      "text": "Srishti Deoras. 2020. CBSE Integrates AI Curriculum In 200 Indian Schools In Collaboration With IBM. https://analyticsindiamag.com/cbse-integrates-ai-curriculum-in-200-indian-schools-in-collaboration-with-ibm/. (Accessed on 08/22/2021).",
      "doi": ""
    },
    {
      "text": "Michael A. DeVito, Darren Gergle, and Jeremy Birnholtz. 2017. ”Algorithms Ruin Everything”: #RIPTwitter, Folk Theories, and Resistance to Algorithmic Change in Social Media. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3163–3174. https://doi.org/10.1145/3025453.3025659",
      "doi": "10.1145/3025453.3025659"
    },
    {
      "text": "Berkeley J Dietvorst, Joseph P Simmons, and Cade Massey. 2015. Algorithm aversion: People erroneously avoid algorithms after seeing them err.Journal of Experimental Psychology: General 144, 1 (2015), 114.",
      "doi": ""
    },
    {
      "text": "Jonathan Dodge, Q. Vera Liao, Yunfeng Zhang, Rachel K. E. Bellamy, and Casey Dugan. 2019. Explaining Models: An Empirical Study of How Explanations Impact Fairness Judgment. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 275–285. https://doi.org/10.1145/3301275.3302310",
      "doi": "10.1145/3301275.3302310"
    },
    {
      "text": "Graham Dove, Kim Halskov, Jodi Forlizzi, and John Zimmerman. 2017. UX Design Innovation: Challenges for Working with Machine Learning as a Design Material. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 278–288. https://doi.org/10.1145/3025453.3025739",
      "doi": "10.1145/3025453.3025739"
    },
    {
      "text": "Danielle Ensign, Sorelle A. Friedler, Scott Neville, Carlos Scheidegger, and Suresh Venkatasubramanian. 2018. Runaway Feedback Loops in Predictive Policing. In Proceedings of the 1st Conference on Fairness, Accountability and Transparency(Proceedings of Machine Learning Research, Vol. 81), Sorelle A. Friedler and Christo Wilson (Eds.). PMLR, New York, NY, USA, 160–171. https://proceedings.mlr.press/v81/ensign18a.html",
      "doi": ""
    },
    {
      "text": "Motahhare Eslami, Karrie Karahalios, Christian Sandvig, Kristen Vaccaro, Aimee Rickman, Kevin Hamilton, and Alex Kirlik. 2016. First I ”like” It, Then I Hide It: Folk Theories of Social Feeds. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems (San Jose, California, USA) (CHI ’16). Association for Computing Machinery, New York, NY, USA, 2371–2382. https://doi.org/10.1145/2858036.2858494",
      "doi": "10.1145/2858036.2858494"
    },
    {
      "text": "Motahhare Eslami, Aimee Rickman, Kristen Vaccaro, Amirhossein Aleyasen, Andy Vuong, Karrie Karahalios, Kevin Hamilton, and Christian Sandvig. 2015. ”I Always Assumed That I Wasn’t Really That Close to [Her]”: Reasoning about Invisible Algorithms in News Feeds. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 153–162. https://doi.org/10.1145/2702123.2702556",
      "doi": "10.1145/2702123.2702556"
    },
    {
      "text": "Motahhare Eslami, Kristen Vaccaro, Karrie Karahalios, and Kevin Hamilton. 2017. “Be Careful; Things Can Be Worse than They Appear”: Understanding Biased Algorithms and Users’ Behavior Around Them in Rating Platforms, In Proceedings of the Eleventh International AAAI Conference on Web and Social Media. Proceedings of the International AAAI Conference on Web and Social Media 11, 1, 62–71. https://ojs.aaai.org/index.php/ICWSM/article/view/14898",
      "doi": ""
    },
    {
      "text": "Ethan Fast and Eric Horvitz. 2017. Long-Term Trends in the Public Perception of Artificial Intelligence. In Proceedings of the Thirty-First AAAI Conference on Artificial Intelligence(AAAI’17). AAAI Press, San Francisco, California, USA, 963–969.",
      "doi": "10.5555/3298239.3298381"
    },
    {
      "text": "Shi Feng and Jordan Boyd-Graber. 2019. What Can AI Do for Me? Evaluating Machine Learning Interpretations in Cooperative Play. In Proceedings of the 24th International Conference on Intelligent User Interfaces (Marina del Ray, California) (IUI ’19). Association for Computing Machinery, New York, NY, USA, 229–239. https://doi.org/10.1145/3301275.3302265",
      "doi": "10.1145/3301275.3302265"
    },
    {
      "text": "Giselle Martins dos Santos Ferreira, Luiz Alexandre da Silva Rosado, Márcio Silveira Lemgruber, and Jaciara de Sá Carvalho. 2020. Metaphors we’re colonised by? The case of data-driven educational technologies in Brazil. Learning, Media and Technology 45, 1 (2020), 46–60.",
      "doi": ""
    },
    {
      "text": "Martin Fishbein and Icek Ajzen. 1977. Belief, Attitude, Intention, and Behavior: An Introduction to Theory and Research. Philosophy and Rhetoric 10, 2 (1977), 130–132.",
      "doi": ""
    },
    {
      "text": "Google. 2019. How Google Search Works (in 5 minutes) - YouTube. https://www.youtube.com/watch?v=0eKVizvYSUQ. (Accessed on 09/06/2021).",
      "doi": ""
    },
    {
      "text": "Saman Goudarzi, Elonnai Hickok, Amber Sinha, S Mohandas, PM Bidare, S Ray, and A Rathi. 2018. AI in Banking and Finance.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai, Jonathan Gruber, Teodora Djukaric, Jaelle Fuchs, and Lisa Brombach. 2020. Black box measures? How to study people’s algorithm skills. Information, Communication & Society 23, 5 (2020), 764–775.",
      "doi": ""
    },
    {
      "text": "Eszter Hargittai and Aaron Shaw. 2020. Comparing internet experiences and prosociality in amazon mechanical turk and population-based survey samples. Socius 6(2020), 2378023119889834.",
      "doi": ""
    },
    {
      "text": "Steven J Heine, Darrin R Lehman, Kaiping Peng, and Joe Greenholtz. 2002. What’s wrong with cross-cultural comparisons of subjective Likert scales?: The reference-group effect.Journal of personality and social psychology 82, 6(2002), 903.",
      "doi": ""
    },
    {
      "text": "Miriam Höddinghaus, Dominik Sondern, and Guido Hertel. 2021. The automation of leadership functions: Would people trust decision algorithms?Computers in Human Behavior 116 (2021), 106635.",
      "doi": ""
    },
    {
      "text": "Andreas Holzinger. 2018. Explainable ai (ex-ai). Informatik-Spektrum 41, 2 (2018), 138–143.",
      "doi": ""
    },
    {
      "text": "Nataliya V Ivankova and John W Creswell. 2009. Mixed methods. Qualitative research in applied linguistics: A practical introduction 23 (2009), 135–161.",
      "doi": ""
    },
    {
      "text": "Alon Jacovi, Ana Marasović, Tim Miller, and Yoav Goldberg. 2021. Formalizing Trust in Artificial Intelligence: Prerequisites, Causes and Goals of Human Trust in AI. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (Virtual Event, Canada) (FAccT ’21). Association for Computing Machinery, New York, NY, USA, 624–635. https://doi.org/10.1145/3442188.3445923",
      "doi": "10.1145/3442188.3445923"
    },
    {
      "text": "Mohit Jain, Pratyush Kumar, Ishita Bhansali, Q Vera Liao, Khai Truong, and Shwetak Patel. 2018. FarmChat: a conversational agent to answer farmer queries. Proceedings of the ACM on Interactive, Mobile, Wearable and Ubiquitous Technologies 2, 4 (2018), 1–22.",
      "doi": "10.1145/3287048"
    },
    {
      "text": "Mohammad Hossein Jarrahi and Will Sutherland. 2019. Algorithmic Management and Algorithmic Competencies: Understanding and Appropriating Algorithms in Gig Work. In Information in Contemporary Society, Natalie Greene Taylor, Caitlin Christian-Lamb, Michelle H. Martin, and Bonnie Nardi (Eds.). Springer International Publishing, Cham, 578–589.",
      "doi": ""
    },
    {
      "text": "Pramile Jayapal. 2020. Jayapal Joins Colleagues In Introducing Bicameral Legislation to Ban Government Use of Facial Recognition, Other Biometric Technology - Congresswoman Pramila Jayapal. https://jayapal.house.gov/2020/06/25/jayapal-joins-rep-pressley-and-senators-markey-and-merkley-to-introduce-legislation-to-ban-government-use-of-facial-recognition-other-biometric-technology/. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "Shagun Jhaver, Yoni Karpfen, and Judd Antin. 2018. Algorithmic Anxiety and Coping Strategies of Airbnb Hosts. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–12. https://doi.org/10.1145/3173574.3173995",
      "doi": "10.1145/3173574.3173995"
    },
    {
      "text": "Shalmali Joshi, Oluwasanmi Koyejo, Warut Vijitbenjaronk, Been Kim, and Joydeep Ghosh. 2019. Towards Realistic Individual Recourse and Actionable Explanations in Black-Box Decision Making Systems. CoRR abs/1907.09615(2019), 1–19. arXiv:1907.09615http://arxiv.org/abs/1907.09615",
      "doi": ""
    },
    {
      "text": "Anup Karan, Himanshu Negandhi, Suhaib Hussain, Tomas Zapata, Dilip Mairembam, Hilde De Graeve, James Buchan, and Sanjay Zodpey. 2021. Size, composition and distribution of health workforce in India: why, and where to invest?Human resources for health 19, 1 (2021), 1–14.",
      "doi": ""
    },
    {
      "text": "Herbert W Kee and Robert E Knox. 1970. Conceptual and methodological considerations in the study of trust and suspicion. Journal of conflict resolution 14, 3 (1970), 357–366.",
      "doi": ""
    },
    {
      "text": "Sandhya Keelery. 2021. Internet usage in India - statistics & facts | Statista. https://www.statista.com/topics/2157/internet-usage-in-india/. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "Patrick Gage Kelley, Yongwei Yang, Courtney Heldreth, Christopher Moessner, Aaron Sedley, Andreas Kramm, David T. Newman, and Allison Woodruff. 2021. Exciting, Useful, Worrying, Futuristic: Public Perception of Artificial Intelligence in 8 Countries. Association for Computing Machinery, New York, NY, USA, 627–637. https://doi.org/10.1145/3461702.3462605",
      "doi": ""
    },
    {
      "text": "David Kipnis. 1996. Trust and technology. Trust in organizations: Frontiers of theory and research 39 (1996), 50.",
      "doi": ""
    },
    {
      "text": "Erin Klawitter and Eszter Hargittai. 2018. “It’s like learning a whole other language”: The role of algorithmic skills in the curation of creative goods. International Journal of Communication 12 (2018), 3490–3510.",
      "doi": ""
    },
    {
      "text": "Rafal Kocielnik, Saleema Amershi, and Paul N. Bennett. 2019. Will You Accept an Imperfect AI? Exploring Designs for Adjusting End-User Expectations of AI Systems. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems (Glasgow, Scotland Uk) (CHI ’19). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3290605.3300641",
      "doi": "10.1145/3290605.3300641"
    },
    {
      "text": "Ava Kofman. 2016. How facial recognition can ruin your life–intercept.",
      "doi": ""
    },
    {
      "text": "Anastasia Kozyreva, Stefan Herzog, Philipp Lorenz-Spreen, Ralph Hertwig, and Stephan Lewandowsky. 2020. Artificial intelligence in online environments: Representative survey of public attitudes in germany.",
      "doi": ""
    },
    {
      "text": "Anastasia Kozyreva, Philipp Lorenz-Spreen, Ralph Hertwig, Stephan Lewandowsky, and Stefan M Herzog. 2021. Public attitudes towards algorithmic personalization and use of personal data online: evidence from Germany, Great Britain, and the United States. Humanities and Social Sciences Communications 8, 1(2021), 1–11.",
      "doi": ""
    },
    {
      "text": "R.M. Kramer and T.R. Tyler. 1995. Trust in Organizations: Frontiers of Theory and Research. SAGE Publications, Thousand Oaks, CA. https://books.google.co.in/books?id=ddpyAwAAQBAJ",
      "doi": ""
    },
    {
      "text": "Exposure Labs. 2020. The Social Dilemma. https://www.thesocialdilemma.com/. (Accessed on 09/10/2021).",
      "doi": ""
    },
    {
      "text": "Himabindu Lakkaraju, Ece Kamar, Rich Caruana, and Jure Leskovec. 2019. Faithful and Customizable Explanations of Black Box Models. In Proceedings of the 2019 AAAI/ACM Conference on AI, Ethics, and Society (Honolulu, HI, USA) (AIES ’19). Association for Computing Machinery, New York, NY, USA, 131–138. https://doi.org/10.1145/3306618.3314229",
      "doi": "10.1145/3306618.3314229"
    },
    {
      "text": "Markus Langer, Cornelius J König, and Maria Papathanasiou. 2019. Highly automated job interviews: Acceptance under the influence of stakes. International Journal of Selection and Assessment 27, 3(2019), 217–234.",
      "doi": ""
    },
    {
      "text": "Markus Langer and Richard N. Landers. 2021. The future of artificial intelligence at work: A review on effects of decision automation and augmentation on workers targeted by algorithms and third-party observers. Computers in Human Behavior 123 (2021), 106878. https://doi.org/10.1016/j.chb.2021.106878",
      "doi": "10.1016/j.chb.2021.106878"
    },
    {
      "text": "Chia-Jung Lee, Jaime Teevan, and Sebastian de la Chica. 2014. Characterizing Multi-Click Search Behavior and the Risks and Opportunities of Changing Results during Use. In Proceedings of the 37th International ACM SIGIR Conference on Research & Development in Information Retrieval (Gold Coast, Queensland, Australia) (SIGIR ’14). Association for Computing Machinery, New York, NY, USA, 515–524. https://doi.org/10.1145/2600428.2609588",
      "doi": "10.1145/2600428.2609588"
    },
    {
      "text": "John D Lee and Katrina A See. 2004. Trust in automation: Designing for appropriate reliance. Human factors 46, 1 (2004), 50–80.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee. 2018. Understanding perception of algorithmic decisions: Fairness, trust, and emotion in response to algorithmic management. Big Data & Society 5, 1 (2018), 2053951718756684.",
      "doi": ""
    },
    {
      "text": "Min Kyung Lee, Ji Tae Kim, and Leah Lizarondo. 2017. A Human-Centered Approach to Algorithmic Services: Considerations for Fair and Motivating Smart Community Service Management That Allocates Donations to Non-Profit Organizations. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems (Denver, Colorado, USA) (CHI ’17). Association for Computing Machinery, New York, NY, USA, 3365–3376. https://doi.org/10.1145/3025453.3025884",
      "doi": "10.1145/3025453.3025884"
    },
    {
      "text": "Min Kyung Lee, Daniel Kusbit, Evan Metsky, and Laura Dabbish. 2015. Working with Machines: The Impact of Algorithmic and Data-Driven Management on Human Workers. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems (Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 1603–1612. https://doi.org/10.1145/2702123.2702548",
      "doi": "10.1145/2702123.2702548"
    },
    {
      "text": "Min Kyung Lee and Katherine Rich. 2021. Who Is Included in Human Perceptions of AI?: Trust and Perceived Fairness around Healthcare AI and Cultural Mistrust. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 138, 14 pages. https://doi.org/10.1145/3411764.3445570",
      "doi": "10.1145/3411764.3445570"
    },
    {
      "text": "Q. Vera Liao, Daniel Gruen, and Sarah Miller. 2020. Questioning the AI: Informing Design Practices for Explainable AI User Experiences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–15. https://doi.org/10.1145/3313831.3376590",
      "doi": "10.1145/3313831.3376590"
    },
    {
      "text": "Jennifer M Logg, Julia A Minson, and Don A Moore. 2019. Algorithm appreciation: People prefer algorithmic to human judgment. Organizational Behavior and Human Decision Processes 151 (2019), 90–103.",
      "doi": ""
    },
    {
      "text": "Chiara Longoni, Andrea Bonezzi, and Carey K Morewedge. 2019. Resistance to medical artificial intelligence. Journal of Consumer Research 46, 4 (2019), 629–650.",
      "doi": ""
    },
    {
      "text": "Caitlin Lustig and Bonnie Nardi. 2015. Algorithmic Authority: The Case of Bitcoin. In 2015 48th Hawaii International Conference on System Sciences. IEEE, Hawaii, USA, 743–752. https://doi.org/10.1109/HICSS.2015.95",
      "doi": ""
    },
    {
      "text": "Vidushi Marda. 2018. Artificial intelligence policy in India: a framework for engaging the limits of data-driven decision-making. Philosophical Transactions of the Royal Society A: Mathematical, Physical and Engineering Sciences 376, 2133 (2018), 20180087.",
      "doi": ""
    },
    {
      "text": "Roger C Mayer, James H Davis, and F David Schoorman. 1995. An integrative model of organizational trust. Academy of management review 20, 3 (1995), 709–734.",
      "doi": ""
    },
    {
      "text": "Indrani Medhi Thies, Nandita Menon, Sneha Magapu, Manisha Subramony, and Jacki O’Neill. 2017. How Do You Want Your Chatbot? An Exploratory Wizard-of-Oz Study with Young, Urban Indians. In Human-Computer Interaction - INTERACT 2017, Regina Bernhaupt, Girish Dalvi, Anirudha Joshi, Devanuj K. Balkrishan, Jacki O’Neill, and Marco Winckler (Eds.). Springer International Publishing, Cham, 441–459.",
      "doi": ""
    },
    {
      "text": "Catherine Miller, Hannah Kitcher, Kapila Perera, and Alao Abiola. 2020. People, Power and Technology: The 2020 Digital Attitudes Report. https://doteveryone.org.uk/report/peoplepowertech2020/. (Accessed on 09/06/2021).",
      "doi": ""
    },
    {
      "text": "Narendra Modi. 2018. Make Artificial Intelligence in India, Make Artificial Intelligence Work for India: PM Modi. https://www.narendramodi.in/prime-minister-narendra-modi-inaugurated-wadhwani-institute-of-artificial-intelligence-at-the-university-of-mumbai--538994. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "Robert M Morgan and Shelby D Hunt. 1994. The commitment-trust theory of relationship marketing. Journal of marketing 58, 3 (1994), 20–38.",
      "doi": ""
    },
    {
      "text": "Rosanna Nagtegaal. 2021. The impact of using algorithms for managerial decisions on public employees’ procedural justice. Government Information Quarterly 38, 1 (2021), 101536.",
      "doi": ""
    },
    {
      "text": "Ronald C Nyhan. 2000. Changing the paradigm: Trust and its role in public sector organizations. The American Review of Public Administration 30, 1(2000), 87–109.",
      "doi": ""
    },
    {
      "text": "Ministry of Electronics & Information Technology. 2020. INDIAai. https://indiaai.gov.in/. (Accessed on 08/24/2021).",
      "doi": ""
    },
    {
      "text": "Shigehiro Oishi, Jungwon Hahn, Ulrich Schimmack, Phanikiran Radhakrishan, Vivian Dzokoto, and Stephen Ahadi. 2005. The measurement of values across cultures: A pairwise comparison approach. Journal of research in Personality 39, 2 (2005), 299–305.",
      "doi": ""
    },
    {
      "text": "Chinasa T. Okolo, Srujana Kamath, Nicola Dell, and Aditya Vashistha. 2021. “It Cannot Do All of My Work”: Community Health Worker Perceptions of AI-Enabled Mobile Health Applications in Rural India. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 701, 20 pages. https://doi.org/10.1145/3411764.3445420",
      "doi": "10.1145/3411764.3445420"
    },
    {
      "text": "Sonja K Ötting and Günter W Maier. 2018. The importance of procedural justice in human–machine interactions: Intelligent systems as new decision agents in organizations. Computers in Human Behavior 89 (2018), 27–39.",
      "doi": "10.1016/j.chb.2018.07.022"
    },
    {
      "text": "Google Research PAIR Team. 2021. People + AI Research - Guidebok. https://pair.withgoogle.com/guidebook/. (Accessed on 09/08/2021).",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal. 2012. The machine to aspire to: The computer in rural south India. https://doi.org/10.5210/fm.v17i2.3733",
      "doi": ""
    },
    {
      "text": "Joyojeet Pal. 2017. The Technological Self in India: From Tech-Savvy Farmers to a Selfie-Tweeting Prime Minister. In Proceedings of the Ninth International Conference on Information and Communication Technologies and Development (Lahore, Pakistan) (ICTD ’17). Association for Computing Machinery, New York, NY, USA, Article 11, 13 pages. https://doi.org/10.1145/3136560.3136583",
      "doi": "10.1145/3136560.3136583"
    },
    {
      "text": "Joyojeet Pal, Priyank Chandra, Vaishnav Kameswaran, Aakanksha Parameshwar, Sneha Joshi, and Aditya Johri. 2018. Digital Payment and Its Discontents: Street Shops and the Indian Government’s Push for Cashless Transactions. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3173574.3173803",
      "doi": "10.1145/3173574.3173803"
    },
    {
      "text": "Andrea Papenmeier, Gwenn Englebienne, and Christin Seifert. 2019. How model accuracy and explanation fidelity influence user trust. CoRR abs/1907.12652(2019), 1–7. arXiv:1907.12652http://arxiv.org/abs/1907.12652",
      "doi": ""
    },
    {
      "text": "Sylvain Parasie and Eric Dagiral. 2013. Data-driven journalism and the public good:“Computer-assisted-reporters” and “programmer-journalists” in Chicago. New media & society 15, 6 (2013), 853–871.",
      "doi": ""
    },
    {
      "text": "Munoz Claire Parry and Urvashi Aneja. 2020. 3.AI in Healthcare in India: Applications, Challenges and Risks | Chatham House – International Affairs Think Tank. https://www.chathamhouse.org/2020/07/artificial-intelligence-healthcare-insights-india-0/3-ai-healthcare-india-applications. (Accessed on 12/24/2021).",
      "doi": ""
    },
    {
      "text": "Amandalynne Paullada, Inioluwa Deborah Raji, Emily M Bender, Emily Denton, and Alex Hanna. 2021. Data and its (dis) contents: A survey of dataset development and use in machine learning research. Patterns 2, 11 (2021), 100336.",
      "doi": ""
    },
    {
      "text": "Emilee Rader and Rebecca Gray. 2015. Understanding User Beliefs About Algorithmic Curation in the Facebook News Feed. In Proceedings of the 33rd Annual ACM Conference on Human Factors in Computing Systems(Seoul, Republic of Korea) (CHI ’15). Association for Computing Machinery, New York, NY, USA, 173–182. https://doi.org/10.1145/2702123.2702174",
      "doi": "10.1145/2702123.2702174"
    },
    {
      "text": "Inioluwa Deborah Raji, Andrew Smart, Rebecca N. White, Margaret Mitchell, Timnit Gebru, Ben Hutchinson, Jamila Smith-Loud, Daniel Theron, and Parker Barnes. 2020. Closing the AI Accountability Gap: Defining an End-to-End Framework for Internal Algorithmic Auditing. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency (Barcelona, Spain) (FAT* ’20). Association for Computing Machinery, New York, NY, USA, 33–44. https://doi.org/10.1145/3351095.3372873",
      "doi": "10.1145/3351095.3372873"
    },
    {
      "text": "John K Rempel, John G Holmes, and Mark P Zanna. 1985. Trust in close relationships.Journal of personality and social psychology 49, 1(1985), 95.",
      "doi": ""
    },
    {
      "text": "GlobalData Thematic Research. 2021. Landmark AI legislation could tackle algorithmic bias - Verdict. https://www.verdict.co.uk/ethical-ai-regulation-eu/. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "Supriya Roy. 2021. Govt pushes for AI curriculum across schools, universities. https://www.techcircle.in/2021/03/16/govt-pushes-for-ai-curriculum-across-schools-universities. (Accessed on 08/22/2021).",
      "doi": ""
    },
    {
      "text": "Nithya Sambasivan, Erin Arnesen, Ben Hutchinson, Tulsee Doshi, and Vinodkumar Prabhakaran. 2021. Re-Imagining Algorithmic Fairness in India and Beyond. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency (Virtual Event, Canada) (FAccT ’21). Association for Computing Machinery, New York, NY, USA, 315–328. https://doi.org/10.1145/3442188.3445896",
      "doi": "10.1145/3442188.3445896"
    },
    {
      "text": "Nithya Sambasivan and Jess Holbrook. 2018. Toward responsible AI for the next billion users. Interactions 26, 1 (2018), 68–71.",
      "doi": "10.1145/3298735"
    },
    {
      "text": "Nithya Sambasivan, Shivani Kapania, Hannah Highfill, Diana Akrong, Praveen Paritosh, and Lora M Aroyo. 2021. “Everyone Wants to Do the Model Work, Not the Data Work”: Data Cascades in High-Stakes AI. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems (Yokohama, Japan) (CHI ’21). Association for Computing Machinery, New York, NY, USA, Article 39, 15 pages. https://doi.org/10.1145/3411764.3445518",
      "doi": "10.1145/3411764.3445518"
    },
    {
      "text": "Christian Sandvig, Kevin Hamilton, Karrie Karahalios, and Cedric Langbort. 2014. Auditing algorithms: Research methods for detecting discrimination on internet platforms. Data and discrimination: converting critical concerns into productive inquiry 22(2014), 4349–4357.",
      "doi": ""
    },
    {
      "text": "Edward Santow. 2020. Emerging from AI utopia.",
      "doi": ""
    },
    {
      "text": "Philipp Schmidt, Felix Biessmann, and Timm Teubner. 2020. Transparency and trust in artificial intelligence systems. Journal of Decision Systems 29, 4 (2020), 260–278.",
      "doi": ""
    },
    {
      "text": "Nick Seaver. 2017. Algorithms as culture: Some tactics for the ethnography of algorithmic systems. Big data & society 4, 2 (2017), 2053951717738104.",
      "doi": ""
    },
    {
      "text": "Yogima Seth Sharma. 2020. NITI Aayog wants dedicated oversight body for use of artificial intelligence. https://economictimes.indiatimes.com/news/economy/policy/niti-aayog-wants-dedicated-oversight-body-for-use-of-artificial-intelligence/articleshow/79260810.cms?from=mdr. (Accessed on 08/22/2021).",
      "doi": ""
    },
    {
      "text": "Hong Shen, Alicia DeVos, Motahhare Eslami, and Kenneth Holstein. 2021. Everyday Algorithm Auditing: Understanding the Power of Everyday Users in Surfacing Harmful Algorithmic Behaviors. Proc. ACM Hum.-Comput. Interact. 5, CSCW2, Article 433 (oct 2021), 29 pages. https://doi.org/10.1145/3479577",
      "doi": "10.1145/3479577"
    },
    {
      "text": "Anubhutie Singh and Srikara Prasad. 2020. Dvara Research Blog | Artificial Intelligence in Digital Credit in India. https://www.dvara.com/blog/2020/04/13/artificial-intelligence-in-digital-credit-in-india/. (Accessed on 09/06/2021).",
      "doi": ""
    },
    {
      "text": "Aaron Smith. 2018. Public Attitudes Toward Computer Algorithms | Pew Research Center. https://www.pewresearch.org/internet/2018/11/16/public-attitudes-toward-computer-algorithms/. (Accessed on 08/22/2021).",
      "doi": ""
    },
    {
      "text": "Alison Smith-Renner, Ron Fan, Melissa Birchfield, Tongshuang Wu, Jordan Boyd-Graber, Daniel S. Weld, and Leah Findlater. 2020. No Explainability without Accountability: An Empirical Study of Explanations and Feedback in Interactive ML. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376624",
      "doi": "10.1145/3313831.3376624"
    },
    {
      "text": "Cynthias Spiess. 2021. Is That Traffic Light Tracking You? A Case Study on a Municipal Surveillance Technology in Seattle. IEEE Transactions on Technology and Society 2, 1 (2021), 15–19.",
      "doi": ""
    },
    {
      "text": "Janaki Srinivasan and Aditya Johri. 2013. Creating Machine Readable Men: Legitimizing the ’Aadhaar’ Mega e-Infrastructure Project in India. In Proceedings of the Sixth International Conference on Information and Communication Technologies and Development: Full Papers - Volume 1 (Cape Town, South Africa) (ICTD ’13). Association for Computing Machinery, New York, NY, USA, 101–112. https://doi.org/10.1145/2516604.2516625",
      "doi": "10.1145/2516604.2516625"
    },
    {
      "text": "Gerard J Tellis and Deepa Chandrasekaran. 2010. Extent and impact of response biases in cross-national survey research. International Journal of Research in Marketing 27, 4 (2010), 329–341.",
      "doi": ""
    },
    {
      "text": "Divy Thakkar, Neha Kumar, and Nithya Sambasivan. 2020. Towards an AI-Powered Future That Works for Vocational Workers. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–13. https://doi.org/10.1145/3313831.3376674",
      "doi": "10.1145/3313831.3376674"
    },
    {
      "text": "David R Thomas. 2006. A general inductive approach for analyzing qualitative evaluation data. American journal of evaluation 27, 2 (2006), 237–246.",
      "doi": ""
    },
    {
      "text": "Ehsan Toreini, Mhairi Aitken, Kovila Coopamootoo, Karen Elliott, Carlos Gonzalez Zelaya, and Aad van Moorsel. 2020. The Relationship between Trust in AI and Trustworthy Machine Learning Technologies. In Proceedings of the 2020 Conference on Fairness, Accountability, and Transparency (Barcelona, Spain) (FAT* ’20). Association for Computing Machinery, New York, NY, USA, 272–283. https://doi.org/10.1145/3351095.3372834",
      "doi": "10.1145/3351095.3372834"
    },
    {
      "text": "Joe Toscano. 2018. Optimizing for Trust: The New Metric of Success for Today’s Economy | by Joe Toscano RE: Write | Medium. https://medium.com/re-write/optimizing-for-trust-the-new-metric-of-success-for-todays-economy-92408e832a53. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "European Union. 2019. General Data Protection Regulation (GDPR) Compliance Guidelines. https://gdpr.eu/. (Accessed on 09/10/2021).",
      "doi": ""
    },
    {
      "text": "Norman Uphoff. 1989. Distinguishing power, authority & legitimacy: Taking Max Weber at his word by using resources-exchange analysis. Polity 22, 2 (1989), 295–322.",
      "doi": ""
    },
    {
      "text": "C Vijai and Worakamol Wisetsri. 2021. Rise of Artificial Intelligence in Healthcare Startups in India. Advances In Management 14, 1 (2021), 48–52.",
      "doi": ""
    },
    {
      "text": "Voice+Code. 2019. Trust is a Critical Customer Experience Metric: Determine How Perceptions of Data Privacy and Security Affect Your Business. https://www.voiceandcode.com/our-insights/2019/3/26/trust-is-a-critical-customer-experience-metric-determine-how-perceptions-of-data-privacy-and-security-affect-your-business. (Accessed on 09/09/2021).",
      "doi": ""
    },
    {
      "text": "Ruotong Wang, F. Maxwell Harper, and Haiyi Zhu. 2020. Factors Influencing Perceived Fairness in Algorithmic Decision-Making: Algorithm Outcomes, Development Procedures, and Individual Differences. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems (Honolulu, HI, USA) (CHI ’20). Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376813",
      "doi": "10.1145/3313831.3376813"
    },
    {
      "text": "Similar Web. 2021. Top Apps Ranking - Most Popular Apps in India | Similarweb. https://www.similarweb.com/apps/top/google/app-index/in/all/top-free/. (Accessed on 09/10/2021).",
      "doi": ""
    },
    {
      "text": "Max Weber. 1978. Economy and society: An outline of interpretive sociology. Vol. 1. Univ of California Press, Berkeley, CA.",
      "doi": ""
    },
    {
      "text": "Conor Wilcock. 2020. Cultural Biases in Market Research - B2B International. https://www.b2binternational.com/publications/understanding-accounting-cultural-bias-global-b2b-research/. (Accessed on 09/07/2021).",
      "doi": ""
    },
    {
      "text": "Marisol Wong-Villacres, Carl DiSalvo, Neha Kumar, and Betsy DiSalvo. 2020. Culture in Action: Unpacking Capacities to Inform Assets-Based Design. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3313831.3376329",
      "doi": "10.1145/3313831.3376329"
    },
    {
      "text": "Allison Woodruff, Yasmin Asare Anderson, Katherine Jameson Armstrong, Marina Gkiza, Jay Jennings, Christopher Moessner, Fernanda B. Viégas, Martin Wattenberg, Lynette Webb, Fabian Wrede, and Patrick Gage Kelley. 2020. ”A cold, technical decision-maker”: Can AI provide explainability, negotiability, and humanity?CoRR abs/2012.00874(2020), 1–23. arXiv:2012.00874(https://arxiv.org/abs/2012.00874)",
      "doi": ""
    },
    {
      "text": "Allison Woodruff, Sarah E. Fox, Steven Rousso-Schindler, and Jeffrey Warshaw. 2018. A Qualitative Exploration of Perceptions of Algorithmic Fairness. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. Association for Computing Machinery, New York, NY, USA, 1–14. https://doi.org/10.1145/3173574.3174230",
      "doi": "10.1145/3173574.3174230"
    },
    {
      "text": "S. Woods, M. Walters, Kheng Lee Koay, and K. Dautenhahn. 2006. Comparing human robot interaction scenarios using live and video based methods: towards a novel methodological approach. In 9th IEEE International Workshop on Advanced Motion Control, 2006.IEEE, Istanbul, Turkey, 750–755. https://doi.org/10.1109/AMC.2006.1631754",
      "doi": ""
    },
    {
      "text": "Fumeng Yang, Zhuanyi Huang, Jean Scholtz, and Dustin L. Arendt. 2020. How Do Visual Explanations Foster End Users’ Appropriate Trust in Machine Learning?. In Proceedings of the 25th International Conference on Intelligent User Interfaces (Cagliari, Italy) (IUI ’20). Association for Computing Machinery, New York, NY, USA, 189–201. https://doi.org/10.1145/3377325.3377480",
      "doi": "10.1145/3377325.3377480"
    }
  ]
}