{
  "doi": "10.1145/3491102.3517737",
  "title": "Data Every Day: Designing and Living with Personal Situated Visualizations",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-18",
  "year": 2022,
  "badges": [],
  "abstract": "We explore the design and utility of situated manual self-tracking visualizations on dedicated displays that integrate data tracking into existing practices and physical environments. Situating self-tracking tools in relevant locations is a promising approach to enable reflection on and awareness of data without needing to rely on sensorized tracking or personal devices. In both a long-term autobiographical design process and a co-design study with six participants, we rapidly prototyped and deployed 30 situated self-tracking applications over a ten month period. Grounded in the experience of designing and living with these trackers, we contribute findings on logging and data entry, the use of situated displays, and the visual design and customization of trackers. Our results demonstrate the potential of customizable dedicated self-tracking visualizations that are situated in relevant physical spaces, and suggest future research opportunities and new potential applications for situated visualizations.",
  "tags": [
    "personal data",
    "self-tracking",
    "situated visualization"
  ],
  "authors": [
    {
      "name": "Nathalie Bressa",
      "institution": "Department of Computer Science, Aarhus University, Denmark",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659442147",
      "orcid": "missing"
    },
    {
      "name": "Jo Vermeulen",
      "institution": "Autodesk Research, Canada and Department of Computer Science, Aarhus University, Denmark",
      "img": "/do/10.1145/contrib-81361604861/rel-imgonly/closeup1smallbwsquare.jpg",
      "acmid": "81361604861",
      "orcid": "missing"
    },
    {
      "name": "Wesley Willett",
      "institution": "University of Calgary, Canada",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81350572817",
      "orcid": "0000-0002-6793-3062"
    }
  ],
  "references": [
    {
      "text": "Parastoo Abtahi, Victoria Ding, Anna C. Yang, Tommy Bruzzese, Alyssa B. Romanos, Elizabeth L. Murnane, Sean Follmer, and James A. Landay. 2020. Understanding Physical Practices and the Role of Technology in Manual Self-Tracking. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 4, 4, Article 115 (Dec. 2020), 24 pages. https://doi.org/10.1145/3432236",
      "doi": "10.1145/3432236"
    },
    {
      "text": "Phil Adams, Elizabeth L. Murnane, Michael Elfenbein, Elaine Wethington, and Geri Gay. 2017. Supporting the Self-Management of Chronic Pain Conditions with Tailored Momentary Self-Assessments. In Proc. of CHI ’17. ACM, 1065–1077. https://doi.org/10.1145/3025453.3025832",
      "doi": "10.1145/3025453.3025832"
    },
    {
      "text": "Amid Ayobi, Paul Marshall, Anna L. Cox, and Yunan Chen. 2017. Quantifying the Body and Caring for the Mind: Self-Tracking in Multiple Sclerosis. In Proc. of CHI ’17. ACM, 6889–6901. https://doi.org/10.1145/3025453.3025869",
      "doi": "10.1145/3025453.3025869"
    },
    {
      "text": "Amid Ayobi, Tobias Sonne, Paul Marshall, and Anna L. Cox. 2018. Flexible and Mindful Self-Tracking: Design Implications from Paper Bullet Journals. In Proc. of CHI ’18. ACM, Article 28, 14 pages. https://doi.org/10.1145/3173574.3173602",
      "doi": "10.1145/3173574.3173602"
    },
    {
      "text": "Dominikus Baur. 2017. Silent Augmented Reality. Hacker Noon (18 Aug 2017). https://hackernoon.com/silent-augmented-reality-f0f7614cab32 https://hackernoon.com/silent-augmented-reality-f0f7614cab32.",
      "doi": ""
    },
    {
      "text": "Frank Bentley and Konrad Tollmar. 2013. The Power of Mobile Notifications to Increase Wellbeing Logging Behavior. In Proc. of CHI ’13. ACM, 1095–1098. https://doi.org/10.1145/2470654.2466140",
      "doi": "10.1145/2470654.2466140"
    },
    {
      "text": "Susanne Bødker, Kaj Grønbæk, and Morten Kyng. 1993. Cooperative design: Techniques and experiences from the Scandinavian scene. In Participatory design. Principles and practices, Doug Schuler and Aki Namioka (Eds.). Lawrence Erlbaum Associates, 157–176.",
      "doi": ""
    },
    {
      "text": "Michael Bostock, Vadim Ogievetsky, and Jeffrey Heer. 2011. D3: Data-Driven Documents. IEEE Trans. Visualization & Comp. Graphics (Proc. InfoVis) (2011). http://vis.stanford.edu/papers/d3",
      "doi": ""
    },
    {
      "text": "Nathalie Bressa, Kendra Wannamaker, Henrik Korsgaard, Wesley Willett, and Jo Vermeulen. 2019. Sketching and Ideation Activities for Situated Visualization Design. In Proc. of DIS ’19. ACM, 173–185. https://doi.org/10.1145/3322276.3322326",
      "doi": "10.1145/3322276.3322326"
    },
    {
      "text": "Gharad Bryan, Dean Karlan, and Scott Nelson. 2010. Commitment devices. Annu. Rev. Econ. 2, 1 (2010), 671–698.",
      "doi": ""
    },
    {
      "text": "Scott Carter and Jennifer Mankoff. 2005. When Participants Do the Capturing: The Role of Media in Diary Studies. In Proc. of CHI ’05. ACM, 899–908. https://doi.org/10.1145/1054972.1055098",
      "doi": "10.1145/1054972.1055098"
    },
    {
      "text": "Keith Cheverst, Alan Dix, Daniel Fitton, Mark Rouncefield, and Connor Graham. 2007. Exploring Awareness Related Messaging through Two Situated-Display-Based Systems. Human–Computer Interaction 22, 1-2 (May 2007), 173–220. https://doi.org/10.1080/07370020701307955",
      "doi": ""
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Matthew Kay, Wanda Pratt, and Julie A. Kientz. 2015. SleepTight: Low-Burden, Self-Monitoring Technology for Capturing and Reflecting on Sleep Behaviors. In Proc. of Ubicomp ’15. ACM, 121–132. https://doi.org/10.1145/2750858.2804266",
      "doi": "10.1145/2750858.2804266"
    },
    {
      "text": "Eun Kyoung Choe, Bongshin Lee, Haining Zhu, Nathalie Henry Riche, and Dominikus Baur. 2017. Understanding Self-Reflection: How People Reflect on Personal Data through Visual Data Exploration. In Proc. of PervasiveHealth ’17. ACM, 173–182. https://doi.org/10.1145/3154862.3154881",
      "doi": "10.1145/3154862.3154881"
    },
    {
      "text": "Eun Kyoung Choe, Nicole B. Lee, Bongshin Lee, Wanda Pratt, and Julie A. Kientz. 2014. Understanding Quantified-Selfers’ Practices in Collecting and Exploring Personal Data. In Proc. of CHI ’14. ACM, 1143–1152. https://doi.org/10.1145/2556288.2557372",
      "doi": "10.1145/2556288.2557372"
    },
    {
      "text": "Chia-Fang Chung, Elena Agapie, Jessica Schroeder, Sonali Mishra, James Fogarty, and Sean A. Munson. 2017. When Personal Tracking Becomes Social: Examining the Use of Instagram for Healthy Eating. In Proc. of CHI ’17. ACM, 1674–1687. https://doi.org/10.1145/3025453.3025747",
      "doi": "10.1145/3025453.3025747"
    },
    {
      "text": "Sandy Claes, Jorgos Coenen, and Andrew Vande Moere. 2018. Conveying a Civic Issue Through Data via Spatially Distributed Public Visualization and Polling Displays. In Proc. of NordiCHI ’18. ACM, 597–608. https://doi.org/10.1145/3240167.3240206",
      "doi": "10.1145/3240167.3240206"
    },
    {
      "text": "Sandy Claes and Andrew Vande Moere. 2013. Street Infographics: Raising Awareness of Local Issues Through a Situated Urban Visualization. In Proc. of PerDis ’13. ACM, 133–138. https://doi.org/10.1145/2491568.2491597",
      "doi": "10.1145/2491568.2491597"
    },
    {
      "text": "Jorgos Coenen, Maarten Houben, and Andrew Vande Moere. 2019. Citizen Dialogue Kit: Public Polling and Data Visualization Displays for Bottom-Up Citizen Participation. In Proc. of DIS ’19 Companion. ACM, 9–12. https://doi.org/10.1145/3301019.3325160",
      "doi": "10.1145/3301019.3325160"
    },
    {
      "text": "Jorgos Coenen, Eslam Nofal, and Andrew Vande Moere. 2019. How the Arrangement of Content and Location Impact the Use of Multiple Distributed Public Displays. In Proc. of DIS ’19. ACM, 1415–1426. https://doi.org/10.1145/3322276.3322294",
      "doi": "10.1145/3322276.3322294"
    },
    {
      "text": "Sunny Consolvo, Katherine Everitt, Ian Smith, and James A. Landay. 2006. Design Requirements for Technologies That Encourage Physical Activity. In Proc. of CHI 06’. ACM, 457–466. https://doi.org/10.1145/1124772.1124840",
      "doi": "10.1145/1124772.1124840"
    },
    {
      "text": "Nigel Davies, Sarah Clinch, and Florian Alt. 2014. Pervasive Displays: Understanding the Future of Digital Signage. Synthesis Lectures on Mobile and Pervasive Computing 8, 1 (2014), 1–128. https://doi.org/10.2200/S00558ED1V01Y201312MPC011",
      "doi": "10.5555/2632840"
    },
    {
      "text": "Audrey Desjardins and Aubree Ball. 2018. Revealing Tensions in Autobiographical Design in HCI. In Proc. of DIS ’18. ACM, 753–764. https://doi.org/10.1145/3196709.3196781",
      "doi": "10.1145/3196709.3196781"
    },
    {
      "text": "Audrey Desjardins and Ron Wakkary. 2016. Living In A Prototype: A Reconfigured Space. In Proc. of CHI ’16. ACM, 5274–5285. https://doi.org/10.1145/2858036.2858261",
      "doi": "10.1145/2858036.2858261"
    },
    {
      "text": "Audrey Desjardins, Ron Wakkary, and William Odom. 2015. Investigating Genres and Perspectives in HCI Research on the Home. In Proc. CHI ’15. ACM, 3073–3082. https://doi.org/10.1145/2702123.2702540",
      "doi": "10.1145/2702123.2702540"
    },
    {
      "text": "Laura Devendorf, Kristina Andersen, and Aisling Kelliher. 2020. The Fundamental Uncertainties of Mothering: Finding Ways to Honor Endurance, Struggle, and Contradiction. ACM Trans. Comput.-Hum. Interact. 27, 4, Article 26 (September 2020), 24 pages. https://doi.org/10.1145/3397177",
      "doi": "10.1145/3397177"
    },
    {
      "text": "Laura Devendorf, Joanne Lo, Noura Howell, Jung Lin Lee, Nan-Wei Gong, M. Emre Karagozler, Shiho Fukuhara, Ivan Poupyrev, Eric Paulos, and Kimiko Ryokai. 2016. “I Don’t Want to Wear a Screen”: Probing Perceptions of and Possibilities for Dynamic Displays on Clothing. In Proc. of CHI ’16. ACM, 6028–6039. https://doi.org/10.1145/2858036.2858192",
      "doi": "10.1145/2858036.2858192"
    },
    {
      "text": "Christine Dierk, Molly Jane Pearce Nicholas, and Eric Paulos. 2018. AlterWear: Battery-Free Wearable Displays for Opportunistic Interactions. In Proc. of CHI ’18. ACM, Article 220, 11 pages. https://doi.org/10.1145/3173574.3173794",
      "doi": "10.1145/3173574.3173794"
    },
    {
      "text": "Alix Ducros, Clemens N. Klokmose, and Aurélien Tabard. 2019. Situated Sketching and Enactment for Pervasive Displays. In Proc. of ISS ’19. ACM, New York, NY, USA, 217–228. https://doi.org/10.1145/3343055.3359702",
      "doi": "10.1145/3343055.3359702"
    },
    {
      "text": "Niklas Elmqvist and Pourang Irani. 2013. Ubiquitous Analytics: Interacting with Big Data Anywhere, Anytime. Computer 46, 04 (apr 2013), 86–89. https://doi.org/10.1109/MC.2013.147",
      "doi": "10.1109/MC.2013.147"
    },
    {
      "text": "Daniel A. Epstein, Monica Caraway, Chuck Johnston, An Ping, James Fogarty, and Sean A. Munson. 2016. Beyond Abandonment to Next Steps: Understanding and Designing for Life after Personal Informatics Tool Use. In Proc. of CHI ’16. ACM, 1109–1113. https://doi.org/10.1145/2858036.2858045",
      "doi": "10.1145/2858036.2858045"
    },
    {
      "text": "Daniel A. Epstein, Nicole B. Lee, Jennifer H. Kang, Elena Agapie, Jessica Schroeder, Laura R. Pina, James Fogarty, Julie A. Kientz, and Sean Munson. 2017. Examining Menstrual Tracking to Inform the Design of Personal Informatics Tools. In Proc. of CHI ’17. ACM, 6876–6888. https://doi.org/10.1145/3025453.3025635",
      "doi": "10.1145/3025453.3025635"
    },
    {
      "text": "Daniel A. Epstein, An Ping, James Fogarty, and Sean A. Munson. 2015. A Lived Informatics Model of Personal Informatics. In Proc. of Ubicomp ’15. ACM, 731–742. https://doi.org/10.1145/2750858.2804250",
      "doi": "10.1145/2750858.2804250"
    },
    {
      "text": "Pauline Gourlet and Thierry Dassé. 2017. Cairn: A Tangible Apparatus for Situated Data Collection, Visualization and Analysis. In Proc. of DIS ’17. ACM, 247–258. https://doi.org/10.1145/3064663.3064794",
      "doi": "10.1145/3064663.3064794"
    },
    {
      "text": "Rúben Gouveia, Evangelos Karapanos, and Marc Hassenzahl. 2015. How Do We Engage with Activity Trackers? A Longitudinal Study of Habito. In Proc. of Ubicomp ’15. ACM, 1305–1316. https://doi.org/10.1145/2750858.2804290",
      "doi": "10.1145/2750858.2804290"
    },
    {
      "text": "Tobias Grosse-Puppendahl, Steve Hodges, Nicholas Chen, John Helmes, Stuart Taylor, James Scott, Josh Fromm, and David Sweeney. 2016. Exploring the Design Space for Energy-Harvesting Situated Displays. In Proc. of UIST ’16. ACM, 41–48. https://doi.org/10.1145/2984511.2984513",
      "doi": "10.1145/2984511.2984513"
    },
    {
      "text": "Kyle Wm. Hall, Adam J. Bradley, Uta Hinrichs, Samuel Huron, Jo Wood, Chris Collins, and Sheelagh Carpendale. 2020. Design by Immersion: A Transdisciplinary Approach to Problem-Driven Visualizations. IEEE Transactions on Visualization and Computer Graphics 26, 1(2020), 109–118.",
      "doi": ""
    },
    {
      "text": "Daniel Harrison, Paul Marshall, Nadia Bianchi-Berthouze, and Jon Bird. 2015. Activity Tracking: Barriers, Workarounds and Customisation. In Proc. of Ubicomp ’15. ACM, 617–621. https://doi.org/10.1145/2750858.2805832",
      "doi": "10.1145/2750858.2805832"
    },
    {
      "text": "Yasamin Heshmat, Carman Neustaedter, and Brendan DeBrincat. 2017. The Autobiographical Design and Long Term Usage of an Always-On Video Recording System for the Home. In Proc. of DIS ’17. ACM, 675–687. https://doi.org/10.1145/3064663.3064759",
      "doi": "10.1145/3064663.3064759"
    },
    {
      "text": "Sarah Homewood, Harvey Bewley, and Laurens Boer. 2019. Ovum: Designing for Fertility Tracking as a Shared and Domestic Experience. In Proc. of DIS ’19. ACM, 553–565. https://doi.org/10.1145/3322276.3323692",
      "doi": "10.1145/3322276.3323692"
    },
    {
      "text": "Sarah Homewood, Amanda Karlsson, and Anna Vallgårda. 2020. Removal as a Method: A Fourth Wave HCI Approach to Understanding the Experience of Self-Tracking. In Proc. of DIS ’20. ACM, 1779–1791. https://doi.org/10.1145/3357236.3395425",
      "doi": "10.1145/3357236.3395425"
    },
    {
      "text": "Steven Houben, Connie Golsteijn, Sarah Gallacher, Rose Johnson, Saskia Bakker, Nicolai Marquardt, Licia Capra, and Yvonne Rogers. 2016. Physikit: Data Engagement Through Physical Ambient Visualizations in the Home. In Proc. of CHI ’16. ACM, 1608–1619. https://doi.org/10.1145/2858036.2858059",
      "doi": "10.1145/2858036.2858059"
    },
    {
      "text": "Yen-Chia Hsu, Paul Dille, Jennifer Cross, Beatrice Dias, Randy Sargent, and Illah Nourbakhsh. 2017. Community-Empowered Air Quality Monitoring System. In Proc. of CHI ’17. ACM, 1607––1619. https://doi.org/10.1145/3025453.3025853",
      "doi": "10.1145/3025453.3025853"
    },
    {
      "text": "Dandan Huang, Melanie Tory, Bon Adriel Aseniero, Lyn Bartram, Scott Bateman, Sheelagh Carpendale, Anthony Tang, and Robert Woodbury. 2015. Personal Visualization and Personal Visual Analytics. IEEE Transactions on Visualization and Computer Graphics 21, 3 (March 2015), 420–433. https://doi.org/10.1109/TVCG.2014.2359887",
      "doi": "10.1109/TVCG.2014.2359887"
    },
    {
      "text": "Samuel Huron, Sheelagh Carpendale, Alice Thudt, Anthony Tang, and Michael Mauerer. 2014. Constructive Visualization. In Proc. of DIS ’14. ACM, 433–442. https://doi.org/10.1145/2598510.2598566",
      "doi": ""
    },
    {
      "text": "ReporterApp Inc.2020. Reporter App. Web. Retrieved January 31, 2020 from http://reporter-app.com/.",
      "doi": ""
    },
    {
      "text": "Yvonne Jansen and Pierre Dragicevic. 2013. An Interaction Model for Visualizations Beyond The Desktop. IEEE Transactions on Visualization and Computer Graphics 19, 12 (Dec 2013), 2396–2405. https://doi.org/10.1109/TVCG.2013.134",
      "doi": "10.1109/TVCG.2013.134"
    },
    {
      "text": "Thorsten Karrer, Moritz Wittenhagen, Leonhard Lichtschlag, Florian Heller, and Jan Borchers. 2011. Pinstripe: Eyes-Free Continuous Input on Interactive Clothing. In Proc. of CHI ’11. ACM, 1313–1322. https://doi.org/10.1145/1978942.1979137",
      "doi": "10.1145/1978942.1979137"
    },
    {
      "text": "Maria Karyda, Merja Ryöppy, Jacob Buur, and Andrés Lucero. 2020. Imagining Data-Objects for Reflective Self-Tracking. In Proc. of CHI ’20. ACM, 12 pages. https://doi.org/10.1145/3313831.3376844",
      "doi": "10.1145/3313831.3376844"
    },
    {
      "text": "Fahim Kawsar, Jo Vermeulen, Kevin Smith, Kris Luyten, and Gerd Kortuem. 2011. Exploring the Design Space for Situated Glyphs to Support Dynamic Work Environments. In Proc. of Pervasive ’11. Springer Berlin Heidelberg, 70–78. https://doi.org/10.1007/978-3-642-21726-5_5",
      "doi": ""
    },
    {
      "text": "Matthew Kay, Eun Kyoung Choe, Jesse Shepherd, Benjamin Greenstein, Nathaniel Watson, Sunny Consolvo, and Julie A. Kientz. 2012. Lullaby: A Capture & Access System for Understanding the Sleep Environment. In Proc. of Ubicomp ’12. ACM, 226–234. https://doi.org/10.1145/2370216.2370253",
      "doi": "10.1145/2370216.2370253"
    },
    {
      "text": "Christina Kelley, Bongshin Lee, and Lauren Wilcox. 2017. Self-Tracking for Mental Wellness: Understanding Expert Perspectives and Student Experiences. In Proc. of CHI ’17. ACM, 629–641. https://doi.org/10.1145/3025453.3025750",
      "doi": "10.1145/3025453.3025750"
    },
    {
      "text": "Nam Wook Kim, Hyejin Im, Nathalie Henry Riche, Alicia Wang, Krzysztof Gajos, and Hanspeter Pfister. 2019. DataSelfie: Empowering People to Design Personalized Visuals to Represent Their Data. In Proc. of CHI ’19. ACM, Article 79, 12 pages. https://doi.org/10.1145/3290605.3300309",
      "doi": "10.1145/3290605.3300309"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Eun Kyoung Choe, Bongshin Lee, KwonHyun Kim, and Jinwook Seo. 2016. TimeAware: Leveraging Framing Effects to Enhance Personal Productivity. In Proc. of CHI ’16. ACM, 272–283. https://doi.org/10.1145/2858036.2858428",
      "doi": "10.1145/2858036.2858428"
    },
    {
      "text": "Young-Ho Kim, Jae Ho Jeon, Bongshin Lee, Eun Kyoung Choe, and Jinwook Seo. 2017. OmniTrack: A Flexible Self-Tracking Approach Leveraging Semi-Automated Tracking. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 1, 3, Article 67 (Sept. 2017), 28 pages. https://doi.org/10.1145/3130930",
      "doi": "10.1145/3130930"
    },
    {
      "text": "Lisa Koeman, Vaiva Kalnikaité, and Yvonne Rogers. 2015. “Everyone Is Talking about It!”: A Distributed Approach to Urban Voting Technology and Visualisations. In Proc. CHI ’15. ACM, 3127–3136. https://doi.org/10.1145/2702123.2702263",
      "doi": "10.1145/2702123.2702263"
    },
    {
      "text": "Amanda Lazar, Christian Koehler, Joshua Tanenbaum, and David H. Nguyen. 2015. Why We Use and Abandon Smart Devices. In Proc. of Ubicomp ’15. ACM, 635–646. https://doi.org/10.1145/2750858.2804288",
      "doi": "10.1145/2750858.2804288"
    },
    {
      "text": "Ian Li, Anind Dey, and Jodi Forlizzi. 2010. A Stage-Based Model of Personal Informatics Systems. In Proc. of CHI ’10. ACM, 557–566. https://doi.org/10.1145/1753326.1753409",
      "doi": "10.1145/1753326.1753409"
    },
    {
      "text": "Ian Li, Anind K. Dey, and Jodi Forlizzi. 2012. Using Context to Reveal Factors That Affect Physical Activity. ACM Trans. Comput.-Hum. Interact. 19, 1, Article 7 (May 2012), 21 pages. https://doi.org/10.1145/2147783.2147790",
      "doi": "10.1145/2147783.2147790"
    },
    {
      "text": "Yuhan Luo, Peiyi Liu, and Eun Kyoung Choe. 2019. Co-Designing Food Trackers with Dietitians: Identifying Design Opportunities for Food Tracker Customization. In Proc. of CHI ’19. ACM, Article 592, 13 pages. https://doi.org/10.1145/3290605.3300822",
      "doi": "10.1145/3290605.3300822"
    },
    {
      "text": "Giorgia Lupi and Stefanie Posavec. 2016. Dear Data. Chronicle Books.",
      "doi": ""
    },
    {
      "text": "Nicolas Maisonneuve, Matthias Stevens, Maria E. Niessen, and Luc Steels. 2009. NoiseTube: Measuring and Mapping Noise Pollution with Mobile Phones. In Information Technologies in Environmental Engineering. Springer Berlin Heidelberg, 215–228. https://doi.org/10.1007/978-3-540-88351-7_16",
      "doi": ""
    },
    {
      "text": "Kim Marriott, Falk Schreiber, Tim Dwyer, Karsten Klein, Nathalie Henry Riche, Takayuki Itoh, Wolfgang Stuerzlinger, and Bruce H. Thomas. 2018. Immersive Analytics. Vol. 11190. Springer.",
      "doi": ""
    },
    {
      "text": "Matthew Mauriello, Michael Gubbels, and Jon E. Froehlich. 2014. Social Fabric Fitness: The Design and Evaluation of Wearable E-Textile Displays to Support Group Running. In Proc. of CHI ’14. ACM, 2833–2842. https://doi.org/10.1145/2556288.2557299",
      "doi": "10.1145/2556288.2557299"
    },
    {
      "text": "Mollie McKillop, Lena Mamykina, and Noémie Elhadad. 2018. Designing in the Dark: Eliciting Self-Tracking Dimensions for Understanding Enigmatic Disease. In Proc. of CHI ’18. ACM, Article 565, 15 pages. https://doi.org/10.1145/3173574.3174139",
      "doi": "10.1145/3173574.3174139"
    },
    {
      "text": "Miriah Meyer and Jason Dykes. 2020. Criteria for Rigor in Visualization Design Study. IEEE Transactions on Visualization and Computer Graphics 26, 1(2020), 87–97.",
      "doi": ""
    },
    {
      "text": "Elizabeth L. Murnane, Tara G. Walker, Beck Tench, Stephen Voida, and Jaime Snyder. 2018. Personal Informatics in Interpersonal Contexts: Towards the Design of Technology That Supports the Social Ecologies of Long-Term Mental Health Management. Proc. ACM Hum.-Comput. Interact. 2, CSCW, Article 127 (nov 2018), 27 pages. https://doi.org/10.1145/3274396",
      "doi": "10.1145/3274396"
    },
    {
      "text": "Carman Neustaedter, Tejinder K. Judge, and Phoebe Sengers. 2014. Autobiographical design in the home. In Studying and Designing Technology for Domestic Life: Lessons from Home. Vol. 135. Morgan Kaufmann Waltham, MA.",
      "doi": ""
    },
    {
      "text": "Carman Neustaedter and Phoebe Sengers. 2012. Autobiographical Design in HCI Research: Designing and Learning through Use-It-Yourself. In Proc. of DIS ’12. ACM, 514–523. https://doi.org/10.1145/2317956.2318034",
      "doi": "10.1145/2317956.2318034"
    },
    {
      "text": "Kenton O’Hara, Mark Perry, Elizabeth Churchill, and Daniel Russell. 2003. Public and situated displays: Social and interactional aspects of shared display technologies. Vol. 2. Springer Science & Business Media.",
      "doi": ""
    },
    {
      "text": "Simon Olberding, Jürgen Steimle, Suranga Nanayakkara, and Pattie Maes. 2015. CloudDrops: Stamp-Sized Pervasive Displays for Situated Awareness of Web-Based Information. In Proc. of PerDis ’15. ACM, 47–53. https://doi.org/10.1145/2757710.2757718",
      "doi": "10.1145/2757710.2757718"
    },
    {
      "text": "Juan Pablo, Piyum Fernando, Priyashri Sridhar, Anusha Withana, Suranga Nanayakkara, Jurgen Steimle, and Pattie Maes. 2016. PostBits: Using Contextual Locations for Embedding Cloud Information in the Home. Personal Ubiquitous Comput. 20, 6 (Nov. 2016), 1001–1014. https://doi.org/10.1007/s00779-016-0967-z",
      "doi": "10.1007/s00779-016-0967-z"
    },
    {
      "text": "Gaurav Paruthi, Shriti Raj, Seungjoo Baek, Chuyao Wang, Chuan-che Huang, Yung-Ju Chang, and Mark W. Newman. 2018. Heed: Exploring the Design of Situated Self-Reporting Devices. Proc. ACM Interact. Mob. Wearable Ubiquitous Technol. 2, 3, Article 132 (Sept. 2018), 21 pages. https://doi.org/10.1145/3264942",
      "doi": "10.1145/3264942"
    },
    {
      "text": "Laura Pina, Sang-Wha Sien, Clarissa Song, Teresa M. Ward, James Fogarty, Sean A. Munson, and Julie A. Kientz. 2020. DreamCatcher: Exploring How Parents and School-Age Children Can Track and Review Sleep Information Together. Proc. ACM Hum.-Comput. Interact. 4, CSCW1, Article 070 (May 2020), 25 pages. https://doi.org/10.1145/3392882",
      "doi": "10.1145/3392882"
    },
    {
      "text": "Bernd Ploderer, Wolfgang Reitberger, Harri Oinas-Kukkonen, and Julia Gemert-Pijnen. 2014. Social Interaction and Reflection for Behaviour Change. Personal Ubiquitous Comput. 18, 7 (Oct. 2014), 1667–1676. https://doi.org/10.1007/s00779-014-0779-y",
      "doi": "10.1007/s00779-014-0779-y"
    },
    {
      "text": "Henning Pohl, Andreea Muresan, and Kasper Hornbæk. 2019. Charting Subtle Interaction in the HCI Literature. In Proc. of CHI ’19. ACM, Article 418, 15 pages. https://doi.org/10.1145/3290605.3300648",
      "doi": "10.1145/3290605.3300648"
    },
    {
      "text": "Ivan Poupyrev, Nan-Wei Gong, Shiho Fukuhara, Mustafa Emre Karagozler, Carsten Schwesig, and Karen E. Robinson. 2016. Project Jacquard: Interactive Digital Textiles at Scale. In Proc. of CHI ’16. ACM, 4216–4227. https://doi.org/10.1145/2858036.2858176",
      "doi": "10.1145/2858036.2858176"
    },
    {
      "text": "Zachary Pousman, John Stasko, and Michael Mateas. 2007. Casual Information Visualization: Depictions of Data in Everyday Life. IEEE Transactions on Visualization and Computer Graphics 13, 6 (Nov. 2007), 1145–1152. https://doi.org/10.1109/TVCG.2007.70541",
      "doi": "10.1109/TVCG.2007.70541"
    },
    {
      "text": "Ruth Ravichandran, Sang-Wha Sien, Shwetak N. Patel, Julie A. Kientz, and Laura R. Pina. 2017. Making Sense of Sleep Sensors: How Sleep Sensing Technologies Support and Undermine Sleep Health. In Proc. of CHI ’17. ACM, 6864–6875. https://doi.org/10.1145/3025453.3025557",
      "doi": "10.1145/3025453.3025557"
    },
    {
      "text": "Jonathan C Roberts, Panagiotis D Ritsos, Sriram Karthik Badam, Dominique Brodbeck, Jessie Kennedy, and Niklas Elmqvist. 2014. Visualization beyond the Desktop–the Next Big Thing. IEEE Computer Graphics and Applications 34, 6 (Nov 2014), 26–34. https://doi.org/10.1109/MCG.2014.82",
      "doi": ""
    },
    {
      "text": "Johnny Rodgers and Lyn Bartram. 2011. Exploring Ambient and Artistic Visualization for Residential Energy Use Feedback. IEEE Transactions on Visualization and Computer Graphics 17, 12 (Dec 2011), 2489–2497. https://doi.org/10.1109/TVCG.2011.196",
      "doi": "10.1109/TVCG.2011.196"
    },
    {
      "text": "John Rooksby, Mattias Rost, Alistair Morrison, and Matthew Chalmers. 2014. Personal Tracking as Lived Informatics. In Proc. of CHI ’14. ACM, 1163–1172. https://doi.org/10.1145/2556288.2557039",
      "doi": "10.1145/2556288.2557039"
    },
    {
      "text": "Elizabeth B.-N. Sanders and Pieter Jan Stappers. 2008. Co-creation and the new landscapes of design. CoDesign 4, 1 (2008), 5–18. https://doi.org/10.1080/15710880701875068",
      "doi": ""
    },
    {
      "text": "Arvind Satyanarayan, Domink Moritz, Kanit Wongsuphasawat, and Jeffrey Heer. 2017. Vega-Lite: A Grammar of Interactive Graphics. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan 2017), 341–350. https://doi.org/10.1109/TVCG.2016.2599030",
      "doi": "10.1109/TVCG.2016.2599030"
    },
    {
      "text": "Samarth Singhal, Carman Neustaedter, William Odom, Lyn Bartram, and Yasamin Heshmat. 2018. Time-Turner: Designing for Reflection and Remembrance of Moments in the Home. In Proc. of CHI ’18. ACM, 1–14. https://doi.org/10.1145/3173574.3173753",
      "doi": "10.1145/3173574.3173753"
    },
    {
      "text": "John Stasko, Todd Miller, Zachary Pousman, Christopher Plaue, and Osman Ullah. 2004. Personalized Peripheral Information Awareness Through Information Art. In Proc. of UbiComp ’04. Springer Berlin Heidelberg, 18–35.",
      "doi": ""
    },
    {
      "text": "Alex S. Taylor, Siân Lindley, Tim Regan, David Sweeney, Vasillis Vlachokyriakos, Lillie Grainger, and Jessica Lingel. 2015. Data-in-Place: Thinking through the Relations Between Data and Community. In Proc. of CHI ’15. ACM, 2863–2872. https://doi.org/10.1145/2702123.2702558",
      "doi": "10.1145/2702123.2702558"
    },
    {
      "text": "Bruce H. Thomas, Gregory F. Welch, Pierre Dragicevic, Niklas Elmqvist, Pourang Irani, Yvonne Jansen, Dieter Schmalstieg, Aurélien Tabard, Neven A. M. ElSayed, Ross T. Smith, and Wesley Willett. 2018. Situated Analytics. In Immersive Analytics. Springer International Publishing, 185–220. https://doi.org/10.1007/978-3-030-01388-2_7",
      "doi": ""
    },
    {
      "text": "Alice Thudt, Uta Hinrichs, Samuel Huron, and Sheelagh Carpendale. 2018. Self-Reflection and Personal Physicalization Construction. In Proc. of CHI ’18. ACM, Article 154, 13 pages. https://doi.org/10.1145/3173574.3173728",
      "doi": "10.1145/3173574.3173728"
    },
    {
      "text": "Jo Vermeulen, Fahim Kawsar, Adalberto L. Simeone, Gerd Kortuem, Kris Luyten, and Karin Coninx. 2012. Informing the Design of Situated Glyphs for a Care Facility. In Proc. of IEEE VL/HCC ’12. 89–96. https://doi.org/10.1109/VLHCC.2012.6344490",
      "doi": ""
    },
    {
      "text": "Kendra A. Wannamaker, Sandeep Zechariah George Kollannur, Marian Dörk, and Wesley Willett. 2021. I/O Bits: User-Driven, Situated, and Dedicated Self-Tracking. In Proc. of DIS ’21. ACM, 523–537. https://doi.org/10.1145/3461778.3462138",
      "doi": "10.1145/3461778.3462138"
    },
    {
      "text": "Sean White and Steven Feiner. 2009. SiteLens: Situated Visualization Techniques for Urban Site Visits. In Proc. of CHI ’09. ACM, 1117–1120. https://doi.org/10.1145/1518701.1518871",
      "doi": "10.1145/1518701.1518871"
    },
    {
      "text": "Wesley Willett, Yvonne Jansen, and Pierre Dragicevic. 2017. Embedded Data Representations. IEEE Transactions on Visualization and Computer Graphics 23, 1 (Jan. 2017), 461–470. https://doi.org/10.1109/TVCG.2016.2598608",
      "doi": "10.1109/TVCG.2016.2598608"
    },
    {
      "text": "Kaiton Williams. 2015. An Anxious Alliance. In Proceedings of The Fifth Decennial Aarhus Conference on Critical Alternatives(CA ’15). Aarhus University Press, 121–131. https://doi.org/10.7146/aahcc.v1i1.21146",
      "doi": "10.7146/aahcc.v1i1.21146"
    },
    {
      "text": "Nadia Campo Woytuk, Marie Louise Juul Sondergaard, Marianela Ciolfi Felice, and Madeline Balaam. 2020. Touching and Being in Touch with the Menstruating Body. In Proc. of CHI ’20. ACM. https://doi.org/10.1145/3313831.3376471",
      "doi": ""
    },
    {
      "text": "Naomi Yamashita, Hideaki Kuzuoka, Keiji Hirata, Takashi Kudo, Eiji Aramaki, and Kazuki Hattori. 2017. Changing Moods: How Manual Tracking by Family Caregivers Improves Caring and Family Communication. In Proc. of CHI ’17. ACM, 158–169. https://doi.org/10.1145/3025453.3025843",
      "doi": "10.1145/3025453.3025843"
    },
    {
      "text": "Rayoung Yang, Eunice Shin, Mark W. Newman, and Mark S. Ackerman. 2015. When Fitness Trackers Don’t “Fit”: End-User Difficulties in the Assessment of Personal Tracking Device Accuracy. In Proc. of Ubicomp ’15. ACM, 623–634. https://doi.org/10.1145/2750858.2804269",
      "doi": "10.1145/2750858.2804269"
    }
  ]
}