{
  "doi": "10.1145/3491102.3517553",
  "title": "A Virtual Counselor for Breast Cancer Genetic Counseling: Adaptive Pedagogy Leads to Greater Knowledge Gain",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-17",
  "year": 2022,
  "badges": [],
  "abstract": "We describe an automated, multimodal embodied conversational agent that plays the role of a genetic counselor, designed to communicate breast cancer risk and the recommended medical guidelines to women. The counselor's dialogue is driven by intelligent tutoring systems techniques, risk communication principles, and information processing theories. The virtual counselor dynamically tailors its counseling based on user traits, preferred information processing methods, and dynamic comprehension assessments. We conducted a between-subject evaluation study with 30 women, comparing the adaptive counselor to a non-adaptive version of the counselor and a control condition. Women in the adaptive condition demonstrated a significantly greater increase in breast cancer genetics knowledge compared to women in the other conditions. Our results demonstrate the effectiveness of the multidimensional adaptation mechanisms for improving cancer genetic risk communication.",
  "authors": [
    {
      "name": "Shuo Zhou",
      "institution": "Northeastern University, United States",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87958888257",
      "orcid": "missing"
    },
    {
      "name": "Timothy Bickmore",
      "institution": "Northeastern University, United States",
      "img": "/do/10.1145/contrib-81100360895/rel-imgonly/81100360895.jpg",
      "acmid": "81100360895",
      "orcid": "0000-0002-2676-9788"
    }
  ],
  "references": [
    {
      "text": "Dale H. Lea, Kimberly A. Kaphingst, Deborah Bowen, 2011. Communicating genetic and genomic information: Health literacy and numeracy considerations. Public Health Genomics 14, 4-5 (2011), 279-289. https://doi.org/10.1159/000294191",
      "doi": ""
    },
    {
      "text": "Grace Wang and Carolyn Watts. 2007. The role of genetics in the provision of essential public health services. American journal of public health 97, 4 (2007), 620-625.",
      "doi": ""
    },
    {
      "text": "Tim Byers, Richard C. Wender, Ahmedin Jemal, 2016. The American Cancer Society challenge goal to reduce US cancer mortality by 50% between 1990 and 2015: Results and reflections. CA: A Cancer Journal for Clinicians 66, 5 (2016), 359-369. https://doi.org/10.3322/caac.21348",
      "doi": ""
    },
    {
      "text": "Jayoung Han, Paiboon Jungsuwadee, Olufunmilola Abraham, 2018. Shared decision-making and women's adherence to breast and cervical cancer screenings. International Journal of Environmental Research and Public Health 15, 7 (2018), 1509-1509. https://doi.org/10.3390/ijerph15071509",
      "doi": ""
    },
    {
      "text": "Emily B. Peterson, Wen-ying Sylvia Chou, Anna Gaysynsky, 2018. Communication of cancer-related genetic and genomic information: A landscape analysis of reviews. Translational Behavioral Medicine 8, 1 (2018), 59-70. https://doi.org/10.1093/tbm/ibx063",
      "doi": ""
    },
    {
      "text": "Olivia Evans, Faiza Gaba and Ranjit Manchanda. 2020. Population-based genetic testing for Women's cancer prevention. Best Practice & Research Clinical Obstetrics & Gynaecology 65 (2020), 139-153.",
      "doi": ""
    },
    {
      "text": "Christopher P Childers, Kimberly K Childers, Melinda Maggard-Gibbons, 2017. National estimates of genetic testing in women with a history of breast or ovarian cancer. Journal of Clinical Oncology 35, 34 (2017), 3800.",
      "doi": ""
    },
    {
      "text": "Theresa M. Marteau. 1999. Communicating genetic risk information. British medical bulletin 55, 2 (1999), 414-428. https://doi.org/10.1258/0007142991902466",
      "doi": ""
    },
    {
      "text": "Jessica S. Ancker and David Kaufman. 2007. Rethinking Health Numeracy: A Multidisciplinary Literature Review. Journal of the American Medical Informatics Association 14, 6 (2007), 713-721. https://doi.org/10.1197/jamia.M2464",
      "doi": ""
    },
    {
      "text": "Andrea J. Apter, Michael K. Paasche-Orlow, Janine T. Remillard, 2008. Numeracy and communication with patients: They are counting on us. Journal of General Internal Medicine 23, 12 (2008), 2117-2124. https://doi.org/10.1007/s11606-008-0803-x",
      "doi": ""
    },
    {
      "text": "Amanda L. Golbeck, Carolyn R. Ahlers-Schmidt, Angelia M. Paschal, 2005. A definition and operational framework for health numeracy. American Journal of Preventive Medicine 29, 4 (2005), 375-376. https://doi.org/10.1016/j.amepre.2005.06.012",
      "doi": ""
    },
    {
      "text": "Ellen Peters, Judith Hibbard, Paul Slovic, 2007. Numeracy skill and the communication, comprehension, and use of risk-benefit information. Health Affairs 26, 3 (2007), 741-748. https://doi.org/10.1377/hlthaff.26.3.741",
      "doi": ""
    },
    {
      "text": "Traci L Alberti and Nancy J Morris. 2017. Health literacy in the urgent care setting: What factors impact consumer comprehension of health information? Journal of the American Association of Nurse Practitioners 29, 5 (2017), 242-247.",
      "doi": ""
    },
    {
      "text": "Mark Kutner, Elizabeth Greenberg, Ying Jin, 2006. The Health Literacy of America's Adults: Results from the 2003 National Assessment of Adult Literacy. National Center for Education Statistics, Washington, DC, 2006.",
      "doi": ""
    },
    {
      "text": "Rima E. Rudd, Jennie Epstein Anderson, Sarah Oppenheimer, 2007. Health Literacy: An Update of Medical and Public Health Literature. In J. Comings, B. Garner and C. Smith (Eds.), pp. 175-204. Lawrence Erlbaum Associates, Mathway, N.J.",
      "doi": ""
    },
    {
      "text": "Gareth J. Hollands, David P. French, Simon J. Griffin, 2016. The impact of communicating genetic risks of disease on risk-reducing health behaviour: Systematic review with meta-analysis. BMJ (Online) 352 (2016), i1102-i1102. https://doi.org/10.1136/bmj.i1102",
      "doi": ""
    },
    {
      "text": "Craig W. Trumbo. 1999. Heuristic-systematic information processing and risk judgment. Risk Analysis 19, 3 (1999), 391-400. https://doi.org/10.1023/A:1007092410720",
      "doi": ""
    },
    {
      "text": "Shelly Chaiken. 1980. Heuristic versus systematic information processing and the use of source versus message cues in persuasion. Journal of Personality and Social Psychology 39, 5 (1980), 752-752. https://doi.org/10.1037/0022-3514.39.5.752",
      "doi": ""
    },
    {
      "text": "Shelly Chaiken, Akiva Liberman and Alice H. Eagly. 1989. Heuristic and systematic information processing within and beyond the persuasion context. In Unintended Thought, pp. 212-252.",
      "doi": ""
    },
    {
      "text": "Timothy W. Bickmore, Laura M. Pfeifer, Donna Byron, 2010. Usability of conversational agents by patients with inadequate health literacy: evidence from two clinical trials. Journal of health communication 15, S2 (2010), 197-210.",
      "doi": ""
    },
    {
      "text": "Shuo Zhou and Timothy Bickmore. 2021. Automating Cancer Genetic Counseling with an Adaptive Pedagogical Agent. In Proceedings of the Extended Abstracts of the 2021 CHI Conference on Human Factors in Computing Systems, 1-7.",
      "doi": "10.1145/3411763.3451675"
    },
    {
      "text": "Jehannine C. Austin. 2010. Re-conceptualizing risk in genetic counseling: Implications for clinical practice. Journal of genetic counseling 19, 3 (2010), 228-234. https://doi.org/10.1007/s10897-010-9279-z",
      "doi": ""
    },
    {
      "text": "Kieran O'Doherty and G. K. Suthers. 2007. Risky communication: Pitfalls in counseling about risk, and how to avoid them. Journal of genetic counseling 16, 4 (2007), 409-417. https://doi.org/10.1007/s10897-006-9077-9",
      "doi": ""
    },
    {
      "text": "Chris Jacobs, Christine Patch and Susan Michie. 2019. Communication about genetic testing with breast and ovarian cancer patients: a scoping review. European Journal of Human Genetics 27, 4 (2019), 511-524. https://doi.org/10.1038/s41431-018-0310-4",
      "doi": ""
    },
    {
      "text": "Susan Michie, Kathryn Lester, Julia Pinto, 2005. Communicating risk information in genetic counseling: An observational study. Health Education and Behavior 32, 5 (2005), 589-598. https://doi.org/10.1177/1090198105278562",
      "doi": ""
    },
    {
      "text": "Jeffrey R. Botkin, Ken R. Smith, Robert T. Croyle, 2003. Genetic testing for a BRCA1 mutation: Prophylactic surgery and screening behavior in women 2 years post testing. American Journal of Medical Genetics 118A, 3 (2003), 201-209. https://doi.org/10.1002/ajmg.a.10102",
      "doi": ""
    },
    {
      "text": "Jodi T. Heshka, Crystal Palleschi, Heather Howley, 2008. A systematic review of perceived risks, psychological and behavioral impacts of genetic testing. Genetics in Medicine 10, 1 (2008), 19-32. https://doi.org/10.1097/GIM.0b013e31815f524f",
      "doi": ""
    },
    {
      "text": "Beth N. Peshkin, Marc D. Schwartz, Claudine Isaacs, 2002. Utilization of breast cancer screening in a clinically based sample of women after BRCA1/2 testing. Cancer Epidemiology, Biomarkers & Prevention 11, 10 (2002), 1115-1118.",
      "doi": ""
    },
    {
      "text": "Lauren Scheuer, Noah Kauff, Mark Robson, 2002. Outcome of preventive surgery and screening for breast and ovarian cancer in BRCA mutation carriers. Journal of Clinical Oncology 20, 5 (2002), 1260-1268. https://doi.org/10.1200/JCO.20.5.1260",
      "doi": ""
    },
    {
      "text": "Kai Insa Schneider and Jörg Schmidtke. 2014. Patient compliance based on genetic medicine: A literature review. Journal of Community Genetics 5, 1 (2014), 31-48. https://doi.org/10.1007/s12687-013-0160-2",
      "doi": ""
    },
    {
      "text": "American Medical Association Ad Hoc Committee on Health Literacy for the Council on Scientific Affairs. 1999. Health Literacy: Report of the Council on Scientific Affairs. JAMA 281, 6 (1999), 552-557. https://doi.org/10.1001/jama.281.6.552",
      "doi": ""
    },
    {
      "text": "Mark Kutner, Elizabeth Greenberg and Justin Baer. 2006. A First Look at the Literacy of America's Adults in the 21st Century. National Center for Education Statistics, Washington, DC, 2006.",
      "doi": ""
    },
    {
      "text": "J. David Johnson, Donald O. Case, James E. Andrews, 2005. Genomics - The perfect information-seeking research problem. Journal of Health Communication 10, 4 (2005), 323-329. https://doi.org/10.1080/10810730590950048",
      "doi": ""
    },
    {
      "text": "Isaac M. Lipkus, Greg Samsa and Barbara K. Rimer. 2001. General performance on a numeracy scale among highly educated samples. Medical decision making 21, 1 (2001), 37-44.",
      "doi": ""
    },
    {
      "text": "Ellen Peters, Daniel Västfjäll, Paul Slovic, 2006. Numeracy and decision making. Psychological science 17, 5 (2006), 407-413.",
      "doi": ""
    },
    {
      "text": "Lisa M. Schwartz, Steven Woloshin, William C. Black, 1997. The role of numeracy in understanding the benefit of screening mammography. Annals of Internal Medicine 127, 11 (1997), 966-972. https://doi.org/10.7326/0003-4819-127-11-199712010-00003",
      "doi": ""
    },
    {
      "text": "Denise M. Lautenbach, Kurt D. Christensen, Jeffrey A. Sparks, 2013. Communicating Genetic Risk Information for Common Disorders in the Era of Genomic Medicine. Annual review of genomics and human genetics 14 (2013), 491-513. https://doi.org/10.1146/annurev-genom-092010-110722",
      "doi": ""
    },
    {
      "text": "Kimberly A. Kaphingst, Melvin Blanchard, Laurel Milam, 2016. Relationships between health literacy and genomics-related knowledge, self-efficacy, perceived importance, and communication in a medically underserved population. Journal of Health Communication 21, Suppl 1 (2016), 58-68. https://doi.org/10.1080/10810730.2016.1144661",
      "doi": ""
    },
    {
      "text": "Isaac M. Lipkus, Colleen M. McBride, Kathryn I. Pollak, 2004. Interpretation of genetic risk feedback among African American smokers with low socioeconomic status. Health Psychology 23, 2 (2004), 178-188.",
      "doi": ""
    },
    {
      "text": "Peter S. Houts, Cecilia C. Doak, Leonard G. Doak, 2006. The role of pictures in improving health communication: A review of research on attention, comprehension, recall, and adherence. Patient Education and Counseling 61, 2 (2006), 173-190. https://doi.org/10.1016/j.pec.2005.05.004",
      "doi": ""
    },
    {
      "text": "Shelly Chaiken and Alison Ledgerwood. 2012. A theory of heuristic and systematic information processing. In P. A. Van Lange, A. W. Kruglanski and E. T. Higgins (Eds.), pp. 246-266. SAGE Publications, London.",
      "doi": ""
    },
    {
      "text": "Holly Etchegary and Colin Perrier. 2007. Information processing in the context of genetic risk: Implications for genetic-risk communication. Journal of genetic counseling 16, 4 (2007), 419-432. https://doi.org/10.1007/s10897-006-9082-z",
      "doi": ""
    },
    {
      "text": "Robert J. Griffin, Sharon Dunwoody and Kurt Neuwirth. 1999. Proposed model of the relationship of risk information seeking and processing to the development of preventive behaviors. Environmental research 80, 2 (1999), S230-S245. https://doi.org/10.1006/enrs.1998.3940",
      "doi": ""
    },
    {
      "text": "Robert J. Griffin, Kurt Neuwirth, James Giese, 2002. Linking the heuristic-systematic model and depth of processing. Communication Research 29, 6 (2002), 705-732. https://doi.org/10.1177/009365002237833",
      "doi": ""
    },
    {
      "text": "Craig W Trumbo. 2002. Information processing and risk perception: An adaptation of the heuristic-systematic model. Journal of communication 52, 2 (2002), 367-382.",
      "doi": ""
    },
    {
      "text": "Vivianne H. M. Visschers, Ree M. Meertens, Wim W. F. Passchier, 2009. Probability Information in Risk Communication: A Review of the Research Literature. Risk Analysis 29, 2 (2009), 267-287. https://doi.org/10.1111/j.1539-6924.2008.01137.x",
      "doi": ""
    },
    {
      "text": "Russell H. Fazio and Tamara Towles-Schwen. 1999. The MODE model of attitude-behavior processes. In Shelly Chaiken and Yaacov Trope (Eds.), pp. 97-116. Guilford Press.",
      "doi": ""
    },
    {
      "text": "Shuo Zhou, Timothy Bickmore, Michael Paasche-Orlow, 2014. Agent-user concordance and satisfaction with a virtual hospital discharge nurse. In Proceedings of the International Conference on Intelligent Virtual Agents, 528-541.",
      "doi": ""
    },
    {
      "text": "Timothy W. Bickmore, Dina Utami, Shuo Zhou, 2015. Automated explanation of research informed consent by virtual agents. In Proceedings of the International Conference on Intelligent Virtual Agents. Springer, 260-269.",
      "doi": ""
    },
    {
      "text": "Timothy W. Bickmore, Laura M. Pfeifer and Michael K. Paasche-Orlow. 2009. Using computer agents to explain medical documents to patients with low health literacy. Patient education and counseling 75, 3 (2009), 315-320.",
      "doi": ""
    },
    {
      "text": "Shuo Zhou, Raghavendra Gali, Michael Paasche-Orlow, 2014. Afraid to ask: proactive assistance with healthcare documents using eye tracking. In Proceedings of the CHI'14 Extended Abstracts on Human Factors in Computing. ACM, Toronto, Ontario, Canada, 1669-1674. https://doi.org/10.1145/2559206.2581218",
      "doi": "10.1145/2559206.2581218"
    },
    {
      "text": "Catharine Wang, Timothy Bickmore, Deborah J. Bowen, 2015. Acceptability and feasibility of a virtual counselor (VICKY) to collect family health histories. Genetics in Medicine 17, 10 (2015), 822-822.",
      "doi": ""
    },
    {
      "text": "Timothy W. Bickmore, Laura Pfeifer and Brian Jack. 2009. Taking the Time to Care: Empowering Low Health Literacy Hospital Patients with Virtual Nurse Agents. In Proceedings of the Proceedings of the SIGCHI conference on human factors in computing systems. ACM, 1265-1274. https://doi.org/10.1145/1518701.1518891",
      "doi": "10.1145/1518701.1518891"
    },
    {
      "text": "John R. Anderson, C. Franklin Boyle and Brian J. Reiser. 1985. Intelligent Tutoring Systems. Science 228, 4698 (1985), 456-462. https://doi.org/10.1126/science.228.4698.456",
      "doi": ""
    },
    {
      "text": "Mohammed A. Al-Nakhal and Samy S. Abu Naser. 2017. Adaptive Intelligent Tutoring System for learning Computer Theory. European Academic Research 4, 10 (2017), 8770-8770.",
      "doi": ""
    },
    {
      "text": "Mohammed A. Hamed and Samy S. Abu Naser. 2017. An intelligent tutoring system for teaching the 7 characteristics for living things. International Journal of Advanced Research and Development 2, 1 (2017), 31-35.",
      "doi": ""
    },
    {
      "text": "Danial Hooshyar, Rodina Binti Ahmad, Moslem Yousefi, 2015. A flowchart-based intelligent tutoring system for improving problem-solving skills of novice programmers. Journal of Computer Assisted Learning 31, 4 (2015), 345-361.",
      "doi": "10.1111/jcal.12099"
    },
    {
      "text": "Derek Sleeman and John Seely Brown. 1982. Intelligent tutoring systems. Academic Press, New York.",
      "doi": ""
    },
    {
      "text": "James A. Kulik and J. D. Fletcher. 2016. Effectiveness of Intelligent Tutoring Systems: A Meta-Analytic Review. Review of Educational Research 86, 1 (2016), 42-78. https://doi.org/10.3102/0034654315581420",
      "doi": ""
    },
    {
      "text": "Stellan Ohlsson. 1986. Some principles of intelligent tutoring. Instructional Science 14, 3-4 (1986), 293-326. https://doi.org/10.1007/BF00051825",
      "doi": ""
    },
    {
      "text": "John R. Anderson, Albert T. Corbett, Kenneth R. Koedinger, 1995. Cognitive Tutors: Lessons Learned. Journal of the Learning Sciences 4, 2 (1995), 167-207. https://doi.org/10.1207/s15327809jls0402_2",
      "doi": ""
    },
    {
      "text": "Robert A Sottilare, Arthur Graesser, Xiangen Hu, 2014. Design Recommendations for Intelligent Tutoring Systems: Volume 2-Instructional Management. US Army Research Laboratory.",
      "doi": ""
    },
    {
      "text": "Douglas C. Merrill, Brian J. Reiser, Michael Ranney, 1992. Effective Tutoring Techniques: A Comparison of Human Tutors and Intelligent Tutoring Systems. Journal of the Learning Sciences 2, 3 (1992), 277-305. https://doi.org/10.1207/s15327809jls0203_2",
      "doi": ""
    },
    {
      "text": "Kurt VanLehn, Stephanie Siler, Charles Murray, 2003. Why Do Only Some Events Cause Learning During Human Tutoring? Cognition and Instruction 21, 3 (2003), 209-249. https://doi.org/10.1207/S1532690XCI2103_01",
      "doi": ""
    },
    {
      "text": "Barbara A. Fox. 1991. Cognitive and interactional aspects of correction in tutoring. In Teaching knowledge and intelligent tutoring, pp. 149-172.",
      "doi": ""
    },
    {
      "text": "Mark R. Lepper, Lisa G. Aspinwall, Donna L. Mumme, 2013. Self-perception and social-perception processes in tutoring: Subtle social control strategies of expert tutors. In Self-Inference Processes: The Ontario Symposium, pp. 217-237. Lawrence Erlbaum Associates, Inc, Hillsdale, NJ.",
      "doi": ""
    },
    {
      "text": "Albert T. Corbett and John R. Anderson. 2001. Locus of Feedback Control in Computer-based Tutoring: Impact on Learning Rate, Achievement and Attitudes. ACM, New York, NY, USA, 245-252. https://doi.org/10.1145/365024.365111",
      "doi": ""
    },
    {
      "text": "Sidney D'Mello and Arthur C. Graesser. 2012. AutoTutor and affective AutoTutor: Learning by talking with cognitively and emotionally intelligent computers that talk back. ACM Transactions on Interactive Intelligent Systems 2, 4 (2012), 23-23. https://doi.org/10.1145/2395123.2395128",
      "doi": "10.1145/2395123.2395128"
    },
    {
      "text": "Arthur C. Graesser, Patrick Chipman, Brian C. Haynes, 2005. Auto tutor: An intelligent tutoring system with mixed-initiative dialogue. IEEE Transactions on Education 48, 4 (2005), 612-618. https://doi.org/10.1109/TE.2005.856149",
      "doi": "10.1109/TE.2005.856149"
    },
    {
      "text": "Arthur C. Graesser, Shulan Lu, George Tanner Jackson, 2004. AutoTutor: A tutor with dialogue in natural language. Behavior Research Methods, Instruments, and Computers 36, 2 (2004), 180-192. https://doi.org/10.3758/BF03195563",
      "doi": ""
    },
    {
      "text": "Arthur C. Graesser, Katja Wiemer-Hastings, Peter Wiemer-Hastings, 1999. AutoTutor: A simulation of a human tutor. Cognitive Systems Research 1, 1 (1999), 35-51. https://doi.org/10.1016/S1389-0417(99)00005-4",
      "doi": "10.1016/S1389-0417%2899%2900005-4"
    },
    {
      "text": "Christopher R. Wolfe, Valerie F. Reyna, Colin L. Widmer, 2015. Efficacy of a web-based intelligent tutoring system for communicating genetic risk of breast cancer: A fuzzy-trace theory approach. Medical Decision Making 35, 1 (2015), 46-59. https://doi.org/10.1177/0272989X14535983",
      "doi": ""
    },
    {
      "text": "Colin L. Widmer, Christopher R. Wolfe, Valerie F. Reyna, 2015. Tutorial dialogues and gist explanations of genetic breast cancer risk. Behavior Research Methods 47, 3 (2015), 632-648. https://doi.org/10.3758/s13428-015-0592-1",
      "doi": ""
    },
    {
      "text": "Robert A Sottilare, Arthur Graesser, Xiangen Hu, 2013. Design recommendations for intelligent tutoring systems: Volume 1-learner modeling. US Army Research Laboratory.",
      "doi": ""
    },
    {
      "text": "Timothy W Bickmore, Ha Trinh, Stefan Olafsson, 2018. Patient and consumer safety risks when using conversational assistants for medical information: an observational study of Siri, Alexa, and Google Assistant. Journal of medical Internet research 20, 9 (2018), e11510.",
      "doi": ""
    },
    {
      "text": "National Comprehensive Cancer Network. 2020. Breast Cancer Risk Reduction (Version 1.2020). Retrieved from https://www.nccn.org/professionals/physician_gls/pdf/breast_risk.pdf",
      "doi": ""
    },
    {
      "text": "National Comprehensive Cancer Network. 2020. Breast Cancer Screening and Diagnosis (Version 1.2020). Retrieved from https://www.nccn.org/professionals/physician_gls/pdf/breast-screening.pdf",
      "doi": ""
    },
    {
      "text": "National Comprehensive Cancer Network. 2020. Genetic/Familial High-Risk Assessment: Breast, Ovarian, and Pancreatic (Version 2.2021). Retrieved from https://www.nccn.org/professionals/physician_gls/pdf/genetics_bop.pdf",
      "doi": ""
    },
    {
      "text": "Sara M. Fitzgerald-Butt, Andrew Bodine, Kevin M. Fry, 2016. Measuring genetic knowledge: A brief survey instrument for adolescents and adults. Clinical Genetics 89, 2 (2016), 235-243. https://doi.org/10.1111/cge.12618",
      "doi": ""
    },
    {
      "text": "Katende Godfrey, Tukamuhebwa Agatha and Joyce Nankumbi. 2016. Breast cancer knowledge and breast self-examination practices among female university students in Kampala, Uganda: A descriptive study. Oman Medical Journal 31, 2 (2016), 129-129. https://doi.org/10.5001/omj.2016.25",
      "doi": ""
    },
    {
      "text": "N. A. S. Alwan, W. M. Al-Attar, R. A. Eliessa, 2012. Knowledge, attitude and practice regarding breast cancer and breast self-examination among a sample of the educated population in Iraq. Eastern Mediterranean Health Journal 18, 4 (2012), 337-345. https://doi.org/10.26719/2012.18.4.337",
      "doi": ""
    },
    {
      "text": "Kenneth R. Koedinger and Albert Corbett. 2005. Cognitive Tutors: Technology Bringing Learning Sciences to the Classroom. In R. Keith Sawyer (Ed.), pp. 61-78. Cambridge University Press, Cambridge.",
      "doi": ""
    },
    {
      "text": "Barry D. Weiss, Mary Z. Mays, William Martz, 2005. Quick assessment of literacy in primary care: The newest vital sign. Annals of Family Medicine 3, 6 (2005), 514-522. https://doi.org/10.1370/afm.405",
      "doi": ""
    },
    {
      "text": "Danielle Braun, Jiabei Yang, Molly Griffin, 2018. A clinical decision support tool to predict cancer risk for commonly tested cancer-related germline mutations. Journal of genetic counseling 27, 5 (2018), 1187-1199.",
      "doi": ""
    },
    {
      "text": "American Cancer Society. 2017. Breast Cancer Facts & Figures 2017-2018.",
      "doi": ""
    },
    {
      "text": "Caryn Lerman, Steven Narod, Kevin Schulman, 1996. BRCA1 testing in families with hereditary breast-ovarian cancer: a prospective study of patient decision making and outcomes. Jama 275, 24 (1996), 1885-1892.",
      "doi": ""
    },
    {
      "text": "Caryn Lerman, Barbara Biesecker, Judith L. Benkendorf, 1997. Controlled trial of pretest education approaches to enhance informed decision-making for BRCA1 gene testing. Journal of the National Cancer Institute 89, 2 (1997), 148-157.",
      "doi": ""
    },
    {
      "text": "Courtney Lynam Scherr, Juliette Christie and Susan T. Vadaparampil. 2016. Breast cancer survivors' knowledge of hereditary breast and ovarian cancer following genetic counseling: an exploration of general and survivor-specific knowledge items. Public health genomics 19, 1 (2016), 1-10.",
      "doi": ""
    },
    {
      "text": "Ziad Bakouny, Marco Paciotti, Andrew L Schmidt, 2021. Cancer screening tests and cancer diagnoses during the COVID-19 pandemic. JAMA oncology 7, 3 (2021), 458-460.",
      "doi": ""
    }
  ]
}