{
  "doi": "10.1145/3491102.3502066",
  "title": "Public Views on Digital COVID-19 Certificates: a Mixed Methods User Study",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-28",
  "year": 2022,
  "badges": [],
  "abstract": "The COVID-19 pandemic has led governments worldwide to introduce various measures restricting human activity and mobility. Along with the administration of COVID-19 vaccinations and rapid testing, socio-technological solutions such as digital COVID-19 certificates have been considered as a strategy to lessen these restrictions and allow the resumption of routine activities. Using a mixed-methods approach – a survey (n=1008) and 27 semi-structured interviews – this study explores the attitudes of residents in the Republic of Ireland towards the idea of introducing digital COVID-19 certificates. We examine the topics of acceptability, fairness, security and privacy of COVID-related personal data, and practical considerations for implementation. Our study reveals the conditional and contextual nature of the acceptability of digital certificates, identifying specific factors that affect it, associated data practices, and related public concerns and expectations of such technologies.",
  "authors": [
    {
      "name": "Leysan Nurgalieva",
      "institution": "Aalto University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99659179264",
      "orcid": "0000-0002-8870-7363"
    },
    {
      "name": "Seamus Ryan",
      "institution": "Trinity College Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233684",
      "orcid": "missing"
    },
    {
      "name": "Andreas Balaskas",
      "institution": "Trinity College Dublin, Ireland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660233257",
      "orcid": "missing"
    },
    {
      "name": "Janne Lindqvist",
      "institution": "Aalto University, Finland",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "87259030457",
      "orcid": "0000-0002-8659-2283"
    },
    {
      "name": "Gavin Doherty",
      "institution": "Trinity College Dublin, Ireland",
      "img": "/do/10.1145/contrib-81100175529/rel-imgonly/81100175529.jpg",
      "acmid": "81100175529",
      "orcid": "0000-0002-9617-7008"
    }
  ],
  "references": [
    {
      "text": "[n.d.]. Digital Covid Cert Checker. https://app.digitalcovidcertchecker.gov.ie/",
      "doi": ""
    },
    {
      "text": "M Sharif Abbasi, Ali Tarhini, Mohammed Hassouna, and Farwa Shah. 2015. Social, organizational, demography and individuals’ technology acceptance behaviour: a conceptual model. European Scientific Journal 11, 9 (2015), 48–76.",
      "doi": ""
    },
    {
      "text": "Corey Angst and Ritu Agarwal. 2006. Digital Health Records and Privacy Concerns: OvercommingKey Barriers To Adoption. ICIS 2006 Proceedings(2006), 82.",
      "doi": ""
    },
    {
      "text": "Iván Aranzales, Ho Fai Chan, Reiner Eichenberger, Rainer Hegselmann, David Stadelmann, and Benno Torgler. 2021. Scientists have favorable opinions on immunity certificates but raise concerns regarding fairness and inequality. Scientific reports 11, 1 (2021), 1–13.",
      "doi": ""
    },
    {
      "text": "F Baylis and N Kofler. 2020. COVID-19 immunity testing: a passport to inequity. Issues in Science and Technology 29 (2020).",
      "doi": ""
    },
    {
      "text": "Cynthia Bennett and Os Keyes. 2020. What is the point of fairness?Interactions 27, 3 (apr 2020), 35–39. https://doi.org/10.1145/3386383",
      "doi": ""
    },
    {
      "text": "C Betsch, L Korn, L Felgendreff, S Eitze, P Schmid, P Sprengholz, L Wieler, P Schmich, V Stollorz, M Ramharter, 2021. German COVID-19 Snapshot Monitoring (COSMO)–Welle 10 (05.05. 2020). PsychArchives.",
      "doi": ""
    },
    {
      "text": "Katrina A Bramstedt. 2020. Antibodies as currency: COVID-19’s golden passport. Journal of Bioethical Inquiry 17, 4 (2020), 687–689.",
      "doi": ""
    },
    {
      "text": "Rebecca CH Brown, Dominic Kelly, Dominic Wilkinson, and Julian Savulescu. 2020. The scientific and ethical feasibility of immunity passports. The Lancet Infectious Diseases(2020).",
      "doi": ""
    },
    {
      "text": "Rebecca CH Brown, Julian Savulescu, Bridget Williams, and Dominic Wilkinson. 2020. Passport to freedom? Immunity passports for COVID-19. Journal of Medical Ethics 46, 10 (2020), 652–659.",
      "doi": ""
    },
    {
      "text": "European Comission. [n.d.]. EU Digital COVID Certificate. https://ec.europa.eu/info/live-work-travel-eu/coronavirus-response/safe-covid-19-vaccines-europeans/eu-digital-covid-certificate_en [accessed 2021 September 7]",
      "doi": ""
    },
    {
      "text": "Iñigo de Miguel Beriain and Jon Rueda. 2020. Immunity passports, fundamental rights and public health hazards: a reply to Brown et al. Journal of Medical Ethics 46, 10 (2020), 660–661.",
      "doi": ""
    },
    {
      "text": "Kevin Doherty, Marguerite Barry, José Marcano Belisario, Cecily Morrison, Josip Car, and Gavin Doherty. 2020. Personal information and public health: Design tensions in sharing and monitoring wellbeing in pregnancy. International Journal of Human-Computer Studies 135 (mar 2020), 102373. https://doi.org/10.1016/j.ijhcs.2019.102373",
      "doi": "10.1016/j.ijhcs.2019.102373"
    },
    {
      "text": "P Murali Doraiswamy, Mohan Chilukuri, Alexandra Rose Linares, and Katrina A Bramstedt. 2021. Are we ready for COVID-19’s Golden Passport? Insights from a Global Physician Survey. medRxiv (2021), 2020–11.",
      "doi": ""
    },
    {
      "text": "John Drury, Guanlan Mao, Ann John, Atiya Kamal, G James Rubin, Clifford Stott, Tushna Vandrevala, and Theresa M Marteau. 2021. Behavioural responses to Covid-19 health certification: A rapid review. BMC Public Health 21, 1 (2021), 1–16.",
      "doi": ""
    },
    {
      "text": "Vincent Dutot, Veera Bhatiasevi, and Nadim Bellallahom. 2019. Applying the technology acceptance model in a three-countries study of smartwatch adoption. The Journal of High Technology Management Research 30, 1 (2019), 1–14.",
      "doi": ""
    },
    {
      "text": "Pascal Geldsetzer. 2020. Use of rapid online surveys to assess people’s perceptions during infectious disease outbreaks: a cross-sectional survey on COVID-19. Journal of medical Internet research 22, 4 (2020), e18790.",
      "doi": ""
    },
    {
      "text": "SARAH Gibney, LUCY Bruton, and PETER Doherty. 2020. COVID contact tracing app: user perspectives and experience research. Research Services and Policy Unit, Research and Development and Health Analytics Division, Department of Health(2020).",
      "doi": ""
    },
    {
      "text": "Lawrence O Gostin, I Glenn Cohen, and Jana Shaw. 2021. Digital Health Passes in the Age of COVID-19: Are “Vaccine Passports” Lawful and Ethical?JAMA 325, 19 (2021), 1933–1934.",
      "doi": ""
    },
    {
      "text": "Michael C Grant, Luke Geoghegan, Marc Arbyn, Zakaria Mohammed, Luke McGuinness, Emily L Clarke, and Ryckie G Wade. 2020. The prevalence of symptoms in 24,410 adults infected by the novel coronavirus (SARS-CoV-2; COVID-19): a systematic review and meta-analysis of 148 studies from 9 countries. PloS one 15, 6 (2020), e0234765.",
      "doi": ""
    },
    {
      "text": "Oskar Josef Gstrein. 2021. The EU Digital COVID Certificate: A Preliminary Data Protection Impact Assessment. European Journal of Risk Regulation, Forthcoming (2021).",
      "doi": ""
    },
    {
      "text": "Tiago Cravo Oliveira Hashiguchi. 2020. Bringing health care to the patient: An overview of the use of telemedicine in OECD countries. (2020).",
      "doi": ""
    },
    {
      "text": "Steve Jacob and Justin Lawarée. 2021. The adoption of contact tracing applications of COVID-19 by European governments. Policy Design and Practice 4, 1 (2021), 44–58.",
      "doi": ""
    },
    {
      "text": "Hannah Julienne, Ciarán Lavin, Cameron Belton, Martina Barjaková, Shane Timmons, and Peter D Lunn. 2020. Behavioural pre-testing of COVID Tracker, Ireland’s contact-tracing app. (2020).",
      "doi": ""
    },
    {
      "text": "Satu Jumisko-Pyykkö and Teija Vainio. 2010. Framing the context of use for mobile HCI. International journal of mobile human computer interaction (IJMHCI) 2, 4(2010), 1–28.",
      "doi": ""
    },
    {
      "text": "Maria Kasinidou, Styliani Kleanthous, Pınar Barlas, and Jahna Otterbacher. 2021. I agree with the decision, but they didn’t deserve this. In Proceedings of the 2021 ACM Conference on Fairness, Accountability, and Transparency. ACM, New York, NY, USA, 690–700. https://doi.org/10.1145/3442188.3445931",
      "doi": "10.1145/3442188.3445931"
    },
    {
      "text": "Natalie Kofler and Françoise Baylis. 2020. Ten reasons why immunity passports are a bad idea.",
      "doi": ""
    },
    {
      "text": "Marvin Kowalewski, Franziska Herbert, Theodor Schnitzler, and Markus Dürmuth. 2021. Proof-of-Vax: Studying User Preferences and Perception of Covid Vaccination Certificates. arXiv preprint arXiv:2106.11676(2021).",
      "doi": ""
    },
    {
      "text": "Matt Kusner, Joshua Loftus, Chris Russell, and Ricardo Silva. 2017. Counterfactual fairness. Advances in Neural Information Processing Systems 2017-Decem, Nips(2017), 4067–4077. arxiv:1703.06856",
      "doi": ""
    },
    {
      "text": "Emily A Largent, Govind Persad, Samantha Sangenito, Aaron Glickman, Connor Boyle, and Ezekiel J Emanuel. 2020. US public attitudes toward COVID-19 vaccine mandates. JAMA network open 3, 12 (2020), e2033324–e2033324.",
      "doi": ""
    },
    {
      "text": "Jonathan Lazar, Jinjuan Heidi Feng, and Harry Hochheiser. 2017. Research methods in human-computer interaction. Morgan Kaufmann.",
      "doi": ""
    },
    {
      "text": "Stephan Lewandowsky, Simon Dennis, Andrew Perfors, Yoshihisa Kashima, Joshua P White, Paul Garrett, Daniel R Little, and Muhsin Yesilada. 2021. Public acceptance of privacy-encroaching policies to address the COVID-19 pandemic in the United Kingdom. Plos one 16, 1 (2021), e0245740.",
      "doi": ""
    },
    {
      "text": "Pintu Lohar, Guodong Xie, Malika Bendechache, Rob Brennan, Edoardo Celeste, Ramona Trestian, and Irina Tal. 2021. Irish attitudes toward COVID tracker app & privacy: sentiment analysis on Twitter and survey data. In 2021 The 16th International Conference on Availability, Reliability and Security (ARES 2021). ACM. 1–8.",
      "doi": "10.1145/3465481.3469193"
    },
    {
      "text": "Larissa G Malagoli, Julia Stancioli, Carlos HG Ferreira, Marisa Vasconcelos, Ana Paula Couto da Silva, and Jussara M Almeida. 2021. A Look into COVID-19 Vaccination Debate on Twitter. In 13th ACM Web Science Conference 2021. 225–233.",
      "doi": "10.1145/3447535.3462498"
    },
    {
      "text": "Seema Mohapatra. 2021. Passports of Privilege. American University Law Review, Forthcoming(2021).",
      "doi": ""
    },
    {
      "text": "Jessica Morley, Caio C.V. Machado, Christopher Burr, Josh Cowls, Indra Joshi, Mariarosaria Taddeo, and Luciano Floridi. 2020. The ethics of AI in health care: A mapping review. https://doi.org/10.1016/j.socscimed.2020.113172",
      "doi": ""
    },
    {
      "text": "Camille Nadal, Corina Sas, and Gavin Doherty. 2020. Technology acceptance in mobile health: scoping review of definitions, models, and measurement. Journal of Medical Internet Research 22, 7 (2020), e17256.",
      "doi": ""
    },
    {
      "text": "Mayssam Nehme, Helene Baysson, Nick Pullen, Ania Wisniak, Francesco Penacchio, Maria-Eugenia Zaballa, Vanessa Fargnoli, Didier Trono, Laurent Kaiser, Samia Hurst, 2021. Perceptions of immunity and vaccination certificates among the general population of Geneva, Switzerland.medRxiv (2021).",
      "doi": ""
    },
    {
      "text": "Mayssam Nehme, Silvia Stringhini, Idris Guessous, SEROCoV-Pop Study Team, 2020. Perceptions of immunity and vaccination certificates among the general population: a nested study within a serosurvey of anti-SARS-CoV-2 antibodies (SEROCoV-POP). Swiss medical weekly 150(2020).",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2004. Privacy as contextual integrity. Wash. L. Rev. 79(2004), 119.",
      "doi": ""
    },
    {
      "text": "Helen Nissenbaum. 2020. Privacy in context. Stanford University Press.",
      "doi": ""
    },
    {
      "text": "Leysan Nurgalieva, David O’Callaghan, and Gavin Doherty. 2020. Security and privacy of mHealth applications: a scoping review. IEEE Access 8(2020), 104247–104268.",
      "doi": ""
    },
    {
      "text": "Leysan Nurgalieva, Seamus Ryan, and Andreas Balaskas. 2021. Public views on digital vaccination certification in the Republic of Ireland. https://doi.org/10.17605/OSF.IO/SHGQM",
      "doi": ""
    },
    {
      "text": "Leysan Nurgalieva, Seamus Ryan, and Gavin Doherty. 2021. Attitudes towards COVID-19 contact tracing apps: a cross-national survey. IEEE Access (2021). https://doi.org/10.1109/ACCESS.2021.3136649",
      "doi": ""
    },
    {
      "text": "Michael Edmund O’Callaghan, Jim Buckley, Brian Fitzgerald, Kevin Johnson, John Laffey, Bairbre McNicholas, Bashar Nuseibeh, Derek O’Keeffe, Ian O’Keeffe, Abdul Razzaq, 2020. A national survey of attitudes to COVID-19 digital contact tracing in the Republic of Ireland. Irish Journal of Medical Science (1971-)(2020), 1–25.",
      "doi": ""
    },
    {
      "text": "Eyal Peer, Laura Brandimarte, Sonam Samat, and Alessandro Acquisti. 2017. Beyond the Turk: Alternative platforms for crowdsourcing behavioral research. Journal of Experimental Social Psychology 70 (2017), 153–163.",
      "doi": ""
    },
    {
      "text": "Govind Persad and Ezekiel J Emanuel. 2020. The ethics of COVID-19 immunity-based licenses (”immunity passports”). Jama 323, 22 (2020), 2241–2242.",
      "doi": ""
    },
    {
      "text": "Alexandra L Phelan. 2020. COVID-19 immunity passports and vaccination certificates: scientific, equitable, and legal challenges. The Lancet 395, 10237 (2020), 1595–1598.",
      "doi": ""
    },
    {
      "text": "Qualtrics. 2020. Online Survey Software - 1B+ Surveys Annually. Qualtrics Core XM Survey Software.[accessed 2021 March 25] (2020). https://www.qualtrics.com/uk/core-xm/survey-software/",
      "doi": ""
    },
    {
      "text": "R Core Team. 2020. R: A Language and Environment for Statistical Computing. R Foundation for Statistical Computing, Vienna, Austria. https://www.R-project.org/",
      "doi": ""
    },
    {
      "text": "Kaavya Rekanar, Ian R. O’Keeffe, Sarah Buckley, Manzar Abbas, Sarah Beecham, Muslim Chochlov, Brian Fitzgerald, Liam Glynn, Kevin Johnson, John Laffey, Bairbre McNicholas, Bashar Nuseibeh, James O’Connell, Derek O’Keeffe, Mike O’Callaghan, Abdul Razzaq, Ita Richardson, Andrew Simpkin, Cristiano Storni, Damyanka Tsvyatkova, Jane Walsh, Thomas Welsh, and Jim Buckley. 2021. Sentiment analysis of user feedback on the HSE’s Covid-19 contact tracing app. Irish Journal of Medical Science (1971 -)0123456789 (feb 2021). https://doi.org/10.1007/s11845-021-02529-y",
      "doi": ""
    },
    {
      "text": "Kaavya Rekanar, Ian R O’Keeffe, Sarah Buckley, Manzar Abbas, Sarah Beecham, Muslim Chochlov, Brian Fitzgerald, Liam Glynn, Kevin Johnson, John Laffey, 2021. Sentiment analysis of user feedback on the HSE’s Covid-19 contact tracing app. Irish Journal of Medical Science (1971-)(2021), 1–10.",
      "doi": ""
    },
    {
      "text": "Paul Reynolds. 2021. The anatomy of the health service cyber attack. (May 2021). https://www.rte.ie/news/analysis-and-comment/2021/0523/1223337-cyber-attack-hse/",
      "doi": ""
    },
    {
      "text": "Leonie Schaewitz, Stephan Winter, and Nicole C Krämer. 2021. The Influence of privacy control options on the evaluation and user acceptance of mobile applications for volunteers in crisis situations. Behaviour & Information Technology 40, 8 (2021), 759–775.",
      "doi": ""
    },
    {
      "text": "Patricia Schlagenhauf, Dipti Patel, Alfonso Rodriguez-Morales, Philippe Gautret, Martin P Grobusch, and Karin Leder. 2021. Variants, vaccines and vaccination passports: Challenges and chances for travel medicine in 2021. Travel medicine and infectious disease(2021).",
      "doi": ""
    },
    {
      "text": "Happy Scribe. [n.d.]. Audio Transcription & Video Subtitles. https://www.happyscribe.com/",
      "doi": ""
    },
    {
      "text": "John S Seberger and Sameer Patil. 2021. Us and Them (and It): Social Orientation, Privacy Concerns, and Expected Use of Pandemic-Tracking Apps in the United States. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–19.",
      "doi": "10.1145/3411764.3445485"
    },
    {
      "text": "Tanusree Sharma, Hunter A Dyer, and Masooda Bashir. 2021. Enabling user-centered privacy controls for mobile applications: Covid-19 perspective. ACM Transactions on Internet Technology (TOIT) 21, 1 (2021), 1–24.",
      "doi": "10.1145/3434777"
    },
    {
      "text": "Niamh Towey. [n.d.]. Covid-19 Vaccine Tracker: How many people have been inoculated in Ireland?https://www.irishtimes.com/news/health/covid-19-vaccine-tracker-how-many-people-have-been-inoculated-in-ireland-1.4481095",
      "doi": ""
    },
    {
      "text": "Kelvin KF Tsoi, Joseph JY Sung, Helen WY Lee, Karen KL Yiu, Hong Fung, and Samuel YS Wong. 2021. The way forward after COVID-19 vaccination: vaccine passports with blockchain to protect personal privacy. BMJ Innovations 7, 2 (2021).",
      "doi": ""
    },
    {
      "text": "Christine Utz, Steffen Becker, Theodor Schnitzler, Florian M Farke, Franziska Herbert, Leonie Schaewitz, Martin Degeling, and Markus Dürmuth. 2021. Apps against the spread: Privacy implications and user acceptance of COVID-19-related smartphone apps on three continents. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems. 1–22.",
      "doi": "10.1145/3411764.3445517"
    },
    {
      "text": "My Villius Zetterholm, Yanqing Lin, and Päivi Jokela. 2021. Digital contact tracing applications during COVID-19: A scoping review about public acceptance. In Informatics, Vol. 8. Multidisciplinary Digital Publishing Institute, 48.",
      "doi": ""
    },
    {
      "text": "Teck Chuan Voo, Hannah Clapham, and Clarence C Tam. 2020. Ethical implementation of immunity passports during the COVID-19 pandemic. The Journal of infectious diseases 222, 5 (2020), 715–718.",
      "doi": ""
    },
    {
      "text": "Anna Wnuk, Tomasz Oleksy, and Dominika Maison. 2020. The acceptance of Covid-19 tracking technologies: The role of perceived threat, lack of control, and ideological beliefs. PloS one 15, 9 (2020), e0238973.",
      "doi": ""
    },
    {
      "text": "Hao Xu, Lei Zhang, Oluwakayode Onireti, Yang Fang, William J Buchanan, and Muhammad Ali Imran. 2020. Beeptrace: Blockchain-enabled privacy-preserving contact tracing for covid-19 pandemic and beyond. IEEE Internet of Things Journal 8, 5 (2020), 3915–3929.",
      "doi": ""
    },
    {
      "text": "YouGov. 2020. YouGov / Sky Survey Results (2nd - 3rd December 2020). https://docs.cdn.yougov.com/8jj48ajo8c/SKY_Vaccine_201203.pdf",
      "doi": ""
    }
  ]
}