{
  "doi": "10.1145/3491102.3501862",
  "title": "Q-Chef: The impact of surprise-eliciting systems on food-related decision-making",
  "published": "2022-04-28",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [],
  "abstract": "Choosing what to eat requires navigating a large volume of information and various competing factors. While recommendation systems are an effective approach to assist users with this culinary decision-making, they typically prioritise similarity to a query or user profile to give relevant results. This can expose users to an increasingly narrow band of phenomena, which could compromise dietary diversity, a factor in dietary quality. We designed Q-Chef, which combines a recipe recommendation system with a personalised model of surprise, and conducted a study to identify if surprise-eliciting recipes affect food decisions. Our study utilises a rigorous thematic analysis with over 40 participants to explore how computational models of surprise influence recipe choice. We also explored how these factors differed when people were presented with “surprising-yet-tasty” recipes, as opposed to just “tasty” recipes, and identified that being presented with surprising choices is more likely to elicit situational interest and prompt reflection on choices. We conclude with a set of suggestions for the design of future surprise-eliciting recipe systems.",
  "tags": [
    "recommender systems",
    "mixed methods",
    "surprise",
    "food",
    "curiosity"
  ],
  "authors": [
    {
      "name": "Kazjon Grace",
      "institution": "Design Lab, The University of Sydney, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81418600109",
      "orcid": "missing"
    },
    {
      "name": "Elanor Finch",
      "institution": "Design Lab, The University of Sydney, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660238840",
      "orcid": "missing"
    },
    {
      "name": "Natalia Gulbransen-Diaz",
      "institution": "Design Lab, The University of Sydney, Australia",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99660239563",
      "orcid": "missing"
    },
    {
      "name": "Hamish Henderson",
      "institution": "Design Lab, The University of Sydney, Australia",
      "img": "/do/10.1145/contrib-99659234292/rel-imgonly/hhsquare.jpg",
      "acmid": "99659234292",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Fakhri Abbas, Nadia Najjar, and David Wilson. 2021. The Bites Eclectic: Critique-Based Conversational Recommendation for Diversity-Focused Meal Planning. In International Conference on Case-Based Reasoning. Springer, 1–16.",
      "doi": ""
    },
    {
      "text": "Panagiotis Adamopoulos and Alexander Tuzhilin. 2014. On unexpectedness in recommender systems: Or how to better expect the unexpected. ACM Transactions on Intelligent Systems and Technology 5, 4 (2014), 1–32. https://doi.org/10.1145/2559952",
      "doi": "10.1145/2559952"
    },
    {
      "text": "Mandy M. Archibald. 2016. Investigator Triangulation. Journal of Mixed Methods Research 10, 3 (jul 2016). https://doi.org/10.1177/1558689815570092",
      "doi": ""
    },
    {
      "text": "Ty Beal, Eric Massiot, Joanne E Arsenault, Matthew R Smith, and Robert J Hijmans. 2017. Global trends in dietary micronutrient supplies and estimated prevalence of inadequate intakes. (2017). https://doi.org/10.1371/journal.pone.0175554",
      "doi": ""
    },
    {
      "text": "Daniel Berlyne. 1966. Curiosity and Exploration. Science 153, 3731 (1966), 25–33.",
      "doi": ""
    },
    {
      "text": "Daniel E Berlyne. 1970. Novelty, complexity, and hedonic value. Perception & psychophysics 8, 5 (1970), 279–286.",
      "doi": ""
    },
    {
      "text": "Piotr Bojanowski, Edouard Grave, Armand Joulin, and Tomas Mikolov. 2017. Enriching Word Vectors with Subword Information. Transactions of the Association for Computational Linguistics 5 (dec 2017). https://doi.org/10.1162/tacl_a_00051",
      "doi": ""
    },
    {
      "text": "Murray Bookchin. 1990. The Philosophy of Social Ecology: Essays on Dialectical Materialism. Black Rose Books, Montreal. 198 pages.",
      "doi": ""
    },
    {
      "text": "Virginia Braun and Victoria Clarke. 2006. Using thematic analysis in psychology. Qualitative Research in Psychology 3, 2 (2006), 77–101. https://doi.org/10.1191/1478088706qp063oa",
      "doi": "10.1191/1478088706QP063OA"
    },
    {
      "text": "Ricardo J. G. B. Campello, Davoud Moulavi, and Joerg Sander. 2013. Density-Based Clustering Based on Hierarchical Density Estimates. https://doi.org/10.1007/978-3-642-37456-2_14",
      "doi": ""
    },
    {
      "text": "Jessy Ceha, Nalin Chhibber, Joslin Goh, Corina McDonald, Pierre Yves Oudeyer, Dana Kulić, and Edith Law. 2019. Expression of curiosity in social robots design, perception, and effects on behaviour. Conference on Human Factors in Computing Systems - Proceedings (2019), 1–12. https://doi.org/10.1145/3290605.3300636",
      "doi": ""
    },
    {
      "text": "J. Corbin and A. Strauss. 2014. Basics of Qualitative Research: Techniques and Procedures for Developing Grounded Theory. SAGE Publications. https://books.google.com.au/books?id=hZ6kBQAAQBAJ",
      "doi": ""
    },
    {
      "text": "Adrianus Dingeman De Groot. 2014. The meaning of “significance” for different types of research [translated and annotated by eric-jan wagenmakers, denny borsboom, josine verhagen, rogier kievit, marjan bakker, angelique cramer, dora matzke, don mellenbergh, and han lj van der maas]. Acta psychologica 148(2014), 188–194.",
      "doi": ""
    },
    {
      "text": "Haluk Demirkan and James C Spohrer. 2018. Commentary—cultivating T-shaped professionals in the era of digital transformation. Service Science 10, 1 (2018), 98–109.",
      "doi": "10.5555/3272639.3272647"
    },
    {
      "text": "N Denzin. 1978. The research act: a theoretical introduction to sociological methods (2 ed.). McGraw-Hill, New York.",
      "doi": ""
    },
    {
      "text": "Alan Menk Dos Santos. 2015. A hybrid recommendation system based on human curiosity. In RecSys 2015 - Proceedings of the 9th ACM Conference on Recommender Systems. Association for Computing Machinery, Inc, 367–370. https://doi.org/10.1145/2792838.2796545",
      "doi": "10.1145/2792838.2796545"
    },
    {
      "text": "Larissa S. Drescher, Silke Thiele, and Gert B. M. Mensink. 2007. A New Index to Measure Healthy Food Diversity Better Reflects a Healthy Diet Than Traditional Measures. The Journal of Nutrition 137, 3 (03 2007), 647–651. https://doi.org/10.1093/jn/137.3.647 arXiv:https://academic.oup.com/jn/article-pdf/137/3/647/30261856/647.pdf",
      "doi": ""
    },
    {
      "text": "Giannina Ferrara, Jenna Kim, Shuhao Lin, Jenna Hua, Edmund Seto, 2019. A focused review of smartphone diet-tracking apps: usability, functionality, coherence with behavior change theory, and comparative validity of nutrient intake and energy estimates. JMIR mHealth and uHealth 7, 5 (2019), e9232.",
      "doi": ""
    },
    {
      "text": "Jill Freyne and Shlomo Berkovsky. 2010. Recommending Food: Reasoning on Recipes and Ingredients. In UMAP: International Conference on User Modeling, Adaptation, and Personalization. Springer Berlin Heidelberg. https://doi.org/10.1007/978-3-642-13470-8_36",
      "doi": ""
    },
    {
      "text": "Dennis A. Gioia, Kevin G. Corley, and Aimee L. Hamilton. 2013. Seeking Qualitative Rigor in Inductive Research: Notes on the Gioia Methodology. Organizational Research Methods 16, 1 (2013), 15–31. https://doi.org/10.1177/1094428112452151 arXiv:https://doi.org/10.1177/1094428112452151",
      "doi": ""
    },
    {
      "text": "Kazjon Grace and Mary Lou Maher. 2016. Surprise-triggered reformulation of design goals. In Proceedings of the AAAI Conference on Artificial Intelligence, Vol. 30.",
      "doi": ""
    },
    {
      "text": "Kazjon Grace and Mary Lou Maher. 2019. Expectation-Based Models of Novelty for Evaluating Computational Creativity. In Computational Creativity. Springer International Publishing. https://doi.org/10.1007/978-3-319-43610-4_9",
      "doi": ""
    },
    {
      "text": "Kazjon Grace, Mary Lou Maher, Douglas Fisher, and Katherine Brady. 2015. Data-intensive evaluation of design creativity using novelty, value, and surprise. International Journal of Design Creativity and Innovation 3, 3-4(2015), 125–147. https://doi.org/10.1080/21650349.2014.943295 arXiv:https://doi.org/10.1080/21650349.2014.943295",
      "doi": ""
    },
    {
      "text": "Kazjon Grace, Mary Lou Maher, David Wilson, and Nadia Najjar. 2017. Personalised specific curiosity for computational design systems. In Design Computing and Cognition’16. Springer, 593–610.",
      "doi": ""
    },
    {
      "text": "Kazjon Grace, Mary Lou Maher, David C Wilson, and Nadia A Najjar. 2016. Combining CBR and deep learning to generate surprising recipe designs. In International Conference on Case-Based Reasoning. Springer, 154–169.",
      "doi": ""
    },
    {
      "text": "Kazjon Grace, Mary Lou Maher, David C. Wilson, and Nadia A. Najjar. 2016. Combining CBR and deep learning to generate surprising recipe designs. In Lecture Notes in Computer Science (including subseries Lecture Notes in Artificial Intelligence and Lecture Notes in Bioinformatics), A Goel, B Díaz-Agudo, and T Roth-Berghofer (Eds.). Vol. 9969 LNAI. Springer International Publishing, Atlanta, GA, 154–169. https://doi.org/10.1007/978-3-319-47096-2_11",
      "doi": ""
    },
    {
      "text": "Uri Hanani, Bracha Shapira, and Peretz Shoval. 2001. Information Filtering: Overview of Issues, Research and Systems. User modelling and user-adapted interaction 11 (2001), 203–259.",
      "doi": ""
    },
    {
      "text": "Suzanne Hidi and K Ann Renninger. 2006. The four-phase model of interest development. Educational psychologist 41, 2 (2006), 111–127.",
      "doi": ""
    },
    {
      "text": "Eric J Horvitz, Johnson Apacible, Raman Sarin, and Lin Liao. 2012. Prediction, expectation, and surprise: Methods, designs, and study of a deployed traffic forecasting service. arXiv preprint arXiv:1207.1352(2012).",
      "doi": ""
    },
    {
      "text": "Hilary Hutchinson, Wendy Mackay, Bosse Westerlund, Benjamin B. Bederson, Allison Druin, Catherine Plaisant, Michel Beaudouin-Lafon, Stéphane Conversy, Helen Evans, Heiko Hansen, Nicolas Roussel, Björn Eiderbäck, Sinna Lindquist, and Yngve Sundblad. 2003. Technology probes: Inspiring design for and with families. In Conference on Human Factors in Computing Systems - Proceedings. ACM Press, New York, New York, USA, 17–24.",
      "doi": "10.1145/642611.642616"
    },
    {
      "text": "Laurent Itti and Pierre Baldi. 2009. Bayesian surprise attracts human attention. Vision research 49, 10 (2009), 1295–1306.",
      "doi": ""
    },
    {
      "text": "Meng Jiang, Peng Cui, Rui Liu, Qiang Yang, Fei Wang, Wenwu Zhu, and Shiqiang Yang. 2012. Social contextual recommendation. In ACM International Conference Proceeding Series. ACM Press, New York, New York, USA, 45–54. https://doi.org/10.1145/2396761.2396771",
      "doi": "10.1145/2396761.2396771"
    },
    {
      "text": "R Burke Johnson and Anthony J Onwuegbuzie. 2004. Mixed methods research: A research paradigm whose time has come. Educational researcher 33, 7 (2004), 14–26.",
      "doi": ""
    },
    {
      "text": "Marius Kaminskas and Derek Bridge. 2016. Diversity, serendipity, novelty, and coverage: a survey and empirical analysis of beyond-accuracy objectives in recommender systems. ACM Transactions on Interactive Intelligent Systems (TiiS) 7, 1(2016), 1–42.",
      "doi": "10.1145/2926720"
    },
    {
      "text": "Todd B Kashdan and Paul J Silvia. 2009. Curiosity and interest: The benefits of thriving on novelty and challenge. Oxford handbook of positive psychology 2 (2009), 367–374.",
      "doi": ""
    },
    {
      "text": "Todd B Kashdan, Melissa C Stiksma, David J Disabato, Patrick E McKnight, John Bekier, Joel Kaji, and Rachel Lazarus. 2018. The five-dimensional curiosity scale: Capturing the bandwidth of curiosity and identifying four unique subgroups of curious people. Journal of Research in Personality 73 (2018), 130–149.",
      "doi": ""
    },
    {
      "text": "A Katz, S Shetty, and R. Stein. 2020. Social, ethnic, and environmental determinants of obesity. In Obesity and Obstetrics, T Mahmood, S Arulkumaran, and F Chervenak (Eds.). Elsevier Inc.",
      "doi": ""
    },
    {
      "text": "David Comer Kidd and Emanuele Castano. 2013. Reading literary fiction improves theory of mind. Science 342, 6156 (2013), 377–380.",
      "doi": ""
    },
    {
      "text": "Susan M Krebs-Smith, Patricia M Guenther, Amy F Subar, Sharon I Kirkpatrick, and Kevin W Dodd. 2010. Americans do not meet federal dietary recommendations. The Journal of nutrition 140, 10 (2010), 1832–1838.",
      "doi": ""
    },
    {
      "text": "Matevž Kunaver and Tomaž Požrl. 2017. Diversity in recommender systems–A survey. Knowledge-based systems 123 (2017), 154–162.",
      "doi": ""
    },
    {
      "text": "Pan Li, Maofei Que, Zhichao Jiang, YAO HU, and Alexander Tuzhilin. 2020. PURS: Personalized Unexpected Recommender System for Improving User Satisfaction. In Fourteenth ACM Conference on Recommender Systems (Virtual Event, Brazil) (RecSys ’20). Association for Computing Machinery, New York, NY, USA, 279–288. https://doi.org/10.1145/3383313.3412238",
      "doi": ""
    },
    {
      "text": "Jordan A Litman and Paul J Silvia. 2006. The latent structure of trait curiosity: Evidence for interest and deprivation curiosity dimensions. Journal of personality assessment 86, 3 (2006), 318–328.",
      "doi": ""
    },
    {
      "text": "J. Lofland and L.H. Lofland. 1984. Analyzing Social Settings: A Guide to Qualitative Observation and Analysis. Wadsworth Publishing Company. https://books.google.com.au/books?id=1IC2AAAAIAAJ",
      "doi": ""
    },
    {
      "text": "L Macedo, R Reisenzein, and A Cardoso. 2004. Modeling forms of surprise in artificial agents: empirical and theoretical study of surprise functions. In Proceedings of the Annual Meeting of the Cognitive Science Society, Vol. 26. https://www.researchgate.net/publication/228966429_Modeling_forms_of_surprise_in_artificial_agents_empirical_and_theoretical_study_of_surprise_functions",
      "doi": ""
    },
    {
      "text": "Javier Marin, Aritro Biswas, Ferda Ofli, Nicholas Hynes, Amaia Salvador, Yusuf Aytar, Ingmar Weber, and Antonio Torralba. 2021. Recipe1M+: A Dataset for Learning Cross-Modal Embeddings for Cooking Recipes and Food Images. IEEE Transactions on Pattern Analysis and Machine Intelligence 43, 1 (jan 2021). https://doi.org/10.1109/TPAMI.2019.2927476",
      "doi": "10.1109/TPAMI.2019.2927476"
    },
    {
      "text": "Chelsea E Mauch, Rachel A Laws, Ivanka Prichard, Anthony J Maeder, Thomas P Wycherley, and Rebecca K Golley. 2021. Commercially available apps to support healthy family meals: User testing of app utility, acceptability, and engagement. JMIR mHealth and uHealth 9, 5 (2021), e22990.",
      "doi": ""
    },
    {
      "text": "Chelsea E Mauch, Thomas P Wycherley, Rachel A Laws, Brittany J Johnson, Lucinda K Bell, and Rebecca K Golley. 2018. Mobile apps to support healthy family food provision: systematic assessment of popular, commercially available apps. JMIR mHealth and uHealth 6, 12 (2018), e11867.",
      "doi": ""
    },
    {
      "text": "Maryam Mohseni, Mary Lou Maher, Kazjon Grace, Nadia Najjar, Fakhri Abbas, and Omar Eltayeby. 2019. Pique: Recommending a personalized sequence of research papers to engage student curiosity. In International Conference on Artificial Intelligence in Education. Springer, 201–205.",
      "doi": ""
    },
    {
      "text": "Jean-Claude Moubarac, M Batal, M L Louzada, E Martinez Steele, and C A Monteiro. 2016. Consumption of ultra-processed foods predicts diet quality in Canada. Appetite 108(2016), 512–520. https://doi.org/10.1016/j.appet.2016.11.006",
      "doi": ""
    },
    {
      "text": "Elizabeth Murray, Zarnie Khadjesari, Ian White, Eleftheria Kalaitzaki, Christine Godfrey, Jim McCambridge, Simon Thompson, and Paul Wallace. 2009. Methodological challenges in online trials. Journal of Medical Internet Research 11, 2 (2009), e1052.",
      "doi": ""
    },
    {
      "text": "Leonie M Neville, Blythe O’Hara, and Andrew J Milat. 2009. Computer-tailored dietary behaviour change interventions: a systematic review. Health education research 24, 4 (2009), 699–720.",
      "doi": ""
    },
    {
      "text": "Xi Niu, Fakhri Abbas, Mary Lou Maher, and Kazjon Grace. 2018. Surprise Me If You Can: Serendipity in Health Information. In Proceedings of the 2018 CHI Conference on Human Factors in Computing Systems. ACM, New York, NY, USA. https://doi.org/10.1145/3173574.3173597",
      "doi": "10.1145/3173574.3173597"
    },
    {
      "text": "Xi Niu and Ahmad Al-Doulat. 2021. LuckyFind: Leveraging Surprise to Improve User Satisfaction and Inspire Curiosity in a Recommender System. In CHIIR 2021 - Proceedings of the 2021 Conference on Human Information Interaction and Retrieval. Association for Computing Machinery, Inc, 163–172. https://doi.org/10.1145/3406522.3446017",
      "doi": "10.1145/3406522.3446017"
    },
    {
      "text": "A Ortony and D Partridge. 1987. Surprisingness and Expectation Failure: What’s the Difference?. In Proceedings of the 10th International Joint Conference on Artificial Intelligence. Morgan Kaufmann, Los Altos, CA, 106–108.",
      "doi": ""
    },
    {
      "text": "P. Y Oudeyer and F Kaplan. 2009. What is intrinsic motivation? A typology of computational approaches. Frontiers in neurorobotics 1, 6 (2009).",
      "doi": ""
    },
    {
      "text": "M Patton. 1999. Enhancing the quality and credibility of qualitative analysis. Health services research 34 (1999), 1189–1209.",
      "doi": ""
    },
    {
      "text": "Florian Pecune, Lucile Callebert, and Stacy Marsella. 2020. A Socially-Aware Conversational Recommender System for Personalized Recipe Recommendations. In Proceedings of the 8th International Conference on Human-Agent Interaction. 78–86.",
      "doi": "10.1145/3406499.3415079"
    },
    {
      "text": "Reinhard Pekrun. 2019. The murky distinction between curiosity and interest: State of the art and future prospects. Educational Psychology Review 31, 4 (2019), 905–914.",
      "doi": ""
    },
    {
      "text": "M Peters. 1998. Towards Artificial Forms of Intelligence, Creativity, and Surprise. In Proceedings of the Twentieth Annual Conference of the Cognitive Science Society. Mahwah, NJ: Erlbaum, 836–841.",
      "doi": ""
    },
    {
      "text": "Emily Grossnickle Peterson and Jana Cohen. 2019. A case for domain-specific curiosity in mathematics. Educational Psychology Review 31, 4 (2019), 807–832.",
      "doi": ""
    },
    {
      "text": "Claire Petitmengin, Anne Remillieux, and Camila Valenzuela-Moguillansky. 2019. Discovering the structures of lived experience. Phenomenology and the Cognitive Sciences 18, 4 (sep 2019). https://doi.org/10.1007/s11097-018-9597-4",
      "doi": ""
    },
    {
      "text": "Hollie A. Raynor and Leonard H. Epstein. 2001. Dietary variety, energy regulation, and obesity.Psychological Bulletin 127, 3 (2001). https://doi.org/10.1037/0033-2909.127.3.325",
      "doi": ""
    },
    {
      "text": "F Rehman, O Khalid, N Haq, A Khan, K Bilal, and S. Madani. 2017. Diet-Right: A Smart Food Recommendation System. KSII Transactions on Internet and Information Systems 11, 6 (jun 2017). https://doi.org/10.3837/tiis.2017.06.006",
      "doi": ""
    },
    {
      "text": "Robert Saunders and John S Gero. 2001. Artificial creativity: A synthetic approach to the study of creative behaviour. Computational and Cognitive Models of Creative Design V, Key Centre of Design Computing and Cognition, University of Sydney, Sydney (2001), 113–139.",
      "doi": ""
    },
    {
      "text": "Rob Saunders and John S Gero. 2001. A curious design agent: A computational model of novelty-seeking behaviour in design. (2001).",
      "doi": ""
    },
    {
      "text": "Henk G Schmidt and Jerome I Rotgans. 2021. Epistemic curiosity and situational interest: Distant cousins or identical twins?Educational Psychology Review 33 (2021), 325–352.",
      "doi": ""
    },
    {
      "text": "Barry Smyth and Paul McClave. 2001. Similarity vs. Diversity. In ICCBR 2001: Case-Based Reasoning Research and Development, Vol. 2080. Springer Verlag, 347–361. https://doi.org/10.1007/3-540-44593-5_25",
      "doi": ""
    },
    {
      "text": "Alain Starke, Edis Asotic, and Christoph Trattner. 2021. “Serving Each User”: Supporting Different Eating Goals Through a Multi-List Recommender Interface. In Fifteenth ACM Conference on Recommender Systems. 124–132.",
      "doi": "10.1145/3460231.3474232"
    },
    {
      "text": "NP Steyn, JH Nel, G Nantel, G Kennedy, and D Labadarios. 2006. Food variety and dietary diversity scores in children: are they good indicators of dietary adequacy?Public Health Nutrition 9, 5 (aug 2006), 644–650. https://doi.org/10.1079/phn2005912",
      "doi": ""
    },
    {
      "text": "Deirdre Timlin, Jacqueline M McCormack, Maeve Kerr, Laura Keaver, and Ellen EA Simpson. 2020. Are dietary interventions with a behaviour change theoretical framework effective in changing dietary patterns? A systematic review. BMC public health 20, 1 (2020), 1–18.",
      "doi": ""
    },
    {
      "text": "B. Uzzi, S. Mukherjee, M. Stringer, and B. Jones. 2013. Atypical Combinations and Scientific Impact. Science 342, 6157 (oct 2013). https://doi.org/10.1126/science.1240474",
      "doi": ""
    },
    {
      "text": "Maya Vadiveloo, L Beth Dixon, Tod Mijanovich, Brian Elbel, and Niyati Parekh. 2015. Dietary variety is inversely associated with body adiposity among US adults using a novel food diversity index. The Journal of nutrition 145, 3 (2015), 555–563.",
      "doi": ""
    },
    {
      "text": "Saúl Vargas and Pablo Castells. 2014. Improving sales diversity by recommending users to items. In Proceedings of the 8th ACM Conference on Recommender systems - RecSys ’14. ACM Press, New York, New York, USA. https://doi.org/10.1145/2645710.2645744",
      "doi": "10.1145/2645710.2645744"
    },
    {
      "text": "Sanne Vrijenhoek, Mesut Kaya, Nadia Metoui, Judith Möller, Daan Odijk, and Natali Helberger. 2021. Recommenders with a mission: assessing diversity in news recommendations. In Proceedings of the 2021 Conference on Human Information Interaction and Retrieval. 173–183.",
      "doi": "10.1145/3406522.3446019"
    },
    {
      "text": "L. S. Vygotsky. 1978. Mind in society: the development of higher psychological processes. Harvard University Press, Massachusetts.",
      "doi": ""
    },
    {
      "text": "Chauncey Wilson. 2014. Chapter 2 - Semi-Structured Interviews. In Interview Techniques for UX Practitioners, Chauncey Wilson (Ed.). Morgan Kaufmann, Boston, 23–41. https://doi.org/10.1016/B978-0-12-410393-1.00002-8",
      "doi": ""
    },
    {
      "text": "Yuan Cao Zhang, Diarmuid Ó Séaghdha, Daniele Quercia, and Tamas Jambor. 2012. Auralist: introducing serendipity into music recommendation. In Proceedings of the fifth ACM international conference on Web search and data mining - WSDM ’12. ACM Press, New York, New York, USA, 13–22. https://doi.org/10.1145/2124295.2124300",
      "doi": "10.1145/2124295.2124300"
    },
    {
      "text": "Pengfei Zhao and Dik Lun Lee. 2016. How Much Novelty is Relevant?. In Proceedings of the 39th International ACM SIGIR conference on Research and Development in Information Retrieval. ACM, New York, NY, USA. https://doi.org/10.1145/2911451.2911488",
      "doi": "10.1145/2911451.2911488"
    },
    {
      "text": "Pengfei Zhao and Dik Lun Lee. 2016. How much novelty is relevant? it depends on your curiosity. In Proceedings of the 39th International ACM SIGIR conference on Research and Development in Information Retrieval. 315–324.",
      "doi": "10.1145/2911451.2911488"
    },
    {
      "text": "Xiangmin Zhou, Ji Zhang, and Yanchun Zhang. 2019. The 1st International Workshop on Context-Aware Recommendation Systems with Big Data Analytics (CARS-BDA). In Proceedings of the Twelfth ACM International Conference on Web Search and Data Mining. ACM, New York, NY, USA. https://doi.org/10.1145/3289600.3291372",
      "doi": ""
    }
  ]
}