{
  "doi": "10.1145/3491102.3502013",
  "title": "Six Facets of Facilitation: Participatory Design Facilitators’ Perspectives on Their Role and Its Realization",
  "published": "2022-04-29",
  "proctitle": "CHI '22: Proceedings of the 2022 CHI Conference on Human Factors in Computing Systems",
  "pages": "1-14",
  "year": 2022,
  "badges": [
    "Honorable Mention"
  ],
  "abstract": "Participatory design facilitators have a significant impact on participatory activities, processes, and outcomes. However, the facilitator role has not yet been thoroughly debated in existing design discourse, and support for role-related reflections is limited. As the first steps towards an enriched collective understanding of this specific role and its realization, we interviewed 14 respondents with an academic background in participatory design and extensive facilitation experience. Based on a content analysis of the interviews, we identified six facets of the role: (1) trust builder, (2) enabler, (3) inquirer, (4) direction setter, (5) value provider, and (6) users’ advocate. Each facet is presented as consisting of the respondents’ perceived associated responsibilities and corresponding strategies. Our results paint a complex picture of participatory design facilitation. We propose the multi-faceted understanding of the facilitator role emerging from this work as a basis for problematized reflection on the role and its realization.",
  "authors": [
    {
      "name": "Yngve Dahl",
      "institution": "Department of Computer Science, NTNU, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "81385598241",
      "orcid": "missing"
    },
    {
      "name": "Kshitij Sharma",
      "institution": "Department of Computer Science, NTNU, Norway",
      "img": "/pb-assets/icons/DOs/default-profile-1543932446943.svg",
      "acmid": "99658658374",
      "orcid": "missing"
    }
  ],
  "references": [
    {
      "text": "Liam Bannon, Jeffrey Bardzell, and Susanne Bødker. 2018. Introduction: Reimagining Participatory Design—Emerging Voices. Association for Computing Machinery.",
      "doi": "10.1145/3177794"
    },
    {
      "text": "Gro Bjerknes and Tone Bratteteig. 1995. User participation and democracy: a discussion of Scandinavian research on systems development. Scand. J. Inf. Syst. 7, 1, 73–98.",
      "doi": "10.5555/211288.211293"
    },
    {
      "text": "Alan Borning and Michael Muller. 2012. Next steps for value sensitive design. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, Association for Computing Machinery.",
      "doi": "10.1145/2207676.2208560"
    },
    {
      "text": "Tone Bratteteig and Ina Wagner. 2016. Unpacking the Notion of Participation in Participatory Design. Comput. Supported Coop. Work. 25, 6, 425-475. http://dx.doi.org/10.1007/s10606-016-9259-4",
      "doi": "10.1007/s10606-016-9259-4"
    },
    {
      "text": "Susanne Bødker, Morten Kyng, Pelle Ehn, John Kammersgaard, and Yngve Sundblad. 1987. A Utopian Experience: On design of Powerful Computer-based tools for skilled graphic workers. In Computers and democracy: A Scandinavian challenge, Aldershot: Avebury, UK.",
      "doi": ""
    },
    {
      "text": "Michela Cozza, Augusto Cusinato, and Andreas Philippopoulos-Mihalopoulos. 2020. Atmosphere in Participatory Design. Science as Culture. 29, 2, 269-292. http://dx.doi.org/10.1080/09505431.2019.1681952",
      "doi": ""
    },
    {
      "text": "Yngve Dahl and Geir Kjetil Hanssen. 2016. Breaking the Sound Barrier: Designing for Patient Participation in Audiological Consultations. In Proceedings of the 2016 CHI Conference on Human Factors in Computing Systems, Association for Computing Machinery.",
      "doi": "10.1145/2858036.2858126"
    },
    {
      "text": "Yngve Dahl and Dag Svanæs. 2020. Facilitating Democracy: Concerns from Participatory Design with Asymmetric Stakeholder Relations in Health Care. In Proceedings of the 2020 CHI Conference on Human Factors in Computing Systems, Association for Computing Machinery.",
      "doi": "10.1145/3313831.3376805"
    },
    {
      "text": "Ana Maria Bustamante Duarte, Nina Brendel, Auriol Degbelo, and Christian Kray. 2018. Participatory Design and Participatory Research An HCI Case Study with Young Forced Migrants. ACM Trans. Comput.-Hum. Interact. 25, 1, Article 3. http://dx.doi.org/10.1145/3145472",
      "doi": ""
    },
    {
      "text": "Kim Halskov and Nicolai Brodersen Hansen. 2015. The diversity of participatory design research practice at PDC 2002-2012. Int. J. Hum.-Comput. Stud. 74, C, 81-92. http://dx.doi.org/10.1016/j.ijhcs.2014.09.003",
      "doi": "10.1016/j.ijhcs.2014.09.003"
    },
    {
      "text": "Foad Hamidi, Melanie Baljko, and Isabel Gómez. 2017. Using Participatory Design with Proxies with Children with Limited Communication. In Proceedings of the 19th International ACM SIGACCESS Conference on Computers and Accessibility, 250–259. http://dx.doi.org/10.1145/3132525.3132527",
      "doi": "10.1145/3132525.3132527"
    },
    {
      "text": "Christina N. Harrington, Katya Borgos-Rodriguez, and Anne Marie Piper. 2019. Engaging Low-Income African American Older Adults in Health Discussions through Community-based Design Workshops. In Proceedings of the 2019 CHI Conference on Human Factors in Computing Systems, Association for Computing Machinery.",
      "doi": "10.1145/3290605.3300823"
    },
    {
      "text": "Denny Kwok-leung Ho, Jin Ma, and Yanki Lee. 2011. Empathy @ design research: a phenomenological study on young people experiencing participatory design for social inclusion. CoDesign. 7, 2, 95-106. http://dx.doi.org/10.1080/15710882.2011.609893",
      "doi": ""
    },
    {
      "text": "Harald Holone and Jo Herstad. 2013. Three tensions in participatory design for inclusion. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 2903-2906. http://dx.doi.org/10.1145/2470654.2481401",
      "doi": "10.1145/2470654.2481401"
    },
    {
      "text": "Sofia Hussain. 2013. Ethical Leadership in Participatory design. In IASDR 2013: 5th Intl Congress of the Intl Association of Societies of Design Research,",
      "doi": ""
    },
    {
      "text": "Sampsa Hyysalo, Virve Hyysalo, and Louna Hakkarainen. 2019. The Work of Democratized Design in Setting-up a Hosted Citizen-Designer Community. International Journal of Design. 13, 1.",
      "doi": ""
    },
    {
      "text": "ISO 9241-210. 2019. Ergonomics of human-system interaction — Part 210: Human-centred design for interactive systems. International Organization for Standardization.",
      "doi": ""
    },
    {
      "text": "Janet Kelly. 2019. Towards ethical principles for participatory design practice. CoDesign. 15, 4, 329-344. http://dx.doi.org/10.1080/15710882.2018.1502324",
      "doi": ""
    },
    {
      "text": "Finn Kensing and Joan Greenbaum. 2013. Heritage: having a say. In Routledge International Handbook of Participatory Design, Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Steinar Kvale. 1994. Ten standard objections to qualitative research interviews. Journal of Phenomenological Psychology, 25(2). 25, 2, 147–173. https://doi.org/10.1163/156916294X00016",
      "doi": ""
    },
    {
      "text": "Kung Jin Lee, 2021. The Show Must Go On: A Conceptual Model of Conducting Synchronous Participatory Design With Children Online. In Proceedings of the 2021 CHI Conference on Human Factors in Computing Systems, Article 345. http://dx.doi.org/10.1145/3411764.3445715",
      "doi": "10.1145/3411764.3445715"
    },
    {
      "text": "Ann Light and Yoko Akama. 2012. The human touch: participatory practice and the role of facilitation in designing with communities. In Proceedings of the 12th Participatory Design Conference: Research Papers - Volume 1, 61-70. http://dx.doi.org/10.1145/2347635.2347645",
      "doi": "10.1145/2347635.2347645"
    },
    {
      "text": "Stephen Lindsay, 2012. Empathy, participatory design and people with dementia. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 521-530. http://dx.doi.org/10.1145/2207676.2207749",
      "doi": "10.1145/2207676.2207749"
    },
    {
      "text": "Rachael Luck. 2007. Learning to talk to users in participatory design situations. Design Studies. 28, 3, 217-242. http://dx.doi.org/10.1016/j.destud.2007.02.002",
      "doi": ""
    },
    {
      "text": "Donald A. Norman and Stephen W. Draper. 1986. User Centered System Design; New Perspectives on Human-Computer Interaction. L. Erlbaum Associates Inc.",
      "doi": "10.5555/576915"
    },
    {
      "text": "Briony J Oates. 2006. Researching Information Systems and Computing. Sage Publications Ltd.",
      "doi": "10.5555/1202299"
    },
    {
      "text": "Suvi Pihkala and Helena Karasti. 2016. Reflexive engagement: enacting reflexivity in design and for 'participation in plural'. In The 14th Participatory Design Conference: Full papers - Volume 1, 21-30. http://dx.doi.org/10.1145/2940299.2940302",
      "doi": "10.1145/2940299.2940302"
    },
    {
      "text": "Toni Robertson and Jesper Simonsen. 2013. Participatory Design: An introduction. In Routledge International Handbook of Participatory Design, Routledge, London, UK.",
      "doi": ""
    },
    {
      "text": "Donald A. Schön. 1983. The Reflective Practitioner: How Professionals Think in Action. New York: Basic Books.",
      "doi": ""
    },
    {
      "text": "Petr Slovák, Christopher Frauenberger, and Geraldine Fitzpatrick. 2017. Reflective Practicum: A Framework of Sensitising Concepts to Design for Transformative Reflection. In Proceedings of the 2017 CHI Conference on Human Factors in Computing Systems, 2696-2707. http://dx.doi.org/10.1145/3025453.3025516",
      "doi": "10.1145/3025453.3025516"
    },
    {
      "text": "Lucy Suchman. 2002. Located accountabilities in technology production. Scand. J. Inf. Syst. 14, 2, 91–105.",
      "doi": "10.5555/782686.782694"
    },
    {
      "text": "Dag Svanæs and Gry Seland. 2004. Putting the users center stage: role playing and low-fi prototyping enable end users to design mobile systems. In Proceedings of the SIGCHI Conference on Human Factors in Computing Systems, 479-486. http://dx.doi.org/10.1145/985692.985753",
      "doi": "10.1145/985692.985753"
    },
    {
      "text": "Maja van der Velden and Christina Mörtberg. 2021. Participatory Design and Design for Values. In Handbook of Ethics, Values, and Technological Design: Sources, Theory, Values and Application Domains, Springer Netherlands, Dordrecht.",
      "doi": ""
    },
    {
      "text": "Tom Wakeford and Michel Pimbert. 2013. Opening participatory democracy's black box: Facilitation as creative bricolage. In Problems of participation: Reflections on authority, democracy and the struggle for common life, ARN Press, UK.",
      "doi": ""
    },
    {
      "text": "Øivind Klungseth Zahlsen, Dag Svanæs, and Yngve Dahl. 2021. Facilitating User Involvement in a Large IT Project: A Comparison of Facilitators’ Perspectives on Process, Role and Personal Practice. In INTERACT 2021, Bari Italy,",
      "doi": ""
    },
    {
      "text": "Øivind Klungseth Zahlsen, Dag Svanæs, Arild Faxvaag, and Yngve Dahl. 2020. Understanding the Impact of Boundary Conditions on Participatory Activities. In Proceedings of the 11th Nordic Conference on Human-Computer Interaction: Shaping Experiences, Shaping Society, Article 81. http://dx.doi.org/10.1145/3419249.3420129",
      "doi": "10.1145/3419249.3420129"
    }
  ]
}